{
  "content": [
    {
      "type": "text",
      "text": "# Byway (United Kingdom)\n\n, Northants.]]\nA byway in the United Kingdom is a track, often rural, which is too minor to be called a road. These routes are often unsurfaced, typically having the appearance of 'green lanes'. Despite this, it is legal (but may not be physically possible) to drive any type of vehicle along certain byways, the same as any ordinary tarmac road.\nIn 2000 the legal term 'restricted byway' was introduced to cover rights of way along which it is legal to travel by any mode (including on foot, bicycle, horse-drawn carriage etc.) but excluding 'mechanically propelled vehicles'.\nAccess rights\nByway open to all traffic\nIn England & Wales, a byway open to all traffic (BOAT) is a highway over which the public have a right of way for vehicular and all other kinds of traffic but which is used by the public mainly for the purposes for which footpaths and bridleways are used (i.e. walking, cycling or horse riding (United Kingdom Road Traffic Regulation Act 1984, section 15(9)(c), as amended by Road Traffic (Temporary Restrictions) Act 1991, Schedule 1). Byways account for less than 2% of England's unsurfaced rights of way network, the remainder being footpaths and bridleways.\nA byway open to all traffic is sometimes waymarked using a red arrow on a metal or plastic disc or by red paint dots on posts and trees.\nByways can be found using the Council definitive map or a third party mapping software such as SmartTrail by All Terrain UK. Currently BOATs total over 10,000 separate routes making up over 3,200 route miles in total.\nRestricted byways\nOn 2 May 2006 the Countryside and Rights of Way Act 2000 reclassified all remaining roads used as public paths as restricted byways. The public's rights along a restricted byway are to travel:\n*on foot\n*on horseback or leading a horse\n*by vehicle other than mechanically propelled vehicles (thus permitting e.g. bicycles, horse-drawn carriages, to travel along restricted byways), except in certain circumstances.\nA restricted byway may be waymarked with a plum or purple arrow. Currently over 11,500 separate restricted byways make up over 3,260 route miles in England and Wales.\nNature and history of byways\nSome byways that have not been over-modernised retain traces of the aggers or ditches that originally ran along each side of the lane; good examples of this can be seen along the side of the Roman \"Ermine Street\" in Lincolnshire. By contrast, straight enclosure roads which were laid out between 1760 and 1840 run through the then newly enclosed lands with straight walls or hedges.\nMany former Roman roads were later designated as parish boundaries unlike the newer enclosure roads which rarely ran along boundaries but were solely designed to give access from a village to its newly enclosed fields and to the neighbouring villages. The latter can often be seen to bend and change width at the parish boundary: this reflects the work of the different surveyors who had each built a road from a village to its boundary. If the roads did not meet up exactly, which was quite common, a sharp double bend would result.\nSee also\n* Country lane\n* Dirt road\n* Rights of way in England and Wales\n* Rights of way in Scotland\n* Road\nReferences\nExternal links\n* [https://www.levenshistory.co.uk/highways-and-byways.html Highways and byways]\n* [https://www.legendsofamerica.com/byways-trails/ Byways & Historic Trails]"
    }
  ]
}