{
  "content": [
    {
      "type": "text",
      "text": "# C. Howard Wilkins Jr.\n\n| birth_place         = Witchita, Kansas\n| death_date          =\n| death_place         =\n| spouse              =\n| children            =\n| party               = Republican\n| education           = Yale University\n}}\nCalvin Howard Wilkins Jr. (February 19, 1938 – December 24, 2016) was an American businessman and political fundraiser who served as United States Ambassador to the Netherlands.\nLife and career\nCalvin Howard Wilkins Jr. was born in Wichita, Kansas on February 19, 1938. He graduated from Yale University in 1960 and began a business career.\nIn 1966, Wilkins bought the Pizza Hut franchise in Kentucky, and in less than two years he added 16 restaurants. He then sold his restaurants to the parent corporation, which he joined as Vice President for International Operations. The company's first restaurants outside the United States were built during his tenure, and in 1970 he left the company to become President of Pizza Corporation of America, and later Maverick Development Corporation. He operated 270 Pizza Hut restaurants in the United States and overseas, and later moved on to franchises of other name brand restaurants.\nA Republican, Wilkins was a donor and fundraiser for the 1976 presidential campaign of Gerald Ford. In the 1980s, he served as a member of the board of directors of the Synthetic Fuels Corporation.\nHe was also major donor to and fundraiser for the 1988 presidential campaign of George H. W. Bush. From 1989 to 1992, he served as Bush's Ambassador to the Netherlands.\nWilkins has continued as a contributor to and fundraiser for several presidential candidates, including: Bob Dole; Elizabeth Dole; George W. Bush; Rudy Giuliani; John McCain; and Mitt Romney. He has also been involved in several campaigns for the United States Senate, which included those of: William Weld; Elizabeth Dole; George Allen; Roy Blunt; and Michael Steele. He has also been involved with several campaign committees, to include: Grow PAC; the Leadership Circle PAC; Campaign America PAC; and the National Republican Senatorial Committee.\nWilkins also continued his business career, including partnerships and board of directors memberships for Panera Bread, Amarillo Mesquite Grill Inc., Siemens Water Technologies Corp. and other companies.\nAmbassador Wilkins and his family are also philanthropists, and their activities include a charitable organization, the C. Howard Wilkins Foundation and establishing women's softball and basketball scholarships at Wichita State University. Wilkins died on December 24, 2016, at the age of 78.\nReferences\nExternal resources\n* [https://history.state.gov/departmenthistory/people/wilkins-c-howard C. Howard Wilkins Appointment History], Office of the Historian, U.S. Department of State, accessed January 1, 2013"
    }
  ]
}