{
  "content": [
    {
      "type": "text",
      "text": "# C. Ward Crampton\n\nCharles Ward Crampton (26 May 1877 – 20 October 1964) was an American geriatrician, physical culturist and advocate of preventive healthcare.\nCrampton was educated at City College and New York University and graduated in 1900 from the College of Physicians and Surgeons. He was a teacher of physical training at DeWitt Clinton High School and managed the physical training department at Commerce High School.\nCrampton was Director of the Health Service Clinic Health at the Post-Graduate Medical Hospital of New York where he was a professor of medicine. He was Chairman of the New York County Medical Society's Committee on Preventive Medicine. He was President of New York Council of the Boy Scouts of America and was Chairman of the Committee on Health Examinations of the New York State Medical Society. Crampton was director of physical training for the New York Board of Education from 1910 to 1919.\nCrampton invented the Crampton Test (also known as the Crampton Test for Fatal Shock), which measures the physical condition and resistance of one's pulse and blood pressure. He was executive secretary of Public Schools Athletic League from 1908 to 1920 and was in charge of medical volunteers who examined the Byrd Antarctic Expedition in 1930. Crampton was a column writer for Boys’ Life magazine. He was a major in the United States Medical Reserve and during World War I was a Special Adviser to the Department of the East. He received the Silver Buffalo Award in 1941. In 1952, he was inducted as an Associate Fellow in the prestigious National Academy of Kinesiology (formerly American Academy of Physical Education; American Academy of Kinesiology and Physical Education).\nCrampton authored many works on dancing, hygiene, physical culture and physical training. He did pioneering research into the use of vitamin A in the treatment of colds.\nSelected publications\n*[https://catalog.hathitrust.org/Record/006567874 Dancing for Men] (1908)\n*[https://catalog.hathitrust.org/Record/100483664 Applied Ideals in Work With Boys] (1910)\n*[https://archive.org/details/pedagogyofphysic00cramiala/page/n5/mode/2up The Pedagogy of Physical Training] (1922)\n*[https://archive.org/details/physicalexercise00cram/page/n7/mode/2up Physical Exercise for Daily Use] (1924)\n*Daily Health Builder (1928)\n*[https://springfieldcollege.contentdm.oclc.org/digital/collection/p15370coll2/id/10236/ Keeping Physically Fit] (1935)\n*''Boy's Book of Strength (1936)\n*[https://tahomaclinic.com/Private/Articles4/Influenza/Crampton%201944%20-%20Vitamins%20A%20and%20D%20in%20the%20treatment%20of%20colds.pdf Vitamin Aid in the Treatment of Colds] (1944)\n*[https://catalog.hathitrust.org/Record/003333121 Live Long and Like It''] (1948)\nReferences"
    }
  ]
}