{
  "content": [
    {
      "type": "text",
      "text": "# Cabin Creek battlefield\n\nTwo American Civil War military engagements were fought at the Cabin Creek battlefield in the Cherokee Nation within Indian Territory.  The location was where the Texas Road crossed Cabin Creek, near the present-day town of Big Cabin, Oklahoma. Both the First Battle of Cabin Creek and the Second Battle of Cabin Creek were launched by the Confederate Army to disrupt Union Army supply trains.\nThe first was a raid by a Confederate Army detachment on a Union Army supply train bound for Fort Gibson in July 1863. It failed to stop the Union detachment, which enabled the Union to succeed in winning the Battle of Honey Springs later that month. The second engagement, in September, 1864, again a Confederate raid on a Union supply train, resulted in the Confederates capturing over a million dollars' worth of mules, wagons and supplies. However, this was too late to have a strategic impact on the outcome of the war. Confederate General Stand Watie led the attackers during both raids.\nPreserving the battlefield\n.]]\nA young Cherokee named Joseph Martin acquired land on Cabin Creek in 1840. This would become his headquarters for a ranch named Pensacola that he developed over the next twenty years containing over . By 1860, he had also developed a station on his property along the Texas Road, where travelers to Texas could buy provisions and have their wagons repaired. A part of this land would become the Cabin Creek battleground.\nThere was little interest in preserving the site of these two battles until 1958. That was when the  Vinita Chapter of the United Daughters of the Confederacy (UDC) decided to buy  a  plot of ground that now considered the core of the battlefield. The group approached the landowner about the proposed purchase and agreed on a price of $300. The UDC chapter spent the next three years raising funds and finalized the purchase in 1961. They donated the land to the Oklahoma Historical Society later in the same year.\nThe same UDC chapter donated a monument to the Confederate victory of 1864 to celebrate the 100th anniversary of the event. The OHS created a circle drive within the park and added some small monuments that commemorated the battle positions of the two forces. Interest in the park waned for a number of years and maintenance was neglected. Many monuments were vandalized.\nIn 1992, the OHS and the Grand Lake Chamber of Commerce jointly sponsored a reenactment of the battles. It was considered a success, drawing about 15,000 visitors, with reenactors coming from many parts of the United States. Encouraged by the public response, the OHS proposed to repeat the event every three years. A non-profit organization named \"The Friends of Cabin Creek Battlefield, Inc.\" was formed to clean up the park, repair the damaged monuments, and add trash cans and park benches. A day-use only policy was put into effect, with the park gates unlocked in the morning and locked in the evenings 365 days a year.\nThe American Battlefield Trust and its partners acquired an additional  in 2011, so that the park now covers most of the original battlefield of the First Battle of Cabin Creek. A local newspaper reported that additional improvements were needed, such as interpretive trails and exhibits detailing the conflicts within the Native American tribes that exacerbated the effects of the war. The paper titled the article as \"The Third Battle of Cabin Creek.\"\nSee also\n* List of battles fought in Oklahoma\nNotes\nReferences\nExternal links\n* [http://www.okhistory.org/publications/enc/entry.php?entry=CA001 Encyclopedia of Oklahoma History and Culture – Cabin Creek, Battle of]"
    }
  ]
}