{
  "content": [
    {
      "type": "text",
      "text": "# Caborn-Welborn culture\n\nCaborn-Welborn was a precontact and proto-historic North American culture defined by archaeologists as a Late Mississippian cultural manifestation that grew out of – or built upon the demise of – the Angel chiefdom located in present-day southern Indiana. Caborn-Welborn developed around 1400 and seems to have disappeared around 1700 CE. The Caborn-Welborn culture was the last Native American occupation of southern Indiana prior to European contact. It remains unclear which post-contact Native group, if any, are their descendants. It's likely they were the Taarsite identified by the French in 1682 at the confluence of the Wabash and the Ohio, Muller, Jon. “Late Mississippian and Historic.” In Archaeology of the Lower Ohio River Valley, 253–272. New York: Routledge, 2009. . possibly ancestral to some portions of the Dhegihan Siouan speaking peoples, like the Quapaw, Omaha, Ponca and Osage.\nLocation\nThe Caborn-Welborn culture created a cluster of more than 80 sites located mostly on ridges along the Wabash and Ohio rivers from Geneva, Kentucky, to the mouth of the Saline River. Most are concentrated near the confluence of the Ohio and Wabash rivers. The sites range in size from  to  for the larger villages. Most sites are located on the higher flood plain ridges, usually situated near sloughs and swamps. The Ohio River floodplain of this region has an extensive system of natural levees which parallel the river, with sloughs and swampy areas in between the levees.\nSites\n* Ashworth Archaeological Site (12 Po 7) – Located in Posey County, Indiana and placed on the National Historic Register in 1985.\n* Bone Bank site – The site was a large village on the Wabash River in Posey County. It was nicknamed \"Bone Bank\" for the large number of remains of graves washed out of the site in the 19th century. It was established early in the Caborn-Welborn phase, about 1400.\n* Hovey Lake-Klein Archeological Site (12 Po 10) – The site is located on the west bank of a backwater lake near the Ohio River. It was established about 1400.\n* Murphy archaeological site (12 Po 1) – Located in Posey County, Indiana and placed on the National Historic Register in 1975. Also known as the Sullivan Farm site and the Mouth-of-the-Wabash site.\n* Slack Farm site – A large village near the mouth of the Wabash River in Union County, Kentucky.\n* Welborn Village Archeological Site (12 Po 19), also known as the Murphy's Landing site – located in Posey County.\nTimeline\nAn internal temporal subdivision for the Caborn-Welborn culture, based on ceramic decorative attributes and the presence of European trade goods.\n{| class=\"wikitable plainrowheaders\"\n|-\n! scope=\"col\" | Subdivisions\n! scope=\"col\" | Dates\n! scope=\"col\" | Markers and sites\n|-\n! scope=\"row\" | Late Caborn-Welborn\n| 1600–1700\n| Protohistoric period. Presence of European trade goods. Sites include Slack Farm, Murphy, Cummings and Blackburn.\n|-\n! scope=\"row\" | Middle Caborn-Welborn\n| 1450–1600\n| Sites include Slack Farm, Mulligan, Caborn, Alzey, Hart, Hooper, Ries-Hasting, Sites 15He37.1, 15He38, 15Un101, and 15Un96.\n|-\n! scope=\"row\" | Early Caborn-Welborn\n| 1400–1450\n| Angel to Caborn-Welborn transition. Sites include Slack Farm, Murphy, Welborn, Mann, Hovey Lake and Gough\n|-\n|}\nMaterial culture\nPottery\nPottery made by the Caborn-Welborn women was built up from strips of clay, and then smoothed out by the potter, much like other pottery in the Eastern America area, where the potters wheel was unknown. Common vessel shapes include jars, bowls, pans, plates and funnels. Most jars tend to have rims with rounded necks and strap handles. The majority of the pottery found at Caborn-Welborn sites are of the kinds known as Mississippian Plain and Bell Plain, which are varieties very common to most Mississippian cultures throughout the Ohio and Mississippi River valleys. It was buff colored, contains large fragments of ground mussel shell as a tempering agent, and is not as smooth and polished as other varieties.\nCertain unique kinds of pottery and decorations define the Caborn-Welborn people as distinct from other cultures. Caborn-Welborn Decorated, Kimmswick Fabric Impressed, and Kimmswick Plain are varieties which are present in greater frequencies in Caborn-Welborn sites, and are hallmarks of the culture. Effigy jars, both of humans and animals, are also common in Caborn-Welborn sites. Some have a human or animal head and sometimes a tail attached to the rim, while others are shaped into the forms of heads, with attached clay lugs to represent limbs. Caborn-Welborn Decorated, the most commonly found decorated ceramic style, is characterized by incised or punctated lines on the shoulders of the jar forms. Other less common varieties found are indicative of continuity from preceding Lower Ohio Valley cultures and contact with the wider Mississippian world, especially the Central Mississippi valley and the Oneota culture. These types include Old Town Red, ''O'Byam Incised/Engraved, Manly Punctate, Angel/Kincaid Negative Painted, Beckwith Incised, Barton Incised, Ranch Incised-Like, Parkin Punctate, Campbell Punctate, Walls Engraved, and Vernon Paul Applique.\nAgriculture and food\nMaize was the main foodstuff grown by the Caborn-Welborn people\nThe people of Caborn-Welborn were intensely involved in maize agriculture, as well as other food crops originating in the Americas, such as beans, squash, sunflowers and gourds. The addition of beans to their diet came after the demise of the Angel Phase peoples thought to have preceded the Caborn-Welborn. It would have been a valuable source of protein to add to their maize-rich diet. Maize lacks the amino acids lysine and tryptophan, which the body needs to make proteins and niacin, but beans contain both; therefore, the two foods can be combined to make complete proteins and a balanced diet. They collected local wild foodstuffs, including a variety of nuts such as hickory, black walnut, pecans, and acorns, as well as fleshy fruits and berries such as persimmon, pawpaw, and plums. The hunting of whitetail deer, bison, squirrel, rabbit, turkey, opossum and beaver added vital protein to their diet. However, unlike other Mississippian peoples in the central Mississippi Valley, they did not eat quantities of fish and waterfowl as part of their diet.\nEuropean trade goods\nGlass trade beads of the type used by the Spanish\nBy the final phase of Caborn-Welborn culture, European trade items began to be included among grave goods. These included copper and brass tubes, glass beads, and bracelets. This is not indicative of direct European contact, however. The items could have made their way to the Caborn-Welborn area by the native traders along the routes which had brought exotic materials such as marine shells and native copper from other regions to the area for centuries.\nBut with the traders contracted and carried European diseases such as smallpox and measles, which generally penetrated the American continents far in advance of European-manned expeditions. With little or no immunity to the new European diseases, many Native cultures died or were severely disrupted before the Europeans made direct physical contact with them. The Caborn-Welborn culture was probably one such group. This, combined with Iroquoian raids to the north, likely spelt their dissolution and movement away from the confluence region.\nSee also\n* Angel Mounds\n* List of Mississippian sites\nReferences"
    }
  ]
}