{
  "content": [
    {
      "type": "text",
      "text": "# Caitlyn Edwards\n\n| birth_place = Thornlie, Western Australia\n| originalteam = East Fremantle (WAWFL)\n| draftpick = No. 43, 2016 national draft\n| debutdate = Round 1, 2017\n| debutteam =\n| debutopponent =\n| debutstadium = IKON Park\n| height = 167 cm\n| weight =\n| position = Defender\n| currentclub =\n| guernsey =\n| years1 = 2017–2018\n| club1 =\n| games_goals1 = 14 (6)\n| statsend = the 2018 season\n| careerhighlights =\n}}\nCaitlyn Edwards (born 27 June 1996) is a former Australian rules footballer who played for the Collingwood Football Club in the AFL Women's (AFLW).\nEarly life and state football\nEdwards grew up in Thornlie, Western Australia, playing netball before getting into footy because her mother and brother played footy. When she was 10 she joined the local junior football club and at Thornlie played with Clem Smith. At the age of 14 she had to move to the women's team and in her first season won a premiership. Following that she joined WAWFL club East Fremantle with which she played for four years. During her time at East Fremantle, Edwards also played for  in the 2014 and 2015 exhibition matches, won the 2014 best & fairest award, and was twice an All-Australian. In the 2016 season, she also juggled rugby commitments and relied on her from previous years for the AFLW draft.\nDuring the off-season between the 2017 and 2018 AFLW seasons, Edwards played for East Fremantle and for RugbyWA club Palmyra.\nAFL Women's career\nEdwards made her debut in round 1, 2017, in the inaugural AFLW match at IKON Park against . she played every game of the inaugural season, but said at the end that there is a lot of room for improvement.\nCollingwood re-signed Edwards for the 2018 season during the trade period in May 2017.\nFollowing the 2018 season, Edwards retired from football to pursue her rugby career.\nStatistics\n:Statistics are correct to the end of the 2018 season.\n|-\n! scope=\"row\" style=\"text-align:center\" | 2017\n|style=\"text-align:center;\"|\n| 1 || 7 || 2 || 2 || 37 || 19 || 56 || 10 || 14 || 0.3 || 0.3 || 5.3 || 2.7 || 8.0 || 1.4 || 2.0\n|-\n! scope=\"row\" style=\"text-align:center\" | 2018\n|style=\"text-align:center;\"|\n| 1 || 7 || 4 || 1 || 48 || 34 || 82 || 16 || 34 || 0.6 || 0.1 || 6.9 || 4.9 || 11.7 || 2.3 || 4.9\n|- class=\"sortbottom\"\n! colspan=3| Career\n! 14\n! 6\n! 3\n! 85\n! 53\n! 138\n! 26\n! 48\n! 0.4\n! 0.2\n! 6.1\n! 3.8\n! 9.9\n! 1.9\n! 3.4\n|}\nReferences\nExternal links\n*"
    }
  ]
}