{
  "content": [
    {
      "type": "text",
      "text": "# Calcium, Queensland\n\n| pop                 = 12\n| pop_year            =\n| pop_footnotes       =\n| established         =\n| postcode            = 4816\n| area                = 130.5\n| timezone            = AEST\n| utc                 = +10:00\n| dist1               = 12.9\n| dir1                = SSW\n| location1           = Woodstock\n| dist2               = 48.5\n| dir2                = S\n| location2           = Annandale\n| dist3               = 54.7\n| dir3                = S\n| location3           = Townsville CBD\n| dist4               = 1342\n| dir4                = NNW\n| location4           = Brisbane\n| lga                 = City of Townsville\n| stategov            = Burdekin\n| fedgov              = Kennedy\n| near-n              = Woodstock\n| near-ne             = Woodstock\n| near-e              = Woodstock\n| near-se             = Reid River\n| near-s              = Reid River\n| near-sw             = Reid River\n| near-w              = Granite Vale\n| near-nw             = Granite Vale\n}}\nCalcium is a rural locality in the City of Townsville, Queensland, Australia. In the , Calcium had a population of 12 people.\nGeography\nThe Great Northern railway line runs immediately parallel and west of the eastern boundary of the locality, while the Flinders Highway runs immediately parallel and east of the eastern boundary of the localilty. Both the railway and the highway enter from the north-east (Woodstock) and exit to the south-west (Reid River). No railway stations serve the locality today.\nManton is a neighbourhood within the east of the locality ().\nThere are a number of mountains in the locality (from north to south):\n* Flagstone at  above sea level ()\n* Black Mountain at  above sea level ()\n* Brown Mountain at  above sea level ()\n* Mount Ellenvale at  above sea level ()\nThe Mingela State Forest occupies the south and west of the locality. Apart from this protected area, the land use is mostly grazing on native vegetation with crop growing in the north-west of the locality. There are some historic limestone mines in the centre of the locality.\nHistory\nThe locality was officially named and bounded on 27 July 1991. It was presumably named after the now-abandoned Calcium railway station () on the Great Northern railway. which had been named prior to 1914 after the calcium-bearing lime that was mined in the area.\nThe neighbourhood of Manton takes its name from the now-abandoned Manton railway station (), which takes its name from a pioneer farmer.\nManton Provisional School opened on 1 October 1903. In 1908, it reported an average daily attendance of 11.8 students. It become Manton State School on 1 January 1909. In 1920, it began to operate as a half-time school in conjunction with Toonpan Provisional School (meaning one teacher was shared between the two schools). It returned to full-time school status in 1923. Due to low student numbers, it closed in October 1924, but reopened in 1928, closing again in 1930. The school reopened in 1934 with 14 students. It closed permanently on 18 August 1946 . The school was on a  site at 4073 Burdekin Highway (now Flinders Highway in neighbouring Woodstock, ).\nDemographics\nIn the , Calcium had a population of 21 people.\nIn the , Calcium had a population of 12 people.\nEducation\nThere are no schools in Calcium. The nearest government primary school is Woodstock State School in neighbouring Woodstock to the north. The nearest government secondary school is William Ross State High School in Annandale to the north; however, students living in the south-west of Calcium might be too distant from this school with the alternatives being distance education and boarding school. There are also non-government schools in Annandale and other southern suburbs of Townsville.\nFacilities\nManton Cemetery is at 13 Manton Cemetery Road, off Manton Quarry Road and just west of the railway line ().\nReferences\nFurther reading\n*  — [https://onesearch.slq.qld.gov.au/permalink/61SLQ_INST/1dejkfd/alma997249934702061 via State Library of Queensland]"
    }
  ]
}