{
  "content": [
    {
      "type": "text",
      "text": "# Calen, Queensland\n\n| pop           = 427\n| pop_year      =\n| pop_footnotes =\n| postcode      = 4798\n| area          = 71.9\n| timezone      = AEST\n| utc           = +10:00\n| dist1         = 55.6\n| dir1          = NW\n| location1     = Mackay\n| dist2         = 331\n| dir2          = SE\n| location2     = Townsville\n| dist3         = 416\n| dir3          = NNW\n| location3     = Rockhampton\n| dist4         = 1002\n| dir4          = NNW\n| location4     = Brisbane\n| lga           = Mackay Region\n| stategov      = Whitsunday\n| fedgov        = Dawson\n| near-n        = Pindi Pindi\n| near-ne       = St Helens Beach\n| near-e        = Coral Sea\n| near-se       = Mount Ossa\n| near-s        = Mount Pelion\n| near-sw       = Mount Charlton\n| near-w        = Eungella Hinterland\n| near-nw       = Yalboroo\n}}\nCalen is a rural town and coastal locality in the Mackay Region, Queensland, Australia. In the , the locality of Calen had a population of 427 people.\nGeography\n, Calen|left]]\nThe locality of Calen is loosely bounded by One Mile Creek to the south and Blackrock Creek to the north. The land is mostly flat and used for sugar cane farming, apart from some undeveloped mountains across the western boundary of the locality and some small undeveloped hill land in the east which is on the Queensland coast.\nThe Bruce Highway passes from the south-east to the north-west of the locality. The North Coast railway line runs immediately north and parallel to the highway.\nThe town of Calen is located in the south-eastern part of the locality with the highway and railway passing through it. The Calen railway station () is located in the town.\nA second town of Kolijo is located on the south-eastern edge of the locality, again with the highway and railway passing through it. The former Kolijo railway station is located in the town (). Calen and Kolijo are separated by St Helens Creek, which might explain the development of two towns less than  apart.\nA neighbourhood called Moondaba exists at the north-western edge of the locality along the highway and railway line  (). It takes its name from the former Moondaba railway station and is reportedly an Aboriginal word meaning place of snakes. Moondaba is very close to the town of Pindi Pindi to the north, but they are separated by the Blackrock Creek.\nThe locality of Calen has a network of privately operated tramway lines for transporting sugar cane to the sugar mill.\nHistory\nThe town of Kolijo takes its name from the former Kolijo railway station which was named on 9 March 1923 by the Queensland Railways Department, reportedly an Aboriginal word meaning possum.\nThe town of Calen takes its name from the Calen railway station which was named on 8 February 1924 by the Queensland Railway Department, reportedly being an Aboriginal name meaning cloud.\nCalen State School opened on 24 February 1925 under head teacher Honoria Mary Doherty. In 1963, it expanded to offering secondary schooling (8-10). In 1991, it further expanded to offer secondary years 11 and 12. On 13 December 2003, it was renamed Calen District State College.\nCameron's Pocket State School opened on 4 February 1930 and closed in 1958. It was at 375 Calen Mount Charlton Road ().\nWilliam Pratt Memorial Church was officially opened on Saturday 23 August 1930; it was a combined Presbyterian and Methodist Church. It is now Calen Uniting Church. William Pratt was a pioneer sugarcane grower in the Calen area. He served on the Pioneer Shire Council and was a director of the Farleigh sugar mill.\nCalen Post Office opened by 1933.\nDemographics\nIn the , the town of Calen had a population of 289 people.\nIn the , the locality of Calen had a population of 451 people.\nIn the , the locality of Calen had a population of 390 people.\nIn the , the locality of Calen had a population of 427 people.\nEducation\nCalen District State College is a government primary and secondary (Prep-12) school for boys and girls at 38 McIntyre Street (). In 2018, the school had an enrolment of 195 students with 22 teachers (18 full-time equivalent) and 20 non-teaching staff (12 full-time equivalent). It includes a special education program.\nAmenities\nThe Mackay Regional Council operates a mobile library service on a fortnightly schedule at McIntyre Street near the school.\nSt Helen's Catholic Church is at 71 McIntyre Street (). It is part of the Farleigh parish.\nCalen Uniting Church is at 42 Mcintyre Street (). It is also known as the William Pratt Memorial Calen Community Church. As at 2020, the church was closed.\nThe Calen branch of the Queensland Country Women's Association meets at the QCWA Hall at 120 McIntyre Street ().\nFacilities\nCalen Police Station is at 5379 Bruce Highway ().\nCalen Ambulance Station is at 145 McIntyre Street ().\nCalen SES Facility is at 17 Pratts Road ().\nReferences\nFurther reading\n*\n*   — [https://onesearch.slq.qld.gov.au/permalink/61SLQ_INST/tqqf2h/alma99183592273102061 via State Library of Queensland] — includes Cameron's Pocket State School, Silent Grove State School, Mount Ossa State School, and Mount Pelion State School.\nExternal links\n*\n*"
    }
  ]
}