{
  "content": [
    {
      "type": "text",
      "text": "# Caliban's War\n\n'Caliban's War' is a 2012 science fiction novel by James S. A. Corey (pen name of Daniel Abraham and Ty Franck). It is about a conflict in the Solar System that involves the polities Earth, Mars, the Asteroid Belt and the outer planets, and a powerful extraterrestrial biological von Neumann probe. The second book in The Expanse series, it was preceded by Leviathan Wakes. The third book, ''Abaddon's Gate, was released on June 4, 2013. One of eight short stories and novellas published by James S. A. Corey, entitled \"Gods of Risk\", takes place directly after the events of Caliban's War.\nSetting\nSince the events of Leviathan Wakes'', the Protomolecule has been assembling a vast structure on the surface of Venus. The various governments of the solar system constantly monitor the planet, but nobody understands the structure's purpose.\nProtogen, the company that released the Protomolecule on Eros, has been dissolved, although Jules-Pierre Mao, a space transport tycoon who had strong connections to Protogen, walked free. Earth and Mars are engaged in an uneasy and tense ceasefire from the war that Protogen had started, and exert dual control over Jupiter's moon Ganymede, an important agricultural hub for the Belt. The OPA, meanwhile, is taking steps to make themselves into a legitimate government.\nPlot summary\nOn Ganymede, immunodeficient four year old Mei Meng is taken from her preschool by her doctor, who has authority to do so. Told that she is being taken to her mother, she is instead brought to a laboratory and after being presented with a grotesquely transformed male human in a transparent vat, begins screaming.\nSeveral hours later Earth and Martian space marines, who had been guarding their respective pods on the moon's surface, are attacked and effortlessly slaughtered by a humanoid alien super soldier which is impervious to their weaponry; Gunnery Sergeant Roberta \"Bobbie\" Draper, a Martian marine, is the only survivor. This incident precipitates a massive shooting war between Earth and Mars, who blame each other for the attack, which throws Ganymede into chaos. Mei's father Praxidike \"Prax\" Meng, a botanist whose life work has been destroyed in the destruction resulting from the battle, fruitlessly searches throughout the cascading societal breakdown for his daughter.\nSince the Eros incident, the crew of the Rocinante has been performing contract work for the OPA. They are tasked to bring relief supplies to Ganymede. While on the moon, Holden quells a food riot. Prax recognizes him, and asks help in finding his daughter. The Rocinante crew agrees, and are able to trace her and her kidnappers to one of the many long-disused tunnels in the moon. Holden, Prax, and ship mechanic Amos Burton discover a secret lab. In the midst of a shootout with lab security, they inadvertently release another alien soldier which kills several lab personnel. In the wake of the battle, the crew find remnants both of the Protomolecule and the corpse of a friend of Mei's, who had also been treated by Mei's doctor for immunodeficiency. As they enter the core of the lab, the remaining scientists take the group of captives and launch from the moon's surface. Before the Rocinante crew can explore the lab more to determine what was being done there, a massive flare up in the shooting war between Earth and Mars leads to bombardment of the moon's surface. As chaos erupts around them, Holden, Amos, and Prax flee to the Rocinante and leave Ganymede.\nMeanwhile, following hospitalization but still suffering from untreated PTSD, Bobbie is brought to the peace talks between Earth and Mars on Earth to give eye-witness testimony regarding the alien attack on Ganymede. She egregiously violates diplomatic protocol and is dismissed by the Martian delegation, but is instead hired by Chrisjen Avasarala, the leader of the United Nations (UN) negotiations. The UN is heavily fractured between various factions vying for power; Avasarala reasons that Bobbie has no allegiances to other UN figures and is therefore a relatively trustworthy asset. Bobbie deduces that Avasarala's assistant is feeding information about her actions to a set of political opponents including UN Admiral Nguyen and Undersecretary Errinwright. Avasarala concludes that Nguyen's faction are trying to stop her from looking into the events on Ganymede and that they must be responsible for the alien soldier attacks. These political opponents assign Avasarala to travel to Ganymede on a yacht owned by business tycoon Jules-Pierre Mao on an ostensible relief mission. Although this is clearly a thinly veiled attempt to remove her from the political equation for some time, and also reveals Nguyen's faction is working together with Mao towards some unknown purpose, Avasarala is powerless to refuse. She brings Bobbie along as her bodyguard.\nOn their way to Tycho station, the Rocinante crew discovers an alien soldier stowed away in their cargo hold. They are able to lure out the creature using radioactive bait before vaporizing it with the ship's exhaust. The Rocinante is damaged during the encounter, but the crew has learned much about the alien creations. Holden confronts Fred Johnson, whom he believes controls the only other sample of the Protomolecule, and therefore must be responsible for the lab. Johnson denies any involvement with the Ganymede incident and summarily fires Holden's crew for questioning his authority. Now without the financial backing of the OPA, the crew helps Prax release a video asking for help searching for Mei, raising enough money to continue the search. Prax receives a message from someone who recognizes Mei's doctor that took her from the preschool, who actually was an employee of Protogen. He deduces that the alien soldiers are being created on a base on Io. With the Rocinante repaired they set out to recover Mei.\nTrapped on board the yacht, Avasarala learns that Admiral Nguyen and Errinwright sent a fleet to intercept and destroy the Rocinante, and that a Martian fleet is also traveling to monitor the situation. The crew of the yacht prevent her from warning Holden, claiming that their communication systems are broken. Realizing that Mao has ordered them to prevent her from contacting the Rocinante, Avasarala has Bobbie use smuggled military weaponry to take control of the vessel. Avasarala sends a warning to Holden, and she and Bobbie board a racing pinnace to rendezvous with the Rocinante before the military fleets can reach them.\nHolden's crew, Avasarala and Bobbie share notes on the alien soldiers. They put all of the pieces together, and determine that the alien soldiers are biological weapons created by Jules-Pierre Mao by using the Protomolecule on immunodeficient individuals. Mao had sold the weaponized Protomolecule creations to the highest bidder (the rogue faction within the UN government led by Nguyen and Errinwright). Bobbie and Avasarala convince the Martian fleet to help protect the Rocinante, and together they destroy Nguyen's  fleet.\nAvasarala sends everything she had learned to her trusted contacts within the UN to prevent an all-out war. The UN Secretary General, who was unaware of the bioweapons plot, arrests Errinwright. Nguyen's forces, refusing to surrender, move to Io to defend the base where the alien soldiers are made. This culminates in a massive space battle between Nguyen's forces, and the joint Martian and UN fleet. The battle ultimately ends in victory for the Martians and UN. Knowing he has lost, Nguyen orders the lab to launch rockets containing the alien soldiers at Mars. With billions of lives at stake, Holden infiltrates Nguyen's flagship, kills him, and enables transponders on the rockets so that they can be safely destroyed.\nThe crew lands on the Io base, where Amos and Prax rescue Mei along with other immunodeficient children, and Bobbie kills the last alien soldier using her knowledge about its capabilities. The crew heads back to Luna, where those responsible for the alien soldier project including Mao and Errinwright are brought to justice. Avasarala is promoted, Prax is hired to oversee efforts to restore Ganymede, Bobbie returns to Mars, and the Rocinante begins freelance contract work, now unaffiliated with the OPA.\nThe Protomolecule finishes assembling its structure on Venus and the megastructure launches off the planet, traveling into deep space for some unknown purpose. While Holden is resting on the Rocinante, Detective Joe Miller appears in front of him more than a year-and-a-half after his apparent demise, and tells him they have to talk.\nCharacters\n* James Holden is the captain of the salvaged Martian warship Rocinante. He and his crew have worked for the Outer Planets Alliance for 18 months since what's become known as the Eros Incident, and the job hasn't worn well. While assisting botanist \"Prax\" in the search for his daughter, Holden comes across signs that people are still trying to tame the protomolecule, and the threat hits very close to home. Breaking his OPA ties, he becomes an ever-more-important piece in a four-way chess game for who —or what— will run the solar system.\n* Chrisjen Avasarala is a high-ranking UN official who knows how to get things done. Plugged in to a myriad sources of information, she's simultaneously monitoring events on Earth, Mars, Ganymede, and Venus. Seeing shifts coming but not able to completely grasp what they mean, she accepts a post that takes her away from the action knowing she is playing her expected part until it is time to do the unexpected. She then meets James Holden, who is trying to defuse a war.\n* Bobbie Draper is a Martian Marine stationed on Ganymede, one of Jupiter's largest moons and known as the breadbasket of the outer planets. After she witnesses the brutal defeat and destruction of military forces on both sides of a conflict by an alien third party, including her entire platoon, she is taken to Earth to participate in peace talks. Not following the party line, however, she is dismissed. Now attached to Chrisjen Avasarala, she must continue to adapt to interplanetary politics and office intrigue. With her duties later taking her back to space, however, her military training comes in handy once again.\n* Praxidike Meng is a botanist working on Ganymede when tensions erupt. His daughter is lost in the chaos, and he finds information that she was actually taken from her daycare before the action had commenced. He tries to find her in the decaying conditions of his home, but finally latches on to James Holden as his only source of hope. Eventually becoming the public face of the crisis at Ganymede, his efforts to find his daughter's abductors prove to have interstellar ramifications.\nReception\nCritical reception for ''Caliban's War was predominantly positive, with Kirkus Reviews'' noting that the book could be enjoyed as a standalone novel but was \"best appreciated after volume one\". Wired.com's Geek Dad and Publishers Weekly both praised the novel, with GeekDad citing the book's \"believable human personalities and technology that is easily recognizable\" as a highlight. Tor.com gave an overall positive review for ''Caliban's War'', but noted that there was \"some rather tiresome dialogue in the cards, as well as an overabundance of laughably transparent politics, and a couple of at best cartoonishly characterised bad guys\".\nReferences\nExternal links\n* [http://the-expanse.com The authors' blog]\n* [http://www.danielabraham.com/books-2/the-expanse/ The series' web site]"
    }
  ]
}