{
  "content": [
    {
      "type": "text",
      "text": "# Call-recording software\n\nCall recording software records telephone conversations over PSTN or VoIP in a digital audio file format. Call recording is distinct from call logging and tracking, which record details about the call but not the conversation; however, software may include both recording and logging functionality.\nConsiderations\nCall recording is becoming increasingly important, with technology changing and working habits becoming more mobile. Addressing mobile recording is now the subject of many financial regulators' recommendations. It is also increasingly important to business continuity planning,  especially for pandemic planning.\nThe actual recording takes place on a recording system with software for the management of calls and security of recordings. Most call recording software applications rely on an analogue signal via either a call recording adapter or a telephony board.\nDigital lines cannot be recorded unless the call recording system can capture and decode the proprietary digital signalling, which some modern systems can. Sometimes a method is supplied with a digital private branch exchange (PBX) that can process the proprietary signal (usually a conversion box) before being channeled to a computer for recording. Alternatively a hardware adapter can be used on a telephone handset as the digital signal is converted at that point to analogue.\nVoIP Recording is usually restricted to streaming media recorders or software developed by the softphone or IP PBX creator. There are also solutions which use packet capture technology to passively record VoIP phone calls on the LAN.\nHardware is required to make the voice signal available to the computer equipment. Some of today's call recording software is sold as a turn-key solution with hardware.\nDirect recording of mobile phone calls requires a hardware adapter connected to the handset. There are many other ways to record mobile phone calls. One approach is to route calls via a new PBX system linked to the recorder. However, such systems are typically expensive to purchase and change the way that calls are made, incurring running costs. Another approach links directly into existing recording systems from a PDA phone. Both of these approaches allow recordings to be timestamped, often required for legal reasons. Recording directly onto mobile devices does provide a legally valid recording in many countries.\nSee also\n* Call-recording hardware\n* Call-recording services\n* Telephone tapping\n*Telephone recording laws\n* VoIP Recording\n* TAPI\nReferences"
    }
  ]
}