{
  "content": [
    {
      "type": "text",
      "text": "# Calvinist Republic of Ghent\n\n, Ghent by Antonius Sanderus, Flandria Illustrata]]\nThe Calvinist Republic of Ghent was a Calvinist republic that existed between 1577 and 1584 in the Flemish independent city of Ghent.\nBackground\nDuring the Middle Ages Ghent became an important economic center in the County of Flanders with an independent streak. Already in 1337 the city rebelled against the Count of Flanders under the leadership of Jacob van Artevelde and set up an alliance with other independent cities, that would become the Four Members, a predecessor of the States of Flanders in the Burgundian Netherlands. In the 15th century Ghent again rebelled in the Revolt of Ghent (1449–53), this time against the Duke of Burgundy. And in the 16th century Ghent rebelled against Charles V, Holy Roman Emperor after which it lost many of its privileges and had to accept a citadel, called the Spanjaardenkasteel, or Castle of the Spaniards, in its center, while losing its city walls.\nDuring the early stages of the Dutch Revolt and  Eighty Years' War it had many Calvinists among its population. When after the Pacification of Ghent the Calvinists in Holland and Zeeland received freedom of religion, while in Flanders Catholicism remained the only tolerated religion, the Calvinists became restless.\nHistory\nOn 8 November 1576 the States General of the Netherlands concluded a peace treaty, called the Pacification of Ghent, with the rebelling provinces of Holland and Zeeland. This threw down the gauntlet to the government of the overlord of the Habsburg Netherlands, Philip II of Spain (who was count Philip III of Flanders); the royal stadtholder of Flanders Jan van Croÿ chose the side of the rebels and helped the citizens of Ghent subdue the Spanjaardenkasteel in the city. However, when the new royal governor-general of the Netherlands, Don Juan of Austria arrived in the country, Croÿ resigned his post, and was replaced by Philippe III de Croÿ, duke of Aarschot (and therefore commonly called Aarschot in the literature) by appointment of the States General. However, Aarschot was a prominent Catholic and therefore not trusted by the Calvinists in Ghent.\nOn 28 October 1577 the Ghent magistracy under the leadership of two prominent Calvinists, Jan van Hembyse and François van Ryhove performed a coup d'état with the tacit approval of the Prince of Orange and took power in Flanders. Philippe III de Croÿ, Duke of Aarschot, who served as the grootbaljuw (the Grand Bailiff) of Ghent, was arrested, as well as the bishops of Bruges and Ypres. Previously a similar coup had taken place in the capital of the Duchy of Brabant, Brussels and there the city government had been taken over by a Council of 18 members, called the Achttienmannen. Ghent similarly now installed a similar council for its new government, also called the Achttienmannen. Hembyse became the chairman of this council with the title of First Schepen. Hembyse had the support of the noted Calvinist clergymen Petrus Dathenus and Herman Moded who helped him keep control of the Calvinist \"mob\". He armed the citizens of Ghent and hired Scottish mercenaries. This gave him the military means to conquer a number of other Flemish cities where similar Calvinist city republics, governed by councils of Achttienmannen were formed.\nThe Ghent Calvinists were not interested in William's \"religious peace\", but wanted to persecute their Catholic opponents as stringently as the Catholics had previously persecuted the Calvinists. Hembyse and Ryhove orchestrated an Iconoclastic Fury in Ghent in May 1578 after rumors of sodomy by monks of a local Catholic monastery had spread. The monks were arrested, tried, and (after they had confessed under torture) convicted and sentenced to be burned at the stake. These persecutions, and also the terror of the Scottish mercenaries who mercilessly looted the Flanders countryside, provoked a Catholic reaction, led by the faction of the Malcontents, that eventually would cause the secession of the Walloon provinces, who were united in the Union of Arras and concluded a separate peace with the Spanish Crown at the Treaty of Arras in May 1579.\nThe Union of Arras was countered by the defensive Union of Utrecht and the Ghent Republic joined that union already on 4 February 1579. Philip II was declared to have vacated the throne on 6 August 1579. (Two years later, the States General would declare the same in the Act of Abjuration.) The Ghent magistracy assumed his sovereign powers for the city republic.\nEnd\nMeanwhile, there was a falling out between Hembyse and Ryhove, and Ryhove managed to have Hembyse exiled from the city after in December 1578 William of Orange came to the city and reformed its magistracy. William also managed to impose his \"religious peace\" in Ghent. Ryhove received the office of grootbaljuw as representative of William. But the military situation in Flanders gradually worsened for the Calvinists and the Flemish members of the Union of Utrecht. The Malcontents joined the Army of Flanders of the new royal governor-general Parma, and together they besieged and conquered more and more of the Flemish cities. On 24 October 1583 there was a new coup in the Ghent city government, in which Ryhove was forced into exile and Hembyse returned to power. Ryhove then took up a blocking position in Dendermonde between Antwerp and Ghent, cutting off the supply lines to the city from Antwerp. The Spanish army laid siege to Ghent, while Hembyse held dictatorial powers in the city. He negotiated in secret with the Spaniards, and when this was discovered by the enraged citizens he was arrested, tried for treason, and on 8 August 1584 executed. Ghent was forced to surrender to Parma on 17 August 1584, ending the regime of the Calvinist Republic.\nNotes and references\nNotes\nReferences\nSources\n*\n*\n*\n*\n*"
    }
  ]
}