{
  "content": [
    {
      "type": "text",
      "text": "# Campfire Cooking in Another World with My Absurd Skill\n\n}}\n| imprint      = Overlap Novels\n| first        = November 25, 2016\n| last         =\n| volumes      = 17\n| volume_list  =\n}}\n| magazine     = Comic Gardo\n| first        = March 24, 2017\n| last         =\n| volumes      = 11\n| volume_list  =\n}}\n| magazine     = Comic Gardo\n| first        = August 24, 2018\n| last         =\n| volumes      = 8\n| volume_list  =\n}}\n| studio          = MAPPA\n| licensee        = }}\n| network         = TXN (TV Tokyo), AT-X\n| network_en      =\n| first           = January 11, 2023\n| last            =\n| episodes        = 18\n| episode_list    =\n}}\nis a Japanese light novel series written by Ren Eguchi. The series originated on the Shōsetsuka ni Narō website in January 2016, before being published in print with illustrations by Masa by Overlap beginning in November 2016 under their Overlap Novels imprint. As of September 2025, 17 volumes have been released.\nA manga adaptation, illustrated by Akagishi K, began serialization on the Comic Gardo website in March 2017. As of July 2025, the manga's individual chapters have been collected into eleven volumes. A spin-off manga, illustrated by Momo Futaba, began serialization on the same website in August 2018. As of February 2024, the spin-off's individual chapters have been collected in eight volumes. An anime television series adaptation produced by MAPPA aired from January to March 2023. A second season premiered in October 2025.\nPlot\nThree Japanese high school students are magically summoned to a parallel fantasy world by the Kingdom of Reijseger, who asks them for help in their war against the demon folk. The students are found to possess several powerful magical abilities and are accepted as \"Heroes\". However, the hero summoning ritual also accidentally transported a fourth person, an ordinary salaryman named Tsuyoshi Mukouda (a.k.a. \"Mukohda\"), who has only one power: \"Online Supermarket\". Unwilling to become a Hero and harboring deep suspicion of the kingdom's true intentions, he convinces the nobles that his ability is useless, allowing him to leave and pursue a simple life in the new world. Experimenting with his Online Supermarket skill, he discovers he can instantly order food and other products from modern-day Japan. During his travels, he meets a legendary beast known as \"Fenrir\", who demands that Mukohda feed him. The Fenrir, eventually named Fel, takes a liking to Mukohda's cooking and forces him to accept a familiar contract. As Mukohda continues his journey, he gains more familiars, encounters other monsters, and befriends gods from the Divine Realm, who grant him and his familiars blessings to obtain his food and otherworldly goods.\nCharacters\nMain characters\n; /\n: (drama CD), Yuma Uchida (anime)|Aaron Campbell}}\n:The main protagonist of the series. He is a mild-mannered but cowardly 27-year-old salaryman and former part-time cook who is accidentally transported to another world during a hero summoning ritual. Tsuyoshi presents himself as \"Mukohda\" in the new world after learning full names are used exclusively by nobility. He has the unique ability \"Online Supermarket\", which allows him to purchase items from modern Japan. He is able to provide temporary stat buffs by cooking meals with ingredients bought through his skill. He gains notoriety as a beast tamer through his powerful familiar contracts.\n;\n:\n:A Fenrir and Mukohda's first familiar. He is a legendary wolf-like creature who has lived for over a thousand years. He has extraordinary strength, agility, and magic that enables him to wipe out most monsters with little effort. Fel is prideful, selfish, vain, and gluttonous, choosing to follow Mukohda simply to eat his food. He loves meat and hates vegetables.\n;\n:\n:A slime and Mukohda's second familiar. Initially met as a baby, Sui evolves throughout the series by gaining experience through battle and eating trash from Mukohda's Online Supermarket purchases. Though slimes are generally considered weak monsters, Sui is a special exception. It is able to melt enemies with acid bullets, as well as create potions and weapons. Sporting a child-like personality, it enjoys desserts and dislikes spicy foods. Sui is the main protagonist of the spin-off manga series ''Campfire Cooking in Another World with My Absurd Skill: Sui's Great Adventure''.\n;\n: (anime)|Justin Briner}}\n:A pixie dragon and Mukohda's third familiar. He is small but has a spunky, boastful attitude. He can fly at extreme speeds and holds a vast amount of magical power. Mukohda names him after the first half of the word , and despite being an adult, is affixed with the honorific -chan due to his size and cuteness, much to Dora's chagrin. His favorite treat is Japanese-style custard caramel pudding.\n;\n:An ancient dragon and Mukohda's fourth, and currently temporary, familiar. Having lived for several millennia, he is an old rival of Fel and one of few creatures capable of fighting him on equal terms. Gon is similar to Fel in voraciousness, arrogance, and stubbornness, causing the two to constantly butt heads. He is named after the second half of the word \"dragon\". He normally stands about twenty stories tall but can shrink at will.\nDeities\n;\n: (anime)|Macy Anne Johnson}}\n:The Goddess of Wind, who has long silver hair and a huge sweet tooth. She is the first deity to grant Mukohda her blessing, giving him immunity to poisons, illnesses, and other negative status effects. Due to her constant demands for otherworldly sweets, primarily Fujiya brands, and frequent emotional outbursts, Mukohda often refers to her as the \"divine disappointment\". Erroneously transliterated as \"Ninrir\" in some sources, such as the anime subtitles.\n;\n:\n:The Goddess of Fire, who has long red hair, dark skin, and a hotheaded temperament. She strengthens Mukohda's fire magic in exchange for otherworldly beer.\n;\n:\n:The Goddess of Earth, who has long blonde hair, a curvaceous figure, and a sisterly personality. She bolsters Mukohda's earth magic in exchange for otherworldly beauty products, namely from Matsumoto Kiyoshi. Transliterated as \"Kisharle\" in some sources, such as the anime subtitles.\n;\n:\n:The Goddess of Water, who has shorter blue hair, a young appearance, and a quiet demeanor. Due to Mukohda's lack of affinity for water magic, she grants Sui her blessing instead to receive offerings of otherworldly food. In the spin-off manga ''Sui's Great Adventure'', she becomes attached to Sui and the two begin having long nighttime conversations together, with Sui eventually viewing Rusalka as an older sister.\n; :\n:The God of War, who wears a skull helmet and is adorned with tattoos. In exchange for otherworldly booze, he provides Dora and Fel with his blessing, boosting their stats by 50% during battle.\n; :\n:The God of Blacksmithing, who has a stocky build, large beard, and other dwarf-like features. In exchange for otherworldly booze, he gives Sui the ability to forge and upgrade weapons.\n;\n:The God of All Creation, the creator deity of the world Mukohda is summoned to. He eventually catches the other gods extorting Mukohda for his otherworldly goods, sentencing them to temporary house arrest. After Mukohda sends him sake as a gift, Demiurge bestows his blessing of longevity, raising Mukhoda's lifespan to 1,500 years.\nOther characters\n; :\n:The elven guildmaster for the Adventurer's Guild in the dungeon city of Dolan. He is a former adventurer, expert swordsman, and skilled monster butcher. He is infamous for his eccentric behavior and obsession with dragons. Elrand first meets Mukohda and his party after they seek his help in butchering a rare earth dragon for its meat.\n;\n:\n:A leather goods merchant from the city of Karelina whom Mukohda befriends after saving his caravan from a bandit attack. The two form a successful business partnership, alongside Lambert's wife Marie, selling soap and hair treatment products from Mukohda's world.\n;\n:, Christopher Sabat (English)\n:The old, grizzled guildmaster for the Adventurer's Guild in Karelina, who comes to rely on Mukohda and his familiars with completing high-difficulty quests that others are unwilling to accept.\nMedia\nLight novel\nWritten by Ren Eguchi, the series began publication on the novel posting website Shōsetsuka ni Narō on January 5, 2016. The series was later acquired by Overlap, who began publishing the series with illustrations by Masa on November 25, 2016, under their Overlap Novels imprint. As of September 2025, 17 volumes have been released.\nIn March 2019, J-Novel Club announced that they licensed the light novel for English publication. In January 2025, J-Novel Club announced that a 2-in-1 omnibus print release would begin publication in August 2025.\nVolumes\n|LicensedTitle   = Ginger-Fried Pork and the Legendary Beast\n|TranslitTitle   =\n|VolumeNumber    = 1\n|OriginalRelDate = November 25, 2016\n|OriginalISBN    = 978-4-86-554167-0\n|LicensedRelDate = May 6, 2019 (digital)August 12, 2025 (omnibus)\n|LicensedISBN    = 978-1-71-834300-9\n|LicensedISBN_note = (digital) (omnibus)\n}}\n|LicensedTitle   = Winged Gyoza and the Phantom Dragon\n|TranslitTitle   =\n|VolumeNumber    = 2\n|OriginalRelDate = March 25, 2017\n|OriginalISBN    = 978-4-86-554204-2\n|LicensedRelDate = August 6, 2019 (digital)August 12, 2025 (omnibus)\n|LicensedISBN    = 978-1-71-834302-3\n|LicensedISBN_note = (digital) (omnibus)\n}}\n|LicensedTitle   = Beef Stew and the Unexplored Labyrinth\n|TranslitTitle   =\n|VolumeNumber    = 3\n|OriginalRelDate = July 25, 2017\n|OriginalISBN    = 978-4-86-554239-4\n|LicensedRelDate = October 7, 2019 (digital)October 14, 2025 (omnibus)\n|LicensedISBN    = 978-1-71-834304-7\n|LicensedISBN_note = (digital) (omnibus)\n}}\n|LicensedTitle   = Barbecue and God's Blessings\n|TranslitTitle   =\n|VolumeNumber    = 4\n|OriginalRelDate = December 25, 2017\n|OriginalISBN    = 978-4-86-554296-7\n|LicensedRelDate = December 24, 2019 (digital)October 14, 2025 (omnibus)\n|LicensedISBN    = 978-1-71-834306-1\n|LicensedISBN_note = (digital) (omnibus)\n}}\n|LicensedTitle   = Mixed Tempura and the Sea Monster\n|TranslitTitle   =\n|VolumeNumber    = 5\n|OriginalRelDate = April 25, 2018\n|OriginalISBN    = 978-4-86-554310-0\n|LicensedRelDate = March 2, 2020 (digital)December 9, 2025 (omnibus)\n|LicensedISBN    = 978-1-71-834308-5\n|LicensedISBN_note = (digital) (omnibus)\n}}\n|LicensedTitle   = Meat Soboro Rice Bowls and The Holy Seal\n|TranslitTitle   =\n|VolumeNumber    = 6\n|OriginalRelDate = January 25, 2019\n|OriginalISBN    = 978-4-86-554441-1\n|LicensedRelDate = May 18, 2020 (digital)December 9, 2025 (omnibus)\n|LicensedISBN    = 978-1-71-834310-8\n|LicensedISBN_note = (digital) (omnibus)\n}}\n|LicensedTitle   = Red Meat Steak and the Creator God's Judgement\n|TranslitTitle   =\n|VolumeNumber    = 7\n|OriginalRelDate = July 25, 2019\n|OriginalISBN    = 978-4-86-554525-8\n|LicensedRelDate = August 5, 2020 (digital)February 10, 2026 (omnibus)\n|LicensedISBN    = 978-1-71-834312-2\n|LicensedISBN_note = (digital) (omnibus)\n}}\n|LicensedTitle   = Stone Over-Baked Pizza and the Elixir of Life\n|TranslitTitle   =\n|VolumeNumber    = 8\n|OriginalRelDate = January 25, 2020\n|OriginalISBN    = 978-4-86-554597-5\n|LicensedRelDate = October 19, 2020 (digital)February 10, 2026 (omnibus)\n|LicensedISBN    = 978-1-71-834314-6\n|LicensedISBN_note = (digital) (omnibus)\n}}\n|LicensedTitle   = Grilled Entrails and the Festival of Gluttony\n|TranslitTitle   =\n|VolumeNumber    = 9\n|OriginalRelDate = September 25, 2020\n|OriginalISBN    = 978-4-86-554745-0\n|LicensedRelDate = February 22, 2021 (digital)April 13, 2026 (omnibus)\n|LicensedISBN    = 978-1-71-834316-0\n|LicensedISBN_note = (digital) (omnibus)\n}}\n|LicensedTitle   = Beef Cutlets and the Bandit King's Treasure\n|TranslitTitle   =\n|VolumeNumber    = 10\n|OriginalRelDate = May 25, 2021\n|OriginalISBN    = 978-4-86-554915-7\n|LicensedRelDate = September 29, 2021 (digital)April 13, 2026 (omnibus)\n|LicensedISBN    = 978-1-71-834318-4\n|LicensedISBN_note = (digital) (omnibus)\n}}\n|LicensedTitle   = Sukiyaki and the Blessings of Battle\n|TranslitTitle   =\n|VolumeNumber    = 11\n|OriginalRelDate = November 25, 2021\n|OriginalISBN    = 978-4-82-400046-0\n|LicensedRelDate = May 25, 2022\n|LicensedISBN    = 978-1-71-834320-7\n}}\n|LicensedTitle   = Karaage and the Mighty Dragon of Yore\n|TranslitTitle   =\n|VolumeNumber    = 12\n|OriginalRelDate = June 25, 2022\n|OriginalISBN    = 978-4-82-400214-3\n|LicensedRelDate = November 15, 2022\n|LicensedISBN    = 978-1-71-834322-1\n}}\n|LicensedTitle   = Saucy Meatballs and the Ways of Adventuring\n|TranslitTitle   =\n|VolumeNumber    = 13\n|OriginalRelDate = December 25, 2022\n|OriginalISBN    = 978-4-82-400366-9\n|LicensedRelDate = June 26, 2023\n|LicensedISBN    = 978-1-71-834324-5\n}}\n|LicensedTitle   = Cream Croquettes and the Downfall of Heresy\n|TranslitTitle   =\n|VolumeNumber    = 14\n|OriginalRelDate = April 25, 2023\n|OriginalISBN    = 978-4-82-400470-3\n|LicensedRelDate = September 27, 2023\n|LicensedISBN    = 978-1-71-834326-9\n}}\n|LicensedTitle   = Chilled Scallop Pasta and the Philosopher's Stone\n|TranslitTitle   =\n|VolumeNumber    = 15\n|OriginalRelDate = February 25, 2024\n|OriginalISBN    = 978-4-8240-0634-9\n|LicensedRelDate = September 4, 2024\n|LicensedISBN    = 978-1-71-834328-3\n}}\n|LicensedTitle   = Whitefish Meunière and the Leviathan's Wake\n|TranslitTitle   =\n|VolumeNumber    = 16\n|OriginalRelDate = December 25, 2024\n|OriginalISBN    = 978-4-8240-1032-2\n|LicensedRelDate = September 3, 2025\n|LicensedISBN    = 978-1-71-834330-6\n}}\n|LicensedTitle   = —\n|TranslitTitle   =\n|VolumeNumber    = 17\n|OriginalRelDate = September 25, 2025\n|OriginalISBN    = 978-4-8240-1346-0\n|LicensedRelDate = —\n|LicensedISBN    =\n}}\nManga\nA manga adaptation, illustrated by Akagishi K, began serialization on the Comic Gardo manga website on March 24, 2017. As of July 2025, the series' individual chapters have been collected in 11 tankōbon volumes. In April 2020, J-Novel Club announced that they also licensed the manga adaptation for English publication. In January 2025, J-Novel announced that the manga would begin print publication in September 2025.\nA spin-off manga illustrated by Momo Futaba, titled , began serialization on the Comic Gardo website on August 24, 2018. As of February 2024, the series' individual chapters have been collected in eight tankōbon volumes. In September 2022, J-Novel Club announced that they also licensed the spin-off manga in English.\nVolumes\nMain series\n|OriginalISBN    = 978-4-86-554297-4\n|LicensedRelDate = October 28, 2020 (digital)September 9, 2025 (print)\n|LicensedISBN    = 978-1-71-834340-5\n|LicensedISBN_note = (digital) (print)\n}}\n|OriginalISBN    = 978-4-86-554341-4\n|LicensedRelDate = January 13, 2021 (digital)November 11, 2025 (print)\n|LicensedISBN    = 978-1-71-834341-2\n|LicensedISBN_note = (digital) (print)\n}}\n|OriginalISBN    = 978-4-86-554445-9\n|LicensedRelDate = June 2, 2021 (digital)January 13, 2026 (print)\n|LicensedISBN    = 978-1-71-834342-9\n|LicensedISBN_note = (digital) (print)\n}}\n|OriginalISBN    = 978-4-86-554529-6\n|LicensedRelDate = August 25, 2021 (digital)March 10, 2026 (print)\n|LicensedISBN    = 978-1-71-834343-6\n|LicensedISBN_note = (digital) (print)\n}}\n|OriginalISBN    = 978-4-86-554607-1\n|LicensedRelDate = October 26, 2021 (digital)May 11, 2026 (print)\n|LicensedISBN    = 978-1-71-834344-3\n|LicensedISBN_note = (digital) (print)\n}}\n|OriginalISBN    = 978-4-86-554752-8\n|LicensedRelDate = February 2, 2022 (digital)\n|OriginalISBN    = 978-4-86-554923-2\n|LicensedRelDate = April 13, 2022 (digital)\n|OriginalISBN    = 978-4-82-400055-2\n|LicensedRelDate = June 22, 2022 (digital)\n|OriginalISBN    = 978-4-82-400373-7\n|LicensedRelDate = October 18, 2023 (digital)\n|OriginalISBN    = 978-4-82-400747-6\n|LicensedRelDate = January 15, 2025 (digital)\n|OriginalISBN    = 978-4-82-401277-7\n|LicensedRelDate = —\n|LicensedISBN    =\n}}\nSpin-off\n|OriginalISBN    = 978-4-86-554444-2\n|LicensedRelDate = November 9, 2022\n|LicensedISBN    = 978-1-71-834370-2\n}}\n|OriginalISBN    = 978-4-86-554528-9\n|LicensedRelDate = January 11, 2023\n|OriginalISBN    = 978-4-86-554606-4\n|LicensedRelDate = March 29, 2023\n|OriginalISBN    = 978-4-86-554751-1\n|LicensedRelDate = July 12, 2023\n|OriginalISBN    = 978-4-86-554922-5\n|LicensedRelDate = January 10, 2024\n|OriginalISBN    = 978-4-82-400054-5\n|LicensedRelDate = April 3, 2024\n|OriginalISBN    = 978-4-82-400372-0\n|LicensedRelDate = June 18, 2025\n|OriginalISBN    = 978-4-8240-0650-9\n|LicensedRelDate = September 24, 2025\n|LicensedISBN    = 978-1-71-834377-1\n}}\nAnime\nAn anime television series adaptation was announced on October 29, 2022. It is produced by MAPPA and directed by Kiyoshi Matsuda, with scripts written by Michiko Yokote, character designs handled by Nao Ōtsu, and music composed by Masato Kōda, Kana Utatane, and Kuricorder Quartet. The series aired from January 11 to March 29, 2023, on TV Tokyo and its affiliates. The opening theme song is  by Van de Shop, while the ending theme song is \"Happy-go-Journey\" by Yuma Uchida. Crunchyroll streamed the series worldwide outside of Asia, while Muse Communication licensed the series in Asia-Pacific.\nA second season was announced on October 29, 2023, which premiered on October 8, 2025. For the second season, the opening theme song is \"yummy goodday\" by Cent Chihiro Chittiii, while the ending theme song is \"SALT AND PEPPER\" by chelmico.\nEpisodes\nSeason 1 (2023)\n| director   =\n| directorR  =\n| writer     =\n| writerR    =\n| aux2       =\n| aux2T      = Storyboarded by\n| aux2R      =\n| airdate    =\n| airdateR   =\n| director   =\n| directorR  =\n| writer     =\n| writerR    =\n| aux2       =\n| aux2T      = Storyboarded by\n| aux2R      =\n| airdate    =\n| airdateR   =\n| episodes   =\n| ShortSummary        = A dozen Venom Tarantulas attack Fel, who kills them. Mukohda saves them for later before making Gyoza from Orc General meat. A Pixie Dragon, a rare species the size of a cat, smells the food and begs to try some. Fel warns him Pixie Dragons are extremely fast and use magic. After trying the food the dragon casts a spell making himself Mukohda's familiar. Mukohda names him Dora and is exasperated to have yet another food-loving familiar. In Krehl, the City of Textiles, Guild Master Rodolfo asks Mukohda to investigate why the Venom Tarantula's are becoming overly aggressive, since the city relies on their silk to make fabric. Mukohda reveals Fel killed the out of control tarantulas already and sells Rodolfa the shells and silk while keeping the meat. He also purchases new clothes from the local shops. Mukohda discovers spiders are similar to crab, so he cooks fried rice, salad, omelettes and spring rolls. Dora reveals he has been following the scent of Mukohda's cooking since Karelina and was accidentally responsible for the Tarantulas aggressiveness. That night Mukohda falls asleep, forgetting the weekly offering for the irate Goddesses. Before leaving for Dolan Mukohda leaves Rodolfo the valuable spider shells.\n| LineColor           = #f39800\n}}\n| ShortSummary        = The group arrive in the dungeon city Dolan seeking the elf Elrand, the Dolan Guild Master who can process the Earth Dragon. Mukohda also meets Vice-Guild Master Ugohl. Elrand is stunned when he realises Dora is nothing like his species description in books. They rest for the night and Mukohda makes Jingisukan. The next morning Elrand is shocked when the guild's historical mithril dagger snaps against the dragon's skin, meaning he needs a mithril blade of even higher quality. As Dolan has a dungeon, Ugohl suggests mining for ore to smith a new one. Mukohda refuses in case Fel goes battle crazy in the dungeon and draws attention, so he distracts him by making orc meat kimchi rice bowls. The Goddesses grow even more upset with Mukohda until their complaining draws the unwanted attention of Hephaestos the God of Blacksmithing and Vahagn the God of War. Realizing the Goddesses have been trading blessings for offerings, Hephaestos grants Sui a blacksmithing blessing so he could smith a knife himself, and Vahagn blesses Fel and Dora with combat abilities, all in exchange for other-world alcohol. Fel reminds Mukohda they still have mithril from the mithril lizard, which Mukohda had forgotten about. Sui absorbs the mithril and smiths a knife of near perfect quality.\n| LineColor           = #f39800\n}}\n| ShortSummary        = Elrand gets to work with the new knife. Fel, Dora and Sui convince Mukohda to visit the dungeon and test Vahagn's blessings. Mukohda learns the dungeon has 30 floors and has never been fully conquered, so he needs to prepare supplies. Mukohda buys a magic oven which he tests by making Bloody Bull and Wyvern gyudon for dinner. For meals that will be consumed inside the dungeon, he also prepares braised Orc General, Red Boar with cabbage, Bloody Bull green pepper stir-fry, Orc General soup and Wyvern stew. He also has Sui forge a mithril sword for protection. Elrand finishes the dragon and immediately buys some of the blood, liver and a tooth for 3800 gold coins. Faced with so much money, Mukohda worries how much the rest of the dragon will be worth. As promised, Mukohda invites Elrand to dinner where he prepares roast Dragon meat with garlic sauce. Elrand enjoys the meal so much he cries. Hephaestos and Vahagn scold the Goddesses for forgetting to give Mukohda a defensive blessing, since if he dies there will be no more offerings. When Mukohda makes his weekly offering Hephaestos interrupts and grants Mukohda a defence skill. They heads to the dungeon where Mukohda encounters Vianca working at the desk and notices she is still obsessed with Fel.\n| LineColor           = #f39800\n}}\n| ShortSummary        = The group enters the dungeon but the impatient Fel runs them all the way down to floor 10. Mukohda is surprised many party's stop at floor 10, more interested in making a living than exploring further. Dora defeats a boss Tarantula with Vahagn's blessing so Mukohda collects the valuable parts. Lower down they find a rest area and encounter Werner and his Iron Will party. Mukohda shares wyvern stew with them before they go their separate ways. Fel, Dora and Sui defeat boss monsters all the way to floor 20 where Mukohda finds a treasure chest. Fel warns him it contains poisonous gas. Ninrir suddenly informs Mukohda all the Gods and Goddesses blessings have combined so he is effectively immune to almost everything that would kill a normal human, including poison. Mukohda opens the chest and finds gas poison but no treasure. He finds a Mimic monster disguised as a chest on floor 21 and kills it with his mithril sword, causing it to drop jewels and a magic recovery ring.  On floor 22 they find a forest where Mukohda insists they eat. From Online Grocery he buys other-world meat dishes including yakitori chicken, roasted duck and wagyu steaks. Everyone's stats are temporarily boosted by the meat except Mukohda, whose increase is pitiful.\n| LineColor           = #f39800\n}}\n| ShortSummary        = In the forest they encounter an S rank Vasuki snake which Fel, Dora and Sui defeat before moving on to floor 23 which specialises in giant monsters. Finding a rest area they stop for lunch of orc soup, steak sandwiches and hamburg sandwiches. The A rank party Tempest appears and Mukohda donates a healing potion to one of their injured members. The leader explains they will be returning to the surface. Mukohda loots a magic bag from another monster he uses to store treasure. Eventually they enter floor 30, which has never been conquered. Floor 30 turns out to be an immense desert so hot Sui almost melts. Mukohda helps by providing ice cream and sports drinks for hydration. He also provides heating pads and Rock Bird udon as the desert drops to below freezing at night. The next morning they enter the final boss room and confront Behemoth, which has skin impervious to magic and physical damage. They eventually realize Sui's acid weakens the skin, allowing them to kill it. As a prize Behemoth drops the adamantite lightning sword Caladbolg. To celebrate Mukohda makes a feast of fried foods; rockbird karaage, Japanese fried meats and vegetables and American corn dogs.\n| LineColor           = #f39800\n}}\n| ShortSummary        = Elrand is eager to interview Mukohda after being the first to conquer the dungeon but Ugohl insists they be allowed to rest. The group rescues two children, Darrel and Iris, from an orc in the forest. Darrel explains their father was an adventurer who died, so now they live alone with their mother. Recently their mother became sick so Darrel and Iris have been gathering herbs to sell and hire a healing priest. Mukohda plans to give them a healing potion, but Fel explains only the immortality granting Elixir is powerful enough to cure disease. Mukohda remembers Elrand mentioned dragon blood and liver can make Elixir, so he gives some of the blood and liver to Sui to attempt. Sui produces a Degraded Elixir powerful enough to cure disease but not grant immortality. Mukohda trades them the Elixir for the dead orc and sends them home. Darrel decides he wants to be a merchant like Mukohda. Mukohda discovers Online Grocery has levelled up, allowing him to buy speciality cakes and puddings. The Gods are furious Mukohda once again forgets their offerings, especially now he has cakes. The children's mother recovers and Darrel promises to become a great merchant and repay Mukohda properly.\n| LineColor           = #f39800\n}}\n}}\n| ShortSummary        = Elrand appraises the magic bag Mukohda filled with jewels and reveals they are of such high quality the guild doesn't have enough money to buy them. Instead, Ugohl has arranged to negotiate with the Merchant's Guild. Mukohda doesn't have time to cook, so he takes Fel, Sui and Dora to the local food stalls where they try Horned Rabbit skewers. The Merchant's Guild master Adriano and his appraiser Ruslan are amazed by the jewels, especially an ultra-rare Imperial Topaz. In total they offer Mukohda 7460 gold coins, the most money he has ever earned. And yet Ugohl insists for a collection that includes an Imperial Topaz the price they offered was so low it was practically an insult to Mukohda and the Adventurer's Guild. Panicking at the possibility of losing the Adventurer's Guild as customers Adriano raises the offer to 9480, which Ugohl accepts. For defeating the undefeated dungeon Mukohda is promoted from C rank to an A rank adventurer, meaning he can now take on royal quests. To celebrate Mukohda makes Orc bacon wrapped Bloody Horn Bull meatloaf. He also thanks Ugohl with cakes for his wife and children. The Gods and Goddesses, fascinated by the expansion to Mukohda's Online Grocery, take an interest in Japan so they can be more specific when requesting offerings.\n}}\n}}\nReception\nIn 2018, the manga adaptation was ranked as the second best isekai manga by Japanese bookstore employees.\nThe novel series was one of three novels series that won in the novel category of the Piccoma Award 2024.\nSee also\n* ''An Archdemon's Dilemma: How to Love Your Elf Bride—A light novel series the spin-off manga of which is also illustrated by Momo Futaba.\n* Sabikui Bisco''—A light novel series also illustrated by K Akagishi\nNotes\nReferences\nFurther reading\n*\nExternal links\n*\n*\n*\n*\n*"
    }
  ]
}