{
  "content": [
    {
      "type": "text",
      "text": "# Campaign for Better Transport (United Kingdom)\n\n| full_name                =\n| native_name              =\n| native_name_lang         =\n| logo                     = CampaignBetterTransport.svg\n| logo_size                = 300px\n| logo_alt                 =\n| logo_caption             = Campaign for Better Transport logo\n| map                      =\n| map_size                 =\n| map_alt                  =\n| map_caption              =\n| map2                     =\n| map2_size                =\n| map2_alt                 =\n| map2_caption             =\n| abbreviation             = CBT, CfBT\n| nickname                 =\n| pronounce                =\n| pronounce ref            =\n| pronounce comment        =\n| pronounce 2              =\n| named_after              =\n| motto                    =\n| predecessor              = Transport 2000 TrustCampaign for Better Transport Ltd\n| merged                   = Campaign for Better Transport Charitable Trust\n| successor                =\n| founders                 = Eric Robinson and Sidney Weighell\n| founding_location        = Hotel Russell, London\n| extinction               =\n| merger                   = Road Block (1 January 2007)\n| type                     = Nonprofit\n| vat_id                   =\n| registration_id          = Charity 1101929Company 04943428\n| status                   = Active (incorporated 24 October 2003)\n| purpose                  = Promote sustainable transport\n| professional_title       =\n| headquarters             = 7–14 Great Dover Street\n| area_served              = England and Wales\n| location                 = London, SE1 4YR\n| location2                = United Kingdom\n| coords                   =\n| origins                  = Liberal PartyNational Union of RailwaymenRailway Industry Association\n| region                   =\n| products                 = Research and campaigns\n| services                 = Consultancy\n| methods                  = Advocacy\n| fields                   = Transport and environment\n| membership               =\n| membership_year          =\n| owner                    =\n| sec_gen                  =\n| leader_title             = Chief Executive\n| leader_name              =\n| leader_title2            =\n| leader_name2             =\n| leader_title3            =\n| leader_name3             =\n| leader_title4            =\n| leader_name4             =\n| board_of_directors       = Board of trustees (12 as of 2020)\n| key_people               = Michael Palin (1986–2019)Stephen Joseph (1988–2019)Rebecca Lush (2007–2012)Siân Berry (2011–2015)\n| main_organ               =\n| parent_organization      =\n| subsidiaries             =\n| secessions               =\n| affiliations             = European Federation for Transport and Environment\n| budget                   =  £311,397\n| budget_year              = 2020/2021\n| revenue                  =  £517,143\n| revenue_year             = 2020/2021\n| disbursements            =\n| expenses                 =\n| expenses_year            = 2020/2021\n| endowment                =\n| endowment_year           =\n| staff                    = 5\n| staff_year               = 2020/2021\n| volunteers               =\n| volunteers_year          = 2020/2021\n| students                 =\n| students_year            =\n| website                  =\n| remarks                  =\n| formerly                 = Transport 2000 (renamed 1 September 2007)\n| footnotes                =\n| bodystyle                =\n}}\nCampaign for Better Transport is an advocacy group in the United Kingdom that promotes sustainable transport, particularly bus and rail services. It was launched as Transport 2000 in February 1973 by the National Union of Railwaymen with the Railway Industry Association, the Liberal Party Environmental Panel and others. In January 2007 it absorbed the Road Block anti-road building campaign led by Rebecca Lush and campaigned for less expenditure on road building. The organisation changed its name from Transport 2000 to Campaign for Better Transport in September 2007.\nHistory\nTransport 2000\nTransport 2000 was launched on 6 February 1973 with a press conference at the Hotel Russell, London. It initially had offices at 30-34 Buckingham Gate, Westminster. The formation of the organisation was a reaction to the newspaper disclosure in October 1972 that one of the options in a report for the Department of the Environment was the possible closure of a large part of the rail network. The organisation was formed by the National Union of Railwaymen and included the Railway Industry Association and the Liberal Party Environmental Panel, as well as environmentalists, amenity groups, trades unions and other transport groups.\nThe creation of the group was described in March 1973 as \"Yet another transport pressure group has appeared on the scene; known as Transport 2000, it has the backing of railway and environmental sections of the community. The Chairman is Mr. Eric Robinson, a member of the Liberal Environmental Panel, and he described the new group as the most comprehensive and ambitious transport lobby in Britain\".\nFrom launch in 1973, Transport 2000 campaigned for the UK Government to form a national transport policy. They identified too many vehicles in the wrong places, the threat of rail closures, damage done by large lorries and concerns over Concorde and a proposed third London airport as their initial focus.\nIn 1974 the organisation proposed a single ticket system for railways, Underground and buses and a single passenger transport authority for London. In 1984 they proposed reopening the Snow Hill Tunnel between Blackfriars and Farringdon (i.e. Thameslink), more services on the West London Line and a rail tunnel between Euston and Victoria (later known as Crossrail 2).\nIn 1998 Transport 2000 was part of a coalition of organisations which jointly launched the Slower Speeds Initiative which campaigns in favour of traffic calming, lower speeds and better enforcement of existing speed limits. Although a founding member, the organisation now focuses less on speed reduction in favour of other campaigns.\nA linked charity was registered in 2003: the Campaign for Better Transport Charitable Trust.\nThe organisation criticised Top Gear in 2005, saying that it was \"irresponsible, out-dated television designed to give comfort to boy racers, 'petrolheads' and those from the 'get out of my way' school of driving.\" In 2006 the group accused David Cameron of being a hypocrite, \"conning people about the environment\" because he was pictured cycling to work, but had his car follow with his briefcase.\nIn January 2007 Transport 2000 absorbed Road Block, an organisation which supported local groups that were resisting road schemes.\nCampaign for Better Transport\nIn September 2007 the organisation changed its name to Campaign for Better Transport. In 2011 the bus, rail and roads campaigns were given names and individual branding as Save our Buses, Fair Fares Now and Roads to Nowhere.\nKey people\nMichael Palin was appointed chairman in 1986. In 1987 he wrote and appeared in The Chairman, a programme made by Central Television about the work of Transport 2000. He subsequently retired as chairman and was made president. In 2006 The Times reported that Palin was facing moves to oust him as president because of his use of long-distance air travel; it was calculated that he had flown more than a quarter of a million miles in the previous 17 years while making his six TV series. The organisation denied any such suggestion, saying \"Michael Palin brings popular appeal, wisdom and a sense of proportion to the transport problems we as a society face today\". The Daily Telegraph also covered the story in their motoring section, initially claiming that over half of the organisation's funding came from the bus and rail sector, but then correcting the figure to 20%.\nStephen Joseph was appointed as executive director in 1988. He received an OBE for \"services to transport and the environment\" in the 1996 Birthday Honours. The House of Commons Transport Select Committee took evidence from Joseph regularly for many years, and the organisation was described in 2018 as \"the country’s leading transport NGO.\"  In the same year he was given a 'Lifetime Contribution to Transport' award.  He stepped down after 30 years in the post.\nIn 2007 Rebecca Lush, who had led Road Block and was a long-standing roads campaigner, was appointed as roads and climate campaigner. From 2011 to 2015 Siân Berry, who was Green Party candidate for Mayor of London in 2008, 2016 and 2021, worked as a roads and sustainable transport campaigner for the charity.\nJenny Agutter, Steve Norris and Tracy Marchioness of Worcester are patrons.\nFinances\nFor 2020/2021 its income was £517,143 (up from £358,000 in 2019/2020) and expenditure was £311,397 (down from £425,850 in 2019/2020).\nReferences\nExternal links\n*"
    }
  ]
}