{
  "content": [
    {
      "type": "text",
      "text": "# Camp Edwards\n\n| image         = Joint Base Cape Cod Tactical Training Base Kelley.jpg\n| image_size    = 300px\n| caption       = Tactical Training Base Kelley, Camp Edwards, 2018\n| type          = National Guard Training Camp\n| code          =\n| built         = 1941\n| builder       = U.S. Army Corps of Engineers\n| materials     =\n| height        =\n| used          = 1941–present\n| demolished    =\n| condition     =\n| ownership     = Commonwealth of Massachusetts\n| open_to_public = With prior permission\n| controlledby  =\n*Massachusetts National Guard\n| garrison      = Falmouth, Massachusetts\n| current_commander = Brigadier General Frank Keating\n| commanders    =\n| occupants     = U.S. Army, Massachusetts National Guard\n| battles       = World War I, World War II, Cold War\n| events        =\n}}\nCamp Edwards is a United States military training installation located in western Cape Cod in Barnstable County, Massachusetts. It was named after Major General Clarence Edwards, commander of the 26th Division in World War I. The base is currently the home of portions of the 3rd Battalion, 126th Aviation Regiment, of the Massachusetts Army National Guard.\nIn 1931, the National Guard deemed Camp Devens to be too small to meet their needs and began to look for a new training area, and two years later Cape Cod was identified as having a suitable environment to build a new camp.  Camp Edwards was officially dedicated in 1938.\nIn 1940, the U.S. Army leased Camp Edwards as a training facility as part of its mobilization strategy for World War II.  The Army undertook significant construction which helped to expand Camp Edwards from a rustic military post to a small city, overflowing with new GIs. The new plan called for new capacity to house 30,000 soldiers and was completed in just four months.  At the peak of the construction, 30 buildings were completed every day. During the war, the camp functioned as a sending off point for troops as well as a training ground for anti-aircraft and amphibious units. By mid-1944 the training centers were relocated to Florida, but the camp remained as a hospital, prisoner-of-war camp, and holding area for AWOL (Absent With Out Leave) soldiers being sent overseas until the end of the war.\nWith the end of the war, Camp Edwards was deactivated. The Air Force took control of nearby Otis Field in 1948, and Otis Air Force Base was born. During the Korean War, the camp was reactivated to train troops. After the war, the camp was again deactivated. The camp was never reactivated for the Vietnam War, but training did go on occasionally.\nCamp Edwards was subject to a closure attempt in the 1990s, but survived after objections from the military community. During Hurricane Katrina, the camp was utilized by the Federal Emergency Management Agency, opening up to 2,500 refugees.\nToday, the Camp is home to two training centers for National Guard troops. These training centers, which are the only ones in the Northeast other than those at Fort Drum and Fort Dix, are meant to simulate a middle-eastern town.\nUnits assigned\n*Massachusetts National Guard (1908–present)\n*3rd Battalion, 126th Aviation (???-present)\n*104th Infantry Regiment - ARNG Recruit Sustainment Battalion\n*101st Field Artillery Regiment\nPast\n*Amphibious Training Center (1942)\n*Engineer Amphibian Command (1942–1944)\n*East Coast Processing Center (1943–1945)\nArmy\n*1st through 4th Engineer Amphibian Brigades, redesignated as Engineer Special Brigades in May 1943 (1942–1943)\n*1114th SCU\n*504th Parachute Infantry Regiment (1943)\n*68th Coast Artillery Regiment (AA) (1940–1941)\n*550th AAA Auto Weapons Bn (1943)\n*551st AAA Auto Weapons Bn (1943–1944)\n*242nd AAA Group (1952–1953)\n*Combat Aircrew Refresher Training Unit (Otis Field)\n*26th Infantry Division\n*36th Infantry Division (1942–1943)\n*45th Infantry Division (1942)\n*37th Engineer Regiment (1942)\n*14th Anti-Submarine Squadron (1942–1943)\n*304th Station Hospital (1942-1943)\nMarines\n*1st Battalion, 25th Marines, 4th Marine Division, Fleet Marine Force (1977–2000)\nNon-military offices\n*U.S. Army Corps of Engineers\n*Federal Aviation Administration\n*U.S. Department of Agriculture\nHistory\nEarly training on Cape Cod\nA trainee poses for a photo\nCamp Edwards' beginnings can be traced back to 1908 when the Massachusetts State Militia practiced weekend and annual training in the Shawme-Crowell State Forest. The area was looked at in 1931 when the National Guard deemed Camp Devens to be too small and began to look for a new training area. People who supported and were against the military on the Cape made their voices heard to the Commonwealth and the War Department in 1935 when Governor James Curley signed a bill establishing a Military Reservation Commission. In September, the War Department approved acquisition of up to  on Cape Cod for the purpose of military training. In 1936, troops began setting up camp and began training. These soldiers were often equipped with World War I era equipment, wooden guns, and Enfield rifles. This reality reflected the isolationist policy of the American people.\nBarracks being built in 1940\nBetween 1935 and 1940, Massachusetts and the federal government, primarily using Works Project Administration funds, constructed 63 buildings (all but Buildings 102 and the old Williams Hospital have since been demolished) and two,  wide turf runways at Otis Field. The project was the largest WPA project in state history, employing over 600 workmen. In 1938, Governor Charles F. Hurley dedicated Camp Edwards, named after the commander of the 26th Division in World War I, Major General Clarence Edwards. In 1940, the biggest construction project in the camp's history began when the Army leased Camp Edwards. Construction was completed under the command of Major Thomas Waters, of the 68th AA Regiment. The Walsh Construction Company of New York was the company chosen to build the initial 1300 buildings in the cantonment area. These buildings were to house over 30,000 men. The goal was to have the area finished by the beginning of 1941 when the 26th Infantry Division began a year of training.\nA railroad spur was built from Falmouth and a constant procession of trucks transporting material to the camp began. Peak of construction occurred in November 1940, with 18,343 employees working three shifts, a weekly payroll in excess of one million dollars, and completion of 30 buildings a day. The project was completed in a mere 125 days (September 1940 to January 1941) and served as the national prototype for other camps built during World War II, using the 700 series drawings. The station was located on Weaver Street.\nIn January 1941, the 26th Infantry Division, which was recently federalized, consisted entirely of Massachusetts National Guard members. Over the next 3 months, its ranks filled up with members from New York and New England. Starting for 7 months in April 1941, the 26th left Camp Edwards to participate in the Carolina Maneuvers and the Coastal Patrol, while other National Guard and Army Divisions came to train the camp. The 26th returned to Camp Edwards on December 6, 1941, with the expectation of completing their year of service soon. The bombing of Pearl Harbor on December 7, 1941, and the subsequent declaration of war by the United States, resulted in extension of federal service for the division through 1945.\nWorld War II\nEarly aerial image of Camp Edwards, notice the beginnings of Otis Field in the foreground\nIn 1941, the 101st Observation Squadron was inducted into federal service and moved to Otis Field. The first concrete runways were laid in 1942 and expanded in 1943 because of the advancements of allied aircraft. The field became an important anti-submarine base because of its proximity to the ocean, and subsequently the Army placed the 14th Antisubmarine Squadron at the field from November 1942 until July 1943. The Navy took over all anti-submarine missions in October.\nOn February 2, 1942, a massive fire swept through a garage on the base. This fire destroyed 125 vehicles, including 40 which were new. This was the only massive fire to ever occur at the base.\nA coast artillery battalion (anti-aircraft) was stationed at Camp Edwards from 1942 to 1944. It formed the core of the Antiaircraft Artillery Training Center, Camp Edwards, one of seven such U.S. Army facilities in World War II. This was activated 28 March 1942 as part of the Army Antiaircraft Command. The Camp Edwards center trained 42 anti-aircraft battalions before it was deactivated in July 1944. Camp Edwards had at least two firing ranges at satellite camps in 1941–1942, the Popponesset Firing Range in Mashpee on the cape's south coast and the Scorton Neck Firing Range in Sandwich on the cape's north coast. The Scorton Neck range was used for antiaircraft and other training with weapons ranging from .22-caliber small arms to 90-mm antiaircraft guns. The types of weapons used at the Popponesset range are unclear. Reportedly, Scorton Neck was in use for a period of 110 days and Popponesset for 60 days. Another anti-aircraft training center was Camp Wellfleet in eastern Cape Cod.\nThe Amphibious Training Center (initially the Amphibious Training Command) was activated at Camp Edwards under Army Ground Forces command on 22 May 1942, followed shortly by the Engineer Amphibian Command under the United States Army Corps of Engineers on 10 June 1942. The Amphibious Training Center was initially commanded by Colonel Frank A. Keating. The amphibian command was commanded by Colonel Daniel Noce, with Lieutenant Colonel Arthur Trudeau as his chief of staff. Camp Edwards was selected for being an established post close to beaches. Although it was recognized that it would be unsuitable for training in winter, the initial concept was that training would be concluded by November 1942. Planning originally envisioned an invasion of Europe in 1942, but was changed to support an invasion of North Africa in December 1942.\nInitially eight Engineer Amphibian Brigades, redesignated as Engineer Special Brigades in May 1943, were planned to be trained, five of these at Camp Edwards in 1942. This was scaled back, and eventually six brigades were trained, four at Camp Edwards. Three of the six deployed to Europe; the other three to the Pacific. Three satellite camps were established for training, all of them in beach areas on the southern coast of Cape Cod. Camp Cotuit (soon nicknamed Camp Candoit) was in Cotuit. Camp Havedoneit was in Osterville and was also a maintenance facility including the Crosby Yacht boatyard. Camp Washburn was on Washburn Island in Falmouth. Training was also conducted on Martha's Vineyard. The 36th Infantry Division and the 45th Infantry Division were the divisions initially involved in training. Those divisions later fought in several European campaigns, including amphibious assaults in Sicily and Salerno, Italy in 1943. The first seasickness pill was also tested by the divisions. In fall 1942 Camp Edwards was \"winterized\", with the Amphibious Training Center and the brigades in training relocated to Camp Carrabelle (later Camp Gordon Johnston) in Carrabelle, Florida. By December 1943, the Engineer Amphibian Command had largely accomplished its purpose with the training of the 4th Engineer Special Brigade and replacements for the deployed brigades. A small supply staff remained until the command was dissolved in April 1944.\nThe \"Convalescent Hospital\" was established at Camp Edwards in 1942. In addition to serving wounded coming back from both theaters, the hospital became famous for its convalescent trains that crossed the country and for its WAAC training program for New England nurses. Over 2500 nurses stopped for training at Camp Edwards before going overseas between 1942 and 1944.\nA mock German village was constructed at Edwards in 1942. This was one of the first instances of training for urban warfare.\nThe East Coast Processing Center was established in October 1943. It was the first such facility in the United States. The center housed men who were AWOL prior to shipping them overseas. Most men stayed for a month before being shipped out. Between 1943 and 1945, more than 40,000 men were processed through this center.\nAfter the Allies began the invasion of North Africa in December 1942, the US Army built a prisoner-of-war camp for captured German soldiers. The camp, located at the south end of the runway, housed up to 2,000 POWs at a given time, many of whom were from Rommel's famed Afrika Korps. The prisoners worked around Camp Edwards much of the time, but were also sent to work in the area's farms and cranberry fields.  German prisoners also assisted in salvaging millions of board feet of lumber after the Otis vicinity was devastated by a hurricane in September 1944. 4 sawmills were supposed to be built at the base to cut up this lumber. The 1114th SCU maintained security and managed the camp throughout the war. By the end of the war, the POW camp had received, processed, and repatriated up to 5,000 POWs.\nBy June 1944, Camp Edwards had expanded to an area of , capable of accommodating 1,945 officers and 34,108 enlisted personnel.\nIn its last act of the war, Camp Edwards was the location of a Temporary Separation Center for discharging returning GIs. More than 12,900 men were discharged from the armed forces from 1945 to 1946.\nCold War\nAfter the war, it was not uncommon for soldiers to train on local beaches firing artillery rounds into the sea. These rounds were blanks due to the fact that they were usually firing into the Cape Cod Canal entranceway.\nDuring the Cold War, Camp Edwards remained active and continued training troops. During the Korean War, the base was activated and troop levels approaching World War II were again seen at the base. In 1958, the Atomic Energy Commission recommended that nuclear waste reprocessing be conducted at the camp. It never happened.\nGrowth of Otis Air Force Base\nEC-121 Constellations on the ramp of Otis AFB, this ramp was later used by the 102nd Fighter Wing\nDeactivated in 1946 and moved to caretaker status by the Army, Camp Edwards was used primarily for Air National Guard and Army National Guard training. The runway was also extended to  and the 101st Observation Squadron was reactivated as the 101st Fighter Squadron. In 1948, the Air Force obtained Otis Field, renaming it Otis Air Force Base. Camp Edwards was reactivated in 1950 for troop training support for the Korean War, with levels approaching that of World War II.\nOn April 9, 1952, a C-47 transport plane, which had taken off from Otis, suffered a mid-air collision over Camp Edwards with an F-94B, resulting in the deaths of all 12 men aboard the planes (10 on the C-47 and two on the F-94B).\nIn 1954, Congress authorized the transfer of the camp from the Department of the Army to the Department of the Air Force, for the purpose of operating a military airfield. The Army still used its usual areas while the Air Force expanded. Between 1951 and around 1956, the Air Force constructed numerous new hangars and other buildings on the south side of Otis. Otis became one of three Air Defense Command bases in the northeast, the others being Hanscom Air Force Base and Ethan Allen Air Force Base. Air Defense Command built a series of fighter alert hangars at Otis in the 1940s and 1950s. Otis fulfilled its role through the crews and aircraft of the 33rd Fighter Interceptor Wing, whose headquarters were established at Otis. The 564th Air Defense Group, consisting of the 58th and 437th Fighter Squadrons, was also based at and conducted missions from Otis. The 564th was later redesignated the 33rd Air Defense Group.\nIn 1955, the Air Defense Command's 551st Airborne Early Warning and Control Wing was assigned to Otis Air Force Base to conduct reconnaissance missions and expand the country's defensive perimeter. The 551st operated the EC-121 Constellation that were modified to conduct long-range flights over the Atlantic Ocean. Other Air Defense Command units conducting air defense missions from Otis AFB at this time included the 4707th Air Defense Wing, the 33rd Fighter Wing, and the 58th and 60th Fighter-Interceptor Squadrons. During the late 1950s and early 1960s, Otis AFB played a role in the technologically advanced national defense Semi Automatic Ground Environment, which was under the command of North American Aerospace Defense Command. Otis AFB served as a node in gap-filler radar and flight support. In 1959, the Air Force constructed a counterpart to the Army's Nike missiles, and CIM-10 BOMARC anti-aircraft missiles were installed on a site northwest of the airfield. Otis was one of eight such facilities in the country. The site was run by the 26th Air Defense Missile Squadron.\nJohn F. Kennedy disembarks from a plane, while a girl, probably Caroline, runs towards him\nAs a result of John F. Kennedy becoming president in 1961, Otis became an important stop for Air Force One due to the proximity of the Kennedy Compound in nearby Hyannisport, called the \"Summer White House\" during his tenure in office. Kennedy maintained office space in Building 102 and used Building 110 (Kennedy Cottage) as a staging area for meetings and public affairs events when arriving or leaving from the airfield.\nNational Guard resumes control\nIn 1973, the Army began its withdrawal from Camp Edwards. Otis Air Force Base was also closed this year. In 1975, Otis reopened as Otis Air National Guard Base and all operations on the land occupied by Otis and Camp Edwards came under the control of the new Massachusetts Military Reservation. In 1978, the Air Force returned with the Perimeter Acquisition Vehicle Entry Phased Array Warning System, more popularly known as PAVE PAWS. This new facility was known as Cape Cod Air Force Station. In 1986, an artilleryman from the Connecticut Army National Guard overloaded a gun and the shell overshot the target by over a mile, hitting U.S. Route 6. No one was injured in the incident, although a two foot wide crater that was three inches deep occurred.\nRecent years\nA UH-1 Huey hovers during a training mission\nCamp Edwards has continued to provide training for Army National Guard units across the nation. It has recently been talked about as being the home for a new Department of Homeland Security training center. This would be the second known one for Edwards, the first being the mock German village set up during World War II.\nFormerly known as Massachusetts Military Academy (MMA), the Regional Training Institute relocated to Camp Edwards from Camp Curtis Guild in Reading in 1986. From 1972 until 1986, Camp Edwards had been the site for the MMA's annual two-week training period. Since the academy's relocation and its re-designation as the RTI, all activities including the two-week training period have been conducted at Camp Edwards. Its functions include the officer candidate school for the Massachusetts Army National Guard.\nEnvironmental & Readiness Center (E&RC)\nSince the late 1970s, Massachusetts Military Reservation, which sits atop the primary drinking water aquifer serving Cape Cod, has been the site of the nation's largest government-mandated and -funded environmental cleanup project. Decades of unchecked use and disposal of explosives, ammunition, fuels and chemicals, as well as sewage runoff, resulted in multiple contaminated groundwater plumes. While the Air Force and Army are the entities charged with remediation efforts, the Massachusetts National Guard has been working to modify its systems in an environmentally responsible manner while maintaining the rigid standards and requirements of military training.\nBase closure proposal\nIn 1998, Congressman William Delahunt proposed closing Camp Edwards. In 1999, Governor Paul Cellucci proposed turning the northern 15,000 acres (6,000 ha), which includes Pine Hill, the highest point on Cape Cod, into a state conservation area. This was met by protests from those in the Massachusetts National Guard and the proposal was later dropped.\nIn 2005, the Base Realignment and Closure Commission (BRAC) voted in 2005 to close Otis Air National Guard Base, a move that would have affected all tenants at Massachusetts Military Reservation. An agreement was ultimately brokered whereby the 102d Air Fighter Wing was transitioned into the 102nd Intelligence Wing, with Coast Guard Air Station Cape Cod remaining at the reservation. Though the 102d AFW and its fleet of fighter jets were relocated to Barnes Air National Guard Base in Westfield, the retention of the entities and the continued sharing of key operating costs such as base security, road maintenance, snow removal, water, utilities and sewage treatment ensured the missions carried out at Camp Edwards would continue.\nIn the aftermath of Hurricane Katrina, Camp Edwards was opened to 250 evacuees from the New Orleans area. They were housed in aging but unoccupied military barracks, which were updated in short order with new mattresses, furnishings and linens, and served meals at three nearby dining halls.\nRecent construction\nOn June 7, 2008, two new training facilities were dedicated in honor of fallen soldiers from the Massachusetts Army National Guard.\nAn example of Theater Immersion Training, TTB is designed to rapidly build combat-ready units by simulating military environments encountered during missions in Iraq, Afghanistan, or the Balkans. Soldiers live in tents with modular units provided for shower and sink facilities, and the base is surrounded by barriers filled with dirt and barbed wire, entry control points and guard towers. The base is named in honor of Sgt. Michael J. Kelley of Scituate, Mass. Kelley, a member of E Battery (Target Acquisition) of the 101st Field Artillery, was killed in action in Afghanistan on June 8, 2005.\nDesigned to meet the training requirements of a company-sized unit in an urban environment, Military Operations in Urban Terrain (MOUT) Site Calero includes 48 buildings constructed from connex containers up to two stories high, with a mixture of rubble and complete structures. The layout includes a residential area, school, marketplace, and worship area. Soldiers learn how to clear rooms and buildings in built-up areas, conduct house-to-house searches by foot in hostile urban areas and distinguish between the characteristics of an innocent civilian and an embedded insurgent aiming to do harm. The MOUT also includes a building used for training classes and after-action review sessions. The site is named in honor of Maj. Jeffrey R. Calero of Queens Village, N.Y. Calero, a member of Operational Detachment Alpha 2132, C Company, 1st Battalion, 20th Special Forces Group (Airborne), was killed in action in Afghanistan on October 29, 2007.\nOther recently planned, modified or additional elements of Camp Edwards' training facilities include the following:\nA Battle Simulation Center with a JANUS hardware and software suite, flexible room configuration, built-in PA, DVD, and power point systems; supports a wide range of tailored training including Warfighter Exercises, Virtual Battlefield Trainer (VBT) and multi-agency table top exercises. The BSC has also been used as an Emergency Operations Center during disaster responses.\nPlans are in place as of 2010 to construct a  Live Fire Shoot House that will permit all Massachusetts Army National Guard personnel to perform essential combat tasks that will improve their readiness posture prior to mobilization. The facility will support small arms familiarization in a confined environment, along with collective training and pre-mobilization requirements for deploying units, and will allow soldiers to train in the close quarters combat skills faced during overseas combat deployments. The range will also be available for use by other Department of Defense and federal agencies to better prepare them for room clearing operations.\nThe Tactical Training Team is a team of non-commissioned officers (NCOs) whose primary mission is to provide national guard soldiers with the necessary knowledge, skills, and abilities in order to close with and destroy the enemy in the Global War on Terror. The TTT also remains ready and available to assist other units and organizations from the Department of Defense, Department of Homeland Security, law enforcement personnel and first responders in all areas of tactical training.\nThe TTT is designed to augment and work closely with the Massachusetts Army National Guard's Pre-Deployment Training Assessment and Evaluation (PTAE) Team, which is responsible for ensuring that units deploying into combat are validated in all training standards as directed by First Army. Areas of TTT expertise include combatives; weapons; communications; calling for and adjusting indirect fire; combat lifesaver techniques; air assault operations; military operations on urban terrain; IED defeat techniques; operations in chemical, biological, radiological and nuclear environments; and all leader tasks.\nAll members of the Camp Edwards TTT are NCOs recently returned from deployments in Iraq and/or Afghanistan, have held leadership positions, and are qualified instructors meeting all US Army standards.\nOn 20 September 2014, three Afghanistan military officers visiting Camp Edwards went missing at Cape Cod Mall during an event where they were to be introduced to American culture. They were later found trying to enter Canada while asking for asylum near Niagara Falls.\nTraining Support Center (TSC)\nIncludes two  rappel towers, an obstacle course, a driver training area, and the following specialized facilities:\n*Call For Fire Trainer (CFFT)- Provides a simulated battlefield for training Joint Fires Observers at the institutional and unit level.\n*Indoor Simulated Weapons Training- Includes the Equipment Skills Trainer (EST) and Fire Arms Training System (FATS).\n*Leadership Reaction Course (LRC)- A practical exercise facility using 17 stations to build leadership skills, encourage teamwork, develop technical and tactical proficiency, and confidence.\n*Virtual Convoy Operations Trainer (VCOT)- Simulates Baghdad and other geo-specific areas for mission rehearsals, leader training, and after-action reviews. Provides 360-degree visibility and weapon engagement area. Exercises include enemy IEDs, RPGs, machine gunners, riflemen, \"technical\" trucks, mortars, and suicide vehicles.\nNotable attendees\n*Charles H. Coolidge- medal of honor recipient during WWII\n*Bill Mauldin - 45th Infantry Division\n*Eddie Waitkus - 544th Engineer Boat & Shore Regiment, 4th Engineer Special Brigade US Army\n*Henry T. Waskow - Company B, First Battalion, 143rd Regiment, 36th Infantry Division\nSee also\n*List of military installations in Massachusetts\nReferences\nExternal links\n*[https://web.archive.org/web/20110707213249/http://www.barnstablepatriot.com/home2/index.php?option=com_content&task=view&id=6732&Itemid=112 Camp Edwards and the 'Foxholes at Sea']"
    }
  ]
}