{
  "content": [
    {
      "type": "text",
      "text": "# Campaigns of 1793 of the French Revolutionary Wars\n\nThe French Revolutionary Wars re-escalated as 1793 began. New powers entered the First Coalition days after the execution of King Louis XVI on 21 January. Spain and Portugal were among these.  Then, on 1 February France declared war on Great Britain and the Netherlands.\nThree other powers made inroads into overwhelmingly French-speaking territory in the following months prompting France to amass, domestically, an army of 1,200,000 soldiers.  The very ascendant Jacobins executed thousands of proven and suspected dissenters, in the final, climactic phase of the Reign of Terror.  Counter-revolutionary forces turned Toulon over to Britain and Spain on 29 August, capturing much of the French navy, a port not retaken by Dugommier (with the assistance of the young Napoleon Bonaparte) until 19 December.  Between these months a battle on the northern frontier, in September, was won by France, which saw the mainly British siege of Dunkirk lifted.  The year ended with the First French Republic's government, the National Convention, having rebuffed attacks from the south and south-east but having made an unsuccessful counter into Piedmont (toward Turin).\nCampaigns\nAt the opening of the year, Dumouriez chose to ignore orders from the government in Paris to defend Belgium and instead began an invasion of the Netherlands, hoping to overthrow the stadtholder and establish a popular republic backed by France. In the event, he took Breda in Brabant and prepared to cross into Holland and capture Dordrecht. However, the armies remaining in Belgium suffered a number of defeats, such as by the Austrians at Aachen and Liège and their raising (lifting) Miranda's siege of Maastricht. Dumouriez was forced by his superiors to return to Belgium and take command in the Flanders Campaign.\nAfter a defeat at Neerwinden, Dumouriez had to retreat from Belgium. He then made an agreement with the Austrians to hand over to them several border fortresses in return for a truce where he could march on Paris and restore the monarchy under the Constitution of 1791. However, he was unable to secure the loyalty of his troops, and he defected to the Austrian lines rather than face arrest by the Jacobins.\nAt the same time, the increasing power of radicals in Paris incited revolt in the provinces, with the people of Lyon and Marseille rebelling and the Vendée raising an army to attack the central government and open communications with Britain. Spanish armies crossed the Pyrenees, Kingdom of Sardinia (largely Piedmont-Savoy) armies various Alpine borders, and Austrian armies occupied Valenciennes and forced the northern armies back toward Paris. Britain ordered a naval blockade of France on 31 May.\nThe revolutionary government prepared a full mobilization of the nation (see Levée en masse), showing no mercy to internal or external enemies. According to Mignet's History of the French Revolution: \"The republic had very soon fourteen armies, and 1,200,000 soldiers. France, while it became a camp and a workshop for the republicans, became at the same time a prison for those who did not accept the republic.\" They proceeded to suppress Caen, Lyon, and Marseille, although the counter-revolutionary forces turned Toulon over to Britain and Spain on 29 August, resulting in the capture of much of the French navy, and Toulon was not retaken by Dugommier (with the assistance of the young Napoleon Bonaparte) until 19 December.\nIn September, Nicolas Houchard defeated the Duke of York at Hondschoote, forcing him to abandon the siege of Dunkirk. In October Jean-Baptiste Jourdan, taking over the northern armies, won the Battle of Wattignies and returned to the offensive, but did not make major gains before the winter.\nIn the Pyrenees, the French armies ended the year on a defensive posture near the border, while on the Alpine frontier, a French invasion of Kingdom of Sardinia failed.\nSee also\n* War in the Vendée\nNotes\nReferences\nThe main source for this article is the out-of-copyright [https://archive.today/20050307193925/http://www.outfo.org/literature/pg/etext06/8hfrr10.txt History of the French Revolution from 1789 to 1814], by François Mignet (1824), as made available by Project Gutenberg, as well as other Wikipedia articles.\nFurther reading\n*"
    }
  ]
}