{
  "content": [
    {
      "type": "text",
      "text": "# Canada–United Kingdom Free Trade Agreement\n\n| type                    = Free trade agreement\n| context                 = Trade agreement between Canada and the United Kingdom\n| date_drafted            =\n| date_signed             =\n| location_signed         =\n| date_sealed             =\n| date_effective          =\n| condition_effective     =\n| amendment               =\n| date_expiration         =\n| date_expiry             =\n| provisional_application =\n| mediators               =\n| negotiators             =\n*    Mary Ng from 24 March 2022 until 25 January 2024\n*    Anne-Marie Trevelyanfrom 24 March 2022 until 6 September 2022    Kemi Badenochfrom 6 September 2022 until 5 July 2024    Jonathan Reynoldsfrom 5 July 2024 until 25 January 2024\n| original_signatories    =\n| signatories             =\n| parties               =\n*  Canada\n*  United Kingdom\n| ratifiers               =\n| depositor               =\n| depositories            =\n| citations               =\n| language                =\n| languages               =\n| wikisource              =\n| wikisource1             =\n| wikisource2             =\n| wikisource3             =\n| wikisource4             =\n| wikisource5             =\n| footnotes               =\n}}\nThe Canada–United Kingdom free trade agreement (CUKFTA) is a proposed free trade agreement which began negotiations on 24 March 2022.  The trade agreement will be the third FTA to cover Canada–UK trade, and will supersede the Canada–United Kingdom Trade Continuity Agreement, extending the deal to cover services and digital trade.\nHistory\nFrom 21 September 2017 until 30 December 2020, trade between Canada and the UK was governed by the Comprehensive Economic and Trade Agreement, while the United Kingdom was a member of the European Union. Following the withdrawal of the United Kingdom from the European Union, the UK and Canada signed a continuity trade agreement on 22 December 2020, based on the EU free trade agreement; the agreement entered into force on 1 January 2021. Trade value between Canada and the United Kingdom was worth £26,309 million in 2022.\nWhile a member of the European Union, the Canada and Britain worked together on negotiations towards a Comprehensive Economic and Trade Agreement (CETA) between Canada and the European Union. The agreement has been ratified by the European Parliament and is provisionally in force since 2017.\nThe UK left the European Union at the end of January 2020, but continued to participate in the EU's trade agreements during a transition period that ended on 31 December 2020. In November 2020, the UK and Canada signed a continuity agreement in order to apply the terms of the EU-CA agreement to their  bilateral trade. In March 2023, the UK  concluded  negotiations to accede to the Comprehensive and Progressive Agreement for Trans-Pacific Partnership a trade bloc of which Canada is a founding member.\nNegotiations\n{| class=\"wikitable sortable\"\n|+ CUKFTA Round of Negotiations\n|-\n! Round !! Dates !! Location !! Ref.\n|-\n| 1 || 28 March–1 April 2022 || London ||\n|-\n| 2 || 20–24 June 2022 || Ottawa ||\n|-\n| 3 || 12–16 September 2022 || Virtual meeting ||\n|-\n| 4 || 28 November–2 December 2022 || Ottawa ||\n|-\n| 5 || 20–24 March 2023 || London ||\n|-\n| 6 || 26–30 June 2023 || Ottawa ||\n|-\n| 7 || 5–16 November 2023 || Virtual meeting ||\n|-\n| 8 || 27 November–1 December 2023 || Virtual meeting ||\n|}\nOn 25 January 2024, the United Kingdom suspended negotiations for the free trade agreement due to a standoff between the two sides on the UK maintaining market access barriers for Canada's agriculture industry. This was the first time that the United Kingdom has suspended negotiations for a trade deal since Brexit.\nOn 15 June 2025 prior to the 51st G7 summit, Starmer and Canadian Prime Minister Mark Carney agreed to establish an Economic and Trade Working Group, while Carney agreed Canada would ratify the UK's accession to CPTPP. While the UK was already a member of the CPTPP since 2023, Canada's ratification would allow the terms of the deal to apply between Canada and the UK.\nSee also\n*Canada–United Kingdom relations\n*Free trade agreements of Canada\n*Free trade agreements of the United Kingdom\n*Foreign relations of Canada\n*Foreign relations of the United Kingdom\nReferences"
    }
  ]
}