{
  "content": [
    {
      "type": "text",
      "text": "# Canada–United Kingdom Trade Continuity Agreement\n\n| type                    = Free Trade Agreement & Economic Integration Agreement\n| context                 = Trade continuity agreement between Canada and the United Kingdom\n| date_drafted            =\n| location_signed         =\n| date_sealed             = 21 November 2020\n| date_signed             = 8 December 2020\n| date_effective          = 1 April 2021\n| condition_effective     =\n| amendment               =\n| date_expiration         =\n| date_expiry             =\n| provisional_application =\n| mediators               =\n| negotiators             =\n*  Mary Ng\n*  Liz Truss\n| original_signatories    =\n| signatories             =\n| parties                 =\n*  Canada\n*  United Kingdom\n| ratifiers               =\n| depositor               =\n| depositories            =\n| citations               =\n| language                =\n| languages               =\n| wikisource              =\n| wikisource1             =\n| wikisource2             =\n| wikisource3             =\n| wikisource4             =\n| wikisource5             =\n| footnotes               =\n}}\nThe Canada–United Kingdom Trade Continuity Agreement (TCA) is a free trade agreement between the United Kingdom and Canada. Discussions had been ongoing between both parties during the Brexit transition period. A deal was finally agreed upon on 21 November 2020, signed on 8 December, and entered into force on 1 April 2021. The agreement is mostly a rollover of the CETA agreement, but it paved the way to a deeper free trade agreement between Canada and the UK.\nHistory\nAs the United Kingdom withdrew from the European Union in January 2020, both the UK and Canada sought to replicate the Comprehensive Economic and Trade Agreement (CETA) to avoid any disruption of trade after the Brexit transition period ended on 31 December 2020.\nNegotiations for the trade agreement began at the beginning of 2020,  a deal was finally agreed upon on 21 November 2020. The agreement was signed on 8 December 2020, and entered into force on 1 April 2021. Canadian Prime Minister Justin Trudeau described the deal as an \"easy one\".\nTrade & Investment\nThe benefits locked in under the agreement reached include:\n- Future zero tariffs on UK car exports to Canada, which were worth £757 million in 2019, supporting factories and jobs in communities. Without this agreement, Canada's standard tariffs on cars of 6.1% would have applied.\n- Tariff-free trade on 98% of goods that can be exported to Canada including beef, fish and seafood and soft drinks.\n- UK and Canadian producers will continue to benefit from zero tariffs on many agricultural and seafood exports including chocolate, confectionery, fruit and vegetables, bread, pastries and fish.\nWithout the continuity agreement, Canadian food products such as maple syrup, biscuits and salmon could have been more expensive for British consumers as they would have faced taxes of up to 8% when entering the UK under the UK Global Tariff.\nOverall, the terms of the UK-Canada Trade Continuity Agreement are the same as the Comprehensive Economic and Trade Agreement. The text of the Agreement was expected to be released once signed by both parties.\nExpiration\nWhile the main agreement remains in force, certain chapters have expired:\n*The preferential access deal for British cheesemakers into Canadian markets expired on the 31 December 2023.\n*From 1 April 2024, British car exporters into Canadian markets have a tariff of 6.1% if they contain significant EU components; British-origin cars require 55% UK components, increased from 50%.\nSee also\n* Canada–United Kingdom Free Trade Agreement\n* Canada–United Kingdom relations\n* Comprehensive Economic and Trade Agreement\n* Free trade agreements of Canada\n* Free trade agreements of the European Union\n* Free trade agreements of the United Kingdom\n* List of bilateral free trade agreements\n* Bilateral agreement\n* Multilateral treaty\n* UK Free Trade Agreements\nReferences"
    }
  ]
}