{
  "content": [
    {
      "type": "text",
      "text": "# Canadian Expeditionary Force Command\n\n| image= CEFCbadge.png\n|caption=Badge of CEFCOM\n|dates= 2006–2012\n|country= Canada\n|branch= Canadian Armed Forces\n|type= Command headquarters\n|role=\n|size=\n|Engagements=\n|command_structure=\n|current_commander=Lieutenant-General Stuart Beare\n|garrison=\n|ceremonial_chief=\n|colonel_of_the_regiment=\n|nickname=\n|patron=\n|motto=\n|colours=\n|march=\n|mascot=\n|notable_commanders=\n|anniversaries=\n}}\nCanadian Expeditionary Force Command (CEFCOM, French:  or ) was an operational element of the Canadian Forces for operations outside of Canada, created in 2006 and merged into the Canadian Joint Operations Command in 2012.\nUnder the CF structure, Canadian Expeditionary Forces Command (CEFCOM) was the unified command that was responsible for all Canadian Armed Forces (CAF) international operations, with the exception of operations conducted solely by Canadian Special Operations Forces Command elements. CEFCOM missions included combat operations, humanitarian assistance and peacekeeping.\nOperations\nSimilar to the integrated chain of command put in place under Canada Command (Canada COM), the CAF's operational command headquarters responsible for domestic operations, CEFCOM brought together under one operational command the maritime, land and air force assets to conduct humanitarian, peace support or combat operations wherever they were required internationally.\nHeadquartered in Ottawa, CEFCOM was responsible for setting the standards for integrated training and final certification of assigned forces – ensuring that all units and personnel selected to conduct overseas duties were fully trained and ready to do so.\nAfghanistan\nIn 2011, over 3,900 servicemen were deployed, the majority of which were part of the Joint Task Force - Afghanistan. In July 2011, the authorized strength Afghanistan was of 1,959 servicemen for two tasks, firstly the Canadian contingent of the International Security Assistance Force which ended in December 2011 and secondly aimed at training Afghan security forces personnel.\nMotto and badge\nThe CEFCOM motto was , Latin for \"united in purpose\".  This motto represented the civilians and military members from different elements working together, accomplishing the missions and contributing to the security of Canada, and was continued by Canadian Joint Operations Command following the 2012 merger.\nThe CEFCOM badge contained a black background, with a falcon holding a globe in its talons.  The black background represented military fortitude and the notions of action and combat, the globe symbolized CEFCOM's area of operations, and the falcon represented someone who did not rest until the objective is achieved.\nSee also\n* Military history of Canada\n* History of the Canadian Army\n* Canadian Armed Forces\n* List of armouries in Canada\nReferences"
    }
  ]
}