{
  "content": [
    {
      "type": "text",
      "text": "# Canadian Screen Awards\n\nThe Canadian Screen Awards () are awards given for artistic and technical merit in the film industry recognizing excellence in Canadian film, English-language television, and digital media (web series) productions. Given annually by the Academy of Canadian Cinema & Television, the awards recognize excellence in cinematic achievements, as assessed by the Academy's voting membership.\nThe awards were first presented in 2013 as the result of a merger of the Gemini Awards and Genie Awards—the Academy's previous awards presentations for television (English-language) and film productions. They are widely considered to be the most prestigious award for Canadian entertainers, artists, and filmmakers, often referred to as the equivalent of the Academy Awards and Emmy Awards in the United States, the BAFTA Awards in the United Kingdom, the AACTA Awards in Australia, the IFTA Awards in Ireland, the César Awards in France and the Goya Awards in Spain.\nHistory\nThe award's historic roots stem from the Canadian Film Awards, which were presented for film from 1949 to 1978, and the ACTRA Awards, which were presented for television from 1972 to 1986. The Academy took over the CFAs in 1978 to create the new Genie Awards, and took over the ACTRAs in 1986 to create the Gemini Awards. The Academy additionally created the Bijou Awards in 1981 as a new home for CFA specialty categories, such as television films, that had not been retained by the Genie Awards, but presented them only once before discontinuing that program.\nIn April 2012, the Academy announced that it would merge the Geminis and the Genies into a new awards show that would better recognize Canadian accomplishments in film, television, and digital media. On 4 September 2012, the Academy announced that the new ceremony would be known as the Canadian Screen Awards, reflecting the multi-platform nature of the presentation's expanded scope and how Canadians consume media content. The inaugural ceremony, hosted by comedian Martin Short and broadcast by CBC Television, took place on 3 March 2013.\nDue to the number of awards presented, many of the less prominent awards have been presented at a series of untelevised galas during Canadian Screen Week, the week leading up to the televised ceremonies. For the 13th Canadian Screen Awards in 2025, the Academy opted to reduce the length of these advance events, which will now be held entirely on the Friday and Saturday immediately before the main gala.\nDue to the COVID-19 pandemic, the Canadian Screen Awards did not hold an in-person presentation between 2020 and 2022. All ceremonies were held as virtual events beginning with the 8th Canadian Screen Awards, with the non-televised galas replaced by streaming presentations during Canadian Screen Week, with no television broadcast. The 10th Canadian Screen Awards were originally scheduled to be held at the TIFF Bell Lightbox in Toronto, but due to Omicron variant and restrictions being reimplemented in the province of Ontario, the presentation was once again held as a virtual event. A television presentation returned, with winners in top categories announced during an hour-long, pre-recorded special on CBC Television hosted by TallBoyz.\nWhile in-person presentations were reinstated for 2023, the broadcast on CBC Television remained a pre-recorded special featuring highlights from the non-televised galas, linked by host Samantha Bee, rather than a live event.\nIn August 2022, the Academy announced that it would discontinue its past practice of presenting gendered awards for film and television actors and actresses; beginning with the 11th Canadian Screen Awards in 2023, gender-neutral awards for Best Performance will be presented, with eight nominees per category instead of five. In 2023, the Academy announced further changes for the 12th Canadian Screen Awards, instituting a new genre separation for best leading and supporting performances in drama and comedy films, and introducing a new category for best performance in a live action short film. No change was introduced in television acting categories, which already feature a genre separation for drama and comedy.\nAt the 12th Canadian Screen Awards, the film BlackBerry, which documented the rise and fall of the BlackBerry phone, broke the record for the most nominations for a film in the history of the Canadian Screen Awards, with 17 nominations.\nName\nAs of 2023, the Academy has not announced any official nickname, such as \"Oscar\" for the Academy Awards. Many Canadian television and film critics and others have suggested potential nicknames, including the straightforward abbreviation \"Screenies\"; tributes to film and television legends including \"Candys\" in memory of actor John Candy, \"Pickfords\" in honour of actress Mary Pickford and \"Normans\" in honour of director Norman Jewison; \"Angels\" as a descriptive reference to the trophy's \"wings\"; and \"Gemininies\" as a portmanteau of the awards' former names.\nThe Academy invited suggestions from viewers via social media, with CEO Helga Stephenson suggesting that the board would consider the suggestions and potentially announce a naming choice in time for the 2014 ceremony. No formal nickname was announced at the time; numerous media outlets settled on the informal \"Screenies\".\nAt the 4th Canadian Screen Awards in 2016, host Norm Macdonald called in his opening monologue for the awards to be named the Candys; several presenters and winners followed his lead throughout the evening, referring to the award as \"The Candy\" in their presentation announcements or acceptance speeches, and John Candy's former SCTV colleagues Eugene Levy and Catherine O'Hara both endorsed Macdonald's proposal in the press room. Macdonald had not sought input from the Academy itself prior to his monologue, although he ran the idea past the ceremony's broadcast producer Barry Avrich. At the 5th Canadian Screen Awards in 2017, host Howie Mandel made a recurring joke of suggesting that they be nicknamed \"STDs\" (an abbreviation of \"screen, television, and digital\", but a double entendre of another use of the abbreviation). The show is currently commonly known as the CSAs.\nRules\nTo be eligible for nominations, a title must be either a Canadian production or co-production; international film or television projects shot in Canada without direct Canadian production involvement are not eligible. Until 2025, Canadians could not receive nominations for working on foreign productions that were not otherwise eligible for CSA consideration, but foreign nationals could be nominated for work on eligible Canadian films; in that year, the Academy introduced a new rule restricting the nominees to Canadian citizens and permanent residents, as well as introducing four new \"Spotlight\" categories to honour work by Canadian producers, directors, writers and actors on international television series made and broadcast in Canada.\nA feature film must have received at least one full week of commercial theatrical screenings in at least two of the Calgary, Edmonton, Halifax, Montreal, Ottawa, Quebec City, Saskatoon, St. John's, Toronto, Vancouver, Victoria and/or Winnipeg markets between 1 January of the qualifying year and the date of the awards ceremony in the presentation year. A film may be submitted and even nominated before it has fully met these criteria, so long as it can provide satisfactory proof that the criteria will be fulfilled by the date of the ceremony.\nFilm festival screenings are not directly relevant to the inclusion criteria for feature films; as long as it meets the commercial screening criteria, a film may in fact have had its initial film festival premiere up to 1.5 years earlier than 1 January of the qualifying year. Although due to the more periodic nature of Canadian film distribution it may be possible for a film to meet the qualifying criteria in more than one separate year, a film may not be resubmitted to the awards committee more than once. The eligibility criteria for feature films have sometimes faced criticism from some independent film producers, however, as they effectively excluded films which pursue distribution strategies more strongly based on streaming media platforms such as Netflix or Crave from consideration in film categories — unlike the Academy Awards, where the eligibility rules permit films from streaming services. Despite this conflict, films which premiered theatrically, but did not surpass the theatrical screening criteria and thus were never submitted in film categories before being released on a television or streaming platform, are eligible to receive nominations in the television categories; as well, the more flexible eligibility criteria noted below, which were introduced during the COVID-19 pandemic in light of the disruptions that it caused to film distribution, remain in place as of 2024 despite the reopening of movie theatres, and thus now permit some films distributed on streaming platforms to enter film categories.\nUnder certain circumstances, it may also be possible for a film to be nominated in both film and television categories. For example, the 2020 documentary film One of Ours was a nominee for Best Feature Length Documentary at the 10th Canadian Screen Awards in 2022 due to its theatrical run; however, as the Academy does not present awards for best direction or best writing in theatrical documentary films, but does present awards for best direction and writing in television documentaries, its television broadcast later in the year earned Yasmine Mathurin nominations in the television categories at the same ceremony. However, a film cannot be considered in both film and television categories that directly duplicate each other; for instance, a film cannot be considered for both Best Picture and Best TV Movie.\nDue to the impact of the COVID-19 pandemic on theatrical film distribution in 2020, special rules for the 9th Canadian Screen Awards permitted films that were commercially screened on an Academy-approved list of video on demand platforms after having been planned for conventional theatrical distribution, as well as films that were screened online as part of any Canadian film festival that proceeded virtually in 2020; as well, the number of commercial theatrical screenings required for eligibility was temporarily reduced to just four screenings in one of the regular markets. Other new changes at the 9th ceremony included the renaming of the Overall Sound category to Sound Mixing, and the introduction of a new category for Best Casting in films.\nFeature documentaries are eligible if they have received three commercial theatrical screenings anywhere in Canada within the same time period as narrative features, or if they have screened at two qualifying film festivals within the calendar year. Animated short films are eligible if they have received one commercial theatrical screening anywhere in Canada, or have been screened at two qualifying festivals, within the calendar year; live action short films are eligible if they have received one commercial theatrical screening anywhere in Canada, or have been screened at three qualifying festivals, within the calendar year. Documentary and short films are also automatically deemed eligible for nomination if they have won an award at an eligible Canadian or international film festival within the qualifying period, even if they have not fully met the Canadian screening criteria.\nFor television categories, the qualifying period corresponds more closely to the traditional television season than the calendar year, beginning 1 September of the second year before the ceremony and ending, depending on the category, either 31 August or 15 November of the year before the ceremony. An ongoing television series whose season straddles the cutoff date for its category is still eligible if it has aired at least one-third of its episodes within the eligibility period; if it does not meet that test, then it must wait until the following year.\nAwards ceremonies\n{| class=\"wikitable\" style=\"text-align: center; font-size:95%;\"\n|-\n! scope=\"col\" width=\"5%\"  | Ceremony\n! scope=\"col\" width=\"10%\" | Date\n! scope=\"col\" width=\"20%\" | Best Motion Picture\n! scope=\"col\" width=\"20%\" | Best Dramatic Series\n! scope=\"col\" width=\"20%\" | Best Comedy Series\n! scope=\"col\" width=\"10%\" | Host\n! scope=\"col\" width=\"10%\" | Location\n! scope=\"col\" width=\"5%\"  | Broadcaster\n|-\n|colspan=8 align=center| Prior to 2013, see Genie Awards for film and Gemini Awards for television.\n|-\n| 1st || 3 March 2013 || War Witch (Rebelle) || Flashpoint || Less Than Kind || rowspan=2 | Martin Short || rowspan=2| Sony Centre for the Performing Arts || rowspan=\"7\" | CBC\n|-\n| 2nd || 9 March 2014 || Gabrielle || rowspan=2| Orphan Black || rowspan=2| Call Me Fitz\n|-\n| 3rd || 1 March 2015 || Mommy || Andrea Martin || Four Seasons Centre for the Performing Arts\n|-\n| 4th || 13 March 2016 || Room || 19–2 || ''Schitt's Creek || Norm Macdonald || rowspan=4| Sony Centre for the Performing Arts\n|-\n| 5th || 12 March 2017 || It's Only the End of the World (Juste la fin du monde) || Orphan Black || Letterkenny || Howie Mandel\n|-\n| 6th || 11 March 2018 || Maudie || rowspan=2| Anne with an E || Kim's Convenience || Jonny Harris & Emma Hunter\n|-\n| 7th || 31 March 2019 || A Colony (Une colonie) || rowspan=3| Schitt's Creek || No host\n|-\n| 8th || 25–28 May 2020 || Antigone || Cardinal || various || rowspan=2 colspan=2| Ceremonies cancelled; awards presented via virtual event.\n|-\n| 9th || 17–20 May 2021 || Beans || rowspan=2|Transplant || various\n|-\n| 10th || 10 April 2022 || Scarborough || rowspan=2| Sort Of || TallBoyz || Ceremonies cancelled; awards presented via virtual event and television special. || rowspan=\"4\" | CBC\n|-\n| 11th || 16 April 2023 || Brother || The Porter || Samantha Bee\n|Meridian Hall\n|-\n| 12th || 31 May 2024 || Blackberry || Little Bird || Bria Mack Gets a Life|| Mae Martin || rowspan=2| Canadian Broadcasting Centre\n|-\n| 13th || 1 June 2025 || The Apprentice || Law & Order Toronto: Criminal Intent || Children Ruin Everything || Lisa Gilroy\n|}\nAwards categories\nThe Canadian Screen Awards has roughly 130 categories in total. There are 30 film categories, 100 television categories, and 10 digital media categories. As with the Genie Awards, all Canadian films, regardless of language, are eligible to receive awards in the film categories. However, as with the Gemini Awards, only English-language productions are eligible for television categories: the Academy continues to hold the Prix Gémeaux, a separate ceremony honouring French-language television productions.\nFilm\n* Best Motion Picture\n* Best Feature Length Documentary (Ted Rogers Award)\n* Best Short Documentary\n* Best Live Action Short Drama\n* Best Animated Short\n* Best Director\n* Best Original Screenplay\n* Best Adapted Screenplay\n* Best Lead Performance in a Comedy Film\n* Best Lead Performance in a Drama Film\n* Best Supporting Performance in a Comedy Film\n* Best Supporting Performance in a Drama Film\n* Best Performance in a Live Action Short Drama\n* Best Art Direction / Production Design\n* Best Casting (Film)\n* Best Cinematography\n* Best Cinematography in a Documentary\n* Best Editing\n* Best Editing in a Documentary\n* Best Costume Design\n* Best Makeup\n* Best Hair\n* Best Original Score\n* Best Original Song\n* Best Original Music in a Documentary\n* Best Visual Effects\n* Best Sound Editing\n* Best Sound Mixing\n* Best Sound Design in a Documentary\n* Best Stunt Coordination\nDefunct categories'':\n* Best Performance in a Leading Role in a Film (2022 only)\n** formerly Best Actor and Best Actress, 2012 to 2022\n* Best Performance in a Supporting Role in a Film (2022 only)\n** formerly Best Supporting Actor and Best Supporting Actress, 2012 to 2022\nTelevision\nDigital media\n*Best Cross-Platform Project – Children's and Youth\n*Best Cross-Platform Project – Fiction\n*Best Cross-Platform Project – Non-Fiction\n*Best Immersive Experience\n*Best Original Interactive Production Produced for Digital Media\n*Best Original Program or Series Produced for Digital Media – Fiction\n*Best Original Program or Series Produced for Digital Media – Non-Fiction\n*Best Direction in a Program or Series Produced for Digital Media\n*Best Actor in a Program or Series Produced for Digital Media\n*Best Actress in a Program or Series Produced for Digital Media\n*Social Innovator Award\nSpecial categories\n*Academy Achievement Award\n*Best First Feature\n*Board of Directors' Tribute\n*Digital Media Trailblazing Award\n*Diversity Award\n*Earle Grey Award\n*Fan Choice Award\n*Cogeco Fund Audience Choice Award\n*Golden Screen Award\n*Gordon Sinclair Award\n*Humanitarian Award\n*Icon Award\n*Legacy Award\n*Lifetime Achievement Award\n*Margaret Collier Award\n*Outstanding Technical Achievement Award\n*Radius Award\n*Shaw Rocket Fund Kids' Choice Award\nSee also\n*Canadian television awards\n*Prix Iris\nReferences\nExternal links\n*\n* [http://academy.ca/awards/forms/CSA_2013_Film_RRBooklet_ENG.pdf Canadian Screen Awards Rules & Regulations — Film]\n* [http://academy.ca/awards/forms/CSA_2013_TV_DM_RRBooklet_ENG.pdf Canadian Screen Awards Rules & Regulations — TV and digital media]"
    }
  ]
}