{
  "content": [
    {
      "type": "text",
      "text": "# Canadian Expeditionary Force\n\n*World War I\n**Western Front\n**North Russia Intervention\n**Siberian Intervention\n| notable_commanders            = Lieutenant General Edwin AldersonLieutenant General Julian ByngLieutenant General Arthur Currie\n| size                          = 619,646 men (total)\n| nickname                      = CEF\n}}\nThe Canadian Expeditionary Force (CEF; French: Corps expéditionnaire canadien) was the expeditionary field force of Canada during the First World War. It was formed on August 15, 1914, following Britain’s declaration of war on the German Empire, with an initial strength of one infantry division. The division subsequently fought at Ypres on the Western Front, with a newly raised second division reinforcing the committed units to form the Canadian Corps. The CEF and corps was eventually expanded to four infantry divisions, which were all committed to the fighting in France and Belgium along the Western Front. A fifth division was partially raised in 1917, but was broken up in 1918 and used as reinforcements following heavy casualties.\nPersonnel\nRecruitment\nThe CEF was mostly volunteers; a bill allowing conscription was passed in August 1917, but not enforced until call-ups began in January 1918 (see Conscription Crisis of 1917); only 24,132 conscripts ended up being sent to France to take part in the final Hundred Days campaign.\nAs a Dominion in the British Empire, Canada was automatically at war with Germany upon the British declaration. Popular support for the war was found mainly in English Canada, especially among those born in the United Kingdom who had recently emigrated. Of the first contingent trained at Valcartier in 1914, about two-thirds were men born in the United Kingdom. More Canadian-born recruits would join the ranks throughout the war, but at least half of CEF soldiers were still British-born at the war's end in 1918. Recruiting was difficult among the French-Canadian population, many of whom did not agree with Canada's participation in the war; one battalion, the 22nd, who came to be known as the 'Van Doos', was French-speaking (\"Van Doos\" is a caricatured Anglophone mispronunciation of the French for \"22nd\" - ).\n]]\nTo a lesser extent, several other cultural groups within the Dominion enlisted and made a significant contribution to the Force including Indigenous people of the First Nations, Black Canadians as well as Black Americans. Many British nationals from the United Kingdom or other territories who were resident in Canada and the United States also joined the CEF.\nSome units of the Permanent Active Militia were mobilized into the CEF, including the Royal Canadian Dragoons, Lord Strathcona's Horse and the Royal Canadian Regiment (RCR). But the bulk of the CEF's units were newly raised, including a privately raised and equipped battalion, Princess Patricia's Canadian Light Infantry (PPCLI). The CEF came to include 260 numbered infantry battalions, two named infantry battalions (RCR and PPCLI), 17 mounted regiments, 13 railway troop battalions, five pioneer battalions, four divisional supply trains, four divisional signals companies, a dozen engineering companies, over 80 field and heavy artillery batteries, fifteen field ambulance units, 23 general and stationary hospitals, and many other medical, dental, forestry, labour, tunnelling, cyclist, and service units. Two tank battalions were raised in 1918 but did not see service. Most of the infantry battalions were broken up and used as reinforcements, with a total of fifty being used in the field, including the mounted rifle units, which were re-organized as infantry. The artillery and engineering units underwent significant re-organization as the war progressed, in keeping with rapidly changing technological and tactical requirements.\nAnother entity within the CEF was the Canadian Machine Gun Corps.  It consisted of several motor machine gun battalions, the Eatons, Yukon, and Borden Motor Machine Gun Batteries, and nineteen machine gun companies.  During the summer of 1918, these units were consolidated into four machine gun battalions, one being attached to each of the four divisions in the Canadian Corps.\nin Vancouver, British Columbia, December 1915]]\nThe Canadian Corps with its four infantry divisions comprised the main fighting force of the CEF. The Canadian Cavalry Brigade also served in France. Support units of the CEF included the Canadian Railway Troops, which served on the Western Front and provided a bridging unit for the Middle East; the Canadian Forestry Corps, which felled timber in Britain and France, and special units which operated around the Caspian Sea, in northern Russia and eastern Siberia.\nEstablishment of corps\nWhen it was deployed in 1914, the Canadian Expeditionary Force included only infantry battalions, but it became clear by 1915 that support and administrative units needed to be included on the Western Front. After September 1915 it expanded to include supporting combat corps and what were considered administrative corps:\n* Canadian Cavalry Brigade\n* Canadian Forestry Corps\n* Canadian Machine Gun Corps\n* Corps of Guides (Canada)\n* HQ Corps of Military Staff Clerks\n* Royal Canadian Army Medical Corps\n* Royal Canadian Army Pay Corps\n* Royal Canadian Army Service Corps\n* Royal Canadian Army Veterinary Corps\n* Royal Canadian Corps of Signals\n* Canadian Military Engineers\n* Canadian Postal Corps\n* Royal Regiment of Canadian Artillery\nReserves and training\nThe Canadian Expeditionary Force also had a large reserve and training organization in England, and a recruiting organization in Canada.\nEnlistment of foreign nationals\nAmerican Legion\nA large number of United States citizens enlisted in the Canadian armed forces while the United States was still neutral. In November 1915, an all-American battalion of the CEF was formed and given the title 97th Battalion (American Legion). The unit embarked for Europe in May 1916 at Toronto, but were held at Aldershot, Nova Scotia, due to objections by the US government, causing a number of desertions and resignations. The battalion finally arrived in England in September, having officially dropped the \"American Legion\" title, although the term continued to be used informally throughout the war. Further American battalions followed, but were either used as drafts for other CEF units or had been merged with the 97th Battalion by the end of the war. Approximately 2,700 US citizens are interred in Commonwealth War Graves or named in its memorials.\nOn returning to New York after the war, 2,754 US citizens who had fought with British Empire forces, including 300 African Americans, were detained on Long Island and New Jersey because they lacked the correct documentation. Some of the men reportedly sent a telegram to King George V, complaining of their \"rotten reception.\" The plight of these men was covered extensively in local and national media, and following several days of negotiations and bureaucratic wrangling, those who had returned legally were allowed to enter the country. Their ticket home was paid by the UK government, in addition to 28 days pay. A United States Department of War report in early 1918 estimated that 25,000 to 30,000 Americans were serving in the Canadian Expeditionary Force.\nBermudians\nmarching in the streets of Hamilton, Bermuda, in 1915.]]\nA sizeable percentage of Bermuda's volunteers who served in the war joined the CEF, either because they were resident in Canada already, or because Canada (its next nearest neighbour after the United States) was the easiest other part of the British Empire and Commonwealth to reach from Bermuda. Bermuda had been part of British North America (a collection of colonies administered collectively as a region by the Colonial Office), with its garrison forming part of that of Nova Scotia (the second nearest landfall from Bermuda after the United States) under the Commander-in-Chief, Maritime provinces, but as an Imperial fortress it had remained under administration of the British Government after being left out of the 1867 Confederation of Canada (along with the Colony of Newfoundland). As the Royal Canadian Regiment, 38th Battalion (Ottawa), CEF, 77th Battalion, CEF, and 163rd Battalion (French-Canadian), CEF were posted successively to the Bermuda Garrison before proceeding to France, islanders were also able to enlist there. Bermudians in the Canadian Expeditionary Force enlisted under the same terms as Canadians, and all male British Nationals resident in Canada became liable for conscription under the Military Service Act, 1917.\nChinese Labour Corps\nChinese labourers were also brought over to Europe, especially the Canadian Railway Troops. From 1917 to 1918 84,000 Chinese labourers were recruited for the Chinese Labour Corps from China (via Shandong Province) that were shipped to Canada and then some to the Western Front. Many of these labourers died in Belgium and France.\nOperations\nBattle of Ypres\n, an engagement during the Second Battle of Ypres]]\nThe Second Battle of Ypres in 1915, the first engagement of Canadian forces in the Great War, exposed Canadian soldiers and their commanders to modern war. They had previously experienced the effects of shellfire and participated in aggressive trench raiding despite a lack of formal training and generally inferior equipment. They were equipped with the frequently malfunctioning Ross rifle, the older, lighter and less reliable Colt machine gun and an inferior Canadian copy of British webbing equipment that rotted quickly and fell apart in the wet of the trenches.\nIn April 1915, they were introduced to yet another facet of modern war, gas. The Germans employed chlorine gas to create a hole in the French lines adjacent to the Canadian force and poured troops into the gap. The Canadians, operating for the most part in small groups and under local commanders, fired into the flanks of the German advance, forcing it to turn its attention onto the Canadian sector. For three days, Canadian and reinforcing British units fought to contain the penetration with a series of counter-attacks while using handkerchiefs soaked in urine to neutralize effects of the gas.  One in every three of the inexperienced but determined Canadians became a casualty. The senior Canadian officers were also inexperienced at first and lacked communications with most of their troops. Notable among these was Arthur Currie, a brigade commander later became the commander of the Canadian Corps and who appointed as his divisional commanders only those who had fought well in this engagement. The battle cost the British Expeditionary Force – BEF (of which the Canadian Corps was a part) 59,275 men and the Canadian Expeditionary Force over 6000.\nBattle of the Somme\n]]\nAccording to historian G. W. L. Nicholson, \"The Somme offensive had no great geographical objectives. Its purpose was threefold – to relieve pressure on the French armies at Verdun, to inflict as heavy losses as possible on the German armies, and to aid allies on other fronts by preventing any further transfer of German troops from the west.\" The Canadian Corps was formed after receiving the 2nd and 3rd and later, 4th divisions. Its first commander was Lieutenant-General Edwin Alderson, who was soon replaced by Lieutenant-General Julian Byng, in time to repulse a German attack at Mont Sorrel in the Ypres sector in June 1916. while much of the BEF was moving toward the Somme. In this engagement, Major-General Malcolm Mercer, commander of the newly formed 3rd Division was killed; he was the most senior Canadian to be killed in the war.\nThe corps did not participate in the battles of the Somme until September, but these began on 1 July after a seven-day bombardment. British losses on the first day amounted to 57,470, which included the casualties of the Newfoundland Regiment serving in the British 29th Division. The regiment was annihilated when it attacked at Beaumont Hamel.  By the time the four Canadian divisions of the corps participated in September, the Mark I Tank first appeared in battle. Only a few were available because the production time was long for the unfamiliar and unproven technology; those delivered were committed in order to aid the expected breakthrough. The psychological impact of them was considerable, with some claiming that they made many German soldiers surrender immediately, although the four months of sustained combat, high casualties among the defending Germans and the appearance of the fresh Canadian Corps were more likely factors in the increasing surrenders. The toll of the five-month campaign cannot be statistically verified by a single reliable source, however historians have estimated German losses at roughly 670,000 and an Allied total of 623,907. The Canadian Corps suffered almost 25,000 casualties in this the final phase of the operation, but like the remainder of the BEF, it had developed significant experience in the use of infantry and artillery and in tactical doctrine, preparation and leadership under fire.\nBattle of Vimy Ridge\nThe Battle of Vimy Ridge had significance for Canada as a young nation. For the first time the Canadian Corps, with all four of its divisions attacked as one. This Canadian offensive amounted to the capture of more land, prisoners and armaments than any previous offensive. The main offensive tactic was the creeping barrage, an artillery strike combined with constant infantry progression through the battlefield.\nPasschendaele\nIn August 1917, the Canadian Corps attacked Lens as a distraction to allow two armies of the BEF to begin the Third Battle of Ypres, the attack on Passchendaele Ridge. The Corps, led by Lieutenant General Arthur Currie, captured Hill 70 overlooking Lens and forced the Germans to launch more than twenty counter-attacks in attempting to remove the threat to its flank. The Ypres offensive began with the swift capture of the Messines Ridge, but weather, concrete defences and the lack of any other concurrent Allied effort meant that the BEF fought a muddy, bloody campaign against the main German force for two months. The BEF, including the ANZACs, pushed to within two kilometres of the objective with very high casualties and in ever-deepening mud.\n.]]\nBy September, it became clear that a fresh force would need to be brought in for the final push. With the situation in Italy and with the French army deteriorating, it was decided to continue the push and Currie was ordered to bring in the Canadian Corps.  He insisted on time to prepare, on reorganizing the now-worn down artillery assets and on being placed under command of General Plumer, a commander he trusted. The first assault began on October 26, 1917. It was designed to achieve about 500 meters in what had become known as \"bite and hold\" tactics but at great cost (2,481 casualties) and made little progress. The second assault on October 30 cost another 1,321 soldiers and achieved another 500 metres but reached the high ground at Crest Farm. On November 6, after another round of preparations, a third attack won the town of Passchendaele, for another 2,238 killed or wounded. The final assault  to capture the remainder of Passchendaele Ridge began on November 10 and was completed the same day. Nine Canadians earned the Victoria Cross in an area not much bigger than four football fields and the Canadian Corps completed the operation after it had taken the BEF three months to advance the eight kilometres onto the ridge. The Canadian Corps suffered 15,654 battle casualties in the muddiest, best-known  battle of the Great War.\nHundred Days Offensive\nadvance near Inchy during the Battle of the Canal du Nord.]]\nSince they were mostly unmolested by the German Army's offensive manoeuvres in the spring of 1918, the Canadians were ordered to spearhead the last campaigns of the War from the Battle of Amiens on August 8, 1918 to the winning of a tacit victory for the Allies, when the armistice came into effect on November 11, 1918.\nDeployments to Russia\nIn August 1918, the Canadian Expeditionary Force's Canadian Siberian Expeditionary Force travelled to revolution-torn Russia. It reinforced a garrison resisting Lenin's Bolshevik forces in Vladivostok during the winter of 1918–19. At this time, another force of Canadian soldiers were placed in Archangel, where they fought against Bolsheviks.\nCasualties\nDuring 1914 to 1919, half of the nation's medical resources were devoted to the war effort in the Canadian Army Medical Corps (CAMC). The pre-war army medical corps, founded in 1904,  had only 23 officers. It expanded to include 1,525 medical officers, 1,901 nursing sisters, and 15,624 other ranks. CAMC managed 36,000\nhospital beds overseas and 12,000 at home.  It included nearly half of all active physicians and a majority of leaders of the professions. They were all needed.  Of the front-line soldiers over one-third --154,000--were wounded and survived, and four out of five survivors returned to duty. However, another 12,000 died of wounds.  In all another 39,000 soldiers were killed outright. Venereal disease became a significant issue, with 29% of all Canadian troops infected by 1915.\nDisbandment\ns used by the Royal 22nd Regiment. The colours include battle honours of CEF units whose lineage is perpetuated by the regiment.]]\nThe Canadian Expeditionary Force was a special force, distinct from the Canadian Militia which mobilized in 1914 on a limited basis for home defence and to assist with the recruitment and training of the Canadian Expeditionary Force. In 1918 the militia personnel active in Canada were granted Canadian Expeditionary Force status, to simplify administration in the wake of conscription coming into force.  Beginning in 1918, in anticipation of the disbandment of the Canadian Expeditionary Force, plans for the re-organization of the militia were initiated, guided largely by the deliberations of the Otter Commission, convened for this purpose. Among the commission's recommendations was a plan by which individual units of the Canadian Militia, notably infantry and cavalry regiments, would be permitted to perpetuate the battle honours and histories of the Canadian Expeditionary Force units that had fought during the war.\nDuring the latter part of the war, the Canadian Military Hospitals Commission reported on provision of employment for members of the Canadian Expeditionary Force on their return to Canada, and the re-education of those who were unable to follow their previous occupations because of disability.\nLegacy\nAfter extensive experience and success in battle from the Second Battle of Ypres, through the Somme and particularly in the Battle of Arras at Vimy Ridge in April 1917, and Passchendaele the Canadian Corps came to be regarded as an exceptional force by both Allied and German military commanders. In the later stages of the European war, particularly after their success at Vimy Ridge and Passchendaele, the Canadian Corps was regarded by friend and foe alike as one of the most effective Allied military formations on the Western Front.\nThe Canadian Expeditionary Force lost 60,661 men killed or died during the war, representing 9.28 per cent of the 619,636 who enlisted.\nThere were occasions when Canadian soldiers acted up. Soldiers of the 218th Battalion rioted in Feb 1917. About 150 soldiers of an un-named battalion attacked the police station at Prince Albert in 1917, in protest of the imposition of strict liquor laws.\nA.A. Milne's well-known character \"Winnie-the-pooh\" is derived from a black bear taken to Europe as the mascot of a western Canadian army unit during the war.[http://www.cbc.ca/kidscbc2/the-feed/the-real-life-canadian-story-of-winnie-the-pooh]\nEquipment\nDuring the war the equipment used changed as tactics evolved. The standard issued rifle was, at the beginning of the war, the Ross Rifle, which was later replaced by the Short Magazine Lee-Enfield Mark III (SMLE). This was due to problems of the Ross Rifle in comparison to the reliability of the SMLE, with unofficial replacement already occurring until the switchover in 1916. The service pistols issued were the Colt New Service, M1911 pistol, and the Smith & Wesson Triple Lock. Approved private purchase and secondary side-arms were the Webley Mark VI, and the Enfield revolver. Infantrymen were issued with the Ross bayonet, and later the Pattern 1907 bayonet. Machine-guns initially included the Colt and Vickers machine-guns, with the Vickers line continually expanded during the war, and which were complemented by the Lewis machine gun.\nOfficially an infantry division would be classified at full animal strength at 5,241 horses and mules; 60.7 percent or 3,182 of these animals were part of the infantry division's artillery branch. Besides mounted and cavalry units, the Canadian Expeditionary Force used horses, mules, donkeys and cattle to transport gun pieces on the battle front, as motorized vehicles could not handle rough terrain. At the start of the war over 7,000 horses were brought over to England and Europe from Canada and by the end of the war over 8 million horses had been lost in the course of fighting in Europe. Dogs and carrier pigeons were employed as messengers in the front. With horses, wagons were also used to transport equipment as well.\nUniforms and combat dress\n{| class=\"wikitable\"\n|+Uniform\n|-\n!Model/type!!Period or years in use!!Manufacturer/origins\n|-\n|Service dress 1903–1939 || ||\n|-\n|Canadian pattern and British pattern || ||\n|}\nLoad-bearing equipment\n{| class=\"wikitable\"\n|-\n!Model/type!!Period or years in use!!Manufacturer/origins\n|-\n| Oliver Pattern Equipment 1898–19?? || ||\n|-\n| 1908 pattern web equipment (British and Canadian variants) || ||Canadian variant had ammunition pouches to hold ammo packets for use with Mk. II Ross Rifles as they were not charger loading\n|-\n|Canadian Pattern 1913 Equipment\n|\n|Canadian trials with modernizing the P08 web gear. the PPCLI went overseas equipped with P13 gear. Many aspects would be utilized in later sets of gear\n|-\n|British Pattern 1914 Equipment\n|\n|Wartime economy equipment\n|-\n|Canadian Pattern 1915 Equipment\n|\n|Modification of 1899 Oliver Pattern gear\n|-\n|Canadian Pattern 1916 Dismounted Equipment\n|\n|Upgrade of Pattern 1915 equipment\n|}\nHead dress\n{| class=\"wikitable\"\n|-\n!Model/type!!Period or years in use!!Manufacturer/origins\n|-\n|Glengarry || ||\n|-\n|Tam o' shanter || ||\n|-\n|Field service cap || ||\n|-\n|Brodie helmet || after 1915 ||\n|}\nMilitary equipment\nThe CEF used a mix of service revolver or pistols, bolt-action rifles, machine guns (from light, medium and heavy) and armoured fighting vehicles (armoured cars, tanks and motorcycles). Horses and mules were used by the cavalry, as well as for transport of personnel and equipment to the front.\nSee also\n* British Army\n* Canada during World War I\n* Canadian official war artists\n* List of infantry battalions in the Canadian Expeditionary Force\n* List of mounted regiments in the Canadian Expeditionary Force\nReferences\nCitations\nNotes\nFurther reading\n* Baldwin, Harold (1918) [https://www.gutenberg.org/ebooks/73624 \"Holding the line\"], Chicago: A. C. McClurg & Co.\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n* Canada Military Hospitals Commission The Provision of Employment for Members of the Canadian Expeditionary Force on Their Return to Canada, and the Re-Education of Those Who Are Unable to follow their previous occupations because of disability. Canada Military Hospitals Commission Nabu Press August 2010. This is a reproduction of a book published before 1923.\nExternal links\nGovernment links\n* [http://www.bac-lac.gc.ca/eng/discover/military-heritage/first-world-war/Pages/introduction.aspx The First World War] from Library Archives Canada\n* [http://www.veterans.gc.ca/eng/remembrance/history/first-world-war Remembrance: The First World War] from Veterans Affairs Canada\n* [http://www.collectionscanada.ca/first-world-war/interviews/025015-1700-e.html Oral Histories of the First World War: Veterans 1914–1918] from Library Archives Canada\n* [http://www.cmp-cpm.forces.gc.ca/dhh-dhp/his/oh-ho/index-eng.asp Official Histories – Free online PDF books on the C.E.F.]  from The Department of National Defense\nMuseums and media links\n* [http://www.warmuseum.ca/firstworldwar/ Canada and the First World War] from the Canadian War Museum\n* [http://www.cbc.ca/archives/categories/war-conflict/first-world-war/the-first-world-war-canada-remembers/topic---the-first-world-war-canada-remembers.html The First World War: Canada Remembers from CBC archives]\n* [https://web.archive.org/web/20120409144213/http://www3.nfb.ca/ww1/wartime.php National Film Board – Images of a Forgotten War]\nOther links\n* [http://www.canadiangreatwarproject.com/ Canadian Great War Project]\n* [http://freepages.genealogy.rootsweb.com/~brett/cef/cefpapertrail.html The C.E.F. Paper Trail]\n* [http://www.cefresearch.ca/ The C.E.F. Study Group]\n* [http://cobwfa.ca/ Central Ontario Branch Western Front Association]\n* [http://regimentalrogue.com Regimentalrogue website] has a variety of information on researching soldiers of the Canadian Expeditionary Force and the conditions of the war\n* [http://www.canadiansoldiers.com/ canadiansoldiers.com]\n* [https://utppublishing.com/doi/pdf/10.3138/CHR-061-03-03] Demobilization Riots in the\nCanadian Expeditionary Force 1918-1919"
    }
  ]
}