{
  "content": [
    {
      "type": "text",
      "text": "# Candlewick (ward)\n\n| os_grid_reference        = TQ317812\n| post_town                = LONDON\n| postcode_area            = EC\n| postcode_district        = EC4\n| dial_code                = 020\n| constituency_westminster = Cities of London and Westminster\n}}\nCandlewick is a small ward, one of the 25 ancient wards in the City of London, England.\nIt was named after Cannon Street, which historically was called Candlewright (or Candlewick) Street, and a small part of Cannon Street continues to be within the ward's boundaries.\nIts northern boundary runs along Lombard Street – to the north is the ward of Langbourn. Gracechurch Street forms Candlewick's eastern boundary with Bridge ward, down to the Monument to the Great Fire of London, erected to commemorate the place where the Great Fire started 2 September 1666. Its southern boundary curves along Arthur Street, incorporating traffic from London Bridge to its western edge along Laurence Pountney Lane, Sherbourne Lane and Abchurch Lane in Walbrook ward.\nThere are two churches within Candlewick, St. Mary Abchurch on Abchurch Lane and St. Clement Eastcheap on Clement's Lane, while a third, St. Michael, Crooked Lane, was demolished in 1831 to make way for the new London Bridge. There are several large stores and pubs and a hotel located in the ward. As with many City wards it has its own social club and newsletter.\nMonument tube station is located in the south-eastern corner of the ward.\nPolitics\nCandlewick is one of 25 wards in the City of London, each electing an alderman to the Court of Aldermen and commoners (the City equivalent of a councillor) to the Court of Common Council of the City of London Corporation. Only electors who are Freemen of the City are eligible to stand.\nThe Ward is represented on the Court of Alderman by Alderman Professor Emma Edhem, and on the Court of Common Council by Christopher Paul Boden and James St John Davis.\nReferences\nExternal links\n* [https://www.candlewickward.org/ Ward of Candlewick Website]- Website for news and updates on the Ward of Candlewick\n* [http://mapoflondon.uvic.ca/CAND2.htm Map of Early Modern London:  Candlewick Street Ward] – Historical Map and Encyclopedia of Shakespeare's London (Scholarly)\n* [https://web.archive.org/web/20110704191051/http://217.154.230.195/NR/rdonlyres/2FA5D3AA-9C8A-4B1D-99B3-91025630592C/0/candlewick.jpg Corporation of London] Present Day Candlewick Ward Boundaries\n* [https://www.candlewickwardclub.co.uk/the-ward-of-candlewick Candlewick Ward Club]"
    }
  ]
}