{
  "content": [
    {
      "type": "text",
      "text": "# Cannonvale, Queensland\n\n| pop                 = 6596\n| pop_year            =\n| pop_footnotes       =\n| established         =\n| postcode            = 4802\n| area                = 8.3\n| timezone            = AEST\n| utc                 = +10:00\n| dist1               = 22.2\n| dir1                = NE\n| location1           = Proserpine\n| dist2               = 147\n| dir2                = NNW\n| location2           = Mackay\n| dist3               = 270\n| dir3                = SE\n| location3           = Townsville\n| dist4               = 1097\n| dir4                = NNW\n| location4           = Brisbane\n| lga                 = Whitsunday Region\n| stategov            = Whitsunday\n| fedgov              = Dawson\n| near-n              = Coral Sea\n| near-ne             = Airlie Beach\n| near-e              = Cape Conway\n| near-se             = Cape Conway\n| near-s              = Cannon Valley\n| near-sw             = Cannon Valley\n| near-w              = Woodwark\n| near-nw             = Coral Sea\n}}\nCannonvale is a coastal locality in the Whitsunday Region, Queensland, Australia. In the , Cannonvale had a population of 6,596 people.\nGeography\nPioneer Bay (part of the Coral Sea, ) forms the northern boundary of the locality. Pigeon Island is a  marine island () within Pioneer Bay. It is a roosting area for the Nutmeg pigeon which migrate south to the Whitsundays in large numbers in the summer months each year.\nShingley Beach () is a sandy strip on the far north-eastern coast of the locality extending into neighbouring locality of Airlie Beach.\nScrubby Hill () is  high and on the northern coast of the locality.\nThe Proserpine-Shute Harbour Road (State Route 59) runs through from south-west to north-east.\nHistory\nThe locality was originally named Cannon Valley in 1866 by George Strong Nares, commander of HMS Salamander, after Richard Cannon, the Assistant Surgeon on the ship. Town allotments near the beach on Pioneer Bay were sold by public auction in 1904 under the name Cannonvale. However, the local people preferred to call it Cannon Valley Beach. In 1930, the post office name was changed to Deauville but in 1947 was renamed Cannonvale Beach. It is now simply Cannonvale, while the name Cannon Valley is retained by the inland area.\nCannon Vale Provisional School opened on 8 February 1892. It closed in 1908, but then reopened on a new site on the north-eastern corner of Shute Harbour Road and Abell Road () as Cannon Valley State School on 23 April 1910 to service the local farming community. In 1968, it was decided to relocate the school back into Cannonvale as the majority of the students were coming from Cannonvale. The new school buildings in Cannonvale opened in July 1969 with 84 students and the school was then renamed Cannonvale State School. Due to suburban growth in Cannonvale, the 1910 site is now within the boundaries of Cannonvale rather than Cannon Valley.\nSponsored by the Whitsunday Baptist Church, Whitsunday Christian College opened in January 1997 with approximately 30 students. It operated from a number of sites before establishing its current Paluma Drive campus which officially opened on 29 November 2002.\nOn 31 January 1987, the town of Cannonvale was discontinued as the locality was amalgamated into the new larger town of Whitsunday.\nThe Cannonvale public library opened in 2006.\nIn January-February 2010, storm surges caused by Cyclone Anthony battered the coastline.\nDemographics\nIn the  Cannonvale had a population of 5,716 people.\nIn the , Cannonvale had a population of 6,596 people.\nEducation\nCannonvale State School is a government primary (Prep-6) school for boys and girls at 56 Coral Esplanade (). In 2018, the school had an enrolment of 765 students with 55 teachers (53 full-time equivalent) and 28 non-teaching staff (22 full-time equivalent). It includes a special education program.\nWhitsunday Christian College is a private primary and secondary (Prep-12) school for boys and girls at 26 Paluma Road (). In 2018, the school had an enrolment of 282 students with 22 teachers (20 full-time equivalent) and 15 non-teaching staff (13 full-time equivalent).\nThere is no government secondary school in Cannonvale. The nearest government secondary school is Proserpine State High School in Proserpine to the south-west.\nTAFE Queensland has its Whitsunday campus at 190 Shute Harbour Road (). It provides technical and vocational education in the areas of hospitality, cookery, early childhood education, and child care.\nFacilities\nWhitsunday Police Station is at 8 Altmann Avenue ().\nCannonvale SES Facility is at 22 Schnapper Street ().\nWhitsunday Community Health is at 12 Altmann Street ().\nWhitsunday Ambulance Station is at 7 Schnapper Street ().\nThe Volunteer Marine Rescue Whitsunday (VMR 442) are based at 7 Altmann Avenue (). They protect the area from Gloucester Island to the north to Cape Conway and Shaw Island to the south. They use the adjacent Whisper Bay boat ramp.\nAmenities\nThe Whitsunday Regional Council operates a public library in the Whitsunday Plaza Shopping Centre, 8 Galbraith Park Drive ().\nSt Martin's Church is at 4 St Martins Road (). It is jointly owned by the Catholic and Lutheran churches, but is also used for Baptist, Anglican and Uniting Church services.\nAbell Point Marina is a boat ramp at off Shingley Drive at Shingley Beach (); it is managed by the Whitsunday Regional Council.\nWhisper Bay boat ramp and floating walkway is at Altmann Avenue (); it is managed by the Whitsunday Regional Council.\nReferences\nExternal links\n*"
    }
  ]
}