{
  "content": [
    {
      "type": "text",
      "text": "# Cantidiano Valqueiro Barros Private Natural Heritage Reserve\n\n| area =\n| designation = Private natural heritage reserve\n| created = 3 January 2003\n| administrator = (Private) Chico Mendes Institute for Biodiversity Conservation\n| world_heritage_site =\n}}\nThe Cantidiano Valqueiro Barros Private Natural Heritage Reserve () is a private natural heritage reserve in the state of Pernambuco, Brazil. It protects an area of dry caatinga vegetation.\nLocation\nThe Cantidiano Valqueiro Barros Private Natural Heritage Reserve is in the municipality of Floresta, Pernambuco.\nIt has an area of , part of the  Fazenda Taboleiro Comprido.\nHistory\nThe owner of the Tabuleiro Comprido farm, Natanael Valgueiro Barros, was opposed to hunting and deforestation.\nHe raised cattle, sheep and goats on the land, which also supports a flock of emus, now much reduced in size by hunters.\nThe National Institute for Colonization and Agrarian Reform (INCRA) declared that the farm was unproductive, and threatened to expropriate and develop it.\nThe environmental group SOS Caatinga and others helped with a campaign against INCRA's proposal, calling it an environmental disaster to clear the well-preserved caatinga.\nThey gained the support of the federal representative of the RPPN program in Pernambuco.\nThe Cantidiano Valqueiro Barros Private Natural Heritage Reserve was recognized by Romulus Melo, president of the Brazilian Institute of Environment and Renewable Natural Resources (IBAMA), by ordnance 177 on 31 December 2002.\nThe ordnance was published on 3 January 2003.\nThe RPPN is the second in the Pernambuco caatinga, the first being the Maurício Dantas RPPN.\nIt became part of the Caatinga Ecological Corridor, created in 2006.\nEnvironment\nThe Köppen climate classification is Bs s'h', with a long dry season from April to October and a short rainy season from November to March.\nAverage daily temperature is .\nAverage annual rainfall is .\nThe reserve protects an area of caatinga vegetation, most of it found in depressions between the plateau areas.\nPlants species include Amburana cearensis, Anadenanthera colubrina, Aspidosperma pyrifoliam, Cnidoscolus quercifolius and various species of Croton, Mimosa and Cactus.\nHarris's hawk (Parabuteo unicinctus) and white-cheeked pintail (Anas bahamensis) were reported in the reserve in 2005.\nNotes\nSources\n*\n*\n*\n|title=Ibama reconhece mais duas reservas particulares do patrimônio natural|work=Agência Brasil|date=4 January 2003\n|url=http://memoria.ebc.com.br/agenciabrasil/noticia/2003-01-04/ibama-reconhece-mais-duas-reservas-particulares-do-patrimonio-natural|accessdate=2016-11-03}}\n*\n*\n*|language=pt\n|title=RPPN Cantidiano Valgueiro de Carvalho Barros|publisher=ICMBio: Chico Mendes Institute for Biodiversity Conservation\n|url=http://sistemas.icmbio.gov.br/simrppn/publico/detalhe/278/|accessdate=2016-11-03}}"
    }
  ]
}