{
  "content": [
    {
      "type": "text",
      "text": "# Cantata for the 20th Anniversary of the October Revolution\n\n| scoring           =\n}}The Cantata for the 20th Anniversary of the October Revolution, Op. 74, is a dramatic cantata by Sergei Prokofiev.\nIntroduction\nIn ten contrasting movements, the cantata relates the story of the Bolshevik Revolution and the birth of the Soviet Union, from the battle for the Winter Palace in 1917, through the suffering of 1918 and Lenin's funeral in 1924, to the building of factories and collective farms in the early thirties, and the final consolidation of Stalin's control over the country with his new constitution of 1936.\nBegun by Prokofiev in 1936 on a generous commission from the All-Union Radio Committee and Prokofiev's friend Boris Gusman, it was finished the following summer. Prokofiev expected it to be part of the celebration of the 20th anniversary of the October Revolution of 1917. Prokofiev is said to have performed the entire piece himself when auditioning the piece for the celebration, both singing the choral parts and playing the piano.\nEven though he utilized texts for the piece published by Marx, Lenin and Stalin, Prokofiev was not able to win political approval of his gigantic cantata. In fact, Platon Kerzhentsev ripped into Prokofiev, accusing him of \"...taking texts that belong to the people and setting them to ... incomprehensible music\". Nevertheless, Prokofiev fought to have his cantata performed, writing numerous letters and attempting to hold rehearsals. Unfortunately, these attempts were in vain. Because it did not receive official approval, Prokofiev was only paid 25% of the commission promised.\nUpon the première of \"Songs of Our Days\" in 1938, Prokofiev hoped that the success of the piece would \"soften hard hearts\". However, the cantata never received official approval during Prokofiev's lifetime. The cantata was forgotten until 1966, when it finally premiered, being conducted by Kirill Kondrashin. However, the piece suffered from censorship. Stalin had died in 1953, and had been publicly denounced. Through the de-stalinization of the piece, the two movements \"The Pledge\" and \"Constitution\" were completely removed. Still a third movement, the 9th, \"Symphony\", was heavily modified. Having removed the finale of the piece, Kondrashin finished the piece by reprising the second movement, \"The Philosophers\".\nProkofiev would never get to hear his piece. He died 13 years before the first performance.\nPrevious examples of this type of Communist cantata include Shock Brigade of the World Proletariat (1931–32) by Alexander Krein and To the Proletariat and Agricultural Symphony (1923) by Alexander Kastalsky.\nMovements\n# Introduction: \"A spectre is haunting Europe, the spectre of Communism\"\n# Philosophers\n# Interlude\n# Marching in Close Ranks\n# Interlude\n# Revolution\n# Victory\n# The Pledge\n# Symphony\n# The Constitution\nThe music's extravagant sound palette combines a full orchestra with typically Russian choral writing, folk instruments and the sounds of marching, gunfire and sirens.\nInstrumentation\n4 flutes, 4 oboes, 4 clarinets, 4 bassoons, 8 horns, 4 trumpets, 4 trombones, 2 tubas, Timpani, percussion, accordions, military band (saxhorns, extra trumpets, horns, tenor horns, euphonium, tubas and snare drum), alarm bells, cannon shot, sirens, eight-part chorus, speaker on megaphone (as the voice of Lenin), Maxim gun, harps, keyboards, strings.\nPopular culture\nThe Cantata for the 20th Anniversary of the October Revolution movement \"The philosophers\" was used in the opening and closing titles of the film Red Heat. Also, the leitmotif of the seventh movement (Victory) was widely used by James Horner in his soundtrack of the film The Land Before Time.\nReferences\nExternal links\n*\n* [https://www.youtube.com/watch?v=7xMD8Epbhpk YouTube recording of the Revolution movement featuring machine guns and air raid sirens]"
    }
  ]
}