{
  "content": [
    {
      "type": "text",
      "text": "# Capital punishment in Delaware\n\nCapital punishment in Delaware was formally abolished in 2024. However, it had not been enforced after Delaware’s capital punishment statues were declared unconstitutional by the Delaware Supreme Court on August&nbsp;2, 2016. The ruling  retroactively applies to earlier death sentences, and remaining Delaware death row inmates had their sentences commuted to life imprisonment. The capital statute for first-degree murder under Title 11, Chapter 42, Section 09, of the Delaware Code was fully repealed on September 26, 2024.\nDelaware has the fourth highest number of executions per capita between 1976 and 2023, behind Oklahoma, Texas and Missouri Sixteen people were executed in the state after the Gregg v. Georgia decision of 1976. The last person executed in the state was 28-year-old Shannon Johnson, who was executed on April 20, 2012.\nAs of 2015, 64 percent of Delawareans oppose capital punishment, compared to 30 percent who support it.\nIn June 2024, the Delaware House of Representatives and Senate passed a bill to abolish the death penalty in statute, which would make the Delaware Supreme Court's ruling legally irrelevant. In September 2024, Governor John Carney signed the bill, fully repealing the death penalty in Delaware.\nFormer status\nLegal process\nDelaware was one of the four states, along with Alabama, Florida, and Indiana, where the judge may override a jury decision. The statute was struck down in 2016 because the judge decided not only the sentence itself, but also some factual findings necessary to make the defendant eligible for capital punishment.\nThe Governor was allowed to grant a commutation of the death sentence, but only after receiving a recommendation of clemency from a board or advisory Group. The only post-Furman pardon was granted by Gov. Jack Markell on January 17, 2012. It was the first time the board had recommended a death sentence be commuted since the re-instatement of capital punishment in 1974.\nCapital crimes\nMurder was punishable by death when it involved at least one of the following aggravating factors:\n# The murder was committed by a person in, or who has escaped from, the custody of a law enforcement officer or place of confinement.\n# The murder was committed for the purpose of avoiding or preventing an arrest, or for the purpose of effecting an escape from custody.\n# The murder was committed against any law enforcement officer, corrections employee, firefighter, paramedic, emergency medical technician, fire marshal, or fire police officer, while such victim was engaged in the performance of official duties.\n# The murder was committed against a judicial officer, a former judicial officer, Attorney General, former Attorney General, Assistant or Deputy Attorney General, or former Assistant or Deputy Attorney General, State Detective or former State Detective, Special Investigator or former Special Investigator, during, or because of, the exercise of an official duty.\n# The murder was committed against a person who was held or otherwise detained as a shield or hostage.\n# The murder was committed against a person who was held or detained by the defendant for ransom or reward.\n# The murder was committed against a person who was a witness to a crime, and who was killed for the purpose of preventing the witness's appearance or testimony in any grand jury, criminal, or civil proceeding involving such crime, or in retaliation for the witness's appearance or testimony in any grand jury, criminal, or civil proceeding involving such crime.\n# The defendant paid or was paid by another person, or had agreed to pay or be paid by another person, or had conspired to pay or be paid by another person for the killing of the victim.\n# The defendant was previously convicted of another murder or manslaughter or of a felony involving the use of, or threat of, force or violence upon another person.\n# The murder was committed while the defendant was engaged in the commission of, or attempt to commit, or flight after committing or attempting to commit any degree of rape, unlawful sexual intercourse, arson, kidnapping, robbery, sodomy, burglary, or home invasion.\n# The defendant's course of conduct resulted in the deaths of 2 or more persons where the deaths are a probable consequence of the defendant's conduct.\n# The murder was outrageously or wantonly vile, horrible, or inhuman in that it involved torture, depravity of mind, use of an explosive device or poison, or the defendant used such means on the victim prior to murdering the victim.\n# The defendant caused or directed another to commit murder or committed murder as an agent or employee of another person.\n# The defendant was under a sentence of life imprisonment, whether for natural life or otherwise, at the time of the commission of the murder.\n# The murder was committed for pecuniary gain.\n# The victim was pregnant.\n# The victim was particularly vulnerable due to a severe intellectual, mental, or physical disability.\n# The victim was 62 years of age, or older.\n# The victim was a child 14 years of age, or younger, and the murder was committed by an individual who is at least 4 years older than the victim.\n# At the time of the killing, the victim was, or had been, a non-governmental informant, or had otherwise provided any investigative, law enforcement, or police agency with information concerning criminal activity, and the killing was in retaliation for the victim's activities as a non-governmental informant or in providing information concerning criminal activity to an investigative, law enforcement, or police agency.\n# The murder was premeditated and the result of substantial planning. Such planning must be as to the commission of the murder itself, and not simply as to the commission or attempted commission of any underlying felony.\n# The murder was committed for the purpose of interfering with the victim's free exercise or enjoyment of any right, privilege, or immunity protected by the First Amendment to the United States Constitution, or because the victim has exercised or enjoyed said rights, or because of the victim's race, religion, color, disability, national origin, or ancestry.\nMethod\nOn June 13, 1986, the state adopted lethal injection as the default method of execution in Delaware. Hanging was an alternative for those whose offense occurred prior to that date, but in July 2003, no remaining death row inmates were eligible to choose this alternative, and Delaware dismantled its gallows.\nThe last judicial execution by hanging in the United States was carried out in Delaware, on January 25, 1996, against convicted murderer Billy Bailey.\nDeath row\nDelaware's death row for males was located at the James T. Vaughn Correctional Center near Smyrna. Female death row prisoners were housed at the Delores J. Baylor Women's Correctional Institution near New Castle.\nThere were 13 inmates on death row when the state Supreme Court invalidated the capital scheme in 2016. All of their sentences were modified, and the last two inmates were re-sentenced to life in prison in March 2018.\nPublic opinion\nAs of 2015, 64 percent of Delawareans oppose the death penalty with an alternative of life in prison, compared with 30 percent who support.\nWith regards to demographics, opposition stands at 69 percent with women, 57 percent with men, 72 percent with Democrats, 58 percent with independents, and 70 percent with African Americans.\nLegislation after Supreme Court ruling\nIn 2017, a bill was proposed by Rep. Steve Smyk to reinstate the state death penalty by limiting the number of aggravating factors warranting the death penalty, and limiting a judge's authority on the decision. The proposal gained some support after the murders of police officer Stephen Ballard and of corrections officer Steven Floyd Sr., in a February 2017 riot at the James T. Vaughn Correctional Center in Smyrna, Delaware, though the man who killed Ballard was later killed by law enforcement in a shootout. However, the bill failed to get a committee hearing in the Senate. In May 2019, Smyk introduced a similar bill.\nFull repeal\nIn June 2024, the Delaware House of Representatives passed a bill to abolish the death penalty in Delaware's statute by a vote of 33 to 8, which would effectively make the Supreme Court's ruling irrelevant. Later in the month, the Delaware Senate also passed the bill by a vote of 14 to 7. On September 26, 2024, Governor John Carney signed the bill, fully repealing the death penalty in Delaware.\nSee also\n* List of people executed in Delaware\n* Crime in Delaware\nReferences"
    }
  ]
}