{
  "content": [
    {
      "type": "text",
      "text": "# Captains Mountain, Queensland\n\n| pop                 = 74\n| pop_year            =\n| pop_footnotes       =\n| established         =\n| postcode            = 4357\n| area                = 173.4\n| timezone            = AEST\n| utc                 = +10:00\n| dist1               = 13.1\n| dir1                = SW\n| location1           = Millmerran\n| dist2               = 56.6\n| dir2                = SW\n| location2           = Pittsworth\n| dist3               = 95.1\n| dir3                = SW\n| location3           = Toowoomba\n| dist4               = 227\n| dir4                = SSW\n| location4           = Brisbane\n| lga                 = Toowoomba Region\n| stategov            = Southern Downs\n| fedgov              = Maranoa\n| near-n              = Western Creek\n| near-ne             = TurallinMillmerran\n| near-e              = Clontarf\n| near-se             = Millwood\n| near-s              = Millmerran WoodsBringalily\n| near-sw             = Cypress GardensMillmerran Downs\n| near-w              = Condamine FarmsForest Ridge\n| near-nw             = Western Creek\n}}\nCaptains Mountain is a locality in the Toowoomba Region, Queensland, Australia. In the , Captains Mountain had a population of 74 people.\nGeography\nThe mountain Captains Mountain is in the north-east of the locality () rising to\nThe south-west of the locality is Western Creek State Forest. The remainder of the locality is used for farming, mostly grazing but with some cropping.\nThe Gore Highway passes through the locality from the north-east (Millmerran) and then exits to the south-west forming part of the south-western boundary (adjacent to Cypress Gardens and Millmerran Downs).\nHistory\nThe locality is presumably named after the mountain Captains Mountain.\nIn 1914, the Captain's Mountain Co-operative Dairy Company was formed with 275 shares at a cost of  each. The company built a cheese factory. In March 1916, the factory processed  to produce  of cheese. The factory was still operating in 1931, but was contemplating closure in 1934, and had closed by 1939.\nCaptain's Mountain Provisional School opened on 30 January 1922, becoming Captain's Mountain State School in 1957. It closed in 1962.\nDemographics\nIn the , Captains Mountain had a population of 77 people.\nIn the , Captains Mountain had a population of 74 people.\nEducation\nThere are no schools in Captains Mountain. The nearest government primary and secondary school to Year 10 is Millmerran State School in neighbouring Millmerran to the north-east and the nearest government secondary school to Year 12 in Pittsworth State High School in Pittsworth to the north-east.\nReferences"
    }
  ]
}