{
  "content": [
    {
      "type": "text",
      "text": "# Captain Robert Dexter Conrad Award\n\nThe Captain Robert Dexter Conrad Award is an award presented annually to the individual making an outstanding contribution in naval research and development.\nBackground\nThe award is named in honor of Captain Robert Dexter Conrad, who was the primary architect of the Navy's basic research program, and the head of the Planning Division of the Office of Naval Research at the time of its establishment. It is designed to recognize and to reward outstanding technical and scientific achievement in research and development for the Department of the Navy (DON).\nDescription\nThe Captain Robert Dexter Conrad award consists of a gold medal and a citation signed by the Secretary of the Navy.\nCriteria\nThe Captain Robert Dexter Conrad award will be granted, on an annual basis, to an individual who has made an outstanding contribution in the field of research and development for the DON. Such contribution shall be so outstanding as to be widely recognized, not only by the cognizant personnel within the DON, but also by the civilian scientific and engineering community of the Nation. While no time limitation is intended to be imposed in selecting a candidate for the award, it is recommended that only accomplishments of recent years be considered. Award considerations will be given to achievements in any of the following:\n* Planning and administration of scientific research and development.\n* Individual achievement or series of achievements which contribute to the progress of science or technology in fields of significance to the Department of the Navy.\nEligibility\nAt the time of the achievement or contribution cited as a basis for the award, nominees must have been in one of the following categories:\n* a civilian employee in an active employment status in the Department of Navy\n* an employee of a Department of Navy contractor\n* a member of the military service on active duty.\nNominating responsibilities\nThe Chief of Naval Research (CNR) is responsible for obtaining and forwarding, with comments, a nomination to the Secretary of the Navy via the Assistant Secretary of the Navy (Research, Engineering and System) annually.\nIf none of the nominees submitted in a given year meet the established standards, the CNR will recommend to the Secretary that no award be granted for that year. To avoid possible embarrassment, nominations should be designated “FOR OFFICIAL USE ONLY” and safeguarded until final action has been taken.\nNomination procedure\nThe Chief of Naval Research will establish a Nomination Review Committee. The committee will consist of nine representatives from Navy activities, which have significant research and development programs. The committee will be responsible for ensuring that the widest possible consideration of potential nominees and for making an appropriate recommendation to the CNR.\nAward nominations should be in the correct format and be favorably endorsed by the headquarters command. The CNR will issue a notice concerning the nomination due date and general information on the Committee meeting. Prior to this meeting, Committee members will receive a copy of each nomination to be considered.\nWhen the Committee meets, each representative should be prepared to provide supporting information on the potential candidate(s) submitted by his or her organization. After each nomination has been discussed, ballots will be completed and a recommendation will be formulated and forwarded to the CNR.\nAward presentation\nAwards approved by the Secretary of the Navy will be presented by the CNR or the CNR's designated representative at a special ceremony which is mutually convenient to the recipient, his or her employing organization, and the CNR.\nRecipients\nList of recipients and year supplied by the Office of Naval Research; affiliation gleaned from a web search.\n# 1957 Dr. Alan T. Waterman, Office of Naval Research\n# 1958 Dr. Charles Christian Lauritsen, California Institute of Technology\n# 1959 Dr. Robert M. Page, Naval Research Laboratory\n# 1960 Dr. Ralph E. Gibson, Johns Hopkins University Applied Physics Laboratory\n# 1961 Dr. Howard T. Karsner,\tBureau of Medicine and Surgery\n# 1962 VADM John T. Hayward, United States Navy\n# 1963 Dr. Gerald M. Clemence, Naval Observatory\n# 1964 Dr. Herbert Friedman, Naval Research Laboratory\n# 1965 CAPT Ashton Graybiel, Navy School of Aviation Medicine Pensacola\n# 1966 VADM Levering Smith, United States Navy\n# 1967 Professor William Markowitz, Marquette University\n# 1968 Dr. William A. Zisman, Naval Research Laboratory\n# 1969 Dr. George R. Irwin, Naval Research Laboratory\n# 1970 Mr. Haskell G. Wilson, Naval Weapons Center China Lake\n# 1971 Dr. Harry Hoogstraal, Naval Medical Research Unit No 3 Cairo Egypt\n# 1972 Mr. Howard O. Lorenzen, Naval Research Laboratory\n# 1973 Mr. William S. Pellini, Naval Research Laboratory\n# 1974 Dr. Fred N. Spiess, Scripps Institution of Oceanography\n# 1975 Mr. John A. Pierce, Harvard University\n# 1976 Dr. Jerome Karle, Naval Research Laboratory\n# 1977 CAPT Charles E. Brodine, Navy Medical Research and Development Command\n# 1978 Dr. Walter H. Munk, Scripps Institution of Oceanography\n# 1979 Dr. Harold E. Bennett, Naval Weapons Center China Lake\n# 1980 Dr. Isabella L. Karle, Naval Research Laboratory\n# 1981 Dr. Victor L. Granatstein, Naval Research Laboratory\n# 1982 Dr. Alan Berman, Naval Research Laboratory\n# 1983 Dr. Alan Powell, Naval Surface Warfare Center Carderock\n# 1984 Dr. Thomas G. Giallorenzi, Naval Research Laboratory\n# 1985 Mr. Larry J. Argiro, Naval Surface Warfare Center Annapolis\n# 1986 Mr. Peter G. Wilhelm, Naval Research Laboratory\n# 1987 Dr. C. Robert Valeri, Navy Blood Research Laboratory Plymouth\n# 1988 Dr. Fred E. Saalfeld, Naval Research Laboratory and Office of Naval Research\n# 1989 Dr. Jay Paul Boris, Naval Research Laboratory\n# 1990 Dr. Homer W. Carhart, Naval Research Laboratory\n# 1991 Dr. Robert D. Ballard, Woods Hole Oceanographic Institute\n# 1992 Dr. William B. Morgan, Naval Surface Warfare Center Carderock\n# 1993 Dr. Carver A. Mead, California Institute of Technology\n# 1994 Dr. Carl O. Bostrom, Johns Hopkins University Applied Physics Laboratory\n# 1995 Dr. Maurice M. Sevik, Naval Surface Warfare Center Carderock\n# 1996 Dr. Carl H. June, Uniformed Services University of Health Sciences Bethesda\n# 1997 Dr. Norman L. Owsley, Naval Undersea Warfare Center Newport\n# 1998 CAPT Stephen L. Hoffman, Navy Medical Research Center Forest Glen\n# 1998 Dr. Ming Chiang Lin, Naval Research Laboratory\n# 1999 Dr. Timothy P. Coffey, Naval Research Laboratory\n# 2005 Dr. Rolf G. Kasper, Naval Undersea Warfare Center Newport\n# 2007 Dr. Baruch Levush, Naval Research Laboratory\n# 2008 Dr. Josko Catipovic, Naval Undersea Warfare Center Newport\n# 2009 Dr. Robert M. Koch, Naval Undersea Warfare Center Newport\n# 2010 Dr. Ted R. Clem, Naval Surface Warfare Center Panama City\n# 2011 Mr. Keith Lucas, Naval Research Laboratory\n# 2012 Dr. Kazhikathra Kailasanath, Naval Research Laboratory\n# 2014 Dr. Wallace Arden Smith, Office of Naval Research\n# 2015 Dr. Jerry Meyer, Naval Research Laboratory\n# 2016 Dr. Thomas L. Reinecke, Naval Research Laboratory\nReferences\n* [https://web.archive.org/web/20131002232604/http://doni.daps.dla.mil/Directives/05000%20General%20Management%20Security%20and%20Safety%20Services/05-00%20General%20Admin%20and%20Management%20Support/5061.9G.pdf SECNAVINST 5061.9G]"
    }
  ]
}