{
  "content": [
    {
      "type": "text",
      "text": "# Car Wars__disambig_1\n\nCar Wars is a vehicle combat simulation game developed by Steve Jackson Games, first published in 1980. Players control armed vehicles in a post-apocalyptic future.\nGame play\nIn Car Wars, players assume control of one or more cars or other powered vehicles, from motorcycles to semi trucks. Optional rules include piloting helicopters, ultralights, balloons, boats, submarines, and tanks. The vehicles are typically outfitted with weapons (such as missiles and machine guns), souped-up components (like heavy-duty fire-proof wheels, and nitro injectors), and defensive elements (armor plating and radar tracking systems). Within any number of settings, the players then direct their vehicles in combat.\nThe published games use cardstock counters to represent vehicles in a simulated battle upon printed battlemaps. While the game rules allow for any scale, most editions of the game were published to use a 1-inch = 15-feet scale (1:180 scale), although the Fifth Edition switched to 1-inch = 5-feet (1:60 scale). At this larger scale, players can use miniature toy vehicles such as Hot Wheels or Matchbox cars, S gauge model railroading scenery, or 28mm-30mm scale wargaming miniatures.\nCar Wars had many scenarios available and the system allowed players to make their own. Common scenarios include a harrowing gauntlet and competition in an arena to win a virtual cash prize with which to upgrade their cars. Many game sessions consist of players taking their cars through many successive arena-style scenarios, upgrading their cars between each round. At the height of the game's popularity, many gaming conventions and gaming clubs sponsored Car Wars tournaments where finalist players could win real world prizes.\nCar Wars uses standard dice to determine the outcomes of weapon fire, damage and vehicle control during the game. It is played in turns, each turn representing one second of real time. Each turn was initially divided into ten phases (first edition) then five (revised edition) and in the last edition three. All action in Car Wars is simultaneous. Players do not roll for initiative as is common in other combat games, instead each phase a vehicle moves a distance determined by the vehicle's speed. Players may fire weapons on any phase as long as they have line-of-sight with a target of their choosing. As part of movement players may attempt turns and other maneuvers of increasing difficulty. The more maneuvers one attempts in a turn and the more difficult they are, the more likely it is that a player's car will skid or crash. After all phases of movement and combat are resolved, a new turn begins. Typically, a game is over after a few turns, which represents a combat of a few seconds, but because every action in the game must be resolved a typical game takes a few hours to play.\nWhile the core of the original Car Wars was a boardgame, the supplements allowed it to be extended into a larger game with light role-playing elements. Other expansions such as rule-additions, mini-scenarios and dual-statted products like Autoduel Champions (for use with Car Wars or Champions) published in game magazines expanded the game even further.\nPublication history\nCar Wars was first published in a small ziplock-bag format in 1980, and cited Alan Dean Foster's short story, \"Why Johnny Can't Speed\", as a primary inspiration. (Later editions also cited Harlan Ellison's short story \"Along the Scenic Route\" and the film Death Race 2000.) The game won the Charles S. Roberts Award (Origins Award) for Best Science Fiction Boardgame of 1981 and was named to the Games magazine Games 100 list in 1985.\nAs the game became more popular, there were a series of increasingly more expensive and elaborate editions.  Car Wars also served as the inspiration for the 1985 video game Autoduel, published by Origin Systems.\nSteve Jackson continues to express an interest in developing video games based on the Car Wars concept.\nThe game's popularity waned during the 1990s, and in response to slipping sales, Steve Jackson Games ceased support for Car Wars. The last official Cars Wars material for the original game appeared in Pyramid magazine (an article introducing High Torque Motors, by Robert Deis).\nAutoduel America, the setting for Car Wars, was developed for role-playing games (RPGs) using Steve Jackson Games' GURPS system (called GURPS Autoduel). That GURPS worldbook has seen two editions. A series of expansions for both the GURPS version and boardgame, The AADA Road Atlas and Survival Guide, were published in the late 1980s and early 1990s.\nIn 2002, Steve Jackson Games released an entirely new version of Car Wars. Redesigned for a new audience, it was called version 5.0. The new game's unusual marketing, scattering the game across several redundant products, met with mixed responses and the game's popularity has continued to wane. The 2002 products are still in print.\nIn October 2009, Steve Jackson Games made the Car Wars Compendium: Second Edition (Fifth Printing) available as a PDF from the e23 online store.\nCar Wars (both boardgame and RPG version) was translated into French by Croc.\nCar Wars: The Card Game was released in 1991 (with a second edition in 2001), designed by Creede and Sharleen Lambard, and published by Steve Jackson Games.\nMain editions\nThe first four editions use a ground scale of 1-inch = 15-feet. Aeroduel introduced an air-to-air scale of ¼-inch = 15-feet. The Fifth Edition uses a revised scale of 3-inches = 15-feet.\n;First edition\n* Car Wars 1981–1984 (4\" × 7\" ziplock-bag or Pocket Box)\n** Cars, pickups, vans, and motorcycles. Turns have ten phases.\n* Sunday Drivers/Crash City 1982 (Pocket Box)\n** Added pedestrians, a small bus, and rules for buildings\n* Truck Stop 1983 (Pocket Box)\n** Added full-size buses and semi-trailer trucks\n* Autoduel Champions 1983 (8½\" × 11\" book)\n** Added helicopters, grasshoppers (flying cars), and superheroes (the last not canon for Car Wars)\n** Introduced an alternative hex-based movement system–using 3-inch cars and 1-inch hexes–intended for use with role-playing games. This system was not used again in Car Wars, although the scale is the same as Car Wars: Fifth Edition.\n* Car Wars Reference Screen 1983 (3-panel 8½\" × 11\")\n** Added \"Advanced Collision System\"\n*Car Wars Expansion Set #1 (1983)\n*Car Wars Expansion Set #2 (1983)\n*Car Wars Expansion Set #3, East Midville (1983)\n*Car Wars Expansion Set #4, Armadillo Autoduel Arena (1983)\n* The AADA Vehicle Guide 1983 (5½\" × 8½\" book)\n** Added trikes (three-wheeled motorcycles) and off-road rules\n*Car Wars Expansion Set #5, Double Arena (1984)\n*Car Wars Expansion Set #6, The AADA Vehicle Guide Counters (1984)\n;Second edition\n* Car Wars Deluxe Edition 1985 (9\" × 12\" box)\n** Combined and refined the various first edition rules, adding 10-wheeler trucks\n** Note: Starting in 1990 the Deluxe Edition boxes contained the Car Wars Compendium: Second Edition rulebook rather than the original Deluxe Edition rulebook.\n*Car Wars Expansion Set #7, Off-Road Duelling (1985)\n*Car Wars Expansion Set #8, Chopper Challenge (1985)\n* Dueltrack 1986 (9\" × 12\" box)\n** Added gasoline engines, metal armor, race-cars, and Chassis & Crossbow (rules for the primitive early history of Car Wars)\n*Car Wars Expansion Set 9, Muskogee Fairground & Family Emporium (1986)\n*Car Wars Expansion Set #10 (1986)\n* The AADA Vehicle Guide: Volume 2 1987 (5½\" × 8½\" book)\n** Added sedans, and campers (SUVs)\n* Combat Showcase (1987)\n* Boat Wars 1988 (Pocket Box), 1990 (9\" × 12\" box)\n** Added boats, amphibious cars, and hovercraft\n;Third Edition\n* The Car Wars Compendium 1989 (8½\" × 11\" book)\n** Turns reduced to five phases.  Control Table revised.\n** Compiled all the second edition rules (except race-cars) in one place\n** Refined car movement, based more on the Turning Key than on a map grid\n;Fourth Edition\n* Car Wars Compendium: Second Edition 1990, 1996 (8½\" × 11\" book)\n** Control Table revised again.\n** Revised rules — including race-cars — with many updates and refinements.\n* Car Wars Tanks 1990 (9\" × 12\" box)\n** Added wheeled military vehicles, tanks, and really big guns\n* Aeroduel 1990 (9\" × 12\" box)\n** Added fixed-wing planes and airships with both civilian and military grade weapons\n* ''Uncle Albert's Catalog From Hell 1992 (8½\" × 11\" book)\n** Includes all previously published construction rules, weapons, and equipment, but the only play rules are minor updates to the CWC2E rules.\n;Fifth Edition\n* Car Wars 5.0 2002 (9 comic book sized pamphlets, containing the same rules with different car designs, any one of which is all that is required to play).\n** Back to just cars (pre-designed), with simplified play rules. Turns reduced to three phases.\n** Scale change, with 1-inch = 5-feet instead of 15-feet\n** No official construction rules published , although a reverse-engineered unofficial version exists\nThe fourth edition has been re-released, and includes the auto creation rules and simplified rules for Role Playing.\n;Sixth Edition\nOn November 29, 2019, a Kickstarter was started to create a sixth edition, similar to the popular OGRE kickstarter. It was funded as of January 6, 2020, with 3,936 backers pledging $652,995.\nBackground story\nCar Wars is set 50 years after the publication dates of the various books. In this alternative future, natural resources are severely depleted and the United States government nationalized oil production.  This eventually led to a second American civil war, ending with the secession of the \"Free Oil States\", Texas, Oklahoma, and Louisiana.  Following famine in various parts of the world, there are limited nuclear exchanges between the USSR and the US, but anti-missile systems limit the resulting damage.  After these wars, there are years of worldwide economic crisis, and related global unrest, during which \"death sports\" become a popular form of entertainment.  This post-apocalyptic setting has drawn comparisons between Car Wars and the Mad Max movies.\nAs things began to recover, the organized sport of \"autodueling\" was born as a form of armed demolition derbies.  The American Autoduel Association (AADA) was formed, to sponsor sporting events and up-and-coming autoduelists.  In this future, technology has allowed for new vehicle designs, miniaturized weapon systems, and replacements for internal combustion engines.  Furthermore, human cloning (together with techniques for storing memories), has made death only a minor setback for autoduelists who can afford the procedure. Car Wars is a game designed for simulating these autoduels between competing players.\nClubs and organizations\nThe American Autoduel Association (AADA) was a worldwide group of players. It was started by Steve Jackson Games who supported the club with a quarterly magazine called Autoduel Quarterly''. This contained campaign ideas, vehicles, \"mock\" advertisements, and new weapons and accessories, as well as questions and answers. Subscribers would receive a bonus in the form of an extra cutout or cartoon on the protective mailing cover. Local clubs could also pay a yearly membership fee to be considered \"official.\"\nThe AADA served as a structured clearinghouse for common rules and guidelines to be followed during 'official' events. World Championships were held each year at the Origins Game Fair.\nThe AADA is no longer an official club as recognized by Steve Jackson Games. There are still several local clubs that claim to be AADA affiliated, and there are even web sites where interested parties can enjoy PBEM games. One site has a Car Wars podcast.\nThe official Car Wars site notes plans to relaunch the AADA and start a new periodical called Autoduel Times. No date is given for this project.\nSupplements\n[https://boardgamegeek.com/wiki/page/Car_Wars_Series A full list of supplements is available on the Board Game Geek wiki]\n* Hell on Wheels\nUncle Albert's Auto Stop & Gunnery Shop 2035 Catalog\nUncle Albert's Auto Stop & Gunnery Shop 2035 Catalog is a supplement published by Steve Jackson Games in 1985 for the vehicle combat simulation game Car Wars.\n''Uncle Albert's Auto Stop & Gunnery Shop 2035 Catalog was the first of six Car Wars expansions published by Steve Jackson Games between 1985 and 1992. Each supplement featured new cars and armament compiled from past issues of Autoduel Quarterly. This book is written in the style of a catalog that includes over 120 items, complete with prices, sizes, descriptions, and everything else needed to use these items during a game of Car Wars.\nCraig Sheeley reviewed Uncle Albert's Auto Stop & Gunnery Shop 2035 Catalog in The Space Gamer No. 76. Sheeley commented that \"Some of us like complexity. Some of us like to build our own vehicles, and outfit them with dozens of options. Some of us like the monster that Car Wars has become [...] If you are one of these Car Wars players, this supplement will prove to be invaluable, as it is an almost complete listing of the options in Car Wars.\"\nMike Eckenfels recalled this supplement with fondness, saying, \"If the ‘basic’ Car Wars rules just didn’t have enough creative ways to destroy, maim, and otherwise disassemble, the Uncle Albert catalogs certainly helped pad those needs, and then some [...] There’s a lot of Car Wars goodness in the pages of this one catalog, alone, to really get you going.\" Eckenfels noted that \"Some accessories actually have in-game use while others have more of an RPG element to it (or are just nice to have to brag about around the table, because apparently wasting pretend money in a fictional game on things that don’t actually have a practical use in-game are... bragable, I guess).\" He concluded, \"this was a nice little addition to the Car Wars universe back in the day.\"\nOther products\nIn addition to the spin-off video game, Autoduel, Marvel Comics published Car Warriors, a 1991 four-issue comic book miniseries set in the Car Wars world.\nThere were also a series of six gamebooks based in the Car Wars universe, where a player could make choices for the protagonist to affect the outcome of the story.  The Car Wars Adventure Gamebooks were titled: Battle Road, Fuel's Gold, Dueltrack, Badlands Run, Green Circle Blues, and Mean Streets.\nA trilogy of novels was published by Tor Books: The Square Deal by David Drake in 1992, Double Jeopardy: Car Warriors 2 by Aaron Alston in 1994, and Back from Hell by Mick Farren in 1999.\nIn 1995 VictorMaxx technologies announced plans for a series of gaming centers based on Car Wars, with a prototype site to debut in Chicago in 1996.\nReception\nIn Issue 36 of Phoenix (March–April 1982), John Lambshead reviewed the first edition of Car Wars and thought it was \"quite decently presented.\" However, Lambshead found the simultaneous move system \"excruciatingly tedious\", and the combat system complex. He wondered who the audience for this game was, since it was too complex to be a \"fun\" game, but \"On the other hand, who wants to expend so much effort simply to drive an armoured beach buggy around.\" He concluded that \"a combination of intelligence and immaturity is required for a full appreciation of Car Wars.\"\nThe Chicago Tribune described the game as \"vicious combat takes place on the highways and waters of a future that is not a kinder, gentler America\".\nIn a retrospective review of Car Wars in Black Gate, Ty Johnston said \"If you ever wanted to take part in the fast-driving, hard-hitting action of the Mad Max universe where guns and cars ruled the roads, and the plains and the deserts and the ... etc., then you would do well to buckle in and pick up one of the versions of Car Wars which has been made available over the years.\"\nOther reviews\n* Casus Belli #18 (Dec 1983)\n*Asimov's Science Fiction v10 n1 (1986 01)\n*1983 Games 100\n* #39\n*Analog Science Fiction and Fact''\nSee also\n* Alan Dean Foster, the author of \"Why Johnny Can't Speed\", originally published in Galaxy Science Fiction in 1971.  The short story is the primary inspiration for Car Wars.\n* Autoduel (1985) - A video game inspired by Car Wars\n* Battlecars (1983) – A Games Workshop, Mad Max–inspired road combat game using 1:60 scale miniature cars\n** Dark Future (1988) – A revised and expanded version of Battlecars, also by Games Workshop\n* Harlan Ellison, the author of \"Along the Scenic Route\", AKA \"Dogfight on 101\", another short story about car dueling\n* Freeway Fighter (1985) - A Fighting Fantasy game book set in a Car Wars-style dystopia\n* Gaslands (2017) - Tabletop game by Osprey publishing\n* ''Interstate '76 (1997) - A later video game inspired by Car Wars\n* Mad Max (1979) and The Road Warrior (1981) – Although commonly assumed to be an inspiration for Car Wars, its American release postdates the release of the game. Both draw from similar inspirations, and many Car Wars supplements would have been written by authors familiar with Mad Max.\n* Streets of SimCity\nReferences\nExternal links\n*[http://www.sjgames.com/carwars/ The official Car Wars site]\n*[http://forums.sjgames.com/forumdisplay.php?f=23 Steve Jackson Games Car Wars Forum]\n*\n*[http://boardgamegeek.com/wiki/page/Car_Wars_Series Listing of all Car Wars'' products]\n*"
    }
  ]
}