{
  "content": [
    {
      "type": "text",
      "text": "# Cardstone, Queensland\n\n| pop                 = 0\n| pop_year            =\n| pop_footnotes       =\n| established         =\n| postcode            = 4854\n| area                = 82.5\n| timezone            = AEST\n| utc                 = +10:00\n| dist1               = 31.4\n| dir1                = NW\n| location1           = Tully\n| dist2               = 84.8\n| dir2                = SW\n| location2           = Innisfail\n| dist3               = 172\n| dir3                = S\n| location3           = Cairns\n| dist4               = 237\n| dir4                = NNW\n| location4           = Townsville\n| dist5               = 1586\n| dir5                = NNW\n| location5           = Brisbane\n| lga                 = Cassowary Coast Region\n| stategov            = Hinchinbrook\n| fedgov              = Kennedy\n| near-n              = Koombooloomba\n| near-ne             = Walter Hill\n| near-e              = Walter Hill\n| near-se             = Dingo Pocket\n| near-s              = Munro Plains\n| near-sw             = Kooroomool\n| near-w              = Kooroomool\n| near-nw             = Koombooloomba\n}}\nCardstone is a rural locality in the Cassowary Coast Region, Queensland, Australia. In the , Cardstone had \"no people or a very low population\".\nGeography\nCardstone is a long thin locality following the valley of the Tully River. Cardstone village was built near the Tully River to accommodate workers and families of the Kareeya Hydro Power Station (). The village was less than  in area. Cardstone is mostly surrounded by the rainforest of the Tully Gorge National Park which forms part of the World Heritage-listed Wet Tropics of Queensland.\nKareeya is a neighbourhood in the north of the locality near the hydro power station ().\nWeary Pocket is another neighbourhood within the south of the locality ().\nThe land in the most northern part of the locality is mostly bushland, while the southern part of the locality is used for grazing on native vegetation and growing crops, including bananas.\nHistory\nConstruction of the Kareeya Hydro Power Station on the Tully River commenced in 1952 and the power station commenced operation in 1957. The staff and families were provided accommodation in a small village called Cardstone located about  downstream from the plant (approx ). The power station was instigated jointly by the Cardwell Shire Council and the Johnstone Shire Council and the name Cardstone is an amalgamation of those two names.\nAlthough it was desired to have a post office in Cardstone in 1954, no local person could be found to carry out the duties. Cardstone Post Office did not open until 11 January 1955. It closed in 1990 when the village closed.\nCardstone State School opened in the village on 18 February 1957. From 1959 to 1967, it was downgraded to a Provisional School and was closed on 14 December 1990 when the village closed.\nDuring Cyclone Winifred in late January 1986, rainfall of  was measured at Cardstone along the Tully River\nIn 1988, the Queensland Government approved plans to automate the power station. The benefits were the reduced need for on-site staff, which in turn minimised the problems with staff accessing the power station during the wet season when roads became impassable.\nIn about 1990, the power station became fully automated and could be operated from Townsville, making many of the Cardstone operating staff redundant. As only a small number of maintenance workers would be required to visit the station, it was decided to close down the village and relocate the maintenance workers to Tully. As the area was in the Wet Tropics of Queensland World Heritage Site, the village's buildings, then comprising 29 homes, a single men's barracks, a school and a post office, were sold for relocation. All evidence of the village was bulldozed and the  site was replanted with local native species so that it would revert to its natural state. Mature coconut palms and pine trees grown at the village were chopped down during the environmental rehabilitation as they were not local species. There had been a proposal that the village be retained and used as tourist accommodation, but the Cardwell Shire Council opposed the idea believing it would not be cost-effective.\nDemographics\nIn the , Cardstone had a population of 17 people.\nIn the , Cardstone had \"no people or a very low population\".\nEducation\nThere are no schools in Cardstone. The nearest government primary schools are Tully State School in Tully to the south-east and Murray River Upper State School in Murray Upper to the south. The nearest government secondary school is Tully State High School, also in Tully. There is also a Catholic primary school in Tully.\nReferences"
    }
  ]
}