{
  "content": [
    {
      "type": "text",
      "text": "# CARIFORUM–United Kingdom Economic Partnership Agreement\n\n| type                    = Free Trade Agreement and Economic Integration Agreement\n| context                 = Trade continuity agreement between the United Kingdom and CARIFORUM states\n| date_drafted            =\n| date_signed             =\n| location_signed         =Castries, Saint Lucia\n| date_sealed             =\n| date_effective          =\n| condition_effective     =\n| amendment               =\n| date_expiration         =\n| date_expiry             =\n| provisional_application =\n| mediators               =\n| negotiators             =\n*  Alexis Downes-Amsterdam\n*  Paul Whittingham\n| original_signatories    =\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n| signatories             =\n| parties                 =\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n| ratifiers               =\n| depositor               = Foreign, Commonwealth and Development Office\n| depositories            =\n| citations               =\n| languages               =\n| wikisource              =\n| wikisource1             =\n| wikisource2             =\n| wikisource3             =\n| wikisource4             =\n| wikisource5             =\n| footnotes               =\n}}\nThe CARIFORUM–United Kingdom Economic Partnership Agreement is a plurilateral free trade agreement between the United Kingdom and Antigua and Barbuda, Bahamas, Barbados, Belize, Dominica, Dominican Republic, Grenada, Guyana, Jamaica, Saint Kitts and Nevis, Saint Lucia, Saint Vincent and the Grenadines, Suriname, Trinidad and Tobago, designed to promote trade, investment, and sustainable development. It largely replicates the existing European Union–CARIFORUM States Economic Partnership Agreement framework, maintaining preferential trade access, with the CARIFORUM. The agreement is part of the UK's strategy to maintain and enhance trade relationships with developing countries following its departure from the European Union.\nBackgrounds\nFrom 29 December 2008 until 30 December 2020, trade between the CARIFORUM states and the UK was governed by the CARIFORUM–European Union Economic Partnership Agreement, while the United Kingdom was a member of the European Union.\nFollowing Brexit, the UK sought to replicate and adapt existing EU trade agreements with third countries to ensure continuity in trade. The UK and the CARIFORUM states signed the CARIFORUM–United Kingdom Economic Partnership Agreement on 22 March 2019. The signing ceremony for the CARIFORUM-UK Economic Partnership Agreement took place on 22 March 2019, in Castries, Saint Lucia. At this event, the United Kingdom and nine CARIFORUM countries formally signed the agreement. The ceremony marked a significant step in ensuring continuity of trade relations between the UK and the Caribbean following Brexit and was widely welcomed by businesses and private sector associations in the region.\nMembers\nThe agreement covers the following countries:\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\nSuriname signed the agreement on 4 March 2021 and the agreement was provisionally applied to cover the country the following day. Haiti is also eligible to join the CARIFORUM–United Kingdom Economic Partnership Agreement if it signs the agreement and brings it into effect.\nEconomic impact\nThe CARIFORUM-UK Economic Partnership Agreement (EPA) has significant economic implications for both the UK and CARIFORUM States. By granting immediate duty-free and quota-free access for CARIFORUM exports to the UK, the EPA helps preserve and potentially expand market opportunities for Caribbean producers, supporting export-led growth and regional integration. In return, CARIFORUM States commit to a gradual liberalization of tariffs on UK goods, though sensitive sectors are protected to safeguard local industries and government revenues. The agreement also covers trade in services, intellectual property, and government procurement, providing a comprehensive framework for economic cooperation.\nSee also\n* Antigua and Barbuda–United Kingdom relations\n* Bahamas–United Kingdom relations\n* Barbados–United Kingdom relations\n* Belize–United Kingdom relations\n* Economic Partnership Agreements\n* Foreign relations of Antigua and Barbuda\n* Foreign relations of the Bahamas\n* Foreign relations of Belize\n* Foreign relations of Dominica\n* Foreign relations of the Dominican Republic\n* Foreign relations of Grenada\n* Foreign relations of Guyana\n* Foreign relations of Jamaica\n* Foreign relations of Saint Kitts and Nevis\n* Foreign relations of Saint Lucia\n* Foreign relations of Saint Vincent and the Grenadines\n* Foreign relations of Suriname\n* Foreign relations of Trinidad and Tobago\n* Foreign relations of the United Kingdom\n* Free trade agreements of the United Kingdom\n* Grenada–United Kingdom relations\n* Jamaica–United Kingdom relations\n* Saint Kitts and Nevis–United Kingdom relations\n* Saint Vincent and the Grenadines–United Kingdom relations\n* Trinidad and Tobago–United Kingdom relations\nReferences"
    }
  ]
}