{
  "content": [
    {
      "type": "text",
      "text": "# Carlos P. Garcia Heritage House\n\n| start_date          =\n| material            = Stones, Bricks, and Wood\n| owner               = Garcia Family\n| map_type            =\n| map_caption         =\n}}\nThe President Carlos P. Garcia Heritage House is the residence of former Philippine President Carlos P. Garcia in Tagbilaran City, Bohol. It was declared as a heritage house by the National Historical Commission of the Philippines in 2009.\nLocation\nIt is located along A. Hontanosas Street, just a few blocks away from the Bohol Provincial Capitol and the Cathedral of Saint Joseph the Worker.\nHistory\nThe house was built during the years 1953–1954 on the former residence of the Jorolan family.  Carlos P. Garcia (CPG) did not own a house in the city as he was a native of Talibon town on the other side of the island province of Bohol. His family rented a house in the city while he was serving his constituents. After World War II, the Garcia family finally had the means to buy a parcel of land and build a house. Thence, the house became his official provincial residence. Years after his death, the Garcia house was rented to the Provincial Government of Bohol for use as a provincial museum. The collection consists of preserved local flora and fauna, small replicas of the century-old churches, as well as artifacts sourced from different parts of the province.\nA Memorandum of Agreement transferring the management of the museum from President Carlos P. Garcia Foundation, Inc. (PCPGFI) to the Bohol provincial government was signed last November 25, 2011 by Governor Edgar Chatto and Fernando Campos, son in law of Pres. Garcia and then secretary general of the foundation.\nRestoration\nIn 2006, the newly organized President Carlos P. Garcia Foundation, Inc. with the participation of the Bohol Association of Metro Manila, Inc. (BAMMI) and the Provincial Government of Bohol, began the long delayed process of transforming the residence into a permanent and well-organized venue that would perpetuate the memory of  this Boholano and showcase his memorabilia. The restoration project had three stages: the restoration of the original structure and surrounding gardens; renovations and design of the memorabilia contents and museum interiors; and lastly, building a commercial complex to provide management services and to ensure that ongoing expenses are provided in order to maintain and preserve the museum and its contents for future generations. The BAMMI, PCPGFI and the Talibon Real Estate and Development Corporation (TREDEC), a corporation run by the heirs of Carlos P. Garcia, are the frontrunners of raising funds for the construction of an Admissions Office and a Commercial Complex.\nDeclaration as Heritage House\nThe house was declared as a Heritage House by the National Historical Commission of the Philippines on September 4, 2009. Prior to the declaration, it formerly housed the Bohol Provincial Museum collection which is now located in the Bohol Branch of the National Museum of the Philippines, in the Bohol Provincial Capitol Complex.\nSee also\n*Carlos P. Garcia\n*Ancestral houses of the Philippines\nReferences\nBibliography\n*\n*"
    }
  ]
}