{
  "content": [
    {
      "type": "text",
      "text": "# Carl Abbott (urban historian)\n\n| nationality      = American\n| discipline       =\n| workplaces       =\n| alma_mater       =\n| thesis_year      = 1971\n| known_for        = Studies of American urban development and western cities\n| awards           =\n| spouse           = Margery Post Abbott\n| website            =\n}}\nCarl Abbott (born December 3, 1944) is an American urban historian with research interests in the modern American West, the Sun Belt, Portland, and the cultural imagination of cities, and he is professor emeritus of urban studies and planning at Portland State University.\nHe served as president of the Urban History Association and of the Pacific Coast Branch of the American Historical Association, and has co-edited both the Journal of the American Planning Association and Pacific Historical Review.\nEarly life and education\nAbbott was born in Knoxville, Tennessee, on December 3, 1944, and earned a B.A. in history from Swarthmore College in 1966 before completing an M.A. (1967) and Ph.D. (1971) at the University of Chicago.\nCareer\nHis academic positions have included the University of Denver (1971–72), Old Dominion University (1972–78), and Portland State University (1978–2012). He has also held visiting positions at Mesa University, George Washington University, and the University of Oregon.\nHe served as president of the Urban History Association (1995), has been a member of the American Historical Association since 1982 and served as president of its Pacific Coach Branch from 2012 until 2013. Other professional service has included co-editorship of the journal of the American Planning Association from 1999 to 2004 and of the Pacific Historical Review from 1997 to 2014.\nWriting\nAbbott has authored or co-authored sixteen books. The Metropolitan Frontier: Cities in the Modern American West (1993) received the book award of the Urban History Association and Political Terrain: Washington D.C. from Tidewater Town to Global Metropolis (1999) received the book award of the Society for American City and Regional Planning History. He has also published many scholarly articles, chapters, and reviewsб as well as shorter essays for general readers on his website.\nAbbott is also active in fields of public history, working with Portland's Architectural Heritage Center, The Oregon Encyclopedia, the Oregon Historical Society, and other organizations and is an advocate of community-based history.\nWorks\n* Colorado: The History of the Centennial State. Colorado Associated University Press, Boulder 1976. 5th ed., 2013 (with Stephen Leonard and Tom Noel): University of Colorado Press, Boulder, 2013, .\n* The Great Extravaganza: Portland and the Lewis and Clark Exposition. Oregon Historical Society, Portland, 1981, .\n* Boosters and Businessmen: Popular Economic Thought and Urban Growth in the Antebellum Middle West. Greenwood Press, Westport CT 1981, .\n* The New Urban America: Growth and Politics in Sunbelt Cities. University of North Carolina Press, 1981. Revised ed., 1987, .\n* Portland: Planning, Politics, and Growth in a Twentieth Century City. University of Nebraska Press, Lincoln, 1983, .\n* Urban America in the Modern Age, 1920 to Present. H. Davidson, Arlington Heights IL, 1987. 2nd ed., 2007, .\n* The Metropolitan Frontier: Cities in the Modern American West. University of Arizona Press, Tucson, 1993, .\n* Planning a New West: The Columbia River Gorge National Scenic Area (with Sy Adler and Margery Post Abbott). Oregon State University Press, Corvallis, 1997. .\n* Political Terrain: Washington, D.C., from Tidewater Town to Global Metropolis. University of North Carolina Press, Chapel Hill, 1999, .\n* Greater Portland: Urban Life and Landscape in the Pacific Northwest. University of Pennsylvania Press, Philadelphia, 2001, .\n* Two Centuries of Lewis and Clark: Reflections on the Voyage of Discovery (with William L. Lang). Oregon Historical Society Press, Portland, 2004, .\n* Frontiers Past and Future: Science Fiction and the American West. University Press of Kansas, Lawrence, 2006, .\n* How Cities Won the West: Four Centuries of Urban Change in Western North America. University of New Mexico Press, Albuquerque, 2008, .\n* Portland in Three Centuries: The Place and the People. Oregon State University Press, Corvallis 2011.\n* Imagined Frontiers: Contemporary America and Beyond. University of Oklahoma Press, Norman 2015,\n* Imagining Urban Futures: Cities in Science Fiction and What We Might Learn from Them. Wesleyan University Press, Middletown, CT 2016.\nPersonal life\nSince 1967, Carl has been married to Margery Post Abbott, a Quaker scholar and teacher.\nReferences"
    }
  ]
}