{
  "content": [
    {
      "type": "text",
      "text": "# Carmelite Church, Warsaw\n\n|location_town=Warsaw\n|location_country=Poland\n|architect=Jan Szymon Belotti, Efraim Szreger (façade)\n|client=Michał Stefan Radziejowski\n|engineer=\n|construction_start_date=1661\n|completion_date=1681\n|date_demolished=\n|cost=\n|structural_system=\n|style=Baroque (façade Neoclassical, 1761-83)\n|footnotes=\n}}}}\nChurch of the Assumption of the Virgin Mary and of St. Joseph (), commonly known as the Carmelite Church (), is a Roman Catholic church at Krakowskie Przedmieście 52/54 in Warsaw, Poland.\nThe Carmelite Church has Warsaw's most notable neoclassical-style façade, created in 1761–83. The church assumed its present appearance beginning in the 17th century and is best known for its twin belfries shaped like censers.\nHistory\nThe present church is the second building to have arisen here, erected over the site of a wooden church originally constructed for the Discalced Carmelite Order in 1643 and burned down by the Swedes and Brandenburg Germans in the 1650s.\nPolish-baroque architecture]]\nThe new building was founded in 1661 by Polish Primate Michał Stefan Radziejowski, who also established Warsaw's Holy Cross Church. It was built in 1692–1701 to the plan of Józef Szymon Bellotti.\nThe church's basic structure had been largely completed by the end of the 17th century, but the present façade was not begun till 1761. It was erected by Prince Karol Stanisław Radziwiłł, who commissioned the German architect Efraim Szreger to draw up a plan for a comprehensive new façade. This impressive façade was built in a style typical for the reign of King Stanisław II Augustus, with dominant columns supporting the cornice.\nThe distinguished 18th-century artist Szymon Czechowicz embellished the church with his paintings. Another leading Polish painter, Franciszek Smuglewicz, created altar paintings. The interior is opulent, with magnificent rococo main altar, gilding and  stucco ceiling decorations.\nThe Carmelite Church was the site of Frédéric Chopin's first employment. He was invited to give a recital on the church's organ.\nFormer Carmelite Church and monument to Adam Mickiewicz\nIn 1864, after the January Uprising was brutally crushed by Russians, the monastery was liquidated by the Tsarist regime as a stronghold of Polish patriotism. The buildings have been since adapted for the Warsaw Archdiocesan Seminary and the former Carmelite Church serves as the seminary church.\nThe church was the background for the song \"Siekera, Motyka\", in the Polish Movie, \"Forbidden Melodies\"\nIt served as a procathedral until the reconstruction of St. John's Cathedral.\nSee also\n* Presidential Palace\n* St. Anne's Church\n* St. Florian's Cathedral\nReferences\n::General:\n#\nExternal links\n*  [http://um.warszawa.pl/v_syrenka/perelki/index_en.php?mi_id=99&dz_id=12 Carmelite Church]\n*  [http://www.warszawa1939.pl/index.php?r1=krakowskie_52&r3=0 www.warszawa1939.pl]\n*  [http://www.dziedzictwo.ekai.pl/@@warszawa_kosciol_seminaryjny www.dziedzictwo.ekai.pl]"
    }
  ]
}