{
  "content": [
    {
      "type": "text",
      "text": "# Carnation Revolution__disambig_1\n\n| time-begin = Entire movement:\n| time-end = }}\n| timezone = UTC+1\n| place = Mainland Portugal\n| causes = * Military's backlash against the Portuguese Colonial War, the approval of the decrees-law 353/73 of July and 409/73 of August, military's lack of prestige, largescale conscription, massive military expenditures, and subsequent international isolation\n* Political repression by the  regime on civil liberties, political freedom, and freedom of speech\n* Poor leadership by prime minister Marcelo Caetano\n| methods = Coup d'état\n| result = Coup successful\n*Dissolution of the\n*President Américo Tomás and prime minister Caetano dismissed and exiled\n*Dissolution of the National assembly, Corporative Chamber, council of state and government\n*Dismissal of all governors and the governors-general of Angola and Mozambique\n*Dissolution of Mocidade Portuguesa and Portuguese Legion\n*Beginning of the Portuguese transition to democracy\n*Dissolution of the Portuguese Empire\n*End of the Portuguese Colonial War and independence of Angola, Cape Verde, Guinea-Bissau, Mozambique, and São Tomé and Príncipe\n*Indonesian invasion of East Timor\n*Mass exodus of the  from the overseas provinces\n*Handover of Macau\n| side1 =  Armed Forces Movement Portuguese Armed Forces (several units) Public Security Police (several divisions)\n| side2 =   Portuguese Armed Forces General Directorate of Security  National Republican Guard\n| leadfigures1 =  Otelo Saraiva de Carvalho| Salgueiro Maia}}\n| leadfigures2 =  Américo Tomás| Marcelo Caetano| Joaquim da Silva Cunha| Joaquim da Luz Cunha| Fernando da Silva Pais| Adriano Augusto Pires}}\n| casualties_label = Deaths, injuries and arrests\n| fatalities = 6\n| injuries = 45\n| arrests = Hundreds of General Directorate of Security agents\n}}\nThe Carnation Revolution (), code-named Operation Historic Turn (), also known as the 25th of April (), was a military coup in Portugal by officers that overthrew the  regime on 25 April 1974. The coup produced major social, economic, territorial, demographic, and political changes in the European country and its overseas colonies through the Ongoing Revolutionary Process (Processo Revolucionário em Curso). It resulted in the Portuguese transition to democracy and the end of the Portuguese Colonial War. It also had worldwide repercussions by marking the beginning of the third wave of democracy.\nThe revolution began as a coup organised by the Armed Forces Movement (, MFA), composed of military officers who opposed the regime, but it was soon coupled with an unanticipated popular civil resistance campaign. Negotiations with African independence movements began, and by the end of 1974, Portuguese troops were withdrawn from Portuguese Guinea, which became a UN member state as Guinea-Bissau. This was followed in 1975 by the independence of Cape Verde, Mozambique, São Tomé and Príncipe and Angola in Africa and the declaration of independence of East Timor in Southeast Asia. These events prompted a mass exodus of Portuguese citizens from Portugal's African territories (mostly from Angola and Mozambique), creating over a million Portuguese \"returned\" – the retornados.\nThe Carnation Revolution got its name from the fact that almost no shots were fired, and from restaurant worker Celeste Caeiro who offered carnations to soldiers when the population took to the streets to celebrate the end of the dictatorship. Other demonstrators followed suit and placed carnations in the muzzles of guns and on soldiers' uniforms. In Portugal, 25 April is a national holiday (, Freedom Day) that commemorates the revolution.\nBackground\nBy the 1970s, nearly a half-century of authoritarian rule weighed on Portugal. The 28 May 1926 coup d'état implemented an authoritarian regime incorporating social Catholicism and integralism. In 1933, the regime was renamed the  (New State). António de Oliveira Salazar served as Prime Minister until 1968.\nAlthough there are documented cases of some local elections where an independent candidate who was allowed to run did actually win, those were exceedingly rare and the vast majority were sham elections where the government candidate usually ran unopposed, while the opposition used the limited political freedoms allowed during the brief election period to protest, withdrawing their candidates before the election to deny the regime political legitimacy.\nThe Estado Novo's political police, the PIDE (Polícia Internacional e de Defesa do Estado, later the DGS, Direcção-Geral de Segurança and originally the PVDE, Polícia de Vigilância e Defesa do Estado), persecuted opponents of the regime, who were often tortured, imprisoned or killed.\nIn 1958, General Humberto Delgado, a former member of the regime, stood against the regime's presidential candidate, Américo Tomás, and refused to allow his name to be withdrawn. Tomás won the election amidst claims of widespread electoral fraud, and the Salazar government abandoned the practice of popularly electing the president and gave the task to the National Assembly.\nPortugal's Estado Novo government remained neutral in the Second World War, and was initially tolerated by its NATO post-war partners due to its anti-communist stance. As the Cold War developed, Western Bloc and Eastern Bloc states vied with each other in supporting guerrillas in the Portuguese colonies, leading to the 1961–1974 Portuguese Colonial War.\nSalazar had a stroke in 1968, and was replaced as prime minister by Marcelo Caetano, who adopted a slogan of \"continuous evolution\", suggesting reforms, such as a monthly pension to rural workers who had never contributed to Portugal's social security. Caetano's Primavera Marcelista (Marcelist Spring) included greater political tolerance, but not a complete freedom of the press (prior censorship remained in place until April 25, 1974), and was seen as an opportunity for the opposition to gain concessions from the regime. In 1969, Caetano authorised the country's first democratic labour union movement since the 1920s. However, after the elections of 1969 and 1973, hard-liners in the government and the military pushed back against Caetano, with political repression against communists and anti-colonialists.\nEconomic conditions\nThe Estado Novo regime's economic policy encouraged the formation of large conglomerates. The regime maintained a policy of corporatism which resulted in the placement of much of the economy in the hands of conglomerates including those founded by the families of António Champalimaud (Banco Totta & Açores, Banco Pinto & Sotto Mayor, Secil, Cimpor), José Manuel de Mello (Companhia União Fabril), Américo Amorim (Corticeira Amorim) and the dos Santos family (Jerónimo Martins).\nOne of the largest was the Companhia União Fabril (CUF), with a wide range of interests including cement, petro and agro chemicals, textiles, beverages, naval and electrical engineering, insurance, banking, paper, tourism and mining, with branches, plants and projects throughout the Portuguese Empire.\nOther medium-sized family companies specialised in textiles (such as those in Covilhã and the northwest), ceramics, porcelain, glass and crystal (such as those in Alcobaça, Caldas da Rainha and Marinha Grande), engineered wood (such as SONAE, near Porto), canned fish (Algarve and the northwest), fishing, food and beverages (liqueurs, beer and port wine), tourism (in Estoril, Cascais, Sintra and the Algarve) and agriculture (the Alentejo, known as the breadbasket of Portugal) by the early-1970s. Rural families engaged in agriculture and forestry.\nIncome from the colonies came from resource extraction, of oil, coffee, cotton, cashews, coconuts, timber, minerals (including diamonds), metals (such as iron and aluminium), bananas, citrus, tea, sisal, beer, cement, fish and other seafood, beef and textiles. Labour unions were subject to severe restrictions, and minimum wage laws were not enforced. Starting in the 1960s, the outbreak of colonial wars in Africa set off significant social changes, among them the rapid incorporation of women into the labour market.\nColonial war\nhelicopter in Africa]]\nIndependence movements began in the African colonies of Portuguese Mozambique, Portuguese Congo, Portuguese Angola, and Portuguese Guinea. The Salazar and Caetano regimes responded with diverting more and more of Portugal's budget to colonial administration and military expenditure, and the country became increasingly isolated from the rest of the world, facing increasing internal dissent, arms embargoes and other international sanctions.\nBy the early-1970s, the Portuguese military was overstretched and there was no political solution in sight. Although the number of casualties was relatively small, the war had entered its second decade; Portugal faced criticism from the international community, and was becoming increasingly isolated. In 1973 the UN General Assembly passed a resolution calling for Portugal's immediate withdrawal from Guinea. Atrocities such as the Wiriyamu Massacre undermined the war's popularity and the government's diplomatic position, although details of the massacre are still disputed.\nThe war became unpopular in Portugal, and the country became increasingly polarised. Thousands of left-wing students and anti-war activists avoided conscription by emigrating illegally, primarily to France and the United States. Meanwhile, three generations of right-wing militants in Portuguese schools were guided by a revolutionary nationalism partially influenced by European neo-fascism, and supported the Portuguese Empire and an authoritarian regime.\nThe war had a profound impact on the country. The revolutionary Armed Forces Movement (MFA) began as an attempt to liberate Portugal from the Estado Novo regime and challenge new military laws which were coming into force. The laws would reduce the military budget and reformulate the Portuguese military. Younger military-academy graduates resented Caetano's programme of commissioning militia officers who completed a brief training course and had served in the colonies' defensive campaigns at the same rank as academy graduates.\nRevolution\n, a leader of the Carnation Revolution]]\nBy December 1973, it had become clear to several military officers that the Colonial War was unsustainable and the only solution to end it should be a political one, therefore Vasco Lourenço, Vítor Alves and Otelo Saraiva de Carvalho formed a commission to prepare a military coup to topple the regime.\nIn February 1974, Caetano decided to remove General António de Spínola from the command of Portuguese forces in Guinea in the face of Spínola's increasing disagreement with the promotion of military officers and the direction of Portuguese colonial policy. This occurred shortly after the publication of Spínola's book, Portugal and the Future, which expressed his political and military views of the Portuguese Colonial War. Several military officers who opposed the war formed the MFA to overthrow the government in a military coup. The MFA was headed by Vítor Alves, Otelo Saraiva de Carvalho and Vasco Lourenço, and was joined later by Salgueiro Maia. The movement was aided by other Portuguese army officers who supported Spínola and democratic civil and military reform.\nIn March 16, 1974, a group of 200 soldiers headed by Armando Marques Ramos organized a failed military coup in Caldas da Rainha. The unsuccessful attempt managed to convince Marcelo Caetano that the level of unrest in the military against the regime was overrated, and gave the leaders of the MFA the opportunity to learn from the mistakes made.\nThe coup was given the code name \"Operation Historic Turn\" and it had two secret signals: First, the disc jockey at Emissores Associados de Lisboa gave the time signal Falta cinco minutos às vinte e três at 22:55 on 24 April before turntabling Paulo de Carvalho's \"E Depois do Adeus\" (Portugal's entry in the 1974 Eurovision Song Contest). This alerted rebel captains and soldiers to begin the coup. The second signal came at 12:20 on 25 April, when Rádio Renascença broadcast \"Grândola, Vila Morena\" (a song by Zeca Afonso, an influential political folk musician and singer, many of whose songs were banned from Portuguese radio at the time). The MFA gave the signals to take over strategic points of power in the country. The content of the songs was largely uncontroversial—censorship would have prevented more inflammatory songs—but their broadcasting was a signal, not a direct call to arms.\nSix hours later, the Caetano government relented. Despite repeated radio appeals from the \"Captains of April\" (the MFA) advising civilians to stay home, thousands of Portuguese took to the streets&nbsp;– mingling with, and supporting, the military insurgents. A central gathering point was the Lisbon flower market, then richly stocked with carnations (which were in season). Some of the insurgents put carnations in their gun barrels, an image broadcast on television worldwide which gave the revolution its name. Although no mass demonstrations preceded the coup, spontaneous civilian involvement turned the military coup into a popular revolution \"led by radical army officers, soldiers, workers and peasants that toppled the senile Salazar dictatorship, using the language of socialism and democracy. The attempt to radicalise the outcome\", noted a contemporary observer of the time, \"had little mass support and was easily suppressed by the Socialist Party and its allies.\"\nCaetano found refuge in the main headquarters of the Lisbon military police, the National Republican Guard, at the Largo do Carmo. This building was surrounded by the MFA, which pressured him to cede power to Spínola. President Tomás was kept on the sidelines during the revolution and was only informed about the events that unfolded by Fernando da Silva Pais, head of the GDS. Tomás, his family and some members of the president's staff took refuge at the fort of Giribita, returning, later in the same day, to his personal residence in Lisbon. On the morning of April 26, however, he was sent to Madeira on his way to exile. Caetano and Tomás were sent to Brazil; Caetano spent the rest of his life there, and Tomás returned to Portugal a few years later. The revolution was closely watched by neighbouring Spain, where the government (and the opposition) were planning the succession of Spanish dictator Francisco Franco. Franco died a year and a half later, in 1975.\nThe military operation itself ended at 18:00 on 25 April having lasted 19 hours, however hostilities continued in Lisbon until the end of the siege of the national headquarters of the General Directorate of Security (GDS), the siege ended on 09:45 of the next day. At the national level, hostilities continued for several days afterwards with some districts still not recognizing the revolution at Lisbon. That situation continued until the fall of Coimbra district to the new regime on the 30th.\nHostilities in Lisbon are considered to have ended after the end of the siege of GDS when Fernando da Silva Pais, its last director-general, removed, in the presence of commander Luís Costa Correia, the portraits of Salazar, Caetano, and Tomás from the wall of his office.\nThe movement still had to ensure the control of all Portugal however, given the resistance by local authorities in other district capitals, the revolution in Lisbon had no practical effects in those districts as the former regime's authorities were still in place there. That was the case of Coimbra where only on 30 April, with the direct involvement of the military, after a four-day siege of the GDS branch in Coimbra headquarters, the new democratic powers were constituted at the university, the city, at the civil government of the district and at the municipalities belonging to it.}}\nDuring the siege of the GDS headquarters, at 20:15 on 25 April, GDS authorities started shooting warning shots towards the crowd outside the building, killing four civilians and injuring 45. That same evening and the following days, several GDS personnel were arrested. At 21:20 the same evening, a low level GDS staff member, was shot dead by MFA forces.}} A member of the shock police was also shot dead at the Luís de Camões square by the MFAs when in a misunderstanding, they started targeting a motorcade of police cars which the agent was part of. The identities of the perpetrators of all these deaths are still unknown.\nAftermath\nAfter the coup, power was held by the National Salvation Junta (a military junta). Portugal experienced a turbulent period, known as the Processo Revolucionário Em Curso (Ongoing Revolutionary Process).\nThe conservative forces surrounding Spinola and the MFA radicals initially confronted each other covertly or overtly, and Spinola was forced to appoint key MFA figures to senior security positions. Right-wing military figures attempted an unsuccessful counter-coup, leading to Spinola's removal from office. Unrest within the MFA between leftist forces often close to the Communist Party, and more moderate groups often allied with the Socialists eventually led to the group's splintering and dissolution.\nThis stage of the PREC lasted until the coup of 25 November 1975, led by a group of far-left officers, specifically Otelo Saraiva de Carvalho. It was said to be a Communist plot to seize power, in order to discredit the powerful Communist Party. It was followed by a successful counter-coup by more centrist officers, and was marked by constant friction between liberal-democratic forces and leftist-communist political parties. Portugal's first free election was held on 25 April 1975 to write a new constitution replacing the 1933 constitution in force during the Estado Novo era. Another election was held in 1976, and the first constitutional government, led by centre-left socialist Mário Soares, took office.\nDecolonisation\nBefore April 1974, the intractable Portuguese colonial war in Africa consumed up to 40 percent of the Portuguese budget. Although part of Guinea-Bissau became independent de facto in 1973, Bissau (its capital) and the large towns were still under Portuguese control. In Angola and Mozambique independence movements were active in more remote rural areas from which the Portuguese Army had retreated.\nA consequence of the Carnation Revolution was the sudden withdrawal of Portuguese administrative and military personnel from its overseas colonies. Hundreds of thousands of Portuguese Africans returned to Portugal, becoming known as the retornados. These people—workers, small business people, and farmers—often had deep roots in the former colonies.\nA 1978 Portuguese offer to return Macau to China was refused, as the Chinese government did not want to risk jeopardising negotiations with the UK over returning Hong Kong. The territory remained a Portuguese colony until 1999, when it was transferred to China with a joint declaration, and enacted a \"one country, two systems\" policy similar to that of Hong Kong.\nEconomic issues\nThe Portuguese economy changed significantly between 1961 and 1973. Total output (GDP at factory cost) had grown by 120 percent in real terms. The pre-revolutionary period was characterised by robust annual growth in GDP (6.9 percent), industrial production (nine percent), consumption (6.5 percent), and gross fixed capital formation (7.8 percent). The revolutionary period experienced a slowly-growing economy, whose only impetus was its 1986 entrance into the European Economic Community (EEC). Although Portugal never regained its pre-revolution growth, at the time of the revolution it was an underdeveloped country with poor infrastructure, inefficient agriculture and some of the worst health and education indicators in Europe.\nPre-revolutionary Portugal had some social and economic achievements. After a long period of economic decline before 1914, the Portuguese economy recovered slightly until 1950. It began a period of economic growth in common with Western Europe, of which it was the poorest country until the 1980s. Portuguese economic growth between 1960 and 1973 (under the Estado Novo regime) created an opportunity for integration with the developed economies of Western Europe despite the colonial war. Through emigration, trade, tourism and foreign investment, individuals and companies changed their patterns of production and consumption. The increasing complexity of a growing economy sparked new technical and organisational challenges.\nOn 13 November 1972, Fundo do Ultramar (The Overseas Fund, a sovereign wealth fund) was enacted with Decreto-Lei n.º 448/ /72 and the Ministry of Defence ordinance Portaria 696/72 to finance the war. The increasing burden of the war effort meant that the government had to find continuous sources of financing. Decreto-Lei n.º 353, of 13 July 1973 and Decreto-Lei n.º 409 of 20 August 1973 were enforced to reduce military expenses and increase the number of officers by incorporating militia and military-academy officers as equals.\nAccording to government estimates, about  of agricultural land were seized between April 1974 and December 1975 as part of land reform; about 32 percent of the appropriations were ruled illegal. In January 1976, the government pledged to restore the illegally occupied land to its owners in 1976, and enacted the Land Reform Review Law the following year. Restoration of illegally occupied land began in 1978.\nIn 1960, Portugal's per-capita GDP was 38 percent of the EEC average. By the end of the Salazar period in 1968 it had risen to 48 percent, and in 1973 it had reached 56.4 percent; the percentages were affected by the 40 percent of the budget which underwrote the African wars. In 1975 (the year of greatest revolutionary turmoil), Portugal's per-capita GDP declined to 52.3 percent of the EEC average. Due to revolutionary economic policies, oil shocks, recession in Europe and the return of hundreds of thousands of overseas Portuguese from its former colonies, Portugal began an economic crisis in 1974–1975.\nReal gross domestic product growth resumed as a result of Portugal's economic resurgence since 1985 and adhesion to the EEC. The country's 1991 per-capita GDP reached 54.9 percent of the EEC average, slightly exceeding the level at the height of the revolutionary period.\nA January 2011 story in the Diário de Notícias (a Portuguese tabloid format newspaper) reported that the government of Portugal encouraged overspending and investment bubbles in public-private partnerships between 1974 and 2010, and the economy has been damaged by risky credit, public debt creation, overstaffing in the public sector, a rigid labour market and mismanaged European Union's structural and cohesion funds for almost four decades. Prime Minister José Sócrates' cabinet was unable to foresee or forestall this when symptoms first appeared in 2005, and could not ameliorate the situation when Portugal was on the verge of bankruptcy in 2011 and required financial assistance from the International Monetary Fund and the European Union.\nFreedom of religion\nThe constitution of 1976 guarantees all religions the right to practise, and non-Catholic groups are recognised as legal entities with the right to assemble. Non-Catholic conscientious objectors have the right to apply for alternative military service. The Catholic Church, however, still sought to impede other missionary activity.\nLegacy\nin Lisbon]]\nConstruction of what is now called the 25 de Abril Bridge began on 5 November 1962. It opened on 6 August 1966 as the Salazar Bridge, named after Estado Novo leader Salazar. Soon after the Carnation Revolution of 1974, the bridge was renamed the 25 de Abril Bridge to commemorate the revolution. Citizens who removed the large, brass \"Salazar\" sign from a main pillar of the bridge and painted a provisional \"25 de Abril\" in its place were recorded on film.\nMany Portuguese streets and squares are named vinte e cinco de Abril (25 April), for the day of the revolution. The Portuguese Mint chose the 40th anniversary of the Carnation Revolution for its 2014 2 euro commemorative coin.\nFreedom Day\nFreedom Day (25 April) is a national holiday, with state-sponsored and spontaneous commemorations of the civil liberties and political freedoms achieved after the revolution. It commemorates the 25 April 1974 revolution and Portugal's first free elections on that date the following year.\nFilms\n* Setúbal, ville rouge (France–Portugal 1975 documentary, b/w and colour, 16&nbsp;mm, 93 minutes, by Daniel Edinger)&nbsp;– In October 1975 Setúbal, neighbourhood committees, factory committees, soldiers' committees and peasant cooperatives organise a central committee.\n* Cravos de Abril (April Carnations), 1976 documentary, b/w and colour, 16&nbsp;mm, 28 minutes, by Ricardo Costa – Depicts the revolutionary events from 24 April to 1 May 1974, illustrated by the French cartoonist Siné.\n* Scenes from the Class Struggle in Portugal – U.S.–Portugal 1977, 16&nbsp;mm, b/w and colour, 85 minutes, directed by Robert Kramer\n* A Hora da Liberdade (The Hour of Freedom), 1999 documentary, by Joana Pontes, Emídio Rangel and Rodrigo de Sousa e Castro\n* Capitães de Abril (April Captains), a 2000 dramatic film by Maria de Medeiros about the Carnation Revolution\n* 25 de Abril: uma Aventura para a Democracia (25th April: an Adventure for Democracy), 2000 documentary, by Edgar Pêra\n* The BBC-made A New Sun is Born, a two-part television series, for the UK's Open University. The first episode details the coup, and the second narrates the transition to democracy.\n* Longwave (''Les Grandes Ondes (à l'ouest)), a 2013 screwball comedy about Swiss radio reporters assigned to Portugal in 1974\n* The GDR made several films about the revolution and transmitted on state television, including, (Lourenço und der Lieutenant) and (Santa Vitoria gibt nicht auf).\n* Revolução sem sangue'' (2024)\nSee also\n*Aster Revolution\n*Armed Revolutionary Action\n*5 October 1910 revolution\n*1960 Turkish coup d'état\n* Flower Power (photograph)\nNotes\nReferences\nFurther reading\n*\n*\n*\n*\n*\n**  Online copy of Mailer's book, plus Maurice Brinton's original Introduction to the 1977 edition.\n*\n*\n*\n*\nExternal links\n*"
    }
  ]
}