{
  "content": [
    {
      "type": "text",
      "text": "# Caroline Edwards\n\n| occupation         = United States Capitol Police officer\n| known_for          = Defending the United States Capitol during the January 6 attack\n|module     =\n}}\nCaroline Edwards (born 1991) is an American officer of the United States Capitol Police who is known for defending the Capitol building and its occupants during the January 6 attack. She was the first Capitol Police officer to be injured by the mob of rioters on the day of the attack.\nEdwards was stationed on the West front of the Capitol at the start of the attack. She signaled on the Capitol Police radio that her first responder unit needed help, and alerted several other officers around the Capitol that the police were being overrun by the mob. She was then pushed over with a bike rack by Ryan Samsel, and hit her head on a handrail, which cracked her skull and gave her a concussion, making her lose consciousness; she awoke minutes later and continued her defense, engaging in hand-to-hand combat for hours. Her concussion caused permanent traumatic brain injury effects. She testified to the House Select Committee investigating the attack in 2022 and was awarded the Presidential Citizens Medal by U.S. president Joe Biden in 2023.\nEarly life\nCaroline Edwards was born in 1991. She is the granddaughter of a United States Marine who fought in the Korean War. Edwards is from Atlanta, and attended the University of Georgia Grady College of Journalism and Mass Communication. She graduated cum laude with a bachelor's degree in public relations.\nCareer\nEdwards joined the United States Capitol Police, which protects the Capitol building in Washington D.C., in 2017. She was trained by officer Harry Dunn. She serves on the officers union board. By 2021, she had worked on \"hundreds of civil disturbances\" to the Capitol.\nJanuary 6 Capitol attack\nOn January 6, 2021, supporters of then-U.S. president Donald Trump stormed the Capitol in an attempted insurrection, hoping to overturn Congress' certification of Electoral College votes in the 2020 presidential election. The certification would confirm Trump's opponent, Joe Biden, to be the next President. The attack began around 1 p.m., when Trump finished speaking at Washington D.C.'s Ellipse park, and his supporters who were there started marching east towards the Capitol. This included members of the Proud Boys militia group. Capitol Police leaders knew of a threat to the Capitol but did not tell the stationed officers. At the time of the attack, Edwards was 31 and a private first class officer.\nThat day, Edwards had been stationed at the Peace Circle on the West front of the Capitol grounds, backed by four other officers in the first responder unit. Her group, like other Capitol Police officers, had been trained for riots, but her group was not fitted with riot gear that day. A nearby school bus containing riot gear was available but was locked, and officers were unsuccessful at opening it. Her group was also not behind a \"universal fence\" surrounding the building; instead, she was stationed behind a series of bike racks in front of a series of stone steps. (red) approaches a bike rack by which Edwards (left of farthest-left yellow box) is stationed]]\nEdwards was the first Capitol Police officer to be injured by the incoming mob once they reached the Capitol grounds. At the beginning of the attack, a group of Arizona Proud Boys approached the Peace Circle barricade. Edwards called for help on the radio, which was heard by other officers around the building and was a sign that the mob was overrunning the police. She attempted to delay their approach towards the Capitol while backup was arriving. Proud Boys leader Joseph Biggs encouraged Ryan Samsel to approach the bike rack by which Edwards was posted. Samsel has denied this conversation happened. Samsel then pushed the bike rack over, which hit her on the head. This made her fall, and while falling, her chin hit the handrail of the steps behind her, causing a concussion which made her lose consciousness. She then hit the back of her head on one of the steps behind her, cracking it. The concussion gave her a traumatic brain injury. The mob then began attacking the other officers, who were pushed back. Edwards awoke minutes later while she was being picked up by Samsel, and then she shook him off and began treating the injured on the scene, such as decontaminating those who were pepper-sprayed. She then continued the defense, rushing to support the officers who had been pushed back and were holding a line in the Capitol's lower West Terrace. She felt confused and dizzy while doing it. She then engaged with the mob in hand-to-hand combat for hours. While fighting, she was teargassed and pepper-sprayed in her eyes. She later said that in her training she was taught to control riots but not to do hand-to-hand combat. She later testified to Congress:\nThe Capitol attack went on for four hours after Ryan Samsel's first assault. Edwards stopped many rioters from entering the building; at one point, she spotted a rioter heading towards an evacuation route for the Capitol's occupants, and handcuffed him, taking him to a prisoner processing section of the Capitol Police headquarters building. She then blacked out inside the building and was taken by ambulance to a hospital in Silver Spring, Maryland, because the hospitals in Washington D.C. were full. The hospital gave her a CT scan and put her in a neck collar.\nAftermath\nEdwards temporarily left the force due to her injuries. For months after the attack, Edwards was bedridden, and had episodes of vertigo, migraines, and fainting likely caused by the traumatic brain injury. In February 2021, speaking as a member of the officers union, Edwards became one of the first Capitol Police officers to publicly criticize her department's lack of preparation for the attack. In May 2021, Edwards returned to the Capitol Police force as a peer counselor for mental health.\nOn June 9, 2022, Edwards testified to the U.S. House Select Committee on the January 6 Attack regarding her experiences during the attack. Her testimony was paired with footage of the attacks not seen before in public, including of her being knocked unconscious. As she was one of the first witnesses to testify in the committee's public hearings, The Guardian wrote: \"[Her testimony] showed viewers at home that the attack on the Capitol in Washington DC was not an accident, but rather an intentional effort to inflict violence.\"\nOn January 6, 2023, Edwards and 13 other officers (3 of them posthumous) were awarded the Presidential Citizens Medal by then-president Joe Biden for their work in protecting the Capitol. The medal recognizes \"citizens of the United States of America who have performed exemplary deeds of service for their country, or their fellow citizens\". On April 3, 2023, she was awarded the 2023 Dean's Medal for Leadership Excellence from the University of Georgia Grady College for her \"defense of the heart of American democracy\". As of October 2023, Edwards said she still has migraines from her brain injury and has to take monthly medication for it.\nRyan Samsel legal issues\nSamsel was arrested in January 2021. The Federal Bureau of Investigation (FBI) discovered his identity by putting a picture of his face on January 6 into facial recognition software and receiving a match on his girlfriend's Instagram page. In October 2023, Samsel went on trial, charged with assault on police with and without a dangerous weapon (a felony), obstruction of an official proceeding (a felony), and an act of physical violence in the Capitol grounds or buildings (a misdemeanor). He had pled not guilty, and Edwards testified against him and four other co-defendants during the trial. Prosecutors argued that he was the catalyst for the rioting. Samsel's lawyer, Stanley Woodward Jr., argued that \"Those barricades didn’t fall because of anything Mr. Samsel did or was going to do\" ... \"They were going to fall… It’s not even remotely possible to pin the events of Jan. 6 on Mr. Samsel.\" He also said that \"bike racks are not a dangerous weapon\".\nThe trial ended in December 2023, and on February 2, 2024, Samsel was convicted of all of the charges. On January 20, 2025, Donald Trump, now serving a second term as president, pardoned Samsel and around 1,500 other people charged with crimes connected to the January 6 attack. Samsel was released from custody the following day.\nReferences"
    }
  ]
}