{
  "content": [
    {
      "type": "text",
      "text": "# Carolingian Empire__disambig_1\n\n| conventional_long_name = Carolingian Empire\n| image_flag             =\n| flag_type              =\n| era                    = Middle Ages\n| event_start            = Coronation of Charlemagne\n| date_start             = 25 December\n| year_start             = 800\n| event_end              = Deposition of Charles the Fat\n| date_end               = 17 November\n| year_end               = 887\n| event1                 = Division after the Treaty of Verdun\n| date_event1            = 10 August 843\n| p1                     = Francia\n| p2                     = Avar Khaganate\n| p3                     = Kingdom of the Lombards\n| p4                     = Saxons\n| p5                     = Merovingian dynasty\n| s1                     = West Francia\n| s2                     = Middle Francia\n| s3                     = East Francia\n| flag_s4                = Banner of the Holy Roman Emperor with haloes (1430-1806).svg\n| s4                     = Holy Roman Empire\n| image_map              = Francia 814.svg\n| image_map_caption      = The Carolingian Empire at its greatest extent in 814\n*\n}}\n| capital                = Metz, Aachen\n| official_languages     = Medieval Latin\n| common_languages       = RomanceGermanicSlavicBasqueBreton\n| religion               = Chalcedonian Christianity (under the jurisdiction of the Church of Rome)(official)\n| government_type        = Monarchy\n| currency               = Denarius\n| title_leader           = Emperor\n| leader1                = Charlemagne\n| year_leader1           = 800–814\n| leader2                = Charles the Fat\n| year_leader2           = 881–887\n| stat_area1             = 1200000\n| ref_area1              =\n| stat_pop1              = 10,000,000–20,000,000\n| ref_pop1               =\n}}\nThe Carolingian Empire (800–887) was a Frankish-dominated empire in Western and Central Europe during the Early Middle Ages. It was ruled by the Carolingian dynasty, which had ruled as kings of the Franks since 751 and as kings of the Lombards in Italy from 774. In 800 Pope Leo III crowned King Charlemagne as Roman emperor in return for political protection, disregarding the universalist claims of the weakened Byzantine Empire. The Carolingian Empire is sometimes considered the first phase in the history of the Holy Roman Empire.\nAfter a civil war from 840 to 843 following the death of Emperor Louis the Pious, the empire was divided into autonomous kingdoms, with one king still recognised as emperor but with little authority outside his own kingdom. The unity of the empire and the hereditary right of the Carolingians continued to be acknowledged. In 884 Charles the Fat reunited all the Carolingian kingdoms for the last time, but he was deposed by the Frankish nobility in 887 and died in 888, and the empire immediately fractured. With the only remaining legitimate male of the dynasty a child, the nobility elected regional kings from outside the dynasty or, in the case of the eastern kingdom, an illegitimate Carolingian. The illegitimate line continued to rule in the east until 911, while in the western kingdom the legitimate Carolingian dynasty was restored in 898 and ruled until 987 with an interruption from 922 to 936.\nThe population of the empire was roughly between 10 and 20&nbsp;million people. Its heartland was Francia, the land between the Loire and the Rhine, where Aachen, which Charlemagne chose as his primary residence, was located. In the south it crossed the Pyrenees and bordered the Emirate of Córdoba and (after 824) the Kingdom of Pamplona; to the north it bordered the kingdom of the Danes; to the west it had a short land border with Brittany, which was later reduced to a tributary; and to the east it had a long border with the Slavs and the Avars, who were eventually defeated and their land incorporated into the empire. In southern Italy, the Carolingians' claims to authority were disputed by the Byzantines and the vestiges of the Lombard kingdom in the Principality of Benevento. In its day, it was known by various Latin names; the term \"Carolingian Empire\" arose later.\nNomenclature\nThe term \"Carolingian Empire\" is a modern convention and was not used by its contemporaries. The language of official acts in the empire was Latin. During its existence, the empire was referred to by several names. The term  was used to refer to 'the whole kingdom', distinguishing it from the regional kingdoms.  'Roman empire' was commonly used to refer to the Roman traditions of imperial statehood in general, while the more complex  'empire of the Romans and Franks'—sometimes with  'Roman' replacing  'of the Romans' and  'and' replacing  'or'—provided the basis for modern historiographical terms, like Franko-Roman Empire or Frankish-Roman Empire.  'Christian empire' was also used.\nHistory\nRise of the Carolingians (732–768)\nThough Charles Martel chose not to take the title of king (as his son Pepin III would) or emperor (as his grandson Charlemagne), he was the absolute ruler of virtually all of today's continental Western Europe north of the Pyrenees. Only the remaining Saxon realms (which he partly conquered), Lombardy, and the Spanish March were significant additions to the Frankish realms after his death.\nMartel cemented his place in history with his defense of Christian Europe against a Muslim army at the Battle of Tours in 732. The Iberian Saracens had incorporated Berber light horse cavalry with the heavy Arab cavalry to create a formidable army that had almost never been defeated. Christian European forces, meanwhile, lacked the powerful tool of the stirrup. In this victory, Charles earned the surname Martel (\"the Hammer\"). Historian Edward Gibbon calls Martel \"the paramount prince of his age\".\nPepin III accepted the nomination as king by Pope Zachary in about 741. Charlemagne's rule began in 768 at Pepin's death. He proceeded to take control of the kingdom following his brother Carloman I's death, as the two brothers co-inherited their father's kingdom.\nReign of Charlemagne (768–814)\njewelry from c. 800. Found in the Netherlands, 1969.]]\nThe Carolingian Empire during the reign of Charlemagne covered most of Western Europe, as the Roman Empire once had. Unlike the Romans, whose imperial ventures between the Rhine and the Elbe lasted fewer than 20 before being cut short by the disaster at Teutoburg Forest (9&nbsp;AD), Charlemagne defeated the Germanic resistance and extended his realm to the Elbe more lastingly, influencing events almost to the Eurasian Steppes. Charlemagne was crowned Roman Emperor in 800.\nCharlemagne's reign was one of near-constant warfare, participating in annual campaigns, many led personally. He defeated the Lombard Kingdom in 774 and annexed it into his own domain by declaring himself 'King of the Lombards'. He later led a failed campaign into Spain in 778, ending with the Battle of Roncevaux Pass, which is considered Charlemagne's greatest defeat. He then extended his domain into Bavaria after forcing Tassilo III, Duke of Bavaria, to renounce any claim to his title in 794. His son Pepin was ordered to campaign against the Avars in 795 since Charlemagne was occupied with Saxon revolts. Eventually, the Avar confederation ended in 803 after Charlemagne sent a Bavarian army into Pannonia. He also conquered Saxon territories in wars and rebellions fought from 772 to 804, with such events as the Massacre of Verden in 782 and the codification of the Lex Saxonum in 802.\nPrior to the death of Charlemagne, the empire was divided among various members of the Carolingian dynasty. These included King Charles the Younger who received Neustria; King Louis the Pious who received Aquitaine; and King Pepin who received Italy. Pepin died with an illegitimate son, Bernard, in 810, and Charles died without heirs in 811. Although Bernard succeeded Pepin as king of Italy, Louis was made co-emperor in 813, and the empire passed to him with Charlemagne's death in the winter of 814.\nReign of Louis the Pious and Civil War (814–843)\n(843)]]\nLouis the Pious' reign as emperor was unexpected; as the third son of Charlemagne, he was originally crowned King of Aquitaine at three years old. With the deaths of his older siblings, he went from \"a boy who became a king to a man who would be emperor.\" Although his reign was mostly overshadowed by the dynastic struggle and resultant civil war, as his epithet states, he was highly interested in matters of religion. One of the first things he did was \"ruling the people by law and with the wealth of his piety,\" namely by restoring churches. \"The Astronomer\" states that during his kingship of Aquitaine he \"built up the study of reading and singing, and also the understanding of divine and worldly letters, more quickly than one would believe.\" He also made significant effort to restore many monasteries that had disappeared prior to his reign, as well as sponsoring new ones.\nLouis the Pious' reign lacked security; he often had to struggle to maintain control of the empire. As soon as he heard of the death of Charlemagne, he hurried to Aachen, where he exiled many of Charlemagne's trusted advisors, such as Wala. Wala and his siblings were children of the youngest son of Charles Martel and so were a threat as a potential alternative ruling family. Monastic exile was a tactic Louis used heavily in his early reign to strengthen his position and remove potential rivals. In 817 his nephew King Bernard of Italy rebelled against him because he was discontent with being the vassal of Lothar, Louis' eldest son. The rebellion was quickly put down by Louis, and by 818 Bernard was captured and punished—the punishment of death was commuted to blinding. However, the trauma of the procedure ending up killing him two days later. Italy was brought back into imperial control. In 822, Louis' show of penance for Bernard's death greatly reduced his prestige as emperor to the nobility; some suggest it opened him up to clerical domination.\nIn 817 Louis had established three Carolingian kingships for his sons from his first marriage: Lothar was made king of Italy and co-emperor, Pepin was made king of Aquitaine, and Louis the German was made king of Bavaria. His attempts in 823 to bring his fourth son (from his second marriage) Charles the Bald into the will was marked by the resistance of his eldest sons. Whilst this was part of the reason for strife amongst Louis' sons, some suggest that it was the appointment of Bernard of Septimania as chamberlain which caused discontent with Lothar, as he was stripped of his co-emperorship in 829 and was banished to Italy (although it is not known why; The Astronomer simply states Louis \"dismissed his son Lothar to go back to Italy\") and Bernard assumed his place as second in command to the emperor. With Bernard's influence over the emperor and empress, further discord was sowed amongst prominent nobility. Pepin was disgruntled; he had been implicated in a failed military campaign in 827, and he was tired of his father's overbearing involvement in the ruling of Aquitaine. As such, the angry nobility supported Pepin, civil war broke out during Lent in 830, and the last years of Louis' reign were plagued by civil war.\nShortly after Easter, his sons attacked Louis' empire and dethroned him in favour of Lothar. The Astronomer states that Louis spent the summer in the custody of his son, as an emperor in name only. In 831 Louis attacked his sons' kingdoms by drafting new plans for succession. Louis gave Neustria to Pepin, stripped Lothar of his imperial title and granted the Kingdom of Italy to Charles. Another partition in 832 completely excluded Pepin and Louis the German, making Lothar and Charles the sole benefactors of the kingdom, which precipitated a revolt by Pepin and Louis the German in 832, followed by a revolt by Lothar in 833, and together they imprisoned Louis the Pious and Charles. Lothar brought Pope Gregory IV from Rome under the guise of mediation, but his true role was to legitimise Lothar and his brothers' rule by deposing and excommunicating Louis.\nBy 835, peace was made within the family, and Louis was restored to the imperial throne at the church of St. Stephen in Metz. When Pepin died in 838, Louis crowned Charles king of Aquitaine, whilst the nobility elected Pepin's son Pepin II, a conflict which was not resolved until 860 with Pepin's death. When Louis the Pious died in 840, Lothar claimed the entire empire irrespective of the partitions. As a result, Charles and Louis the German went to war against Lothar. After losing the Battle of Fontenay in 841, Lothar fled to his capital at Aachen and raised a new army, which was inferior to that of the younger brothers. In the Oaths of Strasbourg in 842, Charles and Louis agreed to declare Lothar unfit for the imperial throne. This marked the east–west division of the empire between Louis and Charles. Considered a milestone in European history, the Oaths of Strasbourg symbolize the birth of both France and Germany.\nAfter the Treaty of Verdun (843–877)\nThe partition of Carolingian Empire was finally settled in 843 by and between Louis the Pious' three sons in the Treaty of Verdun. Lothar received the imperial title, the kingship of Italy, and the territory between the Rhine and Rhone Rivers, collectively called the Central Frankish Realm. Louis was guaranteed the kingship of all lands to the east of the Rhine and to the north and east of Italy, which was called the Eastern Frankish Realm, which was the precursor to modern Germany. Charles received all lands west of the Rhone, which was called the Western Frankish Realm.\nLothar retired Italy to his eldest son Louis II in 844, making him co-emperor in 850. By the Treaty of Prüm (855), Lothar divided his kingdom into three parts: the Italian territory already held by Louis remained his, the territory of the former Kingdom of Burgundy was granted to his third son Charles of Burgundy, and the remaining territory for which there was no traditional name was granted to his second son Lothar II, whose realm was named Lotharingia.\nLouis II, dissatisfied with having received no additional territory upon his father's death, allied with his uncle Louis the German against his brother Lothar and his uncle Charles the Bald in 858. Lothar reconciled with his brother and uncle shortly after. Charles was so unpopular that he could not raise an army to fight the invasion and instead fled to Burgundy. He was only saved when the bishops refused to crown Louis the German king. In 860, Charles the Bald invaded Charles of Burgundy's kingdom but was repulsed. Lothar II ceded lands to Louis II in 862 for support of a divorce from his wife, Teutberga, which caused repeated conflicts with his uncles and the pope. Charles of Burgundy died in 863, and his kingdom was inherited by Louis II.\nLothar II died in 869 with no legitimate heirs, due to the pope's refusal to allow the divorce, and his kingdom was divided between Charles the Bald and Louis the German in 870 by the Treaty of Meerssen. Meanwhile, Louis the German was involved in disputes with his three sons. Louis II died in 875, and named Carloman, the eldest son of Louis the German, his heir. Charles the Bald, supported by the pope, was crowned both king of Italy and emperor. The following year, Louis the German died. Charles tried to annex his realm too, but was defeated decisively at Andernach, and East Francia was divided between Louis the Younger, Carloman of Bavaria and Charles the Fat.\nDecline and division (877–888)\n, an epic poem celebrating the victory of Louis III of West Francia over the Vikings]]\nAfter the death of Charles the Bald in 877, the empire was under attack in the north and west by the Vikings and faced internal struggles from Italy to the Baltic, from Hungary in the east to Aquitaine in the west. His successor, Louis the Stammerer, became king of the Western Franks, but the title of emperor lapsed. Louis the Stammerer was physically weak and died two years later, his realm being divided between his eldest two sons: Louis III gaining Neustria and Francia, and Carloman II gaining Aquitaine and Burgundy. The Kingdom of Italy was finally granted to King Carloman of Bavaria, but a stroke forced him to abdicate Italy to his brother Charles the Fat and Bavaria to Louis of Saxony. In 879, Boso of Vienne founded the Kingdom of Lower Burgundy in Provence.\nIn 881, Charles the Fat was crowned emperor while Louis of Saxony and Louis III of Francia died the following year. Saxony and Bavaria were united under Charles the Fat, and Francia and Neustria. Carloman II conquered Lower Burgundy. Carloman died in a hunting accident in 884 after a tumultuous and ineffective reign, and his lands were inherited by Charles the Fat, effectively recreating the empire of Charlemagne.\nCharles, suffering what is believed to be epilepsy, could not secure the kingdom against Viking raiders, and after buying their withdrawal from Paris in 886 was perceived by the court as being cowardly and incompetent. The following year his nephew Arnulf of Carinthia, the illegitimate son of Carloman of Bavaria, raised the standard of rebellion. Instead of fighting the insurrection, Charles fled to Neidingen and died in 888, leaving a divided entity and a disorderly succession.The empire of the Carolingians was divided: Arnulf maintained Carinthia, Bavaria, Lorraine and modern Germany; Count Odo of Paris was elected king of Western Francia (France), Ranulf II became king of Aquitaine, Italy went to Count Berengar of Friuli, Upper Burgundy to Rudolph I, and Lower Burgundy to Louis the Blind, the son of Boso of Arles, King of Lower Burgundy and maternal grandson of Emperor Louis II. The other part of Lotharingia became the duchy of Burgundy.\nDemographics\nIn his comprehensive Framing the Early Middle Ages,'' Chris Wickham suggests that there are currently no reliable calculations for the period regarding the populations of early medieval towns. What is likely, however, is that most cities of the empire did not exceed the 20–25,000 speculated for Rome during this period. On an empire-wide level, populations expanded steadily from 750 to 850. Figures ranging from 10 to 20 million have been offered, with estimates being devised based on calculations of empire size and theoretical densities. Recently, however, Timothy Newfield challenges the idea of demographic expansion, criticising scholars for relying on the impact of recurring pandemics in the preceding period of 541-750 and ignoring the frequency of famines in Carolingian Europe.\nA study using climate proxies such as the Greenland ice core 'GISP2' has indicated that there may have been relatively favourable conditions for the empire's early years, although several harsh winters appear afterwards. Whilst demographic implications are observable in contemporary sources, the extent of the impact of these findings on the empire's populations is difficult to discern.\nEthnicity\nThe empire was inhabited by major ethnic groups such as Franks, Alemanni, Bavarians, Thuringians, Frisians, Lombards, Goths, Romans, Celts, Basques and Slavs. Ethnicity was just one of many systems of identification in this period and was a way to show social status and political agency. Many regional and ethnic identities were maintained and would later become significant in a political role. Regarding laws, ethnic identity helped decide which codes applied to which populations, however these systems were not definitive representations of ethnicity as these systems were somewhat fluid.\nGender\nEvidence from Carolingian estate surveys and polyptychs appears to suggest that female life expectancy was lower than that of men in this period, with analyses recording high ratios of males to females. However, it is possible this is due to a recording bias.\nGovernment\nThe government, administration, and organization of the Carolingian Empire were forged in the court of Charlemagne in the decades around 800. In 800, Charlemagne was crowned emperor and adapted his existing royal administration to live up to the expectations of his title. The political reforms wrought in Aachen had an immense impact on the political definition of Western Europe for the rest of the Middle Ages. The Carolingian improvements on the old Merovingian mechanisms of governance have been lauded by historians for the increased central control, efficient bureaucracy, accountability, and cultural renaissance.\nThe Carolingian Empire was the largest western territory since the fall of Rome, but historians have come to suspect the depth of the emperor's influence and control. Legally, the Carolingian emperor exercised the bannum, the right to rule and command, over all of his territories. Also, he had supreme jurisdiction in judicial matters, made legislation, led the army, and protected both the Church and the poor. His administration was an attempt to organize the kingdom, church, and nobility around him; however, its efficacy was directly dependent upon the efficiency, loyalty and support of his subjects.\nMilitary\n(8th - 10th century) with lance, round shield, chainmail and spangenhelm in the Coronation Hall of the Aachen City Hall in June 2014 on the occasion of the exhibition \"Charlemagne - power, art, treasures\"]]\nAlmost every year between the accession of Charles Martel and the conclusion of the wars with the Saxons, Frankish forces went on campaign or expedition, often into enemy territory. For many years, Charlemagne would gather an assembly around Easter and launch a military effort that would typically take place through the summer as this would ensure there were enough supplies for the fighting force. Charlemagne passed regulations requiring all mustered fighting men to own and bring their own weapons; the wealthy cavalrymen had to bring their own armour, poor men had to bring spears and shields, and those driving the carts had to have bows and arrows in their possession. With regard to provisions, men were instructed not to eat food until a specific location was reached, and carts should carry three months worth of food and six months worth of weapons and clothing along with tools. Preference was shown towards mobility warfare in place of defence-in-depth infrastructure; captured fortifications were often destroyed so they could not be used to resist Carolingian authority in the future. After 800 and during the reign of Louis the Pious, efforts of expansion dwindled. Tim Reuter has shown that many military efforts during Louis' reign were largely defensive and in response to external threats.\nIt had long been held that Carolingian military success was based on the use of a cavalry force created by Charles Martel in the 730s. However, it is clear that no such \"cavalry revolution\" took place in the Carolingian period leading up to and during the reign of Charlemagne. This is because the stirrup was not known to the Franks until the late 8th century, and soldiers on horseback would therefore have used swords and lances for striking and not charging. Carolingian military success rested primarily on siege technologies and excellent logistics. However, large numbers of horses were used by the Frankish military during the age of Charlemagne. This was because a mounted cavalry provided a quick, long-distance method of transporting troops, which was critical to building and maintaining such a large empire. The importance of horses to the Carolingian military is revealed through the revised version of the Royal Frankish Annals. The annals mention that, whilst Charlemagne was on campaign in 791, \"there broke out such a pestilence among the horses [...] that barely a tenth out of so many thousands are said to have survived.\" Shortage of horses played a role in preventing Carolingian forces from continuing a campaign against the Avars in Pannonia.\nThe Frankish royal bodyguards, the continuation of the Merovingian institution of the antrustion, were consciously modelled on Late Roman precedents. These guards were organized into schola and entitled scholares, and used armour based on Late Roman and early Byzantine models. Frankish artistic depictions of these bodyguards also mirrored Late Roman traditions.\nPalaces\nin Aachen, Germany]]\nNo permanent capital city existed in the empire, the itinerant court being a typical characteristic of all Western European kingdoms at this time. Some palaces can, however, be distinguished as locations of central administration. In the first year of his reign, Charlemagne went to Aachen (; ). He began to build the Palace of Aachen in the 780s, with original plans developed perhaps as soon as 768. The palace chapel, constructed in 796, later became Aachen Cathedral. During the 790s, when construction picked up at Aachen, Charlemagne's court became more centred compared with the 770s where court so often found itself located in tents during campaigning. Though Aachen was certainly not intended to be a sedentary capital, it was built in the political heartland of Charlemagne's realm to act as a meeting place for aristocrats and churchmen so that patronage might be distributed, assemblies held, laws written, and even where scholarly churchmen gathered for the purposes of learning. Aachen was also a centre for information and gossip being pulled in from across the empire by courtiers and churchmen alike. Of course, despite being the centre of Charlemagne's government, until his later years, his court moved often and made use of other palaces at Frankfurt, Ingelheim and Nijmegen. The use of such structures would signal the beginnings of the palace system of government used by the Carolingian court throughout reigns of many Carolingian rulers. Stuart Airlie suggests that there were over 150 palaces throughout the Carolingian World which would provide the setting for court activity.\nPalaces were not merely locations of administrative government but also stood as important symbols. Under Charlemagne, their excellence was a translation of the treasure built up from conquest into a symbolic permanence as well as exclaiming royal authority. Contemporary chronicler Einhard suggests the construction of so-called 'public buildings' was a testament to Charlemagne's greatness and likeness to the emperors of antiquity and this connection was certainly capitalised upon by the imagery of palace decorations. Ingelheim is a particular example of such symbolism and thus the importance of the palace system in more than mere governance. The palace chapel is described as \"lined with images from the Bible\" and the hall of the palace \"decorated with a picture cycle celebrating the deeds of great kings,\" including rulers of antiquity as well as Carolingian rulers such as Charles Martel and Pippin III.\nLouis the Pious used the palace system much to the same effect as Charlemagne during his reign as king of Aquitaine, rotating his court between four winter palaces throughout the region. During his reign as emperor, he used Aachen, Ingelheim, Frankfurt, and Mainz, which were almost always the locations for general assemblies held \"two or three [times] a year in the period 816–28...\" and while he was not an immobile ruler, his reign has certainly been described as more static. In this way, the palace system can also been seen as a tool of continuity in governance. After the splintering of the empire, the palace system continued to be used by succeeding Carolingian rulers with Charles the Bald centring his power at Compiègne, where the palace chapel was dedicated to the Virgin Mary in 877, something remarked on as a sign of continuity with Aachen's Mother of God chapel. For Louis the German, Frankfurt has been deemed his own 'neo-Aachen' and Charles the Fat's palace at Sélestat in Alsace was designed specifically to imitate Aachen.\nThe palace system as an idea for Carolingian central administration and governance has been challenged by historian F. L. Ganshof, who argues that the palaces of the Carolingians \"contained nothing resembling the specialised services and departments available at the same period to the Byzantine emperor or the caliph of Baghdad.\" However, further reading in the works of Carolingian historians such as Matthew Innes, Rosamond McKitterick, and Stuart Airlie suggest that the use of palaces were important in the evolution of Carolingian governance, and Janet Nelson argues \"palaces are places from which power emanates and is exercised...\" and the importance of palaces to Carolingian administration, learning, and legitimacy has been widely argued.\nHousehold\nThe royal household was an itinerant body (until c. 802) that moved around the kingdom making sure good government was upheld in the localities. The most important positions were the chaplain (who was responsible for all ecclesiastical affairs in the kingdom) and the count of the palace (count palatine) (who had supreme control over the household). It also included more minor officials e.g. chamberlain, seneschal, and marshal. The household sometimes led the army (e.g. Seneschal Andorf against the Bretons in 786).\nPossibly associated with the chaplain and the royal chapel was the office of the chancellor, head of the chancery, a non-permanent writing office. The charters produced were rudimentary and mostly to do with land deeds. There are 262 surviving charters from Charles’ reign as opposed to 40 from Pepin’s and 350 from Louis the Pious.\nOfficials\nThere are three main offices that enforced Carolingian authority in the localities:\nThe Comes (). Appointed by Charles to administer a county. The Carolingian Empire (except Bavaria) was divided into between 110 and 600 counties, each divided into centenae, which were under the control of a vicar. At first, they were royal agents sent out by Charles but after c. 802 they were important local magnates. They were responsible for justice, enforcing capitularies, levying soldiers, receiving tolls and dues, and maintaining roads and bridges. They could technically be dismissed by the king, but many offices became hereditary. They were sometimes corrupt, although many were exemplary e.g. Count Eric of Friuli. Provincial governors eventually evolved who supervised several counts.\nThe Missi Dominici (). Originally appointed ad hoc, a reform in 802 led to the office becoming a permanent one. The Missi Dominici were sent out in pairs. One was an ecclesiastic and one secular. Their status as high officials was thought to safeguard them from the temptation of taking bribes. They made four journeys a year in their local missaticum, each lasting a month, and were responsible for making the royal will and capitularies known, judging cases and occasionally raising armies.\nThe Vassi Dominici. These were the king’s vassals and were usually the sons of powerful men, holding ‘benefices’ and forming a contingent in the royal army. They also went on ad hoc missions.\nLegal system\nAround 780, Charlemagne reformed the local system of administering justice and created the scabini, professional experts on the law. Every count had the help of seven scabini, who were supposed to know every national law so that all men could be judged according to it. Judges were banned from taking bribes and were supposed to use sworn inquests to establish facts. In 802, all law was written down and amended (the Salic law was also amended in both 798 and 802, although even Einhard admits in section 29 that this was imperfect). Judges were supposed to have a copy of both the Salic law code and the Ripuarian law code. Most people in the Carolingian Empire lived under a legal code that directly copied from Roman law.\nCoinage\nminted by Prince Adelchis of Benevento in the name of Emperor Louis II and Empress Engelberga, showing the expansion of Carolingian authority in southern Italy which Louis achieved]]\nCoinage had a strong association with the Roman Empire, and Charlemagne took up its regulation with his other imperial duties. The Carolingians exercised controls over the silver coinage of the realm, controlling its composition and value. The name of the emperor, not of the minter, appeared on the coins. Charlemagne worked to suppress mints in northern Germany.\nSubdivision\nThe Frankish kingdom was subdivided by Charlemagne into three separate areas to make administration easier. These were the inner \"core\" of the kingdom (Austrasia, Neustria, and Burgundy), which were supervised directly by the missatica system and the itinerant household. Outside this was the regna, where Frankish administration rested upon the counts, and outside this was the marcher areas where ruled powerful governors. These marcher lordships were present in Brittany, Spain, and Bavaria.\nCharles also created two sub-kingdoms in Aquitaine and Italy, ruled by his sons Louis and Pepin respectively. Bavaria was under the command of an autonomous governor, Gerold, until his death in 796. While Charles still had overall authority in these areas, they were fairly autonomous with their own chancery and minting facilities.\nPlacitum generalis\nThe annual meeting, the placitum generalis'' or Marchfield, was held every year (between March and May) at a place appointed by the king. It was called for three reasons: to gather the Frankish host to go on a campaign, to discuss political and ecclesiastical matters affecting the kingdom and to legislate for them, and to make judgments. All important men had to go to the meeting, and so it was an important way for Charles to make his will known. Originally the meeting worked effectively; later it merely became a forum for discussion and for nobles to express their dissatisfaction.\nOaths\nThe oath of fidelity was a way for Charles to ensure loyalty from all his subjects. As early as 779, he banned sworn guilds between other men so that everyone took an oath of loyalty only to him. In 789 (in response to Pepin the Hunchback's rebellion), he began legislating that everyone should swear fidelity to him as king; however, in 802, he expanded the oath greatly and made it so that all men over age 12 swore it to him.\nCapitularies\nCapitularies were the written records of decisions made by the Carolingian kings in consultation with assemblies during the 8th and 9th century. The name comes from the Latin '''capitula' for 'chapters''' and refers to the way these records were taken and written up, in a chapter by chapter style. Sören Kaschke regards them as \"amongst the most important sources for the governance of the Frankish Empire in the eight and ninth century.\" The use of capitularies represented a change in the pattern of contact between the king and his provinces in the Carolingian period. The contents could include a wide range of topics, including royal orders, instructions for specific officials, deliberations of assemblies on both secular and ecclesiastical affairs as well as additions and alterations to the law.\nPrimary evidence shows that capitularies were copied and disseminated all throughout Charlemagne's empire; however, there is insufficient evidence to suggest the efficacy of the capitularies and whether they were actually put into practice throughout the realm. As Charlemagne became increasingly stationary, the amount of capitularies produced increased, and was particularly noticeable after the General Admonition of 789.\nThere has been debates over the purpose of capitularies. Some historians argue that the capitularies were nothing more than a 'royal wish-list' while others argue for capitularies representing the basis of a centralised state. Capitularies were implemented through the use of the missi domini.\nSome notable capitularies from Charlemagne's reign are:\n* The Capitulary of Herstal of 779 deals with both ecclesiastical and secular topics, placing importance on the importance of paying tithes, the role of the bishop, and outlining the intolerance of forming an armed following in Charlemagne's empire.\n* Admonitio Generalis of 789 is one of the most influential capitularies of Charlemagne's time, consisting of over 80 chapters, including many laws on religion.\n* The Capitulary of Frankfurt of 794 speaks out against adoptionism and iconoclasm.\n* The Programmatic Capitulary of 802 shows an increasing sense of vision in society.\n* The Capitulary for the Jews of 814, delineates the prohibitions of Jews engaging in commerce or money-lending.\nReligion and the Church\nCharlemagne aimed to convert all those in the Frankish kingdom to Christianity and to expand both his empire and the reach of Christianity. The 789 Admonitio Generalis pronounced Charlemagne responsible for the salvation of his subjects and set out standards of education for the clergy, who previously had been mostly illiterate. Intellectuals of the time began to be concerned with eschatology, believing 800 to be 6000 AM based on calculations from Eusebius and Jerome. Intellectuals such as Alcuin reckoned that the Charlemagne's coronation as emperor on Christmas Day 800 marked the beginning of the seventh and final age of the world. These concerns may explain why Charlemagne aimed to have everyone engage in acts of penance.\nEmperors\nFor other Carolingian kings, see List of Frankish kings. For the later emperors, see Holy Roman Emperor.\n{| class=\"wikitable\" style=\"text-align:center\"\n! Name\n! Date of imperial coronation\n! Date of death\n! Contemporary coin or seal\n|-\n| Charlemagne\n| 25 December 800\n| 28 January 814\n|\n|-\n| Louis the Pious\n| 1st: 11 September 813 2nd: 5 October 816\n| 20 June 840\n|\n|-\n| Lothair I\n| 5 April 823\n| 29 September 855\n|\n|-\n| Louis II\n| 1st: Easter 8502nd: 18 May 872\n| 12 August 875\n|\n|-\n| Charles the Bald\n| 29 December 875\n| 6 October 877\n|\n|-\n| Charles the Fat\n| 12 February 881\n| 13 January 888\n|\n|}\nLegacy\nDespite the relatively short existence of the Carolingian Empire when compared to other European dynastic empires, its legacy far outlasts the state that had forged it. In historiographical terms, the Carolingian Empire is seen as the beginning of 'feudalism'; or rather, the notion of feudalism held in the modern era. Though most historians would be naturally hesitant to assign Charles Martel and his descendants as founders of feudalism, it is obvious that a Carolingian 'template' lends to the structure of central medieval political culture. Yet some argue against this assumption; Marc Bloch disdains this hunt for feudalism's birth as \"the idol of origins.\" A concerted effort can be noted by Carolingian authors, such as Einhard, to establish a shift in continuity from the Merovingian to the Carolingian, likely where no such groundbreaking difference between the two ever existed.\nThe unifying power of Charlemagne has been wielded by a succession of European rulers to bolster their own regimes; much in the same vein as Charlemagne echoed elements of Augustus in his rising years. The Ottonian dynasty, which succeeded the title of Holy Roman Emperor, magnified distant ties to the Carolingians to legitimise their dynastic ambitions as 'successors'. Four of the five Ottonian emperors crowned themselves in Charlemagne's palace in Aachen, likely to establish a continuity from the Carolingians. Even with their dynasty originating from Charlemagne's arch-foe Saxony, Ottonians still linked their dynasty to the Carolingians through direct and indirect means. Iconography of Charlemagne was utilised in later medieval periods, where he is depicted as a model knight and paragon of chivalry.\nSee also\n* Carolingian Renaissance\n** Carolingian architecture\n** Carolingian art\n* List of Carolingian monasteries\nNotes\nCitations\nWorks cited\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\nFurther reading\n*\n*\n*\nExternal links\n* [http://www.charlemagneseurope.ac.uk The Making of Charlemagne's Europe (768–814)] (freely available database of prosopographical and socio-economic data from Carolingian legal documents, produced and maintained by King's College London)\n}}"
    }
  ]
}