{
  "content": [
    {
      "type": "text",
      "text": "# Caroline Kingsbury\n\nCaroline Kingsbury is an American pop musician from Los Angeles, California.\nEarly life and background\nKingsbury grew up in a conservative Christian household in Florida, where she first performed music as part of her church worship band. She has said that her early exposure to music was shaped by restrictions in her household; while artists such as the Beatles and Bob Dylan were permitted, contemporary popular music was discouraged.\nKingsbury is openly queer.\nCareer\nKingsbury released her debut album in 2021 titled ''Heaven's Just a Flight'' via Fortune Tellers Records. Prior to the release, Kingsbury had released the single \"Fall in Love\"., \"Hero\" and \"Lose\". The album was ranked number 26 on Yardbarker's list of \"The 50 Best Albums of 2021\". In late 2024, Kingsbury released her first EP titled ''I Really Don't Care!\"'' The EP was named one of \"The 25 Best EPs of 2024\" according to Atwood Magazine.\nIn April 2025, Kingsbury announced her second EP, Shock Treatment, scheduled for release in September 2025. The project includes the singles \"Chocolate\" and the title track, and explores themes of queer identity, relationships, and family estrangement. She debuted “Chocolate” live at the BMI Stage during Lollapalooza in Chicago in August 2025.\nKingsbury performed at Lollapalooza in 2025, her largest festival appearance to date. Kingsbury performed three sets during the 2025 Lollapalooza weekend, including her BMI Stage appearance, an acoustic performance at the Toyota Music Den, and an official aftershow at Schubas supporting Del Water Gap.\nFollowing the release of Shock Treatment, she announced a co-headlining North American tour with pop artist MARIS, including a performance at the All Things Go music festival in Maryland. Kingsbury explained that the format would feature both solo performances and joint collaborations in a continuous two-hour set, intended as a more communal concert experience.\nDiscography\nStudio albums\n*Heaven's Just a Flight (2021, Fortune Tellers)\nEPs\n*I Don't Care! (2024, Music Is Fun)\nReferences"
    }
  ]
}