{
  "content": [
    {
      "type": "text",
      "text": "# Carolingian Renaissance__disambig_2\n\n, one of the products of the Carolingian Renaissance.]]\nThe Carolingian Renaissance was the first of three medieval renaissances, a period of cultural activity in the Carolingian Empire. Charlemagne's reign led to an intellectual revival beginning in the 8th century and continuing throughout the 9th century, taking inspiration from ancient Roman and Greek culture and the Christian Roman Empire of the 4th century. During this period, there's an increase of literature, writing, visual arts, architecture, music, jurisprudence, liturgical reforms, and scriptural studies. Carolingian schools were effective centers of education, and they served generations of scholars by producing editions and copies of the classics, both Christian and pagan.\nThe movement occurred mostly during the reigns of Carolingian rulers Charlemagne and Louis the Pious. It was supported by the scholars of the court, notably Alcuin of York. Charlemagne's Admonitio generalis (789) and Epistola de litteris colendis served as manifestos. Alcuin wrote on subjects ranging from grammar and biblical exegesis to arithmetic and astronomy. He also collected rare books, which formed the nucleus of the library at York Cathedral. His enthusiasm for learning made him an effective teacher. Alcuin writes:\nAnother prominent figure was Theodulf of Orléans, a refugee from the Umayyad invasion of Spain who became involved in the cultural circle at the imperial court before Charlemagne appointed him bishop of Orléans. Theodulf’s greatest contribution to learning was his scholarly edition of the Vulgate Bible, drawing on manuscripts from Spain, Italy, and Gaul, and even the original Hebrew.\nThe effects of this cultural revival were mostly limited to a small group of court literati. According to John Contreni, \"it had a spectacular effect on education and culture in Francia, a debatable effect on artistic endeavors, and an unmeasurable effect on what mattered most to the Carolingians, the moral regeneration of society\". The secular and ecclesiastical leaders made efforts to write better Latin, to copy and preserve patristic and classical texts in the Carolingian libraries, and to develop a more legible, classicizing script, with clearly distinct capital and minuscule letters. It was the Carolingian minuscule that Renaissance humanists took to be Roman and employed as humanist minuscule, from which has developed early modern Italic script. They also applied rational ideas to social issues for the first time in centuries, providing a common language and writing style that enabled communication throughout most of Europe.\nBackground\n:Blue = realm of Pepin the Short in 758;Orange = expansion under Charlemagne until 814;Yellow = Marches and dependencies;Red = Papal States.]]\nAs Pierre Riché points out, the expression \"Carolingian Renaissance\" does not imply that Western Europe was barbaric or obscurantist before the Carolingian era. The centuries following the dissolution of the Roman Empire in the West did not see an abrupt disappearance of the ancient schools.  Indeed, from them emerged Martianus Capella, Cassiodorus, and Boethius, essential icons of the Roman cultural heritage in the Early Middle Ages, thanks to which the disciplines of liberal arts were preserved. The 7th century saw the \"Isidorian Renaissance\" in the Visigothic Kingdom of Hispania in which sciences flourished and the integration of Christian and pre-Christian thought occurred, while the spread of Irish monastic schools (scriptoria'') over Europe laid the groundwork for the Carolingian Renaissance.\nThere were numerous factors in this cultural expansion, the most obvious of which was that Charlemagne's uniting of most of Western Europe brought about peace and stability, which set the stage for prosperity. This period marked an economic revival in Western Europe, following the fall of the Western Roman Empire in the 5th century. Local economies in the West had degenerated into largely subsistence agriculture by the early 7th century, with towns functioning merely as places of gift-exchange for the elite. By the late 7th century, developed urban settlements had emerged, populated mostly by craftsmen and merchants and developing street grids, artisanal production, and regional and long-distance trade. A prime example of this type of emporium was Dorestad.\ngatehouse, , an example of the Carolingian architectural style—a first, albeit isolated classical movement in architecture.]]\nThe development of the Carolingian economy was fueled by the efficient organization and exploitation of labor on large estates, producing a surplus of primarily grain, wine and salt. In turn, inter-regional trade in these commodities facilitated the expansion of towns. Archaeological data shows the continuation of this upward trend in the early 8th century. The zenith of the early Carolingian economy was reached from 775 to 830, coinciding with the largest surpluses of the period, large-scale building of churches as well as overpopulation and three famines that showed the limits of the system. After a period of disruption from 830 to 850, caused by civil wars and Viking raids, economic development resumed in the 850s, with the emporiums disappearing completely and being replaced by fortified commercial towns.\nOne of the major causes of the sudden economic growth was the Arab slave trade. Following the rise of the Arab Muslim caliphates, the Arab elites created a major demand for slaves in the Muslim world, with European slaves particularly prized. As a result of Charlemagne's wars of conquest in Eastern Europe, a steady supply of captured Slavs, Avars, Saxons, and Danes reached merchants in Western Europe, who then exported the slaves via Ampurias, Girona, and the Pyrenees passes to Muslim Spain and other parts of the Arab world. The market for slaves was so lucrative that it almost immediately transformed the long-distance trade of the European economies. The slave trade enabled the West to re-engage with the Arab Muslim caliphates and the Eastern Roman Empire, so that other industries, such as textiles, were able to grow in Europe as well.\nImport\nKenneth Clark was of the view that by means of the Carolingian Renaissance, Western civilization survived by the skin of its teeth. A substantial portion of the classical corpus we possess today owes its survival to the copies produced by Carolingian scribes. As Conrad Layser notes, \"fewer than 2,000 Latin manuscripts survive from the period before AD 800; from the century after AD 800, we have over 7,000. For every eighth-century copy of a text that has survived, we have ten copies from the ninth century.\"\nHowever, the use of the term renaissance to describe this period is contested because its aims and output differ markedly from those of the 15th- and 16th-century Renaissance. The Carolingian project was a top-dawn initiative, driven by royal patronage and executed by literate elites who trained and served in ecclesiastical institutions, in contrast to the wide-ranging social movements of the later Italian Renaissance.\nEarlier scholarship sometimes portrayed the Carolingian period as an attempt to recreate the previous culture of the Roman Empire, motivated by humanist and antiquarian interests. More recent historiography, however, tends to view the Carolingian Renaissance primarily as a religious reform project. Rather than a pure revival, Carolingian scholars described their engagement with classical learning as correctio. This notion of correctio, combined with pragmatic concerns, aimed to \"correct\" and transform older knowledge into something useful and suitable for a newly standardized Christian society—society whose salvation Charlemagne, as its ruler, felt personally responsible for.\nScholarly efforts\nA lack of Latin literacy in eighth-century western Europe caused problems for the Carolingian rulers by severely limiting the number of people capable of serving as court scribes in societies where Latin was valued. Of even greater concern to some rulers was the fact that not all parish priests possessed the skill to read the Vulgate Bible. An additional problem was that the vulgar Latin of the later Western Roman Empire had begun to diverge into the regional dialects, the precursors to today's Romance languages, that were becoming mutually unintelligible and preventing scholars from one part of Europe being able to communicate with persons from another part of Europe.\n(pictured centre), was one of the leading scholars of the Carolingian Renaissance.]]\nTo address these problems, Charlemagne ordered the creation of schools in a capitulary known as the Charter of Modern Thought, issued in 787.  A major part of his program of reform was to attract many of the leading scholars of the Christendom of his day to his court. Among the first called to court were Italians: Peter of Pisa, who from 776 to about 790 instructed Charlemagne in Latin, and from 776 to 787 Paulinus of Aquileia, whom Charlemagne nominated as patriarch of Aquileia in 787. The Lombard Paul the Deacon was brought to court in 782 and remained until 787, when Charles nominated him abbot of Montecassino. Theodulf of Orléans was a Spanish Goth who served at court from 782 to 797 when nominated as bishop of Orléans. Theodulf had been in friendly competition over the standardization of the Vulgate with the chief among the Charlemagne's scholars, Alcuin of York.  Alcuin was a Northumbrian monk and deacon who served as head of the Palace School from 782 to 796, except for the years 790 to 793 when he returned to England. After 796, he continued his scholarly work as abbot of St. Martin's Monastery in Tours. Among those to follow Alcuin across the Channel to the Frankish court was Joseph Scottus, an Irishman who left some original biblical commentary and acrostic experiments. After this first generation of non-Frankish scholars, their Frankish pupils, such as Angilbert, would make their own mark.\nThe later courts of Louis the Pious and Charles the Bald had similar groups of scholars many of whom were of Irish origin. The Irish monk Dicuil attended the former court, and the more famous Irishman John Scotus Eriugena attended the latter becoming head of the Palace School at Aachen.\nOne of the primary efforts was the creation of a standardized curriculum for use at the recently created schools. Alcuin led this effort and was responsible for the writing of textbooks, creation of word lists, and establishing the trivium and quadrivium as the basis for education.\nAnother contribution from this period was the development of Carolingian minuscule, a \"book-hand\" first used at the monasteries of Corbie and Tours that introduced the use of lower-case letters. A standardized version of Latin was also developed that allowed for the coining of new words while retaining the grammatical rules of Classical Latin. This Medieval Latin became a common language of scholarship and allowed administrators and travellers to make themselves understood in various regions of Europe.\nThe earliest concept of Europe as a distinct cultural region (instead of simply a geographic area) appeared during the Carolingian Renaissance of the 9th century, and included the territories which practiced Western Christianity at the time.\nCarolingian workshops produced over 100,000 manuscripts in the 9th century, of which some 6000 to 7000 survive. The Carolingians produced the earliest surviving copies of the works of Cicero, Horace, Martial, Statius, Lucretius, Terence, Julius Caesar, Boethius and Martianus Capella. No copies of the texts of these authors were made in the Latin West in the 7th and 8th centuries.\nReform of Latin pronunciation\nAccording to Roger Wright, the Carolingian Renaissance is responsible for the modern-day pronunciation of Ecclesiastical Latin. Up until that point there had been no conceptual distinction between Latin and Romance; the former was simply regarded as the written form of the latter. For instance in early medieval Spain the word for 'century'—which would have been pronounced */sjeglo/— was properly spelled ⟨saeculum⟩, as it had been for the better part of a millennium. The scribe would not have read aloud ⟨saeculum⟩ as /sɛkulum/ any more than an English speaker today would pronounce ⟨knight⟩ as */knɪxt/ rather than /naɪt/.\nNon-native speakers of Latin, however—such as clergy of Anglo-Saxon or Irish origin—appear to have used a rather different pronunciation, presumably attempting to sound out each word according to its spelling. The Carolingian Renaissance in France introduced this artificial pronunciation for the first time to native speakers as well. No longer would, for instance, the word ⟨viridiarium⟩ 'orchard' be read aloud as the equivalent Old French word */verdʒjǽr/. It now had to be pronounced precisely as spelled, with all six syllables: /viridiarium/.\nSuch a radical change had the effect of rendering Latin sermons completely unintelligible to the general Romance-speaking public, which prompted officials a few years later, at the Council of Tours, to instruct priests to read sermons aloud in the old way, in rusticam romanam linguam or 'plain roman[ce] speech' (while the liturgy retained the new pronunciation to this day).\nAs there was now no unambiguous way to indicate whether a given text was to be read aloud as Latin or Romance, and native Germanic speakers (such as church singers) numerous in the empire might have struggled to read words in Latin orthography according to Romance orthoepy, various attempts were made in France to devise a new orthography for the latter; among the earliest examples are parts of the Oaths of Strasbourg and the Sequence of Saint Eulalia. As the Carolingian Reforms spread the 'proper' Latin pronunciation from France to other Romance-speaking areas, local scholars eventually felt the need to create distinct spelling systems for their own vernaculars as well, thereby initiating the literary phase of Medieval Romance. Writing in Romance does not appear to have become widespread until the Renaissance of the Twelfth Century, however.\nCarolingian art\nCarolingian art spans the roughly hundred-year period from about 800–900. Although brief, it was an influential period. Northern Europe embraced classical Mediterranean Roman art forms for the first time, setting the stage for the rise of Romanesque art and eventually Gothic art in the West. Illuminated manuscripts, metalwork, small-scale sculpture, mosaics, and frescos survive from the period.\nCarolingian architecture\n}}\nCarolingian architecture is the style of North European architecture promoted by Charlemagne. The period of architecture spans the late eighth and ninth centuries until the reign of Otto I in 936, and was a conscious attempt to create a Roman Renaissance, emulating Roman, Early Christian and Byzantine architecture, with its own innovation, resulting in having a unique character. This syncretic architectural style can be exemplified by the first church of St Mark's in Venice, fusing proto-Romanesque and Byzantine influences.\nThere was a profusion of new clerical and secular buildings constructed during this period, John Contreni calculated that \"The little more than eight decades between 768 to 855 alone saw the construction of 27 new cathedrals, 417 monasteries, and 100 royal residences\".\nCarolingian currency\nAround AD&nbsp;755, Charlemagne's father Pepin the Short reformed the currency of the Frankish Kingdom. A variety of local systems was standardized. Minor mints were closed and royal control over the remaining bigger mints strengthened, increasing purity. In place of the gold Roman and Byzantine solidus then common, he established a system based on a new .940-fine silver penny (; ) weighing 1/240 of a pound (', ', or '; '). (The Carolingian pound seems to have been about 489.5&nbsp;grams, making each penny about 2&nbsp;grams.) As the debased solidus was then roughly equivalent to 11 of these pennies, the shilling ('; ') was established at that value, making it 1/22 of the silver pound. This was later adjusted to 12 and 1/20, respectively. During the Carolingian period, however, neither shillings or pounds were minted, being instead used as notional units of account. (For instance, a \"shilling\" or \"solidus\" of grain was a measure equivalent to the amount of grain that 12 pennies could purchase.) Despite the purity and quality of the new pennies, however, they were repeatedly rejected by traders throughout the Carolingian period in favor of the gold coins used elsewhere, a situation that led to repeated legislation against such refusal to accept the king's currency.\nThe Carolingian system was imported to England by Offa of Mercia and other kings, where it formed the basis of English currency until the late 20th century.\nGallery\nFile:Karolingischer Buchmaler um 820 001.jpg|Aachen Gospels (), an example of Carolingian illumination.\nFile:St gall plan.jpg|A copy of the Plan of Saint Gall\nSee also\n* Iconography of Charlemagne\n* Golden Age of medieval Bulgarian culture\n* Carolingian church\n* Romance languages\nNotes\nReferences\nCitations\nBibliography\n* .\n*\n*\n*  |year=1983 |title=The Western Experience to 1715 |edition=3rd |publisher=Alfred A. Knopf |location=New York |isbn=978-0-394-33085-3 |url-access=registration |url=https://archive.org/details/westernexperienc03edunse }}.\n* .\n* .\n* .\n* .\n* .\n* .\n* .\n* Panofsky, Erwin. Renaissance and Renascences in Western Art. New York/Evanston: Harpers Torchbooks, 1969.\n* .\n* .\n* .\n* .\n*\n*\nExternal links\n* [https://www.bbc.co.uk/programmes/p003hydz The Carolingian Renaissance], BBC Radio 4 discussion with Matthew Innes, Julia Smith & Mary Garrison (In Our Time, Mar, 30, 2006)"
    }
  ]
}