{
  "content": [
    {
      "type": "text",
      "text": "# Carswell Medieval House\n\n| map_dot_label = Carswell Medieval House\n| architect =\n| client =\n| construction_start_date =\n| renovation_date =\n| completion_date = –1500\n| date_demolished =\n| structural_system =\n| style = Norman era tenant farm\n| size =\n| map_type =\n}}\nCarswell Medieval House is a Grade II*-listed historic stone ruin of a medieval tenant farm in the village of Penally, near St Florence in Tenby. Visit Wales describe it as \"one of the only buildings of its type still standing in this part of Wales\" and an example of \"everyday medieval life away from the grand castles often associated with the period.\"\nHistory\nThe present site formed what was a complex of farm buildings in the estate of the earls of Pembroke. Together with the land, the rent was one tenth of a knight's fee. In 1397 it was rented by a William Wyte.\nRecords of the building trace back to the fourteenth and sixteenth century by which the building had been divided into two. The building has a strange layout, having a separate entrance to each floor, and no internal access. A later addition, a staircase, was added but is no longer visible.\nThe building is a two-storey gabled structure and has a vaulted undercroft.  The building has evidence of a hearth, stone bench, stones indicating hobs, and an \"exceedingly large and complete chimney.\"\nSince the 17th century the property was managed by the Trustees of the Tenby Charities and the Church of St. Mary's in Tenby, and later by other Tenby charitable foundations, from around the seventeenth century.\nThe roof became roofless in the 19th century.\nThe site came into state care in 1982 and is presently maintained by Cadw. It is according to historians an \"excellent example of a medieval yeoman's house.\"\nAccess\nThe property lies beside Carswell Farm, one mile to the east of the village of St Florence. It has the postcode SA70 8NE, but CADW list the property through its coordinates due to the number of unmarked local roads.\nVisitors are advised to locate the site using an Ordnance Survey map and number SN098010 instead. There is no visitor parking area or facilities, and while the site is accessible at all hours, it is advised that visitors come during \"reasonable hours.\"\nSee also\n*West Tarr Mediaeval House\n*Whitewell Ruins\nBibliography\n* Turner, Rick. 2000. Lamphey Bishop's Palace, Llawaden Castle, Carswell Medieval House and Carew Cross: Cadw Guide (Revised Edition)\nReferences\nExternal links\n*\n* [https://ancientmonuments.uk/128677-carswell-old-house-penally Ancient Monuments UK – Carswell Old House]\n* [https://cadw.gov.wales/visit/places-to-visit?lang=en Cadw - Carswell Old House]\n* [https://coflein.gov.uk/en/site/21716/details/carswell-house-st-florence Coflein - CARSWELL HOUSE, ST FLORENCE]"
    }
  ]
}