{
  "content": [
    {
      "type": "text",
      "text": "# Carver County Historical Society\n\n| location        = 555 West 1st Street, Waconia, Minnesota 55387, United States\n| coordinates     =\n| type            = Local history\n| executive_director =\n| director        = Wendy Peterson Biorn\n| curator         = Jeremy Murray\n| website         = https://www.carvercountyhistoricalsociety.org/\n}}\nThe Carver County Historical Society, also called the Carver County Historical Society and Veterans Center, is a historical society and museum located in Waconia, Minnesota. The CCHS is one of the leading historical organizations within Carver County, Minnesota alongside several smaller city-level historical organizations including both the Chanhassen Historical Society and the Chaska Historical Society. As a nonprofit organization, the CCHS works heavily in historic preservation for local historical buildings of interest including several buildings on the National Register of Historic Places such as the Andrew Peterson Farmstead and the Wendelin Grimm Farmstead among others.\nHistory\nPost 160 named after Major John C. Becht of the 5th Minnesota Infantry Regiment housed at the CCHS's Veterans Gallery]]\nThe Carver County Historical Society was originally founded in Mayer, Minnesota by Otto Dietrich Sell (1875-1960), a resident of Laketown Township. Sell was the son of German American immigrants and a businessman in the textile industry. In April, 1940 Sell called for an organizational meeting and chartered the first historical society in Carver County with a total of 32 members. The mission statement of the society was to collect and preserve the history of Carver County and Minnesota, later the addition of Minnesota was dropped. The charter was ratified by the Carver County Board of Commissioners on December 12, 1940.\nThe CCHS began with one object housed on the second floor of the public school in Mayer. With the collection growing and desiring a central location, the CCHS moved its collection to the Waconia High School in July of 1944. By 1947, the collection again had to be moved due to lack of space. This time it moved into two large rooms on the second floor of the Waconia City Hall.\nAs the CCHS grew, so did the desire for a permanent home. A grass roots effort began to build the Society a home which would also house the Waconia Veterans Administration. On July 14, 1959, the Carver County Commissioners approved the erection of the “Carver County Memorial Building”. O.D. Sell did not live to see the building open, as he died on March 2, 1960. His son, Elmer Sell oversaw the move and construction of the new facility where the museum still stands today.\nMuseum\nThe museum inside the CCHS houses five major exhibits including; Akta Dakota (Dakota: To Honor the People), \"Choosing Carver County\", the Veterans Gallery, the Westermann Shop, \"Snapshots of Carver County History\", and \"Minnesota Made\". The museum, archive, and research library collect and curate a variety of artifacts including 3D artifacts, photographs, and archival materials while also serving as the official archive for Carver County and as a certified repository for archaeological materials.\nin the summer]]\nBesides preserving local city and county-level history the CCHS also owns and operates the rehabilitated historic Andrew Peterson Farmstead, a National Register of Historic Places property homesteaded by Swedish immigrant Andrew Peterson and his family. The CCHS contribution to the Minnesota Digital Library consists of video and film footage of oral histories, centennial celebrations, and healthcare facilities.\nSee also\n* Jonathan Carver\n* Andrew Peterson Farmstead\n* Andrew Peterson\n* Waconia, Minnesota\n* Carver County, Minnesota\nReferences"
    }
  ]
}