{
  "content": [
    {
      "type": "text",
      "text": "# Carwalking\n\nCarwalking is the act of stepping onto and walking across a stationary car. Depending on the technique and equipment used, carwalking can lead to damage of private property. It often is a response to cars being parked illegally in areas exclusively allocated to pedestrians and a protest against the negative impacts of high motorization rates in urban areas.\nReported cases\nGermany\nThe most famous carwalker was Michael Hartmann who performed the act in Munich, Germany, in the 1980s. The peak of automobile friendly policies was around the seventies and the eighties in the western world, and such high number of motor vehicles in urban areas had as consequence a large number of cars illegally parked on side-walks and other pedestrian-reserved areas. Hartmann, in his book which describes his actions, states that once in 1988 he was walking with his girlfriend and due to many cars parked on the sidewalk, they had to continuously zigzag between the cars so he decided to walk straightforward above the cars.\nHartmann went on to lead a group who would climb over parked cars and leave signs that stated \"I walked over your car because I didn't want to slide under it!\"\nFrance\nAnother reported case happened in Lyon, France, in 2011 when Peter Wagner, a German engineer, decided to walk on top of a car that was illegally parked on the side-walk in such a manner that he could not squeeze past. At that moment the owner of the car arrived and later sued him for property damage, demanding 800 Euros for repairs. The carwalker was condemned to pay 300 Euros, but later appealed. His appeal was denied.\nMexico\nIn Mexico City, a pedestrian activist called Peatónito, a mix of the Spanish words for pedestrian () and astonished (), is famous for walking over cars. Inspired by lucha libre, he wears a Mexican wrestler mask, a cape and proclaims himself to be a superhero for pedestrians. The person behind the character is Jorge Cáñez, a political scientist who, as of 2015, worked for the city government.\nSee also\n* Parking violation\n* Sidewalk rage\n* Walkability\n* Cyclability\n* Tread plate - to prevent damage when accessing roof rack via carwalking on bonnet\nFurther reading\n* Michael Hartmann: Der AutoGeher : AutoBiographie eines AutoGegners. Unrast, Münster 1998,\nReferences\nExternal links\n*\n*"
    }
  ]
}