{
  "content": [
    {
      "type": "text",
      "text": "# Cass Township, Muskingum County, Ohio\n\n|population_total         = 1811\n|population_density_km2   = auto\n|population_density_sq_mi = auto\n|timezone                 = Eastern (EST)\n|utc_offset               = -5\n|timezone_DST             = EDT\n|utc_offset_DST           = -4\n|elevation_footnotes      =\n|elevation_m              = 225\n|elevation_ft             = 738\n|coordinates              =\n|postal_code_type         =\n|postal_code              =\n|area_code                =\n|blank_name               = FIPS code\n|blank_info               = 39-12406\n|blank1_name              = GNIS feature ID\n|blank1_info              = 1086716\n|website                  =\n|footnotes                =\n}}\nCass Township is one of the twenty-five townships of Muskingum County, Ohio, United States.  The 2020 census found 1,811 people in the township.\nGeography\nLocated on the northern edge of the county, it borders the following townships:\n*Washington Township, Coshocton County - north, west of Virginia Township\n*Virginia Township, Coshocton County - north, east of Washington Township\n*Franklin Township, Coshocton County - northeast corner\n*Adams Township - far east\n*Madison Township - east\n*Jefferson Township - southeast\n*Muskingum Township - south\n*Licking Township - southwest\n*Jackson Township - west\n*Pike Township, Coshocton County - northwest corner\nA small part of the village of Dresden is located in central Cass Township.  Furthermore, two unincorporated communities lie in the township: Adams Mills in the northeast, and Trinway in the north.\nName and history\nStatewide, other Cass Townships are located in Hancock and Richland counties.  The township is named for Major Jonathan Cass, who lived between Trinway and Adams Mills.\nA People Divided\nAt a special election, held 1 Apr 1852, it was voted by the tax-payers of Jefferson Township, to issue to the Steubenville & Indiana Railway Company, township bonds to the amount of $100,000, to aid in the construction of this road. These bonds were to bear seven percent interest payable semi-annually, on the first day of January and July, and to mature 1 Jan 1862. This first issue of bonds was soon taken up and burned by the Township Trustees, because the County Auditor refused to register and officially sign them. On 22 Jul 1852 the Trustees re-issued these bonds, as set forth in the extract of the official record, given below: \"After due consideration, the Trustees took up, and destroyed by fire, the said $100,000 of bonds, and executed and delivered to said railway company, in lieu thereof, one hundred bonds of one thousand dollars ($1000) each, and numbered one to one thousand, consecutively, and dated them the same as the former issue, to-wit: April 1st 1852.\"Out of the issue of these bonds grew the trouble which, in October, 1853, resulted in the division of the township.\nAt the special election, held to vote on the issue, or non-issue of these bonds, three hundred and forty were cast in favor of having them issued, and only one hundred and fourteen against the measure. The voters of the village of Dresden voted almost to a man in favor of the scheme, while most of the voters against it were farmers throughout the township. The original idea, which predominated among the farmers, was that they would have the township divided, and thus escape paying any portion of the bonds. Although the succeeded in their efforts to be cut off from Dresden, the law decided that that act did not release them from paying their portion of the bonds as they became due.\nBefore these bonds were finally all paid, they cost the taxpayers of the two townships—Cass, the new one formed, and Jefferson—about $200,000.\nA New Township is Created\nOn Tuesday, 6 Sep 1853, the Commissioners resumed the consideration of the matter relating to the erection of a new township out of the territory comprising Jefferson township, and ordered that a new township shall be erected out of said territory, to be known by the name of Cass township, and to contain territory agreeably to the petition in relation to the same; which petition included the whole of Jefferson township, excepting the district included in the following boundaries, viz...\"Commencing on the Muskingum River, below Dresden, at a point where the southeast corner of Charles Dickenson's land, and the northeast corner of Thompson Ferrell's land unite, being on the east boundary of Jefferson township, running thence west on the line between said Dickenson and Ferrell's land, to the southeast corner of George W. Lane's land, being lot number seventeen; thence north to the center of Wakatomika Creek; thence down said creek, in the center thereof, to the eastern boundary of Jefferson Township; thence along said eastern boundary, down the Muskingum River to the place of beginning.\" \"The commissioners caused notices to be written and sent to them by Jas. Morgan, with directions to put them up in three of the most public places within the new township of Cass; which notices appointed the 19th day of the present month for the electors to meet at the school house, in sub-district number five, in part of Jefferson township, this day formed by the Commissioners of Muskingum County in the aforesaid new township of Cass, for the purpose of electing persons having the qualifications of electors, to fill the several offices of said newly formed township.\" Commission's Journal, 1853, the 28th and 29th pages, although the pages are not numbered.\n{| class=\"wikitable\" border=\"1\"\n|+ 1854 Cass Township Officers\n! Position  !! Name\n|-\n| Trustees  || Maxwell McCann\n|-\n|           || Alexander Struthers\n|-\n| Clerk     || D. D. McGinnis\n|-\n| Treasurer || Richard Morgan\n|-\n| Constable || William K. Burch\n|-\n| Justice of the Peace || J. S. Tremley\n|-\n| Supervisors || William Cass\n|-\n|             || Carter Garret\n|-\n|             || William Butler\n|-\n|             || Daniel Wolford\n|-\n|             || Thomas Morgan\n|-\n|             || D. Pence\n|-\n|             || John Holmes\n|-\n|}\nGovernment\nThe township is governed by a three-member board of trustees, who are elected in November of odd-numbered years to a four-year term beginning on the following January 1. Two are elected in the year after the presidential election and one is elected in the year before it. There is also an elected township fiscal officer, who serves a four-year term beginning on April 1 of the year after the election, which is held in November of the year before the presidential election. Vacancies in the fiscal officership or on the board of trustees are filled by the remaining trustees.\nReferences\nExternal links\n*[http://www.muskingumcounty.org County website]"
    }
  ]
}