{
  "content": [
    {
      "type": "text",
      "text": "# Casselman Vikings\n\n| owner       =\n| coach       =  Geoff Seguin\n| GM          =  Raymond Lavergne\n|captain = Vincent Bastien\n| affiliates  =\n| name1 = Casselman Stars\n| dates1 = 1986-1998\n| name2 = Casselman-Cambridge Stars\n| dates2 = 1998-2000\n| name3 = Casselman Stars\n| dates3 = 2000-2007\n| name4 = Casselman Vikings\n| dates4 = 2008-Present\n| website    = [http://www.casselmanvikingsjrb.com www.casselmanvikingsjrb.com]\n|championships      = 8 2012, 2014, 2015, 2016, 2017, 2018, 2022, 2024\n}}\nThe Casselman Vikings are a Canadian Junior ice hockey team in Casselman, Ontario.  The Vikings play in the Eastern Ontario Junior Hockey League (EOJHL). Between 2014-15 and the end of the 2019-2020 seasons, the EOJHL and the CCHL set a new agreement  in an attempt to create a better player development model. This resulted in the league re-branding itself as the Central Canada Hockey League Tier 2 (CCHL2), and shrinking to 16 teams and two divisions. The league reverted to the Eastern Ontario Junior Hockey League for 2021. Prior to 2015, their league was known as the Eastern Ontario Junior Hockey League of the Ottawa District Hockey Association.  The Vikings have won the Carson Trophy three times and were the 2014 Don Johnson Memorial Cup Eastern Canadian Jr. B Champions.\nHistory\nFounded in 1986, the Stars won the Cameron Trophy six times as the Ottawa District Hockey Association's top Junior C club.  The first time was in 1989, and then again in 1993.  In 1997, the Stars set up a dynasty: winning in 1998, 1999, and 2000.\nright\nThe 2004-05 season was great for the Stars.  After finishing first in the league with 28 wins in 36 games, the Stars defeated the Rockland Nationals 4-games-to-none in the league semi-final and then their rivals, the Embrun Panthers, 4-games-to-1 to win their sixth crown.\nIn the 2005-06 season, the Stars again finished in first place with 27 wins in 36 games.  In the semi-final they defeated the Saint-Isidore Eagles 4-games-to-1 and then were upset by the Embrun Panthers in the final 4-games-to-3.\nAfter a disappointing 2006-07 season, in which the Stars finished seventh place overall, they were swept 4-games-to-none in the league quarter-final by the East Ottawa Thunder.\nIn 2007, the Stars ownership attempted to fill the void left in the Eastern Ontario Junior B Hockey League by the Junior \"A\" expansion of the Kemptville 73's.  When the Casselman franchise could not be put together fast enough, the Stars program was suspended for the 2007-08 Eastern Junior C season.\nThe Casselman Stars were founded in 1986 as members of the Eastern Ontario Junior C Hockey League.  In 2007, the ownership of the team pulled their membership out of the EOJCHL with the intention of joining the Junior B Eastern Ontario Junior Hockey League.  After sitting out a year, the group was awarded a Junior B franchise and changed the team's name to the Vikings.  The league's Junior C spot was given to a new team called the Cumberland Bandits.\nThe Viking have won three Carson Trophies as EOJHL champions (2012, 2014 and 2015).  On April 22, 2014, the Vikings became the first Ontario team to ever play at the Don Johnson Memorial Cup tournament, originally competed for by only Atlantic Canada teams.\n2013-14 Championship season\nThe Vikings finished the 2013-14 regular season with the top record in the St. Lawrence Division, their conference, and the entire EOJHL with 35 wins, 2 losses, and 4 overtime losses.  In their division semi-final, the Vikings swept the Akwesasne Wolves in four games and then beat the Winchester Hawks 4-games-to-1 to win the Division title.  The Vikings then defeated the Gananoque Islanders 4-games-to-1 to win the Rideau-St. Lawrence Conference championship.  The Vikings moved on to the Carson Trophy finals against the Metro-Valley Conference champion Ottawa West Golden Knights.  Casselman quickly found themselves in trouble as the Golden Knights mounted a 3-games-to-1 lead, but the Vikings came back with 3-2 and 4-1 victories to force game seven.  In Game 7, Taylor Widenmaier scored in the first to take an early lead, with Ottawa West tying the game in the second.  With 37 seconds left in regulation, the Golden Knights scored a possible game-winning goal, but with only 14 seconds left Thierry Henry tied up the game forcing overtime.  1:18 into the second extra frame, Captain Joel Adam scored the game-winning goal to give the Vikings their second Carson Trophy as EOJHL champions.\nAs of 2014, the hockey organizations of Atlantic Canada decided to allow a representative of Eastern Ontario into their Junior B championship tournament, the Don Johnson Memorial Cup.  Since 1982, the \"DoJo\" has been exclusive to Atlantic Canadian provinces, but beginning in 2014 has rebranded itself the \"Eastern Canadian Junior B Championship\".  By winning the Carson Trophy, the Vikings became the first team to gain entry to the championship from west of the Atlantic Region.  On April 22, the Vikings made this a reality by facing the Fredericton Jr. Caps of the New Brunswick Junior B Hockey League in Port Hawkesbury, Nova Scotia.  The Viking took their first ever DoJo game by a score of 6-1.  The next day, the Vikings took on the Nova Scotia Junior Hockey League's champion Sackville Blazers and defeated them 7-5.  On the 24th, Casselman faced the Avalon Jr. Capitals of the St. John's Junior Hockey League and beat them 6-2.  In their final round robin game, the Vikings faced the host Strait Pirates but dispatched them with an 8-1 score.  With the round robin over, Taylor Widenmaier was named to the tournament's all-star team, Nicolas Brazeau was given the most sportsmanlike player award, and Maxime Choquette was named the tournament's most valuable player.  Widenmaier and Brazeau would lead the round robin in scoring (13 points each) and Gianmarco De Meis would lead all goalies with a 0.925 save percentage.\nWith a perfect 4-0-0 record, the Vikings earned the first seed in the semi-final and faced fourth seed Fredericton again.  The Jr. Caps were ready for the Vikings this time and clogged up the middle, stymieing their high speed offence.  The Jr. Caps had it tied up 1-1 going into the third, before the Viking popped three quick goals.  The final score was 4-2 and Casselman was into the Final against Sackville (who just dispatched the defending champion Kensington Vipers in overtime).  In the final, Sackville opened up the score early in the first and held a 1-0 lead until the third period.  Casselman stepped up the pressure in third period and responded with goals from Widenmaier and Luc Forget.  With 1:22 to go in the third, Sackville tied the game to force overtime.  At 6:18 into the overtime frame, Simon Cousineau popped in the game-winning goal from a cross ice pass by his linemate Kevin Giroux to secure the Eastern Canadian Championship.  Goalie Gianmarco De Meis was named the championship's most valuable player with 36 saves on 38 shots.\nThe Casselman Vikings finished the season with 57 wins and 11 losses, won their second Carson Trophy, and their first Don Johnson Memorial Cup.  With this, they became the first team outside of the Atlantic Provinces to compete for a DoJo Championship, the first to win a game at the event, and the first to win the championship itself, all while keeping an undefeated 6-0-0 record.\nSeason-by-season results\n{|class=\"wikitable\"\n|- align=\"center\" style=\"color:#FFFFFF\" bgcolor=\"#960018\"\n|Season\t||GP || W || L || T || OTL || GF ||\tGA || P || Results || Playoffs\n|- align=\"center\"\n|1986-87\t||30    ||17   ||10   ||3   ||-    ||157   ||127    ||37    ||2nd EOJCHL  ||\n|- align=\"center\"\n|1992-93\t||30    ||16   ||13   ||1   ||-    ||208   ||179    ||33    ||4th EOJCHL  ||Won League\n|- align=\"center\"\n|2000-01\t||30    ||18   ||10   ||2   ||0    ||155   ||118    ||38    ||3rd EOJCHL  ||Lost quarter-final\n|- align=\"center\"\n|2001-02\t||36    ||12   ||22   ||1   ||1    ||165   ||208    ||26    ||5th EOJCHL  ||Lost quarter-final\n|- align=\"center\"\n|2002-03\t||36    ||23   ||10   ||0   ||3    ||178   ||128    ||49    ||2nd EOJCHL  ||Lost semi-final\n|- align=\"center\"\n|2003-04\t||36    ||12   ||20   ||1   ||3    ||128   ||165    ||28    ||6th EOJCHL  ||Lost quarter-final\n|- align=\"center\"\n|2004-05\t||36\t||28\t||6\t||0\t||2\t||181\t||99\t||58\t||1st EOJCHL\t||Won League\n|- align=\"center\"\n|2005-06\t||36 \t||27 \t||7\t||- \t||2  \t||194 \t||123 \t||56\t||1st EOJCHL\t||Lost final\n|- align=\"center\"\n|2006-07\t||34\t||14\t||18\t||-\t||2\t||128\t||148\t||30\t||7th EOJCHL\t||Lost semi-final\n|- align=\"center\"\n|2007-08\t||colspan=\"11\"|Did Not Participate\n|- align=\"center\"\n|2008-09\t||42    ||30   ||9    ||2   ||1    ||270   ||180    ||63\t||2nd of 5 St. Lawr Div2nd of 10 Rideau-St. Lawr Conf2nd of 21 EOJBHL ||Lost div semi-final, 4-3 (Rebels)\n|- align=\"center\"\n|2009-10\t||40    ||29   ||7    ||2   ||2    ||254   ||107    ||62    ||1st of 6 St. Lawr Div2nd of 11 Rideau-St. Lawr Conf3rd of 22 EOJHL ||Won Div Semi-final, 4-0 (Hawks)Lost Div Final, 4-1 (Glens)\n|- align=\"center\"\n|2010-11\t||42    ||35   ||5    ||1   ||1    ||256   ||117    ||72    ||1st of 6 St. Lawr Div2nd of 11 Rideau-St. Lawr Conf2nd of 22 EOJHL  ||Won Div Semi-final, 4-1 (Lions)Lost Div Final, 4-2 (Hawks)\n|- align=\"center\"\n|2011-12\t||42    ||32   ||8    ||0   ||2    ||239   ||118    ||66    ||2nd of 6 St. Lawr Div2nd of 12 Rideau-St. Lawr Conf3rd of 22 EOJHL ||Won Div Semi-final, 4-0 (Glens)Won Div Final, 4-2 (Hawks)Won Conf Final, 4-3 (Aeros)Won Carson Trophy Final, 4-1 (Mustangs)\n|- align=\"center\"\n|2012-13\t||42    ||31   ||7    ||0   ||4    ||230   ||128    ||66    ||1st of 6 St. Lawr Div1st of 12 Rideau-St. Lawr Conf1st of 22 EOJHL  ||Won Div Semi-final, 4-0 (Hawks)Won Div Final, 4-3 (Wolves)Lost Conf Final, 4-2 (Aeros)\n|- align=\"center\" style=\"color:#FFFFFF\" bgcolor=\"#960018\"\n|Season\t||GP || W || L || OTL || SOL || GF ||\tGA || P || Results || Playoffs\n|- align=\"center\"\n|2013-14\t||41    ||35   ||2    ||2   ||2    ||231   ||96     ||74    ||1st of 6 St. Lawr Div1st of 11 Rideau-St. Lawr Conf1st of 22 EOJHL ||Won Div Semi-final, 4-0 (Wolves)Won Div Final, 4-1 (Hawks)Won Conf Final, 4-0 (Islanders)Won Carson Trophy Final, 4-3 (Golden Knights)Won Don Johnson Memorial Cup (6-0-0)\n|- align=\"center\"\n|2014-15\t||40    ||34   ||4    ||1   ||1    ||233   ||105     ||70    ||1st of 6 St. Lawr Div1st of 11 Rideau-St. Lawr Conf1st of 22 EOJHL ||Won Div Semi-final, 4-2 (Rebels)Won Div Final, 4-1 (Hawks)Won Conf Final, 4-0 (Flyers)Won Carson Trophy Final, 4-2 (Stittsville)\n|- align=\"center\" bgcolor=\"lavender\"\n|2015-16\t||44    ||40   ||3    ||1   ||0    ||266   ||116     ||81    ||1st of 8 Martin Div1st of 16 CCHL2  ||Won quarters 4-0, (Glens)Won semifinals, 4-0 (Golden Knights)Won Barkley Cup Final, 4-1 (Blue Wings)\n|- align=\"center\" bgcolor=\"lavender\"\n|2016-17\t||48    ||38   ||8    ||2   ||2    ||236   ||130     ||80    ||2nd of 8 Martin Div3rd of 16 CCHL2  ||Won quarters 4-3, (Jets)Won semifinals, 4-0 (Golden Knights)Won Barkley Cup Final, 4-0 (Royals)\n|- align=\"center\" bgcolor=\"lavender\"\n|2017-18\t||52    ||40   ||10    ||2   ||0    ||289   ||121     ||82    ||1st of 8 Martin Div1st of 16 CCHL2  ||Won Div Semifinals, 4-0 (Panthers)Won Lea. Semifinals 4-3 (Blue Wings)Won Barkley Cup Final 4-1 (Jr. Canadians)\n|- align=\"center\" bgcolor=\"lavender\"\n|\n|- align=\"center\" bgcolor=\"lavender\"\n|2021-22\t||42    ||30   ||10    ||2   ||0    ||182   ||118     ||62    ||2nd of 8 Martin Div8th of 16 EOJHL  ||Won Div.Quarters 2-0, (Rebels)Won Div Semifinals, 3-2 (Panthers)Won Div. Finals 4-2 (Golden Knights)Won Barkley Cup Final, 4-2 (Blue Wings)\n|- align=\"center\" bgcolor=\"lavender\"\n|2022-23\t||42    ||23   ||15    ||2   ||2    ||141   ||131     ||50    ||4th of 8 Martin Div4th of 16 EOJHL  ||Won Div Semifinals, 4-2 (Panthers)Lost Div. Finals 3-4 (Royals)\n|- align=\"center\" bgcolor=\"lavender\"\n|2023-24\t||44    ||35   ||9   ||0   ||0    ||245   ||108     ||70    ||2nd of 7 Martin Div2nd of 14 EOJHL  ||Won Div Semifinals, 4-0 (Canadians)Won Div. Finals 4-2 (Golden Knights)Won League Finals 4-2 (Jr. Canadians) Barley Cup Champions\n|- align=\"center\" bgcolor=\"lavender\"\n|2024-25\t||48    ||38   ||9   ||1   ||0    ||224   ||135     ||70    ||1st of 6 Martin Div1st of 13 EOJHL  ||Won Div Semifinals, 4-0 (Brigade)Lost Div. Finals 3-4 (Canadians)\n|}\nDon Johnson Memorial Cup\nEastern Canada Jr B Championships\n{| class=\"wikitable\"\n|- style=\"font-weight:bold; color:#FFFFFF\" bgcolor=\"#960018\" |\n|Year || Round Robin || Record || Standing || Semifinal || Br. Med. Game ||Gold Medal Game\n|-\n|  2014 || W,Fredericton Caps 6-1W, Sackville Blazers 7-5W, Avalon Capitals 6-2W, Strait Pirates 8-1 ||   4-0-0||  1st of 6 ||W, 4-2Fredericton Caps ||n/a||OTW, 3-2Sackville BlazersDon Johnson Cup Champions\n|}\nThis was the only year the EOJHL was part of the Don Johnson Championships\nReferences\nExternal links\n*[http://casselmanvikingsjrb.com/ Vikings Webpage]\n*\n* [http://cchl2.pointstreaksites.com/ CCHL2 Webpage]"
    }
  ]
}