{
  "content": [
    {
      "type": "text",
      "text": "# Catalan Republic\n\nCatalan Republic or Catalan State refers to Catalonia at various times when it was proclaimed or briefly established either an independent republic or as a republic within a Spanish federal republic:\n* Catalan Republic (1640–1641), an independent state under French protection during the Reapers' War, but shortly thereafter put in a personal union with the Kingdom of France.\n* Catalan State (1873), an attempt to proclaim a federated state within the First Spanish Republic.\n* Catalan Republic (1931), a proclaimed state declared in expectations of the imminent formation of an Iberian Confederation of Republics. Within days, the Catalan Republic voluntarily became an autonomous region within the Second Spanish Republic.\n* Catalan State (1934), a \"Catalan State within the Spanish Federal Republic\" proclaimed during the Events of 6 October.\n* Catalan Republic (2017), a proposed state declared after the 2017 Catalan independence referendum, and immediately suspended.\nAdditionally, there were other historical proposals, attempts and ambiguous status regarding a non-monarchical Catalan statehood, among them:\n* A quasi-republican government established by the institutions of the Principality of Catalonia during the War of the Catalans (1713-1714), the last phase of the War of the Spanish Succession in the Iberian Peninsula.\n* A 1794 proposal from the Committee of Public Safety of the First French Republic to establish a Catalan sister republic in the context of the War of the Pyrenees against Spain (1793-1795). The war front stalemate and the Fall of Robespierre ended the project before being put into practice.\n* Government of Catalonia (1810-1812), a body under direct control of the French emperor Napoleon I, separated de facto from the Kingdom of Spain under Joseph Bonaparte in the context of the Peninsular War, and later directly annexed to the French Empire.\n* The Plot of Prats de Molló (1926), an attempt to military liberate Catalonia, then under the Dictatorship of Primo de Rivera (1923-1930), and to proclaim the Catalan Republic, planned by Estat Català with its headquarters close to the French-Spanish border, but aborted at the last moment by the French police.\n* Revolutionary Catalonia (1936-1937), a quasi-state with anarcho-syndicalist features established during the Spanish Civil War (1936-1939)."
    }
  ]
}