{
  "content": [
    {
      "type": "text",
      "text": "# Catalan Civil War__disambig_1\n\ntemplate -->\n| map_type          =\n| map_relief        =\n| map_size          =\n| map_marksize      =\n| map_caption       =\n| map_label         =\n| territory         =\n| result            = Royal victory. Capitulation of Pedralbes\n| status            =\n| combatants_header =\n| combatant1        = Principality of Catalonia\n**Council of the Principality\n**Generalitat\n**Consell de Cent\nSupported by:Crown of Castile (1462–1463)Kingdom of Portugal (1463–1466)Duchy of Lorraine (1466–1471)Kingdom of France (1466–1471)\n| combatant2        = Crown of AragonSupported by:RemensaKingdom of France (1462–1463)Crown of Castile (1469–1472)\n| combatant3        =\n| commander1        = Hugh Roger III of PallarsHenry IV of CastilePeter, Constable of PortugalRené of AnjouJohn II of Lorraine\n| commander2        = John II of AragonJuan III de CardonaJuan IV de CardonaFrancesc de VerntallatGaston de Foix\n| commander3        =\n| units1            =\n| units2            =\n| units3            =\n| strength1         =\n| strength2         =\n| strength3         =\n| casualties1       =\n| casualties2       =\n| casualties3       =\n| notes             =\n| campaignbox       =\n}}\nThe Catalan Civil War, also called the Catalonian Civil War or the War against John II, was a civil war in the Principality of Catalonia, then part of the Crown of Aragon, between 1462 and 1472. The two factions, the royalists who supported John II of Aragon and the Catalan constitutionalists (Catalanists, pactists, and foralists), disputed the extent of royal rights in Catalonia. The French entered the war at times on the side on John II and at times with the Catalans. The Catalans, who at first rallied around John's son Charles of Viana, set up several pretenders in opposition to John during the course of the conflict. Barcelona remained their stronghold to the end: with its surrender the war came to a close. John, victorious, re-established the status quo ante bellum.\nFor the royalist side, the \"rebels\" were for having betrayed the fidelity they had sworn to their king; while the anti-royalists considered the royalists \"traitors\" for not being faithful to the laws of the \"land\", for being \"enemies of public affairs\" or simply for being \"bad Catalans\". Thus, the anti-royalist side developed a new conception of political society in which, according to Catalan historians  and , \"solidarity among the men of a country was produced by having common laws and inhabiting the same land, not as, until then, by the fact of being vassals of the same sovereign». Thus, the modern concept of homeland had emerged that went beyond mere territorial ascription to take on a legal character, so the Catalan rebellion would be, as the French historian  described, \"the first of modern revolutions', hundred years before the Dutch Revolt.\nBackground\nWhen the war started, John II had been King of Navarre since 1425 through his first wife, Blanche I of Navarre, who had married him in 1420. When Blanche died in 1441, John retained the government of her lands and dispossessed his own eldest son, Charles (born 1421), who was made Prince of Viana in 1423. John tried to assuage his son with the lieutenancy of Navarre, but his son's French upbringing and French allies, the Beaumonteses, brought the two into conflict. In the early 1450s they were engaged in open warfare in Navarre. Charles was captured and released; and John tried to disinherit him by illegally naming his daughter Eleanor, who was married to Gaston IV of Foix, his successor. In 1451 John's new wife, Juana Enríquez, gave birth to a son, Ferdinand. In 1452 Charles fled his father first for France, later for the court of his uncle, John's elder brother, Alfonso V at Naples. From 1454 John governed his brother's Spanish realms&mdash;the Crown of Aragon&mdash;as lieutenant.\ndepicting the Catalan Courts in session]]\nWhen Alfonso died in 1458, Charles was arrested and brought to Majorca. John succeeded Alfonso as ruler of the Crown of Aragon. In his will, Alfonso named Charles as his heir. Among John's early unpopular acts was to quit the war against Genoa, upsetting the merchants of Barcelona. He also refused to aid his nephew, Ferdinand I of Naples, in securing his throne.\nIn 1460 Charles left Majorca unauthorised and landed in Barcelona, where he was welcomed by the two chief factions, the  Busca, which were merchants, artisans, and laborers, and the Biga, which were honored citizens and landlords. John did not initially react to the situation, but he called Charles to his court at Lleida to discuss the proposed marriage of Charles to Isabella, infanta of Castile. He still refused to recognise Charles as his \"first born\", probably seeking to reserve that title for Ferdinand, but arousing opposition in the meantime. Charles opened negotiations with Henry IV of Castile, his father's inveterate enemy. At Lleida on 2 December 1460 he was arrested and imprisoned in Morella. This caused an uproar in Catalonia, where Charles was immensely popular, and the king was forced to suspend court. The Generalitat and the Consell de Cent, the municipal council of Barcelona, created a Consell del Principat (\"Council of the Principality\") to settle the matter of the rightful succession. the Catalan Courts (the parliament) were called for 8 January 1461.\nAt the parliament, Joan Dusai, the noted doctor of laws, ruled that the king had violated four of the Usatges de Barcelona, four of the Constitucions de Catalunya, and the Furs (Laws) of Lleida. The parliament then demanded that John name Charles as his first-born son and heir. This he refused, and the parliament assembled an army under the Count of Modica. The army quickly captured Fraga and John capitulated in February. He freed Charles on 25 February and, on 21 June 1461, signed the Capitulation of Vilafranca, whereby Charles was recognised as his first-born son, lieutenant in perpetuity, and heir in all his realms. The king also surrendered his right to enter the Principality of Catalonia without the permission of the Generalitat. He was also forced to surrender royal prerogatives. The appointment of royal officials was to be done only on the advice of representative bodies. The treaty was a victory for the Catalanists (who stressed Catalan independence and pre-eminence), pactists (who stressed the relationship between monarch and Catalonia as a mutual agreement), and the foralists (who stressed the ancient privileges, the fueros, of Catalonia).\nCharles died of tuberculosis in Barcelona on 23 September 1461, a fact which threatened the treaty of 21 June. While Charles had inspired unity, his death sparked the reemergence of factionalism. Though the treaty allowed for the young Ferdinand, only nine years old, to succeed John, Ferdinand's mother was conspiring with the Busca against the Biga to have the treaty overturned.\nRevolt of the remences\nCivil war broke out with the war of the Remences led by Francesc de Verntallat in February 1462. The peasant revolted against the Consell del Principat with the hope of receiving royal support: Juana worked hard to stoke anti-Busca sentiment in Barcelona. In April a plot by some former Busca in support of the queen had been publicised and the deputy leader of the Consell, Francesc Pallarès, along with two former leaders, was executed in May. On 11 March 1462, Juana and Ferdinand left unsafe Barcelona for Girona, hoping to receive protection from the French army there.\nJohn signed two treaties in 1462 at Sauveterre (3 May) and Bayonne (9 May) with Louis XI of France whereby the French king would lend 700 lances (4,200 knights plus their retainers) in military aid to John in exchange for 200,000 écus and, as surety of payment, the cession of the counties of Roussillon and Cerdagne, and the right to garrison Perpignan and Cotlliure. In April, at Olite, the French king had already agreed to acquiesce in John's plan to make Eleanor and her husband his heirs in Navarre and dispossess his eldest daughter, Blanche II of Navarre, who was given over to Eleanor and Gaston's custody. She was poisoned in prison in 1464.\nAt the same time the Consell del Principat formed an army to put down the rebellion of the remences. The army of the Consell was placed under the command of Hug Roger III, Count of Pallars Sobirà, commander of the army of the Generalitat. After besieging and capturing Hostalric on 23 May 1462, Hug Roger marched on Girona, where he was received warmly on 6 June while the queen and the prince took refuge in the citadel, the Força Vella (\"old fort\"), throughout June. Gaston of Foix, leading a French army, took Girona on 23 July and rescued the queen and prince.\nThroughout the summer the Generalitat and the municipal council of Barcelona worked with the peasant leaders and various noble factions to draw up an agreement and bring an end to the revolt. The king, however, intrigued against it and negotiations were scuttled before a treaty could take effect.\nWar against John II\nJohn II took his first major offensive against the Principality by occupying Balaguer on 5 June 1462. On 9 June, the Consell declared him an enemy of the people and deposed him. On 11 August 1462, the Generalitat offered the crown to Henry IV of Castile, who accepted and sent John of Beaumont as his lieutenant. John II meanwhile marched on Lleida, which he did not besiege. He then defeated an army of the Consell near Cervera at Rubinat on 21&ndash;22 July, and proceeded to take Tàrrega. After the victory he joined his forces with Gaston de Foix's at Montcada on 1 September and marched towards Barcelona. The city was besieged until Hug Roger III could arrive with relief troops by sea on 3 October.\nJohn II then marched on Tarragona, where the Archbishop of Tarragona, Pere d'Urrea urged surrender. With the fall of Tarragona (31 October), Henry IV, who was approaching Barcelona by sea, opened negotiations with John and Louis XI. Throughout the winter of 1462&ndash;63, both armies were plagued with desertions and neither side could call on more than a few hundred, mostly demoralised, troops. John, though, was supported in Aragon and Valencia, and especially in Sardinia and Sicily. Major concessions to the Sicilian nobility in 1460 ensured Sicilian grain and money to feed and finance the royalist cause in Catalonia after 1462.\nIn April John II ceded Estella in Navarre to Castile and on 13 June 1463, Henry formally renounced the Aragonese throne. On 27 October 1463, the Consell offered the throne to the constable of Portugal, a grandson of James II of Urgell, who was acclaimed as Peter V. In November a delegation of Catalans approached Louis of France at Abbeville to seek his arbitration, but he loudly proclaimed himself a Catalan dynast and mused that \"there are no mountains\" between Catalonia and France. The Catalan legates wisely decided to return without his arbitration.\nPeter of Portugal sailed to Barcelona, where he landed on 21 January 1464. He lifted the siege of Cervera, but failed to duplicate the feat at Lleida, which John captured on 6 July 1464, and several smaller towns. Vilafranca del Penedès, where the Capitulation had been signed three years earlier, fell to the king on 25 August. Cervera, Amposta, and Tortosa fell to John II and John Ramon III, Count of Prades. Peter suffered a major defeat at the Battle of Calaf (or Battle of \"Els Prats del Rei\") on 28 February 1465, where the count of Pallars Sobirà was captured. Peter died at Granollers on 30 June 1466. Tortosa capitulated shortly after his death, as did some other small places. The king had offered to pardon his enemies and respect the Constitucions and the municipal privileges, so that the Generalitat was debating submission, but a minority on the Consell was deadset against it.\nOn 30 July 1466 the Consell elected René the Good, the Count of Anjou and Provence and failed claimant to several crowns, as their new king. His election&mdash;he was a grandson of John I of Aragon&mdash;was designed to fracture the French alliance. René sent as his lieutenant his blind son John II, Duke of Lorraine, with much needed reinforcements. Speedily John besieged Girona, captured Banyoles, occupied the Empordà, and entered Barcelona in August 1466. The entire Empordà, however, did not remain occupied for long.\nOn 21 November 1467, John of Lorraine defeated Prince Ferdinand at the  Battle of Viladamat. The prince sustained heavy losses and John II, who had recently landed at Empúries, fled with his son to Tarragona. When the Duke of Lorraine was shortly forced to return to France to raise troops, Ferdinand campaigned northwards. All the while the king was working to foment a baronial rebellion against Louis XI of France and to foster a tripartite alliance between England, Burgundy, and Aragon.\nWhen, in 1468, the brother of the childless Henry IV of Castile, Alfonso de Trastámara y Avís, died, John rushed to propose a marriage between his son Ferdinand and Henry's half-sister Isabella, formerly the proposed wife of Charles of Viana. On 12 September 1468 Ferdinand took Berga. His proposed marriage won the approval of the Aragonese and Castilian magnates and was celebrated in Valladolid on 18 October 1469. The Duke of Lorraine had returned to Catalonia in May that year and, on 1 June 1469, took Girona, which he had been holding out through 1467 into 1469, and several smaller places. At a General Cortes at Monzón in 1470 the king received the subsidy he requested to carry on the war until the expulsion of the French from Catalonia.\nDuke John of Lorraine died at Barcelona on 16 December 1470, before an attack on the mountainous redoubt of Francesc de Verntallat could be carried out. With John of Lorraine dead, the Catalans lost their most important ally — King René lived until 1480, but was not personally present in Catalonia; he appointed John's eldest bastard son, John of Calabria, Count of Briey, his new lieutenant. In 1471 the French troops fighting with the Catalans retired to France and the advantage shifted decidedly to John II.\nJoan Margarit, the Bishop of Girona, returned his city to John on 18 October 1471, followed by other towns. King John II campaigned in the Alt Empordà until 20 June 1472 and then against Barcelona. A naval and land siege of Barcelona lasted from 1 January 1472 to 16 October 1472. By the capitulation of Pedralbes, Barcelona surrendered to King John, John agreed to let the warchief John of Calabria leave peacefully and a general pardon was granted. The Count of Pallars, however, was not pardoned. The acts of the Consell and the other organs of Catalan government since the death of Charles of Viana were approved and John swore to uphold the Constitucions. The Capitulation of Vilafranca, however, was rejected.\n, site of the treaty to put end to the Civil War]]\nAftermath\nThe last action of the war was on the part of the Catalan barons of Roussillon and Cerdagne, which had been assigned to France as surety for war subsidies. The French were only slowly expelled. On 1 February 1473, John entered Perpignan to the joy of its citizens. He placed Catalan garrisons in the castles of Bellegarde, Collioure, and Salses. The French, angered by the abridgement of the treaty of Bayonne, counter-attacked a few weeks later, but some Castilian troops under Prince Ferdinand successfully resisted. John began negotiations that led to a truce on 14 July and a treaty at Perpignan on 17 September. John recognised the treaty of Bayonne in return for French recognition of his sovereignty in the disputed provinces. John agreed to pay 300,000 écus, and Roussillon and Cerdagne were proclaimed \"neutral\" until the payment was made.\nJohn returned to Barcelona triumphant, but failed to raise the necessary funds. In the summer of 1474 the French conquered Roussillon and on 10 March 1475 Perpignan fell to them.\nThe French raided the Empordà as far as Girona in 1476, and John, his allies tied up by their own wars, could not even oppose them. In October 1478 he ceded the two provinces to France until he could redeem them with cash. Revolts against his authority flared in Aragon and Valencia, which had stayed out of the civil war, and he failed to put them down. He did succeed in quashing a revolt in Sardinia.\nNotes\nExternal links\n*Henry John Chaytor (1933), A History of Aragon and Catalonia, [http://libro.uca.edu/chaytor/hac16.htm Chapter 16: Juan II. Union of Aragon with Castile] (London: Methuan Publishing).\n*[https://archive.today/20130221165214/http://www.grec.net/cgibin/dificil.pgm?USUARI=&SESSIO=&PGMORI=E&NDCHEC=0016466 Catalonia: History &mdash; The War Against John II.] HiperEnciclopèdia.\n*[http://www.enciclopedia.cat/fitxa_v2.jsp?NDCHEC=0034563 Guerra contra Joan II.] Grup Enciclopèdia Catalana.\n*[https://web.archive.org/web/20110715172036/http://www.remences.com/mapaca2.jpg Map of the revolt of the remences.]\nReferences\n*\n*\n*"
    }
  ]
}