{
  "content": [
    {
      "type": "text",
      "text": "# Cathedral of Christ the King (Lexington, Kentucky)\n\n| osgraw =\n| osgridref =\n| location = 299 Colony Blvd.Lexington, Kentucky\n| country = United States\n| denomination = Roman Catholic Church\n| previous denomination =\n| churchmanship =\n| membership =\n| attendance =\n| website =\n| former name =\n| bull date =\n| founded date = July 22, 1945\n| founder =\n| dedication =\n| dedicated date =\n| consecrated date =\n| cult =\n| relics =\n| events =\n| past bishop =\n| people =\n| status =\n| functional status =\n| heritage designation =\n| designated date =\n| architect = Edward J. Schulte\n| architectural type =\n| style = Modern and late Art Deco\n| groundbreaking =\n| completed date = 1967\n| construction cost = $1.5 million\n| closed date =\n| demolished date =\n| capacity =\n| length =\n| width =\n| width nave =\n| height =\n| diameter =\n| other dimensions =\n| floor count =\n| floor area =\n| dome quantity =\n| dome height outer =\n| dome height inner =\n| dome dia outer =\n| dome dia inner =\n| spire quantity =\n| spire height =\n| materials =\n| bells =\n| bells hung =\n| bell weight =\n| diocese = Lexington\n| bishop = Most Rev. John Stowe\n| rector = Rev. Paul Prabell\n| vicar =\n| deacon =\n}}\nThe Cathedral of Christ the King is a Roman Catholic cathedral located in Lexington, Kentucky, United States.  It is the seat of the Diocese of Lexington.\nHistory\nChrist the King Parish was established in the Diocese of Covington on July 22, 1945.  Initially, Mass and other parish functions were held in the chapel at St. Catherine's Academy.  The Rev. George J. O'Brien was named the parish's first pastor but had to resign soon after because of ill health, being replaced by the Rev. Richard O'Neill.  The parish moved to its current site on May 12, 1946, with parish functions held in a pre-fabricated structure.  Christ the King School was opened in 1951 and the Sisters of Divine Providence formed the initial faculty.  The present church and rectory were built in the Modern and Art Deco architectural styles from 1965 to 1967 for $1.5 million.  On January 14, 1988 Pope John Paul II established the Diocese of Lexington,  and Christ the King became the cathedral for the new diocese.  The Cathedral Center was added to the parish facilities in 1992.\nLike many other Catholic parishes during the COVID-19 pandemic, the cathedral rector was forced to limit how and when the sacrament of confession was exercised.\nPresent day\nAccording to the cathedral's website, the cathedral parish \"seeks transformation by the Holy Spirit to a parish focused on evangelizing, forming, equipping and sending forth missionary disciples of Jesus Christ into the world.\"\nGallery\nSee also\n*List of Catholic cathedrals in the United States\n*List of cathedrals in the United States\nReferences\nExternal links\n*[https://web.archive.org/web/20131001215247/http://www.cathedralctk.org/ Official Cathedral Site]\n*[http://www.cdlex.org/ Roman Catholic Diocese of Lexington Official Site]"
    }
  ]
}