{
  "content": [
    {
      "type": "text",
      "text": "# Catherine Howard\n\n(Royal Collection)\n| image_size   = 250px\n| succession   = Queen consort of England\n| reign        = }}\n| spouse       =\n| house        = Howard\n| house-type   = Family\n| father       = Lord Edmund Howard\n| mother       = Joyce Culpeper\n| birth_date   =\n| birth_place  = Lambeth, London, England\n| death_date   = 13 February 1542 (aged 18–19)\n| death_place  = Tower of London, London, England\n| death_cause  = Execution\n| burial_date  = 13 February 1542\n| burial_place = Church of St Peter ad Vincula, Tower of London\n| signature    = Catherine Howard Signature.svg\n}}\nCatherine Howard ( – 13 February 1542) was Queen of England from July 1540 until November 1541 as the fifth wife of King Henry VIII. She was the daughter of Lord Edmund Howard and Joyce Culpeper, a first cousin to Anne Boleyn (the second wife of Henry VIII), and the niece of Thomas Howard, 3rd Duke of Norfolk. Thomas Howard was a prominent politician at Henry's court. He secured her a place in the household of Henry's fourth wife, Anne of Cleves, where Howard caught the King's interest. She married him on 28 July 1540 at Oatlands Palace in Surrey, just 19 days after the annulment of his marriage to Anne. Henry was 49, and it is widely accepted that Catherine was about 17 at the time of her marriage to him.\nCatherine was stripped of her title as queen in November 1541 and beheaded three months later on the grounds of treason for committing adultery with her distant cousin, Thomas Culpeper.\nAncestry\nCatherine was a granddaughter of Thomas Howard, 2nd Duke of Norfolk, and his first wife, Elizabeth Tilney, but her father, Lord Edmund Howard, was the third son of the Duke, and under primogeniture, the eldest son inherited their father's estate. On her paternal side, Catherine was the niece of Thomas Howard, 3rd Duke of Norfolk, and first cousin of poet and soldier Lord Henry Howard, styled Earl of Surrey (his courtesy title as heir apparent to the Dukedom of Norfolk), and Lady Mary Howard, wife of Henry VIII's illegitimate son, Henry FitzRoy, Duke of Richmond and Somerset. Through her father's side, she was also a first cousin of Mary, George and Anne Boleyn (Catherine's aunt, Elizabeth Howard, was the mother of the Boleyn siblings). Catherine also was the second cousin of Jane Seymour, because her grandmother Elizabeth Tilney was the sister of Seymour's grandmother, Anne Say.\nCatherine's mother, Joyce Culpeper, already had five children from her first husband, Ralph Leigh ( – 1509) when she married Lord Edmund Howard, and they had another six together, Catherine being about her mother's tenth child. With little to sustain the family, her father often had to beg for the help of his more affluent relatives.\nAfter Catherine's mother died in 1528, her father married two more times. In 1531, he was appointed Controller of Calais. He was dismissed from his post in 1539, and died in March 1539. Catherine was the third of Henry VIII's wives to have been a member of the English nobility or gentry; Catherine of Aragon and Anne of Cleves were royalty from continental Europe.\nEarly life\nCatherine was born in Lambeth in or about 1523, although the exact date is unknown. An estimated date has been determined from the wills of family members, the known birth order of her and her siblings in various dated records, and the age range of her ladies-in-waiting, being in the same age group and often, same past household of the Dowager Duchess of Norfolk, where Catherine would spend a large portion of her childhood and adolescence.\nCatherine did not have a good start in life, mostly due to the routinely poor decisions of her father, Edmund Howard. Being the third son of a prominent family, Edmund's opportunities were limited to relying on the generosity of his wealthier family members and his own ability to pave his way. He was both overly proud and a spendthrift. His insult to the King and further events would continue to devolve and slowly ensnare him, and by extension, his family. Edmund developed a gambling addiction that meant the constant threat of debtors' prison, and he went into hiding on multiple occasions. In his desperate 1527 letter to Thomas Wolsey he states, \"Humbly I beseech your grace to be my good lord, for without your gracious help I am utterly undone. Sir, so it is that I am so far in danger of the King's Laws by reason of the debt that I am in, that I dare not go abroad, nor come in mine own house, and am fain to absent me from my wife and my poor children ... Sir there is no help but, through your grace and your good mediation to the King's Grace.\"\nIf Cardinal Wolsey did assist the family in response to the letter written in 1527, which there is little evidence of, the funds arrived piecemeal and were probably not enough. The lowest point for the family came between 1524 and 1531, the period which roughly corresponds with Catherine Howard's birth and early years. The image this paints is of a girl likely neglected and potentially unwanted, as her birth meant a future dowry to come up with money for. Generally, Catherine's young life was filled with uncertainty and instability, so it is understandable as to why she has been often described as barely literate and generally unlearned. She clearly was not a high priority for her father, still less her education and future prospects. In 1531, help came to Catherine indirectly through the intervention of her cousin and soon-to-be queen, Anne Boleyn, whom Edmund approached regarding a position; he was assigned to be the Comptroller at Calais.\nWhether due to her mother Joyce's death in about 1528, her family's financial problems, or Catherine nearing the age suitable for wardship, Catherine's family was broken up in 1531, when she was about 8 years of age. Two of her older half-sisters were married off, and both Catherine and her brother Henry were sent to be wards of Agnes Howard, her step-grandmother and the Dowager Duchess of Norfolk. The duchess managed large households at Chesworth House in Horsham, Sussex, and at Norfolk House in Lambeth where dozens of attendants, along with her many wards—usually the children of aristocratic but poor relatives—resided. While sending young children to be educated and trained in aristocratic households was common among European nobles at the time, supervision at both Chesworth House and Lambeth was apparently lax. The Dowager Duchess was often at Court and seems to have had little direct involvement in the upbringing of her wards and young female attendants.\nIn the Duchess's household at Horsham, in around 1536, Catherine began music lessons with two teachers, one of whom was Henry Mannox, and they began a relationship. Mannox's exact age at the time is unknown. It has recently been stated that he was in his late thirties, perhaps 36, but this is not supported by Catherine's biographers. Evidence exists that Mannox was not yet married, and it would have been highly unusual for someone from his background at the time to not be married by his mid-thirties. He married sometime in the late 1530s, perhaps in 1539, and there is also some evidence that he was the same age as two other men serving in the household, including his cousin Edward Waldegrave, who was in his late teens or early twenties between 1536 and 1538. This evidence indicates that Mannox too was in his early to mid-twenties in 1536.\nThe details and dates of this relationship are debated among modern historians. The most popular theory, first put forward in 2004 by Retha Warnicke, was that the relationship between them was abusive, with Mannox grooming and preying on Catherine between 1536 and 1538; this is expanded upon in detail by Conor Byrne. Other biographers, like Gareth Russell, believe that Mannox's interactions with Catherine took place over a much shorter time, that Mannox was roughly the same age as her, but that \"their relationship was nonetheless inappropriate, on several levels.\" He believes Catherine was increasingly repulsed by Mannox's pressure to have sex with her and was angered by his gossiping with servants about the details of what had gone on between them.\nMannox and Catherine both confessed during her adultery inquisitions as the wife of King Henry that they had engaged in sexual contact, but not actual coitus. When questioned, Catherine was quoted as saying, \"At the flattering and fair persuasions of Mannox, being but a young girl, I suffered him at sundry times to handle and touch the secret parts of my body, which neither became me with honesty to permit nor him to require.\"\nCatherine severed contact with Mannox in 1538, most likely in the spring. It is not true, as is sometimes stated, that this was because she began to spend more time at the Dowager Duchess's mansion in Lambeth, as Lambeth was Mannox's home parish and he also married here, perhaps in 1538 or 1539. He was still living in Lambeth in 1541. Shortly afterward, Catherine was pursued by Francis Dereham, a secretary of the Dowager Duchess. They allegedly became lovers, addressing each other as \"husband\" and \"wife\". Dereham also entrusted Catherine with various wifely duties, such as keeping his money when he was away on business. Many of Catherine's roommates among the Dowager Duchess's maids of honour and attendants knew of the relationship, which apparently ended in 1539 when the Dowager Duchess found out. Despite this, Catherine and Dereham may have parted with intentions to marry upon his return from Ireland, agreeing to a precontract of marriage. If indeed they exchanged vows before having sexual intercourse, they would have been considered married in the eyes of the Church.\nArrival at court\nCatherine's uncle, the Duke of Norfolk, found her a place at Court in the household of the King's fourth wife, Anne of Cleves. As a young and attractive lady-in-waiting, Catherine quickly caught the eye of several men, including the King and Thomas Culpeper. In the early stages of her time at court, and prior to the arrival of Anne of Cleves, the relationship between the King and Catherine has been little remarked upon. He seems to have found her attractive, and whenever they happened to be in each other's company they publicly flirted, but little else appears to have happened. As Anne arrived and the King came to show little interest in her, an opportunity for Catherine slowly began to present itself.\nPrior to this point, Catherine and Thomas Culpeper had slowly entered into a quasi-relationship and one that was not sexual – although, from later testimony, Culpeper expected it to soon become so, also telling Catherine that he loved her. Catherine rejected this, and in response he moved on to another woman within the Queen's household. This deeply upset Catherine, who does appear to have had some level of feelings for him at this time, for on one occasion she broke down in tears in front of her fellow maids of honour. Prior to this instance, it was she who controlled how long her relationships lasted and when they ended. During this time, word reached back to Francis Dereham of the rumoured soon-to-be marriage between the pair, and he arrived at court to dispute this with them both. After being, again, told off by Catherine, he returned to the dowager duchess's household, which he requested to leave, as Catherine was no longer there. Believing this desperation was temporary and soon to blow over, Agnes Howard denied this request.\nThe King had displayed little interest in Anne of Cleves from the beginning, but some historians have argued that, with Thomas Cromwell failing to find a new match, Norfolk saw an opportunity. The Howards may have sought to recreate the influence gained during Anne Boleyn's reign as queen consort. According to Nicholas Sander, the religiously conservative Howard family may have seen Catherine as a figurehead for their fight by expressed determination to restore Roman Catholicism to England. Catholic bishop Stephen Gardiner entertained the couple at Winchester Palace with \"feastings\". However, Russell does not accept this interpretation.\nAs the King's interest in Catherine grew, so did the house of Norfolk's influence. Her youth, prettiness and vivacity were captivating for the middle-aged sovereign, who claimed he had never known \"the like to any woman\". Within months of her arrival at court, Henry bestowed gifts of land and expensive cloth upon Catherine. The first administrative evidence of this was a grant made on 24 April 1540. Henry called her his 'very jewel of womanhood' (that he called her his 'rose without a thorn' is likely a myth). The French ambassador, Charles de Marillac, thought her \"delightful\". Holbein's portrait showed a young auburn-haired girl with a characteristically hooked Howard nose; Catherine was said to have a \"gentle, earnest face\", while Elisabeth and Agnes Strickland, who co-authored the Victorian-era biography of Catherine Howard in \"The Lives of the Queens of England: Volume IV\", describe her as petite in stature, but of a full frame.\nMarriage\nKing Henry and Catherine were married by Edmund Bonner Bishop of London at Oatlands Palace on 28 July 1540, the same day Cromwell was executed. She was a teenager and he was 49. Catherine adopted the French motto \"Non autre volonté que la sienne\", meaning \"No other will but his\". The marriage was made public on 8 August, and prayers were said in the Chapel Royal at Hampton Court Palace. Henry \"indulged her every whim\" thanks to her \"caprice\".\nCatherine was young, joyous and carefree. She was too young to take part in administrative matters of State. Nevertheless, every night Sir Thomas Heneage, Groom of the Stool, came to her chamber to report on the King's well-being. No plans were made for a coronation, yet she still travelled downriver in the royal barge into the City of London to a gun salute and some acclamation. She was settled by jointure at Baynard Castle. Little changed at court, other than the arrival of many Howards. Every day she dressed with new clothes in the French fashion bedecked with precious jewels, decorated in gold around her sleeves.\nThe Queen escaped plague-ridden London in August 1540 when on progress. The royal couple's entourage travelled on honeymoon through Reading and Buckingham. The King embarked on a lavish spending spree to celebrate his marriage, with extensive refurbishments and developments at the Palace of Whitehall. This was followed by more expensive gifts for Christmas at Hampton Court Palace.\nThat winter the King's bad moods deepened and grew more furious, caused in part by the pain from his ulcerous legs. He accused councillors of being \"lying time-servers\", and began to regret executing Cromwell. After a dark and depressed March, his mood lifted at Easter.\nPreparations were in place for any signs of a royal pregnancy, reported by Marillac on 15 April as \"if it be found true, to have her crowned at Whitsuntide.\"\nDownfall\nCatherine may have been involved during her marriage to the King with Henry's favourite male courtier, Thomas Culpeper, a young man who \"had succeeded [him] in the Queen's affections\", according to Dereham's later testimony. She had considered marrying Culpeper during her time as a maid-of-honour to Anne of Cleves.\nCulpeper called Catherine \"my little, sweet fool\" in a love letter. It has been alleged that in spring 1541 the pair were meeting secretly. Their meetings were allegedly arranged by one of Catherine's older ladies-in-waiting, Jane Boleyn, Viscountess Rochford (Lady Rochford), the widow of Catherine's executed cousin, George Boleyn, Anne Boleyn's brother.\nPeople who claimed to have witnessed her earlier sexual behaviour while she lived at Lambeth reportedly contacted her for favours in return for their silence, and some of these blackmailers may have been appointed to her royal household. John Lassells, a supporter of Cromwell, approached the Archbishop of Canterbury, Thomas Cranmer, telling him that his sister Mary refused to become a part of Queen Catherine's household, stating that she had witnessed the \"light\" ways of Queen Catherine while they were living together at Lambeth. Cranmer then interrogated Mary Lassells, who alleged that Catherine had had sexual relations while under the Duchess of Norfolk's care, before her relationship with the King.\nCranmer immediately took up the case to topple his rivals, the Roman Catholic Norfolk family. Lady Rochford was interrogated, and confessed that she had watched for Catherine backstairs as Culpeper had made his escapes from the Queen's room.\nDuring the investigation a love letter written in the Queen's distinctive handwriting was found in Culpeper's chambers. This is the only letter of hers that has survived (other than her later \"confession\").\nOn All Saints' Day, 1 November 1541, the King arranged to be found praying in the Chapel Royal. There he received a letter describing the allegations against Catherine. On 7 November 1541, Archbishop Cranmer led a delegation of councillors to Winchester Palace in Southwark, to question her. Even the staunch Cranmer found the teenaged Catherine's frantic, incoherent state pitiable, saying, \"I found her in such lamentation and heaviness as I never saw no creature, so that it would have pitied any man's heart to have looked upon her.\" He ordered the guards to remove any objects she might use to commit suicide.\nImprisonment and death\nEstablishing the existence of a pre-contract between Catherine and Dereham would have had the effect of terminating Catherine's marriage to Henry, but it would also have allowed Henry to annul their marriage and banish her from court to live in poverty and disgrace instead of executing her, although there is no indication that Henry would have chosen that alternative. Initially Catherine made a frank confession of her relationship with Dereham, but subsequently she steadfastly denied any pre-contract, maintaining that Dereham had raped her.\nCatherine was stripped of her title as queen on 23 November 1541 and imprisoned in the new Syon Abbey, Middlesex, formerly a convent, where she remained throughout the winter of 1541. She was obliged by a Privy Councillor to return the ring previously owned by Anne of Cleves, which the King had given her; it was a symbol of removal of her regal and lawful rights. The King would be at Hampton Court, but she would not see him again. Despite these actions, her marriage to Henry was never formally annulled.\nCulpeper and Dereham were arraigned at the Guildhall on 1 December 1541 for high treason. They were executed at Tyburn on 10 December 1541, Culpeper being beheaded and Dereham being hanged, drawn and quartered. According to custom, their heads were placed on spikes on London Bridge. Many of Catherine's relatives were also detained in the Tower, tried, found guilty of concealing treason and sentenced to life imprisonment and forfeiture of goods. Her uncle, the Duke of Norfolk, distanced himself from the scandal by retreating to Kenninghall to write a letter of apology, laying all the blame on his niece and stepmother. His son Henry Howard, Earl of Surrey, a poet, remained a favourite of the King. Meanwhile, the King sank further into morbidity and indulged his appetite for food and women.\nCatherine remained in limbo until Parliament introduced on 29 January 1542 a bill of attainder, which was passed on 7 February 1542. The Royal Assent by Commission Act 1541 made it treason, and punishable by death, for a queen consort to fail to disclose her sexual history to the King within 20 days of their marriage, or to incite someone to commit adultery with her. This measure retroactively solved the matter of Catherine's supposed pre-contract and made her unequivocally guilty. No formal trial was held.\nWhen the Lords of the Council came for her, she allegedly panicked and screamed as they manhandled her into the barge that would escort her to the Tower. On Friday 10 February 1542, her flotilla passed under London Bridge where the heads of Culpeper and Dereham were impaled (and where they remained until 1546). Entering through the Traitors' Gate, she was led to her prison cell. The next day the Bill of Attainder received Royal Assent and her execution was scheduled for 7:00&nbsp;a.m. on Monday 13 February 1542. Arrangements for the execution were supervised by Sir John Gage in his role as Constable of the Tower.\nThe night before her execution, Catherine is believed to have spent many hours practising how to lay her head upon the block, which had been brought to her at her request. She died with relative composure but looked pale and terrified; she required assistance to climb the scaffold. According to popular folklore her last words were, \"I die a Queen, but I would rather have died the wife of Culpeper\", but no eyewitness accounts support this, instead reporting that she stuck to traditional final words, asking for forgiveness for her sins and acknowledging that she deserved to die \"a thousand deaths\" for betraying the King, who had always treated her so graciously. She described her punishment as \"worthy and just\" and asked for mercy for her family and prayers for her soul. This was typical of the speeches given by people executed during that period, most likely to protect their families, since the condemned person's last words would be relayed to the King. Catherine was then beheaded with the executioner's axe.\nFrancis I, when told by Sir William Paget how the Queen had \"wonderfully abused the King\", laid his hand on his heart and announced by his faith as a gentleman that \"She hath done wonderous naughtly\". Upon hearing news of Catherine's execution, King Francis wrote a letter to Henry regretting the \"lewd and naughty [evil] behaviour of the Queen\" and advising him that \"the lightness of women cannot bend the honour of men\".\nLady Rochford was executed immediately thereafter on Tower Green. Both bodies were buried in an unmarked grave in the nearby Church of St Peter ad Vincula, where the bodies of Catherine's cousins, Anne and George Boleyn, also lay. Other cousins were also in the crowd, including the Earl of Surrey. King Henry did not attend. Catherine's body was not one of those identified during restorations of the chapel during Queen Victoria's reign. She is commemorated on a plaque on the west wall dedicated to all those who died in the Tower.\nHistoriography\nCatherine has been the subject of contention for modern biographies, A Tudor Tragedy by Lacey Baldwin Smith (1967), Katherine Howard: A Tudor Conspiracy by Joanna Denny (2006), ''Katherine Howard: Henry VIII's Slandered Queen by Conor Byrne (2019), and Young and Damned and Fair'' by Gareth Russell (2017). Each is more or less sympathetic, though they disagree on various important points involving Catherine's motivations, date of birth and overall character.\nHer life has also been described in the five collective studies of Henry's queens that have appeared since the publication of Alison Weir's The Six Wives of Henry VIII (1991)—such as David Starkey's The Six Wives: The Queens of Henry VIII (2003). Several of these writers have been highly critical of Catherine's conduct, if sympathetic to her eventual fate and regarding her punishment as excessive. Baldwin Smith described Catherine's life as one of hedonism and characterized her as a \"juvenile delinquent\", as did Francis Hackett in his 1929 biography of Henry. Weir had much the same judgement, describing her as an \"empty-headed wanton\". Other writers, especially those studying historical trends larger than Catherine's life, have been much more critical towards her. In his book Tudor Queens of England, which profiles 14 consorts and sovereigns, David Loades described Catherine as a \"stupid and oversexed adolescent\" who \"certainly behaved like a whore\", and wrote that her denial of a precontract was \"a measure of her stupidity\"; however, he also said that she died when she was \"just 20 years old, a mere child\". In her book ''Elizabeth's Women'', profiling the rise of Queen Elizabeth I (Catherine's stepdaughter), Tracy Borman wrote that Catherine was \"as much a sexual predator as [Francis] Dereham\" and blamed Catherine almost entirely for her own fate.\nLoades's and Borman's characterizations are unusually harsh, however. The general trend has been more favourable to Catherine, particularly in the works of Antonia Fraser, Karen Lindsey, Joanna Denny, Conor Byrne, Josephine Wilkinson, and Gareth Russell. Lucy Worsley also takes a kinder, modern view of the accusations against Catherine and their relation to the men who took advantage of her in her youth. In her BBC miniseries Six Wives she states that today, instead of the \"good-time girl\" some historians accuse her of having been, we would call her an \"abused child.\" As Nicola Clark argues, \"we need to nuance our understanding of women’s agency, dynastic identity, and politics\" when considering the Howard dynasty.\nPortraits\n'', c. 1540(Buccleuch Collection)]]\nThere is no authenticated contemporary likeness of Catherine Howard, and there is no documentary evidence that she ever had her portrait painted. \"[T]here is a good chance that any image of Catherine would have been destroyed\" after her execution, or \"ignored, until their identity became a subject of debate to later generations.\" Debate continues about the identity of the sitter(s) for potential portraits.\nMiniatures\nTwo portrait miniatures by Hans Holbein the Younger, one in the Royal Collection and another in the Buccleuch Collection, have been traditionally considered to be contemporary portraits of the ill fated queen. The Royal Collection version at Windsor Castle, if confirmed to be her depiction, would be the only surviving painting from life and roughly dated to the time of her queenship. The historian David Starkey has confirmed a date of roughly 1540, based on the details of her dress and the technique of the miniature. She is wearing a pendant jewel that is similar to that shown in Holbein's portrait of Jane Seymour at the Kunsthistorisches Museum, Vienna. It is also identical to that worn in two other portraits of Henry VIII's Queens, one being the Hastings portrait of Queen Catherine Parr and the other being a Workshop of Hans Holbein portrait of Queen Jane Seymour.\nIf this identification is correct, then the necklace and pendant may have been given to Catherine by Henry VIII on their marriage in 1540. To further bolster that these portraits are of a Tudor queen, and potentially Catherine Howard, it is also by the fact that, for female sitters, duplicate versions of miniatures do not generally exist, with the exception of royalty. Unfortunately, there are no confirmed likenesses of her to compare these portraits with. Both versions have long been documented as of Catherine Howard, since 1736 for the Buccleuch version and 1739 (or at least the 1840s) for the Windsor version.\nHowever, in more recent years, the traditional assumptions about these portraits are being challenged, and with reasonable evidence. The art historian, Franny Moyle, in ''The King's Painter: The Life and Times of Hans Holbein'' (2021), argues that the Royal Collection miniature is not a likeness of Catherine Howard. Instead, she argues that it is a depiction of Anne of Cleves, who also married the King in 1540 (making the dating by David Starkey still accurate and confirmed with a potential re-identification). Instead, Moyle was \"struck by the sitter's uncanny likeness\" to Holbein's 1539 miniature of Anne, now in the Victoria & Albert Museum. She also makes note of the fact that Holbein, who is known for using symbolism in subtle ways, chose to mount the miniature on a Four of Diamonds playing card and by doing so, it is speculated, was referring to the miniature as being Anne of Cleves, the Fourth Wife of Henry VIII. Finally, Moyle notes that, royal jewelry of the Queens of England, then and now, is property of the crown and current titleholder. As such, individual pieces would have been passed down and worn by multiple of Henry's queens.\nOther portraits\nA Holbein drawing (below) is also traditionally identified as being of Catherine Howard, but this also appears to be without foundation.\nFile:Hans Holbein the Younger - Unknown woman formerly known as Catherine Howard RL 12218.jpg|An unidentified woman c. 1532–43, Hans Holbein the Younger\nFile:Catherinehoward3.jpg|Unknown woman engraved as Catherine Howard, 1797, Francesco Bartolozzi after Hans Holbein\nA contemporary portrait of a lady in black, by Hans Holbein the Younger, was identified by art historian, Sir Lionel Cust, in 1909, as Catherine Howard. The portrait (below), dated c. 1535–1540, is exhibited at the Toledo Museum of Art as Portrait of a Lady, probably a Member of the Cromwell Family. Two copies are extant: a 16th-century version at Hever Castle is exhibited as Portrait of a Lady, thought to be Catherine Howard; the National Portrait Gallery exhibits a similar painting, Unknown woman, formerly known as Catherine Howard, dating from the late 17th century. Inscribed ETATIS SVÆ 21, indicating that the lady was depicted at the age of twenty-one, the portrait has long been associated with Henry VIII's young queen, but she is now thought to be a member of the Cromwell family.\nFile:Holbein, Hans (II) - Portrait of a lady, probably of the Cromwell Family formerly known as Catherine Howard - WGA11565.jpg|Portrait of a Lady, probably a Member of the Cromwell Family c. 1535–1540(Toledo Museum of Art)\nFile:Hans Holbein-the-Younger-Portrait-of-a-Lady-thought-to-be-Catherine-Howard.jpg|Portrait of a Lady, thought to be Catherine Howard, 16th century, follower of Hans Holbein the Younger (Hever Castle)\nFile:Unknown woman, formerly known as Catherine Howard by Hans Holbein the Younger.jpg|Unknown woman, formerly known as Catherine Howard, late 17th century, after Hans Holbein the Younger\nFile:Unknown woman, formerly known as Catherine Howard, engraving.jpg|Unknown woman, formerly known as Catherine Howard, 1902, after Hans Holbein the Younger\nIn 1967 art historian Sir Roy Strong noted that both the Toledo portrait and the National Portrait Gallery version appear in the context of a series of portraits of members of the family of the Protector's uncle, Sir Oliver Cromwell (–1655), and have provenances linking them with the Cromwell family. He argued that the portrait in the Toledo Museum of Art, \"should by rights depict a lady of the Cromwell family aged 21 c. 1535–40\" and suggested that the lady might be Elizabeth Seymour, wife of Gregory Cromwell, 1st Baron Cromwell, son of Thomas Cromwell, Earl of Essex. He stated that a \"dated parallel for costume, notably the distinctive cut of the sleeves, is Holbein's Christina of Denmark of 1538.\" John Rowlands agreed that \"the portrait could certainly belong to the period c. 1535–40, but the headdress suggests a date towards its end.\" Herbert Norris claimed that the sitter is wearing a sleeve that follows a style set by Anne of Cleves, which would date the portrait to after 6 January 1540, when Anne's marriage to Henry VIII took place. The original Holbein is dated to 1535–1540, but the National Portrait Gallery dates their copy to the late 1600s. This would seem to indicate a sitter who was still a connection to be commemorated over a century later (unlike Catherine).\nHistorians Antonia Fraser, Diarmaid MacCulloch and Derek Wilson believe that the portrait is likely to depict Elizabeth Seymour. Fraser has argued that the sitter is Jane Seymour's sister, Elizabeth, the widow of Sir Anthony Ughtred, on the grounds that the lady bears a resemblance to Jane, especially around the nose and chin, and wears widow's black. The lady's sumptuous black clothing, an indication of wealth and status, did not necessarily signify mourning; her jewellery suggests otherwise. Derek Wilson observed that \"In August 1537 Cromwell succeeded in marrying his son, Gregory, to Elizabeth Seymour\", the queen's younger sister. He was therefore related by marriage to the King, \"an event worth recording for posterity, by a portrait of his [Cromwell's] daughter-in-law.\" The painting was in the possession of the Cromwell family for centuries. According to Hans Holbein's most recent biographer, Franny Moyle, \"One of the most striking portraits of a woman Holbein ever delivered was of Cromwell's daughter-in-law, painted probably in 1539 as she turned twenty-one.\"\nFile:Workshop of Hans Holbein the Younger portrait of a Lady.jpg|Portrait of a Young Woman, c. 1540–45, Workshop of Hans Holbein the Younger\nFile:Miniatureenlarged.jpg|alt=Portrait of an Unknown Lady, c. 1535, Lucas Horenbout (1490/95–1544)|Portrait of an Unknown Lady, Likely Mary I c. 1535, Lucas Horenbout (1490/95–1544)\nMost recently Susan James, Jamie Franco, and Conor Byrne have identified a Portrait of a Young Woman, attributed to the workshop of Hans Holbein the Younger, at the Metropolitan Museum of Art, as a portrait of the Queen. Brett Dolman has noted that the hypothesis is \"seductive but inconclusive.\" However, it more closely matches general assumptions of Catherine's appearance, than the other non-confirmed and discredited options. This portrait is in the right timeframe and depicts a fairly young woman of wealth and high status within the social hierarchy of the Tudor era. It is also known that Catherine preferred French hoods, as depicted, and also had a love of fashion. This depiction is unique from many other portraits, in that it has no other similar likenesses, that would clearly depict the same woman. Meaning that, it is less likely to be another copy of a known person and instead, potentially someone who has not been previously identified. All of these factors make it a reasonable potential to be Catherine, based on all the evidence.\nThe portrait of an Unknown Lady (circa 1535), has also been considered as a potential miniature of Catherine. However, upon further analysis by [https://www.britishartstudies.ac.uk British Art Studies], a peer-reviewed art scholarship publisher, Polly Saltmarsh asserts that this is a depiction of the future Queen Mary I, who matches the miniature in several ways. The likeness has an upturned nose and blue-grey eyes, which are known features of Mary's and normally in her confirmed depictions. The miniature, by being one, is also a confirmed likeness of a royal family member, being that miniatures did not exist outside of the royal family during this time period. Finally, by being dated to roughly 1535, is identification is also accurate for Mary, because the lettering translates from the latin \"XVIII\" to 18. Commonly, roman numerals in Tudor miniatures and portraits would equate to either the year or the sitter's age. Mary I was turning 18 in 1534. Overall, all of these facts point toward this conclusion. It is unlikely for Catherine Howard to have been painted in 1535, being an 11 year-old girl and the daughter of an impoverished younger son of a prominent family, the Howards. To make things more plausible, it would mean changing the dating from the circa 1535 timeframe up 5 years, to roughly 1540. When comparing the two options, again, Mary I is the best fit for identification.\nFootnotes\nReferences\nCitations\nWorks cited\n*\n*\n*\n*\n*\n* }}\n* }}\n*\n* |author-link=Record Commission}}\n* }}\n*\n*\n*\n*\n* }}\n* }}\n*\n*\n*\n*\n*\n*\n*  |access-date=19 March 2016 |editor-last2=Godfrey |editor-first2=Walter H.}}\n*\n*\n*\n*\n*\n*\n*\n*\n* }}\n*\n*\n*\n*\n*\n*\nFurther reading\n*\n*\n*\n*\n*\n*\n*\n*\n* }}\n* }}\n*\nExternal links\n* [http://www.nationalarchives.gov.uk/museum/item.asp?item_id=13 Letter from Catherine Howard to Thomas Culpeper]\n* [https://archive.today/20121209040651/http://www.pbs.org/wnet/sixwives/meet/ch_handbook_fate.html PBS Six Wives of Henry VIII, which describes Catherine's death]\n* [https://web.archive.org/web/20191006050006/https://queenanneboleyn.com/2019/08/18/all-that-glitters-hans-holbeins-lady-of-the-cromwell-family-by-teri-fitzgerald/ Teri Fitzgerald, ''All that Glitters: Hans Holbein's Lady of the Cromwell Family]\n* [http://onthetudortrail.com/Blog/2019/11/04/catherine-howard-and-the-cromwells-by-teri-fitzgerald/ Teri Fitzgerald, Catherine Howard and the Cromwells'']\n*\n* [https://archives.parliament.uk/collections/getrecord/GB61_HL_PO_PU_1_1541_37H8n33 Original images of the Act concerning the Attainder of the late Queen Katharine and her Complices]"
    }
  ]
}