{
  "content": [
    {
      "type": "text",
      "text": "# Catholic Church in the Democratic Republic of the Congo\n\nCatholicism has a major presence in the Democratic Republic of the Congo (DRC). It is part of the worldwide Catholic Church under the spiritual leadership of the Pope in Rome.\nAccording to the 2020 Report on International Religious Freedom, an estimated 47.3% of the population are Catholic.\nThere are six archdioceses and 41 dioceses. The largest of these is the Archdiocese of Kinshasa. Its archbishop, Fridolin Ambongo Besungu, is the president of the Symposium of Episcopal Conferences of Africa and Madagascar.\nThe impact of the Catholic Church in the DRC is difficult to overestimate. Schatzberg has called it the country's \"only truly national institution apart from the state.\" Besides involving more than 50 percent of the population in its religious services, its schools have educated over 60 percent of the nation's primary school students and more than 40 percent of its secondary students during the 20th century. The church owns and manages an extensive network of hospitals, schools, and clinics, as well as many diocesan economic enterprises, including farms, ranches, stores, and artisans' shops.\nAssociation with colonialism\nFor earlier history see Catholic Church in Kongo.\n, Uélé, photography commissioned by the Premonstratensians of Tongerlo Abbey (B), date unknown]]\nThe church's penetration of the country at large is a product of the colonial era. The Belgian colonial state authorized and subsidized the predominantly Belgian Catholic missions to establish schools and hospitals throughout the colony; the church's function from the perspective of the state was to accomplish Belgium's \"civilizing mission\" by creating a healthy, literate, and disciplined work force, one that was obedient to the governing authorities. From the perspective of the church, evangelization was the primary goal, and the number of converts baptized was the measure of its success. Although different in emphasis, church and state goals were sufficiently complementary that the state and church were perceived by the population as sharing the same purpose. As Joseph Malula, who was for many years the head of the church in Zaire, put it, \"For our people, the Church was the State, and the State was the Church.\" When independence came in 1960, the bill for church collaboration came due; Catholic personnel were the frequent subjects of attacks by angry Congolese throughout the country, while Protestant missionaries and Kimbanguist personnel were, outside of Bas-Zaïre Region, largely spared.\nThe Catholic Church distances itself from the state\nThe Church's reversal of its role in relation to the state since independence has been striking. Formerly a reliable ally, it has increasingly become the state's most severe institutional critic. Overt conflict first erupted in 1971 when the state, as part of its efforts to centralize and extend its authority, nationalized the country's three universities, including the Catholic Church's Lovanium University outside Kinshasa. State attempts to implant sections of the official party's youth movement, the Youth of the Popular Revolutionary Movement (Jeunesse du Mouvement Populaire de la Révolution—JMPR), in Catholic seminaries were strongly resisted. The conflict intensified in 1972 when, as part of the authenticity campaign, all Zairians were ordered to drop their Christian baptismal names and adopt African ones. Cardinal Malula protested the decision and told his bishops to ignore it. The regime retaliated by forcing the cardinal into exile for three months and by seizing his residence and converting it into JMPR headquarters. In addition, the state banned all religious publications and youth groups.\nFollowing a brief thaw in 1973 and early 1974, during which the cardinal was permitted to return from exile, relations between church and state continued to deteriorate. The state declared that Christmas would no longer be a Zairian holiday, banned religious instruction from the schools, and ordered crucifixes and pictures of the pope removed from schools, hospitals, and public buildings; the removed items were replaced by pictures of President Mobutu. The president was characterized by the regime as a new messiah, and the state took over direct control of the nation's schools. Courses in Mobutism supplanted courses in religious instruction. Students in the former church schools found themselves participating in daily rallies led by JMPR members, during which they were obliged to chant \"Mobutu awa, Mobutu kuna, Mobutu partout\" (Mobutu here, Mobutu there, Mobutu everywhere).\nReturn of Church schools\nThe tables turned in late 1975 as the effects of Zairianization and the fall in copper prices resulted in a progressively worsening economy. As living standards fell, more and more state officials exploited their positions to steal from the citizenry. Catholic clergy issued public denunciations of these exactions. Increasingly pointed pastoral letters denouncing state corruption were published by all of Zaire's bishops in 1977 and 1978.\nMeanwhile, although privately furious at such criticism, Mobutu was preoccupied with the deteriorating economy and the invasions of Shaba Region. In addition, the state's lack of managerial skills and resources had rendered its takeover of the education system a disaster. Faced with these realities, the president asked religious institutions to resume responsibility for church schools, which, by 1976, they had done. Courses on religion were once again integrated into the curriculum.\nThe Church as voice of opposition to Mobutu and cronyism\nTensions remained high throughout the 1980s and into the 1990s. The bishops' episcopal letter of June 1981, for example, castigated the regime for corruption, brutality, mismanagement, and lack of respect for human dignity. An angry Mobutu retaliated by warning the Catholic hierarchy to stay out of politics; he also stationed JMPR militants in all places of worship to monitor priestly homilies. Coincidentally, attacks and attempted attacks were launched during the following months by unknown parties against several highly placed Catholic clerics; Cardinal Malula's home, for example, was attacked and his night watchman killed. The cardinal advised Zairians before the 1984 presidential elections to consult their consciences before casting their ballots; his act was denounced by the government as religious zealotry.\nTensions would have been still greater but for divisions within the Church and for the ambiguity of the Church's role relative to the state. Conflict within the Church exists between the lower clergy, who are in day-to-day contact with the population, and the higher clergy; the former argued for a more radical structural critique of the regime, while the latter prevailed in arguing for a more limited, moral criticism. Many bishops wished to protect the church's institutional position and to avoid the retaliation that a more militant attack on the state could well provoke.\nReaction to ongoing conflicts\nThe Catholic Church in the DRC has taken several firm stances regarding the several ongoing conflicts in the country, both collectively and individually.\nIn November 2022 the Congolese bishops issued a statement in which they warned that the country was at risk of \"Balkanisation\" due to the dire security situation, with rebel groups making significant gains in various parts of the territory, and in 2024, six bishops from the east of the country issued a statement criticising the \"undermining\" of the dignity of the population, and claiming \"our country is not for sale!\".\nBishop Melchisedec Sikuli Paluku, of the diocese of Butembi-Beni has taken a firm stance against the ongoing violence in the area covered by his diocese, publishing a statement in June 2024 lamenting the killings “of a peaceful population, left without defence and without security”, the abduction of persons “without a single trace of any of them” and the rape of girls and women. He called on government authorities \"to end the Calvary of the Congolese people in general, and the population of the Diocese of Butembo-Beni in particular, a Calvary which has lasted too long in this martyred region\".\nIn January 2025, as fighting raged in and around Goma, the local bishop Willy Ngumbi Ngengele issued a statement calling for respect for civilians. In his statement Bishop Ngengele called for \"absolute respect by all parties, and in all circumstances, for human life and for private and public infrastructure in accordance with human dignity and international law\". That same month Archbishop Francois Xavier Maroy, of Bukavu, published a \"message of comfort\" in which he lamented that \"for two years, many of our brothers and sisters have had nothing other than their eyes to weep and their feet to flee, sometimes without a destination, and even the camps for the displaced are not secure, several villages are saturated, and others emptied of their populations.\"\nOn 28 July 2025, following two church massaces in Lubero and Komanda, the bishops' conference issued a statement saying: \"“This umpteenth massacre has occurred in one of the provinces that has been under a state of siege for several years, with the presence of the joint operation of the Congolese armed forces (FARDC) and Ugandan (UPDF), in addition to MONUSCO. In these provinces we are witnessing murders and kidnappings”. The bishops asked: “Is anyone talking about the Islamists of the ADF, the terrorists of the ADF/MTM ISCAP? Do these serial killers have any purpose? Who benefits from these crimes perpetrated for years against peaceful citizens?” and asked for “a thorough and satisfactory investigation into the tragedy”.\nFinancial dependency\nHigh church officials enjoyed many of the economic and social privileges of other prominent Zairians. In addition, the Church continued to depend on grants from foreign sources; as of 1976, none of Zaire's forty-seven dioceses was financially self-sufficient, a situation of dependency that appeared little changed by the early 1990s. The dependence of the largely Africanized church leadership on substantial numbers of expatriate priests, nuns, and brothers at lower and middle staff levels was another weakness. Finally, while church officials generally sided with the populace against the government in labor disputes, tax revolts, and individual cases of injustice, they sometimes made common cause with the regime; in its management role in Catholic schools, for example, the Church found itself siding with the government against teachers striking for higher wages in the early 1980s.\nThe Zaire Use\nThe Zaire Use, or Zairan Rite (Rite Zaïrois), that which perhaps now can be called the Congolese Rite, is a variation of the Roman Rite. It was approved by Rome in 1988. This liturgy fits into Congolese culture. People are involved in the liturgy because they feel recognised and considered. It takes into account African life and culture.\nThe Zaire Use encourages the participation of the congregation. The engagement of the faithful by, for example, dance, can be seen as an expression of faith. Another aspect is the invocation of ancestors and the saints which forms an important part of liturgy in the Congo. It is an eschatological affirmation of the Christian assembly as well as a part of the Congolese culture. A third characteristic of the liturgical celebration is that readers receive a blessing given as a mandate by the priest, before going up to read.\nCardinal Joseph-Albert Malula\nCardinal Joseph Malula is considered, today, as \"one of the founders of the African Church [...] and as an African father figure\", the father of the Rite Zairois or the pioneer, par excellence'', of the Africanisation of the c\\Church in sub-Saharan Africa.\nDioceses\n{|\n|- valign=\"top\"\n|\n* Bukavu\n** Butembo-Beni\n** Goma\n** Kasongo\n** Kindu\n** Uvira\n|\n* Kananga\n** Kabinda\n** Kole\n** Luebo\n** Luiza\n** Mbujimayi\n** Mweka\n** Tshilomba\n** Tshumbe\n|\n* Kinshasa\n** Boma\n** Idiofa\n** Inongo\n** Kenge\n** Kikwit\n** Kisantu\n** Matadi\n** Popokabaka\n|\n* Kisangani\n** Bondo\n** Bunia\n** Buta\n** Doruma–Dungu\n** Isangi\n** Isiro–Niangara\n** Mahagi–Nioka\n** Wamba\n|\n* Lubumbashi\n** Kalemie–Kirungu\n** Kamina\n** Kilwa–Kasenga\n** Kolwezi\n** Kongolo\n** Manono\n** Sakania–Kipushi\n|\n*Mbandaka-Bikoro\n** Basankusu\n** Bokungu–Ikela\n** Budjala\n** Lisala\n** Lolo\n** Molegbe\n|}\nCatholic lay organizations\n* Kiro Congo (youth organization)\n* Xaveri Congo (youth organization)\nSee also\n*Religion in the Democratic Republic of the Congo\n*List of saints from Africa\nReferences"
    }
  ]
}