{
  "content": [
    {
      "type": "text",
      "text": "# Catharine Edwards (historian)\n\n| image              =\n| image_size         =\n| alt                =\n| caption            =\n| birth_name         = Catharine Harmon Edwards\n| birth_date         =\n| birth_place        = Redruth, Cornwall, England\n| death_date         =\n| death_place        =\n| death_cause        =\n| nationality        =\n| citizenship        =\n| other_names        =\n| occupation         =\n| period             =\n| known_for          =\n| title              =\n| boards             =\n| spouse             =\n| partner            =\n| children           =\n| parents            =\n| relatives          =\n| awards             =\n| website            =\n| education          =\n| alma_mater         = Trinity College, Cambridge\n| thesis_title       =\n| thesis_url         =\n| thesis_year        =\n| school_tradition   =\n| doctoral_advisor   =\n| academic_advisors  =\n| influences         =\n| era                =\n| discipline         = Ancient history\n| sub_discipline     =\n| workplaces         =\n| doctoral_students  =\n| notable_students   =\n| main_interests     =\n| notable_works      =\n| notable_ideas      =\n| influenced         =\n| signature          =\n| signature_alt      =\n| signature_size     =\n| footnotes          =\n}}\nCatharine Harmon Edwards  (born 27 May 1963) is a British ancient historian and academic. She is Professor of Classics and Ancient History at Birkbeck College, University of London. She is a specialist in Roman cultural history and Latin prose literature, particularly Seneca the Younger.\nEarly life and education\nEdwards was born on 27 May 1963 in Redruth, Cornwall, England. She was educated at Clifton High School, a private school in Bristol. She studied classics at Trinity College, Cambridge, graduating with a Bachelor of Arts (BA) degree in 1985 and a Doctor of Philosophy (PhD) degree in 1990. Her doctoral thesis was titled \"Transgression and control: studies in ancient Roman immorality\".\nAcademic career\nEdwards began her academic career as a junior research fellow at Selwyn College, Cambridge from 1988 to 1989. She then moved to the University of Bristol where she was a lecturer from 1989. She was promoted to senior lecturer in 1997 and to reader in 1999.\nEdwards joined Birkbeck College, University of London in 2001 as a lecturer. She has been Professor of Classics and Ancient History since 2006.\nEdwards researches Roman cultural history and Latin prose literature, particularly Seneca the Younger. She also researches the reception of Classical antiquity in later periods.\nEdwards is the presenter of the three-part BBC series Mothers, Murderers and Mistresses: Empresses of Ancient Rome. She has also contributed to BBC Radio 4's In Our Time series, on Cleopatra, Roman Britain, Virgil's Aeneid, Tacitus and the decadence of Rome, Pliny the Younger, The Augustan Age and Marcus Aurelieus.\nShe served as president of the Society for the Promotion of Roman Studies from June 2015 to June 2018. In 2021, she was elected a Fellow of the British Academy.\nSelected publications\n*The politics of immorality in ancient Rome. Cambridge University Press, 1993.\n*Writing Rome: Textual Approaches to the City. Cambridge University Press, 1996.\n*Rome the Cosmopolis. Cambridge University Press, 2003. (edited with Greg Woolf).\n*Death in ancient Rome. Yale University Press, 2007.\nReferences\nExternal links\n*[https://www.youtube.com/watch?v=6wCUXZ-9UUQ Catharine Edwards talking on Tiberius and Livia.]"
    }
  ]
}