{
  "content": [
    {
      "type": "text",
      "text": "# Catherine Mulholland (historian)\n\n| birth_place    = Hollywood, California, U.S.\n| death_date     =\n| death_place    = Camarillo, California, U.S.\n| nationality    = American\n| occupation     = Historian · Author · Civic leader\n| education      = University of California, Berkeley (B.A. English); Columbia University (M.A. English)\n| years_active   = 1950s–2011\n| known_for      = Historical scholarship on Los Angeles & San Fernando Valley; biographer of William Mulholland\n| notable_works  = Calabasas Girls: An Intimate History (1976); Owensmouth Baby: The Making of a San Fernando Valley Town (1987); William Mulholland and the Rise of Los Angeles (2000)\n| spouse         = Gerard T. Hurley (m. 1949–1976)\n| children       = Three\n| organizations  = Los Angeles Water & Power Associates (board member)\n}}\nCatherine Rose Mulholland (April 8, 1923 – July 6, 2011) was an American historian and author known for her works on the history of Los Angeles and the San Fernando Valley. As the granddaughter of William Mulholland, the chief engineer responsible for constructing the Los Angeles Aqueduct, she offered a unique perspective on the region's development.\nEarly life and education\nBorn in Hollywood, California in 1923, Catherine Mulholland grew up on her family's 600-acre ranch in the western San Fernando Valley. Her parents were Perry Mulholland, William's eldest son, and Addie, the daughter of Calabasas homesteaders. She attended multiple schools during her youth, including North Hollywood Junior High School, Marlborough School for Girls, and graduated from Canoga Park High School in 1940.\nShe studied musical improvisation under jazz teacher Lloyd Reese, leading to a friendship with legendary bassist Charles Mingus. This relationship provided her with deep insights into the racial challenges of the time. Mulholland earned a degree in English from UC Berkeley and later a master’s from Columbia University, becoming friends with prominent writers such as Allen Ginsberg and Jack Kerouac. She also studied for a Ph.D. in English literature at UC Berkeley but did not finish her degree.\nCareer\nIn the 1950s, Mulholland wrote a successful play about her early life, entitled A Wedding in the Valley, which won the James D. Phelan Award for significant accomplishments by young California writers and artists.\nBeginning in 1976, Mulholland authored several books focusing on Los Angeles' history, including:\n* Calabasas Girls: An Intimate History, 1885-1912 (1976), a detailed account of the early days of Calabasas, California.\n* Owensmouth Baby: The Making of a San Fernando Valley Town (1987), which chronicled the development of the community of Owensmouth, now known as Canoga Park.\n* William Mulholland and the Rise of Los Angeles (2000), a biography of her grandfather, offering a nuanced portrayal of his role in Los Angeles' water history and challenging previous narratives about his involvement in the St. Francis Dam disaster. This book was published by a major academic publisher, the University of California Press, but received mixed reviews. Ben Ehrenreich of L.A. Weekly criticized it for lacking deep insights and focusing largely on disproving conspiracy theories about Los Angeles’ acquisition of Owens Valley land and the construction of the aqueduct. In contrast, Jonathan Kirsch of the Los Angeles Times praised it as a grand and graceful saga, while the New York Times described it as a well-balanced biography based on extensive research, including Mulholland’s personal office files. Historian Abraham Hoffman commended the author’s thorough scholarship, noting that while some expected a biased account due to her family connection, she presented a comprehensive and honest portrayal.\nOver the final 30 years of her life, Catherine Mulholland consistently stated in various interviews that she saw herself as the protector of her grandfather's legacy and reputation. She firmly denied his involvement in conspiracies to steal water from the Owens Valley, but she acknowledged that the St. Francis Dam disaster was, at least in part, his responsibility. She fought against the myths surrounding William Mulholland, many of which were fueled by the 1974 film Chinatown. Additionally, Catherine rejected the portrayal of her grandfather as a mere \"lackey\" to influential industrialists and politicians, a role often attributed to him. Her biography of William Mulholland was her opportunity to try to correct the record and reclaim his reputation.\nBeyond writing, Mulholland was an active civic leader and public speaker, contributing to historical preservation and education in Southern California. Most notably, she served on the board of Los Angeles Water and Power Associates, an organization dedicated to educating the public about water-related issues.\nPersonal life\nMulholland had a brief romantic relationship with the poet Jack Spicer before she married Gerard T. Hurley in 1949, with whom she had three children. They later divorced in 1976.\nMulholland resided in Berkeley for most of her married life, only returning to Southern California after her divorce. She lived first in Thousand Oaks, then in Chatsworth for many years, and finally in Camarillo\nDeath\nCatherine Mulholland died on July 6, 2011, at her home in Camarillo, California, at the age of 88.\nLegacy\nMulholland donated her personal papers and archives, covering multiple generations of her influential family as well as the office files of William Mulholland, to California State University, Northridge where they are preserved in the University Library in Special Collections and Archives.\nIn a speech in 1986, Mulholland shared her reasons for becoming a historian:\n:''I realized that progress is a terrible destroyer. It's a builder, but it's also a destroyer. It's a destroyer of the past. If some of us don't put it down while we're still alive, it's going to get distorted and forgotten and fall through the cracks.\nReferences\nExternal links\n* [https://www.c-span.org/program/book-tv/william-mulholland-and-the-rise-of-los-angeles/133461William Mulholland and the Rise of Los Angeles, Book TV, C-SPAN, 2000.]\n* [https://www.youtube.com/watch?v=g627_JlN3vE William Mulholland and the Rise of Los Angeles'', University of California Television, 2002.]"
    }
  ]
}