{
  "content": [
    {
      "type": "text",
      "text": "# Cattle Creek, Queensland (Toowoomba Region)\n\n| pop                 = 21\n| pop_year            =\n| pop_footnotes       =\n| established         =\n| postcode            = 4407\n| area                = 279.9\n| timezone            = AEST\n| utc                 = +10:00\n| dist1               = 45.6\n| dir1                = WSW\n| location1           = Cecil Plains\n| dist2               = 62.6\n| dir2                = ENE\n| location2           = Moonie\n| dist3               = 127\n| dir3                = W\n| location3           = Toowoomba\n| dist4               = 256\n| dir4                = W\n| location4           = Brisbane\n| lga                 = Toowoomba Region\n| stategov            = Southern Downs\n| fedgov              = Maranoa\n| near-n              = Halliford\n| near-ne             = Dunmore\n| near-e              = Dunmore\n| near-se             = Western Creek\n| near-s              = Western Creek\n| near-sw             = Weir River\n| near-w              = Weir River\n| near-nw             = Marmadua\n}}\nCattle Creek is a rural locality in the Toowoomba Region, Queensland, Australia. In the , Cattle Creek had a population of 21 people.\nGeography\nThe Cecil Plains Moonie Road enters the locality from the east (Dunmore) and exits to the north-west (Weir River / Marmadua).\nThe Kumbarilla State Forest is in the north of the locality, extending into neighbouring localities of Maradua and Halliford. The Western Creek State Forest in the south of the locality, extending into the neighbouring localities of Weir River, Western Creek and Dunmore. Apart from these protected areas, the land use is mostly grazing on native vegetation with some crop growing.\nHistory\nThe locality is named after one of the many creeks of that name in Queensland. The locality is on the old Dunmore pastoral run, occupied in the 1840s by Robert Logan.\nDemographics\nIn the , Cattle Creek had a population of 19 people.\nIn the , Cattle Creek had a population of 21 people.\nEducation\nThere are no schools in Cattle Creek. The nearest government primary schools are Cecil Plains State School in Cecil Plains to the north-east and Moonie State School in Moonie to the west. The nearest government secondary school is Cecil Plains State School (to Year 9). There are no nearby schools offering schooling from Years 10 to 12; the alternatives are distance education and boarding school.\nReferences"
    }
  ]
}