{
  "content": [
    {
      "type": "text",
      "text": "# Cavendish, Prince Edward Island\n\n|subdivision_type       = Country\n|subdivision_name       = Canada\n|subdivision_type1      = Province\n|subdivision_name1      = Prince Edward Island\n|subdivision_type2      = County\n|subdivision_name2      = Queens County\n|subdivision_type3      = Parish\n|subdivision_name3      = Greensville\n|subdivision_type4      = Lot\n|subdivision_name4      = Lot 23\n|government_type        =\n|leader_title           =\n|leader_name            =\n|leader_title1          =\n|leader_name1           =\n|leader_title2          =\n|leader_name2           =\n|leader_title3          =\n|leader_name3           =\n|leader_title4          =\n|leader_name4           =\n|established_title      =\n|established_date       =\n|established_title2     =\n|established_date2      =\n|established_title3     =\n|established_date3      =\n|area_magnitude         =\n|area_total_km2         =\n|area_total_sq_mi       =\n|population_as_of       =\n|population_footnotes   =\n|population_note        =\n|population_total       =\n|population_metro       =\n|population_urban       =\n|population_density_km2 =\n|population_density_sq_mi =\n|timezone               = Atlantic (AST)\n|utc_offset             =\n|timezone_DST           =\n|utc_offset_DST         =\n|elevation_m            =\n|elevation_ft           =\n|website                = http://cavendishbeachpei.com/\n|postal_code_type       = Canadian Postal code\n|postal_code            = C0A 1N0\n|area_code              = 902\n|blank_name             = NTS Map\n|blank_info             = 011L06\n|blank1_name            = GNBC Code\n|blank1_info            = BAAQT\n|footnotes              =\n}}\nCavendish is an unincorporated rural community in the township of Lot 23, Queens County, Prince Edward Island, Canada.\nThe community's primary industries are tourism and agriculture supporting a very small year-round population. Cavendish is the largest seasonal resort area in Prince Edward Island with an average daily population in the months of July and August of approximately 7,500 residents. It was also home to Lucy Maud Montgomery, writer of Anne of Green Gables (1908). She said she loved sitting by a window and writing while looking out the windows onto the fields of Cavendish, which was the inspiration for the book's setting of Avonlea.\nGeography\nCavendish is located northwest of North Rustico and east of Stanley Bridge in the central part of the province on the north shore, fronting the Gulf of St. Lawrence. Administratively, it is part of the Resort Municipality of Stanley Bridge, Hope River, Bayview, Cavendish and North Rustico ().\nHistory\nCavendish was founded in 1790 by three families who emigrated from Scotland – the MacNeils, the Clarks and the Simpsons. Lacking a harbour, Cavendish was primarily a small farming community throughout the 19th and first half of the 20th centuries.\nCavendish traces its name to Field Marshal Lord Frederick Cavendish (son of the 3rd Duke of Devonshire), Colonel of the 34th (Cumberland) Regiment of Foot.  It was likely given by local resident William Winter, an ex-British Army officer, who named the community in honour of his patron.\nAuthor Lucy Maud Montgomery was born in nearby New London during the late Victorian era, and after her mother's death was brought to Cavendish to be raised in the home of her maternal grandparents, who had a house and small farm immediately east of the Cavendish United Presbyterian Cemetery at the intersection of the Cavendish Road and Cawnpore Lane.  Montgomery would also frequently visit her cousins, the MacNeill family, who owned a farm named Green Gables located west of the intersection.  She would later find work in the community with the federal Post Office Department as a postmaster at the Cavendish Post Office.  Montgomery's experiences in the community formed a strong impression on her and she would later include much of her experiences in this part of rural Prince Edward Island at the turn of the 20th century in the literary blockbuster Anne of Green Gables and subsequent works.\nPrior to Montgomery's writings, Cavendish's primary claim to fame came on July 22, 1883, when the three-masted world-record holding clipper ship Marco Polo grounded and broke apart on Cavendish Beach.\nFollowing the critical acclaim of Montgomery's writing, as well as coincident with the increase in vehicle-based tourism throughout North America during the first half of the century, Cavendish began to evolve into primarily a resort community.\nIn 1937, Prince Edward Island National Park was established along 60 kilometres (40 miles) of the province's Gulf of St. Lawrence shoreline – part of the park expropriation also included the MacNeill family's Green Gables farm.  The national park also boasted many of Prince Edward Island's best beaches, of which Cavendish Beach was one of the most popular.  To increase the tourist draw to the area, the national park also developed an 18-hole golf course and opened the Green Gables farmhouse for tours. The site of Montgomery's childhood home is also a popular tourist destination.\nSubsequent development between the 1950s-1990s saw motels, campgrounds, amusement parks and other attractions, shopping facilities, and bars and restaurants built.  During any given week in July and August, the community's population expands as tens of thousands of tourists flock to the national park and local attractions.\nIn 1990, Cavendish became part of the Municipality of Stanley Bridge, Hope River, Bayview, Cavendish and North Rustico.\nmuseum ]]\n]]\nPoints of interest\n* Cavendish Beach - A beach located in Prince Edward Island National Park.\n* Prince Edward Island National Park - One of Canada's national parks containing Cavendish Beach.\nIn popular culture\nCavendish is a 2019 CBC sitcom set in this rural area.\nReferences\nExternal references\n*[http://www12.statcan.ca/english/Profil01/CP01/Details/Page.cfm?Lang=E&Geo1=CSD&Code1=1102045&Geo2=PR&Code2=11&Data=Count&SearchText=Cavendish&SearchType=Begins&SearchPR=01&B1=All&Custom= Cavendish Statistics]\n*[http://www.electricscotland.com/history/articles/cavendish.htm Cavendish History at ElectricScotland.com]\n*[http://www.peionline.com PeiOnline.com], PEI Online Tourism Information\nExternal links\n*\n* [http://www.gov.pe.ca/placefinder/index.php3?city=cavendish Government of PEI Profile]\npl:Cavendish"
    }
  ]
}