{
  "content": [
    {
      "type": "text",
      "text": "# Cebu Queen City United F.C.\n\n|dissolved =\n|ground   =\n|chairman =\n|mgrtitle = Head coach\n|manager  =\n|league   = UFL Division 2\n|season   = 2013\n|position = UFL Division 2, Disqualified\n|pattern_la1=_blueborder|pattern_b1=_vneckblue|pattern_ra1=_blueborder|pattern_sh1=FFFF00|pattern_so1=_2_stripes_white\n|leftarm1=FFFF00|body1=FFFF00|rightarm1=FFFF00|shorts1=FFFF00|socks1=0247FE\n|pattern_la2=_yellowborder|pattern_b2=_vneckyellow|pattern_ra2=_yellowborder|pattern_sh2=0174DF|pattern_so2=_2_stripes_white\n|leftarm2=0174DF|body2=0174DF|rightarm2=0174DF|shorts2=0174DF|socks2=0247FE\n}}\nCebu Queen City United Football Club was a Filipino association football club based in Cebu City, Philippines. It was founded in 2011 and affiliated with Cebu Football Association.\nHistory\nEntry to the United Football Cup\nThe club was founded last 2011 to compete in the UFL Cup by Ricky Dakay as a manager with Glenn Quisido and Raffy Musni of Cebu Amateur Football Club (CAFC). The team members came from various clubs of Cebu.\nThe first match of the club was scheduled on 9 October 2011, however, it was postponed due to the unplayable pitch from heavy rains.\nThe Cebuanos asked the league to find another venue for their game considering that the team had spent money to bring the whole team to Manila for the weekend. The game was moved to the Alabang Country Club, but Pachanga FC, which was informed about the change, refused to play as its players were not anymore available. The management filed a protest in the UFL against its first round foe in the UFL Cup Pachanga for its alleged no-show in the opening round at the Alabang Country Club. The league officials sent a letter to Mr. Ricky Dakay that the United Football League (UFL) has dismissed the complaint filed by Cebu Queen City United Football Club (QCUFC) asking that its scheduled opponent last Sunday be declared in default. As a consideration, the UFL said that it will try to make arrangements that the cancelled match be played in Cebu so that QCUFC need not spend for travel to Manila.\nThe club debut in the cup with a loss to Global, 3–0, in their group stage battle.\nOn 22 October 2011, the club was defeated by Stallions, 8–0, in the first ever football match aired live on national television that featured a Cebu club.\nTheir debut season in the Division 2 of the league ended in third place behind champions Pachanga F.C. and runners-up Diliman F.C.\n2013 season\nThe club represents the Cebu Football Association in the 2013 PFF National Men's Club Championship after winning the 14th Aboitiz Cup Men's Open. However, their campaign lasted only until the knock out stage where they were eliminated by archrivals Pachanga Diliman in a 1–3 scoreline.\nThe club opted not to attend their matches against Dolphins United and Manila All-Japan in the 4th season of UFL since they requested a home and away game. And on 1 March 2013, the UFL management has officially ruled out the club from participating after it apparently withdrawn when the request for home games was turned down by the league. The team was later disbanded.\nRecords\n{|class=\"wikitable\"\n! Season\n! Division\n! Tms.\n! Pos.\n!PFF NMCC\n!UFL Cup\n!AFC PC\n|-\n|colspan=5 align=center|Not part of the league yet\n|align=center|Group stage\n|align=center|—\n|-\n|align=center|2012\n|align=center|2\n|align=center|12\n|align=center bgcolor=#deb678|3rd\n|align=center|—\n|align=center|Not enter\n|align=center|—\n|-\n|align=center|2013\n|colspan=3 align=center|Withdrew\n|align=center|Round of 16\n|align=center|TBD\n|align=center|—\n|}\n;Key\n*Tms. = Number of teams\n*Pos. = Position in league\n*TBD  = To be determined\n*DNQ  = Did not qualify\nNote: Performances of the club indicated here was after the UFL created (as a semi-pro league) in 2009.\nHonors\nDomestic competitions\n* '''Aboitiz Cup Men's Open'''\n** Winners (1): 2012\nReferences"
    }
  ]
}