{
  "content": [
    {
      "type": "text",
      "text": "# Cedric Kushner Promotions, Ltd. v. King\n\nCedric Kushner Promotions, Ltd. v. King, 533 U.S. 158 (2001), was a United States Supreme Court case concerning the extent to which the Racketeer Influenced and Corrupt Organizations Act (RICO) applied to certain types of corporation-individual organizations. In this case, the Court decided unanimously to apply it to respondent Don King.\nBackground\nCedric Kushner Promotions, Ltd., a corporate promoter of boxing matches, sued Don King, the president and sole shareholder of a rival corporation, alleging that King had conducted his corporation's affairs in violation of RICO. RICO makes it \"unlawful for any person employed by or associated with any enterprise... to conduct or participate... in the conduct of such enterprise's affairs through a pattern of racketeering activity.\" The District Court dismissed the complaint. In affirming the decision, the Second Circuit Court of Appeals held that RICO applies only where a plaintiff shows the existence of two separate entities, a \"person\" and a distinct \"enterprise,\" the affairs of which that \"person\" improperly conducts. The court concluded that King was part of the corporation, not a \"person,\" distinct from the \"enterprise,\" who allegedly improperly conducted the \"enterprise's affairs.\"\nOpinion of the Court\nJustice Stephen Breyer wrote the decision of the Court, which unanimously reversed the appellate court. The Court held that \"the need for two distinct entities is satisfied; hence, the RICO provision... applies when a corporate employee unlawfully conducts the affairs of the corporation of which he is the sole owner -- whether he conducts those affairs within the scope, or beyond the scope, of corporate authority.\" \"The corporate owner/employee, a natural person, is distinct from the corporation itself, a legally different entity,\" Justice Breyer wrote. \"A corporate employee who conducts the corporation's affairs through an unlawful RICO 'pattern... of activity,' uses that corporation as a 'vehicle' whether he is, or is not, its sole owner.\" Under this reading of the statute, the Court of appeals' decision was reached in error; the case was sent back to them for future disposition of the case.\n}}\nExternal links\n*\n| courtlistener =https://www.courtlistener.com/opinion/1268548/cedric-kushner-promotions-ltd-v-king/\n| justia=https://supreme.justia.com/cases/federal/us/533/158/\n| loc =http://cdn.loc.gov/service/ll/usrep/usrep533/usrep533158/usrep533158.pdf\n| oyez =https://www.oyez.org/cases/2000/00-549\n}}"
    }
  ]
}