{
  "content": [
    {
      "type": "text",
      "text": "# CellFactor: Psychokinetic Wars\n\n|UK|May 29, 2009|NA|June 4, 2009}}Xbox 360}}Windows}}\n| genre = First-person shooter\n| modes = Single-player, multiplayer\n| platforms = PlayStation 3, Xbox 360, Microsoft Windows\n}}\nCellFactor: Psychokinetic Wars is a 2009 first-person shooter video game developed in Egypt by Timeline Interactive and Immersion Games and published by Ubisoft for the PlayStation 3, Xbox 360 and Microsoft Windows.\nGameplay\nCellFactor: Psychokinetic Wars is a science fiction first-person shooter. The player can choose between three classes, each with their own strengths and weaknesses. The Guardian is specialized in guns only and the Bishop is specialized in using telekinetic superpowers, while the Black-op is balanced in both. Some of the powers are telekinesis, teleportation and generating energy shields. Players may complete challenges based upon the class they chose which can improve the powers of that class.\nGame modes\nThere are 10 different challenges for each of the 3 classes available, and can be used for gathering character upgrades. CellFactor: Psychokinetic Wars offers game modes that can be played by up to 12 players including Deathmatch, Team Deathmatch, Capture the Flag, and Assault. In the Assault mode for example, attacking players is done through hacking the enemy's base and having to hold the fort for a set time. There are seven maps that range from open environments to closed quarters.\nReception\nCellFactor: Psychokinetic Wars has received mixed reviews and has an aggregate score of 70/100 on Metacritic. IGN gave the game an 8/10, commenting that \"it's trying to be Unreal Tournament, but there are a few wonky elements that keep it from reaching that high a level of quality\" but praised the graphics for being \"one of the better looking XBLA titles.\" The former statement was echoed by GameSpot, which commented that \"You get what you pay for with this budget first-person shooter\", citing poor level design, a lack of general polish, and the game being dated, as the reason for their lower score.\nSee also\n* CellFactor: Revolution\nReferences"
    }
  ]
}