{
  "content": [
    {
      "type": "text",
      "text": "# Centric Software\n\n}}\n. -->\n| romanized_name =\n| former_name =\n| type = Private\n| traded_as =\n| ISIN =\n| industry = Software Development\n| genre =\n| fate =\n| predecessor =\n| successor =\n| founded =\n| founder =\n| defunct =\n| hq_location_city = Campbell, California\n| hq_location_country = United States\n| num_locations =\n| num_locations_year =\n| area_served =\n| key_people =\n| products =\n| brands =\n| production =\n| production_year =\n| revenue =\n| revenue_year =\n| operating_income =\n| income_year =\n| net_income =\n| net_income_year =\n| aum =\n| assets =\n| assets_year =\n| equity =\n| equity_year =\n| owner =\n| members =\n| members_year =\n| num_employees =\n| num_employees_year =\n| parent =\n| divisions =\n| subsid =\n| module =\n| ratio =\n| rating =\n| website = https://www.centricsoftware.com/\n| footnotes =\n| intl =\n}}\nCentric Software is a Silicon Valleybased software company headquartered in Campbell, California. The company provides product life-cycle management (PLM) and AI software globally, as well as planning, pricing and market intelligence, product information management, digital asset management, and e-commerce products.\nThe company's website reports working with companies such as LVMH, Guess, Auchan, asics, Camper, Sephora, Ajinomoto, Bestseller among other consumer good sectors.\nHistory\nCentric Software was founded in 2004. The company began as a product lifecycle management vendor, developing configurable out-of-the-box products for the fashion industry, designed to support users without custom coding.\nIn 2010, Centric introduced its first mobile application, Capture it, which uploads images to the PLM system.\nIn 2013, the company developed The Adobe Connect tool, that allows designers to use Adobe Illustrator while staying integrated with the PLM system.\nIn 2017 Centric’s REST API launched, allowing integration between Centric PLM and external systems such as ERP and digital asset management, enabling data connectivity and the development of custom applications for organisations. The same year, it launched an artificial intelligence powered PLM tool, AI Image Search.\nIn 2018, Centric began to add 3D connectors that integrate Centric PLM with applications including Browzwear, Optitex and CLO 3D.\nIn 2019, Centric launched PLM for original equipment manufacturer and original design manufacturer manufacturers.\nIn 2020, Centric expanded into the food and beverage and the cosmetics and personal care areas.\nCentric Software acquired retail planning provider, [https://markets.businessinsider.com/news/stocks/centric-software-acquires-armonica-retail-1031012004 Armonica Retail in 2021]. This was followed by the acquisition of market intelligence software company StyleSage in 2022 and the predictive pricing software provider aifora, in 2023. Most recently, it acquired both Contentserv and ShoppingFeed, a PIM and DAM platform that helps brands manage and distribute product content across channels.\nIts parent company is Dassault Systèmes.\nProducts\nCentric Software has integrated 3D, mobility, AI, cloud, SaaS, and Agile Development to develop their products.\nCentric PLM: Centric Software’s original PLM product, focused on design, development and sourcing for the consumer goods industry.\nCentric Planning: a cloud-based, AI-powered system that provides integrated financial, merchandise, product portfolio, store and vendor planning capabilities to support pre- and in-season execution, retail advice, wholesale and SKU inventory.\nCentric Pricing and Inventory: predicts how much customers will buy, when, where and at what price. It can calculate merchandise and pricing across product lifecycle to support data-driven planning.\nCentric Market Intelligence: provides insights to competitive product price assortment and consumer trends insights, resulting in  visibility of what competitors are doing.\nCentric Visual Boards: interactive visual pivot tables that combine data with 2D and/or 3D images to collaborate on assortment planning, and make range and category management decisions.\nCentric PXM: is an AI-powered experience management product that works with PIM, DAM, content syndication, and digital shelf analytics to refine product marketing and brand performance across channels.\nSee also\n* Dassault Systèmes\n* Product life-cycle management (marketing)\nReferences"
    }
  ]
}