{
  "content": [
    {
      "type": "text",
      "text": "# Centre for Lusophone and European Literatures and Cultures\n\n|}}\nThe Centre for Lusophone and European Literatures and Cultures of the Faculty of Letters, University of Lisbon (CLEPUL) is a research unit of the University of Lisbon based on the Faculty of Letters of the University of Lisbon. CLEPUL was founded by Jacinto do Prado Coelho after the Carnation Revolution, at the time with the designation of Centre for Portuguese Literatures of the Universities of Lisbon. Its main purpose is the promotion and research on literatures and cultures of the Lusophone countries.\nToday, CLEPUL is one of the largest research centres in Portugal, being home for more than 500 researchers, and the research unit with more young researchers in projects and positions of responsibility.\nDue to its established protocols, CLEPUL is part of an institutional network of cooperation for research in several areas of literary science and history of culture, including Portuguese institutions in Lisbon, Porto, Algarve and the Atlantic Islands, namely Madeira, and international institutions, such as in Australia and Canada, while keeping privileged relations with Lusophone countries, namely Brazil, Angola, Mozambique, Cape Verde, São Tomé and Príncipe and Guinea-Bissau.\nCLEPUL currently publishes six periodicals, to disseminate its scientific research results: the Letras Com Vida magazine, making available several previously unpublished and exclusive material from authors and researchers, being part of the Letras Com Vida Movement, which also includes literary gatherings; the Revista Lusitana, a journal on popular traditions established in 1887 by José Leite Vasconcelos; the online publication Machina Mundi; the poetry and literature magazine Golpe d'Asa; the IberoSlavica annuary, dedicated to iberian-Slavonic studies; and the Navegações journal, dedicated to Luso-Brazilian studies.\nCLEPUL's idea is: To assert itself, a society needs a consistent project for culture and science. Manuel Antunes\nInstitutional history\nCLEPUL is one of the oldest Portuguese research units dedicated to literary studies, with the same age as Democracy in Portugal. It was established in 1975 by Jacinto do Prado Coelho. Since 2010, it's integrated in the Faculty of Letters of the University of Lisbon, and funded by the Foundation for Science and Technology (FCT), previously known as the National Board of Scientific Research (JNICT). It's the first national research unit to be directed by a Researcher (from the \"Science\" Program 2008), José Eduardo Franco, since 2012.\nSince its establishment, CLEPUL has been a pioneer in the research of Lusophone literatures, also contributing to its integration in the Portuguese academia as an area of specialization. It was also innovative in the way it combined the filological studies tradition with the newness of the structuralist proposals and sociology of reading.\nIts initial projects dealt with the study of the different Lusophone literatures, such as Portuguese literature, with special emphasis on studies regarding Camilo Castelo Branco, as well as African literature and Brazilian literature, and matters regarding sociology of reading, in a project directed by Jacinto do Prado Coelho.\nThis established route was continued by the centre's following directors and coordinators (Fernando Cristóvão, Maria Lúcia Lepecki, Manuel Ferreira, Alberto Carvalho and Maria de Lourdes Ferraz), establishing CLEPUL in the field of Portuguese R&D units.\nAt the beginning of the new millennium, with the transformation of European cultural policies, and under the direction of Annabela Rita, continued today by José Eduardo Franco, CLEPUL sought to answer to the new challenges by transforming its research horizons: from Literature to Arts, Sciences and Culture in general, from Lusophony to Europe, from essayistic to its articulation with literary and artistic creation, repositioning its scientific and cultural policy strategy and its critical mass.\nThe initial research in Portuguese literature was maintained, with emphasis on Camilo Castelo Branco, Eça de Queirós and Father António Vieira, among other great Lusophone authors, through the publishing of previously unavailable sources and reference works, including complete works of the great figures from the History of Portuguese culture. The interchange of knowledge between Lusophone and European cultures has also been expanded, giving rise to interartistic studies (coordinated by Annabela Rita), to the imaginary of cultural studies (coordinated by José Eduardo Franco), to the studies on interculturality of the iberian world and the Slavonic world (coordinated by Béata Cieszynska), to the studies on the didactics of literature, the work in oral and traditional literatures, and to reflections on entrepreneurship, regarded as one of the drivers of innovation in Portuguese culture.\nIn 2011, CLEPUL changed its name to Centre for Lusophone and European Literatures and Cultures of the Faculty of Letters of the University of Lisbon, while keeping its acronym, in order to preserve its history while embracing its new scientific landscape.\nDirectors\n*Jacinto do Prado Coelho\n*Maria Lúcia Lepecki\n*Manuel Ferreira\n*Maria de Lourdes Ferraz\n*Alberto Carvalho\n*Annabela Rita\n*José Eduardo Franco\nScientific research\nIn 2014, CLEPUL is home for 536 researchers and 110 integrated members, organized in 7 Research Groups:\n*Research Group 1 – Portuguese Literature and Culture\n*Research Group 2 – Portuguese-speaking African Literatures and Cultures\n*Research Group 3 – Multiculturalism and Lusophone cultures\n*Research Group 4 – Literature and Culture in InterArts\n*Research Group 5 – Iberian-Slavonic Interculturality\n*Research Group 6  – Brazil-Portugal: Literature, Culture and Memory\n*Research Group 7  – Cultural Heritage Metamorphoses\nEach Research Group has its associated Pole in other universities, including in Brazil and Angola, gathering experts in Literary science, Linguistics, History, Art History, Cultural studies, Theology, Classical Studies, Archival Science, Law, Anthropology and Sociology, developing in-depth research work in international archives, making CLEPUL the largest Portuguese research unit (R&D) in Human Sciences and with the broadest interdisciplinary and geographical scope in its field. CLEPUL also hosts 6 Laboratories, in order to explore new methodologies and products (digital media, databases, paleography, cultural industries, among others) and 11 Offices, dedicated to specific areas, such as entrepreneurship, literature and journalism, or history, thought and culture of human rights.\nCLEPUL's activities and projects are dedicated to bridge great gaps in Human and Social Sciences, by making available to the public high quality reference works in its field of expertise and complete works of pioneer sources of Portuguese and Lusophone culture and literature, such as works by Manuel Antunes, Mário Martins, Diogo de Teive and Fernão de Oliveira. Recent large scale projects by CLEPUL include The Complete Works of Father António Vieira and the complete pombaline works, both demanded by international scholars for many centuries. Other relevant projects include internationally recognized scientific works and recipient of prizes, such as: Dicionário Temático da Lusofonia [Thematic Dictionary of Lusophony] (2005), Jardins do Mundo [Gardens of the World] (2008), and Dicionário Histórico das Ordens e Instituições Afins em Portugal [Historical Dictionary of Religious Orders and Related Institutions in Portugal] (2010).\nIn the field of essay, other relevant and distinguished works include O Mito de Portugal [The Myth of Portugal] (2000), O Esplendor da Austeridade [Splendour of Austerity] (2011), Arquivo Secreto do Vaticano [Vatican Secret Archives] in 3 volumes (2011), and A Europa segundo Portugal [Europe According to Portugal] (2012). In the field of literary creation, CLEPUL members such as Ana Paula Ribeiro Tavares, Ana Rocha, António Carlos Cortez, Ernesto Rodrigues, Fernando Cristóvão and Miguel Real have already been distinguished for their work.\nOther large scale projects currently underway in CLEPUL in 2014 include the Dicionário Enciclopédico da Madeira [Encyclopedic Dictionary of Madeira], Dicionário dos Antis: História da Cultura Portuguesa em negativo [Dictionary of Antis: History of Portuguese Culture in negative], Dicionário Histórico-Crítico das Heresias [Critical-Historical Dictionary of Heresies], Dicionário Padre António Vieira [Dictionary of Father António Vieira], and Portugal Segundo a Europa [Portugal According to Europe].\nEvents and community\nBesides the international scientific meetings, seminars and congresses frequently promoted by CLEPUL, such as the recent Council of Trento: Restore or Innovate – 450 years of History (2013), the Surrealism(s) in Portugal (2013) ), the International Commemorative Colloquium of the 500 years of Maquiavel’s The Prince (2013), the Homage to Father António Vieira in Coimbra: In the 350 years of the Sermon of Saint Catherine (2013), and the I International Symposium History, Culture and Science from/of Madeira, with the theme What Knowledge(s) for the XXI Century? (2014), other regular cultural events include the Weeks of Iberian-Slavonic Cultural Cooperation (since 2007) and the Luso-Brazilian Conference of Literature for Children and Young People (since 2010), organized in the Faculty of Letters of the University of Lisbon.\nAs a way of linking research activity and the dissemination of research results in the academic environment, CLEPUL promotes the training of young researchers through seminars such as the Scipionic Circle – Young Researchers Academy, and the integration of young researchers in its projects and positions of responsibility.\nCLEPUL has generated dynamics and strategic partnerships with other civil society institutions, such as the International Society for Iberian-Slavonic Studies – CompaRes, the European Institute of Cultural Sciences Father Manuel Antunes, also promoting the creation of a research music band, gathering Lusophone poetry, Ai Deus i u é, and the Vieira Choir. Other institutional partnerships include the Portuguese Society of Authors, through the Letras Com Vida Movement and its gatherings, and with the Portuguese section of Amnesty International, with its human rights research office.\nReferences\nExternal links\n*\n*[https://pt-pt.facebook.com/Aideuseue Ai Deus i u É]"
    }
  ]
}