{
  "content": [
    {
      "type": "text",
      "text": "# Central Philippine University – College of Agriculture, Resources and Environmental Sciences\n\n| students               =\n| postgrads              =\n| academic_staff         =\n| campus                 = * Main Campus (Jaro, Iloilo City)\n* CPU Zarraga Farm and Research Campus – 19.3 hectares (Tuburan Sulbod, Zarraga, Iloilo)\n* Hopevale Agricultural and Extension Land – 95.8 hectares (Hopevale, Tapaz, Capiz)\n| campus_size            =\n| free_label             =\n| free                   =\n| colors                 =\n| mascot                 =\n| other_name             = CPU CARES\n| sports_nickname        = Reapers\n| academic_affiliations  = PAASCU\n| website                = [https://cpu.edu.ph/college-of-agriculture-resources-and-environmental-sciences/ cpu.edu.ph/college-of-agriculture-resources-and-environmental-sciences]\n| logo                   =\n}}\nThe Central Philippine University College of Agriculture, Resources and Environmental Sciences, also referred to as CPU CARES or CPU Agriculture, is one of the academic units of Central Philippine University, a private university in Iloilo City, Philippines.\nHistory\nFounded in 1951 by the American Agriculturist Burl Alba Slocum as the CPU College of Agriculture, it is the first agricultural school established outside of Luzon, and one of the leading schools of agriculture in the Philippines.\nThe college has been recognized as a National Center of Excellence for Agriculture by the Commission on Higher Education (Philippines) (CHED) and has been designated as a Provincial Institute for Agriculture in Panay Island by the said government agency under its arm, CHED-NAFES (National Agriculture and Fisheries Education System). The college's strong research and academic foundations in agricultural sciences, has received numerous citations and awards notably in the fields of invention and development through its affiliated people as alumni.\nCurrently, the CPU CARES has been accredited by PAASCU as Level III and offers undergraduate programs in Agriculture, Agricultural and Biosystems Engineering and Environmental Management. It likewise offers post-graduate academic programs under the CPU School of Graduate Studies.\nRecognition and research\nThe CPU College of Agriculture, Resources and Environmental Sciences (CPU-CARES), has been designated by Commission on Higher Education (Philippines) (CHED) as National Center of Excellence in Agriculture. The said recognition is given to agricultural schools by the said government agency who excelled in all aspects of academic stratums – teaching, research, board exams performances, linkages and publications. CHED has also designated CPU-CARES as CHED-National Agriculture and Fisheries Education System (CHED-NAFES) Provincial Institute of Agriculture for Iloilo and Western Visayas.\nIn the field of scientific studies as a research agricultural school, CPU College of Agriculture, Resources and Environmental Sciences has programs in extension and research in crop science and propagation, Philippine native chicken, aquaculture, green agricultural technology, soils and earth sciences, environmental sciences and resources.\nAttached under the umbrella of the school as centers for research and extension include the – CPU Center for Rice Husk Energy and Technology (CPU-CRHET), CPU Appropriate Technology Center (CPU APPROTECH), CPU Center for Research, Technology Development\nand Commercial Production of Philippine Native Chicken\n(CPU-CRTDCPPNC), and CPU Crop Research Center and Laboratory.\nThe university under the college manages the 95.8 hectares Hopevale Agricultural Land and Research Campus in Tapaz, Capiz, the 19.3 hectares CPU Zarraga Farm and Research Campus in Tuburan Sulbod, Zarraga, Iloilo, and the 7 hectares Leon Experimental Farm which houses the research center for Philippine native chicken, the largest in the country.\nResearch endeavors of CPU-CARES's faculties and students that yielded studies that received prestigious international and national citations and awards. Example of which include Jaime Cabarles, the dean of the college, who won the 2014 CHED Republica Award for Outstanding Research and Publication; and Alexis Belonio, scientist and inventor who was awarded as the first Filipino laureate of the Rolex Award for Enterprise for his invention of low-cost rice husk stove.\nAcademic programs\nThe college offers undergraduate programs duly recognized by the Commission on Higher Education (Philippines) in agriculture and allied sciences.\n* Bachelor of Science in Agriculture\n* Bachelor of Science Agriculture and Biosystems Engineering\n* Bachelor of Science in Environmental Management\nFacilities\nThe CPU College of Agriculture, Resources and Environmental Sciences is housed with its dean and college's office at the 2-story Dr. Lenwood Edge Building (Lenwood Edge Hall) on the main campus. The CPU Center for Rice Husk Energy and Technology, the first in the Philippines, is located in the said building.\nOther facilities and structures under the college on the main campus include the CPU Appropriate Technology Center (CPU APPROTECH), the CPU CARES Study Center and Hall.\nAgricultural research facilities of the college are located off the main campus of CPU – the 90+ hectare CPU Hopevale Agricultural and Research Land in Katipunan, Tapaz, Capiz, is dedicated solely for the institution's research and propagation of crops and plantations that grows in highlands; the 19.3 hectares CPU Zarraga Farm (CPU Zarraga Agricultural Farm and Research Campus) in Zarraga, Iloilo, houses the college's Crop Research Center, Rice Propagation and Development Farm, Pantat (Cat fish) breeding and fishponds, and Banana and Mahogany plantations; the 7 hectares CPU Leon Land houses the Center for Philippine Native Chicken Research and Development; while the 14 hectares Guimaras Land in Guimaras Province and 24 hectares San Rafael Land in San Rafael, Iloilo, are the university and the college's extension land for agricultural plantations.\nAthletic facilities of the college for the Physical Education classes of its students and its athletics team, the CPU CARES Reapers, include the CPU Gymnasium, CPU Swimming Pool, and CPU Track and Field/Big Field, to name a few.\nThe Henry Luce III Library of Central Philippine University, acts as the college's library where it shares with other CPU's schools and colleges.\nFootnotes\nExternal links\n* [https://cpu.edu.ph/college-of-agriculture-resources-and-environmental-sciences/ cpu.edu.ph/college-of-agriculture-resources-and-environmental-sciences/] (Official website of CPU College of Agriculture, Resources and Environmental Sciences)\n*[https://www.facebook.com/CPUCARESStudentCouncil/ facebook.com/CPUCARESStudentCouncil/] (CPU College of Agriculture, Resources and Environmental Sciences Provincial Council Official Facebook page)\n* [http://cpu.edu.ph cpu.edu.ph] (Official website of Central Philippine University)"
    }
  ]
}