{
  "content": [
    {
      "type": "text",
      "text": "# Central bank independence__disambig_1\n\n, NBM gorvernor, whose dismissal in 2023 raised concerns over central bank independence in Moldova]]\nCentral bank independence refers to the degree of autonomy and freedom a central bank has in conducting its monetary policy and managing the financial system and inflation targeting. The purpose of central bank independence is to maintain price stability, enhance the effectiveness of monetary policy, and ensure the stability of the financial system. Independent central banks have more credible and effective commitments to price stability. It is a key aspect of modern central banking, and has its roots in the recognition that monetary policy decisions should be based on the best interests of the economy as a whole, rather than being influenced by short-term political considerations.\nHistory\nEarly concepts (1920s)\nThe concept of central bank independence emerged in the 1920s following the economic disruptions of World War I. The Brussels International Financial Conference (1920) was instrumental in establishing the theoretical framework for independent central banking, recognizing that monetary authorities needed autonomy to maintain financial stability.\nPost-World War II era\nThe 1951 Accord between the Federal Reserve and the United States Department of the Treasury marked a significant policy shift. This agreement formally granted the Federal Reserve independence from the Treasury Department, allowing it to pursue monetary policy objectives without direct government interference.\nModern era (1980s-present)\nSince the 1980s, there has been a substantial increase in central bank independence worldwide. This movement was driven by experiences with high inflation in the 1970s and a growing academic consensus on the benefits of independent monetary policy until the 2008 financial crisis. Many countries reformed their central banking laws to enhance institutional independence and establish clear mandates focused on price stability.\nTypes\nFormal vs. actual independence\nFormal independence refers to the legal and institutional provisions that grant autonomy to central banks, including:\n* Statutory mandates and objectives\n* Organizational structure and governance\n* Appointment procedures for leadership\n* Budget autonomy\n* Legal protection from government interference\nActual independence describes the practical autonomy exercised by central banks, considering:\n* Political and institutional environment\n* Relationship with the government\n* Public accountability mechanisms\n* Transparency in operations\n* Historical precedents and traditions\nFunctional categories\nCentral bank independence has several dimensions:\nGoal independence: The ability to set monetary policy objectives, such as inflation targets and target horizon.\nInstrument independence: The freedom to choose operational targets, such as interest rate, exchange rate, and credit restriction controls.\nPersonal independence: Protection for central bank officials from arbitrary dismissal and clear appointment procedures.\nFinancial independence: Control over its budget and access to adequate resources.\nMechanisms and institutions\nGovernance structures\nIndependent central banks typically feature:\n* Fixed terms for governors and board members\n* Staggered appointments to ensure continuity\n* Clear dismissal procedures requiring cause\n* Transparent in monetary policy conduct\n* Public communication of the direction of policy operations\nLegal Frameworks\nMost independent central banks operate under specific legislation that:\n* Defines the bank's mandate and objectives\n* Establishes operational autonomy\n* Provides legal provisions to minimize political interference\n* Sets accountability and reporting requirements\n* Outlines the relationship with fiscal authorities\nCriticisms and limitations\nDemocratic accountability\nCritics argue that central bank independence may conflict with democratic principles by:\n* Removing important economic decisions from elected officials\n* Creating unaccountable technocratic institutions\n* Potentially favoring certain economic interests over others\nPractical constraints\nEven independent central banks face limitations:\n* Coordination challenges with fiscal policy\n* Political pressure during economic crises\n* Limited effectiveness during financial emergencies\n* Potential conflicts between multiple mandates\nGlobal examples\nHigh independence\nFederal Reserve (United States): Features both formal and actual independence with a dual mandate for price stability and full employment.\nEuropean Central Bank: Designed with extensive independence provisions and a primary mandate for price stability across the Eurozone.\nBank of England: Granted operational independence in 1997 with inflation targeting responsibilities.\nLimited independence\n'''People's Bank of China:''' The People's Bank of China is an example of a central bank subject to Chinese Communist Party control (Unified power).\nCentral banks in developing countries: In most developing countries, there is a blend of independence indicators.\nAnother common classification of central bank independence is based on the extent to which the central bank is free from government control. This can be either formal or actual, and ranges from complete independence to full government control, with several intermediate levels in between.\nCommercial bank money creation and central bank independence\nMoney creation process\nCommercial banks create money through the fractional-reserve banking system, where they hold only a fraction of deposits as reserves, meaning deposits exceed reserves.\nCredit creation mechanism\nWhen commercial banks issue loans, they simultaneously create new deposits in the borrower's account, effectively creating new money. This endogenous money creation process means that the majority of money in circulation is created by commercial banks rather than central banks.\nRegulatory framework and central bank control\nCapital adequacy standards\nBasel III and other international banking standards require banks to maintain capital ratios, limiting their ability to create money through excessive lending. These prudential regulations work alongside central bank independence to maintain financial stability while allowing market-driven credit allocation.\nPrudential Supervision\nIndependent central banks may serve as banking supervisors, monitoring commercial banks' money creation activities to prevent excessive risk-taking and maintain systemic stability. This supervisory role reinforces the importance of central bank independence in maintaining both price and financial stability.\nImplications for monetary policy\nPolicy transmission mechanisms\nCentral bank independence becomes particularly crucial when considering how monetary policy affects commercial bank money creation.  Independent central banks can adjust policy rates, reserve requirements, and quantitative easing programs without political interference, ensuring effective transmission of monetary policy through the banking system.\nCredit cycles and macroprudential policy\nThe interaction between central bank policy and commercial bank money creation can lead to credit cycles that may conflict with political preferences. Independent central banks can implement countercyclical macroprudential policies to moderate excessive credit creation during boom periods, even when such policies may be politically unpopular.\nOn 15 July 2025, Donald Trump reportedly penned a letter to dismiss Powell as Fed Chair. However, Trump later denied those reports to reporters at the White House.\nSee also\n* Civil control of the military\n* Civil service independence\n* Editorial independence\n* Fiscal sustainability\n* Judicial independence\n* Independent media\n* Judicial independence\n* Monetarism\n* Monetary sovereignty\n* Open government\n* Retention election\n* Security sector governance and reform\n* Separation of church and state\n* Separation of powers\nFurther reading\n* Cukierman, Alex (1992). Central Bank Strategy, Credibility, and Independence: Theory and Evidence. Cambridge, MA: MIT Press.\n* Alesina, Alberto; Summers, Lawrence H. (1993). \"Central Bank Independence and Macroeconomic Performance: Some Comparative Evidence\". Journal of Money, Credit and Banking 25(2): 151–162.\n* Grilli, Vittorio; Masciandaro, Donato; Tabellini, Guido (1991). \"Political and Monetary Institutions and Public Financial Policies in the Industrial Countries\". Economic Policy 6(13): 341–392.\n* Debelle, Guy; Fischer, Stanley (1994). \"How Independent Should a Central Bank Be?\" in Goals, Guidelines, and Constraints Facing Monetary Policymakers. Boston: Federal Reserve Bank of Boston, pp. 195–225.\n* Crowe, Christopher; Meade, Ellen E. (2008). \"Central bank independence and transparency: Evolution and effectiveness\". European Journal of Political Economy 24(4): 763–777.\n* Epstein, Gerald A., ed. (2019). The Political Economy of Central Banking: Contested Control and the Power of Finance. Cheltenham: Edward Elgar.\nReferences"
    }
  ]
}