{
  "content": [
    {
      "type": "text",
      "text": "# Century Initiative\n\n| logo                     =\n| type                     = Lobby group\n| status                   = Foundation\n| vat_id                   = BN 843519638 RR0001\n| founder                  = Dominic Barton and Mark Wiseman\n| key_people               =\n| area_served              = Canada\n| focus                    = Population growth, immigration\n| headquarters             = 40 King Street West, Suite 5800,\nToronto, ON M5H 3S1\n| revenue                  =\n| expenses                 =\n| endowment                =\n| endowment_year           =\n| num_volunteers           =\n| num_employees            =\n| membership               =\n| Non-profit_slogan        =\n| website                  =\n| footnotes                =\n| formerly                 = Laurier Project Foundation (2009–2011)\n}}\nThe Century Initiative is a Canadian lobby group that aims to increase Canada's population to 100 million by 2100. This includes increasing the population of megaregions, which are interlocking areas with more than one city centre and a typical population of 5 million or more (e.g., the Greater Toronto Area, Greater Vancouver, and the National Capital Region).\nThe Century Initiative was co-founded by Mark Wiseman and Dominic Barton, who also led the Advisory Council on Economic Growth under three-term Prime Minister Justin Trudeau.\nThe Initiative was supported by former Progressive Conservative Prime Minister Brian Mulroney, and by influential Liberal Party advisors including advisors to former Minister of Finance Bill Morneau. The Century Initiative has been listed on Canada's lobbyist registry since 2021 and has organized meetings with the immigration minister's office, the minister's parliamentary secretary, and Conservative and NDP members of parliament.\nHistory\nLaurier Project\nThe Century Initiative was founded in late 2009 as the Laurier Project Foundation by Mark Wiseman and Dominic Barton, who was the head of McKinsey & Company at the time, along with other \"prominent Canadians\".\nInitially, large-scale population expansion and immigration was not the stated goal of the project; rather, the project aimed to bring \"Canada to a position of global leadership through the development and implementation of a major initiative that:\n* \"Successfully convenes Canadian leaders in the public, social, and private sectors to work collaboratively in its achievement;\"\n* \"Catalyzes action to nurture and advance Canada's strengths as a nation by leveraging best practices, scholarly research, and building on the work of active partners on the ground;\" and\n* \"Develops a roadmap for success to drive transformative impact over the long-term.\"\nThe foundation based its aspiration on adapting the titular former Prime Minister Wilfrid Laurier's dream that, \"The 20th Century will be the Century of Canada\" () into the 21st century. Their goal was to define and drive impact through a project for the 21st Century, a project that would define the nation, like the national railway or Confederation itself had defined the country in the 19th Century. Success for this project would be measured by Canadians in the year 2100 saying that the project had helped define the country and had a positive impact on its development in the 21st Century.\nWith this, the foundation's four areas of exploration were: The Arctic, Smart Nation, Virtuous Energy, and \"A Genius for Getting Along.\"\nMany prominent Canadians served on the Laurier Project's board or were advisors to the project, such as Chrystia Freeland, David Naylor, and Nadir Mohamed.\nCentury Initiative\nIn 2011, the project shifted to population expansion; it was later rebranded and reorganized as the Century Initiative.\nIn March 2021, The Globe and Mail hosted a virtual event in partnership with the Century Initiative examining key indicators of the Century Initiative's progress towards growing Canada's population to 100 million by the year 2100.\nThe Century Initiative has also been written about by columnists including Andrew Coyne, Terence Corcoran, and Doug Saunders, who subsequently authored the book Maximum Canada: Why 35 Million Canadians Are Not Enough.\nKey priorities\nCentury Initiative identifies five key \"focus areas\" to guide Canada's long-term growth planning, with the overarching goal of ensuring that Canada remains a stable, prosperous, and democratic society. These focus areas include:\n* Immigration\n* Infrastructure & Environment\n* Economy, Innovation & Entrepreneurship\n* Support for Children and Families\n* Education, Skills & Employment\nEach year, Century Initiative releases an Annual Scorecard, which tracks Canada's progress across these focus areas. This serves as a benchmark for how well the country is preparing for long-term population and economic growth.\nImmigration\nCentury Initiative advocates for maintaining robust immigration levels to address Canada's aging population and declining birth rates. Its leadership has cited the importance of skilled immigrants to Canada's long-term vitality, while aligning population targets with targeted commitments to expand housing, boost productivity, and strengthen health care and services, ensuring that population growth enhances, rather than overwhelms, these vital areas.\nHousing and infrastructure\nThe organization has called for a \"war-time\" effort to build the housing and infrastructure needed to support population growth, with emphasis on removal of municipal roadblocks to construction, legalization of six-plexes, lowering of development costs, and cutting red tape and prioritizing housing near city-led developments such as libraries, community centres and subway stations.\nProductivity\nCentury Initiative stresses the importance of enhancing productivity to secure economic prosperity. It advocates for policies that support innovation, skills development, and long-term economic planning.\nBoard Members\nIn 2024, the 9 official leaders of the Century Initiative group were:\n{| class=\"wikitable\"\n|+\n!Name\n!Position\n!Profile\n|-\n|Lisa Lalande\n|Chief Executive Officer\n|\n*Former Director of the Mowat NFP Centre at the University of Toronto\n|-\n|Mark D. Wiseman\n|Chair of the Board of Directors\n|\n*Co-founder of the Century Initiative\n*Member of the World Economic Forum\n|-\n|Thomas V. Milroy\n|Member of the Board of Directors\n|\n*Former CEO of BMO Capital Markets\n*Heads the family office of one of Canada's wealthiest family\n|-\n|Goldy Hyder\n|Member of the Board of Directors\n|\n*Has led the Business Council of Canada since 2018. The organization, formerly known as the Canadian Council of Chief Executives, says it is composed of representatives from over 170 leading Canadian companies.\n*Former Conservative Party strategist who has been a close associate of Stephen Harper.\n|-\n|Tareq Hadhad\n|Member of the Board of Directors\n|\n*CEO and Founder of Peace by Chocolate\n*EY Entrepreneur of the Year 2021\n*RBC's Top Immigrant Award\n|-\n|Ratna Omidvar\n|Member of the Board of Directors\n|\n*Senator from Ontario since 2016 – Nominated by Justin Trudeau.\n*Originally from India, she lived in Iran until the Islamic Revolution.\n|-\n|Muraly Srinarayanathas\n|Member of the Board of Directors\n|\n*Co-Founder and Executive Chairman of 369 Global\n*Co-Founder and Executive Chairman of Canada's 3 Magazine\n*EY Entrepreneur of the Year 2021\n*RBC's Top Immigrant Award\n|-\n|Stuart Szabo\n|Member of the Board of Directors\n|\n*CEO and Co-Founder of Beacon\n|-\n|Marie-Lucie Morin\n|Member of the Board of Directors\n|\n*Former National Security Advisor to the Prime Minister and Associate Secretary to the Cabinet\n*Served as Deputy Minister for International Trade and Associate Deputy Minister of Foreign Affairs.\n*Member of the Order of Canada\n|}\nControversies and critiques\nMcKinsey & Company involvement\nMultiple founders and affiliates of the organization have been employed by McKinsey & Company, a multinational consulting firm. Due to this, the Century Initiative has been connected to a scandal over McKinsey consulting expenses by Justin Trudeau's government, in which whistleblowers have highlighted McKinsey's large and growing influence over Canadian immigration policy.\nDominic Barton, co-founded Century Initiative when he was the head of McKinsey & Company.\nAleema Jamal, the inaugural executive director of the foundation, was also previously employed by McKinsey.\nIn 2016, four of the organization's five volunteers were employed by McKinsey. Also that year, one third of the initiative's manpower was employed or formerly employed by McKinsey & Company.\nConnections to BlackRock\nThe Century Initiative Board of Directors is chaired by co-founder Mark Wiseman, who was the Global Head of Active Equities of BlackRock and ran Blackrock's Alternative Investment division at the time that the Initiative was founded.\nBlackRock's Alternative Investment division includes the firm's international real estate investment portfolio which could potentially benefit from increased demand for financing of new home construction, and is the subject of the BlackRock house-buying conspiracy theory. The Century Initiative's other co-founder, Dominic Barton, is married to Geraldine Buckingham, BlackRock's Asia Pacific chief, which has previously generated conflict-of-interest concerns.\nRejection by French Canada\nThe idea of expanding the population through immigration is mostly rejected in French Canada, due to concerns that large amounts of immigration could cause the disappearance of the French language in North America and the assimilation of its Francophones. Some critics argue that the Century Initiative is pushing to permanently get rid of Francophones, as Quebec's separate language and culture is thought to be \"problematic\" for the federal government and English Canada. Quebec's premier François Legault is officially opposed to this plan and stated that \"it constitutes a threat to Quebec.\" The Parti Québécois party is opposed to the plan as well.\nMega-regions\nIn the past, Century Initiative envisioned Canada in the year 2100 as a nation of \"mega-regions\", which it defines as interlocking areas with more than one city centre and a typical population of 5 million or more. This idea was the subject of some controversy, and they have since abandoned it.\nWiseman's appointment to Canada-US relations council\nOn March 20, 2025, co-founder Mark Wiseman was appointed to Prime Minister Mark Carney's council of advisors on Canada-US relations. Subsequently, the Century Initiative was criticized by Conservative leader Pierre Poilievre for supporting policy he dubbed as \"radical\".\nNational Scorecard\nCentury Initiative annually publishes a \"National Scorecard\" assessing Canada's growth and prosperity.\nCentury Initiative's 2024 scorecard identified that Canada's path to a prosperous future was threatened by poor performance on critical indicators like housing affordability, investment in infrastructure and climate change.\nThe scorecard focuses on three key areas of insight: planning to grow well, the urgent need for an economic recharge, and creating a world-class future-ready labour and talent pool. Referring to the scorecard as a \"wake-up call\" for Canadian governments and business leaders, Century Initiative highlighted a range of national challenges, including low productivity, insufficient business spending on R&D, lack of access to affordable housing, and a credentials mismatch for newcomers.\nSee also\n*Canadian property bubble\n*Immigration in Canada\n*Lobbying in Canada\n*One Billion Americans\nReferences"
    }
  ]
}