{
  "content": [
    {
      "type": "text",
      "text": "# Central African Republic at the 2000 Summer Olympics\n\nThe Central African Republic competed at the 2000 Summer Olympics in Sydney, Australia. This marked sixth appearance of the nation at a Summer Olympics. The country entered three competitors; Henriette Youanga in the women's individual archery, Mickaël Conjungo in the men's discus throw and Maria-Joëlle Conjungo in the women's 100 metres hurdles. None of those athletes advanced out of their heats.\nBackground\nThe Central African Republic made its debut in the Olympic Games at the 1968 Summer Olympics in Mexico City, Mexico. The country has twice boycotted the Olympic Games, first was because of the inclusion of the New Zealand team at the 1976 Summer Olympics despite the breach of the international sports boycott of South Africa by the nation's rugby union team shortly prior. Then in 1980, the country was one of several who joined in with a United States led boycott over the 1979 invasion of Afghanistan during the Soviet–Afghan War. The highest number of Central African athletes entered in a team for an Olympics is 15, occurring at both the 1988 and 1992 Summer Olympics.\nCompetitors\nThe following is the list of number of competitors in the Games.\n{| class=\"wikitable sortable\" style=\"text-align:center;\"\n|-\n! width=180|Sport\n! width=55|Men\n! width=55|Women\n! width=55|Total\n|-\n| align=left|Archery\n| 0 || 1 || 1\n|-\n| align=left|Athletics\n| 1 || 1 || 2\n|-\n! Total !! 1 !! 2 !! 3\n|}\nArchery\nThe sole archer for the Central African Republic competing in the 2000 Summer Olympics was Henriette Youanga, in the women's individual. She took part in the two ranking rounds on 16 September at the Sydney International Archery Park. She scored 238 and 252 in the ranking rounds; placing 63rd out of the 64 competitors in each round, as well as overall. These rounds were used to allocate archers against each other in the single elimination tournament. Based on the result, Youanga was drawn against Natalia Valeeva of Italy, who had finished second overall in the ranking rounds. The match between the two took place the following day, with Valeeva winning by 166 points to Youanga's 126.\n;Archery\n{|class=wikitable style=\"font-size:90%\"\n|-\n!rowspan=\"2\"|Name\n!rowspan=\"2\"|Event\n!colspan=\"2\"|Ranking round\n!Round of 64\n!Round of 32\n!Round of 16\n!Quarterfinals\n!Semifinals\n!Final\n|-\n!style=\"line-height:1em\"|Round one\n!style=\"line-height:1em\"|Round two\n!style=\"line-height:1em\"|OppositionResult\n!style=\"line-height:1em\"|OppositionResult\n!style=\"line-height:1em\"|OppositionResult\n!style=\"line-height:1em\"|OppositionResult\n!style=\"line-height:1em\"|OppositionResult\n!style=\"line-height:1em\"|OppositionResult\n|-\n|Henriette Youanga\n|Women's individual\n|align=\"center\"|238\n|align=\"center\"|252\n|align=\"center\"|L 126–166\n|align=\"center\" colspan=\"5\"|did not advance\n|}\nAthletics\nThe Central African Republic was represented by two athletes in athletics; Mickaël Conjungo in the men's discus throw and Maria-Joëlle Conjungo in the women's 100 metres hurdles. Mickaël Conjungo, competing in his third Olympic Games, threw a foul in his first throw in the discus, but recorded a distance of  with his second throw. His third throw was shorter, at , so his second throw was counted as the longest for the round. This mean he finished in sixteenth place, ending his appearances at the Games since only the first 12 competitors qualified for the following round.\nMaria-Joëlle Conjungo took part in the 100 metres on 25 September in the second heat. She finished in seventh place with a time of 13.95 seconds; the top six qualified for the following round, four automatically and then those in fifth and sixth place due to finishing among the four fastest runners up overall.\n;Field events\n{|class=wikitable style=\"font-size:90%\"\n|-\n!rowspan=\"2\"|Athlete\n!rowspan=\"2\"|Event\n!colspan=\"2\"|Qualification\n!colspan=\"2\"|Final\n|-style=\"font-size:95%\"\n!Distance\n!Position\n!Distance\n!Position\n|-align=center\n|align=left|Mickaël Conjungo\n|align=left rowspan=\"2\"|Men's discus throw\n|57.85\n|18\n|colspan=2|did not advance\n|}\n;Track events\n{|class=wikitable style=\"font-size:90%\"\n|-\n!rowspan=\"2\"|Athlete\n!rowspan=\"2\"|Event\n!colspan=\"2\"|Heat\n!colspan=\"2\"|Quarterfinal\n!colspan=\"2\"|Semifinal\n!colspan=\"2\"|Final\n|- style=\"font-size:95%\"\n!Result\n!Rank\n!Result\n!Rank\n!Result\n!Rank\n!Result\n!Rank\n|-align=center\n|align=left|Maria-Joëlle Conjungo\n|align=left|Women's 100 m hurdles\n|13.95\n|7\n|colspan=6|did not advance\n|}\nReferences"
    }
  ]
}