{
  "content": [
    {
      "type": "text",
      "text": "# Century of Negro Progress Exhibition\n\nThe Century of Negro Progress Exhibition was a festival from August 16 to September 2, 1963 held in McCormick Place, Chicago, U.S., in honor and celebration of the centennial anniversary of the Emancipation Proclamation (1863) that freed enslaved African Americans.\nHistory\nThe Century of Negro Progress Exhibition was held from August 16 to September 2, 1963, in McCormick Place, Chicago. Exhibits were centered around the contributions of African Americans in twenty-one fields of study, including music, law, labor, and sports. On display was the first draft of the Emancipation Proclamation, with armed guards, and the display of various inventions by African Americans. The American Negro Emancipation Centennial Commission published a booklet for the exhibition.\nThe board of trustees was chaired by James E. Stamps (1890–1972), an economist and civic leader. Stamps was also one of the founders of the Association for the Study of Negro Life and History (ASALH). Alton A. Davis served as the executive director. Leonidas H. Berry received a certificate recognizing his \"promotion of the study of negro history\".\nAt the exhibition Duke Ellington performed a theatrical production called, My People. Martin Luther King Jr. attended the event. Sculptor Richard Hunt displayed his work Hero Construction (1958) at the event.\nMonths later on October 22, 1963, the Chicago Public Schools boycott was held. A similar festival, called Indiana, a Century of Negro Progress Exposition was held on October 25 to 27 in 1963 at the Manufacturers Building on the Indiana State Fairgrounds in Indianapolis.\nSee also\n*World's Columbian Exposition (1893), Chicago World's Fair\n*National Half Century Exposition and Lincoln Jubilee (1915), held in Chicago for the 50th anniversary of the Emancipation Proclamation\n*Century of Progress Exposition (1933), Chicago World's Fair\n*American Negro Exposition (1940), held in Chicago for the 75th anniversary of the Emancipation Proclamation\nReferences"
    }
  ]
}