{
  "content": [
    {
      "type": "text",
      "text": "# Center for the Study of Democracy (St. Mary's College of Maryland)\n\n.]]\nThe Center for the Study of Democracy is a research and education institute at St. Mary's College of Maryland that focuses on the study of the history of emerging democracy in St. Mary's City, Maryland, the site of the state's first colonial capital and the location of many firsts in the development of democratic rights in North America; this work is done in conjunction with studies of modern democracies.\nThe mission of the Center for the Study of Democracy is to draw historical lessons and also inspiration from history, in order to increase understanding of the processes and principles that lead to the constructive maintenance and enhancement of democracy in the United States and around the world.\nIt does so by drawing on in-depth historical research, in conjunction with in-depth research on modern democracy-related issues and events, as they both relate to the process of democratization (establishing and improving democracy in all of its processes).\nThe center also sponsors numerous ongoing public forums and debates and seminars on these issues, many of which are covered by the media.\nThe debates also often include hosting and moderating major political leaders or policy leaders facing off against their opponents.\nThe Center for the Study of Democracy also strives to better understand historic setbacks and inconsistencies in the democratization process of historic Maryland and the United States, in order to better understand how these were eventually overcome; taking lessons from history that can then be applied to study of how democracy might be more constructively furthered today. The center Works in particular to increase understanding of how democracy may be enhanced in spite of the many obstacles that democratization often faces.\nThe center is jointly run by the Public Honors College, St. Mary's College of Maryland and its partner institution and neighbor, Historic St. Mary's City, one of the nation's preeminent historical and archeological research institutions.\nHistory\nThe Center for the Study of Democracy was established in 2002. Such notable people as former U.S. District Court judge Thomas Penfield Jackson, former National Security Adviser Anthony Lake former state Senator J. Frank Raley Jr. and former Maryland Governor William Donald Schaefer were very involved in its founding as well as being advisory board members.\nSo was former Washington Post Editor in Chief Benjamin C. Bradlee.\nAll of these men also served for years on the Board of Trustees of St. Mary's College of Maryland.\nEvents\n, Maryland's first capitol and the home of the Maryland colonial assembly. Stands on the original site. ''Historic St. Mary's City living history area, St. Mary's City Historic District, July 2009.'']]\nThe Center for the Study of Democracy hosts over 25 educational events and/or public forums per year.\nPolitical forums\nThe center hosts forums for state and national politicians on various key issues related to democratic governance, human rights, inclusion, lawmaking and security as it relates to democracy.\nLectures and seminars\nThe center sponsors and also directly provides many academic and also public lectures on both the historical and modern process of democratization. Learning from history (both recent history and older, foundational history) in order to better understand how democracy takes hold, and may be enhanced and spread constructively and effectively.\nCollege educational programs\nThe center provides a minor in Democracy Studies at the St. Mary's College of Maryland. It also hosts numerous seminars and forums available to students.\nIt also provides special visiting lecturers and scholars, as well as providing special lectures to other college classes and programs.\nPatuxent Defense Forum\nThe center also hosts the Patuxent Defense Forum, a gathering of high level experts on international security, including representatives from the academic community, foreign policy leadership, defense industry and military leadership. The purpose of the forum is to increase understanding related to the processes that lead to constructive maintenance and enhancement of democracy from a strategic defense point of view.\nPublic Lectures\nThe center also sponsors and hosts public lectures on areas of study related to its mission:\n* Peter S. Carmichael, Civil War Expert, Lecture on Slavery and the Civil War in the South\nResearch\nHistorical research\nThe center supports and engages in research focused on examining the birth and emergence of various aspects of democracy in the earlier history of the state of Maryland and also the wider English speaking world. It then applies lessons and perspectives related to this history to modern day issues tied to the furtherance of democracy, both in the United States and in newly emerging democracies around the world.\nContemporary research\nExtensive research is also done on issues related to the emergence of democracy in countries where it never previously existed or persisted; enhancement and furtherance of democracy in developed nations as well as furtherance of minority and women's participation in democracy worldwide.\nNational Public Radio\nOn Maryland and Washington, D.C. public radio, the Center for the Study of Democracy is often sought out for expert commentary.\nFunding\nThe Institution is both publicly and privately funded. It is nonprofit and under the joint operation of the Public Honors College, St. Mary's College of Maryland (a Maryland state public school) and Historic St. Mary's City Maryland (a state research, historic interpretation and educational agency).\nThe organization has been funded by the National Endowment for the Humanities. It also has a history of gaining funding from other major granting institutions.\nDirectorship\nThe current director of the center is Dr. Antonio Ugues Jr., a professor of Political Science at St. Mary's College of Maryland.\nThe prior director was Todd Eberly, also a professor at St. Mary's College of Maryland as well as being a noted Maryland political commentator. Eberly is often heard on several radio shows and is often quoted by the Washington Post, as well as writing his own columns.\nNotable advisory board members\n*Jon Armajani \tAssociate Professor, Department of Theology, College of St. Benedict and St. John's University\n*Jennifer Cognard-Black \tProfessor of English, St. Mary's College of Maryland\n*Benjamin Bradlee \tVice President-at-Large of The Washington Post, former President of Historic St. Mary's City Commission, and College Trustee\n*Benjamin L. Cardin \tU.S. Senator and former College Trustee\n*John P. Casciano \tPresident and chief executive officer, GrayStar Associates, LLC\n*Rosann Catalano \tRoman Catholic theologian at the Institute for Christian and Jewish Studies\n*Kenneth Cohen \tAssistant Professor of History, St. Mary's College of Maryland\n*Helen Ginn Daugherty \tProfessor of Sociology, St. Mary's College of Maryland\n*Alan Dillingham \tProfessor of Economics, St. Mary's College of Maryland\n*Joseph W. Dyer \tFormer Chief Strategy Officer, iRobot\n*Todd Eberly \tAssistant Professor of Political Science and former acting director of the Center for the Study of Democracy\n*Regina Faden \tExecutive Director, Historic St. Mary's City\n*Bonnie Green \tExecutive Director, The Patuxent Partnership and former College Trustee\n*Ronald Hoffman \tExecutive Director, Omohundro Institute of Early American History and Culture at the College of William and Mary\n*Charles Holden \tProfessor of History, St. Mary's College of Maryland Civil War expert\n*The Honorable Steny Hoyer \tU.S. Representative from Maryland, House Majority Leader, and College Trustee\n*Randolph K. Larsen \tAssociate Professor of Chemistry, St. Mary's College of Maryland\n*Steve McMahon \tCo-founder and Partner of Purple Strategies, LLC\n*Zach Messitte \t President, Ripon College and former Director of the Center for the Study of Democracy\n*Bruce Riedel \tSaban Center for Middle East Policy, Brookings Institution\n*Terry Meyerhoff Rubenstein \tFormer Executive Vice President of the Joseph Meyerhoff Family Charitable Funds and former Trustee of St. Mary's College of Maryland\n*Sahar Shafqat \tAssociate Professor of Political Science, St. Mary's College of Maryland\n*Michael Steele \t Former Lieutenant Governor of Maryland\n*Martin E. Sullivan \t Director, Smithsonian National Portrait Gallery; former Director of Historic St. Mary's City\nSee also\n*History of democracy\n*Democratization\n*Minority rights\n*Women's suffrage\n*Religious tolerance\n*History of Maryland\n*Province of Maryland (colonial Maryland)\n*History of slavery in Maryland\n*The American Civil War\n*American Civil Rights Movement\n*Democracy in the United States\n*History of the Middle East\n*History of South Africa\n*Democracy in India\n*Democracy in China\nExternal links\n*[http://www.smcm.edu/democracy/ Center for the Study of Democracy] official website\n*[http://www.smcm.edu/democracy/past-events/ Some of the special programs sponsored by the Center for the Study of Democracy] most are open to the public\n*[http://www.smcm.edu/democracy/upcoming-events/ Upcoming events sponsored by the Center for the Study of Democracy] most are open to the public\n*[http://www.smcm.edu/democracy/publications/ Papers published by the center] free online library run by the Center for the Study of Democracy. Some, but not all of the center's papers are available for online reading.\nReferences"
    }
  ]
}