{
  "content": [
    {
      "type": "text",
      "text": "# Central Woodward Christian Church\n\n| mapframe = yes\n| mapframe-marker = building\n| mapframe-zoom = 12\n| mapframe-caption = Interactive map\n| area =\n| built = 1926\n| architect = George D. Mason\n| architecture = Late Gothic Revival\n| added = August 3, 1982\n| mpsub=Religious Structures of Woodward Avenue TR\n| refnum = 82002896\n| designated_other1 = Michigan State Historic Site\n| designated_other1_link = Michigan State Historic Preservation Office\n| designated_other1_date = April 22, 1993\n| designated_other1_num_position = bottom\n}}\nThe Central Woodward Christian Church, now known as Historic Little Rock Missionary Baptist Church, is a Gothic Revival church located in Detroit, Michigan. It was listed on the National Register of Historic Places in 1993.\nOriginally home of Central Woodward Christian Church, a Metro-Detroit congregation affiliated with the Christian Church (Disciples of Christ), it was sold to Little Rock Missionary Baptist Church when the original congregation relocated to Troy, Michigan.\nBuilding\nThe church is built in a classic Gothic Revival style from Indiana limestone, and has a slate roof, copper trim, and stained glass windows. The stained glass windows are a distinguishing feature of the building. Some were installed by the original Disciples of Christ congregation. A. Kay Herbert designed two windows, one window depicting George Washington and the other showing Abraham Lincoln holding the Emancipation Proclamation. In the 1990s, the Little Rock congregation began installing more windows to replace the previous clear glass ones. Perhaps the best known of these windows is the African American Pulpit window depicting the Reverend Richard Allen, the founder of the African-Methodist-Episcopal church, Dr. Martin Luther King Jr., Reverend Jesse Jackson, Reverend C. L. Franklin, and Reverend James Holley, pastor of the Little Rock congregation.\nHistory of the church\nThe Disciples of Christ came to Detroit in 1846, as a church was founded by Reverend William Nay. By the 1890s, the congregation had grown enough to construct a large church in downtown Detroit. In 1926 two Detroit congregations, Central Christian Church and Woodward Christian Church merged under the leadership of Dr. Edgar Dewitt Jones. Jones had been called to serve as pastor of Central Christian Church in 1920, and became pastor of the merged congregation in 1926. In 1928 a new building was constructed at the site of the previous Woodward Avenue Church to house the growing and influential congregation. They hired architect George Mason to design the building, which was opened in 1928.\nIn the late 1970s, after the congregation moved from Detroit to the northern suburb of Troy, the church built another building at 3955 West Big Beaver Road in Troy, retaining the name Central Woodward Christian Church (Disciples of Christ). The congregation has had several pastors since its move to Troy. In July 2008, Dr. Robert Cornwall became the ninth called pastor to serve the church.\nIn 1978, the building at 9000 Woodward was sold to Little Rock Missionary Baptist church, a primarily African American congregation founded in 1938. Today the church is known as 'The Historic Little Rock Baptist Church'. A State of Michigan historical marker commemorates the church.\nReferences"
    }
  ]
}