{
  "content": [
    {
      "type": "text",
      "text": "# Center for Media and Democracy__disambig_2\n\n| extinction    =\n| type          = Nonprofit organization\n| status        =\n| purpose       = Investigative journalism and advocacy journalism\n| headquarters  =\n| location      = Madison, Wisconsin, U.S.\n| coords        =\n| region_served = United States\n| membership    =\n| general       =\n| leader_title  = Executive director\n| leader_name   = Arn Pearson\n| main_organ    =\n| parent_organization =\n| affiliations  =\n| budget        =$1.79 million\n| budget_year = 2023\n| num_staff     = 5 (2025)\n| num_volunteers =\n| website       =\n| remarks       =\n| former name   =\n}}\nThe Center for Media and Democracy (CMD) is a progressive nonprofit watchdog and advocacy organization based in Madison, Wisconsin. CMD publishes ExposedbyCMD.org, SourceWatch.org (formerly Disinfopedia), and ALECexposed.org.\nHistory\nCMD was founded in 1993 by progressive writer John Stauber in Madison, Wisconsin. Lisa Graves is the former president of CMD. Author Sheldon Rampton was formerly an editor of PR Watch, once a website that was one of CMD’s main outputs, but now run only as an archive, replaced by exposedbycmd.org.\nIn a report released on April 6, 2006, CMD listed information on 77 television stations that had broadcast video news releases (VNRs) in the prior 10 months. CMD said that in each case the television station actively disguised the VNR content to make it appear to be its own reporting, and that in more than one-third of the cases, the stations aired the pre-packaged VNR in its entirety. In August 2006, the Federal Communications Commission mailed formal letters to the owners of the 77 television stations, asking for information regarding agreements between the stations and the creators of VNRs, and asking whether there was any \"consideration\" given to the stations in return for airing the material.\nIn 2014, CMD merged with The Progressive, a progressive monthly magazine, but separated after six months.\nCMD has investigated and reported on donor-advised funds, referring to such donations as a form of \"dark money\". According to the Capital Times of Madison, Wisconsin, CMD is a recipient of donor-advised funds via the Schwab Charitable Fund.\nCharacterization\nThe New York Times referred to CMD as a watchdog organization. The Washington Post described CMD as \"a liberal organization that tracks the use of public relations by corporations and politicians.\" A May 2012 article in Isthmus, an alternative weekly newspaper based in Madison, Wisconsin, referred to CMD as an \"activist group\". A Milwaukee Journal Sentinel political columnist referred to CMD as \"left-wing\" and \"liberal\". CMD was referred to as \"uber-liberal\" by the conservative news website Watchdog.org. CMD has been referred to as a \"liberal advocacy group\" by The Des Moines Register, the St. Louis Post-Dispatch, the Wisconsin State Journal, and the La Crosse Tribune.\nCMD disputes the characterization of \"liberal\" and describes itself as an \"investigative watchdog\".\nOnline projects\nExposedbyCMD\nExposedbyCMD is CMD's investigative reporting website.\nALEC Exposed\nCMD hosts the ALEC Exposed website, which is a wiki focusing on the American Legislative Exchange Council and the political activities of the Koch brothers. The \"ALEC Exposed\" project was featured in the 2012 Bill Moyers documentary film, United States of ALEC.\nSourceWatch\nCMD hosts the wiki SourceWatch, which was established in 2003. According to the project's website, it \"aims to produce a directory of public relations firms, think tanks, industry-funded organizations and industry-friendly experts that work to influence public opinion and public policy on behalf of corporations, governments and special interest groups.\" CMD sets the editorial and security policies under which SourceWatch operates. Unlike Wikipedia, SourceWatch does not require a \"neutral point of view.\"\nFrom 2006 to 2009, SourceWatch hosted Congresspedia, a wiki that was funded by the Sunlight Foundation and intended to document the activities of the United States Congress.\nFunding\nCMD states that it accepts donations from \"individuals and philanthropic foundations through gifts and grants\", but \"no funding from for-profit corporations or grants from government agencies.\" It maintains a partial list of supporters on its website.\nIn a column for Fox News, Dan Gainor wrote that CMD received $200,000 from the Open Society Institute (OSI), a grantmaking network founded by George Soros. CMD stated that it received a grant from OSI \"to continue work on national security issues\".\nFox News reported that in 2011 CMD received $865,000 in donations—$520,000, or 60% of 2011's total revenue—was received from the Schwab Charitable Fund, a donor advised fund which preserves the anonymity of donors by not disclosing individual donor names.\nAccording to the conservative news website Watchdog.org, the Tides Foundation, a foundation known to donate almost exclusively to left-wing organizations, reported giving CMD $160,000 in 2011, but that money did not appear on CMD's tax form 990. When asked why CMD heavily criticizes conservative organizations for not revealing their donors while refusing to name all of CMD's funders, CMD's president Lisa Graves said, \"The question of conservative funders versus liberal funders, I think, is a matter of false equivalency. Quite frankly a number of these (corporate donors) like Koch Industries…they’re advancing not just an ideological agenda but an agenda that helps advance the bottom line of their corporate interests. That’s quite a distinct difference from some of the funders in the progressive universe.\"\nIn June 2014, Politico reported that the Center for Media and Democracy was a recipient of funding through the Democracy Alliance, a network of left-wing donors.\nAwards\nCMD and progressive magazine The Nation shared a September 2011 Sidney Award, an award given by The Sidney Hillman Foundation in recognition of \"socially-conscious journalism\", for \"ALEC Exposed\".\nIn 2012, CMD received an Izzy Award, given by the Roy H. Park School of Communications of Ithaca College for special achievement in independent media, and a Professional Freedom and Responsibility Award, given by the Association for Education in Journalism and Mass Communication, for the \"ALEC Exposed\" project.\nReferences\nExternal links\n*\n* [https://www.sourcewatch.org SourceWatch]\n*"
    }
  ]
}