{
  "content": [
    {
      "type": "text",
      "text": "# Centerville, Delaware\n\n|postal_code_type =\n|postal_code =\n|area_code = 302\n|blank_name = GNIS feature ID\n|blank_info = 213782\n|blank1_name =\n|blank1_info =\n|website =\n|footnotes =\n}}\nCenterville, also known as Centreville, is an unincorporated community in New Castle County, Delaware, United States. Centerville is now known primarily for being the location of Du Pont family estates, as well as several other wealthy business families from nearby Wilmington, and the home of Governor Jack Markell.\nHistory\nThe village developed along the Kennett and Wilmington Pike, which was chartered by the Delaware Legislature in 1811.  The road, now known as Delaware Route 52 or the Kennett Pike, is part of the Brandywine Valley Scenic Byway, a National Scenic Byway. The village was named Centerville as it lay midway between Kennett Square, Pennsylvania and Wilmington. A group of fifteen houses, most of the village, was listed as the Centreville Historic District by the National Register of Historic Places in 1982.  About the same time, three other properties near the village, the Joseph Chandler House, the Carpenter-Lippincott House, and Mt. Airy School No. 27, were separately listed by the NRHP. The Centre Meeting and Schoolhouse had been listed in 1971.\nThe hamlet of Fairville, Pennsylvania, about three miles north on Kennett Pike (Pennsylvania Route 52) developed about the same time as Centerville, and is also listed on the National Register.\nCenterville's population was 110 in 1890, 110 in 1900, and 210 in 1925.\nGeography\nCenterville is located at  on the Pennsylvania state line, 5&nbsp;mi/8&nbsp;km north-northwest of Wilmington. Its elevation is .\nArea attractions\nBrandywine Creek State Park is located just to the SE of the village center. Delaware Museum of Natural History and the Winterthur Museum, Garden, and Library are located just to the south of Centerville, on Delaware Route 52.\nEducation\nCenterville is home to Layton Preparatory School and the Centreville Layton School.\nNotable people\nIsaac Collins, a colonial printer, publisher, bookseller and merchant born in Centerville.\nMichael Spinks, a professional boxer born in St. Louis, MO, Former two-division champion.\nReferences\nExternal links\n*[http://www.centrevillede.info/ Centreville, Delaware homepage]"
    }
  ]
}