{
  "content": [
    {
      "type": "text",
      "text": "# Century (French band)\n\n–\n| label           = Clever, MBP, Carrere, Top Tape, Zafiro, Vidisco\n| publishers      =\n| spinoffs        =\n| spinoff_of      =\n| current_members =\n| past_members    = Jean-Louis MilfordÉric TraissardLaurent CokelaereChristian PortesJean-Dominique SallaberryJean DuperronJohn WesleyPierre GauthéJean-Yves BrardEric TraissardFred PayonneJean-Jacques GrallThomas RichardPhilipp SandersStephen Pisani\n| awards          =\n| website         =\n| module          =\n| module2         =\n| module3         =\n}}\nCentury were a French rock band formed in Marseille in 1979. Led by singer and composer Jean-Louis Milford, Century are best known for their single \"Lover Why\" from the album  ...And Soul It Goes from 1986. In Brazil, \"Lover Why\" was included on the soundtrack to Globo TV soap opera Ti Ti Ti (aired from 1985 to 1986) and \"Gone with the Winner\" was on the soundtrack to Hipertensão (1986–87).\n\"Lover Why\" peaked at No. 1 in France for seven weeks and also in Portugal, while reaching No. 11 in Switzerland. Their second single, \"Jane\" peaked at No. 35 in France.\nMembers\nThe band was composed of Jean-Louis Milford (vocal and keyboards), Éric Traissard (guitar), Laurent Cokelaere (bass), Christian Portes (drums) and a second guitarist, Jean-Dominique Sallaberry. The lyrics of the early successes of the group were all written by Paul Ives. The band split in 1989. Jean-Louis Milford teamed up with lyricist Francis Nugent Dixon, and since 1989 have worked together. After several unsuccessful albums, they produced a double CD in 2006 (Timeless).\nAfter nearly two years of development, working with Walter Clissen in Los Angeles, they entered into the American market with a musical comedy, Seven Stars in Paradise (2012–2013).\n*Jean-Louis \"John\" Milford: vocals, keyboards\n*Jean-Dominique Sallaberry: guitar\n*Eric Traissard: guitar\n*Laurent Cokelaere: bass\n*Christian Portes: drums\nDiscography\nAlbums\n*1986: ...And Soul It Goes\n*1988: Is It Red?\nSingles\n* 1985: \"Lover Why\"/\"Rainin' in the Park\"\n* 1986: \"Jane\"/\"Help Me Help\"\n* 1986: \"Gone with the Winner\"/\"The Day the Water Dried\"\n* 1986: \"Self-Destruction\"/\"Fly Me to the Ground\"\n* 1988: \"This Way to Heaven\"/\"High on the Beam\"\nReferences\nExternal links\n* [https://web.archive.org/web/20071119170146/http://www.teledramaturgia.com.br/tititit.htm TITITI National and International-soundtracks]\n* [https://web.archive.org/web/20071112130957/http://www.teledramaturgia.com.br/hipert.htm Hipertensão : National and International-soundtracks]"
    }
  ]
}