{
  "content": [
    {
      "type": "text",
      "text": "# Central (Cardiff electoral ward)\n\nCentral was the name of an original electoral ward in the centre of the county borough and, from 1905, city of Cardiff, Wales. It elected representatives to the Cardiff County Borough Council and, from 1974, South Glamorgan County Council. The ward ceased to exist in 1996.\nDescription and background\nIn July 1890, following the creation of Cardiff County Borough Council, Central was a new electoral ward created, one of the ten in the county borough. The ward was bordered to the west by the River Taff, to the east by the Taff Vale Railway and to the south by the Great Western Railway line. The Riverside ward lay on the other side of the River Taff, the Cathays ward to the northeast (of the Taff Vale Railway) and the South ward lay to the south.\nBefore the electoral reforms of the 20th century, councillors were elected by burgesses i.e. ratepayers in the ward.\nThe electorate of the Central ward in 1985 was 4217, increasing to 4908 in 1993.\nThe Cathays ward was expanded to incorporate the area of the Central ward in 1996.\nSouth Glamorgan County Council 1973-1996\nIn 1973 elections were held for the new South Glamorgan County Council. The Central ward continued as a ward to this authority, electing two county councillors in 1973, 1977 and 1981, then one county councillor from 1985.\nThe party representing Central changed at every election, from Labour in 1973, to Conservative in 1977, back to Labour in 1981, Liberal in 1985, back to Labour in 1983, then finally Liberal Democrat in 1993.\n1993\nCentral's Liberal Democrat Cllr Rowland stood in the Cathays ward in the 1995 City and County of Cardiff election, but was not successful.\nCardiff County Borough Council 1889-1974\nUntil Cardiff County Borough was superseded in 1974, the three ward councillors took turns to stand down for re-election. Initially (with annual Cardiff elections prior to World War II) on a three-yearly cycle.\n1970\nAt the local elections on 7 May 1970 (the final elections to the county borough council), Labour recovered some ground on the Conservative Party, winning back seats in the city. The Conservative Lady Mayoress, Mary Hallinan, had represented the Central ward for the previous nine years and was the most prominent casualty in the election, losing her seat to Labour's Bill Herbert. Herbert was chairman of the Cardiff United Residents' Association and a leading campaigner against the proposed new hook road.\n}}\n1890&ndash;2\nIn November 1890, following the redistribution of councillors across the ten Cardiff wards, Central (like the South ward having many businesses and non-resident ratepayer voters) lost the long-standing Liberal councillor to the Conservatives. The result was declared from the rear of the Town Hall and the margin was only two votes. Mr Proger, a master plumber by trade, had been a member of the council for the previous 12 years.\nIn 1891 the Conservative candidate also won against the sitting Liberal councillor.\n= retiring ward councillor for re-election\nSuccession\nThe Central ward was replaced from 1974 on the new Cardiff City Council by an expanded Cathays ward. The boundary of Cathays ward expanded to include the city centre (and Castle community). Several of the Central ward councillors on South Glamorgan County Council also represented the Cathays ward concurrently.\nReferences"
    }
  ]
}