{
  "content": [
    {
      "type": "text",
      "text": "# Centre for the Study of Medicine and the Body in the Renaissance\n\n| website                = https://csmbr.fondazionecomel.org/\n| logo                   = B._Logo_Fondazione_Comel_(trasparente).png\n}}The Centre for the Study of Medicine and the Body in the Renaissance (CSMBR) is an international institute of advanced studies in the history of medicine and science based at the Domus Comeliana in Pisa. The centre is the major Italian institution devoted to the medical humanities.\nHistory\nThe CSMBR was established in January 2018 after the endowment of the Institutio Santoriana – Fondazione Comel to carry on the scientific legacy of the Italian physician, scientist, inventor and philosopher Santorio Santori (1561-1636), who introduced the quantitative method to medicine and is reputed the father of quantitative experimental physiology, pursuant to the  will of Prof. Marcello Comel (1902–1996) founder of the institution.\nLocation\nThe premises of the CSMBR are in the Domus Comeliana, former private residence of Marcello Comel, located next to the Leaning Tower in Piazza dei Miracoli.\nOrganisation\nThe CSMBR is run by a committee of scholars that works globally in cooperation with Universities and Research Institutes across the EU, the UK, and the US, namely:\n* University of Exeter;\n* Yale University;\n* Julius-Maximilians Universität Würzburg;\n* Università di Parma;\n* the Studio Firmano for the History of Medicine and Science.\nThe founder and current Director of the CSMBR is the intellectual historian Fabrizio Bigotti while the President is the historian of medicine Vivian Nutton.\nMission\nThe core mission of the CSMBR is to further the values of humanism and the advancement of scientific knowledge as inspired by the intellectual, cultural, and social development of the European Medical Renaissance (1300–1700).\nFundamental Principles\nThe CSMBR community takes inspiration from the principles of Renaissance Humanism, meant as the commitment to acknowledging, respecting, and developing the human potential proper to each individual. In accordance with these principles, central to the CSMBR academic practice is the recovery and revival of classical tradition while the scholarly work at large is intended to allow each individual to form their own opinion, as freely and independently as possible. As a result, the CSMBR neither seeks nor promotes any direct political goal, being constituted as an independent research institute, open to scholars of any nationality, without discrimination of ethnicity, gender, age, political, religious, or sexual orientation.\nPrizes and Publications\nThe Centre provides awards and travel grants, such as the Santorio Award for Excellence in Research, the Santorio Fellowship for Medical Humanities and Science, while encouraging international cooperation through the VivaMente Conference in the History of Ideas.\nIn partnership with Palgrave-MacMillan (Springer) the CSMBR sponsors the series Palgrave Studies in Medieval and Early Modern Medicine (PSMEMM) The series focuses on the intellectual tradition of western medicine as related to the philosophies, institutions, practices, and technologies that developed throughout the medieval and early modern period (500-1800). It seeks to explore the range of interactions between various conceptualisations of the body, including their import for the arts (e.g. literature, painting, music, dance, and architecture) and the way different medical traditions overlapped and borrowed from each other. The series hosts contributions Santorio Awardees and is particularly keen on contributions coming from young authors.\nExternal links\n* [https://csmbr.fondazionecomel.org/ CSMBR website] (consulted 2022-09-20).\nReferences"
    }
  ]
}