{
  "content": [
    {
      "type": "text",
      "text": "# Central Plains War\n\n* Autumn War: September 1929 – summer 1930\n* 2nd main phase: May – November 1930\n| place             = Central, Eastern, and Southern China\n| result            = Nationalist government victory\n* Resignation of Yan and Feng\n* Resumption, then end, of the Warlord Era\n| combatant1        =  Nationalist government of ChinaMaterial support:\n| combatant2        = Warlord coalitions of Yan Xishan, Feng Yuxiang and Li ZongrenMinor factions:Zhang Fakui's armyTang Shengzhi's army\n| commander1        = Chiang Kai-shekHan FujuLiu ZhiHu ZongnanChen ChengTang EnboMa HongkuiMa BufangMax BauerZhang Xueliang (from September 1930)\n| commander2        = Yan XishanFeng YuxiangLi ZongrenBai ChongxiFu ZuoyiZhang FakuiTang ShengzhiWang Jingwei\n| units1            = National Revolutionary Army\n*Chiang loyalist armies\n**\"Basic Army\"\n*Allied warlord armies\n**Yunnan armies\n**Guangdong armies\n**Guizhou armies\n**Northeastern Army (from 1930)\n| units2            = Warlord coalitions\n*Guominjun\n*New Guangxi clique\n**\"Protect the Party, Save the Country Army\"\n*Shanxi Army\n*\"Ironsides\"\n| strength1         = Chiang:240,000+ (1929)295,000 (1930)Allied warlords:Hundreds of thousandsNortheastern Army:409,000 (1930)\n| strength2         =  650,000 (1929) 700,000 (1930)\n| casualties1       = 30,000 killed, 60,000 wounded 150,000\n| casualties2       = 150,000\n| casualties3       = High civilian casualties\n| campaignbox       =\n}}\nThe Central Plains War () was a series of military campaigns in 1929 and 1930 that constituted a Chinese civil war between the Nationalist Kuomintang government in Nanjing led by Generalissimo Chiang Kai-shek and several regional military commanders and warlords who were former allies of Chiang.\nAfter the Northern Expedition ended in 1928, Yan Xishan, Feng Yuxiang, Li Zongren and Zhang Fakui broke off relations with Chiang shortly after a demilitarization conference in 1929, and together they formed an anti-Chiang coalition to openly challenge the legitimacy of the Nanjing government. The war was the largest conflict in the Warlord Era, fought across Henan, Shandong, Anhui and other areas of the Central Plains in China, involving 300,000 soldiers from Nanjing and 700,000 soldiers from the coalition.\nBackground\nRise of Chiang Kai-shek\nCompared to other senior party officials like Hu Hanmin and Wang Jingwei, the political status of Chiang Kai-shek in the Kuomintang (KMT) was lower in the beginning. Chiang began his rise to prominence in 1917 during the Constitutional Protection Movement and the formation of the Guangzhou government, where he displayed his military talent. The turning point came in 1923 when Chen Jiongming launched a rebellion against Sun Yat-sen in Guangzhou. Chiang's role in helping Sun to retreat from Guangzhou ultimately helped him to become Sun's protégé.\nAfter Sun's death in 1925, factions within the Kuomintang began to surface. A power struggle between Chiang and Wang Jingwei led to the split of the KMT. Chiang was able to use his influence as the commandant of the Whampoa Academy and eventually took over the leadership of the party, forcing Wang into exile overseas. In 1926, Chiang was ceremonially chosen as the commander of the newly formed National Revolutionary Army and launched the Northern Expedition. In the course of the expedition, Chiang had managed to form an alliance with warlord armies of Feng Yuxiang, Yan Xishan and Li Zongren.\nReunification of China (1928)\nand the flag of the Republic of China crested on a building in Harbin, Manchuria]]\nThe Northern Expedition ended with the reunification of China in 1928 under the Nanjing government, as Zhang Xueliang declared the allegiance of his Northeast Army to the Nationalist government in Nanjing, following the assassination of his father Zhang Zuolin by the Japanese Kwantung Army. While Chiang emerged as the paramount leader of the Republic of China, the reunification soon ran into issues as different factions in the Kuomintang disagreed over demilitarization at a military conference in 1929. The National Revolutionary Army was reorganized into four army groups after the Northern Expedition, incorporating armies from regional warlords. The First Army Group was formed by the Whampoa clique, alternatively known as the Central Army, which were directly led by Chiang himself. The Second Army Group consisted of elements from Guominjun led by Feng Yuxiang. The Third Army Group was led by Yan Xishan of the Shanxi clique, while the Fourth Army Group were led by Li Zongren of the New Guangxi clique.\nNational Demilitarisation Conference\nOn 1 January 1929, in Nanjing, the National Demilitarization Conference began. The leading figures including Chiang, Yan, Li and Feng gathered to discuss demobilization. Chiang was appointed as chairman, and though the conference did see some successes, it was overall a failure. A 2nd conference was held in August. This August conference divided China into 6 military regions roughly corresponding to the regions of the major warlords (and one for the minor warlords). The new national army was to have 65 divisions of 11,000 men or 715,000 soldiers (not including any personnel above divisional level); this was a large reduction of the 1,502,000 men currently under arms in China. Yan and Feng accused Chiang of attempting to centralise military power under his control and thus remove them from their positions of power.\nSize of Combatant armies\n{| class=\"wikitable\"\n|+Armies of the combatants\n!Armies\n!1929\n!1930\n|-\n|National Revolutionary\nArmy\n|\n|\n|-\n|Chiang Kai-Shek\n|240,000\n|295,000\n|-\n|Pro-Chiang Southerners\n|\n|300,000-400,000\n|-\n|Han Fuju\n|\n|30,000\n|-\n|Zhang Xueliang\n(Northeast Army)\n|200,000\n(neutral)\n|409,000\n|-\n|Total\n|240,000\n|625,000-725,000 initially\n1,034,000-1,134,000\nSeptember 1930\n|-\n|Anti-Chiang Alliance\n|\n|\n|-\n|Feng Yuxiang\n(Guominjun)\n|300,000\n|250,000\n(140,000 deemed reliable)\n|-\n|Yan Xishan\n(Shanxi)\n|\n|181,000\n|-\n|Li Zongren\n(Guangxi)\n|\n|60,000\n|-\n|Other Anti-Chiang\nforces\n|\n|219,000\n(did not participate)\n|-\n|Anti-Chiang Southerners\n|300,000\n|\n|-\n|Zhang Fakui\n(ironsides)\n|\n|95,000\n|-\n|Total\n|600,000\n|586,000 effective\n805,000 paper\n|}\nFirst phase\nFormation of anti-Chiang coalitions, first conflicts\nFeng controlled the provinces of Gansu, Shaanxi and Henan. His partial control of Shandong provided him with large amounts of revenue needed for his military; however this was greatly affected by the fact that there was a famine and rebellion in Gansu. Feng asked Chiang for this territory.\nHunan was controlled by the Guangxi clique (in addition to their other lands); this made the clique a threat to Chiang, who proceeded to appoint his own protege into power in Hunan. This angered the Guangxi clique, who ran Chiang's governor out of office. Chiang did not tolerate this action and prepared for war, while Feng was bribed with offers of large amounts of territory in Shandong for his neutrality. Other Northern Chinese leaders were also bribed for their neutrality so Chiang could focus entirely on the Wuhan armies.\nFollowing the demilitarization conference in 1929, Li Zongren, Bai Chongxi and Huang Shaohong of the Guangxi clique broke off relations with Chiang in March 1929, which effectively started the confrontation between these commanders and the Nanjing government. In May, Feng Yuxiang of the Northwest Army also clashed with Chiang. In November, Li Zongren issued a declaration to form anti-Chiang coalition along with Wang Jingwei. In December, Tang Shengzhi and Zhang Fakui announced their support of the anti-Chiang coalition. The Nanjing government responded by expelling Wang Jingwei from the party for his participation in the anti-Chiang coalition. The coalition created a new KMT government in Beijing to show their defiance of the Nanjing government. In February 1930, Yan Xishan of the Shanxi clique demanded the resignation of Chiang from the KMT, which was refused. Later in the same month, Yan assumed the leadership position in the anti-Chiang coalition, with the assistance of Feng and Li while Zhang Xueliang chose to remain \"loyal\" to Chiang.\nAllies of Chiang Kai-shek\nThe Nanjing government enjoyed support from the Chinese Muslims of the Gansu province in Northwest China. While the region was originally under the sphere of influence of the Northwest Army, influential Muslim leaders including Ma Tingrang, Ma Zhongying and Ma Fuxiang broke off relations with Feng Yuxiang in 1928. Forces of the Chinese Muslims remained loyal to the Nanjing government through the war, diverting forces of Feng away from the Central Plains.\nPreparations for the second phase\nThe anti-Chiang coalition planned their renewed attack on the Nationalist government in Nanjing through different routes. Li Zongren was expected to lead the Guangxi Army from Guangxi and toward Hunan to threaten the stronghold of Chiang in Wuhan. Feng Yuxiang would lead the Northwest Army and march from Henan to Shandong, attacking Xuzhou while also applying pressure on Wuhan. Yan Xishan would lead the Shanxi Army and coordinate with the Northwest Army to strike Xuzhou together, and march toward Nanjing after Xuzhou is captured by the coalition.\nIn response to the preparations, the Nationalists assigned Han Fuqu to set up defense in the southern bank of the Yellow River to counter the Shanxi Army. Main forces of the Nationalists would be stationed in Xuzhou to await for impending offensives.\nSecond phase\nChiang offensives (May – June 1930)\nOn 11 May, the Central Army led by Chiang Kai-shek launched a series of general offensives against Yan Xishan and Feng Yuxiang. Following the Longhai Railway, the Central Army marched westward from Xuzhou, reaching the outskirts of Kaifeng in the Henan province by 16 May. The Northwest Army, being the strongest in the anti-Chiang coalition, crushed the Central Army led by Chen Cheng in Gansu by the end of May, with Chiang having escaped from near capture. The Northwest Army could not capitalize on its victory, however, as the Shanxi Army was unable to arrive on time to deliver further damage to the Central Army. With the allies of Chiang in Gansu province, the Northwest Army turned to defense following the victory. In Kaifeng the Northwest Army repelled attacks by Chiang's forces, inflicting heavy casualties. The combined forces of Shanxi Army and the Northwest Army later engaged in the largest conflict of the war in their attack on Xuzhou, with both sides sustaining combined casualties exceeding 200,000. The Shanxi Army retreated from Jinan and took further losses while crossing the Yellow River. The lack of coordination between forces of the anti-Chiang coalition was the beginning of the tide turning for the Nanjing government.\nChange of tides (June – September 1930)\nIn the southern battlefields the Guangxi Army led by Li Zongren and Bai Chongxi marched northwards and captured Yueyang, but Chiang's forces managed to cut them off from behind, eventually forcing them to withdraw to their home province. In Shandong the Shanxi Army captured Jinan on 25 June. After defeating the Guangxi Army in Hunan, the Nanjing government decided to launch a major counteroffensive against the Shanxi Army in Shandong. Marching from Qingdao, Chiang's forces retook Jinan on 15 August. The Central Army then amassed troops in Gansu and Shaanxi provinces, launching their final offensive against the Northwest Army which lasted from the end of August to the beginning of September.\nNortheast Army intervenes (September – November 1930)\nOn 18 September Zhang Xueliang and the Northeast Army abandoned their neutrality and declared their support for Chiang. Several days later the Northeast Army entered the North China Plain through Shanhai Pass and captured Peking two days later. The Shanxi Army withdrew to the north of the Yellow River, while the Northwest Army collapsed as the morale of the anti-Chiang coalition no longer existed. On 4 November both Yan Xishan and Feng Yuxiang announced their resignations from all of their positions, which effectively ended the hostilities and brought an end to regional challenges against the Nanjing government.\nFile:Northwest Army.jpg|The Northwest Army\nFile:Shanxi Army.jpg|The Shanxi Army\nFile:Chiang Kai-shek's army in the Central Plains War.jpg|The Central Army\nAftermath\nThe Central Plains War was the largest armed conflict in China since the Northern Expedition ended in 1928. The conflicts spread across multiple provinces in China, involving different regional commanders with combined forces of more than one million. While the Nationalist government in Nanjing came out victorious, the conflict was financially costly which had a negative influence on the subsequent Encirclement Campaigns over the Chinese Communist Party.\nAfter the entrance of the Northeast Army into central China, the defense of Manchuria was significantly weakened, which indirectly led to Japanese aggression in the Mukden Incident. While Chiang emerged from the war having consolidated his power as the supreme leader and established himself as an accomplished military commander, the regional factions in the Kuomintang and their rivalries remained unsolved, which led to various problems later in the Second Sino-Japanese War and the Chinese Civil War.\nReferences\nCitations\nBibliography\n*\n*\n*\n*\n*\n*"
    }
  ]
}