{
  "content": [
    {
      "type": "text",
      "text": "# Century Mine\n\n| active years     =\n| closing year     =  2015\n}}\nCentury Mine was a large open cut zinc, lead and silver mine at Lawn Hill,  northwest of Mount Isa in North West Queensland, Australia. It was Australia's largest open pit zinc mine. Discovered by CRA Limited, mining was initiated by Pasminco, continued by Zinifex, then OZ Minerals and then MMG Limited who mined the project until closure. The property was then owned by New Century Resources who were bought by Sibanye-Stillwater in 2023. The mine is in a phase of tailings reprocessing.\nHistory\nThe Century zinc deposit was discovered by CRA Limited in 1990 on Waanyi land. Development of the mine commenced in 1997.  The mine began open-pit production in 1999.\nOpen-pit mining was completed at Century in August 2015, with final processing of Century-sourced ore occurring in November 2015.  The last ore to be processed at Century was 450,000 tonnes that had been mined as part of the Dugald River mine's stoping trial, and then trucked to Century. The processing of this ore was completed in January 2016.  The final shipment of zinc concentrate was exported from Karumba in late January 2016.\nDuring its 16 years of operation, Century was one of the largest zinc mines in the world, producing and processing an average of 475,000 tpa of zinc concentrate and 50,000 tpa of lead concentrate. Mill tailings generated from 16 years of operations from the Century open pit forms a Proven Reserve of 77.3 million tonnes at 3.1% zinc-equivalent, for 2,287,000 tonnes of contained zinc.\nNew Century Resources, an Australian base metals development company, restarted Century Mine operations from August 2018 extracting zinc from the tailings.\nOperations\nZinc and lead concentrates are exported via the port at Karumba on the Gulf of Carpentaria. The zinc ore is especially prized because of its low iron content, producing a high quality clean zinc concentrate that is keenly sought by the world's zinc smelters. The concentrate is mixed with water and transported to the port by a  pipeline.\nSee also\n*List of mines in Australia\n*Mining in Australia\nReferences\nExternal links\n* [https://portal.ga.gov.au/deposit-report/minerals/century/335378 Century Deposit Summary Report]\n* [https://portergeo.com.au/database/mineinfo.asp?mineid=mn075 Century]"
    }
  ]
}