{
  "content": [
    {
      "type": "text",
      "text": "# Century 21 Organisation\n\nCentury 21}}\n*Toy manufacturing\n*Book & comics publishing\n| genre              =\n| predecessor        = AP Films\n| successor          = Century 21 Enterprises\n| founded            = 1962 (name registered)\n| founder            = Gerry Anderson\n| defunct            =\n| fate               = Defunct\n| hq_location        = United Kingdom\n| areas_served       =\n| key_people         =\n*Lew Grade\n*Keith B. Shackleton(head of Merchandising)\n*Louis Benjamin(head of Records)\n*Jack Rosenthal(head of Toys)\n*Alan Fennell(head of Publishing)\n| products           =\n| brands             =\n| services           =\n| owner              =\n| num_employees      =\n| num_employees_year =\n| parent             = Associated Television\n| subsid             =\n*Century 21 Productions\n*Century 21 Merchandising\n*Century 21 Records\n*Century 21 Toys\n*Century 21 Publishing\n}}\nThe Century 21 Organisation was a group of companies founded by Gerry Anderson in the early 1960s to expand on his television production company, AP Films (APF; later Century 21 Productions). In addition to APF, the group included:\n*a property licensing company, AP Films Merchandising (established in 1960 as an APF subsidiary, later renamed Century 21 Merchandising);\n*a record label, Century 21 Records (established in 1964) – a joint venture with Pye Records, producing soundtracks and tie-in audiobooks;\n*a toy manufacturer, Century 21 Toys (established in 1966) – formed by Century 21's acquisition of J. Rosenthal Toys;\n*a publishing company, Century 21 Publishing or Century 21 Publications (established in 1966). In partnership with City Magazines, it created the comics titles TV Century 21 and Lady Penelope, among others. It also published tie-in novels through Armada Books.\nMost of the companies' activities were marketing of products created by Century 21 Productions — in particular the TV series Thunderbirds, Captain Scarlet and the Mysterons and Joe 90, although some spin-off media were based on characters and machines from other media franchises, often connected to Lew Grade's ITC Entertainment.\nHistory\nThe various \"Century 21\" brands predate Century 21 Productions — immediately following completion and the first TV screening of Thunderbirds, AP Films was renamed Century 21 Productions to align it with its growing merchandising sister companies Century 21 Merchandising, Century 21 Toys, Century 21 Records, and Century 21 Publishing.\nBy around 1969, the merchandising, toys and publishing arms were under the control of a new entity, Century 21 Enterprises. At the same time, Century 21 Productions had become financially over-stretched. Within a few months, the company had shut down its three warehouse-sized studios on the Slough Trading Estate.\nCentury 21 Publishing\nFrom 1965 to 1969, Century 21 Publishing partnered with the published City Magazines to produce weekly comics titles based on Anderson's Supermarionation properties. Century 21 packaged the comics, hiring the editors, writers and artists, which were then printed and distributed by City Magazines. The imprint's most prominent and long-running titles were TV Century 21 (later known as TV21) and Lady Penelope; three other related titles — Solo, TV Tornado, and Joe 90 Top Secret — eventually merged into TV21.\nCentury 21 Merchandising acquired a line of plastic science fiction toys manufactured in Hong Kong, which they marketed under the name Project SWORD.  Although not based on Anderson's creations, Project Sword did feature in two series of comic strips and text stories published by City Magazines/Century 21 Publishing. The only Anderson craft made by the line was a model of Zero-X, the spacecraft which first appeared in the film Thunderbirds Are Go. A comic strip series based on the toys appeared in the short-lived comic Solo. After Solo was merged into TV21, a second series of stories — text, illustrated by comics artists such as Ron Embleton and Don Lawrence — appeared. The publisher also released a Project SWORD annual, featuring text and comic strips.\nIn June 1969 the entire staff of Century 21 Publishing were given a month's notice. A small nucleus of staff from the disbanded division were taken on by Leonard Matthews and Alf Wallace — the ex-managing editors of Fleetway Juvenile Comics; and Eagle and Odhams' Power Comics line, respectively — who were now operating an independent studio off Fleet Street under the name of Martspress. Martspress packaged the relaunched version of TV21 which soon phased out the Anderson-related content.\nMini-albums by Century 21 Records\nA range of 37 \"mini-albums\" (7-inch EPs) were released under the Century 21 label. These were a combination of original material, with abridgments of TV episodes with linking narration, and soundtracks.\n{| class=\"wikitable sortable\"\n|-\n! width=10% | Issue number !! width=24% | Title !! width=19% | Series !! Notes\n|-\n|  MA100 || Journey to the Moon || Fireball XL5 || Original story. Featuring Steve Zodiac and Venus in 'Project Apollo', with the voices of Sylvia Anderson, John Bluthal, David Graham and Paul Maxwell.\n|-\n|  MA101 || Into Action with Troy Tempest || Stingray || Original story\n|-\n|  MA102 || A Trip to Marineville || Stingray || Original story\n|-\n|  MA103 || Introducing Thunderbirds || Thunderbirds || Original story. A prequel to \"Trapped in the Sky\", in which Lady Penelope visits Tracy Island for the first time. Intended to acquaint potential TV viewers with the series' premise.\n|-\n|  MA104 || Marina Speaks || Stingray || Original story\n|-\n|  MA105 || TV21 Themes ||  || Barry Gray Orchestra musical recording\n|-\n|  MA106 || The Daleks || Doctor Who || Abridged recording of episode 6 of the TV serial The Chase\n|-\n|  MA107 || F.A.B. || Thunderbirds || Original story. While investigating reports of supposed attacks by the legendary Abominable Snowman in the Himalayas, Lady Penelope and Parker are abducted by a disguised Hood. Features an original song, \"The Abominable Snowman\", composed by Barry Gray and sung by Sylvia Anderson and David Graham.\n|-\n|  MA108 || Thunderbird 1 || Thunderbirds || Abridged recording of the TV episode \"Trapped in the Sky\", narrated by Scott Tracy (Shane Rimmer)\n|-\n|  MA109 || Thunderbird 2 || Thunderbirds || Abridged recording of \"End of the Road\", narrated by Brains (David Graham)\n|-\n|  MA110 || The Stately Home Robberies || Thunderbirds || Original story featuring Lady Penelope. A series of burglaries at various British stately homes draws Lady Penelope and Parker into a conspiracy to raid the Tower of London and steal the Crown Jewels.\n|-\n|  MA111 || Lady Penelope Themes ||  || Barry Gray Orchestra musical recording\n|-\n|  MA112 || Thunderbird 3 || Thunderbirds || Abridged recording of \"Sun Probe\", narrated by Alan Tracy (Matt Zimmerman)\n|-\n|  MA113 || Thunderbird 4 || Thunderbirds || Abridged recording of \"Terror in New York City\", narrated by Gordon Tracy (David Graham)\n|-\n|  MA114 || The Perils of Penelope || Thunderbirds || Abridged recording of \"The Perils of Penelope\", narrated by Parker (David Graham)\n|-\n|  MA115 || Topo Gigio in London || Topo Gigio ||\n|-\n|  MA116 || Great Themes from Thunderbirds ||  || Barry Gray Orchestra musical recording\n|-\n|  MA117 || Space Age Nursery Rhymes ||  || Barry Gray Orchestra musical recording\n|-\n|  MA118 || Lady Penelope and Parker || Thunderbirds || Abridged recording of \"Vault of Death\", narrated by Lady Penelope (Sylvia Anderson)\n|-\n|  MA119 ||  Brains and Tin-Tin || Thunderbirds || Abridged recording of \"Desperate Intruder\", narrated by Tin-Tin (Christine Finn)\n|-\n|  MA120 || International Rescue || Thunderbirds || Abridged recording of \"The Impostors\", narrated by Scott Tracy (Shane Rimmer)\n|-\n|  MA121 || Thunderbirds || Thunderbirds || Abridged recording of \"Day of Disaster\", narrated by Gordon Tracy (David Graham)\n|-\n|  MA122 || Lady Penelope || Thunderbirds || Abridged recording of \"The Cham-Cham\", narrated by Parker (David Graham)\n|-\n|  MA123 || Brains || Thunderbirds || Abridged recording of \"Alias Mr. Hackenbacker\", narrated by Brains (David Graham)\n|-\n|  MA124 || Brink of Disaster || Thunderbirds || Abridged recording of \"Brink of Disaster\", narrated by Parker (David Graham)\n|-\n|  MA125 || Atlantic Inferno || Thunderbirds || Abridged recording of \"Atlantic Inferno\", narrated by Gordon Tracy (David Graham)\n|-\n|  MA126 || Ricochet || Thunderbirds || Abridged recording of \"Ricochet\", narrated by Brains (David Graham)\n|-\n|  MA127 || Tingha and Tucker in Nursery Rhyme Time || Tingha and Tucker ||\n|-\n|  MA128 || ''One Move and You're Dead! || Thunderbirds'' || Abridged recording of \"Move – and You're Dead\", narrated by Tin-Tin (Christine Finn)\n|-\n|  MA129 || Thirty Minutes After Noon || Thunderbirds || Abridged recording of \"30 Minutes After Noon\", narrated by Parker (David Graham)\n|-\n|  MA130 || Tingha and Tucker and the Wombaville Band || Tingha and Tucker || Features cover versions of The Beatles songs\n|-\n|  MA131 || Introducing Captain Scarlet || Captain Scarlet and the Mysterons ||\nAn adaptation of the first episode of the TV series, \"The Mysterons\", set during its dénouement, and featuring audio flashbacks with some newly recorded dialogue. The plot concerns Colonel White reporting to a military conference investigating the events of the first episode, surrounding Spectrum's first encounter with the Mysterons and its mission to protect the World President. The story ends with the news that the Mysteron double of Captain Scarlet has returned to life and that the officer's loyalty to Spectrum can be restored with the aid of an advanced computer (a feature of Gerry and Sylvia Anderson's original TV script for the episode, but cut from the final version).\n|-\n|  MA132 || Captain Scarlet and the Mysterons || Captain Scarlet and the Mysterons || Original story. The World Air Force plane Goliath has been taken over by the Mysterons and is now on a collision course with Atlantic Airport. Scarlet must board the aircraft and destroy it before it reaches its target.\n|-\n|  MA133 || Captain Scarlet Is Indestructible || Captain Scarlet and the Mysterons || Original story. The Mysterons threaten to destroy the World Cultural Council.\n|-\n|  MA134 || Captain Scarlet of Spectrum || Captain Scarlet and the Mysterons || Original story. The Mysterons threaten to destroy the Moon.\n|-\n|  MA135 || Captain Scarlet versus Captain Black || Captain Scarlet and the Mysterons || Original story. Captain Black steals a Spectrum Pursuit Vehicle equipped with one of the organisation's new electro-ray rifles. Pursued by Scarlet and Blue, he takes two children hostage.\n|-\n|  MA136 || Captain Scarlet T.V. Themes ||  || Barry Gray Orchestra musical recording\n|-\n|}\nReferences"
    }
  ]
}