{
  "content": [
    {
      "type": "text",
      "text": "# Century Plaza\n\n| address =\n| opening_date = 1975\n| closing_date = May 31, 2009\n| developer = Engel Realty\n| manager =\n| owner = Lumpkin Development\n| architect =\n| number_of_stores =\n| number_of_anchors = 4\n| floor_area =  (GLA)\n| floors = 2\n| website =\n| footnotes =\n}}\nCentury Plaza was an enclosed shopping mall in Birmingham, Alabama, United States. Opened in 1975, the mall originally included four anchor stores and more than one hundred tenants, but lost three of those anchors (JCPenney, Belk and Rich's-Macy's) in the mid-2000s. In May 2009, the mall was completely closed as Sears and the rest of the stores in the mall closed. The mall was managed by General Growth Properties of Chicago, Illinois at the time of its closure. It was demolished in 2020 and replaced by a 200,000 square-foot Amazon logistics facility.\nHistory\nCentury Plaza opened in 1975 on the eastern side of Birmingham, Alabama, on U. S. Route 78 (Crestwood Blvd.) near Interstate 20, across from the existing Eastwood Mall. The mall's original anchor stores included Sears (which opened in 1974), Rich's, Loveman's of Alabama and JCPenney. Loveman's later was replaced by Pizitz, which in turn became McRae's in 1987.\nRich's was dual-branded as Rich's-Macy's in 2003 when Macy's acquired the Rich's chain. The Rich's-Macy's store at Century Plaza, however, closed after only one year in operation and was never rechristened as \"Macy's\". A Piccadilly Cafeteria in the mall also closed that same year.\nWhen plans were announced to demolish Eastwood Mall across the street in 2004, two of the mall's tenants (Books-A-Million and Parisian) had announced preliminary plans to relocate to Century Plaza, with the latter taking over the McRae's space. McRae's was eventually converted to Belk in 2006 when the chain was acquired, but closed later that same year. JCPenney also closed in 2006, and many inline tenants began to close as well. In February 2009, it was announced that Sears, the last remaining anchor, would close its store by May 31.\nAnchor stores\nNorth Anchor: JC Penney (1975 - 2006)\nEast Anchor: Loveman's (1975 - 1980), Pizitz (1980 - 1987), McRaes (1987 - 2006), Belk (2006 - 2006)\nSouth Anchor: Rich's (1975 - 2004)\nWest Anchor: Sears (1974 - 2009)\nMall closing\nCentury Plaza closed at the end of business on May 31, 2009. At the time of its closing, fewer than 40 stores, including Foot Locker, Champs Sports, Finish Line and RadioShack remained open in the mall. General Growth Properties announced that Sears would remain open through June 14 to complete the liquidation of the store.\nIn December 2017, the Howard Hughes Corporation sold the mall for $3&nbsp;million to Lumpkin Development, a real estate company based in Pelham, Alabama. Lumpkin said that the Sears store would be converted into a self-storage facility, and that the rest of the mall was available for rent.\nIn May 2020, it was reported that the site was being considered for development as a last-mile delivery center by Amazon.\nAs of November 12, 2020, the mall has begun demolition for the Amazon last mile delivery center.\nReferences\n}}\nExternal links\n*[https://web.archive.org/web/20040212015925/http://www.centuryplaza.com/html/ Century Plaza archived website from 2004]"
    }
  ]
}