{
  "content": [
    {
      "type": "text",
      "text": "# Chamber of Deputies (Third French Republic)\n\n}}\n| term_length = 66 years, 2 months, 23 days\n| constitution = Constitutional Laws of 1875\n| background_color =\n| text_color =\n| website =\n| footnotes =\nVoting system: Universal male suffrage and two-round majority voting (system modified several times).\nLast election: 1936.\nUpper house: Senate.\nGovernment: .\nSessions: .\n31 December 1875: The National Assembly promulgates the Organic Law of Election and dissolves to form a new National Assembly under the Constitution.20 February and 5 March 1876: Elections for the 1st legislature begin on 8 March.13 March 1876: Jules Grévy elected president of the Chamber.3 November 1879: Both parliamentary chambers transferred to Paris (Palais Bourbon and Palais du Luxembourg).29 July 1939: Decree-law extends the legislature's term by 2 years until 31 May 1942.1 September 1939: Start of World War II.8 June 1940: German advance disrupts French front; debate begins on continuing the war.10 June 1940: Government leaves Paris for Tours.14 June 1940: Germans occupy Paris; Parliament moves to Bordeaux.19 June 1940: Germans enter Vichy.22 June 1940: Armistice.1 July 1940: Government moves to Vichy and convenes Parliament on 2 July.4 July 1940: 670 parliamentarians (deputies and senators)convene in Vichy for the National Assembly.8 July 1940: Grand Casino in Vichy converted into the Chamber of Deputies.9 July 1940: Édouard Herriot presides over the final session of the Chamber of Deputies.10 July 1940: At the Vichy Opera, the 16th legislature votes a constitutional law suspending the Constitution and granting full powers to Philippe Pétain (569 for, 80 against, 20 abstentions).11 July 1940: The Chamber is prorogued and adjourned by Constitutional Act No. 3; chambers adjourned sine die, ending the National Assembly de facto.31 May 1942: Legal end of the National Assembly.3 November 1943: Start of the Provisional Consultative Assembly of Algiers.\n}}\nIn France, from 1875 to 1940, under the Third Republic, the Chamber of Deputies was the name of the legislative assembly elected by universal suffrage. When convened together with the Senate at Versailles, forming the National Assembly, it elected the President of the Republic.\nOverview\nuntil 1879, in the hall now used for the Congress (The Liberator of the Territory by Jules-Arsène Garnier)|left]]\nThe Chamber of Deputies was elected using a majority voting system for four-year terms, with the number of deputies ranging from 520 to over 600, depending on the legislature. There were 17 legislatures during this period. This era marked the establishment of republican parliamentary practices, characterized by lively debates led by prominent orators such as Léon Gambetta, Jules Ferry, Georges Clemenceau, and Jean Jaurès. Political parties and parliamentary groups were initially absent, with the first groups forming in the early 20th century. The diverse republican factions contributed to significant political fragmentation and recurring governmental instability.\nLawyers formed a significant portion of the Chamber's membership. In 1924, during the Cartel des gauches, the Chamber included 140 lawyers and nine law professors. In 1936, under the Popular Front, there were 110 lawyers and eight law professors.\nA parliamentary indemnity was introduced during the Third Republic, building on a precedent set on 1 September 1789, when the Assembly voted for a daily allowance of 18 livres. This ensured that citizens of modest means could serve as representatives. By 1 January 1938, the annual indemnity was 82,500 francs, rooted in the classical Athenian principle of misthophoria, which compensated citizens for time spent in the Ecclesia.\nElection system\nThe Chamber of Deputies was typically elected through a two-round majority system by arrondissement, with no candidate elimination between rounds. However, the voting system changed several times:\n* The Law of 16 June 1885 introduced a majority list system by department, used only in the 1885 election.\n* The Law of 13 February 1889 restored the two-round majority system, applied from the 1889 election.\n* The Law of 12 July 1919 established a proportional list system with a strong majority bonus, modified by laws on 20 February 1920, 15 March 1921, and 8 April 1921, used in the 1919 and 1924 elections.\n* The Law of 21 July 1927 reinstated the two-round majority system for the 1928 election.\nOf the 17 legislative elections under the Third Republic, 15 used a majority system, and two used a proportional system.\nPowers and role\nThe Chamber of Deputies could censure the government through procedures like interpellation, based on the principle of ministerial responsibility in the 1875 Constitution. This was central to the parliamentary regime. The executive could counter with the right of dissolution over the lower house. After the 1877 MacMahon crisis, the dissolution power fell into disuse, allowing the Chamber to dominate the executive, leading to frequent government collapses and a power imbalance later termed \"French-style parliamentarism\" or \"assembly regime.\"\nParliamentary groups and key figures\n* Parliamentary groups: Royalists (Legitimists and Orléanists), Republicans (Liberals, Opportunists, Radicals, and Socialists).\n* Key figures: Henri V, Albert de Broglie, Adolphe Thiers, Léon Gambetta, Jules Ferry, Georges Clemenceau, Jean Jaurès, Georges Boulanger.\nPresidents of the Chamber of Deputies\nIs as follows:\n* 13 March 1876 – 30 January 1879: Jules Grévy\n* 31 January 1879 – 27 October 1881: Léon Gambetta\n* 3 November 1881 – 7 April 1885: Henri Brisson\n* 8 April 1885 – 3 April 1888: Charles Floquet\n* 4 April 1888 – 11 November 1889: Jules Méline\n* 16 November 1889 – 10 January 1893: Charles Floquet\n* 10 January 1893 – 3 December 1893: Jean Casimir-Perier\n* 5 December 1893 – 30 May 1894: Charles Dupuy\n* 2 June 1894 – 27 June 1894: Jean Casimir-Perier\n* 5 July 1894 – 12 December 1894: Auguste Burdeau\n* 18 December 1894 – 31 May 1898: Henri Brisson\n* 1 June 1898 – 31 May 1902: Paul Deschanel\n* 10 June 1902 – 12 January 1904: Léon Bourgeois\n* 12 January 1904 – 10 January 1905: Henri Brisson\n* 10 January 1905 – 7 June 1906: Paul Doumer\n* 8 June 1906 – 13 April 1912: Henri Brisson\n* 23 May 1912 – 10 February 1920: Paul Deschanel\n* 12 February 1920 – 31 May 1924: Raoul Péret\n* 9 June 1924 – 21 April 1925: Paul Painlevé\n* 22 April 1925 – 20 July 1926: Édouard Herriot\n* 22 July 1926 – 10 January 1927: Raoul Péret\n* 11 January 1927 – 31 May 1936: Fernand Bouisson\n* 4 June 1936 – 9 July 1940: Édouard Herriot\nDissolution\nThe final session of the Chamber of Deputies, presided over by Édouard Herriot, occurred on 9 July 1940. It was prorogued and adjourned by Philippe Pétain under Constitutional Act No. 3 on 11 July 1940.\nSee also\n* French Third Republic\n* Constitutional Laws of 1875\n* 16 May 1877 crisis\n* List of prime ministers of France#Third Republic (1870–1940)\nReferences"
    }
  ]
}