{
  "content": [
    {
      "type": "text",
      "text": "# Chandrabir Kunwar\n\n}}\nChandrabir Kunwar () or Chandra Bir Kunwar Chhetri also spelled Chandravir, Chandraveer was a governor and military commander in the Kingdom of Nepal. He was born to Jaya Krishna Kunwar of Gorkha-based Kunwar family and was a nephew of the famed Gorkhali Sardar Ramakrishna Kunwar. He married the sister of Kaji Ranjor Thapa and was a son-in-law of his superior commander Amar Singh Thapa. He fought at the 1803 conquest of Garhwal Kingdom and the final battle of Garhwal on 1805 A.D. where King Pradyumna Shah died. During his lifetime, he served as the Subba (Governor) of Doti and one-third territories of Garhwal province in the Kingdom of Nepal. He was also the father of the renowned battle hero Balbhadra Kunwar of Nalapani.\nEarly life\nHe was born to Jaya Krishna Kunwar, a son of Ashiram Kunwar. He was a resident of Bhanwarkot in Kavrepalanchowk District. He married sister of Kaji Ranajor Thapa and was a son-in-law of Bada Amar Singh Thapa\nCareer\nChandra Bir Kunwar was appointed as Subba (i.e. governor) of Pyuthan in around 1844/45 Vikram Samvat. After 1844/45 Vikram Samvat, Chandrabir lived continuously in the hill region. Initially, Chandra Bir was deputed with a responsibility to build forts for the Gorkhali Army. The royal orders of Ashwin Badi 13, 1851 states that he was the Subedar of the Kalidatta Company before Mahavir Bista.\nin whitish grey, Chandrabir governed the one-third territories of the region]]\nAfter 3 weeks of the earthquake on 8 September 1803, Gorkhali forces saw an opportunity to conquer Garhwal Kingdom. The Gorkhali forces marched toward Srinagar from three directions. Chandrabir Kunwar together with his co-commander Bhaktibir Thapa led the so-called second unit of Gorkhali forces through Langurgarh route. Eventually, King Pradyumna Shah escaped with Parakram Shah to Doon valley, however, the Gorkhalis also occupied the Doon valley in Ashwin 1860 (October 1803).  Governors Ranadhir Singh Basnyat and Hastadal Shah who had differences with Amar Singh Thapa were replaced by Surabir Khatri, Ranabir Khatri, Dhaukal Khatri and Chandrabir Kunwar. Chandra Bir was appointed as Subba (governor) of one-third territories of Garhwal and in replacement of Hasti Dal Shah. The appointment letter dated Ashadh Badi 2, 1862 Vikram Samvat states him to reach Srinagar and act according to the orders of Bada Kaji Amar Singh Thapa.}} According to the Bhasha Vamshavali, Chandrabir Kanwar also participated in the last battle of Garhwal which took place in 1862 Vikram Samvat. The war resulted in the defeat of King Pradyumna Shah.\nTwo years after appointed as Subba (governor) of Garhwal, he was transferred to Doti region.  He was appointed as governor of hill, Madhesh and Bhot divisions of Doti region by the royal letter dated Bhadra Sudi 11, 1864. On this tenure, he was authorized with Khangi emoluments of NRs. 3500 and coin minting rights at Doti. Furthermore, he was authorized with autonomous revenue collection, payments to various military companies, Fouzdars and Peskars.}}\n, Overall Commander of the Western region of Kingdom of Nepal]]\nThe royal orders on Kartik Badi 1, 1865 Vikram Samvat shows Chandrabir as Sardar in Garhaun together with Parashuram Thapa for a brief period. After his tenure as governor of Doti, he was later called back to Garhwal. Chandrabir together with Sardar Bhakti Thapa and Subba Shrestha Thapa were deputed in Garhwal regions per royal orders on Jestha Badi 9, 1866 (May 1809). The orders instructed them to demarcate a land yielding NRs. 1200 at Dasauli for maintaining a Sadavarta (pilgrim feeding place). The Sadavarta was made for pilgrims visiting the famed Badrinath Temple. Additionally, they were authorized to appoint Fouzdar for revenue collection in Doon valley and apportion the total revenue on their own jurisdiction as per letter dated Baisakh Sudi 3, 1866 (April 1809). Similarly, they were instructed through the same letter to maintain a check post for preventing the sale of children and not to impart injustices in any case.\nDeath\nChandravir Kunwar died at the banks of Ganga on early 1871 Vikram Samvat (1814 A.D). The death of Chandravir Kunwar was reported by his brother-in-law Kaji Ranajor Thapa to King Girvan Yuddha Bikram Shah through letter dated Baisakh Sudi 7, 1871 Vikram Samvat (April/May 1814). The reply letter from King Girvan Yuddha was written on Jestha Sudi 4, 1871 Vikram Samvat (May 1814 A.D.). The response letter from King Girvan states that one of his two sons was deputed to build the Nalapani fort while the other was deputed to remain at Nahan.\nLand Grants\nHe received rice lands amounting 300 muris on Manachamal tenure through a royal order issued in Aswin Badi 13, 1862.\nDescendants\n, son of Chandravir and hero of the Battle of Nalapani]]\nHis son Balabhadra Kunwar was highly praised for his military skill for the defence of the Nalapani fort. His another son Birabhadra Kunwar was military commander in Kumaun and Kangra front (1809 A.D.) as well as governor of Garhwal.\nReferences\nFootnotes\nNotes\nSources\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\nFurther reading\n*\n*"
    }
  ]
}