{
  "content": [
    {
      "type": "text",
      "text": "# Changsha Kingdom\n\n|year_end               = AD 33\n|event1                 = Extinction of the Wu family line\n|date_event1            = 157 BC\n|event2                 = Reestablishment under the Liu family\n|date_event2            = 155 BC\n|event3                 = Dissolution under Wang Mang\n|date_event3            = AD 9\n|event4                 = Restoration\n|date_event4            = AD 26\n|image_map              = Han dynasty Kingdoms 195 BC.png\n|image_map_caption      = Kingdoms of the Han dynasty in 195 BC, with Changsha shown in light green, at bottom centre\n||alt_map               = A map of the Han dynasty and kingdoms within the empire in 195 BC, including Changsha\n|capital                = Linxiang\n}}\n|s=\n|p=Chángshā Guó |w=Ch‘ang-sha Kuo |mi=/ʈ͡ʂʰɑŋ³⁵ ʂä⁵⁵ kwɔ³⁵/\n|j=coeng4 saa1 gwok3\n|poj=Tiông-sa Kok\n|hsn=/ʈ͡ʂan¹³ sa̠³³ kuɤ̞²⁴/\n|l=\n}}\nThe Changsha Kingdom was a kingdom within the Han Empire of China, located in present-day Hunan and some surrounding areas. The kingdom was founded when Emperor Gaozu granted the territory to his follower Wu Rui in 203 or 202 BC, around the same time as the establishment of the Han dynasty. Wu Rui and his descendants held the kingdom for five generations until Wu Zhu died without an heir in 157 BC. In 155 BC, the kingdom was reestablished for a member of the imperial family. However, the creation of this second kingdom coincided with the Rebellion of the Seven States and the subsequent reforms under Emperor Jing, and Changsha under the imperial family saw its autonomy greatly diminished. The kingdom was dissolved during Wang Mang's usurpation (AD 9 – 23), briefly restored after the founding of the Eastern Han, and finally abolished in  and converted to a commandery under the imperial government.\nChangsha was one of the largest and longest-lasting kingdoms in Han China. Despite being established on the empire's frontier, technology and art flourished in Changsha. Numerous archaeological sites of the kingdom have been discovered and excavated, most notably Mawangdui, the tomb of Changsha's chancellor Li Cang and his family, providing valuable insights into life in the kingdom and Han dynasty in general.\nHistory\nThe first king of Changsha, Wu Rui, was a Baiyue leader who had been the magistrate of Poyang County under the Qin dynasty (221 – 207 BC). He enjoyed high prestige among the local people and was known as \"Lord of the Po\" (}}, Pójūn).\nIn , a peasant uprising triggered a wave of rebellions that resulted in the collapse of the Qin. After hearing news of the uprising, Wu Rui organized a mostly Baiyue army in support of the rebels. His forces soon grew to become a major faction in the civil war that ensued. In , Rui's army joined forces with the Han leader Liu Bang (the future Emperor Gaozu, at the time one of the rebel generals) and marched to the Guanzhong Plain, where they received the surrender of Ziying, the last ruler of Qin. One year later, the Chu King Xiang Yu, then the most prominent leader in the rebellion, in an attempt to redivide the empire, recognized Rui as the \"King of Hengshan\" }},}} Héngshān Wáng). The Han eventually emerged victorious from post-Qin conflicts and established itself as the preeminent power in China. In 203/, Emperor Gaozu moved Wu Rui's fief and established the Kingdom of Changsha. The capital was Linxiang and located within the present-day city of Changsha. The new kingdom helped the Han dynasty consolidate control over the Chu heartland and served as a buffer state against the independent realm of Nanyue founded by the Qin general Zhao Tuo in present-day Guangdong. Rui died shortly after moving to his new territory, and the title passed to his son, Wu Chen }},}} Wú Chén). Wu Chen reigned for eight years.\nThe kings of Changsha were staunch supporters of the Han, and their loyalty and competence was praised by successive emperors. In the first years after the founding of the Han Empire, the Emperor Gaozu embarked on a campaign to eliminate kings that were not members of the imperial family. The kings first grew to prominence as heads of independent factions in the chaos following Qin's fall, and the emperor viewed them as great threats to his authority. Changsha, located on the empire's southern fringe, was one of the weakest among the kingdoms; however, it was the only one to survive beyond 190s BC. In  Ying Bu, King of Huainan and son-in-law of Wu Rui, rebelled against the Han and was defeated. As Ying retreated south of the Yangtze River, the King of Changsha pretended to assist him in his escape to Nanyue but instead killed him in Cixiang }},}} Cíxiāng) near Poyang.\nWu Chen was succeeded by his son Wu Hui }},}} Wú Huí). Hui reigned for seven years, and was succeeded by his son Wu You }},}} Wú Yòu), whose name is also recorded as Wu Ruo }},}} Wú Ruò). At the time, the Han dynasty was under Emperor Hui and Empress Lü, who favored lenient laws and political views of the Huang–Lao school of philosophy. Changsha was able to develop under relative peace. In  however, Empress Lü banned the export of iron ware to Nanyue, which angered Zhao Tuo, who then proclaimed himself Emperor of Nanyue and then twice invaded Changsha, occupying a few counties. Later, during Empress Lü's reign, the imperial court decided to launch a military campaign against Nanyue. However, in the hot and humid summer, a plague broke out in the Han army, hindering its advance. The campaign was eventually abandoned with the death of Empress Lü. In  the kingdom passed to Wu You's son Wu Zhu }},}} Wú Zhù), for whom the names Wu Chai }},}} Wú Chāi) and Wu Chan }},}} Wú Chǎn) are alternatively used in some records. Wu Zhu reigned for twenty-one years, dying in  without male issue.\nAfter the extinction of this house, Emperor Jing granted Changsha to his son Liu Fa }},}} Liú Fā) in  Fa's mother, Tang (}}, Táng), was a servant of the Emperor's concubine Cheng (}}, Chéng) and had given birth to Fa after the intoxicated emperor had mistaken her for his favorite concubine. Consequently, Fa had the lowest status among the Emperor's 14 sons and was enfeoffed in Changsha, far away from the capital Chang'an and the Central Plain. Changsha Kingdom was held by the Liu family until early 1st century AD, when the Han dynasty was interrupted by usurper Wang Mang. Along with other kings of the Liu family in the empire, Liu Shun }},}} Liú Shùn), the last King of Changsha, was first demoted to the rank of duke and then stripped of his titles altogether. After the restoration of Han dynasty, the Guangwu Emperor, himself a descendant of Liu Fa, gave Changsha to Liu Shun's son Liu Xing }},}} Liú Xīng) in  In 33 the Emperor rescinded the decision and demoted Xing to the rank of a marquis, citing the distance of kinship between Xing and himself. Changsha was administered as an imperial commandery thereafter.\nTerritory\n|alt=A scan of the Mawangdui silk map. The coastline and several rivers drawn in dark colors are clearly visible.]]\nThe exact extent of the first Changsha Kingdom is still unclear. The official Book of Han reports Changsha's border “reaching the north bank of Han River and stretching to Jiuyi Mountains”, although it is unlikely that Changsha actually reached so far. Similarly, it reports that, when Emperor Gaozu created the Kingdom of Changsha, he granted Wu Rui authority over the five commanderies of Changsha, Yuzhang }},}} Yùzhāng), Xiang (}}, Xiàng), Guilin }},}} Guìlín) and Nanhai }},}} Nánhǎi). However, Yuzhang Commandery had already been conferred to Ying Bu, the King of Huainan, while Xiang, Guilin, and Nanhai Commanderies were all held by Zhao Tuo, the effectively independent King of Nanyue. This state of the Changsha–Nanyue border was confirmed in a map unearthed from the Mawangdui tombs. On the other hand, other preserved and unearthed texts have shown that there were two other commanderies actually controlled by the Changsha Kingdom: Wuling }},}} Wǔlíng) and Guiyang }},}} Guìyáng). The first may have been granted by the imperial Han government; the historical geographer Zhou Zhenhe argues that the \"Yuzhang\" recorded in the Book of Han was simply a mistake for \"Wuling\", which would have been part of the original grant of the kingdom. Guiyang was likely created by the kings of Changsha at some point for defense against invasions from Nanyue.\nThe reconstruction offered by Zhou and Tan Qixiang is that Changsha's northern border ran along modern Tongcheng, Songzi, and Gong'an counties; the western border along modern Longshan, Zhenyuan, and Jingzhou counties; and the eastern border along modern Gao'an, Yichuan, Lianhua, and Chaling counties. Changsha's southern frontier with Nanyue was approximately the modern southern border of Hunan.\nWhen Emperor Jing granted Changsha to his son Liu Fa, the kingdom's territory was reduced to Changsha Commandery alone. Consequently, the kingdom's southwestern border was in the vicinity of modern Chaling, Wugang and Quanzhou counties. From Emperor Wu's reign onward, 20 marquisates were created from Changsha. These marquisates were administered as parts of neighboring commanderies, further reducing the kingdom's territory.\nDemographics\nChangsha was sparsely populated compared to other parts of the Han Empire. The population primarily consisted of descendants of Chu colonizers, members of the Qin military garrison and their offspring, assimilated Nanman, and the native Baiyue tribes. Zhao Tuo, King of Nanyue, claimed that \"half of Changsha are Man and Yi\". Jia Yi, grand tutor of the king from 176 to  wrote that there were only 25,000 households in the kingdom, although it is likely that the figure was an underestimate. (Jia, an advocate for further limits on the kingdoms' autonomy, saw Changsha's weakness as a reason of its loyalty.) However, the population increased rapidly, partly due to the favorable agricultural policies and partly because of immigration both from within the Han empire and from Nanyue. In  when the Han dynasty conducted an empire-wide population census, the population of Changsha was recorded as 235,825 living in 43,470 households. The commanderies that constituted the larger Changsha of the early Han dynasty together had a population of 717,433 living in 126,858 households, a five-fold increase from Jia Yi's estimation during the early Han period.\nGovernment\nof the chancellor of the Changsha Kingdom|alt=Refer to caption]]\nIn the early Han dynasty, the government structure of the kingdoms closely followed that of the Han central government, but differences remained. Except for the chancellor and grand tutor }},}} tàifù), who were selected by the imperial court, all officials were appointed by the king. As in the imperial government, the chancellor }},}} xiàngguó, before  and }},}} chéngxiàng, thereafter) was the highest civil office and the leader of the government. However, the chancellor was not directly involved in the kingdom's everyday affairs, which were overseen by the court clerk }},}} nèishǐ). Compared to the central government, where the crown princes' tutors had little real authority, the grand tutor played a much more extensive role in a kingdom, as he supervised the king on behalf of the imperial government. Meanwhile, the duties of the court clerk are reminiscent of the Warring States, where the post was second only to the chancellor in status, rather than the Han central government&mdash;the same post in the imperial government was merely in charge of finance and affairs in the capital region.  The responsibilities of the royal secretary }},}} yùshǐ dàfū) were similar to the imperial equivalent, i.e. supervision over the bureaucrats, although his status was likely lower than the court clerk. The imperial Nine Ministers also had their equivalents in the kingdom. In addition, early Changsha had a unique office, the \"pillar of state\" }},}} zhùguó). It was designation for an eminent official originating from the Chu state, but was not seen elsewhere in the Han dynasty; the post may have merged into or been replaced by that of the chancellor.\nUnder the Wu family, the Changsha Kingdom was administered at two levels, the commandery and the county. As described above, the state is believed to have consisted of the three commanderies of Changsha, Wuling, and Guiyang and to have claimed further commanderies under Nanyue's control. The three actual commanderies were divided into over 40 counties. Under the cadet branch of the Liu family, the Changsha Kingdom eliminated the needless commandery level as its territory had been much reduced. In  the kingdom only administered thirteen counties.\nIn regions inhabited by the Baiyue, larger but less populated circuits were used in place of counties. Two circuitsHe (}}, Hé) and Ling (}}, Líng)are noted on the map unearthed at Mawangdui. Counties were each headed by a magistrate and were subdivided into townships and villages (}}, lǐ) in the same manner as in centrally administered territories of the Han dynasty.\nThe reestablishment of the Changsha Kingdom under Liu Fa coincided with the abortive Rebellion of the Seven States and the subsequent drastic measures to limit the autonomy of kingdoms by Emperor Jing. In  the vassal kingdoms were stripped of the right to appoint officials with salaries higher than 400 dan, which covered everyone from ministers in the royal court to county magistrates. Furthermore, changes were made to the government hierarchy of kingdoms. A number of offices were abolished, including the royal secretary, minister of justice }},}} tíngwèi), minister of the royal clan }},}} zōngzhèng), steward }},}} shǎofǔ), and court scholar }},}} bóshì). Of particular importance was the abolition of the steward, as this move deprived the kings of their fiscal control over the fief. Many remaining offices were demoted in rank, and lesser officials were reduced in number. The titles of the chancellor and tutor were shortened to simply xiàng (}}) and fù (}}) to distinguish them from their imperial equivalents. Later, in  the court clerk was abolished and the chancellor took over his duties. By then, the kingdom's government structure had become almost indistinguishable from that of a commandery in all but name.\nKings\n{| class=\"wikitable\" style=\"margin-left: auto; margin-right: auto; border: none;\"\n|+ Kings of Changsha\n! colspan=\"3\" | Posthumous name !! colspan=\"3\" | Personal name !! rowspan=\"2\" | Reigned from !! rowspan=\"2\" | Reigned to !! rowspan=\"2\" | Relationship with predecessor\n|-\n!Name\n!In Chinese\n!Pinyin\n!Name\n!In Chinese\n!Pinyin\n|-\n| style=\"text-align:center;\" colspan=\"9\"|Wu family\n|-\n|King Wen of Changsha\n|\n|Chángshā Wén Wáng\n|Wu Rui\n|\n|Wú Ruì\n|203 BC\n|202 BC\n|\n|-\n|King Cheng of Changsha\n|\n|Chángshā Chéng Wáng\n|Wu Chen\n|\n|Wú Chén\n|202 BC\n|194 BC\n|Son\n|-\n|King Ai of Changsha\n|\n|Chángshā Āi Wáng\n|Wu Hui\n|\n|Wú Huí\n|194 BC\n|187 BC\n|Son\n|-\n|King Gong of Changsha\n|\n|Chángshā Gòng Wáng\n|Wu You\n|\n|Wú Yòu\n|187 BC\n|179 BC\n|Son\n|-\n|King Jing of Changsha\n|\n|Chángshā Jìng Wáng\n|Wu Zhu\n|\n|Wú Zhù\n|179 BC\n|157 BC\n|Son\n|-\n| style=\"text-align:center;\" colspan=\"9\"|Liu family\n|-\n|King Ding of Changsha\n|\n|Chángshā Dìng Wáng\n|Liu Fa\n|\n|Liú Fā\n|155 BC\n|128 BC\n|\n|-\n|King Dai of Changsha\n|\n|Chángshā Dài Wáng\n|Liu Yong\n|\n|Liú Yōng\n|128 BC\n|101 BC\n|Son\n|-\n|King Qing of Changsha\n|\n|Chángshā Qīng Wáng\n|Liu Fuqu\n|\n|Liú Fùqú\n|101 BC\n|83 BC\n|Son\n|-\n|King La of Changsha\n|\n|Chángshā Là Wáng\n|Liu Jiande\n|\n|Liú Jiàndé\n|83 BC\n|50 BC\n|Son\n|-\n|King Yang of Changsha\n|\n|Chángshā Yáng Wáng\n|Liu Dan\n|\n|Liú Dàn\n|50 BC\n|48 BC\n|Son\n|-\n|King Xiao of Changsha\n|\n|Chángshā Xiào Wáng\n|Liu Zong\n|\n|Liú Zōng\n|45 BC\n|43 BC\n|Brother\n|-\n|King Miu of Changsha\n|\n|Chángshā Miù Wáng\n|Liu Luren\n|\n|Liú Lǔrén\n|42 BC\n|AD 6\n|Son\n|-\n|colspan=\"3\"|–\n|Liu Shun\n|\n|Liú Shùn\n|AD 6\n|AD 9\n|Son\n|-\n|colspan=\"3\"|–\n|Liu Xing\n|\n|Liú Xīng\n|AD 26\n|AD 33\n|Son\n|}\nEconomy\nAgriculture in Changsha included a wide range of crops and animal species. Rice, the staple food in Changsha, was cultivated with a diverse range of varieties, while wheat, barley, common and foxtail millet, beans and hemp were also grown, as evidenced by seeds unearthed from tombs. Fish farming and animal husbandry provided non-staple food for the population; livestock such as horses, cattle and sheep were also exported to Nanyue. Mawangdui tombs, the early 2nd century BC burial complex of chancellor Li Cang and his family, are a particularly rich source of knowledge on the kingdom. They have remnants of domesticated animals including pigs, cattle, sheep, dogs and chickens, as well as game animals and fowl. Bamboo tablets recorded an assortment of dishes, with descriptions of multiple preparation techniques. Various types of alcoholic beverages, made from wheat, millet, and rice, were also discovered, indicating the development of local alcohol industry.\nArtifacts from Changsha noble tombs reveal advanced levels of artisanship. A plain-colored gauze gown discovered in the Mawangdui tomb, for example, measures }} long by }} wide but weights only }} in total. The intact embroidered silk from Mawangdui shows intricate patterns of swirling clouds, with more than 20 dyes used in the making of the diverse colors. Glossily decorated lacquerware was manufactured a wide range of purposes, including dishes, furniture, and storage boxes. Iron was widely applied for agricultural and military use, and ironwares found in Changsha tombs include spades, pickaxes, daggers, spears, swords, axes, and coins. There were also records of tin mining in Changsha.\nCulture\n|alt=Refer to adjacent text]]\nChangsha nobility dressed similarly to contemporary nobles in the Han Empire. The forms of ancient Chinese clothing usually found in the tombs of Changsha aristocrats were silk gauze undergarments }},}} dānyī) and long robes with elaborately woven patterns. Men typically wore hats, while a number of hairstyles can be seen in contemporary paintings and sculptures of women.\nThe earliest known paintings on fabric in China were unearthed from the Mawangdui tombs. Among them, a two-meter-long fēiyī }},}} possibly meaning \"flying garment\") in the tomb of Lady Dai is one of the finest examples of art in early China. In the painting, Lady Dai was depicted in the center, accompanied by servants and surrounded by deities, mythological beasts, and symbols. Several types of musical instruments were discovered in the Changsha tombs. They include the earliest known example of a guqin, a form of stringed instrument. Archaeologists also found the first surviving examples of two previously lost ancient Chinese musical instruments, a woodwind known as a yú (}}) and a five-string instrument known as a zhù (}}). Musical and dancing troupes consisting of dozens of performers were recorded in unearthed manuscripts.\nAs seen in excavated manuscripts and artifacts, the Changsha elite practiced complicated incantations and ritual acts for their interaction with the spirit world. The calendrical system was incorporated into the religion, and Taiyi, the polar deity, was the central celestial deity. An animistic pantheon was worshipped. In an iconographic image of Taiyi from Mawangdui, it was depicted with the Thunder Lord, the Rain Master }},}} Yǔshī), and the Azure and Yellow Dragons, with explanatory texts on military fortunes associated with these deities. A wide range of natural phenomena were connected with spirit powers, and instructions and devices on dealing with them have been found. These were among the religious elements that would later give rise to the Taoist religion.\nScience and technology\nSome of the earliest texts on traditional Chinese medicine were discovered in the Mawangdui and Zhangjiashan tombs, most of which were previously unknown. The largest of these finds is the Recipes for Fifty-two Illnesses }},}} ''Wǔshí'èr Bìngfāng), which includes detailed treatments for specific illnesses. Two \"cauterisation canons\", the Cauterisation Canon of the Eleven Foot and Arm Channels }},}} Zúbì Shíyī Mài Jiǔjīng) and the Cauterisation Canon of the Eleven Yin and Yang Channels }},}} Yīnyáng Shíyī Mài Jiǔjīng), provide important evidence about the concept of meridian channels in its infancy. In addition, there are also texts on the philosophy and techniques of \"nurturing life\" }},}} yǎngshēng), covering practices from therapeutic gymnastics and dietetics to sexual cultivation.\nTwo new texts on astronomy and astrology, the Prognostications on the Five Planets }},}} Wǔ Xīng Zhàn) and the Diverse Prognostications on Heavenly Patterns and Formations of Materia Vitalis }},}} Tiānwén Qìxiàng Zá Zhàn''), were found in the Mawangdui tombs. The former provided accurate observation data on the positions of planets over a 70-year period from  to  and also elaborated on some astrological beliefs such as an astral-terrestrial correspondence, a mapping of astronomical features to those on the land. The latter, likely a work by a Chu author of the Warring States period, included a collection of illustrations of astronomical and atmospheric features such as clouds, mirages, rainbows, stars and comets.\nReferences\nCitations\nBibliography\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\nFurther reading\n*"
    }
  ]
}