{
  "content": [
    {
      "type": "text",
      "text": "# Chang Xi (Han dynasty)\n\nChang Xi (; died 206 CE), also recorded as Chang Ba (昌霸) or Chang Wu (昌務), was a minor warlord and former member of the “Taishan bandits’’ who became notorious for repeatedly rebelling against the warlord Cao Cao during the waning years of the Eastern Han dynasty. Captured twice—first persuaded to surrender by Zhang Liao in 201 and later seized by Yu Jin in 206—he was executed under Cao Cao’s strict order that any enemy who surrendered after being surrounded was not to be spared.\nBackground\nA native of Taishan Commandery, Chang Xi followed bandit-chief Zang Ba during the turmoil after the Yellow Turban Rebellion. He fought under Zang in eastern Xu Province and briefly aligned with Lü Bu in 197.\nFirst rebellion and surrender (200–201)\nIn early 200 CE, lured by Liu Bei, Chang Xi raised “tens of thousands” in Donghai and declared independence. Cao Cao dispatched forces led by Xiahou Yuan and Zhang Liao. After months of siege and dwindling supplies, Zhang Liao personally entered Chang Xi’s camp and convinced him to lay down arms; Chang Xi surrendered in early 201.\nFinal revolt and execution (206)\nBy 206 CE, with Yuan Shao’s heirs defeated, Chang Xi rebelled a second time. Cao Cao ordered General Yu Jin—an old friend of Chang Xi—to suppress the uprising, later reinforcing him with Xiahou Yuan and Zang Ba. Ten-plus rebel stockades fell; pressed hard, Chang Xi surrendered to Yu Jin. When subordinates suggested sending the captive to Cao Cao, Yu Jin refused, citing Cao Cao’s standing rule: “Those who capitulate *after* encirclement are not to be spared.” Yu Jin personally wept as he beheaded Chang Xi. Cao Cao, then encamped at Chunyu, remarked: “Was it Heaven’s will that Chang Xi met judgment under Yu Jin rather than me?” and promoted Yu Jin to **General of Tiger’s Might** for upholding discipline.\nAssessment\nChang Xi’s repeated defections illustrate the fluid, opportunistic politics of late Han regional leaders. Traditional historians blame personal ambition; modern scholars note the precarious status granted to former bandits under Cao Cao’s frontier administration.\nIn Romance of the Three Kingdoms\nLuo Guanzhong’s 14-century novel Romance of the Three Kingdoms fictionalises Chang Xi as a minor bandit chief who is swiftly executed by Yu Jin; the dramatic confrontation largely follows historical records.\nSee also\n* Yu Jin\n* Zhang Liao\n* Zang Ba\n* Taishan Commandery\nNotes\nReferences\n* Chen Shou (3rd c.). Sanguozhi (Records of the Three Kingdoms).\n* Pei Songzhi (5th c.). Annotations to Records of the Three Kingdoms.\n* Rafe de Crespigny (2016). A Biographical Dictionary of Later Han to the Three Kingdoms."
    }
  ]
}