{
  "content": [
    {
      "type": "text",
      "text": "# Chandrika Siriwardena\n\n| birth_place        = Kandy, Sri Lanka\n| death_date         =\n| death_place        =\n| death_cause        =\n| spouse             = Anton Alwis (m. 1974; death: 2017)\n| children           = Jithendrika Jayakalani\nPrasantha Udaya\n| education          = Pushpadana Girls' College, Kandy\n| alma_mater         = Bhatkhande University\n| father             = Peter Siriwardena\n| mother             = Srimathi Karuna Devi\n| relatives          = Anton Alwis (husband)  Peter Siriwardena (father)  Karuna devi (father)  Sunil Siriwardena (brother)  Madhumadhawa Aravinda (nephew)  Dhananjaya Siriwardena (nephew)  Shashini Siriwardena (in law)  Dulshara De Alwis (granddaughter)\n| awards             =\n| occupation         = Playback singer, singer, actress, dancer, educator, television personality\n| years_active       = 1953–present\n| website            =\n| signature          =\n| module             = |Indian classical music}}\n| years_active    = 1965–present\n| label           =\n| associated_acts =\n}}\n}}\nKalabushana Visharadha Gajanayake Arachchige Somi Kalani Chandrika Siriwardena (: born 11 November 1948), popularly as Chandrika Siriwardena, is a Sri Lankan singer, actress, playback singer, television personality and choreographer. A pioneer artist in reality musical programs in Sri Lanka, she recorded the songs Midule Mal Sooriya Gaha Mudune, Igillila Yanna Yan and Ranabima Marune in a career that spanned more than six decades. She is one of the most prominent artists to originate from the Siriwardena family.\nPersonal life\nShe was born on 11 November 1948 in Kandy as the youngest in a family with three siblings. Her father, Peter Siriwardena was an accomplished musician and an actor. He worked as a lecturer in music at the Government Women's Training College, Polgolla. Her mother Srimathi Karuna Devi was a music teacher as well as an actress. She first attended to Primary section of teacher training college and then she completed secondary education at Pushpadana Girls' College, Kandy. Chandrika has two elder brothers.\nHis brother Sunil Siriwardena is a singer, lyricist and broadcaster. He has two sons - Madhumadhawa Aravinda and Dhananjaya Siriwardena. Madhumadhawa is a socialist and was a controversial politician. Dhananjaya is a popular actor in cinema, theater and television. Chandrika Siriwardena's niece Dulshara Dasanthi is an influencer and an upcoming singer and actress.\nShe was married to Anton Alwis, who was a journalist, scriptwriter and lyricist. He was also affiliated to the late president R.Premadasa. The couple has one son, Prashantha Udaya and one daughter, Jithendrika. Jithendrika Jayakalani is a Bharathanatyam dancer and has appeared in certain films as cameos. Her husband Anton died on 26 March 2017 at the age of 72.\nCareer\nAt the age of five, Chandrika joined Lama Pitiya children's program in Radio Ceylon. She excelled as a Sinhala singer of excellent grade, and a Tamil singer of excellent grade and a classical Singer during her career at Radio Ceylon. Her elder brother Sunil Siriwardena was famous on the radio as a singer. Chandrika Siriwiwardena's debut radio single was Thalamala Waruna a song by Sunil Siriwardena in which she was featured. She then sang a song Raththaranin Ran for a song program at Radio Ceylon. At the age of 18, she went to G. S. B. Rani's 'Tharangani' program where she sang her first popular song Ukdandu Dunnen Upannemi written by Saman Chandranath Weerasinghe and produced by Sarath Dassanayake.\nAfter completing her education, she went to India and obtained a master's degree from Bhatkhande University with a First Grade Pass. She majored in North Indian classical music as well as South Indian Carnatic music during that period. After returning to Sri Lanka, she sang the song Viyo Wee Mihimadala for the teledrama Sura Asura.\nChandrika has rendered her voice as well as acted in many films including, Giju Lihiniyo, Raththaran Amma, Devduwa and Anjalika. She won Sarasaviya Award for the song Nim Walalla in the film Hithawathiya. She has sung several songs under semi-classical music. Her song Ranabima Marune Sinhalayeknam became an extremely popular song in Sri Lanka. Chandrika won awards for the films Sinasenna Raththaran in the 80's, the film Hithawathiya and the film Chaya. In the film Chaya she contributed as a choreographer for Sabeetha Perera. Chandrika mainly focused on playback singing and did not release any music albums during her career, her music is mainly consumed through Sri Lankan radio and is not fully available on modern streaming services.\nIn 2006, Chandrika joined Sirasa TV for the first season of music reality show Sirasa Superstar. She was a judge for the first few rounds in first season. However, in 2007 she continued to be one of the main judge in season 2. Later in 2012, she joined Derana Dreamstar as a judge. She has also judged in many other reality shows and is popular for changing the role of women in reality television in Sri Lanka.\nChandrika Siriwardena also worked as a music educator and held her own institute which was defunct during the pandemic. She directed two shows called \"gee ran gee\" with her student body as the cast of the performance in 2012.\nIn 2012, Chandrika was honored at 36th SIGNIS OCIC Salutation Festival. In 2019, she was awarded the Kalabushana award by the president Maithripala Sirisena for her valuable input in the Sri Lankan entertainment industry.\nTo celebrate her 70th birthday, she performed a solo concert \"Ran Tharakavo\" on 11 November 2018 at 6.30 pm at the Bandaranaike International Conference Hall which was received with mixed reviews.\nIn 2021, after a brief hiatus from film, she made her return to acting with the television series on Hiru Tv named Divithura.\nFurthermore, Chandrika is one of the most prominent faces of Sri Lanka's reality television scene with numerous appearances in contests and talk shows throughout her career. She continues to lead a private life and has no social media accounts to her name.\nSelected Filmography & Television\n{| class=\"wikitable\"\n|+Cinema\n!Year\n!Title\n!Character\n|-\n|1971\n|Ran Onchilla\n|Dancer\n|-\n|1975\n|Gijulihiniyo\n|Cast\n|-\n|1975\n|Raththaran Amma\n|Supporting role\n|-\n|1986\n|Dewduwa\n|Kanya\n|-\n|2006\n|Anjalika\n|Supporting role\n|}\n{| class=\"wikitable\"\n|+Teledrama\n!Year\n!Title\n!Character\n|-\n|2021-2024\n|Divithura\n|Vajira Devanarayana\n|}\n{| class=\"wikitable\"\n|+Reality television\n!Year\n!Title\n!Role\n|-\n|2007-2010\n|Sirasa Superstar\n|Judge\n|-\n|2013\n|Derana Dream Star\n|Judge\n|-\n|2016\n|Ranaviru Star\n|Judge\n|-\n|2018-2019\n|Derana Star city\n|Judge\n|}\nDiscography\nChandrika Siriwardena did not release any albums throughout her career. She mainly focused on radio singles and playback singing throughout her career. Her Frequent collaborators includes legends such as Victor Rathnayake, Gration Ananda, Sujatha Attanayake, her own Brother Sunil Siriwardena and H.R Jothipala.\nShe is the first musician in the country to re-sing an Indian Tamil song for distribution in Sri Lanka.\nShe has also sung live with prominent Bollywood and Kollywood musicians such as S.P Balasubramaniyam, K.S. Chithra and Nitin Mukhesh.\nSome of her most prominent hits are:\n* Midule Mal\n* Ran Tharakawo\n* Igillila Yanna Yan\n* Sanda Nathuwata\n* Ranabima Marune\n* Seethala Ra\n* Uk Dandu Dunnen\n* Raththaranin Ran\n* Randuwevi Yaaluwevi with brother Sunil Siriwardena\n* Balaporoththuwa\n* Ma Amal Biso\n* Ma Amal Hina Paawa\n* Mal Warusawak with Victor Rathnayake\n* Sandamadalai\n* Mage Hiru Sandu\n* Habun Katai with mother Karunadevi Siriwardena and daughter Jithendrika Jayakalani\n* Maha Saagare\n* Ranwan Ma Ranpiliyen Sarasa\n* Puthe Thaththa\n* Kiri Babalena Handa Paane\n* Ranimini Derane\n* Prema Varayen with Sunil Edirisinghe\n* Lassana Mal Kakulu Kusum\n* Ammawarunage\n* Alaipayude (First Tamil song to be distributed by a Sri Lankan artist for local audiences by south India)\n* Nishathalathirane\n* Divya Nethra\n* Sanda eliya Nikalal\n* Sandalalana\n* Pahan Tamba oba\n* Me Dewule Devinde\n* Vahi Lihiniyo\n* Uthsahaya Ukdandakvanne\n* Pema Thurawemi\n* Vidaaven Barawu\n* Hithanna Sandu Gana\n* Vaakandiya Laga\n* Velleliye Ipanalthala\n* Mala Pipi Pipi with H.R Jothipala\n* Siriyahangaba\n* Loke Me Sonduru Kaale with H.R Jothipala\n* Gum Gum Gum Bigunge with Milton Mallawarachchi\n* Pem Kumaro with Gration Ananda\n* Podi Kaale Podi Hithen\n* Nindedi Raathri Sihine\n* Ding Dong with Gration Ananda\n* Raaja Vibhushitha with Sujatha Attanayake\n* Paada Salamba\n* Jeeve Upatha Vipatha\n* Sansunwuuwa\n* Thunveni Yaame\n* Sahara Kathara Madin\n* Kumariya Suvisal\n* Baala Nangiye\n* Me Raathriye\n* Pera Da Oba Ha\n* Seethala Pinne with Victor Rathnayake\n* Sasare Nawathane\n* Sansara Sihinaye\n* Kumari Rajanandani\n* Paramba Panduru Matha\n* Eka Mau Thurulle\n* Oba Samugath Pasu\n* Saagaraye Diya Sendena Thura\n* Samaa Wenna Mata\n* Samadhigaami\n* Maha Karunawe\n* Ranwan Ranketha with W.D Amaradeva\n* Heera Pala Daru with Abeywardena Balasuriya\n* Deegeta Giya Da with Brother Sunil Siriwardena\n* Bedanna Ba Rata\n* Boguna Daami with Sanath Nanadasiri\n* Sathdawasak Nowa\n* Sihin Sinindu Seda Hatta\n* Pinsara Himiyanee\n* Kankalu Rasee Dani\n* Amma Nokee E\n* Santhane\n* Malmal wasanthe with Tony Hassan\n* Monareku Handuwa\n* Mahiyanganayata\n* Seetha Ra\n* Jesuni Samiduni\n* Solasanada\n* Indunil Galwa\n* Seeneka Raakadi\n* Sihinen Lanwee\n* Parakperak Nathi\n* Daathe Dasangili\n* Daye Namin\nReferences\nExternal links\n* [https://www.vinsaara.info/sinhala_article/show.php?id=1157&cat=Art ‘‘රන් තාරකාවෝ’’ මගේ උපන් දිනය වෙනුවෙන් රසිකයන්ට දෙන තෑග්ගක් - චන්ද්‍රිකා සිරිවර්ධන]\n* [http://www.deshaya.lk/article/52/හදසර/9296/රන්-තාරකාවෝ-දිලිසුණ-දා--- රන් තාරකාවෝ දිලිසුණ දා]\n* [https://sarigama.lk/artist/chandrika-siriwardana/7833a6e8-258d-42b3-8282-7926efe75662 Chandrika Siriwardana songs]\n* [https://www.nation.lk/2011/10/09/eyefea7.htm Sanda Madale Sita]\n* [http://archives.sundayobserver.lk/2012/06/10/mon50.asp Gee Ran Gee]"
    }
  ]
}