{
  "content": [
    {
      "type": "text",
      "text": "# Charles Howard McIlwain\n\n| birth_place = Saltsburg, Pennsylvania, U.S.\n| death_date =\n| discipline = History\n| workplaces =\n| awards = Pulitzer Prize for History (1924)\n| education =\n| notable_students = Henry Friendly\n}}\nCharles Howard McIlwain (March 15, 1871 – June 1, 1968) was an American historian, medievalist, and political scientist. He won the Pulitzer Prize for History in 1924. He was educated at Princeton University and Harvard University and taught at both institutions, as well as the University of Oxford, Miami University, and Bowdoin College. Though he trained as a lawyer, his career was mostly academic, devoted to constitutional history. He was a member of several learned societies and served as president of the American Historical Association in 1935–1936.\nEarly life and career\nMcIlwain was born March 15, 1871, in Saltsburg, Pennsylvania. In 1894 Princeton University awarded him a bachelor's degree. He then moved to Pittsburgh, Pennsylvania, where he served as a clerk within a law firm while studying the law. In 1897 he was admitted to the Pennsylvania bar in Allegheny County.\nThough McIlwain remained interested in law through his life, he quickly abandoned his legal career. In 1898 he received a master's degree from Princeton University, and began teaching Latin and history and coaching track and field at The Kiski School in Saltsburg. He left in 1901 to pursue a master's degree at Harvard University. After obtaining the degree in 1903 he began teaching history at Miami University.\nAcademic career\nIn 1905 Woodrow Wilson, then President of Princeton University, instituted a preceptorial system, a modified version of the tutorial system of Oxbridge, at Princeton. After interviewing McIlwain personally, Wilson appointed him to the inaugural group of 45 Princeton preceptors. McIlwain remained at Princeton until 1910, when he left to become the Thomas Brackett Reed Professor of History and Political Science at Bowdoin College. There he published his first book, The High Court of Parliament and Its Supremacy, which caught the attention of fellow historians and led to his appointment in 1911 as an assistant professor of history at Harvard. He was named a full professor of history and government in 1916.\nMcIlwain spent the rest of his academic career at Harvard, where he taught courses on the constitutional history of England and the history of political theory. In 1918 he edited a collection of political treatises and speeches of James VI and I, the king of England, Scotland, and Ireland. In 1923 he published The American Revolution: A Constitutional Interpretation, in which he argued that the American Revolution came about because of a disagreement over the interpretation of the constitution of the United Kingdom. The following year he received the Pulitzer Prize for History for this book. In 1926 he was appointed the Eaton Professor of the Sciences of Government at Harvard. In 1932 he published another book, The Growth of Political Thought in the West. In 1934 he was named a Fellow of the Medieval Academy of America. He served as President of the American Historical Association 1935–1936. He was also a member of the American Philosophical Society and a Corresponding Fellow of the British Academy.\nIn 1940 McIlwain published Constitutionalism: Ancient and Modern, in which he identified government power and an independent judiciary and the countervailing forces underlying constitutionalism. He also discussed the ancient Roman and English roots of United States constitutionalism. He published a revised version of this book in 1947. During 1944 McIlwain served as the George Eastman Visiting Professor at Oxford, the first person named to that post since the start of World War II. At Oxford he was a member of Balliol College. He retired from Harvard in 1946.\nLater life and legacy\nMcIlwain received honorary doctorates from the University of Chicago in 1941 and Yale University in 1951. He corresponded with the World Federalist Movement's Committee to Frame a World Constitution in the mid-1940s. He died on June 1, 1968. In 1986 a preceptorship at Princeton was established in his name. Eric Santner was the inaugural Charles H. McIlwain Preceptor.\nWorks\n* 1910 - The High Court of Parliament and Its Supremacy.\n* 1918 - The Political Works of James I (ed.)\n* 1924 - The American Revolution: A Constitutional Interpretation.\n* 1932 - The Growth of Political Thought in the West: From the Greeks to the End of the Middle Ages.\n* 1936 - ''The Historian's Part in a Changing World (Presidential address to the American Historical Association)\n* 1939 -\n* 1940 - Constitutionalism Ancient and Modern.\n* 1947 -  The Historian\nReferences\nExternal links\n*\n*\n* [https://archive.org/details/highcourtofparli00mciluoft Full text] of The High Court of Parliament and Its Supremacy'' at the Internet Archive"
    }
  ]
}