{
  "content": [
    {
      "type": "text",
      "text": "# Charlie Ward (fighter)\n\n| birth_place     = Mountmellick, Ireland\n| fighting_out_of = Dublin, Ireland\n| death_date      =\n| death_place     =\n| height          =\n| weight          =\n| weight_class    = MiddleweightWelterweight\n| reach           =\n| style           =\n| rank            =\n| stance          = Orthodox\n| teacher         =\n| team            = Straight Blast Gym Ireland\n| trainer         = John Kavanagh\n| years_active    = 2014–2023\n| kickbox_win     =\n| kickbox_kowin   =\n| kickbox_loss    =\n| kickbox_koloss  =\n| kickbox_draw    =\n| kickbox_nc      =\n| mma_kowin       = 6\n| mma_subwin      =\n| mma_decwin      = 4\n| mma_koloss      = 3\n| mma_subloss     = 1\n| mma_decloss     = 3\n| mma_draw        =\n| mma_nc          =\n| am_label        =\n| am_win          =\n| am_kowin        =\n| am_subwin       =\n| am_loss         =\n| am_koloss       =\n| am_subloss      =\n| am_draw         =\n| am_nc           =\n| other           =\n| occupation      =\n| spouse          =\n| relatives       =\n| students        =\n| university      =\n| url             =\n| boxrec          =\n| sherdog         = 163615\n}}\nCharlie Ward  (born 17 December 1980) is an Irish former mixed martial artist who competed in the middleweight division. A professional competitor since 2014, he formerly competed for the UFC and Bellator MMA.\nMixed martial arts career\nEarly career\nWard held an amateur record of 2–0 before beginning his professional MMA career in 2015, competing for regional promotions in the United Kingdom and Ireland. He lost his debut where he was stopped in round two by John Phillips. He rebounded with three straight victories, winning over Ciaran Daly, João Carvalho and Gareth Williams.\nUltimate Fighting Championship\nWard was signed by the UFC in 2016. with the record of 3–1.\nWard was expected to make his promotional debut against Randy Brown on 9 December 2016 at UFC Fight Night 102. However, Ward was pulled from that fight in early November due to alleged visa issues which restricted his travel to the United States and was replaced by fellow newcomer Brian Camozzi. In turn, he was quickly rescheduled to face Abdul Razak Alhassan on 19 November 2016 at UFC Fight Night: Mousasi vs. Hall 2. Ward suffered a quick defeat where he was finished via knockout in the fight's opening minute.\nWard faced Galore Bofando at UFC Fight Night: Nelson vs. Ponzinibbio on 16 July 2017. He lost the fight via knockout after Bofando slammed him to the mat with a hip toss early in the first round. He was subsequently released from the promotion.\nBellator MMA\nWard made the move to join Bellator MMA and made his debut on 10 November 2017 at Bellator 187 in Dublin against John Redmond. Ward knocked out Redmond at the end of round one, however referee Marc Goddard needed to verify that the knock out was before the buzzer. Conor McGregor, Ward's teammate, jumped the cage to celebrate with Ward before the fight was officially declared over. McGregor was separated from Goddard, and in turn charged towards Goddard and pushed and confronted Goddard in a wild melee which caused an official to bump into Redmond as he was getting up.\nMcGregor did a lap of the cage and exited a few minutes later but then scaled and straddled the cage apron to continue the celebration of Ward's winning. He was stopped by a commissioner and McGregor was agitated and slapped the commissioner's face as McGregor admitted saying \"Did you see your man trying to grab me and I gave him a clatter in the face\" Redmond stated after the fight that Goddard had intended to continue to fight to round two but Mohegan Sun commission who oversaw the event decided to end the fight and declared the win to Ward due to McGregor's behaviour in the ring.\nFor his second fight with the promotion, Ward faced Martin Hudson at Bellator 200 held in the Wembley Arena on 25 May 2018. He won the fight via TKO in the first round.\nWard faced Justin Moore at Bellator 223 on 22 June 2019. He won the fight via technical knockout in the second round.\nOn 15 August 2019, it was announced that Ward had signed an exclusive multi-fight, multi-year contract extension with Bellator. Ward was expected to face Pietro Penini at Bellator Dublin on 27 September 2019, but the bout was scrapped due to Ward's injury. Subsequently, the bout was rescheduled to Bellator London 2 on 23 November 2019. Ward lost the fight via unanimous decision.\nNext, Ward faced Kyle Kurtz at Bellator 240 on 22 February 2020. Ward rebounded from the loss via third-round knockout.\nWard faced Andy Manzolo at Bellator Milan 3 on 3 October 2020. He won the fight via unanimous decision.\nWard was scheduled to face Norbert Novenyi Jr. at Bellator 270 on November 5, 2021. On October 6, Norbert announced that he had suffered a torn ACL and had to pull out of the bout and was replaced by Fabian Edwards. Ward had to pull out however due to a ruptured bicep.\nWard faced Alan Carlos at Bellator 281 on May 13, 2022. He won the bout via unanimous decision.\nWard faced Fabian Edwards on October 29, 2022 at Bellator 287. He lost the bout via unanimous decision.\nWard faced Mike Shipman on February 25, 2023 at Bellator 291. He lost the bout via unanimous decision.\nWard faced Grégory Babene on September 23, 2023 at Bellator 299, losing the bout guillotine choke in the first round.\nDeath of João Carvalho\nWard's victory over João Carvalho by knockout at Total Extreme Fighting 1 on 9 April 2016 was overcast with a tragic circumstance.  Carvalho felt unwell, suffering from a headache 20 minutes after the fight and was sent to hospital for brain surgery. He died at Beaumont Hospital in Dublin 48 hours later as a result of injuries he suffered in the defeat. His death sparked an outpouring of grief from the MMA community.\nThe death of Carvalho aroused considerable debate, focusing on the sentiment that the fight should have been stopped much earlier. The referee who was in charge of the fight, Mariusz Domasat, defended his decision and said \"If you watch the fight you see clearly there was no reason to stop the fight earlier. I stopped the fight when there was a reason to stop the fight, when the fighter wasn't willing to fight anymore, that's it. Everyone who has any idea about MMA knows the fight was stopped at the exact proper time. I am an experienced referee and part of the Irish Amateur Pankration Association of Safe MMA and I know what I am doing.\" Subsequently, Minister for Travel, Tourism and Sport Michael Ring, reiterated his long concern of the safety aspect of the sport which he had written to 17 MMA promoters in Ireland where he expected MMA should adhere to the safety standards as applied in other sports.\nMixed martial arts record\n|-\n|Loss\n|align=center|10–7\n|Grégory Babene\n|Submission (guillotine choke)\n|Bellator 299\n|\n|align=center|1\n|align=center|1:03\n|Dublin, Ireland\n|\n|-\n|Loss\n|align=center|10–6\n|Mike Shipman\n|Decision (unanimous)\n|Bellator 291\n|\n|align=center|3\n|align=center|5:00\n|Dublin, Ireland\n|\n|-\n|Loss\n|align=center|10–5\n|Fabian Edwards\n|Decision (unanimous)\n|Bellator 287\n|\n|align=center|3\n|align=center|5:00\n|Milan, Italy\n|\n|-\n|Win\n|align=center|10–4\n|Alan Carlos\n|Decision (unanimous)\n|Bellator 281\n|\n|align=center|3\n|align=center|5:00\n|London, England\n|\n|-\n|Win\n|align=center|9–4\n|Andy Manzolo\n|Decision (unanimous)\n|Bellator Milan 3\n|\n|align=center|3\n|align=center|5:00\n|Milan, Italy\n|\n|-\n|Win\n|align=center|8–4\n|Kyle Kurtz\n|TKO (punches)\n|Bellator 240\n|\n|align=center|3\n|align=center|4:24\n|Dublin, Ireland\n|\n|-\n|Loss\n|align=center|7–4\n|Pietro Penini Jr.\n|Decision (unanimous)\n|Bellator London 2\n|\n|align=center|3\n|align=center|5:00\n|London, England\n|\n|-\n|Win\n|align=center|7–3\n|Justin Moore\n|TKO (punches)\n|Bellator 223\n|\n|align=center|2\n|align=center|3:23\n|London, England\n|\n|-\n|Win\n|align=center|6–3\n|Jamie Stephenson\n|KO (punch)\n|Bellator 217\n|\n|align=center|1\n|align=center|0:34\n|Dublin, Ireland\n|\n|-\n|Win\n|align=center|5–3\n|Martin Hudson\n|TKO (punches)\n|Bellator 200\n|\n|align=center|1\n|align=center|2:23\n|London, England\n|\n|-\n|Win\n|align=center|4–3\n|John Redmond\n|KO (punches)\n|Bellator 187\n|\n|align=center|1\n|align=center|4:59\n|Dublin, Ireland\n|Return to Middleweight.\n|-\n|Loss\n|align=center|3–3\n|Galore Bofando\n|KO (slam)\n|UFC Fight Night: Nelson vs. Ponzinibbio\n|\n|align=center|1\n|align=center|2:10\n|Glasgow, Scotland\n|\n|-\n| Loss\n| align=center| 3–2\n| Abdul Razak Alhassan\n| KO (punch)\n| UFC Fight Night: Mousasi vs. Hall 2\n|\n| align=center| 1\n| align=center| 0:53\n| Belfast, Northern Ireland\n|\n|-\n| Win\n| align=center| 3–1\n| Gareth Williams\n| Decision (majority)\n| Adrenalin Fight Nights: Adrenalin Blast\n|\n| align=center| 3\n| align=center| 5:00\n| Swansea, Wales\n|\n|-\n| Win\n| align=center| 2–1\n| João Carvalho\n| TKO (punches)\n| Total Extreme Fighting 1\n|\n| align=center| 3\n| align=center| N/A\n| Dublin, Ireland\n|\n|-\n| Win\n| align=center| 1–1\n| Ciaran Daly\n| Decision (unanimous)\n| Cage Kings 2\n|\n| align=center| 3\n| align=center| 5:00\n| Dublin, Ireland\n|\n|-\n| Loss\n| align=center| 0–1\n| John Phillips\n| KO (punch)\n| Fightstar Promotions: Rage in the Cage 3\n|\n| align=center| 2\n| align=center| 0:00\n| Paisley, Scotland\n|\n|-\nSee also\n* List of Irish UFC fighters\n* List of male mixed martial artists\nReferences\nExternal links\n*\n*"
    }
  ]
}