{
  "content": [
    {
      "type": "text",
      "text": "# Charles Carrington (historian)\n\nCharles Edmund Carrington, MC (21 April 1897 – 21 June 1990) was a scholar, Professor of History at Cambridge University, Educational Secretary to Cambridge University Press and a historian specializing in the British Empire and Commonwealth, a Professor of Commonwealth Relations at the Royal Institute of International Affairs (Chatham House) and the author of a number of books academic, learned and biographical. He was a decorated volunteer British Army officer, in World War I and again in World War II.\nEarly life\nCarrington was born in West Bromwich, then part of Staffordshire, England, in 1897. He moved to New Zealand with his family, where his father C. W. Carrington, became Dean of Christchurch.\nHe was educated at Christ's College, New Zealand and Christ Church, Oxford, graduating BA in 1921, promoted by seniority to MA in 1929.\nHis older brother Philip Carrington became a Church of England priest and was later Bishop of Quebec and Metropolitan of Canada.\nFirst World War\nWhen the First World War broke out in August 1914, Carrington was in England preparing for his university entrance examinations and enlisted in the British Army's Royal Warwickshire Regiment, although he was under age. In February 1915, an uncle obtained for him a commission as a second lieutenant into the 9th (Service) Battalion, the York and Lancaster Regiment, a Kitchener's Army unit, part of the 70th Brigade of the 23rd Division, where his job was to train his platoon. In August 1915 he was deemed too young to join the battalion in France.\nCarrington desperately wanted to fight, after spending more than a year training in England. He managed to obtain a transfer to the 1/5th Battalion, Royal Warwickshire Regiment, a Territorial Force battalion assigned to the 143rd (1/1st Warwickshire) Brigade of the 48th (South Midland) Division, and sailed to France in December. He spent six months in the trenches in a relatively quiet sector of the Western Front at Gommecourt before being transferred to the Battle of the Somme in July 1916.\nHe was promoted to Captain 1917. He was awarded the Military Cross.\nHe can be heard recounting some of his First World War experiences in Peter Jackson's film They Shall Not Grow Old. He also features in the BBC film clip, ″The voices behind They Shall Not Grow Old″\nCareer\nAfter being demobilised in 1919, he finished his education at Christ Church, Oxford, studying history. He became assistant master of the public school, Haileybury (1921–24 and 1926–29). Lecturer at Pembroke College, Oxford (1924–25). From 1929-1954 he was Educational Secretary to the Cambridge University Press.\nHe rejoined the British Army in the Second World War, serving as a liaison officer with the Royal Air Force and as Lt. Col. General Staff (1941–45).\nCarrington left Cambridge in 1954 to become Professor of Commonwealth Relations at the Royal Institute of International Affairs (the RIIA - Chatham House), a post he held until 1962. During that time he was also the Chatham House organiser responsible for the Commonwealth Relations conferences in New Zealand in 1959 and in Nigeria in 1962\nIn 1955, Macmillan published Carrington's life of Rudyard Kipling, and Graham Greene praised it as \"A very good biography - we are not left, as we so often are when we have closed an official life, with the thought \"here is a quarry where other men in the future may dig more profitably\". Mr Carrington has dug with effect. The quarry is closed\". Peter Quennell found the book \"sound, scholarly, yet never for a moment dull\".\nCarrington sat on the London County Council Education Committee; the Classical Association Council; the Publishers' Association Educational Group; The Royal Commonwealth Society Council; The Inter-University Council; The Overseas Migration Board; and the Islington Society, and was Chairman of Shoreditch Housing Association.\nMemoirs\nFrom his experiences in the First World War, Carrington wrote his memoirs of his time as an officer on the Western Front, ''A Subaltern's War. Written during and shortly after the war, the book was not published until 1929 and appeared under the pen-name of Charles Edmonds. In 1964, he recounted his experiences of the Great War to the BBC in a series of interviews for the project The Great War. These were broadcast in 2014 and again in 2016 as part of the commemoration of the centenary of the war.\nIn A Subaltern's War, Carrington sought to counter the widespread view that there was no other type of men who served in the war than \"Prussian militarists\" and \"disillusioned pessimists\": \"No corrupt sergeant majors stole my rations or accepted my bribes. No incompetent colonels failed to give me food or lodging. No casual staff officers ordered me to certain death, indifferent to my fate\".\nHe wrote of his Second World War experiences in Soldier at Bomber Command, published in 1987.\nIn 1965, Carrington provided a wider picture of both the First World War and his role in it in Soldier from the Wars Returning''. Carrington argued that Britain's involvement in the First World War was just and that there was no alternative to persevering until victory was won. Britain had reason to be proud of the Army's achievement. He wrote positively of the effect of Army training on recruits\nWhen the 1960s saw a more critical attitude of the War, expressed in Alan Clark's book The Donkeys and Joan Littlewood's play Oh, What a Lovely War!, Carrington praised the historian John Terraine's defence of Field Marshal Sir Douglas Haig, Commander-in-Chief (C-in-C) of the British Expeditionary Force (BEF) on the Western Front, and the record of the British Army.\nPersonal life\nIn 1932, Carrington married firstly Cecil Grace MacGregor, and they had one daughter. The marriage was dissolved in 1954. In 1955, he married secondly Maysie Cuthbert Robertson.\nWorks\n*''A Subaltern's War, Charles Edmonds [i.e. C. E. Carrington], Peter Davies Ltd. (1929).\n*History of England Part II, 1485-1714, C. E. Carrington and J. Hamden Jackson, Cambridge University Press, (1932)\n*T. E. Lawrence by Charles Edmonds [i.e. C. E. Carrington], Peter Davies, London (1935)\n*An Exposition of Empire, C.E. Carrington, Cambridge University Press (1947)\n*The British Overseas: exploits of a nation of shopkeepers, C.E. Carrington, Cambridge University Press, (1950)\n*John Robert Godley of Canterbury, C.E. Carrington, Cambridge University Press. (1951)\n*Rudyard Kipling: His Life and Work, C.E. Carrington, Macmillan, London (1955).\n*The Cambridge History of the British Empire; Vol 3,The Empire - Commonwealth with L.E.Benians, Sir James Butler and C.E. Carrington (editors), Cambridge University Press (1959)\n*Chatham House and its Neighbours : A Historical Sketch, C.E. Carrington, Royal Institute of International Affairs, 1959. With additions republished as Chatham House; Its History and Inhabitants, C.E. Carrington, Revised and updated by Mary Bone, Royal institute of International Affairs, 2004.\n*The Liquidation of the British Empire: The Reid Lectures of Acadia University 1959 , C.E. Carrington, George G. Harrap & Co, London (1961).\n*Soldier from the Wars Returning, C.E. Carrington, Hutchison (1965).\n*Soldier at Bomber Command'', C.E. Carrington, L. Cooper, London (1987).\n* Contributor to An African Survey (1957) Surveys of international Affairs (1957–58 and 1959-60), published by Chatham House\nNotes\nReferences\n*Brian Bond, Survivors of a Kind: Memoirs of the Western Front (London: Continuum, 2008).\nExternal links\n* [https://www.bbc.co.uk/programmes/p01td104   BBC Great War Interview]\n*[https://livesofthefirstworldwar.iwm.org.uk/lifestory/723966#remember We remember Charles Edward Carrington] Imperial War Museums' Lives of the First World War"
    }
  ]
}