{
  "content": [
    {
      "type": "text",
      "text": "# Charles King (professor of international affairs)\n\n| birth_place        =\n| death_date         =\n| death_place        =\n| death_cause        =\n| nationality        = American\n| citizenship        =\n| other_names        =\n| occupation         =\n| period             =\n| known_for          =\n| title              =\n| boards             =\n| education          =\n| alma_mater         =  University of Arkansas\n| discipline         =  International Affairs and government\n| sub_discipline     =\n| workplaces         = Georgetown University\n}}\nCharles King (born 1967) is an American academic who is the Professor of International Affairs and Government at Georgetown University, where he previously served as the chairman of the faculty of the Edmund A. Walsh School of Foreign Service.\nEducation\nA former Marshall scholar and Fulbright scholar, King holds a B.A. in history and B.A. in philosophy, both awarded summa cum laude from the University of Arkansas. He holds a M.Phil. in Russian and east European studies and a D.Phil. in politics from Oxford University where he was a Marshall Scholar. He is a member of the Phi Beta Kappa honors society.\nCareer\nAt Georgetown University, King teaches courses in comparative politics, East European studies, and international affairs. He is a three-time recipient of teaching awards from Georgetown University. Prior to joining the faculty of Georgetown University in 1996, he was the Rank and Manning Junior Research Fellow at New College, Oxford University, and a research associate at the International Institute for Strategic Studies in London. King has appeared on media outlets from CNN and BBC to the History Channel and MTV. He also has published articles and essays in World Politics, International Security, Slavic Review, Foreign Affairs, and other academic and popular publications.\nHe is the author of multiple books, including, Odessa: Genius and Death in a City of Dreams (W. W. Norton, 2011), Extreme Politics: Nationalism, Violence, and the End of Eastern Europe (Oxford University Press, 2010), The Ghost of Freedom: A History of the Caucasus (Oxford University Press, 2008), The Black Sea: A History (Oxford University Press, 2004), and The Moldovans: Romania, Russia, and the Politics of Culture (Hoover Institution Press, 2000).\nKing's book, Midnight at the Pera Palace: The Birth of Modern Istanbul (W.W. Norton, 2014) received a highly positive review by Jason Goodwin in the New York Times Book Review. King won the Francis Parkman Prize for his 2019 book Gods of the Upper Air: How a Circle of Renegade Anthropologists Reinvented Race, Sex, and Gender in the Twentieth Century.\nPartial bibliography\n*Ending Civil Wars (1997),\n*Nations Abroad: Diaspora Politics and International Relations in the Former Soviet Union (1998), co-editor,\n*Post-Soviet Moldova: A Borderland in Transition (1998),\n*The Moldovans: Romania, Russia, and the Politics of Culture (1999),\n*The Black Sea: A History (2004),\n*The Ghost of Freedom: A History of the Caucasus (2008),\n*Extreme Politics: Nationalism, Violence, and the End of Eastern Europe (2010),\n*[https://archive.org/details/odessageniusdeat0000king/mode/2up Odessa: Genius and Death in a City of Dreams] (2011),\n*Midnight at the Pera Palace: The Birth of Modern Istanbul (2014),\n*Gods of the Upper Air: How a Circle of Renegade Anthropologists Reinvented Race, Sex, and Gender in the Twentieth Century (2019),\n* ''Every Valley: The Desperate Lives and Troubled Times That Made Handel's Messiah (2024),\nAwards\n* 2011: National Jewish Book Award in Writing Based on Archival Material for Odessa: Genius and Death in a City of Dreams\n* 2020: Francis Parkman Prize and Anisfield-Wolf Award for Gods of the Upper Air: How a Circle of Renegade Anthropologists Reinvented Race, Sex, and Gender in the Twentieth Century''\nReferences\nExternal links\n*[http://www.charles-king.net/ Charles King] Author Website\n*\n*[https://web.archive.org/web/20161005230434/http://newbooksinhistory.com/?p=2138 Interview] with King on \"New Books in History\""
    }
  ]
}