{
  "content": [
    {
      "type": "text",
      "text": "# Charles Howard Lloyd\n\n}}\nCharles Howard Lloyd (October 12, 1873 – September 21, 1937) was an American architect based in Harrisburg, Pennsylvania. Active in the early 20th century, he became one of the city’s most prominent designers, producing civic, educational, residential, and commercial buildings during the City Beautiful movement. His works include the Zembo Shrine, Simon Cameron School, Telegraph Building (Harrisburg, Pennsylvania), and private residences such as the David E. Tracy Mansion.\nEarly life and career\nLloyd was born in Lisburn, Pennsylvania, in October 1873. By the 1890s he was practicing architecture in Harrisburg. His early commissions included the Simon Cameron School (1896), a Renaissance Revival building that was later expanded in 1904. He went on to design several other schools, including the Edison School, A.H. Boas School, William S. Steele School, and Shimmell School.\nIn 1908, Lloyd designed the Commercial Trust (Furlow) Building, a Beaux-Arts style bank building. The following year he collaborated on the Harrisburg Telegraph Building, an early steel-frame office building that served as the Harrisburg Telegraph newspaper's headquarters. In 1910, he rebuilt the facade of Harrisburg’s Technical High School (later known as Old City Hall) in a Collegiate Gothic style.\nBy the 1920s, Lloyd had established himself as Harrisburg’s leading architect. He was commissioned for William Penn High School (1926), and in 1928 won the design competition for the Zembo Shrine, a Moorish Revival fraternal auditorium completed in 1930.\nNotable works\nZembo Shrine Building\nDedicated on May 19, 1930, the Zembo Shrine Building cost a reported $1 million. Executed in a Moorish Revival style with Art Deco elements, it has been described as one of Harrisburg’s most distinctive landmarks. The complex covers approximately 62,600 square feet on 7.3 acres and originally seated up to 2,475 people depending on configuration. Its interiors include an ornate “Tile Room” with extensive colored tilework. The building was added to the National Register of Historic Places in 2024.\nDavid E. Tracy Mansion\nCompleted 1917, the Tracy Mansion is a large riverfront residence designed in the Tudor Revival style for industrialist David E. Tracy. The three-story house contained about 30 rooms and occupies a 1.5-acre parcel extending from Front Street to Second Street. Features included hardwood floors, decorative wall murals, and an iron-cage elevator. The building underwent multiple reuses, serving as a private residence, the Harrisburg Osteopathic Hospital (1951), a mental health facility, a restaurant, and later office space.\nDeath\nLloyd died in Harrisburg on September 21, 1937, at the age of 63. He was buried in East Harrisburg Cemetery.\nLegacy\nLloyd’s body of work made him a prominent architect Harrisburg in the early 20th century, comparable to regional contemporaries such as John A. Dempwolf of York and C. Emlen Urban of Lancaster. His buildings remain examples of architectural styles popular in the era, including Tudor Revival, Beaux-Arts, Collegiate Gothic, and Moorish Revival.\nSelected works\nPublic / Educational buildings\n* Simon Cameron School (1896/1904) – Second Renaissance Revival schoolhouse, (extant)\n* Harrisburg Technical High School (1905/1910) – Collegiate Gothic civic complex, now apartments (extant)\n* Edison School – (1910s), now apartments (exant)\n* A.H. Boas School – (1922), now apartment complex (extant)\n* William S. Steele School – (1910s)\n* Shimmell School – (1916), now business office (exant)\n* William Penn High School (1926)\nCivic / Commercial buildings\n* Commercial Trust (Furlow) Building (1908) – Beaux-Arts style bank (extant)\n* Telegraph Building (Harrisburg, Pennsylvania) (1909–1910) – Chicago/Italianate high-rise office; demolished 1980\n* Zembo Shrine Building (1928–1930) – Moorish Revival/Art Deco (extant)\nResidential buildings\n* David E. Tracy Mansion (1917) – Tudor Revival style residence, later hospital, restaurant, and now commercial office (extant)\n* Moffitt Mansion (1895) – Queen Anne–style residence, now commercial office (extant)\n* 1100 block of Green Street (early 1900s) – residential town homes (extant)\nSee also\n* City Beautiful movement\n* Moorish Revival architecture\n* Tudor Revival architecture\n* Queen Anne architecture\n* Collegiate Gothic\n* History of Harrisburg, Pennsylvania\nReferences\nExternal links\n* [https://www.findagrave.com/memorial/124476679/charles_howard-lloyd Charles Howard Lloyd (1873-1937) - Find a Grave...]"
    }
  ]
}