{
  "content": [
    {
      "type": "text",
      "text": "# Charles Edward Clark\n\n| birth_place         = Woodbridge, Connecticut, U.S.\n| death_date          =\n| death_place         = Hamden, Connecticut, U.S.\n| death_cause         =\n| resting_place       =\n| resting_place_coordinates =\n| citizenship         =\n| nationality         =\n| party               = Republican\n| otherparty          =\n| height              =\n| spouse              =\n| partner             =\n| relations           =\n| children            =\n| parents             =\n| mother              =\n| father              =\n| relatives           =\n| residence           =\n| education           = Yale University (BA, LLB)\n| alma_mater          =\n| occupation          =\n| profession          =\n| known_for           =\n| salary              =\n| net_worth           =\n| cabinet             =\n| committees          =\n| portfolio           =\n| awards              =\n| signature           =\n| signature_alt       =\n| website             =\n| footnotes           =\n}}\nCharles Edward Clark (December 9, 1889 – December 13, 1963) was the 5th Dean of Yale Law School and a United States circuit judge of the United States Court of Appeals for the Second Circuit.\nEducation and career\nBorn on December 9, 1889, in Woodbridge, Connecticut, to Samuel Orman Clark and Pauline C. Marquand, Clark received a Bachelor of Arts degree in 1911 from Yale University. He received a Bachelor of Laws in 1913 from Yale Law School. He entered private practice in New Haven, Connecticut from 1913 to 1919. He was a member of the Connecticut House of Representatives from 1917 to 1918, and was Republican. He was a professor of law at Yale Law School from 1919 to 1929. He was a Deputy Judge of the Hamden, Connecticut Town Court from 1927 to 1931. He was the Sterling Professor of Law and Dean of Yale Law School from 1929 to 1939. He was Special Assistant Attorney General for the Antitrust Division of the United States Department of Justice in 1938.\nFederal judicial service\nClark was nominated by President Franklin D. Roosevelt on January 5, 1939, to the United States Court of Appeals for the Second Circuit, to a new seat authorized by 52 Stat. 584. He was confirmed by the United States Senate on March 7, 1939, and received his commission on March 9, 1939. He served as Chief Judge and as a member of the Judicial Conference of the United States from 1954 to 1959. His service terminated on December 13, 1963, due to his death in Hamden.\nOther service\nClark was a visiting lecturer in law at Yale University from 1951 to 1963.\nReferences\nExternal links\n* [https://archiveswest.orbiscascade.org/ark:80444/xv388479?q=01134 Charles E. Clark papers] are archived at the American Heritage Center, University of Wyoming.\n*\nFurther reading\n*\n|years=1939–1963}}\n|years=1954–1959}}"
    }
  ]
}