{
  "content": [
    {
      "type": "text",
      "text": "# Charles Howard (photographer)\n\nCharles Howard (–?) was an American photographer. He was a private in the Fourth Infantry, and served as photographer for the Stanton Expedition in 1877, traveling throughout eastern Wyoming, western Nebraska and into the Black Hills of Dakota Territory.\nEarly years\nCharles Howard was born, according to his enlistment record, in about 1842 in Rockingham County, Virginia. Little is known of his early life. He is probably the Charles Howard recorded in the 1870 census in Portsmouth, Ohio.\nOn June 16, 1875, Howard decided to enlist in the army, going into a recruiting office in Cleveland, Ohio. His enlistment papers describe the thirty-three-year-old man as 5 foot 5&nbsp;inches tall, with hazel eyes, brown hair and a dark complexion. From Cleveland, he was sent to Newport Barracks, Kentucky for orientation. A musician by trade, Recruit Howard was assigned to the Fourth Infantry Band. He was sent to Fort Omaha, Nebraska, headquarters of the Department of the Platte, and then left with 158 other new recruits aboard a Union Pacific train for Carter Station in southwest Wyoming. From there, the detachment of recruits marched the eleven miles south to Fort Bridger, headquarters of the Fourth Infantry, where they arrived on the afternoon of September 10, 1875.\nFort Bridger\nPhotographers had been passing through this frontier military post since almost the inception of the art form. Daguerreotypist John Wesley Jones visited the garrison in 1851 and Samuel C. Mills, traveling with the Army bound for Utah, produced at least one image of Fort Bridger in 1858. Salt Lake City photographer Charles W. Carter came during the winter of 1866–67 and his former mentor, Charles Savage, visited a number of times between 1866 and the early 1870s. The noted Union Pacific Railroad photographer Andrew J. Russell also stopped here in 1869. Census records show a photographer named Simeon Pierson at the post in 1870. Fort Bridger had a long tradition of photographers at the post.\nIt is not known if Private Howard had previously trained as a photographer or if he acquired his skills after arriving at Fort Bridger, but by the summer of 1876, he was actively producing photographs of the post and the surrounding area. He created landscape views of the Black River Valley and of nearby Church Buttes in the Green River badlands, as well as views of the fort itself. Private Howard also produced portraits. Captain William H. Bisbee, Fourth Infantry, sent a payment for photographs of his child to Howard through the post trader at Fort Bridger, complaining that \"they are not at all good.\" Two tintypes, bearing the name \"C. Howard, Artistic Photographer, Fort Bridger, Wy. Ty.\" have survived, examples of this soldier-photographer's portraiture work.\nLife for Private Howard at Fort Bridger was probably typical of the experience of most soldiers stationed at frontier posts. Private Howard's duty with the regimental band however did afford him a few privileges and an occasional opportunity to travel off the garrison. In July 1876, for example, he and other bandsmen were invited to Ogden, Utah Territory, to perform at a town celebration. Private Howard was then granted three days leave in Salt Lake City. Here he could have obtained additional photography supplies at establishments such as the Art Bazaar, the studio of the noted photographer Charles Savage, before returning to Fort Bridger.\n'''Examples of Howard's Photographs From Fort Bridger''', c.&nbsp;1875–77\n* [http://contentdm.lib.byu.edu/cdm4/item_viewer.php?CISOROOT=/Savage&CISOPTR=1136&CISOBOX=1&REC=4 \"Black Fork Valley at Fort Bridger.\"] Brigham Young University.\n* Officers' Quarters, Fort Bridger. American Heritage Center.\n* Portrait of Nelson Carter, Carter Collection, Wyoming State Archives.\n* Portrait of Edgar Carter, Carter Collection, Wyoming State Archives.\n* Unidentified Indian outside Judge Carter's Store, Fort Bridger. Private Collection.\nExamples of Photos by Other Photographers and Reprinted by Howard\n* Unidentified Apache. Original image taken on Wheeler Expedition, 1872; reprinted by Charles Howard, Fort Bridger. Cowan Auctions, June 2007.\nStanton Expedition\nIn the spring of 1877, Captain William S. Stanton, Chief Engineer for the Department of the Platte, began preparations for his continued work mapping the major roads in Nebraska and Wyoming. Hearing of Private Howard, Stanton wrote to the commanding officer at Fort Bridger requesting the services of the soldier. \"I have thought it would be an excellent opportunity to get a set of photographic views of the posts and the most characteristic features in the scenery of the regions visited,\" Stanton wrote, \"including views in the Black Hills and at the large Indian encampments.\" The engineering officer also noted that the photographic expedition might also be \"to the advantage and perhaps profit of the man himself.\"\nPrivate Howard was detailed for duty with the expedition, departing Fort Bridger on June 27, 1877. His camera, chemicals and developing equipment were forwarded to Cheyenne shortly afterward, where the expedition assembled on July 5 to make final preparations for their departure. In Cheyenne, Howard produced his first photographs of the expedition, including a view of the Cheyenne Army Depot. From this collection of warehouses, army supplies were unloaded from rail cars and shipped overland to military posts throughout Wyoming. He also made a least four images at nearby Fort D. A. Russell. Stanton's expedition departed on July 11, mapping the road north towards the Black Hills.\nSecond Cavalry Camp near Fort Fetterman, Wyoming Territory. Photograph by Private Charles Howard, September 1877. Courtesy Signal Corps Collection (RG 111), Still Pictures Branch, National Archives. The expedition spent two weeks at Fort Laramie and then continued north, arriving in Deadwood on August 11. The expedition then surveyed the road west from Deadwood. Shortly after crossing into eastern Wyoming, the expedition camped near Sun Dance Hill, near present Sundance, Wyoming. Several members of the survey part climbed to its summit and Private Howard photographed the prominent landmark. The expedition arrived at Cantonment Reno (Fort McKinney) on August 26, where Howard produced several photographs of the post and its buildings. The expedition then headed south to Fort Fetterman. Arriving on September 4, Howard also produced images of this post. The expedition then headed south to Rock Creek Station on the Union Pacific Railroad and then returned to Fort Laramie.\nThe Stanton Expedition next traveled to Camp Robinson and the Red Cloud Agency, arriving on September 30 just over three weeks after the famed Oglala war leader Crazy Horse had been fatally bayonetted. Private Howard produced some of his most important images of the expedition during their four days at Camp Robinson. He appears to have also made a quick trip to nearby Camp Sheridan and the Spotted Tail Agency.\nThe expedition then headed north to the Black Hills again, this time mapping the northern extension of the Sidney-Deadwood trail. They returned along another Black Hills trail, arriving back at Camp Robinson on October 25, the same day that the Oglala left the Red Cloud Agency for their new home on the Missouri River, escorted by two companies of the Third Cavalry. With winter rapidly descending on the northern Great Plains, the Stanton Expedition departed Camp Robinson on October 28, heading south to Sidney Barracks through four to six inches of snow. The weary party arrived in Sidney on November 2 where Private Howard produced one of his final photographs of the expedition. After four months in the field, the soldiers had mapped some thirteen hundred miles of trails through western Nebraska, eastern Wyoming and the Black Hills of Dakota Territory. \"I have made quite a collection of negatives this season,\" Private Howard wrote to a friend at Fort Bridger, \"but had a pretty rough trip of it.\"\nFollowing the disbandment of the expedition, Private Howard was ordered to accompany Captain Stanton back to Department Headquarters in Omaha where the soldier remained for some eight months, printing his photographs. By early 1878, he had opened his own photographic studio on Douglas Street in Omaha and began selling his images as large format prints, stereoviews and carte-de-vistas. His catalog printed on the back of his stereoviews listed 78 different images for sale.\nWhile in Omaha, Howard apparently met another photographer named D. S. Mitchell who had recently established the Great Western Photograph Publishing Company with his partner, Joseph H. McGowan. The name of the firm soon changed from Mitchell & McGowan to Mitchell, McGowan & Company, suggesting that other photographers became part of the partnership. Based on the fact that the company began printing Howard's views as a set of 43 stereocards called \"Military Posts and Indian Views\", Private Howard probably joined the firm for a short time. Mitchell's photographic company broke up in the summer and fall of 1878. McGowan moved to North Platte while Mitchell opened a new portrait gallery of his own called the Bee Hive Studio on Sixteenth Street in Omaha. Lacking funds to continue his survey of military roads, Captain Stanton decided not to attempt another summer of field work and released Private Howard from his service in Omaha, sending him back to his old regiment.\n'''Examples of Howard's Photographs From Stanton Expedition, 1877:'\nCheyenne, July 1877\n* [http://cdm16003.contentdm.oclc.org/cdm/singleitem/collection/p15150coll2/id/11382/rec/8 Cheyenne]. Huntington Library.\n* Cheyenne Depot. Possibly by Private Howard. Bourke Diaries, U.S. Military Academy Library, West Point. Published in Paul Hedron, Fort Laramie in 1876 (Lincoln: University of Nebraska Press, 1988) p.&nbsp;55.\n* Camp Carlin. Possibly by Private Howard. Wyoming State Archives.\nFort Laramie, July or September 1877''\n* [http://cdm16079.contentdm.oclc.org/cdm/singleitem/collection/p15330coll22/id/27527/rec/5 Fort Laramie]. Huntington Library, Denver Public Library and National Archives.\n* [http://cdm16003.contentdm.oclc.org/cdm/singleitem/collection/p15150coll2/id/11388/rec/9 Old Bedlam], Fort Laramie. Huntington Library and American Heritage Center.\n* Post Trader's store. Possibly by Private Howard.\n* [http://sirismm.si.edu/naa/baegn/gn_04047b.jpg Indian Graves near Fort Laramie.] Smithsonian Institution.\n* Platte River Bridge. Bourke Diaries, U.S. Military Academy Library, West Point and private collection (eBay Sept 2008).\nBlack Hills, August or October 1877\n* [http://cdm16079.contentdm.oclc.org/cdm/singleitem/collection/p15330coll22/id/64475/rec/1 Sundance Hill, Black Hills]. Taken Aug. 19–20, 1877. Denver Public Library.\n* \"51. Camp in the Black Hills.\" Possible view of Stanton Expedition encampment. Sold on eBay Sept. 2008.\n* possibly \"52. Custer City.\" Mislabeled as Camp Sheridan. Sold on eBay Sept. 2008.\n* \"53. Bear Rock near Custer City on French Creek, Black Hills.\" Same image published by Stanley J. Morrow. Sold on eBay Sept. 2008.\n* \"56. Deadwood City, D.T.\" Sold on eBay Sept. 2008.\n* \"60. Leed's City\" [Lead City, Dakota Territory]. Sold on eBay Sept. 2008.\n* \"Blacksmith Shop, Custer City.\" Sold on eBay Sept. 2008.\n* Unidentified group, possibly of surveyors on Stanton Expedition. Private collection. Sold on eBay Dec. 2007.\nCantonment Reno/Fort McKinney, Aug. 1877\n* \"3. Group of Officers, Fort McKinney, Wyo.\" Bourke Diaries, U.S. Military Academy Library, West Point.\n* \"8. View of Fort McKinney, Powder River.\" Bourke Diaries, U.S. Military Academy Library, West Point.\n* [http://cdm16003.contentdm.oclc.org/cdm/singleitem/collection/p15150coll2/id/11389/rec/11 Fort McKinney]. Huntington Library.\n* [http://cdm16003.contentdm.oclc.org/cdm/singleitem/collection/p15150coll2/id/11390/rec/2 \"12. Work in a Frontier Post; erecting quarters at Fort McKinney.\"] Huntington Library and Bourke Diaries, U.S. Military Academy Library, West Point.\n* \"Ruins old Fort Reno.\" Probably by Private Howard. Bourke Diaries, U.S. Military Academy Library, West Point.\nFort Fetterman, Sept. 1877\n* Fort Fetterman. Nebraska State Historical Society.\n* [http://cdm16003.contentdm.oclc.org/cdm/singleitem/collection/p15150coll2/id/11386/rec/16 Fort Fetterman]. Huntington Library (misidentified as Fort Laramie).\n* Camp of 2nd Cavalry, Fort Fetterman. Huntington Library, Signal Corps Collection (RG111), National Archives; and private collection.\n* [http://cdm16003.contentdm.oclc.org/cdm/singleitem/collection/p15150coll2/id/11384/rec/4 Officers Quarters], Fort Fetterman. Huntington Library.\n* Group of Officers, Fort Fetterman. American Heritage Center.\nBetween Rock Creek and Fort Laramie, Sept. 1877\n* \"28. Laramie Peak.\" Bourke Diaries, U.S. Military Academy Library, West Point.\n* [http://cdm16003.contentdm.oclc.org/cdm/singleitem/collection/p15150coll2/id/11385/rec/6 View near Laramie Peak], Huntington Library.\nCamp Robinson, Oct. 1877\n* [http://cdm16003.contentdm.oclc.org/cdm/singleitem/collection/p15150coll2/id/11381/rec/5 Camp Robinson]. Huntington Library, U.S. Military Academy and South Dakota Historical Society.\n* [http://cdm16079.contentdm.oclc.org/cdm/singleitem/collection/p15330coll22/id/82524/rec/4 Gen. Bradley's Quarters (large format print)]. Denver Public Library\n* [http://www.cartermuseum.org/emuwebacm/objects/common/webmedia.php?irn=10295&reftable=ecatalogue&refirn=162289 Gen. Bradley's Quarters (stereoview)], Amon Carter Museum of American Art\n* [http://cdm16079.contentdm.oclc.org/cdm/singleitem/collection/p15330coll22/id/82522/rec/3 Group of Officers with Indian scout]. Denver Public Library\n* [http://cdm16079.contentdm.oclc.org/cdm/singleitem/collection/p15330coll22/id/82528/rec/1 Post Sutler Store]. Denver Public Library\nRed Cloud Agency, Oct. 1877\n* [http://cdm16003.contentdm.oclc.org/cdm/singleitem/collection/p15150coll2/id/11393/rec/13 Red Cloud Agency]. Huntington Library and Wyoming State Archives.\n* [http://cdm16079.contentdm.oclc.org/cdm/singleitem/collection/p15330coll22/id/64474/rec/5 Crow Butte]. Denver Public Library\n* [http://cdm16079.contentdm.oclc.org/cdm/singleitem/collection/p15330coll22/id/31769/rec/4 Arapaho Men]. Denver Public Library\n* Red Dog's Village. Nebraska State Historical Society.\n* Beef Issue, at Red Cloud Agency. Nebraska State Historical Society.\n* Little Big Man's Tepees, Red Cloud Agency. Smithsonian Institution.\nCamp Canby\n* [http://cdm16003.contentdm.oclc.org/cdm/singleitem/collection/p15150coll2/id/11379/rec/3 Old Camp Canby]. Huntington Library.\nCamp Sheridan and the Spotted Tail Agency, Oct. 1877\n* [http://cdm16003.contentdm.oclc.org/cdm/singleitem/collection/p15150coll2/id/11383/rec/1 Camp Sheridan, Nebraska.] Huntington Library, U.S. Military Academy and Smithsonian Institution.\n* [http://sirismm.si.edu/naa/baegn/gn_00051.jpg Sioux Village on White River.] Smithsonian Institution and Denver Art Museum.\n* Minneconjoux Village. Denver Art Museum.\n* Beef Issue at Spotted Tail's Agency. Princeton University and U.S. Military Academy.\n* Spotted Tail's Family. U.S. Military Academy and Museum of New Mexico\n* [http://www.cowanauctions.com/itemImages/xx3534.jpg Red Bear], Sioux. Private collection.\n* Crazy Horse's Grave. Bourke Collection, U.S. Military Academy.\n* Crazy Horse's Grave. Sold on eBay Sept. 2008.\nSidney Barracks, Nov. 1877\n* Sidney Barracks. Denver Public Library\nFort Sanders\nIn July 1878, Private Howard was transferred back to his original assignment with the Fourth Infantry Band, now stationed at Fort Sanders near Laramie, Wyoming. At his new assignment, Howard set up another portrait gallery and produced images for the officers, men and their families stationed at the post. He also reprinted some of Mitchell, McGowan & Company original images, suggesting that he may have kept some of the negatives when the partnership was dissolved. One surviving image bears the imprint of \"Howard & Johnston, Fort Sanders, Wyoming Territory, suggesting that Howard took on a partner. This may be William J. Johnston, a Canadian who came to Wyoming in 1880 and established a portrait studio in Green River. This may be the same Johnston who later joined Charles S. Baker in Evanston, Wyoming, to produce a series of prints of Shoshone, Arapaho and Apache portraits.\nPrivate Charles Howard completed his enlistment and was discharged from the Army in June 1880. What became of him after this currently remains a mystery. No further documentation of this soldier/photographer has yet been found.\n'''Examples of Howard's Photographs From Fort Sanders', circa. 1878–80\n* [http://digitalcollections.uwyo.edu:8180/luna/servlet/detail/uwydbuwy~1~1~255723~156319:Fort-Sanders,-Wyoming?qvq=q:fort%2Bsanders;lc:uwydbuwy~88~88,uwydbuwy~89~89,uwydbuwy~108~108,uwydbuwy~43~43,uwydbuwy~96~96,uwydbuwy~54~54,uwydbuwy~34~34,uwydbuwy~104~104,uwydbuwy~112~112,uwydbuwy~24~24,uwydbuwy~63~63,uwydbuwy~60~60,uwydbuwy~35~35,uwydbuwy~32~32,uwydbuwy~31~31,uwydbuwy~23~23,uwydbuwy~80~80,uwydbuwy~72~72,uwydbuwy~42~42,uwydbuwy~93~93,uwydbuwy~87~87,uwydbuwy~81~81,uwydbuwy~71~71,uwydbuwy~17~17,uwydbuwy~75~75,uwydbuwy~65~65,uwydbuwy~84~84,uwydbuwy~98~98,uwydbuwy~40~40,uwydbuwy~114~114,uwydbuwy~111~111,uwydbuwy~92~92,uwydbuwy~33~33,uwydbuwy~41~41,uwydbuwy~25~25,uwydbuwy~83~83,uwydbuwy~102~102,uwydbuwy~46~46,uwydbuwy~77~77,uwydbuwy~48~48,uwydbuwy~85~85,uwydbuwy~20~20,uwydbuwy~66~66,uwydbuwy~57~57,uwydbuwy~44~44,uwydbuwy~21~21,uwydbuwy~36~36,uwydbuwy~58~58,uwydbuwy~91~91,uwydbuwy~38~38,uwydbuwy~67~67,uwydbuwy~53~53,ahc-ludwig~1~1,uwydbuwy~62~62,uwydbuwy~78~78,uwydbuwy~26~26,uwydbuwy~95~95,uwydbuwy~50~50,uwydbuwy~1~1,uwydbuwy~90~90,uwydbuwy~19~19,uwydbuwy~82~82,uwydbuwy~56~56,uwydbuwy~52~52,uwydbuwy~79~79,uwydbuwy~73~73,uwydbuwy~55~55,uwydbuwy~110~110,uwydbuwy~100~100,ahc-throssel~1~1,uwydbuwy~101~101,uwydbuwy~68~68,uwydbuwy~94~94,uwydbuwy~27~27,ahc-turner~1~1,uwydbuwy~30~30,uwydbuwy~74~74,uwydbuwy~22~22,uwydbuwy~15~15,uwydbuwy~39~39,uwydbuwy~18~18,uwydbuwy~16~16,uwydbuwy~64~64,uwydbuwy~86~86,uwydbuwy~115~115,uwydbuwy~103~103,uwydbuwy~113~113,uwydbuwy~49~49,uwydbuwy~59~59,uwydbuwy~109~109,uwydbuwy~70~70,uwydbuwy~105~105,uwydbuwy~97~97,uwydbuwy~51~51,uwydbuwy~76~76,uwydbuwy~37~37,uwydbuwy~28~28,uwydbuwy~29~29&mi=0&trs=12 Officers Quarters], Fort Sanders, Wyoming. American Heritage Center.\n* [http://www.trapdoorcollector.com/pics_html/chachula3.jpg Unidentified 3rd Cavalryman] Bill Chachula Collection. Published in: Douglas C. McChristian, Uniforms, Arms, and Equipment: The U.S. Army on the Western Frontier, 1880–1892'', vol. 1 (Norman, OK: University of Oklahoma Press, 2007) p.&nbsp;16 (figure 1.4).\n* First Sergeant John Henry Shingle, Company I 3rd Cavalry. By Howard & Johnston. Hayes Otoupalik Collection.\n* [http://www.cowanauctions.com/itemImages/nn0556.jpg Unidentified soldiers], possibly in a play. Private collection.\nExamples of Photos Reprinted by Howard\n* Portrait of Brigadier General George Crook, taken in January 1877 in Cheyenne, Wyoming Territory, by D. S. Mitchell. Reprinted by Private Charles Howard. Wyoming State Archives.\n* Portrait of Young Man Afraid of His Horses, probably taken in the fall of 1877 at the Red Cloud Agency, Nebraska, by D. S. Mitchell. Reprinted by Private Charles Howard. American Heritage Center.\nNative American photographs\nWhile the majority of Private Howard's surviving images can best be described as outdoor views, including landscapes, he did produce a small number of photographs of Native Americans. All of his surviving Indian photographs were taken outdoors, as opposed to within a studio setting. His earliest is an image of an unidentified Indian, presumably Shoshone, wrapped in a blanket outside Judge Carter's post trader store at Fort Bridger, circa 1875–1877.\nThe majority of his Native American views are from the Red Cloud and Spotted Tail Agencies, located in northwestern Nebraska, taken in October 1877 while he was part of the Stanton Expedition. He produced a number of views of Indian camps as well as images of prominent Lakota leaders outside their lodge. He photographed Spotted Tail, White Thunder and Two Strike, all prominent Brule headmen. Of the Minneconjou and Sans Arc leaders who had recently surrendered at the Spotted Tail Agency, he was able to photograph Touch the Clouds, Red Bear and Roman Nose. The famed Oglala war leader Crazy Horse had been killed three weeks prior to Private Howard's visit, but the photographer did capture at least two images of Crazy Horse's scaffold grave, located on a bluff overlooking Camp Sheridan.\nOn his printed list of available views pasted on the back of his stereocards (circa. 1878), Howard advertised that he also had \"Numerous Pictures 'Card Size' of Indians of Different Tribes.\" Many of these may actually be reprints of the work of other photographers.\nReferences\nBibliography\n* \"Soldier With a Camera: Private Charles Howard's Photographic Journey Through Eastern Wyoming, 1877,\" by Ephriam D. Dickson III, Annals of Wyoming, vol. 77 no. 4 (Autumn 2005) pp.&nbsp;22–32.\n* \"Crazy Horse's Grave: A Photograph by Private Charles Howard, 1877,\" by Ephriam D. Dickson III, Little Big Horn Associates Newsletter, vol. XL, no. 1 (Feb. 2006) pp.&nbsp;4–5.\n* \"Capturing the Lakota Spirit: Photographers at the Red Cloud and Spotted Tail Agencies,\" by Ephriam D. Dickson III, Nebraska History, vol. 88 no. 1&2 (Spring-Summer 2007) pp.&nbsp;2–25.\n* \"A New Photograph of Crazy Horse's Grave,\" by Ephriam D. Dickson III, Little Big Horn Associates Newsletter, vol. XLIII, no. 3 (Apr. 2009) pp.&nbsp;4–5. This article discusses a newly discovered photograph of Crazy Horse's scaffold, also taken by Private Charles Howard."
    }
  ]
}