{
  "content": [
    {
      "type": "text",
      "text": "# Charles Edward Chapel\n\n| birth_place         = Manchester, Iowa\n| death_date          =\n| death_place         = Sacramento, California\n| state_assembly      = California\n| district            = 46th\n| term                = January 8, 1951 – February 20, 1967\n| preceded            = Glenn M. Anderson\n| succeeded           = Robert G. Beverly\n| party               = Republican\n| spouse              =\n| children            =\n| education           = University of IowaUniversity of MissouriUnited States Naval Academy\n}}\nCharles Edward Chapel (May 16, 1904 – February 20, 1967) was an American politician, college professor, and technical writer best known for his articles and books about firearms.\nEarly life\nChapel was born in Manchester, Iowa on May 16, 1904. He graduated from the University of Iowa, the University of Missouri with degrees in aeronautical engineering. He also graduated from the Naval Academy in Annapolis. He was considered an expert in aeronautical engineering, criminal investigation, fingerprinting, firearms, metallurgy, navigation, and psychology.\nHe saw active service as a lieutenant with the U.S. Marines in Nicaragua and China. He served in Panama, Cuba, and the Philippines. He was discharged in 1937 after being wounded.\nCareer\nAfter the military, Chapel worked as an aeronautical engineer at Northrop Corporation in California and wrote or helped edit many of the technical manuals for the industry. He also wrote several articles on ballistics and fingerprinting for the police.\nChapel became the director of ground training for students at the U.S. Motorless Flight School at Palms, California. He became the head of the department of aeronautical engineering at the Polytechinc College of Engineering in Oakland, California. In 1946, he became the research and developmental director for the Northrop Aeronautical Institute (later called Northrup University).\nBased on a pro-gun stance, Chapel entered Republican politics in 1950, serving in the California State Assembly for the 46th district from 1951 until he died in office in 1967.  He was a Presidential Elector in 1956.\nChapel wrote about a variety of subjects such as aviation and forensics, as well as firearms. The exact number of articles is not known. Still, it could be as high as several thousand, including 3,000 for Hobbies Magazine. Although he wrote articles on a variety of subjects, most of his books were about firearms, starting with Gun Collecting in 1939.  His 1940 book, ''The Gun Collector's Handbook of Values was one of the first to provide values for non-professionals, and he contributed to later editions for many years.  From the 40s until his death, he wrote at least nine books on gun topics. His most well-known book, Guns of the Old West, is considered a standard reference for Western firearms studies\nPersonal life\nChapel married Dorothy Jane Messner Young in 1952. They had four children. Chapel was active in several organizations, including the National Rifle Association of America (NRA) and the Veterans of Foreign Wars.\nHe died on February 20, 1967, in Sacramento, California from a heart attack in his sleep.\nSelect publications\nBooks\n* Gun Collecting (New York: Coward-McCann, 1939)\n* Finger Printing; A Manual of Identification (New York: Coward-McCann, 1941)\n* Aircraft Electricity for the Mechanic (New York: Coward-McCann, 1946)\n* The Gun Collector's Handbook of Values (New York: Coward-McCann, 194\n* Aircraft Weight, Balance & Loading ( Los Angeles: Aeor Publishers, Inc, 1948)\n* Aircraft Power Plants (New York: McGraw-Hill, 1948)\n* The Boy's Book of Rifles (New York: Coward McCann, 1948)\n* Field, Skeet, and Trap Shooting (New York: Coward-McCann, 1949)\n* The Gun Collector's Handbook of Values, 2nd edition. (1950)\n* Jet Aircraft Simplified ( Los Angeles: Aero Publishers, 1950)\n* Simplified Rifle Shooting ((New York: Coward-McCann, 1950)\n* Gun Care and Repair: A Manuel of Gunsmithing (New York: Coward - McCann, 1951)\n* The Gun Collector’s Handbook of Values: Third Completely Revised Edition 1955-1956 Values (1955)\n* The Art of Shooting: A Comprehensive, Simplified Guide to Every Aspect of Pistol, Revolver, and Rifle Shooting ( A.S. Barnes and Company, 1960)\n* The Complete Book of Gun Collecting (1960)\n* Guns of the Old West (New York: Coward-Mccann, 1961)\n* U.S. Martial and Semi-Martial Single-Shot Pistols (New York: Coward-Mccann, 1962)\n* The Gun Collector’s Handbook of Values 8th edition: 1969-1970 Values (New York: Coward-McCann, 1969)\nAs editor\n* Aircraft Basic Science''. with the Technical Development Staff Of Northrop Aeronautical Institute (New York: McGraw-Hill Book Company, Inc, 1948)\nReferences\n*Who's Who in Firearms, Hobbies, Jan 1951.\n*American Authors and Bookmen, 1972.\n*Obit, The American Rifleman, April 1967.\nExternal links"
    }
  ]
}