{
  "content": [
    {
      "type": "text",
      "text": "# Charles Edward Newman\n\n| birth_place = 42 Gower Street, London, England\n| death_date =\n| death_place = Brent, London, England, UK\n| death_cause =\n| resting_place =\n| resting_place_coordinates =\n| monuments =\n| nationality = British\n| other_names =\n| education =\n| alma_mater =\n| occupation = physician and medical school dean\n| employer =\n| organization =\n| known_for =\n| notable_works =\n| style =\n| television =\n| spouse =\n| partner =\n| children =\n| parents =\n| relatives =\n| awards =\n| website =\n}}\nCharles Edward Kingsley Newman  (16 March 1900 – 22 August 1989) was a British physician and medical school dean.\nBiography\nAfter education at Mill Mead School in Shrewsbury and then at Shrewsbury School, Newman spent the summer of 1918 in the Oxford University Officers' Training Corps. In 1919 he was demobilised and matriculated at Magdalene College, Cambridge, where he graduated BA (Cantab.) in 1921. He studied medicine at King's College Hospital Medical School, where he qualified MRCS, LRCP in 1923 and graduated MB BCh in 1924. In 1926 he won the RCP's Murchison Scholarship and qualified MRCP. He graduated MD in 1927. He held various house appointments at the Belgrave Hospital for Children and at King's College Hospital, where he was for two years a Sambrooke medical registrar.For some years, at King's College Hospital, a permanent record of every case received into the hospital was kept by the Sambrooke Medical and Surgical Registrars.  With various conditions, Sambrooke in 1867 donated shares worth about £2000 to King's College Hospital.  He spent six months at the University of Freiburg as a volunteer assistant to Ludwig Aschoff. At King's College Hospital, Newman was appointed junior physician, morbid anatomist, medical tutor, and vice-dean. There he was promoted to full physician in 1938 and offered the deanship of the King's College Hospital Medical School, but he resigned to become a sub-dean at Hammersmith's Royal Postgraduate Medical School.\nWhen Sir Charles Dodds became president of the Royal College of Physicians in 1962, Newman succeeded him as Harveian Librarian, holding that office for seventeen years. He was awarded the RCP's Linacre Fellowship in 1966.}}\nNewman married his first wife in 1952, who died in 1965. In 1971 he married his second wife, who died in 1982. Upon his death in 1989 he was survived by several stepchildren from his second marriage.\nAwards and honours\n* 1932 — FRCP\n* 1933 — Goulstonian Lecturer\n* 1954–1955 — Fitzpatrick Lecturer\n* 1965 – CBE\n* 1968 – Fitzpatrick Lecturer\n* 1973 — Harveian Orator\nSelected publications\n*\n* with L. M. Payne:\n*\n* with L. M. Payne:\n*\n*\nReferences"
    }
  ]
}