{
  "content": [
    {
      "type": "text",
      "text": "# Charles Edward Beckett\n\n|birth_date=1849\n|birth_place=\n|death_date=17 September 1925\n|death_place=Fort Augustus, Scotland\n|placeofburial=\n|image=\n|caption=\n|alt=\n|nickname=\n|allegiance=British Empire\n|branch= British Army\n|serviceyears=\n|rank=Brigadier-General\n|commands=2nd Dragoon Guards (Queen's Bays)66th (2nd East Lancashire) Division\n|battles=Sudan CampaignSecond Boer WarFirst World War\n|unit=7th (The Princess Royal's) Dragoon Guards3rd (The King's Own) Hussars2nd Dragoon Guards (Queen's Bays)\n|awards=Order of the Bath\n|relations=\n|laterwork=\n}}\nCharles Edward Beckett  (1849–1925) was a brigadier-general and cavalry officer in the British Army.\nHe served in three regiments the 7th (The Princess Royal's) Dragoon Guards, the 3rd (The King's Own) Hussars and the 2nd Dragoon Guards (Queen's Bays), which he also commanded.\nHe served in three wars, in the Sudan Campaign, the Second Boer War and the First World War. During which although only ranked as a brigadier-general he was the first general officer commanding the 66th (2nd East Lancashire) Division.\nFamily\nCharles Edward Beckett  was the son of Charles William Beckett of Thorne in Yorkshire, England. He married Louisa Michel, daughter of Field-Marshal Sir John Michel of Dewlish. They had one daughter Nora Juanita Muriel Beckett, who married Eric Dillon, 19th Viscount Dillon.\nBeckett married for the second time in July 1915, at Westminster Cathedral to Mary Philippa, of Culachy, Fort Augustus, Scotland.\nArmy life\nIn April 1869, Beckett purchased a commission as a cornet in the 7th (The Princess Royal's) Dragoon Guards. Then two years later advances in rank to lieutenant by purchase. His next position was as the regiments Adjutant, which he held between May 1873 and October 1877. Then in February 1880, he exchanged position with a captain from the 3rd (The King's Own) Hussars, and joined that regiment as a captain. Two years later he saw his first combat action, when appointed as the brigade major for the Cavalry Brigade during the Sudan Campaign. This was followed by his promotion to major in November 1884. In March 1886, he was appointed the Military Secretary to General His Serene Highness Prince Edward of Saxe-Weimar, commanding the Forces in Ireland.  In May he was seconded for service with the General Staff. In August 1892, he was promoted to lieutenant-colonel and given command of the 2nd Dragoon Guards (Queen's Bays). By May 1898 he was a brevet colonel and was invested as a Companion of the Order of the Bath.\nColonel\nIn July 1898 he was appointed an assistant inspector-general of ordnance at headquarters, with the substantive rank of colonel. He next served in the Second Boer War, and was mentioned in dispatches. and also became the Assistant-Adjutant-General in Natal in September 1899. He was then on the half pay list until July 1904, when he was appointed a Colonel on the Staff and the Chief Staff Officer for Malta.\nBrigadier-General\nHis first appointment as a brigadier-general came in November 1905, while filling an administration post. On 21 July 1906 he was put onto the retired pay list, having completed his time on the administration staff. He then was given command of a brigade until 9 April 1912 he relinquished command, his tenure being up.\nFirst World War\nAt the start of the First World War Beckett, was appointed the superintendent of the Remount Department. Although Beckett was now aged sixty-five, he was the first general officer commanding, the 66th (2nd East Lancashire) Division. The division was created as the \"2nd East Lancashire Division\", a second-line mirror formation of the East Lancashire Division at the end of August 1914. British Territorial Force soldiers could not be deployed overseas without their consent, so the existing Territorial units were named as \"first line\" units, with men who had volunteered for overseas service, and a \"second line\", which was intended for home service only. He was promoted once more to temporary brigadier general on 6 November 1914.\nCharles Edward Beckett died on 17 September 1925, at his home in Fort Augustus, Scotland.\nReferences"
    }
  ]
}