{
  "content": [
    {
      "type": "text",
      "text": "# Charles Brooking's map of Dublin (1728)\n\n'''Charles Brooking's map of Dublin (1728)''' is an early map of Dublin, Ireland, and was one of the first detailed attempts at mapping the city of Dublin.\nBackground\nThe map was completed by Charles Brooking (1677–1738), an engraver, illustrator and map maker of English origin, and printed in London by John Bowles at The Mercer's Hall in 1728. Brooking is recorded as working at Greenwich Hospital (London) between 1729 and 1736 as a painter and decorator. He had earlier been active in Plymouth and Dublin where he is recorded as working at Trinity College Dublin in 1723–25.\nIt is likely his son was Charles Brooking, a notable painter of marine scenes in his own right, who was earlier apprenticed to his father.\nThe map was one of the first accurate maps of the modern Dublin Georgian streetscape and includes 20 notable Dublin buildings and structures which are embedded as vignettes within the borders of the map. As of 2024, a number of these structures remain intact. The map also contains the coats of arms of the various Guilds of the City of Dublin.\nIt was the first detailed map of Dublin carried out since John Speed's map of 1610.\nList of illustrations\n{| class=\"wikitable sortable\"\n|+\n!Order\n!Illustration\n!Title (Sic)\n!Building or structure\n!Status\n!Date of construction\n!Notes\n|-\n|1\n|\n|Lord Mayors House\n|Mansion House\n|Intact\n|1700\n|Much altered but now used as the official residence of the Lord Mayor of Dublin.\n|-\n|2\n|\n|The Statue of King George Ye 1st on Essex Bridge\n|Equestrian statue of George I, Dublin\n|Intact\n|1722\n|Intact but transferred to a different location in Birmingham, England in 1937. It was originally commissioned in 1717.\n|-\n|3\n|\n|The Linnen Hall\n|Linenhall\n|Demolished\n|1722\n|Destroyed by fire during the Easter Rising. Some of the gates and arches remain intact.\n|-\n|4\n|\n|Dr. Stevens's Hospital\n|Dr Steevens' Hospital\n|Intact\n|1719\n|Still fully intact and used as a governmental administrative office still related to health and hospital use.\n|-\n|5\n|\n|A Prospect of the City Bason\n|The City Basin\n|Demolished\n|1721\n|Some elements of the basin remain below ground level but have now mostly been replaced with apartments. The limestone gateway and iron gate were purchased by Desmond Guinness in the 1970s and are now a feature in the grounds of Leixlip Castle.\n|-\n|6\n|\n|The Custom House\n|The Old Custom House\n|Demolished\n|1707\n|Demolished in the early 19th century around 1815 as it was deemed structurally unsound. Part of the site now forms the location of the Clarence Hotel on Wellington Quay.\n|-\n|7\n|\n|The Front of St. Ann's Church\n|St. Ann's Church, Dawson Street\n|Demolished\n|1720\n|Some elements of the original baroque structure remain within the structure of the modern church which was constructed in the second half of the 19th century.\n|-\n|8\n|\n|The Front of St. Werburghs Church\n|St. Werburgh's Church\n|Partially Intact\n|1719\n|The bottom section of the church is still in existence. The spire was demolished in the late 18th and early 19th century as it was feared the position overlooking Dublin Castle created a potential security risk from snipers.\n|-\n|9\n|\n|The Hospital in Stevens Street\n|Mercer's Hospital\n|Demolished\n|1724\n|The building was demolished in the years following the map and was replaced by a modern Georgian hospital building in 1759 the facade of which still stands today and forms part of a complex of buildings owend by the Royal College of Surgeons in Ireland. The image was later copied and used as the illustration on tickets for Handel's Messiah in 1742.\n|-\n|10\n|\n|The Corn Market House in Thomas Street\n|Cornmarket House\n|Demolished\n|1727\n|Located on Thomas Street, the building was demolished at some stage during the middle of the 19th century after closing in 1800 with some of the business moving to a dedicated corn exchange on Burgh Quay.\n|-\n|11\n|\n|Blew Coat Boys Hospital\n|Blue Coat School\n|Demolished\n|1673\n|The building on Queen Street was replaced with a Georgian building on nearby Blackhall Place in the second half of the 18th century which still exists and now houses the Law Society of Ireland.\n|-\n|12\n|\n|Front of the Colledge\n|Trinity College Dublin, West front\n|Demolished\n|1697\n|Demolished in the second half of the 18th century to be replaced with the current Georgian west front.\n|-\n|13\n|\n|The Poor House\n|Foundling Hospital\n|Demolished\n|1704\n|Demolished only in the second half of the 20th century after later forming part of the South Dublin Union. Many of the buildings which made up the original South Dublin Union and Foundling Hospital still exist and form part of the St James' Hospital campus.\n|-\n|14\n|\n|The Tholsel\n|The Tholsel\n|Demolished\n|1682\n|Demolished around 1812 whereupon many of its functions had moved into separate buildings. The coat of arms on the front of the building is still in existence and is stored in the crypt of Christchurch cathedral.\n|-\n|15\n|\n|The Colledge Library\n|Old Library of Trinity College Dublin\n|Intact\n|1715\n|Still exists and is now generally referred to as the Old Library. The building contains the famous long room and the Book of Kells.\n|-\n|16\n|\n|A Prospect of St. Stephens Green\n|St Stephen's Green\n|Intact\n|1663\n|Still exists as a public city park and green area. It was originally first enclosed as a common in 1664.\n|-\n|17\n|\n|The Royal Hospital\n|Royal Hospital Kilmainham\n|Intact\n|1684\n|Still exists and houses the Irish Museum of Modern Art.\n|-\n|18\n|\n|The Barracks\n|Royal Barracks\n|Intact\n|1701\n|Now usually referred to as Collins Barracks except in historical accounts.\n|-\n|19\n|\n|The Castle\n|Dublin Castle\n|Partially Intact\n|1204\n|Most of the key buildings which made up the castle campus are still in existence and have been restored.\n|-\n|20\n|\n|The Statue of King William on Colledge Green\n|Statue of King William of Orange on College Green\n|Demolished\n|1701\n|It was severely damaged in an explosion in 1928 and was removed entirely in 1929.\n|}\nSee also\n* Cartography of Dublin\n* Herman Moll\n* James Malton\n* Joseph Tudor\n* Jonas Blaymire\n* John Speed\nReferences\nExternal links\n*[https://archive.org/details/map-of-the-city-and-suburbs-of-dublin Link to map on archive.org]\n*[https://www.flickr.com/photos/britishlibrary/50264161227 Link to British Library version of the map]"
    }
  ]
}