{
  "content": [
    {
      "type": "text",
      "text": "# Charles Willis Ward\n\nCharles Willis Ward, circa 1913.\nCharles Willis Ward (1856-1920) was born in Michigan and was a noted American businessman and conservationist.\nWard operated the Cottage Gardens Nurseries in Queens, Long Island, New York.  As a leading grower of carnations, he helped to establish the American Carnation Society.  He also helped to create the American Peony Society, over which he presided for many years.\nWard also was involved with the American Breeders Association, later known as the American Genetic Association.\nAccording to documents in the Harry S. Truman Library, Ward \"explored the Everglades for the Smithsonian Institution about the turn of the century.\"\nAround 1910 he teamed with businessman and conservationist E. A. McIlhenny to purchase  of Louisiana coastal marshland for the purpose of establishing a wildfowl refuge.  Ward and McIlhenny deeded  of this land in 1911 to the state of Louisiana, which dubbed it the Ward-McIlhenny refuge, now known as State Wildlife Refuge.\nWard authored The American Carnation: How to Grow It (1903) and Humboldt County, California: The Land of Unrivaled Undeveloped Natural Resources on the Westernmost Rim of the American Continent (1915).  He purchased the magazine Recreation, which he merged with Outdoor World, a magazine he previously founded.  \"The entire purpose of this great magazine,\" noted one observer about Outdoor World, \". . . is to further the game bird refuge movement.\"\nCharles Willis Ward's boat, the Ethel M. Ward.\nWard was known for travelling the coastal United States in his  luxury motor boat, the Ethel M. Ward, built in 1910 at Port Clinton, Ohio .  From 1917 to 1919 the boat, temporarily renamed the USS Rickwood (SP-597), served the U.S. Navy as a patrol, ferry, towing and rescue boat at the Naval Air Station at Pensacola, Florida.  In 1919 the Navy returned the boat to its owner.\nToward the end of his life, he resided in California, where he operated \"large nursery interests at Eureka\"\nWard died June 24, 1920, in Eureka, California.\nReferences"
    }
  ]
}