{
  "content": [
    {
      "type": "text",
      "text": "# Charleston in the American Civil War\n\n]]\nCharleston, South Carolina, played a pivotal role at the start of the American Civil War as a stronghold of secession and an important Atlantic port for the Confederate States of America. The first shots of the conflict were fired there by cadets of The Citadel, who aimed to prevent a ship from resupplying the U.S. Army soldiers garrisoned at Fort Sumter. Three months later, a large-scale bombardment of Fort Sumter ignited a nationwide call to quell the rebellion. U.S. Army and Navy troops made repeated, concerted efforts to degrade the city fortifications throughout the war. Still, they would only retake control over and liberate the city in the conflict's final months. The prolonged struggle substantially damaged the city.\nEarly war years\nAccording to the 1860 Census, Charleston was the 22nd largest city in the United States, with a population of 40,522.  As the 1814 Burning of Washington had shown, America's coastal cities were vulnerable to a hostile fleet. The United States began building substantial forts along the Atlantic seaboard, including Fort Sumter, on a shoal in Charleston harbor. Smaller and older forts and bastions helped protect the fort from enemy ships. after South Carolina secession Charleston became the confederacy second largest city Behind New Orleans\nBeginning with the Missouri Compromise in 1820, proslavery thought and the defense of slavery, more than tariffs or states' rights, fomented sectionalism in South Carolina. White southerners feared slave revolts; half of the state's population were enslaved Black people. Following the 1860 United States presidential election of Abraham Lincoln, South Carolina convoked a secession convention to consider withdrawing from the United States in light of restrictions on the expansion of slavery into U.S. territories. On December 20, 1860, the convention voted to declare secession from the United States, the first state to do so, citing Lincoln's opposition to expanding slavery to territories outside where it was already present in current U.S. states. The Secession Convention declared:\n}}\nFollowing its declared secession from the United States in December, South Carolina militia seized Castle Pinckney and the Charleston Arsenal and their supplies of arms and ammunition. On January 9, 1861, Citadel cadets fired upon the merchant ship USSStar of the West as it was entering Charleston's harbor to resupply U.S. soldiers garrisoned at Fort Sumter. The Buchanan administration had sent the ship with relief supplies of men and matériel. As the Confederate States of America organized late that winter, old and abandoned forts were reoccupied around Charleston to target the massive, though incomplete, U.S. Army fort. Just as President Lincoln was inaugurated, Jefferson Davis appointed P. G. T. Beauregard to command the siege of Fort Sumter. Informed by the Lincoln administration that a supply ship, with food but no men or munitions, was to restock the fortress, Davis, after consulting with his cabinet on April 9, ordered Beauregard to capture the fort before it was resupplied.\nOn April 12, at 3:20 AM, Robert Chestnut sent a final ultimatum to the commander of the garrison, U.S. Major Robert Anderson. Chestnut threatened that in one hour, the batteries commanded by Beauregard would open fire. Anderson had been a professor of artillery at the United States Military Academy, and had instructed Beauregard. After a 34-hour bombardment, Anderson surrendered the fort.\nThroughout much of the war, Citadel cadets continued to aid the Confederate Army by drilling recruits, manufacturing ammunition, protecting arms depots, and guarding U.S. prisoners-of-war.\nRuins from the fire of 1861, seen from the Circular Church in Charleston, 1865\nattacking at the Second Battle of Fort Wagner]]\nOn December 11, 1861, a massive fire burned 164 acres of the city, destroying the Cathedral of Saint John and Saint Finbar, the Circular Congregational Church and South Carolina Institute hall, and nearly 600 other buildings. Much of the damage remained unrepaired until the end of the war. Amos Gadsden, a formerly enslaved person, recounted that a balloon started it while Union and Confederate troops were camped on opposite sides of the river. Many in the North saw this fire as divine retribution for secession.\nIn June 1862, the Battle of Secessionville, on modern-day James Island, South Carolina, was the only U.S. Army effort to retake control of Charleston by land during the war. Confederate forces defeated the effort by U.S. Brigadier General Henry Washington Benham.\nLater war years\nThe ruins of Mills House and nearby buildings. A shell-damaged carriage and the remains of a brick chimney are in the foreground, 1865\nThe U.S. Navy blockaded many Confederate-controlled port cities. Charleston became a haven for Confederate blockade runners despite repeated U.S. efforts to retake Charleston and control those supplying Confederate interests, including a Stone Fleet of sunken ships. Nevertheless, Confederates resisted U.S. naval forces for most of the war's four years.\nIn 1863, U.S. Rear Admiral Samuel Francis Du Pont began an offensive campaign against the defenses of Charleston Harbor, beginning with a combined First Battle of Charleston Harbor. However, the naval bombardment accomplished little, and the land forces were never put ashore. By the summer of 1863, the Union turned its attention to Battery Wagner on Morris Island, which guarded the harbor entrance from the southwest. In the First and Second Battle of Fort Wagner (which involved the Union African-American regiment, the 54th Massachusetts Infantry Regiment), Confederates repelled and inflicted heavy casualties on U.S. forces attempting to capture the fort. Confederate forces abandoned the fort following The Second Battle of Charleston Harbor, in September 1863. An attempt to recapture Fort Sumter by a U.S. naval raiding party also failed severely. Still, Fort Sumter was gradually reduced to rubble via bombardment from shore batteries after the capture of Morris Island.\nWith the development of newer, longer-range artillery, and as U.S. Army soldiers could place batteries even closer to the city, the city was subjected to increasing bombardment. In November 1863, Jefferson Davis visited the city and opined that it was better for the city to be reduced to \"a heap of ruins\" than surrender. The bombardment that began in late 1863 continued on and off for 587 days and destroyed much of the city that had survived the fire. A coordinated series of U.S. attacks on the city were launched in early July 1864, including an amphibious assault on Fort Johnson and an invasion of Johns Island. These attacks failed but continued to wear down Confederate defenders. The Confederates were finally beaten back, and the U.S. Army liberated the city only a month and a half before the war ended.\n\" as they led the U.S. Army into Charleston, South Carolina, in 1865.]]\nCharleston Harbor was also the site of the first successful submarine attack in history on February 17, 1864, when the H.L. Hunley made a night attack on the USS Housatonic. Although the Hunley survived the attack, she foundered and sank while returning, ending the threat to the U.S. blockade.\nAs U.S. Army General William Tecumseh Sherman marched through South Carolina, the situation for Confederates in Charleston became ever more precarious. On February 15, 1865, Beauregard ordered the evacuation of remaining Confederate forces. On February 18, the mayor surrendered the city to U.S. Army General Alexander Schimmelfennig, and U.S. soldiers retook control of key sites. The first soldiers to enter the city were members of the 21st Infantry Regiment of the US Colored Troops and the 55th Massachusetts Infantry Regiment, another Black regiment, singing \"John Brown's Body\".\nU.S. celebrations\nThe retaking of Charleston was the cause of celebration throughout the United States. The flag lowered at the surrender of Fort Sumter in 1861, at the outset of the war, had been treated as an heirloom, housed in a specially-made case and exhibited at patriotic events to assist in fundraising. The same officer who had lowered it was sent to Charleston to raise it back up. Chartered boats brought hundreds of attendees from as far as New York. (Black people were on a separate boat with a Black captain.) The keynote speaker was America's most famous clergyman, Henry Ward Beecher, brother of Harriet Beecher Stowe. William Lloyd Garrison and many reporters also attended. The episode has been largely forgotten because that night, April 14, President Lincoln was assassinated.\nU.S. soldiers remained in Charleston during the city's reconstruction.\n}}\nSee also\n*Columbia, South Carolina, in the American Civil War\n*South Carolina in the American Civil War\nNotes\nReferences\n* Cauthen, Charles Edward. South Carolina Goes to War 1860-1865. (1950)\n* Rosen, Robert 1997. [https://books.google.com/books?id=-dMvCTvIEvwC A Short History of Charleston]. University of South Carolina Press. ."
    }
  ]
}