{
  "content": [
    {
      "type": "text",
      "text": "# Charlotte Independence\n\n| dissolved   =\n| stadium     = American Legion Memorial StadiumCharlotte, North Carolina\n| capacity    = 10,500\n| coordinates =\n| owntitle    = Owner\n| owner       = Queen City Soccer Club, LLC\n| chrtitle    = President\n| chairman    = Jim McPhilliamy\n| mgrtitle    = Head coach\n| manager     = Mike Jeffries\n| league      = USL League One\n| season      = 2025\n| position    =\n| website     =\n| American    = true\n| pattern_la1 = _goldborder\n| pattern_b1  = _ capelli shoulders white\n| pattern_ra1 = _goldborder\n| pattern_sh1 = _capelli white\n| pattern_so1 = _3_stripes_white\n| leftarm1    = 003da5\n| body1       = 003da5\n| rightarm1   = 003da5\n| shorts1     = 003da5\n| socks1      = 0033FF\n| pattern_la2 =\n| pattern_b2  = _ capelli shoulders black\n| pattern_ra2 =\n| pattern_sh2 = _capelli black\n| pattern_so2 = _3_stripes_white\n| leftarm2    = ddcba4\n| body2       = ddcba4\n| rightarm2   = ddcba4\n| shorts2     = ddcba4\n| socks2      = C0C0C0\n}}\nCharlotte Independence is an American soccer team based in Charlotte, North Carolina, that plays in the USL League One, the third tier of the American soccer pyramid.\nThe Independence currently play their home games at American Legion Memorial Stadium in the Elizabeth neighborhood of Charlotte, North Carolina.  Previously, the Independence have played at Ramblewood Soccer Complex and Sportsplex at Matthews.\nThe team's colors are navy, blue, and parchment.  The independence wear blue kits at home, and grey on the road.\nHistory\nThe Charlotte Independence were founded in 2014. They acquired the USL Pro franchise rights for Charlotte from the Charlotte Eagles, who moved into the amateur Premier Development League (PDL).\nThe Independence took their name from Mecklenburg Declaration of Independence. Their crest features the year 1775 (the year in which it was purported to have been signed) and a horse-mounted Captain James Jack, who is said to have carried the Declaration to Philadelphia.  Supporters were asked to choose one of twelve designs; all 12 featured the year and Jack. The team is nicknamed \"The Jacks,\" in Jack's honor.\nFormer Dallas Burn head coach Mike Jeffries was hired as the Independence head coach on December 5, 2014.\nThe Independence lost their first game to the Charleston Battery 3–2 on March 28, 2015, at Transamerica Field. Jack Thompson scored the team's first ever goal in the 13th minute.\nAfter recording their best season in 2021, finishing second in the Atlantic Division, the club decided to drop down to the third tier USL League One for 2022, with the goal of better serving its youth players, as well as the fact that a new expansion franchise in the city Charlotte FC was joining Major League Soccer that season, with whom several Independence players had signed. The Independence signed an affiliation agreement with Charlotte FC for the 2022 season only on April 5. Charlotte FC will loan a minimum of three players. The Independence made the USL League One playoffs in the club's first season in the league in 2022. Charlotte finished with 42 points and one of the best attacks in the league with 48 goals, the third-highest in USL League One.\nStadium\nIn 2016, the club began working with Mecklenburg County on a refurbishment of American Legion Memorial Stadium. The club subsequently signed a 10-year lease with the county for Memorial Stadium to become its new home, beginning in 2021. The Independence played the first match at the newly renovated stadium on Wednesday, July 7, 2021.\nAmerican Legion Memorial Stadium holds 10,500 people and is considered to be one of the best soccer-specific stadiums in the country. The stadium is located in the heart of the Elizabeth neighborhood in Charlotte with an updated concourse, a view of the Charlotte city skyline, and a World War I memorial at the entrance.\nAmerican Legion Memorial Stadium has hosted various different events throughout its history, including Presidential addresses, professional wrestling matches, professional and high school football, and Charlotte's first ever professional soccer team, the Carolina Lightnin', during the American Soccer League Championship in 1981 in front of 20,163 fans.\nPreviously, the Independence played matches in the greater Charlotte region at the Sportsplex in Matthews in Matthews, North Carolina, Ramblewood Soccer Complex, the University of North Carolina at Charlotte's Transamerica Field and Winthrop University's Eagle Field.\nSponsorship\n{|class=\"wikitable\" style=\"text-align: center\"\n|-\n!style=\"background-color:#003FA5; color:#E4CE9B; border:2px solid #E4CE9B\" !scope=col|Seasons\n!style=\"background-color:#003FA5; color:#E4CE9B; border:2px solid #E4CE9B\" !scope=col|Kit manufacturer\n!style=\"background-color:#003FA5; color:#E4CE9B; border:2px solid #E4CE9B\" !scope=col|Shirt sponsor\n|-\n|2015–2016\n|rowspan=\"2\"|Adidas\n|OrthoCarolina\n|-\n|2017–2023\n|rowspan=\"2\"|Novant Health\n|-\n|2023–present\n|Capelli Sport\n|}\nRecord\nYear-by-year\n{| class=\"wikitable\" style=\"text-align:center;\"\n|-\n! rowspan=\"2\" | Season\n! rowspan=\"2\" | League\n! colspan=\"8\" | Regular Season\n! rowspan=\"2\" | Playoffs\n! rowspan=\"2\" | U.S. Open Cup\n! rowspan=\"2\" | USL Cup\n! colspan=\"2\" | Top scorer\n! rowspan=\"2\" style=\"line-height: 1.4em;\" |\n|-\n!\n!\n!\n!\n!\n!\n!\n!\n! class=\"unsortable\" | Player\n! class=\"unsortable\" |\n|-\n|2015\n|USL\n|28\n|10\n|10\n|8\n|38\n|35\n|40\n|7th, Eastern\n|bgcolor=|Did not qualify\n|Fifth Round\n|bgcolor=#C0C0C0 | -\n|  Ryan Finley\n|9\n|1,800\n|-\n|2016\n|USL\n|30\n|14\n|8\n|8\n|48\n|29\n|50\n|5th, Eastern\n|bgcolor=|Conference Quarterfinals\n|Third Round\n|bgcolor=#C0C0C0 | -\n|  Enzo Martinez\n|9\n|1,375\n|-\n|2017\n|USL\n|32\n|13\n|9\n|10\n|52\n|40\n|48\n|5th, Eastern\n|bgcolor=|Conference Quarterfinals\n|Third Round\n|bgcolor=#C0C0C0 | -\n|  Enzo Martinez\n|16\n|1,615\n|-\n|2018\n|USL\n|34\n|10\n|12\n|12\n|44\n|57\n|42\n|11th, Eastern\n|bgcolor=|Did not qualify\n|Second Round\n|bgcolor=#C0C0C0 | -\n|  Jorge Herrera\n|13\n|1,659\n|-\n|2019\n|USLC\n|34\n|9\n|11\n|14\n|42\n|53\n|38\n|13th, Eastern\n|bgcolor=|Did not qualify\n|Second Round\n|bgcolor=#C0C0C0 | -\n|  Jorge Herrera\n|7\n|1,750\n|-\n|2020\n|USLC\n|16\n|8\n|4\n|4\n|24\n|22\n|28\n|6th, Eastern; 1st, Group G\n|bgcolor=|Conference Quarterfinals\n|Cancelled\n|bgcolor=#C0C0C0 | -\n|  Dane Kelly\n|11\n|N/A\n|-\n|2021\n|USLC\n|32\n|18\n|5\n|9\n|57\n|36\n|59\n|4th, Eastern; 2nd, Atlantic Division\n|bgcolor=|Conference Semifinals\n|Cancelled\n|bgcolor=#C0C0C0 | -\n|  Dane Kelly Irvin Parra\n|11\n|2,009\n|-\n|2022\n|USL1\n|30\n|12\n|6\n|12\n|48\n|48\n|42\n|6th\n|bgcolor=|Quarterfinals\n|Second Round\n|bgcolor=#C0C0C0 | -\n|  Khori Bennett Tresor Mbuyu\n|11\n|2,322\n|-\n|2023\n|USL1\n|32\n|13\n|10\n|9\n|50\n|42\n|49\n|4th\n|bgcolor=silver|Finals\n|Third Round\n|bgcolor=#C0C0C0 | -\n|  Tresor Mbuyu\n|9\n|1,601\n|-\n|2024\n|USL1\n|22\n|9\n|7\n|6\n|37\n|31\n|34\n|6th\n|bgcolor=|Quarterfinals\n|Round of 32\n| Semifinals\n|  Juan Carlos Obregon\n|15\n|1,077\n|-\n|2025\n|USL1\n|30\n|10\n|7\n|13\n|45\n|50\n|37\n|8th\n|bgcolor=|Quarterfinals\n|Third Round\n| Group Stage\n|  Christian Chaney\n|12\n|714\n|}\n1. Top Scorer includes all goals scored in regular season, league playoffs, U.S. Open Cup, and other competitive continental matches.\nPlayers and staff\nCurrent roster\n}}\n}}\n}}\n}}\nFront office\n* Jim McPhilliamy – CEO & Managing Partner\n* Tim Schuldt – President & COO\n* Mike Jeffries – General Manager\n* Isaiah (Tito) Villanueva – Director of Operations\n* Alex Kantor - Executive Director of Corporate Partnerships\n* Ashley Osiecki – Vice President of Marketing and Communications\n* Ulises Vega – Creative Director\n* Drew Hubbard - Senior manager of Marketing and Broadcasting\n* Eric Brown – Team Operations Manager and Director of Game Day Operations\n* Edwin Valentin - The Boss Man\n* Paulo Nogueira - Inaugural Account Executive\n* Jake Kling - Northwest Chicago Native\nCoaching staff\n* Mike Jeffries – Head Coach\n* Bradley Johnson – Assistant Coach\n* Jay Lockheart – Assistant Coach\n* Lindsay Jones – Athletic Trainer\nHead coaches\n* Includes USL Regular Season, USL Playoffs, U.S. Open Cup. Excludes friendlies.\n{| class=\"wikitable\" style=\"text-align:center; margin-left: lem;\"\n! Coach !! Nationality !! Start !! End !! Games !! Win !! Loss !! Draw !! Win %\n|-\n| Mike Jeffries\n|\n|\n|\n|-\n| Jim McGuinness\n|\n|\n|\n|-\n| Mike Jeffries\n|\n|\n| present\n|}\nMike Jeffries has been the Independence's head coach for all but 15 games of the team's existence. His first stint was from 2014 to 2018 as head coach. Coach Jeffries was promoted to general manager in 2018.  In 2019, he resumed his duties as head coach while remaining the general manager.\nClub culture\nA self-described independent, grassroots supporters group, \"The Mecklenburg Reserves,\" was formed in July 2021. The Mecklenburg Reserves occupy section 114 alongside the Independence Ultras. The Ultras and Reserves help create the supporters section atmosphere with Blue Furia, an independent predominantly Hispanic supporters group, and La Femme Footie, a group that works to promote women's soccer and women's involvement in the sport.\nThe Independence competed for the Southern Derby against their rival, the Charleston Battery while Charlotte was in USL Championship. The derby took place over each team's final home game, and is decided on a points system. If the two games end in a tie, it is then awarded to the team who leads in aggregate goals. The independence won their first Southern Derby in 2021.\nThe club's original independent supporters' group, \"Jack's Militia\", was founded in 2012 to promote soccer in Charlotte. When the Charlotte Independence were announced, Jack's Militia became the new team's official supporters group.\nThe team's games are broadcast on ESPN+.\nAchievements\n* USL League One\n** Runner Up: 2023\n** Quarterfinals: 2022\n* USL Championship\n** Conference Quarterfinals: 2016, 2017, 2020\n* Southern Derby\n** Winner: 2021\nAffiliations\nIn April 2019, Carolina Rapids Soccer Club, Discoveries Soccer Club, and Lake Norman Soccer Club merged to create the Charlotte Independence Soccer Club, making it one of the largest youth soccer clubs in the country. The club provides programs for Youth and Adult Recreation, TopSoccer, Boys and Girls Competitive, Boys and Girls ECNL, Boys U.S. Soccer Development Academy, USL2 and WPSL, for its 12,000 members. The youth affiliation with the pro club designates itself as one of the few youth soccer clubs in the area, region and nation to offer a direct pro pathway for its players. CISC operates as 4 Regional locations throughout the Carolinas, North, South, East and West. Serving North Carolina communities such as Belmont, Cabarrus, Cornelius, Davidson, Denver, Gastonia, Huntersville, Matthews, Mooresville, North Meck, South Charlotte, Statesville, and Steele Creek, as well as Fort Mill, Rock Hill and York County in South Carolina.\nReferences\nExternal links\n*\n* [https://www.uslchampionship.com/charlotte-independence Charlotte Independence] at USL Championship"
    }
  ]
}