{
  "content": [
    {
      "type": "text",
      "text": "# Charles I's journey from Oxford to the Scottish army camp near Newark\n\nCharles I of England left Oxford, Oxfordshire on 27 April 1646 and travelled by a circuitous route through enemy-held territory to arrive at the Scottish army camp located close to Southwell near Newark-on-Trent, Nottinghamshire on 5 May 1646. He undertook this journey because military Royalism was all but defeated. It was only a matter of days before Oxford (the Royalist First English Civil War capital) would be fully invested and would fall to the English Parliamentarian New Model Army commanded by Lord General Thomas Fairfax (see Third Siege of Oxford). Once fully invested it was unlikely that Charles would be able to leave Oxford without being captured by soldiers of the New Model Army. Charles had been in contact with the various parties that were fielding armies against him seeking a political compromise. In late April he thought that the Scottish Presbyterian party were offering him the most acceptable terms, but to gain their protection and finalise an agreement Charles had to travel to the Scottish army that was besieging the Royalist-held town of Newark. When he had arrived there he was put under close guard in Kelham House.\nOn 27 April, Charles had his tresses, his lovelock, and the peak of his beard clipped off by scissors. In this way, he no longer resembled the royal image popularized  Anthony van Dyck's portraits. Charles' traveling companion Michael Hudson used an old pass to pose as an army captain heading for London.  Charles used the alias of \"Harry\" while posing as a servant for his other traveling companion, John Ashburnham. He was wearing a montero cap to further change his appearance.  The trio of travelers arrived at Hillingdon, where they discussed three potential options for further travels. They chose to head towards King's Lynn in Norfolk, which if it proved difficult to reach, or if no ships were available, left the Scottish option still open. After the king's disguise became known to others, he changed to another disguise. Charles dressed himself as a cleric and posed as Hudson's tutor. Crossing Lincolnshire during 3 and 4 May, the trio crossed the River Trent at Gotham, Nottinghamshire.On 5 May, Charles arrived at the King's Arms Inn in Southwell where he made his initial contacts with representatives of the Scottish forces.\nPrelude\nTowards the end of the First English Civil War, Charles I had continued to contact the parties that were opposed to him, hoping to split them apart and gain politically what he was losing militarily.\nWhen it looked likely that the Royalists (Cavaliers) would lose the English Civil War, the Scots, who were then allied with the English Parliamentarians (Roundheads), looked to Cardinal Mazarin, by then the chief minister of France, for help in securing Charles I's position as king, but on terms acceptable to the Scots. In response, Mazarin appointed Jean de Montreuil (or Montereul) as French resident in Scotland. He was to act as a go-between and in doing so he was able to inform Cardinal Mazarin of the political machinations of the various parties in the civil war.\nMontreuil arrived in London in August 1645. Once there he opened a dialogue with English Presbyterians such as the Earl of Holland who were sympathetic to the Scots who too were Presbyterians and formally allied with the Roundheads through the Solemn League and Covenant, but which was disliked by non-Presbyterian Roundheads such as Oliver Cromwell and other religious Independents. There were Scottish commissioners in London who were looking after Scottish interests in the alliance and during talks with them and English Presbyterians, the idea arose that if Charles I were to place himself under the protection of the Scottish army, then the Presbyterian party could advance their interests.\nMontreuil strived to extract from the Scottish Commissioners to the Committee of Both Kingdoms (the body set up to oversee the Solemn League and Covenant)—most of whom were usually located in London—the most moderate terms upon which they would receive Charles: accept three proposition touching on the Church, the militia and Ireland, and sign the Covenant. If Charles accepted those terms, they would intercede with English Parliament and banish only five or six prominent Royalists. Montreuil told Sir Robert Moray—who was delegated to act for the Earl of Loudoun (High Chancellor of Scotland) in his absence from London and continued to be his delegate upon his return—that Charles would not accept those terms; he obtain a modified Scottish offer on 16 March from Sir Robert Moray, in which the Scots would instead be satisfied with a promise from Charles to accept the church settlement which had already been made by the English and Scottish parliaments, and that Charles was to express his general agreement of the Covenant in letters to the two parliaments in which he accepted the church settlement.\nHowever, the late Victorian historian S. R. Gardiner suggests that Montreuil did not have a full understanding of Charles' mind. He would promise anything, providing the wording could be so construed by Charles that he could disregard it in the future, and consequently Charles would at this juncture never agree to wording that was an unambiguous legal contract.\nOn 17 March, Montreuil set out for Oxford, the King's headquarters. Along with the offer, he carried intelligence that the English Presbyterians would field an army of 25,000 men to support the Scots if the Independents in the New Model Army tried to oppose the reconciliation.\nGardiner wrote:\nSince he had received Montreuil's communication, the Scots had been out of favour with him, and on 23 March, upon the arrival of the bad news of the defeat of the last Royalist field army at the Battle of Stow-on-the-Wold, he despatched a request to the English Parliament for permission to return to Westminster, on the understanding that an act of oblivion was to be passed and all sequestrations to be reversed. Even had this offer been straightforward, it implied that the central achievement of his opponents in the winning the war should be set aside, and that Charles should be allowed to step back on the throne, free to refuse to assent to any legislation which displeased him. This proposition was rejected by the English Parliament and the Scots. All Charles had achieved by this proposal was to reconcile the factions opposed to him, so thwarting his tactics of division.\nOn 27 March, Montreuil, in the king's name, pressured the Scots for a reply. They informed Montreuil that they would not accept Charles' terms, but—without putting anything in writing—if he were to hand himself over to the Scottish army, they would protect his honour and conscience.\nOn 1 April, Montreuil wrote to Charles, and engagements were exchanged between them. The French Agent promised\n}}\nCharles for his part promised to take no companions with him except his two nephews and John Ashburnham.\ncites The King's promise, and Montreuil's engagement, April 1 , Clar, St. P. ii 220.}}\nOn 3 April, Montreuil left London for Southwell (a town near the camp of the Scottish army which, along with a contingent of the New Model Army, was besieging Newark-on-Trent), arriving at the King's Arms Inn (now the Saracen's Head). Montreuil was delegated by Charles to arrange terms. Montreuil took up lodgings in the large apartment (divided into a dining-room and bedroom) of the inn to the left of the gateway, while the Scots, possibly on the instigation of Edward Cludd, a leading Parliamentarian, made the archbishop's palace their headquarters. The hostelry is an ancient one, being mentioned in deeds as far back as 1396. The French Agent is described by Clarendon as a young gentleman of parts very equal to the trust reposed in him, and not inclined to be made use of in ordinary dissimulation and cozenage. On visiting the Commissioners, he found them apparently pleased that the King desired to come to them, and accordingly drew up a document, of which he said they approved, assuring the King of full protection and assistance. Arrangements were to be made for the Scottish horse to receive Charles at Market Harborough, but not feeling sure of the compact being kept, Charles asked Michael Hudson (a chaplain and during the war a military scout) to go in his stead.\nHudson went to Harborough, and finding no troops there, proceeded to Southwell, where Montreuil told him that the Scots were fearful of creating jealousy with Parliament. In no hopeful mood, and with no tidings except that Scots had promised to send a party of horse to Burton upon Trent, Hudson returned to Oxford, where further letters from Montreuil were anxiously awaited. In one of these, dated Southwell, 10 April, these words occur:\nnotes that the king wrote: \"In a, word, Montreuil now dissuades me as much as he did before persuade.\" — Charles I. in 1646 (Camden Society, p. 82.)\n}}\nCharles, however, felt he had no alternative. Ashburnham, who was in constant attendance upon him, said in a letter that the king felt he could not refrain from trying to reach the Scots, \"first on account of his low condition in point of force, and the strong necessity he is brought into, not being able to supply his table. Secondly, because of the little hope he had of succour, and the certainty of being blocked up\". Charles explained the motives by which he was animated in a letter to the Marquis of Ormond, in which he stated that having sent many gracious messages to Parliament without effect, and having received very good security that he and his friends would be safe with the Scots, who would assist with their forces in procuring peace, he had resolved to put himself to the hazard of passing into the Scots army now before Newark. This letter is dated Oxford, 13 April 1646; on 25 April, a letter was received from Montreuil, stating that the disposition of the Scotch commanders was now all that could be desired. The King left secretly on 26 April, accompanied only by John Ashburnham and Michael Hudson, the latter being familiar with the country and able to conduct the little party by the safest route.\nJourney\n'' by Anthony van Dyck, 1635–36]]\nAt midnight on 27 April, Charles came with the Duke of Richmond to Ashburnham's apartment. Scissors were used to cut the King's tresses and lovelock, and the peak of his beard was clipped off, so that he no longer looked like the man familiar to any who have seen his portraits by Anthony van Dyck.\nHudson had persuaded the King that it was not possible to travel directly from Oxford to the Scottish camp outside Newark-on-Trent, and that it would be better to go by a circuitous route, first towards London, then north-east, before turning north-west towards Newark. As a cover for part of the journey, Hudson had an old pass for a captain who was ostensibly to go to London to discuss his composition with Parliament. Dressed in a scarlet cloak, Hudson represented the military bearer.\nAt 2:00 am, Hudson went to the governor of Oxford, Sir Thomas Glemham, who brought the keys to the gates. The clock struck three as they crossed the Magdalen Bridge. As they approached the start of the London-road, the Governor took his leave with a \"Farewell, Harry\"—for to that name Charles was now to answer. He was riding disguised as Ashburnham's servant, wearing a montero cap and carrying a cloak bag.\nCharles was still hoping to hear from parties in London who would be willing to treat with him, but nothing was heard from that direction. Arriving at Hillingdon, at that time a village near Uxbridge and now in Greater London, the party dallied at the inn for several hours, debating on their future course. Three options were considered. The first was to continue to London, which was ruled out because there had been no word from there. The second option was to head north to the Scots, and a third option was to head for a port and seek a ship for the continent. They chose to head towards King's Lynn in Norfolk, which if it proved difficult to reach, or if no ships were available, left the Scottish option still open.\nThey proceeded on their way amidst risks and dangers. They passed through fourteen garrisons of the enemy, and in trying to avoid detection, the party had many narrow escapes. cites Arch, des Aff. Étranghères lii fol. 260). }}\nOn 30 April, Charles and Ashburnham decided to halt at Downham Market, in Norfolk, while Hudson went on to Southwell to finalise the arrangements. In his statement to Parliament, Hudson said: \"The business was concluded, and I returned with the consent of the Scotch Commissioners to the King, whom I found at the sign of the White Swan at Downham. I related all to his Majesty, and he resolved the next morning to go to them\". Hudson later related the contents (when examined by the English Parliament) of the paper he carried (written by Montreuil, in French, because the Scots would not write down their terms):\nNotes: Montreuil's despatch of 15 May (Arch, des Aff. Étranghères) gives an account of the paper to which the Scots verbally assented, which agrees with that given by Hudson in his examination, and printed in . Unfortunately, the secretary whose duty it was to put Montreuil's letter into cipher omitted a few words, and the important passage relating to the message Montreuil sent to the King was thus left out. Therefore, Hudson's recollection of the content is the only record. Hudson tells us that the terms as he stated them were given to him by Montreuil, and it is to be supposed that he had the paper still with him when he was examined. The agreement between his account and that of Montreuil as far as it goes suggests that Hudson's recollections are substantially accurate. }}\n}}\nGardiner makes several points about this Scottish offer. The first is that the Scots were keen to gain physical possession of Charles, so their wording was on the edge of what they were willing to agree to. However, it is unlikely that the Scots realised just how strongly Charles disliked Presbyterianism (because of his belief that from \"no bishops\" it was but a small step to \"no king\"), and that although on 23 March he had promised that would agree to a Presbyterian church, he could always fall back on \"contrary to his conscience\" when later pressed on this issue. The second point was that not having put their terms in writing, the phrase in the fourth term \"upon sending a message\", if indeed that is what Montreuil's French original contained, is open to misinterpretation, as the King could send any message, no matter how indirect (Gardiner gives an example of \"It had been raining in Oxford\") and then demand Scottish armed support. It is more likely that the Scots meant \"the message\" containing the terms they had previously discussed with the King about Presbyterian becoming the official church in both kingdoms.\nBefore setting out again, as the King's disguise was by then known, it was thought necessary he should change it. So Charles changed into a clergyman's attire, and being called \"Doctor\", was to pass for Hudson's tutor.\nThe small party arrived at Stamford, Lincolnshire on the evening of 3 May and stayed with Alderman Richard Wolph. Charles and his two companions left there between 10:00 pm and midnight on 4 May. Travelling all night, they went towards Allington and crossed the Trent at Gotham.\nEarly on 5 May 1646, Charles reached the King's Arms Inn in Southwell, where Montreuil was still residing. Charles stayed there during the morning, leaving after lunch. His arrival caused a stir, and among those who visited him was the Earl of Lothian. Lothian expressed surprise at \"conditions\" that Charles thought he had obtained before his arrival and denied them, adding that they could not be responsible for what their Commissioners in London might have agreed to. Lothian presented a series of demands to Charles: the surrender of Newark, that he sign the Covenant and order the establishment of Presbyterianism in England and Ireland, and to direct the commander of the Royalist Scottish field army, James Graham, Marquess of Montrose, to lay down his arms. Charles refused all three requests and replied \"He that made you an earl, made James Graham a marquess\".\nAmong others who arrived at the inn were two of the Scottish Commissioners, who stayed and dined with the King. After lunch, the King went via Upton across Kelham bridge to the headquarters of General David Leslie.}} the Scottish general professed the greatest astonishment, because as Disraeli explained:\n}}\nWhether this was or was not true, the Scots persisted in affirming that the arrival of Charles at their headquarters was wholly unexpected. The first letter on the subject was to the English Commissioners at Newark, in which they said they felt it their duty to acquaint them that the King had come into their army that morning, which they said \"has overtaken us unexpectedly, filled us with amazement, and made us like men that dream\". Their next letter on the subject was to the Committee of Both Kingdoms in London, and in it they affirmed that\ncites .\n}}\nW. D. Hamilton was of the opinion that the King's reply at Southwell to Lord Lothian settled the matter of his status: \"He was no longer regarded as the guest of M. Montreuil, but as their prisoner\"; and when the interview with David Leslie came to an end, the King was escorted to Kelham House, where he was to reside while staying with the Scottish army at Newark. cites Lexington Papers, p. 2 The old hall at Kelham is stated by Robert Thoroton to have been built \"after the wars\", by Robert Sutton, Lord Lexington. As the house at Averham had been burnt, and Kelham Hall had not yet been built, there is no obvious historical candidate for \"Kelham House\"; it was probably a house of some size in the village of Kelham. }}\nImmediate aftermath\nAt Kelham House, Charles was closely watched by a guard dignified by the name of \"a guard of honour\" citing Stukeley's diary.\n}} while communications were passing with Parliament and negotiations were proceeding between the English and Scottish Commissioners, who met for the purpose in the fields between Kelham and Farndon, an area called Faringdon. Montreuil, Ashburnham, and Hudson were still there, and from Ashburnham's narrative, it seems that Charles felt it wise to try the effect of a little negotiation on his own account. Ashburnham says \"the King, recognising his difficulty, turned his thoughts another way, and resolved to come to the English if terms could be arranged\".\nAshburnham took steps to effect this, nominating as negotiators Lord Belasyse, governor of Newark, and Francis Pierrepont (MP), and requested that they communicate with him, but Lord Belasyse told him, when they conversed together after the surrender of Newark, that Pierrepont \"would by no means admit any discourse with me in the condition I then stood, the action of waiting on the King to the Scots army rendering me more obnoxious to the Parliament than any man living, and so those thoughts of his Majesty going to the English vanished\".\nIf Ashburnham had succeeded in his negotiations at Kelham, the whole course of events would have been changed. As it was, the Scots held their prize securely..}} In the records of the House of Lords, there is a document signed by eight noblemen who had heard of the jealous way in which the King was watched, protesting against \"strict guard being kept by the Scots army about the house where the King then was\", and none being suffered to have access to his person without their permission.\nSee also\n*Escape of Charles II (3 September – 16 October 1651) after the Royalist defeat at the Battle of Worcester\nNotes\nReferences\n*\n*\n*\n*  |last=Clarendon |first=Edward Hyde, Earl of |editor-last=Macray |editor-first=William Dunn |editor-link=William Dunn Macray |year=1888 |url=https://archive.org/details/historyofrebel04clar |title=The history of the rebellion and civil wars in England begun in the year 1641 by Edward, earl of Clarendon: Re-edited from a fresh collation of the original MS. in the Bodleian library, with marginal dates and occasional notes |volume=4 |publisher=Clarendon Press |page=[https://archive.org/stream/historyofrebel04clar#page/187/mode/1up 187]}}\n*\n*\n* |date=2011 |title=History |publisher=Saracens Head Hotel |url=http://www.saracensheadhotel.com/history/ |accessdate=2 October 2017}}\n* or A collection of divers scarce and curious pieces relating chiefly to matters of English history ...  |location=London |publisher=Printed for T. Evans |url=https://archive.org/details/desideratacurios00peck |chapter-url=https://archive.org/stream/desideratacurios00peck#page/358/mode/1up}}\nAttribution:\n* }}\nFurther reading\n*\n*\n*"
    }
  ]
}