{
  "content": [
    {
      "type": "text",
      "text": "# Charles Edward Ducat Pennycuick\n\n|birth_place   = Poona, India\n|death_date    =\n|death_place   = Newton Stewart, Wigtownshire, Scotland\n|body_discovered =\n|death_cause   =\n|resting_place =\n|resting_place_coordinates =\n|residence     =\n|nationality   = British\n|education     = Cheltenham College\n|alma_mater    =\n|occupation    = public servant\n|home_town     =\n|order         =\n|office        = Postmaster General of Ceylon\n|term          = 1896–1899\n|predecessor   = Lionel Frederick Lee\n|successor     = Henry Luttrell Moysey\n|order2        =\n|office2       = Treasurer of Ceylon\n|term2         = 1899–1901\n|predecessor2  = Frederick Richard Saunders\n|successor2    = Hardinge Hay Cameron\n|spouse        = Clementina née Woodhead m.1881\n|partner       =\n|children      = Agnes Helen, James Alexander Charles\n|parents       = John Pennycuick, Sarah Farrell\n|relations     =\n|signature     =\n|website       =\n|footnotes     =\n}}\nCharles Edward Ducat Pennycuick CMG (15 October 184423 January 1902) was the Mayor of Colombo (1893–1895), the Postmaster General of Ceylon and Director of Telegraphs (1896–1899) and the Treasurer of Ceylon (1899–1901).\nCharles Edward Ducat Pennycuick was born in Poona, India, on 15 January 1844, the youngest son of Brigadier John Pennycuick, who died during the Second Anglo-Sikh War at the Battle of Chillianwala in the Punjab and Sarah Farrell (1805–1878). He joined the Ceylon Civil Service and in 1878 was appointed acting District Judge, Police Magistrate and Coroner in Kurunegala. The following year as the District Judge and Police Magistrate at Badulla. He was elected as Mayor of Colombo in October 1893, serving until April 1895. He was subsequently appointed Postmaster General of Ceylon in 1896 and he finished his career as Treasurer of Ceylon. In the 1901 King's Birthday Honours he was awarded a Companion of the Order of St Michael and St George (CMG) for his services as Treasurer.\nPennycruick married Clementina Woodhead (1852–1925) on 22 February 1881 at St. Nicholas' Church, Brighton, Sussex. They had two children, Agnes Helen (1887–1948) and James Alexander Charles (1890–1966). Their son, James, gained the rank of Colonel in the Royal Engineers, fought in Malay during the Second World War and was awarded the Distinguished Service Order.\nHis elder brother, Colonel John Pennycuick, was a British Army engineer and civil servant, who also served as a member of the Madras Legislative Council. As an engineer in the Public Works Department, he was responsible for the construction of the Mullaperiyar Dam across the Periyar River in Kerala. Pennecuick’s main claim to fame appears to be that, as Mayor, he considered objectionable the killing of stray dogs by drowning them in Beira Lake, so in 1894 he ordered the construction of a gas chamber for the purpose.\nReferences\nExternal links\n*[http://www.slpost.gov.lk Sri Lanka Post]\n}}\n}}\n}}\n}}"
    }
  ]
}