{
  "content": [
    {
      "type": "text",
      "text": "# Charles Edward Mudie\n\n| birth_place   = Chelsea, London, England\n| death_date    =\n| death_place   =\n| other_names   =\n| occupation    = Publisher, book seller, lending library proprietor\n| years_active  =\n| known_for     =\n| notable_works =\n}}\nCharles Edward Mudie  (18 October 1818 – 28 October 1890), English publisher and founder of Mudie's Lending Library and Mudie's Subscription Library, was the son of a second-hand bookseller and newsagent. Mudie's efficient distribution system and vast supply of texts revolutionized the circulating library movement, while his \"select\" library influenced Victorian middle-class values and the structure of the three-volume novel. He was also the first publisher of James Russell Lowell's poems in England, and of Emerson's Man Thinking.\nEarly life\nCharles Edward Mudie was born in 1818 to Scottish parents in Cheyne Walk, Chelsea. He received most of his education by assisting in the family newspaper shop until he was twenty-two. In 1840, Mudie opened his first shop on Upper King Street, Bloomsbury.\nMudie's Lending Library\nMudie originally opened his circulating library to give the public greater access to non-fiction works — which comprised nearly one third of his stock — but the market value of the novel brought him financial success. In 1842, he began to lend books, charging subscribers one  guinea per year for the right to borrow one exchangeable volume of a novel at a time. (At that time, other book-lenders charged between four and ten guineas.) Mudie's model proved so successful that in 1852 he moved his \"Select Library\" to larger premises at 509, 510 & 511 New Oxford Street, at its junction with Museum Street and Hart Street, just a few yards south of the British Museum. The Vienna Café, a haunt of artists and writers using the British Museum Reading Room, stood opposite the library on New Oxford Street. Mudie's soon had outlets on Cross Street in Manchester and on New Street in Birmingham.London book deliveries were carried out by vans, and the expansion of railroads and trains allowed people to order books across the country. International orders were also issued and shipped abroad in tin boxes. Mudie's also exported books using watertight boxes, some of which were reported to have survived shipwreck.\nMudie was able to offer publishers advance purchase of three or four hundred copies of their new books, and he obtained corresponding discounts. The company's withdrawn books were offered for sale at £5 for a hundred volumes in 1860.\nIn the Victorian era, the cost of novels exceeded the means of most middle-class Englishmen, so popular lending-libraries like Mudie's had a strong influence over the public — and thus over authors and publishers. Mudie's demands that fiction novels be suited to the middle-class family controlled the morality, subject, and scope of the novel for fifty years.  His \"select\" books were carefully chosen with these his standards in mind; once the Mudie Library considered a book unfit for its customers, other libraries followed suit. The rise of the three-volume novel can be directly attributed to this influence, and Mudie's refusal to stock immoral books and \"novels of questionable character or inferior quality\", such as George Moore's A Modern Lover (1883), ''A Mummer's Wife (1885) and A Drama in Muslin (1886), also had an effect on the direction of Victorian literature.\nGeorge Moore criticized the moral and structural power the circulating library system had on literary distribution. His response to censorship was to issue a number of polemics against circulating libraries, the most popular being [http://www.bl.uk/collection-items/literature-at-nurse-a-pamphlet-about-the-censorship-of-literature Literature at Nurse, or Circulating Morals]. He confronted Mudie on why the librarian refused to sell A Modern Lover''. Mudie's response:\"Your book was considered immoral. Two ladies from the country wrote to me objecting to that scene where the girl sat to the artist as a model for Venus. After that I naturally refused to circulate your book, unIess any customer said he wanted particularly to read Mr. Moore's novel.\" Mudie was also crucial in the success of scientific volumes – in November 1859 he bought 500 copies of the first publication of Charles Darwin's On the Origin of Species. In fact, much of Darwin's own reading was obtained from Mudie's nonfiction collection. His five-guinea annual subscription allowed him to borrow a parcel of up to six recently-published books a month.\nIn 1860 the company's New Oxford Street premises were substantially enlarged, and new branches of the business were subsequently established in other English cities such as York, Manchester, and Birmingham. (Competitors of Mudie's in London in the 1870s included circulating libraries of Bolton, Day, Miles, Rolandi, W.H. Smith & Sons, and United.) In 1864 Mudie's was converted into a limited company. On August 18, 1871, directors of Mudie's Select Library (Limited) acquired control of the English and Foreign Library (formerly known as  Hookham's).\nMudie's library continued into the 1930s. The decline of Mudie's eventually came as a result of the rising number of government-funded public libraries, which offered similar services at a much-reduced rate.\nIn literature and popular culture\nMudie's Library is mentioned in the H. G. Wells classic The Invisible Man: \"We crawled past Mudie's, and there a tall woman with five or six yellow-labelled books hailed my cab, and I sprang out just in time to escape her, shaving a railway van narrowly in my flight. I made off up the roadway to Bloomsbury Square, intending to strike north past the Museum and so get into the quiet district.\"\nVirginia Woolf refers to Mudie's Library several times in her 1922 novel ''Jacob's Room''. From chapter 9: \"Time is issued to spinster ladies of wealth in long white ribbons. These they wind round and round, round and round, assisted by five female servants, a butler, a fine Mexican parrot, regular meals, Mudie's library, and friends dropping in.\"\nThe manga Emma, which takes place in Victorian England, features Mudie's Lending Library.\nIn W. S. Gilbert’s  Bab Ballads, naval Captain Reece is praised for promoting the comfort of his crew: \"New volumes came across the sea / From MISTER MUDIE'S libraree; / The Times and Saturday Review / Beguiled the leisure of the crew.\"\nIn The Importance of Being Earnest by Oscar Wilde, first produced in 1895, young Cecily Cardew, ward of a well-to-do gentleman living in Hertfordshire, speaking to her teacher Miss Prism about \"memory\" says that \"it usually chronicles the things that have never happened, and couldn't possibly have happened.  I believe that Memory is responsible for nearly all the three-volume novels that Mudie sends to us.\" Act II, Sc. 1.\nMudie’s Library—and the reading of novels in general—are mentioned frequently throughout the six Palliser novels by Anthony Trollope. In Can You Forgive Her?, Alice, newly arrived at Matching Priory, informs Jeffrey Palliser:\nIn The Prime Minister, among the shameful economies Ferdinand Lopez forces his wife, Emily Wharton, to endure is the cancellation of their subscription to Mudie’s.\nReferences\nAttribution:\n*\nSources\n* ''Trafficking in Literary Authority: Mudie's Select Library And The Commodification Of The Victorian Novel, L Roberts – Victorian Literature and Culture, 2006 – Cambridge Univ Press\n* A Victorian Leviathan: Mudie's Select Library, Guinevere L. Griest, Nineteenth-Century Fiction, Vol. 20, No. 2, 103–126. Sep. 1965\n*\n*Katz, Peter J. “Redefining the Republic of Letters: The Literary Public and Mudie’s Circulating Library.” Journal of Victorian Culture ''22, no. 3 (2017): 399–417.\nFurther reading\n;Catalogs\n*\n* [http://catalog.hathitrust.org/Record/001761612 1865]\n*\n*\n* [http://catalog.hathitrust.org/Record/007701829 1911]\n;About Mudie's\n* \"Mudie's.\" [http://hdl.handle.net/2027/mdp.39015018039654 Leisure Hour], 1861\n* \"Going to Mudie's.\" [https://books.google.com/books?id=vixKAAAAMAAJ London Society] v.16, no.95, Nov. 1869.\n*Cachin, Marie-Françoise. “Charles Edward Mudie: Disseminator of French Culture.” Publishing History 71 (2012): 69–4.\n* Clarence Gohdes. British Interest in American Literature During the Latter Part of the Nineteenth Century as Reflected by Mudie's Select Library. American Literature, Vol. 13, No. 4 (Jan. 1942), pp.&nbsp;356–362\n*\n*\nExternal links\n*[https://archon.library.illinois.edu/rbml/index.php?p=collections/controlcard&id=1089 Charles E. Mudie Collection, 1816-1897] | Rare Book & Manuscript Library, University of Illinois at Urbana-Champaign.\n* [https://www.flickr.com/photos/34900073@N07/3267721132/ Pratt Institute]. Bookplate of Mudie's Select Library\n* [https://www.flickr.com/photos/alan98/3704132783/ Flickr]. Mudie's Library label in a 1928 collected edition of Sherlock Holmes stories, published by John Murray\n* [http://digitalgallery.nypl.org/nypldigital/id?1702325 New York Public Library]. Portrait of Mudie"
    }
  ]
}