{
  "content": [
    {
      "type": "text",
      "text": "# Charles Warren\n\n| image         = Charles Warren carbon print portrait by Herbert Rose Barraud of London.jpg\n| image_size    =\n| alt           =\n| caption       = Carbon print portrait by Herbert Rose Barraud of London\n| nickname      =\n| birth_date    =\n| birth_place   = Bangor, Gwynedd, Wales\n| death_date    =\n| death_place   = Weston-super-Mare, Somerset, England\n| placeofburial = Churchyard at Westbere, Kent\n| allegiance    = United Kingdom\n| branch        = British Army\n| serviceyears  = 1857 – c.1905\n| rank          = General\n| unit          = Royal Engineers\n| commands      =\n| battles       =\n* Transkei War\n* Bechuanaland Expedition\n* Second Boer War\n** Battle of Spion Kop\n** Battle of Faber's Put\n| awards        =\n| relations     =\n| laterwork     =\n}}\nSir Charles Warren (7 February 1840 – 21 January 1927) was a British Army officer of the Royal Engineers. He was one of the earliest European archaeologists of the Biblical Holy Land, and particularly of the Temple Mount. Much of his military service was spent in British South Africa. Previously he was Commissioner of Police of the Metropolis, the head of the London Metropolitan Police, from 1886 to 1888 during the Jack the Ripper murders. His command in combat during the Second Boer War was criticised, but he achieved considerable success during his long life in his military and civil posts.\nEducation and early military career\nWarren was born in Bangor, Gwynedd, Wales, the son of Major-General Sir Charles Warren. He was educated at Bridgnorth Grammar School and Wem Grammar School in Shropshire. He also attended Cheltenham College for one term in 1854, from which he went to the Royal Military College, Sandhurst and then the Royal Military Academy at Woolwich (1855–57). On 27 December 1857, he was commissioned a second lieutenant in the Royal Engineers. On 1 September 1864, he married Fanny Margaretta Haydon (died 1919); they had two sons and two daughters. Warren was a devout Anglican and an enthusiastic Freemason, becoming the third District Grand Master of the Eastern Archipelago in Singapore and the founding Master of the Quatuor Coronati Lodge.\nMilitary and politics\n, now on display at the Gibraltar Museum, includes every house and roadway.]]\nFrom 1861 to 1865, Warren worked on surveying Gibraltar. During this time he surveyed the Rock of Gibraltar using trigonometry and with the support of Major-General Frome, he created two  long scale detailed models of Gibraltar. One of these was kept at Woolwich, but the other, which survives, is on display at Gibraltar Museum. These models not only depicted the shape of The Rock and harbour but also every road and building on the surface. From 1865 to 1867, he was an assistant instructor in surveying at the School of Military Engineering in Chatham. He was promoted captain for this work.\nWestern Palestine and Jerusalem\nIn 1867, Warren was recruited by the Palestine Exploration Fund to conduct Biblical archaeology \"reconnaissance\" with a view of further research and excavation to be undertaken later in Ottoman Syria, but more specifically the Holy Land or Biblical Palestine. During the PEF Survey of Palestine he conducted one of the first major excavations at the Temple Mount in Jerusalem, thereby ushering in a new age of Biblical archaeology. His most significant discovery was a water shaft, now known as Warren's Shaft, and a series of tunnels underneath the Temple Mount.\nWarren and his team also improved the topographic map of Jerusalem and made the first excavations of Tell es-Sultan, site of biblical city of Jericho. Some of the sites listed on Warren's topographic map, particularly that of Acra (where he places it in the Upper City, contrary to Josephus who places it in the Lower City), have since been corrected and updated.\nIn 1870, Warren returned to Britain, where he began writing a book about archaeology. His findings from the expedition would be published later as The survey of Western Palestine: Jerusalem (1884), written with C. R. Conder. Other books by Warren about the area include The Recovery of Jerusalem (1871), Underground Jerusalem (1876) and The Land of Promise (1875).\nWarren's most significant contribution is his exploration of a subterranean shaft in Jerusalem and which is now named after him, viz., Warren's Shaft. A 2013 publication, The Walls of the Temple Mount, provided more specifics about Warren's work, as summarised in a book review.\nSouth Africa\nHe served briefly at Dover and then at the School of Gunnery at Shoeburyness (1871–1873). In 1876, the Colonial Office appointed him special commissioner to survey the boundary between Griqualand West and the Orange Free State. For this work, he was made a Companion of the Order of St Michael and St George (CMG) in 1877. In the Transkei War (1877–78), he commanded the Diamond Fields Horse and was badly wounded at Perie Bush. For this service, he was mentioned in despatches and promoted to brevet lieutenant colonel. He was then appointed special commissioner to investigate \"native questions\" in Bechuanaland and commanded the Northern Border Expedition troops in quelling the rebellion there. In 1879, he became Administrator of Griqualand West. The town of Warrenton in the Northern Cape Province of South Africa is named after him.\nPalmer expedition investigation\nIn 1880, Warren returned to England to become Chief Instructor in Surveying at the School of Military Engineering. He held this post until 1884, but it was interrupted in 1882, when the Admiralty sent him to Sinai to discover what had happened to Professor Edward Henry Palmer's archaeological expedition. He discovered that the expedition members had been robbed and murdered, located their remains, and brought their killers to justice. For this, he was created a Knight Commander of the Order of St Michael and St George (KCMG) on 24 May 1883 and was also awarded an Order of the Medjidie, Third Class by the Egyptian government. In 1883, he was also made a Knight of Justice of the Order of St. John of Jerusalem, and in June 1884 he was elected a Fellow of the Royal Society (FRS).\nBechuanaland and election\nIn December 1884, by now a lieutenant-colonel, Warren was sent as HM Special Commissioner to command a military expedition to Bechuanaland, to assert British sovereignty in the face of encroachments from Germany and the Transvaal, and to suppress the Boer freebooter states of Stellaland and Goshen, which were backed by the Transvaal and were stealing land and cattle from the local Tswana tribes.\nBecoming known as the Warren Expedition, the force of 4,000 British and local troops headed north from Cape Town, accompanied by the first three observation balloons ever used by the British Army in the field. The expedition achieved its aims without bloodshed, and Warren was recalled in September 1885 and appointed a Knight Grand Cross of the Order of St Michael and St George (GCMG) on 4 October 1885. In November-December the same year he stood in the general election for election to Parliament as an independent Liberal candidate in the Sheffield Hallam constituency with a radical manifesto. He lost by 690 votes.\nCommissioner of Police\nAppointment\nin Vanity Fair, 1886]]\nIn 1885, Warren was appointed commander at Suakin in 1886. A few weeks after he arrived, however, he was appointed Commissioner of Police of the Metropolis following Sir Edmund Henderson's resignation. The exact rationale for his selection is still unknown. Up to that time, and for some time into the 20th century, the heads of Scotland Yard were selected from the ranks of the military. In Warren's case, he may have been selected in part by his involvement in discovering the fate of Professor Palmer's expedition into the Sinai in 1883. If so there may have been a serious error regarding his \"police work\" in that case, as it was a military investigation and not a civil style police operation.\nThe Metropolitan Police was in a bad state when Warren took over, suffering from Henderson's inactivity over the past few years. Economic conditions in London were bad, leading to demonstrations. He was concerned for his men's welfare, but much of this went unheeded. His men found him rather aloof, although he generally had good relations with his superintendents. At Queen Victoria's Golden Jubilee in 1887, the police received considerable adverse publicity after Miss Elizabeth Cass, an apparently respectable young seamstress, was (possibly) mistakenly arrested for soliciting, and was vocally supported by her employer in the courts.\nFriction\nTo make matters worse, Colonel Warren, a Liberal, did not get along with Conservative Home Secretary Henry Matthews, appointed a few months after he became Commissioner. Matthews supported the desire of the Assistant Commissioner (Crime), James Monro, to remain effectively independent of the Commissioner and also supported the Receiver, the force's chief financial officer, who continually clashed with Warren. Home Office Permanent Secretary Godfrey Lushington did not get on with Warren either. Warren was pilloried in the press for his extravagant dress uniform, his concern for the quality of his men's boots (a sensible concern considering they walked up to 20 miles a day, but one which was derided as a military obsession with kit), and his reintroduction of drill. The radical press completely turned against him after Bloody Sunday on 13 November 1887, when a demonstration in Trafalgar Square was broken up by 4,000 police officers on foot, 300 infantrymen and 600 mounted police and Life Guards.\n, October 1888]]\nWarren was appointed a Knight Commander of the Order of the Bath (KCB) on 7 January 1888. Later that year he renamed the four District Superintendents (ranking between the Superintendents and the Assistant Commissioners and each in charge of a group of divisions) Chief Constables, adding a Chief Constable at the head of the Met's Criminal Investigation Department (CID) in 1889. Monro insisted that the first holder of the latter post should be a friend of his, Melville Macnaghten, but Warren opposed his appointment on the grounds that during a riot in Bengal Macnaghten had been \"beaten by Hindoos\", as he put it. This grew into a major row between Warren and Monro, with both men offering their resignation to the Home Secretary. Matthews accepted Monro's resignation, but simply moved him to the Home Office and allowed him to keep command of Special Branch, which was his particular interest. Robert Anderson was appointed Assistant Commissioner (Crime) and Superintendent Adolphus Williamson was appointed Chief Constable (CID). Both men were encouraged to liaise with Monro behind Warren's back.\nJack the Ripper\nColonel Warren's biggest difficulty was the Jack the Ripper case. In his book, Abberline: The Man Who Hunted Jack the Ripper, author Peter Thurgood indicates that Warren was criticised during the investigation. He was blamed for failing to track down the killer, accused of failing to offer a reward for information (although that plan was actually rejected by the Home Office), accused of assigning an inadequate number of investigators (patently untrue) and favouring uniformed constables instead of detectives (probably untrue). In response, Warren wrote an article outlining his views and the facts for ''Murray's Magazine; the article also indicated that he favoured vigilante activity in finding the Ripper. He was censured by the Home Office for revealing the workings of the police department and for writing an article without permission.\nAs recently as 2015, a book about the Ripper case by Bruce Robinson castigated Warren as a \"lousy cop\" and suggested that a \"huge establishment cover-up\" and a Masonic conspiracy had been involved. In its book review, The Guardian'' stated that \"most historians put the police's failure to catch the Ripper down to incompetence\" but did not specifically name Warren in this context.\nWarren finally had enough of criticism and resigned – coincidentally right before the murder of Mary Jane Kelly on 9 November 1888. But he agreed to stay on until his successor was in place and continued in post until 1 December. He then returned to his army career. Nearly every superintendent on the force visited him at home to express their regret over his resignation. One attendee praised Warren for his thoughtfulness and his caring for the men in his command.\nLater military career and Boer War\nWarren returned to military duties and in 1889 was sent to command the garrison in Singapore, with a simultaneous promotion to the rank of Major-General in 1893 remaining in Singapore until 1895. After returning to England, he commanded the Thames District from 1895 to 1898, when he was promoted to lieutenant general in 1897 and was moved to the Reserve List.\nRoyal Engineer Yacht Club\nWatermanship being one of the many skills required of the Sapper led to the formation of a sailing club at the School of Military Engineering in 1812 and later to the development of cutter rowing teams. Construction of a canal linking the Thames and Medway rivers in 1824 gave the Royal Engineers an inland waterway to practice these skills, with the officer responsible for the canal drawn from the Corps of Royal Engineers. In 1899 as General Officer Commanding the Thames and Medway Canal, General Sir Charles Warren presented a challenge shield for a championship cutter race on the River Medway against the Royal Navy. The Sapper teams were drawn from members of the Submarine Mining School, but when the service was disbanded in 1905, the tradition of cutter rowing was continued by the fieldwork squads. The REYC continues to compete against the Royal Navy Sailing Association annually to this day. The club developed and became the Royal Engineer Yacht Club in 1846, making it one of the most senior yacht clubs in the United Kingdom. The REYC continues to this day, operating three club yachts and competing on behalf of the Corps at races around the world. The club is one of the oldest sports clubs in the British Army.\nSecond Boer War\nOn the outbreak of the Boer War in 1899, he returned to the colours to command the 5th Division of the South African Field Force. The decision to give command to Warren was surprising. By then, Warren was 59 years old, was said to have a \"disagreeable temper\", had little recent experience leading troops in battle and did not get along with his superior, General Sir Redvers Buller.\nIn January 1900, Warren bungled the second attempted relief of Ladysmith, which was a west flanking movement over the Tugela River. At the Battle of Spion Kop, on 23–24 January 1900, he had operational command, and his failures of judgment, delay and indecision despite his superior forces culminated in the disaster. Farwell highlighted Warren's fixation with the army's oxen and his view that Hlangwane Hill was the key to Colenso. Farwell suggested Warren was \"perhaps the worst\" of the British generals in the Boer War and certainly the most \"preposterous\". He was described by Redvers Buller in a letter to his wife as \"a duffer\", responsible for losing him \"a great chance\".\nWarren was recalled to Britain in August 1900 and never again commanded troops in the field. He was, however, appointed Honorary Colonel of the 1st Gloucestershire Royal Engineers (Volunteers) in November 1901, promoted general in 1904 and became Colonel-Commandant of the Royal Engineers in 1905. A book by South African author Owen Coetzer attempted \"in a small way to vindicate him\" for his Boer War actions.\nRetirement years\nFrom 1908, Warren became involved with Baden-Powell in the creation of the Boy Scout movement. He was also involved with another group, the Church Lads' Brigade  and 1st St Lawrence Scout Group, then called 1st Ramsgate – Sir Charles Warren's Own Scouts\nHe had previously authored several books on Biblical archaeology, particularly Jerusalem, and also wrote \"On Veldt in the Seventies\", and \"The Ancient Cubit and Our Weights and Measures\". He died of pneumonia, brought on by a bout of influenza, at his home in Weston-super-Mare, Somerset, was given a military funeral in Canterbury, and was buried in the churchyard at Westbere, Kent, next to his wife. A biography of him was published in 1941 by his son-in-law the Revd Watkin Wynn Williams.\nFictional portrayals\nWarren was played by Basil Henson in the 1973 miniseries Jack the Ripper.  He was played by Anthony Quayle in the 1979 film Murder by Decree, which features the characters of Sherlock Holmes and Doctor Watson in a dramatisation of a conspiracy theory concerning the Ripper case.  In the 1988 made-for-TV mini-series Jack the Ripper, which followed the same conspiracy theory as Murder by Decree, he was played by Hugh Fraser. The mini-series shows his final act as commissioner ordering lead detective Fred Abberline to suppress his findings on the investigation in order to protect the royal family from scandal. In the 2001 film From Hell he was played by Ian Richardson.\nBibliography\n*\n*[https://archive.org/details/undergroundjerus00warruoft Underground Jerusalem] (1876)\n*[https://archive.org/details/templeortombgiv00warruoft The Temple or the Tomb] (1880)\n*\n*[https://archive.org/details/planselevationss00warr/mode/2up Plans, elevations, sections, &c., shewing the results of the excavations at Jerusalem] (1884)\n*[https://archive.org/details/cu31924028684243 On the Veldt in the Seventies] (1902)\n*[https://archive.org/details/ancientcubitourw00warruoft The Ancient Cubit and Our Weights and Measures] (1903)\n*[https://wellcomecollection.org/works/pupamhy2 The Early Weights and Measures of Mankind] (1914)\nReferences\nSources\n*Austin, Ron. The Australian Illustrated Encyclopedia of the Zulu and Boer Wars, Slouch Hat Publication, McCrae, 1999.\n*Bloomfield, Jeffrey, The Making of the Commissioner: 1886, R.W. Stone, Q.P.M. (ed.), The Criminologist, Vol. 12, No. b3, p.&nbsp;139–155; reprinted, Paul Begg (Exec. ed.), The Ripperologist, No. 47, July 2003, pp.&nbsp;6–15.\n*Coetzer, Owen. The Anglo-Boer War: The Road to Infamy, 1899–1900, Arms and Armour, 1996.\n*Farwell, Byron, The Great Boer War, Allen Lane, London, 1976 (plus subsequent publications)\n*Fido, Martin and Keith Skinner, The Official Encyclopedia of Scotland Yard (Virgin Books, London: 1999)\n*\n*Kruger, Rayne. Goodbye Dolly Gray: The Story of the Boer War, 1959\n*Oxford Dictionary of National Biography\n*Pakenham, T. The Boer War (1979)\nFurther reading\n*\nExternal links\n* [https://web.archive.org/web/20120130041521/http://www.pef.org.uk/profiles/general-sir-charles-warren-1840-1927 Palestine Exploration Fund page on Warren]\n* [http://www.casebook.org/ripper_media/rps.spion.html Jack the Ripper Casebook article on Warren]\n* [http://www.soldiersofthequeen.com/page13r-SirCharlesWarren.html Large excellent photograph of Warren]\n*\n* [https://www.npg.org.uk/collections/search/person/mp56308/sir-charles-warren?search=sas&sText=charles+warren&OConly=true Portraits of Warren in the National Portrait Gallery]"
    }
  ]
}