{
  "content": [
    {
      "type": "text",
      "text": "# Character and description of Kingia__disambig_1\n\n's Narrative of a survey of the intertropical and western coasts of Australia performed between the years 1818 and 1822.]]\nCharacter and description of Kingia, a new genus of plants found on the south-west coast of New Holland, with observations on the structure of its unimpregnated ovulum, and on the female flower of Cycadeae and Coniferae is an 1826 paper by botanist Robert Brown. Though nominally a formal description of the then-unpublished genus Kingia, it is more notable for its digressions into ovule anatomy and development, in which Brown sets out for the first time the modern understanding of the structure of angiosperm ovules, and publishes the first description of the fundamental difference between angiosperms and gymnosperms. Of the latter it has been said that \"no more important discovery was ever made in the domain of comparative morphology and systematic Botany\".\nBackground\nBrown had known of Kingia for many years, having collected specimens himself in 1800. However early specimens lacked good fruiting material, rendering it impossible to determine its systematics, so no attempt was made to formally publish it. Publication was not initiated until 1823, when Allan Cunningham approached Brown with a request that he consider naming a plant after the Kings, Philip Gidley King and Phillip Parker King. Cunningham provided a list of potential plants, which included Kingia. The following year William Baxter sent Brown specimens of ripe fruit, and Brown set to work describing it.\nAs he often did, Brown took the opportunity to include some obliquely related material that he had been working on for some time; indeed as early as 1809. Partly as a result of this, production of the paper lagged, and by 1825 there was some concern that the paper would be preempted by Cunningham's forthcoming A few general remarks on the vegetation of certain coasts of Terra Australis. However Brown's paper was eventually read to the Linnean Society in November 1825, and appeared in print the following year as a preprint. Official publication occurred in 1827, in the second volume of Phillip Parker King's Narrative of a survey of the intertropical and western coasts of Australia performed between the years 1818 and 1822.\nContent\nThe paper was essentially divided into three parts. A treatment of Kingia comes first; the genus is formally described and explicitly named after the Kings, and tentatively placed in Liliaceae. Then follows a detailed description of the ovule of Kingia, which acts as a bridge to the following parts.\nIn the second part, Brown sets down for the first time the modern view of the anatomy and development of the angiosperm ovule. He describes the standard arrangement in angiosperms—the nucellus joined by the chalaza to the integuments, which surround the nucellus except at the micropyle, through which the pollen tubes enter. David Mabberley describes this section as \"a remarkably clear exposition of one of the most intricate and misunderstood areas of developmental anatomy in higher plants.\"\nThe third part is a discussion of the \"female flower\" of cycads and conifers. In it, Brown sets out for the first time the fundamental difference between angiosperms and gymnosperms; namely, that pollen grains are drawn into the ovule in gymnosperms, whereas in angiosperms, contact is via pollen tubes. This was a profoundly important discovery: in 1890, Julius von Sachs declared that \"no more important discovery was ever made in the domain of comparative morphology and systematic Botany\". That Brown was able to observe the gymnosperm ovule at all is remarkable given the difficulty of finding the same with a modern microscope.\nLegacy\nDespite the importance of Brown's paper, it received very little attention at first; for example reviewers of King's book took little notice of it. The longer term impact, however, was immense. It would take some time before the homologies were fully worked out, but ultimately the work laid the foundation for a great deal of work; for example Wilhelm Hofmeister's groundbreaking work on alternation of generations.\nPublication details\nCharacter and description of Kingia was first published in 1826 as a preprint. It appeared the following year as an appendix to Volume 2 of Phillip Parker King's Narrative of a survey of the intertropical and western coasts of Australia. It was subsequently republished in Volume 67 of the Philosophical Magazine, and in a number of separate reprints, including one in which it was paired with Cunningham's A few general remarks on the vegetation of certain coasts of Terra Australis. A French translation appeared in Annales des Sciences Naturelles in 1827, and German translations were published three times in 1827 and 1828, in Christian Gottfried Daniel Nees von Esenbeck's ''Robert Brown's Vermischte botanische Schriften, then in Linnaea, and finally in Isis''. In 1866 it was reprinted in John Joseph Bennett's The miscellaneous botanical works of Robert Brown.\nReferences"
    }
  ]
}