{
  "content": [
    {
      "type": "text",
      "text": "# Charles King (educator)\n\n| birth_place = New York City, New York\n| death_date  = October 1867 (aged 78)\n| death_place = Frascati, Italy\n| alma_mater  =\n| residence   =\n| profession  =\n| religion    =\n| party       = FederalistDemocrat\n| parents     = Rufus KingMary Alsop\n| spouse      =\n*\n}}\n| children    = 14, including Mary\n| relatives   = James G. King (brother)John A. King (brother)Edward King (brother)John Alsop (grandfather)Archibald Gracie (father-in-law)\n| website     =\n| footnotes   =\n| allegiance  = United States of America\n| rank        = Captain\n| battles     = War of 1812\n}}\nCharles King (March 16, 1789 &ndash; October 1867) was an American academic, politician and newspaper editor. He succeeded Nathaniel Fish Moore to become the ninth president of Columbia College (now Columbia University), holding the role from November 1849 until 1864.\nEarly life\nKing was born in New York City on March 16, 1789.  He was the son of lawyer and politician Rufus King (1755–1827) and his wife Mary (née Alsop) King (1769–1819).  Among his siblings was brothers John Alsop King, a Governor of New York; James Gore King, a U.S. Representative; Edward King; and Frederick Gore King.\nHis mother was an only child of Mary (née Frogat) Alsop and Continental Congressman John Alsop, a descendant of early American settlers, John Edward Underhill, Captain John Underhill, and Elizabeth Fones.\nKing was educated at the Harrow School (in Harrow, London) where he was a classmate with Lord Byron. Later in life, he received an honorary LL.D. from the College of New Jersey (later known as Princeton University) and from Harvard College in 1850.\nCareer\nAfter completing his education in England, King became a clerk in the banking house of Hope & Co. in Amsterdam.  King returned to the United States in 1806, and began working for Archibald Gracie, a merchant. He became partner with Gracie in 1810, the same year he married Gracie's daughter, Eliza.\nKing was captain of a volunteer regiment in the early part of the War of 1812, although he opposed the War.  He served in the 37th New York State Legislature as a Federalist member of the New York Assembly from July 1, 1813 until June 30, 1814, before becoming a newspaper publisher.\nA Democrat, he was editor of the New York American from 1823 to 1845, where he repeatedly clashed with Mordecai Noah, then Editor of the New York Enquirer; Noah nicknamed King \"Charles the Pink\".\nPresident of Columbia College\nOn 7 November 1849, he succeeded Nathaniel Fish Moore to become the ninth president of Columbia College (now Columbia University), holding the role until 1864.  On his formal inauguration, on November 28, 1849, he spoke on the duties and responsibilities of the university staff, and espoused the virtues of copying the English university system.\nDuring his term as President, the Columbia Law School was founded (1858), the Columbia Medical School, which had been discontinued in 1810, was re-established (1858), and the Columbia School of Mines (1863).  In addition to serving as president, he was a trustee from 1825 to 1838, and again from 1849 to 1867.  He resigned the presidency in 1864 due to health concerns, and visited Europe with the intention of remaining abroad several years.\nPersonal life\nOn March 12, 1810, he married first to Eliza Gracie (1790–1825), the eldest surviving daughter of shipping magnate Archibald Gracie. Eliza's sister Sarah Gracie was married to Charles' brother James, another sister, Esther Rogers Gracie, was married to the Lt. Gov. of Rhode Island William Beach Lawrence, and her youngest sister, Mary Ann Gracie, was married to Judge Michael Ulshoeffer. Before his wife's untimely death in 1825, they were the parents of eight children together, including:\n* Eliza Gracie King (1810–1883), who married Rev. Charles Henry Halsey (1810–1855)\n* Esther Rogers King (1812–1898), who married Brig. Gen. James Green Martin (1819–1878)\n* Rufus King (1814–1876), who married Susan McCown Eliot (1826–1892)\n* William Gracie King (1816–1882), who married Adeline Taylor McKee (1817–1854)\n* Charles King, Jr. (b. 1817), who died at sea\n* Alice Consett King (1819–1861), who married Rev. Andrew Bell Paterson\n* Archibald Gracie King (1821–1823), who died in childhood\n* Emily Sophia King (1823–1853), who married Stephen Van Rensselaer Paterson (1817–1872), grandson of William Paterson (1745–1806), a U.S. Senator, Governor of New Jersey and Justice of the Supreme Court of the United States.\nThe year following Eliza's death in 1825, Charles married secondly Henrietta Liston Low (1799–1882) on October 20, 1826. Henrietta was the daughter of Nicholas Low, a merchant and member of the New York State Assembly. Before King's death in 1867, they were the parents of six children, including:\n* Anne Johnstone King (1827–1891)\n* Cornelius Low King (1829–1893), who married Julia Ellen Lawrence (1832–1862), and later, Janet De Kay (1839–1896)\n* Henrietta Low King (b. 1833)\n* Gertrude Wallace King (b. 1836), who married American diplomat Eugene Schuyler in Paris in 1877.\n* Mary Alsop King (1839–1894), who became a writer and married William Henry Waddington (1826–1894), the Prime Minister of France.\n* Augustus Fleming King (1841–1862), who died during the Civil War\nKing died in Frascati, Italy in October 1867 and was temporarily interred in a vault in the Protestant cemetery in Rome. He is buried in the Grace Church Cemetery in Jamaica, Queens, New York, New York.\nDescendants\nKing was the grandfather of Charles King (1844–1933), a major general with the United States Army as well as a noted author, who married Adelaide L. Yorke.\nReferences\n;Notes\n;Sources\n*\n*\n*\nExternal links"
    }
  ]
}