{
  "content": [
    {
      "type": "text",
      "text": "# Charles Howard, 17th Earl of Suffolk\n\nCharles John Howard, 17th Earl of Suffolk, 10th Earl of Berkshire (7 November 1804 – 14 August 1876), styled Viscount Andover between 1820 and 1851, was a British peer and Whig politician from the Howard family.\nBackground\nSuffolk was born at Charlton Park, Wiltshire, the eldest son of Thomas Howard, 16th Earl of Suffolk, and the Hon. Elizabeth Jane, daughter of James Dutton, 1st Baron Sherborne. He was the brother of Hon. Henry Thomas Howard and Hon. James Howard.\nCareer\nSuffolk was returned to Parliament for Malmesbury in 1832, a seat he held until 1841. In 1851, he succeeded his father in the united earldoms of Suffolk and Berkshire and entered the House of Lords.\nHe was a magistrate and deputy lieutenant for Wiltshire, and was captain in the Wiltshire Yeomanry.\nMarriage and issue\nLord Suffolk married his kinswoman Isabella Catherine, daughter of Lord Henry Thomas Howard-Molyneux-Howard (brother of Bernard Howard, 12th Duke of Norfolk), in 1829. They had seven children:\n*Lady Isabella Julia Elizabeth Howard (15 April 1831 – 8 October 1910), married Maj. Francis Henry Atherley of Landguard Manor, son of Arthur Atherley and Lady Louisa Kerr, daughter of 5th Marquess of Lothian, had issue\n*Henry Charles Howard, 18th Earl of Suffolk (1833–1898), succeeded his father\n*Hon. Greville Theophilus Howard (22 December 1836 – 28 July 1880), married Lady Audrey Townshend, daughter of John Townshend, 4th Marquess Townshend and had issue, a barrister\n*Lady Mary Charlotte Henrietta Howard (29 June 1840 - 7 May 1872), died unmarried\n*Lt. Hon. Bernard Thomas Howard (21 August 1841 – 25 September 1868), Rifle Brigade, died unmarried\n*Lady Victoria Margaret Louisa Howard (3 March 1844 - 4 January 1906), died unmarried\n*Hon. Cecil Molyneux Howard (30 March 1849 – 28 April 1903), married Amy Schuster, daughter of Leo Schuster, without issue\nHe died in August 1876, aged 70, while driving at Charlton Park. He was succeeded in his titles by his eldest son, Henry. The Countess of Suffolk died in June 1891.\nReferences\nExternal links\n*"
    }
  ]
}