{
  "content": [
    {
      "type": "text",
      "text": "# Charles Günther, Count of Schwarzburg-Rudolstadt__disambig_1\n\n| death_place = Kranichfeld\n}}\nCharles Günther, Count of Schwarzburg-Rudolstadt (6 November 1576 &ndash; 24 September 1630 in Kranichfeld) was a German nobleman.  He was the ruling Count of Schwarzburg-Rudolstadt from 1605 to 1612 and then the ruling Count of Hohenstein, Lord of Rudolstadt, Leutenberg, Blankenburg, Sondershausen and Arnstadt from 1612 until his death.\nEarly life\nBorn into the House of Schwarzburg, Charles Günther was the eldest son of Count Albert VII of Schwarzburg-Rudolstadt and his first wife, Countess Juliana of Nassau-Dillenburg.  His brothers were Louis Günther I and Albert Günther.\nBiography\nHe was privately educated and in 1593, at the age of 17, he enrolled at the University of Jena.  He studied there until 1596; in the summer semester of 1597, he studied at the University of Leipzig.  In 1598, he went to the academy in Strasbourg, where he probably stayed until 1600.  His teacher Melchior Junius praised Charles Günther as an exceptionally diligent student in his Orationes.\nAfter his father died in 1605, Charles Günther ruled Schwarzburg-Rudolstadt for six years, with the consent of his brothers.  In 1612, the brothers decided to divide their inheritance.  Charles Günther received the part around Rudolstadt, Albert Günther received the part around Ilmenau, and Louis Günther I received the area around Frankenhausen.  In 1624, Albert Günther and Louis Günther exchanged the parts they held, in the Treaty of Erfurt.\nIn 1609, Charles Günther initiated the construction of a school in Rudolstadt.  The school was inaugurated in 1611. He and his wife, Anna Sophie were enthusiastic supporters of the educational reformer Wolfgang Ratke.\nPrince Louis I of Anhalt-Köthen admitted Charles Günther as a member of the Fruitbearing Society in 1619, probably on 5 September.  He received the nickname  (\"the Proliferating\") and the motto  (\"a hundred time\").  His emblem was the fully grown Turkish maize () with several open ears.  He was member number 23.\nCharles Günther died on 24 September 1630, at the age of 54.  As he had no children, he was succeeded by his brother Louis Günther I.\nPersonal life\nOn 13 June 1613, he married Princess Anna Sophie of Anhalt, youngest daughter of Prince Joachim Ernest, Prince of Anhalt and his second wife, Duchess Eleonore of Württemberg (1552–1618). The marriage remained childless.\nSee also\n* House of Schwarzburg\nReferences\n* Friedrich Apfelstedt: Das Haus Kevernburg-Schwarzburg von seinem Ursprunge bis auf unsere Zeit: dargestellt in den Stammtafeln seiner Haupt- und Nebenlinien und mit biographischen Notizen über die wichtigsten Glieder derselben, Bertram, Sondershausen, 1890,\n* Horst Fleischer: Die Grafen von Schwarzburg-Rudolstadt: Albrecht VII. bis Albert Anton, Rudolstadt, 2000,\n* Johann Christian August Junghans: Geschichte der schwarzburgischen Regenten, Leipzig, 1821, [https://books.google.com/books?id=YZ8-AAAAYAAJ&dq=junghans+regenten+schwarzburg&pg=PA309 Online]\nExternal links\n* [http://www.heidecksburg.de/cms/pages/de/das-schloss/regenten.php Overview of the counts and princes of Schwarzburg]"
    }
  ]
}