{
  "content": [
    {
      "type": "text",
      "text": "# Charles Read (historian)\n\nCharles Read is a British economic historian who teaches at the University of Oxford. He has written two books and also writes and edits for The Economist.\nEarly life and education\nRead was born in London and is of English, Welsh, Armenian and Ethiopian ancestry. He completed his BA, MPhil and PhD degrees at Christ's College, Cambridge with a focus on economic history, with his doctoral research garnering four academic prizes.\nCareer\nRead was a fellow of Corpus Christi College, Cambridge, where he taught economics and history and served as director of a bridging course (an introduction to university life aimed at widening participation). He also served as junior proctor of the university for the 2023/24 academic year.\nIn 2024, Read transferred to Oxford University where he is currently a senior tutor and tutorial fellow at Regent's Park College, Oxford.\nHe is also an elected Fellow of the Royal Historical Society. Read has written and edited for The Economist.\nLiz Truss government and September mini-budget\nRead appeared in national media in February 2023 in relation to the United Kingdom's September 2022 \"mini\" budget, after a tweet of his was shared 1,400 times. In his tweet, Read challenged the Prime Minister Liz Truss's claim that she had not been formally warned about the effects of her government's budget by pointing to his own letter the previous September to the Chancellor of the Exchequer, Kwasi Kwarteng, as well as a lecture he had given to the Treasury, warning about the problems the UK faced in 1847 and the parallels with the then current situation.\nRead claimed to foresee the resulting collapse because his book on the Great Irish Famine describes a similar situation to that recreated by Truss's government.\nWorks\nRead has published two books:\n* ''The Great Famine in Ireland and Britain's Financial Crisis (2022), which challenges the idea that the severity of the Irish famine was the result of British colonialism and laissez-faire ideas.\n* Calming the Storms: the Carry Trade, the Banking School and British Financial Crises since 1825 (2023) discusses British financial crises over the past two hundred years, focusing on carry trade and monetary policy. A review of the book in the weekly Cambridge Independent'' newspaper stated that Read aims to stake a claim to be 'Cambridge's avatar economist for the 21st century'.\nReferences"
    }
  ]
}