{
  "content": [
    {
      "type": "text",
      "text": "# Charles Edwards (writer)\n\nCharles Edwards ( &ndash; ) was a Welsh Puritan cleric and writer, whose works made him a major figure in the literary history of Welsh Puritanism.\nLife\nEdwards was born in about 1628 in Llansilin, Denbighshire, north Wales.  He was elected to a Bible clerkship at All Souls College, Oxford in 1644, but it is unknown where he went to school.  After being removed from the clerkship in 1648 by the Puritan visitors (who had taken charge of the university during the English Commonwealth), he was given a scholarship at Jesus College, Oxford later the same year and received his Bachelor of Arts degree in 1649.  In his memoirs, ''An Afflicted Man's Testimony Concerning his Troubles (1691), he said that he had been promised a Fellowship but that this was denied because of his views on the rule of Oliver Cromwell. He left Oxford and, whatever his views might have been, he then became a preacher in Wales under the auspices of the approvers of the Act for the Better Propagation of the Gospel, and was given the sinecure living of Llanrhaeadr-ym-Mochnant in 1653.  In 1657, he became assistant to the Commissioners for ejection of ministers in north Wales.  He lost his living in Llanrhaeadr-ym-Mochnant after the Restoration, even though he swore allegiance to Charles II.\nHe separated from his wife in 1666 and moved firstly to Oxford and then to London, where he published the works that made him a major figure in the literary history of Welsh Puritanism.  In 1672, he was licensed as a general preacher in Oswestry, Shropshire but returned to London in 1675, where he helped to print Welsh religious books, both reprints of earlier translations and new editions of more recent works by leading writers, and also the 1677&ndash;78 edition of the Welsh Bible.  He returned to Wales and started farming, with his memoirs being published in 1691.  Nothing further is recorded of him after 1 July 1691, the last date in the memoirs. His death date and place, and burial site, are unknown.\nWorks\nHis works include the following:\n* (1667, 2nd edition 1671) &ndash; described as a part-abridgement of Foxe's Book of Martyrs with further material taken from the Bible and other English writers.\n* (1677, the 3rd and expanded edition; described as \"a classic of Welsh prose\")\n* (\"An Echo of the Sons of Thunder\")'' (1671), comprising Richard Davies's epistle  (\"to all the Welsh people\") and Morris Kyffin's  (a translation of Apologia pro ecclesia Anglicana by Bishop John Jewel)\n* (1676), on the close connection between Hebrew and Welsh\n*Fatherly instructions: being select pieces of the writings of the primitive Christian teachers, translated into English, with an appendix, entituled Gildas Minimus (1686), the appendix containing some of his own sermons\nReferences"
    }
  ]
}