{
  "content": [
    {
      "type": "text",
      "text": "# Charles Edward Kennaway\n\n, after William Drummond.]]\nCharles Edward Kennaway (3 January 1800 – 3 November 1875) was a British Anglican clergyman, writer and poet.\nHe was the second son of Sir John Kennaway, 1st Baronet. He was educated at Harrow School and graduated from St John's College, Cambridge. He married firstly Emma, daughter of Gerard Thomas Noel, and secondly Olivia, daughter of Lewis Way. He served as Vicar of Chipping Campden 1832–1872 and Canon of Gloucester Cathedral.\nWorks\n*Address to His Parishioners (Shipston: S. White, 1834).\n*The Doctrine of Justification by Faith, As Held by the Romish and Protestant Churches, Compared, in a Sermon (London: J. G. F. & J. Rivington, 1835).\n*A Funeral Sermon, Preached in the Parish Church of Tallaton, January 10, 1836, On the Occasion of the Death of Sir J. Kennaway, to which are added Short Extracts from His Journal and Letters and a Few Favourite Hymns (London: James Nisbet & Co., 1836).\n*Sermons: Practical, Historical, and Doctrinal (London: J. Hatchard and Son, 1842).\n*''Four Tracts on “Unity,” I. On St. John XVII. The Lord's Last Prayer. II. \"The Lord of the Castle,\" An Allegory. III. Scriptural Proofs. IV. Proofs from the Fallen Nature of Man (London: J. G. F. & J. Rivington, 1844).\n*Sermons, Preached at Brighton (London: Francis & John Rivington, 1845).\n*The Christian Ministry Considered in a Threefold Aspect. The Ordination Sermon, Preached by Request of The Lord Bishop of Winchester, at Farnham Castle, Surrey, on Sunday, December 15th, 1844 (Brighton: Robert Folthorp & Co., 1845).\n*Poems (London: Rivington, 1846).\n*Two sermons. 1. The Duty of Charity, Independent of State Measures or State Relief. 2. The Doctrine of God's Visitations, etc (London: Francis and John Rivington, 1847).\n*Sermons to the Young (London: Francis & John Rivington, 1847).\n*Thoughts for the Lent Season of 1848 (London: Francis & John Rivington, 1848).\n*How Lent May be Kept by Rich and Poor. 1849 (London: Francis & John Rivington, 1849).\n*Christ Crucified; Or, the Incarnation and Atonement. An Ordination Sermon Preached in Christ Church Cathedral, Oxford (London: Francis & John Rivington, 1849).\n*The Dedication of Christian Churches. A Sermon Preached at the Consecration of the New Parish Church at Oddington, Gloucestershire, on Thursday, August 29th, 1852 (London: Joseph Whitaker, 1852).\n*The Law of Duty, Or, The Deeds and Difficulties of the Great Duke (London: J. Whitaker, 1853).\n*The War and the Newspapers: A Lecture Delivered to the Members of the Literary Institution at Ottery St. Mary (London: John Henry and James Parker, 1856).\n*Perdita and Angelina, Or Romeward and Homeward: An Anglo-Roman Dialogue (Oxford and London: John Henry and James Parker, 1857).\n*A Holy Life and Its Happy End. A Sermon After the Funeral of Mary Holmes, Widow ... With a Character of the same from the Sermon of James Hamilton, M.A. Senior Curate (London: Bell & Daldy, 1861).\n*\"The Consecration of Isaiah.\" An Ordination Sermon, Preached in Gloucester Cathedral (London: Rivington, 1865).\n*The Ministry of Creation. A Sermon Preached in Gloucester Cathedral at the Meeting of the Three Choirs, Sept. 5, 1865'' (London: Longman and Co.,  1865).\nNotes"
    }
  ]
}