{
  "content": [
    {
      "type": "text",
      "text": "# Charles King (general)\n\nCharles King}}\n| death_date    =\n| birth_place   = Albany, New York, US\n| death_place   = Milwaukee, Wisconsin, US\n| placeofburial = Forest Home Cemetery\n| image         = General Charles King 7.jpg\n| caption       =\n| allegiance    =\n| branch        =  Wisconsin National Guard\n| serviceyears  = 1866–1879, 1898–1899 (Army)1882–1897 (National Guard)\n| rank          = Major General\n| unit          = 5th Cavalry\n| battles       =\n* Yavapai War\n** Battle of Sunset Pass\n* Spanish–American War\n* Philippine–American War\n** Battle of Manila\n** Battle of Santa Cruz\n** Battle of Pagsanjan\n| laterwork     = author\n| relations     = Rufus King (father)Charles King (grandfather)Rufus King (great-grandfather)\n| signature     = Signature of Charles King (1844–1933).png\n}}\nCharles King (October 12, 1844 – March 17, 1933) was an American soldier and a distinguished writer.\nBiography\nBorn in New York capital, Albany, King was the son of Civil War general Rufus King, grandson of Columbia University president Charles King, and great-grandson of Rufus King, who was one of the signers of the United States Constitution on September 17, 1787, in Philadelphia. He graduated from West Point in 1866 and served in the Army during the Indian Wars under George Crook. He was wounded in the arm and head during the Battle of Sunset Pass forcing his retirement from the regular army as a captain in 1879.  During this time he became acquainted with Buffalo Bill Cody. King would later write scripts for several of Cody's silent films. He also served in the Wisconsin National Guard from 1882 until 1897, becoming Adjutant General in 1895.\nIn the spring of 1885, General King (at that time a captain in the National Guard) was riding in the area of Delafield, Wisconsin after visiting the Cushing homestead on the Bark River (present day Cushing Park) and the parents of the three historic Cushing Brothers. Captain King came upon a man dressed in a bathrobe drilling young men with broomsticks. Watching this futile exercise by toy soldiers, General King began to chuckle. Reverend Sydney T. Smythe asked what was so funny, and the reply was, \"I mean no disrespect, sir, but let me show you how it is done.\" He then proceeded to teach the young men the West Point Manual of Arms. The now Impressed Head Master of the St. Johns Military Academy (now the St. John's Northwestern Military Academy) inquired as to the gentlemen's name. Upon answering, Reverend Smythe shook hands and inquired on the spot of General King's availability.\nIn 1898, he was appointed brigadier general of volunteers and sailed to the Philippines during the Spanish–American War. The fighting with Spain was over by the time he arrived, but he assisted in the surrender negotiations.\nDuring the following Philippine–American War, King was placed in command of the 1st Brigade in Henry W. Lawton's division. He led his brigade during the Battle of Manila and sailed for Santa Cruz with Lawton's division. He was incapacitated by sickness during the Battle of Santa Cruz, but he returned to fight in the following Battle of Pagsanjan. He took part in the final major campaigns before the fighting turned primarily to guerilla warfare.\nHe returned to the United States and was active in the Wisconsin National Guard and in training troops for World War I. He wrote and edited over 60 books and novels. Among his list of titles are Campaigning with Crook, Fort Frayne, Under Fire and Daughter of the Sioux.\nGeneral King and his wife lived in the Carlton Hotel in Milwaukee. King commuted daily by train to Saint John's Military Academy. He routinely sat on the porch of the Holt house on campus and told the cadets, which included his grandson, tales of the old west.\nGeneral King was a Companion of the Wisconsin Commandery of the Military Order of the Loyal Legion of the United States.\nKing was an accomplished writer. Among his notable works is his biography of Ulysses S. Grant, entitled, The true Ulysses S. Grant.\nGeneral King died in Milwaukee at the age of 88 and is buried at the city's Forest Home Cemetery.\nAwards\n*Civil War Campaign Medal\n*Indian Campaign Medal\n*Spanish Campaign Medal\n*Philippine Campaign Medal\nSee also\nReferences\nSources\n* [https://web.archive.org/web/20060208093547/http://www.bbhc.org/charlesKing/KingBiography.html The Life of Charles King]\n* St.John's Historical Archives – Validated by Dr. MacIntyre of Centerville, Tennessee\nFurther reading\n*\n*\n*\nExternal links\n*\n*\n*\n*\n* [http://www.erbzine.com/mag12/1268.html General Charles King / Edgar Rice Burroughs Connection Series at ERBzine]\n* [http://www.erbzine.com/mag12/1269.html General Charles King Illustrated Bibliography at ERBzine]\n* [http://autry.iii.com/search/o=ocn166497527 Charles King Collection at the Autry National Center]"
    }
  ]
}