{
  "content": [
    {
      "type": "text",
      "text": "# Charles Warrell\n\nCharles Warrell (23 April 1889 – 26 November 1995) was an English schoolteacher, and creator of the I-Spy books, a series of spotters' guides written for British children and first published in 1949. In his role as creator and publisher of the books, Warrell was known pseudonymously as Big Chief I-Spy.\nLife and career\nWarrell was born in Farmborough, Somerset, in 1889. Having trained at Culham College, Abingdon, Oxfordshire, he became the headteacher at Higher Wych School in Cheshire, then later Pleasley Hill School, Mansfield, Nottinghamshire, during the 1940s. He first devised the concept for the I-Spy books in 1948, towards the end of his teaching career. He was an advocate of active learning, and originally created the books as a method of keeping children entertained and stimulated on long car journeys, and making children more aware of the world around them.\nI-Spy books\nWarrell was initially rejected by eight different publishers, so resorted to publishing the books himself, using his acquaintance with a book-buyer at his local branch of Woolworths to secure that store as a distribution outlet. The books were initially entitled Learning from Life, but Warrell changed the name on the advice of his wife Marian. Each book in the I-Spy series covered a different subject, such as I-SPY Cars, I-SPY on the Pavement, I-SPY Churches, I-SPY on a Train Journey, and so on. As children spotted the objects listed, they recorded the event in the book, and gained points, varying according to how unusual the sight. Once the book was complete, it could be sent to Warrell (known as Big Chief I-SPY) at \"Wigwam-by-the-Water, EC4\", for a feather and entry to the order of merit. The children participating in the game were known as The I-SPY Tribe.\nA success on publication, the books were soon picked up to be published in the Daily Mail and then the News Chronicle, where completed entries were mentioned by name in Warrell's column. By 1953 the I-SPY Tribe had half a million members. The I-SPY Tribe was also an activity club, with events held for members, known as \"pow-wows\" and attended by thousands of children, featuring Warrell in a giant Indian head-dress, and one event in London consisting of 8,000 children taking part in sight-seeing tours on 80 hired double-decker buses. By the time Warrell retired in 1956, 18 million copies had been sold. The books continued their popularity, switching between several different publishers over the years, before being taken on by current publisher Michelin Travel Publications in 1991. The original series of books remained in print until the mid-1980s, and eventually sold 25 million copies worldwide.\nAfter retirement Warrell and his wife settled in Budleigh Salterton, Devon. As old as 93, he was still writing articles for publication in national magazines, and at 104 years old he was reportedly still phoning friends to discuss developments in education. In 1995, aged 106, Warrell died in a nursing home in Matlock, Derbyshire, where he was known to the staff as Big Chief. He was survived by two daughters from his first marriage, to Elizabeth Gill.\nReferences"
    }
  ]
}