{
  "content": [
    {
      "type": "text",
      "text": "# Charles Hayward Izard\n\n|parliament         = New Zealand\n|term_start         = 6 December 1905\n|term_end           = 17 November 1908\n|predecessor        = seat established\n|successor          = Alexander Herdman\n|birth_date         =\n|birth_place        = Wellington, New Zealand\n|death_date         =\n|death_place        = Upper Hutt, New Zealand\n|restingplace       =\n|party              = Liberal\n|spouse             =\n|relations          = Charles Beard Izard (father)\n|children           =\n|profession         = Lawyer\n|religion           =\n}}\nCharles Hayward Izard (19 January 1862 – 18 September 1925) was a Liberal Party Member of Parliament in New Zealand, and a Wellington lawyer.\nBiography\nEarly life\nIzard was born in Wellington on 19 January 1862, the eldest son of Charles Beard Izard, who was a prominent and popular Wellington lawyer and MP for . After having primary education in Wellington, Izard was sent to Harrow, England and read for the bar at Lincoln's Inn where he was admitted as a barrister in 1883. On 12 July 1886, Izard married Stella Margaret Halsted at St Paul's Cathedral in Wellington.\nProfessional career\nIzard returned to New Zealand and practiced with the firm Bell Gully together with his father. He subsequently practised on his own, and later partners included Thomas S. Weston, J. F. B. Stevenson, and S. J. Castle.\nPolitical career\n|end        = 1908\n|term       = 16th\n|electorate =\n|party      = New Zealand Liberal Party\n}}\nIzard was for many years a member of Wellington City Council. He unsuccessfully contested the  electorate in the . Izard also stood for  in a by-election in 1905, coming second to fellow Liberal Francis Fisher.\nHe was elected to the Wellington North electorate in the 1905 election, but was defeated in 1908. His younger brother, Dr Arnold Woolford Izard, stood for the Wellington North electorate in the 1911 election on behalf of the Liberal Party.\nHe was appointed to the Legislative Council by the National wartime coalition government on 7 May 1918, and served there until he died in 1925.\nFamily and death\nHe died at his residence in Upper Hutt on 18 September 1925. His funeral service was held at St Paul's Cathedral in Wellington, and he was buried at Karori Cemetery. He was survived by his wife Stella Izard. They had one son, Keith Halsted Izard, who died in London in 1919.\nLegacy\nIzard left the bulk of his estate for the establishment of an educational and charitable trust, the Charles Hayward Izard Trust, administered by the Wellington City Council. Izard Road in Wellington is named after him.\nNotes\nReferences\n*\n*\n*"
    }
  ]
}