{
  "content": [
    {
      "type": "text",
      "text": "# Chattanooga in the American Civil War\n\nChattanooga, Tennessee, was a major rail center and a strategic vantage-point during the American Civil War, with high ground competed-for by both sides. When Union forces were besieged in the town, General Ulysses S. Grant forced a supply-route, earning him President Abraham Lincoln's gratitude.\nLoyalties in a divided state\nTennessee was the last state to join the Confederacy (June 1861), being deeply divided between the mountainous eastern zone, including Chattanooga, that was pro-Union, and the slave-intensive western counties that were pro-Confederate. At one point, it was proposed that East Tennessee should become a separate state of the Union.\nWhen Tennessee seceded, future President Andrew Johnson was the only southern senator to remain in the senate, putting his life at risk, but earning him credibility with Lincoln, who appointed him military governor of Tennessee in March 1862. (The Confederacy retaliated by confiscating his land.) As a Southern War Democrat, Johnson was the natural choice as Lincoln's running-mate in his successful 1864 re-election bid.\nTennessee contributed more regiments to the Union than any other Confederate state did.\nTroop movements\nAs an important railroad hub, connecting major southern arsenals, Chattanooga was closely engaged in the Confederate war effort from the start, despite local resistance and even some guerrilla activity.\nThe city remained in Confederate hands until September 1863, after which it was occupied continuously by the Union. General Rosecrans retreated to safety there following his catastrophic defeat at Chickamauga, besieged by General Braxton Bragg until General Ulysses S. Grant was able to open a supply line. Grant drove the Confederates off Lookout Mountain, before routing them decisively at Missionary Ridge. Chattanooga then served as the gateway to Georgia for General William T. Sherman's 1864 campaign.\nThe Battles\nFirst Battle of Chattanooga (June 7–8, 1862)\nA raid by Union Brig. Gen. James Negley aimed at capturing the Confederate-held city. His long artillery bombardment provoked a disorganized response from enemy gunners, but Negley withdrew on the second day. It had been a minor Confederate victory, but it demonstrated that the Union could strike deep into the enemy heartlands.\nSecond Battle of Chattanooga (August 21 -  September 8, 1863)\nDiversionary tactic by Union Maj. Gen. William S. Rosecrans to distract the attention of Confederate General Braxton Bragg through extensive shelling from the north-east of the city, while Union troops were massing to the south-west. When Bragg learned of this, he retreated into Georgia, and the Union occupied the city.\nChattanooga campaign (Sept. 21 – November 25, 1863)\nAfter its shock-defeat at Chickamauga (Georgia), Rosecrans’ Army of the Cumberland retreated into its fortifications at Chattanooga, where it was under heavy siege by Bragg and facing surrender. The demoralised Rosecrans was urgently reinforced by the team of Grant, Thomas and Sherman. Principal actions:\n:*‘Cracker Line’ (October 26–28)\n:By seizing a ferry-point on the Tennessee River, the Union managed to secure a supply-route that could feed the starving troops, who cheerfully dubbed it the Cracker Line.\n:*Battle of Wauhatchie (October 28–29)\n:Confederate bid to re-take the Cracker Line, with many orders going astray in the dark. The Union, under Joe Hooker, were almost as disorganised, but retained the position.\n:*Lookout Mountain (November 24)\n:The Confederate position looked impregnable, but their artillery could not aim low enough to prevent Hooker driving them off the peak in a dense fog, which cleared to show the Union flag.\n:*Missionary Ridge (November 25)\n:Grant had ordered the Cumberlands to capture the rifle-pits at the base of the ridge. But apparently on impulse, they continued on up to the crest, achieving a startling victory.\n:*Battle of Ringgold Gap (November 27)\n:Failed attempt by Grant to capture the Confederates retreating into Georgia. Led by Pat Cleburne, they drove off the Union with minimal casualties, and Grant did not pursue further.\nSee also\n*Tennessee in the American Civil War\nReferences\nExternal links\n* [https://www.nps.gov/chch/learn/historyculture/battles-for-chattanooga.htm The Battles for Chattanooga] - U.S. National Park Service\n* [https://www.battlefields.org/learn/civil-war/battles/chattanooga Chattanooga Missionary Ridge, Lookout Mountain] - American Battlefield Trust\n* [https://www.visitchattanooga.com/things-to-do/history/civil-war/ Chattanooga's Civil War History] - Chattanooga Tourism Co."
    }
  ]
}