{
  "content": [
    {
      "type": "text",
      "text": "# Chattanooga Zoo at Warner Park__disambig_1\n\n|area             =\n|num_species      = 148 (2012)\n|num_animals      = 860 (2012)\n|largest_tank_vol =\n|total_tank_vol   =\n|annual_visitors  = 150,095 (2012)\n|members          = Association of Zoos and Aquariums\n|exhibits =Himalayan Passage, Gombe Forest, Corcovado Jungle, Walkin' the Tracks, Warner Park Ranch, Deserts of the World, Forests of the World, and Makazi Ya Twiga\n|publictransit=  CARTA\n|website          =\n}}\nThe Chattanooga Zoo at Warner Park (formerly the Warner Park Zoo) is a  zoological park located in Warner Park in Chattanooga, Tennessee. The zoo was established in 1937 by the City of Chattanooga with the construction of two  cages for rhesus monkeys. (An earlier zoo was established in 1900, Oxley Zoo, by Colonel F. G. Oxley of Bridgeport, Alabama, when he donated $500 to open the first public zoo in Chattanooga. Oxley Zoo closed due to financial constraints in 1911.) The zoo has been accredited by the Association of Zoos and Aquariums (AZA) since 1998.\nExhibits and facilities\nHank the chimp.\nThe most notable exhibit is the Himalayan Passage, which houses the zoo's red pandas. The exhibit boasts the largest indoor red panda exhibit in the world, despite the zoo being one of the smallest zoos accredited by the AZA. The Himalayan Passage passage was expanded in 2006 to include habitats for snow leopards and Hanuman langurs. The hanuman langurs shared an exhibit with a Francois langur, and when the last hanuman langur left in 2015, the zoo welcomed a new Francois langur. The Francois langurs left and then were replaced by a breeding pair of white-cheeked gibbons in 2019.\nThe Gombe Forest is a $2.1 million exhibit that is home to the zoo's chimpanzees. The Gombe Forest is an indoor/outdoor exhibit built in 2001 to house Hank, the zoo's long-time resident and seen in photo at right, as well as several other chimps. Hank, found in the rain forests of Africa in 1968, was donated to the zoo in 1976 and became the longest and most famous resident of the zoo before dying of natural causes at age 42 on January 24, 2011. The Donovan Interpretive Center features an indoor chimpanzee viewing area and other small exhibits.\nThe Corcovado Jungle is home to animals from Latin America, including jaguars, spider monkeys, macaws, capybaras, kinkajous, and the prehensile-tailed porcupine. The La Selva Amazonica pavilion houses four different species of tamarins as well as Geoffrey's marmosets.\nDesert dwellers such as fennec foxes, meerkats, and the sand cat, and forest animals including komodo dragons can be found in the Deserts and Forests of the World buildings.\n'''Walkin' the Tracks''' holds the zoo's North American animals, including bobcats, prairie dogs and white-tailed deer. Its theme is around a railroad in reference to Chattanooga's rail history. The Cougar Express has indoor viewing in a train car for the zoo's cougars.\nThe Warner Park Ranch is home to dromedary camels, pot-bellied pigs, miniature horses, alpacas, and a highland cattle. The petting zoo houses a few different breeds of goats, which guests are allowed to pet.\nA new front entrance complex opened in 2008, and includes new parking areas, a gift shop, restroom facilities, a concessions pavilion, and an endangered species carousel.\nIn May 2020, the zoo received three male reticulated giraffes, opening the Makazi Ya Twiga exhibit and completing Phase 1 of their \"Reaching Great Heights\" campaign and expansion. It later obtained blue duikers in an indoor exhibit.\nThe zoo also operates an intake wildlife rehabilitation facility that treats admitted animals until they can be transported to another local facility.\nConservation\nThe Chattanooga Zoo is actively involved in conservation efforts, specifically the AZA's Species Survival Plan which manages the breeding, conservation, and welfare of endangered species throughout AZA accredited facilities in North America. The zoo has joined hands with Lincoln Park Zoo in the Argentine Jaguar Conservation Project, and with Lee University in the Hellbender  Conservation Program. Since 1998, the zoo has also been a partner with the Zoo Conservation Outreach Group/Fundacion Zoologica (ZCOG). ZCOG is an organization that partners with Latin American zoos and assists with conservation initiatives in Latin America, specifically the saving of the Amazon Rainforest.\nThe future\nThe zoo is currently undergoing a five-phase, $12 million Master Plan that is transforming it into an excellent zoological facility. In the last 10 years, the zoo has expanded from  to its current . The Master Plan includes new exhibits and expansion of the animal collection to specifically include African penguins, gibbons, and Komodo dragons.\nNotes\n}}\nExternal links\n*"
    }
  ]
}