{
  "content": [
    {
      "type": "text",
      "text": "# Cheerleading in the United Kingdom\n\nCheerleading is a sport that is practised all throughout the world, with increasing popularity within the United Kingdom. Cheerleading has over 89,000 athletes within the United Kingdom, with just over 900 teams in England alone, with the newfound success and passion of UK based teams on the international stage helping to change perceptions within the region. Teams from the United Kingdom have gained international recognition, with the Olympic Channel producing a 10 minute short documentary following Unity Allstars' team Ruby to highlight the increase momentum of competitive cheerleading within the United Kingdom.\nCheerleading is conducted through all-star clubs as well as university and school teams.\nAs a sport, cheerleading is offered as a PE extracurricular in a number of UK based schools, with it being estimated that 37% of schools now offer a cheerleading program as an extracurricular physical education choice, leading to UK participation within World Schools Cheerleading Championships and National Scholastic Cheerleading championships being offered.\nA number of universities also offer cheerleading as an option within the United Kingdom, with 70 universities offering it as an extracurricular optioin in 2018, with a further 23 offering competitive cheerleading. Cheerleading is a recognised sport under the International University Sports Federation, however, the sport remains unrecognised by the British Universities and Colleges Sport association.\nThe main way that cheerleading as a sport is provided in the UK is through all-star competitive clubs, with clubs located throughout England, Northern Ireland, Scotland and Wales.\nGoverning bodies\nSportCheer UK (SCUK) acts as the governing body for cheerleading within the United Kingdom, being recognised as such by the International Cheer Union, the international governing body for cheerleading. SCUK is composed of governing body members from England (SportCheer England), Northern Ireland (SportCheer Northern Ireland), Scotland (SportCheer Scotland) and Wales (SportCheer Wales). SCUK provides an age grid and safety rules for both cheer and performance cheer/dance (aligned with IASF), helping to align the sport under a single standard across the United Kingdom.\nAs part of their governing body role, the governing body members help organise representative teams from their respective countries to compete at the ICU World Championships, held in Florida. In 2023, SCUK was represented by national teams from England, Scotland and Wales, winning a total of 7 medals.\nOn a more broad scale, SportCheer England and SportCheer Scotland are both members of the umbrella organisation of the European Cheer Union, a recognised regional branch of the International Cheer Union.\nCompetition divisions\nWithin the United Kingdom, SportCheer UK and its members model their structure off divisions and age groupings after the IASF guidelines.\nAs in the United States, competitions are grouped into divisions that are based on a combination of the team's age category, difficulty level and size. Certain categories are also further separated into \"all-girl\" (females only) and \"co-ed\" (mixture of genders) groups. For large events with high numbers of teams registered in one division, organisations also can then further split the divisions based on the team's size or the gym/studio's size to form a manageable number of teams within a division. For example, a team may compete in divisions such as \"extra small youth level 1\", or \"senior co-ed level 5\".\nThe age category of the team also restricts the level that the team may be entered into for safety reasons, with younger age category teams not being allowed to enter higher levels for safety. There are also \"sub-categories\" within the junior and senior age divisions that do not allow teams with younger age category eligible athletes to enter the higher levels.\nAll-star age groups are based on the competitors' ages at 31 August 2023, with that age being applicable for the entire season. The exception to this rule is the IASF international divisions, where the eligible age of an athlete is determined by their age during 2024 i.e. is a 12 year old athlete is participating in an IASF division with a minimum age of 14, they are legal if they turn 14 during 2024, or an athlete who turns 13 on 2 January 2024 is eligible for a division where the maximum age is 12 as they would be 12 for at least 1 day during 2024.\nEvent producers have the option of offering all of the divisions, or only a selection, with speciality divisions varying from EP to EP.\nCurrently overlap in the age categories enables an athlete to compete in multiple teams who are entered in different age categories. For example, an 11 year old could compete on teams that are entered in the youth, junior and senior age categories.\nNewly introduced in 2023-2024 for senior divisions with a minimum age of 16 years or below was a rule stating the age spread of team members may not exceed 10 years. For example, a senior level 1 team where the youngest athlete was 13 is no longer allowed any athletes on the team who are aged of 23 years old. This however only allowed to SCUK divisions and does not include the IASF divisions.\n{| class=\"wikitable\"\n|+Cheer Age Grid\n!Division\n!Ages\n!Gender\n!Number on Team\n!Level Restriction\n|-\n|Tiny Novice\n|3 - 6\n|Female/Male\n|5 - 30\n|1\n|-\n|Tiny Prep\n|3 - 6\n|Female/Male\n|5 - 30\n|1\n|-\n|Tiny\n|3 - 6\n|Female/Male\n|5 - 32\n|1\n|-\n|Mini Novice\n|5 - 8\n|Female/Male\n|5 - 30\n|1\n|-\n|Mini Prep\n|5 - 8\n|Female/Male\n|5 - 30\n|1, 2.1\n|-\n|Mini\n|5 - 8\n|Female/Male\n|5 - 32\n|1, 2\n|-\n|Youth Novice\n|6 - 12\n|Female/Male\n|5 - 30\n|1\n|-\n|Youth Prep\n|7 - 11\n|Female/Male\n|5 - 30\n|1, 2.1\n|-\n| rowspan=\"3\" |Youth\n|7 - 11\n|Female/Male\n|5 - 32\n|1, 2, 3\n|-\n|8 - 11\n|Female/Male\n|5 - 32\n|4\n|-\n|9 - 11\n|Female/Male\n|5 - 32\n|5\n|-\n|Junior Prep\n|8 - 14\n|Female/Male\n|5 - 30\n|1, 2.1\n|-\n| rowspan=\"2\" |Junior\n|8 - 14\n|Female/Male\n|5 - 32\n|1, 2, 3, 4\n|-\n|9 - 14\n|Female/Male\n|5 - 38\n|5, 6\n|-\n|Senior Prep\n|11 +\nmin. 1 athlete being 15 years or older\n|Female/Male\n|5 - 30\n|1, 2.1\n|-\n| rowspan=\"3\" |Senior\n| rowspan=\"3\" |11 +\nmin. 1 athlete being 15 years or older\n|Female/Male\n|5 - 32\n|1, 2, 4.2\n|-\n|Female/Male\n|5 - 38\n|5\n|-\n|No males\n|5 - 32\n|3, 4\n|-\n|Senior Coed\n|11 +\nmin. 1 athlete being 15 years or older\n|1+ males\n|5 - 32\n|3, 4\n|-\n| rowspan=\"2\" |Open\n| rowspan=\"2\" |17+\n|Female/Male\n|5 - 32\n|1, 2\n|-\n|No Males\n|5 - 32\n|3, 4\n|-\n|Open Coed\n|17+\n|1+ males\n|5 - 32\n|3, 4\n|-\n| rowspan=\"2\" |IASF U12\n| rowspan=\"2\" |7 - 12\n(2011 - 2016)\n|Female/Male\n|5 - 30\n|1, 2, 3, 4\n|-\n|1+ males\n|5 - 30\n|5\n|-\n| rowspan=\"2\" |IASF U16\n| rowspan=\"2\" |12 - 16\n(2007 - 2012)\n|Female/Male\n| rowspan=\"2\" |10 - 24\n|1, 2, 3\n|-\n|No males\n|4\n|-\n|IASF U16 Coed\n|12 - 16\n(2007 - 2012)\n|1+ males\n|10 - 24\n|4\n|-\n| rowspan=\"2\" |IASF U18\n| rowspan=\"2\" |14 - 18\n(2005 - 2010)\n|Female/Male\n| rowspan=\"2\" |10 - 24\n|1, 2\n|-\n|No males\n|3, 4, 5, 6\n|-\n|IASF U18 Coed\n|14 - 18\n(2005 - 2010)\n|1+ males\n|10 - 24\n|3, 4, 5,\n|-\n| rowspan=\"2\" |IASF Open\n|16+\n(Born in 2008 or earlier)\n|No males\n| rowspan=\"2\" |10 - 24\n|3, 4, 5, 6\n|-\n|17+\n(Born in 2007 or earlier)\n|No males\n|7\n|-\n| rowspan=\"5\" |IASF Open Coed\n| rowspan=\"2\" |16+\n(Born in 2008 or earlier)\n|1+ males\n| rowspan=\"3\" |10 - 24\n|3, 4\n|-\n|1 - 4 males\n|5, 6\n|-\n|17+\n(Born in 2007 or earlier)\n|1 - 4 males\n|7\n|-\n|16+\n(Born in 2008 or earlier)\n|5 - 16 males\n|10 - 24\n|5, 6\n|-\n|17+\n(Born in 2007 or earlier)\n|5 - 16 males\n|10 - 24\n|7\n|-\n| rowspan=\"3\" |IASF Open Non-Tumbling\n|16+\n(Born in 2008 or earlier)\n|Female/Male\n|10 - 30\n|3NT, 4NT\n|-\n|16+\n(Born in 2008 or earlier)\n|No Males\n|10 - 30\n|5NT, 6NT\n|-\n|17+\n(Born in 2007 or earlier)\n|No Males\n|10 - 30\n|7NT\n|-\n| rowspan=\"2\" |IASF Open Non-Tumbling Coed\n|16+\n(Born in 2008 or earlier)\n|1 - 20 males\n|10 - 30\n|5 NT, 6NT\n|-\n|17+\n(Born in 2007 or earlier)\n|1 - 20 males\n|10 - 30\n|7NT\n|-\n|IASF Global Club\n|16+\n(Born in 2008 or earlier)\n|No Males\n|10 - 24\n|6\n|-\n|IASF Global Club Coed\n|16+\n(Born in 2008 or earlier)\n|1 - 16\n|10 - 24\n|6\n|-\n|Masters\n|At least 75% of athletes aged 25+\nMinimum age of 17\n|Female/Male\n|5 - 38\n|1, 2\n|-\n|Cheer Abilities Youth\n|8 - 12\n|Female/Male\n|Unlimited\n|2\n|-\n|Cheer Abilities Junior\n|12 - 16\n|Female/Male\n|Unlimited\n|2\n|-\n|Cheer Abilities Senior\n|12+\nMin. 1 athlete 17+\n|Female/Male\n|Unlimited\n|2\n|-\n|Adaptive Abilities Youth\n|8 - 12\n|Female/Male\n|5 - 30\n|1, 2, 3\n(Beginner, Novice, Median)\n|-\n|Adaptive Abilities Junior\n|12 - 16\n|Female/Male\n|5 - 30\n|1, 2, 3, 4\n(Beginner, Novice, Median, Advanced)\n|-\n|Adaptive Abilities Senior All Girl\n|12+\nMin 1 athlete 17+\n|No Males\n|5 - 30\n|1, 2, 3, 4\n(Beginner, Novice, Median, Advanced)\n|-\n|Adaptive Abilities Senior Coed\n|12+\nMin 1 athlete 17+\n|1+ Males\n|5 - 30\n|1, 2, 3, 4\n(Beginner, Novice, Median, Advanced)\n|-\n|University All Girl\n|17+\n90% registered uni student\n10% allowed past students alumni if graduated within last 4 years\n|No Males\n|5 - 38\n|1, 2, 3, 4, 5, 6, 7\n|-\n|University Coed\n|17+\n90% registered uni student\n10% allowed past students alumni if graduated within last 4 years\n|1+ Males\n|5 - 38\n|\n|-\n|University Non-Tumbling\n|17+\n90% registered uni student\n10% allowed past students alumni if graduated within last 4 years\n|Female/Male\n|5 - 38\n|2NT, 3NT, 4NT, 5NT, 6NT, 7NT\n|}\nSCUK also provides guidelines for combining or splitting these divisions in the best interest of providing a competitive environment, requiring that where possible, there should be at least 3 teams in any given division and level. Under these guidelines, teams of different levels are not allowed to be combined into one division, and teams of different ages may not be combined into one division.\nNovice cheer divisions are prohibited to be combined or further split. Likewise, All Star Prep divisions are prohibited from being combined, however, prep divisions may be split by size per the All Star Elite split guidelines.\nWithin All Star Elite Cheer, the following division combinations are permitted in the event of there only being a single team registered in either division, with event producers then being required to follow the mandatory split guidelines and no other combinations of all start elite divisions being permitted:\n* Senior Coed Level 3 and Senior Level 3\n* Senior Coed Level 4 and Senior Level 4\n* Open Coed Level 3 and Open Level 3\n* Open Coed Level 4 and Open Level 4\n* Open and corresponding University divisions (e.g. University Level 1 and Open level 1)\nWhen splitting divisions, divisions may be split by size, coed/all girlor by additional optional splits. These must be made in a specific order, depending on the division. If the first mandatory split option cannot be made without leaving a single team in a division, but the second can be made without doing so, the event producer may make the second split first at their discretion.\nWhen splitting a team by size, they following team size designations apply:\n* Levels 1 - 4, 4.2, All Star Prep:\n** X-Small - 5 - 14 athletes\n** Small - 15 - 22 athletes\n** Medium - 23 - 32 athletes\n* Youth Level 5, Junior Levels 5 - 6:\n** X-Small - 5 - 14 athletes\n** Small - 5 - 22 athletes\n** Medium - 23 - 32 athletes\n** Large - 33 - 38 athletes\nAll star dance falls under the governance of cheerleading as a cheerleading discipline per the International Cheer Union. As such, SCUK also outlines the rules and divisions for this discipline.\nWithin all SCUK divisions, the styles of pom, jazz, hip hop, lyrical/contemporary and traditional pom/cheer dance are offered. Prop and high kick may also be offered by individual event producers, with high kick being allowed to be offered at any age group as a speciality item.\n{| class=\"wikitable\"\n|+Performance Cheer/Dance Age Grid\n!Division\n!Ages\n!Gender\n!Number on Team\n!Team Size Split (where applicable)\n|-\n|Tiny\n|6 and under\n|Female/Male\n|4 or more\n|Small - 4 - 14 dancers\nLarge - 15+ dancers\n|-\n|Mini\n|9 and under\n|Female/Male\n|4 or more\n|Small - 4 - 14 dancers\nLarge - 15+ dancers\n|-\n|Youth\n|12 and under\n|Female/Male\n|4 or more\n|Small - 4 - 14 dancers\nLarge - 15+ dancers\n|-\n|Junior\n|15 and under\n|No Males\n|4 or more\n|Small - 4 - 14 dancers\nLarge - 15+ dancers\n|-\n|Junior Coed\n|15 and under\n|1+ Males\n|4 or more\n|Small - 4 - 14 dancers\nLarge - 15+ dancers\n|-\n|Senior\n|11+\nMinimum one dancer 16+\n|No Males\n|4 or more\n|Small - 4 - 14 dancers\nLarge - 15+ dancers\n|-\n|Senior Coed\n|11+\nMinimum one dancer 16+\n|1+ Males\n|4 or more\n|Small - 4 - 14 dancers\nLarge - 15+ dancers\n|-\n|International U16\n|12 – 16 years old\n|Female/Male\n|6 - 30 dancers\n|Elite - 6 - 15 dancers\nPremier - 16 - 30 dancers\n|-\n|International Open\n|16 years and older\n(Born 2008 or earlier)\n|No Males\n|6 - 30 dancers\n|Elite - 6 - 15 dancers\nPremier - 16 - 30 dancers\n|-\n|International Open Coed\n|16 years and older\n(Born 2008 or earlier)\n|1+ Males\n|6 - 30 dancers\n|Elite - 6 - 15 dancers\nPremier - 16 - 30 dancers\n|-\n|International Open All Male\n|16 years and older\n(Born 2008 or earlier)\n|No Females\n|6 - 30 dancers\n|Elite - 6 - 15 dancers\nPremier - 16 - 30 dancers\n|-\n|University\n|17+\n90% registered uni student\n10% allowed past students alumni if graduated within last 4 years\n|No Males\n|4 or more\n|Small - 4 - 14 dancers\nLarge - 15+ dancers\n|-\n|University Coed\n|17+\n90% registered uni student\n10% allowed past students alumni if graduated within last 4 years\n|1+ Males\n|4 or more\n|Small - 4 - 14 dancers\nLarge - 15+ dancers\n|-\n|Masters Dance\n|Minimum age 17\nAt least 75% of dancers required to be aged 25+\n|Female/Male\n|4 or more\n|Small - 4 - 14 dancers\nLarge - 15+ dancers\n|-\n|Dance Abilities Youth\n|8 - 12\n|Female/Male\n|Unlimited\n|Small - 4 - 14 dancers\nLarge - 15+ dancers\n|-\n|Dance Abilities Junior\n|12 - 16\n|Female/Male\n|Unlimited\n|Small - 4 - 14 dancers\nLarge - 15+ dancers\n|-\n|Dance Abilities Senior\n|12+\nMinimum of 1 athlete 17+\n|Female/Male\n|Unlimited\n|Small - 4 - 14 dancers\nLarge - 15+ dancers\n|-\n|Adaptive Abilities Hip Hop Youth\n|8 - 12\n|Female/Male\n|4 or more\n|Small - 4 - 14 dancers\nLarge - 15+ dancers\n|-\n|Adaptive Abilities Hip Hop Junior\n|12 - 16\n|Female/Male\n|4 or more\n|Small - 4 - 14 dancers\nLarge - 15+ dancers\n|-\n|Adaptive Abilities Hip Hop Senior\n|12+\nMinimum of 1 athlete aged 17+\n|Female/Male\n|4 or more\n|Small - 4 - 14 dancers\nLarge - 15+ dancers\n|}\nLikewise with the cheer divisions, the dance divisions can also be split, being split first by team size and then by gender. If there is only one team registered in any junior or senior division within the same category, the event producer must combine the all girl and coed divisions as long as a program is not forced to compete against another team from the same studio e.g. junior with junior coed.\nCrossover Rules\nAthletes are not allowed to cross over into more than 2 cheer teams and no more than 6 routines in total (inclusive of cheer, performance cheer/dance, stunt groups and solos) at any one event. However, SCUK allows individual EPs to place further restrictions upon this.\nAthletes are also not allowed to crossover between different size teams in the cheer divisions within the same age and level, regardless of the split guidelines - i.e. an athlete may not compete on a small all star elite cheer youth 1 team and a large all star elite cheer youth 1 team. However, this does not apply to performance cheer/dance, with an athlete allowed to compete on both small junior pom and large junior pom teams for example.\nCrossovers are not allowed between novice to prep, novice to all star or novice to international divisions, with an exception being an athlete crossing over between a novice/prep division and a stunt group division.\nAt Worlds bid events, an athlete is not allowed to crossover to any other team, competing on only one team only in that round.\nRoutine Time Limits\nDifferent styles/divisions have different time limits for the routines entered within them. These are as follows:\n{| class=\"wikitable\"\n|+Routine Time Limits\n!Routine Type\n!Time Limits\n|-\n|All Star Cheer\nUniversity Cheer\nSchool Cheer\nMasters Cheer\nIASF Tiny, Mini, Youth, Junior, Senior & Open\n|Maximum of 2 minutes 30s\n|-\n|IASF Global\n|30s min to 40s max - Opening cheer\n20s max - Move from cheer portion to set up for music portion\n2 minutes and 30s maximum - Music portion\n|-\n|IASF Non-Tumbling\nUniversity Non-Tumbling\n|Maximum of 2 minutes\n|-\n|Prep Cheer\n|Maximum of 2 minutes\n|-\n|Novice Cheer\n|Maximum of 1 minute 30s\n|-\n|Dance/Performance Cheer\n|Minimum 1 minute 45s\nMaximum 2 minutes 15s\n|-\n|Stunt Group\nPartner Stunt\nIndividual/Solo\n|1 minute 15s\n|}\nCompetitions\nTeams from across the United Kingdom take part in a range of various local and national level competitions throughout the year. Some competition providers offer the chance for teams to win a \"bid\" in order to qualify to attend international competitions, such as the IASF Cheerleading Worlds or Summit, held in Orlando, Florida annually.The first UK competition to offer these bids to the IASF Worlds was Future Cheer in 2005 and still does every year.\nCompetition providers within the United Kingdom include:\n* BCA Cheer and Dance (British Cheerleading Association)\n* Cheer City (Formally known as Leicester Cheer Competitions)\n* CheerSport Wales\n* Future Cheer\n* International Cheer Coalition (ICC)\n* Incredibly Cool Events (ICE)\n* Jamfest Europe/Varsity Europe\n* Legacy Cheer and Dance\n* Revolution Cheer\n* Soar Cheer and Dance\n* UK Cheerleading Association (UKCA)\nAn estimated 60 competitions per years are run by event producers, with national competitions being held at large arenas such as the O2 and NEC.\nInternational Competitions\nTeams from the United Kingdom compete at a number of international competitions annually, with the main ones being the ICU World Championships, the IASF Cheerleading World Championships and Allstar World Championships. However teams also travel to compete in other competitions internationally, such as the NCA All-Star National Championships in Dallas, Texas, and The Summit in Orlando, Florida. Recently there has been the addition of The European Summit  and the AIA Global Tournament.\nICU World Championships\nThe International Cheer Union hosts the ICU Junior World and World Cheerleading Championships annually, with the competition being recognised as the official world championships for the sport. The national governing bodies that make up SCUK field national teams to compete at this championship, with the teams historically achieving successful results.\nIn 2016, the ICU announced it would be adding a new division for physically disabled athletes to accompany its already successful Special Olympics division for intellectually disabled athletes after collaboration with disabled English athlete Rick Rodgers and his organisation, ParaCheer International. As part of this launch, Team England sent the world's first Adaptive Abilities team to perform a showcase at the ICU Worlds 2016 to launch the division. Team England went on to win the first gold medal in ParaCheer in 2017, being England's first ever world champion cheerleading team at an ICU competition.\nIn 2023, the United Kingdom was represented by national teams from England, Scotland and Wales at the ICU World Championships, winning a total of 7 medals.\n{| class=\"wikitable sortable\"\n|+2023 ICU World Championship Results - United Kingdom Teams\n(England, Scotland, Wales)\n!\n!Country\n!Team/Division\n!Place\n!\n|-\n|\n|\n|Adaptive Abilities Unified Pom\n|1st\n|\n|-\n|\n|\n|Youth Coed Median\n|1st\n|\n|-\n|\n|\n|Adaptive Abilities Unified Median\n|2nd\n|\n|-\n|\n|\n|Junior Coed Elite\n|3rd\n|\n|-\n|\n|\n|Adaptive Abilities Unified Advanced Coed\n|3rd\n|\n|-\n|\n|\n|Team Cheer Hip Hop\n|3rd\n|\n|-\n|\n|\n|Junior Hip Hop (Performance Cheer)\n|3rd\n|\n|-\n|\n|\n|Adaptive Abilities Unified Advanced Coed\n|4th\n|\n|-\n|\n|\n|Team Cheer Jazz\n|4th\n|\n|-\n|\n|\n|Junior Pom (Performance Cheer)\n|4th\n|\n|-\n|\n|\n|Youth Hip Hop (Performance Cheer)\n|4th\n|\n|-\n|\n|\n|Youth Pom\n|4th\n|\n|-\n|\n|\n|Youth Pom\n|5th\n|\n|-\n|\n|\n|Youth Pom\n|6th\n|\n|-\n|\n|\n|Coed Premier\n|7th\n|\n|-\n|\n|\n|All Girl Elite\n|8th\n|\n|-\n|\n|\n|Team Cheer Pom\n|8th\n|\n|-\n|\n|\n|All Girl Elite\n|9th\n|\n|-\n|\n|\n|Team Cheer Pom\n|9th\n|\n|-\n|\n|\n|Junior Hip Hop (Performance Cheer)\n|9th\n|\n|-\n|\n|\n|Team Cheer Hip Hop\n|9th\n|\n|-\n|\n|\n|Youth All Girl Median\n|10th\n|\n|-\n|\n|\n|All Girl Premier\n|10th\n|\n|-\n|\n|\n|Doubles Hip Hop (Performance Cheer)\n|TIE 11th\n|\n|-\n|\n|\n|Team Cheer Jazz\n|11th\n|\n|-\n|\n|\n|Doubles Pom (Performance Cheer)\n|13th\n|\n|-\n|\n|\n|Doubles Pom (Performance Cheer)\n|17th\n|\n|-\n|\n|\n|Team Cheer Pom\n|17th\n|\n|}\nNote: If a team did not advance from semi-finals to finals, results from semi-finals are listed.\n{| class=\"wikitable\"\n|+2024 ICU World Championship Results - United Kingdom Teams (England, Scotland, Wales)\n!\n!Country\n!Team/Division\n!Place\n|-\n|\n|\n|Youth All Girl Advanced\n|1st\n|-\n|\n|\n|Adaptive Abilities Unified Median\n|1st\n|-\n|\n|\n|Adaptive Abilities Unified Advance Coed\n|1st\n|-\n|\n|\n|Special Abilities Unified Freestyle Pom\n|1st\n|-\n|\n|\n|Youth Coed Advanced\n|2nd\n|-\n|\n|\n|Adaptive Abilities Unified Median\n|2nd\n|-\n|\n|\n|Team Cheer Hip Hop (Performance Cheer)\n|2nd\n|-\n|\n|\n|Junior All Girl Elite\n|3rd\n|-\n|\n|\n|Adaptive Abilities Unified Median\n|4th\n|-\n|\n|\n|Youth Hip Hop (Performance Cheer)\n|4th\n|-\n|\n|\n|Youth All Girl Median\n|5th\n|-\n|\n|\n|Youth Pom (Performance Cheer)\n|5th\n|-\n|\n|\n|Team Cheer Pom (Performance Cheer)\n|5th\n|-\n|\n|\n|Team Cheer Jazz (Performance Cheer)\n|6th\n|-\n|\n|\n|Junior Pom (Performance Cheer)\n|8th\n|-\n|\n|\n|Team Cheer Jazz (Performance Cheer)\n|8th\n|-\n|\n|\n|Coed Elite\n|10th\n|-\n|\n|\n|Team Cheer Jazz (Performance Cheer)\n|10th\n|}\nNote: If a team did not advance from semi-finals to finals, results from semi-finals are listed.\nIASF Cheerleading World Championships\nAllstar teams can compete at a national level within the United Kingdom to win bids to qualify to attend the IASF Cheerleading World Championships each year.\nThe top teams in the United Kingdom travel to compete at the IASF World Championships, with the following teams achieving the following results in 2023:\n{| class=\"wikitable\"\n!\n!Gym/Program\n!Team\n!Country\n!Score\n!Place\n!Division\n|-\n|\n|Unity Allstars\n|Black\n|\n|116.7\n|1st\n|International Open Coed Non-Tumbling 7\n|-\n|\n|Coventry Dynamite\n|Ignite\n|\n|137.9\n|2nd\n|International Open Large Coed 5\n|-\n|\n|Rising Stars\n|Midnight\n|\n|131.4\n|2nd\n|International Open Small Coed 5\n|-\n|\n|Unity Allstars\n|Blush\n|\n|111.8\n|2nd\n|International Open Non-Tumbling 7\n|-\n|\n|Unity Allstars\n|Ruby\n|\n|128.15\n|3rd\n|International Global 6\n|-\n|\n|Crimson Heat\n|White Fang\n|\n|126.65\n|3rd\n|International Open 5\n|-\n|\n|Unity Allstars\n|Royal\n|\n|132.8\n|4th\n|International U18 Small Coed 5\n|-\n|\n|Bournemouth Elite\n|Hail\n|\n|130.6\n|4th\n|International Open Large Coed 5\n|-\n|\n|SA Academy\n|Crush\n|\n|128.25\n|4th\n|International Open 6\n|-\n|\n|ICE Athletics\n|Lady Ice\n|\n|124.35\n|4th\n|International U18 5\n|-\n|\n|Coventry Dynamite\n|Bomb Squad\n|\n|110.7\n|4th\n|International Open Coed Non-Tumbling 6\n|-\n|\n|Zodiac All Stars\n|Pink\n|\n|116.85\n|5th\n|International Open 5\n|-\n|\n|Coventry Dynamite\n|Ammuniition\n|\n|122.75\n|5th\n|International Open Small Coed 6\n|-\n|\n|Vista Twisters\n|T5\n|\n|122.7\n|5th\n|International Open Small Coed 5\n|-\n|\n|Rising Stars\n|Twilight\n|\n|105.3\n|5th\n|International U18 5\n|-\n|\n|Crimson Heat\n|Empire\n|\n|113.65\n|6th\n|International U18 Small Coed 5\n|-\n|\n|ICE Athletics\n|Subzero\n|\n|110.1\n|6th\n|International Open Non-Tumbling 6\n|-\n|\n|Casablanca Cheer\n|Apollo\n|\n|92.65\n|6th\n|International Open Large Coed 6\n|-\n|\n|Oblivion All Stars\n|X\n|\n|125\n|7th\n|International Open Large Coed 5\n|-\n|\n|Gymfinity Sports Academy\n|Ladies of the Crown\n|\n|124.65\n|7th\n|International Open 6\n|-\n|\n|Unity Allstars\n|Steel\n|\n|106.5\n|7th\n|International Open Coed Non-Tumbling 6\n|-\n|\n|Crimson Heat\n|Fury\n|\n|117.25\n|9th\n|International Open 6\n|-\n|\n|East Midlands Cheerleading Academy\n|EMCA Killer Queens\n|\n|86.8\n|10th\n|International Open Non-Tumbling 6\n|-\n|\n|East Midlands Cheerleading Academy\n|EMCA C-Lebrities\n|\n|98.4\n|11th\n|International Open Small Coed 5\n|-\n|\n|Marshals Cheer\n|Major 6\n|\n|90.5\n|11th\n|International Open Coed Non-Tumbling 6\n|-\n|\n|Phoenix Stars Cheerleaders\n|PSC Gemini\n|\n|103.5\n|12th\n|International Open 5\n|-\n|\n|Evolution Athletics\n|EVO6\n|\n|90.2\n|14th\n|International Open Small Coed 6\n|}\n2024 Cheerleading World Championships Results\n{| class=\"wikitable\"\n|+\n!\n!Gym/Program\n!Team\n!Country\n!Score\n!Place\n!Division\n|-\n|\n|Unity Allstars\n|Royal\n|\n|136.8\n|1st\n|International U18 Small Coed 5\n|-\n|\n|Unity Allstars\n|Ruby\n|\n|138.3\n|1st\n|International Global 6\n|-\n|\n|Unity Allstars\n|Black\n|\n|129.8\n|1st\n|International Open Non-Tumbling Coed 7\n|-\n|\n|Unity Allstars\n|Blush\n|\n|112.3\n|2nd\n|International Open Non-Tumbling 7\n|-\n|\n|Coventry Dynamite\n|Lady Grenades\n|\n|128.9\n|3rd\n|International U18 5\n|-\n|\n|Coventry Dynamite\n|Cov Coed\n|\n|122.85\n|3rd\n|International Open Large Coed 5\n|-\n|\n|Gymfinity Sports Academy\n|Ladies of the Crown\n|WALES\n|125.25\n|3rd\n|International Open 6\n|-\n|\n|Crimson Heat\n|Empire\n|\n|126.4\n|4th\n|International U18 Small Coed 5\n|-\n|\n|Crimson Heat\n|White Fang\n|\n|127\n|4th\n|International Open 5\n|-\n|\n|Unity Allstars\n|Steel\n|\n|120.85\n|4th\n|International Open Non-Tumbling Coed\n|-\n|\n|Crimson Heat\n|Majesty\n|\n|122.6\n|5th\n|International U18 5\n|-\n|\n|Top Gun Allstars UK\n|IO5\n|\n|125.3\n|5th\n|International Open 5\n|-\n|\n|Unity Allstars\n|Volt\n|\n|119.1\n|5th\n|International Open Small Coed 5\n|-\n|\n|East Midlands Cheerleading Academy\n|Fame\n|\n|108.75\n|5th\n|International Open Small Coed 6\n|-\n|\n|Coventry Dynamite\n|Bombsquad\n|\n|118.65\n|5th\n|International Open Non-Tumbling Coed 6\n|-\n|\n|Crimson Heat\n|Fury\n|\n|122.65\n|5th\n|International Global 6\n|-\n|\n|SA Academy\n|Neon\n|\n|122.05\n|6th\n|International U18 5\n|-\n|\n|Coventry Dynamite\n|FIYA 5\n|\n|124.5\n|6th\n|International Open 5\n|-\n|\n|Electric Athletics\n|Midnight\n|\n|113.35\n|6th\n|International Open Small Coed 5\n|-\n|\n|Bournemouth Elite\n|Hail\n|\n|115.05\n|6th\n|International Open Large Coed 5\n|-\n|\n|Gymfinity Sports Academy\n|Angels\n|\n|114.35\n|7th\n|International U18 5\n|-\n|\n|Scorpions Allstars\n|Thunder\n|\n|109.8\n|7th\n|International Open Small Coed 5\n|-\n|\n|Surrey Starlets\n|Astraea\n|\n|116.25\n|7th\n|International Open 7\n|-\n|\n|East Midlands Cheerleading Academy\n|Killer Queens\n|\n|102.55\n|7th\n|International Open Non-Tumbling 7\n|-\n|\n|ICE Athletics\n|Subzero\n|\n|98.65\n|8th\n|International Open Non-Tumbling 6\n|-\n|\n|London Dynasty Cheer\n|Revolution\n|\n|109.45\n|8th\n|International Open Non-Tumbling Coed 6\n|-\n|\n|Marshals Cheer\n|Generals\n|\n|108.1\n|9th\n|International U18 Small Coed 5\n|-\n|\n|East Midlands Cheerleading Academy\n|C-Lebrities\n|\n|104.15\n|9th\n|International Open Large Coed 5\n|-\n|\n|RSD\n|Legends\n|\n|98.7\n|9th\n|International Open Small Coed 5\n|-\n|\n|Surrey Starlets\n|Allium\n|\n|93.25\n|9th\n|International Open Non-Tumbling 6\n|-\n|\n|Trailblazer Allstars\n|INNOVA7E\n|\n|88.6\n|9th\n|International Open Non-Tumbling 7\n|}\nNotable cheer programs\nOne particular cheerleading programme, the Ascension Eagles of the London Borough of Newham, has received attention and awards for its positive impact in its economically disadvantaged neighbourhood.\nIn April 2014 Crimson Heat Tigers Cheer based in Reading, won the COA (Cheerleaders of America)  National title in Florida, gaining the USA Champions title.  Crimson Heat were also official cheerleaders for the London Games, performing at both the basketball and volleyball events.\nIn 2019 Phoenix Allstars Adaptive abilities team 'Smoke' took to the floor at FC Internationals (Bournemouth) to showcase their routine and further raise the profile of Paracheer in the UK. Phoenix Allstars also provided athletes from their adaptive abilities division to the Paralympics home coming at Wembley arena in 2021.\nIn 2022 Unity Allstars Black has etched its name in the chronicle of international cheerleading history, securing the coveted gold in the Level 7 Open Non-Tumbling Coed division.\nNotable mention\nCheer From Head To Toe: Cheer From Head To Toe (CFHTT) is a prominent cheerleading platform in the United Kingdom known for its dedication to promoting and supporting the UK cheerleading community. Established as a multi-platform initiative, CFHTT offers resources, motivational content, and coverage of cheerleading events across its blog, Instagram, Youtube and Facebook channels. The organisation focuses on providing educational content, tips, and event highlights, while also building an engaged and supportive community for cheerleaders of all levels. CFHTT has been recognised as a valuable resource within the UK cheerleading scene and continues to play a key role in fostering growth and inclusivity within the sport.\nReferences\nMegan Charles,\nExternal links\n* , Sportcheer England\n* , British Cheerleading Association"
    }
  ]
}