{
  "content": [
    {
      "type": "text",
      "text": "# Chelsey Edwards\n\n| birth_place    =Lower Hutt\n| death_date     =\n| death_place    =\n| height         =166 cm\n| weight         =\n| show-medals    =\n| medaltemplates =\n|coach=Frank Tourelle, Gary Hollywood, Michael Weston}}\nChelsey Edwards (born 15 June 2001) is a New Zealand competitive swimmer who has represented New Zealand at three different world championship events and is a Commonwealth Youth Games gold medalist.\nEdwards attended Chilton Saint James School in Lower Hutt.\nSwimming Career\n2017 Commonwealth Youth Games\nAt the 2017 Commonwealth Youth Games, held in Nassau, Edwards, alongside teammates Lewis Clareburt, Zac Reid and Leticia Transom, claimed gold in the 4x200 metre freestyle relay in a time of 7:50.85 despite Edwards battling with sickness throughout the meet.\n2018 Junior Pan Pacific Championships\nEdwards raced at the 2018 Junior Pan Pacific Swimming Championships in Suva with an 8th place finish in the A final of the 50 metre freestyle in a time of 26.60, an overall 13th place finish in the 200 metre freestyle in a time of 2:03.67, and an overall 15th place finish in the 100m freestyle in a time of 57.06.\n2019 World Championships\nEdwards qualified to compete at the 2019 World Aquatics Championships held in Gwangju where she finished in 37th in a time of 26.05 in the 50m freestyle and was part of the 4x200 metre freestyle relay which finished 10th alongside Erika Fairweather, Carina Doyle and Eve Thomas.\n2022 World Championships\nAt the 2022 World Aquatics Championships held in Budapest, Edwards finished 23rd in the 50 metre freestyle in a time of 25.91. She also took part in the 4x100 metre mixed freestyle relay alongside Lewis Clareburt, Carter Swift and Laura Littlejohn which set a new national record in a time of 3:27.91 and narrowly missed out on a spot in the final.\n2023 World Championships\nRacing at her third world championships, Edwards finished 29th in the 100 metre freestyle in a time of 56.04 and was part of the 4x100 metre mixed freestyle alongside Cameron Gray, Carter Swift and Helena Gasson that finished 16th.\nReferences\nExternal links\n*"
    }
  ]
}