{
  "content": [
    {
      "type": "text",
      "text": "# Chemehuevi traditional narratives\n\nChemehuevi traditional narratives include myths, legends, tales, and oral histories preserved by the Chemehuevi people of the Mojave Desert and Colorado River of southeastern California and western Arizona.\nChemehuevi oral literature is known primarily through the writings of Carobeth Laird, based on the testimony of her Chemehuevi husband, George Laird. These narratives show their closest links with the traditional narratives of the Great Basin peoples and of the Chemehuevi's linguistic kinsmen the Southern Paiute in particular. (See also Traditional narratives (Native California).)\nSources for Chemehuevi Narratives\n* Kroeber, A. L. 1908. \"Origin Tradition of the Chemehuevi Indians\". Journal of American Folklore 21:240-242. (With a commentary.)\n* Kroeber, A. L. 1925. Handbook of the Indians of California. Bureau of American Ethnology Bulletin No. 78. Washington, D.C. (Comparisons of Chemehuevi with Mohave and Great Basin myths, p.&nbsp;598.)\n* Kroeber, A. L. 1959. \"Ethnographic Interpretations 7-11\". University of California Publications in American Archaeology and Ethnology 47:235-310. Berkeley. (Chemehuevi accounts of conflict with the Desert Mohave, pp.&nbsp;296–298.)\n* Laird, Carobeth. 1974 \"Chemehuevi Religious Beliefs and Practices\". Journal of California Anthropology 1:19-25. (Brief accounts of myths that are discussed in more detail in Laird 1976.)\n* Laird, Carobeth. 1974 \"The Buffalo in Chemehuevi Folklore\". Journal of California Anthropology 1:220-224. (Portions of two myths containing incidental references to bison.)\n* Laird, Carobeth. 1975. \"Two Chemehuevi Teaching Myths\". Journal of California Anthropology 2:18-24. (Myths containing practical information on the locations of springs, game animals and their anatomy, and hunting equipment and methods.)\n* Laird, Carobeth. 1976. The Chemehuevis. Malki Museum Press, Banning, California. (Many myths and myth fragments, plus an analytical discussion, based on material collected from George Laird between 1919 and 1940.)\n* Laird, Carobeth. 1977. \"Intimations of Unity\". Journal of California Anthropology 4:50-54. (Correspondences between the Chemehuevi Mythic Coyote cycle and the Winnebago Trickster and hare cycles.)\n* Laird, Carobeth. 1977. \"Chemehuevi Myth as Social Commentary\". Journal of California Anthropology 4:191-195. (One myth, \"Old Man Rooted to the Earth.\")\n* Laird, Carobeth. 1977. \"Behavioral Patterns in Chemehuevi Myths\". In Flowers of the Wind: Papers on Ritual, Myth and Symbolism in California and the Southwest, edited by Thomas C. Blackburn, pp.&nbsp;97–103.  Ballena Press, Socorro, New Mexico. (Synopses of several Chemehuevi myths, with comments on their implications concerning actual behavior.)\n* Laird, Carobeth. 1978. \"The Androgynous Nature of Coyote\". Journal of California Anthropology 5:67-72. (One Chemehuevi myth, \"Coyote Went to Get Basketry Material,\" with an analysis.)\n* Laird, Carobeth. 1978. \"Origin of the Horse\". Journal of California Anthropology 4:191-195.  (One Chemehuevi myth, \"Coyote's Grandson,\" including an incidental mention of the Horse, with an analysis.)\n* Laird, Carobeth. 1984. ''Mirror and Pattern: George Laird's World of Chemehuevi Mythology''. Malki Museum Press, Banning California.  (Many myths recorded in primarily in 1919–1920, including alternative versions of myths published in Laird 1976.)"
    }
  ]
}