{
  "content": [
    {
      "type": "text",
      "text": "# Chen Ping (Han dynasty)__disambig_1\n\n| image               = Chen Ping, Marquis of Quni.jpg\n| image_size          = 200px\n| caption             =\n| alt                 =\n| office              = Imperial Chancellor\n| term                = 179 BC\n| monarch             = Emperor Wen of Han\n| successor           = Zhou Bo\n| birth_date          = Unknown\n| birth_place         = Lankao County, Henan\n| death_date          =  November 179 BC\n| death_place         = Xi'an, Shaanxi\n| spouse              = Lady Zhang\n| children            = Chen Mai ()\n| occupation          = Politician\n| blank1              = Posthumous name\n| data1               = Marquis Xian ()\n| blank2              = Peerage\n| data2               = Marquis of Quni ()\n}}\nChen Ping (; died  November 179 BC), posthumously known as Marquis Xian of Quni (), was a Chinese politician who served as a chancellor during the early Han dynasty. He was a key adviser to Liu Bang (Emperor Gaozu), the founding emperor of the Han dynasty, and had played a significant role in aiding Liu Bang overcome his rival Xiang Yu during the Chu–Han Contention (206–202 BC).\nEarly life\nChen Ping was born in a peasant family in Huyou Town (), Yangwu County (), which is in present-day Lankao County, Henan. As his parents died when he was young, he was raised by his elder brother, who worked as a farmer on the 30 mu of land owned by their family. Since he was a child, he was known for being studious and for having an ambition to serve the country.\nNot long later, the townsfolk nominated Chen Ping to be their shezai (; a local leader). Chen Ping distributed meat equally to his fellow townsfolk, and they praised him for being just and fair. Chen Ping once said, \"If I can manage the world, I'll manage it in the same manner as I distribute meat, so that all the people in the world will never be poor and hungry.\"\nParticipation in the rebellion against the Qin dynasty\nIn 209 BC, when rebellions broke out throughout China against the Qin dynasty, Chen Ping joined one of the more prominent rebel groups led by Xiang Yu. After the Qin dynasty was overthrown in late 207 BC, Xiang Yu and his forces occupied Xianyang, the former Qin capital, and plundered and pillaged the city. Around this time, Chen Ping left Xiang Yu and joined another prominent rebel leader, Liu Bang, who appointed him as Lieutenant Who Protects the Nation ().\nChu–Han Contention\nFrom 206 to 202 BC, a power struggle, historically known as the Chu–Han Contention, broke out between Liu Bang and Xiang Yu, who were vying for supremacy over China. During this time, Chen Ping, as an adviser to Liu Bang, came up with numerous plans – making extensive use of espionage and sabotage – to help his lord overcome Xiang Yu.\nDuring the Battle of Xingyang in 204 BC, Chen Ping suggested to Liu Bang to disguise himself and escape from the city while it was on the verge of falling to Xiang Yu's forces. In June or July, Ji Xin, one of Liu Bang's followers, disguised himself as his lord and pretended to surrender to Xiang Yu, sacrificing his life in the process to buy time for Liu Bang to escape.\nChen Ping also played a key role in the downfall of Fan Zeng, Xiang Yu's chief adviser. He had sent spies to infiltrate Xiang Yu's forces and sow discord between Xiang Yu and Fan Zeng, causing the former to doubt the latter's loyalty and ultimately dismiss him.\nChen Ping had also advised Liu Bang to agree to make Han Xin a vassal king in order to gain Han Xin's loyalty and help him fight Xiang Yu's forces. At another point in time, he had also advised Liu Bang to form an alliance with the Kingdom of Qi against Xiang Yu.\nService under Emperor Gaozu and Empress Lü\nIn 202 BC, Liu Bang ultimately defeated Xiang Yu at the Battle of Gaixia and established the Han dynasty as the ruling dynasty in China with himself as the emperor. To reward Chen Ping for his contributions, Liu Bang enfeoffed him as the Marquis of Huyou (). Chen Ping's marquis title was later changed to Marquis of Quni (), which he held until his death.\nIn 201 BC, Liu Bang heard rumours that Han Xin was plotting a rebellion against him and secretly harbouring a fugitive Zhongli Mo (one of Xiang Yu's former lieutenants). Chen Ping suggested to the emperor to lure Han Xin into a trap under the guise of summoning him for an audience, and use the chance to capture him. Han Xin fell for the ruse and was arrested when he came to meet Liu Bang, who pardoned him but demoted him from the status of a vassal king to a marquis (Marquis of Huaiyin).\nIn 200 BC, after Liu Bang was defeated by the Xiongnu at the Battle of Baideng, Chen Ping advised the emperor to bribe the wife of the Xiongnu leader Modu Chanyu with gifts, and get her to ask her husband to lift the siege on the Han forces at Baideng.\nService under Emperor Wen\nAfter Liu Bang's death in 195 BC, Chen Ping served as Left Imperial Chancellor () during the reign of Liu Bang's son Liu Ying (Emperor Hui), and as Right Imperial Chancellor () when Emperor Hui's mother Lü Zhi and her clan controlled the Han government during a period historically known as the Lü Clan Disturbance.\nAfter Lü Zhi's death in August 180 BC, Chen Ping, along with Zhou Bo and others, combined forces to oust the Lüs from power and install Liu Heng (Emperor Wen), another of Liu Bang's sons, on the throne. On 16 December 180 BC, Chen Ping was appointed Left Imperial Chancellor alongside Zhou Bo, the Right Imperial Chancellor. This arrangement was made because Chen Ping had pointed out to Emperor Wen that Zhou Bo deserved the higher position of Right Imperial Chancellor since Zhou Bo's contributions were greater than his.\nLater that year, Emperor Wen asked Zhou Bo, \"How many cases do the courts see in a year?\" Zhou Bo was unable to give an answer. Emperor Wen then asked again, \"What is the net amount of money and grain the national treasury takes in in a year?\" Zhou Bo could not answer the question. Chen Ping then replied on Zhou Bo's behalf, \"The answers lie with the respective persons in charge. For the number of cases, Your Majesty should ask the Minister of Justice. For the net amount of money and grain, Your Majesty should ask the Accountant of Revenue.\" Chen Ping also added that he felt that as a chancellor, he should not be in charge of everything, and that the chancellor's role was to assist the emperor by \"pacifying all those outside the empire, maintaining peace within the empire and ensuring that all officeholders perform their roles well.\" Upon hearing Chen Ping's response, Zhou Bo was embarrassed and felt that he was not competent enough to serve as a chancellor, so he claimed that he was ill and resigned on 2 October 179 BC, leaving Chen Ping solely in charge of both chancellor offices.\nDeath\nChen Ping died of illness in Chang'an around November 179 BC and was given the posthumous title \"Marquis Xian\" (). He was buried at Chenyan Slope (), Kushang Village () in his hometown, Huyou Town (). His tomb, along with a shrine built for him, was destroyed in a flood during the Ming dynasty.\nFamily\nChen Ping was single for a long time until he met Zhang Fu (), a wealthy man. Zhang Fu had a granddaughter who had married five times and all her husbands had died not long after their marriage; no man wanted to marry her as she was believed to bring ill luck to whoever she married. One day, Zhang Fu visited Chen Ping and saw that although his residence was quite rundown, there were several carriages outside, meaning that Chen was popular in town since he had many visitors. After returning home, Zhang Fu was so excited when he discussed with his family about arranging a marriage between Chen Ping and that granddaughter of his. Initially, Zhang Fu's family was not agreeable to the marriage as they felt that Chen Ping was too poor. However, Zhang Fu told them that Chen Ping might be poor, but he was well-connected and popular among the people. In the end, Chen Ping married Zhang Fu's granddaughter and gradually became more affluent with his wife's support.\nChen Ping's son, Chen Mai (), inherited his father's hereditary marquis title and marquisate. During the reign of Emperor Wu ( 141–87 BC), Chen Ping's great-grandson, Chen He (), was stripped of the marquis title and executed for committing a capital offence.\nNotes\nReferences\n* Ban, Gu. Book of Han, Volume 40.\n* Sima, Guang. Zizhi Tongjian.\n* Sima, Qian. Shiji, Volume 56."
    }
  ]
}