{
  "content": [
    {
      "type": "text",
      "text": "# Cheng Lai-king\n\nCheng Lai-king (, born 1959 or 1960) is a Hong Kong politician who served as District Councillor for the Castle Road constituency, and as former chairwoman of Central and Western District Council. She is a member of the Democratic Party and a registered social worker.\nShe had held the seat since its creation in 1994 until her resignation from the District Council in July 2021. Her strongest electoral result was in 2003 when she secured 73.6% (1,625 votes), while in the 2019 elections she held the seat with 51.05% (2,669 votes).\nPolitical career\nCheng served as Bonnie Ng's campaign manager during the , in which Ng's campaign posters were suspiciously vandalised. In July 2019, Cheng criticised the government's crackdown on 12 June 2019, and asked Chief Executive Carrie Lam to resign, retract the government's classification of 12 June protest as a \"riot\", and set up an independent commission of inquiry. In August, she released a joint statement along with four other Democratic Party district councillors in the Central and Western District. The statement condemned police officers for releasing tear gas in densely populated residential districts without warning, leading to respiratory health concerns.\nCheng was elected chair of the Central and Western District Council for the 2020–23 term during the council's first meeting on 2 January 2020, with fellow Democratic Party councillor Victor Yeung elected as vice-chair.\nJanuary 2020 meeting controversy and subsequent harassment\nA Central and Western District Council meeting held on 16 January 2020, discussing issues relating to the police force, was attended by Commissioner of Police Chris Tang with a number of plainclothes police officers on standby at the venue. Cheng requested the plainclothes officers to display their warrant cards; one officer who refused to show his warrant card was evicted from the venue.\nCheng subsequently questioned Tang regarding the number of people who had been \"raped, sent to China, suicided (被自殺)\"; other pro-democracy district councillors also added questions on law enforcement tactics by police during the 2019 protests. A group of pro-government protesters at the venue, including activist , yelled slogans, and clapped after Tang spoke; many of these protesters were expelled by Cheng. Cheng later said on social media that she received an average of four to five unsolicited calls without caller ID between 16 and 17 January, though the callers did not say anything upon her responding.\nMarch 2020 arrest\nOn 26 March 2020, Hong Kong police arrested Cheng under a sedition law. She was alleged to have shared the identity of a police officer who fired a baton round that blinded a journalist during the 2019–20 Hong Kong protests.\nMembers of the Democratic Party, including lawmaker Ted Hui, went to bail Cheng out from jail.  When the police requested an unanticipated and unexplained increase in bail money by an additional $5,000 HKD, the party members raised the money in cash immediately outside the police station. Pro-Beijing politician Chan Hok-Fung later uploaded a photo of the scene onto social media, accusing Hui of bribing protesters. The accusation was denied by Sam Yip, a pro-democracy Central and Western District Council member. The Democratic Party later released a statement suggesting that the photo could only have been taken from within the police station, and alleged that the situation was orchestrated by police to slander the party.  Later reports suggested that the Democratic Party filed a complaint with the Independent Police Complaints Council.\nOn 19 October 2020, Cheng was sentenced to 28 days imprisonment, suspended for 12 months, for civil contempt of court through the sharing of the policeman's identity in contravention of a court injunction.\nReferences\nBibliography\n*[http://www.elections.gov.hk/dc2011/eng/results_central_western.html 2011 District Council Election Results (Central & Western)]\n*[https://web.archive.org/web/20110809183835/http://www.elections.gov.hk/dc2007/eng/results_central_western.html 2007 District Council Election Results (Central & Western)]\n*[https://web.archive.org/web/20050321025103/http://www.elections.gov.hk/elections/dc2003/english/result/result_cw.html 2003 District Council Election Results (Central & Western)]\n*[https://web.archive.org/web/20050905025841/http://www.elections.gov.hk/elections/dcelect99/eng/c21_eg.htm 1999 District Council Election Results (Central & Western)]"
    }
  ]
}