{
  "content": [
    {
      "type": "text",
      "text": "# Chen Lin (Ming dynasty)\n\n| birth_date = 1543\n| birth_place = Shaoguan, Guangdong, China\n| death_date =\n| death_place =\n| allegiance = Ming dynasty\n| battles       = Japanese invasions of Korea (1592–98)\n| commands =\n| rank =  Navy Admiral\n}}\nChen Lin (; Korean: 진린 Jin Lin; 1543–1607), courtesy name Chaojue (), born in Shaoguan, Guangdong, was a Chinese general and navy admiral of the Ming dynasty.\nChen quelled local uprisings in Guangdong and Guizhou. As commander in chief in the Battle of Noryang, he also led the Ming navy to win the Imjin War alongside Joseon Korea and defeat the Japanese army led by Toyotomi Hideyoshi. He then became the founder of the Gwangdong Jin clan, one of the Korean Jin clans when he immigrated to Korea after the war due to his respect for Yi Sun-shin.\nChen Lin is considered a hero in both Korea and China for helping win the Imjin War with Korea and defeating the Japanese army alongside Korean forces. Today, his descendants are spread across South China and Korea.\nCareer\nChen Lin was a native of Wengyuan County, Shaoguan, Guangdong province.\nGuangdong\nHe quelled the 1562 uprisings in Chaozhou and Yingde in Guangdong and was subsequently promoted to the Shoubei of Guangdong. Chen participated in various campaigns in Southern China against rebels and peasant uprisings thereafter. In May of the 40th year of the Wanli Emperor, the Ming court awarded Chen as tutor to the crown prince (太子太保) and allowed it to be hereditary. In the 46th year of Wanli, Chen enfeoffed his son Chen Jiuxiang (陈九相) with the title and inheritance.\nKorea and Japan\nChen Lin was dispatched in 1598 to help repulse the Japanese in Hideyoshi's Invasions of Korea, working with the Korean admiral Yi Sun-sin. The aid was in response to a request by the Joseon Dynasty. Chen and Yi both fought in the Battle of Noryang, which ended Hideyoshi's attempts to invade Korea. See details in Imjin War section below.\nGuizhou and Miao\nAfter campaigning in Korea, Chen was promoted and gained control of troops in Hunan and Guangdong. He led troops to quell the Miao (Hmong) uprising in Zunyi, Guizhou province. He also helped quell the Bozhou rebellion.\nImjin War\nIn June 1592 (20th year), in order to fight against the Japanese invasion into Chosun, Chen Lin became Heavenly General of the 7th Battalion (신기칠영연용참장，神機七營練勇參將). October that year, he was appointed as Shenshuyou Deputy General (신추우부장、神樞右副將).\nIn 1593 (21st year), he became Deputy commander-in-chief of anti-Japanese pirates in Jilin, Liaoning, Baoding, Shandong and other places (薊遼保定山東等處防海倭副總兵) and deputy commander-in-chief of the General Military Department of Langshouji Town (恊守薊鎮副總兵署都督僉事).\nWhen the Japanese army stepped down a little bit, the Japanese government was fed up with the war, and on June 17 of that year, Chen was transferred from the Japanese Military Police Department to the Minister of Cooperative Federation (保定山東等處防海禦倭副總兵署都督僉事).\nOn September 9, 1597 (the 25th year of Wanli's reign), he was appointed as a vice-president and ordered to lead 5,000 soldiers from Guangdong Province to save Joseon.\nOn October 17 of the same year, Chen was officially appointed as a provincial governor (署都督僉事) because of his contribution to the suppression of the Gwangseo (廣西) Jamgye (岑溪) immigrants.\nOn February 23, 1598 (the 26th year of Wanli's reign), Chen Lin became the Deputy Governor-General of Japan (禦倭總兵官), authorized and appointed by the secretariat (of the central Ming government).\nIn 1597, King Seonjo's 30th year of King Seonjo's reign, Chen joined Joseon with 5,000 sailors and established a co-naval force with Yi Sun-sin. Yi greatly admired Chen's leadership and skill in combat. During the naval battle, Admiral Yi died, and Chen alongside the other Koreans helped finish off the Japanese. Chen and the Ming used guns to help win the battles and defend Korea. Chen later reported the battle and Yi's death to the Wanli Emperor. He was awarded eight trophies for his prowess in battle. After the war, Koreans and the Ming gave Chen the title Count Guangdong (廣東伯 Guangdong Bo).\nBattle of Noryang\nDuring the battle, Chen Lin and Yi Sun-sin were friends and allies who helped and rescued each other several times. When Chen Lin called for Admiral Yi to thank him for coming to his aid, he was met by Yi Wan, who announced that his uncle was dead. It is said that Chen himself was so shocked that he fell to the ground three times, beating his chest and crying. News of Admiral Yi's death spread quickly throughout the allied fleet and both Joseon and Ming sailors and fighting men wailed in grief. Chen Lin later reported the news of Yi's death to Wanli Emperor, where he bestowed gifts and eulogies on Chen and Yi. Since then, Yi and Chen were memorialized as national heroes in Korea. Chen's descendants were later welcomed back to Korea to start the Gwangdong Jin clan, because of Chen Lin's contributions in defeating the Japanese and his camaraderie with Yi Sunsin.\nAdmiral Yi's body was brought back to his hometown in Asan to be buried next to his father, Yi Jeong (in accordance to Korean tradition). Shrines, both official and unofficial, were constructed in his honor all throughout the land.\"\nDescendants\nChen died of natural causes. Today, his descendants are spread across Guangdong, Guangxi, and Sichuan provinces, as well as Korea.\nKorean descendants\nChen Lin is the founder of one of the Korean clans, Gwangdong Jin clan, and one of his grandsons, Chen Yongsu (陳泳素), settled in Korea. In 1644, at the end of the Ming and start of the Qing dynasty, Chen Yongsu moved to Joseon Korea, where the Korean people warmly welcomed and celebrated him as a hero's descendant. Chen settled in South Jeolla Province. Today the Gwangdong Jin clan has over 300 households and more than 1200–2000 people. Some members traveled to China to celebrate the victory of Chen Lin alongside the Koreans in the Korea-Japan war.\nThe descendants of Chen in Korea knew their home country was China, but they did not know where exactly in China, until recent research.\nCultural portrayals\nMovies and dramas\n* Imjin War (《임진왜란》), MBC, 1985 ~ 1986, actor: Gug Jeong-Hwan (국정환)\n* Immortal Admiral Yi Sun-sin, KBS, 2004 ~ 2005, actor: Kim Ha-Kyun (김하균)\n* Jingbirok (《징비록》), KBS, 2015, actor: Bae Do-hwan (배도환)\n* Imjin War 1592 (임진왜란 1592), KBS, 2016, actor: Cho Hang-Hweon (조항훤)\nSee also\n* Battle of Noryang\n* Imjin war\n* Gwangdong Jin clan\nReferences\nExternal links\n* [https://zh.wikisource.org/zh-hant/%E6%98%8E%E5%8F%B2/%E5%8D%B7247 明史/卷247]"
    }
  ]
}