{
  "content": [
    {
      "type": "text",
      "text": "# Cheongpung Cultural Heritage Complex\n\nCheongpung Cultural Heritage Complex () is a reconstruction of a former village Cheongpung in Jecheon, North Chungcheong Province, South Korea. The original village was submerged after the construction of Chungju Dam on a ridge above Chungju Lake.\nA recreation of a Korean folk village by SBS for several television series called Jecheon Village is also co-located on the complex site.\nReconstruction\nThis complex is a reconstruction of the village of Cheongpung that became submerged with the completion of Chungju Dam in 1985. Starting in 1980 the area was surveyed to document the cultural relics. In 1981 and 1982 48 sites (5 Buddhist-related, 10 historical and 33 archeological) were excavated. By the end of 1983 many of the original and unique buildings that included five of the ancient office buildings, Handeok-ru Pavilion, Cheongpung Hanggyo Confucian school and four traditional houses were relocated to the complex site. Additionally, several Buddhist images and stone monuments were excavated and relocated to the complex. Great care was given during the relocation to restore these properties to their original configurations and orientations. It took three years to relocate the structures at the current site at a cost of over 1.6 trillion won. The Cheongpung Cultural Properties Complex occupies 85,000-pyeong/280,993-sq meters/0.97648 sq miles.\nHistory\nPrehistoric age\nDuring the Prehistoric Age, fertile lands and scenic landscapes attracted many tribal communities to develop along the basin of the Namhan River.\nThree Kingdoms period\nDuring the Three Kingdoms period (57 BCE - 668 CE), Cheongpung, and the upstream area of the Namhan River in particular, was a major ancient community under control of the Silla dynasty. The area became hotly contested between the Goguryeo and Silla dynasties.\nGoryeo period\nDuring the Goryeo period (918–1392), Cheongpung became the seat of the local magistrate's office and was administrated under Chungju County.\nJoseon period\nDuring the Joseon period (1392–1910), Cheongpung because of its strategic location for Namhan River transportation remained a major local office location.\nStructures\nGumnam-nu\nGumnam-nu (pavilion) is a gate tower built in 1825 by magistrate Jo Gil-won during the reign of King Sunjo during the Joseon period. In 1870 the pavilion was renovated by magistrate Yi Jik-hyeon. Gumnam-nu is constructed with three bays in the front and two bays on the side elevations.\nThe structure has two stories with a half-gabled, half-hipped roof. The pavilion was made using a double wing-like bracket structure. Wooden tiles are arranged in a well pattern on the ground floor and its rimmed with a patterned handrail. The original builder Jo Gil-won did the calligraphy on its signboard.\nDesignated North Chungcheong Province Tangible Cultural Property #20\nGeumbyeong-heon\nGeumbyeong-heon (hall) was built by magistrate Do-il in 1681 during the reign of King Sukjong of the Joseon period. Geumbyeong-heon was originally called Myeong-wolcheong. In 1726 another magistrate, Bak Pilmun, relocated and renamed the hall Geumbyeong-heon.\nGeumbyeong-heon has a wooden floor with an area of 132 sq meters/157.8 sq yards. The hall has six bays in the front and three on the sides with a half-gabled and half-hipped roof. Gwon Don-in did the calligraphy on the signboard.\nDesignated North Chungcheong Province Tangible Cultural Property #34\nParyeong-nu\nParyeong-nu (pavilion) was built as a wall-fortress gate but the actual construction date is not known. Paryeong-nu was the gateway to the Cheongpung magistrate's office. Magistrate Yi Jikhyeon rebuilt the pavilion in 1870. Paryeong-nu was erected on a high point incorporating an arched passage constructed out of stacked rocks.\nAccess to the pavilion is through a stone stairway built on the north side. In 1983 the pavilion was relocated to the Cultural Properties Complex from Eup-ri, Cheongpung-myeon. The hanging board describes a poem the \"eight great scenic places\" of Cheongpung authored by King Gojong period's magistrate Min Ji-sang.\nDesignated North Chungcheong Province Tangible Cultural Property #35.\nHwangseok-ri House\nHwangseok-ri House has a layout that was typical of commoners' houses found in this province. Only the L-shaped structure remains but, as was typical of commoners' houses of the era, it most likely included a detached master's quarters to the front of the inner court.\nThe room behind the women's room, the central room, and the area for housing ancestral tablets in the corner of the central room, are rather unusual features of this house.\nThe roof is hipped and gabled over the house except for the gabled roof over the kitchen.\nDesignated North Chungcheong Province Tangible Cultural Property #85.\nEungcheong-gak\nEungcheong-gak (pavilion) is a two-story structure that originally stood beside Hanbyeong-nu (pavilion), the chief governor of Cheongpung-hyeon's guest house.\nThe back part of the first floor is about twice size of the front part.\nA wooden stairs leads up to the second floor. The second story has wood tile flooring with a wooden railing surrounding the second story.\nDesignated North Chungcheong Province Tangible Cultural Property #90.\nHanbyeong-nu\nHanbyeong-nu (pavilion) was built in 1317 (during the reign of King Chungsuk of Goryeo) after this area of Cheongpung was elevated from the state of township to county. It was built as an auxiliary structure to the magistrate's office.\nHanbyeong-nu has four bays in the front and three bays on the sides, with a two-story, half-hipped roof. The main pavilion was built using a double-wing-like bracket style with double rafters featuring tilted eaves.\nA corridor leads down the hall to the west in a single-wing-like bracket style using single rafters.\nDesignated Treasure #528.\nGallery\nFile:Korea-Jecheon-Cheongpung Cultural Properties Center Husan-ri House 3296-07.JPG|Husan-ri House, a farmhouse typical of commoners' houses of Korea's provinces.\nFile:Korea-Jecheon-Cheongpung Cultural Properties Center Jigok-ri House 3257-07.JPG|Jigok-ri House construction's consists of three separate houses. Designated North Chungcheong Province Tangible Cultural Property #89.\nFile:Korea-Jecheon-Cheongpung Cultural Properties Center Dohwa-ri House 3248-07.JPG|Dohwa-ri House is a wooden construction residence built in Dohwa-ri in late years of the Joseon dynasty. Designated North Chungcheong Province Tangible Cultural Property #83.\nFile:Korea-Jecheon-Cheongpung Cultural Properties Center 3249-07 Dohwa-ri House.JPG|Press for removing the water in the process making dubu (tofu) from soybeans.\nSBS Jecheon village\nSBS Jecheon village, co-located on the site of the Cheongpung Cultural Properties Complex - , recreates a historical Korean folk village used in the SBS produced TV mini-series \"Daemang\" (2002) and \"Jang Gilsan\" (2004). Several other historical SBS TV productions were filmed on this set as well.\nSBS setting Gallery\nFile:Korea-Jecheon-SBS Jecheon setting 3358-07.JPG|SBS Jecheon setting at the Cheongpung Cultural Properties Complex\nFile:Korea-Jecheon-SBS Jecheon setting 3359-07.JPG|SBS Jecheon setting at the Cheongpung Cultural Properties Complex\nFile:Korea-Jecheon-SBS Jecheon setting 3372-07.JPG|SBS Jecheon setting at the Cheongpung Cultural Properties Complex\nFile:Korea-Jecheon-SBS Jecheon setting 3370-07.JPG|SBS Jecheon setting at the Cheongpung Cultural Properties Complex\nReferences"
    }
  ]
}