{
  "content": [
    {
      "type": "text",
      "text": "# Chess King (film)\n\n| music          =\n| cinematography =\n| editing        =\n| producer       =\n| released       =\n| country        = China\n| language       = Mandarin\n}}\nChess King (, \"Qi wang\") is a 1988 Chinese drama film  written and directed by Teng Wenji, based on Ah Cheng's novel of the same name.\nThe film was entered into the main competition at the 45th edition of the Venice Film Festival. Yuan Xie won the award for best actor at the 1989 Golden Rooster Awards for his performance in the film.\nPlot\nThe story takes place in China during the Down to the Countryside Movement of the late 1960s and early 1970s. The unnamed narrator and the chess master Wang Yisheng are two young intellectuals among many who are sent to a remote farm in the mountains to work. During the train ride to the mountains, Wang Yisheng and his friend talk about how he learned to play Chinese chess, and how he evolved his current strategy. Wang Yisheng tells his friend that his family was very poor, and his mother did not want him to be such a chess maniac, since chess could not earn money. However, Wang Yisheng was very devoted to chess. One day, while gathering garbage to sell, Wang Yisheng meets an old man who is a chess master. Using the principles of Daoism, the old man teaches Wang everything he knows about chess. Wang Yisheng also tells his friend about how his mother always disapproved of his chess habit, but before she died, she painstakingly made him a chess set out of discarded toothbrush handles, because she knew how much he loved chess. The two friends then debark the train and head their separate ways to different farms in the countryside.\nA couple months later, Wang Yisheng takes a vacation and visits his friend in the mountains. One of the narrator's friends at the farm, Legballs, happens to be a good chess player. Legballs is very impressed with Wang's ability, and the two become good friends.\nAfter a while of working at the farm, there is a local festival with a chess tournament. The narrator, Legballs, and their friends all take a vacation to attend the festival. Wang Yisheng arrives too late to enter the official chess tournament, but he challenges the winners to an unofficial match after the tournament is over. Word spreads of his challenge, and many people decide to challenge him. He ends up playing 9 people at once without any chess boards in front of him (effectively playing blind), and he beats most of them easily. The final match ends in a draw, with Wang Yisheng playing against an old man who is too fragile to leave the house, and has to send his chess moves via a messenger. Wang Yisheng bursts into tears after the match, lamenting his dead mother. The old man leaves his house to praise him personally.\nCast\n*Yuan Xie as Wang Yisheng\n*Liang Zhao as Tiehan\n*Li Hiu as \"The Nail\"\n*Ben Niuas The Secretary\n*Dahong Ni\n*Cui Zhi\nReferences\nExternal links\n*"
    }
  ]
}