{
  "content": [
    {
      "type": "text",
      "text": "# Chevron Renaissance\n\n| address = Surfers Paradise Boulevard, Surfers Paradise, Queensland\n| owner = 713 individually owned residential lots\n}}\nChevron Renaissance is a $400 million development on the Gold Coast, Queensland, Australia comprising 713 individually owned residential lots located above the Chevron Renaissance Shopping Centre. The onsite management of Chevron Renaissance residential lots is managed by Accor under the brand name of Mantra Towers of Chevron, previously The Towers of Chevron Renaissance.\nChevron Renaissance is on the site of the old Chevron Hotel in Surfers Paradise.\nThe Chevron Renaissance commercial development occupies the block of land extending from the Gold Coast Highway in the east to Ferny Avenue in the west and from Circle on Cavill in the south halfway towards Cavill Avenue and Elkhorn Avenue in the north. Construction of the complex commenced in November 1999, was completed in December 2004 and opened in March 2005 by Queensland Premier Peter Beattie.\nHistory\nThe first part of the Chevron was a temporary public bar that opened in June 1957. In August 1957 the upstairs Skyline Cabaret opened – a spacious indoor beer garden where liquor, meals and coffee were available with entertainment and dancing.\nIn June 1958 the first accommodation wing opened at the new Chevron Hotel. This was followed in September by a second wing. In September 1960, work began on the construction of the Chevron Hotel’s Main Block, which included a 24–lane bowling alley underneath and a large, modern convention centre – the Corroboree Room. The Chevron was then as modern as any hotel in Australia and closer to international standards than any resort hotel in the nation.\nIn 1987 most of the Chevron was demolished, leaving Surfers Paradise with a two-hectare hole in the middle of town for more than a decade due to the recession and lack of interest from property developers. In October 1999 Raptis Group unveiled plans for the $400 million Chevron Renaissance development and announced work would begin immediately.\nDevelopment\nThe Chevron Renaissance development construction began with the driving of piles to a depth of approximately 45 m, plus an additional 10 m into the bedrock in places, to create the foundation for three towers.\nThe development was carried out at an average of 4.5 apartments a week over three years. The triple Towers of Chevron Renaissance used approximately 55,000 of concrete and more than 10,000 tonnes of steel reinforcement during the construction . It was a massive project including five acres of retail, commercial and dining space, three residential towers and two acres of garden podium and lagoon on the roof.\nMantra Towers of Chevron\nThe three towers in the Chevron Renaissance are:\n# Skyline Tower - Tower 1 (39 levels)\n# Skyline North - Tower 2 (48 levels)\n# Skyline Central - Tower 3 (39 levels)\nDevelopment and construction\nThe Towers were constructed on the site of the old Chevron Hotel, which ceased trading in the mid-1980s and was demolished in 1987. The site remained empty until it was purchased and redeveloped in the late 1990s by the Raptis Group.\nConstruction of the Towers of Chevron Renaissance commenced in September 2001 and was completed in December 2004. They were named Skyline, Skyline North and Skyline Central in honour of the Skyline Bar, which was opened in 1957 as part of the Chevron Hotel.\nThe first Tower of the Chevron Renaissance project, Skyline, was completed in January 2003. The second, Skyline North, was completed in May 2004. The third Tower, Skyline Central, was completed in October 2004.\nIn 2002 property management company S8 Ltd purchased the management rights to the first Tower of the Chevron Renaissance project, Skyline.\nIn 2006, hotel group Accor took over management rights to all three towers from S8.\nIn 2015, property management company Mantra Group purchased the management rights to Towers of Chevron Renaissance, and renamed them the Mantra Towers of Chevron Surfers Paradise.\nKey features\nThe complex occupies a block which stretches from Gold Coast Highway in the east, west to Ferny Avenue; from the Circle on Cavill buildings to the south; half way towards Cavill Avenue; and north to Elkhorn Avenue.\nSkyline is 38 storeys high, Skyline North is 50 storeys and Skyline Central is 40 storeys high.\nThe three towers include 711 apartments and wide range of guest facilities including a fifth floor swimming pool and garden, a number of indoor and outdoor lap pools, gymnasium facilities, a private movie theatre and club lounge.\nThe 39th floor Penthouse set a new Gold Coast apartment price record when it sold for AUD$9.5 million in early 2018.\nGallery\nImage:The Towers of Chevron Renaissance (Skyline Central Lobby Entrance).jpg|The Towers of Chevron Renaissance (Skyline Central Lobby Entrance)\nImage:The Towers of Chevron Renaissance (Skyline Central Lobby Hall).jpg|The Towers of Chevron Renaissance (Skyline Central Lobby Hall)\nImage:The Towers of Chevron Renaissance (Skyline Central Lobby Lounge Area).jpg|The Towers of Chevron Renaissance (Skyline Central Lobby Lounge Area)\nImage:The Towers of Chevron Renaissance (Skyline Central Lobby Reception).jpg|The Towers of Chevron Renaissance (Skyline Central Lobby Reception)\nImage:The Towers of Chevron Renaissance (Roof Top Podium).jpg|The Towers of Chevron Renaissance (Roof Top Podium)\nImage:The Towers of Chevron (Surgers Paradise beach is at a short distance).jpg|The Towers of Chevron Renaissance located in a short distance from Surfers Paradise beach\nImage:Towers of Chevron Renaissance in the GC HWY.jpg|The Towers of Chevron Renaissance in the Gold Coast Highway\nImage:Chevron Renaissance Retail Shopps in GC HWY.jpg|The Towers of Chevron Renaissance Retail Shops\nChevron Renaissance Shopping Centre\nThe Chevron Renaissance complex includes the 13,127 square metre Chevron Renaissance Shopping Centre. The centre was opened in 2000 and redeveloped in 2014, and includes a Coles supermarket, two Liquorlands and approximately 60 specialty tenants.\nHistory of shopping centre\nThe current site once accommodated the Chevron Hotel, which was a Gold Coast landmark. The new development was named Chevron Renaissance, as it is widely considered to be a catalyst in the revitalising of the Surfers Paradise tourist district and was completed in October 2000. The original hotel housed the Skyline Lounge (opened August, 1957), which was a popular landmark bar and nightclub where many local and international acts would perform. The lounge was the launching pad for many great Australian performers such as Johnny O'Keefe, Ricky May and Colleen Hewett.\nIn 2014, the Chevron Renaissance Shopping Centre underwent a $5 million upgrade. This included the creation of 'Chevron Lane'; a Melbourne-style laneway filled with eclectic street food operators such as Viet Baguettes and Harmoni-T. The laneway features exposed brickwork, corrugated roller doors, street art and festoon lighting. An open air piazza was also upgraded to include a shade sail structure, rustic wood features, garden beds and a water fountain was transformed into a food and beverage area.\nIn 2015 the Chevron Renaissance Shopping Centre was purchased by Precision Group for $74 million from Morgan Stanley's Arena Investment Management in a deal backed by the Bank of China.\nGallery\nFile:Chevron Renaissance Shopping Centre (4).jpg|Exterior of Chevron Renaissance\nFile:Chevron Renaissance Shopping Centre (3).jpg|Another exterior view of Chevron Renaissance\nFile:Chevron Renaissance Shopping Centre.jpg|Interior of Chevron Renaissance\nFile:Chevron Renaissance Shopping Centre.(2).jpg|Coles Supermarkets store in Chevron Renaissance\nRecognition\nRaptis Group received several awards for the Chevron Renaissance project:\n* 2006 UDIA National Award for Excellence for High Density Housing;\n* 2005 QMBA State Housing & Construction Awards for Residential Buildings (high-rise over 3 storeys) over $10M;\n* 2005 QMBA Gold Coast Housing & Construction Awards for Outdoor Living & Landscaping, Excellence in Workplace Health & Safety, Residential Buildings (high-rise over 3 storeys) over $50M and Low-rise Multi Residential House;\n* 2005 UDIA Qld Awards for Excellence for Multi Level Development;\n* 2003 QMBA State Housing & Construction Awards for Project of the Year 2003 and Multi Level Residential Buildings over $10M;\n* 2003 QMBA Gold Coast Housing & Construction Awards for Regional Project of the Year and Multi Level Residential Building over $20M;\n* 2001 Gold Coast City Council (GCCC) Urban Design Awards for Built Projects Category;\n* 2001 UDIA (Qld) Awards for Excellence for Retail Category.\nReferences\nExternal links\n*[http://www.chevronrenaissancecentre.com Chevron Renaissance Shopping Centre]\n*[https://www.mantra.com.au/queensland/gold-coast/surfers-paradise/accommodation/resorts/mantra-towers-of-chevron/ Mantra Towers of Surfers Paradise]\n*[http://www.mantra.com.au/queensland/gold-coast/surfers-paradise/accommodation/resorts/mantra-towers-of-chevron/ Mantra Towers of Chevron]\n*[http://www.chevrontowers.com.au The Towers of Chevron Renaissance]\n*[http://www.chevronrenaissanceshoppingcentre.com.au/ Chevron Renaissance Shopping Centre]\n*[http://www.chevrontowers.com.au The Towers of Chevron Renaissance]"
    }
  ]
}