{
  "content": [
    {
      "type": "text",
      "text": "# Chiang-Gui War\n\nNationalist government\n*Hunan Army\n*Northwest Army\n*Guangdong Army\n|commander1   = Li ZongrenBai ChongxiHuang ShaohongHu ZongxiTao Wei\n| commander2   = Chiang Kai-shekChen JitangTang ShengzhiLiu ZhiZhang FakuiHan Fuju\n| strength1    = 200,000\n| strength2    = 400,000\n}}\nThe Chiang-Gui War () was a military conflict between the Nationalist government of Chiang Kai-shek against the warlord army of the New Guangxi clique that lasted from March until June 1929. A later conflict, the 2nd Chiang Gui-War, occurred between the two opposing factions in November and December of the same year.\nBackground\nIn late 1927, the nationalist governments of Wuhan and Nanjing were at odds. The Guangxi clique, led by Li Zongren, managed to become one of the main cliques loyal to the Nanjing National Government. The success of Chiang Kai-shek's Nanjing regime against its rival Wuhan government, chaired by Wang Jingwei, and the failure of the Xuzhou campaign meant that He Yingqin and other important generals were on Chiang's side. In addition to politics, the pro-Chiang military also defeated the leader of the Wuhan government-loyal military, Tang Shengzhi, in the Wuhan-Nanjing War. During this internal war, the Guangxi clique (loyal to the Nanjing government) played a decisive role in defeating the troops of Tang, loyal to Wang. At the same time, many of these troops were absorbed by the Guangxi clique, which expanded its military power and established itself as the most powerful military clique in Southern China. Li Zongren's power increased greatly increased and he began to challenge Chiang Kai-shek's leadership as the Kuomintang strongman. However, on November 17 of that same year, he had an attempted coup against Chiang Kai-shek jointly orchestrated by Zhang Fakui and Huang Qixiang, two of Chiang's trusted military personnel up to that time, who were trying to overthrow the government of Nanjing and reestablishing a new national government in Guangzhou. Following this incident, Li's plans to exclude his opponents were thwarted, but his clique still managed to expand his influence and control the southern region during the Northern Expedition.\nIn 1928, the KMT warlords launch the second phase of the Northern Expedition, Chiang, Li Zongren (Guangxi), Yan Xishan (Shanxi), Feng Yuxiang (Guominjun) and other warlords minors total a force of 400,000 men. The KMT defeated the troops of the Fengtian clique and advanced unstoppably towards Northern China. Zhang Zuolin returned to Northeast China where he began a series of processes to reach peace with the KMT's expeditionary forces, which irritated his Japanese allies who saw Zhang as a traitor and killed him in an attack. The death of his father at the hands of the Japanese meant that young Zhang Xueliang replaced him as commander-in-chief of the Fengtian clique. Despite death threats from the Japanese and pressure not to make a deal with the KMT, Zhang made a deal with Chiang and recognized Nanjing as the only government in China. The Fengtian clique was integrated into the National Revolutionary Army and was re-founded as the Northeastern Army. This marked the end of the Northern Expedition. Zhang would continue to rule northeast China (the historical region of Manchuria), but at the same time he would recognize the Nanjing national government as China's highest authority.\nBy the time the Northern Expedition ended, the Guangxi clique was extremely powerful and had expanded into Hebei. Once the Nanjing National Government unified the country, the four main factions each had hundreds of thousands of troops occupying various provinces captured during the Northern Expedition. Under Chiang Kai-shek's leadership, the Nanjing regime held a \"reconciliation conference\" with the intention of disarming the allied cliques and strengthening power around a single government.\nAt the time, the Guangxi clique was supported by Li Jishen, chairman of the Guangdong Political Branch, and his forces controlled the Guangxi, Hunan, Hubei provinces and the Shanhai Pass, which connects Hubei to Tianjin. The Guangxi clique controls the NRA Fourth Army, having at its disposal 16 military divisions and six independent units and has more than 200,000 soldiers. Li Zongren, leader of the Guangxi clique, served as Commander-in-Chief of the Fourth Army and as Chairman of the Wuhan Political Branch following the power vacuum left in the province following the fall of the Wang Jingwei parallel government. In addition to this, Li Jishen controlled Guangdong at the time and was a trusted political ally of the Guangxi for a long time. On the other hand, the Chiang Kai-shek First Army has more than 500,000 soldiers and controls the lands of Jiangnan. Furthermore, Chiang Kai-shek is officially the President of China, which gives him a very obvious political advantage. There were also Yan Xishan, leader of the Shanxi clique and commander-in-chief of the Third Army, who controls Shanxi province, northern Hebei province, and the cities of Beijing and Tianjin, having at their disposal a greater number of 200,000 soldiers. And Feng Yuxiang, leader of the Guominjun and commander-in-chief of the Second Army, and who also controls a good part of the north-west of the country, Henan and other places, with a force of 400,000 troops.\nOn January 1, 1929, the National Military Commission was established. At the beginning of the 1929 conference, the four main factions hoped that the army would rule less and send no more rulings to pursue the greatest military and political interests. Although the subsequent result was a break in the meeting, the resolutions of the different factions should be reorganized as divisions as soon as possible, the total strength of the four factions should remain within 600,000, the central government assigned 200,000 quotas and the other factions were hold at around 100,000. The conflict between the various factions in the subsequent Conference led to the escalation of contradictions, but after the meeting, the factions began to reorganize the troops in accordance with the meeting's resolutions.\nThe Hunan Incident\nIn early 1928, the Guangxi clique controlled the post-Hunan national government for control purposes, under house arrest held by Hunan Cheng Qian, the appointment of He Jian, Lu Diping, who chaired the Hunan government. But Lu and He were extremely warmongering and had different interests. In February 1929, Lu Diping secretly voted for Chiang Kai-shek. Chiang and the Wuhan political branch supplied large quantities of ammunition and weaponry to Lu's private army troops. As chairman of the Wuhan political branch, this was immediately brought to Li Zongren's notice. On February 21, the new generals of Guangxi, Xia Wei, Hu Zongxi, Ye Qi and others became extremely nervous at the situation. Neither of them obtained Li Zongren's consent, nor did they argue with their lieutenant Bai Chongzhen, but rather rushed to inform the central government of Nanjing on behalf of the Wuhan provincial government. He announced the removal of the Hunan Lu Diping Provincial Government President and his duties. On the same day, Xia Wei and Ye Qi led the ministry to Changsha and disarmed Lu Diping. Lu Diping, president of the Hunan provincial government, was deported.\nLi Zongren sought to maintain relations with the National Government, and his family also lived in Nanjing. After hearing the news, Li Zongren quickly fled Nanjing to avoid the Shanghai public concession and because he was extremely concerned for his own safety. In the name of the \"violation of the Central Political Conference resolution, local political branches cannot arbitrarily appoint and designate specific personnel in the jurisdiction.\" Chiang Kai-shek mobilizes his troops preparing to attack the Guangxi clique.\nIn March, Li Jishen, chairman of the Guangdong political branch, traveled to northern Nanjing to mediate the conflict between Chiang and the Guangxi clique, however upon arrival he was arrested by Chiang Kai-shek and charged with treason for intervening in this issue. Cantonese Generals Chen Jizhen and Chen Mingshu decided to support Chiang Kai-shek. The Guangdong-Guizhou political alliance was dismantled. On March 21, the Nanjing regime issued a statement expelling Li Zongren, Bai Chongxi, Li Jishen and their allies from the KMT, accused of treason. Chiang Kai-shek prepares to use invading the territories controlled by the Guangxi clique if it does not give up, dissolves and Li and Bai turn themselves in to the authorities. Feng Yuxiang and Yan Xishan observed the situation and denounced Chiang Kai-shek. The Guangxi clique is in a disadvantageous position.\nConflict\nAfter the conflict between Chiang and Li, troops loyal to the Guangxi clique stationed in Hebei were commanded by Bai Chongxi. Originally it was thought that Bai Chongxi would advance to Baoding, and take the Jinpu road south to Xuzhou, and Nanjing would be attacked from Hubei in an offensive intended to overthrow Chiang Kai-shek, but his ministry was mainly the part ancient Tang Shengzhi. Chiang allowed Tang Shengzhi to return to China from his Japan and sent him to Tangshan, Hebei Province, to command two divisions of the former department, which was compiled by Bai Chongxi. Tang Shengzhi's influence in the ancient department caused Bai Chongxi to lose control of the army. Fortunately, Liao Lei, commander of the 36th National Army of the National Revolutionary Army, informed him that Bai had surrendered and fled Hebei by boat. The 13th Army officer of the National Revolutionary Army, which was made up of soldiers loyal to Guangxi, had to resign to the south, and the rest were compiled by Li Pinxian, a former comrade from Tang Shengzhi.The war has not yet officially broken out but the influence of the Guangxi clique on Hebei had subsided. Bai Chongxi intended to flee and take refuge in Hong Kong. Chiang ordered the navy to stop the ship. If the order is not followed, his troops will sink him. However, the news leaked, Li Zongren confided that the Japanese would send an aid ship to Bai Chongxi that would allow him to reach Hong Kong. To support Wuhan, Li Zongren sneaked to Guangxi to organize, together with the three armies of Xia Wei, Tao Wei and Hu Zongqi, the group's fourth army in Shanghai, an anti-Chiang offensive that intended these troops to be deployed in Huangpu and Wuxue, however, due to complications, Li Zongren and Bai Chongxi were unable to return to Wuhan to command the new Guangxi troops. Huang Shaozhen remained in Guangxi and the Guangdong Army was unable to go north due to their ambivalence in this conflict. Guangxi's new subordinates have conflicted.\nOn March 28, Chiang puts Zhu Peide in command of five divisions in Jiujiang and Nanchang on a mission to occupy the Wuchang-Changsha railway, cutting off the withdrawal of troops from Guangxi. Chiang put Liu Zhi in command of five divisions of the other brigade in Anhui and the Hubei border to attack Wuhan; Han Fuju commanded 5 divisions from southern Henan attack Wuhan. On March 31, Chiang Kai-shek's general attack order. Subsequently, He Jian of Hunan also fell to Chiang Kai-shek. Within the Guangxi clique, Hu Zongtang, Tao Shu, and Li Mingrui, Yu Zuobai and others disagreed. On April 3, Guijun Li Mingrui's apartment was in the garden, and Xiaogan was rejected. After Yu Zuopeng, Yang Tenghui and others contacted Chiang Kai-shek, they announced that they would not participate in the \"civil war\" and withdrew their troops. Leading to the gap in eastern Guangxi and eastern Hubei's new line of defense. The Guangxi clique was forced to leave Wuhan and retreat to Hubei. At the same time, Li Zongren and Bai Chongxi successively arrived in Hong Kong and returned to Guangxi from Guangdong to the west to meet Huang Shaoyu, who remained in Guangxi. But the situation in Hubei is irreversible.\nOn April 11, the National Government issued the \"Gui Gui Department of Military Books,\" which recounted the \"sin\" of the new Guangxi system, and urged Gui Army soldiers to renounce resistance. Guijun's army soldiers were dispersed. Xia Wei, Tao Wei, Hu Zongqi, and other ministries left Wuhan, withdrew west of Hubei, and were surrounded by Shashi, Yichang, and other places. Xia Wei, Tao Wei, Hu Zongqi, Ye Qi, etc. respectively they approached Jiang Zhongzheng and finally resigned and went abroad. Guilin's new army gathered in Hubei. On April 25, Chiang ordered an offensive against Guangxi. Jiang also went to Li Zongren and Bai Chongzhen to go abroad, Huang Shaoyu may stay in Guangxi, but Guangxi will be ruled by Li Mingrui and Yu Zuibing. The New Guilin believes that this condition is very demanding and will not be accepted, and the troops will be mobilized to fight.\nOn May 5, the Guangxi clique announced the establishment of a \"Protection Party to Save the Country\" and launched a campaign against Chiang Kai-shek. He plans to take the initiative to attack, he first attacks Guangdong. On May 15, Feng Yuxiang of the North proposed to cooperate with the Guangxi clique to discuss the situation and the possibility of sending troops to attack Chiang Kai-shek. However, his companions, Shi Yousan, Han Fuyu opposed this idea, so Feng ultimately did not participate.\nIn mid-May, Guangxi's troops entered Guangdong in two ways, defeated the Guangdong Province Army, and entered the city of Guangzhou. Chiang Kai-shek mobilizes the armies of Hunan, Guizhou, Yunnan and other units to carry out an offensive on Guangxi province. The Guangxi clique and the Guangdong army, loyal to Chiang, had a fierce battle in the Baimu region. The invasion of the Guangxi clique into Guangdong was repelled. The clique troops were forced to retreat to the Guangxi province of the same name. However, at the same time, the clique forces gained the front line in Guilin and Liuzhou, defeating Xiangjun, Qijun, and Qijun. In the same month, Hunan, where key part propelled by the Shonan Guilin; Chen Guangdong Zhaoqing attack by the Wuzhou Ministry, He County, Yunnan Department of Guizhou Dushan County Yun occupy Liuzhou.\nChiang Kai-shek quickly mobilized Li Mingrui, Yu Zuobai and the old Guangxi clique army from Yang Tenghui to go south to Guangdong, and west to attack Guangxi. Due to the strong fight between the troops of Li, Yu, Yang quickly captured the Wuzhou and Guiping. Wei Yunwei leaves the city and Guangxi province unable to continue the fight.\nGuangxi province was attacked from three fronts by the enemy from Longzhou. In June, Li Zongren, Bai Chongxi, and Huang Shaoxiong fell. Li Zongren, Bai and others fled to Hong Kong, Sai Kung, Haiphong and other places. June 27, Li Mingrui and his troops enter Nanning. Guangxi's new clique had been defeated, and Chiang appointed Li Mingrui, Yu Zuopeng, and Yang Tenghui to rule the province of Guangxi. The war had ended with Chiang's victory.\nResults and impact\nThe Chiang-Gui war, which lasted three months, ended with the victory of Chiang Kai-shek. Since the Wuhan-Nanjing War and the \"Second Northern Expedition\", the Guangxi clique had been expanding its power ever since, and this war was a severe blow, losing all control, including its Guangxi province. Basically all the military forces have been lost. In June, Li Zongren, Bai Chongxi and Huang Shaoyu, the three leaders of the New Guilin, were forced to flee to Hong Kong. With this war, Chiang completely weakened the rival clique, although Li, Bai, and Huang would return to Guangxi to reorganize and start a new war in just six months. However, the political influence of the Guangxi clique will not be the same.\nThe fall of the Guangxi clique caused the conflict between Feng Yuxiang and Yan Xishan and Chiang to intensify, resulting in the Central Plains War, in which a coalition between Feng, Yan and Li would face off against Chiang in one of the bloodiest civil wars of the last century.\nAfter Li Mingrui, Yu Zuopeng and Yang Tenghui were in charge of Guangxi, there was an expansion of the influence of the communist guerilla, commanded by Deng Xiaoping in the southwest of the country. Just three months later, Chiang sent troops to Guangxi where he expelled Li, Yu, and others for considering them inefficient, however the political situation in Guangxi fell into chaos. Li Mingrui and others later defected to the Communist Party and collaborated with Deng Xiaoping. After Yang Tenghui, Zhou Zuhuang, and Yin Chenggang addressed the officers of the Guangxi clique, they followed Li Zongren again and helped him reorganize again.\nReferences\nBibliography\n*Li Zongren dictated that Tang Degang wrote, the first edition of February 1988, \"Memories of Mr. Li Zongren\". Guangxi: House of the Guangxi people.\n*Mo Jijie, Chen Fulin, 1st edition, August 1991, The Story of the New Guilin, vol. Guangxi People's Publishing House."
    }
  ]
}