{
  "content": [
    {
      "type": "text",
      "text": "# Chief Architect Software\n\nChief Architect Software is a developer of 3D architectural home design software for builders, interior designers, architects, and DIY home enthusiasts. Chief Architect uses BIM tools to create a 3D model of the structure and automatically generates all of the building systems of the home.  For the professional architectural and building market, it publishes the Chief Architect product line. For the consumer DIY market, it publishes the Home Designer product line.\nChief Architect Software is located in Coeur d’Alene, Idaho, United States.\nChief Architect was first released in 1992 as 3D computer graphics software product that ran on an early version of Microsoft Windows Version 3.1.  Chief Architect Software has been reported to be easy to use (in comparison to other 3D CAD packages) for 3D home design, and thus provides a valuable tool in the hands of builders, contractors and homeowners who have traditionally lacked the skills to run complex CAD software.\nHistory\nChief Architect software is a privately held Company founded in 1981  in Palo Alto, CA.  Initially the Company was named Advanced Relational Technology, Inc. (ART) and developed relational databases. The Company's founder, Jack Simpson, a physics PhD from Stanford University, was a native of Coeur d’Alene, Idaho and relocated the Company to Coeur d’Alene in the early 1990s. At that time, he changed the business from database software to home design software. In 2005, the name of the Company name was changed to Chief Architect, Inc.\nChief Architect software was initially created for home design due to Simpson's frustration in designing by hand. Finding that intuitive residential design software did not exist, Simpson created Chief Architect - a tool to design homes. Chief Architect's first version of this professional 3D CAD home design product line was officially sold as version 2.0.  New versions released over the years with key automated building features to help improve the process for residential design.\nIn 1993, the Company licensed a simplified version of the software to Broderbund for sale in the retail / DIY market.  The Company ended its relationship with Broderbund in 2002 following the release of 3D Home Architect 4.0.  In 2003, Chief Architect signed a license agreement with Meredith Corporation to license the name Better Homes and Gardens.  The Company used Better Homes and Gardens Home Designer as the successor to 3D Home Architect.  In 2009, the Company replaced Better Homes and Gardens name with Home Designer.\nIn February 2014, the Company released its first macOS compatible version for the professional design market. This release is engineered in a way that allows users to run a single license on either a Mac or Windows computer and most notably, there is file compatibility when moving a plan between operating systems.\nIn June, 2016 the Company released the Chief Architect 3D Viewer mobile app for iOS and Android. This app allows users to experience 3D models generated in the Chief Architect desktop software to help visualize the design before construction has begun.  The app features a virtual reality experience without use of a headset.\nProducts\n; Professional Home Design software\n: Chief Architect Premier, Chief Architect Interiors  - compatible with PC and Mac\n; DIY / Consumer Home Design software\n: Home Designer Software by Chief Architect - compatible with PC and Mac\n; Mobile App Home Design software\n: Chief Architect 3D Viewer - compatible with iOS and Android\nSee also\n* Comparison of CAD editors for CAE\n* List of BIM software\nReferences"
    }
  ]
}