{
  "content": [
    {
      "type": "text",
      "text": "# Chief Roughneck Award\n\nThe Chief Roughneck Award has presented annually since 1955 by U.S. Steel Tubular Products, Inc., a subsidiary of United States Steel Corporation.  It honors the highest ideals of the petroleum industry and is awarded to honor the achievements and character of a petroleum executive. Recently it has been presented at the annual meeting of the Independent Petroleum Association of America in San Antonio, Texas.\nThe bronze Joe Roughneck bust, created by Torg Thompson and presented to each Chief Roughneck recipient, began life in Lone Star Steel Company print advertising.\nJoe Roughneck's sculpture has been dedicated in several oil patch parks, saluted by governors, and featured in newspaper and magazine articles.\nThe award is recognized as one of the most meaningful honors in the industry; the award and the character behind it symbolize the spirit, determination, leadership and integrity of individuals who have made a lasting impression on the energy industry.\nWinners\n*2014 – Jeffrey L. Ventura, president and chief executive officer, Range Resources\n*2013 – Bruce H. Vincent, president and director, Swift Energy Company\n*2012 – Charles D. Davidson, chairman and CEO, Noble Energy, Inc.\n*2011 – Michael C. Linn, executive chairman, Linn Energy, LLC\n*2010 – Aubrey K. McClendon, chairman and CEO, Chesapeake Energy Corporation\n*2009 – Harold Korell, chairman of the board, Southwestern Energy Company\n*2008 – Diemer True, chairman and founder, The Diamond Companies of Wyoming\n*2007 – John B. Walker, president and chief executive officer, EnerVest, Ltd.\n*2006 – Mark Papa, president, EOG Resources, Inc.\n*2005 – Ray L. Hunt, chief executive officer, Hunt Oil Company\n*2004 – George M. Yates, chairman and president, HEYCO Energy Group, Inc.\n*2003 – Robert J. Allison, Jr., chairman, president and chief executive officer, Anadarko Petroleum Corporation\n*2002 – Robert L. Nance, president and chief executive officer, Nance Petroleum Corporation\n*2001 – James Cleo Thompson, Jr., chairman and president, Thompson Petroleum Corporation\n*2000 – J. Larry Nichols, chairman, president and chief executive officer, Devon Energy\n*1999 – Lew O. Ward, chairman and chief executive officer, Ward Petroleum\n*1998 – Jon Rex Jones, chairman, Jones Energy, Ltd. and, chairman, EnerVest Management Company\n*1997 – George A. Alcorn, president, Alcorn Exploration\n*1996 – John A. Yates, president, Yates Petroleum Corporation\n*1995 – Eugene L. Ames, Jr., chairman, president and chief executive officer, Venus Exploration Inc.\n*1994 – C.J. (Pete) Silas, chairman, Phillips Petroleum Company\n*1993 – Danny H. Conklin, partner, Philcon Development Company\n*1992 – Irene S. Wischer, president and chief executive officer, Panhandle Producing Company\n*1991 – George P. Mitchell, chairman and president, Mitchell Energy & Development Company\n*1990 – Chester R. Upham, owner and general manager, Upham Gas Company\n*1989 – Raymond H. Hefner Jr., chairman and chief executive officer, Bonray Energy Corporation\n*1988 – Robert G. Fowler, president and chief operating officer, Enserch Exploration\n*1987 – E.L. (Chick) Williamson, chairman and chief executive officer, Louisiana Land and Exploration Company\n*1986 – Lloyd N. Unsell, president, IPAA\n*1985 – A.V. Jones Jr., chairman, Jones Company\n*1984 – Kye Trout Jr., owner and chief executive officer, Energy Resources\n*1983 – Dean A. McGee, chairman and chief executive officer, Kerr-McGee\n*1982 – Jack M. Allen, president and chief executive officer, Alpar Resources\n*1981 – Robert O. Anderson, chairman and chief executive officer, Atlantic Richfield\n*1980 – Edwin L. Cox, chairman and chief executive officer, Cox Oil & Gas Company\n*1979 – L. Frank Pitts, owner, Pitts Oil Company\n*1978 – J. Hugh Liedtke, chairman and chief executive officer, Pennzoil Company\n*1977 – Charles H. Murphy Jr., chairman, Murphy Oil Company\n*1976 – R.L. (Bob) Foree, owner, Foree Oil\n*1975 – C. John Miller, partner, Miller Brothers\n*1974 – Roy Guffey, owner, Roy Guffey Drilling Company\n*1973 – Wayne E. Glenn, president, Continental Oil Company\n*1972 – W.A. Moncrief, president and chief executive officer, Moncrief Oil\n*1971 – M.A. (Mike) Wright, chairman and chief executive officer, Humble Oil & Refining Company\n*1970 – W.F. (Dink) Dalton, president, Placid Oil Company\n*1969 – Jack E. Kadane, owner, G.E. Kadane & Son\n*1968 – L.B. Meaders, chief executive officer, Halliburton Company\n*1967 – E.D. Brockett Jr., chairman and chief executive officer, Gulf Oil Corporation\n*1966 – H.L. Hunt, chairman and chief executive officer, Hunt Oil Company\n*1965 – H.A. (Dave) True, partner, True Oil and True Drilling\n*1964 – J. Harold Dunn, chairman, Shamrock Oil and Gas Corporation\n*1963 – Bruce C. Clardy, president, L.R. Development, Limited\n*1962 – partner, Rowan and Hope\n*1961 – Johnny Mitchell, president, Jade Oil, vice chairman, Christie, Mitchell & Mitchell\n*1960 – Earl Hollandsworth, partner, Hollandsworth Oil Company\n*1959 – J.L. (Slatz) Latimer, chairman, Magnolia Petroleum and Magnolia Pipe Line Company\n*1958 – Guy I. Warren, vice president and part owner, Renwar Oil Corporation\n*1957 – Arch Rowan, owner, Rowan Drilling Company\n*1956 – Jake L. Hamon, partner, Hamon Oil\n*1955 – R.E. (Bob) Smith, independent\nReferences\nExternal links\n*[http://aoghs.org/energy-education-resources/chief-roughneck-award-winners-2/ Official site of winners]\n*[http://aoghs.org/energy-education-resources/joe-roughneck/ Meet Joe Roughneck]"
    }
  ]
}