{
  "content": [
    {
      "type": "text",
      "text": "# Children's Crusade (Britten)\n\nby Bertolt Brecht, translated by Hans Keller\n| language            = German\n| composed            = –1969\n| dedication          = Hans Werner Henze\n| performed           =\n| published           =\n| scoring             =\n}}\n'''Children's Crusade', Op. 82, subtitled a ''Ballad for children's voices and orchestra'' is a composition by Benjamin Britten. He completed it in 1969, setting Bertolt Brecht's poem  for children's choir with some solo parts, keyboard instruments and an array of percussion, to be performed mainly by children. It was first performed in an English version at St Paul's Cathedral in London on 19 May 1969.\nHistory\nBenjamin Britten composed several works for performance by children. He wrote ''Children's Crusade in October and November 1968, setting a narrative poem by Bertolt Brecht entitled Kinderkreuzzug 1939, translated by Hans Keller. The composer stated that he had been interested in setting the text for some time, and suggested it as appropriate when he was approached to compose a work for the 50th anniversary of the Save the Children Fund.\nChildren's Crusade'' was performed, in an English version, by members of the Wandsworth School Choir, conducted by Russell Burgess, at St Paul's Cathedral in London on 19 May 1969, as part of a commemorative service. The same year, the performance was repeated as part of the Proms, in a concert at the Royal Albert Hall on 31 August, with Mozart's Symphony No. 25 in G minor and Tchaikovsky's Symphony No. 6 \"Pathetique\".\nIt was published by Faber Music in 1970, dedicated to Hans Werner Henze.\nThe first performers recorded the work in 1970 for a collection of Britten Rarities, with the Wandsworth School Boys' Choir, among the soloists Adrian Thompson, pianists Ian Cobb and John Clegg, organist Jonathan Smith and six percussionists. The first performance of the German version took place in Braunschweig in 1980 by the children of the Braunschweiger Jugendchor (Brunswick Youth Choir), conducted by Manfred Ehrhorn, followed by the first recording in German a year later. It was reissued in 2012.\nIn 2002 and 2003, the work was recorded, with other music by Britten for children, by the Choristers of Christ Church Cathedral and Worcester College Chapel Choristers, Christian Wilson (piano), John Madden (percussion and chamber organ) and the Oxfordshire Youth Percussion Ensemble, conducted by Stephen Darlington. A 2015 recording by the Mädchenchor Hannover conducted by Gudrun Schröfel combined the work with Britten's A Ceremony of Carols.\nTheme\nThe topic is a group of children in Poland during World War II in quest of peace. It was, after Britten's War Requiem, another work inspired by his pacifist convictions, pointing out the \"futility of war, witnessed through the eyes of a group of brave Polish children in the face of overwhelming odds\", based on Brecht's imagery.\nMusic\n# General situation of the children in the devastated wintry land\n# Description of individual members of the children's group\n# Narrator's commentary\n# Futility and irredeemability of the quest for peace\n# Vision of the enormous streams of refugees and of the suffering of all children of this world\n# Indirect report of the death of the children\n-->\nBritten scored the vocal part for a boys' choir with nine solo parts. The orchestra includes a battery of percussion, two pianos and electronic organ or portable organ. The work takes about 19 minutes to perform. The percussion is intended to be played by children with the help of a few adults. The pianos and organ are designed to establish pitch. The work has been regarded as \"a bleak pacifist message\", and an \"utterly serious piece of music, cleverly designed so as to involve as many children as possible in conveying the rather desperate, bleak message of Brecht’s poem\".\nReferences\n}}\nExternal links\n* [http://www.bl.uk/manuscripts/FullDisplay.aspx?ref=Add_MS_60616 Benjamin Britten: \"Children's Crusade\", op. 82 (full score)], British Library\n* [http://www.brittenproject.org/works/BTC1143 ''Children's Crusade], Britten Thematic Catalogue\n*\n* [https://www.antiwarsongs.org/canzone.php?id=42165&lang=en \"Children's Crusade, Op. 82 (Der Kinderkreuzzug'')] (text in Italian, English, German, French) antiwarsongs.org\n* [https://prints.paimages.co.uk/archive/music-benjamin-britten-wandsworth-school-boys-choir-st-pauls-cathedral/music-benjamin-britten-wandsworth-school-boys-12274828.html \"Poster Print of Music – Benjamin Britten – Wandsworth School Boys Choir – St. Pauls Cathedral\"], prints.paimages.co.uk"
    }
  ]
}