{
  "content": [
    {
      "type": "text",
      "text": "# Chinatown, Newark, New Jersey\n\n|subdivision_type1      = State\n|subdivision_name1      =\n|subdivision_type2      = County\n|subdivision_name2      = Essex County\n|subdivision_type3      = City\n|subdivision_name3      = Newark\n|coordinates            =\n|postal_code_type=ZIP Code\n|postal_code= 07102\n|area_code=973\n}}\n]]\nChinatown was a neighborhood in the city of Newark in Essex County, in the U.S. state of New Jersey. It was an ethnic enclave with a large percentage of Chinese immigrants, centered along Mulberry Street from 1875 and remaining on some scale for nearly one hundred years.\nDescription\nThe center of the neighborhood was directly east of the Government Center neighborhood, in the area of Mulberry Street between Elm and Lafayette. The first Chinese in Newark came from the community in neighboring Belleville, home of the East Coast's first Chinese community. The first Chinese businesses appeared in Newark in the second half of the 19th century and in the early part of the 20th century.  By the 1920s, the small area had a Chinese population of over 3000.\nIn 1910, a small lane with housing and shopping was built called Mulberry Arcade, connecting Mulberry Street and Columbia Street between Lafayette and Green Streets. In the 1920s, recurring federal opium raids disrupted the community, causing many to move to more peaceful places.\nGang leader Sai Wing Mock was shot in an attempt on his life in front of his establishment on Mulberry.\nDespite an attempt to revive the neighborhood decades later, the Mulberry Arcade (the center of Chinatown) was removed in the 1950s. A 21st century project in the area is called Mulberry Commons.\nToday, there is barely any sign that a Chinatown existed in the neighborhood, and only a small Chinese population remains.\nSee also\n* Chinese community of Edison, NJ\n* [https://www.atlasobscura.com/articles/chinese-bradley-beach-new-jersey Chinatown-by-the-sea], Bradley Beach, New Jersey\nReferences\nExternal links\n*[https://web.archive.org/web/20080206195427/http://www.sumei.org/ Sumei Multidisciplanary Center]\n*[https://web.archive.org/web/20071008213519/http://www.newarkchinatown.org/index.html When Newark Had a Chinatown]\n*[https://web.archive.org/web/20090327031451/http://www.oldnewark.com/imagepages/images/maps/nationalities1910.jpg 1910 map showing Chinese population in Chinatown]"
    }
  ]
}