{
  "content": [
    {
      "type": "text",
      "text": "# Chinchilla, Queensland\n\n| pop                 = 7068\n| pop_year            =\n| pop_footnotes       =\n| established         = 1877\n| postcode            = 4413\n| area                = 72.2\n| timezone            = AEST\n| utc                 = +10:00\n| dist1               = 188\n| dir1                = E\n| location1           = Roma, Queensland\n| dist2               = 81.1\n| dir2                = NW\n| location2           = Dalby\n| dist3               = 164\n| dir3                = NW\n| location3           = Toowoomba\n| dist4               = 292\n| dir4                = WNW\n| location4           = Brisbane\n| dist5               = 455.1\n| dir5                = E\n| location5           = Charleville\n| lga                 = Western Downs Region\n| stategov            = Callide\n| fedgov              = Maranoa\n| elevation           = 303\n| maxtemp             = 29.5\n| mintemp             = 25.3\n| rainfall            = 670.2\n| near-n              = Red Hill\n| near-ne             = Red Hill\n| near-e              = Chances Plain\n| near-se             = Boonarga\n| near-s              = Hopeland\n| near-sw             = Crossroads\n| near-w              = Greenswamp\n| near-nw             = Baking Board\n}}\nChinchilla is a rural town and locality in the Western Downs Region, Queensland, Australia. Chinchilla is known as the 'Melon Capital of Australia', and plays host to a Melon Festival every second year in February.\nIn the , the locality of Chinchilla had a population of 7,068 people.\nGeography\nThe town is approximately  west-northwest of Brisbane, 164 kilometres (102 mi) west-northwest of Toowoomba, 81.1 kilometres (50 mi) northwest of Dalby, 188 kilometres (117 mi) east of Roma and 455.1 kilometres (283 mi) east of Charleville on the Warrego Highway.\nHistory\nIndigenous\nThe Baranggum people lived in the region for thousands of years before British colonisation. They spoke the now extinct Barunggam language.\nThey appear to have had kinship ties with the neighbouring Mandandanji, Bigambul and Yiman people.\nThe name Chinchilla is a corruption of the Aboriginal word \"tintinchilla\" or \"jinchilla\" indicating cypress pine, possibly recorded by explorer and naturalist Ludwig Leichhardt.\nBritish colonisation\nBritish exploration through the region began in the 1840s, most notably with the 1844 expedition of Ludwig Leichhardt. Leichhardt named Charleys Creek (upon which the modern town of Chinchilla is located) after Charley Fisher, a Wiradjuri man who accompanied Leichhardt's group.\nIn 1847, British pastoralist squatter, Matthew Buscall Goggs, claimed around 37,000 acres of land along the Condamine River and Charleys Creek, calling his property Chinchilla. He fought a long war with the resident Baranggum people to take ownership. In 1849, with the help of military actions of Native Police units under Frederick Walker, Goggs was able to defeat and disperse most of the Baranggum resistance. In 1857, Goggs the sold Chinchilla property for £25,000 to the influential pastoralist and politician Gideon Lang.\nThe town of Chinchilla was established in 1877. As the Western railway line was extended west across the Darling Downs from Toowoomba and Dalby, a temporary construction camp was established on the banks of Charley's Creek which developed into a town.\nChinchilla Post Office opened on 3 January 1878.\nCivic infrastructure and schools\nChinchilla State School opened on 22 January 1883. A secondary department was opened in 1954, closing in 1963 when Chinchilla State High School opened. The school celebrated its centenary in 1983.\nMulga Provisional School opened circa 1896. On 1 January 1909, it became Mulga State School. Between 1914 and 1915, the school operated as a half-time school, sharing a single teacher with Hill Top Provisional School (later Boonarga State School). It closed in 1915 but reopened as the full-time Mulga State School in 1917. It closed circa 1943.\nRiversdale Provisional School opened in 1902. On 1 January 1909, it became Riversdale State School. It closed in 1915. It was at the western end of Windmill Road (approx ).\nMonmouth Provisional School opened on 16 August 1904. On 1 January 1909, it became Monmouth State School.It closed in April 1921, reopening as Monmouth Provisional School in 1930. It closed circa 1946. It was at 33 Hunter Road off Monmouth Bridge Road ().\nIn 1911, the Queensland Railway Department built a tramway from Chinchilla to Wongongera (now Barakula) to transport railway sleepers made from logs taken from the state forest at Barakula and milled at the Barakula sawmill. The route of the Barakula tramway was based on an earlier plan to construct a railway line from Chinchilla to Taroom that was subsequently abandoned in favour of a railway line from Miles to Taroom. The tramway operated until 1970. It was a  gauge tramway.\nSpeculation Provisional School opened in 1908 and closed circa 1915.\nPark View Provisional School opened circa 1910 and closed circa 1916.\nThe town was part of the Shire of Chinchilla local government entity from 1912, formed after splitting from the Shire of Wambo, until 2008 when it amalgamated with the Town of Dalby and the Shires of Murilla, Tara and Wambo and the southern part of Taroom to form the Western Downs Region.\nFairy Meadow Road State School opened on 5 November 1915 and closed in 1919.\nWilga Park Provisional School and Wombo Creek Provisional School both opened in 1916 as half-time schools (meaning they shared a single teacher). Wilga Park Provisional School closed in late 1917 or early 1918. It is not known if Wombo Creek Provisional School then also closed or operated on a full-time basis. From 9 July 1919 Wombo Creek Provisional School was operating on a half-time basis with the newly opened Gunbar Provisional School. Wombo Creek and Gunbar schools both closed circa 1925/6.\nLogyard Provisional School opened in 1918, closing circa 1919. Logyard State School opened circa 1941 and closed in 1959.\nSixteen Mile Creek Provisional School opened on 5 February 1918 as a half-time provisional school (possibly in conjunction with Wombo Creek Provisional School). It closed in 1936.\nThe Chinchilla War Memorial was originally located near the railway overpass and was unveiled on 30 January 1919 by the Queensland Governor, Hamilton Goold-Adams. In 1977, it was substantially refurbished and relocated to the Returned and Services League of Australia club and was unveiled on 17 March 1979.\nGunbar Provisional School opened on 9 July 1919 as a half-time school in conjunction with Wombo Creek Provisional School. It closed circa 1925–1926.\nColamba Provisional School opened on 14 October 1919. It closed in 1939.\nCambey Provisional School opened in 1922. It closed circa 1935.\nUnity Provisional School opened on 16 November 1922. It closed in 1931.\nSt Joseph's Catholic School was officially opened by Archbishop James Duhig on 27 January 1923, with the school commencing operation on 29 January 1923. It was established by three Sisters of St Joseph of the Sacred Heart with an initial enrolment of 63 students. Since 1992 the school has operated under lay leadership.\nThe town saw a resurgence after the defeat of the prickly pear. Experimental work took place in the town to assess the success of the Cactoblastis cactorum moths in the eradication of the pest.  In 1926, the first moth was released and by 1933 most of the affected land had been cleared of prickly pears.\nOak Park State School opened on 13 February 1946. It closed in 1962.\nWambo Creek State School opened on 2 April 1946. It closed in 1961.\nChinchilla State High School opened on 29 January 1963, replacing the secondary department at Chinchilla State School.\nChinchilla Christian School opened 1 January 1983.  It was established by a group of local Christian parents. In 2014 it was renamed Chinchilla Christian College and in 2015 it joined the Christian Community Ministries network.\nThe Warwick Public Library opened in 1999 with a major refurbishment in 2012 and a minor refurbishment in 2016.\n* Aboriginal and Torres Strait Islander people made up 5.8% of the population.\n* 80.2% of people were born in Australia. The next most common country of birth was New Zealand at 1.6%.\n* 84.5% of people spoke only English at home.\n* The most common responses for religion were Catholic 20.1%, Anglican 20.1% and No Religion 18.7%.\nIn 2018, Chinchilla won a national competition run by Wotif to create the Next Big Thing as a new tourist attraction. The  long Big Melon was installed next to the town's information centre in November 2018.\nDemographics\nIn the , the locality of Chinchilla had a population of 6,612 people.\nIn the , the locality of Chinchilla had a population of 7,068 people.\nHeritage listings\nChinchilla has a number of heritage-listed sites, including:\n* Chinchilla Digger Statue, 57 Heeney Street ()\n* First and second Chinchilla cemeteries\n* Chinchilla Court House\n* Chinchilla Hospital Complex\n* Chinchilla Railway Complex\n* Chinchilla War Memorials (including Anzac Park and Googs Memorial)\n* Speculation Oil Well & Camp\nEconomy\nAgriculture is the mainstay of the community, with beef and pork production, wool growing, and horticulture traditionally underwriting the local economy. However, with the recent resources boom, the Kogan Creek Power Station (and other coal and gas projects) have begun to inject welcome cash into the town and Chinchilla is experiencing mass growth and development. House prices in Chinchilla have boomed as a result of the need to house new workers.\nThe Western Downs Green Power Hub commenced construction in the Chinchilla region in July 2020. The project is located approx 20&nbsp;km south-east of Chinchilla in the Western Downs Region, in close proximity to a transmission line and less than 6&nbsp;km from Queensland Powerlink's Western Downs Sub-station. Once operational, it is expected to be one of Australia's largest solar farms.\nEducation\nChinchilla State School is a government primary (Early Childhood to Year 6) school for boys and girls at 34–40 Bell Street (). In 2018, the school had an enrolment of 570 students with 50 teachers (43 full-time equivalent) and 29 non-teaching staff (20 full-time equivalent). It includes a special education program.\nSt Joseph's Catholic Primary School is a Catholic primary (Prep–6) school for boys and girls at 74 Middle Street (). In 2018, the school had an enrolment of 235 students with 17 teachers (13 full-time equivalent) and 9 non-teaching staff (6 full-time equivalent).\nChinchilla Christian College is a private primary and secondary (Prep–12) school for boys and girls at 88 Oak Street (). In 2018, the school had an enrolment of 261 students with 21 teachers (16 full-time equivalent) and 16 non-teaching staff (12 full-time equivalent).\nChinchilla State High School is a government secondary (7–12) school for boys and girls at 7 Tara Road (). In 2014, the school had 524 students and 43 teachers (42 full-time equivalent). In 2018, the school had an enrolment of 654 students with 62 teachers (56 full-time equivalent) and 30 non-teaching staff (23 full-time equivalent). It includes a special education program.\nThe Southern Queensland Institute of TAFE annex is located in the high school grounds and works closely with local business and industries.\nLeichhardt House is a hostel that provides accommodation for students in Years 7-12 who live in remote areas too distant to commute to school each day.\nFacilities\nChinchilla has its own hospital, with an emergency ward, maternity ward and operating theatre. It can also care for long stay patients, and has other services such as social work, child health, physiotherapy, dietitian, speech therapy, occupational therapy, mental health, community health services, a women's clinic and an x-ray facility.\nIn town, there is also a private dental practice, along with the public dental hospital. Five general practitioners operate in the area, along with an occupational therapist, optometrist, podiatrist, physiotherapists and chiropractors.\nAmenities\nChinchilla has a Cultural Centre, which includes a 700-seat auditorium, cinema and function room, outdoor patio, theatrette, plus bar and kitchen facilities. Also included in the complex are the Art Gallery and the Library.\nThe Cultural Centre also houses a cinema showing recently released movies.\nChinchilla White Gums Art Gallery houses a new display every month.\nThe Western Downs Regional Council operates a public library in Chinchilla at 80-86 Heeney Street ().\nThe Chinchilla branch of the Queensland Country Women's Association has its hall at 53 Heeney Street ().\nChinchilla & District Uniting Church is at 31 Middle Street ().\nTrinity Lutheran Church is at 25 Sheriff Street ().\nChinchilla Botanic Parkland, which is one of five locations in Australia to hold the 2022/2023 Green Flag Award, an international accreditation given to the world's best green spaces.\nSport\nChinchilla has a range of sports facilities and a variety of sports clubs. Chinchilla Aquatic Centre houses an indoor 25m heated pool, an outdoor 50m pool and a gymnasium. The Chinchilla Family Sports Centre provides facilities for many sports and clubs. There are also clubs and facilities for soccer (Chinchilla Bears,) touch football, rugby league, cricket, tennis, squash, motocross, gymnastics, indoor netball, taekwondo, football and lawn bowls. A fishing club, Pony Club, and shooting range also operate in the area. In addition, there are Polocrosse grounds, a race track, and 9 hole golf course. A Multipurpose Sports Centre Stadium is currently being developed.\nMedia\nRebel FM 97.1 (formerly Sun FM) was Chinchilla's first commercial FM radio station. Rebel FM has a new rock & classic rock music format. Rebel FM's sister station, The Breeze broadcasts on 95.5 FM with an easy adult contemporary & classic hits format. Both stations are part of the Gold Coast-based Rebel Media Group which operates a radio network that reaches the Gold Coast and South Brisbane to many centres throughout regional and outback Queensland.\nChinchilla News and Murilla Advertiser is the local newspaper. The publication transitioned to digital only in June 2020 prior to that it was published every Thursday.\nAttractions\nChinchilla is one of the towns located on the Warrego Highway, which is a main highway leading out west to Charleville, and a popular tourist route. The mainstays of Chinchilla's tourism industry are the Historical Museum, fishing and fossicking for petrified wood. 'Chinchilla Red' petrified wood is unique to the area, and known for its colour and quality. The Chinchilla White Gum (Eucalyptus argophloia) is also unique to the area, and can be seen on some of the tourist drives which are marked around the region.\nAn accredited Visitor Information Center is located on the Highway.\nEvents\nThe Chinchilla Grandfather Clock Campdraft is a major event held every October, where entrants compete for the Grandfather Clock prize. Chinchilla also hosts horse races four times a year.\nChinchilla Melon Festival\nAs Chinchilla produces 25% of Australia's melons (including watermelon, rockmelon and honeydew), the first Chinchilla Melon Festival  was held in 1994 by local producers and businessmen, to lift the town's spirits after the severe drought experienced in the early 1990s. Estimated numbers at the first Festival were approximately 2,500 which grew to an estimate that there were 10,000 visitors on the main day of the 2011 festival.\nIn 2009, the Melon Festival won the Queensland Regional Achievement and Community Award for Tourism Event.\nThe Festival features interactive and unique events, such as Melon Skiing, Melon Bungee, Melon Bullseye, Melon Ironman, Melon Chariot, a pip spitting competition, and melon eating races. A special event held in 2009 saw John Allwood secure the Guinness World Record of Melon Head Smashing - cracking open as many watermelons as possible using only the head. Currently his record is 47 melons in a minute.\nTransport\nChinchilla is connected to Brisbane, Toowoomba and Roma by the Warrego Highway.\nGreyhound Australia operates bus services daily between Brisbane and Miles via Chinchilla. and also operates 2-3 daily bus services between Brisbane and Mount Isa via Longreach and Charleville, and three buses a week between Toowoomba and Rockhampton, along the Dawson Highway. Murrays Coaches also operates a daily service to and from Brisbane.\nThe Westlander train also comes through Chinchilla twice a week, on its way between Brisbane and Charleville. The westbound service (3S86) stops at Chinchilla at 2:35am Wednesdays and Fridays. The eastbound service (3987) stops at Chinchilla at 3:15am Thursdays and Saturdays.\nAs it is a small town, there is no public transport (besides a taxi), although many coal and gas companies run contracted buses out to their sites.\nNotable locals\n*John Gleeson, rugby league player, went on to captain Queensland and play for the Australia national rugby league team in the 1960s.\n*David Littleproud, Leader of the National Party (2022–present)\n* George Miller, film filmmaker\n* Pete Murray, Australian folk/country singer, grew up in Chinchilla.\n*Dean Ray, singer/performer\n*Nathan Reardon, cricketer\n*Gerard Rennick, Senator for Queensland\n*Ben Ross, rugby league player\nReferences\nExternal links\n*\n*\n*\n*[https://onesearch.slq.qld.gov.au/permalink/61SLQ_INST/dls06p/alma996910734702061 Annual reports Chinchilla Hospitals Board], State Library of Queensland\n*[https://onesearch.slq.qld.gov.au/permalink/61SLQ_INST/dls06p/alma99183508818902061 Queensland Small Towns Documentary Project 2017: Chinchilla], State Library of Queensland"
    }
  ]
}