{
  "content": [
    {
      "type": "text",
      "text": "# China International Culture Exchange Center\n\n| native name =\n| native_name_lang = zh-cn\n| logo = China International Culture Exchange Center logo.png\n| upright = 1.2\n| image =\n| image_upright =\n| abbreviation = CICEC\n| headquarters = Beijing\n| leader_title = Alternate name\n| leader_name = 12th Bureau of the Ministry of State Security\n| leader_title2 = Vice President\n| leader_name2 = Sun Wenqing\n| affiliations = Chinese Communist Party\n| parent_organization = Ministry of State Security\n| website =\n| module =\n}}\nThe 12th Bureau of the Ministry of State Security, known publicly as the China International Culture Exchange Center (CICEC; ) under an arrangement called \"one institution with two names\", is a set of research institutes operated by the Chinese Ministry of State Security (MSS), the principal civilian intelligence agency of the People's Republic of China as a front organization. CICEC was founded in 1984 and is active in operations to influence foreign think tanks, academics, and other high-profile foreigners. In addition to the China Institutes of Contemporary International Relations, CICEC is considered one of the main front organizations utilized for foreign influence operations by the MSS.\nChina scholar Miwa Hirono stated that the idea for the CICEC began when then-paramount leader Deng Xiaoping wanted to advance Chinese Communist Party (CCP)'s interests through more so-called \"people's diplomacy\" in addition to the official diplomatic channels. According to Australian analyst Alex Joske, \"[f]rom its very earliest days, CICEC's activities exemplified the Leninist united front strategy of forming alliances of convenience with outside groups, only to discard or marginalise them when they are no longer needed.\" CICEC was a key platform for propagating the narrative of \"China's peaceful rise\" with foreign elites throughout the 1990s and early 2000s.\nCICEC has been a long-time working partner with the China Association for Science and Technology for its technology transfer programs.\nSee also\n* Chinese intelligence activity abroad\n* Chinese information operations and information warfare\nReferences\nExternal links\n*"
    }
  ]
}