{
  "content": [
    {
      "type": "text",
      "text": "# Chita Rivera Awards for Dance and Choreography\n\nChita Rivera|}}\n| sponsor = New York City Dance Alliance\n| image2 = Chita_Rivera_Awards_Logo.png\n| caption2 = Chita Rivera Awards Logo\n}}\nThe Chita Rivera Awards for Dance and Choreography, informally known as The Chitas, honor excellence in dance and choreography in both stage and screen productions. Presented annually at the Skirball Center for the Performing Arts in New York City, the awards celebrate outstanding achievements in Broadway and Off-Broadway theatre as well as in film.\nEstablished in 1982 as The Astaire Awards, the honors were originally created to recognize the legacy of Fred Astaire and his sister Adele, who were celebrated for their influential work on the Broadway stage. In 2017, the awards were renamed in honor of two-time Tony Award-winning dance icon Chita Rivera.\nThe Chita Rivera Awards are presented by the [https://www.nycdance.com/ New York City Dance Alliance], and the event is publicized by long-standing Broadway press agency Keith Sherman & Associates.\nHistory\nThe Chita Rivera Awards for Dance and Choreography honor excellence in dance and choreography across theatre and film productions, with awards presented based on each eligible season. In addition to competitive categories, several discretionary, non-competitive honors are also bestowed, including a Lifetime Achievement Award and an award for Outstanding Contribution to Musical Theatre and Film.\nProceeds from the Chita Rivera Awards benefit the NYC Dance Alliance Foundation’s College Scholarship Program, which provides financial support to talented young dancers pursuing higher education. Since its inception, the Foundation has awarded over $5 million in scholarships to more than 500 students attending 50 of the nation's leading college dance programs.\nOriginally established in 1982 as the Astaire Awards, the honors were created in collaboration with Fred Astaire to celebrate both his legacy and that of his sister, Adele Astaire. The siblings starred together in ten Broadway musicals between 1917 and 1931.\nFrom 2001 to 2005, the Theatre Development Fund presented the awards under the name TDF Astaire Awards. In 2007, the awards were rebranded as the Fred & Adele Astaire Awards, a title they retained until 2017, when they were officially renamed the Chita Rivera Awards for Dance and Choreography.\nThe awards' use of Fred Astaire’s name led to a series of legal challenges by his widow, Robyn Astaire, who sought to restrict unauthorized use of his name and likeness. In 2010, she attempted to block the ceremony, asserting that the “Fred and Adele Astaire Awards” violated trademark and publicity rights. The ensuing legal battle involved Astaire’s daughter, Phyllis Ava Astaire McKenzie, and other stakeholders in the awards. Ultimately, courts denied Robyn Astaire's motions for restraining orders, citing insufficient evidence of likely success or irreparable harm. These disputes highlighted ongoing legal complexities related to posthumous publicity rights and the control of celebrity estates.\nChoreographer Susan Stroman holds the record for the most awards in the history of the Chita (formerly Astaire) Awards. She won her fifth award in 2011 for The Scottsboro Boys. Stroman earned the Best Choreography in a Broadway Show award for three consecutive years: in 2000 for Contact and The Music Man, in 2001 for The Producers, and in 2002 for Oklahoma!. She first received the honor in 1994 for the Broadway revival of Show Boat.\nLegendary recipients of the Chita Rivera Awards (and former Astaire Awards) include some of the most influential figures in American musical theater and dance. Honorees have included iconic figures such as Liza Minnelli, Bernadette Peters, Joel Grey, Chita Rivera, and John Kander, whose collective contributions have shaped the modern Broadway landscape. Other notable winners include Ariana DeBose, Debbie Allen, Ann Reinking, Tommy Tune, Savion Glover, Rob Marshall, Susan Stroman, Bebe Neuwirth, Jane Krakowski, Andy Blankenbuehler, Adrienne Warren, Wayne Cilento, Ben Vereen, Karen Olivo, Corbin Bleu, Robyn Hurder, and Desmond Richardson.\nIn 2016, the eligibility criteria were expanded to include Off-Broadway productions. On March 30, 2017, the awards were officially rebranded as the Chita Rivera Awards for Dance and Choreography. In 2023, the organization announced the adoption of gender-neutral performance categories, replacing traditional gendered awards with a single, inclusive category featuring twice as many nominees and two winners.\nPrevious Award Winners\n{| class=\"wikitable\"\n|+Broadway Awards\n|\n|Outstanding Choreography in a Broadway Show\n|Outstanding Dancers in a Broadway Show\n|Outstanding Ensemble in a Broadway Show\n|-\n|2025\n|Patricia Delgado & Justin Peck, Buena Vista Social Club\n| - Kevin Csolak, Gypsy - Robyn Hurder, Smash\n|Buena Vista Social Club\n|-\n|2024\n|\n- Camille A Brown, Hell’s Kitchen - Jesse Robb & Shana Carroll, Water For Elephants\n| - Antoine Boissereau, Water For Elephants - Tilly Evans-Kreuger, The Outsiders\n|Illinoise\n|-\n|2023\n|Steven Hoggett, A Beautiful Noise\n| - Robyn Hurder, A Beautiful Noise - Jess LeProtto, A Beautiful Noise - Mattie Love, Bob Fosse’s Dancin’\n|\n- A Beautiful Noise - Bob Fosse’s Dancin’\n|-\n|2022\n|Bill T. Jones, Garrett Coleman & Jason Oremus, Paradise Square\n| - Myles Frost, MJ the Musical - Jared Grimes, Funny Girl - Tendayi Kuumba, for colored girls...\n|for colored girls who have considered suicide/ when the rainbow is enuf\n|-\n|2021\n| colspan=\"3\" |No ceremony held due to the COVID-19 Pandemic in New York City\n|-\n|2020\n| colspan=\"3\" |No ceremony held due to the COVID-19 Pandemic in New York City\n|-\n|2019\n|David Neumann, Hadestown\n| - Ashley Blair Fitzgerald, The Cher Show - Gabrielle Hamilton, Oklahoma! - Ephraim Sykes, Ain’t Too Proud\n|King Kong\n|-\n|2018\n|Sergio Trujillo, Summer: The Donna Summer Musical\n| - Ariana DeBose, Summer: The Donna Summer Musical - Tony Yazbeck, Prince of Broadway\n| - Carousel- Mean Girls\n|-\n|2017\n|Andy Blankenbuehler, Bandstand\n| - Corbin Bleu, Holiday Inn - Megan Sikora, Holiday Inn\n|Natasha, Pierre & the Great Comet of 1812\n|-\n|2016\n| - Andy Blankenbuehler, Hamilton\n- Savion Glover, Shuffle Along\n- Sergio Trujillo, On Your Feet\n| - Jane Krakowski, She Loves Me\n- Phillip Attmore, Shuffle Along\n|Shuffle Along\n|}\n{| class=\"wikitable\"\n|+Off-Broadway Awards\n|\n|Outstanding Choreography in an Off-Broadway Show\n|Outstanding Dancers in an Off-Broadway Show\n|Outstanding Ensemble in an Off-Broadway Show\n|-\n|2025\n|Arturo Lyons & Omari Wiles, Cats: The Jellicle Ball\n| Not Awarded\n|Not Awarded\n|-\n|2024\n|Not Awarded\n| Not Awarded\n|Not Awarded\n|-\n|2023\n|Andy Blankenbuehler, Only Gold\n| - Gaby Diaz, Only Gold- Ryan Steele, Only Gold\n|Not Awarded\n|-\n|2022\n|Josh Prince, Trevor\n| Not Awarded\n|The Wrong Man\n|-\n|2021\n| colspan=\"3\" |No ceremony held due to the COVID-19 Pandemic in New York City\n|-\n|2020\n| colspan=\"3\" |No ceremony held due to the COVID-19 Pandemic in New York City\n|-\n|2019\n|Rick Kuperman & Jeff Kuperman, Alice By Heart\n| - Wesley Taylor, Alice By Heart- Irina Dvorovenko, The Beast in the Jungle\n|Smokey Joe’s Café\n|-\n|2018\n|Zach Morris & Jennine Willett, Ghost Light\n| - Monica Bill Barnes, One Night Only- Robbie Fairchild, Mary Shelley’s Frankenstein\n| Not Awarded\n|-\n|2017\n|Joshua Bergasse, Sweet Charity\n| - Lyrica Woodruff, ''Finian's Rainbow- Brandon Espinoza, Baghdaddy\n|Not Awarded\n|-\n|2016\n| - Connor Gallagher, The Robber Bridegroom\n- Paul McGill, The Legend Of Georgia McBride\n| - Robert Creighton, Cagney\n- Rumi Oyama, Sayonara\n|Not Awarded\n|}\n{| class=\"wikitable\"\n|+Film & Other Awards\n|\n|Lifetime Achievement Award\n|Outstanding Choreography in a Feature Film\n|Outstanding Direction of a Dance Documentary\n|-\n|2025\n|Ben Vereen\n| Sh’ma: A Story of Survival, Suki John\n|A Resilient Man, Stephane Carrel\n|-\n|2024\n|Bernadette Peters\n| Barbie, Jennifer White\n|Lift, David Petersen\n|-\n|2023\n|John Kander\n| 13: The Musical, Jamal Sims\n|Everybody Dance, Dan Watt\n|-\n|2022\n|Joel Grey\n| tick… tick… Boom!, Ryan Heffington, Ryan Spencer\n|First Try, Josh Prince\n|-\n|2021\n| colspan=\"3\" |No ceremony held due to the COVID-19 Pandemic in New York City\n|-\n|2020\n| colspan=\"3\" |No ceremony held due to the COVID-19 Pandemic in New York City\n|-\n|2019\n|Graciela Daniele\n| Mary Poppins Returns, Rob Marshall & John DeLuca\n|Moving Stories: Lives Transformed By Dance, Rob Fruchtman\n|-\n|2018\n| Carmen de Lavallade\n| The Greatest Showman, Shannon Holtzapffel, Ashley Wallen\n|Anatomy of a Male Ballet Dancer, David Barba, James Pellerito\n|-\n|2017\n|Tommy Tune\n| London Road, Javier de Frutos\n|Restless Creature, Linda Saffire, Adam Schlesinger\n|-\n|2016\n|Judith Jamison\n|Dave Scott, High Strung\n|Not Awarded''\n|}\nReferences\nExternal links\n*"
    }
  ]
}