{
  "content": [
    {
      "type": "text",
      "text": "# Choctaw in the American Civil War__disambig_1\n\nThe Choctaw in the American Civil War participated in two major arenas—the Trans-Mississippi and Western Theaters. The Trans-Mississippi had the Choctaw Nation. The Western had the Mississippi Choctaw. The Choctaw Nation had been mostly removed west prior to the War, but the Mississippi Choctaw had remained in the east. Both the Choctaw Nation and the Mississippi Choctaw would ultimately side with the Confederate States of America.\nAfter thirty years of development, the Choctaw Nation had begun to flourish in their new western environment. Their economic system was identical as the American South and based upon slave labor. Their upper class was engaged in the cotton trade with networks reaching as far as New Orleans. Confederate envoy Albert Pike successfully persuaded much of \"Indian Country\" to side with the newly formed Confederate states. He conducted treaties for the Confederacy and later commanded a combined force of Choctaw, Cherokee, Chickasaw, Creek, and Seminole troops.\nThe Mississippi Choctaw led a tougher existence. Through treaty provisions, they elected to stay in Mississippi while the majority of the Indians moved west. By the time of the American Civil War, the Mississippi Choctaw were destitute and lived a sharecropper's existence. The most lucky of them had a patron who were sympathetic to their needs. Mississippi Choctaws were continually petitioning their grievances to U.S. authorities which were mostly ignored. Mississippian John W. Pierce and Alabamian Samuel G. Spann organized the Mississippi Choctaw. They were both wealthy white planters and had experience with the Indians from Mississippi.\nBackground\nThe Choctaw Nation had removed west of the Mississippi River after the signing of the Treaty of Dancing Rabbit Creek in 1830. After three decades, the nation had become successful in establishing itself in its new country. They made considerable progress in agriculture and education with most of the farm labor being done by slaves. By 1860, the Choctaw Nation lived in a relatively calm and remote society. Many Indian citizen members had become successful farmers, planters, and business men. Angie Debo, author of The Rise and Fall of the Choctaw Republic, wrote: \"Taken as a whole the generation from 1833 to 1861 presents a record of orderly development almost unprecedented in the history of any people.\"\n}}\nTribal members had become successful cotton planters—owning many slaves. The most famous Choctaw planter was Robert M. Jones. He was part Choctaw and had become influential in politics. Jones eventually supported the Confederacy and became a non-voting member in the Confederacy's House of Representatives. Jones was key for steering the Choctaw Nation in an alliance with the Confederacy.\nLincoln and Indian Affairs\nAbraham Lincoln considered Indian affairs a low priority when compared to the secession crisis. Lincoln's administration focused their efforts on American military confrontations of early 1861. They had little time to consider the Indian's role in the coming conflict. However, certain general attitudes protrude and explains the administrations' ambivalence toward the Indian. Lincoln and his polity considered the Indian a \"dying race.\" A U.S. senator once remarked, \"It is dying through natural causes growing out of its contact with a superior race inhabiting the same country.\" As soon as the Civil War began, Lincoln's government abandoned Indian Country. By May 18 of 1861, U.S. military posts were abandoned leaving tribes with \"no alternative but to join the South.\"\nReasons why the Choctaw sided with the Confederacy\nIn early February 1861, the Choctaw Nation's General Council instructed their delegates in Washington City to deposit their invested funds in southern banks, if necessary. A few days later, the council elected 12 delegates to meet with the Chickasaw at Boggy Depot, Choctaw Nation. In April, Choctaw officials at Washington City assured Unionists that the Choctaw Nation was to remain neutral. However, by June 1861 the Choctaw Nation had declared itself free and independent and appointed commissioners to make an alliance with the Confederacy.\nChoctaw Nation\nSeveral reasons explain why the Indians sided with the Confederacy: (1) They believed the United States was on the verge of collapse, (2) They were neglected by the United States, (3) William H. Seward, the United States Secretary of State, advocated the seizing of Indian lands, (4) Their main agent was an advocate for the South, and (5) Their laws supported slavery.\nMississippi Choctaw\nThe Indians in Mississippi had different reasons when siding with the Confederacy. (1) One of their main reasons included neglect. For decades Mississippi Choctaws petitioned the United States for grievances concerning the allocation of land grants provided in Article 14 of the Treaty of Dancing Rabbit Creek. A large number of cases was brought before U.S. courts but most went unheard. Some Choctaw may have been enticed to side with the Confederacy as a possible solution to their land grant problems. (2) Another reason included conscription. Although a few Indians volunteered, a majority of Mississippi Choctaw soldiers were conscripted into service. (3) Financial incentives may have been another reason. Fifty dollars bounty was offered to Mississippi Choctaws who enrolled with the Provisional Army of the Confederate States. (4) Some Indians may have wanted prestige within their tribe. Many Indian societies encouraged their warriors to succeed in battle to advance in their social hierarchy which was a requirement if they wanted positions of leadership.\nTrans-Mississippi Theater\nAt the beginning of the American Civil War, Albert Pike was appointed as Confederate envoy to Native Americans. In this capacity he negotiated several treaties, one such treaty was the Treaty with Choctaws and Chickasaws conducted in July 1861. The treaty covered sixty-four terms covering many subjects like Choctaw and Chickasaw nation sovereignty, Confederate States of America citizenship possibilities, and an entitled delegate in the House of Representatives of the Confederate States of America .\nConfederate battalions were soon formed in Indian Territory and later in Mississippi. The Choctaws, who were expecting support from the Confederates, got little. Webb Garrison, a Civil War historian, describes their response: when Confederate Brigadier General Albert Pike authorized the raising of regiments during the fall of 1860, Creeks, Choctaws, and Cherokees responded with considerable enthusiasm. Their zeal for the Confederate cause, however, began to evaporate when they found that neither arms nor pay had been arranged for them. A disgusted officer later acknowledged that \"with the exception of a partial supply for the Choctaw regiment, no tents, clothing, or camp and garrison equippage was furnished to any of them.\"\nFirst Choctaw and Chickasaw Mounted Rifles\nOn August 1 of 1861, President Jefferson Davis was notified that the First Choctaw and Chickasaw Mounted Rifles was prepared for battle. They were under the command of Colonel Douglas H. Cooper. The regiment consisted of six Choctaw companies, three Chickasaw companies, and one \"half-breed\" company.\nThe First Choctaw and Chickasaw Mounted Rifles were \"tardy\" and missed the opportunity to engage at the Battle of Pea Ridge. Historian Annie H. Abel wrote that the Choctaws, Chickasaws, and Creeks, \"were both fortunate and unfortunate in thus tardily arriving upon the scene. They had missed the fight but they had also missed the temptation to revert to the savagery that was soon to bring fearful ignominy upon their neighbors.\"\n(Battice's) First Choctaw Battalion Cavalry\nFaunceway Baptiste was a Lieutenant Colonel.\nFranceway Battice (Francois Baptiste or Faunceway Baptiste) became lieutenant colonel for the First Choctaw Battalion Cavalry from the Choctaw Nation. Simpson N. Folsom became the major. At one point, the battalion consisted of three companies. When the battalion was dismissed, Battice and Folsom were given their own commands.\n(McCurtain's) First Choctaw Battalion Cavalry\nIn 1862, Jackson McCurtain became the Lieutenant Colonel of McCurtain's First Choctaw Battalion from the Choctaw Nation (Indian Territory). The First Choctaw Battalion eventually reorganized as the Third Choctaw Regiment. McCurtian's First Choctaw Battalion should not be confused with the 1st Choctaw Battalion that was organized in Mississippi under the leadership of John W. Pierce.\nFirst Choctaw War Regiment\nFranceway Battice (Francois Baptiste or Faunceway Baptiste) led this unit as the First Choctaw Battalion Cavalry which may have had 216 men. Battice resigned in early 1862. After Battice's resignation, the battalion reorganized as the First Choctaw War Regiment.\nFirst Choctaw Regiment\nThe First Choctaw Regiment was organized in early 1862. The unit participated in many skirmishes. It saw action at the first Battle of Newtonia. A total of 31 officers and 686 soldiers served until June 1865. Colonel Sampson Folsom, Lieutenant Colonel David F. Harkins, and Major Sylvester Durant were the leading officers. This regiment has been referred to as the \"1st Regiment, Choctaw Mounted Rifles,\" \"First Choctaw (new) Regiment,\" \"First Choctaw Mounted Rifles,\" and \"1st Choctaw Cavalry Regiment.\"\nSecond Choctaw Regiment\nIn late 1864, the Second Choctaw Regiment was led by Colonel Simpson N. Folsom. This unit later joined Colonel Tandy Walker's Second Indian Cavalry Brigade during a reorganization.\nwas a member of the First Choctaw and Chickasaw Mounted Rifles, his First Choctaw Battalion Cavalry, and the Third Choctaw Regiment]]\nThird Choctaw Regiment\nIn June 1861, Jackson McCurtain enlisted in the First Choctaw and Chickasaw Mounted Rifles. He was commissioned Captain of Company G under the command of Colonel Douglas H. Cooper of the Confederate Army. In 1862, he became a Lieutenant Colonel of McCurtain's First Choctaw Battalion from the Choctaw Nation, not to be confused with John W. Pierce's 1st Choctaw Battalion in Mississippi. McCurtain's First Choctaw Battalion was reorganized as the Third Choctaw Regiment.\nChoctaw Warriors Regiment\nGeorge E. Deneale was the commanding officer of the Choctaw Warriors Regiment (Deneale's Regiment or Choctaw Virginia Regiment). Deneale was from Rockingham, Virginia and served in the Virginia legislature. In early 1862, he recruited in the Choctaw Nation. About 400 Choctaws were enrolled. Deneale envisioned his regiment in the Eastern Theater. It is unlikely the regiment served in the Eastern Theater.\n}}\nChoctaw Company\nEdmund Pickens, or Okchantubby, was the captain of this company of Choctaws who were likely mounted. Pickens was part Chickasaw.\nChoctaw Infantry Company\nJohn Wilkins was captain of the Choctaw Infantry Company.\nIndian Cavalry Division\nBrigadier General Douglas H. Cooper was in command of this division. The division had the First (Indian) Brigade, Second (Indian) Brigade, Seventh Mounted Artillery Battalion, and a couple of unattached units. Brigadier General Stand Watie commanded the first, and Colonel Tandy Walker commanded the second. Watie's unit had Cherokee, Creek, Osage, and Seminole Indians while Walker's unit had Choctaw, Chickasaw and Caddo Indians. The remainder of the division had non-Indian members.\nOrganization\nThe Choctaw and Chickasaw Nations were organized into several companies, battalions, and regiments. The Choctaws had three units labeled 1st Choctaw Battalion. Jackson F. McCurtian's 1st Choctaw Battalion was raised in the Choctaw Nation. McCurtain's organization was later re-organized as the Third Choctaw Regiment. Franceway Battice (Francois Baptiste) also raised a unit called the 1st Choctaw Battalion (Cavalry) from the Choctaw Nation. Battice's battalion was later re-organized as the First Choctaw War Regiment. John W. Pierce's 1st Choctaw Battalion was raised in Mississippi and never saw action in the Trans-Mississippi Theater. Pierce's Mississippi Choctaws operated in Mississippi and Louisiana.\n*First Choctaw and Chickasaw Mounted Rifles\n**Field & Staff: Colonel Douglas H. Cooper, Lieutenant Colonel James Riley, Lieutenant Colonel Tandy Walker, Major Willis J. Jones, Major Mitchell LeFlore, Major Stephen Loering, T. M. Colley (Surgeon), F. W. Miner (A.Q.M.), Douglas H. Cooper Jr. (Adjutant), and William Cass (Chaplain)\n**Companies: Company A (Captain Adam Nail), Company B (Captain Thomas H. Benton), Company C (Captain Willis Jones), Company D (Captain Peter Matubbee), Company E (Captain John Levi), Company F (Lieutenant Mitchell McCurtain), Company G (Captain Jackson McCurtain), Company H (Captain Joseph R. Hall), Company I (Captain E. Dewnt), and Company K (Captain Ish kate ne homma)\n**Total: 1,400 men\n*First Choctaw Battalion Cavalry\n**Lieutenant Colonel Franceway Battice (Francois Baptiste or Faunceway Baptiste), Major Simpson N. Folsom\n*First Choctaw Battalion Cavalry\n**Lieutenant Colonel Jackson McCurtain\n*First Choctaw War Regiment (formed from Battice's 1st Choctaw Battalion Cavalry)\n**Lieutenant Colonel Franceway Battice (Francois Baptiste or Faunceway Baptiste)\nwas acting-governor for the Choctaw Nation from 1858 to 1859 and served as a colonel for the Second Indian Brigade during the War.]]\n*First Choctaw Regiment\n**Field & Staff: Colonel Sampson Folsom, Lieutenant Colonel David F. Harkins, and Major Sylvester Durant\n**Companies: Company A (Captain Fla tubbee), Company B (Captain John Gibson), Company C (Captain Alfred Wade), Company D (Captain Martin Folsom), Company E (Captain Reson Jones), Company F (Captain Ok la bi), Company G (Captain Coleman E. Nelson), Company H (Captain Joseph Moor), Company I (Captain Sinta Nowa or Walking Snake), and Company K (Captain Edmond Gardner)\n*Second Choctaw Regiment (formed from Battice's 1st Choctaw Battalion Cavalry)(organizational life: 1862-June 1865)\n**Colonel Simpson N. Folsom\n*Third Choctaw Regiment (formed from McCurtain's 1st Choctaw Battalion Cavalry)\n**Field & Staff: Colonel Jackson McCurtain, Lieutenant Colonel Tom Lewis, Ellis W. Folsom (Adjutant)\n*Choctaw Warriors Regiment (Deneale's Regiment)\n**Field & Staff: Colonel George E. Deneale\n**Companies: Company A (Captain Washington Hudson), Company B (Captain J. E. Hamilton), Company C (Captain Jack Shoat), Company D (Captain Ho Tubbee), and Company E (Lieutenant George Speaker)\n*Choctaw Company\n**Captain Edmund Pickens or Okchantubby\n*Wilkins' Company (Choctaw Infantry)\n**Captain John Wilkins\n*Indian Cavalry Division\n**Field & Staff: Brigadier General Douglas H. Cooper\n**First (Indian) Brigade\n***Field & Staff: Brigadier General Stand Watie\n****1st Cherokee (Colonel Robert C. Parks), 2nd Cherokee (Colonel William P. Adair), Cherokee Battalion (Major Joseph A. Scales), 1st Creek (Colonel Daniel N. McIntosh), 2nd Creek (Colonel Chilly McIntosh), Creek Squadron (Captain R. Kenard), 1st Osage Battalion (Major Broke Arm), and the 1st Seminole Battalion (Lieutenant Colonel John Jumper)\n**Second (Indian) Brigade\n***Field & Staff: Colonel Tandy Walker\n****1st Chickasaw Battalion (Lieutenant Colonel Lemuel M. Reynolds), 1st Choctaw Battalion (Lieutenant Colonel Jackson McCurtain), 1st Choctaw and Chickasaw Battalion (Lieutenant Colonel James Riley), 2nd Choctaw (Colonel Simpson N. Folsom), and a reserve Caddo Squadron (Captain George Washington)\n**Seventh Mounted Artillery Battalion\n***Field & Staff: Captain W. Butler Krumbharr\n****Dashinell's (Texas) Battery (Captain George R. Dashiell), Krumbhaars (Texas) Battery (Lieutenant W. M. Stafford), and Howell's (Texas) Battery (Captain Sylvanus Howell)\n**Unattached\n***20th Texas (Major John R. Johnson), and the 1st Battalion Texas Sharpshooters (Major James Burnet)\nBattles, skirmishes, and other actions\n*Battle of Round Mountain (November 19, 1861)\n*Battle of Chusto-Talasah (December 9, 1861)\n*Battle of Pea Ridge (March 6–8, 1862)\n*First Battle of Newtonia (September 30, 1862)\n*Battle of Old Fort Wayne (October 22, 1862)\n*Battle of Honey Springs (July 17, 1863)\n*Battle of Perryville (Indian Territory) (August 23, 1863)\n*Battle of Middle Boggy Depot (February 13, 1864)\n*Battle of Poison Spring (April 18, 1864)\n*Battle of Marks' Mills (April 25, 1864)\n*Ambush of the steamboat J. R. Williams (June 15, 1864)\nWestern Theater\nIn 1861, a Mississippi citizen attempted to raise a volunteer Choctaw company for the Confederacy. The Newton Record, a newspaper based in central Mississippi, reported in 1903 that \"many Choctaws volunteered\" in 1861.\n}}\nIn the summer of 1862, eighty-two Mississippians filed a petition to Mississippi Governor John J. Pettus. The petitioners urged the conscription of the Indians. In that petition, John Harrison, a white planter, was noted to have enrolled about two companies of the Indians. Harrison's Indian companies likely merged with John W. Pierce's unit. John W. Pierce and Samuel G. Spann, both of whom were white planters, organized the Mississippi Choctaw as Confederates starting in 1862.\nPierce and Spann created two distinct & separate units that had common members. The Indian troop's first mission was to track down deserters—most found in Jones County; however, S. G. Spann was aware of their potential for scouting and use of guerrilla warfare. Pierce's troops were conscripted for tracking deserters in Jones County and surrounding areas, but Pierce's Indian troops were soon found in battles in Louisiana along the New Orleans, Jackson and Great Northern Railroad.\n1st Choctaw Battalion\n, whose American Indian name was Eahantatubbee or \"He Who Goes Out And Kills,\" was a Confederate soldier from the state of Mississippi.]]\nPresident Jefferson Davis endorsed the 1st Choctaw Battalion in February 1863. They were under the command of Major John W. Pierce, served in the department of Lieutenant General John C. Pemberton, and were placed in Brigadier General John Adams's 4th District. The battalion was headquartered at Newton Station, Mississippi. Only two companies were mustered - companies A and B. A total of 101 men were mustered in March, 1863. The battalion formed in February and disbanded in May 1863. Members would later transfer to Spann's command in late August 1863.\nAfter the Chunky Creek Train Wreck happened in February 1863, the Choctaw soldiers, who were recruited days/weeks earlier, led rescue and recovery efforts. Spann wrote many years later that \"the passengers were rescued due to their heroic acts.\"\nAs the war progressed, Indian troops were sent to Louisiana as reinforcements to Colonel Horace H. Miller's command at Ponchatoula in March 1863. The newspapers of the time gave the \"Indian troops\" credit for pushing back the Yankees during the Battle of Ponchatoula. After the battle, a large number of the Indians deserted due to non-payment for their services. During or after Grierson's Raid in April/May 1863, more of the Indian members of the 1st Choctaw Battalion likely fled.\nDuring a federal offensive, soldiers, both white and Indian, of the 1st Choctaw Battalion were captured near Ponchatoula, Louisiana, and the Indian prisoners were soon shipped via steamship to Castle Williams near New York City. The Indian prisoners were displayed for the entertainment of New Yorkers at Madison Park. At least two Indian prisoners died while they were incarcerated at the Union prison on Governors Island. Spann describes the incident, \"New Orleans at that time was in the hands of the Federal Gen. B.F. Butler. Without notice a reconnoitering party of the enemy raided the camp, and captured around two dozen Indians and one commissioned white officer and carried them to New Orleans. Some of the officers and several of the Indians escaped and returned to the Newton County camp; but all the balance of the captured Indians were carried to New York, and were daily paraded in the public parks as curiosities for the sport of sight-seers.\"\nThe 1st Choctaw Battalion was ordered to disband on May 9, 1863. After a number of 1st Choctaw Battalion members were captured near Ponchatoula on May 13 of 1863, the troops petitioned government officials at Richmond to transfer to Spann's Battalion of Independent Scouts.\nSpann's independent scouts\nSamuel G. Spann was a Dallas County, Alabama planter when the War began. In the first year of the war, he was a private in William Boyles' Dragoons. After a year, he provided a substitute and joined General William J. Hardee's command as an aide. Spann was likely commissioned as a captain at the time.\nIn 1862, Spann contacted several Mississippi Choctaw Indian settlements to recruit for his new command. He likely met with tribal headmen: Incoshubba, Oneshehatta, Tonubba, Meashomba, Tomashuba, and Luockhoma. While Spann was waiting for the Indians to recover from the measles, Spann joined Hardee for the campaign into Kentucky in the fall of 1862. Spann participated in the Battle of Perryville.\nSpann's headquarters were at Mobile, Alabama. Spann also had a recruiting camp in Newton County, Mississippi. As scouts in Spann's battalion, the Mississippi Choctaws served in the Tuscaloosa, Alabama area in fall 1863. Their likely role was to track conscripts for Brigadier General Gideon J. Pillow. Although Spann's Battalion of Independent Scouts was disbanded on November 6 of 1863, Spann continued service with his battalion of Choctaw Indians.\nOrganization\nMississippi Choctaws were enrolled in two separate and distinct battalions that had common members. The 1st Choctaw Battalion was based at Newton Station, Mississippi. Spann's Independent Scouts were at Mobile, Alabama. They later moved their headquarters to Tuscaloosa, Alabama. Spann's Independent Scouts were re-organized as Alabama's 18th Confederate Cavalry with only two companies remaining. All commissioned officers were white. The Indians had some non-commissioned officers, but most were privates. Captain John Harrison and his men fled to Jones County, Mississippi by April 1864.\n*1st Choctaw Battalion (organizational life: February 1863-May 1863)\n**Field & Staff: Major John W. Pierce, Captain Nathan W. Slay (Adjutant), Captain Edward B. Scanlan (A.Q.M.), Sergeant William H. Dunlap (Q.M.), and Dr. Albert H. Puckett (Surgeon)\n**Companies: Company A (Captain Nathan W. Slay, Captain Simon F. Williams) and Company B (Captain Benjamin F. Duckworth)\n**Total: 101 men\n*Spann's Independent Scouts (organizational life: April 1863-November 1863)\n**Field & Staff: Major Samuel G. Spann, Lieutenant Edward M. Keith (Drill Master), Captain John C. Ransom (A.Q.M.), Captain William H. Jemison (A.Q.M.), and Sergeant William H. Dunlap (Q.M.)\n**Companies: Company A (Captain James M. Tindel), Company B (Captain John C. Moore), Company C (Captain Malcolm M. Burke), and Company D (Captain John G. Harrison)\n*Alabama's 18th Confederate Cavalry (organizational life: November 1863-June 1865)\n**Field & Staff: Major Samuel G. Spann\n**Companies: Company (Captain John C. Moore) and Company (Captain John G. Harrison)\nBattles, skirmishes, and other actions\n*Rescue & Recovery at the Chunky Creek (February 19, 1863)\n*Battle of Ponchatoula (March 24–26, 1863)\n*Conscription Operations (September–November, 1863)\nAftermath\nAfter years of warfare, the Choctaws in the Trans-Mississippi Theater become discouraged, and their support for the Confederacy waned. Lieutenant Colonel Jackson McCurtain anticipated a disastrous division within the nation, so he wrote to Brigadier General John McNeil hoping to make peace. McCurtain felt it would be impossible \"to turn over\" all Choctaws \"at the same time.\" However, given enough time, he felt that a surrender would succeed.\nHowever, the Choctaw Nation was still dedicated to the Confederacy. A few citizens had become loyal to the Union and declared a new governor for the Choctaw Nation. They wanted recognition from the United States government, but the Union would not recognize their efforts at appeasement because the nation was \"still de facto rebel.\" The Choctaws continued their support for the Confederacy until its collapse.\nTrans-Mississippi Theater\nOn June 19, 1865, Principal Chief Peter P. Pitchlynn surrendered the military at Doaksville, Choctaw Nation. The Choctaws laid down their arms, and the Union took control of the territory until a formal peace treaty was signed.\nThe following spring a Reconstruction treaty was drawn up by the United States. The Southern Treaty Commission crafted the 1866 Treaty with the Choctaw and Chickasaw. The treaty had 51 articles. Some provisions in brief included:\n* declaration of permanent peace,\n* amnesty granted for siding with Confederate States of America,\n* slavery abolishment.\nThe Choctaw delegation included Campbell LeFlore, John Page, James Riley, Alfred Wade, and Allen Wright. Also present were Peter P. Pitchlynn, Douglas H. Cooper, and Chickasaw delegates. The treaty was proclaimed in July 1866.\nWestern Theater\nIn Meridian, Mississippi and Tuscaloosa, Alabama, the Indian Confederates surrendered after several years of service in the Confederacy. Some individuals may have served as early as 1861. Jack Amos, in his Mississippi pension, stated that he first enrolled in April 1861. The last of the Indian Confederates surrendered in May 1865.\nDecades after the War, many Confederate veterans established U.C.V camps. Spann was elected commander of U.C.V. Camp Dabney H. Maury in Newton, Mississippi. John Blakeley, a white teenager during the War, was made camp adjutant and wrote about the Choctaw soldiers.\nBlakeley wrote in The Meridian Press, a Meridian, Mississippi newspaper, concerning the few surviving Indian members of Camp Maury. He wrote: \"On the first Saturday in February, 1901, Camp No. 1312 was organized with ... nineteen Indian braves ... If there is enough interest yet felt by our people for these unfortunate and only genuine Americans yet remaining in Mississippi and of noble record, will it be too much to ask you to please hand this to your excellent paper, the Press, and send a copy of it to Camp Dabney H. Maury.\"\nThe veterans attended many national reunions. In 1903, Spann and some Indian veterans attended the New Orleans reunion. At the New Orleans reunion, Jack Amos was interviewed by a Louisiana journalist.\n}}\nJack Amos died a few years later in 1906.\nReconstruction\nReconstruction was particularly harsh for the Indian nations found west of the Mississippi. The Choctaw Nation was facing calamity with the loss of vast tracts of land, the \"unrestricted colonization of freedmen among them,\" and the end of their autonomous tribal government.\nNot long after emancipation, the Choctaw Freedmen were \"homeless and penniless.\" Very few were literate which made them \"helpless and dependent.\"\nCommemoration\nU.C.V. Camp Dabney H. Maury was planning to erect a monument for the Mississippi Choctaws participation during the Civil War. However, this didn't happen for unknown reasons. But, state markers were placed in many of these historic areas decades after Camp Maury attempted to place a monument.\nSee also\n*Native Americans in the American Civil War\n*Indian Territory in the American Civil War\nReferences\nExternal links\n* [http://www.nchgs.org/html/train_wreck_1863.html Newton County, Mississippi Historical and Genealogical Society: The Chunky Creek Train Wreck of 1863]\n* [http://www.nchgs.org/html/jack_amos_e-aht-onte-ube.html Newton County, Mississippi Historical and Genealogical Society: Jack Amos Newton County Citizen]"
    }
  ]
}