{
  "content": [
    {
      "type": "text",
      "text": "# Christianity in the 8th century\n\nAge of the Caliphs\nChristianity in the 8th century was much affected by the rise of Islam in the Middle East.\nBy the late 8th century, the Muslim empire had conquered all of Persia and parts of the Eastern Roman (Byzantine) territory including Egypt, Palestine, and Syria. Suddenly parts of the Christian world were under Muslim rule. Over the coming centuries the Muslim nations became some of the most powerful in the Mediterranean basin.\nThough the Roman Church had claimed religious authority over Christians in Egypt and the Levant, in reality the majority of Christians in these regions were miaphysites and other sects that had long been persecuted by Constantinople.\nSecond Council of Nicea\nAndrei Rublev's [[Trinity ]]\nThe Second Council of Nicea was called under Empress Irene in 787. It affirmed the making and veneration of icons while also forbidding the worship of icons and the making of three-dimensional statuary. It reversed the declaration of the earlier Council of Hieria that had called itself the Seventh Ecumenical Council and also nullified its status.\nSometime between 726 and 730 the Byzantine Emperor Leo III the Isaurian ordered the removal of an image of Jesus prominently placed over the Chalke gate, the ceremonial entrance to the Great Palace of Constantinople, and its replacement with a cross. This was followed by orders banning the pictorial representation of the family of Christ, subsequent Christian saints, and biblical scenes. The Council of Hieria had been held under the iconoclast Emperor Constantine V. It met with more than 340 bishops at Constantinople and Hieria in 754, declaring the making of icons of Jesus or the saints an error, mainly for Christological reasons.\nIconoclasm\nIconoclasm was a movement within the Eastern Christian Byzantine church to establish that the Christian culture of portraits of the family of Christ and subsequent Christians and biblical scenes were not of a Christian origin and therefore heretical. This movement was later defined as heretical under the council. The group destroyed much of the Christian churches' art history, which is needed in addressing the traditional interruptions of the Christian faith and the artistic works that in the early church were devoted to Jesus Christ or God. Many works were destroyed during this period.\nTwo prototypes of icons would be the Christ Pantocrator and the Icon of the Hodegetria. In the West the tradition of icons have been seen as the veneration of \"graven images\" or against \"no graven images\" as noted in Exodus 20:4. From the Orthodox point of view graven then would be engraved or carved. Thus this restriction would include many of the ornaments that Moses was commanded to create in the passages right after the commandment was given i.e. the carving of cherubim Exodus 26:1. The commandment as understood by such out of context interpretation would mean \"no carved images\". This would include the cross and other holy artifacts. The commandment in the East is understood that the people of God are not to create idols and then worship them. It is \"right worship\" to worship which is of God, which is Holy and that alone.[http://www.protomartyr.org/image.html No Graven Image]\nJohn of Damascus\n* Patriarch Germanus I of Constantinople\n* John of Damascus\nwith popes Gelasius I and Gregory the Great]]\nJohn of Damascus\nIn the Roman Catholic Church, St. John of Damascus, who lived in the 8th century, is generally considered to be the last of the Church Fathers and at the same time the first seed of the next period of church writers, scholasticism.\nTensions between East and West\nIn the early 8th century, Byzantine iconoclasm became a major source of conflict between the Eastern and Western parts of the Church. Byzantine emperors forbade the creation and veneration of religious images. Other major religions in the East such as Judaism and Islam had similar prohibitions. Pope Gregory III vehemently disagreed.\nSpread of Christianity\nAnglo-Saxons\nThe Germanic peoples underwent gradual Christianization in the course of Late Antiquity and the Early Middle Ages. By the 8th century, most of Anglo-Saxon England and the Frankish Empire was de jure Christian.\nIn the 8th century, the Franks became standard-bearers of Roman Catholic Christianity in Western Europe, waging wars on its behalf against Arian Christians, Islamic invaders, and pagan Germanic peoples such as the Saxons and Frisians. Until 1066, when the Dane and the Norse had lost their foothold in Britain, theological and missionary work in Germany was largely organized by Anglo-Saxon missionaries, with mixed success. A key event was the felling of Thor's Oak near Fritzlar by Boniface, apostle of the Germans, in 723.\nEventually, the conversion was imposed by armed force and successfully completed by Charlemagne and the Franks in a series of campaigns, starting in 772 with the destruction of their Irminsul and culminating in the defeat and massacre of Saxon leaders at the Bloody Verdict of Verden in 782 and the subjugation of this large tribe.\nFrankish Empire\nCharlemagne, the Frankish monarch who unified much of [[Western Europe and re-established the authority of the Roman Church in the West]]\nBy the 8th century, the Frankish Kingdom, a Germanic kingdom that had originated east of the Rhine, ruled much of western Europe, particularly in what is now France and Germany. The first Frankish king, Clovis had joined the Roman Church in 496 and since that time the Franks had been part of the Church. In 768 Charles, son of King Pepin the Short, succeeded to the Frankish throne. During the 770s Charles the Great conquered the Lombards in Italy extending the Frankish realm over almost all of Italy. On Christmas Day in 800, the Roman Patriarch Leo III crowned Charles as the Roman Emperor, in essence denying the status of the Roman Empress Irene, reigning in Constantinople. This act caused a substantial diplomatic rift between the Franks and the Eastern Romans, as well as between Rome and the other patriarchs in the East.\nChristian missionaries to the Frankish Empire include:\n*Saint Boniface\n*Saint Walpurga, Saint Willibald and Saint Winibald (English siblings assisting Boniface)\n*Wilfrid\n*Willibrord\n*Willehad of Bremen\n*Lebuinus\n*Saint Ludger\n*Suitbert of Kaiserwerdt\n*Saint Pirmin\n*Saint Corbinian\nScandinavia\nAlthough the Scandinavians became nominally Christian in the 8th century, it took considerably longer for actual Christian beliefs to become established among the people. The old indigenous traditions that had provided security and structure since time immemorial were challenged by ideas that were unfamiliar, such as original sin, the Trinity and so forth. Archaeological excavations of burial sites on the island of Lovön near modern-day Stockholm have shown that the actual Christianization of the people was very slow and took at least 150–200 years, and this was a very central location in the Swedish kingdom. At this time, enough knowledge of Norse mythology remained to be preserved in sources such as the Eddas in Iceland.\nNetherlands and non-Frankish Germany\nIn 698 the Northumbrian Benedictine monk, Saint Willibrord was commissioned by Pope Sergius I as bishop of the Frisians in what is now the Netherlands. Willibrord established a church in Utrecht.\nMuch of Willibrord's work was wiped out when the pagan Radbod, king of the Frisians destroyed many Christian centres between 716 and 719. In 717, the English missionary Boniface was sent to aid Willibrord, re-establishing churches in Frisia and continuing to preach throughout the pagan lands of Germany.  Boniface was killed by pagans in 754.\nChina\nThe Xi'an Stele was constructed in 781 as a monument to 150 years of early Christianity in China. It was buried in the ninth century during religious suppression and lay underground until it was discovered in 1625. The top of the monument is adorned not only with a cross but also with the Buddhist emblem of the lotus and the Taoist symbol of the cloud. The writer of the inscription was Jingjing (monk), a monk of the \"Luminous Religion,\" as well as Buddhism and the calligraphist was Huangbo Xiyun (these two are thought to have later collaborated on some Buddhist writing). It's unclear whether they were commentators or followers of Christianity.\nChristianity and Islam\nMissionary expansion\nOnce the Christian faith had been established in the valleys of the Oxus and Jaxartes Rivers, it was easily carried further east into the basin of the Tarim River, then into the area north of the Tien Shan Mountains, and finally down into far northwest China, above Tibet. This was the principal caravan route, and with so many Christians engaged in the trade it was natural that the gospel was early planted in the towns and cities which were caravan centers. The Mesopotamian patriarch in the 8th century wrote that he was appointing a metropolitan for Tibet, implying that their churches were numerous enough to require bishops and lesser clergy. Thus Christians were to be found in Xinjiang, and possibly in Tibet, as early as the 9th century. But it was not until the beginning of the 11th century that the faith spread among the nomadic peoples of this and other central Asian regions. These Christians were chiefly Turko-Tatar peoples, including the Keraites, Onguts, Uyghurs, Naimans, Merkits, and Mongols.\nIberian Peninsula and the Reconquista\nThe interiors of the Alhambra in [[Granada, Spain decorated with arabesque designs.]]\nBetween 711 and 718 the Iberian Peninsula had been conquered by Muslims in the Umayyad conquest of Hispania; between 722 and 1492 the Christian kingdoms that later would become Spain and Portugal reconquered it from the Moorish states of Al-Ándalus.\nThe Spanish Inquisition and Portuguese Inquisition were not installed until 1478 and 1536 when the Reconquista was already (mostly) completed.\nThe Arabs, under the command of the Berber General Tarik ibn Ziyad, first began their conquest of southern Spain or al-Andalus in 711. A raiding party led by Tarik was sent to intervene in a civil war in the Visigothic kingdom in Hispania. Crossing the Strait of Gibraltar, it won a decisive victory in the summer of 711 when the Visigothic king Roderic was defeated and killed on July 19 at the Battle of Guadalete. Tariq's commander, Musa bin Nusair quickly crossed with substantial reinforcements, and by 718 the Muslims dominated most of the peninsula. There are some later Arabic and Christian sources present an earlier raid by a certain Ṭārif in 710 and one, the Ad Sebastianum recension of the Chronicle of Alfonso III, refers to an Arab attack incited by Erwig during the reign of Wamba (672&ndash;680). and two reasonably large armies may have been in the south for a year before the decisive battle was fought.\nThe rulers of Al-Andalus were granted the rank of Emir by the Umayyad Caliph Al-Walid I in Damascus. After the Abbasids came to power in the Middle East, some Umayyads fled to Muslim Spain to establish themselves there.\nTimeline\nSee also\n*History of Christianity\n*History of the Roman Catholic Church\n*History of the Eastern Orthodox Church\n*History of Christian theology\n*History of Oriental Orthodoxy\n*Church Fathers\n*List of Church Fathers\n*Christian monasticism\n*Patristics\n*Christianization\n*History of Calvinist-Arminian debate\n*Timeline of Christianity\n*Timeline of Christian missions\n*Timeline of the Roman Catholic Church\n*Chronological list of saints in the 8th century\nNotes and references\nFurther reading\n* Lawrence, C. H. Medieval Monasticism. 3rd ed. Harlow: Pearson Education, 2001.\n*Kaplan, Steven 1984 Monastic Holy Man and the Christianization of Early Solomonic Ethiopia (in series Studien zur Kulturkunde)\n*Fletcher, Richard, The Conversion of Europe. From Paganism to Christianity 371-1386 AD. London 1997.\n*Padberg, Lutz v., (1998): Die Christianisierung Europas im Mittelalter, Stuttgart, Reclam (German)\nExternal links\n*[http://www.ccel.org/ccel/schaff/npnf214.html Schaff's The Seven Ecumenical Councils]"
    }
  ]
}