{
  "content": [
    {
      "type": "text",
      "text": "# Christopher Ewart-Biggs\n\n|image              = Ewart-biggs.jpg\n|imagesize          = 220px\n|alt                =\n|order              =\n|ambassador_from    = British\n|country            = Ireland\n|monarch            = Elizabeth II\n|primeminister      = James Callaghan\n|term_start         = 9 July 1976\n|term_end           = 21 July 1976\n|predecessor        = Sir Arthur Galsworthy\n|successor          = Robin Haydon\n|birth_date         =\n|birth_place        = Thanet, Kent, England\n|death_date         =\n|death_place        = Sandyford, Dublin, Ireland\n|death_cause        = Assassination\n|party              =\n|otherparty         =\n|spouse             =\n*\n}}\n|relations          =\n|children           = 3, including Kate Ewart-Biggs\n|residence          =\n|education          = Wellington College\n|alma_mater         = University College, Oxford\n|occupation         =\n|profession         =\n|nickname           =\n|allegiance         = United Kingdom\n|branch             = British Army\n|serviceyears       =\n|rank               =\n|unit               = Royal West Kent Regiment\n|commands           =\n|battles            = Second World War\n* Second Battle of El Alamein\n|mawards            =\n}}\nChristopher Thomas Ewart Ewart-Biggs,  (5 August 1921 – 21 July 1976) was the British ambassador to Ireland, an author and senior Foreign Office liaison officer with MI6. He was killed in 1976 by the Provisional Irish Republican Army (IRA) in Sandyford, Dublin.\nHis widow, Jane Ewart-Biggs, became a Life Peer in the House of Lords, campaigned to improve Anglo-Irish relations and established the Christopher Ewart-Biggs Memorial Prize for literature.\nEarly life and career\nChristopher Thomas Ewart-Biggs was born in the Thanet district of Kent, England, to Captain Henry Ewart-Biggs of the Royal Engineers and his wife Mollie Brice. He was educated at Wellington College and University College, Oxford, and served in the Royal West Kent Regiment of the British Army during the Second World War. At the Second Battle of El Alamein in 1942 he lost his right eye and as a result he wore a smoked-glass monocle over an artificial eye. He spent the rest of the war and after (1943–7) as political officer in Jefren, Tripolitania, where he learned fluent Italian and some Arabic.\nEwart-Biggs joined the Foreign Service in 1949, serving in Lebanon, Qatar and Algiers, as well as Manila, Brussels and Paris.\nFollowing study at the Middle East Centre for Arabic Studies near Beirut, he was posted as political officer to Qatar (1951). In 1952 he married Gabrielle Verschoyle, and gained four stepchildren. The couple wrote a number of thrillers together using the pen name ‘Charles Elliott’ including Trial by Fire (1956). In 1959 she died in childbirth. He remarried (Felicity) Jane Randall on 5 May 1960. They had three children, Henrietta, Robin and Kate Ewart-Biggs.\nDeath\nEwart-Biggs was killed on 21 July 1976, at age 54, when his armoured Jaguar car, part of a four-vehicle convoy on its way to the British Embassy in Dublin, was thrown into the air by a land mine planted by the IRA. He had been taking precautions to avoid such an incident since coming to Dublin only two weeks before. Among the measures he employed was to vary his route many times a week but, at a vulnerable spot on the road connecting his residence to the main road, there was only a choice between left or right. He chose right, and, 317 yards down the road, the IRA remotely detonated 200 pounds of explosives hidden under a culvert. Ewart-Biggs and fellow passenger and civil servant Judith Cooke (aged 26) were killed. Driver Brian O'Driscoll and third passenger Brian Cubbon (the highest-ranking civil servant in Northern Ireland at the time) were injured. Republicans suggested Ewart-Biggs was targeted because of his intelligence connections though possibly Cubbon was the intended target. Two months after his murder, the IRA claimed responsibility and said that Ewart-Biggs had been sent to Dublin \"to co-ordinate British intelligence activities and he was assassinated because of that.\" The British Foreign Office dismissed the claim as nonsense.\nIt later emerged that the UK's Secretary of State for Northern Ireland, Merlyn Rees, had at the last minute been forced to cancel plans which would have placed him in the convoy. He was to travel to the Republic to consult with the ambassador and Irish ministers, but postponed his trip after Margaret Thatcher refused to allow Northern Ireland ministers to pair their votes with her Opposition members in House of Commons divisions. Rees wrote in his memoirs, Northern Ireland, a Personal Perspective, that it seemed likely the IRA had known of his impending visit but were unaware of its cancellation.\nInvestigation\nThe Irish government launched a manhunt involving 4,000 Gardaí and 2,000 soldiers. Taoiseach Liam Cosgrave declared that \"this atrocity fills all decent Irish people with a sense of shame.\" In London, the UK Prime Minister James Callaghan condemned the assassins as a \"common enemy whom we must destroy or be destroyed by\". Thirteen suspected members of the IRA were arrested during raids as the British and Irish governments attempted to apprehend the assassins, but no one was ever convicted of the killings. In 2006, released Foreign and Commonwealth Office files revealed that the Gardaí had matched a partial fingerprint at the scene to Martin Taylor, an IRA member suspected of gun running from the United States. Taylor denied involvement.\nSee also\n*List of Ambassadors of the United Kingdom to Ireland\nReferences\nExternal links\n*[https://www.rte.ie/archives/2016/0720/803675-search-for-british-ambassadors-assassins/ \"Christopher Ewart-Biggs Assassinated 1976\"], RTÉ News, 22 July 1976."
    }
  ]
}