{
  "content": [
    {
      "type": "text",
      "text": "# Christian Nationalist Crusade\n\nChristian Nationalist Crusade was an American political advocacy organization founded by Gerald L. K. Smith in 1947.  It nominated Smith for President in 1948 and Douglas MacArthur in 1952.\nThe Christian Nationalist Crusade promoted antisemitic and racist causes, including the sale and distribution of The International Jew. It subscribed to the antisemitic views embodied in The Protocols of the Elders of Zion which it also published. According to details published by the Library of Congress, Smith \"prepared\" The International Jew for publication, date possibly in the 1950s.\nAs much as the CNC was focused on political causes, it also served as a platform for promoting Christian Identity doctrine.\nHistory\nAfter being the presidential candidate for the America First Party in the 1944 election, Gerald L. K. Smith announced a renaming of the party to the Christian Nationalist Party in August, 1947. Also in 1947, Gerald L. K. Smith founded the Christian Nationalist Crusade in St. Louis, Missouri. Initially, Smith announced that the party would not nominate a candidate for the 1948 election.\nThe organization engaged in publication and distribution of texts advocating its views, and produced monthly magazine called The Cross and the Flag. Particular targets identified by its head, Gerald L. K. Smith, included radio commentator Drew Pearson, Hollywood communists, and jazz music.\nThe Christian Nationalist Crusade engaged in the circulation of petitions urging national action opposing desegregation.  As a political party, the Christian Nationalist Party unsuccessfully ran candidates in the Missouri general election of 1950.  The party nominated Douglas MacArthur for president in 1952. MacArthur's name appeared on the ballot in Missouri, where he received 535 votes, but without his endorsement.\nThe Rev. Alvin Mayall, of Bakersfield, Calif., headed the organization in 1968 when he also was named head of the Wallace-for-President campaign. Wallace campaign organizers concluded Mayall \"had far more interest in Jew-baiting than in electing George Wallace.\"\nThe organization moved its offices to Glendale, California, in 1953. Following Smith's death in 1976, control of the CNC passed to his nephew, Roland Lee Morgan.  As editor of The Cross and the Flag, Morgan shorted the publication's standard length, doubled the subscription price, and published mostly reprinted articles from Smith rather than new content.  In December 1977, Morgan moved the headquarters to Eureka Springs, Missouri.\nViews\nThe organization's purpose was to \"preserve America as a Christian nation being conscious of a highly organized campaign to substitute Jewish tradition for Christian tradition\". The Christian Nationalist Crusade opposed communism, world government and immigration. It also aimed to \"fight mongrelization and all attempts to force the intermixture of the black and White races\".\nThe organization advocated for the deportation of Zionists and blacks, and the dismantling of the United Nations and \"Jewish Gestapo organizations\".\nAs much as Smith and the Christian Nationalist Crusade were concerned with politics, they also sponsored events that were focused on Christian Identity doctrine. The organization held events that included Christian Identity figures such as Wesley A. Swift, Bertrand Comparet, and Conrad Gaard. Comparet also served as legal counsel, a planner for CNC events, and a contributor to The Cross and the Flag.\nSee also\n* Christian nationalism\n* Francis Alphonse Capell\nReferences\nFootnotes\nSources\n* }}\n*\n*\n*\n*\n*\n*\n*\n*\n*\nExternal links\n*Western Historical Manuscript Collection, University of Missouri-St. Louis [http://www.umsl.edu/~whmc/guides/whm0467.htm]"
    }
  ]
}