{
  "content": [
    {
      "type": "text",
      "text": "# Christian Historical Party\n\nThe Christian Historical Party (, CHP) was a conservative Reformed political party in the Netherlands which existed from 1903 to 1908.\nHistory\nThe CHP was founded in April 1903 as a merger of two conservative Protestant parties, the Free Anti Revolutionary Party and the Christian Historical Voters' League. Both had turned against the leadership and ideology of Abraham Kuyper, the leader of the main Protestant Anti-Revolutionary Party.  Kuyper had initiated a new political course for Protestantism in the Netherlands, which included cooperation with the Catholics in the Coalition, strategical support for the extension of suffrage, a rejection of theocracy in favour of a specific conception of state neutrality, sphere sovereignty and a strong party organization and party discipline. The opposition against Kuyper was led by Alexander de Savorin Lohman, who founded the Free Anti Revolutionary Party.\nIn 1908, the CHP merged with the Frisian League, another conservative Protestant party, to form the Christian Historical Union.\nName\nThe term \"Christian Historical\" was used before 1897 to denote supporters of the main Protestant party, the Anti-Revolutionary Party, emphasizing the Protestant nature of the history of the Netherlands.\nIdeology & Issues\nThe CHP was a conservative Protestant party. It viewed government as a God-given institution, which should act according to biblical norms. Society should furthermore follow its historical course. Power should not be based on the opinion of the majority but on authority.\nThe CHP was formed as a result of dissent within the main Protestant party, the Anti-Revolutionary Party (ARP). Unlike that party the CHP did not recognize Catholicism as a legitimate religion. The party was strong anti-papist. According to the CHP, the Netherlands was a Protestant nation. As such, it was hostile to the Catholic segment of society. It renounced the Coalition between the ARP and the Catholic General League and antithesis between religious and secular parties. Catholic influences within society should be limited.\nThe CHP advocated limited government. It supported only limited government interference in the economy and instead advocated charity to help the poor. Furthermore, the party opposed universal suffrage.\nRepresentation\nThis table shows the CHP's results in elections to the House of Representatives and Senate, as well as the party's parliamentary leader.\n{| class=\"wikitable sortable plainrowheaders\"\n! Year\n! HoR\n! S\n! Lead candidate\n! Cabinet\n|-\n|1903\n|10\n|3\n|Alexander de Savornin Lohman\n|supported the Kuyper cabinet\n|-\n|1904\n|10\n|3\n|Alexander de Savornin Lohman\n|opposition\n|-\n|1905\n|7\n|3\n|Alexander de Savornin Lohman\n|opposition\n|-\n|1906\n|8\n|3\n|Alexander de Savornin Lohman\n|opposition\n|-\n|1907\n|8\n|3\n|Alexander de Savornin Lohman\n|opposition\n|}\nElectorate\nThe electorate of the CHP was mainly constituted by adherents of the Dutch Reformed Church from the upper class, especially nobility, land owners, high officers and high-ranking civil servants. It won and kept seats in several districts with large reformed populations, Goes in Zeeland, Apeldoorn in Gelderland, Dokkum in Friesland, and Katwijk and Schiedam in South Holland.\nReferences"
    }
  ]
}