{
  "content": [
    {
      "type": "text",
      "text": "# Christianity in the 14th century\n\nin Slovakia.]]\nThe 14th century saw major developments in Christianity, including the Western Schism, the decline of the Crusades, and the appearance of precursors to Protestantism.\nInquisition\n.]]\nKing Philip IV of France created an inquisition for his suppression of the Knights Templar during the 14th century. King Ferdinand and Queen Isabella formed another in 1480, originally to deal with distrusted ex-Jewish and ex-Muslim converts. Over a 350-year period, this Spanish Inquisition executed between 3,000 and 4,000&nbsp;people, representing around two percent of those accused. The inquisition played a major role in the final expulsion of Islam from the kingdoms of Sicily and Spain. In 1482, Pope Sixtus IV condemned its excesses but Ferdinand ignored his protests. Historians note that for centuries Protestant propaganda and popular literature exaggerated the horrors of these inquisitions. According to Edward Norman, this view \"identified the entire Catholic Church&nbsp;...&nbsp;with [the] occasional excesses\" wrought by secular rulers.\nWestern Schism\nThe Western Schism, or Papal Schism, was a prolonged period of crisis in Latin Christendom from 1378 to 1416, when there were two or more claimants to the See of Rome and there was conflict concerning the rightful holder of the papacy. The conflict was political, rather than doctrinal, in nature.\nTo escape instability in Rome, Clement V in 1309 became the first of seven popes to reside in the fortified city of Avignon in southern France during a period known as the Avignon Papacy. For 69 years popes resided in Avignon rather than Rome. This was not only an obvious source of not only confusion but of political animosity as the prestige and influence of the city of Rome waned without a resident pontiff. The papacy returned to Rome in 1378 at the urging of Catherine of Siena and others who felt the See of Peter should be in the Roman church. Though Pope Gregory XI, a Frenchman, returned to Rome in 1378, the strife between Italian and French factions intensified, especially following his subsequent death.\nin Avignon, France.]]\nIn 1378 the conclave elected an Italian from Naples, Pope Urban VI; his intransigence in office soon alienated the French cardinals, who withdrew to a conclave of their own, asserting the previous election was invalid since its decision had been made under the duress of a riotous mob. They elected one of their own, Robert of Geneva, who took the name Pope Clement VII. By 1379, he was back in the palace of popes in Avignon, while Urban VI remained in Rome.\nFor nearly forty years, there were two papal curias and two sets of cardinals, each electing a new pope for Rome or Avignon when death created a vacancy. Efforts at resolution further complicated the issue when a third compromise pope was elected in 1409. The matter was finally resolved in 1417 at the Council of Constance where the cardinals called upon all three claimants to the papal throne to resign and held a new election naming Martin V pope.\nWestern theology\nScholastic theology continued to develop as the 13th century gave way to the fourteenth, becoming ever more complex and subtle in its distinctions and arguments. There was a rise to dominance of the nominalist or voluntarist theologies of men like William of Ockham.  The 14th century was also a time in which movements of widely varying character worked for the reform of the institutional church, such as conciliarism and Lollardy.  Spiritual movements such as the Devotio Moderna also flourished.\nNotable authors include:\n]]\n* Duns Scotus (1266-1308)\n* Ramon Lull (1232-1315)\n* Giles of Rome (1243-1316)\n* Dante Alighieri (1265-1321)\n* Meister Eckhart (1260-1327)\n* Peter Auriol (1280-1322)\n* Marsilius of Padua (1275-1342)\n* Nicholas of Lyra (1270-1349)\n* Thomas Bradwardine (1290-1349)\n* William of Ockham (1287-1347)\n* Richard Rolle (1290-1349)\n* Gregory of Rimini (1300-1358)\n* Jean Buridan (1300-1358)\n* Gregory Palamas (1296-1359)\n* Johannes Tauler (1300-1361)\n* Theologia Germanica (anonymous- but often attributed to Tauler)\n* Henry Suso (1295-1366)\n* John of Ruysbroeck (1293-1381)\n* Nicole Oresme (1320-1382)\n* John Wycliffe (1320-1384)\n* Geert Groote (1340-1384)\n* Catherine of Siena (1347-1380)\n* Walter Hilton (1340-1396)\n* The Cloud of Unknowing (anonymous - but often attributed to Hilton)\n* The Book of Privy Counseling (anonymous - but often attributed to Hilton)\n* Julian of Norwich (1342-1416)\nHesychast Controversy\n(1296–1359)]]\nUnder church tradition the practice of Hesychasm has it beginnings in the bible, Matthew 6:6 and the Philokalia. The tradition of contemplation with inner silence or tranquility is shared by all Eastern ascetics having its roots in the Egyptian traditions of monasticism exemplified by such Orthodox monastics as St Anthony of Egypt.\nAbout the year 1337 Hesychasm attracted the attention of a learned member of the Orthodox Church, Barlaam, a Calabrian monk who at that time held the office of abbot in the Monastery of St Saviour's in Constantinople and who visited Mount Athos. Mount Athos was at the height of its fame and influence under the reign of Andronicus III Palaeologus and under the 'first-ship' of the Protos Symeon. On Mount Athos, Barlaam encountered Hesychasts and heard descriptions of their practices, also reading the writings of the teacher in Hesychasm of St Gregory Palamas, an Athonite monk.\nTrained in Western scholastic theology, Barlaam was scandalised by Hesychasm and began to combat it both orally and in his writings. As a private teacher of theology in the Western Scholastic mode, Barlaam propounded a more intellectual and propositional approach to the knowledge of God than the Hesychasts taught. Barlaam took exception to, as heretical and blasphemous, the doctrine entertained by the Hesychasts as to the nature of the uncreated light, the experience of which was said to be the goal of Hesychast practice. It was maintained by the Hesychasts to be of divine origin and to be identical to that light which had been manifested to Jesus' disciples on Mount Tabor at the Transfiguration. This Barlaam held to be polytheistic, inasmuch as it postulated two eternal substances, a visible (immanent) and an invisible God (transcendent).\nOn the Hesychast side, the controversy was taken up by St Gregory Palamas, afterwards Archbishop of Thessalonica, who was asked by his fellow monks on Mt Athos to defend Hesychasm from the Barlaam's attacks. St Gregory was well-educated in Greek philosophy (dialectical method) and thus able to defend Hesychasm using Western precepts. In the 1340s, he defended Hesychasm at three different synods in Constantinople and also wrote a number of works in its defense.\nIn 1341 the dispute came before a synod held at Constantinople and was presided over by the Emperor Andronicus. The synod, taking into account the regard in which the writings of the pseudo-Dionysius were held, condemned Barlaam, who recanted and returned to Calabria, afterwards becoming a bishop in the Roman Catholic Church. One of Barlaam's friends, Gregory Akindynos, who originally was also a friend of St Gregory Palamas, took up the controversy, and three other synods on the subject were held, at the second of which the followers of Barlaam gained a brief victory. But in 1351 at a synod under the presidency of the Emperor John VI Cantacuzenus, Hesychast doctrine and Palamas' Essence-Energies distinction was established as the doctrine of the Orthodox Church.\nFollowing the decision of 1351, there was strong repression against anti-Palamist thinkers. Kalekas reports on this repression as late as 1397, and for theologians in disagreement with Palamas, there was ultimately no choice but to emigrate and convert to Catholicism, a path taken by Kalekas as well as Demetrios Kydones and Ioannes Kypariossiotes. This exodus of highly educated Greek scholars, later reinforced by refugees following the Fall of Constantinople of 1453, had a significant influence on the first generation (that of Petrarch and Boccaccio) of the incipient Italian Renaissance.\nThe Roman Catholic Church has never fully accepted Hesychasm, especially the distinction between the energies or operations of God and the essence of God, and the notion that those energies or operations of God are uncreated. In Roman Catholic theology as it has developed since the scholastic period, the essence of God can be known but only in the next life; the grace of God is always created; and the essence of God is pure act, so that there can be no distinction between the energies or operations and the essence of God (see, e.g., the Summa Theologiae of St Thomas Aquinas). Some of these positions depend on Aristotelian metaphysics.\nContemporary historians Emperor John VI Kantakouzenos and Nicephorus Gregoras deal very copiously with this subject, taking the Hesychast and Barlaamite sides respectively. The Orthodox perspective is one that states that there is scientific knowledge based on demonstration and spiritual knowledge based on demonstration. That the two understandings must remain separate in order to have a proper understanding of both in order to reject dualism. The Eastern approach to understanding God and spiritual matters as one that should not be approached with a Scholastic and or dialectical method (philosophy). Respected fathers of the church have held that these councils that agree that experiential prayer is Orthodox, refer to these as councils as Ecumenical Councils Eight and Nine.\nMonasticism\nRoman Catholic orders\nMany distinct monastic orders developed within Roman Catholicism and Anglicanism.\n* Bridgettines, founded c.1350\n* Hieronymites, founded in Spain in 1364, an eremitic community formally known as the \"Order of Saint Jerome\"\nProtestant monasticism\nMonasticism in the Protestant tradition proceeds from John Wycliffe who organized the Lollard Preacher Order (the \"Poor Priests\") to promote his reformation views.\nProtestant Reformation precursors\nUnrest because of the Western Schism excited wars between princes, uprisings among the peasants, and widespread concern over corruption in the Church. A new nationalism also challenged the relatively internationalist medieval world. The first of a series of disruptive and new perspectives came from John Wycliffe at Oxford University, then from Jan Hus at the University of Prague. The Catholic Church officially concluded this debate at the Council of Constance (1414–1417). The conclave condemned Jan Hus, who was executed by burning in spite of a promise of safe-conduct. At the command of Pope Martin V, Wycliffe was posthumously exhumed and burned as a heretic twelve years after his burial.\nCrusade aftermath\nThe island of Ruad, three kilometers from the Syrian shore, was occupied by the Knights Templar but was ultimately lost to the Mamluks in the Fall of Ruad on September 26, 1302. The Armenian Kingdom of Cilicia, which was not a crusader state and was not Latin Christian but was closely associated with the crusader states and was ruled by the Latin Christian Lusignan dynasty for its last 34 years, survived until 1375. Other echoes of the crusader states survived for longer, but well away from the Holy Land.\nCrusade against the Tatars\nIn the 14th century, Khan Tokhtamysh combined the Blue and White Hordes forming the Golden Horde. It seemed that the power of the Golden Horde had begun to rise, but in 1389, Tokhtamysh made the disastrous decision of waging war on his former master Tamerlane. Tamerlane's hordes rampaged through southern Russia, crippling the Golden Horde's economy and practically wiping out its defenses in those lands.\nAfter losing the war, Tokhtamysh was dethroned by the party of Khan Temur Kutlugh and Emir Edigu, supported by Tamerlane. When Tokhtamysh asked Vytautas the Great for assistance in retaking the Horde, the latter readily gathered a huge army which included Lithuanians, Ruthenians, Russians, Mongols, Moldavians, Poles, Romanians and Teutonic Knights.\nIn 1398, the huge army moved from Moldavia and conquered the southern steppe all the way to the Dnieper River and northern Crimea. Inspired by their great successes, Vytautas declared a Crusade against the Tatars with Pope Boniface IX backing him. Thus, in 1399, the army of Vytautas once again moved on the Horde. His army met the Horde's at the Vorskla River, slightly inside Lithuanian territory.\nAlthough the Lithuanian army was well equipped with cannon, it could not resist a rear attack from Edigu's reserve units. Vytautas hardly escaped alive. Many princes of his kin—possibly as many as 20—were killed, and the victorious Tatars besieged Kiev. Meanwhile, Temur Kutlugh died from the wounds received in the battle, and Tokhtamysh was killed by one of his own men.\nAlexandrian Crusade\nThe Alexandrian Crusade of October 1365 was a minor seaborne crusade against Muslim Alexandria led by Peter I of Cyprus. His motivation was at least as commercial as religious.\nPolitics and culture\nThe Crusades had an enormous influence on the European Middle Ages. At times, much of the continent was united under a powerful Papacy, but by the 14th century, the development of centralized bureaucracies (the foundation of the modern nation-state) was well on its way in France, England, Spain, Burgundy, and Portugal, and partly because of the dominance of the church at the beginning of the crusading era.\nThe military experiences of the crusades also had their effects in Europe; for example, European castles became massive stone structures as they were in the east, rather than smaller wooden buildings as they had typically been in the past.\nIn addition, the Crusades are seen as having opened up European culture to the world, especially Asia:\n}}\nAlong with trade, new scientific discoveries and inventions made their way east or west. Persian advances (including the development of algebra, optics, and refinement of engineering) made their way west and sped the course of advancement in European universities that led to the Renaissance in later centuries\nThe invasions of German crusaders prevented formation of the large Lithuanian state incorporating all Baltic nations and tribes. Lithuania was destined to become a small country and forced to expand to the East looking for resources to combat the crusaders.\nTrade\nThe need to raise, transport and supply large armies led to a flourishing of trade throughout Europe. Roads largely unused since the days of Rome had significant increases in traffic as local merchants began to expand their horizons. This was not only because the Crusades prepared Europe for travel, but also because many wanted to travel after being reacquainted with the products of the Middle East. This also aided in the beginning of the Renaissance in Italy, as various Italian city-states from the very beginning had important and profitable trading colonies in the crusader states, both in the Holy Land and later in captured Byzantine territory.\nIncreased trade brought many things to Europeans that were once unknown or extremely rare and costly. These goods included a variety of spices, ivory, jade, diamonds, improved glass-manufacturing techniques, early forms of gunpowder, oranges, apples, and other Asian crops, and many other products.\nSerbian Church\n]]\nThe status of the Serbian Orthodox Church grew along with the expansion and heightened prestige of the Serbian kingdom. On April 16, 1346 (Easter), King Stefan Dušan of Serbia convoked a grand assembly at Skopje, attended by the Serbian Archbishop Joanikije II, Archbishop Nicholas I of Ohrid, Patriarch Simeon of Bulgaria and various religious leaders of Mount Athos. The assembly and clergy agreed on, and then ceremonially performed the raising of the autocephalous Serbian Archbishopric to the status of Patriarchate. The Archbishop was from now on titled Serbian Patriarch.  The new Patriarch Joanikije II now solemnly crowned Stefan Dušan as \"Emperor and autocrat of Serbs and Romans\" (see Emperor of Serbs). The new Serbian Patriarchate took over supreme ecclesiastical jurisdiction over Mount Athos and many Greek eparchies in Aegean Macedonia that were until then under the jurisdiction of the Ecumenical Patriarchate of Constantinople. The same process continued after the Serbian conquests of Thessaly, Epirus, Aetolia and Acarnania in 1347 and 1348. In the same time, the Ohrid Archbishopric remained autocephalous, recognizing the honorary primacy of the new Serbian Patriarchate.\nSince proclamation of the Patriarchate was performed without consent of the Ecumenical Patriarchate of Constantinople, various canonical and political questions were raised. Supported by the Byzantine government, Ecumenical Patriarch Callistus I of Constantinople issued an act of condemnation and excommunication of Tsar Stefan Dušan and Serbian Patriarch Joanikije in 1350. That act created a rift between the Byzantine and Serbian churches, but not on dogmatic grounds, since the dispute was limited to the questions of ecclesiastical order and jurisdiction. Serbian Patriarch Joanikije died in 1354, and his successor Patriarch Sava IV (1354-1375) faced new challenges in 1371, when Turks defeated the Serbian army in the Battle of Marica and started their expansion into Serbian lands. Since they were facing the common enemy, the Serbian and Byzantine governments and church leaders reached an agreement in 1375. The act of excommunication was revoked and the Serbian Church was recognized as a Patriarchate, under the condition of returning all eparchies in contested southern regions to the jurisdiction of the Ecumenical Patriarchate of Constantinople.\nAfter the new and decisive defeat by the Turks in the famous Battle of Kosovo in 1389, Serbia became a tributary state to the Ottoman Empire, and the Serbian Patriarchate was also affected by general social decline, since Ottoman Turks continued their expansion and raids into Serbian lands, devastating many monasteries and churches. The city of Skopje was taken by Turks in 1392, and all other southern regions were taken in 1395. That led to the gradual retreat of the jurisdiction of the Serbian Patriarchate in the south and expansion of the jurisdiction of the Archbishopric of Ohrid.\nSpread of Christianity\nLithuania\nLithuania and Samogitia were ultimately Christianized from 1386 until 1417 by the initiative of the Grand Duke of Lithuania Jogaila and his cousin Vytautas.\nTimeline\nSee also\n*History of Christianity\n*History of the Roman Catholic Church\n*History of the Eastern Orthodox Church\n*History of Christian theology#Late Scholasticism and its contemporaries\n*History of Oriental Orthodoxy\n*Christianization\n*Timeline of Christianity#Middle Ages\n*Timeline of Christian missions#Middle Ages\n*Timeline of the Roman Catholic Church#800–1453\n*Chronological list of saints and blesseds in the 14th century\nReferences\nWorks cited\n*\n*\n*\n*\nFurther reading\n* Esler, Philip F. The Early Christian World. Routledge (2004). .\n* Fletcher, Richard, The Conversion of Europe. From Paganism to Christianity 371-1386 AD. London 1997.\n* Freedman, David Noel (Ed). Eerdmans Dictionary of the Bible. Wm. B. Eerdmans Publishing (2000). .\n* Padberg, Lutz v., (1998): Die Christianisierung Europas im Mittelalter, Stuttgart, Reclam (German)\n* Pelikan, Jaroslav Jan. The Christian Tradition: The Emergence of the Catholic Tradition (100-600). University of Chicago Press (1975). .\nExternal links\n*[http://www.ccel.org/ccel/schaff/npnf214.html Schaff's The Seven Ecumenical Councils]"
    }
  ]
}