{
  "content": [
    {
      "type": "text",
      "text": "# Chris Stewart (author)\n\n| birth_place      = Crawley, England\n| death_date       =\n| death_place      =\n| occupation       =\n| nationality      = British\n| citizenship      =\n| education        = The Abbey School Ashurst Wood, and Charterhouse School\n| alma_mater       =\n| period           =\n| genre            =\n| subject          = Farming life in Andalucia, Spain\n| movement         =\n| notableworks     = Driving Over Lemons: An Optimist in Andalucia (1999)\n| spouse           =\n| partner          =\n| children         =\n| relatives        =\n| awards           =\n| signature        =\n| website          =\n| portaldisp       =\n| module           =\n}}\n}}\nChristopher Stewart (born 27 March 1951) is a British author who was the original drummer and a founding member of Genesis. When not writing, he runs a farm, where he lives, near Orgiva in Spain.\nBackground and musical career\nStewart was born in Crawley and grew up in Horsham, Sussex. He attended The Abbey School, Ashurst Wood, then later became a classmate of Tony Banks and Peter Gabriel at Charterhouse in Surrey, and joined them in a school band called the Garden Wall. This was joined by classmates Mike Rutherford and Anthony Phillips to form Anon, which was renamed Genesis in January 1967. Stewart appears on Genesis's first two singles, \"The Silent Sun\" / \"That's Me\" and \"A Winter's Tale\" / \"One-Eyed Hound\".  Although several demos from Stewart's time with the band appear on the Genesis Archive 1967-75 box set, he is not credited with playing on any of them (though one track features drumming that may have been done by Stewart). At the recommendation of Jonathan King, Stewart was – rather inelegantly – fired from the band in the summer of 1968 due to his poor technique and was replaced by John Silver.\nFarmer and author\nAfter travelling and working throughout Europe, Stewart settled and bought a farm named El Valero in the Alpujarras region of Andalucia, where he lives and works with his wife Ana Exton and daughter Chloë. He ran for the position of local councillor in the 27 May 2007 local elections in Órgiva representing the Green Party, where he received 201 votes (roughly 8 per cent).\nHe is now known for his autobiographical books, Driving Over Lemons: An Optimist in Andalucia (1999, ) and the sequels, A Parrot In The Pepper Tree (2002, ) and The Almond Blossom Appreciation Society (2006, ), about his life farming in Spain. All three are also available as audiobooks (Lemons , Parrot , and Almond ), narrated by Stewart.\nIn 2009, Stewart's publisher, Sort of Books, announced plans to release his memoir focused on sailing, entitled Three Ways to Capsize a Boat: An Optimist Afloat. This was fulfilled as .\nIn 2014, Sort Of Books published Stewart's book of stories, Last Days of the Bus Club (4 June 2014, ), which focuses on his daughter's going to university, and his and Ana's subsequent life alone on the farm. Stewart has also contributed to two books in the Rough Guides series: the Rough Guide to Andalucia and the Rough Guide to China.\nReferences\nExternal links\n*[http://www.anthonyphillips.co.uk/associates/chris.htm Biography and news]\n*\n*[http://www.sortof.co.uk/ Sort of Books], a small British publisher initially founded to help Stewart publish his debut book (see [https://web.archive.org/web/20140904055615/http://sortof.co.uk/about-us/ About us])\n*[https://web.archive.org/web/20110301030656/http://www.listisimo.es/blogs/chris-stewart/ Chris Stewart's blog about thrifty-living in Spain]\nja:クリス・スチュワート"
    }
  ]
}