{
  "content": [
    {
      "type": "text",
      "text": "# Christopher Lloyd (naval historian)\n\nCharles Christopher Lloyd (born in India, 2 September 1906 – died 31 March 1986) was a British naval historian, who served as Professor of History at the Royal Naval College, Greenwich, 1962–1966.\nEarly life and education\nThe son of E. S. Lloyd CSI, Christopher Lloyd was educated at Marlborough College and Lincoln College, Oxford. In 1938, he married Katherine Brenda Sturge, with whom he had one son and one daughter.\nAcademic career\nIn 1930, Lloyd received his first academic appointment at Bishop's University, Quebec, Canada and remained there until 1934, when he was appointed to the Royal Naval College, Dartmouth. In 1945, he was appointed lecturer at the Royal Naval College, Greenwich, where he rose to be Professor of History from 1962 until his retirement in 1967.\nHe served as editor of The ''Mariner's Mirror, the Journal of the Society for Nautical Research from 1970-1979.\nPublished works\n* Fanny Burney. London: Longmans, Green, 1936.\n* Captain Marryat and the Old Navy. London; New York: Longmans, Green and Co, 1939.\n*  A Short History of the Royal Navy 1805 to 1918. Methuen & Co. Ltd. London 1942.\n* The Englishman and the Sea, an Anthology,  edited by Christopher Lloyd. London: Allen & Unwin, [1946].\n* Pacific Horizons: The Exploration of the Pacific before Captain Cook. London: G. Allen and Unwin Ltd., [1946].\n*  Lord Cochrane: Seaman - Radical - Liberator. London: Longmans, Green, 1947.\n* The Diary of Fanny Burney, selected and edited by Christopher Lloyd. London: R. Ingram, [1948]\n* The Greville Memoirs, selected and edited by Christopher Lloyd. London: R. Ingram, [1948]\n* The Voyages of Captain James Cook Round the World; selected from his Journals and edited by Christopher Lloyd. London: Cresset Press, 1949.\n* The Navy and the Slave Trade: the Suppression of the African Slave Trade in the Nineteenth Century. London; New York: Longmans, Green, [1949]; London, Cass, 1968.\n* Captain Cook. London: Faber and Faber, [1952]\n* The Naval Miscellany, vol 4.  Publications of the Navy Records Society; v. 63. London: Printed for the Navy Records Society, 1952.\n* The Nation and the Navy; a History of Naval Life and Policy. London: Cresset Press, 1954.\n* The Keith Papers: Selected from the Papers of Admiral Viscount Keith, edited by W. G. Perrin and Christopher Lloyd. [London]: Printed for the Navy Records Society, 1927-1955. Lloyd edited v. 2. [1796-1802] and v. 3. 1803-1815 (1955).\n* Sir Francis Drake. London: Faber and Faber, [1957]; 1979.\n* A Memoir of James Trevenen, edited by Christopher Lloyd and R.C. Anderson. [London]: Navy Records Society, 1959.\n* The Capture of Quebec. London: Batsford, [1959].\n* The Brethren of the Coast: The British and French Buccaneers in the South Seas, by P. K. Kemp and Christopher Lloyd. London: Heinemann, [1960].\n* Ships & Seamen, from the Vikings to the Present Day: A History in Text and Pictures, by Christopher Lloyd in collaboration with J. Douglas-Henry. London: Weidenfeld & Nicolson, 1961.\n* Lives of the Most Notorious Pirates; by Charles Johnson, edited with an introduction by Christopher Lloyd from the text of Arthur L. Hayward. London: The Folio Society, 1962.\n* St. Vincent & Camperdown. London: B.T. Batsford, [1963].\n* Medicine and the Navy, 1200-1900 by J. J. Keevil. Edinburgh; London : E. & S. Livingstone, 1957-63. Vols. 3-4 by C. Lloyd and J. L. S. Coulter.\n* The Health of Seamen: Selections from the Works of Dr. James Lind, Sir Gilbert Blane and Dr. Thomas Trotter, edited by Christopher Lloyd. London: Navy Records Society, 1965.\n* William Dampier. London: Faber, 1966.\n* Pepys and His Seamen\": Samuel Pepys commemoration 31 May 1967: in the Parish Church of St. Olave, Hart Street, City of London. 1967.\n* The British Seaman 1200-1860: A Social Survey. London: Collins, 1968\n* Greenwich: Palace, Hospital, College, written by Christopher C. Lloyd; revised by Bryan Ranft. London: Royal Naval College, 1969.\n* Mr. Barrow of the Admiralty: A Life of Sir John Barrow, 1764-1848.  London: Collins, 1970.\n* Sea Fights Under Sail. London: Collins, 1970.\n* Nelson and Sea Power. London: English Universities Press, 1973.\n* The Nile Campaign: Nelson and Napoleon in Egypt. Newton Abbot: David and Charles; New York: Barnes and Noble, 1973.\n* The Search for the Niger. London: Collins, 1973.\n* Atlas of Maritime History. London: Hamlyn for Country Life, 1975.\n* English Corsairs on the Barbary Coast''. London: Collins, 1981.\nSources\n* Who Was Who, 1981-1990"
    }
  ]
}