{
  "content": [
    {
      "type": "text",
      "text": "# Christian Schwartz\n\nChristian Schwartz (born December 30, 1977, in Concord, New Hampshire, United States) is an American type designer. He has been awarded the German Design Award and the Prix Charles Peignot.\nLife\nSchwartz began designing fonts in school. A graduate of the Communication Design program at Carnegie Mellon University, Schwartz first worked at MetaDesign Berlin, developing typefaces for Volkswagen and logos for various corporations. He then returned to the US and joined the design staff at Font Bureau.\nSchwartz has worked independently in 2001, first forming Orange Italic with product designer Dino Sanchez and recently Schwartzco Inc. He has released commercial fonts with Village, FontFont, Emigre, House Industries and Font Bureau. Many of Schwartz's typefaces have been proprietary designs for corporations such as Bosch and Deutsche Bahn, both with noted designer Erik Spiekermann, and EMI, for the marketing of George Harrison’s posthumous final album. Schwartz has also designed typefaces for many publications including the US edition of Esquire and the extensive Guardian Egyptian family, with Paul Barnes, for the redesign of The Guardian newspaper in 2005. With Barnes he set up the digital font company Commercial Type in 2007.\nSchwartz's typefaces have been honored by the Smithsonian's Cooper-Hewitt National Design Museum, the New York Type Director's Club, and the International Society of Typographic Designers. His work with Barnes has been honored by D&AD and, as part of the Guardian redesign team, they were shortlisted for the Designer of the Year prize by the Design Museum in London. In 2006, Schwartz and Barnes were named two of the 40 most influential designers under 40 by Wallpaper* magazine.\nTypefaces\nTypefaces designed by Christian Schwartz include:\n{|\n|\n*Amplitude, 2003\n*Atlas, 1993\n*FF Bau, 2002\n*Bosch, 2004 (with Erik Spiekermann)\n*Casa Latino!, 1999\n*Deutsche Bahn, 2005 (with Erik Spiekermann)\n*Eero, 2003 (after Eero Saarinen)\n*Elroy, 1993\n*[http://store.typenetwork.com/fonts/?name=farnham Farnham], 2004\n*Flywheel, 1992\n*[http://store.typenetwork.com/fonts/?name=fritz Fritz], 1997\n*Graphik, 2009 (with Berton Hasebe, Hrvoje Živčić, Ilya Ruderman)\n*Guardian Egyptian, 2004 (with Paul Barnes)\n*Hairspray, 1994\n*Harding, 2019\n*Harrison, 2002\n*Houston, 2003\n|\n*FF Kievit, 2001 (with Mike Abbink & Paul van der Laan)\n*Local Gothic, 2006\n*Los Feliz, 2001\n*Luxury, 2006 (with Dino Sanchez)\n*FF Meta Headline, 2006 (with Erik Spiekermann & Joshua Darden)\n*Morticia, 1995\n*Neue Haas Grotesk, 2010 (a restoration of Helvetica)\n*Neutraface, 2002\n*[http://www.houseind.com/fonts/neutrafaceslab/ Neutraface Slab], 2009\n*FF Oxide, 2005\n*Pennsylvania, 2000\n*Popular, 2004\n*Simian, 2001 (based on Handel Gothic)\n*Stag, 2005\n*Symantec, 2003 (with Conor Mangat)\n*FF Unit, 2003 (with Erik Spiekermann)\n|\n|}\nReferences\nExternal links\n*[http://www.christianschwartz.com/ Schwartzco Inc.]\n*[http://www.fontbureau.com/people/ChristianSchwartz Christian Schwartz]"
    }
  ]
}