{
  "content": [
    {
      "type": "text",
      "text": "# Chris Edwards (Canadian football)\n\n| birth_place = Detroit, Michigan, U.S.\n| death_date =\n| death_place =\n| team =\n| number = 24, 6\n| import = yes\n| position1 = Defensive back\n| height_ft = 6\n| height_in = 2\n| weight_lb = 217\n| high_school = Southfield High\n| college = IdahoButteGrand Rapids\n| playing_years1 =\n| playing_team1 = Oakland Raiders*\n| playing_years2 =\n| playing_team2 = Edmonton Eskimos\n| playing_years3 =\n| playing_team3 = BC Lions\n| playing_years4 =\n| playing_team4 = San Francisco 49ers\n| playing_years5 =\n| playing_team5 = Toronto Argonauts\n| playing_years6 =\n| playing_team6 = Hamilton Tiger-Cats\n| career_footnotes =\n| career_highlights = * Grey Cup champion ()\n* CFL All-Star ()\n* CFL East All-Star ()\n| CFL = chris-edwards/162052/\n}}\nChristopher Edwards (born December 23, 1992) is an American former professional football defensive back who played in the Canadian Football League (CFL).\nCollege career\nEdwards first played college football for the Grand Rapids Raiders in 2011 where the team finished with an 11–0 record. After Grand Rapids cancelled their football program, he transferred to Butte College in 2012 where the team finished 12–0. He then transferred again to play for the Idaho Vandals where he completed his junior and senior years in 2014 and 2015, respectively.\nProfessional career\n}}\nOakland Raiders\nAfter going undrafted in the 2016 NFL draft, Edwards signed with the Oakland Raiders on May 16, 2016. However, he was released at the end of training camp on August 29, 2016.\nEdmonton Eskimos\nin 2019]]\nAfter sitting out the 2016 season, Edwards signed with the Edmonton Eskimos on January 30, 2017. He made his regular season debut on June 24, 2021 against the BC Lions. He played in 17 games where he had 14 defensive tackles, four special teams tackles, and one interception. He returned his lone interception for a 73-yard touchdown after picking off the Montreal Alouettes' Drew Willy on October 9, 2017 in the Thanksgiving Day Classic.\nIn his second season with the Eskimos, Edwards played in all 18 regular season games where he had 46 defensive tackles, four special teams tackles, two interceptions, and two forced fumbles. He became a free agent on February 12, 2019.\nBC Lions\nOn the first day of CFL free agency, on February 12, 2019, Edwards signed with the BC Lions to a one-year contract. He played in 18 regular season games with the Lions and recorded 50 defensive tackles, one interception, and two forced fumbles. He also recorded his first career sack on July 6, 2019, when he tackled McLeod Bethel-Thompson of the Toronto Argonauts. In the offseason, he was granted an early release on January 7, 2020, to pursue National Football League interests.\nSan Francisco 49ers\nin 2023]]\nOn January 9, 2020, Edwards signed with the San Francisco 49ers. He was promoted to the active roster for the November 29, 2020 game against the Los Angeles Rams. He was released during the following off-season on May 4, 2021.\nToronto Argonauts\nOn June 2, 2021, it was announced that Edwards had signed with the Toronto Argonauts. In his fourth year in the league, Edwards played in all 14 regular season games for the Argos, contributing with 37 defensive tackles, one special teams tackle, three sacks, three interceptions, and two touchdowns. He was named a CFL All-Star for the first time in his career. Edwards was suspended by the Canadian Football League for six games in the 2022 season following a fan altercation after the Argos were eliminated from the playoffs by the Hamilton Tiger-Cats. In early July 2022 the CFL and CFLPA announced that Edwards' suspension had been reduced from six games to three games.\nHamilton Tiger-Cats\nOn February 17, 2023, Edwards signed with the Hamilton Tiger-Cats.\nOn February 12, 2024, he announced that he had retired from professional football.\nReferences\nExternal links\n* [https://www.argonauts.ca/players/chris-edwards/162052/ Toronto Argonauts bio]\n*"
    }
  ]
}