{
  "content": [
    {
      "type": "text",
      "text": "# Christopher Edward Byrne\n\n| birth_place = Byrnesville, Missouri\n| death_date =\n| death_place = Galveston, Texas, US\n| buried = Calvary Cemetery, Galveston\n| parents = Patrick and Rose Byrne\n| education = St. Mary's CollegeSt. Mary's Seminary\n| honorific_prefix = The Most Reverend\n}}\nChristopher Edward Byrne (April 21, 1867 &ndash; April 1, 1950) was an American prelate of the Roman Catholic Church. He served as bishop of the Diocese of Galveston in Texas from 1918 until his death.\nBiography\nEarly life\nChristopher Byrne was born in Byrnesville, Missouri, to Patrick and Rose Byrne. After attending the village school where his father taught, he earned a Bachelor of Arts at St. Mary's College in Kansas in 1886. He then studied for the priesthood at St. Mary's Seminary in Baltimore, Maryland.\nPriesthood\nByrne was ordained a priest for the Archdiocese of St. Louis by Archbishop Peter Kenrick in St. Louis on September 23, 1891.  After his ordination, Byrne served as a curate at St. Bridget's Parish in St. Louis. In 1897, he was appointed pastor of Sacred Heart Parish in Columbia, Missouri. Byrne took a medical leave of absence in 1898, moving to San Antonio, Texas, to recuperate. Years later, Byrne said that a doctor had told him when he was age 30 that his heart disease would kill him in a few months.\nIn 1899, Byrne returned to Missouri to become pastor of St. Joseph's Parish in Edina then went to Holy Name Parish at St. Louis in 1911. He erected churches and schools at every assignment, and for many years he also did editorial work on the Catholic newspaper The Church Progress. He also served as diocesan director of the Holy Name Society and member of the Diocesan School Board.\nBishop of Galveston\nOn July 18, 1918, Byrne was appointed the fourth bishop of the Diocese of Galveston by Pope Benedict XV. He received his episcopal consecration on November 10, 1918, from Archbishop John J. Glennon, with Bishops Thomas Lillis and John Morris serving as co-consecrators. Byrne's expressed priority as bishop was vocations, saying, \"If Catholicism has not taken that deep hold on the people which will make them dedicate their young to God's service, it cannot endure.\"  He ordained about 130 priests and received several hundred people into religious communities. The diocese increased from 70,000 to 200,000 parishioners during Byrne's tenure, and the number of schools from 51 to over 100. In 1936, Byrne helped organize the centennial celebration of Texan independence from Mexico, holding an open-air mass at the San Jacinto Battlefield near Houston.\nDeath and legacy\nByrne died of a heart attack in Galveston on April 1, 1950, at age 82. He is buried at Calvary Cemetery in Galveston.\nReferences\nExternal links\n*[http://www.archgh.org/ Roman Catholic Archdiocese of Galveston–Houston]\n*[http://archstl.org/ Roman Catholic Archdiocese of St. Louis]"
    }
  ]
}