{
  "content": [
    {
      "type": "text",
      "text": "# Chris Jones (Access Software)\n\n}}\n| birth_place = Utah, U.S.\n| occupation  = Video game designer, video game producer, actor, writer, businessman\n| credits     = Tex Murphy\n| education   =\n| employer    =\n}}\nChristopher Jones (born March 4, 1955) is a video game designer and producer, CEO, finance professional, and actor. He is best known for a series of interactive movies in which he stars as Tex Murphy, a private investigator who lives in San Francisco in the middle of the 21st century.\nCareer\nJones was a founding member of Access Software, along with Bruce Carver and his brother Roger Carver, and remained its CFO until it was sold to Microsoft in 1999.\nAt Access, Jones served as a finance executive. As the company's output turned toward more story-driven titles, he became more involved in writing, design, and production. He designed and wrote the point-and-click adventure games Amazon: Guardians of Eden and Countdown, and served as producer on various titles in the Links golf franchise.\nJones is best recognized by many gamers for the creation and portrayal of Tex Murphy in a series of adventure games, beginning with 1989's Mean Streets. Initially, this meant little more than posing for the games' cover art, digitized sprites and assorted still frames. As the series transitioned to full motion video with the third installment Under A Killing Moon, Jones' role became increasingly cinematic, acting alongside established Hollywood actors such as  Brian Keith, Margot Kidder and Russell Means. In later games of the series he acted with John Agar, Kevin McCarthy, Barry Corbin, Tanya Roberts, Michael York, Henry Darrow, and June Lockhart.\nAfter Access was re-christened Indie Built and sold to Take-Two Interactive, he was the company's Chief Financial Officer until its dissolution in 2006.\nFollowing the dissolution of Indie Built, the company's golf division was spun off into a new company, TruGolf, focusing on high-end golf simulators using real clubs. Jones serves as Finance Executive for TruGolf and, in 2007, founded Big Finish Games, which shares the same office. Big Finish Games initially aimed to bridge the gap between casual games and the traditional adventure game audience, by offering simple hidden object games with a heavy focus on story. Their first title, Three Cards to Midnight, was released in May 2009. Other Big Finish titles include Three Cards to Dead Time (2010), Murder Island: Secret of Tantalus (2011), Escape from Thunder Island (2011), and Rita James and the Race to Shangri La (2012).\nReferences\nExternal links\n*\n*\n* [http://www.podtrac.com/pts/redirect.mp3/www.talkradiomeltdown.com/podcasts/6-4-12.mp3 Interview with Chris Jones on Talk Radio Meltdown 6-4-12]"
    }
  ]
}