{
  "content": [
    {
      "type": "text",
      "text": "# Christopher White (art historian)\n\nin honour of Professor Sir Christopher White, installed in 2013]]\nSir Christopher John White CVO FBA (born 19 September 1930) is a British art historian and curator. He is the son of the artist and art administrator Gabriel White.  He has specialized in the study of Rembrandt and Dutch Golden Age painting and printmaking.\nWhite received a BA from the University of London, followed by an MA from the University of Oxford, and a PhD at the Courtauld Institute, University of London.  He then joined the British Museum's Department of Prints and Drawings in 1954.  From 1965 to 1971, he was director of Old Master sales at Colnaghi in London, then moving to be curator of graphic arts for the National Gallery of Art in Washington, D.C., until 1973.\nFrom 1973, White was director of the Paul Mellon Centre for Studies in British Art, an affiliate of Yale in London, and also an associate director of the Yale Center for British Art.  In 1985 he left these to become director of the Ashmolean Museum in Oxford and a fellow of Worcester College, Oxford, retiring in 1997.\nIn 1997, White became a trustee of the Victoria and Albert Museum. He is also vice-chairman of the British Institute of Florence and a trustee of the Mauritshuis in The Hague. He was knighted in the 2001 New Year Honours for services to art history.\nWhite was elected a fellow of the British Academy in 1989. He is an honorary research fellow at the Courtauld Institute.\nSelected works\nHis books include:\n* Rembrandt as an Etcher: A Study of the Artist at Work, 1969 ()\n*Christopher White, The Late Etchings of Rembrandt, 1969, British Museum/Lund Humphries, London (exhibition catalogue)\n* Rembrandt, World of Art series, Thames & Hudson\n* White, Christopher, Buvelot, Quentin (eds), Rembrandt by himself, 1999, National Gallery, London/Mauritshuis, The Hague,\n* Anthony Van Dyck: Thomas Howard, Earl of Arundel (Getty Museum Studies on Art), 2006\n* The Later Flemish Pictures in the Collection of Her Majesty The Queen, 2007, with Desmond Shawe-Taylor\n* Dutch Pictures in the Collection of Her Majesty the Queen, 2016 ()\n* Anthony Van Dyck and the Art of Portraiture, 2021 ()\nReferences"
    }
  ]
}