{
  "content": [
    {
      "type": "text",
      "text": "# Chris Howard (catcher)\n\n| birth_place  = San Diego, California\n| bats        = Right\n| throws      = Right\n|debutleague = MLB\n| debutdate   = September 15\n| debutyear   = 1991\n| debutteam   = Seattle Mariners\n|finalleague = MLB\n| finaldate   = August 10\n| finalyear   = 1994\n| finalteam   = Seattle Mariners\n|statleague = MLB\n| stat1label  = Batting average\n| stat1value  = .188\n| stat2label  = Home runs\n| stat2value  = 0\n| stat3label  = Runs batted in\n| stat3value  = 2\n| teams       =\n*Seattle Mariners (, –)\n| highlights  =\n* National champion (Football) (1985)\n}}\nChristopher Hugh Howard (born February 27, 1966) is an American college baseball coach and former professional baseball catcher. He played in Major League Baseball (MLB) for the Seattle Mariners during three seasons in the early 1990s.\nBiography\nHoward was born in San Diego, California and attended Bishop Miege High School in Roeland Park, Kansas.\nHoward attended the University of Oklahoma on a football scholarship. He played for both the Sooners football and Sooners baseball teams, and was a fullback on the 1985 Oklahoma Sooners football team, the consensus national champions.\nHoward later transferred to the University of Louisiana at Lafayette for one season. He was selected by the Seattle Mariners in 41st round of the 1988 MLB draft.\nHoward began his professional baseball career in 1988 in the Mariners organization. He first reached the Double-A level in 1989 and the Triple-A level in 1991. He also made his MLB debut in 1991 as a September call-up, appearing in nine games for the Mariners; he was 1-for-6 at the plate for a .167 batting average. Howard spent most of the next five seasons playing in Triple-A. He played in four MLB games in 1993 and nine in 1994, all with the Mariners. He ended his playing career in 1996 with the Norfolk Tides, a Triple-A farm team of the New York Mets.\nOverall, Howard appeared in 22 MLB games, batting .188 (6-for-32) with two runs batted in (RBIs). He also played in 790 games in Minor League Baseball (487 at the Triple-A level) where he batted .250 with 366 RBIs and 65 home runs.\nIn 2007, Howard became head coach of the Pennsylvania College of Technology baseball team in Williamsport, Pennsylvania. In 2010, Howard played the role of a bench coach in the Japanese movie Baseball Dreams which was filmed in Williamsport. 2022 marked his 16th season as head coach. He was named United East Coach of the Year in 2023.\nReferences\nExternal links\n*[https://www.youtube.com/watch?v=PxYFKp5xjKc Chris Howard: Penn College Head Baseball Coach - Short Documentary] via YouTube\nhttps://pctwildcats.com/sports/baseball/roster/coaches/christopher-howard/390"
    }
  ]
}