{
  "content": [
    {
      "type": "text",
      "text": "# Christoph Grabenwarter\n\n| birth_place         = Bruck an der Mur, Austria\n| death_date          =\n| death_place         =\n| party               =\n| spouse              =\n| children            =\n| alma_mater          =\n}}\nChristoph Grabenwarter (born 4 August 1966) is an Austrian legal scholar and professor, currently serving as the President of the Constitutional Court.\nCareer\nBorn in Bruck an der Mur, Styria, in 1966, Christoph Grabenwarter studied law and business administration at the University of Vienna. He held professorships at several universities, including the University of Vienna, the Johannes Kepler University Linz, the University of Bonn, and the University of Graz. In 2005, he was appointed to the Austrian Constitutional Court as a justice. He was named Vice President of the Court in 2018 and served as acting President following the appointment of Brigitte Bierlein as Chancellor in 2019 after the Ibiza affair and the collapse of the first Kurz government. Grabenwarter was officially appointed President of the Court in February 2020.\nIn January 2022, it emerged that both his appointment as Vice President and his promotion to President were preceded by informal agreements between the ÖVP-FPÖ and ÖVP-Green coalitions, in which his nomination was attributed to the ÖVP. He had already been repeatedly linked to the ÖVP, although he himself rejects label of being “ÖVP-affiliated”.\nIn 1991, Grabenwarter briefly worked for the Secretariat of the European Commission of Human Rights in Straßbourg and spent 2015 to 2020 as a member and eventually Chair of the Advisory Panel of Experts on Candidates for Election as Judge to the European Court of Human Rights. He currently serves as a professor of Public Law, Buseiness Law and International Law at the Vienna University of Economics and Business. Since 2022, he has been an honorary professor at Eötvös Loránd University in Budapest.\nPersonal life\nGrabenwarter is married to notary Alice Grabenwarter and has two daughters. He spends most of his free time in the Austrian mountains.\nReferences"
    }
  ]
}