{
  "content": [
    {
      "type": "text",
      "text": "# Christianity in the 16th century\n\n, Prešov, Slovakia after late Gothic reconstruction (1502–1515).]]\nasking John III of Portugal for an expedition.]]\nIn 16th-century Christianity, Protestantism came to the forefront and marked a significant change in the Christian world.\nAge of Discovery\nDuring the age of discovery, the Catholic Church established a number of missions in the Americas and other colonies in order to spread Christianity in the New World and to convert the indigenous peoples. At the same time, missionaries such as Francis Xavier as well as other Jesuits, Augustinians, Franciscans and Dominicans were moving into Asia and the Far East. Under the Padroado treaty with the Holy See, by which the Vatican delegated to the kings the administration of the local churches, the Portuguese sent missions into Africa, Brazil and Asia. While some of these missions were associated with imperialism and oppression, others (notably Matteo Ricci's Jesuit China missions) were relatively peaceful and focused on integration rather than cultural imperialism.\nThe expansion of the Catholic Portuguese Empire and Spanish Empire with a significant role played by the Catholic Church led to the Christianization of the indigenous populations of the Americas such as the Aztecs and Incas. Later waves of colonial expansion such as the Scramble for Africa or the struggle for India by the Netherlands, England, France, Germany and Russia led to Christianization of other native populations across the globe, eclipsing that of the Roman period and making it a truly global religion.\nProtestant Reformation\nThe Renaissance yielded scholars the ability to read the scriptures in their original languages, and this in part stimulated the Protestant Reformation. Martin Luther, a Doctor in Bible at the University of Wittenberg, began to teach that salvation is a gift of God's grace, attainable only through faith in Jesus, who in humility paid for sin. Along with the doctrine of justification, the Reformation promoted a higher view of the Bible. As Martin Luther said, \"The true rule is this: God's Word shall establish articles of faith, and no one else, not even an angel can do so.\" These two ideas in turn promoted the concept of the priesthood of all believers. Other important reformers were John Calvin, Huldrych Zwingli, Philipp Melanchthon, Martin Bucer and the Anabaptists.\nThese reformers are distinguished from previous ones in that they considered the root of corruptions to be doctrinal (rather than simply a matter of moral weakness or lack of ecclesiastical discipline), and thus they aimed to change contemporary doctrines to accord with what they perceived to be the \"true gospel.\" The word Protestant is derived from the Latin protestatio meaning declaration which refers to the letter of protestation by Lutheran princes against the decision of the Diet of Speyer in 1529, which reaffirmed the edict of the Diet of Worms against the Reformation. Since that time, the term has been used in many different senses, but most often as a general term refers to Western Christianity that is not subject to papal authority. The term \"Protestant\" was not originally used by Reformation era leaders; instead, they called themselves \"evangelical\", emphasising the \"return to the true gospel (Greek: euangelion).\"\nThe beginning of the Protestant Reformation is generally identified with Martin Luther and the posting of the 95 Theses on the castle church in Wittenberg, Germany in 1517. Early protest was against corruptions such as simony, episcopal vacancies, and the sale of indulgences. The three most important traditions to emerge directly from the Protestant Reformation were the Lutheran, Reformed (Calvinist, Presbyterian, etc.), and Anglican traditions, though the latter group identifies as both \"Reformed\" and \"Catholic\", and some subgroups reject the classification as \"Protestant.\"\nThe Protestant Reformation may be divided into two distinct but basically simultaneous movements, the Magisterial Reformation and the Radical Reformation. The Magisterial Reformation involved the alliance of certain theological teachers (Latin: magistri) such as Luther, Zwingli, Calvin, and Cranmer, with secular magistrates who cooperated in the reformation of Christendom. Radical Reformers, besides forming communities outside state sanction, often employed more extreme doctrinal change, such as the rejection of tenets of the Councils of Nicaea and Chalcedon. Often the division between magisterial and radical reformers was as or more violent than the general Catholic and Protestant hostilities.\nThe Protestant Reformation spread almost entirely within the confines of Northern Europe but did not take hold in certain northern areas such as Ireland and parts of Germany. The Catholic response to the Protestant Reformation is known as the Counter-Reformation which resulted in a reassertion of traditional doctrines and the emergence of new religious orders aimed at both moral reform and new missionary activity. The Counter-Reformation reconverted approximately 33% of Northern Europe to Catholicism and initiated missions in South and Central America, Africa, Asia, and even China and Japan. Protestant expansion outside of Europe occurred on a smaller scale through colonization of North America and areas of Africa.\nLife of Martin Luther and the heroes of the Reformation\nMartin Luther and the Lutherans\nLuther's 95 Theses\nThe protests against Rome began in earnest in 1517 when Martin Luther, an Augustinian friar, called for a reopening of the debate on the sale of indulgences. Luther's dissent marked a sudden outbreak of a new and irresistible force of discontent which had been pushed underground but not resolved. The quick spread of discontent occurred to a large degree because of the printing press and the resulting swift movement of both ideas and documents, including the 95 Theses. Information was also widely disseminated in manuscript form, as well as by cheap prints and woodcuts among the poorer sections of society.\nParallel to events in Germany was a movement began in Switzerland under the leadership of Ulrich Zwingli. These two movements quickly agreed on most issues, but some unresolved differences kept them separate. Some followers of Zwingli believed that the Reformation was too conservative and moved independently toward more radical positions, some of which survive among modern day Anabaptists. Other Protestant movements grew up along lines of mysticism or humanism, sometimes breaking from Rome or from the Protestants, or forming outside of the churches.\nAfter this first stage of the Reformation, following the excommunication of Luther and condemnation of the Reformation by the pope, the work and writings of John Calvin were influential in establishing a loose consensus among various groups in Switzerland, Scotland, Hungary, Germany and elsewhere.\nMartin Luther, by Lucas Cranach the Elder\nAs Luther began developing his own theology, he increasingly came into conflict with Thomistic scholars, most notably Cardinal Cajetan. Soon, Luther had begun to develop his theology of justification, or process by which one is \"made right\" (righteous) in the eyes of God. In Catholic theology, one is made righteous by a progressive infusion of grace accepted through faith and cooperated with through good works. Luther's doctrine of justification differed from Catholic theology in that justification rather meant \"the declaring of one to be righteous\", where God imputes the merits of Christ upon one who remains without inherent merit. In this process, good works are more of an unessential byproduct that contribute nothing to one's own state of righteousness. Conflict between Luther and leading theologians led to his gradual rejection of authority of the Church hierarchy. In 1520, he was condemned for heresy by the papal bull Exsurge Domine, which he burned at Wittenberg along with books of canon law.\nLuther's refusal to retract his writings in confrontation with the Holy Roman Emperor Charles V at the Diet of Worms in 1521 resulted in his excommunication by Pope Leo X and declaration as an outlaw. His translation of the Bible into the language of the people made the Scriptures more accessible, causing a tremendous impact on the church and on German culture. It fostered the development of a standard version of the German language, added several principles to the art of translation, and influenced the translation of the King James Bible. His hymns inspired the development of congregational singing within Christianity. His marriage to Katharina von Bora set a model for the practice of clerical marriage within Protestantism.\nLuther's insights are generally held to have been a major foundation of the Protestant movement. The relationship between Lutheranism and the Protestant tradition is, however, ambiguous: some Lutherans consider Lutheranism to be outside the Protestant tradition, while some see it as part of this tradition.\"Protestant?\" The Lutheran Church - Missouri Synod [http://www.lcms.org/pages/internal.asp?NavID=4409 (Website FAQ)]\nThe sale of indulgences shown in A Question to a Mintmaker, woodcut by Jörg Breu the Elder of Augsburg, circa 1530.\nDoor of the Schlosskirche (castle church) in Wittenberg to which Luther is said to have nailed his 95 Theses, sparking the Reformation.\nWidening breach\nLuther's writings circulated widely, reaching France, England, and Italy as early as 1519, and students thronged to Wittenberg to hear him speak. He published a short commentary on Galatians and his Work on the Psalms. At the same time, he received deputations from Italy and from the Utraquists of Bohemia; Ulrich von Hutten and Franz von Sickingen offered to place Luther under their protection.\nThis early portion of Luther's career was one of his most creative and productive. Three of his best known works were published in 1520: To the Christian Nobility of the German Nation, On the Babylonian Captivity of the Church, and On the Freedom of a Christian.\nFinally on 30 May 1519, when the pope demanded an explanation, Luther wrote a summary and explanation of his theses to the pope. While the pope may have conceded some of the points, he did not like the challenge to his authority so he summoned Luther to Rome to answer these. At that point Frederick the Wise, the Saxon Elector, intervened. He did not want one of his subjects to be sent to Rome to be judged by the Catholic clergy so he prevailed on Charles V, Holy Roman Emperor to arrange a compromise.\nAn arrangement was effected, however, whereby that summons was cancelled, and Luther went to Augsburg in October 1518 to meet the papal legate, Cardinal Thomas Cajetan. The argument was long, but nothing was resolved.First edition of Exsurge Domine.\nPolitical maneuvering\nWhat had started as a strictly theological and academic debate had now turned into something of a social and political conflict as well, pitting Luther, his German allies and Northern European supporters against Charles V, France, the Italian pope, their territories and other allies. The conflict would erupt into a religious war after Luther's death, fueled by the political climate of the Holy Roman Empire and strong personalities on both sides.\nIn 1526, at the First Diet of Speyer, it was decided that until a General Council could meet and settle the theological issues raised by Martin Luther, the Edict of Worms would not be enforced, and each prince could decide if Lutheran teachings and worship would be allowed in his territories. In 1529, at the Second Diet of Speyer, the decision the previous Diet of Speyer was reversed—despite the strong protests of the Lutheran princes, free cities and some Zwinglian territories. These states quickly became known as Protestants. At first, this term Protestant was used politically for the states that resisted the Edict of Worms. Over time, however, this term came to be used for the religious movements that opposed the Catholic tradition in the 16th century.\nLutheranism would become known as a separate movement after the 1530 Diet of Augsburg, which was convened by Charles V to try to stop the growing Protestant movement. At the Diet, Philipp Melanchthon presented a written summary of Lutheran beliefs called the Augsburg Confession. Several of the German princes (and later, kings and princes of other countries) signed the document to define \"Lutheran\" territories. These princes allied to create the Schmalkaldic League in 1531, which led to the Schmalkald War in 1547 that pitted the Lutheran princes of the Schmalkaldic League against the Catholic forces of Charles V.\nAfter the conclusion of the Schmalkald War, Charles V attempted to impose Catholic religious doctrine on the territories that he had defeated. However, the Lutheran movement was far from defeated. In 1577, the next generation of Lutheran theologians gathered the work of the previous generation to define the doctrine of the persisting Lutheran church. This document is known as the Formula of Concord. In 1580, it was published with the Augsburg Confession, the Apology of the Augsburg Confession, the Large and Small Catechisms of Martin Luther, the Smalcald Articles and the Treatise on the Power and Primacy of the Pope. Together they were distributed in a volume entitled The Book of Concord.\nResults of the Lutheran Reformation\nLarge numbers of Europeans were excommunicated under the 1521 Edict of Worms and subsequent attempts to reiterate it, including the majority of German speakers (the only German speaking areas where the population remained mostly in the Catholic Church were those under the domain or influence of Catholic Austria and Bavaria or the electoral archbishops of Mainz, Cologne, and Trier).\nCalvinism\nCalvinism is a system of Christian theology and an approach to Christian life and thought within the Protestant tradition articulated by John Calvin and subsequently by successors, associates, followers and admirers of Calvin and his interpretation of Scripture, and perspective on Christian life and theology. Calvin's system of theology and Christian life forms the basis of the Reformed tradition, a term roughly equivalent to Calvinism.\nThe Reformed tradition was originally advanced by stalwarts such as Martin Bucer, Heinrich Bullinger and Peter Martyr Vermigli, and also influenced English reformers such as Thomas Cranmer and John Jewel. However, because of Calvin's great influence and role in the confessional and ecclesiastical debates throughout the 17th century, this Reformed movement generally became known as Calvinism. Today, this term also refers to the doctrines and practices of the Reformed churches, of which Calvin was an early leader, and the system is perhaps best known for its doctrines of predestination and election.\nThe Reformation foundations engaged with Augustinianism. Both Luther and Calvin thought along lines linked with the theological teachings of Augustine of Hippo. The Augustinianism of the Reformers struggled against Pelagianism, a heresy that they perceived in the Catholic Church of their day. In the course of this religious upheaval, the German Peasants' War of 1524&ndash;1525 swept through the Bavarian, Thuringian and Swabian principalities, leaving scores of Catholics slaughtered at the hands of Protestant bands, including the Black Company of Florian Geier, a knight from Giebelstadt who joined the peasants in the general outrage against the Catholic hierarchy.\nUlrich Zwingli\nUlrich Zwingli, wearing the scholar's cap.\nUlrich Zwingli was a Swiss scholar and parish priest who was likewise influential in the beginnings of the Protestant Reformation. Zwingli claimed that his theology owed nothing to Luther and that he had developed it in 1516, before Luther's famous protest, though his doctrine of justification was remarkably similar to that of Luther. In 1518, Zwingli was given a post at the wealthy collegiate church of the Grossmünster in Zürich, where he remained until his death. Soon he had risen to prominence in the city. Zwingli began preaching his version of reform, with certain points as the aforementioned doctrine of justification, but others (with which Luther vehemently disagreed) such as the position that veneration of icons was actually idolatry and thus a violation of the first commandment, and the denial of the real presence in the Eucharist. Soon the city council had accepted Zwingli's doctrines, and Zürich became a focal point of more radical reforming movements. Followers of Zwingli pushed his message and reforms far further than even he had intended, such as rejecting infant baptism. This split between Luther and Zwingli formed the essence of the Protestant division between Lutheran and Reformed theology. Meanwhile, political tensions increased; Zwingli and the Zürich leadership imposed an economic blockade on the inner Catholic states of Switzerland, which led to a battle in which Zwingli, in full armor, was slain along with his troops.\nJohn Calvin\nJohn Calvin was a French cleric and doctor of law. He belonged to the second generation of the Reformation, publishing his theological tome, the Institutes of the Christian Religion, in 1536 (later revised) and establishing himself as a leader of the Reformed church in Geneva, which became an \"unofficial capital\" of Reformed Christianity in the second half of the 16th century. He exerted a remarkable amount of authority in the city and over the city council, such that he has (rather ignominiously) been called a \"Protestant pope.\" Calvin established an eldership together with a consistory, where pastors and the elders established matters of religious discipline for the Genevan population. Calvin's theology is best known for his doctrine of (double) predestination, which held that God had, from all eternity, providentially foreordained who would be saved (the elect) and likewise who would be damned (the reprobate). Predestination was not the dominant idea in Calvin's works, but it would seemingly become so for many of his Reformed successors.\nFollowing the excommunication of Luther and condemnation of the Reformation by the pope, the work and writings of Calvin were influential in establishing a loose consensus among various groups in Switzerland, Scotland, Hungary, Germany and elsewhere.\nGeneva became the unofficial capital of the Protestant movement, led by the Frenchman, Jean Calvin, until his death when Calvin's ally, Zwingli, assumed the spiritual leadership of the group.\nArminianism\nArminianism is a school of soteriological thought in Protestant Christian theology founded by the Dutch theologian Jacobus Arminius. Its acceptance stretches through much of mainstream Protestantism. Because of the influence of John Wesley, Arminianism is perhaps most prominent in the Methodist movement.\nArminianism holds to the following tenets:\n* Humans are naturally unable to make any effort towards salvation\n* Salvation is possible by grace alone\n* Works of human effort cannot cause or contribute to salvation\n* God's election is conditional on faith in Jesus\n* Jesus' atonement was potentially for all people\n* God allows his grace to be resisted by those unwilling to believe\n* Salvation can be lost, as continued salvation is conditional upon continued faith\nArminianism is most accurately used to define those who affirm the original beliefs of Jacobus Arminius, but the term can also be understood as an umbrella for a larger grouping of ideas including those of Simon Episcopius, Hugo Grotius, John Wesley, and others. There are two primary perspectives on how the system is applied in detail: Classical Arminianism, which sees Arminius as its figurehead, and Wesleyan Arminianism, which (as the name suggests) sees John Wesley as its figurehead. Wesleyan Arminianism is sometimes synonymous with Methodism.\nWithin the broad scope of church history, Arminianism is closely related to Calvinism, and the two systems share both history and many doctrines. Nonetheless, they are often viewed as archrivals within Evangelicalism because of their disagreement over the doctrines of predestination and salvation.\nAnglicanism and the English Reformation\nStatue of Richard Hooker, whose emphases on scripture, tradition, and reason influenced [[Anglicanism.]]\nAnglican doctrine emerged from the interweaving of two main strands of Christian doctrine during the English Reformation in the 16th and 17th centuries. The first strand is the Catholic doctrine taught by the established church in England in the early 16th century. The second strand is a range of Protestant Reformed teachings brought to England from neighbouring countries in the same period, notably Calvinism and Lutheranism.\nThe Church of England was the national branch of the Catholic Church. The formal doctrines had been documented in canon law over the centuries, and the Church of England still follows an unbroken tradition of canon law. The English Reformation did not dispense with all previous doctrines. The church not only retained the core Catholic beliefs common to Reformed doctrine in general, such as the Trinity, the Virgin Birth of Jesus, the nature of Jesus as fully human and fully God, the Resurrection of Jesus, Original Sin, and Excommunication (as affirmed by the Thirty-Nine Articles), but also retained some Catholic teachings which were rejected by true Protestants, such as the three orders of ministry and the apostolic succession of bishops.\nUnlike other reform movements, the English Reformation began by royal influence. Henry VIII considered himself a thoroughly Catholic king, and in 1521 he defended the papacy against Luther in a book he commissioned entitled, The Defence of the Seven Sacraments, for which Pope Leo X awarded him the title Fidei Defensor (Defender of the Faith). However, the king came into conflict with the papacy when he wished to annul his marriage with Catherine of Aragon, for which he needed papal sanction. Catherine, among many other noble relations, was the aunt of Emperor Charles V, the papacy's most significant secular supporter. The ensuing dispute eventually led to a break from Rome. In 1534, the Act of Supremacy made Henry the Supreme Head of the Church of England. Between 1535 and 1540, under Thomas Cromwell, the policy known as the Dissolution of the Monasteries was put into effect.\nElizabeth I, Queen of England and Ireland.]]\nThere were some notable opponents to the Henrician Reformation, such as Thomas More and Bishop John Fisher, who were executed for their opposition. There was also a growing party of reformers who were imbued with the Zwinglian and Calvinistic doctrines. When Henry died he was succeeded by his Protestant son Edward VI, who, through his empowered councillors (with the king being only nine years old at his succession and not yet sixteen at his death) the Duke of Somerset and the Duke of Northumberland, ordered the destruction of images in churches, and the closing of the chantries. Under Edward VI the reform of the Church of England was established unequivocally in doctrinal terms. Yet, at a popular level, religion in England was still in a state of flux. Following a brief Catholic restoration during the reign of Mary 1553&ndash;1558, a loose consensus developed during the reign of Elizabeth I, though this point is one of considerable debate among historians. Yet it is the so-called \"Elizabethan Religious Settlement\" to which the origins of Anglicanism are traditionally ascribed.\nThe political separation of the Church of England from Rome, beginning in 1529 and completed in 1536, brought England alongside this broad Reformed movement. However, religious changes in the English national church proceeded more conservatively than elsewhere in Europe. Reformers in the Church of England alternated for centuries between sympathies for Catholic traditions and Protestantism, progressively forging a stable compromise between adherence to ancient tradition and Protestantism, which is now sometimes called the via media.\nMonasticism\nDuring the Reformation the teachings of Martin Luther led to the end of the monasteries, but a few Protestants followed monastic lives. Loccum Abbey and Amelungsborn Abbey have the longest traditions as Lutheran monasteries.\nSince the 19th century there have been a renewal in the monastic life among Protestants.\nMonastic life in England came to an abrupt end with Dissolution of the Monasteries during the reign of King Henry VIII. The property and lands of the monasteries were confiscated and either retained by the king or given to loyal protestant nobility. Monks, friars and nuns were forced to either flee for the continent or to abandon their vocations. For around 300 years, there were no monastic communities within any of the Anglican churches.\nScandinavia\nAll of Scandinavia ultimately adopted Lutheranism over the course of the 16th century, as the monarchs of Denmark (who also ruled Norway and Iceland) and Sweden (who also ruled Finland) converted to that faith.\nIn Sweden the Reformation was spearheaded by Gustav Vasa, elected king in 1523. Friction with the pope over interference in Swedish ecclesiastical affairs led to the discontinuance of any official connection between Sweden and the papacy from 1523. Four years later, at the Diet of Västerås, the king succeeded in forcing the diet to accept his dominion over the national church. The king was given possession of all church property, church appointments required royal approval, the clergy were subject to the civil law, and the \"pure Word of God\" was to be preached in the churches and taught in the schools&mdash;effectively granting official sanction to Lutheran ideas.\nUnder the reign of Frederick I (1523&ndash;1533), Denmark remained officially Catholic. But though Frederick initially pledged to persecute Lutherans, he soon adopted a policy of protecting Lutheran preachers and reformers, of whom the most famous was Hans Tausen. During his reign, Lutheranism made significant inroads among the Danish population. Frederick's son, Christian, was openly Lutheran, which prevented his election to the throne upon his father's death. However, following his victory in the civil war that followed, in 1537 he became Christian III and began a reformation of the official state church.\nScotland\nThe Scottish Reformation culminated ecclesiastically in the re-establishment of the church along Reformed lines, and politically in the triumph of English influence over that of France. John Knox is regarded as the leader of the Scottish Reformation\nThe Reformation Parliament of 1560, which repudiated the pope's authority, forbade the celebration of the mass and approved a Protestant Confession of Faith. This was made possible by a revolution against French hegemony under the regime of the regent Mary of Guise, who had governed Scotland in the name of her absent daughter Mary, Queen of Scots (then also Queen of France).\nThe Scottish Reformation decisively shaped the Church of Scotland and, through it, all other Presbyterian churches worldwide.\nA spiritual revival also broke out among Catholics soon after Martin Luther's actions, and led to the Scottish Covenanters' movement, the precursor to Scottish Presbyterianism. This movement spread, and greatly influenced the formation of Puritanism among the Anglican Church in England. The Scottish Covenanters were persecuted by the Catholic Church. This persecution by the Catholics drove some of the Protestant Covenanter leadership out of Scotland and into France and Switzerland.\nFrance\n]]\nProtestantism also spread from the German lands into France, where the Protestants were known as Huguenots.\nThough not personally interested in religious reform, Francis I (reigned 1515–1547) initially maintained an attitude of tolerance, in accordance with his interest in the humanist movement. This changed in 1534 with the Affair of the Placards. In this act, Protestants denounced the Catholic Mass in placards that appeared across France, even reaching the royal apartments. During this time as the issue of religious faith entered into the arena of politics, Francis came to view the movement as a threat to the kingdom's stability.\nFollowing the Affair of the Placards, culprits were rounded up, at least a dozen heretics were put to death, and the persecution of Protestants increased. One of those who fled France at that time was John Calvin, who emigrated to Basel in 1535 before eventually settling in Geneva in 1536. Beyond the reach of the French kings in Geneva, Calvin continued to take an interest in the religious affairs of his native land including the training of ministers for congregations in France.\nAs the number of Protestants in France increased, the number of heretics in prisons awaiting trial also grew. As an experimental approach to reduce the caseload in Normandy, a special court just for the trial of heretics was established in 1545 in the Parlement de Rouen. When Henry II took the throne in 1547, the persecution of Protestants grew and special courts for the trial of heretics were also established in the Parlement de Paris. These courts came to known as \"La Chambre Ardente\" (“the fiery chamber\") because of their reputation of meting out death penalties on burning gallows.\nDespite heavy persecution by Henry II, the Reformed Church of France, largely Calvinist in direction, made steady progress across large sections of the nation, in the urban bourgeoisie and parts of the aristocracy, appealing to people alienated by the obduracy and the complacency of the Catholic establishment.\nFrench Protestantism, though its appeal increased under persecution, came to acquire a distinctly political character, made all the more obvious by the noble conversions of the 1550s. This had the effect of creating the preconditions for a series of destructive and intermittent conflicts, known as the Wars of Religion. The civil wars were helped along by the sudden death of Henry II in 1559, which saw the beginning of a prolonged period of weakness for the French crown.\nSaint Bartholomew's Day Massacre\nAtrocity and outrage became the defining characteristic of the time, illustrated at its most intense in the St. Bartholomew's Day massacre of August 1572, when the Catholic Church annihilated between 30,000 and 100,000 Huguenots across France. The wars only concluded when Henry IV, a former Huguenot, issued the Edict of Nantes, promising official toleration of the Protestant minority but under highly restricted conditions. Catholicism remained the official state religion, and the fortunes of French Protestants gradually declined over the next century, culminating in Louis XIV's Edict of Fontainebleau&mdash;which revoked the Edict of Nantes and made Catholicism the sole legal religion of France. In response to the Edict of Fontainebleau, Frederick William of Brandenburg declared the Edict of Potsdam, giving free passage to French Huguenot refugees and tax-free status to them for 10 years.\nNetherlands\nIconoclasm: The organised destruction of Catholic images, or Beeldenstorm, swept through Netherlands churches in 1566.\nThe Reformation in the Netherlands, unlike in many other countries, was not initiated by the rulers of the Seventeen Provinces but instead by multiple popular movements, which in turn were bolstered by the arrival of Protestant refugees from other parts of the continent. While the Anabaptist movement enjoyed popularity in the region in the early decades of the Reformation, Calvinism, in the form of the Dutch Reformed Church, became the dominant Protestant faith in the country from the 1560s onward.\nHarsh persecution of Protestants by the Spanish government of Philip II contributed to a desire for independence in the provinces, which led to the Eighty Years' War and eventually, the separation of the largely Protestant Dutch Republic from the Catholic-dominated Southern Netherlands, the present-day Belgium.\nHungary\nMuch of the population of Kingdom of Hungary adopted Protestantism during the 16th century. The spread of Protestantism in the country was aided by its large ethnic German minority, which could understand and translate the writings of Martin Luther. While Lutheranism gained a foothold among the German-speaking population, Calvinism became widely accepted among ethnic Hungarians.\nIn the more independent northwest the rulers and priests, protected by the Habsburg monarchy which had taken the field to fight the Turks, defended the old Catholic faith. They dragged the Protestants to prison and the stake wherever they could.\nProtestants likely formed a majority of Hungary's population at the close of the 16th century, but Counter-Reformation efforts in the 17th century reconverted a majority of the kingdom to Catholicism. A significant Protestant minority remained, most of it adhering to the Calvinist faith.\nCounter-Reformation\nThe Counter-Reformation, or Catholic Reformation, was the response of the Catholic Church to the Protestant Reformation. The essence of the Counter-Reformation was a renewed conviction in traditional practices and the upholding of Catholic doctrine as the source of ecclesiastic and moral reform, and the answer to halting the spread of Protestantism. Thus it experienced the founding of new religious orders, such as the Jesuits, the establishment of seminaries for the proper training of priests, renewed worldwide missionary activity, and the development of new yet orthodox forms of spirituality, such as that of the Spanish mystics and the French school of spirituality. The entire process was spearheaded by the Council of Trent, which clarified and reasserted doctrine, issued dogmatic definitions, and produced the Roman Catechism.\nThe counter-reformation and developed a Second scholasticism, which was pitted against Lutheran scholasticism. The overall result of the Reformation was therefore to highlight distinctions of belief that had previously co-existed uneasily.\nAlthough Ireland, Spain, and France featured significantly in the Counter-Reformation, its heart was Italy and the various popes of the time, who established the Index Librorum Prohibitorum, (the list of prohibited books) or simply the \"Index,\" and the Roman Inquisition, a system of juridical tribunals that prosecuted heresy and related offences. The papacy of Pius V (1566–1572) was known for its focus on halting heresy and worldly abuses within the Church and for its focus on improving popular piety in a determined effort to stem the appeal of Protestantism. Pius began his pontificate by giving large alms to the poor, charity, and hospitals, and the pontiff was known for consoling the poor and sick and supporting missionaries. The activities of these pontiffs coincided with a rediscovery of the ancient Christian catacombs in Rome. As Diarmaid MacCulloch states, \"Just as these ancient martyrs were revealed once more, Catholics were beginning to be martyred afresh, both in mission fields overseas and in the struggle to win back Protestant northern Europe: the catacombs proved to be an inspiration for many to action and to heroism.\"\nCouncil of Trent\nThe Council in Santa Maria Maggiore church; Museo Diocesiano Tridentino, Trento\nThe Council of Trent (1545–1563), initiated by Pope Paul III, addressed issues of certain ecclesiastical corruptions such as simony, nepotism, and other abuses, as well as the reassertion of traditional practices and the dogmatic articulation of the traditional doctrines of the Church, such as the episcopal structure, clerical celibacy, the seven Sacraments, transubstantiation (the belief that during mass the consecrated bread and wine truly become the body and blood of Christ), the veneration of relics, icons, and saints (especially the Blessed Virgin Mary), the necessity of both faith and good works for salvation, the existence of purgatory and the issuance (but not the sale) of indulgences, etc. In other words, all Protestant doctrinal objections and changes were uncompromisingly rejected. The council also fostered an interest in education for parish priests to increase pastoral care. Milan's Archbishop Carlo Borromeo set an example by visiting the remotest parishes and instilling high standards. A protracted debate followed the council on whether the teaching of the Church Fathers more closely matched Trent or the Evangelicals.\nSecular influence\nThe monasteries also provided refuge to those sick of earthly life like Charles V, Holy Roman Emperor who retired to Yuste in his late years, and his son Philip II of Spain, who was functionally as close to a monastic as his regal responsibilities permitted.\nSpread of Christianity\nThe issue resulted in a crisis of conscience in 16th-century Spain. An outpouring of self-criticism and philosophical reflection among Catholic theologians, most notably Francisco de Vitoria, led to debate on the nature of human rights and the birth of modern international law.\nIn 1521, through the leadership and preaching of the Portuguese explorer Ferdinand Magellan, the first Catholics were baptized in what became the first Christian nation in Southeast Asia, the Philippines. The following year, Franciscan missionaries arrived in what is now Mexico, and sought to convert the Indians and to provide for their well-being by establishing schools and hospitals. They taught the Indians better farming methods and easier ways of weaving and making pottery. Because some people questioned whether the Indians were truly human and deserved baptism, Pope Paul III in the papal bull Veritas Ipsa or Sublimis Deus (1537) confirmed that the Indians were deserving people. Afterward, the conversion effort gained momentum.\nOver the next 150&nbsp;years, the missions expanded into southwestern North America. The native people were legally defined as children, and priests took on a paternalistic role, often enforced with corporal punishment. In India, Portuguese missionaries and the Spanish Jesuit Francis Xavier evangelized among non-Christians and a Christian community which claimed to have been established by Thomas the Apostle.\nWhitby Abbey England, one of hundreds of European monasteries destroyed during the Reformation.\nRenaissance Church\nIn Europe, the Renaissance marked a period of renewed interest in ancient and classical learning. It also brought a re-examination of accepted beliefs. Cathedrals and churches had long served as picture books and art galleries for millions of the uneducated. The stained glass windows, frescoes, statues, paintings and panels retold the stories of the saints and of biblical characters. The Church sponsored great Renaissance artists like Michelangelo and Leonardo da Vinci, who created some of the world's most famous artworks. The acceptance of humanism had its effects on the Church, which embraced it as well. In 1509, a well known scholar of the age, Erasmus, wrote The Praise of Folly, a work which captured a widely held unease about corruption in the Church.\nThe papacy was questioned by councilarism expressed in the councils of Constance and the Basel. Real reforms during these ecumenical councils and the Fifth Lateran Council were attempted several times but thwarted. They were seen as necessary but did not succeed in large measure because of internal feuds within the Church, ongoing conflicts with the Ottoman Empire and Saracenes and the simony and nepotism practiced in the Renaissance Church of the 15th and early 16th centuries. As a result, rich, powerful and worldly men like Roderigo Borgia (Pope Alexander VI) were able to win election to the papacy.\nMelk Abbey&mdash;adjoining [[Wachau Valley, Lower Austria&mdash;exemplifies the Baroque style.]]\nThe Council of Trent generated a revival of religious life and Marian devotions in the Catholic Church. During the Reformation, the Church had defended its Marian beliefs against Protestant views. At the same time, the Catholic world was engaged in ongoing Ottoman Wars in Europe against Turkey which were fought and won under the auspices of the Virgin Mary. The victory at Battle of Lepanto (1571) was accredited to her \"and signified the beginning of a strong resurgence of Marian devotions, focusing especially on Mary, the Queen of Heaven and Earth and her powerful role as mediatrix of many graces\". The Colloquium Marianum, an elite group, and the Sodality of Our Lady based their activities on a virtuous life, free of cardinal sins.\nEastern Orthodoxy\nSerbian Orthodox Church\nShortly after the Turkish conquest of Belgrade in 1521 and victory in the Battle of Mohacs in 1526, Serbian Metropolitan Pavle of Smederevo made a series of attempts to restore the Serbian Patriarchate, and for a short time managed to seize the throne of Peć, proclaiming himself to be the new Archbishop of Peć and Serbian Patriarch. By 1541, his movement was crushed by joint forces of the Archbishopric of Ohrid and the Ecumenical Patriarchate of Constantinople. In spite of that, Serbian Church leaders continued to hope for a new chance to renew their old Patriarchate.\nSerbian Patriarchate of Peć was finally restored in 1557 thanks to the mediation of some highly influential dignitaries in Turkish Court.\nChurch of Sinai\nIn 1575, the Ecumenical Patriarchate of Constantinople granted Mount Sinai autonomous status.\nUnion of Brest\nThe Uniate movement within East-Central Europe was started with the 1598&ndash;1599 Union of Brest, by which the \"Metropolia of Kiev-Halych and all Rus'\" entered into relationship with the Catholic Church.\nThe Eastern Catholic churches consider themselves to have reconciled the East-West Schism by keeping their prayers and rituals similar to those of Eastern Orthodoxy, while also accepting the primacy of the Bishop of Rome.\nSome Eastern Orthodox charge that joining in this unity comes at the expense of ignoring critical doctrinal differences and past atrocities. From the perspective of many Eastern Orthodox, Eastern Catholicism is a ploy by Catholicism to undermine and ultimately destroy their church by undermining its legitimacy and absorbing it into the Catholic Church. It is feared that this ploy would diminish the power to the original eastern Patriarchs of the church and would require the acceptance of rejected doctrines and Scholasticism over faith.\nRussian Orthodox Church\nIn 1547, Ivan IV assumed the title of “Tsar and Grand Duke of all Rus'” (Царь и Великий князь всея Руси) and was crowned on 16 January, thereby turning the Grand Duchy of Moscow into Tsardom of Russia, as it was called in the coronation document. The growing might of the Russian state contributed also to the growing authority of the autocephalous Russian Church. Realizing the necessity of strengthening the ecclesiastic authority in Russia, Boris Godunov managed to persuade the Ecumenical Patriarch of Constantinople Jeremias II to establish a patriarchate in Russia. In 1589, Metropolitan Job of Moscow became the first Patriarch of Moscow and all the Rus', making the Russian Church one of the Orthodox patriarchates.\nTimeline\nSee also\n*History of Christianity\n*History of Protestantism\n*\n*\n*\n*History of Oriental Orthodoxy\n*Timeline of the English Reformation\n*\n*\n*Timeline of the Roman Catholic Church#1454–1600\n*Catholic-Protestant relations\n*Chronological list of saints and blesseds in the 16th century\nNotes\nReferences\n* Bainton, Roland. Here I Stand: a Life of Martin Luther (New York: Penguin Books, 1995)\n*\n*\n*\n* MacCulloch, Diarmaid, The Reformation: A History (New York: Penguin Books, 2004)\n*\n*\nFurther reading\n* Esler, Philip F. The Early Christian World. Routledge (2004). .\n* White, L. Michael. From Jesus to Christianity. HarperCollins (2004). .\n* Freedman, David Noel (Ed). Eerdmans Dictionary of the Bible. Wm. B. Eerdmans Publishing (2000). .\n* Pelikan, Jaroslav Jan. The Christian Tradition: The Emergence of the Catholic Tradition (100-600). University of Chicago Press (1975). .\nExternal links\n*[http://www.ccel.org/ccel/schaff/npnf214.html Schaff's The Seven Ecumenical Councils]"
    }
  ]
}