{
  "content": [
    {
      "type": "text",
      "text": "# Chuck Tanner Baseball Manager of the Year Award\n\nThe Chuck Tanner Baseball Manager of the Year Award is the original name for two awards that are given by the Rotary Club of Pittsburgh, in Pittsburgh, Pennsylvania. It is named for Chuck Tanner, former manager of the Pittsburgh Pirates, and was first awarded on November 17, 2007, at the city's Rivers Club. For the first three years, the award was given to a manager in Major League Baseball. In 2010, a second award was presented to the \"Chuck Tanner Collegiate Baseball Manager of the Year\"; the original award was renamed the \"Chuck Tanner Major League Baseball Manager of the Year Award\".\nDuring the selection process, a major factor for the committee is each candidate's career achievement.\nProceeds from the annual awards dinner in November are used by the club to support its humanitarian service initiatives and Rotary Foundation programs.\nWinners\nChuck Tanner Major League Baseball Manager of the Year Award\n:See footnote\n{| class=\"wikitable sortable\"\n!Year!!Winner!!Team!!class=unsortable|Ref\n|-\n|2007||||Los Angeles Dodgers||\n|-\n|2008||||Tampa Bay Rays||\n|-\n|2009||||Minnesota Twins||\n|-\n|2010||||Philadelphia Phillies||\n|-\n|2011||||Detroit Tigers||\n|-\n|2012||||Washington NationalsOakland Athletics||\n|}\nChuck Tanner Collegiate Baseball Manager of the Year Award\n*2010 – Joe Jordano, University of Pittsburgh\n*2011 - Jim Chester, Penn State Greater Allegheny\n*2012 - Loren Torres, Point Park University\nSee also\n*Manager of the Year Award\n*The Sporting News Manager of the Year Award\n*MLB This Year in Baseball Awards Manager of the Year\n*Baseball America Manager of the Year\n*Baseball Prospectus Internet Baseball Awards Manager of the Year\n*Associated Press Manager of the Year (discontinued in 2001)\n*Honor Rolls of Baseball#Managers\n*Sporting News Manager of the Decade (2009)\n*Sports Illustrated MLB Manager of the Decade (2009)\n*MLB All-Time Manager (1997; BBWAA)\n*MLB all-time managerial wins\n*Baseball awards#U.S. major leagues: Awards by organizations other than MLB\n*List of MLB awards\n*List of college baseball awards#Coaching awards\n*Baseball awards#U.S. college baseball\nReferences\nFurther reading\n*\nExternal links\n*[http://www.pittsburghrotary.org/ Rotary Club of Pittsburgh] official website (click on \"Chuck Tanner Event\")"
    }
  ]
}