{
  "content": [
    {
      "type": "text",
      "text": "# Church War of Jonesboro\n\nThe Church Wars of Jonesboro were a series of conflicts in Jonesboro, Arkansas between followers of the fundamentalist evangelist Joe Jeffers and the Reverend Dow H. Heard, pastor of the First Baptist Church of Jonesboro.\nMembers of Jeffers' congregation also attacked the mayor and police chief, resulting in Governor Harvey Parnell calling out the Arkansas National Guard.\nBackground\nJoe Jeffers was born in 1898 to railroad workers in Roanoke, Oklahoma. He was one of 15 children, many of whom went on to become foreign missionaries. At the age of 20, in 1918, he was ordained as a Baptist minister, and was an avid follower of J. Frank Norris. Jeffers started his career as an actor/comedian and later turned to become a traveling evangelist.\nOn June 29, 1930 Jeffers was invited by the First Baptist Church and Jonesboro Bible College to Craighead County, Arkansas to begin a series of tent revival meetings. His meetings gained popularity and he preached through June until early August. When the pastor of the First Baptist Church (A. W Reaves) resigned, the congregation elected Jeffers. Later a large percent of the congregation claimed that they were not represented and called for a revote. Instead, the congregation chose Dow H. Heard of Big Springs, Texas. While the agreement was being reached, Jeffers took a leave of absence, and once Heard had been elected, he left to continue his ministry elsewhere.\nFirst Baptist Church Conflict\nDuring August 1931 Jeffers returned to Craighead County to inaugurate ongoing revival meetings. His sermons included warning that the Second Coming was to occur in May 1932 and accused both Heard and Mayor Herbert J. Bosler of immoral activity. On September 9, a brawl broke out between Jeffers and Heard’s supporters at the First Baptist Church. George L. Cox Jr., a Jeffers supporter, was decided as the aggressor and was to be tried the next day.\nThe following day Jeffers led a group of his supporters to the courthouse to protest Cox’s arrest. During a prayer at the protest, Jeffers asked God to “strike the mayor dead”. Jeffers supporters also attacked Mayor Bosler and the police chief W. C. Craige. Governor Harvey Parnell allowed the use of state troops at Arkansas State College and other troops around the state to occupy Craighead County. The occupation also included the use of military observation plane. The troops stationed themselves throughout the town and Jeffers’ tent, which had held crowds as 5,000 people. Jonesboro at the time had a population of just over 10,000.\nBy September 14, the troops were withdrawn. Two days later on September 16, a tear-gas bomb was dropped outside Jeffers’ tent. Tensions continued to grow when 21 of Jeffers’ followers were expelled from the First Baptist Church. On October 25, Jeffers’ revival tent was burned down. Heard supporters claimed that it was a false flag operation and was used to slander them and gain support for Jeffers.\nJonesboro Baptist Church conflict\nJeffers had already planned to establish a tabernacle, named Jonesboro Baptist Church. The tabernacle was built at Matthews and Cobb Street, and the congregation continued to meet there. Shortly after the church was built, Jeffers left and hired Pastor Dale Crowley of Deaton, Texas to run the church.\nAfter 11 months, Jeffers returned to the church but he had changed many of his fundamentalist ideas. Jeffers and Crowley often fought over control of the church and theology. The church formed two factions (one led by Jeffers, the other by Crowley) and occasionally held services at the same time. There were two sermons and choirs competing to drown the other out.\nOn August 14, 1933 a scuffle broke out at Jonesboro Baptist Church, which included fistfights and men brandishing shotguns. To prevent further conflict Jeffers and Crowley decided to bring the dispute to court. On October 9, the court ruled in Crowley’s favor and awarded him the church.\nThe following day, Crowley and his bodyguard L. H. Kayes went to claim the tabernacle. On the way they got into a shootout with J. W. McMurdo, a janitor and watchman hired by Jeffers. Crowley was unharmed although Kayes was injured. McMurdo was shot twice in the leg and once in the abdomen and died two days later. Crowley was arrested and at the hearing on October 14 and claimed he acted in self-defence. On October 17, an unknown assailant attempted to assassinate Crowley at Craighead County jail by putting his machine gun through the bars and pulling the trigger. Crowley was unharmed. On January 3, 1934 Crowley's trial began in Piggott, Arkansas after a change of venue due to the remaining tensions at Craighead County. Crowley was acquitted of murder charges and set free.\nAftermath\nAfter the shooting Jeffers left Craighead County for Miami, Florida where he renounced the Baptist Ministry. He became the leader of the Pyramid Power Yahweh group and a self-proclaimed prophet in Missouri. Heard and Crowley also soon left Jonesboro.\nReferences\n*John Plunkett, \"Church Fight Brings Troops to Nip Riot\", The New York Times, September 11, 1931, retrieved June 11, 2006.\n*\"Battle of Jonesboro\", Newsweek, September 21, 1931, retrieved June 11, 2006.\n*Jordan, Dusty. “Baptists Bring War to Jonesboro.” Craighead County Historical Quarterly 21 (Winter 1983): 1–9.\n*[http://encyclopediaofarkansas.net/encyclopedia/entry-detail.aspx?search=1&entryID=3487 Encyclopedia of Arkansas entry]"
    }
  ]
}