{
  "content": [
    {
      "type": "text",
      "text": "# Cinnabar, Queensland\n\n| pop                 = 83\n| pop_year            =\n| pop_footnotes       =\n| established         =\n| postcode            = 4600\n| area                = 152.7\n| timezone            = AEST\n| utc                 = +10:00\n| dist1               = 35.8\n| dir1                = NE\n| location1           = Murgon\n| dist2               = 61.0\n| dir2                = W\n| location2           = Gympie\n| dist3               = 226\n| dir3                = NW\n| location3           = Brisbane\n| dist4               =\n| dir4                =\n| location4           =\n| lga                 = Gympie Region\n| stategov            = Nanango\n| fedgov              = Wide Bay\n| near-n              = Tansey\n| near-ne             = Kilkivan\n| near-e              = Black Snake\n| near-se             = Wrattens Forest\n| near-s              = Manumbar\n| near-sw             = Kinbombi\n| near-w              = Goomeri\n| near-nw             = Boonara\n}}\nCinnabar is a rural locality in the Gympie Region, Queensland, Australia. In the , Cinnabar had a population of 83 people.\nGeography\nThe Wide Bay Highway enters the location from the north-west (Kilkivan) and exits to the south-west (Kinbombi).\nThe Breezer is a mountain in the south-west of the locality () which rises to  above sea level.\nCinnabar State Forest is a  forest reserve in the north-west of the locality (). Apart from the state forest, the land use is predominantly grazing on native vegetation with some crop-growing around the creeks.\nHistory\nIn 1872, the mineral cinnabar (a sulphide of mercury) was found on the sheep station of J.D. Mactaggart west of Kilkivan. The heavy dark-red stones found contained 24% mercury in addition to copper selenide. Mercury was extensively used in gold production in Australia at that time, but no significant quantities of mercury had been found in Australia and mercury had to be imported. A number of mining companies were established but many struggled to obtain initial capital or found the deposits in their mines less valuable than they had hoped. By 1892, mining had ceased, as mercury deposits found in other locations both in Queensland and elsewhere in Australia appeared to have greater promise.\nThe town of Cinnabar was established around 1873 and named after the cinnabar deposits in the area.\nThe Nanango railway line from Kilkivan to Goomeri via Cinnabar opened on 1 August 1902, with two stations serving the locality (from west to east):\n* Cinnabar railway station, serving the town ()\n* Wygarr railway station ()\nKingbombie Provisional School opened circa 1896. In 1903, it was renamed Cinnabar Provisional School. In 1916, it was renamed Nagoon Provisional School. It closed in 1917.\nCinnabar Railway Station State School opened on 2 May 1916, but was renamed in July 1916 as Cinnabar State School. It closed in 1971. The school was at 362 Cinnabar Road ().\nElambah Provisional School opened on 24 July 1922, but was quickly renamed Cinnabar Upper Provisional School. It closed on 11 March 1927 due to low student numbers.\nIn the 1930s, there was renewed interest in mercury due to rising prices and mining resumed in the area and the Kilkivan district more generally until 1945. Although mercury production in Australia has always been limited, nonetheless the deposits in the Kilkivan area produced the largest quantities of mercury due to the  higher grade of cinnabar found there.\nThe railway line closed in 2011 and was dismantled and redeveloped as the Kilkivan-to-Kingaroy rail trail.\nThe Cinnabar Hall opened on 4 June 1926.\nDemographics\nIn the , Cinnabar had a population of 72 people.\nIn the , Cinnabar had a population of 83 people.\nEducation\nThere are no schools in Cinnabar. The nearest government primary schools are Kilkivan State School in neighbouring Kilkivan to the north-west and Goomeri State School in neighbouring Goomeri to the west. Both these schools also offer secondary schooling to Year 10. For secondary schooling to Year 12, the nearest government schools are James Nash State High School in Gympie to the east and Murgon State High School in Murgon to the south-west.\nAttractions\nThe Kilkivan to Kingaroy Rail Trail follows the old railway line between the two towns. It is  long and passes through Goomeri, Murgon, Wondai, Tingoora, Wooroolin, Memerambi, and Crawford. The trail from Kilkivan to Murgon is unsealed. A low level bridge was opened across Wide Bay Creek in October 2021.  Short distances between towns means coffee is never far away.\nReferences\nExternal links\n*"
    }
  ]
}