{
  "content": [
    {
      "type": "text",
      "text": "# Circle of Homosexual Culture Mario Mieli\n\nThe Circle of Homosexual Culture Mario Mieli (Italian: Circolo di Cultura Omosessuale \"Mario Mieli\") is an association founded in Rome in 1983 to defend the civil rights of LGBT people and dedicated to gay writer and activist Mario Mieli.\nIt is an independent association based on volunteering: it deals with the claim and protection of the civil rights of LGBTQ people (lesbian, gay, bisexual, transgender, queer) and promotes cultural activities and socialization.\nIn this regard, it is actively fighting against homophobic and transphobic prejudice in the field of civil rights and a culture of differences, including lobbying on mass media, parties and institutions, in order to change the discriminatory attitude towards both sexual orientation and gender identity.\nThey are also actively involved in the strife against AIDS, organizing awareness campaigns and helping patients. For a long time it has been also a solid point of reference for knowledge and socialization among LGBTQ people, as it offered a \"welcome\" service that took place once a week at the club headquarters.\nCurrently, the association holds weekly meetings for a group dedicated to migrants, a group for young attendees of the association, and a group that discusses, proposes, and organizes cultural events.[1]\nThroughout the week, cultural events, book presentations, political debates, member meetings, and rehearsals for the Roma Rainbow Choir take place at the venue. The Roma Rainbow Choir is the official choir of the Circolo, established in August 2006, comprising individuals who identify as gay, lesbian, bisexual, transgender, queer, intersex, and heterosexual. Through music and singing, they strive to promote a culture of respect for all forms of love and self-determination.\nThese gatherings provide moments of aggregation, enabling LGBTQIA+ individuals from all over the Roman area and beyond to meet and form interpersonal connections.\nIn July 2022, the project \"Welcome4Rainbow – Reception for all colors of LGBT+ people\" was launched. It is funded by UNAR and carried out in collaboration with the associations Cirses, Libellula, Rete Lenford, Cora Roma, and Avi - Agenzia per la vita indipendente. Individuals can seek assistance through the RainbowLine, a toll-free helpline operated by the Circolo.\nHistory\nCircolo di Cultura Omosessuale Mario Mieli was established in 1983 through the merger of existing Roman organizations (Fuori! and Collettivo Narciso).\nIn the same year, Mario Mieli, a key figure in the LGBT movement throughout the previous decade, tragically died by suicide. As a tribute to him, the newly formed association was named after him.\nSince 1989, Circolo Mario Mieli has been providing home care services for people with AIDS, becoming the first in Rome to do so. This service is staffed by operators, psychologists, and social workers.\nAdditionally, the association offers psychological counseling, legal assistance, telephone counseling, and support groups for HIV-positive individuals, which can be accessed through a toll-free number.\nSince 1990, the Mario Mieli has been organizing the famous self-financing party \"Muccassassina.\" The party celebrated its 30th anniversary on January 5, 2020, with various artistic directions, including those of Vladimir Luxuria and the current director, Diego Longobardi.\nStarting from 1994, the Circolo has been the organizer of the annual Gay Pride event in Rome, currently known as Roma Pride, traditionally held on the second Saturday of June. In 1995, the Circolo became a member of the European Pride Organizers Association (EPOA) by the initiative of its then-president, Imma Battaglia, and in 2000, it hosted the World Pride, a global LGBT+ pride event culminating in a grand parade that marched through the streets of the capital on July 7, 2000[6]. The Circolo Mario Mieli was also the official organizer of Europride in Rome in 2011, remembered worldwide for its massive turnout and the participation of Lady Gaga.\nFrom 1994 to 2011, the association published the free monthly magazine Aut, distributed nationwide, featuring renowned Italian journalists. In June 2023, the publication of \"Aut\" resumed as an online magazine, with Egizia Mondini as the editor-in-chief, previously the managing editor.[7]\nThe Circolo houses the Marco Sanna Documentation Center, dedicated to a historic activist who was involved in the association. The documentation center consists of books, documents, periodicals, newspaper articles, photographs, and audiovisual material, preserving the historical memory of the Roman and national LGBT+ movement from the 1970s to the present. In 2010, the Vinicio Diamanti Fund was established within the center, dedicated to the actor and star en travesti of the avant-garde show, following a donation from the family.\nThe current headquarters of the Circolo is located in Rome, at Via Efeso 2a, near the \"Basilica San Paolo\" metro station on line B.\nThe presidents of the Circolo have included: Bruno Di Donato, Vanni Piccolo, Andrea Pini, Pino Anastasi, Deborah Di Cave, Imma Battaglia (1995-2000), Massimo Mazzotta (2000-2004), Rossana Praitano (2004-2009), Andrea Maccarrone (for only two months in 2009), Rossana Praitano (2009-2012), Andrea Maccarrone (2012-2015), Mario Colamarino (2015-2017), Sebastiano Francesco Secci (2017-2020), Valerio Colomasi Battaglia (2020), Claudio Mazzella (2021). Since November 2021, Mario Colamarino has been the president once again.\nThe Circolo is a member of EPOA and InterPride and was the organizer of Roma Europride 2011, held in collaboration with Arcigay, Famiglie Arcobaleno, MIT, and Agedo from June 1 to 12, 2011.[8]\nOn August 3, 2017, the Circolo announced that it had submitted its candidacy to organize World Pride 2025 in Rome, 25 years after the first event.\nReferences"
    }
  ]
}