{
  "content": [
    {
      "type": "text",
      "text": "# Citizen Revolution Movement\n\n| abbreviation     = RC\n| president        = Luisa González\n| leader           = Rafael Correa\n| general_secretary = Andrés Arauz\n| founder          = Iván Espinel\n| foundation       = July 2010 August 2021\n| dissolution      =\n| registered       =\n| split            = PAIS Alliance\n| headquarters     = Av. 6 de Diciembre N14- 136 y Piedrahita, Quito, Pichincha Province, Ecuador\n| newspaper        =\n| youth_wing       = Frente de Jóvenes de la RC\n| womens_wing      =\n| slogan           = Until Victory Always!\n| think_tank       = CEFORMA\n| wing1_title      =\n| wing1            =\n| membership       = 200,000\n| membership_year  = 2022\n| ideology         =\n|Correism\n| Left-wing populism\n| Social democracy}}\n}}\nFaction: Social conservatism\n| position         = }} to left-wing}}}}\n| national         = Union for Hope (2020-2023)\n| regional         = São Paulo Forum\n| international    =\n| affiliation1_title =\n| affiliation1     =\n| colors           = |border=darkgray}} Cyan White Red\n| seats1_title     = National Assembly\n| seats1           = }}\n| seats2_title     = Provincial Prefects\n| seats2           = }}\n| seats3_title     = Mayors\n| seats3           = }}\n| seats4_title     = Andean Parliament\n| seats4           = }}\n| symbol           =\n| flag             =\n| website          =\n| country          = Ecuador\n}}\nThe Citizen Revolution Movement (, RC) is a centre-left to left-wing political party in Ecuador formed by supporters of former President Rafael Correa who distanced themselves from Correa's former PAIS Alliance party during the presidency of Lenín Moreno. The party takes its name from the term used to refer to the project of building a new society.\nHistory\nThe party has its origins in early January 2018, as former Ecuadorian President and PAIS leader Rafael Correa left the ruling party over disagreement with the new direction of the party under Lenín Moreno. The party was formed by Correa and a large faction of left-wing PAIS defectors shortly after Correa left PAIS.\nThe party faced difficulties in obtaining official registration, as Ecuador's electoral authorities refused to register the party and give it access to the signature collection system, as they stated the party was using the symbols and slogans of the PAIS Alliance. The movement's leaders then attempted to register the party under the name \"Revolutionary Alfarist Movement\", named after former Ecuadorian President Eloy Alfaro, but this was also rejected by Ecuador's electoral authorities. The party's authorities blamed \"political direction\" by Lenín Moreno's government for these refusals, accusing them of seeking to \"prevent the political participation\" of the movement and its members.\n, the titular movement which inspired the creation of the party.]]\nThe 11 April 2021 presidential election run-off vote ended in a win for conservative former banker, Guillermo Lasso, taking 52.4% of the vote compared to 47.6% of the candidate of Citizen Revolution Movement, left-wing economist Andrés Arauz, supported by exiled former president, Rafael Correa.\nIn June 2021, it was reported that Arauz had resigned the leadership of the Citizen Revolution movement and he was briefly replaced by Raisa Corral who is a legislator for Manabi. She was succeeded by Marcela Aguiñaga as president of the Citizen Revolution Movement later in 2021.\nGonzález was selected as the Citizen Revolution Movement's presidential candidate for the 2023 presidential election, with Andrés Arauz as her running mate. One of her campaign promises was to make former President Rafael Correa a central figure in her administration. After finishing in first place in the first round of voting, she went on to lose to Daniel Noboa, securing 47% of the vote. Gonzalez would go on to lose the 2025 presidential election once again to Noboa, winning 44% of the vote, refusing to concede and alleging fraud without providing evidence.\nIdeas\nIt has been described as representing socialism of the 21st century.\nOn August the 28th 2021, the Citizen’s Revolution Movement laid out its principles, describing them in these terms:\nElection results\nNational Assembly elections\n{| class=\"wikitable\" style=\"text-align:center\"\n!Election\n!Leader\n!Votes\n!%\n!Seats\n!+/–\n!Result\n|-\n!2021\n| rowspan=\"3\" |Rafael Correa\n|2,584,595\n|32.21\n|}}\n|New\n|\n|-\n!2023\n|3,326,110\n|39.72\n|}}\n|\n|\n|-\n!2025\n|3,764,096\n|41.32\n|}}\n| 24\n|\n|}\nPresidential elections\n{| class=\"wikitable\"\n!Election\n!Candidate\n!Votes\n!%\n!Result\n|-\n!2021\n|Andrés Arauz\n|4,236,515\n|47.64%\n|\n|-\n!2023\n| rowspan=\"2\" |Luisa González\n|4,880,525\n|48.17%\n|\n|-\n!2025\n|4,670,260\n|44.40%\n|\n|}\nSee also\n* Margarita Arotingo\nReferences\nExternal links\n*"
    }
  ]
}