{
  "content": [
    {
      "type": "text",
      "text": "# City for Conquest__disambig_1\n\n| producer       = Anatole LitvakHal B. Wallis (uncredited)\n| screenplay     = John Wexley\n| starring       = James CagneyAnn SheridanArthur KennedyFrank CravenAnthony QuinnElia Kazan\n| music          = Max Steiner\n| cinematography = James Wong HoweSol Polito\n| editing        = William Holmes\n| distributor    = Warner Bros.\n| released       =\n| runtime        = 104 minutes\n| language       = English\n| budget         = $920,000\n| gross          = $1,794,000\n| country        = United States\n}}\nCity for Conquest is a 1940 American epic drama film directed by Anatole Litvak and starring James Cagney, Ann Sheridan and Arthur Kennedy. The film is based on the 1936 novel of the same name by Aben Kandel. The supporting cast features Elia Kazan, Anthony Quinn, Donald Crisp, Frank McHugh, Frank Craven and Lee Patrick.\nPlot\nA vagabond arrives in New York and is instantly enamored with the city. Traveling through the poorer side of town, he meets Danny Kenny, who shows a talent for boxing but does not aspire to become a professional fighter. Danny's girlfriend Peggy is a skilled dancer who dreams of becoming a star.\nYears later, despite once having won a New York Golden Gloves title, Danny takes a job as a truck driver. To fund his brother Eddie's tuition at a music school, Danny begins to box professionally under the name of Young Samson. He quickly rises through the welterweight ranks to become a title contender.\nOne night, while at a dance club with Danny, Peggy is swayed by Murray Burns, a local dancing champion. Murray asks Peggy to become his professional dance partner, insulting Danny in the process. Peggy agrees but soon learns that Murray is a domineering man who constantly tries to control her life and even sexually abuses her.\nJust before their wedding, Peggy rejects Danny in a letter, as her dancing career is advancing rapidly. Embittered by Peggy's change of mind, Danny continues to thrive in the ring and earns a chance to fight for the world welterweight title. During the title fight, Danny gains the upper hand. However, the champion cheats by deliberately blinding Danny with rosin-dusted gloves. While Peggy listens to the fight on the radio, Danny takes a severe beating and loses. Peggy becomes so distraught that she is unable to take the stage that night. Her career as a successful dancer ends, and she is reduced to dancing in local shows for low wages.\nDanny quits boxing because of his damaged eyesight and opens a newsstand with help from his manager, gaining many regular customers. Eddie becomes a successful composer of Broadway songs, but his true love is instrumental music. Danny persuades Eddie to pursue his true calling and continue to work on creating a symphony about New York City. Eddie dedicates his first major symphony at Carnegie Hall to Danny, who proudly listens to the performance on the radio from his newsstand. Sensing Danny's soul in the music, Peggy decides to talk to him despite believing that he is still angry at her. At the newsstand, the two tearfully profess their love for each other and decide to resume their relationship.\nCast\n* James Cagney as Danny Kenny\n* Ann Sheridan as Peggy 'Peg' Nash\n* Arthur Kennedy as Eddie Kenny\n* Frank Craven as Old Timer\n* Anthony Quinn as Murray Burns\n* Elia Kazan as Googi Zucco\n* Donald Crisp as Scotty MacPherson\n* Frank McHugh as Mutt\n* George Tobias as Pinky\n* Jerome Cowan as Dutch\n* Lee Patrick as Gladys\n* Blanche Yurka as Mrs. Nash\n* George Lloyd as Goldie\n* Joyce Compton as Lilly\n* Thurston Hall as Max Leonard\n* Ben Welden as Cobb\n* John Arledge as Salesman\n* Ed Keane as Gaul\n* Selmer Jackson as Doctor 1\n* Joseph Crehan as Doctor 2\n* Ward Bond as First Policeman (uncredited)\n* Charles Lane as Al, the theatrical booking agent (uncredited)\nProduction\nGeorge Raft was originally intended to appear opposite Cagney, but Anthony Quinn played his part in the film.\nThe tramp who appears and narrates the film is portrayed by Frank Craven as a sort of urban parody of his role as the stage manager in Our Town, which he had filmed just before City for Conquest.\nReception\nIn a contemporary review for The New York Times, critic Bosley Crowther wrote: \"To folks who vision New York in strictly tabloid terms, we can heartily recommend this compendium of life's little tragedies. For it has about everything that the Warners dish up very well—the East Side slums, taxi dance halls, Stillman's gymnasium, prize fights, gangsters, pent house parties, burlesque cuties. ... But mainly it has Jimmy Cagney and Ann Sheridan to play the broken-hearted love story of a prizefighter who goes blind and a professional dancer ... Any picture that has Mr. Cagney and Miss Sheridan is bound to be tough and salty, right off the city' s streets. And this one is.\"\nCritic Edwin Schallert of the Los Angeles Times wrote: \"'City for Conquest' is permeated with an idealism that makes it far more  than most pictures detailing events in the quick-money areas of New York City. It is directed with more style than might be normally anticipated in a story of prizefighting, and night club and stage life. 'City for Conquest' unquestionably mixes values and may not find popularity with those who prefer patterned entertainment, but many will undoubtedly discover in the result far more worth than prevails in the majority of productions.\"\nAccording to Warner Bros. records, the film earned $1,156,000 domestically and $638,000 in foreign markets.\nHome media\nCity for Conquest was released by Warner Home Video on July 18, 2006, as a Region 1 full-screen DVD and again on October 12, 2010, on the first of four discs in the TCM Greatest Gangster Films Collection: James Cagney.\nSee also\n* List of boxing films\nReferences\nExternal links\n*\n*\n*\n* , \"fair use\" compilation [http://www.copyright.gov/title17/92chap1.html#101 (definition)] from film scenes"
    }
  ]
}