{
  "content": [
    {
      "type": "text",
      "text": "# City of the Spider Queen__disambig_1\n\nCity of the Spider Queen is a 160-page adventure module set in the Forgotten Realms campaign setting, for use with the 3rd edition of the fantasy role-playing game Dungeons & Dragons.\nPlot summary\nAccording to the adventure background provided, drow priestesses are no longer receiving spells or guidance from their goddess, Lolth. While in most places the drow have remained steadfast, the Underdark city of Maerimydra is in a state of unrest and has been invaded by a host of enemy creatures. Some of the desperate survivors have begun making raids on the surface world. The adventure outline provided states that the player characters will be investigating these raids, travelling through the Underdark and exploring the ruined city, fighting the creatures that have taken it over, ultimately fighting a priestess of the rival drow goddess Kiaransalee.\nCity of the Spider Queen begins with an introduction on pp. 3–9. Following the introduction is the four-chapter adventure scenario: Part 1: Spinning the Web, is on pp. 10–44, Part 2: The Deep Wastes, is on pp. 45–63, Part 3: Maerimydra, is on pp. 64–101, and Part 4: The Undying Temple, is on pp. 102–114. The book also features two appendices. Appendix 1: Monsters and Magic, on pp. 115–130, features the statistics for several monsters used in the adventure, and also presents a number of spells and magic items. Appendix 2: Creature Statistics, pp. 131–160, contains a summary of the statistics for all the NPCs and monsters that appear throughout the adventure. Included in the back of the book are 16 one-page maps of various locations that the characters may explore as part of the adventure.\nPublication history\nThe softcover adventure module was published in September 2002, and was written by James Wyatt. Cover art is by Todd Lockwood and interior art by Scott Fischer, Rebecca Guay, Vince Locke, Raven Mimura, Puddnhead, Christopher Shy, Ben Templesmith, and Sam Wood.\nCity of the Spider Queen was released as part of Wizards of the Coast's \"Year of the Drow\" multimedia event which also included the start of the six-book series War of the Spider Queen (2002–2005), R. A. Salvatore's novel The Thousand Orcs (2002), and the City of the Spider Queen Miniatures Boxed Set (2002) along with articles in Dragon #298 and Dungeon #94 and a crossover in the Chainmail Miniatures Game. Rich Baker commented on how the adventure was developed: \"James [Wyatt] and I were present in the original planning sessions with Bob Salvatore, Richard Byers, Thomas Reid, and Phil Athans as the whole War of the Spider Queen plan was hammered out, so the game guys and book guys were able to put together a common plot that everyone was happy with. That said, we hit an early snag when we realized that the adventure's original setting would give away the plot of the second book in the War of the Spider Queen series, but James came up with an alternate location for the adventure that worked even better than the original site.\"\nIt was the only official Forgotten Realms module for the 3rd Edition. City of the Spider Queen did not meet its projected sales targets, so Wizards of the Coast cut back on production of new adventures. A web enhancement later released for the ''Player's Guide to Faerûn (2004) updated all the monsters in this module for 3.5.\nReception\nCity of the Spider Queen won the 2002 Origins Award for Best Role-Playing Adventure. At the 18th Chesley Awards, Todd Lockwood won \"Best Gaming-Related Illustration\" for his \"Spider Queen\" piece in City of the Spider Queen. James Voelpel, from mania.com, commented: \"City of the Spider Queen'' is an excellent addition to anyone's Forgotten Realms campaign or with modifications, any Dungeons and Dragons 3rd Edition game.\" Dungeon Master for Dummies lists City of the Spider Queen as one of the ten best 3rd edition adventures.\nThe adventure was ranked the 24th greatest adventure of all time by Dungeon magazine for the 30th anniversary of the Dungeons & Dragons game in 2004. Shannon Appelcline explained that the module is \"primarily a dungeon crawl\" which broke \"new ground both with its extensive Underdark encounters and its depiction of the (fallen) drow city of Maerimydra\", a city previously listed in Drow of the Underdark (1991) without detail. Appelcline commented that \"most players see City of the Spider Queen as a hack-and-slash adventure, but it's even more notable as a strong example of the rules-mastery focus of D&D 3e. The adventure is a tough one, requiring well-designed character who are organized into well-designed parties\" as otherwise it can become deadly.\nReviews\n* #45 (as \"La Cité de la Reine-Araignée\")\nReferences\n* Wyatt, James. City of the Spider Queen (Wizards of the Coast, 2002).\nExternal links\n* [https://web.archive.org/web/20121020223531/http://www.wizards.com/default.asp?x=dnd/we/20020907a City of the Spider Queen: Web Enhancement] (Wizards of the Coast, 2002) via the Wayback Machine\n* ''[https://web.archive.org/web/20130531114012/http://www.wizards.com/default.asp?x=dnd/we/20040313a Player's Guide to Faerun: Monster Update]'' (Wizards of the Coast, 2004) via the Wayback Machine"
    }
  ]
}