{
  "content": [
    {
      "type": "text",
      "text": "# Civil War (song)\n\nUse Your Illusion II\n| B-side     =\n* \"Garden of Eden\" (LP version) (German)\n* \"Exclusive Interview with Slash\" (German)\n| released   =\n| recorded   =\n| studio     =\n| venue      =\n| genre      =\n* Hard rock\n* progressive rock\n*  heavy metal\n| length     = 7:40\n| label      =\n* Geffen\n* Uzi Suicide\n| writer     =\n* Axl Rose\n* Slash\n* Duff McKagan\n| producer   =\n* Mike Clink\n* Guns N' Roses\n| prev_title = Yesterdays\n| prev_year  = 1992\n| next_title = Ain't It Fun\n| next_year  = 1993\n}}\n\"Civil War\" is a song by American rock band Guns N' Roses that originally appeared on the 1990 compilation ''Nobody's Child: Romanian Angel Appeal'' and later on the band's 1991 album Use Your Illusion II. It is a protest song on war, referring to all war as \"civil war\" and stating that war only \"feeds the rich while it buries the poor\". In the song, lead singer Axl Rose asks, \"What's so civil about war, anyway?\"\nThe song was originally released in 1990, when it peaked at number four on the US Album Rock Tracks chart (now the Mainstream Rock chart). It was then released worldwide in 1993, reaching number one in Poland, number two in Spain, and also charting in Australia, Belgium, the Netherlands, Norway, and New Zealand. Several regions instead saw the release of The \"Civil War\" EP, including Ireland and the United Kingdom. The EP reached number 11 on the UK Singles Chart and number 15 on the Irish Singles Chart. This is their last single to be recorded with drummer Steven Adler. He departed the band several months after its recording and was replaced by Matt Sorum before the song was released as a single.\nBackground\n\"Civil War\" was the brainchild of the Guns N' Roses members Axl Rose, Slash, and Duff McKagan. Slash stated that the song was an instrumental he had written right before the band left for the Japanese leg of its Appetite for Destruction world tour. Axl wrote lyrics and it was worked into a proper song at a sound check in Melbourne, Australia. On September 27, 1993, Duff McKagan explained where the song came from in an interview on Rockline:\nBasically it was a riff that we would do at sound-checks. Axl came up with a couple of lines at the beginning. And... I went in a peace march, when I was a little kid, with my mom. I was like four years old. For Martin Luther King. And that's when: \"Did you wear the black arm band when they shot the man who said: 'Peace could last forever'?\" It's just true-life experiences, really.\nComposition\nCivil War has been described as a hard rock, progressive rock, heavy metal and glam metal song.\nReception\n\"Civil War\" reached number four on the Mainstream Rock chart in Billboard. Kerrang! ranked the song the 14th best Guns N' Roses song.\nLive version\nThe song was first played at Farm Aid 1990, the only time the song was played with drummer Steven Adler. The song was played many times from 1991 through 1993, though after 1993 the song was not performed again until December 4, 2011, at the Bridgestone Arena in Nashville, Tennessee. As of 2019, the song is played at almost every show, with performances from 2022 onwards displaying the Ukrainian Flag on screen in support of Ukraine after the Russian invasion of Ukraine.\nTrack listings\nPersonnel\n* W. Axl Rose – lead vocals, whistling\n* Slash – lead guitar, acoustic guitar\n* Izzy Stradlin - rhythm guitar, backing vocals\n* Duff McKagan – bass guitar, backing vocals\n* Steven Adler – drums\n* Dizzy Reed – piano, backing vocals\nCharts\n{|class=\"wikitable plainrowheaders\" style=\"text-align:center\"\n!Chart (1990)\n!Peakposition\n|-\n|}\n{|class=\"wikitable sortable plainrowheaders\" style=\"text-align:center\"\n!Chart (1993)\n!Peakposition\n|-\n|-\n|-\n|-\n|-\n|-\n|-\n!scope=\"row\"|Spain (AFYVE)\n| 2\n|-\n|-\n!scope=\"row\"|UK Airplay (Music Week)\n| 31\n|}\nCertifications\nRelease history\n{|class=\"wikitable plainrowheaders\"\n!scope=\"col\"|Region\n!scope=\"col\"|Date\n!scope=\"col\"|Format(s)\n!scope=\"col\"|Label(s)\n!scope=\"col\"|\n|-\n!scope=\"row\"|Europe\n|May 3, 1993\n|CD\n|rowspan=\"2\"|\n|\n|-\n!scope=\"row\"|Australia\n|May 10, 1993\n|\n|\n|-\n!scope=\"row\"|Japan\n|June 23, 1993\n|CD\n|Geffen\n|\n|}\nAllusions, sampling, and covers\nThe song samples Strother Martin's speech in the 1967 movie Cool Hand Luke: \"What we've got here is... failure to communicate. Some men you just can't reach. So you get what we had here last week, which is the way he wants it... well, he gets it. I don't like it any more than you men.\"\nIt quotes a speech by a Peruvian Shining Path guerrilla officer saying \"We practice selective annihilation of mayors and government officials, for example, to create a vacuum, then we fill that vacuum. As popular war advances, peace is closer\".\nThe song also includes the American Civil War song \"When Johnny Comes Marching Home\", whistled by Axl Rose in the intro and outro.\n\"Civil War\" is the B-side to the June 1991 release of Guns N' Roses' \"You Could Be Mine\" single, the promotional single for Terminator 2: Judgment Day. However, \"Civil War\" was not featured in the film.\nOf the 30 combined tracks on Use Your Illusion I and Use Your Illusion II, \"Civil War\" (track no.&nbsp;1 on Use Your Illusion II) is the sole track to be recorded featuring classic Guns N' Roses drummer Steven Adler, who was fired shortly after the track's recording in 1990. Adler was replaced by then-drummer for The Cult Matt Sorum, the drummer for all but one of the other 29 tracks on the two-disc set.\nThis song was covered by the band Hoobastank for an acoustic set.\nSee also\n*List of anti-war songs\nReferences\nExternal links\n*[http://www.songfacts.com/detail.php?id=5258 Songfacts]"
    }
  ]
}