{
  "content": [
    {
      "type": "text",
      "text": "# Civil War (film)__disambig_1\n\n| starring       =\n* Sonoya Mizuno\n* Nick Offerman\n}}\n| cinematography = Rob Hardy\n| editing        = Jake Roberts\n| music          =\n| studio         =\n| distributor    =\n| released       =\n| runtime        = 109 minutes\n| country        =\n| language       = English\n| budget         = $50 million\n| gross          = $127.3 million\n}}\nCivil War is a 2024 dystopian action thriller film written and directed by Alex Garland, starring Kirsten Dunst, Wagner Moura, Cailee Spaeny, Stephen McKinley Henderson, Sonoya Mizuno, and Nick Offerman. Set during a civil war fought across the United States between a despotic federal government and secessionist movements, the plot follows a group of war journalists traveling from New York City to Washington, D.C., to interview the president before rebels take the capital city.\nPrincipal photography began in Atlanta, Georgia, in 2022, with production moving to London later in the year. Civil War premiered at South by Southwest on March 14, 2024, and was theatrically released in the United States by A24 and in the United Kingdom by Entertainment Film Distributors on April 12, 2024. With a budget of $50 million, Civil War was A24's most expensive film at the time. The film grossed over $127.3 million worldwide, becoming A24's second-highest-grossing film, and received generally positive reviews from critics.\nPlot\nA civil war has engulfed the United States between the authoritarian federal government, led by a third-term president, and three secessionist movements. Despite the president claiming victory is imminent, it is widely expected that Washington, D.C. will soon be reached by the \"Western Forces\" (WF) led by Texas and California. After surviving a suicide bombing in New York City, jaded veteran war photographer Lee Smith and journalist colleague Joel from Reuters meet with their mentor Sammy, a reporter from The New York Times, to share their plan to interview the isolated president. While trying to dissuade them from heading to the capital, Sammy joins them to reach the front line at Charlottesville, Virginia. The following day, Lee finds Joel has allowed a young aspiring photojournalist whom Lee encountered at the bombing, Jessie Collin, to join them.\nAfter departing the city, the group stops at a gas station protected by armed men. Jessie explores a nearby car wash, where she finds the men torturing two alleged looters. One of the guards follows Jessie, but Lee defuses the situation by taking a photo of the man posing with his victims. Later, Jessie berates herself for being too scared to take pictures. Following an overnight stop near ongoing fighting, the group documents combat the next day as secessionist militiamen successfully assault a loyalist-held building. Lee recognizes Jessie's potential as a war photographer and begins to mentor her, while Jessie photographs the secessionists executing prisoners. The group spends the night at a refugee camp before passing through a small town where, under watchful guard, residents attempt to live in blissful ignorance of the war. Later, they are caught in a sniper battle amid the remains of a Christmas fair. Nearby snipers mock Joel's questioning of what side they are fighting for or against, instead summarizing the situation as killing those trying to kill them. Jessie's nerve and photography skills improve as she becomes increasingly desensitized to violence. Jessie asks if Lee would photograph Jessie being killed, to which Lee responds in the affirmative.\nWhile driving, the four encounter two foreign reporters they know, Tony and Bohai. Tony and Jessie switch vehicles before Bohai drives off ahead with Jessie in his car. The others catch up to find the pair held at gunpoint by unknown uniformed militia who are burying civilians in a mass grave. Sammy stays behind as the other three approach to attempt to negotiate their release, but the leader of the militia executes Bohai and Tony for not being \"American.\" Sammy saves the others after he rams the group's truck into members of the militia, but is mortally wounded in doing so. Traumatized, the remaining trio arrive at the Charlottesville WF base and find most of the remaining loyalists have surrendered, leaving Washington, D.C., undefended outside of fanatical remnants of the armed forces and Secret Service. Joel drunkenly lashes out at what he views as Sammy's pointless death, while Lee tries to console Jessie that Sammy would have liked to die on the job. Lee finds herself unable to document Sammy's death, quickly deleting a photo she took of his body. The trio embed themselves with the WF as they assault D.C., where Jessie repeatedly endangers herself during fighting to capture photographs, while Lee struggles with combat fatigue. When the WF breaches the White House's fortified perimeter, the presidential limousine flees but is quickly intercepted, and its occupants are killed. Understanding it as a distraction, Lee leads the trio inside the White House, followed by five WF soldiers.\nAdvancing through the primarily abandoned building, an abortive attempt by the few remaining Secret Service agents still guarding the president to negotiate his surrender and safe passage turns into a firefight. Jessie steps into the line of fire while taking photos, capturing Lee's death as she pushes Jessie to safety. Jessie unemotionally continues into the Oval Office, watching soldiers drag the president from under his desk and prepare to summarily execute him. Joel momentarily stops them to get a quote from the president, who pleads, \"Don't let them kill me.\" Satisfied, Joel stands aside as the president is executed, before Jessie photographs WF soldiers posing with his corpse.\nCast\n* Wagner Moura as Joel, a Reuters journalist from Florida and Lee's colleague\n* Cailee Spaeny as Jessie Collin, an aspiring young photographer from Missouri who accompanies Lee and Joel on their journey\n* Stephen McKinley Henderson as Sammy, a veteran journalist for The New York Times and Lee's mentor\n* Sonoya Mizuno as Anya, an English TV reporter embedded with the Western Forces' advance on the capital\n* Jefferson White as Dave, Anya's cameraman\n* Nelson Lee as Tony, a reporter from Hong Kong who is good friends with Lee and Joel\n* Karl Glusman as a spotter\n* Jin Ha as a sniper\n* Jonica T. Gibbs as a Western Forces sergeant\n* Juani Feliz as Joy Butler, a Secret Service agent\n* James Yaegashi as a secessionist corporal\n* Evan Lai as Bohai, a foreign reporter who is a colleague of Tony\n* Greg Hill as Pete, a gas station employee\n* Edmund Donovan as Eddie, a gas station employee\n* Nick Offerman as the President of the United States\n}}\nAdditional cast members include Jared Shaw, Justin Garza, Brian Philpot, and Tywaun Tornes as the Western Forces soldiers led by the sergeant in storming the White House. Jesse Plemons, Dunst's real-life husband, makes an uncredited appearance as a racist ultranationalist militant.\nProduction\nwrote Civil War as an allegory for the political climate in the US.]]\nIn January 2022, Deadline reported that Alex Garland had signed on to write and direct the film for A24 with DNA Films co-producing. Kirsten Dunst, Wagner Moura, Stephen McKinley Henderson, and Cailee Spaeny were confirmed to star. In April, Karl Glusman was announced as part of the cast. In a May interview with The Daily Telegraph, Garland described the film as a companion piece to his 2022 film Men, and said it is \"set at an indeterminate point in the future—just far enough ahead for me to add a conceit—and serves as a sci-fi allegory for our currently polarized predicament.\" In the same interview, Sonoya Mizuno was revealed as part of the cast, having appeared in all of Garland's previous films. Jesse Plemons, Dunst's husband, was cast in the uncredited role at Dunst's suggestion after the originally cast actor became unavailable a few days before shooting began. Garland called Plemons' availability \"a stunning bit of good luck.\"\nPrincipal photography began in Atlanta on March 15, 2022, under the code name Road Trip. By May, production had moved to London. The production budget for Civil War was $50 million, making it A24's most expensive film at the time. It was shot partially on the prosumer DJI Ronin 4D camera. The film's Washington D.C.–based finale required months of planning, with Alex Garland and cinematographer Rob Hardy holding a series of roundtable discussions with production designer Caty Maxey, VFX supervisor David Simpson, military supervisor Ray Mendoza and stunt coordinator Jeff Dashnaw. The scenes in the Washington streets were filmed in Stone Mountain, Georgia, while the White House sequences were filmed at the Tyler Perry Studios in Atlanta. In a March 2024 interview with The Guardian, Garland stated his intention to step back from directing after Civil War and focus only on writing.\nFilm editor Jake Roberts and sound editor Glenn Freemantle re-teamed with Alex Garland, as did VFX supervisor David Simpson with Framestore. Ben Salisbury and Geoff Barrow composed the original score for the film. Silver Apples' \"Lovefingers,\" Suicide's \"Rocket USA,\" De La Soul's \"Say No Go,\" Skid Row's \"Sweet Little Sister,\" Sturgill Simpson's \"Breakers Roar,\" and Suicide's \"Dream Baby Dream\" were used in the film.\nRelease\nCivil War had its world premiere at South by Southwest on March 14, 2024, with favorable reactions from the audience and positive reviews from critics. The film was previously scheduled to be released on April 26, 2024. It was screened at the BFI IMAX in London on April 11, 2024, and received a wide release on April 12, 2024, in the United States by A24 and in the United Kingdom by Entertainment Film, with engagements in IMAX and Dolby Cinema. The film was released in mainland China on June 7, 2024. It was released through video on demand on May 24, 2024, and Blu-ray, DVD, and Ultra HD Blu-ray on July 9, 2024 by Lionsgate Home Entertainment. It was also invited to Open Cinema at the 29th Busan International Film Festival and would be screened at the outdoor theater in October 2024.\nOn April 17, 2024, A24 promoted the film on Instagram by posting five images created by artificial intelligence (AI), each showing a different American city in postapocalyptic disarray. The images were criticized for inaccurately depicting certain cityscapes: the AI-generated image of Chicago wrongfully represented the Marina City apartment complex, with its buildings being separated by a non-existent island on the Chicago River. In real life, the buildings are located directly next to each other. A source connected to the film confirmed to The Hollywood Reporter that they were \"AI images inspired by the movie. The entire movie is a big 'what if' and so we wanted to continue that thought on social — powerful imagery of iconic landmarks with that dystopian realism.\"\nReception\nBox office\nCivil War grossed $68.7&nbsp;million in the United States and Canada and $58.5&nbsp;million in other territories, for a worldwide total of $127.3&nbsp;million.\nIn the United States and Canada, the film was projected to gross $18–24 million from 3,838 theaters (the widest-ever R-rated release by an independent studio) in its opening weekend. The film made $10.8 million on its first day, including $2.9 million from Thursday night previews (a record for an A24 release). It went on to debut to $25.7 million, surpassing Hereditary as the biggest opening weekend in A24's history as well as the studio's first film to top the box office. The opening weekend audience skewed male at 63%, while 57% of attendees were between ages 18–34. IMAX contributed over 16% of the opening weekend gross, with the main reasons given for seeing the film being its subject matter, the action, and a general interest in indie films (each grouping made up a third of the audience, with the former narrowly higher).\nIn its second weekend the film made $11.1 million (a 56% drop), remaining in first place, before falling to fourth place in its third weekend with $7&nbsp;million. Variety noted that, despite its U.S.-centric subject matter, Civil War performed well in several markets outside the United States. This includes the United Kingdom, where it grossed $7.9 million as of May 19, and the Netherlands, where it reached ticket sales of $750,000. The film additionally opened in first place at the box office in Brazil, Spain, Belgium, Finland, and Portugal.\nCritical response\nAudiences polled by CinemaScore gave the film an average grade of \"B-\" on an A+ to F scale, while PostTrak reported filmgoers gave it an 76% overall positive score and a 53% \"definite recommend.\"\nFollowing the SXSW premiere, Rotten Tomatoes noted that critics called the film \"a gorgeously shot cautionary tale full of big ideas and a fantastic performance by Kirsten Dunst, but it may surprise some viewers.\" Critics praised the \"beauty and intensity of the dystopian drama\" while noting its \"potential for controversy and disappointment\" due to the effectiveness of its messages.\nIn a positive review, Peter Debruge of Variety wrote: \"Garland's the last person to suggest a group hug. As statements go, his powerful vision leaves us shaken, effectively repeating the question that quelled the L.A. riots: Can we all get along?\" Matt Zoller Seitz, writing for RogerEbert.com, compared Civil War to films about \"Western journalists covering the collapse of foreign countries,\" such as The Year of Living Dangerously (1982) and Welcome to Sarajevo (1997), ultimately praising the film as \"furiously convincing and disturbing.\" Lovia Gyarkye of The Hollywood Reporter also gave the film a positive review, writing: \"With the precision and length of its violent battle sequences, it's clear Civil War operates as a clarion call. Garland wrote the film in 2020 as he watched cogs on America's self-mythologizing exceptionalist machine turn, propelling the nation into a nightmare. With this latest film, he sounds the alarm, wondering less about how a country walks blindly into its own destruction and more about what happens when it does.\" Manohla Dargis of The New York Times echoed the sentiment, writing: \"Rarely have I seen a movie that made me so acutely uncomfortable or watched an actor's face that, like Dunst's, expressed a nation's soul-sickness so vividly that it felt like an X-ray.\"\nSome critics had mixed reactions. The Washington Posts Amy Nicholson described the film as \"coldly, deliberately incurious about the combatants and the victims\" but also wrote \"the film feels poetically, deeply true, even when it's suggesting that humans are more apt to tear one another apart for petty grievances than over a sincere defense of some kind of principles.\" Valerie Complex of Deadline Hollywood offered negative comments, writing: \"The script's utilization of characters of color as conduits for brutality needed to be explored further ... Ultimately, Civil War feels like a missed opportunity. The director's vision of a fractured America, embroiled in conflict, holds the potential for introspection on our current societal divisions. However, the film's execution, hampered by thin characterization, a lackluster narrative and an overreliance on spectacle over substance, left me disengaged.\"\nJohnny Oleksinski of the New York Post observed: \"Civil Wars shtick is that it's not specifically political. For instance, as the US devolves into enemy groups of secessionist states, Texas and California have banded together to form the Western Forces. That such an alliance could ever occur is about as likely as [a] Sweetgreen/Kentucky Fried Chicken combo restaurant.\" Eisa Nefertari Ulen, writing for The Hollywood Reporter, also found that the film, despite being \"otherwise solid,\" was partially missing its point, stating: \"Casablanca endures because it spoke to a moment as 'crazy and mixed-up' as this one, and nudged the country away from its isolationist inaction. Civil War does not resonate like that classic, because it does not explicitly address this moment. We as a people cannot fix a problem we cannot name.\"\nStephanie Zacharek of Time observed: \"Civil War has the vibe of your standard desolate zombie movie with a modern American backdrop, but it's far less effective than your average George A. Romero project: sometimes a B movie with a sense of humor about itself says more about a nation's despair than an overserious, breast-beating one ... Do we really need a movie to invent, and rub our noses in, the possibility of a bleaker future?\" Filmmakers Lena Dunham, Hannah Fidell, William Goldenberg, Matt Johnson, Lance Oppenheim, Daniel Scheinert, Nicholas Stoller, and Nacho Vigalondo all cited Civil War as among their favorite films of 2024, with Goldenberg calling it an \"all-too-real look at our possible future.\" The film received both praise and criticism for its approach to contemporary political themes, including concerns of democratic decline and increased political polarization.\nAccolades\n{| class=\"wikitable sortable plainrowheaders\"\n|-\n! scope=\"col\"| Award\n! scope=\"col\"| Date of ceremony\n! scope=\"col\"| Category\n! scope=\"col\"| Recipient(s)\n! scope=\"col\"| Result\n! scope=\"col\" class=\"unsortable\"|\n|-\n!scope=\"row\"|AACTA International Awards\n| February 7, 2025\n| Best Actress\n| Kirsten Dunst\n|\n| align=\"center\"|\n|-\n! scope=\"row\"| American Cinema Editors Awards\n| January 18, 2025\n| Best Edited Feature Film – Dramatic\n|\n|\n| align=\"center\"|\n|-\n! scope=\"row\"| Artios Awards\n| February 12, 2025\n| Outstanding Achievement in Casting – Big Budget Feature (Drama)\n| Francine Maisler, Amber Wakefield, Meagan Lewis, Rebecca Carfagna\n|\n| align=\"center\"|\n|-\n! scope=\"row\"| Astra Film Awards\n| December 8, 2024\n| Best Action or Science Fiction Feature\n| rowspan=\"2\" scope=\"row\"| Civil War\n|\n| align=\"center\"|\n|-\n! rowspan=\"6\" scope=\"row\"| Astra Midseason Movie Awards\n| rowspan=\"6\"| July 3, 2024\n| Best Picture\n|\n| rowspan=\"6\" align=\"center\"|\n|-\n| Best Director\n|\n|\n|-\n| Best Actress\n|\n|\n|-\n| Best Supporting Actor\n|\n|\n|-\n| Best Supporting Actress\n|\n|\n|-\n| Best Screenplay\n|\n|\n|-\n! rowspan=\"6\" scope=\"row\"| British Independent Film Craft Awards\n| rowspan=\"6\"| November 26, 2024\n| Best Cinematography\n| Rob Hardy\n|\n| rowspan=\"6\" align=\"center\"|\n|-\n| Best Costume Design\n| Meghan Kasperlik\n|\n|-\n| Best Editing\n| Jake Roberts\n|\n|-\n| Best Effects\n| David Simpson\n|\n|-\n| Best Production Design\n| Caty Maxey\n|\n|-\n| Best Sound\n| Glenn Freemantle, Mary H Ellis, and Howard Bargroff\n|\n|-\n! scope=\"row\" rowspan=\"3\" | Critics' Choice Super Awards\n| rowspan=\"3\"| August 7, 2025\n| Best Action Movie\n| Civil War\n|\n| align=\"center\" rowspan=\"3\"|\n|-\n| rowspan=\"2\"| Best Actress in an Action Movie\n| Kirsten Dunst\n|\n|-\n| Cailee Spaeny\n|\n|-\n! rowspan=\"3\" scope=\"row\"| Golden Trailer Awards\n| rowspan=\"3\"| May 30, 2024\n| Best Action TV Spot\n| \"Mission\" (AV Squad)\n|\n| rowspan=\"3\" align=\"center\"|\n|-\n| Best Independent Trailer\n| \"Home\" (AV Squad)\n|\n|-\n| Best Motion Poster\n| AV Print\n|\n|-\n! scope=\"row\"| Hollywood Professional Association Awards\n| November 7, 2024\n| Outstanding Sound – Theatrical Feature\n| Glenn Freemantle, Howard Bargroff, Adam Scrivener, Ben Barker, and Gillian Dodders (Formosa Group UK)\n|\n| align=\"center\"|\n|-\n! scope=\"row\"| Location Managers Guild International Awards\n| August 24, 2024\n| Outstanding Locations in a Contemporary Feature Film\n| rowspan=\"3\"| Civil War\n|\n| align=\"center\"|\n|-\n! scope=\"row\"| San Diego Film Critics Society\n| December 9, 2024\n| Best Sound Design\n|\n| align=\"center\"|\n|-\n! rowspan=\"2\" scope=\"row\"| Saturn Awards\n| rowspan=\"2\"| February 2, 2025\n| Best Thriller Film\n|\n| rowspan=\"2\" align=\"center\"|\n|-\n| Best Film Editing\n| Jake Roberts\n|\n|-\n! scope=\"row\" | Set Decorators Society of America\n| February 2, 2025\n| Best Achievement in Décor/Design of a Contemporary Feature Film\n| Lizbeth Ayala, Caty Maxey\n|\n| align=\"center\"|\n|-\n! scope=\"row\"| St. Louis Film Critics Association\n| December 15, 2024\n| Best Scene\n| \"What kind of an American are you?\"\n|\n| align=\"center\"|\n|-\n! scope=row rowspan=\"2\"| Visual Effects Society Awards\n| rowspan=\"2\"|\n| Outstanding Supporting Visual Effects in a Photoreal Feature\n|David Simpson, Michelle Rose, Freddy Salazar, Chris Zeh, J.D. Schwalm\n|\n| align=\"center\" rowspan=\"2\"|\n|-\n|Outstanding Created Environment in a Photoreal Feature\n|Matthew Chandler, James Harmer, Robert Moore, Adrien Zeppieri (for \"Washington D.C.\")\n|\n|-\n! scope=\"row\"| Washington D.C. Area Film Critics Association\n| December 8, 2024\n| Joe Barber Award for Best Portrayal of Washington, D.C.\n| Civil War\n|\n| align=\"center\"|\n|-\n! scope=\"row\"| Writers Guild of America Awards\n| February 15, 2025\n| Best Original Screenplay\n| Alex Garland\n|\n| align=\"center\"|\n|}\nReferences\nExternal links\n*\n*"
    }
  ]
}