{
  "content": [
    {
      "type": "text",
      "text": "# Civic Trust Awards\n\n}}\nThe Civic Trust Awards scheme is a British awards scheme to recognise outstanding architecture, planning and design in the built environment. It was established in 1959, and is the longest-standing built environment awards scheme in Europe. The Civic Trust Awards is not linked to any organisation, institution, or publication and operates on a not-for-profit basis. The general public is able to participate in nominating and judging schemes from their local area. They may also be awarded internationally.\nHistory\nThe Civic Trust Awards were originally established in 1959 by Michael Middleton CBE of the Civic Trust to recognise outstanding architecture, urban design, landscape and public are which improve the quality of life for local communities.\nThe Civic Trust went into administration in April 2009, following the loss of a government contract. The Civic Trust Awards was successfully rescued from the administration process by former Civic Trust employee Malcolm Hankey and his wife Karen Hankey who continue to run the scheme on a not-for-profit basis as a Community Interest Company.\nAwards are given for buildings and schemes which were architecturally outstanding and made positive differences to their local community.  Wherever possible, at the first stage of assessment, entries to the Civic Trust Awards (and Pro-Tem Awards if the structure is still in place) will be visited by a team consisting of an architect and (where available) a universal design assessor, a community representative, a Local Authority planner and a Student Representative. This team reports its recommendations to the [https://www.civictrustawards.org.uk/about/judging-panel-membersp National Judging Panel] (a group of experts in their respective fields) that make the final decisions on the level of award to be given.\nThe assessor team will be looking for schemes that use sustainable design and construction, have a positive impact on their local environment, and have well integrated and detailed access for all. Feedback is offered to all unsuccessful applicants and the decision made by the assessor team and National Panel is final.\nFor the Civic Trust AABC Conservation Award scheme, entries will be desk assessed by a group of specialist conservation representatives of the AABC.\nAwards\n]]\nThe Civic Trust Awards scheme annually recognise projects with Special Awards, Awards and Highly Commended.\nThere are three entry categories - Civic Trust Awards, AABC Conservation Awards, and ProTem Awards (for temporary buildings/structures). Projects can be entered separately into both the Civic Trust Awards and AABC Conservation Awards, should all criteria requirements be met.\nAll schemes are considered on their own merits, with winning projects also considered for one of the Special Awards, such as Sustainability, Community Engagement etc.\nThe Civic Trust Awards also delivers an Awards scheme in recognition of architect and founding figure of universal design, Selwyn Goldsmith.\nEstablished in 2011, the Selwyn Goldsmith Awards for Universal Design is delivered in parallel with the Civic Trust Awards application process, all CTA entries are automatically considered for the Selwyn Goldsmith Award. The winner will be selected by a specially convened panel of universal design experts with the announcement made at the Awards Ceremony in March each year. Universal Design is about ensuring that places work for all people, no matter your age, ethnicity, gender or ability. An environment or building that is responsive, flexible, welcoming, easy to use and occupy; allowing all to use with dignity and equality. The Selwyn Goldsmith Awards (SGA) seek to promote and applaud those schemes which achieve this and exceed regulation. To be considered for the SGA's your project should have gone beyond the building regulations, as a minimum using best practice guidance, putting people at the heart of the project and showing exemplar design.\nCivic Trust Awards - Projects that make an outstanding contribution to the quality and appearance of the built environment. Award level schemes demonstrate excellence in architecture or design, whilst being sustainable, accessible and provide a positive civic contribution.\nCivic Trust Highly Commended - Projects that make a significant contribution to the quality and appearance of the built environment. Commendation level schemes demonstrate a good standard of architecture or design, whilst being sustainable, accessible and provide a positive civic contribution.\nPrevious award winners\nPrevious winners include:\nUK\n* Hallgate, Blackheath Park, London, 1961\n* Kingsgate Bridge, Durham, 1965\n* Nottingham Playhouse, 1966\n*  Richmond Baths (now Pools on the Park), Richmond, London, 1967\n* West Burton Power Station, 1968\n* Severn Bridge, 1968\n* Dunelm House, 1968\n* M6 motorway between Lancaster and Penrith, 1971\n* Pulteney Weir, Bath, 1972\n* Renault Centre, Swindon, 1983\n* Victoria Quarter, Leeds, 1991\n* Centenary Building, University of Salford, 1997\n* London IMAX, 2000\n* Blizard Building, 2006\n* Saint Malachy's Church, Belfast, 2010\n* Green Park Business Park, Reading, 2014\n*Cambridge Central Mosque, 2020\n*Windermere Jetty Museum, South Lakeland, 2020\n*Battersea Arts Centre, Wandsworth, 2020 (AABC Conservation Award)\nInternational\n* St James, Guernsey, Channel Islands, 1986\n* Sydney Park Water Re-use Project, Sydney, Australia (Civic Trust Award and Special Award for Sustainability), 2018\n*The Heart in Ikast, Ikast, Denmark, 2020\nSee also\n*Australian Civic Trust\nReferences\nExternal links\n*\n*"
    }
  ]
}