{
  "content": [
    {
      "type": "text",
      "text": "# Claim of the biblical descent of the Bagrationi dynasty\n\nA legend that the Georgian royal Bagrationi dynasty were of a Hebrew origin and descended from David dates back to the family's appearance on the Georgian soil in the latter half of the eight century. As the Bagratid power grew, this claim morphed into an officially endorsed paradigm, enshrined in medieval historical literature such as the early 11th-century chronicle of Sumbat Davitis-dze, and formed the basis of the dynasty's political ideology for the duration of their millennium-long ascendancy in Georgia. The proposed Davidic descent allowed the Bagrationi to claim kinship with Jesus Christ and the Virgin Mary and rest their legitimacy on a biblical archetype of the God-anointed royalty.\nThe legend of the Bagrationi's Hebrew or Davidic descent is given no credence by modern mainstream scholarship. The family's origin is disputed, but the view formulated by the historians such as Ekvtime Takaishvili and Cyril Toumanoff that the Georgian dynasty descended from a refuge prince of the Armenian house of Bagratuni prevails.\nOrigin of the legend\nplaying harp. A miniature from the 15th-century Georgian Psalters manuscript.]]\nThe legend originated in the Armenian–Georgian milieu in the latter half of the 8th century. A Hebrew provenance is first ascribed to the Armenian Bagratids (Bagratuni) by the early medieval Armenian historian Movses Khorenatsi, but he in no way suggests that the family descended from King David. Around 800, the early Georgian Bagratids creatively manipulated the claim so as to present themselves as the direct biological descendants of the biblical king. They did not explicitly apply a Davidic origin to their Armenian cousins, although the Armenians subsequently adopted the Georgians' innovation as their own.\nThe first Armenian source familiar with the Davidic origin of the Bagratids is The History of Armenia by the early 10th century historian Hovhannes Draskhanakerttsi, who would have been exposed to the Georgian legend while voluntarily residing at the court of the Georgian Bagratid ruler Adarnase IV (died 923). In general, the Armenian Bagratids displayed little interest in the Hebrew theory and its Davidic development, as compared with their Georgian counterparts.\nThe earliest extant native reference to the Georgian Bagratids and their Davidic clamoring is found in Pseudo-Juansher's brief historical work, written between 800 and 813, where is related the arrival in Kartli, a core Georgian region, sometime after 772, of Adarnase, \"who was of the House of David the Prophet\". The Life of St. Grigol Khandzteli, written in 951 by the Georgian hagiographer Giorgi Merchule, is next to refer to the tradition of the Davidic origin as extant at the time of Ashot I, Adarnase's son and the first Georgian Bagratid monarch, whom the monk Grigol addresses as \"lord, called the son of David, the prophet and God-anointed\".\nConstantine VII Porphyrogenitus\nThe legend became well known enough to feature in the 45th chapter of the treatise De Administrando Imperio, written c. 950 by the Byzantine emperor Constantine VII Porphyrogenitus, whom the claim apparently reached through the Caucasians serving at the imperial court in Constantinople. According to Constantine, the Georgians believed they were scions of Uriah's wife Bathsheba, with whom King David committed adultery, and who had children by him. Thus, they claimed to have been related to the Virgin Mary, inasmuch as she was also descended from David.\nConstantine Porphyrogenitus's account betrays Georgian influence, but some of its details are uncorroborated elsewhere. It contradicts the Georgian historian Sumbat's more elaborated version by citing the genealogical line leading to the Virgin Mary instead of that leading to Joseph, the husband of Mary. Finally, Constantine's genealogy reaches the two brothers, David and Spandiatis, who had left Jerusalem at the advice of an oracle and settled at the boundaries of Persia, where they founded their kingdom in Iberia (i.e., Kartli) and increased their power through the help of the emperor Heraclius. Spandiatis was childless, but David had a son Pankratios, who had a son Asotios, whose son Adarnase was made curopalates by the emperor Leo, Constantine's father.\nSumbat's chronicle\nThe fullest expression of the Davidic claims of the Georgian Bagratids in Georgian literature is preserved in the 11th-century Life and Tale of the Bagratids by Sumbat Davitis-dze (Sumbat, son of David), who may himself have belonged to the Georgian Bagratid family. This work, which has come down to us as part of the larger compendium known as the Georgian Chronicles, contains the most elaborated version of the Bagratid family legend. Sumbat's history commences with a lengthy stemma, tracing the ultimate origin of the Georgian Bagratids from Adam through King David down to Joseph, husband of the Virgin Mary; and then from Cleopas, brother of Joseph, to a certain Solomon, whose seven sons left the Holy Land and went to Armenia, where a certain queen Rachael baptized them. Three of them remained in Armenia and their offspring later ruled that country, while the four brothers arrived in Kartli. One of them, Guaram, was made a ruler there and became, as Sumbat claims, the forefather of the Bagrationi. Guaram's brother Sahak established himself in Kakheti, while two other brothers, Asam and Varazvard, conquered Kambechani, east of Kakheti, from a Persian governor.\nSumbat's genealogy from Adam to King David is based on the Gospel according to Luke (3:32 ff.), while the one from King David to Joseph is borrowed from the Gospel according to Matthew (1:1-16). The source of the genealogy of Cleopas and his descendants is apparently the Roman scholar Eusebius of Caesarea, who, in his Ecclesiastical History, quotes Hegesippus, according to whom, the Romans searched for King David's scions in order to remove from the Hebrew territory the potential pretenders to the throne who would have had the biblical legitimation. By adding Cleopas into the Bagratid genealogy, Sumbat purposefully led the dynasty's ancestry to the God-anointed king of Israel. Thus, Sumbat's work contains the version of the family legend, which became the basis of a dynastic and political ideology, and, in the course of history, influenced the worldview of the Bagrationi dynasty.\n{| class=\"wikitable\" style=\"margin:1em auto 1em auto; page-break-inside:avoid\"\n|+ Genealogy of the Bagrationi dynasty according to Sumbat\n|- valign=\"top\"\n| style=\"border:none;\"|\nAdam\nSeth\nEnos\nKenan\nMahalalel\nJared\nEnoch\nMethuselah\nLamech\nNoah\nShem\nArpachshad\nCainan\nSalah\nEber\nPeleg\nReu\nSerug\nNahor\nTerah\n| style=\"border:none\"|\nAbraham\nIsaac\nJacob\nJudah\nPerez\nHezron\nRam\nAmminadab\nNahshon\nSalmon\nBoaz\nObed\nJesse\nDavid\nSolomon\nRehoboam\nAbijah\nAsa\nJehosaphat\nJehoram\n| style=\"border:none\"|\nUzziah\nJotham\nAhaz\nHezekiah\nManasseh\nAmon\nJosiah\nJehoiakim\nJeconiah\nShealtiel\nZerubbabel\nAbiud\nEliakim\nAzor\nZadok\nAchim\nEliud\nEleazar\nMatthan\nJacob\n| style=\"border:none\"|\nCleopas\nNaom\nSalah\nRobuam\nMohtar\nEliakim\nBenjamin\nIherobem\nMoses\nJudah\nEliazar\nLevi\nJehoram\nManasseh\nJacob\nMikiah\nJehoakim\nJehrubem\nAbraham\nJob\n| style=\"border:none\"|\nAkab\nSimon\nIzahkar\nAbiah\nGaad\nAseor\nIsaac\nDahn\nSolomon\nGuaram\nStephanoz\nAdarnase\nStephanoz\nGuaram\nVaraz-Bakur\nNerse\nAdarnase\nAshot\nBagrat\nBagrationi dynasty\n|}\nOther sources\nBeside the textual sources, the legend of the Bagratids' Davidic origin is possibly enshrined in the stone effigy in low relief from the medieval Georgian monastery of Opiza, in Shavsheti, and now on display at the Art Museum of Georgia in Tbilisi. The sculpture represents a nobleman in an act of offering a church model to Jesus Christ, seated upon a throne, blessing the donor, and accompanied by a man with his hands in a gesture of supplication. Based on the accompanying minimal Georgian inscriptions, the relief is traditionally interpreted by Ekvtime Taqaishvili, Ivane Javakhishvili, and Cyril Toumanoff as a contemporary depiction of the curopalates Ashot I (died 830) with Christ and the biblical King David. Toumanoff, for example, was convinced that here \"the allusion to the donor's descent from Our Lord's ancestor and the latter's intercession is unmistakable\". A more recent interpretation by the likes as Nodar Shoshiashvili and Wachtang Djobadze, however, suggests identification of the persons in question as a later curopalates Ashot (died 954) and this Ashot's elder brother David (died 937).\nFurthermore, David Winfield argued that the presence of the six-pointed star in medieval Georgian architecture, such as on the 10th-century church Doliskana, in Klarjeti, alluded to the proposed descent of the Bagrationi from King David, but there is no evidence that this symbol had any Davidic associations in Georgia in this period.\nLater sources\n, traditionally featuring the Davidic harp and sling.]]\nSubsequent historical works refer on many occasions to the dynasty's biblical provenance. Just after Sumbat composed his history, an 11th-century anonymous author of the so-called Chronicle of Kartli mentions, while relating the event on the eve of the Georgian Bagratid accession to power, the Davidic tradition as existing at the time of Ashot I's father Adarnase. However, the latter source suggest that the claim was not, in the days of Adarnase, as yet widely known, for the princess of Kartli, whose son married Adarnase's daughter, is shown by the chronicle to have been ignorant of her son-in-law's descent from King David.\nAnother Georgian chronicle, the anonymous Life of King of Kings David, written c. 1123–1126, declares its subject, King David IV of Georgia (r. 1189–1125), to have been the 78th descendant of his biblical eponym. Later on, the chronicle compares David IV's coronation of his son Demetrius I, prior to the former's death, to the biblical David's enthronement of Solomon and once again emphasizes the \"resemblance to his ancestral stock\". A contemporaneous versified dedicatory inscription on the venerated icon of the Mother of God, known as the Khakhuli triptych, which mentions David IV and Demetrius I, compares the Virgin Mary's Davidic descent to that of the Georgian Bagratid monarchs. The legendary biblical lineage was also reflected in the later dynastic surname Jessian-Davidian-Solomonian-Bagrationi, not infrequently encountered in the Bagratid documents. The symbols associated with David, a harp and sling, appear in the Bagrationi heraldry, the earliest known example dating from the late 16th century.\nFinally, the 18th-century Bagratid historian Prince Vakhushti attempted to incorporate the Davidic theory into his chronology, while his father, King Vakhtang VI of Kartli, composed a family tree, integrating the biblical lineage of the Bagrationi with that of the Georgian people, the origins of which was traced by the medieval chronicles to Togarmah, a descendant of Noah. Prince David of Georgia, a son of the last King of Georgia, writing in the early years of the 19th century, shortly after the dethronement of the Bagrationi by the expanding Russian Empire, summarized the Davidic origin of his family, being the first to have directly incorporated in his history, written in Russian, the original Armenian account of a Hebrew provenance of the Bagratid dynasty authored by Movses. As the modern historian Stephen H. Rapp puts it, \"his history was an attempt to sum up the history of Georgia and to proclaim, for one last time, the divine sanction behind the Bagratids\".\nThus, the Bagratid claim to be descended from the biblical David persisted until the Russian takeover of their thrones in the early 19th century and is even entertained by some surviving Bagrationi today.\nParallels\nissued by Heraclius II of Georgia styling him as \"by the mercy of God&nbsp;... of Iesian-Davitian-Solomonian-Bagratovani, son of the anointed King Teimuraz, Heraclius the Second, King of Georgia, Kartli, Kakheti,&nbsp;...\"]]\nSince the King-Prophet David was considered as a model ruler and a symbol of the God-ordained monarchy throughout medieval Western Europe and Eastern Christendom, the Georgian Bagratids were not the only ruling family to claim a link to David. The Carolingians often connected themselves with David, but did not allege to be descended directly from him. As the historian Ivan Biliarsky have conjectured, the Caucasian paradigm of Davidic royalty may have influenced the Old Testament-modeled vision of kingship in early medieval Bulgaria, the country then in transition from an ethnic pagan state to a Christian empire, as evident in the case of Tsar Izot, cited in the Narration of Isaiah, the so-called Bulgarian Apocryphal Chronicle of the Eleventh Century.\nThe closest parallel to the Georgian Bagratid experience is that of Ethiopia. The medieval Ethiopian historical work Kebra Nagast claims that the Ethiopian rulers were the direct descendants of the biblical Solomon's first born, Menelik. The Georgian and Ethiopian dynasties may have been aware of each other's claims; the Georgian Bagrationi prince Ioann in his didactic encyclopedic novel Kalmasoba, written between 1817 and 1828, cites a 1787 letter sent by the Ethiopian emperor—\"also descended from David the Prophet\"—to Ioann's grandfather, King Heraclius II of Georgia, in which the Georgian monarch was reportedly addressed by his Ethiopian counterpart as \"a beloved brother and the one related through the common bloodline\".\nModern interpretations\nThe Bagrationi's Hebrew or Davidic origin is considered by modern scholarship as purely legendary forged by the Georgian dynasty early in their history to help assert their legitimacy. The family's alleged Hebrew provenance was utilized and elaborated by the Georgian Bagratids to claim the descent from the divinely appointed model biblical king David, himself a descendant, in an unbroken line, of Adam and the ancestor of Jesus Christ, at the same time obscuring the dynasty's true origin and blood-ties with Armenian cousins. These claims became articulated in the medieval Georgian texts, especially in the chronicle by Sumbat Davitis-dze, himself a purported Bagratid. Moreover, Sumbat erroneously or purposefully presented the earlier, pre-Bagratid Guaramid dynasty of Kartli as the first Bagratids on the Georgian soil by identifying the Guaramid prince Guaram as a scion of the biblical King David. It is true, however, that the early Georgian Bagratids were related to the Guaramids by marital ties and a Guaramid dowry formed an important segment of the original Bagratid realm.\nIn the 20th century, the British historian Steven Runciman attempted to rehabilitate the theory of the Hebrew origin of the Bagratids. Runciman suggested that there was no reason to doubt their Jewish origin given the presence of Jews, fleeing from the Assyrian captivity, in Caucasia, \"where, as in Babylonia, there were hereditary chiefs who claimed descent from David known as the \"Princes of the Diaspora\", till the high Middle Ages\". The hypothesis has not been accepted by other scholars and Toumanoff have thoroughly dismissed such a possibility.\nNotes\nReferences\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\nExternal links\n* [https://www.royalhouse.org.ge/%e1%83%93%e1%83%90%e1%83%9c%e1%83%90%e1%83%a0%e1%83%97%e1%83%98-%e2%84%961/ ბაგრატიონთა სამეფო საგვარეულოს ღვთიური წარმომავლობის შესახებ], საქართველოს სამეფო სახლის კანცელარიის 2010 წლის განცხადების დანართი №1, THE ROYAL HOUSE OF GEORGIA website"
    }
  ]
}