{
  "content": [
    {
      "type": "text",
      "text": "# Clang Invasion\n\n| last_aired           =\n| related              =\n}}\nClang Invasion is a children's animated television series produced for the Canadian children's programming channel YTV, where it first premiered on September 12, 2009. It also aired on Nickelodeon, Clan TVE in Spain, Gloob in Brazil, Canal J in France, ABC Me in Australia and Pop in the UK. 26 episodes were produced and first aired from September 12, 2009 to February 12, 2010 on YTV, with reruns airing until September 2, 2011.\nPlot\nThree alien robots, Rivet, Widgit and Socket, accidentally crashed their spaceship on a backyard tree on Earth. Human twins Robin and Daisy Harrison, and their pet dog Sam went to investigate the crash, where they encounter the robots. Not capable of returning to Planet Clang, the robots become friends with Robin and Daisy, made Sam speak by installing a voice box (for one treat), and utilize a spectrum of gadgetry for their goals. The twins also have to keep the robots a secret before Rivet, Widget and Socket return to Planet Clang.\nCharacters\n*Rivet (voiced by Patrick McKenna): The captain of the spaceship, Rivet is a male robot and inventor that serves as a genius to the kids, offering them his inventions. He discovered information about Earth from its old commercial broadcasts into space.\n*Widgit (voiced by Linda Kash): The spaceship's navigator and maintainer, Widgit is a female robot who performs poorly technologically compared to the other robots but sympathizes with living things. She can contact with any living thing after accidentally devouring one of Rivet's gadgets.\n*Socket (voiced by Doug Hadders): The spaceship's security officer, Socket is a simpler robot, unlike the others. As an old robot, his parts frequently fall off, with Rivet reattaching back Socket's parts. His head also acts as an object storage.\n*Robin Harrison (voiced by Julie Lemieux): A 7-year-old human boy and Daisy's twin brother, Robin thinks the arrival of the robots in his background is the best thing in his life.\n*Daisy Harrison (voiced by Annick Obonsawin): A 7-year-old human girl and Robin's twin sister, Daisy isn't as wise as her age in contrast to him, despite believing the contrary.\n*Sam (voiced by Brad Adamson): The Harrisons' dog, Sam was given a voice box on his collar from the robots in order to speak. He is talkative.\nEpisodes\nThe dates that follow are when the episodes were initially developed and released in Singapore and England and not when they debuted in Canada, which was over 3 years later.\n# Countdown to Destruction / When Life Gives You Lemons - September 12, 2009\n# I, Giant Robot / Super Excellent Fantastical Man... and Daisy - September 19, 2009\n# Home a Clone / Pause and Order -September 26, 2009\n# To Everything Learn, Learn, Learn / The Fluffy Kitten... of Death - October 3, 2009\n# The Road to Invention / Queen Bumble Bee - October 10, 2009\n# O Tannenbomb / Teleputty - October 17, 2009\n# Welcome to My Nightmare / Trick or Treat or Trick or Treat - October 24, 2009\n# Ace Up His Sleeve / The Fright Stuff - October 31, 2009\n# Hide and Seek and Destroy / Go Kart a Go-Go - November 7, 2009\n# Chicken-Pocalypse / The E.A.R.L. Files - November 14, 2009\n# Freaky Monday / You Can't Handle the Tooth - November 23, 2009\n# Oh Snow He Didn't / Total Eclipse of the Art - November 30, 2009\n# Close Encounters of the Love Kind / Completely Lost in Space - December 7, 2009\n# The Big Dance / Lemur Come Back to Me - December 14, 2009\n# Two Dads Are Better Than One / The Polar-Bear Express - December 28, 2009\n# Hail to the Chief / With Friends Like These - January 6, 2010\n# License to Drive / Bullyworth - January 7, 2010\n# Recycle, Reuse, Re-Boot / Say Cheese - January 8, 2010\n# Bring Your Parents to Work Day / The Grandma Illusion - January 11, 2010\n# Robin Boy Genius... Naaaaa / Back on the Clang Gang - January 12, 2010\n# To Air is Devine / Field of Mean - January 13, 2010\n# There Goes the Neighbourhoodistan / On the Run - January 14, 2010\n# Evolution Solution / To Sasquatch a Thief - January 16, 2010\n# A Kung Fu Star is Born / Citizen Lame - January 18, 2010\n# Alien Happy Fun Time Challenge / Living It Upgrade - January 19, 2010\n# April Fools / Dazed and Com-pooched - February 12, 2010\nProduction\nThe series was originally going to be called Gizmo. The series was co-produced by Decode Entertainment, Agogo Entertainment and Scrawl Studios. DHX Media is the distributor.\nReferences\nExternal links\n*\n**"
    }
  ]
}