{
  "content": [
    {
      "type": "text",
      "text": "# Clarence King\n\n| term_end            =\n| successor           = John Wesley Powell\n| birth_date          =\n| birth_place         = Newport, Rhode Island, US\n| death_date          =\n| death_place         = Phoenix, Arizona, US\n| residence           =\n| citizenship         =\n| nationality         =\n| signature           = Signature of Clarence King.jpg\n| footnotes           =\n| module              =\n}}\nClarence Rivers King (January 6, 1842 – December 24, 1901) was an American geologist, mountaineer, and author. He was the first director of the United States Geological Survey from 1879 to 1881. Nominated by Republican President Rutherford B. Hayes, King was noted for his exploration of the Sierra Nevada mountain range.\nEarly life and education\nClarence King was born on January 6, 1842, the son of James Rivers King and Florence Little King. Clarence's father was part of a family firm engaged in trade with China, which kept him away from home a great deal, and he died in 1848, so Clarence was brought up primarily by his mother. By 1848, his two sisters, named Florence King and Grace King, had died early in their lives.\nClarence developed an early interest in outdoor exploration and natural history, which was encouraged by his mother and by Reverend Dr. Roswell Park, head of the Christ Church Hall school in Pomfret, Connecticut, that Clarence attended until he was ten. He then attended schools in Boston and New Haven and, at age thirteen, was accepted to the prestigious Hartford High School. He was a good student and a versatile athlete, of short stature but unusually strong.\nHis mother received an income from the King family business until it met with a series of problems and dissolved in 1857. After a few years of straitened circumstances, during part of which Clarence suffered from a serious depression, his mother married George S. Howland in July 1860 and had a daughter with him named Marian Howland. Howland financed Clarence's enrollment in the Sheffield Scientific School, affiliated with Yale College, in 1860.\nCollege life\nAt Yale, King specialized in \"applied chemistry\" and also studied physics and geology. One inspiring teacher was James Dwight Dana, a highly regarded geologist who had participated in the United States Exploring Expedition, a scientific expedition to the South Atlantic, South Pacific and the west coasts of South and North America. At Yale, King enjoyed many sports, as he was a skilled athlete, but rowing was his main passion. He joined the rowing team at the university, and eventually became its captain. The Undine team competed on a four-man rowing boat, with King at the stroke oar. King later graduated with a Ph.B. in July 1862. That summer, he and several friends borrowed one of Yale's rowboats for a trip along the shores of Lake Champlain and a series of Canadian rivers, then returned to New Haven for the fall regatta.\nIn October 1862, on a visit to the home of his former professor, George Jarvis Brush, King heard Brush read aloud a letter he had received from William Henry Brewer telling of an ascent of Mount Shasta in California, then believed to be the tallest mountain in the United States. King began to read more about geology, attended a lecture by Louis Agassiz, and soon wrote to Brush that he had \"pretty much made up my mind to be a geologist if I can get work in that direction\". He was also fascinated by descriptions of the Alps by John Tyndall and John Ruskin.\nIn late 1862 or early 1863, King moved to New York City to share an apartment with James Terry Gardiner, a close friend from high school and college (who spelled his last name Gardner at the time). They associated with a group of American artists, writers and architects who were admirers of Ruskin. In February 1863, King became one of the founders, along with John William Hill, Clarence Cook and others, of the Ruskinian Association for the Advancement of Truth in Art, an American group similar to the Pre-Raphaelite Brotherhood, and was elected its first secretary. But he was anxious to see the mountains of the American West, and his friend Gardiner was miserable in law school.\nHeading west\nAs Gardiner and King started to quickly plan for the journey, their final destination being San Francisco, another friend named William Hyde became interested and decided to join them. They met in April 1863 in Niagara, New York, and boarded a train. On the train King met the Speers family and entertained the Speers children while they traveled to St. Joseph, Missouri. The Speers, grateful for King's help with entertaining their children, invited King, Gardiner, and Hyde to join their wagon party. The three men would be provided food as long as they helped care for the livestock that the Speers were bringing.\nOn May 1, 1863, with St. Joseph as their starting point, the three men officially started to travel west. Five days later, just past Troy, Kansas, the party succeeded in hunting two buffalo, which was a welcomed treat. Near Fort Kearny, 200 miles into their journey, King tried hunting buffalo, but he did not succeed and ended up with a wounded leg and a dead horse. On May 29, the traveling party passed Chimney Rock in northwest Nebraska, and a few days after that, they arrived at Fort Laramie in what is now Wyoming. On June 29, the party crested the ridge of the Wasatch Mountains in Utah to see the Great Salt Lake below them, a place of refuge before they began to travel across the desert to the west of the lake. More than a month later, on August 6, the wagon train arrived at Carson City, Nevada. Here, King, Gardiner, and Hyde decided to leave the wagon party to head towards the nearby town of Gold Hill because Hyde's father owned a ranch and foundry there.\nThat night, the foundry caught on fire, burning everything the three men owned, including King's letter to William Henry Brewer at the California Geologic Survey. As they helped rebuild the foundry, King and Gardiner were able to save up enough supplies to continue on while Hyde stayed with his father. Planning to travel the rest of the way on foot, Gardiner and King left Gold Hill near the end of August 1863. On September 1, the two friends boarded a steamboat heading towards San Francisco. While on the steamboat, King met Brewer and explained to him what happened to the letter. King expressed his willingness to work for the survey without pay because he liked Brewer and knew it would be a good experience. Joining the California Geological Survey was the first step in King's career.\nEarly career\nOnce Gardner and King arrived at the California Geological Society's office, they met the director of the survey Josiah Whitney. In 1863, with the permission of Whitney, King was asked by Brewer to accompany him on his exploration of the northern part of the Sierra Nevada Mountain range. While King was on this expedition, Gardner would stay in San Francisco. On this trip with Brewer and King was a mule packer named John Hoesch. As the group traveled, they passed through the Sierra gold fields, and at a creek named Genesee, Brewer found fossils of the Jurassic or Triassic age. This find would help them pinpoint the age of the Mother Lode gold belt, which was one of their goals on this journey. Near Lassen Peak in northern California, Brewer and King investigated hot springs and other thermal features. At nights around the campfire, the party discussed geologic topics such as the young Cascade volcanoes, the age of gold veins, and the action of glaciers. During one of these conversations, Brewer brought up Whitney's plan to propose a geologic study across the continent, and King thought that there may be a chance of funding this because, as Whitney noted, railroad companies would benefit from it.\nUpon returning from his first expedition, King immediately began preparing for another. This time, he was traveling with a mining engineer named William Ashburner and a topographer named Charles Hoffmann. The trio's job was to survey the Mariposa Estate, one of the most important gold-vein regions in the area. During this job, King had a habit of staring at views, as opposed to working, which irritated his fellow team members. Eventually, after his coworkers brought their concerns to him, he refocused on his assigned work for the rest of the job. King's next big job would be a scientific exploration into the southern Sierra mountains.\nLeaving in May 1864, the party consisted of Brewer, Hoffmann, Gardner, King and a man named Dick Cotter. During the early stages of this journey, in Visalia, King was able to acquire a new horse, a decision that would later save his life. Leaving Visalia, the team ended up at what is the present site of Sequoia Lake, where they stayed for a week studying the Sequoia trees. The party used triangulation as their main method of mapping the areas they traveled through. At one point, they reached a spot where the animals could not continue, so they made base at an unknown mountain lake. The next day, Hoffmann and Brewer climbed the unknown peak nearby (now known as Mount Brewer), where they discovered that they were not on the main Sierra Nevada Crest like they thought they were. Brewer and Hoffmann also named Mount Tyndall, Mount Goddard, and Mount Whitney while they were up there. King, upon hearing what Hoffmann and Brewer saw, begged to be allowed to backpack up Mount Whitney with Cotter. In King's own words, \"It was a trying moment for Brewer when we found him and volunteered to attempt a campaign for the top of California, because he felt a certain fatherly responsibility over our youth.\" Brewer eventually gave his permission even though King had no real plan. The duo, however, started to run out of provisions before they even made it to Mount Whitney so, they had to turn back.\nAfter reuniting back at camp, King accompanied Brewer to Visalia to get a tooth pulled. During this, King got permission to attempt to climb Mount Whitney again, but he had to rendezvous with the main group in two weeks at Clark's Station. King did not end up making it to the top on this expedition, which greatly disappointed him. On his way to the meeting point, King ran into some trouble with bandits, but his new horse was able to outrun them, saving his life. He made it to the rendezvous point on time, but the rest of the group ran into trouble and was three weeks late. Both Gardner and King were unpaid volunteers for this expedition, but they had helped create the first topographic, botanical, and geologic survey of a vast area.\nIn September 1864, upon the designation by President Abraham Lincoln of the Yosemite Valley area as a permanent public reserve, King and Gardiner were appointed to make a boundary survey around the rim of Yosemite Valley. They returned to the East Coast by way of Nicaragua the following winter. King suffered from several bouts of malaria in the spring and summer of 1865 while Whitney, also in the East, worked on securing funding for further survey projects. King, Gardiner, Whitney, and Whitney's wife sailed back to San Francisco in the fall, where Whitney lined up a survey project for King and Gardiner in the Mojave Desert and Arizona under U.S. Army auspices.\nThey returned to San Francisco in the spring. King returned to Yosemite in the summer of 1866 to make more field notes for Whitney. When King heard of the death of his stepfather, he and Gardiner resigned from the Whitney survey and once again sailed to New York.\nKing and Gardiner had been developing a plan for an independent survey of the Great Basin region for some time and, in late 1866, King went to Washington to secure funding from Congress for such a survey.\nHe was elected to the American Philosophical Society in 1871.\nFortieth Parallel Survey and diamond hoax discovery\n, Utah. The exploration of the Survey of the Fortieth Parallel. Photo by Timothy H. O'Sullivan, October 1868.]]\nKing made a persuasive argument for how his research would help develop the West. He received federal funding and was named U.S. Geologist of the Geological Exploration of the Fortieth Parallel, commonly known as the Fortieth Parallel Survey, in 1867. He persuaded Gardiner to be his second in command and they assembled a team that included, among others, Samuel Franklin Emmons, Arnold Hague, A. D. Wilson, the photographer Timothy H. O'Sullivan, James D. Hauge, and guest artist Gilbert Munger.\nOver the next six years, King and his team explored areas from eastern California to Wyoming. During that time he also published his famous Mountaineering in the Sierra Nevada (1872).\nWhile King was finishing the Fortieth Parallel Survey, the western U.S. was abuzz with news of a secret diamond deposit. King and some of his crew tracked down the secret location in northwest Colorado and exposed it as a fraud, now known as the diamond hoax of 1872. He became an international celebrity through exposing the hoax.\nIn 1878, King published Systematic Geology, numbered Volume 1 of the Report of the Geological Exploration of the Fortieth Parallel, although it appeared later than all but one of the other seven volumes. In this work he narrated the geological history of the West as a mixture of uniformitarianism and catastrophism. This book was well received at the time and has been called \"one of the great scientific works of the late nineteenth century\".\nIn 1879, the US Congress consolidated the number of geological surveys exploring the American West and created the United States Geological Survey. King was chosen as its first director. He took the position with the understanding that it would be temporary and he resigned after twenty months, having overseen the organization of the new agency with an emphasis on mining geology. James Garfield named John Wesley Powell as his successor.\nDuring the remaining years of his life, King withdrew from the scientific community and attempted to profit from his knowledge of mining geology, but the mining ventures he was involved in were not successful enough to support his expensive tastes in art collecting, travel and elegant living, and he went heavily into debt. He had a busy social life, with close friendships including Henry Brooks Adams and John Hay, who admired him tremendously. But he suffered from physical ailments and depression.\nBeliefs and views\nKing grew up in the North and his grandmother, Sophia Little, influenced his views on slavery. She would not eat fruits and other Southern grown products because they were grown with slave labor. Because of this, King was against slavery and African American injustice. While at Yale, he was known as an enthusiastic abolitionist and had lots of rage against the Confederates. He aligned with the militant anti-slavery advocate Wendell Phillips. King even considered joining the war efforts to fight for his beliefs. By the time King graduated, he had returned to his pacifist ways and renounced his anger against the South. He decided that he would help the nation by exploring and mapping the West for his fellow Americans to later live.\nKing was known to be an avid thinker and daydreamer. Because of this, he had many views on art and science. He couldn't ever decide if he was an artist or scientist, because he thought geology had both art and science involved with it. King seemed to embrace that the two were intertwined and learned about the art of science and the science of art. In his scientific reflections, he would vividly explain natural things that he encountered in his adventures in an artistic manner, blending the two subjects together. King wanted people to admire the beauty of his findings of the land in the West. He didn't like when the mountains and plains were described as dull or bland. King respected nature and thought it to be the key to science and art.\nCommon law marriage and passing as African-American\nKing spent his last thirteen years leading a double life. In 1887 or 1888, he met and fell in love with Ada Copeland, an African-American nursemaid and former enslaved woman from Georgia, who had moved to New York City in the mid-1880s. As interracial marriage was strongly discouraged in the nineteenth century, and illegal in many places, King hid his identity from Copeland. Despite his blue eyes and fair complexion, King convinced Copeland that he was an African-American Pullman porter named James Todd.\nThe two entered into a common law marriage in 1888. Throughout the marriage, King never revealed his true identity to Ada, pretending to be Todd, a Black railroad worker, when at home, and continuing to work as King, a white geologist, when in the field. Their union produced five children, four of whom survived to adulthood. Their two daughters married white men. Their two sons served, classified as black, during World War I. King finally revealed his true identity to Copeland in a letter he wrote to her while on his deathbed in Arizona.\nDeath and legacy\nKing died on December 24, 1901, of tuberculosis in Phoenix, Arizona. Kings Peak in Utah, Mount Clarence King and Clarence King Lake at Shastina, California, are named in his honor, as is King Peak in Antarctica.\nThe US Geological Survey Headquarters Library in Reston, Virginia, is also known as the Clarence King Library.\nBibliography\nWorks about King\n*[http://www.nasonline.org/publications/biographical-memoirs/memoir-pdfs/king-clarence.pdf Emmons, Samuel Franklin (1903). Biographical Memoir of Clarence King]\n* Hague, James D., ed. (1904). Clarence King Memoirs. The Helmet of Mambrino. New York: Published for the King Memorial Committee of the Century Association by G.P. Putnam's Sons.[https://archive.org/details/clarencekingmem01kinggoog]\n* Original drawings by L.F. Bjorklund. Extensive bibliography.\n*\n*\n* King, one of four Americans on whom the author focuses, was influenced by Alexander von Humboldt.\n*\n*Moore, James Gregory (2006), King of the 40th Parallel, Stanford University Press, ISBN 0-8047-5223-0\n*\n*\n* }}\nWorks by King\n* The Three Lakes: Marian, Lall, Jan and How They Were Named. 1870.\n* Report of the Geological Exploration of the Fortieth Parallel. United States Government Printing Office, 1870–1878.\n* \"On the Discovery of Actual Glaciers in the Mountains of the Pacific Slope,\" American Journal of Science and Arts, vol. I, March 1871.\n* \"Active Glaciers Within the United States,\" The Atlantic Monthly, vol. 27, no. 161, March 1871.\n* Mountaineering in the Sierra Nevada. Boston : James R. Osgood and Company, 1872 (much of it previously published as articles in the Atlantic Monthly)\n* \"John Hay,\" ''Scribner's Monthly, v. 7, no. 6, Apr. 1874.\n* \"Catastrophism and Evolution,\" The American Naturalist, vol. 11, no. 8, August 1877.\n*\"[https://books.google.com/books?id=f50oAQAAMAAJ Address of Clarence King on Catastrophism]\" and \"Catastrophism in Geology\", Scientific American articles, 14 July 1877, pp.&nbsp;16–17\n* Statistics of the Production of the Precious Metals in the United States. United States Government Printing Office, 1881.\n* The United States Mining Laws and Regulations Thereunder.... United States Government Printing Office, 1885.\n* \"The Helmet of Mambrino,\" The Century Magazine, Volume 32, no. 1, May 1886.\n* \"The Age of the Earth,\" American Journal of Science, vol. 45, January 1893.\n* \"Shall Cuba Be Free?,\" The Forum, September 1895.\n* Report of the Public Lands Commission. United States Government Printing Office, 1903–1905.\nReferences\nExternal links\n* [https://pubs.usgs.gov/circ/c1050/surveys.htm USGS: The Four Great Surveys of the West]\n* [http://gsahist.org/gsat/gt04feb18_19.pdf Clarence King (1842–1901): Pioneering Geologist of the West, Geological Society of America]\n* [https://www.biodiversitylibrary.org/bibliography/61699 Biographical memoir of Clarence King, 1842–1901''] by Samuel Franklin Emmons.\n* [http://www.nasonline.org/publications/biographical-memoirs/memoir-pdfs/king-clarence.pdf National Academy of Sciences Biographical Memoir]\n*\n*\n*"
    }
  ]
}