{
  "content": [
    {
      "type": "text",
      "text": "# Clarence Adams (Korean War)\n\n|death_date =\n|birth_place=Memphis, Tennessee\n|death_place=Memphis, Tennessee\n|image=Clarence Adams soldier.webp\n|caption=\n|nickname=\n|allegiance=  (1947–1950; 1966–1999) (1950–1966; defector)\n|branch= United States Army seal United States Army\n|serviceyears=1947–1950 (defected)\n|rank=25px Corporal\n|commands=\n|unit=\n|battles=\n|awards=\n}}\nClarence Adams (January 4, 1929 – September 17, 1999) was an African-American GI during the Korean War. He was captured on November 29, 1950, when the People's Liberation Army overran his all-black artillery unit's position. Adams was held as a POW until the end of the war. Instead of returning to the United States during Operation Big Switch, Adams was one of 21 American soldiers who chose to settle in the People's Republic of China. As a result of their decision, these 21 Americans were considered defectors and traitors.\nEarly life\nAdams was born on January 4, 1929, and grew up poor in Memphis, Tennessee. He dropped out of high school and joined the U.S. Army in 1946, at the age of 17.\nKorean War\nAfter basic training, Adams became an infantry machine gunner. He was sent to Korea shortly after the war between North and South erupted in June 1950 and was posted to Battery A of the 503rd Artillery Regiment, attached to the 2nd Infantry Division. This was his second tour in Korea, as he had first been posted there in 1948.\nAfter his capture by the Chinese, Adams took classes in communist political theory, and afterwards lectured other prisoners in the camps.  Because of this and other collaboration with his captors, his prosecution by the Army was likely upon his repatriation. During the Vietnam War, Adams made propaganda broadcasts for Radio Hanoi from their Chinese office, telling black American soldiers not to fight:\nAdams married a Chinese woman name Liu Lin Feng and lived in China until 1966.https://archive.today/20231003091156/https://www.nknews.org/2023/10/travis-king-wouldnt-be-the-first-soldier-in-korea-to-reject-america-for-racism/\nReturn to the United States\nAdams returned to the United States from China via Hong Kong on May 26, 1966, citing that he missed his mother. The House Un-American Activities Committee subpoenaed Adams upon his return but did not question him publicly. The charges raised by the committee were dropped.\nHe later started a Chinese restaurant business in Memphis in 1972. He ran four of them with his wife at one point.\nAdams died on September 17, 1999. His autobiography An American Dream: The Life of an African American Soldier and POW Who Spent Twelve Years in Communist China was posthumously published in 2007 by his daughter Della Adams and Lewis H. Carlson.\nSee also\n*List of American and British defectors in the Korean War\n*Samuel David Hawkins\n*Korean War\n*James Veneris\nReferences"
    }
  ]
}