{
  "content": [
    {
      "type": "text",
      "text": "# Clara's War\n\n'Clara's War: One Girl's Story of Survival' is a 2009 memoir by Clara Kramer and Stephen Glantz which tells Kramer's story of her life in Nazi occupied Poland, where she and several other Polish Jews spent 20 months hiding in a bunker beneath a house in the town of Zhovkva. The book was first published in the United States by Harper/Ecco on April 21, 2009. Kramer is a founder of the Holocaust Resource Center at Kean University in Union, New Jersey.\nOverview\nClara Kramer is the teenage daughter of a Jewish factory owner at the outbreak of war in Europe in 1939. Her hometown of Zolkiew is initially in the Russian occupied part of Poland. She witnesses several friends and family being killed or deported by the Soviets, and hears stories of them being forced into labor.\nWhen the Russians switch sides and join with the Allies following Germany's invasion of Soviet Union, the Red Army retreats, and the town is quickly occupied by the Nazis. Jews are stripped of their assets and ordered to relocate to the ghetto, but having heard stories of the treatment Jews have been receiving at the hands of the Nazis, Clara's family and their friends take the decision to go into hiding.\nWith the help of Valentin Beck, an ethnic German, and his family, Clara, her family and others are hidden in a purpose-built bunker under Melman's house [ who are also living in the bunker with Clara and her family], which the book describes as \"a space no larger than a horse stall.\" Beck, who is employed by the occupying forces as a storeman in an alcohol depot, has a reputation as an anti-Semite, a drunk and a philanderer. The author says that 18 people lived in the bunker for much of the time, while above them Beck's house was often used as lodgings for Wehrmacht troops and SS officers. In the bunker, Clara's mother urges her to begin writing a diary so that if they do not survive the war, the world will know what happened to them.\nKramer recalls her day-to-day life in the bunker, the struggle to survive, how Beck brings them food and news of the war. She learns from Beck of the deportation of many of her friends to the death camps and other events associated with the Holocaust in Poland. She also recalls an affair that Beck has with one of the occupants, and how this puts them all in danger when Beck's wife, Julia, becomes aware of the relationship. There are also many occasions on which they are almost compromised.\nAll but one of the occupants survives to see Zolkiew liberated by the Red Army, the one death occurring when the house catches fire and Clara's sister flees in panic and is captured by the Nazis. Kramer claims that of 5,000 Jews in Zolkiew before the war, only 50 survived.\nReferences\nExternal links\n*[https://web.archive.org/web/20121022095552/http://www.harpercollins.com/books/Claras-War/?isbn=9780061728600 Clara's War] at HarperCollins.com\n*[https://www.yadvashem.org/education/educational-materials/books/claras-war.html Clara's War] at Yad Vashem website"
    }
  ]
}