{
  "content": [
    {
      "type": "text",
      "text": "# Clarence Edward Elwell\n\n| birth_place = Cleveland, Ohio, US\n| death_date =\n| death_place = Columbus, Ohio, US\n| previous_post = Auxiliary Bishop of Cleveland (1962-1968)\n| ordained_by = Sigismund Waitz\n| education = St. Ignatius CollegeSt. Mary SeminaryUniversity of Innsbruck\n| motto = Diligamus alterutum(Let us love one another)\n}}\nClarence Edward Elwell (February 4, 1904 &ndash; February 16, 1973) was an American prelate of the Roman Catholic Church. He served as bishop of the Diocese of Columbus in Ohio from 1968 until his death in 1973. He previously served as an auxiliary bishop of the Diocese of Cleveland in Ohio from 1962 to 1968.\nBiography\nEarly life\nClarence Elwell was born on February 4, 1904, in the Newburgh Heights section of Cleveland, Ohio. After graduating from Holy Name High School in Parma Heights, Ohio, he studied medicine at St. Ignatius College in Cleveland for two years. Elwell then decided to enter the priesthood and transferred to St. Mary Seminary in Lakeside, Ohio. He then traveled to Innsbruck in Austria-Hungary to study at the University of Innsbruck.\nPriesthood\nElwell was ordained a priest in Innsbruck for the Diocese of Cleveland by Bishop Sigismund Waitz on March 17, 1929.Upon his return to Cleveland, Elwell served as an assistant priest, teacher, and assistant superintendent of schools in the diocese. He earned a Master of Education degree from Western Reserve University in Cleveland in 1934, and a Doctor of Education degree from Harvard University in Cambridge, Massachusetts, in 1938. When he returned to Cleveland, Elwell was named director of Catholic high schools. In 1946, he was appointed superintendent of the diocesan school system. The Vatican elevated Elwell to the rank of monsignor in 1949.\nAuxiliary Bishop of Cleveland\nOn November 5, 1962, Elwell was appointed as an auxiliary bishop of Cleveland and Titular Bishop of Cone by Pope John XXIII. He received his episcopal consecration on December 21, 1962, from Archbishop Egidio Vagnozzi, with Bishops Floyd Begin and John Francis Whealon serving as co-consecrators, at the Cathedral of St. John the Evangelist in Cleveland\nBishop of Columbus\n(2017)]]\nPope Paul VI named Elwell as the eighth bishop of Columbus on May 29, 1968; he was installed at St. Joseph's Cathedral in Columbus on August 22, 1968. During his tenure as Bishop, Elwell continued the implementation of the reforms of the Second Vatican Council, initiated under his predecessor, John Carberry. An advocate of Catholic education, he opened the following schools in Ohio:\n* Tuscarawas Central Catholic High School in New Philadelphia\n* William V. Fisher Catholic High School in Lancaster\n* Bishop Rosecrans High School in Zanesville\nElwell also converted the diocesan seminary in Columbus into St. Charles College Preparatory School. He also established Resurrection Cemetery in Lewis Center, Ohio, St. Peter Parish in Worthington, Ohio, the Sisters' Council, and the Pastoral Council. He significantly expanded the Development Office, the Parish Aid Fund, and the diocesan self-insurance program.\nDeath\nClarence Elwell died at his residence in the chancery in Columbus on February 16, 1973, at age 69. He is buried at St. Joseph Cemetery in Columbus.\nReferences"
    }
  ]
}