{
  "content": [
    {
      "type": "text",
      "text": "# Clash of Civilizations Over an Elevator in Piazza Vittorio__disambig_1\n\nClash of Civilizations Over an Elevator in Piazza Vittorio () is an Italian-language novel by Amara Lakhous, published  in 2006. Its English translation, by Ann Goldstein, was published in 2008 by Europa Editions.\nSynopsis\nThe novel takes place in an apartment complex in the Piazza Vittorio Emanuele II area. In the story, police question residents of various origins in a single apartment complex.\nThe novel uses the first person point of view.\nCharacters\n* Amedeo (originally named Ahmed) – From Algeria, he intentionally conceals his origins, leading to ambiguity about his origins among those who know him; based on his words, some think he is southern Italian instead of being of North African origins. Sandro gave him the name \"Amedeo\". In his past, he was to be married to a woman named Bàgia, but she died.\n* Abdallah Ben Kadour – He came from the same community Amedeo grew up in, and now lives in Rome.\n* Mauro Bettarini\n* Sandro Dandini – A native of Rome, he owns a bar and lives in the same building as Amedeo.\n* Benedetta Esposito – The landlady, she is from Naples. She uses Neapolitan as her primary language, which makes it difficult to find work. She is oppressed by Italians from other parts of Italy, and she oppresses people of recent immigrant origins.\n* Elisabetta Fabiani – She is from Rome and lives with Valentino, her dog, until the dog is killed.\n* Maria Cristina Gonzalez – A caretaker of a senior citizen, she originates from Peru, and suffers from alcoholism. She meets other Peruvians at Roma Termini railway station.\n* Iqbal Amir Allah – He originates from Bangladesh.\n* Antonio Marini – He originates from Milan, and is a university professor. Graziella Parati of Dartmouth College describes him as \"the outsider from the north who considers himself superior and therefore deserving of special treatment\".\n* Johan Van Marten - Originating from the Netherlands, he is an expatriate and is not an immigrant to Italy. Parati stated that he is \"privileged\" in Italian society.\n* Stefania Massaro\n* Parviz Mansoor Samadi – He is from Iran and had left that country due to political reasons. He does not consider himself to be an immigrant. He uses French as his Italian is not fluent.\nAccording to Parati, an elevator used by many characters is rendered into being \"a central character\".\nPublication\nClash of Civilizations Over an Elevator in Piazza Vittorio, a novel written in Italian by Amara Lakhous, was first published by Edizioni e/o in 2006.\nIts English translation, by Ann Goldstein, was published in 2008 by Europa Editions.\nThemes and reception\nAccording to American  critic John Powers of National Public Radio, even though the plot is driven by police looking for the person who committed a murder, \"the mystery isn't really the point.\" Publishers Weekly praised the \"intriguing psychological and social insight\". According to The New Yorker, the multicultural Rome of the 2000s is the \"author's real subject\".\nClash of Civilizations won the Flaiano Prize.\nFilm adaptation\nThere is a , titled Scontro di civiltà per un ascensore a Piazza Vittorio, released in 2010.\nReferences\n*\nReference notes\nExternal links\n* [https://www.europaeditions.com/book/9781609457365/clash-of-civilizations-over-an-elevator-in-piazza-vittorio-bilingual-edition Clash of Civilizations Over an Elevator in Piazza Vittorio]\n* [https://www.edizionieo.it/book/9788876418099/scontro-di-civilta-per-un-ascensore-a-piazza-vittorio Scontro di civiltà per un ascensore a Piazza Vittorio] – Edizioni e/o"
    }
  ]
}