{
  "content": [
    {
      "type": "text",
      "text": "# Clay King Smith\n\n| birth_place       = Pine Bluff, Arkansas, U.S.\n| death_date        =\n| death_place       = Cummins Unit, Lincoln County, Arkansas, U.S.\n| cause             = Execution by lethal injection\n| criminal_status   = Executed\n| conviction        = Capital murder\n| penalty           = Death\n| victims           = 5\n| date              = March 25, 1998\n}}\nClay King Smith (July 25, 1970 – May 8, 2001) was an American mass murderer executed by the state of Arkansas for the March 25, 1998, murders of Misty Erwin (age 20), Shelley Sorg (24), Shelley's two children Sean Sorg (5) and Taylor Sorg (3), and babysitter Samantha Rhodes (12) at his home near Pine Bluff, Arkansas.\nMurders\nSmith's girlfriend, Misty Erwin, reported that Smith battered her and requested police assistance to move out of the house. However, when the police arrived, she withdrew her complaint and decided to stay with Smith. Her body was found in the house with a cousin, two small children, and a babysitter two days later. All were shot to death with a rifle.\nSmith was arrested the day after the bodies were discovered. His capture followed a shootout with authorities near Star City in Lincoln County, Arkansas. Smith fled into a wooded area when police tracked him down to a house belonging to a local hunting club. Smith held police at bay for an hour with a rifle, which later proved to be the murder weapon. During the stand-off, he yelled at the police, \"I sent three of them to Heaven, and two to Hell.\" Smith made several admissions during the stand-off until he was shot in the arm by police when he refused to put down his rifle. He claimed that the murders were drug-induced.\nAppeals\nSmith quickly waived all rights to appeal his sentence. A judge ruled in November 1999 that Smith was competent enough to waive his appeal rights. At the hearing, Smith told the court he was sorry for the pain he had caused and added, \"I don't want to do any more harm.\"\nJefferson County Circuit Judge H.A. Taylor said Smith had knowingly waived his appeal and understood the implications. The Arkansas Supreme Court, in a routine review of death-row cases, affirmed Smith's convictions. The justices allow inmates to drop their appeals if they demonstrate that they know what might happen. Smith said he made the decision because he didn't want to put his family or the victims' families through a lengthy appeal process. Smith was the third consecutive death row inmate to waive at least part of his appeal rights.\nExecution\nClay King Smith spent his final days writing letters. Smith wrote letters to the families of each of his victims asking for forgiveness and telling them he would waive his right to appeal unless they asked him to do otherwise. No one did.\nIn a letter dated April 22, Smith told Misty Erwin's father, Randy, her mother Lula, and her three sisters, Tabitha, Margo and Frances, that he was waiving his right to appeals so that they could move on with their lives. \"You don't need to keep reliving what happened over and over and that's what appeals would do,\" Smith wrote. \"If you all want me to appeal you should let me know and I will. Otherwise, I'm going home to be with Jesus. I can hardly wait. I believe I am going to see Misty there...\"\nIn a brief final statement, while strapped to a gurney in the execution chamber at Cummins Unit, he spoke to four family members of his victims as they watched on a closed circuit television. \"I'd like to say I'm sorry about what I did to the victims' families. I hope your hearts heal. I love my family. I love my family.\"\nSmith was the 24th person executed by the state of Arkansas since Furman v. Georgia, which instated new capital punishment laws were passed in Arkansas that came into force on March 23, 1973. The state resumed executions in 1990.\nIn the media\nThe story of the murders as told through the eyes of Smith's brother, retired police officer Walt Chavis, was discussed on the episode \"The Cop and the Killer\" of Evil Lives Here. The episode (Season 3, Episode 8) premiered on February 25, 2018.\nSee also\n* Capital punishment in Arkansas\n* Capital punishment in the United States\n* List of people executed in Arkansas\n* List of people executed in the United States in 2001\n* Volunteer (capital punishment)\nReferences\n! colspan=\"3\" | Executions carried out in Arkansas\n|-\n! colspan=\"3\" | Executions carried out in the United States"
    }
  ]
}