{
  "content": [
    {
      "type": "text",
      "text": "# Cleator and Workington Junction Railway__disambig_1\n\n| old_gauge =\n| minradius   =\n| racksystem  =\n| electrification =\n| speed       =\n| elevation   =\n| website     =\n}}\nThe Cleator and Workington Junction Railway (C&WJR) was located in West Cumberland in Northern England, serving the towns of Cleator Moor and Workington and intermediate villages. It was mainly used for coal, limestone and iron ore traffic for the local industries.\nHistory\nThe C&WJR was incorporated in 1876 and a bill presented to Parliament in the same year, being passed as the  (39 & 40 Vict. c. li).\nConstruction began shortly after and the line between Workington and Cleator Moor was opened in 1879. The line continued northwards from Workington to a junction with the London and North Western Railway (LNWR) at Siddick, approximately two miles away.\nThe principal station and company headquarters were in Central Square, Workington and the station soon became known as Workington Central. A second main line was built from a junction on the C&WJR main line at Calva Junction to Linefoot Junction, where it joined the Maryport and Carlisle Railway. This section was known as the Northern Extension.\nSeveral branch lines were built including that to Rowrah, of which a short 300 yard section remained in use there as a backshunt until 1978.\nTo the people of West Cumberland the line became affectionately known as the \"Track of the Ironmasters.\" The C&WJR never ran its own services on the main lines: this was done on their behalf by the Furness Railway. In later years the C&WJR purchased its own engines to work its branch lines (see below).\nAt the railway grouping of 1923, the line was incorporated into the London, Midland and Scottish Railway network. The Northern Extension section that served the Broughton Moor Armaments Depot closed on 4 June 1992.\nAccidents and incidents\n*On 16 February 1900, an embankment was washed away at Moss Bay, Workington. A freight train on the Moss bay Branch was derailed with the locomotive coming to rest on its side.\nThe 0-6-0ST locomotive was rescued shortly after the incident and was returned to traffic.\nRoute\nMain line\n-  -  -  -  ([https://maps.google.com/maps/ms?hl=en&ptab=2&ie=UTF8&view=map&msa=0&msid=106830292399681303740.000492f1095c1b6c284f9&ll=54.582807,-3.541718&spn=0.232787,0.688705&t=h&z=11 Route in Google Maps])\nNorthern extension\n-  -  ([https://maps.google.com/maps/ms?hl=en&ptab=2&ie=UTF8&view=map&msa=0&msid=106830292399681303740.000492f126103bc2b1175&t=h&z=13 Route in Google Maps])\nRowrah line\nThe Rowrah Line was branch line that left the mainline south of , accessing the mines and quarries near Rowrah.  This branch line crossed over the main line from Workington to Cleator Moor to continue to Rowrah.  The Company built a single road engine shed near the junction to house a C&WJR locomotive that worked the line.  The much altered building exists today (2017) as an agricultural store.\nCleator & Workington Junction Railway locomotives\nAll the nameplates used on this company's locomotives were named after residences of C&WJR company directors. Until recently there was uncertainty about the name of No. 2 but the personal notebook of the Company Accountant shows otherwise. The engine never ran in service with the name \"Ennerdale\".\n* No. 1  Brigham Hill (1st) and Rothersyke (1st)\nAn outside cylinder 0-4-0T Built in 1882 by Fletcher Jennings Ltd for C&WJR. Builders No. 187. Nameplates carried: Brigham Hill (1882–1894) and Rothersyke (1894–1897)  Renumbered: No known renumbering of this engine.  Disposal: To West Stanley Colliery Coy. County Durham in 1897\n* No. 2  Unnamed for fifteen years, then Rothersyke (2nd)\nAn outside cylinder 0-4-0ST. Built circa 1875 by Barclay & Co. (not an Andrew Barclay Sons & Co. product). Built originally for Ward, Ross & Liddlelow, railway contractors to the C&WJR, No. 2 was purchased second hand in 1882. No. 2 was originally named Ennerdale but the nameplates were removed after acquisition by the C&WJR on the order of the Managing Director. Nameplates Carried: None from 1882 to 1897. The redundant plates from engine No.1 Rothersyke were fitted when it was decided to sell the engine.  Renumbered: No known renumbering of this engine.  Disposal: To SD Coasdell of Workington in July 1898 for £150.\n* No. 3  South Lodge\nAn outside cylinder 0-6-0ST of 1884, built by Robert Stephenson and Company for the C&WJR. Builders No. 2553. The saddle tank did not cover the smokebox. Nameplates carried: South Lodge. (1884 to 1920)  Renumbered: No known renumbering of this engine.  Disposal: To J.F. Wake Ltd., Dealers, Darlington, County Durham, July 1920\n* No. 4  Harecroft\nAn outside cylinder 0-6-0ST built in 1885 by the Lowca Engineering Co. Ltd. for the C&WJR. Builders No. 196. Similar in appearance to No. 3 and the saddle tank did not cover the smokebox. Nameplates carried: Harecroft (1885 to 1915)  Renumbered: After disposal by new owner to 46 Disposal: Withdrawn September 1915 and sold to Workington Iron & Steel Company.\n* No. 5  Moresby Hall\nAn outside cylinder 0-6-0ST built in 1890 by Robert Stephenson and Company for the C&WJR. Builders No. 2692. The saddle tank did not cover the smokebox.Nameplates carried:  Moresby Hall (1890 to 1919)  Renumbered: No known renumbering of this engine. Disposal: Withdrawn and scrapped 1919.\n* No. 6  Brigham Hall\nAn outside cylinder 0-6-0ST built in 1894 by Robert Stephenson and Company for the C&WJR. Builders No. 2813. The saddle tank did not cover the smokebox.Nameplates carried:  Brigham Hall (1894 to 1920)  Renumbered: Allocated 11564 by the LMS in 1923 after the grouping, but not known if it was repainted into LMS colours. Disposal: Withdrawn 11/12/1926 and scrapped by the LM&SR\n* No. 7  Ponsonby Hall\nAn outside cylinder 0-6-0ST built in 1896 by Robert Stephenson and Company for the C&WJR. Builders No. 2846. The saddle tank did not cover the smokebox.Nameplates carried: Ponsonby Hall (1886 to 1926)  Renumbered: Allocated 11565 by the LMS in 1923 after the grouping, but not known if it was repainted into LMS colours. Disposal: Withdrawn 18/12/1926 and scrapped by the LM&SR\n* No. 8  Hutton Hall\nAn 0-6-0ST built in 1907 by Peckett and Sons for the C&WJR. Builders No. 1134. Nameplates carried: Hutton Hall (1907 to 1927)  Renumbered: Allocated 11566 by the LMS in 1923 after the grouping, and repainted into early LMS black goods livery. Disposal: Withdrawn 3/12/1927 and scrapped by the LM&SR\n* No. 9 Millgrove\nAn outside cylinder 0-6-0ST built in 1919 by Peckett and Sons for the C&WJR. Builders No. 1340. Nameplates carried: Millgrove (1919 to 1928)  Renumbered: Allocated 11567 by the LMS in 1923 after the grouping, and repainted into early LMS black goods livery. Disposal: Withdrawn 5/12/1928 and scrapped by the LM&SR\n* No. 10 Skiddaw Lodge\nAn outside cylinder 0-6-0ST built in 1920 by Hudswell Clarke & Co. for the C&WJR. Builders No. 1400. Nameplates carried: Skiddaw Lodge (1920 to 1932)  Renumbered: Allocated 11568 by the LMS in 1923 after the grouping, and repainted into early LMS black goods livery. Disposal: Withdrawn 1932 by LM&SR and sold to Hartley main Collieries Northumberland, via Robert frazer & Sons Ltd., Hebburn, County Durham.\nOther railways in the Workington area\nWhitehaven, Cleator and Egremont Railway\nSee also\n* Notes on Furness Railway locomotives, some of which ran on the line and were based at Moor Row shed, can be found here: Steam locomotives of the Furness Railway\nReferences\nExternal links\n* [http://www.railbrit.co.uk/Cleator_and_Workington_Junction_Railway/frame.htm Map]"
    }
  ]
}