{
  "content": [
    {
      "type": "text",
      "text": "# Clear (The Walking Dead)\n\n|writer=Scott M. Gimple\n|director=Tricia Brock\n|music=\"Lead Me Home\" by Jamie N Commons\n|photographer   = Rohn Schmidt\n|editor         = Nathan D. Gunn\n|guests=*Lennie James as Morgan Jones\n*Russ Comegys as Hitchhiker\n| season_article = The Walking Dead season 3\n| episode_list = List of The Walking Dead episodes\n|prev=I Ain't a Judas\n|next=Arrow on the Doorpost\n}}\n\"Clear\" is the twelfth episode of the third season of the post-apocalyptic horror television series The Walking Dead, which originally aired on AMC in the United States on March 3, 2013. The episode was written by Scott M. Gimple and directed by Tricia Brock. In this episode, Rick Grimes (Andrew Lincoln), Carl Grimes (Chandler Riggs), and Michonne (Danai Gurira) go on a supply run to Rick's hometown, initially to his old police station, for more weapons for the upcoming battle against The Governor.\nThis episode marks the return of Morgan Jones (Lennie James), who was last seen in the series pilot episode, \"Days Gone Bye\".\n''Fear the Walking Dead's'' season 8 episode \"King County\" later brings Morgan back to King County, Georgia where the events of this episode took place and contains a number of narrative references to \"Clear,\" including a more in-depth exploration of what happened to Morgan's family and his state of mind afterwards.\nPlot\nRick Grimes, his son Carl, and Michonne go on a scouting run to retrieve weapons in preparation for an impending attack by The Governor. Carl privately expresses his reservations about the trustworthiness of Michonne. Along the way, the group passes a lone hitchhiker (Russ Comegys) and ignore his pleas to stop.\nRick drives them to his hometown, and finds that the sheriff's station has been cleared out of weapons. Knowing he gave out several gun permits to local businesses, they go to the town's center but find it booby trapped. A masked gunman from a roof demands they drop their weapons, but this leads to a gunfight. Carl shoots the gunman's ballistic vest, knocking him unconscious. They find he is Morgan Jones, the first person Rick met after waking from a coma following the apocalypse. They take Morgan to his apartment, finding a large stash of guns and ammo. Rick sees a drawn map of the town created by Morgan, learning that his neighborhood has been \"burned out\".\nRick wants to stay until Morgan wakes, while Carl offers to search for supplies including a crib for his infant sister Judith. Rick agrees, but insists Michonne go along with him. Carl walks past a baby store to Michonne's confusion, and enters a café. He takes a picture off the wall of his family, as a way to show Judith what her mother looked like. However, they arouse some walkers within the cafe. Michonne pulls Carl out but he drops the picture. Michonne returns inside and obtains the picture, as a well as a papier-mâché cat sculpture, and reunites with Carl safely outside. They return to the baby store to obtain the crib and other supplies.\nMeanwhile, Morgan wakes up, and instinctively tries to stab at Rick before Rick calms him down. They both apologize for failing to keep in contact by walkie-talkie after Rick left. Morgan mourns the loss of his son, Duane, when he was bitten by Morgan's undead wife, which he could not come to dispatch in time. Since then, he has found a purpose by keeping the town center and nearby buildings clear of walkers. Rick insists he come with them to the prison, but Morgan refuses, not wanting to watch everyone die. He does allow Rick to take some of his weapons.\nCarl and Michonne return, and Carl apologizes to Morgan for shooting him, but Morgan tells him to never be sorry. Rick, Carl, and Michonne gather the offered weapons and depart. As they return to the vehicle, Carl confides to Rick that Michonne \"may be one of us\". Michonne later talks to Rick, informing him that she saw him talking with his dead wife, but admits she also used to have similar episodes in talking to her dead boyfriend. As they drive back, they pass the corpse of the hitchhiker they had passed earlier. They stop the car only to collect his backpack, and then drive on.\nProduction\n\"Clear\" was directed by Tricia Brock, marking her first directing credit for the series. It was written by supervising producer Scott M. Gimple, marking his fifth writing credit for the series after joining the writing staff in season two. Gimple's appointment to succeed Glen Mazzara as showrunner for season four was announced in February 2013.\n\"Clear\" fits at least part of the definition of a \"bottle episode,\" an episode with few regular cast members that takes place in a small number of locations.\nTitle reference\nIn an interview with Inside TV, Robert Kirkman defines the episode's title:\n:Clark Collis: Morgan talked about “clearing” a couple of times — and episode was titled \"Clear.\" What does that mean?\n:Robert Kirkman: It means a lot of things. To a certain extent it’s the ravings of a lunatic but it’s also about him trying to clear out his life and clear out any entanglements around him. He’s living by himself so he’s trying to have a clear head. It’s basically about him getting rid of his wife and getting rid of his son and the only way for him to survive is to clear the area around him.\nReception\nCritical response\n' performance in the episode was highly praised by critics.]]\n\"Clear\" was lauded by television critics, with many claiming it to be one of the best episodes of the series. Zack Handlen of The A.V. Club called it \"the best episode of season three so far and possibly the best since the pilot\" and later went on to say, \"the hour has focus, and focus is a wonderful, wonderful thing.\" Handlen gave the episode an \"A\" grade. Eric Goldman of IGN also lauded the episode, calling it \"a focused, highly emotional episode\"; \"took Rick, Carl and Michonne back to the beginning - and into one of the best episodes yet.\" Goldman also applauded the character development of Michonne, saying, \"It was a big relief to see Michonne come off so much better this week than she has since her introduction\". Goldman gave the episode a score of 9.6 out of 10. Eric Kain of Forbes said, \"Sunday night's episode brought all the show's magic back—and what tense, creepy magic it is.\"\nRatings\nThe original broadcast, on March 3, 2013, was watched by an estimated 11.296 million viewers, an increase in viewership from the previous two episodes.\nReferences\nExternal links\n*[https://www.amc.com/twdu/the-walking-dead/season-3/episode-12 \"Clear\"] at AMC\n*"
    }
  ]
}