{
  "content": [
    {
      "type": "text",
      "text": "# Clementine (The Walking Dead)\n\n| voice = Melissa Hutchison\n}}\nClementine is a fictional character in The Walking Dead episodic graphic adventure video game series, a spin-off of the Robert Kirkman comic of the same name and developed by Telltale Games. An original character developed by Telltale for the video game series, she is the series' main protagonist and one of the playable characters. She is voiced by Melissa Hutchison and was written by several people, including Gary Whitta.\nClementine is introduced in the first season as a young girl, left in the care of her babysitter Sandra while her parents are out of town, at the start of the zombie apocalypse. She is found and cared for by Lee Everett, another survivor, who tries to help her find her parents, and becomes a father-figure to her, teaching her how to survive. Lee is eventually bitten, and after a tearful goodbye, Clementine travels with other groups. Over several years, she becomes a guardian to Alvin Jr. (AJ for short), a child whose parents died in the apocalypse, and comes to raise him as Lee did with her.\nClementine was considered an emotional centerpiece of The Walking Dead game, and several journalists expressed caring for her fate in a way that few other games have been able to capture. Following Telltale's sudden closure in the midst of releasing The Walking Dead: The Final Season, Kirkman acquired the game's assets and brought some of the Telltale staff on to finish the season within his company Skybound Entertainment, as he felt it was necessary to give closure to Clementine's story. The character subsequently appeared in the 2021 series Skybound X and later in the comic book of the same name, Clementine by Tillie Walden, in 2022.\nConcept and creation\nClementine first appeared in the 2012 episodic video game The Walking Dead. According to the game's creative lead, Sean Vanaman, Clementine was \"literally the first idea\" for developing the game, with her emotional climax at the finale of the fifth episode being established before any of the game's other dialogue was written. The development team had considered the inclusion of a child in a dark storyline to be similar to previous story elements from Robert Kirkman's The Walking Dead comic, but still had a difficult time of selling the concept originally. They then set to use Clementine as the \"moral compass\" for the main player character, establishing her as a \"smart, honest, and capable girl\" that would reflect on choices made by the player. Telltale had considered other backgrounds for Clementine, such as being from a single-parent family, or being the younger sister of the player character, but found that the pre-established emotional bond between the characters did not fit well, and instead opted to make Lee Everett her father-figure. Clementine is Afro-Asian.\nClementine's design was based on art director Derek Sakai's own daughter. Sakai described her as having \"a crazy sense of fashion\", selecting beloved clothing items to wear regularly. As such, Clementine was given an iconic baseball hat that serves as her connection to her parents. Sakai provided Vanaman with other advice from his fatherhood, offering that Clementine would appear smarter if she did not say as much, while still pointing out character flaws should one get out of line. Much of the game focuses on changes to Clementine's appearances and personality as she comes to grips with the new reality of the zombie-infested world. At the start of the game, Clementine is wearing a clean white dress, but it becomes dirty and soiled throughout the game, \"reflecting her loss of innocence\", according to Sakai.\nMelissa Hutchison, a voice actress that had previously worked on other Telltale games, was selected to be the voice for Clementine. Prior auditions were held, but Vanaman found that children could not grasp the emotion of the role while adults were not able to get the voice as they intended for the character; at one point, for lack of a suitable actress, Vanaman felt that \"we were going to have to take Clementine out of the game\". Hutchison was able to relate to the character of Clementine, as her life mirrored that of the character, and easily fell into the role of the character during auditions, securing her as the voice for Clementine.\nThe bond between Clementine and Lee was considered instrumental to the game by Telltale. Gary Whitta described Lee's and Clementine's relationship as \"emotionally authentic\". To build this relation, Clementine was introduced as early as possible within the first episode; the scene of Lee confronted with Clementine's zombified babysitter was specifically designed to highlight Clementine's likability, resourcefulness, and vulnerability. The writers carefully had to balance elements in this scene, as if, for example, Clementine appeared to be annoying to the player, the emotional bond would be absent and the player would likely make choices without caring about Clementine's fate. Writer Jake Rodkin stated that the difficulties of writing a child character that the player wouldn't want to abandon led to serious discussion about dropping Clementine late in the development process, a week before voice recording was to start. The game designer and writer Harrison G. Pink commented that the in-game decisions were not meant to be good because there couldn't be an optimal play-through. Clementine made those decisions even more difficult, since her presence forces the player to consider protecting her on another level. \"It gets way more blurred when you involve Clementine,\" Pink said. \"You have these decisions that are probably the right decisions for the group--she's watching, but then maybe she needs to understand this, but I might scare her because she'll think I'm a crazy person. There's no wrong choice, if you can justify it and it feels properly motivated to you, it's a valid choice.\"\nWith the game's second season, Clementine becomes the playable character, a choice that allowed them to continue the themes of the first season while introducing new characters and situations for the second. Telltale was first challenged to try to make Clementine feel like the character that the player, through making decisions as Lee, had groomed. One method this was resolved by was to create the first scenario of the game to put the player in control of Clementine's actions that have disastrous results (the death of one character and being separated from another) as to make the player felt as if they had made those choices and separating them from familiar characters. Further, they had to consider how to present Clementine as a character that could make substantial changes on the world and characters around her despite being a child.\nTelltale had intended for The Walking Dead: The Final Season to be their final game featuring Clementine. As they were in the midst of developing and releasing this season, the studio suffered from a major financial crisis, forcing them to lay off nearly all of their staff and shutter existing projects. On this news, Robert Kirkman and others at Skybound Entertainment considered how they could finish the game, as Kirkman felt it was necessary to complete Clementine's story. Skybound brought in a portion of the former Telltale staff that had been working on The Final Season to complete the remaining episodes. In the one-shot spin-off \"Negan Lives\" comic published in July 2020, Kirkman ended the comic with a letter to the series fans, closing it with \"P.S. Clementine Lives\", which was taken as a hint that Kirkman may be involved with a means of re-introducing Clementine to The Walking Dead world. Kirkman again alluded to a possible future work involving Clementine at the 2020 virtual New York Comic Con. An issue of Image Comics' Skybound X, featuring stories from various Skybound properties, including one story around Clementine in The Walking Dead universe, was published in July 2021.\nA three-book series, titled Clementine, was released by Skybound starting on June 22, 2022, and concluded on June 25, 2025. The series is drawn and written by Tillie Walden. Clementine makes a cameo appearance in the 2021 remaster of Sam & Max: Beyond Time and Space, with Hutchinson reprising her voice role.\nAppearances\nThe Walking Dead: Season One\nClementine is introduced when Lee Everett takes shelter in her suburban home in Georgia to find refuge from zombies (referred to in-universe as walkers). She is revealed to be hiding from the walkers alone in a tree house as her parents had left for Savannah some time before the apocalypse. Lee offers to take and protect Clementine, hoping that they will be able to find her parents.\nThey eventually join a small group of survivors, which include Kenny, his wife Katjaa and his son Kenny \"Duck\" Jr. Following several weeks struggling to survive, the survivors decide to head to Savannah, believing that if they can find a boat, they can find safety away from the mainland. As a choice to the player, Kenny and Lee are forced to euthanize Duck or leave him to re-animate after he is bitten by a walker, causing Katjaa to kill herself. Lee starts to help Clementine learn survival skills such as how to use a gun and why she needs to keep her hair short. As they near Savannah, Clementine's walkie-talkie goes off, and an unknown man tells her to come to meet him at the hotel downtown, the same hotel her parents would have been at.\nThe survivors meet other people still alive in Savannah and eventually they find a boat. The group prepares to leave but Clementine and the boat go missing, and Lee in his haste to find her is bitten by a walker. Lee convinces the remaining survivors, including Kenny and friends Omid and Christa, to help locate Clementine. Kenny is lost during a walker attack, while Lee ends up separated from Omid and Christa. Lee goes to the hotel to find Clementine held hostage by an insane man who blames Lee for his family's death. They work together to kill the man and escape. Lee covers Clementine and himself in walker guts to mask their scent and as they walk through a horde they find Clementine's parents, both turned. Lee passes out and Clementine drags him into a nearby shelter. Knowing he is about to turn, Lee gives Clementine some last pieces of advice and tells her to meet Omid and Christa. He then asks her to kill him or leave him (a choice left to the player). Later, Clementine has safely left the city. She then goes back to Omid and Christa, They then leave the city and Journey across Georgia.\nThe Walking Dead: Season Two\nSeason Two starts some months after the end of the first season. Clementine has regrouped with Omid and Christa, but her carelessness at a rest stop causes Omid to be killed by a scavenger. Sixteen months later, she and Christa are separated by another scavenger attack, and Clementine joins another group of survivors living in a cabin. She learns that this group is being tracked by a man named William Carver, who believes that one member of the group, Rebecca, is carrying his child.\nThe cabin survivors move north, hoping to reach the rumored safe place called Wellington. They find a ski lodge inhabited by another group, where Clementine finds Kenny alive. During a walker attack, the combined groups are saved by the sudden appearance of Carver and his minions, who take the survivors as their prisoners to a well-fortified department store. Seeing Carver's ruthlessness leads three other survivors, Jane, Mike, and Bonnie, to join Clementine and the others in plotting an escape before the store is overrun by a mass of walkers. Clementine aids in their escape, and Kenny kills Carver.\nAs they flee, Kenny's girlfriend Sarita is bit by a walker and dies. When they regroup, Kenny is distraught and refuses to talk to anyone, but he is convinced to help Rebecca give birth to her baby, which is later named Alvin Jr. or AJ, named after Rebecca's partner Alvin, who was killed. Jane takes interest in Clementine, and like Lee before, helps to teach her some survival skills. The group continues northward despite Rebecca's worsening health. They are ambushed by a group of Russian immigrants, leading to a Mexican standoff. Clementine sees that Rebecca has succumbed to exhaustion and blood loss from the birth, has died but is now re-animating as a walker, and she or Kenny are forced to shoot her to save AJ. This sets off the gunfight, but the group manages to kill the other Russians, and they force the sole Russian survivor, named Arvo, to take them to shelter. As they cross a frozen lake, their added weight causes the ice to break and one of their members, Luke, to fall through and drown.\nLater that evening, Clementine discovers Arvo and others attempting to sneak away, due to being afraid of Kenny's rage, which leads to Arvo shooting Clementine, causing her to faint, however his attempt on her life was in vain. When Clementine wakes she finds herself with Kenny, Jane, and AJ heading north in a truck. They are forced to stop as a snowstorm approaches with the road blocked ahead, and Kenny goes to look for a way around; while he is gone, a walker horde appears, and Clementine is separated from Jane and AJ but finds shelter in a nearby rest stop where she finds Kenny. Jane appears and implies that AJ has been killed, causing Kenny to attack her. The two struggle and Clementine are forced to have one or both of them die. After the fight, she finds AJ safely hidden in a nearby car as part of Jane's plan to expose Kenny's temperament and convince Clementine to abandon him with her. The player can either decide for Clementine to leave with AJ alone or be accompanied by the survivor of the fight. If Kenny is chosen, the player may either choose to have Clementine enter Wellington with AJ alone or to continue traveling with Kenny. If Jane is chosen, the pair return to the department store. There, a family of three will ask to come in, you can either let them in or don't let them in. If Jane is killed and Clementine shoots Kenny or if Clementine shot Kenny and abandons Jane, she will go alone.\nThe Walking Dead: A New Frontier\nA New Frontier takes place some years after Season 2. The story mainly follows Javier García. Clementine is also a playable character. Several events have occurred depending on which ending the player chooses in it. She will have a scar on her forehead, a scar on her right cheek, an \"AJ\" brand on her hand or a missing left ring finger depending on which of the events occur. She currently tends to AJ, who is now a toddler.\nClementine's story since the end of Season Two is told in flashbacks throughout A New Frontier. If she and AJ had gone with Kenny, she would spend the next two years together with Kenny, who would take care of both of them and became a father-figure for the two, until Clementine crashes a car while being taught how to drive, paralyzing Kenny from the waist down. He forces Clementine to leave as he is eaten by walkers. If Clementine had gone with Jane, she lives with her at the department store for a short time until Jane commits suicide after learning she is pregnant. If Clementine stayed at Wellington, she and AJ will be cared for by their guardian Edith for the next two years until Wellington is attacked by bandits. Edith is shot dead, and Clementine is scarred by a bullet whilst escaping. If traveling alone with AJ, Clementine's finger is broken in a car door, and she is forced to amputate it. No matter what the player chooses she will eventually end up tending for AJ alone. She encounters Ava, a woman who tells her about joining a group called the New Frontier.\nWithin the present of A New Frontier, Clementine had become a member of the New Frontier but was exiled after stealing medicine from the group's doctor, Lingard, in an attempt to save a deathly ill AJ. She inadvertently rescues Javier while trying to acquire a working vehicle and agrees to help rescue his family at a nearby junkyard, in return for Javi's van. They get into a conflict with other members of the New Frontier, and ultimately Clementine and Javier are forced to travel to Richmond, a fortified town that has been taken over by the New Frontier. Clementine helps Javier to assure his family's well-being and defuse the issues with the New Frontier and other survivor outposts. She learns that AJ is being kept at a ranch outside of town and leaves to recover him.\nThe Walking Dead: The Final Season\nThe Final Season is the closure of Clementine's narrative arc in the series. Some years after the events of A New Frontier, Clementine and AJ, who is now a young boy, are traveling on their own. After crashing their car escaping walkers, they are rescued by Marlon, the leader of a group of children from the abandoned Ericson boarding school. Clementine uses her time in the school to get to know the other children while helping them for sustainability and protection. Eventually, Clementine finds out that Marlon traded two of the school's residents, twin sisters Minerva and Sophie, to a group of raiders that threatened the school in exchange for safety and intends to do the same with her and AJ should they return. Clementine pressures Marlon to reveal the truth to the other kids, only for him to be shot and killed by AJ.\nSome of the other kids vote for Clementine and AJ to leave the school, where in its outskirts they run into the raiders, one of them being Lilly, an old acquaintance of Clementine from their survivor group in the first season. Lilly threatens Clementine to return to the school and convince the rest of the children to join her group. Clementine and AJ escape with the help of James, a former member of the Whisperers, although AJ is shot and wounded. Clementine takes AJ back to Ericson for medical treatment and warns the kids of Lilly's incoming attack, helping them prepare by fortifying the school. Two weeks later, the raiders arrive. Despite the children's efforts to fight back, the raiders manage to kidnap some of them.\nClementine interrogates a captured raider and learns that his group has set up base on a riverboat west of the school. She scouts the place and decides that in order to sneak in and rescue the captured kids undetected, a horde of walkers need to be lured in to distract the raiders. Clementine enlists the help of James to do this, and obtains a homemade bomb to destroy the boat after they rescue the others. Clementine and her group infiltrate the boat when James draws the walkers towards it. Inside, they plant the bomb in the ship's boiler and encounter Minerva, now loyal to the raiders. She imprisons them with the other children and Clementine is confronted by Lilly, who reveals that Minerva killed Sophie when she tried to escape from their group. Lilly takes AJ away, and Clementine subdues Minerva and frees the kids. She fights Lilly into submission, and is forced to tell AJ to shoot her or spare her life, the latter choice resulting Lilly killing James. As this happens, the bomb goes off and the boat explodes.\nClementine and AJ escape the ship before it sinks. Clementine, AJ, and Tenn escape from the walker horde and find either Violet or Louis, who helps them make their way back to the school. They reach a bridge, but are attacked by a dying Minerva, who wounds Clementine's left leg. Clementine and AJ cross the bridge, and are forced to leave Tenn, Violet, or Louis to die to escape the walkers. Clementine is bitten by a walker on her wounded leg, and she and AJ take shelter inside a barn. Surrounded by walkers, Clementine tells AJ to make his way out through the roof, and to kill her to prevent re-animation or leave her behind to turn. In the game's ending, it is revealed that Clementine survived the bite after AJ amputated her infected leg. She is also shown to have assumed leadership of Ericson, finally having found a home.\nSkybound X: Clementine Lives!\nSometime after The Final Season, Clementine decides to leave Ericson's Boarding School. She goes into the fishing cabin and finds a map. After hearing rustling from a walker and taking it out, she begins to pack supplies until she hears creaking at the door. She goes to attack, only to discover it's AJ. He, assuming Clementine is only going on a trip, confronts her about leaving without him and demands to go with her, however she refuses to let him come with her and tells him she's not going on a trip. AJ lashes out at her for breaking her promise, Clementine tearfully tells him she feels safer with him at Ericson's with The Coalition around, but it's not home for her and she is unhappy and not even AJ can make her happy. Clementine tells AJ that she will go north and the two share a tearful departure as Clementine journeys north alone.\nClementine: Book One\nAs Clementine continues northward, she is attacked by numerous walkers and while trying to escape, her prosthetic leg breaks. She then takes shelter in an abandoned barn. During her sleep, Clementine has a nightmare of Lee carrying her through the herd of walkers until he drops her, causing her to wake up. Clementine continues her travels until she come across three Amish girls. The girls notice her prosthetic and invite her to their town to get it replaced. Clementine arrives at their Amish community where she meets Rabby, a former dentist who makes a new prosthetic leg for her. After she leaves the settlement, she climbs a tree and falls asleep while thinking of a name for her new prosthetic.\nClementine is woken up the next morning by an Amish boy named Amos heading off on his Rumspringa. She chases after him and alerts him that walkers are behind him. After killing the walkers with his axe, Amos asks Clementine where she is headed. She tells him she is travelling north and he informs her he is also travelling north. They travel together and Amos reveals that he is going to Killington in Vermont to build a homestead on the mountain where he will be awarded with a plane ride after the job is completed. They travel together in Amos' buggy into the night where they hear people calling for help, Amos helps the family into his buggy and Clementine drives them all to safety. After Clementine falls asleep, one of the people they saved tries to assault Clementine. She holds a knife to his head and then stomps on his hand with her prosthetic foot before leaving. Amos chases after Clementine on his horse and asks her to come with him to Vermont.\nThey travel together for nine days and finally arrive at the base of the mountain, where they are met with twin sisters who won't tell them their names. Clementine doesn't trust them and tells Amos she's staying with him. They ride a ski lift to the top where they meet a girl named Ricca. She informs Clem that she's been calling the twin with the ponytail Right and the twin with her down Left. The twins tell them that they only have a cabin and shed left standing from last winter and that they want to build three new structures and a cleared road by the end of winter. They all settle down in the cabin for the night but are woken up by an avalanche hitting their cabin, putting a hole in their roof.\nThat morning Clementine and Amos start fixing the roof while Ricca and Left go hunting. Later on, Clementine, Ricca and Amos all take a snowmobile out for a joyride and are reprimanded by Right after they come back for dinner. The five continue to build on the mountain until Amos becomes ill with a fever. While Amos recovers, Left asks Clementine and Ricca to take a portable generator over to another ski lift so they can have more hunting territory. They take the snow mobile and find a broken bridge across a chasm. They decide to lower the generator into the chasm using rope, climb across and pull it back up. As they're lowering the generator it begins to gets pulled down causing Ricca to fall into the chasm. Clementine jumps down after her and finds the chasm filled with walkers. As the two girls fight the walkers Clementine breaks her prosthetic leg. After clearing all the walkers the girls sit down and rest, Ricca picks up her glasses only to find them broken and Clementine tells her she named her now broken prosthetic Kenny. Ricca gives Clem her bat and decides to try and climb out of the chasm before they freeze to death.\nStumbling around the dark chasm with one leg, Clem finds more walkers. She tries to fight them but is overpowered. She is rescued by a man named Tim, who tells her to stay quiet and that the walkers are all frozen so they move slowly. He carries Clem into a tunnel and tells her to follow behind him. While dealing with two walkers, Tim gets bitten on his cheek. He takes Clem to his tiny camp and asks if the twins are trying to build a homestead again. He reveals their real names to be Georgia and Olivia, telling Clem they're doing it all for their mother Epsey. After having a heart to heart Tim tells Clementine to get off the mountain and gives her his flashlight and hatchet. Clem finds her way out and finds Ricca. They climb out of the chasm and head back to camp where Amos has recovered from his fever and the twins ask Clementine where she found the hatchet, she tells them Tim gave it to her. Georgia asks where he is and goes out to find him, Olivia tries to go with her but is shoved to the floor by her sister and told to stay. Olivia starts to cry and Amos comforts her, resulting in the two sleeping together. Georgia returns covered in blood.\nAmos repairs Clem's prosthetic while Ricca and Olivia repair the broken generator. After fixing the generator, Olivia reveals to Clementine that her and Amos are leaving once they're done building the houses and that they plan to go to Amos' town where it's safe. She begs Clementine not to tell her sister, Clem promises she won't just as Georgia bursts in asking where Amos is, saying that the snowmobile and repaired generator are gone. Clem says he's trying to save their \"screwed-up camp\". Ricca sets off to find Amos, and Clementine who becomes worried about the pair decides to look for them as well. The pair find Clementine and tell her Amos fixed the ski lift but crashed the snowmobile, while they walk back to camp the see how real it now looks with the new structures they've built. The twins join them and Georgia decides they should all go hunting. While out, Georgia pushes Amos into a chasm, killing him. She then pulls a gun out and shoots at Clementine and Ricca while her sister tries to stop her. Clementine and Ricca run through the trees to hide and decide to rescue Olivia before getting off the mountain. Clem comes up with a plan and they wait until sundown to put it into action. Georgia heads back to the cabin and ties her sister up while she waits for Clem and Ricca. Clem cracks the ice and a walker comes out, while she and Ricca hide. Olivia thinks the walker is one of the girls and shoots it before getting struck in the shoulder with Clem's hatchet while Ricca unties Olivia but is shot in the process.\nAn avalanche comes down the mountain and traps the girls in the cabin. Georgia is trapped beneath snow and begs at her sister to help her, telling her she had to kill Amos because he was going to take Olivia away from her. She is then bitten by a walker. Clementine breaks a hole in the roof so they can escape and kills the walker but leaves Georgia to turn. The three girls leave to find Amos' hat before descending the mountain. They get the bullet out of Ricca who recovers and Clementine finds a one eyed kitten whom Olivia names Dr. Barnwell. They walk for 2 weeks to Olivia's mother's house so they can steal her plane and escape. Once they are airborne, Clementine asks Olivia to fly back north to Vermont to show Amos the plane one more time.\nClementine: Book Two\nClementine and her group continues their journey on foot after their plane crash in Cape Breton Island. Clementine, who had laying around a house roof with Ricca, Olivia and Dr. Barnwell insist to continue to hit the coast. The next morning, The group spot a rabbit, which Ricca give a chase, only to it have taken by the herd of walkers, forcing Clementine and her group escape and cover themselves in walker guts. As they continued their journey, they encounter two French-speaking men who grab Olivia as a hostage, but they manage to rescue her and escape.\nThe group continues through the wood the next days as they evade the group. Clementine then begin develop a fever and begin to black out. While Ricca and Olivia carry her, The two spot a boat and Olivia goes into the water to call out for help. Clementine, who still unconscious started to swept away by the tide before starts going under until she soon gets pulled by someone.\nClementine eventually soon wake up and was greeted by Olivia, who told her that they had been saved by Emi, while also reveals that she had been unconscious for one month and her legs got infected as well. Olivia takes Clementine in a wheelchair and it was reveals that they are taken to the Magdalen Islands, a remote island community led by Anne Morro, an enigmatic doctor. They soon reunited with Ricca where she attended a birthday party. There, Ricca introduces Clementine to  the residents of the island, including Emi, John, Amir, Shu-Fen, Ginette, Giles, and Mercy. Clementine was asks by Amir to be on his team for the football game, but Emi insists that she instead be referee.\nLater that night, Clementine drink a \"tupsi\", a fluffy kind of bark from Ricca. Ricca talks to Clementine more about her eyes as she explains that the island their on is connected to four other island. Still worried about the dangers, Ricca assures Clementine they are safe and told her that they all have chores to do around the island to help it stay alive. As everyone asleep, Clementine wheelchairs outside where she encounters Morro, who compliments her for pulling through. Morro tells Clementine she used to be a pathologist and how she made her infection go away. Asking if she plans to stay with them, Clementine responds that she doesn't know, which Morro allowed her to decides.\nA few weeks later, Amir comes to tell Clementine's group that the sea has caved with walkers on shore. Clementine grab her hatchet and goes to retrieve a sock from Ginette and help fight off the walkers before at that moment, Ricca unable to see, which Clementine dismissed it for her safety. When they successfully clear off the walkers, John drag one of the bodies and bring it to Morro. Clementine later join Olivia and Emi on fishing who later ask Emi of where Morro works. John complains about how they worked on the sea wall for months, which Clementine tells the \"walls don't last forever\". Clementine goes to see Ricca and give her and ask her to meet at the docks at sunset.\nWhile writing her name for her next chore, Amir comes out in nothing but a towel to ask Clementine about her how she lost her leg. He reveals he lost his arm after his dad cut it thinking it was a walker bite when it was really only a dog bite, but hoping that their stumps will someday grow. Before Amir leaves, he says that Fen is wrong and that Clementine is super nice. Clementine goes to see Fen where the latter tells her that it doesn't matter since they're leaving on Clementine's call. Fen reveals to Clementine that she and her family were originally on vacation from their home in Victoria and that her sister is still in Taiwan and she plans to find her. Clementine and Fen look at the latter's map to see how far Taiwan is, with Fen suggests they stick around since the place isn't so bad.\nLater that night, Clementine meet with Ricca at the docks and the two take note of each other's appearances. Emi rows the boat towards them to show them where Morro works. After talking to Morro about she examine the body, Clementine, Ricca, and Emi leave and run into John. Ricca stares out into the graveyard, who feel scares about everything falling over, though Clementine apologizes for making her wait.\nLater in the diner, Clementine along with the island member were waiting for John and Olivia just as Emi arrives to tell about the boat, and that Emi and Olivia was not at the site. Clementine, Ricca, John and Fen volunteers to look for the duo. Reaching the lighthouse, Clementine finds Emi reading and a scared Olivia, who thinks she was bitten but finds out that she is pregnant, prompting Clementine to calm her down.\nBack at the logs, Clementine reveals Olivia's pregnancy to Ricca and decided to keep the child safe first rather than do some of her stuff. As Clementine make a plan while talking to Morro, Morro tells her that they have to harvest grain, cure fish as well as store wood while summer still around. Admit that she is traumatized like Clementine did, Clementine left Morro and start making the plan with John and Fen.\nThe next days, as the three start plotting about their plan, Morro advise Clementine about not to be careful. At a bonfire, Clementine learns from Olivia that her first memory in life is crying with her and her sister while Clementine reveals that she had a memory napping on her dad's stomach. While Olivia reveals that Morro already learns of her pregnancy, she ask Clementine to talk to Ricca.\nClementine later visit Ricca to ask her about her project rather than to have her think anything important than her. Ricca soon confesses her love to Clementine, but Clementine says she isn't making her feel loved and instead making her feel she wants to protect her. As Ricca storms off, Clementine yells to Ricca that she will wait for her, though Ricca tells her she's done despite Clementine begging to her. While sit on the shore, Clementine is approach by Giles who offers her tea before recognizing Clementine saddened and allows her to cry.\nAs Clementine, John and Fen lures a walkers into the tunnel and killing them, she helps John load the bodies and bring it to Morro. Morro enrage at John for not getting the chores done and yanks his hair, but Clementine stands up to him although Morro ask her about the idea. As they left, Morro apologies to Clementine after learning her break up with Ricca.\nWhile having a dream about Amos on how he get close and made a relationship with Olivia, Clementine was found by Ricca and Olivia where the latter allows them to stay in her hideout where she begin a project named makeshift synagogue. While hoping to have a bat mitzvah, both girls also have it together and Clementine confesses to Ricca that she love her and apologies for not saying it. As the girls share a hug, Olivia beginning to question if Clementine and Ricca are girlfriends.\nLater in the middle of the night, the girls discover a walkers heading into the distance, which Clementine dispatches quickly. Soon, more walkers appears and they beginning to realize that the walkers came from the backlogs. As they prepare to escape the island, Ricca goes off to get the boat while Clementine and Olivia goes to save the others.\nAs Clementine and Olivia saw numerous walkers surrounding the house, they notice it has bite someone, including Ginette, Giles and Mercy. Once they make it back to the door which is opened by Emi, they see the devoured John, who is revealed to have made big hole to kill the remaining walkers before it overwhelmed him. Morro, not wanting to leave John, stays behind as the walkers approach and devours her.\nAmir, begging not to leave John behind runs back into the house where he encounters the now zombified John, which devours him in the process. As the remaining survivors make their way to the docks, the group notice Ricca isn't there but Clementine assures she will be there and would not leave without her. When Olivia suddenly trip and about to get devoured, Emi sacrifice herself to allow her to escaped. Ricca, revealed to be covered in guts and wearing Amos hat reach the boat and shares a hug with Clementine as the boat left the island.\nThree weeks later, Clementine, Ricca and Olivia along with the remaining survivors arrive at Prince Edward Island in search of Saa. As Clementine and Fen reminiscing of the lost, they find a woman who direct them to find Saa, where they eventually met her there with Derrick at the docks. Saa allows them boards the boat to Greenland and reveals that she comes from Iqaluit and shows the map of their location. Saa reveals that she is planning to go to Greenland, believing it would be safe since her friend Kim is there years previously. Upon hearing that Derrick and Saa crew went missing, Clementine volunteers herself and her group to be Saa's crew, despite Saa decline.\nThe next morning, Clementine tells her group about the plan while she and Ricca and Olivia took a picture of them together. Upon boarding the boat, Clementine share her first kiss to Ricca.\nLater that night, Clementine and Ricca are having sex and talking about their wounds. Clementine shares her story about the first time she shot a gun and how she feels alone. As Clementine asks Ricca about how to stop time, Ricca assures her that she will have a word with the sun. The next morning, as everyone is still asleep (except Saa who has woken up), Clementine looks at the beaming sunlight as she begins to shed tears.\nClementine: Book Three\nSometimes after arriving in Greenland, Clementine and her group help a traumatized Olivia, who is about to gave birth her baby. Despite she has loss a lot of blood, the midwife left to deliver another baby. The next morning, Clementine and Ricca go out into the town, talking to the other residents. During their time, Clementine has gotten a new prosthetic that she's still thinking of a name for. While washing their clothes of blood, Clementine points out how everyone on perimeter control is a girl.\nTwo weeks later, while Ricca and Derrick are trying to take care of the new baby, Clementine helps Saa with the dinner and tells her she doesn't want to leave, believing she can have a new life alongside Ricca like her old neighbors. Saa later that night woke her up to watch the baby, as Fen comes in. When Clementine asks her if she still think about going to Taiwan, Fen responds that she doesn't think about future but instead just the past.\nThe next morning, Ujammi, one of the councilmembers of the resident comes by to assign everyone roles within the community. while Clementine is good at hunting the dead, Ujammi says that's the Gardener's territory before reminds them of the rules and tells Clementine, Ricca, and Fen that they had to start school next week.\nSix days later, while everyone is busy taken care Olivia's baby, Saa instructs Clementine, Ricca, and Fen to go around town to find something to help Olivia's fever.\nAs the three goes around town, Fen breaks off, leaving Clementine and Ricca to search alone as Ricca reassures her that Olivia is going to be okay and kisses her to help her relax.\nClementine wanders around and stares into the town when she comes up a woman named Maria, wondering how many people will die during the winter. Clementine asks her if she knows where to find something for a fever, but Maria determines her that someone who can take care of herself. Clementine leaves to find Ricca, who was getting a history lesson of Nuuk.\nLater that night, Clementine is comforting Olivia, who is still in fever and feared she might die. Despite Clementine and Ricca offer to stay, Saa tells them they're going to school tomorrow. Fen comes in with a bottle of Tylenol given to her by Maria. As Fen fears she can't watch anyone else die, Clementine reassures her that Olivia will be joining them in school. As everyone is sleeping, Clementine reminisces about her school to Ricca.\nThe next day, Clementine, Ricca, and Fen arrive at school, as Ujammi pulls Clementine inside, mentioning that she's also the principal. The three go to their first class and Clementine is having a hard time understanding anything because of the language barrier. As Clementine and Ricca finishes their day at school, Ricca suddenly gets a headache and soon collapses. A Nuuk citizen runs over and checks her pulse and found she had none and therefore, Ricca is pronounce to have died. Clementine is held back as she watch devastated as Ricca being shot by the Nuuk citizen to prevent her from being reanimated.\nAs the group discussing the funeral plan for Ricca, Clementine refuse to partake as she has not yet being able to fully process on Ricca's death. While she goes outside the walls and kill walkers, Members of the patrol crew find her and tell her she doesn't have permission to be out of the walls and that this is her last warning before the Gardener hears of it. As Clementine goes back inside her house and asks Olivia what to do, Olivia can only shed a tears, causing Clementine to break down into tears as well.\nReception\nThe character has been acclaimed by both critics and fans. Many journalists consider Clementine to be an emotional centerpoint of The Walking Dead game, an accomplishment that few other video game characters have made. Game Informers Kimberley Wallace describes the character of Clementine as having \"broken through the barrier [of the television screen], securing a place in the hearts of many\". IGN's Colin Campbell said in his article that Clementine is designed to elicit \"super-protective instincts\" in the player. \"Without Clementine, Lee is just some dude trying to stay alive, but she (a slightly over-cooked innocent) allows him to be sympathetic to us.\" commented Campbell. N.D. Mackay, writing in The Herald, described the relationship with Clementine as \"the heart-breaking bedrock of the game.\" Kotaku's Kirk Hamilton writes that Clementine is a well-done, real-feeling character in the game. \"...[she] is pretty great. She's cute and funny, smarter than she lets on, yet she still acts like a kid. She's one of the most realistically drawn kids I've encountered in a video game in some time.\" says Hamilton. GamesRadar's Hollander Cooper and Sterling McGarvey wrote that the hopelessness of the world would be infectious if not for her constant optimism, giving you something to fight for. \"She's slow to adapt to the fact that good and evil are now meaningless, and her innocence keeps the concept of hope alive in the survivors...\" they stated. The Sunday Herald states that \"Clementine is the real emotional heart of this game\". Polygon included her and Lee as one of the 70 best video game characters of the 2010s with the publication's Colin Campbell writing, \"Lee is an escaped convict in the midst of a zombie outbreak who finds himself caring for a frightened, vulnerable girl called Clementine. Later seasons show Clementine's debt to Lee, and the lessons she learned from her redoubtable mentor. These are characters who are genuinely loved by their many fans.\" Samuel James Riley of GamesRadar listed Clementine along with Lee as the best video game duos, and further stated that the character's story is touching and ultimately has tragic friendships in gaming history. Kevin Wong of Complex included her to his \"best supporting character in video games\", and stated that \"It's hard to think of a video game character that's made more grown men cry than Clementine.\"\nDuring the game's episodic release, players frequently used the Twitter hashtag \"#forclementine\" to reflect how much the character had influenced them. Vanaman was surprised but pleased with this response, stating that \"the fact that people care about Clementine is invaluable\".\nMelissa Hutchison as Clementine was nominated for and won the award for \"Best Performance By a Human Female\" at the 2012 Spike TV Video Game Awards. Hutchison's performance has also been nominated in the \"Performance\" category for the 2013 British Academy Video Games Awards.\nReferences\nNotes"
    }
  ]
}