{
  "content": [
    {
      "type": "text",
      "text": "# Clement Warner\n\n|birth_place      = Batavia, New York\n|death_date       =\n|death_place      = Windsor, Wisconsin\n|death_cause      = Kidney failure\n|restingplace     = Windsor Congregational Cemetery,\n|spouse           =\n|children         =\n| Edith Marie (Dodge)\n|\n| Bessie Irene (Haswell)\n|\n| Arthur Warner\n|\n| Fanny Warner\n|\n| Florence Maurine (Thompson)\n|\n| Julius Herbert Warner\n|\n}}\n|alma_mater       =\n|profession       =\n|relatives        = Fred Risser (grandson-in-law)Fred A. Risser (great-grandson)\n|allegiance       =\n|branch           = Union Army\n|serviceyears     = 1864&ndash;1865\n|rank             =  Colonel, USV\n|commands         = 36th Reg. Wis. Vol. Infantry\n|battles          = American Civil War\n* Overland Campaign\n** Battle of Spotsylvania Court House\n** Battle of North Anna\n** Battle of Totopotomoy Creek\n** Battle of Cold Harbor\n* Siege of Petersburg\n** Second Battle of Petersburg\n** Battle of Jerusalem Plank Road\n** First Battle of Deep Bottom\n** Second Battle of Deep Bottom (WIA)\n** Battle of Hatcher's Run\n* Appomattox campaign\n** Battle of Lewis's Farm\n** Third Battle of Petersburg\n** Battle of High Bridge\n** Battle of Cumberland Church\n** Battle of Appomattox Court House\n}}\nClement Edson Warner (February 23, 1836May 20, 1916) was an American farmer, Republican politician, and Union Army officer in the American Civil War.  He served with the 36th Wisconsin Infantry Regiment and commanded the regiment near the end of the war.  He later served in the Wisconsin State Senate (1867&ndash;1869) and the Assembly (1883&ndash;1885), representing Dane County.  In historical documents, his name is frequently abbreviated as C. E. Warner.\nEarly life and education\nWarner was born in Batavia, New York, on February 23, 1836.  In 1852, he came west with his parents, settling near the town of Windsor, in Dane County, Wisconsin.  He was educated in public schools in New York, and then at the Sun Prairie Seminary.  He enrolled at the University of Wisconsin in 1857 and taught school for a number of years, but he enjoyed farming and chose to make that his primary occupation.\nCivil War service\nThough he was officially drafted early in the American Civil War, Warner later commented that his affairs were not sufficiently arranged to serve at that time, and provided a substitute.    In 1864, he determined that he had made sufficient preparations and accepted a commission from Governor James T. Lewis to assist in raising men for the new 36th Wisconsin Infantry Regiment.  Warner recruited a company of volunteers and was appointed captain of Company B, 36th Wisconsin Infantry, under the command of Colonel Frank A. Haskell&mdash;a veteran of Gettysburg.  They mustered into service on March 23, 1864, and were ordered to proceed to Washington, D.C., for operations in the eastern theater of the war.\nOverland campaign (Summer 1864)\nThey arrived in the midst of General Ulysses S. Grant's Overland Campaign and were directed to proceed to join the Army of the Potomac at Spotsylvania County, Virginia.  They arrived on May 18, one of the last days of the Battle of Spotsylvania Court House, and, on May 19, were attached to the 1st Brigade, 2nd Division, II Corps.  The next day, they marched with II Corps for the North Anna River, arriving on the night of May 23.  They participated in skirmishing in the Battle of North Anna, then accompanied II Corps across the Pamunkey River to take position at the Battle of Totopotomoy Creek, where they received fire, but did not engage in fighting.\nOn June 1, a severe engagement began on the far left of the Union line, in the initial fighting of the Battle of Cold Harbor.  It was noted that Confederate forces on the Union right were beginning to withdraw from their positions to proceed south to reinforce their comrades and concentrate their forces.  Warner's brigade, located near the right end of the Union line, was directed to make a demonstration against the enemy in an attempt to compel them to remain in position.  Captain Warner was placed in command of the skirmishers, leading companies B, E, G, and F from the 36th Wisconsin to advance against the enemy position under fire.  Warner's skirmishers achieved their objective, driving back Confederate skirmishers and occupying part of the Confederate line, but suffered severe casualties&mdash;nearly half the men were killed, wounded, or taken prisoner.\nThat night, the 36th Wisconsin accompanied the movement of II Corps to the southeast to join the massing of forces for an attack on the Confederate right.  On the morning of June 3, they joined the massive frontal assault on the entrenched Confederate position. The 36th Wisconsin sustained heavy casualties, and Colonel Haskell was killed. As a result of Haskell's death, the two other field officers, Major Harvey M. Brown and Lt. Colonel John A. Savage, were promoted, and Captain Warner was selected as the third field officer, receiving the rank of major.\nSiege of Petersburg (Summer&ndash;Winter 1864)\nAfter several days entrenched around Cold Harbor, II Corps was ordered to move again, this time across the James River, advancing to Petersburg.  They, again, found Confederate forces entrenched around the city and took position against them, beginning the Second Battle of Petersburg.  On June 18, the 36th Wisconsin joined an assault on the Confederate defenses, driving them out of their first line of entrenchments and pursuing them to their main line.  The 36th Wisconsin again came under heavy fire at the second line of trenches&mdash;Colonel Savage was killed and Lt. Colonel Brown was wounded.  The attack stalled, command of the regiment devolved to Major Warner, and both sides began to retrench for what became the Siege of Petersburg.\nOn June 21, the 36th Wisconsin, with its brigade, moved left, extending the Union line and attempting to cut off the Petersburg Railroad, one of three remaining Confederate supply lines for the Petersburg defenders.  The brigade was flanked during the fighting and about half their men were captured; the 36th Wisconsin managed to avoid capture, but took casualties in the fighting.  On June 24, they were relieved from the front and went into camp until July 25.  Lt. Colonel Brown was unable to return to duty but was nevertheless commissioned colonel; Major Warner was promoted to lieutenant colonel, and had effective command of the regiment for the next several months.  In just 37 days from their arrival at Spotsylvania County, the regiment had suffered over 200 wounded and 100 dead, including two colonels.\nIn July, Grant had ordered an operation to dig a sapper tunnel under the Confederate defenses.  The 36th Wisconsin, with II Corps, was ordered to make a feint towards Richmond, Virginia, to force General Lee to dilute the defense of Petersburg before the detonation of the mine.  Lee responded by sending 16,500 men to reinforce Richmond.  The First Battle of Deep Bottom, which started on July 27, had the desired effect as Lee sent more forces north to reinforce Richmond.  On the night of July 29, the Union force quietly abandoned their feint and forced a march back toward Petersburg, arriving in time to witness the failure of the attack in the Battle of the Crater.\nTwo weeks later, another such feint was ordered for II Corps.  They returned to Deep Bottom on August 13 and formed line of battle the next day, engaging the enemy that afternoon in the Second Battle of Deep Bottom.  During the battle, their brigade was ordered to charge the enemy defenses.  Under heavy fire, Lt. Colonel Warner was shot and had to leave the field, leaving the regiment under the command of Captain Austin Cannon.\nWarner's arm had been shattered by the bullet and had to be amputated.  He spent most of the rest of 1864 recuperating.  He nominally became the commander of the 36th Wisconsin on October 27, when Colonel Brown resigned his commission due to his injuries, but Captain Cannon and then Captain George A. Fisk remained in operational command of the regiment until Warner was able to return to duty in December.  The regiment remained camped near Petersburg until February 5, when they marched with II Corps to the vicinity of Hatcher's Run; they received shelling but were not actively engaged in the Battle of Hatcher's Run.  They remained camped at Hatcher's Run until March 25, and during this time Warner received his official promotion to colonel.\nAppomattox campaign (1865)\nGrant's orders for the final attack on Petersburg arrived on March 25; in accordance with the orders, on March 29, II Corps began to advance west of Petersburg, forcing the Confederates to further extend their flank. They did not participate in the Battle of Lewis's Farm, but in the aftermath managed to occupy Confederate trenches approaching Petersburg.  They received shelling over the next several days, but continued to advance and take prisoners.  On April 2, they learned the Confederates had abandoned Petersburg.\nThe 36th Wisconsin, with II Corps, joined the pursuit of Lee's army, skirmishing with Lee's rear guard On April 7 at the Battle of High Bridge, and then again that night at the Battle of Cumberland Church.  II Corps' dogged pursuit of Lee slowed him enough to allow V Corps to reach Appomattox Court House ahead of the Confederate army.  The decisive Battle of Appomattox Court House occurred on April 9, 1865, and Colonel Warner had the honor of being present at the surrender of the Army of Northern Virginia.\nFollowing the surrender, they returned to Washington on June 14, and participated in the Grand Review of the Armies on June 17.  They were mustered out of service on July 12, 1865, and arrived back in Madison, Wisconsin, two days later, where the men were disbanded.\nPublic office\nAfter the war, Warner returned to his farm and became involved in politics.  In 1866, he was elected to the Wisconsin State Senate on the National Union Party ticket.  During the session, however, Warner withdrew his support from the party, along with most other Republicans who no longer supported President Andrew Johnson.  In the 1867 session of the Senate, he served on the committees on military affairs, on education and university lands, and on public lands. He also served on the committees on roads, bridges, and ferries, on railroads, and on benevolent institutions during the 1868 session.  He did not run for a second two-year term in 1868.\nHe made another run for office in 1873 in Dane County's 2nd Assembly district, which then comprised the towns of Blooming Grove, Burke, Dunn and Windsor, and the city of Madison, but was defeated by the Reform Party candidate, Philo Dunning.  1873 was the high-water mark of the political power of the Reform Party, a short-lived coalition of Democrats, reform and Liberal Republicans, and Grangers.\nWarner remained active in the Republican Party of Wisconsin and was a political ally of Madison power-broker Elisha W. Keyes.  With his support, in 1877, Warner was elected Superintendent of the Poor by the Dane County Board of Supervisors for a three year term.\nFollowing the 1881 redistricting, Warner made another run for Wisconsin State Assembly in the redrawn Dane County 2nd Assembly district, which now comprised the towns of Bristol, Burke, Cottage Grove, Deerfield, Medina, Sun Prairie, Vienna, Windsor and York.  He was narrowly elected, defeating Democrat A. L. Durfey by just 35 votes.  In the Assembly, he was assigned to the joint committee on charitable and penal institutions.  He did not run for reelection in 1884.\nLater life\nAfter leaving the Legislature, he remained active in local affairs as a trustee of the county insane asylum, jury commissioner of Dane County, member of the soldiers' relief commission, and trustee of Milwaukee-Downer College.  He was one of the leading organizers in the establishment of a public high school at Windsor.\nWarner suffered Kidney failure and died on May 20, 1916, at his home in Windsor.\nFamily\nClement Warner was an 8th generation descendant of Andrew Warner, an early settler at the Massachusetts Bay Colony who came to the country as an indentured servant and earned his freedom in 1634.  Clement was the eldest of three children born to Samuel A. Warner and his wife Martha Warner (née Simonds).\nIn 1867, during Warner's term in the State Senate, he married Eliza Noble, of Beloit, Wisconsin.  Together, they had seven children, though one died in infancy.  Eliza and Clement Warner both died in the spring of 1916, at their home in Windsor, Wisconsin.\nThe eldest son of Clement Warner was Ernest Noble Warner, who also went on to serve in the Wisconsin State Assembly in 1905.  Ernest Warner's daughter, Elizabeth, married Fred Risser, who also served in the Wisconsin Legislature.  Elizabeth's son, Clement Warner's great-grandson, was Fred A. Risser, the longest-serving member in the history of the Wisconsin Legislature, who represented Dane County in the Wisconsin Senate from 1962 until 2021.\nFurther reading\n* Warner, Clement Edson; Elizabeth Marshall Warner, Judith Mayer Risser, eds. The letters of Colonel Clement Edson Warner, while serving in the Thirty-Sixth Wisconsin Volunteer Infantry Regiment during the American Civil War, 1864–1865: with quotations from the military history of Wisconsin, by E.B. Quiner, 1866: family history, other letters, and memorabilia relating to colonel Warner and family. Milwaukee, 2004.\n*\nReferences\nExternal links\n*\nJuly 14, 1865}}\n|-\n|years= January 1, 1883January 5, 1885 }}\n|years= January 7, 1867January 4, 1869 }}"
    }
  ]
}