{
  "content": [
    {
      "type": "text",
      "text": "# Clemant, Queensland\n\n| pop                 = 0\n| pop_year            =\n| pop_footnotes       =\n| established         =\n| postcode            = 4816\n| area                = 114.6\n| timezone            = AEST\n| utc                 = +10:00\n| dist1               = 29.2\n| dir1                = NW\n| location1           = Deeragun\n| dist2               = 44.2\n| dir2                = NW\n| location2           = Townsville CBD\n| dist3               = 1397\n| dir3                = NNW\n| location3           = Brisbane\n| dist4               =\n| dir4                =\n| location4           =\n| lga                 = City of Townsville\n| stategov            = Hinchinbrook\n| fedgov              = Kennedy\n| near-n              = Balgal BeachCoral Sea\n| near-ne             = ToomullaCoral Sea\n| near-e              = Bluewater\n| near-se             = Bluewater Park\n| near-s              = Lynam\n| near-sw             = Paluma\n| near-w              = Crystal Creek\n| near-nw             = Rollingstone\n}}\nClemant is a rural coastal locality in the City of Townsville, Queensland, Australia. In the , Clemant had \"no people or a very low population\".\nGeography\nThe Coral Sea forms most of the north-eastern boundary, but is interrupted by the locality of Toomulla.\nThe Bruce Highway enters the locality from the south-east (Bluewater) and exits to the north-west (Rollingstone).\nThe North Coast railway line also enters the locality from the south-east (Bluewater) and exits to the north-west (Rollingsone).\nThere are two sections of the Paluma Range National Park in the locality, one section in the north-east and another in the south-west. Between these two sections is the Clemant State Forest and, to the south, part of the Clemant Park pastoral property which is used for grazing on native vegetation.\nHistory\nThe locality was named and bounded on 27 July 1991.\nDemographics\nIn the , Clemant had \"no people or a very low population\".\nIn the , Clemant had \"no people or a very low population\".\nEducation\nThere are no schools in Clemant. The nearest government primary schools are Rollingstone State School in neighbouring Rollingstone to the north-west and Bluewater State School in neighbouring Bluewater to the east. The nearest government secondary school is Northern Beaches State High School in Deeragun in Townsville.\nReferences\nExternal links\n*"
    }
  ]
}