{
  "content": [
    {
      "type": "text",
      "text": "# Clenchwarton\n\n| official_name = Clenchwarton\n| population = 2,223\n| population_ref = (2021)\n| shire_district = King's Lynn and West Norfolk\n| area_total_sq_mi = 4.86\n| london_distance = &nbsp;SW\n| shire_county = Norfolk\n| region = East of England\n| constituency_westminster = North West Norfolk\n| post_town = KING'S LYNN\n| postcode_district = PE34\n| postcode_area = PE\n| dial_code = 01553\n| os_grid_reference = TF588201\n| static_image_name = St Margaret, Clenchwarton, Norfolk - geograph.org.uk - 310362.jpg\n| static_image_width =\n| static_image_caption = St. Margaret's Church\n| static_image_2_caption = Clenchwarton Village Sign\n| static_image_2 = Clenchwarton Village Sign.jpg\n}}\nClenchwarton is a village, civil parish and electoral ward in the English county of Norfolk.\nClenchwarton is located  west of King's Lynn, separated by the River Great Ouse, and  west of Norwich.\nHistory\nClenchwarton's name is of Anglo-Saxon origin and derives from the Old English for a hill dweller's farmstead or settlement.\nIn the Domesday Book of 1086, Clenchwarton is recorded as an abandoned village with no recorded population in the hundred of Freebridge. The village was part of the estates of William d'Ecouis. The abandonment of the village was likely the result of the Norman reprisals in retaliation for the Ely Rebellion of 1070, led by Hereward the Wake.\nThe village was also surveyed by the Victorian traveller, John Marius, in the 1870s. He wrote the following about the village in the Imperial Gazetteer: \"church is old but good. There are a N.Methodist chapel, and a national school.\"\nDuring the Second World War, anti-tank defences were built in Clenchwarton to defend against a possible German invasion of East Anglia.\nGeography\nAccording to the 2021 census, the population of Clenchwarton is 2,223 people which shows an increase from the 2,171 people listed in the 2011 census.\nThe parish is bordered to the east by the River Great Ouse and to the south by the A17, between Newark-on-Trent and King's Lynn.\nSt. Margaret's Church\nClenchwarton's parish church is dedicated to Saint Margaret of Scotland and is located on Church Road. The church dates back to the Fourteenth Century and has been Grade II listed since 1951.\nThe church boasts stained-glass windows installed by Hardman & Co. with one from the 1920s depicting Mary Elizabeth Townsend as well as other windows designed by Charles Gibbs. There is also a memorial to Pte. Clifford J. Gosling of the 1st Bn., Royal Norfolk Regiment who was killed in a forest fire during Operation Lucky Alphonse during the Cyprus Emergency in the late 1950s. Gosling is buried in Wayne's Keep Military Cemetery, Nicosia.\nSt Margaret's Churchyard holds a listed headstone dedicated to Christopher Hudson which dates to 1709, and the remains of a medieval cross.\nClenchwarton is also home to a Methodist Church which still hosts regular services.\nAmenities\nMost local children attend the local Clenchwarton Community Primary School which is part of the West Norfolk Academies Trust. The school was rated 'Good' by Ofsted in 2017.\nThe local convenience store can be located on Main Road, just opposite the Primary School. The shop also has a Post Office inside.\nThe village is home to Clenchwarton Football Club which hosts several youth and adult teams. The first XI compete in the North-West Norfolk Saturday League.\nThe village is also home to a lawn bowls team.\nTransport\nClenchwarton Railway Station opened in 1866 as part of the Lynn and Sutton Bridge Railway and was eventually closed in 1959.\nPublic transport through the village is now provided by bus route 505 between King's Lynn and Spalding. It is part of the Lincolnshire Interconnect network and currently operated by Stagecoach in Lincolnshire.\nGovernance\nClenchwarton is an electoral ward for local elections and is part of the district of King's Lynn and West Norfolk.\nThe village's national constituency is North West Norfolk which has been represented by the Conservative's James Wild MP since 2010.\nWar Memorial\nClenchwarton's main war memorial is a marble plaque located inside St. Margaret's Church with a further memorial to the fallen on the Peace Cottages on Church Road. The memorial lists the following names for the First World War:\n{| class=\"wikitable\"\n|+\n!Rank\n!Name\n!Unit\n!Date of death\n!Burial\n|-\n|LCpl.\n|Arthur W. Benton\n|9th Bn., Duke of Wellington's Regt.\n|31 Oct. 1918\n|Awoingt Cemetery\n|-\n|LCpl.\n|Charles A. Maycraft\n|1st Bn., Norfolk Regiment\n|5 Sep. 1916\n|Dive Copse Cemetery\n|-\n|Dvr.\n|Herbert E. Chamberlain\n|Army Service Corps\n|4 May 1915\n|Menin Gate\n|-\n|Dvr.\n|Alfred H. Collison\n|83rd Bde., Royal Horse Artillery\n|7 Oct. 1917\n|Vlamertinge Cemetery\n|-\n|Gnr.\n|William E. Killingsworth\n|177th Bde., Royal Field Artillery\n|6 Jul. 1917\n|Brandhoek Cemetery\n|-\n|Pte.\n|Henry W. Peake\n|6th Bn., Border Regiment\n|29 Sep. 1916\n|Contay British Cemetery\n|-\n|Pte.\n|Samuel G. Vincent\n|6th Bn., The Buffs\n|10 Apr. 1917\n|Duisans Cemetery\n|-\n|Pte.\n|Alfred Beaumont\n|2nd Bn., Essex Regiment\n|12 Apr. 1917\n|Athies Cemetery\n|-\n|Pte.\n|Ralph Coates\n|1st (City) Bn., London Regiment\n|24 Aug. 1918\n|Summit Trench Cem.\n|-\n|Pte.\n|Alfred Cyril Meek\n|2/6th Bn., Manchester Regiment\n|1 May 1918\n|Cologne Southern Cem.\n|-\n|Pte.\n|George E. Maycraft\n|1/5th Bn., Norfolk Regiment\n|19 Apr. 1917\n|Gaza War Cemetery\n|-\n|Pte.\n|Walter Sydney Meek\n|7th Bn., Norfolk Regt.\n|28 Oct. 1915\n|Haisnes Cemetery\n|-\n|Pte.\n|Sydney E. Killingsworth\n|2nd Bn., Northamptonshire Regt.\n|27 May 1918\n|Soissons Memorial\n|-\n|Pte.\n|William H. Haynes\n|11th Bn., Suffolk Regiment\n|9 Apr. 1918\n|Le Grand Beaumart Cem.\n|-\n|Sig.\n|Joseph Howard\n|7th Bn., Norfolk Regiment\n|28 Mar. 1918\n|Doullens Cemetery\n|-\n|Spr.\n|Harry Coates\n|287th Coy., Royal Engineers\n|10 Jan. 1919\n|Mikra British Cemetery\n|-\n|St.\n|Harry Coy\n|HMS Vanguard\n|9 Jul. 1917\n|Chatham Naval Memorial\n|}\nAnd, the following for the Second World War:\n{| class=\"wikitable\"\n|+\n!Rank\n!Name\n!Unit\n!Date of death\n!Burial\n|-\n|Sgt.\n|Russell E. Fuller\n|No. 77 Squadron RAF\n|24 Aug. 1943\n|Berlin War Cemetery\n|-\n|LAC\n|Ernest G. Usher\n|Royal Air Force Volunteer Reserve\n|16 May 1946\n|St. Margaret's Churchyard\n|-\n|Gnr.\n|Ernest F. W. Wake\n|2 Regt., Royal Horse Artillery\n|3 Jul. 1942\n|Alamein Memorial\n|-\n|Pte.\n|Arthur G. Gompertz\n|Royal Army Service Corps\n|17 Jun. 1940\n|Dolus-d'Oléron Cemetery\n|-\n|Pte.\n|Cecil V. Hare\n|30th Bn., Royal Norfolk Regiment\n|25 Sep. 1942\n|St. Margaret's Churchyard\n|}\nReferences\nExternal links"
    }
  ]
}