{
  "content": [
    {
      "type": "text",
      "text": "# Clive King\n\n| birth_place    = Richmond, Surrey, England\n| death_date    =\n| death_place   = Thurlton, Norfolk, England\n| nationality   = British\n| education     = King's School, Rochester\n| alma_mater    = Downing College, Cambridge (BA, 1943) School of Oriental and African Studies\n| genre         = Children's literature, historical fiction\n| subject       =\n| movement      =\n| notableworks  = Stig of the Dump (1963)\n| portaldisp    =\n}}\nDavid Clive King (28 April 1924 – 10 July 2018) was an English author best known for his children's book Stig of the Dump (1963). He served in the Royal Navy Volunteer Reserve in the last years of the Second World War and then worked for the British Council in a wide range of overseas postings from which he later drew inspiration for some of his novels.\nLife and career\nClive King was born in Richmond, then in Surrey, on 28 April 1924 and grew up in Ash in Kent. He was educated at the King's School, Rochester from 1933 to 1941 and then at Downing College, Cambridge, from 1941 to 1943, graduating with a BA in English. From 1943 to 1946 he served as a sub-lieutenant in the Royal Navy Volunteer Reserve, which took him to the Arctic, India, Ceylon (now Sri Lanka (where he tried to learn Tamil but didn′t get very far), Australia, Malaya (now Malaysia) and Japan, where he saw the then-recent devastation of Hiroshima.\nAfter leaving the Reserve, King began working for the British Council and was posted to Amsterdam as an administrative officer (1948–50). Subsequent postings for the British Council included Belfast, as a staff welfare officer (1950–51); Aleppo, as a lecturer (1951–54); Damascus, as a visiting professor at the university (1954–55); Beirut, as lecturer and director of studies (1960–66); and Madras, as an education officer (1971–73). He also served as a warden for East Sussex County Council from 1955 to 1960. He attended the School of Oriental and African Studies in London from 1966 to 1967, then served as an education adviser for the East Pakistan Education Centre in Dhaka from 1967 to 1971.\nClive King started writing when he was a child. He once stated that his first story was a script for a Western film. He had articles published in both his school and college magazines before his first book,  Hamid of Aleppo, was published by Macmillan & Co. of New York in 1958. He wrote The Town that Went South (1959), Stig of the Dump (1963) and The 22 Letters (1966) before deciding to become a full-time writer in 1973. He went on to write another 20 novels between 1972 and 2008, but he is probably best known for Stig of the Dump, which has twice been adapted for television and continues to be taught in British schools.\nAs a popular children's author King was invited to summer camps for members of the Puffin Book Club Holidays (predecessor to ATE Superweeks), along with other authors such as Ian Serraillier and Joan Aiken.\nKing was married twice, had three children and lived in Thurlton, Norfolk.\nInfluence\nClive King acknowledged the influence of his itinerant career on his writing: \"Each of the things which I have written has been inspired by a particular place which I have visited or lived in. The settings are always as authentic as possible and they determine the action.\" This influence is noticeable in the settings of The Night The Water Came (relief operations on a tropical island), Snakes and Snakes (India) and The 22 Letters (the Middle East).\nHamid of Aleppo\nHamid of Aleppo (1958), illustrated by Giovannetti, follows the adventures of a Syrian Golden Hamster. Hamid has no idea what sort of creature he is. The camel tells him he is a desert rat; the tortoise calls him a fat cat without a tail. Hamid is busy digging new tunnels in his home in the side of a hill where he unearths many Things. When Hamid leaves his tunnel home he brings with him many of the Things he has found there. After many travels and encounters with other wayfarers, Hamid digs a tunnel which brings him to the surface in the office of the Director of a Museum, who explains to Hamid that he is a Syrian Golden Hamster and that his Things are relics of antiquity. Hamid the Syrian Golden Hamster donates his Things to the Museum and is rewarded.\nStig of the Dump\nStig of the Dump (1963), illustrated by Edward Ardizzone, follows the adventures of a boy who discovers a Stone-Age cave-dweller living at the bottom of a disused chalk pit in Kent that has been used as an unofficial rubbish dump. The concept does not explicitly involve any of the common fantasy devices such as timeslip or magic. The book has been reprinted many times and has been adapted for television twice.\nThe 22 Letters\nThe 22 Letters (1966), illustrated by Richard Kennedy, was the 250th title published by Puffin Books. Set in the eastern Mediterranean world of the 15th century BC, the story follows the adventures of the three sons of a Phoenician master builder through three loosely linked stories in which they travel to the Sinai Peninsula, to the court of King Minos in Crete and to Ugarit. They return and save their city from invasion with the help of the three inventions they have found: celestial navigation, horsemanship and alphabetic writing. In its time The 22 Letters was considered, at over 300 pages, to be very long for a children's book, although its scholarship and scope were admired.\nBibliography\nFiction\n*Hamid of Aleppo, illustrated by Giovannetti. New York, Macmillan 1958\n*The Town That Went South, illustrated by Maurice Bartlett. New York, Macmillan 1959; London, Penguin 1961\n*Stig of the Dump, illustrated by Edward Ardizzone. London, Penguin 1963 ()\n*The 22 Letters, illustrated by Richard Kennedy. London, Hamish Hamilton 1966; New York, Coward McCann 1967;\n*The Night the Water Came, illustrated by Mark Peppé. London, Longman 1973; New York, Crowell 1979\n*Snakes and Snakes, illustrated by Richard Kennedy. London, Kestrel 1975\n*Me and My Million. London, Kestrel 1976; New York, Crowell 1979\n*The Inner Ring series, illustrated by Jacqueline Atkinson. London, Ernest Benn 1976\n**The Accident\n**First Day Out\n**High Jacks, Low Jacks\n**The Secret\n*''The Devil's Cut, illustrated by Val Biro. London, Hodder & Stoughton 1978\n*Ninny's Boat, illustrated by Ian Newsham. London, Kestrel 1980; New York, Macmillan 1981\n*The Sound of Propellers 1986\n*The Seashore People 1987\n*A Touch of Class 1995\nPlays\n*Poles Apart, produced London, 1975\n*The World of Light, produced London, 1976\n*Good Snakes, Bad Snakes 1977\n*Get the Message, produced London, 1987\nOther\n*The Birds from Africa, illustrated by Diana Groves. London, Macdonald 1980\n*Bells for Christmas, with songs by Robert Pell, Macdonald Educational 1981\nReferences\nExternal links\n* [https://web.archive.org/web/20110716063131/http://www.theweeweb.co.uk/public/author_profile.php?id=670 Clive King biography and bibliography]\n* – lists The 22 Letters'' as \"especially enjoyable\"\n*[https://www.penguin.co.uk/articles/company/news/2018/july/clive-king--author-of-stig-of-the-dump--dies-aged-94.html Penguin Books website obituary]"
    }
  ]
}