{
  "content": [
    {
      "type": "text",
      "text": "# Cloistered Emperor__disambig_1\n\nA  is the term for a Japanese emperor who had abdicated and entered the Buddhist monastic community by receiving the Pravrajya rite. The term can also be shortened to .\nCloistered emperors sometimes acted as Daijō Tennō (retired emperors), therefore maintaining effective power. This title was first assumed by Emperor Shōmu and was later used by many other emperors who \"took the tonsure\", signifying a decision to become a Buddhist monk. The last cloistered emperor was Emperor Reigen (r. 1663-1687) in the Edo period.\nList of retired emperors who became monks\n{| class=\"wikitable\"\n|-\n! Name as Emperor\n! Acceded\n! Abdicated\n! Took Buddhist vows\n! Died\n! Notes\n|-\n| Shōmu\n| 724\n| 749\n| 749\n| 756\n|\n* 749 (Tenpyō 21, 4th month): Shōmu, accompanied by the empress, their children, and all the great men and women of the court, went in procession to Todai-ji.  The emperor stood before the statue of the Buddha and proclaimed himself to be a slave to the three precious precepts of the Buddhist religion, which are the Buddha, the Dharma, and the Sangha.\n* 749 (Tenpyō 21, 7th month): After a 25-year reign, Emperor Shōmu abdicates in favor of his daughter, Princess Takano, who would become Empress Kōken.  After abdication, Shōmu took the tonsure, thus becoming the first retired emperor to become a Buddhist priest.  Empress Komyo, following her husband’s example, also took holy vows in becoming a Buddhist nun.\n* 752 (Tenpyō-shōhō 4, 4th month): The Eye-Opening Ceremony, presided over by Rōben and celebrating the completion of the Great Buddha, is held at Tōdai-ji.\n|-\n| Heizei\n| 806\n| 809\n| 810\n| 824\n|\n* 810 (Kōnin 1): In Heizei's name, the former emperor's ambitious third wife, Fujiwara no Kusuko, and her brother Nakanari organized an attempted rebellion, but their forces were defeated. Kusuko died by poison and her brother was executed. Heizei took the tonsure and became a Buddhist monk.\n|-\n| Seiwa\n| 858\n| 876\n| 878\n| 881\n|\n* 878 (Gangyō 2):  Seiwa became a Buddhist priest.  His new priestly name was Soshin (素真).\n|-\n| Uda\n| 887\n| 897\n| 900\n| 931\n| Uda entered the Buddhist priesthood at age 34 in 900. Having founded the temple at Ninna-ji, Uda made it his new home after his abdication. His Buddhist name was Kongō Kaku.  He was sometimes called \"the Cloistered Emperor of Teiji(亭子の帝),\" because the name of the Buddhist hall where he resided after becoming a priest was called Teijiin.\n|-\n| Daigo\n| 897\n| 930\n| 930\n| 930\n|\n* October 23, 930 (Enchō 8, 29th day of the 9th month): Emperor Daigo entered the Buddhist priesthood in the very early morning hours.  As a monk, he took the Buddhist name Hō-kongō and, shortly thereafter, he died at the age of 46.  This monk was buried in the precincts of Daigo-ji, which is why the former-emperor's posthumous name became Daigo-tennō.\n|-\n| Suzaku\n| 930\n| 946\n| 952\n| 952\n|\n* 952 (Tenryaku 6): Suzaku took ordination as a Buddhist monk at Ninna-ji.\n|-\n| En'yū\n| 969\n| 984\n| 985\n| 991\n|\n* 16 September 985 (Kanna 1, 29th of the 8th month): The former-Emperor En'yū took the tonsure, becoming a Buddhist priest and taking the name of Kongō Hō.\n|-\n| Kazan\n| 984\n| 986\n| 986\n| 1008\n|\n* 986 (Kanna 2, 6th month): Kazan abdicated, and took up residence at Gangō-ji where he became a Buddhist monk; and his new priestly name was Nyūkaku. Nyūkaku went on various pilgrimages and 're-founded' the Kannon pilgrimage. This pilgrimage involved travelling to 33 locations across the eight provinces of the Bando area. He was told to visit these 33 sites, in order to bring release from suffering, by Kannon Bosatsu in a vision. The first site of the pilgrimage was the Sugimoto-dera in Kamakura.\n|-\n| Ichijō\n| 986\n| 1011\n| 1011\n| 1011\n|\n* July 19, 1011 (Kankō 8, 16th day of the 6th month): Emperor Ichijō takes tonsure as a Buddhist monk.\n* July 25, 1011 (Kankō 8, 22nd day of the 6th month): Emperor Ichijō died.\n|-\n| Sanjō\n| 1011\n| 1016\n| 1017\n| 1017\n|\n* May 27, 1017 (Kannin 1, 29th day of the 4th month): Sanjō entered the Buddhist priesthood.\n* June 5, 1017 (Kannin 1, 9th day of the 5th month): The former-Emperor Sanjō died at age 42. He was given the posthumous name of Sanjō-in (三条院) after the palace where he spent his life after abdication.\n|-\n| Go-Suzaku\n| 1036\n| 1045\n| 1045\n| 1045\n|\n* February 7, 1045 (Kantoku 2, 18th day of the 1st month): The former Emperor Go-Suzaku ordained as a Buddhist monk and died the same day at the age of 37.\n|-\n| Go-Sanjō\n| 1068\n| 1073\n| 1073\n| 1073\n|\n* May 11, 1073 (Enkyū 5, 21st day of the 4th month): Go-Sanjō entered the Buddhist priesthood; and his new priestly name became Kongō-gyō.\n* June 15, 1073 (Enkyū 5, 7th day of the 5th month): The former-Emperor Go-Sanjō died at the age of 40.\n|-\n| Shirakawa\n| 1073\n| 1087\n| 1096\n| 1129\n|\n* 1095 (Kahō 2, 8th month): The emperor was stricken with intermittent fevers; and he ordered prayers to be offered for his return to good health.  After Horikawa recovered his health, he was generous and appreciative to the Buddhist priests who had prayed for his recovery.\n* 1095 (Kahō 2, 11th month): The Buddhist priests of Mt. Hiei came down from their mountain to protest a dispute with Minamoto Yoshitsuna and other government officials which had led to military action and bloodshed. The priests carried a portable shrine as far as the central hall of Enryaku-ji, where a curse was laid on daijō-daijin Fujiwara Moromichi.\n* 1096 (Kahō 3, 9th day of the 11th month): Former Emperor Shirakawa entered the Buddhist priesthood at the age of 44 and received the Dharma name Yūkan (融観). On the occasion of his daughter's death, Shirakawa entered a monastery under the name of Yūkan (融観); and thus, he became a hō-ō (法皇), which is the title accorded to a former emperor who has become a monk.\n|-\n| Toba\n| 1107\n| 1123\n| 1141\n| 1156\n|\n* Eiji  1, in the 3rd month (1141): The former emperor Toba accepted the tonsure and became a Buddhist monk at the age of 39 years.\n* Kōji 2, in the 1st month (1143): Cloistered Emperor Toba-in, now known by the title Daijō Hōō, visited his mother.\n|-\n| Go-Shirakawa\n| 1155\n| 1158\n| 1169\n| 1192\n|\n*In 1169 (Kaō 1, 6th month) Emperor Go-Shirakawa entered the Buddhist priesthood at the age of 42. He took the Buddhist name of Gyōshin.\n|-\n| Go-Fukakusa\n| 1246\n| 1259\n| 1290\n| 1304\n|\n|-\n| Kameyama\n| 1259\n| 1274\n| 1289\n| 1305\n|\n*In 1289 Kameyama entered the priesthood, joining the Zen sect.  Because of this, Zen Buddhism slowly penetrated into the Court Nobility. In 1291, he helped establish the Buddhist temple Nanzen-ji in Kyōto.\n|-\n| Go-Uda\n| 1274\n| 1287\n| 1307\n| 1324\n|\n|-\n| Fushimi\n| 1287\n| 1298\n| 1313\n| 1317\n|\n*1313 (Shōwa 2, 10th month): Retired Emperor Fushimi shaved his head and became a Buddhist monk.\n|-\n| Hanazono\n| 1308\n| 1318\n| 1335\n| 1348\n|\n*In 1335, he became a Buddhist monk of the Zen sect, and under his sponsorship, his palace became the temple of Myōshin-ji, now head temple of the largest network of Zen temples in Rinzai Buddhism.\n|-\n| Kōmyō (North)\n| 1336\n| 1348\n| 1355\n| 1380\n|\n* In 1355, returning to Kyōto, he entered a monastery.\n|-\n| Go-Mizunoo\n| 1611\n| 1629\n| 1651\n| 1680\n| Called \"Enjō Dōkaku Hōō\"\n|-\n|-\n| Reigen\n| 1663\n| 1687\n| 1713\n| 1732\n|\n* 1713: Former Emperor Reigen enters a monastery under the name Sojō (素浄).\n|}\nSee also\n*Emperor Daijō\n*Cloistered rule\nNotes\nReferences\n* Ponsonby-Fane, Richard Arthur Brabazon. (1956). [https://books.google.com/books?id=OpOdHQAACAAJ&q=Kyoto:+The+Old+Capital+of+Japan,+794-1869  Kyoto: The Old Capital of Japan, 794-1869.] Kyoto: The Ponsonby Memorial Society. [http://www.worldcat.org/wcpa/oclc/36644 OCLC 36644]\n* _____________. (1963). [https://books.google.com/books?id=IGkrAAAAIAAJ&q=Vicissitudes+of+Shinto  Vicissitudes of Shinto.] Kyoto: Ponsonby Memorial Society. [http://www.worldcat.org/wcpa/oclc/36655 OCLC 36655]\n*"
    }
  ]
}