{
  "content": [
    {
      "type": "text",
      "text": "# Cloncurry, Queensland\n\n| pop                 = 3167\n| pop_year            =\n| pop_footnotes       =\n| established         =\n| postcode            = 4824\n| area                = 8104.4\n| timezone            = AEST\n| utc                 = +10:00\n| dist1               = 121\n| dir1                = E\n| location1           = Mount Isa\n| dist2               = 783\n| dir2                = WSW\n| location2           = Townsville\n| dist3               = 1705\n| dir3                = NW\n| location3           = Brisbane\n| dist4               =\n| dir4                =\n| location4           =\n| lga                      = Shire of Cloncurry\n| county                   = Beaconsfield\n| stategov                 = Traeger\n| fedgov                   = Kennedy\n| elevation                = 186\n| elevation_footnotes      =\n| maxtemp                  = 33.3\n| maxtemp_footnotes        =\n| mintemp                  = 18.9\n| mintemp_footnotes        =\n| rainfall                 = 509.8\n| rainfall_footnotes       =\n| near-n                   = Three Rivers\n| near-ne                  = Taldora\n| near-e                   = Julia Creek\n| near-se                  = McKinlay\n| near-s                   = Kuridala\n| near-sw                  = Duchess\n| near-w                   = Mount Isa (locality)\n| near-nw                  = Three Rivers\n}}\nCloncurry is a rural town and locality in the Shire of Cloncurry, Queensland, Australia. known by locals as The Curry. Cloncurry is the administrative center of the Shire of Cloncurry.\nCloncurry is known as the Friendly Heart of the Great North West and celebrated its 150th anniversary in 2017. Cloncurry was recognised for its liveability, winning the Queensland's Friendliest Town award twice by environmental movement Keep Queensland Beautiful, first in 2013 and again in 2018.\nIn the , the locality of Cloncurry had a population of 3,167 people.\nGeography\nCloncurry is situated in the north-west of Queensland, 770&nbsp;kilometres west of the city of Townsville via the Flinders Highway. The town lies adjacent to the Cloncurry River.The Flinders Highway enters from the east and the Barkly Highway exits to the west. The Landsborough Highway enters from the south-east and the Burke Developmental Road exits to the north.\nThe Cloncurry–Dajarra Road exits to the south from the Barkly Highway.\nCattle grazing is the significant industry in the region, and a large sale yard is located in the town.\nThe town has one of the richest geological layers in the world with copper (and gold) mining being core industries since 1867.\nOpen cut mining has impacted the landscape and the nearby former mine-site Mary Kathleen is a tourist attraction.\nHistory\nThe Aboriginal traditional owners of Cloncurry are the Mitakoodi people (pronounced Mee-tah-koo-dee). In August 2024, the Mitakoodi and Mayi people were formally acknowledged and officially obtained native title determination. The region of Cloncurry is traditionally known as Pimurra and the Mitakoodi people were known as the River people.\nThe first Europeans to traverse these tribal lands of peoples such as the Maithakari and the Wanamara, were Burke and Wills on their epic, and ultimately fatal, transcontinental expedition. The Cloncurry River was named by Burke after Lady Elizabeth Cloncurry, his cousin, with the town eventually taking its name from the river.\nErnest Henry discovered copper in the area in 1867,  and the town sprang up to service the Great Australia Mine to the south. Roger Sheaffe established the first pastoral run in the Cloncurry district - \"Fort Constantine\".  Gold was discovered at Top Camp.\nThe town was surveyed in 1876. Cloncurry was proclaimed a town in 1884.\nCloncurry Provisional School opened on 19 March 1884. In 1894, it became Cloncurry State School.\nThe Cloncurry Advocate was a newspaper published in Cloncurry between 1889 and 1953.\nQueensland's Northern Line railway reached Cloncurry in December 1907 and was officially opened the next year.\nSt Joseph's School opened on 29 October 1909 by the Sisters of St Joseph of the Sacred Heart.\nIn 1914, a fire broke out in the town resulting in the destruction of the Post Office, the hotel, eleven shops, two store-rooms and a cottage. The telegraph office was saved by employees who kept the office damp and protected with wet blankets. One man died in the blaze which cost an estimated £15,000 in damages.\nFrom 1915 to 1931, the Australian Inland Mission (part of the Presbyterian Church) operated its North West Patrol in Cloncurry which provided religious services to people in remote areas by driving through the Outback; the service later operated from Mount Isa. A similar service, the Federal Methodist Inland Mission Patrol commenced  was established in 1928 at its Gulf Mission Base in Camooweal. The amalgamation of the Presbyterian, Methodist and Congregational churches in 1977 to form the Uniting Church in Australia intended to combine these outback services, creating a huge North West Patrol area to be covered which could not be achieved by road transport, so the Cloncurry congregation purchased an aircraft in 1976 to provide the patrol service out of Cloncurry by air wherever possible, using road travel only to access places that did not have suitable airstrips. In the early 1990s the service was renamed the McKay Patrol to honour Reverend Fred McKay, an early patrol padre who had been involved in establishing the Royal Flying Doctor Service.\nDuring World War II, Cloncurry was the location of RAAF No.23 Inland Aircraft Fuel Depot (IAFD), completed in 1942 and closed on 14 August 1944. Usually consisting of 4 tanks, 31 fuel depots were built across Australia for the storage and supply of aircraft fuel for the RAAF and the US Army Air Forces at a total cost of £900,000 ($1,800,000).\nThe discovery of uranium at Mary Kathleen brought wealth to the community in the 1950s. Until the development of Mount Isa in the 1960s, Cloncurry was the administrative centre of the region.\nThe first-ever flight of the Royal Flying Doctor Service of Australia took place from Cloncurry on 15 May 1928, using a de Havilland DH.50 aircraft hired from the then small airline, Qantas. A Royal Flying Doctor Service museum is situated in the town.\nThe Cloncurry Bob McDonald Library opened in 2012.\nIt was announced on 11 February 2021 that Cloncurry had been chosen as the production location of the 2021 edition of Network 10's reality game show Australian Survivor. The domestic location resulted from concerns regarding international travel during the COVID-19 pandemic. It was filmed in Cloncurry from 22 April to 8 June 2021, with the season airing on 18 July 2021.\nDemographics\nThe population in Cloncurry decreased from 3,898 in 1996 to 2,900 in 2002.\nIn the , the locality of Cloncurry had a population of 2,719 people.\nIn the , the locality of Cloncurry had a population of 3,167 people 23.8% are Aboriginal .\nHeritage listings\nCloncurry has a number of heritage-listed sites, including:\n* Mount Elliott Company Metallurgical Plant and Mill, via Sheaffe Street\n* Cloncurry Courthouse, 42–48 Daintree Street\n* Cloncurry Post Office, 47 Scarr Street\nEducation\nCloncurry State School is a government primary and secondary (Prep–12) school at Daintree Street (). In 2015 the school had 281 students enrolled with a teaching staff of 28 FTE (Full-time equivalent) and 15 FTE (Full-time equivalent) non teaching staff. The general population in the community is highly transient with approximately 40% turnover in student enrolment in 2015. Approximately 60% of student enrolment identify as Aboriginal and or Torres Strait Islander. In 2018, the school had an enrolment of 277 students with 32 teachers and 18 non-teaching staff (14 full-time equivalent). It has a special education program. In 2025 the school had 312 student enrolled.\nSt Joseph's Catholic School is a Catholic primary and junior secondary (Prep–9) school at Sheaffe Street (). In 2018, the school had an enrolment of 156 students with 20 teachers (18 full-time equivalent) and 11 non-teaching staff (5 full-time equivalent).\nAmenities\nCloncurry has a public library, gallery, public swimming pool, showground, golf-course, and racecourse.\nThe Cloncurry Shire Council operates a public library in Cloncurry at Scarr Street.\nThe Cloncurry branch of the Queensland Country Women's Association has its rooms at Charlotte Scott House in Scarr Street. Charlotte Scott was a dedicated member of the Cloncurry QCWA who died in 1992 having spent most of her life in Cloncurry. She was well known for her dancing, especially the Charleston.\nCloncurry Uniting Church is at 19 Meldrum Street (corner of King Street, ). The church operates the McKay Patrol, an aerial service of the Uniting Church in Australia. Supported by other denominations, the McKay Patrol operates a Cessna 182Q aeroplane to provide spiritual and practical help to people living in remote areas in the north-west of Queensland and the eastern Tablelands of the Northern Territory, an area of approximately  with a population of less than 10,000 people. The patrol also provides regular church services in the towns of Cloncurry, Julia Creek, McKinlay, and Karumba and at Adels Grove homestead.\nAttractions\nAttractions in Cloncurry include:\n* Flying Doctor Museum\n* a mineral display in the visitor center.\n* the annual beat the heat festive. the Beat the Heat Festival is an annual celebration which transforms outback Queensland’s Cloncurry for 3 days and nights. explore the eclectic program including a street party, mine cart rally, curry cook off, live music, spring racing, markets and more.\nClimate\nCloncurry has a hot semi-arid climate (Köppen: BSh Trewartha: BShb) with two distinct seasons. There is a very hot, moderately humid and quite uncomfortable wet season from December to March and a warm to hot, generally rainless dry season usually extending from April to November. Until the 1990s, Cloncurry was widely regarded as holding the record for the highest temperature recorded in Australia at   on 16 January 1889.  Investigations published in 1997 revealed that this temperature was measured in an improvised screen made from a beer crate and that it equated to  under standard conditions. The highest temperature ever recorded at Cloncurry's current weather station is , well short of the disputed 1889 temperature record. The average annual rainfall is , almost all of which falls In the months of December to March.\nBecause of the area's extreme solar conditions, Cloncurry was expected to become Australia's first solar-powered town. However the planned 10MW Thermal solar plant was scrapped due to light pollution concerns and a 2.128MW flat panel photovoltaic solar farm was to be built in its place. However, the Queensland Government withdrew financial support for the solar farm in May 2012.\n| source =\n}}\nTransport\nCloncurry has linkages to other destinations via major coach operators such as Greyhound and Bus Queensland. A weekday service to Mount Isa is operated by Cloncurry Coaches as well as local charter services within the area for mining, school, sporting bodies and special events.\n*See Cloncurry Airport\nNotable residents\nWriter Alexis Wright grew up in Cloncurry.\nAssociation footballer Kasey Wehrman was born in Cloncurry in 1977.\nPolitician Bob Katter was born in Cloncurry in 1945.\nAthlete Robert Crowther was born in Cloncurry in 1987.\nSee also\nReferences\nExternal links\n*\n*\n* [https://onesearch.slq.qld.gov.au/permalink/61SLQ_INST/dls06p/alma996911964702061 Annual reports Cloncurry Hospitals Board 1951 to 1991], State Library of Queensland\n*[https://map.chronicle.rip/Cloncurry_General_Cemetery Cloncurry General Cemetery deceased records and online map] at Chronicle Cemetery Map"
    }
  ]
}