{
  "content": [
    {
      "type": "text",
      "text": "# Clontarf, Queensland\n\n| local_map           = yes\n| zoom                = 12\n| pop                 = 8446\n| pop_year            =\n| pop_footnotes       =\n| established         =\n| postcode            = 4019\n| area                = 9.9\n| timezone            = AEST\n| utc                 = +10:00\n| dist1               = 4.6\n| dir1                = SW\n| location1           = Redcliffe\n| dist2               = 34.4\n| dir2                = NNE\n| location2           = Brisbane CBD\n| dist3               =\n| dir3                =\n| location3           =\n| dist4               =\n| dir4                =\n| location4           =\n| elevation           = 12\n| lga                 = City of Moreton Bay\n| region              = South East Queensland\n| stategov            = Redcliffe\n| fedgov              = Petrie\n| near-n              = Kippa-Ring\n| near-ne             = Kippa-Ring\n| near-e              = Margate\n| near-se             = Woody Point\n| near-s              = Moreton Bay\n| near-sw             = Griffin\n| near-w              = Mango Hill\n| near-nw             = Rothwell\n}}\nClontarf is a coastal suburb in the City of Moreton Bay, Queensland, Australia.\nIt is in the south-west of the Redcliffe Peninsula, approximately  by road north-northeast of Brisbane, the state capital. In the , Clontarf had a population of 8,446 people.\nGeography\nClontarf is connected to Brisbane City, across Bramble Bay, by the Houghton Highway which is a 2.7&nbsp;km long causeway that provides access to the southern tip of the Redcliffe Peninsula, greatly decreasing the travel time between Redcliffe and Brisbane. The current pair of bridges, Houghton Highway and its twin Ted Smout Memorial Bridge, replaced the original Hornibrook Bridge which is now closed and mostly removed except for a short span (on the north) and the two iconic bridge entrance towers that were retained to form a very popular fishing pier at the northern and southern ends of Bramble Bay.\nThe land use is a mix of residential and light industrial.\nHistory\nIn 1881,108 allotments at Hayes Inlet Estate, Humpy Bong of what is now Clontarf were offered for sale. The Clontarf estate went to auction on 26 September 1882.  The sale was widely advertised including a coloured lithograph, showing the sub-division of Dr Ward's sugar plantation and using references to the city of Redcliffe \"in the near future\" and a regular steam ferry service between Sandgate and Clontarf within months in the newspaper advertisements. The success which attended this sale of the Clontarf Estate led to Clontarf North sale in December 1882.\nClontarf Beach State School opened on 31 January 1950.\nSt Barnabas' Anglican Church was dedicated on 5 July 1959 by Archbishop Reginald Halse.  In the 1990s it was decided to combine the congregations of St Barnabas' and St Mark's in Woody Point into a new St Peter the Fisherman's Anglican Church at Clontarf. This led to the closure of St Mark's on 24 April 1993 which was approved by Assistant Bishop George Browning. This resulted in the closure of St Barnabas circa 1992. St Peter the Fisherman's was dedicated in 1993 and consecrated in 1996.\nClontarf Beach State High School opened on 28 January 1964.\nGrace Lutheran Primary School opened on 26 January 1971.\nDemographics\nIn the , Clontarf recorded a population of 7,911 people, 50.2% female and 49.8% male.\nThe median age of the Clontarf population was 42 years, 5 years above the national median of 37.\n76.2% of people living in Clontarf were born in Australia. The other top responses for country of birth were New Zealand 5.5%, England 5.2%, Scotland 0.8%, Philippines 0.8%, South Africa 0.5%.\n90.7% of people spoke only English at home; the next most common languages were 0.4% Tagalog, 0.4% German, 0.3% Dutch, 0.3% Italian, 0.3% Samoan.\nIn the , Clontarf had a population of 8,279 people.\nIn the , Clontarf had a population of 8,446 people.\nHeritage listings\nClontarf has a number of heritage-listed sites, including:\n* Hornibrook Highway: Hornibrook Bridge (the first of the three bridges).\nEconomy\nClontarf's west hosts the largest industrial area in the Redcliffe area, and the area is a significant source of employment for the region.  Many residents of Clontarf also commute to Brisbane daily for work. Commuters also travel to Brisbane by train, as there is now a train line that connects to the peninsula.\nClontarf is host to two adjacent medium-sized shopping centres, on the southern tip of the suburb.  Most retail commerce in the suburb revolves around small business however, and there are many stand alone corner stores and other small businesses still in existence.\nEducation\nClontarf Beach State School is a government primary (Prep–6) school for boys and girls at Elizabeth Avenue (). In 2018, the school had an enrolment of 451 students with 37 teachers (32 full-time equivalent) and 25 non-teaching staff (14 full-time equivalent). It includes a special education program at Clontarf Beach State School at Elizabeth Avenue ().\nGrace Lutheran Primary School is a private primary (Prep–6) school for boys and girls at 38 Maine Road (). In 2018, the school had an enrolment of 393 students with 29 teachers (25 full-time equivalent) and 23 non-teaching staff (13 full-time equivalent).\nClontarf Beach State High School is a government secondary (7–12) school for boys and girls at the corner of Elizabeth Avenue and King Street (). In 2018, the school had an enrolment of 923 students with 78 teachers (76 full-time equivalent) and 42 non-teaching staff (33 full-time equivalent). It includes a special education program.\nAmenities\nSt Peter the Fisherman's Anglican Church is at 13 Lucinda Street ().\nPeninsula Life Church is at 3–7 Lavelle Court (). It is part of the Wesleyan Methodist Church.\nThe Clontarf branch of the Queensland Country Women's Association meets at the corner of Victoria Avenue and Georgina Street at Woody Point.\nPublic transport\nEvening peak traffic flow into Clontarf\nClontarf is served by several bus routes: Route 694, an internal route within Redcliffe City, and Routes 690 and 691 to Sandgate railway station, an approximately 10- to 15-minute commute. All services are provided by Hornibrook Bus Lines.\nThe Redcliffe Peninsula line is a  stretch of heavy gauge dual-track railway between Petrie and Kippa-Ring on the Redcliffe Peninsula. The new line is part of the QR Citytrain suburban network, branching from the Caboolture line. It starts 200 metres north of Petrie railway station, extending from ( to  north of Central railway station).\nAttractions\nThe Hornibrook Bridge, looking towards the southern tip of Clontarf\nClontarf Beach and Bells Beach are two of the closest beaches to Brisbane City.\nThe Hornibrook Pier is a popular fishing spot and gathering point for families developed from the remnants of the historic Hornibrook Highway bridge that was removed in 2010 when the Ted Smout Memorial Bridge was opened.\nThe challenging and historic Redcliffe Golf Course is also found in Clontarf since 1936.  It is home to numerous wildlife species including grey kangaroos and koalas.\nThe Kroll gardens and large Kroll Gardens Dog park are a popular destination to unwind after work or on weekends for many.\nPelican Park is known for its kite flying conditions, and a local industry has built around the sport. On weekends, many kites can be seen flying above Clontarf from the Hornibrook Bridge.\nEvents\nDuring May, the Redcliffe Kite Club, based in Clontarf holds a two-day kite event called Kitefest.\nSee also\n* Redcliffe Peninsula road network\nGallery\nImage:HoughtonHighwayPelican.JPG|Roosting pelican on the Houghton\nImage:HoughtonHighway.JPG|Houghton Highway at sunset\nReferences\nExternal links\n*\n*[http://www.redcliffekiteclub.org.au/ Redcliffe Kite Club]"
    }
  ]
}