{
  "content": [
    {
      "type": "text",
      "text": "# Clubb v Edwards\n\n|transcripts=\n}}\nClubb v Edwards; Preston v Avery is a decision of the High Court of Australia. It was a combined hearing of two appeals, raised from the Magistrates Court of Victoria and Tasmania respectively. The appellants, Kathleen Clubb and John Preston; had sought to challenge two laws restricting their conduct near abortion providers, on the ground that the relevant laws were unconstitutional for breach of Australia's freedom of political communication doctrine.\nBoth appeals were unanimously dismissed by the court.\nFactual Background\nSection 185D of the Public Health and Wellbeing Act 2008 (Vic), prohibited communication about abortions, conditional on that communication being with a person accessing an abortion provider within a 'safe access zone', and the communication being likely to cause distress or anxiety. Section 9(2) of the Reproductive Health (Access to Terminations) Act 2013 (Tas), prohibited abortion protests that could be seen or heard by a person accessing a clinic.\nKathleen Clubb had attempted to give anti-abortion pamphlets to a couple seeking access to the Melbourne clinic. Clubb was convicted under the Victorian Act. John Preston had stood on a street corner near a Hobart clinic and held placards with anti-abortion messages and depictions of a foetus, and was convicted under the Tasmanian Act. Both had attempted to seek review in their respective Supreme Courts, but each matter was removed to the High Court.\nDecision\nThe High Court unanimously dismissed the appeal, rejecting the appellant's arguments.\nPlurality judgement\nBy plurality, Kiefel CJ, Bell and Keane declared that the acts did not breach the constitutional implied freedom of political communication. Before reaching that conclusion, the judges briefly reiterated upon the three stage test for breach of the freedom of political communication doctrine (the Lange test). The test as stated by the plurality was substantially similar to the court's prior formulation of the test in McCloy v New South Wales.\nIt was applied as follows:\n*Did the law effectively burden the implied freedom of political communication in terms, operation or effect?The court found that the communication bans outside of abortion clinics were an effective burden on political speech. This was held to be so, even though the law was not expressly targeted at communications concerning governmental and political matters. Nevertheless, the court did not determine whether Clubb's communications were political in nature, primarily due to lack of evidence. The court made a distinction between political and non-political communications, noting that: \"A discussion between individuals of the moral or ethical choices to be made by a particular individual is not to be equated with discussion of the political choices to be made by the people of the Commonwealth as the sovereign political authority. That is so even where the choice to be made by a particular individual may be politically controversial\"However, it was enough for the plurality that the relevant law could have impacted upon actual political communications, even if the Clubb matter did not actually involve a political communication. The court decided they should determine the matter anyway, because (1) the line between speech directed at politics and individual moral choices 'may be very fine when politically contentious issues are discussed', (2) the question might arise again in similar cases, and (3) if Clubb's contentions about the unconstitutionality of the law were correct; she would be entitled to have her conviction set aside; regardless of the nature of her speech.\n*'''Was 'the purpose of the law legitimate, in the sense that it is compatible with the maintenance of the constitutionally prescribed system of representative and responsible government?\nThe court explained that a law's purpose will be legitimate, so long as it doesn't impede the functioning of representative and responsible government. Clubb had argued that the true purpose of the law was the suppression of public expression of anti-abortion sentiment, and that this was not a legitimate purpose. The Solicitor-General of Victoria submitted to the contrary that the law was concerned with the effect upon women and staff, of an environment of 'conflict, fear and intimidation' that had been created outside abortion clinics. The Act itself, expressly declared the purpose to be protecting the safety and well-being of persons accessing lawful medical services. The plurality explained that the \"protection of the dignity of the people of the Commonwealth ... is a purpose readily seen to be compatible with the maintenance of the constitutionally prescribed system of representative and responsible government\". Additionally, they noted \"Generally speaking, to force upon another person a political message is inconsistent with the human dignity of that person. As Barak said, ‘[h]uman dignity regards a human being as an end, not as a means to achieve the ends of others’.\" and that;\"when in Lange the Court declared that ‘each member of the Australian community has an interest in disseminating and receiving information, opinions and arguments concerning government and political matters that affect the people of Australia’, there was no suggestion that any member of the Australian community may be obliged to receive such information, opinions and arguments.\" (per Kiefel CJ, Bell, Keane)As the purpose of the law was found to be legitimate, the court then turned to the question as to whether it was appropriate and adapted to advance that legitimate object.\n*'''Was the law 'appropriate and adapted to advance that legitimate object in a manner that is compatible with the maintenance of the constitutionally prescribed system of representative and responsible government? The court explained that this stage of the test would only assess whether the law could be seen as irrational in pursuing its objectives, or placing an undue burden upon political communication. The communication prohibition was found to have passed this step in part because the laws were spatially limited. Clubb's assertions that on-site protests were especially effective for political communication about abortion, were rejected for lack of evidence. The court held that anti-abortion activists are able to communicate their messages anywhere outside the safe access zones. The balance of the law's burden upon speech was held to be adequate, as the law maintained people's dignity in preventing them from being held captive to unwanted political messages; while only being slight on burden due to the limited subject matter and geographical extent for the ban.\nAs the Victorian law was not held to have fallen afoul of the Lange test, Clubb's appeal was rejected.\nPreston's appeal\nPreston's appeal differed slightly at this stage due to different legislation, as it simply banned all protest activities about abortion within a certain geographic area. The High Court held that the Tasmanian law was 'aimed at protecting the safety, wellbeing, privacy and dignity of people', and because the ban on all protest activities about abortion was viewpoint neutral; (the court reasoned that the law could also theoretically include pro-abortion protests), the law's purpose was held to have passed the legitimacy stage of the test.\nThe law was found to be suitable as it facilitated access to abortion services, and found to have been adequately balanced due to its geographic restriction, the slight burden, and lack of viewpoint discrimination. Preston's appeal was therefore also dismissed.\nJustices Gageler, Nettle, Gordon, and Edelman\nEach of the other justices of the court also ruled in favor of the respondents, while writing separate judgements rather than joining with the plurality.\nLegal significance\nThe plurality in the case applied a legal test for breaches of the freedom of political communication doctrine, substantially similar to that which the court had used in McCloy v NSW. This case alongside Brown v Tasmania, and Comcare v Banerji, mark a stabilization in Australian jurisprudence in the form of tests the High Court has applied for constitutional free speech cases.\nThe case is significant for the High Court having drawn a distinction between types of communication on abortion. As noted by Adrienne Stone, 'The court appears to accept the proposition that not all communication about abortion is political. This idea is very interesting and has a great deal of intuitive appeal. But the reason such a communication is not political is not made fully plain in the reasons and I think we will have to think about it in the future.'\nAlso significant is the plurality's express embrace of proportionality testing in constitutional cases. As noted by the court:\"A structured proportionality analysis provides the means by which rational justification for the legislative burden on the implied freedom may be analysed, and it serves to encourage transparency in reasoning to an answer. It recognises that to an extent a value judgment is required but serves to reduce the extent of it. It does not attempt to conceal what would otherwise be an impressionistic or intuitive judgment of what is 'reasonably appropriate and adapted'\" (per Kiefel CJ, Bell, Keane)\nReception\nMartyn Iles of the Australian Christian Lobby described the decision as \"disappointing for all Australians who believe in freedom of speech\", saying:\"The fragile to non-existent protection for basic democratic freedoms in Australian law has once again been exposed. We are calling on the government to do more than its current proposal to have the ALRC review religious exemptions in discrimination laws. The need is for a clear and comprehensive set of protections for free speech and freedom of religion in Commonwealth legislation.\"Dr Susie Allanson, a psychologist for 26 years at the Melbourne clinic subject of the dispute, described the result as a 'win for women', saying:\"Since the safe zones came into effect, women and staff are no longer a target when they walk up to the clinic, and women no longer carry the heavy burden of being publicly attacked for seeking medical care. This is a great result that enshrines respect for women's choices.\"\nSee also\nUS jurisprudence\n* First Amendment to the United States Constitution\n* National Institute of Family and Life Advocates v. Becerra\n* Schenck v. Pro-Choice Network of Western New York\n* Hill v. Colorado\nReferences"
    }
  ]
}