{
  "content": [
    {
      "type": "text",
      "text": "# Cneoridium dumosum (Nuttall) Hooker F. Collected March 26, 1960, at an Elevation of about 1450 Meters on Cerro Quemazón, 15 Miles South of Bahía de Los Angeles, Baja California, México, Apparently for a Southeastward Range Extension of Some 140 Miles\n\n| label      = Bahía de los Ángeles\n}}\n}}\n\"'Cneoridium dumosum (Nuttall) Hooker F. Collected March 26, 1960, at an Elevation of about 1450 Meters on Cerro Quemazón, 15 Miles South of Bahía de Los Angeles, Baja California, México, Apparently for a Southeastward Range Extension of Some 140 Miles'\" is a humorous (or parodic) yet factual, scientific paper on species distribution published in 1962 by American botanist Reid Moran of the San Diego Natural History Museum.\nThe full text of the paper, including the reference number of the specimen, reads: \"I got it there then (8068).\"\nA 2010 obituary for Moran published in The San Diego Union-Tribune noted that he \"had a dry sense of humor\".\nBackground\nThe paper reports a collection of Cneoridium dumosum in the Sierra de San Borja mountains of southern Baja California, representing a new disjunct distribution for the species. As described by Moran in a later 1983 article within a book on island biogeography, this disjunct population is part of a relict community of otherwise more northerly distributed chaparral plants that have continued to survive in the higher elevation mountains ('sky islands') of southern Baja California.\nMoran and his colleague Glen Ives visited the Sierra de San Borja in March of 1960 to conduct a natural history survey of the mountains, with Moran responsible for collecting plant specimens and Ives for birds and mammals. After driving to Bahía de los Ángeles from San Diego, Moran and Ives packed into the mountains for 10 days. They reached the Cerro Quemazón on March 26, where Moran collected his specimen from a Cneoridium plant on the summit.\nContents\nBookended by its lengthy, pangrammatic title, containing all of Moran's key points, and its copious acknowledgements, the full text of the article body is:\ncomprising just five words, the parenthetical reference number of the specimen collected, and a period.\nMoran's closing acknowledgement: reads\nPublishing\nThe paper was published in 1962 in volume 16, page 272, of the California Botanical Society's journal Madroño. The entire paper was republished under the heading \"Reprinted Classic Madroño Articles\" in Madroño, volume 60, p. 359 in 2013, the California Botanical Society's centennial year.\nReferences\nExternal links\n* [https://www.biodiversitylibrary.org/item/185084#page/312/mode/1up Full text of the article], including acknowledgements"
    }
  ]
}