{
  "content": [
    {
      "type": "text",
      "text": "# Coal Creek War\n\n)\n|place= Tennessee, United States\n|goals = End convict leasing by coal companies\n|result= State ending convict leasing in 1896\n|side1=\n|side2=\n|leadfigures1=  (KOL Labor organizers)\n|leadfigures2=\n|strength1=\n|strength2=\n|casualties1=\n|casualties2= Dozens killed or wounded\n|notes=\n|campaignbox=\n}}\nThe Coal Creek War was an early 1890s armed labor uprising in the southeastern United States that took place primarily in Anderson County, Tennessee. This labor conflict ignited during 1891 when coal mine owners in the Coal Creek watershed began to remove and replace their company-employed, private coal miners then on the payroll with convict laborers leased out by the Tennessee state prison system.\nThese former wage-earning Coal Creek coal miners repeatedly attacked and burned both state prison stockades and mine properties, all while releasing hundreds of the state convict laborers from their bondage to the mine companies. Many of these same Coal Creek coal miners were wounded or killed in small-arms skirmishes during the Coal Creek War, along with dozens of Tennessee state militiamen.\nOne historian describes the Coal Creek War as \"one of the most dramatic and significant episodes in all American labor history.\"\nThe Coal Creek War was part of a greater labor struggle across Tennessee that was launched against the state government's controversial convict leasing system, which allowed the state prison system to lease convict labor to mining companies (and other business enterprises) with the effect of suppressing employee wages in the open market across the state. The outbreak of this labor conflict touched off a partisan media firestorm between the miners' supporters and detractors and brought the issue of convict leasing to the public debate.\nAlthough the Coal Creek War essentially ended with the arrests of hundreds of former company coal miners during 1892, the adverse exposure that this state conflict with private labor generated nationwide led to the downfall of Governor John P. Buchanan and forced the Tennessee General Assembly to reconsider its state convict labor-leasing system. The Tennessee state government later refused to renew its convict labor-lease contracts with private businesses upon the arrival at the 1896 expiration dates, making Tennessee one of the first states within the southern United States to end this controversial practice.\nGeographical setting\nCoal Creek emerging from its Walden Ridge water gap in Rocky Top.\nThe Coal Creek War took place on the eastern fringe of the Cumberland Mountains, where the range gives way to the Tennessee Valley. Coal Creek, a tributary of the Clinch River, flows north for several miles from its source in the mountains, slicing a narrow valley between the backbone-like Walden Ridge on the east and Vowell Mountain to the west before exiting the mountains eastward through a water gap in Walden Ridge. A flank of Vowell Mountain known as \"Militia Hill\" overlooks this water gap.\nMost of the violence centered around two communities&mdash;Briceville at the upper end of Coal Creek near its source, and the town of Coal Creek, later known as Lake City and currently the modern Rocky Top, at the lower end of the creek where it emerges from its Walden Ridge water gap. Other key events occurred some  south of Coal Creek at Oliver Springs. A substantial number of sympathetic miners trekked southward from Jellico, about twenty-five miles north of Coal Creek, and Kentucky to join the uprising, and a parallel anti-leasing conflict took place in Grundy County and Marion County, about  south of the Coal Creek area, in 1892. Coal Creek was connected to Kentucky and Knoxville by the East Tennessee, Virginia & Georgia Railroad, and a spur line connected Coal Creek to Briceville.\nBackground\nEntrance to the Knoxville Iron Company mine near Coal Creek, photographed by Lewis Wickes Hine in 1910.\nAfter the American Civil War and the abolition of slavery, Tennessee, like other Southern states, were challenged with finding sources of revenue while simultaneously dealing with crumbing infrastructure. Additionally, state officials were struggling with the issue of controlling the state's newly emancipated population. The “Black Codes,” modeled after the South’s old “slave codes,” with its broad vagrancy laws, allowed for the targeting and mass arrest of freed African Americans. From the beginning of the Black Codes official enactment in 1865, the prison population of African Americans in Tennessee jumped from 52% to 75%. This mass incarceration of ex-enslaved peoples created a reserve army of labor. However, this also presented a problem for Tennessee officials as the state penitentiary in Nashville was deeply in debt and in bad condition. Lacking proper prison infrastructure and needing to reduce expenditures and generate income, Tennessee started increasingly privatizing its penal system by leasing out its convicts.\nPost-war railroad construction, meanwhile, had opened up the state's coalfields to major mining operations, creating a large demand for cheap labor. In 1866, the state began leasing its convicts to companies willing to pay for the inmates' housing in exchange for their labor, and in 1871 leased convicts to the Tennessee Coal, Iron, and Railway Company (TCI), which owned a large coal and coke operation in the Cumberland Plateau area west of Chattanooga. TCI in turn subleased most of the convicts to smaller mining companies. In 1884, TCI leased the entire Nashville prison population for $101,000 annually for five years. Tennessee Governor, John P. Buchanan, praised the convict leasing scheme as being \"successful\" in \"relieving [the state] of all business risk and expense, and paying a surplus into the treasury.\" While there was some resistance among free miners to the use of convict laborers in the 1870s, the abundance of jobs and companies' preference for the higher-quality production of free labor eased the miners' concerns.\nDuring the same period, the Coal Creek valley became one of Tennessee's most lucrative coal mining regions. The town of Coal Creek expanded rapidly, becoming the largest in Anderson County with a population of 3,000 by the end of the 1870s. Coal mines opened throughout the valley between Coal Creek and Briceville, which was founded as a mining town in the late 1880s. Most mines were established by companies leasing land from the Coal Creek Mining & Manufacturing Company, which had been formed by Edward J. Sanford and other land speculators after the Civil War. While the mining companies reaped substantial profits, the miners often struggled economically and began to organize in the 1880s. The mine owners preferred free labor, but they threatened to replace free miners with convicts whenever free miners talked about forming unions. Nevertheless, by the late 1880s, only two mining operations in Anderson County&mdash;the Knoxville Iron Company mine at Coal Creek and the Cumberland Coal Company's \"Big Mountain\" mine at Oliver Springs&mdash;primarily used convict labor.\nConfrontation\nInitial outbreak\nIn 1890, the election of several members of the labor-friendly Tennessee Farmers' Alliance&mdash; among them Governor John P. Buchanan&mdash; to the state government emboldened miners in the Coal Creek valley to make several demands. One of the key demands was payment in cash rather than company scrip, which could either be used only at company-owned stores with marked-up prices or be redeemed for cash at a percentage of its value. Miners also demanded they be allowed to use their own checkweighmen&mdash;the specialists who weighed the coal and determined how much a particular miner had earned&mdash;instead of checkweighmen hired by the company.\nSince state laws already barred scrip payment and company-hired checkweighmen, most mine owners accepted the demands, though they were in the midst of an economic downturn. However, the Tennessee Coal Mining Company (TCMC), which operated a mine near Briceville, rejected the demands and on April 1, 1891, shut down operations. Two months later the company demanded its miners sign an iron-clad contract before returning to work; the miners refused.\nOn July 5, TCMC reopened the Briceville mine using convicts it had leased from TCI. With tensions already high, the company tore down miners' houses in Briceville to build a stockade for its convict laborers. Miners and local merchants met on July 14 to determine a course of action. It was rumored a larger group of convicts would arrive the next day. That night about 300 armed miners&mdash;probably led by Knights of Labor organizers Eugene Merrell, George Irish, and Marcena Ingraham&mdash;surrounded the Briceville stockade. The stockade's guards surrendered without a fight, and the convicts were marched to Coal Creek where they were loaded onto a train and sent to Knoxville.\nGovernor's response\nDrawing in ''Harper's Weekly'' showing miners gathered at Thistle Switch on July 16, 1891.\nAfter seizing the Briceville stockade, the Coal Creek miners sent a telegram to Governor Buchanan, stating their actions were taken to defend their property and wages and asking for his intervention. On July 16 Buchanan, escorted by three Tennessee state militia companies (two from Chattanooga and one from Knoxville) led the convicts back to Briceville. At Thistle Switch, a railroad stop near Fraterville, several hundred angry miners confronted the governor and demanded he address them. Buchanan told the miners he was a champion of labor, but as governor he was obligated to enforce the laws and pleaded for calm and patience. After the governor's speech, Merrell rebutted it, claiming that the governor had not bothered to enforce laws regarding scrip or checkweighmen and calling the state government a \"disgrace to a civilized country.\" Later that night shots were fired at the stockade, startling the governor who had remained in the area until the following day. Buchanan left 107 militiamen under Colonel Granville Sevier, a great-grandson of John Sevier, to guard the stockade.\nOn the morning of July 20 an estimated 2,000 miners armed with shotguns, rifles, and pistols again surrounded the Briceville stockade. The miners' ranks had been bolstered by an influx of miners from the border town of Jellico and several hundred miners from Kentucky, some of whom had successfully removed convicts from two Kentucky mines five years earlier. After gaining an assurance that no company property would be damaged, Sevier surrendered upon seeing the futility of resisting such a large force. The miners again marched the convicts to Coal Creek and put them on a train back to Knoxville. Later that day, the miners marched on the Knoxville Iron Company mine near Coal Creek, which also used convict labor, forced the guards at its stockade to surrender, and likewise sent its convicts to Knoxville.\nTruce and legislative action\nOn July 21, 1891, Buchanan travelled to Knoxville where he again summoned the militia. Over a four-day period, the governor met with a committee of local figures friendly to the miners' interests, namely attorney J.C.J. Williams, Knoxville Journal editor William Rule, and United Mine Workers organizer William Webb. On July 23 Williams and Webb went to Coal Creek to address the miners, echoing the governor's plea for patience. Williams assured the miners that the governor supported an end to convict leasing but said it would take time to change the law. The miners thus agreed to a 60-day truce after the governor assured them he would call a special session of the Tennessee state legislature and recommend the lease law be repealed. The convict laborers returned on July 25. During the truce, Merrell and Irish traveled around the state giving speeches to rally support for the miners' cause.\nOn August 31, Buchanan called a special session of the state legislature where he recommended that the leasing system be terminated as soon as possible and that it should be immediately restricted to mines without free labor. One question before the legislature was whether the state could terminate the leasing contract it had signed, which did not expire until December 31, 1895. Another issue was what to do with convicts should the convict-leasing system be terminated. The topic was given great consideration, however it was reported that the entire state, except East Tennessee, favored its continuation because its removal would cause taxes to be increased. After three weeks of debate, the legislature adjourned on September 21, taking little action other than making it a felony to interfere with the leasing system and authorizing the governor to take any necessary action to protect the system.\nAfter this setback, the miners held out hope with the state's court system, which considered a case brought by the Tennessee Commissioner of Labor, George Ford, who claimed the poor conditions in which the inmates worked and lived violated state law. In September 1891, a justice of the peace was smuggled into one of the mines to attempt to secure a habeas corpus application for a convict on the grounds of being held in an illegal prison that was not controlled by the state. The case moved quickly through the courts, reaching the Tennessee Supreme Court in October 1891. Chief Justice Peter Turney ruled against the miners, essentially citing the sanctity of contracts.\nBurning of stockades and establishment of Fort Anderson\nDrawing in ''Harper's Weekly'' showing Militia Hill as viewed from the Coal Creek stockade.\nOn October 28, 1891, the committee representing the Coal Creek miners' interests announced they were resigning, denounced the legislature, and issued a subtle call to arms. On October 31 a group of miners burned the TCMC stockade at Briceville and seized the stockade at Coal Creek. Several company buildings were destroyed or looted, but the stockade was spared. Over 300 convicts were freed and supplied with fresh food and civilian clothes by the insurgents, who urged them not to commit further crimes. On November 2 another band burned the stockade at Oliver Springs, freeing 153 convicts.\nIn response to the outbreak, a second truce was negotiated in which the miners agreed to allow the return of convicts to Coal Creek and Oliver Springs, but not Briceville, where TCMC president B.A. Jenkins had grown disgruntled with convict labor. The state dispatched 84 militiamen under the command of J. Keller Anderson to guard the convict stockade at Coal Creek and a small force to guard the one at Oliver Springs. Anderson built Fort Anderson on what came to be known as \"Militia Hill\", overlooking Coal Creek via the Walden Ridge water gap, which was outfitted with a Gatling gun, and the convicts returned to the Coal Creek Valley on January 31, 1892.\nRelations between the militiamen, most of whom were from middle or west Tennessee, and the people of Coal Creek soured quickly. Merrell wrote to Buchanan complaining of the troops' behavior, and for several months miners and soldiers indiscriminately shot at one another, with either side blaming the other for provoking it. In the meantime, Merrell and Jenkins had made amends, and the two began promoting a new cooperative style of mining operations favorable to both miners and managers.\nBy summer 1892, dozens of newspapers and magazines nationwide, including The New York Times, the Alabama Sentinel, and ''Harper's Weekly, had sent correspondents to the Coal Creek region to cover the conflict. Sentiment was initially pro-miner, although as violent outbreaks continued and militiamen were killed, sentiment began to shift. The Nashville Banner called the miners \"thieves, robbers, ruffians, and outlaws,\" while the Chattanooga Republican accused the state legislature of being \"inhuman.\" The two Knoxville papers, the Journal and the Tribune'', initially praised the miners' decisiveness and derided the government's ineffectiveness, but their sentiments shifted after the stockades were burned in October 1891.\nAttack on Fort Anderson and the miners' arrests\nA drawing from ''Harper's Weekly'' showing Coal Creek miners firing on Fort Anderson in 1892.\nWhile the East Tennessee mining companies were moving away from convict labor, the state's primary lessee, TCI, remained stalwartly dedicated to using convict leasing at its south Tennessee mines. When Cumberland Coal balked at using convicts at its Oliver Springs mine, TCI purchased the mine's lease, giving it a direct foothold in the Anderson County coalfields. As the company minimized the work of its free laborers, however, tensions steadily rose.\nOn August 13, 1892, free miners in Grundy County tore down the TCI stockade in Tracy City, and on August 15 convicts were removed from the TCI stockade at Innman in Marion County. These actions reignited resentment in East Tennessee, and on August 17 a group of miners led by John Hatmaker attacked the TCI stockade at Oliver Springs but were beaten back by the guards. Shortly afterward a larger group of miners reconvened at the stockade, and its guards finally surrendered. The stockade was burned, and the convicts were put on a train and sent to Nashville. The following day Anderson was captured at Coal Creek, and the miners ordered Fort Anderson's second-in-command, Lieutenant Perry Fyffe, to surrender. After Fyffe refused, the miners charged the fort, killing two militiamen but failing to capture the position.\nIn response to this latest uprising, Buchanan dispatched 583 militiamen under the command of General Samuel T. Carnes to East Tennessee.  He also ordered sheriffs of affected counties to form posses. Most county sheriffs&mdash;including the Anderson and Morgan sheriffs&mdash;ignored this order or made lackluster attempts to execute it, although several dozen volunteers were amassed in the Nashville, Chattanooga, and Knoxville areas. A group of Knoxville volunteers marched to relieve the besieged Fort Anderson, but as they descended Walden Ridge they were ambushed by a group of miners, who killed two of the volunteers and sent the rest fleeing back toward Clinton. Carnes arrived on August 19 and quickly restored order and obtained Anderson's release. He then initiated a sweep of the region from Coal Creek to Jellico, arresting hundreds of miners deemed complicit in the insurrection. The militia used the Briceville Community Church as a temporary jail for those arrested.\nAftermath\nCarnes' sweep of the Coal Creek Valley largely ended the Coal Creek War, although other events threatened to reignite the violence. A failed attack on the TCI stockade at Tracy City occurred in April 1893. In August 1893, miner Richard Drummond killed a soldier in a brawl; he was then hanged by the militia from a railroad bridge near Briceville.\nBuchanan, attacked by both miners and mine owners alike for his indecisiveness, failed to win his party's nomination for governor in 1892, the Democrats choosing Chief Justice Turney instead. Buchanan still ran as a third-party candidate, but Turney won the election easily, ending Buchanan's political career. Seeing that the state's financial gains from convict-leasing had been erased by having to keep the militia in the field, Turney and the legislature decided to let the TCI contract expire and enacted legislation to build Brushy Mountain State Penitentiary and purchase land in Morgan County where convicts would mine coal directly for the state, rather than competing with free labor.\nAnderson County judge W.R. Hicks oversaw the indictments of nearly 300 miners and other individuals associated with the Coal Creek uprisings. Many fled the state before they could be charged or brought to trial, including Eugene Merrell. Nearly all who showed up in court were either acquitted or found guilty and fined. Only one trial ended with serious jail time: D.B. Monroe was sentenced to seven years after being vilified in the media as an \"outsider\" from Chattanooga who had come to Anderson County to spread his \"anarchist\" philosophy. Monroe was released after serving two years.\nLegacy\nThe Coal Creek Watershed Foundation presently works to preserve the legacy of the Coal Creek War and its impact on the area and has taken the initiative in locating the remains of Fort Anderson and several poorly-marked or unmarked convict graves near the old Knoxville Iron Company mine. Drummond's Trestle, the railroad bridge where Richard Drummond was hanged in 1893, still stands near the junction of Highway 116 and Lower Briceville Highway. Much of the land purchased by the state in 1896 for the construction of Brushy Mountain State Penitentiary is now part of Frozen Head State Park.\nThe Coal Creek War provided inspiration for some of the earliest Appalachian coal mining protest music. Songs about the conflict include \"Coal Creek Troubles,\" written and recorded by Jilson Setters in 1937, and a banjo tune called \"Coal Creek March,\" which was recorded by Kentucky banjoist Pete Steele for the Library of Congress in 1938 and is still popular among old-time musicians. The song \"Buddy Won't You Roll Down the Line,\" written and performed by Grand Ole Opry pioneer Uncle Dave Macon, was based on the Coal Creek War.\nThe Coal Creek War was also influential on early union labor leaders. In an address from 1899 on convict labor, Eugene Debs mentions the \"Tennessee tragedy\" [as being] \"still fresh in the public memory.\" \"Here, as elsewhere, the convicts, themselves brutally treated, were used as a means of dragging the whole mine—working class down to their crime—cursed condition. The Tennessee Coal and Iron Company leased the convicts for the express purpose of forcing the wages of miners down to the point of subsistence.\"\nSee also\n*Cross Mountain Mine disaster\n*Fraterville Mine disaster\n*Knights of Reciprocity\n*Wilder, Tennessee/ History: Killing of Union Leader, Barney Graham\nReferences\nExternal links\n*[http://www.coalcreekaml.com/ Coal Creek Watershed Foundation]\n*[http://www.fno.org/coalcreek/songlyrics.html Coal Creek Troubles] &mdash; lyrics to the folk song inspired by the Coal Creek War\n*[http://www.knoxnews.com/news/2013/may/18/peace-treaty-signed-to-end-coal-creek-war/ Knoxville News-Sentinel, May 18, 2013: \"'Peace treaty' signed to end Coal Creek War\"]"
    }
  ]
}