{
  "content": [
    {
      "type": "text",
      "text": "# Coast and Geodetic Survey Pacific War Zone Medal\n\n|image=\n|image_size=\n|caption=The obverse (left) and reverse of the medal. The reverse is blank, but has been marked by a written notation.\n|presenter=United States Coast and Geodetic Survey\n|country=United States\n|type=Service award\n|eligibility=Personnel of the U.S. Coast and Geodetic Survey\n|awarded_for= Service during World War II or its immediate aftermath\n|status=Obsolete\n|established= *21 July 1945 (ribbon)\n*1988 (medal)\n|firstawarded=\n|lastawarded=\n|total_awarded=\n|total_awarded_posthumously=\n|total_recipients=\n|individual=\n|higher=C&GS Atlantic War Zone Medal\n|lower=\n|related=\n|image2=Ribbon of the medal.\n|caption2=\n}}\nThe Coast and Geodetic Survey Pacific War Zone Medal is a decoration of the United States Coast and Geodetic Survey presented to personnel of the Coast and Geodetic Survey for service during World War II or its immediate aftermath.\nHistory\nUnited States Coast and Geodetic Survey personnel were eligible for the awards and decorations of the United States Department of Commerce and the awards and decorations of other uniformed services with which they served. However, although the Coast and Geodetic Survey traced its history to 1807, it had no awards of its own until 21 July 1945, when President Harry S. Truman signed Executive order 9590, authorizing six awards in recognition of Coast and Geodetic Survey service during World War II, the national emergency preceding it, or its aftermath: The Coast and Geodetic Survey Pacific War Zone Medal was one of the six awards.\nFor budgetary reasons, Executive Order 9590 established the award as a ribbon only, but it also authorized the United States Secretary of Commerce to \"provide and issue an appropriate medal, with suitable appurtenances, to the recipient of any ribbon at such time as he may determine, and when necessary funds are available therefore.\" However, it was not until the United States Congress passed the Merchant Marine Decorations and Medals Act in 1988 that the Coast and Geodetic Survey's successor organization, the National Oceanic and Atmospheric Administration (NOAA), took action to create a medal for the award. Later in 1988, via NOAA Corps Bulletin 880401, NOAA authorized medals to supplement the ribbons previously awarded. Among them was the Coast and Geodetic Survey Pacific War Zone Medal.\nCriteria\nThe Coast and Geodetic Survey Pacific War Zone Medal was awarded to any member of the U.S. Coast and Geodetic Survey who served outside the continental limits of the United States in the Pacific War Zone under the jurisdiction of the United States Secretary of Commerce between 7 December 1941 and 2 March 1946. Any commissioned officer of the United States Coast and Geodetic Survey Corps and any ship's officer or member of the crew of any Coast and Geodetic Survey ship was eligible for the Coast and Geodetic Survey Pacific War Zone Medal. Coast and Geodetic Survey personnel were not eligible for the medal for service they performed during periods in which they were under other jurisdiction, such as that of the United States Department of War or the United States Department of the Navy.\nA recipient was authorized to receive only one Coast and Geodetic Survey Pacific War Zone Medal ribbon during his career, but was authorized to wear a ribbon device in lieu of an additional ribbon to indicate additional awards of the medal.\nAppearance\nMedal\nThe obverse of the medal depicts a globe superimposed over two crossed anchors, with a bald eagle with its wings spread perched atop the globe, the same image depicted on the seal of the U.S. Coast and Geodetic Survey. The reverse of the medal is blank.\nThe medal is identical to the Coast and Geodetic Survey Distinguished Service Medal, Coast and Geodetic Survey Meritorious Service Medal, Coast and Geodetic Survey Good Conduct Medal, Coast and Geodetic Survey Defense Service Medal, and Coast and Geodetic Survey Atlantic War Zone Medal, all of which also were authorized by NOAA Corps Bulletin 880401 in 1988.\nRibbon\nThe ribbon has two broad yellow bands and a blue border. A red stripe flanked by two white stripes and two narrow blue stripes is centered between the yellow bands. Because all six medals authorized in 1988 are identical, only the ribbons authorized in 1945 that the medals are suspended from distinguish the medals from one another.\nSee also\n* Awards and decorations of the National Oceanic and Atmospheric Administration\n* Awards and decorations of the United States government\n* American Campaign Medal\n* Asiatic–Pacific Campaign Medal\n* Merchant Marine Pacific War Zone Medal\nReferences"
    }
  ]
}