{
  "content": [
    {
      "type": "text",
      "text": "# Cobalt Silver Kings\n\n|stanley_cups=0|\n|CAN_eng = 1|\n}}\nwith the Cobalt Silver Kings.]]\nwith the Cobalt Silver Kings.]]\nThe Cobalt Silver Kings of Cobalt, Ontario, were a professional ice hockey club established in 1906. The team is notable for being a founding member of the National Hockey Association, the predecessor to the National Hockey League. Established to capitalize on the then-current mining boom in northern Ontario, it became clear that the town was too small to support major professional hockey, and the team left the NHA after its inaugural season.\nThe club was owned by Renfrew, Ontario mine operator Ambrose O'Brien.\nHistory\nThe club was founded in 1906 in the Timiskaming Professional Hockey League, an early professional ice hockey league. In 1909, the Cobalt Silver Kings won the O'Brien Cup as champions of the TPHL.\nIn 1909, the club became part of the new National Hockey Association (NHA), along with another TPHL team, the Haileybury Comets, the Federal League's Renfrew Creamery Kings and Les Canadiens and Wanderers of Montreal. The league was founded by Ambrose O'Brien to rival the Canadian Hockey Association (CHA), set up at the same time, and to provide a league for his Renfrew team to win the Stanley Cup. The CHA dissolved and two of its teams the Senators of Ottawa, and the Shamrocks of Montreal joined the NHA.\nAfter the initial season, the club returned to play in the TPHL and its NHA franchise was taken over by the Quebec Bulldogs (formerly of the CHA).\nThe team played in an arena with a capacity for 3,500 spectators.\nHead coach\n*Tom Hare (1909–1910)\nNotable players\n* Ed Decarie –  1906–07\n* Howard McNamara – 1909–10\n* Bruce Ridpath –  1906–07, 1908–09\nHall of Fame\n* Newsy Lalonde – 1906–07\n* Hugh Lehman –  1906–07\n* George McNamara – 1906–07\n* Didier Pitre –  1906–07\n* Art Ross – 1908–09\nSee also\n* Haileybury Comets\n* Renfrew Creamery Kings\nReferences"
    }
  ]
}