{
  "content": [
    {
      "type": "text",
      "text": "# Coccinelle (software)\n\n| latest release date    =\n| programming language   = OCaml and Python\n| genre                  = Static program analysis\n| license                = GPLv2\n| website                =\n}}\nCoccinelle (French for ladybug) is an open-source tool for matching and transforming the source code of programs written in the C programming language.\nUtility\nCoccinelle was initially used to aid the evolution of the Linux kernel, providing support for changes to library application programming interfaces (APIs) such as renaming a function, adding a function argument whose value is somehow context-dependent, and reorganizing a data structure.\nIt can also be used to find defective programming patterns in code (i.e., pieces of code that are erroneous with high probability such as possible NULL pointer dereference) without transforming them. Therefore coccinelle's role is close to that of static analysis tools. Examples of such use are provided by the applications of the [https://coccinelle.gitlabpages.inria.fr/website/herodotos/herodotos.html herodotos] tool, which keeps track of warnings generated by coccinelle.\nSupport for Coccinelle is provided by IRILL.  Funding for the development has been provided by the Agence Nationale de la Recherche (France), the Danish Research Council for Technology and Production Sciences, and INRIA.\nThe source code of Coccinelle is licensed under the terms of version 2 of the GNU General Public License (GPL).\nSemantic Patch Language\nThe source code to be matched or replaced is specified using a \"semantic patch\" syntax based on the patch syntax. The Semantic Patch Language (SmPL) pattern resembles a unified diff with C-like declarations.\nExample\n@@\nexpression lock, flags;\nexpression urb;\n@@\nspin_lock_irqsave(lock, flags);\nspin_unlock_irqrestore(lock, flags);\n@@\nexpression urb;\n@@\n- usb_submit_urb(urb)\n+ usb_submit_urb(urb, GFP_KERNEL)\nReferences\nExternal links\n*\n* [https://coccinelle.gitlabpages.inria.fr/website/download.html Official latest stable download]\n* [https://coccinelle.gitlabpages.inria.fr/website/papers.html Articles describing the use of Coccinelle]\n* [http://coccinellery.org Coccinellery: Semantic Patch Gallery]"
    }
  ]
}