{
  "content": [
    {
      "type": "text",
      "text": "# Cold Warriors\n\n| guests         = *Buzz Aldrin as himself\n*Tom Kenny as Yancy Fry Jr.\n| opening_caption= We're following you, But not on Twitter\n| opening_cartoon=\n| prev           = All the Presidents' Heads\n| next           = Overclockwise\n}}\n\"Cold Warriors\" is the twenty-fourth episode in the  sixth season of the American animated television series Futurama, and the 112th episode of the series overall. It originally aired on August 25, 2011 on Comedy Central. American actor Tom Kenny guest stars in the episode, voicing recurring character Yancy Fry, Jr., as well as astronaut Buzz Aldrin, voicing himself.\nIn the episode, Fry inadvertently reintroduces the common cold to the 31st century. The situation links to Fry's past, and flashbacks are shown depicting his entry in a NASA science competition and his relationship with his father.\nThe episode was written by Dan Vebber and directed by Crystal Chesney-Thompson. On June 5 and June 6, as part of its \"Countdown to Futurama\" event, Comedy Central Insider, Comedy Central's news outlet, released two preview materials for the episode; a storyboard of Leela trying to escape the Planet Express building and a character design of Fry's guinea pig dressed in a spacesuit. \"Cold Warriors\" received generally positive reviews from critics, who enjoyed its emotional ending and felt that it recaptured the feel of the show's original run.\nPlot\nFry catches the common cold during an ice fishing trip, though the rest of the Planet Express crew are unaware of what the disease is as it was eradicated 500 years ago. Professor Farnsworth explains that the common cold virus had survived within Fry while he was frozen for 1000 years and has thus been reintroduced to mankind, which has lost all resistance to the virus. During this time, flashbacks to the year 1988 show Fry taking an ice fishing trip with his father, during which he falls through the ice and catches a cold. Later, egged on by his brother Yancy, he decides to enter a science competition judged by Buzz Aldrin in which the winner's entry will be launched into space in a satellite. His idea is to infect his pet guinea pig with the cold virus and see if can be cured by exposure to cosmic rays. A rival competitor, Josh Gedgie, learns of Fry's entry and decides to create an experiment about the common cold as well.\nIn the present day, the pathogens of the cold are detected and Planet Express is quarantined. Bender, who is immune to biological illness and forced to take care of the sick crew, becomes exasperated and breaks through the quarantine after being sneezed on by Zoidberg, spreading the virus across Manhattan. Richard Nixon becomes concerned with the rapid spread of the disease and brings in Ogden Wernstrom to resolve the situation. Wernstrom's solution is to destroy the virus by enclosing Manhattan in plastic wrap, lifting it into space, and hurling it into the Sun.\nBelieving that a vaccine can be created using a sample of the original virus, Farnsworth plans to extract it from Fry by grinding his body into a paste, thereby killing him. Fry remembers that the winning science competition entry contained a virus sample. The crew escapes the city and finds the satellite containing the experiment, now encased in ice on Enceladus, with a flashback revealing that Gedgie's project won the competition, to the disappointment of Fry's father. As the Professor uses Gedgie's virus sample to create a vaccine, and Manhattan is set back in place and its residents are inoculated to stop the outbreak, Leela tells Fry that he should be proud of himself for saving millions of people, no matter what his father thought of him. Fry then has a flashback to the ice fishing trip with his father just after being pulled out of the ice, where Fry's father tells him that he loves him, and explains that he is only so hard on Fry because he wants Fry to grow up strong and resilient. He then tells Fry to keep warm, because he would hate it if his son were frozen.\nCultural references\nThe title of the episode itself is a reference to the situation between the United States and the Soviet Union, the Cold War. A scene depicts Barack Obama as a pizza delivery boy.\nProduction\nThe episode was written by Dan Vebber, and directed by Crystal Chesney-Thompson. From June 5 to 6, as part of its \"Countdown to Futurama\" event, Comedy Central Insider, Comedy Central's news outlet, released two preview materials for the episode; concept art of Fry's guinea pig dressed up in astronaut's clothing, and storyboards of a scene featuring Leela trying to escape the quarantined Planet Express building. Additionally, two promotional pictures from the episode were released by Comedy Central Press.\nAmerican actor Tom Kenny guest stars in the episode, voicing recurring character Yancy Fry, Jr., Philip J. Fry's brother. Astronaut Buzz Aldrin also guest stars in the episode, voicing himself. In a June 2011 interview with Assignment X, series creator David X. Cohen first revealed that Aldrin would guest star in the episode.\nReception\nIn its original U.S. broadcast, \"Cold Warriors\" scored a 0.7 share among adults 18-49 and 1.524 million viewers, up about 142,000 viewers from the previous week's episode \"The Tip of the Zoidberg\".\nThe episode received generally positive reviews from critics. Zack Handlen of The A.V. Club gave the episode an A− rating, describing it as \"an ambitious, consistently entertaining episode\" and praising its story and humor. He did, however, note that some characters felt out of character in the episode, and felt that the episode did not achieve the same emotional effect that previous episodes with flashbacks to Fry's past, namely \"The Luck of the Fryrish\" and \"Jurassic Bark\", had. Sean Gandert of Paste, giving the episode an 8.5/10 rating, wrote: \"There are more than the usual number of logical stretches required for 'Cold Warriors' to make sense, but the episode moves so swiftly through them that it still works well. Fry's science fair attempt isn't particularly interesting, either, but it has enough great moments to warrant so much of the episode being spent there. With the combination of showing for the first time a real closeness between Fry and his dad and what happens when an epidemic breaks loose in the future, it also broached some interesting new ground.\" He praised the episode's emotional nature, and felt that the episode was a sign that Futurama was closer to recapturing the \"magic of [its] original run.\"\nRobert Canning of IGN was critical of \"Cold Warriors\", giving the episode a 6.5/10 rating. Canning felt that the episode fell short of his expectations, comparing it unfavorably to \"The Luck of the Fryrish\" and \"Jurassic Bark\". He also felt that the episode's use of flashbacks felt repetitive, as the previous week's episode \"The Tip of the Zoidberg\" had also used them in a similar manner. He described the episode's ending as its \"biggest failure\", writing: \"...the biggest failure of the episode was that the 'should have been really emotional' ending just sort of happened without much of a connection with the audience. [...] Ultimately, this unsuccessful ending only served to weaken the already so-so story that came before it.\"\nReferences\nExternal links\n*\n*"
    }
  ]
}