{
  "content": [
    {
      "type": "text",
      "text": "# Coleman v. Schwarzenegger\n\nColeman v. Schwarzenegger, docket no. 2:90-cv-00520-LKK-JFM (E.D. Cal.), is a federal class action civil rights lawsuit under the Civil Rights Act of 1871, Eighth and Fourteenth Amendment to the United States Constitution, and the Rehabilitation Act of 1973 alleging unconstitutional mental health care by the California Department of Corrections and Rehabilitation (CDCR).\nThe case was consolidated with Plata v. Schwarzenegger and assigned to a three-judge court on July 26, 2007, to hear motions for relief pursuant to the Prison Litigation Reform Act. An order to reduce the prison population was entered on January 12, 2010, which California claims is unconstitutional in its appeal before the Supreme Court.\nHistory\nThe case was filed on April 23, 1990, and was tried before a United States magistrate judge, and in June 1994 the magistrate judge found that defendants’ delivery of mental health care to class members violated the Eighth Amendment to the United States Constitution.\nSpecial Master\nOn September 13, 1995, the court issued a permanent injunction and ordered that a special master be appointed to monitor compliance with the court-ordered injunctive relief. The special master submitted 16 interim reports, with later reports \"reflect[ing] a troubling reversal in the progress of the remedial efforts of the preceding decade\".\nThree-Judge Court\nIn 2006, the plaintiffs in the Coleman case and Plata v. Schwarzenegger filed motions to convene a three-judge court to limit the prison population. , a statute created by the Violent Crime Control and Law Enforcement Act and further amended by the Prison Litigation Reform Act, sets forth remedies with respect to prison conditions. On October 4, 2006, the Governor Schwarzenegger issued [http://gov.ca.gov/proclamation/4278/ Proclamation 4278], declaring a state of emergency. During the pending motions, the Little Hoover Commission released its report titled [https://web.archive.org/web/20091008111456/http://www.lhc.ca.gov/studies/185/Report185.pdf \"Solving California's Corrections Crisis: Time Is Running Out\"] and the CDCR Expert Panel on Adult Offender Recidivism Reduction Programming released its [https://web.archive.org/web/20091008120208/http://www.cdcr.ca.gov/News/ExpertPanel.html report], both advocating a reduction in prison overcrowding. On July 23, 2007, both the Plata and Coleman courts granted the plaintiff's motions and recommended that the cases be assigned to the same three-judge court. The Chief Judge of the United States Court of Appeals for the Ninth Circuit agreed and, on July 26, 2007, convened the instant three-judge district court pursuant to .\nRelease Order\nOn August 4, 2009, the three-judge court ordered that the defendants submit a plan within 45 days detailing \"a population reduction plan that will in no more than two years reduce the population of the CDCR's adult institutions to 137.5% of their combined design capacity.\"[http://www.ca9.uscourts.gov/datastore/general/2009/08/04/Opinion%20&%20Order%20FINAL.pdf Order for population reduction plan], three-judge court convened by the Chief Judge of the United States Court of Appeals for the Ninth Circuit hearing Plata v. Schwarzenegger and Coleman v. Schwarzenegger The plan would require California to cut 40,000 inmates out of its prison population of 150,000 when the verdict was issued. In an order described by The New York Times as \"scathing\", the panel indicated that the state had failed to follow through on previous orders to improve conditions and that the cuts were needed to deal with overcrowding and poor health care that was causing an unnecessary death each week on average. The panel recommended achieving the cuts by reducing imprisonment of nonviolent offenders and technical parole violators.\nThe state submitted a plan on September 18, 2009, but it the plan failed to meet requirements set by the release order. On October 21, 2009, the court rejected the plan, and gave the government until November 12 to submit a corrected plan or it would order the attorneys for the plaintiffs to submit a plan and order it implemented. The state submitted a revised plan on November 12, 2009, and the plan was accepted and entered as an order of the court on January 12, 2010.\nSupreme Court\nCalifornia appealed the order to the Supreme Court on January 19, 2010, and certiorari was granted on June 14, 2010. It was argued on November 30, 2010. In a bare majority opinion by Justice Anthony Kennedy issued in 2011, the Court affirmed the order. in Brown v. Plata, 131 S. Ct. 1910 (2011).\nSee also\n* Plata v. Schwarzenegger\nReferences\nExternal links\n* [http://www.clearinghouse.net/detail.php?id=573 Coleman v. Brown] case profile, Civil Rights Litigation Clearinghouse\n* [http://www.scotuswiki.com/index.php?title=Schwarzenegger_v._Plata Schwarzenegger v. Plata], Scotus wiki"
    }
  ]
}