{
  "content": [
    {
      "type": "text",
      "text": "# Colin Ware\n\nColin Ware is a professor at the University of New Hampshire, cross-appointed between the Departments of Computer Science and Ocean Engineering. Ware is the director of the Data Visualization Research Lab in the university's Center for Coastal and Ocean Mapping.\nEducation\nWare attended the University of Toronto from 1975 to 1980 and received his PhD in the psychology of perception. He then went on to attend the University of Waterloo in 1983, eventually receiving his MMath degree in computer science in 1985.\nWare's combined interests in basic and applied research alongside his specialization in advanced data visualization led to his involvement in the applications of visualization to ocean mapping.\nHe has experience with the National Research Council (Canada) as a Research Associate (1980-1983), where he researched human color vision. He also has past experience in both teaching and research as a professor of computer science at the University of New Brunswick from 1985 to 2000.\nBooks\nWare has written and published two books. The first, published in 2000, is called Information Visualization: Perception for Design and is now in its fourth edition. 2008 followed Visual Thinking for Design. It describes the psychology of how humans think about using graphics displays as tools.\nCareer\nFrom 1980 to 1983 Ware was a research scientist at the National Research Council in Ottawa. He conducted research into human color vision in collaboration with William Cowan and used an Ikonas, the very first frame-buffer based computer graphics system.  From 1985 to 2000 he was a professor of computer science at the University of New Brunswick working in the fields of human-computer interaction and data visualization.  It was there that he became one of the founding members of the Ocean Mapping Group, together with David Wells and Larry Mayer. In 2000 he moved to the University of New Hampshire to establish the Visualization Research Lab in the Center for Coastal and Ocean Mapping at the University of New Hampshire.\nResearch\nColin Ware's main contribution to the emerging field of data visualization has been to propose that it should be studied as a field of applied human perception which he called experimental semiotics. The key idea is that understanding human perception can provide insights into how data can be portrayed so that it can be interpreted efficiently. He has developed this discipline in more than 150 articles as well as two books [4,5]. In addition to the books he has published studies on the effective use of various visual parameters such as color, texture, stereoscopic viewing and motion.\nWare has made several notable contributions to the field of Human Computer Interaction. In 1993 he developed the concept of “Fish Tank Virtual Reality” to describe a form of virtual reality which is not “immersive”, but rather bounded and contained within the normal working environment. He argued that this mode of viewing allows for a better interactive experience while not blocking access to the rich affordances of the real world. Fish Tank VR allows for the sensation of touch to be simulated using devices such as the Phantom, something which is not possible in immersion VR, except for a localized experience.  He also invented the concept of center of workspace interaction. This is a mode of interaction centered on a point just behind the screen in a 3D fish tank environment.  Navigation is done by means of selecting points or objects which are automatically translated to this central point where they can be examined by scaling or rotation, or they can be manipulated.\nIn additional to work in Data Visualization and Human-Computer Interaction Colin Ware has made contributions to a number of other scientific disciplines.  His work on the kinematics of foraging humpback whales characterized different modes of bubble netting, lunge feeding at depth in Antarctica, and bottom feeding.  The findings relating to bottom feeding are significant because humpbacks were not previously known as bottom feeders yet in the vicinity of Cape Cod animals were spending the majority of their time engaged in this feeding modality.\nWare contributed to ecology with his development of Spherical Space Analysis, a method for characterizing the affordances in interstitial spaces of seaweeds, corals and plants as refuge. This work was done in collaboration with Jenn Dijkstra a marine biologist at the University of New Hampshire. His contributions to Color Science included studies of such phenomena as color contrast, and chromatic Mach Bands.\nVisualization Software and Products\nWare's investigation of navigating in 3D spaces [6], lead ultimately to the development of Fledermaus. This  software package is widely used in the visualization and processing of oceanographic data (ref).  The initial product incorporated software and results from studies carried out by him and his students, especially Mark Paton, relating to 3D interactive visualization. In 1994 Ware, Mayer and Paton, established Interactive Visualization Systems, in order to commercialize the software. Fledermaus is currently owned by Saab Aerospace.\nA second spinoff was Graph Visualizer 3D, developed with students Greg Parker and Glenn Frank. This was a software product designed to look at large networks in 3D. It was applied mostly to software architectures, for example, 30 million lines of code from a Nortel Networks digital switch. A company formed to commercialize this software, called NV3D, ultimately failed.\nThe software system GeoZui4D (Geographic Zooming User Interface in Four Dimensions) was developed with a team led by Ware with key developers Matthew Plumlee and Roland Arsenault.  A significant innovation was the concept of center of workspace interaction whereby selected nodes in the network were automatically brought to the center of the workspace for further interaction.\nIn 2005 Ware developed TrackPlot as a tool for analyzing the kinematics of whale foraging.  This led to a number of discoveries relating to the underwater behavior of humpback whales. In 2015 Ware and Dijkstra developed a new computational metric for the interstitial spaces of seaweeds and showed how this can be applied to the role spatial architecture of habitat and can be applied to predator prey interactions.\nAwards\nIn 2010, Colin Ware received the Award for Excellence in Research from the University of New Hampshire.\nElection to the IEEE VGTC Visualization Academy in 2020.\nReferences"
    }
  ]
}