{
  "content": [
    {
      "type": "text",
      "text": "# Collaborative Drug Discovery\n\n}}\n| founder             =\n| location_city       =\n| location_country    =\n| location            = Burlingame, California, U.S.\n| origins             =\n| area_served         =\n| industry            =\n| products            =\n| revenue             =\n| operating_income    =\n| net_income          =\n| parent              =\n| divisions           =\n| subsid              =\n| owner               =\n| website             =\n| dissolved           =\n| footnotes           =\n}}\nCollaborative Drug Discovery (CDD) is a software company founded in 2004 as a spin-out of Eli Lilly by Barry Bunin, PhD. CDD utilizes a web-based database solution for managing drug discovery data, primarily through the CDD Vault product which is focused around small molecules and associated bio-assay data. In 2021, CDD launched its first commercial data offering, PharmaKB, formerly BioHarmony,  as The Pharma KnowledgeBase, which is centered around pharma company, drug, and disease information for research, business intelligence, and investors.\nProducts\n1. CDD Vault is a research informatics web platform by Collaborative Drug Discovery. It contains several modules for collaborative project teams to manage, analyze, and share both private & public data. It is used by biotech companies, CROs, academic labs, research hospitals, agrochemical and consumer goods companies. CDD Vault is a modern web application for chemical registration, assay data management, and SAR analysis. It is designed to be simple to use and extremely secure.\n{| class=\"wikitable sortable\"\n|-\n! CDD Vault modules\n! Type\n! Description\n|-\n| Registration\n| Chemical registration system\n| Web application within CDD Vault for chemical and biological registration, assay data management, and SAR analysis.\n|-\n|-\n| Activity\n| Experimental data\n| Web application within CDD Vault for managing and analyzing experimental data associated with registered entities, and generating reports.\n|-\n|-\n| Visualization\n| Scientific visualization\n| Web application within CDD Vault allowing plotting and analysis of large data sets to find interesting patterns, activity hotspots, and outliers.\n|-\n|-\n| Assays\n| Bioinformatics\n| Web application within CDD Vault for Assay Informatics to allow for easy registration, search, and systematic comparison of assays using standardized protocols and runtime details.\n|-\n|-\n| ELN\n| Electronic lab notebook\n| Web application within CDD Vault that integrates a full analysis and visualization environment with chemical and biological assay data repositories.\n|-\n|-\n| Inventory\n| Inventory management software\n| Web application integrated within CDD Vault for tracking the supply and location of compounds and reagents.\n|-\n|-\n| Curves\n| Curve fitting\n| Web application integrated within CDD Vault to generate, QC, and analyze results such as IC50, pIC50, EC50.\n|-\n| AI\n| Artificial intelligence in pharmacy\n| Web application within CDD Vault for Artificial Intelligence (AI) capabilities such as identifying similar compounds, synthesizable molecules, bioisosteric suggestions, and patent issues.\n|-\n|-\n| Automation\n| API, Data mapping\n| Web application within CDD Vault to connect data through an API, Parser, and Mapping Tools.\n|-\n|-\n| CDD Public\n| Chemical database\n| Free database also integrated within CDD Vault for fostering open collaboration containing over 3 million molecules accessible to everyone in the drug discovery community.\n|-\n|}\n2. PharmaKB is a knowledgebase for pharma-related information. Available data spans (preclinical, clinical, financial, patents, and post-approval) information about companies, drugs, and diseases. It is designed to be used by researchers, those practicing business intelligence, and investors. PharmaKB also offers real-time updates with a subscription model instead of static reports. As a throwback to CDD Vault's slogan of \"Complexity Simplified\", PharmaKB uses the slogan of \"Data Simplified\" and promotes a data trilogy of Company, Drug, and Disease. The product is meant to expand the company's scope from working with mostly preclinical researchers to being relevant for clinical and post-approval stages of drug development, including: Pharmacovigilance or Drug Safety, Regulatory Affairs, Competitive Intelligence - also referred to as Pharma Intelligence within its industry, and Pharmacoeconomics as well as investors and publishers of medical content.\nCollaborations\nThe capability for inter-group collaboration attracted attention from the Bill & Melinda Gates Foundation, who in 2008 awarded CDD with a two million dollar grant being used to support researchers combating tuberculosis.\nIn 2010, GlaxoSmithKline released 13,471 molecules screened for activity against malaria to the public.  These molecules and their associated screening data are available via CDD Public, as well in as the National Library of Medicine's PubChem and the European Bioinformatics Institute's ChEMBL database. This data has served as the basis for several cheminformatics analyses.\nIn February 2011 CDD began participating in the collaborative MM4TB project led by Stewart Cole and including participants from AstraZeneca and Sanofi Aventis.\nSee also\n*Collaborative software\n*List of electronic laboratory notebook software packages\n*Cheminformatics toolkits\nReferences\nExternal links\n* [http://www.collaborativedrug.com CDD's official homepage for CDD Vault]\n* [https://www.pharmakb.com PharmaKB's homepage]\n* [https://www.biometadata.com CDD's official homepage for BioHarmony]"
    }
  ]
}