{
  "content": [
    {
      "type": "text",
      "text": "# College of Agriculture, Health, and Natural Resources\n\nThe University of Connecticut's College of Agriculture, Health, and Natural Resources (CAHNR) is the oldest of UConn's fourteen colleges, and teaches a wide range of subjects. It is the oldest agricultural school in Connecticut, originally established with two purposes, conducting agriculture research and teaching practical skills to modernize farming. The college describes its mission as working \"toward a global sustainable future.\" To that end, besides conducting research and teaching, the college's faculty also work together with Connecticut communities on projects related to food systems, agriculture, human health, nutrition and physical activity, and environmental science.\nToday the college has academic departments in areas such as the sciences of animals, plants, and nutrition; pathobiology and veterinary science; landscape architecture; resource economics, and others fields.\nthere were 22,522 graduates of the CAHNR. Undergraduates earn Bachelor of Science (B.S.) degrees, with the exception of Environmental Studies (EVST), which leads to a Bachelor of Arts (B.A.). Students at the Ratcliffe Hicks School of Agriculture (RHSA) grants Associate of Applied Sciences (A.A.S.) degrees in Plant Science, Animal Science, and Urban Forestry and Arboriculture. Students from both RHSA and CAHNR take their courses together although the programs are different schools of the university.\nHistory\nThe Morrill Land-Grant Act, passed by Congress in 1862, provided each state with federal land grants. The profits from the sale of these lands were used to establish an agricultural college in each state. In addition, brothers Charles and Augustus Storrs of Mansfield, Connecticut, donated 170 acres of farmland, $6,000, and several barns to create the agricultural school. The brothers were born into a family of farmers and Augustus eventually purchased the family-owned farm to develop into one of his own. The brothers’ passion for agriculture and husbandry led to the establishment of what became the University of Connecticut.\nIn 1881, the Storrs Agricultural School was established solely for the purpose of teaching and researching agriculture and related topics. In 1893, the name was changed to Connecticut Agricultural College and became Connecticut's land-grant university after a battle with Yale University over which school would be granted the public funding for agricultural education. The college was renamed a few more times until permanently becoming the University of Connecticut in 1939.\nWomen first attended classes at the college in 1891, and were allowed to enroll as students in 1893. The first woman forestry major in the United States graduated from the University of Connecticut.\nIn 1956, Frances Osborne Kellogg, an industrialist, dairy farmer and conservationist, made a bequest to the University of Connecticut that was later used to fund construction of the Kellogg Dairy Center on Horsebarn Hill Road in Storrs in 1991. The Kellogg Dairy Center is a free-stall facility accommodating over 100 milking animals (Holstein and Jersey cows). The building has a Voluntary Milking System (VMS; robotic milking system) and robotic feeders, so cows decide when they want to be milked. There is also a laboratory, animal surgery facility, and an area for the public to observe the milking.\nFile:The agricultural experiment stations in the United States (1900) (14595517300).jpg\nFile:The agricultural experiment stations in the United States (1900) (14595721687).jpg\nFile:The agricultural experiment stations in the United States (1900) (14779077411).jpg\nResearch programs\nUConn's agricultural program has been at the forefront of research in a number of scientific areas. UConn scientists sent experimental tomato plants in the Space Shuttle to study plant growth in zero gravity in 1988. Faculty at the school developed the first high-efficiency poultry feed, “Connecticut Ration.” Animal science professor Jerry Yang was the first to clone a calf from non-reproductive cells, a major, if controversial, achievement in stem cell research.\nThe college's research programs are supervised by the Storrs Agricultural Experiment Station and follow federal and state mandates. Faculty and students research how food, natural resources, and human and animal health are interconnected. Today, there are more than 750 UConn Extension public engagement programs at eight centers across the state with over 100,000 participants in their programs. Extension public engagement programs provide a wide range of topics related to the CAHNR strategic priorities: Ensuring a vibrant and sustainable agricultural industry and food supply, enhancing health and well-being locally, nationally, and globally, advancing adaptation and resilience in a changing climate, and designing sustainable landscapes across urban-rural interfaces. The programs obtain over 100 educators and many volunteers. The programs work to build more sustainable communities through educational initiatives. Additionally, there are 36 student clubs and activities that fall under the CAHNR interests.\nNotable alumni\nIn 2020, alumnus Dr. Steven Were Omamo, who graduated with a Masters of Science in 1988, led the World Food Programme to a Nobel Peace Prize in 2020.\nDepartments and areas of study\nUndergraduate students take courses for a variety of majors and minors in agriculture, health, and natural resources through the college's eight academic departments.\n* Dept. of Agricultural & Resource Economics (ARE): focuses on dealing and exploring issues related to the sustainable use of natural resources such as land, water and energy.\n* Dept. of Natural Resources & the Environment (NRE): explores the long-term conservation and sustainability of ecosystem services, including woods, water, and wildlife.\n* Dept. of Plant Science & Landscape Architecture: trains students in how to delve deep into plant biology; enhance the use of plants to solve environmental problems; improve plant health through pest management; plan and design sustainable built environments; develop healthier local foods; promote sustainable recreation areas and agricultural lands, and engage communities for a sustainable future.\n* Dept. of Animal Science: pre-vet/pre-grad, equine science, business management, food science, animal production, and animal biotechnology, all oriented towards giving students experience for animal-related careers.\n* Dept. of Pathobiology and Veterinary Science: undergraduate education is designed for students who intend to enter medical (Pre-Med), dentistry (Pre-Dental), veterinary (Pre-Vet), or graduate institutions. The  MS and Ph.D. graduate degree programs in Pathobiology include areas of focus in bacteriology, pathology, and virology. Students learn skills necessary for research careers focused on infectious diseases of animals and humans, vaccines, veterinary pathology, and wildlife diseases.\n* Allied Health & Sciences (AHS): research and courses on health behavior change interventions, promotion of healthy nutrition, genetics and genomics, clinical and laboratory techniques, and research methodologies for those interested in professional health-related careers.\n* Dept. of Kinesiology: trains future exercise and healthcare professionals through intensive programs including athletic training (M.S.A.T.), exercise science (B.S., M.S., Ph.D.), physical therapy (D.P.T.), and exercise prescription (online MS and Graduate Certificate). The department has association with the Korey Stringer Institute and the Nayden Rehabilitation Clinic and research at the Athletic Training Laboratory and Human Performance Laboratory located in Gampel Pavilion.\n* Dept. of Nutritional Sciences: integrated instruction, research, and outreach programs consisting of teaching and research to improve the nutritional well-being and health for individuals, families and the public. The undergraduate programs in health nutrition follow three tracks of preparation for students to attend medical school and other health-related professions - Nutrition, Health, and Disease Prevention, Didactic Program in Dietetics (DPD), and Pre-Medical Profession.\nReferences"
    }
  ]
}