{
  "content": [
    {
      "type": "text",
      "text": "# College of Agriculture, Bhawanipatna\n\n| address =\n| website =\n| dissolved =\n| footnotes =\n}}\nThe College of Agriculture, Bhawanipatna is one of the three Agriculture College of Odisha established in 2009 under Orissa University of Agriculture and Technology, Bhubaneswar. The college was inaugurated by the Hon’ble Chief Minister Sri. Naveen Patnaik on 7th Feb.2009. It imparts education, research and extension in the field of Agricultural Science.\nAcademics and education\nAcademic year\nThe academic year is divided into two semesters, a spring semester and an autumn semester. Between these two regular semesters, the academic year also includes a shorter summer vacation. The institution follows the credit-based system of performance evaluation. The credits allocated to each course depends on the total number of credit hours, including lectures and laboratory sessions. Each course is usually worth three credits. The typical course load per semester is 21-24 credits for undergraduate students.\nUndergraduate program\nThe college provides 4year bachelor's degree in B.Sc. Agriculture. Every year 56 students are admitted to B.Sc. (Agriculture) course on the basis of their performance and ranking in the Common Entrance Test conducted by OUAT and All India Entrance Test conducted by Indian Council of Agricultural Research, New Delhi. The undergraduate course includes basic subjects on Agricultural Science like Agronomy, Horticulture, Crop Production, plant improvement subjects like Plant Breeding and Genetics, Plant Biotechnology, physical and chemical subjects like Soil Science, Biochemistry, Soil and Water Conservation Engineering, Farm Power and Machinery, Agricultural Meteorology, plant protection subjects like Entomology, Nematology, Plant Pathology, social science in the form of subjects like Agricultural Economics, Agricultural Extension, Statistics and some allied subjects like Animal Husbandry, Post Harvest Management, Food Processing, Agri-Business Management(ABM) etc.\nInfrastructure\nCollege Campus\nCAB has its own academic and administrative units at Bhawanipatna campus of OUAT. It has all the infrastructure facilities to cater the need of all level of students and researchers. It has four lecture halls for four batches, seminar hall, and a large examination hall with a seating capacity of more than 250.\nIt has its own library and has access to OUAT central library.\nThe college is equipped with modern laboratory facilities to meet the challenge and the need of the Government and Industries. The college has well equipped laboratories for improved crop production, plant breeding, plant pathology laboratory, entomology and nematology lab, soil science and agricultural chemistry lab, seed testing and processing, farm machinery, farm power, soil and water conservation engineering, irrigation equipment, agricultural processing, food processing and food technology laboratory.\nThere is a practical land for crop production for agronomy and horticulture of an area about one acre. In this practical field the students perform field operations and learn about crop production and its parameters practically which is one of its kind in the whole university.\nThere is a large play ground in the campus where the students play different games and sports.\nThe college has a computer center. The computer center has a group of network micros equipped with high-speed printers, scanners & plotters and has dedicated broadband system for 24-hour internet and e-mail facility. The main objectives of the computer center are to impart computer knowledge among students and faculties and to obtain statistical, scientific and simulation packages through national and international linkages to cater the educational needs of Agriculture sector. Besides this there is provision of 24/7 high speed WiFi service in the college campus.\nThe college has an auditorium with a seating capacity of more than 300. It also has a big centrally air-conditioned conference hall with all kind of modern audio-visual tools and a computer. The college provides separate hostels to boys and girls with provision of 24/7 water, electricity. All the rooms are well equipped with electricity, light and ventilation systems.\nHostel and Housing\nHostel facilities to students have been provided through two separate 100 capacity hostels for both boys and girls. The institute has two hostels at its permanent campus, Bhawani Shankar Gents' Hostel for boys and Manikeshwari Ladies' Hostel for girls. The institute has also provided housing facilities to its faculty and staff at the campus.\nHealth Care\nA well equipped healthcare facility for faculty and students is under construction.\nConnectivity\nThe Odisha state government has constructed a two-lane state highway directly from the National Highway No. 26 through this institute. Bhawanipatna railway station is 3&nbsp;km away from the campus, and another railway station Kesinga is 35&nbsp;km away.\nStudent life and culture\nFestivals\n*HOLI and DIWALI: The students and staffs of the institute celebrate holi and diwali very lavishly together in the campus. At both the hostels and at college campus they celebrate the two major festival of India.\n*GANESH PUJA & SARASWATI PUJA: These two festivals are life of CAB. The festivals are celebrated at the college building itself and a delicious feast is conducted for all.\n*NEW YEARS DAY: Every year on December 31 zero night is celebrated the whole night and the members of CAB family welcome the new year together with dance, music and food.\nPicnic and Study Tour\nThe students of different batches of CAB go to different picnic spots nearby (within 200&nbsp;km) every year during the winter. There is provision of study tour program for 2nd and 3rd year students during their semester breaks. They go to different parts of north and south India during this educational tour and get a chance to visit many tourist destinations of India as well as different agriculture universities and research stations.\nStudents' Union\nIn OUAT there is no election is conducted for Students' Union posts. Rather there is a much better and peaceful way for appointing Students' Union posts. The candidates are selected batch wise for different posts by mutual understanding among students and professors and based on eligibility and skills. Every year the Students' Union conducts various programs and competitions in the college.\nExtracurricular activities\n*Cultural Programs: Every year Dramatic Society of CAB conducts different competitions and programs. The cultural fest of CAB is known as SPANDAN. In SPANDAN it includes song competitions, batch wise dramatics competitions, mono action competition, dance competitions, instrumental competitions, ramp walk and antakshyari.\n*Sports and Games: Athletico de CAB is the annual sports meet held in CAB. It includes different sports and athletic competitions. Students of this college have been attending sports and athletics meets at different university and national levels. Rakesh Behera, student of this college has attended national level athletics meet in 2014 and 2015.\nEvery year PMCT (Purnachandra Memorial Cricket Tournament) is organised by the students since 2010, which is a batch wise cricket tournament. In addition to this CPL(CAB Premier League), volleyball tournament, chess tournament, kabbadi league etc. are being organised in the institute.\n*Literary Activities: The literary society of CAB organizes different literary competitions like essay writing, poem and story writing, debate, quiz, painting competition, rangoli etc. BHASWATEE is the annual magazine of CAB which is published under the execution of Mr. Uttam Kumar Behera, (Asst. Prof.) as the editor. CAB has produced many talented actors and actress in Odisha.\nANEMONE\nANEMONE is the annual commemoration day of CAB. It is being chaired by the Associate Dean of this institution, Prof. R.K. Patnaik. Many eminent personalities attend the function as guests and speakers.\nKrushi Mela\nKrushi Mela is a program being organised by the institution for the rural farmers and personnel associated with agriculture. The main purpose is to make available the new and latest knowledge, technologies and research outcomes related to the farmers and farm community.\nReferences\nExternal links\n*[https://web.archive.org/web/20080419131913/http://ouat.ac.in/ Orissa University of Agriculture and Technology website]\n*[http://ouatcab.ac.in College of Agriculture, OUAT, Bhawanipatna website]\n*[http://www.facebook.com/cabpt.ouat CAB Facebook page]"
    }
  ]
}