{
  "content": [
    {
      "type": "text",
      "text": "# College of Agriculture, Pune\n\n}}\n}}\nThe College of Agriculture, Pune is a college for studies and research in the field of Agriculture situated in Pune, India. It is constituent college of Mahatma Phule Krishi Vidyapeeth.\nHistory\nThe Department of Agriculture was established at the center in 1877 followed by setting of similar departments by the provinces. Mahatma Jyotiba Phule, the noted thinker, social reformer and agriculturist of Pune appealed, persuaded and convinced the British Government to set up institutions for agricultural education and research in India. This led to the opening of a branch for teaching agriculture in the College of Science at Pune in 1879 that was subsequently developed into a separate College of Agriculture in 1908. The main building with its grand dome and entrance hall for teaching and research in Agriculture, Botany, Mycology and Economics was ready in 1911 and was inaugurated by Lord Sydenham, the Governor of Bombay. It was here that the Mahatma Phule Krishi Vidyapeeth was formed, which was later shifted to Rahuri.\nInitially three year diploma of the Bombay University was offered. In 1899 a degree course leading to Licentiate in Agriculture (L.Ag.) was started. The Bombay University in the year 1909 further extended the scope of these studies, raised the standards and instituted the degree of Bachelor of Agriculture (B.Ag.). Its nomenclature was changed to Bachelor of Science in agriculture (B.Sc. Agri.) and the first batch of graduates with this degree passed out in 1937.\nIn 1969, the college was transferred to the Mahatma Phule Krishi Vidyapeeth, Rahuri established in that year. The B.Sc.(Hort.) and PG programme was started in the year 1984 and 1985 respectively. The MBM (Agri.) programme was started in the year 2008.\nTimeline\n*1899 : Bombay University started Licentiate in Agriculture (L.Ag.) Degree Course\n*1905 : A fine site of 150 acres of farm land selected close to the College of Science\n*1907 : College was housed temporarily in the building at Kirkee\n*1908 : Starting of separate College of Agriculture on 1 January 1908, and degree course of Bachelor of Agriculture (B.Ag.)\n*1909 : Degree course of Bachelor of Agriculture (B.Ag.) recognized by Bombay University. The construction of laboratory block completed where the Chemistry Section is now housed.\n*1911 : Construction work of main imposing building of the college was completed\n*1916 : Post – Graduate Degree course of Master of Agriculture (M.Ag.) was started\n*1934 : The nomenclature of B.Ag. Degree was changed to Bachelor of Science in Agriculture B.Sc.(Agri.) degree\n*1937 : First Batch of B.Sc. (Agri.) degree programme was passed out from the College of Agriculture Pune\n*1948 : The college of Agriculture affiliated to the Poona University\n*1950 : Four year degree programme after matriculation was started\n*1959 : Four year degree course in Agriculture was started after Pre-degree University Examination of Pune University\n*1968 : The college was affiliated to the Maharashtra Agricultural University\n*1969 : The college was constituent college of the Mahatma Phule Krishi Vidyapeeth\n*1972 : Trimester System of education was started.\n*1976 : Semester system of education was started.\n*1980 : First batch of semester system obtained B.Sc. (Agri.) degree.\n*1983 : The RAWE programme was started in the VII semester of degree course.\n*1985 : Commencement of Postgraduate Degree Programme\n*2000 : Establishment of Hi-Tech Vegetable & Floriculture Project\n*2007 : Introduction of new syllabus & inclusion of hands-on-training and experiential learning programme in the final year of degree course.\n*2008 : Commencement of MBA in Agriculture. Establishment of Biotechnology and Bio-control Laboratories.\nReferences\nExternal links\n* [https://www.acpune.in/ Official Website]"
    }
  ]
}