{
  "content": [
    {
      "type": "text",
      "text": "# Collegium Nobilium (Jesuit), Warsaw\n\n| other_name    = Collegium Nobilium\n| image         = Bellotto New Town Market Square.jpg\n| image_size    = 300px\n| caption       = Bellotto's 1770 New Town Market Sq. Warsaw with the Collegium Nobilium at right\n| motto         =\n| mottoeng      =\n| type          = Roman Catholic college for boys of the nobility\n| established   =\n| closed        = 1777\n| religious_affiliation      = Roman Catholic (Jesuit)\n| president     =\n| head_label    =\n| head          =  Jan Ciecierski SJ, Karol Wyrwicz SJ\n| r_head_label  =\n| r_head        =\n| chair_label   =\n| chair         =\n| founders      = Maciej Grabowski, Jan Ciecierski SJ\n| specialist    =\n| address       = Collegium Nobilium, Market Square, Warsaw New Town, Poland\n| city          = Warsaw\n| county        =\n| country       = Lithuanian-Polish commonwealth\n| postcode      =\n| staff         =\n| students      =\n| free_label    =\n| free          =\n| free_label2   = Patron saint\n| free2         =\n| colours       =\n| website       =\n}}\nThe Collegium Nobilium was a Jesuit foundation in Warsaw between 1752 and 1777. It was intended to provide an élite education for the sons of Magnates of Poland and Lithuania, and other leading Szlachta families, likely to run the country or represent it abroad. It is sometimes confused with another longer established educational institution with the same name, run by the Piarists order in the capital.\nHistory\nThe Society of Jesus had an educational presence in the Polish–Lithuanian Commonwealth going back to the 16th-century, at Collegium Hosianum (1568). With the Polish Enlightenment and a changing political environment, the order had seen the urgency of preparing youth for the future and planned a school in the capital since 1737, but did not possess the funds to bring it to fruition. Not until the intervention of Jan Ciecierski SJ (1721–1760) with Maciej Grabowski, Crown Treasurer, did a sufficient legacy become available, with his death in 1750. In 1752 the school opened first in the Winkler building in the Old town with 24 pupils. When the college moved in 1754-5 to bigger premises in the Kotowski Palace, in the New Town, it was able to accommodate an annual roll of 60. Under the skilled management of rector, Karol Wyrwicz SJ, (1760–1777) and the patronage of king Stanisław August Poniatowski, the teaching programme continued four years beyond the suppression of the Society of Jesus, until 1777, when its funding was abruptly diverted and it closed its doors.\nCharacter of the college\nInitially staffing was mainly drawn on the Lithuanian province of the order, where the teachers were highly educated. With the shutting down of Jesuit schools across Europe in 1763, Lithuania and Poland benefited from many refugee schoolmasters. There were notably, 26 Frenchmen, of whom four came to the college in Warsaw. Others came from German and Italian lands, and all had a tradition of disciplined learning. They included:\n* John Baptist Albertrandi SJ\n* François Bessat SJ\n* Franciszek Bieńkowski SJ\n* Franciszek Bohomolec SJ\n* Andrzej Bromirski SJ\n* Joseph Courrière SJ\n* Franz Katenbring SJ\n* Franciszek Kniażewicz SJ\n* Stefan Łuskina SJ\n* Ignacy Nagurczewski SJ\n* Adam Naruszewicz SJ\n* Kazimierz Naruszewicz SJ\n* Józef Olędzki SJ\n* Franciszek Paprocki SJ\n* Alexandre Rostand SJ\n* Stanisław Szadurski SJ\n* Jan Szczepan Wulfers SJ\n* .\nThe emphasis in Warsaw was to step up a gear from the usual Jesuit programme. French and German were taught by native speakers. Subjects ranged from elocution in various tongues, logic, rhetoric and philosophy to the sciences, history, geography, and extraordinary subjects, such as drawing, architecture and theatre. This amounted to hothousing the students from aristocratic and noble houses such as: the Radziwiłł, Łubieński, Ossoliński, Tyszkiewicz, Chłapowski, Ożarowski, Rzewuski and Ogiński families.\nAccording to the contemporary Jesuit historian, Ludwik Piechnik, writing in 1971:\nAlumni\nAmong its notable alumni were:\n* Feliks Łubieński, the justice minister who introduced the Napoleonic Code into the Duchy of Warsaw.\n* Józef Maksymilian Ossoliński, a leading figure of the Enlightenment, lexicographer and founder of the Ossolinski Institute in Lwów.\n* Ignacy Działyński (1754–1797) military officer, participant in the Warsaw Uprising of 1794.\n*  a poet, politician and Polish ambassador to the Court of Denmark.\n* Ignacy Tański (1761&nbsp;– 1805) an official, playwright, poet, translator and freemason.\nReferences\nBibliography\n* Encyklopedia wiedzy o jezuitach na ziemiach Polski i Litwy, 1564–1995, opracował Ludwik Grzebień, Kraków 2004, p.&nbsp;721. (in Polish)\nExternal links"
    }
  ]
}