{
  "content": [
    {
      "type": "text",
      "text": "# Collapse Under the Empire\n\n}}\n| current_members =\n* Martin Grimm\n* Chris Burda\n| past_members    =\n}}\nCollapse Under The Empire is a German instrumental post-rock duo from Hamburg. Founded in 2008, the group consists of Chris Burda and Martin Grimm. They have released nine studio albums and a number of EPs and singles.\nHistory\nChris Burda and Martin Grimm met in 2008 in Hamburg. Adopting the name Collapse Under the Empire, they issued the EP Paintball the same year.\nTheir debut full-length album, Systembreakdown, was released independently in 2009. A year later, its successor, Find a Place to be Safe, came out on Sister Jack Records. Magazines such as Q, Clash, and Rock Sound praised the band's cinematic sound.\nThe duo followed up with The Sirens Sound and shortly after, the split EP Black Moon Empire, in collaboration with the Russian band Mooncake. They also contributed the track \"Anthem of 44\" to the Emo Diaries compilation I Love You But in the End I Will Destroy You.\nThe band's fourth album, Shoulder & Giants, was released in 2011 and was the first part of a concept series, followed by Sacrifice & Isolation in 2014. Shoulders & Giants received positive reviews. Visions magazine praised the \"beyond all doubt, crystal clear production\" and called it a \"compelling and captivating album\". The music review website Plattentests.de highlighted the \"imaginative arrangements\" and \"cinematic clouds of sound\" and awarded it 8/10.\nIn September 2012, Collapse Under the Empire released their fifth album, Fragments of a Prayer, on their own, newly founded label, Finaltune Records. It was selected as album of the month by both Zillo and Sonic Seducer. The following year, the six-track EP The Silent Cry came out. It was selected by Eclipsed magazine for their top 50 releases of the year 2013.\nIn October 2017, the band released their seventh album, The Fallen Ones, and followed it with the compilation The End of Something a year later. Their next record, Everything We Will Leave Beyond Us, came out on 20 November 2020. It was again voted album of the month by Sonic Seducer. In 2023, the duo published their ninth album, titled Recurring.\nMusical style\nCollapse Under the Empire play instrumental post-rock that incorporates influences from other genres, such as trip hop, shoegazing, synthpop, and progressive rock. Their musical style has been compared to bands like 65daysofstatic and God Is an Astronaut.\nDiscography\nStudio albums\n* Systembreakdown (2009)\n* Find a Place to Be Safe (2010)\n* The Sirens Sound (2010)\n* Shoulders & Giants (2011)\n* Fragments of a Prayer (2012)\n* Sacrifice & Isolation (2014)\n* The Fallen Ones (2017)\n* Everything We Will Leave Beyond Us (2020)\n* Recurring (2023)\nEPs\n* Paintball (2008)\n* Black Moon Empire (2011, split with Mooncake)\n* The Silent Cry (2013)\n* Collapse Under the Empire vs. Cato – The Remixes (2015)\n* Section IV–VI (2021)\nCompilations\n* The End of Something (2019)\nSingles\n* \"Crawling\" (2009)\n* \"Grade Separation\" (2010)\n* \"Anthem of 44\" (2010)\n* \"Black Moon Empire\" (2011)\n* \"The Silent Death\" (2011)\n* \"Disclosure / The Great Silence\" (2011)\n* \"There's No Sky\" (2011)\n* \"Dragonfly\" (2012)\n* \"Closer\" 2012\n* \"Breaking the Light\" (2012)\n* \"Stjarna\" (2013, Depeche Mode cover)\n* \"We Are Close as This\" (2013)\n* \"Lost\" 2014 (Charity Single)\n* \"Sacrifice / Low\" (2014)\n* \"Stairs to the Redemption\" 2014\n* \"Giants (live)\" (2016)\n* \"Dark Water\" (2017)\n* \"The Forbidden Spark\" (2017)\n* \"Anomaly\" (2018)\n* \"Abstracted\" (2019)\n* \"Beyond Us\" (2019)\n* \"A New Beginning\" (2020)\n* \"Red Rain\" (2020)\n* \"Section IV\" (2021)\n* \"Section V\" (2021)\n* \"Section VI\" (2021)\n* \"Section I\" (2022)\n* \"Revelation\" (2023)\n* \"Forgiveness\" (2023)\nReferences\nExternal links\n*\n*"
    }
  ]
}