{
  "content": [
    {
      "type": "text",
      "text": "# College of advanced technology (United Kingdom)__disambig_1\n\nA college of advanced technology (CAT) was a type of higher education institution established in 1956 in England and Wales following the publication of a government white paper on technical education which listed 24 technical colleges in receipt of 75% grant for parts of their advanced work.\nThe government confirmed that the proportion of advanced work at these colleges should be increased so that they could develop as quickly as possible into colleges of advanced technology. Eventually ten of the 24 were confirmed as CATs. Birmingham College of Advanced Technology was the first to be so designated, in 1956.\nOriginally under the control of local education authorities, on 1 April 1962 the CATs were removed from local authority control and became autonomous national institutions funded directly by the Ministry of Education. Following the Robbins Report of 1963, the colleges of advanced technology were expanded and awarded university status in 1966, sometimes grouped together with other 1960s \"plate glass universities\".\nThe colleges\nThe ten CATs and the universities they became were:\n*Birmingham CAT became Aston University (the first designated college of advanced technology)\n*Loughborough CAT became Loughborough University of Technology (afterwards Loughborough University)\n*Northampton CAT (London) became City University (now City, University of London)\n*Chelsea CAT became Chelsea College of Science and Technology as part of the University of London, then later was subsumed into King's College London\n*Battersea CAT became the University of Surrey\n*Brunel CAT became Brunel University (now Brunel University of London)\n*Bristol CAT became the Bath University of Technology in 1966 (afterwards University of Bath)\n*Welsh CAT (in Cardiff) became the University of Wales Institute of Science and Technology (UWIST) before merging with other institutions to become part of Cardiff University\n*Salford CAT (the Royal College of Advanced Technology) became the University of Salford\n*Bradford Institute of Technology became the University of Bradford\nIn Scotland\nAlthough CATs did not formally exist in Scotland, the same policy of former technical colleges that already delivered degree-level education being elevated to university status also took place north of the border in the 1960s. Notable examples were the Royal College of Science and Technology in Glasgow becoming the University of Strathclyde in 1964, Heriot-Watt College in Edinburgh becoming Heriot-Watt University in 1966, and, to a lesser extent, the former Queen's College, Dundee (a constituent of the University of St Andrews) becoming the University of Dundee in 1967.\nSee also\n* Polytechnic (United Kingdom)\nReferences"
    }
  ]
}