{
  "content": [
    {
      "type": "text",
      "text": "# Colonial League\n\nThe Colonial League is an athletic conference consisting of 14 high schools mostly from the Lehigh Valley portion of eastern Pennsylvania. It is part of District XI of the Pennsylvania Interscholastic Athletic Association. The Colonial League is designed for mid and small-size schools in the Lehigh Valley. The largest 18 schools in the Lehigh Valley and Pocono region compete in the Eastern Pennsylvania Conference, one of the premiere athletic divisions in the nation.\nHistory\nIn 1975, ten schools from the Lehigh Valley region of eastern Pennsylvania merged to form the Colonial League. Since then, a total of seven teams have joined the league, with two teams leaving.\nCharter members\nThe Colonial League was founded in 1975, with the following ten school teams as charter members:\n*Bangor Area High School\n*Catasauqua High School\n*Nazareth Area High School\n*Palisades High School\n*Palmerton Area High School\n*Pen Argyl Area High School\n*Salisbury High School\n*Saucon Valley High School\n*Southern Lehigh High School\n*Wilson Area High School\nPrior to the 1975-76 school year, most of these schools were part of the Lehigh-Northampton League (L-N) for interscholastic activities. (Catasauqua was in the Lehigh Valley League aka the LVL, and Palisades had competed as an independent.) As years went on, the member schools of the LVL and L-N began to vary greatly in school sizes and athletic competition levels.. Some smaller schools of each league broke away and formed the Colonial League while others became members of the Centennial League. Some joined the East Penn Conference (an ancestor of the modern Eastern Pennsylvania Conference), which includes the Lehigh Valley's largest high schools and a very high level of athletic competition.\n1994 membership additions and departure\nIn 1994, four high school athletic programs, Northern Lehigh High School, Northwestern Lehigh High School, Notre Dame (Green Pond) High School, and Notre Dame High School in East Stroudsburg, joined the Colonial League, and one school, Nazareth Area High School in Nazareth, departed the league to begin competing with larger high schools in the Mountain Valley Conference, and subsequently joined the Lehigh Valley Conference and Eastern Pennsylvania Conference.\n2014 addition and departure\nIn 2014, Moravian Academy in Bethlehem joined the Colonial League and Notre Dame High School in East Stroudsburg, departed it.\n2024 additions\nIn early 2023, Lehighton Area High School was approved for membership, and Jim Thorpe Area High School soon followed. They began competition in the 2024-25 school year.\nSee also\n*Eastern Pennsylvania Conference\n*Mountain Valley Conference\n*PIAA District 11\nReferences\nExternal links\n*[https://home.colonialleague.org/ Official website]"
    }
  ]
}