{
  "content": [
    {
      "type": "text",
      "text": "# Colonial Theatre (Phoenixville, Pennsylvania)\n\n| building_type    = Theater\n}}\nThe Colonial Theatre is located in Phoenixville, Pennsylvania, at 227 Bridge Street. Built in 1903, the \"Colonial Opera House\" became a preeminent venue for movies, traveling shows and live entertainment throughout the 20th century. The three-screen venue consists of the original 658-seat ‘vaudeville house’ and two newer additional theatres in the adjacent National Bank of Phoenixville building.\nHistory\nThe Colonial Theatre, located in Phoenixville, Pennsylvania, was originally constructed in 1902 and opened its doors on September 5, 1903, as the \"Colonial Opera House.\" Designed in the Beaux-Arts style by architect Harry Brownback, the venue initially hosted live stage performances, vaudeville acts, and musicals. The inaugural stage production was \"The Beauty Doctor,\" starring Fred E. Wright. In 1915, silent film star Mary Pickford visited the theatre, and in 1917, famed illusionist Harry Houdini performed, escaping from a burglar-proof safe before an audience of 300.\nBy December 1903, the Colonial began screening silent films, typically accompanied by live piano music. In 1917, a Wurlitzer organ was installed to enhance the cinematic experience, often used for recitals preceding newsreels. The theatre continued to showcase silent films until 1928, when it presented its first \"talkie,\" The Jazz Singer, marking the transition to sound films.\nThroughout the mid-20th century, the Colonial served as a central entertainment hub for Phoenixville, adapting to the evolving landscape of cinema and live performances. However, the rise of multi-screen movie theaters in the 1980s and 1990s led to a decline in its popularity. The building changed ownership multiple times but maintained its dual function as a movie house and live performance venue. In the mid-1990s, a local restoration group recognized the theatre's historical significance and initiated efforts to preserve it. The Association for the Colonial Theatre (ACT), a nonprofit organization, purchased the theatre on December 8, 1996, and reopened it on October 1, 1999, featuring children's programs, art, independent, and classic films.\nPipe organs\nIn 1917, a Wurlitzer organ was installed and used mostly for recitals before news reels. A restored 1929 Kimball pipe organ was installed in the theatre in 1975. Famous organist, Larry Ferrari, once played the organ, calling it a \"magnificent instrument.\" In 2005, the Kimball organ was sold to the Chicago Historical Society and replaced with a Wurlitzer (Opus 585) pipe organ, which was originally installed in Shea's Hippodrome Theatre in Buffalo, New York in 1922.  After years of restoration work by The Theatre Organ Society of the Delaware Valley, the first concert with the refurbished Wurlitzer organ was held at The Colonial on September 15, 2012.\nThe Blob\nIn 1958, the classic science fiction movie, The Blob,  starring Steve McQueen, was filmed in Phoenixville, Downingtown, Chester Springs, and Royersford. The Colonial Theatre was featured in a pivotal scene of the movie as the creature starts to attack the town. A commemorative plaque is located on the rear wall of the balcony in honor of the film's projection-room scene, in which The Blob oozes through the projection openings. The plaque reads:''\"Through this wall in the year 1958 Shorty Yeaoworth's THE BLOB brought the monster into the movie theater and Phoniexville's COLONIALTHEATRE into the annals of film history.\"The nearby Downingtown Diner, the location of the final scene, is also currently in operation. In 1978, the Colonial Theatre made a cameo appearance in the movie, Grease, when the trailer of The Blob was shown in the drive-in movie scene.\n\"Blobfest\" is an annual 3-day event each summer, started in 2000, held in downtown Phoenixville that features multiple screenings of The Blob'' and other horror films. A film competition, scream contest, street fair, and live entertainment are scheduled throughout the weekend. A major part of the festival is a live reenactment of the famous scene filmed at the Colonial, showing screaming movie patrons fleeing through the front doors of the theater.\nThe 2024 Blobfest marked its 25th anniversary with expanded festivities. Notably, two \"run-out\" reenactments were held—one on Friday night and another on Saturday night. The Saturday event featured a special appearance by an original cast member who participated in the 1957 filming and reprised their role in the reenactment.\n2016 restoration and expansion\n(left) performing at The Colonial in 2025]]\nThe Colonial is the last remaining classic theatre in Phoenixville and all of Chester County. A local group, recognizing the Colonial's historical significance, created the Association for the Colonial Theatre (ACT), a nonprofit corporation committed to the full restoration of The Colonial as a cultural arts center. ACT purchased the theatre on December 8, 1996 and it reopened on October 1, 1999, featuring children's programs, art, and independent and classic films.\nOn April 4, 2016, a symbolic groundbreaking ceremony was held in front of the theatre, commencing an $8 million expansion and renovation project that served to connect The Colonial with its neighboring building, The National Bank of Phoenixville. The 1925 bank was purchased by ACT in 2011 with the intent of renovating it to provide two additional movie theatres and improved amenities for the theatre, while preserving the historic architecture of the bank building.\nThe Colonial's expansion opened for business on May 12, 2017. A ribbon-cutting ceremony with the Phoenixville Chamber of Commerce was held on May 17, 2017. The new wing offers a 174-retractable seat stadium-style theatre, an intimate 65-seat screening room-style theatre, and a lobby that showcases a baby grand piano and a  concession stand. The expansion also offers dressing rooms for performers, a concession stand for special events, a catering kitchen, and a second floor garden suite with outside deck access.\nCurrent programming includes a variety of film genres including: first-run, independent, and classic, along with concerts, community events, The theater is also available for rent for private events.\nReferences\nExternal links\n* [http://www.thecolonialtheatre.com The Colonial Theatre]\n* [http://bankonthearts.org/ Bankonthearts.org]"
    }
  ]
}