{
  "content": [
    {
      "type": "text",
      "text": "# Colonial police action against the people of Haida Gwaii\n\n}}\nVarious Imperial and colonial actions against Haida Gwaii Authorities have been undertaken since the 19th century. The indigenous peoples of Haida Gwaii often reacted violently to European and American ships which trespassed in their waters and lands. From the 18th to 19th centuries, various skirmishes took place between Haida authorities and European and American merchantmen and warships. Canadian settlers did not arrive on Haida Gwaii islands until 1900, and many Canadian colonial police actions attempted to assault the Haida Gwaii authorities and citizens. The indigenous Haida population was decimated by diseases such as smallpox which were introduced accidentally by way of Fort Victoria. The presence of foreign diseases, to which the Haida had no immunity, along with some colonial hostility, meant that the numbers of Haida citizens was reduced from tens of thousands to 588 by 1915. This erosion of Haida cultural institutions was essential to open the way for subsequent British and Canadian incursions and jurisdictional claims.\nBackground\nHaida Gwaii\nAn archipelago of some 150 islands located inside the territorial waters of Canada and comprising the largest land mass of the territories of the Haida Indigenous Peoples. These territories also extend up into what is now known as the Alaskan panhandle.\nCumshewa Haida\nCumshewa is an important hereditary leader of the Haida people of Haida Gwaii on the North Coast of British Columbia, Canada. As of December 2, 2021 Gitkinjuaas Ronald Wilson of St'awaas X̲aaydaG̲aay holds authority over this title.  His name is believed to be of either Kwak'wala or Heiltsuk (Bella Bella) origin, meaning \"rich at the mouth of the river\". He is mentioned by Captain George Dixon who traded with him in 1787. In 1794 Cumshewa and his warriors killed the crew of the American vessel Resolution. Cumshewa is commemorated on the map of the archipelago by Cumshewa Inlet, Cumshewa Mountain, Cumshewa Head (a point), Cumshewa Island, the Cumshewa Rocks and the modern First Nations locality of Cumshewa. In Haida language the name Gitkinjuaas is shared with the easternmost mountain on the north shore at the mouth of Cumshewa Inlet. The name translates \"Mountain Person of High Standing\"\nKaigani Haida\nThe Kaigani Haida live in Haida territories lying north of the Canadian and US border which cuts through the Dixon Entrance on Prince of Wales Island () in Southeast Alaska, United States. This region is part of the historical territories of the Haida Nation.\nKunghit Haida\nThe people of SG̱ang Gwaay llnagaay are sometimes referred to as the Kunghit Haida, now known as Ninstints. The Kunghit Haida occupied the southern portion of the archipelago of Haida Gwaii, with territory stretching from Lyell Island to the farthest southern tip of the archipelago. They had approximately two dozen permanent villages, as well as numerous other smaller seasonal settlements located near major resource areas.  SG̱ang Gwaay Llanagaay was the location of several notable episodes in the early history of European contact and trade with the Haida. At the outset of the maritime fur trade, the village was visited in 1787 by George Dixon, who noted the Haidas who met them at sea were eager to trade with sea otter fur. This marked the initially amicable trade relations, where SG̱ang Gwaay Llanagaay was visited once again in 1788 by Charles Duncan, and twice in 1789 – first by Robert Gray then by his partner John Kendrick later that year, at which point the trade relationship turned hostile.\nSkidegate Haida\nSkidegate is a Haida community in  (formerly the Queen Charlotte Islands) in British Columbia, Canada. It is located on the southeast coast of Graham Island some 30 miles off the mainland coast of Canada.\nMasset Haida\nHaida historian Henry Geddes shares that the name Masset was a gift exchange between Captain and Crew of a Spanish ship rescued and repaired by the leadership of the Haida villages which now comprise the village of Masset and Old Massett Village reserve. This event preceded the arrival of British vessels.\nCaptain Douglas, on his second visit from Nootka Sound aboard the Iphigenia on June 19, 1789, named the bay leading to the inlet ''McIntyre's Bay. This name was used on the charts of Dixon and Meares. The American traders called the inlet, Hancock's River'' as shown in Ingraham's chart of 1792 after the American brig Hancock. In 1853 H.N. Knox of the Royal Navy, mate on , did a sketch survey of the harbour when the name Masset was adopted by the British. A survey was made in 1907 by Captain Learmouth on HMS Egeria. Masset is a contemporary conglomerate of four historically separate communities: Gad Gaayiwaas, Iit'aaw, Tsajughl, and Kaayang.\nIncidents of Haida and foreign naval conflicts\nA list of some of the incidents of violence between the Haida and European adventurers took place with Europeans following the first initial peaceful encounters between Haida and Spanish. There are no notes of any conflict between Spanish and Haida.\n{| class=\"wikitable sortable\" style=\"font-size: 100%;\"\n|-\n!Year\n!Ship\n!Ship Notes\n!Captain\n!Company\n!Nationality\n! class=\"unsortable\"|Notes\n|-\n|1861\n|\n|Albacore-class\n|\n|Royal Navy\n|British\n|In 1861 a party of Haida traders were plying their wares in the vicinity of Fort Victoria when there was allegations of theft by a British citizen.  set sail and pursued the traders as they returned to Haida Gwaii. On Cape Mudge on 17 May 1861, they caught up with the traders, and in the ensuing fight four Haida and one Englishman were killed.\n|-\n|1853\n|Virago\n|Steam-sloop\n|\n|Royal Navy\n|British\n|Kunghit Haida authorities attempt to seize the ship's two long-boats with crew on July 20.\n|-\n|1853\n|Vancouver\n|184T\n|\n|HBC\n|British\n|Flounders on Rose Spit and destroyed by English crew to avoid seizure by Haida.\n|-\n|1852\n|Susan Sturgis\n|Schooner\n|\n|\n|American\n| Susan Sturgis, which in 1852 was transiting the territories of various First Nations and at Skidegate provided transportation to Chief Edenshaw, who in turn provided piloting and interpreting services. After anchoring in Masset waters business commenced and according to Nangiilagadaa Siigaa (ranking Haida officer from Masset) a Haida citizen was killed and the vessel was immediately boarded by the Masset Haida. Albert E Edenshaw pacified the situation. Word reached Chief Trader John Work at Fort Simpson in ten days. Work arrived to negotiate the release of Susan Sturgis' crew at the rate of $250 each for captain and mate, and $30 for each of the men (i.e. at the dollar equivalent in blankets). The vessel could not be saved because the Masset authorities had seized and destroyed her. A year later the British ship  came to establish British jurisdiction. However Captain Prevost couldn't prove that anyone present had taken part in the seizure of Susan Sturgis nor was he willing to engage in further conflict.\n|-\n|1851\n|Georgiana\n|Sloop\n|\n|\n|American\n|Founders off Cumshewa Inlet. Ship is seized by Haida and crew and passengers released for compensation.\n|-\n|1834\n|Vanoucver\n|Schooner\n|\n|HBC\n|British\n|Beached on Rose Spit is seized by Haida authorities on March 3.\n|-\n|1821\n|Hamilton\n|232T\n|\n|\n|American\n|Fired into Skidegate village with the deaths of at least three citizens following the Haida's policing action on the ship's trespassing shore party.\n|-\n|1815\n|Constantin\n|Sloop\n|\n|\n|Russian\n|Haida attempt to capture the vessel at Kaigani.\n|-\n|1806\n|Vancouver\n|285T\n|\n|\n|American\n|An attempt by the Skidegate Haida to seize the vessel fails.\n|-\n|1806\n|Lydia\n|Brig\n|\n|\n|American\n|Six Masset Haida citizens are held hostage for a ransom in furs paid. The ship attests that they fired on the innocent village in response to the actions of the Kaigani Haida at Kasaan a few days earlier and over a hundred miles away.\n|-\n|1802\n|Hetty\n|\n|\n|\n|American\n|Seize Haida authorities as hostage during trade.\n|-\n|1801\n|Globe\n|\n|\n|\n|American\n|Captain killed by the Skidgate in October.\n|-\n|1799\n|Eliza\n|\n|\n|J & J. H. Perkins\n|American\n|Scotseye, a Cumshewa chief and his brother are delivered to the Kaigani for execution under Haida law.\n|-\n|1799\n|Cheerful\n|\n|\n|Macao\n|British\n|Trespassing shore party is attacked by Haida authorities and using daggers and muskets they kill the 2nd officer and two crew at Cumshewa.\n|-\n|1798\n|Alexander\n|\n|\n|Bass et al.\n|American\n|Three of the American ship's crew wounded and ten Haida citizen killed in a skirmish at Cumshewa.\n|-\n|1796-7\n|Sea Otter\n|Brig\n|\n|R. Sturgis, Lamb, Magee & Hill\n|British\n|English captain and two crew members killed at Cumshewa.\n|-\n|1795\n|Union\n|Sloop 98T\n|\n|Crowell Hatcch & Caleb Gardiner\n|American\n|Attempted capture of the vessel on July 1 results in the death of 50 to 70 Kunghit Haida citizens.\n|-\n|1795-6\n|Prince William Henry\n|Schooner\n|\n|London or Newcastle Merchants\n|British\n|Kaigani chief held for ransom\n|-\n|1795\n|Phoenix\n|Barque\n|\n|\n|British\n| Trespassing ashore ships party is attacked and one crew member killed at Cumshewa. In retaliation the ship attacks the village. Cannons in the village fire back.\n|-\n|1795\n|Despatch\n|160T\n|\n| Dorr & Sons\n|American\n| Detained Chief Cumshewa in exchange for the one survivor from Resolution in July\n|-\n|1794\n|Ino\n|Sea otter fur trader ship\n|\n|\n|British\n| Possibly the unknown British ship who lost its masts and while trying to find new replacements was overcome and crew killed.\n|-\n|1794\n|Resolution\n|90T\n|\n| J. & T. Lamb & Ass.\n|American\n| Captured by the Cumshewa. Only one survivor, who is enslaved.\n|-\n| 1787\n|Eleanora\n|Brig 190T\n|\n|Metcalfe\n|American\n|Captured by the Kunghit Haida near Houston Stewart Channel with the loss of all hands, except one, who was enslaved.\n|-\n|1793\n|Amelia\n|Brig\n|\n|\n|American\n|Crew member killed by the Kunghit Haida.\n|-\n| 1791-2\n| Hancock\n| Brigantine\n|\n| Cravell & Creighton\n| American\n| Ship kills four Northern Haida on July 14 over a trivial issue. Wound another Haida at Langara Island.\n|-\n| 1791\n| Columbia Rediviva\n| 212T\n|\n| American\n|\n| Three crew killed by the Kaigani Haida as revenge for the earlier \"Crowell incident\"\n|-\n| 1791\n| Lady Washington\n| 90T\n|\n| Burrell, Brown et al.\n| American\n| An incident relating to Captain Kendrick and Chief Xo'ya result in a skirmish where 40 Kunghit are lost.\n|-\n| 1789\n| Iphigenia Nubiana\n| Snow 200T\n|\n| Burrell, Brown et al\n| American\n| Near Langara Island Haida attempt to seize the ship.\n|-\n| 1787-89\n| Princess Royal\n| Sloop 50T\n|\n| Nootka Sound Co.\n| British\n| Cumshewa Haida attempt to capture the ship. The ship opens fire.\n|-\n| 1787\n| Queen Charlotte\n| Snow 200T\n|\n| King Georg's Sound Co\n| British\n| After Haida attempt to recover furs the crew opens fire but do not appear to hit anyone\n|}\nSee also\n*Queen Charlottes Gold Rush\n*Colony of the Queen Charlotte Islands\nBibliography\nNotes\nReferences\n* - Total pages: 300\n* - Total pages: 206\n*\n* - Total pages: 180\n* - Total pages: 60\n* - Total pages: 256\n* - Total pages: 269\n* - Total pages: 500\n* - Total pages: 570"
    }
  ]
}