{
  "content": [
    {
      "type": "text",
      "text": "# Colonial Lake (Charleston, South Carolina)\n\n| created = 1881\n| operator = City of Charleston\n| visitation_num =\n| status =\n| map =\n| map_width =\n| map_alt =\n| map_caption =\n}}\nColonial Lake is a tidal pond in Charleston, South Carolina with wide walkways around it. The area is used as a park. For many years the lake was known as the Rutledge Street Pond; some residents still call it \"The Pond.\" It acquired the name Colonial Lake in 1881, in honor of the \"Colonial Commons\" established in 1768.\nHistory\nThe lake and its park were part of the Commons established by an Act of the Commons House of Assembly in 1768, setting aside the area forever for public use. Plans for a pond and park were developed by 1869. The actual lake was created by 1873 when Lynch St. (now Ashley Ave.) was extended south to Broad St., enclosing the area now occupied by the lake.\nAs seen in the 1872 Bird's Eye View of Charleston, the northwest corner of Colonial Lake originally was land that was possible to develop with a few houses. In 1874, the houses were removed so that improvements to Colonial Lake could continue.\nIn 1875, a local mill owner, Patrick P. Toale, received a lease for some of the land surrounding the lake. When he tried to purchase the property, local citizens strongly opposed the request and filed a lawsuit to prevent the deal. Judge J.B. Kershaw sided with the opponents, ordering that all remaining property held by the city be retained for the benefit of all Charlestonians and that a commission be created to oversee the property.\nIn 1881, a court reconfirmed that all of the subject land not already sold would remain in the public trust. The court ordered that the City Council create a commission to accept control of the land and its funding. The commission was to receive the rents from the public lands which would be used to maintain the public property and to possibly reacquire land southward to Tradd St. between Ashley and Rutledge Aves. In response to the order of the court, City Council created the Commissioners of the Colonial Common and Ashley River Embankment.\nThe park around the lake was developed in the 1880s. In 1882, the Commissioners of the Public Common decided to formalize the popular site by installing concrete walls and walks around it with a park on the north side. The current configuration of a lake within concrete embankments with a wide promenade on all four sides was largely completed by 1885.\n\"Gala Week\" used to be held in the fall of the year, with a fireworks display on the west side of the Pond, which was then an undeveloped area. Spectators filled to park and crowded onto boats in the lake. Boats were a popular feature of Colonial Lake, and the city even began requiring licenses for them to maintain order on the pond in 1910. Starting that same year, a series of boat and \"tub\" races were staged in the lake for local boys with money awarded to the winners. For a time, the lake was closed off from the Ashley River with a wire screen and stocked with fish for recreational fishing.\nImprovements to the park have been consistent. In 1902, the promenade was improved with a stone pavement. Other improvements were considered, but the lack of security at the site caused officials to question the idea. A dedicated police officer was assigned in 1904. In 1910, palmetto trees were planted along Ashley Ave. and more extensive landscaping was carried out, but officials again noted that vandalism by children playing in the area was causing problems. In 1911, the commissioners who oversaw Colonial Lake announced that new benches would be installed and forty water oaks would be planted. In 1938, the leader of a local club proposed installing a man-made island in the center of the lake, stocking the lake with salt water fish, and promoting it as a destination for visitors; the plan was opposed by residents and did not take place. In 1972, fountains were installed to aerate the lake, but neighbors complained about saltwater overspray, and the fountains often idled due to low water and rusted parts; in 1977, they were removed.\nThe Charleston Parks Conservancy, a nonprofit founded in 2007, announced plans to renovate Colonial Lake in 2008. Its plans would have narrowed adjacent Rutledge Ave. by nine feet (to the same width as nearby streets) and installed a more formal landscape around the lake. Plans were completed with some modifications, and an expected January 2015 start date for the four million dollar project was set. Work is expected to be completed in early 2016.\nNotes"
    }
  ]
}