{
  "content": [
    {
      "type": "text",
      "text": "# Colonial Society of Massachusetts\n\nThe Colonial Society of Massachusetts is a US non-profit educational foundation, founded in 1892, and established for the study of the history of Massachusetts. The period of study is from its settlement through the early nineteenth century. It is a member of the New England Regional Fellowship Consortium. Its headquarters, located at 87 Mount Vernon Street on Boston's Beacon Hill, are closed to the public. Some of its meetings were held at the American Academy of Arts and Sciences.\nPublications\nThe society publishes documents regarding the early history of Massachusetts, however, the society does not maintain a library or manuscript collection. A guide to some of the Colonial Society's publication collections for the period of 1710 through 1939 is maintained by the Massachusetts Historical Society. The topics can vary from the Pilgrim Fathers, to the pirate Captain Thomas Pound.\nIn partnership with the University of Massachusetts Boston, it sponsors The New England Quarterly.\nOther activities\nThe Colonial Society of Massachusetts is involved in a number of other activities such as convening scholarly conferences. Its education efforts include encouraging the study of colonial Massachusetts in schools, conducting workshops for teachers, and promoting the sharing of research amongst graduate students. It does not assist with genealogical queries.\nMembership\nInitially, only descendants of Massachusetts Bay or Plymouth colonists were able to join the society.  Beginning in 1950, membership became open to anyone with interests in colonial Massachusetts. Notable members include: Thomas R. Adams, Charles W. Akers, Charles Evans, John Grinold, Philip F. Gura, John Elbridge Hudson, Leonard Woods Labaree, Franklin Pierce Rice, and Walter Muir Whitehill.\nAwards\nThe society's Whitehill Prize in Early American History honors Whitehill, the society's editor from 1946 to 1978.\nSee also\n* List of historical societies in Massachusetts\nReferences\nFurther reading\n*"
    }
  ]
}