{
  "content": [
    {
      "type": "text",
      "text": "# Colonial Affair\n\nColonial Affair (April 19, 1990 – April 23, 2013) was an American Thoroughbred racehorse. He was best known for winning the Belmont Stakes in 1993.\nBackground\nHe was sired by 1981 Kentucky Derby and Preakness Stakes winner Pleasant Colony, out of the Rutledge Farm mare Snuggle.\nPurchased for $100,000 at the 1991 Fasig-Tipton Saratoga select yearling sale, Colonial Affair was raced by Centennial Farms. He was trained by the 1992 U.S. Racing Hall of Fame inductee Scotty Schulhofer\nRacing career\nColonial Affair won the Belmont Stakes under jockey Julie Krone as the 13-1 longshot. His 1993 Belmont triumph is also in the record books, because it was the first time that a woman jockey won any of the three races of the Triple Crown of Thoroughbred Racing.\nAt age four, Colonial Affair was only three votes shy (out of a possible 247 votes) of winning the 1994 Eclipse Award for American Champion Older Dirt Male Horse (The Wicked North voted the award winner) after winning the Whitney Handicap and Jockey Club Gold Cup that year.\nColonial Affair was the favorite for the 1994 $3 million Breeders' Cup Classic until he broke a bone in his leg, thereby ending his racing career.\nRetirement\nColonial Affair was originally retired in 1995 to Gainesway Farm.  He was then supposed to be sent to New Zealand in 1998 but was instead sent to Japan and stood privately at a stud at Haras El Paraiso in Argentina.\nColonial Affair died in his stall on April 23, 2013, at Haras El Paraiso in Capitan Sarmiento, Argentina.  He was 23.\nPedigree\nColonial Affair is inbred 5D x 4D to the stallion Native Dancer, meaning that he appears fifth generation (via Natalma) and fourth generation on the dam side of his pedigree.\nReferences\nExternal links\n* [https://www.youtube.com/watch?v=tzzvv8L0Kkc 1993 Belmont] (3:51)\n* [https://www.youtube.com/watch?v=J0EP8x_-wuk 1993 Peter Pan Stakes] (1:49)\n* [https://www.youtube.com/watch?v=6czxG_yFb94 1994 Whitney Handicap] (7:13)\n* [https://www.youtube.com/watch?v=WYBTaUz7Vfk 1994 Jockey Club Gold Cup] (4:14)\n* [https://www.youtube.com/watch?v=Wm9ImSi-I8c 1994 Excelsior Breeders' Cup Handicap] (2:17)"
    }
  ]
}