{
  "content": [
    {
      "type": "text",
      "text": "# Colonial Ammunition Company\n\nThe Colonial Ammunition Company (CAC) was an ammunition manufacturer in Auckland, New Zealand. Its predecessor, Whitney & Sons, was established by John Whitney with government encouragement in 1885 during the Russian Scare. Whitney later recruited investors to expand his factory in 1888. The other shareholders were Messrs Greenwood and Batley, of Leeds (owners of the Greenwood & Batley cartridge company); T. Hall, Esq., of Mount Morgan; J. D' Arcey, Esq.; Captain de Lusada, R.N.; J. Clarke, Esq.; and T.Y. Cartwright of Notts. They formed the Colonial Ammunition Company, the first ordnance manufacturer in Australasia.\nComponents were made in New Zealand and Australia, shipped to England, and then assembled at the Greenwood & Batley plant in Leeds. The finished cartridges were then shipped back to Australia and New Zealand for sale. It later expanded in other business directions from 1925 on.\ncartridge (Mk VII) FMJ, manufactured by CAC in 1945]]\nIn the Second World War, it was New Zealand's only industrial manufacturer of ammunition (having temporarily increased its workforce from 230 to 900), with production in countries like Australia having long since overtaken the small size of the New Zealand market for ammunition.\nHistory\nduring World War I]]\nMajor John Whitney established an ammunition company with gunsmith William Hazard; however, the business failed and Whitney was left in debt. Whitney then established his own company Whitney & Sons the same year. This business was based on a  site on the slopes of Mount Eden and was the first factory producing munitions in Australasia. The business was successful and was rebranded into the Colonial Ammunition Company in 1888. The building initially employed children but this was outlawed by the Factories Act 1891, Whitney hired mostly women after this.\nThe Colonial Ammunition Company first branched out of munitions production in 1925 when it started producing crown seal bottle tops. In the 1950s it had started production of cosmetic products and aluminium foils. Further increasing the diversification of products were the acquisition of RodField Woollens in 1954 and Meredith Bros in 1961.\nIn June 1942, some ammunition manufacturing had been transferred to Hamilton. This production returned to Mount Eden after the end of the war. During the 1960s the company was acquired by Holeproof Industries who sold it to the Imperial Chemical Industries in 1965. It finally closed in 1982. Two buildings from the Colonial Ammunition Company remain, these are a bluestone building at 26 Normanby Road and the Colonial Ammunition Company office at 49 Normanby Road. The latter has a category I registration with Heritage New Zealand.\nat Mount Eden, with the bluestone building at the left.]]\nShot Tower\nThe company built a rare steel-frame shot tower with a 30-metre drop in 1914 for the creation of lead pellets. Used in the shotgun shells of New Zealand hunters, they had previously been imported, mainly from the United Kingdom. The tower was erected by local blacksmiths W. Wilson and Company, and initially operated by Mr. Lylie with his two daughters (who had previously been supplying CAC with limited quantities of shot from Nelson). The tower could produce up to of 1,000 tons of shot per year. It remained in profitable operation until after World War II, when it allowed the company to keep production levels high after military ammunition requirements had dropped off. The tower was the only 20th-century shot tower in Australasia, and the only remaining shot tower in New Zealand. The CAC vacated the premises in the early 1980s. The tower was registered as a Category I heritage building by Heritage New Zealand. It was demolished in 2023 after concerns it would collapse due to Cyclone Gabrielle.\nFollowing the entry of the Japanese Empire into the Second World War, there was concern that the site at Mount Eden would be too exposed to a coastal attack. In light of this, the production of munitions was transferred to Hamilton. After the equipment was relocated and buildings constructed and manufacturing at a site on Dey Street, production commenced in June 1942. The facility was closed after the end of the war and equipment and production were transferred back to Mount Eden.\nAustralian factory\nA factory was built in 1888 in Australia at Footscray, Victoria. It was founded by Captain John Whitney of CAC New Zealand in a joint venture with several of English partners and was a separate entity from the commercial New Zealand company. The Australian government leased the facility from CAC on 1 January 1921 and bought the facility outright in 1927 and renamed it the Small Arms Ammunition Factory No.1. Five other facilities were briefly opened during World War 2: a new factory at Footscray (SAAF No. 2), two more built at Hendon (SAAF No. 3 & No. 4), one built at Rocklea (SAAF No. 5), and one built at Welshpool (SAAF No. 6). The SAAF No. 1 facility was finally closed in 1945 and was replaced by the nearby SAAF No.2 facility. The facility is now more commonly known as Ammunition Factory Footscray (AFF).\nReferences\nExternal links\n* [https://web.archive.org/web/20150425141943/http://www.cacbar.co.nz/ C.A.C. bar & eatery] (now occupying a remaining heritage building)\n* [https://kura.aucklandlibraries.govt.nz/digital/collection/photos/search/searchterm/Colonial%20Ammunition%20Company Photographs of Colonial Ammunition Company] held in Auckland Libraries' heritage collections."
    }
  ]
}