{
  "content": [
    {
      "type": "text",
      "text": "# Colonial Cup (rugby union)\n\nThe Colonial Cup (named after sponsors The Colonial National Bank) is a defunct rugby union football competition that was played in Fiji between 2004 and 2008. The Colonial Cup was Fiji's first attempt at a professional rugby competition, but it did not draw sufficient crowds and ceased after five seasons.\nHistory\nIn 2004, with the gap between provincial rugby in Fiji and test rugby at an unacceptable level, the Fiji Rugby Union introduced a brand new, streamlined competition to identify and prepare local players for the international stage. The 30-odd provincial unions were grouped into four franchises along geographical lines. Players not selected for one team could be picked up by one of the others. Players were paid £40 a week plus lodgings.\nThe new competition started on 3 April 2004 and finished 22 May 2004 in time for the international test window. The four teams played a round-robin followed by semi-finals and a grand final. The Coastal Stallions held off a late rally from the Suva Highlanders to claim the inaugural Colonial Cup 26-21\nIn 2005 an extra team was added, Northern Sharks, made of players from Vanua Levu, Taveuni and Ovalau. Previously the Northern Division had belonged to the Suva franchise. Suva Highlanders won the Grand final with a 35-27 win over Western Crusaders.\nIn 2006, with the introduction of a Super 14 style tournament called the Pacific Rugby Cup, the void in the Pacific Island competition pathway between club or provincial rugby in the respective islands and Test rugby was on its way to being filled. Coastal Stallions defeated Suva Highlanders 29-15 in a tough encounter to clinch the 2006 title.\nBligh Roosters joined the 2007 competition, Western Crusaders gave up Tavua, Vatukoula, Ba and Ra to the new franchise.\nIt was announced in 2008 that the competition would cease due to not achieving its player performance aims and low crowds.\nStructure\nFiji’s best 150 players are divided up into 6 professionally run franchises. These franchises play each other over 10 weeks culminating in a semi-final and final. The league uses 4 points for a win; 2 for a draw; 1 bonus point for scoring four or more tries in a match; 1 bonus point for losing by 7 points or less. The top four teams then proceed to the semi-finals.\nFranchises\n*Bligh Roosters\nTavua, Vatukoula, Ba, Ra\n*Coastal Stallions\nNadroga-Navosa, Namosi, Serua and Malolo\n*Northern Sharks\nVanua Levu, Taveuni, Ovalau, and Island Zone\n*Suva Highlanders\nSuva, Naitasiri, Kadavu\n*Tailevu Knights\nTailevu, Northland, and Rewa\n*Western Crusaders\nLautoka, Nadi, and Yasawa\nPast winners\n*2004 Coastal Stallions\n*2005 Suva Highlanders\n*2006 Coastal Stallions\n*2007 Coastal Stallions\n*2008 Western Crusaders\nSee also\n* Fiji Rugby Union\n* Fiji national rugby union team\nExternal links\n* [https://web.archive.org/web/20070129015426/http://www.teivovo.com/colonial_cup/index.html Colonial Cup pages from Teivovo]\n* [https://web.archive.org/web/20060213202801/http://fijirugbyunion.com/?page=tourGallery&tourID=2&newsTypeID=62 Colonial Cup pages from Fiji Rugby Union]\nReferences"
    }
  ]
}