{
  "content": [
    {
      "type": "text",
      "text": "# Cologne in the German colonial empire\n\nbefore World War I]]\nThe city of Cologne was significant to the development of the German colonial empire as a whole. During the period of New Imperialism, Cologne was one of the most important trading cities of the German Empire, and was thus the Rheinland's centre for  expeditions and scientific colonialism.\n\"Scientific Colonialism\" and its key figures in Cologne\nFrom 1905 onwards, the city of Cologne was a member of the Kolonial-Wirtschaftliches Komitee, or KWK (Colonialist and Economic Committee), paying a yearly fee of 100 marks. The KWK's management committee included, among others, Richard Hindorf, director of the Rheinische Handeï-Plantagen-Gesellschaft (the Rhenish Handeï Plantation Society), and Max Esser, founder of the Westafrikanische Pflanzungsgesellschaft Victoria (the West-African Planting Society Victoria).\nIn 1914 the Kolonial-Wirtschaftliches Komitee consisted of 1231 corporate members. The following Cologne businesses were also registered:\n* Bertuch & Co., a factory producing machine levelling elements\n* Franz Clouth Ltd, The Rhenish Rubber Goods Factory (Nippes)\n* The Deutz gas engine factory\n* The Cologne Elastic Factory, formerly Ferd. Kohlstadt & Co. (Deutz)\n* W. Leyendecker & Co. (Ehrenfeld)\n* The Humboldt Mechanical Engineering Firm (Kalk)\n* J. Pohlig, Act. Ges. (Zollstock)\n* The Stollwerck Brothers, a chocolate manufacturer\nAugust Reichensperger, Viktor C. Eduard Schnitzler, Gustav Michels, Eugen and Hans Langen and the Leverkus family were particularly significant for colonialism in Cologne.\nInstitutions and local establishments\nin Cologne, the Handelshochschule business school|326x326px]]\nIn the year 1884, at the beginning of Germany's active colonial policy, Cologne's local branch of the West German Society for Colonisation and Export was created, beginning with around 100 members. The turn of the century brought with it the establishment of many new business schools and technical colleges, such as the modern day Hansagymnasium school, the Handelshochschule business school and the chamber of commerce in Cologne, all of which were members of the German Colonial Society.\nIn order to satisfy the public's general interest in colonial topics, these subjects were introduced into the colleges' curriculums as additional compulsory courses.\nThe link between science and colonialism in Cologne was further ensured through contracts.\nA large proportion of the teaching staff at the chamber of commerce, the Handelshochschule business school, and other institutions, were also members of the German Colonial Society, including for example Christian Eckert, Kurt Wiedenfeld, Paul Moldenhauer, Oskar Jäger, Heinrich Geffcken, Otto Wilhelm Thomé and Richard Hindorf.\nOn the evening of 19 October 1888, a large number of citizens arrived to the \"upper reception hall\" of the \"Roman walkway\", in order to enact the establishment of the Cologne subdivision of the German Colonial Society.\nThe pro-colonial propaganda of the Kölnische Zeitung\nThe Kölnische Zeitung newspaper had already existed for nearly a hundred years when German colonialism began, and was firmly established as a source of information among the middle class and nationalist-conservatives.\nLike the general attitude in Western society at the turn of the century, the ''Kölnische Zeitung's'' articles were racist, nationalist and euphemistic from a modern perspective.\nThe editor of the newspaper, Prosper Müllendorf accompanied Cologne's Handelshochschule business school on the 1908 East Africa expedition and also reported on \"The French colonial empire in West Africa\", Cameroon, German South West Africa, the ''\"Victims in German South West Africa\", \"Germany's next duties in the South West\", \"German South West Africa at the time of the Herero Rebellion\", \"The means of transport of the state of Congo\", \"Overview of the development of the African colonies\", \"The newest development in German East Africa\", \"Technology and goods in German East Africa\" and \"The development of British East Africa\". Hugo Zöller gave lectures in the Gürzenich convention centre on the \"Land and people of Samoa\" for the supporters of colonialism. Von Mach, another editor of the newspaper, gave a presentation on \"a German project in Transvaal\".\nThe Kölnische Zeitung was one of the few German newspapers which could afford to send a correspondent, its editor Hugo Zöller, to the colonies. The \"colonial journalism\" of the time typically consisted simply of copies of articles from leading newspapers, or of second-hand accounts from travellers, traders or missionaries. In light of this, the enthusiastic, pro-colonial Zöller was a fortunate asset for the Kölnische Zeitung''. Its editor was sent on a colonial-science educational trip in 1879, and to West Africa from 1884-1885, in order to participate actively in the acquisition of new territories alongside the German Empire's consul-general, Gustav Nachtigall.\nZöller himself openly described his style as \"colonial political agitation\", which can be understood as an intensive form of political propaganda. The type of Zöller-esque propaganda varied according to each political situation. He naturally had to make use of different propagandistic strategies before the active expansion of the German Empire, as opposed to during the period of German colonialism, during the First World War, and in the period of colonial revisionism which followed.\nCologne as a source of missionaries\nFrom ancient times onwards, the city of Cologne was a hub for Catholicism for regions north of the Alps. As a consequence, missionaries from this city also set out for colonial Africa. In the year 1888, the Afrika-Verein deutscher Katholiken, or AVdK, (African Society of German Catholics) was thus founded. For many years, this society was chaired by Franz Karl Hespers, the cathedral dean from Cologne, who was also a member of the German Colonial Society. The AVdK was under the protection of the Archbishop of Cologne, and was inspired by the \"anti-slavery movement\" started by the French cardinal Lavigerie.\nThe aim of the AVdK was \"the civilisation of the Negroes through conversion to Christianity\".\nInitially limited to German East Africa, they later spread their movement to the other colonies.\nPaul zu Lukuledi from the missionary station in St. Peter remarked: Daniele Comboni, canonised by the Catholic Church in 2003, sought recruits for the Africa mission in Cologne, and received direct support from the AVdK.\nOn 18 May 1920 the AVdK was dissolved. The neo-colonialist plans to re-establish the society nearly forty years later never succeeded. Alongside the AVdK, there also existed an Evangelical Africa Society and the Rhenish Missionary Society.\nAfricans from the colonies in Cologne\nThe \"Dahomey Amazons\"\nIn 1890, the \"Dahomey Amazons\", a corps of men and women from German Togoland were put on exhibition in Cologne, where they would appear in exotic costumes. Between then and 1908, the corps appeared in Cologne four times in total, with various members. The Kölner Stadt-Anzeiger newspaper wrote about the \"soldiers in petticoats\", saying \"The female warriors are clever, mostly with well-formed figures and maroon-coloured skin, only one or two are lighter in colour, as well as some who are also darker. They wear a type of bodice, which covers their chest and is decorated with small white cowrie shells, amulets, which are worn around their necks and on their chests, are among the jewellery of the black-brown ladies.\"\nIn 1898, a sixteen-year-old \"Amazon\" died of pneumonia in the Cologne public hospital on Cäcilien St. She was interred in the Melaten Cemetery, with significant coverage from the local press: ''\"Yesterday, after All Souls' Day, a rare burial took place in the Melaten Cemetery. An Amazon from the troupe which performs in Castans' Panopticum, fell suddenly ill from pneumonia some weeks ago. The doctor treating her ordered for her to be committed to the local public hospital. Her illness worsened, and on Saturday death carried away the otherwise strong girl. [...] The burial was scheduled for Monday.\"\nSamoans in Cologne Zoo\nIn the Cologne Zoological Garden in July 1901, an ethnological exposition of 26 Samoans took place, including the prisoner Tamasese Le Alofi II and members of his family, as well as other noble families from the island. The supervisory board and the board of directors announced:\n}}The members of the human zoo exhibit had to perform dances and weapon-play several times a day, and twice a week they had to prepare an entire roast pig in a cooking-pit filled with leaves and hot stones, for the public's entertainment. A chute was also installed as an additional attraction, which the Samoans would slide down dressed in only grass skirts and flower chains, into a pool of water, where they would swim around or paddle in canoes. The concept for the exhibition came from Carl Marquart and his brother Fritz, who had strong connections with the German colonies as the former chief of police of Apia, Samoa. The public would have been familiar with exhibitions of \"exotic\" people ever since this concept had first been introduced at the World's fairs. Images of \"tamed savages\" or of new \"compatriots\" were also both popularised during the period of European colonialism. The anonymous author of the following article praised the event for its ethnological value:\nInclusion of German colonialism in the Cologne Carnival\nprogramme of events]]\nThe pro-colonial Kölnische Zeitung newspaper published the travel accounts of the geographer and ethnologist Wilhelm Joest shortly before the 1884/1885 carnival season, which were received with considerable public interest in Cologne. Joest had spent a year travelling in Southeast Africa; additionally, many events which were significant for German colonial policy had occurred in this year (German South West Africa was established, Carl Peters established the German East Africa Company, the Berlin Conference took place). The slogan for the Cologne Carnival season was \"Hero Carnival as coloniser\", \"Hero Carnival\" being the personification of carnival; everyone participating in Rose Monday celebrations dressed up as \"Negroes\" with black shoe polish. On the cover of the carnival's programme of events, \"Colonia Agrippina\" appears next to the newly-conquered \"Colonia Anna Bequema\", \"Anna Bequema\" being a play on \"Angra Pequeña\", the former Portuguese name for the coastal region in South West Africa, which was later named \"Lüderitz Bay\". The Kölnische Zeitung gave the following description of the \"Amazon Music Corps\", who wore spiked helmets:\nAfter the loss of the German colonies\nAs soon as Germany had lost its colonies due to the defeat in World War I, the pro-colonial organisations began to argue for new colonies. Konrad Adenauer, who at least since in 1913 had attended meetings at the Cologne branch of the German Colonial Society and was a prominent member from the late 1920s, while he was also the Mayor of Cologne, said in a magazine interview in 1927:\nFrom 1931 to 1933 he was the vice president of the Colonial Society and for several years after World War II, while being Chancellor of Germany, he continued to express pro-colonial views.\nFurther reading\n* Lothar Pützstück: „Exotenzauber vor Stadtmauer und Haustür“. Völkerschauen im Kölner Zoo 1878–1932 (in German) Zeitschrift des Kölner Zoo 40,4: 151–157, 1997\n* Marianne Bechhaus-Gerst: Köln und die Kolonien, (in German) in: Ulrich van der Heyden und Joachim Zeller (eds.): Kolonialismus hierzulande – Eine Spurensuche in Deutschland. Sutton Verlag, Erfurt 2007, ISBN 978-3-86680-269-8, pp. 11–18.\n* Marianne Bechhaus-Gerst, Anne-Kathrin Horstmann (eds.): Köln und der Deutsche Kolonialismus. Eine Spurensuche, (in German) Böhlau Verlag, Köln, Weimar, Wien 2013. 286 pages\n*\nGerman Colonial Society membership lists\n*\n*\n*\n*\nFootnotes"
    }
  ]
}