{
  "content": [
    {
      "type": "text",
      "text": "# Colonial Heights, Sacramento, California\n\n|elevation_m              =\n|elevation_ft             =\n|postal_code_type         = Zip Codes\n|postal_code              = 95820\n|area_code                =\n|website                  =\n|blank_name               =\n|blank_info               =\n|blank1_name              =\n|blank1_info              =\n|footnotes                =\n}}\nColonial Heights is a neighborhood in the southeast part of the City of Sacramento, California. An older neighborhood, established in 1910, it makes a fairly typical example of a turn of the century \"Streetcar Suburb\". Before cars and buses took over for transportation needs, it was built around the convenient and efficient electric streetcar service provided by the Central California Traction Company.\nLocation\nThe neighborhood of Colonial Heights is located in Southeast Sacramento. It consists of the area bordered on the west by Stockton Boulevard, east by 58th street, north by 14th avenue, and on the south by 22nd avenue.\nPark\nColonial Heights has a city park located at its center. The park consists of the area between 18th and 19th Avenues north-south and between 54th and 53rd Street east-west.\nThe park contains a wading pool, playgrounds for children and toddlers, picnic benches, a softball/baseball diamond, a field for soccer or other activities, and a basketball half-court.\nNeighborhood association\nThe neighborhood association meets at the Colonial Heights Library in the south-west of the neighborhood.\nPolitics\nGovernment\nColonial Heights is represented by the following government districts:\n* Sacramento City Council: Sacramento City District 5\n* Sacramento County Board of Supervisors: Sacramento County District 1\n* California State Legislature: 9th Assembly District; 6th Senate District\n* United States House of Representatives: .\nReferences\nExternal links\n*[https://web.archive.org/web/20140112080310/http://tcc4kids.org/ Tahoe/Colonial Collaborative for Healthy Kids]"
    }
  ]
}