{
  "content": [
    {
      "type": "text",
      "text": "# Colonialism of a Special Type\n\nColonialism of a Special Type (CST) is a political concept coined by the South African Communist Party (SACP) in its 1962 programme, The Road to South African Freedom. The term was developed to describe the distinct form of colonialism that existed within South Africa under apartheid, where both the coloniser and the colonised lived in the same country. According to the SACP, South Africa's white minority functioned as an internal colonising force, economically and politically dominating the black majority.\nHistorical origins\nThe term emerged during the early 1960s when South Africa was formally an independent state but continued to enforce systematic racial segregation and economic exclusion of the majority Black population and other non-white groups like Indians and Coloured. The SACP argued that while South Africa was not a colony in the traditional sense - like being ruled by a foreign power - but it retained all the essential features of colonial domination.\nThe party maintained that colonialism in South Africa took a “special type,” where a white settler minority, largely of European descent, exercised control over the indigenous majority population. Unlike classical colonialism, where the coloniser lived in a metropole distant from the colony, CST described a system in which coloniser and colonised occupied the same physical territory.\nTheoretical framework\nThe CST concept is grounded in Marxist–Leninist theory and was used by the SACP to guide revolutionary strategy. It proposed that South Africa required a two-stage revolution: first a national democratic revolution to dismantle racial oppression, followed by a socialist revolution to overcome class exploitation.\nThe CST framework also shaped the ideological approach of the African National Congress (ANC) and Umkhonto we Sizwe, its armed wing, with whom the SACP shared close relations. It was used to justify the unity between the working class and oppressed racial groups in South Africa’s liberation struggle.\nThe theory of Colonialism of a Special Type had a major influence on South Africa’s liberation politics during the 1960s through the 1980s. It provided a unifying analytical lens for anti-apartheid movements to link racial oppression with economic exploitation. CST continues to be referenced in contemporary discussions of racial capitalism and post-apartheid inequality.\nCriticism\nSome scholars, such as Harold Wolpe, have critiqued CST for oversimplifying the class structure within the Black population and for failing to fully explain the dynamics between racial oppression and capitalism. Others argue that the framework was ideologically useful but analytically limited when applied to evolving socio-economic realities.\nSee also\n* Internal colonialism\n* Settler colonialism\n* Exploitation colonialism\n* South African Communist Party\n* National democratic revolution\n* Racial capitalism\nReferences"
    }
  ]
}