{
  "content": [
    {
      "type": "text",
      "text": "# Color war__disambig_1\n\nA color war is a competition played in summer camps, schools and some social organizations (such as sororities, fraternities, or small businesses). Participants are divided into teams, each of which is assigned a color. The teams compete against each other in challenges and events to earn points. Typical color war challenges include tug-of-war, dodgeball, archery, soccer and basketball.  These challenges and events vary based upon the venue for the game. The games' durations can range from a day to several months. The winning team is the one with the most points at the end of the game.  Typically, color wars consist of several events that are worth insignificant numbers of points, and then one large final event that is worth enough points to win or lose the entire color war. It is usually at the end of the summer.\nColor wars can also be useful in the school setting for pep rallies or to get students excited about learning.  Points can be allotted for completion of academic activities or events.  Points can be tallied and scored.\nColor wars usually begin with a surprise 'color war breakout' to begin, at which point generals and captains are announced.  Booklets or flyers are given out dictating teams.  Students/campers have meetings and team time periods throughout color war.\nCheers are made up by members of the teams and teams come up with songs to sing and flyers to put up around the location of color war.\nMultiple events occur, each worth a certain number of points.  Events include sports competitions, cheer-offs, as well as knowledge competitions.  Sometimes silent lunch is an activity, where every team has to be silent.  In some cases, each team gets a day where they have to decorate a lunch room and they do their best to encompass their team's theme throughout the location.  At the end of color war, there are presentations such as the teams' banners, songs, skits, multi-media presentations, and team movies.  These presentations are worth the most points, and can tip color war in favor of any team.  The last day of color war also usually includes some sort of relay races or another large event which the whole team must participate in, also worth a very high number of points.\nTraditionally, in England, and other countries such as Australia, schools conduct color war-like competition in sports (such as track and field, football, softball, cricket, swimming) with the student population being assigned to rival \"Houses\". Each House has a name (possibly the name of famous past principals, or nearby streets, or local landmarks or famous people) and a color (typically red, yellow, green and blue, with more colors if a large school needs more Houses to allow for manageable and competitive student-groups within each House). Inter-House competition is often expanded beyond sports to include Drama, and Music (instrumental, orchestral, choral), and other events such as Debating. This House system is seen in Harry Potter's fantasy boarding school, Hogwarts, with magic and broomstick-riding being competition events. Historically, colors were used in Roman times to distinguish charioteers competing in chariot races.\nSee also\n* Capture the flag\nReferences\n#\n#"
    }
  ]
}