{
  "content": [
    {
      "type": "text",
      "text": "# Colonial Tavern\n\n| location          = Toronto, Ontario, Canada\n| coordinates       =\n| type              = Tavern and Jazz venue\n| genre             = Jazz\n| built             = 1950s\n| opened            =\n| closed            = 1970s\n| owner             =\n| seating_capacity  =\n}}\nThe Colonial Tavern was one of the most famous jazz venues in Canada from the 1950s till its closure in the late 1970s. It was located at 201–203 Yonge Street in Toronto, Ontario (now an open lot between 197 Yonge Street and 205 Yonge Street) where a historic plaque (now removed) remembered this key jazz venue. The Colonial Tavern was owned and managed by brothers-in-law Mike (Myer) G. Lawrence, Goodwin (Goody) and Harvey Lichtenberg. 197–199 Yonge Street (the former Canadian Imperial Bank of Commerce building) and 201–203 Yonge Street were purchased by Sal Parasuco of Montreal, Quebec, who planned to erect a hotel. The properties were sold to MOD Developments of Toronto in January 2012 for the Massey Tower condo project\nPerformances\nJazz musicians played on the ground floor on a raised stage along one wall beneath a disco ball. The stage could also be seen from the balcony dining area. Musicians had a green room at the back and at times stayed in apartments on the floor above.\nIt was a venue for soloists and small ensembles. Big bands performed either at the Imperial Room at the Royal York, in Massey Hall, or at various venues on the Toronto waterfront, including the Palais Royale, the CNE Bandshell, and the Palace Pier.\nConcerts were often recorded by CJRT's jazz disk jockey, Ted O'Reilly, and were broadcast on Saturday mornings with interviews of musicians discussing their performances and memories. Some of these interviews are in the Toronto Metropolitan University archives.\nHistory of jazz in Toronto\nOther competing jazz venues in Toronto at the time were George's Spaghetti House, the Town Tavern and George's Bourbon Street. Upscale nightclubs and big band venues included the Savarin Tavern, the Imperial Room at the Royal York Hotel, the Palais Royale, and the CNE Bandshell.\nPerformers\nThe first band to open the Colonial Tavern was a band led by Cy McLean, who led the first full-scale black dance band in Canada. Artists who performed at the Colonial Tavern included major jazz artists from around the world. Musicians often stayed in very limited accommodation at the back. A brass plate memorial in the park which now remembers this historic building records the names of over 150 jazz musicians that performed at the tavern. Performers included\n* Peter Allen\n* Cannonball Adderley\n* Sidney Bechet\n* George Benson\n* Art Blakey\n* Bill Chase\n* Ornette Coleman\n* Miles Davis\n* Bo Diddley\n* Willie Dixon\n* Bill Evans\n* Tal Farlow\n* Rory Gallagher\n* Dizzy Gillespie\n* Benny Goodman\n* Jeff Healey\n* Earl Hines\n* Illinois Jacquet\n* B.B. King\n* Roland Kirk\n* Gene Krupa\n* Chuck Mangione\n* Cy McLean\n* Carmen McRae\n* Charles Mingus\n* Chet Baker\n* Thelonious Monk\n* Red Norvo\n* Oscar Peterson\n* Shorty Rogers\n* George Shearing\n* Jimmy Smith\n* Timmy Thomas\n* Big Mama Thornton\n* Gino Vannelli\n* Joe Venuti\n* T-Bone Walker\n* Muddy Waters\nReferences"
    }
  ]
}