{
  "content": [
    {
      "type": "text",
      "text": "# Colonial history of New Jersey__disambig_1\n\n, built by Finnish or Swedish settlers in the New Sweden colony in modern-day Swedesboro, New Jersey between 1638 and 1643, is one of the oldest still standing log houses in the United States.]]\nEuropean colonization of New Jersey started soon after the 1609 exploration of its coast and bays by Henry Hudson. Dutch and Swedish colonists settled parts of the present-day state as New Netherland and New Sweden.\nIn 1664, the entire area, surrendered by the Dutch to England, gained its current name. With the Treaty of Westminster in 1674, London formally gained control of the region; it retained that control until the American Revolution.\nPre-colonial population\nThe original people of the region of some 13,000 years left behind advanced hunting implements such as bows and arrows and evidence of an agricultural society.  The region has probably been continually inhabited from that time as other tribes migrated to the area. At the time of the European colonization, the area of the Lenape, which they called Scheyichbi (see: Unami language), encompassed the valleys of the lower Hudson River and the Delaware River, and the area in between, what is now known as the U.S. state of New Jersey; exonyms given to the different groups by the colonizing population were taken from geographic names of Original Peoples' settlements that included the Hackensack tribe, the Tappan tribe, and the Acquackanonk tribe in the northeast, the  Raritan tribe, and the Navesink tribe in the center.\nNew Netherland\n.]]\n]]\nDutch settlement in the seventeenth century concentrated along the banks of the North River and the Upper New York Bay, though they maintained factories along the Delaware River as well. Although the Lenape did not recognize the European principle of land ownership, Dutch policy required formal purchase of all land settled. The settlement grew slowly, impeded by Willem Kieft's mismanagement. In 1658, the last Director-General of New Netherland, Peter Stuyvesant, \"re-purchased\" the entire peninsula known as Bergen Neck, and in 1661 granted a charter to the village at Bergen, establishing the oldest municipality in the state.\nNew Sweden\nNew Sweden, founded in 1638, rose to its height under governor Johan Björnsson Printz (1643–1653). Led by Printz, the settlement extended as far north as Fort Christina (on both sides of the Delaware River). He helped to improve the military and commercial status of the colony by constructing Fort Nya Elfsborg, which is now near Salem, on the east side of the Delaware River. Swedesboro and Bridgeport were founded as part of the colony. In 1655, the Dutch asserted control over the territory.\nEnglish takeover\nItalian navigator John Cabot left Italy in 1496 to explore North America. The English claimed that New Netherland was part of Cabot's discoveries, prior to Hudson. Insisting that John Cabot had been the first to discover North America, the English granted the land that now encompasses New Jersey, who ordered Colonel Richard Nicolls to take over the area. In September 1664, an English fleet under the command of Richard Nicolls sailed into what is now New York Harbor and under threat of attack, forced the provisional surrender of the colony by the Dutch. The English received little resistance due to West India Company's decision not to garrison the colony. Nicolls took the position of deputy-governor of New Amsterdam and the rest of New Netherland, guaranteeing colonists' property rights, laws of inheritance, and the enjoyment of religious freedom.\nWithin six years, the nations were again at war, and in August 1673 the Dutch recaptured New Netherland with a fleet of 21 ships. Nevertheless, in November 1674, the Dutch Treaty of Westminster concluded the war and ceded New Netherland to the English.\nRoyal Colony\nNew Jersey Tricentennial Flag, which was designed in 1964 to mark the 300th anniversary of the creation of the Province of New Jersey\nKing Charles II gave the region between New England and Maryland to his brother, the Duke of York (later King James II), which was renamed New York. Soon thereafter James granted the land between the Hudson River and the Delaware River to two friends who had been loyal to him through the English Civil War: Sir George Carteret and Lord Berkeley of Stratton. That part of New Netherland was named New Jersey after the English Channel Island of Jersey.\nThe two proprietors of New Jersey attempted to entice more settlers to move to New Jersey by granting sections of lands to settlers and by passing the Concession and Agreement, a document granting religious freedom to all inhabitants of New Jersey; under the British Church of England there was no such religious freedom. In return for land, settlers paid annual fees known as quitrents. Land grants made in connection to the importation of slaves were another enticement for settlers. Philip Carteret was appointed by the two proprietors as the first governor of New Jersey. Philip Carteret designated Bergen as the first capital of the colony. However, it became difficult for the two proprietors to collect the quitrents. As a result, on March 18, 1673, Berkeley sold his share of New Jersey to two Quakers, Edward Billinge and John Fenwick, who quarreled over the purchase and Quakers brought in William Penn to resolve the dispute without having to resort to court (as Quakers tried to resolve such issues among themselves).\nDivision into East and West\nWith this sale, New Jersey was divided into East Jersey and West Jersey, two distinct provinces of the proprietary colony. William Penn was heavily involved in drawing up the West Jersey Concessions in 1676. This set out a structure of government and a legal framework. It was signed by 31 signatories in America and 150 more in Great Britain. Although never fully enacted, a number of its elements subsequently became core features of the US Constitution and Bill of Rights.  The political division between the two colonies existed for the 26 years between 1678 and 1712. Determination of an exact location for a border between West Jersey and East Jersey was often a matter of dispute, as was the border with New York.\nThe border between the two sides reached the Atlantic Ocean to the north of Atlantic City. The border line was created by George Keith, and can still be seen in the county boundaries between Monmouth and Burlington/Mercer Counties; Burlington and Ocean Counties; and Hunterdon and Somerset Counties, reaching upward to a point on the Delaware River which is just north of the Delaware Water Gap. The border was often disputed, so with the 1676 Quintipartite Deed more accurate surveys and maps were made to resolve property disputes. This resulted in the Thornton line, drawn around 1696, and the Lawrence line, drawn around 1743, which was adopted as the final line for legal purposes.\nReligion\nNew Jersey was very diverse religiously during the colonial period.\nDutch Reformed Church\nin Jersey City]]\nin Hackensack]]\nin Dumont]]\nAfter the final transfer of power to the English, New Netherlanders and their descendants spread across East Jersey and established many of the towns and cities which exist today. The Dutch Reformed Church played an important role this expansion  Following the course of the Hudson River in the north to the Raritan River in the south,  settlement and population  grew along what George Washington called the \"Dutch Belt\". The American classis secured a charter in 1766 for Queens College (now Rutgers University), where the appointment in 1784 of John Henry Livingston as professor of theology marked the beginning of the New Brunswick Theological Seminary.\n{| class=\"wikitable sortable\"\n|-\n! Year\n! Congregation\n|-\n|1660 || Bergen at Bergen Square, now Jersey City\n|-\n|1693 || Acquackanonk in Passaic\n|-\n|1694 || Tappan\n|-\n|1696 || Hackensack\n|-\n|1699 || Brick in Marlboro\n|-\n|1700 || Second River in Belleville\n|-\n|1703 || Six Mile Run\n|-\n|1710 || Ponds in Oakland\n|-\n|1717 || New Brunswick\n|-\n|1720 || Fairfield\n|-\n|1724 || Schraalenburgh now Dumont\n|-\n|1725 || Paramus now Ridgewood\n|-\n|1727 || Harlingen\n|-\n|1736 || Pompton Plains\n|-\n|1740 || Ramopock in Mahwah\n|-\n|1755 || Totowa in Paterson\n|-\n|1756 || Montivlle\n|-\n|1770 || Ridgefield in  the English Neighborhood\n|}\nReligious Society of Friends\n]]\n]]\n{| class=\"wikitable sortable\"\n|-\n! Year\n! Locale\n! Year\n|-\n|Seaville Friends Meeting House || Seaville || 1716\n|-\n|Woodbury Friends' Meetinghouse || Woodbury || c.1715\n|-\n|Quaker Meeting House || Quakertown || 1733\n|-\n|Bordentown Friends Meetinghouse || Bordentown || 1740\n|-\n| Smith Friends Meetinghouse || Harmony || 1753\n|-\n|Alloways Creek Friends Meetinghouse || Hancock's Bridge || 1756\n|-\n|Dover Friends Meetinghouse || Dover || 1758\n|-\n|Evesham Friends Meeting House || Mount Laurel || 1760\n|-\n|Greenwich Friends Meetinghouse || Greenwich || 1771\n|-\n|Salem Friends Meetinghouse || Salem || 1773\n|-\n|Chesterfield Friends Meeting House || Crosswicks || 1773\n|-\n|Arney's Mount Friends Meetinghouse || Pemberton || 1775\n|-\n| Copenney Friends Meetinghouse || || 1775\n|-\n|Trenton Friends Meeting House || Trenton || 1776\n|}\nQuakers\n{| class=\"wikitable sortable\"\n|-atom 1978\n! Church\n! Locale\n! Year\n|-\n| Upper Meeting House of the Baptist Church of Middletown\n|\n| 1688\n|-\n| Cohansey Baptist Church\n| Roadstown, west of Bridgetown\n| 1683/1690\n|-\n| Stelton Baptist Church\n| Piscataway Township, later Edison\n| 1689\n|-\n| Ye Olde Yellow Meeting House\n| Imlaystown\n| 1720\n|}\nEpiscopal Churches\n{| class=\"wikitable sortable\"\n|-\n! Church\n! Locale\n! Year\n|-\n| St. Peter's Episcopal Church\n| Perth Amboy\n| 1685\n|-\n| St. Mary's Episcopal Church\n| Burlington\n| 1703\n|-\n| St. John's Episcopal Church\n| Elizabeth\n| 1706\n|}\nSlavery\nIn 1804, New Jersey enacted a law providing for the gradual abolition of slavery. With the passage of this law, all states north of the \"Mason–Dixon line\" (the boundary between Maryland and Pennsylvania) had abolished or provided for the gradual abolition of slavery within their boundaries.\nArchitecture\nThere are numerous extant buildings from the colonial era located throughout the state.\nSchools\nThe oldest continuously used  school site in the state was established in 1664 at Bergen Square, in today's Jersey City.\nTwo Colonial Colleges were founded in the Province. In 1746, The College of New Jersey (now Princeton University) was founded in Elizabethtown by a group of Great Awakening \"New Lighters\" that included Jonathan Dickinson, Aaron Burr Sr. and Peter Van Brugh Livingston. In 1756, the school moved to Princeton. In 1766, Queens College (now Rutgers University) was founded in New Brunswick by Dutch Reformed ministers with a Royal Charter from George III.  The college was named after his wife Queen Charlotte.\nRutgers Preparatory School was founded in 1766. The Newark Academy was founded in 1774.\nContinental Congress\nRepresentatives from New Jersey participated in the Continental Congress before and after the Declaration of Independence.\nRevolutionary War\nMany major battles were fought in New Jersey during the American Revolution, making it pivotal in the ultimate victory of the American colonists. The important role earned it the titles of \"Crossroads of the Revolution\" and the \"Capital of the Revolution\".\nSee also\n*Director-General of New Netherland\n*List of colonial governors of New Jersey\n*British colonization of the Americas\n*Toponymy of Bergen, New Netherland\nNotes and references\nOther sources\n*Ward, Christopher  L. The Dutch and Swedes on the Delaware, 1609-64  (University of Pennsylvania. 1930)\n*Leiby, A. C.  The Early Dutch and Swedish Settlers of New Jersey (Princeton: D. Van Nostrand Co. 1964)\nExternal links\n*[https://wiki.familysearch.org/en/New_Jersey_Emigration_and_Immigration New Jersey Emigration and Immigration]\n*[https://web.archive.org/web/20091119100643/http://faculty.njcu.edu/ckarnoutsos/Chronology_old.htm New Jersey City University: Chronology of History of New Jersey]\n*[http://www.sonofthesouth.net/revolutionary-war/colonies/new-jersey.htm New Jersey]\nFurther reading\n*\n*"
    }
  ]
}