{
  "content": [
    {
      "type": "text",
      "text": "# Colonial (PRR train)\n\n| el              =\n| speed           =\n| owners          =\n| routenumber     =\n| map             =\n| map_state       =\n}}\nThe Colonial, also known as the Colonial Express, was a service of the Pennsylvania Railroad and New York, New Haven and Hartford Railroad between Washington Union Station in Washington, D.C. and South Station in Boston, Massachusetts. It was operated until 1973 by Amtrak.\nHistory\nThe Colonial began on January 18, 1892, as a daytime express service between Boston and Washington, D.C. From Boston, the train traveled west over the New York, New Haven & Hartford's Shore Line and then the New Rochelle branch to the Harlem River, where passengers boarded the passenger steamer Maryland, which carried them to Jersey City, New Jersey. At the time, the Pennsylvania Railroad (PRR) had no station in Manhattan, so passengers heading for New York City traveled to Jersey City, then transferred to Manhattan-bound ferries. Passengers continuing south on the Colonial boarded a new train in Jersey City, which used the Pennsylvania main line to reach Philadelphia, Pennsylvania, Baltimore, Maryland and Washington. The train was renamed Federal Express in 1894.\nIn the early 1910s the waterborne segment was dropped; instead, the Boston train ran into Grand Central Terminal, while the Washington train terminated at Penn Station, which had opened in 1910. Passengers used ground transport to move between the two stations, which were a little over a mile apart. In 1917 the opening of the Hell Gate Bridge, which linked the Bronx and Queens and linked the PRR and the New Haven, allowed trains to run directly through Penn Station.\nThe PRR merged into Penn Central Transportation in 1968, which absorbed the NYNH&H in 1969. When Amtrak began operations on May 1, 1971, it took over the Federal, which ran as trains 170 and 171 (changed to 173 and 174 in the November 14 timetable). Its last trip was made on April 28, 1973.\nAmtrak reused the name in 1976 for a new Boston–Newport News train, the Colonial, which replaced the Newport News section of the James Whitcomb Riley.\nReferences\nExternal links\n*[http://www.prrths.com/PRR_hagley_intro.htm PRR Chronology]"
    }
  ]
}