{
  "content": [
    {
      "type": "text",
      "text": "# Colonial Advocate\n\n-->\n| issn            =\n| eissn           =\n| oclc            = 977184637\n}}\nThe Colonial Advocate was a weekly political journal published in Upper Canada during the 1820s and 1830s. First published by William Lyon Mackenzie on May 18, 1824, the journal frequently attacked the Upper Canada aristocracy known as the \"Family Compact\", which governed the province. Over its twelve years in publication, Mackenzie explicitly advocated constitutional change to resemble a more American government with the principles of responsible government, and working for the greater good of the people. The Colonial Advocate was used as a voice for constitutional reform, educating and inspiring citizens to take action against their government, making Mackenzie and his paper an important leader in the formation of the Upper Canada Rebellion of 1837.\nOrigins of the Colonial Advocate\nThe first edition of the Colonial Advocate was published on May 18, 1824, in Queenston, Canada. Within the year, Mackenzie relocated to York (what is now Toronto) and set up his offices there. The Colonial Advocate became the foundation for Mackenzie's political life. It would give people the information they needed to form opinions of their own. Mackenzie believed with relevant information and having opportunities for discussion, citizens would form conclusions of their own. He would blatantly state his views on members of government, using outward attacks including the names of specific people and established institutions. In a May 18, 1826 article, he attacked the Bank of Upper Canada as a \"terrible engine in the hands of the provincial administration...entirely under the thumb of parson Strachan [an influential Anglican priest, mentor to many of the Colonial leaders and member of the Executive Council of Upper Canada] and his pupils.\" He labelled the May 4, 1826 issue of the Colonial Advocate, the \"latest and loudest blast of Colonial Advocate sounded in the ears of the people of Upper Canada,\" writing, \"during the whole of our brief editorial campaign we have exercised with boldness the valuable privilege of thinking for ourselves; it may be here remarked that this boldness does not always attend the public exhibition of our countrymen; who are justly formed over the whole world for the more valuable quality of discretion.\" Attacks such as these made him disliked - even hated - among the wealthy merchant and professional class of Upper Canada.\n]]\nHe believed that the main revenue and profit from the newspaper would come from subscription, and mocked newspapers like the Hamilton Western Mercury which were profitable through government advertising.  He claimed these papers were \"openly in the pay of those who have sought for thirty years to keep the people in ignorance, squander the fruits of their industry … who had dared to stand up for the British constitution and the good of the country.\" He called the publishers \"sycophants\" and resentfully said of them, \"these man fellows will bow and scrape, and fetch and carry.\"  He was not afraid to make enemies, he wanted to provide the public with enough information so they could form their own opinions. For this he would hide nothing, not accept briberies, and publish his newspaper to expose any hidden interest by Upper Canada's elite. In the first edition, he stated \"far be it from us to desire to bring into disrepute the government of this country, yet we will not fail to point out their errors. Ridicule shall not be spared: It may effect our purpose when grave argument would fail. We will carefully go over the principal matters connected with his [Lieutnenant Governor Sir Peregrine Matiland's] administration… for the present we cannot remember anything he has done of a public nature worth recording.\"\nThe Colonial Advocate as a political voice\nThe reform movement began to gain strength in the early 1830s. After Mackenzie had received a large settlement from the Types Riot (see below), and had described the members of the Family Compact as driven solely by self-interest, the paper began to take a leading role in the Upper Canada Rebellion.\nAs stated before, public availability of information was important to Mackenzie throughout his entire political life. In the first issue of the Colonial Advocate, he stated its purpose: \"We have made our election; it is to have only one patron, and that patron is the People -- the people of the British Colonies\". On September 22, 1831, he defined the purpose of publication as \"to do the people's business and check and expose speculation and official knavery\".\nMackenzie's editorials spoke out on whatever he was feeling. The Colonial Advocate was widely read, and it was said \"to read the Advocate would to be sure of finding remarks that had been better left unsaid.\" Mackenzie was daring, he was forward, and unafraid to speak his mind. While the Colonial Advocate did publish more than politics, Mackenzie's interests shone through. He was \"obsessed with the need for honest and efficient government, and for government that would respond immediately to the criticism and the wishes and the welfare of the people.\" Through the Colonial Advocate, Mackenzie and other early newspapers made democracy possible \"at the level where it matters most -- the exchange of ideas in the neighborhood, the serious but not necessarily solemn conversation among friends\" For this, he would criticize the Family Compact, bringing to attention the imbalance of power the group held.\nFrom the beginning of its publication, the paper showed Mackenzie as a business man interested in practical improvements for the colony. It encouraged citizens to press for a representative form of government, and within his first year of publication began advocating for confederation of the British North American Colonies. He mocked the current government claiming that it had no respect for the person, and did not represent the interests of the average citizen and over well-being of society but the interests of the upper-class men.Wilson, W. R. \"William Lyon Mackenzie Part 2.\" Historical Narratives of Early Canada. 2010. Web. October 11, 2011.    The economy of Upper Canada in the early 1820s was not prosperous for Canadians. For merchants, business was slow, little money was being invested, and when compared to the United States, the situation appeared much worse  Mackenzie believed that the Americans were developing because of the willingness of the government and private executives to spend money. Unlike in the US, wealthy British statesmen were not willing to invest in the economy, and at the time, investors were needed to jump start Canadian development.\nHe especially admired the democratic system of the American government. As the reform movement accelerated in the 1830s, more Americans were immigrating north and were influencing this revolution. On May 18, 1826, he published an article praising the US in which he claims any political liberalism that has come to the province was, \"owing chiefly to our neighborhood to the United States, and the independent principles brought into the colony with them by the settlers from thence…\"\nConstitutional reform\nDuring the decade preceding the rebellion, Mackenzie advocated many reforms relating to the banking system, custom dues, heavy legal fees, education, the postal service, jury selection. He criticized the powers of the appointed justices, the granting of corporate privileges ultimately leading to the bitter relationship between Mackenzie and the group of officials named \"The Family Compact.\" At the beginning of his political career, Mackenzie called himself a \"whig of 88\" which represented the particular British constitutional idea of government known as Whiggery—which is largely what we have in Canada today. It is the idea that responsible government is an essential part of a constitutional monarchy. However his political views begin to change and began to admire the American political regime.  In the first edition of the Colonial Advocate, he writes, \"we would never wish to see British America an appendage of the American presidency; yet we would wish to see British American thrive and prosper as well does that presidency.\" Having lived there for a few years, Mackenzie got to experience first hand this sort of democracy.\nOn January 3, 1828, he published article titled \"We The People\" further discussing constitutional reform, \"\"the constitution of a country is not the act of its government, nor of any distant authority, but of the people constituting a government suited to their necessities -- a constitution contains the principles on which the government shall be established\"  once again displaying his desire to have a government that supports the people.\nPublic education\nAs society was developing, there became a higher demand for education. Based on the principles of responsible government, education was a struggle. This was for two main reasons. First, one of the main arguments arguing against responsible government was that there were not enough educated people who should be a part of government. On September 22, 1831, the Colonial Advocate published, \"we have been informed that in the most populous country township in the home district there is not at this time of the year more than one school of ten scholars, altho' the number of persons between 6 and 16 is over 600!!!\" Mackenzie then highlighted how this was part of the Family Compact's plan to stay in control, \"this is the best practical commentary upon Dr. Strachan's system of education for keeping the great mass of people in ignorance and educating and instructing a few sons of pensioners and placement to hold them in the chains of mental bondage.\" Second, keeping education under the rule of the Church of England sustained English rule in Canada. Strachan obtained permission from the Colonial Office to create a university, he saw it is as a place to \"groom the ruling elite\". However Mackenzie immediately sent a letter to the Governor General of Canada at the time, Lord Dalhousie, to get it revoked. He believed that education should be open to everyone, and as described in his is political pamphlet, \"Catechisms of Education,\" he claimed \"political education consists in a right understanding of the science of government… an agent employed in the forming the character of man...the strength of the whole depends on it\".  Mackenzie ensued the Colonial Advocate once again to attack Strachan and the Family Compact's ideals, and voiced these opinions through his papers and other publications.\nThe Family Compact\nOn September 16, 1830, the Colonial Advocate wrote, \"there is a natural aristocracy among men, founded on virtue and talents; and there is artificial aristocracy, founded on wealth and birth, without either virtue or talent\". His disrespect for this aristocracy of which he speaks was never hidden. The family compact is a slanderous or disparaging name given to a group of aristocratic officials in Upper Canada during the 1820s to 1830s. It emerged after the first Lieutenant-Governor of Upper Canada, John Graves Simcoe, immigrated to Canada and attempted to create an aristocracy by appointing his Loyalist friends to government posts and giving them land. The compact was coined with the term 'family' as the members were all linked by family, patronage, and shared political and social beliefs all to favor the mercantile upper class. They were members of executive and legislative councils, held senior bureaucratic positions, and were part of the judiciary of Upper Canada.\nIt held conservative views, opposing Mackenzie and the Colonial Advocate. The Family Compact idealized British institutions such as a balanced constitution (powers divided between the Crown and executive and the elected assembly), a hierarchal society, and an established church. As the reform movement began to develop in the 1830s, the group began to see these reformers, influenced by the Colonial Advocate, as a threat to their power.\nThe family compact held a great deal of influence and power in Upper Canada. At this time, the Canadian government was split into three parts, each of which the Family Compact members were a part of and held high positions.   First was the legislative assembly, an elected body with a broad franchise that included essentially all men who owned property. Second, there was the legislative council, an appointed body that was similar to a house of lords. Members were appointed by the Lieutenant Governor Council, and were not directly responsible to the assembly (the decisions of the assembly on the other hand, needed ratification to become effective) and had the power to 'veto' anything they disapproved. This was a key feature in the imbalance of power of the legislative council; members used this power frequently, diminishing power of the elected assembly. Third was the Executive Council. Members were appointed by and were responsible to the Lieutenant Governor during their term, and the Governor and his advisors were in control of all decisions. The executive council is different from the modern cabinet in that its members were individually responsible to the governor general, rather than collectively responsible to the representatives of the people. They did not represent the majority of the population, nor did they need a majority support for their decisions, and they were almost never asked to resign. At this time, the legislative assembly was the most democratic (in the sense that members were elected) but with the power of the Councils to 'veto' anything they did not approve of, it also made the assembly the least powerful. This meant that the departments of civil service, not headed by members of council, were overlooked by the government. This was a complaint from Mackenzie as well as other members of legislature; that the civil society was underrepresented and the Family Compact had an unfair amount of power in legislature. The solution to this problem was the concept of responsible government, which eventually became the principle of the Canadian governing system.   Mackenzie believed that this imbalance of power was further tainted by the Family Compact who held the key positions in government.\nAccording to Mackenzie, the Family Compact was \"in control of decision making\" in Upper Canada. John Strachan was a very influential member of the Family Compact. He was the leading voice of the Anglican Church and was a member of both the legislative and executive council. In the edition of November 3, 1831 of the Colonial Advocate, Mackenzie called Strachan and the rest of the Family Compact members, \"profiteering through government office\" and a \"vindictive family function.\" He stated, \"the family connection [another name for Family Compact] rules Upper Canada, a dozen of nobodies and a few placement, pensioners and individuals of well known narrow and bigoted principles; the whole of the revenues of Upper Canada are in reality of their mercy; they are paymasters, receivers, auditors, kings, lords, and commons.\" Mackenzie believed that even worse than patronage, the Family Compact enlisted themselves a sense of entitlement and aristocracy that made them believe they had the best decision-making abilities for the 'ordinary' people of Upper Canada. Mackenzie did not hesitate to express his views in his paper, a paper which reached a wide audience.\nIn 1833, Mackenzie published the names of all thirty members of the Family Compact. In this publication, he included their names, the family linkages, the government positions, and their annual income. These members held the highest positions of Upper Canada; they were judges, sheriffs, and postmasters. The report listed members straight and to the point: \"1. D'Arcy Boulton, Senior, a retired pensioner, £500, Sterling .\"\nMackenzie wrote of the Family Compact: \"the 'thirty tyrants' proceed in their systematic efforts to destroy good legislative measures; … besides the salaries of its officers fixed by law and the places and pensions and salaries and other things, your property, which its members unjustly enjoy, the legislative council demanded out the public chest last winker, for silk curtains, velvet for their throne...three out of every for of your salient representatives sanctioning the act of plunder, of robbery I might say, but I like to use mild expressions\". Mackenzie spoke to the readers, directly addressing them to build his relationship with the readers.\nThe Types Riot\nOn June 8, 1826, a group of young men were seen breaking into the ''Colonial Advocate's'' office late at night while Mackenzie was out of town on business. Most of these men were law students, lawyers, and respected businessmen. The men terrorized Mackenzie's wife and son, and the employees; they wrecked the press and threw his type in the nearby bay.Wilton, Carol. \"Lawless Law.\" Law and History Review 13.1 (1995): 111-36. JSTOR. Web. October 11, 2011.  Outside the building stood more than one magistrate witnessing the attacks without interfering. Attorney general John Beverly Robinson neither disciplined the lawyers or law students nor prosecuted them in any court. Nor did he attempt to make them pay compensation for any damages done to the ''Colonial Advocate's office. Mackenzie used this ruling to further display the unfair advantage the Family Compact has over the government, and encouraged Mackenzie to continue his attacks on the group. This incident became one of the many grievances that led to rebellion.\nResponse to Types Riot\nAlthough more of an attack than a \"riot,\" the damages were plentiful. There were many witnesses, yet the eight men prosecuted went without criminal charges. This was believed to be due to their socioeconomic status. Mackenzie did not sit back and let this group of men go unpunished. He wrote a letter to the \"Honourable Knights Citizens of Burgesses, representing the Commons of the United Kingdom and Britain and Ireland\" describing the details of the riot, and the unfair results of the judiciary. After going back and suing the rioters, this time with more witnesses and with a legal team, he was able to succeed, earning Mackenzie enough money to repair the damage and more. This money re-established the Colonial Advocate''.\nAll this negative press was creating a bad image for the Family Compact members. Soon after, Samuel Jarvis, a member of the Family Compact and a convicted rioter, published \"The Statement of Facts Relating to the Trespass on the Printing Press in the Possession of Mr. William Lyon Mackenzie\" which addressed the public and particularly the subscribers of the Colonial Advocate. Afraid of the reputation he had gained from these riots, he felt it upon himself to try and excuse his actions. \"I cannot, in justice to myself, or to those implicated through my indiscretion, remain longer silent, and quietly witness this second attempt at imposition, without an effort to counteract its wicked and mischievous tendency\" and continues, \"I had sufficient experience of the uncompromising baseness of Mr. Mackenzie's disposition, and could not doubt he would descend to the meanest and most contemptible artifices, and use the most strenuous exertions to paralyze the effect which a candid and indgenuous relation of facts was calculated to produce on the minds of a generous and impartial public.\"Jarvis, Samuel Peters. Statement of Facts Relating to the Trespass on the Printing Press in the Possession of Mr. William Lyon Mackenzie, in June 1826 Addressed to the Public Generally and Particularly to the Subscribers and Supporters of the Colonial Advocate. Ancaster, Ont.?: S.n., 1828. Microfilm. Web. November 14, 2011.  This publication demonstrates the believed power of the Colonial Advocate. Members of the Family Compact feared its ability to influence readers and the general public, and for this they decided the need to attack it in attempts to scare it away.\nThe end of the Colonial Advocate\nThe Colonial Advocate began as Mackenzie's first political endeavour. It became a voice for him to display his own political agenda and thoughts, made him known throughout Upper Canada (although not necessarily well-liked among all groups), as well as allowed him to gain a support group for constitutional reform. The Colonial Advocate created new stream of thought for the citizens of Upper Canada, bringing to attention the government of the United States to highlight different ways of governance for the benefit of the people, as well as displaying the injustices and inequalities condoned by The Family Compact. The Colonial Advocate became a \"vehicle for theoretical sovereignty\" instigating resulting in activism in Upper Canada. The last issue of Colonial Advocate was published in November 1834.\nA year before the 1837 Upper Canada Rebellion, Mackenzie wrote what would summarize his belief on newspapers and politics: \"one thing is certain, no free popular government can exist unless people are informed. An ignorant republic would surely degenerate into a most corrupt and hateful government.\"\nSee also\n* Sir John Robinson, 1st Baronet, of Toronto\n* John Strachan\n* Responsible Government\nReferences\n;Bibliography\n*\n*Craig, G. M. \"The American Impact on the Upper Canadian Reform Movement Before 1837.\" Canadian Historical Review 29.4 (1948): 333–52. University of Toronto Press. Web. October 11, 2011.\n*\n*Gates, Lillian F. \"The Decided Policy of William Lyon Mackenzie.\" Canadian Historical Review 40.3 (1959): 185–208. University of Toronto Press. Web. October 11, 2011.\n* Jarvis, Samuel Peters. Statement of Facts Relating to the Trespass on the Printing Press in the Possession of Mr. William Lyon Mackenzie, in June 1826 Addressed to the Public Generally and Particularly to the Subscribers and Supporters of the Colonial Advocate. Ancaster, Ont.?: S.n., 1828. Microfilm. Web. November 14, 2011. .\n* Kilbourn, William. Firebrand: William Lyon Mackenzie & the Rebellion in Upper Canada. Toronto, Ont.: Dundurn, 2008. Print.\n*Lindsey, Charles. William Lyon Mackenzie. 2004. Google Books\n*MacKay, R. A. \"The Political Ideas of William Lyon Mackenzie.\" The Canadian Journal of Economics and Political Science 3.1 (1937): 1-22. Google Scholar. Web. October 11, 2011\n*Mackenzie, William Lyon. \"The History of the Destruction of the Colonial Advocate Press by Officers of the Provincial Government of Upper Canada and Law Students of the Attorney & Solicitor General in Open Day: and in Presence of the Honourable William Allan, a Police Magistrate and Collector of the Customs and Stephen Heward Esquire, Auditor General of the Colony Part II.\" Hume Tracts (1827): 1-26. Print.\n* Rasporich, Anthony W. Canadian History Through the Press Series: William Lyon Mackenzie. Toronto: Holt, Rinehart and Winston of Canada, 1972. Print.\n*\n*Valpy, Michael. \"SMC315.\" Class Lecture SMC315. Alumni Hall, Toronto. November 28, 2011. Lecture.\n*[http://www.electricscotland.com/history/canada/mackenzie_williamlyon.htm \"William Lyon Mackenzie.\" Canadian History. Electric Scotland. Web. October 10, 2011.]\n*\n*Wilton, Carol. \"Lawless Law.\" Law and History Review 13.1 (1995): 111–36. JSTOR. Web. October 11, 2011. .\n;Notes"
    }
  ]
}