{
  "content": [
    {
      "type": "text",
      "text": "# Columbus Wardogs\n\n| coach = Joe Campbell (2001)Pete Constanza (2002)John Fourcade (2003–2004)\n| owner = Ed RandleTripp AmosMike SammondJohn Kehoe\n| president = Mike Sammond\n| mascot = Scout\n| cheerleaders = Wardolls\n| league =\naf2 (–)\n* American Conference (2001–2004)\n** Southeastern Division (2001)\n** Eastern Division (2002)\n** Southern Division (2003–2004)\n| team_history =\n* Columbus Wardogs (2001–2004)\n* Mississippi Headhunters\n| no_league_champs =\n| no_conf_champs =\n| no_div_champs =\n| league_champs =\n| conf_champs =\n| div_champs =\n| playoff_appearances =\n| no_playoff_appearances =\n| arena_years =\n* Columbus Civic Center (2001–2004)\n}}\nThe Columbus Wardogs were an arena football team in af2 that played their home games in the Columbus Civic Center in Columbus, Georgia, from 2001 through 2004. The franchise was relocated as the Mississippi Headhunters for the 2006 season, but did not play any games.\nHistory\nIn 1998, Columbus Civic Center general manager Tony Ford contacted the Arena Football League about expanding into Columbus but was informed that the market was too small. In 2000, the Arena Football League launched its developmental league known as af2 which featured franchises in smaller cities. On May 3, 2000, af2 commissioner Mary Ellen Garling toured the Columbus Civic Center and announced she hoped the league could expand into Columbus for the 2001 season.\nIn October, an ownership group, which included Primerica executive Ed Randle as majority owner and Mike Sammond, a former Columbus sportscaster with WRBL TV who helped launch the league's Birmingham Steeldogs a year earlier, were approved and granted an af2 expansion franchise for the city. The Columbus Civic Center hosted a press conference on October 30, 2000, to formally announce the new franchise. The following month, Nashville Kats assistant coach Joe Campbell was introduced as the team's first head coach. The Wardogs' name and logo were unveiled in November. The team's name was in recognition of the nearby major college football schools of Auburn University (War Eagle battle cry) and the University of Georgia (Bulldogs), while also honoring the nearby army post of Fort Benning, a main training ground for military war dogs.\nBefore the season, the team hired longtime Auburn football announcer Jim Fyffe as the team's radio play-by-play announcer. The team also introduced Scout, a German Shepherd mix rescued from the Muscogee County Humane Society, as the team's official mascot.\n2001 season\nThe Wardogs played their first game on April 7, 2001, losing at home 43–20 to the Baton Rouge Blaze. After losing their first seven games, head coach Joe Campbell was fired and replaced by an assistant coach to finish out the season. Campbell's Wardogs were outscored 404–193 in his brief tenure, including a 94–44 loss to Charleston during the second week of the season. The Wardogs finished their inaugural season winless with an 0–16 record. Following the season, Iowa Barnstormers offensive coordinator Pete Constanza was hired as the Wardogs' new head coach.\n2002 season\nBefore the season, local business executive Tripp Amos, grandson of Bill Amos, one of the founders of Columbus-based insurance company Aflac, became a minority owner of the team.\nAfter losing their first game of the 2002 season on the road, the Wardogs claimed their first franchise victory the following week on April 20 at home with a 19–14 win over the Jacksonville Tomcats. On May 18, the Wardogs defeated the Louisville Fire 34–31 to mark the first road win in franchise history. The Wardogs finished their second season with an overall record of 4–12. Following the season, Constanza left to become the head coach of the Albany Conquest. In December, the team named former NFL quarterback John Fourcade as the new head coach.\n2003 season\nThe Wardogs opened the 2003 season with two straight wins, beating the Memphis Xplorers 26–25 on the final play of the game and then defeating Rochester 47–32 the following week. Despite the quick start, Columbus won only two more games and finished the season with a 4–12 record.\n2004 season\nOn March 28, the Wardogs played a preseason exhibition game, named Freedom Bowl 2 against Team Down Under, made up of players from Australia and New Zealand. The Wardogs won the game 80–0.\nAfter a slow start to the 2004 regular season, the Wardogs went through a hot stretch in the middle of the season winning five of six games, including last-second home wins over Birmingham 44–42 and in-state rival Macon 46–45. The club was led by offensive specialist Adrian Cockfield, who set several franchise single-season receiving records, and rookie wide receiver Troy Bergeron, who set several franchise single-game receiving marks. A local high school standout, the 20-year-old Bergeron was then the youngest player in af2 history. With a 6–6 record, the Wardogs were in playoff contention before losing their final four games to finish the season at 6–10.\nSale of team\nAlthough the Wardogs were one of the top teams in the league in corporate sponsorship sales and were recognized for their in-arena promotions (including having one of their players married at halftime while in full uniform), the Wardogs struggled at the gate. After four seasons of low attendance, ownership announced it was suspending operations for the 2005 season and looking for a buyer.\nThe inactive club was sold to real estate developer Greg Disotell in the summer of 2005, relocated to Biloxi, Mississippi, and renamed the Mississippi Headhunters. The team was unable to play the 2006 af2 season due to damage to the Mississippi Coast Coliseum caused by Hurricane Katrina. Disotell announced plans to build a new 12,000-seat arena for his team in Pearl, (a suburb of Jackson) but ultimately he was unable to secure funding and never played.\nSeason-by-season\n{| class=\"wikitable\"\n|bgcolor=\"#FFCCCC\"|ArenaCup champions\n|bgcolor=\"#DDFFDD\"|ArenaCup appearances\n|bgcolor=\"#D0E7FF\"|Division champions\n|bgcolor=\"#96CDCD\"|Playoff berth\n|}\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n!rowspan=\"2\"|Season\n!rowspan=\"2\" |League\n!rowspan=\"2\" |Conference\n!rowspan=\"2\"|Division\n!colspan=\"3\"|Regular season\n!rowspan=\"2\"|Postseason\n|-\n!Finish !! Wins !! Losses\n|-\n| 2001 || AF2 || American || Southeastern || 7th || 0 || 16 ||\n|-\n| 2002 || AF2 || American || Eastern || 4th || 4 || 12 ||\n|-\n| 2003 || AF2 || American || Southern || 5th || 4 || 12 ||\n|-\n| 2004 || AF2 || American || Southern || 3rd || 6 || 10 ||\n|-\n!colspan=\"5\"|Total\n| 14 || 50\n|}\nNotable players\n* Troy Bergeron – wide receiver\n* Rob Keefe – defensive specialist\n* Kyle Rowley – quarterback\nReferences\nExternal links\n* [http://www.arenafan.com/teams/?page=history&team=79&year=2004 Columbus Wardogs on ArenaFan.com]"
    }
  ]
}