{
  "content": [
    {
      "type": "text",
      "text": "# Comedy Queen Janet\n\n}}\n| birth_date   =\n| occupation   =\n| years_active = 1988–present\n| spouse       =\n| children     = 2\n}}\nJaneth Nunes e Almeida (née Nunes; born 28 November 1973), known professionally as Comedy Queen Janet or mononymously as Janet, is a comedian, actress, and singer based in London, UK. She is known for her work in Konkani films and tiatr (theatre) productions. During her early career as a comedian, she rose to fame as part of a comedy trio alongside fellow entertainers Comedian Agostinho and Comedian Selvy.\nEarly life\nAlmeida was born as Janeth Nunes on 28 November 1973 in the neighborhood of Mandopa in Navelim, Goa, India. Her parents were Joaquim Nunes and Clara Carneiro. Joaquim was a railway worker with origins in the neighborhood of Dongri in Mandur, Goa. He was known for his collaborations with the Konkani comedian Jacinto Vaz in tiatrs, a distinctive style of Goan theater. Furthermore, he was noted for his participation in raising toasts and performing \"toast songs\" (saude), a genre of Goan drinking songs. Almeida's mother, Clara, was known for her singing abilities. She was commonly requested to lend her vocal talents to wedding festivities in Goa, specifically during the traditional roce ceremony.\nAlmeida began performing publicly at a very early age. During her early childhood at around the age of 9, when she was in the 4th grade, she often entertained audiences with her singing talent at school assemblies and community events in her village, receiving invitations to perform from the young boys in the area. During this period, Agnelo D'Costa, a well-known singer originating from her town of Navelim, was also actively performing in the region. One day, Almeida encountered D'Costa riding a bicycle and, having heard him sing on the radio before, she approached him and asked him to share one of his songs with her. Rather than simply giving her a song to perform, D'Costa extended an offer for her to join him in his upcoming musical production that was to feature professional Goan theater artists. In this collaboration, Almeida was tasked with providing vocal accompaniment to D'Costa as the lead singer. Through this opportunity, she went on to participate in three of D'Costa's musical shows.\nCareer\nAlmeida's professional acting career began in 1988 at the age of 15, when she was invited to perform in the tiatr (Goan Konkani theater) production Gulam (Servant), directed by Peter de Benaulim. Following her debut, Almeida went on to act in various khells (street plays) produced by Menino De Bandar. This exposure led to further opportunities, and she subsequently performed in tiatrs (or theater productions) directed by a number of popular figures in the local theater scene, including Lino Dourado, Jack Ferry, Roseferns, C. D'Silva, her future husband Filipe Almeida, Joe Rose, Mario Menezes, Prince Jacob, Pascoal Rodrigues, Patrick Dourado, Meena Leitao, Premanand Sangodkar, Elvis-Carmin, and Wilmix-Sharon. Lino's work involved her participation in a minimum of three theatrical productions known as khell tiatrs. As Almeida's career progressed, she became a regular performer, often collaborating with her husband Filipe as well as other popular directors in the Goan theatrical tradition.\nAlmeida has been involved in various theatrical and cinematic productions in the region. In July 2015, she was cast in the tiatr (Goan theater) production titled Maink Paik Azilant Dovorat (Keep Parents At Eldercare). In this performance, she played the role of a wife opposite the Comedian Ambe. Additionally, she participated as a vocalist in a sextet ensemble that included Aurelio, Ambe, Franky Gonsalves, David, and Samenca. Two years later, in June 2017, Almeida was featured in the Konkani film Chori (Theft), directed by Jacinto Cruz. For this DVD-format movie, she was cast alongside her husband Filipe, with the two portraying comedic characters. A review published in the local newspaper O Heraldo observed that Almeida, Filipe, Comedian Selvy, Comedian Richard, and Comedian Agostinho combine to form a well-balanced quintet that excels in providing humor and entertainment. However, the reviewer proposed that the inclusion of extra comedic scenes might have elevated the overall quality of the film's presentation.\nIn February 2015, Almeida was cast in the role of Ashmusao in the tiatr production Pai (Father), directed by Comedian Agostinho. The play went on to win first place at the 6th Tiatr Academy of Goa's Popular Tiatr Festival. The following year, in 2016, Almeida appeared in another tiatr titled Apurbaiechim Fulam (Affectionate Flowers), produced by Lawry Travasso. This production was later released on DVD, and Almeida's performance in a comedic role was praised by reviewers. She continued to work in tiatr productions, and in January 2019 she was cast in the play Mera Bharat Mahaan (My India is Great), again directed by Comedian Agostinho. In this production, Almeida performed comedic scenes alongside several other well-known tiatr artists, including Agostinho, Comedian Selvy, Fiona, and Jose de Velsao. While her individual performance was noted, some reviews suggested her comedic chemistry with the ensemble cast was not entirely seamless.\nIn the early 2000s, Almeida and her husband Filipe co-directed a Goan theatrical performance known as a tiatr titled Soglim Khuxeal (Everyone's Happy). This production was presented in 2005 by Tony Gonsalves as part of the Wembley Goans UK group, based in Wembley, England. The tiatr production was performed in Paris and traveled to various countries in the Gulf region, such as Dubai, Kuwait, and Bahrain, entertaining audiences in those locations. After relocating to London, UK, Almeida made a return to the Goan theater scene in December 2023. She was cast in the tiatr Past is Past, directed by Comedian Agostinho. In this production, she portrayed the role of a comedian named Paracetamol, while her daughter Swizerl played the character of Crocin. As of 2012, Soglim Khuxeal remains the sole directed work attributed to Almeida.\nPersonal life\nIn 1999, Almeida was performing in the tiatr Goonda (Goon) by Roseferns alongside fellow tiatrist Filipe. During this production, they became acquainted and developed a close personal friendship. Approximately six months after first meeting, the couple decided to marry. On 21 November 1999, they held their wedding ceremony at the Our Lady of Merces Church in Colva, Goa. Prior to this religious service, they had also completed a civil marriage registration five days earlier.\nFilipe, who was 32 years old at the time of their marriage, hailed from Colva. Together, they had two children a daughter named Swizerl, and a son Sweden. Both of their children later made their own debuts on the Konkani stage, with Swizerl establishing a career as a comedian. As of 2012, Almeida and her family were residing in Colva, Goa. However, they subsequently relocated to London, United Kingdom. During her professional journey, Almeida fostered strong working connections with Goan entertainers such as Comedian Agostinho and Comedian Selvy. Together, they formed a comedy trio and collaborated on various performances.\nNotes\nReferences\nExternal links\n*"
    }
  ]
}