{
  "content": [
    {
      "type": "text",
      "text": "# Commissioner's Award\n\nThe '''Commissioner's Award''' is presented annually by the Commissioner of the Canadian Football League to an individual or individuals who have demonstrated dedication and made a significant contribution to Canadian Football.  The award was first introduced in the 1990 CFL season.\nAward winners\n*2025 – Wade Miller, President and CEO Winnipeg Blue Bombers\n*2024 – Amar Doman, Owner BC Lions\n*2023 – Bob Young, Owner Hamilton Tiger Cats\n*2022 – Jeff Harbin, CFL Manager, Officiating, long time on-field official, replay official, Rules Committee member, Rule Book editor.\n*2021 – Nurse Sara May, Hamilton-area nurse in honour of her work during COVID-19 pandemic.\n*2019 – Jim Lawson, chairman of the CFL's Board of Governors\n*2018 – Pierre Vercheval\n*2017 – Rick Sowieta, former Ottawa Rough Rider\n*2016 – Jason Colero – Toronto Argonauts Director of Education & Community Programs\n*2015 – Bernie Custis, CFL's first Black Quarterback\n*2014 – Ottawa Redblack ownership group\n*2013 – Dwayne Mandrusiak, Edmonton Eskimos Equipment Manager\n*2012 – Every CFL player all-time (accepted by CFLPA president Mike Morreale)\n*2011 – Larry Reda, BC Amateur Football\n*2010 – Ridernation, All the fans of Saskatchewan Roughriders\n*2009 – Wally Buono, Calgary Stampeders and BC Lions GM and Coach\n*2008 – Ron Lancaster, Outstanding career with several CFL teams as player, Coach, CBC broadcaster\n*2007 – Keith Pelley, Toronto Argonauts\n*2006 – Winnipeg Blue Bombers Ghosts, accepted by team board member Gene Dunn\n*2005 – The Waterboys\n*2004 – Russ Jackson, Ottawa Rough Riders Hall of Fame Quarterback\n*2003 – TSN, Toronto\n*2002 – Hugh Campbell, Long time Edmonton Eskimos Coach/GM/CEO & President\n*2001 – Robert Wetenhall and Larry Smith, Montreal Alouettes owners\n*2000 – Jeff Gilles, Toronto Argonauts\n*1999 – Fausto Bellomino, Toronto\n*1998 – Jim Hunt, Toronto writer, radio broadcaster\n*1997 – Bolan and Egres\n*1996 – John Tory, Toronto Argonauts\n*1995 – Don Wittman, CBC Broadcaster\n*1994 – Norm Fieldgate, British Columbia Lions\n*1993 – Reg Wheeler, Hamilton Wildcats, helped build Canadian Football Hall of Fame\n*1992 – Tom Shepherd, Saskatchewan Roughriders\n*1991 – Jack Matheson, Winnipeg Tribune sports writer\n*1990 – Greg B. Fulton, played for Calgary, he developed play-by-play summaries and record stats for the CFL, & member of CFL rules committee.\nReferences"
    }
  ]
}