{
  "content": [
    {
      "type": "text",
      "text": "# Commonwealth of Independent States Treaty on Free Trade Area\n\n)\n| linking_name           = the Commonwealth of Independent States Treaty on Free Trade Area\n| symbol_type            =\n| image_symbol           =\n| image_map              = CISFTA (orthographic projection).svg\n| map_width              = 220px\n| map_caption            =\n| org_type               = Free-trade area\n| membership_type        = Member states\n| membership             = |||||||| (separate document)}}\n| admin_center_type      =\n| admin_center           =\n| languages_type         = Languages\n| languages              = Russian language only (Article 25), dispute-settlement only in the Russian language (Article 44 of Annex 4)\n| leader_title1          =\n| leader_name1           =\n| leader_title2          =\n| leader_name2           =\n| established_event1     = Free trade agreement signed\n| established_date1      = 18 October 2011\n| established_event2     = Free Trade Area established\n| established_date2      =\n| area_rank              =\n| area_magnitude         =\n| area_km2               =\n| area_sq_mi             =\n| percent_water          =\n| population_estimate    =\n| population_estimate_rank =\n| population_estimate_year =\n| population_density_km2 =\n| population_density_sq_mi =\n| population_density_rank =\n| GDP_PPP                =\n| GDP_PPP_rank           =\n| GDP_PPP_year           =\n| GDP_PPP_per_capita     =\n| GDP_PPP_per_capita_rank =\n| GDP_nominal            =\n| GDP_nominal_rank       =\n| GDP_nominal_year       =\n| GDP_nominal_per_capita =\n| GDP_nominal_per_capita_rank =\n| currency               =\n| official_website       =\n}}\nTreaty on Free Trade Area is an international treaty on a free trade regime in goods signed by eight post-Soviet states on 18 October 2011, at a meeting of the Commonwealth of Independent States (CIS) Council of Heads of Government in St. Petersburg and entered into force on 20 September 2012. It creates Free Trade Area among Russia, Ukraine, Belarus, Moldova, Armenia, Kyrgyzstan, Kazakhstan and Tajikistan. This treaty and other agreements within the Commonwealth of Independent States do not regulate relations with third countries, the terms of the CIS FTA allow member states to enter into the FTA agreements with other countries, as well as to join/create custom unions.\nThe treaty is de jure open for accession even for those countries that are not participants of the CIS (Article 24). For each country, upon entry into force, the rules of origin adopted on 20 November 2009 will apply to mutual trade (Article 4), while the 1994 free trade agreement and the 1999 protocol will cease to be in effect among ratifiers (Annex 5). In accordance with the rules of origin, the goods must be provided with a preferential certificate CT-1 or a declaration of origin (if no irregularity is suspected) in order to be admitted to markets without tariffs.\nUzbekistan has not signed and is not a party to this treaty. In 2013, the protocol on the application of the CIS FTA between Uzbekistan and eight states was signed. It entered into force in 2014. Article 2 of the Protocol gives Uzbekistan the right not to apply the rules of origin of goods of 2009, instead of which Uzbekistan applies the rules of origin of goods adopted on 24 September 1993.\nUzbekistan has announced the future application of the new rules of origin, but as of 2024 it has not yet acceded. The members of the Eurasian Economic Union use a grandfather clause (Article 102 of the Treaty on the Eurasian Economic Union) in order to apply the CIS FTA Treaty and the other agreements (both 1993 and 2009 rules of origin) with third countries concluded before 1 January 2015 but they do not have the national competence to independently conclude new free trade in goods agreements after 2015.\nHistory\n.]]\nThe Commonwealth of Independent States Free Trade Zone Agreement, proposed since the breakup of the Soviet Union in 1991, was signed on 18 October 2011 by Russia, Ukraine, Belarus, Kazakhstan, Kyrgyzstan, Tajikistan, Moldova and Armenia. The agreement replaces existing bilateral and multilateral free trade agreements among the countries. Initially, the treaty was only ratified by Russia, Belarus, and Ukraine, however by the end of 2012, Kazakhstan, Armenia, and Moldova had also completed ratification. In December 2013, Uzbekistan signed and then ratified the treaty, while the remaining two signatories, Kyrgyzstan and Tajikistan, later both ratified the treaty in January 2014 and December 2015 respectively. Azerbaijan is the only full CIS member state not to participate in the free trade area.\nEuropean Union–Ukraine trade agreement controversy\nFrom 1 January 2016, Ukraine and the European Union started provisionally applying a Deep and Comprehensive Free Trade Agreement. Member states of the Eurasian Economic Union (EEU or EAEU) held consultations on 22 December 2015 to discuss the implications of the agreement concerning the possible duty-free transit of EU goods into the EEU via Ukraine. The states agreed to implement a provisional scheme later in 2016 that would impose customs checks on goods entering the EEU from Ukraine; and long term, to establish a common information system to control all imports into the EEU's customs area. Nonetheless, Russia promulgated a decree in mid-December 2015 suspending its CIS Free Trade Agreement with respect to Ukraine from 1 January 2016. In late December, the Ukrainian Government responded by passing trade restrictions on Russia, with effect from 2 January 2016. Agreements between Ukraine and other EEU states within the free trade area remain in effect.\nOn 1 November 2022, Verkhovna Rada MP Roksolana Pidlasa made a draft bill to denounce the proposed to Treaty on the Free Trade Area (CIS) dated 18 October 2011. After meeting with Prime Minister Denys Shmyhal, she said, \"It is time to decolonize our trade. We have bilateral free trade agreements with all CIS member countries, the GUAM Free Trade Agreement, and we also apply the Pan-Euro-Med regional convention with Georgia and Moldova. There are many tools that work for Ukrainian manufacturers. There is no need to participate in a treaty where Russia imposes its rules and uses the right of force.\" Pidlasa reminded and noted that \"in addition to Russia, whose trade is embargoed, Belarus, Armenia, Kazakhstan, Kyrgyzstan, Moldova, Tajikistan and Turkmenistan are also parties to the agreement, and Uzbekistan applies the agreement on separately defined terms.\"\nSignature and ratification\nAn overview of signatures and ratifications is shown below:\n{| class=\"wikitable sortable\"\n|-\n! State !! Signature !! Entry into Force !! Comment\n|-\n||| ||  || EAEU member\n|-\n|  ||  ||  || EAEU member\n|-\n|   ||  ||  || EAEU member\n|-\n|   ||  ||  || EAEU member\n|-\n|   ||  ||  || EAEU observer\n|-\n|  ||  ||  || EAEU member\n|-\n|   ||  ||  ||\n|-\n|  ||  ||  || Former CIS participant\n|-\n|  ||  ||  || EAEU observer\n|}\nIn 2013, the protocol on the application of the CIS FTA between Uzbekistan and the CIS FTA member states was signed as a bilateral document and without any reservations to the CIS FTA agreement. It entered into force in 2014.\nSee also\n* Commonwealth of Independent States\n* Economic integration\n* Eurasian Economic Union\n* Free trade areas in Europe\n* Post-Soviet states\n* Trade bloc\n* Rules of Origin\n* Market access\n* Free-trade area\n* Tariff\nReferences\nFootnotes\nOnline sources\nExternal links\n* [https://cis.minsk.by/reestrv2/doc/3183#text Treaty on Free Trade Area] (Commonwealth of Independent States)\n* [http://arquivo.pt/wayback/20160517191926/http://www.worldtradelaw.net/fta/agreements/cisfta.pdf Text of agreement]\n* [https://e-cis.info/cooperation/3049/77856/ Analytical material on the Free Trade Area Treaty] (CIS, in Russian)\n* [https://tass.ru/info/2534020 CIS free trade area. Details] (TASS, in Russian)\n* [https://regnum.ru/article/2384131 CIS Free Trade Area: Is it necessary?] (Regnum, in Russian)\n* [https://e-cis.info/news/566/95417/ 10 years of the CIS Free Trade Area Treaty] (CIS, in Russian)"
    }
  ]
}