{
  "content": [
    {
      "type": "text",
      "text": "# Commission on Genetic Resources for Food and Agriculture\n\n| founder =\n| founding_location =\n| extinction =\n| merger =\n| type =\n| tax_id =\n| registration_id =\n| status =\n| purpose = Addresses issues specifically related to the conservation and sustainable use of biodiversity of relevance to food and agriculture\n| professional_title =\n| headquarters = Rome, Italy\n| location =\n| location2 =\n| additional_location =\n| additional_location2 =\n| coordinates =\n| origins =\n| region =\n| products =\n| services =\n| methods =\n| fields =\n| membership = 179\n| membership_year =\n| language =\n| owner =\n| sec_gen =\n| leader_title = Secretary\n| leader_name = Manoela Pessoa de Miranda\n| leader_title2 =\n| leader_name2 =\n| leader_title3 =\n| leader_name3 =\n| leader_title4 =\n| leader_name4 =\n| board_of_directors =\n| key_people =\n| main_organ =\n| ideology =\n| flag =\n| prayer =\n| parent_organization = Food and Agriculture Organization of the United Nations\n| subsidiaries =\n| secessions =\n| affiliations =\n| budget =\n| budget_year =\n| revenue =\n| revenue_year =\n| disbursements =\n| expenses =\n| expenses_year =\n| endowment =\n| endowment_year =\n| staff =\n| staff_year =\n| volunteers =\n| volunteers_year =\n| students =\n| students_year =\n| website = [http://www.fao.org/cgrfa/en/ Commission on Genetic Resources for Food and Agriculture]\n| remarks =\n| formerly = Commission on Plant Genetic Resources for Food and Agriculture\n| footnotes =\n| bodystyle =\n}}\nThe Commission on Genetic Resources for Food and Agriculture of the Food and Agriculture Organization of the United Nations (FAO) is an intergovernmental body that addresses issues specifically related to the conservation and sustainable use of biodiversity of relevance to food and agriculture. It was established in 1983 as the Commission on Plant Genetic Resources for Food and Agriculture. In 1995, the mandate of the Commission was extended to cover all components of biodiversity for food and agriculture and its name was changed to its current version. Its membership comprises 179 countries and the European Union.\nThe Commission’s statutes charge it with taking \"a coordinating role and ... deal[ing] with policy, sectoral and cross-sectoral matters related to the conservation and sustainable use of genetic resources of relevance to food and agriculture\". Its mission is to \"strive to halt the loss of genetic resources for food and agriculture, and to ensure world food security and sustainable development by promoting their conservation and sustainable use, including exchange, access and the fair and equitable sharing of the benefits arising from their use\".\nThe Commission’s activities include overseeing global assessments of biodiversity and genetic resources used in the various sectors of food and agriculture and developing international policy instruments related to the management of these resources.\nHistory\nThe Commission on Plant Genetic Resources for Food and Agriculture was established in 1983 in line with a resolution adopted by the Twenty-second Session of the Conference of FAO. The same resolution adopted the International Undertaking on Plant Genetic Resources for Food and Agriculture, a non-binding agreement intended to promote harmony in the management of plant genetic resources worldwide. The First Regular Session of the Commission took place in 1985.\nBetween 1983 and 1991, the Commission’s work focused on reaching agreement regarding the interpretation of the International Undertaking. From 1993 onwards, it worked on the harmonization of the International Undertaking with the Convention on Biological Diversity, a process that eventually led to the adoption of the International Treaty on Plant Genetic Resources for Food and Agriculture.\nIn 1992, Agenda 21, adopted at the United Nations Conference on Environment and Development, called for the preparation of \"periodic state of the world reports\" on plant genetic resources for food and agriculture and the preparation of a \"rolling global cooperative plan of action\" for these resources. The Commission subsequently guided the preparation of The State of the World’s Plant Genetic Resources for Food and Agriculture, published by FAO in 1997. The process led to the development and adoption of the Global Plan of Action for the Conservation and Sustainable Utilization of Plant Genetic Resources for Food and Agriculture.\nIn 1995, the FAO Conference decided \"to broaden the mandate of the Commission ... to cover all components of biodiversity of relevance to food and agriculture\" and the word \"plant\" was removed from the Commission’s name.\nIn 2001, the Conference of FAO adopted the International Treaty on Plant Genetic Resources for Food and Agriculture, a legally binding instrument negotiated by the Commission.\nIn 2007, the Commission published The State of the World’s Animal Genetic Resources for Food and Agriculture. The process led to the development and adoption of the Global Plan of Action for Animal Genetic Resources.\nIn 2010, the Commission published The Second Report on the State of the World’s Plant Genetic Resources. The process led to the development and adoption of the Second Global Plan of Action for Plant Genetic Resources for Food and Agriculture in 2011.\nIn 2014, the Commission published The State of the World’s Forest Genetic Resources. The process led to the development and adoption of the Global Plan of Action for the Conservation, Sustainable Utilization and Development of Forest Genetic Resources.\nIn 2015, the Commission published The Second Report on the State of the World’s Animal Genetic Resources for Food and Agriculture.\nIn 2019, the Commission published The State of the World’s Biodiversity for Food and Agriculture and The State of the World’s Aquatic Genetic Resources for Food and Agriculture.\nTo support and facilitate the implementation of its global plans of action, the Commission has adopted a number of codes, standards and guidelines. It has also developed procedures for monitoring the implementation of the global plans of action, including through web-based information systems such as the World Information and Early Warning System on Plant Genetic Resources for Food and Agriculture (WIEWS) and the Domestic Animal Diversity Information System (DAD-IS). In the field of access and benefit-sharing, the Commission developed Elements to facilitate Domestic Implementation of Access and Benefit-Sharing for Different Subsectors of Genetic Resources for Food and Agriculture, first published in 2016 and supplemented with explanatory notes in 2019.\nMembership and operation\nMembership of the Commission is open to all members and associate members of FAO. As of January 2023, the Commission had 179 member countries; the European Union is also a member.\nThe Commission’s regular sessions are held once every two years.\nThe Commission can establish subsidiary bodies, as required, to support its work. Over the years, it has established intergovernmental technical working groups for plant (1997), animal (1998), forest (2009) and aquatic (2015) genetic resources. The regular sessions of these working groups can be held no more than once a year, with their timing and duration decided upon by the Commission. Each working group provides recommendations to the Commission on issues related to the management of genetic resources in its respective sector. Each consists of a regionally balanced group of 28 member countries chosen by the Commission. In 2011, the Commission established an Ad Hoc Intergovernmental Technical Working Group on Access and Benefit Sharing, which met once, in 2012. In 2013, this working group was replaced by the Team of Technical and Legal Experts on Access and Benefit-Sharing.\nThe Commission’s activities are guided by its Strategic Plan, which includes its rolling ten-year Multi-Year Programme of Work. The latter sets out a schedule for major outputs and milestones in the Commission’s sectoral work (as of 2019, covering plant, animal, forest, aquatic and micro-organism and invertebrate genetic resources) and non-sectoral work (as of 2019, covering The State of the World’s Biodiversity for Food and Agriculture, access and benefit-sharing, biotechnologies, \"digital sequence information\" on genetic resources for food and agriculture, climate change, nutrition and health, and the management of the Commission’s work).\nThe Secretariat of the Commission is located at FAO headquarters in Rome, Italy.\nSee also\n* Animal genetic resources for food and agriculture\n* Forest genetic resources\n* Plant genetic resources\nReferences\nExternal links\n* [http://www.fao.org/home/en/ Food and Agriculture Organization of the United Nations]\n* [http://www.fao.org/wiews/en/ World Information and Early Warning System on Plant Genetic Resources for Food and Agriculture]\n* [http://www.fao.org/dad-is/en/ Domestic Animal Diversity Information System]"
    }
  ]
}