{
  "content": [
    {
      "type": "text",
      "text": "# Commemorative Medal of the Expedition to Albania\n\n| caption          = The obverse of the Stefano Johnson-Milan (Crippa Emilio) version of&nbsp;the&nbsp;medal (left), and the reverse of another version with the Albanian double-headed eagle.\n| presenter        = Kingdom of Italy\n| country          =\n| type             = Commemorative medal\n| eligibility      = Military personnel, merchant mariners, and&nbsp;civilians\n| awarded_for      = Service during the Italian invasion of Albania\n| campaign         =\n| status           = Abolished 13&nbsp;December&nbsp;2010\n| description      =\n| motto            =\n| clasps           =\n| post-nominals    =\n| established      = 7 March 1940\n| firstawarded     =\n| lastawarded      =\n| total_awarded    =\n| total_awarded_posthumously =\n| total_recipients =\n| precedence_label =\n| individual       =\n| higher           = Commemorative Medal of the War of Liberation\n| same             =\n| lower            = Medal of Honor for Italian Citizens Deported and Interned in Nazi Concentration Camps 1943-1945\n| related          =\n| image2           = File:Italian expedition to Albania BAR.svg\n| image2_size      = 106px\n| caption2         = Ribbon of the medal\n}}\nThe Commemorative Medal of the Expedition to Albania was a decoration granted by the Kingdom of Italy to personnel who participated in the Italian invasion of Albania in 1939. It was abolished in 2010 after the Italian Republic deemed it obsolete.\nHistory\nThe Kingdom of Italy invaded Albania on 7 April 1939 and quickly conquered the country in a five-day campaign. The Italian conquest resulted in the replacement of the Kingdom of Albania under King Zog I with the Italian protectorate of Albania, with King Victor Emmanuel III of Italy as its king. The protectorate lasted from 1939 to 1943. To commemorate participation in the April 1939 invasion, Victor Emmanuel III established the Commemorative Medal of the Expedition to Albania with Royal Decree Number 683 on 7 March 1940.\nAfter deeming the medal obsolete, the Italian Republic abolished it on 13 December 2010.\nEligibility\nEligibility for the medal extended to personnel of the Italian Army, Regia Marina (), and Regia Aeronautica'' () and to merchant marine crews who took part in the invasion and occupation of the territory of the Albanian Kingdom between 7 and 16 April 1939, as well as to military and civilian personnel who supported the invading forces in Albania between those dates.\nIn addition to this officially authorized use, it was the custom of some military personnel to wear the medal in commemoration of their service in the Italian Protectorate of Albania during World War II, which Italy entered in June 1940.\nAppearance\nMedal\nThe 7 March 1940 decree establishing the medal prescribed the dimensions and colors of the medal ribbon, but left a description of the characteristics of the medal itself to another, subsequent decree. Due to Italy's entry into World War II in June 1940, the second decree never was issued. Therefore, the companies that minted the medal freely interpreted its characteristics without any official guidance or approval. As a result, there are at least four versions of the medal which present different particularities, such as the suspension on a hole at the apex of the medal with either a pin or a double ring. Descriptions of the most widely circulated versions of the medal follow.\nLorioli Brothers-Milan (Publio Morbiducci) version\nThe medal consists of a bronze or zamak disc with a diameter of  with a pin or double ring attachment. The obverse depicts a group of military men carrying various weapons, with a tank, airplane, and artillery piece in the background. Around the perimeter of the face are the words \"Spedizione in Albania\" () at the top and \"Anno XVII EF\" at the bottom. The reverse has the words \"Italia\" () and \"Albania\" separated by a Savoy knot. A Savoy eagle holding in its talons a fasces wrapped in a ribbon inscribed with the abbreviation \"FERT\" — an abbreviation of the Latin motto of the House of Savoy, Fortidudo ejus Rhodum tenuit () — is above the words. Below the words is an Albanian double-headed eagle. Around the perimeter of the face are the dates \"12-16 aprile\" () on the left and \"1939 XVII E.F.\" on the right. Savoy knots are on the edges of the dates.\nStefano Johnson-Milan (Crippa Emilio) version\nThe medal consists of a bronze disc with a diameter of 32 millimetres (1¼ inches) and a hook attachment. The obverse depicts an effigy of King Victor Emmanuel III encircled around the edge with the inscription ''Vittorio Emanuele III Re D'Italia e D'Albania. Imp.D'Etiopia (). On the reverse is the Albanian double-headed eagle holding lightning bolts in its talons, overlapping a fasces with an axe pointing to the right with a five-pointed star. Around the edge is the inscription \"Albania Redenta\" () at top and \"VII.Aprile.XVII.\" () at bottom, separated by two five-pointed stars.\nVersion Uno (\"One\")  (unknown mintage)\nThe medal consists of a bronze disc with a diameter of 32 millimetres (1¼ inches) and a pin attachment. The obverse depicts an effigy of King Victor Emmanuel III facing right, encircled around the edge with the inscription Vittorio Emanuele III Re D'Italia (), with dots between the words and \"U\" to \"V\". On the reverse is the Albanian double-headed eagle holding lightning bolts in its talons, overlapping a fasces with an axe pointing to the right with a five-pointed star. Around the edge is the inscription \"Albania Redenta\" () at top and \"VII.Aprile.XVII.\" () at bottom, separated by two five-pointed stars.\nVersion Due (\"Two\") (unknown mintage)\nThe medal consists of a bronze disc with a diameter of  and a pin attachment. The obverse depicts an effigy of King Victor Emmanuel III facing left, encircled around the edge with the inscription Vitt. Em. Re. D'Italia e di Albania. Imp. D'Etiopia (), with dots between the words and a five-pointed star placed at the bottom, between the beginning and the end of the inscription. The reverse has the words \"Italia\" () and \"Albania\" separated by a Savoy knot. A House of Savoy eagle holding in its talons a fasces wrapped in a ribbon inscribed with the abbreviation \"FERT\" is above the words. Below the words is an Albanian double-headed eagle. Around the perimeter of the face are the dates \"12-16 aprile\" () on the left and \"1939 XVII E.F.''\" on the right. Savoy knots are on the edges of the dates.\nRibbon\nThe  ribbon, which was described in the royal decree and therefore is the same for all versions of the medal, has 13 vertical lines, each  wide, alternating in the black and red colors of the flag of Albania. The ribbon has seven black and six red lines.\nSee also\nReferences"
    }
  ]
}