{
  "content": [
    {
      "type": "text",
      "text": "# Commissioner's Historic Achievement Award\n\nThe '''Commissioner's Historic Achievement Award''' is awarded by the commissioner of baseball, the chief executive of Major League Baseball (MLB), to a group or person who has made a \"major impact on the sport\" of baseball. It is not an annual award; rather, the commissioner presents it at his discretion. The trophy is a gold baseball sitting atop a cylindrical silver base, created by Tiffany & Co. The award has been presented sixteen times: thirteen times to players, once to a team, and twice to a non-player. Mark McGwire and Sammy Sosa were the first to receive the award for their parts in the 1998 MLB home run record chase. The most recent recipient is Shohei Ohtani, who was honored in 2021 for being the first player in MLB history to be an All-Star as both a starting pitcher and a lead-off hitter in the 2021 All-Star Game and for completing a two-way season as a hitter and as a pitcher. The 2001 Seattle Mariners won the award as a team for posting a 116–46 win–loss record. Roberto Clemente, the 2006 awardee, is the only player to receive the award posthumously; his award was accepted by his wife, Vera.\nThree years after McGwire and Sosa were honored, Cal Ripken Jr. and Tony Gwynn, both of whom retired after the 2001 season, received the award and were honored at the 2001 MLB All-Star Game; Ripken was elected to the American League All-Star team as a starter at third base, while Gwynn was later added as an honorary member of the National League team.\nBarry Bonds received the award in 2001, becoming the third player so honored for breaking the single-season home run record. The award was given in each year from 2004 until 2007: Roger Clemens was honored during the 2004 All-Star Game, and Ichiro Suzuki was presented with the award for breaking the single-season hits record in 2005. Rachel Robinson was honored in 2007, receiving the award for establishing the Jackie Robinson Foundation. She was the first woman and the first non-player to be thus honored. In 2014, announcer Vin Scully became the second non-player to be honored.\nRecipients\n{| class=\"wikitable sortable plainrowheaders\"\n! scope=\"col\"| Recipient\n!class=\"unsortable\" scope=\"col\"|Image\n! scope=\"col\"| Award date\n!class=\"unsortable\" scope=\"col\"| Historic achievement\n!class=\"unsortable\" scope=\"col\"|\n|-\n!scope=\"row\"|\n|\n| style=\"text-align:center;\"| September 8, 1998\n| Hit 62 home runs and broke the MLB single-season home run record previously held for 37 years by Roger Maris. Commissioner Bud Selig attended the game in which McGwire hit the record-breaking home run and awarded the newly created trophy in a post-game ceremony. McGwire would finish the season with 70 home runs.\n|\n|-\n!scope=\"row\"|\n|\n| style=\"text-align:center;\"|\n| Sosa and Mark McGwire's chase for the single-season home run record thrust the National League Central division into the spotlight, but Sosa's Chicago Cubs finished ahead of McGwire's St. Louis Cardinals in the division standings, second to the 102-win Houston Astros. Thus, Sosa was the recipient of the 1998 Most Valuable Player Award, though his 66 home runs placed him 4 behind McGwire's record of 70. Sosa went on to be the only player in MLB history to collect three 60-home-run seasons (1998, 1999, 2001).\n|\n|-\n!scope=\"row\"|\n|\n| style=\"text-align:center;\" rowspan=2| July 10, 2001\n| Ripken broke one of baseball's \"unbreakable\" records by playing in 2,131 consecutive games. His durability earned him the nickname \"Iron Man\", referencing Lou Gehrig (the \"Iron Horse\"), the player whose record he broke. Ripken would finish his career with 2,632 consecutive games played out of his 3,001 career games. He played for the Baltimore Orioles for 21 seasons, hitting 431 home runs and redefining the role of the shortstop in baseball.\n|\n|-\n!scope=\"row\"|\n|\n| Gwynn played 20 seasons with the San Diego Padres, amassing 15 All-Star appearances and leading the league in batting average 8 times. His .338 average ranks him 17th on the all-time list for career batting average. Gwynn was the 1999 recipient of the Roberto Clemente Award, won five Gold Glove Awards, and notched a .306 career average in the postseason.\n|\n|-\n!scope=\"row\"|\n|\n| style=\"text-align:center;\"| October 27, 2001\n| Set the single-season home run record with 73 home runs, breaking Mark McGuire's record of 70 from 1998. Bonds also broke Babe Ruth's single-season records for slugging percentage and walks and had one of the best all-around seasons in the history of baseball.\n|\n|-\n!scope=\"row\"| }}\n|\n| style=\"text-align:center;\"| October 28, 2001\n| Broke Lou Brock's all-time stolen bases record of 938 ten years earlier in 1991. In the 2001 season Henderson increased this record to 1,395 and broke Babe Ruth's record for most career walks and Ty Cobb's record for most all-time runs scored while also becoming the 25th player to notch 3,000 hits.\n|\n|-\n!scope=\"row\"|\n|\n| style=\"text-align:center;\"| April 1, 2002\n| The 2001 Seattle Mariners won the American League West with a 116–46 record, tying the major league record for wins first set by the 1906 Chicago Cubs and setting the American Legue record. The Mariners are the only team to receive the award.\n|\n|-\n!scope=\"row\"|\n|\n| style=\"text-align:center;\"| July 13, 2004\n| Accumulated over 300 career wins and 4000 strikeouts. Presented during the 2004 All-Star Game at Minute Maid Park in Houston to the assumed-to-be retiring Clemens, who had come out of his first retirement by signing a one-year deal to play for his hometown Houston Astros. Clemens would go on to win that year's National League Cy Young Award and play three additional seasons, finally retiring in 2007.\n|\n|-\n!scope=\"row\"|\n|\n| style=\"text-align:center;\"| April 22, 2005\n| In breaking a record many thought \"unbreakable\", Ichiro amassed 262 hits in 2004 (an MLB-leading .372 batting average). The previous single-season record had been set in 1920 by George Sisler of the St. Louis Browns (257). Ichiro also led the league in at-bats (704), plate appearances (762), and intentional walks (19).\n|\n|-\n!scope=\"row\"|\n|\n| style=\"text-align:center;\"| July 11, 2006\n| Clemente is the only posthumous recipient of the Commissioner's Historic Achievement Award. He led the league in batting average four times in his career, notching his 3,000th hit in the 1972 season (September 30). Inducted into the Hall of Fame after his death at sea, Clemente was recognized not only for his statistical achievements over his 17 seasons, but for his humanitarian contributions.\n|\n|-\n!scope=\"row\"|\n|\n| style=\"text-align:center;\"| April 15, 2007\n| Robinson, the wife of pioneer Jackie Robinson, is the only woman and the first non-player to win the Commissioner's Historic Achievement Award. In honor of her \"contribution and sacrifice to the legacy of her husband\", Selig presented the award to Robinson for her work with the Jackie Robinson Foundation. The Foundation has awarded more than $14 million in scholarships to students in need.\n|\n|-\n!scope=\"row\"|\n|\n| style=\"text-align:center;\"| October 23, 2011\n| Griffey was retired at the time of his award after having hit over 600 home runs, winning an MVP Award in 1997, and being named to the All-Century Team throughout his career. Commissioner Bud Selig described Griffey in a statement, saying he \"was a gifted all-around player with a perfect swing, a brilliant glove, and a childlike joy for the game. From the time he was just 19, Ken represented MLB with excellence and grace, and he was one of our sport's greatest ambassadors not only in Seattle and Cincinnati but also around the world. I am most appreciative for all of Ken's contributions to our national pastime.\"\n|\n|-\n!scope=\"row\"|\n|\n| style=\"text-align:center;\"| October 24, 2013\n| Rivera retired as MLB's career leader in saves (652) and games finished (952) after a 19-year career with the New York Yankees, 17 of which were spent as the team's closer. A five-time World Series champion, Rivera set numerous postseason records, including most saves (42) and lowest earned run average (0.70). He was the final MLB player to wear the uniform number 42 following its league-wide retirement in honor of Jackie Robinson. Selig described Rivera as \"a great ambassador of the game\" who \"represented his family, his country, the Yankees and all of Major League Baseball with the utmost class and dignity\".\n|\n|-\n!scope=\"row\"|\n|\n| style=\"text-align:center;\"| September 5, 2014\n| Scully is the second non-player and the first broadcaster to win the award. He was given the award during his 65th season broadcasting games for the Dodgers, with Commissioner Selig recognizing Scully's \"lifetime of extraordinary service.\" Scully broadcast Dodgers games from 1950 to 2016. He was honored with the Ford Frick Award in 1982 and was inducted in the National Radio Hall of Fame in 1995.\n|\n|-\n!scope=\"row\"|\n|\n| style=\"text-align:center;\"| September 23, 2014\n| After a 20-season career with the New York Yankees, Jeter retired with the sixth-most career hits in MLB history. A five-time World Series champion, he set numerous MLB postseason career records, including most hits (200), most runs scored (111), most doubles (32), most extra-base hits (57) and most total bases (302). Jeter is also the Yankees' franchise leader in hits, games played, stolen bases, and at bats. Selig described Jeter as \"one of the most accomplished shortstops of all-time\" who \"always represent[ed] the best of our National Pastime.\"\n|\n|-\n!scope=\"row\"|\n|\n| style=\"text-align:center;\"| October 26, 2021\n| Ohtani was an unprecedented kind of player during his first four years in Major League Baseball, performing effectively both as a starting pitcher and as a designated hitter for the Los Angeles Angels. He won the American League Rookie of the Year Award in 2018 when he hit 22 home runs as a hitter and earned four wins in ten starts as a pitcher. He did not pitch in 2019 due to Tommy John surgery, but in 2021 he broke out with 46 home runs, 100 RBIs, and 26 stolen bases offensively and recording nine wins and a 3.18 ERA on the mound. Ohtani was unanimously voted the American League Most Valuable Player, and was also the first player in MLB history to be an All-Star as both a starting pitcher and a lead-off hitter in the 2021 All-Star Game. This was the first time the award was presented by Rob Manfred.\n|\n|}\nReferences\n;General\n*\n;Inline citations"
    }
  ]
}