{
  "content": [
    {
      "type": "text",
      "text": "# Committees of Correspondence for Democracy and Socialism__disambig_1\n\n| ideology         =\n| headquarters     = San Francisco, California\n| website          =\n| country          = the United States\n| abbreviation     = CCDS\n| founder          = Gil Green\n| split            = Communist Party USA\n| newspaper        = Dialogue & Initiative\n| position         = Left-wing\n}}\nThe Committees of Correspondence for Democracy and Socialism (CCDS) is a democratic socialist group in the United States that originated in 1991 as the Committees of Correspondence, a moderate grouping in the Communist Party USA (CPUSA). Named after the Committees of Correspondence formed during the American Revolution, the group criticized the leadership of CPUSA president Gus Hall and argued that, in light of the dissolution of the Soviet Union, the party should reject Leninism and adopt a multi-tendency democratic socialist orientation. The party continues to consider itself Marxist.\nThe former CPUSA official Gil Green, as well as notable activists, such as Pete Seeger and Angela Davis, led the reformist movement in December 1991 at the national convention. Failing to win over the majority of CPUSA members, the group left the party. It held conferences to establish a new organization, which attracted independent leftists and socialists from outside the CPUSA tradition, or some who had left the party previously over its policies. In 2000, the group changed its name to the Committees of Correspondence for Democracy and Socialism. In addition to that of the CPUSA, the CCDS permits dual membership in the Democratic Socialists of America and the Socialist Party USA. Its publications include Dialogue and Initiative and Crosscurrents.\nNotable members\n* Herbert Aptheker\n* Leslie Cagan\n* Carl Davidson\n* Angela Davis\n* Gil Green\n* José La Luz\n* A. B. Magil\n* Manning Marable\n* Erwin Marquit\n* Elizabeth Martínez\n* Charlene Mitchell\n* Michael Myerson\n* Jack O'Dell\nReferences"
    }
  ]
}