{
  "content": [
    {
      "type": "text",
      "text": "# Common reed warbler__disambig_1\n\n| genus = Acrocephalus (bird)\n| species = scirpaceus\n| authority = (Hermann, 1804)\n| subdivision_ranks = Subspecies\n| subdivision = See text\n| range_map = AcrocephalusScirpaceusIUCN.svg\n| range_map_caption = Distribution\n}}\nThe common reed warbler or Eurasian reed-warbler (Acrocephalus scirpaceus) is an Old World warbler in the genus Acrocephalus. It breeds across Europe into the temperate western Palaearctic where it is migratory, wintering in sub-Saharan Africa. It is also a resident species over large parts of Africa.\nTaxonomy\nThe common reed warbler was formally described in 1804 by the French naturalist Johann Hermann under the binomial name Turdus scirpaceus. The type locality is Alsace. The common reed warbler is now one of around 40 species placed in the genus Acrocephalus that was introduced by Johann Andreas Naumann and his son Johann Friedrich Naumann in 1811. The genus name Acrocephalus is from Ancient Greek akros, \"highest\", and kephale, \"head\". It is possible that the Naumanns thought akros meant \"sharp-pointed\". The specific scirpaceus is from Latin and means \"reed\".\nTen subspecies are recognised:\n* A. s. scirpaceus (Hermann, 1804) – breeds in Europe to west Russia, Ukraine and west Turkey, northwest Africa, winters in west, central Africa\n* A. s. fuscus (Hemprich & Ehrenberg, 1833) – breeds in north Egypt and central Turkey through the Middle East to southeast European Russia, north Iran, Kazakhstan and northwest China; winters in eastern and southern Africa\n* A. s. avicenniae Ash, Pearson, DJ, Nikolaus & Colston, 1989 – coasts of the Red Sea\n* A. s. ammon Hering, Winkler & Steinheimer, 2016 – Oases along the Libya-Egypt border region\n* A. s. ambiguus (Brehm, AE, 1857) – Iberian Peninsula and northwest Africa\n* A. s. minor Lynes, 1923 – Sahel region from Senegal to west-central Sudan (Darfur)\n* A. s. cinnamomeus Reichenow, 1908 – west Ethiopia and south Somalia south through South Sudan, Uganda, Kenya, Zambia and Mozambique; patchy distribution in west Africa from south Cameroon to possibly Niger and Mali\n* A. s. suahelicus Grote, 1926 – east Tanzania to east Mozambique and eastern South Africa\n* A. s. hallae White, CMN, 1960 – southwest Angola to southwest Zambia and south to western South Africa\n* A. s. baeticatus (Vieillot, 1817) – north Botswana and Zimbabwe to southern South Africa\nAn older scientific name for the reed warbler was Acrocephalus streperus (Vieill.).\nThe mostly resident Iberian and African subspecies are sometimes treated as a separate species, the African reed warbler (Acrocephalus baeticatus).\nDescription\nThis is a medium-sized warbler,  in length with a wing-span of . The adult has an unstreaked brown back and buff underparts. The forehead is flattened, and the bill is strong and pointed. The sexes are identical, as with most warblers, but young birds are richer buff below. The common reed warbler looks similar to the great reed warbler, but the great reed warbler is larger in size and has a stronger supercilium.\nThe song is a slow, chattering jit-jit-jit with typically acrocephaline whistles and mimicry added.\nDistribution and habitat\nThis small passerine bird is a species found almost exclusively in reed beds, usually with some bushes. They can also be found in damp scrub.\nBehaviour and ecology\nFood and feeding\nLike most warblers, it is insectivorous, but will occasionally take plant material such as berries.\nBreeding\nThe males return to the breeding grounds two or three weeks before the females. The species is usually monogamous. The first eggs are laid at the end of April. The nest is usually placed in vegetation over water, especially in reeds of the genus Phragmites. The deep cylindrical cup nest is sited on average —range is between —above the surface of the water and is built entirely by the female. She takes four days to build the initial cup of grass, reed stems and leaves, and another three days to complete the lining of finer material including hair. The clutch contains three to five eggs that are laid daily. The eggs are very pale green with speckles and blotches of olive green or grey. On average they measure  and weigh . They are incubated by both parents, beginning after the penultimate egg is laid. Only the female incubates at night. The eggs hatch after 9–12 days. The nestlings are fed and cared for by both parents. They fledge after 10–12 days but continue to be fed by their parents for another 10–14 days. Up to one third of pairs raise a second brood.\nThe common reed warbler is one of the species that are brood parasitised by the common cuckoo.\nGallery\nA history of British birds (1871) (14746972441).jpg|Placement of nest\nReed Warbler Nest 10-06-12 (7173408749).jpg|View of nest with clutch\nAcrocephalus scirpaceus MHNT 323 Larache MAroc RdN.jpg|Reed warbler eggs\nCuculus canorus canorus MHNT.ZOO.2010.11.149.14.jpg|Cuculus canorus canorus egg  in a clutch of  Acrocephalus scirpaceus - MHNT\nReed warbler cuckoo.jpg|Common cuckoo chick fed by reed warbler adult\nAcrocephalus scirpaceus 2015-05.jpg|Common reed warbler\nReferences\nSources\n*\nExternal links\n* [http://ibc.lynxeds.com/species/eurasian-reed-warbler-acrocephalus-scirpaceus Eurasian reed warbler videos, photos & sounds] on the Internet Bird Collection\n* [https://avibase.bsc-eoc.org/species.jsp?avibaseid=4B3E6D256004B252&lang=EN Avibase]\n*[http://aulaenred.ibercaja.es/wp-content/uploads/359_ReedWarblerAscirpaceus.pdf Ageing and sexing (PDF; 2.3 MB) by Javier Blasco-Zumeta & Gerd-Michael Heinze]\nBibliography\n* Kishkinev, D., Chernetsov, N., Pakhomov, A., Heyers, D., and Mouritsen, H. (2015). Eurasian reed warblers compensate for virtual magnetic displacement. Curr. Biol. 25, R822–R824"
    }
  ]
}