{
  "content": [
    {
      "type": "text",
      "text": "# Comparison of open-source configuration management software\n\nThis is a comparison of notable free and open-source configuration management software, suitable for tasks like server configuration, orchestration and infrastructure as code typically performed by a system administrator.\nBasic properties\n\"Verify mode\" (also called dry run) refers to having an ability to determine whether a node is conformant with a guarantee of not modifying it, and typically involves the exclusive use of an internal language supporting read-only mode for all potentially system-modifying operations. Mutual authentication (mutual auth) refers to the client verifying the server and vice versa.\nAgent describes whether additional software daemons are required. Depending on the management software these agents are usually deployed on the target system or on one or many central controller servers.  Although Agent-less = No is colored red and might seem to be a negative, instead, having an agent can be considered quite advantageous to many. Consider the impact if an agent-less tool loses connectivity to a node while making critical changes—leaving the node in an indeterminate state that compromises its (production?) function.\n{| class=\"wikitable sortable\" style=\"text-align: center; width: 95%\"\n! style=\"width:12em\" |\n! Language\n! License\n! Mutual auth.\n! Encryption\n! Verify mode\n! Agent-less\n!  GUI\n! First release\n! Latest stable release\n|-\n!  | Ansible\n| Python\n| GPLv3+\n|\n|\n|\n|\n|\n| style=\"text-align:left;\"| 2012-03-08\n| style=\"text-align:left;\"| 2025-03-25 2.18.4\n|-\n!  | Bcfg2\n| Python\n| BSD 2-clause\n|\n|\n|\n|\n|\n| style=\"text-align:left;\"|2004-08-11\n| style=\"text-align:left;\"|2015-06-11 1.3.6\n|-\n!  | Capistrano\n| Ruby\n| MIT\n|\n|\n|\n|\n|\n| style=\"text-align:left;\"|2005\n| style=\"text-align:left;\"|2022-08-07 3.17.1\n|-\n!  | cdist\n| Python\n| GPLv3+\n|\n|\n|\n|\n|\n| style=\"text-align:left;\"|2010\n| style=\"text-align:left;\"|2021-08-24 6.9.8\n|-\n!  | Chef\n| Ruby, Erlang\n| Apache 2.0\n|\n|\n|\n|\n|\n| style=\"text-align:left;\"|2009-01-15 0.5.0\n| style=\"text-align:left;\"|2023-01-05 18.1.0 (client), 15.4.0 (server)\n|-\n!  | CFEngine\n| C\n| GPLv3\n|\n|\n|\n|\n|\n| style=\"text-align:left;\"|1993\n| style=\"text-align:left;\"|\n2025-01-07 3.26.0,\n2025-05-13 3.24.2,\n2025-05-13 3.21.7\n|-\n!  | Consfigurator\n| Scheme (SBCL)\n| GPLv3+\n|\n|\n|\n|\n|\n|\n| 2024-07-26 1.4.2\n|-\n!  | Guix\n| Scheme (Guile)\n| GPLv3+\n|\n|\n|\n|\n|\n|\n| 2022-12-19 1.4.0\n|-\n!  | ISconf\n| Python\n| GPL\n|\n|\n|\n|\n|\n| style=\"text-align:left;\"|1998\n| style=\"text-align:left;\"|2006-08-13 4.2.8.233\n|-\n!  | Juju\n| Python, Go\n| AGPL\n|\n|\n|\n|\n|\n| style=\"text-align:left;\"|2010-09-17\n| style=\"text-align:left;\"|2025-06-09 3.6.7\n|-\n!  | Local ConFiGuration system (LCFG)\n| Perl\n| GPL\n|\n|\n|\n|\n|\n| style=\"text-align:left;\"|1994\n| style=\"text-align:left;\"|Weekly Releases\n|-\n!  | NOC Project\n| Python\n| BSD 2.0\n|\n|\n|\n|\n|\n| style=\"text-align:left;\"| 2012-03-08\n| style=\"text-align:left;\"| 2015-05-20 15.05.1\n|-\n!  | OCS Inventory NG with GLPI\n| Perl, PHP, C++\n| GPL\n|\n|\n|\n|\n|\n| style=\"text-align:left;\"|2003\n| style=\"text-align:left;\"|2014-07-13\n|-\n!  | Open pc server integration (Opsi)\n| Python, Java\n| GPL\n|\n|\n|\n|\n|\n| style=\"text-align:left;\"|2004\n| style=\"text-align:left;\"|2013-03-01 4.0.3\n|-\n!  | PIKT\n| C\n| GPLv2+\n|\n|\n|\n|\n|\n| style=\"text-align:left;\"|1998\n| style=\"text-align:left;\"|2007-09-10 1.19.0\n|-\n!  | Puppet\n| Ruby, C++ & Clojure (server-side also Ruby before 4.0)\n| Apache since 2.7.0, GPL before then\n|\n|\n|\n|\n|\n| style=\"text-align:left;\"|2005-08-30\n| style=\"text-align:left;\"|2024-04 8.6.0, 7.30.0 (client), 2024-04 8.6.0, 7.17.0 (server)\n|-\n!  | Pyinfra\n| Python\n| MIT License\n|\n|\n|\n|\n|\n| style=\"text-align:left;\"| 2016-08-10 0.1\n| style=\"text-align:left;\"| 2025-01-30 3.2\n|-\n!  | Quattor\n| Perl, Python\n| Apache 2.0\n|\n|\n|\n|\n|\n| style=\"text-align:left;\"|2005-04-01\n| style=\"text-align:left;\"|2024-11-22 24.10.0\n|-\n!  | Radmind\n| C\n| BSD\n|\n|\n|\n|\n|\n| style=\"text-align:left;\"|2002-03-26\n| style=\"text-align:left;\"|2008-10-08 1.13.0\n|-\n!  | Rex\n| Perl\n| Apache\n|\n|\n|\n|\n|\n| style=\"text-align:left;\"| 2010-11-05 0.9.0\n| style=\"text-align:left;\"| 2021-07-05 1.13.4\n|-\n!  | Rudder\n| C, Scala, Rust\n| GPLv3, Apache 2.0\n|\n|\n|\n|\n|\n| style=\"text-align:left;\"| 2011-10-31\n| style=\"text-align:left;\"| 2023-07-21 7.3.4\n|-\n!  | SmartFrog\n| Java\n| Apache 2.0\n|\n|\n|\n|\n|\n| style=\"text-align:left;\"|2004-02-11\n| style=\"text-align:left;\"|2012-03-13 3.18.016\n|-\n!  | Salt\n| Python\n| Apache 2.0\n|\n|\n|\n| Both\n|\n| style=\"text-align:left;\"|2011-03-17 0.6.0\n| style=\"text-align:left;\"|2023-05-05 v3006.1\n|-\n!  | Spacewalk\n| Java (C, Perl, Python, PL/SQL)\n| GPLv2\n|\n|\n|\n|\n|\n| style=\"text-align:left;\"| 2008-06\n| style=\"text-align:left;\"| 2019-01-14 2.9\n|-\n!  | STAF\n| C++\n| CPL\n|\n|\n|\n|\n|\n| style=\"text-align:left;\"|1998-02-16\n| style=\"text-align:left;\"|2012-12-16 3.4.16\n|-\n!  | Synctool\n| Python\n| GPLv2\n|\n|\n|\n|\n|\n| style=\"text-align:left;\"|2003\n| style=\"text-align:left;\"|2019-08-11 6.3\n|-\n!  | Uyuni\n| Java, Python, PL/SQL (Perl)\n| GPLv2, Apache 2.0\n|\n|\n|\n| Both\n|\n| style=\"text-align:left;\"| 2018-06\n| style=\"text-align:left;\"| 2024-01-31-01 2024.01\n|-\n! style=\"width:12em\" |\n! Language\n! License\n! Mutual auth\n! Encrypts\n! Verify mode\n! Agent-less\n! Have a GUI\n! First release\n! Latest stable release\n|}\nPlatform support\nNote: This means platforms on which a recent version of the tool has actually been used successfully, not platforms where it should theoretically work since it is written in good portable C/C++ or an interpreted language. It should also be listed as a supported platform on the project's web site.\n{| class=\"wikitable sortable\" style=\"text-align: center; width: 95%\"\n|-\n! style=\"width:12em\" |\n! AIX\n! *BSD\n! HP-UX\n! Linux\n! OS X\n! Solaris\n! Windows\n! Others\n|-\n!  | Ansible\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n!  | Bcfg2\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n!  | CFEngine\n|\n|\n|\n|\n|\n|\n|  (enterprise version only)\n|\n|-\n!  | cdist\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n!  | Chef\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n!  | Consfigurator\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n!  | Guix\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n!  | ISconf\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n!  | Juju\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n!  | Local ConFiGuration system (LCFG)\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n!  | OCS Inventory NG\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n!  | Open pc server integration (Opsi)\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n!  | PIKT\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n!  | Puppet\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n!  | Pyinfra\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n!  | Quattor\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n!  | Radmind\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n!  | Rex\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n!  | Rudder\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n!  | SmartFrog\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n!  | Salt\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n!  | Spacewalk\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n!  | STAF\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n!  | Synctool\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n!  | Uyuni\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n! style=\"width:12em\" |\n! AIX\n! *BSD\n! HP-UX\n! Linux\n! OS X\n! Solaris\n! Windows\n! Others\n|}\nShort descriptions\nNot all tools have the same goal and the same feature set. To help distinguish between all of these software packages, here is a short description of each one.\n;Ansible\n:Combines multi-node deployment, ad-hoc task execution, and configuration management in one package. Manages nodes over SSH and requires python (2.6+ or 3.5+) to be installed on them. Modules work over JSON and standard output and can be written in any language. Uses YAML to express reusable descriptions of systems.\n;Bcfg2\n:Software to manage the configuration of a large number of computers using a central configuration model and the client–server paradigm. The system enables reconciliation between clients' state and the central configuration specification. Detailed reports provide a way to identify unmanaged configuration on hosts. Generators enable code or template-based generation of configuration files from a central data repository.\n;CFEngine\n:Lightweight agent system. Manages configuration of a large number of computers using the client–server paradigm or stand-alone. Any client state which is different from the policy description is reverted to the desired state. Configuration state is specified via a declarative language. CFEngine's paradigm is convergent \"computer immunology\".\n;cdist\n:cdist is a zero dependency configuration management system: It requires only ssh on the target host, which is usually enabled on all Unix-like machines. Only the administration host needs to have Python 3.2 installed.\n;Chef\n:Chef is a configuration management tool written in Erlang, and uses a pure Ruby DSL for writing configuration \"recipes\". These recipes contain resources that should be put into the declared state. Chef can be used as a client–server tool, or used in \"solo\" mode.\n;Consfigurator\n:While Debian and derivatives are the best supported distributions, Consfigurator also work on other distributions and various unixes but they have less support for properties for configuring specific aspects of the system. Consfigurator can set properties to be applied in scheme. This requires Consfigurator to be installed on the target computer. A more restricted language is also available which works without needing Consfigurator to be installed on the target. Remote configuration is also supported: the hosts can be defined with scheme code.\n;Guix\n:Guix integrates many things in the same tool (a distribution, package manager, configuration management tool, container environment, etc). To remotely manage systems, it needs the target machines to already run Guix or it can also alternatively deploy configurations inside Digital Ocean Droplet. The machines are configured with Scheme.\n;ISconf\n:Tool to execute commands and replicate files on all nodes. The nodes do not need to be up; the commands will be executed when they boot. The system has no central server so commands can be launched from any node and they will replicate to all nodes.\n;Juju\n:Juju concentrates on the notion of service, abstracting the notion of machine or server, and defines relations between those services that are automatically updated when two linked services observe a notable modification.\n;Local Configuration system (LCFG)\n:LCFG manages the configuration with a central description language in XML, specifying resources, aspects and profiles. Configuration is deployed using the client–server paradigm. Appropriate scripts on clients (called components) transcribe the resources into configuration files and restart services as needed.\n;Open PC server integration (Opsi)\n:Opsi is desktop management software for Windows clients based on Linux servers. It provides automatic software deployment (distribution), unattended installation of OS, patch management, hard- and software inventory, license management and software asset management, and administrative tasks for the configuration management.\n;PIKT\n:PIKT is foremost a monitoring system that also does configuration management. \"PIKT consists of a sophisticated, feature-rich file preprocessor; an innovative scripting language with unique labor-saving features; a flexible, centrally directed process scheduler; a customizing file installer; a collection of powerful command-line extensions; and other useful tools.\"\n;Puppet\n:Puppet consists of a custom declarative language to describe system configuration, distributed using the client–server paradigm (using XML-RPC protocol in older versions, with a recent switch to REST), and a library to realize the configuration. The resource abstraction layer enables administrators to describe the configuration in high-level terms, such as users, services and packages. Puppet will then ensure the server's state matches the description. There was brief support in Puppet for using a pure Ruby DSL as an alternative configuration language starting at version 2.6.0. However this feature was deprecated beginning with version 3.1.\n;Pyinfra\n:Pyinfra is an agentless server configuration management tool created in Python. Its execution speed is up to 10 times faster than Ansible. Pyinfra is also excellent for system integration, as it can control SSH connections, Docker, Terraform, Ansible, etc. using a mechanism called a connector. Pyinfra can be run ad hoc or through the API.\n;Quattor\n:The quattor information model is based on the distinction between the desired state and the actual state. The desired state is registered in a fabric-wide configuration database, using a specially designed configuration language called Pan for expressing and validating configurations, composed out of reusable hierarchical building blocks called templates. Configurations are propagated to and cached on the managed nodes.\n;Radmind\n:Radmind manages hosts configuration at the file system level. In a similar way to Tripwire (and other configuration management tools), it can detect external changes to managed configuration, and can optionally reverse the changes. Radmind does not have higher-level configuration element (services, packages) abstraction. A graphical interface is available (only) for OS X.\n;Rex\n:Rex is a remote execution system with integrated configuration management and software deployment capabilities. The admin provides configuration instructions via so-called Rexfiles. They are written in a small DSL but can also contain arbitrary Perl. It integrates well with an automated build system used in CI environments.\n;Salt\n:Salt started out as a tool for remote server management. As its usage has grown, it has gained a number of extended features, including a more comprehensive mechanism for host configuration. This is a relatively new feature facilitated through the Salt States component. With the traction that Salt has gotten in the last bit, the support for more features and platforms might continue to grow.\n;SmartFrog\n:Java-based tool to deploy and configure applications distributed across multiple machines. There is no central server; you can deploy a .SF configuration file to any node and have it distributed to peer nodes according to the distribution information contained inside the deployment descriptor itself.\n;Spacewalk\n:Spacewalk is an open source Linux and Solaris systems management service and is the upstream project for the source of Red Hat Network Satellite. Spacewalk works with RHEL, Fedora, and other RHEL derivative distributions like CentOS, Scientific Linux, etc. There are ongoing efforts on getting it packaged for inclusion in Fedora. Spacewalk provides systems inventory (hardware and software information, installation and updates of software, collection and distribution of custom software packages into manageable groups, provision systems, management and deployment of configuration files, system monitoring, virtual guest provisioning, starting/stopping/configuring virtual guests and delegating all of these actions to local or LDAP users and system entitlements). As of May 2020, Spacewalk is now EOL with users having moved to either Uyuni or Foreman/Katello.\n;STAF\n:The Software Testing Automation Framework (STAF) enables users to create cross-platform, distributed software test environments. STAF removes the tedium of building an automation infrastructure, thus enabling users to focus on building their automation service. The STAF framework provides the foundation upon which to build higher-level products, and provides a pluggable approach supported across a large variety of platforms and languages.\n;Synctool\n:Synctool aims to be easy to understand, learn and use. It is written in Python and makes use of SSH (passwordless, with host-based or key-based authentication) and rsync. No specific language is needed to configure Synctool. Synctool has dry run capabilities that enable surgical precision.\nSee also\n*List of systems management systems\nNotes\nReferences"
    }
  ]
}