{
  "content": [
    {
      "type": "text",
      "text": "# Concord's Colonial Inn\n\n| completion_date  =\n| opening_date     =\n| closing_date     =\n| developer        =\n| architect        =\n| architectural_style = American colonial\n| owner            = Michael and Dorothy Harrington (since 2015)\n| cost             =\n| elevator_count   =\n| number_of_rooms  = 54\n| number_of_suites =\n| number_of_restaurants = 2\n| floor_area       =\n| floors           =\n| number_of_bars   =\n| facilities       =\n| height           =\n| parking          = Yes (off Lowell Street)\n| website          =\n}}\n'''Concord's Colonial Inn (also known as Colonial Inn') is a historic inn in Concord, Massachusetts. Its original structure, still in use, was built in 1716. It became a hotel in 1889.\nThe inn is included in the National Register of Historic Places as part of the listed Concord Monument Square–Lexington Road Historic District. It overlooks Monument Square on the square's northwestern side, and is one of the oldest properties listed on the Register.\nThe inn was given its current name in 1900 after being known as The Colonial House (or The Colonial) for three years, and has been a member of Historic Hotels of America since 2005.\nThe building was formerly three separate constructions, combined into one in 1897. The central section is today's main inn, and it was used as an ammunitions store during the Revolutionary War; the Village Forge Tavern room was used as a storeroom for supplies.\nOriginal properties\nThree of Concord's historic houses, formerly distinct from one another, were joined to form the current structure in 1897.\nThoreau House\nThe eastern section was built in 1716 by Colonel James Minot, grandfather of cabinetmaker Ammi White who lived there. The Whites sold the house in 1799 to John Thoreau, maternal grandfather of Henry David Thoreau. John died in 1801, but the property remained the home of his son John Jr. (1787–1859) and his wife Cynthia Dunbar (1787–1872). It became known as the Thoreau House in 1889, when this and the central building were purchased at auction by John Maynard Keyes and used as a boarding house and a small hotel.\nMain building\nIn 1775, during the Revolutionary War, the central section of the structure stored arms and provisions for the Concord Minutemen.\nThe White House\nThe western section was the home of Deacon John White and his wife Esther Kettell. White would detain those people who travelled on the adjacent Lowell Road on the Sabbath.\nJohn Keyes purchased this building in 1897 and combined it with the other two, reopening as The Colonial.\nHistory\nMany inhabitants of Concord made the inn their winter home in the first half of the 20th century. Around that time, the proprietor was William R. Rand.\nIn 1960, the inn underwent a large expansion with the addition of the Prescott Wing (named for Revolutionary figure William Prescott), which doubled the number of rooms to 32. A dining room called Merchants Row was added in 1970, the name being a reference to John Thoreau, who was a merchant in Boston. The inn has a second restaurant, The Liberty, which also includes Forge Tavern.\nGerman hotelier Jurgen Demisch purchased the hotel in 1988. He owned it for 27 years, selling it to Michael and Dorothy Harrington in 2015, a year before the original building's 300th anniversary.\nNotable visitors\nIn 1775, British spy John Howe is believed to have stayed at the inn. He was under orders from General Thomas Gage to examine the \"roads, bridge, and fording places\" to ascertain the best route for an army to take between Boston and Worcester \"to destroy military stores deposited there.\" He returned via Concord, where he states that he was introduced to Major John Buttrick and others and was invited to dine with them at the tavern. His diary was published in Concord, New Hampshire, in 1827, in which he records the visit:\nThe authenticity of this source has been questioned.\nHenry David Thoreau lived at the inn with his aunts between 1835 and 1837 while he studied at Harvard University. In 1972, Jacqueline Kennedy rented rooms at the inn when she visited her daughter Caroline, who was studying at Concord Academy.\nGallery\nFile:Colonial Inn in Concord, Mass 2012-0088.jpg|Main entrance\nFile:Colonial Inn, October 2013, Concord MA.jpg|Main façade, on Monument Street\nFile:Colonial Inn, Concord, Mass (NYPL b12647398-73824).tiff|Sometime after 1898\nFile:Colonial Inn, Concord, Mass. - DPLA - 05121e1a4b5e8ec4abef7751719954fc.jpg|1929. The three separate original structures are marked by the chimney locations\nReferences\nExternal links\n*"
    }
  ]
}