{
  "content": [
    {
      "type": "text",
      "text": "# Confederation Liberty and Independence\n\n| leader2_title    = Party Leaders\n| leader2_name     =\n| leader1_title    = Co-chairman\n| leader1_name     =\n| membership       = ~11,500\n| membership_year  = 2025\n| founders         =\n| foundation       = 6 December 2018\n| headquarters     = ul. Wiejska 12a, 00-490 Warsaw\n| ideology         =\n|Polish nationalism\n|Hard Euroscepticism\n}}\n| position         = Far-right}}\n| european         = Europe of Sovereign Nations (NN)Patriots.eu (RN)\n| europarl         = Europe of Sovereign Nations (NN)Patriots for Europe (RN)\n| blank1_title     = Members\n| blank1           =\n| seats1_title     = Sejm\n| seats1           = }}\n| seats2_title     = Senate\n| seats2           = }}\n| seats3_title     = European Parliament\n| seats3           = }}\n| seats4_title     = Regional assemblies\n| seats4           = }}\n| seats5_title     = City Mayors\n| seats5           = }}\n| seats6_title     = Powiat Councils\n| seats6           = }}\n| seats7_title     = Gmina Councils\n| seats7           = }}\n| website          =\n| country          = Poland\n}}\nThe Confederation Liberty and Independence (, KWiN), frequently shortened to just Confederation (), is a far-right political alliance in Poland. It was initially founded in 2018 as a political coalition for the 2019 European Parliament election in Poland, although it was later expanded into a political party in order to circumvent the 8% vote threshold for coalitions to enter the national parliament. It won 11 seats in the Sejm after the 2019 Polish parliamentary election. Its candidate for the 2020 Polish presidential election was Krzysztof Bosak, who placed fourth among eleven candidates.\nA coalition made up of New Hope and the National Movement, it is right-wing oriented and is considered to be a part of the radical right. It has expressed right-wing populist rhetoric and a more hardline opposition stance towards the European Union and immigration. It is economically liberal and has called for lowering taxes, and has also expressed socially conservative and Polish nationalist stances.\nHistory\nTwo political parties, KORWiN and National Movement, announced in late 2018 that they had decided to run together in the 2019 European Parliament election in Poland. In early 2019, Grzegorz Braun's organization and Piotr Krzysztof Liroy-Marzec's party joined the coalition. Kaja Godek, an ultraconservative activist, announced that she would join the list. The coalition was initially dubbed the Pro-Polish Coalition. By late February 2019, it was changed to Konfederacja Korwin Braun Liroy Narodowcy. In March 2019, an application was submitted to register the party under that name, and the Federation for the Republic of Poland soon joined the alliance, including some representatives. Its name was changed again, this time to Confederation. In April the Party of Drivers joined the coalition, which soon afterward elected Marek Jakubiak as its chairman. The Confederation placed fourth in the 2019 European Parliament election, winning 4.55% of the popular vote, although it did not reach the electoral threshold. After the election, Braun applied for the registration of the Confederation of the Polish Crown.\nThe coalition was registered on 25 July 2019 under the name Confederation Liberty and Independence. Godek left the coalition soon after. Shortly before the 2019 Polish parliamentary election, a schism occurred in the coalition, with many representatives joining the coalition while some of them also left. The coalition ended up winning 6.81% of the popular vote and won 11 seats in the Sejm. Most of the support the party received was in southeast and northern parts of Poland. Around 20% of all young voters aged under-30 supported the grouping, about two-thirds of its voters were male, and more than three-fifths lived in smaller towns and rural areas. This has been highlighted as a significant change from previous right-wing alliances involving Korwin-Mikke where the base of support was almost exclusively young males. In November 2019, they presented nine candidates that took part in the 2019–20 Confederation presidential primary. The winner of the presidential primary was Krzysztof Bosak, who became the coalition candidate for the 2020 Polish presidential election. During the first round of the election, Bosak received 1,317,380 votes or 6.78%, coming fourth among eleven candidates.\nIn 2022, serious internal splits emerged as a result of Janusz Korwin-Mikke's pro-Russian and Ukrainophobic stances in light of the Russian invasion of Ukraine, causing several members to renounce their KORWiN memberships, albeit remaining within the coalition. Ahead of the 2023 Polish parliamentary election, they were considered possible kingmakers. Bosak, one of Confederation's leaders, said: \"Confederation has no intention of prolonging PiS's power or facilitating Tusk's return to power. The majority of our voters do not want this.\" Korwin-Mikke, a former member of the European Parliament who ran for the party from the Warsaw region in 2023, has a history of sexist statements about women. He said: \"I am against voting rights for women. This is biology. A woman at the age of 55, when estrogen stops working, reaches the age when she can finally vote.\" Ryszard Zajączkowski, a university professor and one of the coalition's candidates, said that Poles were subjected to what he described as genocide \"at the hands of Jews working together with communists\" after World War II, and said that communism is worse than fascism. He said: \"Compared to which the Auschwitz camp could be called a holiday camp.\" In October 2023, Korwin-Mikke was suspended from the party.\nOn April 21, 2024, in the second round of the presidential elections in Bełchatów, , a member of New Hope, was elected, becoming the party's first city president.\nIn August 2024, the Council of Leaders declared Sławomir Mentzen as the formation's candidate in the upcoming 2025 presidential election, who became the first major politician to start his presidential campaign. Despite this decision, on 15 January 2025, Grzegorz Braun, leader of the affiliate party, announced his intent to also run in the election, confirming previous speculations. As a result, Braun was expelled from the KWiN on 17 January. Janusz Korwin-Mikke, founder and former member of the KWiN, has expressed support for Braun's candidacy.\nOn 8 March 2025, party congress, which convenes once every five years, elected new Council of Leaders excluding foregoing representatives from Braun's party Włodzimierz Skalik and Robert Iwaszkiewicz, which were also expelled from the KWiN earlier that week. On 10 March, Braun's party MPs Skalik and Roman Fritz decided to leave the Confederation parliamentary group, which now counts 16 members.\nIdeology and position\nConfederation Liberty and Independence is positioned on the far right on the political spectrum. It is also considered to be a part of the radical right.\nIts ideology includes support for numerous right-wing populist ideas. It has presented a hardline opposition stance to the European Union, and has criticized its and Law and Justice's policies towards immigration, calling for harder stances against legal immigration instead. It is also socially conservative, and anti-feminist, it also supports total ban on abortion, and supports the traditional family model. It has also expressed xenophobic views, and has openly provided support for antisemitism. When it first ran in the 2019 European Parliament election, Sławomir Mentzen said: \"We don't want Jews, homosexuals, abortion, taxes and the European Union.\" He has since tried to distance himself from this. During the COVID-19 pandemic, it has also spread misinformation about COVID-19 and opposed laws that were implemented by the government.\nUnlike the Law and Justice, its economic position is orientated towards economic liberalism, and it is considered strongly pro-free market. It is Polish nationalist, and has also been described as national-liberal. In its program, they have stated their goal \"to turn Poland into a ethnocracy and culturally homogenous nation built around traditionalist-Catholic principles\". It has also expressed nativist sentiment.\nThe party has supported weapons, financial aid and diplomatic support for Ukraine following the 2022 Russian invasion of Ukraine, but argued that these should be conditioned on contracts for postwar rebuilding being guaranteed to Polish companies.\nPlatform\nConfederation's platform includes the following promises, as well as others:\n* Taxation\n** Eliminate income tax\n** Make social insurance contributions optional\n** Reduce gasoline taxes\n** Reduce government spending\n* Judicial\n** Hire more judges' assistants\n** Restore capital punishment\n* Education\n** Create a school voucher program\n** Allow parents to opt-out their children from sex-education classes\n** Create a cultural voucher that can be used on arts or museums\n* National security\n** Allow licensed civilians to own firearms\n** Allow the use of nuclear energy\n** Oppose the European Union's refugee resettlement program\n** Oppose increases in immigration\n** Require immigrants to integrate into Polish culture\n* Health\n** Ban importation of garbage\n** Oppose the European Union's climate change rules\n** Restrict access to abortion\n* Business\n** Abolish penalties for street trade and raise the limits on unlicensed trade.\n** Raise the VAT exemption to 400,000zł\n** Index the tax exempt threshold to approximately twelve times the minimum wage\n** Allow businesses to refuse services on moral grounds\nComposition\nCurrent political parties\n{| class=\"wikitable\" style=\"font-size:95%;\"\n|-\n! style=\"width:200px\" colspan=\"2\" |Name\n! style=\"width:120px\" |Ideology\n! style=\"width:90px\" |Position\n! style=\"width:140px\" |Leader\n! MPs\n! Senators\n! MEPs\n! Sejmiks\n! Entry\n|-\n| style=\"width:2px;background:#FCC200;\" |\n| New Hope\n| Right-libertarianismConservatism\n| Right-wing to far-right\n| Sławomir Mentzen\n|\n|\n|\n|\n| data-sort-value=\"2019-02-22\"|6 December 2018\n|-\n| style=\"width:2px;background:#CF1020;\" |\n| National Movement\n|\n| Far-right\n| Krzysztof Bosak\n|\n|\n|\n|\n| data-sort-value=\"2019-02-21\"|6 December 2018\n|}\nCurrent organisations and movements\n{| class=\"wikitable\" style=\"font-size:95%;\"\n|-\n! colspan=\"2\" |Name\n! Ideology\n! Position\n! Leader\n! Type\n! Entry\n|-\n| style=\"width:2px; background:#228B22;\"|\n| Agrarian-Consumer Confederation\n| Agrarianism, free-market economy\n|\n| Krzysztof Tołwiński\n| Informal organisation\n| 29 November 2019\n|-\n| style=\"width:2px; background:#000000;\"|\n| All-Polish Youth\n| Catholic nationalism, ultra-nationalism, anti-LGBT\n| Far-right\n| Marcin Kowalski\n| Political youth movement\n| 6 December 2018\n|-\n| style=\"width:2px;background:#000080;\" |\n| Conservative-Monarchist Club\n| Traditionalist conservatism, monarchism, Catholic nationalism, counter-revolutionary, integralist conservatism, anti-democracy\n| Far-right\n| Adam Wielomski\n| Philosophical and journalistic organisation\n| 7 January 2019\n|-\n| style=\"width:2px; background:green;\"|\n| Polish Peasant Bloc\n| Agrarianism, conservatism\n|\n| Wojciech Mojzesowicz\n| Informal organisation\n| 6 December 2018\n|}\nFormer political parties\n{| class=\"wikitable\" style=\"font-size:95%;\"\n|-\n! style=\"width:200px\" colspan=\"2\" |Name\n! style=\"width:120px\" |Ideology\n! style=\"width:90px\" |Position\n! style=\"width:140px\" |Leader\n! Entry\n! Exit\n|-\n| style=\"width:2px; background:#00008B;\" |\n| Federation for the Republic\n|ConservatismDirect democracy\n|Right-wing\n|Marek Jakubiak\n| 6 March 2019\n| 28 June 2019\n|-\n| style=\"width:2px; background:#FF0000;\" |\n| Effective\n| Hard Euroscepticism}}\n| Right-wing\n| Piotr \"Liroy\" Marzec\n| 1 September 2018\n| 28 June 2019\n|-\n| style=\"width:2px;background:#35134E;\" |\n| Wolnościowcy\n| Right-libertarianism\n| Right-wing\n| Artur Dziambor\n| data-sort-value=\"2022-03-17\"|17 March 2022\n| data-sort-value=\"2023-02-13\"|13 February 2023\n|-\n| style=\"width:2px;background:#050708;\" |\n|Party of Drivers\n|Right-wing populismAnti-environmentalism\n|Right-wing to far-right\n|Lech Kędzierski\n|10 April 2019\n|19 December 2022\n|-\n| style=\"width:2px;background:#0087BD;\" |\n| Union of Christian Families\n| Christian democracyCatholic nationalism\n| Right-wing\n| Bogusław Rogalski\n| 13 August 2019\n| 2024\n|-\n| style=\"width:2px; background:#000000;\" |\n| National League\n| National democracyPolish nationalism\n| Right-wing\n| Lech Kędzierski\n| 2019\n| 2023\n|-\n| style=\"width:2px;background:#DAA520;\" |\n| Confederation of the Polish Crown\n|\n| Far-right\n| Grzegorz Braun\n|  7 September 2019\n|  17 January 2025\n|}\nPolitical parties who had members with individual agreements\n{| class=\"wikitable\" style=\"font-size:95%;\"\n|-\n! style=\"width:200px\" colspan=\"2\" |Name\n! style=\"width:120px\" |Ideology\n! style=\"width:90px\" |Position\n! style=\"width:140px\" |Leader*\n! Election\n! Notes\n|-\n| style=\"width:2px; background:#FF0000;\" |\n| Free and Solidary\n|\n| Right-wing to far-right\n| Kornel Morawiecki\n| 2019 Polish parliamentary election\n|  4 party members were candidates for Piotr Liroy-Marzec's Efficient political party electoral committee in Constituency № 35 (Olsztyn) whilst the rest of the party, including its entire parliamentary club, were on Law and Justice's electoral lists.\n|-\n| style=\"width:2px; background:#4169E1;\" |\n| Congress of the New Right\n|\n| Right-wing\n| Stanisław Żółtek\n| 2019 Polish parliamentary election\n| Used Federation for the Republic of Poland's electoral lists, which in turn were in agreement with the Right Wing of the Republic, and fielded candidates in the Kraków constituencies.\n|-\n| style=\"width:2px; background:#00BFFF;\" |\n| League of Polish Families\n| Political Catholicism\n| Right-wing to far-right\n| Witold Bałażak\n| 2019 Polish parliamentary election\n| Despite being loosely affiliated with the Polish Coalition, they fielded only 1 candidate in Kraków from their electoral lists, whereas 2 other candidates used Confederation's electoral lists.\n|-\n| style=\"width:2px; background:#BF1E2E;\" |\n| National Unity  (pl)\n|\n| Far-right\n| Gabriel Janowski\n| 2019 Polish parliamentary election\n| Vice-chair of the party Paweł Połanecki was a candidate for Piotr Liroy-Marzec's Efficient political party electoral committee in the Kielce constituency, as no.2 on the list behind Piotr Liroy-Marzec himself.\n|-\n|colspan=\"7\"| *At the time in question\n|}\nFormer organisations and movements\n{| class=\"wikitable\" style=\"font-size:95%;\"\n|-\n! style=\"width:200px\" colspan=\"2\" |Name\n! style=\"width:120px\" |Ideology\n! style=\"width:90px\" |Position\n! style=\"width:140px\" |Leader\n! Type\n! Entry\n! Exit\n|-\n| style=\"width:2px;background:#FF4500;\" |\n| Life and Family Foundation\n| Anti-LGBT}}\n| Far-right\n| Kaja Godek\n| Lobbyist foundation, social activist group\n| 28 January 2019\n| 9 August 2019\n|}\nElection results\nPresidential\n{| class=wikitable\n|-\n! rowspan=2|Election year\n! rowspan=2|Candidate\n! colspan=2|1st round\n! colspan=2|2nd round\n|-\n! No. of overall votes\n! % of overall vote\n! No. of overall votes\n! % of overall vote\n|-\n! 2020\n| Krzysztof Bosak\n| 1,317,380\n| 6.78 (#4)\n| colspan=\"2\" style=\"background:lightgrey;\"|\n|-\n! 2025\n| Sławomir Mentzen\n| 2,890,530\n| 14.82 (#3)\n| colspan=\"2\" style=\"background:lightgrey;\"|\n|}\nSejm\n{|class=wikitable\n|-\n! Election\n! Votes\n! %\n! Seats\n! +/–\n! Government\n|-\n! 2019\n| 1,256,953\n| 6.81 (#5)\n| }}\n|  11\n|\n|-\n! 2023\n| 1,547,364\n| 7.16 (#5)\n| }}\n|  7\n|\n|}\nSenate\n{|class=wikitable\n|-\n! Election\n! Votes\n! %\n! Seats\n! +/–\n! Government\n|-\n! 2019\n| 144,124\n| 0.79 (#6)\n| }}\n|  0\n|\n|-\n! 2023\n| 1,443,836\n| 6.75 (#6)\n| }}\n|  0\n|\n|}\nEuropean Parliament\n{| class=\"wikitable\" style=\"text-align:center;\"\n|+\n! Election\n! Votes\n! %\n! Seats\n! +/–\n! EP Group\n|-\n! 2019\n| 621,188\n| 4.55 (#4)\n| }}\n| New\n| –\n|-\n! 2024\n| 1,420,287\n| 12.08 (#3)\n| }}\n|  6\n| ESN / PfE / NI\n|}\nRegional assemblies\n{| class=wikitable\n|-\n!Election year\n!Votes\n!%\n!Seats\n!Change\n|-\n!rowspan=\"2\"|2024\n|1,042,328\n|7.23 (#4)\n|}}\n| 2\n|-\n|colspan=\"4\"|\n|}\nInternal\n{| class=wikitable\n|-\n! rowspan=2|Year\n! rowspan=2|Election type\n! rowspan=\"2\" colspan=\"2\"|Affiliation\n! rowspan=2|Final Candidate\n! rowspan=2|Number of initial candidates\n! rowspan=2|Number of rounds\n! colspan=2|Final round\n|-\n! Electoral vote\n! Percentage\n|-\n| rowspan=2|2019–20\n| rowspan=2| American-style presidential primary\n| style=\"width:2px;background:;\" |\n| RN\n| Bosak\n| rowspan=2| 9\n| rowspan=2| 1x 16 regional preliminaries  7x convention elimination\n| style=\"background:#B7FFAD\"|163\n| style=\"background:#B7FFAD\"|51.9%\n|-\n| style=\"width:2px;background:;\" |\n| KKP\n| Braun\n| style=\"background:#FFADB7\"|146\n| style=\"background:#FFADB7\"|46.5%\n|-\n|}\nSee also\n* Kukiz'15\n* United Right\nReferences"
    }
  ]
}