{
  "content": [
    {
      "type": "text",
      "text": "# Confederate railroads in the American Civil War__disambig_1\n\nA railway mounted gun and its crew, used during the Siege of Petersburg.\nThe American Civil War was the first conflict where large armies heavily relied on railroads for transporting supplies. The Confederate States Army's railroad system was fragile and primarily designed for short hauls of cotton to nearby rivers or ocean port. Due to the South's limited manufacturing and industrial capacity, obtaining new parts during the war was challenging. Consequently, the railroad system deteriorated due to overuse, lack of maintenance, and systematic destruction by Union raiders.\nThe outbreak of war negatively impacted the Confederate railroad industry's economic fortunes. With the cotton crop hoarded under the \"King Cotton\" theory, railroads lost their primary source of income. Many had to lay off employees, including skilled technicians and engineers. Believing the war would be short, Confederate rail operators initially did not seek or build alternative sources of iron for rail construction and repair.\nAlthough railroad contracts to port towns had ceased due to the cotton export policy and the Union naval blockade, lucrative government contracts were given to rail operators with lines supplying men and arms to the front lines in Tennessee and Virginia. A consortium of rail operators established a universal rate for government contracts: two cents per mile for men and half the regular local rate for munitions, provisions, and materials. They also agreed to accept Confederate bonds at par as payment for government transportation.\nThe Confederacy's rail network suffered from two key deficiencies. First, the route structure was designed to serve the coastal shipping industry, with most lines connecting ports and river terminals to inland points. This lack of inter-railway connections rendered many railroads useless once the Union blockade was in place. Second, there was a break of gauge issue: much of the Confederate rail network used the  broad gauge, while much of North Carolina and Virginia used the . This often required cargo to be unloaded from one railroad and transported by animal-powered means to another station with a different gauge, as seen in cities like Montgomery, Alabama. Additionally, Southern railroads west of the Mississippi were isolated, disconnected, and varied widely in gauge. In contrast, many Northern railroads formed complex networks, with multiple lines serving the same cities and most using the same gauge, facilitating easier transfers.\nHistory\n1861\nAs troop movement began in earnest in May and June 1861, a significant issue emerged: many rail lines terminated in towns without connecting to other lines. This required cargo to be unloaded, transported across town, and reloaded, while soldiers and other passengers often had to stay overnight to catch a continuing train the next day. When the Confederate government attempted to address this problem, they faced local opposition. Towns favored the lack of connection because it necessitated the hiring of teamsters and increased demand for hotel rooms. Although railroad operators were not against connecting lines, they opposed the potential need to share rolling stock with rival companies.\nConfederate raids on the Union's key railroad, the Baltimore and Ohio (B&O), devastated tracks and rolling stock, causing the line to cease operations temporarily. However, the North's substantial industrial resources enabled them to quickly restore operations.\n1862\nIn early 1862, the Confederacy constructed a  spur off the Orange and Alexandria Railroad at Manassas Junction, called the Centreville Military Railroad. This spur was built to supply the Confederate defenses on the Centreville Plateau along the north side of Bull Run, feeding into the Occoquan River.\nAs the war continued, railroad operators attempted to acquire supplies from abroad due to the Confederacy's limited industrial base. The supply problem became increasingly severe, particularly for engines and cars. Stressed by overuse, lacking materials for repairs, and losing skilled workers to conscription, rail operators predicted a breaking point as early as 1862. Despite their efforts to seek assistance from the Confederate Congress throughout the war, the response was either indifferent or hostile.\n1863\nIn mid-1863, the Confederate government finally implemented a comprehensive policy concerning railroads, focused solely on aiding the war effort rather than supporting the weakening economy of the Confederate States of America. New legislation permitted the commandeering, or \"impressment,\" of railroads and their rolling stock, bringing them under de facto military control. Meanwhile, the Union's victory in the Chattanooga Campaign gave the United States Military Railroad full control of the Nashville and Chattanooga Railroad, which, after repairs, supplied the Atlanta Campaign.\n1864\nIn March 1864, the Confederate Quartermaster-General's Department mandated that all passenger trains yield to governmental trains. By mid-1864, passenger service in the Confederacy had come to a complete halt. The transport of goods for civilian use was also severely impacted, worsening shortages caused by wartime devastation, speculation, hoarding, and the Confederacy's impressment policy.In the final year of the war, the Confederate railroad system was constantly on the verge of collapse. The impressment policy of quartermasters strained the rail network to its limits. Feeder lines were dismantled to provide replacement steel for trunk lines, and the relentless use of rolling stock caused wear and tear faster than they could be repaired or replaced.\nUnion use\nAs Union armies advanced deeper into Confederate territory, they gained control of former Confederate railway lines, or what remained of them. Confederate troops typically employed a scorched earth policy towards railroads during their retreats, leaving the Union troops to rebuild entire lines from scratch to make them usable. Late in 1862, Confederate forces devastated the Mississippi Central Railroad, halting the Union invasion. General Grant later resumed the offensive, pursuing the Vicksburg Campaign along the river, where steamboats could deliver supplies.\nSherman's March to the Sea in late 1864 reversed the roles, with the Union army destroying the main line of the Georgia Railroad and others. Due to the shifting tides of the war, some rail lines were rebuilt six or seven times by opposing forces, particularly in states like Virginia, where the fighting was most intense.\nExpansion\nAttempts were made to expand the Confederacy's rail system by adding or connecting lines. Of the three major rail projects proposed and funded by the Confederate Congress, only one—a connection between Danville, Virginia, and Greensboro, North Carolina—was completed. Although the Confederate Constitution prohibited internal improvements to aid commerce, it did not forbid improvements for wartime defense.\nSee also\n* Economy of the Confederate States of America\n* List of railroads of the Confederate States of America\n* Railroad guards in the American Civil War\n* United States Military Railroad\nNotes\nReferences\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\nExternal links\n* [http://www.csa-railroads.com/ Confederate Railroads]"
    }
  ]
}