{
  "content": [
    {
      "type": "text",
      "text": "# Congress for Democracy and Progress__disambig_1\n\n| leader           = Eddie Komboïgo\n| founder          = Blaise Compaoré\n| merger           = Popular Front\n| foundation       = 6 February 1996()\n| dissolution      =\n| ideology         = Social democracy\nSocial liberalism\n| predecessor      = ODP–MT\n| successor        =\n| headquarters     = Ouagadougou\n| position         = Centre to Centre-left\n| religion         =\n| international    =\n| newspaper        =\n| colors           =\n| slogan           =\n| seats1_title     = National Assembly\n| seats1           = }}\n| flag             =\n| website          =\n| country          = Burkina Faso\n| footnotes        =\n}}\nThe Congress for Democracy and Progress (, CDP) was the ruling party in Burkina Faso from 1996 until the overthrow of Blaise Compaoré in 2014.\nHistory\nThe party was founded in February 1996 by merger of the Organization for Popular Democracy – Labour Movement and nine parties supportive of it (the National Convention of Progressive Patriots–Social Democratic Party, the Party for Democracy and Rally, the Movement for Socialist Democracy, the Union of Social Democrats, the Group of Revolutionary Democrats, the Rally of Social-Democrat Independents, the Party for Panafricanism and Unity, the Union of Democrats and Patriots of Burkina and the Party of Action for the Liberalism in Solidarity), as well as factions of the Group of Patriotic Democrats and the Burkinabé Socialist Bloc.\nFrom 1992, when the office of Prime Minister was reestablished, until  Blaise Compaoré was ousted in 2014, all Prime Ministers of Burkina Faso were members of the CDP, along with most other national officials, and the party held the most seats in Parliament.\nIn the parliamentary election held on 5 May 2002, the party won 49.5% of the popular vote and 57 out of 111 seats.\nIn the 13 November 2005 presidential election, the CDP candidate, President Compaoré, won 80.35% of the popular vote. At the May 2007 parliamentary election, the party expanded its majority, winning 73 seats.\nIn 2012, Assimi Kouanda was elected as the CDP's National Executive Secretary.\nThe party still had representation in parliament after the overthrow of Compaoré in October 2014, as well as following the November 2015 general elections.\nThe CDP held its sixth ordinary congress in Ouagadougou on 9&ndash;10 May 2015. Eddie Komboïgo, a businessman who had been a Deputy in the National Assembly prior to its 2014 dissolution, was elected as President of the CDP, while Compaoré was designated as Honorary President. On 11 July 2015, Komboïgo was designated as the CDP's candidate for the October 2015 presidential election. Komboïgo was subsequently barred from standing, and the CDP had no presidential candidate; however, it won 18 out of 127 seats in the concurrent parliamentary election. Meanwhile, party leaders were accused of involvement in the failed September 2015 coup, leading to the arrest of Komboïgo as well as a party vice-president, Léonce Koné. Together with various other opposition parties, the CDP formed the Coalition for Democracy and National Reconciliation on 16 October 2016; seeking to promote political reconciliation, it was mostly composed of forces that had backed Compaoré. The coalition stood in opposition to President Roch Marc Christian Kaboré and the ruling People's Movement for Progress (MPP), but it was distinct from the main opposition coalition, the Coalition of Democratic Forces for Real Change led by Zéphirin Diabré.\nOn 19 April 2017, the CDP criticized the forthcoming trial of Compaoré (in absentia) and members of his government in connection with efforts to suppress the October 2014 protests that led to the fall of the government. According to the CDP, the trial was a politically motivated \"witch hunt\" and \"a clear violation of the rule of law\".\nElectoral history\nPresidential elections\n{| class=wikitable style=text-align:center\n!Election\n!Party candidate\n!Votes\n!%\n!Result\n|-\n|1998\n|rowspan=3|Blaise Compaoré\n|1,996,151\n|87.5%\n|Elected\n|-\n|2005\n|1,660,148\n|80.35%\n|Elected\n|-\n|2010\n|1,358,941\n|80.2%\n|Elected\n|-\n|2020\n|Eddie Komboïgo\n|442,742\n|15.48%\n|Lost\n|}\nNational Assembly elections\n{| class=wikitable style=text-align:center\n!Election\n!Party leader\n!Votes\n!%\n!Seats\n!+/–\n!Position\n!Result\n|-\n|1997\n|rowspan=4|Blaise Compaoré\n|1,449,082\n|68.6%\n|}}\n| 8\n| 1st\n|\n|-\n|2002\n|862,119\n|49.52%\n|}}\n| 44\n| 1st\n|\n|-\n|2007\n|1,373,078\n|58.85%\n|}}\n| 16\n| 1st\n|\n|-\n|2012\n|1,467,749\n|48.66%\n|}}\n| 3\n| 1st\n|\n|-\n|2015\n|rowspan=2|Eddie Komboïgo\n|417,058\n|13.20%\n|}}\n| 52\n| 3rd\n|\n|-\n|2020\n|371,633\n|13.27%\n|}}\n| 2\n| 2nd\n|\n|}\nReferences\nExternal links\n*"
    }
  ]
}