{
  "content": [
    {
      "type": "text",
      "text": "# Congress of the Republic of Peru\n\n| legislature       = 2021–2026 Period\n| coa_pic           = Logo del Congreso (Perú).png\n| coa_res           = 159px\n| house_type        = Unicameral\n| established       = 20 September 1822(First Constituent Congress)26 July 1995(1995 Peruvian general election)\n| leader1_type      = President of Congress\n| leader1           = Fernando Rospigliosi (acting)\n| election1         = 10 October 2025\n| party1            = Popular Force\n| leader2_type      = 1st Vice President of Congress\n| leader2           = Fernando Rospigliosi\n| party2            = Popular Force\n| election2         = 26 July 2025\n| leader3_type      = 2nd Vice President of Congress\n| leader3           = Waldemar Cerrón\n| party3            = Free Peru\n| election3         = 26 July 2023\n| leader4_type      = 3rd Vice President of Congress\n| leader4           = Ilich López\n| election4         = 26 July 2025\n| party4            = Popular Action\n| structure1        = Congreso Perú 2021-2026.svg\n| structure1_res    = 250px\n| structure1_alt    =\n| seats             = 130\n| political_groups1 =\n* |border=silver}} Popular Force (21)\n* |border=silver}} Alliance for Progress (17)\n**  Unity and Peace (1)\n* |border=silver}} Podemos Perú (13)\n**  Pueblo Consciente (1)\n* |border=silver}} Together for Peru - People's Voices (12)\n* |border=silver}} Free Peru (11)\n**  Now Nation (1)\n* |border=silver}} Popular Renewal (11)\n* |border=silver}} We Are Peru (9)\n* |border=silver}} Popular Action (9)\n* |border=silver}} Go on Country (6)\n*  Socialist Bench (5)\n* |border=silver}} Democratic People's Bloc (5)\n** |border=silver}} New Peru (1)\n**  Popular Cooperation (1)\n*  Honor and Democracy (5)\n*  Not grouped (6)\n** |border=silver}} Popular Action (2)\n**  Modern Peru (1)\n| salary            = S/187,200 Annually\n| voting_system1    = Constituencies using proportional representationwith a 5% threshold\n| last_election1    = 11 April 2021\n| next_election1    = 12 April 2026\n| session_room      = Vista panorámica del Hemiciclo de sesiones del Congreso del Peru.jpg\n| session_res       = 250px\n| meeting_place     = Palacio LegislativoPlaza Bolívar, LimaRepublic of Peru\n| website           =\n}}\nThe Congress of the Republic () is the unicameral body which exercises legislative power in Peru. Due to the broadly interpreted impeachment wording in the Constitution of Peru, the President of Peru can be removed by Congress without cause, effectively making the legislature more powerful than the executive branch. Following a ruling in February 2023 by the Constitutional Court of Peru, the body tasked with interpreting the Constitution of Peru and whose members are directly chosen by Congress, judicial oversight of the legislative body was also removed by the court, essentially giving Congress absolute control of Peru's government. Since the 2021 Peruvian general election, right wing parties have held a majority in the legislature. The largest represented leftist party in Congress, Free Peru, has subsequently aligned itself with conservative and Fujimorists parties within Congress due to their institutional power.\nCongress's composition is established by Chapter I of Title IV of the Constitution of Peru. Congress is composed of representatives who sit in congressional districts allocated to each region, as well as two special districts, Lima Province and Peruvian citizens living abroad, on a basis of population as measured by the Peruvian Census in multi-member districts. The number of voting representatives is fixed by the Constitution at 130. Pursuant to the 2017 Census, the largest delegation is that of Lima Province, with 36 representatives.\nCongress is charged with the responsibility to pass laws and legislative resolutions, as well as to interpret, amend, or repeal existing laws. Congress also ratifies international treaties, approves the national budget, and authorizes loans on behalf of the country. It may also override presidential observations to bills by a vote of more than half the legal number of congressmen. It can also remove government official including the President, consent to the entry of foreign troops into the national territory, and authorize the President to leave the country. Congress meets at the Legislative Palace in Lima.\nThe presiding officer is the President of Congress, who is elected by the members thereof (and is therefore traditionally the leader of the controlling party). The President and three vice-presidents are chosen by the controlling governing coalition.\nHistory\nLegislative Palace. In front of it, the famous Tadolini's Simon Bolivar statue in the Plaza Bolívar.]]\nDetails of the façade.\nThe first Peruvian Congress was installed in 1822 as the Constitutional Congress led by Francisco Xavier de Luna Pizarro. In 1829, the government installed a bicameral Congress, made up by a Senate and a Chamber of Deputies. This system was interrupted by a number of times by Constitutional Congresses that promulgated new Constitutions that lasted for a couple of years. The Deputies reunited in the Legislative Palace and the Senators went to the former Peruvian Inquisition of Lima until 1930, when Augusto B. Leguía was overthrown by Luis Miguel Sánchez Cerro. He installed a Constitutional Congress (1931–1933) that promulgated the Constitution of 1933. By order of the president, the Peruvian Aprista Party members that were in Congress were arrested for their revolutionary doctrines against the government. When Sánchez Cerro was assassinated in 1933 by an APRA member, General Óscar R. Benavides took power and closed Congress until 1939, when Manuel Prado Ugarteche was elected president. During various dictatorships, the Congress was interrupted by coups d'état. In 1968, Juan Velasco Alvarado overthrew president Fernando Belaúnde by a coup d'état, closing again the Congress.\nThe 1979 Constitution was promulgated on 12 July 1979 by the Constitutional Assembly elected following 10 years of military rule and replaced the suspended 1933 Constitution. It became effective in 1980 with the re-election of deposed President Fernando Belaúnde. It limited the president to a single five-year term and established a bicameral legislature consisting of a 60-member Senate (upper house) and a 180-member Chamber of Deputies (lower house). Members of both chambers were elected for five-year terms, running concurrently with that of the president. Party-list proportional representation was used for both chambers: on a regional basis for the Senate, and using the D'Hondt method for the lower house. Members of both houses had to be Peruvian citizens, with a minimum age of 25 for deputies and 35 for senators. At the beginning of the 1990s, the bicameral congress had a low public approval rating. President Alberto Fujimori did not have the majority in both chambers, the opposition led the Congress, impeding the power that Fujimori had as president. He made the decision of dissolving Congress by a self-coup to his government in 1992.\nFollowing the self-coup, in which Congress was dissolved, the Democratic Constitutional Congress established a single chamber of 120 members. The Democratic Constitutional Congress promulgated the 1993 Constitution in which gave more power to the President. The new unicameral Congress started working in 1995, dominated by Fujimori's Congressmen that had the majority. The Congress permits a one-year term for a Congressman or Congresswoman to become President of Congress.\nDuring the presidencies of Ollanta Humala, Pedro Pablo Kuczynski and Martín Vizcarra, the right-wing Congress led by the daughter of the former Peruvian dictator Alberto Fujimori, Keiko Fujimori, obstructed much of the actions performed by the presidents. According to Walter Albán, head of Transparency International Peru, the Congress of Peru has recently been infiltrated by criminal groups that obstruct reforms in order to maintain their status and parliamentary immunity.\nThe 2016-2021 congressional term was dissolved by President Martín Vizcarra in September 2019, triggering the 2019–2020 Peruvian constitutional crisis. Vizcarra issued a decree that set snap elections for 26 January 2020. The representatives served out the remainder of the original legislative term, which expired in July 2021.\nOn 26 July 2021, the new and current Congress was sworn in, with an alliance led by Popular Action member María del Carmen Alva successfully gaining control of Peru's Congress.\nOn 7 December 2022, the president Pedro Castillo attempted self-coup d'état by unconstitutionally dissolving Congress and the state apparatus as a whole. He was subsequently impeached and removed by congress.\nMembership\nQualifications\nArticle 90 of the Peruvian Constitution sets three qualifications for congressmen: (1) they must be natural-born citizens; (2) they must be at least 25 years old; (3) they must be an eligible voter. Candidates for president cannot simultaneously run for congress while vice-presidential candidates can.\nFurthermore, Article 91 states that high-ranking government officers and any member of the armed forces or national police can only become congressmen six months after leaving their post.\nElections and term\nCongressmen serve for a five-year term and cannot be reelected for a new term, immediately, in the same position. Elections for congress happen simultaneously as the election for president. Seats in congress are assigned to each region in proportion to the region's population. Congressional elections take place in April.\nThe D'Hondt method, a party-list proportional representation system, is used to allocate seats in congress. Political parties publish their party list for each region ahead of the election. Candidates do not need to be members of the political party they run for but may run for such party as a guest. Each candidate is assigned a number within the list. The citizenry thus votes for the party of their preference directly. Additionally, voters may write two specific candidates' number on the ballot as their personal preference. The newly elected congress takes office on 26 July of the year of the election.\nDisciplinary action\nCongressmen may not be tried or arrested without prior authorization from Congress from the time of their election until a month after the end of their term. Congressmen must follow the Congress's code of ethics, which is part of its self-imposed Standing Rules of Congress. La Comisión de Ética Parlamentaria, or Parliamentary Ethics Committee, is in charge of enforcing the code and punishing violators. Discipline consist of (a) private, written admonishments; (b) public admonishments through a Congressional resolution; (c) suspension from three to 120 days from their legislative functions.\nAny congressmen may lose their parliamentary immunity if authorized by Congress. The process is started by the Criminal Sector of the Supreme Court who presents the case to the Presidency of Congress. The case is then referred to a special committee of 15 congressmen known as Comisión de Levantamiento de Inmunidad Parlamentaria, or Committee on Lifting Parliamentary Immunity, that decides if the petition should be heard by the body as a whole. The accused congressmen has the right to a lawyer and to defend himself before the committee and before the Plenary Assembly. The final decision is then communicated back to the Supreme Court.\nSalary\nEvery congressman receives a monthly salary of 15,600 Peruvian soles (approximately US$4,000). They further receive 7,617 Peruvian soles (approximately $2,100) for congressional function expenses and 2,530 Peruvian soles (approximately $700) for congressional representation week expenses to support them in their official and representational duties to their district. Each congressman further receives a 33,027 Peruvian soles (approximately $9,000) personnel allowance. Congressman also receive a one-time extra monthly salary before the beginning of their term, known as an installation expenses allowance.\nOfficers\nPresiding over Congress\nPresident and Bureau\nThe most important officer is the President of Congress who is fourth in line of presidential succession if both the President and both vice-presidents are incapable of assuming the role. The President of Congress can only serve as interim president as he is required to call new elections if all three executive officers are not incapable of serving. This has happened once since the adoption of the current constitution when Valentín Paniagua became the interim president after the fall of the Alberto Fujimori regime in 2000.\nThe President of Congress is elected for a one-year term by the rest of Congress. Re-election is possible but uncommon. The President of Congress is almost always from the majority party. Its most important responsibility is to control and guide debate in Congress. He also signs, communicates and publishes bills and other decisions made by Congress. He may delegate any of these responsibilities to one of the vice-presidents of Congress.\nThe president serves along three vice-presidents who are collectively known as Mesa Directiva del Congreso, known as the Bureau in English. The three vice-presidents are not always from the same party as the president. The Bureau approves all administrative functions as well as all of Congress's internal financial policy and hiring needs. Any member of the Bureau may be censored by any member of Congress.\nExecutive Council\nEl Consejo Directivo, or Executive Council, consists of the four members of the Bureau as well as representatives from each political party in Congress which are known as Executive-Spokespersons. Its composition is directly proportional to the number of seats each party holds in Congress. The council has administrative and legislative responsibilities. Similar to the United States House Committee on Rules, it sets the calendar for the Plenary Assembly and fixes floor time for debating calendar items.\nCommittees\n{| class=\"wikitable\"\n! Ordinary Committee\n! colspan=\"3\"| Chair(s)\n! Term\n|-\n| Agrarian\n| López Morales Jeny Luz\n| width=\"1\"\n| FP\n| 2025\n|-\n| Science, Technology, and Innovation\n| Orué Medina Ariana Maybee\n|\n| PP\n| 2025\n|-\n| Foreign Commerce and Tourism\n| Zeballos Aponte Jorge Arturo\n|\n| RP\n| 2025\n|-\n| Constitution and Rule\n| Alegría García Arturo\n| width=\"1\"\n| FP\n| 2025\n|-\n| Culture and Cultural Patrimony\n| Paredes Piqué Susel Ana María\n| bgcolor=#0fa09d |\n| BDP\n| 2025\n|-\n| Consumer Protection and Regulatory Bodies of Public Services\n| Katy Ugarte Mamani\n|\n| PL\n| 2025\n|-\n| National Defense\n| Karol Ivett Paredes Fonseca\n|\n| AvP\n| 2025\n|-\n| Decentralization, Regionalization, Local Governments, and Modernization of State Management\n| Zegarra Saboya Ana Zadith\n|\n| SP\n| 2025\n|-\n| Economy, Banking, Finance, and Financial Intelligence\n| Victor Seferino Flores Ruiz\n| width=\"1\"\n| FP\n| 2025\n|-\n| Education, Youth, and Sport\n| Segundo Toribio Montalvo Cubas\n|\n| PL\n| 2025\n|-\n| Energy and Mines\n| Cutipa Ccama Víctor Raúl\n|\n| PL\n| 2025\n|-\n| Supervision and Comptrollership\n| Elvis Vergara Mendoza\n| width=\"1\"\n| FP\n| 2025\n|-\n| Social Inclusion and People with Disabilities\n| Arriola Tueros José Alberto\n|\n| PP\n| 2025\n|-\n| Intelligence\n| José Cueto\n|\n| RP\n| 2022-Present\n|-\n| Justice and Human Rights\n| Cruz Mamani Flavio\n|\n| PL\n| 2025\n|-\n| Women and Family\n| Milagros Jáuregui de Aguayo\n|\n| RP\n| 2025\n|-\n| Budget and General Account of the Republic\n| Soto Reyes Alejandro\n|\n| APP\n| 2025\n|-\n| Production, Micro and Small Businesses, and Cooperatives\n| Huamán Coronado Raúl\n| width=\"1\"\n| FP\n| 2025\n|-\n| Andean, Amazons, and Afro-Peruvian Peoples, Environment, and Ecology\n| Silvana Robles\n|\n| Independent\n| 2025\n|-\n| Foreign Relations\n| Heidy Juarez\n|\n| PP\n| 2025\n|-\n| Health and Population\n| Ruíz Rodríguez Magaly Rosmery\n|\n| APP\n| 2025\n|-\n| Labor and Social Security\n| Paredes Gonzales Alex Antonio\n|\n| SP\n| 2025\n|-\n| Transportation and Communications\n| Mori Celis Juan Carlos\n|\n| AP\n| 2025\n|-\n| Housing and Construction\n| María Acuña\n|\n| APP\n| 2025\n|-\n|}\n{| class=\"wikitable\"\n! Parliamentary Ethics Committee\n! colspan=\"3\"| Chair(s)\n! Term\n|-\n| Parliamentary Ethics Committee\n| Elvis Vergara Mendoza\n|\n| AP\n| 2025\n|-\n|}\n{| class=\"wikitable\"\n! Subcommittee on Constitutional Accusations\n! colspan=\"3\"| Chair(s)\n! Term\n|-\n| Subcommittee on Constitutional Accusations\n| Lady Camones\n|\n| APP\n| 2022–present\n|-\n|}\nBoard of Spokespersons\nEach political party in Congress chooses a Spokesperson who acts as the party leader and is a member of the Board of Spokespersons alongside the members of the Bureau. The Board of Spokespersons main role deals with committee assignments as well as the flow of bills from the committees to the Plenary Assembly.\nSecretariat General\nLa Oficialía Mayor, or Secretariat General, is the body of personnel led by the Secretary-General. It is responsible for assisting all members of Congress with daily managerial tasks. The Secretary-General is chosen and serves under the direction of the Bureau and Executive Council.\nProcedure\nCommittees\nStanding Committees are in charge of the study and report of routine business of the calendar, especially in the legislative and oversight function. The President of Congress, in coordination with Parliamentary Groups or upon consultation with the Executive Council, proposes the number of Standing Committees. Each party is allocated seats on committees in proportion to its overall strength.\nMost committee work is performed by 24 standing committees. They examine matters within their jurisdiction of the corresponding government departments and ministries. They may also impede bills from reaching the Plenary Assembly.\nThere are two independent committees, the Permanent Assembly and the Parliamentary Ethics Committee.\nInvestigative and Special Committees\nInvestigative committee are in charge of investigating a specific topic as directed by Article 97 of the Constitution. Appearances before investigative committees are compulsory, under the same requirements as judicial proceedings. Investigative committee have the power to access any information necessary, including non-intrusive private information such as tax filings and bank financial statements. Investigative committees final reports are non-binding to judicial bodies.\nSpecial committees are set up for ceremonial purposes or for the realization of special study or joint work with other government organizations or amongst congressional committees. They disband after they fulfill their assigned tasks.\nThe Permanent Assembly\nThe Permanent Assembly, or Comisión Permanente, fulfills the basic functions of Congress when it is under recess or break. It is not dissolved even if Congress is dissolved by the President. It also fulfills some Constitutional functions while Congress is in session similar to what an upper-chamber would. It has the responsibility of appointing high-ranking government officers and commencing the removal process of them as well as the heads of the two other branches of government. The Plenary Assembly may assign this committee special responsibilities excluding constitutional reform measures, approval of international treaties, organic acts, the budget, and the General Account of the Republic Act.\nThe Assembly consist of twenty-five percent of the total number of congressmen elected proportionally to the number of seats each party holds in Congress. They are installed within the first 15 days of the first session of Congress's term.\nParliamentary Ethics Committee\nCongressmen must follow the Congress's code of ethics which is part of its self-established Standing Rules of Congress. La Comisión de Ética Parlamentaria, or Parliamentary Ethics Committee, is in charge of enforcing the code and punishing violators. Discipline consists of (a) private, written admonishments; (b) public admonishments through a Congressional resolution; (c) suspension from 3 to 120 days from their legislative functions.\nFunctions\nArticle 102 of the Peruvian Constitution delineated ten specific functions of Congress which deal with both its legislative power as well as its role as a check and a balance to the other branches of government:\n# To pass laws and legislative resolutions, as well as to interpret, amend, or repeal existing laws.\n# To ensure respect for the Constitution and the laws; and to do whatever is necessary to hold violators responsible.\n# To conclude treaties, in accordance with the Constitution.\n# To pass the Budget and the General Account.\n# To authorize loans, in accordance with the Constitution.\n# To exercise the right to amnesty.\n# To approve the territorial demarcation proposed by the Executive Branch.\n# To consent to the entry of foreign troops into the territory, whenever it does not affect, in any manner, national sovereignty.\n# To authorize the President of the Republic to leave the country.\n# To perform any other duties as provided in the Constitution and those inherent in the legislative function.\nCurrent composition and election results\nAfter widespread protests the previous year, the 2021 election saw a surge in support for the new left-wing Free Peru, which also won the presidential election with Pedro Castillo on the same day. However, a coalition of right-wing parties holds the majority of Congress and have been strongly opposed to President Castillo. One bloc of far-right parties comprises about one-third of seats in Congress, with the bloc including the Fujimorist Popular Force, Popular Renewal of Rafael López Aliaga and Go on Country. Popular Force, which had dominated the legislature during the reign of Keiko Fujimori, regained 9 seats since their poor performance in the 2020 election, making them the second largest party. Popular Renewal party would also gain 13 seats while Go on Country won 7 seats.\nThe previously dominant center-right parties Popular Action and Alliance for Progress both lost some seats. The new or previously minor parties that had gained ground in the 2020 election, Purple Party, We Are Peru and Podemos Perú also all lost seats, while the Ethnocacerist Union for Peru, leftist Broad Front and Agrarian Agricultural People's Front all failed to win any seats. Contigo, the successor to former president Pedro Pablo Kuczynski's Peruvians for Change party, also failed to win a seat and continued its downwards trend of the previous election, receiving only around 0.05% of the vote.\n{|class=wikitable style=text-align:center\n|colspan=6|\n|-\n!colspan=2|Party\n!Seats\n|-\n|bgcolor=#C60000| ||align=left|Free Peru||32\n|-\n|bgcolor=#FF8000| ||align=left|Popular Force||24\n|-\n|bgcolor=#000000| ||align=left|Popular Action||15\n|-\n|bgcolor=#0854CD| ||align=left|Alliance for Progress||15\n|-\n|bgcolor=#FF0C94| ||align=left|Go on Country – Social Integration Party||10\n|-\n|bgcolor=#00C0FF| ||align=left|Popular Renewal||9\n|-\n|bgcolor=#C60000| ||align=left|Democratic Peru||7\n|-\n|bgcolor=#00FF00| ||align=left|Together for Peru||5\n|-\n|bgcolor=#20488E| ||align=left|We Are Peru||5\n|-\n|bgcolor=#F5AD1A| ||align=left|Podemos Peru||5\n|-\n|bgcolor=#7026A8| ||align=left|Purple Party||3\n|-\n| colspan=\"5\" align=\"left\" |Source: [https://www.resultados.eleccionesgenerales2021.pe/EG2021/EleccionesCongresales/GenRl ONPE] , [https://ojo-publico.com/especiales/resultados-onpe-elecciones-2021/#/ Ojo Público]\n|}\nReestablishment of upper chamber\nIn March 2024, 91 out of 130 members of Congress voted to restore the Senate with the general election of 2026. The reconstituted Senate will have 60 members each serving a five-year term. The Senate will have the power to appoint the presidents of the Central Reserve Bank and the Court of Auditors, among other offices. The Senate will also have the power of final approval over proposed legislation and will meet with the lower chamber in a joint session to approve budgets. Unlike the lower chamber, which is elected entirely by proportional representation from a single, national constituency, the Senate will have 27 members elected from individual departmental constituencies and the remaining 33 elected proportionately nationwide.\nThe move came nearly five years after a failed 2018 attempt to reestablish the Senate by popular referendum. Peruvian ex-president Martín Vizcarra proposed a series of political reforms as a response to the CNM audios scandal during his Independence Day message on 28 July 2018. One of his proposals was the establishment of a bicameral legislature similar to the one that existed in Peru before the 1993 Constitution. A referendum on the bicameralism proposal, as well as three other constitutional amendment proposals, was held on 9 December 2018. The bicameralism proposal was rejected by 90.52% of the voters as consequence of Vizcarra's withdrawal of support for the proposal, which had been modified by legislators before it was presented to the public.\nPublic opinion\nCongress is one of the most disapproved entities in Peru, recently seeing its lowest approval since the early 2000s. Following the 2021 Peruvian general election, disapproval of Congress increased dramatically, from 61% in August 2021 to 91% in March 2023 according to IEP polls.\nSee also\n* Politics of Peru\n* List of legislatures by country\nReferences\nExternal links\n* [http://www.congreso.gob.pe/ Official Peruvian Congress Site]\n* [http://www.congreso.gob.pe/eng/overview/about_congress/ Official Peruvian Congress Site in English]\n* [http://www.congreso.gob.pe/Congresistas/ List of Members of Congress (Spanish)]\n}}"
    }
  ]
}