{
  "content": [
    {
      "type": "text",
      "text": "# Connor Dewar\n\n| birth_place = The Pas, Manitoba, Canada\n| height_ft = 5\n| height_in = 10\n| weight_lb = 187\n| position = Centre\n| shoots = Left\n| league = NHL\n| team = Pittsburgh Penguins\n| prospect_team =\n| prospect_league = AHL\n| former_teams = Minnesota WildToronto Maple Leafs\n| ntl_team =\n| draft = Undrafted\n| career_start = 2019\n| career_end =\n}}\nConnor Dewar (born June 26, 1999) is a Canadian professional ice hockey centre for the Pittsburgh Penguins of the National Hockey League (NHL). He has previously played for the Minnesota Wild and the Toronto Maple Leafs.\nEarly life\nDewar was born on June 26, 1999, in The Pas, Manitoba, Canada to parents Kim and Jade. Dewar is of Red River Métis descent. Growing up, he skated on a backyard rink built by his father before moving to Dauphin, Manitoba with his mother to skate for the Dauphin-based Parkland Rangers bantam team. He remained in Dauphin until he was 15 years old while skating with the Rangers midget AAA team. As a result of his junior play, Dewar was drafted by the Everett Silvertips of the Western Hockey League (WHL) in the 2014 WHL Bantam Draft.\nPlaying career\nMajor junior\nDewar signed a Western Hockey League Standard Player Agreement on September 1, 2015, with the Silvertips. Dewar subsequently joined the Silvertips as a 16-year-old rookie for the 2015–16 season. He recorded his first WHL goal to clinch a 2–0 win over the Prince George Cougars during his debut game. He played in all 72 regular-season games and all nine playoff games during his rookie season, earning the \"Iron Man Award\" and \"Rookie of the Year.\" He finished his rookie season with 11 goals and seven assists, becoming the first Silvertip rookie to reach double digits in goals since Manraj Hayer. Following his rookie season, Dewar returned to the Silvertips and set new career highs in goals, assists, and points through 71 games. At the conclusion of his sophomore season, Dewar was invited to participate in the Toronto Maple Leafs training camp.\nDewar returned to the Silvertips for his third season where he served as an alternate captain while setting new career highs in points, assists, and goals. As a result of his play, Dewar was ranked 80th overall amongst North American skaters by the NHL Central Scouting Bureau.\nPrior to the 2018–19 season, Dewar was named the 16th captain in Everett Silvertips history. He was also invited to participate at the Minnesota Wild's training camp before being returned to the WHL. However, early in the season, Dewar was given a four-game suspension in response to cross-checking major penalty and game misconduct in Everett's 5–2 loss at Brandon. Upon returning to the Silvertips lineup, Dewar led the Silvertips with 73 points before suffering an upper body injury. He finished his fourth year campaign with 81 points, including 29 power play points and 309 shots on goal. His point total earned him seventh ranking in Silvertips single season history. As a result, Dewar was named to the WHL Western Conference First All-Star Team.\nProfessional\nDewar concluded his major junior career by signing a three-year, entry-level contract with the Wild on March 5, 2019. He subsequently joined Minnesota's American Hockey League (AHL) affiliate, the Iowa Wild, for the remainder of the season. Dewar recorded his first professional goal and assist in a 4–3 loss to the Chicago Wolves on November 17. He finished his AHL rookie season with 19 points, six goals and 13 assists, through 52 games.\nDewar played his first NHL game on October 28, 2021, in the Wild's 4–1 loss to the Seattle Kraken. He would register his first NHL point, an assist, in a 3–2 win over the Boston Bruins on January 6, 2022, and score his first NHL goal 18 days later in an 8–2 win against the Montreal Canadiens.\nOn March 8, 2024, the Wild traded Dewar to the Toronto Maple Leafs in exchange for Dmitri Ovchinnikov and a 2026 fourth-round pick. Dewar scored his first goal for the Leafs on March 28, 2024, against the Washington Capitals.\nIn the  season, Dewar began the year on the injured-reserve with the Maple Leafs before returning in November. Dewar collected just 3 assists through 31 appearances before he was traded by the Maple Leafs alongside Conor Timmins to the Pittsburgh Penguins in exchange for a fifth-round selection in 2025 on March 7, 2025. He scored his first goal for the Penguins on March 13, 2025, against the St Louis Blues.\nCareer statistics\n{| border=\"0\" cellpadding=\"1\" cellspacing=\"0\" style=\"text-align:center; width:60em;\"\n|- bgcolor=\"#e0e0e0\"\n! colspan=\"3\" bgcolor=\"#ffffff\"|\n! rowspan=\"100\" bgcolor=\"#ffffff\" |\n! colspan=\"5\"|Regular season\n! rowspan=\"100\" bgcolor=\"#ffffff\" |\n! colspan=\"5\"|Playoffs\n|- bgcolor=\"#e0e0e0\"\n! Season\n! Team\n! League\n! GP !! G !! A !! Pts !! PIM\n! GP !! G !! A !! Pts !! PIM\n|-\n| 2014–15\n| Parkland Rangers\n| MMHL\n| 33 || 12 || 15 || 27 || 40\n| 4 || 1 || 1 || 2 || 10\n|- bgcolor=\"#f0f0f0\"\n| 2015–16\n| Everett Silvertips\n| WHL\n| 72 || 11 || 7 || 18 || 24\n| 9 || 1 || 0|| 1 || 2\n|-\n| 2016–17\n| Everett Silvertips\n| WHL\n| 71 || 14 || 16 || 30 || 37\n| 10 || 1 || 1 || 2 || 6\n|- bgcolor=\"#f0f0f0\"\n| 2017–18\n| Everett Silvertips\n| WHL\n| 68 || 38 || 30 || 68 || 47\n| 22 || 12 || 14 || 26 || 24\n|-\n| 2018–19\n| Everett Silvertips\n| WHL\n| 59 || 36 || 45 || 81 || 60\n| 9 || 5 || 5 || 10 || 10\n|- bgcolor=\"#f0f0f0\"\n| 2019–20\n| Iowa Wild\n| AHL\n| 52 || 6 || 13 || 19 || 22\n| — || — || — || — || —\n|-\n| 2020–21\n| Iowa Wild\n| AHL\n| 32 || 12 || 11 || 23 || 13\n| — || — || — || — || —\n|- bgcolor=\"#f0f0f0\"\n| 2021–22\n| Iowa Wild\n| AHL\n| 19 || 8 || 9 || 17 || 17\n| — || — || — || — || —\n|-\n| 2021–22\n| Minnesota Wild\n| NHL\n| 35 || 2 || 4 || 6 || 25\n| 1 || 0 || 0 || 0 || 0\n|- bgcolor=\"#f0f0f0\"\n| 2022–23\n| Minnesota Wild\n| NHL\n| 81 || 6 || 12 || 18 || 50\n| 6 || 0 || 0 || 0 || 0\n|-\n| 2023–24\n| Minnesota Wild\n| NHL\n| 57 || 10 || 4 || 14 || 20\n| — || — || — || — || —\n|- bgcolor=\"#f0f0f0\"\n| 2023–24\n| Toronto Maple Leafs\n| NHL\n| 17 || 1 || 4 || 5 || 8\n| 6 || 0 || 1 || 1 || 0\n|-\n| 2024–25\n| Toronto Marlies\n| AHL\n| 1 || 1 || 1 || 2 || 2\n| — || — || — || — || —\n|- bgcolor=\"#f0f0f0\"\n| 2024–25\n| Toronto Maple Leafs\n| NHL\n| 31 || 0 || 3 || 3 || 5\n| — || — || — || — || —\n|-\n| 2024–25\n| Pittsburgh Penguins\n| NHL\n| 17 || 4 || 3 || 7 || 9\n| — || — || — || — || —\n|- bgcolor=\"#e0e0e0\"\n! colspan=\"3\" |NHL totals\n! 238 !! 26 !! 30 !! 56 !! 117\n! 13 !! 0 !! 1 !! 1 !! 0\n|}\nAwards and honours\n{| class=\"wikitable\"\n! Award\n! Year\n! Ref\n|-\n! colspan=\"3\"|WHL\n|-\n| West First All-Star Team\n| 2019\n|\n|}\nReferences\nExternal links\n*"
    }
  ]
}