{
  "content": [
    {
      "type": "text",
      "text": "# Conquest of Cuenca\n\nAlfonso VIII of Castile Nuño Pérez de Lara Alfonso II of Aragon Berenguer de Vilademuls\n| place             = Cuenca, Almohad Caliphate\n| caption           = Panoramic view of Cuenca\n| combatant1        =  Kingdom of Castile Crown of Aragon\n| combatant2        = border Almohad Caliphate\n| commander2        = border Abu Beka\n| result            = Christian victory\n| territory         = Castilian capture of the city\n}}\nThe Conquest of Cuenca was a siege led by Alfonso VIII of Castile and Alfonso II of Aragon to the city of Cuenca in 1177. The siege lasted for almost a year until it finally fell on Castilian hands in 21 September.\nBackground\nThe border of the Tagus had been overwhelmed in the second half of the 12th century because Alfonso VIII of Castile was advancing towards the Júcar. He besieged Cuenca in 1172 but, after five months of siege, the caliph Abu Yaqub forced the Castilian to lift the siege by attacking Huete. The caliph Yaqub, the philosopher Averroes, the historian Sahib as-Sala (who gives a detailed description of Cuenca) and other notable Almohads entered the city and helped the besieged. However, the Almohads also failed to take Huete and signed a seven-year truce with Alfonso.\nThe truce was broken in the summer of 1176 when the Muslims of Cuenca, together with those of Alarcón and Moya, attacked the Christian lands of Huete and Uclés, breaking the pact. Alfonso VIII summoned the Castilian counts Nuño Pérez de Lara, Pedro Gutiérrez, Àlvar Fáñez, Tello Pérez, Nuño Sánchez, the lord of Albarracín Pedro Ruiz de Azagra, the king of León Ferdinand II, the King of Aragon Alfonso II and the orders soldiers of Saint John, Calatrava and Alfama and laid siege to the city on 6 January 1177.\nSiege\nFaithful to the friendship with the kingdom of Castile, Alfonso II, went to the siege of Cuenca with a group of armed peons identified with the Almogavars in aid of the Castilian monarch. After arriving to Cuenca, he went to Provence and other points. In July or later, he must have returned to Cuenca. The archbishop of Tarragona, Berenguer de Vilademuls, accompanied him with soldiers from the city and from Camp de Tarragona.\nCuenca, considered impregnable, suffered a long and very tough siege (for nine months) by the combined armies of Castile and Aragon, swelled by the large number of foreigners who came from the crusade that the Holy See had raised and that preached the cardinal legate Giacinto Bobone, who later became pope under the name of Celestine III.\nThe leader Abu Beka asked for help from the caliph Abu Yaqub but he was in Africa attending to other matters and denied him help. On 27 July, the besieged made an exit attacking the Christian camp with the aim of delivering a coup d'état against the king, but they only managed to kill Count Nuño Pérez de Lara. Hunger, disease and the deaths from the continuous attacks of clubs and blunderbuss forced them to surrender and liberate the city on 21 September, the day of Saint Matthew. The Christian army took the citadel and the castle and, after the Muslim abandonment of the city, Alfonso VIII and his retinue triumphantly entered the city in October, becoming part of the Kingdom of Castile.\nAftermath\nIn that same year, Alfonso II went on a military expedition to Lorca, so that the king of Murcia, who was his vassal, would ensure the tribute. On returning from this victorious expedition and being in Teruel, he gave the church of Saint Vincent to the Royal Monastery of San Juan de la Peña \"pro servitio quod mihi fecisti in illa hoste de Valencia\".\nAs a reward for the participation of Alfonso II in the capture of Cuenca, he and his successors were freed in perpetuity from the vassalage to Castile that had its origin in the .\nReferences\nBibliography\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*"
    }
  ]
}