{
  "content": [
    {
      "type": "text",
      "text": "# Conquest of New Sweden\n\nby Amandus Johnson\n| date              = September 1655\n| place             = New Sweden\n| result            = Dutch victory\n| combatant2        =  Sweden\n| combatant1        =\n| commander2        = Johan Risingh\n| commander1        = Peter Stuyvesant\n| strength2         = Unknown\n| strength1         = 7 ships 317 soldiers\n| casualties2       =\n| casualties1       =\n| campaignbox       =\n| territory         = Dutch annexation of New Sweden\n}}\nIn September 1655, Dutch soldiers from New Netherland under the command of Peter Stuyvesant conquered the Delaware River colony of New Sweden. Under the terms of surrender the Swedish settlements were incorporated into the Dutch colony.\nBackground\nNew Sweden was a Swedish colony founded by Peter Minuit in 1638 along the Delaware River. The colony, centered on Fort Christina, thrived for a number of years under the administration of Johan Printz, attracting Swedish and Finnish settlers who engaged in farming and fur trading with the Lenape and Susquehannock. The Dutch, however, also claimed the area, having established the colony of New Netherland in 1624 along the Hudson River. Their presence on the Delaware River, however, was many years limited to Fort Nassau on the east side of the river opposite the mouth of the Schuylkill River.\nTension between the Dutch and Swedes in North America escalated in the late 1640s. The Dutch West India Company, which governed New Netherland, saw New Sweden as a threat to its trade dominance and territorial ambitions in the region. The Dutch West India Company was particularly concerned about the trade in furs conducted by the Swedes with the Lenape and Susquehannock which had the potential to undermine the Dutch trade with the Haudenosaunee (Iroquois). The Swedes, however, were often hampered by a shortage of trade goods caused by the infrequent arrival of supply ships from Sweden.\nIn June 1651, the Director-General of New Netherland, Peter Stuyvesant, marched overland with 120 soldiers to Fort Nassau while several armed ships sailed from New Amsterdam to the Delaware River. Stuyvesant took no direct action against the Swedes, but ordered Fort Nassau dismantled and a new fort constructed on the west side of the river a few miles south of Fort Christina. Upon his arrival in New Sweden in May 1654, newly appointed Governor Johan Risingh, seized Fort Casimir from the Dutch and renamed it Fort Trefaldighet (Trinity). In response the Dutch West India Company ordered Stuyvesant to \"drive\" the Swedes from the river.\nConquest\nPreparations for the invasion of New Sweden began in New Amsterdam in August 1655. Although Stuyvesant attempted to keep news of the planned assault from reaching New Sweden, the Lenape soon informed Risingh of the Dutch plans. Risingh ordered Fort Trinity and Fort Christian strengthened.\nOn August 26, 1655, Stuyvesant and an expedition consisting of seven ships and 317 soldiers departed New Amsterdam. Swedish sources indicate the Dutch had 600 to 700 soldiers in their invasion force. Stuyvesant landed his soldiers on the west side of the Delaware between Fort Trefaldighet and Fort Christina on August 31. A contingent of 50 soldiers was dispatched to block the road between the two forts, cutting off communication between them. Faced with the overwhelming Dutch force, Lieutenant Sven Skute, the Swedish commander of Fort Trefaldighet, surrendered the next day. The common soldiers were brought aboard the Dutch ships and sent to New Amsterdam a few days later, while the officers were held under guard at the fort.\nRisingh dispatched Hendrick von Elswick, the Swedish factor at Fort Christina, to meet with Stuyvesant and discover his intentions. When Stuyvesant told him that his goal was the conquest of New Sweden, Elswick replied in Latin: \"Hodie mihi, cras tibi\" (Today me, tomorrow you). Elswick's retort would prove prophetic when nine years later Stuyvesant surrendered New Amsterdam to the English.\nThe Dutch proceeded upriver to Fort Christina which they invested on September 5. During the siege, farms in the vicinity of the fort were plundered and burned.}}\nThe garrison of Fort Christina was vastly outnumbered, and suffered from poor morale and a lack of gunpowder. Risingh capitulated without firing a shot on September 15, 1655.\nAftermath\nUnder the terms of the surrender, those colonists who wished to return to Sweden were permitted to do so, while those that wished to remain had to swear allegiance to the Dutch. Risingh, Elswick and 35 others departed New Sweden in early October.\nAt dawn on the same day that Risingh surrendered, several hundred Lenape occupied New Amsterdam in what is known as the Peach War. After the Lenape were attacked as they prepared to depart that evening, they retaliated by raiding Pavonia and Staten Island, killing 40 and taking 100 mostly women and children captive.\nWhen Stuyvesant's soldiers learned about the attacks, they retaliated against the Swedish colonists, accusing them of inciting the Lenape. In his letter Risingh wrote \"your people have ravaged us as if they were in the country of their archenemy.\"\nThe Swedish supply ship, Mercurius, carrying over 100 colonists and much needed supplies sailed into Delaware Bay in April 1656, unaware that New Sweden had been conquered. Although the Dutch ordered the ship to proceed to New Amsterdam, the colonists and supplies were surreptitiously offloaded at New Gothenburg.\nThe Swedish government protested the annexation of New Sweden but did not attempt to regain the colony. New Sweden was incorporated into New Netherland and reorganized into three districts: New Amstel (present-day New Castle, Delaware), Hoornkill (present-day Lewes, Delaware), and Christina (present-day Wilmington, Delaware). In 1664, the British seized control of New Netherland, however, the Swedes in the Delaware River region maintained their distinct Swedish identity well into the eighteenth century.\nReferences"
    }
  ]
}