{
  "content": [
    {
      "type": "text",
      "text": "# Conquest of the Peñón de Vélez de la Gomera (1564)\n\nKingdom of Portugal\n| combatant2        =  Ottoman Empire\n| commander1        =  García de Toledo OsorioSancho Martínez de Leyva Álvaro de Bazán Giovanni Andrea Doria Chiappino Vitelli Francisco Barreto\n| commander2        =  Kara Mustafa Ferret\n| strength1         =\n*9,200 land force\n| strength2         = 200 soldiersUnknown number of reinforcements\n| casualties1       = Minor\n| casualties2       = Significant\n| campaignbox       =\n}}\nThe conquest of the peñón de Vélez de la Gomera by the Hispanic Monarchy happened in 1564 under the command of García de Toledo Osorio. It succeeded a failed expedition the previous year, and resulted in Spain taking control of the place as a plaza fuerte, which continued up to present day.\nThe reconquest of the place, previously controlled by Spain from 1509 to 1522, was a small but symbolic victory. It signaled the recovery of Spanish naval power after the fiasco of Djerba, and preceded their greater success in relieving Malta from a Ottoman siege the following year.\nBackground\nSpain conquered Vélez de la Gomera for the first time in 1509 during the reign of Ferdinand II, when an army captained by Pedro Navarro took it. Moor forces attempted to retake it multiple times, finally achieving it in 1522 from the hands of governor Juan de Villalobos. The Kingdom of Badis was so established, turning the peñón into a base of Barbary pirates and privateering for the Ottoman Empire. New Spanish attempts to conquer it happened in 1522 and 1563, heavily burdened by Spain's involvement in the Italian Wars against France, an ally of the Ottomans.\nIn 1563, the same year as Sancho Martínez de Leiva Jr. failed to capture Vélez de la Gomera, King Philip II ordered to repeat the enterprise. The new expedition would include again Leiva and Álvaro de Bazán the Younger, who had distinguished himself in the first despite his tactic advice went unheeded. Allied troops from the Papal States, the Order of Malta and the Grand Duchy of Tuscany joined them, gathering 6000 soldiers from the Tercio de Nápoles, 2000 German landsknecht and 1200 Italian soldiers. Through this large contingent Philip wanted to take no more risks.\nThe expedition formed in Malaga, commanded by García de Toledo Osorio, and sailed off on August 29, reinforced by an additional Portuguese fleet on route.\nBattle\nOn August 31 they landed and attacked the nearby Torres de Alcalá, which they fortified. Leyva took command of the disembarked land army and headed for Vélez de la Gomera. They were forced to carry their artillery on hand due to the rugged terrain, but managed to reach the location and place artillery pieces in the Cantil and Baba hills. For his part, Turk corsair Kara Mustafa (not to mistake with the posterior Kara Mustapha) had supplied the fortress in anticipation of the attack and left for Fez, where he gathered a relief army from the local Wattasid kingdom, while his lieutenant Ferret stayed to guard Vélez de la Gomera with 200 men, believing its defensive positions would compensate the forces. The Spaniards surrounded the fortress and started bombarding it while repealing guerrilla attack from local Muslim bandits.\nDeliberation was unnecessary, as Kara Mustafa didn't arrive in time, and judging impossible to resist, Ferret opted to abandon Vélez de la Gomera by night and in small bands in order not to be detected. Only 27 Turk soldiers refused to follow him, whose captain handed himself over to Giovanni Andrea Doria and told him the situation. The Spanish obtained their promise of surrender and the fortress was occupied shortly after, finishing the siege after six days of fighting. The Maltese and Portuguese fleets left, after which García de Toledo left 1600 men as a garrison while the fortress was repaired and prepared to leave himself. He delayed his departure to fight off Kara Mustafa and his relief army, who arrived at that moment only to be routed.\nAftermath\nVélez de la Gomera was added to the rest of Spanish strongholds in Africa, and Toledo was granted the Viceroyalty of Sicily for his services. French chronicler Pierre de Brantôme, who participated in the operation by Spain's invitation, was impressed by its scale and efficiency, which he recounted to King Charles IX of France bemoaning that their own country had never enjoyed comparable naval resources.\nIndignation rose in the Ottoman Empire for the defeat, adding to Sultan Suleiman the Magnificent's plans of a grand expedition against the Christian positions in the Western Mediterranean. After considering either Sicily or Malta, the latter was chosen, leading to the Great Siege of Malta the following year, where Toledo and a freed Álvaro de Sande commanded the Spanish relief army. Vélez de la Gomera would be attacked many times throughout its story, with notable expeditions being Muley Amet with 10,000 men in 1680 and Muley Sidam with 14,000 in 1701, but they were all defeated.\nReferences\nBibliography\n* Enciclopedia General del Mar. Garriga, 1957.\n* Enciclopedia Universal Ilustrada - tomo 67, Espasa, 1929.\n* Historia general de España desde los tiempos primitivos hasta la muerte de Fernando VII. 1883.\n* Cesáreo Fernández Duro (1851), La Armada Española desde la unión de los reinos de Castilla y Aragón.\n*\n* Agustín R. Rodríguez González (2017), Álvaro de Bazán, Capitán general del Mar Océano."
    }
  ]
}