{
  "content": [
    {
      "type": "text",
      "text": "# CONQuest Festival\n\n\"dates=\" also works, but do not use both -->\n| begins             =\n| ends               =\n| frequency          =\n| venue              =\n| location           =\n| coordinates        =\n| country            = Philippines\n| years_active       = 2017–2019, 2022–2023\n| first              =\n| founder_name       =\n| last               =\n| prev               =\n| next               =\n| participants       =\n| attendance         =\n| capacity           =\n| area               =\n| budget             =\n| activity           =\n| leader_name        =\n| patron             =\n| organised          = AcadArena\n| filing             =\n| people             =\n| member             =\n| sponsor            =\n| website            =\n| current            =\n| footnotes          =\n}}\nThe CONQuest Festival was an annual pop culture and gaming convention in the Philippines organized by AcadArena.\nHistory\nEarly years (2017–2019)\nCONQuest Festival was originally established as a high school project in Iloilo City. The inaugural edition was held on December 16, 2017 at the Casa Real de Iloilo, which was attended by 700 people.\nThe ISC Events-organized convention received support from the Iloilo City government for its second edition, held from July 28 to 29 in the same venue.\nThe 2019 edition was hosted at the Iloilo Convention Center with over 6,000 attendees. The convention had a two-year hiatus in 2020 and 2021 due to the COVID-19 pandemic.\n2022 edition\nCONQuest by AcadArena returned in 2022. This edition was the first to be held in Metro Manila, as the scope of the event grew. The event would feature Filipino Mobile Legends: Bang Bang esports players as well as other personalities known for Genshin Impact and  Valorant. The event reportedly had 30,000 attendees.\n2023 edition\nCONQuest Festival 2023 was held from June 2 to 4, 2023, at the SM Mall of Asia Complex in Pasay. From the second day, the event with a target attendance figure of at least 60,000 would be marred by overcrowding and ticketing issues. Refunds were pledged to be made.\nIn response, AcadArena's co-owners Kevin Hoang and Ariane Lim announced that the festival was to be dissolved, making the 2023 edition its last.\nReferences"
    }
  ]
}