{
  "content": [
    {
      "type": "text",
      "text": "# Conservative Way Forward\n\n| affiliations        = Conservative Party ThatcherismEuroscepticism\n| key_people          = Cecil ParkinsonEric ForthSir Christopher ChopeMargaret Thatcher Chrissie Boyle\n| website             =\n}}\nConservative Way Forward (CWF) is a British pressure ad campaigning group, which is Thatcherite in its outlook and agenda. Margaret Thatcher was its founding president.\nConservative Way Forward was founded in 1991 to \"defend and build upon the achievements of the Conservative Party under Margaret Thatcher's leadership, and to adapt the principles of her era in government to modern concerns and challenges\".\nThe group organises speaker meetings, seminars and receptions, supported and attended by Government Ministers past and future.\nIn all leadership elections since 1997, the candidate supported by Conservative Way Forward has ultimately won.\nConservative Way Forward is to be relaunched in 2022 by MP Steve Baker who will be its new chairman.\nMargaret Thatcher Library\nOn 14 April 2013, the group announced that it was setting up a Margaret Thatcher Library as a permanent memorial to the former prime minister. The project will be based on the Ronald Reagan Presidential Library in California, and has the support of several current and former Conservative cabinet members. It is expected to run training courses for young Conservatives and exchange student programmes to the US and elsewhere, as well as house artifacts from her premiership.\nOfficers\nIn December 2015 Paul Abbott resigned as chief executive, and Donal Blaney resigned as chairman, following the suicide of Elliott Johnson soon after being made redundant as an employee of Conservative Way Forward. This followed the resignations of Minister of State for International Development Grant Shapps, and the expulsion from the Conservative Party of Mark Clarke, following allegations of bullying of Elliott Johnson.\nExecutive director:\n* Chrissie Boyle (2015–)\nFounding President:\n* Margaret Thatcher\nHonorary Vice Presidents:\n* Christopher Chope, former Transport Minister and former Chairman of Conservative Way Forward\n* Liam Fox, International Trade Secretary and former Defence Secretary\n* Greg Hands, former Chief Secretary to the Treasury\n* William Hague, former Foreign Secretary\n* Norman Tebbit, former Party Chairman\n* Sajid Javid, Home Secretary, former Communities Secretary and Business Secretary\nParliamentary Council\nChairman:\n* Gerald Howarth, former defence minister (2015–)\nDeputy Chairman:\n* James Cleverly\n;Council Members\n* Conor Burns\n* Greg Hands\n* Charlie Elphicke\n* Liam Fox\nBoard of Management\n;Chairman\n* Gerald Howarth\nHistory\nFormer Honorary Chairmen:\n* Cecil Parkinson (1991–1997)\n* Eric Forth (1997–2001)\n* Christopher Chope (2001–2009)\n* Don Porter CBE (2009–2012)\n* Donal Blaney (−2015)\nReferences\nExternal links\n* [https://www.conservativewayforward.com Conservative Way Forward]"
    }
  ]
}