{
  "content": [
    {
      "type": "text",
      "text": "# Consorts of the Daoguang Emperor\n\nThe Daoguang Emperor had fifteen consorts, including four empresses, one imperial noble consort, three noble consorts, three consorts, and four concubines.\nEmpresses\n# Empress Xiaomucheng, of the Niohuru clan (1807 - 17 February 1808), fifth cousin eight times removed. She was a primary consort of the future Emperor, Prince Zhi of the First Rank. She died in 1808, 12 years before enthronement and was posthumously honoured as empress.\n# Empress Xiaoshencheng, of the Tunggiya clan (1820 - 16 June 1833)\n# Empress Xiaoquancheng, of the Niohuru clan (17 June 1833 - 13 February 1840)\n# Empress Xiaojingcheng, of the Khorchin Borjigit clan (14 February 1840 - 1850), fifth cousin.She was de facto empress as imperial noble consort. She became Dowager Imperial Noble Consort Kangci and was later promoted to Mother Empress, Empress Dowager Kangci.\nImperial Noble Consort\n# Imperial Noble Consort Zhuangshun\nNoble Consorts\n# Noble Consort Tong\n# Noble Consort Jia\n# Noble Consort Cheng\nConsorts\n# Consort He, of the Hoifa Nara clan (和妃 輝發那拉氏; died 18 May 1836)\n# Consort Xiang, of the Niohuru clan (祥妃 鈕祜祿氏; 9 February 1808 – 15 February 1861)\n# Consort Chang, of the Hešeri clan (常妃 赫舍里氏; 31 December 1808 – 10 May 1860)\nConcubines\nConcubine Tian\nConcubine Tian was a member of the prominent Manchu Bordered Yellow Banner Fuca clan.Her personal name was not recorded in history.\nFather: Chaqing'a (), served as a magistrate of Guangdong\n* Paternal grandfather: Mujing'an (), served as fifth rank literary official (员外郎), Maci's grandson\nMother: Lady Aisin-Gioro\n* Maternal grandfather: Keling'a (科灵阿), served as second class body guard (二等侍卫)\nOne younger sister: primary wife of Gioro Chunpei, Master Commandant of Cavalry\nTwo younger brothers:\n* First younger brother: Chengduan (诚端), served as a fourth rank literary official in the Ministry of Works (侍郎)\n* Second younger brother: Chengchun (诚春), a secretary of Inner Court (内阁中书)\nQianlong era\nConcubine Tian was born on 15 April 1789.\nJiaqing era\nLady Fuca entered the residence of Prince Zhi of the First Rank in 1806 as a secondary consort (侧福晋). At that time, she didn't birth any child.\nDaoguang era\nIn 1820, after the coronation of the Daoguang Emperor, lady Fuca was granted a title \"Concubine Tian\" (恬嫔, \"tian\" meaning \"peaceful\" in Chinese, but ”composed\" in Manchu). Concubine Tian initially resided in Chengqian Palace. She moved to Yanxi palace in 1825 which was under the jurisdiction of Consort Chang.\nShe was described as a benevolent and virtuous person and praised by palace staff. When her head palace maid fell ill, concubine Tian sent her to recuperate. In 1843, she participated in banquet after a court session by Empress Dowager Gongci in Cining palace together with another imperial consorts. Every New Year's Day, she burned incenses in the back hall of Chuxiu palace for Empress Xiaoshencheng. However, lady Fuca never rose above the rank of concubine despite her earlier status of secondary consort. On 21 August 1845, when Yanxi palace was set on fire, Concubine Tian failed to escape from raging flame and died at the age of 58. Her head eunuch was beaten 100 times and exiled into Amur region. Her coffin was interred at Mu Mausoleum of the Western Qing tombs.\n----\nConcubine Shun (順嬪 那拉氏; 28 February 1811 – 11 April 1868)\nConcubine Shun was a member of main lineage of the Nara clan.\nJiaqing era\nConcubine Shun was born on 28 February 1811.\nDaoguang era\nLady Nara entered the Forbidden City in 1824 at the age of 13 as “First Class Female Attendant Shun\" (顺常在, \"shun\" meaning \"delicate\"). In October 1824, she was promoted to Noble Lady Shun (顺贵人). In 1829, she was demoted to First Class Female Attendant Shun and didn't recover previous title. Lady Nara remained childless during Daoguang era.\nXianfeng era\nIn 1851, Lady Nara was restored as \"Noble Lady Shun\". On 5 January 1861, she was rewarded together with Concubine Jia, Concubine Cheng, Imperial Noble Consort Zhuangshun and other concubines of the previous emperor during the celebrations of Chinese New Year.  Noble Lady Shun left in the Forbidden city when Xianfeng Emperor fled with 5 dowager concubines to Chengde Mountain Resort.\nTongzhi era\nIn 1861, Noble Lady Shun was promoted to Concubine Shun . Concubine Shun died in 1868. Her coffin was interred at the Mu Mausoleum of the Western Qing tombs.\n----\nConcubine Yu, of the Shang clan (豫嬪 尚氏; 20 December 1816 – 24 September 1897)\nConcubine Yu was a member of Han Chinese Plain White Banner Shang clan.\nFather:\n* Paternal grandfather:\n* Paternal grandmother : Lady Uya, a grand niece of Empress Xiaogongren\nOne younger brother:Yingqi (英启)\nJiaqing era.\nConcubine Yu was born on 20 December 1816.\nDaoguang era\nLady Shang entered the Forbidden City in 1834 as First Class Female Attendant Ling (玲常在) She lived in Yanxi palace together with Noble Consort Cheng and Concubine Tian. In 1839, her palace maid Daniu was beaten 40 times for stealing white silk satin. The palace maid also received a corporal punishment from her mistress for killing her cat. Later, Daniu was punished for stepping into a plate in 1840. That same year, lady Shang was demoted to \"Second Class Female Attendant Shang\" (尚答应). On 21 August 1845, the Palace of Prolonging Happiness burnt down, causing her to move out to Chuxiu palace.\nXianfeng era\nIn 1850, Lady Shang was restored as First Attendant . In 1860, she was rewarded during the celebration of Chinese New Year together with dowager concubines. Unlike Imperial Noble Consort Zhuangshun, Noble Consort Cheng, Noble Consort Jia, Consort Xiang and First Attendant Cai, she left in the Forbidden City.\nTongzhi era\nIn 1861, Lady Shang was promoted to Noble Lady.\nGuangxu era\nIn 1874, Noble Lady Shang was promoted to Concubine Yu (豫嫔, \"yu\" meaning “comfortable\"). Concubine Yu died on 24 September 1897 at the age of 81. She was longest living consort of the Daoguang Emperor. Her coffin was interred at Mu Mausoleum of the Western Qing tombs.\nTitles\n玲常在→答應..常在→貴人→豫嬪\nConcubine Heng, of the Cai clan (恆嬪 蔡氏; died 28 May 1876)\n宜貴人→宜常在→答應..常在→貴人→恆嬪\nOccupation of the palaces\n{| class=\"wikitable\"\n|+\n!Year\n!Imperial consort\n!Palace\n!Notes\n|-\n|1821-1833\n|Empress Xiaoshencheng\n| rowspan=\"2\" |Chuxiu palace\n|\n|-\n|1845-1850\n|Concubine Yu\n|\n|-\n|1821-1840\n|Empress Xiaoquancheng\n| rowspan=\"3\" |Zhongcui palace\n|\n|-\n|1835-1836\n|Noble Consort Jia\n|\n|-\n|1840-1850\n| rowspan=\"2\" |Empress Xiaojingcheng\n|\n|-\n|1821-1840\n|Yonghe palace\n|\n|-\n|1821-1836\n|Consort He\n| rowspan=\"5\" |Yanxi palace\n|\n|-\n|1825-1845\n|Concubine Tian\n| rowspan=\"3\" |Yanxi palace burnt down in August 1845\n|-\n|1828-1845\n|Noble Consort Cheng\n|-\n|1834-1845\n|Concubine Yu\n|-\n|1822-1825\n| rowspan=\"2\" |Consort Chang\n|She lived there under supervision and moved out to Chengqian palace\n|-\n|1825-1827\n| rowspan=\"3\" |Chengqian palace\n|\n|-\n|1836-1850\n|Noble Consort Jia\n|\n|-\n|1842-1850\n|Imperial Noble Consort Zhuangshun\n|\n|-\n|1827-1850\n|Consort Chang\n| rowspan=\"4\" |Xianfu palace\n|\n|-\n|1845-1850\n|Noble Consort Cheng\n|\n|-\n|1831-1850\n|Noble Consort Tong\n|\n|-\n|1837-1842\n|Imperial Noble Consort Zhuangshun\n|\n|-\n|1821-1850\n|Consort Xiang\n|Yikun palace\n|\n|}\nReferences"
    }
  ]
}