{
  "content": [
    {
      "type": "text",
      "text": "# Constitution of the Kingdom of Poland__disambig_1\n\nThe Constitution of the Kingdom of Poland () was granted to the 'Congress' Kingdom of Poland by King of Poland Alexander I of Russia in 1815, who was obliged to issue a constitution to the newly recreated Polish state under his domain as specified by the Congress of Vienna. It was considered among the most liberal constitutions of its time; however, it was never fully respected by the government. It was modified during the November Uprising by the revolutionary government and discarded afterwards by the victorious Russian authorities in 1832.\nHistory\nThe Congress of Vienna obliged Emperor Alexander I of Russia, in his role as King of Poland, to issue a constitution to the newly recreated Polish state under Russian domination. The new state would be one of the smallest Polish states ever, smaller than the preceding Duchy of Warsaw and much smaller than the Polish–Lithuanian Commonwealth. Because it was the Congress of Vienna which de facto created the Kingdom of Poland, it became unofficially known as the Congress Poland (Kongresówka).\nIt was signed on November 27, 1815 by the Tsar. It was a constitution octroyée: given by the ruler and not voted upon by a parliament.\nA significant contributor to the constitution was Prince Adam Czartoryski, although the text was edited by the Emperor himself and his advisors. The constitution, promising freedom of speech and religious tolerance, among other freedoms, was considered to be among the most liberal in contemporary Europe, reflecting much of the thought of the Polish and Russian Enlightenments. Compared to the Constitution of the Duchy of Warsaw, the document which governed the lands that became part of the Kingdom of Poland during their time as the Duchy of Warsaw, it however prioritized the nobility (szlachta) and revoked some rights given to the Polish Jews and peasants. It was never fully respected by the Russian authorities, and increasingly its liberal but ambiguous provisions became manipulated, avoided and violated by the government. The parliament was supposed to have been called into session every two years, but after it became the scene of many clashes between liberal deputies and conservative government officials, it was in fact called only four times (1818, 1820, 1826, and 1830, with the last two sessions being secret). This disregard for the promised rights, among other factors, led to increasing discontent within Poland, eventually culminating in the failed November Uprising in 1830. The constitution was modified during the uprising, and in its aftermath, the constitution was superseded on 26 February 1832 by the much more conservative Organic Statute of the Kingdom of Poland granted by Tsar Nicholas I of Russia and never actually implemented.\nSummary\nThe Constitution had 165 articles in seven titles.\nGeneral\nThe Kingdom of Poland was a constitutional monarchy in a personal union with the Russian Empire, with a common foreign policy. Each Emperor of Russia was also King of Poland. The parliament, military, administration and judiciary remained separate.\nKing\nThe King was the head of all three branches (executive, legislative and judicial). He:\n* called, postponed and dissolved parliament (Sejm) sessions\n* confirmed namestniks, ministers, senators, high officials (nominated by the namestnik) and nominated and confirmed marshals of local sejmiks\n* his signature was needed to pass Sejm legislation into law\n* he was the only person with legislative initiative\n* he had the right to temporarily annul legislation\n* he had the right to declare wars and sign foreign treaties\nNamiestnik\nNamiestnik:\n* headed the Council of State\n* headed the Administration Council\n* his decision need a countersignature of a minister\n* he nominated candidates for ministers, senators and high officials for the king\n* he nominated and confirmed lower officials.\nAdministration Council\nComposed of five ministers and other people nominated by the king, headed by namestnik, it:\n* carried out the executive and administration duties\n* prepared projects for Council of State\n* took decisions that were outside the scope of individual ministers\nCouncil of State\nComposed of the ministers, councilors, secretary of the state, referendars and other people nominated by the king, it had the followed prerogatives:\n* preparing legislation to be accepted by the king\n* confirming the final version of legislation that was voted upon by the Sejm\n* juridical powers: the right to file charges against administrative officials as well as competence and administrative court powers\n* received reports from various commissions, and prepared reports for the king\nParliament\nParliament was composed of the king, the upper house (Senate) and the lower house (Chamber of Deputies or Sejm). Deputies numbering 128 were chosen for six years, with one-third of them chosen every two years. They had legal immunity. Voting was open to all persons of 21 years or older. Candidates for deputy had to be able to read, write and have a certain amount of wealth. Military personnel had no right to vote. Parliaments were called every two years for a period of 30 days. Sejm had the right to vote on civil, administrative and legal issues. With permission from the king, it could vote on matters related to the fiscal system and the military. It had the right to control government officials and file petitions. A Senate numbering 64 was composed of nine bishops, voivodes and castellans and Russian \"princes of the blood.\" It acted as the Parliament Court, had the right to control citizens' books, and similar legislative rights as the Chamber of Deputies.\nReferences\nExternal links\n*[https://web.archive.org/web/20070129101850/http://edukacja.sejm.gov.pl/historia_sejmu/konstytucja_krolestwa_polskiego.html Konstytucja Królestwa Polskiego] on the official page of Polish Sejm\n*[http://portalwiedzy.onet.pl/84182,,,,konstytucja_krolestwa_polskiego_1815,haslo.html Konstytucja Królestwa Polskiego 1815] , WIEM Encyklopedia\n*[https://web.archive.org/web/20030505204843/http://www.law.uj.edu.pl/users/khpp/fontesu/1815.htm Text of the constitution]"
    }
  ]
}