{
  "content": [
    {
      "type": "text",
      "text": "# Construction Industry Council (United Kingdom)\n\n| location_city = London\n| location_country = United Kingdom\n| location =  The Building Centre\n| locations =\n| key_people = Dr Wei Yang (Chairman)Graham Watts OBE (CEO)\n| area_served =\n| industry =\n| products =\n| services =\n| revenue =\n| operating_income =\n| net_income =\n| num_employees =\n| parent =\n| divisions =\n| subsid =\n| homepage =\n| dissolved =\n| footnotes =\n}}\nConstruction Industry Council (CIC) is the representative forum for professional bodies, research organisations and specialist business associations in the United Kingdom construction industry.\nHistory\nThe first proposals for a Building Industry Council were made in 1985 (backed by the Chartered Institute of Building, Chartered Institution of Building Services Engineers and the Institution of Structural Engineers) but came to nothing. A further attempt followed in 1987 with support from the Royal Institute of British Architects, and the BIC was publicly launched on 16 September 1987. However, it was more than a year before a first meeting, including the Royal Institution of Chartered Surveyors, took place on 1 November 1988. The body was incorporated in May 1999, and with the Institution of Civil Engineers then a member, changed its name to the Construction Industry Council in April 1990.\nActivities\nCIC provides a single voice for professionals across the built environment through its collective membership of 500,000 individual professionals and more than 25,000 firms of construction consultants. The breadth and depth of its membership means that CIC (like a small number of other bodies, including Constructing Excellence) can speak with authority on issues connected with construction without being constrained by the self-interest of any particular sector of the industry.\nAs representative of the views of professionals, it has a seat on the government/industry body, the Strategic Forum for Construction.\nConstruction Industry Council developed and operates the Design Quality Indicator (DQI) tool to measure the design quality of buildings.\nFrom 2014, CICAIR Limited, a specially created wholly owned subsidiary of CIC, was the sole body authorised to approve Approved Inspectors to undertake building control work in England and Wales. In 2024, responsibility for Approved Inspectors (and Registered Building Control Approvers) was transferred to the Health and Safety Executive; CIC staff working for CICAIR transferred to the HSE.\nOrganisation\nConstruction Industry Council's work is managed on a day-to day basis by a small secretariat which works under the direction of the Chief Executive who is responsible to the Council. The Board acts as the main policy and strategy vehicle of the Council.\nChair\nChairs of the Building or Construction Industry Council and their terms of office:\n*John Nolan: 2016–2018\n*Stephen Hodder: 2019–2021\n*Justin Sullivan: 2021–2023\n*Dr Wei Yang: 2023–2025}}\nIn June 2023, Dr Wei Yang became CIC's first female chair. A town planner and past president of the Royal Town Planning Institute, her appointment also put women in the majority on the CIC board.\nMembership\nThe Construction Industry Council has three categories of membership: Full; Associate; and Honorary Affiliate Members.\nFull members, as of February 2022, are:\nReferences\nExternal links\n* [http://www.cic.org.uk/ Construction Industry Council]\n* [http://www.dqi.org.uk/ Design Quality Indicator]\n* [https://web.archive.org/web/20111004141309/http://www.gleeds.tv/index.cfm?video=348 Interviews with Key Members at the CIC 20th Anniversary Party (Video)]"
    }
  ]
}