{
  "content": [
    {
      "type": "text",
      "text": "# Consort Chen (Sui dynasty)\n\nConsort Chen (577–605), born Princess Ningyuan (), was a daughter of the Emperor Xuan of Chen and an imperial concubine to the Emperor Wen of Sui, founder of the Sui dynasty.\nBackground\nThe future Consort Chen was born in 577, during the reign of her father Emperor Xuan as Princess Ningyuan of Chen. Princess Ningyuan's mother was Emperor Xuan's concubine Consort Shi (; 551–609). A native of Chang'an, Consort Shi was the daughter of Shi Jifeng (), Prince of Shixing (). In addition to Princess Ningyuan, she had borne Emperor Xuan two sons: Chen Shu'ao (陳叔敖), the Prince of Linhe, and Chen Shuxing (陳叔興), the Prince of Ruanling. Both sons later became officials under the Sui dynasty.\nThe year Princess Ningyuan was born, Northern Qi – at whose expense Emperor Xuan had expanded the Chen – fell to the Northern Zhou. Cornered, the Chen lost many of the gains that it had made from its conquest of Northern Qi territory.\nIn 582, when Princess Ningyuan was five, Emperor Xuan died, and the throne was inherited by Princess Ningyuan's older half-brother Chen Shubao, who was an incompetent ruler. On 10 February 589, Chen Shubao surrendered to Emperor Wen of Sui, ending the Chen Dynasty. Chen Shubao and his household (which presumably included Princess Ningyuan) were then escorted to the Sui capital Chang'an.\nAs Imperial Consort\nAfter the fall of the Chen dynasty, Princess Ningyuan was honored as Lady Xuanhua (). She became a consort of Emperor Wen, but he never had relations with her when Empress Dugu was alive. After Empress Dugu's death, Emperor Wen favored Consort Chen and another concubine, Consort Cai.\nIn 604, Emperor Wen resided at Renshou Palace at the advice of his officials. He was accompanied by Consort Chen and Consort Cai, and his son Yang Guang. Emperor Wen was sick and frail, and Yang Guang seized the opportunity to sleep with Consort Chen. Consort Chen reported the rape incident to Emperor Wen, who was angered and sought to replace Yang Guang as the crown prince with formerly deposed Yang Yong. Yang Guang found out and decided to kill Emperor Wen with the assistance of an official named Yang Su. After Emperor Wen's death, Yang Guang took Consort Chen as one of his concubines, along with Consort Cai.\nThe Sui dynasty was short-lived and destroyed by the Tang dynasty.\nIn popular culture\nConsort Chen is portrayed by Hong Kong actress Rebecca Chan in TVB's 1987 series The Grand Canal (大運河)\nReferences"
    }
  ]
}