{
  "content": [
    {
      "type": "text",
      "text": "# Constitutions of the Ukrainian Soviet Socialist Republic\n\nThe Ukrainian Soviet Socialist Republic, part of the Soviet Union, had four successive communist state constitutions during its existence. The first (1919) was in Russian and the final three were in Ukrainian.\nThe final constitution remained effective until the Constitution of Ukraine came into force in 1996.\nConstitution of 1919\n| location_of_document = Kharkiv, Ukrainian Soviet Socialist Republic\n| writer               =\n| signers              =\n|1=Christian Rakovsky\n|2=Georgy Pyatakov\n|3=Andrei Bubnov\n|4=Emanuel Kviring\n}}\n|1=Volodymyr Zatonsky\n|2=Aleksandr Khmelnitskiy\n}}\n| purpose              =\n}}\nAdoption\nThe constitution was approved by the Third All-Ukrainian Congress of Soviets on 10 March 1919 and its final version was approved by the All-Ukrainian Central Executive Committee session on 14 March 1919. The draft of the constitution was created on resolution of the 3rd congress of the Communist Party (Bolsheviks) of Ukraine by the All-Ukrainian Central Executive Committee and the Ukrainian Sovnarkom and was approved by the Central Committee of the Communist Party (Bolsheviks) of Ukraine. It was based on the 1918 Constitution of the Russian SFSR and served as the first fundamental law (basic law) of the Ukrainian SSR.\nParts and articles\n# Fundamental provisions\n# Structure of Soviet power\n## Organization of central power\n## Organization of Soviet power locally\n# Declaration of rights and obligation of working and exploited people of Ukraine\n# About coat of arms and flag of Ukr.S.S.R.\nPolitical regime\nThe constitution acknowledged that Ukrainian SSR and Ukraine were one and the same, particularly starting with the words in part 2, Article 6, \"To the authority of the Soviet power in Ukraine are subjected:\". The constitution consisted out of four parts and 35 articles. The text of the constitution started with the Article 1, \"The Ukrainian Socialist Soviet Republic is an organization of dictatorship of working and exploited masses of proletariat and the poorest peasantry over their ages long oppressors and exploiters, capitalists and landowners\". The main task of the dictatorship was ensuring \"transition from bourgeois system to socialism by carrying out socialist transformations and systematic suppression of all counter-revolutionary manifestations from the side of affluent classes\".\nThe constitution didn't formally introduce a one-party regime and guaranteed citizens' rights and freedoms to \"working masses\". State power was based on the principle of democratic centralism and subjected organs of local government to supreme authorities.\nGovernment and administration\nOrgans of power in Ukrainian SSR were represented by councils (soviets) of workers', peasants' and Red Army deputies, headed by the supreme organ - All-Ukrainian Congress of Soviets represented between its sessions by the All-Ukrainian Central Executive Committee. Governing fuctions belonged to the Council of People's Commissars. Local government was to be formed by respective executive committees elected by local councils.\nElectoral system\nDifferent categories of citizens possessed different electoral rights, with workers having a predominant position - in city councils, 100 workers were represented by 1 deputy, compared to 300 voters per one deputy among other groups. Elections to supreme organs of power were indirect, as a result of which peasants, which comprised the majority of Ukraine's population, were represented by a minority of deputies. Representatives of some groups were disenfranchised.\nRelations inside of the Soviet Union\nThe constitution didn't concern itself with relations of Ukrainian SSR with Soviet Russia, as those were regulated by other acts, most notably the Soviet Union Treaty. Following the establishment of the Soviet Union, in 1925 the document underwent a revision, and functions of several ministries, mainly in the spheres of foreign policy, military, transport and infrastructure, were transferred to all-union organs, with the rest being subjected to norms and regulations of Soviet central government.\nConstitution of 1929\n| location_of_document = Kharkiv, Ukrainian Soviet Socialist Republic, Soviet Union\n| writer               =\n| signers              = The 11th All-Ukrainian Congress of Soviets\n| purpose              =\n}}\nAdoption\nThe new constitution was adopted on 15 May 1929 by the All-Ukrainian Council of Soviets. In comparison to its predecessor, it was even closer in content to similar documents from other Soviet republics.\nArticles\n# Principles\n# Organizations of Soviet Power\n##Organs of Central Power\n### About All-Ukrainian Congress of Soviets\n### About All-Ukrainian Central Executive Committee\n### About Presidium of All-Ukrainian Central Executive Committee\n### About Council of People's Commissars of the Ukrainian Socialist Soviet Republic\n##Organs of Local Power\n### About Congress of Soviets\n### About Executive Committees\n### About Soviets of Deputies\n### About Competence of Local Organs of Power\n# About electoral rights\n# About Budget of the Ukrainian Socialist Soviet Republic\n# About Coat of Arms, Flag and Capital of the Ukrainian Socialist Soviet Republic\nConstitution of 1937\n| location_of_document = Kyiv, Ukrainian Soviet Socialist Republic, Soviet Union\n| writer               =\n| signers              = The 14th All-Ukrainian Congress of Soviets (extraordinary)\n| purpose              =\n}}\nAdoption\nThe new constitution was adopted at an extraordinary congress of Soviets of Ukrainian SSR in January 1937 following the adoption of 1936 Soviet Constitution.\nParts and articles\n# Social organization\n# State organization\n# Higher organs of state power of the Ukrainian Soviet Socialist Republic\n# Organs of state administration of the Ukrainian Soviet Socialist Republic\n# Higher organs of state power of the Moldavian Autonomous Soviet Socialist Republic\n# Organs of state administration of the Moldavian Autonomous Soviet Socialist Republic\n# Local organs of state power\n# Budget of the Ukrainian Soviet Socialist Republic\n# Court and the Prosecutor's Office\n# Principle rights and obligations of citizens\n# Electoral system\n# Coat of arms, flag, capital city\n# Constitutional amendments procedure\nContents\nThe constitution defined the basics of Socialist society and introduced the formation of all soviets on the base of direct general elections on an equal basis and with secret ballots. The organ of supreme legislative power in Ukrainian SSR according to the constitution was the Verkhovna Rada, and local government was elected by respective local councils. The constitution declared a guarantee of citizens' rights, but at the same time recognized the existence of one-party system dominated by the Communist Party of Ukraine representing a local branch of the Communist Party of the Soviet Union. Parts of the constitution were altered in following years, for instance allowing the Ukrainian SSR to enter relations with other countries as part of its representation at the United Nations. The Soviet constitution precluded separate articles of republican constitutions from being valid in case if they contradicted its own regulations.\n1978 Constitution of the UkrSSR\nThe 1978 Constitution of the UkrSSR () was a fundamental law of the Ukrainian Soviet Socialist Republic, the fourth and the last of Constitutions of the UkrSSR. It was based on the 1977 Constitution of the USSR ( and adopted on 20 April 1978 by the extraordinary seventh sessions of Supreme Council of the UkrSSR of 9th convocation. Its text was developed by a commission headed by Volodymyr Shcherbytsky.\nAfter the 1991 Ukrainian Declaration of Independence, the constitution was amended and renamed into the Constitution of Ukraine. Formally, it lost its validity on 28 June 1996 with adoption of the new constitution.\nIn its preamble, the constitution indicated on its succession of constitutional development of Ukraine, ideas and principles of which were fixed in constitutions of 1919, 1929, and 1937.\nArticles\nThe 1978 Constitution (Fundamental Law) of the UkrSSR was divided into 10 sections and 19 chapters:\n* Preamble\n# Fundamentals of social system and politics of the Ukrainian SSR\n##Chapter 1 Political system\n##Chapter 2 Economic system\n##Chapter 3 Social development and culture\n##Chapter 4 Foreign policy and defence of socialist Fatherland\n# State and Individual\n##Chapter 5 Citizenship of the Ukrainian SSR. Equality of citizens\n##Chapter 6 Fundamental rights, freedoms and duties of citizens of the Ukrainian SSR\n# State-National and Administratively Territorial System of the Ukrainian SSR\n##Chapter 7 The Ukrainian SSR is a union republic within the USSR\n##Chapter 8 Administratively territorial system of the Ukrainian SSR\n# Councils of People's Deputies of the Ukrainian SSR and Order of Their Election\n##Chapter 9 System and principles councils people's deputies\n##Chapter 10 Electoral system\n##Chapter 11 People's Deputy\n# The Highest Organs of State Power and Administration of the Ukrainian SSR\n##Chapter 12 Supreme Council of the Ukrainian SSR\n##Chapter 13 Council of Ministers of the Ukrainian SSR\n# Local Organs of State Power and Administration of the Ukrainian SSR\n##Chapter 14 Local councils of people's deputies\n##Chapter 15 Executive committees of local councils of people's deputies\n# State Plan of Economical and Social Development of the Ukrainian SSR and State Budged of the Ukrainian SSR\n##Chapter 16 State plan of economical and social development of the Ukrainian SSR\n##Chapter 17 State Budget of the Ukrainian SSR\n# Justice, Arbitration and Prosecutor's Supervision\n##Chapter 18 Court trials and arbitration\n##Chapter 19 Prosecutor's Office\n# Coat of Arms. Flag, Anthem and Capital of the Ukrainian SSR\n# Execution of the Constitution of the Ukrainian SSR and Order of Its Amendement\nSee also\n* Constitution of Ukraine\n* Constitution of the Soviet Union\nNotes\nReferences\nSource\n*[https://zakon.rada.gov.ua/laws/show/888-09#Text text of the 1978 Constitution]"
    }
  ]
}