{
  "content": [
    {
      "type": "text",
      "text": "# Conservation management system (United Kingdom)\n\nAs a British idea the concept of a national conservation management system may be traced to an upsurge of sentiment after the Second World War that the world should be made a better place.  It was the botanist Arthur Tansley who pleaded for organised nature conservation on the double ground of scientific value and beauty. He had advanced the concept of the ecosystem in 1935, and a number of key ideas of relevance to nature conservation stem from this. In the immediate post-war years, he hoped for an 'Ecological Research Council', and a 'National Wildlife Service'.  In this context, the idea of national standards of conservation management can be traced to the formation of the Nature Conservancy Council (NCC), and its great survey of habitats and species, the Nature Conservation Review, published in 1977.   From this time there was general agreement that the common purpose of conservation management systems was to transform situations of ecological confrontation between humans and non-humans into a system of mutual accommodation.  The NCC's first guidelines for managing its national resource was a pro forma to accommodate a description of the site, the goals of management, and a prescriptive section, in which the objectives of management were to be interpreted in a practical manner.  Central to the latter section were lists of codified jobs to help wardens abide by best practice. The major shortcoming of the guidelines was the lack of a business philosophy to track value for the inputs of effort and resources.\nBritain's first proper conservation management system (CMS), which tied objectives to practical interventions with feedback from monitoring outcomes, coalesced around Mike Alexander (Warden of Skomer Island National Nature Reserve), Tim Read (staff member of the Joint Nature Conservation Committee) and James Perrins (an environmental/IT graduate of York University). This initiative in the 1980s led to the setting up of the CMS Consortium [http://www.cmsconsortium.org] by the UK's main conservation agencies, which produced a relational database for linking management objectives with scheduled on-site operational inputs. See the CMS website [http://www.esdm.co.uk/cms] for more information. The database recorded all actions, particularly the results of monitoring against performance indicators.  Over the years the software has improved greatly with respect to the user/screen interface, but the data model is still very much the same as in the original programme, which was produced with 'Advanced Revelation' (Arev).  Although the NCC has been replaced by four country agencies, in terms of the widespread uptake of the CMS across the UK, the current version, mounted on MS Access, is now, de facto, a national conservation management system.  As its use becomes more widespread CMS plans are beginning to function as an evidence-based library of best practice for exchanging practical know-how between users.\nData model of a conservation management system (CMS)\nA CMS is simply a recording and filing tool that aids and improves the way in which heritage green assets are managed and kept in a favourable condition.  Its prime function is to keep track of the inputs, outputs and outcomes of projects to meet measurable objectives. The aim is to promote efficient and effective operations, and allow recording of the work that was done and reporting on whether or not the objective was achieved.  A CMS also enables the exchange of information about methods and achievements within and between organisations. These are essential components of a CMS of any scale, whether a national park, or a village pond.\nTechnically, a CMS is a project-based planning and recording system aimed at managing conservation features within acceptable limits of variation.  A feature is any component of the environment that has to be managed e.g. a footpath or a species.  A 'project' is simply a programme of work leading to an output e.g. 'construct a footpath', 'patrol an area' or 'record a species'.\nProjects are work plans that control specific factors that help or impede the attainment of management objectives.  Each project includes a description of a process, e.g. the work to be done, when and where it is to be done and the inputs of resources required.\nWhen a project is completed, what was actually done is recorded.  This is an output.\nThe outcome of a CMS is the state of the feature at the end of the project and is measured by performance indicators.\nPerformance indicators are quantitative or qualitative attributes of the features e.g. numbers of a species, and they are measured by special monitoring-projects in order to gauge success in reaching the management objectives.\nCopies of all projects with their inputs, outputs and outcomes are retained in the CMS to provide a progress- register, and an archive to support managerial continuity.\nIn summary, the prime function of a CMS is to enable conservation managers to control the operational functions of a management plan as a feedback system or work-cycle by:\n*identifying and describing, in a standard way, all the tasks required to control the key factors (positive or negative), which influence the condition of the features, and thereby maintain the features in a favourable condition;\n*producing and budgeting various work programmes to control the factors, for example, five-year plans, rolling- plans, annual schedules, financial schedules, and work schedules for specified categories of staff;\n*providing a site/species monitoring system to check the effectiveness of the plan against the specified objectives;\n*facilitating the exchange of management information by reporting, within, and between, sites and organisations;\n*using feedback from monitoring to improve the management system.\nThe sequence of identifying features, setting objectives, and then selecting the factors to be controlled by projects with scheduled work plans, comprises a management plan.\nThe most effective way of organising a CMS is to assemble it as a set of interlinked forms as a relational database.  However, it is also possible to operate a management plan with a spread sheet or a collection of hyperlinked 'to-do' lists.\nPlanning cycle of a CMS\nImage:Datamodel.jpeg\nScope of conservation management\nConservation management implies the control of environmental and socioeconomic factors in order:\n*to make more efficient use of materials,\n*to recycle materials and energy that are vital to human survival,\n*to restore derelict land\n*and to maintain the capacity of ecosystems, which are the basis of all economies, to renew and grow.\nThis is a vast area of applied science and technology, which is developing alongside new social attitudes towards the values of natural resources.\nOver the years, particularly at a governmental level, conservation management has come to focus on biological resources such as:\n*Agriculture and pastoralism\n*Fisheries\n*Forestry\n*Water\n*Tourism and recreation\n*Wildlife\n*Genetic resources\nFrom this perspective the aim is to foster attitudes in community and industry to the use of biological resources, changing from the 'maximum yield' approach to one of ecologically sustainable yield.  This new attitude recognises the need for conservation of biodiversity and maintenance of ecological integrity.\nSince the first Global Environment Summit in 1992, national strategies are now commonly in place to integrate regimes of conservation management within and between industry sectors and communities to meet appropriate environmental, economic and social objectives. The practical aim is now to turn these strategies into operational systems and so balance exploitative management of natural resources with their conservation management. The goal is to provide the principles and tools to soften the clash between Earth's ability to sustain life and the character of its human occupancy.  This means developing methods for biological conservation management alongside softer technological organisations for production (natural economy) and 'green' legislative actions for the organisation of people for production (political economy).  The global educational topic-framework, which links conservation management with exploitative management, has been defined as 'cultural ecology'. It is within this area of knowledge that conservation management systems can be seen to require more than the scientific input of conservation biology.  The essential feature of conservation management programmes is that they are part of the linkages between environmental, social and economic progress; between peace and security; between productivity of environment and community; and between sustainability and the renewal and extension of democracy. This is a roundabout way of saying that conservation management is about working on behalf of the wild to restore a culture, where people live and think as if they were totally engaged with their place on the planet for the long future.\nFundamental scientific questions\nIt is commonplace to hear conservation managers stress that they are really naturalists who do their best to apply good science to ecosystems that are unique in each case history.  No two nature sites share the same history and factors limiting their biodiversity. They will differ with respect to time lags and non-linear responses to a given intervention. From this point of view conservation systems have much in common with the management systems of farmers and gardeners with regards uncertainties of the effects of inputs.  Because of the internal complexity of ecosystems, science has yet to answer fundamental questions that were posed by Darwin regarding the factors that control relative abundance of species, with respect to space, time, pattern, food chains and population dynamics. Every nature reserve is likely to have some or all of the following questions unanswered.  They are fundamental questions in ecological science that underpin all conservation management systems.\n*How do organisms change with space?\n**What constitutes and adequate size and shape of a reserve?\n*How do organisms change with time?\n**To what extent is the site a successional process?\n*How do organisms exist in patterns?\n**How many states or 'ways to be' are there for a particular compositional state of a habitat?\n*How do organisms exist in food chains?\n**What is the importance of keystone resources in maintaining community structure?\n*How do organisms exist in populations?\n**What is a sustainable population size for a particular species?\nAnswers to these questions are embedded in the management system.  All environmental systems are open systems with throughputs of matter and energy whilst maintaining structure and permanence in the medium term.  A conservation management system will become part of this ecosystem with linkages to several feedback mechanisms, some positive and some negative, so that feedback loops can be unpredictable.  This situation makes it virtually impossible to map the system as a whole, and usually the feedback is only revealed as an unexpected response, once management has commenced.  It is in this sense that a management plan can be considered as the first stage of a research project, and the plan is changed in response to its outcomes.\nReferences\n*Pinchot, G., (1947) Breaking New Ground, Harcourt Brace, New York\n*Usher, M. B. (1973) Biological Management and Conservation: Chapman and Hall London\n*Carter, G. F., (1975) Man and the Land- A Cultural Geography, Holt Rinehart & Winston, New York\n*Hays, S. P., (1975) Conservation and the Gospel of Efficiency, Atheneum, New York\n*Ratcliffe, D. Ed (1977) A Nature Conservation Review Vols 1 & 2: Cambridge University Press\n*Slobodkin, L. B., (1988). Intellectual problems of applied ecology. Bioscience 38: 337-42\n*Fiedler, P. L., and Jain, S. K. Eds. (1992) Conservation Biology; the Theory and Practice of Nature Conservation Preservation and Management, Chapman and Hall, New York\n*Botsford, L. W., and Jain, S. K. (1991) Population biology and its application to practical problems, In Applied population biology, ed. S.K. Jain and L.W.Botsford, Kluever, Dordrecht\n*Snyder, G., (1995) The Rediscovery of Turtle Island, A Place in Space, Aesthetics and Watersheds, Counterpoint, Washington D.C.\n*Christie, I., and Warburton, D. (2001) From Here to Sustainability, Earthscan Publications, London.\nExternal links\n*[http://www.cmsconsortium.org/ Conservation Management System Consortium], an international partnership of conservation organisations from the UK and the Netherlands"
    }
  ]
}