{
  "content": [
    {
      "type": "text",
      "text": "# Constitution of the Roman Empire__disambig_1\n\nThe Constitution of the Roman Empire was an unwritten set of guidelines and principles passed down mainly through precedent. After the fall of the Roman Republic, the constitutional balance of power shifted from the Roman Senate to the Roman Emperor. Beginning with the first emperor, Augustus, the emperor and the Senate were theoretically two co-equal branches of government. In practice, however, the actual authority of the imperial Senate was negligible, as the emperor held the true power of the state. During the reign of the second emperor, Tiberius, many of the powers that had been held by the Roman assemblies were transferred to the Senate.\nThe powers of an emperor existed by virtue of his legal standing. The two most significant components to an emperor's power were the \"tribunician powers\"  and the proconsular imperium, or the power to command. The tribunician powers gave the emperor authority over Rome itself and the civil government, while the proconsular powers gave him authority over the provinces and the army. While these distinctions were clearly defined during the early empire, eventually they were lost, and the emperor's powers became less constitutional and more monarchical. The traditional magistracies that survived the fall of the Republic were the Consulship, Praetorship, Plebeian Tribunate, Aedileship, Quaestorship, and Military Tribunate. Any individual of the senatorial class could run for one of these offices. If an individual was not of the senatorial class, he could run for one of these offices if he was allowed to run by the emperor, or otherwise, he could be appointed to one of these offices by the emperor.\nImperial constitutional history\nThe general who won the last civil war of the Roman Republic, Gaius Octavian, became the master of the state. In the years after 30&nbsp;BC, Octavian set out to reform the Roman constitution. The ultimate consequence of these reforms was the abolition of the republic and the founding of the Roman Empire. When Octavian deposed his fellow triumvir, Mark Antony, in 32&nbsp;BC, he resigned his position as triumvir, but was probably vested with powers similar to those that he had given up. Octavian wanted to solidify his status as master of the state whilst avoiding  assassination.\nOn 13 January 27&nbsp;BC, Octavian gave up his extraordinary powers, including his proconsular imperium, triumvirate authority, and powers granted in the consensus universorum, back to the Senate and people of Rome. However, he kept the Senate's grant of tribunician power in 36&nbsp;BC and remained consul for 27&nbsp;BC. He received from the Senate, doubtlessly at his own suggestion, greater proconsular imperium for a period of ten years, giving him supreme authority over the provinces, and therefore, the entire Roman military. These various powers and offices both allowed him to maintain his legal authority over the empire at large and claim that the Republic was restored. The wide-reaching grant of proconsular authority was precedented in lex Gabinia's grant of similar authority to Pompey in 67&nbsp;BC. Furthermore, the proconsular powers were theoretically outranked by the consular powers held by the sitting consuls, allowing Octavian to claim he did not stand above any other magistrates of the state. To maintain his control in Italy, which was not considered a province, Octavian had the Assemblies elect him to the position of consul.\nAt this point, the Senate also granted Octavian the title \"augustus\" and the position of princeps senatus, or the first Senator. When Augustus, as Octavian was renamed, gave up the consulship in 23&nbsp;BC, the Senate granted him an expansion of his proconsular authority, with legal authority at the same level as those of the normal consuls. Furthermore, Augustus expanded the use of the tribunician powers granted in 36&nbsp;BC, which allowed him to interfere in administration, convoke the people, propose legislation, veto other political bodies, etc. After these final reforms had been instituted, Augustus never again altered his constitution, although he did periodically assume the office of censor to affect changes in the Senatorial rolls (alone in 8&nbsp;BC, and with Tiberius in AD 14) and hold the consulship (twice after 23&nbsp;BC). When, in 20&nbsp;BC, a famine in Rome led to the people offering Augustus the dictatorship, he refused, instead taking on the cura annonae: the administration of the grain supply. And when the ten-year term of his proconsular authority elapsed, he continued the fiction of the temporary nature of his authority, having it renewed in 18&nbsp;BC, 13&nbsp;BC, 8&nbsp;BC, 3&nbsp;BC, and 8 AD. While there were minor changes in the provinces which he governed by nature of his proconsular authority (Gallia Narbonensis and Cyprus were returned to the Senate's administration in 22&nbsp;BC), its overriding nature did not change until after his death.\nAugustus' final goal was to figure out a method to ensure an orderly succession, something necessary in any monarchical constitution and to avoid the resurgence of civil war. Augustus could not transfer his powers to a successor upon his death, as they were given specifically to him for some fixed term or during his life. Thus, any successor would need to have his own authority and influence. In 6&nbsp;BC Augustus granted tribunician powers to his stepson Tiberius and recognised Tiberius as his heir. In AD&nbsp;13, a law was passed which made Tiberius' legal powers equivalent to and independent from those of Augustus.\nOn Augustus' death, Tiberius had to take control of the state, since the nominally republican constitution did not allow for the dead emperor to bequeath powers. With the support of the Praetorian Guard and the army, he quickly took control of the state. During his reign, the power to elect magistrates was transferred from the assemblies to the Senate and he ended the practice of proposing laws before them. When Tiberius died, Caligula was proclaimed emperor by the Senate. In 41, Caligula was assassinated, and for two days following his assassination, the Senate debated whether to restore the Republic. Due to the demands of the army, however, Claudius was ultimately declared emperor. While Claudius' antiquarian interests resulted in his attempts to revive the old censorship, these powers became increasingly folded into imperial prerogatives.\nOver time, the consulship was increasingly devalued, as the practice of selecting suffect consuls expanded, with sometimes up to 12 pairs of colleagues being elected every year by the Antonine period. With its duties of state increasingly being folded into the office of emperor, its judicial authority was emphasised in the Senate's new role as a criminal court. The consuls lost practically all their political powers and took over responsibility for organising public games to celebrate holidays and imperial events. The political power of many of the Republic's other magistracies was also neutered and high offices of state effectively became municipal offices with primarily administrative duties only in Rome. The praetors became administrators of the grain dole and games, retaining some judicial authority over civil and criminal cases until the third century. The duties of the aediles were to organise policing of games and public funerals, their judicial authority stripped away in 36 AD, and the office fell out of use by the middle of the third century. The tribunes, who theoretically retained their veto powers, which were irrelevant because they could be overridden by the emperor, became presidents of various new city regions.\nVespasian's reign saw the reorganisation of the Senate from a body of aristocratic Romans to one of the Empire's aristocracy, with its membership and privileges given by the emperor. Domitian's reign marked a significant turning point on the road to monarchy and the end of the constitutional arrangement whereby the Senate and Emperor ruled the Empire together. After making himself consul for ten years, Domitian made himself Censor for life, and unlike his father, he used these powers to further subjugate the Senate by controlling its membership. Throughout his reign, he abrogated the rights of senators, only referred to it the most trivial matters, prevented it from acting on matters of any import, and forced it into compliance through his use of censorial powers. In effect, it became a rubber stamp. While the Senate regained some authority when it elected the emperor Nerva, by this point, the powers that were theoretically held by the last remaining republican institution of any import, were clearly defined only by the will of the emperor.\nSenate\nAfter the fall of the Roman Republic, the constitutional balance of power shifted from the Roman Senate to the Roman Emperor. Beginning with the first emperor, Augustus, the emperor and the senate were technically two co-equal branches of government. In practice, however the actual authority of the imperial senate was negligible, as the emperor held the true power of the state. As such, membership in the senate became sought after by individuals seeking prestige and social standing, rather than actual authority. During the reigns of the first emperors, legislative, judicial, and electoral powers were all transferred from the Roman assemblies to the senate. However, since the control that the emperor held over the senate was absolute, the senate acted as a vehicle through which the emperor exercised his autocratic powers.\nThe Curia Julia in the [[Roman Forum, the seat of the imperial Senate.]]\nThe first emperor, Augustus, inherited a senate whose membership had been increased to 900 senators by his predecessor, the Roman Dictator Julius Caesar. Augustus reduced the size of the senate to 600 members, and after this point, the size of the senate was never again drastically altered. One could become a senator by being elected Quaestor (a magistrate with financial duties). However, one could only stand for election to the Quaestorship if one was of senatorial rank, and to be of senatorial rank, one had to be the son of a senator. If an individual was not of senatorial rank, there were two ways for that individual to become a senator. Under the first method, the emperor granted that individual the authority to stand for election to the Quaestorship, while under the second method, the emperor appointed that individual to the senate.\nThe power that the emperor held over the senate was absolute, in part due to the fact that the emperor was also censor, meaning he controlled membership in the body itself. During senate meetings, the emperor sat between the two Consuls, and usually acted as the presiding officer. Higher ranking senators spoke before lower ranking senators, although the emperor could speak at any time. Most of the bills that came before the senate were presented by the emperor, who had usually appointed a committee to draft each bill before presenting it. While the Roman assemblies continued to meet after the founding of the empire, their powers were all transferred to the senate, and so senatorial decrees (senatus consulta) acquired the full force of law. The legislative powers of the imperial senate were principally of a financial and an administrative nature, although the senate did retain a range of powers over the provinces. During the early empire, all judicial powers that had been held by the Roman assemblies were also transferred to the senate. For example, the senate now held jurisdiction over criminal trials. In these cases, a Consul presided, the senators constituted the jury, and the verdict was handed down in the form of a decree (senatus consultum), and, while a verdict could not be appealed, the emperor could pardon a convicted individual through a veto. In theory, the senate elected new emperors, while in conjunction with the popular assemblies, it would then confer upon the new emperor his command powers (imperium). After an emperor had died or abdicated his office, the senate would often deify him, although sometimes it would pass a decree (damnatio memoriae or \"damnation from memory\") which would attempt to cancel every trace of that emperor from the life of Rome, as if he had never existed. The emperor Tiberius transferred all electoral powers from the assemblies to the senate, and, while theoretically the senate elected new magistrates, the approval of the emperor was always needed before an election could be finalized.\nLegislative Assemblies\nThe Legislative Assemblies of the Roman Empire were political institutions in the ancient Roman Empire. During the reign of the second Roman Emperor, Tiberius, the powers that had been held by the Roman assemblies (the comitia) were transferred to the Senate. The neutering of the assemblies had become inevitable because the electors were, in general, ignorant as to the merits of the important questions that were laid before them, and often willing to sell their votes to the highest bidder. After the founding of the Roman Empire, the People of Rome continued to organize by Centuries and by Tribes, but by this point, these divisions had lost most of their relevance.\nLictor, painted by Cesare Vecellio.\nWhile the machinery of the Centuriate Assembly continued to exist well into the life of the empire, the assembly lost all of its practical relevance. Under the empire, all gatherings of the Centuriate Assembly were in the form of an unsorted convention. Legislation was never submitted to the imperial Centuriate Assembly, and the one major legislative power that this assembly had held under the republic, the right to declare war, was now delegated to the emperor through his greater proconsular authority. All judicial powers that had been held by the republican Centuriate Assembly were transferred to independent jury courts, and under the emperor Tiberius, all of its former electoral powers were transferred to the senate. After it had lost all of these powers, it had no remaining authority. Its only remaining function was, after the senate had 'elected' the magistrates, to hear the renuntiatio, The renuntiatio had no legal purpose, but instead was a ceremony in which the results of the election were read to the electors. This allowed the emperor to claim that the magistrates had been \"elected\" by a sovereign people.\nAfter the founding of the empire, the tribal divisions of citizens and freedmen continued, but the only political purpose of the tribal divisions was such that they better enabled the senate to maintain a list of citizens. Tribal divisions also simplified the process by which grain was distributed. Eventually, most freedmen belonged to one of the four urban tribes, while most freemen belonged to one of the thirty-one rural tribes. Under the emperor Tiberius, the electoral powers of the Tribal Assembly were transferred to the senate. Each year, after the senate had elected the annual magistrates, the Tribal Assembly also heard the renuntiatio. Any legislation that the emperor submitted to the assemblies for ratification were submitted to the Tribal Assembly. The assembly ratified imperial decrees, starting with the emperor Augustus, and continuing until the emperor Domitian. The ratification of legislation by the assembly, however, had no legal importance as the emperor could make any decree into law, even without the acquiescence of the assemblies. Thus, under the empire, the chief executive again became the chief lawgiver, which was a power he had not held since the days of the early republic.\nThe Plebeian Council also survived the fall of the republic, and it also lost its judicial and electoral powers to the Senate during the reign of Tiberius, even if many of Augustus' reforms were passed as plebiscita in the Council. While it retained its theoretical legislative powers, after the reign of Tiberius, the only known piece of legislation, excepting the grants of tribunician power to the emperor, passed via the Council is an agrarian law under Nerva. By virtue of his tribunician powers, the emperor always had absolute control over the council.\nExecutive Magistrates\nThe Executive Magistrates were elected individuals of the ancient Roman Empire. The powers of an emperor, (his imperium) existed, in theory at least, by virtue of his legal standing. The two most significant components to an emperor's imperium were the \"tribunician powers\" (potestas tribunicia) and the \"proconsular powers\" (imperium proconsulare). In theory at least, the tribunician powers (which were similar to those of the Plebeian Tribunes under the old republic) gave the emperor authority over Rome's civil government, while the proconsular powers (similar to those of military governors, or Proconsuls, under the old republic) gave him authority over the Roman army. While these distinctions were clearly defined during the early empire, eventually they were lost, and the emperor's powers became less constitutional and more monarchical.\nBy virtue of his proconsular powers, the emperor held the same grade of military command authority as did the chief magistrates (the Roman Consuls and Proconsuls) under the republic. However, the emperor was not subject to the constitutional restrictions that the old Consuls and Proconsuls had been subject to. Eventually, he was given powers that, under the republic, had been reserved for the Roman Senate and the Roman assemblies, including the right to declare war, to ratify treaties, and to negotiate with foreign leaders. The emperor's degree of Proconsular power gave him authority over all of Rome's military governors, and thus, over most of the Roman army. The emperor's tribunician powers gave him power over Rome's civil apparatus, as well as the power to preside over, and thus to dominate, the assemblies and the senate. When an emperor was vested with the tribunician powers, his office and his person became sacrosanct, and thus it became a capital offense to harm or to obstruct the emperor. The emperor also had the authority to carry out a range of duties that, under the republic, had been performed by the Roman Censors. Such duties included the authority to regulate public morality (censorship) and to conduct a census. As part of the census, the emperor had the power to assign individuals to a new social class, including the senatorial class, which gave the emperor unchallenged control over senate membership. The emperor also had the power to interpret laws and to set precedents. In addition, the emperor controlled the religious institutions, since, as emperor, he was always Pontifex Maximus and a member of each of the four major priesthoods.\nUnder the empire, the citizens were divided into three classes, and for members of each class, a distinct career path was available (known as the cursus honorum). The traditional magistracies were only available to citizens of the senatorial class. The magistracies that survived the fall of the republic were (by their order of rank per the cursus honorum) the Consulship, Praetorship, Plebeian Tribunate, Aedileship, Quaestorship, and Military Tribunate. If an individual was not of the senatorial class, he could run for one of these offices if he was allowed to run by the emperor, or otherwise, he could be appointed to one of these offices by the emperor. During the transition from republic to empire, no office lost more power or prestige than the Consulship, which was due, in part, to the fact that the substantive powers of republican Consuls were all transferred to the emperor. Imperial Consuls could preside over the senate, could act as judges in certain criminal trials, and had control over public games and shows. The Praetors also lost a great deal of power, and ultimately had little authority outside of the city. The chief Praetor in Rome, the Urban Praetor, outranked all other Praetors, and for a brief time, they were given power over the treasury. Under the empire, the Plebeian Tribunes remained sacrosanct, and, in theory at least, retained the power to summon, or to veto, the senate and the assemblies. Augustus divided the college of Quaestors into two divisions, and assigned one division the task of serving in the senatorial provinces, and the other the task of managing civil administration in Rome. Under Augustus, the Aediles lost control over the grain supply to a board of commissioners. It wasn't until after they lost the power to maintain order in the city, however, that they truly became powerless, and the office disappeared entirely during the 3rd century.\nThe end of the Principate\nDuring the period that began with the accession of the emperor Nerva and ended with the death of the emperor Commodus, the empire continued to weaken. It was becoming difficult to recruit enough soldiers for the army, inflation was becoming an issue, and on at least one occasion, the empire almost went bankrupt. The most significant constitutional development during this era was the steady drift towards monarchy. It is not known exactly how M. Cocceius Nerva became emperor, although he was probably supported by the conspirators who overthrew Domitian. His reign, while too short for any major constitutional reforms, did reverse some of the abuses that his predecessor was responsible for. When Nerva died in January 98, Trajan succeeded him without opposition. Trajan went further than even Nerva had in restoring the image of a free republic. He refused to preside over capital trials against senators, and was away from Rome for such extended periods that the senate even regained some independent legislative abilities.\nHadrian succeeded Trajan as emperor. By far, his most important constitutional alteration was his creation of a bureaucratic apparatus, which included a fixed gradation of clearly defined offices, and a corresponding order of promotion. Many of the functions that had been outsourced in the past were now to be performed by the state, and this system would be revived by the emperor Diocletian when he established the Tetrarchy. Hadrian was succeeded by Antoninus Pius, who made no real changes to the constitution. He was succeeded by Marcus Aurelius in 161. The most significant constitutional development that occurred during the reign of Marcus Aurelius was the revival of the republican principle of collegiality, as he made his brother, L. Aelius, his co-emperor. Marcus Aurelius ruled the western half of the empire, while his brother ruled the eastern half of the empire. In 169, Aelius died, and in 176, Marcus Aurelius made his son, L. Aurelius Commodus, his new co-emperor. This arrangement was also revived when the emperor Diocletian established the Tetrarchy. In 180, Marcus Aurelius died, and Commodus became emperor. Commodus' tyranny revived the worst memories of the later Julian emperors, as he was more explicit than any of his predecessors in taking powers that he did not legally have, and in disregarding the constitution. He was killed in 192.\nNo further constitutional reforms were enacted during the Principate. The only development of any significance was the continuing slide towards monarchy, as the constitutional distinctions that had been set up by Augustus lost whatever meaning that they still had. Starting in 235, with the reign of the barbarian emperor Maximinus Thrax, the empire was put through a period of severe military, civil, and economic stress. The crisis arguably reached its height during the reign of Gallienus, from 260 to 268. The crisis ended with the accession of Diocletian in 284, who reformed the imperial military, administrative, and economic system, and in doing so abolished the Principate in favour of a naked autocratic empire.\nSee also\n* Roman Kingdom\n* Roman Republic\n* Roman Empire\n* Roman Law\n* Plebeian Council\n* Centuria\n* Curia\n* Roman consul\n* Praetor\n* Roman censor\n* Quaestor\n* Aedile\n* Roman Dictator\n* Master of the Horse\n* Roman Senate\n* Cursus honorum\n* Byzantine Senate\n* Pontifex Maximus\n* Princeps senatus\n* Interrex\n* Promagistrate\n* Acta Senatus\n* Constitution (Roman law)\nReferences\nFurther reading\n*\n*\n*\n*\n*\nPrimary sources\n* [http://oll.libertyfund.org/?option=com_staticxt&staticfile=show.php%3Ftitle=546&chapter=83299&layout=html&Itemid=27 Cicero's De Re Publica, Book Two]\n* [http://www.fordham.edu/HALSALL/ANCIENT/polybius6.html Rome at the End of the Punic Wars: An Analysis of the Roman Government; by Polybius]"
    }
  ]
}