{
  "content": [
    {
      "type": "text",
      "text": "# Contra: Legacy of War\n\nSaturn\n|genre = Third-person shooter\n|modes = Single player, multiplayer\n}}\nContra: Legacy of War is a 1996 third-person shooter game developed by Appaloosa Interactive and published by Konami for the PlayStation and Sega Saturn. It is a follow-up to Contra: Hard Corps, and was the first of two games in the Contra series that were externally developed by Appaloosa; the second game, C: The Contra Adventure, was released in 1998. Legacy of War marks the series' shift to three-dimensional graphics and gameplay, the game was released packaged with a pair of 3D anaglyph glasses, which enables the player to view the 3D effects incorporated into the game's graphics. Legacy of War bears the distinction for being the first console game in the series to retain both the Contra title and human characters during its release in Europe and Australia (where the console series has been known as Probotector from the first NES game until Contra: Hard Corps). The game was scheduled to be released in Japan as well, but was cancelled.\nStory\nColonel Bassad, a dictator of a small country, has become a threat and is amassing an army of soldiers, robots, and alien mutants. Bassad has allied himself with an unknown alien entity for his bid to world domination. Ray Poward (returning from Hard Corps) is deployed to thwart Bassad's scheme along with three of the newest members of the Hard Corps team: Tasha, a female mercenary; CD-288, a robot; and Bubba, an alien. After making the way to Bassad's Mountain Stronghold, the team defeats him in his armored pod, but is dragged into his mind for a final battle. With Bassad defeated, they are teleported to the alien entity, which turns out to be a small living planet. With it destroyed, the team is drifted in space, and a surviving small alien bug is seen hiding.\nGameplay\nEach character plays exactly the same except for the type of weapons they wield and their movement speed. All characters start with a machine gun and flamethrower, but the remaining two slots are for character-specific weaponry. The game plays from an isometric angle. Since the game takes place in three dimensions, enemies come from all angles. Ducking and strafing have been added to the player's abilities, as well as an auto-aiming feature to help attack airborne enemies. Jumping has been slightly changed as the characters no longer do tightly curled somersault jumps (a feature in every previous game since the arcade version of the original Contra). The player's progress can be saved to a memory card.\nDevelopment\nThe game was first unveiled at the 1996 Electronic Entertainment Expo, during which Konami distributed 3-D glasses to attendees so that they could see the 3-D effect. This somewhat backfired, as journalists in attendance at the show reported that the 3-D feature was a \"gimmick\" and did not improve the game's visuals.\nWith the game 80% complete, Electronic Gaming Monthly reported that Randy Severin, senior product manager at Konami, was unhappy with the present state of the game, believing that some of the levels were too bright and colorful, and some of the bosses not menacing enough. The following month they received a near complete version which featured numerous adjustments to the color palette, speed, enemy AI, and graphics.\nLike most 32-bit action games, Contra: Legacy of War uses environments built of texture-mapped polygons.\n| NGen =  (PS1)\n| GR = 64% (PS1)\n}}\nReviews of Legacy of War differed in how they compared the game to previous installments in the series. Jeff Gerstmann of GameSpot advised, \"for those looking for a real game of Contra, break out the SNES and have at it\", and said the game would have been better if it were not saddled with the Contra name and the unrealistically high expectations that come with it. GamePros The Gun Nut said it fails to live up to the standards set by the series, and even to less prestigious action games such as Loaded. However, Major Mike of GamePro said \"Legacy has fast blasting action, the trademark of any Contra game\", and a reviewer for Next Generation opined, \"While it's no 32-bit breakthrough product, this latest in the series embodies everything that makes a Contra game enjoyable.\" He elaborated that the game made an appreciable step into the 3D generation, while retaining the same weapons, power-ups, and pacing of past Contra games. Critics agreed that the graphics are solid with some impressive highlights, though The Gun Nut and Major Mike criticized some of the visual aesthetics. Most reviews made no mention of the optional stereoscopic 3D feature, but Gerstmann specifically commented that it was unimpressive. Next Generation and Gerstmann praised the game's variety of weapons, enemies, and terrain, while Major Mike and The Gun Nut said the imprecise jumps, slowdown, and large numbers of enemies make the game frustratingly difficult.\nJeremy Parish and Sam Kennedy in their Contra retrospective for 1up.com wrote \"the gameplay was clunky and the graphics were drab compared to the crisp visuals of the 16-bit games\".\nReferences\nExternal links\n*"
    }
  ]
}