{
  "content": [
    {
      "type": "text",
      "text": "# Controversies surrounding the Islamic Revolutionary Guard Corps\n\nSince the establishment of Islamic Revolutionary Guard Corps (also known as Sepah or Pasdaran in Iran) the organization has been involved in economic and military activities, some of them controversial.\nHuman rights abuses\nThe IRGC has been known to regularly practice torture and various other human rights abuses in order to suppress internal dissent. In 1993, Ayatollah Khamenei appointed Naghdi as deputy director of intelligence of the Quds Force, a branch of the IRGC responsible for international operations. Naghdi and his team allegedly committed numerous acts of torture and abuse.\nCorruption\nIn 2005, the IRGC was discovered to be running an illegal airport near Karaj, close to Tehran, where they imported and exported goods with no  oversight. In 2004, the Pasdaran stormed the newly-built Imam Khomeini International Airport just after it had been officially opened and shut it down, ostensively for security reasons.  According to their critics, however, it was shut because the company hired to operate the airport was a \"Turkish competitor of a Pasdaran owned business\".\nOne Majlis member stated that IRGC black-market activities might account for $12 billion per year. Yet at the same time, IRGC and Basij forces have been commended for their positive role in fighting illegal smuggling—a further illustration of the institution’s multidimensional and frequently contradictory nature.\nInvolvement with Hezbollah\nThe IRGC's logo was inspiration for the logo of Hezbollah. The IRGC provided military training to Hezbollah fighters in the Bekaa Valley during the early eighties.\nAccording to Jane's Information Group: Any Hezbollah member receiving military training is likely to do so at the hands of IRGC [the Islamic Revolutionary Guards Corps], either in southern Lebanon or in camps in Iran. The increasingly sophisticated methods used by IRGC members indicates that they are trained using Israeli and US military manuals; the emphasis of this training is on the tactics of attrition, mobility, intelligence gathering and night-time manoeuvres.\nInvolvement with Hamas\nThe Islamic Revolutionary Guard Corps (IRGC) has supported Hamas, a Palestinian nationalist Islamist political and military organisation, through financial aid, military training, and provision of weapons. This support has included training in combat techniques, as well as supplying components for developing military technologies. The IRGC has maintained and, at times, intensified its assistance to bolster Hamas's military capabilities against Israel.\nIn 2009, the New York Times reported that Hamas fighters were possibly being trained in urban assault tactics by the IRGC. Connections between Iran and Hamas were strained in 2012 when Hamas supported factions opposing Bashar al-Assad in the Syrian civil war. However, in 2017, Hamas announced that it had resumed receiving financial support from Iran. Subsequently, the IRGC enhanced its military assistance to Hamas, providing training and components that enabled the group to develop its own drones and missiles for use against Israel.\nIn October 2023, The Wall Street Journal reported that in the weeks leading up to Hamas' October 7 attacks on Israel, approximately 500 militants from Hamas and Palestinian Islamic Jihad received specialized combat training in Iran. The training, conducted in September 2023, was led by officers of the Quds Force, IRGC's foreign-operations arm. High-level officials, including Quds Force commander Brigadier General Esmail Qaani, were present during the exercises.\nInvolvement with the Houthis\nAccording to Reuters, as of 2024, commanders from IRGC and Hezbollah are present in Yemen, assisting the Houthi movement in directing and overseeing attacks on Red Sea shipping. Iran has provided the Houthis with advanced drones, missiles, and intelligence support, enabling them to target vessels. This support is part of Iran's broader strategy to project its influence and disrupt maritime security in the region.\nAlleged involvement in the Iraq War\nThe United States Department of Defense has repeatedly asserted IRG involvement in the Iraq War against Iranian denials, though the U.S. has stopped short of saying the central government of Iran is responsible for the actions. In May 2008, Iraq said it had no evidence that Iran was supporting militants on Iraqi soil. According to a database compiled by the Multi-National Task Force's Iraq Task Force Troy, Iranian-made weapons accounted for only a negligible percentage of weapon caches found in Iraq. The U.S. charges come as Iran and Turkey have complained that U.S.-supplied guns are flowing from Iraq to anti-government militants on their soil.\nThe Department has reported that it has intelligence reports of heavy Islamic Revolutionary Guard involvement in Iraq in which the force is supplying Iraqi insurgents. It is further claimed that US soldiers have been killed by Iranian-made or designed explosive devices. This claim is disputed by Iran, saying that the bulk of American military deaths in Iraq are due to a Sunni insurgency and not a Shiite one. Two different studies have maintained that approximately half of all foreign insurgents entering Iraq come from Saudi Arabia. Iran further disputes that former Iraqi army personnel, whom, prior to the 2003 invasion, the US and UK claimed were capable of deploying advanced missile systems capable of launching WMDs within 45 minutes, would be incapable of designing and producing improvised explosive devices.\nThe U.S. charges of Iranian support come as Iran and Turkey have complained that U.S.-supplied guns are flowing from Iraq to anti-government militants on their soil. The Government Accountability Office (GAO), the investigative arm of the US Congress, said in a report that the Pentagon cannot account for 190,000 AK-47 rifles and pistols given to Iraqi security forces. Security analysts with the Center for Defense Information, along with one senior Pentagon official, suggested that some of the weapons have probably made their way in to the hands of Iraqi insurgents. Italian arms investigators also recently stopped Iraqi government officials from illegally shipping more than 100,000 Russian-made automatic weapons into Iraq. In November 2008, the U.S. State Department prepared to slap a multimillion-dollar fine on Blackwater (renamed to Academi since 2011) for shipping hundreds of automatic weapons to Iraq without the necessary permits. Some of the weapons were believed to have ended up on the country's black market.\nIn January 2007 the US army detained five Iranians in northern Iraq, claiming they were Quds operatives of the IRGC, providing military assistance to Shiite militias, without offering any further evidence that lends credibility to such claims. The Iranian and Iraqi governments maintain that they were diplomats working for the Iranian consulate in Iraqi Kurdistan. The \"IRGC cadres\" were released as a negotiated deal for British sailors under the auspices of General Suleimani.\nIn December 2009 evidence uncovered during an investigation by The Guardian and Guardian Films linked the Quds force to the kidnappings of 5 Britons from a government ministry building in Baghdad in 2007. Three of the hostages, Jason Creswell, Jason Swindlehurst and Alec Maclachlan, were killed. Alan Mcmenemy's body was never found but Peter Moore was released on 30 December 2009. The investigation uncovered evidence that Moore, 37, a computer expert from Lincoln was targeted because he was installing a system for the Iraqi government that would show how a vast amount of international aid was diverted to Iran's militia groups in Iraq. One of the alleged groups funded by the Quds Force directly is the Righteous League, which emerged in 2006 and has stayed largely in the shadows as a proxy of the al-Quds force. Shia cleric and leading figure of the Righteous League, Qais Khazali, was handed over by the US military for release by the Iraqi government on December 29, 2009 as part of the deal that led to the release of Moore.\nRole in Iranian politics\nAccording to the Telegraph, following Iran's threats to attack Israel after blaming it for the assassination of Ismail Haniyeh in July 2024, newly inaugurated Iranian president Masoud Pezeshkian clashed with the IRGC who pushed for a direct strike on Israeli cities including Tel Aviv, while he himself advocated for targeting Israeli bases in neighboring countries to avoid escalating into full-scale war. According to a presidential aide, the IRGC's push for aggressive action against Israel was primarily aimed at undermining President Pezeshkian's presidency, rather than addressing IRGC's humiliation from the assassination of Haniyeh, which may have been carried out by a pre-planted bomb in an IRGC-run guesthouse.\nLabeling by the United States as a \"terrorist organization\"\nOn October 25, 2007, the United States labeled the Islamic Revolutionary Guard Corps and the Ministry of Defense and Armed Forces Logistics (MODAFL) as \"terrorist organizations\" with the Kyl–Lieberman Amendment. The Iranian Parliament responded by approving a nonbinding resolution labeling the CIA and the U.S. Army \"terrorist organizations\". The resolution cited U.S. involvement in dropping nuclear bombs in Japan in World War II, using depleted uranium munitions in the Balkans, bombing and killing Iraqi civilians, and torturing terror suspects in prisons, among others.\nWhen Voice of America, the official external radio and television broadcasting service of the United States federal government, asked if the IRGC is supplying weapons to the Taliban, Mahmoud Ahmadinejad, then president of Iran, laughed and said the US did not want Iran to be friends with Afghanistan. \"What is the reason they are saying such things?\" asked Ahmadinejad.\nFinancial sanctions\nUN Security Council in several sanctions resolutions have voted in favour of freezing the assets of top Revolutionary Guard commanders.\nReferences\nFurther reading\n*  (discusses U.S. military clashes with Iranian Revolutionary Guard during the Iran–Iraq War)"
    }
  ]
}