{
  "content": [
    {
      "type": "text",
      "text": "# Context Is for Kings__disambig_2\n\n| story          =\n* Bryan Fuller\n* Gretchen J. Berg\n* Aaron Harberts\n| teleplay       =\n* Gretchen J. Berg\n* Aaron Harberts\n* Craig Sweeny\n| director       = Akiva Goldsman\n| photographer   =\n| editor         =\n| length         = 49 minutes\n| guests         = * Rekha Sharma as Ellen Landry\n| prev           = Battle at the Binary Stars\n| next           = The Butcher's Knife Cares Not for the Lamb's Cry\n| episode_list   = List of Star Trek: Discovery episodes\n| season_article = Star Trek: Discovery season 1\n}}\n\"Context Is for Kings\" is the third episode of the American television series Star Trek: Discovery, which is set roughly a decade before the events of the original Star Trek series and explores the war between the Federation and the Klingons. The episode was written by showrunners Gretchen J. Berg and Aaron Harberts, and Craig Sweeny, from a story by series co-creator Bryan Fuller, Berg, and Harberts. It was directed by producer Akiva Goldsman.\nSonequa Martin-Green stars as Michael Burnham, the first Starfleet mutineer who began the war. Series regulars Doug Jones, Anthony Rapp, Mary Wiseman, and Jason Isaacs also appear in the episode. The series' writers consider this episode to be the show's equivalent of a pilot, introducing the majority of its main cast, the titular starship Discovery, and the beginning of the season-long story. The episode reused the series' starship sets for both the Discovery and its sister ship Glenn.\n\"Context Is for Kings\" was released on CBS All Access on October 1, 2017. The episode's release was believed to have caused record subscriptions for All Access, and received mostly positive reviews from critics for the new status quo established after the prologue of the previous two episodes. The new cast additions were also praised, particularly Isaacs.\nPlot\nSix months after the start of the Federation–Klingon War of 2256, Michael Burnham, having been imprisoned for half a year, is on an unexpected prisoner transfer when an emergency forces her shuttle to be rescued by the USS Discovery. Spending several days on the ship, Burnham is ordered by its captain, the mysterious Gabriel Lorca, to assist with a scientific assignment. Burnham spends hours poring over complex computer code to find an error.\nShe overhears Lieutenant Paul Stamets, an astromycologist who is leading the assignment, discuss an upcoming experiment with a colleague serving on another starship; Lorca is soon informed of an incident on the Discoverys sister ship, the USS Glenn, that killed its crew. Stamets leads a boarding party, including Burnham, to investigate and finds the dead crew hideously twisted and malformed, as well as a group of Klingons who were killed by an unknown creature. When it attacks the boarding party, Burnham devises a plan to outwit the creature, allowing the rest of the party to escape to the shuttle.\nLorca later asks Burnham to work for him, despite her sentence, explaining that he organized the circumstances that led her to him, as he needs strong-minded people such as her to help him win the war. Burnham challenges him by saying she will not help him develop a weapon that goes against the Geneva Conventions. Lorca says he admires her and wants her on his team because she knows how to think for herself: \"Universal law is for lackeys; context is for kings\". He shows her that they are not working on a weapon but on a revolutionary propulsion method. After their conversation, Lorca talks to his chief of security, Commander Ellen Landry, to ensure his \"package\" is safely on board. Landry has secretly transported the creature aboard the Discovery.\nProduction\nDevelopment\nOn November 2, 2015, CBS announced a new Star Trek television series to premiere in January 2017, \"on the heels\" of the original series' 50th anniversary in 2016. In February 2016, Bryan Fuller was announced as the new series' showrunner, but was asked by CBS to step down at the end of October. Gretchen J. Berg and Aaron Harberts replaced him as showrunners. In September 2017, CBS revealed that the series' third episode would be titled \"Context Is for Kings\". It was directed by producer Akiva Goldsman.\nWriting\nThe teleplay for the episode was written by Berg, Harberts, and Craig Sweeny, based on a story by Fuller, Berg, and Harberts. The writers structured the season so that the first two episodes would act as a prologue, with the third episode beginning the series' actual story arc and being considered by them to be more equivalent to a traditional pilot than the show's first episode is. Actor Jason Isaacs noted that a series would not traditionally be able to use that structure, but that Discovery is able to do so because of its streaming format though CBS All Access. Harberts described the episode as one of \"secrets and mysteries\" and introducing a version of Starfleet that is at war. The episode also re-introduces protagonist Michael Burnham as resigned to her fate as a lifelong prisoner following her mutiny in the prologue. The story begins six months after the prologue, inspired by film sequels that begin with significant events having transpired since the previous installment such as Terminator 2: Judgment Day.\nBurnham's character arc for the episode takes her from not caring about her fate, to being willing to sign up for something new as part of the Discoverys mission. The writers were interested in exploring Burnham's upbringing as the foster child of Amanda Grayson and Sarek, exploring how the human Grayson would have wanted to counter some of Burnham's \"logical\" Vulcan teachings, and similarly would have wanted to expand the views of her son Spock by teaching him that \"logic doesn't dictate everything\". This led to the introduction of Lewis Carroll's ''Alice's Adventures in Wonderland'' as a book that Grayson read to them as children and which Burnham now carries with her as a talisman to \"center herself\". The book also thematically connected to the series with its use of mushrooms, tying into the series' scientific exploration of fungi and spores. Grayson's interest in the works of Lewis Carroll and Spock's awareness of ''Alice's Adventures in Wonderland were both previously established in the Star Trek: The Animated Series episode \"Once Upon a Planet\".\nIt was also important to the writers to justify the presence of Cadet Sylvia Tilly, whose optimistic outlook is at odds with the rest of the crew of the Discovery'' and the tone of the series, by having her prove herself during the character's first away mission. This came in the moment where Tilly spots, and calls out, a Klingon on the derelict starship Glenn, showing the character to be as capable as the other characters. The monstrous creature introduced on the Glenn was described by Harberts as \"vital\" to the series, stating that it would be reappearing in future episodes, and that it would serve as a metaphor for Burnham and her character journey in the show.\nCasting\nThe series stars Sonequa Martin-Green as Burnham, Doug Jones as Saru, Shazad Latif as Ash Tyler, Anthony Rapp as Paul Stamets, Mary Wiseman as Tilly, and Isaacs as Gabriel Lorca; Latif does not appear in this episode.\nAdditionally, guest star Rekha Sharma was cast as Discoverys security officer Commander Landry at the end of April 2017. The creature introduced in the episode, referred to as a \"tardigrade\" after the real-life micro-animal of the same name, is portrayed in-part by a puppet. It was originally intended to be a full-time member of the Discoverys crew, named Ephraim for the zoologist Johann August Ephraim Goeze who discovered the real species. However, this was deemed to be impractical.\nFilming and design\nFilming for scenes set on the Glenn took place on the sets previously used for USS Shenzhou in the prologue episodes. Changes made to the sets for filming in this episode include the adding of \"scratched walls, flickering lights, dangling wires, busted doors\". The set was decorated with blood and ten corpses, including an actor in Klingon prosthetics portraying a dead member of that species. Another Klingon actor was connected to a pulley system with a special harness and pulled out of shot, to simulate being dragged away by the creature, something that was filmed multiple times to get \"just right\". To film the following chase sequence, the actors were followed through the set by a cameraman on a Segway. Those same sets were later redressed to portray the Discovery. The shuttle bay of the Discovery is completely computer-generated, and is the most expensive set in the series due to the visual effects requirements.\nGoldsman felt that each episode of the series has its \"own tonal components that are driven by script\", and that this episode is \"mysterious and threatening because I felt Burnham’s circumstance was mysterious and threatening\". Goldsman embraced this tone, and incorporated elements of the horror genre. He noted that the producers generally wanted the series to be watchable for families, but they also had the freedom to push boundaries with the streaming format of the series, and so some of the horror elements included in the episode would not be appropriate for young children, such as the corpses of the Glenns crew, which were described as \"swirled up bodies\" and were designed in Adobe Photoshop. They attempted to indicate this to parents who may be showing the series to children by giving it a \"TV-MA\" rating, even though the majority of the episode, and the series as a whole, was not intended to require that higher rating.\nLorca is first introduced eating fortune cookies, part of his family backstory and one of the comforts that he is allowed in his ready room. Isaacs had to eat hundreds of fortune cookies in the course of filming the scene, and said he did not want to repeat that experience. Isaacs did note the symbolism of Lorca wanting Burnham to read her fortune, \"but she doesn't want to do it. The point is that she's gonna create her own fortune by making the right decision by the end of the episode.\" Saru offering blueberries to Burnham in the episode was a tribute to Fuller who \"would walk through the offices of Star Trek, and he would offer you a blueberry.\"\nRelease\n\"Context Is for Kings\" was made available on CBS All Access on October 1, 2017. In Canada, it was broadcast on the specialty channels Space (English) and Z (French), before being streamed on CraveTV. In 188 other countries, the episode was released on Netflix within 24 hours of its U.S. debut.\nReception\nRatings and viewership\nThe release of the episode led to a record week of subscriptions to All Access, besting the previous record week established by the series' premiere the week before.\nCritical response\nThe review aggregator website Rotten Tomatoes reported a 92% approval rating with an average rating of 8.74/10 based on 25 reviews. The website's critical consensus reads, \"'Context Is for Kings' is a successful soft reboot—with its namesake ship and new captain setting the series on a new, more confident course.\"\nJames Hunt of Den of Geek said, \"If this is the quality of an average episode then I’m super-happy with the way this show is turning out.\" He highlighted the introduction of the Discovery, and its difference from previous Star Trek starships, as well as Isaac's \"subtlety\" in portraying Lorca. He did criticize some of the dialogue and its use of exposition, but ended by saying, \"What I like most about this show is that it hasn’t forgotten to inject moments of curiosity, wonder and philosophy into the story—and that makes it enough like Star Trek that I can cope with any other changes.\" Megan Davies at Digital Spy called the episode \"the pilot Star Trek: Discovery should have had all along.\" She noted the expanded cast to support Martin-Green's lead performance, particularly the promoted Saru and introduced Stamets. Davies also noted that the episode \"has fun with its genre. Here Star Trek plays with the makings of a mystery [and] nowhere does it excel more than when it devotes itself to pure, thrilling horror as it does during the boarding of the USS Glenn.\"\nFor IGN, Scott Collura scored the episode a \"great\" 8.4 out of 10, feeling that the wait for the introduction of the Discovery and its crew was worth it. Collura liked Lorca, felt Tilly was \"a ton of fun\", and called Saru \"a highlight of the show\". Alan Sepinwall, writing for Uproxx, felt the shift from the prologue for the episode was \"jarring, and raises the question of why two episodes needed to be devoted to setting it up.\" However, he was positive about the greater focus on the Starfleet characters, including the \"quiet, suspicious version\" of Burnham, as well as the featured science. Sepinwall concluded, \"I wasn’t sure I wanted to spend a lot of time watching the show Discovery was in its first two hours, despite liking several performances and a lot of the production choices. The show it seems to be now is one I’m much more enthusiastic about.\" Zack Handlen of The A.V. Club graded the episode an 'A−', calling the change from the prologue disorienting, but feeling that the different nature of the Discovery and its crew was well established. Handlen particularly noted the action scene where Burnham quotes from ''Alice's Adventures in Wonderland, finding it \"utterly unexpected, and it hooked me good.\"\nReviewing for The New York Times'', Sopan Deb found the episode to be convoluted and gloomy, and felt that many of the characters, especially Burnham, did not work because the audience had not been given time to become affectionate toward them before they started making bold actions. Deb did say, \"Whatever it is, it isn't boring. It has action and strong casting\", specifically highlighting Isaacs as Lorca and Goldsman's direction of the horror scenes.\nIn 2020, ScreenRant noted that this episode had a ranking of 7.7 on IMDb based on user rankings, placing it as the tenth best episode of Star Trek: Discovery including season one and two. In 2020, Den of Geek ranked this episode the 18th most scary episode of all Star Trek series up to that time.\nReferences\n}}\nFurther reading\n*\nExternal links\n*"
    }
  ]
}