{
  "content": [
    {
      "type": "text",
      "text": "# Contempt toward officials\n\nContempt towards officials is addressed in the Punitive articles, specifically Article 88 of the U.S. Uniform Code of Military Justice in the Manual for Courts-Martial (MCM), United States (2008 Edition) as follows:\nElements\n#That the accused was a commissioned officer of the United States armed forces;\n#That the accused used certain words against an official or legislature named in the article;\n#That by an act of the accused these words came to the knowledge of a person other than the accused; and\n#That the words used were contemptuous, either in themselves or by virtue of the circumstances under which they were used. (Note: If the words were against a Governor or legislature, add the following element:)\n#That the accused was then present in the State, Territory, Commonwealth, or possession of the Governor or legislature concerned.\nExplanation\nThe official or legislature against whom the words are used must be occupying one of the offices or be one of the legislatures named in Article 88 at the time of the offense. Neither \"Congress\" nor \"legislature\" includes its members individually; \"Governor\" does not include \"lieutenant governor\". It is immaterial whether the words used against the official or legislature are used in an official or private capacity. If not personally contemptuous, adverse criticism of one of the officials or legislatures named in the article in the course of a political discussion, even if emphatically expressed, may not be charged as a violation of the article.\nSimilarly, expressions of opinion made in a purely private conversation should not ordinarily be charged. Giving broad circulation to a written publication containing contemptuous words of the kind made punishable by this article, or the utterance of contemptuous words of this kind in the presence of military subordinates, aggravates the offense. Unlike civilian legislation covering defamation, the truth or falsity of the statements is immaterial.\nLesser included offense\nArticle 80—Attempts\nMaximum punishment\nDismissal, forfeiture of all pay and allowances, and confinement for one year.\nSources\nThis article incorporates text from [https://www.loc.gov/rr/frd/Military_Law/pdf/MCM-2008.pdf Manual for Courts-Martial], a public domain work of the United States Government."
    }
  ]
}