{
  "content": [
    {
      "type": "text",
      "text": "# Convention for the Safeguarding of the Intangible Cultural Heritage\n\nThe Convention for the Safeguarding of the Intangible Cultural Heritage is a UNESCO treaty adopted by the UNESCO General Conference on 17 October 2003.\nThe convention entered into force in 2006, after thirty instruments of ratification by UNESCO Member States. Romania was the 30th state, ratifying the agreement on 20 January 2006. As of October 2022, 180 states have ratified, approved or accepted the convention.\nContent\nLayout\nThe convention contains the following provisions:\nPurposes\nUnlike other UNESCO conventions, this convention begins with stating its purposes, which are;\nDefinition\nIntangible cultural heritage refers to \"traditions or living expressions inherited from our ancestors and passed on to our descendants, such as oral traditions, performing arts, social practices, rituals, festive events, knowledge and practices concerning nature and the universe or the knowledge and skills to produce traditional crafts\". The convention defines it as follows:\nFunction\nThe convention works on both national and international levels.\nAt the national level, state parties are supposed to \"take necessary measures to ensure the safeguarding of the intangible cultural heritage present in its territory\". These measures include identification of the intangible cultural heritage that exists in its territory, adoption of appropriate policies, promotion of education and so on. Besides, in taking these measures, each state parties must \"endeavor to ensure the widest possible participation of communities, groups, and, where appropriate, individuals that create, maintain and transmit such heritage, and to involve them actively in its management\".\nAt the international level, this convention promotes cooperation, which includes \"the exchange of information and experience, joint initiatives, and the establishment of a mechanism of assistance\" to other state parties.\nLists\nThe Committee to the Convention publishes and keeps up to date two lists of intangible cultural heritage: the Representative List of the Intangible Cultural Heritage of Humanity and the List of Intangible Cultural Heritage in Need of Urgent Safeguarding.\nIntangible Cultural Heritage Fund\nThe convention establishes the Intangible Cultural Heritage Fund, the use of which is decided by the committee. The fund mainly consists of the contributions by state parties and funds by the General Conference of UNESCO.\nHistory\nPrecursors\nOne of the first international occasions that mentioned the preservation of 'intangible heritage' was the World Conference on Cultural Policies in Mexico City in 1982. This Conference defined cultural heritage as including \"both tangible and intangible works through which the creativity of people finds expression\", and asked UNESCO and member states to take measures for protecting this kind of heritage.\nIn 1989, UNESCO adopted the Recommendation on the Safeguarding of Traditional Culture and Folklore as the first legal instrument towards the safeguarding of intangible cultural heritage. This recommendation reflected the ideas of the earlier conference in Mexico City. UNESCO conducted some promotional programs for raising awareness of this recommendation, but was not very successful. However, in the late 1990s, there was a conference held for the assessment of this recommendation, which pointed out some problems to be considered in drafting the convention.\nIn 1997, UNESCO launched the program of Proclamation of the Masterpieces of the Oral and Intangible Heritage of Humanity, intending to raise awareness of the importance of intangible heritage. This program proclaimed a total of 90 masterpieces between 2001 and 2005, and caused the movement toward the convention.\nCreation\nA preliminary study was undertaken to establish how intangible cultural heritage could be safeguarded.In 2001, the General Conference adopted the Universal Declaration on Cultural Diversity, which also includes articles dealing with the preservation of \"heritage in all forms\". This declaration and its action plan provided the basis for the convention.\nAfter two years of meetings, the draft convention was brought to the General Conference and adopted in 2003.\nRecent members\nOn November 6, 2020, Somalia and Angola were 179th and 180th nations that joined the 2003 Convention for the Safeguarding of the Intangible Cultural Heritage.\nReception\nThe definition of intangible cultural heritage has been criticized as potentially incomplete and/or creating a \"Pandora's box of difficulties\". For example, in a 2004 article in Museum International, Richard Kurin says that because the convention does not recognize cultural activities not compatible with international human rights instruments, some activities, such as female genital mutilation, that groups may themselves consider critical to their culture, are not eligible. Similarly, Kurin notes that since many groups' culture is defined in opposition to other cultures, the requirement for \"mutual respect\" may leave out traditional songs and stories that glorify \"empire, victorious kings, religious conversion, or alternatively resistance to perceived injustice, martyrdom and defeat\". However, Kurin also notes that the definition can be more expansive than intended by its designers, who originally planned only to protect \"traditional cultural activities\". He says that it is robust enough to encompass more modern forms of culture, including things like \"rap music, Australian cricket, modern dance, post-modernist architectural knowledge, and karaoke bars\".\nRichard Kurin has argued that dividing culture into individual units is inconsistent with modern academic views of cultures. Additionally, Michael Brown has argued that convention's focus on cataloging is based on an outdated belief that listing the details of a culture has some connection to preservation of that culture. States are also encouraged to enact programs to safeguard intangible cultural heritages, though any such work must be done in cooperation with the local practitioners. This aspect has also been criticized, since it is unclear how a state can safeguard a cultural practice by force, particularly if there is insufficient interest from local practitioners.\nSee also\n* UNESCO Intangible Cultural Heritage Lists\nReferences\nExternal links\n*[https://ich.unesco.org/index.php?lg=EN&pg=home Official website of the Convention for the Safeguarding of the Intangible Cultural Heritage]\n*[https://ich.unesco.org/en/convention Text of the Convention for the Safeguarding of the Intangible Cultural Heritage]\n*[https://ich.unesco.org/en/directives Operational Directives for the implementation of the Convention for the Safeguarding of the Intangible Heritage]\n*[http://portal.unesco.org/en/ev.php-URL_ID=13141&URL_DO=DO_TOPIC&URL_SECTION=201.html Recommendation on the Safeguarding of Traditional Culture and Folklore]"
    }
  ]
}