{
  "content": [
    {
      "type": "text",
      "text": "# Copper mining in the Democratic Republic of the Congo\n\nCopper mining in the Democratic Republic of the Congo (French: Extraction du cuivre en République démocratique du Congo) mainly takes place in the Copper Belt of the southern Katanga Province of the Democratic Republic of the Congo.\nNot all copper deposits contain significant cobalt, but nearly all cobalt in the country is sourced from copper deposits. The DRC produces about 63% of the world's cobalt, with about 80% from industrial copper mines, and the remaining 20% gathered by artisanal mining.\nGeology\nThe Katanga, or Shaba, copperbelt in the DRC is a belt about  wide and  long between Lubumbashi and Kolwezi formed in rocks of the Katanga Supergroup. There are at least 72 economic deposits of copper/cobalt (estimated more than 200) and four large mining centers. Taken together, the DRC and Zambian copper belts are the second largest global reserve of copper, about 1/3 the size of the Chilean reserve.\nThe DRC copper belt includes some of the highest-grade copper deposits in the world. In some reserves the grades are above 5%. The ore also has high grades of cobalt and may hold 34% of the world's cobalt reserves. There are large deposits that have yet to be explored using modern technology, so the size of the reserves may be understated. Demand is growing, led by China.\nHistory\nPrehistoric mines in the Katanga belt have been found at Dikuluwe near Musonoi, Tenke-Fungurume, Kambove, Luishia, Ruashi and Etoile, and at the Naviundo and Luano archaeological sites.  Monseigneur de Hemptinne watched Yeke people working at Dikuluwe as late as 1924. They worked in the dry season and stopped when the first rains arrived. The mining camp was near a stream where millet could be planted.  Women and children collected malachite from the surface, while men used iron picks to excavate pits and shafts, using fire to crack the rocks when needed. The mines were between  and  deep with galleries up to  long. The ore would be sorted and then taken to a nearby stream for concentration before being smelted.\nCommercial mining began in the 1920s, with a forcibly recruited workforce. The Union Minière constantly struggled to prevent recruits fleeing from the mines, sometimes taking refuge in Angola. Workers were mistreated and suffered badly from disease brought on by the working conditions.  The lowest death rate at the Panda, Lubumbashi, Kisanga and Musonoi work sites in 1928 was four men per month. Today, mine worker exploitation is still prevalent and instances of slave labor, and especially child labor, are still observed in the mining industry according to the 2014 U.S. Department of Labor's List of Goods Produced by Child Labor or Forced Labor.\nBetween 1970 and 1988 copper metal production was roughly constant at between 400,000 and 500,000 tonnes. Production then dropped steeply to under 50,000 tonnes annually between 1992 and 2001. Since then, production has steadily grown, reaching about 300,000 tonnes in 2008.\nIn 2005, proceeds from an oil sale to Glencore, an Anglo–Swiss multinational commodity trading and mining company, were seized as fraudulent gains as part of an investigation into corruption in the country (Allen-Mills 17 June 2008). In the course of the Congo events, Nikanor was merged into Katanga in late 2007 in a transaction valued at US$3.3&nbsp;billion.\nThe government of the DRC began to review about 60 mining contracts in 2008, and started to release their findings to the mining companies in February 2008.\nFor example, TEAL, a subsidiary of African Rainbow Minerals, was asked by letter to submit their feasibility study for their Kalumines property to identify the real contribution of each of the parties \"in order to achieve a fair attribution of shares\". The letter said the feasibility study should present a planning of \"realisation of social actions with a visible impact\". It also said that the state-owned Gécamines should actively participate in the daily management of the operation.\nIn August 2009, the DRC government revoked First Quantum Minerals' (FQM) license to operate the Kolwezi tailings project, alleging \"unreasonable behaviour\" in negotiations to change the contract.\nFirst Quantum had spent $750 million on acquiring and developing the property. First Quantum took out an action against the DRC government in the International Chamber of Commerce Court of Arbitration.\nIn May 2010 a Congolese court ruled that FQM's Lonshi and Frontier copper mines had been awarded illegally and that they should revert to state-owned Sodimico.\nAccording to FQM the ruling was due to FQM's decision to contest the expropriation of their Kolwezi project, which was later sold to the Kazakh mining company Eurasian Natural Resources Corporation.\nCompanies\nThe largest shareholders in most copper mines in the DRC are foreign corporations, with the Congolese state-owned Gécamines holding a minority stake in most projects. In recent years, many Chinese companies have become major holders in various copper mines in the DRC.\nChina Nonferrous Metal Mining Group\nChina Nonferrous Metal Mining Group (CNMC) is the majority owner of the Deziwa mine and Ecaille C mine.\nChina Railway\nChina Railway, or its subsidiary, China Overseas Engineering Group, is a partner in the Luishia mine, the Kalumbwe Myunga mine, and the Sicomines venture at Dikuluwe Mine and Mashamba West.\nCMOC Group Limited\nCMOC Group Limited, formerly known as China Molybdenum, entered the DRC in 2016 with the purchase of the Tenke Fungurume Mine. It also purchased the Kisanfu mine which is under construction. Both mines were formerly held by Freeport-McMoRan.\nGécamines\nGécamines (La Générale des Carrières et des Mines), is a state-owned mining company in the DRC. Its principal products are copper (which often accounted for 50% of export earnings), cobalt and zinc.\nCopper mines in which Gécamines has a major interest include Kambove, Kipushi and Kolwezi. Gécamines also owns a copper smelter at Lubumbashi and a hydrometallurgical plant at Shituru.\nThe Industrial Development and Mining Corporation of Zaire (Société de développement industriel et minier du Zaire - SODIMIZA)\nis an operating company for copper and its derivatives in Katanga. The company also operates cobalt and zinc. It was created in 1967 and acquired by Gécamines in 1987.\nThe Kababankola Mining Company (KMC) is a joint-venture between Gécamines (20%) and Tremalt (80%) with the objective of exploiting Copper and cobalt.\nGlencore\nThe Swiss company Glencore owns a number of large copper mines, particularly after acquiring Katanga Mining as a wholly owned subsidiary. Currently, Glencore owns majority stakes in Kamoto Copper Company SARL (KCC) and DRC Copper and Cobalt Project SARL (DCC), which run several copper/cobalt mines, as well as a Mutanda Mining SARL, which runs the Mutanda Mine.\nKatanga Mining produces copper and cobalt at the Kamoto Mine, which also includes the Kamoto concentrator, the Luilu metallurgical plant, the Kamoto underground mine and two oxide open pit resources in the Kolwezi district.\nA joint venture of Katanga Mining (75%) and Gécamines (25%) began mining Tilwezembe, an open-pit copper and cobalt mine, in 2007.\nAs of 2011 Katanga Mining was 74.8% owned by Glencore.\nJinchuan Group\nMetorex, based in Johannesburg, South Africa, has assets in the DRC that include the existing Kinsenda Mine, the new Ruashi copper and cobalt mine, and the Dilala East and Lubembe deposit greenfields sites.\nCopper Resources Corporation is a subsidiary of Meterox.\nAs of November 2011 it held a 92.5% interest in the Hinoba-an Porphyry Copper project in the Philippines,\nand a 75% interest in Miniere de Musoshi et Kinsenda (MMK).\nMMK in turn owns the flooded Kinsenda and Musoshi copper mines in Katanga. MMK was formerly a subsidiary of Forrest Group. As of 30 November 2005 it became a subsidiary of Copper Resources Corporation.\nMMK also holds the Lubembe high-grade deposit.\nJinchuan Group acquired Metorex in 2012, making it a fully owned subsidiary.\nZhejiang Huayou Cobalt\nZhejiang Huayou Cobalt holds stakes in the Luiswishi mine and Kolwezi copper mine.\nOther\nAfrimines Resources SPRL, based in Democratic Republic of the Congo, owns various mining resources.\nIn May 2008 Tiger Resources announced that it had secured the rights to explore several new and highly prospective tenements in Katanga in partnership with Afrimines Resources and Katanga Minerals Holdings.\nThe Eurasian Natural Resources Corporation (ENRC) has a significant presence, particularly with the Mukondo Mine asset, since its takeover of the Central African Mining and Exploration Company (CAMEX).\nMines\nCopper mines in the Democratic Republic of the Congo are concentrated in the Copperbelt, in the provinces of Haut-Katanga and Lualaba, both part of the historical province of Katanga until 2015. The ownership of most mines is structured as a joint venture split between a foreign company and the DRC state-controlled miners Gécamines and Sodimico. Mines currently active in green, mines soon opening in blue, mines suspended in red.\n{|class=\"wikitable sortable\"\n! style=\"width:12em;\"|Name !!style=\"width:14em;\"| Territory !! style=\"width:14em;\"| Coordinates !! style=\"width:18em;\"| Ownership !! Annual capacity\n|-\n| Deziwa mine\n| Mutshatsha-Kolwezi\n|\n| Société Minière Deziwa (Somidez)\n* China Nonferrous Metal Mining Group (51%)\n* Gécamines (49%)\n| style=\"background: PaleGreen;\"|83,502 copper tonnes (2023)\n|-\n| Dikuluwe Mine\n| Mutshatsha-Kolwezi\n|\n| Sino-Congolaises des Mines (Sicomines)\n*Chinese consortium (68%)\n*Gécamines (32%)\n| style=\"background: PaleGreen;\"|Copper: 206,612 tonnes (concentrate)Cobalt: 5,951 tonnes (concentrate) (2023)\n|-\n|Kalakundi Mine\n|Mutshatasha-Kolwezi\n|\n| Swanmines\n*Eurasian Resources Group (75%)\n*Gécamines (25%)\n|\n|-\n| Kalumbwe Myunga mine\n|Mutshatasha-Kolwezi\n|\n|Minière de Kalumbwe Myunga (MKM)\n*China Railway Group\n|\n|-\n|Kamoa-Kakula mine\n|Mutshatasha-Kolwezi\n|\n| Kamoa Copper\n*Ivanhoe Mines (39.6%)\n*Zijin Mining (39.6%)\n*Congolese state (20%)\n| style=\"background: PaleGreen;\"|400,000 tonnes copper in concentrate (2023)\n|-\n|Kamoto Mine\n|Mutshatasha-Kolwezi\n|\n| Kamoto Copper Company (KCC)\n*Glencore (75%)\n*Gécamines (25%)\n| style=\"background: PaleGreen;\"|46,000 tonnes copper and 4,000 tonnes cobalt (2008).\n|-\n|Kananga Mine\n|Mutshatasha-Kolwezi\n|\n|DRC Copper and Cobalt Project SARL\n*Glencore (75%)\n*Gécamines (25%)\n| style=\"background: Pink;\"| Suspended\n|-\n| Kisanfu mine\n|Mutshatasha-Kolwezi\n|\n| China Molybdenum (71.25%)CATL (23.75%)DRC government (5%)\n| style=\"background: PaleGreen;\"|Production started 2023, copper output undisclosed\n|-\n| Kolwezi copper mine\n|Mutshatasha-Kolwezi\n|\n| Compagnie Minière de Musonoï (COMMUS)\n*Zhejiang Huayou Cobalt (72%)\n*Gécamines (28%)\n|style=\"background: PaleGreen;\"|Active\n|-\n| Kolwezi tailings project\n|Mutshatasha-Kolwezi\n|\n| Compagnie de Traitement des Rejets de Kingamyambo (Metalkol)\n*Eurasian Resources Group (95%)\n*Gécamines (5%)\n| style=\"background: PaleGreen;\"|94,807 tonnes copper (2021)\n|-\n|KOV mine\n|Mutshatasha-Kolwezi\n|\n|Kamoto Copper Company (KCC)\n*Glencore (75%)\n*Gécamines (25%)\n|  style=\"background: PaleGreen;\"| ?\n|-\n|Mashamba East\n|Mutshatasha-Kolwezi\n|\n| Kamoto Copper Company (KCC)\n*Glencore (75%)\n*Gécamines (25%)\n| style=\"background: PaleGreen;\"| ?\n|-\n| Musonoi mine\n|Mutshatasha-Kolwezi\n|\n|Ruashi Mining\n*Metorex (Jinchuan Group) (75%)\n*Gécamines (25%)\n|style=\"background: LightBlue;\"| Planned opening in 2023.\n|-\n| Mutanda Mine\n|Mutshatasha-Kolwezi\n|\n| Mutanda Mining (MUMI)\n*Glencore (100%)\n| style=\"background: PaleGreen;\"|Restarted operations in late 2021\n|-\n|Mutoshi Mine\n|Mutshatasha-Kolwezi\n|\n| Chemaf (Shalina Resources)\n| style=\"background: LightBlue;\"|Suspended since 2020, planned reopening in 2023.\n|-\n|Shabara mine\n|Mutshatasha-Kolwezi\n|\n|Artisanal mining (de facto)\n|\n|-\n|Tilwezembe\n|Mutshatasha-Kolwezi\n|\n| DRC Copper and Cobalt Project SARL\n*Glencore (75%)\n*Gécamines (25%)\n| style=\"background: Pink;\"|Suspended since 2008.\n|-\n|Kabolela Mine\n|Lubudi\n|\n|\n| style=\"background: Pink;\"|Abandoned: Worked for cobalt during the 1930s\n|-\n|Kakanda deposit\n|Lubudi\n|\n| Boss Mining\n*Eurasian Resources Group (51%)\n*Gécamines (49%)\n| style=\"background: Pink;\"|Abandoned.\n|-\n|Mukondo Mine\n|Lubudi\n|\n| Boss Mining\n*Eurasian Resources Group (51%)\n*Gécamines (49%)\n|style=\"background: Pink;\"|Suspended since 2019\n|-\n|Tenke Fungurume mine\n|Lubudi\n|\n| Tenke Fungurume Mining (TFM)\n*China Molybdenum (80%)\n*Gécamines (20%)\n| style=\"background: PaleGreen;\"|209,120 tonnes copper and 18,501 tonnes cobalt (2021)\n|-\n|Kamatanda\n|Kambove\n|\n|Gécamines\n|\n|-\n|Kamfundwa Mine\n|Kambove\n|\n| Gécamines\n| 400,000 tonnes copper in ore and 48,000 tonnes cobalt in ore (2008).\n|-\n|Kamoya Central\n|Kambove\n|\n| Gécamines\n|79,000 tonnes copper in ore and 7,000 tonnes cobalt in ore (2008).\n|-\n|Kamoya South\n|Kambove\n|\n| Gécamines\n|36,000 tonnes copper in ore and 11,000 tonnes cobalt in ore (2008).\n|-\n| Kipoi Mine\n| Kambove\n|\n| ''Société d'Exploitation de Kipoi (SEK)\n* Tiger Resources (95%)\n* Gécamines (5%)\n| style=\"background: Pink;\"|Suspended since April 2020 due to the impact of COVID-19, no production since then.\n|-\n|Luishia mine\n|Kambove\n|\n| Compagnie Minière de Luisha (COMILU)\n*China Railway Group (72%)\n*Gécamines (28%)\n|\n|-\n|Luisha south\n|Kambove\n|\n| Luisha Mining Enterprises (LME)\n*Excellen Minerals SARL\n|\n|-\n|Lupoto Mine\n|Kambove\n|\n| SASE Mining SARL''\n*Tiger Resources (95%)\n*DRC government (5%)\n|style=\"background: LightBlue;\"|Prospect\n|-\n|M'sesa Mine\n|Kambove\n|\n|\n| style=\"background: Pink;\" |Abandoned during the 1970s\n|-\n|Mabende Mine\n|Kambove\n|\n|CNMC Huachin Mabende Mining\n*China Nonferrous Metal Mining Group\n| style=\"background: PaleGreen;\"|Actively producing; ~36,842 tonnes of copper cathodes in 2023\n|-\n|Shangolowe |||Kambove\n|  || Gécamines || N/A\n|-\n|Shituru\n|Kambove\n|\n|Shituru Mining Corporation\n*Pengxin Mining Holdings (majority)\n*Gécamines (minority)\n| style=\"background: PaleGreen;\"|Actively producing; exported ~32,755 tonnes of LME-grade cathode copper in 2023\n|-\n|Kalumines\n|Kipushi\n|\n| Gecamines\n| 10,000 tonnes copper (2008).\n|-\n| Kinsevere\n| Kipushi\n|\n| Société Minière de Kinsevere\n* MMG Limited\n| style=\"background: PaleGreen;\"|Actively producing; 2025 copper cathode production guidance is 63,000–69,000 tonnes.\n|-\n|Kipushi Mine\n|Kipushi\n|\n|Kipushi Corporation (KICO)\n*Ivanhoe Mines (68%)\n*Gécamines (32%)\n| style=\"background: PaleGreen;\"|Production resumed in 2022 after a period of suspension; expected to produce copper in 2025\n|-\n|Luiswishi mine\n|Kipushi\n|\n|Congo Dongfang International Mining (CDM)\n*Zhejiang Huayou Cobalt\n| style=\"background: PaleGreen;\"|Actively producing; ~12,000 tonnes of copper and 4,000 tonnes of cobalt annually\n|-\n|Musoshi Mine\n|Kipushi\n|\n| Société de développement industriel et minier du Congo (SODIMICO)\n| style=\"background: Pink;\"|Suspended\n|-\n| Etoile Mine\n| Lubumbashi\n|\n| Chemaf (Shalina Resources)\n| style=\"background: PaleGreen;\"|Copper: 25,000 tonnes; Cobalt: 4,000 tonnes (2023)\n|-\n|Ruashi Mine\n|Lubumbashi\n|\n| Ruashi Mining\n*Metorex (Jinchuan Group) (75%)\n*Gécamines (25%)\n| style=\"background: PaleGreen;\"|10,000 tonnes copper and 1,000 tonnes of Cobalt (2008).\n|-\n| Frontier Mine\n|Sakania\n|\n| Eurasian Resources Group\n| style=\"background: PaleGreen;\"|83,560 tonnes copper (2021)\n|-\n| Kinsenda Mine\n|Sakania\n|\n| Kinsenda Copper Company (KCC)\n*Metorex (Jinchuan Group) (77%)\n*Sodimico (23%)\n| style=\"background: PaleGreen;\"|Copper: 30,219 tonnes (2023)\n|-\n| Lonshi Mine\n| Sakania\n|\n| Sabwe Mining\n* JCHX Mining Management\n| style=\"background: PaleGreen;\"|Production resumed in September 2023; West Zone operational with projected 40,000 tonnes of copper annually. East Zone under development with planned output of 60,000 tonnes/year.\n|-\n| Dikulushi Mine\n| Pweto\n|\n| Everbright Mining\n* JCHX Mining Management\n| style=\"background: PaleGreen;\"|Produced 8,000 tonnes of copper concentrate in 2023\n|-\n|Kapulo mine\n| Pweto\n|\n|\n|\n|}\nSee also\n* Copper mining in Chile\n* Mining industry of the Democratic Republic of the Congo\n* Chalcopyrite, copper ore\n* Heterogenite, high-grade cobalt ore\nReferences\n}}\nSources\n*\n*\n*\nExternal links\n*"
    }
  ]
}