{
  "content": [
    {
      "type": "text",
      "text": "# Cora Kelley Ward\n\n| death_place   =\n| known_for     = Painting, Photography\n| training      = Newcomb–Tulane College, Hunter College, Black Mountain College\n| movement      = Abstract Expressionism\n| notable_works =\n| patrons       =\n| awards        =\n| website       =\n}}\nCora Kelley Ward (1920–1989) was born in Eunice, Louisiana and lived through the New York City art movements of the 1960s to the 1980s, such as the Color Field Movement. Ward studied painting at the Newcomb Art School at Tulane University and later earned a Master of Arts degree from Hunter College in New York City. Ward is known for her work in Abstract Expressionism and her meticulous picture-taking of the New York art scene from the 1950s to the 1980s.\nWorks\nShe studied under Josef Albers and Clement Greenberg, who became a lifelong friend to Ward. At Black Mountain College she learned the concepts of Modernism \"through the teachings of European artists who taught at BMC and other schools when they fled Hitler's 'purification' of German culture\". In 1955 she moved to New York City and settled in Greenwich Village and continued to pursue her art. \"Ward's work was based on the second generation of Abstract Expressionism, ideologies which explored art at its most elemental core.\" She worked on solutions to self-imposed challenges, amassing a large body of work. Ward is most remembered as a photographer by her contemporaries and fellow artists from this period. The shy Ward would attend events, camera in hand, where she captured the interaction and excitement of the contemporary art world. In the exhibition held after her death in 1989, her longtime friend Clement Greenberg wrote in the catalog, “Cora was a dear and selfless friend. But I can confidently say that that doesn't sway me. It's only with these paintings of the eighties that I am able to hail her art without reservation. That makes me glad – regretfully so because she’s not here to read what I write.” Ward completed many works in her lifetime, but unfortunately she only began to be recognized near the end of her life. Her family was left with a huge number of paintings and no one to take them, so they ended up being donated to various museums and institutions, and later on, anyone that would take them. A large part of her estate, around a thousand paintings, was given as a gift to the Paul and Lulu Hilliard University Art Museum of Louisiana by the heirs of the state.  Ward died of what is believed to be cancer at age 69.\nReferences\nExternal links\n* [http://theadvocate.com/utility/homepagestories/3140977-129/a-work-in-progress A Work in Progress | The Advocate — Baton Rouge, LA]\n* [https://web.archive.org/web/20151031134409/http://museum.louisiana.edu/news/Cora-Kelley-Ward-A-Work-in-Progress Cora Kelley Ward: A Work in Progress – News]"
    }
  ]
}