{
  "content": [
    {
      "type": "text",
      "text": "# Cornered (Breaking Bad)\n\n|\n}}\n| length         = 47 minutes\n| guests         = * Maurice Compte as Gaff\n* Damon Herriman as Scary Skell\n* Blake Berris as Tucker\n* Ray Campbell as Tyrus Kitt\n* Marius Stan as Bogdan Wolynetz\n| prev           = Shotgun\n| next           = Problem Dog\n| season_article = Breaking Bad season 4\n| episode_list   = List of Breaking Bad episodes\n}}\n\"Cornered\" is the sixth episode of the fourth season of the American television crime drama series Breaking Bad, and the 39th overall episode of the series. It originally aired on AMC in the United States on August&nbsp;21,&nbsp;2011.\nPlot\nAnother Los Pollos Hermanos truck is raided by the cartel. This time, the two guards in the truck are killed by the truck's exhaust being blown through the vents and the cartel members find the tubs with blue meth.\nSkyler White is worried about Walter White, suspecting that he is in danger due to the death of Gale Boetticher. Walt reacts angrily, telling her about his importance in the drug trade and implying that he killed Gale, prompting Skyler to take Holly White and flee the house. At the Four Corners Monument, she ponders escaping to Colorado, but ultimately reconsiders.\nWalt receives the keys to the car wash from Bogdan Wolynetz, and avenges his past insults by making Bogdan leave behind his framed first earned dollar, which Walt uses to buy a soda. Later, Walt gives into Walter Jr.'s pleas for a new car and buys him a Dodge Challenger.\nWalter meets Jesse Pinkman at the lab and questions his frequent errands with Mike Ehrmantraut. Jesse angrily responds that he is finally feeling useful and accuses Walt of discrediting his accomplishments. As they argue, Walt realizes Gus Fring is trying to drive a wedge between them. When they finish cooking, Jesse gets called away by Mike for another errand, leaving Walt to clean alone. Angered, Walt then bribes three laundry workers into helping him clean the lab. Tyrus Kitt later tells Walter that because they saw more than they should have, he is sending them back to Honduras.\nJesse and Mike scout a drug house where the blue meth from the hijacked truck is being sold, but Jesse grows impatient and tricks one of the meth users into letting him inside, where he knocks out the other. Mike notices the words \"¿Estás listo para platicar?\" () written on the stolen container. Gus meets Mike at a diner that night and they decide to negotiate with the cartel. Outside the diner, Gus compliments Jesse's work in his errands with Mike, further boosting his self-esteem and loyalty.\nSkyler returns home, but tells Walt to return the Dodge Challenger because it contradicts their cover story. She acknowledges that Walter Jr. will resent her, but tells Walt that \"someone has to protect this family from the man who protects this family\".\nAccolades\nDue to her nomination, Anna Gunn submitted this episode for consideration for the Primetime Emmy Award for Outstanding Supporting Actress in a Drama Series for the 64th Primetime Emmy Awards.\nAlthough credited, Bob Odenkirk, Dean Norris and Betsy Brandt do not appear.\nReception\nSeth Amitin reviewing for IGN awarded the episode 9.5 out of 10 calling it an \"extraordinary episode from top to bottom\".  Alan Sepinwall of HitFix said the episode was his \"favorite episode of season 4 to date\". Donna Bowman of The A.V. Club gave the episode a \"B+\".\nWalter White's \"I am the one who knocks\" line was listed by Time as one of the best television lines of 2011. In 2019, The Ringer ranked \"Cornered\" as the 22nd best out of the 62 total Breaking Bad episodes.\nReferences\nExternal links\n* [http://www.amctv.com/shows/breaking-bad/episodes/season-4/cornered \"Cornered\"] at the official Breaking Bad site\n*"
    }
  ]
}