{
  "content": [
    {
      "type": "text",
      "text": "# Cornish Creek, Queensland\n\n| pop                 = 16\n| pop_year            =\n| pop_footnotes       =\n| established         =\n| postcode            = 4732\n| area                = 1892.5\n| timezone            = AEST\n| utc                 = +10:00\n| dist1               = 5\n| dir1                = S\n| location1           = Muttaburra\n| dist2               = 158\n| dir2                = NW\n| location2           = Barcaldine\n| dist3               = 736\n| dir3                = WNW\n| location3           = Rockhampton\n| dist4               = 1228\n| dir4                = WNW\n| location4           = Brisbane\n| lga                 = Barcaldine Region\n| stategov            =Gregory\n| fedgov              =Maranoa\n| near-n              = Prairie\n| near-ne             = Upper Cornish Creek\n| near-e              = Upper Cornish Creek\n| near-se             = Sardine\n| near-s              = Sardine\n| near-sw             = Longreach\n| near-w              = Muttaburra\n| near-nw             = Tablederry\n}}\nCornish Creek is a former rural locality in the Barcaldine Region, Queensland, Australia. In the , Cornish Creek had a population of 16 people.\nOn 22 November 2019 the Queensland Government decided to amalgamate the localities in the Barcaldine Region, resulting in five expanded localities based on the larger towns: Alpha, Aramac, Barcaldine, Jericho and Muttaburra. Most of Cornish Creek was incorporated into Muttaburra, except for a small part of eastern Cornish Creek which was incorporated into Aramac.\nGeography\nThe Thomson River forms the south-western boundary of the locality. Cornish Creek flows through the locality from east (Upper Cornish Creek) to west (Tablederry) where it becomes a tributary to the Thomson River. All watercourses in the locality flow into the Lake Eyre drainage basin.\nThe Muttaburra Aramac Road enters the locality from the west (Muttaburra) and passes through the locality exiting to the south (Sardine). Crossmoor Road enters the locality from the south-west (Muttaburra) and has its junction with the Muttaburra Aramac Road within the locality.\nThe principal land use is grazing.\nHistory\nCornish Creek is part of the traditional tribal lands of the Iningai. Iningai (also known as Yiningay, Muttaburra, Tateburra, Yinangay, Yinangi) is an Australian Aboriginal language spoken by the Iningai people. The Iningai language region includes the landscape within the local government boundaries of the Longreach Region and Barcaldine Region, particularly the towns of Longreach, Barcaldine, Muttaburra and Aramac as well as the properties of Bowen Downs and catchments of Cornish Creek and Alice River.\nThe locality is named after the creek, which was in turn named in 1860 by explorer William Landsborough after his business partner Edward Cornish.\nHeritage listings\nCornish Creek has a number of heritage-listed sites, including:\n* Mount Cornish Homestead\nEducation\nThe nearest primary schools are in Muttaburra and Aramac. The nearest secondary schools are in Aramac (to Year 10 only) and in Winton, Longreach and Barcaldine (all to Year 12).\nReferences"
    }
  ]
}