{
  "content": [
    {
      "type": "text",
      "text": "# Cornelius Coward\n\n|         birth_place = Preston, Lancashire, England\n|          death_date =\n|         death_place = Preston, Lancashire, England\n|            nickname = Kerr\n|             batting = Right-handed\n|             bowling = Right-arm medium\n|                role = Batsman\n|              family = Frederick Coward (brother)\n|\n|               club1 = Lancashire\n|               year1 =\n|               type1 = FC\n|          debutdate1 = 7 August\n|          debutyear1 = 1865\n|           debutfor1 = Lancashire\n|       debutagainst1 = Middlesex\n|           lastdate1 = 15 May\n|           lastyear1 = 1876\n|            lastfor1 = Lancashire\n|        lastagainst1 = Nottinghamshire\n|             columns = 1\n|             column1 = First-class\n|            matches1 = 49\n|               runs1 = 1,210\n|            bat avg1 = 14.93\n|           100s/50s1 = 0/2\n|          top score1 = 85\n|         deliveries1 = 124\n|            wickets1 = 0\n|           bowl avg1 = –\n|            fivefor1 = –\n|             tenfor1 = –\n|       best bowling1 = –\n|  catches/stumpings1 = 15/–\n|                date = 15 August\n|                year = 2009\n|              source = https://cricketarchive.com/Archive/Players/28/28771/28771.html Cricket Archive\n}}\nCornelius Coward (27 January 1838 – 15 July 1903) was an English cricketer. A talented fielder and right-handed batsman, popularly known as Kerr, Coward played 49 first-class matches for Lancashire County Cricket Club between 1865 and 1876. He scored 1,210 runs in the middle order for Lancashire, before retiring to play club cricket for his home town of Preston – who he also coached – as well as becoming a cricket umpire for 98 matches, a licensed victualler and a teacher at the Roman Catholic institutions of Stonyhurst College in Lancashire and Clongowes Wood College in Ireland.\nCricket career\nEarly days\nCoward was born in Preston, Lancashire. On 26 May 1862, aged 24, Coward appeared for All England Eleven – a team of hitherto untested cricketers who had not played professional cricket before – at Lord's against a 20-man-Yorkshire team. Coward was dismissed for a duck by William Iddison; took two catches to dismiss Joseph Thewlis off the bowling of George Tarrant and John Thewlis off the bowling of Edgar Willsher; and then scored a second duck to end the match with a pair. He then played a second match in June 1862, for a team of professionals against the Marylebone Cricket Club (MCC) at Lord's, where he scored another duck in the first innings, and then top-scored with 17 in the second innings, earning a presentation bat from the Hon. F. Ponsonby.\nHe then played four matches between 1863 and 1864 for two Lancashire teams – Gentlemen of Lancashire and Players of Lancashire – against similar Shropshire, Warwickshire and Yorkshire. On 25 May 1865, he played a three-day match against the United South of England Eleven for a 22-strong Pleasington. Coward scored four and 25 as Pleasington fell to a 12-run defeat. His skills with the bat, \"reckoned to be an excellent batsman and a good field at long-leg or cover-point,\" attracted the attention of Lancashire.\nFirst-class cricket\nCoward made his debut for Lancashire on 7 August 1865, against Middlesex in a cricket ground at Islington. Middlesex won the toss and batted first, reaching 226 and dismissing Lancashire for 112 with Coward making 23. Following on, Coward was run out for a duck, with Lancashire's 130 all out leaving Middlesex only 17 to win, which they reached without losing a wicket, and with a day still remaining in the game. Coward did not play another match in the 1865 season, however he became a more regular fixture in the 1866 season, with five appearances for his county. He scored 183 runs at 20.33, including his career-best 85. This score came in a 5 July 1866 match at Old Trafford, where Coward came in to bat with Lancashire on 48/6. He took Lancashire to 181 before becoming the last wicket to fall. He scored four more in the second innings, but could not prevent a 54-run defeat by Middlesex. His abilities with the bat earned him places in the United All England Eleven sides as well as both Gentlemen and Players' teams. He would go on to score 81 runs from three matches for the United All England Eleven side.\nCoward enjoyed regular first-class appearances during the next two seasons – 1867 and 1868 – making ten appearances in both. He scored 285 runs in 1867, another career best, at 16.76 with a high score of 34; and he scored 267 runs in 1868 at 14.05 – which included more matches for North of England Eleven – with a best of 46. He also took six catches in the field. Coward made eight other appearances in 1869, scoring 165 runs at 15.00. On 27 May 1869, Lancashire faced Surrey, where Coward scored his season-best of 49, followed by 16*. He also faced the MCC on 19 July, where Coward scored five in the first innings, and 15 in the second before he was bowled by WG Grace. Coward also played two All England Eleven matches against Worksop and Northamptonshire, scored five, three, 15 and 18; and in the latter match her took four catches.\nUmpiring\nCoward was reduced to two appearances in 1870, first against Surrey where he scored one and two not out, and the second for United North of England Eleven first against United South of England Eleven. Instead, Coward undertook first-class cricket umpiring, with his first match taking place on 21 July between Lancashire and Hampshire. Coward went on to umpire 98 first-class matches, and 19 other matches.\nCoward continued to umpire cricket matches while he played more occasionally for Lancashire. Coward played six matches in 1871, scoring 162 runs at 16.20; and three further matches in 1872 which returned only 33 runs at 6.60. His umpiring then tapered off, and would not resume to any great extent until the 1880s. He would also not play first-class cricket between 1872 and 1875, with an appearance on 27 August 1874 for United North of England Eleven against Northamptonshire being his only cricket appearance. He returned in 1875 for three matches, scoring only 54 runs at 10.80, and one final match in 1876 where he failed to score a run. This would be his last appearance as a player in any first-class-matches, and he resumed umpiring briefly from 1876 to 1879, before becoming a regular umpire from 1880 until 1893. He had a benefit match between Lancashire and Nottinghamshire at Old Trafford in July 1878.\nIn 1889, Coward also had a benefit match between Lancashire and an 18-man team from Preston Cricket Club. Coward's final match as an umpire, saw Surrey face Gloucestershire at the Kennington Oval on 1 June 1893. During it, Coward oversaw WG Grace passing 38500 first-class runs in partnership with fellow, and international Test umpire, C Clements.\nLater life\nIn 1881, a local census recorded Coward living at Riverside Bowling Green Inn, Preston, with his wife Ellen, aged 41. He had two domestic servants and, at age 43, was a licensed victualler. The 1901 census listed him as a professional cricketer, however his wife had by then died, and Coward was shown to live at 204 South Meadow Road, Preston with one servant. In his last years he continued to play club cricket for Preston, and spent some time at Stonyhurst College, Lancashire and at Clongowes Wood College, in Ireland. He died in July 1903, in the town of his birth, Preston.\nHis younger brother, Frederick, also played first-class cricket.\nNotes\nReferences\n*\n*\nExternal links\n*"
    }
  ]
}