{
  "content": [
    {
      "type": "text",
      "text": "# Corsican War of Independence\n\n(1729-1768)\n* (1732)\n* (1735-1741, 1749)\n----\n* (1768-1769)\n}}\n|combatant2= Corsican Republic (1755-1769)\n*Supported by\n*\n*\n* Beylik of Tunis (1736)\n}}\n|commander1= Gian Veneroso\n* Giovanni Grimaldi\n* Matteo Franzoni\n* Agostino Lomellini\n* Rodolfo Sale\n* Feancesco Rovere\n* Alérius Matra\n* Major Marchelli\n* Louis XV\n* André Fleury\n* Jean Maillebois\n* Colonel von Vinz (1732)\n----\n* Louis XV\n* Noël Vaux\n* Charles Marbeuf\n* Raphaël Casabianca\n}}\n|commander2=\n* Carlu Raffalli\n* Simone Fabiani\n* Andrea Ceccaldi\n* Ghjacintu Paoli\n* Ghjuvan-Petru Gaffory\n* Gregorio Salvini\n* Filippu Ciattoni\n* Domenico Rivarola\n* Johann Neuhoff\n* Erasmo Orticoni\n* Mariu-Emmanuele Matra\n* Pasquale Paoli\n* Ghjacumu Abbatucci\n* Clemente Paoli\n* Carlo Buonaparte\n* Circinellu\n}}\n|strength1=\n|strength2=\n|casualties1=\n|casualties2=\n|notes=\n}}\nThe Corsican War of Independence, also known as the '''Forty Years' War''' (Corsican: Guerra di 40 anni), was a conflict between Corsican nationalism and the Republic of Genoa, and later the Kingdom of France in its final phase. Initially a tax resistance movement, it quickly turned into a war of independence. Indirectly, this war accelerated the fall of the Republic of Genoa and also triggered an ethnic conflict between Corsicans and pro-Genoese Paomian Greeks.\nThe war ended with a Corsican victory and de facto independence of most of the island, except for the coastal towns. Corsica was thus separated into two states, with the Republic of Genoa controlling the port towns, while the Corsican Republic controlled the interior of the island, until the Kingdom of France replaced Genoa and attacked the Corsican Republic as soon as the Genoese presence on the island ended.\nContext\nFor nearly four centuries, the Republic of Genoa dominated Corsica. During several of these centuries, Genoa had to face numerous Corsican rebellions, notably that of Sambucucciu d'Alandu and then that of Sampiero Corso, the two major rebellions led by these two men were crushed, that of Sampieru was however strong due to its pact with the Franco-Ottoman alliance.\nIn the 1700s, the Republic of Genoa marginalized the Corsicans in favor of the Ligurians, the Corsicans had to pay excessive taxes, were extremely poor while Genoa carried out a colonization of settlement over several centuries, expelling the Corsicans from the coastal towns.\nApart from a few brief isolated periods, Corsica had been part of the Republic of Genoa since 1284, when it was taken from the Republic of Pisa by the Genoese victory at the Battle of Meloria. Despite its submission, Corsican society always remained hostile to feudalism. In the 18th century, with the advent of the Enlightenment, the Corsican ideals of independence grew stronger, and in 1729 the first revolutionary movements arose, encouraged by the serious economic situation of the islanders and the despotism of the Genoese government. In March, Bastia was sacked, and in November, the patriots appointed Luiggi Giafferi, Andrea Ceccaldi, Abbot Raffaelli, and Hyacinthe Paoli, Pasquale's father, as commanders.\nUprisings\nThe uprising began with a peasant revolt in December 1729, after a tax collector was driven out of a village by an old man called Cardone for collecting a tax, the due seini that Genoa had introduced in 1715 and renewed despite its temporary nature.\nThe uprising was then of fiscal origin, but quickly transformed into a war of independence. In 1730, the revolt of peasant origin spread among the upper classes of Corsican society, notably the notables.\nFirst assault on Bastia\nIn February 1730, 5,000 peasants decided to attack Bastia. For them, it was a symbol of Genoese power, but also of their economic power. While the inhabitants of Terranova took refuge behind the walls of the citadel, the peasants attacked, captured and burned the Terravechja district: the houses on Castagno and E Terrazze streets were attacked.\nThe insurgents twice managed to seize Bastia and threatened other strongholds. Genoa then sent a new government with exceptional powers. However, the rebellion did not weaken. In 1730, a consultation bringing together delegates from the pieves elected three representatives: Luiggi Giafferi who represented the notables of popular origin, Andrea Ceccaldi for the nobles and Marcus Aurelius Raffaelli for the clergy. The grievances are confused because they include both popular demands but also demands specific to the Corsican nobility and notables. Moreover, they imperfectly reflect the real situation on the island at the time. The insurrection then spread throughout the island in 1731.\nCorsican attacks on the Greeks of Paomia\nWith the insurrection spreading across the island in 1731, while the Greeks of Corsica refused to support the insurrection against Genoa, Genoa having allowed the Greeks to escape the Ottomans a century earlier by exiling themselves to Corsica, the insurgents attacked the Greek community. About a hundred Greeks from Paomia actively fought against the insurgents, allowing their families to flee. Their fate is unknown. The families took refuge in Ajaccio. The Greeks, who had settled in Corsica a century earlier, were then protected by the Genoese.\nThe Austrian intervention\nThe Genoese had to seek help from their Austrian allies to quell the revolt. In 1731, 6,000 Austrian troops landed in Bastia, under the command of Wachtendonck and then Wurtenberg, who was staying at the Caraffa Palace in Bastia. The first revolt was quelled, but others would follow later.\nSubsequently, the Austrians, led by Colonel von Vinz, commanding an elite force, were defeated at the Battle of Calenzana in 1732, forced to retreat to Calvi. The Austrians then tried to convince Genoa to moderate its policy towards the island and to grant concessions to the insurgents. But, as soon as the Austrians left, the Republic of Genoa did not respect its commitments, thus creating new revolts against it.\nIn 1735, a consultation was held in Corte. It decided on a definitive break with Genoa. The insurgents set up a provisional government, dominated by Giafferi, Paoli and Ceccaldi. It was on this occasion that the song Diu vi salvi Regina became the anthem of independent Corsica. Genoa responded by intensifying repression and orchestrating a blockade of the island. Seeing that no power was coming to their aid at that moment, the insurgents were close to capitulating. However, an unexpected event changed the course of events.\nTwo years earlier, Prince Theodore von Neuhoff had taken an interest in the island's cause. He met the insurgent leaders in Livorno . He reached an agreement with the main leaders of the insurrection to become King of Corsica and in favor of independence. The political content of this project is set out in the Disinganno interno alla guerra di Corsica, published in 1736.\nLanding of Theodore von Neuhoff\nTheodore de Neuhoff landed in Corsica with several men, with the support of Ali I Pasha of the Beylicat of Tunis.\nNeuhoff landed at Aléria on March 20, 1736, on an English ship with German mercenaries. The choice of location implies that Saveriu Matra had been involved in the project, as the landing would otherwise have been far too risky, as the powerful leader of the Matra clan was the undisputed master of the place. With Matra's protection and help, Neuhoff then staged his arrival: magnificence, gifts to spectators, letters to the generals. The arrival of Theodore then made it possible to bring together for the first time the main island clans around a common project and a single leader to lead coalition actions against Genoa.\nKingdom of Corsica\nDespite Austrian aid to the Republic of Genoa, the situation in Corsica did not calm down. On 8 January 1735, a council meeting in Orezza proclaimed the independence of Corsica and separated the island from the Republic of Genoa.\nThe council of Orezza organizes the kingdom of Corsica and three leaders are elected: Hyacinthe Paoli (Pasquale's father), Andrea Ceccaldi and Luigi Giafferi.\nIt was then decided that Corsica would be placed under the protection of the Immaculate Conception. The Diu vi salvi Regina was adopted as the rallying song of the Corsican insurgents at the council held at Orezza on 30 January 1735.\nFoundation of the Kingdom of Corsica\n.]]\nTheodore von Neuhoff was crowned king at the convent of Alesani on June 13, 1736. Under the name of Tiadoru I, the king established a diet of twenty-five members, a government and had a coin minted with his image.\nBirth of the Alesani Constitution\nThe constitution was formed, drafted by Sebastianu Costa, and approved by the \"patricians\" of the Kingdom of Beyond and This Side of the Mountains. The Corsican revolutionaries pledged allegiance to the newly created constitutional monarchy, as did many clan leaders. The king's power was exercised under the control of a diet made up of the \"primates of the kingdom.\" The monarch was directly assisted by the three generals of the Nation elected during the second phase of the insurrection—Luigi Giafferi, Hyacinthe Paoli, and Luca d'Ornano. Justice and administration were entrusted to Sebastiano Costa, appointed Grand Chancellor and First Secretary of State.\nThe constitution, however, never came into force. The insurgent leaders, acting in a decentralized manner, were not united and some of them were mandated by foreign powers rivaling Genoa.\nFall of the regime\nTheodore reigned in person for less than six months before leaving in search of financial and political support, leaving the regency to Giafferi, Paoli, d'Ornano and Frédérick de Neuhoff. Despite his efforts and the significant support he managed to gather, the landing of French troops led to the defection of some of the key notables of the regime and caused the failure of his return in 1738.\nWhile in 1737, Genoese troops landed in Aléria under the orders of the new governor, finding only women and children there, the Genoese committed a massacre in the town.\nIn 1739, the Marquis de Maillebois was sent by the Kingdom of France to help Genoa put down the rebellion. The Marquis's forces practiced a scorched earth policy, committing massacres, burning the houses of the insurgents and destroying a monastery. The Corsican monarchical regime, however, kept its supporters despite Maillebois's policy; the last supporters were not reduced to mercy until the end of 1740.\nCorsican uprising after the fall of the monarchical regime\nDefeated, the Kingdom of Corsica disappeared and some insurgent leaders went into exile in Naples, while Johann Friedrich Caspar von Neuhoff zu Rauschenburg led a troop against the Marquis Jean-Baptiste Desmarets de Maillebois of the Kingdom of France, but the Corsican insurgents and their Westphalian leader were defeated. The Corsican insurrection was not, however, quelled, and quickly resumed.\nTheodore von Neuhoff, far from giving up, asked for support from the British, and he was notably supported by Corsican officers from Venice and by their leader, Marshal Johann Matthias von der Schulenburg. Schulenburg recommended Theodore von Neuhoff to London in the care of Knight Lucas Schaub: \"You would then kindly accept, Sir, the liberty I am taking to recommend to you as best I can the famous King Theodore, who has made enough noise for several years, and who has sufficiently pointed out what he was capable of undertaking and carrying out, if he had been seconded and favored by circumstances and situations more favorable than he has been, or if he had been fortunately supported by some Power.\"\nIn 1743, Jean-Pierre Gaffory led another insurrection against the Republic of Genoa in Corsica. Théodore de Neuhoff tried to once again take the lead in the insurrection by entering Balagne, but the Corsicans no longer supported him and he was excluded from any project on the island. Neuhoff left for Livorno. Gaffory, for his part, works to unite the island rebels. At the consulta of Caccia (September 26–27, 1745), he and his brother-in-law Alerio Francesco Matra were elected protettori of Corsica, while Father Venturini became president.\nTheir mission was to ease tensions between the revolting Corsican leaders to unite them.\nIn 1744, the murder of a Corsican by a Greek provoked another attack on the Greeks of Corsica, riots and assassinations, pushing Greeks to flee to the Island of San Pietro.\nIn 1745, with an English squadron of the Royal Navy commanded by Domenico Rivarola, Bastia was attacked in the hands of the Genoese, forcing the Genoese to capitulate.\nUnder the orders of François-Jean Orceau de Fontette in May 1749, French troops put down the Corsican rebellion of the pièves of Canale and Ornano. Fontette ordered the burning of houses, permitted looting and ordered multiple hangings and beheadings.\nOn October 2, 1753, Gaffory was assassinated by two men, potentially mandated by the Doge of Genoa Giovanni Giacomo Grimaldi. Gaffory was the last General of the nation active in Corsica, but his death did not lead to the end of the revolt which continued permanently. Gaffory's death, however, would have subsequent consequences for the insurgents.\nClemente Paoli, one of the sons of Hyacinthe Paoli, prepares the return of his brother, Pasquale Paoli, who will later become the undisputed leader of the Corsican insurrection.\nThe Corsicans continued to resist Genoa and ambushes were occasionally set against the Genoese, who withdrew towards the coast and gradually lost most of their territory.\nThe Corsicans under the direction of Pascal Paoli\nWith most of the interior of Corsica now under the control of the independence rebels, Clemente Paoli therefore organized the return of his brother, Pascal Paoli.\nPaoli was named General of the Nation (being the only man to bear this title in Corsica since the death of Jean-Pierre Gaffory).\nPaoli founded the Corsican Republic, gave it a constitution, granted the right to vote to all men and heads of families (who could be women) and attempted to put an end to vendettas by allowing the legalization of the death penalty.\nParallel conflict between Paolists and Matrists\nPaoli's appointment as leader was contested by another part of the Corsican lords, who in parallel appointed Mariu Emmanuele Matra as General of the Nation in opposition to Paoli and his political program, leading to a civil war.\nContinuation of the war against Genoa\nPaoli, with his Corsican Republic, thus became the leader of all the insurgents, who, under his command, now constitute a fully-fledged army.\nThe Genoese were thus defeated by the Corsican army in turn at Saint-Florent, Calvi and Ajaccio and capitulated at Porto-Vecchio.\nIn 1763, the Corsicans won the Battle of Furiani, pushing the Genoese back towards Bastia.\nIn 1764, Genoa asked the Kingdom of France to occupy several port cities, including Bastia, which was done. In 1965, thousands of French soldiers entered Corsica, but did not take part in the fighting.\nFragile peace in the center of Corsica\nSince the founding of the Corsican Republic, the interior of Corsica has been under the control of the independence movement. Skirmishes with the Genoese occur from time to time, and the Genoese are often pushed back, while the Corsican Republic establishes its own policies and army. Peace within the interior is such that foreign visitors can travel there, although not without risk, since Genoa and France still control certain port cities, for example, James Boswell, who will become a friend of Pascal Paoli.\nIn the center, Paoli implemented his policies, built a university in Corte, and established a professional army. Corte was then the capital of the Corsican nation.\nAnother example is the fact that Corsicans also left the island, notably Bonfiglio Guelfucci, professor of theology and ecclesiastical history, who left for Rome, who later returned to Corsica to fight against Genoa.\nEnd of the war with Genoa and consequences\nThe war ended with the Treaty of Versailles of 1768, where the Republic of Genoa, which no longer had any authority over Corsica, the Genoese expecting to be defeated and expelled from the island, decided to secretly sell Corsica to France for an indefinite period, decided to hand over to the Kingdom of France, giving a de facto victory to the Corsican insurgents. On the same day, the French attacked the Corsican Republic, thus ending the Corso-Genoese War, but thus triggering the French Conquest of Corsica, which would end the Corsican Republic as a sovereign state a year later.\nThis led to the Corsican Crisis in the United Kingdom of 1768–1769, at the time of the French conquest, which led to the fall of the Prime Minister, the Duke of Grafton.\nThe Corsican War of Independence indirectly led to the fall of the Republic of Genoa, due to excessive expenditure of money to retake the rebellious island, but also through the French, who originally came to help the Genoese, who at the same time weakened the oligarchic system of the Republic. The Republic of Genoa collapsed during the French Revolutionary Wars, replaced by the Ligurian Republic.\nBibliography\n* ''Giustificazione della rivoluzione di Corsica|Giustificazione della rivoluzione di Corsica e della ferma risoluzione presa da' Corsi di mai più sottomettersi al dominio di Genova, Naples, april 1758.\n* Giustificazione della Rivoluzione di Corsica e della ferma risoluzione presa da' Corsi di mai più sottomettersi al dominio di Genova, Oletta, 1758.\n* Giustificazione della Rivoluzione di Corsica combattuta dalle riflessioni di un Genovese e difesa dalle osservazioni di un Corso, Corte, 1764.\n* F. Girolami-Cortona, Histoire de la Corse, Librairie marseillaise, réédition de 1971\n* Histoire de la Corse, publiée sous la direction de Paul Arrighi, Privat éditeur, collection d’histoire régionale « l’univers de la France », 1971 (Fabiani, famille de Balagne, p.&nbsp;265 et 323; Fabiani (Simon) : p.&nbsp;320, 32, 334, 351)\n* Bent, J. Theodore (1886). \"King Theodore of Corsica\", The English Historical Review, Vol. 1, No. 2, pp.&nbsp;295–307.\n* Michel Vergé-Franceschi, Histoire de Corse du 17th century à nos jours, préface d’Emmanuel Le Roy Ladurie, éd. Le Félin Kiron, 2007 (« Fabiani (Simon, comte), lieutenant-général du Royaume de Corse » : tome II p.&nbsp;307-308)\n* Sébastien Costa : Mémoires de Sébastien Costa, grand chancelier du roi Théodore'', édition critique, traduction et notes par Renée Luciani, agrégée de l'Université (index au nom de Simon Fabiani: tome I : p.&nbsp;30, 132, 218, 219, 236-240, 256, 267, 268, 270, 310, 367, 360, 374, 412, 414, 420, 480, 490, 494, 502-508, etc 526-530, etc 766-776, 816-822, 832-836, etc 852-856, etc 872-876, etc; tome II : , 66, 68, etc 130-138, etc 288-302, etc 428-450, etc).\n* Jean-Baptiste Nicolai, Vive le roi de Corse, Notes et documents sur le règne de Théodore de Neuhoff, suivis de son testament politique, éditions Cyrnos et Méditerranée, Ajaccio, 1981 [notamment, texte intégral de l’édit de Théodore 1er du 31 janvier 1743; sont exclus du « pardon » accordé : « les infâmes sicaires du feu notre très-aimé général comte Simon Fabiani d’estimable mémoire »].\n* Evelyne Luciani, Louis Belgodere, Dominique Taddei : Trois prêtres balanins au cœur de la révolution corse, Bonfigliuolo Guelfucci, Erasmo Orticoni, Gregorio Salvini, éd Alain Piazzola, 2006\n* Horace Fabiani: ''Souvenirs d'Algérie et d'Orient, Paris, E. Dentu éditeur, Libraire de la Société des Gens de Lettres, 1878 (https://gallica.bnf.fr/ark:/12148/bpt6k103757j.image.r=FABIANI.f162.hl)\n* abbé de Germanes, Histoire des révolutions de Corse depuis ses premiers habitants jusqu’à nos jours, Paris, Hérissant, 1771.\n* Thierry Giappiconi, De l'épopée vénitienne aux révolutions corses : Engagements militaires et combats politiques insulaires'', Ajaccio, Albiana, 2018.\nReferences"
    }
  ]
}