{
  "content": [
    {
      "type": "text",
      "text": "# Coty Award__disambig_1\n\nThe '''Coty American Fashion Critics' Awards''' (awarded 1943–1984) were created in 1942 by the cosmetics and perfume company Coty to promote and celebrate American fashion, and encourage design during the Second World War. In 1985, the Coty Awards were discontinued with the last presentation of the awards in September 1984; the CFDA Awards fulfill a similar role. It was casually referred to as \"fashion's Oscars\" because it once held great importance within the fashion industry and the award ceremonies were glitzy galas.\nHistory\nThe Coty (Avery Nabavian Award) Awards were conceived and created by Coty, Inc. Executive Vice President, Jean Despres, founder of The Fragrance Foundation and FiFi Awards, and Grover Whalen (a member of the New York City Mayor's Committee, and president of the 1939 New York World's Fair). The fashion publicist  Eleanor Lambert was employed to promote and produce the awards.\nThe awards were given solely to designers based in America, unlike the Neiman Marcus Fashion Awards. Until its discontinuation in 1985, the Coty Award was considered one of the most prestigious awards in the field of fashion. The awards were designed by Malvina Hoffman. The womenswear awards are popularly known as Winnies; the menswear award which began in 1968 has no name. Repeat awards were the Return Award and the Hall of Fame award. Special Awards were also awarded to designers in specialist fields.\nThe popularity of this award began to decline in the late 1970s due to perceived commercial interests by the parent company. In 1979, designers Calvin Klein and Halston announced they would no longer accept the Winnie award. The same year, in 1979, Coty released the Coty Awards make up kit in order to profit off of the awards ceremony, which was perceived by the fashion designers to have cheapened the event. The newly founded Council of Fashion Designers of America (CFDA) appeared more democratic in ideology and began to compete with the Coty Award by 1980 with the CFDA Awards.\nIn June 1985, Donald Flannery, the senior vice-president of Pfizer, Inc., Coty's parent company, announced that since the awards had successfully brought America into the worldwide fashion scene, it was decided to discontinue them.\nRecipients of the award\n1943–1949\n{| class=\"wikitable\"\n!Year\n!Winnie\n!Special Award(s)\n!Additional citations\n|-\n|1943\n|Norman Norell\n|Lilly Daché (millinery), John Frederics (millinery)\n|Hattie Carnegie (fashion designer & retailer), Clare Potter (American sportswear), Charles Cooper, Mainbocher (American couture), Claire McCardell (American sportswear), Valentina (American couture).\n|-\n|1944\n|Claire McCardell\n|Phelps Associates (leather accessories), Sally Victor (millinery)\n|\n|-\n|1945\n|Gilbert Adrian, Tina Leser, Emily Wilkens\n|\n|\n|-\n|1946\n|Omar Kiam (of Ben Reig), Vincent Monte-Sano, Clare Potter\n|Ceil Chapman (party dresses), Helen Morgan (raincoats), Carolyn Schnurer (bathing suits), Wallace Mackey (play shoes),  Morris Wolock (flat shoes, \"shank's mare\"), Brooke Cadwallader (scarves), Nina Wolf (jewelry)\n|\n|-\n|1947\n|Jacob H. Horwitz (junior fashions), Mark Mooring (couture design for Bergdorf Goodman), Nettie Rosenstein (high end wholesale), Adele Simpson (medium end wholesale)\n|\n|The awards of 1947 recognised the work of the four main branches of the fashion industry: bespoke high-end design, high end wholesale, mid-priced wholesale, and junior fashion.\n|-\n|1948\n|Hattie Carnegie\n|Joseph de Leo (furs), Esther Dorothy (furs), Maximilian (furs)\n|\n|-\n|1949\n|Pauline Trigère\n|David Evins (shoes), Toni Owen (American sportswear)\n|\n|}\n1950–1959\n{| class=\"wikitable\"\n!Year\n!Winnie\n!Special Award(s)\n!Return Award(s)\n!Hall of Fame\n!Additional citations\n|-\n|1950\n|Charles James, Bonnie Cashin\n|Mabel & Charles Julianelli (shoes), Nancy Melcher (lingerie)\n|\n|\n|\n|-\n|1951\n|Jane Derby\n|Anne Fogarty (prettiest dresses), Vera Maxwell (American sportswear), Sylvia Pedlar (lingerie)\n|Norman Norell, Pauline Trigère\n|\n|\n|-\n|1952\n|Ben Zuckerman, Ben Sommers (of Capezio)\n|Karen Stark at Harvey Berin (concept of dressing), Sydney Wragge (concept of dressing)\n|\n|\n|\n|-\n|1953\n|Tom Brigance\n|Helen Lee (children's clothing), John Moore at Matty Talmack (evening wear)\n|\n|\n|\n|-\n|1954\n|James Galanos\n|Charles James (innovative cutting)\n|\n|\n|\n|-\n|1955\n|Anne Klein, Jeanne Campbell, Herbert Kasper\n|Adolfo (millinery)\n|\n|\n|\n|-\n|1956\n|Luis Estevez, Sally Victor\n|Gertrude & Robert Goldworm (knitwear)\n|James Galanos\n|Norman Norell\n|\n|-\n|1957\n|Leslie Morris, Sydney Wragge\n|Emeric Partos (furs)\n|\n|\n|\n|-\n|1958\n|Arnold Scaasi\n|Donald Brooks (influence on evening clothes), Jean Schlumberger (jewelry)\n|Ben Zuckerman\n|Claire McCardell (posthumous)\n|\n|-\n|1959\n|\n|\n|\n|James Galanos, Pauline Trigère\n|\n|}\n1960–1969\n{| class=\"wikitable\"\n!Year\n!Winnie\n!Special Award(s)\n!Return Award(s)\n!Hall of Fame\n!Additional citations\n|-\n|1960\n|Ferdinando Sarmi, Jacques Tiffeau\n|Rudi Gernreich (innovative body clothes), Sol Klein at Nettie Rosenstein (costume jewelry), Roxane of Samuel Winston (beaded evening wear)\n|\n|\n|\n|-\n|1961\n|Bill Blass, Gustave Tassell\n|Bonnie Cashin (deep-country clothes), Kenneth (leadership in hair-styling)\n|\n|Ben Zuckerman\n|\n|-\n|1962\n|Donald Brooks\n|Halston (millinery)\n|\n|\n|\n|-\n|1963\n|Rudi Gernreich\n|Arthur and Theodora Edelman (leather design), Betty Yokova of Neustadter Furs Inc.\n|Bill Blass\n|\n|\n|-\n|1964\n|Geoffrey Beene\n|David Webb (jewelry design)\n|Jacques Tiffeau, Sylvia Pedlar (Return Special Award)\n|\n|\n|-\n|1965\n|Tzaims Luksus (fabric design), Pablo of Elizabeth Arden (leadership in make-up), Gertrude Seperack of Warner's (bodystockings and foundation garments)\n|Anna Potok of Maximilian (furs), Sylvia de Gay (young fashion), Edie Gladstone (young fashion), Stan Herman (young fashion), Victor Joris (young fashion), Gayle Kirkpatrick (young fashion), Deanna Littell (young fashion), Leo Narducci (young fashion), Don Simonelli (young fashion), Bill Smith (young fashion)\n|\n|\n|\n|-\n|1966\n|Dominic at Matty Talmack\n|Kenneth Jay Lane (costume jewelry)\n|Rudi Gernreich, Geoffrey Beene\n|\n|\n|-\n|1967\n|Oscar de la Renta\n|Herbert & Beth Levine (shoes)\n|Donald Brooks\n|Rudi Gernreich\n|\n|-\n|1968\n|George Halley, Luba Marks\n|Giorgio di Sant' Angelo (fantasy accessories and ethnic fashions)\n|Bonnie Cashin, Oscar de la Renta\n|\n|\n*\n|-\n|1969\n|Stan Herman, Victor Joris\n|Adolfo (millinery), Halston (millinery), Julian Tomchin (fabric designs)\n|Anne Klein\n|\n|\n|}\n1970–1979\n{| class=\"wikitable\"\n!Year\n!Winnie\n!Menswear Award(s)\n!Special Award(s)\n!Return Award(s)\n!Hall of Fame\n!Additional citations\n|-\n|1970\n|Giorgio di Sant' Angelo, Chester Weinberg\n|Ralph Lauren\n|Steven Brody and Daniel Stoenescu of Cadoro, Alexis Kirk, Cliff Nicholson, Marty Ruza, Bill Smith (all for costume jewelry); Will & Eileen Richardson of Up Tied (Tie-dyed fabrics)\n|Herbert Kasper\n|Bill Blass\n|\n|-\n|1971\n|Halston, Betsey Johnson at Alley Cat\n|Larry Kane of Raffles Wear\n|John Kloss of Cira (lingerie), Nancy Knox (men's shoes), Levi Strauss & Co (worldwide fashion influence), Elsa Peretti (jewelry)\n|\n|Anne Klein\n|Hall of Fame citation was Bill Blass.\n|-\n|1972\n|John Anthony\n|Robert Margolis of A. Smile Inc. (excitement in menswear), Alan Rosanes of Gordon Gregory Ltd. (excitement in menswear), Alexander Shields (excitement in menswear), Pinky Wolman & Dianne Beaudry of Flo Toronto (excitement in menswear)\n|Dorothy Weatherford of Mountain Artisans (patchwork and quality)\n|Halston\n|Bonnie Cashin\n|\n|-\n|1973\n|Stephen Burrows, Calvin Klein\n|Piero Dimitri\n|Clovis Ruffin (original young fashion), Joe Famolare (shoes), Don Kline (hats), Judith Leiber (handbags), Herbert & Beth Levine (shoes), Michael Moraux of Dubaux (jewelry), Celia Sebiri (jewelry)\n|\n|Oscar de la Renta\n|\n|-\n|1974\n|Ralph Lauren\n|Bill Kaiserman of Rafael,\n|Stephen Burrows (lingerie), Stan Herman (lingerie), John Kloss (lingerie), Fernando Sánchez (lingerie), Bill Tice (lingerie), Sal Cesarani (menswear), John Weitz (menswear), Aido Cipullo (male jewelry)\n|Calvin Klein, Piero Dimitri (for menswear return award)\n|Geoffrey Beene, Halston\n|\n|-\n|1975\n|Carol Horn\n|Chuck Howard & Peter Wrigley at Anne Klein Studio\n|Bill Blass for Revillon America (fur design), Fernando Sanchez for Revillon America (fur design), Calvin Klein for Alixandre (fur design), Viola Sylbert for Alixandre (fur design), Monika Tilley for Elon (swimwear), Nancy Knox (leather menswear)\n|Bill Kaiserman of Rafael (for menswear return award)\n|Calvin Klein, Piero Dimitri (for menswear)\n|Hall of Fame citation was Geoffrey Beene.\n|-\n|1976\n|Mary McFadden\n|Sal Cesarani\n|American Sporting Gear (Sportswear (activewear)), Barbara Dulien (womenswear), Vicky Davis (men's neckwear), Lowell Judson (men's loungewear), Ronald Kolodzie (men's loungewear), Robert Schafter (men's loungewear)\n|John Anthony, Ralph Lauren\n|Herbert Kasper, Bill Kaiserman (for menswear)\n|\n|-\n|1977\n|Stephen Burrows, Donna Karan & Louis Dell'Olio for Anne Klein\n|Alexander Julian\n|Ted Muehling (jewelry), Fernando Sanchez (lingerie)\n|\n|Ralph Lauren\n|Hall of Fame citation was Geoffrey Beene(contribution to American Fashion)\n|-\n|1978\n|Bill Atkinson, Charles Suppon\n|Robert Stock\n|Joan & David Helpern (shoes and boots), AMF Head Sportswear Co. (outstanding contribution to activewear), Danskin Inc. (exercise and sports clothing)\n|Mary McFadden\n|\n|Menswear Hall of Fame citation was Bill Kaiserman\n|-\n|1979\n|Perry Ellis\n|Lee Wright\n|Barry Kieselstein-Cord (jewelry), Gil Truedsson (shoes), Joan Vass (knitwear), Conrad Bell (men's furs)\n|Alexander Julian (for menswear return award)\n|Mary McFadden\n|Hall of Fame citation was Geoffrey Beene, Halston, Calvin Klein, Ralph Lauren (for contributions to international status of American fashion).\n|}\n1980–1984\n{| class=\"wikitable\"\n!Year\n!Winnie\n!Menswear Award(s)\n!Special Award(s)\n!Return Award(s)\n!Hall of Fame\n!Additional citations\n|-\n|1980\n|Michaele Vollbracht\n|Jhane Barnes\n|Jeffrey Aronoff (handwoven fabrics), Stewart Richer for Reminiscence (retailers), Ron Chereskin (menswear)\n|\n|\n|\n|-\n|1981\n|Calvin Klein, Perry Ellis, Geoffrey Beene\n|Jhane Barnes, Alexander Julian, Ralph Lauren\n|Barry Kieselstein-Cord (jewelry), Alex Mate & Lee Brooks (jewelry), Fernando Sánchez, Fabrice Simon (beaded evening wear), Hot Sox (hosiery), Robert Lee Morris (jewelry), Laura Pearson at Tijuca (knitwear), Andrew Fezza (menswear special award), Nancy Knox (menswear special award), Robert Lighton (menswear special award)\n|\n|\n|After Beene, Klein and Lauren all rejected their awards, it was decided that all nominees would receive awards.\n|-\n|1982\n|Adri\n|Jeffrey Banks\n|Susan Bennis & Warren Edwards (shoes), Jay Lord Hatters, Patricia Underwood (millinery), Ted Muehling (jewelry), Allen Veness (weaving and knitwear), Robert Comstock (men's outerwear), Zoran (men's separates)\n|Norma Kamali, Donna Karan & Louis Dell'Olio (of Anne Klein), Sal Cesarani (for menswear return award)\n|\n|Geoffrey Beene (fifth Coty Award citation)\n|-\n|1983\n|Willi Smith\n|Alan Flusser\n|Perry Ellis (womenswear), Bill Blass, Alexander Julian, Carlos Falchi (handbags), Susan Horton, Selma, Jon & Barbara Weiser of Charivari\n|Perry Ellis (for menswear return award)\n|Norma Kamali\n|\n|-\n|1984\n|Adrienne Vittadini\n|Andrew Fezza\n|Milena Canonero (tailored clothing), Robin Kahn (jewelry), Barry Kieselstein-Cord (jewelry), Michelle & Janis Savitt (jewelry)\n|Jhane Barnes (for menswear return award)\n|Donna Karan & Louis Dell'Olio (of Anne Klein), Perry Ellis (for menswear)\n|\n|}\nSee also\n* List of fashion awards\nReferences\nExternal links\n* [http://www.coty.com/ Coty Homepage]\n* [https://web.archive.org/web/20060303225122/http://www.king5.com/sharedcontent/northwest/style/stories/NW_110404FAKcoty_fragrancesJM.245ad316.html \"Coty marks 100 years, taking time to smell success\"] – Associated Press article"
    }
  ]
}