{
  "content": [
    {
      "type": "text",
      "text": "# Coughton, Warwickshire\n\n| population = 169\n| population_ref = (2021 Census)\n| shire_district = Stratford-on-Avon\n| shire_county = Warwickshire\n| region = West Midlands\n| constituency_westminster = Stratford on Avon\n| post_town = ALCESTER\n| postcode_district = B49\n| postcode_area = B\n| dial_code = 01789\n| london_distance =\n| os_grid_reference = SP080604\n| website =\n}}\nCoughton  is a village and civil parish between Studley  to the north and Alcester,  to the south, in the county of Warwickshire, England. The village lies  south of Birmingham on the Birmingham–Alcester A435 road, which here follows the line of the Roman road, Icknield Street. The village is primarily noted as being the location of the National Trust property, Coughton Court, which lies 400 yards to the east of the A435. The population of the parish according to national censuses was 139 in 2001, increasing to 157 in 2011 and 169 in 2021.\nEtymology\nThe name may suggest a settlement or farm known for the hunting of woodcock or game birds. However, the prefix Cock- is not uncommon in place-names, but its meaning is doubtful. The name is spelt ‘Coctune’ in the Domesday Book of 1086. It is generally found on or near hills, say Napier and Stevenson. It may be a personal name, Cocca; it may be the name of the bird; or it may (as in Old Norse) mean 'throat,' which would geographically be 'a narrow gorge, valley, or pass'.\nHistory\nThe manor of Coughton is recorded in the Domesday Book when it was one of 70 manors in Warwickshire held by Thorkell, or Turchill, of Warwick later surnamed Arden. Thorkell was an Anglo-Saxon, his father, a descendant of Vikings, was Sheriff of Warwick under Edward the Confessor. Thorkell refused to support Harold Godwinson, his relatives the earls of Mercia, Leofric and his successors Ælfgar and Morkere, had constantly been at arms against Harold whom Mercia had never really recognised as King of England and he therefore received the gratitude of William the Conqueror, allowing him to retain his lordship and many landholdings in Warwickshire. Under orders from William he constructed a ditch with an entrance gate around the town of Warwick as part of William's campaign in 1068–69 known as the Harrying of the North. Thorkell was one of only two Anglo-Saxons in the country south of the River Tees holding an estate of baronial dimensions directly from the King after the Conquest.\nThe record reads \"Land of Turchill of Warwick, in Ferncombe Hundred, William holds 4 hides in (Coctune) Coughton. Land for 6 ploughs. 2 freemen, 7 smallholders and 4 slaves with 3 ploughs. A mill at 32d; in Warwick 1 house which pays 8d; meadow, 10 acres; woodland 6 furlongs long and 4 furlongs wide; pasture land, 50 pigs. The value was 40s; later 20s; now 50s. Untan held it freely.\" However, soon after 1086 William II created the earldom of Warwick for Henry de Beaumont, who changed his name to Henry de Newburgh, appointed him Constable of Warwick Castle and gave him the great estate of Thorkell of Arden. It is not known why Thorkell was dispossessed, he may have only been granted a lifetime tenure of his lands the estate passing to the Crown on his death or it may have been that his son died before him and that he left no direct heir. His family, the Ardens however, held land from the Earls of Warwick for another 200 years.\nGovernance\nCoughton is part of the Sambourne ward of Stratford-on-Avon District Council and represented by Councillor Justin Kerridge, Conservative [http://democracy.stratford.gov.uk/mgMemberIndex.aspx?bcr=1]. Nationally it is part of Stratford-on-Avon, whose current MP is Manuela Perteghella of the Liberal Democrat Party. Prior to Brexit in 2020 it was part of the West Midlands electoral region of the European Parliament.\nNotable buildings\nThe village is dominated by the stately home of Coughton Court, which lies to the east of the A435 road. The parish church which is dedicated to St. Peter and is situated next to Coughton Court, consists of a chancel, north and south chapels, nave, north and south aisles, south porch, and west tower, with walls of rubble and ashlar. The building of the present church is attributed to Sir Robert Thockmorton between 1486 and 1518 but parts of the tower are older and the plan of the nave follows the plan of an earlier structure; the church was included in the original endowment of Studley Priory at its foundation by Peter Corbucion in the 12th century. At the Dissolution of the Monasteries the church passed to Sir George Throckmorton, the then steward of the priory. The nave contains the table tomb of Sir Robert Throckmorton, topped by a large slab of black marble, but his remains do not lie here and the tomb is occupied by a later Sir Robert Throckmorton who died in 1791.\nSir Robert died on pilgrimage to the Holy Land in 1518, leaving in his will money for the depiction of a Doom in stained glass in the East window, the Seven Sacraments in the North chapel and the Seven Acts of Mercy in the South chapel. Fragments of these appear to be scattered amongst the jumbled glass in some of the aisle windows. The survey of the clergy by the puritans in 1586 described the then vicar, Thomas Penford as; \"dumbe & vnlearned, a verie aged man, he can scarce reade, yet he hath learning enough for 2 benefices; for he reapeth the fruite of Studley & Coughton both, he hath of late gotten him a certaine hireling to serue his turne at both places, one Robt. Cathell a seelie Welshman that can scarce reade English distinctlie. The valew of both is better then xx “by the yeare”.\nTransport\nThe village used to have Coughton railway station opened by the Evesham and Redditch Railway, and joining the Midland Railway, it became part of the London, Midland and Scottish Railway during the Grouping of 1923. The station was closed in 1952 and the Gloucester Loop Line in 1962, following the Beeching Axe report, the line has since been dismantled.[http://www.subbrit.org.uk/sb-sites/stations/c/coughton/index.shtml Subterranea Britannica: SB-Sites: Coughton Station] The nearest railway station is now .\nEducation\nLocated in Coughton Lane is Coughton Church of England Primary School with 139 children on its roll.\n{| class=\"wikitable sortable\" style=\"font-size:90%;width:90%;border:0px;text-align:left;line-height:150%;\"\n! style=\"background: #99CCCC; color: #000080\" height=\"17\" width=\"175\" | School\n! style=\"background: #99CCCC; color: #000080\" height=\"17\" width=\"130\" | Compulsory education stage\n! style=\"background: #99CCCC; color: #000080\" height=\"17\" width=\"200\" | Ofsted details\n|-\n!  Coughton Church of England Primary School\n| Primary\n|\n|-\n|}\nGeography\nThe River Arrow flows through the eastern part of the parish and the Ridgeway forms the western boundary. The river valley lies low, at no point more than  above sea-level, with gentle hills east and west. Geologically, Coughton falls within the Triassic area of Keuper red marls, with sandstone and pebbles in the river bed. The sub-soil is clay and gravel and anciently there were marl-pits but nothing now is worked. The greater part of the land is in pasture, with some woodland.\nReferences\nExternal links"
    }
  ]
}