{
  "content": [
    {
      "type": "text",
      "text": "# Coulson, Queensland\n\n| pop                 = 168\n| pop_year            =\n| pop_footnotes       =\n| established         =\n| postcode            = 4310\n| area                = 32.7\n| timezone            = AEST\n| utc                 = +10:00\n| dist1               = 7.5\n| dir1                = NE\n| location1           = Boonah\n| dist2               = 32.1\n| dir2                = W\n| location2           = Beaudesert\n| dist3               = 44.6\n| dir3                = S\n| location3           = Ipswich\n| dist4               = 83.8\n| dir4                = SW\n| location4           = Brisbane\n| elevation           =\n| maxtemp             =\n| mintemp             =\n| rainfall            =\n| lga                 = Scenic Rim Region\n| stategov            = Scenic Rim\n| fedgov              = Blair\n| near-n              = Wyaralong\n| near-ne             = Wyaralong\n| near-e              = Bromelton\n| near-se             = Allandale\n| near-s              = Allandale\n| near-sw             = Boonah\n| near-w              = TeviotvilleHoya\n| near-nw             = Roadvale\n}}\nCoulson is a rural locality in the Scenic Rim Region, Queensland, Australia. In the , Coulson had a population of 168 people.\nGeography\nIpswich – Boonah Road (State Route 93) runs through from north-west to south-west. Beaudesert–Boonah Road (State Route 90) runs east from an intersection with this road, exiting to the north-east.\nCoulson is crossed by Teviot Brook, a tributary of the Logan River, at the southern end of the Flinders Peak Group.  Part of the southern boundary follows Sandy Creek and includes the elevated slopes of Goans Hill () which rises to .\nMuch of the land is used for agricultural purposes.\nHistory\nTeviotville Provisional School opened on 3 October 1881 and became Teviotville State School on 18 January 1886. In 1903, it was renamed Coulson State School. It closed in 1993. It was at 3522 Ipswich Boonah Road ().\nDemographics\nAt the , Roadvale and the surrounding area had a population of 254.\nIn the , Coulson had a population of 195 people. The locality contained 71 households, in which 51.3% of the population were males and 48.7% of the population were females, with a median age of 43, 5 years above the national average. The average weekly household income was $1,531, $93 above the national average. 1.5% of Coulson's population were either of Aborigional or Torres Strait Islander descent. 67.1% of the population aged 15 or over were either registered or de facto married, while 32.9% of the population were not married. 33.0% of the population were currently attending some form of a compulsory education. The most common nominated ancestries were Australian (33.5%), English (31.5%) and German (12.7%), while the most common country of birth was Australia (92.4%), and the most commonly spoken language at home was English (94.3%). The most common nominated religions were Anglican (22.6%), Anglican (15.3%) and the Uniting Church (14.4%). The most common occupation was a technician/trades worker (22.7%) and the majority/plurality of residents worked 40 or more hours per week (54.0%).\nIn the , Coulson had a population of 168 people.\nEducation\nThere are no schools in Coulson. The nearest government primary schools are Roadvale State School in neighbouring Roadvale to the north-west and Boonah State School in neighbouring Boonah to the south-west. The nearest government secondary school is Boonah State High School, also in Boonah.\nFacilities\nCoulson-Teviotville Cemetery is on the Ipswich Boonah Road (). It is managed by the Scenic Rim Regional Council, but no further burials are permitted.\nReferences"
    }
  ]
}