{
  "content": [
    {
      "type": "text",
      "text": "# Council of People's Commissars of the Russian Soviet Federative Socialist Republic\n\n(1918–1946)\n| headquarters         = Moscow, Russian SFSR, Soviet Union\n| coordinates          =\n| motto                =\n| employees            =\n| budget               =\n| minister1_name       =\n| minister1_pfo        =\n| minister2_name       =\n| minister2_pfo        =\n| deputyminister1_name =\n| deputyminister1_pfo  =\n| deputyminister2_name =\n| deputyminister2_pfo  =\n| chief1_name          = Vladimir Lenin (first),  Alexei Kosygin (last)\n| chief1_position      =\n| chief2_name          =\n| chief2_position      =\n| public_protector     =\n| deputy               =\n| parent_department    =\n| parent_agency        = All-Russian Central Executive Committee (1918–1937),  Supreme Council of the Russian Soviet Federated Socialist Republic (1937–1946)\n| parent_agency_type   =\n| child1_agency        =\n| child2_agency        =\n| keydocument1         =\n| website              =\n| agency_id            =\n| map                  = Soviet_Union_-_Russian_SFSR_(1940).svg\n| map_size             =\n| map_caption          = Territory of the Russian Soviet Federative Socialist Republic (1940–1944)\n| footnotes            =\n| embed                =\n}}\nThe '''Council of People's Commissars of the Russian Soviet Federative Socialist Republic''' was the government of Soviet Russia from November 1917 to March 1946. It was established by the Second All-Russian Congress of Soviets of Workers', Soldiers', and Peasants' Deputies on November 9, 1917 \"as an interim workers' and peasants' government\" under the name of the Council of People's Commissars, which was used before the adoption of the Constitution of the Russian Socialist Federative Soviet Republic of 1918.\nSince 1918, the formation of the Council of People's Commissars of the Russian Socialist Federative Soviet Republic was the prerogative of the All-Russian Central Executive Committee, and since 1937, the Supreme Council of the Russian Soviet Federative Socialist Republic. The Council of People's Commissars of the Russian Soviet Federative Socialist Republic was formed from the people's commissars – the leaders of the People's Commissariats of Soviet Russia – headed by the chairman of the Council of People's Commissars of the Russian Soviet Federative Socialist Republic. Similar Councils of People's Commissars were created in other Soviet republics.\nBy the law of the Soviet Union of March 15, 1946 and the Decree of the Presidium of the Supreme Council of the Russian Soviet Federative Socialist Republic of March 23 of the same year, the Council of People's Commissars of the Russian Soviet Federative Socialist Republic was transformed into the Council of Ministers of the Russian Soviet Federative Socialist Republic.\nOrigin of name\nIn his memoirs, Leon Trotsky ascribes the name \"Council of People's Commissars\" to himself. According to the memoirs of Vladimir Milyutin, the name \"People's Commissar\" was proposed by Trotsky, and Kamenev proposed the government as the \"Council of People's Commissars\". Some have also claimed that the authorship of the term was first coined by Vladimir Antonov-Ovseyenko.\nAt the same time, from Lenin's notes written no later than October 25, 1917:\nIt follows that the name \"commissars\" (etymologically \"the heads of commissions\"), as a replacement for the term \"ministers\", even earlier appeared in the outline of the organization of a new apparatus of government of the future head of the Council of People's Commissars. In the same document, it was planned to create other central government bodies in the rank of commissions (commissions of a revolutionary order, commissions of legislative assumptions, and a number of commissions in various branches of the state life of the country).\nHistory\nProvisional Workers' and Peasants' Government\nImmediately before the seizure of power on the day of the revolution, the Central Committee of the Bolsheviks instructed Kamenev and Berzin to make political contact with the Left Socialist Revolutionaries and begin negotiations with them on the composition of the future government. During the work of the Second Congress of Soviets, the Bolsheviks proposed that the Left Socialist Revolutionaries enter the government, but they refused. The factions of the Right Socialist Revolutionaries and Mensheviks left the Second Congress of Soviets at the very beginning of its work – before the formation of the government. The Bolsheviks were forced to form a one-party government.\nThe Council of People's Commissars was formed in accordance with the \"[https://ru.wikisource.org/wiki/Декрет_об_учреждении_Совета_Народных_Комиссаров Decree on the Establishment of the Council of People's Commissars]\" adopted by the Second All-Russian Congress of Soviets of Workers' and Soldiers' Deputies on October 27, 1917 (O.S.). The decree began with the words:\nAn Attempt at All-Socialist Government\nNegotiation in November\nIn connection with the demarche of the executive committee of the railway trade union, Vikzhel, who did not recognize the October Revolution, and demanded the formation of a \"homogeneous socialist government\" of representatives of all socialist parties, the post of People's Commissar of Rail Affairs remained unsubstituted.\nThe Mensheviks, SRs, and Bolsheviks failed to reach an agreement in December 1917 to form a coalition administration.\nLeft SRs-Bolsheviks Coalition\nIn December, Six representatives from the Left SR entered the government, They are\n* Andrei Kolegayev, People's Commissar of Agriculture\n* Isaac Steinberg, People's Commissar of Justice\n* Prosh Proshian, People's Commissar of Post and Telegraph\n* Vladimir Trutovsky, People's Commissar of Local Government\n* Vladimir Karelin, People's Commissar of State Property\n* Mikhail Algasov, People's Commissar without Portfolio\nFormal Government of RSFSR\nSubsequently, in January 1918, the Bolsheviks managed to split the railway union by forming the Vikzhedor Executive Committee parallel to Vikzhel, which consisted mainly of Bolsheviks and Left Socialist Revolutionaries. By March 1918, Vikzhel's resistance was finally broken, and the main powers of both Vikzhel and Vikzhedor were transferred to the People's Commissariat of Railways.\nThe Council of People's Commissars lost the character of an interim governing body after the dissolution of the Constituent Assembly, which was legislated by the Constitution of the Russian Socialist Federative Soviet Republic of 1918. The All-Russian Central Executive Committee received the right to form the Council of People's Commissars; the Council of People's Commissars was the general management body for the affairs of the Russian Socialist Federative Soviet Republic authorized to issue decrees, and the All-Russian Central Executive Committee was entitled to cancel or suspend any decision or decision of the Council of People's Commissars.\nThe issues considered by the Council of People's Commissars were decided by a simple majority of votes. The meetings were attended by members of the government, chairman of the All-Russian Central Executive Committee, executive manager and secretaries of the Council of People's Commissars, representatives of departments.\nEnd of the Left SRs-Bolsheviks Coalition\nBolsheviks' One-Party Government\nThe permanent working body of the Council of People's Commissars of the Russian Socialist Federative Soviet Republic was the Department of Affairs, which prepared questions for meetings of the Council of People's Commissars and its standing commissions, and received delegations. The staff of the executive administration in 1921 consisted of 135 people (according to the Central State Archive of the October Revolution of the Soviet Union).\nBy the law of the Soviet Union of March 15, 1946 and the Decree of the Presidium of the Supreme Council of the Russian Soviet Federative Socialist Republic of March 23, 1946, the Council of People's Commissars of the Russian Soviet Federative Socialist Republic was transformed into the Council of Ministers of the Russian Soviet Federative Socialist Republic. On March 18, the last decree of the government of the Russian Soviet Federative Socialist Republic was issued with the name \"Council of People's Commissars\". On February 25, 1947, the corresponding amendments were made to the Constitution of the Soviet Union, and on March 13, 1948, the Constitution of the Russian Soviet Federative Socialist Republic.\nLegislative framework of the Council of People's Commissars of the Russian Soviet Federative Socialist Republic\nAccording to the Constitution of the Russian Socialist Federative Soviet Republic of July 10, 1918, the activities of the Council of People's Commissars consisted of:\n*Management of the general affairs of the Russian Socialist Federative Soviet Republic;\n*The management of individual branches of management (Articles 35, 37);\n*The promulgation of legislative acts and the adoption of measures \"necessary for the correct and rapid course of public life\" (Article 38).\nThe Council of People's Commissars informed the All-Russian Central Executive Committee of all decisions and decisions adopted (Article 39), which had the right to suspend and annul a resolution or decision of the Council of People's Commissars (Article 40).\nIt was created 18 people's commissariats.\nThe following is a list of People's Commissariats of the Council of People's Commissars of the Russian Socialist Federative Soviet Republic according to the Constitution of the Russian Socialist Federative Soviet Republic of July 10, 1918:\n*Of Foreign Affairs;\n*Of Military Affairs;\n*Of Maritime Affairs;\n*Of Domestic Affairs;\n*Justice;\n*Labour;\n*Social Security;\n*Enlightenment;\n*Mail and Telegraphs;\n*Of National Affairs;\n*Of Financial Affairs;\n*Ways of Communication;\n*Agriculture;\n*Trade and Industry;\n*Food;\n*State Control;\n*Supreme Council of the National Economy;\n*Health Care.\nAt each people's commissar and under his chairmanship, a collegium was formed, the members of which were approved by the Council of People's Commissars (Article 44).\nThe People's Commissar had the right to single-handedly make decisions on all issues under the jurisdiction of the commissariat led by him, bringing them to the attention of the board (Article 45).\nWith the formation of the Soviet Union in December 1922 and the creation of an all-Union government, the Council of People's Commissars of the Russian Socialist Federative Soviet Republic became the executive and administrative body of state power of the Russian Socialist Federative Soviet Republic. The organization, composition, competence and procedure of the Council of People's Commissars were determined by the Constitution of the Soviet Union of 1924 and the Constitution of the Russian Socialist Federative Soviet Republic of 1925. From that moment, the composition of the Council of People's Commissars was changed in connection with the transfer of a number of powers to the Union departments. 11 republican people's commissariats were established:\n*Domestic Trade;\n*Labour;\n*Finance;\n*Workers and Peasants Inspection;\n*Internal Affairs;\n*Justice;\n*Enlightenment;\n*Health Care;\n*Agriculture;\n*Social Security;\n*Supreme Council of the National Economy.\nThe Council of People's Commissars of the Russian Socialist Federative Soviet Republic now included with a decisive or deliberative vote authorized representatives of the People's Commissariats of the Soviet Union under the Government of the Russian Socialist Federative Soviet Republic. The Council of People's Commissars of the Russian Socialist Federative Soviet Republic, in turn, allocated a permanent representative to the Council of People's Commissars of the Soviet Union (according to information to the Legislative Assembly, 1924, No. 70, Article 691).\nSince February 22, 1924, the Council of People's Commissars of the Russian Socialist Federative Soviet Republic and the Council of People's Commissars of the Soviet Union had a single Office of Affairs (based on materials from the Central State Archive of the October Revolution of the Soviet Union).\nWith the adoption of the Constitution of the Russian Soviet Federative Socialist Republic of January 21, 1937, the Council of People's Commissars of the Russian Soviet Federative Socialist Republic was accountable only to the Supreme Council of the Russian Soviet Federative Socialist Republic, between its sessions, to the Presidium of the Supreme Council of the Russian Soviet Federative Socialist Republic.\nSince October 5, 1937, the composition of the Council of People's Commissars of the Russian Soviet Federative Socialist Republic totaled 13 people's commissariats (data from the Central State Archive of the Russian Soviet Federative Socialist Republic):\n*Food Industry;\n*Light Industry;\n*Forest Industry;\n*Agriculture;\n*Grain Soviet Farms;\n*Livestock Soviet Farms;\n*Finance;\n*Domestic Trade;\n*Justice;\n*Health Care;\n*Enlightenment;\n*Local Industry;\n*Communal Economy;\n*Social Security.\nThe Council of People's Commissars also included the chairman of the State Planning Committee of the Russian Soviet Federative Socialist Republic and the head of the Department of Arts under the Council of People's Commissars of the Russian Soviet Federative Socialist Republic.\nFirst composition of the Council of People's Commissars of Soviet Russia\n*Chairman of the Council of People's Commissars – Vladimir Lenin;\n*People's Commissar of Internal Affairs – Alexey Rykov;\n*People's Commissar of Agriculture – Vladimir Milyutin;\n*People's Commissar of Labour – Alexander Shlyapnikov;\n*People's Commissariat of Military and Naval Affairs – the committee, composed of: Vladimir Ovseenko (Antonov) (in the text of the Decree on the Formation of the Council of People's Commissars – Avseenko), Nikolai Krylenko and Pavel Dybenko;\n*People's Commissar of Trade and Industry – Victor Nogin;\n*People's Commissar of Public Education – Anatoly Lunacharsky;\n*People's Commissar of Finance – Ivan Skvortsov (Stepanov);\n*People's Commissar of Foreign Affairs – Lev Bronstein (Trotsky);\n*People's Commissar of Justice – Georgy Oppokov;\n*People's Commissar of Food – Ivan Theodorovich;\n*People's Commissar of Posts and Telegraphs – Nikolai Avilov (Glebov);\n*People's Commissar of Nationalities – Joseph Stalin;\n*The post of People's Commissar of Rail Affairs remained temporarily not replaced.\nThe vacant post of People's Commissar for Rail Affairs later took Mark Elizarov. On November 12, in addition to the Decree establishing the Council of People's Commissars, Alexandra Kollontai, the first woman minister in the world, was appointed People's Commissar of State Charity. On November 19, Edward Essen was appointed Commissar of State Control.\nThe historical first composition of the Council of People's Commissars was formed in the context of a tough struggle for power between Vikzhel and Bolsheviks.\nThe People's Commissariat of Military and Naval Affairs was formed as a collegium, composed of Antonov-Ovseenko, Krylenko, Dybenko. By April 1918, this committee virtually ceased to exist.\nAccording to the memoirs of the first People's Commissar of Education Anatoly Lunacharsky, the first composition of the Council of People's Commissars was largely random, and the discussion of the list was accompanied by Lenin's comments: \"if we are unsuitable, we will be able to change\". As the first People's Commissar of Justice, the Bolshevik Lomov (Georgy Oppokov) wrote, his knowledge of justice included mainly detailed knowledge of the Tsar's prisons with the features of the regime, \"we knew where they beat, how they beat, where and how they put in punishment cells, but we didn't know how to rule the state\".\nMany People's Commissars of the first composition of the Council of People's Commissars of Soviet Russia were repressed in the 1930s.\nChairmen of the Council of People's Commissars of the Russian Soviet Federative Socialist Republic\n*Vladimir Lenin (November 9, 1917 – January 21, 1924; after the assassination attempt on Lenin, in August–September 1918, the duties of the chairman were performed by Yakov Sverdlov);\n*Alexey Rykov (February 2, 1924 – May 18, 1929);\n*Sergey Syrtsov (May 18, 1929 – November 3, 1930);\n*Daniil Sulimov (November 3, 1930 – July 22, 1937);\n*Nikolai Bulganin (July 22, 1937 – September 17, 1938);\n*Vasily Vakhrushev (July 29, 1939 – June 2, 1940);\n*Ivan Khokhlov (June 2, 1940 – June 23, 1943);\n*Konstantin Pamfilov (acting from May 5, 1942, to May 2, 1943);\n*Alexei Kosygin (June 23, 1943 – March 15, 1946).\nPeople's Commissars\nVice-chairmen:\n*Alexey Rykov (end of May 1921 – ?);\n*Alexander Tsyurupa (December 5, 1921 – ?);\n*Lev Kamenev (January 1922 – ?);\n*Turar Ryskulov (June 1926 – May 1937).\nForeign Affairs:\n*Leon Trotsky (November 8, 1917 – April 8, 1918);\n*Georgy Chicherin (May 30, 1918 – July 6, 1923);\n*Anatoly Lavrentiev (1944 – March 15, 1946).\nMilitary and Naval Affairs:\n*Vladimir Antonov-Ovseenko (November 8, 1917 – ?);\n*Nikolay Krylenko (November 8, 1917 – ?);\n*Pavel Dybenko (November 8, 1917 – March 18, 1918);\n*Nikolay Podvoisky (November 1917 – March 1918);\n*Leon Trotsky (April 8, 1918 – January 26, 1925).\nInternal Affairs:\n*Alexey Rykov (November 8, 1917 – November 17, 1917);\n*Grigory Petrovsky (November 30, 1917 – March 25, 1919);\n*Felix Dzerzhinsky (March 30, 1919 – July 6, 1923).\nJustice:\n*Georgy Lomov-Oppokov (November 8, 1917 – November 16, 1917);\n*Peter Stuchka (November 16, 1917 – December 9, 1917);\n*Isaac Steinberg (December 9, 1917 – March 18, 1918);\n*Peter Stuchka (March 18, 1918 – August 22, 1918);\n*Dmitry Kursky (August 22, 1918 – 1928).\nLabour:\n*Alexander Shlyapnikov (November 8, 1917 – October 8, 1918);\n*Vasily Schmidt (October 8, 1918 – November 4, 1919 and April 26, 1920 – November 29, 1920).\nState Charity (from April 26, 1918 – Social Security; People's Commissariat of Social Security on November 4, 1919, combined with the People's Commissariat of Labor, on April 26, 1920, divided):\n*Alexandra Kollontai (November 12, 1917 – March 1918);\n*Alexander Vinokurov (March 1918 – November 4, 1919; April 26, 1919 – April 16, 1921);\n*Nikolai Milyutin (Acting People's Commissar, June – July 6, 1921).\nEnlightenment:\n*Anatoly Lunacharsky (November 8, 1917 – September 12, 1929).\nMail and Telegraphs:\n*Nikolai Glebov (Avilov) (November 8, 1917 – December 22, 1917);\n*Prosh Proshyan (December 22, 1917 – March 18, 1918);\n*Vadim Podbelsky (April 11, 1918 – February 25, 1920);\n*Artemy Lyubovich (March 24 – May 26, 1921);\n*Valerian Dovgalevsky (May 26, 1921 – July 6, 1923).\nNationalities:\n*Joseph Stalin (November 8, 1917 – July 6, 1923).\nFinance:\n*Ivan Skvortsov-Stepanov (November 8, 1917 – November 12, 1917);\n*Vyacheslav Menzhinsky (November 12, 1917 – March 21, 1918);\n*Isidor Gukovsky (April – August 16, 1918);\n*Nikolay Krestinsky (August 16, 1918 – October 1922);\n*Grigory Sokolnikov (November 23, 1922 – January 16, 1923).\nWays of Communication:\n*Mark Elizarov (November 21, 1917 – January 20, 1918);\n*Alexey Rogov (February 24, 1918 – May 9, 1918);\n*Peter Kobozev (May 9, 1918 – June 1918);\n*Vladimir Nevsky (July 25, 1918 – March 15, 1919);\n*Leonid Krasin (March 30, 1919 – March 20, 1920);\n*Leon Trotsky (March 20, 1920 – December 10, 1920);\n*Alexander Emshanov (December 20, 1920 – April 14, 1921);\n*Felix Dzerzhinsky (April 14, 1921 – July 6, 1923).\nAgriculture:\n*Vladimir Milyutin (November 8, 1917 – November 17, 1917);\n*Andrey Kolegaev (December 7, 1917 – March 18, 1918);\n*Semyon Sereda (April 3, 1918 – February 10, 1921);\n*Valerian Obolensky (Deputy People's Commissar, March 24, 1921 – January 18, 1922);\n*Vasily Yakovenko (January 18, 1922 – July 7, 1923).\nTrade and Industry:\n*Victor Nogin (November 8, 1917 – November 17, 1917);\n*Alexander Shlyapnikov (December 2, 1917 – January 1918);\n*Vladimir Smirnov (February 7, 1918 – March 18, 1918);\n*Mechislav Bronsky (March 18, 1918 – November 12, 1918);\n*Leonid Krasin (November 12, 1918 – July 6, 1923).\nFood:\n*Ivan Theodorovich (November 8, 1917 – December 31, 1917);\n*Alexander Schlichter (December 31, 1917 – February 25, 1918);\n*Alexander Tsyurupa (February 25, 1918 – December 12, 1921);\n*Nikolai Bryukhanov (December 12, 1921 – July 6, 1923).\nState Control of the Russian Socialist Federative Soviet Republic:\n*Eduard Essen (December 2, 1917 – May 1918);\n*Karl Lander (May 9, 1918 – March 25, 1919);\n*Joseph Stalin (March 30, 1919 – February 7, 1920).\nHealth:\n*Nikolay Semashko (July 11, 1918 – January 25, 1930).\nWorkers and Peasants Inspection:\n*Joseph Stalin (February 24, 1920 – April 25, 1922);\n*Alexander Tsyurupa (April 25, 1922 – July 6, 1923).\nState Property:\n*Vladimir Karelin (December 22, 1917 – March 18, 1918);\n*Pavel Malinovsky (March 18, 1918 – July 11, 1918).\nLocal Government:\n*Vladimir Trutovsky (January 1, 1918 – March 18, 1918).\nSupreme Council of the National Economy (chairpersons):\n*Valerian Obolensky (December 15, 1917 – March 22, 1918);\n*Alexey Rykov (April 3, 1918 – May 28, 1921);\n*Vladimir Milyutin (interim) (March 23 – May 28, 1921);\n*Peter Bogdanov (May 28, 1921 – May 9, 1923);\n*Alexey Rykov (May 9, 1923 – February 2, 1924);\n*Felix Dzerzhinsky (February 2, 1924 – July 20, 1926);\n*Semyon Lobov (1926–1930).\nSubordinate bodies\n*The Financial Three (May 2, 1922 – May 29, 1922);\n*Finance Committee (1922–1923).\nAssessments\nSocial composition\nResearcher Mikhail Voslensky in his fundamental work \"Nomenclature\" notes that the \"social origin\" of the first composition of the Council of People's Commissars was of little use for the Bolshevik party, which declared itself \"the vanguard of the working class\". In fact, the first composition of the Council of People's Commissars was almost entirely intelligent, and in fact there were only two out of 16 workers in it: Alexander Shlyapnikov and Victor Nogin. In addition, in the first composition of the Council of People's Commissars, there were five nobles: Vladimir Lenin, Anatoly Lunacharsky, Vladimir Antonov-Ovseenko, Ivan Teodorovich and Georgy Oppokov. Trotsky's father was, according to the Soviet classification, a \"fist\", and Stalin a craftsman, that is, they both belonged, in the Soviet classification, to \"petty-bourgeois elements\". This state of affairs created the ground for the emergence of the so-called \"Labour Opposition\" at the end of the Civil War, which also expressed irritation that the workers were actually ruled by intellectuals on their behalf; oppositionists have accused of \"degenerating the party leaders\" and their \"isolation from the party masses\" (see also Makhaevschina). At the 10th Congress of the Russian Communist Party (Bolsheviks), the \"Workers' Opposition\" was accused of:\n}}\nNational composition\nThe national composition of the Council of People's Commissars of Soviet Russia was a subject of speculation.\nVlasovets Andrey Dikiy in his work \"Jews in Russia and the Soviet Union\" claims that the composition of the Council of People's Commissars was allegedly as follows:\nYuri Emelyanov in his work \"Trotsky. Myths and Personality\" provides an analysis of this list. The analysis shows that the \"Jewish\" character of the Council of People's Commissars was obtained through fraud: it was not the first composition of the Council of People's Commissars that was published in the decree of the Second Congress of Soviets, but only those people's commissariats whose heads either were Jews. So, Leo Trotsky, who was appointed to this post on April 8, 1918, is mentioned as the People's Commissar of Military and Naval Affairs, and Alexander Schlichter, who really held this post until February 25, 1918, was mentioned as the People's Commissar of Food (here: \"supply\"), by the way, he was not a Jew either (Schlichter – Polish landowners of German origin). At the time when Trotsky really became the People's Commissar of Military and Naval Affairs, Alexander Tsyurupa instead of Schlichter already became the People's Commissar of Food.\nAnother method of fraud is the invention of a number of never-existing people's commissariats. So, Andrei Dikiy in the list of people's commissariats mentioned the never-existent people's commissariats of cults, of elections, of refugees, of hygiene. Volodarsky is mentioned as the People's Commissar of the Press; in fact, he was indeed the commissar of the press, propaganda and agitation, but not the people's commissar, a member of the Council of People's Commissars (that is, in fact the government), but the commissar of the Union of Northern Communes (regional union of Soviets), an active conductor of the Bolshevik Press Decree.\nAnd, conversely, the list does not include, for example, the really existing People's Commissariat of Railways and the People's Commissariat of Posts and Telegraphs. As a result, Andrey Dikiy does not even agree on the number of people's commissariats: he mentions the number 20, although there were 14 people in the first composition, in 1918 the number was increased to 18.\nSome posts are indicated with errors. So, the Chairman of the Petrograd Council Grigory Zinoviev was mentioned as the People's Commissar of Internal Affairs, although he never held this position. The People's Commissar of Posts and Telegraphs Proshyan (here – \"Protian\") is attributed the leadership of \"agriculture\".\nJewish identity are arbitrarily attributed to a number of people, for example, Russian nobleman Anatoly Lunacharsky, Estonian Jan Anvelt, Russified Germans Vasily Schmidt, Alexander Schlichter, Latvian Karl Landers and others.\nSome individuals are generally fictitious: Spitsberg (perhaps referring to the investigator of the 8th Liquidation Department of the People's Commissariat of Justice Ivan Spitsberg, who was famous for his aggressive atheistic position), Lilina-Knigissen (possibly referring to actress Maria Lilina, who never entered the government, or Zlata Lilina (Bernshtein), who was also not a member of the Council of People's Commissars, but who worked as the head of the Department of Public Education at the executive committee of the Petrograd Council), Kaufman (possibly referring to the constitutional democrat Alexander Kaufman, who, according to some sources, was involved by the Bolsheviks as an expert in the development of land reform but never entered the Council of People's Commissars).\nAlso on the list are two leftist Socialist Revolutionaries whose rejection of Bolshevism is not indicated at all: People's Commissar of Justice Isaac Steinberg (referred to as \"I. Steinberg\") and People's Commissar of Posts and Telegraphs Prosh Proshyan, referred to as \"Protian – Agriculture\". Both politicians reacted extremely negatively to post-October Bolshevik politics. Prior to the revolution, Isidor Gukovsky was a Menshevik \"liquidator\" and he accepted the post of People's Commissar of Finance only under the pressure of Lenin.\nLiterary critic Vadim Kozhinov wrote about the membership in the Council of People's Commissars of one of the few Jews there, Leon Trotsky, objecting to the philosopher Vadim Rogovin:\n, Vadim Kozhinov, Chapter 13 \"What Was the Role of the Jews in Post-Revolutionary Russia?\", Page 420\n}}\nA similar point of view was shared by Igor Shafarevich.\nIn 2013, speaking about the Schneerson Collection at the Moscow Jewish Museum and the Center for Tolerance, Russian President Vladimir Putin noted that \"The decision to nationalize the library was made by the first Soviet government, and Jews were approximately 80–85% members\". According to historian Vladimir Ryzhkov, Putin's ignorant statement about the predominance of Jews in the Council of People's Commissars is due to the fact that \"during the years of perestroika, he read the tabloid press\". Some media outlets also criticized the statements of the President of the Russian Federation. So the editors of the newspaper Vedomosti, condemning the head of state for marginality, posted the following statistics:\nReferences\nSources\n*Figures of the Soviet Union and the Revolutionary Movement of Russia – Moscow: Soviet Encyclopedia, 1989 – Pages 826–827\nExternal links\n*[https://knigipoistcccp.livejournal.com/8372.html Decrees of the Soviet Government. Volume 1. October 25, 1917 – March 16, 1918]\n*[http://www.praviteli.org/ Rulers of Russia and the Soviet Union, a Biographical and Chronological Directory]\n*[http://scepsis.ru/library/id_1498.html The October Revolution: the Main Event of the 20th Century or a Tragic Mistake?]\n*[https://his95.narod.ru/doc16/d50.htm Decree of the Council of People's Commissars on freedom of Conscience, Church and Religious Societies]\n*[http://2snk.site/ Council of People's Commissars of the Russian Soviet Federative Socialist Republic–Soviet Union: Heads of State Bodies of the Russian Soviet Federative Socialist Republic and the Soviet Union, 1917–1993]"
    }
  ]
}