{
  "content": [
    {
      "type": "text",
      "text": "# Country Music Association Award for Song of the Year\n\nThe following list shows the recipients of the Country Music Association Award for Song of the Year. This Award goes to the songwriter(s) and is for artistic achievement in songwriting. Any Country Music song with original words and music is eligible based upon the song's Country singles chart activity during the eligibility period. It is the sister category to the Country Music Association Award for Single of the Year, which recognizes the artist, producer and engineer.\nIt was first handed out at the inaugural 1967 CMA Awards to Dallas Frazier for his song \"There Goes My Everything\" which had been popularised at that time by Jack Greene. K. T. Oslin became the first woman to win the award in 1988 for her hit \"80's Ladies\". Vince Gill is the most awarded songwriter in the category, with four wins, while two—time winner Alan Jackson and 2014 recipient Shane McAnally hold the record for most nominations, with ten each. Bob McDill and Brad Paisley are the most nominated writers not to win, with six nominations. The current holder of the award is Chris Stapleton and Dan Wilson, who wrote Stapleton's hit \"White Horse\", which won at the 58th Annual Country Music Association Awards in 2024.\nTo date, thirteen men: Dallas Frazier (1967), Bobby Russell (1968), Bob Ferguson (1969), Kris Kristofferson (1970), Freddie Hart (1971—2), Kenny O'Dell (1973), Don Wayne (1974), John Denver (1975), Larry Weiss (1976), Richard Leigh (1978), Don Schlitz (1979), Lee Greenwood (1985) and Vince Gill (1996) and seven women: K.T. Oslin (1988), Gretchen Peters (1995), Jennifer Nettles (2008), Kimberly Perry (2011), Lori McKenna (2016), Taylor Swift (2017) and Tracy Chapman (2023) have won the Song of the Year award with a solo composition.\nTo date, only three songs, \"Easy Loving\",  \"Always on My Mind\" and \"He Stopped Loving Her Today\", have received the award in consecutive years and only Freddie Hart, Don Schlitz, Vince Gill and Lori McKenna have won in consecutive years.\nRecipient\n2020s\n{| class=\"wikitable sortable\"\n! style=\"background:#efefef;\" width=\"5%\" |Year\n! style=\"background:#efefef;\" width=\"10%\" |Songwriter(s)\n! style=\"background:#efefef;\" width=\"10%\" |Title\n! class=\"unsortable\" style=\"background:#efefef;\" width=\"50%\" |Nominees\n|-\n!2025\n|Ella LangleyRiley Green  Aaron Raitiere\n|\"You Look Like You Love Me\"\n|\n* “4x4xU” — Jon Decious, Aaron Raitiere, Lainey Wilson\n* “Am I Okay?” — Megan Moroney, Jessie Jo Dillon, Luke Laird\n* “I Never Lie” — Carson Chamberlain, Tim Nichols, Zach Top\n* “Texas” — Johnny Clawson, Josh Dorr, Kyle Sturrock, Lalo Guzman\n|-\n!2024\n| Chris Stapleton Dan Wilson\n|\"White Horse\"\n|\n* “Burn It Down” — Hillary Lindsey, Parker McCollum, Lori McKenna and Liz Rose\n* “Dirt Cheap — Josh Phillips\n* “I Had Some Help” — Louis Bell, Ashley Gorley, Charlie Handsome, Jonathan Hoskins, Post Malone, Ernest Keith Smith, Morgan Wallen and Chandler Paul Walters\n* \"“The Painter” — Benjy Davis, Kat Higgins, Ryan Larkins\n|-\n! style=\"text-align:center;\" |2023\n|  Tracy Chapman\n|\"Fast Car\"\n|\n* \"Heart Like a Truck\" — Trannie Anderson, Dallas Wilson, Lainey Wilson\n* \"Next Thing You Know\" — Jordan Davis, Greylan James, Chase McGill, Josh Osborne\n* \"Tennessee Orange\" — David Fanning, Paul Jenkins, Megan Moroney, Ben Williams\n* \"Wait in the Truck\" — Renee Blair, Michael Hardy, Hunter Phelps, Jordan Schmidt\n|-\n! style=\"text-align:center;\" |2022\n|  Jacob Davis Jordan Davis Josh Jenkins Matt Jenkins\n| \"Buy Dirt\"\n|\n* \"Never Wanted to Be That Girl\" — Shane McAnally, Ashley McBryde, Carly Pearce\n* \"Sand in My Boots\" — Ashley Gorley, Michael Hardy, Josh Osborne\n* \"Things a Man Oughta Know\" — Jason Nix, Jonathan Singleton, Lainey Wilson\n* \"You Should Probably Leave\" — Chris DuBois, Ashley Gorley, Chris Stapleton\n|-\n! style=\"text-align:center;\" |2021\n| Mike Henderson Chris Stapleton\n|\"Starting Over\"\n|\n* \"Forever After All\" — Luke Combs, Drew Parker, Robert Williford\n* \"The Good Ones\" — Gabby Barrett, Zach Kale, Emily Landis and Jim McCormick\n* \"Hell of A View\" — Casey Beathard, Eric Church, Monty Criswell\n* \"One Night Standards\" — Nicolette Hayford, Shane McAnally, Ashley McBryde\n|-\n! style=\"text-align:center;\" |2020\n| Maren Morris   Jimmy Robbins   Laura Veltz\n|\"The Bones\"\n|\n*\"Bluebird\" — Luke Dick, Natalie Hemby, Miranda Lambert\n* \"Even Though I'm Leaving\" — Luke Combs, Wyatt Durrette, Ray Fulcher\n* \"I Hope You're Happy Now\" — Luke Combs, Randy Montana, Carly Pearce, Jonathan Singleton\n* \"More Hearts Than Mine\" — Ingrid Andress, Sam Ellis, Derrick Southerland\n|}\n2010s\n{| class=\"wikitable sortable\"\n! style=\"background:#efefef;\" width=\"5%\" |Year\n! style=\"background:#efefef;\" width=\"10%\" |Songwriter(s)\n! style=\"background:#efefef;\" width=\"10%\" |Title\n! class=\"unsortable\" style=\"background:#efefef;\" width=\"50%\" |Nominees\n|-\n! style=\"text-align:center;\" |2019\n| Luke Combs Wyatt Durrette Robert Williford\n|\"Beautiful Crazy\"\n|\n* \"Girl\" — Maren Morris, Sarah Aarons and Greg Kurstin\n* \"God's Country\" — Devin Dawson, Jordan Schmidt and Michael Hardy\n* \"Rainbow\" — Natalie Hemby, Shane McAnally and Kacey Musgraves\n* \"Tequila\" — Dan Smyers, Nicolle Galyon and Jordan Reynolds\n|-\n! style=\"text-align:center;\" |2018\n| Mike Henderson Chris Stapleton\n|\"Broken Halos\"\n|\n* \"Body Like a Back Road\" — Zach Crowell, Sam Hunt, Shane McAnally and Josh Osborne\n* \"Drowns the Whiskey\" — Brandon Kinney, Jeff Middleton and Josh Thompson\n* \"Drunk Girl\" — Scooter Carusoe, Tom Douglas and Chris Janson\n* \"Tequila\" — Dan Smyers, Nicolle Galyon and Jordan Reynold\n|-\n! style=\"text-align:center;\" |2017\n| Taylor Swift\n|\"Better Man\"\n|\n* \"Blue Ain't Your Color\" — Hillary Lindsey, Steven Lee Olsen and Clint Lagerberg\n* \"Body Like a Back Road\" — Zach Crowell, Sam Hunt, Shane McAnally and Josh Osborne\n* \"Dirt on My Boots\" — Rhett Akins, Jesse Frasure and Ashley Gorley\n* \"Tin Man\" — Jack Ingram, Miranda Lambert, Jon Randall\n|-\n! style=\"text-align:center;\" |2016\n| Lori McKenna\n|\"Humble and Kind\"\n|\n* \"Burning House\" — Jeff Bhasker, Cam and Tyler Johnson\n* \"Die a Happy Man\" — Sean Douglas, Thomas Rhett and Joe Spargur\n* \"My Church\" — Busbee and Maren Morris\n* \"Record Year\" — Eric Church and Jeff Hyde\n|-\n! style=\"text-align:center;\" |2015\n| Hillary Lindsey Lori McKenna Liz Rose\n|\"Girl Crush\"\n|\n* \"American Kids\" — Rodney Clawson, Luke Laird and Shane McAnally\n* \"Like a Cowboy\" — Randy Houser and Brice Long\n* \"Like a Wrecking Ball\" — Eric Church and Casey Beathard\n* \"Take Your Time\" — Sam Hunt, Shane McAnally and Josh Osborne\n|-\n! style=\"text-align:center;\" |2014\n| Brandy Clark Shane McAnally Kacey Musgraves\n|\"Follow Your Arrow\"\n|\n* \"Automatic\" — Nicolle Galyon, Miranda Lambert and Hillary Lindsey\n* \"Give Me Back My Hometown\" — Eric Church and Luke Laird\n* \"I Don't Dance\" — Lee Brice, Dallas Davidson and Rob Hatch\n* \"I Hold On\" — Dierks Bentley and Brett James\n|-\n! style=\"text-align:center;\" |2013\n| Jessi Alexander Connie Harrington Jimmy Yeary\n|\"I Drive Your Truck\"\n|\n* \"Mama's Broken Heart\" — Brandy Clark, Shane McAnally and Kacey Musgraves\n* \"Merry Go 'Round\" — Shane McAnally, Kacey Musgraves and Josh Osborne\n* \"Pontoon\" — Barry Dean, Natalie Hemby and Luke Laird\n* \"Wagon Wheel\" — Bob Dylan and Ketch Secor\n|-\n! style=\"text-align:center;\" |2012\n| Miranda Lambert Blake Shelton\n|\"Over You\"\n|\n* \"Even If It Breaks Your Heart\" — Will Hoge and Eric Paslay\n* \"God Gave Me You\" — Dave Barnes\n* \"Home\" — Brett Beavers, Dierks Bentley and Dan Wilson\n* \"Springsteen\" — Eric Church, Jeff Hyde and Ryan Tyndell\n|-\n! style=\"text-align:center;\" |2011\n| Kimberly Perry\n|\"If I Die Young\"\n|\n* \"Colder Weather\" — Coy Bowles, Zac Brown, Wyatt Durrette, Levi Lowrey\n* \"Dirt Road Anthem\" — Colt Ford and Brantley Gilbert\n* \"Mean\" — Taylor Swift\n* \"You and Tequila\" — Matraca Berg and Deana Carter\n|-\n! style=\"text-align:center;\" |2010\n| Tom Douglas Allen Shamblin\n|\"The House That Built Me\"\n|\n* \"A Little More Country Than That\" — Rory Feek, Don Poythress and Wynn Varble\n* \"Need You Now\" — Dave Haywood, Josh Kear, Charles Kelley and Hillary Scott\n* \"Toes\" — Zac Brown, Wyatt Durrette, John Hopkins and Shawn Mullins\n* \"White Liar\" — Natalie Hemby and Miranda Lambert\n|}\n2000s\n{| class=\"wikitable sortable\"\n! style=\"background:#efefef;\" width=\"5%\" |Year\n! style=\"background:#efefef;\" width=\"10%\" |Songwriter(s)\n! style=\"background:#efefef;\" width=\"10%\" |Title\n! class=\"unsortable\" style=\"background:#efefef;\" width=\"50%\" |Nominees\n|-\n! style=\"text-align:center;\" |2009\n| Jamey Johnson Lee Thomas Miller James Otto\n|\"In Color\"\n|\n* \"Chicken Fried\" — Zac Brown and Wyatt Durrette\n* \"I Told You So\" — Randy Travis\n* \"People Are Crazy\" — Bobby Braddock and Troy Jones\n* \"Then\" — Chris DuBois, Ashley Gorley and Brad Paisley\n|-\n! style=\"text-align:center;\" |2008\n| Jennifer Nettles\n|\"Stay\"\n|\n* \"Good Time\" — Alan Jackson\n* \"I Saw God Today\" — Rodney Clawson, Monty Criswell and Wade Kirby\n* \"Letter to Me\" — Brad Paisley\n* \"You're Gonna Miss This\" — Ashley Gorley and Lee Thomas Miller\n|-\n! style=\"text-align:center;\" |2007\n| Bill Anderson Buddy Cannon Jamey Johnson\n|\"Give It Away\"\n|\n* \"Anyway\" — Martina McBride, Brad and Brett Warren\n* \"Before He Cheats\" — Josh Kear and Chris Tompkins\n* \"Lost in This Moment\" — Keith Anderson, Rodney Clawson and John Rich\n* \"Stupid Boy\" — Dave Berg, Deanna Bryant and Sarah Buxton\n|-\n! style=\"text-align:center;\" |2006\n| Ronnie Dunn\nCraig Wiseman\n|\"Believe\"\n|\n* \"8th of November\" — Big Kenny and John Rich\n* \"Jesus, Take the Wheel\" — Brett James, Hillary Lindsey and Gordie Sampson\n* \"Tonight I Wanna Cry\" — Monty Powell and Keith Urban\n* \"When I Get Where I'm Going\" — George Teren and Rivers Rutherford\n|-\n! style=\"text-align:center;\" |2005\n| Bill Anderson Jon Randall\n|\"Whiskey Lullaby\"\n|\n* \"Alcohol\" — Brad Paisley\n* \"As Good as I Once Was\" — Sonny Emerick and Toby Keith\n* \"Bless the Broken Road\" — Bobby Boyd, Jeff Hanna and Marcus Hummon\n* \"I May Hate Myself in the Morning\" — Odie Blackman\n* \"Redneck Woman\" — John Rich and Gretchen Wilson\n|-\n! style=\"text-align:center;\" |2004\n| Tim Nichols  Craig Wiseman\n|\"Live Like You Were Dying\"\n|\n* \"Long Black Train\" — Josh Turner\n* \"Redneck Woman\" — John Rich and Gretchen Wilson\n* \"Remember When\" — Alan Jackson\n* \"Whiskey Lullaby\" — Bill Anderson and Jon Randall\n|-\n! style=\"text-align:center;\" |2003\n| Doug Johnson Kim Williams\n|\"Three Wooden Crosses\"\n|\n* \"Beer for My Horses\" — Scotty Emerick and Toby Keith\n* \"Celebrity\" — Brad Paisley\n* \"Have You Forgotten?\" — Wynn Varble and Darryl Worley\n* \"Red Dirt Road\" — Kix Brooks and Ronnie Dunn\n|-\n! style=\"text-align:center;\" |2002\n| Alan Jackson\n|\"Where Were You (When the World Stopped Turning)\"\n|\n* \"Courtesy of the Red, White and Blue (The Angry American)\" — Toby Keith\n* \"Drive (For Daddy Gene)\" — Alan Jackson\n* \"Man of Constant Sorrow\" — Carter Stanley\n* \"I'm Gonna Miss Her (The Fishin' Song)\" — Brad Paisley and Frank Rogers\n|-\n! style=\"text-align:center;\" |2001\n| Larry Cordle Larry Shell\n|\"Murder on Music Row\"\n|\n* \"Born to Fly\" — Sara Evans, Marcus Hummon and Darrell Scott\n* \"How Do You Like Me Now?!\" — Chuck Cannon and Toby Keith\n* \"I'm Already There\" — Gary Baker, Frank J. Myers and Richie McDonald\n* \"One More Day\" — Steven Dale Jones and Bobby Tomberlin\n|-\n! style=\"text-align:center;\" |2000\n| Mark D. Sanders Tia Sillers\n|\"I Hope You Dance\"\n|\n* \"Amazed\" — Marv Green, Chris Lindsey and Aimee Mayo\n* \"Breathe\" — Stephanie Bentley and Holly Lamar\n* \"He Didn't Have to Be\" — Kelley Lovelace and Brad Paisley\n* \"Murder on Music Row\" — Larry Cordle and Larry Shell\n|}\n1990s\n{| class=\"wikitable sortable\"\n! style=\"background:#efefef;\" width=\"5%\" |Year\n! style=\"background:#efefef;\" width=\"10%\" |Songwriter(s)\n! style=\"background:#efefef;\" width=\"10%\" |Title\n! class=\"unsortable\" style=\"background:#efefef;\" width=\"50%\" |Nominees\n|-\n! style=\"text-align:center;\" |1999\n| Beth Nielsen Chapman Robin Lerner Annie Roboff\n|\"This Kiss\"\n|\n* \"Don't Laugh at Me\" — Steve Seskin and Allen Shamblin\n* \"Husbands and Wives\" — Roger Miller\n* \"If You Ever Have Forever in Mind\" — Vince Gill and Troy Seals\n* \"Please Remember Me\" — Rodney Crowell and Will Jennings\n|-\n! style=\"text-align:center;\" |1998\n| Billy Kirsch Steve Wariner\n|\"Holes in the Floor of Heaven\"\n|\n* \"A Broken Wing\" — James House, Phil Barnhart and Sam Hogin\n* \"How Do I Live\" — Diane Warren\n* \"I Just Want to Dance with You\" — Roger Cook and John Prine\n* \"It's Your Love\" — Stephony Smith\n|-\n! style=\"text-align:center;\" |1997\n| Matraca Berg Gary Harrison\n|\"Strawberry Wine\"\n|\n* \"All the Good Ones Are Gone\" — Dean Dillon and Bob McGill\n* \"Blue\" — Bill Mack\n* \"Butterfly Kisses\" — Bob Carlisle and Randy Thomas\n* \"Time Marches On\" — Bobby Braddock\n|-\n! style=\"text-align:center;\" |1996\n| Vince Gill\n|\"Go Rest High on That Mountain\"\n|\n* \"Any Man of Mine\" — Robert John \"Mutt\" Lange and Shania Twain\n* \"Check Yes or No\" — Dana Hunt and Danny Wells\n* \"The Keeper of the Stars\" — Dickey Lee, Danny Mayo and Karen Staley\n* \"Time Marches On\" — Bobby Braddock\n|-\n! style=\"text-align:center;\" |1995\n| Gretchen Peters\n|\"Independence Day\"\n|\n* \"Don't Take the Girl\" — Larry Johnson and Craig Martin\n* \"Gone Country\" — Bob McDill\n* \"How Can I Help You Say Goodbye\" — Burton Banks Collins and Karen Taylor—Good\n* \"Thinkin' Problem\" — David Ball, Allen Shamblin and Stuart Ziff\n|-\n! style=\"text-align:center;\" |1994\n| Jim McBride Alan Jackson\n|\"Chattahoochee\"\n|\n* \"Don't Take the Girl\" — Larry Johnson and Craig Martin\n* \"He Thinks He'll Keep Her\" — Mary Chapin Carpenter and Don Schlitz\n* \"I Swear\" — Gary Baker and Frank J. Myers\n* \"Little Rock\" — Tom Douglas\n|-\n! style=\"text-align:center;\" |1993\n| Vince Gill John Barlow Jarvis\n|\"I Still Believe in You\"\n|\n* \"Ain't That Lonely Yet\" — James House and Kostas Lazarides\n* \"Boot Scootin' Boogie\" — Ronnie Dunn\n* \"Chattahoochee\" — Jim McBride and Alan Jackson\n* \"Seminole Wind\" — John Anderson\n|-\n! style=\"text-align:center;\" |1992\n| Max D. Barnes Vince Gill\n|\"Look at Us\"\n|\n* \"Achy Breaky Heart\" — Don Von Tress\n* \"Don't Rock the Jukebox\" — Alan Jackson, Keith Stegall and Roger Murrah\n* \"Down at the Twist and Shout\" — Mary Chapin Carpenter\n* \"Love, Me\" — Max T. Barnes and Skip Ewing\n|-\n! style=\"text-align:center;\" |1991\n| Tim DuBois Vince Gill\n|\"When I Call Your Name\"\n|\n* \"Don't Rock the Jukebox\" — Alan Jackson, Keith Stegall and Roger Murrah\n* \"Friends in Low Places\" — Dewayne Blackwell and Earl Bud Lee\n* \"Here in the Real World\" — Mark Irwin and Alan Jackson\n* \"The Dance\" — Tony Arata\n|-\n! style=\"text-align:center;\" |1990\n| Don Henry Jon Vezner\n|\"Where've You Been\"\n|\n* \"Here in the Real World\" — Mark Irwin and Alan Jackson\n* \"If Tomorrow Never Comes\" — Garth Brooks and Kent Blazy\n* \"Killin' Time\" — Clint Black and Hayden Nicholas\n* \"When I Call Your Name\" — Tim DuBois and Vince Gill\n|}\n1980s\n{| class=\"wikitable sortable\"\n! style=\"background:#efefef;\" width=\"5%\" |Year\n! style=\"background:#efefef;\" width=\"10%\" |Songwriter(s)\n! style=\"background:#efefef;\" width=\"10%\" |Title\n! class=\"unsortable\" style=\"background:#efefef;\" width=\"50%\" |Nominees\n|-\n! style=\"text-align:center;\" |1989\n| Max D. Barnes Vern Gosdin\n|\"Chiseled in Stone\"\n|\n* \"A Better Man\" — Clint Black and Hayden Nicholas\n* \"After All This Time\" — Rodney Crowell\n* \"Don't Close Your Eyes\" — Bob McDill\n* \"Eighteen Wheels and a Dozen Roses\" — Gene Nelson and Paul Nelson\n|-\n! style=\"text-align:center;\" |1988\n| K. T. Oslin\n|\"80's Ladies\"\n|\n* \"Do Ya\" — K. T. Oslin\n* \"Eighteen Wheels and a Dozen Roses\" — Gene Nelson and Paul Nelson\n* \"I Told You So\" — Randy Travis\n* \"Life Turned Her That Way\" — Harlan Howard\n|-\n! style=\"text-align:center;\" |1987\n| Paul Overstreet Don Schlitz\n|\"Forever and Ever, Amen\"\n|\n* \"All My Ex's Live in Texas\" — Linda Shafer and Sanger Shafer\n* \"Can't Stop My Heart from Loving You\" — Kieran Kane and Jamie O'Hara\n* \"Daddy's Hands\" — Holly Dunn\n* \"On the Other Hand\" — Paul Overstreet and Don Schlitz\n|-\n! style=\"text-align:center;\" |1986\n| Paul Overstreet Don Schlitz\n|\"On the Other Hand\"\n|\n* \"1982\" — Buddy Blackmon and Vip Vipperman\n* \"Bop\" — Paul Davis and Jennifer Kimball\n* \"Grandpa (Tell Me 'Bout the Good Ol' Days)\" — Jamie O'Hara\n* \"Lost in the Fifties Tonight (In the Still of the Night)\" — Mike Reid, Troy Seals and Fred Parris\n|-\n! style=\"text-align:center;\" |1985\n| Lee Greenwood\n|\"God Bless the U.S.A.\"\n|\n* \"Baby's Got Her Blue Jeans On\" — Bob McDill\n* \"Does Fort Worth Ever Cross Your Mind\" —Darlene Shafer and Sanger Shafer\n* \"Mama He's Crazy\" — Kenny O'Dell\n* \"Seven Spanish Angels\" — Eddie Setser and Troy Seals\n|-\n! style=\"text-align:center;\" |1984\n| Larry Henley Jeff Silbar\n|\"The Wind Beneath My Wings\"\n|\n* \"A Little Good News\" — Charlie Black, Rory Bourke and Tommy Rocco\n* \"God Bless the U.S.A.\" — Lee Greenwood\n* \"Islands in the Stream\" — Barry Gibb, Robin Gibb and Maurice Gibb\n* \"To All the Girls I've Loved Before\" — Hal David and Albert Hammond\n|-\n! style=\"text-align:center;\" |1983\n| rowspan=\"2\" | Wayne Carson Johnny Christopher Mark James\n| rowspan=\"2\" |\"Always on My Mind\"\n|\n* \"16th Avenue\" — Thom Schuyler\n* \"I.O.U.\" — Kerry Chater and Austin Roberts\n* \"If You're Gonna Do Me Wrong (Do It Right)\" — Max Barnes and Vern Gosdin\n* \"Swingin'\" — John Anderson and Lionel Delmore\n|-\n! style=\"text-align:center;\" |1982\n|\n* \"Elvira\" — Dallas Frazier\n* \"I'm Gonna Hire a Wino to Decorate Our Home\" — Dewayne Blackwell\n* \"It Turns Me Inside Out\" — Jan Crutchfield\n* \"You're the Reason God Made Oklahoma\" — Larry Collins and Sandy Pinkard\n|-\n! style=\"text-align:center;\" |1981\n| rowspan=\"2\" | Bobby Braddock Curly Putman\n| rowspan=\"2\" |\"He Stopped Loving Her Today\"\n|\n* \"Elvira\" — Dallas Frazier\n* \"I Believe in You\" — Roger Cook and Sam Hogin\n* \"I Was Country When Country Wasn't Cool\" — Kye Fleming and Dennis Morgan\n* \"I'm Just an Old Chunk of Coal (But I'm Gonna Be a Diamond Someday)\" — Billy Joe Shaver\n|-\n! style=\"text-align:center;\" |1980\n|\n* \"Coward of the County\" — Roger Bowling and Billy Edd Wheeler\n* \"Good Ole Boys Like Me\" — Bob McDill\n* \"In America\" — Tom Crain, William DiGregorio, Charlie Daniels, Fred Edwards, Charles Hayward and James Marshall\n* \"You Decorated My Life\" — Debbie Hupp and Bob Morrison\n|}\n1970s\n{| class=\"wikitable sortable\"\n! style=\"background:#efefef;\" width=\"5%\" |Year\n! style=\"background:#efefef;\" width=\"10%\" |Songwriter(s)\n! style=\"background:#efefef;\" width=\"15%\" |Title\n! class=\"unsortable\" style=\"background:#efefef;\" width=\"50%\" |Nominees\n|-\n! style=\"text-align:center;\" |1979\n| Don Schlitz\n|\"The Gambler\"\n|\n* \"Amanda\" — Bob McDill\n* \"Every Which Way but Loose\" — Milton Brown, Stephen Dorff and Thomas Garrett\n* \"She Believes in Me\" — Steve Gibb\n* \"Talking in Your Sleep\" — Roger Cook and Bobby Wood\n|-\n! style=\"text-align:center;\" |1978\n| Richard Leigh\n|\"Don't It Make My Brown Eyes Blue\"\n|\n* \"Heaven's Just a Sin Away\" — Jerry Gillespie\n* \"It Was Almost Like a Song\" — Hal David and Archie Jordan\n* \"Mammas Don't Let Your Babies Grow Up to Be Cowboys\" — Ed Bruce and Patsy Bruce\n* \"Take This Job and Shove It\" — David Allan Coe\n|-\n! style=\"text-align:center;\" |1977\n| Roger Bowling Hal Bynum\n|\"Lucille\"\n|\n* \"(I'm A) Stand by My Woman Man\" — Kent Robbins\n* \"It Was Almost Like a Song\" — Hal David and Archie Jordan\n* \"Luckenbach, Texas (Back to the Basics of Love)\" — Bobby Emmons and Chips Moman\n* \"Southern Nights\" — Allen Toussaint\n|-\n! style=\"text-align:center;\" |1976\n| Larry Weiss\n|\"Rhinestone Cowboy\"\n|\n* \"I'll Get Over You\" — Richard Leigh\n* \"The Blind Man in the Bleachers\" — Sterling Whipple\n* \"The Door Is Always Open\" — Dickey Lee and Bob McDill\n* \"'Til I Can Make It on My Own\" — George Richey, Billy Sherrill and Tammy Wynette\n|-\n! style=\"text-align:center;\" |1975\n| John Denver\n|\"Back Home Again\"\n|\n* \"Before the Next Teardrop Falls\" — Vivian Keith and Ben Peters\n* \"(Hey Won't You Play) Another Somebody Done Somebody Wrong Song\" — Larry Bulter and Chips Moman\n* \"I'm Not Lisa\" — Jessi Colter\n* \"Rainy Day Woman\" — Waylon Jennings\n|-\n! style=\"text-align:center;\" |1974\n| Don Wayne\n|\"Country Bumpkin\"\n|\n* \"If We Make It Through December\" — Merle Haggard\n* \"If You Love Me (Let Me Know)\" — John Rostill\n* \"The Most Beautiful Girl\" — Rory Bourke, Billy Sherrill and Norro Wilson\n* \"The Streak\" — Ray Stevens\n|-\n! style=\"text-align:center;\" |1973\n|''' Kenny O'Dell'''\n|\"Behind Closed Doors\"\n|\n* \"It's Not Love (But It's Not Bad)\" — Hank Cochran and Glenn Martin\n* \"(Old Dogs, Children and) Watermelon Wine\" — Tom T. Hall\n* \"Satin Sheets\" — John Volinkaty\n* \"Why Me\" — Kris Kristofferson\n|-\n! style=\"text-align:center;\" |1972\n| rowspan=\"2\" | Freddie Hart\n| rowspan=\"2\" |\"Easy Loving\"\n|\n* \"Kiss an Angel Good Mornin'\" — Ben Peters\n* \"She's All I Got\" — Gary Bonds and Jerry Williams\n* \"The Happiest Girl in the Whole U.S.A.\" — Donna Fargo\n* \"To Get to You\" — Jean Chapel\n|-\n! style=\"text-align:center;\" |1971\n|\n* \"Coal Miner's Daughter\" — Loretta Lynn\n* \"The Year Clayton Delaney Died\" — Tom T. Hall\n* \"Put Your Hand in the Hand\" — Gene MacLellan\n* \"When You're Hot, You're Hot\" — Jerry Reed\n|-\n! style=\"text-align:center;\" |1970\n| Kris Kristofferson\n|\"Sunday Mornin' Comin' Down\"\n|\n* \"The Fightin' Side of Me\" — Merle Haggard\n* \"Hello Darlin'\" — Conway Twitty\n* \"My Woman, My Woman, My Wife\" — Marty Robbins\n* \"Okie from Muskogee\" — Merle Haggard\n|}\n1960s\n{| class=\"wikitable sortable\"\n! style=\"background:#efefef;\" width=\"5%\" |Year\n! style=\"background:#efefef;\" width=\"10%\" |Songwriter(s)\n! style=\"background:#efefef;\" width=\"10%\" |Title\n! class=\"unsortable\" style=\"background:#efefef;\" width=\"50%\" |Nominees\n|-\n! style=\"text-align:center;\" |1969\n| Bob Ferguson\n|\"The Carroll County Accident\"\n|\n* \"Daddy Sang Bass\" — Carl Perkins\n* \"Stand by Your Man\" — Billy Sherrill and Tammy Wynette\n* \"When the Grass Grows Over Me\" — Don Chapel\n* \"Darling, You Know I Wouldn't Lie\" — Wayne Kemp\n|-\n! style=\"text-align:center;\" |1968\n| Bobby Russell\n|\"Honey\"\n|\n* \"D—I—V—O—R—C—E\" — Bobby Braddock and Curly Putman\n* \"Harper Valley PTA\" — Tom T. Hall\n* \"Little Green Apples\" — Bobby Russell\n* \"Skip a Rope\" — Jack Moran and Glenn Douglas Tubb\n|-\n! style=\"text-align:center;\" |1967\n| Dallas Frazier\n|\"There Goes My Everything\"\n|\n* \"All The Time\" — Mel Tillis and Wayne Walker\n* \"It's Such a Pretty World Today\" — Dale Noe\n* \"My Elusive Dreams\" — Curly Putman and Billy Sherrill\n* \"Ode to Billie Joe\" — Bobbie Gentry\n|}\nWriters with multiple wins\n{| class=\"wikitable\" rowspan=\"2\" style=\"text-align:center;\"\n|+ Songwriters that received multiple awards\n|-\n! scope=\"col\" style=\"width:55px;\" |Awards\n! scope=\"col\" style=\"text-align:center;\" |Artist\n|-\n|4\n|Vince Gill\n|-\n|3\n|Don Schlitz\n|-\n|rowspan=6|2\n|Bill Anderson\n|-\n|Chris Stapleton\n|-\n|Freddie Hart\n|-\n|Lori McKenna\n|-\n|Mike Henderson\n|-\n|Paul Overstreet\n|}\nWriters with multiple nominations\n;10 nominations\n*Alan Jackson\n*Shane McAnally\n;7 nominations\n*Bob McDill\n;6 nominations\n*Bob McDill\n*Bobby Braddock\n*Brad Paisley\n*Josh Osborne\n*Vince Gill\n;5 nominations\n*Ashley Gorley\n*Don Schlitz\n*Eric Church\n*Hillary Lindsey\n*Miranda Lambert\n*Wyatt Durrette\n;4 nominations\n*Billy Sherrill\n*Curly Putman\n*John Rich\n*Kacey Musgraves\n*Luke Combs\n*Natalie Hemby\n*Toby Keith\n;3 nominations\n*Allen Shamblin\n*Bill Anderson\n*Dallas Frazier\n*Merle Haggard\n*Michael Hardy\n*Hal David\n*Jon Randall\n*Luke Laird\n*Maren Morris\n*Nicolle Galyon\n*Paul Overstreet\n*Rodney Clawson\n*Roger Cook\n*Ronnie Dunn\n*Sam Hunt\n*Tom Douglas\n*Tom T. Hall\n*Troy Seals\n*Zac Brown\n;2 nominations\n*Archie Jordan\n*Ashley McBryde\n*Ben Peters\n*Bobby Russell\n*Brandy Clark\n*Brett James\n*Carly Pearce\n*Casey Beathard\n*Chips Moman\n*Chris DuBois\n*Clint Black\n*Craig Martin\n*Craig Wiseman\n*Dan Smyers\n*Dewayne Blackwell\n*Dickey Lee\n*Dierks Bentley\n*Frank J. Myers\n*Freddie Hart\n*Gary Baker\n*Gene Nelson\n*Gretchen Wilson\n*Hayden Nicholas\n*James House\n*Jamey Johnson\n*Jamie O'Hara\n*Jeff Hyde\n*Jim McBride\n*John Anderson\n*Johnny Christopher\n*Jonathan Singleton\n*Jordan Davis\n*Jordan Reynolds\n*Jordan Schmidt\n*Josh Kear\n*K. T. Oslin\n*Keith Stegall\n*Kenny O'Dell\n*Kris Kristofferson\n*Lainey Wilson\n*Lee Thomas Miller\n*Larry Cordle\n*Larry Johnson\n*Larry Shell\n*Lee Greenwood\n*Lori McKenna\n*Marcus Hummon\n*Mark Irwin\n*Mark James\n*Mary Chapin Carpenter\n*Matraca Berg\n*Max D. Barnes\n*Monty Criswell\n*Paul Nelson\n*Randy Travis\n*Richard Leigh\n*Robert Williford\n*Rodney Crowell\n*Roger Bowling\n*Roger Murrah\n*Rory Bourke\n*Sam Hogin\n*Sanger Shafer\n*Tammy Wynette\n*Taylor Swift\n*Tim DuBois\n*Vern Gosdin\n*Wayne Carson\n*Wynn Varble\n*Zach Crowell\nReferences"
    }
  ]
}