{
  "content": [
    {
      "type": "text",
      "text": "# Counties of the United Kingdom__disambig_1\n\nThe counties of the United Kingdom are subnational divisions of the United Kingdom, used for the purposes of administrative, geographical and political demarcation. The older term, shire is historically equivalent to county. By the Middle Ages, county had become established as the unit of local government, at least in England. By the early 17th century, all of England, Wales, Scotland, and Ireland had been separated into counties.  In Scotland, shire was the only term used until after the Act of Union 1707.\nSince the early 19th century, counties have been adapted to meet new administrative and political requirements, and the word county (often with a qualifier) has been used in different senses for different purposes. In some areas of England and Wales, counties still perform the functions of modern local government. In other parts of the United Kingdom, especially within large metropolitan areas, they have been replaced with alternative unitary authorities, which are considered 'county level' authorities. Today, these have largely replaced the historic county corporate entities granted self-governance with county government powers. Today, in addition to local government counties, every part of the United Kingdom lies within the historic counties which have formed geographic and cultural units since the Middle Ages.\nAdditionally, there are vice-counties, which are geographic areas based on the historic counties, and used in scientific data gathering. Their purpose is to maintain the stability of the geographic area for scientific studies, and thus ignore changes in political demarcations.\nEngland\nEngland is divided into 48 ceremonial counties, which are also known as geographic counties. Many of these counties have their basis in the 39 historic counties whose origins lie in antiquity, although some were established as recently as 1974.\nEngland is also divided into 84 metropolitan and non-metropolitan counties (outside Greater London and the Isles of Scilly). These correspond to areas used for the purposes of local government and may consist of a single district or be divided into several. As of April 2023, 28 such counties are divided into districts, and 21 of those have a county council.\nMost ceremonial counties correspond to a metropolitan or non-metropolitan county that has the same name but often has reduced boundaries. The current arrangement is the result of incremental reform; from 1974 to 1996 the metropolitan and non-metropolitan counties corresponded directly with the ceremonial counties. From 1889 to 1974 areas with county councils were known as administrative counties (which excluded larger towns and cities that had independent county boroughs), and ceremonial counties were defined separately.\nScotland\nScottish counties in 1975\nIn Scotland, there were 33 local government counties, created under the Local Government (Scotland) Act 1889. They were abolished in 1975 under the Local Government (Scotland) Act 1973, in favour of regions and districts and islands council areas. The regions and districts were themselves abolished in 1996, under the Local Government etc. (Scotland) Act 1994, in favour of unitary Scottish council areas. (The islands areas had been created as unitary council areas, and their boundaries were unaffected.)\nThe 1889 legislation created county councils, turned each civil county (with one exception) into a contiguous area and adjusted boundaries where civil parishes straddled county boundaries, or had fragments in more than one county. The counties of Ross and Cromarty were merged to form Ross and Cromarty.\nOne region and various districts, created in 1975, had areas similar to those of earlier counties, and various council areas, created in 1996, are also similar. Two of the three islands areas—Orkney and Shetland—have boundaries identical to those of earlier counties.\nScotland has also registration counties, which are in current use. The areas of Scotland that are appointed a Lord-Lieutenant are called lieutenancy areas.\nWales\nThe thirteen historic counties of Wales were fixed by statute in 1535 (although counties such as Pembrokeshire date from 1138). The Administrative Counties of Wales created in 1889 were based on these. In 1974, a new system was created using significantly different entities. These were changed in 1996, and since then Wales has been entirely divided into a system of single-tier authorities, the principal areas. Eleven of the 22 principal areas are styled as \"counties\", and the other eleven are county boroughs, although informally all are referred to as \"counties\". The areas of Wales that appoint a Lord-Lieutenant are the preserved counties of Wales, which are, for the most part, combinations of principal areas to closely match (but are not the same as) the counties that existed from 1974.\nNorthern Ireland\nThere are six counties in Northern Ireland. In order of landmass these are; Tyrone, Antrim, Down, Londonderry, Fermanagh and Armagh.\nThe six historic counties of Northern Ireland are no longer in use for administrative purposes. Combined with the boroughs of Belfast and Derry, the counties do serve for organisational purposes within government, and often with private businesses and sporting clubs.\nThe counties of Northern Ireland are all within the historic province of Ulster, which includes an additional three other counties in the Republic of Ireland: Donegal, Cavan and Monaghan.\nSee also\n* List of counties of the United Kingdom\n* Counties of Ireland\nReferences"
    }
  ]
}