{
  "content": [
    {
      "type": "text",
      "text": "# Counterrevolution and Revolt__disambig_1\n\nCounterrevolution and Revolt is a 1972 book by the philosopher Herbert Marcuse.\nSummary\nMarcuse writes that the western world has reached a new stage of development, in which \"the defense of the capitalist system requires the organization of counterrevolution at home and abroad.\" He accuses the west of \"practicing the horrors of the Nazi regime\", and of helping to launch massacres in Indochina, Indonesia, the Congo, Nigeria, Pakistan, and the Sudan.\nHe discusses the problems of the New Left, as well as other topics such as the political role of social ecology. Citing author Murray Bookchin's Post-Scarcity Anarchism (1971), Marcuse argues that ecology must be taken \"to the point where it is no longer containable within the capitalist framework\" by \"extending the drive within the capitalist framework.\" Marcuse offers a discussion of the role of nature in Marxist philosophy informed by philosopher Alfred Schmidt's The Concept of Nature in Marx (1962).\nMarcuse also offers a discussion of art, including literature and music, in relation to revolution. He cites Arthur Schopenhauer's observation, in The World as Will and Representation (1818), that music \"gives the innermost kernel preceding all form, or the heart of things\".\nPublication history\nCounterrevolution and Revolt was first published by Beacon Press in 1972.\nReception\nCounterrevolution and Revolt was reviewed by the gay rights activist Jearld Moldenhauer in The Body Politic. Moldenhauer suggested that Marcuse found the gay liberation movement insignificant, and criticized Marcuse for ignoring it even though \"many gay activists\" had been influenced by his earlier book Eros and Civilization (1955).\nIn Theory & Society, the intellectual historian Martin Jay called Counterrevolution and Revolt one of Marcuse's \"major works\". He suggested that Marcuse's comments about art reveal his indebtedness to Romanticism. Brian Easlea described Marcuse's view that \"Marx's notion of a human appropriation of nature is not altogether free from the hubris of domination\" as courageous. He wrote that Marcuse \"explicitly adds to his decades of social analysis a dimension that had always been implicit: the male-female relation\", and that Marcuse's \"condemnation of the established science and call for a new science would appear to be a condemnation of 'male' science and a call for a new 'female' science.\" The philosopher Charles Crittenden considered Marcuse's advocacy of \"working for change within the system\" to be a retreat from his advocacy, in previous works such as An Essay on Liberation (1969), of revolutionary violence and confrontation as ways of achieving social transformation. Andrew Light compared Marcuse's views to those of Murray Bookchin.\nReferences\nBibliography\nBooks\n*\n*\n*\n*\nJournals\n*\n*"
    }
  ]
}