{
  "content": [
    {
      "type": "text",
      "text": "# Council for National Academic Awards__disambig_1\n\nThe Council for National Academic Awards (CNAA) was the national degree-awarding authority in the United Kingdom from 1965 until its dissolution on 20 April 1993.\nBackground\nThe establishment followed the recommendation of the UK government Committee on Higher Education (Robbins Committee), one of whose recommendations being the replacement of the diploma-awarding National Council for Technological Awards with a degree-awarding council. That gave colleges more flexibility, as they could devise their own courses with the oversight of the council, rather than depend on existing universities to accredit courses. In 1974, the National Council for Diplomas in Art and Design was merged into the CNAA.\nThe CNAA's Latin motto, as it appears on its coat of arms, is: Lauream qui Meruit Ferat: this can be translated as 'let whoever earns the laurel bear it'.\nQualifications\nQualifications included diplomas, bachelor's, master's and doctorate research degrees; by the time of dissolution, it had awarded over 1.3 million degrees and other academic awards. The CNAA awarded academic degrees at polytechnics, central institutions and other non-university institutions such as colleges of higher education until they were awarded university status. When the CNAA was wound up, the British government asked the Open University to continue the work of awarding degrees in the remaining non-university institutions. Additionally, the OU has responsibility for CNAA records.\nThe CNAA, through its many subject panels, oversaw the degree-awarding powers of polytechnics. Above all, the CNAA saw itself as preserving a comparability at the national level with degree level awards in universities, a feature which can be seen as having both positive and negative aspects: positive in that it preserved a formal \"parity of esteem\" between the awards of the two parts of the binary system (such as retaining the common currency of the undergraduate degree for entry to postgraduate study), but other scholarsPratt, John (1997), The Polytechnic Experiment: 1965-1992, Society for Research into Higher Education, Ltd., London. ISBN 0-335-19564-4 . viewed it as negative because it encouraged an \"academicism\" in the new sector and slowed an acceptance of the transformations required finally to break the boundaries of the old, \"elite\" system. In the event, the polytechnics were associated with many innovations, including women's studies, the academic study of communications and media, sandwich degrees, advanced engineering degrees in all functional specialities, and the rise of management and business studies; not least, they were much more responsive than older institutions in providing for the admission of non-standard students from technical colleges, advanced apprenticeships and other sources.\nPatronage and governance\nThe presidents of the Council for National Academic Awards were:\n* The Duke of Edinburgh, 1965 to 1976\n* The Prince of Wales, 1976 to 1989\n* The Princess Royal, 1989 to 1993.\nThe Council comprised a chairman and 21 to 25 members all appointed by the secretary of state for education. The CNAA's seven chairmen were:\n* Sir Harold Roxbee Cox, Lord Kings Norton, 1964 to 1971\n* Sir Michael John Sinclair Clapham, 1971 to 1977\n* Sir Denis Rooke, 1978 to 1983\n* Sir Alastair Pilkington, 1983 to 1987\n* Sir Ronald Ernest Dearing, Lord Dearing, 1987 to 1988\n* Sir Bryan Nicholson, 1988 to 1991\n* Sir Raymond Mildmay Wilson Rickett, 1991 to 1993\nAcademic dress\nFor graduation ceremonies the CNAA had its own academic dress comprising gown, hood and headwear. The bachelors’ gown was a black Cambridge pattern worn twelve inches off the ground with sleeves reaching the elbow; the doctors’ and masters’ gowns were a standard black Oxbridge pattern worn eight inches off the ground; PhD gowns had a maroon silk yoke and facings; higher doctorates had a gold-yellow gown with cream brocade facings. Hoods were a gold-yellow panama, with a silk lining: turquoise for bachelors’; white for masters’; turquoise with a white facing for a MEng; maroon for a PhD; cream damask for higher doctors. Bachelors’ and masters’ wore a black mortar board; PhDs a cloth bonnet with a maroon cord; higher Doctors had a velvet Tudor bonnet with a gold cord.\nSee also\n*Business and Technology Education Council\nReferences\nExternal links\n*[https://mrc.epexio.com/records/CAA Catalogue of the CNAA archives], held at the Modern Records Centre, University of Warwick\n*[https://mrc.epexio.com/records/CTA Catalogue of the NCTA archives], held at the Modern Records Centre, University of Warwick\n*[https://www.open.ac.uk/about/validation-partnerships/ Open University Validation Services] CNAA Aftercare\n*[https://discovery.nationalarchives.gov.uk/details/r/C73 The National Archives] Records created or inherited by the Council for National Academic Awards, and related bodies"
    }
  ]
}