{
  "content": [
    {
      "type": "text",
      "text": "# Courbet-class battleship\n\n{|\n* Free French Navy\n|Class before=\n|Class after=\n|Subclasses=\n|Cost=\n|Built range=1910–1914\n|In service range=1913–1945\n|In commission range=\n|Total ships completed=4\n|Total ships scrapped=3\n|Total ships lost=1\n}}\n(normal)\n* (full load)\n|Ship length=  (o/a)\n|Ship beam=\n|Ship power=*18 or 24 × water-tube boilers\n*\n|Ship draught=\n|Ship propulsion=4 × shafts; 2 × steam turbine sets\n|Ship speed=\n|Ship endurance= at\n|Ship complement=1,115 (1,187 as flagship)\n|Ship armament=*6 × twin  guns\n*22 × single  guns\n*4 × single  guns\n*4 ×  torpedo tubes\n|Ship armour=*Waterline belt:\n*Deck:\n*Turrets:\n*Conning tower:\n|Ship notes=\n}}\n|}\nThe 'Courbet-class battleships' were the first dreadnoughts built for the French Navy.  These were completed prior to WWI. The class comprised four ships: , , , and . All four ships were deployed to the Mediterranean Sea for the entirety of World War I, spending most of their time escorting French troop convoys from North Africa and covering the Otranto Barrage. An Anglo-French fleet led by Courbet succeeded in sinking the Austro-Hungarian protected cruiser  in the Battle of Antivari. Jean Bart was torpedoed in the bow by  on 21 December 1914, but she was able to steam to Malta for repairs.\nFrance sank after striking a rock in Quiberon Bay in 1922. Between the wars the surviving ships were modernised several times, but they were not rebuilt thoroughly enough to prevent them from becoming obsolete in comparison to modern German or Italian battleships. They were relegated to training duties during the 1930s. Courbet and Paris escaped to Portsmouth where they became depot and accommodation ships after the French armistice in 1940. Jean Bart was demilitarised, renamed Océan, and became a school hulk in Toulon. She was captured there on 27 November 1942, although she was not scuttled. She was used for experiments with large shaped charge warheads by the Germans until she was sunk by the Allies in 1944, later broken up in place in 1945. Courbet was scuttled on 9 June 1944 as a breakwater for a Mulberry harbour used during the Battle of Normandy.\nDesign\nConcerned about underwater hits, the class's French designers decided to extend the waterline armour belt well below the waterline as compared to their contemporaries. The main armour was also thinner than that of its British or German counterparts, but covered more area. Their secondary armament was of a smaller size than the  guns used by the Germans or the British  guns, but the French placed a premium on rate of fire rather than size, in order to destroy torpedo boats before they got within torpedo range.\nGeneral characteristics\nThe Courbets were longer than their predecessors, at  overall. The ships had a beam of  and at full load a draft of  at the bow. The ships were significantly heavier than the previous ; the Courbet-class ships displaced  at (standard) and  at full load, over  more than the earlier ships.\nThese ships proved to be rather wet in service, as they were bow-heavy because of the superfiring turrets forward.\nPropulsion\nThe Courbet-class ships had four Parsons direct-drive steam turbines which were rated at . Each ship had twenty-four Belleville water-tube or Niclausse boilers, eight small and sixteen large. The large boilers were in the two forward boiler rooms and the small boilers were in the rear boiler room; each boiler room housed eight boilers. These boilers were coal-burning with auxiliary oil sprayers. They had a top speed of , although all four were faster during trials. The ships carried up to  of coal and  of oil. They could steam for  at a speed of .\nArmament\nThe French rejected their standard hexagonal configuration for the main armament of the Courbet class. Twelve 305 mm Mle 1910 45-calibre guns were mounted in six twin gun turrets, with two turrets superfiring fore and aft, and one on each flank of the ship. The guns had a maximum elevation of only 12°. They fired  armour-piercing projectiles at a muzzle velocity of  at a rate of 1.5–2 rounds per minute. At maximum elevation, this provided a maximum range of only . The guns were provided with 100 shells each.\nThe ships' secondary armament consisted of twenty-two 138 mm Mle 1910 guns, mounted in casemates. The guns fired  semi-armour-piercing shells at a muzzle velocity of . The guns could be elevated to 15°, which provided a maximum range of less than . The secondary armament was later refitted to provide up to 25° elevation, providing a range of . They had a rate of fire of 5–6 rounds per minute and each gun provided with 275 rounds. The rearmost guns were very low and were often washed out in any kind of sea. The ships also carried four  Modèle 1902 Hotchkiss guns, two on each beam. The Courbet-class ships were also armed with four  submerged Modèle 1909 torpedo tubes for which they carried twelve torpedoes.\nFire control arrangements were very primitive and the Courbets were only provided with one  rangefinder on each side of the conning tower. Each turret had  rangefinder under an armoured hood at the rear of the turret.\nArmour\nThe Courbet-class ships had a waterline armoured belt,  deep, that was  thick between the fore and aft turrets and tapered to  towards the bow and stern. It extended  below the normal waterline. Above the main belt was another belt, 180&nbsp;mm thick, that covered the sides, and the secondary armament, up to the forecastle deck,  deep, between the fore and aft turrets. The vertical armour was backed by  of wood. Four of the ship's decks were armoured, between  each, although they were built up from two or more layers of plates. The sides of the lowest armoured deck curved to meet the bottom of the lower edge of the waterline belt armour and increased to a thickness of . The conning tower had armour  thick. The main gun turrets had  of armour on their faces,  on their sides and roofs  thick. Their barbettes had  of armour. There was no anti-torpedo bulkhead although there was a longitudinal bulkhead abreast the machinery spaces that was used either as a coal bunker or left as a void.\nShips\n{|class=\"wikitable plainrowheaders\"\n|+ Construction data\n|-\n!scope=\"col\"|Ship\n!scope=\"col\"|Builder\n!scope=\"col\"|Laid down\n!scope=\"col\"|Launched\n!scope=\"col\"|Commissioned\n!scope=\"col\"|Fate\n|-\n!scope=\"row\"|\n|Arsenal de Lorient, Lorient\n|1 September 1910\n|23 September 1911\n|19 November 1913\n|Scuttled, 9 June 1944, as a breakwater for the Mulberry harbour, Normandy\n|-\n!scope=\"row\"|\n|Arsenal de Brest, Brest\n|15 November 1910\n|22 September 1911\n|5 June 1913\n|Scrapped in situ, 14 December 1945\n|-\n!scope=\"row\"|\n|Forges et Chantiers de la Méditerranée, La Seyne-sur-Mer\n|10 November 1911\n|28 September 1912\n|1 August 1914\n|Decommissioned 1945, sold for scrap, 21 December 1955\n|-\n!scope=\"row\"|\n|Ateliers et Chantiers de la Loire, Saint-Nazaire\n|30 November 1911\n|7 November 1912\n|15 July 1914\n|Foundered, 26 August 1922, after hitting a rock in Quiberon Bay\n|}\nCareer\nEarly service\nThe Courbet-class ships were completed less than a year before the start of World War I and nothing is known of their activities during this time except that France, escorted by Jean Bart, carried the President of the French Republic, Raymond Poincaré, on a state visit to Saint Petersburg, Russia in July 1914. They were returning from Russia when World War I began, but made it to France without encountering German ships.\nWorld War I\nFrance and the British agreed that the French fleet would concentrate in the Mediterranean to contain the Austro-Hungarian fleet and the Courbet-class ships sailed there after the war began. Courbet became the flagship of Admiral Augustin Boué de Lapeyrère, commander of the French Mediterranean Fleet. Lapeyrère decided immediately on a sweep into the Adriatic to surprise the Austrian vessels enforcing a blockade of Montenegro. The Anglo-French force, which included Jean Bart, succeeded in cutting off and sinking the Austro-Hungarian protected cruiser  off Bar on 16 August 1914, although her accompanying destroyer managed to escape. They spent most of the rest of 1914 providing gunfire support for the Montenegrin Army until  hit Jean Bart on 21 December with one torpedo in the wine store just in front of the forward magazine off Sazan Island. She was able to steam to Malta on her own for repairs that required three and a half months, but this forced the battleships to fall back to either Malta or Bizerte. After the French occupied the neutral Greek island of Corfu in 1916 they moved forward to Corfu and Argostoli, but their activities were very limited as many of their crews were used to man anti-submarine ships.\nPost-war modernisation\nA post-war assessment listed their weaknesses as:\n* No director control for the guns\n* The elevation of the main guns was insufficient\n* Protection against torpedoes was weak\n* The horizontal protection against plunging fire was weak\n* The anti-aircraft defense was negligible\n* They were coal-fired\n* The organisation of the crew, the lighting and the method of transmitting orders were old-fashioned.\nThe survivors were refitted several times during the interwar period to remedy these issues, although no comprehensive modernisation was ever planned. These included installation of director control mounted in new tripod foremasts, replacement of the rangefinders by larger units, the addition of more rangefinders, the alteration of the main gun turrets to allow elevation up to 23°, partial replacement of the coal-fired boilers by oil-fired units, the replacement of the direct-drive turbines by geared turbines, the removal of the bow armour to reduce the weight forward, and the addition of more modern anti-aircraft guns.\nInter-war careers\nIn April 1919, while helping to defend Sevastopol from the advancing Bolsheviks, the crews of France and Jean Bart mutinied, but collapsed when Vice-Admiral Jean-Françoise-Charles Amet agreed to meet their main demand to take the ships home. 26 crewmen on France and three on Jean Bart were sentenced to prison terms upon her return, although they were commuted in 1922 as part of a bargain between Prime Minister Raymond Poincaré and the parties of the Left.\nIn 1922, France was wrecked after striking an uncharted rock in Quiberon Bay at low tide and foundered with three deaths among her crew. Jean Bart received the first stage of her modernisation between 12 October 1923 and 29 January 1925. She underwent the second stage between 7 August 1929 and 28 September 1931. Her condition was poor, even after the earlier refits so she was demilitarised and became a training ship in Toulon in 1936. She was renamed Océan in 1937 to release her name for the new  .\nCourbet became flagship of Vice-Amiral Charlier between 6 June 1919 and 20 October 1920. The following year she became a gunnery training ship at Toulon, but she suffered a serious boiler fire in June 1923 that caused her to be repaired and given the first of her upgrades between July and April 1924 at La Seyne-sur-Mer. She had another boiler fire in August 1924 and remained under repair for the rest of the year, but resumed her duties as a gunnery training ship upon her return from the dockyard. She was refitted again between January 1927 and January 1931. She was transferred from the gunnery school to the navigation school in 1937, before her final prewar refit between April 1937 to September 1938. By 1939 she reverted to her role as a gunnery training ship, but she was ordered to Brest and Quiberon with her sister Paris upon the outbreak of World War II.\nParis was sent to Pula on 12 December 1918 to supervise the surrendered Austro-Hungarian fleet where she remained until 25 March 1919. She provided cover for Greek troops during the Occupation of İzmir (Smyrna) from May 1919 before returning to Toulon on 30 June. She received the first of her upgrades at Brest between October 1922 and November 1923. She supported an amphibious landing at Al Hoceima by Spanish troops during the summer of 1925 after the Rifians attacked French Morocco during the Rif War. She destroyed coast defense batteries there despite taking light damage from six hits and remained there until October as the flagship of the French forces. She received the second of her upgrades from 16 August 1927 to 15 January 1929 at Toulon. She resumed her role as flagship of the 2nd Division of the 1st Squadron of the Mediterranean Squadron until 1 October 1931 when she became a training ship.\nWorld War II\nCourbet and Paris formed a Fifth Squadron at the beginning of the war. They were transferred to the Atlantic to continue their training duties without interference. Both ships were ordered restored to operational status on 21 May 1940 by Amiral Mord and their light anti-aircraft outfits were augmented at Cherbourg. Courbet was ordered to provide gunfire support to the defenders of Cherbourg against the advancing 7th Panzer Division and covered the evacuation of the town by the Allies while Paris supported the defenders of Le Havre. Lack of spotting aircraft meant that neither ship was particularly effective in that role.\nParis was damaged by a German bomb on 11 June and sailed for Cherbourg for emergency repairs that night. She was later transferred to Brest on 14 June and evacuated 2800 men when she sailed for Plymouth on 18 June at a speed of . She was seized there on 3 July by the Royal Navy as part of Operation Catapult, Winston Churchill's plan to prevent the French Navy from falling into German hands. She was used as a depot ship for the rest of the war and temporarily as a barracks ship by the Polish Navy. She was returned to French control in July 1945 and towed to Brest on 21 August. She continued to serve as a depot ship until she was stricken for breaking up on 21 December 1955 before being scrapped the following year.\nCourbet sailed for Portsmouth on 20 June. She was also seized there on 3 July and was turned over to the Free French a week later who used her as a depot and an anti-aircraft ship in Portsmouth until 31 March 1941 when she was disarmed. She remained in use as a depot ship and target until she was scuttled as a breakwater on 9 July 1944 for a Mulberry harbour used during the Battle of Normandy. She was scrapped in place after the war.\nJean Bart was demilitarised and became a school hulk in Toulon in 1936. She remained there during World War II and was captured there on 27 November 1942, although she was not scuttled. She was used for experiments with large shaped charge warheads by the Germans until she was sunk by the Allies in 1944 before being broken up in place beginning on 14 December 1945.\nNotes\nFootnotes\nBibliography\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*"
    }
  ]
}