{
  "content": [
    {
      "type": "text",
      "text": "# Coward v MIB\n\nCoward v MIB  was a 1963 Court of Appeal decision on intention to create legal relations, and on the liability of the Motor Insurers Bureau when a passenger in a vehicle is killed or injured through the driver's negligence.\nThe decision was disapproved and not followed in two subsequent \"lift-to-work\" cases, Connell v Motor Insurers Bureau (1969 CA) and Albert v Motor Insurers Bureau (1971 HL).\nFacts\nCoward was a pillion passenger who was killed in a motorcycle accident for which the rider was responsible. The negligent rider was both a colleague and a friend. The accident occurred on the way to work.  As the rider's insurance policy excluded pillion passengers, Coward's widow was obliged to claim damages from the MIB. The MIB would have liability only where insurance for the pillion was compulsory; and at the time insurance was compulsory only if pillions were carried \"for hire or reward\". Coward had paid the friend a small weekly contribution for the daily trip, and the widow argued that this amounted to a contract for hire or reward. The MIB countered that carriage for hire or reward required to create legal relations, and that on these facts (an agreement between friends), there was no such intention.\nDecision\nThe Court of Appeal held there was no contract of hire or reward as it was a social and domestic agreement without intention to create legal relations, and that the widow was not entitled to compensation.\nSubsequent decisions\nIn Connell v Motor Insurers Bureau  Lord Denning, MR, sitting in the Court of Appeal declared that he was \"not happy with the decision in Coward\", adding that \"when a man gives another a lift in return for money there is a contract, albeit informal\". Denning refused to follow Coward and declared that a car driver who gave friends a lift in return for cash or other valuable consideration was indeed acting \"for hire or reward\".\nStrictly speaking, Denning was in breach of the rule that the Court of Appeal is bound by its own earlier decisions; but in Albert v Motor Insurers Bureau  the House of Lords in 1971 approved the Connell judgment in preference to that in Coward.\nReferences"
    }
  ]
}