{
  "content": [
    {
      "type": "text",
      "text": "# Cowaramup, Western Australia\n\n| postcode =  6284\n| pop               =\n| area     =\n| est      = 1925\n| stategov = Vasse\n| fedgov   =  Forrest\n| dist1    =  265\n| location1=  Perth\n| dist2    =  36\n| location2=  Busselton\n| dist3    =  13\n| location3=  Margaret River\n| maxtemp  =  20.5\n| mintemp  =  12.6\n| rainfall =  820\n| elevation= 140\n| url=http://cowaramup.com.au/\n}}\nCowaramup is a town in the South West of Western Australia,  north of Margaret River in the Shire of Augusta-Margaret River.\nName\nThe town was named from the Cowaramup Siding, which was located near the townsite, on the now disused Busselton to Augusta railway.  The name (pronounced kuh-wara-mup) is from the Wardandi word , meaning .\nContrary to common misconception and marketing, the name is unrelated to cows.\nDescription\nCowaramup is roughly central to the Margaret River wine region. It is the closest townsite to a number of wineries and other speciality producers, including Vasse Felix, Howard Park and Madfish Winery, the Margaret River Chocolate Factory, and The Margaret River Dairy Company. The town is close to Cowaramup Bay, a popular swimming and surfing beach. As such a large number of tourists to the region pass through and visit the town, playing an important role in the local economy.\nThe town centre consists of a local store providing basic produce, a post office, a bakery, a fruit and vegetable shop, a real estate agent and farm agency, a service station/workshop, a liquor store, a social club, parkland and various speciality stores selling everything from gourmet produce, candies and arts and crafts to computing goods. Accommodation in or near the town consists of the Taunton Farm Caravan Park, a bed and breakfast and various chalets and cottages in the area. There is one restaurant and two cafés in the town, as well as numerous others on nearby winery properties. The town has one primary and pre-primary school, a town oval and tennis club, BMX track and a bowling green. The nearest high school and university campuses are in Margaret River. Police and fire services are based in Margaret River and Busselton.\nMost residents live in the townsite and surrounding rural properties, including one remaining dairy farm. The local government administration is the Shire of Augusta-Margaret River, and the local newspapers are the Augusta Margaret River Times and the Augusta Margaret River Mail. The town is built on the traditional lands of the local Aboriginal people, the Wardandi.\nTransport\nCowaramup is located on the Bussell Highway, which serves as the major link to other towns in the area, as well as Perth, the state capital.\nDevelopment\nThe area around Cowaramup is predominantly agricultural and viticulture use, but over the last five years many land releases have proven popular for the many young families and tradesmen who benefited greatly from the building boom in 2005–06.\nSurfing\nThe Cowaramup Bombora (colloquially called Cow Bombie) big wave surf break, located  offshore, was the location of two Oakley Biggest Wave award-winning rides; in 2011 by Damien Warr, and 2015 by Jarryd Foster. On 26 June 2015, Australian surfer Felicity Palmateer became the first female to surf Cow Bombie, on potentially the largest wave ever ridden in Australia by a woman.\nArt works\nIn 2012 the town installed 42 lifesize fibreglass cow sculptures around the town, as a tourist attraction. In July 2014, the town set a Guinness World Record for the largest group of people1,352dressed as cows.\nA permanent cow-themed tourist attraction is the golden cow statue. Created by local artist Ron Roozen in 2010, \"Free As A Cow\" is located in Pioneer Park and is locally known as \"Rump on a Stump\" (a pejorative counterpoint to the \"chick on a stick\" statue installed in front of the Robert Oatley Winery cellar door, a few kilometres north of Cowaramup).\nSince 2018, there have been various artworks around the town depicting the purple-crowned lorikeet () for which the town was named, including:\n* Anita Revel's \"Cowara Dreaming\" on the exterior of the Cowaramup Agencies building\n* Alan Meyburgh's \"Cowara Bird\" statue at Rosie's deli\n* A mural by Brenton See on the Lions shed in Pioneer Park\nNotable people\n* Yadin Nicol, surfer\nReferences"
    }
  ]
}