{
  "content": [
    {
      "type": "text",
      "text": "# Cowboy Ninja Viking\n\nCowboy Ninja Viking is an Image Comics comic book created by writer A.J. Lieberman and artist Riley Rossmo. The series debuted in 2009, released through Image Comics' partner studio Shadowline.\nPublication history\nThe first appearance of the comic characters is in a 6-page preview in Bomb Queen Vol 6 issue 1 published in September and the 1st issue of the main title coming out in October.\nWriter A.J. Lieberman describes the creation of the series:\nPlot synopsis\nThe series revolves around a counter-intelligence unit of dissociative identity disorder patients, formed by psychotherapist Dr. Sebastian Ghislain, who are transformed into agents known as Triplets (referring to the three different personalities inside their minds). It is hinted that this is possible through experimental psychiatric conditioning and treatment, psychotropic drugs, and past life regression therapy.  After the unit falls apart, its various members are turned into hired killers. Duncan, a Triplet who channels the skills of a Cowboy, Ninja, and Viking, is sent to find and stop the rogue Triplets.\nMajor Characters of CNV\nProgram Staff\n* Dr. Sebastian Ghislain - The Creator of the Government's Triplet Program. While not a triplet himself his personality appears as a brilliant psychotherapist and a womanizing playboy/boozehound. He also has a penchant for professional backgammon.\n* Sara Nix - Assistant to Dr. Ghislain, Sara plays Duncan's love interest who recruits him and travels with him on their mission to find the other triplets for Dr. Ghislain and protect them from the antagonist Dr. Blaq.\n* Dr. Johann Blaq - Ghislain's former protege and antagonist of the story.  His motives are not yet known.\n* Sashsa  - Ghislain's personal pilot and bodyguard.\nTriplets\n* Duncan (Cowboy - Ninja - Viking) - The titular character and most effective assassin the program produced.\n* Carl (Army Staff Sergeant - Apache Indian - Scottish Highlander) - Duncan's brother and also one of the most effective assassins as all 3 personalities revolve around combat. It is hinted that Duncan killed him in San Cristobal previous to the plot of Volume 1 to prevent him from killing Missionaries during their trial mission.  His Highlander personality claimed to be \"Seamus McManus of the clan McManus. Born to Angus of Glenfinnan on the shores of Loch Schiel.\"\n* Xia Xia Xian (Sniper - Archer - Clothing Designer)\n* Steed Malbranque (Hitman - Navy Seal - Roadie for Dokken)\n* Peyton Vermeer (Mohawk Indian - Playboy - Spartan)\n* Philippe De Montebello (Hair Stylist - Conquistador - Cowboy) - Gunned down by Duncan in Volume 1.\n* Emerson Blancpain (Amish - Demo Expert - Army Captain)\n* Lara St. Britt (Flight Attendant - Joan of Arc - Amazonian Warrior)\n* Johnny Vellum (Conquistador - Green Beret - Surfer)\n* Toffler Almric (Mad Scientist - Napoleonic General - Spanish Cavalier)\n* '''Patrick O'Fallon' (Applebee‘s Waiter - Army Sergeant - Frontiersman) - Decapitated by Duncan at the end of volume 2.\n* Viscount Wölfer (Executioner - Sports Broadcaster - Samurai)\n* Yashitiko Ammo (Pirate - Gladiator - Oceanographer) - Arguably one of the most centered characters within the plot.\n* Grear Fulkirk (Sniper - Chef - Martial Artist)''  - Duncan's ex-wife and a rival to Nix.\n* Blancpain Emerson (Diminish - Expert Alpha - Navy Captain)\nCollected editions\nThe series has been collected into trade paperbacks:\n* Volume 1 (collects issues #1-5, June 2010, )\n* Volume 2 (collects issues #6-10, February 2011, )\nFilm adaptation\nIn 2010, it was announced that Disney had purchased the rights to make a film adaptation of the comic book. Zombieland screenwriters Paul Wernick and Rhett Reese were slated to pen the film's script. Disney dropped the film in turnaround and Universal acquired the rights in 2012, with World War Z director Marc Forster attached to direct, and Craig Mazin attached to write the script. On November 20, 2014, Chris Pratt was cast as the lead. On January 29, 2015, John Wick directors David Leitch and Chad Stahelski were in early talks to replace Forster, who left the project. In August 2017, Deadline announced that no director was attached yet. On January 31, 2018, Michelle MacLaren was confirmed as director for the film. On May 19, 2018, Dan Mazeau and Ryan Engle were brought on board to rewrite the script. In June 2018, Pratt confirmed MacLaren and members of the production team were in Berlin testing actors, with filming to commence in July. On July 30, 2018, Priyanka Chopra was cast in the lead female role opposite Pratt. The film was set to release on June 28, 2019, but was pulled from its release schedule in August 2018. In October 2018, Universal announced that the film had been shelved.\nReferences"
    }
  ]
}