{
  "content": [
    {
      "type": "text",
      "text": "# Coy Stewart\n\n| birth_place        = Columbia, South Carolina, U.S.\n| death_date         =\n| death_place        =\n| nationality        =\n| other_names        = Tyson StewartKOI (2018–2022)SWIM (2022–present)\n| occupation         =\n| yearsactive        = 2010–present\n}}\nTyson Coy Stewart (born June 24, 1998), also known under the stage name SWIM (formerly KOI) is an American actor, rapper, and singer. He had a role in the TBS sitcom Are We There Yet?, as Flint in the ABC superhero drama series Agents of S.H.I.E.L.D., Marcus in the PBS Kids Go! series The Electric Company, Troy in the Nickelodeon sitcom Bella and the Bulldogs and Lorenzo in Netflix sitcom Mr. Iglesias.\nHe voiced Benson in the Netflix animated series Kipo and the Age of Wonderbeasts.\nIn 2019, Stewart founded the hip-hop collective PartyOf2 (then known as Grouptherapy), alongside fellow former child actors Jadagrace, Tyrel Jackson Williams, and Elijah Johnson.\nEarly life\nStewart was born in Columbia, South Carolina. His interest in acting began after reciting lines from popular television series. He then joined a talent agency in Columbia, DeAbreu Modeling and Consulting, before playing Travis Younger in a stage production of A Raisin in the Sun.\nCareer\nActing career\nIn 2010, Stewart began his career with his role as Kevin Kingston in the TBS sitcom Are We There Yet?. In March 2011, Coy won the Young Artists Award for Best Supporting Young Actor in a Comedy or Drama for his role as Kevin in Are We There Yet?. In the same year, he played Marcus Barnes on the PBS Kids Go!-Sesame Workshop comedy edutainment sitcom, The Electric Company.\nIn, January 2012, Coy's father, Derek Stewart, published a non-fiction book titled The Unlikely Journey that chronicles Coy's journey into the entertainment business.\nHe played the role of Troy Dixon in the Nickelodeon series Bella and the Bulldogs. He starred as Xavier in the 2016 comedy horror web series WTH: Welcome to Howler. In August 2017, Coy Stewart played the primary role in the music video and short film of the song \"1-800-273-8255\" by rapper Logic which deals with the issues of homosexuality and suicide. In November 2017, it was announced that Stewart had been cast in Agents of S.H.I.E.L.D. as a young Inhuman called Flint. In late 2018, Stewart was cast in a recurring role on the Netflix sitcom Mr. Iglesias.\nMusical career\nStewart, along with friend Tyrel Jackson Williams and Jadagrace, formed the music collective \"Grouptherapy\". On April 1, 2020, the collective released their debut EP entitled this is not the album. and later released their debut mixtape, there goes the neighborhood. on October 30, 2020. The trio released their debut album, \"I Was Mature for my Age, But I Was Still a Child\" on June 27, 2023.\nFilmography\nFilm\n{| class=\"wikitable sortable\"\n! Year\n! Title\n! Role\n! Notes\n|-\n| 2015\n| Jingle Hit Factory: Detention\n| Devin\n| Short\n|-\n| 2015\n| Throwing Snowballs\n| Troy\n| Short\n|-\n| 2015\n| Christian\n| Christian\n| Short\n|-\n| 2017\n| ''Devil's Whisper\n| Gavin\n|\n|-\n| 2017\n| Deadly Detention\n| Kevin\n|\n|-\n| 2017\n| House Of The Witch\n| Dax\n|\n|-\n| 2018\n| The Judgment of Kyle Noble\n| Malik Martin\n| Short\n|}\nTelevision\n{| class=\"wikitable sortable\"\n! Year\n! Title\n! Role\n! Notes\n|-\n| 2010\n| The Glades\n| Declan\n| Episode: \"Mucked Up\"\n|-\n| 2010–2013\n| Are We There Yet?\n| Kevin Kingston-Persons\n| Main role\n|-\n| 2011-2012\n| The Electric Company\n| Marcus Barnes\n| Main role (season 3 & 4)\n|-\n| 2013\n| Good Luck Charlie\n| Warren\n| Episode: \"The Bug Prom\"\n|-\n| 2015\n| Nickelodeon's Ho Ho Holiday Special\n| Himself\n|\n|-\n| 2015–2016\n| Bella and the Bulldogs\n| Troy Dixon\n| Main cast\n|-\n| 2016\n| NCIS\n| Brandon Conway\n| Episode: \"Home of the Brave\"\n|-\n| 2016–present\n| WTH: Welcome to Howler\n| Xavier\n| Main role\n|-\n| 2017\n| House of the Witch\n| Dax\n| Television movie\n|-\n| 2017–2020\n| Agents of S.H.I.E.L.D.\n| Flint\n| Recurring role\n|-\n| 2019\n| The Blacklist\n| Vontae Jones\n| Recurring role\n|-\n| 2019–2020\n| Mr. Iglesias\n| Lorenzo\n| Recurring role\n|-\n| 2020\n| Kipo and the Age of Wonderbeasts\n| Benson\n| Main voice role\n|-\n| 2022\n| Grey's Anatomy''\n| College Roommate\n| Episode: \"Wasn't Expecting That\"\n|-\n| 2022\n| Family Reunion\n| Godz Sun\n| Episode: \"Remember the New Addition to the Family?\"\n|-\n|}\nMusic video\n{| class=\"wikitable sortable\"\n!Year\n!Title\n!Artist\n|-\n| 2017\n| \"1-800-273-8255\"\n| Logic ft. Alessia Cara, Khalid\n|}\nReferences\nExternal links\n* [https://web.archive.org/web/20170913232747/http://chaysecoyentertainment.com/coy-stewart/Coy Stewart's page on his family's website]\n*"
    }
  ]
}