{
  "content": [
    {
      "type": "text",
      "text": "# Crash boats of World War II\n\n, in Dayton, Ohio]]\nCrash boats, at the time known as \"aircraft rescue boats\" or  \"air-sea rescue boats\", were United States high speed boats built to rescue the crew of downed Allied aircraft during World War II. US boats came from the observation of British experience with high-speed launches (HSL) by the Royal Air Force Marine Branch during the Battle of Britain.\nBy the end of World War II, America had produced 300,000 planes, creating a need to have crash rescue boats stationed around the globe. These boats were fast boats used to rescue pilots, crew and passengers from downed aircraft in search and rescue and air-sea rescue missions. The boats would race out to a crash site and rescue wounded aircrew.\nSome speed boats built before the war were acquired and converted to be crash boats and many new boats were built. Standard crash boats were built in four lengths for World War II. The smallest standard size boat was 42 feet long, while the larger boats were 63, 85 or 104 feet long. They were built for the Army Air Forces and the US Navy, while some were transferred to the Allies. The design was similar to patrol boats built for the war, but with less or no armament and first aid equipped. The boats were designed to be light and fast to be able to get to the downed aircrew as fast as possible.\nMost were used in the Pacific War across the vast South Pacific, primarily in island hopping. Some were stationed on the West Coast of the United States to support the vast training centers. Many were designated Air Rescue Boats or ARB or AVR or P or C or R Hull classification symbol. After the war, most were abandoned or destroyed, though a few served in the Korean War (with United States Air Force), while some sold to private and some donated to Sea Scouts. By the Korean war the helicopter had taken the place of the crash boat in rescuing pilots and aircrews.\n42-foot\nThe 42-foot crash rescue boat was built for the Army Air Forces Air-Sea-Rescue teams. The  boat used design 221, with twin gasoline-powered engines and two screws. These used two Hall-Scott/Hudson Invader Marine Engine or a Kermath Sea Ranger 6 Marine engine. Due to the small size, these were used in close-to-shore rescue. The boat had no armament. The 42-foot boats were built by Hunt Boat Company, in Richmond, California, Palmer Scott & Company in New Bedford, Massachusetts and Palmer Johnson Yachts in Sturgeon Bay, Wisconsin.\nUS Army 42footairsearescueboat schematic 221 (2).jpg|42 foot boats built for US Army, cutaway\nUS Army 42footairsearescueboat schematic 221.jpg|42 foot boats built for US Army\n63-foot\nThe 63-foot crash boats are known as AVR-63 or Class III boats (AVR meaning Auxiliary, Vessel, Rescue). The  crash boat had two main models: the 314 design and the 168 design. They weighed , had a length of , beam of , draft of , a lite 37,000&nbsp;lbs and full up to 50,500&nbsp;lbs. Design 314 was powered by two  Hall-Scott Defender V12 petrol engines with a top speed of . The 168 design was powered by two Packard 4M-2500 with . They had a crew of 7 or 8 and were armed with two .50 calibre M2 Browning machine guns. The Model 314 boat had two rigid  United States Rubber Company bullet sealing fuel tanks, while the 168 design had three tanks.  In addition to the main two designs, there were multiple sub design models: 127, 152, 252, 293, 416, 440, Mark 2, Mark 3, Mark 4. By the end of the war, 740 of the 63-foot boats were built by 15 shipyards. The first 63 foot, model 127, was built by Miami Shipbuilding Corporation and used four Kermath 500-hp Sea Raider engines, as the Packard and the Hall-Scott engines were available. The eight model 127 went to South Africa, as did the later model 252. A few 63-foot boats were built post World War II, noted as Mark 2, 3, and 3 models. Model 152s were sent to Great Britain; these has a Watson-Flagg VeeDrive Gearbox added to them. Model 168 was built for US Navy with two 1250-hp Packard 4M-2500 marine engines for a top speed of 48 knots (55&nbsp;mph). Model 440s were designed \"Q\" boats for six US Army command boats . Model 416s were the same as the standard 314, but with a firefighting system added, plus two water nozzles added to the forward deck.\nNot all 63-foot boats were used for Crash boats. Model 293s were designed to be offensive. The Model 293s were PTC, or SC for Small Sub Chaser. Some Model 293s were transferred under Lend-Lease to Russia and classified RPC for Russian Patrol Craft. Model 293s were armed with Oerlikon 20mm cannon, depth charges and an extra fuel tank.\nThe 63-foot boats were built by Harbor Boat Building Company on Terminal Island in San Pedro, California, Fellows & Stewart in San Pedro, California, Stephens Bros. Boat Builders in Stockton, California, South Coast Shipyard in Newport, California, and Miami Shipbuilding Corporation, Miami, Florida.\nThe British Power Boat Company built the Type Two 63 ft HSL 63-foot crash boat for the UK from 1937.\nUSAF 63ft Mk II air sea rescue boat underway in 1953.jpg| air-sea rescue boat\n63footairsearescueboatUSNavy.jpg| air-sea rescue boat\nASR-313, US ROTC, 1984.jpg|63-foot ASR 313 built in 1943 with Reserve Officers' Training Corps in 1984\nStephensBrosBoatBuildersAVRs_1944.jpg|Stephens Bros. Boat Builders in Stockton, California, with 63-foot in 1944\nTransfer 63ft patrol vessel 1942 to Russians.jpg|Model 293 transferring to the USSR as a patrol vessel in 1942\nUS Army 65ft Crashboat AVR, 1945.jpg|63-Foot Crash boat AVR at sea 1945\n85 foot\nThe 85-foot crash boats are known as the ASR-85s or Class II boats. ASR-85s are known for having both speed and range, being able to recover downed crews several hundred miles offshore. The 140 built  crash boats are powered with two 1,500-hp (1,100-kW) Packard Marine 4M-2500 engines, with a top speed of 40 knots (74-km/h; 46-mph), and a range of 2,500 miles. ASR 85 boats used 140 gallons per hour of 87-91 octane gasoline. Tender ships would refuel and restock boats not stationed at harbors. Boats had no armament or were armed with twin 50 caliber machine guns and a 20-mm Oerlikon anti-aircraft gun. The ASR-85s had a crew of 12 men: one master, two engineers, one first mate, one navigator, one radio operator, three Able seaman, one oiler, one Emergency medical technician, and one cook. However, cross training on these small boats was mandatory.  ASR-85s were built by 14 shipyards: Wilmington Boat Works in Wilmington, California, Peterson Builders and Simms Bros. in Dorchester, Boston, Herreshoff Manufacturing in Bristol, Rhode Island, Burger Boat in Manitowoc, Wisconsin, Dooley's Basin & Dry Dock in Fort Lauderdale, Florida, Cambridge Shipbuilding in Cambridge, Maryland; Daytona Beach Boat Works in Daytona Beach, Florida; Eddy Shipbuilding in Bay City, Michigan; Henry B. Nevins, Incorporated in City Island, Bronx; Peterson, Julius in Nyack, New York; Robinson Marine in Benton Harbor, Michigan; Truscott Boat & Dock Co. in St. Joseph, Michigan and Fellows & Stewart in San Pedro, California.\nAVR 661, one of the 85-foot crash boats, was placed on the U.S. National Register of Historic Places in 1980.\nP-550 is the only restored to original 104s crash boat. P-250 was stationed at Avila Beach, California for World war II, supporting training at Amphibious Training Base Morro Bay and other training camps and airfields near San Luis Obispo like Camp San Luis Obispo. P-520 then served in the Korean War from 1950 to 1952. P-250 was built by Casey Boat Builders in 1943.\nUS Army Crashboat ASR85 P-478 1943.jpg|Crash boat Type ASR85, P-478 in 1943\nUS Army AF ASR85footcrashboat-outline.jpg|85-foot crash boat\nAirForce85-footcrashrescueboatKorea.JPG|US Air Force 85-foot crash rescue boat in Korea\nP-520 Crash Rescue Boat, 2007.jpg|Air Force Reserve Airmen from the 304th Rescue Squadron, on P-520 a Crash Boat on the Willamette River in Portland, Ore.\n104 foot\nThe largest of the crash boats, the 104-foot crash boats, are also called \"Class I\" boats or 104s. The  used Design 235, and were built with emergency medical facilities which could accommodate up to 23 people. The crew of 12 were all cross-trained to operate any part of the boat. The boats have a length of 104&nbsp;ft (32 m), powered by three 625&nbsp;hp (466&nbsp;kW) Kermath V12 engines, and included 3 screws. The boat had a top speed of 18 knots (33&nbsp;km/h; 21&nbsp;mph). The 104-foot was large enough to operate in the open ocean easily. Some 104-foot boats worked in the Gulf of Alaska and Aleutian Islands; these had cold weather options installed. The cold weather options had a heating system, ice protection on the hull, and insulation. Many of the 104-foot boats served in the South Pacific and the Caribbean. The 104-foot boats were built by Dooley's Basin & Dry Dock; Casey Boat Builders in Fairhaven, MA; Ventnor Boat Works of Atlantic City, NJ; Dachel-Carter Shipbuilding, Benton Harbor, MI; Brownsville Boat of Brownsville, TX; Sagstad Shipyard, Seattle, WA.; Stephens Brothers of Stockton, CA.\n, which was one of these boats during World War II, was converted into a medical ship for Canada, and was an oceanographic platform until its sinking in 1976.\nUnited States Coast Guard\nThe United States Coast Guard operated 83-foot patrol boats, which were also used in rescue work.\nOther crash boats\n* Some stock recreational speed boats were purchased for near-shore crash boats for the Army and Navy, which 22 to 42 feet in length.\n* Chris-Craft  built 31 22-foot boats in 1943, J 631-661, for the US Army.\n* , which as built in 1919.\n*Some  80-foot PT boats, with three engines and four 21\" torpedoes, were put into service as crash boats.\n* RCAF Nictak (M 447), a Motor Torpedo Boat built in 1941, was later used as a high speed rescue launch for rescue work\n*, which was built in 1917\n*40-foot, 45-foot, and 65-foot US Navy rescue boats were also built, along with 19 foot airboat US Navy rescue boats.\nMotors\nHall Scott Defender\nHall Scott Defender powered most 63-foot Rescue Boats. The Hall Scott Defender is a straight-six engine with overhead valves and two spark plugs per cylinder. The engine uses two updraft carburetors. The first run of 1996 CID had 575&nbsp;hp, while the next run was supercharged and bored and had 700&nbsp;hp.\n{| class=\"wikitable\"\n|-\n| 63&nbsp;ft. Rescue Boat model #  || Number built  || Number of Engines  || Total Engines  || Notes\n|-\n| 152  || 8  || 2  || 16  || For British boats.\n|-\n| 293  || 76  || 2  || 152  || Used in subchaser version of the boat.  Some sent to Russia.\n|-\n| 314  || 352  || 2  || 704  || Used in 240 US Navy 240 boats. Some boats sent to the Netherlands and the UK.  The U.S.C.G. received 29 and U.S. Army Air Force received 54. Australia was sent 20.  The ones that went to the Coast Guard became its standard 63-foot rescue boat for World War Two and  into the 1950s.\n|-\n| 416 or Type 3  || 79  || 2  || 158  || Used in 416 US Army specifications boats.\n|-\n| Mark 2  || 16  || 2  || 32  ||\n|-\n| Mark 3  || 69  || 2  || 138  ||\n|-\n| Mark 4  || 9  || 2  || 18  ||\n|-\n| Total  || 609  ||    || 1,218  ||\n|}\n*Hall-Scott produced Invader engines built in 1942:.\n{| class=\"wikitable\"\n|-\n! Type !! Number built with Invaders !! Engines per boat !! Total Engines !! Notes\n|-\n| U.S. Navy-Army 63-Foot Rescue Boat || 20 || 2 || 40 || US Army received 6 of the V-12 Defender engine.\n|-\n| U.S. Army 42-Foot Rescue Boat ||   || 2 ||   || The 42-foot rescue boats were built with either Kermath Sea Raider or Hall-Scott Invader engines.\n|}\n*Engines for US Army Aircraft Rescue Boat 104 foot (P110-115 141-145)\n{| class=\"wikitable\"\n|-\n! Type !! Number built !! Engines per boat !! Total engines !! Notes\n|-\n| 104 foot ARB  || 11 || 3 || 33 || There were 93 104-foot rescue boats built.  The original series had Kermath Sea Raider engines.  The next series, known as the 200 series, was powered by the Hall-Scott Defender.\n|}\nPackard V12\nThe 85-foot crash boat used two Packard V12 Marine Engine engines, Packard V12 4M-2500. This was the same engine in the PT-boats, but PT boats had three engines. The 1,200&nbsp;hp to 1,500&nbsp;hp used 91 to 100 octane gas. The engine used a supercharger. The engine had a four-stroke, 60-degree V-12 with a 6.40-inch bore and a 6.50-inch stroke. The engine had 2,490 cubic inches and four valves per cylinder. To keep weight down this was an aluminum block with steel cylinder sleeves, each weighing 2,900 pounds. The engine had a 6.4:1 compression ratio.\nKermath\nKermath Engines built two engines the Sea Raider Special that is a V12 engine the original one used in 104-Foot boats, Sea Raider Special have four overhead valves per cylinder, overhead cams and two spark plugs per cylinder. Outputting 450 to 550&nbsp;hp each. The 104-Foot boats used.  The Sea Raider Six engine was used in 42-foot boats, this is straight six with four overhead valves per cylinder and overhead cam. Two spark plugs per cylinder, with 260&nbsp;hp. The Sea Raider Six had a 4.9 to 1 compression ratio and used 72 octane gasoline.\nPlace names\nCrashboat Channel in Hawaii () is named for the crash boats of World War II that rescued pilots who met misadventure in the vicinity of Kaneohe Bay, Oahu.\nSee also\n*Beach Jumpers crash boats operation\n*30' surf rescue boat\n*22nd Crash Rescue Boat Squadron\n*Dumbo (air-sea rescue)\n*For Those in Peril (1944 film)\n*United States Nasty-class patrol boat 1962–1968\n*Mark VI patrol boat  (2015–2017)\n*Emergency Shipbuilding Program\n*List of shipbuilders and shipyards\n*Royal Air Force Marine Branch\n*Response Boat – Medium\n*Wooden boats of World War II\nReferences\nExternal links\n*[http://shipbuildinghistory.com/smallships/armypboats.htm U.S. Army Air-Sea-Rescue Boats (P) Built During WWII]"
    }
  ]
}