{
  "content": [
    {
      "type": "text",
      "text": "# Creativity, Culture and Education\n\n-->\n| vat_id            =\n| registration_id   =\n| founder           =\n| location          = Newcastle upon Tyne, England\n| coordinates       =\n| origins           =\n| key_people        =\n| area_served       =\n| product           =\n| mission           =\n| focus             =\n| method            =\n| revenue           =\n| endowment         =\n| num_volunteers    =\n| num_employees     =\n| num_members       =\n| subsid            =\n| opponents         =\n| owner             =\n| non-profit_slogan =\n| former name       =\n| homepage          =\n| dissolved         =\n| footnotes         =\n}}\nCreativity, Culture and Education (CCE) is a UK-based international foundation dedicated to unlocking the creativity of children and young people in and out of formal education. This is done primarily through designing and implementing programmes which improve the quality and reach of cultural education, and use culture and the arts to improve the quality and impact of general education, working with partners from around the world.\nCCE is a winner of a 2011 WISE Award from the World Innovation Summit for Education (WISE) foundation. The award recognised CCE's Creative Partnerships programme, which worked with over one million pupils across England, developing the skills of children and young people, raising their aspirations and opening up new opportunities.\nBefore creating CCE, Chief Executive Paul Collard had had over 30 years' experience of working in the arts. He is an expert in delivering programmes that use creativity and culture as drivers of social and economic change and in using arts and culture in urban regeneration. In 2015, he was appointed Honorary Professor at the University of Nottingham, School of Education.\nExamples of current and previous programmes and collaborations\n(in alphabetical order)\n* Artists in Creative Education – CCE led a group of European partners in a project bringing together twenty-five experienced artists from across Europe, looking at the role of the artist-educator in the classroom and within the wider creativity offer and testing the collective knowledge in exchange visits to schools in disadvantaged areas. The project resulted in the publication of Artists in Creative Education: Unlocking Children’s Creativity – A Practical Guide for Artists (2011), created in partnership with Cultuur-Ondernemen (‘Culture Entrepreneurship’, the Netherlands), Kulturkontakt Austria and Drömmarnas Hus (Sweden) and with the outline created by the participating artists.\n* Artists in Creative Education UK/Pakistan – This 2013 programme was an international artist exchange co-organised with Ikon Gallery in Birmingham and Vasl Artists’ Collective in Karachi and supported by the British Council in Karachi. CCE delivered an intensive induction and training week for the Pakistani and UK artists and visited the participating schools in Karachi, among others. The artists carried out extensive project work in schools in both countries. Their role was to explore the application of creative practices in the curriculum, to illustrate the power of creativity in the learning process to prepare students for modern workplaces, and to help change teaching practices and the role of teachers.\n* Arts Council of Wales – CCE has been working with the Arts Council of Wales and the Welsh Government on the development and implementation of a cultural education strategy Creative Learning Through the Arts – an Action Plan for Wales.\n* City of Amsterdam, the Netherlands – In 2010, Paul Collard, Chief Executive of CCE, was commissioned as an advisor to the City of Amsterdam to look at their cultural infrastructure and how to bring this and access to creative industries employment closer to children and young people. In 2016, another report was commissioned and published, this time addressing the relationship between cultural institutions and schools aimed at developing dialogue-driven programmes.\n* Creative Partnerships (England) – Creative Partnerships was a major England-wide programme that aimed to build sustainable learning partnerships between schools, creative and cultural organisations and individuals in order to nurture the creativity of children and young people. The funding by Arts Council England was withdrawn in 2011.\n* Creative Partnerships: Ås (Norway), Czech Republic, Karachi (Pakistan), Lithuania, Oppland (Norway) and Pécs (Hungary) – Programmes modelled on the England-wide Creative Partnerships programme have been introduced in several countries across Europe and beyond.\n* Creative Scotland, Education Scotland – CCE has delivered a range of training workshops and professional development activities for a number of local authorities and creative learning networks in Scotland. In 2016, CCE is supporting Creative Scotland’s review of the role of creative learning in its strategic plan and Education Scotland in ensuring that the Scottish Government’s Attainment Challenge goals in respect to creativity and creative learning are met.\n* Find Your Talent – Find Your Talent was a 2008–2010 government-funded programme trialled in ten areas of England which gave children and young people the chance to try out different high-quality cultural and creative activities in and out of school.\n* International Creative Education Network (ICEnet) – CCE is one of the core founding members of this European network of practitioners working in creative education. One example of the partnership’s projects was developing a Self-Assessment Competency Framework for Creative Practitioners working in educational settings to develop the creativity of children (2015), along with case studies and policy recommendations, informed by the expertise of the thirteen partners as well as artists and other creative professionals from around Europe.\n* Kulturschule, Germany – CCE has collaborated on this cultural education programme with Gabriele Fink Stiftung since 2011. CCE’s involvement has included training for schools and artists, providing diagnostic tools for schools or supporting the research and evaluation programme. The programme has aimed to put culture at the heart of school development and education to help children and young people learn deeply.\n* Open for Business – CCE designed and delivered the education programme for a 2013–2015 photography project Open for Business organised by Multistory in partnership with Magnum Photos, the Financial Times and other organisations and supported by Arts Council England and Sandwell Council. The work included training for teachers, educators and local photographers as well as developing a curriculum framework for schools to encourage better use of photography.\n* Perth, Western Australia – In 2011, Paul Collard was appointed the Commissioner for Children and Young People's inaugural Thinker in Residence under the theme of Unlocking Creativity. As part of the role, he researched how well the arts, culture and education were developing children’s creativity, preparing them for work in international settings and showing the opportunities within creative industries, with the outcomes and recommendations presented in a report. The successful residency led to further work with the Western Australia Museum on how to embed creativity and creative learning in the new museum’s design and work and arrangements for a 2016 residency supported by the Department of Culture and Arts of Western Australia.\n* South Korean Teacher Exchange Programme – CCE was the UK coordinator of the 2013 and 2014 Teaching Abroad for Global Competency Programme organised by the UNESCO Asia-Pacific Centre of Education for International Understanding (APCEIU) and sponsored by the Ministry of Education of the Republic of Korea. Over the two years, CCE hosted 25 South Korean teachers and, on top of preparing a programme of activities, recruiting host schools in the North East England and supporting the teachers throughout their stay, it provided an intensive training and reflection programme to complement school placements.\nReferences\nExternal links\n* [http://www.creativitycultureeducation.org Creativity, Culture and Education] home page\n* [https://twitter.com/CCEinsights Creativity, Culture and Education on Twitter]\n* [https://vimeo.com/ccevideo Creativity, Culture and Education on Vimeo]\n* [https://web.archive.org/web/20080509061733/http://www.creative-partnerships.com/ Creative Partnerships]\n* [http://www.findyourtalent.org Find Your Talent]"
    }
  ]
}