{
  "content": [
    {
      "type": "text",
      "text": "# Credibility revolution\n\nIn economics, the credibility revolution was the movement towards more rigorous empirical analysis. The movement sought to test economic theory and focused on causative econometric modeling and the use of experimental and quasi experimental methods. These more advanced statistical methods gave economists the ability to make causal claims, as the discipline shifted towards a potential outcome framework.\nThe revolution began in the 1960s when governments began to ask economists to use their skills in economic modeling, econometrics and research design to collect and analyze government data to improve policy making and enforcement of laws. A good example is research on discrimination carried out by the Equal Employment Opportunity Commission (EEOC). Grounded in legally required data from all US employers with 100 or more employees, economists, led by Phyllis Wallace, showed systematic discrimination in employment by race and sex. Their work led to successful discrimination cases in the utility, pharmaceutical and textile industries. Francine Blau and others continued to use EEOC and other data to more rigorously test for wage differentials and occupational segregation by race and sex.\nAdvances in econometrics allowed economists to identify effects, primarily through random variation, that could be estimated as causal. For example, Ann Dryden Witte provided rigorous econometric testing of the hedonic model of housing prices and the economic model of crime. Dryden Witte also used both experimental and quasi experimental designs to evaluate criminal justice policies and programs.\nThe 2021 Nobel Prize in Economics was awarded to David Card, Joshua Angrist and Guido Imbens for their work in fostering the credibility revolution. Alan Krueger is closely associated with the work of the three economists though died two years before the prize was awarded.\nThe term \"credibility revolution\" was coined by Joshua Angrist in 2010, in his paper describing the changes in empirical economics that had occurred as a result of this revolution. This paradigm shift in econometrics disputed many of legacy criticisms of econometric modeling.\nMethods\nOne core method that led the credibility revolution was the application of regression discontinuity design (RDD) in microeconomics. RDD allows economists to exploit small variations around a threshold or arbitrary cutoff - a discontinuity - to identify differences among groups.\nOther methods, including potential outcomes effect estimation through the average treatment effect (ATE) is able to reframe causal inference as a missing data problem, and evaluate the difference between observable units as the supposed difference across all states of the world.\nSee also\n*Econometrics\n*Rubin causal model\n*Experimental economics\nReferences"
    }
  ]
}