{
  "content": [
    {
      "type": "text",
      "text": "# Creeking\n\nTwo kayakers watch their friend (Ewan Nevill) at the lip of a  waterfall\nCreeking (sometimes called steep creeking or treetop boating or creekboating) is a branch of canoeing and kayaking that involves descending very steep low-volume whitewater. It is usually performed in specialized canoes and kayaks specifically designed to withstand the extreme whitewater environment in which the activity occurs. In addition, the canoes and kayaks give the paddler improved performance and maneuverability needed to avoid river obstacles.\nDescription\nCreeking\nCreeking usually involves the descent of waterfalls and slides, but equally applies to any steep low volume river. Creek characteristics can vary greatly, from very smooth granite like Cherry Creek in California where there are no loose rocks and most features are slides and waterfalls, to boulder gardens such as the Stein River in British Columbia where rapids are formed between rocks with features including sieves (siphons), step drops, holes, and undercuts.\nCreeking tends to be more dangerous and extreme than other varieties of kayaking such as freestyle or sea-kayaking. As such the sport of creeking usually requires extra gear that is not necessary in regular canoeing and kayaking. This equipment includes: throw bags, elbow pads, float bags, pin kits, first aid kits, repair kits, and sometimes the addition of a face mask to the helmet.\nCreeking is also local slang, in the Appalachian region of the United States, as a phrase to define walking or hiking barefoot in a creek or stream. This is a summer-time activity for many children that grow up in rural areas.\nMulti-day creeking\nA paddling trip usually done by a group where they will descend a technical creek over a period of days. The group will usually survive on supplies they begin the trip with stored in their creek boats. The level of difficulty in creeking makes packing for overnight trips especially challenging as adding weight to the kayak can severely hamper the performance of the kayak, whereas canoes do not usually have as much of a problem. The placement of the gear within the kayak also impacts the performance of the boat as the center of gravity moves. Essential gear for multi-day trips includes fire starting gear, food and/or fishing line, and warm gear or a sleeping bag for the nights. Tents, sleeping pads, and cooking equipment are optional based on weight and space. This activity is comparable to mountaineering in scale and exposure, and mountaineering grade equipment is specifically favored for its weight characteristics.\nExtreme racing\nExtreme racing is a timed version of creeking. Many races have different classes including short boat, long boat, and hand paddle.    Notable examples are the North Fork Championship in the United States and the Teva Lea Race in Australia.\nUnique attributes\nSeasons\nWhitewater kayakers generally need specific water flows to do their sport, and creeking takes this requirement very strictly, as too little or too much water in a stream will have massive impacts on ease and safety. In eastern North America creeks usually only run in the spring as the rivers are fed by snow melt, and in the fall as this is generally the rainy season. In parts of the world where there are glaciers creeks may run in the spring, the heat of summer and then again in the fall giving kayakers three time windows to run the rivers. Arid parts of the world such as Australia need a period of rain in order to run their creeks. Creeks are more seasonally restrictive than rivers because they generally are only run in low volume while rivers can be run in higher volume, giving them a larger selection of water levels that are kayak friendly.\nClique creation\nWhen whitewater kayaking reaches the difficult levels of creek boating an interesting social phenomena can occur. Creek boaters will often only choose to kayak with the same group of proven paddlers and will only accept paddling with new paddlers who have proven credentials referenced by at least one of the core group members. This is primarily due to the level of safety required on a demanding river and the non-verbal communication demands. A paddler who is not prepared to handle the whitewater is both a danger to themselves and the group. It has been observed that this overall attitude is strikingly polar to the very social play boating and slalom scenes, but as with any social dynamic this is not universal. Part of this selectivity is that these individuals regularly place themselves in high risk situations for the benefit of their crew to help ensure a crew members safety.\nFirst descents\nMany of the world's creeks have yet to be explored in canoes or kayaks. The act of paddling a previously un-run stretch of whitewater is known as a first descent. Searching for hidden whitewater gems is an exciting and difficult endeavor many expedition boaters undertake. Un-run creeks with high quality whitewater are difficult to find in countries with heavy exposure to canoeing and kayaking. Expedition boaters seeking first descents will often travel to countries where whitewater boating is not widespread and many rivers and creeks remain un-paddled.\nUnique hazards\nPaddlers who engage in creeking are exposed to a variety of hazards, some of which are unique to the sport.\n* Sieves - One of the most dangerous of creeking hazards, a sieve is when the water in the creek travels underneath rocks as it continues downstream. A kayak may get sucked into a sieve and get stuck, holding the paddler underwater. If there is enough water the kayak will buckle and bend, trapping the kayaker inside. If the kayaker is swimming sieves are even more dangerous as the swimmer can be sucked into a sieve and held indefinitely without the chance of escaping a boat in the sieve to swim away.\n* Undercuts and pinning rocks - A kayak can become wedged into a crevice under a rock or between two rocks, on the stream bottom or against a wall. Similar to a sieve except that the water is flowing around rather than through the feature.\n* Strainers - Although not entirely unique to creeking, strainers or downed trees can be much more dangerous in creeks because they can often span the width of smaller river. Strainers can act like sieves, trapping boats and people on their upstream side.\n* Holes - Although not as large as river holes, holes in creeks can be very violent due to the steepness of the river. A hole is created by water abruptly rising over a feature on the bottom of the river, and then falling behind this feature. This will create a dip in the river that is lower than the surrounding water, which will then crash in to fill it. Because of the rise before this dip, most of the water filling the dip or hole is coming from downstream, creating an upstream flow of water in the middle of the river.\n* Waterfalls - High waterfalls can create dangerous landing situations where kayakers can break their back if they land too flat, or in shallow pools, break their ankles when they land too vertical.\n** Rooms of Doom - A room of doom is a cave behind a waterfall that is filled with the crashing water. When waterfalls are vertical the water will be diverted in all directions upon landing. This often begins to carve a cave in the rock at the falls bottom that is only as high as the waterline. It is possible for kayakers to get stuck in this cave behind the waterfall, creating a very dangerous situation where external rescue is almost impossible.\n* Chicken Heads (Rooster Tails) - In some areas of the world creeks often drop on long slides with intermittent waterfalls. Sometimes these slides have bulges of rock that stick up. As the water shoots off these they create a blast of water that has been described as looking like a chicken head with the nose pointing up stream, and a flair of water making up the back of the head. Chicken Heads can damage boats if they hit them on the way down, and can severely hurt a kayaker swimming down a slide as they are often hit at high speed.\n* Portages - Creeking class IV - V rivers often involves the need to walk around drops that are either unsafe or above a paddlers' skill level. However portaging around these drops can hold a unique set of dangers while the kayaker is forced to maneuver down steep, slippery sometimes canyon walls with a boat and paddle. In some canyon rivers a paddler can find themselves past the point of no return. This generally means that regardless of how hard the rapids are the option of portaging has been removed because the walls are un-scalable, or much more dangerous than running the river.\n* Isolation - Due to the rough nature of hard creeks the surround land is often very steep, and uninhabitable. This results in a challenging rescue situation in the event that a paddler is hurt mid trip. It is not uncommon for hurt paddlers to need to leave all their gear at the river and hike for long distances in order to get to help. In some circumstances rescue helicopters may need to be called in order for an air evacuation.\nRiver information\nIn order to safely creek boat a boater will seek information on the run before they embark. This information is often referred to as \"beta\", and will often include information on put in and take out, optimal river levels, dangerous rapids to look out for and trip duration. This information resource is not always easily available and for the harder runs the information is often obtained through interpersonal communication. This facet of creek boating adds to the clique creation. There are guide books that describe well known runs in detail, an example of which is Stuart Smiths Canadian Rockies Whitewater book.\nMoves\nCreeking comes with its own paddle strokes to master in order to safely proceed down the river.\n]]\n* Boof - The boof is likely the most creeking-centric paddle stroke, but can be used on rivers from time to time. The boof move is used to take the boater away from the base of a drop, and to also allow the boater to land a drop flat and in control instead of nose first. To perform the move the boater needs to time a powerful forward stroke at the lip of the drop. As they are pulling on their forward stroke they need to use their stomach muscles to pull their toes up, and as the paddle passes by their hips they will continue the stroke further than normal, pushing their body as far away from the lip as possible while keeping their toes high. In a canoe, the boof is similar.\n* Tuck - The tuck is used on waterfalls where landing flat would hurt the boater's back. As the kayaker paddles over the waterfall they will finish their last forward stroke by extending it so the active blade comes up at the tail of the boat and the off blade comes to rest at the nose of the boat. In this position the kayaker will tuck their head in behind their leading arm, as they lean forward pressing their chest against the spray skirt. In a canoe, the paddler simply buries his head against the front air bag and positions his paddle so that his face and shoulders are safe. Timing of the tuck can vary, as tucking throws the body forward and so if done too early on a large waterfall can cause the kayaker to over rotate, landing on their head.\n* Stomp - The stomp is used when landing a drop such as a waterfall and the angle of the boat is too flat (that is, the nose of the boat is nearly level with the stern) which can result in very high impact flat landings. To reduce the impact, the paddler may \"stomp\" their boat by throwing their legs downward to cause the nose of the boat to hit the surface before the midsection.\n* 45 - Is a reference to the angle at which the paddler attempts enters the water from a free falling vertical drop. Similar to the stomp a 45 differs only in the timing of changing the paddlers angle. A stomp attempts to utilize a boof then throw their legs downward to land with the nose of their boat hitting the water before their midsection. A 45 attempts to achieve the same goal without ever fully utilizing a boof. This strategy when done correctly yields a softer landing protecting the paddler from a larger impact yielded from a boof.\n* Hole Punch - In creeks and rivers paddlers sometimes need to force their boat through a crashing wave or hole. To punch through a hole the paddler generally tries to find the weakest part in it, or where a seam is evident and they will paddle as hard as they can towards it. The crucial moment is when the boat is just about, and beginning to hit the hole. At this moment the paddler must keep one blade deep in the water, with their upper hand held high, while they 'punch' it into the wave keeping the active blade in the water. This is because in holes water on the surface is going upstream and water under the surface is flowing down stream. The boater needs to pull on the water beneath the surface if they are going to be able to continue down stream without getting stuck in the hole.\n* Jet Ferry or Power Ferry (sometimes known as \"Surfing\")- Boaters may need to get from one side of the river to another without moving downstream. In a river with strong current this cannot be done without using river features as an aid. Boaters can use holes where the water is flowing upstream to move from one side of the river to another. If these holes or waves are on an angle the boater can quickly surf them across in a 'Jet Ferry'.\nSee also\n* Whitewater canoeing\n* Whitewater Kayaking\n* Freeboating\n* Narrows of the Green\n* Little White Salmon River\nReferences"
    }
  ]
}