{
  "content": [
    {
      "type": "text",
      "text": "# Creekside Discovery Centre\n\n| coords_ref       =\n| area             =\n| elevation        =\n| authorized       =\n| created          =\n| established      =\n| designated       =\n| opened           = 1999\n| owner            = National Grid\n| operator         = Creekside Education Trust\n| visitation_num   = 50,000 since 2002\n| visitation_year  =\n| visitation_ref   =\n| open             =\n| status           =\n| awards           = Runner up in the Introducing Young People to Nature in the Growing Localities Awards, 2013.\n| terrain          =\n| habitat          = Brownfield\n| water            =\n| plants           =\n| vegetation       =\n| species          =\n| collections      =\n| designation      =\n| disturbance      =\n| budget           =\n| publictransit    =\n| transport        =\n| free_label       =\n| free_data        =\n| other_info       =\n| facilities       = Education centre\n| website          =\n}}\nThe Creekside Discovery Centre is a  natural habitat in Deptford in the London Borough of Lewisham. It is owned by the National Grid and managed by the Creekside Education Trust. Formerly a gas works, the centre is a brownfield habitat incorporating the only existing sloping beach into Deptford Creek. Other habitats on the site include a pond, constructed in a project coordinated by the Creekside Education Trust in partnership with Lewisham College, and a sandbank, built in 2001.\nHistory\nThe Creekside Centre became a nature reserve as a result of an agreement between the Creekside Renewal Project and British Gas, the latter was unable to build on the site due to the existence of a large-diameter gas pipe on the site.\nIn 2015 the Friend’s of Creekside scheme was launched to help fund the charity, develop on-site facilities, and raise local awareness of the nature reserve.\nThe site contains a 250kg propeller from a former Scottish fishing boat, the Northern Star.\nWildlife\nat Creekside Discovery Centre]]\nHistorically the site has been associated with the black redstart, although habitat destruction in the wider area has meant they are no longer present. In 2011 sand martins began nesting in the sandbank on the site.\nTwo nationally rare species of wasps have been found on the site; the spider-hunting wasp Auplopus carbonarius and the mason wasp Microdynerus exilis.\nThe Creekside Discovery Centre is the only site in London on which the critically endangered small-flowered catchfly, a wildflower on the Plantlife Red List, has been identified. Across the surrounding conservation area, 300 species of wildflower have been identified.\nArchitecture\nThe original plans to develop an educational facility on the site involved a floating centre located in the creek itself. The eventual building design built was a timber framed, cedar-clad building, incorporating a brown roof was constructed in 2002 at a cost of £500,000.\n}}\nEvents\nThe Creekside Centre provides educational sessions for local schools, guided walks along Deptford Creek, special events for the public, and venue hire.\nIn 2012 the site hosted a performance of the Odyssey by local theatre group Teatro Vivo.\nFunding\nThe Creekside Centre has received funding from various sources including the City Bridge Trust. Since the autumn of 2020 the centre has received funding grants through a partnership with the company constructing the Thames Tideway Tunnel.\nReferences"
    }
  ]
}