{
  "content": [
    {
      "type": "text",
      "text": "# Crime in Queensland\n\non a Queensland Rail train, 2017]]\nCrime in Queensland is an on-going political issue. Queensland Police  is responsible for providing policing services to Queensland, Australia. Crime statistics for the state are provided on their website.  Official records show that reported offences against property and people has declined over the past 20 years to 2020.  The state has criminal codes for hooning, graffiti, sharing intimate images without consent and fare evasion. Wage theft became a crime in 2020. The minimum age of criminal responsibility in Queensland is 10 years old.\nThe long-term trend is for a decrease in crime in Queensland across all categories. Exceptions include rape, assault and shoplifting which have increased. The rate of youth offending is falling.  By age, the largest group of criminals was the 20-24 cohort.\nThe Crime and Corruption Commission (CCC) was created to combat and reduce the incidence of major crime and to reduce the incidence of misconduct in the Queensland public sector.  Complaints about the police are rarely investigated by the CCC which passes police matters back to the service for internal review.\nCommunity crime Facebook groups have grown in number and influence, becoming de facto lobby organisations. Police have raised concerns about the rise of vigilantism stemming from comments online.\nHistory\nIn July 1987, the Fitzgerald Inquiry began formal hearings.  The judicial inquiry investigated possible illegal activities and police misconduct. Fitzgerald's report was submitted on 3 July 1989. Queensland Police Commissioner Terry Lewis was charged with corruption and a number of politicians were charged with crimes. The Fitzgerald Inquiry lead to the establishment of Queensland's first anti-corruption body, the Criminal Justice Commission.\nCrime Stoppers Queensland was established in 1989.\nIn August 2013, the Queensland Police Service launched an online crime map to provide crime data to the public.  In October 2013, the Newman government led an unprecedented crackdown on outlaw motorcycle clubs.\nIn March 2023, Queensland police were given a substantial rise in powers. Legislation passed that allows Queensland police to use hand-held metal detectors to search people without reasonable suspicion in a crackdown on knife crime. In May 2023, an anti-crime rally was held in Rockhampton.  After the rally a group of about 60 people marched on the homes of alleged offenders.\nIn May 2025, the Queensland government made coercive control a criminal offense.\nIllicit drugs\nSmall scale drug possession laws were changed in 2023 with the introduction of a three-strike system that offers a caution to a first-timer, and diversion and assessment programs for anyone busted two or three times. In the same year, mobile and fixed site pill testing was introduced in an attempt to curb the harmful effects of illicit drugs. Queensland’s peak medical bodies welcomed the move towards a health-based approach to drug use.  The changes were made to save police time and to prevent further harm to small-time users.\nThe sale and distribution of illicit drugs is the most pervasive form of organised crime activity in Queensland. The largest bust of heroin in Queensland occurred in March 2023. 336 kilograms of heroin was sent in a shipment from Malaysia.  In 2023, one of the largest meth labs in Australia was discovered in three storage units at Rothwell. The industrial scale of the equipment and the amount of precursor chemicals found indicated an organised crime syndicate was behind the lab.\nYouth crime\nQueensland has adopted a “tough on crime” approach to youth crime. Save the Children Australia claims a \"child’s rights approach”, which would be more effective and humane.\nAboriginal and Torres Strait Islander children represented 60% of the number of children in detention. Queensland has the highest youth recidivist rate of any state or territory.  The state has three youth detention centres with a capacity to hold 306 children aged 10 to 18. Amnesty International Australia describes the current youth detention situation as a human rights crisis. Police watch houses are used to hold youth as an interim measure while they await court appearances or transfer to youth detention.  To alleviate pressure on watch house use a dedicated remand centre for young offenders is being built at Wacol.\nYouth crime reforms were introduced in April 2021.  These included new laws allowing teen offenders to be fitted with GPS trackers and the denial of the presumption of bail if caught committing serious offences while on bail.\nFurther youth justice laws were passed in early 2023. Breach of bail is now a crime for children. High-visibility police patrols and a trial of engine immobilisers in three regional cities were part of the reforms. Changes were made to youth crime laws for the second time in 2023, this time requiring suspension of the state's Human Rights Act.  They permitted the locking up of children in adult watch house for indefinite periods of time.\nBrisbane\nCrime statistics\nin Brisbane, 2018]]\nThe suburbs of Dunwich, Dutton Park, Moorooka, Acacia Ridge and Inala reported the most break-ins across Brisbane in the 10 years to 2019. Although Underwood and surrounds were identified as the state’s home break-in hot spot in 2012. Fortitude Valley is a hot spot for violent assaults.  Fortitude Valley has the vast majority of illicit drug detections for the city. Cannabis and amphetamine type substances are the most commonly used drugs in Brisbane.  Across the Brisbane metropolitan area there was an average of about 53 drug offences each day in 2018.\nInala had the highest number of car thefts in the year up to August 2023.\nNumber of total offenses in Queensland since 2012:\n2012: 437,863\n2013: 435,599\n2014: 440,986\n2015: 460,113\n2016: 503,278\n2017: 493,230\n2018: 516,899\n2019: 543,605\n2020: 501,134\n2021: 505,306\n2022: 561,629\n2023: 606,274\n2024: 624,569\n2025: 465,233 (November 1)\nPublic transport\nTrains and railway stations\nSome railway stations have issues with youth gangs and individuals harassing passengers and police officers.\nOther stations with just between four and six assaults in the same period were South Brisbane, Cannon Hill, Beenleigh, Central, Strathpine and Caboolture. Burpengary, Bald Hills and Indooroopilly train stations were the only on the Citytrain network to have a grievous assault - defined as potentially causing permanent injury or disability.\nQueensland Police Operations Support Command said in 2008 that the network is safe and that the rate of crime is not worse than that in the community in general, explaining that the perception it was higher was due to the close confines of being in a passenger train.  The network operator, Queensland Rail, implemented various security initiatives over more than a decade that includes closed-circuit television at stations and within trains, and patrols over the network and on-board services by Revenue Protection Officers, uniformed and plain-clothed police officers of the network's own squad, and security guards, to deter crime and assist with identifying offenders.\nBuses\nAttacks against bus drivers are uncommon but not unheard of in Brisbane. In late 2019, Translink, the city's bus network operator, launched a bus driver safety campaign in partnership with the Queensland Government. The campaign, See It From Their Side, funds a number of public awareness campaigns (television, radio, and print), the installation of physical safety measures, additional Senior Network Officers (transport fare and safety enforcement officers), and further policy development.\nYouth gangs\nYouth gangs have played a large part in the amount of crime occurring within various problem areas of Brisbane. Such violence prompted the Queensland Commissioner to reactivate a Youth Gang Task-force in 2008.\nOther crime\nIn October 2021, a wanted man tried to enter Queensland from New South Wales in a suitcase in the back of a truck. He was a drug smuggler and was not meant to leave his house. Police checked the vehicle because of the COVID-19 and were surprised when there was a knock on the wall.\nOperation Ironside resulted in the nation's biggest organised crime bust in June 2021. In Queensland, 38 people were arrested on more than 150 charges. Six major criminal syndicates were dismantled.\nCopper wire theft is a growing trend in South East Queensland with sporting clubs and construction sites targeted.\nIn June 2023, it was reported that an average of 55 car thefts occur across Queensland every day. Queensland is the state or territory where you are most likely to get your car stolen.\nBy 2021, the Queensland Police Service was responding to an average of more than 400 cases of domestic violence every day.\nIn April 2024, a Brisbane man was charged after being found to be the Australian leader of a transnational organised crime organisation that was responsible for smuggling in and distributing tonnes of drugs into Australia.\nSee also\n*List of people legally executed in Queensland\nReferences\nExternal links\n*[https://www.police.qld.gov.au/aboutUs/the_service/default.htm Queensland Police]"
    }
  ]
}