{
  "content": [
    {
      "type": "text",
      "text": "# Crime Patrol 2: Drug Wars\n\n|genre=Light gun shooter\n|modes=\n}}\nCrime Patrol 2: Drug Wars is a live-action laserdisc video game, released by American Laser Games in 1993. It was ported to the 3DO Interactive Multiplayer and CD-i. It is the sequel to the arcade game Crime Patrol, with very similar gameplay, objectives and scenery. The game was re-released by Digital Leisure in 2002.\nThe original Crime Patrol 2 arcade cabinets came in a variety of monitor sizes, including 25 inch, 33 inch, and 50 inch.\nPlot\nThe player steps into the shoes of an anonymous Drug Enforcement Administration agent whose goal is to track down and detain or eliminate a dangerous drug baron residing in South America, thus destroying his illegal cartel. Along the way, the agent will have to render any opposition harmless by any means necessary, as is the case in most other American Laser Games releases.\nAs in Crime Patrol, the player battles criminals and other villains in several widely varying environments. In the original game, however, the main character advances from the \"Rookie\" level to the \"Delta Force\" level, while in Drug Wars, he does not get promoted at any point, simply moving on from one location to another with few complex aims. Beginning in Sierra County, New Mexico, the agent continues to fight crime in Chicago, the United States-Mexico border and, finally, the baron's residence in South America. In each of these locations, the player can choose from three different assignments; when all three are complete, he moves on to the next location. The game is finished successfully by reaching and neutralizing the drug lord.\nGameplay\nThe seventh live-action shooting game released by American Laser Games is very similar to the company's previous releases Mad Dog McCree and The Last Bounty Hunter. Almost all possible choices are made by aiming the pistol the main character has at his disposal; this includes shooting enemies, reloading, selecting locations, options and pathways. When the player does not react in time and gets shot by a criminal, or happens to hit an innocent civilian, he or she loses a life, and is scolded, often sarcastically, by the partner assigned to the particular geographical location. The number of bullets in the gun's chamber is limited, but the weapon can be reloaded at any time.\nIn the PC version, decisions can be made by using a mouse or light gun, and several options, including a single save/load slot, are available.\nReception\n(3DO)\n}}\nPlay Meter listed Crime Patrol 2: Drug Wars to be the fifth most-popular arcade game at the time.\nReviewing the 3DO version, a Next Generation critic remarked, \"As we've come to expect, the full-motion video is slickly produced, but the screen res and frame rate are choppy, and ALM's overacting is still there.\" He also stated that the slow aiming cursor makes the game unplayable without a Gamegun. Air Hendrix of GamePro concurred that the FMV suffers from graininess, choppy frame rates, and overacting, but contended that both the control pad and Gamegun work poorly in the game. He concluded, \"If you chuckle through low-budget cop flicks, blasting through these cornball scenes might plaster a goofy grin on your face. Just rent it, though.\"\nReferences\nExternal links\n* [https://www.arcade-history.com/?n=crime-patrol-2-drug-wars&page=detail&id=4489 Crime Patrol 2] at Arcade History\n*"
    }
  ]
}