{
  "content": [
    {
      "type": "text",
      "text": "# Crime Doctor's Warning\n\n| screenplay     = Eric Taylor\n| narrator       =\n| starring       = Warner BaxterJohn LitelDusty Anderson\n| music          = Paul Sawtell\n| cinematography = L. William O'Connell\n| editing        = Dwight Caldwell\n| studio         = Columbia Pictures\n| distributor    = Columbia Pictures\n| released       =\n| runtime        = 70 min.\n| country        = United States\n| language       = English\n}}\n'Crime Doctor's Warning' is a 1945 American mystery film directed by William Castle, and fourth in the Crime Doctor series of ten films produced between 1943 and 1949.\nWilliam Castle made it just before leaving to help make The Lady from Shanghai.\nPlot\nClive Lake is a returning World War II veteran That visit Dr. Ordway's office to explain his concern about lapses in his memory. Dr Ordway, a psychiatrist, explains to lake that he may be experiencing 'transient amnesia'. The condition is characterized by headaches and no memory of the events. While painting a model, he begins to experience severe headaches. He calls Dr. Ordway to tell him he believes he's going to have another episode and to come to his studio apartment immediately. Clive explains to the model that he is going to go out to the roof to get some air and to clear his head. In the next scene we see someone sneaking into the apartment and attacks the model. The murderer dropped the key under the sofa.  During a party in Lake's apartment his beautiful girlfriend is found dead under a sofa, murdered. The police suspect Lake of the killing, but the Crime Doctor is not so sure, and proceeds to investigate further.\nCast\n* Warner Baxter as Dr. Robert Ordway\n* John Litel as Inspector Dawes\n* Dusty Anderson as Connie Mace\n* Coulter Irwin as Clive Lake\n* Miles Mander as Frederick Malone\n* John Abbott as Jimmy Gordon\n* George Meeker as Attorney #1 (uncredited)\n* Arthur Aylesworth as Attorney #2 (uncredited)\n* J.M. Kerrigan as Robert MacPherson (uncredited)\n* Alma Kruger as Mrs. Lake (uncredited)\nReferences\nExternal links\n*\n*\n*"
    }
  ]
}