{
  "content": [
    {
      "type": "text",
      "text": "# Critical Thinking (album)\n\n}}\nCritical Thinking is the fifteenth studio album by Welsh alternative rock band Manic Street Preachers, released on 14 February 2025 by Columbia Records.\nThe album was supported by four singles prior to its release, including \"Decline and Fall\". It was met with universal acclaim by music critics. The album features three tracks with bassist Nicky Wire on lead vocals, including the opening title track and \"Hiding in Plain Sight\", the band's first single which he sings. Frontman James Dean Bradfield wrote the lyrics to three tracks, the most on a Manic Street Preachers album to date.\nBackground\nThe album was announced with the release of \"Hiding in Plain Sight\" on 25 October 2024. About the background of the album, Nicky Wire said that is a \"a record of opposites colliding – of dialectics trying to find a path of resolution. While the music has an effervescence and an elegiac uplift, most of the words deal with the cold analysis of the self, the exception being the three lyrics by James, which look for and hopefully find answers in people, their memories, language and beliefs,\" Wire continued. \"The music is energised and at times euphoric. Recording could sometimes be sporadic and isolated, at other times we played live in a band setting, again the opposites making sense with each other. There are crises at the heart of these songs. They are microcosms of skepticism and suspicion, the drive to the internal seems inevitable – start with yourself, maybe the rest will follow.\"\nRegarding the album's more political lyrics, Wire stated that the \"left is really good at telling people off, which just makes everyone think: fuck off\" and says he knew that Trump would win the US election: \"It was so obvious to me. Politics is much more about mood and gesture than policy at the moment, and we live in an age of spectacle and eventisation\".\nThe album cover picture was taken by Welsh documentary photographer David Hurn in the Painted Desert, Arizona while he was travelling to photograph Navajo Native Americans after receiving \"a bi-centennial fellowship award by the American government\". Hurn described the site of the photograph as \"strange\", and \"as if someone drunk had been making a drawing on the road.\" Wire is a self-described \"long-time admirer of Hurn\".\nThemes and music\nWhen talking to NME, Nicky Wire stated that Critical Thinking is \"a different kind of record\" to previous Manics albums. Regarding the themes of the album, Wire stated:\"Sometimes you have to let that honesty out. I just went off myself a bit, but I always find myself to be my most dependable source of inspiration. I'm starting to lose that – but that's different to the lyrics from James [Dean Bradfield] on the album; his three songs have more of a sense of optimism to them.\"Wire stated the album includes themes of moral judgement, while Bradfield said the band had \"no real mission statement\", allowing for \"a sense of freedom\".\nThe band further explained that \"Dear Stephen\" is inspired by the time in 1984 when the Smiths played Cardiff University. Wire's mum wrote to the group explaining that her teenage son was desperate to see the band but was too ill to attend. The Smiths wrote back, with Morrissey scribbling “get well soon Nick” on a postcard. \"An almost spiritual antique\" is how Wire describes the note, which he recently rediscovered. \"Deleted Scenes\" finds Wire addressing the dangers of social media: “It's about the power to self-immolate on social media,” he explains, snapping his fingers. “Just like that. I worry I have the destructive tendency to actually enjoy doing it. If you're seeking oblivion, it feels like an attractive proposal at times.”\nAs for the singles, regarding \"Decline and Fall\" Wire stated that “Musically with 'Decline & Fall' we tried to create forward motion – a song which harnesses the past to propel it into the future – the lyric is one of realisation and understanding – of celebrating the tiny miracles that still exist whilst accepting and embracing managed decline.\". In \"Hiding in Plain Sight\", Wire is the lead singer and the band draws on classic '70s rock'n'roll of The Only Ones, Cockney Rebel and the loose flow of Dinosaur Jr.'s \"Freak Scene\", while \"People Ruin Paintings\", according to Bradfield, explores the “destruction of truth”. In the last single, \"Brushstrokes of Reunion\", Bradfield reflects on the power of a painting left to him by his mother while she was fighting cancer. The band stated that it has \"nods to imperial-era Waterboys, particularly the love and desperation of \"Rags\" – R.E.M.'s ''Life's Rich Pageant'' meets classic Manics crunch + velocity. Lyrically, [it's] about the hypnotic quality of a painting that's inherited from someone who has passed\".\nRelease\nCritical Thinking was scheduled to be released on 7 February 2025 by Columbia Records, but production delays meant that it was pushed back by a week to the 14th. The release coincided approximately with the 30th anniversary of the disappearance of former Manic Street Preachers band member Richey Edwards on 1 February 1995.\nBrushstrokes of Reunion EP\nOn 31 January 2025, preceding the release of Critical Thinking, an extended play (EP) was released, titled Brushstrokes of Reunion. The EP comprises the songs \"Brushstrokes of Reunion\", \"People Ruin Paintings\", \"Hiding in Plain Sight\" and \"Decline and Fall\", all taken from the album.\n| rev1 = Clash\n| rev1score = 8/10\n| rev2 = DIY\n| rev2score =\n| rev3 = The Guardian\n| rev3score =\n| rev4 = The Irish Times\n| rev4score =\n| rev5 = Mojo\n| rev5score =\n| rev6 = MusicOMH\n| rev6score =\n| rev7 = NME\n| rev7score =\n| rev8 = Record Collector\n| rev8score =\n| rev9 = The Telegraph\n| rev9score =\n| rev10 = The Times\n| rev10score =\n}}\nAndrew Trendell from NME gave the album 4 out of 5 stars, stating it \"finds no absolute design for life – but still plenty of fight\". Ed Power from The Irish Times called the album \"a scream into the void – a reminder that nobody rants better than the Manics.\" Power gave the album 4 out of 5 stars. Phil Mongredien from The Guardian gave the album 4 out of 5 stars, stating \"In the 90s, you'd have bet good money against the band growing older this gracefully, yet here we are with another reflective and thought-provoking set.\"\nFar Outs Kelly Scanlon gave the album 4 out of 5 stars, calling it \"an embrace into a territory we all know well, underscored by the familiar notes of indie-backed rage with a fervour that refuses to let up. Lyrically, it's almost easy to say this is the Manics' best work yet, and that's all made possible by the unrelenting energy of a voice that can't—and won't—settle for anything less than the raw truth.\" Danny Eccleston from Mojo gave the album four stars, calling it \"a songs-first concoction steeped in nostalgia.\"\nJohn Murphy from MusicOMH gave the album 4 out of 5 stars, stating that \"They may no longer be generation terrorists, but on this evidence they can still deliver a witheringly bracing state of the nation address\". The Quietus magazine gave the album a positive review, with Will Ainslee stating that \"To the uncynical, the occasional lyrical stinker doesn't distract from what is broadly a thoroughly enjoyable collection of songs. Critical Thinking is still very much a barnstorming Manics album, a state-of-the-nation address that will have many tuning in and nodding along.\"\nTrack listing\nAll tracks are written by James Dean Bradfield, Nicky Wire and Sean Moore, with additional writers listed below. Lyrics written by Wire except where noted.\n| title3        = Brushstrokes of Reunion\n| length3       = 3:35\n| writer3       =\n| extra3        = Bradfield\n| title4        = Hiding in Plain Sight\n| length4       = 3:34\n| writer4       =\n| title5        = People Ruin Paintings\n| length5       = 4:22\n| writer5       =\n| title6        = Dear Stephen\n| length6       = 3:31\n| writer6       =\n| title7        = Being Baptised\n| length7       = 4:02\n| writer7       =\n| extra7        = Bradfield\n| title8        = My Brave Friend\n| length8       = 3:23\n| writer8       =\n| title9        = Out of Time Revival\n| length9       = 2:55\n| writer9       = Dave Eringa\n| extra9        = Bradfield\n| title10       = Deleted Scenes\n| length10      = 3:23\n| writer10      =\n| title11       = Late Day Peaks\n| length11      = 3:14\n| writer11      =\n| title12       = OneManMilitia\n| length12      = 2:53\n| writer12      =\n}}\n| length1       =\n| title2        = Decline & Fall\n| note2         = demo\n| length2       =\n| writer2       =\n| title3        = Brushstrokes of Reunion\n| note3         = demo\n| writer3       =\n| length3       =\n| title4        = Hiding in Plain Sight\n| note4         = demo\n| writer4       =\n| length4       =\n| title5        = People Ruin Paintings\n| note5         = demo\n| writer5       =\n| length5       =\n| title6        = Dear Stephen\n| note6         = demo\n| writer6       =\n| length6       =\n| title7        = Being Baptised\n| note7         = demo\n| writer7       =\n| length7       =\n| title8        = My Brave Friend\n| note8         = demo\n| writer8       =\n| length8       =\n| title9        = Out of Time Revival\n| note9         = demo\n| writer9       =\n| length9       =\n| title10       = Deleted Scenes\n| note10        = demo\n| writer10      =\n| length10      =\n| title11       = Late Day Peaks\n| note11        = demo\n| writer11      =\n| length11      =\n| title12       = OneManMilitia\n| note12        = demo\n| writer12      =\n| length12      =\n| title13       = Decline & Fall\n| note13        = Steven Wilson remix\n| writer13      =\n| length13      =\n}}\n| length1       =\n| title2        = Johatsu\n| writer2       =\n| length2       =\n}}\nPersonnel\nManic Street Preachers\n* James Dean Bradfield – lead vocals, guitars, keyboards\n* Nicky Wire – bass guitar, guitar, keyboards, lead vocals (1, 4 and 12)\n* Sean Moore – drums, percussion\nAdditional musicians\n* Nick Nasmyth – keyboards\n* Gavin Fitzjohn – keyboards\n* Wayne Murray – guitar and backing vocals\n* Bernard Kane – strings\n* Lana McDonagh – backing vocals\nTechnical personnel\n* Dave Eringa – production and engineering; mixing (1, 3, 7, 8, 11 and 12)\n* Loz Williams – production and engineering\n* Jack Boston – additional engineering\n* Tom Lord-Alge – mixing (5, 6, 9 and 10)\n* Caesar Edmunds – mixing (2 and 4)\n* Matt Colton – mastering\n* David Hurn – cover photography\n* Alex Lake – band photography\n* Nicky Wire – art direction\n* James Isaacs / Black Finch Design – art design\nCharts\n{| class=\"wikitable sortable plainrowheaders\" style=\"text-align:center\"\n|+ Chart performance for Critical Thinking\n! scope=\"col\"| Chart (2025)\n! scope=\"col\"| Peakposition\n|-\n|-\n|-\n|-\n! scope=\"row\"| Croatian International Albums (HDU)\n| 14\n|-\n|-\n|-\n|-\n|-\n|-\n|-\n|-\n|}\nReferences\nExternal links\n*"
    }
  ]
}