{
  "content": [
    {
      "type": "text",
      "text": "# Croatian affairs in the Kingdom of Yugoslavia\n\nThe State of Slovenes, Croats and Serbs became merged with the Kingdom of Serbia and the Kingdom of Montenegro to form the nation of Yugoslavia in 1918. The formation of Yugoslavia began with the formation of the Yugoslav Committee, a collection of mostly Croats, then Serbs and later Slovenes, whose goal was to form a single south Slavic state. In October 1918 the Croatian Parliament declared the Kingdom of Croatia-Slavonia as an independent state, which, in December that same year, incorporated into the State of Slovenes, Croats and Serbs, merged with Kingdom of Serbia and Kingdom of Montenegro and created the Kingdom of Serbs, Croats and Slovenes. The kingdom would be renamed to Yugoslavia in 1929, and ruled by Serbian Karađorđević dynasty till Second World War.  After the formation of Yugoslavia, Serbia attempted to create a \"Greater Serbia\" by using police intimidation and vote rigging to establish a Serbian controlled Yugoslavia. From 1929-1941 Serbian controlled Yugoslavia established control over Croatia through Royal Yugoslav police force brutality and assassinations of important Croatians.\nThe Yugoslav Committee\nThe basis of State of Slovenes, Croats and Serbs and Kingdom of Serbia forming a union in 1918 is to be found in the complex history of the Yugoslav Committee. The Yugoslav Committee was formed by Croatian exiles living outside the Austro-Hungarian homeland during World War I. The Committee was led by Frano Supilo and Ante Trumbić and included the famous Croatian sculptor Ivan Meštrović. Each repudiated the Committee within a few years of the founding of Yugoslavia. \"Yugoslavs\" were Serbian, Croatian and Slovene people who identified themselves with the movement toward a single South Slavic state. Exiled Yugoslavs living in North America and Britain were the primary supporters of the Yugoslav Committee. Having established offices in London and Paris as early as 1915, the Yugoslav Committee became an active lobby for the cause of a united South Slav state during World War I.\nThe concept of a unified South Slavic state had been discussed by Croatian and Slovene intellectuals since the mid-nineteenth century. However, the \"Yugoslav Idea\" did not mature from the conceptual to practical state of planning. Few of those promoting such an entity had given any serious consideration to what form the new state should take,. Nevertheless, the Yugoslav Committee issued a manifesto calling for the formation of such a South Slavic state on May 12, 1915. The document, like the rhetoric of those who produced it, was vague concerning the form and system of government. It received little official recognition.\nAs the War dragged on, the Allies began to think of the concept of Yugoslavia as a blocking force in the Balkans to counter future German expansionism. Although no formal agreement was announced until July 1917, the Yugoslav Committee and the Serbian Government-in-Exile worked hand-in-hand from November 1916 onward. On July 20, 1917 the Serbian government and the Yugoslav Committee issued the text of an agreement known as the Corfu Declaration which called for the formation of a multi-national state. The vast majority of the Serbian, Croatian and Slovene people had no knowledge of the declaration made by a small group of exiled intellectuals and the Serbian Government-in-Exile. Nonetheless, the signers claimed to speak for all South Slavic peoples and the Corfu Declaration became the justification claimed by Serbia for the forced unification of Croatians and Slovenes under the Serbian crown.\nFormation of the Kingdom of Serbs, Croats and Slovenes\nAs the War drew to a close, the Austro-Hungarian Empire began to disintegrate. The Croatian Parliament (Sabor) met in Zagreb on October 29, 1918 to declare \"the Kingdom of Croatia, Slavonia and Dalmatia\" to be a free and independent state. All major parties from the Croatian Parliament had named representatives into the new National Council of Slovenes, Croats and Serbs that had been formed in early October 1918, and which in turn took control over most of the Austro-Hungarian possessions inhabited by South Slavs.\nOn November 24, the National Council declared the new state's unification with Kingdom of Serbia (who had already absorbed Kingdom of Montenegro), and its members started negotiating the terms with the Serbian Regent Alexander.\nStjepan Radić's Croatian Peasant Party participated in the National Council, but after it decided to merge with Serbia, they started to back off, calling the move foolish, and disputing the decision based on the fact that the Croatian Parliament never explicitly approved it.\nZagreb's brief jubilation quickly changed to the sober realization that Croatia would again be ruled from a foreign capital as Italian, French and French African forces invaded from the west and Serbian troops invaded from the east.\nOn December 1, 1918, Serbian Prince Alexander announced the formation of the Kingdom of Serbs, Croats and Slovenes, with a Serbian King ruling from the Serbian capital of Belgrade. Despite the neutral-sounding name, the country was called Yugoslavia by the diplomatic community almost from the beginning.\nKingdom of Serbs, Croats and Slovenes (1918–1929)\nThe greatest promoters of creating a state of the Southern Slavs, i.e. the idea of Yugoslavia, were the Croats (Josip Juraj Strossmayer on the first place), but they did not conceive of it as a centralized, Serb-dominated state. Their aim was to preserve the Croatian national identity and the sovereignty of Croatia and to organize the new state of South Slavs on a confederative basis.\nThat is why the Kingdom of the Serbs, Croats and Slovenes, established in 1918, did not obtain the confirmation and permission of the Croatian Parliament. This state, created in 1918 from Austro-Hungarian part, (Koruška, Štajerska, Kranjska, Istra, Dalmatia, Croatia - Slavonia, Vojvodina, Bosnia and Herzegovina) and Serbia and Montenegro, which were opposing sides during the First World War (1914–1918), contained a germ of numerous future conflicts. It was composed of different traditions, religions, nations, languages and scripts.\nFollowing the Vidovdan Constitution of 1921, in 1922 the region of Syrmia (the territory between rivers Sava and Danube), that was part of the Kingdom of Croatia-Slavonia before 1918, became part of the Syrmia Oblast. In 1929, most of Syrmia became part of Danube Banovina. In 1939, most of that in turn was left out of Banovina of Croatia.\nIn 1918 Croatia and Vojvodina had much better economic situation than  Central Serbia. In 1920 only 20% of adults in Central Serbia were literate compared to 88%, 52% and 36% in Slovenia, Croatia-Slavonia and Dalmatia respectively. Their rate of literacy has been 2.5 times higher. Croatia had double more elementary schools than Serbia. Croatian and Vojvodina had 4910&nbsp;km of railway track compared to 1187&nbsp;km in Central Serbia.\nPersecutions of the Muslims by the Serbs resulted in their massive emigration to Turkey soon after the foundation of Kingdom of Serbs, Croats and Slovenes in 1918, where Serbia was the leading and privileged nation. The same happened to several hundred thousand Muslims soon after the Second World War.\nOn November 28, 1920 elections to the Constitutional Assembly were held. The Assembly was to be charged with adopting a constitution for the Kingdom of Serbs, Croats and Slovenes. The Croatian People's Peasant Party emerged as the largest Croatian party in the assembly, with 50 seats. The party subsequently held a congress in Zagreb on December 8 where it was renamed to the Croatian Republican Peasant Party, and a republican platform for the new constitution was adopted. In response to this, King Peter removed Matko Laginja from the position of ban on December 11. In turn, the Croatian Republican Peasant Party boycotted the assembly.\nThe concept of \"Greater Serbia\" in Yugoslavia was put in practice during the early 1920s, under the Yugoslav premiership of Nikola Pašić. Using tactics of police intimidation and vote rigging, he diminished the role of the oppositions (mainly those loyal to his Croatian rival, Stjepan Radić) to his government in parliament, creating an environment to centralization of power in the hands of the Serbs in general and Serbian politicians in particular.\nStjepan Radić was one of the most significant personalities in the Croatian political history, who strived to renew the Croatian sovereignty and the economic and cultural emancipation of Croatia. He wanted the state of the Southern Slavs to be reorganized on confederative basis, without Serbian hegemony.\nIn 1928, Radić was assassinated in the Yugoslav parliament in Belgrade on 20 June 1928 together with his colleagues.\nKingdom of Yugoslavia (1929–1941)\nThe assassination of Stjepan Radić caused a major political crisis and the latter half of 1928 was marked with demonstrations and recriminations, with the Croats and prečani Serbs united in demands for federalization.\nNevertheless, the January 6 Dictatorship, the personal dictatorship of King Aleksandar emerged in 1929, and the King banned national political parties – a regime met by opposition from Croatia.\nThe culmination of the Serbian police terror took place during this period. One of the historical documents from that period, showing \"methods\" of the Serbian police and administration, is a bill on 13 dinars and 15 paras charged to a Croatian family in 1934 for five bullets fired at the father, who was sentenced to death. The families were persuaded even to pay the \"expenses\" of the execution within eight days, under the threat of confiscation of their property. Croatian archbishop Alojzije Stepinac reported about this event to the French diplomat Ernest Pezet in 1935.\nBelgrade also made use of the world economic crises in 1929 to destroy the Croatian banking system, which had been the strongest in Yugoslavia.\nIn 1931, Milan Šufflay, Croatian historian of international reputation known esp. for his contributions in the field of albanology, was assassinated in Zagreb. Because of this, Albert Einstein and Heinrich Mann sent an appeal to the International League of Human Rights in Paris to \"protect Croats from the terror and persecutions of the Serbian police\". The appeal was also published in the New York Times on 6 May 1931, saying that the newspapers in Zagreb were not allowed to report about Sufflay's activity; it was not allowed to attach a half-mast flag on the main building of the University of Zagreb in his honour; the time of the funeral could not be announced publicly, and even condolence messages were not allowed to be telegraphed. In their letter Einstein and Mann held the Yugoslav king Aleksandar explicitly responsible for the state terror over the Croats.\nThe king himself was assassinated by Vlado Chernozemski in Marseille in 1934, in a collaboration of the Internal Macedonian Revolutionary Organization (IMRO) with the Ustasha organization.\nAn extremely valuable account on the terrorist methods of the Pan-Serbs in Yugoslavia between the two World Wars has been written by Henri Pozzi, a French diplomat and a close witness, in his book Black Hand over Europe, London, 1935, referring in the title to the \"Black Hand\", the Pan-Serbian secret terrorist organization, very close to the Royal court in Belgrade.\nThe tendency of administrative parcellization of Croatia that started in 1922 was revised by the establishment of the autonomous Croatia - Banovina of Croatia - in 1939. It also included Dalmatia and parts of Bosnia and Herzegovina.\nAftermath\nThese aspects partly contributed to the rise of the Croatian nationalist movement called Ustasha, which gathered around Ante Pavelić (1889–1959). After the invasion and dismemberment of Yugoslavia in World War 2 due to Nazi Germany and Fascist Italy, Croatia would go on to become a puppet state of the Axis powers, known as the Independent State of Croatia (NDH, Nezavisna država Hrvatska, 1941–1945).\nThe actions of King Alexander Karadjordjevic and the state terror in the First Yugoslavia has also contributed to the Ustasa's method of revenge of genocide against the Serbs in World War Two-era puppet state of the Independent State of Croatia.\nSee also\n* Bans of Croatia\n* Zagreb Points\n* Croatian Bloc (coalition)\n* Croatian National Representation\n* Land reform in interwar Yugoslavia#Croatia-Slavonia\nReferences\nSources\n*\nExternal links\n* [http://www.hic.hr/books/blackhand/problem.htm Black Hand Over Europe - The Croat Problem], by Henri Pozzi, 1935\n* [http://www.hr/darko/etf/et112.html#jugo The period of Croatia within ex-Yugoslavia]\n* [https://web.archive.org/web/20060207134449/http://mirror.veus.hr/myth/firstyugo.html Croatia: Myth and Reality], by C. Michael McAdams"
    }
  ]
}