{
  "content": [
    {
      "type": "text",
      "text": "# Croatian Republican Peasant Party (1945)\n\n| name = Croatian Republican Peasant Party\n| native_name = Hrvatska republikanska seljačka stranka\n| logo =\n| logo_size = 115px\n| abbreviation = HRSS\n| president = Franjo Gaži\n| founder =\n| foundation = 1941\n| split = Croatian Peasant Party\n| headquarters = Zagreb\n| newspaper = Slobodni dom\n| position =\n| national = People's Front of Yugoslavia\n| colours =\n| anthem =\n| country = FPR Yugoslavia\n| footnotes = The HRSS resulted from the 1941 split of the Croatian Peasant Party; like the other factions, it claimed continuity from the original party founded by Stjepan Radić in 1904.\n| slogan = Faith in God and Peasant Unity\n| flag =\n}}\nThe Croatian Republican Peasant Party (Hrvatska republikanska seljačka stranka, HRSS) was a political party formed from a faction split from the Croatian Peasant Party (Hrvatska seljačka stranka, HSS) in 1941. The HSS was once the most popular political party among the Croats in the Kingdom of Yugoslavia, but after the Axis invasion of Yugoslavia, the HSS splintered in several groups including the faction that would become the HRSS. It joined the Yugoslav resistance led and dominated by the Communist Party of Yugoslavia (KPJ) and by its branch in Croatia – the Communist Party of Croatia (KPH). The prewar leader of the HSS Vladko Maček opted to wait for the war to end, while another faction joined the Ustaše movement that ruled the Axis puppet Independent State of Croatia (NDH).\nThe HSS faction aligned with the communist-led Yugoslav Partisans organised itself as the HSS executive committee, initially led by Božidar Magovac. The KPH welcomed HSS executive committee participation in the resistance as a way to increase Croatian support for the Partisans. Magovac and KPH leader Andrija Hebrang soon came into conflict. Magovac advocated cooperation of the KPH and the HSS faction led by the executive committee as equals and tried to preserve the HSS executive committee's political independence until after the war. In contrast, Hebrang attempted to entrench the dominance of the KPH in Croatia and to publicly establish and widen as much as possible a split between the Magovac-led faction and the pre-war HSS leadership by pressuring Magovac to denounce Maček as a collaborator. The conflict resulted in political domination of the KPH over the HSS executive committee and replacement of Magovac with Franjo Gaži.\nAfter the war, the HSS executive committee was formally renamed the HRSS and joined the People's Front of Yugoslavia—a KPJ-dominated coalition established ahead of the 1945 Yugoslavian parliamentary election. In that election and the 1946 Croatian Sabor election, the HRSS performed poorly and the KPH decided to wind down the HRSS' operations.\nBackground\nCroatian Peasant Party\nThe Croatian Peasant Party (Hrvatska seljačka stranka, HSS) was established by the brothers Stjepan Radić and Antun Radić in 1904. Prior to the end of the World War I, it played a minor role in the national politics but developed an extensive grassroots network, advocating Croatian national unity and agrarianism. After the death of Antun Radić in 1919, and establishment of the Kingdom of Serbs, Croats and Slovenes (later renamed Yugoslavia), the party opposed the Yugoslav monarchy and further unification of the new state. Advocating national self-determination, it demanded a Croat peasant republic be formed. By 1928, when Radić was assassinated, the HSS was the only major political party among Croats. Vladko Maček, elected to replace Radić as the party leader, negotiated the Cvetković–Maček Agreement on 26 August 1939, establishing an autonomous Banovina of Croatia. Maček became the Deputy Prime Minister of Yugoslavia and several members of the HSS joined the cabinet. The agreement angered Italian-backed Croatian nationalist group Ustaše, who launched a propaganda campaign against Maček and the HSS as traitors of Croatian interests simultaneously strengthening their ties to the Italian Fascist regime.\nAxis invasion of Yugoslavia\nand partitioned by the Axis powers in April 1941.]]\nSeeking retribution for their withdrawal from the Tripartite Pact following the March 1941 Yugoslav coup d'état, Adolf Hitler sought to partition the Kingdom of Yugoslavia through annexation of Yugoslav territory to Nazi Germany and its allies. The move was supported by Italian leader Benito Mussolini, who believed that such fragmentation would make it easier for Fascist Italy to expand their territory by absorbing former Yugoslav territories. The German plans for the breakup of Yugoslavia also envisaged some form of autonomy for Croats to exploit Croatian dissatisfaction with the Yugoslav regime. Hitler offered Hungary the opportunity to absorb Croatia on 27 March 1941, apparently referring to the territories largely corresponding with the former Kingdom of Croatia-Slavonia, but Regent Miklós Horthy declined the offer. Days later, Germany decided to establish a Croatian puppet state.\nAs the HSS was the most popular Croatian political party at the time, Germany offered Maček the opportunity to govern the new state, but Maček declined. In response, the position was reluctantly offered to the Italian-based Ustaše and their leader Ante Pavelić, Mussolini, meanwhile, sought to capitalise on the promises made in a 1927 memorandum submitted by Pavelić and Ivo Frank, promising territorial concessions to Italy. The Independent State of Croatia (NDH) was declared on 10 April, as the Wehrmacht was approaching Zagreb. The declaration was made by Slavko Kvaternik on the urging of, and with support from, SS colonel Edmund Veesenmayer, attached to the Dienststelle Ribbentrop. Pavelić and the Italian-based Ustaše were only permitted to leave Italy and Italian-occupied territory in Yugoslavia after Mussolini extracted a written confirmation of the 1927 pledge, allowing him to reach Zagreb in the early morning of 15 April with 195 supporters. Yugoslavia surrendered shortly thereafter, on 17 April 1941. King Peter II of Yugoslavia and the government fled the country. The decision to abandon organised armed resistance put the Yugoslav government-in-exile in a difficult position, further weakened by quarreling ministers who appeared united only in their opposition to Communism.\nArmed resistance\nWith the Yugoslav defeat imminent, the Communist Party of Yugoslavia (KPJ) instructed its 8,000&nbsp;members to stockpile weapons in anticipation of armed resistance, which would spread by the end of the year to all areas of the country except Macedonia. Building on its experience in clandestine operations, the KPJ created the Yugoslav Partisans, as resistance fighters led by Josip Broz Tito.The KPJ assessed that the German invasion of the Soviet Union had created favourable conditions for an uprising and its politburo founded the Supreme Headquarters of the National Liberation Army of Yugoslavia with Tito as commander in chief on 27&nbsp;June 1941. In the territory largely corresponding with the present-day Croatia, the Communist Party of Croatia (KPH) operated as a nominally independent branch of the KPJ. At the beginning of the war, the KPH had 4000 members.\nExecutive committee\nFracturing of the HSS\nwas the president of the HSS during World War II.]]\nThe HSS fell apart in 1941. Its leadership split into different factions over how to respond to the occupation of Yugoslavia, and the HSS's internal structure consisting of about 7,000 organisational units before the war was disbanded after the NDH banned the party in June 1941. Maček led the most influential faction of the party—adopting the policy of passively waiting the Western Allies to liberate Croatia. Another group, led by former Ban of Croatia Ivan Šubašić and HSS general secretary Juraj Krnjević (appointed by Maček to represent him abroad), fled the country to join the royalist government-in-exile. The third group joined the Ustaše. The fourth group joined or cooperated with the Communist-dominated Yugoslav resistance. This group was initially centered around Maček's close associate Božidar Magovac, who was highly regarded in the HSS.\nDisappointed by the absence of any resistance, even nonviolent resistance, to the NDH in light of violence perpetrated by the NDH in 1941 and by the HSS faction supporting the NDH, Magovac raised the issue of starting a HSS resistance or organising an uprising with several HSS leaders from Maček's faction, but received no support. Magovac contacted the KPH organisations in the Podravina region, where he moved after the outbreak of the war, seeking to arrange the establishment of separate Partisan units for HSS members. After the request was declined, he called upon HSS members to join the Partisan movement in as great numbers as possible to \"deprive it of the communist tone\". Magovac moved to the Partisan-held territory at the end of May 1943.\nThe principal difference between Magovac and the KPH was Magovac's desire to establish HSS-specific basic party organisations right away and the KPH's wish to postpone this until after the war. Magovac saw the cooperation of (his faction of) the HSS and the KPH as a coalition of equals. Soon after his arrival to the Partisan-controlled territory in the aftermath of the first session of the ZAVNOH, Magovac proposed to establish a HSS executive committee and launch a HSS newspaper Slobodni dom. Even though the newspaper was launched and the HSS executive committee was established, the KPH sought to curb further consolidation of the HSS and supported Magovac's opponents within the HSS executive committee.\nWork in the ZAVNOH\nThe State Anti-fascist Council for the National Liberation of Croatia (ZAVNOH) was convened as the supreme political representative body in Partisan-controlled territory of Croatia in June 1943 and expanded for its second session on 12 October with the addition of 66 new members, largely drawn from the HSS. The KPH wanted to use resistance supporters within the HSS to increase support for the Partisan resistance among the Croats. At the session, the ZAVNOH proclaimed its determination to pursue the establishment of a free Croatia in a Yugoslav community of equals and to support the equality of nations, a multi-party system and religious tolerance.\nWhile some Partisan fighters resented the acceptance of HSS members into their ranks viewing them as late arrivals joining the struggle only when Partisan victory became more likely, the official position of the KPH leadership headed by party secretary Andrija Hebrang was that the newcomers were welcome and free to keep their political views. Hebrang believed that greater involvement of the HSS members would lead to increased participation of Croats in the Partisan struggle.\nHis belief turned out to be correct, although the level of recruitment of HSS members varied by region. The best results were achieved in Dalmatia, the Croatian Littoral, Lika and Slavonia, and the poorest in the area north of Zagreb. Besides the HSS members, the ZAVNOH included a group of Independent Democratic Party members, representatives of peasant organisations and trade unions. Participation of such organisations depended on their acceptance of the KPH's lead. In mid-August 1943, Tito and KPJ politburo member Edvard Kardelj discussed Magovac's request to establish the HSS executive committee, concluding that this would help extend Communist control over Magovac's faction. The HSS members cooperating with the ZAVNOH elected the HSS executive committee among themselves in Plaški on 12 October 1943—the first day of the second session of the ZAVNOH. Magovac was elected the first chairman of the body, which came under his sole control.\nTwelve out of 30 members of the 1944 ZAVNOH presidency were HSS members. Franjo Gaži was one of its vice-presidents, and Stjepan Prvčić was one of the body's deputy secretaries. Nikola Brozina, Tomo Čiković, Frane Frol, Aleksandar Koharević, Ivan Kuzmić, Filip Lakuš, and Magovac were among the members. Several HSS members were appointed by the ZAVNOH as a part of the Croatian delegation to the Anti-Fascist Council for the National Liberation of Yugoslavia (AVNOJ)—the supreme Yugoslav representative and legislative body established by the Partisans—including Lakuš, who was a member of the AVNOJ presidency. Magovac was appointed the vice-president of the National Committee for the Liberation of Yugoslavia (NKOJ), established as a provisional government of Yugoslavia by the AVNOJ. Frol was appointed as the NKOJ commissioner for the judiciary.\nHebrang–Magovac conflict\nThe KPH insisted that HSS supporting the Partisans explicitly denounce Maček for treason. Magovac avoided the issue, hoping to entice the HSS leadership to openly support him. Until the autumn of 1943, the KPH leadership, especially Hebrang, condemned on several occasions as \"leftist sectarianism\" KPH members who openly criticised Magovac for his reluctance to denounce Maček as a traitor and for intimidating potential Partisan recruits with Communist slogans. Hebrang wanted to broaden the appeal of the Partisan struggle in Croatia among those who sympathised the HSS.\nHebrang and Magovac clashed at the second session of the ZAVNOH, on 12–14 October, when Hebrang read the declaration of the HSS executive committee (likely drawn up by Magovac alone). Hebrang deemed the positions held in the declaration unacceptable because it aimed to preserve the prewar HSS until the end of the war in ZAVNOH, transformed into a KPH–HSS coalition. Hebrang and others spent much of 13 October pressuring Magovac to change his mind. Magovac conceded, but claimed that no significant changes were made. Nonetheless, the declaration avoided any mention of Maček and stated that the executive committee is now representing the HSS, now tied to the national liberation struggle. On the other hand, ZAVNOH confirmed the leading role of the Communist Party. The conflict intensified after the second session of the AVNOJ, during which Magovac and Tito talked alone and Magovac became confident of Tito's support to his views. Magovac wrote several texts for Slobodni dom that were censored by Hebrang, further fueling the conflict. In mid-December, Hebrang issued a directive prohibiting HSS meetings unless supervised by the KPH.\nOn 2 February 1944, a part of the HSS executive committee met in Čazma, where they adopted a resolution denouncing Maček as an Ustaše, Chetnik and Royal government-in-exile collaborator. The group was led by Gaži, once Magovac's ally, who was since then deemed by Magovac to have caved in to the KPH's pressure. The same month, HSS executive committee members from Koprivnica area wrote to Magovac demanding that he denounce Maček. Magovac acquiesced on 8 March, when all 38 members of the executive committee signed a declaration condemning Maček for collaboration with the Ustaše. Upon Tito's instructions, Hebrang ordered the distribution of 45,000 copies of the declaration. Slobodni dom resumed publication that day, printing its first issue since 25 December 1943, since Hebrang deemed the newspaper a useful tool against Maček loyalists.\nIsolation and removal of Magovac\nWhile Maček's deputy August Košutić tried to negotiate with the KPH on behalf of Maček's faction in late 1943 and early 1944 for the participation of the HSS in the Partisan resistance, Košutić asked Hebrang to allow him to contact Magovac and others in the HSS executive committee, but the request was denied. Gaži denounced Košutić as an enemy and cautioned against cooperation with Maček's faction. The negotiations were only continued due to the insistence of British Prime Minister Winston Churchill and Foreign Secretary Anthony Eden in February and April 1944, and due to the deteriorating position of the HSS and Košutić following failure of the Lorković–Vokić plot. Hebrang saw the negotiations as a nuisance, but Tito and Kardelj insisted on a more tactical approach which would not jeopardise the unity of Croatia as leverage in KPJ's struggle to control Yugoslavia.\nThe HSS executive committee elected Gaži as president on 29 April 1944, supported by a pro-KPH faction within the HSS executive committee, while Magovac became one of its four vice-presidents. Afterwards Magovac was gradually pushed out from his other official positions. Finding himself isolated, Magovac resigned as editor of Slobodni dom on 4 May, and from the vice-presidency of the HSS executive committee a month later. On 22 August, the day when he was removed from the HSS executive committee, Magovac resigned from the NKOJ and his position was filled by Gaži. Three days later he was interned on the Vis Island. Until the end of the war, the KPH worked to gradually increase its control over the HSS executive committee. Under influence of the KPH, the executive committee held that the HSS does not need to establish any further formal structure before the war is over. In early 1945, the HSS executive committee worked to prevent the restoration of HSS as a party under the leadership of Maček's faction.\nParticipation in the People's Front\n1945 Yugoslavian parliamentary election\nThe HSS executive committee held its third plenary session in Zagreb on 29–30 June 1945, deciding to emphasise the party's commitment to the establishment of a republic by adopting the old HSS name—the Croatian Republican Peasant Party (Hrvatska republikanska seljačka stranka, HRSS). The name change was also intended to appeal to those who still held Radić in great esteem. Furthermore, the HRSS issued a statement that the outcome of the national liberation struggle meant achieving of Radić's programme. The People's Front of Yugoslavia (NFJ)—nominally a coalition of nearly all political parties in Yugoslavia, including the HRSS—was established in preparation for the 1945 Yugoslavian parliamentary election. While non-Communist parties in the NFJ hoped for equality, Tito saw the NFJ as a tool to neutralize the political opposition by allying them with the KPJ. Due to the weakness of the non-Communist parties in the NFJ, the KPJ dominated the group. The KPJ also hoped that HRSS participation in the NFJ could offer peasants who did not support the KPJ an acceptable alternative.\nAfter signing the Vis Agreement and establishing of the NFJ, Šubašić, the Prime Minister of the royal government-in-exile, asked the KPJ to allow him to re-establish the pre-war organisation of the HSS. The KPJ told Šubašić to talk to Frol about it and instructed the HRSS to invite Šubašić to a meeting held on 25 August, during which Šubašić and the HRSS could not come to an agreement. The HRSS declined to admit Šubašić to the party, while Šubašić said that two Croatian Peasant Parties should not be allowed to operate. The HRSS allowed its members to simultaneously be members of the KPH, but it is unclear who belonged to both parties as the KPJ (including the KPH) kept its membership secret until 1948. In July 1945, the central committee of the KPH stated that cooperation with the HRSS would be facilitated through talks with KPH members inside the HRSS's executive committee.\nOn 16 September 1945, the HRSS held its general assembly at the Concordia Stadium in Zagreb. The KPJ and the KPH supported the event, helping bring in attendees from all over Croatia and providing coverage in the KPH newspapers, but required a predetermined agenda, speakers, and decisions. No votes were held and the decisions, which were approved by cheering or applauding. There was no mention of reestablishment of party basic organisations. Slobodni dom reported an attendance of 100,000, but British diplomats estimated the crowd at 25–30,000 and stated that about 10,000 left while Gaži was speaking. KPH secretary Vladimir Bakarić thought that the assembly revealed that the HRSS was powerless without KPH's help. The elections took place on 11 November, but the NFJ ran uncontested since the opposition boycotted these (and subsequent) elections. The HRSS won 26 seats in the Federal Assembly (the lower chamber of the Yugoslav Parliament) out of 86 assigned to Croatia, and 6 seats in the Assembly of Peoples (the upper chamber) out of Croatia's 25.\nIn late 1945, the KPH decided to intensify its cooperation with the HRSS and increase KPH's control over the HRSS in preparation for the 1946 Sabor election. Bakarić believed that this would ensure a wider popular appeal while leaving the KPH effectively uncontested. The HRSS was viewed by the KPH as a peasant movement which ought to include communists. Establishment of district committees of the HRSS began, with interference from local KPH officials in some areas and with their help in other places. In some cases, KPH district committee members also served as presidents of HRSS district committees. The KPH-backed drive to popularise the HRSS slowed down in 1946, and only picked up just before the Sabor elections. The HRSS received at least 39 seats in the Sabor, although party affiliation was not published, and six out of 26 seats in the Presidium of the Sabor.\nFinal years\nIn the aftermath of the 1946 elections, the KPH determined that the HRSS had not become a revolutionary peasant organisation led by the KPH, due to the inactivity of the HRSS in the villages and failure of the Communists to turn the HRSS in a peasant branch of the KPH. The KPH concluded that most HRSS committees were established and maintained by Communists while Maček loyalists were present in other committees, pursuing an agenda hostile to the KPH. It was decided that no further HRSS organisations would be set up, and that the existing ones would become less active. The executive committee did not meet between June 1945 and July 1947. By 1947, the KPJ declared that its programme was the NFJ's programme and that the KPJ is in the forefront of the NFJ. Tito linked the collapse of the pre-war Yugoslavia with the multi-party system of government to justify the suppression of political opposition parties. He called the multi-party system incompatible with the socialist order and unnecessary. Virtually all activities of the HRSS ceased shortly afterward. The Slobodni dom continued to be published, but the party slogan—Faith in God and Peasant Unity (Vjera u boga i seljačka sloga)—was dropped from its cover on 1 January 1948. In the wake of the Tito–Stalin split, the KPH attempted to reactivate the HRSS in 1950. From 1950 to 1953 mandate, the Presidium of the Sabor included six seats assigned to the HRSS, out of 27. British Ambassador Charles Peake considered these HRSS politicians to be ageing second-rate politicians and distrusted opportunists.\nFootnotes\nReferences\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n|oclc= 439981094\n}}\n*\n*\n*"
    }
  ]
}