{
  "content": [
    {
      "type": "text",
      "text": "# Cross-Strait Economic, Trade and Culture Forum\n\nCross-Strait Economic, Trade and Culture Forum, commonly known as the Kuomintang–Chinese Communist Party Forum, was originally proposed by the Kuomintang and the Chinese Communist Party, jointly organized in order to promote cross-strait economic, trade, cultural exchanges dialogue and integration.\nBackground\nThe increased contacts culminated in the 2005 Pan-Blue visits to mainland China, including a meeting between CCP General Secretary Hu Jintao and KMT Chairman Lien Chan in April 2005. They were hailed as the highest level of exchange between the Chinese Communist Party and the Kuomintang since Chiang Kai-shek and Mao Zedong met in Chongqing on 28 August 1945.\nBoth Kuomintang-Chinese Communist Party hold on the premise of acknowledging the 1992 Consensus, encourage the reopening of talks across the strait. Encourage cooperation in economic exchange and crime fighting, push for two-way direct flights across the strait, Three Links, and agricultural exchange.\nHistory\n{|class=wikitable\n|-\n!Sequence!!Date!!Venue City!!Venue Province!!Theme/Remark\n|-\n! 1st\n| 14–15 April 2006\n| Beijing\n|\n| The mainland announced new incentives to promote cross-strait trade. Participants also passed joint proposals for closer economic ties.\n|-\n! 2nd\n| 16–18 October 2006\n| Bo'ao\n| Hainan\n| Boost agricultural cooperation and promote peace and development across the Taiwan Strait.\n|-\n! 3rd\n| 28–29 April 2007\n| Beijing\n|\n| Encouraged to expand cooperation with mainland counterpart.\n|-\n! 4th\n| 20–21 December 2008\n| Shanghai\n|\n| Expanding cross-Straits cooperation in the finance and service sectors, encouraging two-way investment and regularizing economic exchanges, which cover the key points of deepening cross-strait economic exchange and cooperation.\n|-\n! 5th\n| 11–12 July 2009\n| Changsha\n| Hunan\n| Promote cultural exchanges and educational cooperation across the Taiwan Strait.\n|-\n! 6th\n| 8–11 July 2010\n| Guangzhou\n| Guangdong\n| Strengthening cooperation in emerging industries and boosting the competitiveness of both sides.\n|-\n! 7th\n| 6–8 May 2011\n| Chengdu\n| Sichuan\n|\n|-\n! 8th\n| 28–29 July 2012\n| Harbin\n| Heilongjiang\n|\n|-\n! 9th\n| 26–27 October 2013\n| Nanning\n| Guangxi\n| Promote Exchange and Cooperation, Revitalize the Chinese nation.\n|-\n! 10th\n| 3 May 2015\n| Shanghai\n|\n|\n|-\n! 11th\n| 2–3 November 2016\n| Beijing\n|\n| Held as Cross-Strait Peaceful Development Forum.\n|}\nSee also\n* Relations between the Kuomintang and the Chinese Communist Party\n* Cross-Strait relations\n* Cross-Strait Peace Forum\n* Three Links\n* Political status of Taiwan\n* One Country on Each Side\n* Pan-Blue Coalition\n* First United Front\n* Second United Front\n* History of Cross-Strait Relations\nReferences"
    }
  ]
}