{
  "content": [
    {
      "type": "text",
      "text": "# Crowley Vale, Queensland\n\n| pop                 = 106\n| pop_year            =\n| pop_footnotes       =\n| established         =\n| postcode            = 4342\n| area                = 8.0\n| timezone            = AEST\n| utc                 = +10:00\n| dist1               = 11.7\n| dir1                = E\n| location1           = Gatton\n| dist2               = 44.7\n| dir2                = WNW\n| location2           = Ipswich\n| dist3               = 46.5\n| dir3                = E\n| location3           = Toowoomba\n| dist4               = 81.9\n| dir4                = WSW\n| location4           = Brisbane\n| lga                 = Lockyer Valley Region\n| stategov            = Lockyer\n| fedgov              = Wright\n| near-n              = Glenore Grove\n| near-ne             = Glenore Grove\n| near-e              = Glenore Grove\n| near-se             = Forest Hill\n| near-s              = Forest Hill\n| near-sw             = College View\n| near-w              = College View\n| near-nw             = Lake Clarendon\n}}\nCrowley Vale is a rural locality in the Lockyer Valley Region, Queensland, Australia. In the , Crowley Vale had a population of 106 people.\nHistory\nIn March 1915, the Queensland Government decided to establish a new open-air school at Verdant Vale. Verdant Vale State School opened in 1916. In 1918,  it was renamed Crowley Vale State School. In 1923, the school had 40 children enrolled and parents requested a new school building. The school closed circa 1941. It was at 42 Crowley Vale Road (corner of Warrego Highway, ). In 1951, tenders were called to re-erect the school building at the Gatton Agricultural College as a lunch room for farmhands. In 1996, it was relocated to the western side of Services Road with the college grounds. In 1995, it was re-located to its present position west of Services Road.\nDemographics\nIn the , Crowley Vale had a population of 96 people.\nIn the , Crowley Vale had a population of 106 people.\nEducation\nThere are no schools in Crowley Vale. The nearest government primary schools are Lake Claredon State School in neighbouring Lake Claredon to the north and Glenore Grove State School in neighbouring Glenore Grove to the east. The nearest government secondary school is Lockyer District State High School in Gatton to the south-west.\nReferences"
    }
  ]
}