{
  "content": [
    {
      "type": "text",
      "text": "# Cruise of the Kings\n\nThe Cruise of the Kings () was a royal cruise around the Mediterranean Sea in the summer of 1954, organised by Queen Frederica and King Paul of Greece.\nThe cruise aimed to promote tourism in Greece and was drafted by Queen Frederica. It took place from 23 August to 3 September 1954 on the royal yacht Agamemnon. Royals from over 25 reigning and formerly reigning royal families were in attendance. A second cruise was scheduled for August 1956, but the nationalisation of the Suez Canal and its closure by the British government, as well as growing violence in the Levant, prevented the cruise from progressing smoothly; it became a shorter stay in Mon Repos, Corfu.\nConception\nThe cruise was drafted by Queen Frederica of Hanover, the queen consort of Greece as the wife of King Paul of Greece, to promote and \"open the doors\" to tourism in Greece, specifically in the Greek islands. The growth of tourism was hoped for as it would assist in economic recovery following World War II and the Greek Civil War. Another aim of the cruise was to rebuild ties between European royal families following World War I and World War II.\nAccording to Frederica's memoir, she was approached in 1954 by Eugenios Eugenidis, a Greek shipowner, who asked her to visit one of his transatlantic liners and give it her name. When this is done, the shipowner typically gives a brooch. However, Frederica requested that Eugenidis instead assist her in organising a cruise for the royal families in Europe.\nThe Greek Consul in Naples of the time, Tylpados, also revealed to the French news outlet Combat that \"several engagements\" were hoped to be announced by the end of the cruise. Prince Michael of Greece and Denmark claimed in 2003 that \"some marriages or engagements\" amongst royals was one of the aims the cruise. The only marriage that was arranged during the cruise was that of Prince Alexander of Yugoslavia and Princess Maria Pia of Bourbon-Parma. However, King Paul's oldest daughter Princess Sophia and Prince Juan Carlos of Spain first met on the cruise and they would marry eight years later.\nEvents of the cruise\n1954 edition\nEugenidis' Agamemnon first departed on 23 August 1954 from the French port of Marseille, where Charlotte, Grand Duchess of Luxembourg and her family boarded the yacht as the first royals to participate. At around 11:00&nbsp;a.m., the Agamemnon stopped in Naples, where the majority of royal guests, including Paul, Frederica, and the Greek royal family, were picked up. The Greek royals had arrived in Naples at around 8:20&nbsp;am that same day, having taken the yacht Navarino from Greece. It took almost three hours for all the guests to board the ship in Naples. At around 1:45&nbsp;pm, the Agamemnon departed Naples with its guests and sailed towards the Ionian islands.\nOn board the yacht and at any locations where it stopped, it was agreed that royal protocol be abolished, which freed guests from any royal order of precedence, allowing them to \"mingle more\" in a less formal environment, according to historian Julián Cortes Cavanillas. More informal standards, Frederica hoped, would help rebuild familial ties between the guests.\nThe cruise's first stop was Corfu, where the final guests, former King Umberto II of Italy and his family, were picked up. The Italian royal family was banned from staying in Italy due to the 1946 Italian institutional referendum and the proclamation of the Italian Republic, so they were unable to be picked up from Naples. After they had boarded, the Agamemnon made numerous stops, including in Olympia, Heraklion, Rhodes, Santorini, Mykonos, Skiathos, Sounion and then Athens, via the port of Faliro. On 31 August, the cruise's royal guests toured Epidaurus and viewed a performance of Euripides' Hippolytus.\nThe following day, the Greek royal family departed the Agamemnon and returned to Tatoi Palace. Over the next two days, the yacht first stopped in Corfu, where the Italian royals departed, and then in Naples, where the rest of the guests left to return to their home countries. Prince Michael of Greece and Denmark described the cruise as \"great fun\" and a \"beautiful event\". The cruise was seen as successful and attracted a lot of media attention. Many shipping companies soon organised cruises that followed the same route as the Agamemnon. In her memoirs, Frederica noted that the growth in cruises around Greece led to \"hotels and other land-based services and facilities\" growing in revenue and generating more tourist money for the country. On the other hand, domestically the cruise was received with mixed feelings: many Greek people resented what they perceived as the lavish bride-show out on for the Queen's royal relatives, which cost the cash-strapped Greek state 140,000 US dollars in addition to the funds provided by Eugenidis. Frederica's popularity took a hit and began to decline from that point on.\nPrince Francis of Bavaria, a participant, reports in his memoirs the anecdote that the queens of Greece, the Netherlands, Italy and Romania went ashore in a harbor in the middle of a crowd of nephews and nieces, and a waiting journalist called out to them: \"What is the purpose of this trip?\", whereupon the Dutch Queen Juliana replied with a friendly smile: \"Oh, you know, this is our union’s company outing.\"\n1956 edition\nFollowing the first edition of the cruise in 1954, which Queen Frederica described as \"a great success\", she wished to reboot the event two years later. There were plans for the cruise to be on the yacht Achilles. However, a few days before the cruise was scheduled to begin, the Suez Crisis became apparent as the President of Egypt, Gamal Abdel Nasser, attempted to nationalise the canal, resulting in its closure by the British government. In addition, there was growing violence in the Eastern Mediterranean and the Levant. As a result, Queen Frederica and King Paul decided to alter the event from a cruise to a stay in Mon Repos, the royal residence in Corfu. The guest list thus had to be shortened significantly.\nDignitaries\nIn the 1954 cruise, 110 royal dignitaries of twenty nationalities were in attendance. Additionally, over fifteen different languages were spoken. Frederica recorded that despite language barriers, there \"was not the slightest difficulty during the ten days that the cruise lasted\".\nGreece\n*  The King and Queen of the Hellenes\n**  Princess Sophia of Greece and Denmark\n**  The Crown Prince of Greece\n**  Princess Irene of Greece and Denmark\n*  Prince and Princess George of Greece and Denmark\n*  Prince Michael of Greece and Denmark\nForeign\nAustria\n* Archduchess Marie-Ileana of Austria\nBulgaria\n* Tsar Simeon II of Bulgaria\n* Princess Marie Louise of Bulgaria\nDenmark\n*  Prince Axel of Denmark\n**  Count and Countess Flemming of Rosenborg\n*  Prince and Princess Viggo, Countess of Rosenborg\nFrance\n* The Count and Countess of Paris\n** Princess Isabelle of Orléans\n** The Count of Clermont\n** Prince François of Orléans\n** Princess Anne of Orléans\n** Princess Diane of Orléans\nGermany\nBaden\n* Princess Margarita of Baden\n* Prince Ludwig of Baden\nBavaria\n* The Hereditary Prince of Bavaria\n** Princess Marie Gabrielle of Bavaria\n** Prince Franz of Bavaria\nHanover\n* The Prince and Princess of Hanover\n* Prince and Princess George William of Hanover\n* Prince Christian Oscar of Hanover\n* Prince Welf Henry of Hanover\nHesse\n* The Hereditary Prince of Hesse\n* Prince Heinrich of Hesse\n* Prince Otto of Hesse\n* Princess Dorothea of Hesse\n* Prince Rainer of Hesse\nHohenlohe\n* The Prince and Princess of Hohenlohe-Langenburg\n** The Hereditary Prince of Hohenlohe-Langenburg\n** Princess Beatrix of Hohenlohe-Langenburg\n** Prince George Andreas of Hohenlohe-Langenburg\nMecklenburg\n* Duke Christian Louis of Mecklenburg-Schwerin\n* Duchess Thyra of Mecklenburg-Schwerin\nSchaumburg-Lippe\n* Prince and Princess Christian of Schaumburg-Lippe\nSchleswig-Holstein\n* The Duke and Duchess of Schleswig-Holstein\n* Prince Frederick Ferdinand of Schleswig-Holstein\nThurn und Taxis and Radziwiłł families\n* The Duke and Duchess of Castel Duino\n** Princess Tatiana Radziwiłł\nTörring-Jettenbach\n* The Count and Countess of Törring-Jettenbach\n** The Hereditary Count of Törring-Jettenbach\n** Countess Helene of Törring-Jettenbach\nWürttemberg\n* The Duke and Duchess of Württemberg\n** Duke Ludwig of Württemberg\n** Duchess Elisabeth of Württemberg\nItaly\nBourbon-Parma\n* Prince and Princess René of Bourbon-Parma\n** Prince Jacques of Bourbon-Parma\n** Prince André of Bourbon-Parma\nBourbon-Two Sicilies\n* Prince Antoine of Bourbon-Two Sicilies\nSavoy\n* King Umberto II and Queen Marie-José of Italy\n** Princess Maria Pia of Savoy\n** The Prince of Naples\n** Princess Maria Gabriella of Savoy\n** Princess Maria Beatrice of Savoy\n* Princess Maria Cristina of Savoy-Aosta\nLuxembourg\n*  The Grand Duchess and Prince Consort of Luxembourg\n**  The Hereditary Grand Duke and Hereditary Grand Duchess of Luxembourg\n**  Princess Elisabeth of Luxembourg\nNetherlands\n*  The Queen and Prince Consort of the Netherlands\n**  Princess Beatrix of the Netherlands\n**  Princess Irene of the Netherlands\nNorway\n*  Princess Astrid of Norway\nRomania\n* King Michael I and Queen Anne of Romania\nRussia\n* Prince Dimitri Romanovich Romanov\nSpain\n* The Count and Countess of Barcelona\n** Infanta Pilar of Spain\n** Infante Juan Carlos of Spain\nSweden\n*  Princess Margaretha of Sweden\nYugoslavia\n* Prince Alexander of Yugoslavia\n* Princess Elizabeth of Yugoslavia\nReferences\nSources\n*\n*\n*\n*"
    }
  ]
}