{
  "content": [
    {
      "type": "text",
      "text": "# Crusader (Marvel Comics)\n\n}}\nCrusader is the name of several characters appearing in American comic books published by Marvel Comics. Two versions have made significant appearances while others are minor characters who have utilized the alias.\nThe first version first appeared in Thor  #330 (April, 1983) and was created by writer Alan Zelenetz and penciller Bob Hall.\nThe second version is a Skrull superhero that first appeared in Marvel Team-Up vol. 3 #23 (Aug. 2006) and was created by Robert Kirkman and Andy Kuhn.\nFictional character biography\nArthur Blackwood\nArthur Blackwood is a seminary student from Decatur, Illinois who believes that the church should be more active in fighting paganism and godlessness. Dismissed from the seminary for his beliefs, Blackwood visits his family crypt to meditate on his life. There, he experiences a vision of all of his ancestors who devoted their lives to serving God and is gifted the armor and weaponry of a knight. Blackwood decides to take up the sword and use his power to destroy pagans and infidels as the Crusader. Crusader attacks Thor, with his faith giving him sufficient power to hold his own in battle. However, Thor is healed by Odin and destroys Crusader's sword. Crusader, overcome by Thor's divine power, flees and begins doubting the righteousness of his cause. Crusader later repairs his sword and returns to crime.\nDuring the \"Civil War\" storyline, it is revealed that the Crusader is still active and has formed a religious group of thugs. He is confronted by Wolverine, who gouges out his right eye.\nPowers and abilities\nArthur Blackwood gained superhuman powers after experiencing a religious vision in which he was seemingly bequeathed the combined power of his ancestors who had served God. The Crusader's physical attributes, as well as the power of his sword and shield, are directly related to his will and belief. While he is confident, his strength, speed, stamina, agility, dexterity, reflexes/reactions and resistance to injury are sufficient for him to stand toe-to-toe with the likes of Thor. However, if his faith wavers, his superhuman powers rapidly disappear. Upon transforming into the Crusader, he instantly summons his mystical body armor, sword, and shield. These items are strong enough to withstand repeated blows by Thor's hammer before shattering. As the Crusader, he is a master swordsman and jouster. Blackwood has earned a master's degree, though his studies towards Doctorate of Divinity remain uncompleted.\nZ'Reg\nZ'Reg is a Skrull operative who was sent to spy on the Avengers, but arrived on Earth after the Avengers had disbanded. Falling in love with the planet's customs and superheroes under the civilian identity of Aubrey Thompson, Z'Reg decides to become a superhero under the name Crusader.\nCrusader soon becomes the mentor of Freedom Ring. After Freedom Ring is killed by Iron Maniac, Crusader takes the boy's reality-altering ring for himself.\nCrusader is later seen as a member of the Fifty State Initiative. KIA, a clone of Michael Van Patrick, attacks Camp Hammond and severs Crusader's hand. His hand is surgically reattached, but Crusader fears that medical examination will expose him as a Skrull. In response, he uses his ring to make himself appear human and his medical test results appear normal.\nDuring the Secret Invasion storyline, the Initiative is infiltrated by Skrulls, causing Crusader to fear that he will be exposed as a Skrull despite his good intentions. Despite Crusader's efforts, 3-D Man realizes that he is a Skrull and shoots him through the head. As Crusader lays mortally injured, he wishes \"it could have ended differently\" and then disappears.\nPowers and abilities\nZ'Reg's Skrull physiology enables him to shapeshift into virtually any form that he chooses and copy the powers of other heroes. Later, he takes Curtis Doyle's ring as an honor for his death. The ring was crafted from a fragment of a destroyed Cosmic Cube which allows the wearer to alter reality within a radius of roughly 15 feet (4.6m) around him, giving him a  sphere of reality he can alter.\nOther characters named Crusader\n* In Black Knight Comics #1-5, el Alemain was known as Crusader circa 1189 A.D.  He was an Englishman and an ally of King Richard. He wore a robe and headdress and used a scimitar.\n* An impostor Marvel Boy (Robert Grayson) was called Crusader in Fantastic Four #165.\n* On Earth-238, Perseus Ablemarle is known as Crusader. He sought vengeance on the criminals who killed his parents and was possibly killed on his first outing. He was trained in various forms of combat and first appeared in Rampage Magazine #41 and died in Marvel Super-Heroes #388.\n* On Earth-9811, Sarah Rogers, the daughter of Captain America and Rogue, was known as Crusader. She first appeared in What If? vol. 2 #114 and Avengers Forever #11-12.\n* In the Ultraverse (non-Marvel comics), an immortal warrior was called Crusader but was defeated by Rune in 1348 A.D. and later killed by Rune. He first appeared in Rune vol. 2 #4.\n* On Earth-2122, a member of the Captain Britain Corps was called Crusader X. He was one of the sole survivors of Mastermind's slaughter of the Corps and assisted Excalibur in his defeat. He first appeared in Excalibur #21.\nReferences\nExternal links\n*\n* [https://marvel.com/universe/Crusader_(Z%27reg) Crusader (Z'Reg)] at Marvel.com\n* [https://marvel.fandom.com/wiki/Arthur_Blackwood_(Earth-616) Crusader (Arthur Blackwood)] at Marvel Wiki\n* [https://marvel.fandom.com/wiki/Z%27Reg_(Earth-616) Crusader (Z'Reg)] at Marvel Wiki\n*\n*"
    }
  ]
}