{
  "content": [
    {
      "type": "text",
      "text": "# Crusader: No Regret\n\n|EU|1996}}\n| genre = Third-person shooter\n| modes = Single-player\n| platforms = MS-DOS\n}}\nCrusader: No Regret is an isometric action game developed by Origin Systems and published by Electronic Arts in 1996. Nominally a sequel to 1995's Crusader: No Remorse, it is considered both by critics and by the game director more akin to a stand-alone expansion pack. Mechanically similar to No Remorse, it features new levels, enemies and weapons.\nSet immediately after the events of No Remorse, No Regret chronicles the further adventures of the Silencer, a supersoldier-turned-resistance-fighter in a dystopian 22nd century.\nGameplay\nThe gameplay is similar to Crusader: No Remorse. The player controls the Silencer as he fights his way through the levels. Teleportation pads are used for quick travel within and between levels.\nNo Regret added several new weapons and death animations, including freezing (and subsequent shattering) and two different kinds of melting. In No Remorse, the Silencer could carry no more than five firearms at once; in No Regret, this restriction was lifted entirely. Nonplayer characters no longer carry money, since there are no friendly merchants to deal with on the Moon.\nGameplay is more combat-oriented than that of No Remorse. In that game, many obstacles could either be circumvented, defeated with items such as passkeys, or blown up with brute force. This latter tactic is usually the only available course of action in No Regret.\nPlot\nNo Regret begins 46 hours after the events in No Remorse. A WEC freighter headed for the Moon picks up the escape pod, and the Silencer, upon moonfall, makes contact with the local Resistance. The WEC uses the moon as both a mine and prison, where most of the political dissidents and Resistance members are forced to extract a precious radioactive compound, Di-Corellium, the mineral that is the basis of virtually all energy production on Earth. Approximately half of all known reserves are on the Moon, and a shortage of Di-Corellium would cause serious problems for the WEC. For this reason, Chairman Draygan is on the Moon to oversee the Di-Corellium production, which has been lagging recently—possibly due to incursions from the Resistance cell on Moon, at the hidden Dark Side base. On learning of the Silencer's presence, he sends all his forces against him.\nOver the course of No Regrets ten missions, the Silencer works to undermine the WEC presence on the Moon, culminating in a showdown with Chairman Draygan who pilots a mech. The WECs lunar headquarters are destroyed and the Resistance takes control of mining operations, with the hint of further conflicts with the WEC. The game's story is notably more simplified and straightforward than that of No Remorse.\nDevelopment\nBoth games use an advanced version of the Ultima VIII: Pagan isometric view engine featuring full SVGA graphics. The game's audio uses a specially made engine, called Asylum Sound System, which employs MOD files rather than General MIDI, in order to provide good quality without relying on expensive hardware. Each mission has its own track. The soundtracks for both games were composed by Andrew Sega and Dan Grandpre of the now-defunct Straylight Productions. No Regret introduced higher-quality 16-bit samples.\nThe Crusader games feature full motion video (FMV) sequences with live actors; FMVs are used in cutscenes to further the story, generally through interaction with other characters. These conversations are generally one-sided, as the player character never speaks. Like many Origin games, both No Remorse and No Regret shipped with significant in-universe back-story material, including a fold-out propaganda poster, newspaper and guides from the WEC and the Resistance.\nNo Regret was developed on a tight schedule, so director Tony Zurovec could not implement all the improvements he had in mind for the sequel to No Remorse. As such he does not consider it a true sequel to that game. A working title of Crusader: No Regret was No Quarter and Origin management also wanted to release it as Crusader II: No Regret (the numeral was removed per Zurovec's wishes). A cancelled multiplayer expansion was to be titled Crusader: No Survivors.\nThough Jorg Newman, producer of the Saturn and PlayStation versions of Crusader: No Remorse, said in a 1996 interview that he would be working on Saturn and PlayStation versions of No Regret in early 1997, No Regret was never released for consoles.\nRelease\nGOG.com released an emulated version for Microsoft Windows and Mac OS X in 2011.\nIt is also available on Electronic Arts Origin platform. EA made the game available for free in 2014 as part of the Origin On the House program.\nReception\n|GSpot = 8.9/10\n|PCGUS= 88%\n|PCGUK= 85%\n|PCPP = 95%\n|rev1=Computer Games Magazine\n|rev1Score=\n}}\nNo Regret was generally well received. Major Mike wrote in GamePro, \"Regret shows no remorse in outclassing its predecessor by showcasing better graphics, more refined gameplay, and more mayhem.\" He considered the forward roll a particularly strong addition, and also commented positively on the music. He gave the game a 4.5 out of 5 in graphics and a perfect 5.0 in every other category (sound, control, and fun factor). GameSpot praised the attention to detail in the graphics. PC Gamer welcomed the addition of controller support. There was a general impression that the difficulty had increased over No Remorse, partly thanks to superior enemy A.I. and partly thanks to the trickier puzzles and traps.\nSome critics complained about the FMV-driven story and agreed with Zurovec's idea of the game as more of a \"level pack\" than a true sequel.\nNo Regret was nominated as Computer Games Strategy Pluss 1996 action game of the year, although it lost to Syndicate Wars.\nReferences\nExternal links\n*[https://www.mobygames.com/game/crusader-no-regret Crusader: No Regret] at MobyGames\n*"
    }
  ]
}