{
  "content": [
    {
      "type": "text",
      "text": "# Crusades trilogy\n\nThe 'Crusades Trilogy' is a series of historical novels written by Swedish author and journalist Jan Guillou about the Consolidation of Sweden and the Crusades. The main character of the trilogy is Arn Magnusson, a fictional Knight Templar in the 12th century, who becomes a witness as well as a catalyst to many important historical events both in his homeland of Västra Götaland  and in the Crusader states.\nThe trilogy consists of the following novels:\n*The Road to Jerusalem, original Swedish title Vägen till Jerusalem (1998)\n*The Knight Templar, original Swedish title Tempelriddaren (1999)\n*The Kingdom at the End of the Road, also called Birth of a Kingdom, original Swedish title Riket vid vägens slut (2000)\nThere is also a fourth novel entitled The Heritage of Arn (2001), original Swedish title Arvet efter Arn.'' It is as a direct follow-up to the trilogy, depicting the rise of Birger Jarl, who came to rule during the formation of Sweden and is the supposed founder of Stockholm. In Guillou's fictional universe, Birger Jarl is the grandson of Arn Magnusson.\nConcept and creation\nIn 1995 Guillou had finished his bestselling Cold War spy series about Carl Hamilton. By this time he had begun noticing an increasing hostility in Western media, such as on CNN, against the Arab world. He concluded that the United States and the United Kingdom were looking to target a new enemy to replace the Soviet Union and Communism, in order for the West to keep the world separated into good guys and bad guys. He decided to depict this political development by writing about the previous Holy War between Christianity and Islam.\nAlthough the majority of the Crusading Knights came from France, Guillou needed a Swedish protagonist since he is mainly writing for a Swedish readership, even he admits that a Swedish crusading knight is less realistic. With this decision a large part of the plot had to be set in Sweden, but when Guillou began his historical research about the 12th century he found that Sweden was yet to be created. At his chosen period, the different realms that were to be consolidated into Sweden were still ruled by blood-feuding noble houses and many historical facts were vague and contested. This added the creation of Sweden as a major theme for the trilogy, and he chose the historical thesis that the region of Västra Götaland had been the cradle of Sweden.\nMain plot\nThe first novel begins in the year 1150 with the birth of Arn in the kingdom of Västergötland, one of the realms pre-dating Sweden. The story follows Arn's childhood and upbringing and his subsequent involvement in the politics and events of the realm, before being banished to the Holy Land at the age of 17.\nThe second novel follows Arn in Palestine, where he has become a Knight Templar and participates in the defense of Gaza and Jerusalem from the forces of Saladin. In parallel the novel also follows the development in Västergötaland, through the eyes of his lover Cecilia.\nThe third novel sees the return of Arn to Västergötland, where he implements his learnings from the Crusades into his home society and takes a crucial part in the formation of Sweden.\nThe character of Arn Magnusson\nArn is born in the year 1150 as the second son of a noble Folkung family in Arnäs, Västergötland. At the age of five he has a life-threatening accident when falling from the tower of his family's fortress, and is believed to be saved from harm thanks to his mother's intense prayers to Saint Bernard of Clairvaux. The mother considers it a miracle and finds she must recompensate God by giving the boy to the monastery in Varnhem.\nArn remains with the monks for twelve years, largely isolated from the outside world, and in addition to studying the languages and the learned arts of the monks he comes to be trained in the art of medieval war by a brother Guilbert who is a former Knight Templar in Outremer. Brother Guilbert trains Arn in horse riding and the use of weapons, with the modern techniques from France and the Holy Land that are yet to be discovered in Scandinavia, where the men still fight like Vikings. When reaching adulthood, the Prior Father Henri tells Arn he is to return to his family. Arn wishes to become a monk, but before being able to take the eternal vows of poverty, chastity and obedience (q.v. Evangelical counsels) he must witness the outside world.\nArn gets involved in the deadly politics of the realm, both with his own family's local feuds and the blood-feud between the two royal families competing for the throne. He proves himself as a superior swordsman when defending his family's honour and participates in the assassination of the king, making him a prodigious adversary in the feud for the throne. Through political schemes he is judged guilty of the terrible sin of fornication before marriage with the noble daughter Cecelia Algotsdotter, who he is engaged to. Cecelia has become pregnant and tells her sister Katarina. Katarina, who fears she will be stuck in the nunnery she has until then shared with Cecelia, becomes jealous and tells the Abbess. To make things worse, she claims that Arn also had carnal knowledge of her as well, from a feast when she had attempted (and failed) to seduce a very naive and very drunk Arn. According to the laws of the Church, it is considered especially heinous and scandalous to have sexual intercourse with two women who have the same mother, and further triggered by his role in the ongoing power struggle in the realm, Arn is condemned to spend 20 years in the Holy Land as a Knight Templar, while Cecelia is given the same sentence to the nunnery.\nAt the age of 27, Arn has become a veteran in the Crusader army, when he faces the strangest experience a Knight Templar can have. During a time of truce, while pursuing a band of Saracen thieves, he comes across the very enemy of all Christendom, Saladin, and saves his life. This idea is apparently borrowed from The Talisman by Sir Walter Scott. After this, both become very close friends, but great enemies at the same time. Arn returns to his command of the fortress at Gaza, later seeing Saladin's army arrive but not stay to lay siege, instead advancing on a bigger prize, the city of Jerusalem. Arn is given the order to march with all his knights, and they defeat Saladin's army at the Battle of Montgisard. When Arnold of Torroja is named Grand Master of the Knights Templar, Arn is summoned to Jerusalem to become Master of the city.\nIn the Battle of Hattin, Arn is severely wounded and spends several weeks at Saladin's hospital in Damascus, after that he accompanies him to Jerusalem, which is conquered. In the very end of the second book, Richard the Lionheart comes to Palestine with an army of crusaders. He captures Acre from Saladin, and when about to buy the freedom of 5,700 prisoners from the Christian king, Saladin and Arn were horrified to see Richard having them slaughtered, even the children \"as the mamluks were riding, trying to save them, in tears.\" Arn then confides that Richard \"only will be remembered as the slaughterer\" and that he will never capture Jerusalem, thus confiding himself that he doesn't care if the city remains in Muslim hands. He embraces Saladin, and then starts traveling home to Sweden, where a kingdom is about to be born. On his leave Saladin hands him a very large sum of gold money, the money that Richard declined to kill the prisoners. He also awards him a special sword worthy of a Knight Templar. The money allows him to fulfill the plans he has with the new kingdom.\nAfter returning to Sweden along with a group of people from the Holy Land (among them two Armenian craftsmen, two Englishmen specializing in crossbows and longbows, glass workers, felt makers, copper smiths and two learned Saracen physicians), Arn has great plans for his childhood home, Arnäs, and Forsvik, the estate which was to be his before he was forced into service as a Templar. He explains his idea of \"building for peace\" by constructing a modern castle at Arnäs and to create a manufacturing centre at Forsvik.\nArn starts training several young men and boys to become knights (or at least a competent cavalry force) at Forsvik.\nWhen he returns to his family, they are at first overwhelmed with a joy that soon cools when he voices his desire to marry Cecilia. His family wishes to use him for a political marriage, but due to the intrigues of Cecilia and her friend the Queen they are soon after married, earning them the enmity of Birger Brosa. After a little time they have a daughter together and Forsvik grows rapidly.\nHowever his newfound luck is shattered when King Sverker attempts to kill the sons of the late King Knut. Commanding his force of cavalry, he defeats the king's soldiers at the Battle of Älgarås. He also takes command at the Battle of Lena and emerges victorious.\nTwo years later, when King Sverker returns once again with a Danish army and Arn commands the forces of King Erik at the Battle of Gestilren. He takes a fatal wound while pushing forward to kill King Sverker, he succeeds in this and the battle is won. He dies of his wounds a few days later, now aged 60, and is buried in Varnhem monastery.\nTranslations\nThe Knight Templar trilogy is translated to the following languages:\n* Bulgarian (Рицaрят тaмплиeр: \"Пътят към Йeрусaлим\", \"Рицaр на Храма\", \"Крaлствo в крaя на пътя\")\n* Catalan (Trilogia de les Croades: El camí de Jerusalem, El cavaller del Temple and El retorn a casa)\n* Chinese (圣殿骑士)\n* Croatian (Put u Jeruzalem, Vitez Templar, Kraljevstvo na kraju puta)\n* Czech (Cesta do Jeruzaléma, Templářský rytíř, Království na konci cesty).\n* Danish (Historien om Arn: Vejen til Jerusalem, Tempelridderen and Riget ved vejens ende, and besides that Arven efter Arn)\n* Dutch (De weg naar Jeruzalem, De Tempelridder and De terugkeer)\n* English (The Crusades Trilogy: The Road to Jerusalem, The Templar Knight, and Birth of the Kingdom)\n* Estonian (Tee Jeruusalemma, Templirüütel and Riik tee lõpus)\n* Finnish (Ristiretki-trilogia: Tie Jerusalemiin, Temppeliherra and Pohjoinen valtakunta and as fourth Arnin perintö)\n* French (Le Chemin de Jérusalem  - Trilogie d'Arn le templier - tome I, Le Chevalier du Temple  - Trilogie d'Arn le templier - tome II, Le Royaume au bout du chemin  - Trilogie d'Arn le templier - tome III, ''L'Héritage d'Arn le templier)\n* German (Die Götaland-Trilogie: Die Frauen von Götaland, Die Büßerin von Gudhem and Die Krone von Götaland)\n* Italian (Il Romanzo delle Crociate: Il Templare, Il Saladino, La Badessa)\n* Norwegian (Arn-trilogien: Veien til Jerusalem, Tempelridderen and , and besides that Arven etter Arn)\n* Polish (Krzyżowcy: Droga do Jerozolimy, Rycerz zakonu templariuszy, Królestwo na końcu drogi)\n* Portuguese (Trilogia \"As Cruzadas\": A Caminho de Jerusalem, O Cavaleiro Templário and O Novo Reino)\n* Serbian (Витез темплар: Пут за Јерусалим, Темплар, and Краљевство на крају пута)\n* Spanish (El camino a Jerusalén, El caballero templario and El reino al final del camino/Regreso al Norte)\nFilm and TV adaptation\nThe trilogy was adapted into two Swedish movies and an extended tv series, with a simplified version of the original plot from the novels. The first movie Arn: The Knight Templar premiered in Sweden in December 2007, followed by Arn – The Kingdom at Road's End in August 2008. The tv series, extended into 6 hours, was first broadcast on TV4 (Sweden) in March 2010. The adaptation is the most expensive Swedish movie project ever.\nSee also\n*The Road to Jerusalem (1998),  the first book in the series\n*The Knight Templar (1999),  the second book in the series\n*The Kingdom at the End of the Road (2000),  the third book in the series\n*The Heritage of Arn'' (2001),  sequel to the trilogy\nReferences\nExternal links\n*\n*"
    }
  ]
}