{
  "content": [
    {
      "type": "text",
      "text": "# Cuban Revolutionary Armed Forces\n\n| image =\n| alt =\n| caption = Emblem of the Cuban Revolutionary Armed Forces\n| image2 =\n| alt2 =\n| caption2 = Logo of the Cuban Revolutionary Armed Forces\n| motto =\n| founded =\n| current_form =\n| disbanded =\n| branches =\n| headquarters = Havana, Cuba\n| flying_hours =\n| website =\n| commander-in-chief = Miguel Díaz-Canel\n| commander-in-chief_title = First Secretary\n| chief minister =  President Miguel Díaz-Canel\n| chief minister_title = Commander-in-chief\n| minister =  Corps Gen. Álvaro López Miera\n| minister_title = Minister of the FAR\n| commander =  Lieutenant Gen. Roberto Legrá Sotolongo\n| commander_title = Chief of the General Staff\n| age = 17-28 years of age for compulsory military service\n| conscription = 2-year service obligation for both genders\n| active = 50,000 (2022 est.)\n| ranked =\n| reserve = 40,000\n| deployed =\n| amount =\n| percent_GDP = 4.2% (2020 est.)\n| domestic_suppliers = Union de Industrias Militares\n| foreign_suppliers =\n*\n| imports =\n| exports =\n| history = Escambray rebellionBay of Pigs InvasionSand WarGuinea-Bissau War of IndependenceWar of AttritionYom Kippur WarAngolan Civil WarOgaden WarUnited States invasion of Grenada\n| ranks = Military ranks of Cuba\n}}\nThe Cuban Revolutionary Armed Forces (; FAR) are the military forces of Cuba. They include Revolutionary Army, Revolutionary Navy, Revolutionary Air and Air Defense Force, and other paramilitary bodies including the Territorial Troops Militia ( – MTT), Youth Labor Army ( – EJT), and the Defense and Production Brigades ( – BPD), plus the Civil Defense Organization ( – DCC) and the National Reserves Institution ( – INRE). All these groups are subordinated to the Ministry of the Revolutionary Armed Forces ( – MINFAR).\nThe armed forces have long been the most powerful institution in Cuba. The military manages many enterprises in key economic sectors representing about 4% of the Cuban economy. The military has also served as former Cuban Communist Party First Secretary, as well as former President of Cuba, Raúl Castro's base. In numerous speeches, Raúl Castro emphasized the military's role as a \"people's partner\".\nHistory\nThe Cuban Army in its original form was first established in 1868 by Cuban revolutionaries during the Ten Years' War. It joined the Allies in the World War I in April 1917 and supplied sugar to several countries, mainly the United States of America. It was involved in the Battle of the Caribbean during World War II when it was part of the Allies supported by the United States. After the Cuban Revolution overthrew Fulgencio Batista's government, the Cuban Rebel Army under Fidel Castro's leadership was reorganized into the current armed forces of Cuba.\nDuring the Cold War, the Soviet Union granted both military and financial aid to Cuba. From 1966 until the late 1980s, Soviet Government military assistance enabled Cuba to upgrade its military capabilities to number one in Latin America and project power abroad.  The first Cuban military mission in Africa was established in Ghana in 1961. Cuba's military forces appeared in Algeria, in 1963, when a military medical brigade came to support the government. In 1966 and 1967 little forces of Cuba landed in Venezuelan coast to support leftist guerilla of the FALN. Since the 1960s, Cuba sent military forces to African and Arab countries – Syria in 1973, Ethiopia in 1978, Angola from 1975 to 1989, and Nicaragua, El Salvador and reportedly Afghanistan during the 1980s. The tonnage of Soviet military deliveries to Cuba throughout most of the 1980s exceeded deliveries in any year since the military build-up during the 1962 Cuban Missile Crisis. According to an Afghan Army defector and the Mujahideen, Cuban forces were present in 1981 during the Soviet–Afghan War and were described as \"big and black and shout very loudly when they fight. Unlike the Russians, they were not afraid to attack us in the open.\"\nIn 1989, the government instituted a clean-up of the armed forces and the Ministry of Interior, convicting army Major General and Hero of the Republic of Cuba Arnaldo Ochoa, Ministry of Interior Colonel Antonio de la Guardia (Tony la Guardia), and Ministry of Interior Brigadier General Patricio de la Guardia on charges of corruption and drug trafficking. This judgment is known in Cuba as \"Causa 1\" (Cause 1). Ochoa and Antonio de la Guardia were executed.  Following the executions, the Army was drastically downsized, the Ministry of Interior was moved under the informal control of Revolutionary Armed Forces chief General Raúl Castro (Fidel Castro's brother), and large numbers of army officers were moved into the Ministry of Interior.\nThe U.S. Defense Intelligence Agency reported in 1998 that the country's paramilitary organizations, the Territorial Militia Troops, the Youth Labor Army, and the Naval Militia had suffered considerable morale and training degradation over the previous seven years but still retained the potential to \"make an enemy invasion costly.\" Cuba also adopted a \"war of the people\" strategy that highlights the defensive nature of its capabilities.\nCuban military power was sharply reduced by the loss of Soviet subsidies following the end of the Cold War, and today the Revolutionary Armed Forces number 39,000 regular troops.\nIn April 2021, longtime Chief of Staff Álvaro López Miera took over as the Minister of the Revolutionary Armed Forces.\nCommand\n;\nRevolutionary Army\n, Santiago de Cuba]]\nThe Central Intelligence Agency wrote in May 1979 that when \"the economy took a downturn in 1970, the Castro regime, partly at Soviet urging, reduced its forces by some 60 per cent, eventually freeing more than 150,000 people for full-time civilian employment. All branches of the armed services except the Air Force were affected noticeably. The Air Defence Force shrank from six brigades and 24 occupied SA-2 surface-to-air missile sites to three brigades and 18 sites, leaving eastern Cuba unprotected by surface-to-air missiles. The Navy lost a number of radar surveillance posts, again to the detriment of eastern Cuba. The Army was more than halved in size and reorganised.\" (PA79-10173D)\nIn 1984, according to ''Jane's Military Review, there were three major geographical commands, Western, Central, and Eastern.  There were a reported 130,000 all ranks, and each command was garrisoned by an army comprising a single armored division, a mechanized division, and a corps of three infantry divisions, though the Eastern Command had two corps totaling six divisions. There was also an independent military region, with a single infantry division, which garrisoned the Isle of Youth.\nA U.S. Defense Intelligence Agency assessment in the first half of 1998 said that the army's armor and artillery units were at low readiness levels due to 'severely reduced' training, generally incapable of mounting effective operations above the battalion level, and that equipment was mostly in storage and unavailable at short notice. The same report said that Cuban special operations forces continue to train but on a smaller scale than beforehand, and that while the lack of replacement parts for its existing equipment and the current severe shortage of fuel were increasingly affecting operational capabilities, Cuba remained able to offer considerable resistance to any regional power.\nRevolutionary Air and Air Defence Force\nThe Cuban Revolutionary Air and Air Defence Force (DAAFAR) was used in the 1980s with the help of the Soviet Union to be able to project power abroad, especially in Africa. During that time Cuba sent jet fighters and transports for deployment in conflict zones such as Angola and Ethiopia.\nIn 1990, Cuba's Air Force was the best equipped in Latin America. In all, the modern Cuban Air Force had approximately 230 fixed-wing aircraft. Although there is no exact figure available, Western analysts estimate that at least 130 (with only 25 operational) of these planes are still in service spread out among the thirteen military airbases on the island.\nIn 1996, fighters from the DAAFAR shot down two Cessna aircraft based in Florida which were incorrectly suspected of dropping leaflets into Cuban airspace. The air force was criticised for not giving the pilots of the aircraft options other than being shot down. One aircraft escaped.\nIn 1998, according to the same DIA report mentioned above, the air force had \"fewer than 24 operational Mikoyan-Gurevich (MiG) fighters; pilot training barely adequate to maintain proficiency; a declining number of fighter sorties, surface-to-air missiles and anti-aircraft guns to respond to attacking air forces.\"\nBy 2007 the International Institute for Strategic Studies assessed the force as 8,000 strong with 41 combat capable aircraft and a further 188 stored. DAAFAR is known now to have acquired another MiG-29 and a few MiG-23s, giving it 58 combat aircraft in active service. These are listed as 6 MiG-29s, 40 MiG-23s, and 12 MiG-21s. IISS also estimated DAAFAR had 12 operational transport aircraft, plus trainers which include 8 L-39C, and helicopters, mainly Mil Mi-8, Mil Mi-17, and Mil Mi-24 Hind. Raúl Castro ordered in 2010 that all MiG-29 pilots had to have full training, they now have from 200–250 hours of flight annually together with real dogfight training and exercises.  Up to 20 MiG-23 units also have this kind of training but the other 16 MiG-23 units spend more time in simulators than real flight.  MiG-21 units have limited time in these training exercises and spend more time in simulators and maintain their skills flying with Aerogaviota, the commercial brand of the air force.\nRevolutionary Navy\nIn 1988, the Cuban Navy boasted 12,000 men, three submarines, two modern guided-missile frigates, one intelligence vessel, and a large number of patrol craft and minesweepers. However, most of the Soviet-made vessels have been decommissioned or sunk to make reefs. By 2007, the Cuban Navy was assessed as being 3,000 strong (including up to 550+ Navy Infantry) by the IISS with six Osa-II missile boats and one . The Cuban Navy also includes a small marine battalion called the Desembarco de Granma''. It once numbered 550 men, though its present size is not known.\nAfter the old Soviet submarines were put out of service, Cuba searched for help from North Korea's experience in midget submarines. North Korean defectors claimed to have seen Cubans in mid to late 1990s in a secret submarine base. Years later, a single picture became public of a small black native submarine in Havana harbor. It is rumored to be called 'Delfin' and is to be armed with two torpedoes. Only a single boat is in service and the design appears original, even if influenced both by North Korea and Soviet designs.\nThe Cuban Navy rebuilt one, large ex-Spanish Rio Damuji fishing boat. BP-390 is now armed with two C-201W missiles, one twin 57&nbsp;mm gun mount, two twin 25&nbsp;mm gun mounts and on 14.5&nbsp;mm machine gun. This vessel is larger than the , and it is used as a helicopter carrier patrol vessel. A second unit (BP-391) was converted and entered service in 2016.\nThe Cuban Navy today operates its own missile systems, the made-in-Cuba Bandera (a copy of the dated Styx Soviet missiles) and Remulgadas anti-ship missile systems, as well as the nationally produced Frontera self-propelled coastal defence multiple rocket launcher. The navy's principal threats are drug smuggling and illegal immigration. The country's geographical position and limited naval presence has enabled traffickers to utilise Cuban territorial waters and airspace.\nThe Cuban Navy's air wing is an ASW helicopter operator only and is equipped with 2 Mi-14 Haze helicopters.\nAir and Naval air bases\nActive bases\n:\n* Cabañas (HQ Western Command) – San Julián Air Base (MUSJ)\n** 23rd Regiment (Mikoyan-Gurevich MiG-23ML)\n** Primary Training (Antonov An-2)\n** 1650 Combat Training (Mikoyan-Gurevich MiG-21UM)\n** Combat Training Squadron (Mikoyan-Gurevich MiG-21PFMA and Mikoyan-Gurevich MiG-21MF)\n** Rwy 01/19 2041&nbsp;m (6695&nbsp;ft)\n** Rwy 08/26 2584&nbsp;m (8479&nbsp;ft)\n** Naval Base?\n*Alameda del Siboney\n** 23° 5'25\"N, 82°28'45\"W and 22°58'45\"N, 82°59'15\"W\n* Holguín (HQ Eastern Command) – Frank País Airport (MUHG)\n** 1724 Interceptor Regiment (Mikoyan-Gurevich MiG-23BN bomber)\n** 3710 Interceptor Squadron and Training\n** 34th Tactical Regiment\n** Naval Base?\n* Havana – Playa Baracoa Airport (MUPB)\n** 3405th Executive Squadron\n** 3404 Transport Squadron\n** 3688 Transport Regiment\n* Havana – José Martí Airport (MUHA)\n** 25th Transport Regiment (Ilyushin Il-76 and Antonov An-32)\n** Rwy 06/24, Size: 4001&nbsp;m (13,125&nbsp;ft)\n* La Coloma Airport (MULM)\n** 1660 Training Squadron (Aero L-39 AlbatrosC)\n* Casablanca, Havana naval base\n** homeport for the navy's two frigates\n* there are naval facilities in Cienfuegos (patrol vessels docked near Museo Historico Naval Nacional in Cayo Loco area), Mariel (near shipyard/container port), Nicaro and Punta Movida.\nInactive bases\n* Mariel – Mariel Airfield (MUML) – now container terminal\n** former anti-submarine helicopter squadron (Ka-32 and Mil Mi-14PL)\n* Campo de Columbia – renamed Campo Libertad in 1961 (MULB)\n** 26th Transport Regiment (Mil Mi-2 and Mil Mi-8)\n** Training Squadron (Aero L-39 AlbatrosC and Z-326T)\n** 2065&nbsp;m (6775&nbsp;ft runway)\n* Campo Teniente Brihuega\n* Playa Baracoa – Playa Baracoa Airfield (MUPB)\n** 22nd Regiment\n* Nicaro Airport (MUNC)\n** abandoned airfield 1315&nbsp;m (single 4314&nbsp;ft runway)\n* Punta Movida\n** Soviet built base\n* Cienfuegos Airport (Jaime González Air Station) (MUCF)\n** single 2/20 runway 1510&nbsp;m (4954&nbsp;ft)\n** 15th Transport Regiment (Antonov An-2 and Antonov An-26)\n** 16th Helicopter Regiment (Mil Mi-8, Mil Mi-14, Mil Mi-17)\n* Güines\n** 24 Tactical Regiment (Mikoyan-Gurevich MiG-23BN)\n* Santiago de Cuba – Antonio Maceo Airport (MUCU)\n** 35th Transport Regiment (Antonov An-2 and Antonov An-26)\n** 36 Helicopter Regiment (Mil Mi-8 and Mil Mi-24)\n** Rwy 09/27 4000&nbsp;m (13123&nbsp;ft)\n** Rwy 18/36 1296&nbsp;m (4252&nbsp;ft)\n* San Antonio de los Baños Airport (MUSA)\n** 21st Regiment (Mikoyan-Gurevich MiG-21B)\n** 1724 Regiment\n** 3 Runways\n*** Rwy 01/19 2400&nbsp;m (7873&nbsp;ft)\n*** Rwy 05/23 3596&nbsp;m (11,799&nbsp;ft)\n*** Rwy 12/30 2482&nbsp;m (8144&nbsp;ft)\n* Santa Clara – Abel Santa María Airport (MUSC)\n** 14th Tactical Regiment (Mikoyan-Gurevich MiG-23BN) bomber\n** Rwy 08/26 3017&nbsp;m (9898&nbsp;ft)\n* Santa Cruz\n** 11 Regiment (Mikoyan-Gurevich MiG-21B)\n* Sancti Spíritus – Sancti Spiritus Airport (MUSS)\n** 12th Regiment (Mikoyan-Gurevich MiG-21MF)\n** Rwy 03/21 1801&nbsp;m (5908&nbsp;ft)\n* Camagüey – Ignacio Agramonte Airport (MUCM)\n** 31st Regiment – Mikoyan-Gurevich MiG-21MF fighters\n** Rwy 07/25 3000&nbsp;m (9842&nbsp;ft)\nSpecial Forces\nThe  (), also known formally as the Mobile Brigade of Special Troops (BMTE) is a special forces unit in the Cuban Revolutionary Armed Forces. It is often identified as Military Unit 4895\nDesembarco de Granma is a small marine battalion with Marines like role.\nParamilitary forces\nTerritorial Troops Militia\nThe Territorial Troops Militia is composed exclusively of civilian volunteers, under the command of MINFAR. It reinforced the notion of the popular will to defend the Revolution. In general, the militia is a part-time force with only light arms that are issued only on occasion.\nYouth Labor Army\nThe Youth Labor Army ( – EJT) is, by law, a paramilitary organization under the direct control of MINFAR. It was formally established on 3 August 1973 by combining the Centennial Youth Column (CJC) and the Permanent Infantry Divisions (DIP). Cuba's compulsory service laws require all male citizens to serve for three years in the EJT. The formation of the EJT allowed the army to devote itself full time to military matters. The EJT served as a reserve force in its first 20 years. In 1993, it was assigned the responsibility of managing the state farms.\nBorder Troops\nThe Border Troops of the Republic of Cuba () is a branch that ensures the protection of the state borders and territorial waters.  They are subordinate to the Interior Ministry (MININT). The official date of the establishment of this service was on September 23, 1970. In the second half of the 1970s, several agreements were signed, according to which some changes were made to border protection, including a 1976 agreement was signed between Cuba and Mexico on the delimitation of the exclusive economic zone in the sector of the Cuban-Mexican maritime border and a 1977 agreement was signed on the maritime border between Cuba and Haiti. The Border Troops are de facto both a border guard and a coast guard force, and all new officers are commissioned from the Granma Naval Academy.\nMilitary schools\n*Máximo Gómez Command Academy – succeeded the El Morro Academy, current command college of the CRAF\n*National Defense College of Cuba\n*Camilo Cienfuegos Military Schools System – founded 1962, with 20 campuses in many cities, official military high school\n*Jose Maceo Military College – officer cadet school of the Ground Force\n*Antonio Maceo Military College\n*Granma Naval Academy\n*Jose Marti Military Technical Institute – current officer cadet school of the technical services and the Air Force\n*Military Medical University of Cuba\n*Arides Sánchez Military Justice School\nEquipment\nSee also\n*Cuban military ranks\n*List of wars involving Cuba\n*Military interventions of Cuba\n*National Revolutionary Police Force\nReferences\nFurther reading\n* Jane's Intelligence Review, June 1993\n* Piero Gleijeses: Kuba in Afrika 1975–1991. In: Bernd Greiner /Christian Th. Müller / Dierk Walter (Hrsg.): Heiße Kriege im Kalten Krieg. Hamburg, 2006, , S. 469–510. ([https://web.archive.org/web/20071015155258/http://hsozkult.geschichte.hu-berlin.de/rezensionen/2006-3-024 Review by H. Hoff], [https://web.archive.org/web/20130426095031/http://www.akweb.de/ak_s/ak521/03.htm Review by I. Küpeli])\n* Defense Intelligence Agency, [https://www.hsdl.org/?view&did=446478 HAndbook on the Cuban Armed Forces, DDB-2680-62-79, April 1979]\nExternal links\n*  [http://www.cubadefensa.cu/ Official site of the Revolutionary Armed Forces]\n* [http://www.militar.org.ua/foro/ Foro Militar General (Cuban military forum)]\n*  [https://web.archive.org/web/20071109125450/http://urrib2000.narod.ru/ Cuban Air Force]\n*  [https://web.archive.org/web/20070515182708/http://www.granma.cubaweb.cu/secciones/generales/ Secretos de Generales] on Granma site\n* [https://web.archive.org/web/20070609182120/http://www.cubapolidata.com/cafr/cafr.html Cuban Armed Forces Review]\n* [https://fas.org/asmp/campaigns/smallarms/lainven.html Latin American Light Weapons National Inventories]\n* [http://www.globalsecurity.org/military/world/cuba/af-base.htm Map showing AFBs in Cuba]"
    }
  ]
}