{
  "content": [
    {
      "type": "text",
      "text": "# Cullen A. Battle\n\n|death_date=\n|image=Cullen A. Battle.jpg\n|caption=Cullen A. Battle\n|nickname=\n|birth_place= Powelton, Georgia, US\n|death_place= Greensboro, North Carolina, US\n|placeofburial=\n|placeofburial_label= Place of burial\n|allegiance= Confederate States of America\n|branch= Confederate States Army\n|serviceyears= 1861&ndash;65\n|rank=  Brigadier General\n|unit= Army of Northern Virginia\n|commands= Battle's Brigade\n|battles= American Civil War\n*Peninsula Campaign\n*Battle of South Mountain\n*Battle of Antietam\n*Battle of Fredericksburg\n*Gettysburg campaign\n*Mine Run Campaign\n*Bristoe Campaign\n*Overland Campaign\n*1864 Valley Campaign\n|awards=\n|relations=\n|laterwork= Lawyer, newspaper editor, politician\n}}\nCullen Andrews Battle (June 1, 1829 &ndash; April 8, 1905) was an American attorney, farmer, and politician. He was a general in the Confederate States Army during the American Civil War. He fought Congressional Reconstruction after the war in Alabama then North Carolina.\nEarly and family life\nCullen Battle was  born to Dr Cullen Battle and his wife, the former Jane Andrews Lamon, in Powelton, Georgia. Both his parents had been born in central North Carolina, his mother in Wake County and his father in Edgecombe County. Battle had at least 8 siblings. In 1835, after the expulsion of Creek Indians from the area, his parents moved to Irwinton, Alabama (a now-vanished town along the Chattahoochee River  near modern Eufaula) in Barbour County, Alabama. Battle received a private education appropriate for his class, then studied at the University of Alabama, and after graduation he read law with his brother-in-law John Gill Shorter, who would become Governor of Alabama.\nIn 1851 Cullen Battle married Georgia Florida Williams of LaGrange, Georgia. They had several children, including Rev. Henry Wilson Battle (b. 1855), a Baptist minister who moved back to North Carolina and later Petersburg, Virginia, and daughters Jenny (b. 1863) and Florence (b. 1867).\nEarly career\nAdmitted to the Alabama bar in 1852, Battle opened his private legal practice in Tuskegee, Alabama. In 1850, his father owned 243 enslaved people in Barbour County. In 1860, he or his father would own 66 slaves in Macon County,  and another 111 slaves in Russell County, Alabama (adjacent to Barbour County and named after an Indian fighter).  The younger Battle also became active in local politics. He became a presidential elector and also was lieutenant colonel of the local militia. When John Brown raided Harpers Ferry, Virginia, Battle raised a militia company and offered to assist the Virginia soldiers, but Virginia's Governor Wise declined his offer.\nAmerican Civil War\nWhen the Civil War began, Battle received a commission as major of the 3rd Alabama Infantry on April 28, 1861, and was sent with the regiment to Norfolk, Virginia. On July 31, he was promoted to lieutenant colonel of the regiment. He fought at the Battle of Seven Pines and was promoted to colonel on May 31, 1862. He missed the Seven Days Battles, but returned to the army in time for the Maryland Campaign, in September 1862, fighting at the battles of South Mountain and Antietam. He was injured after falling from his horse just before the Chancellorsville Campaign and was forced to relinquish command. Although he re-assumed command just a day later, his injuries were aggravated when his horse jumped a ditch, forcing him to turn over command again.\nBattle returned to the regiment for the Gettysburg campaign. The 3rd Alabama was one of the regiments in Edward O'Neal's Brigade, fighting on Oak Ridge on July 1. After O'Neal's Brigade had been terribly disorganized by the first day of battle, Colonel Battle attached his regiment to Brig. Gen. Stephen D. Ramseur's brigade for the remainder of the battle. General Robert E. Lee became displeased with O'Neal's performance and relieved him of command, putting Battle in his place. Battle subsequently led the brigade in the Bristoe Campaign and the Mine Run Campaign in the autumn and early winter.\nIn 1864, Battle led his men in the battles of the Wilderness, Spotsylvania Court House, North Anna, and Cold Harbor. Later that year, Battle's Brigade became part of Lt. Gen. Jubal A. Early's Army of the Valley and participated in the Battle of Monocacy in Maryland and the Battle of Fort Stevens in the District of Columbia. Back in the Shenandoah Valley, Battle fought at the Third Battle of Winchester, the Battle of Fisher's Hill, and was wounded at the Battle of Cedar Creek. His wound did not permit him to return to duty before the close of hostilities.\nPostbellum career\nAfter the war, Battle returned to his legal practice in Tuskegee, Alabama. He received a pardon from President Andrew Johnson during his controversial self-reconstruction policy for the former Confederate states. Despite Battle's election by voters (who in 3 other states also elected former Confederate Generals as their erstwhile representatives in Congress), the United States House of Representatives denied him a seat (likewise the other former high Confederate officeholders) and instead imposed Congressional Reconstruction on the former Confederate areas until they adopted state Constitutions. In the 1870 census, Battle listed his occupation as \"farmer\" and in the 1880 federal census, he listed his occupation as \"editor.\" Battle also became active in Confederate veterans' organizations.\nIn 1888, his son Rev. John W. Battle became pastor of a Baptist church in New Bern, Craven County, North Carolina. In 1890, Battle moved to Craven County, and began editing the New Bern Journal.  He was soon elected to the New Bern council, then its mayor. Meanwhile, Battle delivered speeches describing his experiences as a Confederate officer in many places and continued working on an autobiographical manuscript.\nDeath and legacy\nBattle died in Greensboro, North Carolina on April 8, 1905. He had survived his wife, and lived with his son Rev. Battle, who had accepted a position  with a Baptist church in Greensboro, and later accepted another in Petersburg, Virginia. Battle is now interred at historic Blandford Cemetery in Petersburg, Virginia. His manuscript on the Third Alabama Infantry was not published in his lifetime; the original is now in the collection of the Alabama Department of Archives and History. His grandson John S. Battle became a lawyer and politician, and Governor of Virginia during the start of Massive Resistance. During World War II an army camp at Glenburnie Park, two miles up the Neuse River from New Bern, was named \"Camp Battle\" to honor the Confederate officer by Lieutenant Colonel Wilson H. Stephenson.\nSee also\n* List of American Civil War generals (Confederate)\nNotes\nFurther reading\n* Eicher, John H., and David J. Eicher, Civil War High Commands. Stanford: Stanford University Press, 2001. .\n* Sifakis, Stewart. Who Was Who in the Civil War. New York: Facts On File, 1988. .\n* Warner, Ezra J. Generals in Gray: Lives of the Confederate Commanders. Baton Rouge: Louisiana State University Press, 1959. .\nExternal links\n*"
    }
  ]
}