{
  "content": [
    {
      "type": "text",
      "text": "# Culture of Saint Lucia\n\nThe culture of Saint Lucia blends the influences of African, French, and English heritage. The official language of the island is English but Kwéyòl (French Creole) remains an influential secondary language with an English Creole spoken as well. The people are predominantly Catholic but the religious climate is tolerant.\nFestivals\nSaint Lucia holds every year two main traditional festivals, La Woz (\"The Rose\", on August 30) and La Magwit (\"The Marguerite\", on October 17), organized by the two rival historic cultural associations (societés) with the same names whose affiliates comprise most of the country's population.\nThe Christmas season is celebrated and a number of small festivals and parades take place throughout the island.\nSaint Lucia also celebrates a cultural festival known as Creole Day (Jounen Kwéyòl). This is celebrated each year on the last Sunday of October. On the Sunday of this week, the various towns chosen to host this festival  put out the result of their grand preparations; local foods and drinks such as breadfruit, green fig, plantain, salt fish, king fish, manicou (opossum), roast pork, Johnny Cake (fried bake) and a famous dish, bouyon (fish, chicken or meat stewed with dasheen, yams, plantains, banana and dumplings), lime drinks, guava drinks and more. Most people commemorate this day by wearing the island's national wear known as the Madras. Persons who do not want to wear the extreme layers of skirts and dresses make clothing out of the special plaid material.\nSecular observances include an internationally renowned Jazz Festival. Beginning in 1991, this annual festival draws crowds of music-lovers from around the world.\nMusic\n]]\nThe musical culture of Saint Lucia includes an indigenous folk music tradition, as well as other Caribbean music genres such as Calypso, soca, zouk and reggae. Saint Lucia produces very high quantities of zouk music. Modern Saint Lucia today has produced artists/producers such as  Mecca, Teddyson John, Ricky T, Claudia Edwards, Shemmy J just to name a few.\nCuisine\nSt Lucia's national dish is green banana (also called green fig) and saltfish.\nThe island's cuisine is a blend of West African, European (mainly British and French) and East Indian cuisine. This creates dishes such as macaroni pie, stew chicken, rice and peas, hearty fish broths or fish water, and soups made with fresh locally grown vegetables. St Lucian cuisine is similar to many other Commonwealth Caribbean nations such as Dominica, Jamaica, neighboring St Vincent and Trinidad. Typical essential foodstuffs are potatoes, onions, celery, thyme, coconut milk, the very hot Scotch bonnet peppers, flour and cornmeal. All mainstream meat and poultry are eaten in St Lucia. Meat and seafood are normally stewed and browned to create a rich gravy sometimes served over ground provisions or rice.\nDue to influences from the island's small Indo-Caribbean population, curry is popular. However, due to the blend of cooking styles, curry dishes exhibit Caribbean influence. In recent years, roti, a flatbread of Indian origin, has become popular, being imported from the twin island nation of Trinidad and Tobago to the south. This bread is typically served as a fast-food snack. The bread itself is very flat (sometimes very thin) and is wrapped around curried vegetables such as chickpeas, potatoes, or meat.\nLiterature\nDerek Walcott is the most prominent St. Lucian writer, Nobel Prize winner in 1992.\nArt\nDr The Honourable Bongskie Agno, renowned St. Lucian artist, was knighted in the 2009/2010 New Year's honours list, for his services to art. The investiture ceremony was held on 9 April 2010, at Government House where the Governor General on the advice of Her Majesty the Queen, invested Sir Dunstan St. Omer with the Insignia of a Knight Commander of the Order of St Michael and St George (KCMG). The UK Telegraph has described him as “the Michelangelo of the Caribbean”. Designer of the St Lucian flag. In 2007 the Folk Research Centre declared him a National Cultural Hero. Born in Castries, on October 24, 1927. Died, aged 87, on May 5, 2015.\nCarnival\nTraditionally, in common with other Caribbean countries, Saint Lucia held a carnival before Lent. In 1999, it was moved to mid-July so as not to clash with the much larger Trinidad and Tobago carnival, and in effort to attract more overseas visitors. It is a two-day festival where people walk about two miles. Before carnival, there is a competition among women in the country to find the queen of carnival.\nSport\nAnother popular sport in Saint Lucia is Football. Football played all over the island as well as cricket.\nDarren Sammy is the former captain of the west Indies Cricket team. St.Lucia is home to 2024 Olympic 100m gold medalist and 200m silver medalist Julien Alfred\nSee also\n* Religion in Saint Lucia\nReferences\nExternal links\n* [http://archive.stlucia.gov.lc/saint_lucia/the_flag_of_saint_lucia.htm  Code of Etiquette for the use of the National Flag of Saint Lucia]\n* Biography available in [https://www.amazon.com/dp/B012JIUC1M The Designers (Saint Lucia National Symbols)]\n* [https://web.archive.org/web/20120725002741/http://stluciajazz.org/ St. Lucia Jazz] - Official site by St. Lucia Tourist Board\n* [http://www.stluciafolk.org/ St. Lucia Folk Research Center]\n* [https://web.archive.org/web/20100107020549/http://www.luciancarnival.com/ LucianCarnival.com] - Official website of Saint Lucia Carnival\n* [https://web.archive.org/web/20100515020703/http://luigistomer.com/ Luigi St Omer] - Web site of the most prominent St. Lucian painter Luigi St Omer"
    }
  ]
}