{
  "content": [
    {
      "type": "text",
      "text": "# Culture of Bengaluru\n\nBengaluru is the capital and largest city of the Indian state of Karnataka. With a population of over 15 million (as of January 2016), Bengaluru is the third largest city in India and 27th largest city in the world. Bengaluru is one of the most ethnically diverse cities in the country, with over 51% of the city's population being migrants from other parts of India. Historically a multicultural city, Bengaluru has experienced a dramatic social and cultural change with the advent of the liberalization and expansion of the information technology and business process outsourcing industries in India. IT companies in Bangalore employ over 35% of India's pool of 1 million IT professionals.\nGarden City\nBangalore is known as the Garden City of India and has two nationally recognized botanical gardens – Lal Bagh and Cubbon Park, which attract a lot of visitors through the year. The city was the recipient of the Indira Priyadarshini Vruksha Mitra award in the late 1980s, in recognition of its extensive green cover. Bannerghatta Zoo is also filled with green landscape with a wide variety of animals and birds.\nReligion\nThe people of Bengaluru are called Bengalurean or Bangalorean and the definition permeates class, religion and language. One of the major religions of Bengaluru is Hinduism. The city celebrates what is known to be Bengaluru's oldest festival called  \"Karaga Shaktyotsava\". Deepavali, the \"Festival of Lights\", transcends demographic and religious lines and is celebrated with great vigour. Dasara, a traditional celebratory hallmark of the old Kingdom of Mysuru is another important festival. Other traditional Indian festivals such as Ganesh Chaturthi, Ugadi, Sankranthi are also celebrated.\nEid ul-Fitr, Eid ul-Azha and Christmas are also reportedly celebrated by the Muslim and Christian population respectively.\nEntertainment\n– a theatre art is often played in town hall]]\nBangalore is home to the Kannada film industry which churns out about 100 movies each year and is the fifth largest movie industry in India, in terms of revenue. The Kannada Movie Industry has spawned a different colloquial type variety altogether, commonly referred to as Bangalore Kannada.\nBangalore is also known as the Ham Radio Capital of India because of the number of Amateur (Ham) Radio licence holders and their activities. Bangalore has nearly twenty Amateur (Ham) Radio Clubs and four VHF Repeaters. Bangalore Amateur Radio Club VU2ARC started in the year 1959 celebrating its Golden Jubilee – 50th Year.  Lions Clubs International Amateur (Ham) Radio Club VU2LCI has its base here.\nCuisine\non the roadside food joints, in Shivajinagar.]]\nin Bangalore.]]\nThe diversity of the cuisine available is reflective of the social and economic diversity of Bangalore. Roadside vendors, tea stalls, South Indian, North Indian, Arabic food, Chinese and Western fast food are all very popular in the city. Udupi restaurants, are very popular and serve predominantly vegetarian cuisine. The Chinese food and the Thai food served in most of the restaurants can be customised to cater to the tastes of the Indian population. Bangalore can also be called a foodie's paradise because of its vast variety of foods and edibles with a touch of Bangalore's uniqueness and tradition\nThe masala dose – rice pancake smeared with red chilli chutney and stuffed with potato curry, 'set dose' – 3 medium-sized doses, 'benne masalae' – thick rice pancake prepared with butter – are some of the local favourites and few stake the origin of these dishes from Bangalore. Bisi bele bath, Rava idli, Pongal, the spicy Uppittu – served as Khara Bath in most of the restaurants are some of the other local favourites. The Udipis or the South Indian restaurant/cafes are known for their Filter Coffee,\nThe Muslim cuisine of Bangalore is unique as it delivers an interesting blend of Mughlai cuisine, Hyderabadi Muslim or Nawabi cuisine, as it is called, with a distinct Bangalorean flavour. The MM Road in Fraser Town is renowned for its unique collection of around 5 to 6 Muslim restaurants, 3 to 4 Mughlai takeaways, a Chinese restaurant, a salad bar and 2 Arabian themed restaurants. The Chandni Chowk area of Shivajinagar also has a concentration of tightly packed restaurants and tea shops, where business booms behind closed shutters until the wee hours of daylight. The most favourite sought-after delicacies include the Tandoori Chicken, Bangalore Biriyani, Gundu Palav, Sheek kebabs, Sheek Rolls, Chicken kebabs, Rumali Rotis and lots more. Roadside stalls are abundant, giving a more dynamic and some would argue more risky option for sustenance, with typical dishes such as barbecued beef sheek kebab and a local Bangalore recipe Phaal, beef cubes in spicy green masala, served with hot Rice Sevian (Plain steamed Vermicelli). Fried Mutton Brains is also a really tasty choice for daring food-a-holics.\nArabian cuisine is also slowly on the rise with Shawarma and Falafel gathering some popularity although these hotels are usually frequented by Arab students and Indians who have lived in the Middle East.\nSome of the bakeries in Bangalore are also quite popular for a quick snack. There are many fruit juice stalls and shoppers often visit them. Bangalore also houses many sweet eateries too.\nBangalore also has some fine dining and specialised restaurants that cover various cuisines of the world. For good Mangalore and Konkan style seafood, there's Kudla, Mangalore Pearl and Sa-na-dige. The city also is known to have really good Italian and new-age continental food in places like Sunny's on Lavelle Road and Olive Beach. The various restaurants in the five-star hotels in the city also offer some very authentic and delicious meals.\nOne of the most famous places to visit with respect to cuisine is the VV.Puram Food Street. It serves a lot of Indian and Karnataka dishes as reasonable prices. It has attracted throngs of crowds of different social backgrounds who go local instead of the fine dining experiences the city has to offer.\nMusic\nBangalore is marked by many musical bards who have contributed significantly to both forms of Indian classical music, the Carnatic and Hindustani traditions. A home to many outstanding musicians, veterans and upcoming, Karnataka prides itself of renowned musical personalities like Purandara Dasa (the father of Carnatic music), Tyagraja, Kalakkad Subbiah Ramanarayanan Iyer, Dr Nithyasree Mahadevan, Gingger Shankar, Basavaraj Rajguru, and Gangubai Hangal.\nThe newfangled musicians of Karnataka have adapted a modernistic approach towards music and have flawlessly conflated different various genres to create progressive music, yet retaining the ethnic appeal. Some of the names worth mentioning are Lucky Ali, Jim Ankan Deka, Bapu Padmanabha, Pravin Godkhindi, Shimoga Subbanna, Mysore Ananthaswamy, P. Kalinga Rao, Bangalore Latha, G. V. Atri, C. Ashwath and Balappa Hukkeri. Internationally reputed Musicians who reside in Bangalore today are Mahesh Mahadev, Raghu Dixit, Priyadarshini, Praveen D Rao, Vijay Prakash, Sagar S, Ricky Kej and others.\nThe Bangalore music scene consists of a far cry of different genres, from international music to traditional folk songs. Janapadhas are the traditional folk songs in the historic culture of Karnataka. The vast number of different people living in Bangalore hailing from different places developed a distinct style of music. Kannada film music is heard playing in auto rickshaws, shops, and the streets. The party and the nightlife scenario experiences a different type of music, most popular international numbers varying in genres from Trance, Pop, Indi-pop, and Hip-Hop, Bollywood music is less dominant.\nThough Bangalore is a hub for both classical and contemporary music, the dominant music genre in urban Bangalore is rock music. All sub-genres of rock, varying from classic rock n' roll to extreme metal can be heard in Bangalore. The underground scenario in Bangalore is often acclaimed and hence lead to the city being called Rock/Metal capital of India. Rock 'n India, Freedom Jam is the pioneer made in Bangalore 'Woodstock' style annual festival offering different genres of live music regularly at various venues all over the city. The 22nd edition of this 'Free Music Festival' was held during the Independence weekend this August 2017. Sunday Jams, the monthly smaller versions, on the first Sunday of every month, have been going on too.[www.freedomjam.in & FB page.] Great Indian Rock, Deccan Rock and Summer Storm Festival are the primitive (?) rock festivals in India. GIR primarily a Delhi event organised by RSJ magazine is not heard of now while DR and SS are defunct. In early 2012, the Bangalore Open Air metal festival (powered by Wacken Open Air festival), to be headlined by Iced Earth and Kreator, and to be held on 16 June was announced. NH7, which ran for a few years seems to have abandoned the city.\nBangalore was also the first city in India where internationally popular rock groups Metallica, Iron Maiden, The Rolling Stones, Bryan Adams, Scorpions, Sting, Aerosmith, Elton John, Deep Purple among various other heavy metal groups performed live for the first time in India.\nHowever, after the Santana concert about seven years ago, there has hardly been any big international rock acts performing in the city. A few extreme metal or cult alternative acts have occasionally catered to a niche audience. In fact, EDM acts rule Bangalore's high priced concert scene while Bollywood music performed live is as popular as ever.\nperforming live in Bangalore]]\nList of international musicians who performed or will perform live in Bangalore :\n* Scorpions in 2001\n* Bryan Adams in 1994, 2001, 2004, 2006 and 2011\n* Deep Purple in 2001\n* Elton John in 2002\n* Roger Waters in 2002\n* The Rolling Stones in 2003\n* Mark Knopfler in 2005\n* Joe Satriani in 2005\n* Sting in 2005\n* Uriah Heep in 2006\n* Jethro Tull in 2006 and 2008\n* Iron Maiden in 2007 and 2009\n* Aerosmith in 2007\n* The Black Eyed Peas in 2007\n* Sepultura in 2007\n* Megadeth in 2008\n* Machine Head in 2008\n* Satyricon in 2008\n* Amon Amarth in 2009\n* Lauren Harris in 2009\n* Textures in 2009\n* Lamb of God in 2010 and 2012\n* Nervecell in 2010\n* Lacuna Coil in 2010\n* De Profundis in 2010\n* Flo Rida in 2010 and 2011\n* Meshuggah in 2010\n* Purified in Blood in 2010\n* Saving Abel in 2010\n* Backstreet Boys in 2010\n* Richard Marx in 2010\n* Prime Circle in 2010\n* Jayce Lewis in 2010\n* Sean Kingston in 2010\n* Akcent in 2010\n* Tesseract in 2010\n* Enslaved in 2010\n* The Prodigy in 2011\n* Akon in 2011\n* Jay Sean in 2011\n* Ludacris in 2011\n* Cradle of Filth in 2011\n* Metallica in 2011\n* Biffy Clyro in 2011\n* Poets of the Fall in 2011 and 2012 and 2015\n* Opeth in 2012\n* David Guetta in 2012\n* Fatboy Slim in 2012\n* Suidakra in 2012\n* Kreator in 2012\n* Korn in 2012\n* Slayer in 2012\n* Carlos Santana in 2012\n* Guns N' Roses in 2012\n* Sean Paul in 2012\n* Children of Bodom in 2012\n* Wolf in 2012\n* Behemoth in 2012\n* Swedish House Mafia in 2013\n* Tiësto in 2013\n* Hardwell in 2013\n* Avicii in 2012 & 2013\n* Above & Beyond in 2010, 2012 & 2013\n* Steve Aoki in 2013\n* Martin Garrix in 2016\n* Beth Hart in 2017\nMusic schools in Bangalore\nThe recent past has also seen a significant growth in the number of music institutes providing training for vocal and various instruments including guitar, piano, keyboard, veena, sitar, tabla, sitar, organ etc. in Carnatic, Hindustani classical, Popular music and Western music, especially in Bangalore city. PRISM Foundation, in Rajajinagar, The Bangalore School of Music in RT Nagar, Eastern Fare Music Foundation in Koramangala, Sumadhura Education and Cultural Trust in Vijaynagara, Shreepada Sangeeta Kala Kendra in Bannerghatta Road and World Music Centre in Malleswaram are some of the institutes who have successfully endorsed Music as a serious business or career option as opposed to its familiar perception as a pastime or hobby. Apart from the formal training, these institutes offer courses that enable learners to appear for many recognized certificate and diploma examinations.\nSport\nCricket is the most popular sport in Bangalore(it has its own IPL team RCB or Royal Challengers Bangalore and has a huge fan following) though it has lost some of its popularity in a small amount of time to football, basketball and tennis. English football clubs Manchester United, Liverpool F.C, and popular French club Paris Saint Germain have a large number of supporters in the city. Bengaluru FC is a football club based in Bangalore and was formed in 2013. The club, which originally participated in the I-League, now plays in the Indian Super League.\nSignificant numbers of India's national cricket team have come from Bangalore, including Gundappa Viswanath, Rahul Dravid, Venkatesh Prasad, Anil Kumble, Erapalli Prasanna, Robin Uthappa, B.S. Chandrashekar, Syed Kirmani, Brijesh Patel, Roger Binny, Sadanand Vishwanath, K. L. Rahul, Karun Nair and Vinay Kumar. Many of the city's children play Gully cricket and football on the roads and in the city's many public fields. Bangalore's main international cricket stadium is the M. Chinnaswamy Stadium, which hosted its first match in 1974 and was the venue for the India-Pakistan cricket quarter-final during World Cup 1996. International cricket was played at the Central College grounds before moving to the current venue.\nOther famous sportspersons from Bangalore include badminton player and former All England Badminton Championship winner Prakash Padukone, tennis player and 10-time Grand Slam winner Mahesh Bhupathi, cueist Pankaj Advani and athlete Ashwini Nachappa.\nEducation\nBangalore is home to some of the top colonial-era schools in India including Bishop Cottons Boys' and Girls' School, Baldwin's High School, Sophia High School, and St. Josephs. Some of the top international schools are also located in Bangalore including Mallya Aditi International School (otherwise known as Aditi), Indus International School, National Centre for Excellence and Stonehill Academy.\nBangalore is well known for the quality of education provided by various eminent institutes, every year it attracts aspiring candidate to this city. Few of the well known institutes are the Indian Institute of Science (IISc), National Law School of India University(NLSIU), Indian Institute of Management Bangalore (IIMB), National Institute of Design, R & D Campus (NID), National Institute of Fashion Technology (NIFT ), National Institute of Mental Health and Neurosciences (NIMHANS), Srishti Institute of Art design and technology, Bangalore University, Christ University and Jain University.RV college of Architecture\nSocial and Night life\nBangalore has an active night culture and is home to over 800 clubs and bars. Since the recent explosion of software companies in Bangalore, it has seen a rise in the number of western-style Malls, such as Phoenix MarketCity, Orion Mall, The Forum, Bangalore Central and The Garuda. These malls are evolving as the current \"hang-outs\" for the old, with trendy stores, restaurants and the latest crop of clubs.  Another change has been the gradual decline of single-screen cinemas and the increase of multiplex theatres, hosted by the same burgeoning malls. The BPO and IT boom have contributed to a lot of disposable income among the younger generation.\nEating out is another passion for Bangaloreans. The variety in terms of cuisines, types and themes that Bangalore restaurants offer is diverse and caters to every taste. Bangalorean's enjoy eating out so much that an actual event circling around restaurants called the Bangalore Restaurant Week was held between 12 and 21 November 2010.\nSee also\n* Bangalore\n* Bangalore Ganesh Utsava\n* Bangalore Kannada\n* Bangalori Urdu\n* Kannada\n* Karnataka\nReferences"
    }
  ]
}