{
  "content": [
    {
      "type": "text",
      "text": "# Culture of Croatia__disambig_1\n\n]]\nThe culture of Croatia has historically been influenced by Central European, Mediterranean, and Balkan cultures. Croatia's unique culture and identity can be traced back to the historical llyricum. The early Croatian cultural and political identity developed through the integration of the ancient Roman heritage of Dalmatia, the traditions of early Slavic groups who settled in the region during the Migration period, and the emergence of a distinct Croatian polity by the 9th century. The Croatian language is believed to have been formed in the 6th or 7th century, with the written language present in Glagolitic texts from the 11th century.\nIn terms of Croatian national emancipation, the 19th-century Illyrian movement led by Ljudevit Gaj was a key driver for emergence of Croatian romantic nationalism. In 1842, the Matica ilirska organization (renamed Matica hrvatska in 1872) was established as part of the Zagreb Reading Room. The organization's mission was to promote Croatian national and cultural identity in fields of arts, science spiritual creation, economy, and public life. In 1847-1848 Croatian language replaced Latin as official language in Croatia.\nCroatia has a place in the history of Mediterranean architecture and urbanism and clothing as place of origin of the cravat, a precursor of the modern necktie.\nModern and contemporary arts, music, urban, independent, and youth culture in Croatia have grown due to numerous festivals and frequent manifestations, as well as the re-emergence of new cultural infrastructure around the country.\nHistory\nPre-historic heritage\nAncient monuments from the Paleolithic era consist of simple stone and bone objects. Some of the earliest remaining historical features include 100,000-year-old bones of a Neandertal man on Krapina Neanderthal site, in Hrvatsko Zagorje..]] The most interesting Copper Age or Eneolithic findings are from Vučedol culture. Out of that culture, the Bronze Age Vinkovci culture (named after the city of Vinkovci) developed, which is recognizable by bronze fibulas that were replacing objects like needles and buttons.\nBronze Age culture of Illyrians, ethnic group with distinct culture and art form started to organize itself in 7th century BC. Numerous monumental sculptures are preserved, as well as walls of citadel, Nezakcij near Pula, one of numerous Istrian cities from Iron Age.\nAncient heritage\nDuring Greek colonisation period, Greeks from Syracuse arrived to islands of Vis (Issa), Hvar (Pharos), and Korčula (Corcyra Nigra) in 390 BC and founded their city-states on Adriatic parts of modern Croatia, where they lived quite isolated.\nWhile the Greek colonies were flourishing on the island, on the continent, the Illyrians were organizing their centers. Their art was greatly influenced by Greek art, and they have even copied some elements. Illyrians sometimes attacked Greek colonies on Dalmatian islands. One such example was queen Teuta of Ardiaei, whose pirating activities drew the attention of the Roman Republic to Eastern Adriatic Coast in 229 BC. After this initial contact, Rome gradually managed to subdue the Illyrians by the 1st century and Great Iliryan Revolt. These lands were in the meantime organized into Roman provinces of Ilyricum and subsequently Dalmatia and Pannonia, while Ilirians and other native tribes living in these areas gradually became romanized. (Salona), Croatia.]] The Romans organized the entire coastal territory by transforming citadels to urban cities. There have been at least thirty cities in Istria, Liburnia and Dalmatia with Roman citizenship (civitas). The best-preserved networks of Roman streets (decumanus/cardo) are those in Epetion (Poreč) and Jader (Zadar). The best preserved Roman monuments are in Pola (Pula) including an Amphitheater (an arena) from the 2nd century.\nIn the 3rd century AD, the city of Salona was the largest (with 40,000 inhabitants) and most important city of Dalmatia. Near the city, emperor Diocletian, born in Salona, built Diocletian's Palace (around year 300 AD), which is the largest and most important monument of late antique architecture in the World. In the 4th century, Salona became the center of Christianity for entire western Balkans. It had numerous basilicas and necropolises, and even two saints: Domnius (Duje) and Anastasius (Staš).\nOne of few preserved basilicas in western Europe (beside ones in Ravenna) from the time of early Byzantium is Euphrasian Basilica in Poreč from the 6th century.\nMedieval heritage\nin Solin is thought to most likely depict a King of Croatia, probably Petar Krešimir IV or Demetrius Zvonimir. Above the sculpture, Croatian interlace can also be seen, which is a common feature of Croatian pre-romanesque art.|left]]The early Middle Ages brought the great migration of the Slavs and this period was perhaps a Dark Age in the cultural sense until the successful formation of the Slavic states which coexisted with Italic cities that remained on the coast, each of them were modelled like Venice.\nIn the 7th century the Croats, along with other Slavs and Avars, migrated from Eastern Europe to the area of Dalmatian hinterland. Here, the Croats came into contact with Roman art, culture, and most of all with Christianity. Before adopting Christianity Croats used to worship Slavic paganism, traces of which can be found on certain toponyms in Croatia, named after Slavic gods Perun and Veles. Some of these are located near Podstrana and on Učka mountain. Nevertheless, in first few centuries after their arrival, Croats converted to Christianity which had spread from old Roman cities in Dalmatia and from Frankish missionaries. In following centuries both Latin language, Church Slavonic and Glagolitic script were in use in Church liturgy among Croats, while pre-Romanesque period is considered foundational period of Croatian medieval culture. The monuments created in this period are associated with arrival of Benedictine monks to Croatia, who first came from Frankish monasteries and subsequently from Monte Cassino. In later periods, the new monasteries were mostly founded by local monks. The first benedictine monastery in Dalmatia was constructed during the reign of 9th century duke Trpimir in Rižinice between modern day Solin and Klis.\nIn later period the rule of duke Branimir, in particular, is considered as a time of \"cultural blossom\" of Croatia due to construction of new churches, reconstruction of already existing churches, as well as five stone inscriptions mentioning Branimir's name which remain preserved until this day.\nIn second half of 10th century, Croatian queen Helen of Zadar, built a royal mausoleum in church of St. Stephen on the Island in what is today Solin.\nfrom the 11th century, written in the Croatian language and Glagolitic script.]]\nAnother period of cultural blossom of Croatian kingdom came with the rule of 11th century king Demetruis Zvonimir. Since his rule was relatively stable, he donated many churches and monasteries. The most famous of his donations is recorded in Baška tablet, 11th century inscription written in Glagolitic script and Croatian language. It was discovered in village of Baška, on the island of Krk. It represents the earliest mention of Croatian royal name and royal title in Croatian language (Zvonimir, kralj hrvatski) for which it has a great significance in study of Croatian language. Original documents issued by Croatian medieval rulers were also written in Latin language and in either Beneventan, Carolingian minuscule or Gothic minuscule script. During the 13th century Croatian provost Dobroslav launched the construction of a romanesque Knin cathedral on a site of the earlier Benedictine monastery in Kapitul near Knin. Upon completion the cathedral became a seat of Knin bishop (previously Croatian bishop) until Ottoman invasions forced high clergy to move their seats elsewhere. During the archeological excavations in the 19th century, this site became a place where ornaments from Trpimirović dynasty were recovered.\nRenaissance heritage\nThe Renaissance period among Croats was influenced by wars against expanding Ottoman Empire, which slowed down Croatian cultural development. The downfall of the homeland left impression on Croatian writers, who expressed their mood in their oeuvres. Some examples of this are Petar Zoranić in his novel Planine (English: \"The Mountains\"), Šimun Kožičić Benja in his publication De Corvatiae desolatione (English: \"On the desolation of Croatia\"), Marko Marulić in his Molitva suprotiva Turkom (\"A Prayer Against the Turks\") or Brne Karnarutić's Vazetje Sigeta grada (English: \"The Taking of the City of Siget\"). Some other artists known for their works in Croatian lands at a time include sculptor Giorgio da Sebenico (known in Croatian as Juraj Dalmatinac), best known for his works on renaissance Šibenik Cathedral, or perhaps Giulio Clovo (known in Croatian as Julije Klović) who is best known for his miniature paintings.\nEnlightenment heritage\nThe enlightenment period of Croatian history correlates with enlightened despotism rule of empress Maria Theresa and emperor Joseph II. Some of the literary works of Croatian enlightenment period authors are Satir iliti divlji čovik (\"Satyr or the wild man\") by Matija Antun Relković, Matijaš grabancijaš dijak by Tituš Brezovački, Razgovor ugodni naroda slovinskog (\"Pleasant Conversation of Slavic People\") by Andrija Kačić Miošić as well as those of Baltazar Adam Krčelić, Matija Petar Katančić or Antun Kanižlić.\nFine arts\nSculpture\nThe altar enclosure and windows of early medieval churches were highly decorated with a transparent shallow string-like ornament that is called Croatian interlace because the strings were threaded and rethreaded through themselves. Sometimes the engravings in early Croatian script–Glagolitic appear. Soon, the Glagolitic writings were replaced with Latin ones on altar boundaries and architraves of old-Croatian churches.\nby sculptor Radovan, c. 1240]]\nIn Croatian Romanesque sculpture, we have a transformation from decorative interlace relief (Croatian interlace) to figurative relief. The best examples of Romanesque sculpture are: the wooden doors of the Split cathedral made by Andrija Buvina (c. 1220) and the stone portal of the Trogir cathedral by the artisan Radovan (c. 1240).\nZadar was an independent Venetian city. The most beautiful examples of Gothic humanism in Zadar represent reliefs in gilded metal on Chest of St Simeon, made by artisans from Milan in around 1380.\nMost Croatian prominent sculptors of modern include Ivan Meštrović, Antun Augustinčić, Frano Kršinić and others.\nPainting\nGothic painting is less well-preserved, and the finest works are in Istria such as the fresco-cycle of Vincent from Kastav in the Church of Holy Mary in Škriljinah near Beram, from 1474. From that time are two of the best and most decorated illuminated liturgical books made by monks from Split, Hvals’ Zbornik (today in Zagreb) and the Missal of the Bosnian Duke Hrvoje Vukčić Hrvatinić (now in Istanbul).\nThe most prominent painter from Croatia was Federiko Benković who worked almost his entire life in Italy, while an Italian, Francesco Robba, did the best Baroque sculptures in Croatia.\nIn Austrian countries at the beginning of the 19th century the Romantic movement in Croatia was sentimental, gentle and subtle.  Vlaho Bukovac brought the spirit of impressionism from Paris, and he strongly influenced the young artists (including the authors of \"Golden Hall\"). On the Millennium Exhibition in Budapest they were able to set aside all other artistic options in Austro-Hungary.\n(1910) Modern Gallery, Zagreb]]\nModern art in Croatia began with the Secession ideas spreading from Vienna and Munich, and post-Impressionism from Paris. Young artists would study the latest trends and integrate them into their own work. Many strove to bring a native cultural identity into their art, for example themes of national history and legends, and some of the artwork during and following the First World War contained a strong political message against the ruling Austro-Hungarian state. As Croatian lands joined the Kingdom of Yugoslavia after the war, a change was noticeable in 1919 with a move to flatter forms, and signs of cubism and expressionism were evident. In the 1920s, the Earth Group sought to reflect reality and social issues in their art, a movement that also saw the development of naive art. By the 1930s there was a return to more simple, classical styles.\nFollowing the Second World War, artists everywhere were searching for meaning and identity, leading to abstract expressionism in the U.S. and art informel in Europe. The early split with the rest of the Eastern Bloc in the new Socialist Yugoslavia which Croatia was a constituent republic of allowed for greater artistic freedom, with socialist realism style never truly taking hold. Bauhaus ideas led to geometric abstraction in paintings and simplified spaces in architecture. In the 1960s, non-conventional forms of visual expression took hold along with a more analytical approach to art, and a move towards new media, such as photography, video, computer art, performance art and installations, focusing more on the artists' process. Art of the 1970s was more conceptual, figurative and expressionist. However, the 1980s brought a return to more traditional painting and images.\nArchitecture\nin Zagreb, the capital of Croatia, the 14th century interior]]\nThe oldest preserved examples of architecture in Croatia are the 9th century churches, with the largest and the most representative among them being Donatus of Zadar and Church of Holy Trinity, Split. Some of the first churches build by the Croats were royal sanctuaries, and the influences of Roman art were the strongest in Dalmatia where urbanization was most dense, and there were the largest number of monuments.\nAlong the coast, the architecture is Mediterranean with a strong influence of renaissance architecture in major urban areas best exemplified in works of Venetian Giorgio da Sebenico and Niccolò di Giovanni Fiorentino.\nArchitecture in Croatia reflects influences of bordering nations. Austrian and Hungarian influence is visible in public spaces and buildings in the north and in the central regions. Large squares named after culture heroes, well-groomed parks, and pedestrian-only zones, are features of these orderly towns and cities, especially where large scale Baroque urban planning took place, for instance in Varaždin and Karlovac. Subsequent influence of the Art Nouveau was reflected in contemporary architecture.\nDesign\nA group of painters and architects that set the foundations of Croatian modern design was called Exat 51 (Experimental atelier). It existed in Croatian capital Zagreb between 1950 and 1956 and it consisted of architects: Bernardo Bernardi, Zdravko Bregovac, Zvonimir Radić, Božidar Rašica, Vjenceslav Richter, Vladimir Zarahović as well as painters: Vlado Kristl, Ivan Picelj and Aleksandar Srnec. Exat 51 advocated: abstract art, contemporary visual communications and synthesis of all forms of artistic creativity. It's work influenced Croatian culture, art and even social relations. Out of forementioned Exat 51 members; Bernardo Bernardi is considered one of the greatest Croatian designers and an award awarded by Association of Croatian architects for design and decoration of the interior bears his name.\nBy 1970's and 1980's as country became industrialised, its industry increasingly relied on its house design departments. However, as Croatia became ravaged by Croatian War of Independence and badly done privatization in the 1990's, Croatian design stagnated until the turn of the century. That's when new generation of designers designed new products which found their way on the international markets.\nMusic and Performing arts\nMusic\nJosipa Lisac.]]\nMusic in Croatia has two major influences: Central European, present in the central and northern parts of the country including Slavonia, and Mediterranean, particularly present in the coastal regions of Dalmatia and Istria.\nIn Croatia, both pop and rock are popular, and often incorporates Dalmatian or Slavonian folk elements. Since the mid-20th century, schlagers and chanson-inspired music have formed the backbone of the Croatian popular music. During 1990's marked by Croatian War of Independence; Cro dance, or Cro trash music dominated in Croatian nightclubs. In recent times, the most popular music genre (especially among young Croatians) became Turbo folk. According to the 2018 sociological research conducted on high school students in six Croatian cities, the most common consumers of Turbo folk are students with right wing leaning and conservative values. It is more popular among females as well as among those enrolled in lower level educational programs.\nTraditional humorous folk song of eastern Croatian region of Slavonia is called bećarac. It was recorded for the first time in 18th century by Croatian Enlightment author Matija Antun Relković. Since 2011, it is listed on UNESCO Intangible Cultural Heritage List.\nPorin is Croatian music award, named after Vatroslav Lisinski's opera of the same name and inspired by an American Grammy award. It has been awarded each year since 1994. Croatian national television usually also organizes national song contest – Dora, whose winner represents Croatia on Eurovision. This contest was named after Croatian first, distinguished female composer Dora Pejačević.\nTheatre\nCroatian National Theatre}}\nCroatian theatre dates back at least as far as the Middle Ages, with a combination of religious liturgical dramas, and secular performances of travelling entertainers. During the Renaissance, there was a flowering of dramatic writing and performances in Dalmatia, especially in Dubrovnik and on the island of Hvar. Notable playwrights of the time were Marin Držić and Hanibal Lucić.]]In other parts of Croatia, theatres started to appear in the late 18th, early 19th century in cities such as Split, Dubrovnik, Šibenik, Zadar, Osijek, Varaždin, Pula, Rijeka, and Zagreb. The development of a Croatian National Theatre evolved from Zagreb's first city theatre on St Mark's Square. Beginning in the 1860s, performances were increasingly written and given in Croatian.\nToday, Croatia boasts a strong tradition of theatres and theatrical companies all round the country. Performances range from dramas and musicals for adults or children, youth theatre and puppet theatre. Croatia is also home to the world's oldest Theatre of the Blind. Festivals are held in several locations in the summer.\nLiterature\nmost known for her popular children's novel The Marvellous Adventures of Lapich the Apprentice (Croatian: Čudnovate zgode šegrta Hlapića)]]\nThe first known printing shop in Croatia was founded in late 15th century in Kosinj under financial support of Croatian magnate Ivan VIII  Frankopan of Brinje, while its first known press operator was Ambroz Kacitić of Kolunić tribe. The oldest printed book in Croatian language is 1483 Missale Romanum Glagolitice (Misal po zakonu rimskog dvora), likey also printed in Kosinj. It was printed in Glagolitic script. It is the oldest European missale printed in non-Latin language and in non-Latin script. Other examples of Croatian incunabulae written on Glagolitic script could include: Missale of Senj (Senjski misal) from 1494 or General Confessions (Spovid općena) from 1496. The latter two were printed by a Glagolitic printing shop of Senj (Senjska glagoljska tiskara), which operated between 1494 and 1508.\nSome of Croatian book fairs incluce Interliber held annually on Zagreb Fair (Velesajam) in November or Book Fair in Istria (Sa(n)jam knjige u Istri) held annually in Pula.  According to a research conducted in 2022 among Croatians, the number of Croatians who read books is in decline. Among Croatian readers, 70% are highly educated. People living near Zagreb make 52% of Croatian readers, while 48% are females.\nMedia\nCinema\nis held each year during summer. Its main stage is  Roman amphitheatre in Pula.]]\nFirst Croatian production company was called \"Croatia\" and in 1917, this company produced first Croatian feature film called Brcko in Zagreb. This film, as well as all other films made in Zagreb in interwar period are lost to this day. First film screening in Zagreb was held on 8 October 1896, when Lumiere brothers films were shown.\nFrom 1960's to 1990's Croatian production company Jadran Film became one of the largest film producers in Central Europe, for which it was called \"Croatian Hollywood\". Some of well known international movie productions filmed in Croatia in that time were: Austerlitz, The Valley of Death, Death Train etc. However, Croatian War of Independence, and subsequent bad privatization led to company's downfall, as Croatia lost the competitive advantage it had over other socialist block countries during Cold War. The sixties in particular are known as a \"golden age\" of film in Croatia.\nIn 1989/1990 and 1999/2000 One Song a Day Takes Mischief Away was proclaimed as best Croatian feature film of all time. However, in 2020, a 1958 movie H-8 was proclaimed as best Croatian feature film of all time. The same election proclaimed Oscar winning Surogat as best Croatian animated film of all time, while Od 3 do 22 was proclaimed the best Croatian documentary film of all times. Since 1992, Croatian society of film critics gives annual award \"Okatavijan\", named after Croatian film pioneer Oktavijan Miletić.\nModern film production in Croatia is subsidized by Croatian Audiovisual Center (HAVC). Some of the well known film festivals held in Croatia are: Pula Film Festival, Zagreb Film Festival, Vukovar Film Festival, Motovun Film Festival, Animafest Zagreb or ZagrebDox.\nIn recent years, indie cinemas of Zagreb started closing down. Out of 24 indie cinemas which used to operate in Zagreb, only 6 remained opened by 2018. First multiplex cinema in Croatia was opened in 2003 by German company CineStar. During summer period in Zagreb, outdoor cinema in Tuškanac forest is open. This cinema was originally opened back in 1954. After it was shut down for several decades after 1970, it was again refurbished and reopened in 2012.\nTelevision\nTelevision in Croatia was first introduced in 1956. As of 2012 there are 10 nationwide and 21 regional DVB-T (Digital Video Broadcasting – Terrestrial) television channels, and more than 30 other channels either produced in the Republic of Croatia or produced for the Croatian market and broadcast via IPTV (Internet Protocol television), cable or satellite television. The electronic communications market in Croatia is regulated by the Croatian Regulatory Authority for Network Industries (HAKOM), which issues broadcast licenses and monitors the market. The DVB-T and satellite transmission infrastructure is developed and maintained by the state-owned company Odašiljači i veze (OiV).\n(HRT) building in Zagreb neighbourhood of Prisavlje.]]\nThe first television signal broadcast in Croatia occurred in 1939 during the Zagreb Fair, where Philips showcased its television system. The first regular broadcasts started in 1956, when Television Zagreb was established as the first TV station in the Yugoslav Radio Television system. Color broadcasts began in 1972. Coverage and number of channels grew steadily, and by the 2000s there were four channels with nationwide coverage in Croatia. DVB-T signal broadcasts began in 2002, and in 2010 a full digital switchover was completed. During that period the IPTV, cable and satellite television markets grew considerably, and by 2011 only 60.7 percent of households received DVB-T television only; the remainder were subscribed to IPTV, cable and satellite TV in addition, or as the sole source of TV reception. As of January 2012 DVB-T is broadcast in three multiplexes, while the territory of Croatia is divided into nine main allotment regions and smaller local allotments corresponding to major cities. High-definition television (HDTV) is broadcast only through IPTV, although HDTV DVB-T test programming was broadcast from 2007 to 2011. A DVB-T2 test broadcast was conducted in 2011.\nAs of November 2019 all national channels are transmitted via three DVB-T and one DVB-T2 (HEVC/H.265) MUXes. After June 2020 DVB-T MUXes will be switched off and all channels will be distributed via two DVB-T2 (HEVC/H.265) MUXes.\nTelevision in Croatia, as all other media in the country are criticised for lack of balance of global issues and trends on one hand and national topics covered on the other. All major television networks in Croatia are generally thought to be under excessive influence of commercialism. State owned Croatian Radiotelevision is required to produce and broadcast educational programmes, documentaries, and programmes aimed at the diaspora and national minorities in Croatia. The television in Croatia is considered to be important in avenue for non-governmental organizations communicating their concerns to the public and to criticising the authorities. Television is the primary source of information for 57% of the population of Croatia.\n* Croatian radiotelevision\nRadio\nCroatian Radio () is the official broadcasting service of Croatia. Founded on 15 May 1926 as Zagreb Radio, it was the first radio station in Southeast Europe, now part of Croatian Radiotelevision.\nThe broadcast, which began with just one channel that could be listened to only in Zagreb and northern Croatia, today makes 16 radio channels sent out on short wave, medium wave, FM, satellite and the Internet.\nOn 25 May 2012, the television and radio program archive and a collection of music production were given the status of Croatia's cultural heritage.\n* List of radio stations in Croatia\n* List of Croatian language television channels\nVideo games\nSome video games created by Croatian developers include: Serious Sam franchise, Talos Principle, Gas Guzzlers Extreme, Doodle Jump, I Hate Running Backwards, SEUM: Speedrunners from Hell, Inked, The Ward, etc. According to 2023 research results published in Croatian daily Jutarnji list; 92% of Croatian citizens play video games.\nEducation\n, 1396, Croatia's oldest university]]\nPeople in Croatia enjoy free government-sponsored education at the primary and secondary level, and partially free university education. There are over 800 primary schools and over 400 secondary schools in the country.\nThe higher education is also government-sponsored, and mostly free for students who enroll with better results. There are thirty two various polytechnic schools, as well as seven universities in seven larger cities: Zagreb, Split, Rijeka, Osijek, Zadar, Dubrovnik, and Pula. Each of the universities in Croatia is composed of many independent \"faculties\" (Croatian fakultet, meaning college or department), which focus on specific areas of learning: Natural Sciences, Philosophy, Law, Engineering, Economy, Architecture, Medicine, and so on.\nThere are also a number of other educational and scientific institutions, such as institutes (most notably the Ruđer Bošković Institute) or the Croatian Academy of Sciences and Arts, a learned society promoting language, culture, and science from its first conception in 1866.\nThe Roman Catholic Church was instrumental in the founding of many educational facilities in Croatia. One such example is University of Zagreb which traces its roots back to the 1669 Academy founded by the Jesuits. The Catholic Church in Croatia continues to maintain numerous seminaries and theological faculties in the country, as well as the Pontifical Croatian College of St. Jerome for Croatian students in Rome.\nPhilosophy\nBetween 1964 and 1974 Praxis School of Marxist philosophy used to exist inside Socialist Republic of Croatia as well as wider Socialist Yugoslavia. During its existence, the movement organized a Summer school on island of Korčula.\nPlaces\nCategory II (National Park)]]\nThe UNESCO has marked seven places in Croatia as World Heritage Sites:\n* Episcopal complex of the Euphrasian Basilica in the historic center of Poreč\n* The cathedral of St. James in Šibenik\n* Historic city of Trogir\n* Diocletian's Palace, built by Roman Emperor Diocletian\n* Old city of Dubrovnik\n* Plitvice Lakes\n* Stari Grad Plain on the Adriatic island of Hvar, parceled by Ancient Greece\nRegarding conservation and natural beauty, Croatia has eight national parks, mostly situated along the Adriatic coast.\nFashion\n.]]\nAccording to Dubravka Prpić Znaor, main editor of ItGirl.hr magazine, modern Croatians do not have its own unique dressing style, but instead combine elements of Italian, American, Japanese and French style. According global survey results published by US news, Croatia is 45th most fashionable country in the world.\nFestivities and traditions\n]]Some of the festivities held in Croatia include:\n* Sinjska alka – held in memory of victory Siege of Sinj in 1715\n* Koprivnica Renaissance Festival\n* Špancirfest in Varaždin\n* Dubrovnik Summer Festival\n* Đakovački vezovi\n* Neretva Boat Marathon\n* Music Biennale Zagreb\n* Vinkovačke jeseni\n* Rijeka Carnival\n* Samobor fašnik (Samobor Carnival)\n* Rapska fjera\n* Chivalry Tournament of Franjo Tahy in Donja Stubica (VIteški turnir Franje Tahija)\n* Susreti za Rudija – the annual airshow in Gornja Stubica, held in memory of Rudolf Perešin\n* Večernjakova ruža (Rose of Večernji list) – Croatia's oldest and most prestigious media award\n* Varaždin Baroque Evenings\n* Victory and Homeland Thanksgiving Day and the Day of Croatian Defenders\n* Vukovar and Škabrnja Remembrance Day\n* Vladimir Nazor Award – an annual award given by Croatian Ministry of Culture and Media for best artistic achievements in: literature, music, architecture, film, theatre and visual and applied arts\n* Zagreb Classic – festival of classical music on King Tomislav Square in Zagreb\nFood and drink\nCuisine\nof Samobor]]\nCroatian cuisine is heterogeneous, and is therefore known as \"the cuisine of regions\". Its modern roots date back to proto-Slavic and ancient periods and the differences in the selection of foodstuffs and forms of cooking are most notable between those on the mainland and those in coastal regions. Mainland cuisine is more characterized by the earlier proto-Slavic and the more recent contacts with the more famous gastronomic orders of today, Hungarian, Viennese and Turkish, while the coastal region bears the influences of the Greek, Roman and Illyrian, as well as of the later Mediterranean cuisine, including Italian and French.\nA large body of books bears witness to the high level of gastronomic culture in Croatia, which in European terms dealt with food in the distant past, such as the Gazophylacium by Belostenec, a Latin-Kajkavian dictionary dating from 1740 that preceded a similar French dictionary. There is also Beletristic literature by Marulić, Hektorović, Držić and other writers, down to the work written by Ivan Bierling in 1813 containing recipes for the preparation of 554 various dishes (translated from the German original), and which is considered to be the first Croatian cookbook.\nWine\n.]]\nCroatian wine (, pl. ) has a history dating back to the Ancient Greek settlers, and their wine production on the southern Dalmatian islands of Vis, Hvar and Korčula some 2,500 years ago. If they want to socialise with someone, they invite this person for a coffee. This is the reason why in Croatian towns coffee bar terraces can always be seen crawling with locals drinking their cappuccino and hanging out. Average coffee drinking time among Croatians tends to extend to between 40 and 45 minutes. According to the research done by Gfk Agency, 80% of Croatians older than 15 drink coffee on a daily basis. During the COVID-19 pandemic, 44% of Croatian citizens reported that they miss drinking coffee in their caffe bars. Among Dalmatians, 65% reported that the first thing they will do when the lockdown ends is go to their coffee bar and order coffee. In Croatian culture, the person who invites for a coffee usually pays the bill. Exception is if another person wants to make a nice gesture and pays instead.\nCroatian domestic animals\n* Croatian Sheepdog\n* Dalmatian dog\n* Istrian Shorthaired Hound\n* Hrvatica chicken\n* Posavac (horse)\nSports\nduring Croatia's biggest football derby between Hajduk Split and Dinamo Zagreb. |200x200px]]\nSince independence Croatia has been a fairly successful sporting country. The most popular team sports have been association football (soccer). In 2022 Croatian Football Federation () had between 130,000 and 130,000 registered players, and making it the largest sporting association in the country. According to a research conducted by CIES Football Observatory in 2017, Croatia was the single largest exporter of football players per capita, in the world. It was also ranked eight globally by the number of football players who play abroad. Since its existence, Croatian male national football team achieved notable results on worldwide scale by winning 3rd place in FIFA 1998 World Cup, 2nd place in FIFA 2018 World Cup and 3rd place in FIFA 2022 World Cup.\nCroatian male handball team also achieved some notable  successes by winning gold medal on summer Olympics in 1996 and 2004, gold medal on 2003 World Championship and silver medal on 2008, 2010 and 2020 European Championship.\n.]]\nOther popular sports are basketball and to some extent water polo. The most popular sports played mainly by individuals are tennis, skiing, swimming, and to some extent table tennis and chess. The nation's arenas are primarily used for handball and basketball games.\nSome notable Croatian martial artists include Mirko \"Cro Cop\" Filipović, Željko Mavrović, Mate Parlov, Branko Cikatić, Ana Zaninović, Lucija Zaninović, Ivana Habazin and Maša Martinović.\nA female member of Illyrian movement Dragojla Jarnević is generally considered to be a founder of mountaineering in Croatia, as she climbed the steep rocks of Okić in 1843. In modern period, one of the most prominent Croatian mountaneers is Stipe Božić.\nSee also\n* [https://ich.unesco.org/en/state/croatia-HR?info=elements-on-the-lists Croatia – intangible heritage – Culture Sector]\n* List of museums in Croatia\n* Natural and Cultural Heritage of Croatia\n* Public holidays in Croatia\n* Register of Cultural Goods of Croatia\nReferences\nExternal links\n* [https://min-kulture.gov.hr/en Republic of Croatia Ministry of Culture and Media]\n* [https://web.archive.org/web/20110725203821/http://www.croatianculture.org/ Croatian Cultural Center of Greater Los Angeles]\n* [https://web.archive.org/web/20160430161047/http://www.kultura.hr/eng Croatian Cultural]\n* [http://www.croatianmonuments.org/ International Trust for Croatian Monuments]\nHeritage – digital collection of Croatian cultural heritage]\n*Arts and literature\n** [https://web.archive.org/web/20070613233655/http://www.culturenet.hr/v1/english/panorama.asp?id=54 Prehistory art in Croatia]\n** [https://web.archive.org/web/20080331024555/http://www.culturenet.hr/v1/english/panorama.asp?id=55 Antiquity in Croatia]\n** [http://www.mythinglinks.org/euro~east~Balkans~Croatia.html Croatian Culture Links]\n** [https://web.archive.org/web/20040216061808/http://www.early-croatian-art.net/Predromanika/index/first.asp Preromanesque art of coastal Croatia]\n** [https://web.archive.org/web/20040404191332/http://www.settlement.org/cp/english/croatia/arts.html Croatia Arts and Literature]\n** [http://www.croatianhistory.net/etf/art.html Croatian cultural heritage]\n** [http://www.ffzg.hr/infoz/dzs/popis.htm Online library of major Croatian literary works from Renaissance to Modernism. In Croatian only]\n*Education\n** [https://web.archive.org/web/20040203211300/http://www.mzt.hr/mzt/eng/activities/science/science.htm Ministry of Science: the list of institutes and general survey]\n** [https://web.archive.org/web/20040405181933/http://www.mzt.hr/mzt/eng/activities/highedu/higher.htm Higher Education: Complete directory of higher education institutes in Croatia]\n*History\n** Museum of Croatian Archaeological Monuments [http://www.mhas-split.hr/ home page]\n** [http://www.ief.hr/ Institute for Ethnology and Folklore]\n** [https://web.archive.org/web/20040407045538/http://www.lado.hr/lado.htm Lado National Folklore Ansamble]\n** [http://www.cosy.sbg.ac.at/~zzspri/lifestories/Cravatte/Cravatte.html The History of Necktie]\n*Nature Protection\n** [http://www.dzzp.hr State Institute for Nature Protection – Croatia]"
    }
  ]
}