{
  "content": [
    {
      "type": "text",
      "text": "# Culture of Burkina Faso\n\nThe culture of Burkina Faso in West Africa is also called the Burkinabé culture.\nTwo key elements of culture in Burkina Faso (a country once known as Upper Volta) are its indigenous masks and dancing. The masks used in this region of the western Sahel are made for rites of sacrifice to gods and animal spirits in the villages. Native dance, on the other hand, is employed to demonstrate the villagers' desire for blessings by the spirits.\nLiterature\nLiterature in Burkina Faso is based on the oral tradition, which remains important. In 1934, during French occupation, Dim-Dolobsom Ouedraogo published his Maximes, pensées et devinettes mossi (Maximes, Thoughts and Riddles of the Mossi), a record of the oral history of the Mossi people. The oral tradition continued to have an influence on Burkinabé writers in the post-independence Burkina Faso of the 1960s, such as Nazi Boni and Roger Nikiema. The 1960s saw a growth in the number of playwrights being published. Since the 1970s, literature has developed in Burkina Faso with many more writers being published.\nSlam poetry is becoming increasingly popular in the country, in part through the work of Malika Ouattara.\nTheatre\nTheatre of Burkina Faso combines traditional Burkinabé performance with the colonial influences and post-colonial efforts to educate rural people to produce a distinctive national theatre.\nCuisine\nCuisine of Burkina Faso, typically of west African cuisine, is based around staple foods of sorghum, millet, rice, maize, peanuts, potatoes, beans, yams and okra.\nMedia\nArt\ns in Ouagadougou.]]\nIn addition to several rich traditional artistic heritages among the various peoples, there is also a large artist community in Burkina Faso, especially in Ouagadougou.  Much of the crafts produced are for the growing tourist industry. Tigoung Nonma was set up by a group of disabled artisans and sells crafts to provide a sustainable income for disabled artisans in Burkina Faso.\nCinema\nThe Popular Theatre in Ouagadougou, the capital of Burkina Faso, is a center of social and cultural events for the country. Ouagadougou, is a major hub of activity for those involved in African cinema, and hosts a Pan-African film festival every year called FESPACO, the Pan-African film and television Festival of Ouagadougou, which is a world-renowned affair. Culture and art are further displayed at Laongo, an area of exposed granites where artists from the entire world are invited to sculpt on the rock. Idrissa Ouedraogo is from Burkina Faso.\nMusic\nReligion\nWhile exact statistics on religion in Burkina Faso are not available and vary widely, the Government of Burkina Faso estimated in its most recent census (1996) that approximately 60 percent of the population practice Islam, and that the majority of this group belong to the Sunni branch, while remaining minorities adhere to the Shi'a branch, and significant numbers of Sunni Muslims identify with the Tijaniyah Sufi, or Salafi traditions. Ahmadiyya Islam also has a large following. The Government also estimated that 24 percent of the population maintains traditional indigenous beliefs, 17 percent practices Roman Catholicism, and 3 percent are members of various Protestant denominations.\nHolidays\n{| class=\"wikitable\" style=\"float: center;\"\n|+Holidays\n|-\n! style=\"font-size: smaller;\" | Date\n! style=\"font-size: smaller;\" | English Name\n|-\n| January 1\n| New Year's Day\n|-\n| January 3\n| Anniversary of the 1966 Coup d'État\n|-\n| March 8\n| International Women's Day\n|-\n| May 1\n| Labour Day\n|-\n| August 4\n| Revolution Day\n|-\n| August 5\n| Independence Day\n|-\n| August 15\n| Assumption\n|-\n| October 15\n| Anniversary of the 1987 coup d’état\n|-\n| November 1\n| All Saints' Day\n|-\n| December 11\n| Proclamation of the Republic\n|-\n| December 25\n| Christmas\n|}\nReferences\nExternal links\n*[http://libmma.contentdm.oclc.org/cdm/compoundobject/collection/p15324coll10/id/42448/rec/1 Art and oracle: African art and rituals of divination], an exhibition catalog from The Metropolitan Museum of Art (fully available online as PDF), which contains material on art from Burkina Faso"
    }
  ]
}