{
  "content": [
    {
      "type": "text",
      "text": "# Culture in Aberdeen\n\n]]\n]]\n]]\n]]\nThe city of Aberdeen in Scotland has amenities that cover a wide range of cultural activities, including a selection of museums and galleries. There are festivals and theatrical events throughout the year.\nNotable attractions\n*Aberdeen Art Gallery\n*[http://www.ghat-art.org.uk/ Grampian Hospitals Arts Trust]\n*Aberdeen Central Library &ndash; containing more than 60,000 volumes.\n*Aberdeen Maritime Museum\n*The Belmont Cinema\n*Cineworld Cinema (formerly a Virgin Cinema then a UGC Cinema)\n*Codonas Amusement Park, Sunset Boulevard & Miami Beach\n*Doonies Farm\n*The Gordon Highlanders Museum\n*His Majesty's Theatre\n*James Dun's House\n*King's College\n*The Lemon Tree\n*Marischal Museum at Marischal College\n*The Museum of Education Victorian Classroom\n*Peacock visual arts\n*Provost Ross's House (contains the Aberdeen Maritime Museum)\n*Provost Skene's House\n*Satrosphere Science Museum\n*Storybook Glen\n*The Tolbooth Museum at the Town House\n*Transition Extreme a £3 million project which contains a skate park and a climbing wall.\n*Vue Cinema (formerly The Lighthouse Cinema then an ABC Cinema)\nTheatre\nAberdeen has a thriving theatre scene with the largest theatrical events being held in His Majesty's Theatre. The smaller Aberdeen Arts Centre is a voluntary run theatre that normally caters for local events, often those held in the name of charity. The Lemon Tree is another small theatre that has small theatrical programmes such as pantomimes at Christmas and small charity events.\nArt\nAberdeen gained prominence in the art world by introducing Scottish art to the rest of Britain and the world through the works of George Jamesone. Jamesone's achievements provided the opportunity for other Scottish artists to follow in his footsteps and make their art available throughout Scotland, and the rest of the world. In 1884 a neo-Classical building was built for the purpose of displaying the world's finest art; subsequently this was called the Aberdeen Art Gallery. Within this Gallery the impressive permanent painting collection of Damien Hirst, Ian Hamilton Finlay, Francis Bacon, Monet and Renoir have been held for over 100 years, allowing the inhabitants of Aberdeen and visitors to the city alike to admire their collected works in one central hub.\nGrampian Hospitals Arts Trust (GHAT) arose from the simple idea that improving the hospital environment by displaying art made everyone who spent time in the buildings feel better. GHAT strives to highlight culture as a central component of wellbeing and is a sector leader in developing bespoke arts projects for people visiting, working or utilising the services within hospitals and healthcare.\nThe city is regularly visited by Scotland's National Arts Companies.  The Aberdeen Art Gallery houses a collection of Impressionist, Victorian, Scottish and 20th Century British paintings as well as collections of silver and glass. It also includes The Alexander Macdonald Bequest, a collection of late 19th century works donated by the museum's first benefactor and a constantly changing collection of contemporary work and regular visiting exhibitions.\nIn 2017, the NuArt Festival came to Aberdeen and saw the installation of street art in many places around the city, including a large mural on the side of the Aberdeen Market.\nPlaces of artistic interest in Aberdeen\n* Aberdeen Art Gallery and Museum\n* Gray's School of Art\n* [http://www.ghat-art.org.uk/ Grampian Hospitals Art Trust]\n* Peacock Visual Arts\nFamous Aberdeen artists\n* George Jamesone\n* James Cromar Watt\n* John Phillip\nMuseums\nThe Aberdeen Maritime Museum, located in Shiprow, tells the story of Aberdeen's links with the sea from the days of sail and clipper ships to the latest oil and gas exploration technology. The museum includes a range of interactive exhibits and models, including an 8.5&nbsp;m (28&nbsp;ft) high model of the Murchison oil production platform and a 19th-century assembly taken from Rattray Head lighthouse.\nProvost Ross' House is the second oldest dwelling house in the city. It was built in 1593 and became the residence of Provost John Ross of Arnage in 1702. The house retains some original medieval features, including a kitchen, fireplaces and beam-and-board ceilings.  The Gordon Highlanders Museum tells the story of one of Scotland's best known regiments.\nThe Marischal Museum holds the principal collections of the University of Aberdeen, comprising some 80,000 items in the areas of fine art, Scottish history and archaeology, and European, Mediterranean and Near Eastern archaeology. The museum is open to the public, but also provides an important resource for the University's students and researchers. The permanent displays and reference collections are augmented by regular temporary exhibitions.\nFestivals\n* Aberdeen International Football Festival (discontinued)\n* Aberdeen International Youth Festival — The World Festival of Youth Arts\n* DanceLive — Contemporary Dance Festival\n* Rootin' Aboot (discontinued)\n* Sound — North-East Scotland's festival of New Music\n* Triptych — popular music and spoken word (discontinued)\n* Word — the University of Aberdeen Writers Festival (discontinued)\n* New Words — Festival of New Writing in Aberdeen City and Shire\n* Spectra Festival of Light - Scotland's Festival of Light\nMusic\nAberdeen's music scene includes a variety of live music venues including pubs, clubs, and a number of churches with thriving choirs. The music scene is particularly prevalent in the bars of Belmont Street. Cèilidhs are also common in some of the city's halls. Popular venues include The Lemon Tree, The Tunnels, the Aberdeen Exhibition and Conference Centre, and Aberdeen Music Hall. Aberdonian musicians include Evelyn Glennie, Seb Rochford and Annie Lennox.\nSee also\n* Green Spaces and Walkways in Aberdeen\n* Media in Aberdeen\nReferences\nExternal links\n*[https://web.archive.org/web/20120119181553/http://www.aiyf.org/ The World Festival of Youth Arts - based in Aberdeen]\n*[http://www.aberdeen-music.com Aberdeen Music - Aberdeen's answer to CBBC, but with more tantrums and hissy-fits]\n*[https://web.archive.org/web/20121029004759/http://dancelive.org.uk/ DanceLive - festival of contemporary dance]\n*[http://www.whatsoninaberdeen.com What's On in Aberdeen - Events guide: music, theatre, restaurants, exhibitions, children's events]"
    }
  ]
}