{
  "content": [
    {
      "type": "text",
      "text": "# Culture of Payyanur\n\n}}\nUliyathu Kadavu\nUliyathu Kadavu holds historical significance due to the iconic Salt Satyagraha of 1930, led by K. Kelappan. Payyanur offers a serene and welcoming environment for tourists. Located at the heart of the town, Gandhi Park features an impressive display of public art, developed through the efforts of the District Tourism Promotion Council (DTPC). The nearby village of Kunhimangalam is renowned as the “Land of Mangoes.”\nTheyyam\nLike any other place in Kannur, 'Theyyam' and religious festivals (Kaliyattam) of various temples in and around will be attraction of Payyanur.\nSree Kappattu Kazhagam\nSree Kappattu Kazhagam is one of the most important kazhakam (Temple) in Payyanur, Kannur belonging to the Maniyani community. Important theyyams are performed during the Kaliyattam (festival). 39 Theyyam are performed during Kaliyattam. Poorakkali is another traditional artform, every year it will be hosted in the kazakam during the month of May. Marathukali (Poorakkali) is an important event held every year, which is a part of pooram festival. Kappttu Kazhagam is very well known for its \"Perumkaliyattam\" - Kaliyattam usually celebrated once in every 25 years. Last kaliyattam was celebrated in 1996. Due to the pandemic situation in 2020, kaliyattam was postponed.Now the temple officials Decided to celebrate \"Perumkaliyattam\" from 25 February 2024 to 3 March 2024.\nThe main families related to Kappat are:\n#Puthiyaramban Tharavadu\n#Thekkadavan Valiyaveedu\n#Mattummal Tharavadu\n#Kunnummal Tharavadu\n#Manakkat Veedu\n#Thekkadavan Padinjarveedu\n#Thekkadavan Vadakkeveedu\n#Thekkadavan Kallath\n#Thekkadavan Kizhakee Veedu\n#Thekkadavan Thekkeveedu\nSree Muthappan Madappura, Keloth\nSree Muthappan Madappura is one of the oldest madappura in Payyanur Area, The Madappura has great historical connection with  Puthiyaramban Taravadu. The madappura  officials has decided to celebrate the Tiruvappana Teyyam From 2016 onwards.\nKandothidam Sree Someswari Temple Kandangali\nKandothidam Sree Someswari Temple is in Kandankali, Payyanur. This is one of the oldest temple in Payyanur Region. Devi is the main god of temple. After evening pooja Devi prasadam (appam and payasam) are given to devotees.\nKunhimangalam Sree Malliyottu Palottu kavu\nKunhimangalam Sree Malliyottu Palottu kavu is a temple situated at Kunhimangalam near Payyanur. It is about 2&nbsp;km from Ezhilode on Payyanur-Kannur Road. The presiding deity is Palottu Daivam. Spanning an area of 5 acres, the kavu houses a nalukettu, sanctums of several gods and goddesses, Kailasakkallu, Kodimaram and Pattupura. There is also a Devi temple outside the Nalukettu. The priest of Palottu Daivam is Malliyodan whereas for other gods, it is Anthithiriyan. According to the historical evidences it is believed that the Palottu Daivam is the incarnation of Lord Vishnu to kill Hayagreevan, a demon. The temple is named after Malliyodan. Formerly, the temple was known as Shri Kurumba Temple. Many festivals are celebrated here which includes the five-day Vishu festival from the 1st to 5th of Malayalam month Medam (April) and the three-day Bharani festival. The annual ten-day Pooram festival from Karthika asterism to Pooram asterism in the Malayalam month of Meenam (March – April) also attracts a large number of people. One of the main traditional custom during the vishnu festival is the submitting Pal(milk) to the theyyam at early morning by Mullikodan/ ettiatt Taravadu.\nSree Muchilot Bhagavathi Ramanthali\nMuchilot Bhagavathi is the chief goddess of Vaniya community. An exploration into the history of the goddess, Sree Muchilot Bhagavathi, the source of all prosperity, the reservoir of all knowledge and an immeasurable ocean of benevolence, reveals the fact that there are various opinions related to her life. Some of her devotees believe her to be the goddess bloomed from the sweat of Lord Shiva shed at the time of his stupendous dance on the Mount Kailasa. Whereas some others believe her to be a deity incarnated on the earth with a \"prasadam\" to purgate the world of all kinds of incurable diseases, or a goddess sent to earth in the form of flame to annihilate all the evils on the earth.\nBut some scholars are of the unanimous opinion that she was a Brahmin virgin born in \"Rayaramangalath Mana\" in the village of Peringellur, near Taliparamba. Those were the days after the betrothal of the virgin renowned for her unfathomable Vedic knowledge. It so happened that \"Peringellur Mootha Gurukkal\" (a Brahmin) and his disciples challenged the \"Naduvazhi\", on the request of the \"Naduvazhi\" the Brahmin virgin took part in the \"Naduvazhi\". The mesmerizing arguments and counter arguments darted by the virgin against \"Mootha Gurukal\" and his disciples stunned them and so they were envious of her. Being very shrewd and deceptive, they meditated to trap her somehow.\nSo they asked her two questions: \"Which is the most excruciating pain?\" \"What is the most ecstatial state?\" \"Labour pain\" and \"erotic state\", she answered innocently. They distorted her answers stating that woman having no such mundane experiences could never answer those questions and so she was not virgin. The issue ended up in her excommunication. The innocent and fragile virgin being struck by the arrows of deception from the Brahmins took asylum at the scared feet of \"Payyanur Perumal\", \"Karivellurappan\" and \"Rayaramangalath Bhagavathi\", with a heart full of woes. She adored them and offered all the despairs and throes of her heart before their divine presence and resolved to immolate herself.\nAs she was preparing her pyre, a \"Muchilot Karnavar\" happened to reach there. On her request, he poured oil from a pot into the fire with much reluctance. Thus she immolated herself and her soul departed to Lord Shiva. With a fraternal love, Lord Shiva sent her back to the earth with some boons, a golden fan, jewelry and various weapons to redeem the world. The Karnavar having seen the immolation of the virgin was full of grief and kept \"Thuthika\"(the empty pot) in the \"Padinjattakam\"(Pooja room), Karnavar's wife had an apparition vision of Sree Muchilot Bhagavathi, as she was drawing water from the well. Meanwhile, \"Thuthika\"(the empty pot) kept in the \"Padinjattakam\"(Pooja room) started tossing in the air. In an astrological speculation the Karnavar had an apocalypse that the soul of the virgin had been sent back by Lord Shiva to abide in him. The goddess whom the Karnavar places in a silver tabernacle in the \"Padinjattakam\", to worship began to be known as Sree Muchilot Bhagavathi.\nSree Muchilot Kavu , Korom\nKorom a village in Payyanur entered into the tourism map of Kerala as a result of the proposed Perumkaliyattam - one of the popular theyyam forms- at Sree Muchilot Kavu in 2009. In 2009, Muchilot Bhagavathi Kavu Perumkaliyattam (The Big \"feast\" at Muchilottu goddess shrine)to be held at Korom in Payyanur and Vengara near Pazhayangadi.  The perumkaliyattam consistes of several customs and rituals like Varachuvekkal (painting), kalnattu karmam (stick one's foot), upadevadha theyyattams (theyyam for sub-gods, vellattam (getting drunk) and then the thirumudi uyaral (upheaval of hairs) of Muchilot Bhagavathi (Goddess of Muchilottu). A prasadam feast is organised in a grand manner by giving food to more than a lakh devotees symbolising the marriage of Muchilottamma (Mother lordess of Muchilottu). Perumkaliyattams played a great role in the social formation of north Kerala as cited\nChenankavu, Korom\nOne of the most renowned Bhagavathi temples in north Kerala, Chenankavu Temple is located in Korom village. Annual festival used to feature a galore of Theyyams, like Karichamundi.\nPenunthanniyuur Subramanya Swami Temple\nPerunthanniyuur Subramanya Swami Temple is another historic temple in Payyanur. A Subramanya temple, which is lacking a Sarpa Pratishta, which was destroyed by Tippu Sulthan, and further by communist revolutions in North Malabar is with least facilities. The Deva Prashna carried out, defines that the Sarpa Kaave (sarpa pratishta) can play a unique role in maintaining the temple from downfall. This findings by the means of prashna that the Subramanya idol has a scar on its forehead, which was further justified by the Sri. Shankaran Namboothiri, the temple priest, sitting in the srikovil of the temple.\nSree Rayarothidam Someswari Temple\nThis temple is located at Padinjarekkara, Kadannappalli West. It is one of the famous Bhagavathi temple. Currently the temple is undergoing renovation work managed by Mr.E.P.G. Nambiar(Chennai)and other members of Erankot Tharavadu. Every year during the month of January (Makaram 17) theyyam \"Karimchamundi\" is performed in the temple.\nSree Makeel Mundyakkavu, Kozhummal\nMakeel Mundyakkavu is one of the famous and ancient 'kavu'(temple) situated at green village called Kozhummal, which is about 7&nbsp;km away from Payyanur town.\nOther places of worship\n*Thayinery Sri Kurinhi kshethram\n*Kadangottu Maakkam Bhagavathi temple, Kunhimangalam\n* Kandothidam Someshwari temple\n* Uma Maheswara Temple\n* Thuluvannur Maha Vishu Temple\n* Kaarali Bhagawathi Temple\n* Mavicheri Sree Bhagawathi Temple\n* Madathumpadi Subrahmanya Swami Temple\n* Kotty Sree Aadhi Kannangadu Temple\n* Kandangali Kanakath Kazhakam Poomala Bhagavathi Temple\n* Thalayanneri poomala bagavathi kavu\n* [https://theyyamkerala.in/kandoth-sree-koormba-bhagavathi-kshethram-kaliyaattam/ Kandoth Sree Kurumba Bhagavathi Temple]\n* Vellur Sree Chamakkavu Bagavathy Temple\n* [https://theyyamkerala.in/vellur-shree-kottanacherry-mahakshethram/ Kottanachery Maha temple Vellur]\nNotable people\n*V. P. Appukutta Poduval, freedom fighter.\n*The native place of legendary Kathakali master Kalamandalam Krishnan Nair is not far from this town.\n*Unnikrishnan Namboothiri\n*P. V. Kunhikrishnan\n*K. U. Mohanan\n*Malavika Mohanan\n*Ganapathi S Poduval\n*Kaithapram Damodaran Namboothiri\n*K. C. Venugopal\n*Chidambaram S. Poduval\n*M. K. Raghavan\n*Anaswara Rajan\n*Abhiram Radhakrishnan\n*A. C. Sreehari\n*Satheesh Babu Payyannur\n*P. Kunhikrishnan\n*Sahal Abdul Samad\n*Mohan Kupleri\n*Parvathy Nambiar\nReferences"
    }
  ]
}