{
  "content": [
    {
      "type": "text",
      "text": "# Cultural depictions of John, King of England\n\nKing John as shown in Cassell's History of England (1902)\nJohn of England has been portrayed many times in fiction, generally reflecting the overwhelmingly negative view of his reputation.\nArt\nThe North Wall Frieze in the courtroom of the Supreme Court of the United States depicts King John granting Magna Carta.\nLiterature\n* King John is the protagonist of John Bale's sixteenth-century Protestant play King Johan, in which he is depicted positively as a bulwark against the papacy.\n* John was the subject of an anonymous Elizabethan play, The Troublesome Reign of King John, in 1591. The play reflects the sympathetic view of King John during the English Reformation; it depicts John as \"a fearless resister of the Papacy\". This play is believed by many Shakespeare scholars to have been a source for Shakespeare's play.\n* King John appears in the plays The Downfall of Robert Earl of Huntington and The Death of Robert Earl of Huntington (1598) by Anthony Munday. Munday's two plays feature the exploits of Robin Hood, and John is depicted as Robin's enemy in these plays. Munday's work thus incorporated King John into the Robin Hood legends. As a result of this, John and one of his Justices in Eyre, the Sheriff of Nottingham, are frequently portrayed as villain and henchman in later versions Robin Hood legends. These usually place the Robin Hood stories in the latter part of Richard I's reign, when Richard was in captivity and John was acting as unofficial regent.\n* John was the subject of a Shakespearean play, King John (written c. 1595, and published in 1623).\n* Prince John is a central figure in the 1819 historical romance Ivanhoe, by Sir Walter Scott, and is depicted in subsequent adaptations. Ivanhoe helped popularize the image of King John as cruel and villainous. The novel also calls John a \"Norman\", although contemporary documents from the period of John's reign do not refer to the monarch as a Norman.\n* King John features in the three-decker novel Forest Days (1843) by G. P. R. James, about the First Barons' War.\n* The children's novel ''The Constable's Tower: or the Times of Magna Charta'' (1891) by Charlotte Mary Yonge, revolves around John signing Magna Carta, and also features the Siege of Dover during the First Barons' War.\n* The novel Uncanonized (1900) by Margaret Horton Potter features King John.\n* King John is the subject of A. A. Milne's poem for children, ''King John's Christmas (1927), which begins \"King John was not a good man\", but slowly builds sympathy for him as he fears not getting anything for Christmas, when all he really wants is a rubber ball.\n* In the comic parody 1066 and All That (1930) John is depicted as \"an Awful King\".\n* The Devil and King John by Philip Lindsay (1943) is a highly speculative but relatively sympathetic account.\n* Philip José Farmer, a science fiction author, featured King John as one of several historical figures in his Riverworld saga.\n* Below the Salt'' (1957) by Thomas B. Costain depicts the First Baron's War and John's signing of Magna Carta.\n* John is a character in James Goldman's 1966 play The Lion in Winter, which dramatises Henry II's struggles with his wife and sons over the rule of his empire. John is portrayed as a spoiled, simple-minded pawn in the machinations of his brothers and Philip II of France.\n* James Goldman also wrote a novel called Myself As Witness (1979), a fictional record of the later years of John's reign purportedly kept by the chronicler Gerald of Wales.\n* John is a character in Maureen Peters' 1983 novel ''Lackland's Bride'', which deals with his marriage to Isabella, Countess of Gloucester.\n* Sharon Penman's Here Be Dragons deals with the reign of John, the development of Wales under Llewelyn's rule, and Llewelyn's marriage to John's illegitimate daughter, Joan, who is depicted in the novel as \"Joanna\".  Other novels of hers which feature John as a prominent character are ''The Queen's Man, Cruel as the Grave, The Dragon's Lair, and Prince of Darkness'', a series of fictional mysteries set during the time of Richard's imprisonment.\n* John is featured in several books by Elizabeth Chadwick, including Lords of the White Castle, The Champion, and The Scarlet Lion.\n* Judith Tarr features a sympathetic Prince John as the protagonist of her fantasy novel Pride of Kings (2001).\nFilm\nJohn has been portrayed on film by:\n*Herbert Beerbohm Tree in the silent short King John (1899), which recreates his death scene at the end of the Shakespeare play\n*George Courtenay in the silent adaptation of Ivanhoe (1913)\n*Sam De Grasse in the silent film Robin Hood (1922), with Douglas Fairbanks as Robin\n*Edward Cooper in the silent film Robin Hood, Jr.(1923)\n*Ramsay Hill in The Crusades (1935)\n*Claude Rains in The Adventures of Robin Hood (1938), with Errol Flynn as Robin. John is here portrayed as an affable but tyrannical man.\n*George Macready in Rogues of Sherwood Forest (1950)\n*Hubert Gregg in The Story of Robin Hood and His Merrie Men (1952), with Richard Todd as Robin\n*Guy Rolfe in Ivanhoe (1952), with Robert Taylor as Ivanhoe\n*Nigel Terry in the film adaptation of The Lion in Winter (1968)\n*Lawrence Adams in the soft porn film The Ribald Tales of Robin Hood (1969)\n*Frank Braña in the Italian film Il Magnifico Robin Hood (1970)\n*Daniele Dublino in the Italian film ''L'Arciere di Sherwood (1970)\n*Peter Ustinov provided the voice of Prince John in the Disney animated film Robin Hood (1973), in which the Regent of England is depicted as an anthropomorphic lion and a cowardly, infantile, comical villain who sucks his thumb at the mention of his mother and is repeatedly humiliated by Robin Hood (himself depicted as an anthropomorphic fox)\n*Ian Holm in Robin and Marian (1976)\n*Algimantas Masiulis in the Russian film The Ballad of the Valiant Knight Ivanhoe (1983), an adaptation of Ivanhoe\n*Edward Fox in Robin Hood'' (1991), with Patrick Bergin as Robin\n*Richard Lewis in Mel Brooks's parody Robin Hood: Men in Tights (1993)\n*Oscar Isaac in Ridley Scott's Robin Hood (2010) as neither hero or villain but as a corrupt yet intelligent ruler who forms an alliance with Hood to defeat the French invaders.\n*Paul Giamatti in Jonathan English's Ironclad (2011)\n*John Michael Higgins provided the voice of John in the Warner Bros. animated film Tom and Jerry: Robin Hood and His Merry Mouse (2012)\nTelevision\nJohn has been portrayed on television by:\n*Donald Wolfit in the BBC Sunday Night Theatre version of Shakespeare's King John (1952)\n*Donald Pleasence in the British series The Adventures of Robin Hood (1955&ndash;1960); John was also played in the series by Hubert Gregg and Brian Haines\n*Andrew Keir in the British series Ivanhoe (1958)\n*John Crawford in \"The Revenge of Robin Hood\" episode of the American time travel series The Time Tunnel (1966)\n*John Scott (voice) In the Canadian children's animated series Rocket Robin Hood (1966&ndash;1969)\n*Roddy McDowall in the American TV musical film The Legend of Robin Hood (1968) and the American TV film parody The Zany Adventures of Robin Hood (1984)\n*Tim Preece in the BBC series Ivanhoe (1970)\n*David Dixon in the BBC series The Legend of Robin Hood (1975)\n*Ron Rifkin in the American comedy series When Things Were Rotten (1975), about Robin Hood\n*Paul Spurrier (as a boy) and John Duttine (as an adult) in the BBC TV drama series ''The Devil's Crown (1978), which dramatised his reign and those of his father and brother\n*Ronald Pickup in the British TV film Ivanhoe (1982)\n*John Slade in the \"An Arrow Pointing East\" episode of the American time travel series Voyagers!'' (1982)\n*Gerald Flood in \"The King's Demons\" story of the BBC series Doctor Who (1983), in which John was impersonated by the shape-shifting robot Kamelion\n*Phil Davis in the British series Robin of Sherwood (1984&ndash;1986)\n*Leonard Rossiter in the BBC Shakespeare The Life and Death of King John (1984)\n*Forbes Collins in the BBC children's comedy series Maid Marian and her Merry Men (1989) plays John as a cowardly, overweight, dimwitted buffoon.\n*Michael Rudder (voice) in the American animated children's series Young Robin Hood (1992)\n*Ian Falconer in the TV film Young Ivanhoe (1995)\n*Andrew Bicknell in the American series The New Adventures of Robin Hood (1997&ndash;1998)\n*Ralph Brown in the British series Ivanhoe (1997)\n*Cameron Rhodes in the British series Dark Knight (2000), based on Ivanhoe\n*Jonathan Hyde in the American TV film Princess of Thieves (2001), which depicts Prince John trying to seize the throne from the rightful heir, Prince Philip, an illegitimate son of King Richard\n*Soma Marko (as a boy) and Rafe Spall (as an adult) in the TV film adaptation of The Lion in Winter (2003)\n* Toby Stephens in the 2009 season of the BBC's Robin Hood series, playing John as a manipulative, insecure, spoilt brat who resents his elder brother and desires the throne of England whilst constantly demanding affirmation that he is loved by his people, despite his vindictive treatment of them.\n* Jim Howick, Ben Miller, Ryan Sampson and Ethan Lawrence in the historical sketch show Horrible Histories.\nRadio\nJohn has been portrayed on radio by:\n*Robert Farquharson in a 1931 BBC Radio London performance of Shakespeare's The Life and Death of King John.\n*Carleton Hobbs in a 1944 BBC Radio broadcast of Shakespeare's The Life and Death of King John (with Ralph Richardson playing Philip Faulconbridge).\n*Robert Harris in a 1958 BBC Radio broadcast of Shakespeare's The Life and Death of King John.\n*Robert Eddison in a 1967 BBC Radio broadcast of Shakespeare's The Life and Death of King John.\n*Hadyn Jones in the 1971 play John, By the Grace of God by Lydia Ragosin, Haydn Jones and Beatrix Lehmann. This play depicts John as being secretly a pagan.\n*Jack Shepherd in a 1990 BBC Radio \"modern-dress\" adaption of Shakespeare's The Life and Death of King John.\n*Neil Stuke in Mike Walker's BBC Radio 4 series Plantagenet (2010).\nComics\nKing John was depicted in a 1955 Classics Illustrated adaption of Scott's Ivanhoe.\nReferences"
    }
  ]
}