{
  "content": [
    {
      "type": "text",
      "text": "# Culture of Costa Rica\n\nCosta Rican culture has been heavily influenced by Spanish culture ever since the Spanish colonization of the Americas including the territory which today forms Costa Rica. Parts of the country have other strong cultural influences, including the Caribbean province of Limón and the Cordillera de Talamanca which are influenced by Jamaican immigrants and indigenous native people, respectively.\nEthnic groups\nChavela Vargas Mixed-Costa Rican Born -  Singer\nHarry Shum, Jr Asian-Costa Rican - Glee Actor/Dancer\nJoel Campbell Afro-Costa Rican Football Player\nClaudia Poll, [[Nicaragua-born Costa Rican, Gold-Medalist Olympic Swimmer]]\nIbo Bonilla, Criollo-Costa Rican, architect, sculptor, mathematician and educator\nmost Costa Ricans are of primarily Spanish or Spanish/Mixed ancestry with minorities of German, Italian, French, Dutch, British, Swedish and Greek ancestry. Whites, Castizo and Mestizo together comprise 83% of the population.\nEuropean migrants in Costa Rica to get across the isthmus of Central America as well to reach the USA West Coast (California) in the late 19th century and until the 1910s (before the Panama Canal opened). Other European ethnic groups known to live in Costa Rica include Russians, Danes, Belgians, Portuguese, Croats, Poles, Turks, Armenians and Georgians.\nMany of the first Spanish colonists in Costa Rica may have been Jewish converts to Christianity who were expelled from Spain in 1492 and fled to colonial backwaters to avoid the Inquisition. The first sizable group of self-identified Jews immigrated from Poland, beginning in 1929. From the 1930s to the early 1950s, journalistic and official anti-Semitic campaigns fueled harassment of Jews; however, by the 1950s and 1960s, the immigrants won greater acceptance. Most of the 3,500 Costa Rican Jews today are not highly observant, but they remain largely endogamous.\nCosta Rica has four small minority groups: Mulatto, Black, Amerindian and Asian people. About 8% of the population is of African descent or Mulatto (mix of European and black) who are called Afro-Costa Ricans, descendants of Sub-Saharan Africans enslaved by the Spanish, and descendants of 19th century English-speaking Jamaican immigrant workers.\nIn 1873, the Atlantic Railroad imported 653 Chinese indentured laborers, hoping to duplicate the success of rail projects that used Chinese labor in Peru, Cuba, and the United States. Asians represent less than 0.5% of the Costa Rican population, mostly from China, Taiwan and Japan.\nThere are also over 104,000 Native American or indigenous inhabitants, representing 2.4% of the population. Most of them live in secluded reservations, distributed among eight ethnic groups: Quitirrisí (in the Central Valley), Matambú or Chorotega (Guanacaste), Maleku (northern Alajuela), Bribri (southern Atlantic), Cabécar (Cordillera de Talamanca), Guaymí (southern Costa Rica, along the Panamá border), Boruca (southern Costarable portion of the Costa Rican population is made up of Nicaraguans. There is also a number of Colombian refugees. Moreover, Costa Rica accepted many refugees from various other Latin American countries fleeing civil wars and dictatorships during the 1970s and 1980s – notably from El Salvador, Chile, Argentina, Cuba and recently from Venezuela.\nCurrently immigrants represent 9% of the Costa Rican population, the largest in Central America and the Caribbean. By 2014 the three largest Immigrant Diasporas in Costa Rica are people from: Nicaragua, Colombia and United States.\nLanguage\nThe official language of Costa Rica is Spanish. However, there are also many local indigenous languages in Costa Rica, such as Bribrí. English is the first foreign language and the second most taught language in Costa Rica, followed by French, German, Italian and Chinese. A creole language called Mekatelyu is also spoken in Limón.\nPura vida\nPura vida, a characteristic Costa Rican phrase, literally means pure life, with connotations that suggest translations such as \"full of life\", \"this is living!\", \"going great\", or \"real living\". The phrase can be used both as a greeting or a farewell, as an answer expressing that things are going well, as a way of giving thanks, or showing appreciation. In modern-day usage, the saying goes beyond its simple translation: it's a way of life. It is a perspective on life that evokes a spirit that is carefree, laid back and optimistic.\nAccording to Víctor Manuel Sánchez Corrales of the University of Costa Rica, the origin of the phrase is Mexican. It is thought to have come from a Mexican film called ¡Pura vida! (1956). The protagonist, played by Antonio Espino, used the expression \"pura vida\" extensively in situations where it would not normally be used. Costa Ricans adopted the phrase, using it in a similar way. It was formally recognized and incorporated into dictionaries in the mid-1990s  and has since become Costa Rica's unofficial but ubiquitous motto.\nReligion\nA 2007 survey conducted by the University of Costa Rica, found that 70.5% of the population identify themselves as Roman Catholics (with 44.9% practicing, 25.6 percent nonpracticing), 13.8% are Evangelical Protestants, 11.3% report that they do not have a religion, and 4.3% declare that they belong to another religion.\nThere are several other religious festivals in the country; Costa Rica has various religious denominations: Buddhism, Hinduism, Judaism, Islam, Baháʼí Faith, Scientology, Rastafari, Taoism and Jehovah's Witness.\nEducation\nEducation is highly cared about in Costa Rica by most of the population. About 6% of the country's  domestic product is dedicated to education, which has produced positive results as 96% of the population is literate.\nPrimary (1st-6th grade) and secondary (7th-11th or 12th) are mandatory for all citizens. Public schools are free, and those who can afford it may choose to send their children to private schools.\nThe country has five major public universities: the University of Costa Rica (UCR), the Costa Rica Institute of Technology (TEC), the Universidad Nacional (UNA), the Universidad Técnica Nacional, and the Universidad Estatal Distancia (UNED).\nArt\nPainting and sculpture\nAt the beginning of the 19th century, some wealthy Costa Ricans paid visiting foreign painters, usually European, to paint their portraits. It was not until some of these painters, such as Bigot, Henry Etheridge, or Santiago Paramo settled in the country that Costa Rican artists learned modern techniques for drawing, oil painting, and sculpture. These teachers directly influenced Tico artists Jose Maria Figueroa, Faustino Montes de Oca, and Felipe Valentini.\nTowards the end of the 19th century Costa Ricans produced artists with stronger national identities. A short list of these artists would include Ezequiel Jimenez, Wenceslao de la Guardia, and Enrique Echandi. Current renowned Costa Rican painters include Gonzalo Morales Sáurez, Rafa Fernandez, and Fernando Carballo, and sculptors such as Ibo Bonilla, Max Jimenez, Jorge Jimenez Deredia, Ingrid Rudelman Wohlstein,Domingo Ramos, Mario Parra, Olger Villegas, Nestor Zeledon, and William Villanueva Bermudez.\nMusic\nMost of the music and  folklore comes from the north of the country, including the Nicoya Peninsula (Mayan culture) and the Atlantic coast (Afro-Caribbean culture). Costa Rican music is marked by a rhythm known as tambito, as well as a distinctive musical genre known as punto. Two examples are the punto guanacasteco from Guanacaste Province, and the sancarleño from San Carlos in Alajuela Province.\nDance\nDance remains an important cultural tradition in Costa Rica. Most Costa Ricans learn several traditional dances from a young age. The vast majority of Costa Rican traditional dances were born in the province of Guanacaste. National holidays are often celebrated by spirited displays of dancing in the streets.\nMany consider the Punto guanacasteco to be the national dance, which showcases three different stages of courtship. Occasionally, all dancers will pause mid-dance so that one person can shout out a bomba. A bomba is a rhymed verse which can be memorized or improvised and is usually racy or witty.\nWriting\nCosta Rican literature has many women who have played a large role in every literary movement. Most notably, Carmen Lyra whose overall subject matter and perspective made her a revolutionary figure. Other well known authors include Jose Leon Sanchez, Aquileo J. Echeverría (Concherías), Manuel González Zeledón (La propia), Joaquin Gutierrez (Cocori, Puerto Limón, Manglar), Carlos Luis Fallas (Marcos Ramírez, Mamita Yunai), Carlos Salazar Herrera (Cuentos de angustias y paisajes), Isaac Felipe Azofeifa, Fabián Dobles, Jorge Debravo, Alberto Cañas Escalante, Andrés Meza Murillo, Yolanda Oreamuno and Eunice Odio.\nCuisine\nCosta Rican cuisine is a combination of Spanish, South American, Caribbean, and American influences. This style of cuisine is shared by most of Central America, although local variations have appeared in each of the countries.\nOne national dish is gallo pinto (\"spotted rooster\"), although the name has no relation to the ingredients. It is a combination of black beans and white rice, spiced with cilantro, onions, garlic, salt, and a local condiment called Salsa Lizano. It is typically eaten at breakfast with eggs, and sometimes natilla (sour cream). Fried plantains and either corn tortillas or bread are also common. Gallo pinto is a common and typical dish in both Costa Rica and Nicaragua.\nOther typical dishes are arroz con pollo, olla de carne, tamales, and casado. Arroz con pollo (rice with chicken) consists of bite size chicken chunks mixed with rice and diced vegetables that include carrots, peas, corn, and garbanzo beans. Olla de carne is mainly prepared on weekends. It is a broth of corn prepared by boiling water, meat, and whole to large-sized vegetable pieces with spices. The soup is eaten in a bowl with the broth and separate plates for the vegetables and rice.\nA casado is a one-plate meal that includes black beans, rice, meat, fried plantains, and one or more side dishes. The meat can vary from chicken, beef, or fish. Some examples of side dishes are pasta salad, vegetable salad, fried eggs, potatoes, spaghetti, or barbudos (green beans wrapped in egg batter).\nThere are some regional differences. For example, the Caribbean side of the country, because of its roots, has gallo pinto with coconut milk, while the north-western part of the country has a strong tendency towards corn products and for large, cheese filled tortillas, corn snacks, and other dishes.\nSee also\n*Architecture of Costa Rica\n*Cultural Properties of Costa Rica\n*Media of Costa Rica\n*Public holidays in Costa Rica\n*List of festivals in Costa Rica\n*List of museums in Costa Rica\nReferences"
    }
  ]
}