{
  "content": [
    {
      "type": "text",
      "text": "# Culture Factory Polymer\n\n| renovated              =\n| expanded               =\n| closed                 =\n| demolished             =\n| owner                  =\n| operator               =\n| surface                =\n| scoreboard             =\n| production             =\n| cost                   =\n| architect              =\n| builder                =\n| project_manager        =\n| structural engineer    =\n| services engineer      =\n| general_contractor     =\n| main_contractors       =\n| seating_type           =\n| capacity               =\n| suites                 =\n| record_attendance      =\n| dimensions             =\n| field_shape            =\n| acreage                =\n| volume                 =\n| tenants                =\n| embedded               =\n| website                = http://www.kultuuritehas.ee (Defunct)\n| publictransit          =\n}}\nCulture Factory Polymer () was a multidisciplinary centre for artistic creation and diffusion in Tallinn, Estonia. Located in Lilleküla, Kristiine District, on the fringes of the Tallinn city centre, this former toy factory became in 2003 one of the main strong points for alternative un-institutionalized culture in Tallinn.\nCulture Factory Polymer closed in 2014.\nHistory\nDuring the Soviet era, Polymer was a toy factory. In 1993, closed this branch of activities, leaving a large building in a state of abandonment.\nA few years after, a group of artists, intrigued by this big empty space, decided to turn a room into a rehearsal place. Step-by-step, other artists wished to enjoy different spaces to create, to rehearse. The new owner of the building gave its agreement for necessary rearrangements and renovations.\nNowadays, the factory disposes of  of space, dedicated to creation and diffusion. The building aesthetics of Polymer are typical Soviet industrial style. Concrete production facilities were transferred over time to incorporate new space for living, artistic use and events, with the old flair and keeping its authenticity. The conservation of the old factory's name, \"Polymer\", perpetuates the memory of this historic past.\nThe different spaces\nPolymer, it is nowadays:\n*studios for artists,\n*rehearsals rooms for music bands,\n*a center for art courses,\n*two exhibition galleries,\n*a Media Lab,\n*two concert halls,\n*two spaces which can be converted for several kinds of events,\n*a bar,\n*and two studios for guest artists.\nA traditional letterpress print shop was also installed in the building; it's kept alive through realisation of posters for different organizations and animation of workshops for different publics.\nActivities & events\nGradually, Polymer became a place for residencies and diffusion with multiple spaces, where live together about 30 artists and organizations, working on diverse artistic fields.\nConstituted as a non profit organization, Polymer works as a platform, as a venue for different events and activities, offering thus a new space for alternative culture in Tallinn. Public events take place every week, involving artist in residency and guest artist also, from Tallinn, Estonia and Europe.\nEvery year in August, Polymer organizes its own festival, \"Culture Factory Festival\"; during 2 weeks, artists of the house open their studios and hang their art out to take some fresh air, and artists and a multitude of events from diverse universes take possession of the place: exhibition openings, concerts, film screenings, dance performances. Important is involving the audience in action through the workshops during the festival.\nPolymer is an organization involved in local life and open to outwards contacts. Polymer leads different cultural and social actions at a local level, and develops its partnerships in Tallinn, in Estonia and in Europe.\nPolymer was a member of the Trans Europe Halles network in years 2005-2013.\nResidents\n*Art Container\nThis collective develops alternative points of view of the society and trends dominating the artworld and enables an experimental times-space container in both-material and conceptual level for the creators.\n*[http://www.martu.org MARTU – Estonian Media Artists' Union]\nIt is the first umbrella organization for media artists in Estonia providing a platform for\ntheir activities and trying to meet their needs.\n*[http://www.larp.ee Role players]\nAmong others, Estonian Role Players’ Society boasts a training hall here. LARP, tabletop\ngames and re-enactment are practised.\n*[https://web.archive.org/web/20090828043456/http://www.kunstikoolitus.ee/ Kunstimooduste Keskus (Centre of art Methods)]\nThey bring out people from the world of two-dimensional vision and add an extra measure\nto the learning of art-emotional.\n*[http://www.madallend.ee Motorcycles]\nMC Madal Lend (Flying Low) adds hard rock spice to the community.\nBut visual also artists, jewellery artists, performances artists, multimedia artists,...\nReferences"
    }
  ]
}