{
  "content": [
    {
      "type": "text",
      "text": "# Culture of Peru__disambig_1\n\nPeruvian culture is the gradual blending of Amerindian cultures with European and Asian ethnic groups. The ethnic diversity and rugged geography of Peru allowed diverse traditions and customs to co-exist. Peruvian culture has been deeply influenced by Native culture, Spanish culture, and Asian culture. Other minor influences on their culture are Chinese, Japanese, and other European peoples.\nLiterature\nPeruvian literature has been shaped by the convergence of indigenous oral tradition and the technical resources of writing introduced by the Spanish. This fusion, from the very beginning, enabled the collection and expression of the diverse and complex cultural realities that came into conflict after the conquest.\nQuechua and Aymara literature, transmitted orally, was deeply linked to religious, agricultural, romantic, festive, and funerary rituals. These characteristics are reflected in certain forms of poetry and prose, as seen in the early historical chronicles, including the  by Inca Garcilaso de la Vega and  by Felipe Guaman Poma de Ayala. Also notable is the connection between the yaravíes and patriotic and romantic poetry, represented in the work of Mariano Melgar.\nDuring the colonial and republican periods, the dominance of the criollo oligarchy in Peruvian society favored the adoption of European literary forms at the expense of indigenous ones. In this context, neoclassical authors such as Manuel Ascensio Segura and Felipe Pardo y Aliaga emerged, dominating the literary scene until the late 19th century when romanticism took hold through figures like Carlos Augusto Salaverry and José Arnaldo Márquez. The crisis resulting from the War of the Pacific paved the way for modernism, with exponents such as José Santos Chocano and José María Eguren.\nIn the 20th century, avant-garde movements gained strength, driven by magazines like  and , the latter founded in 1926 by José Carlos Mariátegui, with notable collaborators such as César Vallejo. Meanwhile, indigenism resurfaced in the poetry of Luis Fabio Xammar. The avant-garde movements fragmented into various lyrical proposals, such as those of Xavier Abril, Alberto Hidalgo, Sebastián Salazar Bondy, Carlos Germán Belli, among others, opening new and diverse expressive fields.\nIn 19th-century Peruvian prose, the costumbrismo of Manuel Ascensio Segura and Ricardo Palma, along with the modernism of Manuel González Prada and José Santos Chocano, set the literary course. By the 20th century, indigenist prose reached some of its peak moments with Ciro Alegría and José María Arguedas, whose influences extended to authors such as Sebastián Salazar Bondy, Manuel Scorza, and Julio Ramón Ribeyro. Mario Vargas Llosa and Alfredo Bryce Echenique, while maintaining a realist approach, incorporated new narrative techniques.\nIn poetry, prominent figures include Emilio Adolfo Westphalen, Jorge Eduardo Eielson, Carlos Germán Belli, Arturo Corcuera, Antonio Cisneros, Wáshington Delgado, Marco Martos, and Carmen Ollé. In contemporary narrative, notable authors include Miguel Gutiérrez, Gregorio Martínez, Alonso Cueto, and Gustavo Rodríguez, among others.\nArt\nPeru's cultural heritage originates from the ancient Andean civilizations that emerged in its territory before the arrival of the Spanish. The archaeological treasures of Peru testify to a significant cultural development that occurred without contact with other extracontinental cultures.\nThe earliest artistic expressions with a high degree of intellectual and technological evolution are found in the sites of Chavín de Huántar and Cupisnique, dated between the 9th and 4th centuries BCE. These expressions include silver and gold jewelry, ceramics, architecture, and stone sculpture, reflecting symbolic and religious art.\nBetween the 8th century BCE and the 1st century CE, the Paracas Cavernas and Paracas Necrópolis cultures developed. The former produced polychrome ceramics with religious representations, while the latter is known for its monochrome ceramics and complex, delicate textiles.\nIn the period between the 3rd century BCE and the 7th century CE, the urban cultures of the Moche in Lambayeque and the Nazca in the Río Grande valley in Ica emerged. Both cultures are notable for their advanced terrace agriculture, hydraulic engineering, and ceramic, textile, pictorial, and sculptural productions.\nThe Wari civilization, between the 7th and 12th centuries, established in Ayacucho, pioneered rational urban design, a concept that spread to other areas such as Pachacámac, Cajamarquilla, and Wari Willka. The Tiahuanaco culture, which developed on the shores of Lake Titicaca between the 9th and 13th centuries, is known for its monumental stone architecture and sculpture, facilitated by the use of bronze.\nThe Chimú people, between the 14th and 15th centuries, built the city of Chan Chan in the Moche River valley in La Libertad, and they excelled in jewelry-making and hydraulic engineering.\nThe Inca civilization, which absorbed much of the cultural legacy of its predecessors, left significant evidence such as the cities of Cuzco, the architectural remains of Sacsahuamán and Machu Picchu, and a network of roads connecting Cuzco with other regions of the empire. The arrival of the Spanish led to a cultural blending reflected in Peruvian architecture, combining European styles with indigenous influences. After the Renaissance period, the Baroque reached a rich expression in buildings such as the Convent of San Francisco in Lima and the Iglesia de la Compañia in Cuzco.\nThe War of Independence created a creative void that French-inspired Neoclassicism attempted to fill. During the 20th century, architectural eclecticism was observed, with constructive functionalism emerging as a response, exemplified by the Plaza San Martín in Lima.\nPeruvian sculpture and painting developed from workshops founded by religious figures, influenced by the Sevillian Baroque school. This artistic movement can be seen in works such as the choir stalls of the cathedral and the fountain in the Plaza Mayor.\nto Lima. (1842) painted by Ignacio Merino.]]\nArtistic mestizaje was more evident in painting, which incorporated elements of native heritage. Examples include the portrait of the imprisoned Atahualpa by Damián de la Bastida y Mora and the works of artists such as Mateo Pérez de Alesio, Angelino Medoro, Francisco Bejarano, Jesús de Illescas, and Joaquín Rodríguez.\nDuring the 17th and 18th centuries, Baroque dominated the visual arts, while in the 19th century, French Neoclassical and Romantic currents found their best representatives in Luis Montero, Ignacio Merino, and Francisco Masías.\nIn the 20th century, the foundation of the School of Fine Arts of Lima in 1919 marked a milestone in Peruvian sculpture and painting. Notable sculptors include Luis Agurto, Luis Valdettaro, Joaquín Roca Rey, Jorge Piqueras, Alberto Guzmán, Víctor Delfín, and Francisco Sánchez, and painters such as Daniel Hernández Morillo, Ricardo Grau, César Quispez Asín, and José Sabogal. The latter led the indigenist movement, a pillar of contemporary Peruvian painting, with representatives such as Fernando de Szyszlo, Alberto Dávila, Armando Villegas, Sabino Springett, Víctor Humareda, Mario Alejandro Cuadros, Ángel Chávez, Milner Cajahuaringa, Arturo Kubotta, Venancio Shinki, Alberto Quintanilla, Germán Chávez, Tilsa Tsuchiya, David Herskowitz, Óscar Allain, and Carlos Revilla.\nAmong the most widespread crafts in Peru are ceramics, both artistic and utilitarian, carving, silverwork, leather embossing, straw weaving, and textile work, with colorful alpaca wool fabrics standing out.\nArchitecture\nPeruvian architecture is a conjunction of European styles exposed to the influence of indigenous imagery. Two of the most well-known examples of the Early Colonial period are the Cathedral of Cusco and the Church of Santa Clara of Cuzco. After this period, the mestization reached its richer expression in the Baroque. Some examples of this Baroque period are the Convento de San Francisco, the Iglesia de la Compañía, and the facade of the University of Cuzco and, overall, the churches of San Agustín and Santa Rosa of Arequipa.\nAlthough these later examples are rarer; the Independence War left a creative emptiness that was filled by the Neoclassicism. The 20th century was characterized by the eclectic architecture, which has been in stark opposition to constructive functionalism. Its considerable example is San Martin Plaza in Lima.\nMusic\nA Peruvian man playing the zampoña\nThe pre-Hispanic Andean cultures of Peru were distinguished by their rich tradition in artistic expressions, especially in music. Most communal agricultural activities were accompanied by music and songs, known in Quechua as . The ethnic diversity of ancient Peru resulted in the coexistence of various traditions and customs, which have persisted over time and have been fundamental to the development of post-Hispanic Peruvian folklore.\nToday, various musical expressions, such as dance and song, popular festivals (both religious and non-religious), handicrafts, gastronomy, and other regionally varied activities, are significant aspects of Peruvian and Latin American cultural heritage.\nPre-Hispanic Andean musicians primarily used wind instruments, such as the , , ,  or  (also known as ), and the . They also employed percussion instruments like the  (hand drum),  (made from puma skin), and  (made from human skin), used in battles, as well as the , a large drum.\nWith the arrival of the Spanish, European instruments like harps, guitars, vihuelas, bandurrias, and lutes were introduced. The combination of these instruments with indigenous ones led to the creation of mestizo instruments, such as the Andean harp and the , which is made from the shell of the armadillo.\nDances\nCultural blending was not limited to the interaction between indigenous and European cultures; African influence is also evident in the rhythms and percussion instruments. This influence is reflected in musical forms such as  and .\nAmong the native dances, those related to agricultural work, hunting, and warfare are prominent. Some of these choreographies show Christian influence. Two of the most representative Andean dances are the kashua, communal in nature, performed in groups in open spaces, and the wayño or huayno, a \"salon dance\" performed in pairs in enclosed spaces. Other Andean-origin dances include the yaraví and triste, which are songs with typically very sentimental lyrics.\nRitual dances include the achocallo, pinkillada, llamerada (imitating the movement of llamas), and kullawada (of the spinners). Hunting-related dances include llipi-puli and choq'elas, colorful highland dances associated with vicuña hunting.\nWarfare dances include the chiriguano, of Aymara origin; chatripuli, which satirizes Spanish royalist soldiers; and kena-kenas, referring to the Chilean soldiers who occupied Peru during the War of the Pacific (1879). Carnival dances are also significant, a Western festival that in the Peruvian Andes coincides with the harvest season; many rural communities celebrate with ancestral rites and mestizo dances, marking the initiation of youth and, in many cases, the formation of new couples.\nThe most internationally recognized Peruvian dance is the marinera norteña, which represents the courtship of a man towards a young woman. There are local variations of this dance in Lima and other regions of the country.\nCelebrations\nPopular festivals, which result from the traditions and legends of each town, bring together music, dance, typical foods, and drinks. In addition to religious festivals, such as Christmas, Corpus Christi, or Holy Week, there are others that express the syncretism between indigenous and Christian beliefs, such as the alasitas'' fairs (an Aymara word that some scholars interpret as \"buy me\"), which combine a craft and miniature fair with dances, foods, and a mass. Another important festival is the pilgrimage of Q'oyllor-riti (Cusco), which integrates the ancient worship of the apus (tutelary deities of the mountains) with a pilgrimage to a Christian sanctuary, in a walk up to a snow-capped peak over 5,000 meters above sea level.\nSports\n, former captain of the Peru national football team.]]\nFootball is the most popular sport in Peru. Football in Peru is governed by the Peruvian Football Federation (PFF), which organizes the men's and women's national teams. Football legends from Peru include Alejandro Villanueva, Teodoro Fernández, Valeriano López, Alberto Terry, Hugo Sotil, César Cueto, Roberto Challe, Héctor Chumpitaz and Teófilo Cubillas, Peru's most successful striker in the World Cup finals with ten goals, Nolberto Solano.\nCurrent renowned players include defender Carlos Zambrano (Rubin Kazan), midfielder Juan Manuel Vargas (Universitario) and strikers Claudio Pizarro (Werder Bremen), Paolo Guerrero (Flamengo) and Jefferson Farfán (Lokomotiv Moscow). Alianza Lima, Sporting Cristal and Universitario de Deportes are the biggest teams in Peru. In 2003, Cienciano won the Copa Sudamericana after defeating Argentinian club River Plate, and then proceeded to beat Latin American powerhouse Boca Juniors (also from Argentina) in the Recopa Sudamericana played in Miami. Sporting Cristal was finalist in the Copa Libertadores de América 1997, South America's most important football tournament. Also Universitario de Deportes, but in 1972.\nAchievements from the Peru national football team include competing at the FIFA World Cup, in 1930, 1970 (quarterfinalists), 1978, and 1982, being Teófilo Cubillas, among the top 10 goal scorers in the history of the World Cup and having a record as the only player to score 5 goals in 2 different World Cups. The national team won two Copa América's in 1939 and 1975.\nClaudio Pizarro holds the record as the top scorer from a foreign country in the history of Bundesliga. Paolo Guerrero holds the record as the current all-time top scorer in the history of the Copa América still active, finishing as the top scorer in all three of these tournaments (2011, 2015 and 2019), which is also a record.\n, Peruvian surfing World Champion.]]\nAchievements from the Peru women's national football team include finishing third place at the 1998 Sudamericano Femenino, and finishing fourth place at the 2003 Sudamericano Femenino.\nWomen's volleyball is a popular and also successful sport in Peru (silver medal in the 1988 Summer Olympics, runners-up in the Volleyball World Championship, and 12 times South American champion).\nTennis, surfing and rugby in Peru are minor but growing sports.\nAlejandro \"Alex\" Olmedo Rodríguez (March 24, 1936 – December 9, 2020) was a tennis player from Peru with American citizenship. He was listed by the USTA as a \"foreign\" player for 1958, but as a U.S. player for 1959.[3] He helped win the Davis Cup for the United States in 1958 and was the No. 2 ranked amateur in 1959. Olmedo won two Majors in 1959 (Australia and Wimbledon) and the U.S. Pro Championships in 1960, and was inducted into the Tennis Hall of Fame in 1987.\nSofía Mulánovich is the first South American ever to win the Surfing World Title, which she did in 2004. She is also the first Peruvian surfer ever to win a World Surf League World Championship Tour event. In 2004, she won three out of the six World Championship Tour events, and finished the season as World Champion. Felipe Pomar was also a world champion.\nCuisine\nDue to the rich variety and the harmony of its flavor and the food used, Peruvian food is constantly winning internationally and the chefs often have international recognition and distinction. One notable element is the constant new innovations and new dishes, especially those that incorporate the food found by experimentation. Each region maintains its rich cuisine by its food having a mix of colors and ingredients.\nThe great variety of native foods, such as corn, tomatoes, potatoes, uchu or chili pepper, oca, olluco, avocado, and fruits like cherimoya, lúcuma, and pineapple (ananás), along with animals such as tarucas (deer), llamas, and guinea pigs, led to the creation of new dishes and methods of preparation when combined with European and Moorish culinary traditions. The successive arrivals of Africans and Chinese also influenced the development of criollo cuisine, which is now varied and rich.\nAmong the most representative dishes of Peruvian cuisine are ceviche (fish and seafood marinated in lime juice), chupe (soup) of shrimp, anticuchos (grilled beef heart skewers), olluco con charqui, the Andean pachamanca (meats, tubers, and beans cooked in a stone oven), lomo saltado (stir-fried beef with tomatoes and onions, served with fried potatoes and rice) of Chinese influence, and picante de cuy. These dishes are often accompanied by typical drinks such as chicha de jora (corn fermented and sun-dried), with very low alcohol content, as well as non-alcoholic chicha made from purple corn or peanuts.\nSee also\n* Culture of South America\n* [http://www.everythingperu.com Everything Peru- Cultural Information about Peru and Online Community]\nReferences\nFurther reading\n*"
    }
  ]
}