{
  "content": [
    {
      "type": "text",
      "text": "# Culture of South Asia\n\nThe culture of South Asia, also known as Desi culture, is a mixture of several cultures in and around the Indian subcontinent. Ancient South Asian culture was primarily based in Hinduism, which itself formed as a mixture of Vedic religion and indigenous traditions (like Dravidian folk religion), and later Buddhist influences. From the medieval era onwards, influences from the Muslim world (particularly Central Asia and the Middle East) and then Europe (primarily British) also became prevalent.\nSouth Asian culture has influenced other parts of Asia, particularly Southeast Asia (see Greater India).\nOverview\nHistory\nMedieval era\nThe Delhi Sultanate, having conquered most of India by the 13th century, ushered in over five centuries of Indo-Muslim rule, and helped turn Delhi into a cosmopolitan and powerful hub in the Islamic world.\nThe Mughal Empire played a role in consolidating the political structure that defines South Asia until the present-day, having brought various South Asian subregions' focuses to bear on each other, rather than on neighbouring Afro-Eurasian regions.\nColonial era\nThe introduction of census-based demography and local elections in the 19th century created harder boundaries between various communities in newly political ways. European Christian history, which featured a substantial streak of conflict with Islam, also influenced local perceptions of Indo-Muslim history to become more negative.\nThe British colonisation of India influenced South Asian culture noticeably. The most noticeable influence is the English language which emerged as the administrative and lingua franca of India and Pakistan (and which also greatly influenced the native South Asian languages; see also: South Asian English) followed by the blend of native and gothic/sarcenic architecture. Similarly, the influence of the South Asian languages and culture can be seen on Britain, too; for example, many Indian words entering the English language, and also the adoption of South Asian cuisine.\nContemporary era\nThe 1947 partition of India resulted in cultural divergence among the newly created countries of India and Pakistan. Cultural and linguistic disputes also characterised the 1971 secession of Bangladesh (then East Pakistan) from Pakistan.\nCompeting forms of nationalism, be they civic, religious, ethnocultural or otherwise, have increasingly shaped cultural debates in various South Asian countries.\nReligion\nLanguages\nArt\nCinema\nCuisine\nSports\nMartial arts\nMusic\nArchitecture\nAfghan architecture\nPakistani architecture\nIndian architecture\nDravidian architecture\nBengali architecture\nClothing\nLiterature\nPhilosophy\nSee also\n* Culture of Asia\n* :Category:Culture of South Asia\n* Individual South Asian countries' cultures:\n** Culture of Afghanistan\n** Culture of Bangladesh\n** Culture of Bhutan\n** Culture of India\n** Culture of the Maldives\n** Culture of Nepal\n** Culture of Pakistan\n** Culture of Sri Lanka\nNotes\nReferences\nReferenced works\n*\n*\n* }}\n*\n*\n*\n*\n*\n* }}\n*\n*"
    }
  ]
}