{
  "content": [
    {
      "type": "text",
      "text": "# Culture of medieval Poland\n\n]]\n]]\nThe culture of medieval Poland was closely linked to the Catholic Church and its involvement in the country's affairs, especially during the first centuries of the Polish state's history. Many of the oldest Polish customs and artifacts date from the Middle Ages, which in Poland lasted from the late 10th to late 15th century, and were followed by the Polish Renaissance.\nEarly centuries (10th–12th)\nThe Christianization of the Kingdom of Poland led, as in the rest of Europe, to the supplementation of previous pagan Slavic mythology-based culture Polanie with the new Christian culture of the Kingdom of Poland under the Piast dynasty. Around the 12th century, the ecclesiastical network in Poland was composed of about one thousand parishes grouped in eight dioceses.\n, 1175]]\nThe new customs spread as the Church also acted as the state's educational system. Church run schools with Latin trivium (grammar, rhetoric, dialectic) and quadrivium (mathematics, geometry, astronomy, and music) and was helped by various religious orders which established monasteries throughout the countryside. By the end of the 13th century, over 300 monasteries existed in Poland, spreading Catholicism and Western traditions: for example, the first Benedictine monasteries built in the 11th century in Tyniec and Lubin spread new Western agricultural and industrial techniques.\nAnother powerful tool employed by the Church was the skill of writing. The Church had the knowledge and the ability to make parchments, and scribes created and copied manuscripts and established libraries. Thus the earliest examples of Polish literature were written in Latin. Among them were the Gospels from Gniezno and Płock,  and , dating from around the late 11th century. Other notable examples of early Polish books include the Bishop Ciołek's Latin Missal and ''Olbracht's Gradual. Also famous are the chronicles of Gallus Anonymus and Wincenty Kadłubek.\nWhile folk music did not disappear during this time, relatively little of the early Polish music is known. Musical instruments, commonly homemade (e.g., fiddles, lyres, lutes, zithers, and horns) were used. The Gregorian chorales and monodic music appeared in Polish churches and monasteries at the end of the 11th century.\nThe architecture of Poland was also transformed. Over one hundred buildings have survived which provide a testament to the popularity of the new, monumental style of Romanesque architecture. The style was influenced by Cologne, particularly early on. Among those is the Crypt of Saint Leonard at Wawel Hill in Kraków and the Cathedral of Płock, built in 1144. Many similar churches from that era, usually round or square with semicircular apses, can be found throughout Poland, in towns like Ostrów Lednicki or Giecz. Another example is the brick Church of St. Jacob in Sandomierz, founded in 1226 by Iwo Odrowąż and built by his nephew St. Jacek Odrowąż (its campanile however was built in early Gothic style in the 14th century). At the Cathedral in Gniezno is an important example of Romanesque art, the bronze Gniezno Doors (c. 1175), which is recognized as the first major work of Polish art with a national theme. Their relief depicts eighteen scenes of the life and death of Saint Adalbert.\nLate centuries (13th–15th)\nFrom the 13th century on the culture of Poland was increasingly affected by forces other than the Church, as the nonecclesiastical institutions had begun to gain importance. The 14th century also saw the important transition from the Piast dynasty to the Jagiellonian dynasty. The schools prepared their students for careers not only in priesthood but also in law, diplomacy, and administration. Cracow Academy (centuries later renamed to Jagiellonian University), one of the oldest universities in the world, was founded in 1364. Polish law begun to develop as legal texts recorded laws in secular chancelleries. Polish science also developed, as works of Polish scholars became known abroad. Notable examples of Polish scholarly texts discussed in Western Europe include a chronicle of popes and emperors by Martinus Polonus and the treatise on optics by Witelo. By the end of the 14th century, over 18,000 students had been educated at Cracow Academy. The faculties of astronomy, law and theology were staffed with prominent scholars. Stanisław of Skalbmierz, Paweł Włodkowic, Jan of Głogów, and Wojciech of Brudzew were just a few of these. Nicolaus Copernicus (Mikołaj Kopernik) developed new astronomical theories, bringing about a revolutionary change in the contemporary perception of the universe.\nThe ties between Poland other countries also increased, as prospective students went abroad to University of Padua, University of Paris and other renowned European academies. This was strengthened by other similar trends, as Poles traveled abroad, and foreigners visited Poland. The royal and ducal courts, through diplomatic missions and alliance-forming intermarriage, absorbed foreign cultural influences. Contacts between Polish royal court and those of neighbouring countries – Hungary, Bohemia, the Italian states, France, and the German States increased with time. Poland was also affected by the process of German colonization (Ostsiedlung). As German settlers migrated East, they brought various knowledge and customs (for example the Magdeburg laws). Germans often settled in towns, and thus Polish urban culture became similar to that of Western Europe. Polish culture, influenced by the West, in turn radiated east, with one of the main consequences being the Polish-Lithuanian Union.\nSarcophagus of Casimir the Great at Wawel Cathedral\nAs in the West, Gothic architecture gained popularity in Poland, mostly due to the growing influence and wealth of the Church and the towns which became major sponsors of this new style. Coupled with the significant economic development that occurred during the reign of Casimir III the Great, this resulted in a major transformation of Polish landscape, as hundreds of Gothic buildings rose throughout the country. The cathedrals of Kraków, Wrocław, Gniezno, and Poznań in Gothic style were built or rebuilt in the new style, as were hundreds of basilicas and churches, such as the St. Mary's Church, Krakow and the Collegiate Church in Sandomierz. Gothic secular buildings such as city halls also became numerous, for example in the new towns of Kazimierz and Wiślica. Casimir also invested in improved defenses. City walls, other town fortifications and standalone castles were raised. Casimir ordered the construction of least 40 new castles, guarding strategically vital areas and communication lines—they were so numerous that there is an Eagle Nests Trail in modern Poland. Cracow Academy received its seat, the Collegium Maius.\nGothic Altar of Veit Stoss\nArchitecture was not the only area of arts that boomed at that time. The patronage of wealthy and influential individuals, from kings through the nobility, as well as clergymen and town patricians, allowed various artists to create masterpieces. For example, Grzegorz of Sanok, Archbishop of Lwów, a poet himself, supported numerous scholars and writers, such as Filip Callimachus from Tuscany, who became a tutor to King Casimir's sons, and a professor at the Jagiellonian University. Buildings were adorned with gold and silver articles, paintings, stained glass windows, stone and wood sculptures, and textiles. Notable monuments include the sarcophagus of Casimir the Great in the Wawel Cathedral, the altar of St. Catherine's Church in Kraków by Mikolaj Haberschrack, the stained glass windows of Saint Nicholas's Church, Toruń, the reliquary for the head of Saint Stanisław, and the chasuble from the benefaction of Piotr Kmita. Byzantine art was also influential, represented in the frescoes of the Trinity Chapel in Lublin, and of Italian art in the Franciscan monastery in Kraków. One of the greatest examples of Gothic art in Poland are the works of Veit Stoss (Wit Stwosz), who came from Nuremberg to Kraków in 1477, staying there till his death twenty years later. His wooden altar, with hundreds of small figurines, has been described as \"one of the crowning achievements of medieval sculpture.\"\nThe origins of Polish music can be traced as far back as the 13th century. Manuscripts from that period have been found in Stary Sącz, containing polyphonic compositions related to the Parisian Notre Dame School. Liturgical and canonical songs, hymns and carols were created. Other early compositions, such as the melody of Bogurodzica, may also date back to this period. One of the most notable Polish composers of that era was Mikolaj z Radomia, author of polyphonic music. He lived in the 15th century and spent much of his life at the court of king Władysław Jagiełło.\nFile:Church of St. Prokop in Strzelno.JPG|Rotunda of St. Procopius in Strzelno, 1133\nFile:Tum - Kolegiata 01.jpg|Collegiate church in Tum, 1140–1161\nFile:Kościół Marii Magdaleny-portal detal2.jpg|Ołbin Monastery, Wrocław\nFile:Ołbin-portal.JPG|Ołbin Monastery, Wrocław\nFile:Strzelno column of virtues.jpg|Romanesque column with personifications of virtues in St. Trinity-Church in Strzelno, 12th century\nFile:Czerwinsk1.jpg|Czerwińsk\nFile:Kościelec - kościół wnętrze (22.VI.2008).JPG|Kościelec church of Saint Adalbert (św.Wojciech in polish), 1231\nFile:Sulejów-Podklasztorze3.jpg|Sulejów Abbey, 1232\nFile:Opatow, kolegiata sw. Marcina 3.jpg|Saint Martin Collegiate Church in Opatow, 1206\nFile:Prandocin 05.JPG|Church of St. John the Baptist in Prandocin, 12th century\nFile:Bolkow(js)1.jpg|Bolko castle in Bolków\nFile:Jedrzejow church 20060722 1150.jpg|Cistercian Monastery in Jędrzejów, 1140\nFile:Polska Sandomierz 006.jpg|Portal of the Dominican Church in Sandomierz, 1236\nFile:Kosciol sw Idziego w Inowlodzu.jpg|Inowłódz\nFile:Colegiate church, Kruszwica.JPG|Collegiate church, Kruszwica\nFile:Cieszyn rotunda sw Mikolaja.jpg|St. Nicolas Rotunda, Cieszyn\nFile:Inowroclaw kosciol NMP.jpg|St. Mary's church, Inowrocław\nFile:Poznań, Ostrów Tumski,ul. Mieszka I, Katedra pw. śś Apostołów Piotra i Pawła, XI-XX, A 148 z 14.02.1930 (1).JPG|Archcathedral Basilica in Poznań, 1244-1406\nFile:Kraków - St. Mary Church 01.JPG|St. Mary's Basilica in Kraków, 1321–1331\nFile:Wrocław - Archikatedra św. Jana Chrzciciela (1).jpg|St. John's Cathedral in Wrocław, 1244-1341\nFile:SM Elbląg Kościół św Mikołaja (0) ID 644686.jpg|St. Nicholas Cathedral in Elbląg, 1247 - 14th century\nSee also\n* History of Poland (966–1385)\n* History of Poland (1385-1569)\nReferences\n* Michael J. Mikoś, Polish Literature from the Middle Ages to the End of the Eighteenth Century. A Bilingual Anthology, Warsaw: Constans, 1999. [https://web.archive.org/web/20090421140035/http://www.staropolska.gimnazjum.com.pl/ang/middleages/index.html First chapters online]"
    }
  ]
}