{
  "content": [
    {
      "type": "text",
      "text": "# Culture of Chicago\n\nto attend a rally (2013) ]]\nThe culture of Chicago, Illinois is known for the invention or significant advancement of several performing arts, including improvisational comedy, house music, industrial music, blues, hip hop, gospel, jazz and soul.\nThe city is known for its Chicago School and Prairie School architecture.  It continues to cultivate a strong tradition of classical music, popular music, dance, and performing arts, rooted in Western civilization, as well as other traditions carried forward by its African-American, Asian-American, European American and  Hispanic and Latino American citizens.\nThe city is additionally known for various popular culinary dishes, including deep-dish pizza, the Chicago-style hot dog and the Italian beef sandwich.\nFood and drink\nChicago lays claim to a large number of regional specialties that reflect the city's ethnic and working-class roots. Among these are its nationally renowned deep-dish pizza; this style is said to have originated at Pizzeria Uno. The Chicago-style thin crust is also popular in the city. A number of well-known chefs have had restaurants in Chicago, including Charlie Trotter, Rick Tramonto, Grant Achatz, and Rick Bayless.\nIn 2003, Robb Report named Chicago the country's \"most exceptional dining destination\" and in 2008,  Maxim awarded Chicago the title of \"Tastiest City.\"\nLocal specialties\nThe most popular Chicago-style foods are:\n* The Chicago-style hot dog, traditionally a steamed or boiled, natural-casing all-beef wiener on a poppy-seed bun, topped with yellow mustard, chopped onion, sliced tomato, neon-green sweet-pickle relish, sport peppers, a dill pickle spear, and a sprinkling of celery salt—but never ketchup.\n* Chicago-style pizza includes deep-dish pizza with a tall outer crust and large amounts of cheese, with chunky tomato sauce on top of the cheese instead of underneath it.  Similar to this is stuffed pizza, with even more cheese, topped with a second, thinner crust.  Also very popular in Chicago is a type of thin-crust pizza called \"tavern style\", which has a very thin, crispy crust and is cut into squares instead of wedges.\n* The Italian beef, a sandwich featuring thinly sliced roast beef simmered in a broth (known locally as \"gravy\") containing Italian-style seasonings and served on an Italian roll soaked in the meat juices. Most beef stands offer a \"cheesy beef\" option, which is typically the addition of a slice of provolone or mozzarella. A \"combo\" is a beef sandwich with the addition of grilled Italian sausage. Italian beef sandwiches are traditionally topped with sweet peppers or spicy giardiniera.\nOther Chicago-style dishes include:\n*A francheezie is a variation of the Chicago-style hot dog. The hot dog is wrapped in bacon and deep-fried, and either stuffed or topped with cheese.\n*Maxwell Street Polish, named after Maxwell Street where it was first sold. It is a Polish sausage made with beef and pork, and with garlic and other spices, served on a bun with grilled onions.\n*The jibarito is a specialty sandwich that originated in the heart of Chicago's Puerto Rican community. Invented by Borinquen Restaurant in the Humboldt Park neighborhood, a jibarito is made with meat or chicken, and condiments, placed between two pieces of fried and flattened plantain instead of bread.\n*Chicken Vesuvio, an Italian-American dish made from chicken on the bone and wedges of potato, celery, and carrots; sauteed with garlic, oregano, white wine, and olive oil, then baked until the chicken's skin becomes crisp.\n*Shrimp DeJonghe, a casserole of whole peeled shrimp blanketed in soft, garlicky, sherry-laced bread crumbs.\n*The mother-in-law is a tamale on a hot dog bun, topped with chili.\n*Chicago also has its own unique style of tamale, machine-extruded from cornmeal and wrapped in paper, and typically sold at hot dog stands.\n*Gyros is popular in Chicago. While some restaurants still make their own gyros cones, Chicago is the hometown of mass-produced gyros.\n*Flaming saganaki was popularized by restaurants in the Greektown neighborhood. A square piece of kasseri, kefalotyri, or a similar cheese is fried in a small, two-handled pan, topped with a splash of brandy, and served flambé-style, traditionally with a cry of \"Opa!\" from the waiter.\n*A pizza puff is a deep-fried dough pocket filled with cheese, tomato sauce, and other pizza ingredients such as sausage. Indigenous to Chicago, pizza puffs can be found at some hot dog restaurants.\n*A pepper and egg sandwich combines scrambled eggs and grilled bell peppers, served on French bread. Originally eaten during Lent by Italian immigrants in Chicago, it now can be found in some casual dining restaurants.\n*The big baby, a style of a double cheeseburger with the cheese in between the hamburger patties, ketchup, mustard, and pickle slices underneath them, and grilled onions on top; said to have originated at Nicky's The Real McCoy in the Gage Park neighborhood.\n*The breaded-steak sandwich, a specialty particularly found in the Bridgeport neighborhood, which consists of a flattened inexpensive cut of beef that has been breaded, fried Milanesa-style and served on an Italian bread roll with marinara sauce, topped with optional mozzarella cheese with a choice of green peppers or giardiniera.\n*The Freddy, a sandwich consisting of an Italian sausage patty topped with green peppers, mozzarella and marinara served on a bun. It is typically found in sandwich shops and pizzerias on the South Side and its adjacent suburbs.\n*Pork chop sandwiches, served bone-in with mustard and grilled onions, are popular on the South Side.\n*The gym shoe (sometimes spelled Jim Shoe or Jim Shoo), a submarine sandwich made with a combination of corned beef, gyros, and either roast beef or Italian beef.\n*Chicago-style barbecue, particularly rib tips and hot links. This is barbecue that has been cooked in an aquarium smoker, a rectangular indoor smoker with glass sides and a large compartment for a wood fire under the grill. Barbecued ribs are also very popular in Chicago.\n*Mild sauce, a condiment made with barbecue sauce, ketchup, and hot sauce, and sometimes other ingredients such as honey or sugar. Mild sauce is used as a topping on fried chicken and other foods, and was popularized at fast food restaurants in Chicago's African-American community including Harold's Chicken Shack, Uncle Remus Saucy Fried Chicken, and Coleman's Barbecue.\n*Giardiniera – spicy, chopped, pickled vegetables in oil – is popular as a condiment in the Chicago area. For example, it is commonly used as a topping on Italian beef sandwiches. Giardienera was brought to the city by immigrants from Sicily, where it is served as a side dish. Chicago-style giardiniera has vegetables that are chopped very finely, and uses oil and not vinegar as a base.\n* Popcorn from Garrett Popcorn Shops, including their \"Garrett Mix\" flavor that is a combination of cheddar cheese popcorn and caramel popcorn.\n*Atomic cake, featuring banana, yellow, and chocolate cake layers alternating with banana, strawberry, and fudge fillings.\n*Chicago Brick ice cream, a Neapolitan-style three-flavor ice-cream with orange sherbet, vanilla, and caramel flavors.\nRestaurant scene\nChicago features many restaurants that highlight the city's various ethnic neighborhoods, including Chinatown on the South Side, Swedish/Nordic Andersonville on North Clark Street, Greektown on Halsted Street, and Little Italy on Taylor Street and the Heart of Italy. The South Asian community along Devon Avenue hosts many Pakistani and Indian eateries. The predominantly Mexican neighborhoods of Pilsen and Little Village are home to numerous eateries ranging from small taquerías to full scale restaurants. Several restaurants featuring Middle Eastern fare can be found along Lawrence Avenue, while Polish cuisine is well represented along Milwaukee Avenue on the Northwest side and Archer Avenue on the Southwest side. A large concentration of Vietnamese restaurants can be found in the Argyle Street district in Uptown.\nAlong with ethnic fare and fast food, Chicago is home to many steakhouses, as well as a number of upscale dining establishments serving a wide array of cuisine. Some notable destinations include Frontera Grill, a gourmet Mexican restaurant owned by chef and Mexico: One Plate at a Time host, Rick Bayless; Graham Elliot's eponymous restaurant, Graham Elliot; Jean Joho's Everest, a new-French restaurant located on the top floor of the Chicago Stock Exchange building downtown, and Tru from chefs Rick Tramonto and Gale Gand.\nChicago has become known for its ventures in molecular gastronomy, with chefs Grant Achatz of Alinea, Homaro Cantu of Moto, and Michael Carlson of Schwa.\nBlack restaurants\nMany African American migrants who were entrepreneurs would open restaurants, female entrepreneurs especially. Food-related businesses had a low threshold for entry because many African Americans were raised in environments where food was a central part of life.\nThe Chicago Tribune in 2019 identified five \"iconic black restaurants\" run by five families as having some of the best food in the city. They were Harold's Chicken Shack (founded 1950), Lem's Bar-B-Q (founded 1954), Uncle Remus Saucy Fried Chicken (founded 1963), Taurus Flavors (founded 1966) and Old Fashioned Donuts (founded 1972). The city is also home to many fried-shrimp shacks.\nConferences and events\nTaste of Chicago is a large annual food festival held in early July in Grant Park in downtown Chicago. It features booths from dozens of Chicago-area restaurants, as well as live music.\nBeginning in 2015, Chicago Black Restaurant Week is an annual celebration of various Black cuisines where more than 20 different restaurants come together in February during Black History Month to share their foods.\nIn 2001, the Culinary Historians of Chicago held a \"Grits and Greens\" conference at Harold Washington College. The conference was focused on highlighting the contribution of African-American women in shaping the culinary culture of Chicago's black community. Over the course of two days, the event brought together an array of people, including authors, chefs, and professors. The programming of the event featured a variety of activities, such as a gala held at Roosevelt University and tours of the southwest neighborhoods of Chicago.\nBrewing\nChicago has a long brewing history that dates back to the early days of the city. While its era of mass-scale commercial breweries largely came to an end with Prohibition, the city today has a large number of microbreweries and brewpubs. According to 2018 report by the Brewers Association, Chicago had the most breweries of any metropolitan area in the country, with 167 total. Included among these are craft brewers like Half Acre, Off Color, Pipeworks and Revolution Brewing.  The largest brewery in Chicago is Goose Island, founded in 1988 and now owned by Anheuser-Busch InBev.\nAnnual events include Illinois Craft Beer Week, the Festival of Barrel-Aged Beers (known as FOBAB), the Chicago Beer Festival, and the Chicago Beer Classic.\nIn the mid- to late-20th century, the most popular beer in Chicago was Old Style, a mass-produced lager that at the time was brewed by G. Heileman in La Crosse, Wisconsin. The Old Style brand is now owned by the Pabst Brewing Company which supervises its production under contract by MillerCoors.\nDistilled spirits\nJeppson's Malört is a brand of bäsk, a Swedish-style liqueur flavored with wormwood. Known for its bitter taste, it can be found in some Chicago-area taverns and liquor stores, but is seldom seen elsewhere in the country. The Carl Jeppson Company was founded in Chicago in the 1930s. Malört was made in Chicago until the mid-'70s, when the Mar-Salle distillery that produced it for the Carl Jeppson Company closed. It was made in Kentucky briefly, after which it was produced in Florida for many years. In 2018, Jeppson's Malört was acquired by Chicago-based CH Distillery, and in 2019 production was moved back to Chicago.\nKoval, Chicago's first distillery to operate within city limits since Prohibition, began operation in 2008.  Located in the Andersonville neighborhood on the city's North Side, Koval offers a wide range of spirits and was featured on the Chicago (\"World's Greenest Beer\") episode during the second season of the Esquire Network show Brew Dogs in 2014.\nCohasset Punch is a brand of rum-based drink first created by Chicago bartenders Lewis Williams and Tom Newman in the 1890s. Officially classified as a liqueur, Cohasset Punch can also be considered a bottled cocktail or punch. It has been referred to as \"the definitive Chicago cocktail\", and a 1902 trade journal remarked that \"what the mint julep is to the South, Cohasset Punch is to Chicago.\" Cohasset Punch was produced until the late-1980s, and was relaunched under new ownership in 2024.\nMusic\nChicago has made many significant pop-cultural contributions in the field of music: Chicago blues, Chicago soul, jazz, gospel, indie rock, hip hop, industrial music, punk rock, and acid house. With the advent of the Chicago house in the 1980s, the city is also the birthplace of the house style of music, which helped lead to the development of techno music in Detroit, Michigan.\nChicago artists have played an influential role in the R&B–soul genre. Popular R&B or soul artists to hail from Chicago include Sam Cooke, R. Kelly, Curtis Mayfield, The Impressions, Jerry Butler, The Chi-Lites, Ahmad Jamal, Dave Hollister, Jennifer Hudson, Baby Huey, and Carl Thomas.\nProminent figures from Chicago blues include Sunnyland Slim, Howlin' Wolf, Muddy Waters, Sonny Boy Williamson, Willie Dixon, Elmore James, Albert King, Koko Taylor, Otis Spann, Little Walter, Lonnie Brooks, Junior Wells, Syl Johnson, Buddy Guy, Magic Sam, Magic Slim, Luther Allison, Freddie King, Eddy Clearwater, and Otis Rush.\nJazz musicians based in Chicago have included Jelly Roll Morton, Bix Beiderbecke, Benny Goodman, Sun Ra, Von Freeman, and Dinah Washington.  The city is the home of the Association for the Advancement of Creative Musicians, a group of musical artists who helped pioneer avant-garde jazz.\nThe hip hop scene in Chicago is also very influential, with major artists including Kanye West, Chance the Rapper, Twista, Common, Lupe Fiasco, Crucial Conflict, Psychodrama, Cupcakke, Da Brat, Shawnna, Chief Keef, King Louie, Lil Reese, and Rhymefest.\nThe rock band Chicago was named after the city, although its original name was the Chicago Transit Authority. The band's name was shortened to Chicago after the CTA threatened to sue them for unauthorized use of the original trademark. Popular 1980s band Survivor is from Chicago.\nMany mainstream rock bands hail from Chicago or were made famous there. Among these are The Blues Brothers, the aforementioned Chicago, Styx, Cheap Trick, REO Speedwagon, Survivor, the Butterfield Blues Band, and the Siegel–Schwall Band.\nChicago has also been home to a thriving folk music scene, particularly in the 1960s and 1970s. John Prine, Steve Goodman and Bonnie Koloc were the most prominent folk singer–songwriters of that time.\nIn the late 1970s, local band The Shoes arguably started indie rock with a power pop album recorded in their living room. 1980s and 1990s alternative bands Local H, Eleventh Dream Day, Ministry, Veruca Salt, My Life with the Thrill Kill Kult, Material Issue, Liz Phair, Urge Overkill, and The Smashing Pumpkins hail from Chicago. Contemporary rock bands The Lawrence Arms, Soil, Kill Hannah and Wilco are also Chicago-based. The 2000s have seen local artists Disturbed, Alkaline Trio, The Academy Is, Rise Against, The Audition, Spitalfield, Chevelle, the Plain White T's, Kanye West, Lupe Fiasco, and Fall Out Boy also attain success in the U.S.\nChicago has become known for indie rockers following in the paths of the Smashing Pumpkins, Urge Overkill, Wilco, and The Jesus Lizard; bands like The Sea and Cake, Califone, OK Go, Andrew Bird and Umphrey's McGee hail from the city. Tim and Mike Kinsella, hailing from Chicago, fronted several seminal 90s emo bands: Cap'n Jazz, American Football, Owen, Joan of Arc, and Owls. Matthew and Eleanor Friedberger of The Fiery Furnaces, who now reside in Brooklyn, New York are originally from Oak Park, Illinois, a suburb of Chicago. Chicago is also home to many independent labels like Thrill Jockey, Drag City, and others, and to the popular music-news website Pitchfork Media.\nA handful of punk rock bands are based in Chicago. Some of the more famous punk rock products of the city are Naked Raygun, The Effigies, Big Black and Shellac (featuring Steve Albini), and Screeching Weasel. Many of these punk and indie bands got their start at noted alternative music venues Metro (originally Cabaret Metro), Lounge Ax, Empty Bottle, Double Door, and The Fireside Bowl.\nChicago is also known for being the \"birthplace of American Industrial Music\", as many bands got their start in Chicago. The city was also home of the now-defunct Wax Trax! Records record label which once had KMFDM, Ministry, Front 242, PIG, Front Line Assembly, My Life with the Thrill Kill Kult, Coil, and more on its roster.\nThe Chicago Symphony Orchestra is one of the nation's oldest and most respected orchestras. It is well regarded throughout the world through tours in both Asia and Europe and also through a large number of recordings widely available. Perhaps because of Chicago's historically large German-American population, the CSO is particularly well known for its performances of pieces by German composers.\nChicago also has a thriving and youthful contemporary classical scene. Major venues for new music include concerts by the International Contemporary Ensemble, Ensemble Dal Niente, Third Coast Percussion, Fulcrum Point and the CSO's MusicNOW series. Composers of note include Augusta Read Thomas, Lee Hyla, Marcos Balter, Kirsten Broberg, Hans Thomalla, Jay Alan Yim and Shulamit Ran.\nWhile lacking a school of music with the stature of the Juilliard School or the Curtis Institute of Music, the Chicago area does have a number of colleges. The best known outside of the region is the Northwestern University Bienen School of Music. The Chicago College of Performing Arts at Roosevelt University and the School of Music at DePaul University are both working to expand their reputations.\nChicago's colorful history and culture have provided inspiration for a wide variety of musical compositions. In the 19th century, the chain of events surrounding the Great Chicago Fire led Chicago resident Horatio Spafford to write the hymn \"It Is Well With My Soul\".\nAnnual music festivals in Chicago with free admission include the Chicago Blues Festival, the Chicago Jazz Festival, the Grant Park Music Festival, and World Music Festival Chicago.  Annual ticketed festivals in the city include Lollapalooza, Pitchfork Music Festival, Riot Fest, North Coast Music Festival, Spring Awakening, Ruido Fest, and Chicago Open Air.\nPerforming arts\nChicago is a major center for theater and is the birthplace of modern improvisational comedy. The city is home to two renowned comedy troupes: The Second City and iO Theater (formerly known as ImprovOlympic). The form itself was invented at the University of Chicago in the 1950s by an undergraduate performance group called the Compass Players, whose members went on to found Second City. It was also home to one of the longest running plays in the country—the Neo-Futurists' Too Much Light Makes the Baby Go Blind, an ensemble of 30 plays in 60 minutes.\nSince their foundings in 1925 and 1974, Goodman Theatre, downtown, and Steppenwolf Theatre Company on the city's north side have nurtured generations of actors, directors, and playwrights. They have grown into internationally renowned companies of artists. Many other theaters, from nearly 100 black box performances spaces like the Strawdog Theatre Company in the Lakeview area to landmark downtown houses like the Chicago Theatre on State and Lake Streets, present a wide variety of plays and musicals, including touring shows and original works such as the premiere in December 2004 of Spamalot. The Chicago Shakespeare Theater, Lookingglass Theatre Company, and the Victory Gardens Theater have won regional Tony Awards, along with Goodman and Steppenwolf. Broadway In Chicago, created in July 2000, hosts touring productions and Broadway musical previews at: Bank of America Theatre, Cadillac Palace Theatre, Ford Center for the Performing Arts Oriental Theatre. Broadway In Chicago provides over 7,500 jobs and an economic impact of over $635 million.Burghart, Tara (January 16, 2007). \"Study Outlines Chicago Theater Impact\", San Francisco Chronicle. Polish language productions for Chicago's large Polish speaking population can be seen at the historic Gateway Theatre in Jefferson Park.\nThe Lyric Opera of Chicago, founded in 1954, performs in the Civic Opera House. The Civic Opera House was built in 1929 on the east bank of the South Branch of the Chicago River. The Lyric Opera purchased the Civic Opera House in 1993.\nThe Lithuanian Opera Company of Chicago was founded by Lithuanian Chicagoans in 1956, and presents operas in Lithuanian. It celebrated fifty years of existence in 2006, and operates as a not-for-profit organization. It is noteworthy for performing the rarely staged Rossini's William Tell (1986) and Ponchielli's I Lituani (1981, 1983 and 1991), and also for contributing experienced chorus singers to the Lyric Opera of Chicago.\nThe opera Jūratė and Kastytis by Kazimieras Viktoras Banaitis was presented in Chicago, Illinois in 1996.\nThe Joffrey Ballet makes its home in Chicago. Other ballet, modern and jazz dance troupes that are located in the city include Hubbard Street Dance Chicago, River North Chicago Dance Company, Gus Giordano Jazz Dance Chicago, Chicago Dance Crash, Thodos Dance Chicago, Chicago Festival Ballet and The Joel Hall Dancers.\nThe city's Uptown is reportedly the birthplace of Slam Poetry, a style of spoken word poetry that incorporates elements of hip hop culture, drama, jazz and lyricism.\nSports\nChicago is one of 13 metropolitan areas that have major league baseball, football, basketball, and hockey teams.  In four of these metropolitan areas the teams from all four sports play their games within the limits of one city — Chicago, Detroit,\nPhiladelphia, and Denver.  Four of the metropolitan areas have two baseball teams — Chicago, New York City, Los Angeles, and the San Francisco Bay Area — and of these four, only Chicago has had the same two teams since the American League was established in 1901.\nThe Chicago White Sox of the American League, who won the World Series in 1906, 1917, and 2005, play at Rate Field, located on the city's South Side in the Armour Square neighborhood.\nThe Chicago Cubs of the National League, who won the World Series in 1907, 1908, and 2016, play at Wrigley Field, located in the North Side neighborhood of Lakeview. The area of Lakeview near the stadium is commonly referred to as \"Wrigleyville.\"\nThe Chicago Bears of the National Football League play at Soldier Field. The Bears have won nine American Football championships (eight NFL Championships and Super Bowl XX) trailing only the Green Bay Packers, who have 13.\nThe Chicago Bulls of the National Basketball Association are one of the world's most recognized basketball teams, thanks to their enormous success during the Michael Jordan era, when they won six NBA titles in the 1990s. The Bulls play at the United Center on Chicago's Near West side.\nThe Chicago Blackhawks of the National Hockey League also play at the United Center. The Hawks are an Original Six franchise, founded in 1926, and have won six Stanley Cups, in 1934, 1938, 1961, 2010, 2013, and 2015.\nThe Chicago Fire FC, members of Major League Soccer, won one league and four US Open Cups since 1997. They play their home games at Soldier Field.\nThe Chicago Stars FC of the National Women's Soccer League play at SeatGeek Stadium.  The team was founded in 2009.\nThe Chicago Sky of the Women's National Basketball Association play at Wintrust Arena.  The Sky won the WNBA Championship in 2021.\nThe Chicago Wolves of the American Hockey League play at the Allstate Arena in nearby Rosemont. The Wolves won the league championships in 1998, 2000, 2002, and 2008. Their first season was 1994–95.\nOne NCAA Division I college football team plays in the Chicago area — the Northwestern Wildcats, in nearby Evanston.  Chicago-area college basketball teams competing at the Division I level are the Northwestern Wildcats, the DePaul Blue Demons, the Loyola Ramblers, the UIC Flames, and the Chicago State Cougars.\nMinor league baseball teams that play near Chicago include the Kane County Cougars, the Windy City ThunderBolts, the Schaumburg Boomers, the Joliet Slammers, the Gary SouthShore RailCats, and the Chicago Dogs.\nThe Chicago Bandits, a women's professional softball team, play their home games at Rosemont Stadium.\nThe Chicago Mustangs of the Major Arena Soccer League play at the Sears Centre in Hoffman Estates.\nThe Windy City Bulls are an NBA G League team affiliated with the Chicago Bulls.  They play their home games at the Sears Centre in Hoffman Estates.\nThe city is home to several roller derby leagues, including the Windy City Rollers and the Chicago Outfit.\nThe Chicago Swans are the Australian rules football club in the city, competing in the Mid American Australian Football League.\nRugby teams in the city include the Chicago Lions and the Chicago Griffins.\nThere are two facilities for auto racing near Chicago, both of them in Joliet. Chicagoland Speedway hosts NASCAR races, and the Route 66 Raceway is the site of drag racing events.\nThousands of long-distance runners from around the world compete in the Chicago Marathon each October.\nIn most of the U.S., softball is played with a 12-inch ball, but in Chicago 16-inch softball is more popular.\nChicago hosted the 1959 Pan American Games, and Gay Games VII in 2006. The city made an unsuccessful bid for the 2016 Summer Olympics, though it was heavily favored.\nVisual arts\nChicago is home to a lively fine arts community. A high concentration of contemporary art galleries can be found in the River North and West Loop neighborhoods, though a great amount of arts activity also centers around Ukrainian Village. Chicago visual art has had a strong individualistic streak, little influenced by outside fashions. \"One of the unique characteristics of Chicago,\" said Pennsylvania Academy of Fine Arts curator Bob Cozzolino, \"is there's always been a very pronounced effort to not be derivative, to not follow the status quo\", and arts pioneers such as Stanislav Szukalski who were tied to the \"Chicago Renaissance\" helped to fashion the city into a nexus for new trends in art.\nChicago has long had a strong tradition of figurative surrealism, as in the works of Ivan Albright and Ed Paschke. In 1968 and 1969, members of the Chicago Imagists, such as Roger Brown, Leon Golub, Robert Lostutter, Jim Nutt, and Barbara Rossi produced bizarre representational paintings. Today Robert Guinan paints gritty realistic portraits of Chicago people which are popular in Paris, although he is little known in Chicago itself.\nThese same impulses also appeared in Chicago's lively street photography scene, gaining notoriety through artists centered around the Institute of Design such as Harry Callahan, Aaron Siskind, as well as in the work of nanny-savant Vivian Maier. Bob Thall's beautiful, bleak photographs of Chicago-area architecture have also won much acclaim.\nChicago has a Percent for Art program of public artworks, although it is notoriously more opaque and secretive than that of most other cities; arts activist such as Paul Klein and attorney Scott Hodes have long criticized its lack of public accountability.\nChicago is home to a number of large, outdoor works by well-known artists. These include the Chicago Picasso, ''Miró's Chicago, Flamingo and Flying Dragon by Alexander Calder, Batcolumn by Claes Oldenburg, Cloud Gate by Anish Kapoor, Crown Fountain by Jaume Plensa, Man Enters the Cosmos by Henry Moore, Agora by Magdalena Abakanowicz, Fountain of Time by Lorado Taft, and the Four Seasons'' mosaic by Marc Chagall.\nArchitecture\nThe central part of Chicago was largely destroyed by the Chicago Fire in 1871.  Almost all the buildings currently standing in the city's downtown area were built after that, one exception being the Chicago Water Tower.\nAround the turn of the twentieth century, Chicago was a key location in the development of the skyscraper.  This movement was spearheaded by architects promoting the Chicago School design philosophy, including Louis Sullivan and others.  Notable tall buildings and skyscrapers built before the mid-1930s include the Rookery Building, the Auditorium Building, the Chicago Cultural Center, the Monadnock Building, the Reliance Building, the Sullivan Center, the Marquette Building, the Chicago Building, the Wrigley Building, Tribune Tower, the London Guarantee Building, 333 North Michigan, the Jewelers' Building, the Palmolive Building, the Carbide & Carbon Building, Riverside Plaza, the Merchandise Mart, and the Chicago Board of Trade Building.\nIn the 1940s, a modernist Second Chicago School of architecture emerged from the work of Ludwig Mies van der Rohe.  Buildings that he designed include 860–880 Lake Shore Drive, Crown Hall, 330 North Wabash, and the Kluczynski Federal Building.\nThe tallest buildings in Chicago are Willis Tower, Trump Tower, the St. Regis Chicago, the Aon Center, and the John Hancock Center.  Willis Tower was originally named Sears Tower, and was the tallest building in the world from 1973 to 1998.  It is now the third-tallest building in the United States, after One World Trade Center and Central Park Tower, though the height to the roof of Willis Tower is greater than that of One World Trade Center.\nOther architecturally significant modern and postmodern skyscrapers in Chicago include the Inland Steel Building, Marina City, Lake Point Tower, the CNA Center, 333 Wacker Drive, the Crain Communications Building, the Thompson Center, the Harold Washington Library, and Aqua.\nThe Prairie School of architecture originated in Chicago, which is home to a number of buildings by Frank Lloyd Wright and other Prairie School architects.  Examples include Robie House and the First Congregational Church of Austin.\nThe Pullman District was the first planned industrial community in the United States.\nSome neighborhoods in the city have many Chicago bungalow houses.  Built mostly between 1910 and 1940, these single-family homes are narrow, -story brick structures, with gables parallel to the street.\nLiterature\nEarly writers associated with Chicago include Theodore Dreiser, Eugene Field, Hamlin Garland, Edgar Lee Masters, and Frank Norris.  Poets have included Gwendolyn Brooks and Carl Sandburg. Other notable writers often associated with the city's literary tradition include Nelson Algren, Saul Bellow, John Dos Passos, James T. Farrell, Lorraine Hansberry, Ernest Hemingway, Upton Sinclair, Studs Terkel, and Richard Wright.\nPublic attractions\nthe T. rex in the foreground]]\nPopular public attractions in Chicago include the Museum of Science and Industry, the Field Museum of Natural History, Adler Planetarium, Shedd Aquarium, Lincoln Park Zoo, the Chicago History Museum, Millennium Park, and Navy Pier.\nThe city has a number of art museums, of which the two largest are the Art Institute and the Museum of Contemporary Art.\nOne weekend each August the city hosts the Chicago Air & Water Show, a free exhibition on the shores of Lake Michigan.\nFlag and municipal device\n]]\nThe flag of Chicago consists of four red stars and two blue stripes on a white background.  The stars represent events in the history of the city – the establishment of Fort Dearborn in 1803, the Chicago Fire in 1871, the World's Columbian Exposition in 1893, and the Century of Progress Exposition in 1933.  The stripes represent the North and South branches of the Chicago River.  The flag is very popular in the city, both for its bold design and as a sign of civic pride.\nLess well-known is the Chicago municipal device, a symbol that looks like the letter Y inside a circle.  According to the Municipal Code of Chicago, the device is \"for use by the varied unofficial interests of the city and its people\".  Its design is inspired by the confluence of the North, South, and main branches of the Chicago River at Wolf Point.  The municipal device can be seen in various places around the city – for example on the marquee of the Chicago Theatre.\nSee also\n*LGBT culture in Chicago\n*List of Chicago Landmarks\n*List of museums and cultural institutions in Chicago\n*Tourism in Chicago\nReferences\nFurther reading\n*"
    }
  ]
}