{
  "content": [
    {
      "type": "text",
      "text": "# Culture of Brittany\n\nThe culture of Brittany is the patterns of human activity and symbolism associated with the historical region of Brittany in northwestern France and the Breton people. Breton culture has been influenced by various local and nearby traditions over the centuries, including the Celtic culture of the Britons and Gauls and French culture to a lesser extent, particularly in Upper Brittany.\nModern day Brittany (, Gallo: Bertaeyn, ) is considered a historical region, which includes the Loire-Atlantique department. It was once independent as the Duchy of Brittany, with its capital in Nantes, and then it became duchy within the Kingdom of France before being ultimately integrated into France in 1491. Therefore, it is not meant to be confused with the administrative region of Brittany, which are the boundaries of Brittany as politically defined by France's historical Vichy regime since 1941. Brittany's strongest international connections tend to be in the United Kingdom, particularly in the Celtic Brythonic groups of Cornwall and Wales, and in Canada.\nLanguage\nThe languages traditionally spoken in Brittany are Breton, a Celtic language, and Gallo, a Romance language that forms part of the ''Langues d'oïl'' group. The region of Brittany used to be divided by an imaginary line into two subdivisions based on linguistic boundaries between Gallo and Breton. Upper Brittany is the area surrounding eastern Brittany, which is where the Gallo was predominant, and Lower Brittany is located in the west, where Breton was more widely spoken. It's worth noting the imaginary line has been constantly evolving due to Romance influence, but the line is considered to start in the commune Ploërmel. However, both languages have been on the decline in the region since the French Revolution, as the people who kept speaking them were seen as \"counterrevolutionary\" and the regional languages and dialects were heavily discouraged by the Government of France. Today, the main language of Brittany is French.\nBreton\nBreton is a Celtic language, part of the Brittonic branch.\nGallo\nGallo is a Romance language.\nCostume\n* bigouden\n* bagads\n* biniou\nFestivals\n*Fest noz\n*Festival Interceltique de Lorient\n*Kalan Goañv\nFlag\n* Flag of Brittany\nMusic\n* Bro Gozh ma Zadoù\n* Breton music\nSee also\n* Brittany\n* Breton people\n* Breton nationalism\n* Breton Americans\n* Reunification of Brittany\n* Celtic Nations\n* Modern celtic cultures\n* Celtic culture (disambiguation)\n* Culture of Cornwall\n* Culture of Wales\n* Culture of France\nExternal links\n* [https://web.archive.org/web/20110612022201/http://blog.breizh.bz/ BLOG BREIZH - Blog of information about Brittany]\n* [http://site.voila.fr/bretonnes/coiffe_2002/lorient.html Coiffe pictures. Le Festival Interceltique de Lorient 2002]\nFrench Wikipedia links\n*Culture bretonne\n*Lexique du costume breton"
    }
  ]
}