{
  "content": [
    {
      "type": "text",
      "text": "# Culture of Spain__disambig_1\n\nThe culture of Spain is influenced by its Western origin, its interaction with other cultures in Europe, its historically Catholic religious tradition, and the varied national and regional identities within the country. It encompasses literature, music, visual arts, cuisine as well as contemporary customs, beliefs, institutions, and social norms. Beyond Spain, Spanish culture is a major component of most Latin American cultures and an important influence on Filipino culture.\nHistory\nThe ancient peoples of Spain included Celts, Iberians, Celtiberians, Tartessians, Vascones, as well as Phoenician, Greek and Carthaginian colonies. From an early age, It was entirely conquered by Rome, becoming a province of the Roman Empire (Hispania). The ancient Romans left a lasting cultural, religious, political, legal and administrative legacy in Spanish history, being today the cultural basis of modern Spain. The subsequent course of Spanish history added new elements to the country's culture and traditions.\nThe Visgoths established a united Hispania and kept the Latin and Christian legacy in Spain between the fall of the Roman Empire and the Early Middle Ages. Muslim influences played a significant role during the Early Middle Ages in the areas conquered by the Umayyads. However, these influences were not completely assimilated into the Spanish culture, leading to conflicts and ultimately to the Christian Reconquista (\"Reconquest\") that would largely shape the culture of the country. After the definitive defeat of the Muslims during the Reconquista in 1492, Spain became again an entirely unified Roman Catholic country. In addition, the nation's history and its Mediterranean and Atlantic environment have played a significant role in shaping its culture, and also in shaping other cultures, such as the culture of Latin America through the colonization of the Americas.\n, around 85% of modern Spanish language vocabulary is derived from Latin, as happens in the other languages of Spain save Basque. Ancient Greek has also contributed substantially to Spanish vocabulary, especially through Latin, where it had a great impact. Spanish also features a sizeable vocabulary from Arabic and from other Romance languages, while the amount of influence from Basque and Celtic languages is controversial.\nSpain has one of the highest number of UNESCO World Heritage Sites in the world.\nLiterature\nThe term \"Spanish literature\" refers to literature written in the Spanish language, including literature composed by Spanish and Latin American writers. It may include Spanish poetry, prose, and novels.\nTragicomedia de Calisto y Melibea, also called \"La Celestina\"\nSpanish literature is the name given to the literary works written in Spain throughout time, and those by Spanish authors worldwide. Due to historic, geographic, and generational diversity, Spanish literature has a great number of influences and is very diverse. Some major movements can be identified within it.\nHighlights include the Cantar de Mio Cid, the oldest preserved Spanish cantar de gesta. It is written in medieval Spanish, the ancestor of modern Spanish.\nLa Celestina is a book published anonymously by Fernando de Rojas in 1499. This book is considered to be one of the greatest in Spanish literature, and traditionally marks the end of medieval literature and the beginning of the literary renaissance in Spain.\nBesides its importance in the Spanish literature of the Golden Centuries, Lazarillo de Tormes is credited with founding a literary genre, the picaresque novel, so called from Spanish pícaro, meaning \"rogue\" or \"rascal\". In these novels, the adventures of the pícaro expose injustice while simultaneously amusing the reader.\nPublished by Miguel de Cervantes in two volumes a decade apart, Don Quixote is the most influential work of literature to emerge from the Spanish Golden Age and perhaps the entire Spanish literary canon. As a founding work of modern Western literature, it regularly appears at or near the top of lists of the greatest works of fiction ever published.\nPainting and sculpture\nSpain's greatest painters during the Spanish Golden Age period included El Greco, Bartolomé Esteban Murillo, Diego Velázquez, and Francisco Goya, who became world-renowned artists between the period of the 17th century to 19th century also in early parts of the 20th century. However, Spain's best known artist since the 20th century has been Pablo Picasso, who is known for his abstract sculptures, drawings, graphics, and ceramics in addition to his paintings. Other leading artists include Salvador Dalí, Juan Gris, Joan Miró, and Antoni Tàpies.\nArchitecture\nis a work of Spanish Gothic architecture.]]\nDuring the Prehistoric period, the megalithic Iberian and Celtic architectures developed. Through the Roman period, both urban development (ex. the Emerita Augusta) and construction projects ( the Aqueduct of Segovia) flourished. After the pre-Romanesque period, in the architecture of Al-Andalus, important contributions were made by the Caliphate of Córdoba (the Great Mosque of Córdoba), the Taifas (Aljafería, in Zaragoza), the Almoravids and Almohads (La Giralda, Seville), and the Nasrid of the Kingdom of Granada (Alhambra, Generalife).\nLater, several currents appear: Mudéjar (the Alcázar of Seville), the Romanesque period (the Cathedral of Santiago de Compostela), the Gothic period (the Cathedrals of Burgos, León and Toledo), the Renaissance (Palace of Charles V in Granada), the Baroque period (Granada Cathedral), the Spanish colonial architecture, and Neoclassical style (ex. the Museo del Prado) are the most significant. In the 19th century eclecticism and regionalism, the Neo-Mudéjar style and glass architecture bloom. In the 20th century, the Catalan Modernisme (La Sagrada Família by Gaudí), modernist architecture, and contemporary architecture germinated.\nCinema\nIn recent years, Spanish cinema, including within Spain and Spanish filmmakers abroad, has achieved high marks of recognition as a result of its creative and technical excellence. In the long history of Spanish cinema, the great filmmaker Luis Buñuel was the first to achieve universal recognition, followed by Pedro Almodóvar in the 1980s. Spanish cinema has also seen international success over the years with films by directors like Segundo de Chomón, Florián Rey, Luis García Berlanga, Carlos Saura, Julio Medem and Alejandro Amenábar. Woody Allen, upon receiving the prestigious Prince of Asturias Award in 2002 in Oviedo remarked: \"when I left New York, the most exciting film in the city at the time was Spanish, Pedro Almodóvar's one. I hope that Europeans will continue to lead the way in filmmaking because at the moment not much is coming from the United States.\"\nNon-directors have obtained less international notability. Only the cinematographer Néstor Almendros, the actress Penélope Cruz and the actors Fernando Rey, Antonio Banderas, Javier Bardem and Fernando Fernán Gómez have obtained some recognition outside of Spain. Mexican actor Gael García Bernal has also recently received international attention in films by Spanish directors.\nToday, only 10 to 20% of box office receipts in Spain are generated by domestic films, a situation that repeats itself in many nations of Europe and the Americas. The Spanish government has therefore implemented various measures aimed at supporting local film production and movie theaters, which include the assurance of funding from the main national television stations. The trend is being reversed with the recent screening of mega productions such as the €30 million film Alatriste (starring Viggo Mortensen), the Academy Award-winning Spanish/Mexican film Pan's Labyrinth (El Laberinto del Fauno), Volver (starring Penélope Cruz), and Los Borgia (€10 million), all of them hit blockbusters in Spain.\nAnother aspect of Spanish cinema mostly unknown to the general public is the appearance of English-language Spanish films such as The Machinist (starring Christian Bale), The Others (starring Nicole Kidman), Basic Instinct 2 (starring Sharon Stone), and Miloš Forman's Goya's Ghosts (starring Javier Bardem and Natalie Portman). All of these films were produced by Spanish firms.\n{| cellpadding=\"1\" style=\"float:center; text-align:center; border:1px solid #88a; background:#f7f8ff; padding:5px; font-size: 95%; margin: 0 0 0.5em 1em; width:80%\"\n|-\n! Year\n! abbr=\"Total spectators\" | Total number of spectators (millions)\n! abbr=\"Spanish cinema spectators\" | Spectators of Spanish cinema (millions)\n! abbr=\"Percentage\" | Percentage\n! Film\n! abbr=\"Spectators\" | Spectators (millions)\n! abbr=\"Percentage\" | Percentage over the total of Spanish cinema\n|- style=\"background:#fff;\"\n!1996\n|96.1||10.4||10.8%||Two Much (Fernando Trueba)||2.1||20.2%\n|- style=\"background:#fff;\"\n!1997\n|107.1||13.9||14.9%||Airbag (Juanma Bajo Ulloa)||2.1||14.1%\n|- style=\"background:#fff;\"\n!1998\n|119.8||14.1||13.3%||Torrente, the stupid arm of the law (Santiago Segura)||3||21.3%\n|- style=\"background:#fff;\"\n!1999\n|131.3||18.1||16%||All About My Mother (Pedro Almodóvar)||2.5||13.8%\n|- style=\"background:#fff;\"\n!2000\n|135.3||13.4||11%||Commonwealth (Álex de la Iglesia)||1.6||11.9%\n|- style=\"background:#fff;\"\n!2001\n|146.8||26.2||17.9%||The Others (Alejandro Amenábar)||6.2||23.8%\n|- style=\"background:#fff;\"\n!2002\n|140.7||19.0||13.5%||The Other Side of the Bed (Emilio Martínez Lázaro)||2.7||14.3%\n|- style=\"background:#fff;\"\n!2003\n|137.5||21.7||15.8%||Mortadelo & Filemón: The Big Adventure (Javier Fesser)||5.0||22.9%\n|- style=\"background:#fff;\"\n!2004\n|143.9||19.3||13.4%||The Sea Inside (Alejandro Amenábar)||4.0||20.7%\n|- style=\"background:#fff;\"\n!2005\n|126.0||21.0||16.7%||Torrente 3: The Protector (Santiago Segura)||3.6||16.9%\n|- style=\"background:#fff;\"\n!2006 (provisional)\n|67.8||6.3||9.3%||Volver (Pedro Almodóvar)||1.8||28.6%\n|}\nLanguages\nSpain is a multilingual country with a relatively complex sociolinguistic situation. According to the article 3 of the 1978 Constitution, Spanish is the official language of the State, while other languages may also be official in autonomous communities according to the latter's regional statutes, as it is the case with Catalan/Valencian, Basque and Galician. Spanish, a Romance language, has become the hegemonic language in Spain. It has also become a global language (with the majority of its speakers now located outside of Spain, most of them in Latin America) and one of six official languages of the United Nations. Its current hegemony in Spain is subtly fostered by neoliberal discourses on educational choice, flexibility and competition.\nAnother Romance language, Catalan is a co-official language in the autonomous communities of the Balearic Islands, Catalonia and the Valencian Community (where it is known as Valencian). It is also spoken in parts of the autonomous communities of Aragon (in La Franja) and Murcia (in El Carche). While most of the native speakers of Catalan are located in Spain, the language is also natively spoken in the microstate of Andorra and parts of Italy (Alghero) and France (Roussillon). Galician is a language of the Western Ibero-Romance branch closely related to Portuguese, spoken in the autonomous community of Galicia (where it enjoys co-officiality along Spanish) and small areas in neighbouring Asturias and Castile and León.\nAranese, a standardized form of the Pyrenean Gascon variety of the Occitan language, is spoken in the Val d'Aran in northwestern Catalonia together with Spanish and Catalan, enjoying official recognition. Other Romance languages of Spain include, Astur-Leonese, Aragonese, Extremaduran, Fala language and Quinqui jargon. Caló language, considered a mixed Romani-Romance language, is spoken by a number of Spanish Romani.\nConsidered to be a language isolate relative to any other known living language, Basque is a non-Indoeuropean language co-official together with Spanish in the Basque autonomous community and in the northern part of Navarre.\nRegarding the Spanish autonomous cities in North Africa, the largely rural variety of vernacular Moroccan \"Darija\" Arabic characteristic of Jbala is spoken together with Spanish in Ceuta, whereas tamazight is spoken in Melilla in addition to Spanish.\nReligion\nin Sevilla.]]\nAbout 56% of Spaniards identify as belonging to the Roman Catholic religion; 3% identify with another religious faith, and about 39% as non-religious.\nHolidays\nAn important Spanish holiday is \"Semana Santa\" (Holy Week), celebrated the week before Easter with large parades and other religious events. Spaniards also hold patronal festivals to honor their local saints in churches, cities, towns and villages. The people decorate the streets, build bonfires, set off fireworks and hold large parades, bullfights, and beauty contests.\nOne of the best-known Spanish celebrations is the \"festival of San Fermin,\" which is celebrated every year in July in Pamplona. Bulls are released into the streets, while people run ahead of the animals to the bullring.\nSports\nvs Barcelona, known as El Clásico, in May 2009]]\nAssociation football is the most popular sport in Spain, with notable teams including Real Madrid and Barcelona, who rank amongst the most successful and prestigious clubs in world football. Other notable Spanish clubs include Atlético Madrid, Sevilla, Athletic Bilbao and Valencia CF. The top division of Spanish football, La Liga, has featured several of the most outstanding players of all time, such as Johan Cruyff, Diego Maradona, Zinedine Zidane, Ronaldo, Ronaldinho, Lionel Messi and Cristiano Ronaldo, the latter two often being featured in debates concerning the greatest player ever. The Spain national football team have won three UEFA European Championship titles and the FIFA World Cup in 2010. Spain is one of only eight countries ever to have won the FIFA World Cup, doing so in South Africa in 2010, the first time the team had reached the final.\nVarious other sports are highly popular in Spain as well, including basketball, tennis, cycling, padel, and handball.\nCuisine\nmixta]]\nA significant portion of Spanish cuisine derives from the Roman tradition. The Moorish people were a strong influence in a part of Spain for many centuries. Several ingredients from the Americas were introduced to Europe through Spain during the so-called Columbian exchange, and a modern Spanish cook could not do without potatoes, tomatoes, peppers, and beans. These are some of the primary influences that have differentiated Spanish cuisine from Mediterranean cuisine, of which Spanish cuisine shares many techniques and food items.\n]]\nThe essential ingredient for real Spanish cooking is olive oil, as Spain produces 44% of the world's olives. However, butter or lard are also important, especially in the north.\nDaily meals eaten by Spaniards in many areas of the country are still very often made traditionally by hand, from fresh ingredients bought daily from the local market. This practice is more common in the rural areas and less common in the large urban areas like Barcelona or Madrid, where supermarkets are beginning to displace the open air markets. However, even in Madrid food can be bought from the local shops; bread from the \"panadería\" and meat from the \"carnicería\".\nOne popular custom when going out is to be served tapas with a drink, including sherry, wine and beer. In some areas, such as Almería, Granada or Jaén in Andalusia, and Madrid, León, Salamanca or Lugo tapas are given for free with a drink and have become very well known for that reason. Almost every bar serves something edible when a drink is ordered, without charge. However many bars exist primarily to serve a purchased \"tapa\".\nAnother traditional favorite is the churro with a mug of thick hot chocolate to dip churros in. \"Churrerías,\" or stores that serve churros, are quite common. The Chocolatería San Ginés in Madrid is especially famous as a place to stop and have some chocolate with churros, often late into the night (even dawn), after being out on the town. Often traditional Spanish singers and musicians will entertain the guests. [http://www.spain-info.com/madrid/Classic-Cafes-Madrid.html]\nAs is true in many countries, the cuisines of Spain differ widely from one region to another, even though they all share certain common characteristics, which include:\n* The use of olive oil as a cooking ingredient in items such as fritters. It is also used raw.\n* The use of sofrito to start the preparation of many dishes.\n* The use of garlic and onions as major ingredients.\n* The custom of drinking wine during meals.\n* Serving bread with the vast majority of meals.\n* Consumption of salad, especially in the summer.\n* The consumption of a piece of fruit or a dairy product as dessert. Desserts such as tarts and cake are typically reserved for special occasions.\nEducation\nThe Spanish educational system follows a highly decentralized model. In a gradual manner, most powers over education policies were transferred to the autonomous communities. The regional public administrations are thus responsible for education policies, funding and expenditure allocation.\nAs of 2020, the overarching educative legislation is regulated by the  (LOMCE), an organic law.\nRelative to the average in European countries, Spain has a low share of students in public centres in both primary (69% of students in public centres) and secondary education (68%). This is largely due to the salient role of the so-called \"educación concertada\", which allows for privately owned centres funded by public money.\n]]\n]]\n]]\n]]\n]]\nObligatory education\n{| class=\"wikitable\"\n|-\n!\n! Age\n! Name\n|-\n| rowspan=6| Primary Education\n| 5-6\n| 1st grade\n|-\n| 6-7\n| 2nd Grade\n|-\n|8-9\n| 3rd Grade\n|-\n|9-10\n| 4th Grade\n|-\n|10-11\n| 5th Grade\n|-\n|11-12\n| 6th Grade\n|-\n|rowspan=5| Secondary School\n|-\n|12-13\n| 1º ESO\n|-\n|13-14\n| 2º ESO\n|-\n|14-15\n| 3º ESO\n|-\n|15-16\n| 4º ESO\n|}\nOptional education: Bachillerato\nBachillerato is usually taken if people aspire to go to college.\n* Common Subjects are in red\n* Optional Subjects are in pink\n* Modality Subjects are in blue\n* Technology Via are in yellow\n* Natural Sciences Via are in green\n* Humanities Via are in olive\n* Social Sciences Via are in brown\n* Arts Via are in beige\n{| class=\"wikitable\"\n|- style=\"text-align:center;\"\n! Natural Sciences/Technology\n! Humanities and Social Sciences\n! Arts\n|- style=\"text-align:center;\"\n| style=\"background:green;\"|Physics\n| colspan=\"2\" style=\"background:#d2691e;\"|History/Geography\n|- style=\"text-align:center;\"\n| style=\"background:green;\"|Chemistry\n| style=\"background:#d2691e;\"|Economy\n| style=\"background:khaki;\"|Technical drawing\n|- style=\"text-align:center;\"\n| style=\"background:green;\"|Biology\n| style=\"background:#d2691e;\"|Maths\n| style=\"background:khaki;\"|Painting\n|- style=\"text-align:center;\"\n| style=\"background:yellow;\"|Maths\n| style=\"background:olive;\"|Latin\n| style=\"background:khaki;\"|Sculpture\n|- style=\"text-align:center;\"\n| style=\"background:yellow;\"|Technology\n| style=\"background:olive;\"|Ancient Greek\n| style=\"background:khaki;\"|Audiovisual\n|- style=\"text-align:center;\"\n| style=\"background:yellow;\"|Technical drawing\n| colspan=\"2\" style=\"background:Khaki;\"|Art History\n|- style=\"text-align:center;\"\n| colspan=\"3\" style=\"background:pink;\"|2nd Foreign Language French, German, Italian\n|- style=\"text-align:center;\"\n| colspan=\"3\" style=\"background:pink;\"|Communication and Information Technologies\n|- style=\"text-align:center;\"\n| colspan=\"3\" style=\"background:pink;\"|Psychology\n|- style=\"text-align:center;\"\n| colspan=\"3\" style=\"background:#f08080;\"|Spanish Language\n|- style=\"text-align:center;\"\n| colspan=\"3\" style=\"background:#f08080;\"|Philosophy\n|- style=\"text-align:center;\"\n| colspan=\"3\" style=\"background:#f08080;\"|First Foreign Language\n|- style=\"text-align:center;\"\n| colspan=\"3\" style=\"background:#f08080;\"|Physical Education only the first year\n|- style=\"text-align:center;\"\n| colspan=\"3\" style=\"background:#f08080;\"|Autonomical Languages (only in the autonomies where is spoken) Catalan, Valencian, Basque, Galician\n|- style=\"text-align:center;\"\n| colspan=\"3\" style=\"background:#f08080;\"|Religion only the first year\n|}\nCultural diplomacy\nThe cultural diplomacy of Spain has set European integration and Ibero-American relations among its main goals. It has used branding strategies such as the so-called . Since the 1980s, Spain has taken part in a number of \"horizontal\" initiatives as member of multilateral international organizations of the Ibero-American space such as the Organization of Ibero-American States (OEI, which was repurposed in 1985) and the Ibero-American General Secretariat (SEGIB).\nSimilarly to other European countries, Spain has used the model of cultural institute (in the case of Spain the Instituto Cervantes) as leading tool for cultural diplomacy, with common aims such as the dissemination of the country brand, cultural exchange and cooperation, and linguistic and educational promotion.\nNationalisms and regionalisms\nA strong sense of national identity exists in many autonomous communities. These communities—even those that least identify themselves as Spanish—have contributed greatly to many aspects of mainstream Spanish culture.\nMost notably, the Basque Country and Catalonia have widespread nationalist sentiment. Many Basque and Catalan nationalists demand statehood for their respective territories. Basque aspirations to statehood have been a cause of violence (notably by ETA), although most Basque nationalists (like virtually all Catalan nationalists) currently seek to fulfill their aspirations peacefully.\nThere are also several communities where there is a mild sense of national identity (but a great sense of regional identity): Galicia, Andalusia, Asturias, Navarre (linked to Basque culture), Aragon, Balearic Islands and Valencia (the last two feeling attached to Catalan culture in different ways) each have their own version of nationalism, but generally with a smaller percentage of nationalists than in the Basque Country and Catalonia.\nThere is some traction in the province of León pushing to separate from Castile and León, possibly together with the provinces of Zamora and Salamanca.\nSpain has a long history of tension between centralism and nationalism. The current organisation of the state into autonomous communities (similar to a federal organization) under the Spanish Constitution of 1978 is intended as a way to incorporate these communities into the state.\nFile:Alderdieguna05.jpg\nFile:08.10.2017 Manifestació \"Prou! Recuperem el seny\" - Barcelona 13.jpg\nFile:Mani Som una Nacio 20060218 c.png\nFile:Non aos recortes no ensino.JPG\nHistorical Spanish clothing\nFile:Dress MET 36.88 F.jpg|Spanish dress, 18th century, silk. Metropolitan Museum of Art.\nFile:Dress MET CI51.74.1 F.jpg|Spanish dress, 1802, silk, metal. Metropolitan Museum of Art.\nFile:The Spanish lady (1878), by John Bagnold Burgess.jpg|La Señorita, 1878, by John Bagnold Burgess, Spain.\nSee also\n* List of cultural icons of Spain\n* Culture\n** Outline of culture\n* Outline of Spain\n* Iberians\n* History of Spain\n* Music of Spain\nReferences\nExternal links\n* [http://www.spainisculture.com/en/ Official Spanish Culture Website] 162,000 pages of information.\n* Articles about [http://www.donquijote.org/culture/ Spanish Culture]\n* News about [https://www.theolivepress.es/spain-news/category/other-news/la-cultura/ Spanish Culture]"
    }
  ]
}