{
  "content": [
    {
      "type": "text",
      "text": "# Culture of New Mexico\n\n(a ristra) and a bleached white cow's skull hang in a market near Santa Fe.]]\n, which is among the most recognizable in the U.S., reflects the state's eclectic origins, featuring the ancient sun symbol of the Zia, a Puebloan tribe, with the scarlet and gold coloration of the Spanish flag.]]\nThe culture of New Mexico is a unique fusion of Native American, Spanish, Mexican and U.S. culture which makes up part of the broader culture of the United States. The confluence of indigenous, Hispanic (Spanish and Mexican), and American influences is also evident in New Mexico's unique cuisine, New Mexican Spanish, New Mexico music, and Pueblo Revival and Territorial styles of architecture. There are more World Heritage Sites in New Mexico than any other U.S. state. New Mexico is one of only seven majority-minority states, with the nation's highest percentage of Hispanic and Latino Americans and the second-highest percentage of Native Americans, after Alaska. The state is home to one-third of the Navajo Nation, 19 federally recognized Pueblo communities, and three federally recognized Apache tribes. Its large Latino population includes Hispanos descended from settlers during the Spanish era,  and later groups of Mexican Americans since the 19th century.\nNew Mexico is an important center of Native American culture. The state bears some of the oldest evidence of human habitation, with thousands of years of indigenous heritage giving way to centuries of successive migration and settlement by Spanish, Mexican, and Anglo-American colonists. The intermingling of these diverse groups is reflected in New Mexico's demographics, toponyms, cuisine, dialect, and identity. Some 200,000 residents, about one-tenth of the population, are of Indigenous descent, ranking third in size, and second proportionally, nationwide. There are 23 federally recognized tribal nations, each with its distinct culture, history, and identity. Both the Navajo and Apache share Athabaskan origin, with the latter living on three federal reservations in the state. The Navajo Nation, which spans over 16 million acres (6.5&nbsp;millionha), mostly in neighboring Arizona, is the largest reservation in the U.S., with one-third of its members living in New Mexico. Pueblo Indians, who share a similar lifestyle but are culturally and linguistically distinct, live in 19 pueblos scattered throughout the state, which collectively span over . The Puebloans have a long history of independence and autonomy, which has shaped their identity and culture. Many indigenous New Mexicans have moved to urban areas throughout the state, and some cities such as Gallup are major hubs of Native American culture. New Mexico is also a hub for indigenous communities beyond its borders: the annual Gathering of Nations, which began in 1983, has been described as the largest pow wow in the U.S., drawing hundreds of native tribes from across North America.\nCompared to other Western states, New Mexico's Spanish and Mexican heritage remain more visible and enduring, due to it having been the oldest, most populous, and most important province in New Spain's northern periphery. However, some historians allege that this history has been understated or marginalized by persistent American biases and misconceptions towards Spanish colonial history. Almost half of New Mexicans claim Hispanic origin; many are descendants of colonial settlers called Hispanos or Neomexicanos, who settled mostly in the north of the state between the 16th and 18th centuries; by contrast, the majority of Mexican immigrants reside in the south. Some Hispanos claim Jewish ancestry through descendance from conversos or Crypto-Jews among early Spanish colonists. Many New Mexicans speak a unique dialect known as New Mexican Spanish, which was shaped by the region's historical isolation and various cultural influences; New Mexican Spanish lacks certain vocabulary from other Spanish dialects and uses numerous Native American words for local features, as well as anglicized words that express American concepts and modern inventions.\nLike other states in the American Southwest, New Mexico bears the legacy of the \"Old West\" period of American westward expansion, characterized by cattle ranching, cowboys, pioneers, the Santa Fe Trail, and conflicts among and between settlers and Native Americans. The state's vast and diverse geography, sparse population, and abundance of ghost towns have contributed to its enduring frontier image and atmosphere. Many fictional works of the Western genre are set or produced in New Mexico. The state's distinct culture and image are reflected in part by the fact that many Americans do not know it is part of the U.S.; this misconception variably elicits frustration, amusement, or even pride among New Mexicans as evidence of their unique heritage.\nArchitecture\nExamples of New Mexico's architectural history date back to the Ancestral Puebloans within Oasisamerica. The Hispanos of New Mexico adapted the Pueblo architecture style within their own buildings, and following the establishment of Albuquerque in 1706, the Territorial Style of architecture blended the styles. Rural communities incorporated both building types into a New Mexico vernacular style, further exemplifying the indigenous roots of New Mexico. After statehood, the modern Pueblo Revival and Territorial Revival architectural styles became more prevalent, with these revival architectures becoming officially encouraged since the 1930s. These styles have been blended with other modern styles, as happened with Pueblo Deco architecture, within modern contemporary New Mexican architecture.\nArt, literature, and media\nThe earliest New Mexico artists whose work survives today are the Mimbres Indians, whose black and white pottery could be mistaken for modern art, except for the fact that it was produced before 1130 CE. Many examples of this work can be seen at the Deming Luna Mimbres Museum and at the Western New Mexico University Museum.\nSanta Fe has long hosted a thriving artistic community, which has included such prominent figures as Bruce Nauman, Richard Tuttle, John Connell, Steina Vasulka and Ned Bittinger. The capital city has several art museums, including the New Mexico Museum of Art, Museum of Spanish Colonial Art, Museum of International Folk Art, Museum of Indian Arts and Culture, Museum of Contemporary Native Arts, SITE Santa Fe and others. Colonies for artists and writers thrive, and the small city teems with art galleries. In August, the city hosts the annual Santa Fe Indian Market, which is the oldest and largest juried Native American art showcase in the world. Performing arts include the Santa Fe Opera, which presents five operas in repertory each July to August; the Santa Fe Chamber Music Festival held each summer; and the restored Lensic Theater, a principal venue for many kinds of performances. The weekend after Labor Day boasts the burning of Zozobra, a fifty-foot (15m) marionette, during Fiestas de Santa Fe.\n, viewed from the mezzanine]]\nAs New Mexico's largest city, Albuquerque hosts many of the state's leading cultural events and institutions, including the New Mexico Museum of Natural History and Science, the National Hispanic Cultural Center, the National Museum of Nuclear Science & History, and the famed annual Albuquerque International Balloon Fiesta. The National Hispanic Cultural Center has held hundreds of performing arts events, art showcases, and other events related to Spanish culture in New Mexico and worldwide in the centerpiece Roy E Disney Center for the Performing Arts or in other venues at the 53-acre facility. New Mexico residents and visitors alike can enjoy performing art from around the world at Popejoy Hall on the campus of the University of New Mexico. Popejoy Hall hosts singers, dancers, Broadway shows, other types of acts, and Shakespeare. Albuquerque also has the unique and iconic KiMo Theater built in 1927 in the Pueblo Revival Style architecture. The KiMo presents live theater and concerts as well as movies and simulcast operas. In addition to other general interest theaters, Albuquerque also has the African American Performing Arts Center and Exhibit Hall which showcases achievements by people of African descent and the Indian Pueblo Cultural Center which highlights the cultural heritage of the First Nations people of New Mexico.\nin the old mission church, Jemez State Monument ]]\nNew Mexico holds strong to its Spanish heritage. Old Spanish traditions such zarzuelas and flamenco are popular;  the University of New Mexico is the only institute of higher education in the world with a program dedicated to flamenco. Flamenco dancer and native New Mexican María Benítez founded the Maria Benítez Institute for Spanish Arts \"to present programs of the highest quality of the rich artistic heritage of Spain, as expressed through music, dance, visual arts, and other art forms\". There is also the annual Festival Flamenco Internacional de Alburquerque, where native Spanish and New Mexican flamenco dancers perform at the University of New Mexico; it is the largest and oldest flamenco event outside of Spain.\nIn the mid-20th century, there was a thriving Hispano school of literature and scholarship being produced in both English and Spanish. Among the more notable authors were: Angélico Chávez, Nina Otero-Warren, Fabiola Cabeza de Baca, Aurelio Espinosa, Cleofas Jaramillo, Juan Bautista Rael, and Aurora Lucero-White Lea. As well, writer D. H. Lawrence lived near Taos in the 1920s, at the D. H. Lawrence Ranch, where there is a shrine said to contain his ashes.\nNew Mexico's strong Spanish, Anglo, and Wild West frontier motifs have contributed to a unique body of literature, represented by internationally recognized authors such as Rudolfo Anaya, Tony Hillerman, and Daniel Abraham. Western fiction folk heroes Billy the Kid, Elfego Baca, Geronimo, and Pat Garrett originate in New Mexico. These same Hispanic, indigenous, and frontier histories have given New Mexico a place in the history of country and Western music, with its own New Mexico music genre, including the careers of Al Hurricane, Robert Mirabal, and Michael Martin Murphey.\nSilver City, originally a mining town, is now a major hub and exhibition center for large numbers of artists, visual and otherwise. Another former mining town turned art haven is Madrid, New Mexico, which was brought to national fame as the filming location for the 2007 movie Wild Hogs. Las Cruces, in southern New Mexico, has a museum system affiliated with the Smithsonian Institution Affiliations Program, and hosts a variety of cultural and artistic opportunities for residents and visitors.\nThe Western genre immortalized the varied mountainous, riparian, and desert environment into film. Owing to a combination of financial incentives, low cost, and geographic diversity, New Mexico has long been a popular setting or filming location for various films and television series. In addition to Wild Hogs, other movies filmed in New Mexico include Sunshine Cleaning and Vampires. Various seasons of the A&E/Netflix series Longmire were filmed in several New Mexico locations, including Las Vegas, Santa Fe, Eagle Nest, and Red River. The widely acclaimed Breaking Bad franchise was set and filmed in and around Albuquerque, a product of the ongoing success of media in the city in large part helped by Albuquerque Studios, and the presence of production studios like Netflix and NBCUniversal.\nCuisine\nNew Mexico is known for its unique and eclectic culinary scene, which fuses various indigenous cuisines with those of Spanish and Mexican Hispanos originating in Nuevo México. Like other aspects of the state's culture, New Mexican cuisine has been shaped by a variety of influences from throughout its history; consequently, it is unlike Latin food originating elsewhere in the contiguous United States. Distinguishing characteristics include the use of local spices, herbs, flavors, and vegetables, particularly red and green New Mexico chile peppers, anise (used in bizcochitos), and piñon (pine nuts).\nAmong the dishes unique to New Mexico are frybread-style sopapillas, breakfast burritos, enchilada montada (stacked enchiladas), green chile stew, carne seca (a thinly sliced variant of jerky), green chile burgers, posole (a hominy dish), slow-cooked frijoles (beans, typically pinto beans), calabacitas (sautéed zucchini and summer squash), and carne adovada (pork marinated in red chile). The state is also the epicenter of a burgeoning Native American culinary movement, in which chefs of indigenous descent serve traditional cuisine through food trucks.\nNew Mexican Spanish\nNew Mexican Spanish (), or New Mexican and Southern Colorado Spanish, refers to the varieties of Spanish spoken in the United States in New Mexico and southern Colorado. It includes an endangered traditional indigenous dialect spoken generally by Oasisamerican peoples and Hispano—descendants, who live mostly in New Mexico, southern Colorado, in Pueblos, Jicarilla, Mescalero, the Navajo Nation, and in other parts of the former regions of Nuevo Mexico and the New Mexico Territory.\nDue to New Mexico's unique political history and over 400 years of relative geographic isolation, New Mexican Spanish is unique within Hispanic America, with the closest similarities found only in certain rural areas of northern Mexico and Texas; it has been described as unlike any form of Spanish in the world. This dialect is sometimes called Traditional New Mexican Spanish, or the Spanish Dialect of the Upper Rio Grande Region, to distinguish it from the relatively more recent Mexican variety spoken in the south of the state and among more recent Spanish-speaking immigrants.\nThe Spanish language first arrived in present-day New Mexico with Juan de Oñate's colonization expedition in 1598, which brought 600-700 settlers. Almost half the early settlers were from Spain, including many from New Spain, with most of the rest from various parts of Latin America, the Canary Islands, and Portugal. Following the Pueblo Revolt in 1680, New Mexico was resettled again starting in 1692, primarily by refugees from the Pueblo Revolt and others born in northern New Spain. The Spanish-speaking areas with which New Mexico had the greatest contact were Chihuahua and Sonora.\nLikely as a result of these historical origins and connections, Traditional New Mexican Spanish shares many morphological features with the rural Spanish of Chihuahua, Sonora, Durango, and other parts of Mexico. Colonial New Mexico was very isolated and had widespread illiteracy, resulting in most New Mexicans of the time having little to no exposure to \"standard\" Spanish. This linguistic isolation facilitated New Mexican Spanish's preservation of older vocabulary as well as its own innovations.\nDuring that time, contact with the rest of Spanish America was limited because of the Comancheria, and New Mexican Spanish developed closer trading links to the Comanche than to the rest of New Spain. In the meantime, some Spanish colonists co-existed with and intermarried with Puebloan peoples and Navajos, also enemies of the Comanche.\nLike most languages, New Mexican Spanish gradually evolved. As a result the Traditional New Mexican Spanish of the 20th and 21st centuries is not identical to the Spanish of the early colonial period. Many of the changes that occurred in older New Mexican Spanish are reflected in writing. For example, New Mexican Spanish speakers born before the Pueblo Revolt were generally not yeístas; that is, they pronounced the  and  sounds differently. After the Pueblo Revolt, New Mexico was re-settled with many new settlers coming in from central Mexico, in addition to returning New Mexican colonists. These new settlers generally did merge the two sounds, and dialect leveling resulted in later generations of New Mexicans consistently merging  and . Colonial New Mexican Spanish also adopted some changes which occurred in the rest of the Spanish speaking world, like the elimination of the future subjunctive tense and the second-person forms of address  and ; while the standard subjunctive form  and the nonstandard form  of the auxiliary verb  have always coexisted in New Mexican Spanish, the prevalence of the nonstandard  increased significantly over the colonial period.\nBefore the middle of the 18th century, there is little evidence of the deletion and occasional epenthesis of  and  in contact with front vowels, although that is a characteristic of modern New Mexican and northern Mexican Spanish. The presence of such deletion in areas close and historically connected to New Mexico makes it unlikely that New Mexicans independently developed this feature. Although colonial New Mexico had a very low rate of internal migration, trade connections with Chihuahua were strengthening during this time. Many of the people who moved into New Mexico were traders from Chihuahua, who became socially very prominent. They likely introduced the weakening of  and  to New Mexico, where it was adapted by the rest of the community.\nNew Mexico's 1848 annexation by the U.S. led to a greater exposure to English. Nevertheless, the late-19th-century saw the development of print media, which allowed New Mexican Spanish to resist assimilation toward American English for many decades. The 1911 Encyclopædia Britannica, for instance, noted, \"About one-tenth of the Spanish-American and Indian population [of New Mexico] habitually use the English language.\" At the beginning of the 20th century, there was an attempt by both Anglos and Hispanos to link New Mexico's history and language to Spain rather than Mexico. This led to the occasional use of  rather than  in some newspaper ads. Since  isn't actually part of New Mexican Spanish, in these advertisements it was used interchangeably with , occasionally with both being used in the same ad. That artificial usage differs drastically from the natural usage of  in Spain.\nAfter 1917, Spanish usage in the public sphere began to decline and it was banned in schools, with students often being punished for speaking the language. This punishment was occasionally physical. Newspapers published in Spanish switched to English or went out of business. From then on, Spanish became a language of home and community. The advance of English-language broadcast media accelerated the decline. Since then, New Mexican Spanish has been undergoing a language shift, with Hispanos gradually shifting towards English. In addition, New Mexican Spanish faces pressure from Standard and Mexican Spanish. Younger generations tend to use more Anglicisms and Mexican and standard Spanish forms. The words most characteristic of Traditional New Mexican Spanish, with few exceptions, are less likely to be found in the speech of young people. This is in part due to language attrition. The decline in Spanish exposure in the home creates a vacuum, into which \"English and Mexican Spanish flow easily.\"\npublished the first dictionary of New Mexican Spanish, A Dictionary of New Mexico and Southern Colorado Spanish.]]\nIn 1983 New Mexican linguist and folklorist Rubén Cobos published the first dictionary of New Mexican Spanish, A Dictionary of New Mexico and Southern Colorado Spanish. Cobos wrote in the introduction that\nAmong the distinctive features of New Mexican Spanish are the preservation of archaic forms and vocabulary from colonial-era Spanish (such as  instead of  or , instead of ); the borrowing of words from Puebloan languages, in addition to the Nahuatl loanwords brought by some colonists (such as , or \"obsidian flake\", from Tewa and , or buffalo, from Zuni); independent lexical and morphological innovations; and a large proportion of English loanwords, particularly for technology (such as , , and ).\nNowadays the New Mexican Spanish of northern New Mexico, including Albuquerque, is being heavily influenced by Mexican Spanish, incorporating numerous Mexicanisms, while at the same time retaining some archaisms characteristic of traditional New Mexican Spanish. The use of Mexicanisms is most prominent in Albuquerque and Santa Fe, compared to other areas in the north. Some older Spanish speakers have noted Mexican immigrants showing surprise at non-immigrants speaking Spanish. In Albuquerque, the use of Mexicanisms correlates only with age, with younger speakers, regardless of their parents' background, being more likely to use Mexicanisms. Today many native speakers of New Mexican Spanish use the language largely as a sacred language, with many traditional devotions and prayers being in Spanish, and many native speakers are actively using the language with their children. Some experts fear the dialect is threatened with extinction over the next few decades; due to rural flight from the isolated communities that preserved it, the growing influence of Mexican Spanish, and intermarriage and interaction between Hispanos and Mexican immigrants. The traditional dialect has increasingly mixed with contemporary varieties, resulting in a new dialect sometimes called . Today, the language can be heard in a popular folk genre called New Mexico music and preserved in the traditions of New Mexican cuisine.\nSports\n]]\nNo major league professional sports teams are based in New Mexico, but the Albuquerque Isotopes are the Pacific Coast League baseball affiliate of the MLB Colorado Rockies. The state hosts several baseball teams of the Pecos League: the Roswell Invaders, Ruidoso Osos, Santa Fe Fuego and the White Sands Pupfish. The Duke City Gladiators of the Indoor Football League (IFL) plays their home games at Tingley Coliseum in Albuquerque; the city also hosts two soccer teams: New Mexico United, which began playing in the second tier USL Championship in 2019, and the associated New Mexico United U23, which plays in the fourth tier USL League Two.\nCollegiate athletics are the center of spectator sports in New Mexico, namely the rivalry between various teams of the University of New Mexico Lobos and the New Mexico State Aggies. The intense competition between the two teams is often referred to as the \"Rio Grande Rivalry\" or the \"Battle of I-25\" (in reference to both campuses being located along that highway). NMSU also has a rivalry with the University of Texas at El Paso called \"The Battle of I-10\". The winner of the NMSU-UTEP football game receives the Silver Spade trophy.\nOlympic gold medalist Tom Jager, an advocate of controversial high-altitude training for swimming, has conducted training camps in Albuquerque at 5,312 feet (1,619m) and Los Alamos at 7,320 feet (2,231m).\nNew Mexico is a major hub for various shooting sports, mainly concentrated in the NRA Whittington Center in Raton, which is largest and most comprehensive competitive shooting range and training facility in the U.S.\nHistoric Sites\nOwing to its millennia of habitation and over two centuries of Spanish colonial rule, New Mexico features a significant number of sites with historical and cultural significance. Forty-six locations across the state are listed by the U.S. National Register of Historic Places, the 18th highest of any state.\nNew Mexico has nine of the country's 84 national monuments, which are sites federally protected by presidential proclamation; this is the second-highest number after Arizona. The monuments include some of the earliest to have been created: El Morro and Gila Cliff Dwellings, proclaimed in 1906 and 1907, respectively; both preserve the state's ancient indigenous heritage.\nNew Mexico is one of 20 states with a UNESCO World Heritage Site, and among only eight with more than one. Excluding sites shared between states, New Mexico has the most World Heritage Sites in the country, with three exclusively within its territory.\nHumor\nSince 1970, New Mexico Magazine has had a standing feature, One of Our 50 Is Missing , which relates often humorous anecdotes about instances in which people elsewhere do not realize New Mexico is a state, confuse it with the nation of Mexico, or otherwise mistake it as being a foreign country. The state's license plates say \"New Mexico USA\", so as to avoid confusion with Mexico, which it borders to the southwest. New Mexico is the only state that specifies \"USA\" on its license plates.\nNotes\nReferences\nSources\n*\n*\n*\n*\n*\n|url-access=subscription\n}}\n*"
    }
  ]
}