{
  "content": [
    {
      "type": "text",
      "text": "# Culture of Niger\n\nfestival at the Sultan's Palace in the Hausa city of Zinder.]]\nmen performing a traditional Yaake dance, northern Niger, 1997.]]\n.]]\ncity centre, 2005.]]\n, a village close to the capital Niamey.]]\nThe culture of Niger is marked by variation, evidence of the cultural crossroads which French colonialism formed into a unified state from the beginning of the 20th century. What is now Niger was created from four distinct cultural areas in the pre-colonial era: the Djerma dominated Niger River valley in the southwest; the northern periphery of Hausaland, made mostly of those states which had resisted the Sokoto Caliphate, and ranged along the long southern border with Nigeria; the Lake Chad basin and Kaouar in the far east, populated by Kanuri farmers and Toubou pastoralists who had once been part of the Kanem-Bornu Empire; and the Tuareg nomads of the Aïr Mountains and Saharan desert in the vast north. Each of these communities, along with smaller ethnic groups like the pastoral Wodaabe Fula, brought their own cultural traditions to the new state of Niger.\nIn religion, Islam, spread from North Africa beginning in the 10th century, has greatly shaped the mores of the people of Niger. Since Independence, greater interest has been in the country's cultural heritage, particularly with respect to traditional architecture, hand crafts, dances and music.\nMusic of Niger includes the guitar music of the Tuaregs of Agadez as performed by Group Inerane, Group Bombino and others.\nNational culture\nWhile successive post-BA governments have tried to forge a shared national culture, this has been slow forming, in part because the major Nigerien communities have their own cultural histories, and in part because Nigerian ethnic groups such as the Hausa, Tuareg and Kanuri are but part of larger ethnic communities which cross borders introduced under colonialism. Until the 1990s, government and politics was inordinately dominated by Niamey and the Djerma people of the surrounding region. The French had promoted Djerma royalty under their rule. After having first placed their capital in the powerful pre-colonial Hausa state at Zinder, the French moved their administration to what was a small village at Niamey, in part from fear of pan-Hausa power or British imperial designs on southern Niger. This governmental focus on the southwest continued after independence, with political representation reverting to a tiny traditional and educated elite. Despite this, only the Tuareg and Toubou pastoralists in the sparsely populated north and east have generated movements for autonomy, culminating in rebellions in 1963, the 1990s, and 2007. Islam, practiced by almost the entire population forms an important link between Nigerien communities, as does a shared post-independence history, national symbols, and festivals.\nArts\nFestivals\nReligion\nIslam is the dominant religion in Niger, and is practiced by more than 99% of the population. Approximately 95% of Muslims are Sunni; 5% are Shi'a.  There are small Christian, Baháʼí, and Animist communities, the first largely a remnant of French colonial influence. Animist beliefs include both animist based festivals and traditions (such as the Bori cult), practiced by some syncretic Muslim communities, as opposed to several small communities who maintain their pre-Islamic religion. These include the Hausa speaking Maouri/Azna community in Dogondoutci in the south-southwest, the Kanuri speaking Manga near Zinder, and some tiny Boudouma and Songhay communities in the southwest.\nLanguages\nWhile French has been the cross cultural language of choice since independence, there are eight other official languages spoken in Niger, which include Hausa, Zarma/Songhai, Tamajeq, Fulfulde, Kanuri, Arabic, Gourmanché, and Toubou. Hausa, which almost half the population speak, has come to rival French as most used across communities.\nLiterature\nCuisine\nSport\nWhile traditional sports like horse racing, camel racing, and sorro wrestling survive, world sports like football dominate in urban areas. In the 1972 Summer Olympics, boxer Issake Dabore won a bronze medal, and Niger has sent athletes to all Summer Olympic Games held since 1964, except for 1976 and 1980.\nSee also\n* Demographics of Niger\n* Media of Niger\n* Seasonal migration in Niger\nReferences\n* James Decalo. Historical Dictionary of Niger.  Scarecrow Press/ Metuchen.  NJ - London (1979)\n* Finn Fuglestad. A History of Niger: 1850-1960. Cambridge University Press (1983)"
    }
  ]
}