{
  "content": [
    {
      "type": "text",
      "text": "# Cumberland and Westmorland Antiquarian and Archaeological Society\n\nThe Cumberland and Westmorland Antiquarian and Archaeological Society, founded in 1866, is a local historical, antiquarian, archaeological and text publication society and registered charity covering the modern county of Cumbria.\nAims\nThe society exists to \"promote, encourage, foster\" the combined studies of genealogy, history, custom and archaeology, within the boundaries of the non-metropolitan county of Cumbria (which, as well as the two titular historic counties of Cumberland and Westmorland, includes elements of historic Yorkshire and Lancashire).\nHistory\nThe society was established in Penrith, Cumbria on 11 September 1866, with \"five business and professional men from both counties\" as founder-members. The then Earl of Lonsdale was appointed honorary president. One of the society's first official acts was to campaign for the protection of the Dunmail Raise cairn, and to organise an archaeological dig on the Low Borrow Bridge Roman fort, near Tebay. Membership rose to 115 by 1866 (with around a quarter being clergymen), and \"includ[ed] three ladies\". The society returned to the Low Borrow Bridge site, by then a scheduled monument, in 2011 and discovered further evidence as to the size of the camp, while in 2015 it was a joint funder of work into a dendrochronological dating on Kendal's fourteenth-century Castle Dairy.\nPublications\nA publishing arm was created in 1877, and by 2015 was responsible for publishing its peer-reviewed journal The Transactions of the society, a triannual newsletter, and various dedicated book series for specific areas of interest (for example, the Extra Series, and those for Records, Research, and Tracts).\nSelect publications\n*Mullett, M. A., Patronage, Power and Politics in Appleby in the Era of Lady Anne Clifford 1649–1689, 2015.\n*Zant, J., Penrith: the Historic Core, 2015.\n*Brennand, M. & Stringer, K. J. (Eds), The Making of Carlisle: From Romans to Railways, 2011.\n*Cherry, P., Studies in Northern Prehistory , 2007.\n*Austin, P. S., Bewcastle and Old Penrith , 1991.\nPresidents\nThe following have served as president of the society:\nReferences\nFurther reading\n*\nExternal links\n*\n*\n*\n*"
    }
  ]
}