{
  "content": [
    {
      "type": "text",
      "text": "# Curtiss P-40 Warhawk variants\n\n}}\nThe Curtiss P-40 Warhawk was a WWII fighter aircraft that was developed from the P-36 Hawk, via the P-37. Many variants were built, some in large numbers, under names including the Hawk, Tomahawk, and Kittyhawk.\nAllison-engined Model 75\nXP-37\nIn early 1937, after realizing the Hawk 75 was inferior to more modern European designs, the USAAC ordered one P-36 to be modified with an Allison V-1710 inline engine.  The prototype Hawk was fitted with a turbo-supercharged 1,150&nbsp;hp (860&nbsp;kW) Allison V-1710-11 engine as the XP-37 (company designation Model 75I).  The cockpit was moved back towards the tail to make room for the massive supercharger, and the engine was cooled by two radiators on either side of the nose.  Armament was one .30 M1919 Browning MG and one .50 M2 Browning MG mounted in the nose.  The XP-37 was plagued with supercharger and visibility problems.\nYP-37\nA further 13 Model 75Is were ordered in 1938 under the designation YP-37.  These differed from the XP-37 in having a V-1710-21 with a more reliable supercharger and an extended nose.  The project was cancelled after continued supercharger and visibility problems.\nXP-40\nIn 1937, the 10th P-36A was fitted with a 1,150&nbsp;hp (860&nbsp;kW) V-1710-19.  Unlike the Model 75I, the resulting XP-40 (Model 75P) did not have a turbo-supercharger, thus the cockpit was not moved back, and the radiator was moved to the ventral position.  Later the landing gear was redesigned and the radiator was moved under the nose.  Armament was two .50 M2 Brownings mounted in the nose.\nThe new engine conferred a 50&nbsp;mph speed advantage over the already popular Hawk, and export orders from England and France came in quickly.  In April 1939, the United States Army Air Corps also put in a domestic order for 524 Model 75Ps, which was the largest single order for a US fighter aircraft at the time.\nIn August 1943, the XP-40 was fitted with rubber-tracked main landing gear.  Testing began in 1944, revealing problems with snow and ice being packed between the wheels and track belt, stretching the latter.\nModel 81\nP-40\nThe production P-40 (Model 81A) were nearly identical to the XP-40, but was built with a 1,040&nbsp;hp (780&nbsp;kW) V-1710-33s and one .30 M1919 Browning in each wing.  The company designation was changed to Model 81 due to the extensive changes from the standard Model 75.  France, who was a large operator of the P-36, was interested in this fighter and ordered 140 aircraft as Hawk 81A-1s.  However, following the 1940 French Armistice the Royal Air Force acquired these aircraft as Tomahawk Mk.Is.  This variant was not considered combat-ready, as they lacked heavy armament and armor, but as there was a shortage of decent fighter aircraft after the Battle of Britain, the RAF pressed these into service for use in North Africa anyway.\nSub-variants and modifications\n* P-40, 524 aircraft ordered, only 200 produced.\n* P-40A, one P-40 that was fitted with cameras for photo reconnaissance missions.\n* P-40G, 44 P-40s that were fitted with four-gun P-40B/C wings, the first of which being unofficially designated XP-40G.\n* Hawk 81A-1, export version, 140 aircraft ordered by the Armée de L'air, but were delivered to the Royal Air Force as Tomahawk Mk.Is.  A number of minor changes were made, including replacing the .30 Browning MGs in the wings with .303 Browning MGs, which was done on most Tomahawk marks.\nP-40B\nOf the remaining 324 aircraft of the initial order, 131 were built as P-40Bs.\nThough strongly built, the first P-40 variant was poorly protected and lacked armor and self sealing tanks.  This was partly rectified with the P-40B, which had additional armor behind the cockpit, but fuel system and control line vulnerability remained a problem to some extent with all Tomahawk types.  The P-40B also had an additional .30 MG in each wing.\nSub-variants\n* P-40B, 131 aircraft built.\n* Hawk 81A-2, export version, 110 aircraft produced for the RAF as Tomahawk Mk.IIs and Mk.IIAs, the latter equipped with .303 Brownings.\nP-40C\nThe last 193 aircraft of the original P-40 order were completed as P-40Cs.\nIn an attempt to further rectify the problem of poor protection, the P-40C was given self-sealing fuel tanks.  The obsolete SCR-283 radio of the earlier P-40s was replaced with an SCR-274N and provisions were made for a 52 gal drop tank. The latter change increased the combat radius dramatically, and was a standard feature in all subsequent P-40s.\nSub-variants and modifications\n* P-40C, 193 aircraft built.\n* Hawk 81A-3, export version, 930 aircraft built for the RAF as Tomahawk Mk.IIBs, many of which were diverted to other allies.\n* Hawk 81A-2/3, export version, 100 Hawk 81A-3 aircraft were diverted from an RAF order and delivered to the Nationalist Chinese Air Force for use by the American Volunteer Group.  Although they were officially Hawk 81A-3s, they lacked the provisions for a drop tank.\nModel 87\nP-40D\nSoon after P-40 production started, Curtiss began development of its intended successor, the XP-46.  This aircraft was based on the P-40, but was an almost entirely different aircraft.  While retaining the rear fuselage of the P-40, the XP-46 had a new wing with wider track landing gear.  The nose was redesigned too, as it housed a new 1,150&nbsp;hp (860&nbsp;kW) V-1710-39 engine.  This \"F-series\" engine differed from the \"C-series\" engine of the Model 81 in having a more compact external spur gear-type reduction gear box. The production version of the P-46 was to have four .30 MGs in each wing and two .50 MGs in the nose for a total of ten guns.  This would have been the heaviest armament for a US fighter at the time.  Both the USAAF and RAF placed orders for this aircraft, with the latter naming it \"Kittyhawk\".\nDue to delays in the P-46 program, the USAAF asked Curtiss to prioritize development of an improved P-40.  Curtiss did so, and reworked the P-40 to accommodate the V-1710-39 of the XP-46.  The resulting P-40D (Model 87A) had a shorter nose with a larger radiator, four .50 Brownings in place of the .30 units, a revised windscreen, and provisions for two 20 mm cannons (one in each wing, never used).  The nose guns were deleted as there wasn't room for them in the final design. Upon testing both the P-40D and XP-46 prototypes, the USAAF found that the XP-46 offered no significant improvement over the P-40C, and was inferior to the P-40D.  Both the USAAF and RAF cancelled their orders for the P-46 and the name \"Kittyhawk\" was given to the P-40D.\nSub-variants\n* P-40D, 2 aircraft built for testing purposes, both were later modified into the prototypes of subsequent variants.\n* P-40D-1, 21 aircraft built for service with the USAAF.\n* Hawk 87A-1, export version, 560 were built for the RAF as Kittyhawk Mk.Is.  The first 20 of these aircraft were built with the standard four guns, but the rest had six, making them almost identical to the later Mk.IA.  Some were diverted to other allies.\nP-40E\n, which was part of the Desert Air Force.]]\nStarting with the 24th Model 87, an additional .50 MG was added to each wing and the carburetor intake was moved forward 6 in.  Although these changes were relatively minor, this new variant was given the designation P-40E.\nWhen the P-40D and E went into service, several problems were discovered.  When maneuvering in high G turns the guns would often jam due to the way the ammunition was stored. Another problem was that engine and trim management were both somewhat complex and taxing with earlier P-40's required strong rudder pressure to offset engine torque and frequent trim adjustments were needed during rapid speed changes.  Both these problems were remedied sometime late in production by enlarging the vertical stabilizer and changing how the ammunition was stored.\nP-40's were more a powerful, faster-flying aircraft than the primary and advanced trainers most pre-war and early-war Allied pilots were familiar with, and transition training was often inadequate or neglected altogether in the early years of the war.  The landing gear was also more narrow and not as strong as in fixed gear aircraft (like the Gladiator) or on some other retractable gear fighters such as the Hurricane.  As a result, novice pilots had a hard time adjusting to the new fighter and there were many accidents on landing and takeoff in the early years of the war, with both Tomahawk and Kittyhawk types.  Therefore, two P-40Es were fitted with a second seat to be used as trainer aircraft under the designation P-40ES.  With these aircraft and improved training techniques these problems subsided.\nSub-variants and modifications\n* Prototype P-40E, the second P-40D fitted with a six-gun wing.\n* P-40E, 820 aircraft built.  Somewhere along the production line flared \"fishtail\" exhaust stacks appeared, and an unknown number of late production aircraft had larger vertical stabilizers.\n* P-40ES, two aircraft modified into two-seat trainer aircraft.\n* P-40EF, a number of P-40Es and Ks modified by the Soviet Air Force as two seat photo reconnaissance aircraft. The \"EF\" designation was unofficially given to the aircraft by the Soviets, with the F standing for \"Foto\", the Russian word for photo.\n* Hawk 87A-2, export version, the RAF received 1,500 Kittyhawk Mk.IAs under Lend-Lease.  These were given the USAAF designation P-40E-1.  Some were diverted to other allies.\nP-40J\nThe main problem with the P-40 was its effective altitude ceiling of about 12,000 feet.  Above that altitude the single-stage Allison V-1710 engine started to perform poorly.  As a result, unless combat was taking place at low altitude, P-40 pilots often faced attack from above in the opening stages of an interception, a chronic problem which cost many lives.  In response, Curtiss proposed the P-40J, which was basically a P-40E with a turbo-supercharged V-1710.  Although a good idea on paper, there were many problems with fitting a turbo-supercharged V-1710 into the P-40.  One of the main problems was the size of the turbocharger, which would not fit in the standard P-40 airframe.  On top of that the intended engines were reserved for P-38 production.  In May 1942 the project was cancelled without any being built.\nP-40F\nAnother solution to the high altitude performance problem was to fit the P-40 with a supercharged Rolls-Royce Merlin engine.  This idea came from the British, as they noticed that their Allison powered Kittyhawks and Mustangs had poor performance at high altitudes, while their own Merlin powered Hurricanes and Spitfires did not have the same problems.  Curtiss fitted the second P-40D with a 1,300&nbsp;hp (969&nbsp;kW) Merlin 28.  Production aircraft had the American-made 1,390&nbsp;hp (1,040&nbsp;kW) Packard V-1650-1 Merlin.  The resulting P-40F (Model 87B) was the first variant to carry the \"Warhawk\" name.\nAlong with the added power of the Merlin engine came a decrease in directional stability.  Curtiss attempted to fix this by fitting a dorsal fillet to the tail of a single P-40F; however, this was not adopted into production.  Starting with the P-40F-5, the tail was lengthened by about 20 in.\nAlthough the P-40F was superior to the Allison powered P-40s, there was a shortage of Merlin engines due to the vast number of aircraft that used them.  Parts for these engines were becoming scarce, and maintenance became an issue.  As a result, at least 70 P-40Fs were re-engined with V-1710-81s of 1,360&nbsp;hp. These aircraft became known as P-40R-1s.\nSub-variants and modifications\n*XP-40F, the second P-40D fitted with a 1,300&nbsp;hp Rolls-Royce Merlin 28.\n*P-40F, (also P-40F-1) the first production batch of 699 aircraft with American-made Packard V-1650-1 engines.\n*P-40F-5, 123 aircraft with an extended fuselage to counteract extra torque from the Merlin.\n*P-40F-10, 177 aircraft with manually operated cowl flaps replacing the electric units of the earlier variants.\n*P-40F-15, 200 aircraft with winterized equipment.\n*P-40F-20, 112 aircraft with a revised cockpit oxygen flow system.\n*YP-40F, the third production P-40F used for streamlining tests.\n*P-40R-1, at least 70 P-40Fs that were fitted with V-1710-81 engines due to the shortage of Merlins.\n*Hawk 87B-2, export version, 150 built for the RAF under Lend-Lease as Kittyhawk Mk.IIs.\nP-40K\nThe P-40K was intended to be the last P-40 production variant before replacement by the P-60, and only 600 were ordered by the USAAF to supply to China. However, with the cancellation of the P-60 the attack on Pearl Harbor led to this order being increased to 1,300 aircraft.  A continuation of the Allison-powered Warhawk, the K was similar to the P-40E, but was powered by a 1,325&nbsp;hp V-1710-73.  It also featured improved machine gun ammunition storage reducing gun stoppages.  These were the heaviest P-40 variants, but the extra horsepower on the P-40K gave it good performance particularly at low altitude (noticeably better than the P-40E).\nAs with the P-40F, the increase in power led to decreased directional stability, but Curtiss predicted this and incorporated an enlarged vertical stabilizer to early P-40Ks.  On the K-10 sub-variant onward, this was replaced with the lengthened tail of the P-40F-5.  This feature was standard on all subsequent Warhawks.\nSub-variants and modifications\n*P-40K-1, the first 600 aircraft ordered for Lend-Lease to China but were taken over by the USAAF and RAF after Pearl Harbor.\n*P-40K-5, 200 aircraft with rotary valve cooling.\n*P-40K-10, 335 aircraft with the long tail of the P-40F-5.\n*P-40K-15, 165 aircraft with winterized equipment.\n*TP-40K, one P-40K modified as a two-seat trainer.\n*XP-40K, one P-40K-10 with a V-1710-43 used to test wing root radiators.\n*Kittyhawk Mk.III, 351 P-40Ks built for the RAF under Lend-Lease as Kittyhawk Mk.IIIs, about half which were diverted to other allies.\nP-40L\nA continued development of the Merlin powered Warhawk, the P-40L was a lightened version of the P-40F.  Many weight saving changes were made to the aircraft, including removal of armor plating and reduction of rounds per gun.  On the P-40L-5, weight was further reduced by removing two of the guns and reducing the internal fuel capacity from 157 gal. to 120 gal.\nAs with the P-40F, at least 53 P-40Ls were re-engined with V-1710-81s.\nSub-variants and modifications\n*P-40L-1, 50 aircraft built similar to the P-40F-5 but with some equipment removed.\n*P-40L-5, 220 aircraft with two wing guns removed and reduced fuel capacity.\n*P-40L-10, 148 aircraft with electric aileron trim tabs and revised engine controls.\n*P-40L-15, 112 aircraft with revised carburetor filters and signal lights.\n*P-40L-20, 170 aircraft with radio and electrical system changes and provisions for an incendiary grenade.\n*P-40L-25, 567 aircraft ordered, cancelled and never built.\n*P-40L-30, 60 aircraft ordered, cancelled and never built.\n*P-40R-2, at least 53 aircraft re-engined with V-1710-81s.\n*Hawk 87B-3, export version, 100 built for the RAF as Kittyhawk Mk.IIs, and a further 160 as Kittyhawk Mk.IIIs.  Most of these had the three gun wings of the P-40F.\nP-40M\nDue to the shortage of Merlins, development of the Allison powered Warhawk was again continued.  The P-40K airframe was given a 1,360&nbsp;hp V-1710-81 with a cooling grill forward of the exhaust stubs.\nThe P-40M was supposed to be a purely export variant of the K, although many ended up in USAAF units.  In RAF service the aircraft was named Kittyhawk Mk.III, the same as the P-40K, which can cause some confusion.\nSub-variants and modifications\n* P-40M-1, the first 60 aircraft.\n* P-40M-5, 260 aircraft with carburetor air filter and aileron improvements.\n* P-40M-10, 280 aircraft with changes to the fuel system and undercarriage warning system.\n* TP-40M, a small number of aircraft converted to two-seat trainers.\n* Kittyhawk Mk.III, 466 aircraft built for the RAF, RAAF, and RNZAF. Many were diverted to other allies.\nP-40N\n]]\nThe P-40N was the most produced variant of the Warhawk, with 5220 aircraft built.\nIn an attempt to increase performance, Curtiss lightened the P-40M by introducing a lightweight structure, lighter, smaller-diameter undercarriage wheels, removing two of the guns, and installing aluminum radiators and oil coolers.  Head armor was also re-introduced.  With these changes, the P-40N-1 (Model 87V) was the fastest production Warhawk, reaching a speed of 378&nbsp;mph below 12,000 feet.\nStarting with the P-40N-5 (Model 87W), the canopy was redesigned to give the pilot a better field of vision.  This variant also reverted to the six gun wing and one rack was added to each wing, these could carry either bombs or drop tanks. A more powerful V-1710-99 engine was introduced on the N-20, and a further improved V-1710-115 was introduced on the N-40.  Curtiss attempted to further improve visibility and fitted one P-40N with a bubble canopy; this feature never made it to production.\nSub-variants and modifications\n*P-40N-1, the first 400 aircraft with a lighter structure, 4 wing-mounted MGs, smaller diameter undercarriage tires, aluminum radiators and oil coolers, and head armor.\n*P-40N-5, 1,100 aircraft with a revised cockpit canopy, 6 wing-mounted MGs, and wing racks for bombs or drop tanks.\n*P-40N-6, P-40N-5s modified in the field with fuselage mounted cameras for reconnaissance.\n*P-40N-10, 100 winterized aircraft with 4 wing-mounted MGs.\n*P-40N-15, 377 aircraft with 6 wing mounted MGs, a relocated battery, and larger wing fuel tanks.\n*P-40N-16, P-40N-15s modified for reconnaissance.\n*P-40N-20, 1,523 aircraft with a V-1710-99.\n*P-40N-25, 500 aircraft with a revised instrument panel and non-metal fuel tanks.\n*P-40N-26, P-40N-25s modified for reconnaissance.\n*P-40N-30, 500 aircraft with valve and electrical system changes.\n*P-40N-35, 500 aircraft with system changes and a new radio\n*P-40N-40, 220 aircraft with a 1,360&nbsp;hp V-1710-115 engine, metal covered ailerons, improved fuel tanks, new radio and oxygen system, and flame-dampening exhaust stacks.  An order for 780 aircraft was cancelled.\n*TP-40N, 30 various P-40Ns modified or factory built with a second seat for training purposes. Other known designations included RP-40N-26 (TP-40N-25) and P-40N-31 (TP-40N-30).\n*XP-40N (P-40XN), one P-40N aircraft modified with a bubble canopy.  Designation was not official.  One source states that this aircraft was converted from a P-40N-25 and later converted into the third XP-40Q.  However, another source states that the XP-40N was converted from a P-40K-1 and later converted into the second XP-40Q, but this is unlikely as photographic evidence shows that the XP-40N had the long tail that first appeared on the P-40K-10.\n*Hawk 87V and 87W, export versions, 586 built for the RAF as Kittyhawk Mk.IVs.  Some were diverted to other allies.\nP-40P\nThe P-40P was a planned variant of the P-40N with a Merlin engine.  The project was cancelled due to a shortage of Merlins and the aircraft were delivered as P-40Ns.\nP-40Q\nIn 1944, Curtiss attempted to bring the Warhawk to the standards of more modern fighters such as the North American P-51 Mustang.  To do so, Curtiss installed a 1,425&nbsp;hp water injected V-1710-121 into the Hawk 87 airframe.  The resulting aircraft became the fastest P-40 model at 422&nbsp;mph. Even with these modifications, the P-40Q (Model 87X) was still inferior to modern fighters and the project was cancelled.\nSub-variants\n*.]]XP-40Q-1, originally a P-40K-10, this prototype bore a resemblance to the XP-40K, having similar wing root radiators.  Apart from this, the aircraft had a lengthened nose and four-bladed propeller.  Armament consisted of four .50 Brownings, these were carried on all XP-40Q prototypes.\n* XP-40Q-2, initial prototype after extensive modifications.  The radiator intake was relocated to its original position under the nose, but was more streamlined.  A bubble canopy similar to the one on the XP-40N was installed.  The aircraft was originally flown with round wingtips, but these were later clipped by one foot, giving them a square appearance.\n*XP-40Q-2A, the first P-40K-1 was converted into the second XP-40Q.  This aircraft was similar to the XP-40Q-2, but with minor changes.  One source states that this aircraft was converted from the XP-40N.\n* XP-40Q-3, P-40N-25 was modified into the third prototype.  This aircraft was almost identical to the XP-40Q-2 with the exception of a more streamlined canopy.  One source states that this aircraft was converted from the XP-40N.\n* P-40Q, proposed production version with either six .50 guns or four 20 mm cannons.  Never built.\nTwin P-40\nA single photo exists of a P-40 with two Merlin engines mounted on top of the wings over the landing gear.  The apparent serial number, 41-13456, belongs to a P-40C, however, the canopy is from an early Hawk 87.\nReferences\nNotes\nBibliography\n*\n*\n*"
    }
  ]
}