{
  "content": [
    {
      "type": "text",
      "text": "# Custom Robo Battle Revolution\n\n| genre = Action role-playing\n| modes = Single-player, multiplayer\n| platforms = GameCube\n}}\nCustom Robo, known in Japan as  is an action role-playing video game developed by Noise and published by Nintendo for the GameCube. It is the fourth title of the Custom Robo series, and the first title of the series released outside Japan.\nGameplay\nAn operator of a robo is known as a \"commander\". A commander pilots and customizes a miniature \"robo\" to battle each other in a virtual arena called a Holosseum; the average robo is 32 centimeters tall. The majority of the story takes place in a campaign-like mode titled \"A New Journey\". After this mode is completed, the player may choose to go through the story again or select a new mode consisting of a series of tournaments called \"The Grand Battle\".\nThe main objective of the game is to engage in battle with other robos, collect every custom robo, battle part, and item that the player wants; winning every battle moves the player from one part of the storyline to the next. During battles, the objective is to reduce the opponent's hit points from 1000 to 0 by using different custom robos and their arsenal of weapons, including dash attacks, guns, bombs, and pods.\nFights take place in a Holosseum, a battle arena designed for custom robos. Some commanders can make their own Holosseums, or they can use a pre-created Holosseum taken from a Holosseum deck or in the robo itself. Holosseums come in a variety of sizes and layouts, and some feature environmental hazards such as ice or lava.\nBefore battling begins, players customize their robos from 5 types of parts: the chassis (the robo itself), the gun (right hand), the bomb (left hand), the pod (backpack), and the legs (attachments to your legs and feet). The chassis are arranged in groups that designate the model, which affects its traits. In addition, there are 3 types of the same model.\nBattles begin with robo being launched out of a Robocannon, which is controlled with the Control Stick. Robos are shot from the Cannon in the form of cubes; there are six sides numbered 1 to 6, which designate how long the player's robo has before transforming. Players can speed up the process up by pressing any button repeatedly. The first robo to transform gets to attack first - an attack brings them to transform immediately. There are two views in battle: Normal view is the view that allows the player to see both the Custom Robos in an isometric view. First-person view allows to see from robo's point of view. Players can change views during a battle by pressing up on the C-stick after \"A New Journey\" is completed. The endurance bar is located above your hit points. Once it runs out, their robo gets \"downed\", which means that it becomes unresponsive for a couple seconds; they can speed up the process of recovering by repeatedly tapping the A button. After it gets up, it goes into \"rebirth\", where it briefly turns invincible for about 3 seconds. If the player repeatedly loses the same battle, the game offers the option of reducing the opponent's initial health. This goes up to the opponent losing 250 HP.\nPlot\nThe story opens with a flashback from the hero's earlier life.\nThe main character \"hero\", is a child whose father has disappeared. Before his mysterious departure, Hero's father gave him a watch, telling him to keep it safe. At this point, the game leaps to the present and Hero suddenly receives a letter stating that his father has just died. In honor of his father's wishes for him to become a Robo Commander, Hero sets out to do so, despite knowing nothing about robos. He eventually manages to join up with a group of bounty hunters known as the \"Steel Hearts\", where he meets Ernest, Harry, and Marcia. A fellow member of the Steel Hearts, Harry, teaches Hero how to command robos and helps him receive his license, which allows Hero to battle with robos legally. After a few minor errands, Hero and company discover the self-guided Robo known as 'Rahu'. Later, after passing a test and obtaining a Class \"S\" license, Rahu's past is revealed and Hero finds out that Rahu is an invisible organic being who had accidentally been fused with a toy robot.\nBefore the time of the domed city, the world was attacked by a powerful entity, now known as Rahu. Eventually, Rahu came to possess a child's toy. This toy was very similar to a Robo. By popularizing Robo battling, the government gave the people a way to fight the entity. Rahu was soon damaged enough to be driven into dormancy for a long period of time, but has now awoken. Hero and the rest of the police force leave the safety of the dome to defeat Rahu again, along with the organization known as the Z-Syndicate, who are trying to control the entity for their own ends. After defeating the syndicate, Hero meets an old friend of his father's, and the brother of Marcia of the Steel Hearts, a spy named Sergei. He originally joined the Z Syndicate to stop Rahu, but was forced to work with Oboro, who wanted to control Rahu for his own means. Eliza and Isabella, two other members of the Z Syndicate, also wanted to control Rahu. Sergei showed Hero an old recording of his father's last message to him. In the recording, Hero's father explains that he left to form the Z-Syndicate in an attempt to inform the people of Rahu's impending attack. The other members soon lost sight of his vision and betrayed him in an attempt to the seize control of the Syndicate and Rahu. Hero, Harry, and Marcia eventually defeat Rahu, ensuring the world's safety - for a while.\nReception\n| Edge = 5/10\n| EGM = 6.83/10\n| Fam = 30/40\n| GI = 5.75/10\n| GamePro =\n| GameRev = C−\n| GSpot = 6.3/10\n| GSpy =\n| GameZone = 7.5/10\n| IGN = 6.5/10\n| NP = 3.8/5\n}}\nThe game received \"mixed\" reviews according to video game review aggregator Metacritic. In Japan, Famitsu gave it a score of two sevens and two eights for a total of 30 out of 40. However, in retrospective reception the game has been heavily praised and is frequently featured in several \"Best GameCube games\" lists and countdowns.\nNotes\nReferences\nExternal links\n*\n*"
    }
  ]
}