{
  "content": [
    {
      "type": "text",
      "text": "# Czech and Slovak Federative Republic\n\n| common_name            = Czechoslovakia\n| status                 = Federation\n| p1                     = Czechoslovak Socialist Republic\n| flag_p1                = Flag of Czechoslovakia.svg\n| s1                     = Czech Republic\n| flag_s1                = Flag of the Czech Republic.svg\n| s2                     = Slovakia\n| flag_s2                = Flag of Slovakia.svg\n| image_flag             = Flag of Czechoslovakia.svg\n| flag                   = Flag of Czechoslovakia\n| image_coat             = Herb Czechosłowacji (1990-1992).svg\n| symbol                 = Coat of arms of Czechoslovakia\n| image_map              = Czechoslovak Federative Republic (1992).jpg\n| capital                = Prague\n| largest_city           = capital\n| national_motto         = \"Pravda vítězí / Pravda víťazí\"(Czech/Slovak)\"Veritas vincit\"(Latin)\"Truth prevails\"(1990&ndash;1992)\n| national_anthem        =  |}}| }}\n\"\")}}\n| official_languages     = CzechSlovak\n| government_type        = Federal parliamentary republic\n| title_leader           = President\n| leader1                = Václav Havel\n| year_leader1           = 1989&ndash;1992\n| leader2                =\n| year_leader2           =\n| title_deputy           = Prime Minister\n| deputy1                = Marián Čalfa\n| year_deputy1           = 1989&ndash;1992\n| deputy2                = Jan Stráský\n| year_deputy2           = 1992\n| era                    = Velvet Revolution\n| event_start            = Constitutional change\n| year_start             = 1990\n| date_start             = 23 April\n| event_end              = Dissolution\n| year_end               = 1992\n| date_end               = 31 December\n| legislature            = Federal Assembly\n| house1                 = Chamber of Nations\n| house2                 = Chamber of People\n| currency               = Czechoslovak koruna\n| cctld                  = .cs\n| calling_code           = 42\n| today = Czech Republic Slovakia\n}}\nAfter the Velvet Revolution in late 1989, Czechoslovak Socialist Republic was briefly renamed the Czech and Slovak Federative Republic (, ; ČSFR) during the period from 23 April 1990 until 31 December 1992, after which the country was peacefully dissolved into the Czech Republic and the Slovak Republic.\nAdoption of the name\nSince 1960, Czechoslovakia's official name had been the Czechoslovak Socialist Republic (Československá socialistická republika, ČSSR). In the aftermath of the Velvet Revolution, newly elected President Václav Havel announced that \"Socialist\" would be dropped from the country's official name.\nConventional wisdom suggested that the country would resume the name used from 1919 to 1938 and from 1945 to 1960, Czechoslovak Republic (Československá republika). However, Slovak politicians objected that the traditional name subsumed Slovakia's equal status in the federal state too much. The first compromise was Constitutional Law 81/1990, which changed the country's name to Czechoslovak Federative Republic (, ; ČSFR), explicitly acknowledging the federal nature of the state. It was passed on 29 March 1990 (coming into force on the same day) only after an informal agreement on the Slovak form which would be explicitly codified by a future law on state symbols. This was met with general disapproval and another round of haggling, dubbed \"the hyphen war\" (pomlčková válka/vojna) after Slovaks' wish to insert a hyphen into the name (Česko-Slovensko). However, aggrieved Czechs vehemently opposed it as too reminiscent of such practice during the Second Czechoslovak Republic (when the official name was \"Czecho-Slovak Republic\"—which had also been used from 1938 to 1939)—when the country had been mutilated by the Munich Agreement and was slipping toward its final dismemberment at the hands of Nazi Germany a year later. The resultant compromise, after much behind-the-scenes negotiation, was Constitutional Law 101/1990, passed on 20 April and in force since its declaration on 23 April. The law changed the country's name to \"Czech and Slovak Federative Republic\"; unlike the previous one, it also explicitly listed both versions and stated they were equal.\nThe name breaks the rules of Czech and Slovak orthography, which do not generally use capitalization for descriptive words such as \"federative\" and \"republic\", nor for adjectives derived from proper nouns. Both rules were broken at once as a compromise.\nWhile few people were happy with the name, it came into use quickly. Czech and Slovak tensions, of which this was an early sign, soon became manifest in matters of greater immediate importance which made the country's name a comparatively minor issue and at the same time even more impossible to change, so the name remained.\nThe 1960 Constitution remained in force up to 1 January 1993. It was also heavily amended to remove its Communist character. Work on a permanent constitution was still underway at the time of the dissolution of Czechoslovakia.\nSee also\n* History of Czechoslovakia (1989–1992)\nReferences\n*\n*\nExternal links\n*  [http://www.psp.cz/eknih/1986fs/slsn/stenprot/026schuz/s026039.htm Transcription of Federal Assembly proceedings] when adopting 81/1990.\nes:Checoslovaquia#República Federal Checa y Eslovaca (1990-1992)"
    }
  ]
}