{
  "content": [
    {
      "type": "text",
      "text": "# Czech Republic men's national floorball team\n\n|captain =\n|iff_ranking   = 3rd (2024)\n}}\n]]\n]]\nThe '''Czech men's national floorball team, presented as Czechia''', is the national floorball team of the Czech Republic, and a member of the International Floorball Federation (IFF).\nThe Czech Republic has appeared in every World and European Championships tournament organised by the IFF. Its biggest successes are silver medals from the 5th World Championships in 2004 and 14th World Championships in 2022, which both took place in Switzerland. The team also won four bronze medals in 2010, 2014, 2021 and 2024. That makes Czech team the third most successful team after Sweden and Finland and before fourth Switzerland. In the IFF ranking, the team is also third (behind Sweden and Finland and ahead of Latvia), following their mentioned third and second-place finishes at the World Championships in 2024 and 2022.\nMilestones\nThe Czech men's national floorball team was founded at the turn of 1993 and 1994. They have played their first friendly match in February 1994 against  Switzerland and competed at the European Championships in the same year.\nThey first fought for medals at the first World Championships in 1996 in the bronze medal match against Norway. The Czechs defeated the Finnish team for the first time in the group stage at the 2002 World Championship. Since then, however, they have never won over Finland at the World Championship. In 2004, they have defeated Switzerland for the first time at World Championship. It was in semifinals, which earned the Czech team its first medal and the silver.\nThe Czechs defeated the Swedish team for the first time at the home Euro Floorball Tour in April 2014, where they also won against Finland and Switzerland, thus dominating the tournament for the first time. The Czechs have never won against Sweden at the World Championships. They won their first draw in the group stage at the 2022 championships, but lost to Sweden in the final. With their second silver, the Czechs overtook Switzerland's third place in the medal standings.\nWorld Championship\n{| class=\"wikitable\" style=\"text-align: center;\"\n|-\n!Year\n!Hosting Country\n!Rank\n|-\n|1996\n|align=left | Sweden\n|align=left |4th place\n|-\n|1998\n|align=left | Czech Republic\n|align=left |6th place\n|-\n|2000\n|align=left | Norway\n|align=left |6th place\n|-\n|2002\n|align=left | Finland\n|align=left |4th place\n|-\n|2004\n|align=left | Switzerland\n|align=left bgcolor=silver|2nd place\n|-\n|2006\n|align=left | Sweden\n|align=left |4th place\n|-\n|2008\n|align=left | Czech Republic\n|align=left |4th place\n|-\n|2010\n|align=left | Finland\n|align=left bgcolor=\"#c96\"|3rd place\n|-\n|2012\n|align=left | Switzerland\n|align=left |7th place\n|-\n|2014\n|align=left | Sweden\n|align=left bgcolor=\"#c96\"|3rd place\n|-\n|2016\n|align=left | Latvia\n|align=left |4th place\n|-\n|2018\n|align=left | Czech Republic\n|align=left |4th place\n|-\n|2020\n|align=left | Finland\n|align=left bgcolor=\"#c96\"|3rd place\n|-\n|2022\n|align=left | Switzerland\n|align=left bgcolor=silver|2nd place\n|-\n|2024\n|align=left | Sweden\n|align=left bgcolor=\"#c96\"|3rd place\n|}\nReferences\nExternal links\n*[https://www.ceskyflorbal.cz/national-team/detail/overview/1?locale=en Official webpage of Czech National Floorball team]\n*[https://app.floorball.sport/#/team/287 Team page on app.floorball.sport]\n*[https://floorball.sport/team/1193647993/ Team page on IFF site]"
    }
  ]
}