{
  "content": [
    {
      "type": "text",
      "text": "# Czech Republic–Vietnam relations\n\nCzech Republic–Vietnam relations (; ) are foreign relations between the Czech Republic (Czechia) and Vietnam.\nHistory\nThe foreign relations between Czechoslovakia and Vietnam were established on February 2, 1950.\nWhen the Czech Republic and Slovakia gained independence on 1 January 1993, both countries inherited all the established relations between former Czechoslovakia and Vietnam.\nIn January 2025, the bilateral relations were raised to strategic partnership, making Vietnam the Czech Republic's first strategic partner in Southeast Asia, and the Czech Republic the first Central European country for Vietnam to have a strategic partnership with. Signed by the Vietnamese prime minister Pham Minh Chinh and his Czech counterpart Petr Fiala, the elevation of relations status marks the 75th anniversary of diplomatic and historic ties established between Czechoslovakia and the Democratic Republic of Vietnam.\nMigration\nVietnamese community in Czech Republic\nAs of 2018, there were 61,097 Vietnamese citizens with a residence permit in the Czech Republic, making them one of the largest immigrant groups in the country and the largest non-European group.\nCzech community in Vietnam\nVietnam does not tell the number of foreign nationals per country in 2019 Census (it shows only 3,553 foreigners total ). In 2011, Committee on Foreign Affairs of Czech Parliament cited that \"Czech community in Vietnam does not exist yet\".\nIn September 2021, COVID-19 vaccination of Czech citizens living in Vietnam, organized by Czech Embassy in Hanoi, was attended by \"almost 400\" people.\nTrade and economy\nIn 2010s, Czech Republic and Vietnam consider each other as strategic markets with the aim to reach US$1 billion in two-way trade in the near future. As of 2015, Czech imports from Vietnam include seafood, farm produce such as coffee, tea and pepper. Vietnamese imports from the Czech republic are industrial goods, precision engineering, petrochemical equipment and energy.\nOne of the successful Czech companies in Vietnam is Home Credit, which in February 2024 was sold by its owner PPF Group to the Thai Siam Commercial Bank.\nCzech companies including Czechoslovak Group, Colt CZ Group, Omnipol, STV Group, and Aero Vodochody have supplied aircraft and firearms to Vietnam, with both countries viewing defence cooperation as an important part of their overall relations.\nDuring the January 2025 official visit to the Czech Republic, the Vietnamese prime minister Pham Minh Chinh met with Skoda Group's CEO Klaus Zellmer, who viewed Vietnam as \"an important gateway to the ASEAN market\" with \"the potential to become Skoda's car manufacturing export hub for ASEAN and other markets\". The prime minister also held discussions with Pavel Tykač, the owner of Sev.en Energy Group and the football club SK Slavia Praha, who requested the Vietnamese authorities \"expedite the approval process for acquiring a controlling stake\" in the BOT-based Mong Duong 2 thermal power plant. The prime minister also urged Jiri Smejc, the CEO of PPF Group to reinvest.\nUnder an agreement signed in January 2025, pilot trainees at [https://vjaa.edu.vn/eng/ Vietjet Aviation Academy] will be provided training by [https://www.f-air.cz/en F Air] in Czech Republic, which will provide Multi-Crew Pilot License program adhering to European Aviation Safety Agency standards.\nDiplomatic missions\n{| style=\"float:right\"\n|-\n| valign=\"top\" |\n| valign=\"top\" |\n|}\n*The Czech Republic has an embassy in Hanoi. There is an honorary consulate in Ho Chi Minh City.\n*Vietnam has an embassy in Prague.\nSee also\n*Foreign relations of the Czech Republic\n*Foreign relations of Vietnam\n*ASEAN–European Union relations\n*Vietnamese people in the Czech Republic\n*List of diplomatic missions of the Czech Republic\n*List of diplomatic missions of Vietnam\nReferences\nNotes\nFurther reading\n*Shoiw-Mei Tseng. [http://nho.econ.muni.cz/13-2013/3-2013/trade-flows-between-czech-republic-and-east-asia Trade Flows between Czech Republic and East Asia]  ([https://is.muni.cz/do/econ/soubory/aktivity/obzor/6182612/43833183/2013_3_3_Tseng.pdf PFD full text]). January 2013."
    }
  ]
}