{
  "content": [
    {
      "type": "text",
      "text": "# Czech Sovereignty of Social Democracy\n\n}}\n| colorcode        =\n| logo             = Logo of the Czech Sovereignty of Social Democracy.svg\n| logo_size        = 235px\n| flag             = Czech Sovereignity of Social Democracy Flag.svg\n| split            = Politika 21\n| headquarters     = U Průhonu 1201/23, Prague\n| ideology         =  (nominal)\n|Left-wing nationalism\n|Euroscepticism\n|Anti-immigration}}\n| position         = Left-wing\n| colours          = |border=darkgray}} Orange\n| website          =\n| seats1_title     = Chamber of Deputies\n| seats1           =\n| seats2_title     = Senate\n| seats2           =\n| seats3_title     = European Parliament\n| seats3           =\n}}\nČSSD – Czech Sovereignty of Social Democracy (), until 29 June 2023 known as Czech Sovereignty (), formerly also known as Free Bloc () and Sovereignty – Jana Bobošíková Bloc (), is a small left-wing nationalist Czech political party.\nHistory\nOrigins\nThe Party of Common Sense (Strana zdravého rozumu), led by Petr Hannig, took part in the 2002 election to the Chamber of Deputies three months after its foundation, winning 0.2% of the vote. This increased to 0.5% of the vote in the 2006 election.\nIn 2009, the Party of Common Sense began cooperating with former Eurosceptic MEP Jana Bobošíková (elected in 2004 for the Independents), her party Politika 21, and other independent candidates. This electoral alliance ran in the 2009 European election under the name 'Sovereignty', led by Bobošíková. The list came fifth, winning 4.3% of the vote, just short of the 5% threshold for representation. The Party of Common Sense changed its name to 'Sovereignty – Party of Common Sense' (Suverenita – Strana zdravého rozumu), and won 3.7% in the 2010 election, again falling short of parliamentary representation. The cooperation between the two parties subsequently ended.\nFounding and Free Bloc\nSovereignty – Jana Bobošiková Bloc was established in 2011 in Prague, after the breakup of the Sovereignty – Party of Common Sense electoral alliance. It was described as right-wing. In January 2014, the party changed its name to Czech Sovereignty, and former Czech Social Democratic Party MP Jana Volfová became party chairwoman until February 2024.\nThe party changed its name to Free Bloc (Volný blok) when Lubomír Volný, an MP for the Freedom and Direct Democracy party, joined Czech Sovereignty and became its parliamentary leader. Free Bloc won 1.33% of the vote in the 2021 election, falling short of parliamentary representation. The party changed its name back to Czech Sovereignty in January 2022 when it was described as far-right.\nČSSD – Czech Sovereignty of Social Democracy\nFormer Czech Prime Minister Jiří Paroubek joined the party in February 2024, and became party chair in the same month. The party is described as left-wing during this period.\nElection results\nChamber of Deputies\n{| class=\"wikitable\"\n! rowspan=\"2\" |Year\n! rowspan=\"2\" |Leader\n! colspan=\"2\" |Votes\n! colspan=\"3\" |Seats\n! rowspan=\"2\" |Position\n|-\n! No.\n! %\n!No.\n!±\n!Size\n|-\n| 2013\n|Jana Bobošíková\n| 21,241\n| 0.43\n| }}\n|  0\n| 14th\n| style=\"background:lightgray;\" align=center | No seats\n|-\n| 2017\n|Jana Borkovcová\n| 5,077\n| 0.10\n| }}\n|  0\n| 20th\n| align=\"center\" style=\"background:lightgray;\" | No seats\n|-\n| 2021\n|Lubomír Volný\n|71,581\n| 1.33\n| }}\n| 0\n| 9th\n| style=\"background:lightgray;\" align=center | No seats\n|-\n| 2025\n|Jiří Paroubek\n|10,263\n| 0.18\n| }}\n| 0\n| 12th\n| style=\"background:lightgray;\" align=center | No seats\n|}\nEuropean Parliament\n{| class=\"wikitable\" style=text-align:center;\"\n! Election\n! List leader\n! Votes\n! %\n! Seats\n! +/−\n! EP Group\n|-\n!2024\n|Jiří Paroubek\n|7,579\n|0.26 (#16)\n|}}\n|New\n|−\n|}\nNotes\nReferences\nExternal links\n* [https://www.cssdlidem.cz/ Official website]"
    }
  ]
}