{
  "content": [
    {
      "type": "text",
      "text": "# Czech Republic–Russia relations\n\nCzech Republic–Russia relations are the bilateral foreign relations between the Czech Republic and the Russian Federation. Relations have substantially deteriorated in recent years due to events such as the Russian annexation of Crimea in 2014, Russian sabotage of Czech ammunition depot in Vrbětice in 2014, poisoning of Sergei Skripal in 2018 and Russian invasion of Ukraine in 2022.\nBoth countries are full members of the Council of Europe (though Russia's membership has been suspended) and the Organization for Security and Co-operation in Europe. The Czech Republic has an embassy in Moscow. The Russian Federation has an embassy in Prague.\nBackground\nDuring the entire medieval period and early modern period, the Czech lands, in the form of Duchy of Bohemia and Kingdom of Bohemia, were aligned with the Catholic Holy Roman Empire and later Austrian Empire.\nBefore the Soviet-led invasion in 1968, the Czechs were a predominantly Russophile nation and viewed Russia positively, having seen it as a potential Slavic ally and protector from the German threat since the Czech National Revival in the 19th century.\n1934-1945\nas Army General of the Czechoslovak Republic, 1938]]\nCzechoslovakia recognized the Soviet Union de jure and the countries established diplomatic relations in June 1934. On 16 May 1935, the Czechoslovak–Soviet Treaty of Mutual Assistance was signed between the two governments that followed the similar treaty between the USSR and France, which was Czechoslovakia's major ally.\nFollowing the German occupation of Czechoslovakia and the establishment of the pro-German Slovak state in March 1939, the Soviet Union promptly recognized the new status quo and terminated diplomatic relations with Czech representatives. Shortly after the Munich Agreement, many Czechoslovak Communists gained asylum in the Soviet Union, however hundreds of non-communist refugees were sent to labour camps.\nCold War (1945–1989)\nFollowing World War II pre-war Czechoslovakia was re-established, with the exception of Subcarpathian Ruthenia, which was annexed by the Soviet Union. The Czechoslovak parliamentary elections of 1946 were won by the pro-Soviet Czechoslovak communists. The pro-Soviet coup d'état in February 1948 resulted in Czechoslovakia becoming part of the Soviet-led Eastern Bloc, and it was one of the founding members of the Warsaw Pact in May 1955. In August 1968, in response to the Prague Spring pro-democracy reforms of the Czech government, the Soviet-led invasion re-established the hardline Communist rule by force. 108 Czechs and Slovaks died and approximately 500 were wounded as a direct result of the invasion. This damaged relations between the two countries. In 1968–69, Czechoslovakia was turned into a federation of the Czech Socialist Republic and Slovak Socialist Republic. However, the centralised political control by the Czechoslovak Communist Party severely limited the effects of federalisation.\nPost-Cold War history\n1989–2020\nand Russian President Vladimir Putin in Prague in March 2006]]\nFollowing the Velvet Revolution of 1989, the dissolution of the Soviet Union in December 1991 and the dissolution of Czechoslovakia on 31 December 1992 into two countries, Russia immediately recognised the independent Czech Republic and the two states established diplomatic relations on 1 January 1993. During an official visit by Russia's president Boris Yeltsin to the Czech Republic in August 1993, the Treaty of Friendship and Cooperation was signed by Yeltsin and Czech president Václav Havel.\nThe independent Czech Republic re-aligned its foreign policy and economic interests with Western allies throughout the 1990s, and joined NATO in March 1999 and the European Union in May 2004.\nand Czech Prime Minister Petr Nečas in December 2011]]\nIn December 2011, Russian president Dmitry Medvedev visited Prague, to sign economic contracts and cultural exchange. Both countries consider each other as an important economic partner.\n]]\nAs a response to the Russian military intervention in Ukraine from 2014, the Czech Republic has participated in enacting economic sanctions against Russia.\nAlso in 2014, two significant explosions occurred at an ammunition depot in Vrbětice, a village in the Zlín District of eastern Moravia, Czech Republic. The first explosion took place on 16 October, destroying Warehouse No.16 and resulting in the deaths of two employees. The second explosion occurred on 3 December leading to the evacuation of nearby residents. These incidents caused extensive damage and led to an ongoing cleanup operation that concluded in October 2020, costing approximately CZK 1 billion. Investigations by Czech authorities revealed that the explosions were acts of sabotage carried out by operatives from the Russian military intelligence agency GRU, specifically Unit 29155. The operatives involved included Alexander Mishkin and Anatoliy Chepiga, who were also implicated in the 2018 Salisbury poisoning in the UK. Their objective was to disrupt arms shipments, possibly destined for Ukraine or Syria, by targeting the depot managed by the Imex Group.\nIn March 2018, the Czech Republic expelled three Russian diplomats as a reaction to the poisoning of Sergei and Yulia Skripal in the United Kingdom.\nIn March 2018, the Czech Republic arrested and extradited a Russian hacker into the United States on American request.\nIn late 2010s, the controversy about the statue of Ivan Konev in Prague has been one of the issues that caught public attention in this area.\nMiloš Zeman, president of the Czech Republic from March 2013, has been described by American state broadcaster Radio Free Europe as \"one of the European Union's most Kremlin-friendly leaders\". Zeman has supported Russia on issues such as the Russian annexation of Crimea, thereby defying NATO's and EU's official policies. In February 2022, Zeman condemned Russia's invasion of Ukraine and called for tough sanctions to isolate \"the madman\" Putin.\n2021–present\nOn 17 April 2021, the Czech prime minister Andrej Babiš announced that the Czech Republic was expelling 18 Russian diplomats it had identified as GRU and SVR spies — after the Czech intelligence agencies had concluded that Russian military intelligence officers, namely members of Russian military intelligence GRU's unit 29155, were involved in two massive ammunition depot explosions in Vrbětice (part of Vlachovice), near the Czech-Slovak border, in October 2014. Shortly after, the Czech Republic formally informed the NATO allies on the matter and requested a joint statement at the NATO level as well as a follow-up North Atlantic Council meeting \"to discuss other possible coordinated steps\". In the wake of the expulsion, Bloomberg News commented that \"in a rare act of unity, Zeman took the government’s side against Putin\". The Russian government responded by expelling 20 Czech diplomats.\nFollowing Russia's own diplomatic response of expelling Czech diplomats, the newly appointed Czech foreign minister Jakub Kulhánek on 21 April gave the Russian government an ultimatum saying Russia had until 12 p.m. the next day to allow the return of all the Czech diplomats it had expelled from Moscow back to the Czech Embassy in Moscow and if that did not happen \"he would cut the number of Russian Embassy staff in Prague so it would correspond to the current situation at the Czech Embassy in Moscow\". On 22 April, as Russia refused to abide with the Czech demands in returning Czech staff to the Embassy in Moscow, the Czech foreign ministry announced it was reducing and capping the number of staff at the Russian Embassy in Prague at the current number of their staff in Moscow; the Russian embassy staff were required to leave the Czech Republic by 31 May 2021. The Czech government response was followed with support by a number of other EU countries expelling Russia's diplomatic personnel. The Russian government responded by setting the Czech Republic on its 'unfriendly countries list' along with the United States. As a result, the Czech embassy in Moscow are allowed to only hire up to 19 Russian locals, while the U.S. embassy in Moscow are not allowed to hire any Russian locals.\nIn November 2023 the Czech government froze all Russian State assets in their country, blocking the sale of land and buildings and bank accounts associated with the rental of such assets.\nIn 2024, Czech Foreign Minister Jan Lipavský summoned Russia's ambassador in Prague following an attack on a children's hospital in Kyiv, saying those who carried out the strike were the \"dregs of humanity\".\nOfficial visits\n{| class=\"wikitable\" border=\"1\"\n!Guest\n!Host\n!Place of visit\n!Date of visit\n|-\n| General Secretary Yuri Andropov\n| President Gustáv Husák\n|Prague\n| 3–5 January 1983\n|-\n| General Secretary Mikhail Gorbachev\n| President Gustáv Husák\n|Prague\n| 9–12 April 1987\n|-\n| President Boris Yeltsin\n| President Václav Havel\n|Prague\n|1993\n|-\n| President Vladimir Putin\n| President Václav Klaus\n|Prague\n| 1–2 March 2006\n|-\n| President Dmitry Medvedev\n| President Václav Klaus\n|Prague\n| 7–8 April 2010\n|-\n| President Dmitry Medvedev\n| President Václav Klaus\n|Prague\n| 7–8 December 2011\n|}\nTrade\nThe value of trade between the Czech Republic and Russia is in billions of US dollars. Most imports from Russia into the Czech Republic are raw materials such as fuels and metals; exports from the Czech Republic to Russia are mostly manufactured products.\nHowever, Russia was a smaller trade partner for the Czech Republic in 2016 following its economic downturn in 2015, as it was the destination of only 1.7% for Czech exports in 2016. The vast majority of exports from the Czech Republic go to other EU members (84.1% in 2016) while most imports into the Czech Republic come from other EU members (76,6% in 2013) or from China (7,3% in 2016). Despite that Czech-Russian trade was still higher than with US trade, reaching 9.21 billion US dollar for the Czech Republic in 2019. Czech exports to Russia grew 38.8% in 2016 to 2019.\nIn 2021 Russian exports to Czechia were $6.14 billion with natural gas being the main product. Czechia exports were $4.25 billion with vehicle parts being the main trade item. Between 1995 and 2021 Russian exports rose by an average of 5.28% p.a. with imports rising by 7.69% p.a.\nCzech imports of Russian gas ceased in 2022 with crude oil continuing to be imported until the Litvinov refinery can be adapted to process sweeter grades from other sources.\nPublic opinion\nas a symbol of communism in a museum in Prague]]\nWhile economic relations were good prior to the 2014 sanctions, and the Czech Republic is a common tourist destination for Russians, the Czech people themselves tend to be distrustful of Russia due to the Soviet invasion of 1968, and tend to hold a negative opinion of Russians as a legacy of Soviet-era conflicts. Among Czechs, Russia continuously remains one of the most negatively perceived countries in public opinion polls, and in 2016 only 26% of Czechs responded that they have either a \"very favorable\" or \"favorable\" opinion about Russia (versus 37% responding \"unfavorable\" or \"very unfavorable\"). For comparison, in the same poll, Czechs had similarly limited \"very favorable\" or \"favorable\" responses for other Eastern European countries (Ukraine 22%; Serbia 27%) and more \"very favorable\" or \"favorable\" responses for Western European countries (France 69%; U.K. 67%).\nRussia's espionage and other illicit activity in Czech Republic\n]]\nThe 2006 annual report by the Czech intelligence agency, Security Information Service (BIS), spoke of high levels of Russian espionage in the Czech Republic and highlighted \"security risks including an increasing influence by organized crime in the state sector\". The report also stated that \"intelligence services of the Russian Federation operating on Czech territory organize media campaigns and other activities supporting Russian interests\" and that the Czech Republic has been targeted by Russia due to its membership in NATO and the EU reflecting Russia's interests to acquire information about the functioning of these institutions. Russian influence has especially targeted Russian economic interests in the Czech Republic (i.e. the energy sector), but has also infiltrated into politics and media. The Russian intelligence activity focused on pro-Russian propaganda and on political, scientific, technical and economic espionage.\nIn 2009, two Russian diplomats were expelled from the Czech Republic due to espionage. As of 2015, according to the Security Information Service, the most active foreign espionage in the Czech Republic originated from Russia, followed by China.\nAs of 2017, there were 140 Russian nationals accredited in the Czech Republic as diplomats, a disproportionately large number compared to other countries, and also compared to only 65 Czech diplomats in Russia. Senior representatives of the 40,000-strong ethnic Russian community in the Czech Republic has accused the Russian Embassy of attempting to recruit the community's members as agents of influence, setting up the Coordinating Council of the Russian Compatriots in the Czech Republic.\nIn December 2018, the BIS revealed that it prevented the activity of dozens of Russian spies during the previous five years, and earlier that year it uncovered and broke up a network of Russian intelligence informants.\nAccording to a 2016 study by the Czech Masaryk University in Brno, pro-Russian websites Sputnik and Parlamentní listy are major pro-Russian in the Czech Republic; the latter of which is described by the report as a particular source of disinformation along with several other publications. Russian information war focuses on spreading misinformation about the EU and NATO, trying to change public perception of Russia and bribing local politicians. Czech officials estimate that the Russian government is behind approximately 40 Czech-language websites presenting radical views, conspiracy theories and inaccurate reports. According to Tomáš Prouza, the \"key goal of Russian propaganda in the Czech Republic is to sow doubts into the minds of the people that democracy is the best system to organize a country, to build negative images of the European Union and NATO, and [to] discourage people from participation in the democratic processes\".\nIn 2017, a special unit, the Centre Against Terrorism and Hybrid Threats, was founded under the Ministry of the Interior to counter the threats from Russia among other issues. Czech investigative journalists publish an up-to date list of pro-Russian publications.\nRussians in the Czech Republic\n]]\nImmigration\nThere is an immigrant minority of 33 970 Russian citizens with a residence permit in the Czech Republic for a period of 12 months or more, as of 2016. It is the fourth largest immigrant group after Slovaks, Ukrainians and Vietnamese, followed by Germans. Russians have the largest proportion of university educated individuals among other immigrant groups. Most incoming Russians are members of the middle or upper classes and their reasons for migration into the Czech Republic are desire for a life in the European Union, better healthcare in the Czech Republic, high levels of corruption in Russia and also political reasons. Russian immigrants have large proportion of business people in comparison with other immigrant groups.\nIn 2024, the Czech political party STAN, which is part of the Cabinet of Petr Fiala, launched a campaign against the Russian minority in the Czech Republic with the slogan, \"We don't need Putin's matryoshka dolls in the Czech Republic!\" On 6 February 2025, Czech President Petr Pavel signed a bill prohibiting Russians from obtaining Czech citizenship, even if they have lived in the Czech Republic for many years. Critics say the law is discriminatory, contrary to European values, and will affect Russian opponents of Putin's regime rather than Russian spies, who can enter the country with a foreign passport.\nTourism\nThe Czech Republic is a popular destination for Russian tourists. In 2017, over 550,000 Russians visited the country.\nExtraditions\nRussia's Prosecutor General's Office has requested the extradition of journalist Farida Kurbangaleeva from the Czech Republic. Kurbangaleeva, a former anchor for Russia's state-controlled Rossiya 1 TV channel, left Russia in 2014 following the annexation of Crimea and the conflict in eastern Ukraine. The extradition request, which Kurbangaleeva shared on Facebook, does not specify charges, but she believes it relates to previous allegations of \"justifying terrorism\" and disseminating \"false information\" about the Russian military. In June of the previous year, she was placed on Russia's wanted list, labeled a \"foreign agent,\" and charged in absentia. Since relocating to Prague, Kurbangaleeva has worked with the Russian-language TV channel Current Time and currently collaborates with the exiled news outlet Govorit NeMoskva, in addition to managing her own YouTube channel. She has dismissed the charges as fabricated and expressed confidence that Czech authorities will not comply with the extradition request.\nOn 22 May 2025 Czechia's Prague Municipal Court has ruled against her extradition, the court accepted the argument presented by state prosecutor Kateřina Štěpánková, deeming the extradition inadmissible.\nResident diplomatic missions\n* the Czech Republic has an embassy in Moscow.\n* Russia has an embassy in Prague.\nSee also\n* Foreign relations of the Czech Republic\n* Foreign relations of Russia\nReferences\nExternal links\n*[https://web.archive.org/web/20070706063029/http://www.mzv.cz/wwwo/default.asp?id=34998&ido=1140&idj=41&amb=54&ParentIDO=1140 Embassy of the Czech Republic in Moscow]\n*[http://www.mzv.cz/petersburg Consulate-General of the Czech Republic in Saint Petersburg]\n*[http://www.czech.mid.ru/  Embassy of the Russian Federation in Prague]"
    }
  ]
}