{
  "content": [
    {
      "type": "text",
      "text": "# Czech Republic–Germany relations__disambig_1\n\nCzech–German relations are the relationships between the Czech Republic and Germany. The two countries share 815&nbsp;km of common borders and both are members of the European Union, NATO, OECD, OSCE, Council of Europe and the World Trade Organization.\nCountry comparison\n{| class=\"wikitable\"\n!Official name\n!Czech Republic\n!Federal Republic of Germany\n|-\n!Common name\n! width=\"400\" |Czechia\n! width=\"400\" |Germany\n|-\n!\n| style=\"text-align:center\" |\n| style=\"text-align:center\" |\n|-\n!\n|\n| style=\"text-align:center\" |\n|-\n!\n|\n|}}\n|-\n!\n|10,649,800\n|84,432,670\n|-\n!\n|78,866&nbsp;km2 (30,450 sq mi)\n|357,600&nbsp;km2 (138,100 sq mi)\n|-\n!\n|134/km2 (347.1/sq mi)\n|232/km2 (600.9/sq mi)\n|-\n!\n| colspan=\"2\" |UTC+1 (CET)\n* DST UTC+2 (CEST)\n|-\n!\n|Unitary parliamentary constitutional republic\n|Federal parliamentary republic\n|-\n!\n| – 1,324,277 (2,677,964 Metro)\n| – 3,850,809 (6,144,600 Metro)\n|-\n!\n|Czech\n|German\n|-\n!\n|Bořivoj I, Duke of Bohemia (867–889, traditionally)\nVáclav Havel (1936–2011, current constitution)\n|Louis the German (843-876, traditionally)\nKonrad Adenauer (1876-1967, current constitution)\n|-\n!\n|Prime Minister Petr Fiala (ODS; 2021–present)\n|Chancellor Friedrich Merz (2025–present)\n|-\n!\n|President Petr Pavel (2023–present)\n|President Frank-Walter Steinmeier (2019–present)\n|-\n!\n|$261.732 billion\n$24,569 per capita\n|$4.309 trillion\n$51,384 per capita\n|-\n!\n|$432.346 billion\n$40,586 per capita\n|$5.546 trillion\n$66,132 per capita\n|-\n!\n|Czech koruna (Kč) – CZK\n|Euro (€) – EUR\n|-\n!\n|0.891 (very high) – 2017\n|0.942 (very high) – 2021\n|-\n!\n|21,267 Germans in the Czech Republic\n|503,000 Czechs in Germany\n|}\nBackground\nBohemia and Moravia (now in the Czech Republic) were settled in the 6th century by Czechs, as part of the post-Roman migration of peoples. Later German settlers constituted a minority in the Czech lands and relations between the two communities were generally amiable. In the Middle Ages, the Bohemian (Czech) realm, itself a part of the Holy Roman Empire, extended to territories located in present-day Germany, such as Lusatia and the Bohemian Palatinate. After the extinction of the Czech Přemyslid dynasty, the Kingdom of Bohemia was ruled by the House of Luxembourg, the Jagiellonians, and finally the Habsburgs. In the Thirty Years' War, the Protestant Czechs resisted Holy Roman Emperor Ferdinand II's attempt to reintroduce Catholicism. After the Czechs' defeat at the Battle of White Mountain in 1620, the Czech nobility and educated Protestant population was slaughtered or exiled, the Czech lands made a hereditary possession of the Austrian Empire and German made the official language. The Czech language declined, and became endangered until the Czech National Revival in the late 18th century. Tensions deteriorated between the Czechs and the Germans, and after World War I, when Tomáš Garrigue Masaryk convinced American President Woodrow Wilson to establish a Czechoslovak state in Central Europe on the principle of national self-determination, after three hundred years of Austrian domination, with  a significant German minority (30% of the total population) in the nation's borderlands, which had a majority German population.\nin German-occupied Prague in 1939]]\nAfter Adolf Hitler's rise to power in Germany, the Nazi German government sought to inflame nationalistic tensions in neighbouring Czechoslovakia, and instructed local Nazi leader Konrad Henlein, the leader of the German minority in the Czech borderlands, to make unreasonable demands on the Czech government and to attempt to paralyse the First Czechoslovak Republic. Ethnic German nationalists backed by Hitler demanded the union of German-speaking districts with Germany. At the height of Western Appeasement of Nazi Germany, the British and French-backed Munich Agreement granted the German areas, including all of the crucial Czechoslovak border fortifications, to Germany. Despite the Czech-French alliance, Czech officials were not invited to negotiate and were informed of the agreement only after its conclusion. The defenceless Czechoslovak state was forced to give up one third of Slovakia to Hungary, and the Trans-Olza area, containing the only railway between the Czech lands and Slovakia, to Poland. The Czechoslovak leadership fled to London and Hitler seized the rest of Czechoslovakia. The German occupation of Czechoslovakia destroyed the Czechoslovak state, the only Central European parliamentary democracy, and sought to \"reintegrate\" Bohemia and Moravia into the Nazi empire. This Nazi German policy took the form of so-called Grundplanung OA (Basic planning) from the summer of 1938, which included the extermination of Czech nation, and later the genocidal Generalplan Ost.\nAt the end of the war, as part of the post-war flight and expulsion of Germans, the German population was expelled from Czechoslovakia in accordance with the Potsdam Agreement and Beneš decrees. These expulsions were carried out by the army and wartime resistance forces. An estimated 2.4 million ethnic Germans were deported to East and West Germany, of whom several thousand perished in the population movement. There have been calls within Germany for the compensation of the refugees, which the Czech government has refused to entertain, citing the German occupation, wartime injustices, the German minority's support for the Nazi Party, genocidal plans by the German government, and atrocities such as the Lidice massacre.\nModern relations\nAfter the end of the Cold War, relations warmed between the newly-reunified Federal Republic of Germany and the newly-democratic Czech Republic. On 27 February 1992, German Chancellor Helmut Kohl and Czechoslovak President Václav Havel signed a treaty of friendship, known as Czech-German Declaration. In 2012, German President Joachim Gauck and Czech President Václav Klaus jointly visited Lidice, a Czech village razed to the ground by German forces in 1942, heralding a leap in Czech-German rapprochement. As a result of the Schengen Agreement, there are no border checks between the two countries, and their borders are completely open to one another. Citizens from one state may also freely move to and work in the other state as a result of the European Union's freedom of movement for workers.\nRelations with the Free State of Bavaria\nIn December 2010 and November 2011, Horst Seehofer was the first Minister-President of Bavaria, who visited the Czech Republic. This was considered an important step in the dispute over the expulsion of the Sudeten Germans after the Second World War. In February 2013 the then Czech Prime Minister Petr Nečas was the first Prime Minister to visit the Free State of Bavaria. In a speech in front of the Bavarian Parliament he regretted the expulsion of the Sudeten Germans.\nOn December 4, 2014, the Minister-President Horst Seehofer opened the Representation of the Free State of Bavaria in the Czech Republic. Among the guests of the opening ceremony were the Czech Prime Minister Bohuslav Sobotka and many Czech and Bavarian ministers. In his speech, Seehofer praised the establishment of a Bavarian Representation in the Czech Republic as a symbol of the growing friendship between Bavaria and the Czech Republic and for a common Europe. The Bavarian Representation should be a place for dialogue, friendship and cooperation.\nEducation\n]]\nThe Deutsche Schule Prag is a German international school in Prague.\nResident diplomatic missions\n* the Czech Republic has an embassy in Berlin and consulates-general in Dresden, Düsseldorf and Munich.\n* Germany has an embassy in Prague.\nFile:Tschechische Botschaft - panoramio.jpg|Embassy of the Czech Republic in Berlin\nFile:German embassy in Prague.jpg|Embassy of Germany in Prague\nSee also\n* Germans in Czechoslovakia (1918–1938)\n* Austro-German relations\n* German-Polish relations\n* Foreign relations of Czech Republic\n* Foreign relations of Germany\n* Czechs in Germany\n* Germans in the Czech Republic\nNotes\nReferences\nReferences to Books\n* Detlef Brandes and Václav Kural (eds.): Der Weg in die Katastrophe. Deutsch-tschechoslowakische Beziehungen 1938–1947. Klartext, Essen 1994, 255 pp.\n* Václav Kural: Konflikt anstatt Gemeinschaft? Tschechen und Deutsche im tschechoslowakischen Staat (1918–1938). Ústav mezinárodních vztahů, Praha 2001, 359 pp.\n* Václav Kural: Místo společenství konflikt. Češi a Němci ve Velkoněmecké říši a cesta k odsunu (1938–1945). Ústav mezinárodních vztahů, Praha 1994, 296 pp.\nExternal links\n* [http://www.auswaertiges-amt.de/diplo/en/Laenderinformationen/01-Laender/TschechischeRepublik.html  German Federal Foreign Office about relations with the Czech Republic]\n* [https://web.archive.org/web/20120209150335/http://www.prag.diplo.de/Vertretung/prag/de/Startseite.html  German embassy in Prague (in Czech and German only)]\n* [http://www.mzv.cz/wwwo/default.asp?idj=36&amb=2  Czech embassy in Berlin (in Czech and German only)]\n* [http://www.mzv.cz/wwwo/default.asp?id=5054&ido=815&idj=1&amb=2&ParentIDO=815 Czech general consulate in Bonn (in Czech and German only)]\n* [http://www.mzv.cz/wwwo/?zu=dresden  Czech general consulate in Dresden (in Czech and German only)]\n* [http://www.mzv.cz/wwwo/?zu=munich  Czech general consulate in Munich (in Czech and German only)]"
    }
  ]
}