{
  "content": [
    {
      "type": "text",
      "text": "# D.H. and Others v Czech Republic\n\nD.H. and Others v. the Czech Republic (No. 57325/00) was a case decided by the European Court of Human Rights (ECtHR) concerning discrimination of Romani children in the education system of the Czech Republic. It was the first case of racial segregation in education to be considered by the ECtHR. As of 2021 the case is still pending at the Committee of Ministers and has not been resolved by the Czech authorities.\nFacts and proceedings\nMost children from the Roma minority in Ostrava attended special schools with simplified curriculum, forming majority of their students.\nThe applicants — 18 Romani students, former and then-attendants of special schools, represented by the European Roma Rights Centre — submitted an application to ECtHR in 2000.\nThe Court has declared in 2005 the application admissible in part on Article 14 (prohibition of discrimination), combined with Article 2 of Protocol No. 1 (right to education) of the European Convention on Human Rights. The application in part concerning Articles 3 and 6 was declared inadmissible.\nChamber judgment\nIn 2006, the Second Section of the Court has found no violation in the case, by six votes to one. Judge Costa filed a concurring opinion, agreeing with the majority while saying that \"I came to that conclusion only after some hesitation\". Judge Cabral Barreto filed a dissenting opinion, finding a violation of Article 14, taken together with Article 2 of Protocol No. 1.\nThe applicants appealed to the Grand Chamber.\nGrand Chamber judgment\nIn 2007, the Grand Chamber has found in the case a violation of Article 14, taken together with Article 2 of Protocol No. 1, by 13 votes to 4. Judges Zupančič, Jungwiert, Borrego Borrego and Šikuta have filed dissenting opinions, finding no violation.\nThe Grand Chamber found that there was an indirect form of discrimination since Roma children de facto received inferior education because of their ethnic origin.\nSee also\n*Relations between ethnic Czechs and Roma\n* List of Romani rights cases before international courts and quasi-judicial bodies\nReferences\nExternal links\n*[http://www.errc.org/cikk.php?cikk=2945 Collection of documents of the case on ERRC website]\n*[http://hudoc.echr.coe.int/webservices/content/pdf/001-72317?TID=thqwhudane Chamber judgment]\n*[http://hudoc.echr.coe.int/webservices/content/pdf/001-83256?TID=thqwhudane Grand Chamber judgment]"
    }
  ]
}