{
  "content": [
    {
      "type": "text",
      "text": "# Dade battle__disambig_1\n\n| result            = Seminole victory\n| combatant2        =\n| combatant1        = Seminole\n| commander2        =  Francis Dade    George Gardiner   Upton Fraser\n| commander1        = Micanopy  Chipco  Thlocklo TustenuggeeHalpatter Tustenuggee (Alligator)JumperAbraham\n| strength2         = 110  1 six-pounder cannon\n| strength1         = 180\n| casualties2       = 108 killed  1 wounded\n| casualties1       = 3 killed  5 wounded|\n}}\n]]\nThe Dade battle (often called the Dade massacre) was an 1835 military defeat for the United States Army.\nUnder the Indian Removal Act of 1830 the U.S. was attempting to force the Seminoles to move away from their land in Florida provided by the Treaty of Moultrie Creek (following the American annexation of Spanish Florida see the Adams-Onis Treaty) and relocate to Indian Territory under the terms of the Treaty of Payne's Landing.\nTwo U.S. Army companies numbering 103 men under the command of Major Francis L. Dade were ambushed by approximately 180 Seminole and Black Seminole warriors as they marched from Fort Brooke on Tampa Bay to reinforce Fort King in Ocala. Only three U.S. soldiers and their guide Louis Pacheco survived the attack, and one died of his wounds the following day.\nThe battle sparked the Second Seminole War, which ended in 1842. By that time, most Seminoles had surrendered and been transported out of Florida, and a small group remained in central Florida (see Chipco's band) while another portion had moved further south to the edges of the Everglades in the Big Cypress (see Abiaka and Holatta Micco).  There was no formal treaty ending this conflict which was another chapter in the long fought Seminole Wars.\nThe battle\nOn December 23, 1835, two U.S. companies of 110 men (including soldiers from the 2nd Artillery, 3rd Artillery and 4th Infantry Regiments) under Major Francis Langhorne Dade departed from Fort Brooke (present-day Tampa), heading up the Fort King military road on a resupply and reinforce mission to Fort King (present-day Ocala).  Several Seminoles with their warriors assembled secretly at points along the march. Scouts reportedly watched the troops in their sky-blue uniforms at every foot of the route and sent reports back to the Indian chiefs.\nThe Seminoles in Florida had grown increasingly furious at attempts by the U.S. Army to forcefully relocate them to a reservation out west and Dade knew his men might be attacked by the Seminole Indians who were shadowing his regiment, but believed that if an attack were to occur, it would come during one of the river crossings or in the thicker woods to the south. Having passed these, he felt safe and recalled his flanking scouts in order that the command could move faster.  Although the terrain he was now in, pines and palmettos, could not have concealed anyone who was riding horseback or marching, it could and did conceal crouched (or prone) warriors waiting in ambush.\nThe Seminoles refrained from attacking in the other places, not because they thought they could achieve better surprise later but because they were waiting for Osceola to join them. However, at the time he was busy trying to kill U.S. Indian Agent Wiley Thompson. They finally gave up waiting and attacked without him. The troops marched for five quiet days until December 28, when they were just south of the present-day city of Bushnell which is approximately  south of Fort King. They were passing through a high hammock with oaks, pines, cabbage palms, and saw palmetto when a single shot rang out. The Seminoles had terrain and the element of surprise in their favor.\nMany sources state that the first shot and the following storm of bullets brought down Major Dade and half his men. Dade, who was on horseback, was killed in the Seminoles' very first shot fired personally by Chief Micanopy, which by pre-arranged plan began the attack. Following Dade's death, command passed to Captain George W. Gardiner. Many of the soldiers, in two single file lines, were also quickly killed. Only a few managed to get their flintlock muskets from underneath their heavy winter coats.\nAn eyewitness account by Seminole leader Halpatter Tustenuggee (also known as Chief Alligator) read as follows:\n\"We had been preparing for this more than a year... Just as the day was breaking, we moved out of the swamp into the pine-barren. I counted, by direction of Jumper, one hundred and eighty warriors. Upon approaching the road, each man chose his position on the west side... About nine o'clock in the morning the command approached... So soon as all the soldiers were opposite... Jumper gave the whoop, Micanopy fired the first rifle, the signal agreed upon, when every Indian arose and fired, which laid upon the ground, dead, more than half the white men. The cannon was discharged several times, but the men who loaded it were shot down as soon as the smoke cleared away... As we were returning to the swamp supposing all were dead, an Indian came up and said the white men were building a fort of logs. Jumper and myself, with ten warriors, returned. As we approached, we saw six men behind two logs placed one above another, with the cannon a short distance off... We soon came near, as the balls went over us. They had guns, but no powder, we looked in the boxes afterwards and found they were empty.  The firing had ceased, and all was quiet when we returned to the swamp about noon.  We left many negroes upon the ground looking at the dead men. Three warriors were killed and five wounded.\"\nThe battle began either at 10:00 a.m. (according to Alligator) or at 8 a.m. and ending around 4 p.m. (according to survivor Private Ransom Clark), with the Native and Maroon allies leaving around sunset.  \"The Indians did not scalp or loot.  They took food, and some clothes and ammunition, but nothing else. Only when they had withdrawn did a swarm of Negroes come to kill the wounded and loot the dead.\"\nOnly three U.S. soldiers were reported to have survived the attack. Private Edward Decourcey had been covered by dead bodies, but for Ransom Clark, \"the negroes, after catching me up by the heels, threw me down again with an oath: ''\"He's dead enough.\"''  Then they stripped me of my clothes, shoes and hat and left me.\"  The Indians hadn't scalped or butchered the dead and wounded when they over-ran Dade's men; they were in a hurry and were after guns, ammunition, and supplies. But when the Indians left the field, \"negroes fifty or sixty in number, came up on horseback, entered the enclosure, and commenced hacking and cutting the wounded in a most savage manner...[with] frequent cries of \"what have you got to sell?\" The next day, a Seminole pursued them on horseback and Decourcey was killed after they had split to avoid joint capture.  Clark made it back to Fort Brooke, collapsing within a mile of the Fort and being helped all the way back by a friendly Indian woman. Clark provided the only narrative from the Army's side of what had occurred. A third soldier, Private Joseph Sprague, age 32, born in Vergennes, Vermont, was on his 2nd enlistment and assigned to company B, 3rd Artillery.  Pvt Sprague arrived at Fort Brooke on New Year's Day 1836, surviving his arm wound, and served in the army for 25 years, leaving the military in March 1843.  He died in White Springs, Florida \"probably in 1848.\" He was illiterate, and did not leave a report of the battle.\nIn 1837, Louis Pacheco, the mulatto slave who guided and interpreted for the Dade command, resurfaced and gave a third eyewitness account of the battle. Pacheco had been ahead of the column, by his account, and was taken prisoner by the Indians; some thought him to be a turncoat or informer. He was shipped west with the Indians about that time, but returned to Florida shortly before his death in early 1895.\nAftermath\nAfter the battle, many large plantations were burned and settlers killed.  By the end of 1836, all but one house in what is now Miami-Dade County and Broward County had been burned by the Indians.  The Indians were emboldened by their successes against Dade's command, the stalemate at the subsequent Battle of Ouithlacoochie and the killing by Osceola of Indian agent Wiley Thompson on the same day of the battle, which is what had delayed Osceola.  While about half of Dade's men consisted of new American immigrants, the rest of the killed soldiers were from many other states.\nNews of the battle was reported in the Daily National Intelligencer, Washington, D.C., in the Wednesday, January 27, 1836, edition as follows:\n“Major Dade, with seven officers and 110 men, started the day before we arrived, for Fort King. We were all prepared to overtake them the next day….when an intervention of circumstances deferred it for one day–and in the course of that day, three soldiers, horribly mangled, came into camp, and brought the melancholy tidings that Major Dade, and every officer and man, except themselves, were murdered and terribly mangled.”\nThe impact of the Florida hostilities dominated the national news until later events that year at the Alamo.  Due to these heightened hostilities, President Andrew Jackson called for volunteers from Florida (see Richard Keith Call), Georgia and South Carolina.  General Winfield Scott was ordered to Florida to assume command of all U.S. forces in the area.  General Edmund P. Gaines and 1100 men reached the Dade battlefield two months later on February 20, 1836 - the first U.S. soldiers to do so.  There they performed the duty of identifying the bodies for burial.\nThe dead soldiers were first buried at the site by General Gaines.  After the cessation of hostilities in 1842, the remains were disinterred and buried in St. Augustine National Cemetery on the grounds of St. Francis Barracks, the present day military installation that serves as headquarters for the Florida National Guard.  The remains rest under 3 coquina stone pyramids along with the remains of over 1,300 other U.S. soldiers who died in the Second Seminole War.\nThe Dade Monument (West Point), erected in 1845, also memorializes the battle.  Today, annual reenactments detail the battle events at the Dade Battlefield State Historic Site.\nSee also\n* List of battles won by Indigenous peoples of the Americas\n* Dade Battlefield Historic State Park\nReferences\nFurther reading\n*Barr, James, Capt. (1836). ''Correct and Authentic Narrative of the Indian War in Florida, with a Description of Maj. Dade's Massacre, and an account of the extreme suffering, for want of provisions, of the Army-Having been obliged to eat Horses' and Dogs' Flesh, etc.New York: J. Narine, Printer, 11 Wall St.\n*Bemrose, John (1966). Reminiscences of the Second Seminole War.  University of Florida Press. Edited by John K. Mahon.\n*Cohen, Myer M. (An Officer of the Left Wing). (1836). Notices of Florida and The Campaigns. New-York: B. B. Hussey, 378 Pearl-Street\n*Mahon, John K. (1992) History of the Second Seminole War 1835-1842. University of Florida Press. P. 106.\n*Laumer, Frank (1995) Dade's Last Command. University Press of Florida.\n*Laumer, Frank (2008). Nobody's Hero, A novel'' The story of Pvt. Ransom Clark, survivor of Dade's Battle, 1835.Pineapple Press, Inc. Sarasota, Florida.\nExternal links\n* [http://www.dadebattlefield.com/ Dade Battlefield Society]\n* [https://web.archive.org/web/20100624014326/http://digitalcollections.fiu.edu/tequesta/files/1986/86_1_01.pdf Last Command: The Dade Massacre] contains the Clarke, Alligator and Pacheco accounts\n* [https://penelope.uchicago.edu/Thayer/E/Gazetteer/Places/America/United_States/Florida/_Texts/FHSQ/5/3/Dade_Massacre*.html The Dade Massacre, Florida Historical Quarterly Jan. 1927]\n* [https://books.google.com/books?id=V1pFAAAAYAAJ&dq=The+loss+of+the+enemy+must+have+been+very+great%2C+because+we+never+fired+until+we+fixed+on+our+men%3B+but+the+cannon+was+necessarily+fired+at+random%2C+as+only+two+or+three+Indians+appeared+together.&pg=PA103 Ransom Clark's Account of the Dade Massacre, American Monthly Magazine (1837)]"
    }
  ]
}