{
  "content": [
    {
      "type": "text",
      "text": "# Dagdi Jowar of Jalna\n\n}}\nDagdi Jowar of Jalna is a variety of sorghum cultivated in the Indian state of Maharashtra. Dagdi jowar is a variety of grain and widely cultivated crop in the Jalna district.\nUnder its Geographical Indication tag, it is referred to as \"Dagdi Jowar of Jalna\".\nName\nDagdi Jowar of Jalna is a prized crop in Jalna and so named after it. The name \"Dagdi Jowar\" originates from the word \"Dagdi\" which means stone-like in the local state language of Marathi, referring to the varying pod sizes of the crop. Unlike stones, which are uniform in size, the pods of this crop come in different sizes, with some smaller and some larger. This characteristic led to the crop being named \"Dagdi Jowar\". Locally it is known as \"Dagdi Jwari\".\nDescription\nDagdi Jowar, also known as sorghum bicolor, is a type of millet with grain sizes ranging from 2 to 4 mm in diameter and reddish-white in color. The crop is used for various purposes, including food, animal feed, ethanol production, and making corn brooms.\nIn Jalna district, a unique variety of Dagdi Jowar is cultivated, characterized by an inverted grain holding husk. This crop has been grown for generations and serves as food and fodder. Locals make bhakri from Dagdi Jowar flour, mixing it with hot water and flattening it by hand.\nGeographical indication\nIt was awarded the Geographical Indication (GI) status tag from the Geographical Indications Registry, under the Union Government of India, on 30 March 2024 and is valid until 28 August 2032.\nJai Kisan Shetkari Gat Matrewadi from Badnapur, proposed the GI registration of Dagdi Jowar of Jalna. After filing the application in August 2022, the jowar was granted the GI tag in 2024 by the Geographical Indication Registry in Chennai, making the name \"Dagdi Jowar of Jalna\" exclusive to the jowar crop grown in the region. It thus became the second jowar variety from Maharashtra after Mangalwedha jowar and the 52nd type of goods from Maharashtra to earn the GI tag.\nThe GI tag protects the jowar from illegal selling and marketing, and gives it legal protection and a unique identity.\nSee also\n* Mangalwedha jowar\nReferences"
    }
  ]
}