{
  "content": [
    {
      "type": "text",
      "text": "# Daikoku Parking Area\n\n| location_map=Japan Yokohama\n| road = 20px Daikoku Route\n| type = }}\nThe  is a rest area located on the Daikoku Route of the Shuto Expressway in Tsurumi-ku, Yokohama, Kanagawa Prefecture.\nIt is the largest parking area on the Shuto Expressway. It is connected to Daikoku Junction and can be accessed from all directions except the Daikoku Pier entrance. Since it is possible to enter and leave from all directions of Daikoku Junction, before the improvement of Honmoku Junction, the Daikoku parking area turnaround was a way to go between the Bayshore Route towards Sachiura and the Kariba Route towards Ishikawachō. Access to Daikoku PA is only by car via expressway, so there is no public transportation to this parking area.\nFacility\nThe main building is located on the west side of the area, and the bayside terrace second building is located on the north side, and both facilities can be used from all directions.\nIt was reopened on March 1, 2020.\n*Parking Lot\n**341 small units\n**59 large units\n**4 for people with disabilities\n*Toilet\n**Men Large 16 + Kids Corner 1, Small 30 + Kids Corner 1\n**Women 46 + Kids Corner 1\n**For people with disabilities 3\n*Restaurant (Weekdays 11: 00-21: 00 / Saturdays, Sundays, and holidays 11: 00-21: 30)\n*Snack corner (7: 00-21: 00)\n*Shop (7: 00-21: 00)\n*Lawson (open 24 hours)\n*ATM (AEON Bank)\n*Quick charger for electric vehicles\n**On October 10, 2008, a charger for electric vehicles was installed for the first time on Japanese highways.\nPreviously, there was a McDonald's at the facility, which was Japan's 2000th McDonald's restaurant, but it closed on April 2, 2010. After that, Cafe de Clie opened, but it also closed on March 15, 2017.\nIn addition, the former Yokohama Bay Bridge \"Yokohama Sky Walk\" users were able to leave the PA only from 10:00 to 18:00 (the Skywalk ticket purchase window is on the form passed at the entrance). They had to get stamped at and submit it to the doorway when they come back). The Yokohama Sky Walk was closed on September 26, 2010.\nCar enthusiasts meeting place\nDue to the large parking space, it is often used as a meeting place for private cars, and on holidays there are cases where the parking lot is full even though there are few people in the facility. For this reason, a banner is displayed in the area to call for refraining from parking for a long time, which is not the original purpose of resting.\nIn addition to rare supercars and sports cars, it is often used as a gathering place for custom cars such as VIP cars, lowriders, vannings, runaway tribes, and tuning cars. Currently, construction work is being carried out to prevent the entry of illegal low-down vehicles, and there are steps. Also, on Fridays and Saturdays at midnight, usage will be restricted due to neighborhood acoustic measures. However, the entry of lowriders is still continuing. The Kanagawa Prefectural Police and the Ministry of Land, Infrastructure, Transport and Tourism are collaborating to crack down on parking on a regular basis, and in the case of the crackdown on November 14, 2020, 20 cars were caught because the vehicle height was too low.\nReferences\nExternal links\n* [https://www.shutoko-sv.jp/parking_area/pa/?id=1431075208-683388 Daikoku PA] - Daikoku PA-Metropolitan Expressway Service"
    }
  ]
}