{
  "content": [
    {
      "type": "text",
      "text": "# Dale Warland\n\nDale Warland (born April 14, 1932, Fort Dodge, Iowa) is an American conductor, composer, founder of the Grammy-nominated Dale Warland Singers, scholar, teacher, choral consultant, and renowned champion of contemporary choral composers. Warland is one of only two choral conductors (along with Robert Shaw (conductor)) inducted into the American Classical Music Hall of Fame.\nProfessional biography (in brief)\nWhile enrolled at St. Olaf College in Northfield, Minnesota, Warland began rehearsing and performing with choirs. After graduating, he spent two years in the U.S. Air Force where he started a choir of servicemen. The choir was invited to perform for then-Vice President Richard Nixon.\nAfter the Air Force, he completed his Master of Arts degree in theory and composition at the University of Minnesota in 1960 and his Doctor of Musical Arts degree in choral conducting at the University of Southern California in 1965.\nA brief tenure as director of choral music at Humboldt State College followed, leading to an appointment as professor of music and director of choral activities at Macalester College, where he remained until 1985.\nIn 1972, he formed the Dale Warland Singers. The group quickly gained an international reputation for their flawless performance of choral works by contemporary composers, and, with Warland leading the way, the DWS organization would become renowned for its support of living composers.  Under his direction, the DWS made influential and award-winning recordings, toured internationally, were guest-conducted by choral greats, and won several prestigious awards.  The group disbanded in 2004 after 32 years.\nWarland continues to function as a choral composer, editor of choral publications, consultant to publishing companies, scholar, teacher, and guest conductor.\nThe Dale Warland Singers\nIn 1972, while on the faculty at Macalester College, Warland was asked by the Walker Art Center (in Minneapolis) to form a choir for a special project. This group of 40 singers became the Dale Warland Singers. Under his direction, the Singers toured Europe and were awarded the ASCAP Margaret Hillis Achievement Award, ASCAP awards for Adventurous Programming (1992, 1993, 1996 and 1999), the ASCAP Victor Herbert Award (2003), the Distinguished Master Artists Award (University of South Florida (2004)), the Sally Ordway Irvine Award for Vision (2003), and many others. Their 2003 CD, \"Walden Pond\" was nominated for a Grammy Award for Best Choral Performance. Over the years, the Singers became known for exceptional blend, intonation, attacks, and uniformity of sound.\nAfter the Dale Warland Singers\nWarland disbanded the DWS in 2004, in part to pursue more teaching and composing opportunities. The Dale Warland Singers Choral Score Library was purchased by University of Cincinnati College-Conservatory of Music (a/k/a Cincinnati Conservatory, a/k/a CCM), which serves as custodian of those scores.  The papers of the DWS organization also are housed and managed by CCM.  Warland continues working with young students and directors through the Choirs of Note. In 2007 he was commissioned by the Utah Chamber Artists to write an a capella piece for their 2008 European summer tour. Benedicamus Domino for SSATBB, was premiered at the Utah Chamber Artists' Winter Concert on March 3, 2008. With Warland in attendance, the Utah Chamber Artists performed the piece at St Bride's Church in London and the Landmark Arts Centre in Teddington on June 17, 2008, and at St. Paul's Cathedral in London on June 18, 2008.  Warland has guest conducted several prominent choral ensembles since his retirement from the DWS, including Opus 7 and the Cincinnati Vocal Arts Ensemble. Since 2010, Warland has conducted the Minnesota Beethoven Festival Chorale, part of the Minnesota Beethoven Festival in Winona, Minnesota.  This ensemble, which has ranged in size from 42 to 44 voices, has included many of the former members of the Dale Warland Singers, and has presented two concerts on the July schedule of the festival each year.  The 2012 Minnesota Beethoven Festival performances featured the premiere of Warland's arrangement of \"Tenting On The Old Campground,\" written for the Festival Chorale.\nCompositions and arrangements\nWarland has composed and arranged many works for choir over the decades.  Most are published in his choral series (see below), but others are not \"housed\" in a series.\nChoral series\nThe Dale Warland Choral Series is a collection of choral scores selected for publication by Warland.  Over the years, the series has been published by several companies (Earthsongs, G. Schirmer), Walton, Plymouth, and Colla Voce, these works may be thought of as separate series all with the same name (the series with G. Schirmer is actually titled \"The Dale Warland Schirmer Choral Series\").  Works included in the series are listed here alphabetically by title; since choral scores continue to be published, this list will become outdated with each batch of new releases.\n*Aprile/April (Carol Barnett) - pub. Colla Voce\n*Ave Maria (Cary Boyce) - pub. G. Schirmer\n*Beautiful River (arr. William Hawley) — pub. Colla Voce\n*By And By (arr. Carol Barnett) — pub. Colla Voce\n*Calm on the Listening Ear of Night (Kenneth Jennings) - pub. Walton\n*Cançao de Embalar (Janika Vandervelde) - pub. Earthsongs\n*Catalonian Carol (arr. Dale Warland) — pub. Colla Voce\n*Cedit, Hyems (Abbie B. Betinis) - pub. G. Schirmer\n*Cindy (arr. Carol Barnett) — pub. Colla Voce\n*December Stillness (Paul Fetler) - pub. Walton\n*Deep River (arr. Carol Barnett) — pub. Colla Voce\n*El Rorro (arr. Jeffery Van) — pub. Colla Voce\n*The Friendly Beasts (arr. Jeffrey Van) - pub. Colla Voce\n*Hard Times Come Again No More (arr. Mark Keller) — pub. Colla Voce\n*Hark The Herald Angels Sing (arr. Carol Barnett) - pub. Colla Voce\n*Hodie (Carol Barnett) - pub. Walton\n*Huron Carol (arr. Dale Warland) - pub. Colla Voce\n*I would live in your love (Nathan Jones) - pub. G. Schirmer\n*McKay (arr. Carol Barnett) - pub. Earthsongs\n*Miserere (Rudi Tas) - pub. G. Schirmer\n*'''My Soul's Been Anchored In The Lord (arr. Carol Barnett) - pub. Colla Voce\n*Ninety-Third Psalm (arr. Carol Barnett) - pub. Earthsongs\n*Not One Sparrow Is Forgotten (William Hawley) - pub. Colla Voce\n*O Little Town Of Bethlehem (arr. Dale Warland) - pub. Colla Voce\n*O Viridissima Virga' (Janika Vandervelde) - pub. Earthsongs ***N.B. Not technically part of the DWCS, this was commissioned and premiered by the Dale Warland Singers, and is published by Earthsongs\n*Oh, Shenandoah (arr. Alf Houkom) — pub. Colla Voce\n*Prayer of the Middle Ages (Howard Hanson) - pub. Earthsongs\n*Pretty Saro (arr. Mark Keller) - pub. Colla Voce\n*Red River Valley (arr. Carol Barnett) — pub. Colla Voce\n*River Snow (Zhang Ying) - pub. Walton\n*Requiescat (Eric William Barnum) - pub. G. Schirmer\n*'Rockin' Jerusalem (arr. Robert L. Morris) - pub. Walton\n*Shalom Chaverim (Kenneth Hodgson) — pub. Colla Voce\n*She'll Be Comin' Round The Mountain (arr. Emma Lou Diemer) - pub. Colla Voce\n*Simple Gifts (arr. Dale Warland) - pub. G. Schirmer\n*Snow (The King's Trumpeter) (John Muelheisen) - pub. Colla Voce\n*So Gracious Is The Time (William Beckstrand) - pub. Colla Voce\n*So Thin a Veil (Dale Warland) - pub. G. Schirmer\n*A Somerset Carol (arr. Dale Warland) - pub. G. Schirmer\n*A Spotless Rose (Ralph R. Prime) - pub. Colla Voce\n*Steal Away (arr. Carol Barnett) — pub. Colla Voce\n*Swing Low, Sweet Chariot (arr. Carol Barnett) — pub. Colla Voce\n*There Will Be Rest (Dale Warland) - pub. G. Schirmer\n*Two Motets (William Hawley) - pub. Walton\n*Water Night (Eric Whitacre) - pub. Walton\n*Webster (arr. Carol Barnett) - pub. Earthsongs\n*Wexford Carol (arr. Dale Warland) - pub. G. Schirmer\n*Without Words (Huang Ruo) - pub. G. Schirmer\n*Wonder Where''' (arr. Carol Barnett) - pub. Colla Voce\nReferences"
    }
  ]
}