{
  "content": [
    {
      "type": "text",
      "text": "# Daleroy Stewart\n\n| birth_place   = Vero Beach, Florida, U.S.\n| height_ft     = 6\n| height_in     = 4\n| weight_lbs    = 327\n| high_school   = Vero Beach\n| college       = Southern Mississippi\n| draftyear     = 2001\n| draftround    = 6\n| draftpick     = 171\n| pastteams     =\n* Dallas Cowboys (–)\n* New York Jets ()\n* San Francisco 49ers ()\n* Houston Texans ()*\n* Tennessee Titans (2005)*\n* Dallas Desperados (–)\n| statlabel1    = Games played\n| statvalue1    = 26\n| statlabel2    = Games started\n| statvalue2    = 1\n| statlabel3    = Tackles\n| statvalue3    = 12\n| statlabel4    = Sacks\n| statvalue4    = 1.5\n| aflstatlabel1 = Tackles\n| aflstatvalue1 = 10\n| aflstatlabel2 = Sacks\n| aflstatvalue2 = 2.5\n| aflstatlabel3 = Fumble recoveries\n| aflstatvalue3 = 1\n| pfr           = StewDa20\n| afl           = 5055\n}}\nDaleroy Andrew Stewart (born November 1, 1978 - April 14, 2024) is an American former professional football player who was a defensive lineman in the National Football League (NFL) for the Dallas Cowboys, New York Jets and San Francisco 49ers. He played college football for the Southern Miss Golden Eagles. He was also a member of the Dallas Desperados of the Arena Football League (AFL).\nEarly life\nStewart attended Vero Beach High School, where as a senior he made 95 tackles (13 for loss) and 7 sacks, while receiving All-state honors. He was invited to play in the Georgia/Florida High School All-Star Game. He also practiced the shot put and discus throw.\nHe accepted a football scholarship from the University of Southern Mississippi. As a freshman, he appeared in 8 games as a reserve defensive lineman. The next year he was limited with an ankle injury and made 26 tackles.\nAs a junior, he began the season as the backup to John Nix, until being moved into the starting lineup in the third game against Nebraska, after Nix suffered a toe injury during the first games. He would end up being a key player, posting 47 tackles (11 for loss), while helping his team win the Conference USA championship with a 9–3 record and a 23–17 win over Colorado State University in the 1999 Liberty Bowl.\nAs a senior, he was a part of a unit that ranked second in the nation in total defense. He appeared in 11 games (2 starts), registering 38 tackles (8 for loss) and 4 sacks. He finished his college career with 121 tackles (59 solo), 7 sacks and 23 tackles for loss.\nProfessional career\nDallas Cowboys\nStewart was selected by the Dallas Cowboys in the sixth round (171st overall) of the 2001 NFL draft, after dropping because he injured his rotator cuff while playing in the Senior Bowl. He was placed in the reserve/non-football injury list on August 28. His rehab was complicated by a bulging disk he suffered in his back and was never activated from the non-football-related injury list in his rookie season. In his second year he was tried at defensive tackle and defensive end, but was never active for any of the games.\nIn 2003, with the arrival of new head coach Bill Parcells and the change to a 3-4 defense, he was moved to nose tackle and became a part of the defensive line rotation, making 17 tackles (4 for loss) and 1.7 sacks. In 2004, even though there was excitement about his progress as a football player, he ended up being waived on September 14.\nNew York Jets\nOn September 16, 2004, Stewart was claimed off waivers by the New York Jets to replace an injured Josh Evans. He was released eight days later on September 24.\nSan Francisco 49ers\nOn September 27, 2004, he was claimed off waivers by the San Francisco 49ers. He wasn't re-signed at the end of the season, after playing in nine games and being declared inactive in four.\nHouston Texans\nOn April 20, 2005, he was signed as a free agent by the Houston Texans. After being limited with injuries (knee, hamstring) in training camp, he was cut on August 16.\nDallas Desperados\nOn October 17, 2005, he signed with the Dallas Desperados of the Arena Football League, who were owned by Jerry Jones, who also owned the Dallas Cowboys. He played three seasons until the team folded on August 4, 2009, upon the dissolving of the original AFL.\nSee also\n* List of Arena Football League and National Football League players\nReferences\nExternal links\n* [http://www.dallascowboys.com/news/2007/06/06/former-dt-stewart-catching-desperados Former DT Stewart Catching On With Desperados]"
    }
  ]
}