{
  "content": [
    {
      "type": "text",
      "text": "# Dan (king)\n\nDan (or Halfdan) is the name of one or more of the legendary earliest kings of the Danes and Denmark, as mentioned in medieval Scandinavian texts.\nThe Lejre Chronicle\nThe Chronicle of Lejre (Chronicon Lethrense), written around 1170, introduces a primeval King Ypper of Uppsala, whose three sons were Dan, who later ruled Denmark; Nori, who later ruled Norway; and Østen, who later ruled the Swedes. Dan apparently first ruled in Zealand, as the Chronicle states that it was when he saved his people from an attack by Emperor Augustus that the Jutes and the men of Fyn and Scania also accepted him as king. Consequently, the resulting expanded country of Denmark was named after him. Dan's wife was named Dana, and his son was named Ro.\nThe Rígsthula\nThe Eddic poem Rígsthula tells how the god Ríg (said to be Heimdall) fathered a mortal son named Jarl. Jarl had twelve sons with Erna Herse's daughter, the youngest of whom was named Kon the Young (Old Norse Konr Ungr). This name is understood to be the origin of the title konungr ('king'), although the etymology is, in fact, untenable. One day, while hunting and snaring birds in the forest, a crow spoke to him and suggested that he would gain more by going after men, praising the wealth of \"Dan and Danp.\" The poem breaks off incomplete at that point.\nThe Skjöldungasaga\nAccording to Arngrímur Jónsson's Latin epitome of the lost Skjöldungasaga, made in 1597:\nRíg (Rigus) was a man not the least among the great ones of his time. He married the daughter of a certain Danp [Old Norse Danpr], lord of Danpsted, whose name was Dana; and later, having won the royal title for his province, left as his heir his son by Dana, called Dan or Danum, all of whose subjects were called Danes.\nThis tradition is similar to that of the Rígsthula.\nThis Dan married Olof, the daughter of Wermund, and thus became brother-in-law to Offa of Angel, mentioned in the Old English poem Beowulf. Dan initially ruled in Jutland but later conquered Zealand from King Aleif, creating the kingdom of Denmark.\nYnglinga saga\nSnorri Sturluson's Ynglinga saga relates the story of King Dygvi of Sweden:\nDygvi's mother was Drótt, a daughter of King Danp, the son of Ríg, who was first called konungr ['king'] in the Danish tongue [(Old Norse)]. His descendants always afterwards considered the title of konungr the title of highest dignity. Dygvi was the first of his family to be called konungr, for his predecessors had been called dróttinn ['chieftain'], and their wives dróttning, and their court drótt ['war band']. Each of their race was called Yngvi, or Ynguni, and the whole race together Ynglingar. Queen Drótt was a sister of King Dan Mikilláti, from whom Denmark took its name.\nHere, Ríg is the father of Danp, who is the father of Dan. The title Mikilláti can be translated as 'Magnificent' or 'Proud'.\nSnorri does not clarify whether this Dan is also descended from King Fridfrodi, or Peace-Fróði, whom Snorri presents as ruling in Zealand as a contemporary of Fjölnir, son of Frey, six generations before King Dygvi. Snorri writes further:\nIn the time when the kings we have been speaking of were in Uppsala, Denmark had been ruled over by Dan Mikilláti, who lived to a very great age; then by his son, Fróði Mikilláti, or the Peace-loving, who was succeeded by his sons Halfdan and Fridleif, who were great warriors.\nThis peaceful Fróði appears to be a duplicate of the earlier Fróði.\nIn his preface to the Heimskringla (which includes the Ynglinga saga), Snorri writes:\nThe Age of Cairns began properly in Denmark after Dan Mikilláti had raised for himself a burial cairn, and ordered that he should be buried in it on his death, with his royal ornaments and armour, his horse and saddle-furniture, and other valuable goods; and many of his descendants followed his example.  But the burning of the dead continued, long after that time, to be the custom of the Swedes and Northmen.\nSven Aagesen\nIn his Brevis historia regum Dacie, the 12th-century historian Sven Aagesen mentions Danu Elatus, 'the Proud,' presumably Dan Mikilláti, and makes him the successor to Uffi, that is, Offa, son of Wermund, thus agreeing with the Skjöldungasaga. He states that this Dan was such a powerful king that he had another king as his page and two nobles to hold his horse.\nThe Gesta Danorum\n's scholium, Dan and Angul (Angel) were brothers.]]\nSaxo Grammaticus, in his Gesta Danorum, presents three different Danish monarchs named Dan, either splitting a single monarch into multiple figures or properly distinguishing those whom others have confused.\nSaxo begins his history with two brothers named Dan and Angul, sons of one Humbli, who were made rulers by the consent of the people because of their bravery. However, they were not referred to as 'kings,' as that usage was not common at the time.\nAngul is the eponym of the region of Angul, and from his people eventually came the English, who gave their name to England. Dan fathered two sons, Humblus and Lotherus, by his wife Grytha.\nNeither son is otherwise known, although a king named Humli is a leader of the Huns in the Old Norse Battle of the Goths and Huns. Lotherus may have some relation to the Norse god Lóðurr or to the exiled king Heremod mentioned in Beowulf, or possibly to both. According to Saxo, Lotherus is the father of the famous hero Skioldus.\nThe second king called Dan appears much later in Book 4 as the son of Uffi, son of Vermund (that is, Offa of Angel, son of Wermund). However, Saxo mentions him only briefly, describing him as a warlike king who scorned his subjects and squandered his wealth, having greatly degenerated from his ancestors.\nHe is succeeded by King Huglek, followed by Fróði the Active, and then by the third Dan. Saxo does not specifically provide the parentage of any of these kings. Of this Dan, Saxo recounts only an anecdote: when Dan was twelve years old and tired of the arrogance of Saxon ambassadors who demanded tribute under the threat of war, he bridged the river Elbe with ships, crossed over, and won a great victory.\nThis Dan is the father of Fridlef, who is the father of Frothi. In this lineage, one can recognize Fridleif and his son Fróði, both of whom are often mentioned in Norse sources. The latter, at least by parentage, is the Peace-Fróði introduced by Snorri early in the Ynglinga saga.\nThe Song of Eric\nThe 'Song of Eric' was once considered a valuable source for Migration Period history but is now regarded as inauthentic fakelore created during the 16th century.\nThe ballad deals with Eric, the first king of Geatland (fyrsti konunger i Götalandinu vidha). He sent a troop of Geats southward to a country named Vetala, where no one had yet cultivated the land. Accompanying them was a wise man who was to uphold the law. Eventually, a king named Humli appointed his son Dan to rule the settlers, and after Dan, Vetala was named Denmark.\nThe song was first published in a Latin translation in Johannes Magnus's Historia de omnibus gothorum sueonumque regibus (1554). He states that the original song was widely sung in Sweden at that time.\nSee also\n* Dan I of Denmark\n* Angul\nReferences"
    }
  ]
}