{
  "content": [
    {
      "type": "text",
      "text": "# Daniel Roche (historian)\n\nDaniel Roche (26 July 1935 – 19 February 2023) was a French social and cultural historian, widely recognized as one of the foremost experts of his generation on the cultural history of France during the later years of the Ancien Régime. Roche was elected an International member of the American Philosophical Society in 2009.\nDeath\nRoche died on 19 February 2023, at the age of 87.\nHistoriography\nRoche produced over two hundred publications covering a broad variety of subjects within the social and cultural history of France and Europe under the Old Regime.\nRoche’s research had a significant impact on the historical study of the Enlightenment and 18th-century France in general. He has made significant use of hitherto ignored notarial archive sources such as post-mortem inventories, which have yielded insight into the basic material culture of Paris and the rise of consumerism during the 18th century. Roche has largely defined the study of ‘everyday items’ (les choses banales).\nThe social changes that took place over the course of the Enlightenment in France figured prominently in Roche’s research. The broad scope of Roche’s research into the Enlightenment included diverse areas such as public institutions and clothing worn by the popular classes.\nNotable works\nLe Siècle des Lumières en Province\nRoche’s doctoral thesis was published in 1978 under the title Le Siècle des Lumières en Province: Académies et Académiciens Provinciaux, 1680–1789 (The Enlightenment in the Provinces: Provincial Academies and Academics, 1680–1789) and was quickly met with praise not only as a work of social cultural history, but also for its value as a study of the history of science. In Le Siècle des Lumières en Province, Roche conducts an in-depth examination of academic institutions outside of Paris from the late 17th century up to the onset of the French Revolution. Roche argues that the provincial academies (under the patronage of the French monarchy) both protected and weakened the French state, demonstrating that the relationship between the Ancien Régime and the Enlightenment that took place over the course of the 18th century was complex as opposed to strictly oppositional.\nLe Siècle des Lumières en Province remains a highly influential work in the historiography of 18th-century intellectual trends. The French Enlightenment is shown to be complicated where the relationship between state and academy is concerned. The historian Isabel Knight notes that the academic movement that Roche details “both displayed and mediated the tension between established and emerging classes, between tradition and innovation, and between ideology and criticism.”\nLe Peuple de Paris\nLe Peuple de Paris. Essai sur la Culture Populaire au XVIIIe Siècle (The People of Paris. Essay on Popular Culture in the Eighteenth Century) was published in 1981. It is a study of the everyday lives of the more ordinary people living in Paris during the Enlightenment who, despite living in poor conditions, underwent a degree of improvement over the course of the century in terms of material culture and consumption.\nIn Le Peuple de Paris, Roche presents an innovation in terms of source material by making extensive use of inventories (lists of belongings drawn upon a person’s death) to provide an accurate depiction of the state of material culture. The historian David Garrioch, a historian of revolutionary Paris, calls Le Peuple de Paris “an important book not only for the new information and insights if gave, but also for its innovative methodology and the new questions it posed.”\nLa Culture des Apparences\nRoche’s La Culture des Apparences. Une Histoire du Vêtement, XVII-XVIIIe Siècle (The Culture of Clothing. Dress and Fashion in the Ancien Régime) details the history of clothes in Paris during the Enlightenment. Roche’s main argument is that the culture around clothing in a social context underwent a profound transformation from the reign of Louis XIV to that of Louis XVI. A study of over a thousand post-mortem inventories demonstrates that clothing became purchased in greater amounts at greater prices and with more emphasis on style than on functionality. More specifically, Roche argues that the reinforcement of social status through appearance so prevalent during the reign of Louis XIV gradually eroded during the 18th century, eventually yielding a culture of clothing that was profoundly consumer-driven and oriented around style rather than social status.\nLa Culture des Apparences has been praised for its inherent value as a study of clothing in history, as well as for building upon the innovative use of inventories as sources first seen in Le Peuple de Paris.  Moreover, La Culture des Apparences is of immediate significance to the modern day, as it traces the birth of the present-day consumerist and style-oriented culture of clothing.\nLa France des Lumières\nLa France des Lumières (France in the Enlightenment) is a broad examination of the social and cultural history of the Enlightenment in France. In it, Roche explores the social and cultural changes that took place across the entire scope of French society during the 18th century, as well as the forces that aided such changes.  Roche argues that the cultural history of the 18th century as a complex period of progress divided between “those who favored a broadening of cultural opportunities...and those who favored limiting such opportunities.”  Also central to the La France des Lumières is the establishment of certain preconditions for the progressive social transformation that took place during the Enlightenment, specifically that criticisms of all aspects of human behavior arose, the symbols of monarchy were gradually eroded, and a space formed for political activity in spite of French society’s nature and traditions as a monarchical state.\nCriticisms\nRoche’s work has given rise to a number of criticisms usually originating from historians principally interested in the French Revolution rather than the French Enlightenment. David Garrioch points out that religious history, visual sources, and any discussion of revolutionary Paris (all three being of important consequence to the history of the Enlightenment although the focus on the latter tends to teleologically frame 1789 as the terminus ad quem of the 18th century) are all largely absent from Roche’s writings.  The history of consumerism in early modern France is also a problematic approach to the broader French Enlightenment because the materially poor of the cities and the bulk of the rural population lacked the means or incentive to engage in consumerism.  However, such a criticism neglects the fact that Roche did indeed devote considerable attention to the material world of the urban poor in his classic, Le Peuple de Paris (1981).\nFrance in the Enlightenment has been met with a considerable degree of criticism. D. M. G. Sutherland, another revolutionary historian, criticizes the Roche’s overly progressive take on the Enlightenment that tends to accept the Enlightenment’s own discourse on itself, disregarding anything that preceded it as being backward.  On France in the Enlightenment, Sutherland says \"Daniel Roche has written the history of France in the Enlightenment that intellectuals tried to compel us to write over two hundred and fifty years ago.\"\nThe progressive tone of the France in the Enlightenment is contradicted by other research, most notably the work of Robert Darnton, whose own research into the clandestine, popular, and vulgar literary culture of France during Old Regime contrasts significantly with the conclusions of progress in education, philosophy, and culture at which Roche arrives.  Such a criticism overlooks the fact that Roche did indeed devote considerable attention to the \"two worlds of Paris\" in the Enlightenment &ndash; that of the impoverished masses from which many of Darnton's Grub Street came &ndash; and that of the wealthy elites.\nFurthermore, Roche’s writing has been criticized early in his career for being difficult to translate from the original French and at times jargonistic or frustrating to read for the non-expert in the field.  This criticism aside, a number of Roche's later works were successfully translated into English and other languages.\nHonours and awards\nHonours\n* Knight of the Ordre National du Mérite\n* Officier of the Order of Arts and Letters\nAcknowledgments\n* Member of the Academia Europaea\n* Member of the Pégase Academy\n* Honorary member of the American Academy of Arts and Letters\n* Honorary member of the Academy of Lyon\n* Corresponding member of the British Academy\n* Foreign correspondent of the Academy of Sciences of the Institute of Bologna\nHonorary degrees\n* 2005 : University of Verona\n* 2008 : University of Geneva\nAwards\n* 1979 : Jean-Reynaud Prize  of the Académie Française\n* 1990 : Eugène-Colas Prize of the Académie Française\n* 2001 : History Award of the City of Paris\n* 2001 : Pégase Prize\n* 2012 : Laurain-Portemer Prize of the Académie des Sciences Morales et Politiques\n* 2016 : Grand prix Gobert of the Académie Française\nWorks\n;In French\n* Le Siècle des Lumières en province. Académies et académiciens provinciaux, 1689–1789, (Paris/The Hague:, Mouton) 1978, 2 vol. Second edition (Paris, Maison des Sciences de l'Homme), 1989. Provincial academies and the French Age of Enlightenment outside Paris.\n* Le Peuple de Paris: Essai sur la culture populaire au XVIIIe siècle, (Paris: Aubier) 1981. English translation (London/Berkeley, California University Press) 1987. Second edition (Paris: A. Fayard) 1998.\n* Journal de ma vie. Édition critique du journal de Jacques-Louis Ménétra, compagnon vitrier au XVIIIe siècle, (Paris: Montalba) 1982. English translation (New York: Columbia University Press) 1986.\n* (with Pierre Goubert) ''Les Français et l'Ancien Régime. I - La Société et l'État. II - Culture et Société (Paris: A. Colin) 1984, 2 vol. Second édition 1993.\n* Les Républicains des Lettres, gens de culture et Lumières au XVIIIe siècle, (Paris, A. Fayard), 1988.\n* La culture des apparences. Essai sur l'Histoire du vêtement aux XVIIe et XVIIIe siècles, (Paris: A. Fayard) 1989. Second edition, (Points Histoire, Le Seuil) 1991. English translation by Jean Birrell The Culture of Clothing. Dress and Fashion in the Ancien Régime (Cambridge UP) 1994.\n* La France des Lumières, (Paris: A. Fayard) 1993 English translation by Arthur Goldhammer, France in the Enlightenment (Cambridge UP) 1997.\n* Histoire des choses banales. Naissance de la Société de consommation, XVIIIe-XIXe siècle, (Paris: A. Fayard) 1997. English translation (Cambridge UP), 1998. The rise of consumer culture.\n* Les Écuries royales (XVIe-XVIIIe siècles)'', (Paris: Association pour l'Académie d'art équestre de Versailles) 1998.\n* Voitures, chevaux, attelages du XVIe au XIXe siècle, (Paris: Association pour l'Académie d'art équestre) 2001.\n* ''Humeurs vagabondes, De la circulation des hommes et de l'utilité des voyages, (Paris: A. Fayard) 2003.\nReferences\nBibliography\n* Darnton, Robert.  « Il Faut Savoir Compter », French Historical Studies, 27 no. 4 (Fall 2004), 725-731.\n* Darnton, Robert.  The Literary Underground of the Old Regime. Cambridge, MA: Harvard University Press, 1982.\n* Garrioch, David.  “Daniel Roche and the History of Paris.” French Historical Studies 27 no. 4 (Fall 2004), 734-740.\n* Hahn, Roger. Review of Le Siècle des Lumières en Province: Academies et Academiciens Provinciaux 1680-1789 by Daniel Roche.  Isis'' 71 no. 2 (June 1980), 301-302.\n* Hunt, Lynn Avery, \"Daniel Roche and History's Movable Feast\" French Historical Studies '2.4, Fall 2004, pp.&nbsp;747–751.\n* Jones, Jeniffer M. A review of The Culture of Clothing: Dress and Fashion in the “Ancien Régime” by Daniel Roche.  The William and Mary Quarterly, 3rd Ser., 53 no.1 (January 1996), 188-190.\n* Knight, Isabel F. Review of Le Siècle des Lumières en Province: Academies et Academiciens Provinciaux 1680-1789 by Daniel Roche. The American Historical Review 84 no. 3 (June 1979), 766-767.\n* Lough, J. A review of Le Siècle des Lumières en Province. Académies et Académiciens Provinciaux, 1680–1789 by Daniel Roche.  The English Historical Review 94 no. 373 (October 1979), 865-866.\n* Steen, Charlie R. A review of A History of Everyday Things: The Birth of Consumption in France, 1600-1800 by Daniel Roche.  Journal of Anthropological Research 59 no. 1 (Spring, 2003), 138-139.\n* Sutherland, D.M.G. A review of France in the Enlightenment by Daniel Roche. Translated by Arthur Goldhammer.  Social History 25 no. 2 (May 2000) 238-241.\n* Styles, John. A review of The Culture of Clothing: Dress and Fashion in the “Ancien Régime” by Daniel Roche.  The Economic History Review, New Ser., 49 no. 2 (May 1996) 408-9.\n* Tackett, Timothy.  « Forum: The Work of Daniel Roche, Introduction », French Historical Studies 27 no.4 (Fall 2004), 723.\n* Van Damme, Stéphane. “Daniel Roche”, in Dictionnaire critique des Sciences Humaines, Sylvie Mesure and Patrick Savidian (ed.), Paris, PUF, 2006\nExternal links\n* [https://www.college-de-france.fr/site/daniel-roche/index.htm#content.htm Daniel Roche] on the Collège de France's website\n*[http://www.ranumspanat.com/roche.html An informal essay on Roche]"
    }
  ]
}