{
  "content": [
    {
      "type": "text",
      "text": "# Daniel King (race walker)\n\n| birth_place    = Colchester, Essex, England\n| death_date     =\n| death_place    =\n| height         =\n| weight         =\n| sport          = Athletics\n| event          = Racewalking\n| club           = Colchester Harriers\n| pb             = 50km – 4:04:49\n}}\nDaniel King (born 30 May 1983) is a British former racewalker. He competed for England in the men's 20&nbsp;km walk at the 2006 Commonwealth Games and at a number of World Cup events for Great Britain. He has a twin brother named Dominic who is also a racewalker.\nBiography\nDaniel attended Coventry University. He was British number one when he was called up to the squad to compete at the 2004 IAAF World Race Walking Cup in Naumburg, Germany.\nHe competed for Great Britain alongside his brother at the 2006 Commonwealth Games in Melbourne, putting out a public call for sponsors before travelling. He finished in sixth place in the men's 20&nbsp;km walk, one place above his brother and two places above fellow British competitor Andrew Penn.\nKing became British 5000 metres walk champion after winning the British Athletics Championships in 2008. He was selected for the British team at that year's 2008 World Cup in Cheboksary, Russia, having set the fastest 20&nbsp;km by a British athlete for six years. He donated a year's worth of trainers to an exhibition in Suffolk to mark one year prior the 2012 Summer Olympics in London.\nHe won the 20&nbsp;km race at the Manx Harriers open day on the Isle of Man in February 2011. At the 2011 Enfield Open, Daniel placed second, with his brother coming in first. In preparation for the 2012 Games, he took a training trip to Spain with his brother in January 2012. He was also named one of Colchester's \"Olympic Champions\". Alongside his brother, he was named part of the British squad for the 2012 Racewalking World Cup in Saransk, Russia. He finished the race in 61st place, with a season's best time of 4:20:49.\nReferences"
    }
  ]
}