{
  "content": [
    {
      "type": "text",
      "text": "# Daniel Swarovski\n\n| death_place   = Wattens, Austria\n| other_names   =\n| occupation    = Businessman, glazier, jeweler\n| years_active  = 1892–1956\n| known_for     = Founder of Swarovski\n| notable_works =\n| spouse        = Marie Weis\n| children      = FritzAlfredWilhelm\n| party = Nazi Party\n}}\nDaniel Swarovski (24 October 1862 – 23 January 1956) was a Bohemian-born Austrian businessman, glazier, and jeweler. He was a founder of the Swarovski crystal dynasty.\nEarly life\nSwarovski was born in Georgenthal, Bohemia, Austrian Empire (now Jiřetín pod Bukovou, Czech Republic), the son of Franz Anton Swarovski and Helene Swarovski (née Staffen). Like many in the Jizera Mountains area, his father was a glass cutter, and Swarovski first learned the art of glass-cutting in his father's small factory. He was educated in Paris and Vienna, where he met electrical engineer František Křižík, and became interested in electricity at the 1883 Electricity Exhibition in Vienna.\nCareer\nIn 1892, Swarovski patented an electric cutting machine that facilitated the production of lead crystal glass jewelry, which until then had to be cut by hand. In 1895, he moved to an area in the modern boundaries of Austria and partnered with Armand Kosman and Franz Weis to form \"A. Kosmann, D. Swarovski & Co.\" They built a crystal-cutting factory in Wattens in Tyrol, to take advantage of local hydroelectricity for the energy-intensive grinding processes Swarovski had patented.\nIn 1919, Swarovski founded the Tyrolit company, bringing the grinding and polishing tools from his crystal business into a different market. In 1949, Swarovski Optik KG was founded by his son Wilhelm Swarovski in Absam, Tyrol.\nPersonal life\nIn 1887, Swarovski married Marie Weis, the sister of his business partner Franz Weis, and they had three sons: Fritz, Alfred, and Wilhelm.\nHonors\n*Knight of the Order of St. Gregory the Great\n*Bearer of the Great Emblem of Merit from the Republic of Austria\n*Owner of the Julius Raab Medal\n*Honorary member of the Leopold-Franzens-University of Innsbruck\nNotes\nReferences\nExternal links\n*[http://www.swarovskigroup.com/S/aboutus/Timeline.en.html Swarovski Group: History]"
    }
  ]
}