{
  "content": [
    {
      "type": "text",
      "text": "# Dano-Swedish War (1657–1658)\n\n| combatant2        =   In Africa:\n*Fetu kingdom\n*\n| commander1        =  Charles X Gustav Carl Gustaf Wrangel Gustaf Otto Stenbock Per Brahe the Younger\n| commander2        =  Frederick III Ulrik Frederik Gyldenløve Anders Bille Iver Krabbe\n| units1            =\n| units2            =\n| strength1         = 6,000\n| strength2         = 25,000\n| casualties1       =\n| casualties2       =\n| notes             =\n| campaignbox       =\n}}\nThe Dano-Swedish War of 1657–1658, known in Denmark as the First Charles Gustav War () in Norway as Krabbes Feud () and in Sweden as '''Charles Gustav's First Danish War''' (), was a conflict between Sweden and Denmark–Norway during the Northern War of 1655–1660. In 1657, Charles X Gustav of Sweden and his Swedish army were Fighting in the Poland. Frederick III of Denmark-Norway saw an opportunity to recover the territories it lost in 1645 and attacked Sweden. The outbreak of war with Denmark provided Charles Gustav with an excuse to withdraw from the Polish campaign and move against Denmark.\nAfter entering Jutland from the south, the Swedes then starting moving across Denmark, crossing the icy Little Belt onto the Danish island of Funen on 30 January 1658. The Swedes captured that island within a few days and then went on to capture the islands of Langeland, Lolland, and Falster. Zealand was taken in less than a year and the Swedish army was by that point threatening the Danish capital of Copenhagen. The rapid Swedish attack across the frozen Belts was completely unexpected; Frederick III considered meeting the Swedish army in battle, but his advisors thought this was too risky and instead Denmark-Norway signed the very harsh Treaty of Roskilde on 26 February 1658. With that, Sweden won its most prestigious victory, and Denmark-Norway had suffered its most costly defeat.[http://www.sydsverige.dk/?pageID=321 Roskildefreden (1658)] Denmark-Norway yielded the Danish provinces of Scania, Halland, Blekinge and the island of Bornholm and the Norwegian provinces Bohuslen and Trondhjem len (Trøndelag and Nordmøre) to Sweden. Some of the territorial changes would be changed by another Dano-Swedish War.\nBackground\nThirty Years War\nNorthern War\nIn June 1654, Russian soldiers crossed the border into Poland-Lithuania, which is traditionally thought of as the start of the Northern War of 1655–1660. As the Russians advanced into Poland without seeing serious resistance, the war began to be viewed with concern from a Swedish perspective. A Russian victory could pose a threat to Swedish possessions in Livonia. Thus Charles X Gustav joined the conflict on the 9th of July 1654, attacking the Poles from three different fronts; 13,500 under Arvid Wittenberg attacked from the west, 16,000 under Charles Gustav himself from the sea, and 8,900 under Magnus De la Gardi from the North. The Swedes quickly seized Krakow and Warsaw, but this did not lead to anything decisive. Furthermore, the resistance faced by the Poles became more fierce as the war progressed, and the people frequently rose up against their Swedish occupiers. Sweden also faced pressure from the other European powers to end the war, Austria and Brandenburg sent aid to the Poles and the Dutch sent a fleet to Danzig to protect it from capture. The war became a stalemate as no side could decisively defeat the other; Warsaw changed hands on several occasions in 1656.\nFredrick III of Denmark had paid close attention to the situation in Poland. The Danish had recently lost several core Danish territories to the Swedes in the Peace of Brömsebro, and the war in Poland could thus prove to be a perfect chance to take them back.\nNew Dano-Swedish War\nThe Danish Riksråd send the 26. April 1657 a letter to the Swedish riksråd about compensation. The Swedish riksråd didn’t take this kindly, and negotiations broke down a week later. Close to this time, three Swedish ships were seized in The Sound. It was on the 1. June 1657 that Denmark declared war on Sweden. Denmark soon captured the Swedish held Bremen. To Charles X Gustav, the declaration of war came as a blessing as he had now a perfect opportunity to leave the conflict in Poland without losing any honor. He marched his army with remarkable speed across Germany, retaking Bremen and continuing the advance via Holstein and Schleswig.\nArmies\nThe main Danish force was commanded by Rigsmarsk Anders Bille and was put in place in the Duchy of Holstein. It was made up of 5.000 cavalry, a similar amount of infantry, and a fort garrison of 1.500. The Scanian Army was smaller, but got enlarged to about 11.000 men, most of whom were in the fortresses. The rest of the Danish army plus a little Norwegian army meant that the full Dano-Norwegian force in June 1657 is estimated to circa 25.000 men.\nThe Swedish army was 90.000, although most of these were fighting in Poland-Lithuania. In mainland Sweden was about 15.000, in Bremen, Wismar and Pomerania about 16.000 men.\nThe Swedish began their invasion of Jutland with a force of 6,000 men. While the force was small in comparison with the Danish, the soldiers were very experienced after their campaigns in Poland. All in all, the army had been involved in around 30 battles.\nWar\nDanish front\nInvasion of Jutland\nFall of Fyn\nInvasion of Zealand\nWar in The Sound\nNorwegian front\nBoth the Danish and Swedish kings wanted, disregarding the harsh weather, an offensive on the Swedish-Norwegian border in the winter of 1657-1658. But both sides were plagued by sickness, lacked food rations and proper clothing and footwear to withstand the cold.\nDenmark-Norway was hit by growing desertions, so much so, that Frederik III in November had to let the governor of Norway Niels Trolle give amnesty to all, who went back to serving before Christmas, although there were usually high consequences for deserting. Iver Krabbe therefore chose because of the many problems to stay with most of the army in Uddevalla and the fortresses. But the Swedish field marshal, Gustaf Otto Stenbock, had to obey the order of Charles X Gustav, and was therefore on march the 15. January 1658 with 3.500 men and 16 cannons.\nThe war officially started on the Norwegian front on 24 June, when a Norwegian unit under the command of Major Peter Brun demanded tribute from Swedish peasants west of the Göta river. On 25 June, Iver Krabbe contacted the Governor of Gothenburg, Per Ribbing, requesting a local truce on the island of Hisingen, which was shared between Sweden and Norway. Ribbing agreed, as neither side would be able to control the island and it was thus better if the peasants on either side could continue food production.\nThe first act of hostilities occurred on 4 July, when the first Norwegian incursion into Sweden took place at Hjärtum. However, this only turned into a minor occurrence, even if it resulted in some plundering. A week later, a raiding party of some 100 Norwegians crossed the Göta river from Bohus, home of the Bohus Regiment. However, they quickly retreated when confronted by levied Swedish peasants. Krabbe played for time, knowing that his preparations had not yet been finished, he was not in a hurry to begin his campaign. However, Colonel Johan von Firck, along with his life company of some 170 men of pikemen and musketmen landed on the Swedish side of the Göta river, by way of Tjurholmen (Bull Island), which belonged to Norway. Supported by a skerry boat armed with falconets, they pushed back some Swedish cavalrymen and levied peasants, and destroying a redoubt.\nAfterwards, a few Norwegians stayed at the captured location. Then, more Swedish cavalry and peasants arrived, who immediately assaulted the Norwegians. Based on Norwegian accounts, Firck repulsed the attack with support from the falconets on the skerry boat. The skirmish resulted in the death of one Swede and a wounded Norwegian under officer.\nReturning to Bohus, Krabbe ordered his life company of some 126 men from the Bohus Regiment to cross the Göta River in support. This raid was to be led by the Lieutenant Colonel Frederik von Ahlefeldt, who was also the commander of Bohus Fortress, along with Lieutenant Colonel Johan Wedberg. Wedberg crossed the river first, using a skerry boat armed with four falconets and several other coastal or river vessels. The next day, Krabbe followed with, bringing three cannons. Noticing that the Swedes were building river vessels, Krabbe ordered his men to make a redoubt to protect the Norwegian bridgehead.\nAfterwards, Ahlefeldt crossed the river with 160 men to support Krabbe. However, Krabbe soon got reports that Swedish reinforcements of some 150 men under Captain Bryngel Stark had arrived from Gothenburg in the form of cavalry and 200 infantry under Lieutenant Colonel Liborius Mentzer. Being outgunned, Krabbe ordered Ahlefeldt to retreat back across the river. Most Norwegians managed to cross in time, however, combat still occurred between Ahlefeldt, who with two officers and 24 pikemen tried to buy time by resisting the Swedish assault. Since the Norwegians were supported by three regimental cannons and some remaining infantry, the fighting resulted in multiple deaths on both sides.\nRibbing reported that one Swede had died, with five or six soldiers being wounded, including Captain Stark. Krabbe admitted that five Norwegians had been wounded, and no killed. However, the Swedes later managed to take a prisoner, who claimed that the Norwegian losses were six men. After the skirmish, the Norwegians retreated back across the river, and the units from Gothenburg withdrew, being replaced by two of Major General Harald Stake's companies.\nThe replacement came as the natural thing to do, as Ribbing and Stake shared the responsibility to defend against Norwegian invasions from Bohuslän. Later, the next act of war was initiated by the Swedes. Being aware of the threat to Västgötland posed by the Norwegians, Per Brahe ordered Field Marshal Robert Douglas to assume command there in late July.\nAnother reason for this was that Brahe believed he did not need any senior commanders at the Scanian border, since he was confident to andle it himself. Brahe seconded around 2,200 men to Douglas, consisting of eight companies from Major General Harald Stake's Västgöta cavalry regiment (874 men) Colonel Johan Stake's Västgöta-Dal regiment (1,002 men), three companies from the Västmanland Regiment of Foot (324 men), two 24-pounder cannons, a field artillery of some 18 cannons, and several peasant levy units.\nWest African Front\n(1682), built on the initiative of Carloff]]\nDenmark-Norway and Sweden had both since the 1620’s tried to establish themselves on the Gold coast in West Africa. Trading spices, gold and slaves had been growing throughout Europe, but it was really only after the Thirty Years' War that Scandinavian plans grew. Sweden made forts along the coast of Guinea that stretched out in a line along with the other European colonial powers.\nThe Swedes had been present in the Goldcoast since Henrik Carloff's expedition of 1650 when the area was purchased from the Futu kingdom. However, to the dismay of Carloff, Johan Filip von Krusenstierna would be chosen as major for the colony. Carloff felt betrayed by the Swedish African Company and left the colony to become a Danish privateer. Carloff would prove to be a useful asset for Danish ambitions in the area as after the outbreak of the Dano-Swedish War, it became attractive to attack the Swedes from all fronts. Carloff entered talks with Frederick III of Denmark-Norway over potential attacks on the Swedish Gold Coast.\nIt was agreed that if the colony was to be captured should afterward either be given to Frederik III and a company with Carloff as president or be sold by Carloff to non-enemy powers if Frederik didn’t want them.\nAfter the outbreak of the war, Carloff was officially granted permission to invade the Swedish colonies by Fredrik III. Henrik Carloff set sail from Glückstadt with only one ship (named Glückstadt) with 48 men and 18 cannons. He arrived in January 1658 at the Gold Coast where Carloff would make a negotiation with the Dutch and the local King of Fetu, Breweda, who was in control of the area around the Swedish fort Carolusborg. King Breweda would agree to contribute with a force of 2000 worriers in the coming conquest. With the alliance Carloff could easily conquer Carolusborg and a fully supplied Swedish ship, Stockholms Slott. Johan Filip von Krusenstierna was exiled from Cabo Corso, however, many of his men willingly deserted over to Carloff's side.\nThe alliance with the Fetu also served as a deterrent against a Swedish reconquest. Carloff sailed back to Glückstadt, where he would arrive in June 1658. Carlof's conquest of the Swedish Gold Coast would become a problem: there had been concluded peace in Europe, and Carlof's conquest threatened peace in Scandinavia.\nAfter the Treaty of Roskilde, the Dano-Swedish war came to an end, however, Carloff continued to occupy the Swedish Gold Coast, despite Swedish demands of the return of the colony. The continued occupation of Cabo Corso would be one of the reasons for the start of the second war in August 1658. The second war resulted in the Treaty of Copenhagen, which stipulated the return of Cabo Corso to Sweden. However, while the fate of the colony was being discussed, Carloff had gone behind the backs of Denmark and the Fetu Kingdom by selling the colony to the Netherlands. Carloff then left Cabo Corso onboard the Stockholms Slott with 40 sacks of gold, c 20 cannons, and 5 tons of elephant tusks. However, King Breweda reacted strongly about Dutch overlordship of Cabo Corso and thus stormed the colony and returned it to the Swedes which would be fully reclaimed in December 1660 after the arrival of Swedish administrators.\nAftermath\nIt is said that the English mediator heard the Danish lord protector Joachim Gersdorff, as he was about to sign the treaty, utter emperor Nero’s famous words: Utinam nescirem litteras (I wish I couldn’t write)\nThe war was a Danish catastrophe in all perimeters, leading to the loss of some of the richest provinces, a population loss of 25-30%, a destruction of the means of production, an economic and social collapse of the Danish society, and a loss of international importance.\nSee also\n*\n*\n*\n* Swedish Empire\n* Treaty of Roskilde\n* Denmark-Norway\nReferences\nBibliography\n*\n*\n*\n*\nWorks cited\n*"
    }
  ]
}