{
  "content": [
    {
      "type": "text",
      "text": "# Dargal Road, Queensland\n\n| pop                 = 198\n| pop_year            =\n| pop_footnotes       =\n| established         =\n| postcode            = 4455\n| area                = 28.0\n| dist1               = 8.1\n| dir1                = WNW\n| location1           = Roma, Queensland\n| dist2               = 359\n| dir2                = WNW\n| location2           = Toowoomba\n| dist3               = 543\n| dir3                = WNW\n| location3           = Brisbane\n| dist4               =\n| dir4                =\n| location4           =\n| lga                 = Maranoa Region\n| stategov            = Warrego\n| fedgov              = Maranoa\n| near-n              = Euthulla\n| near-ne             = Euthulla\n| near-e              = Roma\n| near-se             = Bungil\n| near-s              = Bungeworgorai\n| near-sw             = Bungeworgorai\n| near-w              = Bungeworgorai\n| near-nw             = Bungeworgorai\n}}\nDargal Road is a rural locality in the Maranoa Region, Queensland, Australia. In the , Dargal Road had a population of 198 people.\nGeography\nThe locality is bounded to the south by the Warrego Highway and Western railway line, by Bungeworgorai Creek to the west, and by Richardson Lane to the east.\nThe locality presumably takes its name from the road of the same name which traverses the locality from the north-east (Roma) to the north-west (Bungeworgorai).\nThe land use is mostly grazing on native vegetation with some crop growing and some rural residential housing.\nHistory\nWangary Provisional School opened circa 1898 operating as a half-time provisional school in conjunction with Mount Beagle Provisional School (meaning the two schools shared a single teacher). In 1902, it became a full-time provisional school. On 1 January 1909, it became Wangary State School. In 1910, tenders were called for a new school building. It closed in 1930. The school was at 709 Bungeworgorai Lane ().\nThe locality was served by the Bungeworgorai railway station () on the Western railway line, now abandoned.\nThe former Injune railway line passed through the locality which was served by the Ona Ona railway station in the north-eastern corner of the locality (). It was named by the Queensland Railways Department on 29 April 1915, using an Aboriginal word meaning boxtree flat.\nDemographics\nIn the , Dargal Road had a population of 152 people.\nIn the , Dargal Road had a population of 198 people.\nEducation\nThere are no schools in the locality. The nearest primary and secondary school is Roma State College in Roma to the east.\nReferences"
    }
  ]
}