{
  "content": [
    {
      "type": "text",
      "text": "# Darling (software)\n\n| repo = [https://github.com/darlinghq/darling github.com/darlinghq/darling]\n| operating system = Linux\n| genre = Compatibility layer\n| license = Various, primarily GPLv3\n| website =\n}}\nDarling is a free and open-source macOS compatibility layer for Linux. It duplicates functions of macOS by providing alternative implementations of the libraries and frameworks that macOS programs call. This method of duplication differs from other methods that might also be considered emulation, where macOS programs run in a virtual machine. Darling has been called the counterpart to WINE for running macOS apps.\nThe project started in the summer of 2012 and builds on a previous project, named maloader, which was discontinued due to a lack of time. The layer has been shown to work with many console apps, such as Midnight Commander, The Unarchiver, Python, etc. on the layer, but it also has basic support for graphical applications based on the Cocoa framework. Darling has the ability to extract Apple Disk Images.\nThe project aims to support iOS applications in the future.\nArchitecture\nAt the entry of the Darling system is a loader for Mach-O binaries, the executable format for Apple's operating systems. Darling's predecessor, maloader, presented a maximalist approach to the problem by trying to replicate everything that Apple's dynamic library loader dyld does. This proved to be hard, and since a 2017 \"Mach-O transition\" Darling has been using a lightweight loader just enough to launch the open-source Apple dyld instead.\nTo provide the macOS binaries with a kernel, Darling uses a modified XNU kernel (with an APSL license) wrapped into a Linux kernel module with a GPL license. It is not the same as including GPL code in APSL software, and the APSL license allows for linking from code with a different license (in this case GPL). The module handles the typical job of a Mach kernel, mainly Ports IPC handling. Some licensing issues exist  in the darling-mach module, as the team are adding GNU GPL modifications to the APSL kernel.\nHigher than the kernel is the root environment. Darling, like WINE, supports chroot prefixes, implemented using the Linux overlayfs (as opposed to path translation in WINE). PID, IPC, and UTS namespaces are used to create a container for the Darwin system inside.\nThe frameworks and system libraries in Darling are, to the best possible extent, based on source code released by Apple. The Mach-O transition allows these frameworks to be built more easily, because they are now built as the Mach-O format they were intended for. To fill in the gaps for many higher-level frameworks like Cocoa, Darling uses code from Cocotron, ApportableFoundation, and GNUstep.\nLicense\nThe larger Darling system is based on many external components which use various licenses, all of which are open-source. The primary license is GPLv3.\nExternal links\n* https://www.darlinghq.org/\n* https://github.com/darlinghq/darling\nReferences"
    }
  ]
}