{
  "content": [
    {
      "type": "text",
      "text": "# Darwin rebellion__disambig_1\n\nin 1913, with Liberty Square in foreground]]\nThe Darwin rebellion of 17 December 1918 was the culmination of unrest in the Australian Workers' Union which had existed between 1911 and early 1919.  Led by Harold Nelson, over 1,000 demonstrators marched on Government House at Liberty Square in Darwin, Northern Territory, Australia where they burnt an effigy of the Administrator of the Northern Territory, John Gilruth, and demanded his resignation.\nTheir grievances were against the two main Northern Territory employers, Vestey’s Meatworks and the Commonwealth of Australia, and concerned political representation, unemployment, taxation and ongoing industrial disputes following the implementation of the White Australia policy. Gilruth and his family left Darwin soon afterwards under the protection of , while the Vestey company permanently closed its Darwin operations in 1920.\nThe event was described as the nearest thing to a revolution in Australia since the Eureka Stockade rebellion at Ballarat in 1854.\nBackground\nFrom 1863 until 1911, Northern Territory residents were entitled to vote in both South Australian and from 1901, Commonwealth elections. This status had also enabled Territorians to qualify as South Australian voters in elections for both Houses of the Commonwealth Parliament after Federation in 1901.\nOn 1 January 1911, the transfer of the Northern Territory to the Commonwealth government deprived Territorians of all political representation and voting rights. The Commonwealth Constitution did not allow for Federal electorates to cross state borders. This enabled national governments to avoid a hypothetical impasse where a thousand Territory voters might some day hold the balance of power in an evenly divided Commonwealth Parliament. Of the 4.5 million European Australians living on the continent, only 1,729 lived in the Northern Territory, along with about 1,300 Chinese and an unknown number of indigenous Australians.\nFollowing the transfer, the Northern Territory was run by an administrator appointed by the Commonwealth executive, a public servant answerable to the Commonwealth. In the years following Commonwealth Administration, Territorians became increasingly unhappy with unrepresentative government from southern Australia. The Northern Territory's few economic pursuits—pearling, pastoralism, and mining—were all run down. Expected Commonwealth-led development dissipated as Federal funding was diverted towards Australia's participation in World War I. Consequently, conflict between labour unions and the Northern Territory administration began to grow.\nJohn Gilruth\n, Sir Walter Barttelot, and John Gilruth in 1912]]\nDr John A. Gilruth arrived in Darwin in April 1912, after prime minister Andrew Fisher invited him to join a scientific mission to investigate the potential of the Northern Territory. He was later given the position of Administrator of the Northern Territory. Gilruth's appointment sparked his enthusiasm for economic development of the Northern Territory by means of \"mining, crop-growing and pastoralism\".\nIn 1913 Gilruth gave Carl Strehlow his support after undertaking a trip to Hermannsburg to investigate negative reports given by Walter Baldwin Spencer of Strehlow's Lutheran mission there. Spencer was critical of Strehlow's work, and wanted to convert the mission into a home for \"half-castes\" (that is, an Aboriginal reserve).\nFrom the beginning, Gilruth's plans for economic development did not progress as planned. He did his best to promote mining and agriculture, including the development of a meatworks in Darwin by the English firm, Vesteys. However, these attempts proved disappointing, and by 1913, the Gilruth administration was already becoming unpopular.  With the outbreak of World War I in August 1914, the Commonwealth Government lost interest in development of the Northern Territory as federal funds were diverted towards the war.\nAs a consequence, the weight of public frustration fell upon Gilruth, whose own character and actions helped to bring about that result. He was described as \"headstrong and domineering\". and his blunt, dynamic style of leadership was seen as being arrogant, insensitive, and \"not fitted to rule a democratic people\". He went to Darwin predisposed \"to treat the Chinese with reserve, the Aboriginals with heavy-handed paternalism and the white trade unionists with suspicion\". Gilruth constantly clashed with trade unionists, employers, workers, and even his own officers. With Gilruth hindered by the Commonwealth Government, \"which neither gave him the powers he needed to rule effectively nor evolved consistent policies for the region\", a confrontation between his administration and the townspeople was inevitable.\n1913 strike\nThe construction of the railway line from Port Darwin to Pine Creek in the late 1880s required the immigration of Chinese labour. In December 1888, the South Australian Chinese Immigration Act came into effect, effectively putting a stop to the immigration increase. Those Chinese workers already in Darwin had proved themselves reliable, hard-working and good citizens. After the decline of the gold rush, the Chinese population competed for jobs with the White population. Not only did Asians compete successfully against Europeans for jobs that were scarce, but they also diversified into other profitable areas such as vegetable growing, cooking, tailoring and cleaning. Consequently, the retail trade was almost entirely in Chinese hands and their success was resented by Europeans.\nGiven the option, most employers preferred to employ Chinese workers, not necessarily because they were cheaper to employ, but because they were more reliable. The problem faced by unskilled European labourers in the Northern Territory was that no-one cared about their situation. \"Local employers did not want them, the South Australian Government was indifferent to them, and since they were not unionized, their comrades in southern Australia ignored them.\"\nOn 9 January 1911, the Fisher Labor Government issued a Ministerial instruction to implement the White Australia policy. With the threat of Chinese competition reduced, European workers were able to bargain for higher rates of pay. Needing an organisation to represent workers' interests, the Darwin Australian Workers' Union (AWU) came into existence in 1912. Gilruth was given a free hand to deal with the situation in Darwin and arrived in the midst of a long pay dispute involving wharf lumpers and shipping agents. AWU representatives met with Gilruth several times in 1912 and 1913, but little was resolved.\nWhen the government lowered the wages of survey field hands in April 1913, the AWU conducted a secret ballot amongst its members, which overwhelmingly supported a general strike commencing 28 April. Although the Darwin strike was in itself insignificant, the threat of widespread national disruption if Chinese labour were used to keep the northern port operational, was significant. After weeks of strike action, the union reserves were empty of strike funds, the parent AWU in Townsville hostile to the whole event, the Federal government indifferent and a number of strikers back at work, it was evident that strike action was lost. In late May, AWU representatives met with Gilruth to negotiate their terms of surrender; the unionists were prepared to return to work as long as the strikers were re-instated to their former positions. Not content with his devastating victory, Gilruth refused, \"wanting to eliminate all traces of unionism in the Northern Territory\". Although the strike was called off in the first week of June, it shaped future industrial relations in the Northern Territory, as the \"White Australia\" policy and anti-Chinese feeling fuelled support for the Unions.\nEmergence of the AWU\nHarold Nelson moved to Darwin from Pine Creek in 1913 with his wife and five children. He quickly became the driving force and organiser for the Australian Workers' Union (AWU). Under his leadership, membership to the AWU rapidly grew reaching approximately 700 by 1915. Most members were employed in key infrastructure areas including occupations at the wharf, on the railway line, truck owners, and in the construction of the Vesteys Meatworks at Bullocky Point. Their catchcry quickly became 'no taxation without representation'. Nelson's tactics were simple, he wanted to secure a strong membership base before using industrial muscle.\nThe Chinese were not allowed to join the unions and by late 1914, mainly through Nelson's swift and ruthless actions, Chinese workers had been excluded from all labouring work, except that of a domestic nature. Many Chinese had been employed at the wharf and as a result the AWU demanded and got higher wages for white workers. In 1914 and early 1915, through a campaign of boycotts and strikes, Nelson forced Vestey Brothers to raise wages for their construction workers and meatworks employees in Darwin. Further industrial affairs continued as the meatworks project progressed.\nNelson met with Gilruth in the second week of November 1914. Although there is no record of the first confrontation between the men, subsequent records indicate the meeting concluded in a significant victory for the AWU. At that time, carpenters united to join the AWU (and not their parent Carpenters and Joiners union). By late 1916, the AWU in Darwin had grown into a formidable body with little minority opposition.\nVestey's meatworks\nGilruth had correctly envisaged that, for the foreseeable future, large-scale private enterprise in Darwin would be based on the mining, agriculture and cattle industries. The large British conglomerate, Vestey Brothers, proposed setting up a meat processing plant in Darwin and work commenced on this in 1914. An analysis of the negotiations suggested that neither the government nor Vestey Brothers were fully confident of the success of the venture they were about to undertake. It also showed that Gilruth, as the middleman, was thoroughly influential in its outcome. It was largely through his efforts that Vestey Brothers finally consented to building a meatworks in Darwin.\nVestey's meatworks began operation in 1917 on Bullocky Point (current site of the Darwin High School) in Darwin. Vestey's entry into the Northern Territory was by far the most promising development in the history of the region. However, due to the labour shortage, workers were able to obtain higher wages through regular strikes. As a consequence, Vestey's could not make the meatworks profitable. Its temporary closure in 1917 significantly affected the already struggling Territory economy by putting hundreds of workers out of work. Additionally, a conspiracy was reportedly uncovered between the Government and Vestey's regarding the illegal takeover of a large pastoral property. Gilruth was alleged to have distributed significant bribes, and H. E. Carey—who was both Government Secretary and the Chief Clerk at the meatworks—was accused of collusion.\nIt was widely thought that Vestey Brothers, with its experience in similar ventures elsewhere and access to substantial capital, would be able to develop large-scale cattle rearing in the Territory without significant government intervention. Cattle was the one commodity that Northern Australia produced in large numbers. It was thought that Gilruth and the Federal government fully supported Vestey's plans.\nFrom the time of the meatworks establishment in 1914 until its permanent closure six years later in 1920, Vestey's had lost a great deal of money. The Darwin venture existed in a vacuum filled only by the emergent Australian Workers' Union (AWU) and by World War I. During that time, Gilruth came to matter less and less as the AWU gathered strength under the leadership of Harold Nelson.\nPalmerston District Council\nThe Palmerston (Darwin) District Council was established by proclamation in 1874, with representatives elected on a ratepayer franchise. On 4 February 1915 the Minister for External Affairs, Hugh Mahon, decided to abolish the council, thus depriving Territorians of their slight vestige of democratic government. He gave as his reasons that \"the District Council had blocked the government at every move\". The new council would be replaced by two representatives of the government and two elected by the ratepayers, with Carey as Chairman. In effect, this gave Gilruth increased powers.\nThe abolition of the Palmerston District Council was a political error, but at first neither the Minister nor Gilruth saw it. The council's importance, however, lay in the fact that it was \"the only symbol of representative government and democracy in the Northern Territory\", and was made up of a small but influential middle class of Darwin, such as shipping agents, mine owners, landlords and ranking public servants. These were the people whose support Gilruth needed, but instead the Minister's announcement further alienated Gilruth from the townspeople.\nThe Prime Minister was not as concerned as his colleagues were about the troubles in Darwin. He dismissed the matter, saying that it was \"a healthy sign, showing that people are alive to their own interests\". In the weeks that followed the announcement of the demise of the Palmerston District Council, support for the AWU organiser, Harold Nelson, rapidly grew. Although in a time of rigid social structure, men of all classes united in the pursuit of a common aim behind Nelson. Ignoring growing discontent, Gilruth distanced himself from the people even further, by moving to take over the hotels.\nNationalisation of hotels\nin the 1920s]]\nOn 29 September 1915, an ordinance passed by the Federal Executive Council in Melbourne nationalised the supply of liquor in the northern part of the Territory.  The legislation was ostensibly aimed at Chinese 'sly-groggers' often accused of selling low quality liquor, but in effect was designed to curb consumption of alcohol in northern Australia and provide some revenue to the Federal budget. Known as the 'government-takeover', penalties were steep and costs of administration and auditing the hotels rose rapidly. There were also some adverse side-effects with the closure of several popular hotels and the appointment by Gilruth of a 'supervisor of hotels', at a high salary. As a result of the takeover, the price of beer and whisky rapidly increased. It was reported that the price of beer jumped by 30 percent. Gilruth had also ordered the closure of the public bar in the popular Victoria Hotel and consequently, the hotel was losing profits.\nIn 1918, several station owners and businessmen abandoned the Territory, including the manager of the State Liquor Department, because of Gilruth's policies. However, the mistake that helped finish Gilruth's career in the Territory, was trivial. As Darwinites prepared to celebrate the end of the war, the women employed in the state hotels asked for a few hours off on Saturday, 14 November to join in the celebrations. The hotel boarders agreed to dine elsewhere and everybody presumed the matter was closed. However, Gilruth subsequently refused to concede leave for the women, who took the time off anyway. When they returned to work the next day, they found themselves locked out by order of the administrator. It was also reported that Gilruth refused permission for a ship to unload 700 cases of beer for the town's Christmas supplies.\nOn Saturday afternoon, 7 December, there was a meeting at Darwin Oval, attended by several hundred people, about ever-increasing alcohol prices and the re-opening of the Victoria Hotel public bar. On 16 December, Nelson met with the Police Inspector and asked for permission to stage a peaceful protest march from Parap to Government House. The Police Inspector gave permission on the condition there would be no violence.\nRebellion\nOn the afternoon of 17 December 1918, stop-work meetings were held in Darwin and at the meatworks. Over 1,000 men walked to Government House demanding \"no taxation without representation\", behind a car carrying an effigy of Gilruth tied to a stake. A deputation presented a motion to Gilruth that stated in part:\nWe, the citizens of Darwin here assembled ask that the Administrator address us regarding his administration of the Territory of the last five years. Failing to comply, that he be asked if he is willing to leave Darwin by the steamer and remain away until a public commission is granted on his administration. This meeting will guarantee him safe conduct to the steamer....\nGilruth initially refused to address the crowd other than making a statement that he was answerable to the Minister and would not and did not recognise the citizens of Darwin as having any authority over him. The crowd outside became tense and impatient. The crowd demanded that Gilruth appear before them to vindicate himself. Surprisingly, Gilruth complied but he was defiant, inviting the crowd to gaze upon him and stating if recalled by the Minister he would leave, but under no other circumstances would he leave his post.\nAs the crowd swelled, part of the picket fence around Government House collapsed and union leader Harold Nelson reportedly called out \"over the fence boys\". The crowd advanced across the garden into Government House. For a few moments, Gilruth was roughly handled and abused as he attempted to flee into the residence. Windows were broken and the wire netting removed from the tennis court. Eventually, the crowd dispersed, but not before they carried Gilruth's effigy to the front gate of Government House, soaked it in kerosene and set it alight.\nIn a subsequent letter to the Prime Minister, Gilruth stated that \"he was perfectly aware that had he promised to reduce the price of beer (at the expense of the Australian taxpayer) the mob would have departed peacefully. However, though this would have been 'diplomatic,'  to purchase peace at this price would have been condemned by the Minister and the Treasury\".\nThe government was alarmed, and within a week of the incident the lightly armed gunboat HMAS Una arrived to protect the administrator. She anchored beneath Government House Cliff on Christmas Eve. Another public meeting was held in January 1919, and a telegram sent from the meeting to the acting prime minister which read:\nWe, the citizens of the Northern Territory, beseechingly implore you to recall the Administrator, Dr. Gilruth, in the interests of life and property, as his autocratic administration is fast reaching a grave crisis.\nIn the weeks that followed, Gilruth and his family were virtual prisoners within the residence. On 20 February 1919, Gilruth left Darwin by his own accord and boarded HMAS Encounter, a cruiser with eleven 6-inch guns and nine 12-pounder guns, still the administrator, but now prepared to function from Melbourne. His departure effectively ended what was to become commonly known as the \"Darwin Rebellion\".\nAftermath\nWartime censorship prevented news of the storming of Government House in Darwin reaching the national press until the following Thursday afternoon. The news was received with great interest. The national press reacted by blaming a Soviet establishment in Darwin, total anarchy, an uncaring federal government and Gilruth himself. The rebellion was described as the nearest thing to a revolution since the Eureka Stockade at Ballarat in 1854.\nIn November 1919, the Hon. Norman Kirkwood Ewing of the Tasmanian Supreme Court was appointed to chair a Royal Commission on Northern Territory Administration. The outcome of the Royal Commission was the Northern Territory Representation Act 1922 (Cwlth) which provided for one Northern Territory member of the House of Representatives; the member had no voting rights, could not be chosen to be the Speaker or Chairman of Committees, and was not counted for quorum or majority determination purposes in the House.\nGilruth never returned to the Northern Territory. In the 1920s, he advanced his career with the Council for Scientific and Industrial Research in Melbourne. In 1933, he was elected to the presidency and in 1936 to honorary membership of the Australian Veterinary Association. Gilruth retired in 1935 and on 4 March 1937, he died of a respiratory infection at his home at South Yarra, Melbourne, and was cremated.\nBriefly imprisoned at Fannie Bay Gaol for his \"no taxation without representation\" campaign, Harold Nelson won the first Territory seat in the House of Representatives in 1922 and held the seat until 1934. Nelson spent his time in parliament campaigning for greater expenditure and self-government for the Northern Territory, with little success.  Following his defeat at the 1934 election, Nelson moved to Alice Springs to work as an agent. He died from unexpected cardiac failure in Alice Springs in 1947. He was survived by his wife and five children. One of these children, Jock Nelson, also served as member for the Northern Territory and in 1973 became the first Territory-raised administrator of the Northern Territory.\nLegacy\n* Liberty Square, the parcel of vacant land opposite Government House, is named after the gathering site of the Darwin Rebellion.\n* The Northern Territory Electoral division of Nelson is named after Harold Nelson, as is Nelson Terrace in Alice Springs.\n* Gilruth Avenue in Darwin is named after Dr. John Gilruth.\n* Carey Street in Darwin is named after H. E. Carey.\n* Vesteys Beach in Darwin, one of the beaches overlooked by Vestey's Meatworks, was named after the meatworks.  In 2021, the name of the beach was changed to the traditional Larrakia name, Bundilla Beach.\nSee also\n* Bendigo Petition\n* Forest Creek Monster Meeting\n* Rum Rebellion\nReferences\nExternal links\n*"
    }
  ]
}