{
  "content": [
    {
      "type": "text",
      "text": "# Datta dynasty\n\nDeva dynasty\n| p2              = Indo-Greek KingdomIndo-Greeks\n| s1              = Mitra dynasty (Mathura)Mitra dynasty\n| s2              = Northern Satraps\n| s3              = Indo-ScythiansScythian Empire\n| religion        = Hinduism\n| today           = India\n}}\n. Obv: railing with symbol between the posts. Obv: Sivadatasa, uncertain central symbol, margin: deer and tree within railing.]]\nThe Datta dynasty is a dynasty of rulers who flourished in the northern India in the areas of Mathura and Ayodhya around the 1st century BCE – 1st century CE. They are named after the \"-datta\" ending of their name, and essentially only known through their coins. It is thought that they replaced the Deva dynasty, which had originated with the rise of Sunga Empire Pushyamitra, and that they were in turn replaced by the Mitra dynasty.\nThe known Datta rulers are:\n*Seshadatta\n*Ramadatta\n*Sisuchandradatta\n*Sivadatta.\nThe coins of Ramadatta usually represent a Lakshmi standing, and facing elephants. In the archaeological excavations of Sonkh, near Mathura, the earliest coins of the Northern Satraps level were those of Hagamasha and Ramadatta.\nThe Datta rulers are never mentioned as \"king\" or Raja on their coins, suggesting that they may only have been local rulers subservient to another king. Since the Indo-Greeks were in control of Mathura around the same time frame (150–50 BCE) according to the Yavanarajya inscription, it is thought that there may have been a sort of tributary relationship between the local  Datta or Mitra dynasty and the Indo-Greek kings. Alternatively, the Datta and Mitra dynasties of rulers may simply have replaced Indo-Greek rule in the region, before the advent of the Indo-Scythian Northern Satraps and then the Kushans.\nMathura Uttamadatta.jpg|Coin of Uttamadatta.\nMathura Purushadatta.jpg|Coin of Purushadatta.\nMathura Ramadatta.jpg|Coin of Ramadatta.\nReferences"
    }
  ]
}