{
  "content": [
    {
      "type": "text",
      "text": "# Dave King (actor)\n\n|birth_place       = Twickenham, Middlesex, England\n|death_date        =\n|death_place       = London, England\n|occupation        = Comedian, singer, actor\n|partner           =\n|resting_place     =\n|years_active      = 1955–1990s\n|website           =\n}}\nDave King (born David Kingshott; 23 June 1929 – 15 April 2002) was an English comedian, actor and vocalist of popular songs. He is remembered for screen roles such as the corrupt policeman 'Parky' in the British gangster film The Long Good Friday (1980) and Clifford Duckworth in the soap opera Coronation Street.\nLife and career\nBorn in Twickenham, Middlesex, England, King left school aged 12 and joined Morton Fraser's Harmonica Gang in his teens. He did his National Service in the RAF and was in the unit's repertory company. On being demobilised, he returned to variety and later became a solo act as a comedy impressionist in 1952. A television appearance on Easter Music Hall occurred in April 1954. Prior to his TV appearances he had a regular weekly radio show. It was for this radio show that Sid Green and Dick Hills first became his scriptwriters. At the time Hills was still a Form Master at Haberdashers Aske's, and when King got his regular TV show they both gave up their jobs to become full time scriptwriters. led to his compering the monthly BBC-TV series Showcase beginning on January 24, 1955 He was given a monthly series on the BBC starting on 15 October  1955. The next year he turned to singing, while continuing to perform on television. During the seaside summer season of 1956 he performed at the Winter Gardens in Blackpool. He starred in The Dave King Show. During the 1950s he also starred in the same show alongside Shani Wallis. In 1958, King moved to ITV with The Dave King Show which was song, dance and comedy with famous guests of the day.\nKing scored four hits on the UK Singles Chart in the middle of the 1950s. The biggest were \"Memories Are Made of This (No. 5, 1956) and \"You Can't Be True to Two\" (No. 11, 1956), both of which featured a backing group called the Keynotes. He also charted with \"Christmas and You\" (No. 23, 1956) and \"The Story of My Life\" (No. 20, 1958). He appeared on Decca Records' All Star Hit Parade charity record in 1956 along with other major Decca artists Dickie Valentine, Joan Regan, Winifred Atwell, Lita Roza and David Whitfield. That record charted at No. 2 in the UK Singles Chart.\nIn 1959, he went to the United States and hosted the country's high-profile Kraft Music Hall on 19 occasions, but otherwise had limited success despite Mel Brooks joining his regular writers Sid Green and Dick Hills. On returning to the United Kingdom, he found that the public's taste in comedy had changed. ''Dave's Kingdom'' ran on ITV in 1964, again made by ATV, but was less successful than King's earlier TV work. King became a straight actor with some success, starring in the films Pirates of Tortuga (1961), Go to Blazes (1962), The Road to Hong Kong (1962), Strange Bedfellows (1965), Up the Chastity Belt (1971), The Ritz (1976), The Golden Lady (1979), Cuba (1979), The Long Good Friday (1980), Warren Beatty's Reds (1981) and Revolution (1985). He also appeared in a number of TV series including Hazell (1978), Pennies From Heaven (1978), Minder (episode: \"Gunfight at the OK Laundrette\", 1979), Shoestring (episode: \"The Teddy Bears' Nightmare\", 1980).\nKing appeared in two of the UK's most hard-hitting police series, The Sweeney and The Professionals.\nHis appearance in The Sweeney saw him play Arnold Drake, the leader of a gang of armed robbers in the episode: \"Pay Off\" (1976), whilst in The Professionals he appeared in the role of organised crime lord Harry Walter, the mastermind of a silver bullion robbery in the episode \"Hijack\" (1980).\nFurther television appearances included the Rumpole of the Bailey episode \"Rumpole and the Blind Tasting\" (1987) and as Aidensfield Station Master Roy Hutton in Heartbeat (episode: \"Unfinished Business\", 1995). The closing scene of the episode features King's character standing on the platform of Aidensfield Station while \"Memories Are Made of This\" plays in the background.\nIn the theatre, he appeared in Arsenic and Old Lace, playing Mortimer Brewster, and in ''Teeth 'n' Smiles (1975/6).\nHe married Jean Hart in 1955, and they had two daughters, Cheyenne and Kiowa. They lived in South Cerney in Gloucestershire. His hobbies included model railways and American folklore.\nKing died in London on 15 April 2002, aged 72.\nFilmography\n{| class=\"wikitable\"\n|-\n! Year\n! Title\n! Role\n! Notes\n|-\n|1961|| Pirates of Tortuga || Pee Wee ||\n|-\n|1962|| The Road to Hong Kong || Mr. Ahso - Chinese Restaurant Owner || Uncredited\n|-\n|1962|| Go to Blazes || Bernard ||\n|-\n|1965|| Strange Bedfellows'' || Toni's Taxi Driver ||\n|-\n|1970|| Up the Chastity Belt  || Landlord of the Blue Boar ||\n|-\n|1976|| The Ritz || Abe ||\n|-\n|1979|| Cuba || Miss Wonderly's Press Agent ||\n|-\n|1979|| The Golden Lady || Dietmar Schuster ||\n|-\n|1979|| Minder || Alfie||\n|-\n|1980|| The Long Good Friday || Parky ||\n|-\n|1981|| Reds || Allan Benson ||\n|-\n|1983|| Play for Today ('Last Love')|| Jack Ives|| Series 13, episode 9 (co-written by Reg Gadney -  (co-starring  Elizabeth Sellars)\n|-\n|1985|| Revolution || Mr. McConnahay ||\n|-\n|1986|| Bleak House (1985 TV serial) ||Sgt. George||\n|-\n|1989|| Rude Awakening || Hippy on Street ||\n|}\nReferences\nExternal links\n*"
    }
  ]
}