{
  "content": [
    {
      "type": "text",
      "text": "# David Mayer (historian)\n\n| birth_place        = Chicago, Illinois U.S.\n| death_date         =\n| death_place        =\n| occupation         = Academic\n| years_active       =\n| known_for          = Writing about theatre history, being mistaken for a Chechen terrorist\n| notable_works      =\n| relatives          = Catherine Mayer (daughter), Lise Mayer (daughter)\n| website            =\n}}\nDavid Mayer (November 23, 1928 – August 24, 2023) was an American-British theatre historian. He was Emeritus Professor of Drama and Honorary Research Professor at the University of Manchester. Mayer was also known for accidentally being placed on a U.S. terrorism blacklist due to a case of mistaken identity.\nIn 2016, Mayer discovered that he had been placed on a U.S. security list because a Chechen militant called Akhmed Chatayev, who was wanted by US authorities, had used the alias 'David Mayer'. The case of mistaken identity meant Mayer could not travel to the US or receive mail from the US.\nAs of November 2020, Mayer was still encountering bureaucratic problems as a result of his name being on a watchlist. One result of this appeared in December of 2024 even after his death.\nAs a theatre historian, his work centres on the \"drama of the long 19th century and with the late-Victorian stage’s many links with early [silent] film.\" In 2012, he received the American Society for Theatre Research (ASTR) Distinguished Scholar Award. In 2017, Mayer supported a campaign to save Harker's Studio, one of the last theatre scenery workshops in the UK.\nHis publications include Stagestruck Filmmaker, about the film director D.W. Griffith and Harlequin in His Element: The English Pantomime, 1806–1836.\nMayer was a U.S. Army veteran and the father of the UK's Women's Equality Party founder Catherine Mayer, and writer and activist Lise Mayer, who co-created the sitcom The Young Ones.\nMayer died in August 2023, at the age of 94.\nReferences"
    }
  ]
}