{
  "content": [
    {
      "type": "text",
      "text": "# David Cobb 2004 presidential campaign\n\nThe 2004 presidential campaign of David Cobb, a Texas attorney, was Cobb's second overall election campaign, having run for State Attorney General in 2002. Prior to seeking the presidential nomination of the Green Party of the United States, he was involved with Ralph Nader's campaign in 2000 and was an activist for the Green Party.\nBackground\nTexas attorney David Cobb first sought office as a Green Party candidate in 2002, running for Attorney General of Texas. He received just over 41,000 votes, 0.92 percent of all ballots cast, leaving him in fourth place and losing to Republican candidate Greg Abbott. Cobb had also worked on Green candidate Ralph Nader's 2000 presidential campaign, and served as the national party's general counsel. In July 2003, NBC News reported that Cobb was regarded as a possible candidate for the next year's presidential nomination.\nNomination\nOn June 26, 2004, during the Green Party's national convention in Milwaukee, Wisconsin, 769 delegates from 47 states voted on the party's presidential nominee. On the first ballot, Cobb came in first with 308 delegates; however, he was 77 short of the 385 delegates required for nomination; Cobb's nearest competitor, Nader, received 117.5 votes. Prior to the second round, four first-round candidates — including Nader and Camejo — were eliminated, as they had failed to \"indicate, in writing, that they would accept the nomination as the Green Party candidate for President.\" In the second-round vote, Cobb received 408 votes, 100 more than his nearest competitor — \"No nominee\" — and thereby secured the party's presidential nomination. Following his nomination, Cobb expressed gratitude to Nader, stating \"Ralph, if you are watching, thank you for what you have done, and thank you for what you will continue to do.\"\nCobb selected as his running-mate activist and 2002 gubernatorial candidate Pat LaMarche of Maine. This marked the first time that the Green presidential ticket included two candidates who were registered Greens, unlike in 2000.\nCampaign\nStrategy debate\nAn issue of contention within the party was whether the campaign should concentrate its efforts in \"safe states\" — those that were likely to vote for the Democratic or Republican candidate by a large enough margin that voting Green would not change the winner — or whether they should seek votes everywhere. Cobb stated his intention to run a campaign focused on building the Green Party and pursuing a \"strategic states\" or \"smart states\" strategy which would take into account the wishes of Greens in each state, and which otherwise would focus on states that traditionally are \"safely\" won by the Democratic candidate, or \"safely\" won by the Republican candidate, with a large margin of victory.\nCivil disobedience\nOn October 8, 2004, Cobb was arrested in an act of civil disobedience, breaking a police line while protesting the Commission on Presidential Debates for excluding third-party candidates from the nationally televised debates in St. Louis, Missouri. Also arrested was Libertarian candidate Michael Badnarik.\nAftermath\n, whose campaign he managed]]\nFollowing the election, and Bush's narrow victory in New Mexico, Cobb and Badnarik jointly requested a recount of ballots in the state, citing reports of problems with provisional ballots and voting machines. They also observed that the voting machines had recorded over 21,000 undervotes, while Bush's margin in the state was just 6,000 votes. Following their request, the state legislature altered a law to state that, in the event that candidates request a recount in the state, the canvassing board may require them to pay the entire estimated cost for the process up-front. Cobb and Badnarik took the matter to court, and on May 16, 2006, the New Mexico Supreme Court ruled in favor of the two candidates, thereby invalidating the 2005 law on the grounds that the law constituted an \"unconstitutional delegation of legislative power\" by failing to offer the canvassing board guidance on how much money to charge for the recount. A statewide recount was not ordered following the ruling, however, because Bush would have won the Electoral College vote in the election regardless of the recount's outcome.\nThere was speculation that Cobb, given his high position within the party, might again run for their presidential nomination. However, on October 3, 2005, Cobb announced that he would not run for the Green presidential nomination in 2008, stating that he thought the party should run a female candidate next, to show that \"the Greens take gender equality seriously\", and that he would be open to the possibility of running for vice president as part of the ticket. In 2016, Cobb served as campaign manager for Green presidential nominee Jill Stein.\nReferences"
    }
  ]
}