{
  "content": [
    {
      "type": "text",
      "text": "# David A. King (engineer)\n\n| birth_place    = Indiana, U.S.\n| death_date     =\n| death_place    =\n| education      = Bachelor's degree in mechanical engineering at University of South Carolina, Master's degree in business administration at Florida Institute of Technology\n| occupation     = CEO at Dynetics, Inc.\n| title          =\n| spouse         =\n| parents        =\n| children       =\n| nationality    =\n| website        =\n}}\nDavid Arnold King is an American engineer who was the tenth Director of the NASA Marshall Space Flight Center in Huntsville, Alabama.\nEarly life, family and education\nKing was born in Indiana and raised in Sumter, South Carolina.\nHe earned a bachelor's degree in mechanical engineering from the University of South Carolina, and in 1991 a master's degree in business administration from the Florida Institute of Technology.\nCareer\nKing joined NASA in 1983 as a main propulsion system engineer. In subsequent roles, he also served as vehicle manager and flow director (1992–1996) for the Space Shuttle Discovery, overseeing preflight preparation, test and checkout of the orbiter. He was appointed acting deputy director of the Installation Operations Directorate in 1995; deputy director of Shuttle Processing in 1996; Shuttle launch director in 1997; and director of Shuttle Processing in 1999.\nKing served as deputy director of the Marshall Space Flight Center from November 2002 until his appointment as director, and served as the senior on-site NASA official during recovery operations for the Space Shuttle Columbia disaster.\nHe was appointed to the director position on June 15, 2003. He retired from NASA on March 26, 2009.\nSoon thereafter, King started in the position of Executive Vice President at Dynetics, Inc., a Huntsville-based defense contractor. He was promoted to President in 2013 and then to CEO in 2015.\nPersonal life\nKing has two daughters.\nReferences\nExternal links\n* [https://web.archive.org/web/20060929232324/http://bios.msfc.nasa.gov/d_king.html Biography] at NASA.gov (archived)\n* [http://www.findarticles.com/p/articles/mi_pasa/is_200305/ai_2768096100 David A. King Named Marshall Space Flight Center Director]"
    }
  ]
}