{
  "content": [
    {
      "type": "text",
      "text": "# David Stewart (Dynamite producer)\n\n(death date first) -->\n| death_place       =\n| genre             =\n| occupation        =\n| instrument        =\n| discography       =\n| years_active      =\n| label             = Stellar Songs\n| current_member_of =\n| past_member_of    =\n| website           =\n}}\nDavid Stewart is a British songwriter, record producer, and musician. He co-wrote and produced BTS' song \"Dynamite\" (2020).\nEarly years\nStewart's father is Allan Stewart, a Scottish actor, comedian, singer and pantomime artist. His mother is an actress and a dancer. Later on, she started a hospitality company that catered for major tours. His sister Kate is a musician working for Warner Music. Being in an artistic family, Stewart started very early and his father told the Scottish Daily Record that by the age Stewart was making up songs. In his early years, ended up drumming in a band supporting Simply Red in a 15-arena tour all across the UK. In 2012, he released his mixtape Late Night Viewing and following that, a four-track EP called Dark Side of Paradise.\nCareer\nStewart became a session guitarist playing in hundreds of live shows and gigs with Example, an English singer-rapper-producer, in the early 2010s.\nMoving to Atlanta for two years, he wrote hundreds of songs and performed as a session musicians many times. He returned to England writing and producing for young or up-and-coming artists. He ended up getting attention from major-label A&Rs and landed a cut with the UK rapper Tinie Tempah in his 2017 album track \"Cameras\". Stewart co-wrote the song and was featured in the track appearing in Tinie Tempah 2017 album Youth. Discovering and working closely with the singer Claudia Valentina was another break. He also worked with Charlie Christie, managing artists like Rex Orange County. He became an A&R at Interscope Records, and with Neil Jacobson who runs Hallwood Media. Jacobson had been a former president of Geffen Records. Very soon, Stewart ended up writing and producing cuts for Hailee Steinfeld and the Jonas Brothers. The song \"What a Man Gotta Do\" co-wrote by Stewart became a hit for the Jonas Brothers in January 2020. Stewart was also associated with Tim Blacksmith and Danny D, founders of Stellar Songs, a publishing company that signed him.\nBTS and \"Dynamite\"\nIn 2020, BTS's management was on the hunt for a songwriter and producer for an all-English song, a first for the band. Their choice fell on English songwriter/producer David Stewart and on songwriter Jessica Agombar. Stewart had collaborated many times with Agombar who worked for Atlantic Records and wrote for the girl band Parade. Neil Jacobson, David's Manager, sent the track to Columbia Records' CEO Ron Perry and Big Hit, BTS' record label in early July 2020. The creation process of the song \"happened within a couple of months\". On July 26, 2020, the band confirmed during a livestream on V Live that they would be releasing an English-language song on August 21, 2020, as the first single for their upcoming album Be with \"Dynamite\" becoming their most heavily promoted release thus far. Stewart said about his engagement process in an interview with Rolling Stone: \"It was a bit of a holy grail cut. I had quite a few conversations with big producers and writers in America who were trying to get it.\". In addition to co-writing the song, instrumentation was provided by Stewart, who played drums, percussion, bass guitar, synth bass, synthesizers, pads, piano, electric guitars, programmed horns and programmed strings. David Stewart and Jessica Agombar tied at No. 1 on Billboard magazine's Hot 100 Songwriters chart on the chart dated September 5, 2020 staying at the top for 3 consecutive weeks.\nSongwriting and production credits\n{|class=\"wikitable\"\n! Year !! Artist !! Song !! Album !! Ref.\n|-\n| 2010 || Example || \"Won't Believe the Fools\" || ''Won't Go Quietly ||\n|-\n| 2015 || Danny Seth || \"Past/Forever\"  || Perception ||\n|-\n| rowspan=\"4\"| 2017 || TroyBoi || \"Showbiz\"  ||  ||\n|-\n| KStewart || \"Hands\"  ||  ||\n|-\n| Tinie Tempah || \"Cameras\"  || Youth ||\n|-\n| TroyBoi || \"Spooky\"  || Vibez EP ||\n|-\n| rowspan=\"2\"| 2018 || Naïka || \"Serpentine\" ||  ||\n|-\n| Kate Stewart || \"Strangers\" || In the Beginning EP ||\n|-\n| rowspan=\"16\"| 2020 || Jonas Brothers || \"What a Man Gotta Do\" ||  ||\n|-\n| Marina Kaye || \"The Whole 9\" || Twisted'' ||\n|-\n| Griff || \"Good Stuff\" ||  ||\n|-\n| Hailee Steinfeld || \"I Love You's\" || Half Written Story EP ||\n|-\n| Eyelar || \"Say It With Your Eyes\" ||  ||\n|-\n| BTS || \"Dynamite\" || Be ||\n|-\n| Alec Wigdahl || \"Big Red Balloon\" || Bill & Ted Face the Music OST ||\n|-\n| rowspan=\"2\"| Marina Kaye || \"Double Life\" || rowspan=\"2\"| Twisted ||\n|-\n| \"7 Billion\" ||\n|-\n| rowspan=\"2\"| Claudia Valentina || 4:15 || rowspan=\"2\"| Claudia Valentina EP ||\n|-\n| \"If I'm Being Honest\" ||\n|-\n| rowspan=\"5\"| Marina Kaye || \"Scream\" || rowspan=\"5\"| Twisted ||\n|-\n| \"Visions\" ||\n|-\n| \"Blind Heart\" ||\n|-\n| \"Anywhere But Home\" ||\n|-\n| \"Alone\" ||\n|-\n| rowspan=\"7\"| 2021 || L.L.A.M.A. || \"Shake\"  ||  ||\n|-\n| rowspan=\"2\"| Anthony Ramos || \"Lose My Mind\" || rowspan=\"2\"| Love and Lies ||\n|-\n| \"Nobody Else\" ||\n|-\n| Jackson Wang || \"Drive You Home\"  ||  ||\n|-\n| Jonas Brothers || \"Who's in Your Head\" ||  ||\n|-\n| Alan Walker || \"Man on the Moon\"  || World of Walker ||\n|-\n| Monsta X || \"You Problem\" || The Dreaming ||\n|-\n| rowspan=\"3\"| 2022 || Ava Max || \"Million Dollar Baby\"|| Diamonds & Dancefloors||\n|-\n|| Shania Twain || \"Waking Up Dreaming\" || Queen of Me ||\n|-\n|| Olly Murs || \"Die of a Broken Heart\" || Marry Me ||\n|-\n| rowspan=\"5\"| 2023 || Shania Twain || \"Giddy Up!\" || Queen of Me ||\n|-\n| rowspan=\"3\"| Jungkook || \"3D\"  || rowspan=\"3\"| Golden ||\n|-\n|| \"Too Sad To Dance\" ||\n|-\n|| \"Shot Glass of Tears\" ||\n|-\n|| &Team || \"Dropkick\" || First Howling: Me ||\n|-\n|2024 || New Kids on the Block || \"Kids\" || Still Kids ||\n|}\nReferences"
    }
  ]
}