{
  "content": [
    {
      "type": "text",
      "text": "# David S. Ward\n\n| birth_place  = Providence, Rhode Island, U.S.\n| other_names  = David Ward\n| alma_mater   =\n| occupation   =\n| years_active = 1973–present\n| spouse       =\n* Rosanna DeSoto  (m. 1980; div. unknown)\n* Marie-Louise White\n}}\n| children     = 2, including Sylvana\n}}\nDavid Schad Ward (born October 25, 1945) is an American screenwriter and film director. He was nominated for two Academy Awards for his screenplays for the films The Sting (1973) and Sleepless in Seattle (1993), winning for the former. He was also nominated for a British Academy Film Award, a Golden Globe Award, and two Writers Guild of America Awards.\nLife and early career\nWard was born in Providence, Rhode Island, the son of Miriam (née Schad) and Robert McCollum Ward. Ward has degrees from Pomona College (BA), University of Southern California, and the UCLA Film School (MFA).\nHe was employed at an educational film production company when he sold his screenplay for The Sting (1973), which led to an Oscar win for Best Original Screenplay. After this initial success, his follow-up projects were less critically and commercially well received, including Ward's first directorial effort, Cannery Row (1982), and a sequel The Sting II (1983). Ward's efforts to sell a script based on the frontier days of California were undone by an industry-wide \"ban\" on Westerns after the spectacular failure of Michael Cimino's ''Heaven's Gate (1980). He then wrote the comedy Saving Grace (1986) under a pseudonym.\nComeback and Major League\nSting star Robert Redford hired Ward in 1986 to work on the Redford-directed The Milagro Beanfield War. The response to this project enabled Ward to convince Morgan Creek Productions and Mirage Productions to bankroll Major League'' (1989), a baseball comedy that he'd been pitching to producers since 1982. Major League was a labor of love for Ward, who had lived in the Cleveland suburb of South Euclid as a child and who had rooted for the Indians' teams of the 1950s, including the 1954 American League Champions. \"I figured the only way they were ever going to win anything in my lifetime was to do a movie and they'd win\", says Ward.  Within 10 years of the film's release, the Indians would appear in the World Series twice, then again in 2016. In a lawsuit by a judgment creditor, Ward was forced to turn over his prized possession, a baseball bat signed by the cast of Major League. The Court refused to allow the judgment creditor to seize and sell his Oscar, because the Academy of Motion Picture Arts and Sciences had a right of first refusal.\nMajor League and Ward's subsequent efforts as a writer and director, King Ralph (1991) and Major League II (1994), were about underdogs who triumphed over the gadflies and nay-sayers of the world. He later scored a box-office coup with a screenplay co-written with Nora Ephron: 1993's Sleepless in Seattle. He directed the sequel Major League II, then the naval comedy Down Periscope (1996) starring Kelsey Grammer. He also did uncredited rewrites on The Mask of Zorro (1998) and Sahara (2005).\nIn 2006, Ward was credited on another film, Flyboys, a World War I drama starring James Franco and directed by Tony Bill (who was a producer on The Sting). In 2010, it was announced that there would be a Major League 4, starring many of the same cast as the previous films. The script for the film was reportedly finished, as of late 2012, and moving towards pre-production. No further news has surfaced, meaning the project is likely stuck in development hell.\nWard has produced the Canadian-American thriller film Bloodwork, and co-wrote another period drama, ''I'll Find You (previously known as Music, War and Love).\nTeaching\nWard is a professor at Chapman University, in southern California, where he teaches screenwriting and directing, and acts as a Filmmaker in Residence for the campus.\nFilmography\nFeature films\n{| class=\"wikitable sortable\"\n|+\n!Year\n!Title\n!Director\n!Writer\n!Producer\n|-\n| rowspan=\"2\" |1973\n|Steelyard Blues\n|\n|\n|\n|-\n|The Sting\n|\n|\n|\n|-\n|1982\n|Cannery Row\n|\n|\n|\n|-\n|1983\n|The Sting II\n|\n|\n|\n|-\n|1986\n|Saving Grace\n|\n|\n|\n|-\n|1988\n|The Milagro Beanfield War\n|\n|\n|\n|-\n|1989\n|Major League\n|\n|\n|\n|-\n|1991\n|King Ralph\n|\n|\n|\n|-\n| rowspan=\"2\" |1993\n|Sleepless in Seattle\n|\n|\n|\n|-\n|The Program\n|\n|\n|\n|-\n|1994\n|Major League II\n|\n|\n|\n|-\n|1996\n|Down Periscope\n|\n|\n|\n|-\n|2006\n|Flyboys\n|\n|\n|\n|-\n|2012\n|Bloodwork\n|\n|\n|\n|-\n|2019\n|I'll Find You\n|\n|\n|\n|}\nShort films\n{| class=\"wikitable sortable\"\n|+\n!Year\n!Title\n!Writer\n!Advisor\n!Creativeconsultant\n|-\n|2006\n|Coke Accord\n|\n|\n|\n|-\n|2007\n|Lucifer\n|\n|\n|\n|-\n|2008\n|Latter-Day Fake\n|\n|\n|\n|-\n|2009\n|Fiasco''\n|\n|\n|\n|}\nReferences\nExternal links\n*\n* Platt, Ben [http://cleveland.indians.mlb.com/news/article.jsp?ymd=20090407&content_id=4147526&vkey=news_cle&fext=.jsp&c_id=cle MLB.com] , \"Popularity of 'Major League' remains\", April 7, 2009"
    }
  ]
}