{
  "content": [
    {
      "type": "text",
      "text": "# David Warren House\n\n| locmapin             = Maine#USA\n| built                =\n| architect OR builder =\n| architecture         = Federal\n| added                = April 28, 1983\n| area                 =\n| refnum               = 83000467\n}}\nThe David Warren House is a historic house on Sam Annis Road in rural Hartford, Maine.  Built in 1805, it is the only Federal period house to survive in the town, and is also one of its most imposing houses.  It was built by David Warren, an early settler of adjacent Buckfield and a veteran of the American Revolutionary War.  It was listed on the National Register of Historic Places in 1983.\nDescription and history\nThe Warren House is a typical rural New England connected farmstead, with a large main block and an ell joining it to a barn.  The main block is a -story wood-frame structure, five bays wide, with a side-gable roof, two interior chimneys, and a stone foundation.  The main entrance is centered on the front facade, with a transom window above, and is framed by pilasters and an entablature.  There is a secondary entrance in the ell, which extends to the main block's right, and in the rear of the house.  The entire house, including ell and barn, is clapboarded.  The interior of the main block has retained much of its original material, including Federal style fireplace mantels, pumpkin pine flooring, and original doors.\nThe house was built in 1805 by David Warren, a veteran of the American Revolutionary War who was one of the early settlers of nearby Buckfield.  Warren served eleven terms in the state legislature (when the area was still part of Massachusetts), and served as Hartford's justice of the peace.  The house remained in the hands of his descendants until the early 20th century.  It includes a number of 19th-century outbuildings, including a second barn, chicken coop, and ice house.\nSee also\n*National Register of Historic Places listings in Oxford County, Maine\nReferences"
    }
  ]
}