{
  "content": [
    {
      "type": "text",
      "text": "# David Howarth\n\n| birth_place = Wednesbury, Staffordshire, England\n| death_date =\n| death_place =\n| nationality = British\n| spouse =\n| relations =\n| children =\n| residence =\n| alma_mater = Clare College, CambridgeYale Law School\n| occupation =\n| profession =\n| religion =\n| signature = Signature of David Howarth.svg\n| website = [http://www.davidhowarth.org.uk/ David Howarth MP]\n| footnotes =\n}}\nDavid Ross Howarth (born 10 November 1958) is a British academic and politician who was the Liberal Democrat Member of Parliament for Cambridge from 2005 to 2010. He served as an Electoral Commissioner between 2010 and 2018. He is Professor of Law and Public Policy at the University of Cambridge.\nHe is the author of Textbook on Tort, Law as Engineering: Thinking about What Lawyers Do and articles in academic journals and chapters in academic books. He researches into a broad range of public and private law areas, conducting empirical research. He has engaged in policy making and leadership in public roles, previously as Leader of Cambridge City Council, and as a member of the Liberal Democrats' Federal Policy Committee.\nPolitical career\nHowarth was a Councillor on Cambridge City Council from 1987 to 2004, representing the city's Castle Ward. He was elected Leader of the Liberal Democrat group on Cambridge City Council in 1990 when it was in third place, and then leading it to become the principal opposition on the council, eventually becoming Leader of the Council in 2000. He continued as Leader until 2003, stepping down to concentrate on winning the Cambridge parliamentary seat. He stood unsuccessfully for Parliament in Cambridge in 1992 and 2001, and in the nearby seat of Peterborough in 1997. In the 2005 general election he was elected Member of Parliament for Cambridge, defeating Labour MP Anne Campbell, overturning a majority of 8,579, and winning with a majority of 4,339 votes (securing 44% of the votes cast). He was the first Liberal or Liberal Democrat to win Cambridge since the 1906 general election.\nHis work as a legislator has informed his research interests, and he has subsequently published on the legislative process (specifically the Backbench Business Committee), conducted empirical research 'The Reality of the Constitution'. Highlights of his legislative scrutiny included work on the Companies Bill; highlighting the problems with the Legislative and Regulatory Reform Bill; the Constitutional Reform and Governance Bill; and various Criminal Justice Bills. Howarth also was successively Shadow Minister for Local Government (2005-6); Shadow Minister for Energy (2006-7); Shadow Solicitor General (2007-9); and Shadow Secretary of State for Justice (2009–10). He served on the Constitutional Affairs, Justice and Environmental Audit Select Committees.\nIn 2008 Howarth criticised Home Office minister Vernon Coaker's defence of the policing of the Camp for Climate Action at Kingsnorth power station, which was widely criticised as disproportionate, and called on the government and police to end the practice of likening environmental protesters to terrorists.\nHe was one of the relatively few MPs not implicated in the 2009 expenses scandal, being singled out by The Guardian as one of the \"Angels\" for having \"not claimed a penny in second home allowances\" and commuting the 60 miles from Cambridge to Westminster.\nOn 5 November 2009, he announced that he would be standing down as MP for Cambridge at the next election, citing a desire to return to academia, which he did after the General Election of May 2010. He was subsequently reinstated in his old job, as a Reader in Law and Land Economy at Cambridge University. In 2014, he became a director of the RAND Corporation's European subsidiary.\nHe served as the Liberal Democrat nominee as an Electoral Commissioner, for two four year terms between October 2010 and October 2018.\nPersonal life\nDavid Howarth has two children and is married to Edna Howarth. Edna Howarth is a magistrate in Cambridge Magistrates' Court.\nReferences\nExternal links\n* * [https://web.archive.org/web/20080929214510/http://www.libdems.org.uk/people/david-howarth David Howarth MP] official Liberal Democrats profile\n*"
    }
  ]
}