{
  "content": [
    {
      "type": "text",
      "text": "# David Smith (historian)\n\n]]\nDavid L. Smith (born 3 December 1963 in London) is a noted historian at Selwyn College, Cambridge. He specializes in Early Modern British history, particularly political, constitutional, legal and religious history within the Stuart period.  He is the author or co-author of eight books, and the editor or co-editor of seven others, and he has also published more than seventy essays and articles (see list of chief publications below).\nEarly life\nSmith was educated at Eastbourne College (1972–81) and then went up to Selwyn College, Cambridge, as a Scholar in October 1982.  At Selwyn he took Firsts in both Parts of the Historical Tripos, with Distinction in Part I, and graduated in 1985.  He then gained his PGCE with Distinction in 1986, and was awarded the Charles Fox Prize for the best performance in the Cambridge PGCE that year.  He went on to take his MA in 1989 and his PhD in 1990.\nCareer\nIn 1991 he won the Royal Historical Society's Alexander Prize, and Cambridge University's Thirlwall Prize for historical research.\nHe has been a Fellow of Selwyn College since 1988, and he became a College Associate Professor in 2024.  He has served as a Director of Studies in History since 1992 and a Postgraduate Tutor since 2004.  He has also held several other offices within the College, including Admissions Tutor (1992-2003), Praelector (1994-2006), and Secretary to the College Council and Governing Body (2018–20).\nHe began teaching in the Faculty of History at Cambridge in 1990 and he has been an Affiliated Lecturer in the Faculty since 1995.  He served as Convenor of the Directors of Studies in History from 2006 to 2010.  He also teaches regular weekend, day-school and summer school courses for Cambridge's Institute of Continuing Education.  He has taught on the Institute's annual History Summer Programme every year since 1993, and he was the Programme Director for fourteen years (2005-19).  He was a member of the Institute's Management Board from 2005 to 2008, and he was an Affiliated Lecturer of the Institute from 2012 to 2019.\nHe was an Associate Editor and Research Associate for the Oxford Dictionary of National Biography (Oxford University Press, 2004), to which he also contributed twenty-three articles.  From 1993 to 2003 he was co-editor of the Cambridge University Press A-level History series Cambridge Perspectives in History, in which thirty books were published.  More recently, he was co-editor of the Cambridge University Press series aimed at the AQA specifications for A-level History, in which eighteen books were published in 2015-16.  He was an Associate Editor of the Journal of British Studies from 2014 to 2017.\nHe was a visiting professor at the University of Chicago in 1991, and at Kyungpook National University, Daegu, South Korea, in 2004.  He served as an External Examiner for the University of Leicester (2007–10), and for the University of Hull (2012–17).  He was elected a Fellow of the Royal Historical Society in 1992, and he has been President of the Cambridge History Forum since 1997.\nOver the course of his career so far, in addition to teaching hundreds of undergraduates, he has also supervised over forty postgraduate students.  These include nine who successfully completed their Cambridge PhD dissertations under his supervision.\nHe has taught in schools as well as universities.  During his gap year in 1982, he spent two terms teaching at Framlingham College Prep School, and was Acting Head of History for the second term.  In 1986, he taught at Hinchingbrooke School, Huntingdon, for his Cambridge PGCE teaching practice term.  He was an A-level History Examiner for the Oxford and Cambridge Schools Examination Board from 1986 to 1990, and since 1988 he has given lectures in over a hundred schools and sixth-form colleges.\nHe served as a Governor of Eastbourne College (1993-2015) and also as a Trustee of Oakham School (2000–12).  He was a member of the Cambridgeshire Records Society Committee from 1998 to 2009.  He served on the Management Committee of the Cromwell Museum in Huntingdon from 2009 to 2015.  He was a Trustee of the Cromwell Association from 2012 to 2015, and in 2024 he was elected a Vice-President of the Association.\nChief publications\n* Oliver Cromwell: Politics and Religion in the English Revolution, 1640–1658 (Cambridge University Press, 1991)\n* Louis XIV (Cambridge University Press, 1992)\n* Constitutional Royalism and the Search for Settlement, c. 1640–1649 (Cambridge University Press, 1994)\n* (co-edited with Richard Strier and David Bevington) The Theatrical City: Culture, Theatre and Politics in London, 1576–1649 (Cambridge University Press, 1995)\n* A History of the Modern British Isles, 1603–1707: The Double Crown (Blackwell, 1998)\n* The Stuart Parliaments, 1603–1689 (Edward Arnold, 1999)\n* (with Graham E. Seel) The Early Stuart Kings, 1603–1642 (Routledge, 2001)\n* (with Graham E. Seel) Crown and Parliaments, 1558–1689 (Cambridge University Press, 2001)\n* (edited) Cromwell and the Interregnum (Blackwell, 2003)\n* Twenty-three articles in the Oxford Dictionary of National Biography (Oxford University Press, 2004)\n* (co-edited with Jason McElligott) Royalists and Royalism during the English Civil Wars (Cambridge University Press, 2007)\n* (with Patrick Little) Parliaments and Politics during the Cromwellian Protectorate (Cambridge University Press, 2007)\n* (co-edited with Jason McElligott) Royalists and Royalism during the Interregnum (Manchester University Press, 2010)\n* (co-edited with Michael J. Braddick) The Experience of Revolution in Stuart Britain and Ireland: Essays for John Morrill (Cambridge University Press, 2011)\n* Two articles in The Oxford Handbook of the English Revolution, ed. Michael J. Braddick (Oxford University Press, 2015)\n* (co-edited with Thomas S. Freeman) Biography and History in Film (Palgrave Macmillan, 2019)\n* (co-edited with Joel Halcomb and Patrick Little; general editor John Morrill) The Letters, Writings, and Speeches of Oliver Cromwell, Volume 3: 16 December 1653 to 2 September 1658 (Oxford University Press, 2022)\nVideos and podcasts\nFour on-line lecture courses for Massolit (https://massolit.io/lecturers/80) on:\n* The reign of James I, 1567-1625\n* The reign of Charles I, 1625-49\n* Oliver Cromwell: Lord Protector, 1653-58\n* Charles II, James II and the Glorious Revolution, 1660-88\nThree on-line lecture podcasts for The World Turned Upside Down (https://www.worldturnedupsidedown.co.uk/) on Oliver Cromwell\nTwo on-line lectures on Oliver Cromwell delivered at Selwyn College can be viewed at\nhttps://www.youtube.com/watch?v=3wS-0kGA8zo\nand at\nhttps://www.youtube.com/watch?v=AGGovKfyaG4\nAn on-line lecture on 'Oliver Cromwell on Screen', delivered for the Cromwell Museum in Huntingdon, can be viewed at\nhttps://www.youtube.com/watch?v=9bXQL95Z5tU\nReferences"
    }
  ]
}