{
  "content": [
    {
      "type": "text",
      "text": "# David S. King\n\n| birth_place  = Salt Lake City, Utah, United States\n| death_date   =\n| death_place  = Kensington, Maryland, United States\n| state           = Utah\n| district        = 2nd\n| term_start1     = January 3, 1965\n| term_end1       = January 3, 1967\n| preceded1       = Sherman P. Lloyd\n| succeeded1      = Sherman P. Lloyd\n| term_start2     = January 3, 1959\n| term_end2       = January 3, 1963\n| preceded2       = William A. Dawson\n| succeeded2      = Sherman P. Lloyd\n| office3         = United States Ambassador to Madagascar\n| term_start3     = January 26, 1967\n| term_end3       = August 16, 1969\n| predecessor3    = C. Vaughan Ferguson, Jr.\n| successor3      = Anthony D. Marshall\n| president3      = Lyndon B. JohnsonRichard M. Nixon\n| office4         = United States Ambassador to Mauritius\n| term_start4     = July 29, 1968\n| term_end4       = August 16, 1969\n| predecessor4    = William B. Hussey\n| successor4      = William D. Brewer\n| president4      = Lyndon B. JohnsonRichard M. Nixon\n| party           = Democratic\n| occupation      = Lawyer\n| education       = University of UtahGeorgetown University Law School\n| spouse          = Rosalie King\n| children        = 8, including Jody\n}}\nDavid Sjodahl King (June 20, 1917 &ndash; May 5, 2009) was an American attorney who served as a representative from Utah. He served three terms between 1959 and 1967.\nHe was a member of the Democratic Party.\nEarly life and education\nKing was born in Salt Lake City, Utah, in 1917. He graduated from the University of Utah in 1937.  From 1937 to 1939, he served as a missionary for the Church of Jesus Christ of Latter-day Saints (LDS Church) in Great Britain.  After his mission, King attended and graduated from Georgetown University Law School.  After serving as a clerk for Justice Howard M. Stephens of the United States Court of Appeals for the District of Columbia in 1943, King returned to Utah.\nLegal and political career\nKing served as counsel to the Utah Tax Commission from 1944 to 1946.  He also was involved in private practice from 1945.  From 1946 to 1958, he taught commercial law at Intermountain Business College. From 1948 to 1958, King was the second assistant to Elbert R. Curtis, who was the ninth General Superintendent of the LDS Church's Young Men's Mutual Improvement Association.\nKing was elected as a Democrat to the 86th and 87th United States Congresses between January 3, 1959 and January 3, 1963. He was not a candidate for renomination in 1962, choosing instead to run for a seat in the United States Senate. His senatorial campaign was unsuccessful. King was elected to the 89th Congress in 1964, but was defeated in his bid for reelection in 1966. He was appointed United States Ambassador to Madagascar and to Mauritius in January 1967 and in May 1968, respectively, serving in those two positions concurrently until August 1969.\nDuring the 1970s and 1980s, King practiced law in Washington, D.C., and served as an alternate director at the World Bank.  He retired in 1986 to devote his time to serving the LDS Church.\nLDS Church service\nFrom July 1986 to June 1989, he served as president of the church's Haiti Port-au-Prince Mission.  From September 1990 to 1993 he was president of the Washington D.C. Temple in Kensington, Maryland. In 1994, he was called as patriarch of the Washington D.C. Stake and the church's district for the District of Columbia.\nFamily life\nKing was a resident of Kensington, Maryland where he lived with his wife of 61 years, Rosalie King.  They were the parents of eight children, including Josephine \"Jody\" Olsen who became Director of the Peace Corps in 2018. His father, William H. King, was a Senator from Utah. He was preceded in death by his sons David King, Jr., and Elliott West King. David King died on May 5, 2009.\nGenealogy\nKing was a direct patrilineal descendant of Edmund Rice, an English immigrant to Massachusetts Bay Colony, as follows:\n:*David Sjodahl King, son of\n::* William Henry King, (1863 &ndash; 1949), son of\n::* William King (1834 &ndash; 1892), son of\n::* Thomas Rice King (1813 &ndash; 1879), son of\n:* Thomas King (1770 &ndash; 1845), son of\n:* William King (1724 &ndash; 1793), son of\n::* Ezra Rice King (1697 &ndash; 1746), son of\n:::* Samuel Rice King (1667 &ndash; 1713), son of\n::::* Samuel Rice (1634 &ndash; 1684), son of\n:::::* Edmund Rice (1594 &ndash; 1663)\nPublished works\n*\nSee also\n* Janne M. Sjödahl: maternal grandfather\nReferences\nFurther reading\n* (1994) [https://web.archive.org/web/20221103115801/https://www.uen.org/utah_history_encyclopedia/k/KING_DAVID.shtml \"King, David Sjodahl\"] article in the [https://www.uen.org/utah_history_encyclopedia/ Utah History Encyclopedia.] The article was written by Doris F. Salmon and the Encyclopedia was published by the University of Utah Press. ISBN 9780874804256. Archived from [https://www.uen.org/utah_history_encyclopedia/k/KING_DAVID.shtml the original] on November 3, 2022 and retrieved on June 12, 2024.\nExternal links\n*[http://archives.lib.byu.edu/agents/people/2641 Materials relating to David S. King] at L. Tom Perry Special Collections, Harold B. Lee Library, Brigham Young University"
    }
  ]
}