{
  "content": [
    {
      "type": "text",
      "text": "# David Woodward (cartographer)\n\nDavid Woodward (29 August 1942 &ndash; 25 August 2004) was an English-born American historian of cartography and cartographer.\nBiography\nWoodward was born in Royal Leamington Spa, England. After receiving a bachelor's degree from the Swansea University (then the University of Wales at Swansea), he moved to the United States to study cartography under Arthur H. Robinson at the University of Wisconsin–Madison. He earned a doctorate in geography in 1970.\nWoodward spent the next Eleven (11) years at the Newberry Library in Chicago as cartographic specialist and curator of maps. He served as director of the library's Hermon Dunlap Smith Center for the History of Cartography from 1974 to 1980.\nIn 1980, Woodward returned to University of Wisconsin–Madison as a member of the faculty; he was named Arthur H. Robinson Professor of Geography in 1995. Woodward was a part of the university's cartography department until he retired from teaching in August 2002 to dedicate more of his time to research, editing, and outreach.\nWoodward became an American citizen in 1976.\nHistory of Cartography Project\nDuring a 1977 walk through the countryside in Exeter, England, Woodward and J. Brian Harley, a professor at the University of Wisconsin–Milwaukee, developed the idea for what became the History of Cartography Project. They envisioned an ambitious multi-volume reference work that would examine the social production and consumption of maps across cultures from prehistoric origins to the 20th century. Harley died in 1991, but Woodward completed the work. These volumes are now the benchmark for students and academics in the field. James R. Akerman, Woodward's successor at the Newberry Library, has stated that Woodward's contributions to the field of cartography history are so substantial that they \"defy attempts to summarize them\". Malcolm Lewis stated that Woodward \"transformed the history of cartography from a directionless Eurocentric field into a respectable subject now global in scope.\" [http://www.findarticles.com/p/articles/mi_qn4158/is_20040910/ai_n12798229]\nAwards and recognition\n* The published volumes of The History of Cartography has won many awards.\n* He was awarded a five-year senior membership at the UW Institute for Research in the Humanities\n* Woodward won the UW—Madison Hilldale award in the arts and humanities\n* He also received the College of Letters and Sciences Career Service Award.\nWoodward gave hundreds of public lectures, discussing and developing new ideas with others as well as disseminating his research. He was a prolific and well-regarded scholar; his individual research and editorial works were widely disseminated and highly acclaimed.\nIllness and death\nWoodward died of cancer on 25 August 2004, at his home in Madison. Woodward's mentor, Arthur H. Robinson, died several weeks later. He had appeared at Woodward's memorial service.\nPublications\nA full bibliography of Woodward's publications is provided in Matthew H. Edney, \"David Alfred Woodward (1942-2004),\" Imago Mundi: The International Journal for the History of Cartography 57.1 (2005): 75-83. A number of reminiscences about Woodward as a scholar and a teacher can also be found in a special issue of Cartographic Perspectives, no. 51 (Spring 2005), dedicated to Woodward and to his mentor, Arthur H. Robinson.\nHistory of Cartography\n* Harley, J. B., and David Woodward, eds. [http://www.press.uchicago.edu/books/HOC/index.html Cartography in Prehistoric, Ancient, and Medieval Europe and the Mediterranean]. Volume 1 of The History of Cartography. Chicago and London: University of Chicago Press, 1987. . Awarded Best Book in the Humanities (1987) from the Professional and Scholarly Publishing Division, Association of American Publishers.\n* Harley, J. B., and David Woodward, eds. [http://www.press.uchicago.edu/books/HOC/index.html  Cartography in the Traditional Islamic and South Asian Societies]. Volume 2, Book 1 of The History of Cartography. Chicago and London: University of Chicago Press, 1992. .\n* Harley, J. B., and David Woodward, eds. [http://www.press.uchicago.edu/books/HOC/index.html Cartography in the Traditional East and Southeast Asian Societies]. Volume 2, Book 2 of The History of Cartography. Chicago and London: University of Chicago Press, 1994. .\n* Woodward, David, and G. Malcolm Lewis, eds. [http://www.press.uchicago.edu/books/HOC/index.html  Cartography in the Traditional African, American, Arctic, Australian, and Pacific Societies]. Volume 2, Book 3 of The History of Cartography. Chicago and London: University of Chicago Press, 1998. .\n* Woodward, David, ed. [http://www.press.uchicago.edu/books/HOC/index.html Cartography in the European Renaissance]. Volume 3 of The History of Cartography. Chicago and London: University of Chicago Press, 2007.  (Set), 0-226-90733-3 (Part 1), 0-226-90734-1 (Part 2).\n* Edney, Matthew H., and Mary S. Pedley, eds. Cartography in the European Enlightenment Volume 4 of The History of Cartography. Chicago and London: University of Chicago Press, 2019.  (Set), 978-0-226-33922-1 (e-book), 978-0-226-18476-0 (Part 1), 978-0-226-18477-7 (Part 2).\n* Roger J. P. Kain, ed. Cartography in the Nineteenth Century. Volume 5 of The History of Cartography. Chicago and London: University of Chicago Press, in preparation.\n* Monmonier, Mark, ed. [http://www.press.uchicago.edu/ucp/books/book/chicago/H/bo4149962.html Cartography in the Twentieth Century]. Volume 6 of The History of Cartography. Chicago and London: University of Chicago Press, 2015.  (Cloth Set),  (E-book).\nOther works\n* [editor] Five Centuries of Map Printing. Chicago: University of Chicago Press, 1975.\n* The All-American Map: Wax-Engraving and Its Influence on Cartography. Chicago: University of Chicago Press, 1977.\n* [editor] Art and Cartography: Six Historical Essays. Chicago: University of Chicago Press, 1987.\n* Catalogue of Watermarks in Italian Maps, ca. 1540-1600. Florence: Leo S. Olschki, 1996.\n* Maps as Prints in the Italian Renaissance: Makers, Distributors & Consumers. The 1995 Panizzi Lectures. London: British Library, 1996.\n* Cultural Map of Wisconsin: A Cartographic Portrait of the State. Madison: University of Wisconsin Press, 1996. With Robert C. Ostergren, Onno Brouwer, Steven Hoelscher, and Joshua G. Hane.\n* Approaches and Challenges in a Worldwide History of Cartography. Barcelona: Institut Cartogràfic de Catalunya, 2001. With Catherine Delano Smith and Cordell Yee.\nReferences\nExternal links\n* [http://www.geography.wisc.edu/histcart/ David Woodward, Brian Harley, and the History of Cartography Project]\n* [http://www.geography.wisc.edu/histcart/#DW Obituary at the History of Cartography Project]\n* [https://www.nytimes.com/1987/09/20/books/when-the-world-was-flat.html New York Times Article When the World Was Flat, by John Noble Wilford]\n* [http://www.findarticles.com/p/articles/mi_qn4158/is_20040910/ai_n12798229 The London Independent: Obituary]\n* [http://www.geography.wisc.edu/histcart/#fellow David Woodward Memorial Fellowship]\n* [http://www.markmonmonier.com/work7.htm Exploratory Essays]\n* [https://web.archive.org/web/20060903052123/http://www.fas.harvard.edu/~atlantic/biblographies/cartography/woodward.html A Bibliography for Research]\n* [http://www.newberry.org/collections/conbib.html The Newberry Library]"
    }
  ]
}