{
  "content": [
    {
      "type": "text",
      "text": "# David Brody (historian)\n\nDavid Brody (born June 5, 1930) is an American historian, who is professor emeritus of history at the University of California-Davis.\nLife and education\nBrody was born in Elizabeth, New Jersey, his parents had immigrated to the United States. Working his way through Harvard University, he received his bachelor's degree in 1952, a master's degree in 1953 and Ph.D. in history in 1958. His dissertation director was Oscar Handlin.\nAs Brody explains, he did not intend to become a labor historian:\nResearch focus\nBrody's research focuses on the American labor movement and American history. Along with David Montgomery and Herbert Gutman, he is credited with founding the field of \"new labor history\" in North America, which examined working-class culture rather than simply workers' organizations as a source of history.\nBrody's most coherent statement of the \"new labor history\" can be found in his article titled \"The Old Labor History and the New: In Search of an American Working Class\" (Labor History, 20: 111–26).\nBrody rose to prominence following the 1960 publication of his pioneering history of early steelworker unions, The Steelworkers in America: The Nonunion Era, a book based on his doctoral dissertation. He has written numerous articles and book-length treatments of the ethical, organizational and social construction of work and employment.\nIn the 21st century, Brody has focused on the origins and transformation of American labor law, labor law reform and weaknesses in the structure and interpretation of the National Labor Relations Act.\nBrody is Professor Emeritus at the University of California, Davis, where he taught for many years. He is affiliated with the Institute of Industrial Relations (IIR) at the University of California, Berkeley.\nMemberships and awards\nBrody is a member of the Society of American Historians and the American Historical Association.  He served as president of the Pacific Coast branch of the American Historical Association from 1991 to 1992. He is also a member of the Organization of American Historians, and served on the group's executive board from 1976 to 1979.\nBrody was a senior fellow for the National Endowment for the Humanities in 1978. He won a Guggenheim Memorial Foundation fellowship in 1983, and was appointed as a senior professor in the Fulbright Program in 1975.  In 2008 he won the Sol Stetin Award for Labor History from the Sidney Hillman Foundation and a Distinguished Service to Labor and Working-Class History Award from the Labor and Working-Class History Association.\nBrody is a member of Local 3 (San Francisco Chapter) of the National Writers Union, Local 1981, United Auto Workers, AFL-CIO.\nBooks by David Brody\nSole author\n* Steelworkers in America: The Nonunion Era. Cambridge, Mass.: Harvard University Press, 1960; Illini Book edition. Urbana, Ill.: University of Illinois Press, 1998.\n* The Butcher Workmen: A Study of Unionization. Cambridge, Mass.: Harvard University Press, 1964.\n* Labor in Crisis: The Steel Strike of 1919. Philadelphia: J.B. Lippincott, 1965; Urbana, Ill.: University of Illinois Press, 1987.\n* Essays on the Age of Enterprise: 1870-1900. Ft. Worth: Dryden Press, 1974.\n* The American Labor Movement. Reprint ed. Lanham, Md.: University Press of America, 1985.\n* ''In Labor's Cause: Main Themes on the History of the American Worker. New York: Oxford University Press USA, 1993.\n* Workers in Industrial America: Essays on the Twentieth-Century Struggle. 2nd ed. New York: Oxford University Press USA, 1993.\n* Labor Embattled: History, Power, Rights.  Urbana, Ill.: University of Illinois Press, 2005. Cloth ; Paperback\nCo-written works\n* Henretta, James A.; Brody, David; and Dumenil, Lynn. America: A Concise History. Volume 2: Since 1865.'' 5th ed. New York: Bedford/St. Martin's, 2005.\n* Henretta, James A.; Brody, David; Dumenil, Lynn; and Ware, Susan. ''America's History. Volume I: To 1877.'' 5th ed. New York: Bedford/St. Martin's, 2003.\nImportant articles\n* \"Labor History, Industrial Relations, and the Crisis of American Labor.\" Industrial and Labor Relations Review. 43(1989): 8.[https://digitalcommons.ilr.cornell.edu/ilrreview/]\n* \"The Old Labor History and the New: In Search of an American Working Class.\" Labor History. 20(1979): 111–26.[http://www.tandf.co.uk/journals/titles/0023656X.asp]\nSee also\n* Labor history (discipline)\nReferences\n*''Who's Who in America.'' 58th ed. New Providence, NJ: Marquis Who's Who, 2004."
    }
  ]
}