{
  "content": [
    {
      "type": "text",
      "text": "# David Farragut Edwards\n\n| birth_date = c. 1872\n| birth_place = Jersey City, New Jersey, U.S.\n| death_date = December 6, 1930 (aged 58)\n| death_place = Spring Lake, New Jersey, U.S.\n| alma_mater =\n| player_years1 = 1894–1895\n| player_team1 = Princeton\n| player_positions = Fullback\n| coach_years1 = 1897\n| coach_team1 = Ohio State\n| coach_years2 = 1898\n| coach_team2 = Texas\n| overall_record = 6–8–1\n| bowl_record =\n| tournament_record =\n| championships =\n| awards =\n| coaching_records =\n}}\nDavid Farragut Edwards ( – December 6, 1930) was an American college football player and coach, and a lawyer. He served for one season each at Ohio State University (1897) and the University of Texas at Austin (1898), compiling a career record of 6–8–1. Before coaching, Edwards played football at Princeton University. After his coaching career, he practiced law in his home state of New Jersey, and from 1914 to 1930 he held the office of New Jersey Supervisor of Inheritance Taxes.\nEarly life and family\nEdwards was born in Jersey City, New Jersey. His older brother, Edward I. Edwards, served as Governor of New Jersey from 1920 to 1923 and in the United States Senate from 1923 to 1929.\nCoaching career\nIn 1897, at Ohio State, Edwards had a 1–7–1 record, the worst in the history of the program. He was the first Ohio State Buckeyes football coach to face Michigan. In 1898, Edwards took over at Texas and had a 5–1 record that season. While at Texas, he unsuccessfully attempted to change the school colors from orange and white to orange and maroon.\nLater life\nFollowing the 1898 season, Edwards returned to New Jersey, where he was admitted to the bar in 1901, and practiced law in Jersey City. He served as New Jersey Supervisor of Inheritance Taxes from 1914 until his death in 1930. Edwards died at the age of 58, on December 7, 1930, of \"acute indigestion\" in at his home in Spring Lake, New Jersey.\nHead coaching record\nReferences\nExternal links\n*"
    }
  ]
}