{
  "content": [
    {
      "type": "text",
      "text": "# David Crawford (historian)\n\nDavid Crawford (or Crawfurd or Craufurd) (1665–1726), of Drumsoy, was a Scottish Historiographer Royal.\nLife and death\nCrawford was the son of David Crawford of Drumsoy. He was educated at the University of Glasgow and called to the bar.\nHe was appointed Historiographer for Scotland by Queen Anne.\nCrawford died in 1726, leaving an only daughter and heiress, Emilia, who died unmarried in 1731.\nWorks\nIn 1706 Crawford published his Memoirs of the Affairs of Scotland, containing a full and impartial account of the Revolution in that Kingdom begun in 1567. Faithfully published from an authentic manuscript. The manuscript was, he said, presented him by Sir James Baird of Saughton Hall, who purchased it from the widow of an episcopal clergyman. The memoirs were dedicated to the Earl of Glasgow, and the stated aim in publishing them was to provide an antidote to George Buchanan's History. On 27 July 1706, Crawford wrote to George Mackenzie, 1st Earl of Cromartie, describing his appointment and controversy over the memoirs. He wrote \"the title of historiographer is a terrible eyesore to some folks.\"\nFor more than a century, Crawford's work was taken as a genuine unedited transcript of the manuscript, and relied on by David Hume, William Robertson and other historians. In 1804, Malcolm Laing published The Historie and Life of King James the Sext as contained in the Belhaven manuscript, a prototype of Crawford's Memoirs. Laing asserted that the memoirs of Crawford were akin to a forgery. Passages unfavourable to Mary, Queen of Scots, had been omitted, and statements taken from the published works of William Camden, John Spottiswood, James Melville of Halhill and others added. Another version of the original text, the Newbattle manuscript of the Historie of James the Sext, in the possession of the Marquis of Lothian, was published by the Bannatyne Club in 1825.\nCrawford was also the author of three novels and two dramas:  His works include:\n* Courtship-a-la-mode, a comedy, 1700.\n* Ovidius Britannicus, or Love Epistles in imitation of Ovid, 1703.\n* Love at First Sight, a comedy, 1704.\nSee also\n* Marian civil war, the subject of Memoirs of the Affairs of Scotland.\nNotes\n;Attribution"
    }
  ]
}