{
  "content": [
    {
      "type": "text",
      "text": "# Daviesia schwarzenegger\n\n|synonyms_ref =\n|synonyms =\n}}\nDaviesia schwarzenegger is a species of flowering plant in the family Fabaceae and is endemic to south-eastern continental Australia. It is a dense, mounded shrub with sharply-pointed phyllodes and yellow and dark red flowers, and resembles Daviesia devito apart from its more robust growth habit and the surface of its dried foliage.\nDescription\nDaviesia schwarzenegger is a dense, mounded shrub that typically grows up to  high and  wide, has glabrous foliage and forms root suckers. Its leaves are reduced to scattered, sharply-pointed, cylindrical phyllodes  long  and  wide at the base. The branchlets and phyllodes are ribbed when dry, unlike those of D. devito that are wrinkled. The flowers are arranged in racemes of two to four on a rachis  long, each flower on a pedicel about  long with overlapping bracts at the base. The sepals are joined, forming a bell-shaped base and the standard is yellow to red with a yellowish green centre,  long and about  wide. The wings are dark red with orange tips, about  long and the keel is dark red and about  long. Flowering occurs in September and October and the fruit is a broadly triangular pod  long.\nTaxonomy and naming\nIn 1982, Michael Crisp described Daviesia benthamii subsp. humilis in the Journal of the Adelaide Botanic Gardens, but in 2017, he and others divided that subspecies into two new species, D. schwarzenegger and D. devito in the journal Phytotaxa. The specific epithets (devito and schwarzenegger) are references to Danny DeVito and Arnold Schwarzenegger, the main actors in the Universal Studios 1988 film Twins, D. devito being the less vigorous of the two. The authors also acknowledged Schwarzenegger's \"pioneering the reduction of carbon emissions and for advising the Australian government to do the same\".\nDistribution and habitat\nDaviesia schwarzenegger grows in mallee and woodland in scattered populations from the Eyre Peninsula in South Australia, to the area between Charlton and Rushworth in Victoria, and to near Condobolin in New South Wales.\nReferences"
    }
  ]
}