{
  "content": [
    {
      "type": "text",
      "text": "# David Ward (sheriff)\n\n|constituency=Harney County\n|predecessor=David Glerup\n|successor=Dan Jenkins\n|birth_name=\n|birth_date=\n|birth_place=Drain, Oregon, U.S.\n|death_date=\n|death_place=\n|profession=Politician\n|website=\n}}\nDavid M. \"Dave\" Ward was the sheriff of Harney County, Oregon, from 2015 until 2020. This included during the time of the Occupation of the Malheur National Wildlife Refuge in 2016.\nEarly life\nWard was born in Drain, Oregon, to Jim, the son of a military veteran, and Linda Ward. In high school, he wrestled and played football. After graduation, he enlisted in the United States Army, where he served as a combat medic. He was deployed to Somalia, as part of Operation Restore Hope, and Afghanistan. While serving as a machine gunner in Afghanistan, he also trained more than 1,500 Afghan soldiers, and created a literacy program and a bank for them.\nWard left the Army in 1994 and pursued a variety of jobs ranging from ranch hand to mill worker. During this time, he served in the Oregon National Guard. He returned to active service in 1998 and left the Army a second time in 2002.\nFollowing his second separation from military service, Ward worked as a corrections officer in Lake County, Oregon from 2002 to 2007. He later went to work for the Harney County Sheriff's Office as a sheriff's deputy. He had been the top cadet in his class at the Oregon Public Safety Academy, earning awards for marksmanship and understanding defensive tactics.\nCounty sheriff\nWard was appointed sheriff of Harney County by the Harney County Court on December 5, 2014, and was sworn into office on January 2, 2015. His appointment was to fill the unexpired term of retiring sheriff David Glerup. The next election for sheriff of Harney County will take place in November 2016; Ward has announced he will stand in that vote. On September 4, 2019, he resigned from the position, effective January 2, 2020.\nRefuge occupation\nWard was serving as the Harney County sheriff in January 2016 when a loosely organized militia group occupied the Malheur National Wildlife Refuge. The occupation was covered by national news media. Ward worked with the Federal Bureau of Investigation and the Oregon State Police to maintain order and protect local citizens during the occupation.\nDuring the standoff, the Los Angeles Times described Ward's evolving public relations savvy, noting that he began \"holding events intended to draw media attention, manipulating the twitchy-fingered amplifier of social media and encouraging his supporters to speak up.\" At one point during negotiations, Ward did not encourage armed militants to remove their firearms, which attracted criticism from Harney County Judge Steve Grasty.\nThere were a number of altercations between the sheriff and Harney County deputies and the militants for weeks before the occupation began. Ward said that one of the militants, Blaine Cooper, had followed his family when they went Christmas shopping, but militant Ryan Payne reported that Ward's mother had threatened him. Altercations also occurred during the course of the occupation: the tires of Ward's wife's vehicle were found slashed, forcing her to temporarily go into hiding; and Ward's parents were followed by militants while leaving Ward's daughter's Christmas play.\nFollowing the arrest of the final militant on February 11, 2016, Ward said that he was proud of his community. He also encouraged residents, who he noticed were divided by the political rhetoric of the militants, to express their issues to one another rather than staying silent.\nDuring and after the occupation, several media outlets wrote op-eds praising Ward's handling of the incident.\nOn September 14, Ward was the first to testify against the militants.\nReferences"
    }
  ]
}