{
  "content": [
    {
      "type": "text",
      "text": "# David Duke 1992 presidential campaign\n\n| affiliation  = Republican Party\n| status       =\n| formed       =\n| announced    =\n| launched     =\n| suspended    =\n| headquarters =\n| key_people   = Howie Farrell (campaign director)\n| receipts     = }}\n| fec_date     = 1992-12-31\n| slogan       =\n| themesong    =\n| chant        =\n| website      =\n}}\nThe 1992 presidential campaign of David Duke, a member of the Louisiana House of Representatives who had unsuccessfully sought the Democratic presidential nomination in 1980 presidential election and 1988 presidential election, was formally launched on December 4, 1991, as Duke announced his intention to seek the Republican Party nomination for the presidency of the United States in the 1992 presidential election.\nBackground\nDavid Duke became the Grand Wizard of the Knights of the Ku Klux Klan in 1974 and held the position until 1980. He ran for a seat in the Louisiana State Senate in 1975 and 1979, but lost both times. He left the Ku Klux Klan in 1980, after he was accused of trying to sell the organization's mailing list for $35,000. He founded the National Association for the Advancement of White People and served as its president after leaving the Klan.\nHe ran for the Democratic presidential nomination during the 1980 presidential election. Despite being six years too young to be qualified to run for president Duke attempted to place his name onto the ballot in twelve states stating that he wanted to be a power broker who could \"select issues and form a platform representing the majority of this country\" at the Democratic National Convention. On June 8, 1987, Duke announced that he would run for the Democratic nomination for president and appeared on the ballot in a few states. He later won the presidential nomination of the Populist Party and took 47,047 votes for 0.05% of the popular vote in the general election.\nOn December 5, 1988, Duke changed his political affiliation to Republican and ran in a special election for a seat in the Louisiana House of Representatives, which he won on February 18, 1989. Duke later ran for United States Senate as a Republican in 1990, and for Governor of Louisiana in 1991.\nCampaign\nAnnouncement\nDuke initially planned to announce his presidential campaign on December 2, 1991, but postponed the announcement. Duke announced at the National Press Club conference room in Washington, D.C. on December 4, that he would seek the presidential nomination of the Republican Party against incumbent President George H. W. Bush, who he criticized for signing the Civil Rights Act of 1991. He planned to use his primary campaign to launch an independent third-party campaign in the general election.\nClayton Yeutter, the chair of the Republican National Committee, stated that Duke was a \"full-time con man\" who would not win the Republican nomination and that he couldn't \"see any likelihood that he will garner any significant support\". Billy Nungesser, the chair of the Republican Party of Louisiana, stated that \"George Bush is going to be elected president. Nothing David Duke or the Democrats or anybody else does will stop that. We're going to re-elect George Bush and he's going to carry this state again\" and that the media had created Duke. Mississippi Governor Kirk Fordice stated that Duke was \"total unacceptable\", was \"not going anywhere\", and that he was not a real Republican. Evelyn McPhail, the chair of the Mississippi Republican Party, stated that Bush would easily defeat Duke.\nRepublican primaries\nDuke attempted to place his name onto the primary ballot in Illinois, but the Illinois State Board of Elections voted unanimously in favor of keeping Duke off the ballot as he had failed to collect enough signatures to gain ballot access. Dawn Larson, who had worked for Paul Simon's presidential campaign in 1988, helped Duke in his effort to get onto the Illinois ballot. Larson would later work for Ross Perot's presidential campaign and became chair of the Illinois Reform Party and later worked to help Perot's campaign get onto the Illinois ballot in 1996.\nThe executive committee of the Mississippi Republican Party voted to make its primary be winner-take all for the first time and McPhail stated the change was not in response to Duke's campaign. Secretary of the Commonwealth Michael J. Connolly and Leon Lombardi, the chair of the Massachusetts Republican Party, attempted to prevent Duke from appearing on the ballot in Massachusetts, but Connolly allowed him to appear on the ballot after a lawsuit was threatened. The list of candidates to appear on the primary ballot submitted by the Republican Party of Florida excluded Duke and every Republican member of the Florida Senate signed a petition criticizing Duke's \"divisive positions\".\nDuke was barred from appearing on the primary ballot in Rhode Island due to his candidacy not being discussed by major news outlets. The American Civil Liberties Union filed a lawsuit on January 7, 1992, and won in Duke v. Connell, 790 F. Supp. 50 with the judge stating that the election laws were too vague. He filed lawsuits to appear on the ballot in Florida and Georgia, but lost.\nDuke was undecided over whether or not to enter the primary in Pennsylvania.\nDuke debated future Wisconsin Governor Scott Walker on television over whether or not Duke should be allowed on the Wisconsin presidential primary ballot.\nDuke threatened to run as an independent during the primary. On April 22, 1992, Duke ended his presidential campaign and stated that he would not continue his campaign in the general election as an independent or third-party candidate stating that \"Perot's candidacy would preclude other third-party candidacies\". Claiborne Darden, an Atlanta pollster, stated that \"there is no question that Duke would have done better if Buchanan had not gotten into the race,\" and Duke stated that \"the publicity went to Buchanan\". At the time Duke ended his campaign he had around $60,000 in debt.\nDespite having dropped out Duke received 6,667 votes, worth 2.19% of the popular vote, in the Republican primary in Oregon which caused The Oregonian editorial board to write an editorial entitled \"Duke vote a disgrace\" where the editorial board criticized the large number of votes for Duke and how Oregon still needed to combat racism.\nDuke received 119,115 (0.94%) votes in the primaries, but no delegates to the 1992 Republican National Convention.\nAftermath\nDuring the 1996 presidential election Buchanan sought the Republican nomination. William Carter, who served as the chair of Duke's campaign in South Carolina in 1992, served on Buchanan's South Carolina steering committee until his removal in February 1996. Buchanan stated that he didn't \"want anybody in our campaign who's associated with any organization today that is racist or has any ties to these groups which I find deeply offensive\". Duke supported Buchanan during the 1996 campaign and attempted to welcome Buchanan at a campaign rally in Metairie, Louisiana, but Buchanan rejected Duke's support stating that \"He supports me. I don't support him\" and that \"I eliminated David Duke as a serious national figure in the Republican Party. I'm proud of having done so and I'm not going to go back and check the resume of everyone who happens to wander into my campaign\". Sandy Lamb, who was the chair of Buchanan's campaign in a county in Florida, was also fired for being a member of the National Association for the Advancement of White People. Vincent Bruno, who served as an adviser to Duke's gubernatorial campaign in 1991, was elected as a delegate to the Republican National Convention. Bruno and two other Buchanan delegates from Louisiana had connections to Duke.\nCampaign finance\n{| class=\"wikitable\" style=\"font-size:90%;text-align:center;\"\n! rowspan=\"2\"| Candidate\n! colspan=\"8\"| Campaign committee\n|-\n! Raised\n!\n!\n!\n! Spent\n|-\n|\n| $372,146.00\n| $221,854.00\n| $221,945.00\n| $0.00\n| $457,449.00\n|}\nResults\nSource\n{|class=wikitable\n|+1992 Republican presidential primaries\n|-\n!State\n!Vote percentage\n!Votes\n!Result\n!Reference\n|-\n!Mississippi\n|}}\n|16,426\n|Lost\n|\n|-\n!Louisiana\n|}}\n|11,956\n|Lost\n|\n|-\n!South Carolina\n|}}\n|10,553\n|Lost\n|\n|-\n!Tennessee\n|}}\n|7,709\n|Lost\n|\n|-\n!Wisconsin\n|}}\n|12,867\n|Lost\n|\n|-\n!Oklahoma\n|}}\n|5,672\n|Lost\n|\n|-\n!Texas\n|}}\n|20,255\n|Lost\n|\n|-\n!Michigan\n|}}\n|10,688\n|Lost\n|\n|-\n!Connecticut\n|}}\n|2,294\n|Lost\n|\n|-\n!Oregon\n|}}\n|6,667\n|Lost\n|\n|-\n!Rhode Island\n|}}\n|326\n|Lost\n|\n|-\n!Massachusetts\n|}}\n|5,557\n|Lost\n|\n|-\n!Kansas\n|}}\n|3,837\n|Lost\n|\n|-\n!Nebraska\n|}}\n|2,808\n|Lost\n|\n|-\n!Washington\n|}}\n|1,501\n|Lost\n|\n|-\n!Puerto Rico\n|}}\n|827\n|Lost\n|\n|}\nSee also\n* David Duke 1988 presidential campaign\nReferences"
    }
  ]
}