{
  "content": [
    {
      "type": "text",
      "text": "# Dawkins Revolution__disambig_1\n\nThe Dawkins Revolution was a series of Australian higher education reforms instituted by the then Labor Education Minister (1987–91) John Dawkins. The reforms merged higher education providers, granted university status to a variety of institutions, instituted a system for income contingent loans to finance student fees, required a range of new performance monitoring techniques and methods, and revamped the relationship between universities and the Commonwealth Government. The reforms transitioned Australia's higher education system into a mass system which could produce more university educated workers, but have remained controversial due to their impacts on the incentives facing universities, bureaucracies and academics.\nThe reforms were proposed in Higher education: a policy discussion paper ('the green paper') which was published in December 1987 and announced in Higher education: a policy statement ('the white paper') published in July 1988. The reforms took place over several years; implementation of the HECS system began in 1989, and University of Ballarat (now Federation University), Southern Cross University and the University of the Sunshine Coast were the last round of universities to be created in this era, granted university status in 1994.\nAims and methods\nThe reforms were aimed at enhancing the \"quality, diversity and equity of access\" to education while improving the \"international competitiveness\" of Australian universities, as well as a solution for the perceived brain drain. These reforms included the introduction of income contingent loans for tuition costs through the HECS, the conversion of all Colleges of Advanced Education (CAEs) into universities, and a series of provisions for universities to provide plans, profiles, statistics etc. to justify courses and research.\nThese aims and methods drew heavily from New Public Management and an emerging neoliberalism that was present in other reforms of the Hawke Government, which was greatly concerned with economic productivity in an era of high unemployment and high inflation.\nOutcomes\nThe reforms succeeded in turning Australia's elite university system into a mass education system. As a result, undergraduate student numbers increased dramatically as universities were given economies of scale. There were also many mergers between universities and CAEs, with some successful such as how the former Queensland Agricultural College was made part of the University of Queensland. Others not so, for example the Northern Rivers CAE was incorporated into the University of New England in 1989, only to split acrimoniously in late 1993 and become Southern Cross University from 1 January 1994. Other mergers did not proceed, eg the (Australian National University and the Canberra CAE, now the University of Canberra). The introduction of HECS meant a significant new revenue stream for universities was unlocked without further relying on government grants and without introducing large financial barriers to study in the form of up-front student fees. Similarly, changes to research funding supported strong growth in research training places over the following decades.\nCriticisms\nThe Dawkins reforms have attracted criticism particularly from academic circles for what's viewed as the application of neoliberal ideology to universities. Common criticisms regarding the Dawkins reforms are that they were an attempt to reduce public funding of universities, 'commercialise' university education, and expose research to 'subjective' market pressures.\nOther critics allege that the reforms have led to a culture of \"corporate managerialism\" in universities, and that they have been related to a rise in bullying tactics among university management, a decline in the freedom of academic speech and inquiry, and a loss of academic collegiality.\nAmong the Dawkins reforms is the encouragement of the use of various metrics to assess and rate research output. These measures have been subjected to intense criticism. For example, the pressure placed on academics to seek external research grants, and be rated on their ability to do so, has been criticised on the basis that different fields of research require different levels of funding, and external grants may not even be necessary. University managements are accused of shifting the responsibility for acquiring funding onto academics. Academics are also critical of allegedly objective ratings of the \"quality\" of research output, often determined by looking at the \"impact factor\" of journals in which they publish (the 'impact factor' is the ratio of papers cited from a journal to papers published in that journal) - considered an inappropriate measure of research quality, as the impact factor of a journal is not necessarily related to the relevance of that journal to a given field.\nOther critics, especially those among the Group of Eight, saw these reforms as \"dumbing down\" higher education, as college diploma students became university graduates overnight. The traditional universities now had to compete for research funds with the newly designated and amalgamated universities, although they still continue to dominate competitive research funding.\nReferences"
    }
  ]
}