{
  "content": [
    {
      "type": "text",
      "text": "# Day of the German-speaking Community\n\nThe Day of the German-speaking Community is a holiday in Belgium celebrated on 15 November each year. It is a public holiday for the German-speaking Community of Belgium but it is not celebrated elsewhere in the country. The equivalents of the other communities are the Day of the Flemish Community (11 July) and the Day of the French-speaking Community (27 September). The ceremony coincides with the King's Feast.\nHistory\nThe German-speaking Community measures over 853&nbsp;km2 (329 sq miles) in the Belgian region of Wallonia, and is made up of two territories consisting of nine municipalities. This territory roughly covers the former Prussian districts (Kantone) of Eupen, Malmedy and Sankt Vith (Saint-Vith). The East Cantons (Ostkantone) were part of the Rhine Province of Prussia until 1920, but were annexed by Belgium following Germany's defeat in World War I and the subsequent Treaty of Versailles. Today Malmédy is not part of the German-speaking Community.\nIn 1989, there was a call for proposals for a flag and arms for the Community. In the end the coat of arms of the Community was designed by merging the arms of the Duchy of Limburg and the Duchy of Luxemburg, to which the two parts of the community belonged before Belgian independence.\nA decree adopted on 1 October 1990 and published on 15 November 1990 prescribed the arms, the flag, the colours and the Community day, which was to be celebrated on 15 November.\nHere is an English translation of the original version of the decree:\nArticle 1. The Day of the German-speaking Community shall be celebrated every year on 15 November.\nArticle 2. The German-speaking Community shall bear the following arms:\n* In silver a red lion together with nine blue cinquefoils, surmonted by a royal crown.\n* The flag of the German-speaking Community shall show on a white field a red lion together with nine blue cinquefoils.\n* The colours of the German-speaking Community shall be white and red in a horizontal arrangement.\nArticle 3. The flag of the German-speaking Community shall be hoisted on 15 November on the official buildings of the German-speaking area (Gebiet) of Belgium; outside this area, it shall be hoisted on the buildings which, because of their use, are ascribed to the German-speaking Community or are temporarily put at its disposal.\nIn the German-speaking area of Belgium, the flag shall be further hoisted on the administrative buildings under the same conditions and on the same days as the Belgian national flag.\nSource: [http://www.dglive.be/DesktopDefault.aspx/tabid-94/190_read-527/ Official website of the German-speaking Community]\nSee also\n* Public holidays in Belgium\n* German-speaking Community of Belgium\nReferences"
    }
  ]
}