{
  "content": [
    {
      "type": "text",
      "text": "# Daytime Emmy Award for Outstanding Younger Performer in a Drama Series\n\n| country          = United States\n| year             = 2020\n| year2            = 2023\n| related          = Replaced the gender-specific Younger Actor and Younger Actress categories\n| website          = [https://theemmys.tv/daytime/ theemmys.tv/daytime]\n| most_awards      =\n| most_nominations =Two (2) nominations each:\n}}\nThe Daytime Emmy Award for Outstanding Younger Performer in a Drama Series was an award presented annually by the National Academy of Television Arts and Sciences (NATAS) and the Academy of Television Arts & Sciences (ATAS). It was awarded annually from the 47th Daytime Emmy Awards in 2020 to the 50th Daytime Emmys in 2023. It was given to honor a young actress or actor who has delivered an outstanding performance in a role while working within the daytime drama industry.\nPrior to this category's introduction, the awards were distributed on the basis of gender, in the respective, Outstanding Younger Actor in a Drama Series and Outstanding Younger Actress in a Drama Series categories. An announcement was made to merge in October 2019, and introduce this current single, gender-neutral one. Reasons for such change, included that there are fewer daytime soap operas, thus fewer entrants as well as part as the continuous discussion and implementation of gender-inclusive categories at award competitions. In spite of that, only female-identifying actors earned a nomination in the category in the first year the award was merged.\nIt was announced that for the 48th Daytime Emmy Awards competition, it would be the final year in which the age 25 is the cut-off. It was then lowered that following year to 21, and lowered further to 18 for 2023. With the age being lowered to 18 for the 50th Daytime Emmy Awards, entrants were required to be \"no older than 18 on at least January 1, 2022\" in order to be eligible. Additionally, when the announcement was made for the 48th Daytime Emmy Awards, Younger Performer entrants were permitted to enter this category an infinite number of times while they are under 18, but once they turned 18, they were permitted to enter only three times before being moved to either the Lead or Supporting categories. Being age-qualified to enter for Younger Performer award does NOT mean an entrant is required to. Lead and Supporting acting categories are also open to performers under the age of 25. It is up to the discretion of the actor to determine which category they should be considered for.\nThe award was first presented to Olivia Rose Keegan, for her role as Claire Brady on Days of Our Lives.  As of the 2023 ceremony, Eden McCoy is the most recent winner in this category. Katelyn MacMullen, Alyvia Alyn Lind, Sydney Mikayla and Eden McCoy have the most nominations in this category, with a total of two.\nIn February 2024, it was announced that the Younger Performer award was being retired, and younger performers will now have to enter into the regular lead, supporting or guest acting categories.\nWinners and nominees\nListed below are the winners of the award for each year, as well as the other nominees.\n{| class=\"wikitable\"\n|+ Table key\n|-\n| style=\"background:#FAEB86; height:20px; width:20px\"|\n| Indicates the winner\n|}\n{| class=\"wikitable\" rowspan=\"2\" background: #f6e39c; style=\"text-align:center;\"\n|- style=\"background:#bebebe;\"\n!scope=\"col\" style=\"width:8%;\"| Year\n!scope=\"col\" style=\"width:30%;\"| Performer\n!scope=\"col\" style=\"width:30%;\"| Program\n!scope=\"col\" style=\"width:30%;\"| Role\n!scope=\"col\" style=\"width:10%;\"| Network\n!scope=\"col\" style=\"width:2%;\" class=\"unsortable\"|\n|-\n| colspan=6 data-sort-value=\"ω\" style=\"background-color:#CACCD0; font-weight:bold; padding-left:20%\"| 2020s\n|- style=\"background:#FAEB86\"\n! rowspan=\"5\" |2020(47th)\n| Olivia Rose Keegan\n| Days of Our Lives\n| Claire Brady\n|\n|}}\n|-\n| Sasha Calle\n| The Young and the Restless\n| Lola Rosales\n|\n|rowspan=4| }}\n|-\n| Katelyn MacMullen\n| General Hospital\n| Willow Tait\n|\n|-\n|Eden McCoy\n| General Hospital\n| Josslyn Jacks\n|\n|-\n| Thia Megia\n| Days of Our Lives\n| Haley Chen\n|\n|- style=\"background:#FAEB86\"\n! rowspan=\"5\" |2021(48th)\n| Victoria Konefal\n| Days of Our Lives\n| Ciara Brady\n|\n|}}\n|-\n| Tajh Bellow\n| General Hospital\n| TJ Ashford\n| ABC\n|rowspan=4| }}\n|-\n| Alyvia Alyn Lind\n| The Young and the Restless\n| Faith Newman\n|\n|-\n| Katelyn MacMullen\n| General Hospital\n| Willow Tait\n|\n|-\n| Sydney Mikayla\n| General Hospital\n| Trina Robinson\n|\n|- style=\"background:#FAEB86\"\n! rowspan=\"5\" |2022 (49th)\n| Nicholas Chavez\n| General Hospital\n| Spencer Cassadine\n| ABC\n|}}\n|-\n| Lindsay Arnold\n| Days of Our Lives\n| Allie Horton\n|\n| rowspan=\"4\" |}}\n|-\n| Alyvia Alyn Lind\n| The Young and the Restless\n| Faith Newman\n|\n|-\n| William Lipton\n| General Hospital\n| Cameron Webber\n| ABC\n|-\n| Sydney Mikayla\n| General Hospital\n| Trina Robinson\n|\n|-\n! rowspan=\"4\"|2023\n(50th) months before the designated cutoff date for 2023 submittees that met the new age requirements.)}}\n|- style=\"background:#FAEB86\"\n|Eden McCoy\n|General Hospital\n|Josslyn Jacks\n|\n|}}\n|-\n|Cary Christopher\n|Days of Our Lives\n|Thomas DiMera\n|\n| rowspan=\"3\" |}}\n|-\n|Henry Joseph Samiri\n|The Bold and the Beautiful\n|Douglas Forrester\n|\n|}\nPerfomers with multiple nominations\n;2 nominations\n*Alyvia Alyn Lind\n*Katelyn MacMullen\n*Sydney Mikayla\n*Eden McCoy\nSeries with most awards\n;2 wins\n*Days of Our Lives\n*General Hospital\nReferences\nNotes\nExternal links\n* [https://web.archive.org/web/20130729135934/http://www.imdb.com/event/ev0000206/ Daytime Emmy Awards] at the Internet Movie Database"
    }
  ]
}