{
  "content": [
    {
      "type": "text",
      "text": "# DC Presidents\n\n}}\n{| align=\"right\" cellpadding=\"4\" cellspacing=\"0\" style=\"margin-left:1em; width:300px; font-size:90%; border:1px solid #999; border-right-width:2px; border-bottom-width:2px; background-color:white;\"\n! colspan=\"2\" style=\"background-color:#FF0000;\" |\n{| align=\"center\" width=\"100%\"\n| padding=15px |\n| style=\"background:#0000CC;\" align=\"center\" width=\"100%\" |  D.C Presidents\n| padding=15px |\n|}\n|-\n| colspan=\"2\" style=\"text-align:center;\" |\n|-\n! Year formed\n|  1985 as Washington Presidents, reformed as D.C Presidents in 2010\n|-\n! Team colours\n|  Royal Blue, Red and White\n|-\n! Home field\n|  Horden & Peterlee Rugby Club\nEden Lane\nPeterlee\n|-\n! Conference alignment\n|  BAFA National Northern Section\n|-\n! Head coach and chairman\n|  Mark Quinn\n|}\nThe DC Presidents are a British American football team based in County Durham who were disbanded for two short periods. DC Presidents reformed on 4 October 2017 under new chairman Mark Quinn.\nHistory\nThe Presidents started in February 1985 when American Football enthusiasts Jeff Rutter and John Lockhart formed The Washington Presidents, named after the birthplace of the first US President George Washington’s grandfather; the summer of 1985 saw the club's first ever game. They played against another local new team the Darlington Dragons, which the Presidents won 62–10, with founder Jeff Rutter scoring on his début game as quarterback. The Presidents then went on to play a further two games in 1985 against Steel City Giants from Sheffield, losing 22–13, and Musselburgh Magnums away, losing 56–12.\nThe following year, 1986, saw the formation of the new National Budweiser League, and the Presidents entered their first competitive season in Division 1 North. They played 3 pre–season matches, all away from their home stadium Albany Park, Washington. Losing to Newcastle Senators 46-6, Hereford Chargers losing 28–22 and then winning 26–24 against the Bradford Dolphins. The Presidents' first ever regular season ended with a respectable 4–6 season.\nThe Washington Presidents ceased in 1997 until their re-formation in early 2011.\nRe-formation and re-naming\nThe Presidents re-formed in late 2010 under the new name of the DC Presidents, and began recruiting players throughout the winter and into early spring of 2011. Founding member of the original Washington Presidents Jeff Rutter returned as CEO of the new Presidents and recruited some original members of the Washington Presidents.\nOn 9 December 2011 the DC Presidents were officially accepted into the British American Football National League after successfully completing their 2011 Association process. The association process included two games versus Crewe Railroaders  and Shropshire Revolution and also played the two warm up games the Teesside Cougars.\nSecond disbandment\nOn 7 April 2014, the DC Presidents announced on their Facebook page that they had to solve some internal problems and as a result it meant that the club had pulled out of the 2014 season.\nRe-formation\nThe DC Presidents reformed in 2017 under the new Chairman and CEO Mark Quinn, with Vice Chairman Andrew Goodfellow alongside of him, from there they began a campaign of recruiting which saw the club grow very quickly from a small handful of members recruited from the past team to a strong team which grows week on week. As of the April the team has grown to a respectable 35 members.\nThe DC Presidents are currently in the association stage of joining BAFA League in 2018.\nDC Presidents have attracted such star players as Phillip Applegarth who has had a successful stint with the club since joining the sport.\nClub uniform\nThe DC Presidents sport a Royal blue, red and white Jersey with a white helmet featuring a red face cage and their logo along the side, matching bottoms and socks.\nVenue\nDC Presidents home games take place at Horden & Peterlee Rugby Club, Eden Lane, Peterlee.\nHome games have various kick off times which are advertised via their Facebook, Instagram and Twitter pages and entry is free.\nTraining sessions are held on Sundays throughout the year starting at 13-00 till 16-00.\nSupport\nThe club's mascot 'Uncle Sam' is a regular fixture at the club's games and 2013 saw the formation of the club's cheerleading squad the “Liberty Belles”, who made their debut at the Edinburgh Wolves game.\nSee also\n*British American Football Association National Leagues\nReferences\nExternal links\n*[https://web.archive.org/web/20130620140647/http://www.bafanl.co.uk/ British American football Association National League official site]\n*"
    }
  ]
}