{
  "content": [
    {
      "type": "text",
      "text": "# De Sitter–Schwarzschild metric\n\nIn general relativity, the de Sitter–Schwarzschild solution describes a black hole in a causal patch of de Sitter space. It is the positive-curvature case of the Kottler metric. Unlike a flat-space black hole, there is a largest possible de Sitter black hole, which is the Nariai spacetime (named after ). The Nariai limit has no singularities, the cosmological and black hole horizons have the same area, and they can be mapped to each other by a discrete reflection symmetry in any causal patch.\nIntroduction\nIn general relativity, spacetimes can have black hole event horizons and also cosmological horizons. The de Sitter–Schwarzschild solution is the simplest solution that has both.\nMetric\nThe metric of any spherically symmetric solution in Schwarzschild form is:\n:  ds^2 = - f(r) dt^2 + {dr^2 \\over f(r)} + r^2(d\\theta^2 + \\sin^2\\theta \\,d\\phi^2)\nThe vacuum Einstein equations give a linear equation for f(r), which has as solutions:\n:  f(r)=1-2a/r\n:  f(r)= 1 - b r^2\nThe first is a zero stress–energy solution describing a black hole in empty space time, the second (with b positive) describes de Sitter space with a stress–energy of a positive cosmological constant of magnitude 3b. Superposing the two solutions gives the de Sitter–Schwarzschild solution:\n:  f(r)= 1- \\frac{2a}{r} - b r^2\nThe two parameters a and b give the black hole mass and the cosmological constant respectively. In d&nbsp;+&nbsp;1 dimensions, the power law falloff in the black hole part has exponent 2&nbsp;&minus;&nbsp;d. In 2&nbsp;+&nbsp;1 dimensions, where the exponent is zero, the analogous solution starts with 2&nbsp;+&nbsp;1 de Sitter space, cuts out a wedge, and pastes the two sides of the wedge together to make a conical space.\nThe geodesic equation\n: g_{aj} \\ddot{x}^j + \\left( \\partial_i g_{aj} - \\frac{1}{2} \\partial_a g_{ij} \\right)\n\\dot{x}^j \\dot{x}^i = 0\ngives\n: \\ddot{r} + \\frac{1}{2} \\frac{- f'(r)}{f(r)}\n\\dot{r}^2 + \\frac{1}{2} f(r) f'(r) \\dot{t}^2\n- r f(r) \\dot{\\theta}^2 - r f(r) \\text{sin}^2 \\theta  \\dot{\\phi}^2 = 0\nfor the radial, and\n: \\ddot{t} + \\frac{1}{f(r)} f'(r) \\dot{t} \\dot{r} = 0\nfor the time component.\nHorizon properties\nThe de Sitter space is the simplest solution of Einstein's equation with a positive cosmological constant. It is spherically symmetric and it has a cosmological horizon surrounding any observer, and describes an inflating universe. The Schwarzschild solution is the simplest nontrivial spherically symmetric solution of the Einstein equations with zero cosmological constant, and it describes a black hole event horizon in otherwise empty space. The de Sitter–Schwarzschild spacetime is a combination of the two, and describes a black hole horizon spherically centered in an otherwise de Sitter universe. An observer who hasn't fallen into the black hole, and who can still see the black hole despite the inflation is sandwiched between the two horizons.\nIn a semi-classical treatment, the de Sitter cosmological horizon can be thought of as absorbing or emitting depending on the point of view. Similarly, for a black hole that has been around for a long time, the horizon can be thought of as emitting or absorbing depending on whether you take the point of view of infalling matter or outgoing Hawking radiation. Hawking argued based on thermodynamics that the past horizon of a white hole is in fact physically the same as the future horizon of a black hole, so that past and future horizons are physically identical. This was elaborated by Leonard Susskind into black hole complementarity, which states that any interior parts of a black hole solution, in either the past and future horizon interpretation, can be holographically related by a unitary change of basis to the quantum mechanical description of the horizon itself.\nThe Nariai solution is the limit of the largest black hole in a space that is de Sitter at large distances. It has two horizons, the cosmological de Sitter horizon and a Schwarzschild black hole horizon. For small mass black holes, the two are very different — there is a singularity at the center of the black hole, and there is no singularity past the cosmological horizon. But the Nariai limit considers making the black hole bigger and bigger, until its event horizon has the same area as the cosmological de Sitter horizon. At this point, the spacetime becomes regular, the black hole singularity runs off to infinity, and the two horizons are related by a spacetime symmetry.\nIn the Nariai limit, the black hole and de Sitter horizon can be interchanged just by changing the sign of the coordinate z. When there is additional matter density, the solution can be thought of as an Einstein spherical universe with two antipodal black holes. Whichever black hole becomes larger becomes the cosmological horizon.\nNariai solution\nStarting with de Sitter–Schwarzschild metric:\n:  ds^2 = - f(r) \\, dt^2 + {dr^2 \\over f(r)} + r^2(d\\theta^2 + \\sin^2\\theta \\, d\\phi^2)\nwith\n:  f(r) = 1 - {2a\\over r} - b r^2\nThe two parameters a and b give the black hole mass and the cosmological constant respectively. In higher dimensions, the power law for the black hole part is faster.\nWhen a is small, f(r) has two zeros at positive values of r, which are the location of the black hole and cosmological horizon respectively. As the parameter a increases, keeping the cosmological constant fixed, the two positive zeros come closer. At some value of a, they collide.\nApproaching this value of a, the black hole and cosmological horizons are at nearly the same value of r. But the distance between them doesn't go to zero, because f(r) is very small between the two zeros, and the square root of its reciprocal integrates to a finite value. If the two zeros of f are at R&nbsp;+&nbsp;ε and R&nbsp;&minus;&nbsp;&epsilon; taking the small ε limit while rescaling r to remove the ε dependence gives the Nariai solution.\nThe form of f near the almost-double-zero in terms of the new coordinate u given by  is:\n:  f(r)= {u^2 - \\epsilon^2\\over R^2}\nThe metric on the causal patch between the two horizons reduces to\n:  ds^2 = -(R^2-z^2) \\, dt^2 + {dz^2\\over (R^2- z^2)} + R^2 \\, d\\Omega^2 ,\nwhich is the metric of dS_2 \\times S_2. This form is local for an observer sandwiched between the black hole and the cosmological horizon, which reveal their presence as the two horizons at z&nbsp;=&nbsp;&minus;R and z&nbsp;=&nbsp;R respectively.\nThe coordinate z can be replaced by a global coordinate for the 1&nbsp;+&nbsp;1-dimensional de Sitter space part, and then the metric can be written as:\n:  dS^2 = - dt^2 + \\cosh^2 t \\, dx^2 + R^2 \\, d\\Omega^2\\,\nIn these global coordinates, the isotropy of de Sitter space makes shifts of the coordinate x isometries, so that it is possible to identify x with x&nbsp;+&nbsp;A, and make the space dimension into a circle. The constant-time radius of the circle expands exponentially into the future and the past, and this is Nariai's original form.\nRotating one of the horizons in Nariai space makes the other horizon rotate in the opposite sense. This is a manifestation of Mach's principle in self-contained causal patches, if the cosmological horizon is included as \"matter\", like its symmetric counterpart, the black hole.\nHawking temperature\nThe temperature of the small and large horizon in the de Sitter–Schwarzschild can be calculated as the period in imaginary time of the solution, or equivalently as the surface gravity near the horizon. The temperature of the smaller black hole is relatively larger, so there is heat flow from the smaller to the larger horizon. The quantity that is the temperature of the black hole is hard to define, because there is no asymptotically flat space to measure it relative to.\nCurvature\nThe non-zero components of the Ricci curvature tensor for the de Sitter–Schwarzschild metric are\n:  R_{tt} = \\frac{1}{2} f(r) \\left( 2 \\frac{f'(r)}{r} + f''(r)\\right)\n:  R_{rr} = - \\frac{2 f'(r) + r f''(r)}{2r f(r)}\n:  R_{\\theta\\theta} = 1-f(r) - r f'(r)\n:  R_{\\phi\\phi} = -\\sin^2(\\theta) \\left(-1 + f(r) + r f'(r)\\right)\nand the Ricci curvature scalar\n:  R = \\frac{2-2f(r)-4rf'(r) -r^2 f''(r)}{r^2}\nSee also\n* De Sitter space\n* Anti-de Sitter space\n* De Sitter universe\n* Kerr–Newman–de–Sitter metric\n* AdS/CFT correspondence\nReferences"
    }
  ]
}