{
  "content": [
    {
      "type": "text",
      "text": "# De Weyert, Makkinga\n\n| operator           = Gemeente Ooststellingwerf\n| built              = 1925\n| purpose            = Corn mill\n| type               = Smock mill\n| storeys            = Three-storey smock\n| base_storeys       = Two-storey base\n| roundhouse_storeys =\n| smock_sides        = Eight sides\n| sail_number        = Four sails\n| sail_type          = Patent sails\n| windshaft          = Cast iron\n| winding            = Tailpole and winch\n| auxpower           =\n| pairs_of_millstones= One pair of millstones\n| stone_size         =  diameter\n| saw_type           =\n| pump_type          =\n| scoop_dia          =\n| lost               =\n|other              =\n}}\nDe Weyert is a smock mill in Makkinga, Friesland, Netherlands which was built in 1925 and is in working order. The mill is listed as a Rijksmonument, number 31725.\nHistory\nThe mill was originally built in 1868 as a sawmill at Gorredijk, where it replaced a smock mill that had been built in 1763, which itself had replaced a post mill that was standing in 1718. The mill stood at (). In 1912, the mill was moved to Twijtel () and converted to a corn mill. The mill was moved to Makkum in 1925. A new windshaft and sails were fitted when the mill was moved. The name De Weyert comes from miller Weyert Zeephat, who had the mill moved to Marrum and worked the mill until his death in 1970 at the age of 97. The mill was restored in 1983/84 by millwright Doornbosch. In 1989, the sails were renewed by Fabrikaat Vaags of Aalten, Gelderland. On 17 December 2005, the sails were damaged in a storm. They were repaired in 2006. The mill is used to train millers in the craft of milling.\nDescription\nDe Weyert is what the Dutch describe as a \"stellingmolen\" . It is a smock mill on a two-storey base, there is a stage at second-floor level,  above ground level. The smock and cap are thatched. The mill is winded by tailpole and winch. The sails are Patent sails. They have a span of . The sails are carried on a cast-iron windshaft, which was cast by H J Koning of Foxham, Groningen. The windshaft also carries the brake wheel, which has 57 cogs. This drives the wallower (30 cogs) at  the top of the upright shaft. At the bottom of the upright shaft, the great spur wheel, which has 88 cogs. The great spur wheel drives a pair of   diameter French Burr millstones via a lantern pinion stone nut which has 26 staves.\nMillers\n*Weyert Zeephat (1925–70)\nPublic access\nDe Weyert is open to the public on Saturdays from 09:00 to 12:00.\nReferences"
    }
  ]
}