{
  "content": [
    {
      "type": "text",
      "text": "# Debate on traditional and simplified Chinese characters__disambig_1\n\n}}\n簡之爭\n| l3 = Proper-simple dispute\n| p3 = Zhèngjiǎn zhīzhēng\n| j3 = Zing3gaan2 zi1zang1\n}}\nThe debate on traditional Chinese characters and simplified Chinese characters is an ongoing dispute concerning Chinese orthography among users of Chinese characters. It has stirred up heated responses from supporters of both sides in mainland China, Hong Kong, Macau, Taiwan, and among overseas Chinese communities with its implications of political ideology and cultural identity.  Simplified characters here exclusively refer to those characters simplified by the People's Republic of China (PRC), instead of the concept of character simplification as a whole. The effect of simplified characters on the language remains controversial, decades after their introduction.\nProblems\nThe sheer difficulties posed by having two concurrent writing systems hinders communications between mainland China and other regions, although with exposure and experience a person educated in one system can quickly become familiar with the other system. For those who know both systems well, converting an entire document written using simplified characters to traditional characters, or vice versa, is a trivial but laborious task. Automated conversion, however, from simplified to traditional is not straightforward because there is not always a one-to-one mapping of a simplified character to a traditional character. One simplified character may equate to many traditional characters. As a result, a computer can be used for the bulk of the conversion but will still need final checking by a human.\nThe writer Ba Jin, in his 1999 essay \"Thoughts: Reform of Chinese characters\" (), urged caution in any reforms to the written Chinese language. He cited the inability of those educated in Hong Kong or Taiwan to read material published on the mainland, and vice versa, as a great disadvantage of simplified Chinese. He also cited the ability to communicate, not just with Chinese peoples of various regions, but also with people from across the Chinese cultural sphere—countries such as Japan, Korea, and Vietnam—as a great advantage of the written Chinese language that should not be undermined by excessive simplification.\nCulture\nSimplified characters\nProponents say that the Chinese writing system has been changing for millennia: it passed through the oracle script, bronzeware script, seal script, and clerical script stages. Moreover, the majority of simplified characters are drawn from conventional abbreviated forms that have been used in handwriting for centuries such as the use of 礼 instead of 禮, and some simplified characters are in fact restorations of ancient forms that had become more complicated over time. For instance, the character for \"cloud\" was originally 云 in early inscriptions, but the character was borrowed to write a homophonous word meaning \"to say\". To disambiguate the two uses of the character, the \"rain\" radical (雨) was added on top when it meant \"cloud\", forming the current traditional character 雲. The homophonous word meaning \"to say\", however, has become archaic in modern Chinese, though 雲 continues to be used for \"cloud\". The simplified version simply restores 云 to its original use as \"cloud\".\nTraditional characters\nWhile some simplified characters were adopted from conventional abbreviated forms that have existed for a long time, those advocating the simplified forms often fail to point out that many such characters in fact had multiple vernacular forms out of which just one was chosen, arbitrarily, and then privileged by the designers of the simplified character scheme. Many of the changes can be seen as ideological, such as the removal of the \"heart\" (心) radical from the word \"love\" (愛) into the new character (爱) without heart. To some, the new 'heartless' love character is an attack on Confucianism, which emphasizes the virtues of filial piety and humanity in relationships so as to maintain a harmonious society. Supporters of simplification argue that the removal of the heart radical occurred in the context of calligraphy in ancient times and was not viewed in an anti-Confucian light.\nPro-traditional commentators argue that the changes through the history are almost exclusively alterations in writing styles, especially vernacular writing, and not in the fundamental structure of the characters—especially after the Qin standardization. They have alleged that simplified characters were arbitrarily schematized and then imposed by the PRC on its people with the intention of subverting and eradicating selected elements of traditional Chinese culture, in order to carry out what the PRC viewed as necessary revolutionary modernization. These critics point out that many of the fundamental characteristics underlying Chinese characters, including radicals as well as etymological and phonetic elements, were deliberately omitted in their simplified form at least partly for this reason (i.e., disrupting continuity with traditional Chinese culture). One frequently-cited example is the character for \"sage\" or \"holy\", 圣 in simplified and 聖 in traditional. The simplified character lacks the king radical (王), replacing it with soil (土). Supporters of simplification appeal to the fact that 圣 was often used, in handwriting, as a simplified variant of 聖 long before the PRC itself came into being. The Shuowen Jiezi (說文解字) furthermore classifies 聖 as a xíngshēng (形聲) character with phonetic component 呈. Thus, the origin of the character may have nothing to do with any cultural connection to kings or royalty.\nEven among supporters of simplification, some make the argument that Classical Chinese texts should not be printed in simplified Chinese because of the complexities involved in the use of tōngjiǎ (通假) or phonetic loan characters. Ancient texts for instance might use the character 女 (nǚ, \"women\") when the character 汝 (rǔ, \"thou\") is intended semantically because of their similar pronunciation in Old Chinese. The interpretation of ancient texts is often complicated by the presence of these phonetic loans, for which several very different meanings could be read. Generally, the more ancient the text, the more numerous the phonetic loans, since separate characters were slowly introduced as the written language evolved, in order to disambiguate these loans. For instance, the preclassical Book of Odes and the early classical Analects always uses 女 for 汝, while texts from the Han dynasty or later nearly always use 汝.\nThe merging of several traditional characters into one simplified character (e.g., 願 (yuàn, \"desire\", commonly used) and 愿 (yuàn, \"honest\", archaic and rare)) to 愿 (both meanings) during the simplification process can be thought of as the modern introduction of phonetic loans. This complicates an already complex landscape of tōngjiǎ characters appearing in classical texts, introducing additional possibilities for misinterpretation, particularly for beginning students. Personal names of historical individuals are also problematic. For example, there are two Six Dynasties period generals whose names are 王濬 (206–286) and 王浚 (252–314), both of which are pronounced as Wáng Jùn. However, according to the current PRC simplification scheme, the character 濬 is considered to be an obsolete variant of 浚, so to conform to standard orthography, these names should be written identically using 浚. Against this argument, proponents of simplified characters respond that simplified characters are more practical in all domains other than ancient literature and that it is uneconomical to introduce high school students, already burdened by schoolwork, to a new character set for the sole purpose of teaching the classical language. Any potentially confusing usages can be remedied by providing appropriate annotations and glosses in footnotes, which are needed anyway for student editions of classical texts. When the need arises, history and language majors in colleges and universities gradually learn to read scholarly editions of texts set in traditional characters without too much difficulty. Nevertheless, classical texts set in traditional Chinese can be hard to find in mainland Chinese bookstores. The Zhonghua Publishing House (Zhōnghuá Shūjú, 中華書局) and several other specialist scholastic publishers are the only ones to routinely publish works in traditional characters.\nLiteracy\nArguments for simplified characters\n*Proponents feel that simplified Chinese characters with fewer strokes make learning easier, and is evidenced by the rapid decline in illiteracy in mainland China.\nArguments for retaining traditional characters\n*Users of traditional characters point out that the literacy rate of Taiwan and Hong Kong is higher than that of mainland China, compared for the same year. It is also argued that the fact that mainland China is much larger and more populous than Taiwan or Hong Kong does not excuse a lower rate of literacy, as by definition a literacy rate represents the proportion of literate people—not the sheer quantity of literate people living in the country's territory, though mainland China spends much less on education per capita than both Hong Kong and Taiwan.\n*There is also a false dichotomy in comparing the effect of simplified Chinese characters on an illiterate populace between two vastly different time periods. Early proponents of script reform during the period of Republican China such as Lu Xun and Lufei Kui have been mischaracterized to retrofit contemporary narratives in illiteracy reduction. This is because it was specifically functional illiteracy of adults which was rampant throughout this era, caused by a lack of systematic education, and was a major cause of concern at the time for the intelligentsia. Their now obsolete rationale also unambiguously involved the complete abandonment of the Chinese script and the full transition into an alphabetical script (such as Cyrillic or Hanyu Pinyin), which placed unprecedented emphasis on rapid modernization and is largely unfounded in science or linguistics.\n*Even if it is possible to correlate the adoption of simplified Chinese characters with increases in literacy rates, given the consistently high literacy rates in Taiwan and Hong Kong, and not to mention the fact that correlation does not imply causation, such correlations do not prove that the simplification of characters alone is determinant of literacy success any more than the many other factors involved in cultural change and educational reform. The increase in the accessibility of education from the aforementioned factors is also a strong contender for the credit of increased literacy rates in mainland China.\n*Aside from correlational arguments, the only other form of evidence offered in support of script reform success through character simplification is anecdotal.\nAmbiguity\nClarity of simplified characters\n*Proponents feel that some traditional characters are too similar in appearance, such as 書 (shū) \"book\", 晝 (zhòu) \"daytime\", and 畫/畵 (huà) \"drawing\": in contrast, the simplified forms which are 书, , and  respectively are much more distinct.\n*Furthermore, the merging of characters in simplified Chinese does not create confusion in vernacular usage. Classical Chinese mainly used one character for one word, which made it commonplace for one character to have multiple meanings and multiple pronunciations (e.g., \"天\" means \"sky\" (天苍苍), \"heaven\" (天将降大任), \"nature\" (浑然天成), \"weather\" (心忧炭贱愿天寒); \"长\" means \"length\" (cháng, 长一身有半), \"specialty\" (cháng, 一技之长), \"grow\" (zhǎng, 草木遂长), \"senior\" (zhǎng, 以君为长者), etc.). Context is vital to determining the meaning of a certain character in Classical Chinese. After the early 1900s' vernacular Chinese movement, compound words were formed by multiple characters (usually two), and these words usually have only one meaning: \"天空\" meaning \"sky\", \"上天\" meaning \"heaven\", \"天然\" meaning \"nature\", \"天气\" meaning \"weather\", \"长度\" meaning \"length\", \"生长\" meaning \"grow\", etc. Context is not necessary to determine the meaning of a certain word. Thus, the act of merging characters which forms homophones, does not create confusion when using vernacular Chinese (e.g., \"头发\" (頭髮, fà) meaning \"hair\", \"出发\" (出發, fā) meaning \"set off\", \"谷物\" (穀物, gǔ) meaning \"grain\", \"山谷\" (gǔ) meaning \"valley\"). Hence, simplification reduces the number of characters one would need to learn for everyday life.\nClarity of traditional characters\n*Opponents cite a similar argument where the simplification of once distinct characters have made them more difficult to discern. A common example is 無 (wú) for \"none\", simplified into , which appears very similar to the character 天 (tiān) for \"sky\". Another example would be 設 (shè) for \"designate\", and 沒 (méi) for \"without\", which are quite hard to distinguish apart in their simplified forms 设 and  and can result in confusion in quick handwriting or calligraphic fonts. This type of confusion has happened before for the characters 讀 (dú) for \"read\" and 瀆 (dú) for \"showing disrespect\" which were confused for each other in their simplified forms 读 and 渎 respectively. This disparity between leaving standalone characters unsimplified but taking the cursive (\"grass script\") form whenever applicable could lead to confusion with other similar looking components and contributes to the obscurity of its semantic value.\n*Similarly, some simplified characters create more confusion. In traditional Chinese, 千 (qiān) \"thousand\", and 乾 (gān) \"dry\" are very different characters. In simplified Chinese, they appear to be almost identical, being 千 and 干, respectively.\n*Simplified Chinese characters frequently include merged characters, which opponents view as baseless and arbitrary: 後 (hòu, \"behind\") and 后 (hòu, \"queen\") are both simplified into 后. Likewise, 隻 (zhī, a measure word) and 只 (zhǐ, \"only\") are merged into 只; 發 (fā, \"happening\") and 髮 (fà, \"hair\") are merged into 发; 麵 (miàn, noodles/flour) and 面 (miàn, face/side/surface) are merged into 面; 穀 (gǔ, \"crop\") and 谷 (gǔ, \"valley\") are merged into 谷, and so on.\n*On 3&nbsp;September 1993, the Board of Language Usage & Applications of China permitted and reintroduced the usage of the traditional-form character 鎔 (simplified 镕, \"róng\", \"to mould or melt\") and released a new policy of ''Resolution for the Complication in Using Character '鎔' and Its Usage Reintroduction'' (《关于\"鎔\"字使用问题的批复》). The movement was an attempt in trying to resolve the controversy caused by the conflict between the lawful mergers of characters of '鎔' and '熔' (both meaning \"to melt\") and the name usage of former Vice Premier Zhu Rongji (朱镕基). According to earlier Chinese laws regarding Chinese Language Simplification, the character '鎔' should have always been written as '熔'; however, Zhu Rongji insisted on writing '鎔' when it came down to writing his name because he was originally named in the character '鎔' but not '熔'. Thus, the Board later reintroduced the character. Proponents of traditional characters thus argue against the use of simplified Chinese, especially when it comes down to mergers of characters in names of historical heroes, scholars, philosophers, and political figures. They also report trouble in flight reservations when traveling in and out of mainland China due to the mergers of characters. On top of all that has been previously mentioned, the left-side radical of 鎔 (which is the left-side version of 金) is almost never seen in simplified characters, since it has largely been replaced by the simplified left-side radical seen in characters like 银, 铜, and 钱.\n*Professor Wang, at Beijing University of Education, also the Vice President of Chinese Language Association, and an official of Ministry of Education of China, agreed and criticized that some characters were oversimplified during the simplification campaign, and thus became counterproductively more difficult to learn, apply, and use. Wang particularly pointed at merged characters borne with these problems.\nSpeed of writing\nSimplified characters\n*Simplified characters have fewer strokes in general. For example, the common character 邊 (biān, meaning \"side\") has 18&nbsp;strokes, while its simplified form 边 has only 5. Proponents of simplification claim that this makes them faster to write.\n*People educated in traditional characters will often make extensive ad-hoc character simplifications in their handwriting to save time. This is similar to the practice of using abbreviations in informal written English (i.e., \"thru\" for \"through\") and proponents of traditional characters reply that this does not mean that the informal simplifications should be adopted as standard. Even in Taiwan where simplified characters are prohibited in official documents, signs can also sometimes have simplified characters. For example, 魯菜 is sometimes simplified as 鲁菜, as the character 鲁 and its variant 魯 would hardly be distinguishable if they were written with large strokes.\nTraditional characters\n*Proponents of the counterargument posit that the speed advantage of simplified Chinese becomes less relevant in the internet age. With modern computing, entering Chinese characters is now dependent on the convenience of input method editors or IMEs. Most IMEs use phoneme-based input, such as pinyin romanization or bopomofo, while others are grapheme-based, such as cangjie and wubi. These have sidelined the speed problems in handwritten Chinese, as traditional and simplified Chinese input methods have the same input speed, especially with phoneme-based IMEs. Thus, characters like 體/体 may be just as quick to input as the other, while the traditional form—though more complex—may offer a more distinctive shape that is therefore less easily confused with other common characters. (體 would never, for instance, be mistaken for 休.) Furthermore, even when it comes to handwriting, a majority of people resort to semi-cursive script by abbreviating strokes or form to save time, thereby circumventing the problem of slower handwriting.\nPhonetics\nRelation with simplified characters\n*Proponents point out that Chinese characters are most often made up of a pronunciation-indicating part (called the phonetic) and a part that indicates the general semantic domain (called the radical). During the process of simplification, there are some attempts to bring greater coherence to the system. For example, the shape of 憂 (yōu), meaning \"anxious\", is not a good indicator of its pronunciation, because there are no clear radical and phonetic components. The simplified version is 忧, a straightforward combination of 忄, the \"heart\" radical to the left (indicating emotion) and the phonetic 尤 (yóu) to the right.\n*Simplification emphasizes the phonetic, rather than semantic, nature of the characters. Most Chinese speakers are familiar with Standard Chinese, which the pronunciation is based on.\nRelation with traditional characters\n*Opponents point out that some simplified forms undermine the phonetics of the original characters, e.g.,  (pán, plate) has the phonetic component  (bān) on top, but the simplified form is , whose upper part is now  (zhōu).  (lú, a family name) and  (lú, \"furnace\") shares the same component  in their original forms, but they were inconsistently simplified into  and  respectively, so that  now has the less helpful  (hù) as its phonetic. For the simplification to be consistent,  should have been used instead of  as the righthand component in , as they are originally identical as . Some characters were radically stripped of all phonetic elements. An example of a traditional character simplified such that its phonetic element is totally removed is  (guǎng, meaning \"extensive\"), of which the internal character  (huáng) is enclosed within a . Simplified, the character is written without its internal phonetic element, and with no replacement: .\n*A classic feature of the traditional Chinese writing system is its versatility in representing not only the range of spoken varieties of the Chinese language—many of them mutually unintelligible to one another in speech—but also certain vastly different languages outside of China. The re-phonologizing of simplified characters further jeopardizes the writing system's traditional ability to bring mutual understanding between speakers of different, especially non-Mandarin Chinese dialects.\n* Uncoordinated simplification policies imposed on postwar Japan have led to instances of there being three forms of the same character in widespread use, for example, traditional  was simplified to  in postwar Japan but to  in the PRC.(In general, the new Japanese orthography made many fewer changes to the writing system than Simplified Chinese.)\nRadicals\nSimplified radicals\n*Proponents say that the radical system is imperfect in the first place. For example, 笑 (smile, laugh) uses the \"bamboo\" radical 竹, which has no obvious relation to smiling or laughing.\nTraditional radicals\n*Some argue that simplification results in a broken connection between characters, which makes it more difficult for students to expand their vocabulary in terms of perceiving both the meaning and pronunciation of a new character.  For example, 鬧, nào (din, fuss), which uses the traditional radical \"fight\" is now 闹, with the door radical 门 that is not indicative of its meaning.\n*The round of characters simplified by the Communist Party was not systematic.  Extensive studies have been conducted among different age groups, especially children, to show that reducing the strokes loses the radical and phonetic relationships between the characters.  This actually makes it more difficult for simplified character readers to distinguish the characters, since they now rely heavily on memorization.\n* Some traditional characters are very distinct, such as electricity/lightning 電 diàn, rope 繩 shéng, and turtle 龜 gūi. After the simplification process, all three characters appear to share the same component even though they have no relationship at all. Respectively: electricity 电, rope 绳, turtle 龟 can now conceivably be mistaken for one another, while their distinctions in the traditional forms are unmistakable. The simplification of the word electricity/lightning 電 to 电 also removed its semantic component. Stripped of its radical, 电 no longer bears any sense of semantic affinity with characters like snow 雪, thunder 雷, and hail 雹, themselves all untouched in the PRC simplification scheme. The same radical was similarly removed in the simplification of \"clouds\" 雲 to 云.\n* The disparity between leaving standalone characters unsimplified by taking the cursive script form whenever applicable (such as in 食, 金, 糸, and 言) has been evidenced to hinder character recognition in young children by a large degree.\n*Critics of the proposed replacement for the traditional system of radicals see the new system as being no less arbitrary than the existing system, it therefore only complicates matters to introduce a competing standard that as a radical departure from traditional radical arrangement might cause more confusion than simplification. The traditional system of radicals is no more arbitrary than, by analogy, the traditional order of the letters of the English alphabet, or the English names for the letters, all of these being to varying extents agreed-upon standards which have enjoyed supreme precedence in their respective orthographic traditions. Any attempt to simplify or reform established standards must demonstrate extreme utility to be worth the risk of the confusion and complications that inevitably arise when such arbitrary standards are changed to new standards, especially when the new standards are just as arbitrary as the old ones, if not more so.\nAesthetics\nSimplified aesthetics\n*Simplified Chinese characters are more legible when small fonts are used, or if the electronic display has a low resolution. The fine details of traditional Chinese characters are easy to discern in large size calligraphy but the individual strokes of a number of complex characters are harder to distinguish when smaller fonts are used and some components are slightly altered as a solution. This problem is exacerbated by low-quality printing or usage of thicker lines. The recognition issue applies to some OCR software as well. Such software is more accurate with hanzi of simpler composition.\nTraditional aesthetics\n*Opponents argue the problem with the displaying of certain traditional Chinese characters is largely irrelevant as characters are recognizable by their shape and form as a whole and not by each individual stroke. And, moreover, that as one gets used to reading traditional Chinese characters, the initial discomfort from having to read them on small screens or fonts is likely to fade away.\n*Aesthetic continuity with China's immense heritage of art, literature, and calligraphy is diminished by the supplanting of characters that have been in standard use for centuries with an arbitrary selection of vernacular and shorthand variants along with many invented forms that are nowhere to be found in most writings, inscriptions, and art made in China before the 20th&nbsp;century.\n*Traditional Chinese characters are often used as the standard characters set in Chinese calligraphy in Taiwan, Hong Kong, Macau, and are even allowed for calligraphy in the PRC, presumably because of its aesthetic value.\n*Opponents argue a strong preference for the aesthetics of traditional characters among mainland Chinese is evident in their significant usage of traditional forms in artistic work, signage, advertising, and internet screen names.\n*Even though about 30% of simplified Chinese characters match simplified kanji, those who understand traditional Chinese will understand a much greater proportion of Japanese Kanji, as the current standard Japanese character set is much more similar to traditional Chinese.\n*Simplified characters, such as  for  (mén, door) look like the universal informal handwritten form, and look as improper as cursive would look in printed English.\nPracticality\nPracticality of simplified characters\n*Traditional Chinese characters are only still used primarily by those in Taiwan, Macau, Hong Kong, and many overseas communities, comprising a small minority of the Chinese-speaking population (~50&nbsp;million people). However, they also remain in use in mainland China for artistic, scholarly, and advertising purposes. Simplified Chinese has come to dominate the written form of Chinese used nearly all over the world, due to the size and rising influence of mainland China. The United Nations has also used simplified Chinese since 1973. Moving back to traditional characters on the mainland has the potential to be difficult, confusing, and time-consuming.\n*Chinese text written before the 20th&nbsp;century was in Classical Chinese, which is much different from the written vernacular Chinese used today, even in traditional characters. Learning to read the older texts requires additional study, even from Chinese-speakers educated in traditional characters. Many versions of the Chinese Classics have been published in simplified characters.\n*Acceptance of simplified characters is increasing, mirroring acceptance of the pinyin romanization system that was once a PRC and now an international standard, although with much greater resistance and to a significantly lesser extent. In the 1960s and 1970s, Chinese as a foreign language was taught in countries like France and the United States solely in traditional characters. In the 1990s, universities in the United States were split between simplified and traditional, with simplified growing and traditional being taught mainly for the benefit of those who wish to learn Classical Chinese, or Chinese for use in Hong Kong, Taiwan, Macau, or overseas Chinese communities. Today, in terms of teaching and learning Chinese as a foreign language outside of China, the simplified characters has \"become the first choice because of student demand\". Regardless, some instructors allow students the choice to write in either simplified or traditional characters.\n*With today's division of labor, not all students need to learn to read classical texts. Schoolchildren can learn simplified characters first, and then traditional characters later if they want to be linguists or historians.\nPracticality of traditional characters\n*If the PRC was able to impose its scheme of simplified characters on the majority of Chinese people, then a reversion to the use of traditional characters could hardly be any less feasible. From the pro-traditional point of view, there is as much reason, if not more, to return to the traditional orthography, as there ever was to simplify in the first place. Furthermore, it would be fatalistic and patronizing to deem Chinese people incapable of learning the older forms due merely to the sheer prevalence of simplified characters' usage in most of China today.\n*While written communication with the large population of mainland China and other communities requires the use of simplified Chinese, there are compelling practical reasons which require the use of traditional characters. The Republic of China (ROC) is the largest community of traditional character users and ROC President Ma Ying-jeou pushed for the removal of simplified Chinese translations which were available for use by Mainland internet users on government websites before 15&nbsp;June 2011. Government documents and websites are to only use traditional characters and, while simplified characters are not banned in Taiwan, the president strongly encouraged the exclusive use of traditional characters, even in the tourism sector. This move to protect traditional characters ensures that visitors to the Republic of China will need to learn traditional characters if they wish to use Chinese.\n*Another common practical reason for the continuation of traditional characters is the expansive cultural legacy of Chinese history and art prior to simplification. The written form did evolve over the centuries but the traditional character set used today is much more closely related to the written Chinese which has been in use for thousands of years. As such, the traditional characters are said to provide access to Chinese culture prior to simplification.\n*Those wishing to communicate or do business with overseas Chinese communities in the Western World require knowledge of traditional characters given their dominance in such communities and the negative connotations many in these communities associate with simplified characters.\n*Many Chinese character dictionary apps can display both traditional and simplified versions of Chinese words, so being able to switch between character systems should not pose any major issues when reading traditional characters.\nPolitics\nThe long history of Chinese characters and the role of the Chinese Communist Party in the design and adoption of simplified characters means that there is often a strong political aspect to the debate on the usage of traditional and simplified Chinese characters.\nCommunist Party and simplified characters\n*While the use of simplified Chinese is often associated with the PRC and its ruling Communist party, the connection today is not as simple as it once may have been. Many simplified Chinese texts are published outside of mainland China. Chinese newspapers in Singapore and Malaysia are mainly published in simplified Chinese, although overseas publications, such as in Chinese communities in the U.S., still mostly use traditional characters. Most university Chinese programs in the United States and France teach simplified characters, and the number continues to rise. The internet is also increasingly diverse, with many websites, including Wikipedia, offering an easy switch between simplified and traditional scripts.\n*While character simplification officially began in 1956, it had origins that went back to the early twentieth century before the founding of the PRC. The Kuomintang even developed a draft plan for character simplification in 1935 and as late as 1946 also made positive statements about simplified characters such as \"As long as it doesn't use [romanization] or [bopomofo], anything can be considered guoyu\". Character simplification was not a part of the Four Olds nor the Cultural Revolution (both began in the mid-1960s). Whether traditional characters were \"destroyed\" or not is a matter of opinion, others might say they were \"modified\".\n*Simplified Chinese characters were not entirely developed by the PRC as some of the simplified characters were taken from Japanese Shinjitai, such as  from  (xué, to study).\n*Promotion of traditional characters is sometimes characterized as a Taiwanese plot to sabotage China's language policy and to promote Sinocentrism and Chinese cultural nationalism, thereby undermining China's relation with national minorities and isolating China from the world.\n*Those who use simplified characters often remark that the subject is a simple one which has been made overly complicated by political considerations. They claim that the use of simplified characters or traditional characters should be decided based on pragmatic or aesthetic reasons, not political ones.\n*The simplification process was part of a political revolution. At the time of creation, the study of writing system design was primitive and unempirical, and without a sophisticated understanding of the tradeoffs involved, the simplification process was considered careless and done poorly.\nNationalist usage of traditional characters\n*In the communities where traditional characters are used, simplified characters are strongly associated with Maoism and iconoclasm and so they are viewed very negatively. By extension, continued use of traditional characters has been a conspicuous way of maintaining national cultural identity. School children in these areas are strongly discouraged from using simplified characters. In Taiwan especially, simplified characters have been regarded as \"Communist\" (viz. PRC propaganda), and accordingly they are quite diligently avoided.\n*More specifically, character simplification, in light of the destructive, \"Anti-Four Olds\" during the Cultural Revolution, is sometimes characterized a \"Communist plot\" to cut off traditional Chinese culture and values. Simplified characters were banned in Taiwan until 2003, and only learned by specialists doing intelligence work on Communist China. Simplified characters are also branded in Taiwan as \"bandit characters\" (, literally \"gangster characters\").\nDevelopments in the 21st century\nIn recent years, the official Campaign of Simplification of Chinese Language has caused many controversial discussions in the general public to higher level of the government in mainland China, Taiwan, Hong Kong, and among some international organizations.\n2007\nIn November 2007, scholars and representatives from Japan, Korea, mainland China, and Taiwan came to Beijing and joined the Eighth Annual International Conference of Chinese Language Study. The conference was conducted and hosted by the National Office of International Promotion of Chinese Language and Board of Language Usage & Applications of the Ministry of Education of China. Immediately after, Korean media reported that the scholars and representatives reached a few conclusions after long discussion in the conference. One of those conclusions was that scholars would be using Traditional Chinese characters to standardize 5000 common Chinese characters across the countries and would continue to allow the use of Simplified Chinese characters if there happened to have one across those different areas. However, Chinese officials claimed that they did not reach such an agreement but would like to see the harmonious coexistence of Traditional and Simplified Chinese. Still, to many, that was the approval from Chinese Government because they were no longer absolutely opposed to the use of Traditional Chinese.\n2008\nIn March 2008, a Mainland author, Wang Gan, published a review article on his personal blog about the possibility of the reintroduction of Traditional Chinese, What About Abolishing Simplified Chinese within the Next 50 Years?''. Later Sina.com invited Wang Gan for an interview on his views on the history reasons and deficiencies of simplified Chinese characters.\nTwenty-one members of the Chinese People's Political Consultative Conference (CPPCC) delivered a proposal to add Traditional Chinese characters to the primary school curriculum. The proposal was rejected by the Minister of Education, who explained, \"Our nation has its fundamental governing principles. [One of them, by law, is] to promote the usage of Simplified Chinese and Mandarin. This is the basic condition.... Thus, we will not consider reintroducing Traditional Chinese education in our primary school curriculums.\"\nOn 5&nbsp;July 2008, on his visit to Taiwanese writer Koarn Hack Tarn's home, Taiwanese President Ma Ying-jeou promised that he would not introduce the usage of Simplified Chinese into the territories just because of the local newly passed policy to let Mainland tourists visit Taiwan but to provide side-by-side translation so that Mainland visitors could appreciate the aesthetic nature of Traditional Chinese. And he also told journalists that he wished all Chinese people would eventually be using Traditional Chinese in the near future.\n2009\nIn early 2009, the ROC (Taiwan) government launched a campaign to obtain World Heritage status for Traditional Chinese characters in a bid to preserve them for the future. At the Eleventh National People's Congress, a representative from Taiwan, Ms Chen Jun, called for the Chinese government to support the world heritage campaign. She also suggested the introduction of Traditional Characters education into mainland primary and secondary education to improve passion for and understanding of traditional Chinese culture and language.\nDuring a March 2009 CPPCC meeting, member Pan Qinglin proposed that simplified characters should be abolished and Traditional Character usage reimplemented over the course of ten years. His proposal was widely criticized as frivolous.\nAt the Chinese Academy of Social Sciences China Studies Forum in April 2009, it was announced that some adjustments would be made to the simplified characters. Experts acknowledged that some of the earlier character simplifications were problematic and inhibited understanding. Academics expressed support for the concept of \"know traditional, write simplified\" and specifically rejected the idea of reintroducing traditional characters as too costly and impractical. They cited a survey of ninety-one top-ranked senior classical Chinese literature and Chinese language students from Beijing Normal University testing their ability to write Traditional Characters, which only three students passed.\n2010s\nDuring the 2014 Two Sessions, Wu Shimin deputy to the National People's Congress, proposed the PRC should \"restore traditional Chinese characters and inherit traditional culture\" for discussion.\nDuring the 2019 Two Sessions, a member of the CPPCC put forward the \"Proposal on the Education of Traditional Chinese Characters in Primary and Secondary Schools\", the Ministry of Education of the People's Republic of China published a response letter to the proposal emphasizing that Chinese characters have undergone great changes over its thousands of years of history. Additionally, more than half of the population surveyed in government studies \"understand the general meaning\" when presented with text in traditional Chinese characters. According to current PRC education standards, traditional Chinese characters will be involved the education of classical Chinese reading and calligraphy in primary and secondary schools. The response ends acknowledging that traditional characters in China will still play a role in the development of the literary arts and strengthening communication with Chinese communities that still use traditional characters.\nSee also\n* Debate on mixed script and hangeul exclusivity\n* Timeline of Chinese history\n* Sino-Tibetan languages\nNotes\nIn Taiwan, traditional characters are officially known as \"proper characters\" (), while most Chinese speakers outside Taiwan, whether using simplified or traditional characters, refer to traditional characters as \"complex characters\" ().\nReferences"
    }
  ]
}