{
  "content": [
    {
      "type": "text",
      "text": "# Deborah Howard\n\n| image              =\n| image_size         =\n| alt                =\n| caption            =\n| native_name        =\n| native_name_lang   =\n| birth_name         =\n| birth_date         =\n| birth_place        =\n| death_date         =\n| death_place        =\n| death_cause        =\n| nationality        =\n| citizenship        =\n| other_names        =\n| occupation         =\n| period             =\n| known_for          =\n| title              =\n| boards             =\n| spouse             =\n| partner            =\n| children           =\n| parents            =\n| relatives          =\n| awards             =\n| website            =\n| education          =\n| alma_mater         =\n| thesis_title       =\n| thesis_url         =\n| thesis_year        =\n| school_tradition   =\n| doctoral_advisor   =\n| academic_advisors  =\n| influences         =\n| era                =\n| discipline         = Art and architectural historian\n| sub_discipline     =\n| workplaces         =\n| doctoral_students  =\n| notable_students   =\n| main_interests     =\n| notable_works      =\n| notable_ideas      =\n| influenced         =\n| signature          =\n| signature_alt      =\n| signature_size     =\n| footnotes          =\n}}\nDeborah Janet Howard,  (born 1946) is a British art historian and academic. Her principal research interests are the art and architecture of Venice and the Veneto; the relationship between Italy and the Eastern Mediterranean, and music and architecture in the Renaissance. She is Professor Emerita of Architectural History in the Faculty of Architecture and History of Art, University of Cambridge and a Fellow of St John's College, Cambridge.\nEarly life and education\nFrom 1964 to 1968, Howard studied for the architecture and fine arts Tripos at Newnham College, Cambridge, graduating with a first class honours Bachelor of Arts (BA) degree. As per tradition, her BA was promoted to a Master of Arts (MA Cantab) degree in 1972. From 1968 to 1972, she studied at the Courtauld Institute of Art, University of London. She graduated with a Master of Arts (MA) degree with distinction and then completed her Doctor of Philosophy (PhD) degree in 1973.\nWhilst at the Courtauld, Howard contributed photographs to the Conway Library that are currently being digitised by the Courtauld Institute of Art as part of the Courtauld Connects project.\nShe was awarded an honorary Doctorate of Letters (LittD) by the University College Dublin in 2014.\nProfessional life\nUniversity teaching and research posts\nProfessor Howard has spent the majority of her academic life at the University of Cambridge where she started her career becoming the Leverhulme Fellow in the History of Art, at Clare Hall, Cambridge, in 1972/3. She then taught and undertook research at University College London, the University of Edinburgh and the Courtauld Institute of Art.\nIn 1992, she returned to the Faculty of Architecture and History of Art at Cambridge when she became a Fellow of St John’s College. From 2001 to 2013, she was Professor of Architectural History at the University of Cambridge and Head of Department of History of Art from 2002 to 2009.\nShe has also held visiting appointments at Yale (Summer Term program in London), Harvard (Aga Khan Program for Islamic Architecture and the Villa I Tatti in Florence), the National Gallery of Art, Washington DC, Smith College, Princeton, and the Universities of Melbourne and Queensland.\nResearch projects\nWith Dr Mary Laven and Professor Abigail Brundin she was one of the principal investigators of a major interdisciplinary project, funded by a Synergy Grant from the European Research Council, 2013-2017, Domestic Devotions The Place of Piety in the Italian Renaissance Home, 1400-1600 which has resulted in a number of publications. Her most recent project Technological Invention & Architecture in the Veneto in the Early Modern Period'' was under the 2017-19 Leverhulme Emeritus Fellowship.\nExpertise\nHoward's book Venice & the East: The Impact of the Islamic World on Venetian Architecture demonstrated how fourteenth- and fifteenth-century trade with Muslim states (including Cairo, Damascus, Acre, Aleppo, Baghdad and Amman) were key to shaping the design of Venice: with Islamic patterns and shapes incorporated \"symbolically\" into architecture, city planning following demarcations of business and leisure seen in North African states, and new technologies for building domed roofs brought back alongside traded goods. The book is illustrated with Howard's own photographs.\nAwards and honours\nHoward was elected a Fellow of the British Academy FBA in 2010. She has worked as a Council Member, on working groups, committees and is currently a peer reviewer for grant and fellowship applications in History of Art and Architecture.\nIn 2021, she was elected to the American Philosophical Society.\nA Festschrift Architecture, Art and Identity in Venice and Its Territories, 1450–1750: Essays in Honour of Deborah Howard was published in 2013.\nCommunity work\nDuring her long career, Professor Howard has acted on numerous external academic committees as well as in more community based posts. For example, Professor Howard is a Trustee of the Venice in Peril Fund. More locally she is School Governor of St John’s College School Cambridge having previously been a governor of St Margaret’s School in Edinburgh (since closed) and the Perse School for Girls (now the Stephen Perse Foundation) in Cambridge.\nPersonal life\nDeborah Howard was born in Westminster, London, on 26 February 1946. She is married to the physicist Malcolm Longair and they have two children.\nSelected publications\n*  The Sacred Home in Renaissance Italy, (with Abigail Brundin & Mary Leven), Oxford University Press, 2018,\n* ''Venice Disputed: Marc'Antonio Barbaro and Venetian Architecture,1550-1600, New Haven ; London : Yale University Press, 2011,\n* Sound and Space in Renaissance Venice: Architecture, Music, Acoustics, with Laura Moretti, New Haven, Conn. ; London : Yale University Press, 2009,\n* The Architectural History of Venice (revised edition with new photographs by Sarah Quill and Deborah Howard), New Haven ; London : Yale University Press, 2002,\n* Venice & the East: The Impact of the Islamic World on Venetian Architecture 1100-1500, New Haven, Conn. ; London : Yale University Press, 2000, ,\n* Scottish Architecture: Reformation to the Restoration, 1560-1660, Edinburgh : Edinburgh University Press, 1995,\n*Jacopo Sansovino; Architecture and Patronage in Renaissance Venice'', New Haven ; London : Yale University Press, 1975,\nReferences"
    }
  ]
}