{
  "content": [
    {
      "type": "text",
      "text": "# Deborah King\n\n→\n| birth_place        = San Francisco, California, U.S.\n| alma_mater         = University of California, Davis\n| occupation         = Author, public speaker, attorney\n| years_active       = Since 1973\n}}\nDeborah King (born February 9, 1948) is an American author, speaker and attorney. She is the founder and CEO of the Deborah King Center and the author of four books including New York Times best-selling Be Your Own Shaman.\nEarly life, education and legal career\nKing graduated from the University of San Francisco with a BA in 1970, and from the University of California, Davis, School of Law with a Juris Doctor in 1973.\nKing began her legal career at the office of the California Attorney General as a prosecutor in 1973. In 1975, she opened a law firm in South Lake Tahoe, California, specializing in hotel acquisitions and sales. In the 1990s, the firm moved their headquarters to Westlake Village, California.\nPersonal development and public speaking career\nKing opened the Deborah King Center in 2000 in Westlake Village and in 2019, the Center moved to Ojai, California. The Center focuses on personal development, offers weekly classes, and hosts frequent workshops at the [https://www.ojaivalleyinn.com/spa-ojai/spa-ojai-experiences/mindful-journeys Ojai Valley Inn and Spa]  as well as at other locations.\nKing is a frequent guest on national TV, and has appeared on ABC, NBC, CNN and Fox as well as entertainment shows including Showbiz Tonight, Access Hollywood, and E! Entertainment.  She has a weekly radio show on Hay House Radio.\nKing’s online courses are published by Mindvalley, the education technology company that focuses on products of personal development, as well as by [https://theshiftnetwork.com/ The Shift Network], a publisher of personal and societal transformative online material.\nWriting\nKing has published four books in the personal development and self-help fields. The first, Truth Heals: What You Hide Can Hurt You, was published on February 15, 2010, and is a United States bestseller.\nOn April 1, 2011, King's next book, Be Your Own Shaman: Heal Yourself and Others with 21st-Century Energy Medicine, a New York Times bestseller was published.\nKing’s most recent book, Heal Yourself – Heal the World, was published by Simon & Schuster on October 10, 2017.\nKing is also a frequent contributor to Huffington Post and Psychology Today and writes a monthly column for Hay House Publishing.\nPublications\n*(February 15, 2010)\n*(April 1, 2011)\n*(September 17, 2013)\n*(October 10, 2017)\nSee also\n*Alternative medicine\n*List of people in alternative medicine\n*Lists of the New York Times Non-Fiction Bestsellers of 2011\nReferences"
    }
  ]
}