{
  "content": [
    {
      "type": "text",
      "text": "# Deccan Archaeological and Cultural Research Institute\n\n|extinction   =\n|type         = NGO\n|status       =\n|purpose      = Art, cultural, architectural heritage preservation/restoration\n|headquarters = Shalivahana Nagar, Hyderabad-36\n|location     =\n|coords       =\n|region_served =\n|membership   =\n|language     =\n|leader_title = Director\n|leader_name  = Kurra Jitendra Babu\n|main_organ   =\n|parent_organization =\n|affiliations =\n|num_staff    =\n|num_volunteers =\n|budget       =\n|website      = https://dacri.in/\n|remarks      =\n}}\nThe Deccan Archaeological and Cultural Research Institute is a non-profit organisation operating in the Deccan region of India, registered under Act 2 of The Indian Trusts Act, 1882. It is dedicated to the conservation and preservation of India’s natural, cultural, living, tangible and intangible heritage.\nHistory\nDACRI was founded in 2009 in Hyderabad  to promote historical and cultural research among the people of the Deccae. Since 2009, it has pioneered the conservation, protection and promotion of the cultural heritage and monumental grandeur of Deccan region.\nIn 2012, members of Deccan Archaeological and Cultural Research Institute (DACRI) and other archeologists and historians discovered a series of 20 megalithic burial cairn circles dating to 1000 BCE on a hillock in Madugala village in Mahbubnagar district, India. The team also discovered a huge Satavahana site in an extent of 100 acres datable to between the 1st century BCE to 2nd Century CE.\nPublications\n*Telaṅgāṇālō inumu, ukku pariśrama  by S Jaikishan; Deccan Archaeological and Cultural Research Institute, 2010\n*Siddhanāgārjununi Rasēndramaṅgaḷaṃ  by Nāgārjuna, Siddha.; Kurrā Jitēndrabābu; Deccan Archaeological and Cultural Research Institute, 2010.\n*Tragedy of Hyderabad  by Mir Laik Ali; Kurrā Jitēndrabābu; Deccan Archaeological and Cultural Research Institute, 2011.\n*Kaumudīmahotsavaḥ   Vijjikā; Mānavalli Rāmakr̥ṣṇakavi; S K Ramanatha Sastri; Deccan Archaeological and Cultural Research Institute, 2015.\nReferences"
    }
  ]
}