{
  "content": [
    {
      "type": "text",
      "text": "# Deccan wars__disambig_1\n\n)}}\n| place             = Present-day states of Maharashtra, Madhya Pradesh, Karnataka, Gujarat, and Tamil Nadu\n| result            =\n| combatant1        = Maratha Kingdom\n| combatant2        = Mughal Empire\n| commander1        =\n*  Shahu I\n* Rajaram I\n*Muhammad Akbar\n*  Tara Bai\n* Moropant Trimbak Pingle\n* Shankaraji Narayan Gandekar\n* Parshuram Pant Pratinidhi\n* Hambirrao Mohite\n*  Ramchandra Pant Amatya\n* Yesubai\n*  Santaji Rao\n*  Dhanaji Jadhav\n}}\n| commander2        =\n*  Shah Alam I\n*  Azam Shah\n*  Prince Kam Bakhsh\n*  Prince Bidar Bakht\n*  Asad Khan\n*  Zulfiqar Khan\n*  Muqarrab Khan\n*  Ghazi-ud-Din Khan\n*  Asaf Jah I\n*  Bahadur Khan\n}}\n| strength1         = 150,000\n| strength2         = 500,000\n| image             = Early Maratha History-Joppen.jpg\n| caption           = Early Maratha history c. 1680 showing the former jagirs of Shahji and the territories of Shivaji\n| image_size        = 320\n| campaignbox       =\n| partof            = Mughal–Maratha conflicts\n}}\nThe Deccan wars, also known as Mughal–Maratha wars, were a series of military conflicts between the Mughals and the Marathas after the death of Maratha Chhatrapati Shivaji in 1680 until the death of Mughal Emperor Aurangzeb in 1707. Shivaji was a central figure in what has been called \"the Maratha insurgency\" against the Mughal state. Both he and his son, Sambhaji (or Shambuji, typically), alternated between rebellion against the Mughal state and service to the Mughal sovereign in an official capacity. It was common practice in late 17th-century India for members of a ruling family of a small principality to both collaborate with and rebel against the Mughals.\nUpon Shivaji's death in 1680, he was immediately succeeded by Rajaram, his second-born son by his second wife. The succession was contested by Sambhaji, Shivaji's first-born son by his first wife, and quickly settled to his benefit by the murders of Rajaram's mother and the loyal courtiers favouring Rajaram's succession, and by Rajaram's imprisonment for the following eight years. Although Sambhaji's rule was riven by factions, he conducted several military campaigns in southern India and Goa.\nIn 1681, Sambhaji was contacted by Muhammad Akbar, son of Mughal Emperor Aurangzeb, who was keen to partner with the Marathas in order to assert his political power against his ageing father's continuing dominance. The prospects of an alliance incited Aurangzeb to move his household, court and army to the Deccan. Akbar spent several years under the protection of Sambhaji but eventually went into exile to Persia in 1686. In 1689 Sambhaji was captured by the Mughals, and executed at the age of 31. His death was a significant event in Indian history, marking the end of the golden era of the Maratha kingdom. Sambhaji's wife and minor son, later named Shahuji, were taken into the Mughal camp, and Rajaram, who was now an adult, was re-established as ruler; he quickly moved his base to Gingee, far into the Tamil country. From here, he was able to frustrate Mughal advances into the Deccan until 1700.\nIn 1707, Emperor Aurangzeb died. Although by this time the Mughal armies had regained total control over lands in the Deccan, their forts had been stripped bare of valuables by the exiting Marathas, who thereafter took to raiding Mughal territory in independently operating \"roving bands\". In 1719, Sambhaji's son, Shahu, who had been raised in the Mughal court, received the rights to the chauth (annual tax at 25% of the revenue) and sardeshmukhi (additional 10% levy) over the six Deccan provinces in exchange for maintaining a contingent of 15,000 troops for the Mughal emperor.\nMarathas under Sambhaji (1681–1689)\nled the Marathas for the first nine years of the Deccan Wars.]] Sambhaji was born in 1657 to Shivaji and his first wife, Saibai. He was trained in the art of warfare from a young age and was known for his bravery and military skills. After Shivaji's death in 1680, Sambhaji ascended to the throne of the Maratha Empire, which was resisting Mughal dominance. In the first half of 1681, several Mughal contingents were dispatched to besiege Maratha forts in present-day Gujarat, Maharashtra, Karnataka, and Madhya Pradesh.\nAt the time, the Mughal empire was experiencing tension between Emperor Aurangzeb and his son Sultan Muhammad Akbar. The Maratha Chhatrapati Sambhaji provided shelter to Akbar, which angered his father. On 8 September 1681, after settling a dispute with the royal house of Mewar, Aurangzeb began his journey to the Deccan to conquer the Maratha lands, as well as the sultanates of Bijapur and Golconda. He arrived at Aurangabad, the Mughal headquarters in the Deccan, and made it his capital. Mughal contingents in the region numbered about 500,000. It was a disproportionate war in all senses. By the end of 1681, the Mughal forces had laid siege to Fort Ramsej. Despite the onslaught, the Marathas prepared and defended against the attack, and it took the Mughals seven years to take the fort. Also in December 1681, Sambhaji attacked Janjira fort, but his first attempt failed. At the same time one of the Aurangzeb's generals, Husain Ali Khan, attacked Northern Konkan. Sambhaji left Janjira and attacked Husain Ali Khan and pushed him back to Ahmednagar. Meanwhile, Aurangzeb tried to sign a deal with the Portuguese to allow trade ships to harbour in Goa. This would have allowed him to open another supply route to Deccan via the sea. Upon learning this, Sambhaji attacked the Portuguese territories and forced them back to the Goan coast, but the viceroy of Alvor was able to defend the Portuguese headquarters. By this time the huge Mughal army had started gathering on the borders of Deccan. These actions heralded a large, sustained conflict in southern India.\nIn late 1683, Aurangzeb moved to Ahmednagar. He divided his forces in two and put his two princes, Shah Alam and Azam Shah, in charge of each division. Aurangzeb ordered Shah Alam to attack South Konkan via the Karnataka border while Azam Shah would attack Khandesh and northern Maratha territory. Using a pincer strategy, these two divisions planned to encircle the Marathas from the south and north to isolate them. Initially, this plan went quite well. Shah Alam crossed the Krishna river and entered Belgaum. From there he entered Goa and started marching north via Konkan. As he pushed further, Marathas forces continuously harassed him, ransacked his supply chains, and reduced his forces to starvation. Finally Aurangzeb sent Ruhulla Khan to his rescue and brought him back to Ahmednagar. The first pincer attempt therefore failed.\nAfter the 1684 monsoon, Aurangzeb's other general Shahbuddin Khan directly attacked the Maratha capital, Raigad. The Maratha commanders successfully defended Raigad. Aurangzeb sent Khan Jehan to help, but Hambirao Mohite, commander-in-chief of the Maratha army, defeated him in a fierce battle at Patadi. The second division of the Maratha army attacked Shahbuddin Khan at Pachad, inflicting heavy losses on the Mughal army.\nIn early 1685, Shah Alam again attacked south via the Gokak–Dharwar route but, succumbing again to continuous harassment by Sambhaji's forces, failed to close the loop for a second time. In April 1685, Aurangzeb changed his strategy. He planned to consolidate his power in the south by undertaking expeditions to the Muslim kingdoms of Golkonda and Bijapur, both allies of the Marathas and disliked by Aurangzeb. He broke his treaties with both kingdoms, attacked them, and captured them by September 1686. During this fighting, the Marathas saw an opportunity to counterattack, and launched an offensive on the North coast and attacked Bharuch. They were able to evade the Mughal army sent their way and returned with minimum damage. The Marathas also tried to win Mysore through diplomacy. Sardar Kesopant Pingle ran the negotiations, but the fall of Bijapur to the Mughals had turned the tide of the war and Mysore was reluctant to join the Marathas. Still, Sambhaji successfully courted several Bijapur sardars to join the Maratha army.\nExecution of Sambhaji\nAfter the fall of Bijapur and Golkonda, Aurangzeb turned his attention again to the Marathas, but his first few attempts had little impact. In January 1688, Sambhaji called together his commanders for a strategic meeting at Sangameshwar in Konkan to decide on the final blow to oust Aurangzeb from the Deccan. To execute the decision of the meeting quickly, Sambhaji sent ahead most of his comrades and stayed back with a few of his trustworthy men, including Kavi Kalash.\nGanoji Shirke, one of Sambhaji's brothers-in-law, turned traitor and helped Aurangzeb's commander Muqarrab Khan to locate, reach, and attack Sangameshwar while Sambhaji was still there. The relatively small Maratha force fought back but was surrounded. Sambhaji was captured on 1 February 1689 and a subsequent rescue attempt by the Marathas was repelled on 11 March. He was tortured and executed in Aurangzeb's camp on 11 March 1689. Subsequently, Sambhaji's wife and son (Shivaji's grandson) were held captive by Aurangzeb for twenty years.\nSambhaji's death gave the Marathas a newfound zeal and united them against their common foe, Mughal Emperor Aurangzeb. His death was a significant event in Indian history, and despite the Maratha resurgence it inspired, it is regarded to mark the end of the golden era of the Maratha Empire.\nMarathas under King Rajaram (1689–1700)\nBy end of 1689, Aurangzeb viewed the Marathas as all but dead, but this proved to be a near fatal blunder. The death of Sambhaji had rekindled the spirit of the Maratha forces, which made Aurangzeb's war aims impossible. Sambhaji's younger brother Rajaram was now given the title of chhatrapati (emperor). In March 1690, the Maratha commanders under the leadership of Santaji Ghorpade launched the single most daring attack on the Mughal army, sacking the tent where Aurangzeb himself slept. Aurangzeb was elsewhere, but his private force and many of his bodyguards were killed. This was followed by a betrayal in the Maratha camp. Raigad fell to the treachery of Suryaji Pisal, and the Mughals captured Sambhaji's widow, Yesubai, and their son, Shahu I.\nMughal forces, led by Zulfikar Khan, continued this offensive further south. They attacked Panhala Fort, where the Maratha killedar (fort commander) led a defence that inflicted heavy losses on Mughal army. Finally, Aurangzeb himself was obliged to attend the battle personally and Panhala was surrendered.\nMaratha capital moved to Jinji\nMaratha ministers realised that the Mughals would move on Vishalgad. They insisted that Rajaram leave Vishalgad for Senji (Gingee) (in present Tamil Nadu), which had been captured by Shivaji during his southern conquests and was now to be the new Maratha capital. Rajaram travelled south under escort of Khando Ballal and his men.\nAurangzeb was frustrated with Rajaram's successful escape. Keeping most of his force in Maharashtra, he sent a small number to keep Rajaram in check. This small force was destroyed by an attack from two Maratha generals, Santaji Ghorpade and Dhanaji Jadhav, who then they joined Ramchandra Bavadekar in Deccan. Bavdekar, Vithoji Chavan, and Raghuji Bhosale had reorganised most of the Maratha army after the defeats at Panhala and Vishalgad.\nIn late 1691, Bavdekar, Pralhad Niraji, Santaji, Dhanaji, and several Maratha sardars met in the Maval region and reformed the strategy. Aurangzeb had taken four major forts in Sahyadrais and was sending Zulfikar Khan to subdue the Ginjee fort. According to the new Maratha plan, Santaji and Dhanaji would launch offensives in the east to keep scattered the rest of the Mughal forces. Others would focus on Maharashtra and would attack a series of forts around southern Maharashtra and northern Karnataka in order to divide the Mughal-won territories in two, thereby posing a significant challenge to enemy supply chains. Having a strong navy established by Shivaji, the Marathas could also extend this divide into the sea, checking any supply routes from Surat to the South.\nNow war was fought from the Malwa Plateau to the east coast, in a strategy devised by the Maratha commanders to counter the strength of the Mughals. Maratha generals Ramchandrapant Amatya and Shankaraji Niraji maintained their Maratha stronghold in the rugged terrains of Sahyadri.\nThrough cavalry movements, the Marathan generals Santaji and Dhanaji defeated the Mughals. In the Battle of Athani, Santaji defeated Kasim Khan, a noted Mughal general.\nFall of Jinji (January 1698)\nAurangzeb by now had realised that the war he had started was much more serious than he had originally thought. After regrouping and restrategising, he sent an ultimatum to Zulfikar Khan to capture Jinji or be stripped of his titles. Zulfikar Khan tightened the siege, but Rajaram escaped and was safely escorted to Deccan by Dhanaji Jadhav and the Shirke brothers. Haraji Mahadik's son took command of Jinji and bravely defended the city against Julfikar Khan and Daud Khan until its fall in January 1698. This gave Rajaram ample amount of time to reach Vishalgad.\nAfter significant Mughal losses, Jinji was captured in a Pyrrhic victory. The fort had done its work: for seven years the three hills of Jinji had kept a large contingent of Mughal forces occupied while inflicting heavy losses. It had significantly depleted Mughal resources in the region, from the treasury to material.\nHowever, the Marathas soon experienced an unpleasant development of their own making. Dhanaji Jadhav and Santaji Ghorpade had a simmering rivalry, which was kept in check by the councilman Pralhad Niraji. But after Niraji's death, Dhanaji grew bold and attacked Santaji. Nagoji Mane, one of Dhanaji's men, killed Santaji. The news of Santaji's death greatly encouraged Aurangzeb and the Mughal army.\nYet by this time the Mughal army was no longer as formidable as earlier feared to be. Aurangzeb, against the advice of several of his experienced generals, continued the war.\nRevival of Maratha fortunes\nThe Marathas again consolidated and began a counteroffensive. Rajaram appointed Dhanaji Jadhav as commander-in-chief and the army was split into three divisions, which were headed by Dhanaji, Parshuram Timbak, and Shankar Narayan. Dhanaji defeated a large Mughal force near Pandharpur and Narayan defeated Sarja Khan in Pune. Khanderao Dabhade, who led a division under Dhanaji, took Baglan and Nashik, while Nemaji Shinde, a commander with Narayan, scored a major victory at Nandurbar.\nEnraged at these defeats, Aurangzeb took charge and launched another counteroffensive. He besieged Panhala and attacked the fort of Satara. A seasoned Maratha commander, Prayagji Prabhu, defended Satara for a good six months but surrendered in April 1700, just before the onset of the monsoon. This foiled Aurangzeb's strategy to clear as many forts as possible before the monsoon.\nMarathas under Tarabai\nIn March 1700, Rajaram died. His queen, Tarabai, who was daughter of the Maratha commander-in-chief Hambirrao Mohite, took charge of the Maratha army and continued fighting for the next seven years.\nduring the Battle of Satara]]\nAfter the Battle of Satara, Aurangzeb contested for every inch of Deccan region at great cost of life and money. Aurangzeb drove west, deep into Maratha territory, notably conquering Satara (the Maratha capital), while the Marathas expanded eastwards into Mughal lands (Hyderabad State). Aurangzeb waged continuous war in the Deccan for more than two decades with no resolution and thus lost about a fifth of his army.\nSigns of strain were showing in the Mughal camp in late 1701. Asad Khan, Julfikar Khan's father, counselled Aurangzeb to end the war and turn around. The expedition had already taken a giant toll, much larger than originally planned, on the empire and it seemed possible that 175 years of Mughal rule might crumble due to the drain of an unwinnable war.\nBy 1704, Aurangzeb conquered Torana, Rajgad, and a handful of other forts mostly by bribing Maratha commanders; however, he had spent four precious years doing so. He began to realise that even after 24 years of constant war, he was not successfully annexing the Maratha State.\nThe final Maratha counteroffensive gathered momentum in the North, where Mughal provinces fell one by one, unable to defend themselves due to depleted royal treasuries and a lack of armies. In 1705, two Maratha army factions crossed Narmada. One, under the leadership of Nemaji Shinde, hit as far north as Bhopal; the second, headed by Khanderao Dabhade, struck Bharoch and the west. With his 8,000 men, Dabhade attacked and defeated Mahomed Khan's forces numbering almost fourteen thousand. This left entire Gujarat coast wide open for the Marathas. They immediately tightened their grip on Mughal supply chains. By the end of 1705, Marathas had penetrated the Mughal possessions of Central India and Gujarat. Nemaji Shinde defeated Mughals on the Malwa Plateau. In 1706, Mughals started retreating from Maratha dominions.\nIn Maharashtra, Aurangzeb became despondent. He started negotiations with the Marathas, then cut them abruptly and marched on the small kingdom of Wakinara whose Naik rulers traced their lineage to the royal family of the Vijayanagar Empire. His new opponents had never been fond of the Mughals and had sided with the Marathas. Dhanaji marched into Sahyadris and quickly won back almost all the major forts, while those of Satara and Parali were taken by Parshuram Timbak, and Sinhgad by Narayan. Dhanaji then turned to help the Naiks at Wakinara; Wakinara fell but the Naik royal family escaped.\nAurangzeb's death\nAurangzeb had now given up all hope and planned a retreat to Burhanpur. Dhanaji attacked and defeated his rearguard, but Aurangzeb was able to reach his destination with the help of Zulfikar Khan. He died of a fever on  1707.\nAftermath of the war\nbecame a major power in the Indian sub-continent after the 1720s. The above map is of 1760.]]\nThe Marathas expanded their territory to include Malwa after the Battle of Delhi and Battle of Bhopal in 1737. By 1757, the Maratha Empire had reached Delhi.\nThe Mughal empire was split into regional kingdoms, with the Nizam of Hyderabad, Nawab of Oudh, and Nawab of Bengal quick to assert the nominal independence of their lands. Anxious to divert the Marathas away from his Deccan strongholds, and to save himself from the Mughal emperor of North India's hostile attempts to suppress his independence, the Nizam encouraged the Marathas to invade Malwa and the North Indian territories of the Mughal Empire. In the Maasir-i Nizami, the Nizam writes that he could use the Marathas to his own advantage:\nI consider all this army (Marathas) as my own and I will get my work done through them. It is necessary to take our hands off Malwa. God willing, I will enter into an understanding with them and entrust the Mulukgiri (raiding) on that side of the Narmada to them.\nThe Mughal–Maratha wars had a significant impact on the political and social landscape of India. The wars weakened both the Mughal and Maratha Empires, paving the way for European colonial powers to establish themselves in India. The wars also contributed to the decline of the Mughal Empire, which was already facing internal political and economic challenges. The Marathas, on the other hand, emerged as a major power in India, and their influence continued to grow in the 1700s.\nSee also\n* Military history of India\n* List of wars involving India\n* Rajput War (1679–1707)\n* Maratha Army\nReferences"
    }
  ]
}