{
  "content": [
    {
      "type": "text",
      "text": "# Decline and end of the Cucuteni–Trypillia culture\n\n}}\n'' XXIv.4 (2005), pp. 313&ndash;338.]]\nDue partly to the fact that this took place before the written record of this region began, there have been a number of theories presented over the years to fill the gap of knowledge about how and why the end of the Cucuteni–Trypillia culture  happened. These theories include invasions from various groups of people, a gradual cultural shift as more advanced societies settled in their region, and environmental collapse.\nEnd of the Copper Age\nIn the larger perspective, the end of the Cucuteni-Trypillia culture marked the boundary between the Copper Age and the Bronze Age. The Copper Age, also known as the Eneolithic and Chalcolithic periods, lasted in Europe from roughly 3500 to 1700 BC. However, it ended for this culture between 3000 and 2750 BC. There is no firm point in time when this happened, since it was done over a period of many years, as first one area and then another would become integrated into the new Bronze Age civilization. Because the Cucuteni-Trypillia society was almost entirely egalitarian (with no ruling elite), there was no dramatic change of government for the whole region, as is the case when modern nations go to war and are defeated. The Cucuteni-Trypillia settlements existed independently from each other, so each experienced its own separate fate as the end of their culture swept over them, making the transition to the Bronze Age a complex and gradual process, rather than as a result of a single event.\nAlthough there were many other Neolithic and Eneolithic cultures in eastern Europe during this time, the Cucuteni-Trypillia was probably the most advanced and influential, due to its robust settlements, highly refined ceramic art, and location. This culture was situated astride the natural \"highway\" between Central Asia and Europe, which may have directly contributed to its demise as other cultures from the east moved into this region following the route across the grassy plains that lie to the north and northwest of the Black Sea. Because the Cucuteni-Trypillia culture was so robust, it continued to spread into new regions as new settlements were built to accommodate the increasing population. This was especially the case in the latter period of its existence, when Cucuteni-Trypillia settlements began to pop up across the unsettled region of what is today western Ukraine.\nThe Old European culture and the Kurgan hypothesis\nIn the 1950s, as a result of the cultural renaissance that was part of the Khrushchev Thaw that took place after Joseph Stalin's death in 1953, a massive program of archaeological excavations was sponsored by the Soviet Union, which included Cucuteni-Trypillia sites that are located in the now-independent nations of Ukraine and Moldova. As Soviet scholars began publishing their findings and analyses from these excavations, a new model began to emerge among some members of the international academic community that revised the way that scholars had perceived how the Cucuteni-Trypillia culture ended, among other things. This new model inspired the creation of two theories that came to be known as the Old European culture and the Kurgan hypothesis. Some of the more notable people who helped to formulate and support these theories included:\n* Marija Gimbutas (January 23, 1921 – February 2, 1994): a Lithuanian archaeologist and author of the 1956 book The prehistory of eastern Europe. Gimbutas coined the phrase Old European culture to describe the indigenous Neolithic European peoples. According to Gimbutas, these people were peaceful and goddess- and woman-centered (matristic). She then proposed that the Bronze Age Proto-Indo-Europeans (from the Kurgan culture), who she claimed were patriarchal (androcratic) and warlike, invaded southeast Europe from the eastern steppes, and brought destruction to the formerly peaceful European societies.\n* Joseph Campbell (March 26, 1904 – October 31, 1987): an American comparative mythologist and author of the 1959 book The masks of God. Campbell and Gimbutas worked together in formulating these theories; both of their personal collections of books and papers are today housed in [https://web.archive.org/web/20100926155553/http://www.pacifica.edu/innercontent-m.aspx?id=1750 The Joseph Campbell and Marija Gimbutas Library] on the Lambert campus in Carpinteria, California, as part of the [https://web.archive.org/web/20100324225145/http://www.opusarchives.org/individual.shtml OPUS Archives and Research Center] of the Pacifica Graduate Institute.\n* Luigi Luca Cavalli-Sforza (January 25, 1922 – August 31, 2018): an Italian population geneticist and author of the article Analysis of human evolution Cavalli-Sforza used the different human blood types as a means to create a model of human racial dispersion and historical migration patterns through the application of genetics. He attempted (among other things) to substantiate Gimbutas' claim of an Indo-European conquest of the indigenous Neolithic European peoples by comparing blood types of present-day Europeans. Although highly controversial, Cavalli-Sforza's work was undeniably groundbreaking and genuinely innovative, and lay the foundation for the subsequent science of human genetic haplogroup research.\n* A generation of Indo-Europeanist linguists who began in the 1950s to recover a sense of historical depth to the Proto-Indo-European language, linking it with Gimbutas' theories of Indo-European conquest to explain how this family of languages was dispersed throughout Europe.\nTo illustrate these two theories, the table below juxtaposes the Cucuteni-Trypillia culture, which Gimbutas included as one of the Old European culture societies, against the Yamna culture (also known as the Pit grave culture), which was the society that Gimbutas suggested was the most likely candidate for being the Proto-Indo-European group that was active in the first wave of the Kurgan conquests of Old European cultures. Here, then, are the basic details about these two cultures, according to Gimbutas:\n{| class=\"wikitable\"\n|+ Comparison of Cucuteni-Trypillia and Yamna cultures\n|-\n! Comparison\n! Cucuteni-Trypillia culture\n! Yamna culture\n|-\n! Origins\n| Blending of the Boian culture, with some traces of the Hamangia culture (both originally from Anatolia), and the Musical note culture (also known as the Middle Linear Pottery culture, or \"LBK\"), from the northern Subcarpathian region of southeastern Poland and western Ukraine; all of which were Neolithic and non-Indo-European.\n| An amalgam of Eneolithic Proto-Indo-European tribes from the southern region of the great Pontic steppe, mostly along river valleys, including (from west to east) the Dniester, the Bug, the Dnieper, the Donetz, the Don, West Manych, and the middle Volga rivers.\n|-\n! Agricultural model\n| Sedentistic subsistence agriculture\n| Pastoral nomadism\n|-\n! Social stratification\n| Egalitarian acephalous society\n| Tribal chiefdom with social hierarchical levels\n|-\n! Economic model\n| Generalized reciprocity or gift economy\n| Traditional economy featuring trade bartering\n|-\n! Division of labour\n| No occupational specialization, each household produced all necessary goods and services independently.\n| Many specialized occupations, including priests, warriors, healers, metalsmiths, traders, herders, and slaves.\n|-\n! Technological Sophistication\n| Superior work in agricultural techniques, as well as in ceramics, compared to the Yamna. Cucuteni-Trypillia ceramics have been found in Yamna sites.\n| Superior work in copper metalworking than the Cucuteni-Trypillia during the Eneolithic. Later, the Yamna worked in brass, and some of their brass artifacts have been found in Cucuteni-Trypillia sites. The Yamna also used domestic horses for travel, which the Cucuteni-Trypillia culture most likely did not have.\n|-\n! Militarization\n| Almost no artifacts have been found that would have been meant for defense against a human enemy. No skeletal remains have been found that would indicate the person had been killed with a weapon. Only at the end of their culture did they begin to build walls and ditches around their settlements, yet still no weapons have been found.\n| The Yamna perfected military weapons, rode domesticated horses, and probably conducted raids against other peoples regularly. Many weapons have been found in their grave sites. In addition, they also constructed hill-top fortresses, similar to the Medieval Motte-and-bailey design.\n|-\n! Religion\n| The archaeological record indicates the worship of a female fertility goddess. There is also evidence to indicate that they used clay fetishes in various ritualistic purposes, ranging from fertility to sigils for protection against evil spirits or human enemies.\n| There is evidence to indicate that they probably participated in ritual human sacrifice of captured enemies. They worshipped a warlike male deity.\n|-\n! Trade network\n| Very rudimentary trade network involving only a handful of goods, the most important of which was salt. No indication of traders or merchants as a profession. Some evidence does indicate the possible use of barter tokens as an early form of exchange.\n| An extensive trade network spanning a large region from central and southeast Europe to modern-day Kazakhstan and Russia, involving many trade goods, and indication of a class of merchants and traders.\n|-\n! Encounters with each other\n| Starting around 4500 BC, Cucuteni-Trypillia settlements began to appear in western Ukraine, where they encountered Yamna tribes. Some scholars hold that this is partly the cause for the creation of very large settlements in this region, to aid in defense against Yamna raids.\n| Also beginning around 4500 BC, the Yamna culture began to establish settlements as far west as Transylvania, which existed side-by-side with Cucuteni-Trypillia settlements.\n|}\nGimbutas believed that the expansion of the Kurgan culture was conducted as a series of hostile, military conquests. Gimbutas wrote:The process of Indo-Europeanization was a cultural, not a physical, transformation. It must be understood as a military victory in terms of successfully imposing a new administrative system, language, and religion upon the indigenous groups. Gimbutas pointed out how the extinction of the Cucuteni-Trypillia culture coincided with the 3rd Wave of Kurgan expansion, c. 3000–2800 BC, which saw the Kurgans move en masse into modern-day Romania, Bulgaria, and eastern Hungary. This matched the archaeological evidence that showed that the Cucuteni-Trypillia settlements (some of which were the largest in the world at the time), were all abandoned by 2750 BC, marking the end of the culture.\nTaken together, the Kurgan hypothesis and the Old European culture theories presented a compelling story that directly went against the prevalent image of prehistoric cultures (especially cultures that existed outside of the traditional \"Cradle of Civilization\" in the Fertile Crescent) as \"primitive\", wild, half-starved savages. These theories were more fully developed during the cultural upheavals of the 1960s, and were received with tremendous support by many people, especially by many of the younger college students who were exposed to them. Additionally, the theories were greatly acclaimed by supporters of the anti-war Peace Movement in the U.S., and the burgeoning Feminist Movement, who saw in these ancient Neolithic cultures a model of how human society could exist without war, and how women could be treated with equal status as men. Moreover, the other image of the warlike, patriarchal Indo-European invaders who brought death and destruction to a peaceful, egalitarian people resonated as well with the members of these movements, during a time when the U.S. was involved in an unpopular war in Vietnam. So strongly did these theories affect some people, that they provided much of the foundation for the creation of the Neopagan religious movement, that still views the writings of Gimbutas and Campbell with high regard.\nThroughout the next few decades, the Kurgan hypothesis was the dominant theory on the subject of the end of the Cucuteni-Trypillia culture (among other related subjects of this period). Although today there are many who have challenged the Kurgan hypothesis, it still stands as a critically important theory that anyone interested in this historical period must confront. The theory's basic elements still offer substantial insights for students of history, regardless of how strongly they ultimately agree with its conclusions.\nGradual assimilation theory\nIn 1989 the Irish-American Indo-Europeanist J. P. Mallory published his work In Search of the Indo-Europeans, which presented very similar arguments to Gimbutas, though much fewer. They were presented as counter-arguments to the Kurgan hypothesis, understood in a much more narrow sense than Gimbutas had elaborated. In his work, Mallory provides evidence to support the claim already found in a similar way in Gimbutas (for instance, pp.&nbsp;357; on page 362, a section is called \"The Coexistance of Kurgan Pastoralists and Cucuteni Agriculturalists\"), that the Kurgan culture was existing side-by-side along with the Cucuteni-Trypillia culture for about two-thousand years. He, like Gimbutas, demonstrates how there were Kurgan settlements as far west into the Cucuteni-Trypillia region as Transylvania, and postulates that the two cultures would have intermingled:Ethnographic evidence suggests a very fluid boundary between mobile and settled communities, and it is entirely probable that some pastoralists may have settled permanently whilst Tripoleans may have become integrated into the more mobile steppe communities. The resultant archaeological evidence certainly suggests the creation of hybrid communities. By the middle of the fourth millennium B.C. we witness the transformation of Late Tripolye groups into new cultural entities. Probably the most noted is the Usatovo culture which occupied the territory from the lower Dniester to the mouth of the Danube...In some aspects the culture retains traditional Tripolye styles of painted wares and figures. But, in addition, there also appears...a considerable series of daggers, along with axes, awls and rings, including rings made from silver which is a metal we would attribute to the Proto-Indo-Europeans. The Usatovo culture (which existed from 3500 to 3000 BC) thus provides very substantial evidence to support Gimbutas' and Mallory's claim of a gradual transformation from Cucuteni-Trypillia to different Kurgan cultures, such as Yamna or Usatovo.\nThese Kurgan tribes and others, like the German tribes invading Roman territory much later, were - as Mallory points out - different in some aspects and dimensions of their basic cultural gestalts. The Kurgan tribes - as Gimbutas had empirically shown, see above - shared basic cultural features, such as horseriding, authoritarian philosophy, hierarchical, a paternalistic social structure including patrilinearity, elite architectural structures, women and children with lower status, a religion around a sun-god instead of understanding nature as a basic fundamental gestalt, warfare, especially from a horse, which necessitated the same set of weapons adapted over time in order to keep being ahead in military effectiveness relative to their opponents: spear, axe, long knife, bow, and arrows.\nEcological collapse\nThe sudden disappearance of the gigantic Cucuteni-Trypillia settlements is seen as a switch from an extensive agricultural and mixed economy to one placing more emphasis on herding the livestock, particularly cattle. Although this coincided neatly with Gimbutas' theory of a complete cultural conquest by the Kurgan culture, which was pastoral, over the Cucuteni-Trypillia, which was agricultural, there may be another explanation for it based on what happened to the climate and environment towards the end of the Cucuteni-Trypillia culture's existence.\nBeginning in 1975, with V. Danilenko and M. Shmaglij, scholars began to write about the Eneolithic as a time of \"violation of equilibrium between society and the ambient environment.\" Ecological deterioration was beginning to accrue after millennia of farming and deforestation took their toll, making what had once been a land that was bursting with abundance and fertile soil into a relative desert of overworked soil, similar to the Dust Bowl of the American Great Plains during the 1930s.\nAnother important factor was that the late period of the Cucuteni-Trypillia culture witnessed a very dramatic shift in world climate. For the entire duration of this culture's history, the earth had been going through what paleoclimatologists have called the Holocene climatic optimum, which lasted from 7000 to 3200 BC. During this time, the earth was both warmer and wetter than it has been at any time since the end of the last Ice Age, making conditions optimal for growing crops.\nHowever, beginning around 3200 BC, the Earth's climate began to become significantly more arid and cool. This resulted in the Sub-Boreal phase, which created the worst and longest drought in Europe since the end of the last Ice Age. It also was the point when the region in north Africa that had been a land of forests and grassy plains was turned into the largest desert in the world. This must have had a tremendous effect on the Cucuteni-Trypillia culture, which relied entirely on subsistence farming to feed the enormous populations in their massive settlements. Without resources to feed their people, this culture would have most certainly collapsed, and there is much speculation among scholars that if this was not the most significant factor in this culture's demise, that it played an absolutely critical role in bringing it about.\nAccording to The American Geographical Union: \"The transition to today's arid climate was not gradual, but occurred in two specific episodes. The first, which was less severe, occurred between 6,700 and 5,500 years ago. The second, which was brutal, lasted from 4,000 to 3,600 years ago. Summer temperatures increased sharply, and precipitation decreased, according to carbon-14 dating. This event devastated ancient civilizations and their socio-economic systems.\"\nReferences\nWorks cited\n*\nExternal links\n* [http://www.culture.gouv.fr/culture/arcnat/harsova/en/balk4.htm Cucuteni Culture] The French Government's Ministry of Culture's page on Cucuteni Culture (in English).\n* [http://www.dacia.org/Dacian_Virtual_Museum/The_Earlyest/the_earlyest.html Cucuteni Culture] The Romanian Dacian Museum page on Cucuteni Culture (in English)."
    }
  ]
}