{
  "content": [
    {
      "type": "text",
      "text": "# Declaration of Independence of the Turkish Republic of Northern Cyprus__disambig_1\n\n|date_ratified=\n|location_of_document=Northern Cyprus\n|writer=Turan Fevzioğlu, Osman Ertuğ, Necati Münir Ertekün, Tugay Uluçevik\n|signers=40 Turkish-Cypriot parliament members\n|purpose=Emphasizing independence, freedom, and sovereignty of Turkish Cypriots, and realising self-determination of the nation\n}}\nThe declaration of Independence of the Turkish Republic of Northern Cyprus was a unilateral declaration of independence (UDI) from the Republic of Cyprus by the Turkish Cypriot parliament on 15 November 1983.\nEight years after the Turkish Federated State of Cyprus was proclaimed (in 1975), the declaration of North Cyprus was presented to the Turkish Cypriot parliament in North Nicosia by Turkish Cypriot Leader and Northern Cypriot State President Rauf Denktaş on 15 November 1983. Containing text espousing human rights and a desire to live side-by-side with the Greek Cypriot population, it ended with a declaration that Northern Cyprus was an independent and sovereign state, naming the entity the Turkish Republic of Northern Cyprus (TRNC). The Turkish Cypriot Parliament passed a unanimous resolution later that day ratifying the declaration.\nBackground\nPrior to 1960, the island of Cyprus was a British colony, having been taken from the Ottoman Empire during the First World War. The London and Zurich Agreements of 1959 provided for a constitution for an independent Cyprus which divided the population into ethnic-based communities, in which the President would be elected by Greek Cypriots and the Vice President elected by Turkish Cypriots. There would also be a national legislature called the House of Representatives to which the Greek and Turkish Cypriots would elect their own representatives, and a 10-member Council of Ministers of which 3 members would be Turkish Cypriots.\nThe Treaty of Guarantee, signed in 1960 by Cyprus, Greece, Turkey and the United Kingdom, banned Cyprus from entering into any political or economic union with another state. It also required the other signatories to guarantee Cypriot independence and territorial integrity, and to this end allowed the guarantor powers to take unilateral action to uphold the status quo in Cyprus. The treaty also allowed the United Kingdom to retain sovereignty over its military bases on the island.\nBy 1963, the constitutional framework began to fall apart when the legislature split along communal lines and became deadlocked. Greek-Cypriot President Makarios III proposed constitutional amendments to end the deadlock, which were strongly opposed by the Turkish-Cypriot leadership and the government of Turkey. The Turkish-Cypriot members consequently withdrew from the Council of Ministers, the House of Representatives and the civil service. President Makarios refused any solutions that would result in the partition of Cyprus.\nIn July 1974, a coup d'etat backed by the military dictatorship in Greece overthrew President Makarios and installed Nikos Sampson as president, declaring their intention to form a political union with Greece. Turkey, claiming to be exercising its right to unilateral intervention under the Treaty of Guarantee, then invaded the island in two stages beginning on 20 July 1974. By August 1974 the northern part of the island - including the northern half of the capital, Nicosia - were under Turkish occupation. The United Nations Buffer Zone in Cyprus was established along the ceasefire line.\nThe Autonomous Turkish Cypriot Administration was created on 1 October 1974, and on 13 February 1975 the Turkish Federated State of Cyprus was declared. It was intended for this declaration to be the first step towards a federated Turkish Cypriot state, and that the Greek Cypriots would eventually declare their own federated state within a newly unified Cyprus. The declaration however was rejected by the Republic of Cyprus and the United Nations, although it was not regarded as a declaration of independence. The goal of a federated Turkish Cypriot state was abandoned after eight years of failed negotiations, resulting in the 1983 declaration of independence.\nReactions\nThe United Nations Security Council issued two resolutions (541 and 550) proclaiming that the Turkish Cypriot UDI was legally invalid and requesting that no other sovereign state should recognise the declaration and asked for its withdrawal.\nRecognition\nUN member states\nTurkey formally recognized Northern Cyprus on the day its UDI was declared, and is currently the only UN member state to recognise the independence of Northern Cyprus.\nSub-national entities\nThe parliament of the Nakhichevan Autonomous Republic, which is a self-governing exclave of Azerbaijan, has issued a resolution recognising the TRNC as a sovereign nation.\nDecision of the ICJ on declarations of independence\nOn 22 July 2010, the United Nations' International Court of Justice (ICJ) issued a non-legally-binding decision (in relation to Kosovo) that \"International law contains no prohibition on declarations of independence\"; see Political status of Kosovo. The ruling was expected to bolster demands for recognition by Northern Cyprus. The decision of the ICJ has also been regarded as opening more potential options for the TRNC to gain international legitimacy.\nRelevant Court Cases\nInternational law contains no prohibition on declarations of independence, and the recognition of a country is a political issue.\nInternational Courts\n* No prohibition of declarations of independence in international law: On 22 July 2010, The International Court of Justice (ICJ) stated in its advisory opinion on Kosovo's declaration of independence in 2010 that \"the Security Council in an exceptional character attached illegality to the DOI of TRNC because it was, or would have been connected with the unlawful use of force\" and \"general international law contains no applicable prohibition of declarations of independence\".\n:The ICJ's ruling was expected to bolster demands for recognition by Northern Cyprus. The decision of the ICJ has also been regarded as opening more potential options for the TRNC to gain international legitimacy.\n* '''Legality of the acts of the TRNC's authorities: On 2 July 2013, The European Court of Human Rights (ECtHR) decided that \"...notwithstanding the lack of international recognition of the regime in the northern area, a de facto recognition of its acts may be rendered necessary for practical purposes. Thus the adoption by the authorities of the \"TRNC\" of civil, administrative or criminal law measures, and their application or enforcement within that territory, may be regarded as having a legal basis in domestic law for the purposes of the Convention\".\n* The legality, independence, and impartiality of the TRNC's courts: On 2 September 2015, The European Court of Human Rights (ECtHR) decided that \"...the court system set up in the \"TRNC\" was to be considered to have been \"established by law\" with reference to the \"constitutional and legal basis\" on which it operated, and it has not accepted the allegation that the \"TRNC\" courts as a whole lacked independence and/or impartiality\".\n* The difference of TRNC than Transnistria, Abkhazia, and Crimea: On 25 June 2024, The European Court of Human Rights (ECtHR) [Ukraine v. Russia Case (Crimea); Applications 20958/14 and 38334/18] explained the reasons for the legality of the actions of TRNC laws in the north of Cyprus under the ECtHR framework (Why the situation of the TRNC differs from that of Crimea, Transnistria, and Abkhazia):\n** 930.  Whereas the Court held that \"TRNC Domestic Law\" was based on the Anglo-Saxon legal tradition and was therefore accepted as \"law\" for the purposes of the Convention''', in cases concerning Transdniestria (the \"MRT\"), the Court found \"no basis for assuming that [in the 'MRT'] there is a system reflecting a judicial tradition compatible with the Convention similar to the one in the remainder of the Republic of Moldova\". The Court has reached similar conclusions regarding the \"law\" of Abkhazia and the \"lawfulness\" of Abkhaz courts.\n** 932.  Moreover, while the \"MRT\" and Abkhaz-related cases concerned the \"law\" of unrecognised entities that did not reflect \"a judicial tradition ... similar to the one in the remainder of the Republic of Moldova\" or \"to the rest of Georgia\" respectively, in Cyprus v. Turkey (merits) the Court held that \"The civil courts operating in the 'TRNC' were in substance based on the Anglo-Saxon tradition and were not essentially different from the courts operating before the events of 1974 and from those which existed  in the southern part of Cyprus\". This particular aspect makes the latter case similar, yet different from the present case. The Cyprus v. Turkey case concerned the continued application of pre-existing Cypriot law valid in the territory of the \"TRNC\" before Turkey had obtained actual control of that territory, whereas the present case concerns the application in Crimea of the law of the Russian Federation (or the \"law\" of the local authorities, as its derivative) replacing the previously applicable and valid Ukrainian law.\nCourts of Countries\n* The United States of America (USA): On 9 October 2014, the Federal Court of the United States (USA) stated that \"the TRNC purportedly operates as a democratic republic with a president, prime minister, legislature and judiciary...The TRNC is NOT vulnerable to a lawsuit in Washington.\".\n: Greek Cypriot Toumazou applied to the USA Court of Appeals. The USA Court of Appeals rejected Toumazou, too on 15.01.2016\n: After the US Federal Court called and qualified TRNC as \"Democratic Republic\" and the USA Court of Appeals affirmed the decision, The United States Sectetary of State has started to describe the TRNC as the Area Administered by Turkish Cypriots\n* The United Kingdom (UK): On 3 February 2017, The United Kingdom's High Court stated, \"There was no duty in the United Kingdom law upon the Government to refrain from recognizing Northern Cyprus. The United Nations itself works with Northern Cyprus law enforcement agencies and facilitates co-operation between the two parts of the island\". It determined that the co-operation between the United Kingdom police and law agencies in Northern Cyprus is legal.\nSee also\n* Federated state\n* Annan Plan\nReferences"
    }
  ]
}