{
  "content": [
    {
      "type": "text",
      "text": "# Dee and Glenkens (ward)\n\n|elects_howmany=3\n|councillor1=Andy McFarlane\n|party1=Scottish National Party\n|councillor2=John Denerley\n|party2=Scottish Conservative and Unionist Party\n|councillor3=Dougie Campbell\n|party3=Independent (politician)\n|towns=Kirkcudbright\n|scot_parl=Galloway and West Dumfries\n|scot_region=South Scotland\n|westminster=Dumfries and Galloway\n}}\nDee and Glenkens is one of the twelve electoral wards of Dumfries and Galloway Council. Created in 2017, the ward elects three councillors using the single transferable vote electoral system and covers an area with a population of 10,594 people.\nThe area has produced strong results for the Conservatives who have won more than a third of the vote at each election.\nBoundaries\nThe ward was created by the Local Government Boundary Commission for Scotland following the Fifth Statutory Reviews of Electoral Arrangements ahead of the 2017 Scottish local elections. Five of the 13 multi-member wards in Dumfries and Galloway were abolished as a result of the review and replaced by four new ones. Dee and Glenkens encompasses an area represented by the former Dee and Castle Douglas and Glenkens wards. The ward takes in an area in the centre of the council area from the boundary with East Ayrshire at Loch Doon to Kirkcudbright Bay in the Irish Sea and the Solway Firth. It is situated within Galloway and takes in part of the historic county of Kirkcudbrightshire. The ward includes the towns of Kirkcudbright, St John's Town of Dalry, New Galloway and Gatehouse of Fleet as well as the villages of Carsphairn, Balmaclellan, Laurieston, Ringford, Twynholm, Dundrennan and Auchencairn. The ward takes its name from The Glenkens – an area within the historic county of Kirkcudbrightshire centred around the River Ken and Loch Ken – and the River Dee which flows through the south of the ward.\nCouncillors\n{|class=\"wikitable\" style=\"text-align:center\"\n!Election\n!colspan=8|Councillors\n|-\n!2017\n|rowspan=2; style=\"background-color: \"|\n|Patsy Gilroy(Conservative)\n|style=\"background-color: \"|\n|rowspan=2|Dougie Campbell(SNP/Ind.)\n|style=\"background-color: \"|\n|Jane Maitland(Ind.)\n|-\n!2022\n|John Denerley(Conservative)\n|style=\"background-color: \"|\n|style=\"background-color: \"|\n|Andy McFarlane(SNP)\n|}\nElection results\n2022 election\n2017 election\n2017 Dumfries and Galloway Council election\nReferences"
    }
  ]
}