{
  "content": [
    {
      "type": "text",
      "text": "# Defence Academy of the United Kingdom__disambig_1\n\n|campus            = Rural\n|former_names      =\n|free_label        =\n|free              =\n|sports            =\n|colors            =\n|colours           =\n|nickname          =\n|mascot            =\n|athletics         =\n|affiliations      =\n|website           =\n|logo              =\n|footnotes         =\n}}\nThe Defence Academy of the United Kingdom provides higher education for personnel in the British Armed Forces, Civil Service, other government departments and service personnel from other nations.\nStructure\nThe Defence Academy has its headquarters at what used to be the Royal Military College of Science site at Shrivenham in southwestern Oxfordshire, though the present campus also extends into the neighbouring village of Watchfield; it delivers education and training there and in a number of other sites. Much of the training is postgraduate including Master of Science courses.\nThe Chief Executive and Commandant of the Defence Academy is Major General Peter Rowell, a senior British Army officer.\nDelivery units and locations\nTraining is delivered by:\n* Royal College of Defence Studies (RCDS), Seaford House, Belgravia, London\n* Joint Services Command and Staff College (JSCSC),\n* Defence College for Military Capability Integration (DCMCI)\n* Armed Forces Chaplaincy Centre (AFCC), Shrivenham\n* Defence Centre of Training Support (DCTS), Shrivenham\n* Defence Leadership and Business (DLAB) Group\n* International Group, which comprises the Defence Centre for Languages & Culture (DCLC), the Defence Attaché and Loan Service Centre (DALSC) and the International Section, with the affiliated Building Integrity section\n* Centre of Air Safety Training (Military Aviation Authority) (CoAST)\nFormer locations\n* Welbeck Abbey, Nottinghamshire (until 2005)\n* Welbeck Defence Sixth Form College, Leicestershire (2005–2021)\n* Armed Forces Chaplaincy Centre (AFCC), Amport House, Amport, Hampshire (1957–2020)\nGovernance\nAcademic provision is delivered through partnering agreements with Cranfield University and King's College London.\nDirectors General:\n* 2002–2005: Sir Roger Jackling\n* 2005–2008: Lieutenant General Sir John Kiszely, late Scots Guards\n* 2008–2011: Lieutenant General Andrew Graham, late Argyll and Sutherland Highlanders\n* 2011–2014: Peter Watkins\n* 2014–2018: Vice Admiral Duncan Potts\n* 2018–2021: Air Marshal Edward Stringer\n* 2021–2024: Air Marshal Ian Gale\nChief Executives and Commandants:\n* 2022–2024: Major General Andrew Roe\n* 2024–present Major General Peter Rowell\nReferences\nExternal links\n*"
    }
  ]
}