{
  "content": [
    {
      "type": "text",
      "text": "# DeKalb County Confederate Monument\n\n| location     = Decatur, Georgia, United States\n| height       =\n| dedicated    = 1908\n| dedicated_to = Confederate States of America\n}}\nThe DeKalb County Confederate Monument is a Confederate memorial that formerly stood in Decatur, Georgia, United States. The  was erected by the United Daughters of the Confederacy near the old county courthouse in 1908.\nDescription\nThe text on the base of the monument read as follows:\nSouth Face: \"Erected by the men and women and children of Dekalb County, to the memory of the soldiers and sailors of the Confederacy, of whose virtues in peace and in war we are witnesses, to the end that justice may be done and that the truth perish not.\"\nWest Face: \"After forty two years another generation bears witness to the future that these men were of a covenant keeping race who held fast to the faith as it was given by the fathers of the Republic. Modest in prosperity, gentle in peace, brave in battle, and undespairing in defeat, they knew no law of life but loyalty and truth and civic faith, and to these virtues they consecrated their strength.\"\nNorth Face: \"These men held that the states made the union, that the Constitution is the evidence of the covenant, that the people of the State are subject to no power except as they have agreed, that free convention binds the parties to it, that there is sanctity in oaths and obligations in contracts, and in defense of these principles they mutually pledged their live, their fortunes, and their sacred honor.\"\nEast Face: \"How well they kept the faith is faintly written in the records of the armies and the history of the times. We who knew them testify that as their courage was without a precedent their fortitude has been without a parallel. May their prosperity be worthy.\"\nHistory\nOn June 12, 2020, following activism by the protest group Beacon Hill Decatur and Decatur High School students, the removal of the monument was ordered by Superior Court Justice Clarence Seeliger on the grounds that it constituted a public nuisance under the Georgia code. The monument, removed on June 18, was among a number of memorials removed following the murder of George Floyd in Minneapolis in May 2020. Several days later, a statue of Thomas Jefferson was also removed from near the courthouse.\nIn January 2021, city officials announced plans to erect a statue of politician and activist John Lewis where the monument stood, by Basil Watson. The statue was unveiled in August 2024.\nSee also\n* List of monuments and memorials removed during the George Floyd protests\nReferences"
    }
  ]
}