{
  "content": [
    {
      "type": "text",
      "text": "# Delaware River Joint Toll Bridge Commission\n\n| preceding1 =\n| preceding2 =\n| jurisdiction = Pennsylvania and New Jersey, U.S.\n| headquarters = 1199 Woodside RoadYardley, Pennsylvania 19067\n| employees =\n| budget =\n| chief1_name = Joseph Resta\n| chief1_position = Executive Director\n| chief2_name = Aladar G. Komjathy\n| chief2_position = Chairman\n| chief3_name = Pam Janvey\n| chief3_position = Vice chairwoman\n| chief4_name =\n| chief4_position =\n| chief5_name =\n| chief5_position =\n| chief6_name =\n| chief6_position =\n| chief7_name =\n| chief7_position =\n| chief8_name =\n| chief8_position =\n| chief9_name =\n| chief9_position =\n| parent_department =\n| parent_agency =\n| website =\n| footnotes =\n}}\nThe Delaware River Joint Toll Bridge Commission (DRJTBC) is a bistate, public agency that maintains and operates river crossings connecting the U.S. states of Pennsylvania and New Jersey. The agency's jurisdiction stretches roughly  along the Delaware River from Philadelphia and Bucks County in southeast Pennsylvania and then north through the Lehigh Valley and to Pennsylvania-New York state border.\nDRJTBC operates eight toll bridges and 12 toll-supported (free) bridges, two of which are pedestrian-only crossings, and 34 approach structures throughout its jurisdiction.  Revenues from the eight toll bridges subsidize the other bridges. Since 1987, the commission has not received any state or federal tax revenues and relies solely on toll collections for its financing.\nIn 2019, more than 138 million cars and trucks used the DRJTBC's network of Delaware River bridge crossings.\nHistory\nNorthampton Street Bridge, operated by the commission, connects [[Easton, Pennsylvania and Phillipsburg, New Jersey, which are separated by the Delaware River]]\nbefore Express E-ZPass lanes were installed]]\nThe DRJTBC was established under legislation enacted in the two states on December 18, 1934. The federal compact for what was then called the \"Pennsylvania-New Jersey Joint Bridge Commission\" was first approved by Congress in 1935. The compact has been modified several times (on July 8, 1947, July 17, 1951, July 16, 1953, and March 19, 1986). In 1984 and 1985, the states of Pennsylvania and New Jersey entered into the current version of the interstate compact, known as the \"1984 agreement.\"\nThis change meant that DRJTBC no longer would receive tax dollars to maintain the commissions toll-supported bridges, known as tax-supported bridges until the 1984 agreement. The commission assumed full financial responsibility for their toll-free bridges. Later revisions also made it so that the DRJTBC could build the Interstate 78 Bridge over the Delaware River and operate it as a tolled crossing.\nA board of 10 unpaid commissioners govern the Delaware River Joint Toll Bridge Commission, with five coming from each state. In New Jersey, members are nominated by the New Jersey governor and confirmed by the New Jersey Senate for three-year terms. In Pennsylvania, five members are appointed by the Pennsylvania governor and serve at his pleasure. They meet monthly to review reports, provide oversight and set policies carried out by the executive director and professional staff.\nThe commission charges a $3.00 cash auto toll ($1.50 for E-ZPass users) on its eight toll bridges, as of January 24, 2024. Discounts were available for frequent commuters equipped with E-ZPass, however this program ended on January 1, 2024.  Until 2021, the DRJTBC charged the same rate for cash and E-ZPass users. Truck tolls range from $9 to $35, depending on axle type, time of travel and whether E-ZPass is used. Tolls are collected only from traffic crossing into Pennsylvania. As of June 2021, an all-electronic toll is charged on some of the bridges. The commission is a member of the Interagency Group, a regional collaborative of toll-collection agencies that offer E-ZPass electronic toll collection services.\nIn November 2013, the commission voted to merge E-ZPass operations with the New Jersey E-ZPass Customer Service Center as a cost-cutting measure. The commission was the last agency in the Delaware Valley to implement a monthly service fee.\nBridges\nFrom north to south:\n* Milford–Montague Toll Bridge - (toll) (US 206)\n:The Milford–Montague Toll Bridge (also known as the US 206 Toll Bridge) is a truss bridge crossing the Delaware River, connecting Montague Township, New Jersey to Milford, Pennsylvania on U.S. Route 206.\n* Delaware Water Gap Toll Bridge - (toll) (I-80)\n:The Delaware Water Gap Toll Bridge (also known as the Interstate 80 Toll Bridge) is a toll bridge that carries Interstate 80 across the Delaware River at the Delaware Water Gap, connecting Hardwick Township, Warren County, New Jersey, and Delaware Water Gap, Monroe County, Pennsylvania, in the United States.The 2,465-foot-long (751 m) bridge is a multiple span dual roadway with a steel plate structure. The roadways are 28 feet (8.5 m) wide each and separated from each other by a concrete Jersey barrier.\n* Portland–Columbia Pedestrian Bridge - (pedestrian)\n:The Portland–Columbia Pedestrian Bridge (formally known  as the Portland-Columbia Toll Supported Pedestrian Bridge) is a footbridge that crosses the Delaware River, at Portland, in Upper Mount Bethel Township, Pennsylvania, connecting to Columbia, in Knowlton Township, New Jersey.\n* Portland–Columbia Toll Bridge - (toll) (Route 94)\n:The Portland–Columbia Toll Bridge is a toll bridge that carries New Jersey Route 94 (which ends at the Pennsylvania State Line over the river) over the Delaware River, between  Pennsylvania Route 611 at Portland, Pennsylvania, and Columbia in Knowlton Township, New Jersey.\n* Riverton–Belvidere Bridge\n:The Riverton–Belvidere Bridge is a bridge crossing the Delaware River, connecting Belvidere, New Jersey in the east with Riverton, Pennsylvania in the west. There is no toll for crossing on either side; tolls were abolished by the Joint Commission for the Elimination of Toll Bridges in 1929. The bridge is 653 feet (199 m) long, holding a load of 8 short tons (16,000 lb) of traffic from County Route 620 Spur (Water Street) in Belvidere to former Pennsylvania Route 709 on the Riverton side.\n* Easton–Phillipsburg Toll Bridge - (toll) (US 22)\n:The Easton–Phillipsburg Toll Bridge is a modified Pennsylvania (Petit) through truss bridge that carries U.S. Route 22 over the Delaware River. The bridge is between Easton, Pennsylvania and Phillipsburg, New Jersey.  The main river bridge consists of a 540-foot (160 m) Petit through-truss span over the river; a 430-foot (130 m), five-span plate-girder viaduct at the New Jersey approach; and a 40-foot (12 m) pre-stressed concrete boxbeam span over Pennsylvania Route 611 on the Pennsylvania approach.\n* Northampton Street Bridge\n:The Northampton Street Bridge is a bridge that crosses the Delaware River, connecting Easton, Pennsylvania, and Phillipsburg, New Jersey. It is known locally as the \"Free Bridge\" thus distinguishing it from the Easton–Phillipsburg Toll Bridge just upstream to the north. The crossing was first a ferry crossing run by David Martin, beginning in 1739.\n* Interstate 78 Toll Bridge - (toll) (I-78)\n:The Interstate 78 Toll Bridge carries Interstate 78 across the Delaware River between Williams Township, Pennsylvania and Phillipsburg, New Jersey. It opened on November 21, 1989 and is one of the newest bridges across the Delaware River.\n* Riegelsville Bridge\n:The Riegelsville Bridge is a suspension bridge crossing the Delaware River connecting Riegelsville, Pennsylvania with Riegelsville, New Jersey.\n* Upper Black Eddy–Milford Bridge\n:The Upper Black Eddy–Milford Bridge is a free bridge over the Delaware River. The bridge carries Bridge Street, connecting CR 519 in Milford, Hunterdon County, New Jersey, with Pennsylvania Route 32 in Upper Black Eddy, Bucks County, Pennsylvania.\n*Uhlerstown–Frenchtown Bridge - (Route&nbsp;12)\n:The Uhlerstown–Frenchtown Bridge is a free bridge over the Delaware River. The bridge carries Bridge Street, connecting New Jersey Route 12 in Frenchtown, Hunterdon County, New Jersey, with Pennsylvania Route 32 in Uhlerstown, located in Tinicum Township, in Bucks County, Pennsylvania.\n*Lumberville–Raven Rock Bridge - (pedestrian)\n:The Lumberville–Raven Rock Bridge, also known as the Lumberville Foot Bridge,  is a free pedestrian bridge over the Delaware River. The bridge connects Bull's Island Recreation Area near Raven Rock, Delaware Township in Hunterdon County, New Jersey to Lumberville, Solebury Township in Bucks County, Pennsylvania. The bridge, which is one of the two exclusively pedestrian bridges over the Delaware River.\n*Centre Bridge–Stockton Bridge - (PA&nbsp;263 / CR&nbsp;523)\n:The Centre Bridge–Stockton Bridge is a free bridge over the Delaware River. The bridge connects CR 523 and NJ 29 in Stockton, in Hunterdon County, New Jersey to PA 263 in Centre Bridge, Solebury Township, Bucks County, Pennsylvania.\n*New Hope–Lambertville Toll Bridge - (toll) (US&nbsp;202)\n:The New Hope–Lambertville Toll Bridge carries U.S. Route 202 (US 202) over the Delaware River, connecting Delaware Township in Hunterdon County, New Jersey, with Solebury Township in Bucks County, Pennsylvania. The bridge opened in 1971, was built and is currently operated by the Delaware River Joint Toll Bridge Commission. The commission is also responsible for maintenance and operation of the interchanges with Route 29 in New Jersey and Pennsylvania Route 32 (PA 32) on the Pennsylvania side.\n*New Hope–Lambertville Bridge - (PA&nbsp;179 / Route&nbsp;179)\n:The New Hope–Lambertville Bridge, officially called the New Hope–Lambertville Toll Supported Bridge, is a six-span, 1,053-foot (321 m)-long bridge spanning the Delaware River that connects the city of Lambertville in Hunterdon County, New Jersey with the borough of New Hope in Bucks County, Pennsylvania. The current steel truss bridge was constructed in 1904 at a cost of $63,818.81.\n*Washington Crossing Bridge - (PA&nbsp;532 / CR&nbsp;546)\n:Washington Crossing Bridge (officially the Washington Crossing Toll Supported Bridge) is a truss bridge spanning the Delaware River that connects Washington Crossing, Hopewell Township in Mercer County, New Jersey with Washington Crossing, Upper Makefield Township in Bucks County, Pennsylvania.\n]]\n* Scudder Falls Toll Bridge - (toll) (I-295)\n:The Scudder Falls Bridge carries Interstate 295 (I-295) over the Delaware River, connecting Lower Makefield Township in Bucks County, Pennsylvania, with the Scudders Falls section of Ewing Township in Mercer County, New Jersey.The original bridge was a plate girder bridge constructed from 1958 to 1961. Previously, the bridge was a toll-free crossing. However, this changed on July 14, 2019, when an all-electronic toll was levied for Pennsylvania-bound traffic; the toll can be paid using E-ZPass or Toll-by-Plate.\n*Calhoun Street Bridge\n:The Calhoun Street Toll Supported Bridge (also known as the Trenton City Bridge) is a historic bridge connecting Calhoun Street in Trenton, New Jersey across the Delaware River to East Trenton Avenue in Morrisville, Bucks County, Pennsylvania. It was constructed by the Phoenix Bridge Company of Phoenixville, Pennsylvania, in 1884.  The bridge was part of the Lincoln Highway until 1920 (when the highway was moved to the free Lower Trenton Bridge).\n*Lower Trenton Bridge - (Business US&nbsp;1)\n:The Lower Trenton Toll Supported Bridge, commonly called the Lower Free Bridge, Warren Street Bridge or Trenton Makes Bridge, is a two-lane Pennsylvania (Petit) through truss bridge over the Delaware River between Trenton, New Jersey and Morrisville, Pennsylvania. It is known as the Trenton Makes Bridge because of large lettering on the south side reading \"TRENTON MAKES   THE WORLD TAKES\", installed in 1935. In addition to being an important bridge from Pennsylvania to New Jersey, it is a major landmark in the city of Trenton. It is signed as US 1 Business, though does not officially carry that route.\n*Trenton–Morrisville Toll Bridge - (toll) (US&nbsp;1)\n:The Trenton–Morrisville Toll Bridge is one of three road bridges connecting Trenton, New Jersey with Morrisville, Pennsylvania. Opened on December 1, 1952, it carries U.S. Route 1 (US 1).\nThe commission also maintains 34 minor structures, including overpasses and underpasses.\nSee also\n*List of crossings of the Delaware River\n*Interstate compact\nReferences\nExternal links\n*[http://www.drjtbc.org/about/ Delaware River Joint Toll Bridge Commission]"
    }
  ]
}