{
  "content": [
    {
      "type": "text",
      "text": "# Delaware Student Excellence Equals Degree Program Scholarship\n\nThe Delaware Student Excellence Equals Degree Program Scholarship (Delaware SEED Scholarship) is intended to provide free college tuition to Delaware residents seeking to earn an Associate degree at in-state colleges Delaware Tech and the University of Delaware. Any Delaware high school graduate after 2006 is eligible to apply given certain criteria.\n__TOC__\nCriteria\nThe criteria to be awarded are:\n# Must be a resident of Delaware and planning/are to be a full time student.\n# Must not have been convicted of any felony.\n# Have already applied for other forms of financial aid.\n# Must have graduated from a Delaware High School and have obtained a 2.5 GPA in high school (on a 4.0 scale).\n#* The student must maintain at least a 2.5 GPA throughout college as well.\n# Gain admission to Delaware Tech or the University of Delaware and satisfy their respective admissions standards.\n#* A Delaware Tech student is not eligible for the scholarship if they've been admitted \"by special admission standards.\"\n# Must attend college classes no later than the fall semester after high school.\n# Must be eligible for the scholarship under their admitted colleges implemented criteria.\nIf the student lived in foster care while 16 - 18 years old, points 4 and 6 do not apply. In this case the student must have started their Associates degree before the age of 25 and take no more than 5 years to obtain it.\nIn order to maintain eligibility and funding for the scholarship, a student must:\n# Earn at least 24 credits as a full time student per year.\n#* This requirement has been waived due to the COVID-19 pandemic.\n#* If the student has lived in foster care while 16 - 18 years old, this requirement does not apply.\n# Maintain continuous enrollment of at least 2 semesters per year.\n#* The college may grant an exception and waive this requirement.\n# Maintain a college GPA of at least 2.5.\n#* The college may grant an exception and waive this requirement.\n# The student’s family must certify that the student has not been convicted of a felony.\nSee also\n* University of Delaware\n*Delaware Technical Community College\n*Associate degree\nReferences"
    }
  ]
}