{
  "content": [
    {
      "type": "text",
      "text": "# Delaware Route 286\n\n|map_custom=yes\n|map_notes=DE 286 in red\n|length_mi=1.73\n|length_round=2\n|length_ref=\n|maint=DelDOT\n|established=1994\n|direction_a=West\n|direction_b=East\n|terminus_a= near Chesapeake City, MD\n|terminus_b= near Summit Bridge\n|counties=New Castle\n|previous_type=DE\n|previous_route=279\n|next_type=I\n|next_route=295}}\nDelaware Route&nbsp;286 (DE&nbsp;286), also known as Bethel Church Road, is a  two-lane undivided state highway in New Castle County, Delaware. The route runs from the Maryland border, where the road becomes Maryland Route&nbsp;286 (MD&nbsp;286), east to DE&nbsp;15. The route passes through rural areas with some homes. DE&nbsp;286, along with MD&nbsp;286 and DE&nbsp;15, forms a link between Chesapeake City, Maryland, and Summit Bridge, Delaware. The road was paved in the 1930s and became DE&nbsp;286 in the 1990s.\nRoute description\nDE&nbsp;286 begins at the Maryland border, where the road continues west into that state as MD&nbsp;286 toward the town of Chesapeake City, and continues east on two-lane undivided Bethel Church Road through farmland. A short distance later, the road runs between residential developments. The road then passes between homes to the north and rural areas to the south before becoming lined with farms on both sides. DE&nbsp;286 reaches its eastern terminus at DE&nbsp;15, which heads south on Choptank Road and northeast on Bethel Church Road, at a roundabout. DE&nbsp;286 has an annual average daily traffic count of 4,597&nbsp;vehicles.\nHistory\nBy 1920, what is now DE&nbsp;286 existed as an unimproved county road. The road in Delaware was paved by 1936 and served as part of the route between Summit Bridge and Chesapeake City. Bethel Church Road from the state line east to DE&nbsp;15 was designated DE&nbsp;286 around 1994, extending the number from MD 286. On November&nbsp;20,&nbsp;2009, a roundabout opened at the eastern terminus at DE&nbsp;15.\nMajor intersections\n|notes=Maryland state line; western terminus\n}}\n|notes=Roundabout; eastern terminus\n}}\nSee also\n*\nReferences\nExternal links\n* [https://www.aaroads.com/guides/de-286/ DE&nbsp;286 at AARoads.com]"
    }
  ]
}