{
  "content": [
    {
      "type": "text",
      "text": "# Delaware Township, Grant County, Minnesota\n\n|postal_code_type         =\n|postal_code              =\n|area_code                =\n|blank_name               = FIPS code\n|blank_info               = 27-15508\n|blank1_name              = GNIS feature ID\n|blank1_info              = 0663958\n|website                  =\n|footnotes                =\n}}\nDelaware Township is a township in Grant County, Minnesota, United States. The population was 119 at the 2000 census.\nDelaware Township was organized in 1879. A large share of the first settlers being natives of the state of Delaware caused the name to be selected.\nGeography\nAccording to the United States Census Bureau, the township has a total area of , of which  is land and  (2.42%) is water.\nDemographics\nAs of the census of 2000, there were 119 people, 47 households, and 32 families residing in the township. The population density was . There were 53 housing units at an average density of . The racial makeup of the township was 100.00% White.\nThere were 47 households, out of which 38.3% had children under the age of 18 living with them, 66.0% were married couples living together, 2.1% had a female householder with no husband present, and 29.8% were non-families. 25.5% of all households were made up of individuals, and 10.6% had someone living alone who was 65 years of age or older. The average household size was 2.53 and the average family size was 3.00.\nIn the township the population was spread out, with 26.9% under the age of 18, 5.9% from 18 to 24, 27.7% from 25 to 44, 25.2% from 45 to 64, and 14.3% who were 65 years of age or older. The median age was 42 years. For every 100 females, there were 112.5 males. For every 100 females age 18 and over, there were 112.2 males.\nThe median income for a household in the township was $46,875, and the median income for a family was $52,500. Males had a median income of $27,500 versus $27,750 for females. The per capita income for the township was $19,196. There were 5.3% of families and 9.6% of the population living below the poverty line, including 11.1% of under eighteens and none of those over 64.\nReferences"
    }
  ]
}