{
  "content": [
    {
      "type": "text",
      "text": "# Delaware Route 896\n\n|map_custom=yes\n|length_mi=21.13\n|length_round=2\n|length_ref=\n|maint=DelDOT and USACE\n|established=1938\n|direction_a=South\n|terminus_a= in Boyds Corner\n|junction= in Mount Pleasant\n* in Summit Bridge\n* near Summit Bridge\n* in Glasgow\n* near Newark\n* in Newark\n* in Newark\n* in Newark\n}}\n|direction_b=North\n|terminus_b= near Newark\n|counties=New Castle\n|previous_type=I\n|previous_route=895\n|next_type=DE\n|next_route=1\n}}\nDelaware Route&nbsp;896 (DE&nbsp;896) is a state highway located in New Castle County, Delaware. The route runs from U.S. Route&nbsp;13 (US&nbsp;13) in Boyds Corner north to the Maryland border northwest of Newark, where the road becomes unsigned Maryland Route&nbsp;896 (MD&nbsp;896) briefly before heading into Pennsylvania as Pennsylvania Route&nbsp;896 (PA&nbsp;896). The route heads west from US&nbsp;13 before turning north along with DE&nbsp;71 in Mount Pleasant, crossing the Chesapeake & Delaware Canal on the Summit Bridge. After the bridge, DE&nbsp;71 splits off to the east and the road continues to Glasgow, where it comes to an intersection with US&nbsp;40. DE&nbsp;896 continues north and interchange with Interstate&nbsp;95 (I-95) before reaching Newark, where it bypasses the University of Delaware to the west by following DE&nbsp;4, Elkton Road, and South Main Street. DE&nbsp;896 comes to downtown Newark and continues northwest to the Maryland border. DE&nbsp;896 has a business route, DE&nbsp;896 Business (DE&nbsp;896 Bus.), that passes through Glasgow, and had an alternate alignment south of Glasgow called DE&nbsp;896 Alternate (DE&nbsp;896 Alt.).\nDE&nbsp;896 was originally built as a state highway during the 1920s and 1930s. By 1938, the route was designated between DE&nbsp;71 in Summit Bridge and the Maryland border northwest of Newark. In the 1950s, the route was extended to US&nbsp;13 south of Townsend, following DE&nbsp;71 to Middletown and replacing a part of that route south of there. Between the 1950s and 1990s, various alignments of US&nbsp;301, US&nbsp;301N, and US&nbsp;301S followed DE&nbsp;896. In the 1980s, DE&nbsp;896 was realigned to head from Mount Pleasant to US&nbsp;13 in Boyds Corner, with DE&nbsp;71 later being extended down the former route past Middletown. Also around this time, DE&nbsp;896 was rerouted to bypass the University of Delaware to the west. A bypass of Glasgow was completed in the 1990s. The concurrency with US&nbsp;301 between Mount Pleasant and Glasgow was removed in 2019.\nRoute description\nDE&nbsp;896 begins at an intersection with US&nbsp;13 in Boyds Corner, heading west on two-lane undivided Boyds Corner Road. East of US&nbsp;13, the road becomes unnumbered Pole Bridge Road and reaches an interchange with the DE&nbsp;1 toll road. From the southern terminus, DE&nbsp;896 runs through agricultural areas with some residential subdivisions and woods. The route passes under the US&nbsp;301 toll road, where it has ramps for emergency vehicles but no public access. The road crosses the Delmarva Central Railroad's Delmarva Subdivision line at-grade and comes to an intersection with DE&nbsp;71 in Mount Pleasant.\nHere, DE&nbsp;896 turns north to form a concurrency with DE&nbsp;71 on Summit Bridge Road, a four-lane divided highway. The road runs between the Summit Airport to the west and housing developments to the east. DE&nbsp;71/DE&nbsp;896 heads to the northwest through farm fields before turning to the west and passing a residential subdivision to the south. In the unincorporated community of Summit Bridge, the road intersects the northern terminus of DE&nbsp;15. Past this intersection, DE&nbsp;71/DE&nbsp;896 turns north and crosses over the Chesapeake & Delaware Canal and the Michael N. Castle Trail on the north bank of the canal on the Summit Bridge, a cantilever truss bridge.\nPast the Summit Bridge, the road runs through woods and crosses under Chesapeake City Road before passing east of the Delaware Veterans Memorial Cemetery. DE&nbsp;71 splits from DE&nbsp;896 by turning to the southeast on Red Lion Road. DE&nbsp;896 continues north through residential neighborhoods and fields and passes to the west of Lums Pond State Park. The road reaches Glasgow, where it curves northeast to bypass the community to the east with DE&nbsp;896 Bus. heading north into Glasgow. DE&nbsp;896 heads to the east of Hodgson Vo-Tech High School and curves northwest to intersect US&nbsp;40.\nFollowing this intersection, DE&nbsp;896 continues northwest as South College Avenue to the west of Glasgow Park, crossing Muddy Run and coming to a southbound ramp that provides access to DE&nbsp;896 Bus. at the north end of Glasgow. The road passes through industrial and business areas with a few homes, heading to the west of Glasgow High School before intersecting Old Baltimore Pike. The route heads through wooded areas to the east of Iron Hill Park before reaching a partial cloverleaf interchange with I-95 (Delaware Turnpike). Past this interchange, DE&nbsp;896 crosses the Christina River and enters the city of Newark, running northwest past businesses. The route curves north and crosses West Chestnut Hill Road/Old Chestnut Hill Road, with a reverse jughandle controlling movements between northbound DE&nbsp;896 and westbound West Chestnut Hill Road, before it reaches an intersection with DE&nbsp;4. A park and ride lot is located at the southeast corner of this intersection.\nAt this point, DE&nbsp;896 turns west to join DE&nbsp;4 on the four-lane divided Christiana Parkway, passing to the south of the University of Delaware's Science, Technology, and Advanced Research campus. The road narrows into a three-lane undivided road with two eastbound lanes and one westbound lane, curving to the northwest and coming to bridges over Amtrak's Northeast Corridor railroad line and the Christina River. Christiana Parkway reaches an intersection with the northern terminus of DE&nbsp;279, where DE&nbsp;4 ends and DE&nbsp;896 continues northeast on Elkton Road. DE&nbsp;896 becomes a four-lane divided highway that crosses the Christina River again and heads into residential areas. The road changes names to South Main Street and becomes undivided as it passes businesses before reaching downtown Newark.\nHere, DE&nbsp;896 intersects DE&nbsp;273, with the road splitting into a one-way pair. Northbound DE&nbsp;896 becomes concurrent with eastbound DE&nbsp;273 on West Delaware Avenue, heading to the east, while southbound DE&nbsp;896 remains along South Main Street, also concurrent with eastbound DE&nbsp;273. The one-way pair carries two lanes in each direction. Northbound DE&nbsp;896 soon turns north onto two-way South College Avenue, which carries two northbound lanes and one southbound lane as it passes through the University of Delaware campus. The northbound direction of the route turns west (along westbound DE&nbsp;273 on West Main Street), reaching the end of South Main Street, which it left earlier due to one-way streets. Here, northbound DE&nbsp;896 continues northwest onto one-way New London Road, carrying one lane, while southbound DE&nbsp;896 follows DE&nbsp;273 on two-way, two-lane West Main Street.\nSoon after, both directions of the route cross CSX's Philadelphia Subdivision railroad line at-grade as it leaves the downtown area and enters residential neighborhoods. New London Road becomes two-way carrying both directions of DE&nbsp;896, with southbound DE&nbsp;896 running southwest on two-way North Hillside Road to get to DE&nbsp;273 and continue east. The two-lane undivided DE&nbsp;896 heads northwest and crosses Bogy Run, heading between the Newark Country Club to the west and the University of Delaware to the east before running through wooded areas of residential development. The route becomes undivided again as it leaves Newark, passing to the west of White Clay Creek State Park and heading through the community of Mechanicsville. DE&nbsp;896 continues to its northern terminus at the Maryland border, where the road briefly traverses the northeast corner of that state as MD&nbsp;896 before heading north into Pennsylvania as PA&nbsp;896.\nDE&nbsp;896 has an annual average daily traffic count ranging from a high of 48,492&nbsp;vehicles at the I-95 interchange to a low of 3,783&nbsp;vehicles at the intersection with Cleveland Avenue in Newark. The portion of DE&nbsp;896 south of DE&nbsp;273 is part of the National Highway System.\nHistory\nWhat is now DE&nbsp;896 originally existed as a county road by 1920, with the portion between Boyds Corner and Mount Pleasant proposed as a state highway at that time. Four years later, the state highway between Boyds Corner and Mount Pleasant was completed while the rest of the route was paved. A year later, the road was upgraded to a state highway between Mount Pleasant and Summit Bridge. In 1936, the road became a state highway between Summit Bridge and Glasgow; at this time none of present-day DE&nbsp;896 was assigned a route number. On December&nbsp;21,&nbsp;1936, the grade crossing with the Pennsylvania Railroad (now Amtrak's Northeast Corridor) along College Avenue in Newark was replaced with a bridge over the tracks. In 1938, the state highway between Glasgow and Newark was built on a new alignment, bypassing a narrow winding alignment that ran further to the east along what is now Old Cooch's Bridge Road. This road was built to give Newark a better road connection to places further south.\nDE&nbsp;896 was designated by 1938 to run from DE&nbsp;71 in Summit Bridge north to the Maryland border northwest of Newark, passing through Newark on College Avenue and New London Road. At the state line, the road briefly became MD&nbsp;278 before becoming PA&nbsp;896 in Pennsylvania. MD&nbsp;278 became MD&nbsp;896 in 1942 to match DE&nbsp;896 and PA&nbsp;896.\nDE&nbsp;896 was extended south to US&nbsp;13 south of Townsend by 1957, following DE&nbsp;71 between Summit Bridge and Middletown and replacing DE&nbsp;71 between Middletown and US&nbsp;13. Two years later, US&nbsp;301S was designated along DE&nbsp;71/DE&nbsp;896 between Summit Bridge and Middletown. The route was realigned to a new Summit Bridge a short distance to the west in 1960, with a part of the former DE&nbsp;896 north of the bridge becoming a part of a realigned US&nbsp;301S/DE&nbsp;71. The US&nbsp;301S designation along DE&nbsp;71/DE&nbsp;896 between Middletown and Summit Bridge became US&nbsp;301 in 1971, with US&nbsp;301N being designated along DE&nbsp;896 between Summit Bridge and US&nbsp;40 in Glasgow. The Christiana Parkway around the southern edge of Newark was completed in September&nbsp;1983.\nBy 1984, DE&nbsp;896 was realigned to run from Mount Pleasant to US&nbsp;13 in Boyds Corner along its current alignment. The former alignment south of Middletown became unnumbered at the time but would become part of DE&nbsp;71 again by 1990. A year later, US&nbsp;301 was rerouted to follow DE&nbsp;896 between Mount Pleasant and Boyds Corner, with US&nbsp;301N being removed from the route between Summit Bridge and Glasgow and US&nbsp;301 removed from the route between Mount Pleasant and Summit Bridge. In 1988, DE&nbsp;896 was routed to bypass the University of Delaware campus by heading west along the Christiana Parkway with DE&nbsp;4 and then northeast on DE&nbsp;2 before continuing along New London Road. By 1990, DE&nbsp;2 was routed to follow DE&nbsp;4 and DE&nbsp;896 on the Christiana Parkway and DE&nbsp;2 Bus. was designated along with DE&nbsp;896 on Elkton Road.\nIn 1992, US&nbsp;301 was realigned to follow DE&nbsp;896 between Mount Pleasant and Glasgow. By 1996, DE&nbsp;896 was rerouted to bypass Glasgow to the east, with the former alignment becoming DE&nbsp;896 Bus. In 2012, the Newark city council voted in favor of renaming the portion of Elkton Road carrying DE&nbsp;2 Bus./DE&nbsp;896 between West Park Place and West Main Street to South Main Street in order to promote businesses along this stretch of road. The change went into effect January&nbsp;1,&nbsp;2013. In 2013, the DE&nbsp;2 and DE&nbsp;2 Bus. concurrencies were removed from DE&nbsp;896 in order to simplify the route designations through Newark. The concurrency with US&nbsp;301 between Mount Pleasant and Glasgow was removed when the US&nbsp;301 toll road opened on January&nbsp;10,&nbsp;2019.\nThere are plans to reconstruct the interchange with I-95 by adding two flyovers and realigning ramps in order to improve safety and congestion at the interchange. A groundbreaking ceremony was held on May 1, 2023, with Governor John Carney, Senator Tom Carper, Representative Lisa Blunt Rochester, and DelDOT Secretary Nicole Majeski in attendance. The reconstruction project, which is projected to cost $143&nbsp;million, began on May 7, 2023, and is planned to be completed in 2026. The project received a $57 million grant from the United States Department of Transportation which allowed construction to begin earlier than originally planned.\nThere are plans to widen the section of DE&nbsp;896 between US&nbsp;13 in Boyds Corner and the Cedar Lane Road/Jamison Corner Road intersection into a four-lane divided highway.\nMajor intersections\n|notes=Southern terminus\n}}\n|notes=South end of DE&nbsp;71 concurrency\n}}\n|notes=Northern terminus of DE&nbsp;15\n}}\n|notes=North end of DE&nbsp;71 concurrency\n}}\n|notes=Southern terminus of DE&nbsp;896 Bus.\n}}\n|notes=\n}}\n|notes=Southbound exit; northern terminus of DE&nbsp;896 Bus.\n}}\n|notes=I-95 exit&nbsp;1\n}}\n|notes=South end of DE&nbsp;4 concurrency\n}}\n|notes=North end of DE&nbsp;4 concurrency; western terminus of DE&nbsp;4; northern terminus of DE&nbsp;279\n}}\n|notes=South end of DE&nbsp;273 eastbound concurrency\n}}\n|notes=North end of DE&nbsp;273 eastbound concurrency\n}}\n|notes=South end of DE&nbsp;273 westbound concurrency\n}}\n|notes=North end of DE&nbsp;273 westbound concurrency\n}}\n|notes=Maryland state line; northern terminus\n}}\nSpecial routes\nDE 896 Business\nDelaware Route&nbsp;896 Business (DE&nbsp;896 Bus.) is a  long business route of DE&nbsp;896 that passes through Glasgow. The route begins at an intersection with DE&nbsp;896 south of Glasgow, heading north on two-lane undivided Glasgow Avenue into residential areas. The road runs immediately to the west of DE&nbsp;896 before that road curves to the northeast. The business route passes to the west of Hodgson Vo-Tech High School before it heads into commercial areas, passing east of the Peoples Plaza shopping center and intersecting US&nbsp;40. Past this, DE&nbsp;896 Bus. heads into rural areas of homes and comes to a dead end at which point there is a ramp from southbound DE&nbsp;896 to DE&nbsp;896 Bus. that crosses Muddy Run. It uses the old alignment of DE&nbsp;896, and was created by 1996 following the completion of the current DE&nbsp;896 bypass to the east of town.\nMajor intersections\n|notes=Southern terminus\n}}\n|notes=\n}}\n|notes=Northern terminus; dead end northbound; ramp from DE&nbsp;896 southbound to DE&nbsp;896 Bus. southbound\n}}\nFormer DE 896 Alternate\nDelaware Route&nbsp;896 Alternate (DE&nbsp;896 Alt.) was an alternate route of DE 896 from near its southern terminus in Boyds Corner north to Glasgow. The route headed north from Boyds Corner concurrent with US&nbsp;13 on the four-lane divided Dupont Parkway, passing through rural areas with some development. In Biddles Corner, the alternate route split from US&nbsp;13 and headed north along DE&nbsp;1, a four-lane freeway that crosses the Chesapeake & Delaware Canal on the Senator William V. Roth Jr. Bridge. DE&nbsp;896 Alt. followed DE&nbsp;1 to the interchange with DE&nbsp;72, where it continued west along with DE&nbsp;72 on two-lane undivided Wrangle Hill Road. The road headed through suburban areas and intersected DE&nbsp;71, curving northwest and north before reaching an intersection with US&nbsp;40. At this point, the alternate route headed west concurrent with US&nbsp;40 on the four-lane divided Pulaski Highway, passing through developed areas to the south of Glasgow Park. DE&nbsp;896 Alt. ended at an intersection with US&nbsp;301/DE&nbsp;896 on the eastern edge of Glasgow.\nMajor intersections\n|notes=Southern terminus; south end of US&nbsp;13 overlap; southern terminus of DE&nbsp;896\n}}\n|notes=North end of US&nbsp;13 overlap; south end of DE&nbsp;1 overlap; DE&nbsp;1 exit&nbsp;148\n}}\n|notes=North end of DE&nbsp;1 overlap; south end of DE&nbsp;72 overlap; DE&nbsp;1 exit&nbsp;152\n}}\n|notes=\n}}\n|notes=North end of DE&nbsp;72 overlap; south end of US&nbsp;40 overlap\n}}\n|notes=Northern terminus; north end of US&nbsp;40 overlap; northern terminus of US&nbsp;301\n}}\nSee also\n*\nReferences\nExternal links\n* [https://www.aaroads.com/guides/de-896/ DE&nbsp;896 at AARoads.com]\n* [https://www.alpsroads.net/roads/de/de_896/ Delaware Roads - DE&nbsp;896]"
    }
  ]
}