{
  "content": [
    {
      "type": "text",
      "text": "# Delaware River Greenway Partnership\n\nThe Delaware River Greenway Partnership (DRGP) is a non-profit organization, created in 1989 and located in Stockton, New Jersey, in the historic Prallsville Mills complex. DRGP's mission is to promote cross-river connections and communication, and to preserve and enhance the natural and historic resources of the lower Delaware River in both New Jersey and Pennsylvania.\nHistory\nThe Partnership was established in 1989 as an offshoot of the Bucks County Conservancy (now the Heritage Conservancy),  a coalition of organizations attempting to protect open space and resources along the Delaware River. In 1989, it led the coalition study of the river which earned the Lower Delaware designation as a Federal Wild and Scenic River.  In 2000, in coordination with the National Park Service and the Wild and Scenic Management Committee, it produced and implemented the first Wild and Scenic Management Plan.\nProjects\nDelaware River Water Trail\nThe Delaware River Water Trail, which is managed and sponsored by the Partnership, includes guided access points and day use and camping sites for the boating public. It provides trip planning information that considers the river as a whole system, where and how to navigate it safely and appropriately, and how to protect its resources. This water trail covers almost 200 miles of the entire freshwater portion of the Delaware River, from Hancock, New York to Trenton, New Jersey/Morrisville, Bucks County, Pennsylvania\nDelaware River Heritage Trail\nThe Delaware River Heritage Trail will be, upon completion, a 60-mile multi-use loop through cultural and natural resources along the upper portion of the Delaware River estuary. With funding from National Park Service and the William Penn Foundation, DRGP and a bi-state advisory committee of government and non-profit representatives, have outlined the initial route linking 24 communities from Trenton to Palmyra, New Jersey on the New Jersey side, and from Morrisville to the Tacony neighborhood of Philadelphia on the Pennsylvania side.  In 2013, Burlington County, New Jersey completed the first three-mile segment of the trail from Bordentown to Fieldsboro. Development of Camden County's segments of the trail and a 6-mile bicycle path in Bensalem, Pennsylvania is underway; this will create a continuous trail with a new route to the Delaware River Waterfront. .\nDelaware River Scenic Byway\nThe Partnership is the host non-profit organization for the Delaware River Scenic Byway project, which gained National Scenic Byway status in 2012, the first in the state of New Jersey. It runs along Route 29 along the Delaware River from Trenton, New Jersey and travels through the historic riverside towns of Titusville, Lambertville, Stockton and Raven Rock, ending at Frenchtown, passing through the Delaware and Raritan Canal State Park, the Delaware River Mill Society, the Howell Living History Farm and the Old Barracks Museum.\nAffiliations\n* National Park Service\n* Delaware River Scenic Byway\n* Delaware River Basin Commission\n* New Jersey Department of Environmental Protection\n* Pennsylvania Department of Environmental Protection\n* Pennsylvania Fish and Boat Commission\n* American Canoe Association\nReferences\nExternal links\n* [http://delawareriverwatertrail.org/ Delaware River Water Trail]\n*\n* [http://www.delawareriverscenicbyway.org/ Experience The Beauty of the Delaware River Along the Byway NJ’s Rt 29 From Frenchtown to Trenton]"
    }
  ]
}