{
  "content": [
    {
      "type": "text",
      "text": "# Delaware Court of Chancery__disambig_1\n\n, one of the court's three locations]]\nThe Delaware Court of Chancery is a court of equity in the U.S. state of Delaware. It is one of Delaware's three constitutional courts, along with the Supreme Court and Superior Court. Since 2018, the court consists of seven judges. The court is known for being a hub for corporate governance litigation in the United States, as two-thirds of Fortune 500 companies are incorporated in Delaware. It is among the preeminent business courts in the world.\nConnection to corporate law\nMany companies prefer to incorporate in Delaware because of the state's corporate-friendly tax system and the Court's historical expertise in business litigation. The Court's judges tend to be longtime members of the Delaware State Bar Association who have spent their careers doing corporate litigation.\nBecause of the extensive experience of the Delaware courts, Delaware has a more well-developed body of case law than other states, which serves to give corporations and their counsel greater guidance on matters of corporate governance and transaction liability issues. More than two thirds of Fortune 500 companies are incorporated in the state. Delaware is the home to more than 1.8 million corporations, more than the number of residents in the state.\nThe Court of Chancery handle corporate internal affairs litigation (such as shareholder disputes and merger disputes) according the Delaware General Corporation Law, the statute governing corporations in Delaware. As a result, it is a hub for corporate litigation in the United States.\nJudges\nThe chief judge is called the Chancellor, and the other six judges are called Vice Chancellors. The chancellor and vice chancellors are nominated by the governor and confirmed by the state senate for 12-year terms. The Court is subject to the \"major-party\" rule in the Delaware constitution. Also known as the political balance requirement, this requires that the bare majority of the court \"shall be of one major political party\", and the other judges \"shall be of the other major political party\". As a result, any person not affiliated with either the Republican or Democratic Party was formerly not able to serve on the court until a consent decree ending a lawsuit by an unaffiliated judicial applicant led to the termination of the rule.\nJurisdiction\nThe Court's jurisdiction is a hybrid of constitutional provisions, statutes, and case law.\nAccording to the Delaware Judicial Information Center:\nThe Court of Chancery has jurisdiction to hear and determine all matters and causes in equity. The general equity jurisdiction of the Court is measured in terms of the general equity jurisdiction of the High Court of Chancery of Great Britain as it existed prior to the separation of the American colonies. The General Assembly may confer upon the Court of Chancery additional statutory jurisdiction. In today's practice, the litigation in the Court of Chancery consists largely of corporate matters, trusts, estates, and other fiduciary matters, disputes involving the purchase and sale of land, questions of title to real estate, and commercial and contractual matters in general. When issues of fact to be tried by a jury arise, the Court of Chancery may order such facts to trial by issues at the Bar of the Superior Court of Delaware. (10 Del. C., 369).\nArticle IV, Section 10 of the Delaware Constitution establishes the Court and provides that it \"shall have all the jurisdiction and powers vested by the laws of this State in the Court of Chancery.\"\nEquitable jurisdiction\nTitle 10, Section 341 of the Delaware Code states that the Court \"shall have jurisdiction to hear and determine all matters and causes in equity.\" Subsequent decisions have held that the Court's equitable jurisdiction \"coextensive with, and in most respects, conformable\" to that of English High Court of Chancery at the time of American independence in 1776.\nThe Court's most significant power is its ability to issue preliminary and permanent injunctions and temporary restraining orders. This is frequently exercised in the context of disputes involving mergers and acquisitions or sales of corporations, wherein a corporate suitor or a shareholder will attempt to enjoin—that is, prevent—the sale or merger of a corporation, claiming that their stock value has been diluted or that they have superior rights to purchase the corporation. In a typical sale or merger dispute, a plaintiff will seek a temporary restraining order, sometimes on an ex parte basis, to prevent the transaction from taking place and preserve the status quo. If the Court grants that relief, the plaintiff will then seek a preliminary injunction to maintain the current state of affairs until a trial can take place.\nTitle 10, Section 342 of the Delaware Code provides that the Court shall not hear any matters for which an adequate remedy exists at law or which can be heard by any other Delaware court. As a practical matter, this means that the Court cannot grant relief in the form of money damages to compensate a party for a loss or where another court has coterminous jurisdiction. However, under the rules of equity, the court can grant monetary relief in the form of restitution by ruling that another party has unjustly gained money that belongs to the plaintiff.\nApart from its general equitable jurisdiction, the Court has jurisdiction over a number of other matters. First, the Court has sole power to appoint guardians of the property and person for mentally or physically disabled Delaware residents. Similarly, the Court may also appoint guardians for minors, although the Family Court has coterminous jurisdiction over such matters. Will contests and disputes over interpretations of trusts are also heard by the Court.\nIn 1952, the Court of Chancery held in Gebhart v. Belton that the operation of segregated school systems in Delaware was unlawful, two full years before the U.S. Supreme Court would do so in Brown v. Board of Education.\nProcedure\nThe Chancellor is responsible for appointing a judge on the court to preside over a case.\nThe Court sits without a jury. All issues of fact are determined by the presiding Chancellor or Vice Chancellor. The Court has the discretion to appoint an advisory jury if it so desires, but this power is practically never exercised.\nThe Court of Chancery's decision can be appealed to the Delaware Supreme Court, whose decision is final unless appealed to the Supreme Court of the United States.\nHistory\nThe history of the Court of Chancery stems back to the English common law system, in which separate courts were established to hear law and equity matters. English law courts included the Court of King's Bench (or Queen's Bench when the monarch was female), the Court of Common Pleas, and the Court of the Exchequer. The sole English court of equity was the Court of Chancery.\nAlong with the remainder of the original Thirteen Colonies, Delaware imported the English concept of common law. This included establishing a separate Court of Chancery. As the legal system evolved in England, the English Court of Chancery was eventually abolished by the Judicature Act 1873-75 and its powers merged into what was then called 'The Supreme Court of Judicature' (comprising the High Court and the Court of Appeal) which exercised jurisdiction in both common law and equity. This was prompted in part by similar reforms which had taken place elsewhere, notably the abolition of the New York Court of Chancery in 1847. Most American jurisdictions followed the reforms in New York and England.\nIn its first Constitution, the Delaware Constitution of 1776, there was no special provision for a court of equity. However, when the constitution was revised in the Delaware Constitution of 1792 a separate Court of Chancery was established. This constitution was heavily influenced by thinking of John Dickinson and George Read. William T. Quillen and Michael Hanrahan in their Short History of the Delaware Court of Chancery repeat the \"folklore of the Delaware bench and bar, saying that the impetus for creating a Court of Chancery was to provide a new judicial seat for Delaware's first Chancellor, William Killen.\" Killen was the elderly and highly respected incumbent Chief Justice of Delaware, and when George Read was considered to be the new Chief Justice of Delaware, he refused unless adequate provisions were made for Killen. A separate Court of Chancery under Killen was the solution.\nConstitution of 1792\nThere was one chancellor, appointed by the governor for life.\n{| class=\"wikitable\" style=\"text-align:center; width:94%; margin:auto;\"\n|+ Chancellors of Delaware\n|-\n! Name\n! Took office\n! Left office\n! Residence\n! Party\n|-\n|William Killen\n|October 6, 1793\n|December 6, 1801\n|Kent County\n||Democratic-Republican\n|-\n|Nicholas Ridgely\n|December 6, 1801\n|April 1, 1830\n|Kent County\n||Democratic-Republican\n|-\n|Kensey Johns Sr.\n|June 21, 1830\n|January 18, 1832\n|New Castle County\n||Whig\n|}\nConstitution of 1831\nThere was one chancellor, appointed by the governor for life.\n{| class=\"wikitable\" style=\"text-align:center; width:94%; margin:auto;\"\n|+ Chancellors of Delaware\n|-\n! Name\n! Took office\n! Left office\n! Residence\n! Party\n|-\n|Kensey Johns Jr.\n|January 18, 1832\n|March 28, 1857\n|New Castle County\n||Whig\n|-\n|Samuel M. Harrington\n|May 4, 1857\n|November 28, 1865\n|Kent County\n||Democratic\n|-\n|Daniel M. Bates\n|December 12, 1865\n|October 1873\n|New Castle County\n||Democratic\n|-\n|Willard Saulsbury Sr.\n|November 14, 1873\n|April 6, 1892\n|Sussex County\n||Democratic\n|-\n| James L. Wolcott\n|May 5, 1892\n|September 5, 1895\n|Kent County\n||Democratic\n|-\n|John R. Nicholson\n|September 5, 1895\n|June 10, 1897\n|Kent County\n||Democratic\n|}\nConstitution of 1897\nThere is one chancellor, appointed by the governor for a 12-year term. There were also created over the years, additional vice chancellors, the first in 1939, a second in 1961, a third in 1984, and a fourth in 1989. Since 2018, there are six vice chancellors. They are also appointed by the governor for a 12-year term. They are required to be equally divided between the major political parties, so that among all the chancellors no party has a majority of more than one person.\n{| class=\"wikitable\" style=\"text-align:center; width:94%; margin:auto;\"\n|+ Chancellors of Delaware\n|-\n! Name\n! Took office\n! Left office\n! Residence\n! Party\n|-\n|John R. Nicholson\n|June 10, 1897\n|June 10, 1909\n|Kent County\n||Democratic\n|-\n|Charles M. Curtis\n|June 10, 1909\n|July 2, 1921\n|\n||Republican\n|-\n|Josiah O. Wolcott\n|July 2, 1921\n|November 11, 1938\n|Kent County\n||Democratic\n|-\n|William W. Harrington\n|December 7, 1938\n|1950\n|\n|\n|-\n|Daniel F. Wolcott\n|1950\n|1951\n|\n||Democratic\n|-\n|Collins J. Seitz\n|1951\n|July 17, 1966\n|\n|\n|-\n|William Duffy\n|July 17, 1966\n|1973\n|\n|\n|-\n|William T. Quillen\n|1973\n|1976\n|\n|\n|-\n|William Marvel\n|September 1976\n|May 1, 1982\n|\n|\n|-\n|Grover C. Brown\n|1982\n|1985\n|\n|\n|-\n|William T. Allen\n|1985\n|1997\n|\n|\n|-\n|William B. Chandler, III\n|1997\n|2011\n|Sussex County\n||Republican\n|-\n|Leo E. Strine Jr.\n|2011\n|2014\n|New Castle County\n||Democratic\n|-\n|Andre Bouchard\n|2014\n|2021\n|\n||Democratic\n|-\n|Kathaleen McCormick\n|May 6, 2021\n|present\n|\n|\n|-\n|}\n{| class=\"wikitable\" style=\"text-align:center; width:94%; margin:auto;\"\n|+ Vice chancellors of Delaware\n|-\n! Name\n! Took office\n! Left office\n! Residence\n! Party\n! Seat\n|-\n|George B. Pearson Jr.\n|1939\n|1946\n|\n|\n| rowspan=9|1st\n|-\n|Collins J. Seitz\n|1946\n|1951\n|\n|\n|-\n|Howard W. Bramhall\n|1951\n|1954\n|\n|\n|-\n|William Marvel\n|1954\n|1976\n|\n|\n|-\n|Maurice A. Hartnett\n|1976\n|1994\n|\n|\n|-\n|Myron T. Steele\n|1994\n|2000\n|\n|\n|-\n|John W. Noble\n|November 2000\n|February 2016\n|Kent County\n||Democratic\n|-\n|Joseph R. Slights III\n|March 28, 2016\n|2022\n|Kent County\n||Democratic\n|-\n|Nathan A. Cook\n|July 21, 2022\n|present\n|\n|-\n|Isaac D. Short\n|1961\n|1973\n|\n|\n|rowspan=8|2nd\n|-\n|Grover C. Brown\n|1973\n|1982\n|\n|\n|-\n|Joseph J. Longobardi\n|1982\n|1984\n|\n|\n|-\n|Joseph T. Walsh\n|1984\n|1985\n|\n|\n|-\n|Jack B. Jacobs\n|1985\n|2003\n|\n|\n|-\n|Donald F. Parsons\n|2003\n|2015\n|\n||Democratic\n|-\n||Tamika Montgomery-Reeves\n|November 2015\n|November 2019\n|New Castle County\n||Democratic\n|-\n|Paul Fioravanti Jr.\n| January 15, 2020\n| present\n|\n|\n|-\n|Carolyn Berger\n|1984\n|1994\n|\n|\n|rowspan=5|3rd\n|-\n|Bernard S. Balick\n|1994\n|1998\n|\n|\n|-\n|Leo E. Strine Jr.\n|1998\n|2011\n|New Castle County\n||Democratic\n|-\n|Sam Glasscock III\n|2011\n|2025\n|Sussex County\n||Republican\n|-\n|Bonnie David\n|2025\n|present\n|Sussex County\n|\n|-\n|William B. Chandler III\n|1989\n|1997\n|Sussex County\n||Republican\n|rowspan=3|4th\n|-\n|Stephen P. Lamb\n|1997\n|2009\n|New Castle County\n|\n|-\n|J. Travis Laster\n|October 9, 2009\n|present\n|New Castle County\n||Republican\n|-\n|Morgan Zurn\n|October 4, 2018\n|present\n|New Castle County\n||Republican\n|5th\n|-\n|Kathaleen McCormick\n|November 1, 2018\n|May 6, 2021\n|New Castle County\n||Democratic\n|rowspan=2|6th\n|-\n|Lori W. Will\n|May 26, 2021\n|present\n|\n|}\nThe Court also employs three full-time Magistrates in Chancery (formerly known as Masters in Chancery), appointed by the Chancellor under Court of Chancery Rule 144. The Magistrates adjudicate cases assigned to them by the Court, with a particular focus on \"the people's concerns in equity,\" such as guardianships, property disputes, and trust and estate matters. The current Magistrates in Chancery are Selena E. Molina, and Loren Mitchell.\nSee also\n* Court of equity\n* Courts of Delaware\n* Delaware corporation\n* The Delaware Journal of Corporate Law\n* Delaware Corporate and Commercial Litigation Blog\n* New York Court of Chancery\n* Michigan Court of Chancery\nNotes\nReferences\n*\n*\nExternal links\n* [https://courts.delaware.gov/Chancery/ Delaware Court of Chancery homepage]"
    }
  ]
}