{
  "content": [
    {
      "type": "text",
      "text": "# Delaware Department of Correction\n\n| signature           =\n}}\nThe Delaware Department of Correction is a state agency of Delaware that manages state prisons. It has its headquarters in the Central Administration Building in Dover. At one time the headquarters was located in Smyrna.\nPrisons\n* Delores J. Baylor Women's Correctional Institution [https://doc.delaware.gov/BOP/PrisonBWCI.shtml] (inmate capacity 320)\n* Howard R. Young Correctional Institution (capacity 1,500)\n* James T. Vaughn Correctional Center (formerly Delaware Correctional Center) (capacity 2,600)\n* Sussex Correctional Institution (capacity 1,206)\nCommunity Corrections\n* Central Violation of Probation Center\n* Hazel D. Plant Women's Treatment Facility\n* John L. Webb Correctional Facility\n* Morris Community Corrections Center\n* Plummer Community Corrections Center\n* Probation and Parole / Day Reporting Centers\n* Sussex Community Corrections Center\n* Sussex Violation of Probation\n* Sussex Work Release Center\nIntelligence Operations Center (IOC)\nThe Delaware Department of Correction, Intelligence Operations Center serves as a central hub for intelligence gathering and analysis, enhancing the department's ability to respond to emerging threats and manage the complexities of correctional facility operations. By leveraging advanced technology and analytical techniques, the analysts contribute to a proactive approach to ensuring the safety of both staff and inmates, as well as the surrounding community.\nOperations\n60% of all admissions into the Delaware correctional system go to the Howard R. Young Correctional Institution, and that facility houses the majority of Delaware's detainee population.\nThe male death row was at the James T. Vaughn Correctional Center (JTVCC), while the female death row was at the Delores J. Baylor Women's Correctional Institution. Executions occurred at JTVCC, as it housed the execution chamber.\nLine of duty deaths\nIncluding preceding agencies, 3 officer and 1 K9 of the Delaware Department of Corrections have been killed in the line of duty.\nSee also\n* List of law enforcement agencies in Delaware\n* List of United States state correction agencies\n*List of U.S. state prisons\n* Prison\nReferences\nExternal links\n*[http://doc.delaware.gov Delaware Department of Correction]\n*[https://statejobs.delaware.gov/careers/co/ Delaware Department of Correction Featured Careers]"
    }
  ]
}