{
  "content": [
    {
      "type": "text",
      "text": "# Delaware-class battleship\n\n{|\n| Class before =\n| Class after =\n| Built range =\n| In commission range = 1910–1923\n| Total ships planned = 2\n| Total ships completed = 2\n| Total ships retired = 2\n}}\n* Full load:\n| Ship length =\n*  (overall)\n*  (waterline)\n| Ship beam =\n| Ship draft =\n*  (mean)\n*  (max)\n| Power =\n* 14 × coal-fired superheating Babcock & Wilcox water-tube boilers\n*  (design)\n| Ship propulsion =\n* 2 × sets Vertical triple expansion Delaware\n* Curtis Steam turbines North Dakota\n* 2 × screws\n| Ship speed =\n| Ship range = at\n| Ship complement = 933 officers and men\n| Ship sensors =\n| Ship EW =\n| Ship armament =\n* 10 × /45 caliber Mark 5 guns\n* 14 × /50 cal Mark 6 guns\n* 2 × 3-pounder /40 cal guns\n* 4 × 1-pounder  guns\n* 2 ×  torpedo tubes (submerged)\n| Ship armor =\n* Belt:\n* Lower casemate:\n* Upper casemate:\n* Barbettes:\n* Turret face:\n* Conning tower:\n* Decks:\n| Ship aircraft =\n| Ship aircraft facilities =\n| Ship notes =\n}}\n|}\nThe 'Delaware-class' battleships of the United States Navy were the second class of American dreadnoughts; the class comprised two ships:  and . With this class, the  limit imposed on capital ships by the United States Congress was waived, which allowed designers at the Navy's Bureau of Construction and Repair to correct what they considered flaws in the preceding  and produce ships not only more powerful but also more effective and rounded overall. Launched in 1909, these ships became the first in US naval history to exceed .\nThe Delawares carried a battery of ten  guns in five turrets, an increase of two guns over the South Carolinas. With these ships, the US Navy re-adopted a full-fledged medium-caliber weapon for anti-torpedo boat defense. While the  gun was smaller than that used by other major navies, this would, with few exceptions, become the standard medium-gun caliber for the US Navy for the better part of the 20th century. As for speed, the Delawares were capable of , a significant improvement over the earlier class's . This would become the speed for all American standard-type battleships. Propulsion systems were mixed; while North Dakota was fitted with steam turbines, Delaware retained triple-expansion engines. Direct-drive turbines were much less fuel-efficient, a significant concern for a Navy with Pacific responsibilities but lacking Britain's extensive network of coaling stations.\nThese ships saw varied service during their careers. During World War I, Delaware was part of Battleship Division Nine of the US Atlantic Fleet, and was assigned to the British Grand Fleet. She escorted convoys and participated in the blockade of the German High Seas Fleet. In contrast, North Dakota remained on the American coast throughout the war, due in part to worries about her troublesome turbine engines.  Post-war, they conducted training cruises with the US Atlantic Fleet.  In 1924, Delaware was broken up for scrap metal in accordance with the Washington Naval Treaty of 1922. North Dakota survived until 1931, when she too was scrapped, under the terms of the 1930 London Naval Treaty.\nDesign\nPrompted by the launch of and misinformation about , the US Navy and Congress faced what they perceived as a vastly better battleship than the two  battleships then under construction, which were designed under tonnage constraints that Congress had imposed on capital ships. Actually, the South Carolinas were inferior only in speed to Dreadnought; they carried fewer heavy guns but, unlike Dreadnought, could bring all of them to bear on the broadside. Because of this, they could fire an equal weight of metal. Also, because greater time and care had been taken with their armor and bulkhead arrangement, they were better protected than the British ship. None of this was realized at the time. Nevertheless, the Navy's Bureau of Construction and Repair (C&R) had struggled tremendously to design an adequate warship under congressional limits and had taken battleship design as far under those restrictions as it could. Seeing now that those limits had become unrealistic, Congress ended them; any subsequent constraints would be dictated by treaty limitations. The language of the authorizing act of June 26, 1906 was for a battleship \"carrying as heavy armor and as a powerful armament as any known vessel of its class, to have the highest practicable speed and the greatest practicable radius of action.\"\nThe Delaware class was the second of 11 distinct US capital ship designs begun from 1906 to 1919; some 29 battleships and six battlecruisers were laid down during this period, though seven of the battleships and all six of the battlecruisers were cancelled. Except for the s, these were all relatively slow ships, designed for no more than . They ranged in displacement from .  At this time, no US dreadnought class battleship had yet hit the water as all were either at some stage of building or in design. Virtually the entire US Navy battle line was being designed by drawing on experience from pre-dreadnought designs, or from observation of foreign battleship design.\nThe design for these ships was actually ready in 1905 or 1906. Two variants were offered—a 10-gun version on  and a 12-gun alternative on . The larger ship was rejected as too expensive for the firepower it offered, even after its displacement was reduced to  tons. Also, because C&R was required to consider private designs, construction on the Delawares did not commence until 1907. None of the private designs was considered remotely satisfactory by the Navy. However, Fore River later developed its version into the battleship , which was built for the Argentine navy. While the C&R design was considered superior, it still came under criticism, particularly for the poor placement of, and lack of protection for, the secondary armament.\nGeneral characteristics\nThe Delawares were significantly more powerful than their predecessors, the South Carolina-class, and are mentioned by ''Conway's All the World's Fighting Ships as the first to match the standard set by the British with Dreadnought. This was due in large part to the elimination of Congressional limits on the size of new battleships; the only restriction the Congress placed on their design was that the cost of hull and machinery could not exceed 6 million USD. The Delaware-class ships were also significantly larger than the South Carolinas. They were  long at the waterline and  long overall. By comparison, the South Carolina-class ships were  long overall. The Delawares had a beam of  and a draft of ; the South Carolinas measurements were  and , respectively. The Delaware-class ships displaced  at standard displacement and  at full load, while the South Carolinas displaced  at standard displacement and  at full load. Their bows had an early example of bulbous forefeet.\nPropulsion\nFor reasons including expected hostilities with Japan, requiring travel across the Pacific Ocean, long operational range was a recurrent theme in all US battleship designs.  As an experiment, these ships received different powerplants. Delaware received triple-expansion reciprocating engines, while North Dakota was fitted with Curtiss direct drive steam turbine engines. Both ships had 14 Babcock & Wilcox boilers, both original power plants were rated at ; and both ships were capable of reaching 21 knots. Chief Constructor Washington L. Capps predicted North Dakota would have a 25 percent shorter radius than Delaware'' at 16 knots and 45 percent less at 14 knots, based on tank tests and the known performance of steam turbines at that time. This estimate was proved true during the ships' trial runs in 1909. Also, because Delawares engine bearings were equipped with forced lubrication instead of a gravity-fed system, she was able to steam at full speed for 24 hours without any need for engine repair. This would normally have been unthinkable as reciprocating engines were known generally to shake themselves apart if run at full power for long. However, this penchant for reliability came under question in the late 1930s as battleships with reciprocating engines performed poorly in the Pacific. By 1917, more powerful and efficient geared turbines had been installed in North Dakota to replace her Curtiss turbines. These provided  horsepower, some  greater than her original engines.\nArmament\nMain guns\nThe Delaware-class ships were armed with ten 12-inch/45 caliber Mark 5 guns in five twin gun turrets; this was an addition of two guns compared to the preceding South Carolinas. The gun housings were the Mark 7 type, and they allowed for depression to −5&nbsp;degrees and elevation to 15&nbsp;degrees. The guns had a rate of fire of 2 to 3 rounds per minute. They fired  shells, of either armor-piercing (AP) or Common types, though the Common type was obsolete by 1915 and put out of production. The propellant charge was  in silk bags, and provided a muzzle velocity of . The guns were expected to fire 175 rounds before the barrels would require replacement. The two ships carried 100 shells per gun, or 1,000 rounds in total. At 15&nbsp;degrees elevation, the guns could hit targets out to approximately .\nTwo turrets were mounted fore in a superfiring pair, while the other three were mounted aft of the main superstructure, all on the centerline. The placement of the rear gun turrets proved problematic. Capps placed the rear superfiring turret, Number 3, closest amidships. Since it represented the greatest weight borne by the ship's structure due to its tall barbette, this placement would allow it support by the greatest amount of underwater volume available. The other two rear turrets, Numbers 4 and 5, were placed level and back to back. This arrangement was detrimental in two ways. First, Number 3 could not fire astern with Number 4 trained forward, which left only the two 12\" guns of Number 5 to do so. Second, because the engine room was situated between Numbers 3 and 4, steam lines ran from the boiler rooms amidships around the ammunition magazine for Number 3 turret to the engine room. These lines, it was later found, had the potential to heat the powder in the magazine and degrade its ballistics. This design flaw was also prevalent in several British dreadnoughts but was considered inescapable by naval designers on structural grounds.\nAnother challenge with the main armament was that its weight,  per turret, which had to be spread over much of the hull, led to increased stress on the structure. The closer the weight of the heavy guns to the ends, the greater the stress and risk for structural failure due to metal fatigue. High speed required fine ends, which were not especially buoyant, and the amount of space needed amidships for machinery precluded moving the main turrets further inboard. Not having to worry about a displacement limit allowed Capps the option of deepening the hull, which helped to some extent. He added a forecastle to allow for better seakeeping and to make room for officers' quarters and restored the full height of the hull aft. The problem itself, however, remained.\nSecondary guns\nThe Naval War College in its 1905 Newport Summer Conference considered the  guns fitted to the South Carolina class too light for effective anti-torpedo-boat defense. A committee on this issue formed during the conference suggested that a gun with a high velocity and flat trajectory would work best—one powerful enough to smash an attacking vessel yet light enough for easy handling and rapid firing. For this purpose, the committee found 5-inch guns appeared best suited. During the Delawares' design, C&R considered  guns but concerns voiced by the Naval War College about the lack of heavy splinter protection for these guns and smoke uptakes led to an adaption of 5-inch /50 caliber guns to balance the increase in armor weight.\nThe Delawares mounted fourteen 5-inch/50 caliber Mark 6 guns, two forward on the main deck, 10 in casemates on the side and two aft on the main deck abeam No. 5 turret. They had a rate of fire of 6 to 8 rounds per minute. They fired three types of rounds: a \"light\" AP shell that weighed  and a \"heavy\" AP round that weighed . The third type was the Common Mark 15 shell, which also weighed 50&nbsp;lb. The 50&nbsp;lb shells were fired at a muzzle velocity of , while the larger 60&nbsp;lb shells traveled at a slightly slower . The guns were emplaced on both Mark 9 and Mark 12 pedestal mounts; the Mark 9 version limited elevation to 15&nbsp;degrees, while the Mark 12 allowed for up to 25&nbsp;degrees. The 5-inch/50 was able to penetrate most effectively at , which was the deciding factor in the decision to equip the Delaware class with them. The 5-inch guns were supplied with a total of 240 rounds per barrel.\nWhile these guns were considered an improvement by the Navy over that of the South Carolinas, their placement remained problematic as even in calm water, they were extremely wet and thus difficult to man. The forward guns were moved into the superstructure after sea trials. The casemate-mounted secondary armament was one deck below the main deck and provided the majority of the complaints from shipping water from the forward positions and breaking the flow of the bow wave imparting extra drag on the design.\nAnti-aircraft guns\nAs with the South Carolina class, these ships were fitted with two 3-inch/50 caliber anti-aircraft (AA) guns in Mark 11 mounts in 1917. The Mark 11 mount was the first 3-inch AA mounting issued by the US Navy. They had a trunnion height of  compared to a height of  for the pedestal mountings used against surface craft. This allowed them an elevation range between −10 and 85 degrees. Maximum range was  at 43 degrees and maximum ceiling  at 85 degrees.\nTorpedo tubes\nThe Delawares carried two  torpedo tubes below the waterline. The Bliss-Leavitt 21-inch Mark 3 Model 1 torpedo designed for these tubes had an overall length of , a weight of  and propelled an explosive charge of  of TNT to a range of  at a speed of\nArmor\nThe armored belt ranged in thickness from  in the more important areas of the ship. Casemated guns mounted in the hull had between  of armor plate. The barbettes that housed the main gun turrets were armored with between  of armor; the side portions more vulnerable to shell fire were thicker, while the front and rear sections of the barbette, which were less likely to be hit, received thinner armor to save weight. The gun turrets themselves were armored with  of armor. The conning tower was  thick. As in the designs of all early dreadnoughts, the deck armor was very thin at  in most areas and  over machinery and magazine spaces. These ships were expected to do most of their firing at ranges less than . At such distances, deck strikes would be a rare event.\nService history\n{| class=\"wikitable plainrowheaders\"\n|+ Construction data\n|-\n! scope=\"col\" | Ship name\n! scope=\"col\" |\n! scope=\"col\" | Builder\n! scope=\"col\" | Laid down\n! scope=\"col\" | Launched\n! scope=\"col\" | Commissioned\n! scope=\"col\" | Decommissioned\n! scope=\"col\" | Fate\n|-\n! scope=\"row\" |\n! scope=\"row\" | BB-28\n|Newport News Shipbuilding, Newport News\n|11 November 1907\n|6 February 1909\n|4 April 1910\n|10 November 1923\n|Broken up at Boston, 1924\n|-\n! scope=\"row\" |\n! scope=\"row\" | BB-29\n|Fore River Shipyard, Quincy\n|16 December 1907\n|10 November 1908\n|11 April 1910\n|22 November 1923\n|Broken up at Baltimore, 1931\n|}\nUSS Delaware\nDuring trials, Delaware was run at full speed for 24 hours straight to prove that her machinery could handle the stress. She was the first American battleship to achieve the feat. Late in 1910, Delaware sailed to Europe, followed by a trip to South America early in 1911. She made a further two voyages to Europe in 1912 and 1913, before returning to the US Atlantic Fleet for training exercises that were conducted in the western Atlantic and Caribbean. Delaware took part in the Second battle of Vera Cruz in April–May 1914.\nWhen the United States declared war on Germany in April 1917, Delaware was initially tasked with readiness training off the East Coast. Late in the year, she was deployed to Europe as part of the US Navy's Battleship Division Nine, under the command of Rear Admiral Hugh Rodman. The force arrived on 7 December and was assigned to the 6th Battle Squadron of the Grand Fleet. In July 1918, Delaware was withdrawn from overseas service and returned to the United States.\nIn 1920, the US Navy adopted hull numbers for its ships; Delaware was assigned the hull number BB-28. Delaware made only two more cruises, both for midshipmen, under her new identification number: one in 1922 and the second in early 1923. Delaware sailed to Europe on the second trip, and stopped at a number of ports, including Gibraltar. She returned to the US in August of that year, at which point her crew was reassigned to the newer battleship . She was then taken to the Boston Navy Yard, where her armaments were removed. The ship was decommissioned in November 1923 and sold to shipbreakers in February 1924.\nUSS North Dakota\n]]\nUpon commissioning, the ship was assigned to the Atlantic Fleet, alongside her sister Delaware. Her first overseas cruise came in November 1910, when she steamed across the Atlantic to visit France and Britain. North Dakota also took part in the invasion of Vera Cruz in 1914. Unlike her sister, North Dakota remained off the American coast for the duration of the United States' involvement in World War I. Hugh Rodman, the commander of the American expeditionary force, specifically requested that North Dakota be kept stateside; he felt her turbine engines were too unreliable for the ship to be deployed to a war zone. In 1917, her engines were replaced with new geared turbines, and new fire control equipment was installed.\nFrom 1917, she was employed as a training ship for gunners and engineers. Post-war, North Dakota made a second trip to Europe, primarily to ports in the Mediterranean Sea. During the visit, the ship was tasked with the return of the remains of the Italian ambassador, Vincenzo Macchi di Cellere, who had died 20 October 1919 in Washington, DC. The ship participated in the aerial bombing demonstrations off the Virginia Capes in 1921. In 1923, a third trip to Europe, this time with midshipmen from the Naval Academy aboard. The ship stopped in Spain, Scotland, and Scandinavia.\nLike her sister, she was relegated to the surplus naval forces that had to be dismantled under the Washington Naval Treaty. In November 1923, North Dakota was decommissioned; she had her armaments removed in 1924, after which she was converted into a target ship. She was redesignated as \"unclassified\", and served as a target until 1931, when she was scrapped.\n}}\nReferences\n*\n}}\n*\n*\n*\n*\n}}\n*\n}}\n*\n}}\n*\n}}"
    }
  ]
}