{
  "content": [
    {
      "type": "text",
      "text": "# Delaware statutory trust\n\nA Delaware statutory trust (DST) is a legally recognized business trust formed under Chapter 38 of Title 12 of the State of Delaware Code. A DST permits property or business operations to be managed by one or more trustees on behalf of beneficial owners. Unlike common law business trusts, a DST is recognized as a separate legal entity, with certain protections similar to those of a limited liability company or partnership.\nHistorically, business trusts in the United States drew from English common law. Delaware began recognizing statutory business trusts in 1947, and the modern structure was formalized in 1988 with the adoption of the Delaware Statutory Trust Act (DSTA), codified at 12 Del. C. § 3801 et seq. The Act allows broad flexibility through private trust agreements, which govern the operation and rights of trustees and beneficial owners without requiring disclosure of the agreement to the state.\nFormation\nThe formation of a Delaware statutory trust requires the execution of a private governing instrument (trust agreement) among the involved parties. The agreement outlines trustee authority, management powers and beneficial ownership rights. To create the entity, a Certificate of Trust must be filed with the Delaware Division of Corporations along with a statutory fee. The trust must maintain at least one trustee residing in Delaware or having a principal place of business in the state. If the DST is, or will become, a registered investment company, it must also maintain a Delaware registered agent and registered office.\nLegal characteristics\nThe Delaware Statutory Trust Act provides several features distinct from traditional business trusts, including:\n* recognition as a separate legal entity\n* limited liability for trustees and beneficial owners\n* governance primarily through private contract (trust agreements)\n* ability to delegate management responsibilities\n* potential for classification as a pass-through entity for tax purposes\n* recognition of separate series within a trust, allowing asset segregation\nMany states continue to rely on common law business trust principles rather than adopting statutory structures. Massachusetts, for example, recognizes a similar entity known as the Massachusetts business trust.\nFederal tax treatment\nOn August 16, 2004, the Internal Revenue Service (IRS) and the U.S. Department of the Treasury issued Revenue Ruling 2004-86, clarifying the federal tax treatment of DSTs. The ruling concluded that:\n* a DST meeting specified conditions is treated as a ‘‘trust’’ for federal tax purposes rather than as a business entity, and\n* interests in such a DST may qualify as eligible real property in a §1031 like-kind exchange, provided other requirements of §1031 are satisfied.\nThe IRS also specified seven operational restrictions a DST must follow to maintain this treatment, including limits on new capital contributions, borrowing, reinvestment, lease negotiation, capital expenditures, and requirements for distribution of cash and investment of reserves in short-term instruments.\nUse in real estate investment\nInvestor-oriented DST offerings are sometimes used to hold income-producing real estate on behalf of multiple beneficial owners. In some cases, interests in a DST are used as replacement property for taxpayers completing a like-kind exchange under Internal Revenue Code §1031. These offerings are typically limited to accredited investors under U.S. securities regulations.\nDST-held property may include various types of commercial real estate, and beneficial owners hold fractional interests rather than partnership interests. Income, deductions and potential gain or loss are allocated proportionately to beneficial owners consistent with trust classification rules under federal tax law.\nReferences"
    }
  ]
}