{
  "content": [
    {
      "type": "text",
      "text": "# Delaware North\n\n| services         =\n| revenue          =  US$ 3.2&nbsp;billion (2018)\n| operating_income =\n| net_income       =\n| num_employees    = 55,000+ (2018)\n| divisions        =\n| subsid           = TD Garden\n| homepage         = http://delawarenorth.com\n}}\nDelaware North is an American multinational food service and hospitality company headquartered in Buffalo, New York.   The company also operates in the lodging, sporting, airport, gambling, and entertainment industries. The company employs over 55,000 people worldwide and has over $3.2 billion in annual revenues.\nHistory\nDelaware North began as Jacobs Brothers, founded in Buffalo, New York, in 1915 by brothers Marvin, Charles and Louis Jacobs. Its name was changed first to Emprise Corp. and then to Sportsystems Inc. before adopting its current name in 1980. The company remains family-owned and operated by Jeremy Jacobs, who also owns the Boston Bruins. The arena in which the Bruins play, the TD Garden, is owned by Delaware North. Jacobs is also a member of the U.S. Department of Commerce Travel and Tourism Board.\nJacobs Brothers initially operated theater concessions. When the establishments closed down in the hot summer months, the three men turned their attention to ballparks, the first being Offermann Stadium, and the creation of the sports concession industry. Sportservice was created in 1926 following contracts with minor-league ballparks in Buffalo and Syracuse, New York. Sportservice is Delaware North's largest operating company. In 1930, the company entered into its first major-league deal by signing an agreement with the Detroit Tigers to handle food service at Navin Field. The Jacobs brothers expanded their business in 1939 by acquiring a racetrack, marking the beginning of Delaware North Companies Gaming & Entertainment. In 1941, the company entered the airport arena with a contract to provide food service in Washington National Airport. Delaware North Companies Travel Hospitality Services operates in more than 30 major airports worldwide.\nUpon the death of his father, founder Louis M. Jacobs in 1968, Jeremy M. Jacobs began leading the company, then called Emprise, at the age of 28. The years that followed were characterized by unprecedented growth and diversification. In 1972, after negative press over alleged connections to organized crime in Sports Illustrated and the Arizona Republic, the Emprise company was convicted of federal racketeering charges over the purchase of the Frontier Hotel in Las Vegas with members of the Mob. Jeremy dissolved Emprise and reorganized his family's holdings under a new company, Delaware North (named after the intersection of Delaware Avenue and North Street in Buffalo where the company was headquartered at the time), with a public emphasis on operating a clean, separate organization with no connection to Emprise. Delaware North acquired the Boston Garden in 1975 while Jeremy Jacobs purchased the Boston Bruins, one of the original six franchises of the National Hockey League. In 1987, the company acquired Sky Chefs, (now LSG Sky Chefs) a move that bolstered its airport business. The company obtained the contract to provide visitor services in Yosemite National Park in 1993. under the terms of the largest concessions contract in the U.S. National Park Service. The award sowed the seeds of a new line of business: Delaware North Companies Parks & Resorts.\nIn 1995, Delaware North won the contract to run the Kennedy Space Center Visitor Complex. In the late 1990s, the company worked toward becoming the largest racino operator in North America by adding gambling to some of its racetrack properties. The company moved its World Headquarters from the Main Court Building to 40 Fountain Plaza in 1999.\nThe company became the first U.S. hospitality company in the world to have its GreenPath environmental management system registered to the guidelines put forth by the International Organization for Standardization (ISO 14001) in 1991. In the early 2000s, the company became a hotel owner by purchasing Tenaya Lodge at the entrance to Yosemite and Harrison Hot Springs Resort & Spa in British Columbia, and by building a hotel at its gambling and racing destination resort in Wheeling, West Virginia.  2004 saw the company beginning GuestPath, its companywide continuous improvement process. The company entered the European market with a contract at Wembley Stadium, followed by one at Emirates Stadium in 2006 and 2007. In 2008, the company signed a 10-year contract at Pride Park Stadium, Derby.\nIn 2008/2009, Delaware North got a contract to operate a 4,500 slot machine racino at Aqueduct Racetrack in Queens, New York. It lost the contract in 2009 when it could not make a $370 million upfront payment to the state of New York.  The company was hired by Garrison Investments in 2009 to operate the  in Long Beach, California. This partnership ended in April 2011. In 2010, the company acquired Jumer's Casino & Hotel located in Rock Island, Illinois. Thereafter, the company entered the European travel hospitality market opening outlets at Gatwick, Heathrow, and Edinburgh Airports, and the Euston Railway Station. It also acquired the Australian Resorts at Lizard Island, Heron Island, and Wilson Island on the Great Barrier Reef and King's Canyon in the Red Centre of Australia.\nIn 2014, Delaware North launched a new global brand identity as the company prepared to celebrate its 100th anniversary in 2015. The company is now known just as \"Delaware North\" – no longer as \"Delaware North Companies\" – and ended the use of the abbreviation \"DNC\" in its logo.\nThe majority of its operating companies, which previously had been identified as \"Delaware North Companies Parks & Resorts,\" for example, are now called \"Delaware North.\"  The only exceptions are Delaware North Sportservice – given its historical importance as the company's original operating company and brand recognition in the sports industry – and Delaware North's most recent acquisition, Patina Restaurant Group.\nIn 2014, Delaware North issued a letter to the U.S. National Park Service, asserting various intellectual property rights, including such names as Ahwahnee, Curry Village, Wawona and other historic names it acquired when it purchased the Yosemite Park & Curry Company in 1993 with NPS approval. The letter estimated the value of those names at $51 million, while NPS estimated it at $3.5 million. A breach of contract lawsuit to determine their value was resolved in July 2019 with Delaware North receiving a $12 million settlement, the majority of which was paid by new Yosemite concessionaire Aramark, and the original place names being restored by NPS and Aramark.\nOn January 6, 2015, Delaware North Chairman Jeremy Jacobs relinquished the title of CEO and named Jerry Jacobs Jr. and Louis Jacobs Co-CEO's. He also named Charlie Jacobs CEO of Delaware North's Boston Holdings.\nIn 2015, Delaware North moved its corporate offices to the Delaware North Building in Buffalo, returning the company's headquarters to the namesake avenue after nearly 25 years.\nIn November 2018, Delaware North announced it was purchasing the SkyCity Darwin casino in Australia from the SkyCity Entertainment Group for A$188 million. The casino was renamed the Mindil Beach Casino & Resort in April 2019.\nOperating divisions\nSportservice\nDelaware North Companies Sportservice provides concessions, premium dining, catering and retail services to sporting and entertainment venues in the United States and Canada.  The company operates at over 50 venues including the homes of such franchises as the San Diego Padres, Baltimore Orioles, Green Bay Packers, Milwaukee Brewers, St. Louis Cardinals, Cleveland Guardians, Cincinnati Reds, Detroit Tigers, Minnesota Twins, Buffalo Bills, Chicago White Sox, Columbus Blue Jackets, and Chicago Bears. Sportservice has been recognized for its culinary advances and PETA approved menus. Sportservice is the company responsible for the creation of Secret Stadium Sauce, a popular condiment mostly associated with Milwaukee.\nGambling and entertainment\nDelaware North Companies Gaming & Entertainment is a gambling and racing operations company that focuses on racing venues that offer video gambling machines, poker rooms, table games, restaurants, retail shops and hotels. The company operates more than 10,000 video gambling machines in such places as New York, Arizona, Florida,\nNew Hampshire, Illinois and West Virginia. Venues include:\n*American Greyhound Racing\n**Apache Greyhound Park\n*Daytona Beach Kennel Club & Poker Room\n*Finger Lakes Gaming and Race Track\n*Gate City Casino\n*Gaming & Entertainment Management-Illinois (slot route operator)\n*Hamburg Gaming\n*Mardi Gras Casino and Resort\n*Miami Valley Gaming (50%)\n*Mindil Beach Casino & Resort in Darwin, Northern Territory, Australia\n*Southland Greyhound Park\n*Wheeling Island Hotel-Casino-Racetrack\nDNC International\nDelaware North Companies International provides food service and hospitality to international sporting and entertainment venues including Wembley Stadium, Emirates Stadium, Ricoh Arena, Pride Park Stadium and the Australian Open tennis tournament.\nParks and resorts\nDelaware North Companies Parks & Resorts was founded in 1992 following the company's winning bid for primary concessions at Yosemite National Park. The company now operates at other venues including Grand Canyon (one of two concessionaires), Niagara Falls State Park, Kennedy Space Center Visitor Complex, Shenandoah National Park, and Gideon Putnam Resort (among others).\nPatina Restaurant Group\nIn February 2014, Delaware North announced it would acquire a majority stake in Patina Restaurant Group (PRG), one of the nation's leading multi-concept operator in the premium segments of the restaurant and catering industry. PRG has operations at landmark locations in high-profile cultural and entertainment venues in New York City, California, and Orlando, Fla. Among them are: Rockefeller Center, Lincoln Center, Walt Disney World, Disneyland, Walt Disney Concert Hall, the Empire State Building, Grand Central Terminal/MetLife Building and Madison Square Garden. Patina is also the official caterer for the Creative Arts Ball and the Emmy Awards Governors Ball.\nTravel hospitality services\nDelaware North Companies Travel Hospitality Services operates food, beverage and retail at airports and toll plazas throughout the United States. The company operates at venues such as Los Angeles International Airport, Minneapolis-St Paul International Airport, Nashville International Airport, Buffalo Niagara International Airport, and the Detroit Metro Airport. The company recently opened the first-ever Sports Illustrated retail store at Detroit Metro Airport's new North Terminal. In September 2008, Delaware North also recently unveiled uWink technology which helps make it easier for international travelers at Ft. Lauderdale Airport.\nTD Garden\nDelaware North Companies Boston owns TD Garden, the home arena for the Boston Bruins hockey team and Boston Celtics basketball team. Jeremy Jacobs, Chairman of Delaware North, also owns the Bruins. TD Garden is the site of the annual Beanpot college hockey tournament, and hosts the annual Hockey East Championships. The arena has also hosted many major national sporting events including the 1999 and 2003 NCAA Division I Men's Basketball regional first and second rounds, the 2009 and 2012 Sweet Sixteen and Elite Eight, the 1998 Frozen Four, the 2004 Frozen Four, the 2014 United States Figure Skating Championships, the 2006 women's Final Four, and the 2015 Frozen Four. It hosted games 3, 4, and 6 of the 2011 Stanley Cup Finals, also games 3, 4, and 6 of the 2013 Stanley Cup Finals and games 1, 2, 5, and 7 of the 2019 Stanley Cup Finals  for the Bruins, and games 1, 2, and 6 of the 2008 NBA Finals, games 3, 4, and 5 of the 2010 NBA Finals, games 3, 4, and 6 of the 2022 NBA Finals, and games 1, 2, and 5 of the 2024 NBA Finals for the Celtics.\nControversies\nYosemite National Park\nDelaware North Companies, having lost the contract to run the concessions at Yosemite to Aramark in 2015, claimed that the names of many historic sites within Yosemite actually belong to them, and not to the United States Government. The site names include Curry Village, Ahwahnee Lodge, Wawona Hotel, Half Dome, and the name of the park itself, Yosemite National Park. DNC faced significant opposition from the public, including calls for boycott of its concessions at other sites.\nDelaware North sued the National Park Service in the United States Court of Claims for breach of contract. The lawsuit was settled in July 2019, with Aramark and the Park Service paying Delaware North a total of $12 million in exchange for the trademarks and tangible assets.\nIn 2017, Delaware North was mentioned as the defendant in Kerr vs. Delaware North Companies, Inc. et al.  Kerr alleges sexual misconduct while employed by Delaware North in Yosemite National Park.  Among remarks in the legal document, the culture alluded that:\nDelaware North sought for dismissal, but the case was remanded to the Superior Court on grounds that the alleged incident occurred on federal land and Delaware North's argument for dismissal \"missed the mark\".\nYellowstone National Park Visitor Access\nFrom 2009-2019, Delaware North acquired The Holiday Inn, Buffalo Bus Tours, Branch Saloon, Yellowstone Vacation Tours, Grey Wolf Inn, Yellowstone Park Hotel, Best Western Gardiner, Explorer Cabins, Two Top Snowmobiles,  The 23-cabin Jim Bridger Motor Court, The Yellowstone Mine restaurant and the Rusty Rail Lounge & Casino, The Branch Saloon and Restaurant, Rendezvous Snowmobile Rentals, and Big Sky Car Rentals. Buffalo Bus, Big Sky Car Rental, and Rendezvous Snowmobile were re-branded as Yellowstone Vacation Tours.  Two Top, Buffalo Bus, Rendezvous, The Best Western, and the original Holiday Inn were family run businesses with winter access contracts to operate in Yellowstone National Park prior to their acquisition.  With these acquisitions, most of which occurred after DNC's contract loss in Yosemite in 2015, Delaware North owns the majority of all winter access into Yellowstone—without contractual revision by the National Park Service.\nPolitical\nIn 2020, Delaware North placed Vice President of Development Nate McMurray on unpaid leave without explanation. McMurray was running for Congress against Chris Jacobs, a member of the family that owns the company. McMurray viewed the move as retaliation for running against Jacobs.\nYellowstone National Park Labor Violations\nOn February 14, 2020, four Yellowstone Vacation Tours Employees, including two summer Yellowstone NPS rangers, were fired after a document leaked to management proposing terms of unification—terms including a living wage, healthcare, sick pay, and conversations over why Yellowstone Vacation Tours was taking in a number of guests with high risk for CoVid-19.  A fifth employee was fired three days later, less than an hour after participating in a peaceful protest.  Two more employees were later constructively discharged in the following weeks.  In March 2020, Delaware North, DBA Yellowstone Vacation Tours and Two Top Snowmobiles, was served with 11 federal labor charges.  Charges were built on evidence  that the managers in West Yellowstone: \"interrogated its employees about their sentiments regarding unions\"; \"surveilled the protected concerted activities of employees engaged in a picket\"; \"terminated and effectively terminated the employment of its employees for engaging in federally protected union activity\"; \"engaged in the conduct (...) because the employees (...) engaged in union and/or protected concerted activities, and to discourage employees from engaging in these or other union and/or protected, concerted activities\"; \"interfering with, restraining, and coercing employees in the exercise of the rights guaranteed in § 7 of the National Labor Relations Act of 1935 in violation of § 8(a)(1) of the Act\", \"discriminating in regard to the hire or tenure or terms or conditions of employment of its employees, thereby discouraging membership in a labor organization in violation of §§ 8(a)(1) and (3) of the National Labor Relations Act of 1935\".\nTD Garden\nIn March 2020 Delaware North owner Jeremy Jacobs responded to the pandemic by laying off tens of thousands of workers while other NHL and NBA owners pledged to compensate their employees for lost time due to cancelled games caused by the COVID-19 pandemic. Eventually the Bruins were the only team whose owners did not pay their employees for time off while Boston players like Brad Marchand and Charlie Coyle paid out of their own salary to pay the employees.\nAwards and recognition\nFive Delaware North chefs competed in the 2008 Culinary Olympics in Erfurt, Germany. Delaware North's corporate chef and chief culinary ambassador Roland Henin coached the group. Each chef earned an award for their efforts. Executive sous chef Ambarish Lulay and executive chef Scott Green earned silver medals.\nDelaware North Companies Parks & Resorts won the Space Foundation's Douglas S. Morrow Public Outreach Award in 2008.\nReferences\nExternal links\n*\n* [http://www.delawarenorth.com.au/ Delaware North Companies International website]"
    }
  ]
}