{
  "content": [
    {
      "type": "text",
      "text": "# Delaware Symphony Orchestra\n\n}}\nThe Delaware Symphony Orchestra is an American orchestra based in Wilmington, Delaware.  The orchestra gives its concerts primarily in the Grand Opera House.\nHistory\nIn the 19th century, Alfred I. du Pont founded the Tankopanicum Musical Club, considered the first precursor ensemble to the Delaware Symphony Orchestra.  Following the disbanding of the Tankopanicum Musical Club, two businessmen in Wilmington, Kellogg Kennon Venable Casey and Cyrus Peter Miller Rumford, established the Wilmington Orchestra in 1906, with August Rodemann as the orchestra's music director.  The Wilmington Orchestra gave its first concert 27 May 1907.  The Wilmington Orchestra disbanded in 1909 because of a lack of financial support.  In 1912, the Wilmington Symphony Club was established, as a principally amateur ensemble with Harry Stausebach as its conductor, and performed two concerts per season.  In 1929, the Wilmington Symphony Club changed its name to the Symphony Club of Wilmington, following a merger with the Wilmington Music School.\nStausebach stood down as the orchestra's music director in 1955.  Van Lier Lanning succeeded Stausebach as music director in 1955, and held the post until 1979.  During Lanning's tenure, in 1971, the orchestra formally changed its name to its current name, the Delaware Symphony Orchestra.  The orchestra's schedule also increased to three concerts per season, and subsequently to four concerts per season.\nStephen Gunzenhauser became music director of the orchestra in 1979.  During Gunzenhauser's tenure, the orchestra toured to Portugal and made its professional debuts in Washington D.C. and in New York City.  Gunzenhauser concluded his tenure in 2002.\nDavid Amado became music director in 2003.  During Amado's tenure, in 2009, the orchestra signed its first recording contract, from the Telarc International Corporation, to record a CD along with the Los Angeles Guitar Quartet.  Amado stood down as music director in 2023 and now has the title of music director laureate.\nIn November 2023, Michelle Di Russo first guest-conducted the orchestra, and subsequently became a finalist for the post of music director of the orchestra.  In May 2025, the orchestra announced the appointment of Di Russo as its next music director, effective with the 2025-2026 season.  Di Russo is the first female conductor to be named music director of the Delaware Symphony Orchestra.\nMusic directors\n* August Rodemann\n* Harry Stausebach\n* Van Lier Lanning (1955–1979)\n* Stephen Gunzenhauser (1979–2002)\n* David Amado (2003–2023)\n* Michelle Di Russo (2025–present)\nReferences\nExternal links\n*\n* [https://www.delawaresymphony.org/about/history/ Official page on the history of the Delaware Symphony Orchestra]"
    }
  ]
}