{
  "content": [
    {
      "type": "text",
      "text": "# Delaware Boundary Markers\n\n| locmapin  = Delaware#USA\n| built     =\n| builder   = Charles Mason; Jeremiah Dixon\n| added     = February 18, 1975\n| area      =\n| refnum    = 75002101\n}}\nThe Delaware Boundary Markers historic district is located along the state boundary lines between Delaware and Maryland, and between Delaware and Pennsylvania. The district includes 94 contributing sites along the Mason–Dixon line and includes the Transpeninsular Line, Post Marked West site, Tangent Line, the Arc Corner, and the Twelve-Mile Circle.\nThe district was added to the National Register of Historic Places on February 18, 1975, for its significance in engineering and politics/government.\nDescription\nThe markers are mainly on three parts of the Delaware boundary. First, the southern boundary with Maryland along the Transpeninsular Line from Fenwick Island to the Midpoint Marker, the first crownstone set by Mason and Dixon. Second, the western boundary with Maryland from the Transpeninsular Line Midpoint Marker to the boundary with Pennsylvania at the Tri-State Monument. Third, the northern boundary with Pennsylvania, the Twelve-Mile Circle. In addition, the starting measurement point, the Post Marked West, and the boundary from the Arc Corner Monument to the Tri-State Monument are included in the district.\nGallery\nFile:DE-MD-PA Tri-State Monument - detail looking northwest.jpg|Delaware–Maryland–Pennsylvania Tri-State Monument\nFile:Arc Corner Monument, DE-PA, detail.jpg|Arc Corner Monument\nFile:Mason and Dixon marker place.jpg|Post Marked West site\nSee also\n* National Register of Historic Places listings in northern New Castle County, Delaware\n* National Register of Historic Places listings in Sussex County, Delaware\n* National Register of Historic Places listings in Cecil County, Maryland\n* National Register of Historic Places listings in Wicomico County, Maryland\n* National Register of Historic Places listings in southern Chester County, Pennsylvania\nReferences\nExternal links\n*\n*  Journey to Mark the First State's Boundaries\n*"
    }
  ]
}