{
  "content": [
    {
      "type": "text",
      "text": "# Delaware, Ohio\n\n| map_caption              = Interactive map outlining Delaware\n| pushpin_map = Ohio#USA\n| pushpin_relief = yes\n| pushpin_label = Delaware\n| subdivision_type         = Country\n| subdivision_name         = United States\n| subdivision_type1        = State\n| subdivision_name1        = Ohio\n| subdivision_type2        = County\n| subdivision_name2        = Delaware\n| government_footnotes     =\n| government_type          = Council–manager government\n| leader_title             = Mayor\n| leader_name              =\n| leader_title1            = City Manager\n| leader_name1             =\n| established_title        = Founded\n| established_date         = 1808\n| unit_pref                = Imperial\n| area_footnotes           =\n| area_magnitude           =\n| area_land_km2            = 52.07\n| area_water_km2           = 0.32\n| area_total_km2           = 52.39\n| area_total_sq_mi         = 20.23\n| area_land_sq_mi          = 20.10\n| area_water_sq_mi         = 0.12\n| population_as_of         = 2020\n| population_est           = 45158\n| pop_est_as_of            = 2023\n| pop_est_footnotes        =\n| population_footnotes     =\n| population_total         = 41302\n| population_density_km2   = 793.20\n| population_density_sq_mi = 2054.42\n| timezone                = Eastern (EST)\n| utc_offset              = -5\n| timezone_DST            = EDT\n| utc_offset_DST          = -4\n| elevation_footnotes     =\n| elevation_ft            = 915\n| coordinates             =\n| postal_code_type        = ZIP codes\n| postal_code             = 43015\n| area_codes               = 740, 220\n| blank_name              = FIPS code\n| blank_info              = 39-21434\n| blank1_name             = GNIS feature ID\n| blank1_info             = 2394498\n| website                 =\n| footnotes               =\n}}\nDelaware is a city in Delaware County, Ohio, United States, and its county seat. It is located near the center of Ohio, about  north of Columbus as part of the Columbus metropolitan area. The population was 41,302 at the 2020 census. Delaware was founded in 1808 and was incorporated in 1816.\nHistory\nWhile the city and county of Delaware are named for the Lenape or Delaware people, the city of Delaware itself was founded on a Mingo village called Pluggy's Town. The first recorded settler was Joseph Barber in 1807. Shortly afterward, other men started settling in the area (according to the Delaware Historical Society); namely: Moses Byxbe, William Little, Solomon Smith, Elder Jacob Drake, Thomas Butler, and Ira Carpenter. In 1808, Moses Byxbe built the first framed house on William Street. Born in Delaware County in 1808, Charles Sweetser went on to become a member of the United States House of Representatives from 1849 to 1853. On March 11, 1808, a plan of the city was filed, marking the official founding of the town. Byxbe and the others planned the city to be originally on the east bank of the river, but it was switched to the west bank only a few days after the first plan was filed.\nEven though Delaware was still a small community, in 1812, when the capital of Ohio was moved from Chillicothe, Delaware and Columbus were both in the running and Delaware lost by a single vote to Columbus. However, following the War of 1812, settlers began arriving in Delaware in greater numbers. Among some of the earliest settlers were the parents of Rutherford B. Hayes, the 19th President of the United States. The Hayes home no longer stands, but a historical marker in front of a BP station marks the location. In 2018, the Rutherford B. Hayes Comes Home committee announced plans to raise $125,000 to get a statue of Hayes placed at the corners of William and Sandusky streets and a bust of Hayes to be placed at Rutherford B. Hayes High School. Committee Chairman Bill Rietz said that the committee would like to raise the money by October 4, 2019, Hayes' 197th birthday. The statue was successfully erected on October 4, 2019. It is a 125% scale depiction of the president, which stands at about 10 feet including its pedestal.\nHouse once stood in Delaware, Ohio]]\nIn the early days of the town, a sulfur spring was discovered northwest of Joseph Barber's cabin. By 1833, a hotel was built as a health spa near the spring. However, the Mansion House Hotel was a failure, and by 1841, citizens began raising funds to purchase the hotel property with the intent of giving it to the Ohio and North Ohio Methodist Episcopal Conference of the Methodist Church for the purpose of a Methodist college. With that effort, Ohio Wesleyan University was founded in 1844.\nRailroads came to the area in April, 1851 as Delaware served as a stop on the Cleveland Columbus and Cincinnati Railroad. Additional rail lines were added to serve Delaware providing access to major cities and markets throughout the country by the late 1890s. At the turn of the century, Delaware could boast of its own electric street railway system. In the early 1930s, electric inter-urban service was provided by the Columbus, Delaware and Marion system.\nDuring the Civil War\nDuring the Civil War, Delaware was the home to two Union training camps. The first on the west side of the Olentangy River for white recruits of the 96th and 121st Ohio Volunteer Infantry were mustered into service. The second, on the east side of the Olentangy River was for African-Americans joining the army in Ohio in the 127th Regiment of Ohio Volunteer Infantry - later renamed the 5th Regiment United States Colored Troops.\nGeography\nThe city is located approximately 24 miles north of Ohio's capital city, Columbus, due north along U.S. Route 23. The Olentangy River runs through the city.\nAccording to the United States Census Bureau, the city has a total area of , of which  are land and  is water.\nDemographics\n}}\n2020 census\n{| class=\"wikitable\" style=\"text-align:right\"\n|+Delaware racial composition\n!scope=\"col\"| Race\n!scope=\"col\"| Number\n!scope=\"col\"| Percentage\n|-\n!scope=\"row\"| White (NH)\n| 34,362\n| 83.2%\n|-\n!scope=\"row\"| Black or African American (NH)\n| 1,761\n| 4.26%\n|-\n!scope=\"row\"| Native American (NH)\n| 66\n| 0.16%\n|-\n!scope=\"row\"| Asian (NH)\n| 1,609\n| 3.90%\n|-\n!scope=\"row\"| Pacific Islander (NH)\n| 24\n| 0.06%\n|-\n!scope=\"row\"| Other/mixed\n| 3,480\n| 8.43%\n|-\n!scope=\"row\"| Hispanic or Latino\n| 1,816\n| 4.40%\n|}\n2010 census\nAs of the census of 2010, there were 34,753 people, 13,253 households, and 8,579 families residing in the city. The population density was . There were 14,192 housing units at an average density of . The racial makeup of the city was 90.6% White, 4.5% African American, 0.2% Native American, 1.4% Asian, 0.8% from other races, and 2.5% from two or more races. Hispanic or Latino of any race were 2.5% of the population.\nThere were 13,253 households, of which 35.9% had children under the age of 18 living with them, 48.7% were married couples living together, 11.7% had a female householder with no husband present, 4.4% had a male householder with no wife present, and 35.3% were non-families. 28.4% of all households were made up of individuals, and 9.4% had someone living alone who was 65 years of age or older. The average household size was 2.47 and the average family size was 3.04.\nThe median age in the city was 33.2 years. 25.5% of residents were under the age of 18; 11.8% were between the ages of 18 and 24; 30.5% were from 25 to 44; 21.1% were from 45 to 64; and 11.1% were 65 years of age or older. The gender makeup of the city was 48.0% male and 52.0% female.\n2000 census\nAs of the census of 2000, there were 25,243 people, 9,520 households, and 6,359 families residing in the city. The population density was . There were 10,208 housing units at an average density of . The racial makeup of the city was 92.8% White, 3.8% African American, 0.19% Native American, 0.84% Asian, 0.10% Pacific Islander, 0.55% from other races, and 1.66% from two or more races. Hispanic or Latino of any race were 1.2% of the population.\nThere were 9,520 households, out of which 34.7% had children under the age of 18 living with them, 52.1% were married couples living together, 11.1% had a female householder with no husband present, and 33.2% were non-families. 26.9% of all households were made up of individuals, and 9.1% had someone living alone who was 65 years of age or older. The average household size was 2.45 and the average family size was 2.98.\nIn the city the population was spread out, with 24.7% under the age of 18, 14.5% from 18 to 24, 31.0% from 25 to 44, 18.9% from 45 to 64, and 10.9% who were 65 years of age or older. The median age was 32 years. For every 100 females, there were 91.5 males. For every 100 females age 18 and over, there were 87.5 males.\nThe median income for a household in the city was $46,030, and the median income for a family was $54,463. Males had a median income of $33,308 versus $23,668 for females. The per capita income for the city was $20,633. About 6.8% of families and 9.3% of the population were below the poverty line, including 10.9% of those under age 18 and 8.6% of those age 65 or over.\nGovernment\nThe City of Delaware operates under a council–manager form of government. Council, as the legislative body, represents the entire community and is empowered by the city charter to formulate policy. City council has seven members: three elected at-large by all city residents, and four representing the four city wards and elected only by those ward residents. All council members serve four-year terms. The mayor and vice mayor are selected by council from among the at-large members and serve two-year terms.\nThe city manager handles the day-to-day administration of the city and is appointed by the city council.\nMayors\n*1954 to 1956: Paul Bale White\n*1956 to 1957: Edward Flahive\n*1958 to 1959: Paul B. White\n*1959 to 1961: Henry Wolf\n*1961 to 1963: Paul B. White\n*1963 to 1965: Donald Mathews\n*1965 to 1969: Robert Ray Newhouse\n*1969 to 1971: Gilford E. Easterday\n*1971 to 1973: John Jeisel III\n*1973 to 1977: Gilford E. Easterday\n*1978 to 1981: Donald Wuertz\n*1982 to 1983: Donald Worly\n*1984 to 1985: Michael Shade\n*1986 to 1989: Donald Wuertz\n*1990 to 1993: Michael Shade\n*1994 to 1995: Dennis Davis\n*1996 to 1999: Juliann Secrest\n*2000 to 2002: Tommy W. Thompson\n*2002 to 2009: Windell Wheeler\n*2009 to 2014: Gary Milner\n*2014 to present: Carolyn Kay Riggle\nCulture\nHistoric Northwest District\nThe Historic Northwest Neighborhood houses more than 500 homes and carriage houses listed on the National Register of Historic Places.\nThe Arts\nThe Arts are represented through a number of venues and groups that are part of the Arts Alliance of Delaware County including:\n* [https://www.arenafair.com/ Arena Fair Theater]\n* [https://www.artscastle.org/ The Arts Castle] and [https://www.artscastle.org/gallery-22/ Gallery 22]\n* [https://boardmanartspark.org/ Boardman Arts Park]\n* [https://centralohiosymphony.org/ Central Ohio Symphony]\n* [https://communityartsnetworkdoh.org/ Community Arts Network]\n* Delaware Arts Festival\n* Delaware Artists Guild\n* Ross Art Museum\n* [https://strandtheatreoh.org/ The Strand Theater and Cultural Arts Association]\nSports\nThe Little Brown Jug, a harness race takes place annually at the Delaware City Fairgrounds during the Delaware County Fair. The race is part of the Triple Crown of harness racing for Pacers, and holds the record for the largest crowd to see a harness race with 56,000 spectators.\nThe city also has its own minor-league soccer club, Delaware Rising F.C. The men's team competes in the Northern Ohio Soccer League (NOSL) across the state of Ohio with the majority of players from around the Delaware County area. Their home field is just outside of Downtown Delaware at Buckeye Valley High School's stadium.\nDelaware schools also feature numerous sports teams. These include Ohio Wesleyan University competing in the NCAA, Delaware Hayes High School competing in the OHSAA, and Delaware Christian High School competing in the OHSAA, as well as some of the local middle and elementary, public and private schools competing in various central Ohio leagues.\nOhio Wesleyan's Selby Field was once home to the Ohio Machine, men's professional lacrosse team from 2012 to 2015.\nTransportation\nU.S. Route 23, U.S. Route 36 and U.S. Route 42 pass through Delaware. Ohio Route 37 also passes east–west through Delaware.\nThe Delaware Municipal Airport, a public general aviation airport is at the southwest part of the city.\nThe Chesapeake and Ohio Railway, New York Central Railroad and the Pennsylvania Railroad operated passenger trains through separate stations in Delaware. The Pennsylvania Railroad ended its Columbus-Sandusky passenger trains by the early 1930s. The New York Central's Night Special (Cincinnati-Columbus-Cleveland) operated through its passenger station until 1965. The Chesapeake and Ohio's final train, a Detroit-Ashland, Kentucky train segment that met in Ashland with the main part of the George Washington, ran until April 30, 1971, on the eve of Amtrak.\nEducation\nOhio Wesleyan University\n's Sturges Hall located near Sandusky Street]]\nOhio Wesleyan is a private independent liberal arts college located in the heart of Delaware. Ohio Wesleyan University enrolls approximately 1,950 students from 40 states and more than 50 countries. Due to high enrollment of minority and international students at the university, it has influenced the international, ethnic and religious diversity of Delaware.\nThe Methodist Theological School in Ohio\nThe Methodist Theological School in Ohio is a graduate school seminary located between Delaware and Columbus, Ohio.\nDelaware City School District\nThe Delaware City School District, which encompasses Delaware and the surrounding area, enrolls about 5,700 PreK-12 students. Frank B. Willis Education Center (formerly the Intermediate School and High School) is home to the administrative offices of the district.\nHigh schools\n* Rutherford B. Hayes High School (Delaware, Ohio)\nMiddle school\n* John C. Dempsey Middle School\nElementary schools\n* Ervin Carlisle Elementary\n* James A. Conger Elementary\n* Robert F. Schultz Elementary\n* David Smith Elementary\n* Laura Woodward Elementary\nPrivate schools\nK-8\n* St. Mary School\nK-12\n* Delaware Christian School\nMedia\nThe dominant local newspaper in Delaware is a morning daily, The Delaware Gazette, founded in 1818. The paper is owned by Ohio Community Media. Other local print publications include ThisWeek Delaware News, owned by the Columbus Dispatch and the Transcript, the student paper at Ohio Wesleyan University.\nNotable people\n*Horace Newton Allen, U.S. diplomat\n*Alexander Borteh, professional poker player\n*Tyler Christopher, actor on General Hospital\n*Cody Coughlin, NASCAR driver\n*Cliff Curtis, baseball player\n*Amos Dolbear, American physicist and inventor\n*Francis Thomas Evans, Sr., pioneer aviator\n*Charles W. Fairbanks, the 26th Vice President of the United States\n*Arthur Flemming, former United States Secretary of Health, Education, and Welfare\n*Lloyd Gardner, diplomatic historian\n*Todd Goebbel, NCAA football coach and former player\n*Lucy Webb Hayes, First Lady\n*Rutherford B. Hayes, the 19th President of the United States (1877–1881)\n*Todd M. Hughes, Circuit Judge, U.S. Court of Appeals for the Federal Circuit\n*Clare Kramer, Actress known for playing Glory, of the TV series Buffy the Vampire Slayer\n*Vincente Minnelli, motion picture director\n*Frank L. Packard, Columbus architect\n*Branch Rickey, Major League Baseball executive\n*Buck Rodgers, professional baseball player\n*Frank Sherwood Rowland, a chemistry Nobel laureate\n*Friedrich Ferdinand Schnitzer, architect who designed and constructed Delaware City Hall\n*Sam Sulek, professional bodybuilder and media personality\n*Ezra Vogel, professor of Social Sciences at Harvard University\nSister cities\nA sister city partnership was signed May 13, 2011, by the Cities of Delaware and Baumholder, Germany, highlighting a four-day stay in Delaware by a Baumholder delegation, in which the guests established relationships with local government, business and educational leaders. The mayors signed a joint resolution, \"holding the firm belief that this agreement will contribute toward the peace and prosperity of the world, and do hereby pledge to cooperate with each other as twin/sister cities.\" The two cities have had a relationship since the early 1990s as the Ohio Wesleyan University men's soccer team travels to Baumholder for a series of summer friendly games.\nA sister city partnership was signed April 19, 2017, by the Cities of Delaware and Sakata, Japan. Delaware and Sakata have had close relations for years before this agreement, exemplified by Dempsey Middle School's Sakata exchange program where Sakata students come to live with Delaware host families once a year. This has gone on for the past 21 years, as of the 2018–2019 school year.\nReferences\nExternal links\n*[http://delawareohio.net Official site of the City of Delaware.]\n*[https://web.archive.org/web/20060313165254/http://www.conwaygreene.com/Delaware/lpext.dll?f=templates&fn=main-h.htm&2.0 Codified Ordinances of The City of Delaware Ohio] ''(Note: To expand the page's Contents, click on the yellow-folder icon.)''\n*[http://www.delawarecountymemory.org Delaware County Memory] - Digital archive of historical documents and artifacts from Delaware County\n*\n**\n**\n**\n**\n**\n}}"
    }
  ]
}