{
  "content": [
    {
      "type": "text",
      "text": "# Deluge (software)\n\n| latest release version =\n| latest release date = }}\n| latest preview version =\n| latest preview date = }}\n| repo =\n| programming language = Python\n| operating system = FreeBSD, Linux, macOS, Windows\n| genre = BitTorrent client\n| license = GPL-3.0-or-later\n| website =\n}}\nDeluge BitTorrent Client  is a free and open-source,  cross-platform BitTorrent client written in Python. Deluge uses a front and back end architecture where libtorrent, a  software library written in C++ which provides the application's networking logic, is connected to one of various front ends including a text console, the web interface and a graphical desktop interface using GTK through the project's own Python bindings.\nDeluge is released under the terms of the GPL-3.0-or-later license.\nFeatures\nDeluge aims to be a lightweight, secure, and feature-rich client. To help achieve this, most of its features are part of plugin modules which were written by various developers.\nStarting with version 1.0, Deluge separated its core from its interface, running it instead in a daemon (server/service), allowing users to remotely manage the application over the web. Deluge has supported magnet links since version 1.1.0 released in January 2009.\nHistory\nDeluge was started by two members of ubuntuforums.org, Zach Tibbitts and Alon Zakai, who previously hosted and maintained the project at Google Code, but who subsequently moved it to its own website.\nIn its first stages, Deluge was originally titled , to reflect that it was targeted for the GNOME desktop environment. When the first version was released on September 25, 2006, it was renamed to Deluge due to an existing project named gtorrent on SourceForge, in addition to the fact that it was finally coded to work not only on GNOME but on any platform which could support GTK.\nThe 0.5.x release marked a complete rewrite from the 0.4.x code branch. The 0.5.x branch added support for encryption, peer exchange, binary prefix, and UPnP.\nNearing the time of the 0.5.1 release, the two original developers effectively left the project, leaving Rory Mobley and Andrew \"andar\" Resch to continue Deluge's development.\nVersion 0.5.4.1 saw support for both Mac OS X (via MacPorts) and Windows being introduced.\nAround 2008, Deluge became notable for its resistance to Comcast's bandwidth throttling without a change in code, while clients like Vuze (Azureus) and μTorrent had to borrow the method implemented by Deluge.\nFrom version 1.1.1 through version 1.1.3, Windows installers were unavailable due to the Windows packager leaving the project. Windows became unavailable following the move to GTK3 in 2019. However, Windows installers, supporting both libtorrent 1.2.x and 2.0.x, are once again available starting with version 2.1.0 released in 2022.\nFollowing 1.1.3, packages for all non-Windows operating systems are no longer provided by the developers; instead, source tars and community provided packages were released.\nSee also\n* Comparison of BitTorrent clients\n* Usage share of BitTorrent clients\nNotes\nReferences\nExternal links\n*"
    }
  ]
}