{
  "content": [
    {
      "type": "text",
      "text": "# Demar Stewart\n\n| birth_place = Jamaica\n| height         =\n| currentclub    =\n| clubnumber     =\n| position       = Defender\n| youthyears1    =\n| youthclubs1    =\n| years1         = 2002\n| clubs1         = Bull Bay\n| caps1          =\n| goals1         =\n| years2         = 2003–2007\n| clubs2         = Portmore United\n| caps2          = 42\n| goals2         = 2\n| years3         = 2007–2009\n| clubs3         = Sheffield United\n| caps3          = 0\n| goals3         = 0\n| years4         = 2007\n| clubs4         = → White Star Woluwé (loan)\n| caps4          = 9\n| goals4         = 1\n| years5         = 2008–2009\n| clubs5         = → Chengdu Blades (loan)\n| caps5          = 47\n| goals5         = 0\n| years6         = 2011\n| clubs6         = Orlando City\n| caps6          = 15\n| goals6         = 2\n| nationalyears1 = 2006–\n| nationalteam1  = Jamaica\n| nationalcaps1  = 10\n| nationalgoals1 = 0\n| club-update       = 4 September 2011\n| nationalteam-update       = 4 September 2011\n}}\nDemar Stewart (born 15 December 1984) is a Jamaican footballer who plays football. He is the brother of Bristol City defender Damion Stewart.\nCareer\nClub\nStewart played for Jamaican sides Bull Bay and Portmore United before being signed up by Sheffield United in England in 2007. He then loaned out to Belgian lower league outfit White Star Woluwé FC because he did not qualify for a United Kingdom work permit, and was loaned again in early 2008 to Sheffield Unioted's Chinese affiliate Chengdu Blades, becoming the inaugural Jamaican player in the Chinese league.\nStewart made his debut for Chengdu against Dalian Shide in Round 4 of the 2008 season, and went on to play 47 games for the team over the next two season. When Chengdu Blades were relegated following a match-fixing scandal, Stewart left the club.\nIn 2011, Stewart entered training camp with Orlando City, and played in their first match against Philadelphia Union on 19 February. He signed a contract with the club on 21 February, but did not return for the 2012 season.\nInternational\nStewart progressed through Jamaica's youth programme, representing the country at the Under-17, Under-20 and Under-23 levels, before making his debut for the national team in 2006 in an international friendly against Peru. He has since gone on to make 10 appearances for the Reggae Boyz.\nReferences\nExternal links\n* [https://web.archive.org/web/20110919054715/http://www.orlandocitysoccer.com/team/roster/?player_id=14 Orlando bio]\n* [https://web.archive.org/web/20121006183319/http://jamaica-gleaner.com/gleaner/20081202/sports/sports1.html Peas in a pod ...Reggae Boy Demar Stewart tries to shake big brother's shadow]—interview"
    }
  ]
}