{
  "content": [
    {
      "type": "text",
      "text": "# Democracy or Demo Crazy\n\n}}}}\n| image         = File:Democracy or Demo Crazy.jpg\n| caption       = First edition\n| author        = Seyyed Mahdi Shojaee\n| translator   = Caroline Croskery\n| language      = English (Translated from Persian)\n| country       = Iran\n| genre         =\n| publisher     =  Candle and Fog Publishing\n| pub_date  = 2009\n| media_type    = Print (Hardcover, Paperback)\n| ISBN          = 9789642667802\n| pages         = 184\n}}\nDemocracy or Demo Crazy is a political satire novel written by Seyyed Mahdi Shojaee in Persian and translated to English by Caroline Croskery. Democracy or Demo Crazy was published by Candle and Fog Publishing in 2014. This book also published by Createspace Publishing in 2015.\nSynopsis\nThe government has changed from a monarchy to a democracy by order of a king who had ascended to the throne by succession. While the people have now attained the right to vote, the only candidates are the king's twenty-four sons, who will each serve for terms lasting two years. In the successive reign of each brother, oppression and injustice abound, and they spend their terms feasting, pillaging and plundering the country as much as possible, lining their pockets with enough cash to live out their days in luxury. Each time heading up to the new election, the people take refuge in their wishful thinking that the administration of the “next” prince will make things better. But things never change. The princes had all inherited their grandfather's first name, “Demo” as a prefix to their names. The king had named his twenty-fifth son who was lacking in both appearance, intelligence and character, Demo C’est Assez (meaning Demo “is enough”) but this last prince became known among the people instead as Demo Crazy because of his devious mind and volatile behavior. In an effort to deny any of the twenty-four brothers a second chance at the throne, the people finally decide to vote for prince number twenty-five, Demo Crazy, who is in no way considered qualified for the position. The people actually do not believe that he will win, but they vote for him because they believe that he will most likely be the least brutal, and less of a tyrant than any of the other brothers. Demo Crazy forms a circle of cohorts and enacts his own Demo Crazian principles which consist of a combination of oppression and deception of the masses. He embarks upon a mission to destroy the country, playing off his actions as a “service” to the people. As it turns out, he is really in fact an enemy agent, who after ultimately fleeing his own country and taking refuge in enemy lands, surrenders his nation to them. The behavior and documented speeches of Demo Crazy are truly astonishing, and even more unusual are the laws and regulations he exercised in ruling over his country. The question of whether or not the standard and conventional democracy in the world today is predicated upon the principles and methods that Demo Crazy carried out in this book is presented only as food for thought and not as a steadfast claim. The answer to this question will be left for the reader to decide.\nAbout the author\nSeyyed Mahdi Shojaee was born in August 1960 in Tehran. He is famous for his outstanding books on spiritual themes. After obtaining his high school diploma in mathematics, Shojaee entered the Dramatic Arts Faculty where he was conferred a bachelor's degree in Dramatic Literature. Simultaneously, he studied Political Science at Tehran University's Faculty of Law and Political Science, but left his studies unfinished to pursue a career in writing.\nAbout the translator\nCaroline Croskery was born in the United States and moved to Iran at the age of twenty-one. She holds a bachelor's degree from the University of California at Los Angeles in Iranian Studies. For many years she has been active in three fields of specialization: Language Teaching, Translation and Interpretation, and Voiceover Acting. She has taught English at the Iran Language Institute in Iran, translated feature films for subtitling at Farabi Cinema and Hozeh Honari, and performed actor dubbing of Persian films into English at IRIB, Sahar. Having lived in Iran for thirteen years, she returned to the US and began a ten-year career as a Persian-language interpreter for the Los Angeles County Superior Courts. She is an accomplished voiceover talent, and currently continues her voiceover career in both English and Persian.\nRelease details\n*First released in the Iran by Neyestan book Publishing in Persian, 2009.\n*Second released in early 2014 by the London-based Iranian publisher Candle and Fog Publishing in English.\n*Third released in April 2015 by Createspace Publishing in English.\nReferences"
    }
  ]
}