{
  "content": [
    {
      "type": "text",
      "text": "# Democracy and human rights\n\nThe relationship between democracy and human rights has been extensively discussed by political theorists. Part of the issue is that both \"democracy\" and \"human rights\" are contested concepts whose exact definition and scope is subject to ongoing dispute. Views include human rights as an integral part of democracy, human rights requiring democracy, and mutual support between both concepts.\nBackground\nMost scholars argue that human rights emerged from the citizenship rights held by individuals by virtue of being citizens in a polity, which were eventually universalized as human rights, held by all humans. Over time, people used the language of rights to articulate and secure a wider-ranging range of concerns. Todd Landman writes, \"there is much overlap between democracy and human rights, as both are grounded in shared principles of accountability, individual integrity, fair and equal representation, inclusion and participation and non-violent solutions to conflict\".\nDemocracy as a human right\nProtocol 1, Article 3 of the European Convention on Human Rights guarantees the right to vote in free and fair elections. However, not all writers accept that democracy is a human right.\nHuman rights as necessary to democracy\nA limited protection of civil and political rights is necessary for a democracy to function.\nSeparationist thesis\nSome writers view human rights and democracy as separate things that may not go together. Although they support human rights for everyone, they may not agree that democracy is necessarily an ideal political system for the entire world.\nTension between human rights and democracy\nA tension potentially exists between human rights and democracy. In a democracy, the policies that are popular are not necessarily those which protect human rights, particularly those of non-citizens.\nReferences\nSources\n*\nFurther reading\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*"
    }
  ]
}