{
  "content": [
    {
      "type": "text",
      "text": "# Democratic Revolutionary Front for the Liberation of Arabistan\n\n| motives          = Secession from Iran, formation of an Arab state of Arabistan\n| area             = Khuzestan, Iran\n| ideology         = Arab nationalism\n| crimes           =\n| status           = Sided with Iraq during the Iran–Iraq War, later morphed into the Arab Struggle Movement for the Liberation of Ahwaz (ASMLA)\n| size             =\n| revenue          =\n| financing        =\n| allies           =  Iraq\n| opponents        =\n| battles          = *Arab separatism in Khuzestan\n*Khuzestan uprising\n*Iranian Embassy siege\n*Iraqi invasion of Iran\n| predecessor      =\n}}\nThe Democratic Revolutionary Front for the Liberation of Arabistan (DRFLA; , al-Jabha al-dīmuqrāṭiyya al-thawriyya li-taḥrīr ‘Arabistān) was an Iranian Arab militant group campaigning for the independence of the largely Arab-populated Khuzestan province in Iran, founded in 1979 as a splinter group of the Popular Front for the Liberation of Ahwaz (PFLA). It is most famous for the 1980 Iranian Embassy siege in London, United Kingdom. It was led by Arab nationalist Oan Ali Mohammed, who was killed during the siege by British SAS operatives. The group was supported by Iraq under Saddam Hussein.\nHistory\nThe DRFLA was originally a splinter group of the  (PFLA). It was one of the Iraqi-backed groups seeking the independence of the largely Arab-populated Khuzestan province in southwestern Iran. The DRFLA claims to have taken part in the 1979 Iranian Revolution, assisting Ayatollah Ruhollah Khomeini's uprising which overthrew the Shah, Mohammad Reza Pahlavi, and subsequently established an Islamic republic, effectively ending the millennia-old inherited Persian monarchies. However, shortly after the revolution, the DRFLA began an insurgency in Khuzestan which resulted in more than a hundred killed on both sides, and Iran declared a state of emergency in Khuzestan on 31 May 1979.\nIranian embassy siege\nIn 1980, DRFLA militants besieged the Iranian embassy in London and took 26 hostages, threatening to execute them unless the United Kingdom secured the release of 91 Arabs incarcerated in various Iranian prisons. They also demanded that all the Arab states' diplomatic ambassadors in London mediate on their behalf with the British government. The British Prime Minister Margaret Thatcher responded by authorizing Operation Nimrod to free the hostages. After negotiations with the Arab militants became bogged down, the Special Air Service stormed the building and killed the DRFLA leader, Towfiq Ibrahim al-Rashidi, along with all but one of the other militants while suffering no fatalities themselves. Iran's government accused Britain of having organized the occupation of the embassy, boosting anger and mistrust.\nLater history\nAfter this incident, the DRFLA did not take part in any major militant attacks and remained largely inactive until the 1980 Iraqi invasion of Iran, where they sided with Iraq as open belligerents in the ensuing Iran–Iraq War. The DRFLA played an effective role in supporting the Iraqi invasion and harassing Iranian troops, and has participated in the 1980 battle of Khorramshahr which resulted in an Iraqi victory and capture of the city of Khorramshahr by Iraqi forces. The group has been defunct since 1980, with its spiritual successor being the currently-active Arab Struggle Movement for the Liberation of Ahwaz (ASMLA).\nReferences\nFurther reading\n*Chant, Chris (2012). Special Forces. Parragon. ."
    }
  ]
}