{
  "content": [
    {
      "type": "text",
      "text": "# Democracy of the Carpathian type\n\nDemocracy of the Carpathian type () or Carpathian democracy () is a pejorative term that began to be used in Slovak (initially mainly journalistic) practice in the 1990s. The term expresses the view that democracy in Slovakia does not function perfectly, and that this deficiency stems not from democracy itself as a form of political system, but from the political practice and political culture in Slovakia. Thus, the concept of Carpathian democracy is perceived as a kind of \"idiosyncratic type of democracy\" different from the standard form of democracy or as a \"pseudo-democracy\".\nThe term was originally used in connection with criticism of the policies of Slovak Prime Minister Vladimír Mečiar and his government. Later, the term was also used in connection with criticism of the government of Prime Minister Robert Fico (and his party Direction – Social Democracy, in the style of \"Carpathian Social Democracy\"). However, it was also associated with other figures in Slovak politics, such as Ján Slota or the People's Party Our Slovakia.\nThe attribute \"of the Carpathian type\" began to be used later in the political and journalistic environment in Slovakia in other contexts expressing negative connotations.\nOrigin and use\nIn a negative political sense, the term \"Democracy of the Carpathian type\" began to be used sometime in the mid-1990s in connection with criticism of the policies of Vladimír Mečiar and his government. According to journalist Marián Leško, the term was coined by Slovak political commentators. The publicist Róbert Kotian, who used the term  in an article of Sme journal on 21 January 1995, claims to have taken it from an unspecified commentator of the Nový čas journal.\nAfter the fall of Mečiar's political power (1998), the term continued to be used in the context of criticism of certain negative phenomena in Slovak politics. For example, the journalist Peter Schutz wrote in 2001: ''\"as far as political content is concerned, even two or three years before joining the EU, we are still a Carpathian-type people's democracy. Who has ever seen it in a civilised country that the greatest attraction to [...] (any) election is the fear of a candidate of a different ethnicity winning.\"''\nThe term began to be mentioned in connection with Prime Minister Robert Fico as early as the period of the Fico's First Cabinet. In 2007, for example, the term was linked to the government by commentator Juraj Hrabko, when the speaker of Slovak parliament Pavol Paška tried to falsify the adopted law on social insurance and ordered a different wording than the one approved by the National Council of the Slovak Republic (\"...the rapid growth of Carpathian-style democracy does not bode well. Not for those who rejected it both under Mečiar and Dzurinda and still do. But also for those who, this time under Robert Fico, sympathise with it.\").\nSince the mid-2010s, the term has been used again in relatively large numbers. It was used in the song Nenadávajte na politikov (transl. Don't swear at the politicians) by the group Iné Kafe.\nThe pejorative attribute \"of Carpathian type\" or \"Carpathian\" has been adopted and used in various contexts by the wider political, professional or social sphere. For example, the term \"Carpathian type capitalism\" has been used frequently. The far-left politician Artur Bekmatov spoke of \"Carpathian-type entrepreneurs\". \"Carpathian type liberalism\" together with the term \"Carpathian type capitalism\" was one of the subjects of the 2007 book A Social or a Liberal State? by Jozef Mihalík.\nIn nowadays Slovak linguistic practice, the adjective also conveys critical negative connotations in other cases, e.g. \"Carpathian-type hospital standard\".\nDescriptions and opinions\nTibor Ferko (2002): ''\"[...]From here on eastwards, culture and politics have already taken on a Byzantine character, and a return in any modified disguise to the pre-1998 Mečiar's Carpathian democracy promised us only the prospect of a long-term stay outside the eurozone[...]\"\nVasil Gluchman et al. (2011): \"[...] democracy in Slovakia in that period (note: in the 1990s) also had a very interesting form of Carpathian-type democracy, where it was possible to break all democratic parliamentary rules in one long parliamentary night, to usurp all executive and legislative power, to make the opposition a statistic without any possibility of controlling power and influence on the course of political life in Slovakia.\"\nMarián Leško (2014): \"Suppression of the opposition, purges in the state administration and its politicisation, restriction of minority rights, use of intelligence for criminal purposes, attacks on trade unionists, churches, journalists, artists, academics and NGOs have become part of it (Democracy of the Carpathian type). Because numerous demarches and other warnings from abroad did not work, after the failed referendum the countries of the European Union and NATO definitively ceased to consider the Mečiar regime as an acceptable partner for membership talks.\"\nMichal Cirner (2017): \"[... the granting of Mečiar's amnesties] was fortunately already the swan song of the political system of illiberal democracy of the Carpathian type, which is fixedly associated with the name of Vladimir Mečiar. The amnesties granted in 1998 by the then prime minister and acting president in one person made it impossible to solve the most prominent cases of that period – the death of Róbert Remiáš, the kidnapping of the president's son, and the role of the Slovak secret service led by Ivan Lexa in these tricky matters.\"\nMartin Bútora (2019): \"A few years after the change in 1989, elements of what was then called 'Carpathian democracy' flourished there, characterized by violations of constitutionalism and the basic rules of the liberal-democratic order.\"\nBranislav Škripek (February 7, 2024, speech in the parliamentary debate, abridged): \"[...] this is not Dutch or British or American democracy, but democracy of the Carpathian type in this basin, because here we treat democracy as we like. So it can be abused to one's advantage when one gets power [...] but democracy without truth and morality is twisted into a perversion of justice. [...]\"''\nReferences"
    }
  ]
}