{
  "content": [
    {
      "type": "text",
      "text": "# Demolition of monuments to Alexander Pushkin in Ukraine\n\n]]\nThe demolition of monuments dedicated to Russian poet and playwright Alexander Pushkin in Ukraine started during the Russo-Ukrainian War. Since the Russian invasion of Ukraine in 2022, it has become a widespread phenomenon and dubbed by Ukrainians Pushkinopad (), a pun literally translated as \"Pushkinfall\", akin to the \"Leninfall\" during the decommunization process. This wave of dismantling is part of the process of derussification in Ukraine.\nSince the 2022 Russian invasion Pushkin is viewed in Ukraine as a Russian propaganda symbol. Hence since the Russian invasion dozens of local Pushkin monuments and hundreds of Pushkin streets in Ukraine have been dismantled and the streets renamed.\nHistory and incidents\nPrior to 2022 Pushkin was the third most common historical figure represented in Ukraine's streetscapes. In 2021 thousands of toponymic objects in Ukraine were named after him. In Poltava Oblast alone, as of February 24, 2022, 120 toponymic objects were named after Pushkin.\nUkrainian researcher Volodymyr Yermolenko claimed that Russian literature has been a \"vehicle of the country’s imperial project and nationalist world-view,\" giving as examples Pushkin, Lermontov and Gogol. He mentioned Pushkin's poem Poltava, which recounts the revolt of Ukrainian Cossack hetman Ivan Mazepa against Tsar Peter the Great during the Swedish invasion of Russia and portrays Mazepa – who had sided with the invading Swedes – as a lecherous traitor. Following the Russian invasion of Ukraine in February 2022, Pushkin's situation turned out to be quite similar to the destruction of monuments to Lenin known as Leninopad. The phenomenon was dubbed \"Pushkinopad\" (Пушкінопад) by Ukrainians, a pun literally translated as \"Pushkinfall\", with the coinage of \"-пад\" being akin to English words suffixed with \"fall\" as in \"waterfall\", \"snowfall\", etc.\n. Erected in 1899, it was the oldest monument to Pushkin in the city.]]\nThe first event that became widely known was the dismantling of the monument to Pushkin in Mukachevo on April 7, 2022. Monuments to the Russian poet were dismantled in Uzhhorod and Ternopil on April 9. Serhiy Nadal, mayor of Ternopil from the far-right Svoboda party, commented:}}\nDuring the Russian invasion of Ukraine in 2022 Pushkin was used as a Russian propaganda symbol. During the Russian occupation of the Ukrainian city of Kherson, billboards with the image of Pushkin were seen in the streets as part of a propaganda campaign proclaiming that Russia was “here for ever”. Ukrainian forces liberated the city of Kherson on 11 November 2022.\nIn 2022 works by Russian and Soviet authors were removed from the foreign literature curriculum of Ukrainian schools, including works by Pushkin.\nIn March 2023, the Ukrainian parliament passed the Law of Ukraine \"On the Condemnation and Prohibition of Propaganda of Russian Imperial Policy in Ukraine and the Decolonization of Toponymy\", which forbade toponymy associated with Russia. On April 21, 2023, President Volodymyr Zelenskyy signed the law. According to the Ministry of Culture and Strategic Communications \"Alexander Pushkin is the \"great mighty Russian language\", he is an approval of the aggressive policy of the Russian tsars, he is a justification of the wars and genocides of the Russian government.\"\nEarly June 2024 the Ukrainian NGO  reported that there were less than 300 Pushkin streets to be renamed in Ukraine. The largest number of streets, alleys and squares named after Pushkin remained in Zaporizhzhia Oblast (57 toponyms) and Vinnytsia Oblast (38 toponyms). In April 2025 Decommunization.Ukraine stated that the highest number of remaining monuments and plaques dedicated to Pushkin were located in Odesa Oblast, 6 of which located in Odesa. While in the whole of Russian occupied Donetsk Oblast only 5 monuments were located (4 in Donetsk and 1 in Mariupol). 3 Pushkin plaques remained (in April 2025) in Kyiv, including one hidden from the public in Kyiv Metro station Universytet.\nTimeline\n* On March 22, 2022, a resident of Ternopil painted a Pushkin monument red and wrote \"stop war\" on it. In Ternopil, the monument to the poet was erected in 1961. The first initiatives to demolish it appeared in 2014, after the start of the Russo-Ukrainian War.\n* On April 7, 2022, a monument to Pushkin was demolished in Mukachevo. The very next day, the Uzhhorod City Council also decided to dismantle the monument to Alexander Pushkin\n* On April 11, 2022, a bust of Pushkin was dismantled in the village of Zabolotivtsi, Lviv Oblast.\n* On April 19, 2022, in Kropyvnytskyi, they proposed to remove the monument to Pushkin, which currently stands near the Pedagogical University. The monument was dismantled on July 8, 2022.\n* On April 26, 2022, a monument to Alexander Pushkin was torn down in the village of Pushkino in the Berehove Raion of the Zakarpattia Oblast, and meetings began to rename the village.\n* On April 28, 2022, a monument to Pushkin was dismantled in Konotop. The head was torn off during the dismantling of the monument.\n* On April 30, 2022, a Pushkin monument was destroyed in Chernihiv.\n* On May 5, 2022, a memorial plaque to Pushkin was dismantled in Vinnytsia.\n* On May 8, 2022, the bust was dismantled in Deliatyn, Ivano-Frankivsk Oblast.\n* On May 13, 2022, a bust of Pushkin was dismantled from the entrance gate of the Oleksandriia Dendrological Park in Bila Tserkva.\n* On May 21, 2022, a monument to Pushkin was dismantled in Mykolaiv.\n* On June 1, 2022, a monument to Alexander Pushkin was damaged in Nikopol.\n* On June 3, 2022, the \"Ukrainian People's House\" society proposed to remove the bust of Pushkin from the building of the Olha Kobylyanska Drama Theater in Chernivtsi and replace it with the bust of Yurii Fedkovych. The director of the theater supported the proposal but stressed that all legal requirements and regulations had to be met before removing the bust.\n* On June 16, 2022, a working group of the Ministry of Education and Science of Ukraine decided to remove more than 40 works by Soviet and Russian authors, including Alexander Pushkin, from school textbooks.\n* On July 26, 2022, a bust of Pushkin was dismantled in Zaporizhzhia. The bust made of forged copper stood in the city for more than 20 years and was dismantled with the permission of the mayor's office.\n* On September 1, 2022, a bust of Pushkin was dismantled in Kyiv on the territory of gymnasium No. 153 (named after Pushkin).\n* On October 11, 2022, unknown persons dismantled the second bust of Pushkin in front of the National Transport University in Kyiv. The co-founder of the \"Decommunization Ukraine\" project said that the dismantling was dedicated to Lieutenant of the Armed Forces of Ukraine Denys Antipov, alias \"Buk\" – a well-known public activist, teacher of the Korean language at the Taras Shevchenko National University of Kyiv, who had died in May 2022 in a battle with Russian invaders.\n* On November 9, 2022, a bust of Pushkin, which stood on Poetry Maidan in Kharkiv, was dismantled and sent for safekeeping. The Kharkiv City Council stated that this monument, and possibly others, should be preserved, but the residents will decide this issue in peacetime. The pedestal of the monument was dismantled on June 5, 2024.\n* On November 11, 2022, a monument to Pushkin was dismantled in Zhytomyr.\n* On November 11, 2022, a monument to Pushkin in the city of Zhmerynka was dismantled.\n* On November 16, 2022, Pushkin Avenue in Dnipro was renamed Lesia Ukrainka Avenue. A monument to Pushkin that stood there was dismantled on December 16, 2022.\n* On November 17, 2022, a statue of Pushkin was dismantled in Chernivtsi.\n* On November 20, 2022, unknown persons overthrew a bust of Pushkin in Nikopol.\n* On November 21, 2022, a monument to Pushkin in Kremenchuk was dismantled.\n* On November 29, 2022, a memorial plaque to Pushkin was dismantled in Mykolaiv.\n* On November 29, 2022, a monument to Pushkin was dismantled in Ananiv.\n* On December 9, 2022, the monument to Pushkin in the city of Tulchyn was dismantled.\n* The monument to Pushkin in Dnipro was dismantled on December 16, 2022.\n* On December 23, 2022, the second sculpture of Pushkin was dismantled in the city of Chernivtsi.\n* On December 24, 2022, it was dismantled in the city of Krolevets.\n* On December 27, 2022, the bust of Pushkin was dismantled from the facade of the Chernivtsi Drama Theater named after Olha Kobylianska.\n* On December 29, 2022, the bust was dismantled in Polonne.\n* On December 29, 2022, the second memorial plaque to Pushkin was dismantled in the city of Mykolaiv.\n* On December 30, 2022, a monument to Pushkin was dismantled in Kramatorsk.\n* In April 2023, the Poltava City Council voted to dismantle the monument to Pushkin in this city. Also in April 2023, \"Pushkin Park\" was renamed \"Family Park\" in Kramatorsk.\n* On May 3, 2023, (in its second reading) the Verkhovna Rada adopted the law \"On Amendments to the Law of Ukraine On the Protection of Cultural Heritage\" which legalized the removal of \"Soviet and imperial cultural monuments\" from the state register.\n* On July 13, 2023, Pushkin Park in Kyiv was renamed Ivan Bahrianyi Park. On 15 November 2023 the monument to Pushkin that had remained in the park was dismantled.\n*On 23 October 2023 a theater in Kharkiv that was named after Pushkin dropped his mentioning in its name and  was renamed to Kharkiv Academic Drama Theater.\n* On January 12, 2024, a bas-relief of Alexander Pushkin  and other artwork in the station that had incorporated poetry by Aleksandr Pushkin was removed from the Pushkinska station of the Kharkiv Metro.\n* On 26 January 2024 the Kharkiv City Council renamed Kharkiv's Pushkinska street to Hryhorii Skovoroda street. This was done in response to a 23 January 2024 Russian bombing of Kharkiv that cased 9 victims, including a 4-year-old child. In the evening in particular, the central Pushkinska Street had been hit. On 29 April 2024 the Kharkiv metro station on the street that was also named after Pushkin was renamed its current name Yaroslava Mudroho.\n* On August 15, 2024, a bust of Pushkin was dismantled in one of the city's squares in Bilhorod-Dnistrovskyi.\n*On July 1, 2025 the Pushkin monument in the city centre of Berestyn was removed and relocated to the local  museum.\nSee also\n* Demolition of monuments to Vladimir Lenin in Ukraine\nReferences\nExternal links\n* [https://www.pravda.com.ua/articles/2022/04/25/7341708/ Special operation \"Derussification\". Interview with Vakhtang Kipiani, Editor-in-Chief of Historical Truth]"
    }
  ]
}