{
  "content": [
    {
      "type": "text",
      "text": "# Democratic Republic of the Congo–Uruguay relations\n\nDemocratic Republic of the Congo–Uruguay relations are the bilateral relations between the Democratic Republic of the Congo and Uruguay.\nHistory\nDiplomatic relations between the two countries were established on 31 March 1984.\nIn late March 2001, Uruguayan troops were deployed as UN peacekeepers to the United Nations Mission in the Democratic Republic of the Congo (MONUC), during the Second Congo War, initially stationed in the city of Goma. However, the Uruguayan military presence has remained continuously deployed after the conflict. The first Uruguayan unit deployed was the Reinforced Rifle Company “Uruguay IV”, composed of 223 personnel. It was also the very first UN-designated subunit to arrive in the region. Shortly thereafter, the permanent “Uruguay Battalion” was established, and the “Uruguay I” company, led by National Army engineers, was tasked with providing potable water for the United Nations, NGOs, and the local civilian population.\nUruguay is among the countries contributing the highest number of personnel to UN peacekeeping operations. Its mission in the Congo remains the longest-standing deployment of the Uruguayan Army abroad.\nIn late April 2004, Jorge Batlle became the first Uruguayan president to pay an official visit to the Democratic Republic of the Congo. During his visit, he met with President Joseph Kabila and visited the contingent of Uruguayan troops deployed in the UN peacekeeping mission. He also toured local facilities and declared that Uruguay's participation in the mission was a “moral obligation”.\nIn July 2004, a delegation from the Democratic Republic of the Congo visited Uruguay to follow up on agreements related to water treatment plants, agricultural matters, and trade relations between the two countries. The Congolese officials held meetings with representatives from Uruguay's Ministry of Foreign Relations and the Armed Forces, and visited companies specializing in the production of water treatment systems.\nAs a member of the United Nations Security Council, in March 2016 and 2017, Uruguay advocated for maintaining the number of personnel deployed in the United Nations Stabilization Mission, during discussions on the renewal of its mandate and a recommendation to reduce troop levels. In March 2016, Uruguayan Vice President Raúl Fernando Sendic paid an official visit to the DR Congo, accompanied by the President of the Chamber of Representatives, Gerardo Amarilla. During their stay, they held meetings with President Joseph Kabila and legislative authorities, and visited the Uruguayan troops deployed in Goma.\non a visit to Uruguayan troops in the DR Congo, 2021]]\nIn December 2021, Uruguayan President Luis Lacalle Pou visited the country's deployed forces in the DR Congo during the Christmas celebrations. Accompanied by Minister of Defense Javier García, he spent Christmas Eve with Army personnel in Goma and joined Air Force members for lunch in Bukavu on Christmas Day.\nIn August 2025, a Congolese delegation led by Deputy Prime Minister Guy Kabombo Muadiamvita, accompanied by the Ministers of Culture and Foreign Affairs, paid a visit to Uruguay, where they held a meeting with President Yamandú Orsi and other Uruguayan officials. The authorities of both countries signed agreements on innovation and culture and expressed their willingness to advance commercial cooperation.\nHigh-level visits\nHigh-level visits from the DR Congo to Uruguay\n* Deputy Prime Minister Guy Kabombo Muadiamvita (2025)\n* Minister of Culture Yolande Elebe Ma Ndembo (2025)\n* Foreign Minister Thérèse Kayikwamba Wagner (2025)\nHigh-level visits from Uruguay to the DR Congo\n* President Jorge Batlle (2004)\n* Minister of Defense Luis Rosadilla (2010)\n* Vice President Raúl Fernando Sendic Rodríguez (2016)\n* President Luis Lacalle Pou (2021)\nDiplomatic missions\n* The DR Congo is represented in Uruguay through its embassy in Buenos Aires (Argentina).\n* Uruguay is represented in the DR Congo through its embassy in Pretoria (South Africa).\nReferences"
    }
  ]
}