{
  "content": [
    {
      "type": "text",
      "text": "# Demobilisation of the Australian military after World War II\n\nThe demobilisation of the Australian military after World War II involved discharging almost 600,000 men and women from the military, supporting their transition to civilian life and reducing the three armed services to peacetime strengths. Planning for the demobilisation process began in 1942 and thousands of servicemen and women were discharged in the last years of the war in response to shortages of labour in the domestic war economy. The general demobilisation of the military began in October 1945 and was completed in February 1947. The demobilisation process was largely successful, but some military personnel stationed in the South West Pacific complained that their repatriation to Australia was too slow.\nThe disposal of surplus military equipment took place at the same time as the size of the services was being reduced. The disposal process was managed to limit its economic impact. Most equipment was transferred to other government agencies, sold or destroyed by the end of 1949.\nPlanning\nPlanning for the demobilisation of the Australian military began at the end of 1942 when the Department of Post-War Reconstruction was formed. The department was involved with drawing up plans for determining veterans' entitlements and the assistance which would be provided to discharged personnel to help them settle into civilian life. That included planning the delivery of training, housing and ensuring that jobs were available. An important consideration was to ensure that civilian employment opportunities were created at an appropriate rate as the size of the military was reduced. It was decided to achieve that by continuing many wartime economic regulations such as price controls to limit inflation and direct resources to where the Australian Government believed they were most needed.\nThe Australian War Cabinet approved the Department of Post-War Reconstruction's proposed principles to govern demobilisation on 12&nbsp;June 1944. The key element of the principles was that the order in which personnel would be demobilised was to be based on a points system, with service men and women being allocated points on the basis of their period of service, age, marital status and employment or training prospects. An extensive demobilisation plan was then developed by an interservice committee following further consultation with trade unions, employers and returned servicemen. The plan was accepted as the basis for planning by the War Cabinet on 6&nbsp;March 1945. The rate at which personnel were to be discharged was set at 3,000 a day for six days a week and was to be capable of being increased in the event of an emergency.\nThe final demobilisation plan assigned differing scales of points for service men and women. Service men were allocated two points for each year of age based on their age at enlistment and a further two points for each month of service if they did not have dependent children or three points if they did. Service women received three points for each year of age at enlistment and a point for each month of service. Women with children were given priority for demobilisation, followed by those who had married before the end of the war. Service women who married after the war could ask for an early discharge on compassionate grounds. Men were also eligible for early discharge on compassionate or health grounds, if they had skills which were important to the Australian economy or had been accepted into a full-time training course.\nLimited demobilisation began during the final years of the war. In order to meet the needs of the war economy 20,000 soldiers were released from the Australian Army in October 1943. Further reductions took place in August 1944 when another 30,000 soldiers and 15,000 personnel from the Royal Australian Air Force were discharged. In mid-1945 the Government implemented a policy in which service men and women who had completed five years of service, including at least two years outside Australia, could volunteer for discharge.\nPost-war demobilisation\nThe demobilisation plan was put into action on 16&nbsp;August 1945, the day after Japan surrendered. The military then had a strength of 598,300 men and women, 310,600 in Australia, 224,000 serving in the South West Pacific Area (SWPA) and 20,100 in Britain and other parts of the world. The only personnel to be discharged during August and September were former prisoners of war and those with a long period of service; general demobilisation did not begin until 1&nbsp;October 1945. During the intervening months dispersal centres were established in each state and territory's capital city. The centres were to provide information on employment, land settlement, housing, training, loans, tools for trades and other benefits for service personnel as their discharges were processed. Lieutenant-General Stanley Savige was appointed the Coordinator of Demobilisation and Dispersal in September.\nFormer prisoners of war were given a high priority for repatriation back to Australia and discharge. Planning for the recovery of prisoners of the Japanese, most of whom had been held in harsh conditions, had begun in 1944 and the 2nd and 3rd Australian Prisoner of War Reception Groups were established at Singapore and Manila respectively in August 1945. By the end of September most of the prisoners recovered from Singapore, Java and Sumatra had been returned to Australia along with about half of those recovered from the Bangkok area. Transport shortages delayed the repatriation of Australian prisoners from Formosa, Japan and Korea, but almost all were on their way home by mid-September.\nIn line with a plan approved by the Australian Government in September 1945, general demobilisation was conducted in four stages. The first stage ran from October 1945 to January 1946 and involved the discharge of 249,159 personnel, which was higher than the targets of 10,000 members of the Royal Australian Navy, 135,000 soldiers and 55,000 airmen specified in the demobilisation plan. In the second stage 193,461 personnel left the military between February and 30 June 1946 though that was slightly lower than the target of 200,000. The third stage ran from 1 July to 31 December, when the services had been reduced to 78,000 personnel, which was considered the strength necessary for the military's postwar tasks. Of the remaining servicemen, those who did not wish to volunteer for continuing service in the military were released in the fourth stage which began on 1&nbsp;January 1947. At the end of the process, the military's strength had fallen 60,000 personnel. If possible, service men and women were placed on leave and allowed to return home while awaiting discharge.\nThe demobilisation of the military included disbanding the female branches of the three services. The Women's Royal Australian Naval Service, Australian Women's Army Service and Women's Auxiliary Australian Air Force had been formed during 1941 and 1942 to enable women to serve in the military but were disbanded during 1947, with military service being again restricted to men. Demobilised service women were provided with similar assistance to male members of the military, but were placed under pressure to return to traditional family roles.\nThe return of Australian personnel from the SWPA was delayed by shipping shortages and the need to maintain a force in the area for garrison duties. The military provided the personnel with training courses to prepare them for civilian life. Refresher courses in basic subjects such as maths and English were run first before vocational training began. The teachers and instructors for the courses were service personnel selected on the basis of their civilian occupations. In addition, sport competitions were conducted to keep the men busy.\nMany men in the SWPA believed that the demobilisation process was too slow. On 10&nbsp;December 1945 4,500 men at Morotai in the Netherlands East Indies staged a protest march demanding that shipping be made available to return them to Australia. Soldiers at Bougainville also complained about having to remain on the island after the war had ended, and Prime Minister Ben Chifley's plane was sabotaged in an apparent protest during his visit on 27&nbsp;December 1945. Minister for Defence Frank Forde was largely blamed for the slowness with which military personnel were being demobilised. As a result, he lost his seat at the 1946 election though the Labor Party itself comfortably retained office.\nDespite the dissatisfaction of the men in the SWPA, the demobilisation and repatriation process generally proceeded smoothly. Most men had been returned to Australia by January 1946 and 80 percent were demobilised by the middle of the year. Before leaving the military service men and women attended either a dispersal centre or naval depot where they were provided with a medical examination, interviewed by a rehabilitation officer and provided with information about the benefits they were eligible for. The Manpower Directorate was then responsible for placing discharged personnel in employment as well as providing them with identity documentation and ration entitlements. Training courses were made available to veterans, and by 1951 94,000 had completed university, technical or rural training courses and 39,000 were still in training. A further 135,000 began training but withdrew before completing their course.\nDemobilisation also included establishing arrangements for the medical care of ex-service personnel. After the war responsibility for medical treatment was gradually transferred from the services to the Repatriation Commission. The Army's hospitals were also transferred to the Commission, meeting its immediate need for facilities. It proved necessary to build new hospitals for the treatment of tuberculosis and mental disorders, but as the specialised Army hospitals established for the treatment of the conditions were respectively unsatisfactory, they had to be returned to the Government of New South Wales. The Department of Social Services was responsible for providing assistance to veterans with a disability not caused by their military service, which led to the foundation of the Commonwealth Rehabilitation Service in 1955.\nDisposal of military equipment\nfighters awaiting disposal at Labuan in January 1946. The aircraft were later dumped in the sea.]]\nThe disposal of military equipment and materials was also a key priority after the end of the war. Equipment with civilian uses such as motor vehicles, clothing and housing were urgently needed to counter shortages in the civilian economy. The timing of equipment release had to be carefully planned, however, to avoid harming employment by creating surpluses of manufactured goods. Planning for the disposal of equipment began in 1943 and the Commonwealth Disposals Commission was established to oversee the sale or destruction of equipment in September 1944. Before the commission was established the Government decided that ex-military equipment would be offered to other government agencies before being made available to the public, that sales to the public were to be made on an 'as is, where is' basis and be processed through existing trade channels or public auction at 'fair market prices' and that payment was to be required in cash. Some special priorities were also established; farmers were to be given priority for motor vehicles, machine tools were to be allocated to ex-servicemen and training colleges and special consideration was to be given to the needs of the Red Cross and other overseas and domestic charitable associations.\nPreparations for the disposal of equipment began in the second half of 1944 when the War Cabinet directed the military to survey all stocks and indicate any surpluses. General Thomas Blamey, the Commander-in-Chief of the Army, hindered the preparations as he believed they were premature and that the Army's stocks needed to be maintained until Japan was defeated. That position was opposed by the acting Minister for the Army, and the RAAF and RAN made some attempts to identify their surpluses, but was successful in delaying the Disposal Commission's work until July 1945. As a result, relatively little military equipment was sold between September 1944 and June 1945.\nAfter the war ended the Disposals Commission rapidly disposed of large stocks of military equipment. Consumer goods and raw materials which could be used immediately by manufacturers were the first items to be sold and sales of motor vehicles grew rapidly. Ex-military vehicles made an important contribution to meeting transport shortages in rural areas, but there was some dissatisfaction with the priority given to the agricultural sector and the way in which the vehicles were sold. The Disposal Commission's sales were also important in meeting shortages of clothing, housing, industrial and construction equipment and tractors. Most of the military's stocks of food were donated to the United Nations Relief and Rehabilitation Administration or sold for export.\nThe disposal of military equipment, particularly outside of Australia, presented a challenge to the Disposals Commission. At the end of the war inadequate preparations were made for the storage of equipment in New Guinea, and many stores were stolen by soldiers, native New Guineans and 'salvage pirates' or damaged by the tropical conditions. Sales of stocks in those areas were completed at the end of 1946, often at very low prices, but much equipment was stolen. Specialised military equipment also proved difficult to dispose of given its unsuitability for civilian purposes. Bombs and other explosives were destroyed after any scrap metal was recovered and large numbers of combat aircraft had to be scrapped due to a worldwide glut. Training aircraft and other aeronautical equipment were sold to the public and other government agencies. Demand for tanks and Universal Carriers, which could be converted to tractors, was greater than expected.\nThe Disposals Commission's activities peaked during 1946 and 1947. Sales generally went smoothly and in accordance with the principles set by the government and did not significantly disrupt normal commerce. While the commission generally operated efficiently, some mistakes occurred such as clothing and scrap metal being sold well beneath their market value. The volume of sales dropped rapidly after 1947 and the Disposals Commission was disbanded in July 1949. By this time the commission had sold £135,189,000 worth of equipment.\nNotes\nReferences\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\nFurther reading\n*"
    }
  ]
}