{
  "content": [
    {
      "type": "text",
      "text": "# Democracy (Numbers)\n\n| length       =\n| production   = 318\n| writer       = Cheryl Heuton, Nicolas Falacci\n| director     = Steve Boyum\n| music        =\n| photographer =\n| guests       =\n*Jay Baruchel as Oswald Kittner\n*Alexander Chaplin as Austin Parker\n*Ronobir Lahiri as Coroner\n*Joshua Malina as Howard Meeks\n*Dihlon McManne as Lawyer\n*Tim Monsion as Cliff Dawkins\n*Kathy Najimy as Dr. Millie Finch\n*Kelli O'Hara as Rachel Lawton\n*William Sadler as J. Everett Tuttle\n*Leslie Silva as M.E. Ridenhour\n*Scott Waara as Jason Brasher\n*Alison Walla as Stacy Aliano\n*Jama Williamson as Jane Aliano\n*Terry Woodberry as Paramedic\n| episode_list =\n| prev         = One Hour\n| next         = Pandora's Box\n}}\n\"Democracy\" is the 18th episode of the third season of the American television show Numbers.  Written by Cheryl Heuton and Nicolas Falacci, the episode highlights a Federal Bureau of Investigation (FBI) investigation into the murder of one of their math consultant's friends while an agent learns that she has been selected for a United States Department of Justice (DOJ) assignment. Heuton and Falacci also brought back fan favorite Oswald Kittner, portrayed by Jay Baruchel.\nThe episode marks series regular Diane Farr's final appearance before delivering her baby. Her pregnancy during season three presented writers and producers with the challenge of deciding whether to include a pregnancy into the season's storyline.  They decided against it and opted to hide her pregnancy.  While filming \"Democracy\", Farr had her baby.\n\"Democracy\" first aired in the United States on March 9, 2007.  Critics gave the episode positive reviews.\nPlot summary\nOne night at CalSci, Dr. Rachel Lawton, a friend of FBI math consultant Dr. Charlie Eppes (David Krumholtz), gives Charlie a list of names of her colleagues who died under suspicious circumstances.  She asks to see Charlie's brother, FBI Special Agent Don Eppes (Rob Morrow).  When Charlie asks why she does not go to the police about the matter, she reveals that she could be next.  The next day, with Don present, Charlie identifies her body in the morgue.  Friends with her since graduate school, Charlie does not believe that she could have committed suicide.  Don agrees to look into Lawton's death.\nThe team learns that Lawton and most of her colleagues were, in fact, murdered.  In looking at the connections between the people on Lawton's list, the team learns that the people are statisticians and demographers who worked for SDKG Corporation, a Hong Kong subsidiary of J. Everret Tuttle (William Sadler) that is involved in developing computer software.  They also learn of Assistant United States Attorney Howard Meeks (Joshua Malina)'s parallel investigation into Tuttle's ties to election fraud.  In the meantime, Don asks FBI Special Agent Megan Reeves (Diane Farr) about being assigned to the Department of Justice (DOJ) for a while; Megan states that she does not want it.  Meanwhile at CalSci, Charlie attempts to talk a reluctant Oswald Kittner (Jay Baruchel), a fantasy baseball player who has helped the team before during a case involving sabermetrics, into enrolling at CalSci.\nInterviews with Tuttle and Austin Parker (Alexander Chaplin), one of Lawton's colleagues who is still alive, are unproductive.  Parker dies during a car explosion after his interview with FBI Special Agents David Sinclair (Alimi Ballard)  and Colby Granger (Dylan Bruno).  Another colleague of Lawton's, Jane Aliano (Jama Williamson), is still alive but missing. Charlie and Oswald analyze a list of numbers that Charlie received as evidence and learn that the software was, without the knowledge of Lawton and her colleagues, designed to alter votes in precincts with close elections.  Following campaign contributions, the team learns that Jason Brasher (Scott Waara), a candidate who has received campaign contributions from Tuttle, was elected in a close race in precincts using SDKG Corporation's software.  With the help of Aliano's sister, the team finds Aliano, who agrees to be a witness upon learning of her friends' deaths.  Cliff Dawkins (Tim Monsion), a manager of SDKG Corporation, accepts responsibility for the software design.  When Don goes to Tuttle's house to inform Tuttle that he would be arrested when Don gathers the evidence, Tuttle accuses Don of having a vendetta.\nAfter Meeks learns through the newspaper that the California legislature wants to investigate Tuttle, he accuses Don, who is surprised to see the article, of leaking the information to the press.  At the house, Don learns that Charlie, using public information and Lawton's research, published Lawton's work in a journal, which issued a press release to the newspaper about the impending publication of the article.  Oswald comes into the house and announces that he plans to enroll at CalSci.  At the office, Megan receives a phone call from the DOJ telling her that the assignment is mandatory and effective immediately.  She tearfully boards the elevator clutching her badge and keys.\nProduction\nWriting\n\"Democracy\" marks the temporary exit of Diane Farr. During the start of season three, series regular Diane Farr learned that she was pregnant.  The series' writers and producers discussed whether to include the pregnancy in the storyline for the season.  At the time, series writers and producers planned for Larry to romance Megan during season three.  They decided against a story involving pregnancy, feeling that it was too early in Larry and Megan's relationship to discuss pregnancy.  They also felt that it was too early in the series to explore working mothers in the FBI.  Furthermore, series regular Peter MacNicol's temporary departure for 24 complicated the storyline even further, as the potential father would be absent for part of a season.\nFilming\nSince writers and producers decided that Farr's pregnancy would not be a storyline for season three, they had to disguise Farr's pregnancy.  Over the course of the season, they used a fitted vest and a scarf, folders, and a bag constructed from material that was soundless.  Farr used her hand to block her abdomen.  The camera crew filmed around Farr's pregnancy.  At one point, series writer Ken Sanzel wrote a script in which Megan could be at the office.\nDuring the filming of \"Democracy\", an obstetrician and a midwife from Florida were on set in case Farr delivered her baby on set.  While filming, Farr had early contractions but insisted on working.  The producers rushed to rearrange the shooting schedule so that that day could be Farr's last day on set.  She delivered her baby.\nCasting\n\"Democracy\" marked the return of Oswald Kittner.  Originally a one-time role, fans and executive producer Cheryl Heuton enjoyed having Jay Baruchel's performance as Oswald Kittner on the show.  As a result of fans' request for a return appearance of Kittner, writers wrote \"Democracy\" and decided to feature Kittner.\nReception\nOver 10.29 million people watched \"Democracy\".\nSee also\n*Diane Farr\n*Numb3rs\nReferences\nExternal links\n*"
    }
  ]
}