{
  "content": [
    {
      "type": "text",
      "text": "# Democracy (song)\n\nJeff Fisher]]\n| album         = The Future (Leonard Cohen album)The Future\n| released      =\n| genre         = Heartland rock\n| length        = .\n| label         = Columbia\n| writer        = Leonard Cohen\n| producer      = Leonard Cohen\n}}\n\"Democracy\" is a song by Canadian musician Leonard Cohen featuring Jeff Fisher, first released on Cohen's 1992 album The Future. The lyrics discuss the failings and the promise of democracy in the United States. The song was written approximately during the fall of the Berlin Wall, which led Cohen to question where democracy came from. Cohen stated that it was \"a song of deep intimacy and affirmation of the experiment of democracy\" in the United States.\nComposition and release\n\"Democracy\" was released as the sixth song on Leonard Cohen's 1992 album The Future. It features American musician Jeff Fisher, who received multiple credits on the album. The song begins with drums played at a high tempo in the rhythm of a march, which persist through the song. It uses musical elements of heartland rock. The 1992 version of the song is 7:14 long. It appears on several subsequent Cohen compilations, including More Best of Leonard Cohen. The lyrics of the released version comprise a small subset of the more than eighty verses that Cohen wrote. The song was written a few years before its release, approximately during the fall of the Berlin Wall, at a time when Cohen said he found himself reflecting on what democracy meant and where progress was being made toward it. Cohen stated in a 1993 interview: \"I had to ask myself 'Where is democracy coming? What is democracy?' [And] that's when I came upon the line 'Democracy is coming [to] the USA' which of course has an irony 'What do you meant to say, that it is not there already?' Well no. It isn't really there already, it is the ideal, it is the fate. Nonetheless, Cohen stated that the song was not ironic, saying \"It's a song of deep intimacy and affirmation of the experiment of democracy in this country\".\nReception and analysis\nThe lyrics of \"Democracy\" discuss the failings and the promise of democracy in the United States of America. American Songwriter contrasted \"Democracy\" with \"Born in the USA\", writing that Cohen uses a similar musical style to express \"clear-eyed optimism\" about the country's future, despite his description of the US as \"the cradle of the best and the worst\". According to music scholar Jeffrey Spear, \"Democracy\" implies that democracy will come to the US when it has moved past \"the Reefs of Greed / through the Squalls of Hate\", learned to include the Other, and overcome a history of division and persecution. Cohen refers specifically to racial division, the \"patriarchal family\", and the treatment of the homeless, suggesting, according to Spear, that the country must come to terms with the Sermon on the Mount which says that the \"meek will inherit the earth\". The song posits that the movement for democracy in the US will arise from the grassroots, from \"social and political disorder\" and from those experiencing deprivation. Cohen makes reference, for instance, to ghost towns left behind in the American heartland by corporate flight. Other drivers the song names are the collapse of autocratic communist governments, man-made environmental catastrophe, and the \"wars against disorder\" fought by a \"nominally democratic\" US  state. According to political scientist Laura Grattan, Cohen places his hope not only in the ideal of democracy, but also in the \"people that must carry forth its promise\". \"Democracy\" implies that people in the US are isolated from one another and from society at large, and offers the promise of democracy as a unifying force to overcome that alienation.\nReferences"
    }
  ]
}