{
  "content": [
    {
      "type": "text",
      "text": "# Democratic Union for the Republic__disambig_1\n\nThe Democratic Union for the Republic (, UDR) was a short-lived Christian-democratic and centrist political party in Italy.\nIt was founded in February 1998 by Francesco Cossiga (former Prime Minister and President) in order to provide a majority in Parliament for the creation of the D'Alema I Cabinet. The party also included Clemente Mastella (ex-Christian Democratic Centre, CCD, then leader of the Christian Democrats for the Republic), Rocco Buttiglione (leader of the United Christian Democrats, CDU), Mario Segni (leader of Segni Pact), Carlo Scognamiglio (ex-Forza Italia, FI), Enrico Ferri (ex-CCD, former leader of the Italian Democratic Socialist Party and European Liberal Social Democracy) and Irene Pivetti (ex-Lega Nord), along with several other MPs elected for the centre-right. Cossiga'a sim was to facilitate the creation of a centre-left governments without the support of the Communist Refoundation Party. The UDR was initially only a federation of parties, but in June CDR, CDU and the Segni Pact merged to form a united party and Mastella was elected secretary.\nAfter disagreements between Cossiga and Mastella, the party broke up in February 1999. Most party members rallied behind Mastella and joined his Union of Democrats for Europe (UDEUR). Those around Cossiga formed the Union for the Republic (UpR), whose leading members (Angelo Sanza, Giorgio Rebuffa, etc.), entered in FI in 2001. The most notable exception was Carlo Scognamiglio who joined the Federation of Italian Liberals, and then European Democracy and the Pact of Liberal Democrats. Buttiglione had previously re-established the CDU, as Segni did with his Pact, while Ferri joined FI.\nThe party had multiple regional branches: Union of Sardinians in Sardinia, Democratic People's Union in Trentino and Democratic Union of Alto Adige in South Tyrol.\nLeadership\n*Secretary: Clemente Mastella (1998–1999)\n*President: Carlo Scognamiglio Pasini / Rocco Buttiglione (1998–1999)\n*Honorary President: Francesco Cossiga (1998–1999)\nReferences"
    }
  ]
}