{
  "content": [
    {
      "type": "text",
      "text": "# Democratic Social-Revolutionary Party of Cuba\n\n| name = Democratic Social-Revolutionary Party of Cuba\n| native_name = Partido Social-Revolucionario Democrático de Cuba\n| logo = Democratic Social-Revolutionary Party of Cuba logo.jpg\n| leader1_title = General Secretary\n| leader1_name = Jorge Valls (Until 2015)\n| foundation =\n| headquarters = Miami, United States\n| ideology = Democratic socialism\n| position = Left-wing\n| international = Progressive International\n| colours = |border=darkgray}} Red\n| website = [https://web.archive.org/web/20160406131753/http://www.psrdc.org/ www.psrdc.org]\n| country = Cuba\n}}\nThe Democratic Social-Revolutionary Party of Cuba (, ) is a democratic socialist political party in Cuba. Although changes to the Cuban constitution in 1992 decriminalized the right to form political parties other than the Communist Party of Cuba, no parties are permitted to campaign or engage in public political activities on the island. Public engagements by party members are typically restricted to international gatherings of democratic socialist groups.\nThe main political aims of the PSRDC are to persuade the Cuban government to declare a political amnesty and to reinstall a sovereign National Constituent Assembly which the party believes was abandoned following Fulgencio Batista's coup d'état in 1952. They also call for more freedom in Cuba's state controlled press and an end to what they consider Cuba's human rights violations. The PSRDC is extremely critical of Fidel Castro and the Communist Party apparatus describing the present government as \"unrepresentative of the ideals of the Cuban Revolution\". The party also condemns the role of the United States in the region, requesting that both Cubans and Americans overcome the compulsion to compare the merits and shortfalls of each system, describing such dialogue as unconstructive.\nSee also\n*List of political parties in Cuba\nReferences\nExternal links\n*\n*[http://socialist.org/socialist/mj98/5.html Essay by Jorge Valls on the goals of the party]"
    }
  ]
}