{
  "content": [
    {
      "type": "text",
      "text": "# Denis King\n\n|birth_place  = Hornchurch, Essex, England\n|alma_mater   = West Ham Grammar School\n|occupation   =\n|years_active = 1946–present\n|spouse       = Astrid Ronning\n|children     = Alexander King, Fiona King\n|website     =\n}}\nDenis Andrew King (born 25 July 1939) is an English composer and singer. He is best remembered as a member of a family ensemble, The King Brothers.\nEarly career: the King Brothers\nKing was born in Hornchurch, Essex, England. He began his musical career at the age of six as a banjolele-playing singer at children's matinees and, by the age of thirteen, with his two older brothers, Mike and Tony, was a member of one of the most successful pop groups of the 1950s and 1960s, The King Brothers — considered to be Britain’s first boy band. Denis played the piano, Mike the guitar, and Tony the double bass.\nBy the time King was thirteen, The King Brothers were touring around the U.K. in what was known as twice-nightly variety (the equivalent of America's vaudeville), performing two shows a night in one town before moving on to the next the following week. For two years King attended a different school in a different town almost every week. Along with concerts and tours around Europe, The King Brothers did summer shows, and television appearances, played the Windmill Theatre and, in 1956, became the youngest variety act to play the London Palladium. Within a year they were in the UK Singles Chart. \"A White Sport Coat\" and \"Standing On The Corner\" were their biggest successes. They appeared with Peter Sellers, Harry Secombe, Frankie Vaughan, Roy Castle, Shirley Bassey, Alma Cogan, Ronnie Corbett, Bruce Forsyth, Morecambe and Wise, as well as American stars Bobby Darin, Howard Keel, Sammy Davis Jr, Judy Garland, Lena Horne, Sarah Vaughan, Sophie Tucker and Frank Sinatra.\nLater career\nWith the disbanding of the group in 1970, Denis studied orchestration at the Guildhall School of Music in London and got his first break in television writing the music for The Adventures of Black Beauty (\"Galloping Home\"), which won an Ivor Novello Award. To date, he has created themes and incidental music for over two hundred television series including Within These Walls, If It Moves File It, Dick Turpin, ''Two's Company, Lovejoy, We'll Meet Again and Hannay, in addition to one hundred jingles for radio and television advertising. He has also worked on films, writing the scores to Simon, Simon (1970), Not Tonight, Darling (1971), Holiday on the Buses (1973), Ghost in the Noonday Sun (1973), Sweeney! (1977), If You Go Down in the Woods Today (1981) and Privates on Parade (1982).\nAs a musician he has performed with Dame Edna Everage, Albert Finney, Benny Green, with Maureen Lipman (in her successful stage show Re: Joyce), and with Dick Vosburgh in the comic revues Beauty and the Beards and Sing Something Silly, as well as on the BBC Radio radio comedy series Hello, Cheeky!'' from 1973 to 1979; he appeared in the TV version of the latter, produced by Yorkshire Television in 1976.\nHis debut as a theatrical composer was with the original 1977 Royal Shakespeare Theatre's production of Privates On Parade (book and lyrics by Peter Nichols) which won the Ivor Novello Award for Best Musical. Other theatre productions include ''A Saint She Ain't and The Un-American Songbook (with Dick Vosburgh); Stepping Out - The Musical (with Richard Harris and Mary Stewart-David); Bashville and Valentine's Day (with Benny Green); Worzel Gummidge starring Jon Pertwee and Lost Empires (with Keith Waterhouse & Willis Hall); Wind In The Willows and Treasure Island (with Willis Hall); West Five Story (with Richard Harris); Baby On Board (with Mary Stewart-David) for the Stephen Joseph Theatre, Scarborough, North Yorkshire, where it was directed by Alan Ayckbourn. King has written extensively with Ayckbourn and together they have created the musicals Whenever, Orvin - Champion Of Champions, and Awaking Beauty, which premiered in December 2008 at the Stephen Joseph Theatre, Scarborough.\nKing later moved to the \"celebrity hotspot\" of Walberswick, Suffolk, where in 2012 he staged an amateur version of his own musical, Wind in the Willows''.\nIn 2025, Denis King released a thirteen-part podcast of his memoirs – Key Changes – from child star in the King Brothers to composer for stage and screen, featuring his own music (often with King on the piano), old recordings and archive material.\nReferences\nExternal links\n*\n* [https://web.archive.org/web/20120405080335/http://www.lortel.org/LLA_archive/index.cfm?search_by=people&keyword=name&first=Denis&last=King&middle= Denis King] at the Internet Off Broadway Database"
    }
  ]
}