{
  "content": [
    {
      "type": "text",
      "text": "# Denton Confederate Soldier Monument\n\n| artist             =\n| year               =\n| completion_date    = 1918\n| catalogue          =\n| medium             =\n| movement           =\n| subject            =\n| height_metric      =\n| width_metric       =\n| length_metric      =\n| diameter_metric    =\n| height_imperial    =\n| width_imperial     =\n| length_imperial    =\n| diameter_imperial  =\n| dimensions         =\n| dimensions_ref     =\n| metric_unit        =\n| imperial_unit      =\n| weight             =\n| designation        =\n| condition          =\n| museum             =\n| city               = Denton, Texas, United States\n| coordinates        =\n| mapframe           = yes\n| mapframe-zoom      = 13\n| pushpin_map        =\n| pushpin_map_caption =\n| owner              =\n| accession          =\n| preceded_by        =\n| followed_by        =\n| module             =\n| website            =\n}}\nThe Denton Confederate Soldier Monument was an outdoor Confederate memorial installed in downtown Denton, Texas, in the United States.\nDescription\nThe statue depicts an armed Confederate soldier standing on an arch with the inscription, \"Our Confederate soldiers\". On the left pillar it read: }} On the right pillar it read: }}\nHistory\nThe monument was funded and erected in 1918 by the Katie Daffan Chapter of the United Daughters of the Confederacy, and unveiled on June 3, the anniversary of Jefferson Davis's birthday. }}\nThe monument was named a Texas Historic Landmark in 1970, a National Historic Registry landmark in 1977, and a Texas State Archeological Landmark in 1981.\nVandalism and removal\nOne local resident, Willie Hudspeth, a Vietnam War veteran and the president of Denton's NAACP, campaigned to remove the memorial since 2000. The monument was vandalized with the words \"This Is Racist\" in 2015. On February 1, 2018, Denton County leaders voted 12–3 to keep the statue, but to add a plaque denouncing slavery and a video kiosk explaining the city's racial history and progress, which was never added or completed. A standalone plaque was erected nearby to provide a rationale for the monument. It read:\nNow let this be a testimony that God created all men equal with certain inalienable rights. We are all one, citizens of Denton County.}}\nOn June 9, 2020, in the wake of the protests following the murder of George Floyd in Minneapolis, Denton County commissioners voted to remove the memorial. On the morning of June 25, 2020, removal of the statue began just before dawn.\nSee also\n* 1918 in art\n* Confederate Monument (Fort Worth, Texas)\n* List of Confederate monuments and memorials\n* List of monuments and memorials removed during the George Floyd protests\nReferences"
    }
  ]
}