{
  "content": [
    {
      "type": "text",
      "text": "# Department of Canadian Heritage__disambig_1\n\n| logo            = CanadianHeritage Logo.png\n| agency_type     =\n| jurisdiction    = Canada\n| budget          =\n}}\n| employees       = 1,843.3 FTE (2019‒20)\n| minister1_name  = Steven Guilbeault\n| minister1_pfo   = Minister of Canadian Identity and Culture\n| deputyminister1_name = Isabelle Mondou\n| deputyminister1_pfo = Deputy Minister of Canadian Heritage\n| deputyminister2_name = Andrew Brown\n| deputyminister2_pfo = Associate Deputy Minister of Canadian Heritage\n| formed          = 1993\n| dissolved       =\n| keydocument1    = [https://laws-lois.justice.gc.ca/eng/acts/C-17.3/FullText.html Department of Canadian Heritage Act]\n| website         =\n}}\nThe Department of Canadian Heritage, or simply Canadian Heritage (), is the department of the Government of Canada that has roles and responsibilities related to initiatives that promote and support \"Canadian identity and values, cultural development, and heritage.\"\nThe department is administered by the Deputy Minister, currently Isabelle Mondou, who is appointed by the Governor in Council, and it reports directly to the Minister of Canadian Heritage, who is currently Steven Guilbeault.\nUnder its current mandate, the jurisdiction of Canadian Heritage encompasses, but is not limited to, jurisdiction over: the promotion of human rights, fundamental freedoms and related values; multiculturalism; the arts; cultural heritage and industries, including performing arts, visual and audio-visual arts, publishing, sound recording, film, video, and literature; national battlefields; the encouragement, promotion, and development of sport; the advancement of official bilingualism; state ceremonial and Canadian symbols; broadcasting, except in regards to spectrum management and the technical aspects of broadcasting; the development of cultural policy, including such policy as it relates to foreign investment and copyright; the conservation, exportation and importation of cultural property; the organization, sponsorship, and promotion of public activities and events, in the National Capital Region, that will \"enrich the cultural and social fabric of Canada;\" and national museums, archives and libraries.\nTo fulfill these tasks, the department coordinates a portfolio of several agencies and corporations that operate in a similar area of interest. While the roles and responsibilities of Canadian Heritage have remained relatively constant over the years, the department and composition of its portfolio remain in flux due to continuing structural changes.\nHistory\nFounded on 25 June 1993, the Department of Canadian Heritage was initially created by Kim Campbell from parts of several other federal departments, combining responsibility for official languages, arts and culture, broadcasting, parks, and historic sites, as well as programs in the areas of multiculturalism, citizenship, state ceremonial, amateur sport and the National Capital Commission. In 1994, the Department of Canadian Heritage inherited Parks Canada from Environment Canada, as well as activities that formerly belonged to the Departments of Communications, of Multiculturalism and Citizenship, and of Fitness and Amateur Sport, and the Secretary of State. Since then, Canadian Heritage has gone through several structural and portfolio changes.\nIn 2003, Canadian Heritage added the Public Service Staff Relations Board (PSRB) to its portfolio, while Parks Canada was returned to the jurisdiction of Environment Canada. Eleven years later, in 2014, the PSRB was removed from the portfolio upon the enactment of the Public Service Labour Relations and Employment Board Act, which established the PSRB as a quasi-judicial tribunal that operates at arm's length from the government.\nIn late 2008, the multiculturalism section of Canadian Heritage was transferred to the Department of Citizenship and Immigration, then transferred back again in November, 2015.\nIn 2018, the Status of Women secretariat moved out from the umbrella of Canadian Heritage to become its own department.\nIn 2020, Canadian Heritage introduced established the Federal Anti-Racism Secretariat as part of its national Anti-Racism Strategy.\nDepartment\n, home of the head office of the Department of Canadian Heritage]]\nThe Department of Canadian Heritage is headquartered in the Jules Léger Building (South) () in Terrasses de la Chaudière, Gatineau, Quebec, across the Ottawa River from the Canadian capital of Ottawa.\nThe department is an umbrella organization that has one of the largest portfolios in the Canadian federal government, and the organizations in the portfolio support the department in the pursuit of its priorities while also striving to achieve their individual mandates.\nThe departmental framework (as of 2019–20) is:\n* Creativity, arts and culture\n** Arts\n** Cultural marketplace framework\n** Cultural industries support and development\n* Heritage and celebration\n** National celebrations, commemorations and symbols\n** Community engagement and heritage\n** Preservation of and access to heritage\n** Learning about Canadian history\n* Sport\n** Sport development and high performance\n* Diversity and inclusion\n** Multiculturalism\n** Human rights\n** Indigenous languages and cultures\n** Youth engagement\n* Official languages\nIn addition to coordinating with the organizations in its portfolio, the department also partners with provincial and territorial governments to organize and oversee visits from the King of Canada and other members of the royal family.\nStructure\nCanadian Heritage is administered by the Deputy Minister, currently Hélène Laurendeau, who is appointed by the Governor in Council. The Deputy Minister is accompanied by an Associate Deputy Minister (currently Isabelle Mondou) and a Deputy Minister of Diversity and Inclusion and Youth and Senior Associate Deputy Minister (currently Gina Wilson).\nActivities at the department are overseen by several senior officials, and reports directly to the Minister of Canadian Heritage, who is currently Steven Guilbeault. Activities related to official languages report to the Minister of Economic Development and Official Languages, currently held by Mélanie Joly; and diversity, inclusion and youth activities report to the Minister of Diversity, Inclusion and Youth, who is currently Bardish Chagger.\nThe department is divided into five different areas that each have their own Assistant Deputy Minister:\n* Sport, Major Events, Commemorations and Portfolio Affairs — administered by the Assistant Deputy Minister, Joëlle Montminy\n* Community and Identity — administered by Assistant Deputy Minister, Charles Slowey\n* Cultural Affairs — led by Senior Assistant Deputy Minister, Jean-Stéphane Piché\n* Strategic policy, Planning and Corporate Affairs — administered by Assistant Deputy Minister, David Dendooven\n*Official Languages, Heritage and Regions — administered by Assistant Deputy Minister, Julie Boyer\nPortfolio\nOrganizations\nAll organizations of the Canadian Heritage portfolio report to Parliament through the same Minister. , the portfolio consists of:\n* 2 special operating agencies:\n** the Canadian Conservation Institute\n** the Canadian Heritage Information Network\n* 2 administrative tribunals:\n** Canadian Cultural Property Export Review Board\n** Canadian Radio-television and Telecommunications Commission (CRTC)\n* 3 departmental agencies:\n** Library and Archives Canada (LAC)\n** National Battlefields Commission\n** National Film Board of Canada. (NFBC)\n* 12 Crown corporations:\n** Canada Council for the Arts\n** Canada Science and Technology Museum\n** Canadian Broadcasting Corporation\n** Canadian Museum for Human Rights\n** Canadian Museum of History\n** Canadian Museum of Immigration at Pier 21\n** Canadian Museum of Nature\n** Canadian Race Relations Foundation\n** National Arts Centre\n** National Gallery of Canada\n** Telefilm Canada\nLegislation\nThe following statutes are administered, in whole or in part, by the portfolio of Canadian Heritage:\n* Department of Canadian Heritage Act\n* An Act to Incorporate the Jules et Paul-Emile Léger Foundation\n* Broadcasting Act\n* Canada Council for the Arts Act\n* Canada Travelling Exhibitions Indemnification Act\n* Canadian Charter of Rights and Freedoms\n* Canadian Multiculturalism Act\n* Canadian Radio-television and Telecommunications Commission Act\n* Copyright Act (cultural policy)\n* Cultural Property Export and Import Act\n* Fitness and Amateur Sport Act\n* Foreign Publishers Advertising Services Act\n* Holidays Act\n* Income Tax Act (tax credits, national arts, service organizations, and cultural property)\n*Indigenous Languages Act (royal assent: 21 June 2019)\n* Investment Canada Act (cultural foreign investment)\n* Laurier House Act (for certain powers)\n* Lieutenant-Governors Superannuation Act (in part)\n* Library and Archives of Canada Act\n* Museums Act\n* National Anthem Act\n* National Arts Centre Act\n* National Battlefields at Quebec Act\n* National Film Act\n* National Horse of Canada Act\n* National Sports of Canada Act\n* National Symbol of Canada Act\n* Official Languages Act (Part VII)\n* Parliamentary Employment and Staff Relations Act\n* Physical Activity and Sport Act (in respect of sport)\n* Public Servants Disclosure Protection Act\n* Public Service Employment Act (report to Parliament)\n* Public Service Labour Relations Act\n* Salaries Act (Lieutenant-Governors)\n* Sir John A. Macdonald Day and the Sir Wilfrid Laurier Day Act\n* Status of the Artist Act (Part I)\n* Telefilm Canada Act\n* Trade-marks Act (use of national symbols)\nPrograms and budget\nIn 2020, the department had a budget of CA$3.89 billion—this is an increase from the $3.66 billion of the previous year, but a minimal decrease from the $3.9 billion budget of 2018.\nIn the 2019‒20 fiscal year, the total actual spending of Canadian Heritage amounted to $1.55 billion and its total actual full-time equivalents were 1,843.3.\nExpenses\nThrough its Multiculturalism Programs, in 2019‒20, Canadian Heritage allocated more than $30 million of funding for 116 projects, 372 events, 56 \"Community Support for Black Canadian Youth\" initiatives, a \"National Anti-Black Racism Education and Awareness\" campaign, and 77 \"Community Capacity Building\" initiatives.\nIn 2019‒20, through its Creative Export Strategy (which is in its 2nd year), Canadian Heritage invested almost $7.2 million in 23 \"export-ready projects\" to support creative entrepreneurs in maximizing their export in the global marketplace. Launched in 2019–20 was the \"Local Journalism Initiative\" with an investment of $50 million over five years, supporting the creation of original civic journalism that covers the multidimensional needs of underserved communities across the country. Partnering with TV5Monde public broadcasters, the Canadian government supported the creation of a French-language digital platform with an investment of $14.6 million over five years, beginning in 2019–20.\nIn 2019–20, the Celebration and Commemoration Program funded 207 National Indigenous Peoples Day events across Canada, and provided $1.3 million in funding to the Aboriginal Peoples Television Network (APTN) to organize and host the 2019 APTN Indigenous Day Live in Calgary, AB, Whitehorse, YT, and Winnipeg, MB. (APTN is headquartered in Winnipeg.)\nIn June 2019, the Department's Legacy Fund supported the centennial anniversary of the Winnipeg general strike, funding a major monument across from Winnipeg's City Hall in the shape of a tipped streetcar, a reference to 21 June 1919, or 'Bloody Saturday'.\nGrants and financial support\nCanadian Heritage gives out roughly $1.2 billion in grants annually, available for programs that contribute to the objectives of the department. These departmental objectives include those that relate to supporting culture, history, heritage, sport and Canada's official languages.\nIn 2019, it was reported that Canadian Heritage provided over $130,000 in public grant money to organizations with ties to the Chinese Communist Party's United Front Work Department, which published ads critical of the 2019–20 Hong Kong protests.\nThe department  requires that application forms be submitted by the deadlines that are specified under the application guidelines of the particular funding program in order to be considered for financial support. A confirmation notice is sent by the department within two weeks of getting an application, and a decision on whether funding will be granted or not is made within thirteen to thirty weeks, depending on the funding program. The first payment is made on or before the fourth week after the Department of Canadian Heritage has sent out a written notice that an application has been approved.\nPrograms\nIn February 2020, the joint Human Rights Program submitted a report to the United Nations, Canada's Interim Report under the Convention against Torture and Other Cruel, Inhuman or Degrading Treatment or Punishment, coordinating input between the federal government and provincial and territorial governments.\nAlso in 2020, Canadian Heritage introduced the national Anti-Racism Strategy, which includes the Anti-Racism Action Program, several new measures, and funding for hundreds of projects to \"foster diversity and inclusion across the country.\" The department established the Federal Anti-Racism Secretariat as part of this strategy. Canadian Heritage was additionally given a new mandate to host and support the activities of two secretariats: the LGBTQ2 Secretariat, which promotes the societal contributions of LGBTQ2 communities and \"ensures that [their] rights are protected;\" and the Youth Secretariat, whose activities include \"coordinating meetings of the Prime Minister's Youth Council and recruiting the next cohort of young people for the Council.\"\nIn 2019, among the various celebrations supported by Canadian Heritage was the 50th anniversary of the decriminalization of homosexuality in Canada. Also that year, Sport Canada supported the development of the \"Universal Code of Conduct to Prevent and Address Maltreatment in Sport.\" While the 2020 Olympic and Paralympic Games in Tokyo were postponed (due to the COVID-19 pandemic), Canadian Heritage remained committed to Canadian athletes, high-performance athletes in particular.\n{| class=\"wikitable\"\n|+Programs and funds for culture, history and sport,  (excl. COVID-19 support)\n!Program\n!Description\n|-\n|Anti-Racism Action Program\n|Helps address barriers to employment, justice and social participation among Indigenous Peoples, racialized communities, and religious minorities. This program was created as part of the new national Anti-Racism Strategy in 2020.\n|-\n|Athlete Assistance Program\n|Supports high-performance Canadian athletes who are preparing for and participating in international sport.\n|-\n|Building Communities Through Arts and Heritage\n|Supports community celebrations, such as festivals, events, and projects.\n|-\n|Canada Arts Presentation Fund\n|Provides financial assistance to organizations that professionally present arts festivals or performing arts series (arts presenters) and organizations that offer support to arts presenters.\n|-\n|Canada Arts Training Fund\n|Supports the training of artists with high potential through organizations that offer high-calibre training.\n|-\n|Canada Book Fund\n|Promotes a strong book industry that publishes and markets Canadian-authored books.\n|-\n|Canada Cultural Investment Fund\n|Encourages private-sector investment, partnership, and sound business practices to help arts and heritage organizations be better rooted and recognized in their communities.\n|-\n|Canada Cultural Spaces Fund\n|Supports the improvement of physical conditions for artistic creativity and innovation.\n|-\n|Canada History Fund\n|Supports the development of learning materials and activities that contribute to increasing Canadians' knowledge about Canada. In 2019/2020, the  supported new recipients, including the Sikh Heritage Museum of Canada, The ArQuives, and the Inuit Tapiriit Kanatami.\n|-\n|Canada Media Fund\n|Encourages the creation of popular, innovative Canadian content and software applications.\n|-\n|Canada Music Fund\n|Supports a wide range of musicians and entrepreneurs who create, produce and market original and diverse Canadian music.\n|-\n|Canada Periodical Fund\n|Provides financial assistance to Canadian print magazines, non-daily newspapers and digital periodicals.\n|-\n|Canada Travelling Exhibitions Indemnification Program\n|Assists eligible Canadian art galleries, museums, archives, and libraries by assuming financial responsibility for loss or damage to objects or appurtenances in eligible travelling exhibitions.\n|-\n|Canadian Conservation Institute internship programs\n|Offers paid post-graduate internships and curriculum internships that provide learning opportunities for the conservation community in Canada and abroad.\n|-\n|Canadian Film or Video Production Tax Credit\n|Supports Canadian programming and the development of an active domestic production sector.\n|-\n|Celebrate Canada\n|Provides funding for activities organized on National Indigenous Peoples Day (NIPD), Saint-Jean-Baptiste Day, Canadian Multiculturalism Day, and Canada Day. In 2019, among the various celebrations supported by Canadian Heritage were celebrations of NIPD broadcast via television, radio, and online.\n|-\n|Commemorate Canada\n|Provides financial support to initiatives that commemorate Canada's significant people, places, achievements, and life events.\n|-\n|Community Support, Multiculturalism, and Anti-Racism Initiatives Program\n|Aims to eliminate inequalities by building on Canada's strength as a diverse and inclusive society.\n|-\n|Court Challenges Program\n|Provides financial support to Canadians to bring cases of national significance related to constitutional and quasi-constitutional official-language rights and human rights before the courts.\n|-\n|Creative Export Canada\n|Provides funding contributions to Canadian organizations that wish to carry out an export project. In 2019‒20, the Strategy provided support for trade-related programming and activities on the margins of several international trade events, as well as holding 58 cultural events and 11 literary events in Germany in the lead up to Canada's 2020 \"Guest of Honour\" year at the Frankfurt Book Fair.\n|-\n|Destination Clic — French Enrichment Bursary Program\n|A 3-week summer program for francophone students in Grades 8 and 9 who attend a French-as-a-first-language school and live outside of Quebec.\n|-\n|Digital Citizen Research Program\n|Supports research on countering online disinformation as well as other online harms and threats to Canada's democracy and social cohesion.\n|-\n|Documentary Heritage Community Program\n|Ensures that Canada's continuing memory is documented and accessible to current and future generations by adopting a more collaborative approach with local documentary heritage communities.\n|-\n|Economic Development Initiative\n|Learn about the funding available for activities related to business and economic development that encourage growth in Northern Ontario's Francophone communities.\n|-\n|Exchanges Canada\n|Helps youth to enhance their knowledge and understanding of Canada, while connecting with other young Canadians.\n|-\n|Explore — Second Language Bursary Program\n|Explore is a 5-week, intensive language immersion program.\n|-\n|Film or Video Production Services Tax Credit\n|Promotes Canada as a location of choice for film and video productions employing Canadians.\n|-\n|Indigenous Languages and Cultures Program\n|Promotes Indigenous languages, strengthens Indigenous cultural identity, and increases Indigenous participation in Canadian society.\n|-\n|Joint Initiative for Digital Citizen Research\n|Supports the goals of the federal government's approach to protecting democracy and the Digital Citizen Initiative.\n|-\n|Listen, Hear Our Voices initiative\n|Can fund Indigenous organizations to help digitize and preserve existing culture and language recordings for future generations.\n|-\n|Local Journalism Initiative\n|Supports the creation of original civic journalism that covers the diverse needs of underserved communities across Canada.\n|-\n|Movable Cultural Property Grants\n|Help designated organizations acquire cultural property of outstanding significance and national importance to Canada.\n|-\n|Museums Assistance Program\n|Supports heritage institutions and workers in the preservation and presentation of heritage collections.\n|-\n|National Acadian Day\n|A special fund available to promote the 2020 National Acadian Day.\n|-\n|Odyssey — Language-Assistant Program\n|a bilingual, paid work experience that provides opportunities for post-secondary students to travel to another province.\n|-\n|Official Languages Support Programs\n|Promote French and English languages in Canadian society and enhance the vitality of English- and French-speaking communities in minority situations. In 2019/20, Canada supported the creation of the Francophone digital platform TV5MONDEplus.\n|-\n|Sport Canada Hosting Program\n|Assists sport organizations to host the Canada Games and international sports events in Canada.\n|-\n|Sport Support Program\n|Supports the development of Canadian athletes and coaches.\n|-\n|Young Canada Works\n|Offers a variety of summer job and internship programs to job seekers and employers.\n|-\n|Youth Take Charge Program\n|Supports youth-led projects that exemplify the ability to strengthen youth attachment to Canada.\n|}\nReferences\nExternal links\n*"
    }
  ]
}