{
  "content": [
    {
      "type": "text",
      "text": "# Department of Education, Sport and Culture\n\n||preceding1     = Department of Education\n|dissolved       =\n|superseding     =\n|jurisdiction    = Isle of Man\n|headquarters    = Thie Slieau Whallian, Foxdale Road, St John's, Isle of Man\n|employees       = 1,326.68 FTE\n|budget          = 93,968,800 gross (90,518,000 net) for 2015/16\n|minister1_name  = Hon. Daphne Caine MHK\n|minister1_pfo   = Minister for Education, Sport and Culture\n|chief1_position = Chief Executive\n|chief1_name     = Graham Kinrade\n|website         =\n|footnotes       =\n}}\nThe Department of Education, Sport and Culture (Rheynn Ynsee Spoyrt as Cultoor) is a department of the Isle of Man Government.\nThe department was formerly the Department of Education and Children and was renamed as the Department of Education, Sport and Culture under Statutory Document No. 2017/0325 with effect from November 2017.\nThe current Minister (since 2021) is Julie Edge.\nHistory\nThe Department of Education was renamed during the Government shake up of April 2010 as Department of Education and Children.\nThe Board of Education for the Isle of Man was established as a Board of Tynwald in 1872, and renamed the Council of Education in 1899.  It was reconstituted and renamed the Isle of Man Board of Education in 1946. Its function was to oversee and provide funds to the elected local school boards, and after 1920 to the popularly elected Isle of Man Central Education Authority which replaced them.  The Authority was renamed the Isle of Man Education Authority in 1923. The Isle of Man Education Act 1949, which was based on the UK 'Butler Act' of 1944, preserved this two-tier structure, the Board assuming the role of the Ministry of Education and the Authority that of a local education authority.\nAs the Isle of Man Government gained greater autonomy after 1950, a separate Education Authority of 24 elected members, parallel to and rivalling the House of Keys, became increasingly anomalous and unwieldy, but it proved very tenacious of life.  An attempt to rationalise the system in 1968 resulted only in the merger of the Authority with the Board, which thereafter consisted of 5 \"Tynwald members\" appointed by Tynwald and 24 elected \"non-Tynwald members\", the former having control over finance and certain powers of veto.\nThe Department of Education was set up in 1987 as part of the new ministerial system, but a further attempt to remove the elected element was only partly successful. The Board was reconstituted as a body of 15 elected members with greatly reduced functions; in effect it became a panel from which members of the governing bodies of primary and secondary schools and the Isle of Man College were drawn. It was finally dissolved in June 2009.\nPrevious Ministers\nPrevious Ministers for Education and Children\n*Daphne Caine MHK, 2024 - present\n*Julie Edge MHK, 2021–2024\n*Alex Allinson MHK, 2020–2021\n*Graham Cregeen MHK, 2016–2020\n*Tim Crookall MHK, 2012–2016\n*Peter Karran MHK, 2011-2012\n*Eddie Teare MHK, 2010-2011\nPrevious Ministers for Education\n*Anne Craine MHK, 2006-2010\n*David Anderson MHK, 2004-2006\n*Steve Rodan MHK, 1999-2004\n*Edgar Mann MHK, 1996-1999\n*Noel Cringle MLC, 1995-1996\n*Hazel Hannan MHK, 1991-1995\n*Ron Cretney MHK, 1990-1991\n*Victor Kneale MHK, 1986-1990\nPrevious Chairmen of the Board of Education\n*Victor Kneale MHK, 1982-1986\n*Noel Cringle MHK, 1978-1982\n*Unknown, 1976-1978\n*Jean Thornton-Duesbery MHK, 1972-1976\n*Victor Kneale MHK, 1962-1972\n*Henry Corlett MHK CBE JP, 1951-1962\nSee also\n*Education in the Isle of Man\n*List of schools in the Isle of Man\nReferences\nExternal links\n* https://www.gov.im/about-the-government/departments/education-sport-and-culture/"
    }
  ]
}