{
  "content": [
    {
      "type": "text",
      "text": "# Department of Scheduled Tribe, Scheduled Caste, Minority and Backward Class Welfare (Jharkhand)\n\n| footnotes       =\n| map             =\n| map_width       =\n| map_caption     =\n}}\nThe Department of Scheduled Tribe, Scheduled Caste, Minority and Backward Class Welfare is a state government department within the Government of Jharkhand, dedicated to the socio-economic upliftment of marginalized communities in the state. The department plays a crucial role in formulating and implementing policies aimed at promoting education, employment and overall welfare for Scheduled Tribes (ST), Scheduled Castes (SC), Other Backward Classes (OBC) and minorities.\nKey initiatives and schemes\n*E-Kalyan Scholarship: The E-Kalyan portal, managed by Jharkhand's Department of Scheduled Tribes, Scheduled Castes, and Backward Classes Welfare, facilitates online applications for scholarships targeting SC, ST, OBC and minority students. It offers pre-matric, post-matric and merit-cum-means scholarships, aiming to alleviate financial barriers to education. Eligibility typically includes a minimum of 50% marks in the previous examination and an annual family income ceiling of ₹2.5 lakh for SC/ST students.\n*'''Chief Minister's Employment Generation Programme: CMEGP is a scheme implemented by the Government of Jharkhand to support unemployed youth from marginalized communities, including ST, SC, OBC and Divyangjan (disabled) individuals. The scheme aims to promote entrepreneurship, self-employment and economic independence among these communities.\n*Tea Tribes Welfare Committee''':In October 2024, the Jharkhand government established a committee to assess the socio-economic conditions of tea tribes of Jharkhand origin residing in Assam and other states. This initiative aims to ensure these communities receive their rightful benefits and recognition, including the potential granting of Scheduled Tribe status.\nMinisterial team\nThe Department of Scheduled Tribe, Scheduled Caste, Minority and Backward Class Welfare is overseen by the Cabinet Minister of the Jharkhand Government, with civil servants such as the Secretary appointed to assist in managing the department and executing its functions.\nSince December 2024, Chamra Linda has been the Cabinet Minister for the Department of Scheduled Tribe, Scheduled Caste and Backward Class, while the portfolio for Minority Welfare within the department is held by Hafizul Hasan.\nSee also\n* Government of Jharkhand\n* Ministry of Social Justice and Empowerment\n* Ministry of Tribal Affairs\nReferences"
    }
  ]
}