{
  "content": [
    {
      "type": "text",
      "text": "# Department of Trade and Industry (United Kingdom)\n\n|preceding1      = Board of Trade\n|preceding2      = Ministry of Technology\n|dissolved       =\n|superseding1     = Department for Business, Enterprise and Regulatory Reform\n|superseding2     = Department for Innovation, Universities and Skills\n|jurisdiction    = United Kingdom\n|headquarters    = Victoria Street, London\n|employees       =\n|budget          =\n|minister1_name  = Various incumbents\n|minister1_pfo   = Secretary of State for Trade and Industry\n|website         = [http://webarchive.nationalarchives.gov.uk/20070603164510/http://www.dti.gov.uk/ The DTI website] at the National Archives\n|footnotes       =\n}}\nThe Department of Trade and Industry (DTI) was a United Kingdom government department formed on 19 October 1970. It was replaced with the creation of the Department for Business, Enterprise and Regulatory Reform and the Department for Innovation, Universities and Skills on 28 June 2007.\nHistory\nThe department was formed on 19 October 1970 through the merger of the Board of Trade and the Ministry of Technology, creating a new cabinet post of Secretary of State for Trade and Industry. Additionally, the department also took over the Department of Employment's former responsibilities for monopolies and mergers. However, in January 1974, the department's responsibilities for energy production were transferred to a newly created Department of Energy. On 5 March that year, following a Labour Party victory in the February 1974 general election, the department was split into the Department of Trade, the Department of Industry and the Department of Prices and Consumer Protection.\nThe departments of Trade and Industry were reunited in 1983. The Department of Energy was re-merged back into the DTI in 1992, but various media-related functions transferred to the Department of National Heritage. Until it was succeeded in June 2007 the DTI continued to set the energy policy of the United Kingdom.\nAfter the 2005 general election the DTI was renamed to the Department for Productivity, Energy and Industry, but the name reverted to Department of Trade and Industry less than a week later, after widespread derision, including some from the Confederation of British Industry.\nIn 2007,  part of DTI merged into the new  Department for Innovation, Universities and Skills (DIUS), while most of it was renamed as the Department for Business, Enterprise and Regulatory Reform (BERR); part of that would become the Department of Energy and Climate Change (DECC) in 2008. The responsibilities which had gone to DIUS largely returned in 2009 with a re-merger to create the Department for Business, Innovation and Skills (BIS), though in 2016 the Department for International Trade (DIT) was split off. Energy returned in 2017 with the creation of the Department for Business, Energy and Industrial Strategy (BEIS); BEIS lasted until 2023 when this department was again split and mixed with other responsibilities, into the Department for Business and Trade (DBT), the Department for Energy Security and Net Zero (DESNZ) and the Department for Science, Innovation and Technology (DSIT).\nStructure\nThe DTI had a wide range of responsibilities. There were ultimately nine main areas covered by the DTI:\n* Company Law\n* Trade\n* Business Growth\n* Innovation\n* Employment Law\n* Regional Economic Development\n* Energy\n* Science\n* Consumer Law.\nCorporate policing\nIt also had responsibility for investigating misconduct by company directors, in which role Private Eye repeatedly lampooned it as \"the Department of Timidity and Inaction\".\nBusiness advice and support\nFrom 1999 to 2005 it led the national E-Commerce Awards with InterForum, a not for profit membership organisation which helped British businesses to trade electronically. This aimed to encourage small and medium-sized enterprises to develop their businesses through the use of E-commerce technologies.\nA series of guidance documents concerned with business purchasing operations and supply chain management was published in 1991.\nSmall firms' Merit Award for Research and Technology\nThe Small firms' Merit Award for Research and Technology (SMART) was a discretionary business grant scheme run by the DTI for a number of years in the 1980s and 1990s. The award was made to companies winning an annual competition (organised regionally) based on a judgement of the technical and market viability of research or technology development proposals; in essence the award represented seed-corn funding for innovative developments that had some market potential.\nThe scheme was generally considered to be very successful. In 2002 the scheme was changed from a competition to an award to any applicant who met minimum criteria. This led to several regions exhausting their budget. In 2005 the scheme was shut down and replaced with the Grant for Research and Development which was again a regional competition.\nSee also\n* Avanti (project)\n* Energy in the United Kingdom\n* Restricted Enforcement Unit\n* United Kingdom budget\n* Business Link – set up by the DTI in 1993\n* UK Trade & Investment – set up in 1999\n* Special Representative for International Trade and Investment\nReferences\nExternal links\n* [https://web.archive.org/*/http://www.dti.gov.uk Department of Trade and Industry] (Archive)\n** [http://webarchive.nationalarchives.gov.uk/20070506094157/http://www.dti.gov.uk/ DTI Website Archived on 6 June 2007]\n* [http://www.fotag.org.uk Friends of the Action Group]\n* [https://web.archive.org/web/20090217152951/http://ecommerce-awards.co.uk/index.html DTI e-commerce awards]\nVideo clips\n* [https://www.youtube.com/watch?v=Na_fVKrypng Enterprise Initiative]"
    }
  ]
}