{
  "content": [
    {
      "type": "text",
      "text": "# Department of Backward Classes, Most Backward Classes and Minorities Welfare (Tamil Nadu)\n\nThe Department of Backward Classes, Most Backward Classes and Minorities Welfare is one of the departments of Government of Tamil Nadu.\nObjective\nThe department is responsible for the formulation and implementation of welfare schemes and reservation in education and jobs for backward and most backward classes, de-notified communities and minorities.\nReservation\n{| class=\"wikitable\" style=\"float:right; font-size: 80%\"\n|+Reservation in Tamil Nadu\n! Category\n! Reservation\n|-\n|Backward Class\n|style=\"text-align:center\"|26.5%\n|-\n|Backward Class Muslim\n|style=\"text-align:center\"|3.5%\n|-\n|Most Backward Class  De-notified Community\n|style=\"text-align:center\"|20%\n|-\n|Scheduled Caste\n|style=\"text-align:center\"|18%\n|-\n|Scheduled Tribe\n|style=\"text-align:center\"|1%\n|-\n!Total\n!69%\n|}\nReservation is a system that allows the government to set reserved quotas or seats, at particular percentage in  education admissions, employments, promotions, etc. for socially and educationally backward communities. The Mandal Commission report in 1980 on the situation of the socially and educationally backward classes led to the implementation of reservation policies in the 1990s. The Supreme Court of India ruled in 1992 that reservations could not exceed 50 percent, however, Tamil Nadu has a 69 percent reservation, the highest in the country, through constitutional amendments and corresponding state laws. The department is responsible for the facilitation and ensuring the implementation of reservation wherever applicable including higher education and government jobs.\nWelfare schemes\nAs a part of welfare of backward communities, the department is responsible for the distribution of benefits such as free uniforms, bicycles and scholarship to students. It runs and maintains student hostels across the state for the respective community groups. The department is also responsible for implementing land distribution and construction of affordable housing through various welfare boards for the respective communities.\nMinority welfare\nThe minority welfare department is responsible for the welfare of both religious and linguistic minorities. For the religious minorities, the department is responsible for implementation of welfare schemes, maintenance of hostels and religious sites, pilgrimage aid, aid for women empowerment and education among others. The department also oversees the welfare, assistance and education of linguistic minorities who speak Telugu, Kannada, Malayalam, Marathi, Urdu and Saurashtra as their primary language.\nSee also\n* Government of Tamil Nadu\n* Tamil Nadu Government's Departments\nReferences\nExternal links\n* [http://www.tn.gov.in/department/4 Official website of the Tamil Nadu Backward Classes, Most Backward Classes and Minorities Welfare Department]\n* [http://www.tn.gov.in Official website of Government of Tamil Nadu]"
    }
  ]
}