{
  "content": [
    {
      "type": "text",
      "text": "# Department of Historic Heritage of São Paulo\n\n| jurisdiction    = City Hall of São Paulo\n| headquarters    = São Paulo, São Paulo\n| chief1_name     = Nelson Gonçalves\n| chief1_position =\n| chief2_name     =\n| website         = https://www.prefeitura.sp.gov.br/cidade/secretarias/cultura/patrimonio_historico/index.php?p=332\n}}\nThe Department of Historic Heritage of São Paulo is a public agency for historical preservation attached to the Municipal Secretariat of Culture of the São Paulo Municipal Government founded in 1975.\nHistory\nThe Secretariat of Culture dates back to the pioneering idea of the intellectual Mário de Andrade, who aimed to protect and preserve the cultural memory of the city of São Paulo. In 1975, during Ernesto Geisel's term in the military dictatorship, the Department of Historic Heritage of São Paulo was founded based on a bill sanctioned by then mayor Miguel Colasuonno (ARENA). The agency was created with the perspective of establishing methods to preserve the memory of the city and its first operational measure was the creation of inventories of urban environmental heritage.\nCurrently, the agency is composed of the Archaeology Center and the groups of: documentation and research, heritage enhancement, design, restoration and conservation, monuments and artistic works, and identification and listing. The agency is responsible for the municipality's listing processes, which includes works such as the monument to Duque de Caxias and the statue of Borba Gato. After the listing process, the entity is responsible for mapping, creating the history of the work and supervising the preservation of the work.\nThe agency works in collaboration with other Brazilian historical preservation institutions, such as the National Institute of Historic and Artistic Heritage (IPHAN) and the Council for the Defense of Historical Heritage (CONDEPHAAT). The responsible board for the department is the Municipal Council for the Preservation of the Historical, Cultural and Environmental Heritage of the City of São Paulo (CONPRESP).\nThe department, whose mission and vocation are linked to the very concept of culture and memory, originated two other important institutions in the city of São Paulo: the Department of Municipal Museums, today responsible for the São Paulo Museum, and the Municipal Historical Archive.\nCollections\nThe collection contains more than one hundred and fifty thousand items on a wide range of subjects about São Paulo. The entire collection of the institute up to the year 2014 has been digitized and can be consulted digitally.\nArchaeology Center\nThe Archaeology Center of São Paulo (CASP) is linked to the Department of Historic Heritage of São Paulo and has fifty-three collections and 1 million and 600 thousand fragments of archaeological remains. The center is located at Sítio Morrinhos, in the neighborhood of Casa Verde, in the municipality of São Paulo, and has space for visitation with free admission.\nSee also\n* Municipal Chamber of São Paulo\n* CONDEPHAAT\n* IPHAN\nReferences\nExternal links\n* [http://condephaat.sp.gov.br/?unonce=cf1f47d12f&uformid=176&s=uwpsfsearchtrg&taxo%5B0%5D%5Bname%5D=cidades&taxo%5B0%5D%5Bopt%5D=&taxo%5B0%5D%5Bterm%5D=sao-paulo&taxo%5B1%5D%5Bname%5D=classificacao&taxo%5B1%5D%5Bopt%5D=&taxo%5B1%5D%5Bterm%5D=uwpqsftaxoall&taxo%5B2%5D%5Bname%5D=livrostombo&taxo%5B2%5D%5Bopt%5D=&taxo%5B2%5D%5Bterm%5D=uwpqsftaxoall&skeyword= List of registered heritage sites in the city of São Paulo]"
    }
  ]
}