{
  "content": [
    {
      "type": "text",
      "text": "# Deputy High Commission of the United Kingdom, Chennai\n\n| coordinates =\n| deputy_high_commissioner = Halima Holland (since November 2024)\n|website =\n}}\nThe British Deputy High Commission, Chennai is the United Kingdom diplomatic mission with responsibility for the state of Tamil Nadu and the union territory of Puducherry. It was formed in 1947 with Sir Christopher Masterman, CSI, CIE, as its inaugural holder, who served as Deputy High Commissioner until the following year. The Deputy High Commissioner is equivalent to a Consul-General, and reports to the British High Commission. The current Deputy High Commissioner is Halima Holland. The first female head of the Chennai mission, she succeeds Oliver Ballhatchet.\nLocation\nThe consular section of the British Deputy High Commission, Chennai, is located at 20 Anderson Road, Nungambakkam. The British Council and the British Library are located at 737, Anna Salai.\nThe Deputy High Commission\nThe Deputy High Commission flies the Union Flag\nThe consular section of the British Deputy High Commission provides consular assistance and protection for British citizens. The Chennai consular region has Deputy High Commission office at Hyderabad and a Deputy High Commission office at Bangalore, functioning from 2009, for which visas are issued from the Deputy High Commission office at Chennai. The visa application centres are located in Chennai, Hyderabad, Kochi and Bangalore.\n;List of Deputy High Commissioners\nBelow is the list of deputy high commissioners of the British Deputy High Commission in Chennai (formerly Madras):\n# Sir Christopher Masterman, CSI, CIE (1947–1948)\n# Charles A. Gault, CBE (1948–1949)\n# James W. D. Locker, OBE (1949–1951)\n# George E. Crombie, CMG (1951–1953)\n# Leonard J. D. Wakely, CMG, OBE (1953–1957)\n# Ronald G. Chisholm (1957–1960)\n# Mark E. Allen, CMG, CVO (1960–1961)\n# William J. M. Paterson, CMG (1961–1965)\n# Clifford B. B. Heathcote-Smith, CBE (1965–1968)\n# Victor C. Martin, OBE (1968–1971)\n# John E. A. Miles, CBE (1971–1975)\n# Alfred C. Hall, CBE (1975–1977)\n# Neville A. I. French, CMG, LVO (1977–1980)\n# Arthur S.-M. Marshall, CBE (1980–1983)\n# Thomas Stubbs, OBE (1983–1986)\n# David K. Sprague, MVO (1986–1989)\n# Anthony B. N. Morey, CBE (1989–1991)\n# David Cockerham, CBE (1991–1994)\n# Sidney H. Palmer (1994–1999)\n# Michael E. J. Herridge (1999–2003)\n# Stuart H. Innes (2003–2005)\n# Michael L. Connor (2005–2009)\n# Michael S. Nithavrianakis (2009–2013)\n# Bharat Joshi (2013–October 2018)\n# Jeremy Pilmore-Bedford (October 2018–October 2019)\n# Oliver Ballhatchet, MBE (October 2019–November 2024)\n# Halima Holland (November 2024–Present) (First women head of mission in Chennai)\nFunctions\nIn 2006, the Deputy High Commission at Chennai processed 11,224 visa applications, next only to the Mumbai Centre. The High Commissions at Mumbai, New Delhi and Kolkata processed 14,366, 6,688 and 1,328 applications, respectively. In 2008, of the 336,000 student visas issued in India, around 20 per cent (67,000) were issued in Chennai. Of late, the visa rejection rate from the Deputy High Commission at Chennai has been increased.\nAs part of the U.K. Border Agency's new guidelines, the Deputy High Commission started processing U.K. visa applications from the British High Commission in Colombo, Sri Lanka, in a phased manner. As of 2011, the U.K. Border Agency in Chennai processed most visa applications from Sri Lanka.\nIn December 2013, the Deputy High Commission launched a pilot passport pass-back service, a user-pays service that enables applicants to retain their passport for the majority of the application processing period, for the first time in the country.\nThe British Council\nLogo of the British Council\nThe British Council division of the Deputy High Commission is the United Kingdom's primary cultural relations organisation and is responsible for activities in education, English language, governance, science and the arts. The British Council office at Chennai covers the South Indian region. It plays an important role in helping Indian students pursue their studies in the United Kingdom. The council also manages the British Library. The British Council division publishes two magazines—Postgraduate U.K. and Club U.K., the latter meant for Indian students.\nAccording to 2004 U.K. government figures, of the 14,000 Indian students studying in the United Kingdom, 43 per cent hail from South India.\nIn 2010, the British Council launched the British Council IELTS Scholarship Award with the objective of assisting Indian students to continue their postgraduate study at any university abroad.\nSee also\n* List of diplomatic missions in Chennai\n* India–United Kingdom relations\n* List of diplomatic missions of the United Kingdom\n* Foreign relations of India\n* Foreign relations of the United Kingdom\nReferences\nExternal links\n* [https://www.gov.uk/government/world/organisations/british-deputy-high-commissioner-chennai Official website of the British Deputy High Commission Chennai]\n* [http://www.britishcouncil.org/india Official website of the British Council]"
    }
  ]
}