{
  "content": [
    {
      "type": "text",
      "text": "# Derana Film Awards\n\n| website        = http://cinema.lk/DFA/\n}}\nDerana Film Awards (Sinhala:දෙරණ සිනමා සම්මාන)  is an award bestowed to distinguished individuals involved with the Sri Lanka's silver screen, each year by the TV Derana, Sri Lanka in recognition of the contributions made by them to the Sri Lankan cinema industry and cinema achievements. The Derana Film Awards ceremony is one of the most popular cinema award events in Sri Lanka. The awards were first introduced in 2012 with Unilever Sri Lanka has been the main sponsors of this Film festival.\n2012 Derana Film Awards\nMain Competition\n* Best Actor  - Pubudu Chathuranga (Challenges)\n* Best Actress  - Dilhani Ekanayake (Gamani)\n* Best Direction  – Sarath Wijesekara (Gamani)\n* Best Cinematography  – Asoka Sigera (Gamani)\n* Best Picture  – Gamani\n* Best Screenplay – Sarath Weerasekara (Gamani)\n* Best Actor in supporting role  – Kumara Thirimadura (Gamani), W. Jayasiri (Gamani)\n* Best Actress in supporting role – Anuruddika Paddukage (Gamani)\n* Best Edit – Ravindra Guruge (Gamani)\n* Best Sound Mix – Kalinga Perera (Gamani)\nCinema of Tomorrow\n* Best Film - Ini Avan by Asoka Handagama\n* Most Promising Director - Aruna Jayawardhana for Nikini Wassa\n* Special Jury Mention Nino Live and Karma\nPopular category\n* Most Popular Actress - Anarkali Akarsha\n* Most Popular Actor - Ranjan Ramanayake\n2013 Derana Film Awards\nThe second Derana Film Awards ceremony was held at the Musaeus College Auditorium. 33 awards were given at the ceremony.\nMain Competition\n* Best Film - Ini Avan by Asoka Handagama\n* Best Direction  – Asoka Handagama (Ini Avan)\n* Best Actor  - Darshan Dharmaraj (Ini Avan)\n* Best Actress  - Nirajani Shanmugaraja (Ini Avan)\n* Best Actor in supporting role  – Raja Ganeshan (Ini Avan)\n* Best Actress in supporting role – Veena Jayakodi (Kusa Pabha)\n* Best Actor in negative role – Buddhika Jayaratne (Senasuru Maruwa)\n* Best Stunt Coordination – Teddy Vidyalankara (Senasuru Maruwa)\n* Best Child Actor – K.M Pavithra (Matha)\n* Best Background Music  - Rohana Weerasinghe Kusa Pabha\n* Best Original Music score  - Rohana Weerasinghe Kusa Pabha\n* Best Singer (male) - Kasun Kalhara (Madhu Chandra Yame)\n* Best Singer (female) - Nirosha Virajini (Premaye Mandire)\n* Best Film Song - Jala Dharawe of Kusa Pabha\n* Best Cinematic Song - Madhura Wasanthe of Kusa Pabha\n* Best Lyrics – Sunil Wimalaweera (Senasuru Maruwa)\n* Best Cinematography  – Miton Kan, Donald Karunarathne and K A Darmasena (Matha)\n* Best Picture  - (Ini Avan)\n* Best Screenplay  - Asoka Handagama (Ini Avan)\n* Best Editing - Stephen Philipson (Matha)\n* Best Sound  - Lionel Gunarathne and Sashika Ruwan (Karma)\n* Best Visual Effects - Boodee Keerthisena (Matha)\n* Best Sound Effects - Lionel Gunaratne & Sajitha Ruwan (Karma)\n* Best Choreography - Chandana Wickramasinghe (Kusa Pabha)\n* Best Art Director - Henatigala Premadasa (Kusa Pabha)\n* Best Make-up - Wasantha Vittachchi & Upul Mahanama (Matha)\n* Best Costume Design - Wenuka Wickramaratne (Kusa Pabha)\nCinema of Tomorrow\n* Best Film Samanala Sandwaniya by Jayantha Chandarsiri\n* Most Promising Director - Udaya Dharmawardena for Miles of a Dream\n* Special Jury Prize - Vimkthi Jayasundara for Ahasin Wateyi\n* Best Short Film - Ilam Hussain for Chavos\nSpecial Jury Prize  - Between Two Worlds by Vimukthi Jayasundara\nSpecial Jury Award for future hopes on Film Direction - Isuru Weerasinghe Mudali\nPopular category\n* Most Popular Actress - Pooja Umashankar\n* Most Popular Actor - Roshan Ranawana\n* Most Popular Film - 'Kusa Pabha'\nDerana Lifetime Award\n* Lester James Peries\n2015 Derana Film Awards\nThe third Derana Film Awards ceremony was held at the Nelum Pokuna Theatre. 26 awards were given at the ceremony.\nMain Competition\n* Best Film - Thanha Rathi Ranga by Nilendra Deshapriya\n*Best Best Direction - Parakrama Jayasinghe (Que Sera)\n* Best Actress  - Michelle Harft (Que Sera)\n* Best Actor – Sarath Kothalawala (Thanha Rathi Ranga)\n* Best Supporting Actor - Hans Billimoria (Que Sera)\n* Best Supporting Actress – Sulochana Weerasinghe (Thanha Rathi Ranga)\n* Best Negative Role – Damith Fonseka (Que Sera)\n* Best Comedy Role – Sando Harris (Que Sera)\n* Best Script – Sarath Kothalawala & Kumara Thirimadura (Thanha Rathi Ranga)\n* Best Editor – Ravindra Guruge (Thanha Rathi Ranga)\n* Best Cinematography - Dhanushka Gunatilake (Thanha Rathi Ranga)\n* Best Music - Gayathri Khemadasa & Anupa Khemadasa (Thanha Rathi Ranga)\n* Best Playback singer (male) – Lelum Rathnayake (Que Sera)\n* Best Playback singer (female) – Uresha Ravihari (Wariga Pojja)\n* Best Audio Visual – Chamith Paranavitana (Ranja)\n* Best Costume Design – Methnuwan Wijesinghe & Niluka Wanigaratne (Thanha Rathi Ranga)\n* Best Editor – Narada Thotagamuwa (Thanha Rathi Ranga)\n* Best Art Director – Roshan Warnakulasuriya (Que Sera)\n* Best Stunt Director – Wasantha Kumaravila (Ranja)\n* Best Promising Film – Shameera Rangana Naotunna (Motor Bicycle)\nCinema of Tomorrow\n* Best Film Motor Bicycle by Shameera Rangana Naotunna\n* Most Promising Director - Indika Udugampola for The Night Is Still Young\n*Best Short Film – Viraj Liyanarchchi (Therkovski Meets Godot)\nPopular category\n* Most Popular Actress - Dilhani Ekanayake\n* Most Popular Actor - Ranjan Ramanayake\n* Most Popular Film Song-Dinesh Subasinghe Wariga Pojja Movie theme\n* Blockbuster Movie of the Year - Siri Daladagamanaya\nDerana Lifetime Award\n* Vasantha Obeysekera\n2016 Derana Film Awards\n18 awards were given at the Fourth Derana Sunsilk Film Awards.\nMain Competition\n* Best Picture - Indika Fernando (Ho Gaana Pokuna)\n* Best Direction – Prasanna Vithanage (Oba Nathuwa Oba Ekka)\n* Best Director – Jury Prize Satyajit Maitipe for Bora Diya Pokuna\n* Best Actress - Kaushalya Fernando (Bora Diya Pokuna)\n* Best Actor - Jackson Anthony (Address Na)\n* Best Cinematography - Channa Deshapriya (Address Na)\n* Best Script - Sathyajith Maitipe (Bora Diya Pokuna)\n* Best Music Director - Dinesh Subasinghe (Ho Gaana Pokuna)\n* Best Supporting Actor - Jayalath Manoratne (Ho Gaana Pokuna)\n* Best Supporting Actress - Sabeetha Perera (Address Na)\n* Best Comedy Actor - Mahendra Perera (Gindari)\n* Best Film Song - Sira Wee Tibuna Hada Patule\n* Best Costume Design - Harsha Manjula (Address Na)\n* Best Art Director - Rohan Samaradiwakara (Maharaja Gemunu)\nCinema of Tomorrow\n* Best Film -  Sarath Dharmasiri (Suwisi Vivaranaa )\n* Most Promising Director - Malith Hegoda ( Dekala Purudu Kenek)\n* Best Short Film Director - Krishan Kodithuwakku (Wiggle Room)\nPopular category\n* Most Popular Actor - Hemal Ranasinghe\n* Most Popular Actress  - Dinakshie Priyasad\n* Most Popular Film Song -Dinesh Subasinghe, Ho Gana Pokuna\nDerana Lifetime Award\n* Swarna Mallawarachchi\n2017 Derana Film Awards\n30 awards were given at the Fifth Derana Sunsilk Film Awards.\nMain Competition\n* Best Picture - Asoka Handagama (Let Her Cry)\n* Best Direction - Sameera Rangana Naotunna - (Motor Bicycle)\n* Best Actress - Swarna Mallawarachchi (Let Her Cry)\n* Jury PrizeSamanalee Fonseka for (Motor Bicycle)'\n* Best Actor - Dasun Pathirana (Frangipani)\n* Best Actor in Supporting Role - Gayan Wickramathilaka (Sakkarang)\n* Best Actress in Supporting Role - Aruni Rajapaksha (Paththini)\n* Best Actor / Actress in a Negative Role - Pubudu Chathuranga (Sakkarang)\n* Best Upcoming Actress - Rithika Kodithuwakku (Let Her Cry)\n* Best Actor / Actress in a Comedy Role - Sarath Kothalawala (Sakkarang)\n* Best Script - Ashoka Handagama (Let Her Cry)\n* Best Playback singer (male) - Ajith Kumarasiri (Motor Bicycle)\n* Best Playback singer (female) - Nirosha Virajini (Paththini)\n* Best Lyrics - Asoka Handagama (Let Her Cry)\n* Best Cinematography - Wishwajith Karunaratne (Motor Bicycle)\n* Best Editor - Tissa Surendra (Motor Bicycle)\n* Best Sound Effects - Aruna Priyantha Kaluarachchi (Motor Bicycle)\n* Best Playback Music Direction - Ajith Kumarasiri (Motor Bicycle)\n* Best Visual Effects - Kasun Malinda & Greshan Kularatne (Sarigama)\n* Best Art Direction - Lal Hevindranath (Sakkarang)\n* Best Costume Design - Venuka Wickramarchchi (Paththini)\n* Best Make-up - Priyantha Wanninayake (Sayapethi Kusuma)\n*special Jury Prize Prasanna Vithanage for Silence in the Courts\nCinema of Tomorrow\n* Best Film Malaka Dewapriya (Bahuchithawadiya)\n* Most Promising Director - Jude Ratnam (Demons in Paradise)\n* Best Short Film Director - Dhananjaya Bandara\nPopular category\n* Most Popular Song - Ahasin Eha (Adaraneeya Kathawak)\n* Most Popular Actress - Pooja Umashankar\n* Most Popular Actor - Ranjan Ramanayake\n* Blockbuster Movie of the Year –Paththini\nDerana Lifetime Award\n* Dr. Dharmasena Pathiraja\n2018 Derana Film Awards\n30 awards were given at the Sixth Derana Sunsilk Film Awards.\nMain Competition\n* Best Picture - 28 by Prasanna Jayakody\n* Best Direction  - Prasanna Jayakody (28)\n* Best Screenplay - Prasanna Jayakody (28)\n* Best Actor - Jackson Anthony (Dharmayuddhaya)\n* Best Actress - Dilhani Ekanayake (Dharmayuddhaya)\n* Best Actor In a Supporting Role - Kumara Thirimadura (Dharmayuddhaya)\n* Best Actress In a Supporting Role - Umali Thilakarathne (A Level)\n* Best Comedian - Tennison Cooray (Kota Uda Express)\n* Best Cinematography - Prabath Roshan (Aloko Udapadi)\n* Best Editing - Rangana Sinharage (28)\n* Best Sound Design - Aruna Priyantha Kaluarachchi (Sulanga Gini Aran)\n* Best Visual Effects - Chathra Weeramana / Baratha Hettiarachchi (Aloko Udapadi)\n* Best Art Direction - Sunil Wijerathne (Aloko Udapadi)\n* Best Makeup - Jayantha Ranawaka (Aloko Udapadi)\n* Best Costume - Kumara Karandeniya (Aloko Udapadi)\n* Best Original Music Score - Milinda Tennakoon (Aloko Udapadi)\n* Best Choreography - Chandana Wikramasinhe (Ali Kathawa)\n* Best Lyric - Rambukkana Siddhartha Thero (Aloko Udapadi)\n* Best Singing - Amarasiri Peiris (Aloko Udapadi)\n* Best Jury Mention - Sachira Wijesinghe / Lahiruka Ekanayake (A Level)\nCinema of Tomorrow\n* Best Film - Ikka by Kaushalya Madhawa Pathirana\n* Most Promising Director - Chinthana Dharmadasa for Avilena Sului\n* Best Short Film - Thisara Mangala Bandara Ganan Gannethi Kathawak\n* Special Jury Prize - Visakesa Chandrasekaram for \"Panshu\"\nPopular Award category\n* Most Popular Song - Mal Kalamba Langa (Dedunu Akase)\n* Most Popular Actress - Yureni Noshika\n* Most Popular Actor - Hemal Ranasinghe\n* Blockbuster Movie of the Year – Dharmayuddhaya\nDerana Lifetime Award\n* Malini Fonseka\n2019 Derana Film Awards\n30 awards were given at the Sixth Derana Sunsilk Film Awards.\nMain Competition\n*Best Film: According to Matthew - Chandran Rutnam\n*Best Actor: Darshan Dharmaraj (Porisadaya)\n*Best Actress: Anoma Janadari (Davena Vihagun)\n*Best Screenplay: Jayantha Chandrasiri (Gharasarapa)\n*Best Film Director: Sanjeewa Pushpakumara (Davena Vihagun)\n*Best Best Actor In a Supporting Role: Mahendra Perera\n*Best Best Actress In a Supporting Role: Samanalee Fonseka\n*Best Comedian: Bandu Samarasinghe\n*Best Villain: Teddy Vidyalankara\n*Best Upcoming Actor: Devnaka Porage\n*Best Upcoming Actress: Nayanathara Wickramarachchi\n*Lux Glamorous Star: Shalani Tharaka\n*Special Jury Awards for Debut Performances: Devnaka Porage of Gharasarapa and Gavin Ludewyke of According to Mathew\nPopular Award category\n*Most Popular Actor: Jackson Anthony\n*Most Popular Actress: Udari Warnakulasooriya\n*Blockbuster Movie of the Year: Bimba Devi Alias Yashodhara by Prof. Sunil Ariyaratne\nDerana Lifetime Award\n* Amarasiri Kalansuriya\n2022 Derana Film Awards\n29 awards were given at the Seventh Derana Film Awards.\nMain Competition\n*Best Film: Alborada - H.D. Premasiri\n*Best Film Director: Asoka Handagama (Alborada)\n*Best Screenplay: Asoka Handagama (Alborada)\n*Best Actor: Tray Hicks (Praana)\n*Best Actress: Yureni Noshika (Night Rider)\n*Best Best Actor In a Supporting Role: Wasantha Kumaravila (The Game)\n*Best Best Actress In a Supporting Role: Rithika Kodithuwakku, Anne Solen Hatte and Nimaya Harris (Alborada)\n*Best Cinematography: Stryner Adams (Praana)\n*Best Editing: Ravindra Guruge (Alborada)\n*Best Music Direction: Ajith Kumarasiri and Namini Panchala (Alborada)\n*Best Costume: Priyan Arunasiri (The Game)\n*Best Makeup: Samarasiri Kandanage (Alborada)\n*Best Art direction: Dhammika Hewaduwatta (Praana)\n*Best Sound management: Sashin Gimhan (Praana)\n*Best VFX: Buddhika Wijeratne and Saminda Wathawanavithanage (Praana)\n*Best Upcoming cinema: Munel (Visakesa Chandrasekara)\n*Best Upcoming director: Jagath Manuwarna (Rahas Kiyana Kandu)\n*Best Short film: Distance Director (Thisen Umagiliya)\n*Special Jury award: Marcus (Keniston John)\nPopular Award category\n*Most Popular Actor: Ranjan Ramanayake\n*Most Popular Actress: Nayanathara Wickramarachchi\n*Most Popular Comedian: Rodney Warnakula\n*Most Popular Villain: Bimal Jayakody\n*Most Popular Singer: Bathiya and Santhush\n*Most Popular Music director: Yasas Medagedara\n*Most Popular Lyricist: Shehan Galahitiyawa\n*Most Popular Choreographer: Gayan Srimal\n*Blockbuster Movie of the Year: Gindari 2 by Udayakantha Warnasuriya\n2023 Derana Film Awards\nMain Competition\n*Best Picture: Munnel\n*Best Director: Visakesa Chandrasekaram\n*Best Screenplay: Visakesa Chandrasekaram\n*Best Actor in a Leading Role: Sajitha Anthony\n*Best Actress in a Leading Role: Udari Warnakulasooriya\n*Best Costume: Janka Ullandupitiya, Piyathissa Akuramboda, & Buddhi Sanjaya Edirisinghe\n*Best Actor in a Supporting Role: Sarath Kothalawala\n*Best Actress in a Supporting Role: Kamala Sri\n*Best Upcoming Actor: Sivakumar Lingeshwaran\n*Best Upcoming Actress: Dinara Punchihewa\n*Best Makeup: Narada Thotagamuwa\n*Best Art Direction: Upul Chamila\n*Best Sound Design : Tapas Nayak\n*Best Short Film Cinema of Tomorrow: Sandeep Mithum Darshana for Aragalaya\nDerana Lifetime Award\n* Dr. Nanda Malini\n*Popular Actor:  Sajitha Anthony\n*Popular Actress: Shalani Tharaka\n*Popular Song: Bombai Mutai - Sunil Perera Received by Piyal Perera\n*Popular Actor In a Negative Role:  Jackson Anthony\n*Popular Actor in Comedy Role: Jayalath Manoratne\n*Popular Choreographer: Sanka Abeyasingha\n2024 Derana Film Awards\nThe 10th edition was held at the Nelum Pokuna Theatre in Colombo on 19 September 2025.\nMain Competition\n*Best Picture: Doosra\n*Best Director: Channa Deshapriya (Doosra)\n*Best Screenplay: Channa Deshapriya (Doosra)\n*Best Actor in a Leading Role: Hemal Ranasinghe (Sihina Nelum Mal)\n*Best Actress in a Leading Role: Rashipabha Sandipani (Visal Adare)\n*Best Costume: Ramesha Oshini (Gautama Buddha Matha)\n*Best Actor in a Supporting Role: Sajitha Anthony and Shyam Fernando (both for Doosra)\n*Best Actress in a Supporting Role: Dinakshie Priyasad (Visal Adare)\n*Best Upcoming Actor: Megha Sooriyaachchi (Mandara)\n*Best Upcoming Actress: Dusheni Miurangi (Sihina Nelum Mal)\n*Best Cinematography – Dammika Rathnayake (Doosra)\n*Best Original Background Score – Chinthaka Jayakodi (Doosra)\n*Best Editing – Tissa Surendra (Doosra)\n*Best Makeup: Samarasiri Kandange (Doosra)\n*Best Art Direction: Manjula Ayagama (Gautama Buddha Matha)\n*Best Sound Design : Sasika Ruwan Marasinghe (Doosra)\n*Best Short Film – Elephant’s House (Wasantha Dukgannarala)\n*Best Visual Effects – Kasun Malinda (Sri Siddha)\n*Best Color Grading – Tissa Surendra (My Red Comrade)\nCinema of Tomorrow\n*Most Promising Director – Thillaiampalam Suthakaran Mathisudha (Dark Days of Heaven)\n*Best Film - Peacock Lament (Sanjeewa Pushpakumara)\n*Best Film Jury Award – Malaki Duwe Numba (Kalpana Ariyawansa and Vindana Ariyawansa)\nJury Awards\n*Sudath Mahaadivulwewa (My Red Comrade)\n*Ritigala Sumedha (Sri Siddha)\n*Prof. Sunil Ariyaratne (Gautama Buddha Matha)\nPopular Awards\n*Popular Actor:  Sajitha Anthony\n*Popular Actress: Nethmi Roshel\n*Popular Movie : Sinhabahu\n*Popular Song: Yasas Medagedara, Shehan Galahitiyawa Mai Mal (Visal Adare)\n*Popular Actor In a Negative Role: Ashan Dias\n*Popular Actor in Comedy Role: Bandu Samarasinghe\n*Popular Choreographer: Gayan Srimal\n*Blockbuster Movie of the Year – Sinhabahu\nDerana Lifetime Award\n* Ravindra Randeniya\nReferences\nExternal links\n*[http://www.sarasaviya.lk/2013/09/26/?fn=sa1309267 දෙරණ සිනමා උළෙල]"
    }
  ]
}