{
  "content": [
    {
      "type": "text",
      "text": "# Desert Warrior (2025 film)\n\n| producer       =\n| starring       =\n| cinematography = Guillermo Garza\n| editing        =\n| music          = Dan Levy\n| studio         =\n| distributor    =\n| released       =\n| runtime        = 114 minutes\n| country        =\n| language       =\n| budget         = $150 million\n| gross          =\n}}\nDesert Warrior is a 2025 historical action drama film directed by Rupert Wyatt, who co-wrote the screenplay with Erica Beeney, David Self, and Gary Ross.  The film stars Anthony Mackie and Aiysha Hart.\nThe film premiered at the Zurich Film Festival on September 28, 2025.\nPremise\nArabia was full of disparate, feuding tribes in the seventh century, one of which was led by the Iranian Emperor Kisra. After he comes across the Arabian Princess Hind, Kisra attempts to make her his concubine.  Hind refuses, however, and escapes with an unknown warrior.\nCast\n* Anthony Mackie as Hanzala\n* Aiysha Hart as Princess Hind\n* Sharlto Copley as Jalabzeen\n* Ghassan Massoud as King Numan\n* Sami Bouajila\n* Lamis Ammar\n* Géza Röhrig\n* Ben Kingsley as Emperor Kisra\n* Numan Acar as Ebn Wael\nProduction\nDesert Warrior was announced in November 2021 as a film produced by JB Pictures and AGC Studios along with MBC Studios, the Saudi-backed production arm of MBC.  It was written by Rupert Wyatt, Erica Beeney, David Self, and Gary Ross, with Wyatt directing the film as well. The cast includes Anthony Mackie, Aiysha Hart, Sharlto Copley, Ghassan Massoud, Sami Bouajila, Lamis Ammar, Géza Röhrig, Ben Kingsley, and Numan Acar.  It was one of the first major English-language film produced by MBC Studios, and it is the largest production to film in Saudi Arabia.  MBC saw it as an anchor for the nascent film industry that was being established in the region, where key crewmembers were brought in for the project to effectively train and develop Saudi crews learning about the industry.  The crew size was approximately 450–500 people each day.\nPrincipal photography began in September 2021 in Neom, Saudi Arabia, and it was completed by February 2022.  The film had a long post-production period, and it planned to seek buyers in the first quarter of 2024, targeting a film festival debut before a wide theatrical release. In October 2024, it was reported that Wyatt had briefly exited the film due to creative differences, but later returned to finish editing the film. Guillermo Garza serves as the cinematographer, Richard Mettler serves as editor, and Dan Levy was the composer for the film.\nRelease\nDesert Warrior premiered at the Zurich Film Festival on September 28, 2025.\nReception\nFilm critic Damon Wise writes that \"extraordinary images\" were captured by the director and cinematographer, but that the film turns into a bit of a slog becoming \"a stodgy, sprawling, feminist, pre-Islamic Ghandi.\"\nReferences\nExternal links\n*"
    }
  ]
}