{
  "content": [
    {
      "type": "text",
      "text": "# Desmond King-Hele\n\nDesmond George King-Hele FRS (3November 192725December 2019) was a British physicist, poet and author who crossed the divide between the arts and science to write extensively about the life of Erasmus Darwin, whom he linked with the romantic poets Shelley, Wordsworth, and Coleridge. In 1957, together with Doreen Gilmour, and as part of the Guided Weapons department of Royal Aircraft Establishment, he wrote a report proposing the use of the Blue Streak missile and Black Knight as a satellite launcher.  See also: Blue Streak Satellite Launch Vehicle.\nLife and career\nHe was born in Seaford, Sussex, the son of Sidney G. and Bessie (née Sayer) King-Hele and was educated at Epsom College and Trinity College, Cambridge.\nHe joined the Royal Aircraft Establishment, Farnborough in 1948 and stayed there until 1988, researching the gravity of Earth and its upper atmosphere by satellite orbit determination. He was awarded the Eddington Medal of the Royal Astronomical Society in 1971 for his work on the geophysical application of the study of the orbits of artificial satellites. He was elected a fellow of the Royal Society in March 1966 and gave the Bakerian lecture in 1974 and the Wilkins Lecture in 1997. 2019 he was awarded a Honorary Doctor of Letters by the University of Derby.\nHe is considered \"one of the pioneers of space geodesy\".\nBased on satellite geodesy, King-Hele refined the estimate for Earth's pear shape, finding a 45&nbsp;m difference between north and south polar radii.\nHe married Marie Newman in 1954; they had two daughters.\nHe won the Chree medal and prize in 1971.\nIn 1973, he correctly predicted that Skylab would re-enter Earth's atmosphere in 1979.\nKing-Hele died on 25 December 2019.\nPublications\n* Satellites and Scientific Research 1962\n* Shelley: His Thought and Work 1962\n* Erasmus Darwin 1963\n* Theory of Satellite Orbits in an Atmosphere 1964\n* Doctor of Revolution 1977\n* Observing Earth Satellites 1983\n* Shelley: His Thought and Work 1984\n* Erasmus Darwin and the Romantic Poets 1986\n* A Tapestry of Orbits 1992, 2005\n* Erasmus Darwin: A Life of Unequalled Achievement 1999\n* Erasmus Darwin and Evolution 2014\nHe is also the author of two books of poetry, and of various articles published in journals, such as \"Shelley and Science\", Notes and Records of the Royal Society of London, Vol. 46, No. 2 (Jul., 1992), pp. 253-265.\nReferences\nExternal links\n* Text of the award speech\n* Early plans for a Blue Streak-based satellite launcher\n*  at the British Library\n* [https://www.google.com.br/search?tbo=p&tbm=bks&q=inauthor:%22King-Hele%22 Author profile at Google Books]"
    }
  ]
}