{
  "content": [
    {
      "type": "text",
      "text": "# Desperately Seeking Susan__disambig_1\n\n| starring       =\n| music          = Thomas Newman\n| cinematography = Edward Lachman\n| editing        = Andrew Mondshein\n| studio         = Orion Pictures\n| distributor    = Orion Pictures\n| released       =\n| runtime        = 104 minutes\n| country        = United States\n| language       = English\n| budget         = $5 million\n| gross          = $27.3 million (US)\n}}\nDesperately Seeking Susan is a 1985 American comedy-drama film directed by Susan Seidelman and starring Rosanna Arquette, Aidan Quinn and Madonna. Set in New York City, the plot involves the interaction between two women – a bored housewife and a bohemian drifter – linked by various messages in the personals section of a newspaper. The film was Madonna's first major screen role and also provided early roles for a number of other well-known performers, such as John Turturro, Giancarlo Esposito, Laurie Metcalf and Steven Wright.\nThe screenplay was written by Leora Barish, and is said to have been given an uncredited rewrite by Craig Bolotin. Desperately Seeking Susan was a commercial success and ended as the 31st-highest-grossing film of the year, grossing $27.3 million in the United States. The film received predominantly positive reviews, and both Arquette's and Madonna's acting were critically acclaimed.\nDesperately Seeking Susan is noted for its impact on 1980s fashion, especially among the young female audience at that time. The movie's costumery was influenced in part by Madonna's own early style. The film was also noted as a representation of yuppie culture and feminism. Some critics labeled Desperately Seeking Susan as one of the best American films of the year, including Vincent Canby from The New York Times, and eventually, of the decade by publications such as NME and Rolling Stone. Many others have labeled it a cult classic of the 1980s. In 2023, the film was selected for preservation in the United States National Film Registry by the Library of Congress as being \"culturally, historically, or aesthetically significant\".\nPlot\nRoberta Glass, an unfulfilled housewife from Fort Lee, New Jersey, is fascinated by the messages between lovers Susan Thomas and Jim Dandy in the personals section of a New York City tabloid. She is particularly drawn to Jim's ad for Susan with the headline \"Desperately Seeking Susan\", which proposes a rendezvous in Battery Park.\nMeanwhile, in an Atlantic City hotel, the itinerant Susan reads the personals section after a tryst with mobster Bruce Meeker. She steals a pair of ornate Egyptian earrings from his coat before departing. The sinister Wayne Nolan notices Susan's embellished tuxedo jacket as she leaves. Arriving in New York City, Susan dons one of the earrings and stashes the other in her suitcase in a Port Authority locker. She asks to stay with her friend Crystal, a magician's assistant at the Magic Club, and learns that Meeker was killed at the hotel.\nHoping to spot the lovers, Roberta goes to Battery Park and sees Jim reunite with Susan before leaving with his band for Buffalo. Later, she follows Susan to a vintage store and watches her trade in her jacket before losing sight of her. Roberta buys the jacket and finds Susan's locker key in its pocket. She posts another \"Desperately Seeking Susan\" ad to meet with Susan and return the key. Meanwhile, Jim becomes concerned about the ad and Susan's connection to Meeker's death. He asks his best friend Dez to check on her.\nWaiting for Susan at Battery Park and wearing her jacket, Roberta is accosted by Nolan, who mistakes her for Susan as she is blonde and wearing the distinctive jacket. Susan spots Roberta, but cannot reach her as police detain her for not paying her taxi fare. Dez arrives on a moped and rescues Roberta, who falls and hits her head, causing her to lose her memory and her bag. He believes she is Susan and finds the locker key, taking her to the Port Authority to collect Susan's suitcase. There, Roberta finds the other earring, and Dez offers her the couch at his apartment for one night. When they arrive, they find Dez's ex-girlfriend, Victoria, and her new partner taking most of the apartment items, leaving him with practically nothing, including no couch.\nBelieving she is Susan, Roberta retraces Susan's steps with Nolan in pursuit. She and Dez attempt to have breakfast at a diner, where she is mistaken for Susan because of the jacket she is wearing. She and Dez are physically ejected from the diner, but Nolan picks up a postcard for the Magic Club she drops. Roberta eventually arrives at the Magic Club, narrowly missing Susan who has been released from jail and discovered her suitcase is gone. Roberta is then hired as Crystal's replacement. After her disastrous first performance, Nolan attacks her, demanding the earrings. He escapes as the police arrive. Roberta hits her head again, this time regaining her memory. However, she is mistaken for a prostitute and arrested.\nMeanwhile, Roberta's husband Gary, who is revealed to be in the midst of a casual affair, searches for her. He finds his way to the vintage store and is given Susan's number. She believes that Roberta and Dez are connected to Meeker's death and want to frame her. Susan arranges to meet Gary at a nightclub and accompanies him home, where they get high. Roberta calls from jail, but hangs up when Susan and Gary answer. After calling Dez to bail her out, they discover his apartment has been ransacked by Nolan. Roberta and Dez end up sleeping together, with Dez believing he is sleeping with his best friend's girl.\nAt Gary's house, Susan sees a television report about Meeker and Nolan stealing the earrings, which once belonged to Nefertiti. She realizes the truth about Roberta from her diary and posts an ad to meet her at the Magic Club. Dez attacks an intruder in his apartment who turns out to be Jim. He confesses to his relationship with \"Susan\" as Roberta slips away. She reads the ad, as do Jim and Dez. They arrive at the Magic Club along with Gary, his sister Leslie, and Nolan.\nDuring her magic act, Roberta recognizes Nolan, who escapes backstage. Dez leaves as Roberta tries to explain the events of her disappearance to Gary, finally voicing her unhappiness and ending their marriage. Nolan threatens Susan at gunpoint, but is knocked out by Roberta. Roberta and Susan finally meet each other for the first time. Later, Roberta finds Dez in his projection booth at the movie theater where he works. She introduces herself properly, and they kiss as Jim and Susan watch the film below. Roberta and Susan are celebrated as heroes in the newspaper, credited with returning the stolen earrings.\nCast\nSeidelman employed a wide range of artists in small appearances, including comedian Rockets Redglare as a taxi driver; former member of the Shirts Annie Golden as a band singer; performance artist Ann Magnuson as a cigarette girl; musician and painter John Lurie as the neighbor saxophonist;  La Mama and Living Theatre member Shirley Stoler as a jail matron; Ambitious Lovers member Arto Lindsay as the newspaper clerk who places the \"seeking\" ads; Ensemble Studio Theater founder Curt Dempster as coffee shop manager, Nick; and future Seinfeld-writer Carol Leifer as a party guest. Other notable appearances include actors Richard Edson as a man with newspapers, Victor Argo as Sgt. Taskal, Kim Chan as a park bum, and Michael Badalucco as a guy from Brooklyn. Triplets Eddy, David and Robert make an uncredited cameo as themselves.\nProduction\nOrion chairman Mike Medavoy initially campaigned for Barbra Streisand to play the title role. The filmmakers initially wanted Diane Keaton and Goldie Hawn to play Roberta and Susan, but the director decided to cast newcomers Arquette and Madonna instead and the studio wanted the movie to have younger actors in order to appeal to younger filmgoers. Bruce Willis was up for the role of Dez and Melanie Griffith was up for the role of Susan. Madonna obtained the role over Ellen Barkin and Jennifer Jason Leigh. Suzanne Vega also auditioned for the role. The Statue of Liberty can be seen in the movie when it was still covered in scaffolding during its two-year renovation. Costume designer Santo Loquasto designed Susan's distinctive jacket (supposedly first worn by Jimi Hendrix), basis of the plot of mistaken identity.\nThe movie was inspired in part by the movie Céline et Julie vont en bateau (Céline and Julie Go Boating) (1974). It also has an alternate ending included on the DVD, in which Susan and Roberta are invited to Egypt after helping return the earrings. They are depicted next to the pyramids on camels. Seidelman cut this scene, saying that it was unnecessary and audiences at the test screenings thought the film should have already ended much earlier (as explained on the DVD). The science fiction film The Time Travelers (1964) is playing in scenes 6 and 23 (melts at the movie's ending). All the scenes featuring Dez working as a projectionist were filmed at Bleecker Street Cinema. The scene with Roberta and Gary in their kitchen shows Roberta watching Alfred Hitchcock's Rebecca (1940). The interior and exterior shots of The Magic Club were filmed at the Audubon Ballroom in Washington Heights. Some scenes were filmed at Danceteria, a club that Madonna frequented and which gave her a start in the music business. Separated-at-birth triplets Robert Shafran, Eddy Galland and David Kellman have a cameo role, reportedly at Madonna's personal invitation.\nSoundtrack\n\" on 2023-2024's the Celebration Tour. It reached the number-one in various territories, including a number of European countries.]]\nThe soundtrack, composed by Thomas Newman, was released on both vinyl and CD together with the soundtrack to another Seidelman film, Making Mr. Right. The soundtrack does not feature any of the other songs in the film. The film captures the feel of the underground Bohemian/new wave scene of the early to mid-1980s New York City, a scene that helped Madonna get her big break in the music business.\nMadonna recorded a song for the movie, titled \"Desperately Seeking Susan\". It ended up not being used in the film, and a demo she had just finished, \"Into the Groove\", was used instead. Only the demo version can be heard in the movie. The song was a huge commercial success. In some territories, it was included on a 1985 reissue of Like a Virgin, but in the United States it was only released as a double A-side 12″ single with \"Angel\". The song's music video consists of clips from the film, edited by Doug Dowdle of Parallax Productions.\nReception\nBox office\nThe film had a limited release on March 29 before its official wide release on April 12, 1985, in the United States, and grossed $1,526,098 in its first weekend. It was a commercial success of its time, making $27,398,584 in the United States. The film was released on September 6, 1985 in the United Kingdom, and grossed £1,175,133 in its first weekend. Its total gross in the United Kingdom was £2,331,907. It also became the most successful Orion Pictures film in Europe at that point.\nCritical reception\nDesperately Seeking Susan was praised by critics. }} On Metacritic it has a score of 71% based on reviews from 16 critics, indicating \"generally favorable\" reviews. Roger Ebert of The Chicago Sun Times gave the film three stars out of a possible four, saying it was essentially a screwball comedy, which \"bopped around New York, introducing us to unforgettable characters\".\nBoth Rosanna Arquette and Madonna received generally high critical acclaim for their portrayal of Roberta and Susan respectively. In Costume and Cinema (2001), professor of film studies, Sarah Street considered Madonna's role as Susan as arguably her \"best film performance\". In similar remarks, film critics like James Monaco deemed it as \"Madonna's best role\", playing a character \"loosely based on herself\". In her review for The New Yorker, critic Pauline Kael referred to Madonna as \"an indolent, trampy goddess.\"\nAccolades\n{|class=\"wikitable\"\n|-\n! Award\n! Year\n! Category\n! Recipient\n! Result\n|-\n| British Academy Film Awards\n| 1986\n| Best Actress in a Supporting Role\n| Rosanna Arquette\n|\n|-\n| Casting Society of America\n| 1986\n| Artios Award for Outstanding Achievement in Casting – Big Budget Feature (Comedy)\n| Desperately Seeking Susan\n|\n|-\n| César Awards\n| 1985\n| Best Foreign Film\n| Desperately Seeking Susan\n|\n|-\n| Golden Globes\n| 1985\n| Best Actress in a Comedy or Musical\n| Rosanna Arquette\n|\n|-\n| National Film Registry\n| 2023\n| Preservation\n| Desperately Seeking Susan\n|\n|-\n| Norwegian International Film Festival\n| 1985\n| Spreader of Joy\n| Desperately Seeking Susan\n|\n|-\n| Record Mirror Readers Poll Awards\n| 1985\n| Most Riveting Film\n| Desperately Seeking Susan/Madonna\n|\n|}\nSome critics labeled Desperately Seeking Susan one of the best US films of the year, and eventually, the decade. The New York Times film critic Vincent Canby included the movie among the 10 best films of 1985, while the New York Post called it \"the most entertaining new movie of the year\". In 2022, Rolling Stone ranked the film among their 100 Greatest Movies of the 1980s, calling it \"a classic of its particular era\". In 2011, NME also ranked the film as one of the 25 Greatest '80s Movies. Time Out ranked it as one of the 100 Best Feminist Films of All Time in 2022. Susan was selected in the Directors' Fortnight at the Cannes Film Festival of 1985.\nHome media\nLess than five months after its theatrical release, in July 1985 media outlets started to announce the home video release by Thorn EMI/HBO Video to be scheduled in late August of that year. It was released on VHS, HiFi, and Beta at a retail price for $79.95.\nCommercially, the film debuted at number 9 on Billboards Top Videocassettes sales and peaked at number 5 on the issue dated November 2, 1985. In the video rental charts, the film debuted at number 7 and climbed to the first-position on the issued dated September 28, 1985. It also debuted and peaked at number 10 in the Billboards videodisc charts on March 8, 1986. The release ended at the 35-position in the Top Videocassettes Sales and the 29-position in the Top Videocassettes Rentals of 1985.\nIn January 1986, the film was certified Gold by the International Tape/Disc Association, denoting 75,000 copies or sales totaling $3 million at retail. It also earned a Platinum certification in the United States by the Recording Industry Association of America (RIAA). As of 1992, Desperately Seeking Susan sold 150,000 home videos in the US according to The Hollywood Reporter.\nThe film was released on DVD in 2000, and on Blu-ray by Kino Lorber on October 14, 2014.\nLegacy\nof Ireland. Her early style was an inspiration for the movie's costumery.]]\nUpon release, the film developed cult status in some audiences, with Hadley Freeman from The Guardian referring to the movie as an \"80s cult classic\". It also impacted the fashion of teenage girls, and scholars in film studies, including Sarah Street had used the film as an example of connections between fashion and cinema industries. Tracey Lomrantz Lester from Glamour slightly referred to the movie as one of the best fashion films of the era, while Derek Blasberg picked it as his favorite film that best embodied the 1980s fashion. Movie's costume designer, Santo Loquasto reportedly sought inspiration for Susan's wardrobe in Madonna's own closet. In 2019, Laird Borrelli-Persson from Vogue stated, \"fashion's so corporate these days, Desperately Seeking Susan reminds us that clothing is a personal signifier of identity connected to place and time.\" The style influenced other figures at some stage, like South African performer PJ Powers. In 2014, the jacket worn by Madonna with a pyramid at its center, fetched $252,000 in an auction.\nWriting for Washington Post in 1985, Paul Attanasio considered the film as \"the first big yuppie movie of the '80s\", and further explains that yuppies are \"the first generation to grow up exclusively on mass-marketed culture\". In 2017, Ben Reardon from Vice commented: \"Desperately Seeking Susan defined the times and withstands performance after performance, and has been referenced, riffed on and re-rubbed by every designer and wannabe star till Doomsday.\" Kirk Ellis, from The Hollywood Reporter, said the movie \"could well usher in a whole new subgenre: New Wave screwball comedy\". The movie also has been noted as a \"cult feminist classic\". In 2022, Garin Pirnia from Mental Floss considered the film \"still packs a powerful feminist punch\". He also said, at the time, and even somewhat by today's standards Desperately Seeking Susan \"was revolutionary in that it featured two female leads and was written, produced, and directed by women\".\nMadonna's popularity caused the film to be perceived as a \"Madonna movie\" by critics, a label that even Rosanna Arquette followed. Although Madonna was not billed as the lead actress, her character became a \"film's pivotal plot point\", contributing \"significantly to its film success\". Author Alicia Malone and The Guardians Arwa Mahdawi, also said film director Susan Seidelman is probably best known for this film. With Mahdawi saying \"You couldn't have a film season about New York in the 70s and 80s without including Seidelman's work\". Associate professor Diane Pecknold in American Icons (2006) believes the film produced a new idiomatic phrase considering the newspapers headlines with the phrase Desperately Seeking [...]. In 2023, the Library of Congress deemed the film \"culturally, historically, or aesthetically significant\" and selected it for preservation in the National Film Registry.\nIn October 2025, the film was screened as 'A Tribute to Susan Seidelman' at the 20th Rome Film Festival.\nStage musical\nThe film was developed into a stage musical that premiered at London's Novello Theatre on November 15, 2007, following previews from October 16, 2007. It features music and lyrics by Blondie and Deborah Harry, including a new song written especially for the show. The production was directed by Angus Jackson, with book and concept by Peter Michael Marino and sets and costumes by Tim Hatley. Produced by Susan Gallin, Ron Kastner, Mark Rubinstein and Old Vic productions, the musical starred Emma Williams as Susan, Kelly Price as Roberta, and Steven Houghton as Alex. Marino presented his solo comedy Desperately Seeking the Exit, which is based on his experiences, at the 2012 Edinburgh Festival Fringe.\nSee also\n* List of American films of 1985\n* After Hours - 1985 black comedy thriller film with a similar theme, also starring Arquette\n* Something Wild - 1986 comedy thriller film with a similar theme\n* ''Who's That Girl'' - 1987 screwball comedy film with a similar theme, also starring Madonna\nReferences\nBook sources\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\nExternal links\n*\n*\n*\n*\n* [https://web.archive.org/web/20070818034902/http://www.seeking-susan.co.uk/ Desperately Seeking Susan – The Musical]"
    }
  ]
}