{
  "content": [
    {
      "type": "text",
      "text": "# Destiny of an Emperor__disambig_1\n\n| genre = Tactical role-playing\n| modes = Single-player\n| platforms = Nintendo Entertainment System\n}}\nDestiny of an Emperor, known in Japan as  is a tactical role-playing video game developed and published by Capcom for the Nintendo Entertainment System. It is based on the Tenchi wo Kurau manga by Hiroshi Motomiya. It was originally released in Japan in 1989, with an English language localization released for the North American market in 1990.\nStory\nLiu Bei, Zhang Fei, and Guan Yu form a small militia to defend their village from Yellow Turban rebels, followers of the sorcerer Zhang Jiao. Liu Bei gathers peasants and farmers from nearby villages and camps, eventually defeating Zhang Jiao and his people. Tao Qian, the governor of Xu Province, falls ill and requests that Liu Bei assume his position. Liu Bei hesitantly agrees, thus beginning the events depicted in the novel, albeit with significant alterations. Upon successfully completing the game, the player successfully unites China under the Shu Han banner.\nAlthough the game loosely follows the events portrayed in Romance of the Three Kingdoms, in many cases, the outcome is altered in Liu Bei's favor against the various other warlords of the period. Most of the deviations occur later in the game, particularly involving the invasions of the other ruling powers, the Kingdom of Sun Wu and the Kingdom of Cao Wei.\nThe branching storyline allows the player the option of choosing alternate paths, which generally do not affect the plot in any significant manner.\nGameplay\nUnlike virtually every other RPG released at the time or since, the non-boss battles of Destiny of an Emperor do not consist solely of encounters with generic units. While generic enemy units do appear in the game, most random battles are fought against one or more generals randomly selected from those roaming the lands the player's party is traveling through at the time. Additionally, most of these unique units can be recruited. After being defeated in battle, there is a random chance that the general will offer to join the party, usually under the condition that the player character pays him a bribe of either money or horses (which can be purchased at item shops). Once recruited, the general will no longer be encountered in random battles.\nBecause of this system, the game has an exceptionally large number of playable characters, 150 in all, although many of these characters do not increase in power even when they accumulate experience points, making them useful only for a limited time. Also, the player may only have up to 70 characters in his party. After reaching this limit, the player can only recruit new characters if he ejects characters from his party to free up the slots. After being removed from the party, generals are again the player's enemies and can once more be encountered in random battles.\nThe player's active party consists of up to seven members, five of which can actively participate in combat at any single time, one who serves as a replacement for characters killed in combat, and one to serve as both a reinforcement member and party tactician. The tactician provides magic-like effects, which all members involved in combat are able to use.\nIn addition to standard attack and tactics options available in most games of the type, there is an option called \"All-Out\". When chosen, the computer AI takes control of the battle, which proceeds at an extremely fast rate. This is solely a way of speeding up the easier battles and has no tactical advantage, as the player is unable to coordinate attacks or employ tactics, while the AI-controlled enemy can.\nRelease\nDestiny of an Emperor is based on Hiroshi Motomiya's manga, Tenchi wo Kurau, which follows the story of Chinese historical figure Liu Bei and his sworn brothers, Zhang Fei and Guan Yu. This story is loosely based upon the events in the 14th-century historical novel Romance of the Three Kingdoms by Luo Guanzhong, which itself was based on historical events and battles which occurred before and during the Three Kingdoms period of ancient China. Destiny of an Emperor was included in the \"Nintendo Classic Mini: Family Computer Weekly Shonen Jump 50th Anniversary Commemoration Version\", a console created to commemorate the 50th anniversary of the weekly Japanese manga magazine Shōnen Jump.\nA sequel to Destiny of an Emperor, Tenchi wo Kurau II: Shokatsu Kōmei Den, was released exclusively for the Japanese Family Computer.\nReception\nJeremy Parish praised it as \"interesting\" and \"adorable\", suggesting people check it out while noting that it is not an \"oft-mentioned classic\". 9dragons of RPGamer discussed how the game was fun, but the story did not interest them when they were younger. When they tried the game at a later age, they felt more invested in the game, now knowing that it is based on historical events, which made them feel like they were \"living the history\". Ethan Gach of Kotaku expressed hope that Destiny of an Emperor would be released for the Nintendo Switch's NES library. Joshua Jankiewicz of Hardcore Gaming 101 felt it odd that it was released in the United States due to the reticence of publishers to release role-playing games, particularly those with \"Eastern\" themes, in the United States. They lamented the lack of press coverage at the time for the game, praising it for being challenging without being unfair in a way that other games often fail to do. They also praised the auto-battle function, feeling it a good way to keep battles with weaker enemies from feeling tedious. They however found the exploration limited and monotonous and felt that problems with the game, such as money and food being too abundant and the high number of characters being useless due to the proficiency of the five main characters, pop up in the latter part of it. Despite this, they felt these flaws were not significant due to it being Capcom's first attempt at a role-playing game. Author Andy Slaven felt it was \"all too often overlooked\", calling its gameplay unique, challenging, and fun.\nIn 2007, a hacking tool was created called Destiny of an Editor. This tool was originally meant to alter stats, but over time gained additional functionality, including the ability to edit maps, text, enemy encounters, and graphics. The hacking community went on to create the Huan Ho awards, celebrating the best Destiny of an Emperor hacks.\nSee also\n* Tenchi wo Kurau II: Shokatsu Kōmei Den\nNotes\nReferences\nExternal links\n* [http://www.gamefaqs.com/nes/563402-destiny-of-an-emperor/data Destiny of an Emperor at GameFAQs]"
    }
  ]
}