{
  "content": [
    {
      "type": "text",
      "text": "# Deva dynasty (Saketa)\n\n, 1st century BCE.]]\nThe Deva dynasty of Saketa, was a dynasty of kings who ruled in the area of the city of Ayodhya, Kosala, in India from the 2nd century BCE until the end of 1st century BCE.\nPolitical history\nFive Deva kings are attested by their coins: Mula-deva, Vayu-deva, Vishakha-deva, Patha-deva, and Dhana-deva. Another king - Phalgudeva - is attested by the 1st century BCE Ayodhya inscription of his son Dhanadeva.\nAfter the decline of the Maurya Empire, Saketa (modern Ayodhya) appears to have come under the rule of the Shunga ruler Pushyamitra. One interpretation of Dhanadeva's inscription suggests that Pushyamitra appointed a Deva king as a governor at Saketa. This would mean that the Devas ruled as Shunga vassals. However, another interpretation suggests that the Devas ruled as sovereigns and considered themselves as legitimate heirs of the Shungas.\nThe Yuga Purana mentions Saketa as the residence of a governor, and describes it as being attacked by a combined force of Greeks, Mathuras, and Panchalas. Patanjali's commentary on Panini also refers to the Greek siege of Saketa. The Yuga Purana states that Saketa was ruled by seven powerful kings after the retreat of the Greeks. The Vayu Purana and the Brahmanda Purana also state that seven powerful kings ruled in the capital of Kosala. These kings appear to be same as the Deva kings: Dhanadeva's is described as the king of Kosala (Kosaladhipati) in his inscription.\nAlthough the texts mention seven powerful kings of Kosala, only six Deva kings are known from coins and an inscription. Indologist Hans T. Bakker speculates that Mitra-deva, who is mentioned in the 7th century text Harshacharita, may have been the seventh Deva king. Mitra-deva is said to have killed Sumitra (that is, the Shunga king Vasumitra). If Bakker's identification is correct, it appears that the Deva kings rebelled against their Shunga overlords. However, several kings, whose names ended in -deva, ruled various parts of India, so this identification is not certain. Moreover, some manuscripts of Harshacharita mention the king's name as Muladeva.\nThe Deva dynasty was replaced by the Datta dynasty at the end of the 1st century BCE, which itself was replaced by the Mitra dynasty in the 1st and 2nd centuries CE, which also ruled in Mathura. It is thought that the Indo-Scythian Northern Satraps ultimately replaced these local kings, until the advent of the Kushan Empire.\nRulers\nBased on the identification of Mitradeva as a Deva king, Hans T. Bakker provides the following list of Deva kings:\n# Muladeva (possibly a vassal of Pushyamitra at Saketa)\n# Mitradeva (contemporary of Vasumitra)\n# Vayu-deva\n# Patha-deva\n# Phalgudeva\n# Dhanadeva\n# Vishakhadeva\nReferences\nBibliography\n*\n*\n*\n*"
    }
  ]
}