{
  "content": [
    {
      "type": "text",
      "text": "# Devil's Path (hiking trail)\n\ngain approximately\n|highest_name=West Kill Mountain\n|highest_ft=3880\n|lowest_name=Stony Clove Notch\n|lowest_ft=2220\n|difficulty=Strenuous\n|season=all\n|sights=Northern Catskill Mountains\n|hazards=Steep, precarious climbs\n}}\nThe '''Devil's Path'''  is a hiking trail in the Greene County section of the Catskill Mountains of New York, sometimes described as one of the more challenging trails in the New York Tri-state area. It goes across the eponymous mountain range and then three other peaks to the west, offering hikers and peakbaggers a chance to reach the summits of five of the 35 Catskill High Peaks (two more are reachable by detours). It draws hikers from not just the region but far outside, due to the challenging climbs straight up and down the steep gaps between the four peaks of the range, which often require hikers to use hands as well as feet to pull themselves almost straight up cliffs and through rocky chutes. These climbs, however, lead to views across the Catskill range.\nMost hikers use the trail for day trips to one or two summits along the range, via the trails that go up into the cols. But backpackers have done weekend trips due to the easy availability of a state-owned campground at Devil's Tombstone, near the single road crossing at Stony Clove Notch. It is also possible for determined hikers to complete the entire trail in a single, long day.\nThe portion of the trail from Plateau Mountain to just east of Indian Head Mountain is currently part of the Long Path. Most of it is on state-owned Forest Preserve land in New York's Catskill Park. Most of it lies within two New York State Department of Environmental Conservation management units, the Indian Head Wilderness Area east of Stony Clove Notch and (currently) the Hunter Mountain Wild Forest from there to Diamond Notch, then the West Kill Wilderness Area.\nHistory\nWhile some of the peaks east of Stony Clove Notch had been climbed for quite some time, according to Catskill forest historian Michael Kudish, the modern Devil's Path was first cut from the Old Overlook Road to Mink Hollow in 1929, shortly after the state acquired the property. Plateau followed in 1934 after that purchase was made, and the following year the route up Hunter from the notch was opened.\nHowever, for several decades afterward there was no new construction. In 1973, the state finally opened the route down to the falls, and the final section over West Kill came shortly thereafter. Despite an original idea to continue the trail on over North Dome Mountain and Mount Sherrill to the west that led to a sign (still in existence) erected at the proposed junction site, those two peaks remain trailless today. There have been some proposals within NYSDEC of building a modified extension but it does not appear likely to happen at this point.\nDescription\nThe Devil's Path has a single road crossing, NY 214 at Stony Clove Notch. This is often used to divide the eastern half of the trail, the one that gives it its reputation, from the more remote but less challenging western half. It is blazed with NYSDEC red plastic discs throughout.\nWhen hiked in this direction, the mountain summits get higher as the gaps between them get lower.\nEastern section\nThis is the \"classic\" Devil's Path. It features four major summits, with the trail going straight up and down the fall line into the gaps between, with all the rugged terrain that implies.\nSchoharie headwaters\nOfficially, the blazing starts at the junction of Prediger Road near Elka Park in the Hunter, New York. The eastern trailhead is located at the end of Prediger. It is often reached via the steep drive up nearby Platte Clove Road except during winter, when the road is closed.\nJust after its start, the trail crosses an unnamed tributary of Schoharie Creek and then turns south, crossing the state-land boundary after a short distance. At  from the start, the blue-blazed Jimmy Dolan Notch Trail leaves and crosses over the Schoharie. It offers a shorter route to the eponymous feature for those planning to skip Indian Head Mountain, the first peak on the trail's itinerary.\nThe Devil's Path itself remains level, trending eastward for the next  past the source of the Schoharie to a junction with the Old Overlook Road which once connected Platte Clove Road and Overlook Mountain to the south. Today the portion joining the trail is part of the Long Path, leading down through the Catskill Center for Conservation and Development's Platte Clove Preserve. Shortly after this junction, the Devil's Path leaves the road and begins to climb Indian Head.\nIndian Head\nThe ascent is steep for the next , finally reaching a lookout to the north on the mountain's east slope. Kaaterskill High Peak predominates from here. The trail then runs around through an increasingly boreal forest to the mountain's north slope, where a view cut (somewhat controversially) by DEC in the past offers a preview of later, more expansive vistas to the south. After a half-mile (1&nbsp;km), the trail reaches a section where roots form a sort of ladder up a steep rock face. Just past it is a ledge with a wide view over the Hudson River and points east.\nIt is another half-mile from here to the summit, across mostly level stretches of trail save another steep cliff at 3,500 feet (1,067 m) in elevation (where special DEC regulations banning fires and camping except during winter take effect). An overhanging tree formerly provided the only way to get up a narrow cleft in the rock here until July 2013 when it collapsed.  Hikers must now edge their way underneath the trunk to get to the cleft and use handholds to climb up without a pack through the narrow opening. The mountain's 3,573-foot (1,089 m) summit is unremarkable after all this, with a sudden drop the only indicator it has been reached.\nThe actual summit is just off the trail, with a limited view available to the west. From here it drops down another half-mile into 3,200-foot (975 m) Jimmy Dolan Notch, the highest col on the trail, passing a few switchbacks and chutes along the way. The trail of the same name returns here.\nA portion of the view from Twin's southern summit.\nTwin\nThe trail starts climbing again almost right out of the notch, alternating between challenging ledge scrambles (although not as serious as the ones on Indian Head) and level sections over the next 0.4 mile (640 m). These take over shortly after the  contour is crossed again, and the mountain's southern summit offers a sweeping panorama of the Catskills that has been considered by many to be one of the best views in the region. Slide Mountain and all the major peaks around it are visible across the flat valley of Esopus Creek and Ashokan Reservoir in central Ulster County. Close up loom Twin's true northern summit and Sugarloaf Mountain.\nAnother half-mile and a gentle descent into the col followed by a slightly steeper ascent separates the south summit from Twin's true, 3,640-foot (1,109 m) summit. The view just past it is not quite so sweeping, but also takes in Hunter Mountain, the Catskill's second highest peak, to the west.\nNarrow passage through rock cleft on Twin.\nThe trail then descends  down through switchbacks, rock chutes and some more scrambles to Pecoy Notch, about 2,900 feet (884 m) above sea level. There are some views available to the north in the lower reaches. At the notch, another trail runs north about  to the nearby community of Elka Park.\nSugarloaf\nAfter a short level stretch, the climbing resumes. The eastern slope of Sugarloaf is similar to its counterpart at Twin, except it offers more chutes to surpass and climb, plus some sections where the trail passes narrowly between large rock outcrops. There are some good views back toward Twin where damage caused by past landslides is apparent.\nThe trail becomes more and more level after the  marker is reached. But the 3,800-foot (1,158 m) summit is still some distance off,  from Pecoy Notch, and the elevation gain to reach it comes in extremely small steps up. Only when the trail starts to slope down and side trails lead off to views similar to those available from Twin is it apparent the climb has been successful.\nIn the next mile (1.6&nbsp;km), the trail descends 1,600 vertical feet (488 m) to Mink Hollow. The rock chutes here are some of the most challenging on the entire Devil's Path, and they have led to the nickname \"Suicide Mountain\" by those using it as a route up in winter.\nShortly before Mink Hollow, a new routing of the trail of the same name comes in from the north, another route off the range if needed or desired. At the col, the Mink Hollow Trail follows an old road south to a lean-to and trailhead near Lake Hill.\nPlateau\nIt is yet another steep and rocky climb up the eastern slope of Plateau Mountain. A good spring can be found about a quarter-mile from the hollow (headed up the mountain), and the 3,855-foot (1,175 m) summit itself is just off-trail  later. The newly rerouted Long Path also comes in from the South on Plateau.\nTrail across Plateau, in winter.\nThe ensuing walk across the aptly named Plateau is seen as another attraction of the trail. While there are no views, the  are the longest high-elevation level walk in the Catskills, surrounded entirely by boreal forest, with only 200 feet (62 m) of elevation loss (or gain) along the way. It comes to an end shortly after Danny's Lookout to the northeast, at Orchard (sometimes Orchid) Point. Here Hunter, Southwest Hunter Mountain and West Kill Mountain loom ahead, across the depth of Stony Clove Notch.\nAgain the trail descends steeply and drastically, 1,400 feet (427 m) into the notch. Here, the trail crosses Route 214 and there is a parking lot and picnic area overlooking a small green lake. There is a water spout in the picnic area, but it seems water does not always flow from it. In season, the state charges a fee for use of the parking lot at the trail crossing. The neighboring campground is a short walk south along Route 214.\nWestern section\nThis section is less popular for day hikes since it does not offer easy access from cols, and less of the rocky, steep terrain found to the east. It only goes over the summit of one mountain, and avoids that of Hunter. However, there are still a few attractions.\nHunter\nAfter crossing just below the outlet of Notch Pond, the trail shortly begins to climb and switchback, passing a massive pair of stone outcrops known as the Devil's Portal. Above, the trail follows an old wood road into an area where a few hemlocks remain from tannin-seeking loggers in the late 19th century. Some spruce may be found along here, too.\nLeaving the old road shortly before it dead-ends, the trail goes through a slightly more level area where hungry hikers can snack on wild blackberries and raspberries in season, then levels out just below , in an area where paper birch, red spruce and fern make up the forest ... a sign of the heavy logging of this area a century ago by the West Virginia-based Fenwick Lumber Company.\nAt , from the notch, it reaches Devil's Acre, the low point between Hunter and trailless Southwest Hunter. It begins with the junction with the yellow-blazed Hunter Mountain Trail, which leads uphill (approximately  elevation, 1.6 miles) to Hunter's summit and its fire tower. Shortly after the junction is the Devil's Acre Lean-To. Past the lean-to is a fairly wet area, a result of all the past logging, then the trail begins to descend. A small cairn on the left side of the trail marks the beginning of the old narrow-gauge railbed used by most hikers to reach the elusive summit of Southwest Hunter.\nAfter going through another level area a half-mile long with impressive rock outcrops to one side, the Devil's Path reaches another superb viewpoint over the cirque that gives rise to the West Kill. Southwest Hunter's ridgeline can be previewed by those heading in that direction, and across Diamond Notch rises West Kill itself. Remnants of camping can sometimes be found here although it is not permitted.\nThe trail then begins a long, leisurely but steady  descent down the south side of Hunter Mountain to the junction with the blue-blazed Diamond Notch Trail at a bridge over a waterfall on the West Kill known variously as West Kill Falls or Diamond Notch Falls. The latter trail can be followed  to the parking lot at the end of Spruceton Road (Greene County Route 7).\nWest Kill\nThe newest (it was cut in 1969) and least-hiked portion of the Devil's Path begins just past the West Kill. The trail branches off to follow the water for a few hundred feet, then slowly begins traversing up the huge mountain, the sixth-highest in the Catskills. A good spring is found to the side of the trail  from the ford. Afterwards, it levels off for a while, then begins attacking the mountain more directly, requiring once again the use of hands through some steep chutes. The woods aside the trail become more and more boreal, and at about 3,400 feet (1,036 m), it levels off again. Another  from the spring, there is a large rock overhang, an excellent place to camp just below the  marker, where camping is prohibited for most of the year.\nand ski trails at Hunter Mountain from Buck Ridge in autumn|alt=A landscape of forested mountains, in autumn color, underneath a blue sky, dominated by three rounded peaks in the distance with dark tops]]\nThe trail remains level through the boreal woods, then begins to climb seriously to Buck Ridge Lookout, another  from the cave. This sweeping view takes in primarily Hunter and Southwest Hunter, but also offers a good view down Ox Clove towards the Lanesville area and the lesser peaks behind it. Southern peaks such as Slide and Peekamoose are also visible. A short path through the woods leads to another, smaller overlook north taking in Rusk Mountain.\nA short distance (0.1 mile, 60 m) past the lookout is the 3,880-foot (1,183 m) summit of West Kill itself, the only summit in the Catskills marked by an official sign to that effect. There is no view. The trail begins to descend shortly afterwards, past an unreliable spring.\nThe remainder of the Devil's Path receives less foot traffic than the other sections and is as a result sometimes inadequately maintained. Dropping off the summit cone relatively quickly, it then descends very gently to about 3,300 feet (1,005 m) over the next two miles (3.2&nbsp;km) and then, after a small creek that can supply water in all but the driest times, abruptly begins to climb up a rocky chute, then some minor ledges, to the 3,420-foot (1,042 m) summit known as either West West Kill or St. Anne's Peak. It goes right over it, but there are no real views except when the leaves are down.\nFrom there the trail goes down along a series of long, switched-back traverses  to its second Mink Hollow, a swampy area between West West Kill and North Dome Mountain. A DEC sign there gives mileage in both directions despite the lack of a junction — a legacy of a plan to later extend the Devil's Path over North Dome and Mount Sherrill. After this, the trail travels due north past the outlet stream from the swampy col through a state-land corridor of tall, old-growth trees, lush fern beds and fields of glacial erratics to some old-growth hemlocks and, finally, its western end at Spruceton Road  later.\nCommon day trips\nMany common hiking routes, particularly those made by aspiring members of the Catskill Mountain 3500 Club, use part of the Devil's Path and its connecting peaks. Many combinations are possible.\n*Loop over Indian Head using the Jimmy Dolan Notch Trail.\n*Climb of Indian Head, Twin or both via the JDNT.\n*Climb of Twin, Sugarloaf or both using the Roaring Kill and Pecoy Notch trails.\n*Loop over Sugarloaf using the Roaring Kill, Pecoy Notch and Mink Hollow trails (this has become much more common since both of the latter two were rerouted to connect with the newly built third in 1999).\n*Climb of Sugarloaf, Plateau or both via the Mink Hollow Trail (less common since the shorter, northern stretch of the Mink Hollow Trail was abandoned)\n*Shuttle hike of Plateau with Mink Hollow Trail.\n*Climb of Hunter from Stony Clove Notch, with Hunter Mountain Trail\n*Loop over Hunter from Diamond Notch via Spruceton and Hunter Mountain trails. May also include a bushwhack to Southwest Hunter.\n*Shuttle hike over West Kill from Diamond Notch to Spruceton trailhead.\nFurther reading\n*\n*\nReferences\nExternal links\n*[https://mountain-hiking.com/devils-path/ Devil's Path Trail Guide] at Mountain-Hiking.com.\n*[https://mountain-hiking.com/eastern-devils-path/ Eastern Devil’s Path] at Mountain-Hiking.com.\n*[https://www.catskill3500club.org/peaks Information on Hiking the Catskill High Peaks] at Catskill 3500 Club\n*[http://www.trimbleoutdoors.com/ViewTrip.aspx?tripID=8836&mode=TripDetails Description] at Jon Trimble Outdoors."
    }
  ]
}