{
  "content": [
    {
      "type": "text",
      "text": "# Dhofar rebellion__disambig_1\n\n– 9 May 1979()\n| place             = Dhofar\n| casus             =\n| territory         =\n| result            = Omani-British-Iranian victory\n| combatant1        =  Omani opposition groups:}}\n| Popular Front for the Liberation of the Occupied Arabian Gulf\n| Popular Front for the Liberation of Oman\n}}\n|Minor involvement:\n||National Democratic Front for the Liberation of Oman and the Arabian Gulf }}\n| combatant2        =  Al Bu Said dynasty}}\n|\n}}\n|\n|Minor involvement:\n|\n}}\n| commander1        =\n| commander2        =\n| strength1         =  5,000–6,000\n| strength2         =\n*  10,000\n*  4,000\n*  1000\n**  500\n**  500\n*  800\n| casualties1       =\n* Per Iran: 3,400\n** 1,400 killed\n** 2,000 captured\n| casualties2       =\n*  746\n** 187 killed\n** 559 wounded\n*  2,123\n** 719 killed\n** 1,404 wounded\n*  79\n** 24 killed\n** 55 wounded\n| casualties3       = 10,000 total killed\n| campaignbox       =\n| image_size        = 290px\n| units1            =\n*  Popular Militia\n*  People's Liberation Army\n** Eastern Sector (Lenin Unit)\n*** Al-Shaheed Madrum\n*** Al-Shuhadaa\n*** Firqat al-'Amal\n*** Mobile Unit\n** Central Sector\n*** Guevara\n*** Tarish\n** Ho Chi Minh Sector (Al Mamar)\n*** Al-'Ula\n*** Al-Shaheed Mohammad Mussalam\n*** Al-Firqa Al-Thalitha\n** Western Sector\n*** Al-Shaheed Saif\n*** Al-Shaheed Ahmad Aradha\n*** Stalin\n* People's Defense Forces\n**People's Army\n**People's Air Force\n**People's Navy\n**People's Militia\n| units2            =\n*  Sultan of Oman's Armed Forces\n**\n*** Northern Frontier Regiment\n*** Muscat Regiment\n*** Jebel Regiment\n**\n**\n* British Armed Forces\n**\n***  Special Air Service\n**\n**\n}}\nThe Dhofar rebellion,}} also known as the Dhofar War, or the 9 June revolution,}} was a revolution that began in 1965 in the Dhofar region of the Arabian Peninsula against the Al Bu Said dynasty and the British presence in Oman. The conflict began with the formation of the Dhofar Liberation Front, a Marxist–Leninist group which aimed to create a people's democratic state in the Persian Gulf region. The rebels also held the broader goals of Arab nationalism, which included ending British influence in the region. Omani and British goals, on the other hand, were to halt \"the spread of communism\" as part of the broader Cold War.\nThe war initially took the form of a low-level insurgency, with guerrilla warfare being used against Omani forces and the foreign presence in the country. Several factors, such as the British withdrawal from Aden and support from the newly independent South Yemen, China, and the Soviet Union, brought the rebels increased success, with the communists controlling the entirety of the region by the late 1960s.\nThe 1970 Omani coup d'état led to the overthrow of Sultan Said bin Taimur by his reformist son Qaboos bin Said, who was backed by a major British military intervention in the conflict. The British initiated a \"hearts and minds\" campaign to counter the communist rebels and began the process of modernising the Sultan of Oman's Armed Forces (SAF) while simultaneously deploying the Special Air Service (SAS) to conduct anti-insurgency operations against the rebels. This approach led to a string of victories against the rebels and was boosted by the Shah of Iran's intervention in the conflict to support the Sultanate of Oman in 1973.\nBackground\nDhofar is a geographic region that is located in eastern South Arabia. Its size is approximately , and consists of an intermittent narrow, fertile coastal plain, on which stand Salalah, its largest city, and other towns such as Taqah and Mirbat. It had a population of about 35,000. Behind this are the rugged hills of the Jebel Dhofar. The western portion of this range is known as Jebel Qamar, the central part as the Jebel Qara, and the eastern part as the Jebel Samhan.\nFrom June to September each year, the Jebel receives moisture-laden winds, the Khareef or monsoon, and is shrouded in cloud. The narrow 250-mile coastal plain benefits from the southwest monsoon from late May through September. As a result, the coastal plain and the seaward slopes of the 3,000-4,000-foot mountains are green and fertile. From the crest of the mountains. Numerous wadis run northward through a barren and arid landscape toward the sands of the Rub al Khali-the Empty Quarter.\nOman was a very underdeveloped country. Sultan Said bin Taimur, an absolute ruler under British influence, had outlawed almost all technological development and relied on British support to maintain the rudimentary functions of the state. Oman at the time was a de facto British colony. During his collaboration with the British empire, the sultan committed himself to maintaining an iron-fisted policy, slowing down the development of his country to the detriment of the Omani population, who lived in atrocious and unhealthy conditions. Fred Halliday described the Isolation of Oman, saying that \"If North Yemen was regarded as an isolated Arabian country, a Middle Eastern Tibet, Oman was so cut off from the outside world that no one even noticed it was isolated; until 1970 it was ultra-Tibet.\" Nadir bin Ali bin Faisal, undersecretary of foreign affairs at the time, wrote a book titled Sultan and Colonialism in which he stated that the sultan was nothing more than a British puppet without any authority.\nDhofar was independent for most of its history. It became a dependency of Oman in 1879 as part of the Anglo-Ottoman rivalry. Dhofar was culturally and linguistically distinct from the rest of Oman.\nThe roots of the insurgency lie in the long-standing demands by Dhofari traditionalists for separation from Oman. For centuries, the sultans of Oman have claimed authority in Dhofar, but the province has been plagued by almost constant dissidence and unrest, as Dhofaris have persistently resisted this outside rule. Separated from the more populous part of Oman by hundreds of miles of desert, Dhofar has been and is more closely linked religiously, tribally, economically, and linguistically to the Hadhramaut area of Yemen than to the rest of Oman.\nDhofaris, as well as other Omanis, became increasingly restive in the early 1960s as a result of the social and political restrictions imposed upon them by the reactionary and authoritarian Sultan Said bin Taimur. The discovery of oil in the sultanate in 1963 made a small difference to the Dhofaris; most of what little economic and social development was started by the government was undertaken in Oman itself. A growing number of Sultan Said's Dhofari subjects came to resent his neglect, maladministration, and heavy-handed eccentricities.\nThe rebellion is usually traced to an uprising in 1963 staged by members of the Bait Kathir tribe who had joined the Dhofar Benevolent Society, a religious and social welfare organization. This group was composed mostly of Dhofari nationalists, favoring secession; they were soon joined by members of the local branch of the leftist Arab Nationalist Movement and some Dhofaris returning from service in the British-sponsored Trucial Oman Scouts. The merger resulted in the creation of the Dhofar Liberation Front, which pledged to detach Dhofar from Oman by armed force. By 1964, Iraq may have been providing military training for a few rebels; by mid-1965, the front was receiving limited financial and military aid from Egypt and Iraq.\nRebellion\nEarly years\n|align=right|width=246px}}\nOn 9 June 1965, the Dhofar Liberation Front (DLF) conducted its first ambush on a government patrol north-west of the Thamrit road in Dhofar, where the DLF's first casualty, Said bin-Ghanim al-Kathiri, was killed. Following the military action, the DLF published its first document, titled the 9 June Declaration of Armed Struggle.\nThe revolt was initially small and limited for the most part to sporadic attacks on traffic along the mountain road linking Salalah and Thamarit. The Sultan took a complacent view of the rebellion, considering it little more than another expression of the tribal and religious enmity that had frequently plagued his regime. He preferred to keep his small British-led army near Muscat and ordered local security forces to deal with the rebels.\nThe Sultan had relied on the Dhofar Force, a locally recruited irregular unit of only 60 men, to maintain order in the region. In April 1966, members of this unit staged an assassination attempt against sultan Said bin Taimur. The event led the sultan to retire to his palace in Salalah, never to be seen in public again. This only served to add to rumours that the British were running Oman through a \"phantom\" Sultan. The Sultan also launched a full-scale military offensive against the DLF, contrary to the advice of his British advisors. Heavy-handed search and destroy missions were launched in Dhofar, villages were burned, and wells were concreted over or blown up. A member of the SAF reported that after receiving heavy resistance, it \"proved that the position was unattainable, and after blowing up the village wells, we evacuated the camp.\"\nRevolutionaries' left-wing shift\nIt was not long before the Dhofar Liberation Front began to move to the left. A left-wing faction, largely from the Al Qarra tribe, spoke of Arab unity, socialism, anti-colonialism, and a pan-Persian Gulf revolution, but the right-wing Bait Kathir tribal faction in the front remained primarily concerned with Dhofari separatism. The eventual triumph of the leftist element was ensured by events in neighboring South Yemen, where the National Front came to power in late 1967 after the British had withdrawn. The new regime in Aden became an active patron of the Dhofar Liberation Front, providing arms, money, an outlet for rebel publicity and propaganda, and a haven for the fighters. The Yemeni port of Hawf and the interior town of Habrut became important supply depots for materiel being passed to the insurgents. By mid-1968, the rebels were able to make daylight raids on Salalah and Mirbat, and by the end of the year, the rebels were fairly well-equipped and organized, and more aggressive.\nTwo congresses were held in 1965 and 1968 to define the movement's political objectives. The growing strength of the radical wing was reflected at the second congress, since described as a turning point in the rebellion, and was held in September 1968 at Hamrin. The Dhofar Liberation Front was renamed the Popular Front for the Liberation of the Occupied Arab Gulf, a 40-member General Command was elected to replace the old leaders, and a new statement of goals was promulgated. The new name signified the organization was no longer concentrating on Dhofari separatism, but was committed to a people's war throughout the Persian Gulf, which was described as \"a single historical, geographical, and ethnic entity.\" The Hamrin delegates adopted Marxism-Leninism as their ideology, intending to \"liberate all of the Gulf from British imperialism.\" Political scientist Fred Halliday reported during his visit to the area that \"wherever we went we saw people wearing Mao and Lenin badges, reading socialist works and discussing.\" Works included those of Lenin and the German playwright Bertolt Brecht. Palestinian voices were given significant space in Dhufari publications, with Palestinian revolutionary writers such as Sakher Habash contributing poems and essays expressing solidarity with Dhufar. The movement's two main periodicals, the weekly Sawt al-Thawra (\"Voice of the Revolution\") and the monthly 9 Yunyu (\"9 June\"), regularly featured writings and discussions on global revolutionary and tricontinental movements.\n]]\nThe program adopted at these two congresses was strongly tinged with communism. It aimed to establish a people's democratic republic and to expel the British army from Oman. The Front sought to establish a constitution, abolish martial law, restore freedom of the press and expression, and ensure the rights of minorities. On economic issues, it intended to nationalize the oil companies, develop industries, and implement land reform. The Front called for more social justice and affirmed its support for all Asian, African, and Latin American liberation movements. References were also made to the Palestinian struggle. The rebels opened schools to which both boys and girls had access (girls' education was forbidden in Oman until 1970). Tribalism was fought against, and social relations tended to evolve, with a specific place given to women, including in the armed struggle.\nThe move towards Marxism–Leninism ensured that the PFLOAG received sponsorship from both South Yemen and China. China in particular was quick to support the PFLOAG as it was a peasant-based organisation, giving it a strong Maoist credibility. Chinese support for the PFLOAG also had another benefit for them, as it acted as a counterbalance to increasing Soviet influence in the Indian Ocean. China was quick to establish an embassy in Aden and \"the Yemeni regime allowed its territory to be used for channelling weapons\" to the PFLOAG.\nFollowing the Hamrin conference, the front undertook new military initiatives in Dhofar, and the number of rebel attacks increased. By mid-1970, the rebels controlled the coastline from the Aden border to within a few miles of Salalah and held many coastal villages, such as Mirbat and Sadh, east of Salalah. They moved at will through the mountains and along numerous overland routes. The environs of Salalah were sporadically attacked. In pressing their drive, the rebels enjoyed certain advantages: a sanctuary across the Aden border; admirable guerrilla terrain in the mountains and wadis; and the sympathy and cooperation of a substantial proportion of Dhofaris. It is estimated that at one time, about two-thirds of the population supported the rebels. The front looked to civilians to supply informers, messengers, lookouts, and workers.\nThe transformation of the DLF, combined with a new supply of Chinese and Soviet weaponry and better training ensured that the armed wing of the PFLOAG turned into an effective fighting force. In May 1968, an attack by a battalion of the Sultan's Armed Forces against a rebel position at Deefa in the Jebel Qamar was defeated by heavily armed, well-organised, and trained rebels.\nHowever, the radicalisation of the rebel movement led to a split between those such as bin Nufl who were fighting mainly for local autonomy and recognition, and the more doctrinaire revolutionaries (led by Mohammad Ahmad al-Ghassani). One of bin Nufl's lieutenants, Said bin Gheer, was an early and influential defector to the Sultan. Nevertheless, by 1969, the DLF and PFLOAG fighters had overrun much of the Jebel Dhofar and cut the only road across it—that from Salalah to \"Midway\" (Thumrait) in the deserts to the north. They were known to the Sultan's Armed Forces as Adoo, Arabic for \"enemy\", or sometimes as \"the Front\", while they referred to themselves as the People's Liberation Army or PLA. They were well-armed with weapons such as the AK-47 assault rifle and SKS semi-automatic carbine. They also used heavy machine guns (the DShK), mortars up to 82mm in calibre and 140mm BM-14 or 122mm \"Katyusha\" rockets. By 1970, the revolutionaries controlled the entire Jebel. Terror was then used to break up the traditional tribal structure. Young men were sent to train for guerilla warfare in China, Russia and Iraq.\nBoth for ideological reasons and in an attempt to destroy existing patterns of leadership, the front made an effort to reorder society in the \"liberated\" areas. In particular, it undertook to eliminate the traditional tribal and kinship system of Dhofar, which it saw as irrelevant to the needs of the revolution. Front leaders have claimed \"dazzling success\" in replacing tribal relations with \"comrade relations.\"\nAlthough the front was committed to \"liberate\" all of the Gulf, the organization had yet to get off the ground outside of Dhofar. Most front organizers appeared to be primarily occupied with raising funds and with political indoctrination, rather than with armed subversion. The Dhofaris had little interest in fighting for anything but Dhofar. For instance, large numbers of Dhofaris living in Abu Dhabi who had been active in the Dhofar Liberation Front lost interest and stopped their financial contributions when the leftists took control.\nThe units of the Sultan's Armed Forces (SAF) were under strength, with only 1,000 men in Dhofar in 1968. They were also badly equipped, mainly with World War II vintage weapons such as bolt-action rifles, which were inferior to the PFLOAG's modern firearms. These rifles were replaced by the FN FAL only late in 1969. Even the SAF's clothing and boots were ragged and unsuitable for the terrain. The units of the SAF were generally not properly trained to face hardy guerrillas on their own ground. The position of Commander of the SAF was historically occupied by British officers in line with colonial traditions, until 1985 when an Omani was appointed for the first time. The SAF generally were unable to operate in less than company strength on the Jebel (making their operations clumsy and conspicuous), and were mainly restricted to Salalah and its immediate area. At various times, small detachments from Nos. 2 (Para), 15 (Field) and 51 (Field) squadrons of the British RAF Regiment, and other units (a Royal Artillery locating troop, a 5.5-inch medium battery of the Royal Jordanian Artillery, and a 25-pounder battery of the Sultan's artillery) had to be deployed to protect the vital airfield at Salalah from infiltrators and from harassing mortar and rocket fire.\nOther insurgents in the northern section of Oman formed a separate resistance movement, the National Democratic Front for the Liberation of Oman and the Arabian Gulf (NDFLOAG). In June 1970, they attacked two SAF posts at Nizwa and Izki. They were forced to retreat, but the incident convinced many, including the Sultan's British advisers and backers, that new leadership was required.\nIn January 1972, the PFLOAG announced that it had merged with NDFLOAG, which had been operating in northern Oman intermittently since early 1970. The new organization took as its name \"the Popular Front for the Liberation of Oman and the Arab Gulf.\" The merger probably grew out of a conference held in June 1971 in Rakhyut. It was decided at this meeting that a second front elsewhere in Oman was essential if the rebellion in Dhofar was to succeed.\nQaboos's coup\ngiving medical treatment to the villagers of the remote Yanqul Plain as part of their \"hearts and minds\" campaign.]]\nIn the 1970 Omani coup d'état on 23 July 1970, Said bin Taimur was deposed and went into exile in London. He was replaced by his son, Qaboos bin Said, who immediately instigated major social, educational and military reforms. Qaboos was well educated, first in Salalah and then at Sandhurst, after which he was commissioned into the Cameronians, a regiment of the British Army. He then completed his education with a three-month world tour, visiting various countries across Europe, Asia, and North America, excluding Arab nations, before undertaking a short course at the Royal Institute of Public Administration in Britain. Additionally, he participated in a special tour across England, Wales, and Scotland, where he visited political, cultural, and economic establishments, including government offices and political headquarters, before returning to Oman. His \"five-point plan\" involved:\n* A general amnesty to all those of his subjects who had opposed his father;\n* An end to the archaic status of Dhofar as the Sultan's private fief and its formal incorporation into Oman as the \"southern province\";\n* Effective military opposition to rebels who did not accept the offer of amnesty;\n* A vigorous nationwide programme of development;\n* Diplomatic initiatives with the aims of having Oman recognised as a genuine Arab state with its own legal form of government, and isolating the PDRY from receiving support from other Arab states.\nWithin hours of the coup, British Special Air Service (SAS) soldiers were flown into Oman to further bolster the counterinsurgency campaign. They identified four main strategies that would assist the fight against the PFLOAG:\n* Civil administration and a hearts and minds campaign;\n* Intelligence gathering and collation;\n* Veterinary assistance;\n* Medical assistance.\nThe military commanders on the ground (rather than the UK Ministry of Defence) suggested the implementation of a \"hearts and minds\" campaign, which would be put into operation primarily by a troop (25 men) from the SAS. The British government (then under Conservative leader Edward Heath) supported this unconventional approach to the counterinsurgency campaign. It approved the deployment of 20 personnel of the British Royal Engineers, who would aid in the construction of schools and health centres, and drill wells for the population of Dhofar. Royal Army Medical Corps Field Surgical Teams and some Royal Air Force medical teams would also operate out of Salalah hospital, to open a humanitarian front in the conflict. The British government additionally provided monetary support for the creation of the Dhofar Development Programme, whose aim was to wrest support from the PFLOAG through the modernisation of Dhofar. The operation was almost a carbon copy of a system that had proved successful in the Malayan Emergency some twenty years previously.\nTo assist in the civil development and coordinate it with the military operations, the command structure in Dhofar was reorganised, with the newly appointed Wāli or civilian governor (Braik bin Hamoud) being given equal status to the military commander of the Dhofar Brigade (Brigadier Jack Fletcher to 1972, Brigadier John Akehurst from that date).\nGovernment initiatives\n, famous SAS vehicle, as was used during the rebellion]]\nOne step that had a major impact on the uprising was the announcement of an amnesty for surrendered fighters and aid in defending their communities from rebels. A cash incentive was offered to rebels who changed sides, with a bonus if they brought their weapon. Following the split between the PFLOAG and DLF wings of the rebel movement, several prominent rebel leaders changed sides, including bin Nufl himself and his deputy, Salim Mubarak, who had commanded the eastern region.\nThe rebels who defected to the Sultan formed Firqat irregular units, trained by British Army Training Teams, or BATTs, from the Special Air Service. Salim Mubarak played a major role in establishing the first Firqat (and the only one to be formed from members of more than one tribe), but died, apparently of heart failure, shortly after its first successful actions. Eighteen Firqat units, numbering between 50 and 150 men each, were eventually formed. They usually gave themselves names with connections to Islam, such as the Firqat Salahadin or Firqat Khalid bin Walid. (Some of the PFLOAG units also gave themselves ideological names, such as Ho Chi Minh or Che Guevara). These firqat irregular groups played a major part in denying local support to the rebels. Being jibalis themselves (and in many cases with family connections among the communities on the Jebel), they were better at local intelligence-gathering and \"hearts and minds\" activities than the northern Omani or Baluchi personnel of the regular SAF, although they exasperated commanders of the regular SAF by refusing to take part in operations outside their tribal areas, or during Ramadan.\nThe first serious step in re-establishing the Sultan's authority on the Jebel took place in October 1971, when Operation Jaguar was mounted, involving five Firqat units. Three companies of the SAF and two squadrons of the SAS. After hard fighting, the SAS and Firqats secured an enclave on the eastern Jebel Samhan from which they could expand. The SAS introduced two new weapons to support the mobile but lightly equipped firqats: the rapid firing GPMG, which could lay down a heavier weight of fire than the Bren light machine gun previously available to the SAF, and the Browning M2 heavy machine gun, which was deployed to match the DShK machine guns used by the adoo.\nMeanwhile, the regular units of the SAF were expanded and re-equipped. Extra officers and NCO instructors from the British Army and Royal Marines (and also the Pakistan Army) were attached to all units (there were nominally twenty-two British or contracted personnel with each infantry battalion) while Omani personnel were educated and trained to become officers and senior NCOs. British specialist elements, including mortar locating radar, troops, and artillery observation officers, also rotated through Oman over several years.\n(monsoon) season, 1972]]\nThe revitalised SAF created fortified lines running north from the coast and up to the summit of the Jebel, to interdict the movement of rebels and the camel trains carrying their supplies from the PDRY. The \"Leopard Line\" was established in 1971, but this line had to be abandoned during the following monsoon season as it could not be supplied. The more effective \"Hornbeam Line\" was set up in 1972, running north from Mughsayl on the coast west of Salalah. The lines consisted of fortified platoon and company outposts on commanding peaks, linked by barbed wire. The posts possessed mortars and some also had artillery, to provide cover for patrols and to harass rebel positions and tracks used by them. The SAF soldiers continually sortied from their outposts to set ambushes on the most likely enemy infiltration routes and mount attacks against rebel mortar- and rocket-launching positions. Anti-personnel land mines were sown on infiltration routes. The rebels also used anti-personnel mines against suspected SAF patrol bases, and even laid anti-tank land mines on tracks used by SAF vehicles.\nThe Sultan of Oman's Air Force was also expanded, acquiring BAC Strikemaster aircraft which provided air support to units on the ground, and eight Shorts Skyvan transport aircraft and eight Agusta Bell 205 transport helicopters which supplied firqat and SAF posts on the jebels. A flight of RAF Westland Wessex helicopters also operated from Salalah.\nOn 17 April 1972, a battalion of the SAF made a helicopter landing to capture a position codenamed Simba at Sarfait near the border with South Yemen. The captured position overlooked the rebels' supply lines along the coastal plain, but did not block them. Although the demands on its transport aircraft and helicopters to maintain the post at Sarfait forced the SAF to abandon some positions in the eastern Jebel, Sarfait was nevertheless retained for four years.\nRebel counterattacks\n]]\nImmediately after China established relations with Iran, all support to the rebels in Dhofar was cut off by China, which had changed its mind about insurgencies, since it viewed them as counterproductive to countering the Soviets.[https://books.google.com/books?id=CPMoRVo3fSwC&pg=PA49 Garver 2006] , p. 49.[https://books.google.com/books?id=Uq77jvNypkcC&pg=PA338 Robinson 1995] , p. 338.[https://books.google.com/books?id=xvuuCgAAQBAJ&pg=PA336 Garver 2015] , p. 336.[https://books.google.com/books?id=U2jADzIM2hEC&pg=PA270 Sutter 2013] , p. 270.[https://books.google.com/books?id=J6nrPFbQfygC&pg=PA85 Sutter 2011] , p. 85.[https://books.google.com/books?id=N0arBgAAQBAJ&pg=PA190 Jones & Ridout 2012] , p. 190.\nAs a result of the various measures undertaken by the Omani government, firqats and regular SAF, the rebels were being deprived both of local support and supplies from the PDRY. This was recognised at a Third National Congress of the movement, held in Rakhyut in June 1971. Some military improvements were suggested, such as better discipline to avoid wasteful expenditure of ammunition and better coordination between units. It was acknowledged that the movement had estranged many of the local population, by indiscriminate punishments by \"people's courts\", the movement's inability to match the government's civil aid program, and the effectiveness of the government's information service, which promoted Islam over Marxism.\nTo retrieve the military situation, the rebels mounted a major attack on the coastal town of Mirbat during the monsoon season of 1972. On 19 July 1972, at the Battle of Mirbat, 250 rebel fighters attacked 100 assorted firqat under-training and paramilitary askars (armed police) and a detachment of the Special Air Service. In spite of the low khareef cloud cover, air support from Strikemaster aircraft was available, and helicopters landed SAS reinforcements. The rebels were repulsed with heavy losses.\nFinal defeat\nIn 1974, after several splits and defections, the rebel movement renamed itself the Popular Front for the Liberation of Oman. This public contraction of their aims coincided with a reduction in the support they received from the Soviet Union and China. Meanwhile, the rebels were steadily cleared from the Jebel Qara and Jebel Samhan by firqats and were driven into the western part of the Jebel Qamar.\nNevertheless, the rebels kept the respect of their opponents for their resilience and skill. In January 1975, in the hastily organised Operation Dharab, the SAF attempted to capture the main rebel logistic base in the Shershitti Caves. A SAF company from a battalion that took a wrong route blundered into an ambush in an adoo \"killing ground\" above the caves and suffered heavy casualties.\nDuring late February 1975, three battalions of the SAF eliminated much of the rebel \"9th June\" Regiment (named after the anniversary of the outbreak of the rebellion) in the rugged Wadi Ashoq in the Jebel Qamar between the Damavand and Hornbeam lines. This largely restored SAF morale.\nDuring the next few months, the SAF seized an airstrip at Deefa, but was unable to make immediate use of it during the khareef. Some regular troops from the PDRY reinforced the PFLO's fighters, who also deployed SA-7 anti-aircraft missiles for the first time. However, their premature use of this weapon deprived them of the advantage of surprise. Also, the Sultan's Air Force had acquired 31 Hawker Hunter aircraft from the Royal Jordanian Air Force. The SA-7 was much less effective against these aircraft than against Strikemasters.\nIn October 1975, the SAF launched a final offensive. An attack from Simba, intended to be a diversion, nevertheless succeeded in descending cliffs and slopes  in total height to reach the coast at Dalqhut, and thus finally cut off the adoo from their bases in the PDRY. While the Iranian Task Force threatened the Shershitti Caves from the south, another SAF battalion advanced from Deefa, threatening to surround the remaining adoo territory in the Jebel Qamar. Hawker Hunter aircraft of the Sultan's Air Force attacked artillery positions in the PDRY. Over the next few months, the remaining rebel fighters surrendered or sought sanctuary in the PDRY. The Rebellion was finally declared to be defeated in January 1976, although isolated incidents took place as late as 1979.\nForeign involvement\nBritain\nSouth Yemen\ni troops in Dhofar]]\nFrom the early days of the rebellion, Nasserite and other left wing movements in the neighbouring Aden Protectorate, later the Protectorate of South Arabia, were also involved. In 1967, two events combined to give the rebellion a more revolutionary complexion. One was the Israeli victory in the Six-Day War, which radicalised opinion throughout the Arab world. The other was the British withdrawal from Aden and the establishment of the People's Democratic Republic of Yemen (PDRY, aka South Yemen). From this point, the rebels had a source of arms, supplies, and training facilities adjacent to Dhofar, and fresh recruits from groups in the PDRY. Training camps, logistical bases, and other facilities were set up in the coastal town of Hawf, only a few miles from the border with Oman.\nBasic military training and political education were conducted at Hawf and at Jadhib in South Yemen. Recruits were reportedly given lectures on class struggle and wars of national liberation, with frequent references to Marx, Lenin, and Mao; the goal was to prepare both \"fighters and politicians.\"\nThe rebels' chief foreign backer was the government of South Yemen. Aden's financial support has been estimated variously at between $150,000 and $600,000 per year. (The lesser figure is probably more nearly correct.) The front's headquarters was in Aden, and the Adenis provided arms-mostly of Soviet origin-logistic support, medical aid, broadcasting facilities, and training sites for the guerrillas. Occasional tension has marked the relationship; the Adeni Government frequently complains, with reason, of being pestered for aid and is critical of the rebels' failure to gain victory. The Adenis also complained that too many front members prefer living in Aden to fighting in the mountains of Dhofar.\nIran\nAs a result of Sultan Qaboos's diplomatic initiatives, the Shah of Iran had sent an Imperial Iranian Army brigade numbering 1,200 and with its own helicopters to assist the Sultan's Armed Forces in 1973. The Iranian brigade first secured the Salalah-Thumrait road, while their helicopters played a vital role in keeping the isolated Simba position supplied. In 1974, the Iranian contribution was expanded into the Imperial Iranian Task Force, numbering 4,000. They attempted to establish another interdiction line, codenamed the \"Damavand Line\", running from Manston, a few miles east of Sarfait, to the coast near the border with the PDRY. Heavy opposition from the rebels, which included artillery fire from within the PDRY, thwarted this aim for several months. Eventually, the town of Rahkyut, which the PFLO had long maintained as the capital of their liberated territory, fell to the Iranian task force.\nShah Mohamad Reza Pahlavi justified his intervention in Oman by the need to defend the Strait of Hormuz: \"Just imagine that these savages should seize the other bank of the Ormuz Straits, at the mouth of the Persian Gulf. Our life depends on that. And those people at war with the Sultan are savages. They may even be worse than communists\". Iranian troops remained in the country after the end of the war but were withdrawn after the Iranian Revolution.\nAftermath\nThe British influence was still considerable at the end of the war. The special envoy in Oman of The Times of London explained in 1976:\nMost of the civil servants and all the army officers I met, with one single exception, were British. Major General Perkins himself [commander-in-chief of the Omani army] assured us that 'if Great Britain were to withdraw from Oman it would be catastrophic' [...]. Serving in Oman was very useful for the training of officers posted out here. [...] It is the only country in the world where you can wage a war like this one, a large-scale war using every kind of weapon\".\nSee also\n* List of modern conflicts in the Middle East\n* Northern Frontier Regiment\n* Operation Simba\nReferences\nExplanatory notes\nCitations\nBibliography\n*\n*\n*\n*\n*\n*\n* }}\n*\n*\n*\n*\n* }}}}\nFurther reading\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\nExternal links\n* Walter C. Ladwig III, [https://web.archive.org/web/20121003051617/http://users.ox.ac.uk/~mert1769/Supporting%20Allies%20in%20COIN_wcl2.pdf \"Supporting Allies in Counterinsurgency: Britain and the Dhofar Rebellion,\"] Small Wars & Insurgencies, Vol. 19, No. 1 (March 2008), pp.&nbsp;62–88.\n* [http://web.mit.edu/polisci/people/gradstudents/papers/DeVoreMarc-LastHotWarofColdWar.pdf \"The United Kingdom's last hot war of the Cold War: Oman, 1963–75\"] by Marc DeVore\n*"
    }
  ]
}