{
  "content": [
    {
      "type": "text",
      "text": "# Diary Queen__disambig_2\n\n| production     = QABF05\n| airdate        =\n| guests         = *Joe Mantegna as Fat Tony\n*Marcia Wallace as Edna Krabappel (archive recordings)\n*Mario Jose as Julio's singing voice\n| blackboard     = \"I will never be a teacher's pet\" is seen before the closing credits.\n| couch_gag      = The couch is on Mars and gets crushed by a spaceship. Marge and Maggie come out of the spaceship, while the rest of the family come on foot, hover bike and skateboard. However, Homer doesn't have his space helmet on; Marge asks where it is, and Homer's head explodes.\n| prev           = The Dad-Feelings Limited\n| next           = Wad Goals\n}}\n\"Diary Queen\" is the twelfth episode of the thirty-second season of the American animated television series The Simpsons and the 696th episode overall.  It aired in the United States on Fox on February 21, 2021. The episode was directed by Matthew Nastuk and written by Jeff Westbrook.\nIn this episode, Bart finds his former teacher's diary and believes that she thought he was her most improved student. The episode received positive reviews.\nPlot\nWhen Ned Flanders holds a yard sale, Bart and Milhouse buy several books as part of a scheme to record a stunt. When that backfires, the boys discover their late teacher Edna Krabappel's old diary among the books. They then escape Fat Tony and his mob and prank the school staff.\nDespite Milhouse repeatedly urging him not to invade Edna's privacy, Bart heads to his treehouse and starts reading the diary, discovering a page where Edna had written that she thought Bart had potential in succeeding in school. Convinced that he is the most improved student, Bart starts doing well in school. After Bart passes a test, the family celebrates with a cake, but Marge and Lisa look around his room, suspecting him of cheating. With the help of Maggie, Lisa finds the diary at the treehouse and discovers that Edna was actually referring to her pet cat. Lisa hides this from Bart, which soon stresses her out. When Bart decides to enter the school spelling bee, Lisa reveals the truth, causing a depressed Bart to hide in his treehouse alone.\nLater in the treehouse, Ned reveals to Bart that his family had considered leaving Springfield, but were stopped by Edna, who believed she needed to stay, as children like Bart needed her. Realizing that Edna truly did care for him, Bart returns the diary to Ned. At home, Ned reads the diary and is brought to tears over an entry where Edna says that being married to him made her dreams come true.\nThe episode ends with a montage of Edna's moments throughout the series.\nProduction\nCasting\nThe late Marcia Wallace guest-stars as Edna Krabappel through archive recordings. Her estate cleared her appearance and was compensated for it. The show did not give a farewell to Wallace's character at the time of her passing because producers were not aware she was ill, so this episode was an attempt to memorialize her. The producers also decided not to reveal how Edna died.\nThis is the final episode in which actor Harry Shearer voices the black character of Dr. Hibbert. Beginning with the following episode \"Wad Goals\", he is voiced by Kevin Michael Richardson, who is African-American. In addition, Julio had his voice provided by Mario Jose in this episode.\nJoe Mantegna appears as Fat Tony.\nRelease\nThe episode was scheduled to debut on January 10, 2021, but was rescheduled to February 14 due to being preempted by the NFL playoffs. Rain delays at the 2021 Daytona 500 further delayed all prime time shows scheduled for broadcast to February 21.\nReception\nViewing figures\nIn the United States, the episode was watched live by 1.43 million viewers.\nCritical response\nTony Sokol with Den of Geek, said \"This is a different kind of arc for The Simpsons. 'Diary Queen' is on an uplifting trajectory until Lisa knocks it off course, and ends in a sudden life-affirming crash. Bart’s final warning to Marge, 'I'll go over the edge if you try to make me feel better,' is wonderfully skewered, but the final twist is a dose of treacle. The episode was originally slated to premiere on Valentine’s Day, and is a sweet sendoff.\" He also gave the episode four out of five stars.\nJesse Bereta of Bubbleblabber gave the episode a 7.5 out of 10. He thought the episode was a respectful way to honor Marcia Wallace. He stated that the closure that Bart receives was the most heartwarming part of the episode.\nReferences\nExternal links\n*"
    }
  ]
}