{
  "content": [
    {
      "type": "text",
      "text": "# Dick Warner (impresario)\n\nRichard L. Warner (1856–1914), known as Dick Warner, was a London theatrical agent during the fin de siecle. He was the founder of Warners International Actors and Musical Agency and in 1888 he launched the Music Hall Benevolent Fund, which provided a financial safety net for music hall entertainers, their widows and children. During actors' strikes early in the 20th century, Warner was trusted as a negotiator by actors, and he was the only agent invited as a go-between by the Proprietors of Entertainments Association.\nHe developed high profile friendships with men such as Sir Augustus Harris, who championed the development of grand opera and ballet, Edward Ledger, the editor of the entertainment industry's publication The Era, and Henri Gros, who led collectives of theatre proprietors and victuallers. He rallied agents, artists and theatre managers, comprising many Jewish entertainers and agents, and entertained them around Covent Garden at the Eccentric Club, the Grand Order of Water Rats, or his own Strand Lodge branch of the United Grand Lodge of England.\nBiography\nRichard Warner was born in 1856 in Bohemia and moved to England in 1865 with his widowed mother and three siblings. He was probably educated privately in Teplice by an uncle, a Jewish scholar, and he maintained a love for Jewish language and prayer throughout his life.\nFamily\nWarner first married Elizabeth Benjamin in 1876, who died, childless within a few years.  He then married Lizzie Somers, an operatic performer, soon after the launch of his first agency in 1881, and it was through his marriage that he secured his place in the entertainment industry.  She was the niece of the three de Frece brothers, who were Liverpool variety hall managers. One of Warner's proteges was Vesta Tilley who married Warner's brother-in-law Abraham Walter de Frece who also worked as an agent for Warners International, and later became a conservative member of parliament, knighted in 1919 for his wartime work for pensioners.  Warner's agents included his brother Emanuel who worked mainly in New York, a nephew Ernest Warner, who later launched out on his own with his cousin Jack Somers in an agency in Tottenham, and one of his three daughters, Miriam Warner, who became a wartime theatrical agent in London's West End, where she organised charitable concerts for returning servicemen.  Late in the 1920's she organised regular matinees for charity in partnership with her best known clients, such as Sybil Thorndike. Miriam Warner's  proteges included actress Sheila Hancock, who was looking for a start in theatre.  In the biography of her marriage to John Thaw, Hancock described Miriam in withering terms.  Another of Warner's daughters, married into the musical Mendelssohn family, and her son was the Hawaiian Serenaders band leader Felix Mendelssohn.\nWarner Brothers International\nWarner was unlike most theatrical entrepreneurs, in that he was neither an actor nor a musician, but he had a passionate interest in classical music and his early working life was spent as a fine art salesman. He dabbled in both the most popular forms of entertainment, and the more serious musical interests such as his work with E. Bosanquet, the 'chef de orchestre' of the Canterbury Theatre, in creating the London Orchestral Registry, which hired musicians, and even provided lessons and sheet music to enhance the musical standards of the orchestra pits of the West End.\nWarner's first partnership in theatrical agency was with William Leonard Hunt, known popularly as tightrope walker \"The Great Farini\", who crossed Niagara Falls with a washing machine on his back. Farini was interested in human \"curiousities\" such as African pygmies, giants and dwarfs and hirsute women, who were exhibited to the public under the guise of education. After ten years Farini retired and in 1899 Warner renamed his business the Anglo-American Agency, with his brother Emanuel began to scour Europe and the US for musicians, comedians and actors to change the tone of music hall and variety entertainment.   His extended family produced celebrity entertainers well into the 20th Century, who negotiated the journey from variety to the big screen such as Lauri de Frece, who married Fay Compton.\nDeath\nWarner became an enemy alien when war was declared in 1914, and was despised publicly as a result of the London County Council's (LCC) licensing where alien status was a cause for revocation of a licence. The secretary of the Music Hall Agents, Mr Goodson, opposed the renewal of Warner's agency on the grounds that Warner was a Bohemian, the secretary of the company Mr Lanczy was an Austrian (or Hungarian), and the families held 20,000 shares in a British public company.  Warner stated he had been in England for 49 years, he was a Czech born in Bohemia with no interests in Germany, and as he was an invalid he would relinquish directorship of the company.  The LCC relented and allowed the company licence to stand. Within a fortnight Warner died at home, and his death was not reported in the British newspapers. Warner's biographer H. Chance Newton blamed the grief of war for his premature death. By 1926 some commentators lamented the loss of variety theatre, which they attributed to the death of a \"magnetic personality\" such as Dick Warner.\nReferences"
    }
  ]
}