{
  "content": [
    {
      "type": "text",
      "text": "# Dien Bien Phu (wargame)\n\nDien Bien Phu, subtitled \"Strategic Game of Indochina 1950-55\" is a board wargame published by Simulations Design Corporation (SDC) in 1973 that simulates the final five years of the First Indochina War in the northern French protectorate of Tonkin.\nBackground\nFollowing World War II, Japanese forces that had occupied Vietnam surrendered to Soviet forces in the north and to British forces in the south. The Soviets handed over control of the north to Hồ Chí Minh's Democratic Republic of Vietnam (DRV), but the British refused to do the same, instead turning over the south to former colonial power France. Although France and the DRV held talks, the tensions between them devolved into war, with the largely rural and irregular forces of the north on one side, and the modern armed forces of France on the other. The resultant war lasted for 10 years, until the French surrender at the Battle of Dien Bien Phu.\nDescription\nDien Bien Phu is a two-person strategic wargame in which one player controls French forces and the other controls DRV and Vietcong forces. The game features simultaneous plotting and movement. Combat is resolved on a simple table: attacking odds better than 1 to 1 result in defensive retreat and elimination; attacking odds at less than 1 to 1 result in the attackers being eliminated or retreating; odds of 1 to 1 can result in eliminations or retreats for either or both sides.\nThe Vietminh move slowly but can hide in enemy territory. The French have the advantage of air transportation and modern weaponry.\nVictory conditions\nThere are 14 turns in the game. If no one has won before the end of the last turn, the player in control of more geographical areas is the winner. A player can win before this by reaching a quota of areas held or enemies eliminated each turn.\nVietminh strategy\nThe Vietminh move slowly and consequently supplies also move to the front slowly.  Critic Luc Olivier suggest that the Vietminh \"must plan ahead for the use of supply units required to allow moves in enemy areas and combat. There are few supply units at the beginning of the game and fewer are added each turn. So, as in the real conflict, the VM must organize offensives by stockpiling supply near the objective areas.\"\nFrench strategy\nOlivier suggested the French must use their advantage in transportation to quickly build up an overwhelming concentration of firepower for each battle. However, as Olivier noted, \"The key operative word for\ncombat is concentration. However, this is easier said than done, because as the moves are simultaneously plotted, the resulting combat can be unpredictable.\"\nPublication history\nSDC had published the Vietnam wargame Battle for Hue in 1973, and returned to the same theme later that year with Dien Bien Phu, designed by Dana Lombardy based on an original game idea by Guy R. Hail. It was published as a free pull-out game in Issue 6 of SDC's house magazine Conflict, and was also released as a ziplock bag game. A second edition was published by Flying Buffalo in 1977. Critic Allan Rothberg noted that Dien Bien Phu \"is one of only two English language campaign games on the French Indo-China war.\"\nIn a 1976 poll conducted by Simulations Publications Inc. to determine the most popular board wargames in North America, Dien Bien Phu placed a dismal 200th out of 202 games.\nReception\nIn the 1977 book The Comprehensive Guide to Board Wargaming, Charles Vasey noted that only 4 years after its release, this game \"is rarely seen now, though the subject must have looked promising enough.\" Vasey found the game to be \"accurate and innovative\" but thought it was unbalanced against the French player.\nLuc Olivier called this \"an unusual game with an area map, simultaneous plotting of all the moves and simple resolution of combat, with just a little chrome to show the oddities of the theater of warfare.\" After an examination of the rules and strategies, Olivier concluded, \"All in all, the rules are interesting and in a few pages succeed in correctly simulating this unusual war. But the plotting and area moves produce some odds results, very different every time.\"\nAllan Rothberg had fond memories of playing this game, but upon replaying it 25 years later, \"the game seemed fairly flat. Units are too difficult to kill, and both sides can move units around pretty freely. Even with 22 areas to cover it is very difficult to concentrate the large force needed to get a kill, without leaving other units vulnerable to a similar action from the enemy.\" Rothberg found the early victory conditions impossible to fulfill, meaning the game had to be played to its full length every time. Rothberg noted, \"It is possible to attain the other victory conditions (territorial or single turn kills); I just don’t see two competent players doing it often. The game devolves into doing a waltz with territory taken, regained, retaken, and all the while the enemy is doing exactly the same thing.\"\nOther reviews\n*Panzerfaust #63\nReferences"
    }
  ]
}