{
  "content": [
    {
      "type": "text",
      "text": "# Differential argument marking__disambig_1\n\nIn linguistics, differential argument marking (DAM) is the phenomenon of a language's encoding a single grammatical function (e.g. subject or object) in different ways. It includes non-uniform encoding of arguments in terms of case marking, but also in terms of the presence or absence of agreement on the verb. The term differential marking – specifically differential object marking or DOM – was coined by Georg Bossong in relation to his work on Sardinian and New Iranian languages. However, in recent years there has been a growing interest in the great variety of differential marking patterns across the world's languages in both formal and functional linguistics.\nTypes of differential marking\nThere are several sub-types of differential argument marking depending on the grammatical function and/or semantic role of the differentially-marked argument:\n*Differential Subject Marking\n*Differential Object Marking\n* Differential Agent Marking/Optional Ergative Marking\n* Differential Recipient Marking\n* Differential Theme Marking\nThe most widely studied are differential object marking, differential subject marking, and optional ergative marking.\nDifferential object marking\nDifferential subject marking\nCase-marking is one of the formal guises of differential subject marking, along with agreement, inverse systems and voice alterations, which goes hand in hand with differential subject marking. The use of case marking on subject is to differentiate prominence in arguments. It can be used on subjects of transitive verbs and intransitive verbs. The definiteness and animacy scale of differential subject marking has the same hierarchical structure exhibited in the section on differential object marking. The functional motivation for the implementation of differential subject and object marking is to avoid ambiguity as to what is subject and object in transitive clauses. The most natural hierarchy of animacy and definiteness places transitive subjects higher than transitive object.\nOptional vs alternating systems\nSome people draw a distinction between optional and alternating systems of differential marking. An optional system is one in which the case marker can be either present or absent. This can be illustrated from Persian:\nAn alternating system is one in which two different case markers alternate in marking the same argument. This can be illustrated from Finnish:\nPatterns of differential marking\nDifferential marking is known to be affected by a range of semantic and information structure factors. These include semantic properties of the argument such as animacy, definiteness and referentiality. It also includes properties related to the event semantics, such as the affectedness of arguments or the level of volitionality or control. Finally, in many languages, differential marking is related to the status of arguments as either topical or focal. There appear to be cross-linguistic differences in the triggering factors depending on whether the subject (agent) or object (patient) is differentially-marked.\nPerson and animacy\nIn some cases, arguments are marked differential depending on their inherent properties. Examples of inherent properties that affect argument marking include the person, animacy and uniqueness features of a noun, which are often expressed as a hierarchy or scale.\n{| class=\"wikitable\"\n|+Inherent Semantic Properties of Arguments\n!Semantic Category\n!Hierarchy\n|-\n|'Person'\n|first/second person > third person > obviative/fourth person\n|-\n|'Animacy'\n|human > animate non-human (animals) > inanimate\n|-\n|'Uniqueness'\n|proper noun > common noun\n|}\nIn cases of differential marking, arguments that are higher on the scale tend to have one form of marking, whilst arguments lower on the scale have a different form of marking. The cut off point may not be the same in all languages. An example is Hindi where the marking of objects is affected by animacy. Animate objects are marked with accusative case, irrespective of whether the argument is definite or not. In contrast, if an inanimate object is marked for the accusative case, the object must be definite.\nDefiniteness and specificity\nDifferential marking can also be affected by discourse-related semantic features, such as definiteness and specificity. Like other semantic features, these can also be represented as a hierarchy.\n{| class=\"wikitable\"\n|+Discourse-related Properties of Arguments\n!Semantic Category\n!Hierarchy\n|-\n|'Definiteness'\n|Definite > Indefinite (specific) > Indefinite (non-specific)\n|}\nInformation structure\nDifferential marking is also linked to information structure and the status of an argument as either topic or focus. Like definiteness, this is related to the status of the argument in discourse and depends on the context. Differential marking of agents and patients appear to be affected by different information structure triggers. Differential object marking often signals the status of a patient as topical. In contrast, differential agent marking often signals the status of an agent as being in focus.\nAn example of differential object marking that is affected by information structure is Neo-Aramaic. In the Neo-Aramaic dialect of Telkepe, objects can either be unmarked or marked with ta. Objects that are topical, such as (4a), are marked with ta. Objects that are not topical cannot be marked with ta, for example when they have argument focus as the answer to a question, as in (4b).\nAn example of differential agent marking that is affected by information structure is Tibetan. In Central Lhasa Tibetan, an agent in a transitive clause can either be marked with ergative marking or unmarked. When the agent is a topic, which is the most common role for agents cross-linguistically, it is normally unmarked, as in (5a). However, when the agent is contrasted, it will be marked with ergative case, as in (5b).\nDifferential case marking vs differential agreement\nIt remains a matter of debate whether differential argument marking (i.e. the presence or absence of case markers) and differential argument indexing (i.e. the presence or absence of verbal agreement) are part of the same phenomenon or not. Some have argued that differential case marking and differential agreement should be treated as the same phenomenon on the basis that the share many functional similarities. Others have argued that they are different, pointing to different functions, motivations and historical development.\nReferences"
    }
  ]
}