{
  "content": [
    {
      "type": "text",
      "text": "# DIG: An Archaeological Adventure__disambig_1\n\n}}\nDIG: An Archaeological Adventure is an educational resource in York, England. Operated by York Archaeology, the centre is housed in the former St Saviour's Church, a 15th-century building repurposed in the 1990s as an archaeological education centre. DIG offers an immersive learning environment where visitors engage in simulated excavations and artefact analysis across four historical periods: Roman, Viking, medieval and Victorian. Using excavation tools, participants explore replica and authentic artefacts, supported by multimedia displays that explain archaeological methods and historical contexts.\nThe site lies within a deeply stratified urban area of York, where well-preserved, waterlogged deposits have provided ideal conditions for preserving organic remains. These conditions have made the city centre a significant focus of urban archaeology in the UK. Excavations in the 20th century revealed layers of human activity, forming the foundation for both research and public engagement in archaeology.\nDIG is fully accessible and incorporates multi-sensory elements and communication aids to support visitors with diverse needs. The centre provides family-friendly and educational resources and encourages repeat visits through an annual pass system. As part of York Archaeology's public archaeology programme, DIG forms a cultural network alongside other heritage sites such as the JORVIK Viking Centre and Barley Hall.\nHistory of St Saviour's Church\nDIG is located within the grounds of St Saviour's Church, which is designated as a Grade II* listed building for its architectural and historic importance.\nAccording to the Royal Commission for Historic Monuments (1981), the site of St Saviour's Church is documented as early as the 11th century, when it was identified as a gift from William II's father to St Mary's Abbey. However, the existing structure reflects a largely 15th-century Gothic architectural style, featuring large pointed arch windows, carved stonework and wooden roof trusses. For centuries, St Saviour's Church served as the local parish church for the community in the historic centre of York.\nAccording to an analysis of the 1851 religious census, the population of St Saviour's parish was over 2,800, including approximately 210 domestic servants, 1,045 children, and a variety of occupations such as shoemakers, innkeepers, cloth merchants, schoolmasters, and even Members of Parliament. It straddles the main city streets of Spurriergate, Whip-Ma-Whop-Ma-Gate, Stonebow, and Walmgate, linking commercial and residential areas. In the mid-19th century, the parish was home to several pubs, schools, and places of employment, and was the centre of local economic and social activity. The church served a diverse urban population, combining wealthy families with working-class communities.\nThe church was declared redundant in 1954.\nAcquisition by the York Archaeological Trust\nThe York Archaeological Trust, an educational charity established in 1972 to promote local archaeological research and education, acquired the church in the 1970s.\nOriginally used as a repository for archaeological finds, in the early 1990s the York Archaeological Trust converted St Saviour's Church into the Archaeological Resource Centre (ARC), a pioneering educational facility focused on interactive, hands-on archaeology. The ARC aims to complement the more passive visual displays of the Jorvik Viking Centre by providing tactile engagement and participatory learning, responding to public demand for more interactive experiences in archaeology. As described by Jones (2000), the ARC provides visitors with the opportunity to simulate real archaeological processes such as excavation, cultural analysis, and stratigraphic interpretation. The design retains the structural features of the original church building, such as the tall nave and historic medieval masonry, while introducing educational spaces such as simulated excavation areas and interactive exhibition areas to support learning.\nThe Archaeological Resource Centre (ARC) closed in July 2005 and reopened in March 2006 as DIG: An Archaeological Adventure.\nVisitor experience\nVisitors begin in a recreated excavation area consisting of four simulated excavation pits. Each pit corresponds to a specific period in York's past: Roman, Viking, Medieval, and Victorian. The excavation area uses layers of coloured rubber granules to simulate archaeological strata. Visitors can use trowels and brushes to excavate real and replica artifacts embedded in the layers, such as Roman plaster, ballista balls, Viking slag and tools, ear scoops, medieval burial materials, and Victorian household items.\nAfter completing the excavation activities, visitors enter a series of themed environments that show how archaeologists use a variety of techniques to identify the nature, age, origin, and purpose of the unearthed artifacts. Activities are usually held in venues such as the \"Field Tent\", \"Cultural Heritage Laboratory\", and \"Research Library\", and provide hands-on projects, using computer technology, simple tactile sensations, auditory and visual stimulation, displays of holographic images of archaeologists, and image information panels, with an emphasis on image presentation.\nIn addition to the interactive lab, visitors can further touch real artifacts, operate exhibits themselves, interact with \"archaeologist\" characters, and obtain more information with the help of computer databases. The last area of the exhibition is called \"York Revealed\", which uses 3D modelling technology to reconstruct the York relics found during the DIG excavation, providing visitors with an immersive historical restoration experience. Holographic archaeologists \"appear\" in different excavation areas to introduce unearthed artifacts and their background; hydraulic lifting platforms display historical building models reconstructed based on archaeological evidence; at the same time, virtual images of Romans, Vikings, medieval monks, and Victorian characters are introduced into various scenes to present their activities at the time.\nThe upper floor of the exhibition hall has a multi-functional space for children's education and thematic workshops. There is also a resource room for teachers to plan courses and individual researchers.\nDIG is designed to attract a diverse public group and form a complementary exhibition with the JORVIK Centre, showing visitors the whole process from archaeological discovery to historical reconstruction.\nOperations\nDIG is operated by York Archaeology, an educational charity. Revenue generated from ticket sales directly supports the organisation's broader mission of public education and heritage preservation. This includes school outreach programmes, archaeological research, conservation of historic sites, and the day-to-day running of other visitor attractions. This operational model aligns commercial activity with the organisation's not-for-profit educational objectives.\nReferences\nExternal links\n*"
    }
  ]
}