{
  "content": [
    {
      "type": "text",
      "text": "# Dimasa Kingdom__disambig_1\n\n||none}}\n| image_map2_caption    = Location of Dimasa kingdom around 1500 CE\n| capital                = DimapurMaibangKhaspur\n| common_languages       = Dimasa\n| religion               = HinduismFolk religion/Animism\n| government_type        = Tribal hereditary monarchy\n| title_leader           =\n| legislature            =\n| demonym                =\n| area_km2               =\n| area_rank              =\n| GDP_PPP                =\n| GDP_PPP_year           =\n| HDI                    =\n| HDI_year               =\n| today                  = India(Assam, Nagaland)\n}}\nThe Dimasa Kingdom also known as Kachari kingdom was a late medieval/early modern kingdom in Assam, Northeast India ruled by Dimasa kings.  The Dimasa kingdom and others (Kamata, Chutiya) that developed in the wake of the Kamarupa kingdom were examples of new states that emerged from indigenous communities in medieval Assam as a result of socio-political transformations in these communities. The British finally annexed the kingdom: the plains in 1832 and the hills in 1834. This kingdom gave its name to undivided Cachar district of colonial Assam. And after independence the undivided Cachar district was split into three districts in Assam: Dima Hasao district (formerly North Cachar Hills), Cachar district, Hailakandi district.  The Ahom Buranjis called this kingdom Timisa.\nIn the 18th century, a divine Hindu origin was constructed for the rulers of the Kachari kingdom and it was named Hidimba, and the kings as Hidimbesvar. The name Hiḍimbā continued to be used in the official records when the East India Company took over the administration of Cachar.\nOrigins\nThe origin of the Dimasa Kingdom is not clear.  According to tradition, the Dimasa had their domain in Kamarupa and their king belonged to a lineage called Ha-tsung-tsa or Ha-cheng-sa, a name first mentioned in a coin from 1520.  Some of them had to leave due to a political turmoil and while crossing the  Brahmaputra some of them were swept away—therefore, they are called Dimasa (\"Son-of-the-big-river\").  The similarity in Dimasa traditions and religious beliefs with those of the Chutiya kingdom supports this tradition of initial unity and then divergence. Linguistic studies too point to a close association between the Dimasa language and the Moran language that was alive till the beginning of the 20th-century, suggesting that the Dimasa kingdom had an eastern Assam presence before the advent of the Ahoms. The eastern Assam origin of the Dimasas is further reinforced by the tradition of the tutelary goddess Kecaikhati whose primary shrine was around Sadiya; the tribal goddess common to many Kachari peoples: as the Rabhas, Morans, Tiwas, Koch, Chutias, etc.\nDimapur was the capital of the Kachari kingdom during the 10th-13th century CE.\nAccording to legend Hachengsa (or Hasengcha) was an extraordinary boy brought up by a tiger and a tigress in a forest near Dimapur who replaced the existing king following divine oracles; which likely indicates the emergence of a strong military leader able to consolidate power.   Subsequently, the Hasengcha Sengfang (clan) emerged and beginning with Khorapha (1520 in Dimapur), the Dimasa kings continued to draw lineage from Hachengcha in Maibong and Khaspur till the 19th century.\nGiven different traditions and legends, the only reliable sources of the early history of the Dimasa kingdom is that given in the Buranjis, even though they are primarily narrations of wars between the Ahom and the Dimasa polities.\nMany claims that the Dimasa Kingdom was established in the 9th century. When Sukapha established his kingdom in the 12th century, Dimasa kingdom was said to have already extended along the southern banks of the Brahmaputra river, from Dikhow river in Sivasagar to the Kallang river in Nagaon and included the valley of Dhansiri and also the parts of the present-day Dima Hasao district. The Dikhow river was said to be the boundary between the Dimasa kingdom and the Ahom kingdom.\nEarly history\nThe historical accounts of the Dimasas begin with mentions in Ahom chronicles: according to an account in a Buranji, the first Ahom king Sukaphaa (r. 1228–1268) encountered a Kachari group in the Tirap region (currently in Arunachal Pradesh), who informed him that they along with their chief had to leave a place called Mohung (salt springs) losing it to the Nagas and that they were settled near the Dikhou river. This supports a tradition that the eastern boundary of the Kachari domain extended up to Mohong or Namdang river (near Joypur, Assam) beyond the river Dichang, before the arrival of Ahoms. Given the settlement was large, Sukaphaa decided not to engage with them before settling with the Barahi and Moran polities. During the reign of Sukaphaa's successor Suteuphaa () the Ahoms negotiated with this group of the Dimasa, who had been in the region between Dikhou and Namdang for about three generations by then, and the Dimasa group moved to the west of the Dikhou river. These isolated early accounts of the Dimasas suggest that they controlled the region between the Dikhu river in the east and the Kolong river in the west and included the Dhansiri valley and the north Cachar hills from the late 13th century.\nAt Dimapur\nThe Ahom language Buranjis call the Dimasa kings khun timisa, and place them initially in Dimapur, where Timisa is a corruption of Dimasa. The Dimasa kingdom did not record their history, and much of the early information come from other sources.  The Ahom Buranjis, for instance, record that in 1490 the Ahom king Suhenphaa (1488–93) created a forward post at Tangsu and when the Dimasas killed the commander and 120 men the Ahoms sued for peace by offering a princess to the Dimasa king along with other presents, but the name of the Dimasa king is not known. The Dimasas thus recovered the region east of the Dikhau river that it had lost in the late 13th century.\nEkasarana biographies of Sankardeva written after his death use the name Kachari for the Dimasa people and the kingdom and record that around 1516 the Baro-Bhuyans at Alipukhuri came into conflict with their Kachari neighbors which escalated into the Dimasa king preparing to attack them. This led Sankardeva and his group to abandon the region for good. One of the earliest mention of Kachari is found in the Bhagavat of Sankardev in the section composed during the later part of his life in the Koch kingdom where he uses it synonymously with Kirata.  Another early mention of the name Kachari comes from Kacharir Niyam (Rules of the Kacharis), composed during the reign of Tamradhwaj Narayan (), when the Dimasa rulers were still ruling in Maibang.\nA coin dated 1520 commemorating a decisive victory over enemies is one of the earliest direct evidence of the historical kingdom. Since no conflict with the Kacharis is mentioned in the Ahom Buranjis it is conjectured that the enemy could have been the nascent Koch kingdom of Biswa Singha.   Though issued in a Sanksritised name of the king (Viravijay Narayan, identified with Khorapha) with the mention of a goddess Chandi, there is no mention of the King's lineage but a mention of Hachengsa, a Boro-Garo name indicated that an appropriate Kshatriya lineage had still not been created by 1520. The first Hindu coin from the Brahmaputra valley, it followed the same weights and measures of the coins from the Muslim Sultans of Bengal and Tripura and indicate influence from them.\nThis kingdom might have been part of ancient Sinitic networks such as the Ming dynasty (1368–1644).\nFall of Dimapur\nSoon after absorbing the Chutia kingdom in 1523-24 Suhungmung, the Ahom king, decided to recover the territory the Ahoms had lost in 1490 to the Dimasa kingdom and sent his commander Kan-Seng in 1526 who advanced up to Marangi. In one of these attacks the Dimasa king Khorapha was killed, and Khunkhara, his brother, came to power. The two kingdoms made peace and decided to maintain the Dhansiri river as the boundary. This peace did not hold and fighting broke out between an advancing Ahom force against a Kachari force arrayed along the Dhansiri—the Kacharis were successful initially, but they suffered a massive loss at Marangi, and again an uneasy stalemate prevailed. In 1531 the Ahoms went on the offence and Khunkhara's brother Detcha lost his life attacking the newly erected Ahom fort at Marangi. Both the Ahom king and the commander then attacked the Nenguriya fort, and Khunkhara had to flee with his son. The Ahoms force under Kan-Seng then reached Dimapur following which Detchung, a son of the earlier king Khorapha, approached Suhungmung at Nenguriya and submitted his claim to the Dimasa throne.  The Ahoms thereafter claimed the Dimasa king as thapita-sanchita (established and preserved), and the Dimasa kingdom provided support to the Ahom kingdom when it was under the attack of Turbak in 1532/1533, a Turko-Afghan commander from Bengal.\nBut when Detchung (also called Dersongpha) tried to throw off the yoke Suhungmung advanced against Detchung captured and killed him, and then advanced on and occupied Dimapur in 1536.  The Dimasas rulers thereafter abandoned Dimapur.\nCultural affinities at Dimapur\nin Dimapur]]\nThe current ruins at Dimapur, the same city that Suhungmung occupied, include a 2 mile long brick wall on three sides, with the Dhansiri river on the fourth with water tanks—indicating a large city. The existing gateway too was in brick and display the Islamic architectural style of Bengal.  The ruins include curious carved 12 feet tall pillars of sandstone with hemispherical tops and foliated carvings with representations of animals and birds but no humans that display no Hindu influence. Despite the Sanskrit markings of the 1520 silver coin issued by Viravijay Narayan (Khorapha), the city lacked any sign of Brahminical influence, from the observations in 1536 as recorded in the Buranjis, as well as the colonial observations of 1874.\nAt Maibang\nThe fall of Dimapur in 1536 was followed by a 22-year period of interregnum, and there is no mention of a king in the records.  In either 1558 or 1559 a son of Detsung, Madanakumara, assumed the throne with the name Nirbhaya Narayana, and established his capital at Maibang in the North Cachar hills. Not all the Kachari people accompanied the rulers from Dimapur to Maibong—and those who remained in the plains developed independently in language and customs.  In the hills around Maibong, the Dimasa rulers encountered already established Naga and Kuki peoples, who accepted the Dimasa rule.\nKhorapha, the earlier king, claimed in the coin issued earlier in 1520 from Dimapur that he had defeated the enemies of Hachengsa without specifying his relationship to him but Nirbhaya Narayana and his successors in Maibong for the next hundred years or so claimed in their coins that they belonged to the family of Hachensa; thereby signalling a change in the mode of legitimacy from deed to birth. On the other hand Dimasa kings from Maibang are recorded as Lord of Heremba from the 16th century by those outside the Dimasa kingdom who practiced sedentary agriculture and who had already experienced Brahminism.\nKoch invasion\nAfter subjugating the Ahoms in 1564, the Koch commander Chilarai advanced on Marangi, subjugated Dimarua and finally advanced on the Dimasa kingdom, then possibly under Durlabh Narayan or his predecessor Nirbhay Narayan and made it into a feudatory of the Koch kingdom. This campaign realigned the relationships and rearranged the territorial controls among the political formations of the time. Dimarua, which was a feudatory of the Dimasa kingdom, was set up by Chilarai was a buffer against the Jaintia kingdom. The hold of the Ahom kingdom, which was already subjugated, over the Dimasa kingdom weakened. Further, Chilarai defeated and killed the Twipra king, and occupied the Cachar region from him and established Koch administration there at Brahmapur (Khaspur) under his brother Kamal Narayan—this region was to form the core of the Dimasa rule in the 18th century.  The size of the annual tribute&mdash; seventy thousand rupees, one thousand gold mohurs and sixty elephants&mdash; testifies to the resourcefulness of the Kachari state.\nA conflict with the Jaintia Kingdom over the region of Dimarua led to a battle, in which the Jaintias suffered defeat.  After the death of Jaintia king Dhan Manik, Satrudaman the Dimasa king, installed Jasa Manik on the throne of Jaintia Kingdom, who manipulated events to bring the Dimasa Kacharis into conflict with the Ahoms once again in 1618. Satrudaman, the most Dimasa powerful king, ruled over Dimarua in Nagaon district, North Cachar, Dhansiri valley, plains of Cachar and parts of eastern Sylhet. After his conquest of Sylhet, he struck coins in his name.\nBy the reign of Birdarpan Narayan (reign around 1644), the Dimasa rule had withdrawn completely from the Dhansiri valley and it reverted to a jungle forming a barrier between the kingdom and the Ahom kingdom.\nWhen a successor king, Tamradhwaj, declared independence, the Ahom king Rudra Singha deputed 2 of his generals to invade Maibong with over 71,000 troops, and destroyed its forts in 1706. Tamardhwaj fled to Jaintia Kingdom where he got treacherously imprisoned by the King of Jaintia Kingdom, after his imprisonment he sent messengers to the Assam king for help, in response Rudra Singha deputed his generals with over 43,000 troops to invade Jaintia kingdom. The Jaintia king was captured and taken to the court of Rudra Singha where the Jaintia king submitted and the territories of the Dimasa Kingdom and Jaintia kingdom got annexed to the Ahom kingdom.\nState structure\nKacharis had three ruling clans (semfongs): Bodosa (an old historical clan), Thaosengsa (the clan to which the kings belonged), and Hasyungsa (to which the kings relatives belonged).\nThe king at Maibang was assisted in his state duties by a council of ministers (Patra and Bhandari), led by a chief called Barbhandari. These and other state offices were manned by people of the Dimasa group, who were not necessarily Hinduized. There were about 40 clans called Sengphong of the Dimasa people, each of which sent a representative to the royal assembly called Mel, a powerful institution that could elect a king. The representatives sat in the Mel mandap (Council Hall) according to the status of the Sengphong and which provided a counterfoil to royal powers.\nOver time, the Sengphongs developed a hierarchical structure with five royal Sengphongs though most of the kings belonged to the Hacengha (Hasnusa) clan. Some of the clans provided specialized services to the state ministers, ambassadors, storekeepers, court writers, and other bureaucrats and ultimately developed into professional groups, e.g. Songyasa (king's cooks), Nablaisa (fishermen).\nBy the 17th century, the Dimasa Kachari rule extended into the plains of Cachar. The plains people did not participate in the courts of the Dimasa Kachari king directly. They were organized according to khels, and the king provided justice and collected revenue via an official called the Uzir.  Though the plains people did not participate in the Dimasa Kachari royal court, the Dharmadhi guru and other Brahmins in the court cast a considerable influence, especially with the beginning of the 18th century.\nAt Khaspur\nIn the medieval era, after the fall of Kamarupa kingdom the region of Khaspur was originally a part of the Tripura Kingdom, which was taken over by Koch king Chilarai in the 16th century. The region was ruled by a tributary ruler, Kamalnarayana, the brother of king Chilarai. Around 18th century Bhima Singha, the last Koch ruler of Khaspur, didn't have any male heir. His daughter, Kanchani, married Laxmichandra, the Dimasa prince of Maibang kingdom. And once the last Koch king Bhima Singha died the Dimasas migrated to Khaspur, thus merging the two kingdoms into one as Kachari kingdom under the king Gopichandranarayan, as the control of the Khaspur kingdom went to the ruler of the Maibong kingdom as inheritance from the royal marriage and established their capital in Khaspur, near present-day Silchar. The independent rule of the Khaspur's Koch rulers ended in 1745 when it merged with the Kachari kingdom. Khaspur is a corrupted form of the word Kochpur. Gopichandranarayan (r. 1745–1757), Harichandra (r. 1757–1772) and Laxmichandra (r. 1772–1773) were brothers and ruled the kingdom in succession. In 1790, a formal act of conversion took place and Gopichandranarayan and his brother Laxmichandranarayan were proclaimed to be Hindus of the Kshatriya caste.\nDuring the reign of Krishnachandra (1790–1813), a number of Moamarias rebels took shelter in the Cachar state. The Ahoms blamed the Dimasa for providing refuge to the rebels and this led  to a number of small skirmishes  between the Ahoms and the Dimasas from 1803 to 1805.\nThe King of Manipur sought the help of Krishna Chandra Dwaja Narayan Hasnu Kachari against the Burmese Army. The King Krishna Chandra defeated Burmese in the war and in lieu was offered the Manipuri Princess Induprabha. As he was already married to Rani Chandraprabha, he asked the princess to be married to his younger brother Govinda Chandra Hasnu.\nSanskritization\nThe fictitious but widely believed legend that was constructed by the Hindu Brahmins at Khaspur goes as follows: During their exile, the Pandavas came to the Kachari Kingdom where Bhima fell in love with Hidimbi (sister of Hidimba). Bhima married princess Hidimbi according to the Gandharva system and a son was born to princess Hidimbi, named Ghatotkacha. He ruled the Kachari Kingdom for many decades. Thereafter, kings of his lineage ruled over the vast land of the \"Dilao\" river (which translates to \"long river\" in English), now known as Brahmaputra River for centuries until 4th century AD.\nBritish occupation\nThe Dimasa Kachari kingdom came under Burmese occupation in the late early 19th-century along with the Ahom kingdom.  The last king, Govinda Chandra Hasnu, was restored by the British after the Yandabo Treaty in 1826, but he was unable to subjugate Senapati Tularam who ruled the hilly regions.  Senapati Tularam Dimasa domain was Mahur River and the Naga Hills in the south, the Doyang River on the west, the Dhansiri River on the east and Jamuna and Doyang  in the north.  In 1830, Govinda Chandra Hasnu died.  In 1832, Senapoti Tularam Thaosen was pensioned off and his region was annexed by the British to ultimately become the North Cachar district; and in 1833, Govinda Chandra's domain was also annexed to become the Cachar district.\nAfter Raja Govinda Chandra\nIn The British annexed the Dimasa Kachari Kingdom under the doctrine of lapse. At the time of British annexation, the kingdom consisted of parts of Nagaon and Karbi Anglong; North Cachar (Dima Hasao), Cachar and the Jiri frontier of Manipur.\nRulers\n{| class=\"wikitable\"\n|+ The Kings of Dimasa kingdom\n! Capital\n! King\n! Date of Accession\n! Reign in Progress\n! End of reign\n|-\n! rowspan=\"6\" |Dimapur\n| Mahamanipha\n|\n|\n|\n|-\n| Manipha\n|\n|\n|\n|-\n| Ladapha\n|\n|\n|\n|-\n| Khorapha (Viravijay Narayana?)\n|\n|1520?\n|1526\n|-\n| Khuntara\n|1526\n|\n|1531\n|-\n| Detsung/Dersung\n|1531\n|\n|1536\n|-\n| Interregnum?\n|\n|\n|\n|-\n! rowspan=\"17\" | Maibong\n| Nirbhay Narayan\n| 1558?\n| 1559\n|\n|-\n| Durlabh Narayan\n|\n|\n|\n|-\n| Megha Narayan\n| 1568\n| 1578\n| 1583?\n|-\n| Yasho Narayan (Satrudaman)\n| 1583?\n|\n| 1601\n|-\n| Indrapratap Narayan\n| 1601\n| 1610\n|\n|-\n| Nar Narayan\n|\n|\n|\n|-\n| Bhimdarpa Narayan\n|\n| 1618?\n|\n|-\n| Indraballabh Narayan\n| 1628\n|\n| 1644?\n|-\n| Birdarpa Narayan\n| 1644?\n|\n| 1681\n|-\n| Garurdhwaj Narayan\n| 1681\n|\n| 1695\n|-\n| Makardhwaj Narayan\n| 1695\n|\n|\n|-\n| Udayaditya\n|\n|\n|\n|-\n| Tamradhwaj Narayan\n|\n| 1706\n| 1708\n|-\n| Suradarpa Narayan\n| 1708\n|\n|\n|-\n| Harischandra Narayan -1\n|\n| 1721\n|\n|-\n| Kirtichandra Narayan\n|\n| 1736\n|\n|-\n| Sandikhari Narayan alias Ram Chandra\n|\n| 1736\n|\n|-\n! rowspan=\"7\" |Khaspur\n| Harischandra-2\n|\n| 1771\n|\n|-\n| Lakshmichandra Narayan\n| 1772\n|\n|\n|-\n| Krishnachandra Narayan\n|\n| 1790\n| 1813\n|-\n| Govindachandra Narayan\n| 1814\n|\n| 1819\n|-\n|-\n| Govindachandra Narayan\n| 1824\n|\n| 1830\n|-\n| British Annexation\n|\n| 1832\n|\n|}\nNotes\nReferences\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*"
    }
  ]
}