{
  "content": [
    {
      "type": "text",
      "text": "# Dina Kawar\n\n|term_end=\n|predecessor= Alia Hatough Bouran\n|successor=\n|office2=Jordanian Permanent Representative to the United Nations in New York City\n|term_start2=\n|term_end2=\n|predecessor2= Prince Zeid bin Ra'ad\n|successor2= Sima Sami Bahous\n|office3=Jordanian Ambassador to France\n|term_start3=\n|term_end3=\n|predecessor3=Adnan Bahjat Al-Talhouni\n|successor3=Makram Mustafa Queisi\n| native_name = }}\n| birth_name    =\n| birth_place   = Amman, Jordan\n| death_date    =\n| death_place   =\n| nationality   =\n| other_names   =\n| occupation    = Diplomat\n| years_active  =\n| known_for     =\n| notable_works =\n| education       =\n| alma_mater      =  Mills CollegeColumbia University\n}}\nDina Kawar () is a Jordanian diplomat who since June 2016 has served as Ambassador of the Hashemite Kingdom of Jordan to the United States.\nAmbassador Kawar also served as the Permanent Representative of Jordan to the United Nations from August 2014 to June 2016. She has led the Jordanian delegation during Jordan's non-permanent membership of the United Nations Security Council from 2014 to 2015 and became the first Arab woman to ever preside over the council. In February 2016, she was appointed by the President of the General Assembly as a co-facilitator for the high-level meeting of the plenary of the General Assembly on the large movement of refugees and migrants that tool place in September 2016.\nPrior to her position in New York, Her Excellency Dina Kawar served as the Ambassador of Jordan to France from 2001 to 2013, with concurrent accreditation to the United Nations Educational, Scientific and Cultural Organization (UNESCO) and to the Holy See, since 2002.  She also served as Ambassador of Jordan to Portugal from 2005 to 2013.\nAmbassador Kawar was awarded the Medal of Independence of the first degree by His Majesty King Abdulla II of Jordan and holds a number of decorations including the “Commandeur De La Legion d’ Honneur\" from France, the “Medalha de D. Afonso Henriques” from Portugal and the “Insignes de Dame de Grand-Croix de l’Ordre de Saint Grégoire le Grand” from the Holy See.\nBiography\nKawar received her higher education in the United States where she got a bachelor's degree in international relations from Mills College and a master's degree in international affairs from Columbia University and attended Harvard's Center for international affairs in 1986.\nFrom 1985 to 1990, Kawar was appointed as the head of Prince Hassan's office in Amman, later heading the Paris office of the Bureau de S.A.R Prince Hassan from 1991 to 2000. In 2000, she became Director of Bureau Privé de Sa Majesté le Roi Abdullah II in Paris. Kawar served as the Ambassador of Jordan to France from 2001 to 2013, with frequent accreditation to the United Nations Educational, Scientific and Cultural Organization (UNESCO) and to the Holy See and to Portugal.\nKawar was appointed as the Permanent Representative of the Hashemite Kingdom of Jordan to the United Nations in August 2014, replacing Prince Zeid who became the High Commissioner of the Office of the United Nations for Human Rights. She has led the Jordanian delegation during Jordan's non-permanent membership of the United Nations Security Council between 2014 and 2015, and became the first Arab woman and first Arab Christian to ever preside over the council. In February 2016, she was appointed by the President of the General Assembly as a co-facilitator for a meeting in the General Assembly on the large movement of refugees and migrants to take place in September 2016.\nKawar is married to Vincent Cortes. She speaks Arabic, English, and French.\nHonours\n*  :\n**  Grand Master of the Order of Independence (2003)\n*\n**  Grand Officer of the Order of St. Gregory the Great (2004)\n*\n**  Grand Master of the Medalha de D. Afonso Henriques (2009)\n* :\n**  Grand Master of the Legion of Honour medal (2013)\nSee also\n*Christianity in Jordan\nReferences\nExternal links\n*[https://mfa.gov.jo/en/embassy/Washington/ambassador/49/ambassador-dina-kawar The Embassy of the Hashemite Kingdom of Jordan Washington, DC: Ambassador Dina Kawar]"
    }
  ]
}