{
  "content": [
    {
      "type": "text",
      "text": "# Dinosaur National Monument\n\n| photo = Dinosaur National Monument Camarasaurus.jpg\n| photo_caption = A dinosaur skull embedded in rock at Dinosaur National Monument\n| location = Moffat County, Colorado and Uintah County, Utah, U.S.\n| nearest_city = Vernal, Utah\n| coordinates =\n| map = USA\n| map_caption = Location in the United States\n| area_acre = 210844\n| established  = October 4, 1915\n| visitation_num = 304,468\n| visitation_year =2018\n| visitation_ref =\n| governing_body = U.S. National Park Service\n| website = [https://www.nps.gov/dino/index.htm Dinosaur National Monument]\n}}\nDinosaur National Monument is an American national monument located on the southeast flank of the Uinta Mountains on the border between Colorado and Utah at the confluence of the Green and Yampa rivers. Although most of the monument area is in Moffat County, Colorado, the Dinosaur Quarry is located in Utah, north of the town of Jensen, Utah. The nearest Colorado town is Dinosaur while the nearest city is Vernal, Utah.\nOriginally preserved in 1915 to protect its famous Dinosaur Quarry, the monument was greatly expanded in 1938 to include its wealth of natural history. The park's wild landscapes, topography, geology, paleontology, and history make it a unique resource for both science and recreation. The park contains over 800 paleontological sites and has fossils of dinosaurs including Allosaurus, Deinonychus, Abydosaurus, and various sauropods. The Abydosaurus consists of a nearly complete skull, the lower jaw, and first four neck vertebrae. The specimen was found at the base of the Mussentuchit Member of the Cedar Mountain Formation and is the holotype for the species.\nPaleontologist Earl Douglass of the Carnegie Museum discovered eight vertebrae of an Apatosaurus on August 17, 1909, which became the first dinosaur skeleton discovered and excavated at the new Carnegie Quarry. The area around the quarry was declared a national monument on October 4, 1915. The International Dark-Sky Association designated Dinosaur National Monument an International Dark Sky Park in April 2019.\nGeology\n]]\nThe rock layer enclosing the fossils is a sandstone and conglomerate bed of alluvial or river bed origin known as the Morrison Formation from the Jurassic Period some 150 million years old. The dinosaurs and other ancient animals were carried by the river system which eventually entombed their remains in Utah.\nThe pile of sediments were later buried and lithified into solid rock. The layers of rock were later uplifted and tilted to their present angle by the mountain building forces that formed the Uinta Mountains during the Laramide orogeny. Erosion later exposed the layers at the surface to be found by paleontologists.\nHistory\nFremont people\nThe Fremont people lived in the area of what is now Dinosaur National Monument before the 14th century, with archaeological evidence dating from  200 to  1300. Archaeologists first studied and named the Fremont culture along the Fremont River in south-central Utah and have since traced it through much of the Green and Colorado River drainages.\nThe Fremont did not build large permanent dwellings; instead, they lived in small bands within natural shelters, such as rock overhangs or shallow caves, or small villages. They consumed plant foods, such as pine nuts, berries, and cactus fruits, as well as wild game, including mule deer, bighorn sheep, smaller mammals, and birds. They also grew corn, beans, and squash, sometimes using irrigation techniques.\nThe fate of the Fremont culture is unclear. Recent theories suggest that the Fremont's lifestyle may have changed due to drought or other climate factors, dwindling natural resources, or the influence of other neighboring cultures. They left evidence of their presence in the form of petroglyphs and pictographs of human and animal figures, and abstract designs. Human figures typically have trapezoidal bodies and elaborate decorations that suggest headdresses, earrings, necklaces, or shields. The animal figures include bighorn sheep, birds, snakes, and lizards. Purely abstract or geometric designs, such as circles, spirals, and various combinations of lines, are common. Many designs in the monument are accessible for close viewing, along four trails in Utah, one of which is near the visitor center, and a fifth trail in Colorado.\nEarly scientific explorations\nThe dinosaur fossil beds (bone beds) were discovered in 1909 by Earl Douglass, a paleontologist working and collecting for the Carnegie Museum of Natural History. He and his crews excavated thousands of fossils and shipped them back to the museum in Pittsburgh, Pennsylvania for study and display.\nNational monument\nPresident Woodrow Wilson proclaimed the dinosaur beds as Dinosaur National Monument in 1915. The monument boundaries were expanded in 1938 from the original  surrounding the dinosaur quarry in Utah, to  in Utah and Colorado, encompassing the river canyons of the Green and Yampa.\nEcho Park Dam controversy\nThe plans made by the U.S. Bureau of Reclamation on a ten-dam, billion dollar Colorado River Storage Project began to arouse opposition in the early 1950s when it was announced that one of the proposed dams would be at Echo Park, in the middle of Dinosaur National Monument. The controversy assumed major proportions, dominating conservation politics for years. David Brower, executive director of the Sierra Club, and Howard Zahniser of The Wilderness Society led an unprecedented nationwide campaign to preserve the free-flowing rivers and scenic canyons of the Green and Yampa Rivers. They argued that if a national monument was not safe from development, how could any wildland be kept intact?\nOn the other side of the argument were powerful members of Congress from western states, who were committed to the project in order to secure water rights, obtain cheap hydroelectric power and develop reservoirs as tourist destinations.  After much debate, Congress settled on a compromise that eliminated Echo Park Dam and authorized the rest of the project.  The Colorado River Storage Project Act became law on April 11, 1956.  It stated, \"that no dam or reservoir constructed under the authorization of the Act shall be within any National Park or Monument.\"\nHistoric places\nPlaces on the list of National Register of Historic Places include:\n:Prehistoric sites\n:* Castle Park Archeological District, a prehistoric residential site with inhabition during 1500 - 1000 BC and again from AD 1000 - 1899 by the Prehistoric Fremont culture, Ute and Shoshone people.\n:* Mantle's Cave is a prehistoric Fremont culture residential site from 499 BC - AD 1749.\n:Other sites\n:*Josie Bassett Morris Ranch Complex\n:* Denis Julien Inscription\n:* Rial Chew Ranch Complex\n:* Upper Wade and Curtis Cabin\nGreen River Canyon in Dinosaur National Monument viewed west from Harper's Corner\nClimate\nThe Dinosaur National Monument sits on a vast area of desert land in Northwestern Colorado and Northeastern Utah. Typical of high deserts, summer temperatures can be exceedingly hot, while winter temperatures can be very cold. Snowfall is common, but the snow melts rapidly in the arid and sunny climates of these states. Rainfall is very low, and the evaporation rate classifies the area as desert, even though the rainfall exceeds 10&nbsp;inches.\n|date=April 2011\n}}\nFeatures\nThe quarry\nThe \"Wall of Bones\" located within the Dinosaur Quarry building in the park consists of a steeply tilted (67° from horizontal) rock layer which contains thousands of dinosaur fossils. The preserved section is only a portion of what was originally present when Douglass made his discovery as seen on the map above. When work ceased in 1922, a portion of the quarry was left for future development. This work began as part of President Franklin Roosevelt's Civil Works Administration, which provided employment during the Depression under the Transient Relief Service and later under the Works Progress Administration. This work included constructing a road to the quarry, removal of overburden covering the bone-bearing strata, and building of a small, temporary museum. World War II interrupted work, but this was resumed in 1951 with the building of a small metal building over the east portion of the quarry to test whether bone was abundant enough to warrant a larger, more permanent building. This more permanent building was erected in the mid-1950s as part of the National Park Service Mission 66 plan. The architectural design was high controversial for its ultra-modern use of glass, steel and concrete ramp that spiraled around a cylindrical office tower. The building opened at the dedication ceremony on June 1, 1958. The design had two levels and abundant natural light so that visitors could watch technicians remove the hard rock to reveal the excavated fossil bones in-situ.\nIn July 2006, the Quarry Visitor Center was closed due to structural problems that since 1958 had plagued the building because it was built on unstable clay. The decision was made to build a new facility elsewhere in the monument to house the visitor center and administrative functions, making it easier to resolve the structural problems of the quarry building while still retaining a portion of the historic Mission 66 era exhibit hall. It was announced in April 2009 that Dinosaur National Monument would receive $13.1 million to refurbish and reopen the gallery as part of the Obama administration's $750 billion stimulus plan. The Park Service successfully rebuilt the Quarry Exhibit Hall, supporting its weight on 70-foot steel micropile columns that extend to the bedrock below the unstable clay. The Dinosaur Quarry was reopened in Fall 2011.\nFossils from Carnegie Quarry\n:Now enclosed by the Dinosaur Quarry building (Gilmore (1936), Foster (2003); Good (2004).\n;Planta\n:Coniferophyta\n;Mollusca\n:Unio sp.\n:Vetulonia sp.\n;Reptilia\n:Testudines\n::Glyptops plicatus\n::Dinochelys whitei\n:Rhynchocephalia\n::Opisthias rarus\n:Pseudosuchia\n::Goniopholis sp.\n::Hoplosuchus kayi (h)\n;Dinosauria\n:Saurischia\n::Theropoda\n:::Ceratosaurus sp.\n:::Torvosaurus sp.\n:::Allosaurus fragilis\n::Sauropoda\n:::Apatosaurus louisae (h)\n:::Barosaurus lentus\n:::Camarasaurus lentus\n:::Diplodocus hallorum\n:::Athenar bermani (h)\n:Ornithischia\n::Stegosauria\n:::Stegosaurus ungulatus\n::Ornithopoda\n:::Camptosaurus aphanoecetes (h)\n:::Dryosaurus elderae (h)\n:(h) = holotype\nSee also\n*\n* List of national monuments of the United States\nReferences\nFurther reading\n*\n*\n*\n*\n*\n* Kenneth Carpenter (2018). [http://gcr.khuisf.ac.ir/article_539322_ee568e73aed43abe54f3b6c2df0d9b25.pdf Rocky Start of Dinosaur National Monument (USA), The World's First Dinosaur Geoconservation Site]. Geoconservation Research 1(1): 1-20. doi: [http://gcr.khuisf.ac.ir/article_539322.html Rocky Start of Dinosaur National Monument (USA), The World's First Dinosaur Geoconservation Site]\nExternal links\n*\n*\n*"
    }
  ]
}