{
  "content": [
    {
      "type": "text",
      "text": "# Diplomatic expulsions during the Russo-Ukrainian war__disambig_1\n\nIn the context of the Russo-Ukrainian War, many Russian diplomats and embassy officials were declared personae non gratae by countries around the world in 2022, and many foreign diplomats were also formally asked to leave Russia after their accreditation was cancelled.\nPersona non grata means \"an unwelcome person\" in Latin. In the context of diplomacy or international relations, a persona non grata declaration on a foreign citizen, usually a diplomat who otherwise has a privilege of immunity, is barred from entering the country which issued the declaration.\nRussian diplomatic posts\nIn 2018 Russia provided diplomatic cover in 145 countries with 242 diplomatic posts (embassies, consulates and trade missions).\n2022 invasion of Ukraine\nThe Russian invasion of Ukraine in 2022 resulted in an unprecedented reaction in diplomatic circles against Russian diplomats; over 200 were expelled by 5 April 2022, just days after the disclosure of the killing of civilians in the Bucha massacre. The declared intention was to limit Russia's ability to destabilize the EU and NATO countries.\nThe decisions came after a dramatic increase in Russian malign activities, including the 2018 Novichok poisoning of Sergei and Yulia Skripal, and a number of countries, were led by the United Kingdom, which expelled 16 diplomats, and the United States, which expelled 60 diplomats it claimed were intelligence officers. Sixteen EU countries expelled 33 Russian diplomats on 26 March 2018. Over 150 Russian diplomats were expelled in 2018.\nThe UK did not participate in the 2022 expulsions as it had already reduced the Russian embassy size in 2018 and reduced staffing at its embassy in Moscow. Canada and Australia gave similar reasons.\nRussia initially responded that these actions were short-sighted and would further complicate communications and inevitably lead to retaliation. Sergey Lavrov, Russia's Minister of Foreign Affairs, lamented in October 2022 that \"There is neither point nor desire to maintain the previous presence in Western states. Our people work there in conditions that can hardly be called human,\" “Most importantly, there’s no work to do since Europe decided to shut off from us and sever any economic cooperation. You can’t force love.\"\nWithin a year, around 600 diplomats from Russia would be expelled.\nDetails\nRussian diplomats expelled between February and May 2022 and retaliatory expulsions in March to May 2022 by Russia.\n{| class= \"wikitable\" align=\"center\"\n|-\n! width=\"8%\" | Country\n! width=\"10%\" | Diplomats expelled\n! Background\n! width=\"7%\" |\n! width=\"15%\" | Response from Russia\n!\n|-\n|\n| 4\n| \"acting in a manner inconsistent with their diplomatic status.”\n|\n| 4 expelled\n|\n|-\n|\n| 21\n| For their involvement in espionage and activities threatening the country's security,\n|\n| 21 expelled\n|\n|-\n|\n| 2 + 10 + 2\n| First Secretary plus others, some being accused of being involved in espionage\n|\n| 1 expelled\n|\n|-\n|\n|18\n| Due to Russia's military offensive against Ukraine\n|\n| 5 expelled\n|\n|-\n|\n| 1\n| Russia's deputy ambassador\n|\n| 1 expelled\n|\n|-\n|\n| 15\n| \"intelligence officers\" posing as diplomats\n|\n| 4 expelled\n|\n|-\n|\n| 3\n|chargé d’affaires Sergey Nalobin and two attachés\n|\n| 3 expelled\n|\n|-\n|\n| 2\n| In condemnation of Russia's aggressions against Ukraine.\n|\n| 2 expelled\n|\n|-\n|\n| 35 + 6\n| 35 whose activities are against our security interests. 6 accused of being involvement in espionage\n|\n| 34 expelled\n|\n|-\n|\n| 40\n| In response to the discovery of apparent mass graves and executed civilians in Bucha, and seeking to end all trade relations with Russia. Russian diplomats have \"worked every day here in Germany against our freedom\" and \"against the cohesion of our society.”\n|\n| 40 expelled\n|\n|-\n|\n| 12\n| personae non gratae\n|\n| 8 expelled\n|\n|-\n|\n| 4\n| Activities deemed not \"in accordance with international standards of diplomatic behavior”\n|\n| 2 expelled\n|\n|-\n|\n| 30\n| \"national security\" concerns\n|\n| 24 expelled\n|\n|-\n|\n| 8\n| Moscow must be held accountable for war crimes in Ukraine\n|\n| 8 expelled\n|\n|-\n|\n| 3\n| Activities at odds with their diplomatic status\n|\n| 3 expelled\n|\n|-\n|\n| 4\n| \"In solidarity with Ukraine.\" Including Russia's ambassador\n|\n| 4 expelled\n|\n|-\n|\n| 1\n| In solidarity with EU states.\n|\n| warning\n|\n|-\n|\n| 1\n| National security agency's suggestion\n|\n| 1 expelled\n|\n|-\n|\n| 17\n| Intelligence officers masquerading as diplomats\n|\n| 15 expelled\n|\n|-\n|\n| 5 + 6\n| Violated diplomatic norms\n|\n| none\n|\n|-\n|\n| 3\n| Conducted activities that were incompatible with their diplomatic status.\n|\n| 3 expelled\n|\n|-\n|\n| 45\n| Identified as intelligence officers\n|\n| 45 expelled\n|\n|-\n|\n| 10\n| Persona non grata\n|\n| 5 expelled\n|\n|-\n|\n| 10\n| \"The repeated use by the Russian mission of inappropriate, offensive and provocative language directed at Romania and NATO is unacceptable”\n|\n| 10 expelled\n|\n|-\n|\n| 35\n| Expelled after several accusations of espionage\n|\n| 3 expelled\n|\n|-\n|\n| 33\n|  \"the strongest protest\" against the killings of civilians by Russian forces in Bucha and other towns.\n|\n| 4 expelled\n|\n|-\n|\n| 25\n| Over Russia's \"terrible actions\"\n|\n| 27 expelled\n|\n|-\n|\n| 3\n| For spying\n|\n| 3 expelled\n|\n|-\n|\n| 12\n| UN diplomats accused of \"espionage activities\" at embassy\n|\n|\n|\n|-\n|}\nPost June 2022\nAdditional Russian diplomats were declared personae non gratae later in 2022, including 70 by Bulgaria, for espionage, and by Australia, where a spy ring was uncovered, taking the total to nearly 600 by January 2023, with additional tit-for tat removals of diplomats by Russia.\nThe operation of Russian embassies has become more difficult. Problems experienced include bank account access in the US, flights, visas and the downsizing of previously agreed staffing levels.\nIn September 2022 Montenegro expelled six Russian diplomats uncovered in an investigation into spying, Russia responded by closing their consulate in Podgorica, Montenegro, leaving just an honorary consul in Budva.\nIn December 2022 diplomatic relations between Lithuania and Russia were downgraded to the level of acting Chargé d'affaires after the Russian ambassador was expelled and the Lithuanian ambassador recalled.\nIn January 2023 Russia expelled the Estonian ambassador, resulting in Estonia expelling the Russian ambassador in their country and Latvia, in a show of solidarity, doing likewise to the Russian ambassador in Latvia, which provoked a similar response from Moscow regarding the Latvian ambassador.\nThe Netherlands closed its consulate in St Petersburg in February 2023 and along with a number of countries limited the number of Russian Embassy staff to the same as their country's embassy in Moscow.\nBy March 2023 8 Russian diplomats had been added to Serbia's total of accredited diplomats, a number of these had been expelled from other EU countries.\nSwitzerland considers 1 in 3 of the 221 Russian diplomats are spies but did not expel any Russian diplomats in 2022 although one resigned because of his disagreement with Moscow.\nIn April 2023 Norway reduced the number of Russian diplomats by expelling 15, followed by Germany with mass expulsions, reputed to be 30, and reducing the number of authorised diplomats in the country  and closing four of the five Russian Consulates in Germany.\nIn June 2023 Iceland suspended its embassy in Moscow and asked Russia to reduce their embassy in Reykjavik until relations are normalised. Finland expels 9 believed to be intelligence gathering. Romania also told Russia to reduce its embassy staff by 51, because of vacancies, 40 diplomats and technical staff departed in early July. Moldova then evicted 45 Russian diplomats, reducing the embassy to 25, the same as the Moldovan embassy in Moscow.\nAustralia passed laws to cancel a lease in June 2023 to block Russia building a new Embassy within 400m of the Australian parliament building, citing concerns of spying. In addition, Australia is reportedly considering expelling the Russian ambassador to Australia, over concerns Australian man Oscar Jenkins has reportedly been killed after being captured by Russia while fighting for Ukraine.\nEffect of expulsions\nKremlin intelligence agencies have suffered a major blow as a result of the expulsion of intelligence agents who had been working in embassies. The head of Britain's MI6 foreign intelligence service believed that roughly half of Russia's spies in Europe, working under diplomatic cover, were expelled by July 2022. Ken McCallum, the director general of Britain's MI5, said in November 2022 in an annual speech outlining threats to the United Kingdom that this year 400 of the 600 Russians officials that had been expelled from Europe, were judged by his agency to be spies.\nFinland was able to get \"espionage issues under control\" after the expulsion of Russian diplomats.\nSee also\n* Russian spies in the Russo-Ukrainian War\n* Poisoning of Sergei and Yulia Skripal\n* List of people and organizations sanctioned during the Russo-Ukrainian War\n* Foreign relations of Russia\nReferences"
    }
  ]
}