{
  "content": [
    {
      "type": "text",
      "text": "# Directorate of Military Intelligence (United Kingdom)\n\nThe Directorate of Military Intelligence (DMI) was a department of the British War Office.\nOver its lifetime the Directorate underwent a number of organisational changes, absorbing and shedding sections over time.\nHistory\nThe first instance of an organisation which would later become the DMI was the Department of Topography & Statistics, formed by Major Thomas Best Jervis, late of the Bombay Engineer Corps, in 1854 in the early stages of the Crimean War.\nIn 1873 the Intelligence Branch was created within the Quartermaster General's Department with an initial staff of seven officers. Initially the Intelligence Branch was solely concerned with collecting intelligence, but under the leadership of Henry Brackenbury, a protege of influential Adjutant-General Lord Wolseley, it was increasingly concerned with planning. However, despite these steps towards a nascent general staff, the Intelligence Branch remained a purely advisory body, something that sharply limited its influence. The Branch was transferred to the Adjutant General's Department in 1888 and Brackenbury's title was changed to Director of Military Intelligence.\nAfter Wolseley's appointment as Commander-in-Chief of the Forces in 1895, he made the Director of Military Intelligence directly responsible to him. At the outbreak of the Second Boer War in 1899 the Intelligence Branch had 13 officers. Prior to the war it produced a highly accurate summary of the Boer republics' military potential and was the only part of the War Office to escape criticism in the resulting Royal Commission. In the immediate aftermath of the Boer War the Intelligence Branch was enlarged and its head elevated to Director General of Mobilisation and Military Intelligence.\nFollowing the Esher Report in 1904 the War Office was dramatically reorganized. The post of Commander-in-Chief was abolished and replaced by the Chief of the General Staff. Planning and intelligence would be the responsibility of the Directorate of Military Operations.\nWhen the War Office was subsumed into the Ministry of Defence (MoD) in 1964, the DMI was absorbed into the Defence Intelligence Staff.\nSections\nDuring World War I, British secret services were divided into numbered sections named Military Intelligence, department number x, abbreviated to MIx, such as MI1 for information management.\nThe branch, department, section, and sub-section numbers varied through the life of the department; examples include:\n{| class=\"wikitable\"\n! Name\n! World War I\n! World War II\n!Current status\n|-\n| MI1\n| Secretariat, including:\n* MI1b: Interception and cryptanalysis.\n* MI1c: The Foreign Section of the Secret Service Bureau.\n| Administration\n|Reorganized around 1919MI1b is an ancestor of GCHQ\n|-\n| MI2\n| Geographical information (Americas, Latin countries, Balkans, Ottoman Empire, Trans-Caucasus, Arabia, Africa lesser French and Spanish possessions)\n| Information on Middle and Far East, Scandinavia, US, USSR, Central and South America.\n|These functions were absorbed into MI3 in 1941.\n|-\n| MI3\n| Geographical Information (rest of European countries)\n| Information on Eastern Europe and the Baltic states (plus USSR, Scandinavia and Finland after summer 1941).\n|Functions absorbed into MI6 in 1945\n|-\n| MI4\n| Topographical information and military maps\n| Geographical section—maps.\n|Transferred to Military Operations in April 1940\n|-\n| MI5\n| Counter-espionage and military policy in dealing with the civil population (the former Home Section of the Secret Service Bureau)\n| Liaison with the Security Service (counterintelligence)\n|Active\n|-\n| MI6\n| Legal and economic section dealing with the MI finance as well as economic intelligence and personnel records. Monitoring arms trafficking.\n| Liaison with Secret Intelligence Service\n|Active\n|-\n| MI7\n| Press censorship and propaganda\n| Press and propaganda\n|Transferred to the Ministry of Information in around May 1940.\n|-\n| MI8\n| Cable censorship\n| Signals interception and communications security.\n|Ran until 1961.\n|-\n| MI9\n| Postal censorship\n| Escaped British PoW debriefing, escape and evasion (also: enemy PoW interrogation until 1941).\n|Operated until 1945\n|-\n| MI10\n| Foreign Military Attaches\n| Technical Intelligence worldwide\n|Merged into MI16 after World War II\n|-\n| MI11\n|\n| Military Security.\n|Disbanded at the end of WWII\n|-\n| MI12\n|\n| Liaison with censorship organisations in Ministry of Information, military censorship.\n|\n|-\n| MI13\n|\n| (Not used)\n|\n|-\n| MI14\n|\n| Germany and German-occupied territories (aerial photography).\n|Operated until spring 1943\n|-\n| MI15\n|\n| Aerial photography. In the spring of 1943, aerial photography moved to the Air Ministry and MI15 became air defence intelligence.\n|Operated during the World War II era.\n|-\n| MI16\n|\n| Scientific Intelligence (formed 1945).\n|\n|-\n| MI17\n|\n| Secretariat for Director of Military Intelligence from April 1943.\n|\n|-\n| MI18\n|\n| (Not used)\n|\n|-\n| MI19\n|\n| Enemy prisoner of war interrogation (formed from MI9 in December 1941).\n|Operated during the World War II era.\n|-\n| Others\n| MIR: Information on Russia, Siberia, Central Asia, Persia, Afghanistan, China, Japan, Thailand and India\n| : ″Axis planning staff″ related to Joint Intelligence Staff, a sub-group of the Joint Intelligence Committee.\n|\n|-\n|\n|\n| : Attaches.\n|\n|-\n|\n|\n| : Russian Liaison.\n|\n|}\nTwo MI section-names remain in common use, MI5 and MI6, in most part due to their use in spy fiction and the news media.\n\"MI5\" is used as the short form name of the Security Service, and is included in the agency's logo and web address. MI6 is included as an alias on the Secret Intelligence Service website, though the official abbreviation, SIS, is predominant.\nWhile the names remain, the agencies are now responsible to different departments of state, MI5 to the Home Office, and MI6 the Foreign Office.\nDirectors of Military Intelligence\nDirectors of Military Intelligence have been:\nDeputy Quartermaster General, Intelligence Branch\n* 1873–1878 Patrick Leonard MacDougall\n* 1878–1882 Archibald Alison\n* 1882–1886 Aylmer Cameron (Assistant Quartermaster General, Intelligence Branch)\n* 1886–1888 Henry Brackenbury\nDirector of Military Intelligence\n* 1888–1891 Henry Brackenbury\n* 1891–1896 Edward Francis Chapman\n* 1896–1901 John Charles Ardagh\nDirector General of Mobilisation and Military Intelligence\n* 1901–1904 William Nicholson\nDirector of Military Operations\n* 1904–1906 James Grierson\n* 1906–1910 Spencer Ewart\n* 1910–1914 Henry Wilson\n* 1914–1915 Charles Callwell\nDirector of Military Intelligence\n* 1915–1916 Charles Callwell\n* 1916–1918 George Mark Watson Macdonogh\n* 1918–1922 William Thwaites\nDirector of Military Operations and Intelligence\n* 1922–1923 William Thwaites\n* 1923–1926 John Burnett-Stuart\n* 1926–1931 Ronald Charles\n* 1931–1934 William Henry Bartholomew\n* 1934–1936 John Greer Dill\n* 1936–1938 Robert Hadden Haining\n* 1938–1939 Henry Royds Pownall\nDirector of Military Intelligence\n* 1939–1940 Frederick Beaumont-Nesbitt\n* 1940–1944 Francis Henry Norman Davidson\n* 1944–1945 John Sinclair\n* 1945–1946 Freddie de Guingand\n* 1946–1948 Gerald Templer\n* 1948–1949 Douglas Packard\n* 1949–1953 Arthur Shortt\n* 1953–1956 Valentine Boucher\n* 1956–1959 Cedric Rhys Price\n* 1959–1962 Richard Eyre Lloyd\n* 1962–1965 Marshall St John Oswald\nTimeline\n* 30 Apr 1741 — Royal Academy at Woolwich established under the Board of Ordnance by royal warrant, to train artillery and engineer cadets\n* 1764 — Renamed Royal Military Academy\n* 1801 — Royal Military College established by the Duke of York for infantry and cavalry officer training\n* 1802 —\n** Junior Department founded at Great Marlow\n** Senior Department for advanced officer training at High Wycombe\n* 1803 — Military Depot created within the Quartermaster General’s branch at Horse Guards, authorized by the Secretary-at-War to collect maps and military knowledge\n* 1812 — New premises for the Royal Military College opened at Sandhurst\n* Jan 1855 — Topographical Department (or Depot) established after the Crimean War to address deficiencies in overseas mapping\n* Apr 1858 — The declining Military Depot absorbed into the Topographical Department; its books transferred to the new War Office Library\n* 1857 —\n** Control of the Royal Military Academy and Royal Military College passed to the Council of Military Education\n** Senior Department became the Staff College, which later moved to Camberley (1883)\n* 1870 —\n** Ordnance Survey transferred to the Office of Works\n** overseas survey duties remained with the Commander-in-Chief’s Topographical Department\n* 1873 — Formation of the Intelligence Branch within the Commander-in-Chief’s Military Department, with a subordinate Topographical Section\n* 1887–1888 — Intelligence Branch reorganized as the Military Intelligence Division of the Military Department with six sections:\n** A–C: regional intelligence\n** D: Asia and cipher work\n** E: Austria, Near & Middle East, non-colonial Africa\n** F: maps, printing, and library work\n* 1895 — Intelligence Branch remained under the Commander-in-Chief’s Department after further restructuring\n* 1899 — Section H added for internal security, censorship, and special duties\n* 1901 — Intelligence Branch merged with the Mobilisation Subdivision to form the Military Intelligence and Mobilisation Department; Director-General of Military Intelligence given a seat on the Army Board\n* 1904 —\n** Office of Commander-in-Chief abolished\n** New post of Chief of the General Staff (CGS) created, assuming duties of the Director-General of Mobilisation and Intelligence\n** Directorate of Military Operations (DMO) established within the CGS Department (replacing the Intelligence and Mobilisation Department)\n** Home Defence transferred to the Directorate of Military Training\n*** Mobilisation to the Adjutant-General’s Department\n* 1906 — General Staff India formed\n* Apr 1908 — MO 1 relieved of responsibility for military history (passed to the Historical Section of the Committee of Imperial Defence)\n* Oct 1908 — MO 4 renamed Geographical Section, General Staff\n* 22 Nov 1909 — Title Chief of the General Staff changed to Chief of the Imperial General Staff (CIGS)\n* 1915 — Deputy Chief of the Imperial General Staff (DCIGS) established\n* 1914–1918 — A separate Directorate of Military Intelligence (DMI) formed during the war\n* 1922 —\n** DMO and DMI reunited as the Directorate of Military Operations and Intelligence.\n** DCIGS post lapsed\n* 1924 — CIGS becomes a permanent member of the Chiefs of Staff Committee (Imperial Defence and War Cabinet)\n* 1937 — Post of Deputy Chief of the Imperial General Staff revived\n* 1939 — On outbreak of World War II, DMO&I divided again into:\n** Directorate of Military Operations and Plans (DMO&P)\n** Directorate of Military Intelligence (DMI)\n* 1940 — Vice Chief of the Imperial General Staff (VCIGS) created\n* 1943 — DMO&P split into:\n** Directorate of Military Operations\n** Directorate of Plans\n** Directorate of Military Survey (successor to the original Topographical Department)\n** DMI continued separately\n*** censorship responsibilities transferred in May 1940 to the Postal and Telegraph Censorship Department under the Ministry of Information\n** Civil affairs work moved in 1943 to a new Directorate of Civil Affairs.\n* 1947 — Royal Military Academy (Woolwich) and Royal Military College (Sandhurst) merged into the Royal Military Academy Sandhurst.\n* 1964 — Formation of the unified Ministry of Defence; the title Chief of the Imperial General Staff reverted to Chief of the General Staff (CGS) — a title that continues today as the professional head of the British Army.\nReferences\nSources\n* , Oxford University Press\nFurther reading\n* The DMI in World War I: [https://web.archive.org/web/20060820014944/http://www.sis.gov.uk/output/Page470.html Link]"
    }
  ]
}