{
  "content": [
    {
      "type": "text",
      "text": "# Disability Futures Fellowship Award\n\nThe Disability Futures Fellowship Award is a grant award offered by the Ford and Mellon Foundations to promote disabled artists. Through the Fellowship, the Ford and Mellon Foundation offers fifty thousand dollars to twenty artists every 18 months, totaling one million dollars per cohort.\nInception\nThe Fellowship began with a year-long research study in collaboration with disabled artists to determine how the grant money could most effectively meet the needs of the recipients, led by then-President and Chief Executive of United States Artists, Deana Haggag. Feedback included an accessible application process, the ability to tailor the money to each recipient's individual needs, and flexible compensation that takes federal health benefit requirements into account.\nRecipients\n2020\nSource:\n* Alice Sheppard, choreographer\n* Alice Wong, activist, oral historian and founder of the Disability Visibility Project\n* Carolyn Lazard, multi-medium artist and recipient of the MacArthur Fellowship\n* Christine Sun Kim, sound artist\n* Eli Clare, writer and founder of the Queerness and Disability Conference\n* Jeffrey Yasuo Mansfield, design director at MASS Design Group\n* Jen Deerinwater, writer and photographer\n* Jerron Herman, choreographer, dancer, and writer\n* Jim LeBrecht, co-director, co-producer, and sound designer of Crip Camp\n* John Lee Clark, poet\n* Leah Lakshmi Piepzna-Samarasinha, writer and lead performing artist for Sins Invalid\n* Mia Mingus, writer and community organizer\n* Navild (Niv) Acosta, choreographer and multimedia artist\n* Patty Berne, author, artist, director, and cofounder of Sins Invalid\n* Perel, performance artist, dancer, choreographer, and writer\n* Riva Lehrer, painter, writer, and curator\n* Rodney Evans, filmmaker\n* Ryan J. Haddad, actor and playwright, best known as Andrew Cashman on The Politician\n* Sky Cubacub, fashion designer, founder of Rebirth Garments\n* Tourmaline, filmmaker, visual artist, and activist\n2024\nSource:\n* Kay Ulanday Barrett, poet and essayist\n* Gaelynn Lea, artist and disability rights activist\n* Natasha Ofili, actress and writer\n* Warren Snipe, a.k.a. Wawa, rapper and actor\nReferences\nExternal links\n*"
    }
  ]
}