{
  "content": [
    {
      "type": "text",
      "text": "# Disability culture\n\nDisability culture is a concept developed in the late 1980s to describe a unique  lifestyle shaped or influenced by disability, distinct from pathologizing discourses (i.e., concepts about disability that are derived from eugenics or the medical model). Some disabled people have mobilized this concept in order to reframe disability as an identity or as a cultural minority experience.  As described by disability historian, Dr. Steven E. Brown, disability culture is “a set of artifacts, beliefs, [and] expressions created by disabled people ourselves to describe our own life experiences. It is not primarily how we are treated, but what we have created.\"\nDeaf culture has an older history, having been described in 1965, and Deaf culture can be connected to the larger disability culture, both due to deafness being viewed by others as a disability, and many deaf people being both Deaf and disabled in other ways, which is known as being Deaf plus.\nDisability culture cannot be defined by one specific description or language. It is a complex blending of art, performance, expression, and community. Within this culture, the word \"disabled\" has been re-purposed to represent a social identity of empowerment and awareness. Like many civil rights movements in the past, disability culture challenges the norms of society, and seeks to counter oppressive entities such as medicalization and institutionalization. Its core values as a culture are reflected in art, conversation, goals, or behaviors. These core values often include: \"an acceptance of human differences, an acceptance of human vulnerability and interdependence, a tolerance for a lack of resolution of the unpredictable in life, and a humor to laugh at the oppressor or situation, however dire it may be\".\n\"The elements of our culture include, certainly, our longstanding social oppression, but also our emerging art and humor, our piecing together of our history, our evolving language and symbols, our remarkably unified world view, beliefs and values, and our strategies for surviving and thriving.\" -Carol Gill Ph.D.\nDisability culture is a trajectory, a movement, a path, rather than a destination: \"Disability culture is the difference between being alone, isolated, and individuated with a physical, cognitive, emotional or sensory difference that in our society invites discrimination and reinforces that isolation – the difference between all that and being in community. Naming oneself part of a larger group, a social movement or a subject position in modernity can help to focus energy, and to understand that solidarity can be found – precariously, in improvisation, always on the verge of collapse.\" - Petra Kuppers\n\"Disability Culture is the contributions, perspectives and art that comes from our different minds and bodies. Disability culture is the music, words and worldviews that come from the oppression that we face, that come from the exclusion that we face, that come from the erasure that we face. And it is rooted in problem solving. It is rooted in creative thinking. It is rooted in navigating the world differently. It is unapologetic; it is adaptable; it is innovative; and it is resilient. And it deserves to be celebrated.\" - Lachi\n\"Disability culture, which values interdependence over the illusion of independence, privileges not a uniform perspective but the validity and value of a wide range of ways of moving through the world - and the varied perspectives those different experiences engender.\" - Jim Ferris\nSee also\n*Disability in the arts\n*Disability in the media\n*Disability arts\n*Disability Flag\n*Disability rights movement\nReferences"
    }
  ]
}