{
  "content": [
    {
      "type": "text",
      "text": "# Discovery Park (Seattle)\n\n| area           =\n| established       =\n| operator       = Seattle Parks and Recreation\n| visitation_num =\n| status         =\n| designation    =\n| open           =\n}}\nDiscovery Park is a  park on the shores of Puget Sound in the Magnolia neighborhood of Seattle, Washington. As the city's largest public park, it contains  of walking trails. The Discovery Park Loop Trail, designated a National Recreation Trail in 1975, runs  through the park, connecting to other trails. Forests, beaches, prairies, and bluffs dominate the landscape of the park. Daybreak Star Cultural Center is within the park's boundaries. The West Point Lighthouse is located on West Point, the westernmost point of the park and the entire city of Seattle. On the south side of the North Beach strip is the West Point Treatment Plant which is almost entirely concealed from the marsh, beach, and trail.\nThe park is built on the historic grounds of Fort Lawton; most of the Fort Lawton Historic District (FLHD) falls within the park (an enclave within the district remains in military hands). Both the FLHD and the lighthouse are on the National Register of Historic Places.\nDescription\nleft\nThe park is one of the best places in the city to view wildlife, especially birds  and marine mammals.  The Seattle Audubon Society has compiled a checklist of 270 species of birds seen in the park and nearby waters.  Elliott and Shilshole Bays are home to harbor seals and California sea lions, while the wooded areas support Townsend's chipmunks. Most visitors enjoy hiking the Loop Trail, which forms a circuit through forest, meadow, and shrub habitats around the upland portion of the park, and provides excellent views of Puget Sound. Many historical buildings stand in semi disrepair in the main grassy area. The shoreline is accessible by road or trail (the hike back up from the north beach is mildly strenuous), however, a permit is required prior to driving a vehicle to the beach.  Free permits can be obtained at the Environmental Learning Center in the East Parking Lot and are designated for qualified individuals only (groups with children 7 and under, seniors 62+, and people with a physical disability).  The south beach is on the windward side of the peninsula, Elliott Bay, and the north beach is on the leeward side and has views of Shilshole Bay. At the point between the north and south beaches is West Point and the West Point Lighthouse.  Coniferous forest is mostly to be found in the north bluff region and can be accessed from the road that leads to the beach.  Deciduous woods surround the two parking lots and the visitor center.  Overlooking the south bluff is a large meadow with small trees and shrubs. Bigleaf maple, red alder, bitter cherry, Douglas-fir, western red cedar, and western hemlock make up a large percentage of the tree cover in the park. Invasive species such as Himalayan blackberry, Scot's broom, English ivy, and holly are present throughout, requiring active on-going management to suppress.\nHistory\npeninsular neighborhood in Seattle, facing north north west. The forested area is Discovery Park, with the brown area being the Fort Lawton Military Reserve.]]\nDiscovery Park was created in the early 1970s from land surplus to the U.S. Army's Fort Lawton. The site for the  fort had been given to the Army by the city in 1898, and the fort opened in 1900. The Army offered to sell it back to the city for one dollar in 1938 but the city refused, citing maintenance concerns. Much of the land was surplused in 1971, given to the city in 1972, and dedicated as Discovery Park in 1973 in honor of the British sloop HMS Discovery, commanded by Captain George Vancouver during the first European exploration of Puget Sound in 1792. Fort Lawton continued as an Army Reserve facility until it was officially closed at a ceremony on February 25, 2012.\nWest Point Lighthouse|left\nIn 2004, the City of Seattle announced it would purchase 23 (later 24) acres of U.S. Navy property within the park.  The decision was made to demolish the structures to create open space. In 2008, plans to close Army base Fort Lawton opened up debate over what to do with the former military properties: housing advocates wanted it converted into affordable housing, while some neighborhood groups opposed the idea. The City Council approved building up to 216 housing units, leading to a lawsuit. As of March 2009, the King County Superior Court Judge ordered the city to comply with the State Environmental Policy Act (SEPA) process.\nIn 2008, a group of homeless people and homeless rights advocates set up camp in the park, but was forced to vacate by the city.\nIn September 2010, the U.S Department of Housing and Urban Development (HUD) approved October 10, 2008 Proposed Redevelopment Plan and Homeless Assistance Application for the US Army Ft. Lawton Complex. The HUD letter to the mayor of Seattle stated the need for homeless housing outweighed the need for other redevelopment proposals and that 144 family housing units and over 2000 beds in \"supportive\" permanent housing should be built and that HUD was ready to assist the city of Seattle, if required.\nThe park attracts wild animals. In the winter of 2008-2009, a coyote in the park made headlines, and in May 2009, a black bear was seen.  In September 2009, the park was closed because of the presence of a cougar. The animal was trapped and transported to the Cascade mountains. A Fish and Wildlife representative stated that cougars can reach Discovery Park either by walking along the shoreline during low tide or by following the train tracks.\nThe beach has a history of sporadic clothing-optional use in the more remote areas of its shoreline. This use is not sanctioned by the city. A beach rally organized by The Body Freedom Collaborative's Seattle Free Beach Campaign on September 4, 2004 to shore support for clothing-optional use resulted in the arrest of a man sunbathing, after a complaint was made to the Seattle Police.\nIn 2026, Seattle plans to cut funding for environmental education programs by 50%, which may lead to the closure of the Discovery Park Visitor Center. The center, which serves over 45,000 people annually, is at risk unless a private operator is found. Nine staff positions are being eliminated, threatening the work of more than 90 volunteer naturalists who support public programs. Community advocates are urging city leaders to restore funding, but any reversal would require offsetting cuts or new revenue sources.\nIn popular culture\nThe Grunge band Temple of the Dog filmed the music video for their hit single \"Hunger Strike\" on the shores of Discovery Park.\nReferences\nExternal links\n*[http://www.seattle.gov/parks/environment/discovery.htm Official site], Seattle Department of Parks and Recreation\n*[https://www.fodp.org/ Friends of Discovery Park]\n*[http://www.sealsitters.org/ Seal Sitters (volunteer Harbor Seal pup watch group)]"
    }
  ]
}