{
  "content": [
    {
      "type": "text",
      "text": "# Discovery Channel (Australia and New Zealand)\n\nDiscovery is a television channel available on cable and satellite television in Australia and New Zealand. The Australian version of the US Discovery Channel was previously operated by XYZnetworks, who also own the exclusive distribution rights for the channel.\nThe channel was launched in July 1995, replacing the Quest documentary channel launched in April 1995 by XYZ.\nIt initially provided documentary television programming focused primarily on popular science, technology, and history, but by the 2010s had expanded into reality television and pseudo-scientific entertainment.\nDiscovery's most popular content includes Aussie Gold Hunters, Gold Rush, Deadliest Catch, and Fast N' Loud and annual event Shark Week. Programming is primarily focused on reality television series geared towards the topics of science, extreme living, and motoring.\nBoth Discovery and Discovery Turbo have timeshift channels, which rebroadcast programming 2 hours later on Foxtel.\nOriginal programming\n*Aussie Gold Hunters (since 2016)\n*Outback Opal Hunters (since 2018)\n* Railroad Australia (since 2016)\n*Saltwater Heroes (5 August 2015&nbsp;– 26 August 2015)\n*Sydney Harbour Patrol (2016)\n*Aussie Lobster Men (since 2019)\n* Dr Karl's Outrageous Acts of Science (since 2017)\n* Abalone Wars (since 2012)\nShark Week\nShark Week is an annual, week-long TV programming block on Discovery, which features 24/7 shark-based programming around the first week of December. Not only is Shark Week the best week of the year, it's also one of the most important as it raises awareness about the increasing threat faced by our ocean's greatest predator at the hands of humans and the environment. Now in its 25th year in Australia, the event also highlights recent developments in shark science and reveals remarkable new insight into these magnificent and misunderstood creatures.\nReferences\nExternal links\n*"
    }
  ]
}