{
  "content": [
    {
      "type": "text",
      "text": "# Discovery Travel & Living (Europe)\n\nDiscovery Travel & Living was a European television channel broadcasting to several countries in Europe. Much of the schedule was taken up by programmes about real estate, most notably A Place in the Sun and its spinoffs, as well as House Doctor.\nHistory\nOn 19 August 1998, Discovery announced they would launch several new digital channels to coincide with the launch of Sky Digital platform, one of which would be Discovery Travel and Adventure Channel, which launched on 1 October 1998. It featured more adventure-related programmes. In Italy, the channel was launched on Sky Italia in 2003 together with Discovery Civilisation Channel and Discovery Science. On 1 February 2005 it was repositioned and rebranded as Discovery Travel & Living as a part of a \"lifestyle\" package from Discovery Communications, also including Discovery Home & Health and Discovery Real Time. It would now heavily feature lifestyle programming about travel, food, design, architecture and luxury.\nA one-hour timeshifted version named Discovery Travel & Living +1 launched on Sky on 24 November 2008. The timeshift channel closed on 20 January 2009 to make way for the launch of Investigation Discovery.\nIn May 2009, the channel adopted a new logo and a new look and repositioned itself slightly.\nDiscovery Travel & Living started HDTV simulcasting on channel 406 on Sky Italia from 1 February 2012.\nRebrand\nFor most of the 2000s (decade), the channel was broadcasting one single version to all of Europe, except the United Kingdom and Italy with localised programming. From 2010, Discovery Networks replaced the Pan-European Discovery Travel & Living with localised TLC channels. The last feed of Travel & Living closed in Italy on 1 February 2019.\nThe following (TLC) channels have replaced the Pan-European version of Discovery Travel & Living.\n*TLC Poland (launched September 2009 as Travel & Living Poland, became TLC in October 2010)\n*TLC Norway (launched 4 March 2010)\n*TLC Balkans (launched 1 October 2010)\n*TLC Sweden (launched 2 December 2010)\n*TLC Romania (launched 20 January 2011)\n*On 4 July 2011, Investigation Discovery replaced Discovery Travel & Living in the Netherlands and Flanders but TLC also launched in the Netherlands on the same day.\n*TLC Denmark (launched 6 October 2011)\n*TLC Latvia (launched 20 February 2012)\n*Discovery Travel & Living closed along with Discovery Real Time in the UK and Ireland on 30 April 2013, to be replaced by Investigation Discovery +1.\n*Discovery Travel & Living closed along with Animal Planet in Italy on 1 February 2019.\nDistribution in Scandinavia\nIn the Nordic region, Canal Digital had exclusive rights to broadcast the channel on satellite. It became available from Canal Digital in September 1999 with Discovery Civilisation and Discovery Sci-Trek. Following a new contract signed in late 2005, Discovery Travel & Living was moved to Canal Digital's family package.\nDiscovery Travel & Adventure was given a license to broadcast in the terrestrial network in Sweden in early 2004. Broadcasting could commence on 26 April 2004. Following a license change in March 2008, Discovery Travel & Living would have to move to a new transmitter network that, at the time had not yet been built. Discovery Travel & Living stopped broadcasting terrestrially on 1 April 2008. Due to a dispute between the transmitter company Teracom and Swedish Post and Telecom Authority, the transmitter network was delayed, which meant the channel couldn't resume its broadcasts. Broadcasts could commence once again in December 2009.\nThe channel has been available terrestrially in Estonia and in Denmark from November 2009.\nReferences\nExternal links\n*[http://www.travelandliving.co.uk/ Official Site]"
    }
  ]
}