{
  "content": [
    {
      "type": "text",
      "text": "# Discovery Channel (Dutch TV channel)\n\n(European feed)| (Localized Dutch feed)}}\n| closed_date       =\n| picture_format    = 1080i HDTV\n| network           = Discovery Benelux\n| owner             = Warner Bros. Discovery\n| country           = Netherlands\n| language          = Dutch\n| area              = Netherlands\n| affiliates        =\n| headquarters      =\n| former_names      =\n| replaced          = Discovery Channel Europe (1989-2003)\n| replaced_by       =\n| sister_channels   =\n| timeshift_service =\n| website           = [https://www.discoveryplus.nl/zenders/discovery discoveryplus.nl/zenders/discovery]\n| terr_serv_1       = Digitenne\n| terr_chan_1       = Channel 16 (HD)\n| online_serv_1     = Ziggo GO\n| online_chan_1     = [https://www.ziggogo.tv/nl/tv/channel-asset.html/lgi-nl-prod-master%3ANL_000017_019222/location/65535.html#action=watch ZiggoGO.tv] (Europe only)\n}}\nDiscovery Channel is a Dutch free-to-cable television channel airing in the Netherlands. Its primary target is men aged 25–39. It launched on 6 January 1997.\nCable television is widely available in the Netherlands, and Discovery is available on virtually every platform. It has enjoyed relatively high ratings for several years; in 2018 it had 1.5 percent share of all viewing.\nHistory\nDiscovery Channel launched in Europe on 1 April 1989. By December 1992, most of the programs on Discovery Channel Europe already had Dutch subtitles.\nThe localized Dutch version of the namesake American television channel launched on 6 January 1997, replacing the European feed.\nThe Dutch Discovery Channel distinguishes itself from other versions by having broadcast live sports events. In late November 2008 it broadcast three matches from the Eredivisie that resulted in high ratings. These matches were seen by 805,000 viewers.\nIn August 2009 the channel switched to the 16:9 widescreen format.\nIn May 2012 Discovery Networks Benelux launched a HD simulcast of Discovery Channel in the Netherlands, replacing Discovery HD Showcase and was first introduced by UPC Netherlands.\nAnimal Planet, Eurosport 1, Investigation Discovery and TLC are also widely available. Eurosport 2 and Discovery Science are available as well, but they are only distributed as part of bonus packages.\nReferences\nExternal links\n* [https://www.dplay.nl/zenders/discovery Discovery NL]"
    }
  ]
}