{
  "content": [
    {
      "type": "text",
      "text": "# Discovery Atlas\n\n| last_aired         =\n| num_seasons        = 3\n| num_episodes       = 11\n}}\nDiscovery Atlas is a documentary television series on the Discovery Channel and Discovery HD Theater which focuses on the cultural, sociological, and natural aspects of various countries by exploring their different peoples, traditions, and lands. The documentary follows the lives and individual struggles of locals, while taking in-depth looks at the countries' history and culture.\nAccording to the Miami Herald, the series was meant to be shown over five years and focus on a total of 20 countries, with four countries to be featured each year. Other sources, including the Australian Discovery Channel and Discovery Communications Inc websites, said that the series would focus on thirty countries. However, the eleventh and final episode to air would be Russia Revealed.\nEpisodes\nSeason 1 (2006)\n{| class=\"wikitable\"\n|-\n!#\n!Airdate\n!Title\n!Country\n!Narrator\n|-\n|1\n|October 1, 2006\n|China Revealed\n|China\n|James Spader\n|-\n|2\n|October 8, 2006\n|Italy Revealed\n|Italy\n|Isabella Rossellini\n|-\n|3\n|October 15, 2006\n|Brazil Revealed\n|Brazil\n|Sela Ward\n|-\n|4\n|October 22, 2006\n|Australia Revealed\n|Australia\n|Russell Crowe\n|}\nSeason 2 (2007)\n{| class=\"wikitable\"\n|-\n!#\n!Airdate\n!Title\n!Country\n!Narrator\n|-\n|1\n|November 4, 2007\n|Mexico Revealed\n|Mexico\n|Edward James Olmos\n|-\n|2\n|November 11, 2007 **\n|South Africa Revealed\n|South Africa\n|Andre Braugher\n|-\n|3\n|November 18, 2007\n|India Revealed\n|India\n|Mira Nair\n|}\nSeason 3 (2008)\n{| class=\"wikitable\"\n|-\n!#\n!Airdate\n!Title\n!Country\n!Narrator\n|-\n|1\n|May 8, 2008\n|France Revealed\n|France\n|Candice Bergen\n|-\n|2\n|May 8, 2008\n|Japan Revealed\n|Japan\n|Masi Oka\n|-\n|3\n|Nov 23, 2008 (Australia)\n|Egypt Revealed\n|Egypt\n|Omar Metwally\n|-\n|4\n|Nov 30, 2008 (Australia)\n|Russia Revealed\n|Russia\n|Tatyana Yassukovich\n|}\nEpisode synopsis\nChina Revealed\nThis episode focused on the rapid development of the People's Republic of China in modern times, and also introduced several Chinese cities (Shanghai, Beijing, Hong Kong), the improvement of rural communities (Longshen, Taizhou) and the lives of various ordinary Chinese people (a rice farmer, a Shaolin monk and his students, a Mongolian horseman, a gymnast who is an Olympic hopeful, an Imperial bowmaker, an architectural millionaire, a window washer, a girl tempted by cosmetic surgery and a policewoman). Traditions of ethnic minorities (Mongolians) were also mentioned. The film uses both exciting western music as well as traditional Chinese music. This episode of the Atlas is narrated by actor James Spader.\nItaly Revealed\nItaly Revealed depicts the passionate culture of Italy as it follows six stories of Italians, including a jockey participating in a traditional palio, to a former fisherman setting a free-diving record off Sicily's coast, to the Missoni family's fashion world and a Venetian gondolier's attempt to keep his family in his native city.\nBrazil Revealed\nThis episode shows Brazil's celebrative spirit as it follows the stories of some of Brazil's citizens, as well as giving insight into the history and culture of the country. Among the people followed include a female soccer player struggling to play in what is considered a man's sport, a helicopter pilot in São Paulo, a rancher taking part in his first rodeo, and a dancer in preparation for Carnival.\nAustralia Revealed\nThis episode revealed the young nation's determination and tough nature, while focusing on Australia's marvelous ancient cultures that contain the nation's beat and the traditions of some of Australia's oldest indigenous populations, as well as the country's modern achievements. Some of the subjects of the documentary include an Aboriginal man trying to follow his ancestors' old ways, a professional swimmer, a jackaroo (or cowhand), and a fence builder working on the continent's longest single fence. It is narrated by Australian actor Russell Crowe.\nMexico Revealed\nMexico is a country sustained by ritual and tradition.  Mexico Revealed follows La Quebradra cliff divers, a masked wrestler named Hombre sin Nombre, and chef Martha Ortiz Chapa. The show also looks at religion in Mexico with a segment on All Saints Day and All Souls Day. Mariachi is featured throughout the show.\nSouth Africa Revealed\nSouth Africa Revealed explores the lives of several individuals and how they contribute in their own way to the new South Africa after years of internal struggle. Profiled is a young Zulu schoolgirl and her teacher, a man working thousands of feet underground in the world's deepest gold mine, a wildlife veterinarian and her team working to preserve South Africa's unique wildlife, the Khoisan bushmen battling to keep their traditional way of life, a young non-white woman in a leadership role in the South African Army, and an ambulance driver in Johannesburg, one of the world's most violent cities.\nIndia Revealed\nIndia Revealed shows life in the land of the gods. India has the world's second fastest growing major economy and a sixth of the world's population. The show follows an upscale wedding planner, a young man attending a gurukul to become a Brahmin. Dharavi, a large slum in Mumbai, is featured during the Festival of Lights. It is narrated by Mira Nair.\nFrance Revealed\nThis episode spotlights the radical new ways in which France is changing the world. From sports like free running and urban climbing, to unexploded munitions removal, to more traditional events like eating and watching fireworks, the French are setting new trends in many different aspects of life.\nJapan Revealed\nJapan Revealed focuses on the unique balance in Japan between the seasons and life, and keeping old traditions alive in a modern world. The episode follows the lives of a geisha in training, a tuna fisherman, a group of Ama divers, two trend setting schoolgirls, a family competing in robotics fighting, and a tattoo artist. It is narrated by Masi Oka.\nEgypt Revealed\nThis episode follows the lives of six individuals throughout Egypt. Stories include a 17-year-old bread delivery boy in Cairo, a Bedouin herbal healer in the Sinai hoping to pass on his secrets to a new generation before he dies, a man who left his Cairo home to become a Coptic Christian monk, and the conservative lifestyle of women in the oasis town of Siwa in contrast to a successful businesswoman and founder of a women's magazine in Cairo.\nRussia Revealed\nThis episode focuses on how the people of the new Russia are once again embracing their past following the fall of the Soviet Union. We follow the lives of nomadic reindeer herders in Siberia, a family of carpet-makers in the Caucasus Mountains, a fashion magazine executive in Moscow, a volcanologist in the Kamchatka Peninsula and a 17-year-old COOL aspiring circus performer in Kazan. Interspersed with these stories is footage of breathtaking scenery from around Russia, including Lake Baikal and St. Petersburg during summer twilight\nHome video\nThe initial four episodes were released on Blu-ray and HD DVD in high-definition on 30 January 2007. Each episode is sold separately and as a 4-disc box set.\nThey were also released on iTunes in 1080p HD.\nReferences\nExternal links\n*[http://discoveryatlas.com Official Discovery Atlas website]\n*"
    }
  ]
}