{
  "content": [
    {
      "type": "text",
      "text": "# Discipline (King Crimson album)\n\n* post-progressive\n* dance-rock\n| length       = 38:15\n| label        = * E.G.\n* Warner Bros.\n| producer     = * King Crimson\n* Rhett Davies\n| prev_title   = A Young Person's Guide to King Crimson\n| prev_year    = 1976\n| next_title   = Beat\n| next_year    = 1982\n| misc         =\n}}\nDiscipline is the eighth studio album by the English progressive rock band King Crimson, released by E.G. Records in the United Kingdom on 2 October 1981. Warner Bros. Records released the album in the United States the same month.\nThis album was King Crimson's first following a seven-year hiatus; only co-founder and guitarist Robert Fripp and drummer Bill Bruford remained from previous incarnations of the band. They were joined by two American musicians: vocalist, guitarist and frontman Adrian Belew, previously a member of Frank Zappa and David Bowie's backing bands and a touring member of Talking Heads, and bassist, Chapman Stick player, and backing vocalist Tony Levin, a session musician Fripp had met while both were working with Peter Gabriel.\nThe album introduced a new sound for the band, influenced by new wave, post-punk, minimalism and Indonesian gamelan music, while retaining an experimental character, helping lay the groundwork for what would eventually become known as post-progressive rock. Music publications have described Discipline as having elements of art rock, progressive rock, new wave, and dance-rock.\nBackground\nShortly before the release of Red in 1974, King Crimson bandleader Robert Fripp decided to disband the group, stating in an interview with Trouser Press magazine that \"King Crimson is completely over. For ever and ever.\" In the interim, following a brief period of retirement from the music industry, Fripp collaborated with musicians including Brian Eno, Peter Gabriel and David Bowie and released a series of albums. A King Crimson reunion was considered in 1977 but ultimately rejected by Fripp, so the two other members from the Red lineup, Bill Bruford and John Wetton, formed the band U.K.. In 1979, Fripp released the solo album Exposure, kickstarting a period that he dubbed the \"Drive to 1981\"; this concluded once his band The League of Gentlemen dissolved in late 1980.\nFripp had sought to assemble a new band that would grant him \"access to the latest, current ideas, [and] the best musicians\" while still touring with The League of Gentlemen. He then recruited Bruford, Tony Levin, and Adrian Belew to form the band Discipline, which performed live with the Lounge Lizards in the United Kingdom throughout parts of 1981. Fripp later opted to rename Discipline to King Crimson after concluding that \"there was no doubt that the band playing was King Crimson.\"\nComposition and recording\nThe title of the ballad \"Matte Kudasai\" means “please wait” in Japanese (待って下さい). The original release of Discipline featured a guitar part on this track by Fripp that was removed from the 1989 \"Definitive Edition\" remaster and most subsequent editions. The 30th and 35th anniversary editions of the album include both versions of the song.\nThe lyrics of \"Indiscipline\" were adapted from a letter written to Adrian Belew by his then-wife Margaret concerning a painting that she had made, with all direct references to its subject removed.\nThe title of \"Thela Hun Ginjeet\" is an anagram of \"heat in the jungle\", a euphemism for urban crime. When it was first performed live, some of its lyrics were improvised around an illicit recording made by Robert Fripp of his neighbours having a vicious argument when he was living in Manhattan; this recording is featured on the track \"NY3\" on Fripp's solo album Exposure. While \"Thela Hun Ginjeet\" was being recorded, Adrian Belew, walking around Notting Hill Gate with a tape recorder looking for lyrical inspiration, was harassed first by a gang that took and played the tape and then by police who searched the tape recorder for drugs. On returning to the studio, he gave his bandmates a distraught account of what had just happened to him. Fripp covertly signaled to the recording engineer to record Belew, and this recording is featured on the Discipline version of the track.\n\"The Sheltering Sky\", which heavily features Belew and Fripp on the Roland GR-300 guitar synthesizer, is named after and partially inspired by the 1949 novel of the same name by Paul Bowles. Bowles is often associated with the Beat Generation, the writings of which would inform King Crimson's subsequent studio album Beat.\nSome live versions of \"Elephant Talk\", \"Indiscipline\", and \"Thela Hun Ginjeet\" included vocal improvisation during the spoken-word sections.\nThe back cover features the statement, \"Discipline is never an end in itself, only a means to an end\". The original front cover features a variation on a copyrighted Celtic knot design by George Bain. As it was found to be used without proper licensing, it was replaced on later releases by a knotwork designed by Steve Ball on commission from Fripp. Ball's design is also used as the logo of Fripp's record label, Discipline Global Mobile.\nReception\n| rev2 = AllMusic\n| rev2score =\n| rev3 = The Encyclopedia of Popular Music\n| rev3score =\n| rev4 = Mojo\n| rev4score =\n| rev5 = MusicHound Rock\n| rev5score =\n| rev6 = Q\n| rev6score =\n| rev7 = Record Mirror\n| rev7score =\n| rev8 = Rolling Stone\n| rev8score =\n| rev9 = The Rolling Stone Album Guide\n| rev9score =\n| rev10 = The Village Voice\n| rev10score = B\n}}\nDiscipline reached number 41 on the UK Albums Chart and received mixed to positive reviews. John Piccarella's review in Rolling Stone praised King Crimson's talent and artistry, particularly Belew and Fripp's \"visionary approach to guitar playing\", but criticised the \"arty content\" of the album itself, hoping that \"this band of virtuosos [would stay] together long enough to transform all of their experiments into innovations.\" Record Mirrors Alan Entwistle was generally enthusiastic, writing that the band \"tests new ground and revitalises older ground\"; he highlighted the \"more mature\" second side of the album, noting its \"distinct songs that are danceable as well as disciplined\". Robert Christgau of The Village Voice described the album as \"musically, not bad—the Heads meet the League of Gentlemen\". In The Village Voices year-end Pazz & Jop poll, Discipline was voted by critics as the 35th best album of the year.\nGreg Prato's retrospective review in AllMusic commended the album's \"inspired performances\", particularly applauding the unexpectedly successful combination of Belew and Fripp's disparate playing styles: \"the pairing of these two originals worked out magically.\" Trouser Press characterised the album's songs as \"unfolding musical sculptures, played with precision and rare imagination\" and \"a mostly successful synthesis of ambition, simplicity and Kraftwerkian clarity.\"\nLegacy\nIn 2002, Pitchfork ranked Discipline at number 56 on its list of \"The Top 100 Albums of the 1980s\"; in the album's entry on the list, staff writer Dominique Leone cited it as an influence on math rock and called it \"as angular and tense as any post-punk group while as precise and rhythmically propulsive as a Bartók string quartet.\"\nIn 2024, Adrian Belew and Tony Levin formed BEAT with Steve Vai and Tool drummer Danny Carey, performing music by the 1980s incarnation of King Crimson. This included material from Discipline as well as the subsequent albums Beat and Three of a Perfect Pair.\nTrack listing\nAll music written by Adrian Belew, Robert Fripp, Tony Levin and Bill Bruford; all lyrics written by Adrian Belew.\nPersonnel\n;King Crimson\n*Adrian Belew – electric guitar, Roland GR-300 guitar synthesizer, vocals\n*Robert Fripp – electric guitar, Roland GR-300 guitar synthesizer, organ, devices\n*Tony Levin – Chapman Stick, bass guitar, backing vocals\n*Bill Bruford – drums, Simmons electronic drums, slit drum, percussion\n;Production personnel\n*Rhett Davies – production\n*Nigel Mills – assistant engineer\n*Graham Davies – gear\n*Peter Saville – graphic design\n*John Kyrk – knotwork (uncredited; 1981, 1986 and 1989 issues only)\n*Steve Ball – knotwork (2001 issue onwards)\n*Paddy Spinks – strategic management\nCharts\n{| class=\"wikitable sortable plainrowheaders\"\n! scope=\"col\"| Chart (1981–82)\n! scope=\"col\"| Peakposition\n|-\n|-\n|-\n!scope=\"row\"| French Albums (SNEP)\n| align=\"center\"| 17\n|-\n! scope=\"row\"| Japanese Albums (Oricon)\n| style=\"text-align:center;\"| 33\n|-\n|-\n|-\n|-\n|}\nReferences\nExternal links\n*\n* [http://www.elephant-talk.com/wiki/Discipline Wiki with song lyrics] at fan-site  Elephant Talk (inspired by Discipline's \"Elephant Talk\")"
    }
  ]
}