{
  "content": [
    {
      "type": "text",
      "text": "# Discovery Bay (Washington)\n\nView of Discovery Bay near sunset, looking north with the San Juan Islands in the background\nDiscovery Bay is a small bay connected to the Strait of Juan de Fuca on the coast of the Olympic Peninsula in Washington state; it was also historically called Port Discovery. An unincorporated community also named Discovery Bay lies in Jefferson County at the southern end of the bay.\nThe bay was named by George Vancouver after the Discovery, a ship used in his 1792 expedition of the area. The community at the foot of the bay eventually assumed the same name.\nGeography\n(labelled as Port Discovery)]]\nDiscovery Bay is located at the northeastern edge of the Olympic Peninsula of Washington state. The bay enters the Strait of Juan de Fuca between the Miller and Quimper peninsulas. The bay's mouth is just south of Protection Island, a small federally protected nature preserve. Discovery Bay is  in length, and  wide at its mouth. Its primary inlet is Snow Creek at the south end of the bay, and other small watercourses feed the bay on its east and west sides.\nHistory\nNative people &ndash; the Klallam (locally: S'Klallam) &ndash; have occupied the lands around the Strait of Juan de Fuca for millennia, including locations on Discovery Bay. Most native populations on the Olympic Peninsula were relocated to reservations during the 19th and early 20th centuries, leaving only scattered individuals of native descent still residing on the bay.\nThe Spanish explorers Manuel Quimper and Gonzalo López de Haro in   are the first known Europeans to find and map the bay of Port Discovery. They were sent to explore the Strait of Juan de Fuca by Francisco de Eliza in 1790. The Spanish named the bay Puerto Quadra, after Juan Francisco de la Bodega y Quadra.\nIn 1792, George Vancouver's exploration of the area provided names for Discovery Bay and Port Discovery. A landing party put ashore along the west shore of the bay near what is now Contractor's Point to fill water barrels from the creek there. Today, a sign alongside Highway 101 above the site of the landing commemorates the event.\nIn 1858, the S. L. Mastick Company of San Francisco established the Port Discovery Mill on the western shore of the bay, at what is now Mill Point. The old growth timber on the steep hillsides above the mill were felled, slid down to the sawmill, milled into lumber and loaded from the wharf to ships for other ports. A village grew around the mill to house its employees. The peak population of the community, in the late 19th century, was in the hundreds. Port Discovery remained an important coastal port well into the 20th century, and was visited by many Pacific Ocean vessels.\nAnother major mill community was established at the foot of the bay, where the town of Maynard grew. The Maynard mill continued in operation until the 1970s, and was responsible for the several nearby small communities mentioned above. The abandoned sawmill was a popular sight for tourists and appears in many nostalgic area photographs and paintings. It deteriorated rapidly during storms in 2005–2006, and as of 2007 had been slated for removal, as part of a habitat restoration effort.\nReferences\n* Jefferson County Historical Society, With Pride in Heritage: History of Jefferson County, Portland, Oregon, Professional Publishing Printing, Inc., 1966."
    }
  ]
}