{
  "content": [
    {
      "type": "text",
      "text": "# Distinguished Eagle Scout Award\n\n|award-for = Extraordinary national-level recognition, fame, or eminence within their profession and/or service to the nation and a strong record of voluntary service to their community by an Eagle Scout who earned Eagle at least 25 years previous to the nomination.\n}}\nThe Distinguished Eagle Scout Award (DESA) is a distinguished service award of the Boy Scouts of America (BSA). It is awarded to an Eagle Scout who has achieved extraordinary national-level recognition, fame, or eminence within their profession and/or service to the nation and has a strong record of voluntary service to their community. Stringent criteria begins with a minimum of 25 years from the official record date the Eagle Scout rank was earned, a nomination process, selection committee review, and approval by the National Eagle Scout Association. It is one of only two BSA awards presented to adults dependent upon the recipient's having been awarded Eagle Scout as a youth; the other is the NESA Outstanding Eagle Scout Award (NOESA). Recipients of the DESA are known as Distinguished Eagle Scouts.\nAward\nThe award consists of a gold eagle suspended from a red, white, and blue ribbon worn around the neck. Recipients may wear a small gold eagle device on the Eagle Scout square knot on the Scout uniform. The neck ribbon and medallion is the same design as the Eagle Scout medal. The Distinguished Eagle Scout medal is worn in place of the regular Eagle Scout medal for Eagle Scout-related ceremonies. The recipient is also presented with cast bronze plaque featuring a gold eagle and the award citation.\nHistory\nThe DESA was first introduced in 1969 and is awarded by the National Eagle Scout Association. Prior to the establishment of the Distinguished Eagle Scout Award, a \"gold Eagle Scout badge\" was awarded to Daniel Carter Beard at the Second National Training Conference of Scout Executives held in 1922 in Blue Ridge, North Carolina. This was the only time this gold badge was awarded.\nThe DESA does not have a clear order of issue like the numbers assigned to each NOESA recipient, though the majority have a date of rank as a Distinguished Eagle recorded. On January 16, 1969, the first ten DESAs were approved.  Alphabetically, Alden G. Barber is the first DESA recipient.  Based upon the date of the original Eagle Scout rank, Zenon C.R. Hansen, who earned Eagle Scout in 1921, is the first.\nBeginning in 2022, the selection process became annual, and recipients are grouped in a \"Class of (year)\" announced in December.\nOf the Eagle Scouts who received the Medal of Honor for valor in combat, five were eligible for the DESA (four received the MOH posthumously and are therefore not eligible).  Of those five, three have been awarded the DESA: Mitchell Paige, Leo K. Thorsness, and Thomas R. Norris.  The other two died in 2007 without a DESA nomination being processed.\nOf the 24 men who traveled to the Moon, three were Eagle Scouts: Neil Armstrong, Jim Lovell, and Charles Duke.  All three were awarded the DESA.  Armstrong and Lovell are also among the recipients of the Congressional Space Medal of Honor and both also received the Silver Buffalo Award.\nWhile all recipients are well-known in their field, among the many other widely well-known recipients are President Gerald Ford, NBA player and Senator William W. Bradley, adventurer Steve Fossett, J. W. Marriott Jr., Steven Spielberg, and Sam Walton.\nRecipients\nA list of recipients is maintained by NESA, sorted by local BSA council, and may be found on their web page.\nReferences\nExternal links\n*"
    }
  ]
}