{
  "content": [
    {
      "type": "text",
      "text": "# Diversity in open-source software\n\nResearchers and journalists have found a higher gender disparity and lower racial and ethnic diversity in the open-source-software movement than in the field of computing overall, though a higher proportion of sexual minorities and transgender people than in the general United States population. Despite growing an increasingly diverse user base since its emergence in the 1990s, the field of open-source software development has remained homogeneous, with young men constituting the vast majority of developers.\nBackground\nOpen source software is a model of software development where source code is created by a number of volunteers and can be modified by other members of the community. The number of developers working on an open-source project can range from few to thousands, but in many projects only developers deemed trustworthy by the project maintainers will have the privilege of making additions to the main repository. The software developed as open-source is usually freely available to use, with the number of users varying from few to many millions.\nSince its inception in the 1990s, as open-source software has continued to grow and offer new solutions to everyday problems, an increasingly diverse user base began to emerge. In contrast, the community of developers has remained homogeneous, dominated by young men.\nResearch on possible causes\nIn 2017, GitHub conducted a survey named the Open Source Survey, collecting responses from 5,500 GitHub users. Among the respondents, 18% personally experienced a negative interaction while working on open-source projects, but 50% of them have witnessed such interactions between other people. Dismissive responses, conflict, and unwelcoming language were respectively the third, fourth, and sixth most cited problems encountered in open-source.\nAnother study from 2017 examined 3 million pull requests from 334,578 GitHub users, identifying 312,909 of them as men and 21,510 as women from the mandatory gender field in the public Google+ profiles tied to the same email addresses as these users were using on GitHub. The authors of the study found code written by women to be accepted more often (78.6%) than code written by men (74.6%). However, among developers who were not insiders of the project, women's code acceptance rates were found to drop by 12.0% if gender was immediately identifiable by GitHub username or profile picture, with only a smaller 3.8% drop observed for men under the same conditions. Comparing their results to a meta-analysis of employment sex discrimination conducted in 2000, the authors observed that they have uncovered only a quarter of the effect found in typical studies of gender bias. The study concludes that gender bias, survivorship and self-selection bias, and women being held to higher performance standards are among plausible explanations of the results.\nDiversity\nGender diversity\nThe more recent entering of women into the movement has been suggested as the cause of their under-representation in the field; of all women who had contributed to open-source software up until 2013, 38.45% of them began doing so from 2009 to 2013, in comparison to only 18.75% of men.\nThe gender ratio in open source is even greater than the field-wide gender disparity in computing. This was found by a number of surveys:\n*A 2002 survey of 2,784 open-source-software developers found that 1.1% of them were women.\n*A 2013 survey of 2,183 open-source contributors found that 81.4% were men and 10.4% were women. The survey included both software contributors and non-software contributors and found that women were much more likely to be non-software contributors.\n*In the GitHub's 2017 Open Source Survey 95% respondents identified as men and only 3% as women, while in the same year about 22.6% of professional computer programmers in the United States were female according to the United States Bureau of Labor Statistics.\nRacial and ethnic diversity\nIn an 2013 article for the NPR, journalist Gene Demby considered Black people and Latinos to be underrepresented in the open source software development.\n* In the GitHub's 2017 Open Source Survey the representation of immigrants, from and to anywhere in the world, was 26%.\n* In the same survey, 16% of respondents identified as members of ethnic or national minorities in the country where they currently live, while according to the United States Bureau of Labor Statistics, Black, Asian, and Latino people accounted for a total of about 34% of programmers in the United States in 2017.\nSexual minority, non-binary, and transgender diversity\nAmong the respondents of GitHub's 2017 Open Source Survey 1% identified as transgender, 1% as non-binary, and 7% as lesbian, gay, bisexual, asexual, or another minority sexual orientation, while according to a Gallup poll in conducted in the same year 4.1% of the United States population identify as LGBT. A 2018 survey of software developers conducted by Stack Overflow found that out of their sample of 100,000, 6.7% in total identified as one of \"Bisexual or Queer\" (4.3%), \"Gay or Lesbian\" (2.4%), and \"Asexual\" (1.9%), while 0.9% identified as \"non-binary, genderqueer, or gender non-conforming\".\nOrganizations and programs\nLinuxChix is a women-oriented Linux community founded in 1999 encouraging participation in Linux and open-source software by creating conflict-free and nurturing environments for women to do so. Open-source projects and organizations such as Arch Linux, Bitcoin, BonitaSoft, Debian [https://www.debian.org/women/], Drupal, Fedora [https://fedoraproject.org/wiki/Women], FreeNX, GNOME [https://wiki.gnome.org/GnomeWomen], KDE [https://community.kde.org/KDE_Women], Mozilla [https://wiki.mozilla.org/WoMoz], PHP, Ubuntu [https://wiki.ubuntu-women.org/] have or had initiatives directed to women to support their participation.\nSee also\n* Gender disparity in computing\n* STEM pipeline\nReferences\n}}"
    }
  ]
}