{
  "content": [
    {
      "type": "text",
      "text": "# Dixon Edwards\n\n| birth_place = Cincinnati, Ohio, U.S.\n| height_ft   = 6\n| height_in   = 1\n| weight_lb   = 230\n| high_school = Aiken (Cincinnati)\n| college     = Michigan State\n| draftyear   = 1991\n| draftround  = 2\n| draftpick   = 37\n| pastteams   =\n* Dallas Cowboys ()\n* Minnesota Vikings ()\n* Miami Dolphins ()*\n| highlights  =\n* 3× Super Bowl champion (XXVII, XXVIII, XXX)\n* Second-team All-Big Ten (1990)\n| statlabel1  = Tackles\n| statvalue1  = 438\n| statlabel2  = Fumble recoveries\n| statvalue2  = 4\n| statlabel3  = Sacks\n| statvalue3  = 7.5\n| pfr         = EdwaDi20\n}}\nDixon Voldean Edwards, III (born March 25, 1968) is an American former professional football player who was a linebacker in the National Football League (NFL) for the Dallas Cowboys and Minnesota Vikings. He played college football for the Michigan State Spartans.\nEarly life\nEdwards attended Aiken High School in Cincinnati, Ohio, where he earned All-district honors as a tight end and defensive tackle.\nHe accepted a football scholarship from Michigan State University, where he studied Construction Management. He was a backup during his first 2 seasons.\nAs a junior in 1989, in his first season as a starter at weakside linebacker, he finished second on the team in tackles (111) to All-American Percy Snow and tied for the team lead in tackles for loss (11), earning an All-Big Ten honorable-mention. He had 14 tackles against the University of Miami, 13 against the University of Michigan and 14 against the University of Iowa.\nAs a senior, he had 112 tackles (7 for loss), 2 sacks, one pass defensed, 2 forced fumbles and 2 fumble recoveries. Edwards led the Spartans with a single-game career-high 16 tackles in their upset of then-No. 1 ranked University of Michigan. He earned second-team All-Big Ten honors at the end of the year.\nDuring his college career, he registered 254 career tackles, 18 tackles for loss, 4 passes defensed and 4 sacks, while helping the Spartans to a 31-14-1 record, two Big Ten titles and a 3-1 bowl game record (including the 1988 Rose Bowl win).\nProfessional career\nDallas Cowboys\nEdwards was selected by the Dallas Cowboys in the second round (37th overall) of the 1991 NFL draft. Because of his speed and hitting ability, he was moved to strongside linebacker, even though he had a small frame at 6-1 and 225 pounds. On September 25, he was activated from the injured reserve list. He played mainly on special teams and tied for fourth on the team with 10 tackles. The next year, he was second on the team with 15 special teams tackles.\nIn 1993, he became the starter at strongside linebacker after Vinson Smith was traded to the Chicago Bears on August 17. He posted 82 tackles (seventh on the team), 1.5 sacks, one quarterback pressure and 12 special teams tackles. He saw limited action in Super Bowl XXVIII because the Cowboys kept 5 defensive backs on the field for most of the contest.\nIn 1994, he recorded 104 tackles (third on the team), 5 tackles for loss, one sack, 2 quarterback pressures, 3 passes defensed and 9 special teams tackles (tenth on the team). He dislocated his right shoulder in the first quarter of the NFC Championship Game against the San Francisco 49ers and was replaced with Godfrey Myles.\nIn 1995, he was third on the team with 109 tackles.\nIn the 90's, the Cowboys organization felt they could find linebackers through the draft, without the need of paying a premium and adversely impacting the salary cap, so they allowed talented and productive players like him, Ken Norton, Jr., Darrin Smith, Robert Jones and Randall Godfrey, to leave via free agency, instead of signing them to long-term contracts.\nDuring his 5 seasons with the Cowboys, Edwards helped the team win 3 Super Bowls, playing as a starter in Super Bowl XXVIII and Super Bowl XXX. In 1996 after he left as a free agent, the Cowboys replaced him by signing Broderick Thomas.\nMinnesota Vikings\nOn February 25, 1996, Edwards signed as a free agent with the Minnesota Vikings, replacing Broderick Thomas and becoming the Vikings highest paid linebacker in franchise history. During training camp Ed McDaniel was injured, so the team was forced to move him to weakside linebacker, where he would have the best year of his career with 122 tackles, 3.5 sacks and one interception.\nIn 1997, he was moved back to the strongside linebacker position, where his production began to decline.\nOn June 2, 1999, he was released for salary cap reasons. In his three years with the Vikings, Edwards started 43 of the 45 games, made 250 tackles, 5 sacks, one interception, 7 passes defensed, 3 forced fumbles and 2 fumble recoveries.\nMiami Dolphins\nOn June 21, 1999, the Miami Dolphins signed him to a one-year contract, to add depth and experience at the outside linebacker position, while reuniting him with Jimmy Johnson. In training camp he was diagnosed with an irregular heartbeat and although he was medically cleared, he decided to stop playing and was released before the season started on August 4.\nEdwards appeared in 120 regular season games in his career, starting 90 of them. His NFL career statistics include 573 tackles, 7.5 sacks, two interceptions for 54 yards and a touchdown, four fumble recoveries, seven forced fumbles and 19 passes defensed. He also had 50 special teams tackles.\nNFL career statistics\n{| class=\"wikitable mw-collapsible mw-collapsed\"\n! colspan=\"2\"| Legend\n|-\n| style=\"background:#afe6ba; width:3em;\"|\n| Won the Super Bowl\n|-\n| Bold\n| Career high\n|}\nRegular season\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n!rowspan=\"2\"| Year\n!rowspan=\"2\"| Team\n!colspan=\"2\"| Games\n!colspan=\"4\"| Tackles\n!colspan=\"4\"| Interceptions\n!colspan=\"4\"| Fumbles\n|-\n! GP !! GS !! Comb !! Solo !! Ast !! Sck !! Int !! Yds !! TD !! Lng !! FF !! FR !! Yds !! TD\n|-\n! 1991 !! DAL\n| 11 || 1 || 18 || 18 || 0 || 0.0 || 1 || 36 || 1 || 36 || 0 || 0 || 0 || 0\n|-\n! 1992 !! style=\"background:#afe6ba; width:3em;\"| DAL\n| 16 || 1 || 10 || 10 || 0 || 0.0 || 0 || 0 || 0 || 0 || 0 || 0 || 0 || 0\n|-\n! 1993 !! style=\"background:#afe6ba; width:3em;\"| DAL\n| 16 || 15 || 82 || 82 || 0 || 1.5 || 0 || 0 || 0 || 0 || 2 || 1 || 0 || 0\n|-\n! 1994 !! DAL\n| 16 || 15 || 74 || 59 || 15 || 1.0 || 0 || 0 || 0 || 0 || 1 || 1 || 21 || 0\n|-\n! 1995 !! style=\"background:#afe6ba; width:3em;\"| DAL\n| 15 || 15 || 62 || 47 || 15 || 0.0 || 0 || 0 || 0 || 0 || 0 || 0 || 0 || 0\n|-\n! 1996 !! MIN\n| 14 || 13 || 96 || 68 || 28 || 3.5 || 1 || 18 || 0 || 18 || 0 || 0 || 0 || 0\n|-\n! 1997 !! MIN\n| 16 || 16 || 50 || 34 || 16 || 1.5 || 0 || 0 || 0 || 0 || 2 || 1 || 0 || 0\n|-\n! 1998 !! MIN\n| 15 || 14 || 46 || 29 || 17 || 0.0 || 0 || 0 || 0 || 0 || 1 || 1 || 0 || 0\n|-\n! colspan=\"2\"| !! 119 !! 90 !! 438 !! 347 !! 91 !! 7.5 !! 2 !! 54 !! 1 !! 36 !! 6 !! 4 !! 21 !! 0\n|}\nPlayoffs\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n!rowspan=\"2\"| Year\n!rowspan=\"2\"| Team\n!colspan=\"2\"| Games\n!colspan=\"4\"| Tackles\n!colspan=\"4\"| Interceptions\n!colspan=\"4\"| Fumbles\n|-\n! GP !! GS !! Comb !! Solo !! Ast !! Sck !! Int !! Yds !! TD !! Lng !! FF !! FR !! Yds !! TD\n|-\n! 1991 !! DAL\n| 2 || 0 || 0 || 0 || 0 || 0.0 || 0 || 0 || 0 || 0 || 0 || 0 || 0 || 0\n|-\n! 1992 !! style=\"background:#afe6ba; width:3em;\"| DAL\n| 3 || 0 || 3 || 3 || 0 || 0.0 || 0 || 0 || 0 || 0 || 0 || 1 || 0 || 0\n|-\n! 1993 !! style=\"background:#afe6ba; width:3em;\"| DAL\n| 3 || 2 || 0 || 0 || 0 || 0.0 || 0 || 0 || 0 || 0 || 0 || 0 || 0 || 0\n|-\n! 1994 !! DAL\n| 2 || 2 || 3 || 2 || 1 || 0.0 || 0 || 0 || 0 || 0 || 0 || 0 || 0 || 0\n|-\n! 1995 !! style=\"background:#afe6ba; width:3em;\"| DAL\n| 3 || 2 || 5 || 5 || 0 || 0.0 || 0 || 0 || 0 || 0 || 0 || 0 || 0 || 0\n|-\n! 1996 !! MIN\n| 1 || 1 || 4 || 3 || 1 || 0.0 || 0 || 0 || 0 || 0 || 0 || 0 || 0 || 0\n|-\n! 1997 !! MIN\n| 2 || 2 || 4 || 2 || 2 || 0.0 || 0 || 0 || 0 || 0 || 0 || 0 || 0 || 0\n|-\n! 1998 !! MIN\n| 2 || 2 || 6 || 5 || 1 || 0.0 || 0 || 0 || 0 || 0 || 0 || 0 || 0 || 0\n|-\n! colspan=\"2\"| !! 18 !! 11 !! 25 !! 20 !! 5 !! 0.0 !! 0 !! 0 !! 0 !! 0 !! 0 !! 1 !! 0 !! 0\n|}\nPersonal life\nOn KTCK AM in Dallas, Edwards is known for an interview he did where he said the words \"you know\" an inordinate number of times to the point where it became unintentionally comedic.\nReferences"
    }
  ]
}