{
  "content": [
    {
      "type": "text",
      "text": "# DMZ: The Battle for South Korea\n\nDMZ: The Battle for South Korea is a board wargame published by Simulations Publications Inc. (SPI) in 1977 that simulates a hypothetical attack in the late 1970s against South Korea by North Korea.\nDescription\nDMZ is a two-player game where one player controls South Korean and American forces, and the other player controls North Korean and Chinese forces.\nGameplay\nWith a small 17\" x 22\" hex grid map and 100 counters, this game has been characterized as \"basically simple\". Each turn, which represents 12 hours of game time, consists of five phases:\n* Special Weapons Fire (both players)\n* First Player Movement\n* First Player Combat\n* Second Player Movement\n* Second Player Combat\nThe game borrows the \"untried unit\" rule from SPI's Panzergruppe Guderian wargame: Units of each type are shuffled and placed in starting positions upside down so that neither player is aware of their combat strengths. When each unit is engaged in combat for the first time, the unit counter is flipped right side up to display its actual combat strength.\nScenarios\nDMZ includes three hypothetical scenarios:\n# \"The Battle for Seoul\": The game posits that on 1 May 1979, North Korea suddenly attacks South Korea with the intent of taking Seoul. American and South Korean troops must respond from their base camps to stop the invasion before it gets started. This scenario lasts 15 turns.\n# \"U.S. Withdrawal\": The Americans withdraw from Korea in 1978. When North Korea strikes on 1 October 1980, only South Korean forces are available to stop them. This scenario lasts 12 turns.\n# \"Counterstroke across the DMZ\": As a North Korean invasion nears its target of Seoul, American and South Korean forces launch a counterattack against the rear of the North Korean force. This scenario lasts 12 turns.\nPublication history\nDMZ is the first game designed by Joseph Balkoski, who had just earned is master's degree in History before being hired hired by SPI to design this game. Balkoski would go on to became a designer of several award winning games, as well as an author and historian. DMZ was published in 1977 as part of a four-game collection titled Modern Battles II with graphic design by Redmond A. Simonsen. It proved proved popular, rising to #6 on SPI's Top Ten Bestseller list as soon as it was published and staying on the list for four months. DMZ was also sold individually as a \"folio\" game, packaged in a cardstock folio.\nReception\nIn Issue 9 of Fire & Movement, Phil Kosnett thought that despite this being Joseph Balkoski's first game design, \"he did an excellent job.... All in all, it's fast, it's fun, and it's an effective simulation.\"\nIn Craft, Model, and Hobby Industry Magazine, Rick Mataka noted the quality of the components, calling them \"professionally produced\", and emphasized the contemporary nature of the game.\nIn The Guide to Simulations/Games for Education and Training, Martin Campion noted the simplicity of the game rules, except for the artillery rules that \"tend to put a larger strain than usual on players' abilities to add numerous numbers in their heads and to consider several alternatives at the same time.\"\nIn the 1980 book The Complete Book of Wargames, game designer Jon Freeman commented in the introduction of the book that \"a game based on a battle that never took place has two major attractions for non-historians. First, you are not playing in the shadow of Napoleon or Rommel. [...] Second, you do not have the original tactics and strategies to fall back on: you must be innovative.\" Freeman also noted \"the element of speculation is quite limited: [...] the data for such potential conflicts are available today.\"\nOther reviews and commentary\n* Fire & Movement #16\n* The Wargamer Vol.1 No. 7\nReferences"
    }
  ]
}