{
  "content": [
    {
      "type": "text",
      "text": "# Docs (software)__disambig_2\n\n| released =\n| repo =\n| programming language = Python, TypeScript\n| engines = React, Django REST Framework, Next.js, Blocknotes.js\n| platform = Web application\n| genre =\n| website =\n}}\nDocs is a collaborative word processor software jointly developed by French and German governmental technology departments first announced in March 2025. The open-source platform enables document collaboration either through cloud-based systems or offline environments. The platform was created as a European alternative to prevailing American collaborative editing software such as Google Docs, with particular emphasis on security features and streamlined functionality for European institutional and business users.\nHistory\nThe project originated as a cooperative venture between France's Interministerial Directorate for Digital Affairs (DINUM) and Germany's Center for Digital Sovereignty of Public Administration (ZenDiS). These organizations, both dedicated to advancing digital sovereignty initiatives across Europe, developed Docs against the backdrop of changing transatlantic relations following policy shifts under the second Trump administration beginning in 2025.\nWhile not explicitly framed as a political response in official communications, the timing and nature of the collaboration between two major European economic powers aligned with broader European Union efforts to reduce technological dependency on non-European platforms and services, such as Google Docs and other Google products.\nDocs began onboarding in the Netherlands shortly after its announcement.\nFeatures\nThe software utilizes a modern technology stack consisting entirely of open-source components. Primary frameworks include Django Rest for backend operations, Next.js for frontend functionality, and BlockNotes.js for document editing capabilities. The complete codebase was publicly released on GitHub.\nDuring its beta phase initiated in March 2025, users could access Docs through France's ProConnect identity verification service. The March 2025 of Docs implements a minimalist interface, with keyboard shortcut support, offline working capabilities, options for media integration, and granular access settings for document sharing and real-time collaborative editing, akin to Google Docs. The beta platform presently supports three export formats that have templates that can be customized: PDF, Microsoft Word, and OpenDocument. Docs incorporates a wiki functionality built into the software to facilitate team knowledge coordination and terminology standardization.\nFeatures announced for future implementation include subpages, advanced search capabilities, and document pinning for improve visibility of important content.\nDespite being government-initiated through DINUM and ZenDiS, Docs presently operates under the MIT license, which enables unrestricted commercial and private implementation, modification, and distribution.\nTechnology\nIt is built with React, Django REST Framework, Next.js and Blocknotes.js.\nReferences\nExternal links\n*\n*"
    }
  ]
}