{
  "content": [
    {
      "type": "text",
      "text": "# Dog king\n\nThe dog king is a Scandinavian tradition which appears in several Scandinavian sources: Chronicon Lethrense, Gesta Danorum (book 7), Gesta Danorum på danskæ, Heimskringla (Hákonar saga góða), Hversu Noregr byggðist and probably also in Skáldatal. The tale relates that a dog was made a king of a certain medieval Scandinavian land (although which land varies according to the telling) by a conquering foreign power.\nChronicon Lethrense and Gesta Danorum på danskæ\nThe tale of the dog king appears in Chronicon Lethrense (\"The Chronicle of Lejre\"), an early treatment of Danish legendary history, written in Denmark in Latin in the mid- to late-12th century. In this version, the dog king is known as Raka, Rachi or Racha (which are similar to the Old Norse word for \"dog\", rakki), and he was made the king of Denmark.\nIn this version, after the deaths of the Danish king Haldan and his brother the sea-king Helgi, King Athisl of Sweden (or Swethia) sent a small dog to the Danes to take as their king but warned that whoever told him of the death of the dog would lose his life. One day, when larger dogs were fighting, the small dog sprang to the floor among them and was torn to death. Following advice from Læ, the giant of Læsø, the herdsman Snyo (i.e. \"Snow\") went to the Swedish king's court and by riddling talk eventually got the king himself to say that the dog was dead. Snyo was then appointed king of Denmark in place of the dog. After Snyo, Helgi's son Rolf Kraki was made king.\nThe later Gesta Danorum på danskæ (\"Deeds of the Danes in Danish\"), which was written in Old Norse around the year 1300 and which borrowed extensively from both Chronicon Lethrense and the Gesta Danorum by Saxo Grammaticus (see the next section), tells substantially the same version of the dog king tale as Chronicon Lethrense, with manuscripts naming the dog king Rakke or Rakken (i.e. \"dog\") and the hersdman Snio or Snye. However, in Gesta Danorum på danskæ, the foreign king who puts Rakke on the throne of Denmark is identified not as Athisl, but as Hakon of Sweden.\nGesta Danorum\nIn Gesta Danorum, book 7, Saxo Grammaticus tells of a Gunnar, \"the bravest of the Swedes\" who invaded Norway and relished killing rather than pillaging. In order to humiliate the Norwegians after his victory against their aged king Ragnald, he appointed a dog as their ruler. He then appointed governors to take care of affairs of state in the name of the dog, and several ranks of nobles to watch over it. He also commanded that if anyone failed to show the dog respect, he was to be mutilated.\nHversu Noregr byggðist, Heimskringla and Skáldatal\nHversu Noregr byggðist and Hákonar saga góða from Heimskringla refer to a king named Eysteinn Illráði who had a dog as subking. Whereas Hversu only mentions the tale in passing, Hákonar saga góða retells it in more detail. According to Heimskringla (Hákonar saga góða, ch. 12), when King Eysteinn of Oppland (Eysteinn Upplendingakonungr or Eysteinn hinn illi) conquered Trondheim, he set one of his sons to rule there. The people killed him, and in response Eysteinn subdued the area again. He then mockingly offered them either his slave, called Thorer Faxe, or his dog Saurr (a name which means \"excrement\"), to be their new king. The surviving manuscripts of Heimskringla do not preserve the son's name, and he should not be confused with Earl Önundr of Sparabú, who is mentioned separately in the same chapter. They chose the dog, as they thought they would be rid of him sooner. For three years Saurr was treated regally, with a collar of gold, courtiers, a throne, and a mansion – and routinely signed paw-print decrees – until one day wolves broke into his fold and tore him to pieces.\nSkáldatal mentions that a skald named Erpr lútandi was sentenced to death for killing in a sanctuary. He saved his life by composing a drápa for Saurr the dog king. This Erpr was the skald of the Swedish king Eysteinn hinn illráði, which puts the events in the early 9th century.\nThat a Saurr dog king appears in the context of two kings named Eysteinn (hinn) illráði who lived in Oppland and Uppland respectively is probably not a coincidence. A similar confusion took place when the Swedish king Onela became Áli of Norwegian Oppland (instead of Swedish Uppland).\nSee also\n* Incitatus\nReferences\ntags-->\nExternal links\n* [https://web.archive.org/web/20051104222521/http://www.northvegr.org/lore/heim/004_03.php ''Hakon the Good's Saga'' at Northvegr]\n* Peter Tunstall's translation of the Chronicon lethrense at [https://web.archive.org/web/20070310135852/http://www.oe.eclipse.co.uk/nom/lejre.html The Chronicle of the Kings of Lejre] and [https://web.archive.org/web/20070107150447/http://www.northvegr.org/lore/oldheathen/048.php Northvegr: The Saga of Hrolf Kraki: The Chronicle of the Kings of Lejre].\n*[http://mcllibrary.org/DanishHistory/book7.html Book seven of Gesta Danorum at the Medieval and Classical Literature Library]\n*[http://wayback.vefsafn.is/wayback/20070508175832/http%3A//www.heimskringla.no/original/snorre/skaldatal.php Skáldatal] Old Norse text\n*[http://www.sacred-texts.com/neu/ice/is3/is316.htm Sacred Texts: Appendix A: Fl.&nbsp;Book 1.21,22: How Norway was inhabited a translation of Hversu Noregr byggðist]. (The genealogies of the descendants of Nór and the Ættartolur are not translated here.)"
    }
  ]
}