{
  "content": [
    {
      "type": "text",
      "text": "# Dominican Republic National Police\n\n| commonname        =\n| abbreviation      = PN\n| fictional         =\n| patch             = Símbolo de la Policía Nacional de la Republica Dominicana.png\n| patchcaption      =\n| logo              = Bandera de la Policia Nacional de La Republica Dominicana.svg\n| logocaption       = Dominican National Police Emblem and flag.\n| badge             =\n| badgecaption      =\n| flag              =\n| flagcaption       =\n| image_size        = 160px\n| motto             =\n| mottotranslated   = Serve and protect.\n| formed            =\n| preceding1        =\n| dissolved         =\n| superseding       =\n| employees         = 36,968\n| volunteers        =\n| budget            = RD$6.744 millions (2024)\n| nongovernment     =\n| country           = Dominican Republic\n| countryabbr       =\n| national          = Yes\n| map               = Dominican Republic location map.svg\n| mapcaption        = Jurisdiction of the agency.\n| sizearea          =\n| sizepopulation    =\n| legaljuris        =\n| governingbody     =\n| governingbodyscnd =\n| constitution1     =\n| police            = Yes\n| local             = Yes\n| overviewtype      =\n| overviewbody      =\n| headquarters      =\n| minister1name     = Faride Raful.\n| minister1pfo      =\n| chief1name        = Ramón Antonio Guzmán Peralta\n| chief1position    = Major General\n| parentagency      = Ministry of Interior and Police\n| child1agency      =\n| person1name       = Faride Raful\n| person1reason     = policing, national security and immigration matters.\n| person1type       = Head of agency\n| programme1        =\n| anniversary1      =\n| award1            =\n| footnotes         =\n| website           =\n}}\nThe Dominican National Police () is the national police force of the Dominican Republic. It is the largest police force in the Dominican Republic under the control of the Ministry of Interior and Police.  Ranks and insignia are similar to those of the Dominican Army.\nIts main function is to protect the Dominican nation, enforce the law by constitutional mandate to maintain and guarantee the necessary conditions for public freedoms and rights and to ensure peaceful cohabitation among the population.\nHistory\nDuring the U.S. Occupation of Dominican Republic from 1916 to 1924, the United States Military assisted in creating the Dominican Constabulary Guard (DCG), which acted as national police and defense agency and the forerunner for today's Dominican National Police.\nThe National Congress of Dominican Republic enacted law 14 on November 5, 1930, which allows the leader of the Dominican Republic to appoint and dismiss municipal (local) heads of police. For the next six years Dominican Republic had various municipal (local) police officers as well as Constabulary Guard. The national police force itself (as the agency it is today) is not officially formed until March 2, 1936, with the congressional passing of decree No. 1523. With the formation of a new national police force, Colonel Miguel A. Roman was appointed as the head of the Dominican National Police. [2]\nTraining\nOn May 17, 1966, a general training school for military and police officers was created in the DR. Two years later on June 20, 1968, the National Police Officer Training School was established in San Cristobal under the surpervision of the school's first director, Eulogio Benito. Later, General Order No. 014-2004 gave the academy the name the \"National School of Public Safety\" whose motto remains to this day \"Education-Discipline-Protection.\"\nIn January 1983 a school of Criminal Investigations was created to provide advanced training to police officers who were given the positions of investigators in the National Police Force. The importance of training and education of police officers was recognized early on in the agency and various other \"continuing education\" and advanced training schools were created in various disciplines for officer in Dominican Republic National Poilice Force that are still in use today.\nDirección Central de Investigación Criminal (DICRIM)\nThe Organic Law of the National Police, No. 590-16, established the creation of the Dirección Central de Investigación Criminal (DICRIM). This department is primarily responsible for investigating criminal acts committed within the national territory, developing crime prevention strategies, and leading high-impact operations within the criminal sphere.\nTourism Police (POLITUR)\nThe National Police force maintained a special unit to police the airports and tourism areas in Dominican Republic then in 1975 due to the popularity of tourism on the island and the crime that arose in the tourist areas the unit became a separate police force called POLITUR,\"Policia de Turismo\" (tourism police). The Policia de Turismo is now a separate agency from the National Police and the officers wear white shirts, blue pants and blue caps.\nIn 2013 POLITUR was reorganized as the Cuerpo Especializado de Seguridad Turística (CESTUR). This new organization is a part of the Ministry of Defense, changing it from a civilian police organization to a military one.\nAircraft inventory\nThe Police operate 3 aircraft.\n{| class=\"wikitable\"\n! style=\"text-align: left;\"|Aircraft\n! style=\"text-align: left;\"|Origin\n! style=\"text-align: left;\"|Type\n! style=\"text-align: left;\"|Versions\n! style=\"text-align: left;\"|In service\n! style=\"text-align: left;\"|Notes\n|-\n| Bell OH-58 Kiowa ||  || scout helicopter || OH-58A || 1 ||\n|-\n| Eurocopter Ecureuil ||  || light utility helicopter || AS-350B || 1 ||\n|-\n| Cessna 172 Skyhawk ||  || utility airplane || Ce172 || 1||\n|}\nNotable staff\nFrom 2023 to 2025 the Major General of the National Police was Ramón Antonio Guzmán Peralta.\nSee also\n*Crime in the Dominican Republic\n*Law Enforcement in Dominican Republic\nReferences"
    }
  ]
}