{
  "content": [
    {
      "type": "text",
      "text": "# Dominican Republic–Spain relations\n\nDominican Republic–Spain relations are the bilateral relations between the Dominican Republic and the Kingdom of Spain. Both nations are members of the Association of Academies of the Spanish Language and the Organization of Ibero-American States.\nHistory\nSpanish colonization\n, Santo Domingo, Dominican Republic]]\nThe first Europeans to arrive to what is now present day Dominican Republic was in December 1492 when explorer Christopher Columbus arrived to the island of Hispaniola. The Spanish built a fort named La Navidad. The Spanish settlers on Hispaniola soon began fighting amongst themselves. They raped Taíno women and forced them to work as their servants. After several months of this abuse, the Taínos attacked the settlement and killed the Spanish settlers; the fort was burned to the ground.\nIn 1493, Columbus built the first permanent European settlement in the Americas and called it \"La Isabela\", named after Spanish Queen Isabella I of Castile. Soon after Columbus's arrival to Hispaniola, most of the native Taíno people of the island were wiped out by either diseases brought over from Europe or from direct slaughter by the Spanish. In 1493, the island of Hispaniola was governed under the Captaincy General of Santo Domingo and in 1521, it came under the greater Viceroyalty of New Spain based in Mexico City.\nIn 1605, Spain was infuriated that Spanish colonists on the northern and western coasts of the island persisted in carrying out large-scale and illegal trade with Spain's longtime enemies, England and the Netherlands, and so decided to forcibly resettle their inhabitants closer to Santo Domingo (see Devastations of Osorio). The locals resisted and this event is seen as the first expression of a Dominican social identity formed in opposition to Spain.\nIn 1697, Spain recognized French dominion over the western third of the island. Encouraged by the Spanish crown, Dominican privateers captured British, Dutch, French and Danish ships in the Caribbean throughout the 18th century. In 1795, Spain ceded the eastern part of Hispaniola to France as a result of its defeat in the War of the Pyrenees. In 1801, the western part of Hispaniola revolted against France and obtained its independence in 1804 and renamed itself Haiti. As a result, many French settlers arrived to the eastern part of Hispaniola (Santo Domingo) and set up garrisons against Haiti. In 1809, the white creole population rebelled against both France and Haiti and invited Spain to return as the colonial power, initiating a twelve-year period of Spanish rule, known in Dominican history as \"the Foolish Spain\" (España Boba).\nIndependence\nSoon after being part of Spain, the colony of Santo Domingo felt ignored by Spain while it focused more on its colony of Cuba, and as a result, many in the colony wanted independence for Santo Domingo. On 9 November 1821 the Spanish colonial government of Santo Domingo was toppled by a rebel group led by José Núñez de Cáceres. The rebels managed to obtain independence for the colony from Spain in December 1821 and Santo Domingo became known as the Republic of Spanish Haiti. The new government soon introduced a petition for the union of Spanish Haiti with Gran Colombia, however, in February 1822, Haiti invaded and took control of the country. In February 1844, after the Dominican War of Independence, Santo Domingo regained its independence from Haiti.\nin Dajabón]]\nThe new country soon amassed a great amount of debt and after seventeen years of independence, President Pedro Santana asked Spain to make Santo Domingo a Spanish colony again. Spain agreed and Santo Domingo returned as a colony in 1863. This action was supported by the cattlemen of the south while the northern elites opposed it. As soon as Spain regained the colony, a guerrilla war broke out known as the Dominican Restoration War where rebels fought against Spanish forces to regain independence from Spain. The rebels burned and looted property and raped and murdered Spaniards; the Spanish shot or hung those they suspected of being or helping the rebels. In most areas the fighting involved blocking roads and access to rivers, avoiding open spaces, and hand-to-hand combat; in larger towns, the rebels devised trenches to face off with regiments of as many as 5,000 soldiers, led by Spanish and Dominican generals alike. The rebels employed scorched-earth tactics, burning Santiago and Puerto Plata to the ground. The damage to Santiago and Puerto Plata was estimated at $5,000,000.\nIn 1865, the Spanish Cortes (Parliament) decided that it no longer wanted to fund a war to keep Santo Domingo and  in March 1865, Queen Isabella II of Spain signed the annulment of the annexation which automatically granted the territory independence. The country soon changed its name to the Dominican Republic. The Spanish lost 10,888 troops in battle and another 30,000 from yellow fever. The Dominicans lost approximately the same number as the Spanish to war and disease. This ended the last threat to Dominican sovereignty posed by Spain; but the island would endure two occupations by the United States in the next century.\nThe annexation of the Dominican Republic brought to Cuba an unemployed mass of former Dominican white and light-skinned mulattos who had served with the Spanish Army in Santo Domingo before being evacuated to Cuba and discharged from the army. They had few skills other than war. Some of these former soldiers joined the rebels in the Ten Years' War (1868–78) for Cuban independence and provided their invaluable war expertise.\nPost-independence\nand Spanish Prime Minister Pedro Sánchez in Santo Domingo, 2019.]]\nDuring the Spanish Civil War (1936–39), the Dominican Republic under President Rafael Trujillo supported the Nationalist faction of General Francisco Franco. Although a supporter of Franco, the Dominican Republic allowed the entry of several thousand Spanish Republican refugees fleeing Spain to seek refuge in the country. President Trujillo's generosity toward the thousands of Spaniards fleeing Franco and a war-torn Europe had little to do with political solidarity: he was bent on improving his international standing and thought the Spaniards could help him \"whiten\" the island's population. Trujillo did not hesitate, however, to silence any sign of political criticism among the newcomers. Among others, his regime assassinated José Almoina and Jesús de Galíndez, a Basque intellectual whom Trujillo had kidnapped in New York City, brought to the island, and killed. José Almoina was a Galician who had been Trujillo's secretary. He was shot and killed in Mexico City. In 1954, President Trujillo paid an official visit to Spain and visited with General Franco.\nAfter the death of Francisco Franco in 1975, Spain transitioned back to democracy and restored the monarchy. In June 1976, Spanish King Juan Carlos I paid a visit to the Dominican Republic on his first international trip as King. The former King would visit the country on three more occasions. There have been several high-level visits from leaders of both nations and the two countries work closely within the Organization of Ibero-American States.\nBilateral relations\nThroughout the years, both nations have signed numerous bilateral agreements such as the Dominican–Spanish Treaty (1855); Treaty of El Carmelo (1865); Agreement on Literary, Artistic and Scientific Property (1930); Agreement on Hispanic-Dominican Emigration (1956); Agreement on Dual-Nationality (1968); Air Transportation Agreement (1968); Agreement on Economic Cooperation (1973); Extradition and Judicial Assistance Treaty (1981); Agreement on Scientific and Technical Cooperation (1988); Agreement on Cultural and Educational Cooperation (1988); Agreement on Reciprocal Protection and Promotion of Investments (1996); Agreement on the Regulation of Migrant Laborers (2001); Social Security Agreement (2004) and an Agreement on the Avoidance of Double-Taxation (2014).\nTransportation\nThere are direct flights between both nations with the following airlines: Air Europa, Iberia, Iberojet and World2Fly.\nTrade\nIn 2016, trade between the Dominican Republic and Spain totaled €664 million Euros. The Dominican Republic's main exports to Spain include: rum, cacao, medical equipment, cigars, fruits, tobacco and electronic equipment. Spain's main exports to the Dominican Republic include: machinery, wine, construction material, electronic equipment, olive oil and medicine. Spain is the Dominican Republic's third largest foreign investor (after the United States and Canada). In 2015, Spanish investments in the Dominican Republic totaled €926 million Euros. Spanish multinational companies such as Mapfre, Telefónica and Inditex operate in the Dominican Republic.\nResident diplomatic missions\n* Dominican Republic has an embassy in Madrid and consulates-general in Barcelona and Santa Cruz de Tenerife and consulates in Seville and Valencia.\n* Spain has an embassy in Santo Domingo.\nSee also\n* Dominicans in Spain\n* People of the Dominican Republic\n* Dominican–Spanish Treaty (1855)\nReferences"
    }
  ]
}