{
  "content": [
    {
      "type": "text",
      "text": "# Dominican Republic–United Kingdom Maritime Boundary Agreement\n\n| location_signed     =\n| date_sealed         =\n| date_effective      =\n| condition_effective =\n| date_expiration     =\n| signatories         =\n| parties             =\n*\n*\n| ratifiers           =\n| depositor           =  United Nations Secretariat\n| language            = English; Spanish\n| languages           =\n| wikisource          =\n}}\nThe Dominican Republic – United Kingdom Maritime Boundary Agreement is a 1996 treaty between the Dominican Republic and the United Kingdom which delimits the maritime boundary between the Dominican Republic and the British territory of the Turks and Caicos Islands.\nThe treaty was signed on 2 August 1996. The text of the treaty establishes a boundary that runs roughly east–west and is actually north (closer to the Turks and Caicos) of the equidistant line between the two territories. The boundary is 283 nautical miles long and consists of four straight-line maritime segments defined by five individual coordinate points. The far western point of the border is a tripoint with Haiti.\nThe treaty has not yet come into force because it has not been ratified by both states. The full name of the treaty is Agreement between the Government of the United Kingdom of Great Britain and Northern Ireland and the Government of the Dominican Republic concerning the delimitation of the Maritime Boundary between the Dominican Republic and the Turks and Caicos Islands.\nNotes\nReferences\n* Anderson, Ewan W. (2003). International Boundaries: A Geopolitical Atlas. Routledge: New York. ; [https://www.worldcat.org/oclc/54061586  OCLC 54061586]\n* Charney, Jonathan I., David A. Colson, Robert W. Smith. (2005). International Maritime Boundaries, 5 vols. Hotei Publishing: Leiden. ; ; ; ; ; [https://www.worldcat.org/oclc/23254092  OCLC 23254092]\nExternal links\n*[http://www.vliz.be/vmdcdata/marbound/documents/DOM-GBR1996TC.pdf Full text of agreement]"
    }
  ]
}