{
  "content": [
    {
      "type": "text",
      "text": "# Dominican Republic–Mexico relations\n\nThe nations of the Dominican Republic and Mexico established diplomatic relations in 1890. Both nations have over the years joined several multilateral forums and are members of the Association of Caribbean States, Community of Latin American and Caribbean States, Organization of American States, Organization of Ibero-American States and the United Nations.\nHistory\nportrays him as if shouting the words that made him famous: \"Tell me by what right of justice do you hold these Indians in such a cruel and horrible servitude?\" The Mexican government donated it to the Dominican People in 1982.]]\nThe Dominican Republic and Mexico are two Latin American nations that were once colonized by the Spanish Empire. After both nations gained independence from Spain. In August 1886, Mexico appointed a resident consul in Santo Domingo. In March 1890, a treaty of 'Friendship, Navigation and Commerce' was signed between both nations. On 29 March 1929, both nations officially established diplomatic relations and in July of that year, both nations opened resident diplomatic legations in both nations capitals.\nInitial diplomatic relations between the two nations were unsteady due to several coup d'état, civil wars and foreign interventions; occurring in the Dominican Republic. From 1930 to 1938 and again in 1942 until his death in 1961; the Dominican Republic was ruled by President Rafael Trujillo. During this time period, relations between the two nations were cold at best. Mexico granted political asylum to several Dominican politicians and leading figures who were escaping persecuting in their country. After the death of Trujillo in 1961, relations improved between the two nations. In 1963, President Juan Bosch became the first Dominican head-of-state to visit Mexico.\nIn April 1965, the United States government under President Lyndon B. Johnson feared that the Dominican Republic would turn into a 'second Cuba' after the assassination of Trujillo and sent in the marines to occupy the country. Mexico vehemently condemned American occupation of the country and Mexico did not participate in the OAS contingency force to oversee events in the country. Soon after the election of President Joaquín Balaguer, American marines pulled out of the country in July 1966 and diplomatic relations between Mexico and the Dominican Republic returned to normal. In 1982, President José López Portillo became the first Mexican head-of-state to pay an official visit to the Dominican Republic. There have been several high-level visits between leaders of both nations.\nBoth nations are an active members of multinational organizations and have committed themselves to strengthen the legal framework in areas of common interest such as commercial; social development; and the recovery and restitution of cultural property. In October 2024, President Luis Abinader travelled to Mexico to attend the inauguration of President Claudia Sheinbaum.\nHigh-level visits\nPresidential visits from the Dominican Republic to Mexico\n* President Juan Bosch (1963)\n* President Antonio Guzmán Fernández (1980, 1982)\n* President Salvador Jorge Blanco (1982)\n* President Joaquín Balaguer (1991)\n* President Hipólito Mejía (2000, 2002)\n* President Leonel Fernández (1997, 2010, 2011, 2012)\n* President Danilo Medina (2014, 2018)\n* President Luis Abinader (2024)\nPresidential visits from Mexico to the Dominican Republic\n* President José López Portillo (1982)\n* President Ernesto Zedillo (1999)\n* President Vicente Fox (2002, 2006)\n* President Felipe Calderón (2008)\nBilateral agreements\nBoth nations have signed several bilateral agreements such as a Treaty of Friendship, Commerce and Navigation (1891); Agreement on Cultural Exchanges (1971); Agreement on Touristic Cooperation (1984); Agreement on Air Transportation (1996); Agreement of Cooperation in Combating the Illicit Traffic, Abuse of Narcotic Drugs and Psychotropic Substances and related offenses (1997); Agreement on Technical and Scientific Cooperation and a Treaty on Mutual Legal Assistance in Criminal Matters (1997); Agreement for the Elimination of Visas in Diplomatic Passports (1997); Agreement of Cooperation in Exchange of Information and Experiences to Combat Transnational Organized Crime, Drug Trafficking and Related Crimes (2011); Treaty on Mutual Legal Assistance in Criminal Matters (2012); Extradition Treaty (2013); and a Memorandum of Understanding for the Establishment of a Consultation Mechanism on Matters of Common Interest (2015).\nTransportation\nThere are direct flights between Cancún and Mexico City to Santo Domingo with Aeroméxico and AraJet.\nTrade relations\nIn 2023, two-way trade between both nations amounted to US$1.1 billion. The Dominican Republic's main exports to Mexico are electronic cutting devices and machinery. Mexico's main exports to the Caribbean nation are petroleum and steel. Several Mexican multinational companies such as América Móvil, Cemex, Jumex and Sigma Alimentos operate in the Dominican Republic.\nResident diplomatic missions\n* Dominican Republic has an embassy in Mexico City.\n* Mexico has an embassy in Santo Domingo.\nFile:Embajada de la Rep. Dominicana en Mexico.jpg|Embassy of the Dominican Republic in Mexico City\nFile:Avenida Horacio 124, Ciudad de México.jpg|Consulate-General of the Dominican Republic in Mexico City\nFile:Embajada de México en Santo Domingo.jpg|Embassy of Mexico in Santo Domingo\nReferences"
    }
  ]
}