{
  "content": [
    {
      "type": "text",
      "text": "# Dominican Republic–Taiwan relations\n\nand ROC President Tsai Ing-wen in Taiwan.]]\nDominican Republic–Taiwan relations are the bilateral relations between the Dominican Republic and Taiwan, officially known as the Republic of China. The two countries maintained official relations from 1944 to 2018. At the time it broke relations, it was the largest economy amongst the 19 UN member states to have had fully recognized the Republic of China as the sole legitimate representative of all of China.\nHistory\nOn April 30, 2018, the Dominican Republic announced they were severing diplomatic relations with Taiwan and would establish relations with the People's Republic of China, recognizing Taiwan as an \"inalienable part of Chinese territory\".\nA 2020 survey suggested that 71% of Dominicans want to restore relations with Taiwan. Luis Abinader, who was later elected in the 2020 Dominican Republic general election, praised Taiwan for its success handling the coronavirus.\nDiplomatic missions and personnel\nTaiwan's former embassy in the Dominican Republic was located in the Bella Vista neighbourhood of Santo Domingo. The Dominican Republic's former embassy was located in the Shilin District of Taipei. Víctor Manuel Sánchez Peña served as Dominican Republic's ambassador in Taipei from 1997 to 2000 and again from 2004 to 2011.\nIn April 2012, Julia Ou (), an Overseas Compatriot Affairs Commission official attached to Taipei's embassy, was found stabbed to death in the bedroom of her Santo Domingo apartment. The murder remained unsolved by the end of the year.\nBilateral visits\nIn August 2008, Taiwanese President Ma Ying-jeou visited Santo Domingo and met Dominican Republic President Leonel Fernández. They agreed that the two countries would begin to push for the signing of a free trade agreement.\nReferences\nExternal links\n* [http://www.taiwanembassy.org/do/ Embassy of the Republic of China in the Dominican Republic]\n* [http://www.taiwanembassy.org/do_es/ Embassy of the Republic of China in the Dominican Republic]"
    }
  ]
}