{
  "content": [
    {
      "type": "text",
      "text": "# Don Edwards\n\n| birth_place         = San Jose, California, U.S.\n| death_date          =  }}\n| death_place         = Carmel-by-the-Sea, California, U.S.\n| alma_mater          = Stanford UniversityStanford Law School\n| allegiance          =\n| branch              = United States Navy\n| battles             = World War II\n| office              = Member of the U.S. House of Representativesfrom California\n| constituency        = 9th district (1963–1975)10th district (1975–1993)16th district (1993–1995)\n| term_start          = January 3, 1963\n| term_end            = January 3, 1995\n| preceded            = New district (redistricting)\n| succeeded           = Zoe Lofgren\n| party               = Democratic (after 1962)\n| otherparty          = Republican (before 1962)\n| module              =\n}}\nWilliam Donlon Edwards (January 6, 1915 – October 1, 2015) was an American politician of the Democratic Party and a member of the United States House of Representatives from California for 32 years in the late 20th century.\nEarly life\nEdwards was born in San Jose, California to Republican parents. His father and grandfather owned a land title business. After graduating from San Jose High School, Edwards earned a B.A. from Stanford University in 1936, where he was member of the Stanford golf team. Edwards then attended Stanford Law School and was admitted to the bar in 1940.\nEdwards was a special agent for the Federal Bureau of Investigation from 1940 to 1941, when he joined the United States Navy as a naval intelligence and gunnery officer during World War II. In 1950, he was elected president of the California Young Republicans, resigning after joining the United World Federalists. Perceiving the Republican Party as becoming too conservative, he became a Democrat prior to his first congressional election victory in 1962. He was the president of Valley Title Company of Santa Clara County from 1951 to 1975, and a delegate to the Democratic National Conventions of 1964 and 1968.\nUnited States representative (1963–95)\n.]]\nEdwards was elected as a member of the Democratic Party to the 88th from the 9th Congressional District (later redistricted to the 10th and then the 16th Congressional District) and to the fifteen succeeding Congresses (January 3, 1963 – January 3, 1995). In his first year in the House, Edwards voted to abolish the House Un-American Activities Committee. Edwards was involved in the passage of the Civil Rights Act of 1964 and the Voting Rights Act of 1965. Edwards was a member of the House Judiciary Committee during the investigation of the Watergate scandal. Edwards opposed the U.S. military involvement in the Vietnam War, the invasion of Panama, and the Persian Gulf War.\nEdwards was one of eight members of the Judiciary Committee to vote for all five articles of impeachment drafted against President Richard Nixon during the Watergate scandal. The others were Jack Brooks, Robert Kastenmeier, John Conyers, Barbara Jordan, Charles Rangel, Elizabeth Holtzman and Edward Mezvinsky. Three of the five articles were adopted prior to Nixon's resignation on August 9, 1974.\nEdwards was one of the House impeachment managers appointed by the House of Representatives in 1988 to conduct the impeachment trial of Alcee Hastings, judge of the United States District Court for the Southern District of Florida. However, he was replaced as an impeachment manager before the trial started. However, in 1989, he was appointed and served as a House impeachment manager in the impeachment trial of Walter Nixon, judge of the United States District Court for the Southern District of Mississippi. Edwards was the chairman of the House Subcommittee on Civil Liberties and Civil Rights for 23 years. Edwards was not a candidate for reelection to the 104th Congress. Santa Clara County Supervisor Zoe Lofgren, one of his former aides, won a crowded Democratic primary for the seat and still holds it today.\nPersonal life and death\nDon Edwards was married three times; he was married to Edith Wilkie Edwards from 1981 until her death in 2011. He turned 100 in January 2015. He died later that year on October 1, 2015. He was remembered by media outlets as, \"a champion of civil and constitutional rights during his three decades on Capitol Hill\" and someone who \"stood up for women, for workers, for the environment.\"\nLegacy\nEdwards received the Congressional Distinguished Service Award in 2003. The Don Edwards San Francisco Bay National Wildlife Refuge in the south end of San Francisco Bay is named in his honor.\nSee also\n*List of centenarians (politicians and civil servants)\nReferences\nExternal links\n*[http://www.oac.cdlib.org/findaid/ark:/13030/kt096nc5sv/ Don Edwards Congressional Papers]\n*[https://web.archive.org/web/20050928142321/http://www.abanet.org/irr/hr/spring02/chair.html American Bar Association Human Rights Magazine biography]\n*[https://web.archive.org/web/20060315010522/http://projects.washingtonpost.com/congress/members/e000064/\tVoting record maintained by the Washington Post]\n*[http://www.spartacus-educational.com/MDedwardsD.htm Spartacus Educational Biography]\n*"
    }
  ]
}