{
  "content": [
    {
      "type": "text",
      "text": "# Don Flickinger\n\n| death_date    =\n| birth_place   = Erie, Pennsylvania\n| death_place   = Washington, D.C.\n| placeofburial =\n| placeofburial_label = Place of burial\n| placeofburial_coordinates =\n| nickname      =\n| birth_name    =\n| allegiance    =\n| branch        =\n| serviceyears  = 1934–1961\n| rank          = Brigadier General\n| servicenumber =\n| unit          =\n| commands      = Air Force Office of Scientific Research\n| battles       = World War II\n| battles_label =\n| awards        = Distinguished Service Medal  Legion of Merit (2)  Distinguished Flying Cross\n| relations     =\n| laterwork     =\n| signature     =\n}}\nDon Davis Flickinger (26 November 1907 – 23 February 1997) was a military flight surgeon and pioneer in aerospace medicine who retired from the United States Air Force as a brigadier general.\nFlickinger was born in Erie, Pennsylvania on 26 November 1907 and graduated from Los Angeles High School in 1925. He then attended Stanford University, graduating with an A.B. in 1929. Flickinger received his medical degree from the Stanford School of Medicine in 1933. He completed his medical training at the Vanderbilt University School of Medicine in 1934 and was then commissioned as a first lieutenant in the U.S. Army Medical Corps.\nFrom July to November 1937, Flickinger trained as a flight surgeon at Randolph Field in Bexar County, Texas.\nAs an expert in the physiology of high altitude flight, Flickinger accompanied a squadron of nine B-17 bombers from Hawaii to the Philippines in September 1941. He was subsequently awarded the Distinguished Flying Cross.\nAfter returning from the Philippines to Hawaii in November 1941, Flickinger was medical officer of the day for Pearl Harbor during the Japanese attack on 7 December 1941.\nDuring World War II, Flickinger became a pioneer in pararescue in the China Burma India Theater, parachuting into rough terrain to aid downed flyers and then helping them hike to safety. His most famous rescue mission was widely publicized by one of the survivors of the August 1943 crash of a C-46 transport in Burma, CBS radio correspondent Eric Sevareid.\nFrom November 1945 to December 1946, Flickinger was professor of air science and tactics at Harvard Medical School while also completing a graduate course in cardiology there.\nIn 1947, Flickinger was made director of research at the School of Aviation Medicine. In February 1953, he was appointed director of research for the Air Research and Development Command. On 11 October 1954, Flickinger was frocked as a brigadier general.\nIn August 1955, Flickinger became the first commander of the Air Force Office of Scientific Research. From January 1956 to June 1957, he served as head of the European Office of the Air Research and Development Command in Brussels.\nIn July 1957, Flickinger returned to Air Research and Development Command headquarters at Andrews Air Force Base where he served as director of life sciences. In May 1958, Flickinger was also made special assistant to the commander of the Air Force Ballistic Missile Division for bioastronautics. In November 1958, he became assistant to the commander of the Air Research and Development Command for bioastronautics. Flickinger retired on 1 August 1961 and was awarded the Distinguished Service Medal.\nOn 1 October 1958, Dr. W. Randolph Lovelace II was appointed chairman of the NASA Special Committee on Life Sciences and Brig. Gen. Flickinger was appointed vice chairman. The committee provided guidance on the medical testing requirements for potential Project Mercury astronauts. Flickinger also provided guidance on the selection of Project Gemini astronauts. In the early 1960s, Lovelace and Flickinger also supervised the physical testing of female pilots as potential astronauts. Some of these women were later referred to as the Mercury 13.\nFlickinger died on 23 February 1997 at Georgetown University Hospital. His name was incorrectly reported as \"Donald\" in some subsequent obituaries. Flickinger was interred at Mount Tamalpais Cemetery in San Rafael, California along with his third wife Marilyn Kelso Flickinger. He had a son, daughter and two grandsons from his two previous marriages, which had both ended in divorce.\nReferences"
    }
  ]
}