{
  "content": [
    {
      "type": "text",
      "text": "# Don Stewart (Bonaire activist)\n\nfor living people supply only the year with  unless the exact date is already widely published, as per WP:DOB. For people who have died, use . -->\n| birth_place        = San Francisco Bay area, California, United States\n| death_date         =\n| death_place        = Bonaire\n| partner            = Janet Thibault\n| children           = KevinGwen\n| other_names        = Captain Don, Donald Stewart\n| occupation         = Scuba diver, conservationist, environmentalist, inventor, writer, hotelier\n| known_for          = \"The Father of Bonaire\", founder of Bonaire Marine Park, environmental activist, brought tourism to Bonaire\n| awards             =  Order of Orange-Nassau, KnightInternational Scuba Diving Hall of FameBonaire's Lifetime Achievement Award\n}}\nCaptain Don Stewart, (born Donal A. Stewart; 1925 – May 30, 2014), was best known as Captain Don, The Father of Bonaire. In the early 1950s, he invented and patented an \"adapter for screen cloth\" which is basically the frame for a screen door. He was also a story teller, an advanced scuba diver, an environmental activist and protector of the coral reefs that fringe the coastline of Bonaire, a small island in the Caribbean Netherlands where Stewart lived most of his life.\nEarly life\nDon Stewart was born in the San Francisco Bay area of California. His mother died when he was a young boy, and was raised by his father. He was diagnosed as dyslexic, dropped out of high school and at age 17, joined the United States Navy shortly after the Japanese had bombed Pearl Harbor. He signed up for medical training while in the Navy. He was later diagnosed with lymphatic cancer and was discharged from the Navy.\nArrival on Bonaire\nStewart was penniless when he first arrived on Bonaire in May 1962 but quite eager to make things happen. A friend once quipped in an interview that, \"no matter what Don tells you, the truth is he stayed in Bonaire because that's where his ship sank\".\nStewart was instrumental in opening Zeebad, Bonaire's first hotel and dive operation. It was built on property that was once a German detention camp, and over time, the hotel grew to become Divi Flamingo Beach Resort & Casino. In the late 1960s, Irwin Hasen, who was a cartoonist with the Chicago Tribune Syndicate at the time, had created the cartoon character \"Dondi\" which was published daily in more than a hundred newspapers. During a trip to Bonaire, Hasen met Captain Don, and created a segment in the Dondi comic-strip that illustrated Captain Don teaching Dondi how to scuba dive, and preserve the coral reefs.\nSignificance to Bonaire\nAfter Stewart arrived on Bonaire, he realized the importance of protecting its fragile ecosystem, both above and below the ocean. He introduced permanent mooring systems to protect the island's fringing reefs, and spearheaded a campaign that banned spearfishing and tropical fish collecting on Bonaire. He named most of the dive sites on the island, and in 1976, founded a resort hotel of his own, and named it Captain Don's Habitat. He was inducted into the International Scuba Diving Hall of Fame in 2005. Stewart became a Knight in the royal Order of Orange-Nassau in 2008.\nOne of Stewart's memorable quotes when greeting scuba divers to the island was simply, \"Take only pictures and memories, leave only bubbles.” He was quite serious about not touching the corals or harming the fish, which led to the founding of Bonaire Marine Park.\nReferences"
    }
  ]
}