{
  "content": [
    {
      "type": "text",
      "text": "# Don Denkinger\n\n| birth_place  = Cedar Falls, Iowa, U.S.\n| death_date   =\n| death_place  = Waterloo, Iowa, U.S.\n| spouse       = Gayle Price\n| children     = 3\n| alma_mater   = Wartburg College\n| occupation   = MLB umpire\n| years active = 1969–1998\n}}\nDonald Anton Denkinger (; August 28, 1936 – May 12, 2023) was an American umpire in Major League Baseball (MLB) who worked in the American League (AL) from 1969 to 1998.  Denkinger wore uniform number 11, when the AL adopted uniform numbers in 1980.  He is best remembered for an incorrect safe call he made at first base in Game 6 of the 1985 World Series, which came to be known as The Call.\nPersonal life\nDenkinger was born in Cedar Falls, Iowa, in 1936. He and his wife, Gayle Price, had three daughters, Darcel Nikolajsen, Denise Hanson, and Dana Kelly. Denkinger died at a hospice facility in Waterloo, Iowa, on May 12, 2023, at the age of 86.\nCareer\nDenkinger attended Wartburg College, where he was on the wrestling team. After serving in the Army from 1957 to 1959, he began umpiring in the Alabama–Florida League in 1960, joined the AL staff in April 1969, and became an AL crew chief in 1977. In 1975, Denkinger was one of the first American League umpires to switch from the outside chest protector to the inside chest protector, which was used in the National League for decades before finally being adopted in the AL in the late 1970s. All umpires who entered the AL starting in 1977 had to use the inside protector; AL umpires on staff prior to 1977 were grandfathered and could continue to use the outside protector. Denkinger's last game using the outside protector was Game 4 of the 1974 World Series.\nDenkinger umpired in four World Series: 1974, 1980, 1985, and 1991, serving as crew chief in the 1985 and 1991 World Series. Denkinger also umpired in the All-Star Game in 1971, 1976, and 1987, calling balls and strikes for the last game. He officiated in six American League Championship Series (1972, 1975, 1979, 1982, 1988, 1992), serving as crew chief in 1979, 1982, 1988, and 1992, and in the 1981 and 1995 AL Division Series. He was the home plate umpire for the 1978 American League East tie-breaker game that decided the AL East champion, as the New York Yankees defeated the Boston Red Sox. He was also the home plate umpire of Game 7 in the 1991 World Series when the Minnesota Twins beat the Atlanta Braves 1-0 in ten innings, a game that is considered one of the best games in World Series history.\nHe was one of seven umpires who worked in two perfect games. Denkinger was the second base umpire for Len Barker's perfect game on May 15, 1981, and the first base umpire for Kenny Rogers' perfect game on July 28, 1994. Denkinger was also the home plate umpire for Nolan Ryan's sixth no-hitter on June 11, 1990.\nThe Call: 1985 World Series\nDenkinger was the first base umpire in Game 6 of the 1985 World Series. The St. Louis Cardinals led the Kansas City Royals by 3 games to 2 and had taken a 1–0 lead in the eighth inning. The Cardinals had taken the field with a ninth-inning lead 97 times in the 1985 season. They had won 97 times. In the bottom of the ninth, Jorge Orta, the leadoff batter for the Royals, hit a slow ground ball to first baseman Jack Clark, who tossed the ball to the pitcher, Todd Worrell, who was covering first base. Denkinger called Orta safe, even though instant replays (not used by officials for play review until 2008) and photographs clearly showed that he was out by half a step. The Royals went on to win Game 6 by the score of 2–1.\nDenkinger believed he had made the right call until he later met with Commissioner Peter Ueberroth after the game and had the opportunity to see the replay himself. He said he was waiting to hear the ball land in Worrell's glove while watching the bag for Orta's foot and due to the crowd noise he never heard Worrell catch the ball. Denkinger also said that when he looked down to see whether or not Orta's foot was on the bag, he saw Orta's foot on the bag, so Denkinger called him safe. As crew chief of the 1985 World Series umpiring unit, Denkinger was scheduled to work behind home plate in Game 7, a fact that further upset the Cardinals and manager Whitey Herzog. The Royals won Game 7 by an 11–0 score, with Denkinger ejecting both Herzog and pitcher Joaquín Andújar in the fifth inning, following Andújar's animated displeasure with ball and strike calls.\nIn the immediate aftermath of the 1985 World Series, Denkinger received many hateful letters, including death threats, from Cardinals fans. Two St. Louis disc jockeys went so far as to reveal Denkinger's telephone number and home address. Denkinger claimed that the letters continued on through 1987, when the Cardinals were ramping up for another World Series appearance, this time against the Minnesota Twins. Denkinger got into contact with Major League Baseball Security, who in turn contacted the FBI when he received a particularly menacing letter with no return address, in which the writer said that if he saw Denkinger in person, he would \"blow him away\" with a .357 Magnum. According to Denkinger, FBI agents visited the letter writer and told him, \"You're done. This is the end of it. You will not correspond with him in any manner, and life will go on.\"\nLater career\nTwo years later, Denkinger was behind the plate for the All-Star Game, and he was again named crew chief for the 1988 ALCS, 1991 World Series, and 1992 ALCS. He is one of only four umpires to have been selected as crew chief for the ALCS three times.\nDenkinger's last season as a full-time umpire was 1993. Thereafter, he umpired fewer than 100 games each season until retiring due to a bad right knee, umpiring his final game at Kauffman Stadium on June 2, 1998. Over the course of his career, he umpired 3,824 regular season MLB games.\nPost-umpiring\nDenkinger served as an umpire advisor for a year after retiring. He then spent his time golfing and fishing while also spending time in Arizona, France, Denmark and Illinois, with his family.\nMore than 20 years after the 1985 series, Denkinger regularly appeared at sports memorabilia shows (including ones in St. Louis) willing to autograph photos depicting \"The Call\". In his house, Denkinger had a painting of \"The Call\" featuring himself, Worrell, and Orta, which was given to him years after the play by an artist and which had previously been prominently displayed at Denkinger's restaurant, the Silverfox in Waterloo, Iowa.\nSee also\n* List of Major League Baseball umpires (disambiguation)\nReferences\nFurther reading\n*\nExternal links\n* [http://www.retrosheet.org/boxesetc/D/Pdenkd901.htm Retrosheet]"
    }
  ]
}