{
  "content": [
    {
      "type": "text",
      "text": "# Don't Say We Didn't Warn You\n\n}}\n}}\n| rev2 = Alternative Press\n| rev2Score =\n}}\n'Don't Say We Didn't Warn You' is the second studio album by dance-punk band Does It Offend You, Yeah?. It was released 14 March 2011. It reached number 3 in the UK dance album charts and number 11 in the Indie charts.\nBackground\nThe album was first announced as early as 2009. In October of the same year, the band requested fans via their MySpace page to record audio clips of themselves shouting the word \"Yeah!\" to be used in a track on the album. On 27 April, Does It Offend You, Yeah? told fans via a MySpace blog that they were to release a track called \"The News at 10\" for a limited time to celebrate reaching ten million plays on the social networking site. After the initial release, the song was modified and became the new song \"Yeah!\" that appears on the album. The song \"All the Same\" is featured on the soundtrack to the 2010 video game Need For Speed: Hot Pursuit and was speculated to be included in the album, but does not appear in it.\nThey first hoped to release the album by March 2010. However, in mid-2010 the band revealed that they had been working for over a year and set up a mailing list for fans to keep track of their progress via their official website. A track called \"We Are The Dead\" was given away as a free download from the band's official website on 25 August 2010, along with links to the song's \"remix parts.\"\nThe first single from the album is titled \"The Monkeys Are Coming\". The song features a vocal sample from an internet meme featuring an American man ranting to a group of skateboarders. The track was released on iTunes on 23 January 2011, while the full EP was released on 27 February 2011. Remixes were produced by [https://www.myspace.com/discoofdoom Disco of Doom] and dubstep producer [https://www.myspace.com/bar9uk Bar 9], both of which appear as B-sides on the EP.\nThe English alternative rapper Trip has been announced to appear on the track titled Wondering. Trip had previously supported on their 2009 UK Tour. The song was played live at The Prodigy's \"Warrior's Dance\" Festival at the MK Bowl on 24 July 2010. Does It Offend You, Yeah? later announced plans for a new 19-date UK tour, to be supported by fellow British bands Hounds and Tripwires. The band had supported the likes of Prodigy, Pendulum and Linkin Park in order to promote the album.\nTrack listing\nSampling\n*\"We Are the Dead\" samples the singing of the character Gizmo from the film Gremlins.\n*The song \"John Hurt\" samples the \"Yeah! Woo!\" drum break.\n*\"Wondering\" samples \"Sly\" by Massive Attack.\n*The song \"Wrestler\" samples professional wrestling promoter Paul Heyman's speech to the Extreme Championship Wrestling locker room before the 1997 Barely Legal PPV, as featured in the film Beyond the Mat.\n*The song \"The Monkeys Are Coming\" samples a popular Internet meme, a video of a drifter shouting \"The funky monkeys is coming!\" to a group of Philadelphia skateboarders.\nReferences"
    }
  ]
}