{
  "content": [
    {
      "type": "text",
      "text": "# Doña Blanca (archaeological site)\n\n|established=August 3, 1981, May 30, 2001, October 29, 1981, June 29, 1985, December 5, 2001 and November 12, 1985\n|alt_name=Asset of Cultural Interest|world_heritage_site=Asset of Cultural Interest Historical Heritage of Spain\n}}\nDoña Blanca is an archaeological site in El Puerto de Santa María, Spain, near Sidueña. With an area of 200 hectares, it has been protected as an Asset of Cultural Interest since 1991.\nStructure\nIt is a tell excavated between 1979 and 1995 in which remains of walls, dwellings, a Punic river port (the most extensive in the Mediterranean), and a necropolis have been found, belonging to a Phoenician city whose occupation spans from the 8th to the 3rd century BC. Therefore, it disputes, together with Cadiz and Cerro del Castillo (in the municipality of Chiclana), to be the oldest Phoenician city that has been found so far in the Iberian Peninsula and therefore has singular importance in the panorama of the Phoenician colonization in the western Mediterranean.\nIts exceptional degree of conservation (the only Phoenician city that has been preserved intact to this day) makes the site a key piece for future research on the establishment of the Phoenicians in the Bay of Cadiz and their relationship with the indigenous peoples of Lower Andalusia. Among other contents, one of the oldest cellars in the world, fully preserved, stands out.\nIn this site is the castle of Doña Blanca, so called because according to tradition there suffered captivity Doña Blanca de Borbón. It is a tower built in the 14th or 15th century for the surveillance of the Bay of Cadiz and was also used as a chapel.\nEnclave of Doña Blanca\nThe enclave of Doña Blanca is only a small portion of the Doña Blanca settlement, which has a protected area of approximately 2 million m2 that includes other unique heritage elements, such as the Dehesa settlement, the Hypogeum of the Sun and the Moon, the site and necropolis of Las Cumbres and Las Canteras, which are testimonies of the different relationships that man has established throughout history with the same physical environment.\nThe oldest remains found in this enclave date from a late phase of the Copper Age, towards the end of the 3rd millennium B.C. To this time belong some scattered huts that adapt to the original topography of the terrain. Subsequently, there was a phase of abandonment - in which the site remained uninhabited - which lasted until the middle of the 8th century B.C. when it was occupied again.\nAlready in the eighth century B.C., it became a real city, endowed with a wall. B.C. it became a real city, endowed with a wall, which remained continuously inhabited until the end of the third century B.C. During these five centuries of uninterrupted life, the city underwent several urban redevelopments and the construction of two more walls. The site was abandoned again from the end of the 3rd century B.C. until the medieval Islamic period when an Almohad farmstead was established (12th century BC).\nOf all the elements that make up the Archaeological Site of Doña Blanca, the only space that can be visited today is the Enclave. The route for visitors has a circular shape, approximately 1600 m long, which runs along the top of the hill and leads us through different areas of the enclave.\nDoña Blanca Tower\nIt is a small building with a Greek cross plan built in the late 15th century as a preeminent watchtower over the bay and the lower course of the Guadalete River. What we currently see is the result of a reconstruction carried out in the second half of the 19th century since the tower was in ruins after the Spanish War of Independence. A historiographic interpretation of modern times identified this tower as the place where Doña Blanca de Borbón, wife of Pedro I, was imprisoned and died (1361), hence the name by which we know it today. Other scholars identify the building as a hermitage.\nThe landscape\nThe environment of the Sierra de San Cristobal over the centuries has lost its original features and therefore its current appearance is very different from that found by the first settlers. One of the most important transformations has been the interior silting up of the bay with the sedimentary contributions dragged by the Guadalete River. All the plain that extends to the south of the site was sea and the mouth of the river was located in areas near El Portal, almost in the foothills of the limits of the municipalities of Jerez de la Frontera and El Puerto de Santa Maria. The natural vegetation has adapted over the years to variable climatic conditions, soil, relief, and rainfall. But it has been man throughout the course of history that has changed the natural vegetation in a more remarkable and lasting way, mainly due to the felling of trees, grazing, and agriculture, so that today there is no trace of the primary forests of cork oaks, carob trees and pines that densely populated the mountains in ancient times.\nStratigraphic section\nThe first excavation works were carried out in 1979, next to the entrance of the Tower, and their purpose was to establish the Chono-historical sequence of the site. To this end, the archaeologist proceeds by making a deep cut in the subsoil until he reaches the geological level. During the work, he records all the information about each of the deposits he finds and recovers from them as many elements as are susceptible to later analysis and shed light and data for the interpretation and dating of the deposit or of the period to which it belongs. In this area, in the part excavated at greater depth, the geological level was reached at 9 m below the surface of the hill; those 9 m are archaeological deposits that have been accumulating throughout the five centuries of existence of the city. Therefore, the hill that forms the site is artificial and has been created by this accumulation of sediments and architectural structures; in archaeology, these artificial hills are called tell.\nDwellings during the fourth and third centuries B.C. C.\nWalking on the southern slope we reach a large excavated area with an area of about 1000 m2. Here we can see a group of dwellings and buildings dating from the 4th and 3rd centuries B.C., which has allowed us to learn about the urban planning of this phase. C. that has allowed us to know the urban planning of this phase. The houses are organized in fairly regular blocks that are distributed on the sides of wide streets with a rectilinear layout. The detected street, excavated about 36 m long and 4 m wide, runs parallel to the wall. The pavement consists of rammed clay, ceramic fragments, and small stones. The walls of the houses consist of a masonry plinth, while in the corners and doorways calcarenite ashlars were sometimes used to provide greater strength. The floors of the rooms are made of clay, while in some areas, identified as patios, there are stone pavements. Next to the dwellings, there are other rooms with basins and ovens that have been related to the manufacture of wine, which constitute the oldest wine cellar in the West. This wine was difficult to access (only for the upper classes) and was used in rituals related to the deities.\nIn the southern part of this excavation area, the remains of the wall are visible. The structure is defined by two parallel walls between which are interspersed and other smaller perpendicular walls that define small quadrangular spaces or casemates. Following the circuit of visits, further south you can see a section of this same wall, made with calcarenite ashlars of different sizes, very well squared, which are perfectly joined and locked together. This type of rigging is frequent in other Punic defensive constructions such as the walls of Cartagena and Carteia (San Roque), dating from the Barcid period.\nDwellings during the eighth century B.C. C.\nThe constructive remains belonging to the eighth century B.C., are located generally covered by a strong layer of accumulated sediments from later periods. C., are located generally covered by a strong layer of accumulated sediments from later periods, making it necessary to excavate between 7 and 9 m deep to find them. However, a large area outside the walls of the archaic city has been discovered in which there have been no superimposed later constructions, which has allowed the excavation in an extension of a large sector of dwellings belonging to these times. The dwellings are arranged on artificial terraces, taking advantage of the natural slope of the terrain. They are composed of 3 or 4 quadrangular rooms, built with masonry plinth walls and adobe elevations, plastered with clay, and plastered with lime. The floors are of tamped red clay and the roof is flat or with one water, formed by wooden beams and vegetal cover. Most of the houses had a bread oven consisting of a vaulted clay structure of approximately 1 m in diameter at the base.\nArchaic wall\nAs early as the 8th century, the city was provided with a powerful wall of which we know only a small part today. It rises directly from the natural terrain and is built with irregular masonry blocks, worked with red clay; in the excavated areas a height of 3 m is preserved. Just in front of the wall, a moat was built, with a V-shaped section, 20 m wide and 4 m deep. This wall was in use until the  5th century BC. In the 5th century B.C., the city was endowed with a new wall that only partly reused the previous one. Finally, in the 4th-3rd century B.C., the last wall was built.\nNecropolis\nOn the other side of the Carrera de El Portal, in the foothills of the Sierra de San Cristobal, is the necropolis. In it, the excavation of a tumulus of about 20 m in diameter and a maximum height of 1.80 m has been carried out. The central area was occupied by the ustrinum, where the corpse was cremated. Around it, there were 63 burials with a varied typologies ranging from urns of various types containing the ashes to simple hollows excavated in the natural ground for the same purpose.\nNon-excavated structures\nIn 2017, several structures annexed to those currently excavated were identified through the use of a portable georadar and a multichannel X stream. In principle, it is not planned to excavate them, and it is being considered to incorporate information about them through new technologies, enriching the visit to the site.\nFuture\nA project is being promoted to enhance the value of the area, including the slopes of the Sierra de San Cristóbal and the adjacent abandoned military resources under the name of \"Tierras de Sidueña\" (Sidueña Lands).\nThe government is also working on its declaration as a UNESCO World Heritage Site.\nSee also\n* Marquesado del Castillo del Valle de Sidueña\n* Tartessos\n* Turdetano\nReferences\nBibliography\n* Ruiz Mata, D. y Pérez, C.J. El poblado fenicio del Castillo de Doña Blanca. El Puerto de Santa María, editado por el Ayto. de El Puerto.1995.\n* Ruiz Mata, D., 1987. La formación de la cultura turdetana en la Bahía de Cádiz a través del Castillo de Doña Blanca, Iberos. Actas de las I Jornadas sobre el Mundo Ibérico (1985), Jaén, 299–315.\nExternal links\n* [https://commons.wikimedia.org/wiki/Category:Yacimiento_arqueol%C3%B3gico_de_Do%C3%B1a_Blanca Category:Yacimiento arqueológico de Doña Blanca - Wikimedia Commons]\n* [https://web.archive.org/web/20070928001015/http://www.elpuertosm.es/asp/secciones/render_sbm.asp?pagID=114-440]\n* [https://web.archive.org/web/20070310194208/http://www.jale.com/amigos-arqueologia/ AMICENES]\n* [https://web.archive.org/web/20140903131432/http://arqueologia-en-elpuerto-y-su-entorno.blogspot.com.es/2014/08/30-anos-de-la-excavacion-del-tumulo-1.html?spref=fb Arqueología en El Puerto y su entorno: 30 años de la excavación del Túmulo 1 de la Necrópolis de Las Cumbres, Castillo de Doña Blanca]\n* [http://www.iaph.es/patrimonio-inmueble-andalucia/resumen.do?id=i4806 Guia Digital IAPH]\n* [https://www.juntadeandalucia.es/cultura/enclaves/enclave-arqueologico-dona-blanca Enclave Arqueológico Castillo de Doña Blanca | Enclaves Culturales de Andalucía]"
    }
  ]
}