{
  "content": [
    {
      "type": "text",
      "text": "# Dongba Culture Museum\n\nDongba Culture Museum () is a museum in Lijiang City, Yunnan, China which deals with the Dongba culture of the Naxi (Nakhi) people.\nThe Naxi is a minority with a long history and a brilliant culture. With a population of 300,000, this group lives mainly in Yulong County, Lijiang City, Yunnan. It has become known worldwide or having kept its own ancient and unique Dongba Culture and thus claimed to be a small ethnic group that has created a grand culture.\nThe Dongba culture is a most inclusive term referring mainly to the language and scriptures. The Dongba language is actually composed of 1,400 picture-like characters and symbols that are still used by Dongbas, researchers and artists of the culture.  It is by now the only living hieroglyph in the world and is regarded as a precious cultural relic of mankind. On August 30, 2003, the museum's 1,000-volume collection of Dongba classical literature was added by UNESCO to the Memory of the World International Register, recognising it as documentary heritage of global importance.\nMany other countries have built their own collections of Dongba scriptures, for instance, the US, the UK, France, Japan, Germany, Italy and Austria. In the US alone, the collection in the Library of Congress plus that in Harvard University Library numbers over 4000 volumes.  In China, Dongba scriptures have been collected by the Library of Yulong County, the Library of Yunnan Province.\nFor better protection, research and development of the Dongba Culture, in 1984 the Naxi Dongba Cultural Museum was under at the Black Dragon Pool of Lijiang. The museum has more than 10,000 Dongba cultural relics and various other historical relics and offers the \"Dongba Culture Exhibition\", thereby attracting more than 100,000 visitors each year. Meanwhile, it also compiles and publishes Newsletter of Dongba Culture and has established the Lijiang Naxi Dongba Cultural School. For its outstanding work over the past years, county museums in China, awarded the honor of \"Advanced Cultural Unit in China\", and listed as one of the bases for patriotism education of the province.\nReferences\n*\n*[https://web.archive.org/web/20071222131200/http://english.ctrip.com/Destinations/DistrictCulture.asp?District=32 Ctrip - China Guide > Yunnan  > Lijiang ]"
    }
  ]
}