{
  "content": [
    {
      "type": "text",
      "text": "# Doraemon: Nobita's Little Star Wars 2021\n\n2021 | revhep = Doraemon: Nobita no Ritoru Sutā Wōzu 2021}}\n| director       = Susumu Yamaguchi\n| producer       = Aarav ogra\n| writer         =\n| screenplay     = Dai Satō\n| story          =\n| based_on       =\n| starring       =\n| narrator       =\n| music          = Takayuki Hattori\n| cinematography =\n| editing        =\n| studio         = Shin-Ei Animation\n| distributor    = Toho\n| released       =\n| runtime        = 108 minutes\n| country        = Japan\n| language       = Japanese\n| budget         =\n| gross          = $22.1 million\n}}\n2021|Doraemon: Nobita no Ritoru Sutā Wōzu 2021}} is a 2022 Japanese animated epic space opera film. It is the 41st Doraemon film and serves as a remake of the 1985 film ''Doraemon: Nobita's Little Star Wars''.\nPlot\nDuring summer vacation, Nobita and his friends begin making a sci-fi film on space war using a diorama at Suneo’s house. After feeling left out, Nobita discovers a tiny rocket containing Papi, the president of Planet Pirika, who is fleeing a rebel army led by General Gilmore and his agent Dorakoruru. Doraemon and the others befriend Papi and use the \"Small Light\" to shrink themselves and play with him, deepening their bond. When Papi’s location is discovered, they travel to Pirika to help the Freedom Alliance resist the dictatorship. Despite being captured and separated, the friends reunite when the Small Light’s effect wears off, returning to full size and rallying the people. Together, they defeat Dorakoruru, stop Gilmore, and restore peace to Pirika. Back on Earth, they screen their finished film, hinting it was based on their real adventure.\nCast\n{| class=\"wikitable\"\n! Character !! Voice actor\n|-\n|Doraemon||Wasabi Mizuta\n|-\n| Nobita Nobi ||Megumi Ōhara\n|-\n| Shizuka Minamoto ||Yumi Kakazu\n|-\n| Suneo Honekawa ||Tomokazu Seki\n|-\n| Takeshi 'Gian' Goda ||Subaru Kimura\n|-\n| Papi ||Romi Park\n|-\n| Piina || Mayu Matsuoka\n|-\n| Rokoroko ||Yuki Kaji\n|-\n| Dorakoruru ||Junichi Suwabe\n|-\n| Gilmore ||Teruyuki Kagawa\n|-\n| Underground leader || Takashi Utsumi (Milk Boy)\n|-\n| Pilot || Takashi Komaba (Milk Boy)\n|-\n| Tamako Nobi || Kotono Mitsuishi\n|-\n| Shizuka's Mother ||Ai Orikasa\n|-\n| Hidetoshi Dekisugi ||Shihoko Hagino\n|}\nSoundtrack\n* : Official Hige Dandism\n*  (Insert song): Billy BanBan\nStaff\n* Original: Fujiko F. Fujio\n* Director: Susumu Yamaguchi\n* Screenplay: Dai Satō\n* Character design: Koichi Maruyama\n* Mechanical design: Junya Ishigaki\n* Music: Takayuki Hattori\n*Production companies: Shin-Ei Animation, Shirogumi, TV Asahi and ADK\nProduction\nDevelopment\nKazuaki Imai, who directed the previous Doraemon feature film Nobita's New Dinosaur, was replaced by Susumu Yamaguchi. Yamaguchi stated, 'I used to participate only in drawing, but it was over. However, I thought, I want to make a Doraemon film before I die. So I took the initiative and acted under the name of the 'five-year plan.'\" He had previously worked on the production of TV specials and movies and appealed to the production team to direct this film. As a result, he was eventually chosen. However, because the production of an original film was difficult due to the schedules, Yamaguchi decided to remake ''Nobita's Little Star Wars. According to Yamaguchi, Nobita and the Castle of the Undersea Devil was also recommended, was not finalized because of the difficulty to animate scenes in underwater.\nDai Satō wrote the screenplay of the film, who has worked on many works including the Science fiction anime series Cowboy Bebop''. Yamaguchi said that he was glad with his screenplay.\nKoichi Maruyama was selected from the TV series for character design, and Junya Ishigaki was in charge of mechanical design.\nScreenwriting\nSato had written his own plot to make the remake compatible to the 2020s age. After that, it had turned out that director Susumu Yamaguchi had also written a plot based on similar changes. Therefore, the two decided to pursue the character of Papi, the guest character of this work. In the original story, Papi was separated from Nobita and others by PCIA in the first half of the story, but since it was not possible to show the interaction between Papi and Nobita and Papi's feeling about it, Sato had consulted with Yamaguchi and had decided to write the first half of the original shorter. For the same reason, Papi's older sister Piina had been introduced as a new character. In addition, the original Papi was depicted as \"an intelligent life form far superior to earthlings,\" which was slightly changed in the remake to make it compatible to the modern times. For this reason, a scene in which Papi becomes emotionally angry was included.\nFor characters other than Papi, a deep digging of the character was done. For example, in the case of Suneo, he was portrayed as a representative of the majority of people who want to be brave enough to do heroic things, but they only keep things to themselves. Also, in the original work, Suneo showed a war-weary attitude which remained in the remake, but scenes were increased where Suneo was reluctant to fight. Mayu Matsuoka, who voiced Piina, said in a stage greeting on 27 March 2022 that she had been encouraged by Suneo's honest expression of his fear of fighting.\nOn the other hand, Nobita had been depicted clumsy sometimes because they thought Nobita could be 'too heroic'.\nIn addition, in the original manga, the defeat of Gilmore by the public was easily drawn in one page. Sato said that he had focused on Gilmore's coronation ceremony, which had been only mentioned in the original manga, while it had been difficult to come up with a good idea, although it had lacked balance if he followed the depiction of the final stage because he had strengthened other part.\nGilmore's coronation ceremony had been set with Papi's death penalty, and the content of Papi's speech was based on his interaction with Nobita and others. Also Papi's scream to Gilmore in the original was the scene when the death sentence was announced, but since the public did not witness the scene and it looked like a loser's howl, in the remake it was changed to Gilmore's coronation ceremony, which led the public to an uprising.\nCasting\nAmong the guest voice actors, Mayu Matsuoka was selected as Papi's older sister, Piina. In an interview with Animate Times, Yamaguchi revealed that when he heard Matsuoka's first line, 'Doracoluru', he felt that Matsuoka was a good choice. In addition, the leader of the underground organization and the pilot of the Free Alliance, who were collaborators of Doraemon and others, were played by the comedy duo Milk Boy, Takashi Utsumi and Takashi Komaba respectively. In an interview with the Animate Times, Yamaguchi said that the two characters in the play are not comedy relief, but rather young people who are desperate to save their nation. Teruyuki Kagawa was appointed as Gilmore, the dictator of the planet Pirika. Yamaguchi revealed in an interview with Animate Times that he had asked Kagawa to play 'the most hated person' in a letter. He also said that Kagawa was acting with his body and gestures. Romi Park, Yuki Kaji and Junichi Suwabe were selected as Papi, Rokoroko and Dorakoruru respectively.\nVisual effects\nCare was taken to keep the character designs close to the original, but not too old-fashioned. Also, in the remake, as a respect for special effects films of the 20th century, real miniatures are used as part of the background in some scenes, which is the first time in the Doraemon film series.\nPromotion\nOn 16 November 2020, it was announced that the film would get release on 5 March 2021. Major staff and theme song artist were also announced. On 9 January 2021, The theme song Universe by Official Hige Dandism was published on the YouTube channel of the pop band. The release date of the film got postponed indefinitely due to the COVID-19 pandemic on 29 January 2021. After almost six months, on 17 July 2021 it was announced that the film would get release in early 2022. On 9 November 2021, the new release date, 4 March 2022 was announced and guest voice actors were announced of the following two characters, Piina and Gilmore. After nine days, on 18 November 2021, a new trailer was published on the official YouTube channel and voice actors of Papi, Rokoroko and Dorakoruru were announced. On 17 January 2022, insert song artist was announced. Two more guest voice artists were announced on 25 January 2022.\nRelease\nTheatrical\nThe film was released in theaters on 4 March 2022 in Japan after being postponed from 5 March 2021 due to COVID-19 pandemic. Vietnamese film distributor CGV released this film in Vietnam on 27 May 2022. It was released in China on 28 May 2022. The film was released by Odex in Malaysia on 16 June 2022. Odex opened a fan screening of the film on 9 July 2022 and SM Cinema generally released it in theatres in Philippines on 13 July 2022. In Taiwan it was released on 15 July 2022. Odex also released the film in Azerbaijan and Mauritius on 30 June 2022, in Bahrain, Oman, Kuwait, Saudi Arabia, United Arab Emirates, Iraq, Qatar, Jordan and Lebanon on 7 July 2022, in Egypt on 20 July 2022, in Cyprus on 21 July 2022, and in South Africa on 5 August 2022. The film was also released in South Korea on 3 August 2022. It got a release in Turkey on 5 August 2022, with a Turkish-language dub. The film was released in Thailand on October 10, 2022.\nHome media\nIt has been streaming on Amazon Prime Japan from August 2022. It was also released on DVD and Blu-Ray in Japan on December 7, 2022. The upcoming releases also contains bonus materials.\nReception\nBox office\n''Doraemon: Nobita's Little Star Wars 2021 debuted at no. 1 in its first weekend, with a sell of about 350,000 tickets in its first three days. According to Box Office Mojo, it grossed $22,060,623 at the box office.\nHere is a table which shows the box office of this movie of all the weekends in Japan:\n{| class=\"wikitable\"\n!Weekend no.\n!Rank\n!Weekend gross\n!Total gross till current weekend\n!Ref.\n|-\n|1\n|1\n|\n()\n|\n()\n|\n|-\n|2\n|1\n|\n()\n|\n()\n|\n|-\n|3\n|2\n|\n()\n|\n()\n|\n|-\n|4\n|3\n|\n()\n|\n()\n|\n|-\n|5\n|3\n|\n()\n|\n()\n|\n|-\n|6\n|3\n|\n()\n|\n()\n|\n|-\n|7\n|4\n|\n()\n|\n()\n|\n|-\n|8\n|8\n|\n()\n|\n()\n|\n|-\n|9\n|8\n|\n()\n|\n()\n|\n|-\n|10\n|10\n|\n()\n|\n()\n|\n|}\nIn Vietnam, the movie also debuted at no.1 in its first weekend, grossed 119.8 billion dong ($5115.94) and surpassed Top Gun: Maverick'' in the Vietnamese box office.\nCritical response\nA week before its release, the Russian invasion of Ukraine had begun. As a result, the story of the film is compared with the incident. Among them, RealSound 's Kazuma Kubota points out that the pendant Papi wears in the film is the same color as the Ukrainian flag.\nWriter Kaeru Inaka, in an article of 'Real Sound', praised the opening scene from Papi's escape to Nobita's movie shooting and also commented about the fast-going events of the first part of the film. Inaka also evaluated that the scene where Nobita and his friends became small, played with Papi and enjoyed the extraordinary life was a good link between the everyday scene and the upcoming war. In addition, Inaka pointed out that recent Doraemon movies tend to exaggerate emotional expressions so that even children can understand, but the animations had been done carefully so that it did not seem to be a joke. He said that the staff had been succeeded in making the film so that even children feel the terror of war.\nWriter Hodaka Sugimoto wrote an article on the anime-specialized news site AnimeAnime.jp.  He says that the pitifulness of dictatorship can be understood well through the contrast between Dorakoruru and Gilmore. In addition, Sugimoto pointed out that the bravery of the common people of Pirika was emphasized more than the original manga and the 1985 version and highlighted that not an external military force, but the common people living in the planet overthrow the oppressive regime.\nOther media\nBook\nA novel written by Naohiro Fukushima and based on the film was released on 4 February 2022.\nVideo game\nA Nintendo Switch game based on the film and created by FuRyu was scheduled to be released on 4 March 2021, but its release was postponed, along with the film, due to COVID-19 pandemic. The game was released on 4 March 2022.\nSee also\n* List of Doraemon films\nReferences\nExternal links\n*\n*\n*"
    }
  ]
}