{
  "content": [
    {
      "type": "text",
      "text": "# Dorking Deepdene railway station__disambig_1\n\n| grid_name           = Grid reference\n| grid_position       =\n| manager             = Great Western Railway\n| platforms           = 2\n| code                = DPD\n| classification      = DfT category F1\n| original            = Reading, Guildford and Reigate Railway\n| pregroup            = South Eastern Railway\n| postgroup           = Southern Railway\n| years               =\n| events              = Station opened as Box Hill and Leatherhead Road\n| years1              = March 1851\n| events1             = Renamed Box Hill\n| years2              = 1 January 1917\n| events2             = Temporarily closed\n| years3              = 1 January 1919\n| events3             = Reopened\n| years4              = 9 July 1923\n| events4             = Renamed Deepdene\n| years5              = 11 May 1987\n| events5             = Renamed Dorking (Deepdene)\n| mpassengers =\n0.407 million |interchange= 0.262 million}}\n90,096 |interchange= 82,960}}\n0.237 million |interchange= 0.186 million}}\n0.422 million |interchange= 0.218 million}}\n0.464 million |interchange= 0.201 million}}\n| footnotes           = Passenger statistics from the Office of Rail and Road\n}}\nDorking Deepdene railway station is a railway station in the town of Dorking, Surrey, England. Located on the North Downs Line, it lies  from  (via ). The station is one of three within Dorking, alongside  (elsewhere on the North Downs line) and  (on the Mole Valley line). The station is within walking distance of Dorking station and interchange on a through ticket is permitted.\nDorking Deepdene is managed by Great Western Railway, which also operates all services through the station.\nThe station has two platforms, each long enough to accommodate a four-carriage train. It is unstaffed and has no ticket office. Tickets can be bought on trains, at the automatic ticket machine at the entrance to the station, or at the ticket office at nearby Dorking station, which sells tickets for all National Rail services. The station is located on an embankment above street level and the platforms can only be reached by steps; passengers who require step-free access are advised to instead use Dorking West station, approximately  to the west, which is fully wheelchair-accessible.\nHistory\nThe Reading, Guildford and Reigate Railway (RG&RR) was authorised in 1846 and opened in stages. One of the first parts to open was between  and Dorking, on 4&nbsp;July&nbsp;1849; the terminus was at the present-day Dorking West station.\nA second station in Dorking, which is now Dorking Deepdene, was not built until 1&nbsp;February&nbsp;1851; when it opened, it was originally named \"Box Hill and Leatherhead Road\" and it was shortened to \"Box Hill\" in March the same year. The RG&RR was soon absorbed by the South Eastern Railway (SER).\nThe station at Box Hill was temporarily closed from 1&nbsp;January&nbsp;1917, and reopened on 1&nbsp;January&nbsp;1919. In the 1923 grouping the SER became part of the new Southern Railway, which on 9&nbsp;June of that year renamed the station \"Deepdene\" to avoid confusion with  station. On 11&nbsp;May&nbsp;1987 British Railways renamed the station \"Dorking (Deepdene)\".\nServices\narriving at Dorking Deepdene with a GWR service from  to ]]\nAll services at Dorking Deepdene are operated by Great Western Railway using  and  DMUs.\nThe typical off-peak service is two trains per hour in each direction between  via  and . During the late evenings, the service is reduced to hourly in each direction.\nOn Sundays, only one eastbound train per hour runs to Gatwick Airport, with one train per hour running only as far as .\n}}\nFuture proposals\nIn November 2018, a £21 million upgrade of Dorking Deepdene station was proposed by the Dorking Town Forum, who submitted a nomination for funding from Network Rail. The proposal includes:\n* relocation of the platforms east of the current site (immediately west of the bridge over the Mole Valley line);\n* construction of two new lifts, to allow step-free access to both platforms, and a pair of new waiting rooms;\n* a direct foot link between Dorking Deepdene and  stations, by means of a new -long walkway constructed along the western edge of the Mole Valley line.\nReferences\nExternal links"
    }
  ]
}