{
  "content": [
    {
      "type": "text",
      "text": "# Dorothy Price (art historian)\n\n|birth_name= Dorothy Cilla Rowe\n|birth_date=\n|birth_place=\n|death_date=\n|death_place=\n|death_cause=\n|nationality= British\n|occupation=\n|education=\n|alma_mater=University of LeicesterUniversity of Essex\n|discipline=History of Art\n|sub_discipline=\n|workplaces=\n}}\nDorothy Cilla Price  (born 1969) is a British art historian and academic. She is Professor of Modern and Contemporary Art and Critical Race Art History at the Courtauld Institute of Art. She was previously Professor of History of Art at the University of Bristol, and was the first woman of colour to be appointed to a Chair in Art History at a Russell Group university. Price researches, teaches, and curates on \"histories, art and thought of people of African descent\", also teaching on German modernism, German expressionism, and post-war Black British art, with a focus on women artists. In 2021, she was elected a Fellow of the British Academy.\nCareer\nPrice studied history of art at the University of Leicester.\nAs Professor of History of Art at Bristol, Price was a founder member and inaugural Director of the Centre for Black Humanities. She was appointed Professor of Modern and Contemporary Art and Visual Culture at the Courtauld in 2021.\nPrice has served as Editor of Art History, the journal of the Association for Art History. In 2021, she co-edited a special issue with Sonia Boyce on Black British Modernism.\nIn 2022, Price curated 'Making Modernism' at the Royal Academy, London, focussed on women artists working in Germany in the early 1900s.\nAcademic and public service\nPrice is a trustee of the Holburne Museum, Bath and a trustee of Spike Island, Bristol.\nWith Chantal Joffe and Andrew Nairne, Price served as a judge for the Trinity Buoy Wharf Drawing Prize 2019.\nShe sits on the Academic Advisory Board and Exhibitions Committee of the Royal West of England Academy.\nIn 2019 Price founded the British Art Network subgroup on Black British Art at the Tate/Paul Mellon Centre.\nShe is a continuing member of the British Art Network Steering Group in 2021–2022.\nSelected publications\n* Representing Berlin (2003)\n* Women the Arts and Globalization (with Marsha Meskimmon) (2013)\n* After Dada (2013)\n* Chantal Joffe: Personal Feeling is the Main Thing (2018). This book project stemmed for work done as co-curator with Joffe of an exhibition at The Lowry, Salford in 2018.\n* Catherine Grant and Dorothy Price, “Decolonizing Art History”, Art History 43, no. 1 (January 2020): 8–66, doi:10.1111/1467-8365.12490.\nReferences"
    }
  ]
}