{
  "content": [
    {
      "type": "text",
      "text": "# Dorset culture__disambig_1\n\nThe Dorset was a Paleo-Eskimo culture, lasting from  to between  and , that followed the Pre-Dorset and preceded the Thule people (proto-Inuit) in the North American Arctic. The culture and people are named after Cape Dorset (now Kinngait) in Nunavut, Canada, where the first evidence of its existence was found. The culture has been defined as having four phases due to the distinct differences in the technologies relating to hunting and tool making. Artifacts include distinctive triangular end-blades, oil lamps (qulliq) made of soapstone, and burins.\nThe Dorset were first identified as a separate culture in 1925. The Dorset appear to have been extinct by 1500 at the latest and perhaps as early as 1000. The Thule people, who began migrating east from Alaska in the 11th century, ended up spreading through the lands previously inhabited by the Dorset. It is not fully known whether the Inuit and Dorset ever met. Some modern genetic studies show the Dorset population were distinct from later groups and that \"There was virtually no evidence of genetic or cultural interaction between the Dorset and the Thule peoples.\"\nInuit legends recount them encountering people they called the  (in syllabics: ᑐᓃᑦ, singular ᑐᓂᖅ ). According to legend, the first inhabitants were giants, taller and stronger than the Inuit but afraid to interact and \"easily put to flight\".\nDiscovery\nnear Cambridge Bay, Nunavut]]\nIn 1925, anthropologist Diamond Jenness received artifacts from Cape Dorset, now Kinngait. As they were quite different from those of the Inuit, he speculated that they were indicative of an ancient, preceding culture.  Jenness named the culture \"Dorset\" after the location of the find.  These artifacts showed a consistent and distinct cultural pattern that included sophisticated art distinct from that of the Inuit.  For example, the carvings featured uniquely large hairstyles for women, and figures of both sexes wearing hoodless parkas with large, tall collars.  Much research since then has revealed many details of the Dorset people and their culture.\nHistory\nOrigins\nThe origins of the Dorset people are not well understood. They may have developed from the previous cultures of Pre-Dorset, Saqqaq or (less likely) Independence I. There are, however, problems with this theory: these earlier cultures had bow and arrow technology which the Dorsets lacked. Possibly, due to a shift from terrestrial to aquatic hunting, the bow and arrow became lost to the Dorset. Another piece of technology that is missing from the Dorset are drills: there are no drill holes in Dorset artifacts. Instead, the Dorset gouged lenticular holes. For example, bone needles have long, narrow holes that were painstakingly carved or gouged. Both the Pre-Dorset and Thule (Inuit) had drills.\nHistorical and cultural periods\nDorset culture and history is divided into periods: the early (), middle (), and late phases (), as well as perhaps a terminal phase (from  onwards). The terminal phase, if it existed, would likely be closely related to the onset of the Medieval Warm Period, which started to warm the Arctic considerably around the mid-10th century. With the warmer climates, the sea ice became less predictable and was isolated from the High Arctic.\nThe Dorset were highly adapted to living in a very cold climate, and much of their food is thought to have been from hunting sea mammals that breathe through holes in the ice. The massive decline in sea-ice which the Medieval Warm Period produced would have strongly affected the Dorset. They could have followed the ice north. Most of the evidence suggests that they disappeared some time between 1000 and 1500. Radiocarbon dating has shown the Dorset were living in the Cambridge Bay area as late as 1350 CE, while the Thule Inuit moved into the area around 1200 CE.  Scientists have suggested that they disappeared because they were unable to adapt to climate change or that they were vulnerable to newly introduced disease.\nTechnology\nThe Dorset adaptation was different from that of the whaling-based Thule Inuit. Unlike the Inuit, they rarely hunted land animals, such as polar bears and caribou. They did not use bows or arrows. Instead, they seem to have relied on seals and other sea mammals that they apparently hunted from holes in the ice. Their clothing must have been adapted to the extreme conditions.\nTriangular end-blades and burins are diagnostic of the Dorset. The end-blades were hafted onto harpoon heads. They primarily used the harpoons to hunt seal, but also hunted larger sea mammals such as walrus and narwhals. They made lamps, called qulliq, from soapstone and filled them with seal oil. Burins were a type of stone flake with a chisel-like edge. They were probably either used for engraving or for carving wood or bone. Burins were also used by Pre-Dorset groups and had a distinctive mitten shape.\nThe Dorset were highly skilled at making refined miniature carvings, and striking masks. Both indicate an active shamanistic tradition. The Dorset culture was remarkably homogeneous across the Canadian Arctic, but there were some important variations which have been noted in both Greenland and Newfoundland / Labrador regions.\nInteraction with Inuit\nThere appears to be no genetic connection between the Dorset and the Thule who replaced them. Archaeological and legendary evidence is often thought to support some cultural contact, but this has been questioned. The Dorset people, for instance, engaged in seal-hole hunting, a method which requires several steps and includes the use of dogs. The Thule apparently did not use this technique in the time they had previously spent in Alaska. Settlement pattern data has been used to claim that the Dorset also extensively used a breathing-hole sealing technique and perhaps they would have taught this to the Inuit. But this has been questioned on the grounds that there no evidence has been identified that the Dorset had dogs.\nSome Inuit elders describe peace with an ancient group of people, while others describe conflict.\nSadlermiut\n; 1824)]]\nScholars had thought that the Sadlermiut, a people living in near isolation mainly on and around Coats Island, Walrus Island, and Southampton Island in Hudson Bay up until 1902–03, might have been the last remnants of the Dorset culture, as they had a culture and dialect distinct from the mainland Inuit. Encounters with Europeans and exposure to infectious disease caused the deaths of the last members of the Sadlermiut.\nA 2002 paper suggested that the mitochondrial DNA (mtDNA) of Sadlermiut people was related to that of both the Dorset and Thule peoples, perhaps suggesting local admixture.\nA subsequent 2012 genetic analysis, however, showed no genetic link between the Sadlermiut and the Dorset.\nGenetics\nA genetic study published in Science in August 2014 examined the remains of nineteen Dorset people buried in Canada and Greenland between c.  and . The sixteen samples of mtDNA extracted were determined to belong to haplogroup D2a1 (twelve samples), D2a (three samples) and D. These haplogroups also predominate in the preceding Saqqaq culture, suggesting genetic continuity between the two. The authors of the study suggested that the ancestors of the Saqqaq and Dorset entered North America from Siberia in a single distinct migration about , after which they remained genetically largely isolated for thousands of years. The Dorset were genetically distinct from the Thule people who, after expanding out of Siberia, completely replaced the Dorset people around . The study also found no evidence of genetic mixing between Dorset people and the Greenlandic Norse people.\nSee also\n* Qajartalik\nReferences\nBibliography\n*\n*\n*\n*\n*\n* }}\n*\nExternal links\n* [http://www.avataq.qc.ca/en/L-institut/Departements/Archeologie/Decouvrir-l-archeologie/Chronologie-de-l-Arctique \"Dorset Culture in Nunavik\"], Avataq\n*[https://web.archive.org/web/20050328183720/http://www.nunatsiaq.com/archives/nunavut020705/news/editorial/columns.html \"In the bones of the world\"], Nuntsiaq News\n*[http://www.civilization.ca/cmc/archeo/cvh/arctic/earc7.htm \"Dorset Paleoeskimo Culture\"], Canada.ca.\nde:Inuit-Kultur#Dorset-Kultur (500 v. Chr. bis 1000 n. Chr.)"
    }
  ]
}