{
  "content": [
    {
      "type": "text",
      "text": "# Douglas Ewart\n\n| birth_place     = Kingston, Jamaica\n| origin          =\n| death_date      =\n| death_place     =\n| genre           =\n| occupation      = Composer, Instrumentalist, Instrument Builder, Educator, Community Builder, Philosopher, Writer\n| instrument      =\n| years_active    =\n| label           =\n| website         =\n}}\nDouglas R. Ewart (born 13 September 1946 in Kingston, Jamaica) is a Jamaican multi-instrumentalist and instrument builder. He plays sopranino and alto saxophones, clarinets, bassoon, flute, bamboo flutes (shakuhachi, ney, and panpipes), and didgeridoo; as well as Rastafarian hand drums (nyabingi, repeater, and bass).\nEwart emigrated to the United States in June 1963 (coming to Chicago) and became associated with the Association for the Advancement of Creative Musicians (AACM) in 1967, studying with Joseph Jarman and Roscoe Mitchell.  He served as that organization's president from 1979 to 1986.\nHe has performed or recorded with J. D. Parran, Muhal Richard Abrams, Art Ensemble of Chicago, Anthony Braxton, Alvin Curran, Anthony Davis, Robert Dick, Von Freeman, Joseph Jarman, Amina Claudine Myers, Roscoe Mitchell, James Newton, Rufus Reid, Wadada Leo Smith, Cecil Taylor, Richard Teitelbaum, Henry Threadgill, Hamid Drake, Don Byron, Malachi Favors Maghostut, and George Lewis.\nIn 1992, Ewart collaborated with Canadian artist Stan Douglas on the video installation Hors-champs which was featured at documenta 9 in Kassel, Germany. The installation features Ewart in an improvisation of Albert Ayler's \"Spirits Rejoice\" with musicians George Lewis, Kent Carter and Oliver Johnson.\nHe has lived in Minneapolis, Minnesota since 1990. His father, Tom, was a cricket umpire.\nDiscography\nAs leader\n* Douglas R. Ewart and Inventions Clarinet Choir: Red Hills (Aarawak, 1983)\n* Douglas R. Ewart and Inventions: Bamboo Forest (Aarawak, 1990)\n* Douglas R. Ewart: Bamboo Meditations At Banff (Aarawak, 1994)\n* Douglas R. Ewart and Inventions Clarinet Choir: Angles of Entrance (Aarawak, 1998)\n* Douglas R. Ewart and Inventions Clarinet Choir: Newbeings (Aarawak, 2001)\n* Douglas R. Ewart: Songs Of Sunlife - Inside The Didjeridu (Innova, 2003)\n* Douglas R. Ewart and Inventions: Velvet Fire: Dedicated to Baba Fred Anderson (Aarawak, 2009)\n* Nyahbingi Drum Choir: Velvet Drum Meditations (Aarawak, 2010)\nAs Collaborator\nWith Muhal Richard Abrams\n* Lifea Blinec (Arista/Novus, 1978)\nWith Spencer Barefield and Tani Tabbal\n* Beneath Detroit- The Creative Arts Collective Concerts At The Detroit Institute Of Arts 1979-1992 (Geodesic, 2010)\nWith Anthony Braxton\n* For Trio (Arista, 1978)\nWith Jean-Luc Cappozzo, Joëlle Léandre, Bernard Santacruz, Michael Zerang\n* Sonic Communion (The Bridge Sessions, 2015)\nWith Chico Freeman\n* Morning Prayer (Whynot, 1976)\nWith Dennis González\n* Namesake (Silkheart, 1987)\nWith Yusef Lateef, Roscoe Mitchell, Adam Rudolph\n* Voice Prints (Meta Records, 2013)\nWith George Lewis\n* Shadowgraph (Black Saint, 1978)\n* Homage to Charles Parker (Black Saint, 1979)\n* Jila Save! Mon. - The Imaginary Suite (Black Saint, 1979)\n* Chicago Slow Dance (Lovely Music, 1981)\nWith Roscoe Mitchell\n* L-R-G / The Maze / S II Examples (Nessa Records, 1978)\n* Sketches from Bamboo (Moers Music, 1979)\nWith Wadada Leo Smith\n* Budding of a Rose (Moers Music, 1979)\nWith Henry Threadgill\n* X-75 Volume 1'' (Arista/Novus, 1979)\nReferences\nExternal links\n*[http://www.douglasewart.com Douglas Ewart official site]"
    }
  ]
}