{
  "content": [
    {
      "type": "text",
      "text": "# Doug Wright Award\n\n-->\n| location       =\n| country        = Canada\n| reward         = Wood-and-glass trophy\n| year           =\n| year2          =\n| holder         =\n| website        = http://www.dougwrightawards.com\n| network        =\n| runtime        =\n| ratings        =\n| previous       =\n| main           =\n| next           =\n}}\nThe Doug Wright Awards for Canadian Cartooning (established in December 2004), handed out annually since 2005 during the Toronto Comic Arts Festival, are literary awards given to Canadian cartoonists. Honouring excellence in comics (including webcomics) and graphic novels published in English (including translated works), the awards are named in honour of Canadian cartoonist Doug Wright. Winners are selected by a jury of Canadians who have made significant contributions to national culture, based on shortlisted selections provided by a nominating committee of five experts in the comics field.\nThe Wright Awards are handed out in four categories:\n* The Doug Wright Award for Best Book\n* The Nipper: The Doug Wright Award for Emerging Talent (formerly known as \"The Spotlight Award\")\n* The Pigskin Peters: The Doug Wright Award for Best Small- or Micro-press Book (first awarded in 2008; it was formerly awarded for \"experimental, non-traditional or avant-garde comics,\" though these books are still considered \"especially welcome in this category\");\n* The Egghead: The Doug Wright Award for Best Kids’ Book (first awarded in 2020; for young readers ages 0-12)\nIn addition to the awards, since 2005 the organizers annually induct at least one cartoonist into the Giants of the North: The Canadian Cartoonist Hall Fame.\nThe Wright Awards are modeled after traditional book prizes, with the intention of drawing attention to the comics medium from a broad range of demographics inside and outside of its traditional fanbase. The Wrights have garnered acclaim as well as earning the support of a diverse range of participating artists and jurors including Scott Thompson, Don McKellar, Bruce McDonald, Jerry Ciccoritti, Bob Rae, Andrew Coyne, Sara Quin, Greg Morrison, Chester Brown, Lorenz Peter, and Nora Young.\nAwards\nThe Best Book and The Nipper (Spotlight) awards are large wood-and-glass trophies which are engraved with images from Wright's comic strip (the one difference being the images that are etched on the glass). The award were designed by the cartoonist Seth, who admitted to some embarrassment at being the inaugural winner of the trophy he designed. The Pigskin Peters Award, named in honour of a character from Jimmy Frise's Birdseye Center, is a custom, tailored derby hat with its own unique plaque that doubles as a hat post. It was also designed by Seth.\nEach recipient of a Doug Wright Award also receives a custom-bound copy of their winning work.\nNominees & Winners\n2024\nSource:\nThe Doug Wright Award for best book\n* 'WINNER - A Guest in the House by Emily Carroll (First Second)'\n* Val-d’Or Neon by Olivier Ballou (Self-published)\n* ''Harvey Knight's Odyssey by Nick Maandag (Drawn & Quarterly)\n* Naked: The Confessions of a Normal Woman by Éloïse Marseille (Pow Pow Press)\n* Roaming by Jillian Tamaki and Mariko Tamaki (Drawn & Quarterly)\n* JAJ by Michael Nicoll Yahgulanaas (Douglas & McIntyre)\nSpotlight Award (aka The Nipper)\n* 'WINNER - Vincy Lim for ''When I was a kid I was taught how to die. Now that I'm an adult I'm learning how to live. (I love you.) and When She Set Fire to My Friends’ Houses (Self-published)'\n* James Collier forThe Lonesome Shepherd (Wig Shop)\n* Syd Madia for ''Syd Madia's Dracula (Self-published)\n* Christopher Twin for Bad Medicine (Emanata/Conundrum)\n* Kyle Vingoe-Cram for Kettle Harbour (Conundrum Press)\nThe Pigskin Peters: The Doug Wright Award for best small- or micro-press book\n* 'WINNER - Old Caves by Tyler Landry (Uncivilized)'\n* Endsickness No. 2 by Sofia Alarcon (Self-published)\n* The Lonesome Shepherd by James Collier (Wig Shop)\n* Power 9: Part One by John Little and David Little (Self-published)\n* Index by Sven, Rachel Evangeline Chiong, and Joyce Kim (Self-published)\nThe Egghead Award\n* 'WINNER - Otis & Peanut by Naseem Hrab and Kelly Collier (Owlkids Books)'\n* ThunderBoom by Jack Briglio and Claudia Dávila (Kids Can Press)\n* Pluto Rocket: New in Town by Paul Gilligan (Tundra Books)\n* Hockey Girl Loves Drama Boy by Faith Erin Hicks (First Second)\n* Bad Medicine by Christopher Twin (Emanata/Conundrum)\n2023\nSource:\nThe Doug Wright Award for best book\n* 'WINNER - Ducks: Two Years in the Oil Sands by Kate Beaton (Drawn & Quarterly)'\n* Time Zone J by Julie Doucet (Drawn & Quarterly)\n* Shelterbelts by Jonathan Dyck (Conundrum Press)\n* The Flamingo by Guojing (Random House Studio)\n* Kwändürby Cole Pauls (Conundrum Press)\n* You Know, Sex by Cory Silverberg and Fiona Smyth (Triangle Square)\nSpotlight Award (aka The Nipper)\n* 'WINNER - Jonathan Dyck for Shelterbelts (Conundrum Press)'\n* Emily Carrington for Our Little Secret (Drawn & Quarterly)\n* Kiona Callihoo Ligtvoet for We Were Younger Once (Conundrum Press)\n* Lynette Richards for Call Me Bill (Conundrum Press/Emanata Imprint)\n* Adam de Souza for Blind Alley No. 1, ISH (Self-Published, Silver Sprocket)\nPigskin Peters Award\n* 'WINNER - Where Have You Been? by Ivana Filipovich (trans: Ivana Filipovich/Andrea Hankinson) (Self-Published)'\n* The Life I Want by Patrick Allaby (Self-Published)\n* Assorted Baggage by Matthew Daley (Black Eye Books)\n* Butterfly House by Troy Little and Brenda Hickey (Pegamoose Press)\n* Thousand Oaks: Machine Mail (Part 3) by Blaise Moritz (Urban Farm Print and Sound)\nThe Egghead Award\n* 'WINNER - You Know, Sex by Cory Silverberg and Fiona Smyth (Triangle Square)'\n*Scout is Not a Band Kid by Jade Armstrong (Random House Graphic)\n* Paws: Mindy Makes Some Space by Michele Assarasakorn and Nathan Fairbairn (Razorbill)\n* Super Family! (Simon and Chester Book 3) by Cale Atkinson (Tundra Books)\n* The Flamingo by Guojing (Random House Studio)\n2022\nSource:\nThe Doug Wright Award for best book\n* 'WINNER - The Shiatsung Project by Brigitte Archambault (Conundrum Press)'\n* Cyclopedia Exotica by Aminder Dhaliwal (Drawn & Quarterly)\n* The Rock From the Sky by Jon Klassen (Candlewick Press)\n* Stone Fruit by Lee Lai (Fantagraphics)\n* Fictional Father by Joe Ollmann (Drawn & Quarterly)\nSpotlight Award (aka The Nipper)\n* 'WINNER - Sami Alwani for The Pleasure of the Text. (Conundrum Press)'\n* Sofia Alarcon for Endsickness No. 1 (Self-published)\n* Brigitte Archambault for The Shiatsung Project (Conundrum Press)\n* Alexander Laird for Sleemor Gank: Burg Land No. 1 (Self-published)\n* Kyle Simmers and Ryan Danny Owen for Pass Me By: Gone Fishin’ and Pass Me By: Electric Vice (Renegade Arts Entertainment)\nPigskin Peters Award\n* 'WINNER - Dwellings No. 2 by Jay Stephens (Black Eye Books)'\n* Endsickness No. 1 by Sofia Alarcon (Self-published)\n* Fruit/Soil by Kim Edgar (Moniker Press)\n* The Northern Gaze by Akeeshoo Chislett, Chris Caldwell, Cole Pauls, Andrew Sharp, Juliann Fraser, Esther Bordet, Alison McCreesh, Keith Verbonac, Princess J; edited by Kim Edgar (Hecate Press)\n* Sleemor Gank: Burg Land No. 1 by Alexander Laird (Self-published)\nThe Egghead Award\n* 'WINNER - ''Shirley and Jamila's Big Fall by Gillian Goerz (Dial Books for Young Readers)'\n* Simon and Chester: Super Sleepover! by Cale Atkinson (Tundra Books)\n* Otter Lagoon by Mike Deas and Nancy (Deas Orca Book Publishers)\n* Living with Viola by Rosena Fung (Annick Press)\n* Over the Shop by JonArno Lawson and Qin Leng (Candlewick Press)\n* Etty Darwin and the Four Pebble Problem by Lauren Soloy (Tundra Books)\n2021\nThe Doug Wright Award for best book\n* 'WINNER - Lonely Boys by S. Bédard (Pow Pow Press)'\n* Familiar Face by Michael DeForge (Drawn & Quarterly)\n* Constantly by GG (Koyama Press)\n* Paul at Home by Michel Rabagliati (Drawn & Quarterly)\n* Wendy, Master of Art by Walter Scott (Drawn & Quarterly)\nThe Nipper: The Doug Wright Award for emerging talent\n* 'WINNER - Veronica Post for Langosh & Peppi: Fugitive Days (Conundrum Press)'\n* Adam de Souza for A Gleaming No. 2 (Self-published)\n* Kimberly Edgar for The Space In Between (Self-published)\n* Courtney Loberg for ''We Don't Go Through the Angelgrass (Self-published)\n* Shannon M. Reeves for Restless Bones (Gytha Press)\nThe Pigskin Peters: The Doug Wright Award for best small- or micro-press book\n* 'WINNER - The Noiseless Din by Scott Carruthers (Popnoir Editions)'\n* The Desecration by Scott Carruthers and Sally McKay (Self-published)\n* A Gleaming No. 2 by Adam de Souza (Self-published)\n* The Space In Between by Kimberly Edgar (Self-published)\n* Awkward Pause by Ryan Harby (Renegade Arts Entertainment)\nThe Egghead: The Doug Wright Award for best kids’ book\n* 'WINNER - A Slug Story by Mandi Kujawa, Hana Kujawa, Claude St. Aubin, and Lovern Kindzierski Renegade Arts Entertainment'\n* The Little Ghost Who Was a Quilt by Riel Nason and Byron Eggenschwiler (Tundra Books)\n* Okay, Universe: Chronicles of a Woman in Politics by Valérie Plante and Delphie Côté-Lacroix (Drawn & Quarterly)\n* Grandmother School by Rina Singh and Ellen (Rooney Orca Book Publishers)\n* Swift Fox All Along by Rebecca Thomas and Maya McKibbin (Annick Press)\n2020\nThe Doug Wright Award for best book\n* 'WINNER - Bezimena by Nina Bunjevac (Fantagraphics Books)'\n* This Place: 150 Years Retold by Kateri Akiwenzie-Damm, Sonny Assu, Brandon Mitchell, Rachel and Sean Qitsualik-Tinsley, David A. Robertson, Niigaanwewidam James Sinclair, Jen Storm, Richard Van Camp, Katherena Vermette, Chelsea Vowel, Tara Audibert, Kyle Charles, GMB Chomichuk, Natasha Donovan, Scott A. Ford, Scott B. Henderson, Ryan Howe, Andrew Lodwick, Jen Storm, Donovan Yaciuk, Alicia Elliott (HighWater Press)\n* The Cursed Hermit by Kris Bertin, Alexander Forbes (Conundrum Press)\n* Agnes, Murderess by Sarah Leavitt (Freehand Books)\n* Death Threat by Vivek Shraya, Ness Lee (Arsenal Pulp Press)\n* Bradley of Him by Connor Willumsen (Koyama Press)\nThe Nipper: The Doug Wright Award for emerging talent\n* 'WINNER - Sylvia Nickerson for Creation (Drawn & Quarterly)'\n* D. Boyd for Chicken Rising (Conundrum Press)\n* Jason Bradshaw for Things Go Wrong (Paper Rocket)\n* Ben O’Neil for Apologetica (Popnoir Editions)\n* Cole Pauls for Dakwäkãda Warriors (Conundrum Press)\nThe Pigskin Peters: The Doug Wright Award for best small- or micro-press book\n* 'WINNER - Gleem by Freddy Carrasco (Peow Studios)'\n* Boumeries, Vol. 9 by Boum (Self-published)\n* Baby in the Boneyard by Jesse Jacobs (Hollow Press)\n* Curb Angels by Lisa Mendis, Christopher Ducharme, Lucas C. Pauls (At Bay Press)\n* Dejects by Jay Stephens (Black Eye Books)\nThe Egghead: The Doug Wright Award for best kids’ book\n* 'WINNER - The Worst Book Ever by Elise Gravel (Drawn & Quarterly)'\n* Brick Breaks Free by David Craig (Self-published)\n* Lunch Quest by Chris Kuzma (Koyama Press)\n* Dakwäkãda Warriors by Cole Pauls (Conundrum Press)\n* Alma and the Beast by Esme Shapiro (Tundra Books)\n2019\nSource\nDoug Wright Best Book Award\n* 'WINNER - Young Frances by Hartley Lin (Adhouse Books)'\n* A Western World by Michael DeForge (Koyama Press)\n* Evie and the Truth About Witches by John Martz (Koyama Press)\n* Somnambulance by Fiona Smyth (Koyama Press)\nDoug Wright Spotlight Award (a.k.a. The Nipper)\n* 'WINNER - Ariane Dénommé for 100 Days in Uranium City (Conundrum Press)'\n* Aminder Dhaliwal for Woman World (Drawn & Quarterly)\n* Al Gofa for Dark Angels of Darkness (Peow Studio)\n* Victor Martins for Stay and You Don't Have To be Afraid of Me\n* Sylvia Nickerson for All We Have Left Is This\n* Eric Kostiuk Williams for Our Wretched Town Hall (Retrofit Comics)\nPigskin Peters Award\n* 'WINNER - Retomber by Xiaoxiao Li'\n* Eggshell 2 (ddogg) by William Dereume\n* Winter's Cosmos (Koyama Press) by Michael Comeau\n* Promising Jupiter by Ron Hotz\n* 310, 310 (Peow Studio) by Mushbuh\n2018\nBest Book\n* 'WINNER - Crawl Space by Jesse Jacobs (Koyama Press)'\n* Hostage by Guy Delisle (Drawn & Quarterly)\n* I'm Not Here by GG (Koyama Press)\n* The Abominable Mr. Seabrook by Joe Ollmann (Drawn & Quarterly)\n* Anti-Gone by Connor Willumsen (Koyama Press)\nSpotlight Award (aka The Nipper)\n* 'WINNER - Jenn Woodall for Magical Beatdown Vol. 2 and Marie and Worrywart'\n* Kris Bertin and Alexander Forbes for The Case of the Missing Men (Conundrum Press)\n* Gillian Blekkenhorst for All-Inclusive Fully Automated Vacation and House of Strays\n* Eric Kostiuk Williams for Condo Heartbreak Disco (Koyama Press)\n* Jason Loo for The Pitiful Human-Lizard Nos. 12, 13 and 14 (Chapterhouse Comics)\nPigskin Peters Award\n* 'WINNER - The Dead Father by Sami Alwani'\n* The Death of the Master by Patrick Kyle\n* Crohl's House Nos. 1 & 2 by Alexander Laird, Jamiel Rahi and Robert Laird\n* Creation: The First Three Chapters by Sylvia Nickerson\n* Potluck by Wavering Line Collective\n2017\nBest Book\n* 'WINNER - Bird in a Cage by Rebecca Roher (Conundrum Press)'\n* Mary Wept Over the Feet of Jesus by Chester Brown (Drawn & Quarterly)\n* Big Kids by Michael DeForge (Drawn & Quarterly)\n* Burt's Way Home by John Martz (Koyama Press)\n* The Envelope Manufacturer by Chris Oliveros\nSpotlight Award (aka The Nipper)\n* 'WINNER - Steve Wolfhard for Cat Rackham (Koyama Press)'\n* Jessica Campbell for Hot or Not: 20th-Century Male Artists (Koyama Press)\n* GG for These Days, Lapse (both from š! No. 25 [kuš!]), and an untitled story from Altcomics Magazine 3 (2dcloud)\n* Nathan Jurevicius for Birthmark (Koyama Press)\n* Laura Ķeniņš for Alien Beings (kuš!)\n* Brie Moreno for Dearest, Gift Shop 3D (Oireau), Missy, untitled story from š! No. 6 (kuš!), various web comics\nPigskin Peters Award\n* 'WINNER - The Palace of Champions by Henriette Valium (Conundrum Press)'\n* Carpet Sweeper Tales by Julie Doucet (Drawn & Quarterly)\n* Draw Blood by Ron Hotz\n* Garbage by Matthew Reichertz (Conundrum Press)\n* After Land by Chris Taylor (Floating World Comics)\n2016\nBest Book\n* 'WINNER - Dressing by Michael DeForge (Koyama Press)'\n* Melody by Sylvie Rancourt (Drawn & Quarterly)\n* Palookaville #22 by Seth (Drawn & Quarterly)\n* Step Aside, Pops by Kate Beaton (Drawn & Quarterly)\n* Stroppy by Marc Bell (Drawn & Quarterly)\n* SuperMutant Magic Academy by Jillian Tamaki (Drawn & Quarterly)\nSpotlight Award (aka The Nipper)\n* 'WINNER - Dakota McFadzean for ''Don't Get Eaten By Anything (Conundrum Press)'\n* Ted Gudlat for Funny Ha-Has (Roads Publishing)\n* Rebecca Roher for Mom Body (The Nib)\n* Sabrina Scott for Witchbody\n* Kat Verhoeven for Towerkind (Conundrum Press)\nPigskin Peters Award\n* 'WINNER - New Comics # 6 & 7 by Patrick Kyle'\n* Leather Vest by Michael Comeau\n* Intelligent Sentient? by Luke Ramsey (Drawn & Quarterly)\n* We Are Going To Bremen To Be Musicians by Tin Can Forest and Geoff Berner\n* Agalma by Stanley Wany (Éditions Trip)\n2015\nBest Book\n* 'WINNER - Fatherland by Nina Bunjevac (Jonathan Cape/Random House)'\n* Ant Colony by Michael DeForge (Drawn & Quarterly)\n* Safari Honeymoon by Jesse Jacobs (Koyama Press)\n* The People Inside by Ray Fawkes (Oni Press)\n* This One Summer by Jillian Tamaki and Mariko Tamaki (Groundwood)\nSpotlight Award (aka The Nipper)\n* 'WINNER - Meags Fitzgerald for Photobooth: A Biography (Conundrum Press)'\n* Aaron Costain for Entropy #10\n* Elisabeth Belliveau for One Year in America (Conundrum Press)\n* Julie Delporte for Everywhere Antennas (Drawn & Quarterly)\n* Simon Roy for Tiger Lung (Dark Horse)\n* Sophie Yanow for War of Streets and Houses (Uncivilized Books)\nPigskin Peters Award\n* 'WINNER - Swinespritzen by Connor Willumsen'\n* Comics Collection 2010–2013 and Less than Dust by Julien Ceccaldi\n* Great Success! 1983–2013 by Henriette Valium (Crna Hronika)\n* New Comics #3–5 by Patrick Kyle (Mother Books)\n* Undocumented: The Architecture of Migrant Detention by Tings Chak (The Architecture Observer)\n2014\nBest Book\n* 'WINNER - Paul Joins the Scouts by Michel Rabagliati (Conundrum Press)'\n* Palookaville #21 by Seth (Drawn & Quarterly)\n* Science Fiction by Joe Ollmann (Conundrum Press)\n* Susceptible by Geneviève Castrée (Drawn & Quarterly)\n* Very Casual by Michael DeForge (Koyama Press)\nSpotlight Award\n* 'WINNER - Steven Gilbert for The Journal of the Main Street Secret Lodge'\n* Connor Willumsen for \"Calgary: Death Milks a Cow\", \"Treasure Island\", \"Mooncalf\", and \"Passionfruit\"\n* Dakota McFadzean for Other Stories and the Horse You Rode in On (Conundrum Press)\n* Patrick Kyle for Distance Mover #7–12, New Comics #1–2\n* Georgia Webber for Dumb #1–3\nPigskin Peters Award\n* 'WINNER - Out of Skin by Emily Carroll ***'\n* \"Calgary: Death Milks a Cow\" by Connor Willumsen\n* Flexible Tube with Stink Lines by Seth Scriver\n* Journal by Julie Delporte (Koyama Press)\n* Very Casual by Michael DeForge (Koyama Press)\n2013\nBest Book\n* 'WINNER - The Song of Roland by Michel Rabagliati (Conundrum Press)'\n* Lose #4 by Michael DeForge (Koyama Press)\n* By This Shall You Know Him by Jesse Jacobs (Koyama Press)\n* Pope Hats #3 by Ethan Rilly (AdHouse Books)\n* Wax Cross by Tin Can Forest (Koyama Press)\nSpotlight Award (aka The Nipper)\n* 'WINNER - Nina Bunjevac for Heartless' (Conundrum Press)\n* Brandon Graham for King City (Image Comics)\n* Patrick Kyle for Black Mass, Distance Mover, Wowee Zonk #4\n* George Walker for The Mysterious Death of Tom Thomson (The Porcupine's Quill)\n* Eric Kostiuk Williams for Hungry Bottom Comics\nPigskin Peters Award\n* 'WINNER - Hamilton Illustrated by David Collier (Wolsak & Wynn)'\n* Hellberta #2 and \"Sir Softly\" from š! #12 by Michael Comeau\n* 4PANEL comics in Carousel Magazine #28 & #29, by Michael DeForge, Larry Eisenstein, Jesse Jacobs, Mark Laliberte (editor), Marc Ngui, Ethan Rilly, Tin Can Forest and Magda Trzaski\n* So, what should we do with ourselves?... from Wowee Zonk #4 and Little Stump in š! #12, by Ginette Lapalme\n2012\nBest Book\n* 'WINNER - Hark! A Vagrant by Kate Beaton (Drawn & Quarterly)'\n* Lose #3 by Michael Deforge (Koyama Press)\n* Mid-Life by Joe Ollmann (Conundrum Press)\n* Paying for It by Chester Brown (Drawn & Quarterly)\n* Reunion by Pascal Girard (Drawn & Quarterly)\n* The Great Northern Brotherhood of Canadian Cartoonists by Seth (Drawn & Quarterly)\nSpotlight Award (aka The Nipper)\n* 'WINNER- Ethan Rilly for Pope Hats #2 (Adhouse Books)'\n* Emily Carroll for \"The Seven Windows\" (from The Anthology Project vol. 2), \"Margot's Room\" and \"The Prince & the Sea\" (and other comics at emcarroll.com/comic)\n* Patrick Kyle for Black Mass # 5 – 6\n* Betty Liang for Wet T-shirt #1, \"It's Only a Secret if You Don't Tell Anyone\" (in š! #9), \"Anna Freud's Recurring Dream\" (and other comics at bettyliang.tumblr.com)\n* Zach Worton for The Klondike\nPigskin Peters Award\n* 'WINNER - Hellberta by Michael Comeau'\n* Hermoddities by Temple Bates\n* Pure Pajamas by Marc Bell\n* Untitled by Mum Pittsburg, Jupiter Leucetius! Send Us a King. We Are So Bored (and other comics at connorwillumsen.com) by Connor Willumsen\n2011\n(Jurists: Sara Quin, Michael Redhill, Anita Kunz, Marc Bell and Mark Medley)\nBest Book\n* 'WINNER - Bigfoot by Pascal Girard (Drawn & Quarterly)'\n* Chimo by David Collier (Conundrum Press)\n* Lose #2 by Michael DeForge (Koyama Press)\n* Moving Pictures by Kathryn Immonen, Stuart Immonen (Top Shelf Productions)\n* Streakers by Nick Maandag\nBest Emerging Talent\n* 'WINNER - Alex Fellows for Spain and Morocco'\n* Aaron Costain for Entropy # 5\n* Keith Jones for Catland Empire (Drawn & Quarterly)\n* James Stokoe for Orc Stain Volume One (Image)\n* Tin Can Forest (aka Marek Colek and Pat Shewchuk) for Baba Yaga and the Wolf (Koyama Press)\nPigskin Peters Award\n* 'WINNER - Spotting Deer by Michael DeForge (Koyama Press) ***'\n* Indoor Voice by Jillian Tamaki (Drawn & Quarterly)\n* Stooge Pile by Seth Scriver (Drawn & Quarterly)\n* ''So I've Been Told by Maryanna Hardy (Conundrum Press)\n* Wowee Zonk #3 edited by Patrick Kyle, Ginette Lapalme and Chris Kuzma (Koyama Press)\n2010\n(Jurists: Matthew Forsythe, Geoff Pevere, Fiona Smyth, and Carl Wilson)\nBest Book\n* 'WINNER - George Sprott: (1894–1975) by Seth' (Drawn & Quarterly)\n* Back + Forth'' by Marta Chudolinska (Porcupine's Quill)\n* Hot Potatoe by Marc Bell (Drawn & Quarterly)\n* Kaspar by Diane Obomsawin (Drawn & Quarterly)\n* Red: A Haida Manga by Michael Nicoll Yahgulanaas (Drawn & Quarterly)\nBest Emerging Talent\n* 'WINNER - Michael DeForge for Lose #1, Cold Heat Special #7 (Koyama Press; Picturebox)'\n* Adam Bourret for ''I'm Crazy\n* Pascal Girard for Nicolas (Drawn & Quarterly)\n* John Martz for It's Snowing Outside, We Should Go for a Walk by\n* Sully for The Hipless Boy (Conundrum Press)\nPigskin Peters Award\n* 'WINNER - Hot Potato by Marc Bell (D&Q)'\n* Bébête'' by Simon Bossé (L'Oie de Cravan)\n* Dirty Dishes by Amy Lockhart (Drawn & Quarterly)\n* Never Learn Anything from History by Kate Beaton (self-published)\n* The Collected Doug Wright Volume One by Doug Wright (Drawn & Quarterly)\nWinners of the 2010 Doug Wright Awards were announced on May 8, 2010 in the Bram & Bluma Appel Salon in the Toronto Reference Library, during a ceremony hosted by actor Peter Outerbridge.\n2009\n(Jurists: Bob Rae, Andrew Coyne, Martin Levin, Joe Ollmann and Diana Tamblyn)\nBest Book\n* 'WINNER - Skim by Jillian & Mariko Tamaki (Groundwood)'\n* Burma Chronicles by Guy Delisle (Drawn & Quarterly)\n* Drop-in by Dave Lapp (Conundrum Press)\n* Paul Goes Fishing by Michel Rabagliati (Drawn & Quarterly)\nBest Emerging Talent\n* 'WINNER - Kate Beaton for History Comics (self-published)'\n* Caitlin Black for Maids in the Mist (self-published)\n* Jesse Jacobs for Blue Winter, Shapes in the Snow (self-published)\n* Jason Kieffer for Kieffer #2 (self-published)\n* Nick Maandag for Jack & Mandy (self-published)\nPigskin Peters Award\n* 'WINNER - Ojingogo by Matthew Forsythe (Drawn & Quarterly)'\n* Hall of Best Knowledge by Ray Fenwick (Fantagraphics)\n* All We Ever Do is Talk About Wood by Tom Horacek (Drawn & Quarterly)\n* Small Victories by Jesse Jacobs (self-published)\nWinners of the 2009 Doug Wright Awards were announced on May 9, 2009 at the Art Gallery of Ontario during a ceremony hosted by actor and director Don McKellar.\n2008\n(Jurists: Katrina Onstad, Ho Che Anderson, Marc Glassman, Mariko Tamaki and Helena Rickett)\nBest Book\n* 'WINNER - The Magical Life of Long Tack Sam by Ann Marie Fleming (Riverhead Books)'\n* 365 Days: A Diary by Julie Doucet (Drawn & Quarterly)\n* Spent by Joe Matt (Drawn & Quarterly)\n* Southern Cross by Laurence Hyde (Drawn & Quarterly)\nBest Emerging Talent\n* 'WINNER - Jeff Lemire for Essex County Vol. 1: Tales from the Farm and Vol. 2: Ghost Stories (Top Shelf Productions)'\n* Ethan Rilly for Pope Hats\n* Jason Kieffer for Kieffer #1\n* Nick Maandag for The Experiment\n2008 saw the introduction of a new category dedicated to works that fall outside the bounds of traditional storytelling. Named after a character in the classic Canadian comic strip Birdseye Center, the Pigskin Peters Award recognizes experimental and avant-garde comics.\nPigskin Peters Award\n* 'WINNER - Milk Teeth by Julie Morstad (Drawn & Quarterly)'\n* Little Lessons in Safety by Emily Holton (Conundrum Press)\n* Excelsior 1968 by John Martz (self-published)\n* Fire Away by Chris von Szombathy (Drawn & Quarterly)\n2007\n(Jurists: Bruce McDonald, Mark Kingwell, Judy MacDonald, Lorenz Peter and Jessica Johnson)\nBest Book\n* 'WINNER - This Will All End in Tears by Joe Ollmann (Insomniac Press) ***'\n* Shenzhen: A Travelogue From China by Guy Delisle (Drawn & Quarterly)\n* Scott Pilgrim & The Infinite Sadness by Bryan Lee O'Malley (Oni)\n* Gilded Lilies by Jillian Tamaki (Conundrum Press)\n* Nog-a-dod edited by Marc Bell (Conundrum Press)\nBest Emerging Talent\n* 'WINNER - House of Sugar by Rebecca Kraatz (Tulip Tree Press) ***'\n* Gray Horses by Hope Larson (Oni)\n* Was She Pretty? by Leanne Shapton (Farrar, Straus & Giroux)\n* Bacter-area by Keith Jones (Drawn & Quarterly)\n* Mendacity by Tamara Berger & Sophie Cossette (Kiss Machine)\n2006\n(Jurists: Justin Peroff, Alan Hunt and Ben Portis)\nBest Book\n* 'WINNER - Paul Moves Out by Michel Rabagliati (Drawn & Quarterly)'\n* Pyongyang: A Journey in North Korea by Guy Delisle (Drawn & Quarterly)\n* Scott Pilgrim Versus the World by Bryan Lee O’Malley (Oni)\n* Dragonslippers: This Is What an Abusive Relationship Looks Like by Rosalind B. Penfold (Grove Press)\n* Wimbledon Green by Seth (Drawn & Quarterly)\nBest Emerging Talent\n* 'WINNER - Lorenz Peter for Dark Adaptation ***'\n* Scott Chantler for Northwest Passage Vol. 1 (Oni Press)\n* Marc Ngui for The Unexpurgated Tale of Lordie Jones (Conundrum Press)\n* Mariko Tamaki and Jillian Tamaki for Skim\n* James Turner for Nil: A Land Beyond Belief (Slave Labor Graphics)\n2005\n(Jurists: Chester Brown, Rebecca Caldwell, Nora Young, Jerry Ciccoritti and Don McKellar)\nBest Book\n* 'WINNER - Clyde Fans, Book One by Seth (Drawn & Quarterly)'\n* Worn Tuff Elbow #1 by Marc Bell (Fantagraphics Books)\n* Pamplemoussi by Geneviève Castrée (L'Oie de Cravan)\n* The Frank Ritza Papers by David Collier (Drawn & Quarterly)\n* DC: The New Frontier vol. 1 by Darwyn Cooke (DC Comics)\nBest Emerging Talent\n* 'WINNER -'' Bryan Lee O'Malley for ''Scott Pilgrim's Precious Little Life (Oni Press)'\n* Rebecca Dart for Rabbithead (Alternative Comics)\n* Max Douglas / Salgood Sam for Revolver #1 (self-published)\n* Alex Fellows for Canvas (Fantagraphics)\nSee also\n*Canadian Cartoonist Hall of Fame\n*Joe Shuster Award\nReferences\nExternal links\n*[http://www.dougwrightawards.com/ Doug Wright Awards homepage]\n*[http://archives.cbc.ca/IDC-1-68-2352-13715/arts_entertainment/canadian_comics/clip7 \"Doug Wright's family\", CBC TV profile of Wright from 1968.]\n* [https://www.cbc.ca/news/entertainment/artists-honoured-for-comics-hailing-nostalgia-everyday-life-1.683885?ref=rss Artists honoured for comics hailing nostalgia, everyday life]"
    }
  ]
}