{
  "content": [
    {
      "type": "text",
      "text": "# Downtown Battle Mountain II\n\n| recorded     = November–December 2010  Interlace Audio Recording Studios in Portland, Oregon\n| venue        =\n| studio       =\n| genre        =\n*\n* screamo\n}}\n| length       = 42:41\n| label        = Rise\n| producer     = Kris Crummett\n| prev_title   = Happiness\n| prev_year    = 2009\n| next_title   = Acceptance Speech\n| next_year    = 2013\n| misc         =\n| single2     = The Robot with Human Hair Pt. 2½\n| single2date = January 28, 2011\n| single3     = Pounce Bounce\n| single3date = June 7, 2011\n}}\n}}\n| rev2 = Absolutepunk\n| rev2Score = (80%)\n| rev3 = Sputnikmusic\n| rev3Score = 3.6/5\n| noprose = yes\n}}\nDowntown Battle Mountain II is the fourth studio album by American rock band Dance Gavin Dance, released on March 8, 2011, on Rise Records. The album is a non-direct sequel to the band's full-length debut studio album, Downtown Battle Mountain (2007), and sees the return of original members, vocalists Jonny Craig and Jon Mess, and bass guitarist Eric Lodge. It also serves as a follow-up to the band's third studio album, Happiness (2009) and was produced by Kris Crummett. The album is the group's second studio album, and third and final release overall to feature Jonny Craig upon rejoining the band in 2010. Craig later departed from the line-up in August 2012. Upon its release, the album debuted at No. 82 on the Billboard 200 while the Hot Topic deluxe version debuted at No. 190 on the Billboard 200 in the same week.\nDowntown Battle Mountain II was announced in late-2010. Before this album was released, the band had previously replaced Craig with vocalist Kurt Travis. After two album releases with Travis, the band ultimately decided to part ways with him due to alleged personal and creative differences. With no vocalist, an uncertain future and low morale among its members, the band had considered the possibility of breaking up. Jon Mess stated, \"Then [we] basically came up with the idea that [we] could just break up the band whenever, but do this record first and see what happens. So we’re at the point where we'll see how long we can do this without Jonny dying or whatever.\" The lead single, \"Heat Seeking Ghost of Sex\", was released on January 24, 2011. The second single, \"The Robot with Human Hair, Pt. 2½\", was released shortly after, on January 28. The third and final single, \"Pounce Bounce\", was released on June 7, to promote the 2011 Vans Warped Tour compilation album. The band toured on the Downtown Battle Mountain II Tour in Europe and North America and also toured on the 2011 Vans Warped Tour and the 2012 All Stars Tour. On September 27, 2019, the band released an instrumental version of the album to streaming and digital download platforms. It was a very significant album release in the band's ever-evolving and complicated history.\nTrack listing\n;Notes\n* In \"Blue Dream\" Jonny Craig is heard making a phone-call to a woman who he infamously asks \"What color are your fucking eyes?\" According to Craig himself, at the time of recording this album he was abusing heroin to the point of being oblivious to his actions. The woman on the other end of the call was Craig's at-the-time girlfriend, whose eye color Craig could legitimately not recall as a result of his drug abuse.\nPersonnel\n;Dance Gavin Dance\n* Jonny Craig – clean vocals\n* Jon Mess – unclean vocals\n* Will Swan – guitar, rapping (on \"Spooks\", \"Heat Seeking Ghost of Sex\", & \t\"Privilously Poncheezied\"), unclean vocals (on \"Need Money\" & \"People You Knew\")\n* Eric Lodge – bass guitar\n* Matt Mingus – drums, percussion\n;Production\n* Kris Crummett – production, engineering, mixing, mastering\n* Brian Obedowski – mixing assistant\n* Kyle Hubbard – trumpet on track 5\n* Mattias Adolfsson – album artwork\n* Phill Mamula – layout\n* Management by Eric Rushing\nCharts\n{| class=\"wikitable sortable\"\n! align=\"left\"| Chart (2011)\n! align=\"left\"| Peakposition\n|-\n| US Billboard 200\n| align=\"center\"| 82\n|-\n| US Independent Albums\n| align=\"center\"| 13\n|-\n| US Hard Rock Albums\n| align=\"center\"| 4\n|}\nReferences\nExternal links\n*[http://www.absolutepunk.net/showthread.php?t=2132881 Downtown Battle Mountain II Artwork] – AbsolutePunk.net\n*[https://www.myspace.com/dancegavindance Dance Gavin Dance Myspace]"
    }
  ]
}