{
  "content": [
    {
      "type": "text",
      "text": "# Downpicking\n\nDownpicking, sometimes referred to as down-stroke picking, is a technique used by musicians on plucked string instruments in which the player moves the plectrum, or pick in a downward motion, relative to the position of the instrument, against one or more of the strings to make them vibrate. If down-strokes are played without the addition of upstrokes (as in alternate picking), the tip of the pick never comes in contact with the strings as the hand moves back up to repeat the down-stroke.\nUses\nGuitarists in hard rock and metal genres, especially thrash metal will often use downpicking to create a \"heavier\" and tighter sound than what can be achieved with alternate picking, which generally produces more cleanly melded strumming sounds. Downpicking also effectively doubles the effort one would need to alternate pick at the same tempo, however this is hardly noticeable at medium to low tempos. Downpicking can also be used in a technique called sweep picking, or 'raking'.\nExtremely fast eighth-note downstroke picking was used in the mid 70s and beyond by famous punk guitarist Johnny Ramone, who used the technique to play full live shows in high tempos (usually around 180 to 200 bpm). This required extreme levels of stamina, but produced a very high-energy, aggressive sound. This extremely demanding, then uncommon and somewhat innovative style contributed to Johnny Ramone's reputation as a guitar player, and it influenced many now-famous rock guitarists. Downstroke picking has become a common technique in metal and thrash rhythm playing, notably exemplified by James Hetfield of Metallica (who has been regarded as 'the King of Downpicking'), as well as Doyle Wolfgang von Frankenstein of The Misfits, Dave Mustaine of Megadeth, Kerry King of Slayer, Bobby Gustafson of Overkill, and Scott Ian of Anthrax among others. The guitar work of Metallica's \"Master of Puppets\" is almost entirely played using downstroked eighth-notes at a tempo of 212 BPM (about 7 downstrokes per second).\nUp-tempo down-stroke picking requires a strong wrist to keep muscle movements as tension-free as possible. For long or extended passages, endurance becomes the focus, as fast down-picking can quickly cause a burn in the wrist, sometimes extending up into the arm and causing the muscles to seize up. If the guitarist has a difficult time keeping the strokes smooth, the quality of the music can suffer, often sounding sloppy or strained. While down-picking in general is sometimes considered a good beginner's technique for learning at low tempos, it requires skill to perfect in faster applications.\nSee also\n*Down bow\nReferences"
    }
  ]
}