{
  "content": [
    {
      "type": "text",
      "text": "# DR-2 (Dominican Republic highway)\n\nDR-2 is the second numbered national highway in the Dominican Republic. Its common name is Carretera Sánchez in honor of Francisco del Rosario Sánchez, one of the founding fathers. In the city of Santo Domingo, it is known as Autopista 30 de Mayo. The highway serves as the main connection to the southwestern region of the country. The highway's eastern terminus is located in Santo Domingo and continues on a western route through until its end in Comendador for a total length of approximately 255 kilometers. The route is mainly a two-lane roadway even though it has been recently expanded from San Cristobal to Baní and has been largely replaced by the faster DR-6 route from Santo Domingo to San Cristobal. Due to its locality and heavy traffic DR-2 has been undergoing an expansion project to make it a two-lane expressway and allow better traffic flow. DR-2 has one toll location just outside the boundaries of Greater Santo Domingo before entering the town of Haina.\nOverview\nFrom it eastern terminus in Santo Domingo to its western terminus in Comendador, the highway travels through the most important cities of the southwest region of the republic known for their arid climate and widespread poverty more prevalent than in other regions of the country.\nAutopista 30 de Mayo\n30 de Mayo begin west of George Washington avenue along the Caribbean coast. For those traveling along the coast it serves as a major artery connecting with the Jimenez Moya (Winston Churchill), Nuñez de Caceres, and Luperon avenue that give fast access to the Downtown area. This highway is unique among the rest of the city because it exhibits characteristics of a controlled-access roadway while at the same time behaving like a regular avenue. Originally, as it was meant to provide a fast connection to the southwestern part of country. In the present it has been largely replaced by the DR-6 which bypasses the city of Bajos de Haina, Haina Port and San Cristobal.\nCarretera Sánchez: Santo Domingo to San Cristobal\nAs DR-2 exits Santo Domingo it is renamed in honor of one of the founding fathers of the Republic. A toll is paid before entering the commercial port of Haina, the largest port in the island of Hispaniola. The Highway continues its westward path entering the through the northern neighborhood of Bajos de Haina were commercial traffic tends to be heavy due to its proximity to the port. Farther west, DR-2, serves as a local connection to the major city of San Cristobal which is only about 30 kilometers west of Santo Domingo. At this point it runs roughly parallel to the DR-6. As it enters the city center Carretera Sanchez becomes a main street of the city and crosses the city as it continues westward. After exiting the city, DR-2 merges with the faster DR-6(DR-6 ends here) and continues to the town of Bani.\nExpansion and Modernization\nIn recent years, the Ministry of Public Works has worked to expand the highway from one-lane in each direction into a two-lane bi-directional highway from San Cristobal to Bani to ease the high volume of traffic traveling in DR-2/DR-6. The Expansion increased the quality of the highway and the safety for its drivers following similar standards of the expansions in DR-3 which a large median and well kilometer signage. As a result of the expansion fast travel can be achieved from the city of Santo Domingo all the way to Bani without the dangers and accidents that previously made this highway one of the most dangerous.\nDiscontinuity in the city of Bani\nDR-2 enters the town of Baní, the capital and largest city of Peravia and divides into two local one-way main streets that cross the city center. This has been a problem still unresolved which causes great traffic congestion along these two main street and forces travelers going farther west to enter the city of Bani without an option to bypass it. A bypass of Bani to the north or south of the town would allow the motorist to save time when going to western cities. DR-501 serves as a spur route of DR-2 in the center of Bani serving the small villages of Villa Sombrero, Matanzas, and Las Calderas.\nCarretera Sanchez from Bani to Comendador\nAfter leaving the city center, the Carretera Sánchez continues and becomes a two-lane high speed road which connects to the DR-41 in Cruce de Ocoa and also gives connection to DR-44 which spurs out of DR-2 and continues to southwestern cities of Barahona, and Pedernales while DR-2 continues west to the towns of San Juan de La Maguana and the border town of Comendador.\n{| class=\"wikitable\"\n|-\n! Cities\n! Major intersections\n! Distance from Santo Domingo\n|-\n| Santo Domingo\n|\n| 0&nbsp;km, begins here\n|-\n| San Cristóbal\n| DR-6\n| 30&nbsp;km\n|-\n| Baní\n| --\n| 65&nbsp;km\n|-\n| Cruce de Ocoa\n| DR-Route 42\n| 93&nbsp;km\n|-\n| Azua\n| --\n| 120&nbsp;km\n|-\n| Sabana Yegua\n| DR-Route 44\n| --\n|-\n| San Juan de la Maguana\n| --\n| 200&nbsp;km\n|-\n| Comendador\n| DR-Route 47\n| 255&nbsp;km, ends here\n|}\nSee also\n* Highways and routes in the Dominican Republic"
    }
  ]
}