{
  "content": [
    {
      "type": "text",
      "text": "# Dr. Dobb's Excellence in Programming Award__disambig_1\n\nThe '''Dr. Dobb's Excellence in Programming Award''' was an annual prize given to individuals who, in the opinion of the editors of Dr. Dobb's Journal, \"made significant contributions to the advancement of software development.\" The Excellence in Programming Award includes a $1,000 prize that was donated in the award winner's name to a charity of the winner's choice.\nThe award was launched in 1995 in the print edition of ''Dr. Dobb's Journal'' and was given each year until 2009. In his March 1995 article introducing the awards, then editor-in-chief Jonathan Erickson wrote that the award was intended to recognize \"achievement and excellence in the field of computer programming.\" Erickson explained that the winners were \"selected by a special editorial committee\" of the magazine.\nBecause Dr. Dobb's serves an audience of software developers, the Excellence in Programming Award is specifically intended to recognize resources for programmers: languages, code libraries, tutorial books, and so on. Developers of shrinkwrap software intended for retail sale, custom software for corporate use, embedded software, or general-purpose applications were not considered for the award.\nThe Excellence in Programming Award was intended to recognize individual contributions. Dr. Dobb's sponsors a different award, the Jolt Awards, for companies that produce tools for programmers.\nRecipients\n2013\nNo award listed as of Feb 3, 2014.\n2012\nWard Cunningham\n2010 - 11\nNo award.\n2009\nScott Meyers, author of Effective C++, () More Effective C++ () and Effective STL (). Dr. Dobb's editor Jonathan Erickson identified Meyers as \"one of the world's foremost experts on C++ software development,\" noting that in addition to his best-selling books, the writer provided training and consulting services to clients, developed a tutorial CD for C++ programmers, served as consulting editor for Addison Wesley's Effective Software Development Series, and wrote for numerous magazines. \"A programmer since 1972,\" Erickson wrote, Meyers \"holds an M.S. in computer science from Stanford University and a Ph.D. from Brown University.\"\n2008\nBjarne Stroustrup, creator of the C++ programming language. Dr. Dobb's editor-at-large Michael Swaine wrote that C++ creator Bjarne Stroustrup was \"someone whose values, efforts, and achievements are an inspiration to all programmers.\" Swaine continued: \"Through his proclivity for putting theory into practice, his vision in matching the tool to the need, his respect for the intelligence and opinions of the working programmer, and his tireless work in advancing the art and science of software development, Bjarne Stroustrup most assuredly serves as a model for excellence in programming.\"\n2007\nGrady Booch, for contributions to object-oriented programming, software architecture, and modeling. Grady Booch, wrote Dr. Dobb's editor-at-large Michael Swaine, \"is someone whose work is familiar to every serious programmer.\" Swaine noted that Booch had achieved international recognition for his contributions to the software development process and for significant achievements in object-oriented programming, software architecture, and modeling.\n2006\nBruce Schneier, contributions to cryptography and computer security. Dr. Dobb's editor Jonathan Erickson cited Bruce Schneier's \"many important contributions\" to computer security, including the Blowfish and Twofish encryption algorithms. Erickson also noted that Schneier was the author of eight books, including Applied Cryptography: Protocols, Algorithms, and Source Code in C (), which he termed \"a seminal work for software developers.\"\n2005\nGuy L. Steele, Jr., for a lifetime of contributions to programming languages, tools, and operating systems. Guy Steele did not receive the Dr. Dobb's Excellence in Programming award for his work on a specific language, tool, or operating system, wrote editor Jonathan Erickson, \"but for the breadth of his contributions over the years.\" These contribution include writing books on Lisp, C, Fortran, and Java; collaborating on the initial specification for Java and Scheme; designing the original Emacs command set; and serving on accredited standards committees for C, Fortran, Common Lisp, and Scheme.\n2004\nP.J. Plauger, author, substantive contributor to C and C++ standards. P.J. Plauger, wrote Dr. Dobb's editor Jonathan Erickson, \"is an individual familiar to all serious programmers.\" Erickson praised Plauger for more than 20 years of playing \"an integral role in the definition, design, and implementation\" of C and C++. In addition, Plauger authored or coauthored invaluable books for programmers, including Elements of Programming Style (), Software Tools in Pascal (), The Standard C Library () Programming on Purpose (), The Draft Standard C++ Library (), Standard C: A Reference () and The C++ Standard Template Library ().\n2003\nDon Chamberlin, database pioneer, creator of SQL. In announcing Chamberlin's award, Dr. Dobb's editor Jonathan Erickson praised the programmer not only for creating the database query language SQL, but for the document editor and formatter Quill, and for devising the XML query language Quilt, which is the basis of XQuery. Erickson wrote that Chamberlin \"reminds us that a mix of technology, innovation, vision, and cooperative spirit continue to be fundamental to advancement in software development.\"\n2002\nAdele Goldberg, contributor to the Smalltalk language, author, founding CEO of ParcPlace Systems, and Dan Ingalls, principal architect of Smalltalk virtual machines and kernel systems. \"Although we take objects for granted today,\" Dr. Dobb's noted, \"these two researchers helped to bring object-oriented programming into the real world for the first time...from the highest level of users and their information modeling needs to the lowest levels of syntax, compilation, and efficient message passing.\" Working together at Xerox PARC, these two pioneers \"each recognized in their own way the promise of objects, and they were in a unique position to put those theories into practice in an architecture based on objects at every level.\"\n2001\nAnders Hejlsberg, compiler writer, author of Turbo Pascal, Delphi, C#, and (years after receiving the award) TypeScript. Dr. Dobb's editor Jonathan Erickson outlined Anders Hejlsberg's contributions to the programming world by summarizing his work history: \"Currently a distinguished engineer in Microsoft's developer division,\" Erickson wrote, \"Hejlsberg is best known as author of Borland's Turbo Pascal, the ground-breaking development environment of the early 1980s, and chief architect of its successor, Delphi. After his move to Microsoft in 1996, Hejlsberg became the architect of Visual J++ and the Windows Foundation Classes. Hejlsberg currently works as the chief designer of the C# programming language and is a key participant in the development of the .NET framework.\"\n2000\nJon Bentley, researcher and author of Programming Pearls () and More Programming Pearls (). In his article announcing the Excellence in Programming Award winner for 2000, Dr. Dobb's editor Jonathan Erickson called Jon Bentley \"one of the most respected and prolific researchers in the field of computer science.\" Erickson continued: \"What's unique about Bentley's contribution to the art and craft of computer programming is how he has struck a balance between academic research on one hand, and real-world programming on the other...Bentley is a recipient of this year's award not just for the quality of his research and code, but for his ongoing commitment to sharing the fruits of his efforts with fellow programmers.\"\n1999\nGuido van Rossum, creator of the Python programming language, and Donald Becker, chief investigator of the Beowulf Project, which achieved supercomputer performance using networks of inexpensive Linux-based PCs. \"As creator of the Python programming language,\" Dr. Dobb's noted, \"Guido van Rossum has given software developers a tool that addresses many of the shortcomings of more well-known and mainstream languages...Python makes it extremely easy to build complex data structures out of objects, lists, dictionaries, and the like. It is particularly useful for system administration, building GUIs, scripting, database programming, and rapid prototyping.\" Erickson detailed Donald Becker's contributions to the programming world by describing the problem Becker set out to solve: \"One of the challenges in the realm of scientific computing is to efficiently and affordably handle large data sets,\" Erickson wrote. \"To tackle the problem, Donald Becker and Thomas Sterling launched the Beowulf Project, a cluster computer consisting of high-performance PCs built from off-the-shelf components, connected via Ethernet, and running under Linux. Ultimately, the goal of the Beowulf approach was to achieve supercomputer (gigaflop) performance at PC prices.\"\n1998\nThe “Gang of Four” – Richard Helm, Erich Gamma, Ralph Johnson, John Vlissides – authors of Design Patterns: Elements of Reusable Object-Oriented Software. \"Although they did not invent design patterns or even write the first book on the subject,\" wrote Jonathan Erickson, \"the Gang of Four's Design Patterns: Elements of Reusable Object-Oriented Software can be credited with bringing patterns into the mainstream of software development.\" Erickson continued: \"Coinciding with the rush to the object paradigm, Design Patterns quickly became a classic, selling more than 100,000 copies since publication. Although numerous books on software-design patterns have been published since, none have matched the stature or acceptance of the Gang of Four's Design Patterns.\n1997\nRon Rivest, cryptographer, co-creator of the RSA standard, and Gary Kildall, pioneering author of the CP/M operating system. \"Along with Adi Shamir and Leonard Adleman, Ronald L. Rivest is perhaps best known as an inventor of the RSA public-key cryptosystem,\" wrote Dr. Dobb's editor Jonathan Erickson. \"The RSA cryptosystem has formed the basis of a variety of security-related tools from RSA Data Security, a company Ron helped launch. Ron currently serves as a director of the company. RSA software is generally acknowledged as one of the leading commercially available crypto and security toolsets, and has been adopted by third-party software companies worldwide.\" Computer-industry pioneer Gary Kildall, Erickson wrote, had the kind of career \"of which legends are made.\" Dr. Dobb's credited Kildall with the introduction of operating systems with preemptive multitasking, windowing capabilities, and menu-driven user interfaces; creating the first floppy-disk track buffering scheme, read-ahead algorithms, file directory caches, and RAM disk emulators; defining the first programming language and writing the first compiler specifically for microprocessors; creating the first microprocessor disk operating system; creating the first computer interface for video disks to allow automatic nonlinear playback, presaging today's interactive multimedia; developing the file system and data structures for the first consumer CD-ROM; creating the first successful open system architecture by segregating system-specific hardware interfaces in a set of BIOS routines, ushering in the third-party software industry; and creating the CP/M operating system.\n1996\nLarry Wall, author of the Perl programming language, and James Gosling, chief architect of Java. Larry Wall's Perl, wrote Dr. Dobb's editor Jonathan Erickson, \"the general-purpose scripting language Larry [Wall] created nearly a decade ago, has been described as the 'Swiss-Army chain-saw' of UNIX tools. Over time, it has become the language of choice among system administrators for quickly cobbling utility programs together.\" Gosling's Java, Erickson wrote, \"has been endorsed by virtually every major software vendor. What Java delivers, and what has developers excited, is the capability to compile programs into a binary format that can be executed on many platforms without recompilation — embedded executable content, in other words.\"\n1995\nAlexander Stepanov, creator of the C++ Standard Template Library, and Linus Torvalds, creator of the Linux operating system. \"In developing the C++ Standard Template Library,\" wrote Dr. Dobb's editor Jonathan Erickson, Alexander Stepanov \"has created a body of work that in all likelihood will touch most mainstream programmers for years to come...STL implements a programming model which provides an orthogonal view of data structures and algorithms, as opposed to object-oriented encapsulation. Although the ideas behind STL are not new, it took someone with Alexander's vision, perseverance, and experience — along with the new generation of C++ tools — to turn the promise of generic programming into reality.\" Of Linux creator Torvalds, Erickson wrote: \"[T]he real significance of Linus's work is that almost single-handedly, he was able to implement true innovation in kernel design (particularly when it comes to features such as on-demand loading of system services) while achieving 100 percent UNIX System V compatibility when no other \"\n.\"\nSee also\n* List of computer-related awards\nReferences\nExternal links\n*[http://drdobbs.com/232500316 Dr. Dobbs: Dr. Dobb's Excellence in Programming Award]\n*[https://web.archive.org/web/20120309154005/http://www.microsoft.com/presspass/press/2001/apr01/04-11AndersPR.mspx Microsoft News Center: Microsoft's Anders Hejlsberg Receives Prestigious Excellence in Programming Award]\n*[http://kimmicblog.com/2012/02/24/zen-and-the-art-of-software-the-innovation-interview-with-grady-booch/ kimmicblog: Zen and the Art of Software: The Innovation Interview with Grady Booch]\n*[https://lwn.net/Articles/272681/ LWN.net: Stroustrup presented with Dr. Dobb's Excellence in Programming award]\n*[http://www2.research.att.com/~bs/homepage.html Bjarne Stroustrup's home page]\n*[https://www.amazon.com/Scott-Meyers/e/B004BBEYYW Amazon.com author page for Scott Meyers]\n*[https://web.archive.org/web/20101107195153/http://www.smalltalk.org/articles/article_20040000_10.html Smalltalk.org: Adele Goldberg and Dan Ingalls win 2002 Dr. Dobb's Excellence in Programming Awards]\n*[http://www.digitalresearch.biz/DR/Gary/9775b.htm Digital Research: An Homage to Gary Kildall]\n*[http://www.aristeia.com/ Aristeia.com: Home page of Scott Meyers]\n*[http://www-01.ibm.com/software/rational/leadership/thought/gradybooch.html IBM Rational expert Grady Booch]\n*[http://www.schneier.com/ Bruce Schneier on Security]\n*[http://labs.oracle.com/people/mybio.php?uid=25706 Oracle Labs: Dr. Guy Steele]\n*[http://www.plauger.com/index.html P.J. Plauger's home page]\n*[http://www.almaden.ibm.com/cs/people/chamberlin/homepage.html IBM Almaden Research Center: Don Chamberlin]\n*[http://www.icsi.berkeley.edu/Board/goldbergbio.html International Computer Science Institute: Adele Goldberg]\n*[https://whatsup-di.blogspot.com/ Blog: What's Up with Dan Ingalls]\n*[http://channel9.msdn.com/search?term=hejlsberg Anders Hejlsberg at Microsoft Developer Network's Channel 9]\n*[http://www.avaya.com/usa/avaya-labs/people/jon-bentleyresearch-scientist Avaya Labs: Jon Bentley, Research Scientist]\n*[https://www.python.org/~guido/ Python.org: Guido van Rossum's home page]\n*[http://www.csail.mit.edu/user/1294 Ronald Rivest at MIT Computer Science and Artificial Intelligence Laboratory]\n*[https://web.archive.org/web/20060404211733/http://www.businessweek.com/magazine/content/04_43/b3905109_mz063.htm BusinessWeek: Gary Kildall, the Man Who Could Have Been Bill Gates]\n*[https://web.archive.org/web/20071013080303/http://www.wall.org/~larry/ Larry Wall's home page]\n*[http://nighthacks.com James Gosling's blog]\n*[http://www.cs.helsinki.fi/u/torvalds/ Linus Torvald's home page]"
    }
  ]
}