{
  "content": [
    {
      "type": "text",
      "text": "# Draft:Battle of the Somme casualties controversy__disambig_1\n\n)\n| place       = Somme River, north-central Somme and south-eastern Pas-de-Calais Départements, France\n| coordinates =\n| territory   = Minor Allied territorial gains\n| result      = Allied Failure\n| combatant1  =  }}\n|\n|\n|\n|\n|\n|\n|\n|\n| Rhodesia}}\n| combatant2  =\n| commander1  =  Douglas Haig Joseph Joffre Ferdinand Foch Henry Rawlinson Émile Fayolle Hubert Gough Joseph Alfred Micheler}}\n| commander2  =  Rupprecht of Bavaria Max von Gallwitz Fritz von Below\n| units1      =\n| units2      =\n| strength1   = 1 July 390,000 in 13 divisions  330,000 in 11 divisions July–November  1,530,000 in 50 divisions  1,440,000 in 48 divisions\n| strength2   = 1 July  315,000 in 10 divisions  July–November 1,500,000 in 50 divisions\n| casualties1 =  c. 420,000 c. 200,000\n| casualties2 =  c. 434,000–600,000\n}}\nIntroduction\n{|class=\"wikitable\" align=right style=\"margin:0 0 1em 1em\"\n|+Battle of the SommeBritish, French and German casualtiesJuly–November 1916\n|-\n! Month\n! British\n! French\n! Sub-total\n! German\n! (% ofAlliedtotal)\n|-\n|July||align=right|158,786||align=right|49,859||align=right|208,645||align=right|103,000||align=right|49.4\n|-\n|August||align=right|58,085||align=right|18,806||align=right|76,891||align=right|68,000||align=right|88.4\n|-\n|September||align=\"right\"|101,313||align=\"right\"|76,147||align=\"right\"|177,460||align=\"right\"|140,000||align=\"right\"|78.9\n|-\n|October||align=\"right\"|57,722||align=\"right\"|37,626||align=\"right\"|95,348||align=\"right\"|78,500||align=\"right\"|82.3\n|-\n|November||align=\"right\"|39,784||align=\"right\"|20,129||align=\"right\"|59,913||align=\"right\"|45,000||align=\"right\"|75.0\n|-\n|Total||align=\"right\"|415,690||align=\"right\"|202,567||align=\"right\"|618,257||align=\"right\"|434,500||align=\"right\"|70.3\n|-\n|}\n{| class=\"wikitable\"  align=right style=\"margin:0 0 1em 1em\"\n|+Somme casualties\n!Nationality\n!Totalcasualties\n!Killed &missing\n!POW\n|-\n|United Kingdom||align=\"right\"|350,000+||-||-\n|-\n|Canada||align=\"right\"|24,029&nbsp;&nbsp;||-||-\n|-\n|Australia\n|align=\"right\"|23,000&nbsp;&nbsp;||align=\"right\"|&nbsp;||align=\"right\"|Commonwealth\n|style=\"border-top:2pt solid black\" align=\"right\"|419,654\n|style=\"border-top:2pt solid black\" align=\"right\"|95,675\n|style=\"border-top:2pt solid black\" align=\"right\"|-\n|-\n|French||align=\"right\"|204,253||align=\"right\"|50,756||-\n|- style=\"background:#eeeeee\"\n|style=\"border-top:2pt solid black\"|Total Allied\n|style=\"border-top:2pt solid black\" align=\"right\"|623,907\n|style=\"border-top:2pt solid black\" align=\"right\"|146,431\n|style=\"border-top:2pt solid black\" align=\"right\"|-\n|-\n|colspan=\"4\"|\n|-\n|Germany\n|align=\"right\"|465,000–600,000||align=\"right\"|164,055|| align=\"right\" |38,000\n|}\nThe Battle of the Somme was one of the costliest battles of World War I.\nEarly estimates\nThe original Allied estimate of casualties on the Somme, made at the Chantilly Conference on 15 November 1916, was that the Germans suffered 630,000 casualties, a figure which exceeded the 485,000 suffered by the British and French. As a German officer wrote,\nWinston Churchill\nIn 1921 Churchill obtained a set of German casualty numbers from the British Embassy in Berlin, via the Foreign Secretary Lord Curzon. He resumed work in 1923 when, now out of office and Parliament, he decided to write a third volume to The World Crisis.\nChurchill co-operated with James Edmonds in the 1920s. Edmonds may well, in Prior’s view, have used Churchill to float ideas considered “too frank” for the Official History. Edmonds supplied him with documents, General Staff appreciations, Haig’s correspondence with Robertson, as well various German materials. Edmonds actually wrote the account of the opening hours of the Somme, and persuaded Churchill to tone down some of his criticism of the British High Command.\nChurchill wrote to Edmonds (July 1926) that “Haig comes out all right in the end because of the advance in 1918” (LINK HUNDRED DAYS) but that he was “anxious to vindicate my own appreciation of the position at the time”. Churchill also asked Edmonds to supply him with German material to reflect the severe effect which the Somme had inflicted on the Germans. Churchill also asked Edmonds for information about the new creeping barrage, but Edmonds does not seem to have supplied any, and none appears. Edmonds eventually wrote to Churchill in July and August that “I can find nothing against your general line of argument” and “the Somme chapter is a work of art … and is perfectly fair”.\nEdmonds warned Churchill (14 October 1926) that the German data did not include lightly wounded men. Edmonds apparently supplied data from the German VII Corps to prove his point. Churchill immediately (15 October 1926) expressed skepticism to Edmonds, pointing out that if the VII Corps figures were bumped up by 40% this would mean that German wounded: dead ratios would breach the 2:1 which at that time Churchill believed to be common to all three major armies in the west. Churchill does not appear to have received any answer from Edmonds on this point.\nChurchill asked Hume, who had worked on the matter in the British Embassy in Berlin, to investigate further (21 October 1926). Hume replied that he thought the lightly wounded were included in the German figure (9 November 1926); Churchill wrote again to Hume asking him to check further (12 November 1926). Edmonds then wrote to Churchill that it was “notorious” that the Germans did not include lightly wounded in their statistics, but added that “I have never troubled to collect any statements on the subject” (18 November 1926). Hume's reply enclosed a letter from Herr Stinger of the Reichsarchiv, stating that the lightly wounded were included, and that sick and wounded who later died were included in the deaths figure (19 November 1926). Churchill also asked Hume to have Stinger check Churchill’s own calculations, which Stinger declared “as good as any likely to be obtained” (27 November 1926).\nEdmonds insisted that his cooperation with Churchill be kept secret, ostensibly on the grounds that others would be demanding his help and that it would cause “trouble in Parliament”.\nChurchill, building on his critique of August 1916, argued that Allied casualties had in fact exceeded German. In his book The World Crisis (first published in the early 1920s, later reprinted in 1938), he quoted the German Reichsarchiv data, showing that across the whole Western Front between February and June 1916 the Germans had suffered  against the French, and  July and the end of the year (see statistical tables in Appendix J); elsewhere in the book he commented that the Germans suffered  at Verdun and that around one-eighth of their casualties were suffered on \"quiet\" sectors. According to the same tables, between July and October 1916, German forces across the Western Front suffered , of which  were inflicted by the French and  by the British. In turn German forces inflicted  on the Entente.\nChurchill stated that according to the Reichsarchiv figures the Germans suffered 200,000 casualties at British hands on the Somme between July and October 1916 [1927 edition, Part I, Table B opposite p52].\nThe British initial figures (War Office Statistics of the Military Effort of the British Empire, 1922) gives German losses of 237,000 between June and December, broadly consistent with Churchill’s figure.\nChurchill argued that Anglo-German loss ratios were 3:2 or even 2:1 (he ignores 1918 when losses were much nearer parity) and that German losses were not enough even to soak up the annual intake of new recruits. Philpott notes that Churchill missed the point that Germany was still calling up her manpower reserves in 1916, moving to full mobilisation.\nPrior was unable to discover anything much about the French figures, which were presented to the Chamber of Deputies in 1922. However, they would need to be reduced from 4.97m to 2.6m to equalise German casualties 5.383m on the western front throughout the whole war with Allied (British 2.758m), which he observes is hardly likely.\nChurchill also deducted 1/8 from British figures for “wastage” in quiet sectors; Prior suggests 1/10. For the French, the figure is 40% and for the Germans 25%. This still leaves 600,000 Allied casualties against 400,000 Germans and does not alter his case.\nChurchill checked his figures much more accurately and objectively than the supposed professional historians, Oman, Edmonds and Terraine, and displayed “superior analytic ability”.\nChurchill’s figures are also broadly consistent with the medical statistics and with the Annual Reports of the British Army.\nChurchill called it “the Blood Test”.\nPrior is “the most thorough analyst of Churchill’s casualty figures”.\nLloyd George's memoirs appeared in the mid-1930s and presented similar conclusions to Churchill's, namely that \"our\" losses on the Somme had exceeded German losses by two to one.\nOman\nMany of the arguments in Churchill's World Crisis - including his views on the importance of Joseph Gallieni's role at the Battle of the Marne and his analysis of the Battle of Jutland - were subjected to strong attack in 1927 in an anthology of essays edited by Lord Sydenham of Combe. In the introduction he denounced Churchill as “an amateur in so intricate a subject as war losses”, writing that “the true figures, intelligently handled, completely upset his theories and vitiate his conclusions”. Sir Charles Oman, a professional historian who had worked with Allied intelligence estimating German casualties during the war, contributed an essay on the Somme casualty figures.\nBritish losses\nOman argued that Churchill had overestimated British losses. Churchill had recorded that whole British loss on the Western Front between 1 July to 18 November 1916 was 463,000. He deducts 53,000 as an estimate for \"wastage\" on quiet sectors. Oman argued that Churchill underestimated wastage elsewhere, which should be nearer 100,000. According to Oman, British official totals for the Somme (1 July – 18 November) were 277,134 for Fourth Army, 57,681 for Fifth Army, and 7,847 Third Army for the first two days at fighting at Gommecourt. This gives a total British loss of 342,662. French official totals were 146,672 (including 44,308 lightly wounded). Total Allied losses were therefore 489,334, ie less than the Germans.\nOman also attacked Churchill for his comments that the British lost four times as many officers as the Germans (21,974 against 4,879). Churchill had admitted in a footnote that the British had more officers than the Germans but does not admit it was 25 combatant officers per battalion versus 11 or 12 in the German Army.\nGerman losses\nOman described how the Germans published almost daily central casualty lists, known as verlustliste. These were grouped by regiment, but the regiments whose casualties were published on any given day were usually listed in order of seniority, irrespective of where in Europe they were serving, with statistics for units engaged in the same battle often appearing on different dates. This was done to sow confusion, although Allied Intelligence in both London and Paris did a reasonable job of keeping up: casualties for regiments which had not published a figure lately were estimated from those of neighbouring units, and such estimates usually proved broadly correct, even for two ad hoc divisions and two ad hoc brigades on the Somme. However, the intervals between the publication of statistics grew longer and longer; by November it was 4–5 weeks, then from 6 December the Germans began to publish only alphabetical lists of casualties, with no indication of what unit the man belonged to.\nOman argued that losses were 420,000 officially admitted in the verlustliste, to which must be added an estimated 60,000 for casualties in October and November which had not been included in the verlustliste by the time they stopped, and 50,000 for casualties in non-infantry ancillary units. Total German losses were therefore around 530,000.\nOman also performed a further calculation. The German Reichsarchiv (by 1927 when Oman was writing) admitted to 164,055 killed or missing on the Somme and 272,596 wounded, for a total of 436,651. Oman argued that the 83,655 prisoners taken by the Allies need to be deducted from this total leaving only 80,000 killed against 272,000 wounded, an implausibly low ratio of 3.4:1 wounded to killed (the British had a ratio of 4.5:1 wounded to killed, the French similar and the Americans 5:1). Therefore, he argued, the number of German wounded should be nearer 360,000, which when added to the 164,055 killed or missing gives a total German loss of just over 524,000, similar to the 530,000 German losses estimated above.\nOman wrote that the true figure for German casualties was, therefore, more than double Churchill's number of 236,194. He argues that the Germans were rotating every available unit through the Somme, around 100 divisions in total and that their casualties were boosted by the many counterattacks which they made.\nWilliams and Prior refutation of Oman\nWilliams 1966 argued that Oman was overstating German Somme casualties. Oman had listed all losses for units that served on the Somme front during the battle, forgetting that not all those losses might have been incurred there as they might also have served in other sectors during the relevant time period.\nRobin Prior later addressed Oman's second argument, that the ratios of German wounded to dead were implausibly low in Churchill's figures. In the figures supplied to Churchill, some missing men had been allocated between dead and wounded although the exact details of how this was done do not survive. Prior writes that the British had a 4.5:1 wounded to killed ratio, whereas the Germans had 3.9:1. However, German missing made up 25% of their total casualties, but only 11% of British, so in Prior’s view it is reasonable to suppose that more German missing than British were in fact dead, which would tend to even up the wounded: dead ratios. MAKES NO SENSE.\nWendt\nIn 1931,  the German historian Wendt published a comparison of German and British-French casualties which showed an average of 30 percent more Allied casualties than German losses on the Somme.\nEdmonds and the British Official History\nEdmonds' official line in the British Official History in the 1930s was that the Somme was a British victory in casualties and morale – Prior wrote that he might have had “a comprehensive change of mind” from his private correspondence with Churchill in the 1920s, or felt that he had to defend the High Command, but that the matter “defies explanation”.\nIn the first 1916 volume of the British Official History (1932), J. E. Edmonds wrote that comparisons of casualties were inexact, because of different methods of calculation by the belligerents but that British casualties were  total British casualties in France in the period of  French Somme casualties were  German casualties were  to which should be added  woundings, which – he argued – would have been counted as casualties using British criteria; Anglo-French casualties on the Somme were over  German casualties were   In the second 1916 volume of the British Official History (1938), Miles wrote that total German casualties in the battle were  Anglo-French casualties of just under  \"fresh data\" from the French and German official accounts.\n1916 Vol I pp496-7 Edmonds wrote that 30% needed to be added. As justification Edmonds finally pointed to quote in Vol XII of the German Official History “the great losses of the summer of 1916, since the beginning of the year without the wounded whose recovery was to be expected within a reasonable time amounted to a round figure of 1,400,000, of whom 800,000 were between July and October. (NOTE TERRAINE AND PHILPOTT ALSO USE THIS QUOTE). (quoted in 1917 V1 p88 note 1, published 1940). Williams (1966) points out that Edmonds had slightly mistranslated and had misunderstood the meaning of the passage. It actually reads “The great losses of the summer of 1916 had made considerably more difficult the reinforcement supply of the Field Army. They amounted, since the beginning of the year, without the wounded whose recovery was to be expected within a reasonable period of time …” In other words, the German Official Historian, had, for purposes of a discussion of German manpower shortages, taken into account that lightly wounded men would soon be returning to duty and should not, therefore, be included in the manpower shortage; it was NOT a general statement that lightly wounded men were at all times excluded from German casualty statistics.\nIn his 1964 article, Williams attacked Edmonds’ claim that the Reicharchiv supplied “net” casualty figures and the Nachweisampt “gross”. For Verdun Edmonds compared Churchill’s 426,519 with Wendt’s 336,831, a difference of 33%. But Churchill’s figure, as Williams points out, is from the Reichsarchiv and so should be “net” according to Edmonds. In fact, they are over different time periods and Churchill’s number is for the entire Western Front, not just for Verdun. Prior writes that “The basis of Edmonds' calculations is entirely fallacious”. Prior writes that Edmonds is guilty of “similar sleight of hand” in comparing 419,654 British losses on the Somme with German losses on the entire Western Front.\nEdmonds also deduces 27% as the ratio for the Somme (“similar arithmetic and mental gymnastics” in Prior’s description)\nEdmonds argued that Germans only counted wounded every ten days.\nThe addition by Edmonds of  to German figures, supposedly to make them comparable to British criteria, was criticised as \"spurious\" by M. J. Williams in 1964 [CITE Journal of the Royal United Service Institution CIX 1964 pp 51–5 and CXI 1966 pp69-74].\nPrior and Wilson describe Edmonds' fudging of the German figures as “a desperate attempt to establish equivalence” with the Allied losses. Sheffield wrote that Edmonds' calculation of Anglo-French casualties was correct but his upward adjustment of German casualties was \"discredited\".\nAJP Taylor wrote in 1972 that the claim in the British Official History that the Germans suffered 650,000 casualties was “a conjuring trick” and “there is no need to take these figures seriously”. He believed the true number to have been around 450,000, and that it would have been lower had it not been for Erich von Falkenhayn's policy of counterattacking to retake lost ground.\nANDREW MACDONALD FIRST DAY OF THE SOMME ACCEPTS EDMONDS FIGURES (p. 434 - 500,000 base, 10,000 bombardment, 150,000 lightly wounded for 660,000 total \"cites various other comparative data from German sources\")  AND ADDS SOME STUFF ABOUT GERMAN PROPAGANDA AND EXTRA LOSSES BEING ADMITTED LATER (which I now can't find). NEED TO RECHECK EDMONDS.\n{|class=\"wikitable\"  align=right style=\"margin:0 0 1em 1em\"\n|+Western Front casualtiesJuly–December 1916\n|-\n! Month\n! Casualties\n|-\n| July||align=\"right\"|196,081\n|-\n| August||align=\"right\"|75,249\n|-\n| September||align=\"right\"|115,056\n|-\n| October||align=\"right\"|66,852\n|-\n| November||align=\"right\"|46,238\n|-\n| December||align=\"right\"|13,803\n|-\n| TotalBritish||align=\"right\"|513,289\n|-\n| French||align=\"right\"|\n|-\n| Total:Anglo-French||align=\"right\"|\n|-\n| German||align=\"right\"|\n|-\n|Grand total||align=\"right\"|\n|-\n| colspan=\"4\" style=\"text-align: center;\"|\n|}\nTerraine\nIn The Educated Soldier, his 1963 biography of Haig, John Terraine wrote \"the stark truth is that the German Army lost at least as many, and probably more men on the Somme than the British and French together.\" He quoted with approval Crown Prince Rupprecht's comment that \"what still remained of the old first-class peace-trained German infantry had been expended on the battlefield\" and argued that Germany's losses were even more serious than those of the Western Allies, as Germany was \"the main prop\" of the Central Powers whereas Britain and France still had the support of Russia and Italy. Terraine also quoted the same statistic as Edmonds from Vol XI of the German Official History, that in 1916 the Germans lost around 1.4m men, of which 800,000 were between July and November, not counting those \"wounded whose recovery was to be expected within a reasonable time\".\nTerraine accused Churchill and Lloyd George of spreading a \"misconception\", based on their supposed gullibility in accepting low German numbers issued as wartime propaganda, and accepted Edmonds' 1938 (1916 Vol II p XVI) figures of 680,000 German casualties, exceeding the 623,907 Allied. He argued that Edmonds had taken into account Oman's 1927 essay which put losses on both sides at around 560,000 and that the Official History was based on research after the German Official History had appeared, and was also likely to be accurate because the draft for that volume had been seen by over 1,500 combatant officers, as well by the Australian, Canadian, New Zealand, French and German Official Historians. Terraine also wrote that many documents both in London and Berlin had been destroyed by bombing in the Second World War, making further verification very difficult.\n(CAN FN SOME OF THIS - copied over to DH 1917)\nBy the time he published The Road to Passchendaele in 1977, Terraine had become aware of the work of M.J. Williams (1964 and 1966). He wrote that Edmonds' addition of 30% to German casualty figures was “a practice not universally admired”. However, Terraine once again repeated the quotation from the 1916 Volume of the German Official History about not including “the wounded whose recovery was to be expected within a reasonable period of time” and once again repeated Edmonds' error of taking the comment to mean that the lightly wounded were as a general policy not included in German statistics. Terraine also argued that German statistics were notoriously incomplete, and taking account of these two factors a variable amount of at least 15% and sometimes nearer 30% should be added to them. Whereas adding 30% to the German casualty figures for Passchendaele would bring them up to 289,000, Terraine suggested adding 20% to bring them up to 260,400, roughly equal to what he believed the British losses to have been.\nIn the Road to Passchendaele 1977, p347 Terraine argues for a variable percentage of more than 15% and sometimes as much as 30%. He adds 20% to the Official German figure for Third Ypres, bringing it up from 260,000 to 312,000, which he claims makes it approximately equal to the Allied casualties in that battle, a result which Prior describes as “very convenient” for his argument. He also observed that Terraine has produced “no new evidence” for claiming that German casualty figures are any less reliable than British.\nTerraine also pointed out that the Statistics of the Military Effort of the British Empire contain not one but three sets of estimated figures for the Somme. Prior argues that although Terraine “deserves credit” for pointing out that no set of statistics can ever be regarded as definitive, the differences (around 6% in one case and around 10% in another) are not enough to invalidate Churchill’s case that British casualties considerably exceeded those of the Germans.\nTerraine on Passchendaele, Liddell Hart and Edmonds, need to FN\nOver the Passchendaele figures, Terraine clashed with Liddell Hart who (Spectator 6 December 1957, Journal of the Royal United Services Institution November 1959) accused Edmonds of \"suppression and distortion\". Terraine examined Liddell Hart's papers (at the latter's invitation) and found nothing to support this claim, although he found correspondence between Liddell Hart and Edmonds suggesting that Edmonds enjoyed being \"all things to all men\". I HAVE STUFF ABOUT THIS IN THE SUTTIE BOOK ABOUT DLG MEMOIRS - BUT NOT ABOUT THE LIDDELL HART v TERRAINE SLANGING MATCH IN THE LETTERS COLUMNS\nBoth Churchill and Lloyd George put Third Ypres casualties at around 400,000. Liddell Hart in “The Basic Truths of Passchendaele” Journal of the Royal United Services Institute November 1959 put Third Ypres at >300,000 versus <200,000 Germans.\n“Statistics of the Military Effort of the British Empire” includes tables by groups of months, monthly totals, tables by battle.\nSpectator 6 December 1957 Liddell Hart accused Edmonds of “cooking” the figures, to a degree which horrified those who worked with him. “In old age his treatment of the evidence became deplorably misleading”. Most of the statistics in the OH were compiled from unit war diaries. However, the weekly casualty totals for Third Ypres and Cambrai were taken from the information supplied to the Supreme War Council by the Adjutant-General’s office in February 1918. Terraine believes these to be accurate as the Army was desperate for manpower then.\nMcRandle and Quirk\nMcRandle and Quirk in 2006 cast doubt on the Edmonds calculations but counted  casualties on the Western Front from July to December against  Churchill, concluding that German losses were fewer than Anglo-French casualties but that the ability of the German army to inflict disproportionate Allied losses had been eroded by attrition.\nJames McRandall and James Quirk add on 11% [ADD CITE \"The Blood Test Revisited\" The Journal of Military History 70 (2006) pp667-702} They bump the German figures up to 597,000 for July to October and an extra 39,000 in November and December (729,000 total July–December). Their figures support Churchill’s basic contention, but McR & Q acknowledge that loss ratios moved in the Allies’ favour as the war went on.\nPrior and Wilson\nPrior and Wilson wrote that the British lost  from 1 July – mid-November ( day). Of these, around 150,000 were killed and another 100,000 were too severely wounded ever again to serve as infantry, or in many cases in any capacity; nearly half the British troops who fought on the Somme never fought again. Those 250,000 permanent losses amounted to the fighting strength of 25 British divisions. 15 of the 52 British divisions engaged in the battle lost their entire infantry strength or in some cases more.\nSince mid-September Rawlinson had been complaining of a shortage of fresh troops. By October all 51 British divisions on the Western Front had served a tour of duty on the Somme, and British infantry strength had fallen from 689,000 to 576,000, with only 23,000 available in depots and base camps. Battalion nominal strength (NOT CLEAR IF THIS IS JUST Fourth Army) cut from 800 men to 350 men. Losses had fallen disproportionately on officers and specialists such as Lewis gunners. Experienced men were needed to train the new drafts due at the start of 1917. By early November Rawlinson was urging Haig to wind down the offensive. (See 1916 Vol 2 p 536)\nPrior and Wilson write that “there is no reason to doubt [the] accuracy” of the early 1920s Reichsarchiv which Churchill used. However, they observe that Churchill's figure (200,000 German casualties at British hands on the Somme between July and October 1916) needs to be adjusted upwards to account for casualties suffered in the June bombardment and in the fighting in November. This is broadly consistent with the British initial figures (War Office Statistics of the Military Effort of the British Empire, 1922) of German losses of 237,000 between June and December. Knocking off of the December casualties, after the Battle of the Somme had finished, suggests a German casualty figure somewhere in the region of  losses inflicted by the British.\nIn their 2005 book on the Somme Prior and Wilson offer no figures for French casualties or the losses they inflicted on the Germans.\nChurchill was right that Allied losses exceeded German, although he omits to mention that in 1918 they were much nearer parity. Churchill also ignores the effect of industrial attrition caused by the strain of maintaining an army of 8m men. production of railway machinery declined by almost 100% during the war, so by the end, many blast furnaces were idle from lack of coal. Industrial production declined by 25% and the civilian labour force declined by 4m. Consumer goods production was down to 50–60% of prewar levels, and by 1918 Germany had lost 75% of her gold reserves and almost all her foreign securities (which would have been used to purchase imports).\nWilson - Myriad Faces of War. P350-2 A crude “Blood Test” ignores resources of manpower – Verdun was, in terms of casualties, a modest German success, but France had fewer manpower reserves than Germany – yet the Allies as a whole had more manpower reserves than the Central Powers. This is also true of the Somme – the Allies could better absorb losses, even though these exceeded German losses. Furthermore, a German soldier was more effective than a Russian soldier, who was more effective than an Austro-Hungarian soldier – but assuming an army to be sub-standard was often disastrous, as the Allies found out against the Turks at Gallipoli. On the whole, Wilson argues, the Somme probably hurt the Germans and the Central Powers more than the Allies, but this is only “a guess” based on information which was not available to leaders at the time – Haig was probably wrong about a pure “Blood Test” but right in the broader sense – but this is “not evidence of greater insight or a better intelligence service on his part”, but simply “the correct call on the toss of a coin”. He had no real way of knowing the extent of German casualties or how long they could hold out.\nPhilpott\nIn a commentary on the debate about Somme casualties, Philpott used Miles's figures of  casualties and the French official figures of  Army losses and  Army casualties. Philpott describes German losses as \"disputed\", with estimates ranging from  The high Allied casualties of July 1916 are not representative of the way attrition turned in the Allies' favour in September, although this was not sustained as the weather worsened in later months. Philpott quotes with approval Robin Prior's comment (in ''Churchill's World Crisis As History (1983)) that the \"blood test\" is a crude measure compared to manpower reserves, economic and financial resources and that these intangible factors were more influential on the course of the war, which the Allies won in the end despite \"losing\" the purely quantitative test.\nMiles gave British losses 419,654 up to 30 November, 5% of whom were “absentees” who subsequently returned. French official history has 154,446 Sixth Army and 48,131 Tenth Army between 1 July and 20 November, a grand total of 202,657.\nGerman casualties are “much more disputed” 400,000–680,000. Churchill in second half of 1916 (July to December). 513,279 British, 434,000 French (including Verdun and near east); Germany 630,192.\nPhilpott also writes that the British Official History wrote that their German figures were incomplete (OH II PXV Note 4), while also arguing that the losing side had less incentive to produce accurate statistics than the winners. 1.4 m permanent German losses in 1916, 800,000 of them from July (the period when the Somme was underway). Philpott suggests that knocking off Verdun, the East and general trench wastage from that 800,000 means that the Germans must have suffered 500,000 “permanent losses” (Ie. not including lightly wounded) on the Somme.\nThe memoirs of Ernst Junger (Storm of Steel) and Franz von Papen testify to the horrific German casualties suffered in September.\nReichsarchiv later admitted German “grave loss of blood affected us very much more heavily than the Entente”.\nIn October 1918 Ludendorff claimed that it was the breaking of German morale, rather than loss of men, which caused him to recommend suing for peace.\nOther modern historians\nDoughty wrote that French losses on the Somme were \"surprisingly high\" at   the  at Verdun.\nSheldon wrote that the British lost \"over\nHarris wrote that total British losses were  casualties were over  and German losses were  to the \"best\" German sources.\nIn his short study of the Somme (2003) Sheffield quoted the official German figure of  In his biography of Haig (2011) Sheffield wrote that the losses were \"appalling\", with  casualties,  and perhaps  casualties.\nNew Stuff to be worked in\nSheldon “Fighting The Somme” (2017, p.203) - PUT IN BOOKLIST -  “somewhere around 500,000 killed wounded and missing, to be as precise as is possible at this remove”\nFarrar-Hockley The Somme (1964) – PUT IN BOOKLIST. pp251-3 “of the many controversies accruing from the battle of the Somme, none has been more extensively argued than the matter of the casualties” This partly because Haig later stressed not his original intention to break through but the damage which he inflicted on the Germans. Citing quotations from the memoirs of Ludendorff and Hentig’s famous quote (Psychologische Strategie des Grossen Krieges'')  “muddy grave of the German field army” he declares that it is “incontrovertible” that the Somme weakened the German Army the same as the Battle of Stalingrad in 1942-3, and that it could even be argued that the experience of 1914-18 shows that “in prolonged battles” the defender suffers more than the attacker. He writes that the British Army daily reports (“battle returns”) were the upper limit as they included men lightly wounded who remained on duty, or missing men who later returned (eg. genuine stragglers in battle). Conversely German returns were submitted three times per month (so did not include men who were temporarily missing) and did not include lightly wounded men – up to 2,000 on any day – held in corps casualty units. Furthermore, as the war went on the German falsified their casualty figures, later releasing an “enormous” number of “concealed casualties. Prussian Army records were destroyed by Allied bombing of Potsdam in April 1945 (he does not mention that many of the German defenders on the Somme were Bavarians and many records actually survive). He also quotes Edmonds in saying that German regimental accounts, which listed the dead by name, suggest a much higher total than the “official” numbers. In conclusion he suggests that there were probably around 450,000 British, 150,000 French and 600,000 German casualties. WHAT A LOAD OF CRAP\nTerraine R2P - PUT IN BOOKLIST\nDuffy Through German Eyes p324-5 “entirely unquantifiable loss of contacts which enriched British industry commerce and the arts. F204,000 B420,000 of whom about 150,000 killed. German ”Estimates vary wildly from about 230,000 {NO SOURCE ADD COMMENT} … to a still less credible 680,000”. “Best sources”(Reichasarchiv) put it around 500,000. Allies could afford losses more, and Germans attested to Allied bombardments and the awfulness of the autumn rain and mud, and the inability of G troops to rest as there weren’t enough of them and they were too busy building new trenches for much R&R. “Evidence is oddly inconclusive” as British daily loss rates higher than 3Y but lower than Arras and the Hundred Days. Plus the Somme went on a long time.\nBoff Haig's Enemy 2018 - PUT IN BOOKLIST\nBritish 419,654 French 204,253. German losses \"a conservative 429,209 and a frankly implausible 680,000. About 500,000 seems roughly right\".\npp141-2 Haig three objectives, any one of the three enough – relieve Verdun (wound down from 12 July  – four months after Verdun had begun- but had been clearly doomed long before that), pin down German assets in the west (15 divs went east, 9 of them exhausted, and six fresh ones came west; Germans were hard-pressed and crushed Romania and we don't know how many they could have moved if there had been no Somme), and wear down the enemy.\np143 British closed the qualitative gap, although Rupprecht thought this was more a case of his own men getting worse, and the British got clumsier again towards the end of the year.\nIan Beckett – The Making of the First World War\np.5, p.241 The British milhist view is \"unconvincing\" and Prior & Wilson's view is \"more realistic\" than that of Sheffield 2003.\nStrachan intro to Strohn essays on the Somme\np.15 By the end of 1916 Allied strategy appeared to be working, but by July 1917 \"the Chantilly strategy was in ruins\"\nRoberts Elegy 2015\nP222 419,655 British, 194,451 French, Germans “around 600,000” but hard to tell as the Germans only counted their wounded every ten days, so a man might be patched up from a (presumably very light wound) and return to active duty without showing up in the statistics, whereas the British did so every day.\nSheffield The Chief 2011\nP191 wsc paper “variants of the offensive” “Winston’s head is gone from taking drugs” Haig wrote (8 August)\nP194 despatch of 23 december 1916\nP432 Prior & Wilson 230,000 “based on a controversial source”.\nFoley 2005 (quoted with approval by Sheffield 2011 p432\nFoley 2005 p 257 until end of August British wore down the Germans on the Somme more effectively than the Germans wore down the French at Verdun\nPrior & Wilson The Somme 2005\nHigh British casualty rates, almost 2:1, are awkward in view of the superiority which the British enjoyed in air and artillery.\nPrior & Wilson – Command on the Western Front. - PUT IN BOOK LIST\nAlex Watson – Ring of Steel\nP324 argument that it had inflicted “lethal damage” to the Germans made “strangely little reference to German sources” German Official History admitted to nearly 500,000 German casualties (Weltkrieg XI, p103). British official historians spread “deliberate confusion” about whether this figure was accurate but if anything it erred on the side of conservatism – German returns submitted every ten days (including sick and wounded who could be expected to return) showed 416,802 casualties, not counting 3,053 gas and 9.354 psychiatric for 429,209 total.\nP325 “The Entente thus certainly inflicted grievous losses … but it failed to deal a death blow”. German Army peaked in strength in July 1917, 750,000 men stronger than a year earlier “the Entente failed in what was supposed to be its year of attrition” despite their “vast numerical and material superiority”. The German Army’s 1.393,000 killed wounded missing and POW (336,00 of them dead), was 311,000 fewer than the corresponding figure the previous year (totals probably an underestimate but the trend is correct).\nP325-6 German Army suffered serious psychological effects – church service attendance was down, sicker, desertion, self-wounding, rumours of proletarian Rhinelanders fragging their officers. The ratio of captured and killed to missing rose. On the Somme and at Verdun in October there were reports of panicked German units fleeing or surrendering.\nPp637-8 Philpott’s “500,000 irreplaceable losses” “is not borne out by any official figures and should be regarded as greatly exaggerated”\nWorld Crisis by Winston Churchill Colonel the Lord Sydenham of Combe, Kennikat Press 1928 reprinted 1970\nIt “saved Verdun” and “struck terror to the enemy” and enabled the French to regain ground at Verdun later in the year.\nBeckett British Army and WW1\nP301 German losses probably around 500,000.\nxxxxxxxxxxxxxxxxxxxxx\nPrior and Wilson's older book has French stats.\nrequest for more info about how casualties were measured and how frequently stats were collated.\nneeds intro\nFootnotes\nReferences\nBooks\n*  |orig-year=1919}}\n*\n*\n*\n*  |orig-year=1932}}\n*  |orig-year=1940}}\n*\n*  |orig-year=2008}}\n*\n*  |orig-year=1938}}\n*\n*\n*\n*  |orig-year=2001}}\n*\n*\n*\n*  |orig-year=2005}}\n* }} (contains essay on Somme casualty figures by Charles Oman)\n*  |orig-year=1963}}\n*\nFurther reading\n*\n*\n*\n*\n*\n*\n*\nExternal links\n* [http://www.forces-war-records.co.uk Battle of the Somme Personnel Records]\n* [http://pierreswesternfront.punt.nl/content/2008/03/somme-introduction Battle of the Somme, maps and photo essay]\n* [https://www.longlongtrail.co.uk/battles/battles-of-the-western-front-in-france-and-flanders/the-battles-of-the-somme-1916/ The British Army in the Great War: The Battles of the Somme, 1916]\n* [http://www.nzhistory.net.nz/node/2455 New Zealand and the Battle of the Somme]\n* [http://www.images-en-somme.fr/historial-de-la-grande-guerre.php Peronne Great War Historial]\n* [https://web.archive.org/web/20070929104228/http://www.puredarren.com/somme.htm The Somme – Northern Ireland Remembers]\n* [http://www.delvillewood.com/bienvenue2.htm Official website of Delville Wood]\n* [https://archive.org/details/notesonrecentope00unitrich Experience of the German First Army in the Somme Battle, 24 June – 26 November 1916, Below F., pp. 77–143 (1917)]\n* [http://media.cwgc.org/media/244555/the_somme_information_leaflet.pdf CWGC: 1916: The Somme]\n* Nicholas Hiley: [https://encyclopedia.1914-1918-online.net/article/the_battle_of_the_somme_film/ The Battle of the Somme (film)], in: [https://encyclopedia.1914-1918-online.net/home.html/ 1914-1918-online. International Encyclopedia of the First World War].\n* William Philpott: [https://encyclopedia.1914-1918-online.net/article/somme_battles_of/ Somme, Battles of], in: [https://encyclopedia.1914-1918-online.net/home.html/ 1914-1918-online. International Encyclopedia of the First World War].\n:Category:Battles of the Western Front (World War I)\n:Category:Military history of Hauts-de-France\n:Category:1916 in France\n:Category:Conflicts in 1916\n:Category:Tunnel warfare in World War I\n:Category:Battles of World War I involving Australia\n:Category:Battles of World War I involving Canada\n:Category:Battles of World War I involving Germany\n:Category:Battles of World War I involving France\n:Category:Battles of World War I involving New Zealand\n:Category:Battles of World War I involving South Africa\n:Category:Battles of World War I involving the United Kingdom\n:Category:Battles involving the French Foreign Legion\n:Category:November 1916"
    }
  ]
}