{
  "content": [
    {
      "type": "text",
      "text": "# Draft:Edward Wyndham\n\n----\nEdward Wyndham ( 1608 - 1664 ) was born in 1608 in the county of Norfolk, England as the youngest son of Thomas and Susan Clere Wyndham and the grandson of Sir Henry Wyndham (b. 1537.)  He was a descendant of Thomas Wyndham, (b. 1466). He was married to Abigail Offley ( 1604 - 1650 ) c. 1630 in Virginia. His sister , Ann Wyndham, married Thomas Thoroughgood, brother of\nAdam Thoroughgood  who married Sarah Offley in 1627 and subsequently Francis Yeardley, the son of George Yeardley. These interrelationships are critical to an understanding of the political dynamics in and between England and colonial Virginia. They had a pronounced influence on subsequent migrations motivated by religious beliefs as well as on the political and military  actions  within the original colonies.\nPolitical and military  career in Virginia and Maryland\nHe served as a judge and military advisor in Tidewater Virginia. On June 16, 1637,he was appointed as a commissioner in Lower Norfolk.  On January 6, 1639, he was appointed inspector of tobacco crops for the county Clerk's Office, in Portsmouth, Va. The deeds of Norfolk County show that he was a landowner, since he was able to deed 400 acres.\nHe represented Lower Norfolk in the 1642/3 as a burgess in the  Virginia General Assembly.\nHe is said to have acted as lieutenant-colonel of the militia. Given the intense military challenges that resulted in the third of the Anglo-Powatan Wars, that must have been a significant position.\nFamily sources state that he was a man of military talent. That perception is supported by the fact that he was one of the eight members of the council of war which met on June 3, 1645. He is referred to as Captain Edward Wyndham in the orders shown in the  Lower Norfolk County records.\nHistorical reports and analysis of the Anglo-Powattan Wars indicate that the colonists faced significant military threats at that time in the aftermath of the massacre of 1622. That makes it unlikely that they would have trusted membership on the council of war to an inexperienced or inept person, and supports the idea that he was a military leader.\nThe significance of family ties on his career remains speculative, as is the influence of the English Civil War  on events in Colonial Virginia and Maryland.\nThe will of Adam Thoroughgood, which left him a small legacy, and refers to him as a \"beloved brother\" is indicative, as is his signing of the Grand Remonstrance, and his eventual return to England.\nThe replacement of Francis Wyatt  as Governor of Virginia by William Berkeley (governor) , who offered asylum to royalists and was hostile to Puritans and Quakers in 1641 is an indicator, as is the family report that he joined the Puritan emigration to Maryland in 1651.\nDeath\nUpon his return to England, he was buried in Stokley, Norfolk on September 6, 1664.\nReferences"
    }
  ]
}