{
  "content": [
    {
      "type": "text",
      "text": "# Draft:Rama Kant Dawar\n\n----\nDr. Rama Kant Dawar is an Indian-American author, credentialed court interpreter, motivational speaker, educator, and public servant based in Fresno, California. He is best known for authoring the world's first bilingual medico-legal dictionaries in English, Hindi, and Punjabi, which are held in the Library of Congress and WorldCat, and are used by professionals in medical, legal, and law enforcement fields. He also authored the financial self-help book Path to Your Financial Freedom: How to Fix Your Own Credit and the wellness guide Yoga with Dr. Ramakant Dawar, Psy D. Dawar is a published academic with a peer-reviewed article on gun violence in the Journal of Advances and Scholarly Researches in Allied Education. As a pioneering Indian-American elected official in Fresno, California, he has significantly contributed to civic, educational, and multicultural initiatives.\nEarly life and education\nDawar was born on November 12, 1967, in Panipat, India, a city historically known for the three Battles of Panipat. In 1992, Dawar worked as a journalist writing about the Battles of Panipat and crime stories for the magazine Sachidunia.\nAfter migrating to the United States, he attended Fresno City College.\nHe earned a certificate for the Court Interpreter Ethics Workshop from the Judicial Council of California in 2000.\nHe earned an Associate of Science in Paralegal Studies from Ashworth University in 2009.\nDawar completed a diploma in Private Investigation with Honors from Ashworth College in 2015.\nHe also holds diplomas in Engineering and International Trade and Marketing (dates not specified).\nHe obtained a Ph.D. in Psychology from OPJS University, Rajasthan, India. His doctoral dissertation focused on Stress, Burning, and Anger Management of Police Personnel through Psychological Techniques. A credential evaluation conducted by USCES (United States Credential Evaluation Services) in 2019 determined the degree to be equivalent to a U.S. Ph.D. in Psychology, with a GPA of 4.00.\nHe is also the author of a financial self-help book based on his experience, Path to Your Financial Freedom: How to Fix Your Own Credit.\nMurder-for-hire case\nIn 2011, Dawar was the target of a murder-for-hire plot by Daljit Singh, a former business associate. Fresno Police reported Singh offered to pay $2,000 to have Dawar killed. In 2012, Singh was convicted by a jury of solicitation to commit murder.\nCareer\nAuthor\nDawar is known for several bilingual and trilingual works:\n* Medico-Legal Dictionary (English–Hindi)\n* Medico-Legal Dictionary (English–Punjabi)\n* Path to Your Financial Freedom: How to Fix Your Own Credit\n* Yoga with Dr. Ramakant Dawar, Psy D: A Journey to Wellness (2025)\nHis medico-legal dictionary is considered the first of its kind and is a collectible at the Library of Congress.\nPublic service\nIn 2009, Dawar was appointed to the Fresno City Planning Commission by Mayor Ashley Swearengin, and reappointed in 2010. He was the first Indian-American in the 159-year history of Fresno to be elected to the Planning Commission, and is believed to be the first Indian-American elected official within city limits.\nIn recognition of his civic participation, he received a Certificate of Recognition from the Mayor of Fresno for 2010 Census outreach.\nHe was awarded an Honorary Citizenship Certificate by the City of Pensacola, Florida, in 2014.\nIn November 2014, Dawar was elected to the Central Unified School District Board of Trustees and sworn in on December 9, 2014. During his term:\n* Punjabi was added to the district curriculum.\n* A full-time Punjabi language teacher was hired.\n* In 2016, orientation programs in Punjabi were offered by Fresno Unified School District for parents facing language barriers.\nDawar has also worked as a teacher for Fresno, Clovis, and Madera Unified School Districts.\nHe served as an interpreter and examiner for Language Line Services for nine years in Hindi, Punjabi, Haryanavi, and Urdu, including four years as an examiner.\nMedia work\nRadio and media\nSince the early 2000s, Dawar has hosted and co-hosted multiple community radio programs on KBIF 900 AM, a multicultural and multilingual station based in Fresno, California. His shows have focused on raising awareness on topics such as:\n* Domestic violence prevention in South Asian communities\n* Financial literacy, including credit repair and debt management\n* Legal issues including immigration, family law, and tenant rights\n* Mental health, particularly stress and anger management\nDawar often invited community leaders, psychologists, attorneys, and elected officials to speak on the air. His programs were broadcast in multiple languages, including Hindi, Punjabi, Urdu, and English, allowing greater accessibility for immigrant and bilingual audiences.\nIn addition to KBIF, he has made guest appearances on other local public access media and podcasts focusing on wellness and legal empowerment.\nHe continues to produce educational content through his YouTube channel, where he discusses similar issues through interviews and presentations.\nBusiness\nDawar is President of Rama’s Consultation, a Fresno-based firm providing services in credit repair, immigration paperwork, real estate consultation, and court interpretation.\nProfessional affiliations\n* Rotary International (District 5230)\n* California Court Interpreters Association\n* AACRAO – American Association of Collegiate Registrars and Admissions Officers\n* TAICEP – The Association for International Credential Evaluation Professionals\n* NAFSA – Association of International Educators\nSelected publications\n* Dawar, R.K. (2025). Yoga with Dr. Ramakant Dawar, Psy D: A Journey to Wellness. Kindle, 596 pp.\n* Dawar, R.K. (2015). Path to Your Financial Freedom: How to Fix Your Own Credit. ACE1 Credit Repair.\n* Dawar, R.K. (n.d.). Medico-Legal Dictionary (Hindi–English)\n* Dawar, R.K. (n.d.). Medico-Legal Dictionary (Punjabi–English)\n* Dawar, R.K. (2018). \"Gun Violence: An Epidemic in Our Modern Society\". Journal of Advances and Scholarly Researches in Allied Education, 15(20180501), p.49.\nExternal links\n* [https://www.youtube.com/@ramadawar757 YouTube – Dr. Dawar]\n* [https://www.linkedin.com/in/ramakantdawar LinkedIn – Dr. Dawar]\n* [https://ace1creditrepair.com/assets/docs/Path_to_Your_Financial_Freedom.pdf Path to Your Financial Freedom PDF]\nReferences"
    }
  ]
}