{
  "content": [
    {
      "type": "text",
      "text": "# Draft:BackBox Software\n\n----\nBackBox Software is a provider of network automation and cyber resilience solutions headquartered in Dallas, Texas. It supports enterprise and managed service provider environments across more than 180 network vendors and 100,000 networks worldwide.\nHistory\nBackBox was founded in Tel Aviv, Israel, in 2009 by Rafi Zvi and Roy Horev. The company began as a managed services provider before shifting focus to network automation software. In 2021, it raised $32 million Series A funding led by Elsewhere Partners and moved its headquarters to Dallas, Texas.\nAndrew Kahl was appointed CEO following the funding round, noting “There is unlimited potential to expand BackBox’s market reach as network environments become more complex and IT constraints continue to evolve.”\nIn April 2024, Rekha Shenoy succeeded Kahl as CEO. Shenoy emphasized, “BackBox is in a unique position to support the automation needs of enterprise, MSP, and government network teams, given its strong product and talented team.”\nProducts and Technology\nThe flagship Network Cyber Resilience Platform automates vulnerability management, policy compliance, disaster recovery, backup, and configuration management across on-premise and cloud environments. It includes a no-code Automation Library with 3,000 pre-built automations and integration support for major vendors including Cisco, Palo Alto Networks, Check Point, and F5.\nIn 2025, the release of BackBox 8.0 added unified management for hybrid infrastructures. “BackBox 8.0 is designed to accommodate complexity by providing a unified view of modern network infrastructure that seamlessly integrates on-prem and cloud-managed elements,” said Shenoy.\nMarket and Industry Impact\nBackBox serves over 500 enterprise and service provider customers worldwide. The company was included on the 2025 Inc. 5000 List of America’s Fastest-Growing Private Companies. It has also been recognized in media outlets such as VentureBeat, Dallas Innovates, and HelpNetSecurity for advancing network automation and resilience.\nSelected Quotes\n* “Our software takes away manual processes. Only about 10 percent of companies worldwide use network automation software. The rest are doing checks by hand and it’s costing them thousands of hours a year. We do it within hours.” – Andrew Kahl\n* “BackBox delivers greater visibility into on-prem and cloud-managed/SASE devices. Its reliable, automated backups and compliance checks take care of tasks that were once manual.” – Scott Nursten, CEO, ITHQ\n* “As cybersecurity challenges and network complexities grow, network automation is a powerful capability that can be transformational to network engineers every day.” – Rekha Shenoy\nFurther Context\nBackBox Software is not affiliated with BackBox Linux (BackBox.org), the open-source penetration testing operating system. The two entities are separate and unrelated in leadership, products, and operations.\n:Category:Software companies of the United States\n:Category:Companies based in Dallas\nReferences"
    }
  ]
}