{
  "content": [
    {
      "type": "text",
      "text": "# Draft:Robert W. Buckingham\n\n----\nRobert W. Buckingham is an American public health expert, author, and academic leader, recognized for his pioneering role in the hospice care movement and for advancing public health education worldwide. He is Professor Emeritus of Public Health and Health Sciences at the University of Michigan–Flint.\nEarly life and education\nBuckingham is a graduate of Yale University, where he earned a Doctor of Public Health degree from the Yale School of Medicine in 1978.\nHe graduated from Hamden Hall Country Day School in 1962, where he was a top student and athlete, later returning in 2018 to deliver the school's commencement address.\nCareer\nIn 1974, while still a student, Buckingham authored the grant proposal that led to the creation of the first hospice program in the United States, located in New Haven, Connecticut. He was appointed the program’s first Director of Research.\nHe went on to help develop 81 hospice programs worldwide, including one in Thailand for children with HIV/AIDS.\nFrom 2009 to 2014, Buckingham served as the founding dean of the School of Public Health at the University of Saskatchewan. He joined the University of Michigan–Flint in 2014, where he taught and led initiatives in global health until his retirement.\nHe has served on the board of the Association of Schools of Public Health in the European Region (ASPHER) from 2016 to 2022, and is a current member of the ASPHER–WHO COVID‑19 Task Force.\nResearch and publications\nBuckingham has authored thirteen books and numerous peer-reviewed articles. His works span topics such as hospice care, grief, leadership in public health, and gendered experiences of loss.\nAmong his best-known publications is Care of the Dying Child, a book translated into seven languages and used internationally in pediatric palliative care.\nHis 2017 book, Understanding Loss and Grief for Women, was published by Praeger.\nHe has also published five scientific papers on COVID-19 in international academic journals.\nGlobal health\nDr. Buckingham has worked in more than a dozen countries, including Thailand, Myanmar, Palau, and Papua New Guinea, where he helped establish hospice care programs and advised on public health policy.\nHe is listed as a member of the Center for Global Health Equity at the University of Michigan, where his research interests include maternal and child health, infectious diseases, and global access to end-of-life care.\nAwards and honors\n* Ivanosky Prize in Humanitarian Medicine (2006), awarded by the Russian Institute of Virology for his work in pediatric AIDS hospice care in Thailand.\n* Nelson Mandela Award for Academic Leadership (2014), awarded by Harvard University for his defense of academic freedom and global leadership.\nSelected works\n* A Special Kind of Love: Care of the Dying Child – translated into 7 languages\n* Understanding Loss and Grief for Women (Praeger, 2017)\n* Home Hospice: A Guide for Caregivers\n* Living With Grief and Loss: A Guide for Adults and Children\n* Hospice for Children with AIDS\nReferences\nExternal links\n* [https://globalhealthequity.umich.edu/membership/members/bucking Profile at Center for Global Health Equity]\n* [https://news.umflint.edu/2020/03/25/how-a-um-flint-professor-is-helping-to-combat-covid-19-internationally/ UM–Flint COVID Task Force article]\n* [https://ysph.yale.edu/about-school-of-public-health/communications-public-relations/publications/public-health-magazine/article/alumni-news-fall-2023/ Yale School of Public Health Alumni News – Fall 2023]"
    }
  ]
}