{
  "content": [
    {
      "type": "text",
      "text": "# Draft:Kingsley Ng (Malaysian actor and model)\n\n----\n| birth_place    = Kota Kinabalu, Sabah, Malaysia\n| occupation     = Actor, model\n| years_active   = 2009–present\n| height         = 5 ft 9 in (1.75 m)\n| website        = [https://www.instagram.com/kingsley_ng Instagram]\n| image          = Kingsley_Ng_in_suit_2025.jpg\n| image_size     = 250px\n| caption        = Kingsley Ng in 2025\n}}\nKingsley Ng (Chinese: 金帝; born 21 October 1991), birth name Ng Kah Hou (Chinese: 吴家豪), is a Malaysian actor, model, and beauty pageant judge. He was born in Kota Kinabalu, Sabah, and has been active in the entertainment industry since 2009, appearing in films, television, variety shows, advertisements, and fashion events.\nEarly life and career\nNg began his career in 2009 by participating in modeling competitions and fashion-related events. In 2012, he was a finalist in Mister International Malaysia, gaining recognition as a new face in the Malaysian modeling industry.\nTelevision and media appearances\nFrom 2013 to 2016, Ng participated in the outdoor reality show Splash Fiesta (《水舞全城》), broadcast on RTM TV2, where he appeared in various physical challenge segments.\nIn 2014, he played the male lead in the official music video for Malaysian singer Yu Heng’s (宇珩) song \"Fánxīng\" (《繁星》).\nOther activities\nNg has been invited as a judge and guest mentor at various beauty pageants and youth cultural events.\nAwards and recognition\n* 2022: International Outstanding Chinese Artist Award, Malaysia Gold Star Awards.\n* 2022: Outstanding Chinese Youth Award, Malaysia Gold Star Awards.\n* 2022: Emerging Influential Figure of the Year, International Cultural Exchange Association.\nReferences\nAdditional references:\n* [https://www.imdb.com/name/nm17594605/ IMDb profile: Kingsley Ng]\n* [https://medium.com/@personaarchive/title-1d1f36f81232 Medium: Malaysian Actor Kingsley Ng Kah Hou]\n* [https://open.substack.com/pub/personaarchive/p/malaysian-actor-kingsley-ng-kah-hou Substack: Malaysian Actor Kingsley Ng Kah Hou]\nExternal links\n* [https://www.instagram.com/kingsley_ng Official Instagram]\n* [https://www.facebook.com/kingsleyngkh Official Facebook Page]\n* [https://www.youtube.com/watch?v=hQopCnWAgqM Yu Heng – Fánxīng MV (starring Kingsley Ng)]"
    }
  ]
}