{
  "content": [
    {
      "type": "text",
      "text": "# Draft:Naval battles of the War of 1812\n\n| combatant2        =\n| commander1        =   John Rodgers\n|  Stephen Decatur\n|  Oliver Hazard Perry\n|  Thomas Macdonough\n|   David Porter\n}}\n| commander2        =  Philip Broke\n|  George Cockburn\n|  James Lucas Yeo\n|  Robert Heriot Barclay\n|  James Hillyar\n}}\n| campaignbox       =\n}}The War of 1812 featured a series of naval engagements between the forces of the emergent United States Navy and the preeminent Royal Navy, occurring across multiple maritime theaters, including the Atlantic Ocean, Great Lakes, Gulf of Mexico, and various coastal waters of North America. During the early phase of the war, American ground forces faced multiple challenges, yet the United States Navy recorded significant successes in naval engagements across the Atlantic and the Great Lakes region. At the same time, British naval strategy was predominantly directed towards the ongoing Napoleonic Wars in Europe, restricting the allocation of their full naval strength to the North American conflict. However, following the abdication of French Emperor Napoleon Bonaparte in April 1814, Britain was able to redirect its full military and naval focus to the war against the United States. At the outset of the War of 1812, the Royal Navy remained the most powerful naval force in the world, fielding over 600 cruisers in commission along with a large number of smaller vessels. In comparison, the United States Navy was a much smaller force, consisting of eight frigates and fourteen brigs and sloops, with no ships of the line in service.\nFrom the outbreak of the Napoleonic Wars in 1803, Britain imposed a broad naval blockade intended to restrict neutral trade with France and its allies. The United States, maintaining a position of neutrality, viewed these restrictions as violations of international maritime law and detrimental to its commercial interests. In parallel, the Royal Navy, facing chronic manpower shortages due to its global commitments, regularly impressed sailors from American merchant vessels—often without regard to citizenship status—on the grounds that they were British deserters. This practice provoked widespread anger in the United States and gave rise to several high-profile incidents. In 1807, the Chesapeake–Leopard affair occurred when HMS Leopard fired upon the USS Chesapeake and forcibly removed four sailors, igniting public outrage. Continued acts of impressment further escalated tensions, culminating in the Little Belt affair of 1811, when a confrontation between the USS President and HMS Little Belt resulted in the deaths of eleven British sailors. These ongoing maritime disputes and perceived violations of American sovereignty contributed significantly to the U.S. declaration of war against Great Britain on June 18, 1812, under the administration of President James Madison.\nDuring the American Revolutionary War and the War of 1812, large fleet actions involving ships of the line were uncommon in North American waters. Instead, naval engagements primarily involved smaller vessels such as frigates, sloops-of-war, and brigs. These warships, favored for their speed and maneuverability, were typically used for independent cruising, commerce raiding, convoy escort, and scouting. Most of the notable naval battles of both conflicts were fought between these smaller classes of ships rather than in traditional line-of-battle formations.\nPrelude to war\nReferences\nCitations\nBibliography\n*\n*\n*\n*\n*\n*\n*\n*\n*"
    }
  ]
}