{
  "content": [
    {
      "type": "text",
      "text": "# Draft:Renaissance (Albanian political movement)\n\nRenaissance () is a political ideology based on the leadership style, governance philosophy, and policy priorities of Albanian Prime Minister Edi Rama. The ideology combines elements of strong central governance, aesthetic urban transformation, pragmatic progressivism, and cultural diplomacy. While not formally codified as a political theory, Ramism has been informally used to describe the political and stylistic approach that characterizes Rama's administration.\nCore principles\nRamism is defined by several key principles:\n* Aesthetic Governance: Emphasizing the role of visual transformation, public art, and urban planning as tools of governance. Public space is treated as a reflection of state authority and national identity.\n* Transformative Centralism: Advocates for a strong and centralized executive branch to implement rapid reforms and overcome bureaucratic inertia.\n* Pragmatic Progressivism: Supports progressive policies, such as digital transformation and EU integration, implemented with a practical, result-oriented approach rather than ideological rigidity.\n* Cultural Diplomacy: Utilizes art, heritage, and cultural presence to enhance Albania's international image and assert soft power on the global stage.\n* Urban Rebirth: Prioritizes large-scale urban infrastructure projects as both functional improvements and symbolic efforts to reshape national identity.\n* Pro-European Orientation: Firmly supports Albania's integration into the European Union, with a balance between alignment with Western values and maintaining national sovereignty.\nPositive aspects\nSupporters of Ramism highlight the following benefits:\n* Urban Modernization: Major improvements in city infrastructure, especially in Tirana, have transformed public spaces and promoted tourism.\n* Diplomatic Visibility: Increased international recognition of Albania through active foreign policy and participation in global forums.\n* Cultural Promotion: Expanded emphasis on the arts, national symbolism, and public design as elements of governance.\n* Administrative Reforms: Implementation of digital governance and judicial reforms aimed at improving institutional efficiency.\n* Political Stability: Consistent leadership has enabled long-term planning and reduced political volatility.\nCriticisms\nRamism has also been subject to criticism, particularly from opposition parties, civil society, and independent observers:\n* Centralization of Power: The executive branch is seen as overly dominant, weakening institutional checks and balances.\n* Personality-Centered Governance: Rama's leadership style has been described as overly personalized, raising concerns about a potential cult of personality.\n* Limited Media Freedom: Allegations of government pressure on independent media and shrinking space for dissent have been raised by watchdog organizations.\n* Social Inequality: Critics argue that urban development projects often prioritize aesthetics and elites over the needs of marginalized communities.\n* Full Administrative Control & Political Pressure: Critics argue that Ramism promotes excessive control over the public administration, reducing its neutrality and turning institutions into political instruments. This has allegedly led to politically motivated dismissals and promotions within public offices.\n* Conflict with Political Opponents & Judicial Consequences: There have been consistent tensions between the government and opposition figures, with accusations that judicial proceedings against political rivals are used as tools of political repression. Several prominent opponents have faced legal charges or imprisonment, raising concerns over selective justice like Recep Tayyip Erdoğan.\n* Neglect of Rural Areas: Some contend that development efforts are concentrated in urban centers, leading to uneven national growth.\nSlogan and symbolism\nRamism is often associated with slogans emphasizing vision, strength, and artistic governance. Common unofficial slogans include:\n* \"Lead with Vision. Build with Beauty. Govern with Strength.\"\n* \"Reform through Vision. Lead through Art.\"\nWhile Ramism is not a formal political party or registered ideology, it is deeply associated with the Socialist Party of Albania under Rama's leadership.\nReferences"
    }
  ]
}