{
  "content": [
    {
      "type": "text",
      "text": "# Draft:King Street Sounds\n\nKing Street Sounds\nKing Street Sounds (sometimes called King Street Records) is an American independent record label founded in 1993 by Hisa Ishioka in New York City. It is widely regarded as one of the most influential and enduring labels in soulful and deep house music, known for its aesthetic lineage to the iconic Paradise Garage..\nHistory\nThe label’s beginnings are directly tied to the legacy of the Paradise Garage, which was located at 84 King Street —a spiritual home for the early house movement. The label has long described itself as the heir to that soulful tradition, which influenced both its name and musical ethos.\nOver its more than three-decade history, King Street Sounds has released records by legendary house artists such as Kerri Chandler, Dennis Ferrer, Ultra Naté, Mood II Swing, Blaze, and Barbara Tucker.\nIn late 2024, Armada Music and Beatport released *House Music Royalty: The Story of King Street Sounds*, a 35-minute documentary chronicling the label’s rise—from its underground roots to its global influence—highlighting its catalog and featuring interviews with prominent house artists.\nNotable Artists and Releases\nA small selection of significant contributors and releases:\n* Kerri Chandler – early acclaimed tracks under the label’s soulful umbrella.\n* Dennis Ferrer – his debut album *The World as I See It* was released on King Street in 2006 and remains a deep-house milestone.\n* Blaze feat. Barbara Tucker – the anthem Most Precious Love, a #1 hit on U.S. dance charts, exemplifies the label’s impact\nInfluence and Legacy\nKing Street Sounds is celebrated for maintaining soulful-spiritual house values and pushing them into modern contexts. Its catalog bridges legendary NY styles with evolving global house music, contributing to both underground and mainstream growth of the genre.\nSee also\n* Paradise Garage\n* House music\n* List of record labels\nExternal links\n*\n*\n:Category:Record labels established in 1993\n:Category:American independent record labels\n:Category:House music record labels\n:Category:Companies based in New York City"
    }
  ]
}