{
  "content": [
    {
      "type": "text",
      "text": "# Draft:Virtuoso (virtual reality software)\n\n| genre      = Music creation sandbox\n}}\nVirtuoso is a virtual reality music creation sandbox application developed by Swedish studio Really Interactive AB and published by Fast Travel Games. It was released on 10 March 2022 for Meta Quest, Oculus Rift, and SteamVR platforms. The application allows users to create and perform music using virtual instruments designed specifically for VR.\nGameplay and features\nVirtuoso provides users with a virtual stage environment where they can arrange and play VR-specific musical instruments. The application includes a looper tool for recording and layering musical passages in real time, a virtual microphone for vocal input, and synchronisation features such as tempo sync and preset musical scales to assist users without formal musical training.\nAccording to the official website, the software includes seven instruments: Oorgan (a three-dimensional keyboard), Board, Wharp, Wavemin, Empads (configurable drum pads), Clustr and Rimba. However, press materials and reviews have inconsistently reported six instruments, omitting Rimba from the list.\nUsers can position instruments within the virtual space, record performances using a \"Tape Recorder\" function, and export audio files in .wav or .midi formats. The application features a community library where users can share their creations, with the licensing condition that uploading grants other users non-exclusive rights to use and remix the content.\nDevelopment and release\nVirtuoso was developed by Really Interactive AB, a Stockholm-based studio founded in 2016 that focuses on VR, AR, and mobile productions. The project originated as a hobby project by Jonatan Crafoord, who had previously worked as an audio director and sound designer on game franchises including Angry Birds, LittleBigPlanet, and Minecraft. In 2020, Crafoord demonstrated the project to other members of Really Interactive, leading to full development.\nFast Travel Games, which had previously developed VR titles such as Apex Construct and Wraith: The Oblivion – Afterlife, published the application as the first third-party title through its publishing division launched in September 2021.\nThe application was announced on 17 February 2022, with a release date set for 10 March 2022. A trailer featured a track recreated in-game by Scandinavian dance music duo Tungevaag & Rabaan.\nMarketing materials have referred to Virtuoso as a \"game,\" though multiple sources, including Road to VR, note that it lacks objectives, scoring, or competitive mechanics typical of games and functions primarily as a creative tool.\nReception\nReview coverage at launch was limited to specialised VR publications. Road to VR published a review on 10 March 2022, awarding the application 8.5/10 and noting that while it successfully filled a gap in VR music production tools, users \"cannot expect to be making tracks without some practice and perseverance.\" The review praised the audio quality and instrument design but observed that instruments could feel \"imprecise when playing\" due to VR's lack of physical resistance.\nUploadVR reported on the application at launch, describing it as \"a fantastic VR tool for casual music makers\" and confirming that creators retain ownership of their music while community library uploads grant other players non-exclusive usage rights. The publication noted it would examine the learning curve for users with and without prior music experience, though follow-up analysis appears not to have been published as of available search results.\nThe VR Realm published a review on 10 March 2022, finding that the application \"has finally given the VR medium a solid music production game\" but cautioning that \"some casuals might be put off by the learning curve.\" The reviewer noted that over several hours of use, they had \"yet to create an output that I really feel is ready to share,\" highlighting the application's learning curve.\nAs of November 2025, no aggregated review scores are available from major review aggregators such as Metacritic. The Steam version maintains a \"Mostly Positive\" rating based on user reviews, with 77% of 83 user reviews being positive.\nTechnical specifications\nThe application supports Meta Quest, Oculus Rift, and SteamVR-compatible headsets. It includes integration with the LIV mixed reality capture platform on PC and offers a spectator camera mode for streaming. A Remote Control API allows connection to external music programs via MIDI support over network.\nReferences\nExternal links\n*\n* [https://www.really-interactive.se/ Really Interactive AB official website]\n:Category:2022 software\n:Category:Music software\n:Category:Meta Quest games\n:Category:Oculus Rift games\n:Category:Fast Travel Games games\n:Category:Virtual reality games"
    }
  ]
}