{
  "content": [
    {
      "type": "text",
      "text": "# Draft:Battle of Kabul (1995)\n\n----\n----\n| combatant2        = Taliban\n| commander1        =  Ahmad Shah Massoud\n| commander2        = Muhammad OmarMullah Borjan\n| strength1         = Unknown\n| strength2         = Unknown\n| casualties1       = Minor damages\n| casualties2       = Heavy\n}}\nBattle of Kabul was a battle between the Islamic State of Afghanistan and the Taliban that took place in 1995 in the Kabul which was a decisive victory for the government forces and a heavy defeat for the Taliban. After capturing Gulbuddin Hekmatyar's territory and by deposing of the Hezbe Wahdat, on 11 March the Taliban launched a massive campaign to capture Kabul. The war started in the south and west of Kabul between the Taliban and the government forces. This was the first time the Taliban faced the forces of Ahmad Shah Massoud, and the former suffered heavy losses and retreated to Logar.\nBackground\nOn February 2, 1995, the Taliban captured Wardak, located 50 kilometers south of Kabul. For the first time, Hekmatyar's bases around the capital were threatened. On the other hand, the Taliban were advancing fast. On February 10, 1995, after fierce clashes that left 200 dead, Taliban captured Maidan Shahr and then, Mohammad Agha District on the following day. Hekmatyar realized that he was caught between the government forces in the north and the Taliban in the south. The morale of his forces was rapidly decreasing. On February 14, 1995, Hekmatyar's headquarters in Char Asiab District was captured by the Taliban. His forces, who were very scared, fled to the east towards Jalalabad. The government army, under the command of Ahmad Shah Masoud, retreated into the city of Kabul. In March 1995, the Taliban had captured almost one-third of the Afghanistan; they had defeated Hezbe Wahdat and killed their leader Abdul Ali Mazari.\nThe Battle\nOn 6 March, Ahmad Shah Massoud marched against the Hazaras and driving them out of the Kabul. In desperation the Hazaras made a deal with the Taliban yielding their heavy weapons and positions to the Taliban. In the meantime Ahmad Shah Massoud was not going allow the Taliban to replace the Hazaras in southern Kabul. Ahmad Shah Massoud advised the Taliban to exercise restraint and avoid conflict. He persistently attempted to convince them to accept a political solution to the country’s crisis and to prevent any war between his forces and the Taliban. However, his efforts were unsuccessful, as the Taliban were unwilling to accept anything less than the disarmament of government forces and the capture of Kabul.\nEventually, war broke out between government forces and the Taliban in the western and southern parts of Kabul. This was the first battle between the Taliban and Ahmad Shah Massoud’s forces in the capital. The Taliban suffered heavy casualties, while government forces managed to recapture several areas in western Kabul after two days of intense fighting.\nThe Taliban retreated to Rish Khor camp military base and the surrounding hills but responded by ruthlessly shelling Kabul with rockets, leading to the deaths and injuries of dozens of civilians. They continued to resist for several days in Rish Khor camp and Chahar Asiab, but after a series of continuous and large-scale government operations, the Taliban were defeated and withdrew to Mohammad Agha District in Logar Province.\nIn Mohammad Agha District, the Taliban established a defensive line to prevent government forces from advancing. However, in the following days, they launched a renewed offensive towards Kabul from the direction of Maidan Shahr. Their advance was halted at Argandai Pass and the surrounding areas due to government counterattacks, forcing the Taliban to retreat to Maidan Shahr.\nAs a result, Kabul was secured from Taliban artillery shelling from both the western and southern directions."
    }
  ]
}