{
  "content": [
    {
      "type": "text",
      "text": "# Draft:Stanley the Talking Fish\n\nStanley the Talking Fish\nAs his name suggests, Stanley is a talking fish, and talking is something he's very good at. Because of this habit, most of everyone he knows find him very annoying. He usually talks about his love life, as he is often insecure with it.\nStanley made his presence known in the first Nintendo Comics System story ever written, \"The Fish That Should've Gotten Away\". In this relatively short story, he follows Mario through a field of various enemies, needing advice about his relationship with Barbara the Bush.\nStanley's next appearance was in \"Love Flounders\", where now he's dating Smookers, a pink Jelectro (an enemy seen in Super Mario Bros. 3). In this story, he sets up Mario, who's trying to fetch the rare Chuckberries for Princess Toadstool's breakfast cereal, with his (Stanley's) former girlfriend, a Boss Bass named Bertha. Since Mario is wearing a Frog Suit, Bertha believes him to be an actual frog and pursues him romantically. Mario manages to find the Chuckberries he's looking for, but then Bertha catches him, only to find out he's not really a frog. Bertha is quite saddened by this, but Mario offers to make it up to her by giving her the Chuckberries and telling her that they should have lunch sometime. In the meantime, Mario requests that Bertha hurt Stanley a lot. Meanwhile, Smookers ends up breaking up with Stanley. Ironically, the storyline with Mario and Bertha was somewhat mirrored in the Super Mario Bros. movie.\nStanley's third (and last) appearance was \"Fins and Roses\", in which he finds Wendy O. Koopa waiting with an arsenal of weapons to use against Mario. Being the flirt that he is, Stanley hits on Wendy and snatches a bomb from her, thinking it's a gift. He makes a few attempts to impress Wendy, during which Bertha continually boots Wendy back up to the surface. Finally, Stanley interferes with Wendy's attempt at shooting Mario with her missile launcher just to ask her what her name is so they could get married, which results in Wendy becoming so angry with Stanley that she shoots at him instead. The missile follows Stanley underwater and hits both him and Bertha. Bertha responds to this by booting up the bomb Stanley snagged earlier. It blows up right in front of Wendy, but Mario takes sympathy on her, considering she had to deal with Stanley as well."
    }
  ]
}