{
  "content": [
    {
      "type": "text",
      "text": "# Draft:Battle of Julfa (1941)\n\n----\n| territory   = Julfa is captured by the Red Army.\n| result      = Soviet victory\n| status      =\n| combatant1  = Pahlavi dynasty\n| combatant2  =  Soviet Union\n| commander1  =  Reza Shah Musib Mohammadi Syed Hashemi  Abdullah Shahriari\n| commander2  =  Joseph Stalin\n| strength1   = 3 soldiers\n| strength2   = +1,000 soldiers\n| units1      = Unknown\n| units2      =  47th Tank Division\n| casualties1 = 3 killed\n| casualties2 = +40 killed\n| campaignbox =\n}}\nOn 26 August, 1941, with the beginning of the Anglo-Soviet invasion, three Persian border guards named \"Sergeant Major Musib Malek Mohammadi\", \"Syed Mohammad Rathi Hashemi\", and \"Abdullah Shahriari\" with a large number of Soviet troops voluntarily resisted the invading forces on the Jolfa Iron Bridge and defended their homeland. At 4 o'clock in the morning on the third day of Shahrivar, 1320 AH, Sergeant Malek Mohammadi was informed at the Jolfa border post in East Azarbaijan that a huge army of the Soviet Red Army was coming towards the border and was planning to cross the \"Iron Bridge\" and enter the country. The corporal relays the news to Tabriz and from there to Tehran. The order comes from the capital to evacuate the barracks and allow the Soviet army to enter without any resistance. The bold corporal addresses his soldiers: \"Everyone wants to come back. I will stay here. I want to defend the country against foreigners.\" Corporal Moseib Malek Mohammadi along with soldier Abdullah Shahriari, Seyyed Mohammad Rathi Hashemi and another soldier take the oath and remain.When the first Soviet personnel carrier is about to cross the iron bridge, Shahriari's soldier shoots at the driver and kills the Russian soldier. A heavy conflict breaks out between the fully armed forces of the Soviet Army and the corporal and his 3 soldiers. Finally, Corporal Mohammadi along with his two other soldiers, Abdullah Shahriari and Seyyed Mohammad Rai Hashemi, were killed under heavy artillery fire of the Soviet 47th Division. The fourth person had gone to Tabriz to convey the news of the arrival of the 47th Division by order of Corporal Malek Mohammadi an hour before his three comrades were killed."
    }
  ]
}