{
  "content": [
    {
      "type": "text",
      "text": "# Draft:Battle at Pasjane\n\nTo secure the achievements made after the battle at Drenovo, it was necessary to provide the exhausted and thinned Serbian companies with new personnel as soon as possible. Therefore, the Central Board planned the return to the field of Duke Dušan Vardarski with 15 Chetniks. In addition, four officers were also planned for the formation of the Mountain Staff, including the new chief, Captain Dragoljub Nikolić and his deputy, Lieutenant Dušan Sekulić (who later declined), as well as all available non-commissioned officers.\nParallel to the equipping of the company, there was a \"discussion\" about the choice of a channel for crossing the border. The vice-consul in Priština at the time was Milan Rakić, and the head of the Consular Department, his boss Dr. Miroslav Spalajković. They argued over the issue of border crossing. Fearing Arnauti reprisals against Serbian civilians, Rakić advocated crossing over the Kaza of Kumanovo and the Vardar, while Spalajković insisted on crossing over Kosovo by land and under arms. He justified his position by the facts that the Kumanovo canal had been breached and that the Serbian companies, which were being transferred through it, after a clash with the Turkish army in the immediate vicinity of the border, were forced to return to friendly Serbian territories, while the canal through Gnjilane proved safe. Milan Rakić had to accept his boss's position and invited teacher Stojan Dajić to organize the crossing.\nIn addition to this conflict, there were frequent misunderstandings between the Central Board and the Executive Board. Dissatisfied with this, as well as due to the Central Board's incompetence in the situation, the Supreme Board decided to ban the work of this Board, and to give the Executive Board exclusive responsibility for technical and operational tasks. Following this decision, the Central Board suspended its work on 4 July 1907, during the most intensive preparations for the company's crossing.\nAccording to Stojan Dajić's plan, which the Executive Board accepted, the company was to cross the border on Saturday, 13 July 1907. In the evening, crossed the Border. The first day at the Ranilug church, from where, with guides Jovan Marković-Gudžur from Pasjane and Vasa Tomkić (from Pančevo), he arrived at dawn on 15 July 1907 at the Pasjane church, designated for the second day. Tomkić's task was to transport rifles to Vitina for the Skopje Committee. As a reward for this, he was promised a revolver.\nAround noon, a woman was intoxicated in the church. The Chetniks were hidden in the altar at the time, so there is a suspicion that they were noticed and denounced by Arnauts and someone who attended the funeral. According to other testimonies, the Serbian company was noticed earlier on by Arnaut villagers while crossing the South Morava and reported to the authorities. The sent guards found a pile of Serbian tobacco and a trail that led them to the Ranilug church. The authorities were informed about this, and they sent for the Turkish army and also hired Bashi-bazouks among the Arnauts to destroy the company.\nBattle\n]]\nAround 4 p.m., the Ranilug church was surrounded by Turkish army and the Arnaut bashi-bazouks. There were about 5,000 of them, while according to a more likely estimate by Vasa Tomkić, there were about 2,000. Soon, fire was set in the church. The Chetniks fought their way to a nearby cemetery and cornfield, where they fought until dusk, after which they split into three groups. One group remained in the shelter, the largest set off without a guide towards Skopska Crna Gora in the wrong direction between the Albanian villages of Ljupiste and Đerekara, and the third group attempted a breakthrough through Preševo. All three groups were destroyed over the next two days.\nDuring the three-day battle, Captain Dragoljub Nikolić, Duke Rade Radivojević-Dušan Vardarski, Second Lieutenants Mihailo Bošković and Živan Milosavljević, guide Jovan Marković, Sergeant Tihomir Golubović, Sergeant Ivan Ivanović, Raško Anastasijević and Milutin Janković were killed along with Chetniks Stamenko Stanisic, Bogosav Sreckovic, Danilo Smiljkovic, Bogdan Kostic, Bogdan Racic, Milan Soldovic, Josif Stankovic, Djordje Marinkovic, Mladen Vasiljevic, Nikola Jovkovic, Stojan Bogojevic, Nedeljko Purkovic, Bogdan Paunovic, Milutin Cvetanovic, Krsta Dimitrijevic, Janko Naslas, Stevan Ristic, Dragomir Bogojevic, Djordje Vukovic, Jeremija Djurlic and Milutin Jokovic. Only three Chetniks, Sergeant Dragomir Dimitrijevic, Milutin Radomirovic, and Radomir Soldatovic, were captured, and the only one who managed to escape was Vasa Tomkic. All the Chetniks who died fought bravely, according to Toma Popovic; no ammunition was found on any of them. According to eyewitness accounts, 25 Serbian peasants and about 70 soldiers and Arnauts were killed, and a large number of them were wounded. The Pasjan serf Zafir Jancić was also killed, and several Serbs were wounded and beaten. Among the numerous Serbs arrested, in addition to the three Chetniks, were the teacher Ilija Popović, the priest Todor Popović, the churchwarden Kena, and the theologian Đorđe Perić (all from Pasjan). The Ranilug parish priest, Đorđe Dajić, and Stojan Dajić were also arrested.\nEpilogue\nThe involvement of teacher Ilija Popović was revealed to the authorities in Gnjilane, by his own admission, by Radomir Soldatović, while Stojan Dajić was reported by baker Đoka Panaški. He was suspicious of the unusually large quantity of bread that Dajić had ordered.\nRadomir Soldatović recanted his testimony, given in Gnjilane, at the court in Skopje, where all three Chetniks were sentenced to death by hanging. They were pardoned and released on 29 July 1908, six days after the publication of Hurriyet.\nAfter hearings in the Executive Board, they were released, and Chetnik Milutin Radomirović received a recommendation for service from the board.\nThis event, which was called the \"Pasjan Affair\" in the \"Serbian Defense\", left some questions unresolved: how the company was discovered and who, besides the arrested Soldatović, denounced the Serbs to the Turkish authorities. The course of events, after the Chetniks' death, gave the right to Vice-Consul Milan Rakić, because it turned out that the choice of the channel through [[Kosovo] led to fierce Albanian reprisals against the Serbian population. The unprecedented reprisals lasted continuously for over a month and were carried out by beatings, arson, looting, and murders of prominent Serbs.\nThis was the last major battle of the Chetniks with the Turkish army and the Arnauts until the clashes near Stracin and Šumata Trnica in 1912, before the beginning of the First Balkan War.\nReferences\n* Translated from Serbian Wikipedia: https://sr.wikipedia.org/wiki/%D0%91%D0%BE%D1%80%D0%B1%D0%B0_%D0%BA%D0%BE%D0%B4_%D0%9F%D0%B0%D1%81%D1%98%D0%B0%D0%BD%D0%B5"
    }
  ]
}