{
  "content": [
    {
      "type": "text",
      "text": "# Draft:Peter Edwards\n\nPeter Edwards\n(born August 1963) is a British academic and computer scientist. On 13 October 2025, it was announced that Edwards would assume the role of Principal and Vice-Chancellor of the University of Aberdeen from 1 November 2025. Edwards joined the University in 1988 as a Postdoctoral Research Fellow and has spent his entire academic career at Aberdeen.\nEarly life and education\nBorn in Wrexham in August 1963, Edwards attended St Giles Primary School, Ysgol Bryn Offa, and Yale Sixth Form College before leaving North Wales to pursue higher education. He earned an undergraduate degree in Chemistry from Liverpool Polytechnic, followed by a PhD in Computational Chemistry at the University of Leeds. His doctoral thesis, A Cooperative Expert System for Spectra Interpretation, reflected an early interest in the intersection of artificial intelligence and scientific analysis.\nCareer\nWhile at the University of Leeds, Edwards was part of the Leeds Artificial Intelligence Research (LAIR) community — an experience that shaped his academic trajectory and led him to join the Department of Computing Science at the University of Aberdeen as a postdoctoral researcher in 1988.\nOver the following decades, he has held a range of senior academic and leadership roles, including Head of Computing Science, Head of the College of Physical Sciences Graduate School, Director of the Northern Research Partnership Graduate School (a collaboration among the Universities of Aberdeen, Dundee, and Robert Gordon), Head of the School of Natural and Computing Sciences, Vice-Principal for Regional Engagement, and Acting Senior Vice-Principal.\nEdwards’ research focuses on the design of intelligent information infrastructures that promote transparency and accountability in computational systems. His work has been highly interdisciplinary, involving collaborations across fields including Medicine, Law, Geography, Transport Studies, Food Science, and Design. He has served as Principal Investigator on several major UK Research Council grants, including the eSocial Science Research Node PolicyGrid (ESRC, 2006–2012).  and the UK Digital Economy Research Hub dot.rural (EPSRC, 2009–2015). The latter focused on user-led digital innovation in rural communities and, during its lifetime, established more than 100 partnerships with public, private, and third-sector organisations, produced over 300 publications, and delivered more than 50 software and technical outputs\nPublications (selected)\n* “Using Knowledge Graphs to Unlock Practical Collection, Integration, and Audit of AI Accountability Information”. Naja, I., Markovic, M., Edwards, P., Pang, W., Cottrill, C. and Williams, R.  IEEE Access, 2022, 10: 74383 - 74411.\n* \"A Semantic Framework to Support AI System Accountability and Audit”. Naja, I., Markovic, M., Edwards, P. and Cottrill, C. The Semantic Web - ESWC 2021, Lecture Notes in Computer Science, Springer, 2021, 12731: 160-176.\n* \"Governance and Accountability in Internet of Things (IoT) Networks”. Jacobs, N., Edwards, P., Cottrill, C. and Salt, K. The Oxford Handbook of Digital Technology and Society . Yates, S. J. and Rice, R. E. (Eds.), Oxford Academic, 2020, 628-655.\n* \"Semantic Modelling of Plans and Execution Traces for Enhancing Transparency of IoT Systems”. Markovic, M., Garijo, D., Edwards, P. and Vasconcelos, W. Proceedings of the 6th IEEE International Conference on Internet of Things: Systems, Management and Security , IEEE Explore, 2019, 110-115.\n* \"Linking Open Data and the Crowd for Real-time Passenger Information”. Corsar, D., Edwards, P., Nelson, J., Baillie, C., Papangelis, K. and Velaga, N. Journal of Web Semantics, 2017, 43:18–24.\n* \"An Access Control Model for Protecting Provenance Graphs”. Chen, L., Edwards, P., Nelson, J. D. and Norman, T. J. Proceedings of the 13th Annual Conference on Privacy, Security and Trust (PST), IEEE Press, 2015, 125-132.\n* \"The Transport Disruption Ontology”. Corsar, D., Markovic, M., Edwards, P. and Nelson, J. D. The Semantic Web - ISWC 2015, Proceedings of the 14th International Semantic Web Conference, Lecture Notes in Computer Science, Springer, 2015, 9367:329-336.\n* \"TRAAC: Trust and Risk Aware Access Control”. Burnett, C., Chen, L., Edwards, P. and Norman, T. J. F. Proceedings of the 12th Annual International Conference on Privacy, Security and Trust (PST), IEEE Press, 2014, 371-378.\n* \"ourSpaces – Design and Deployment of a Semantic Virtual Research Environment”. Edwards, P., Pignotti, E., Eckhardt, A., Ponnamperuma Arachchi, K. A., Mellish, C. S. and Bouttaz, T. The Semantic Web – ISWC 2012, Proceedings of the 11th International Semantic Web Conference, Lecture Notes in Computer Science, Springer, 2012, 7650 2: 50-65.\n* \"Enhancing Workflow with a Semantic Description of Scientific Intent”. Pignotti, E., Edwards, P., Gotts, N. and Polhill, G. Journal of Web Semantics, 2011, 9(2): 222-244.\nPrincipal and Vice-Chancellor\nOn 13 October 2025, it was announced that Edwards would assume the role of Principal and Vice-Chancellor of the University of Aberdeen from 1 November 2025. He will be the University’s 15th Principal since the position was established following the 1860 amalgamation of Aberdeen’s two ancient universities: King’s College (founded 1495) and Marischal College (founded 1593).\nReferences\n:Category:Living people\n:Category:Academics of the University of Aberdeen\n:Category:Alumni of the University of Leeds\n:Category:Alumni of Liverpool John Moores University\n:Category:People from Wrexham"
    }
  ]
}