{
  "content": [
    {
      "type": "text",
      "text": "# Draft:Untitled Dave Filoni Star Wars film\n\n| italic_title   = no\n| image          =\n| alt            =\n| caption        =\n| director       = Dave Filoni\n| screenplay     = Dave Filoni\n| story          =\n| based_on       =\n| producer       = Kathleen Kennedy\n| starring       =\n| cinematography =\n| editing        =\n| music          =\n| studio         = Lucasfilm\n| distributor    = Walt Disney StudiosMotion Pictures\n| released       =\n| runtime        =\n| country        = United States\n| language       = English\n| budget         =\n| gross          =\n}}\nAn upcoming American space opera film is being written and directed by Dave Filoni. Produced by Lucasfilm and distributed by Walt Disney Studios Motion Pictures, it is part of the Star Wars franchise and serves as a culmination of the Disney+ television series The Mandalorian and its spin-offs.\nLucasfilm expanded the Star Wars universe to live-action television with The Mandalorian in November 2019, followed by spin-off series The Book of Boba Fett, Ahsoka, and Skeleton Crew. A film from Filoni that serves as the culmination of those stories was announced in April 2023. It is set to be made after the second season of Ahsoka.\nPremise\nThe film is set after Return of the Jedi (1983) and serves as a culmination of the interconnected narrative of the television series The Mandalorian and its spin-off series.\nProduction\nBackground\nDirector Jon Favreau had pitched an idea for a Star Wars television series featuring Mandalorians to Lucasfilm president Kathleen Kennedy in 2017. Dave Filoni, executive producer on the animated series Star Wars: The Clone Wars (2008–2020) and Star Wars Rebels (2014–2018), was also conceiving a Mandalorian-focused series and Kennedy suggested they work together. This led to the creation of The Mandalorian, the first live-action Star Wars television series, which debuted with the launch of the streaming service Disney+ in November 2019. Shortly after the premiere, Walt Disney Studios CCO Alan Horn said a film featuring the Mandalorian could be developed if the series was a success. The next month, Favreau said there was an opportunity to explore the series' characters in Star Wars films or spin-off television series, and Disney CEO Bob Iger reiterated in February 2020 that spin-offs of The Mandalorian were being considered. That October, Favreau and star Pedro Pascal said they were open to the Mandalorian appearing in a Star Wars film, but Favreau was in no rush to do this.\nIn December 2020, the spin-off series Rangers of the New Republic, Ahsoka, and The Book of Boba Fett were announced. All three series were being developed by Favreau and Filoni, and were set within The Mandalorian timeframe. They planned to have the series culminate in a \"climactic story event\". There were reports that Rangers of the New Republic would star Gina Carano, reprising her guest role from The Mandalorian, before she was fired by Lucasfilm for social media posts that Disney said did not align with the company's values. Kennedy suggested in November 2021 that the series would not be moving forward. A new series, Skeleton Crew, was announced in May 2022 from Jon Watts and Christopher Ford. Favreau and Filoni were serving as executive producers on the series, which is also set in the timeframe of The Mandalorian.\nFavreau discussed the spin-offs in August 2022, explaining that the timeframe in which The Mandalorian, The Book of Boba Fett, Ahsoka, and Skeleton Crew are all set—during the 30 years between Return of the Jedi (1983) and Star Wars: The Force Awakens (2015)—has \"a lot of room for us to tell stories, and there are a lot of characters that are in play because we know who's around at that time\". He added that they were using The Mandalorian to remind fans of these characters or introduce them to unfamiliar audiences before they appeared in their own spin-off series, which helped to create interconnected stories and characters within a \"very rich fabric for us to explore\". The third season of The Mandalorian, which premiered in March 2023, was described by The Mandalorian director and executive producer Rick Famuyiwa as a conclusion to the first chapter of these stories. He said it resolves plot lines established in the first three seasons of The Mandalorian as well as The Book of Boba Fett, while also planting seeds as to where the connected storyline was heading in future seasons.\nDevelopment\nAt Star Wars Celebration London in April 2023, Filoni was announced to be writing and directing a feature film that would serve as a culmination of the interconnected stories of The Mandalorian, The Book of Boba Fett, Ahsoka, and Skeleton Crew. Kennedy hesitated to describe the film as \"a big Avengers-style] meetup\" between characters of the live-action series, and said Filoni was incorporating elements from The Clone Wars and Rebels. Filoni said the film's story would \"emerge\" from the various storylines that had been built up in the live-action series, as well as the epilogue to Rebels and relevant material from the old Star Wars Expanded Universe which Filoni had grown-up on. Favreau, who was working on the film with Filoni, echoed the notion that former Expanded Universe material could be incorporated into the film. Filoni said he had been laying the groundwork for future stories in all of his Star Wars series. He believed that Star Wars films have to feature a \"monumental moment\" in the universe compared to the television series, which tell smaller stories around those moments.\nAhsoka premiered in August 2023, and serves in-part as a sequel to Rebels, expanding on the epilogue of that series and building up to a conflict with the villain Grand Admiral Thrawn. That character was first introduced in the Expanded Universe novel Heir to the Empire (1991) and Ahsoka references that title, suggesting to various commentators that Filoni's film could be an adaptation of the novel. In November 2023, Filoni revealed that he was now chief creative officer at Lucasfilm and would be directly involved in the planning of future films and series. He said Ahsoka was setting up a larger conflict with the remnants of the Galactic Empire for his film.\nLucasfilm announced in January 2024 that Favreau was directing another spin-off film, The Mandalorian and Grogu (2026), after reconsidering plans for a fourth season of The Mandalorian. It was unclear if that fourth season would still be made or if future Mandalorian stories would instead be told through film sequels, but this change was not expected to impact Filoni's film which was now planned to be made after a second season of Ahsoka. Writing for the second season of Ahsoka in mid-2024 allowed ideas for the film to \"click\" for Filoni, providing him with a better idea of how to craft the story. He had also conceived a version of the film's opening around this time that he was particularly enthused about creating.\n}}\nExternal links\n*  Star Wars }}\n*  Star Wars }}"
    }
  ]
}