{
  "content": [
    {
      "type": "text",
      "text": "# Draft:Butiking pasay__disambig_2\n\nButiking Pasay\nButiking Pasay (The Gecko Man of Pasay) is an upcoming Filipino graphic novel written, illustrated, colored, and designed by Wincy Aquino Ong published by [https://www.komiket.com/ Komiket]. The title debuts with a 32-page full-color prologue, Butiking Pasay: Rooftop Boogie, at the Philippine International Comics Festival (PICOF) on July 5–6, 2025. A complete graphic novel exceeding 200 pages is slated for release in 2026.\nPublication history\nButiking Pasay originated in Komiket and PICOF’s Creator’s Lab Batch 5. Ong handles all aspects—writing, illustrating, lettering, coloring, and design—maintaining full creative control.\nThe prologue, Rooftop Boogie, marks the title’s print debut at the PICOF 2025 expo in SM Megamall's Megatrade Hall Building B on July 5–6. The exhibition will feature:\n* A motion-comic screening scheduled for July 5 at 2 PM\n* Limited-edition postcards showcasing art by Ian Sta. Maria, Elbert Or, Ardie Aquino, and Brian Balondo\n* A prototype action-figure auction by Super Pixels Studio, with pre-orders available at the booth\nReaders can expect the full-length graphic novel in 2026, expanding on the first chapter’s setting, characters, and lore.\nPremise and plot\nSet in 1980s Pasay, Manila, the narrative follows an urban-legend–style vigilante—a gecko-like figure nicknamed “Butiking Pasay”—who dons a Metro Aide uniform and wields a sentient backscratcher.\nThis project is described by Ong as:“Definitely not your typical superhero comic … a strange beast—equal parts PETA stage play, acrobatics show, body horror, and healing fiction … a graphic novel with theater bones and tabloid blood”. Butiking Pasay explores the underbelly of urban life, drawing on Pasay’s Locsin-era architecture, street culture, and socio-political undercurrents.\nPowers and themes\nButiking Pasay’s abilities blend animalistic traits with theatrics and grotesque twists:\n* Wall-crawling and prehensile tail\n* Secretion of fantastical “mood‑shift mucus” that—per in-universe tabloids—can trigger sleep, panic, or intense pleasure\n* Use of unconventional weaponry, such as a sentient backscratcher\nThemes woven into the narrative include:\n* Filipinos’ relationship to urban decay and nostalgia for 1980s Manila\n* A playful subversion of superhero conventions, favoring psychological and visceral elements over classic heroism\n* Homage to Manila’s Brutalist architecture and underground culture\nArt style\nVisually, the comic eschews mainstream manga and Jim Lee–inspired styles in favor of an “ugly-beautiful,” expressionistic aesthetic inspired by works like Æon Flux, The Maxx, and the Brutalist architecture of Manila in the 1980s.  Ong, in a podcast interview, has cited Seth Fisher as a major influence in his illustration work.\nReception\nEarly coverage describes Butiking Pasay as:\n* “Wonderfully strange, quirky, yet totally-Pinoy,” with a distinct identity separate from both mainstream komiks and folklore-inspired titles\n* A “strange beast of a comic” that embraces “body horror” and noir‑style reportage, reflecting Ong’s original pitch\nThough still unreleased, the prologue and promotional materials have received positive buzz from Philippine comic‑culture blogs and media outlets."
    }
  ]
}