{
  "content": [
    {
      "type": "text",
      "text": "# Draft:The Lurking Fear (band)\n\nThe Lurking Fear was a Swedish death metal supergroup, founded in 2016.\nHistory\nThe Lurking Fear was founded in 2016 by vocalist Tomas Lindberg (At the Gates, Skitsystem, Grotesque) and drummer Adrian Erlandsson (The Haunted, Cradle of Filth, Paradise Lost), which were later joined by guitarists Jonas Stålhammar (The Crown, Crippled Black Phoenix) and Fredrik Wallenberg (Skitsystem), as well as bassist Andreas Axelsson (Disfear, Edge of Sanity, Marduk).\nAn eponymous EP was released in 2017 as a 7\" record through Moondawn Records, serving as a preview of the debut album Out of the Voiceless Grave, which was released on August 11 of the same year via Century Media Records and entered the Swedish album charts at number 31 for one week. The second album Death, Madness, Horror, Decay was released on November 19, 2021.\nIn a statement on their official Facebook profile on September 18, 2025, the band announced their breakup due to Lindberg's passing two days earlier.\nMusic\nThe band described their music as old-school death metal, citing bands such as Autopsy, Possessed, early Death, early Morbid Angel, and early Slayer, as well as Slaughter, Master/Death Strike, Bathory, and Repulsion as their musical influences.\nAs a distinctive feature, they emphasized the balance between tradition and subtle modernity, which would appeal to fans of both old-school and newer sounds. The lyrical themes revolve around Lovecraftian subjects, thus the band is named after the horror short story of the same name.\nMembers\n*Tomas Lindberg - Vocals (2016–2025, died 2025)\n*Jonas Stålhammar - Guitar (2016–2022)\n*Fredrik Wallenberg - Guitar (2016–2025)\n*Andreas Axelsson - Bass (2016–2025)\n*Adrian Erlandsson - Drums (2016–2025)\nDiscography\n*The Lurking Fear (EP, 2017)\n*Out of the Voiceless Grave (2017)\n*Cosmic Macabre (Single, 2021)\n*Death Reborn (Single, 2021)\n*Death, Madness, Horror, Decay (2021)\nReferences\nExternal links\n*[https://www.facebook.com/thelurkingfearofficial The Lurking Fear] on Facebook\n*[https://www.allmusic.com/artist/the-lurking-fear-mn0003636595 The Lurking Fear] on AllMusic\nReferences"
    }
  ]
}