{
  "content": [
    {
      "type": "text",
      "text": "# Draft:Conquest of Dai by Former Qin\n\nTuoba JinTuoba Shijun\n| strength1         = 300,000+\n| strength2         = 100,000+\n| casualties1       = Unknown\n| casualties2       = Unknown\n}}\nThe Conquest of Dai by Former Qin, also known as the Conquest of Dai by Qin, was a military campaign launched by the Former Qin dynasty against the state of Dai in March to from October to December 376 during the Sixteen Kingdoms period of China. The campaign concluded in the fall of Dai, completing the unification of northern China under the Qin.\nBackground\nThe kingdom of Dai was ruled by the Tuoba clan of Xianbei ethnicity, encompassing a territory that corresponds with modern-day Inner Mongolia. While the Tuoba underwent a degree of sinicization, such as adopting elements of the imperial Chinese-style of government, they also retained much of their tribal steppe culture.\nA recurring enemy to the Tuoba were the Tiefu, a tribe of mixed Xiongnu and Xianbei people that resided in Shuofang Commandery. Their chieftain, Liu Weichen launched several raids onto Dai territory, but were defeated each time. In 376, unable to cope with the growing Dai power, Weichen requested for aid from his suzerain, the Di-led Former Qin dynasty. At the time, the Qin was on a venture to unify the whole of China, and had recently conquered the Former Yan, Chouchi and Former Liang. Looking to add the Dai to their territory, the Heavenly King of Qin, Fu Jian, accepted Weichen's request.\nThe campaign\nQin invasion\nFu Jian ordered his cousin, Duke of Xingtang, Fu Luo to lead 100,000 soldiers from You and Ji provinces to invade Dai. Joining him were the Inspector of Bing province, Ju Nan and the generals, Deng Qiang, Zhu Yong, Li Rou (李柔), Zhao Qian (趙遷), Zhang Ci and Guo Qing with an additional 200,000 soldiers to follow him, with Liu Weichen acting as their guide.\nThe supreme chief, Tuoba Shiyiqian sent the Bai (白部) and Dugu tribes to repel the invading Qin forces, without success. He then sent his nephew, the leader of the southern tribe, Liu Kuren with 100,000 cavalry to fight them, but he was greatly routed at Shizi Ranges (石子嶺; in present-day Pingquan, Hebei). Shiyiqian was ill and unable to lead troops himself, so he decided to flee north of the Yin mountains with several of his tribes. However, when he reached there, he found that the local Gaoche people have rebelled and there were very few places for their horses to graze, so he turned back south.\nCivil war in Dai\nIn December, when the Qin army slightly fell back to Junzi Crossing (君子津; in present-day Togtoh County, Inner Mongolia), Shiyiqian decided to return to his capital region in Yunzhong Commandery, where he ordered his sons to oversee the defences. Each night, these sons would busily move their soldiers around to take up their positions.\nWhile the war was happening, Shiyiqian had yet to resolve a succession crisis; when he first ascended the throne in 338, he divided his territory between him and his brother, Tuoba Gu. After Gu died, his son Tuoba Jin was not allowed to inherit his position, causing a rift between Jin and Shiyiqian. Later on, Shiyiqian first heir, Tuoba Shi (拓跋寔) died, followed by Shi's younger brother, Tuoba Han (拓跋翰). Since then, the issue of succession was left up in the air.\nNow faced with the Qin invasion, Tuoba Jin took the opportunity to seize power from his uncle. He sent a messenger Shiyiqian's eldest son of a concubine, Tuoba Shijun, informing him that Shiyiqian will soon be choosing a new crown prince from one of his sons of his main wife, Princess Murong, but before doing so, he plans to have Shijun killed. Jin further stated that the reason why his half-brothers were causing a commotion at night and moving their soldiers to their canopies was because they were getting ready for Shiyiqian's decision. Believing his cousin, Tuoba Shijun set out and swiftly killed all of his younger brothers before assassinating Tuoba Shiyiqian as well.\nThat same night, the concubines and subordinates of the murdered brothers fled to Qin and informed them of the situation in Dai. Zhang Ci and Li Rou hurried with their soldiers to capture Yunzhong. When they arrived, the Dai soldiers scattered and their entire state collapsed.\nAftermath\nAfter the fall of Dai, Fu Jian ordered for Tuoba Shijun and Tuoba Jin to be pulled apart by chariots at the Qin capital, Chang'an for their crimes. The Dai was divided into two between the Yellow River, with Liu Weichen holding the western parts and Liu Kuren controlling the east. However, Weichen was angry that he was given a lower status than Kuren, so he rebelled. Kuren campaigned as Weichen and drove him out to the northwest. For his deeds, Fu Jian awarded the him the rest of Dai's former territories.\nFu Jian allowed the surrendered people of Dai to return to their tribes. He wanted to bring Tuoba Shiqyiqian's grandson, Tuoba Gui over to the capital, but was advised against it and sent him to stay with the Dugu tribe instead. Having subjugated Dai, all of northern China was now under Fu Jian's control, but the Eastern Jin dynasty in the south remained his last obstacle at completing unification. For the next few years, Fu Jian would concentrate his efforts southwards before being decisively defeated at the Battle of Fei River in 383. In the wake of the Qin collapse, Tuoba Gui would rise up and restore the state of Dai in 386, which soon became known as the Northern Wei dynasty.\nReferences\nSources\n*\n*\n*"
    }
  ]
}