{
  "content": [
    {
      "type": "text",
      "text": "# Draft:Battle of Kul-i-Mali\n\nTimurid Empire\n| combatant2 =  Uzbek Khanate\n| commander1 =  Babur\n| commander2 =  Ubaidullah Khan\n| strength1 = 40,000\n| strength2 = 3,000\n| casualties1 = Heavy\n| casualties2 = Unknown\n}}\nThe Battle of Kul-i-Malik marked Babur's defeat against the Uzbeks, ending his final attempt to hold Samarkand.\nBackground\nBabur had seized the city in 1511, supported by Persia's Shah Ismail, a Shiite ruler. His alliance required adopting Shia customs, alienating Samarkand’s Sunni population and eroding local support. The Uzbeks, recovering after Shaybani Khan death, invaded Babur's territories. Despite initial resistance, Babur’s forces were overwhelmed, and he retreated to Bokhara, then Samarkand, before abandoning it entirely. Fleeing to Hisar, Babur sought Persian support, but their subsequent defeat at the Battle of Ghazdewan which forced him to return to his Afghan kingdom.\nUzbek Offensive\nAfter their defeat in 1511, the Uzbek sultans regained confidence. Babur, lacking support in Samarkand and having sent away his Persian troops, faced a new threat as the Uzbeks gathered forces. One Uzbek army advanced toward Tashkent, while another, led by Ubaid Khan, moved toward Bokhara to reclaim territory.\nAftermath\nThe defeat at Kul-i-Malik marked a decisive turning point in Babur’s campaign to hold Samarkand. After the battle, Babur's weakened forces were unable to maintain control over the city, and he was forced to retreat to Hisar. Despite receiving brief support from Safavid Iran, Babur’s situation worsened after the defeat of Persian reinforcements at Gijduvon. Unable to sustain his position, Babur ultimately abandoned his ancestral home of Samarkand for the third and final time. His retreat back to his Afghan kingdom signaled the end of his efforts to reclaim Central Asia, redirecting his focus toward consolidating power in the Indian subcontinent.\nReferences"
    }
  ]
}