{
  "content": [
    {
      "type": "text",
      "text": "# Draft:Armor Wars (film)\n\n| producer       = Kevin Feige\n| starring       =\n| cinematography =\n| editing        =\n| music          =\n| studio         = Marvel Studios\n| distributor    = Walt Disney StudiosMotion Pictures\n| released       =\n| runtime        =\n| country        = United States\n| language       = English\n| budget         =\n| gross          =\n}}\nArmor Wars is an upcoming American superhero film based on the 1987–88 Marvel Comics storyline of the same name. Produced by Marvel Studios and distributed by Walt Disney Studios Motion Pictures, it is intended to be part of the Marvel Cinematic Universe (MCU). The film is being written by Yassir Lester and stars Don Cheadle as James Rhodes / War Machine, alongside Walton Goggins and Dominique Thorne.\nMarvel was developing a War Machine film by January 2011 with Joe Robert Cole hired to write a script, but it did not come to fruition. Armor Wars, along with Cheadle's involvement, was originally announced in December 2020 as an MCU television series for Disney+, with Lester joining the series as head writer in August 2021. In September 2022, Marvel Studios decided to rework the series into a feature film, with Cheadle and Lester still attached. Work on the project slowed down by 2025, when filming had been expected to begin.\nPremise\nJames Rhodes must confront one of Tony Stark's greatest fears when Stark's tech falls into the wrong hands.\nCast\n* Don Cheadle as James \"Rhodey\" Rhodes / War Machine:An officer in the U.S. Air Force and Avenger who operates the War Machine armor. New and different types of armor for Rhodes are featured. Cheadle said Armor Wars would be the first time seeing \"who [Rhodes] is and what makes him tick\" separate from Tony Stark and the Avengers.\n* Walton Goggins as Sonny Burch: A \"low-level criminal-type\" who sells technology on the black market\n* Dominique Thorne as Riri Williams / Ironheart: An MIT student and genius inventor from Chicago who creates a suit of armor that rivals the one built by Stark\nProduction\nBackground\nDon Cheadle said in February 2010 that he had not been told by Marvel Studios about a potential spin-off film for his Marvel Cinematic Universe (MCU) character James Rhodes / War Machine, and believed it would not be made. That November, Marvel had reportedly sent a pitch for a War Machine film to writers. Cheadle said Marvel was developing the film by January 2011, and he believed a writer had been hired; Joe Robert Cole had a meeting with Marvel and pitched his concept for the War Machine film and was hired to write the script, before Marvel decided to no longer pursue the project due to their plans for Iron Man 3 (2013). Cole then joined Marvel's writers program instead. Cheadle said in April 2019 that he was unsure what the film's story would have been, but it would have explored the tension between Rhodes's military job and \"the changing world\".\nIn December 2020, Marvel Studios president Kevin Feige announced a new MCU television series for Disney+ titled Armor Wars, with Cheadle reprising his role as Rhodes; the series' title and premise were based on the 1987–88 comic book storyline \"Armor Wars\". The writing process for the series was set to begin in March 2021, ahead of an indicated filming start in early-to-mid 2021. Cheadle said the death of Tony Stark / Iron Man in Avengers: Endgame (2019) would factor into the series, which would explore more innovations in Rhodes's War Machine suit to elevate the character. Cheadle hoped the series would be able to bridge the storylines from the comics with the MCU and \"make those worlds work\" together. In June, Disney CEO Bob Chapek said Armor Wars would appeal to Iron Man fans who wanted similar content. Cheadle said a month later that he would be joining the writers room within a couple of weeks to help break the series' story, and that they were just \"cracking\" the story and discussing what the series would be. Filming was then set to begin in 2022.\nYassir Lester joined as head writer in August 2021. His pitch excited executives and Cheadle, and he had a \"leg up\" over other potential head writers due to his prior work with Cheadle on the series Black Monday (2019–2021). In October, Cheadle said they were still in the early stages of the series. He expressed excitement at exploring Rhodes separately from Stark and the Avengers following Endgame, and having more time to focus on the character. Cheadle added that while the series would be inspired by the comic book storyline, it would take that \"mythology and tip it on its head a little bit and come up with different ways to tell the story\". Pre-production work started by mid-September 2022, for a filming start in early October at Trilith Studios in Atlanta, Georgia. At that time, Walton Goggins was revealed to be cast in the series, reprising his role as Sonny Burch from the MCU film Ant-Man and the Wasp (2018). confirmed this as early as October 2021 --> Dominique Thorne was also expected to reprise her MCU role as Riri Williams / Ironheart in the series. The series was revealed to be set after the events of the Disney+ series Secret Invasion (2023), in which Rhodes is revealed to have been replaced by a shapeshifting alien Skrull at an unknown point in the history of the MCU; Cheadle said his role in Secret Invasion was intended to set-up the events of Armor Wars. Filming was then set to begin in early 2023, and the series was planned to consist of six episodes, with Rayna McClendon, Lekethia Dalcoe, Garrick Bernard, and Emma Fletcher as writers. Marvel Studios' Feige, Louis D'Esposito, and Brad Winderbaum were serving as executive producers, with Lester also producing, along with Marvel Studios' production and development executive Jenna Berger.\nDevelopment\nAt the end of September 2022, Marvel Studios decided to rework the series into a feature film after realizing the story they were trying to tell was better suited as a film than a long-form series. Cheadle remained on board to star and Lester was remaining as the film's writer. The project was no longer expected to make its planned filming start in early 2023. Marvel Studios executive Nate Moore, who was producing the film with Feige, said the ideas \"felt too big\" for a series and its limited budget compared to that of a film, which could better portray the \"beautiful imagery\" of the comic and leverage ideas to affect future films. By January 2024, filming was expected to begin in 2025. That May, Disney CEO Bob Iger said there would be less Marvel films released a year moving forward as part of Disney's larger strategy to reduce its content output and focus on quality.\nCheadle expressed uncertainty about the film's development progress in October 2024 and said it was \"going through a lot of changes\". Lester said the change from a series to a film had not been too disruptive since filming had not yet begun. He thought the planned series would have been fun and described it as a \"meditation on who the character is\", while the film would be \"a quicker version that kind of propels [Rhodes] back into the story\". He attributed the change to Marvel wanting to find the most interesting version of the story, and to the impacts of Secret Invasion which Kofi Outlaw at ComicBook.com believed was a reference to that series' poor reception. Yassir Lester and his brother Isaiah both expressed interest in directing the film, though Yassir said it would depend on the how much he was paid. In December, Moore announced plans to exit his role at Marvel Studios in March 2025 to pursue producing outside the studio, and he was no longer involved in Armor Wars by February 2025. He noted that work on some projects, such as Armor Wars, had slowed down since the studio began reducing content output and focusing on quality.\nFilming\nPrincipal photography was expected to begin in 2025.\n}}\nExternal links\n*  at Marvel.com\n*\n}}"
    }
  ]
}