{
  "content": [
    {
      "type": "text",
      "text": "# Draft:Glamazon by Colorevolution\n\n| length         =\n| guests         =\n* Lainie Kazan\n* Leah Remini\n| prev           = Oh No She Betta Don't!\n| next           = Drag Queens of Comedy\n| season_article =\n| episode_list   =\n}}\n\"Glamazon by Colorevolution\" is the seventh episode of the sixth season of ''RuPaul's Drag Race''. It originally aired on April 7, 2014. Lainie Kazan and Leah Remini are guest judges.\nLaganja Estranja wins the episode's mini-challenge, and she and Adore Delano are both winners of the main challenge. BenDeLaCreme and Darienne Lake place in the bottom and face off in a lip-sync to \"Point of No Return\" by Exposé, but no one is eliminated from the competition.\nEpisode\n(pictured in 2023) won the episode's mini-challenge as well as the main challenge, alongside Adore Delano]]\nFor the episode's mini-challenge, the contestants design nails and hand model different fruits and vegetables. Laganja Estranja wins the mini-challenge. For the main challenge, the contestants pair up and film an infomercial for RuPaul's Glamazon Cosmetics.\nFollowing are the teams:\n* Adore Delano and Laganja Estranja\n* BenDeLaCreme and Darienne Lake\n* Bianca Del Rio and Trinity K. Bonet\n* Courtney Act and Joslyn Fox\nLainie Kazan and Leah Remini are guest judges. The runway category is \"Black and White Drama\". Adore Delano, Bianca Del Rio, Laganja Estranja, and Trinity K. Bonet receive positive critiques, and Adore Delano and Laganja Estranja both win the challenge. BenDeLaCreme, Courtney Act, Darienne Lake, and Joslyn Fox receive negative critiques, and Courtney Act and Joslyn Fox are deemed safe. BenDeLaCreme and Darienne Lake place in the bottom and face off in a lip-sync to \"Point of No Return\"  (1985) by Exposé. Darienne Lake is declared the winner of the lip-sync, but BenDeLaCreme is saved and no one is eliminated from the competition.\nProduction\nThe episode originally aired on April 7, 2014. It was the show's fourth episode in which no contestant was eliminated.\nReception\nOliver Sava of The A.V. Club gave the episode a rating of 'A-'. Sam Brooks ranked the lip-sync number 60 in The Spinoff 2019 \"definitive ranking\" of the show's 162 lip-syncs to date, calling it \"an example of literally one wrong move losing you a lip-sync\". In 2023, Entertainment Weekly Joey Nolfi said Darienne Lake's lip-sync performance is \"iconic\".\nReferences"
    }
  ]
}