{
  "content": [
    {
      "type": "text",
      "text": "# Draft:Edward A. LeLacheur\n\nEdward A. LeLacheur (June 1, 1925 - August 5, 2010) was a longtime democratic politician and civic leader in Lowell, Massachusetts. LeLacheur is best known for help in the redevelopment of Lowell in the late 90s and namesake of Edward A. LeLacheur Park which served as the home of the Lowell Spinners and Umass Lowell baseball team. LeLacheur was a lifelong Lowell resident, small business owner, and Massachusetts state representative.\nEarly Life and Education\nEdward A. LeLacheur was born in Lowell, Massachusetts on June 1st, 1925 to Frederick and Blanche LeLacheur. Growing up in Lowell, he attended St Peter’s Grammar School and was a member of the 1944 graduating class at Lowell High School. As a young boy, Edward loved baseball and was a big fan of the Lowell Spinners and Boston Red Sox. LeLacheur pursued a business career out of high school, delivering oil for a local fuel company. After working at the fuel company, LeLacheur worked at the First National Stores of Lowell.\nBusiness Career (1958-1975)\nEdward A. LeLacheur operated a small market on Gorham St, the neighborhood market of Lowell beginning in 1958. In this career, LeLacheur connected with local residents on a day-to-day basis. LeLacheur started to build a reputation as a local businessman and community figure, which would help lead to his eventual political career.\nPolitical Career (1975-1998)\nEdward A. LeLacheur was first elected to the Massachusetts House of Representatives in 1975 as a Democrat representing the 47th Middlesex district, winning 32 percent of the vote against 10 opponents. Over his political career, LeLacheur ran in 12 general elections and 12 primary elections. Over this time, LeLacheur remained undefeated. LeLacheur would later represent the 18th Middlesex district due to redistricting, but always represented much of the city of Lowell. Over his 24-year tenure, LeLacheur served in many different roles and positions. Edward served on the House Post Audit and Oversight Committee, the House Ways and Means Committee, and the House Ethics Committee. From 1991 to 1998, LeLacheur also served as the Chairman of the House Committee on Personnel and Administration. In politics, Edward A. LeLacheur primarily focused on the needs of the citizens of Lowell. Edward consistently focused on legislation that improved Lowell’s urban redevelopment and municipal services.\nRedevelopment of Lowell\nLowell, Massachusetts was big in the textile industry in the late 19th and early 20th century. After the decline of the industry, Lowell faced loss of jobs and economic downturn. In response, politicians such as LeLacheur focused on redeveloping the city through projects, expansion, and historical preservation. LeLacheur advocated for improvements to the city, such as investment into infrastructure. This included roadway programs, brownfield redevelopment, and public safety resources. LeLacheur was involved with the legislation of the Tsongas Center at UMass Lowell. Edward A. LeLacheur was also a vital supporter of the University expansion in 1991. This project was the merger of Lowell State College with Lowell Technological Institute, which formed the University of Massachusetts Lowell. With the University, Edward A. LeLacheur saw it as an opportunity. LeLacheur began to form a collaboration and eventual partnership between the city of Lowell and the University. This partnership led to UMass Lowell’s East Campus becoming the center for infrastructure and community use. East Campus would become home to LeLacheur’s biggest project, Edward A. LeLacheur Park.\nEdward A. LeLacheur Park\nEdward A. LeLacheur’s biggest project throughout his political career was the ballpark that now bears his name. Located on the banks of the Merrimack River, Edward A. LeLacheur Park served as the home of the Lowell Spinners from its opening until 2020. The park also serves as home for the Umass Lowell Riverhawk baseball team. LeLacheur spearheaded support at a state level, funded through a partnership between the city, state, and university. The park opened June 22, 1998. At the grand opening, LeLacheur was on hand to throw out the first pitch in front of a sold-out crowd. On July 3rd, 2009, Edward was honored with a bobblehead of himself. Thanks to LeLacheur, the 4,767-seat stadium received 8 million dollars for the Commonwealth of Massachusetts and 2.4 million in funds from the city. Edward secured the funding for the park which would serve Lowell residents with a source of revenue and entertainment for years to come. In recognition of his leadership, LeLacheur’s name was given to the project. The park has strengthened the community, holding many sporting events as well as concerts and local entertainment. In 2022, the park was sold to Umass Lowell, with the University pledging further renovations to the stadium. The park serves as a symbol of Lowell’s redevelopment in the late 20th and early 21st century.\nPersonal Life\nEdward A. LeLacheur celebrated 50 years of marriage with his late wife Eileen LeLacheur. He also left behind his wife Ann, and his children, Joanne Sheheen, Mary Jane Nardone, William LeLacheur, Paul LeLacheur, James Lelacheur, and Edward D. LeLacheur. Edward was described as the most compassionate, generous, and soft-hearted man you'd ever meet. He provided Thanksgiving and Christmas dinners to the people of Lowell who could not have their own for many years. Edward was also an active parishioner of Sacred Heart Church. He was President of the Sacred Heart Men's Club, President of the Holy Name Society, and District Vice President of the St. Vincent de Paul Society.\nLegacy\nEdward A. LeLacheur died on August 5, 2010, after a 14-month battle with ALS. He spent much of his life in public service and was actively involved in projects that supported the city of Lowell, Massachusetts. LeLacheur was known for his direct involvement in community initiatives and city improvement efforts. He played a key role in the redevelopment of Lowell during the late 20th century, working alongside organizations such as the Lowell Plan and supporting investments in cultural, educational, and infrastructure projects. These combined efforts helped reshape Lowell’s economy and identity in the 21st century. Edward A. LeLacheur Park serves as a lasting recognition of his public work and contributions to the city’s redevelopment.\nReferences"
    }
  ]
}