{
  "content": [
    {
      "type": "text",
      "text": "# Draft:Last War:Survival Game\n\nBackground\nLast War: Survival Game\" is a mobile strategy game set in a post-apocalyptic world overrun by zombies. Developed by FUNFLY PTE. LTD (First Fun)., a [https://www.firstfun.com/ Singaporean-based company], the game challenges players to survive, build, and strategize in a hostile environment.​\nGameplay\nPlayers begin their journey by dodging and combating waves of zombies, requiring quick reflexes and strategic thinking. As the game progresses, players can customize and expand their bases, recruit heroes from three military branches—each with unique skills—and form alliances with players worldwide to combat the zombie threat:\n1. Campaign Mode\nThis story-driven mode guides players through a series of missions, each increasing in difficulty. Players engage in battles against zombie hordes and enemy factions, advancing the narrative and unlocking new content.​\n2. Survival Mode\nIn Survival Mode, players face continuous waves of enemies, including formidable bosses and zombies. The objective is to endure as long as possible, testing both strategy and endurance. Successful progression yields valuable rewards such as hero shards and resources. ​\n3. Arena Mode\nArena Mode offers player-versus-player (PvP) combat, where individuals challenge others in 1v1 matches. Victories improve leaderboard standings and grant rewards like hero experience points and honor points, which can be exchanged for exclusive items in the Honor Shop.\n4. Special Operations\nThis mode consists of specific stages, each presenting unique challenges and rewards. Completing these stages provides troops and hero experience points, essential for strengthening characters and enhancing overall gameplay performance. ​\n5. Honorable Campaign\nThe Honorable Campaign pits players against AI-controlled teams in 5v5 battles. As players advance through stages, the difficulty escalates, offering materials crucial for hero development upon successful completion.\n6. Exploration Quests\nExploration Quests are extended missions that challenge players with stronger opponents. Completing these quests yields valuable items, including hero shards and resources, vital for leveling up heroes and advancing in the game.\n7. Resource Gathering Modes\nThese modes focus on collecting essential materials for base development and troop enhancement. Efficient resource management and strategic planning are key to maximizing benefits from these modes.\nEach mode in \"Last War: Survival Game\" offers unique challenges and rewards, catering to various playstyles and strategic preferences.\nDevelopment and Release\n\"Last War: Survival Game\" was released in the US on 8 June 2023, and globally on 20 June 2023. It is available on both Android and iOS platforms. The game is free-to-play with in-app purchases. ​\nCommunity and Resources\nThe game has fostered an active community, with resources such as the Last War Tutorial website providing guides, cheats, and tutorials. Additionally, the Last War Wiki offers detailed information about heroes, buildings, items, and other game elements. ​\nReferences"
    }
  ]
}