{
  "content": [
    {
      "type": "text",
      "text": "# Draft:Professional Speaking Association UK & Ireland\n\n}}\nThe Professional Speaking Association UK & Ireland (PSA UKI) is a professional association that supports motivational and other public speakers in the United Kingdom and Ireland. It is one of the largest of 13 international associations comprising the Global Speakers Federation.\nHistory\nPSA UKI was established in 1999 by Rikki Arundel, Brendan Power, Phillip Khan-Panni and Rex Warner as the Professional Speakers Association, with the aim of supporting and advancing the professional speaking industry across the region.\nThe founders, inspired by similar organisations like the National Speakers Association in the United States, envisioned a platform that would foster professional development, networking, and ethical standards for speakers.\nIn its early years, the PSA focused on building a community of professional speakers, trainers, coaches, and other experts who use public speaking as a core part of their careers. The association gained traction, hosting its first national convention in 2001 and it has since grown to more than 600 members.\nOrganisational structure and operations\nThe Professional Speaking Association UK & Ireland (PSA) is structured to support its members through a combination of national governance and regional activities. The association operates under the guidance of a National Board, which oversees strategic direction, financial management, and membership development. The board includes key roles such as the Chair, National President, Finance Director, and other directors responsible for areas like communications, membership, and events.\nMembership\nMembership is available to paid professional speakers, trainers, coaches and authors.\nEvents\nPSA UKI holds an annual 3-day national convention, the Speaking Business Summit, in October featuring speakers in the industry and an annual one-day Spring Conference in April.\nLocal and regional chapters\nThe PSA is further divided into 13 regional groups across the UK and Ireland, each led by a Regional President and a local committee. These regional groups serve as hubs for professional development, networking, and community engagement, hosting monthly events, workshops, and speaker showcases. These activities provide members with opportunities to enhance their skills, receive feedback, and build connections within the speaking industry.\nNotable members\n* Kriss Akabusi\n* Aaron Phipps\n* Cathy O'Dowd\n* Abigail Irozuru\n* Guy Clapperton\n* David Meade\n* Jeremy Nicholas\n* Darren Harris\nReferences"
    }
  ]
}