{
  "content": [
    {
      "type": "text",
      "text": "# Draft:Sid Mewara\n\nSid Mewara is an Indian television host, executive producer, entrepreneur, and former investment banker. He is best known for co-creating and presenting The Big Forkers and I Should Have Stayed Home, both acclaimed food and travel documentary series. Through their production house, Filandering Forker Media, Mewara and his co-host Shashank Jayakumar have collaborated with Warner Bros. Discovery India. I should Have Stayed Home won awards at the Asian Academy Creative Awards, and is recognized for bringing immersive storytelling to Indian and international audiences.\nEarly Life and Education\nMewara was born in India and spent his early years traveling the world as the child of a Master Mariner. He lived in Delhi before relocating with his family to South Florida in the early 1990s.\nHe was educated at Modern School (New Delhi) and Scindia School, and completed high school in Coral Springs, Florida.\nHe later studied culinary arts at Johnson & Wales University, business administration at Florida International University, and strategy and management at the Wharton School of the University of Pennsylvania.\nProfessional Career\nManagement Consulting & Investment Banking\nAfter completing his education at Wharton, Mewara worked as Asia head of a German public company and then founded SG Capital, offering international investment banking and capital advisory services.\nHe worked extensively in corporate finance throughout Asia, with long-term assignments in China, Singapore and Los Angeles.\nVenture Capital & Private Equity\nMewara serves as Managing Partner and Chief Investment Officer at Capital Union Investments (CUI), also known as M2 Capital Ventures. He has led multiple investment deals, including with fintech firm Digital Asset.\nMedia Entrepreneurship\nMewara is the co-founder and managing director of Filandering Forker Media, along with his cousin and long-time collaborator Shashank Jayakumar. Together, they have created and co-hosted The Big Forkers and I Should Have Stayed Home, as well as other food and travel-based shows.\nThe Big Forkers\nThe Big Forkers is a food and travel documentary series hosted by Sid Mewara and his cousin and co-founder Shashank Jayakumar. The show explores India's diverse culinary landscapes with an irreverent, immersive tone.\nThe series has been featured in national publications including:\n* The Hindu\n* Hindustan Times\n* New Indian Express\n* Indulge Express\n* Business Goa\nI Should Have Stayed Home\nIn this travel docuseries, Mewara and Jayakumar explore unpredictable journeys across remote parts of India. It was distributed by Warner Bros. Discovery India and won two Asian Academy Creative Awards:\n* Best Non-Scripted Entertainment\n* Best Infotainment Programme\nPersonal Life\nMewara lived for over 18 years in China and also spent long durations in Singapore, Los Angeles, and Poland. He has traveled extensively through Asia and Europe. He currently lives in India and is married with two daughters; his wife Nino Gloweli Mewara is of Polish and Georgian heritage.\nReferences"
    }
  ]
}