{
  "content": [
    {
      "type": "text",
      "text": "# Draft:Scott \"Scottie\" Ward__disambig_2\n\n----\nScott \"Scottie\" Ward is an American media executive, television producer, actor, and private lending industry leader. He is the CEO of Think Realty, a national real estate investment media and education company. Ward is known for co-creating the Discovery Networks television series Shipwreck Men, appearing in Hitchhiker Chronicles on FX, and for his leadership within the American Association of Private Lenders (AAPL), where he serves on the Education Committee and hosts the AAPL Fund Forum.\nEarly life and education\nScott Ward was born in Lansing, Michigan, United States.\nDetails about his early education and academic background have not been publicly disclosed.\nTelevision and media career\nWard began his television career as an actor and producer, appearing in two seasons of the FX reality television series Hitchhiker Chronicles.\nHe later co-created and produced Shipwreck Men, a reality series produced under Discovery Networks / Discovery Studios, which followed marine salvage crews operating off the coast of Florida.\nBusiness and private lending career\nWard is the CEO of Think Realty, which he acquired in 2025.\nUnder Ward’s leadership, Think Realty produces national conferences, education programs, and multimedia content serving real estate investors and private lenders across the United States.\nIndustry leadership and education\nWard serves on the Education Committee for the American Association of Private Lenders (AAPL) and has hosted the association’s Fund Forum series for more than three years.\nHe has authored seven articles in Private Lender, the official publication of AAPL.\nIn 2024, Ward received the Community Impact Award from AAPL.\nPublications\n* \"Member Spotlight: Scott Ward\", Private Lender, September 2023.\n* Additional articles in Private Lender (2020–2024). *(Citations pending)*\nAwards\n* Community Impact Award, American Association of Private Lenders (2024).\n* Featured in Private Lender Member Spotlight (2023).\nFilmography\n{| class=\"wikitable\"\n! Year !! Title !! Role !! Network\n|-\n| 2013 || Shipwreck Men || Co-Creator / Executive Producer || Discovery Channel\n|-\n| 2018–2020 || Hitchhiker Chronicles || Cast / Actor || FX\n|}\nReferences\nExternal links\n* [https://www.linkedin.com/in/scottwardfundmanager Scott Ward on LinkedIn]\n* [https://www.imdb.com IMDb profile – Scott Ward]\n* [https://www.thinkrealty.com Think Realty official website]\n* [https://aaplonline.com American Association of Private Lenders]\n:Category:American television producers\n:Category:American television actors\n:Category:American chief executives\n:Category:American businesspeople\n:Category:People from Lansing, Michigan\n:Category:Living people\n:Category:Year of birth missing (living people)"
    }
  ]
}