{
  "content": [
    {
      "type": "text",
      "text": "# Draft:Scientific Working Group on DNA Analysis Methods\n\nThe Scientific Working Group on DNA Analysis Methods (SWGDAM) is a U.S.-based consortium of forensic scientists and practitioners that operates under the auspices of the Federal Bureau of Investigation (FBI). The group’s mandate is to provide guidance, best practices, and standards recommendations for forensic DNA laboratories, including those participating in the Combined DNA Index System (CODIS) and related databasing systems.\nHistory and purpose\nSWGDAM traces its origins to the earlier Technical Working Group on DNA Analysis Methods (TWGDAM). For example, TWGDAM produced a consensus approach on the “ceiling principle” for DNA profile frequency estimates in 1997.\nSWGDAM is chartered to:\n* Recommend revisions to the FBI’s Quality Assurance Standards (QAS) for forensic DNA testing laboratories and DNA databasing laboratories.\n* Serve as a forum for the forensic-DNA community to evaluate methods, protocols, training and research in DNA analysis.\n* Conduct and/or recommend validation and research of forensic DNA analysis methods.\nOrganization and committees\nSWGDAM is structured into multiple standing committees and adhoc working groups that focus on specific technical, quality assurance, databasing, lineage marker (e.g., mitochondrial DNA and Y-STR) and investigative genetic genealogy topics.\nExamples include:\n* Autosomal STR Committee\n* CODIS Committee\n* Investigative Genetic Genealogy (IGG) Committee\n* Laboratory Operations Committee\n* Quality Assurance Committee\n* Lineage Marker Committee   These committees review existing guidelines, propose new ones, and feed recommendations into SWGDAM’s wider body.\nKey activities and outputs\nQuality Assurance Standards (QAS)\nOne of SWGDAM’s principal roles is advising the FBI on updates to the QAS for forensic DNA laboratories. For instance, the FBI’s Quality Assurance Standards for Forensic DNA Testing Laboratories document sets out mandatory requirements for casework and databasing labs.\nIn February 2025, it was announced that new versions of the QAS (effective July 1 2025) would be issued, with input from SWGDAM.\nGuidance and validation documents\nSWGDAM publishes many guidance documents and technical recommendations for forensic DNA labs. Its “Publications” page lists documents on mitochondrial DNA analysis, single nucleotide polymorphism (SNP) methods, probabilistic genotyping system (PGS) validation, contamination prevention, missing-persons casework, and more.\nIn 2002, SWGDAM issued a guidance document based on the Occupational Safety and Health Administration (OSHA) standard 29 CFR 1910.1450, to assist forensic labs in establishing comprehensive health & safety programmes.\nMethodological and interpretive guidance\nSWGDAM has issued interpretation guidelines, for example for autosomal STR typing and for reporting likelihood ratios in DNA mixture interpretation.\nSignificance and impact\nSWGDAM plays a critical role in promoting standardisation, quality assurance and methodological rigour in forensic DNA testing within the United States and, by extension, internationally. Its recommendations carry weight for accreditation, laboratory auditing, court admissibility of DNA evidence, and forensic best practices. For forensic practitioners, compliance with SWGDAM-influenced guidelines helps ensure that DNA profile generation and interpretation are scientifically sound, reproducible, and defensible in legal contexts.\nMoreover, by serving as a liaison among federal, state, local, and private-sector forensic DNA stakeholders, SWGDAM fosters communication, knowledge-sharing and consensus development in a rapidly evolving field.\nRelationship with CODIS and the FBI\nSWGDAM’s guidance is closely aligned with the FBI’s operations of CODIS and the National DNA Index System (NDIS). Laboratories participating in CODIS must meet the FBI’s QAS, which SWGDAM helps review and update.\nSWGDAM committees such as the CODIS Committee specifically focus on issues relating to CODIS software, participant laboratories, and the integration of new technologies (e.g., Rapid DNA) into databasing operations.\nFuture directions and challenges\nWith evolving technologies (e.g., next-generation sequencing (NGS), probabilistic genotyping models, investigative genetic genealogy), SWGDAM continues to publish new guidelines and update its recommendations to keep pace with the forensic DNA field. For example, the “Validation Guidelines for the Use of an Expert System with Forensic Samples” is among recent outputs.\nFurthermore, questions of admissibility, ethical use of databases, privacy and data protection for forensic DNA continue to pose challenges; SWGDAM’s role in providing consensus guidance on these issues remains important.\nSee also\n* Combined DNA Index System (CODIS)\n* Forensic DNA analysis\n* Investigative genetic genealogy (IGG)\nReferences"
    }
  ]
}