{
  "content": [
    {
      "type": "text",
      "text": "# Draft:Butiking Pasay__disambig_1\n\n----\nButiking Pasay (The Gecko Man of Pasay) is a Filipino graphic novel written, illustrated, colored, and designed by Wincy Aquino Ong published by Komiket.. A 32-page full‑color prologue, Butiking Pasay: Rooftop Boogie, debuted at the Philippine International Comics Festival (PICOF) on July 5–6, 2025, with a full-length graphic novel (over 200 pages) scheduled for release in 2026.\nPublication history\nThe title was developed in Komiket and PICOF’s Creator’s Lab Batch 5 program. The Rooftop Boogie prologue premiered at PICOF 2025 at SM Megamall’s Megatrade Hall. The launch included a motion-comic screening, limited-edition postcards featuring art by Ian Sta. Maria, Elbert Or, Ardie Aquino, and Brian Balondo, and a prototype action-figure auction by Super Pixels Studio.\nPremise\nSet in 1980s Pasay during the Martial Law era, the story follows a silent, barefoot vigilante known only as “Butiking Pasay.” Dressed in a Metro Aide uniform, he is rumored to crawl walls, wield a sentient backscratcher, possess a prehensile tail, and excrete “mood‑shift mucus” capable of inducing states from sleep to panic to intense pleasure—dubbed “Kulangot Bombs” in in-universe tabloids.\nStyle and influences\nIn an Esquire Philippines profile, Ong likened the title’s tone to “Lino Brocka’s Ninja Turtles,” noting the deliberate choice of a rougher, expressionistic style over typical manga or superhero art. The comic draws inspiration from Western works such as Æon Flux and The Maxx, alongside Nick Joaquin–style noir reporting. Architectural influences from Pasay’s Locsin-era Brutalism and Ong’s background in street photography are also evident.\nReception\nPrior to its release, the comic was featured in established Filipino publications. Twenty8two, a tech and pop culture outlet under the TV5 network, described it as “a strange beast of a comic” that blends body horror and noir, while The Manila Times, one of the country’s longest-running newspapers, praised its “quirky yet totally Pinoy” sensibility.\nReferences"
    }
  ]
}