{
  "content": [
    {
      "type": "text",
      "text": "# Draft:Shahd Seethaler-Wari\n\nShahd Seethaler-Wari (*1983) is a German-Palestinian urban planner, architect, and researcher. Her work is considered pioneering in the field of urban planning, particularly in the context of migration and social inclusion. Her doctoral thesis and subsequent research conducted at the Max Planck Institute in Göttingen played a globally pioneering role in this field.\nLife\nShahd Seethaler-Wari was born in Jerusalem and received her schooling at the prestigious Schmidtschule. She studied architecture at Birzeit University in Palestine and later obtained a master’s degree in Urban Management at the Technical University of Berlin. Her doctoral studies focused on the use and perception of public spaces by Palestinian migrants and refugees in Berlin.\nResearch\nSeethaler-Wari’s research focuses on the spatial needs of refugees and migrants as well as issues of social inclusion and infrastructure. Her work combines architecture, urban planning, and social sciences. She was notably a postdoctoral researcher at the Max Planck Institute for the Study of Religious and Ethnic Diversity, where she worked on the project “Asylum-seekers’ Needs and Aspirations”. Her investigations into the design and effects of refugee reception in Germany show how spatial structures can reinforce or reduce social exclusion. Her work is considered innovative, as it conceives urban planning as an active instrument of social justice and integration.\nSelected publications\n•\tPalestinian Berlin: Perceptions and Use of Public Space (Habitat - International: Schriften Zur Internationalen Stadtentwicklung, Band 22. Lit (2017).\n•\tUrban Planning for the Integration of Refugees: The Importance of Local Factors. In: Urban Planning, 3(4), pp. 141–155 (2018).\n•\tSeethaler-Wari, Shahd; Chitchian, Somayeh; Momić, Maja (eds.) (2022): Inhabiting Displacement: Architecture and Authorship. HafenCity Universität Hamburg (2022).\n•\tSeethaler-Wari, Shahd; Yanaşmayan, Zeynep: Unfolding intersecting forms of socio-spatial exclusion: Accommodation centres at the height of the refugee reception crisis in Germany (2023).\nReferences"
    }
  ]
}