{
  "content": [
    {
      "type": "text",
      "text": "# Draft:Massacres during the Muslim conquest of Transoxiana\n\nThe massacres during the Muslim conquest of Transoxiana were a series of mass killings and enslavements committed by the Umayyad Caliphate during its military expansion into Transoxiana, a region in Central Asia, between 706 and 715 CE. These actions were primarily carried out by the Umayyad general Qutayba ibn Muslim during the conquest of key cities such as Bukhara, Samarkand, Khujand, and the Ferghana Valley.\nBackground\nThe conquest of Transoxiana marked the easternmost expansion of the early Islamic empire into regions populated by Iranian and Turkic peoples, such as the Sogdians. Local resistance was frequent and often fierce, leading to severe reprisals by Arab forces. Though not all fighting resulted in massacres, a number of cities experienced mass executions and forced enslavement following sieges or revolts.\nEstimated casualties\nHistorical accounts and scholarly estimates suggest that approximately 31,000 people were killed during reprisals and massacres, while an estimated 55,000 individuals were enslaved. These figures do not include battlefield deaths but are focused on acts occurring after surrender or in the aftermath of uprisings.\n{| class=\"wikitable\"\n! Location !! Date !! Description !! Estimated killed !! Estimated enslaved\n|-\n| Baykand || 706 CE || City stormed after resistance || ~3,000 || ~5,000\n| Bukhara || 707–709 CE || Rebellion crushed, nobles executed || ~10,000 || ~20,000\n| Samarkand || 712 CE || City surrendered, elites purged || ~6,000 || ~10,000\n| Khujand || 713 CE || Revolt suppressed || ~4,000 || ~8,000\n| Ferghana Valley || 714 CE || Punitive campaigns || ~3,500 || ~7,000\n| Zarafshan Valley || 710–712 CE || Village massacres || ~4,500 || ~5,000\n|-\n! Total !! – !! – !! style=\"background:#fdd;\" | ~31,000 !! style=\"background:#fdd;\" | ~55,000\n|}\nHistorical sources\nDescriptions of these events are recorded in early Islamic chronicles, including:\n* al-Tabari, History of the Prophets and Kings (Vol. 23–24)\n* al-Baladhuri, Futuh al-Buldan\n* Tang Chinese records referring to the violence in Sogdiana\n* Analyses by modern historians such as Hugh Kennedy, Richard Frye, and C.E. Bosworth\nThough the term \"massacre\" is not always explicitly used in early texts, the scale of violence and the treatment of civilians and prisoners are considered massacres by modern historical standards.\nSee also\n* Muslim conquest of Transoxiana\n* Qutayba ibn Muslim\n* Massacres during the Crusades\n* Massacres during the Mongol invasions\n* History of Islam in Central Asia\nReferences\nBibliography\n* Kennedy, Hugh. The Great Arab Conquests. Da Cap\nReferences"
    }
  ]
}