{
  "content": [
    {
      "type": "text",
      "text": "# Draft:Sri Irukalalaparameswari Ammavari Temple\n\n----\n}}\nSri Irukalalaparameswari Ammavari Temple, Nellore.\nHistory of the Temple.\nThe town of Nellore is very ancient. We know from the archaeological evidence that there were people living in Nellore during the Mauryan and Satha Vahana periods. Silver coins of the Maurya period, residences of the Sata Vahanas period, and gold coins of the Greek states of that period have been found here, so it is known that it has been a place of residence since the year 2000. It is known that this town is spread in Moolapeta, Fateh Khanpeta, Barakasu, Kotamitta area. Archeology department officials believe that Sri Irukala Parameshwari village deity existed as early as 10th and 11th century AD.\nSri Irukala Parameshwari Ammavari Temple is built on the banks of the Nellore pond known as Swarnala Cheruvu in Moolapet, Nellore town. The history of Pratapa Rudra shows that this golden pond was built by Lord Ganapati of the Kakatiyas.\nIn the 13th century AD, the Telugu Chola kings were ruling the month, at that time Rajaina Choda Thikka begged the Lord Kakatiya Ganapati, the lord of Orugallu, to come and help them. God Ganapati first appeared in 1203 AD. They invaded the Nellore region in the year From then until about 1317 AD, the Kakatiyas raided Nellore several times. In AD 1314-15, his soldiers who came to this area as a gift to Muppadi Nayaka and his son Padda Rudra, it is known that the Nellore land had three months of rains in the month and three days of rain, and their lives were rich.\nAccording to another inscription, Savanna was ruling Udayagiri as the representative of the Vijayanagara Empire during the period of AD. 1364-65 Adhikari Kanchanam Garu organized a Santa every Friday and paid a part of the trade taxes collected from the traders from the country and abroad in the Santa to Irukalala Parameshwari Angaranga Vaibhogas.\nSri Irukalala Parameswari Ammavari Temple, Nellore\nAnother inscription here says “Saleswara Swamy Temple. This temple is built with soft stones. In this garbha griha there are antaralla mandapam, ardha mandapam, mandapam and veranda. The main architectural features are the mukha mandapam in front of the temple, in which the inscriptions are on the stone beams on top of the pillars.\nThe first idol installed in this temple is Chamundeshwari. It is surprising that this goddess was placed in the verandah along with an owl. A similar one can be seen at Chamundi in the Sapta Matru Kaala sculpture at Ellora.  In this way, Irukala Parameshwari Ammavaru temple is famous from ancient times till today."
    }
  ]
}