{
  "content": [
    {
      "type": "text",
      "text": "# Draft:Nogai Battle\n\n* Murder of Astrakhan Khan Muzaffar\n| combatant1        = Kazakh Khanate\n| combatant2        = Nogai Horde\n| combatant3        = Astrakhan Khanate\n| commander1        =\n* Kasym Khan\n* Pulad Sultan\n* Jadik Sultan\n| commander2        =\n* Shigai Mirza\n* Sayyid Ahmad Mirza\n| commander3        = Muzaffar\n}}\nNogai Battle was fought in 1519 between the Kazakhs, Nogais and Bolsheordyntsy of the Astrakhan Khanate near the Volga River under the walls of Hadji Tarkhan (Astrakhan).\nDescription\nIn 1519, the Kazakh khan decided to strengthen his power over the Nogai Horde. This was particularly important after the unsuccessful Tashkent campaign, as a result of which Kasym Khan's army immediately returned to the steppe, and Kasym Khan abandoned thoughts of further conquests. To continue the struggle for control over the Turkestan pastures and cities, the khan sought to unite all his subjects under his authority, including the Nogais.\nInformation about the events of that time has been preserved in diplomatic reports. Envoy B. Ya. Golokhvastov, en route to Turkey, reported from Kaffa that the Crimean khan had received word from Sheikh Muhammad stating that \"they are pressured by the Kazakh Horde.\" In response, Mehmed I Giray allowed the Nogais \"to cross over to this side of the Volga.\" A mass crossing of the Nogais began, but Astrakhan ruler Janibek intervened. He set a condition: \"If you wish to cross to this side of the Volga, you must make peace with us and send us a Crimean envoy.\" As Kazakh pressure intensified, Sheikh Muhammad agreed to these terms: \"They made peace with Astrakhan and sent a Crimean envoy to Astrakhan.\" However, Janibek imprisoned the envoy.\nGolokhvastov arrived in Kaffa on July 3, so the Kazakh offensive likely began shortly before this—probably in June 1519. In the fall of the same year (around November), the Ottoman governor of Azov informed Vasily III that two Nogai mirzas had \"fled\" to Azov with news: \"The Kazakhs captured the uluses of Sheikh Mirza.\" This likely referred to Sheikh Muhammad's followers who had not yet managed to cross to the right bank of the Volga.\nSheikh Muhammad himself also failed to reach Crimea. It is reported that he fought against the Kazakhs near the walls of Hajji Tarkhan, covering the crossing of his subjects. These events may be described in the work of Qadir-Ali Bek, which mentions the death of Kasym Khan's nephew Pulad in the \"Nogai battle\" and the killing of Jadik Khan and his son by \"Sheikh Mirza.\" Sheikh Muhammad himself likely did not die at the hands of the Kazakhs but rather at the hands of the Astrakhan and Greater Horde forces. Various versions of the Genealogy state: \"And Musin's son, the great Shegey prince, was killed in Astrakhan.\" Ottoman sources note that \"Sheikh Mirza was killed, and his hordes were captured.\"\nAfter Sheikh Muhammad's death, his brother Said Ahmed attacked the Akhmatovichi in Astrakhan and destroyed seven \"sultans,\" including Muzaffar. Most of the Greater Horde in Astrakhan was annihilated: \"Not a single (sultan) remained in Astrakhan.\" The Nogais reclaimed their property and seized the Astrakhan ulus. Only the capital of the Astrakhan Horde remained under Janibek Khan's control.\nThe above phrase indicates that the Astrakhans and the Greater Horde profited from the Nogai refugees by resorting to looting, confiscating property, and oppressing them. Sheikh Muhammad's death and Said Ahmed's subsequent actions are attributed to the spring of 1519.\nReferences"
    }
  ]
}