{
  "content": [
    {
      "type": "text",
      "text": "# Draft:Anatomy Warehouse\n\n----\nAnatomy Warehouse (legally Anatomical Worldwide, LLC) is a U.S.-based anatomical model and simulation equipment distributor serving medical education, clinical training, and legal demonstration markets. Founded in 2005, it operates as an e-commerce company headquartered in Skokie, Illinois.\nHistory\nIn 2005, Adam Cordell started Anatomical Worldwide, LLC as a family operation in Evanston, Illinois, before its move to Skokie Illinois. The company is formally registered as Anatomical Worldwide, LLC. Cordell ventured into anatomy business because his father, Marshall Cordell, owned a skeleton distribution business from the 1980’s to the 1990’s.\nAccording to Gizmodo, the company has continued to supply classic anatomical models, including Bucky skeletons, to clients such as amusement parks. The Evanston RoundTable reported on the company’s growth in the medical education and simulation markets, as well as its development of custom 3D-printed training tools and inclusive model options.\nProducts and services\nAnatomy Warehouse distributes anatomical models, task trainers, wound simulation kits, veterinary models, and medical simulation equipment. It is listed as a U.S. distributor for manufacturers such as GPI Anatomicals. The company is also included in healthcare simulation directories such as HealthySimulation.com. Anatomical Worldwide LLC, which operates as Anatomy Warehouse, is listed as an authorized distributor of Koken Co., Ltd.’s educational medical models, including simulators used for bronchoscopy, suturing, and surgical training.\nThe company's products have been used in medical research and simulation studies. A study published in the Annals of Otology, Rhinology & Laryngology cited temporal bone models from Anatomy Warehouse in a comparison of 3D printing materials for surgical dissection training. A 2021 article in Scientific Reports used an anthropomorphic breast phantom sourced from the company in magnetic particle imaging research related to breast-conserving surgery.\nA 2022 study in PeerJ reported the use of a human skull model from Anatomy Warehouse in testing tumor treating fields (TTFields) by measuring impedance across electrode arrays.\nAnatomical models sold by the company have also been discussed in popular media. A 2014 article in Gizmodo highlighted a one-pound fat replica offered by the company, describing its visual appearance and use in public health messaging. In 2024, a report by The Xylom on gender representation in anatomical models cited the company's catalog and pricing, noting that fewer female skeletons were available than male (\"universal\") models, and that price differences were attributed to production volume and demand. The company later provided additional data and components for further analysis.\nAcademic use\nProducts from Anatomy Warehouse have been cited in academic and peer-reviewed publications. A 2020 study published in the Pediatric Medical Education Journal used a training arm from the company to develop a pediatric fracture simulator.\nOther publications have referenced Anatomy Warehouse-sourced models in osteopathic education, ethics in training design, and procedural education such as bronchoscopy or colonoscopy training.\nClientele and markets\nAnatomy Warehouse serves schools, universities, hospitals, and government programs. It has been listed in procurement records from institutions including Hampton University, San Joaquin Delta College, Coastline ROP, and Irving Independent School District.\nIn 2023, a logistics industry case study by Inventory Planner profiled Anatomical Worldwide LLC, which operates as Anatomy Warehouse, noting its inventory management practices and its role as a global supplier of healthcare education products since 2005.\nLegal and professional use\nIn 2024, the Sonoma County Superior Court referenced an anatomical model sourced from Anatomy Warehouse in a malpractice case ruling.\nIn 2019, Anatomical Worldwide LLC (operating as Anatomy Warehouse) submitted a public comment to the Office of the United States Trade Representative (USTR) regarding proposed tariffs on educational medical products. The submission described the company’s role in supplying anatomical models and simulation equipment to schools, healthcare institutions, and government agencies.\nTrade and community participation\nThe company has participated in healthcare simulation conferences such as the International Meeting on Simulation in Healthcare (IMSH) and Anatomy Connected. A 2024 industry roundup by *ProHealth Product Insights* identified Anatomy Warehouse as one of the top ten companies in the medical educational simulation market, citing product accuracy, affordability, and application across healthcare and academic environments.\nIn 2025, Anatomy Warehouse hosted a public clearance event at its Skokie facility, offering discounted models to schools and individuals.\nSee also\n* Anatomical model\n* Medical simulation\n* Healthcare education\n* International Meeting on Simulation in Healthcare\n* American Association for Anatomy\nReferences\nExternal links\n* [https://www.anatomywarehouse.com Official website]"
    }
  ]
}