{
  "content": [
    {
      "type": "text",
      "text": "# Draft:John E. Buckingham\n\n| death_date          =\n| resting_place       = Ashland CemeteryAshland, Kentucky\n| predecessor         = Elam Huddleston\n| succeeded           = Emma Guy Cromwell\n| term_start          = January 6, 1936\n| term_end            = January 1, 1940\n| party               = Democratic\n| birth_place         = Paintsville, Kentucky\n| death_place         = Frankfort, Kentucky\n| governor            = Happy Chandler\n}}\nJohn E. Buckingham (November 9, 1874 – August 30, 1959) was an American politician and businessman who served as Kentucky State Treasurer from 1936 to 1940. He was also a close associate and business partner of John C. C. Mayo.\nEarly life and education\nJohn was born in Paintsville, Kentucky, to\n* Born in Paintsville\n* Attended public schools, dropped out at 13 to be a printer's devil at The Paintsville Paragraph\n* Became editor of paper four years later, and bought it in 1893\n* Sold the paper and attended UofL Law in 1894; never graduated(?)\n* Married Nolia Teass on May 29, 1894; together had three daughters --> Martha, Winifred, and Venus\n* Admitted to KY Bar in 1895\n* Student of John CC Mayo\nEarly career\n* Returned to Paintsville and opened a law office\n* studies for 18 hours a day to get teaching certificate; obtained and taught from 1895-1899\n* Began banking in 1901\n* Appointed postmaster\n* Established Paintsville National Bank in 1902 alongside Mayo and others\n* Elected president of Kentucky Bankers Association 1913-1914\n* Hosted welcome reception on August 20, 1913, for Mayo's return from Europe.\n* During depression, only one bank he owned, Paintsville National Bank, did not close. (was merged with another).\nPolitical career\nElection\nBuckingham won the 1935 Democratic Primary for Kentucky State Treasurer as an ally of Happy Chandler against the Laffoon administration's preferred candidate, Sarah W. Mahan, and won the 1935 Kentucky State Treasurer election with 486,748 votes against Republican candidate Charles Cole.\n* Reduced state debt from $25 million to $5 million\n* Speculated as a potential governor contender in 1939 gubernatorial election, but ultimately did not run.\nLater career\n* Taught Bible School for 35 years\n* Elected president of Kentucky Bankers Association in 1940-1941\nDeath and legacy\n* Lived with daughter, Venus Browning, in Frankfort\n* Grandson, John Buckingham Browning, was Asst. KY Attorney General to John B. Breckinridge\n* Suffered a stroke at their home in Frankfort on Monday, August 24.\n* Admitted to Kings Daughter Hospital next day, August 25\n* Died at Kings Daughter's Hospital, August 30\n* Wrote sketch of Mayo's life \"Sketch of the Live of John CC Mayo.\"\n* Wrote autobiography; reprinted in 2008 with consultation of grandson\n* Awarded Governor's Medallion for Distinguished Service in 1957 by Governor Chandler\n* Oil portrait hangs in the Kentucky State Treasury office. When unveiled in 1953, comments were made by Governor Lawrence Wetherby:\n\"I know of no person who has rendered greater service to Kentucky than Mr. Buckingham. The example he set as a public servant could be used by all of us and all those who follow in public office.\"\nBuckingham Avenue in Van Lear, Kentucky, is named after him. Buckingham Mountain, which separates Beaver Creek, is also named for him.\nReferences"
    }
  ]
}