{
  "content": [
    {
      "type": "text",
      "text": "# Draft:Battle of Adoni (1366)\n\n| date              = 20 July 1366\n| result            = Bahmani victory\n| combatant1        = Bahmani Kingdom\n| combatant2        = Vijayanagara Empire\n| commander1        =\n*Isa Khan}}\n| commander2        = }}\n| strength1         = 65,000• 50,000 infantry• 15,000 cavalry\n| strength2         = 540,000• 500,000 infantry• 40,000 cavalry\n| map_type          = India\n| map_relief        = yes\n| map_size          = 280px\n| map_marksize      =\n| map_caption       = Location of the battle within India\n| map_label         = Kauthal\n}}\nThe Battle of Adoni, also known as the Battle of Kauthal, took place on 20 July 1366 between the Bahmani Kingdom and the Vijayanagara Empire. The battle is notable for being the first time firearms were used in battle in India.\nBackground\nPrelude\nUpon reaching the fort of Adoni, Bukka immediately began preparing for war. He dispatched his general Mallinatha to confront the Bahmanis.\nBattle\nMohammed Shah crossed the Tungabhadra River and reached Siruguppa with around 50,000 infantry and 15,000 cavalry. Meanwhile, Mallinatha commanded around 500,000 infantry and 40,000 cavalry.\nOn 20 July, Mohammed Shah put his general Isa Khan in charge of the left flank, while Khan Muhammad, also known as Musa Khan, commanded the center. During the fighting, Isa Khan and Musa Khan were killed by musket balls. After the deaths of the two Bahmani generals, it seemed that the Bahmani army was about to retreat. However, Mohammed Shah arrived with a crucial reinforcement of 3,000 cavalry, turning the battle in favor of the Bahmanis. Khan Muhammad's elephant, named Sher-i Shikar, charged at Mallinatha, mortally wounding him. After his death, the Vijayanagara forces retreated.\nAftermath\nAfter the battle, Bukka Raya was forced to start the retreat back to the capital, as starting another pitched battle with the Bahmanis would have cut him off from the capital. Bukka was forced to retreat via the woods, as the main roads were blocked by refugees and the Bahmanis. Mohammed Shah closely followed Bukka for 3 months, and laid siege to Vijayanagara.\nFor a month, the city was under siege, but Mohammed Shah was unable to capture it. Bukka Raya marched out of the city and engaged in battle, but was defeated and retreated back to the capital. Mohammed Shah, realizing this victory could not end the war, ravaged the countryside until Bukka Raya agreed to a peace treaty. The region's population did not fully recover for decades.\nReferences"
    }
  ]
}