{
  "content": [
    {
      "type": "text",
      "text": "# Draft:J. C. H. King\n\nJonathan Colin Harmsworth King\nJ C H King is a British anthropologist, museum curator, and author.  As Keeper of Anthropology for the British Museum he focused on Native North American ethnography and history of museum collections.. During his tenure he supported the British Museum’s first returns of cultural artifacts to Native American and First Nations communities\nCareer\nIn 1973 King joined the British Museum as their first dedicated curator of North America. He started in Department of Ethnography, and later Africa, Oceania & the Americas, where he specialized in Indigenous North American collections. In 2005, he was made Keeper of Africa, Oceania and the Americas and later became the Keeper of Anthropology in 2010. Over his career spanning 40 years he has been responsible for curating many  exhibitions, including the human image exhibition, which in 2000 was opened by Queen Elizabeth II as part of the newly refurbished Great court.\nHe was appointed the first Von Hügel Fellow at the University of Cambridge’s Museum of Archaeology & Anthropology in 2012.\nKing is also a fellow of the Royal Anthropological Institute and a member of the scientific committee for the Fondation culturelle Musée Barbier-Mueller, a member of council for the Hakluyt Society and on the advisory board for the Bill Reid Foundation. He was a Governor and is currently a trustee of the Dr. Johnson’s House Trust\nRepatriation of cultural objects\nKing has spoken and written about the complexities of repatriation of cultural objects, particularly from the perspective of museums. He advocates for museums as custodians rather than owners, by providing alternatives to outright repatriation, such as long-term loans, co-curated exhibitions, and other forms of cultural interaction\nKing was a key collaborator in efforts to return many objects to their source communities. Notable examples include:\n- A Kwakwaka’wakw mask was sent on long term loan to Alert Bay, British Columbia (2005) the mask was seized during a 1921 potlatch ceremony and later acquired by the British Museum. This return was the result of collaborative discussions between the U'mista Cultural Centre and the British Museum, signifying one of the earliest repatriations of cultural artifacts from the British Museum\n- Tasmanian human remains were returned home to their aboriginal community (2006). The returned human remains included ash bundles and skeletal fragments from the Tasmanian Aboriginal community. These remains were repatriated following requests from the Tasmanian Aboriginal Centre (TAC), supported by the Australian government, and were returned with the understanding they would be cremated in accordance with Aboriginal beliefs. The return of these remains sparked discussions about cultural sensitivity and the relevance of repatriating objects on scientific research\n- Maori human remains were repatriated to New Zealand (2008) By 2008 repatriation was becoming more common and several institutions, including the British museum, repatriated Maori human remains to New Zealand's Te Papa Tongarewa museum. These included tattooed heads, known as Toi moko, and bone fragments. This was part of an ongoing effort to return ancestral remains to their homeland for proper burial and cultural reburial\nThese repatriations marked a significant policy shift within the British Museum toward collaborative Indigenous engagement and set a precedent for subsequent returns across the United Kingdom.\nNative North America\nKing is the author of numerous works on Native North America, and understanding the perspectives of the original inhabitants of the United States and Canada: Native Americans, First Nations and Arctic peoples. His works remain a key reference for scholars in ethnohistory, museum studies, and Indigenous studies. Some of his most notable publications include:\n* Smoking Pipes of the North American Indians (1977): explores smoking practices and the significance of pipes across various North American cultures\n* First Peoples, First Contacts: Native Peoples of North America (1999):  this book looks at the complex relationship between indigenous peoples and European settlers, spanning early encounters to more recent history\n* Blood and Land: Native North America and the United States (2016): re-examines the importance, resilience and revival of Native nations in North America. Described by the evening standard as a “panoramic portrait of the spirit of the Cherokee that shaped America’s engagement with the world”.\nEarly life and education\nJonathan Harmsworth King was educated at Eton College and St John’s College Cambridge where he received an exhibition to study archaeology and anthropology.\nPublications\n1977. Smoking Pipes of the North American Indians. British Museum Publications\n1979. Portrait Masks from the Northwest Coast of America. Thames and Hudson\n1981. Artificial Curiosities from the Northwest Coast of America\n1982. Thunderbird and Lightning. Indian Life in Northeastern North America 1600-1900. British Museum Publications\n1989. Living Arctic: Report and Catalogue. Trustees of the British Museum and Indigenous Survival International\n1992. With M. L. Wayman and P . T . Craddock: 'Aspects of Early North American Metallurgy'. British Museum OccasionalPaper 79, London\n1998. Imaging the Arctic. [ed. with Henrietta Lidchi] British Museum Press. British Museum Press. [and Seattle:University of Washington Press]\n1999. First Peoples, First Contacts. Native Peoples of North America. London: British Museum Press and Cambridge:Harvard.\n2000. Human Image [ed.]. British Museum Press.\n2002. With W . Wood, eds. Ákaitapiiwa. Ancestors. Lethbridge, Alberta: Sir Alexander Galt Museum & Archives.\n2004. Irish American Trade. Native American Art. The Stonyhurst Mullanphy Collection. London: Trustees of the British Museum.\n2005. Arctic Clothing. London: British Museum Press, ed. with B. Pauksztat and R.Storrie. [Winner of best textile book, Abel Award, Textile Society of America (NY) 2006]\n2006. jointly ed. Provenance. Twelve Collectors of Ethnographic Art in England 1760-1990 (with Hermione Waterfield). Paris: Somogy.\n2007. jointly ed ‘Three Centuries of Woodlands Indian Art’ ERNAS Monographs 3, Vienna: ZKF Publishers.\n2009. jointly ed Provenance. Twelve Collectors of Ethnographic Art in England 1760-1990. London: Paul Holberton 2nd edition.\n2012. jointly ed. Extreme Collecting. Challenging Practices for 21st Century Museums . Oxford: Berghahn.\n2012. jointly ed. Turquoise. History science and culture in Mexico and North America. London: Archetype\n2016. Blood and Land: The Story of Native North America. London, Penguin\nReferences"
    }
  ]
}