{
  "content": [
    {
      "type": "text",
      "text": "# Drake (Plymouth ward)\n\n|area_total_km2           = 0.849\n|elevation_footnotes    =   tags-->\n|elevation_m            =\n|elevation_ft           =\n|elevation_max_m            =\n|elevation_max_ft           =\n|elevation_min_m            =\n|elevation_min_ft           =\n|population_as_of               =2001\n|population_footnotes           =\n|population_note                =\n|population_total               =8831\n|population_est                 =\n|pop_est_as_of                  =\n|population_density_km2         = auto\n|population_density_sq_mi       =\n|timezone1               =\n|utc_offset1             =\n|timezone1_DST           =\n|utc_offset1_DST         =\n|coor_pinpoint          = North Hill Church\n|coordinates            =\n|postal_code_type       =  Postcode\n|postal_code            = PL4\n|area_code              =\n|website                =\n|footnotes              =\n}}\nDrake is an election ward within Plymouth, Devon, England. One of the main roads from the city to Tavistock and Dartmoor runs through the ward. In the past it played an important role in the supply of water to Plymouth, and it was the location of both a fatal bomb explosion and a large unexploded bomb during the Plymouth Blitz. The University of Plymouth has its main campus in this ward and the large student population has led to part of it being designated as one of the four areas subject to Designated Public Places Orders in the city. It is also the location of the city's main railway station, museum and public library.\nHistory\nIn 1591, Drake's Leat first supplied water to Plymouth. Its route came through what is now Drake ward, but was at the time outside the town walls. When Sir Francis Drake constructed the leat he ensured that he held the rights to build mills on it. At least two of those mills were within this ward; the site of the higher one was converted to a reservoir in the late 19th century and is now known as Drake's Place Reservoirs.\nIn common with much of the city, many buildings in this ward were destroyed or damaged during the Plymouth Blitz of World War II. In one fatal incident, on the night of 22 April 1941, a bomb fell on the Portland Square air-raid shelter killing over 70 civilians, including a mother and her six children.  Human remains were found in the tops of trees, as a result of the bomb blast. In 2006 part of the remains of the shelter were rediscovered on the university campus, and an appeal was made to raise money for a public sculpture to honour those who lost their lives. This is now the Portland Square memorial.\nAnother, non-fatal, incident occurred during a short sharp air raid on 14 June 1943. A 1,000&nbsp;kg bomb came through the roof of the then main police headquarters in Greenbank Road, on the eastern edge of the ward. The bomb did not explode and came to rest on the first floor landing outside the court rooms and above the cells and the control room, both of which were occupied. There were also many police in the building at the time. The headquarters had to be evacuated for several days until this bomb and another that had landed in the adjoining building were made safe and removed.\nAfter the Blitz, in 1943 a \"Plan for Plymouth\" was drawn up for redesigning the city. In that plan the part of Drake ward to the west of the Tavistock road was designated as the cultural precinct, and it was suggested that any extension of the Museum and Art Gallery should be there, as well as a new Technical College, centralized buildings of political and social organizations, youth organizations, a Health Centre, and headquarters and studios for the BBC. This aspect of the Plan was only partially fulfilled.\nGeography and transport\nDrake ward is the smallest in area of the 20 wards in the city and is surrounded (clockwise from the north) by the wards of Compton, Efford and Lipson, Sutton and Mount Gould, St Peter and the Waterfront, Stoke, and Peverell. Its northern border is in the suburb of Mutley and it also forms the southern boundary of Ford Park Cemetery and part of Central Park.\nThe ward is roughly bisected by the main road to the town of Tavistock, the upper part called North Hill and the lower part, a short stretch of dual-carriageway, named Drake Circus after a former roundabout built in the early 20th century just beyond the ward's southern boundary. That site is now the location of Drake Circus Shopping Centre, opened in 2006.\nThe city's main railway station is at the western end of the ward.\nDemography and governance\nThe ward is within the Plymouth Sutton parliamentary constituency and has an electorate (voting population) of 5,391. At the 2001 census the population of the ward was 8,831, of which 3,695 (42%) were full-time students aged 18 or over. The population of the ward had increased to 11,149 at the 2011 census. Over 43% of the accommodation was rented from private landlords or letting agencies.\nThe North Hill area of Drake ward is one of four areas of Plymouth that are subject to a Designated Public Places Order which prohibits the consumption of alcohol in designated public places. In 2007 there were 13 licensed premises on North Hill.\nDrake ward was in the news in 2001 when one of its councillors resigned from the Conservative Party to defect to the Liberal Democrats. This was especially notable as the councillor, Karen Gillard, was the national chair of TORCHE, the Tory Campaign for Homosexual Equality.\nEconomy\nThe largest employer by far is the University of Plymouth which has its main campus in the ward. The university educates over 30,000 students, employs 3,000 staff and has an annual income of around £160 million. The ward contains the Plymouth railway station, which is an important economical structure for the economy of Plymouth. Drake is in close proximity to the city centre of Plymouth and the Drake Circus Shopping Centre.\nLandmarks\nThe university's most prominent building is the Roland Levinsky Building, clad in copper and completed in 2007. On the opposite side of Drake Circus, the road, is Plymouth City Museum and Art Gallery and the adjoining Central Library, built in 1907 by Thornely and Rooke in Edwardian Baroque style.\nHigher up North Hill are Sherwell United Reformed Church (1864) and St Matthias Church (1887). The former's spire and the latter's tower are both prominent elements on the city's skyline. Until 1990, Sherwell Church had an organ commissioned from Henry Willis in 1864; the organ is now in St Michael's Church, Great Torrington. At the northern end of North Hill is the Plymouth Proprietary Library, notable for being the city's oldest surviving collection of books and papers, established in 1811.\nDrake's Place Reservoirs, constructed in the 1820s, are in North Hill just above Sherwell Church. They were expanded in 1891 and a 200&nbsp;ft colonnade with a terrace on top was added so that people could relax by the water. The pillars of the colonnade were originally from The Shambles (butchers' stalls outside St Andrew's church) and from 1791 were re-used in the market before being relocated here. In August 2010, a grant of £500,000 was awarded by the National Lottery towards the preservation of the landmark.\nPlymouth Royal Eye Infirmary, near the main railway station, was built in 1897 by Charles King and E. W. Lister. Unusually for an area that had a tradition of building in limestone, it was constructed in red brick with stone facings.\nSee also\n*List of wards in Plymouth\nReferences\nExternal links\n*[http://neighbourhood.statistics.gov.uk/dissemination/LeadAreaMetadata.do?a=7&b=6073851&c=PL1+2EW&d=13&e=1&g=401278&i=1x1003x1004&m=0&r=0&s=1228980816890&enc=1&areaId=6073851 Area covered by the ward]"
    }
  ]
}