{
  "content": [
    {
      "type": "text",
      "text": "# Dreaming of a Freaking Fairy Tale\n\n| image              = Dreaming of a Freaking Fairy Tale poster.png\n| image_alt          =\n| caption            = Promotional poster\n| native_name        =\n| genre              = Romantic comedy\n| creator            = Baek Mi-kyung\n| writer             = Yoo Ja\n| director           = Kim Min-kyung\n| starring           =\n| music              = Im Ha-young\n| open_theme         =\n| end_theme          =\n| country            = South Korea\n| language           = Korean\n| num_episodes       = 10\n| list_episodes      =\n| executive_producer = )\n* Oh Seung-joon\n}}\n| producer           =\n| cinematography     =\n| editor             =\n| runtime            = 43–45 minutes\n| company            =\n| budget             =\n| network            = TVING\n| first_aired        =\n| last_aired         =\n}}\nDreaming of a Freaking Fairy Tale () is a 2024 South Korean romantic comedy television series created by Baek Mi-kyung, written by Yoo Ja, directed by Kim Min-kyung, and starring Pyo Ye-jin and Lee Jun-young. The series portray a 21st-century Cinderella who climbs on a white horse and overcomes the world and its limitations. It was released on TVING from May 31, to June 28, 2024, every Friday at 12:00 (KST). It is also available for streaming on Viu and Paramount+ in selected regions.\nSynopsis\nDreaming of a Freaking Fairy Tale is a hybrid romantic comedy drama depicting the process in which a woman whose dream is to become a Cinderella meets a prince on a white horse who does not believe in love. Both support and torment each other due to the reality that is difficult to escape.\nCast and characters\nMain\n* Pyo Ye-jin as Shin Jae-rim\n: A person who gets a job as a manager of Cheongdam Heaven, a social club because she wants to find prince on a white horse. However, she is a 21st-century Cinderella who gradually overcomes the past of depending on someone and longing for love, and gradually becomes stronger to accept her life and win love independently.\n* Lee Jun-young as Moon Cha-min\n: The head of Cheongdam Heaven, a social club and an arrogant prince of a chaebol family who does not trust people. He hates women who dreams of being Cinderella but realizes his feelings when he becomes entangled with Jae-rim.\nSupporting\n* Kim Hyun-jin as Baek Do-hong\n: A self-made 10-million movie director who has a secret.\n*  as Kang Soo-jin\n: An obstetrician and gynecologist and the eldest daughter who protects her mother and younger siblings.\n* Song Ji-woo as Ban Dan-ah\n: A lawless princess who pursues elegance.\n* Lee Da-hye\n* Do Byeong-hun as Heo Young-bae\n: A social club manager and Cha-min's secretary at Cheongdam Heaven.\n* Ryu Seung-soo as Jae-rim's father\n* Baek Joo-hee as Hwang So-ra\n: Jae-rim's stepmother.\n* Ahn Hyun-jeong as Yang Se-ri\n: a hipster waitress at Cheongdam Heaven who thinks she's pretty but has nothing to prove but her age.\nSpecial Appearance\n* Jang Hyuik-jin as Choi gyeong-ku\nProduction\nDevelopment\nWriter Baek Mi-kyung, who wrote dramas such as Strong Girl Bong-soon (2017), The Lady in Dignity (2017) and Mine (2021), created Dreaming of a Freaking Fairy Tale under the working title She Dreams of Cinderella () as her next work and Yoo Ja wrote the script of the series. KeyEast and Story Phoenix signed a production contract and joined Baek to produce the series.\nCasting\nKim Ji-eun was first offered the role of the female lead in June 2023. Later in September of the same year, Pyo Ye-jin was reported to star for the series. The next three days, Lee Jun-young was offered to lead alongside Pyo. Pyo and Lee appearances were officially confirmed a week later.\nOriginal soundtrack\nPart 1\n| extra1       = Kei\n| length1      = 3:29\n| title2       = Falling\n| note2        = ;\n| length2      = 3:29\n| total_length = 6:58\n}}\nPart 2\n| extra1       = Soovi\n| length1      = 3:10\n| title2       = BBDBBDB\n| note2        = ;\n| length2      = 3:10\n| total_length = 6:20\n}}\nPart 3\n| length1      = 2:52\n| title2       = Gist\n| note2        = ;\n| length2      = 2:52\n| total_length = 5:44\n}}\nPart 4\n| length1      = 4:09\n| title2       = Star\n| note2        = ;\n| length2      = 4:09\n| total_length = 8:18\n}}\nPart 5\n| extra1       = Charlie Bean Works\n| length1      = 3:48\n| title2       = Intersection\n| note2        = ;\n| length2      = 3:48\n| total_length = 7:36\n}}\nRelease\nThe series was confirmed to be released on TVING in 2024. It will also stream on Paramount+ as part of Paramount's global partnership with leading entertainment company CJ ENM. The series was also reported sold to Viu, in the case where Paramount+ was currently unavailable in Southeast Asian markets. It was confirmed that the series would be release on May 31, 2024.\nReferences\nExternal links\n*\n*\n*"
    }
  ]
}