{
  "content": [
    {
      "type": "text",
      "text": "# Drinking the Kool-Aid (Veronica Mars)\n\n| guests         = * Jonathan Bennett as Casey Gant\n*Amy Laughlin as Holly Mills\n* Chris William Martin as Josh\n* Megalyn Echikunwoke as Debbie Meyer/Rain\n* Albie Selznick as Bill Gant\n* Christopher B. Duncan as Clarence Wiedman\n| prev           = Like a Virgin\n| next           = An Echolls Family Christmas\n| season_article = Veronica Mars season 1\n| episode_list   = List of Veronica Mars episodes\n}}\n\"Drinking the Kool-Aid\" is the ninth episode of the first season of the American mystery television series Veronica Mars. The episode's teleplay was written by Russell Smith, from a story by series creator Rob Thomas, and was directed by Marcos Siega, the episode premiered on UPN on November 30, 2004.\nThe series depicts the adventures of Veronica Mars (Kristen Bell) as she deals with life as a high school student while moonlighting as a private detective. In this episode, Veronica investigates the mysterious cult of which Casey, another student, is part, the Moon Calf Collective. Meanwhile, Veronica deals with the aftermath of the realization that Jake Kane (Kyle Secor) is likely her biological father.\nSynopsis\nPicking up from where the events of the last episode left off, Veronica muses about Jake Kane possibly being her father. Veronica looks at the photos that a mysterious person took of her, and she believes that Jake Kane took the photos. Eventually, Veronica finds out that a man named Clarence Wiedman (Christopher B. Duncan) took the photos of her. She follows him to the Kane business building, where she finds that he's the head of security at the company. The next day, Keith (Enrico Colantoni) talks to a couple, who tell him about their son, Casey (Jonathan Bennett), who has joined a cult. Even though Veronica decries the boy as irresponsible, Veronica agrees to help with the case to help her father earn the $5,000 the case will be paying. Meanwhile, Veronica sends a DNA paternity test off in the mail. Veronica talks to Casey's ex-girlfriend, who tells him that Casey may be having an affair with an English teacher, Ms. Mills (Amy Laughlin). Veronica decides to write some poetry in order to \"get into the lit-mag crowd\". Later, Veronica talks to Ms. Mills, who tells her that she wants her to join the Moon Calf Collective, the cult of which Casey is part.\nAt the Moon Calf Collective, we see Ms. Mills kissing another man. At the same time, a variety of people hit on Veronica, implying some sort of polygamy. Eventually, Veronica gets stuck with milking a cow, and begins talking to one of the younger members, Rain (Megalyn Echikunwoke) in order to get information. The woman tells Veronica that they are growing a major \"cash crop\". At a meeting, the other members ask for Veronica to read her poem, but she quickly leaves to enter the barn which was previously mentioned as forbidden. In there, she finds an aggressive horse. Casey invites her back to the cult, and she goes. Veronica goes on a walk with the cult leader, but also puts a record tape on in her bag. It turns out that the \"ultimate cash crop\" is flowers. However, Keith later goes undercover as a repairman into the compound and sees Veronica. Later, Keith and Veronica have a debate, which ends in Veronica being banned from the case. At that moment, Casey's parents return to Mars Investigations. They tell him that his brain dead grandmother has left him $80 million in her will and ask Keith to quickly finish the case and find evidence that will close down the cult. They also introduce a fringe \"deprogrammer\" who will deal with Casey and return him to \"normal\" if Keith fails.  The next day, Veronica talks to Wallace (Percy Daggs III), who tells her that she may be becoming sympathetic to the cult.\nCasey takes Veronica to the bed of his grandmother. On a carton of milk, Veronica sees a missing ad for Rain. Keith wants to investigate further against the Collective for the money, but Veronica disagrees with him. The next day, Veronica is about to tell Ms. Mills about her investigations before Casey bursts in saying that his grandmother has died. Later, at Casey's grandmother's funeral, Veronica sees Casey being kidnapped by his parents and the fringe psychologist. Keith tells Veronica that he has dropped the investigation, accepting that the cult is harmless. Keith also reports that Debbie Meyer (Rain) has had a difficult life and is better off with the cult. Veronica sees Casey several days later, who apparently has been successfully \"deprogrammed\" and arrogantly flaunts his newfound wealth.  That night, Veronica receives the results of the DNA test. After musing on the possibility that the test could prove she is a heiress to the Kane empire, Veronica decides to shred the document in a befuddled Keith's presence before reading it.\nCultural references\nA variety of pop culture references are made in the episode:\n*Keith says \"Chicks dig scars,\" a reference to the 2000 film The Replacements.\n*Veronica mentions that she used to want to marry Vanilla Ice and gather a massive collection of Zbots.\n*Wallace refers to the game Hacky Sack.\n*Veronica states that all she knows about rural life is from watching Dr. Quinn, Medicine Woman.\n*Keith compares the Moon Calf Collective to watching The Brady Bunch.\n*Veronica uses the word \"Yahtzee!\" as an expression of excitement.\n*Veronica references Gone With The Wind when she says, \"As God is my witness, I'll never take cold showers again!\", a play on Scarlett O'Hara's proclamation, \"As God is my witness, I'll never be hungry again!\"\nMusic\nThe following music can be heard in the episode:\n*\"Make a Deal with the City\" by East River Pipe\n*\"Oh! Sweet Nuthin\" by The Velvet Underground (sung around the campfire at the Moon Calf Collective)\n*\"(You Gotta Walk) Don't Look Back\" by Peter Tosh and Mick Jagger\n*\"Have a Nice Day\" by Stereophonics\n*\"Famous Lover\" by The Fire Marshals of Bethlehem\nProduction\nBeginning with this episode, Sydney Tamiia Poitier, who portrayed Mallory Dent, is no longer credited in the opening credits. In addition, Jason Dohring, who plays Logan Echolls, does not appear in \"Drinking the Kool-Aid.\" The scars shown on actor Enrico Colantoni's face during the episode actually existed due to the actor playing ice hockey in real life. The episode's title refers to the phrase, \"Drinking the Kool-Aid\", which refers to uncritical obedience. The phrase has its origins in the 1978 Jonestown deaths, which killed 909 followers, many of whom were children, of the Peoples Temple cult, headed by Jim Jones. These followers, urged on by Jones, who termed it \"revolutionary suicide,\" killed themselves knowingly by drinking Flavor Aid laced with cyanide, although most of these followers did so under threat of worse violence or because they believed they had no choice.\nReception\nRatings\nIn its original broadcast, the episode received 2.40 million viewers, ranking 101 of 108 in the weekly rankings and marking a significant drop in viewers.\nReviews\nIn a positive review, Rowan Kaiser of The A.V. Club wrote that \"In tonight's episode, we get a cult, which is a TV staple of evil ever since the 1990s…Of course, here on Veronica Mars, the twist is that, like Meg, the happy cult is exactly what it appears to be.\" Television Without Pity gave the episode a \"B\".\nHowever, some reviews were not so positive. Price Peterson, writing for TV.com, wrote in his verdict that \"I was pretty uncomfortable with this episode's unsettling pro-cult stance.\" But the reviewer also stated that \"[he] appreciated the unexpected twist.\" BuzzFeed ranked the episode third-to-last on its ranking of all Veronica Mars episodes, calling the episode \"disappointing.\"\nReferences\nExternal links\n*[http://marsinvestigations.net/episodes.php?id=109&title=drinking_the_kool_aid \"Drinking the Kool-Aid\"] at Mars Investigations\n*"
    }
  ]
}