{
  "content": [
    {
      "type": "text",
      "text": "# Drinking from shoes\n\nin 1951 was on the cover of a scandal magazine in the exhibition of the event.]]\n, dating to late 16th-century Germany]]\nDrinking from a shoe has historically been performed as both a bringer of good fortune, a hazing punishment, or a party piece. Drinking champagne from a lady's slipper became a symbol of decadence in the early 20th century. The practice remains particularly popular in Australia, where it is called (doing) a \"shoey\".\nSlipper champagne\nIn the 20th century, the act of drinking champagne from a lady's slipper became a shorthand for decadence and sophistication. The practice is thought to have originated in 1902 at the Everleigh Club, a high-class brothel in Chicago. When a dancer's slipper fell to the floor, a member of Prince Henry of Prussia's entourage picked it up and used it to drink champagne.\nMilitary traditions\n'']]\nDrinking from another soldier's boot was a traditional hazing ritual in the German army, and soldiers drank from the general's boot after a victory. During World War I, German soldiers were said to pass around a leather boot filled with beer, to bring good luck before a battle. The drinkers would flick the boot before and after taking a drink from it. The idea that drinking from a shoe or boot can bring good fortune dates back to the Middle Ages.\nThe German Bierstiefel is a boot-shaped beer glass said to have been created by a Prussian general in an unnamed war who promised his troops that if they were victorious in an upcoming battle, he would drink beer from his own boot. After they won the battle the general had second thoughts, and instead ordered a glass imitation to be made.\nShoey\nand Daniel Ricciardo performing a \"shoey\" at the 2017 Canadian Grand Prix.]]\nThe shoey is particularly popular in Australia. The drinker either removes their own shoe, or nominates a friend's shoe to be used as the vessel. The shoe is tilted and the entire contents of a can of beer are poured into the shoe's opening. Once the beverage has settled, the beer is drunk by tipping the shoe up to the mouth and chugging it. The drink most commonly used for a shoey is beer; however, other alcoholic beverages (such as champagne) are also used. Australian Formula One racer Daniel Ricciardo has said: \"If the sparkling wine is cold, then it tastes good. If it's warm then you might get the sweat through it but the cold taste kills the bad stuff... so it's delicious.\"\nAncient traditions\nSeveral ancient Islamic hadiths depict people offering water to animals in their shoes. One medieval Ethiopian story depicts the Virgin Mary kindly offering water to a thirsty dog in her shoe.\nReferences"
    }
  ]
}