{
  "content": [
    {
      "type": "text",
      "text": "# Drive on Stalingrad: Battle for Southern Russia Game\n\n: Battle for Southern Russia Game (also published as Drive on Stalingrad: Road to Ruin – The German 1942 Summer Offensive) is a board wargame originally published by Simulations Publications, Inc. (SPI) in 1977 that simulates Germany's 1942 campaign in Russia during the Second World War.\nContents\nDrive on Stalingrad: Battle for Southern Russia Game is a two-person game that simulates combat between German and Russian forces in 1942. The rules are based on those developed for a previous SPI wargame, Panzergruppe Guderian, with additional rules for rail movement, Soviet strategic movement, trucks and supply chains, untried units, air supply, and tactical air units. In addition, at the start of every turn, the German player receives a random \"Hitler Directive\", which may unexpectedly change the player's entire operational strategy for the turn by placing demands and restrictions on the player.\nComponents\nThe SPI edition of this game, packaged in either a flat plastic  box with integral counter trays and covers, or a standard-sized bookcase box, contains the following:\n* Two  hexagonal grid paper maps\n* 600 double-sided  die-cut Counters\n* Rulebook\n* Game Turn Record/Reinforcement Track\n* A double-sided sheet of various tables\n* Errata sheet (included in the game after May 1978)\n* A six-sided die\nGameplay\nThe German player starts each turn by getting a random result from the \"Hitler Directive\" table, and then has the following actions:\n# Initial movement phase\n# Combat phase\n# Mechanized/cavalry movement phase\n# Disruption removal phase\n# Air interdiction phase\nThe Soviet player then gets the same five phases of operations. This completes one turn.\nVictory conditions\nThe game lasts for 25 turns, with a time scale of 1 week per turn. Victory points are awarded for cities captured and held, and losses inflicted on the other side. The player with the most victory points at the end of 25 turns is the winner.\nPublication history\nIn 1976, SPI published Panzergruppe Guderian, a wargame simulating the 1941 World War II Battle of Smolensk that featured rules that combined both infantry and tank combat. Brad Hessel used those rules as the basis for Drive on Stalingrad, which was published by SPI in 1977. Players immediately complained that the game was always an easy win for the Russian player, and in May 1978, an errata sheet was added to the game to provide more balance.\nIn the early 1980s, SPI ran into financial difficulties, and was taken over by TSR in 1983. Looking to quickly make back some of the money, TSR released a combination of new SPI properties that had been close to publication before the takeover such as Battle Over Britain and A Gleam of Bayonets: The Battle of Antietam, and re-issues of popular SPI titles from the 1970s such as Blue & Gray: Four American Civil War Battles and Drive on Stalingrad.\nIn 2002, Decision Games acquired the rights to Drive on Stalingrad and published a game with rules redesigned by Ty Bomba.\nReception\nIn his 1977 book The Comprehensive Guide to Board Wargaming, Nick Palmer noted the additional complications caused by rules for untried units, as well as the shifting objectives for the German player.\nIn Issue 14 of Phoenix, Chris Bramwell pointed out that Drive on Stalingrad differed significantly from its predecessor Panzergruppe Guderian (1976) with the addition of air rules and especially political considerations — \"The Hitler Directive\" — which he called \"the cornerstone of the game.\"\nIn Issue 27 of the British wargaming magazine Perfidious Albion, Miles Robertson commented, \"From an artistic and physical quality point of view the game is terrific.\" But Robertson found that \"the game was turned into a total farce by certain rules which we fail to see the logic behind.\" Robertson went at length to highlight these rules, and then concluded, \"Drive on Stalingrad, if one applies common sense to [the questionable rules], for my money might be the game of '78.\" Several issues later, Bill Parsons criticized the game for re-using the rules from Panzergruppe Guderian, arguing that the military situations simulated in the two games were vastly different — in Panzergruppe Guderian, during the first days of the German invasion, Russian forces were weak and divided. By the time of Drive on Stalingrad, Soviet forces were much stronger and more coordinated, and Parson felt the rules should have been modified to recognize this.\nIn Issue No. 49 of Moves, Ronald P. Hamm noted that the inherited rules from Panzergruppe Guderian \"works extremely well for 1939–1942 armored actions and it proves that fact again with DOS.\" Hamm was glad he waited until errata was published with the game, noting \"I did not have the unfortunate task of playing DOS when it was unbalanced drastically towards the Soviets. I am glad that I waited, because the game (like the real campaign itself) is now finely balanced.\" He concluded with a strong recommendation, saying \"Drive on Stalingrad is an excellent operational level simulation of the German 1942 summer offensive in Russia.\" In the next issue, Steve List concurred, writing, \"As originally released, the game was badly flawed, due in part to production errors (badly written rules, typos, and the like), but a lot was plain ol' design mistakes.\" List concluded by giving the game a grade of \"B\", saying, \"If you like big games that aren't too big, and which take only a teensy fraction of your lifetime to play, this one should do nicely.\"\nIn Issue 2 of the French games magazine Casus Belli, Frédéric Armand noted, \"The situation presented in Drive on Stalingrad offers both players the same historical opportunities. History repeats itself very easily if certain key decisions are not made at the beginning of the game, and even then, each player must be very strategically rigorous if they don't want to be soundly defeated.\"\nIn The Guide to Simulations/Games for Education and Training, Richard Rydzel thought the game was fatally unbalanced against the Germans, saying, \"The Axis player can only win against an incompetent player.\" He also counselled against using this game in the classroom because of its historical inaccuracies, pointing out that in the game \"The Don River is a fortress that cannot be breached. Stalingrad  never sees any action. [...] This game does not fit well into historical learning situations.\"\nIn Issue 15 of Imagine, Peter O'Toole reviewed the TSR edition and thought \"the game rules are excellent\" and noted in particular the well-balanced rules for supply lines that affect both players. He concluded with a strong recommendation, saying, \"Drive on Stalingrad is an exciting end-to-end struggle with both sides having to use all their skills in both attack and defence.\"\nIn Issue 16 of Breakout!, Peter Newton reviewed the TSR version and commented, \"This re-release is practically identical to the original publication except that it is now boxed. The rule book is unmodified except for some art work and SPI being changed to TSR. It even contains the original typing mistakes!\" Newton concluded, \"If you have always been after a copy of this game, now is your chance to pick it up. For those not familiar with the original, it is a long game that the Russian player should not lose once the potential of the Don River, the Hitler Directives and the vast space of the Steppe have been realized\".\nOther reviews and commentary\n*Fire & Movement #63 (December 1988/January 1989)\n*The Wargamer Vol. 1 #33\n*The Grenadier #28\n*Campaign #105\n*Paper Wars #50\n*Simulations Canada Newsletter #12\nReferences"
    }
  ]
}