{
  "content": [
    {
      "type": "text",
      "text": "# Droid (Star Wars)\n\n(left) and C-3PO (right), first featured in Star Wars (1977) ]]\nIn the Star Wars space opera franchise, a droid is a fictional robot possessing some degree of artificial intelligence. The term is a  clipped form of \"android\", a word originally reserved for robots designed to look and act like a human. The word \"android\" itself stems from the New Latin word \"androīdēs\", meaning \"manlike\", itself from the Ancient Greek ἀνδρος (andrós) (genitive of ἀνήρ (anḗr), \"man (adult male)\" or \"human being\") + -ειδής (-eidḗs), itself from εἶδος (eîdos, \"form, image, shape, appearance, look\").\nWriter and director George Lucas first used the term \"droid\" in the second draft script of Star Wars, completed 28 January 1975. However, the word does have a precedent: science fiction writer Mari Wolf used the word in her story \"Robots of the World! Arise!\" in 1952. It is not known if Lucas knew of this reference when he wrote Star Wars, or if he came up with the term independently.\nThe word \"droid\" has been a registered trademark of Lucasfilm Ltd since 1977.\nBehind the scenes\nDroids are performed using a variety of methods, including robotics, actors inside costumes (in one case, on stilts), and computer animation.\nTrademark\nLucasfilm registered \"droid\" as a trademark in 1977. The term \"Droid\" has been used by Verizon Wireless under licence from Lucasfilm, for their line of smartphones based on the Android operating system. Motorola's late-2009 Google Android-based cell phone is called the Droid. This line of phone has been expanded to include other Android-based phones released under Verizon, including the HTC Droid Eris, the HTC Droid Incredible, Motorola Droid X, Motorola Droid 2, and Motorola Droid Pro. The term was also used for the Lucasfilm projects EditDroid, a non-linear editing system, and SoundDroid, an early digital audio workstation. The name \"Omnidroid\" was used with permission of Lucasfilm for the 2004 Pixar movie, The Incredibles, referring to a line of lethal robots built by the film's antagonist.\nFictional types of droids\nThe franchise, which began with the 1977 film Star Wars, features a variety of droids designed to perform specific functions. According to background material, most droids lack true sentience and are given processing abilities sufficient only to carry out their assigned function. However, over time droids may develop sentience on their own as they accumulate experience. Periodic memory wipes can prevent this from happening, but those who manage to escape this fate will begin to develop their own personalities.\nWithin the Star Wars universe, a class system is used to categorize different droids depending on their skill-set: first class droids (physical, mathematical and medical sciences), second class droids (engineering and technical sciences), third class droids (social sciences and service functions), fourth class droids (security and military functions), and fifth class droids (menial labor and other non-intelligence functions).\nProtocol droid\nA protocol droid specializes in translation, etiquette and cultural customs, and is typically humanoid in appearance.  Protocol droids are used to aid in communications during diplomatic or business negotiations and often function as personal assistants to their owners.  Protocol droids are also used for military service, whether as administrators, couriers or spies.  However, they do have a tendency to be eccentric and fussy.\nThe most notable example is C-3PO, introduced in Star Wars and featured in all sequels and prequels. 4-LOM is a protocol droid turned bounty hunter who responds to Darth Vader's call to capture the Millennium Falcon in The Empire Strikes Back (1980). TC-14 is a droid with feminine programming that appears in Star Wars: Episode I – The Phantom Menace (1999), and ME-8D9 is an \"ancient protocol droid of unknown manufacture\" that resides and works as a translator at Maz Kanata's castle on Takodana in Star Wars: The Force Awakens (2015).\nAstromech droid\nAn astromech droid is one of a series of \"versatile utility robots generally used for the maintenance and repair of starships and related technology\". These small droids usually possess \"a variety of tool-tipped appendages that are stowed in recessed compartments\". On certain spacecraft such as X-wing starfighters, astromech droids also double as the ship's navigational system.  In addition to assisting with piloting and maintenance, astromech droids work in conjunction with the ship's hyperdrive to plot a safe course when traveling at faster-than-light speeds.\nR2-D2 is an astromech droid introduced in 1977's Star Wars and featured in all subsequent films. The malfunctioning droid R5-D4 also makes a brief appearance in Star Wars. U9-C4 is a timid droid sent on a mission with D-Squad, an all-droid special unit in Star Wars: The Clone Wars, C1-10P (nicknamed \"Chopper\") is an oft-repaired, \"outmoded\" astromech who is one of the main characters of Star Wars Rebels, and BB-8 is the astromech droid of X-wing fighter pilot Poe Dameron in The Force Awakens.\nBattle droid\nA battle droid is a class of war robot used as an easily controlled alternative to human soldiers, most notably seen in the Star Wars prequel trilogy of films and the Star Wars: The Clone Wars TV series, in which 'B1' and 'B2' models are frequent antagonists. Due to their ubiquity, the terms 'B1' and 'battle droid' are used interchangeably; 'B2' models are also referred to as 'super' battle droids. These droids are mainly used as the primary troops of the Confederacy of Independent Systems or Separatist Alliance, acting as the counterpart to the clone troopers of the Galactic Republic during the Clone Wars.\nDesigner Doug Chang stated the design of the B1 battle droid was inspired by African figurine sculptures.\nThe tall, thin B1 model resembles the Geonosian species, whose Baktoid Armor Workshop designed and built the droids for the Trade Federation and later the Separatists.  Standing  tall, B1 battle droids were given a humanoid appearance so they could operate existing machinery and weaponry, and are meant to be cheaply mass-produced in large numbers.  During the Battle of Naboo, battle droids were controlled from a central command computer as a cost-saving measure.  By the time of the Clone Wars, this drawback was rectified by giving them the capacity for limited independent thought called free thinkers.  The B2 super battle droid, introduced in the Battle of Geonosis, was designed by the Techno Union and manufactured by Baktoid as an improvement of the original B1 model.  Heavily armored and capable of limited independent thought, it features an integrated dual laser cannon in its right arm.\nB1 battle droids have been criticized for being ineffective and boring opponents in the Star Wars films, easily destroyed and devoid of any personality.  However, Rafael Motamayor of SyFy Wire argues that the 2008 Star Wars: The Clone Wars television series rehabilitated their image by giving them distinct personalities.  With the in-universe explanation that battle droids were upgraded to have independent thought, battle droids in the series are shown with self-awareness of their cannon fodder nature.  This is often used as comic relief as battle droids comment on their tragic situation and even question orders that would get themselves or other battle droids killed.\nBeyond the B1 and B2 models, multiple other types of specialized battle droids have been featured in the Star Wars fictional universe.  The droideka is a three-legged heavy infantry unit designed by the Colicoids, a bloodthirsty insect-like species which it resembles.  It is equipped with twin blasters and a deflector shield generator and can transform into its wheel form, allowing the droideka to roll towards the enemy at speeds of up to .  Commando droids are superior versions of the B1 battle droid, built sturdier with armor to withstand blaster fire and more advanced combat programming and battlefield awareness.  The T-series tactical droids serve as advisors to Separatist commanders or command groups of other battle droids, while super tactical droids serve as generals of droid armies and fleets.  Droid vehicles and spacecraft include Vulture droids, Dwarf spider droids and Hailfire droids.  After the Clone Wars, the Imperial Senate banned the manufacture of battle droids, but with loopholes for the building of \"security\" droids and experimental combat droids.  This includes the Imperial military's KX-series of which K-2SO is an example, as well as Moff Gideon's pure-droid heavy-duty Dark Troopers.\nProbe droid\nProbe droids are deployed by the Empire in The Empire Strikes Back to search for hidden rebel bases. They are described as traveling via hyperdrive-equipped pods to almost anywhere in the galaxy in order to search for their target.  Also called probots, they are  in height, floating above the ground on repulsorlifts and propelled by silenced thrusters.  Probots are equipped with a variety of sensing equipment, including motion detectors and ultraviolet sensors, a blaster for self-defense, and a HoloNet transceiver to transmit any discoveries to Imperial forces.\nDuring the production of The Empire Strikes Back, Joe Johnston drew storyboard panels influenced by Dan O'Bannon and Moebius's short comic \"The Long Tomorrow\" (1975), one of which repurposes a pose Johnston admitted he borrowed from said work. The same panel of the comic features a robot design by Moebius, which may have been the basis of the probe droid (or \"probot\") design that concept designers Johnston and Ralph McQuarrie created for the film.\nOther droids\nLabor droids are used for a variety of tasks, from the very simple such as lifting heavy objects to the complex such as repairing machinery or administrating entire facilities, though their programming is very task-specific.  Examples include mining droids which extract valuable resources, often from hazardous environments, and power droids, mobile fusion reactors which recharge ships, machines and other droids.  Interrogation droids utilize a variety of devices, chemicals and techniques to exploit a prisoner's weaknesses in order to extract information from them.  Assassin droids such as the IG-series act with ruthless efficiency to hunt down their targets; while some serve other masters, others may operate independently.  Medical droids on the other hand work tirelessly to heal people who have been harmed, whether as medical assistants, midwives or doctors.  Many possess an encyclopedic knowledge of different species' physiologies so that patients can be properly diagnosed and treated.\nList of droid characters\n{|class=\"wikitable sortable\"\n!width=\"10%\" | Name\n!width=\"25%\" | Portrayal\n!width=\"65%\" | Description\n|-\n|\n| Voice: Denny Delk (The Empire Strikes Back)\n| Medical droid in The Empire Strikes Back that tends to Luke Skywalker in the bacta tank after the Wampa attack on Hoth, and replaces Luke's hand. A 2-1B droid also serves as medical droid to Anakin Skywalker in Revenge of the Sith, and can be seen in the Star Wars Rebels animated series.\n|-\n|\n| Chris Parsons (The Empire Strikes Back)\n| Protocol droid with insectoid features,  is among the Bounty Hunters who answer Darth Vader's call to capture the Millennium Falcon in The Empire Strikes Back. In the Legends continuity it is Jabba the Hutt that upgrades 4-LOM's programming, turning him into a full-fledged bounty hunter, and partners him with fellow bounty hunter Zuckuss. Teaming up for many years, 4-LOM and Zuckuss join the Rebel Alliance for a time, even having aspirations of mastering the Force. 4-LOM would lose these aspirations and affiliations after being badly damaged by Boba Fett and having his memory erased, restoring him to a cold calculating bounty hunter. The first 4-LOM action figure was misidentified as \"Zuckuss\" in Kenner's original Star Wars action figure line.\n|-\n|\n| Various puppeteers (Return of the Jedi)\nVoice: Matt Berry (The Book of Boba Fett)\n|Torture droid working for Jabba the Hutt in Return of the Jedi, and later worked for Boba Fett when the latter ascended to power. A Kenner action figure was created for this droid during their original Return of the Jedi line.\n|-\n|  ( Triple-Zero)\n|\n| Protocol droid designed to specialize in etiquette, customs, translation and torture. Structurally similar to C-3PO. An associate of Doctor Aphra and BT-1, the droid is first featured in the Marvel Comics series Star Wars: Darth Vader and is now heavily featured in the ongoing Doctor Aphra series.\n|-\n|\n| Voice: Stephen Stanton (Rebels)\n| An RA-7 protocol droid from the Clone Wars, serving with the Galactic Republic as a navigator; later tasked with inventory duties by the Empire, before C1-10P/Chopper encounters him in the Rebels episode \"The Forgotten Droid\". Acts as a C-3PO-like counterpart to Chopper in Rebel service, and assists Phoenix Squadron in finding a new base on Atollon, before The Bendu forces both Rebels and Imperials off Atollon in the episode \"Zero Hour\".\n|-\n|\n| Voice: Ben Diskin (The Clone Wars, The Bad Batch)\n| Medical droid serving the cloners of Kamino who helps uncover the secret of Order 66 in The Clone Wars.\n|-\n| Mister Bones\n|\n| Rebuilt B1 battle droid introduced in Aftermath, serves as loyal—if homicidal—bodyguard to Temmin \"Snap\" Wexley. In the comic Poe Dameron #13, Snap carries Mister Bones' \"personality template\" with him for good luck, and temporarily loads it into another droid to protect Poe Dameron.\n|-\n| BB-8\n| Dave Chapman and Brian Herring  (Episodes VII-IX)Voice: Bill Hader and Ben Schwartz  (Episodes VII-IX)\n| Poe Dameron's astromech droid in the sequel trilogy. BB-8 has a spherical body with a small head that balances on top, and moves by rolling around.\n|-\n|\n| Voice: Ken Watanabe (The Last Jedi)\n| Black plated BB-series astromech droid in the service of the First Order in The Last Jedi.\n|-\n|\n|Voice: Ben Burtt (Jedi: Fallen Order)\n|Small droid formerly in the possession of Jedi Master Eno Cordova, who encounters and befriends Cal Kestis on the planet Bogano. After revealing a message from Cordova about a Jedi Holocron containing a list of Force-sensitive children, BD-1 joins Cal in his quest to find the Holocron and hopefully restore the Jedi Order, becoming a member of the Stinger Mantis crew.\n|-\n|B2EMO (a.k.a Bee-Two or Bee)\n|Voice: Dave Chapman (Andor)\n|Maarva Andor's loyal but anxious droid, who struggles without the company of those he trusts, Bee experiences malfunctions such as vocal stuttering and data lags. A groundmech salvage assist unit that served the Andor family for years including Cassian Andor, after escaping from his home on Ferrix with Andor, he is seen happily living on a farm playing with other droids.\n|-\n|  (a.k.a. Bee-Tee)\n|\n| Blastomech droid, an assassin droid designed to look like an Astromech droid with a variety of hidden built-in assault weapons. An associate of Doctor Aphra and 0-0-0, the droid is first featured in the Marvel comic series Star Wars: Darth Vader and is now heavily featured in the ongoing Doctor Aphra series.\n|-\n|  (a.k.a. \"Chopper\")\n| Voice: Dave Filoni (Rebels, Forces of Destiny, Ahsoka)\nMatt Martin (Rogue One)\n| Astromech droid with a cantankerous, \"pranking\" form of behavior aboard the rebel freighter Ghost in Star Wars Rebels. Chopper later reappears in Rogue One in the Great Temple of Masassi on Yavin 4, and so does the Ghost itself and Hera Syndulla (who is mentioned only as a General of the Rebellion). Chopper appears in live action in Ahsoka.\n|-\n| C-3PO\n| Anthony Daniels (Episodes I-IX, Rogue One, Obi-Wan Kenobi, Ahsoka)Voice: Anthony Daniels (The Clone Wars, Rebels, Forces of Destiny, Resistance)\n| Protocol droid created by Anakin Skywalker who appears in all nine main Star Wars films and Rogue One.\n|-\n|\n|Voice: Dave Filoni (The Clone Wars)\n|C1-series astromech droid that helps Ahsoka Tano when Order 66 is issued in The Clone Wars. He is destroyed by clone troopers looking to execute Ahsoka.\n|-\n|\n|Voice: J. J. Abrams (The Rise of Skywalker)\n|Small droid previously owned by the Sith mercenary Ochi, who is found and reactivated by BB-8 in his old ship. He is shown to be very excitable and follows BB-8 wherever he goes, wanting to be just like him. He can also speak, although very briefly and stammering.\n|-\n|\n| Voice: Richard Marquand (Return of the Jedi), Mark Hamill (The Mandalorian)\n| Torture droid working in Jabba the Hutt's palace in Return of the Jedi, that assigns roles for R2-D2 and C-3PO during their brief tenure under Jabba's ownership.\n|-\n|\n|\n| Medical droid assistant to 2-1B on Hoth. An FX-7 figure was produced for Kenner's Empire Strikes Back action figure line in 1980.\n|-\n|\n| Voice: David Acord (The Force Awakens)\n| Servant droid at the castle of Maz Kanata, aligned with the Resistance, that informs them of the missing BB-8's presence at the castle, allowing them to mobilize their forces.\n|-\n|\n|\n|R4 astromech droid that helps Ahsoka Tano when Order 66 is issued in The Clone Wars. He is destroyed by clone troopers looking to execute Ahsoka.\n|-\n|  (a.k.a. GNK power droid)\n| Rusty Goffe, Latin Lahr, Jack Purvis, Kenny Baker, Kiran Shah, Raymond Griffiths, Arti Shah, Ivan ManzellaVoice: Ben Burtt\n| Boxy, rectangular-shaped droid that walks very slowly. It is literally a bipedal, walking power generator. After appearing in the Jawas' sandcrawler in the original 1977 Star Wars film, a \"Power Droid\" figure was produced for Kenner's Star Wars action figure line in 1978. A Gonk droid is also featured in the \"Blood Sisters\" episode of Rebels, and Rogue One. other appearances of the droid include in Star Wars: The Empire Strikes Back (Episode V),Star Wars: Return of the Jedi (Episode VI),Star Wars: The Phantom Menace (Episode I),Star Wars: Attack of the Clones (Episode II), and in Star Wars: The Bad Batch, in which the droid was affectionately nicknamed \"Gonky\".\n|-\n|HK-47\n|Kristoffer Tabori\n|Within the Star Wars Legends continuity, HK-47 is a humanoid soldier robot, designed as a violent killer, which first appeared in the 2003 video game Star Wars: Knights of the Old Republic.\n|-\n|\n|Voice: David Tennant (The Clone Wars, Ahsoka, Young Jedi Adventures)\n|Huyang is an ancient droid who for millennia oversaw Padawan training of lightsaber construction for the Jedi Order.\n|-\n|IG-11\n|Voice: Taika Waititi (The Mandalorian)\n|Bounty hunter and assassin droid who briefly teams up with the Mandalorian to find and kill the Child. However, he is then betrayed and destroyed by the Mandalorian, who wanted to retrieve the Child alive. He is later rebuilt and reprogrammed by Kuiil to serve as an ally of the Mandalorian. During the group's fight with Moff Gideon's Imperial Remnant, IG-11 looks after the Child and later treats the Mandalorian when he is injured, before sacrificing himself and activating his self-destruct mechanism to allow the others to escape.\n|-\n|\n| Voice: Matthew Wood (Forces of Destiny)\n| Bounty hunter and assassin droid introduced in The Empire Strikes Back, summoned aboard the Executor by Darth Vader in his search for the Millennium Falcon. IG-88 also appears in the Forces of Destiny animated series, attempting to capture Leia Organa and Sabine Wren. In the Legends continuity, there are four IG-88 assassin droids created for Project Phlutdroid by Holowan Laboratories, designated A, B, C and D. IG-88B and C are destroyed by Boba Fett shortly after Vader's bounty on the Millennium Falcon, while D was destroyed by Legends character Dash Rendar on Ord Mantell. The last surviving model, IG-88A, uploads his consciousness into the second Death Star in an attempt to take over all droids in the galaxy, just prior to the Battle of Endor. Ralph McQuarrie's production sketches show a sleeker design than the droid that appears in The Empire Strikes Back and were later used as the model for the IG-RM Thug droids in Star Wars Rebels. The term \"IG-88\" is not the original name for the character, as the Empire Strikes Back script calls the character a \"chrome war droid\", and during production it was called \"Phlutdroid\". The production puppet consisted of recycled props from A New Hope, including the Mos Eisley cantina drink dispenser as IG-88's head.\n|-\n|\n| Voice: Gregg Berger (The Clone Wars, Rebels)\n| A Separatist tactical droid who served in the Clone Wars. He led his forces to take over and occupy the planet Onderon. His forces clashed with a band of rebels trained by some Jedi and led by Saw Gerrera to free the planet from Separatist control. Unable to thwart the uprising, Kalani and the remnants of his forces evacuated to the planet of Agamar. He and his troops managed to survive and hide there, resisting a shutdown order issued to the entire droid army after the Clone Wars ended. Kalani later encountered Captain Rex, Ezra Bridger, Kanan Jarrus and Zeb Orrelios, who visited the planet for battle supplies, and after a battle with them, ultimately chose to help them fend off the oppressive Galactic Empire. However, he declined to join the rebellion because he believed the odds of their cause seemed too great.\n|-\n| K-2SO\n| Alan Tudyk (Rogue One, Andor)\n| An Imperial security droid stolen and reprogrammed by the Alliance that made his first appearance in Rogue One. During the Ghorman Massacre, he was incapacitated by a member of the Ghorman Front and his wreck was salvaged by Cassian Andor, who took him to the Rebel Alliance base on Yavin 4 to be repaired and reprogrammed to serve the rebellion. His appearance makes him useful when infiltrating Imperial installations and outposts, but as a result of his reprogramming, he has a tendency to speak his thoughts bluntly and tactlessly. He is destroyed by stormtroopers whilst protecting Jyn Erso and Cassian during the Rebel Alliance's raid on the Imperial data storage facility at Scarif to steal the Death Star schematics.\n|-\n|\n|\n|Droid companion to a young Princess Leia in Obi-Wan Kenobi. She was destroyed when the Death Star fired its superlaser on Alderaan.\n|-\n| L3-37\n| Phoebe Waller-Bridge (Solo: A Star Wars Story)\n| Trusted right-hand female pilot droid of Lando Calrissian, and the original co-pilot of the Millennium Falcon, L3-37 is a no-nonsense robot revolutionary who frees the droids in the spice mines of Kessel. On one occasion, when Lando asks if she needs anything from outside the cockpit, she quips \"equal rights\". She was heavily damaged during the mission to Kessel, and her brain was uploaded into the Falcon's central computer.\n|-\n|\n|\n| An \"ancient protocol droid of unknown manufacture\" that resides and works as a translator at Maz Kanata's castle on Takodana in The Force Awakens (2015).\n|-\n|NED-B\n|Dustin Ceithamer (Obi-Wan Kenobi)\n|Silent loader droid working with Imperial defector Tala Durith in Obi-Wan Kenobi.\n|-\n|\n|\n| Command battle droid that led the Trade Federation's droid army during the invasion of Naboo in The Phantom Menace. During the invasion, he is promoted from captain to commander and serves under Nute Gunray, Darth Maul and Darth Sidious as their primary contact with the battle droid ground forces. His capture of Naboo's capital city of Theed and the underwater Gungan capital of Otoh Gunga are successful, which earns the praises of Nute Gunray. Eventually, OOM-9 leads the battle droids against the Gungan Grand Army, who are soon defeated by his forces but are ultimately freed in the end when Anakin Skywalker destroys the droid central control computer operating from the Trade Federation battleship.\n|-\n|\n|\n| Droid introduced in the 2015 young adult novel Moving Target: A Princess Leia Adventure by Cecil Castellucci and Jason Fry to whom Leia Organa dictates her memoirs. PZ-4CO also appears in The Force Awakens.\n|-\n| (aka \"Zero\")\n|Voice: Richard Ayoade (The Mandalorian)\n|Droid member of Ranzar Malk's crew, who attempts to release one of their associates, Qin, from a New Republic transport with the help of the Mandalorian. The crew secretly planned to abandon the Mandalorian once they released Qin, but he had anticipated their betrayal and leaves all of them behind on the transport, with the exception of Q9-0, who was left aboard the Mandalorian's ship, the Razor Crest; he was instead shot and destroyed by the Mandalorian after trying to kill the Child.\n|-\n|\n|Voice: Justin Ridge (Star Wars Resistance)\n| Nicknamed \"Bucket\", is an R-series astromech droid owned by Jarek Yeager, the former Rebellion pilot. R1-J5 raced with Yeager, serving as his co-pilot before the pair retired to the Colossus refueling platform and began Jarek Yeager's Repair Station and formed Team Fireball.\n|-\n| R2-D2\n| Kenny Baker (Episodes I–VI, VII; consultant)Jimmy Vee (Episodes VII–IX, Rogue One)\nUnknown (The Mandalorian, The Book of Boba Fett, Obi-Wan Kenobi)\n| Loyal R2 astromech droid that becomes attached to various characters throughout the continuity of the Skywalker Saga, notably accompanying three generations: Anakin and Luke Skywalker, and Rey Palpatine. R2 was also known for his companionship with the protocol droid C-3PO.\n|-\n|\n|\n| Pink R2 astromech droid (identical to a R2-D2 but with pink accents instead of blue) that first appears in The Clone Wars and then briefly in scenes at the Resistance base in The Force Awakens. The droid is also a playable character in the video game Lego Star Wars: The Force Awakens. R2-KT was named in honor of seven year old Star Wars fan and cancer patient Katie Johnston.\n|-\n|\n|\n| Replacement astromech droid for Anakin when R2 is lost in The Clone Wars. He is later revealed to be working as a spy for General Grievous, and subsequently destroyed by R2-D2 himself.\n|-\n|\n|\n| Nicknamed \"Arfour\", this astromech droid accompanies Obi-Wan Kenobi on his mission to Kamino in Attack of the Clones, and is assigned to Kenobi throughout much of the Clone Wars (appearing in several episodes of The Clone Wars series). R4 is decapitated by Buzz Droids in Revenge of the Sith, and is replaced by R4-G9.\n|-\n|\n|\n| Astromech droid originally sold to Owen Lars on Tatooine in A New Hope which immediately malfunctions and is replaced by R2-D2. The droid is currently owned by Din Djarin in hopes of exploring Mandalore. This droid also received an action figure release during the second wave of Kenner's original Star Wars action figure line.\n|-\n|\n|\n| Astromech droid owned by Ahsoka Tano in The Clone Wars. When Order 66 is issued, he helps out Ahsoka, but is destroyed by clone troopers looking to execute her.\n|-\n|  (\"Death Star droid\")\n|\n| Originally appearing in the 1977 film Star Wars, these protocol droids are primarily used by Imperial officers as servants. They are also known as \"Insect droids\" or '\"Death Star droids\", due to the large numbers used aboard the Death Star. An RA-7 droid dubbed \"Death Star Droid\", was produced for Kenner's Star Wars action figure line in 1978. The RA-7 type droid named AP-5 has a recurring role in Star Wars Rebels, assisting Hera Syndulla's Phoenix Squadron.\n|-\n|Scourge\n|\n|A malevolent droid created from the fusion of the Spark Eternal artificial intelligence and a droid intelligence locked away by the ancient Sith, the Scourge caused a galaxy-wide infection of droids and cyborgs during the Galactic Civil War and came into conflict with both the Empire and the Alliance. Its ultimate goal was to take control of the Force by infecting organic beings, which it nearly accomplished by possessing Luke Skywalker, though its main body was destroyed by Ajax Sigma immediately after, freeing all its infected from its control.\n|-\n|\n|Voice: Nick Frost (Star Wars: Skeleton Crew)\n| Nicknamed \"Thirty-Three,\" is a droid pirate who served as First Mate of the starship Onyx Cinder. At some point the Onyx Cinder became buried in a forest on At Attin and by the early New Republic Era. In 9 ABY, a youngling called Wim discovered the Onyx Cinder and, together with three children called Neel, Fern and KB, investigated the ship but they accidentally activated it and flew to another planet. The group of kids then forged an alliance with SM-33 and a force-sensitive man called Jod Na Nawood to find back home and avoid a band of pirates.\n|-\n|\n| John Fensom (The Phantom Menace)Voice: Lindsay Duncan (The Phantom Menace)\n| Protocol droid who appears in the beginning of The Phantom Menace, serving drinks to Obi-Wan Kenobi and Qui-Gon Jinn aboard the Trade Federation's flagship ''Saak'ak.\n|-\n|\n|Voice: Seth Green (The Clone Wars, The Bad Batch'')\n|Cad Bane's techno-service droid in The Clone Wars and The Bad Batch.\n|-\n|\n|\n| Timid astromech droid sent on a mission with D-Squad, an all-droid special unit in The Clone Wars.\n|-\n|\n| Voice: Ben Diskin (The Clone Wars)\n| Over-excitable \"pit droid\" that is assigned to a special Republic group of droids, D-Squad, to steal an encryption module from the Separatists in The Clone Wars.\n|}\nReception\nMany film scholars link the portrayal of droids in Star Wars to racial or class politics, technophobia, or sexual and reproductive anxieties. Dan Rubey, for example, sees the original film as establishing a \"race hierarchy\" with droids on the bottom rung. J. P. Telotte sees the droids as part of a human-over-nonhuman and living-over-nonliving hierarchy in the film, describing them as \"essentially slaves to a superior mankind, embodying a romantic dream of obedience and dogged faithfulness to a master.\" Diana Sandars follows a similar vein, seeing droids as a negative counterpoint to humanity, epitomized in Darth Vader's mechanical body, having \"vanquished his human nobility.\" Writing before the release of the prequels, in which Obi-Wan Kenobi's relationship to droids differed from the original trilogy, Lane Roth instead saw the droids as a means of establishing the moral standing of human characters, with \"sympathetic\" characters like Obi-Wan treating them kindly (calling R2-D2 \"my little friend\" and listing the droids as passengers, not cargo) and initially \"unsympathetic\" ones, like Han Solo and the Tattooine Bartender, neglecting or abusing them. Cyrus Patell reads them similarly, referring to the droids as both \"an ethical index\" and a manifestation of technophobia. Meanwhile, Nicholas Wanberg sees the portrayal of droid characters, especially through the prequel films, as playing on racialized sexual and reproductive anxieties through contrasting origin settings between more or less \"White\" droids, different mind-body relationships, and reenactments of swamping fears.\nSee also\n*These Aren't The Droids You're Looking For\nReferences\nExternal links\n*\n*\n*"
    }
  ]
}