{
  "content": [
    {
      "type": "text",
      "text": "# Drug-related deaths in the United Kingdom\n\nIn 2023, 5,448 deaths in England and Wales and 1,172 in Scotland were recorded as “drug misuse”. Deaths from drugs overtook traffic fatalities in the United Kingdom as a leading cause of death in 2008, and have risen every year since 2012.\nThose most likely to die are working class, over 40 and living in de-industrialised areas. Rates of death in the most deprived areas are 9 times those in the most prosperous.\nThe Advisory Council on the Misuse of Drugs recommended in 2016 that there should be wider provision of naloxone (which can be used to block the effects of opioid overdose), central funding for heroin-assisted treatment, medically-supervised drug consumption rooms and more opioid substitution therapy. However, between 2014–15 and 2021–22, spending on adult drug treatment services fell by 40%.\nThe Scottish Drugs Forum predicts more than 1,000 drug related deaths in 2018 in Scotland where deaths have more than doubled since 2007 when there were 445. In the lead up to International Overdose Awareness Day called for heroin-assisted treatment and greater use of take home naloxone kits.\nScotland\nScotland has the worst drug-related/misuse mortality rate in Europe and in the UK as a whole. It is 3.5 times higher than England and Wales. In 2021, a total of 1,330 people died from drug-misuse.\nIn the most deprived areas, the mortality rate is 18 times higher compared to the least deprived areas. There is also a gender divide within mortality rates, Males are significantly more affected by drug-misuse mortality rates then females. In 2021, the rate was 35.8 per 100,000 population in Males to 14.7 within Females. Age wise, the bands of 35 to 54 year olds suffer the most and make up approximately two-thirds of drug-misuse deaths.\nDrug consumption rooms have been proposed to encourage addicts into treatment, reduce the number of discarded needles on streets and counteract the spread of diseases like HIV through the sharing of needles. The first legal drug consumption room in the UK opened in Glasgow in January 2025, coming about after Scotland's senior prosecutor announced that those that possessed illegal drugs while at the facility would not be prosecuted. The UK government said it will not intrude on the matter of the Glasgow facility but that it also had no plans to introduce other such facilities in the UK.\nDecriminalisation of drug use alongside placing the appropriate resources into harm reduction measures and rehab programmes have been proposed by various doctors, academics, recovery groups and former drug addicts as measures to counter drug deaths in Scotland. It has been argued that drug users often cannot afford fines, that prison time makes their addictions worse and that the money and resources saved on forcing drug addicts through courts and prison sentences could instead be used to target criminal drug gangs. Drug decriminalisation is also supported by Stirling University professor, trustee of the Society for the Study of Addiction and convener of the Drugs Research Network Scotland, Catriona Matheson. However, drug policy is not a devolved matter and is controlled by the UK government.\nEngland and Wales\nIn 2023, 5,448 deaths related to drug poisoning were recorded in England and Wales, the highest number of drug deaths since records began in 1993. In the same year the Office for National Statistics stated that in England and Wales \"the age-standardised mortality rate for deaths related to drug poisoning has risen every year since 2012\".\nFile:Deaths to drug misuse in England and Wales.svg|Deaths to drug misuse in England and Wales\nFile:Drug misuse death rate in England and Wales per gender.svg|Drug misuse death rate per 100,000 inhabitants in England and Wales\nFile:Female drug poisoning age-standardised mortality rate by IMD quintile in England and Wales.svg|Female drug poisoning age-standardised mortality rate by IMD quintile in England and Wales\nFile:Male drug poisoning age-standardised mortality rate by IMD quintile in England and Wales.svg|Male drug poisoning age-standardised mortality rate by IMD quintile in England and Wales\nFile:Drug misuse mortality rates by age groups per 100000 inhabitants in England and Wales.svg|Drug misuse mortality rates by age groups per 100000 inhabitants in England and Wales\nSee also\n* Chasing the Scream\n* Controlled Drug in the United Kingdom\n* Drug crisis in Scotland\n* Drug Equality Alliance\n* Drug policy of the United Kingdom\n* Drugs controlled by the UK Misuse of Drugs Act\n* DrugScience\n* War on drugs\nReferences\nExternal links\n* [https://www.bbc.co.uk/news/uk-scotland-48938509 Scotland has highest drug death rate in EU]. BBC News. Published 16 July 2019.\n* [https://www.dailyrecord.co.uk/news/scottish-news/its-time-decriminalise-drug-use-17386758 It's time to decriminalise drug use to beat Scotland's crippling death crisis]. Daily Record (Scotland). Published 4 July 2019."
    }
  ]
}