{
  "content": [
    {
      "type": "text",
      "text": "# Drum Creek Treaty\n\nThe Drum Creek Treaty came about from the controversy over the Sturges Treaty of 1868.  The Sturges Osage Treaty was a treaty negotiated between the United States and the Osage Nation in 1868.  The treaty was submitted to both the United States House of Representatives and the United States Senate but was never ratified.\nThe treaty arose out of a growing need to relocate the Osage to a new reservation.  American settlers began to arrive and establish farmsteads on Osage lands in the early 19th century.  Their growing presence and pressure were instrumental in the decline of Osage control in Kansas.  In the late 1860s, settlers infiltrated Osage lands at such a rate that the tribe resorted to requesting U.S. military assistance to help turn them back.  As a result of this pressure the Osage began negotiating the treaty with the Commissioner of Indian Affairs. The Canville Treaty of 1865 required that the United States sell the Osage Lands in Kansas on behalf of the tribe at  () and then purchase new lands in Oklahoma using the proceeds from the sale.  However, the Sturges Treaty proposed to sell the  Osage Diminished Reserve to the Leavenworth, Lawrence, & Galveston Railroad Company directly, at a price of 20 to 25 cents per acre.\nThe settlers, along with lobbying members of the House and Senate, strongly opposed the Sturges Treaty and were largely responsible for its failure.\nThe Osage would, however, come to an agreement with the United States that restored the terms of the Canville Treaty of 1865.\nIt was contained in an act of Congress shown below:\nThe Act of July 15, 1870 – Removal of Osage from Kansas - 16 Stat. 335, Chapter 296\nSEC. (12.)\nAnd be it further enacted, That whenever the Great and Little Osage Indians shall agree thereto, in such manner as the President shall prescribe, it shall be the duty of the President to remove said Indians from the State of Kansas to lands provided or to be provided for them for a permanent home in the Indian Territory, to consist of a tract of land in compact form equal in quantity to  for each member of said tribe, or such part thereof as said Indians may desire, to be paid for out of the proceeds of the sales of their lands in the State of Kansas, the price per acre for such lands to be procured in the Indian Territory not to exceed the price paid or to be paid by the United States for the same. And to defray the expenses of said removal, and to aid in the subsistence of the said Indians during the first year, there is hereby appropriated out of the treasury, out of any money not otherwise appropriated, to be expended under the direction of the Secretary of the Interior, the sum of fifty thousand dollars, to be reimbursed to the United States from the proceeds of the sale of their present diminished reservation, which lands shall be open to settlement after survey, excepting the sixteenth and thirty-sixth sections, which shall be reserved to the State of Kansas for school purposes, and shall be sold to actual settlers only, said settlers being heads of families or over twenty-one years of age, in quantities not exceeding , in square form, to each settler, at the price of one dollar and twenty-five cents per acre; payment to be made in cash within one year from date of settlement or of the passage of this act; and the United States, in consideration of the relinquishment by said Indians of their lands in Kansas, shall pay annually interest on the amount of money received as proceeds of sale of said lands, at the rate of five per centum, to be expended by the President for the benefit of said Indians, in such manner as he may deem proper. And for this purpose an accurate account shall be kept by the Secretary of the Interior of the money received as proceeds of sale, and the aggregate amount received prior to the first day of November of each year shall be the amount upon which the payment of interest shall be based. The proceeds of sale of said land shall be carried to the credit of said Indians on the books of the treasury, and shall bear interest at the rate of five per cent. per annum: Provided, That the diminished reserve of said Indians in Kansas shall be surveyed under the direction of the Secretary of the Interior as other public lands are surveyed, as soon as the consent of said Indians is obtained as above provided, the expense of said survey to be paid from the proceeds of sale of said land.\nSEC. (13.)\nAnd be it further enacted, That there be, and is hereby, appropriated, out of any money in the Treasury not otherwise appropriated, as compensation to Osages for the stock and farming utensils which the United States agreed to furnish them by the second article of the treaty of January eleven, eighteen hundred and thirty-nine, and which were only in part furnished, twenty thousand dollars; and as compensation for the saw and grist mill(s) which the United States agreed by said treaty to maintain for them fifteen years, and which were only maintained five years, ten thousand dollars; which sums shall be expended, under the direction of the Secretary of the Interior, in the following manner: Twelve thousand dollars in erecting agency buildings, a warehouse, and blacksmith's dwellings, and a blacksmith shop, and the remaining eighteen thousand dollars in the erection of a schoolhouse and church, and a saw and grist mill at their new home in the Indian Territory.\nThis legislation led to the Drum Creek Treaty of 1870  with the signing of this treaty completed on September 10, 1870.\n\"When the ratification of the treaty fell upon the shoulders of the U.S. Congress, it would be Kansas Senator Sidney Clarke who would raise the loudest voice, not in the name of the railroad but in the rights of the agrarian settlers. He insisted that the Osage lands be open for settlement instead of deeded to a railroad company. Saying that the sale of the Osage lands to the railroad was an unjustifiable abuse to the settlers, Clarke was able to get the treaty withdrawn from the senate in 1869, shortly after President Ulysses S. Grant had come to the presidency. In return, Clarke in July 1870 would offer an Indian appropriation bill, asking that the Osage Diminished Reserve be open to settlement at $1.25 per acre. Congress quickly ratified Clarke's Indian appropriation bill, and settlement immediately sprang up while the railroad continued its southward progression. President Grant, upon signing the bill, authorized the removal of the Osages to a new home in Indian Territory, now present-day Oklahoma. Clarke's bill was the predecessor to the Drum Creek Treaty of 1870.\"\nReferences\nExternal links"
    }
  ]
}