{
  "content": [
    {
      "type": "text",
      "text": "# Du Wei (Three Kingdoms)\n\n| term_end = ?\n| monarch = Liu Shan\n| predecessor = Zhuge Liang\n| birth_date = Unknown\n| birth_place = Mianyang, Sichuan\n| death_date = Unknown\n| death_place =\n| occupation = Official\n| blank1 = Courtesy name\n| data1 = Guofu (國輔)\n}}\nDu Wei ( 190s – 220s), courtesy name Guofu, was a scholar who rejected service, including via faking of poor health, before eventually becoming an official of the state of Shu Han during the Three Kingdoms period of China.\nLife\nDu Wei was from Fu County (涪縣), Zitong Commandery (梓潼郡), which is in present-day Mianyang, Sichuan. He was born sometime in the mid- or late Eastern Han dynasty. In his younger days, he studied under the tutelage of Ren An (任安; 124–202), a famous scholar and polymath and like his master would be a scholar recluse. Liu Zhang, the Governor of Yi Province (covering present-day Sichuan and Chongqing), heard about Du Wei and offered him the position of an Assistant Officer (從事) in the provincial government. However, Du Wei claimed that he was ill and declined the offer. In 214, after the warlord Liu Bei seized control of Yi Province from Liu Zhang, he wanted to recruit Du Wei to serve in his administration. Du Wei claimed that he could not serve because he was deaf, and stayed at home.\nIn 224, Zhuge Liang, the Imperial Chancellor of the state of Shu Han in the Three Kingdoms period, was actively searching for talented and virtuous people to serve in the Shu government. Among the candidates he selected, he appointed Qin Mi as an Assistant Officer (別駕), Wu Liang (五梁) as an Officer of Merit (功曹), and Du Wei as a Registrar (主簿).\nWhen Du Wei declined again, Zhuge Liang sent a carriage to his residence to fetch him to the office. Upon Du Wei's arrival, Zhuge Liang came out to welcome him in person. Du Wei thanked Zhuge Liang for the offer but did not accept. As Zhuge Liang heard that Du Wei was deaf, he wrote a note beforehand and passed it to Du Wei when he showed up. The note read:\nAfter reading the note, Du Wei tried to turn down the offer once more, claiming that he was old and feeble and therefore unfit to serve. Zhuge Liang, given his strong admiration for Du Wei, refused to give up, so he produced another note and showed Du Wei. It read:\nWhen Du Wei finally relented and agreed to serve in the Shu government, Zhuge Liang appointed him as a Counsellor Remonstrant (諫議大夫)  but Du Wei would retire on grounds of health and age.\nChen Shou used Zhuge Liang's recruitment efforts as an example of the regard in which Du Wei was held and noted Du Wei as a man who cultivated his virtue in reclusion, like the ideals of old. J. Michael Farmer notes Chen Shou placing Du Wei as part of a continuation of local intellectual tradition that Chen Shou himself was part of.\nSee also\n* Lists of people of the Three Kingdoms\nNotes\nReferences\n* Chen, Shou (3rd century). Records of the Three Kingdoms (Sanguozhi).\n*\n* Sima, Guang (1084). Zizhi Tongjian."
    }
  ]
}