{
  "content": [
    {
      "type": "text",
      "text": "# Duar War\n\n*\n| combatant2        = Bhutan\n| combatant3        =\n| commander1        =  Sir John Lawrence\n| commander2        = Kagyud Wangchuk (1864)Tshewang Sithub (1865)\n| commander3        =\n| strength1         =3,600 to 3,800 troops\n| strength2         =2,000 to 3,000(Dzong guards)\n| strength3         =\n| casualties1       =40 killed in action and 100 to 150 wounded\n| casualties2       =100 to 200\n| casualties3       =\n| notes             =\n}}\nThe Duar War (or Anglo-Bhutanese War) was a war fought between British India and Bhutan in 1864 to 1865. It was the only military conflict between the two states since 1774 and resulted in Bhutan losing a fifth of its territory.\nBackground\nIn 1862, the Bhutanese raided British occupied Sikkim (which had only been controlled since the year prior) and Cooch Behar (Koch Bihar). It was not the first time the Bhutanese has raided; in 1838, they did similar things in Assam. After the raids in Assam, the British requested compensation by extraditing the Bhutanese officials responsible for the raids along with settlements of Bhutanese debt to the British. Bhutan declined to protect their independence. In 1841, the British proceeded to annex the Assam Duars from the Bhutanese, but paying 10,000 Rupees to Bhutan annually as compensation. Later, they also ceded the Bengal Duars as they were giving them a hard time. After the raids in 1862, the British withheld said compensation payments and demanded that all captives from British India held hostage by the raiders be set free and stolen properties to be returned. The Druk Desi once more denied, claiming that he was unaware of the raids.\nAcross the nineteenth century, British India commissioned multiple missions to Bhutan. Official documents always cited cross-border raids by Bhutan or sheltering of dissidents as the immediate cause; however, modern historians note Britain's imperialist ambitions in the region to be the actual pretext. Not only was Bhutan a vital cog in the Indo-Tibetan trade but also the commercial viability of Duars region for supporting tea plantations was well known among Company officials. In 1863, British Indian government sent a mission under Ashley Eden to Punakha, the capital of Bhutan at the time. His job was to get all captives released and arrange peaceful economical policy and intercourse with Bhutan. In January, he left Darjeeling, West Bengal, crossed the Teesta River to arrive in Punakha. However, as soon as he arrived in the suburbs, he was met with evasion and constant delay from authorities. It only got worse from there, as his arrival to Punakha kicked off with threats from the government and tense compulsion to sign an 'obnoxious' treaty. On his way back to India in April, he was disavowed and repudiated by the Bhutanese.\nThe dzongpon of Punakha – who had emerged victorious in the civil war – had broken with the central government and set up a rival Druk Desi while the legitimate druk desi sought the protection of the penlop of Paro and was later deposed. The British mission dealt alternately with the rival penlop of Paro and the penlop of Trongsa (the latter acted on behalf of the druk desi).\nWar\nAs Bhutan did not comply, the British organized 4 columns of British, Indian, and 3rd and 8th rifles (Gurkha), in what was known as the Duar Field Forces. In the same year, these forces marched up into the Bhutanese foothills, met by heavy rains and swamps. The column in the east went up to the fort Dewangiri, called Deothang under the Bhutanese, and captured it before suffering a humiliating defeat to the Bhutanese armed with swords, bows, and matchlocks, who, after taking the fort, seized two Howitzers. Then, after cutting off the water supply in the fort and the occupied east post, left. They did not beat the column, but rather the fortress was abandoned by them at the sight of Bhutanese militias.\nThe defeat was avenged after the late Major-general or commander Henry Tombs arrived and recaptured the fort with support from the 55th Regiment of Foot (Colonel Robert Humes). The center column advanced into the hills before capturing Buxa Fort. The 3rd column had also assaulted and captured Dalimkote fort, which was a treacherous journey involving dense jungles to heights possibly reaching 5,000 feet. In its foothills was the secluded village of Ambiokh, where a barrel of gunpowder exploded as several men and a battery of heavy artillery crossed, tragically taking the life of Captain F.C Griffin, his lieutenants E. Walker and E.A. Anderson, and 6 gunners. Griffin was in command of the battery and as he was along with others carrying it, many were also wounded. Luckily, these small advancements by themselves put many constraints on Bhutanese commerce. Bhutan had no regular army, and what forces existed were composed of dzong guards armed with matchlocks, bows and arrows, swords, knives, and catapults. Some of these dzong guards, carrying shields and wearing chainmail armor, engaged the well-equipped British forces. Soon, many attacks made by the British from expeditionary divisions sent from Calcutta (now Kolkata) were successful, with varying fortune. From the 44th (Sylhet) Regiment Bengal Native Infantry, soldiers had help solidify the fort at Deothang to stop the constant Bhutanese attacks. Then, all operations were suspended for the summer. Later, Viceroy Lord Lawrence decided to negotiate a resolution for the war to put an end to the break. So, on June 2, 1865, he wrote to the Deb and Dharma Rajas, proposing peace based on the British proclamations in 1864. The Bhutanese declined the offer, so the British marched into Bhutan to give the Deb Raja full notice directly, led by Colonel Herbert Bruce, dated September 28, 1865. The Deb Raja later sent a letter in October 4, 1865, consenting to the negotiation of terms. It was quite late as per extensive war preparations. In the end, a treaty was devised on the 11 of November, 1865, known as the Treaty of Sinchula.\nfort.]]The Duar War lasted only five months and, despite some battlefield victories by Bhutanese forces which included the capture of two howitzer guns, resulted in the loss of 20% of Bhutan's territory, and forced cession of formerly occupied territories. Under the terms of the Treaty of Sinchula, signed 11 November 1865, Bhutan ceded territories in the Assam Duars and Bengal Duars, as well as the 83&nbsp;km2 of territory of Dewangiri in southeastern Bhutan, in return for an annual subsidy of 50,000 rupees. The Treaty of Sinchula stood until 1910, when Bhutan and British India signed the Treaty of Punakha, effective until 1947.\nTreaty of Sinchula\n| location_signed     = Sinchula\n| date_sealed         =\n| date_effective      = 11 November 1865\n| condition_effective = Bhutanese cessation of withdrawal of claims to suzerainty of Cooch Behar and the Duars\n| date_expiration     = 1910\n| signatories         = Sikkim Political Officer Herbert Bruce; The Druk Desi and his ministers\n| parties             = British India; Bhutan\n| ratifiers           = Viceroy and Governor-General Sir John Lawrence (British India)\n| depositor           =\n| language            = English\n| wikisource          =\n}}\nBelow appears the text of the Treaty of Sinchula.\nSee also\n* Foreign relations of Bhutan\n* History of Bhutan\n* Treaty of Punakha\nReferences\nBibliography\n* }}\n* }}"
    }
  ]
}