{
  "content": [
    {
      "type": "text",
      "text": "# Duck Dodgers and the Return of the 24½th Century\n\n| story         = Michael MalteseChuck Jones\n| producer      = Chuck JonesMary Roscoe\n| starring      = Mel Blanc(all voices)\n| music         = Dean Elliott\n| animator      = Master animators: Phil MonroeManny PerezBen WashamIrv AndersonLloyd VaughanKey assistant animator:Retta DavidsonLester Pegues Jr.\n| color_process = Technicolor\n| distributor   = Warner Bros. Pictures\n| released      = }}\n| runtime       = 6:41 minutes(The Edited Version)9:26 minutes(The Uncut Version)\n| language      = English\n}}\nDuck Dodgers and the Return of the 24½th Century is a 1980 animated short film starring Daffy Duck, Porky Pig and Marvin the Martian. It is the sequel to the 1953 cartoon Duck Dodgers in the 24½th Century. It was the first Daffy and Porky cartoon since 1965. This cartoon first premiered on November 20, 1980, as part of an animated NBC television special called ''Daffy Duck's Thanks-for-Giving Special'', with scenes that would later be cut when this cartoon was reformatted as a short. The final credited work of Michael Maltese (who would die only three months following the short's original broadcast), the majority of Maltese's storyboards (including a duel between Marvin and Daffy and the return of K-9, who features prominently within the boards) nonetheless went unused within the finished short. The only parts written by Maltese that remained in the final product is the problem of the lack of the element that produces yo-yo polish (called flexonite in the boards) and Gossamer being shaven (albeit with Porky using hair clippers instead of Daffy singing The Song of the Marines to Gossamer and his weakness being barbers instead of music).\nThe theme tune is an orchestral version of Frédéric Chopin - Polonaise in A major Op. 40 No. 1 Military.\nPlot\nDaffy Duck reprises his role of Duck Dodgers in another spoof of Saturday afternoon space serials. Assigned to locate the rack-and-pinion molecule needed for yo-yo polish, Dodgers and his sidekick, an eager young space cadet (Porky Pig), crash their spaceship into a giant eggshell-shaped planet, where they find Marvin the Martian, who is, as usual, scheming to destroy Earth in an attempt to solve the \"fuel problem\". Marvin asks Dodgers to visit the boudoir of Gossamer, which Dodgers thinks is a space princess, but Gossamer turns out to be a giant, hairy monster in sneakers, and the frightened Dodgers flees. Porky uses electronic clippers to literally haircut Gossamer into nothingness, and Dodgers, infuriated by his assistant's all-too-literal interpretations of his commands, repeatedly fires his gun at Porky. When Porky asks what Earth will do without the rack-and-pinion molecule Dodgers replies \"Let them eat cake.\"\nCast\n* Mel Blanc as Daffy Duck (as Duck Dodgers), Porky Pig, Marvin the Martian, Gossamer and Dr. I.Q.\nChanges in the reformatted version\n* The following scenes were cut when this cartoon was reformatted as an individual animated short:\n** Dodgers telling Marvin he is under arrest.\n** Porky using a straitjacket gun to capture Marvin the Martian.\n** The real ending where Marvin (still wrapped in the straitjacket) aims his missile at Earth and fires it, then tells the audience that the missile will take three days to reach Earth, giving everyone time to get their affairs in order before getting killed (which explains the \"That's All Folks!\" ending card where Marvin the Martian says, \"Don't worry, folks. After all, it's only a cartoon.\").\n* The Nickelodeon version of this cartoon cuts out the \"That's All Folks!\" ending card where Marvin the Martian says, \"Don't worry, folks. After all, it's only a cartoon,\" along with the edits made to it when it was reformatted as a cartoon short.\n* The edited version of this cartoon has also been seen on ABC, Cartoon Network, and even in such home video releases as Marvin the Martian and K-9: 50 Years on Earth VHS, Marvin the Martian: Space Tunes VHS, the Bugs and Friends Japanese laserdisc set, both the DVD and Blu-Ray release of ''Daffy Duck's Quackbusters and the Looney Tunes Platinum Collection: Volume 1 Blu-Ray set.\n* Almost all current prints of this cartoon are edited. However, this short can be seen in its entirety as part of the Daffy Duck Thanks-for-Giving Special, available on The Essential Daffy Duck DVD set.\nReferences\nExternal links\n*\n* [https://mubi.com/films/duck-dodgers-and-the-return-of-the-24th-century Duck Dodgers and the Return of the 24½ Century on MUBI]\n* [https://www.filmaffinity.com/en/film216123.html Duck Dodgers and the Return of the 24½ Century'' on FilmAffinity]"
    }
  ]
}