{
  "content": [
    {
      "type": "text",
      "text": "# Dune (mathematics software)\n\n| operating_system = Linux, Unix, OS X\n| programming_language = C++\n| genre = Finite element analysis\n| license = GPL (version 2) with \"runtime exception\"\n| website =\n}}\nDUNE (Distributed and Unified Numerics Environment) is a modular C++ library for the solution of partial differential equations using grid-based methods.\nThe DUNE library is divided into modules.  In version 2.9 are the core modules\n* general classes and infrastructure: dune-common,\n* geometry classes: dune-geometry,\n* grid interface: dune-grid,\n* linear algebra classes: dune-istl,\n* local ansatz functions: dune-localfunctions.\nIn addition, there are several further modules, including some which have been developed by third parties.\nHistory\nThe development of DUNE started in 2002 on the initiative of Prof. Bastian (Heidelberg University), Dr. Ohlberger (during his habilitation at the University of Freiburg), and Prof. Rumpf (then University of Duisburg-Essen). The aim was a development model which was not attached to a single university, in order to make the project attractive for a wide audience. For the same reason a license was chosen which allows DUNE together with proprietary libraries. While most of the developers still have a university background, others are providing commercial support for DUNE.\nGoals\nWhat sets DUNE apart from other finite element programs is that right from the start the main design goal of DUNE was to allow the coupling of new and legacy codes efficiently.  DUNE is primarily a set of abstract interfaces, which embody concepts from scientific computing.   These are mainly intended to be used in finite element and finite volume applications, but also finite difference methods are possible.\nThe central interface is the grid interface.  It describes structured and unstructured grids of arbitrary dimension, both with manifold and non-manifold structure. Seven different implementations of the grid interface exist.  Four of these are encapsulations of existing grid managers.  It is hence possible to directly compare different grid implementations.  Functionality for parallel programming is described too.\nImplementation\nVarious C++ techniques such as template programming, generic programming, C++ template metaprogramming, and static polymorphism are used.  These are well-known in other areas of software development and are slowly making their way into scientific computing.  They allow the compiler to eliminate most of the overhead introduced by the extra layer of abstraction.  A high level of standard conformance is required for this from the compiler.\nReferences\nExternal links\n* [http://www.dune-project.org DUNE webpage].\n* Scientific [https://www.dune-project.org/about/publications/ publications] about DUNE.\nBibliography\n*"
    }
  ]
}