{
  "content": [
    {
      "type": "text",
      "text": "# Dungeons & Dragons in popular culture\n\nDungeons & Dragons (D&D) is a fantasy role-playing game first published in 1974. As the popularity of the game grew throughout the late-1970s and 1980s, it became referenced in popular culture more frequently. The complement of games, films and cultural references based on Dungeons & Dragons or similar fantasies, characters, and adventures became ubiquitous after the end of the 1970s.\nDungeons & Dragons, and tabletop role-playing games in general, have exerted a deep and persistent impact on the development of all types of video games, from \"first-person shooters to real-time strategy games and massively multiplayer online games\", which in turn play a significant and ongoing role in modern popular culture.\nIn online culture, the term dungeon has since come to mean a virtual location where people can meet and collaborate. Hence, multi-user dungeons emerged throughout the 1970s and 1980s as a form of social networks or a social virtual reality. By creating a means for players to assemble and explore an imaginary world, the Dungeons & Dragons rules provided a transition from fantasy literary settings, such as those of author J. R. R. Tolkien, to fully virtual worlds.\nPublic figures who play or have played Dungeons & Dragons include comedians Stephen Colbert and Chris Hardwick, musician Moby, and actors Vin Diesel, Matthew Lillard, Joe Manganiello, Mike Myers, Patton Oswalt, Wil Wheaton, and Robin Williams.\nLiterature\nBooks\nIndependent fiction derived from the Dungeons & Dragons game appeared with the Endless Quest series of books, published by TSR, Inc between 1982 and 1987. The Endless Quest books provided a form of interactive fiction in the style of the Choose Your Own Adventure series. The continuing success of Dungeons & Dragons then sparked an even more extensive series of novels, also published by TSR, Inc. The first of these were based upon the Dragonlance campaign setting, and were released in 1984. There proved to be a lucrative market for these works, and by the 2000s a significant portion of all fantasy paperbacks were being published by Wizards of the Coast, the American game company that acquired TSR, Inc in 1997.\nThe impact of Dungeons & Dragons on players and culture has inspired reflective non-fiction works:\n* Of Dice and Men: The Story of Dungeons & Dragons and the People Who Play It, by journalist David M. Ewalt; a best-selling history of the game's development and cultural impact.\n* Fantasy Freaks and Gaming Geeks: An Epic Quest for Reality Among Role Players, Online Gamers, and Other Dwellers of Imaginary Realms, by journalist and gamer Ethan Gilsdorf; a travel memoir about Dungeons & Dragons, role-playing games, and other fantasy and gaming subcultures.\n* The Elfish Gene: Dungeons, Dragons and Growing Up Strange, by novelist Mark Barrowcliffe; a memoir of playing Dungeons & Dragons and other role playing games in the 1970s.\n* Author Shelly Mazzanoble wrote a humorous self-help guide called ''Everything I Need to Know I Learned from Dungeons & Dragons: One Woman's Quest to Trade Self-help for Elf-help. This followed her guide book, Confessions of a Part-time Sorceress: A Girl's Guide to the Dungeons & Dragons Game.\n* American Nerd: The Story of My People is Time'' magazine writer Benjamin Nugent's study of the history and culture of people labeled nerds. It includes insights into why people play and enjoy Dungeons & Dragons.\nSeveral characters created for playing Dungeons & Dragons, or games derived from Dungeons & Dragons, have later spawned popular fantasy series. Other novels make off-hand references to the game:\nComics\nBegun in 1986, the comic books The Adventurers and Redfox were inspired by Dungeons & Dragons. Several commercial comic strips are based entirely upon the game or make reference to the game in specific panels.\n* Knights of the Dinner Table is a comic-sized magazine featuring comic strips with a variety of characters who play \"HackMaster,\" a parody of Dungeons & Dragons. (HackMaster would later go on to become an actual role-playing game.) Early strips appeared in the official Dungeons & Dragons magazine Dragon.\n* The Order of the Stick is a satirical webcomic that features a cast of characters in a world that loosely operates by the rules of Dungeons & Dragons.\n* Penny Arcade, a longstanding webcomic, created by Jerry Holkins and Mike Krahulik, references and even depicts humorous instances of bizarre campaigns, and other Dungeons & Dragons subject matter; implementing dice-rolling humor and other game dynamics.\nVisual media\nFilm\nSeveral films include instances of characters playing the game of Dungeons & Dragons. There have also been three feature films released that were based upon the game: Dungeons & Dragons (2000), Dungeons & Dragons: Wrath of the Dragon God (2005), and Dungeons & Dragons: The Book of Vile Darkness (2012). As of 2023, Paramount Pictures, RatPac-Dune Entertainment, Sweetpea Entertainment, Vertigo Entertainment, Hasbro Studios and Allspark Pictures published a new Dungeons & Dragons film, Dungeons & Dragons: Honor Among Thieves, directed by Jonathan Goldstein and John Francis Daley. The film was released on March 31, 2023.\n* In scene 2 of Steven Spielberg's E.T. the Extra-Terrestrial, the character Elliott, his older brother, and his friends are shown playing Dungeons & Dragons. Prior to the production of the film, Spielberg ran a Dungeons & Dragons session with the young cast members.\n* The Futurama film ''Bender's Game includes Dungeons & Dragons'' as a crucial plot device, in which the main characters end up in a fantasy realm after the game is played. The film was already in production upon Gygax's death and debuted later that year, so it was dedicated in his honor. The film included parodies of Dungeons & Dragons-influenced films.\n* The films The Gamers and The Gamers: Dorkness Rising by the Dead Gentlemen are parodies of Dungeons & Dragons.\n* The 2020 animated film Onward by Pixar used Dungeons & Dragons monsters, particularly the Gelatinous Cube and the Beholder.\nTelevision\nThe CBS network ran a Saturday morning cartoon series called Dungeons & Dragons, in which a group of teenagers visiting a Dungeons and Dragons-themed theme park dark ride are magically transported into the fantasy world of Dungeons and Dragons. The show included the voice talents of Willie Aames of Eight is Enough, and ran from 1983 to 1985.\nDungeons & Dragons is also referenced in a variety of television programs:\n* Community – A second-season episode titled \"Advanced Dungeons and Dragons\" (AD&D) centers around the study group playing a game of Advanced Dungeons & Dragons to cheer up their near-suicidal classmate, \"Fat Neil\". Pierce's exclusion leads him to barge into the game, and torment everyone. A later episode called \"Advanced Advanced Dungeons & Dragons\" included a game of D&D which is played in order to reunite Buzz Hickey with his son.\n* Freaks and Geeks – The final episode of the series, titled \"Discos and Dragons\", Daniel (James Franco) is forced to join the Audio/Visual Club and the geeks invite him to a game of Dungeons & Dragons. He ends up enjoying it.\n* The Sarah Silverman Program - In the second-season episode Bored of the Rings, a planned date night is disrupted by a Dungeons & Dragons game.\n* In the Radio Daze episode of ''That '70s Show, Donna is asked if she and Eric would like to stay to play Dungeons & Dragons at the radio station where she works. At the end of the episode, two staff members are shown playing a session, with a cameo appearance by Alice Cooper who is also shown playing.\n* The Simpsons – Homer tells how he bonded with some new geek friends by playing Dungeons & Dragons \"for three hours&nbsp;... then I was slain by an elf.\"\n* Buffy the Vampire Slayer – In the episode \"Chosen\", Andrew, Xander, Giles, and one of the potential Slayers, Amanda, play Dungeons & Dragons while Anya sleeps at the table.\n* NewsRadio – In the episode \"The Real Deal\", Dave demonstrates to Jimmy that he manages the station as if it were a D&D game.\n* The IT Crowd – In the fourth series episode titled \"Jen The Fredo\", Moss has been making his own Dungeons & Dragons game and eventually gets John, John, Roy, and Phil to play, entertaining his business connections and helping Roy relieve his depression.\n* Corner Gas – In the episode \"Happy Campers\", Brent is seen playing a game of Dungeons & Dragons with a group of teenage boys in the city.\n* Tucker's Luck – In the third series episode 7 Peter \"Tucker\" Jenkins played by Todd Carty played Dungeons & Dragons'' at his girlfriend's pal's house. The Dungeon Master was played by Charley Boorman.\n* Gravity Falls – The thirteenth episode of the second season, \"Dungeons, Dungeons & More Dungeons\", is centered around a game of a similar name based on mathematics, chance and imagination.\n* Stranger Things – The main characters are seen playing Dungeons & Dragons, and the game both sets the tone and functions as a storytelling tool within the series. Monsters from the alternate reality known as the Upside Down are nicknamed after creatures from the game, like the Demogorgon, the Mind Flayer, and Vecna. Season 4 also depicts aspects of the moral panic surrounding D&D of the mid-1980s.\n* The Magicians – The eleventh episode of the first season, \"Remedial Battle Magic\", has the protagonists discover a Japanese spell called マジック ミサイル (majikku misairu) which causes Quentin to exclaim \"Magic missile? That's like straight up Dungeons and Dragons.\"\n* The Big Bang Theory – In the episode \"The D&D Vortex\", Wil Wheaton invites Leonard to play a game with him and a group of celebrity players, including William Shatner, Kevin Smith, Joe Manganiello, and Kareem Abdul-Jabbar. Will serves as the Dungeon Master.\n*My Little Pony: Friendship is Magic – In the sixth season episode \"Dungeons & Discords\", Discord, Spike and Big McIntosh play a fantasy role-playing game titled Ogres & Oubliettes. In reference to this franchise crossover, Wizards of the Coast sponsored a D&D-themed charity fundraising campaign featuring the My Little Pony main characters, dubbed with the title Friendship & Magic, and a set of cards compatible with Magic: The Gathering.\n*Futurama - Gary Gygax guest starred as himself in the season two episode \"Anthology of Interest I\" where he, along with then-vice president Al Gore, Star Trek cast member Nichelle Nichols, and Stephen Hawking (all of whom guest starred as themselves) try to kill series protagonist Philip J. Fry to repair the space time continuum. They fail and end up playing Dungeons & Dragons for the next quadrillion years.\nInternet\n*Critical Role – An actual-play Dungeons & Dragons web series initially produced by Geek & Sundry and now produced by Critical Role Productions; it premiered on March 13, 2015. Voice actor Matthew Mercer leads a group of several other fellow voice actors through D&D. The web series consists of multiple D&D campaigns. The group then started a Kickstarter in March 2019, raising over US$11 million in order to fund turning the first campaign into an animated series. This broke the previous record for the most-funded TV or film project on the crowdfunding website. The animated series, The Legend of Vox Machina, was later picked up by Prime Video who ordered 14 additional episodes (two additional episodes for season 1 and a second season of 12 episodes). It premiered on February 4, 2022.\n* Dimension 20 – An actual-play Dungeons & Dragons series produced by CollegeHumor. It features Brennan Lee Mulligan as its primary Dungeon Master, and its seasons each feature distinct arcs based on different settings.\nAudio media\nMusic\nDungeons & Dragons is referenced in popular music:\n* Flashlight Brown's song \"Ready to Roll\" is a veiled reference to a group playing Dungeons & Dragons.\n* Owen Pallett's album He Poos Clouds is roughly based on the concept of the eight schools of magic from Dungeons & Dragons.\n* Stephen Lynch has a comedic song titled \"D&D\" on his album Superhero.\n* Weezer's song \"In The Garage\" mentions the ''Dungeon Master's Guide'' and a twelve-sided die, among other nerdy elements.\n*Jumpsteady's song from the album Master of the Flying Guillotine, \"Dungeon Master\" references the game.\n*The Mountain Goats' 2019 album In League with Dragons was inspired by D&D.\n*My Chemical Romance makes a reference to D&D in the intro to the official music video for their song \"I'm Not Okay (I Promise)\".\nPodcast\n* A special episode of the McElroy Brothers' flagship podcast My Brother, My Brother and Me called \"The Adventure Zone\" was released on August 18, 2014. It featured the brothers playing a game of Dungeons & Dragons with their father, Clint. \"The Adventure Zone\" was later developed into its own podcast on the Maximum Fun network.\n* Dungeons & Daddies is a comedic actual-play Dungeons & Dragons podcast about four dads who must rescue their sons from the Forgotten Realms.\nInteractive media\nDungeons & Dragons is referenced in popular video games:\n* Borderlands 2 downloadable content ''Tiny Tina's Assault on Dragon Keep involves Tiny Tina serving as a game master of Bunkers and Badasses, the \"Borderlands version of Dungeons & Dragons\".\n* Canadian video game designer and developer merritt k created the 2015 Twine game (ASMR) Vin Diesel DMing a Game of D&D Just For You'' based on American actor Vin Diesel's D&D fandom.\n* In Life Is Strange: Before the Storm, there is a part where the player can choose the option for the main character Chloe to join in on a D&D campaign.\nPlayers\nStephen Colbert developed an intense interest in the game during his youth, which he later credited for his talent at character creation. Ethan Gilsdorf credited the game for bestowing upon him \"gifts of creativity and self-actualization\". Actor Vin Diesel, in his introduction to the book Thirty Years of Adventure, wrote that he was \"attracted to the artistic outlet the game provided\" and that the game was \"a training ground for our imagination and an opportunity to explore our own identities\". Vin Diesel, Mike Myers, and Robin Williams also participated in the 2006 Worldwide Dungeons & Dragons Game Day, demonstrating that the game was then still a lively and active hobby.\nDirector Chris Weitz pointed out that there \"are a lot of people who played and are horribly embarrassed about it and won't admit it, because it's part of their lives they put behind\". He developed a fervent interest in the game, even greater than in making movies, and said the experience \"had such an influence on his life\". Director Jon Favreau was drawn into the game by the fantasy elements and the sense of story, saying \"it gave me a really strong background in imagination, storytelling, understanding how to create tone and a sense of balance\".\nPolitical reporter John J. Miller said that Dungeons & Dragons was a big part of his life during his school years, and argued that, \"there's a lot to admire about D&D and what it can do for kids by encouraging them to read, do math, and think creatively\". Fantasy author China Miéville said that playing Dungeons & Dragons as a youth was one of the most enduring influences on his writing. The two things that particularly influenced him were \"the mania for cataloging the fantastic\" and \"the weird fetish for systematization\", in that everything is reduced to \"game stats\". In contrast, author Mark Barrowcliffe considers his years playing Dungeons & Dragons to be a wasted youth and all of the players to be nerds. He has tried to put the experience behind him.\nList of notable D&D players\nThe following public figures have stated that they play, or have played, Dungeons & Dragons, indicating the game's broad appeal to a diverse range of talented individuals.\n* Sherman Alexie, poet, novelist and young adult author\n* Bill Amend, cartoonist\n* Kevin J. Anderson, author\n* Lee Arenberg, actor\n* Mark Barrowcliffe, author\n* Drew Barrymore, actress\n* David Benioff, screenwriter\n* Chester Bennington, musician\n* Big Show, professional wrestler and actor\n* Jim Butcher, author\n* Ta-Nehisi Coates, author, senior editor of The Atlantic\n* Stephen Colbert, Emmy Award winning comedian\n* Anderson Cooper, Emmy Award television personality, news anchor author and author\n* Terry Crews, actor and former football player\n* Rivers Cuomo, musician\n* Felicia Day, actress\n* Judi Dench, actress\n* Junot Díaz, Pulitzer Prize-winning novelist and short story writer\n* Vin Diesel, actor\n* Cory Doctorow, blogger, journalist, novelist, co-editor of the blog Boing Boing\n* Lexa Doig, actor\n* Tim Duncan, former NBA basketball player and member of the Basketball Hall of Fame\n* Jon Favreau, actor, screenwriter and director\n* James Franco, actor, author, director\n* Ethan Gilsdorf, author, poet, teacher and journalist\n* Michael Gove, conservative politician, journalist and author\n* Joseph Gordon-Levitt, actor\n* Matt Groening, Emmy Award-winning cartoonist, screenwriter, and producer\n* James Gunn, film director and screenwriter\n* Chris Hardwick, actor, writer and comedian\n* Tim Harford, economist and journalist\n* Brent Hartinger, author and playwright\n* Dan Harmon, writer, performer and producer\n* Dwayne Johnson, actor and professional wrestler\n* Kimberly Kane, pornographic actress and director\n* Paul S. Kemp, author\n* Taran Killam, actor\n* Stephen King, author\n* Matthew Lillard, actor\n* David Lindsay-Abaire, Pulitzer Prize-winning playwright and lyricist\n* Michelle Malkin, conservative columnist\n* Joe Manganiello, actor\n* Marilyn Manson, musician\n* Robert MacNaughton, actor\n* George R. R. Martin, novelist, short story writer, screenwriter, and television producer\n* Sharon McCrumb, novelist\n* China Miéville, author\n* John J. Miller, political reporter\n* David Mitchell, novelist\n* Moby, musician\n* Tom Morello, musician\n* Elon Musk, entrepreneur, CEO of SpaceX and Tesla Motors\n* Mike Myers, actor\n* Kumail Nanjiani, actor\n* Steven Novella, podcast host, writer\n* Alexis Ohanian, entrepreneur, investor\n* Patton Oswalt, actor and comedian\n* Trey Parker, co-creator of South Park\n* Aubrey Plaza, actress\n* Brian Posehn, actor and comedian\n* Bruce Reyes-Chow, Presbyterian minister, writer\n* John C. Reilly, theater actor, singer, and comedian\n* Ed Robertson, musician\n* R.A. Salvatore, fantasy novelist\n* Curt Schilling, baseball player, sports broadcaster\n* Kevin Smith, actor and director\n* Zak Smith, artist and alternative porn star\n* Steven Spielberg, film director, producer, screenwriter\n* Dylan Sprouse, actor\n* Martin Starr, actor\n* Scott Stossel, editor of The Atlantic, author\n* Rider Strong, actor\n* Paul F. Tompkins, comedian and actor\n* Mark Tremonti, musician\n* Karl Urban, actor\n* Vince Vaughn, actor\n* Pendleton Ward, animator and screenwriter\n* Gerard Way, musician\n* D. B. Weiss, screenwriter\n* Chris Weitz, producer, writer, director and actor\n* Wil Wheaton, actor\n* Joss Whedon, writer and director\n* Robin Williams, Grammy, Emmy, and Academy Award-winning actor and comedian\n* Daniel H. Wilson, author, television host, and robotics engineer\n* Rainn Wilson, actor\n* Deborah Ann Woll, actress\n* Andrew Yang, entrepreneur, philanthropist and 2020 presidential candidate\n* John Yuan, actor\n* Matthew Yuan, actor\n* Adrian Tchaikovsky, author\nReferences\n}}"
    }
  ]
}