{
  "content": [
    {
      "type": "text",
      "text": "# Dwarf rainbowfish\n\n| taxon = Melanotaenia praecox\n| authority = (M. C. W. Weber & de Beaufort, 1922)\n| synonyms = Rhombatractus praecox Weber & de Beaufort, 1922\n| synonyms_ref =\n}}\nThe dwarf rainbowfish (Melanotaenia praecox) is a species of rainbowfish in the subfamily Melanotaeniinae. It is known under a number of common names including diamond rainbowfish, neon rainbowfish, Praecox rainbowfish, dwarf neon rainbowfish, peacock rainbowfish, and Teczanka neonowa.  It is endemic to the Mamberamo River basin in West Papua in Indonesia and common in the aquarium trade.\nDescription\nThe species reaches up to  in length, but there are reports of individuals up to .  Males tend to be brighter in color and have deeper bodies than the females. Their bodies are bright blue and iridescent, and their fins are colorful. This species is active and is known to jump out of water.\nDistribution and habitat\nThe species occupies small, slow-moving tributaries in regions with rainforest.\nBehaviour\nM. praecox is considered to be omnivorous. This species is considered to be an egg-scatterer, so it is easy to breed.\nIt is a schooling fish, inhabiting the areas near the surface of their native rivers. Males will fight during spawning (which happens in the early morning ), often encircling and nipping one another, along with a display by extending their fins and increasing their intensity of iridescence.\nFemales will then spawn continuously for several days whilst the male fertilises the eggs. They will hatch within a week\nIn the aquarium\n{| class=\"wikitable\" style=\"text-align: center\"\n!colspan=2| Recommended conditions in the aquarium\n|-\n|style=\"background-color:#E9E9E9\"|Tank size|| 60 litres (15 gallons)\n|-\n|style=\"background-color:#E9E9E9\"|Water Temperature || 22–28 °C\n|-\n|style=\"background-color:#E9E9E9\"|Temperament    || Schooling, groups of 6 with. Males will display aggression if outnumbering females\n|-\n|style=\"background-color:#E9E9E9\"|Diet    || Omnivorous\n|-\n|style=\"background-color:#E9E9E9\"|pH         || 6.0–8.0\n|}\nDespite their size, this fish requires a tank of 15 gallons or more, with a length of at least 50–60 centimetres to accommodate their energetic nature. Schools of no less than six should be kept, with as much as or more females than males to limit infighting and disperse aggression.\nWhilst they are generally peaceful, males will spar with each other or other male rainbowfish especially in the morning. This should not be an issue unless there are less females in the tank or the school is too small. They can be kept with practically any tropical freshwater fish that is not large or aggressive enough to eat them.\nOwing to their omnivorous habits, it is advised to feed them a varied diet, including diced leafy greens and the occasional live food  such as mosquito larvae and brine shrimp as it will stimulate their instincts and enhance their colours.\nThis species will appreciate a heavily planted tank, including floating plants to make them feel safe from what would be overhead threats in the wild. They enjoy temperatures around 25°C and a pH of 7.\nReferences"
    }
  ]
}