{
  "content": [
    {
      "type": "text",
      "text": "# Dwarf wedgemussel\n\n| status2 = LE\n| status2_system = ESA\n| status2_ref =\n| genus = Alasmidonta\n| species = heterodon\n| authority = I. Lea, 1830\n}}\nThe dwarf wedgemussel (Alasmidonta heterodon) is an endangered species of freshwater mussel, an aquatic bivalve mollusk in the family Unionidae, the river mussels.\nDistribution and conservation status\nThis is a rare species found solely in North America's Atlantic coast streams and rivers of various sizes and moderate current.\nThe dwarf wedge mussel's current range extends from New Hampshire to North Carolina. The dwarf wedge mussel is federally listed as endangered and state-listed as endangered in Connecticut, Massachusetts, Maryland, North Carolina, New Hampshire, New Jersey, New York, Pennsylvania, Virginia, and Vermont.\nIt previously lived in New Brunswick, but it is locally extirpated in Canada since 1968. The Canadian Species at Risk Act listed the dwarf wedgemussel in the List of Wildlife Species at Risk as being extirpated in Canada.\nBiotope\nThis mussel may be found in small creeks to deep rivers in stable habitats with substrates ranging from mixed sand, pebble and gravel, to clay and silty sand. In the southern portion of its range, it is often found buried under logs or root mats in shallow water (USFWS 1993), where in the northern portion of its range, it may be found in firm substrates of mixed sand, gravel or cobble, or embedded in clay banks in water depths of a few inches to greater than 20 feet (Fichtel and Smith 1995; Gabriel 1995; Gabriel 1996; Nedeau and Werle 2003; Nedeau 2004a, 2004b, 2006).\nDescription\nThe dwarf wedgemussel is possibly the only freshwater mussel from North America that has two lateral teeth on the right valve and only one on the left side. The dwarf wedgemussel is a small mussel, whose shell size rarely exceeds  in length and  high. The trapezoidal-shaped shells are colored brown or yellowish-olive, with reddish brown or greenish rays in young or pale specimens. The nacre is bluish or silvery white, and is iridescent on the posterior.\nBiology and ecology\nIts reproductive cycle is typical of other freshwater mussels, requiring a host fish on which its larvae (glochidia) parasitize and metamorphose into juvenile mussels. The dwarf wedgemussel is not a long-lived species as compared to other freshwater mussels; life expectancy is estimated at 10 to 12 years (Michaelson and Neves 1995).\nA number of fish species have been positively identified as hosts for the dwarf wedgemussel. Michaelson and Neves (1995) confirmed the tessellated darter (Etheostoma olmstedi), Johnny darter (Etheostoma nigrum), and mottled sculpin (Cottus bairdi) as host fish for dwarf wedgemussels in the southern part of its range. Wicklow (in New Hampshire Wildlife Action Plan 2005) confirmed the slimy sculpin (Cottus congatus) and juvenile and parr of the Atlantic salmon (Salmo salar) as host fish for dwarf wedgemussels in New Hampshire.\nThe dwarf wedgemussel is considered to be a long-term brooder. In general, dwarf wedgemussel glochidia may be released between March and June, with peak release times varying from south to north. Michaelson and Neves (1995) documented the reproductive cycle of the dwarf wedgemussel from North Carolina and observed that this species spawns in late summer, becomes gravid in September, and releases glochidia in April. Wicklow (in New Hampshire Wildlife Action Plan 2005) observed glochidia release beginning in March and continuing through June in the Ashuelot River in New Hampshire. In a study of dwarf wedgemussel reproduction in the Mill River, Massachusetts, McLain and Ross (2005) observed that most glochidia were released in April and May.\nReproductive output appears to be correlated with local population abundance. McLain and Ross (2005) documented that sites with the highest abundance of adult dwarf wedgemussels also demonstrated the highest proportion of gravid females, glochidial density, host infection, and density of juvenile mussels.\nPopulations\nAt one time, this species was recorded from 70 localities in 15 major drainages ranging from North Carolina to New Brunswick, Canada. Since the species was first listed as endangered by the U.S. Fish and Wildlife Service in 1990 (55 FR 9447 9451), a number of new locations have been discovered and a number of known locations are possibly no longer extant. Based on preliminary information, the dwarf wedgemussel is currently found in 15 major drainages, comprising approximately 70 \"sites\" (one site may have multiple occurrences). At least 45 of these sites are based on less than five individuals or solely on spent shells. The only known occurrence in New Brunswick, Canada (Petticodiac River) appears to be historic; no live mussels or spent shells were found during a 1997 survey (Hanson 1998).\nThe mainstem of the Connecticut River in New Hampshire and Vermont is considered to have the largest remaining dwarf wedgemussel population, consisting of three distinct stretches of sporadically occupied habitat segmented by hydroelectric dams. It is estimated that there are hundreds of thousands of dwarf wedgemussels scattered within an approximate 75-mile stretch of the Connecticut River. The Ashuelot River in New Hampshire, the Farmington River in Connecticut, and the Neversink River in New York harbor large populations, but these number in the thousands only. The remaining populations from New Jersey south to North Carolina are estimated at a few individuals to a few hundred individuals.\nStrayer et al. (1996) speculated that many dwarf wedgemussel populations, particularly in the southern portion of the range, may be threatened by low densities, small ranges. and linear structure (i.e., an entire population in one stream with no possibility of refuge from catastrophes or stochastic events). Low-density populations may lead to a loss of productivity due to reproductive impediments (e.g., the distance between mussels being too great) or loss of genetic variability. The Mill River in Hatfield and Whately, Massachusetts is an example of a river with a dwarf wedgemussel population patchily distributed over an approximate 16-mile stretch. The most reproductively robust patch is limited to a small stretch (< 1 mile) making it extremely vulnerable to a catastrophic event. The remainder dwarf wedgemussels are sparsely scattered and may demonstrate a reduced capability to reproduce as indicated by McLain and Ross (2005).\nAgricultural run-off has been identified as a significant threat to dwarf wedgemussel populations in Massachusetts, Maryland, and North Carolina. In 2001, more than 25 dwarf wedgemussels and hundreds of other mussels (including state-listed species) were killed in the Mill River, Massachusetts, by waste run-off from a small farm.\nRecently, severe flooding in the Baltimore and Neversink Rivers in Pennsylvania and New York, respectively, resulted in the destruction of occupied habitat and loss of dwarf wedgemussels. Surveys conducted at two sites on the Neversink River below a dam in Cuddebackville, New York, derived abundance estimates ranging from 60 to 500 dwarf wedgemussels per site (Cole et al. 2004) prior to 2005. Severe flooding in the spring of 2005 scoured the river channel and deposited cobble in at least one of the sites previously surveyed. Resurveys in 2005 of the two sites conducted after the flood event detected one fresh dead dwarf wedgemussel and no live mussels (Cole and White 2006). Surveys in 2006 indicated that the dwarf wedgemussel population in the Neversink River was adversely affected by flood events, although some live mussels were detected.\nLittle riverine habitat adjacent to extant populations is protected other than by state shoreline protection regulations or local land use regulations. Development of adjacent uplands continues to be a significant and pervasive threat to southern populations. In summary, it appears that the populations in North Carolina, Virginia, and Maryland are declining as evidenced by low densities, lack of reproduction, or inability to relocate any dwarf wedgemussels in follow-up surveys. Populations in New Hampshire, Massachusetts, and Connecticut appear to be stable, while the status of populations in the Delaware River watershed affected by the recent floods of 2005 is uncertain at this time.\nReferences\nFootnotes\nBibliography\n* [http://nyfo.fws.gov/es/dwm.pdf#search='Alasmidonta%20heterodon' Dwarf Wedgemussel Recovery Plan: US Fish and Wildlife Service]  (PDF document)\n* [http://www.natureserve.org/explorer/servlet/NatureServe?searchName=Alasmidonta+heterodon NatureServe Explorer report]\n* [http://www.dec.state.ny.us/website/dfwmr/wildlife/endspec/dwmufs.html Dwarf Wedgemussel Fact Sheet]\n* Andrew Moser, G. and the Fish and Wildlife Service.  14 March 1990.  Endangered and Threatened Wildlife and Plants; Determination of Endangered Status for the Dwarf Wedge Mussel.  Federal Register, 55(50):9447-9451.\n* Cole, J. C., B. S. White and C. Apse. 2004. A quantitative assessment of freshwater mussels (Bivalvia:Unionidae) in the Neversink River prior to the Cuddebackville Dam removal. Report to The Nature Conservancy, Cuddebackville, New York. 16 pp.\n* Cole, J. and B. S. White. 2006. An assessment of freshwater mussels in the Neversink River following removal of the dam at Cuddebackville, NY and a severe spring flood event. Report to The Nature Conservancy, Cuddebackville, NY. 12 pp.\n* Fichtel, C. and D. G. Smith. 1995. The Freshwater Mussels of Vermont. Nongame and Natural Heritage Program, Vermont Fish and Wildlife Department. Technical Report 18. 53 pp.\n* Gabriel, M. 1995. Freshwater mussel distribution in the rivers and streams of Cheshire, Hillsborough, Merrimack and Rockingham, Counties, New Hampshire. Report submitted to U.S. Fish and Wildlife Service, New England Field Office and New Hampshire Fish and Game Department. 60 pp.\n* Gabriel, M. 1996. 1996 Monitoring of the dwarf wedgemussel (Alasmidonta heterodon) in the Ashuelot and Connecticut Rivers, New Hampshire. Report submitted to The Nature Conservancy, Eastern Regional Office, Boston, Massachusetts. 27 pp.\n* Hanson, M. J. 1998. March 24. Re: status of dwarf wedgemussel [personal email]. Accessed March 24, 1998.\n* McLain, D. and M. R. Ross. 2005. Reproduction based on local patch size of Alasmidonta heterodon and dispersal by its darter host in the Mill River, Massachusetts, USA. Jour. N. Am. Benthol. Soc., 24(1):139-147.\n* Michaelson, D. L. and R. J. Neves. 1995. Life History and habitat of the endangered dwarf wedgemussel Alasmidonta heterodon (Bivalvia:Unionidae). Jour. N. Am. Benthol. Soc. 14:324-340.\n* Nedeau, E. J. 2004a. A Fourth Investigation of the Survival of Dwarf Wedgemussels (Alasmidonta heterodon) for the Relocation Project on the Connecticut River, Route 2 Stabilization Project, Lunenburg, Vermont. Unpublished report submitted to the U.S. Fish and Wildlife Service, Concord, New Hampshire. 7 pp.\n* Nedeau, E. J. 2004b. Quantitative survey of dwarf wedgemussel (Alasmidonta heterodon) populations downstream of the Surry Mountain Flood Control Dam on the Ashuelot River. . Unpublished report submitted to the U.S. Fish and Wildlife Service, Concord, New Hampshire. 12 pp.\n* Nedeau, E. 2006. Characterizing the Range and Habitat of Dwarf Wedgemussels in the \"Middle Macrosite\" of the Upper Connecticut River. Unpublished report submitted to the U.S. Fish and Wildlife Service, Concord, New Hampshire. 6 pp.\n* Nedeau, E. J. and S. Werle. 2003. Freshwater Mussels of the Ashuelot River: Keene to Hinsdale. Unpublished report submitted to the U.S. Fish and Wildlife Service, Concord, New Hampshire. 50 pp.\n* Strayer, D. L., S. J. Sprague and S. Claypool. 1996. A range-wide assessment of populations of the dwarf wedgemussel Alasmidonta heterodon. J. N. Am. Benthol. Soc. 15(3):308-317.\n* U.S. Fish and Wildlife Service. 1993. Dwarf Wedge Mussel Alasmidonta heterodon Recovery Plan. Hadley, Massachusetts. 52 pp.\n* Wicklow, B. 2005. in New Hampshire Wildlife Action Plan. New Hampshire Fish and Game Department, 11 Hazen Dr., Concord, NH, 03301. pp. A26-A35."
    }
  ]
}