{
  "content": [
    {
      "type": "text",
      "text": "# Dwight D. Eisenhower Presidential Library, Museum and Boyhood Home\n\n| inauguration_date =\n| namesake = Dwight D. Eisenhower\n| construction_start_date =\n| completion_date =\n| cost =\n| size =\n| management = NARA\n| architect =\n| website = [https://www.eisenhower.archives.gov Eisenhower Library, Museum and Boyhood Home]\n}}\nThe Dwight D. Eisenhower Presidential Library, Museum and Boyhood Home is the presidential library and museum of Dwight David Eisenhower, the 34th president of the United States (1953–1961), located in his hometown of Abilene, Kansas. The museum includes Eisenhower's boyhood home, where he lived from 1898 until being appointed to West Point in 1911, and is also the president's final resting place. It is one of the thirteen presidential libraries under the auspices of the National Archives and Records Administration (NARA).\nHistory\nThe Eisenhower Presidential complex is only one of two whose creation preceded the close of a presidency, and while this is obviously the case with his boyhood home, construction of the library itself began in 1958, and the museum portion before he even took office, coinciding with the then-General's announcement of his presidential candidacy in June 1952.\nEisenhower Foundation\nAs World War II came to an end, local admirers of the Supreme Commander of Allied forces in Europe, such as Charles L. Brainard, decided to honor Eisenhower with a museum. In 1945, a non-profit foundation in his name was created to purchase his boyhood home and build the museum on the same property. It was to house artifacts from veterans, and the honors of Eisenhower in particular. At the time, the General's mother Ida was still alive and refused to sell the property. When she died in 1946, another purchase attempt was made. However, the fund-raising tactics of the foundation offended Eisenhower, and this almost scuttled the project. New fundraising rules were established for the Foundation after its discussion with Ike's youngest brother Milton, and agreement by all the Eisenhower brothers. They ultimately donated the house to the Foundation, and the entire site, in south Abilene, later became the Eisenhower Presidential Center.\nConstruction of the Museum\nMrs. Eisenhower's home opened to the public as a museum on June 22, 1947. and the cornerstone of an Eisenhower/World War II museum was laid in June 1952 by the General himself, just before he accepted the draft and formally announced his candidacy for President.\nThe museum was completed in 1954, and the President was in attendance when it was formally opened on November 11 of that year. He was impressed by the results, and told the leadership of the foundation that if they could raise the money to build a facility, he would donate his papers and other materials to it.\nA fundraising campaign launched in 2015 seeks to refresh and expand the museum's exhibits in 2018. If plans remain the same, the museum would be closed for about a year while the remainder of the site would remain open as usual.\nConstruction and dedication of the library\nWith the fundraising constraints on the foundation still in place in 1954, the Kansas Legislature took up the slack, authorizing a separate \"Eisenhower Presidential Library Commission,\" and over the next five years enough money was raised to begin construction. Again, President Eisenhower was present when ground was broken on October 13, 1959. The project took three years to complete, and Vice President Lyndon B. Johnson joined the retired President Eisenhower at the dedication on May 1, 1962.\nOperation of the site was turned over to the NARA in 1966, when it became the fourth library in the system.\nCampus\nThe campus has five buildings:\n*The Library\n*The Museum, restored and rededicated in 1971.\n*Visitors Center, containing a gift shop and theater where a short film on the President is shown several times daily.\n*Boyhood Home\n*A chapel, known as \"The Place of Meditation;\" the final resting place of the president, the First Lady, and their first-born son, Doud Eisenhower.\nAlso on the site:\n*A statue of General Eisenhower by Robert L. Dean, Jr., presented to the campus by the Harry and Edith Darby Foundation.\n*Five pylons inscribed with phrases commemorating Eisenhower's life from birth through the Presidency.\nGallery\nEisenhowerCenterGrounds060708a.JPG|Grounds as seen from approach to place of meditation\nEisenhower House.jpg|Front of Eisenhower boyhood home, southwest corner\nEisenhowerHome1.jpg|Southeast corner of boyhood home\nEisenhower Statue Abilene Kansas.jpg|Eisenhower statue in \"Champion of Peace\" circle, with memorial pylons in background\nDefense.gov photo essay 100508-D-7203C-007.jpg|Inside Museum lobby; Defense Secretary Robert Gates and Army Capt. Josh Mantz, 2010\nDefense.gov photo essay 100508-D-7203C-005.jpg|Museum tour; Secretary Gates and Museum Director Karl Weissenbach, 2010\nEisenhower Resting Place.jpg|View from entry corridor of \"Place of Meditation\"\nDDEisenhowerGrave3.jpg|Graves of Dwight D. Eisenhower, Doud Dwight Eisenhower and Mamie Eisenhower\nDDEisenhowerGrave.jpg|Grave of Dwight D. Eisenhower\nSee also\n*Wichita Dwight D. Eisenhower National Airport\n*Presidential memorials in the United States\n*List of residences of presidents of the United States\n*List of burial places of presidents and vice presidents of the United States\nReferences\nExternal links\n*[https://www.eisenhower.archives.gov Official site of the Eisenhower Library, Museum and Boyhood Home]\n*[https://www.eisenhowerfoundation.net/ The Eisenhower Foundation (Kansas) website]\n*[http://www.c-span.org/video/?151630-1/life-portrait-dwight-d-eisenhower \"Life Portrait of Dwight D. Eisenhower\"], from C-SPAN's American Presidents: Life Portraits, broadcast from the Eisenhower Presidential Library, Museum and Boyhood Home, October 25, 1999"
    }
  ]
}