{
  "content": [
    {
      "type": "text",
      "text": "# Dykyi Sad archaeological site\n\n(Dykyi Sad fortified settlement) |designation1_type = Archaeology |designation1_number = 231-Мк}}\n|native_name_lang=uk}}\nThe Dykyi Sad archaeological site constitutes the remains of a fortified Cimmerian settlement, an ancient port city discovered in the Dykyi Sad park () in Mykolaiv, Ukraine. The site is dated to the Bilozerka culture, around 1250–925 BC.\nLocation\nThe garden was originally laid out by Admiral Greig when he was governor of the city. The garden got its name from the wild trees that did not bear fruit. Officially, the garden was called Admiral's Garden, but the name Wild was a popular one, due to its official name being changed over time.\nThe garden suffered greatly during the two world wars. Residents cut it down due to the lack of firewood and coal. After  World War II, the garden was left as a wasteland, with only a few bushes growing. It was built up, but the name of the place remained the same.\nArchaeological sites\nArchaeological excavations are underway on the lands of the Dykyi Sad, which are free from construction. A settlement dating back to 1250–900 BC with a highly developed culture of the Late Bronze Age was found.\nThis is the only steppe settlement of that era found in Ukraine. The settlement originated 500 years before the foundation of the Greek city-state of Olbia and existed for 300 years. The Wild Garden is the only surviving monument of the Black Sea port city from the time of the legendary Troy and the Trojan War.\nOn February 22, 2016, the Mykolaiv City Council published a petition to create an open-air park-museum, the Wild Garden settlement.\nResearchers have proposed that the site is the \"City of the Cimmerians\" mentioned by Homer in the Odyssey. Though the geography of the Odyssey is a contentious field, if true, this would make Mykolaiv the oldest city in Ukraine that is mentioned in written sources. On February 22, 2016, the Mykolaiv City Council published a petition to create an open-air park-museum, the Wild Garden settlement.\nGallery\nReferences"
    }
  ]
}