{
  "content": [
    {
      "type": "text",
      "text": "# Dynasty Electrik\n\n| current_members = Jenny ElectrikSeth Misterka\n| past_members    =\n}}\nDynasty Electrik (aka Dynasty Electric) is an electronic rock and new age duo from Brooklyn, New York, and Los Angeles, California consisting of vocalist Jenny Electrik (Jennifer Deveau) and multi-instrumentalist Seth Misterka.\nHistory\nThe band was formed in 2003 by Seth Misterka, a multi-instrumentalist, producer, and composer with a background in a spectrum of musical genres. Misterka has worked with artists such as jazz musicians Anthony Braxton and William Parker, and indie bands Hot Chip, Shy Child, and The Fever.  He provides guitar, electronics and saxophone for Dynasty Electric.  Misterka met lead singer Jenny Electrik at a New York city bar in a chance encounter and asked her to join his band as a bass player. Originally the band performed experimental, instrumental improvisations. Jenny Electrik eventually assumed the role of lead singer, in addition to playing bass, synthesizer, and theremin.\nThe duo wrote and released their first single \"Hypnotized\" followed by the full-length album Black Box in 2004. They spent the following years touring the world and appearing in festivals like Summerfest, SXSW, CMJ Music Marathon, BAM's Sounds Like Brooklyn Festival, The Brooklyn Museum, Dewey Beach Music Festival, and the Burning Man Festival.\nIn 2009, they released the EP Burning, inspired by their appearance at Burning Man. This was followed by a U.S. tour in support of The Meat Puppets.\nAlso in 2009, Dynasty Electric was noticed by entrepreneur and hip-hop mogul Damon Dash who paired the band with producer Ski Beatz to record their third record Golden Arrows. The album was independently released in May 2011. British music news outlet NME named \"Radiation\", a track from the record as one of the \"Top Best Free MP3 Downloads\" during that week. At the same time, the online pop culture outlet Culture Brats hosted Dynasty Electric as their featured artist, later naming Golden Arrows in their list of the \"Top 35 Albums of 2011\".\nIn the summer of 2011, Dynasty Electric released a single \"Electric Love\" (with guest drummer Brian Chase from the Yeah Yeah Yeahs), and signed with Brooklyn-based label No Shame. Their self-titled album was produced by David Maurice (Kerli, Garbage) and features critically acclaimed turntablist DJ Logic. It was released in May 2012. The first single and video \"Eye Wide Open\" premiered on Nylon Blog, aired on MTV's 120 Minutes and has become a viral YouTube hit. It has also been the subject of over 450 remixes worldwide through Indaba Music. The second single, \"Just Like That\", was featured in a Victoria's Secret national TV commercial.\nIn 2013, Dynasty Electric launched their own media label and events company - NewSonic. Their 5th album, Euphoria was released on November 12, 2013. In 2014, they released the single \"Raw Honey\", and in 2015 they released an EP called A Million Words of Love.\nIn 2016, the group changed the spelling of their name to Dynasty Electrik and re-located to Los Angeles, California. They became resident sound bath artists at Mystic Journey Crystal Gallery in Venice, California, and released the albums Crystal Sound Bath (2018) and Los Angeles Sound Bath (2019).  Their transformation from Brooklyn electronic rock artists to Los Angeles sound healers was the subject of articles in Forbes and Magnetic Magazine.\nDiscography\nLPs\n{| class=\"wikitable\"\n|-\n! Title !! Year\n|-\n| Black Box || 2005\n|-\n| Golden Arrows || 2011\n|-\n| Dynasty Electric || 2012\n|-\n| Euphoria || 2013\n|-\n| Crystal Sound Bath||2018\n|-\n| Los Angeles Sound Bath||2019\n|}\nEPs\n{| class=\"wikitable\"\n|-\n! Title !! Year\n|-\n| Toxic|| 2002\n|-\n| Things Have Fallen || 2003\n|-\n| Burning|| 2009\n|-\n| Electric Love|| 2011\n|-\n| A Million Words of Love|| 2011\n|}\nSingles\n{| class=\"wikitable\"\n|-\n! Title !!  Year\n|-\n| \"Straight Line\" || 2006\n|-\n| \"The Manmachine\" || 2006\n|-\n| \"Eye Wide Open\"|| 2012\n|-\n| \"Euphoria\" || 2013\n|-\n| \"Raw Honey\" || 2014\n|-\n| \"Wild Animal\" || 2016\n|-\n| \"Supernatural Animal Remix\" || 2016\n|}\nAppears on\n{| class=\"wikitable\"\n|-\n! Album title !! Song title !! Year\n|-\n| Newsonic Vol. 1|| \"Golden Arrows\" || 2013\n|-\n| Newsonic Vol. 1 || \"Radiation\" || 2013\n|-\n| Newsonic Vol. 1 || \"Golden Arrows\"  (reggae Remix)|| 2013\n|-\n| Newsonic Vol. 1|| \"Lyrical Miracle\" (Htimsetan Remix)|| 2013\n|-\n| Newsonic Vol. 1|| \"Golden Arrows\" (Full Orchestra Mix) || 2013\n|-\n| Sugar Sadness  || \"ESugar Sadness\" (Feat.Dynasty Electric) -Original Mix || 2012\n|-\n| Occupy This Album || \"This is What America Looks Like\" || 2012\n|}\nMusic videos\n{| class=\"wikitable\"\n|-\n! Title !!  Year\n|-\n| \"Closer To Contact\"|| 2009\n|-\n| \"Turn it On\" || 2010\n|-\n| \"Golden Arrows\"|| 2011\n|-\n| \"Electric Love\" (Cid d Kid Remix) || 2012\n|-\n| \"Eyes Wide Open\"|| 2012\n|-\n| \"Oasis\"|| 2012\n|-\n| \"Electric Love\"|| 2012\n|-\n| \"Golden Arrows\" (Feat. Mr. Lif)| 2013\n|-\n| \"Lyrical Miracle (Just Like That)\" - HTIMSETAN mix|| 2013\n|-\n| \"Om Shiva\"|| 2015\n|}\nReferences\nExternal links\n*\n*[http://soundcloud.com/dynastyelectric/ Dynasty Electric SoundCloud]\n*[http://www.facebook.com/dynastyelectric/ Dynasty Electric Facebook Page]\n*[https://twitter.com/dynastyelectric/ Dynasty Electric Twitter Page]\n*[https://www.youtube.com/dynastyelectric/ Dynasty Electric Youtube Page]"
    }
  ]
}