{
  "content": [
    {
      "type": "text",
      "text": "# Dynasty: The Reunion\n\n| theme_music_composer = Bill Conti\n| country              = United States\n| network              = ABC\n| first_aired          =\n| last_aired           =\n}}\nDynasty: The Reunion is a 1991 American television miniseries that served as a reunion of the 1981–1989 prime time soap opera Dynasty which continues the story of the Carringtons, a wealthy family living in Denver, Colorado. Directed by Irving J. Moore, the four-hour miniseries was broadcast in two parts on ABC on October 20 and 22, 1991.\nPlot\nThe series finale of Dynasty, broadcast in May 1989, had left oil tycoon Blake Carrington shot by a corrupt policeman, his beloved wife Krystle in an off-screen coma, and his conniving ex-wife Alexis Colby plunging from a balcony. The Reunion picks up two years later as Blake, who survived the shooting but was then convicted for the death of his assailant, is pardoned and released from prison.\nKrystle has awakened from her coma during the two-year gap and returns to Denver, where she finds the Carrington mansion on auction. In California, she is reunited with an overjoyed Blake. Blake and Alexis' son Steven Carrington is now an environmental lobbyist in Washington, D.C., and in a relationship with Bart Fallmont. Steven's sister Fallon has split with both her husband Jeff Colby and her lover John Zorelli, and reunited with Miles Colby. Fallon is also raising her two children and Blake and Krystle's daughter, Krystina. Meanwhile, Krystle's niece Sammy Jo, having lost her fortune, is once again modeling in New York and having an affair with Arlen Marshall, a married man who owns a fashion company, Fashion Fury. On the catwalk for Fashion Fury, Sammy Jo soon comes in contact with the company's newest investor: her ex-mother-in-law Alexis, who survived the fall from the balcony two years earlier after falling on her ex-husband Dex Dexter.\nIt soon becomes clear that Blake's downfall had been orchestrated by The Consortium, a mysterious organization which now controls Denver-Carrington. The most insidious part of their plan comes to fruition as Krystle, brainwashed before her return, is compelled to make an attempt on Blake's life. Her love for Blake allows her to resist and overcome the programming, but The Consortium kidnaps Jeff. Miles, Blake's eldest son Adam Carrington, and Jeff's ex-wife Kirby Anders rescue him. Despite Adam's involvement in The Consortium's takeover, he and Blake reconcile their differences. Adam and Kirby also rekindle their past romance and Blake regains control of Denver-Carrington after Adam testifies on his behalf. Krystle and Alexis have one final catfight, with the two of them brawling at Alexis' fashion company.\nThe Carringtons reunite at the mansion as secret Consortium leader Jeremy Van Dorn, who is romantically involved with a clueless Alexis, attempts to both gain control of her company ColbyCo and kill her. He drags her to the garage and tries to asphyxiate her with carbon monoxide fumes from one of the cars parked inside, but she is rescued by Adam, as Van Dorn escapes. Fallon realizes she still loves Jeff, and leaves Miles for him yet again. Adam proposes to Kirby and Blake and Krystle hold a family celebration at the mansion to which even Alexis is invited. After Blake makes a toast to his family, the miniseries ends as he and Krystle dance together, happy at last.\nCast\nMain\n* John Forsythe as Blake Carrington\n* Linda Evans as Krystle Carrington\n* John James as Jeff Colby\n* Heather Locklear as Sammy Jo Carrington\n* Emma Samms as Fallon Carrington Colby\n* Kathleen Beller as Kirby Anders\n* Al Corley as Steven Carrington\n* Maxwell Caulfield as Miles Colby\n* Michael Brandon as Arlen Marshall\n* Robin Sachs as Adam Carrington\n* Jeroen Krabbé as Jeremy Van Dorn\n* Joan Collins as Alexis Colby\nGuest\n* Cameron Watson as Bart Fallmont\n* Alphonsia Emmanuel as Mrs. Litton\n* Wendie Malick as Carol Marshall\n* Tony Jay as Dr. Jobinet\nThe miniseries also featured several long-running supporting players from the original series: William Beckley as Carrington butler Gerard; Virginia Hawkins as Carrington maid Jeanette Robbins; and Betty Harford as Carrington cook Hilda Gunnerson. Child actors Jessica Player (Krystina Carrington) and Brandon Bluhm (L.B. Colby) also returned. Cameron Watson appeared as Steven's partner Bart Fallmont, replacing Kevin Conroy, who played the character from 1985 to 1986, who was unable to reprise his role, as Conroy was preparing for a more famous career in voice acting.\nEpisodes\n|ProdCode=101\n|Viewers=23.0\n|ShortSummary=Blake is pardoned and released from jail and Krystle is released from the Swiss hospital, so the two are reunited after spending 2 1/2 years apart. Fallon is in California and is involved with Miles Colby once again. Steven is living in Washington, D.C., with his partner Bart Fallmont. Sammy Jo is modeling in New York. Adam and Kirby have a reunion. Alexis is involved with media spin doctor Jeremy Van Dorn. Jeremy is member of shadowy organization called The Consortium, which has taken control of Denver Carrington. Jeff Colby is abducted by The Consortium. Krystle, having been programmed by the sinister Dr. Jobinet in Switzerland, tries to kill Blake.\n|LineColor=8FBC8F\n}}\n|ProdCode=102\n|Viewers=20.3\n|ShortSummary=Adam and Kirby rescue Jeff. Krystle tries to kill Blake, but her love for him is too strong, so she breaks free from the programming of The Consortium. The Consortium takeover of Denver-Carrington is deemed unlawful, so controlling interest is returned to Blake. Jeremy Van Dorn makes one last attempt to gain control of Denver-Carrington and ColbyCo. He tries to suffocate Alexis with gas, but she is rescued by Adam who again proposes to Kirby who accepts. Fallon chooses Jeff over Miles. Krystle organizes a family dinner and Alexis joins them. Blake makes a toast that acknowledges their family bond, despite their past rivalries.\n|LineColor=8FBC8F\n}}\n}}\nProduction\nDynasty cancellation in 1989 had left its ninth season finale unresolved and characters in mortal peril; original cast member John Forsythe later noted, \"The way we were cut off was a disgrace.\" Executive Producer Aaron Spelling said during production of Dynasty: The Reunion that \"Beethoven can leave a symphony unfinished ... We didn't think we could do that with a soap opera.\" Eager to give the series proper closure, the cast agreed to come back \"at slightly reduced salaries\" and production relied on location shoots rather than the expensive sets of its heyday. \"We are still groomed, groomed within an inch of our lives,\" noted star Joan Collins, who with onscreen rival Linda Evans had 42 costumes between them in the miniseries.\nOriginal cast member Al Corley returned as Steven Carrington, despite the fact that he had left the series after two seasons and been replaced by Jack Coleman. With Coleman unavailable due to scheduling conflicts, Corley stepped in, even though Steven's change in appearance with the casting of Coleman in 1983 had been attributed to plastic surgery after an oil rig explosion. Long-running Dynasty star Gordon Thomson was replaced by actor Robin Sachs in the role of unscrupulous Adam Carrington for the miniseries because of similar scheduling issues. As a result, Thomson sued Aaron Spelling Productions for breach of contract; Thomson also accused the production company of \"mismanaging\" the communications with producers on Santa Barbara, where he was then appearing in the role of Mason Capwell. The miniseries brought back Kirby Anders (Kathleen Beller), a character who had been written off in 1984, but Alexis' ex-husband Dex Dexter (Michael Nader) and Blake's half-sister Dominique Deveraux (Diahann Carroll) were not included in the miniseries.\nDynasty: The Reunion also reunited many of the crew who had worked on the original series, including writers/creators Richard and Esther Shapiro, Eileen and Robert Mason Pollock, Edward DeBlasio, producer Elaine Rich, cinematographer Michel Hugo and costume designer Nolan Miller.\nRatings\nDynasty: The Reunion aired on ABC on October 20 and 22, 1991. The first part was watched by 23 million US viewers, and was ranked at #15. Part 2 was watched by 20.3 million US viewers and was ranked at #17.\nHome media\nDynasty: The Reunion was released on in the United Kingdom on VHS in 1991. The miniseries was released on DVD in Australia on October 23, 2019 by Via Vision Entertainment.\nReferences\nExternal links\n*"
    }
  ]
}