{
  "content": [
    {
      "type": "text",
      "text": "# Dynasty Warriors: Gundam\n\n|EU/AU|Koei}}\n| designer =\n| composer = Masato Koike\n| engine =\n| series = Dynasty Warriors  Mobile Suit Gundam\n| released = PlayStation 3, Xbox 360PlayStation 2\n| genre = Action role-playing, hack and slash\n| modes = Single-player, multiplayer\n| platforms = PlayStation 3Xbox 360PlayStation 2\n}}\nDynasty Warriors: Gundam, originally released in Japan as , is a 2007 action role-playing game based on the Gundam anime series. It was developed by Omega Force and published by Namco Bandai Games. Its gameplay is derived from Koei's Dynasty Warriors and Samurai Warriors series. The \"Official Mode\" of the game is based primarily on the Universal Century timeline, with mecha from Mobile Suit Gundam, Mobile Suit Zeta Gundam, and Mobile Suit Gundam ZZ appearing in the game, as well as a few units from Mobile Suit Variation and Mobile Suit Gundam 0083: Stardust Memory appearing as non-playable enemy units. The \"Original Mode\" of the game also features mecha from the non-UC series Mobile Fighter G Gundam, Mobile Suit Gundam Wing and Turn A Gundam. A newly designed non-SD Musha Gundam designed by Hajime Katoki is also included.\nThe game was originally released on March 1, 2007 in Japan for the PlayStation 3 with the name Gundam Musou. A North American version was released on August 28, 2007, for both the PlayStation 3 and the Xbox 360 under the name Dynasty Warriors: Gundam  with English localization by AltJapan Co., Ltd. Dynasty Warriors: Gundam is the second next-gen Gundam game released in North America, following Mobile Suit Gundam: Crossfire. A Japanese Xbox 360 version was released in Japan on October 25, 2007 under the name of Gundam Musou International. Unlike the Japanese PlayStation 3 edition, Gundam Musou International features both Japanese and English voice overs.\nAn expanded port for PlayStation 2 called Gundam Musou Special was released on February 28, 2008 in Japan, featuring new scenarios and mobile suits.\nGameplay\nDynasty Warriors: Gundam follows in the style of previous Dynasty Warriors games as an action-oriented hack 'n' slash with some tactical elements. The biggest difference between Dynasty Warriors: Gundam and Koei's Dynasty Warriors series is the core content; rather than using characters and story from the novel Romance of the Three Kingdoms, the games draw their material from across the various Gundam anime series.\nEvery mobile suit and pilot has their own strengths and abilities, and the player is given both ranged and melee combat options. If the two types of combat are used together, they create combos that are unique for every suit-pilot combination.\nfires hyper bazooka at MS-07H-8 Gouf Flight Type mobile suit.]]\nThe single-player mode of Dynasty Warriors: Gundam is divided into two sections, Official Mode and Original Mode. Official Mode features six playable characters in stages set within the continuity of the Gundam Universal Century timeline. More specifically, they are events taken from the original Mobile Suit Gundam television series and its sequels Zeta Gundam and ZZ Gundam. Original Mode, by contrast, features an original, non-canonical storyline in which teams of mobile suit pilots composed of the three aforementioned Universal Century series and three alternate universe series (G Gundam, Gundam Wing and Turn-A Gundam) investigate a mysterious planet headed on a collision course with Earth.\nIn both Official and Original Mode, some characters will switch from one mobile suit to another for certain stages. Depending on the mode, players can choose pilots and mecha independent of each other, allowing the ability to use any combination of man and machine. Completing a character's Original Mode will allow the player to replay any of the stages from that character's Official Mode using any unlocked mobile suit and vice versa. Certain characters can be unlocked in original mode only by completing another original mode character's story. Something that long time Gundam fans will appreciate is Official Mode's \"Outcome feature\". The outcome feature gives you the chance to save or spare certain pilots or allies of their predetermined deaths, for example: Saving Emma Sheen before her Mobile Suit is destroyed or too damaged will allow her to be involved in battles that she originally would not have been a part of (like Emma joining the Drop on Jaburo instead of staying on board the Argama). Each mission is made up of a main objective which is then broken down into smaller ones that need to be accomplished under a time limit.\nSequels\nDynasty Warriors: Gundam 2 and Dynasty Warriors: Gundam 3 are tactical action video games based on the Gundam anime series, and the sequels to 2007's Dynasty Warriors: Gundam. Dynasty Warriors: Gundam 2 was released in Japan on December 18, 2008, April 21, 2009 in North America, and in Europe on April 24, 2009. Dynasty Warriors: Gundam 3 was released on December 16, 2010 in Japan, June 28, 2011 in North America, July 1, 2011 in Europe, and it was released in Australia on July 12, 2011. A fourth title, Shin Gundam Musou was released on December 19, 2013 in Japan for PlayStation 3 and PlayStation Vita, and was released in North America on July 1, 2014 and Europe on June 27, 2014 as Dynasty Warriors: Gundam Reborn. The Western release, however, is only for PlayStation 3 and only a digital-download release for North America. It also has no English audio track, a first for a Gundam game released in North America.\nReception\nX360: 58%\n| MC = PS3: 60/100X360: 55/100\n| Destruct = 6/10\n| EuroG = 8/10\n| Fam = 33/40\n| GI = 5/10\n| GamePro =\n| GameRev = C\n| GSpot = 5/10\n| GSpy =\n| GT = 5.1/10\n| GameZone = X360: 6.9/10PS3: 5.5/10\n| IGN = 6.8/10\n| OXM = 6/10\n| PALGN= 5.5/10\n}}\nOn the first day of its release, the Japanese version (Gundam Musou) sold over a 100,000 copies, making it the first PS3 title to do so on its first day. Also, the game sold about 70 percent of its 170,000  -180,000 launch day shipments, making it rank third in overall sales — after Ridge Racer 7 and Mobile Suit Gundam: Crossfire. Japanese game magazine Famitsu gave the game a total score of 33 out of 40.\nEnglish reviews were lukewarm. GameRankings and Metacritic gave it a score of 61% and 60 out of 100 for the PS3 version, and 58% and 55 out of 100 for the Xbox 360 version.\nAs of July 9, 2008, the game has sold 275,812 copies in Japan.\nNotes\nReferences\nExternal links\n*"
    }
  ]
}