{
  "content": [
    {
      "type": "text",
      "text": "# Dynasty (2017 TV series) season 1\n\n| network       = The CW\n| first_aired   =\n| last_aired    =\n| num_episodes  = 22\n| episode_list  = List of Dynasty (2017 TV series) episodes\n}}\nThe first season of Dynasty, an American television series based on the 1980s prime time soap opera of the same name, originally aired in the United States on The CW from October 11, 2017 through May 11, 2018. The season was produced by CBS Television Studios, with Sallie Patrick as showrunner and executive producer alongside executive producers Josh Schwartz and Stephanie Savage. The pilot, which was announced in September 2016, was ordered to series in May 2017. On November 8, 2017, The CW picked up Dynasty for a full season of 22 episodes. On April 2, 2018, The CW renewed the series for a second season.\nSeason one stars Elizabeth Gillies as heiress Fallon Carrington, Grant Show as her billionaire father Blake Carrington, Nathalie Kelley as Blake's new wife Cristal, and James Mackay as Fallon's brother Steven, with Robert Christopher Riley as Michael Culhane, Sam Adegoke as Jeff Colby, Rafael de la Fuente as Sam Jones, and Alan Dale as Joseph Anders. Notable recurring characters introduced in season one include Claudia Blaisdel (Brianna Brown); Monica (Wakeema Hollis); Cesil Colby (Hakeem Kae-Kazim); Liam Ridley (Adam Huber); Iris Machado (Elena Tovar); Alejandro Raya (Luis Fernández); Ted Dinard (Michael Patrick Lane); Melissa Daniels (Kelly Rutherford); Hank Sullivan (Brent Antonello); and Alexis Carrington (Nicollette Sheridan).\nPlot\nDynasty begins with heiress Fallon Carrington unhappy to find her billionaire father Blake engaged to Cristal, a rival employee at the family company. When Fallon's machinations to separate the couple backfire and cost her a promotion, she allies with Blake's nemesis and former employee, Jeff Colby, and strikes out on her own. Meanwhile, the arrival of Cristal's opportunistic nephew Sam—who becomes romantically involved with Fallon's wayward brother Steven—threatens to expose her shady past. The Carringtons form a united front in the wake of the suspicious death of Cristal's former lover Matthew, but things at the mansion do not remain harmonious for long. Blake's manipulations put him at odds with Cristal and his children, while the rivalry between Fallon and Cristal cools. Tired of waiting around for Fallon to take him seriously, Michael begins to date someone else, which only intensifies Fallon's feelings for him but drives her into Jeff's arms. Matthew's pregnant widow Claudia convalesces at the mansion with a hidden agenda, and Cristal's past comes back to haunt her in the form of her sister Iris, and Sam's father, Alejandro. Steven and Sam's on-again, off-again relationship is complicated by Sam's criminal tendencies and Steven's unstable ex-boyfriend, Ted. Jeff's partnership with Fallon is revealed to be a means for him to destroy the Carringtons for what Blake did to Jeff's father, Cesil. Fallon enlists Michael and Cristal to help her turn the tables on the Colbys, and she manages to neutralize Jeff and secure a percentage of his company. Blake's ex-wife Alexis—Steven and Fallon's mother—returns, purportedly to reconnect with her children but in fact angling for a piece of the Carrington fortune. Alexis arranges for her lover to pose as her and Blake's kidnapped son Adam, and reveals to Jeff and Monica that their mother is Blake's half-sister. Fallon ousts Blake as CEO of Carrington Atlantic just as the Colbys force a sale of the company. At Steven and Sam's wedding, an unhinged Claudia appears and shoots Cristal. Blake, Fallon, and Sam escape a fire in the stable house, but Steven, Michael, Alexis, and Cristal remain trapped inside.\nThe reboot updates several elements from the 1980s original, including moving the setting from Denver, Colorado to Atlanta, Georgia; making Steven's homosexuality a nonissue to Blake; and changing gold digger Sammy Jo from a woman to a gay man. Additionally, in the new series, both Blake's new wife and her nephew are Hispanic, and both chauffeur Michael Culhane and the Colby family are African-American.\nCast and characters\n(Nathalie Kelley) was killed at the end of season one.]]\nwas introduced as Alexis Carrington late in season one.]]\nMain\n* Elizabeth Gillies as Fallon Carrington, an Atlanta energy executive and heiress who is the daughter of billionaire Blake Carrington and his first wife, Alexis\n** Skylar Morgan Jones  and Marisa Hampton  portray younger versions of Fallon\n* Nathalie Kelley as Cristal Flores Carrington ( Celia Machado), Fallon's new stepmother, a woman with a shady past\n* James Mackay as Steven Carrington, Fallon's gay environmentalist brother\n** Paul Luke Bonenfant  and Nicholas Cordts  portray younger versions of Steven\n* Robert Christopher Riley as Michael Culhane, the Carrington chauffeur and Fallon's lover\n* Sam Adegoke as Jeff Colby, business rival to Blake, a young tech genius\n* Rafael de la Fuente as Samuel Josiah \"Sammy Jo\" Jones, Cristal's wayward nephew and Steven's fiancé\n* Alan Dale as Joseph Anders, the Carrington majordomo\n* Grant Show as Blake Carrington, billionaire CEO of Carrington Atlantic, married to Cristal, and the father of Steven and Fallon by his first wife\nRecurring\n* Brianna Brown as Claudia Blaisdel, Matthew's wife, a former engineer\n* Wakeema Hollis as Monica Colby, Jeff's sister\n* Elena Tovar as Iris Machado, Cristal's sister and Sam's mother\n* Luis Fernández as Alejandro Raya, Sam's father who is operating under the alias of Diego Calastana\n* Michael Patrick Lane as Ted Dinard, Steven's ex-boyfriend\n* Hakeem Kae-Kazim as Cesil Colby, Jeff and Monica's incarcerated father\n* Adam Huber as Liam Ridley, a writer who marries Fallon (real name: Jack Lowden)\n* Nicollette Sheridan as Alexis Carrington, Blake's ex-wife, the estranged mother of Steven and Fallon\n* Nick Wechsler as Matthew Blaisdel, Cristal's former lover, a field engineer who dies in a suspicious explosion\nGuests\n* Dave Maldonado as Willy Santiago, Matthew's friend and coworker at Carrington Atlantic\n* Michael Beach as Police Chief Aaron Stansfield, a longtime friend of Blake's\n* KJ Smith as Kori Rucks, Michael's ex-girlfriend\n* Mustafa Elzein as Ramy Crockett, Sam's friend who burglarizes the Manor at his request\n* Nana Visitor as Diana Davis, editor-in-chief of Atlanta Digest\n* Arnetia Walker as Louella Culhane, Michael's mother\n* Darryl Booker as James Culhane, Michael's father\n* Hines Ward and Jamal Anderson as themselves\n* Andi Matheny and later Natalie Karp as Mrs. Gunnerson, the Carrington cook\n* Bill Smitrovich as Thomas Carrington, Blake's father\n* Kearran Giovanni as Police Chief Bobbi Johnson\n* Kelly Rutherford as Melissa Daniels, wife of Senator Paul Daniels, and Steven's former lover\n* J. R. Cacia as Rick Morales, a journalist and old friend of Cristal's\n* Rick Hearst as  Senator Paul Daniels, a longtime contact of Blake's\n* Steven Culp as Tim Meyers, a business associate of Jeff and Fallon\n* Stephan Jones as Gerard Dinard, Ted's father\n* Elizabeth Youman as Evie Culhane, Michael's sister\n* Brent Antonello as Hank Sullivan, Alexis's lover who is impersonating her and Blake's kidnapped firstborn, Adam\n* L. Scott Caldwell as Lo Cox, Jeff and Monica's maternal grandmother, Thomas Carrington's former secretary\nEpisodes\n|Viewers         = 1.26\n|ShortSummary    = Heiress Fallon Carrington is unhappy to find her billionaire father Blake engaged to Cristal Flores, and plots to drive a wedge between them by giving her father photos of Cristal with her former lover Matthew Blaisdel. Fallon's plan backfires, pushing up the wedding and securing Cristal the promotion Fallon wanted for herself. Feeling underappreciated by Blake, Fallon sets herself up as his business rival, backed by Blake's nemesis, Jeff Colby. Anders, the Carrington family butler, makes his knowledge of Cristal's shady past known to her, and the arrival of her opportunistic nephew Sam—who has just slept with Fallon's brother, Steven—puts her in further jeopardy. Matthew is killed in the aftermath of a suspicious explosion, and his unstable wife Claudia appears at Blake's wedding to accuse him of her husband's murder.\n|LineColor       = EEDD82\n}}\n|Viewers         = 0.92\n|ShortSummary    = Cristal is devastated by Matthew's death, while Blake works to distance the Carringtons from him and his possible murder. Jeff helps Fallon delete all traces of the photos of Cristal and Matthew. Cristal proves her loyalty to Blake by relinquishing her keepsakes of her former lover, and staging a diversion for the press at Matthew's wake by declaring his love for her as one-sided. FBI agents arrive at the mansion, arresting Steven instead of Blake.\n|LineColor       = EEDD82\n}}\n|Viewers         = 0.72\n|ShortSummary    = Implicated in Matthew's death, Steven clashes with Blake, who he suspects may have been involved. When Blake blocks Fallon's use of the Carrington name for her new business venture, she looks for leverage over him. Sam's mother Iris is in trouble, but Anders has made it impossible for Cristal to send her money. Cristal remembers her past as Celia Machado, when the sisters stole a fortune, but only Cristal escaped Venezuela. Sam secretly arranges the theft of Cristal's engagement ring and other valuables during a charity gala to raise the money, but Matthew's phone and its incriminating contents, which Blake had acquired illegally, are stolen as well.\n|LineColor       = EEDD82\n}}\n|Viewers         = 0.74\n|ShortSummary    = While Cristal takes Blake on an impromptu honeymoon, Sam goes to Steven for help retrieving Matthew's phone. They get it back, but Fallon leaks the sex video of Matthew and Cristal that it contains. After her overconfidence costs her a lucrative contract, Fallon realizes she has to accept Jeff's input as well as his money. Steven is cleared of Matthew's death, but is furious when Sam admits his complicity in the robbery.\n|LineColor       = EEDD82\n}}\n|Viewers         = 0.72\n|ShortSummary    = On Cristal's first day as COO, she faces the backlash from her sex video, and a lack of confidence from the rest of the Carrington Atlantic executives. Steven's ex-boyfriend Ted Dinard reappears, hoping to reconnect. Anders manipulates Sam to keep Steven from rekindling anything with Ted. Cristal and Fallon compete for an award, which Fallon wins by subterfuge. But Fallon's triumph is short-lived when she blurts out that she was behind the leak of Cristal's video and a furious Blake kicks her out of the mansion. Cristal apologizes to an irate Claudia, who chases Cristal into the street and is accidentally hit by Blake with his car.\n|LineColor       = EEDD82\n}}\n|Viewers         = 0.64\n|ShortSummary    = Fallon and Jeff throw a launch party for Morell Corp. Fallon is jealous when Michael arrives with Kori, but their relationship withstands Fallon's meddling. Despite being drunk, Fallon helps secure important technology for the company. Claudia is pregnant, and Cristal insists that she stay at the mansion to convalesce. Sam and Claudia bond, but Claudia's erratic behavior convinces Blake and Cristal that she should leave. Sam and Cristal learn that Claudia has been taking the wrong medication.\n|LineColor       = EEDD82\n}}\n|Viewers         = 0.64\n|ShortSummary    = Kicked out of the Carrington Thanksgiving celebration by Blake, Fallon appears at Michael's church dinner and meets his parents. Steven confronts Blake about the suspicious funding for the athletic club. Claudia has been faking her memory problems, and while holding the Carringtons at gunpoint, she admits to causing the explosion that killed Matthew. Claudia wants Cristal to watch her kill Blake, but the rest of the family is able to overpower her. Fallon is welcomed back, but Blake's plan to send Claudia to a sanitarium in a coverup drives Steven to plot with Jeff against Police Chief Stansfield.\n|LineColor       = EEDD82\n}}\n|Viewers         = 0.64\n|ShortSummary    = Cristal's pursuers have found her, and Anders helps her pay them off. When Blake catches her in a lie, Cristal confesses her secrets to him. Michael's relationship with Kori implodes over his lingering feelings for Fallon, who rebounds with Jeff. Steven's plan to neutralize Stansfield blows up in his face when he learns that he was responsible for a man's death in an oil rig accident, and that Stansfield helped Blake cover it up.\n|LineColor       = EEDD82\n}}\n|Viewers         = 0.69\n|ShortSummary    = Blake brings Iris to Atlanta for the holidays, and is surprised when his domineering father Thomas arrives as well. Steven, fresh from a drug-fueled bender in New York with Ted, clashes with Blake, whose management of his company and family is already being criticized by Thomas. Cristal and Anders discover that Iris was behind the extortion plot, and a confrontation with her sister causes Cristal to admit to Sam that she killed his father to defend Iris. Fallon and Monica have a falling out. Jeff visits his father Cesil in jail, where they discuss their vendetta against Blake, who Cesil believes slept with his wife and framed him on drug charges. Blake meets a new business partner, unaware that he is Sam's father Alejandro using an assumed name.\n|LineColor       = EEDD82\n}}\n|Viewers         = 0.63\n|ShortSummary    = Cristal is a pariah at the mansion. Alejandro reveals himself to her, threatening to expose Blake's father's past crimes if she does not help him close a deal with Carrington Atlantic. A guilty Steven pawns an expensive watch and gives the money to the wife of the man who died because of his mistake. Fallon throws herself a 25th birthday party as she gains control of her $100 million trust fund, and overcomes her reluctance to fully commit herself and her money to Jeff. Meanwhile, Jeff tells his father he plans to marry Fallon to secure her assets for himself, including her shares of Blake's company. Cristal, Blake, Fallon, and Sam work together to turn the tables on Alejandro and Iris. After getting into her new car, Fallon is chloroformed by Iris.\n|LineColor       = EEDD82\n}}\n|Viewers         = 0.56\n|ShortSummary    = Alejandro and Iris hold Fallon hostage in a warehouse, demanding $15 million dollars and safe passage from Blake. He reveals to Cristal that he and his ex-wife Alexis had a son, Adam, who was kidnapped and never returned, thanks to ineffective police work. Blake tries to handle the situation without alerting the new police chief, whom Cristal has invited to dinner. With the ransom now up to $25 million, Cristal sneaks off to make the drop, but is taken as a hostage as well. Blake, Jeff, and Michael track them down; Cristal helps Fallon escape, but is whisked away in a truck by Alejandro and Iris. Cristal convinces Iris that Alejandro is bad and will only turn on her, and as Alejandro tries to strangle Cristal, Iris shoots and kills him. The sisters reconcile. Cristal sends Iris off with some cash, and tells the police she shot Alejandro in self-defense, not Iris.\n|LineColor       = EEDD82\n}}\n|Viewers         = 0.65\n|ShortSummary    = As the Carringtons prepare for a Casino Night fundraiser they are throwing for Senator Paul Daniels, Cristal learns from a journalist friend, Rick Morales, that Blake regularly bribed Daniels when he was a judge. To avoid the truth coming out, she gives Rick an alternative story about Daniels' many extramarital affairs. When the price of an important Morell Corp. property lease doubles, Fallon has the opportunity to retain her old price if she can win a poker game. Knowing she would be expected to sleep with the owner if she lost, Fallon bluffs for the win. Monica is horrified when Jeff reveals his plan to destroy Blake by using Fallon, but later agrees to help him.\n|LineColor       = EEDD82\n}}\n|Viewers         = 0.65\n|ShortSummary    = On Blake's behalf, Anders bribes a prison guard to stage an attack intended to prevent Cesil from being paroled. The parole board votes against his release, but Jeff sleeps with the parole commissioner, who sets Cesil free. Monica manipulates Fallon into accepting Jeff's marriage proposal, but Fallon discovers their duplicity and enlists Michael to help her against the Colbys. Steven decides to run for city council, and lets Ted know that tales of their wild past may become public. Still using drugs and believing that Steven and Sam are romantically involved, Ted stages a scuffle with Sam and leaps out of an upper story window.\n|LineColor       = EEDD82\n}}\n|DirectedBy      = Dawn Wilkinson\n|WrittenBy       = Francisca X. Hu & Paula Sabbaga\n|OriginalAirDate =\n|Viewers         = 0.64\n|ShortSummary    = Realizing that she inadvertently put Jeff's spyware on the Carrington server, Fallon and Michael use a dinner with the Colbys to try and access Jeff's own server to erase the data he has stolen. At dinner, Cesil explodes and reveals to Fallon all that Blake has done to the Colbys, which leaves her crushed. Sam tells Steven that he is not a legal citizen, so he cannot explain to the police what really happened with Ted. At Blake's urging, Steven spins the potentially negative publicity by pretending to be Ted's grieving partner. At Ted's hospital bedside, Steven manages to reclaim Sam's missing earring from Ted's belongings, but then Ted wakes up. Cristal receives flowers from Rick, and admits to Blake that they kissed. Aware that Rick is secretly working with Jeff, Blake presses Cristal to get as close to Rick as possible, but she refuses.\n|LineColor       = EEDD82\n}}\n|Viewers         = 0.60\n|ShortSummary    = The Carringtons proceed with preparations for Fallon's wedding to Jeff, planning to invade Jeff's home and erase his server while the Colbys are at the rehearsal. Cesil's refusal to attend forces the ruse to continue, despite Cristal's objections. Blake convinces Cesil to put aside the animosity between them and come to the ceremony, while Jeff presents Fallon with full ownership of Morell Co, and a plan for them to exchange 25% of their respective companies. On the eve of the wedding, Fallon asks Michael to marry her at city hall, but he refuses, not wanting something so important to be part of a Carrington plot. With Fallon and Jeff at the altar and the server still not breached, Blake tries to stop the ceremony, but Fallon shuts him down. Afterward, she reveals to the stunned Colbys that the marriage is invalid because she married someone else, Liam Ridley, the night before. Jeff's claim to 25% of Carrington Atlantic is therefore null and void, but Fallon now owns 25% of ColbyCo. A confrontation with Cesil causes Thomas to have a heart attack, and he admits to the Carringtons that Blake never had an affair, but was just covering for Thomas.\n|LineColor       = EEDD82\n}}\n|Viewers         = 0.63\n|ShortSummary    = As the Carringtons prepare for Thomas' funeral, Jeff and Fallon's feud goes public. Disgusted with Jeff's machinations, Monica cuts ties with him and takes guardianship of Cesil. With Sam facing deportation, Steven seeks help from Senator Daniels' wife Melissa, with whom he had an affair 10 years before. He has sex with her to secure an O-1 visa for Sam. Blake finds a videotape of Thomas that provides him with a little closure, and he apologizes to Fallon and Steven for manipulating them. At the funeral, Steven proposes to Sam, and Blake's long absent ex-wife Alexis reappears.\n|LineColor       = EEDD82\n}}\n|Viewers         = 0.69\n|ShortSummary    = The Carringtons are shocked to discover that Thomas has left the mansion and the grounds to Alexis. Blake vows to overturn the codicil to Thomas' will as Fallon makes overtures to connect with her mother. Accused of abandoning her children, Alexis tells Fallon that Blake bribed a judge to seize custody and exile her, which Cristal confirms. Fallon soon discovers, however, that Alexis has not been living a life of luxury abroad, but is housed in a trailer nearby, and has stayed in touch with Steven. A furious Fallon confronts Alexis, and their catfight takes them into the pool. Michael learns that his father has been hospitalized, and resigns. Through a bribe, Fallon ensures that the codicil is invalidated, but Alexis reveals that she does legally own Michael's stable house—her former art studio—and moves in.\n|LineColor       = EEDD82\n}}\n|Viewers         = 0.71\n|ShortSummary    = Fallon and Liam discover that Alexis is trying to sabotage Steven's engagement, but he refuses to believe them. Cristal puts the Carrington resources behind helping Michael's ailing father. Blake informs the staff that Alexis is unwelcome, and that anyone who helps her will be fired. When Anders tries to dissuade him, Blake fires him as well. Fallon manipulates Alexis into confessing, but Steven is more mad at Fallon for endangering Sam. Alexis admits to Steven that she spent all of her money trying to find Adam, Alexis and Blake's kidnapped first child. Upon being rehired, Anders warns Blake that Michael's father's illness is tied to an environmental scandal that Carrington Atlantic covered up.\n|LineColor       = EEDD82\n}}\n|Viewers         = 0.56\n|ShortSummary    = Cristal convinces Blake to go public with the truth about the scandal, but he later destroys her files on the coverup and uses a recording of her admitting guilt to keep her in line. Fallon agrees to a date with Liam. She sends Sam to try and sell back her shares in ColbyCo to Jeff, who refuses. Alexis, distrusting Liam, tries to get between him and Fallon. Steven goes on a secret trip to El Paso to track down Adam. At a fashion show, a drunken Jeff confronts Fallon before passing out. Alexis reveals to Fallon that Liam is really a journalist named Jack Lowden writing a tell-all, and Fallon cuts him loose. Sam negotiates a deal with Jeff to sell the shares, and Alexis burns Liam's manuscript—actually about his own family—before visiting Jeff.\n|LineColor       = EEDD82\n}}\n|Viewers         = 0.68\n|ShortSummary    = While Fallon and Cristal work together to gain leverage over Blake, thanks to Alexis the press learns of the ground contamination, and Carrington Atlantic's possible involvement. Intending to force her father to take responsibility and do right by Michael, Fallon is dumbstruck when Blake publicly announces her promotion to COO in Cristal's place. Sam discovers that Steven is not in Washington, D.C., just as Steven finds Adam. Alexis tries to get Jeff to pull himself together and reconcile with Monica. As they discuss Blake's longstanding grudge against the Colbys, Alexis tells Jeff that he is actually a Carrington.\n|LineColor       = EEDD82\n}}\n|Viewers         = 0.55\n|ShortSummary    = Blake wants to mend fences with Cristal, but she meets secretly with a divorce lawyer. Jeff and Monica go to their grandmother, who confirms that she had an affair with Thomas Carrington, and that their mother Millie is his daughter. Blake thwarts Fallon's plans for Carrington Atlantic, and fires Michael. Steven brings Hank/Adam home, but Blake refuses to accept him. Fallon visits Claudia looking for incriminating information on Blake, which she uses in a secret meeting with the Carrington Atlantic board to make a case for them to name her CEO in Blake's place. Alexis informs Jeff and Monica that as Thomas' grandchildren, they are entitled to a portion of his shares in Carrington Atlantic. Hank's missing finger convinces Blake that he is Adam, but Hank is actually Alexis's lover with whom she is conspiring to amass enough Carrington Atlantic shares to seize control of the company. Claudia is visited by Matthew, who is alive and vengeful toward the Carringtons.\n|LineColor       = EEDD82\n}}\n|Viewers         = 0.56\n|ShortSummary    = Fallon is named Carrington Atlantic's CEO in Blake's place, while Jeff and Monica reveal their Carrington heritage and declare their intention to force a sale of the company. Now that Fallon is in charge, Alexis changes her mind and tells Hank, who has just been added to the family trust, to vote against the sale. However, he is seduced by the money and votes with the Colbys. Melissa appears and informs Steven, who is minutes from marrying Sam, that she is pregnant. Matthew helps Claudia escape the sanitarium, and they infiltrate the mansion. Steven and Sam marry. Cristal catches Alexis kissing Hank and the women fight, which ends with Alexis locking Cristal in the stable house. Claudia snaps and confronts Cristal with a gun. Matthew steps between them as Claudia fires, except that Matthew is a figment of her imagination, and Cristal takes the bullet. Claudia flees with Hank. The Carringtons are locked in the trophy room while the building is set on fire. Michael rescues Blake, Fallon, and Sam, but Alexis runs upstairs to release Cristal, and Steven is nowhere to be found.\n|LineColor       = EEDD82\n}}\n}}\nProduction\nDevelopment\nIn September 2016, it was announced that a reboot of the 1980s prime time soap opera Dynasty was in development at The CW, co-written by Josh Schwartz, Stephanie Savage, and Sallie Patrick. The show received a 13-episode a first season order on May 10, 2017. A preview trailer was released on May 18, 2017. On November 8, 2017, the series received a back nine order for a full season of 22 episodes.\nCasting\nNathalie Kelley was cast as Cristal in January 2017, followed by Elizabeth Gillies as Fallon, Sam Adegoke as playboy Jeff Colby, and Robert Christopher Riley as Blake's chauffeur Michael Culhane in February. Next cast were Grant Show as Fallon's father Blake Carrington, and Rafael de la Fuente as Sam Jones, a gay male version of the original series' Sammy Jo Carrington, in March. The remaining main cast members are James Mackay as Fallon's gay brother Steven, and Alan Dale as Carrington majordomo Anders, Additional recurring performers include Nick Wechsler as Cristal's ex-lover Matthew Blaisdel, Brianna Brown as Matthew's wife Claudia, and Wakeema Hollis as Jeff's sister Monica Colby. In November 2017, Nicollette Sheridan was cast in the role of Blake's ex-wife Alexis Carrington. Other guest stars include Elena Tovar as Iris Machado, Cristal's sister and Sam's mother, Bill Smitrovich as Thomas Carrington, Blake's estranged father, and Hakeem Kae-Kazim as Cesil Colby, Jeff and Monica's father.\nIn June 2018, Kelley told E! News that she would not be returning for season two. She said in 2020 that she had been surprised to get the call that she would not be returning to the series, and explained:\n}}\nThe CW announced in August 2018 that Ana Brenda Contreras had been cast as \"the real Cristal Flores\" for the second season.\nFilming\nFilming for the season commenced on July 19, 2017, in Atlanta, Georgia, and wrapped up during the first quarter of 2018.\nMusic\nPaul Leonard-Morgan composed the music for the first season, with him, Bill Conti and Troy Nõka composing the music for the theme song, which debuted in the third episode, \"Guilt is for Insecure People\", but is only used in some episodes. Composer Paul Leonard-Morgan worked with Troy Nõka to get \"an '80s-rock vibe\" for the song, to match Leonard-Morgan's soundtrack for the series. The new theme was recorded with an orchestra at Capitol Records in Hollywood, featuring Los Angeles Philharmonic lead trumpet player Tom Hooten.\nBroadcast\nSeason 1 of Dynasty premiered on The CW in the United States on Wednesday, October 11, 2017, with the season 2 premiere of Riverdale as its lead-in. Netflix acquired the exclusive international broadcast rights to Dynasty, making it available as a Netflix original series on the platform less than a day after their original U.S. broadcast. The series moved to Fridays starting with the fourteenth episode, and the season finale aired on May 11, 2018. Season one of Dynasty is available worldwide on Netflix.\nLeslie Moonves, the then-head of CBS Corporation, said in 2017, \"We own 100 percent of [Dynasty], and we've already licensed it to Netflix in 188 countries ... So this means Dynasty is profitable before it even hits the air.\"\nReception\nRatings\n| rs1      = 0.3/1\n| viewers1 = 1.26\n| dvr1     = 0.2\n| dvrv1    = n/a\n| total1   = 0.5\n| totalv1  = n/a\n| title2   = Spit It Out\n| date2    =\n| rs2      = 0.3/1\n| viewers2 = 0.92\n| dvr2     = n/a\n| dvrv2    = n/a\n| total2   = n/a\n| totalv2  = n/a\n| title3   = Guilt is for Insecure People\n| date3    =\n| rs3      = 0.2/1\n| viewers3 = 0.72\n| dvr3     = n/a\n| dvrv3    = 0.39\n| total3   = n/a\n| totalv3  = 1.11\n| title4   = Private as a Circus\n| date4    =\n| rs4      = 0.2/1\n| viewers4 = 0.74\n| dvr4     = 0.2\n| dvrv4    = 0.45\n| total4   = 0.4\n| totalv4  = 1.19\n| title5   = Company Slut\n| date5    =\n| rs5      = 0.2/1\n| viewers5 = 0.72\n| dvr5     = n/a\n| dvrv5    = n/a\n| total5   = n/a\n| totalv5  = n/a\n| title6   = I Exist Only for Me\n| date6    =\n| rs6      = 0.2/1\n| viewers6 = 0.64\n| dvr6     = n/a\n| dvrv6    = n/a\n| total6   = n/a\n| totalv6  = n/a\n| title7   = A Taste of Your Own Medicine\n| date7    =\n| rs7      = 0.2/1\n| viewers7 = 0.64\n| dvr7     = n/a\n| dvrv7    = n/a\n| total7   = n/a\n| totalv7  = n/a\n| title8   = The Best Things in Life\n| date8    =\n| rs8      = 0.2/1\n| viewers8 = 0.64\n| dvr8     = n/a\n| dvrv8    = 0.33\n| total8   = n/a\n| totalv8  = 0.97\n| title9   = Rotten Things\n| date9    =\n| rs9      = 0.2/1\n| viewers9 = 0.69\n| dvr9     = n/a\n| dvrv9    = n/a\n| total9   = n/a\n| totalv9  = n/a\n| title10   = A Well-Dressed Tarantula\n| date10    =\n| rs10      = 0.2/1\n| viewers10 = 0.63\n| dvr10     = n/a\n| dvrv10    = n/a\n| total10   = n/a\n| totalv10  = n/a\n| title11   = I Answer to No Man\n| date11    =\n| rs11      = 0.2/1\n| viewers11 = 0.56\n| dvr11     = n/a\n| dvrv11    = 0.31\n| total11   = n/a\n| totalv11  = 0.87\n| title12   = Promises You Can't Keep\n| date12    =\n| rs12      = 0.2/1\n| viewers12 = 0.65\n| dvr12     = n/a\n| dvrv12    = n/a\n| total12   = n/a\n| totalv12  = n/a\n| title13   = Nothing But Trouble\n| date13    =\n| rs13      = 0.2/1\n| viewers13 = 0.65\n| dvr13     = n/a\n| dvrv13    = n/a\n| total13   = n/a\n| totalv13  = n/a\n| title14   = The Gospel According to Blake Carrington\n| date14    =\n| rs14      = 0.2/1\n| viewers14 = 0.64\n| dvr14     = n/a\n| dvrv14    = n/a\n| total14   = n/a\n| totalv14  = n/a\n| title15   = Our Turn Now\n| date15    =\n| rs15      = 0.1/1\n| viewers15 = 0.60\n| dvr15     = 0.1\n| dvrv15    = n/a\n| total15   = 0.2\n| totalv15  = n/a\n| title16   = Poor Little Rich Girl\n| date16    =\n| rs16      = 0.1/1\n| viewers16 = 0.63\n| dvr16     = 0.1\n| dvrv16    = n/a\n| total16   = 0.2\n| totalv16  = n/a\n| title17   = Enter Alexis\n| date17    =\n| rs17      = 0.2/1\n| viewers17 = 0.69\n| dvr17     = n/a\n| dvrv17    = n/a\n| total17   = n/a\n| totalv17  = n/a\n| title18   = Don't Con a Con Artist\n| date18    =\n| rs18      = 0.2/1\n| viewers18 = 0.71\n| dvr18     = n/a\n| dvrv18    = n/a\n| total18   = n/a\n| totalv18  = n/a\n| title19   = Use or Be Used\n| date19    =\n| rs19      = 0.1/1\n| viewers19 = 0.56\n| dvr19     = 0.1\n| dvrv19    = n/a\n| total19   = 0.2\n| totalv19  = n/a\n| title20   = A Line from the Past\n| date20    =\n| rs20      = 0.2/1\n| viewers20 = 0.68\n| dvr20     = n/a\n| dvrv20    = n/a\n| total20   = n/a\n| totalv20  = n/a\n| title21   = Trashy Little Tramp\n| date21    =\n| rs21      = 0.1/1\n| viewers21 = 0.55\n| dvr21     = 0.1\n| dvrv21    = 0.31\n| total21   = 0.2\n| totalv21  = 0.87\n| title22   = Dead Scratch\n| date22    =\n| rs22      = 0.1/1\n| viewers22 = 0.56\n| dvr22     = 0.1\n| dvrv22    = n/a\n| total22   = 0.2\n| totalv22  = n/a\n}}\nCritical response\nThe review aggregator website Rotten Tomatoes reported a 49% approval rating with an average rating of 6.54/10 based on 47 reviews. The website's consensus reads, \"Dynasty revival retains enough of its predecessor's over-the-top allure to offer a glamorous guilty pleasure in its first season, even if it never quite recaptures the magic of the original.\" Metacritic, which uses a weighted average, gave the season a score of 52, based on 17 critics, indicating \"mixed or average\" reviews.\nReviewing the first episode of the season, Danette Chavez writing for The A.V. Club felt that despite the premiere \"cresting waves of '80s nostalgia and reboots, the CW's reimagined Dynasty feels like it's coming at a bit of an inopportune time\".\nAccolades\nIn 2018, the series was nominated by the Dorian Awards as Campy TV Show of the Year.\nReferences\nExternal links\n*\n*"
    }
  ]
}