{
  "content": [
    {
      "type": "text",
      "text": "# Dynasty Warriors 9\n\n|series = Dynasty Warriors\n|released = }}Empires|WW|February 15, 2022}}\n|genre = Hack and slash\n|modes = Single-player, multiplayer\n|platforms = PlayStation 4 WindowsXbox OneEmpiresNintendo SwitchPlayStation 4PlayStation 5StadiaWindowsXbox OneXbox Series X/S\n}}\nDynasty Warriors 9}} is a 2018 hack and slash game developed by Omega Force and published by Koei Tecmo. It was released in February 2018 for PlayStation 4, Windows and Xbox One.\nA strategy-focused expansion, titled Dynasty Warriors 9: Empires,}} was released in December 2021 in Japan, and worldwide in February 2022 for the PlayStation 5, PlayStation 4, Stadia, Xbox Series X/S, Xbox One, Nintendo Switch and Windows. A sequel, Dynasty Warriors 10, was cancelled in favor of what would become Dynasty Warriors: Origins.\nGameplay\nDynasty Warriors 9 is an open-world hack-and-slash game played from a third-person perspective with stealth elements. The game revamps the gameplay of the series with the introduction of the open-world environment. A traversable map of China is implemented which the player can freely roam on foot, horseback, or boat, the game focuses on liveable environments such as cities and towns as well as places where large battles take place. The characters' move-set combinations are also revised.\nThe player can invade and infiltrate enemy fortifications with the utilization of a grappling hook. A day-night cycle and dynamic weather system are also featured in the game. Time and weather now change in real-time, and enemy vision is affected at night-time or when it is raining. The map will advance in a time when main story missions are completed, but are described as having a \"high degree of difficulty\" which can be lowered by completing associated side missions.\nThe player can customize and decorate hideouts with furniture bought from merchants. Certain items have different effects; for example, placing a gong in the house and interacting with it will allow the player to change the background music. Teahouses found in the game can advance time and provide food that can be used to temporarily raise the stats of playable characters, such as raising their attack strength or increasing the height of their jump. The game also includes fishing, collecting resources to upgrade weapons and characters, camping, and other recreational events as well.\nGameplay mechanics\nThe gameplay mechanics of Dynasty Warriors 9 are radically overhauled from its predecessors.  Flow Attacks take the place of Normal Attacks from previous games, and in place of Charge Attacks are Trigger Attacks, which are performed by pressing the right trigger button and any face button.  Trigger attacks allow the player to stun an opponent, knock down an opponent, or send them airborne; each player also has a unique fourth reactive attack, known as a Special Attack, that has a longer cooldown before they may be used. Trigger Attacks may be followed up by a Flow Attack combo, which can, in turn, combo into another Trigger Attack.  Additionally, the player has access to a Reactive Attack, used whenever the player presses the right button when prompted to do so; this attack allows the player to charge into enemies, counter enemy attacks, or finish off weakened enemies. Musou Attacks return from previous games, and their mechanics are identical to Dynasty Warriors series games before Dynasty Warriors 6. The player also has access to an airborne Musou Attack, which depletes only a small portion of the Musou gauge. New to Dynasty Warriors 9 is the Stamina Gauge, a gauge that gradually replenishes until full. The stamina gauge is depleted upon double jumping, wall jumping, or in other selectable circumstances.\nCharacters will automatically draw their weapons when close to an enemy, or put away their weapons when they are no longer near them; however, the player may manually draw or withdraw their weapon by pressing on the left analog stick. Some actions, such as initiating conversations in towns and villages, may only be done when their weapons are not drawn. When a character does not have their weapon drawn, the player may also crouch and sneak behind groups of enemies.\nAll characters also have access to a bow, which they may access by pressing down on the directional pad. The player may acquire different types of ammunition throughout the game, which may be selected by pressing left and right on the directional pad and fired by pressing the flow attack button.  These come into play when sneaking into enemies, hunting wildlife, or initiating specialized attacks.\nHorses return from previous games; the player may buy horses and ride them to level up their attributes.  While on a horse, the player may have the horse automatically take them to the next recommended destination by pressing the left trigger button, or make their horse sprint by pressing the right shoulder button. Like characters, horses have their stamina gauge, which depletes when sprinting but replenishes when they are not.\nAll 83 characters from Dynasty Warriors 8: Empires returned. New characters also were introduced, one of whom made his first appearance in the spin-off Warriors All-Stars. Other than playable characters, there are four non-playable characters (NPCs) who have unique designs but wield generic weapons common to other NPCs.\nStory mode\nStory Mode in Dynasty Warriors 9 retells the story of Romance of the Three Kingdoms in a series of 13 chapters, from the Yellow Turban Rebellion to the fall of Shu in the final chapter. Each playable character has a story set within a subset of these chapters, corresponding roughly to the time in history when they were historically relevant; no character has a story that spans the full 13 chapters, and some characters will have longer stories than others. Each character has their ending, roughly corresponding to their historical death or the point at which they were no longer historically relevant.\nAt the start of the game, the player may only select the patriarchs of the three kingdoms: Liu Bei, Cao Cao, and Sun Jian; additional characters are unlocked for the most part by completing the first chapter a character is playable in with a different character. The progression of each character in their own story is kept separately, allowing the player to switch between different characters at any time. All characters share a common pool of acquired weapons, items, and map knowledge, but must be leveled separately.\nFree mode\nFree Mode in Dynasty Warriors 9, unlocked once the story of any character is complete, allows the player to play as any character in any chapter that has been previously completed by any character, without regard to historical context. The player may only have either a Story Mode save or a Free Mode save for a particular character; if a character has a Free Mode save, they must replay their Story Mode from the beginning of a new Story Mode game started with that character.\nDevelopment\nIn an interview with Famitsu in May 2016, Omega Force brand manager Kenichi Ogasawara commented that \"the evolution from Dynasty Warriors 7 to 8 was insufficient\", and hoped that the announcement of their next game in the series would \"have a great impact\".\nThe game was revealed later in the year in December during a \"Greatest Games Lineup in History\" broadcast, with Sony Computer Entertainment Japan Asia (SCEJA) president Atsushi Morita introducing the title; Koei Tecmo's western branches followed and announced the game alongside Japan. For the first time in the series, Dynasty Warriors 9 featured an open world environment, allowing players to enter and exit towns and freely explore the map of mainland China with considerable differences in elevation. A Famitsu interview with Koei Tecmo's Masaki Furusawa and Akihiro Suzuki revealed that all 83 characters that appeared in Dynasty Warriors 8: Empires would appear in the game. Zhou Cang was announced as one of the new playable characters, having appeared prior in Musou Stars. The combat system, which in previous games relied on players linking together combos by pressing two alternate buttons designated to light and heavy attacks, was overhauled. On May 11, 2017, Koei Tecmo America announced that the game would get the release in the West.\nIn September 2017, Koei Tecmo declared that the game was scheduled to be released in early 2018. Later announcements confirmed that the game would be released in Japan on February 8, 2018, and in the West on February 13, 2018.(PS4) 65/100(XONE) 56/100\n| Destruct = 6.5/10\n| Fam = 35/40\n| GSpot = 7/10\n| HCG = 3.5/5\n| IGN = 5.8/10\n| PSQ =\n}}\nDynasty Warriors 9 received \"mixed or average\" reviews from critics, according to review aggregator Metacritic.\nDavid Jagneaux of IGN criticized the game, noting its cookie-cutter missions, lack of multiplayer, lifeless open world, lack of substantial story content, unenthusiastic voice acting, repetitive content, and lack of good AI pathfinding. The game was also praised for the newfound spectacle of battle, character swapping, and the mindless fun the game was able to provide. GameSpot praised the game for its empowering melee combat, epic story, peaceful open world, and character designs, while lamenting the presence of several graphical and technical issues, lack of combat depth, and the need to repeat missions when swapping characters.\nThe Japanese magazine Famitsu was more positive and scored the game 9/9/9/8, for a total of 35/40.\nSales\nDynasty Warriors 9 sold 117,495 copies on PlayStation 4 within its first week on sale in Japan, which placed it at number 2 on the all format sales chart. The Empires expansion, on the other hand, sold a combined 42,108 copies on PlayStation 4, PlayStation 5, and Nintendo Switch within its first week on sale in Japan.\nExpansion\nKoei Tecmo announced an expansion titled Dynasty Warriors 9: Empires on September 27, 2020. Like previous Empires expansions, it is focused more on strategy than the typical hack and slash, with the goal of uniting China under one banner through diplomacy and siege battles. It was released for the PlayStation 5, PlayStation 4, Xbox Series X/S, Xbox One, Nintendo Switch, and Microsoft Windows, making it the first Warriors game to be released for a ninth-generation console. An early 2021 release window was originally planned, but Koei Tecmo later announced a delay to December 2021 for Japan and February 2022 in the West. Unlike the original Dynasty Warriors 9, this spin-off is not open world but uses many assets from the open world in its gameplay.\nNotes\nReferences\nExternal links\n*\n*"
    }
  ]
}