{
  "content": [
    {
      "type": "text",
      "text": "# Dynasty (1981 TV series) season 4\n\n| last_aired    =\n| num_episodes  = 27\n| episode_list  = List of Dynasty (1981 TV series) episodes\n}}\nThe fourth season of Dynasty originally aired in the United States on ABC from September 28, 1983, through May 9, 1984. The series, created by Richard and Esther Shapiro and produced by Aaron Spelling, revolves around the Carringtons, a wealthy family residing in Denver, Colorado.\nSeason four stars John Forsythe as millionaire oil magnate Blake Carrington; Linda Evans as his wife Krystle; Pamela Sue Martin as Blake and Alexis' headstrong daughter Fallon; Jack Coleman as Blake and Alexis' earnest son Steven; Gordon Thomson as Blake and Alexis' eldest son Adam; John James as Fallon's ex-husband Jeff Colby; Pamela Bellwood as Steven's new wife, Claudia; Heather Locklear as Krystle's niece and Steven's ex-wife Sammy Jo; Geoffrey Scott as Krystle's ex-husband Mark Jennings; Lee Bergere as Carrington majordomo Joseph Anders; Kathleen Beller as Joseph's daughter Kirby; Deborah Adair as public relations assistant Tracy Kendall; Michael Nader as businessman Dex Dexter; Helmut Berger as playboy Peter De Vilbis; Diahann Carroll as Blake's half-sister Dominique Deveraux; and Joan Collins as Alexis Colby, Blake's ex-wife and the mother of Adam, Fallon and Steven.\nDevelopment\nWith the show's popularity soaring in the fourth season (now the third most watched program of 1983–1984), former President Gerald Ford, former First Lady Betty Ford and former Secretary of State Henry Kissinger guest-starred as themselves in 1983.\nMichael Nader was introduced as Farnsworth \"Dex\" Dexter, a friend to Blake and a love interest for Alexis. Though Dex was conceived as a supporting, short-term character, Nader's performance made the character \"unexpectedly popular\". One of the five actors under final consideration for the role, Nader credited his chemistry with Collins with getting him the part. Collins said of Nader, \"He's a very romantic leading man and he has a certain sinister edge.\"\nDiahann Carroll was also introduced as wealthy singer and businesswoman Dominique Deveraux, from the beginning intended as a foil for Alexis Colby, the villainess played by Joan Collins. Dominique was revealed to be Blake's half-sister in season five. Noting that the increasingly popular prime time soap operas had yet to tackle racial integration, and wanting to be \"the first black bitch on television\", Carroll had her manager reach out to Dynasty producer Aaron Spelling, but there had been no response before she and Spelling ran into each other soon after. Spelling said, \"When Diahann came in, Esther Shapiro and I looked at her, looked at each other and said, 'My God, she is Dynasty.'\" Carroll told Shapiro that night, \"If it's not me let it be someone, because it's time.\" Spelling said, \"We virtually closed the deal that night while having a drink at the bar.\" Joining Dynasty made Carroll the only black actress with a continuing role on a nighttime serial at that time, and Dominique the first prominently-featured African-American character on a prime time soap opera. She appeared in the final two episodes of the fourth season, and was contracted for at least 17 of season five's 29 shows. Willis Edwards, president of the Beverly Hills/Hollywood chapter of the NAACP, said of Carroll's casting, \"This is a major thing as far as we're concerned. We've been fighting for something like this for years.\" Linda Evans, who played Krystle Carrington, said at the time, \"I don't think the impact of her coming on the show will affect only blacks. I think it will be great for all the people who see her.\"\nMartin left the series at the end of the fourth season in May 1984. At the time, New York quoted Martin as calling television \"limiting\". USA Today reported in 2006 that Martin \"left Dynasty and acting when she felt her 'glib' character ... had been reduced to 'a victim'.\" In 2011, she said \"I became extremely famous during that time, and it was a little discomforting\". Spelling wrote in his 1996 autobiography, \"After three seasons, Pamela Sue Martin wanted to leave Dynasty to get married and we didn't stand in her way.\"\nPlot\nSteven and Blake battle for custody over Steven and Sammy Jo's son Danny, and a false accusation of illegal weapons dealings orchestrated by Alexis threatens to ruin Blake's financial empire. In the season finale, Fallon disappears just before her second wedding to Jeff, while Alexis is arrested for the murder of Mark Jennings.\nCast\nMain\n* John Forsythe as Blake Carrington\n* Linda Evans as Krystle Carrington\n* Pamela Sue Martin as Fallon Carrington\n* John James as Jeff Colby\n* Pamela Bellwood as Claudia Blaisdel 4.3).}}\n* Heather Locklear as Sammy Jo Carrington 4.4) to \"Tender Comrades\" ( 4.6), and again from \"The Check\" ( 4.24).}}\n*Gordon Thomson as Adam Carrington\n*Kathleen Beller as Kirby Anders\n*Geoffrey Scott as Mark Jennings 4.25).}}\n*Deborah Adair as Tracy Kendall 4.7).}}\n*Jack Coleman as Steven Carrington\n*Lee Bergere as Joseph Anders 4.2).}}\n*Helmut Berger as Peter De Vilbis 4.9) to \"The Vigil\" ( 4.18), except for \"The Accident\" ( 4.17).}}\n*Michael Nader as Dex Dexter 4.8).}}\n*Diahann Carroll as Dominique Deveraux 4.26).}}\n* Joan Collins as Alexis Carrington\nRecurring\n* William Beckley as Gerard\n* Virginia Hawkins as Jeanette Robbins\n* Peter Mark Richman as Andrew Laird\n* Paul Keenan as Tony Driscoll\n* Paul Burke as Neal McVane\n* Betty Harford as Hilda Gunnerson\n* Hank Brandt as Morgan Hess\n* Grant Goodeve as Chris Deegan\n* John Saxon as Rashid Ahmed\n* David Ackroyd as Lt. Merrill\nNotable guest stars\n* James Sutorious as Gordon Wales\n;Cast notes\nEpisodes\n|OriginalAirDate=\n|ProdCode=DY-060\n|Aux4=27.2/41\n|ShortSummary=Mark Jennings saves Alexis and Krystle from the burning cabin. The police find there are multiple suspects but arrest Mark. Fallon tries to find out more about Adam's first case with the toxic chemicals, but Adam has his doctor convince Fallon of Adam's innocence. Jeff is leading ColbyCo during Alexis' absence. After learning that Krystle lost a baby in a riding accident, Kirby takes out a wild horse and purposely has an accident.\n|LineColor=4F1B65\n}}\n|OriginalAirDate=\n|ProdCode=DY-061\n|Aux4=22.5/35\n|ShortSummary=Mark is freed from custody as Blake comes forward with the $100,000 bail money to prove to Krystle that he is a fair person. After her accident, Kirby confides in Krystle that the baby is not Jeff's. Adam wants to convince Steven to work together against Jeff, but fails. Adam moves out of Alexis's penthouse because he feels she does not love him. In the hospital, somebody tries to kill Alexis. Joseph shoots himself.\n|LineColor=4F1B65\n}}\n|OriginalAirDate=\n|ProdCode=DY-062\n|Aux4=25.0/40\n|ShortSummary=After Joseph kills himself, Blake and Jeff find a note in which Joseph confesses to setting the cabin fire to kill Alexis. Kirby is left devastated over her father's suicide and confides in Krystle that she provoked the accident because the baby is Adam's. Claudia Blaisdel is released from the sanitarium and starts another affair with Steven. Fallon resumes her investigation into Adam's first case. When Blake sees that Steven's gay friend Chris is living with him and Danny, he tells Steven that he intends to fight for custody.\n----\nDynasty was preempted by Game 2 of the 1983 World Series on October 12, 1983.\n|LineColor=4F1B65\n}}\n|OriginalAirDate=\n|ProdCode=DY-063\n|Aux4=22.9/36\n|ShortSummary=Kirby demands Alexis divulge the real motive behind her father's attempts to kill her. In a fit of rage, she tries to strangle Alexis. Adam moves into the Carrington household and also starts working for Blake. Claudia starts working with Fallon at La Mirage. Steven finds a social worker snooping around his apartment, who later testifies at the custody hearing. There Alexis testifies Blake tried to purchase the baby from Sammy Jo and he is a bad father. Krystle also gives evidence for Steven, but Blake prohibits a cross examination of her.\n|LineColor=4F1B65\n}}\n|Title=The Hearing - Part 2\n|OriginalAirDate=\n|ProdCode=DY-064\n|Aux4=22.1/33\n|ShortSummary=Alexis arrives home to find her apartment broken into. Fallon testifies on Steven's behalf. Fallon and Jeff fly to Montana to get information about the poisoning incident, and stay together the night. Adam is warned by Alexis. On the witness stand, Sammy Jo fabricates tales of Steven's homosexual promiscuity. Claudia barges into Sammy Jo's hotel room and slaps her for telling lies. Claudia tells Steven she has devised a plan to retain custody of his son.\n|LineColor=4F1B65\n}}\n|OriginalAirDate=\n|ProdCode=DY-065\n|Aux4=23.8/35\n|ShortSummary=To retain custody of Danny, Steven and Claudia fly to Reno and are married.  When the judge receives the assurance to jointly rear the child, the suit is dismissed.  Attempting to win Krystle back, Blake offers her a public relations job at Denver-Carrington.  Fallon and Jeff investigate the poisoning incident in Montana.  They are stunned to learn the name of the prosecuting attorney was Michael Torrance-the name Adam used before arriving in Denver.\n|LineColor=4F1B65\n}}\n|OriginalAirDate=\n|ProdCode=DY-066\n|Aux4=20.6/30\n|ShortSummary=Alexis realizes that Adam has framed her for Jeff's poisoning. Denver Carrington PR assistant Tracy Kendall is jealous that Blake has given a job she wanted to Krystle.  Mark overzealously suggests a reconciliation between him and Krystle, and attacks her when she says no.\n|LineColor=4F1B65\n}}\n|OriginalAirDate=\n|ProdCode=DY-067\n|Aux4=21.3/33\n|ShortSummary=Jeff accuses Alexis of poisoning him.  Michael Nader joins the cast as Farnsworth \"Dex\" Dexter, who wants to enter into business and pleasure with Alexis.\n|LineColor=4F1B65\n}}\n|OriginalAirDate=\n|ProdCode=DY-068\n|Aux4=24.4/36\n|ShortSummary=As Jeff returns to work at Denver-Carrington, Krystle goes to battle with Alexis over comments she made about the corporation. Fallon meets Peter De Vilbis.\n|LineColor=4F1B65\n}}\n|OriginalAirDate=\n|ProdCode=DY-069\n|Aux4=25.7/39\n|ShortSummary=Dex beats Alexis to the punch on a new business deal.  Jeff nearly kills Adam over Kirby's rape.  Blake and Krystle decide to remarry.\n|LineColor=4F1B65\n}}\n|OriginalAirDate=\n|ProdCode=DY-070\n|Aux4=23.8/36\n|ShortSummary=When he sees Fallon with Peter, Jeff is enraged.  At the Carousel Ball, Blake announces that he and Krystle are to re-marry.  Due to the warm nature of the occasion, Blake and Steven decide to bury the hatchet.\n----\nDynasty was preempted by a repeat of a 2-hour episode of The Fall Guy December 14, 1983.\n|LineColor=4F1B65\n}}\n|OriginalAirDate=\n|ProdCode=DY-071\n|Aux4=26.0/39\n|ShortSummary=As Blake and Krystle prepare to remarry, Tracy starts preparing plans to steal Krystle's job.  Peter unexpectedly shows up at La Mirage looking for Fallon, but he seems to have eyes for Claudia.\n|LineColor=4F1B65\n}}\n|OriginalAirDate=\n|ProdCode=DY-072\n|Aux4=23.9/35\n|ShortSummary=Frightened by a mysterious stranger, Claudia decides that she, Steven and Danny should move back into the Carrington mansion.  Tracy continues her scheming.  Jeff and Kirby divorce, laying the groundwork for a reunion between Kirby and Adam.\n|LineColor=4F1B65\n}}\n|OriginalAirDate=\n|ProdCode=DY-073\n|Aux4=25.7/38\n|ShortSummary=Fallon discovers a less than noble attribute about Peter.  Tracy sets Krystle up for failure in front of Blake and the board, while making herself out to be the hero.  Claudia begins receiving ominous notes.Kirby collapses.\n|LineColor=4F1B65\n}}\n|OriginalAirDate=\n|ProdCode=DY-074\n|Aux4=24.8/36\n|ShortSummary=Kirby begins to experience poor health.  Even as he proposes to Fallon, Peter continues to proposition Claudia.\n|LineColor=4F1B65\n}}\n|OriginalAirDate=\n|ProdCode=DY-075\n|Aux4=25.4/38\n|ShortSummary=Blake is uneasy when Fallon announces that she and Peter will marry.  Adam finally admits that he was behind Jeff's poisoning.  Kirby's life and her unborn child are in danger.\n----\nDynasty was preempted by the State of the Union address w/Ronald Reagan on special on January 25, 1984.\n|LineColor=4F1B65\n}}\n|OriginalAirDate=\n|ProdCode=DY-076\n|Aux4=23.8/36\n|ShortSummary=Claudia tries to warn Fallon about Peter's wandering eye, but her pleas fall on deaf ears.  Tracy goes to extreme measures to hurt Krystle.  As Peter abruptly flees from Denver, an inconsolable Fallon gets hit by a car.\n----\nDynasty was preempted for two weeks by the XIV Winter Olympic Games on February 8 and 15, 1984.\n|LineColor=4F1B65\n}}\n|OriginalAirDate=\n|ProdCode=DY-077\n|Aux4=24.2/36\n|ShortSummary=While the family rushes to the hospital to be with Fallon, Blake goes on a mission to catch Peter. McVane spearheads a scheme to blackmail Alexis. Adam and Kirby make plans to marry.\n|LineColor=4F1B65\n}}\n|OriginalAirDate=\n|ProdCode=DY-078\n|Aux4=25.9/39\n|ShortSummary=Alexis resorts to dirty trickery to block the marriage of Adam and Kirby. Claudia receives a photo that Matthew took of her when they were first married and makes plans to go to Peru where he supposedly died.\n|LineColor=4F1B65\n}}\n|OriginalAirDate=\n|ProdCode=DY-079\n|Aux4=24.6/38\n|ShortSummary=When Krystle discovers she is pregnant, she sends Tracy in her place on a business trip with Blake. Claudia comes to terms with the deaths of Matthew and Lindsay.\n|LineColor=4F1B65\n}}\n|OriginalAirDate=\n|ProdCode=DY-080\n|Aux4=25.1/39\n|ShortSummary=Alexis makes plans to destroy Blake's latest overseas deal. When Tracy puts the moves on Blake, instead of returning the advances, he gives her a pink slip.\n|LineColor=4F1B65\n}}\n|OriginalAirDate=\n|ProdCode=DY-081\n|Aux4=25.2/39\n|ShortSummary=Dex is angry with Alexis over her dealings with Rashid Ahmed. Kirby continues to uncover truths about her parents. Fallon continues to experience aftershocks from her accident.\n|LineColor=4F1B65\n}}\n|OriginalAirDate=\n|ProdCode=DY-082\n|Aux4=23.6/38\n|ShortSummary=Krystle confronts Tracy. Fallon and Jeff tell the family that they are to remarry. Alexis is shocked with the news of Krystle's pregnancy.\n|LineColor=4F1B65\n}}\n|OriginalAirDate=\n|ProdCode=DY-083\n|Aux4=21.6/38\n|ShortSummary=Kirby's attempt to murder Alexis fails. Mark Jennings blackmails Alexis for $100,000 in exchange for his silence over her meeting with Rashid Ahmed in Hong Kong.\n|LineColor=4F1B65\n}}\n|OriginalAirDate=\n|ProdCode=DY-084\n|Aux4=23.3/37\n|ShortSummary=Alexis learns that Mark has been found dead at the bottom of her apartment building and the police are unsure whether he jumped or was pushed. Krystle questions Alexis about her \"fourth pregnancy\".\n----\nDynasty was preempted by a repeat of the 1982 ABC Wednesday Night Movie Charles and Diana: A Royal Love Story on April 18, 1984.\n|LineColor=4F1B65\n}}\n|OriginalAirDate=\n|ProdCode=DY-085\n|Aux4=25.2/38\n|ShortSummary=Diahann Carroll joins the cast as the mysterious Dominique Deveraux.\n|LineColor=4F1B65\n}}\n|OriginalAirDate=\n|ProdCode=DY-086\n|Aux4=25.7/38\n|ShortSummary=Alexis is arrested for murdering Mark. As she is about to remarry Jeff, Fallon suffers another blinding headache, runs out of the house and has a tragic car accident.\n|LineColor=4F1B65\n}}\n}}\nReception\nIn season four, Dynasty was ranked #3 in the United States with a 22.4 Nielsen rating.\nReferences\nExternal links\n*"
    }
  ]
}