{
  "content": [
    {
      "type": "text",
      "text": "# Dynasty Warriors: Gundam 2\n\n|EU/AU|Koei}}\n| director = Naohito Kano\n| designer = Hiroshi Kimata\n| composer = Masato Koike\n| engine =\n| series = Dynasty Warriors  Mobile Suit Gundam\n| released =\n| genre = Action role-playing game, hack and slash\n| modes = Single-player, multiplayer\n| platforms = PlayStation 3Xbox 360PlayStation 2\n}}\nDynasty Warriors: Gundam 2, originally released in Japan as , is a tactical action video game based on the Gundam anime series, and the sequel to 2007's Dynasty Warriors: Gundam. It is developed by Omega Force and is published by Namco Bandai Games in Japan and North America, and Koei in PAL regions. The game was released in Japan on December 18, 2008, with a North American release on April 21, 2009, and a European release April 24, 2009.\nThe game was then rereleased on December 17, 2009 in Japan as part of both the Gundam 30th Anniversary Collection and The Best range edition.\nDifferences from prior games\nFrom previous Dynasty Warriors titles\nDynasty Warriors: Gundam follows in the style of previous Dynasty Warriors and Samurai Warriors games as an action-oriented hack and slash with some tactical elements. The greatest difference between Koei's Gundam titles (there are currently three) and Koei's Dynasty Warriors series is the core content: rather than using characters and story from the novel Romance of the Three Kingdoms, the games draw their material from across the various Mobile Suit Gundam anime series.\nHowever, all of Koei's Gundam titles also have unique gameplay mechanics that help set them apart from Koei's core Dynasty Warriors series. For example: players are given more ranged combat options than in other Dynasty Warriors games, although melee combat is still the focus of the game. Units in Dynasty Warriors: Gundam are much more mobile, using their thrusters to dash, jump in mid-air, and (for some) even fly.\nFrom Dynasty Warriors: Gundam\ns where the RX-78 Gundam faces off against a Dom. Pressing the buttons in the right order allows the player to overpower the enemy mobile suit and deliver some amount of damage.]]\nOne of many additions to the game are Quick Time Events. Colossal mobile armors have also been added to the game and serve as some of the game's bosses. In addition, improvements have been made to enemy AI, in the hopes of keeping even the best players on their toes. Also, the ability to perform aerial maneuvers and attacks simultaneously is added. Intermission and briefing scenes now feature complete 2-D illustrations with various outfits for the game's characters. Official Mode, which chronicles the events depicted in the Universal Century calendar of the Mobile Suit Gundam franchise, expands to include the story in ''Mobile Suit Gundam: Char's Counterattack. Mobile suits making an appearance in the previous game, but were non-playable (such as the Guncannon and Hambrabi), are included in the playable roster for Dynasty Warriors: Gundam 2, along with an enhanced Versus Mode for North American and PAL regions only. Lastly, the option for Japanese Audio on the North American version, found previously in the first game, was taken out.\nGame Modes\nThere are two Modes with the game: Official and Mission Mode. The returning Official Mode features 4 playable pilots and the events set within the continuity of the Universal Century timeline, covering the series of Mobile Suit Gundam, Zeta Gundam, Gundam ZZ and the movie, Char's Counterattack. However, like the previous game, an original story is still the main focus of the game. The original story is featured within an all-new Mission Mode, where characters are given specific missions to accomplish, such as acquiring parts for various mobile suits (Collection Mission) and reinforcing or defeating other characters to increase friendship status or develop rivalries (Friendship Mission). In order for characters to use other mobile suits they would not use in their timeline or outside their continuity, players must complete License Missions to receive licenses to use other units. Finally, Gallery mode is renamed gallery and library mode in the Japanese version, detailing character biographies, mobile suit and battleship information, movie clips and musical tracks from the various Gundam series themes (Japanese version only) .\nFeatured mobile suits and series\nAn early developer interview asserted that \"the number of mobile suits playable is something like three times that of the first game\". The total playable unit count for Dynasty Warriors: Gundam 2'' is 66 suits, a massive upgrade from the previous game's 19. Much like the first game, player's choose pilots and mecha independent of each other, allowing the ability to use any combination of man and machine.\nReception\n(PS2) 55.37%(X360) 54.67%\n| MC = (PS3) 54/100(PS2) 52/100(X360) 49/100\n| EuroG = 8/10\n| Fam = 9/10, 10/10, 8/10, 9/10\n| GameRev = D\n| GSpot = 4/10\n| GT = 6/10\n| GameZone = (PS2) 6.6/10(PS3) 6.2/10(X360) 5.2/10\n| IGN = 5.6/10(PS2) 4.9/10\n| OPMUK = 4/10\n| OXM = 5/10\n| PSM = 3/5\n| TX = 6/10\n}}\nThe game was met with very mixed to negative reception upon release.  GameRankings and Metacritic gave it a score of 55.52% and 54 out of 100 for the PlayStation 3 version; 55.37% and 52 out of 100 for the PlayStation 2 version; and 54.67% and 49 out of 100 for the Xbox 360 version.\nSequel\nDynasty Warriors: Gundam 3 is a tactical action video game based on the Gundam anime series and the sequel to 2008's Dynasty Warriors: Gundam 2. It is developed by Koei/Omega Force and is published by Namco Bandai. The game was released on December 16, 2010 in Japan, June 28, 2011 in North America, July 1, 2011 in Europe, and July 12, 2011 in Australia.\nNotes\nReferences\nExternal links\n* [http://dynastywarriorsgundam.co.uk/2/ Dynasty Warriors Gundam 2 Official Website (Europe)]\n* [http://gundam-musou.jp/ Gundam Musou 2 Official Website]\n*"
    }
  ]
}