{
  "content": [
    {
      "type": "text",
      "text": "# Dynamis (queen)\n\nDynamis, nicknamed Philoromaios (, Dynamis, friend of Rome, c. 67 BC – AD 8), was a Roman client queen of the Bosporan Kingdom during the Late Roman Republic and part of the reign of Augustus, the first Roman Emperor. Dynamis is an ancient Greek name which means the “powerful one”. She was a monarch of Iranian and Greek Macedonian ancestry. She was the daughter of King Pharnaces II of Pontus and his Sarmatian wife. She had an older brother called Darius and a younger brother called Arsaces. Her paternal grandparents had been the monarchs of the Kingdom of Pontus, Mithridates VI of Pontus and his first wife Laodice, who was also his sister. Dynamis married three times. Her husbands were Asander, a certain Scribonius and Polemon I of Pontus. According to Rostovtzeff, she also had a fourth husband, Aspurgos.\nLife\nMarriage with Asander\nIn 47 BC king Pharnaces II put Asander in charge of his Bosporan Kingdom when he went away to invade Roman territories in eastern Anatolia. Asander revolted against Pharnaces II. He hoped that by betraying Pharnaces II he would win favour with the Romans and that through them he could become king of the Cimmerian Bosporus. Pharnaces took over Anatolian territories in the east but had to stop an advance into western Anatolia because of Asander's rebellion. He was eventually defeated by Gaius Julius Caesar. According to Appian, before the battle with Caesar Pharnaces sent envoys to him to negotiate a peace. They “bore a golden crown and foolishly offered him the daughter of Pharnaces [Dynamis] in marriage.”   After his defeat, Pharnaces returned to the Cimmerian Bosporus with his cavalry. Asander defeated Pharnaces II, who died in battle. Asander took over the Bosporan Kingdom and married Dynamis, probably to legitimise his rule.\nExile\nAsander was soon overthrown. Julius Caesar gave a tetrarchy in Galatia and the title of king to Mithridates of Pergamon. He also allowed him to wage war against Asander and conquer the Cimmerian Bosporus because Asander “had been mean to his friend Pharnaces.” This must have been in late 47 BC or early 46 BC. We know this date because this is the date given by Cassius Dio about a rebellion against Caesar plotted by Caecilius Bassus, who gathered troops to take over Syria. He was investigated and he claimed that “he was collecting these troops for the use of Mithridates the Pergamenian in an expedition against Bosporus.” Mithridates of Pergamon overthrew Asander and became Mithridates I of the Bosporus. According to Mayor, Asander and Dynamis were exiled and during their time in exile they were sheltered by her mother's Sarmatian tribe.\nSecond reign with Asander\nStrabo wrote that Asander overthrew Mithridates. He did not give a date for this event.\nAccording to Lucian, Asander had been an ethnarch and then was proclaimed king of the Bosporus by Augustus.  Ethnarchs were rulers of client kingdoms who did not rise to the level of kings. Minns thought that Lucian's attribution of Asander's elevation in status to Augustus was inaccurate and that this occurred by the concurrence of Octavian (the name used by historians for Augustus before he became the emperor) and Mark Antony when they shared the rule of the Roman Empire.\nMinns reckoned that Asander started issuing coins in his name in 44 BC, the year Caesar, who supported Mithridates of Pergamon, died. Then he started minting with the acquiescence of Octavian, whose head featured on his coins. For the first three years the coins had the inscription ΑΡΧΟΝΤΟΣ ΑΣΑΝΔΡΟΥ (Àrchontos Asàndrou), archon Asander. Here we also have the first occurrence of Φιλορωμαίος (Philoromaios, friend of Rome) on coinage. Thus, his title was Archon (Lord) rather than Basileus (King) and remained so for the first three years.  Phıloromaíos shows that his rule was recognised by the Romans. These coins also had an inscription about his wife Dynamis which reads ΒΑΣΙΛΙΣΣΗΣ ΔΥΝΑΜΕΩΣ (of Basílissa Dynamís), of Queen Dynamis. From the fourth year onwards, his title on his coins was king and his head features on them.  On the obverse there was the head of Mark Antony instead of that of Octavian, most probably because Antony took charge of Rome's eastern provinces in 42 BC.\nQueen of Scribonius\nWhen Asander died Dynamis was entrusted with the regency of Bosporan Kingdom. She married a certain Scribonius. Scribonius was overthrown and Dynamis married Polemon I of Pontus, who had been sent by the Romans to fight against Scribonius. This would not have been before 17/16 BC because in that year Dynamis had issued a solitary stater in her name. This shows that in that year she reigned on her own and had not yet married Scribonius.\nCassius Dio wrote that a certain Scribonius claimed to be a grandson of Mithridates VI of Pontus and that he had received the Bosporan Kingdom from Augustus after the death of Asander. He married Dynamis, who had been entrusted with the regency of the kingdom by her husband Asander. Marcus Vipsanius Agrippa sent Polemon I of Pontus against him. Scribonius was killed by the people before Polemon got there because they had heard of his advance. Scribonius was murdered by the Bosporans, leaving Dynamis as sole ruler of the country. They resisted Polemon because they were afraid that he may be appointed as their king. Polemon defeated them but was unable to quell the rebellion until Agrippa went to Sinope to prepare a campaign against them. At that point the people surrendered. Polemon was appointed as their king. He married Dynamis with the sanction of Augustus. Agrippa was awarded a triumph, but this was not celebrated.\nQueen of Polemon\nBy marrying Dynamis, Polemon became the king of the Bosporan Kingdom in addition to being the king of \"that part of Pontus bordering on Cappadocia\" and of Lesser Armenia. The former two kingship had been given to him by Mark Antony. With this marriage Dynamis preserved her position of the Bosporan throne. The marriage \"effectively unified the kingdoms of Pontus and the Bosporus, and the triumph voted to Agrippa by the Senate commemorated the apparent establishment of peace in the former kingdom of Mithridates.\"\nMithridates VI had conquered the eastern shores of the Euxine Sea (the Black Sea), from Colchis to the Cimmerian Bosporus, thus joining the region with his kingdom of Pontus. The Cimmerian Bosporus became a separate kingdom when his son, Pharnaces II, rebelled against his father when the latter was defeated by Pompey in the Third Mithridatic War (73-63 BC) and withdrew to the Cimmerian Bosporus. Pharnaces hoped to obtain the favour of the Romans. He sent the body of his father, who had himself killed after a suicide attempt in 63 BC, to Pompey. Pharnaces obtained the crown of the Cimmerian Bosporus.\nThis marriage was Polemon's first marriage and Dynamis' second. The couple had no children, Dynamis was already an elderly woman.  Minns thought that Dynamis’ marriage was forced on her and that this represented an assertion of Roman power which almost coincided with \"the assumption by Augustus of the sole right to coin gold and the limitation of other coining rights.\" This was the start of a period in Bosporan history in which \"the Romans controlled the issues of the Bosporan mint.\" From 8/9 BC to 80/1 AD, the gold coins did not have the full name of the king or his head. Instead, the rulers were identified with monograms.\nKersley thinks that Rome's support for Polemon I in the Bosporus was about seeking to limit the power of Dynamis and challenging her sovereignty. However, we do not know the details about who Scribonius was, what the circumstances of his marriage with Dynamis were and why Rome was opposed to his power bid.\nSole queen\nThe marriage between Dynamis and Polemon I lasted not much longer than a year. Polemon married Pythodorida of Pontus. The date of this marriage is uncertain. Rostovtzeff argued that it was in 12 or 13 BC. After this there is no record of Dynamis until 8 BC, when she reappeared on Bosporan coins and inscriptions. Thus, it seems that after the death of Polemon she regained the Bosporan kingdom and she appears to have ruled until 7-8 AD. Rostovtzeff assumed that during this period of absence from the record Dynamis took refuge with nearby Sarmatian tribes. However, there is no evidence for this. Or Dynamis died in 14 BC and Polemon ruled until 8 BC.\nRose formerly argued that Dynamis might have accompanied Agrippa when he left Anatolia and returned to Rome in 13 BC and stayed there until Polemon died. When she returned home she dedicated statues to Augustus and his wife Livia and coinage with the portraits of Augustus and Agrippa. Phanagoria was renamed Agrippia. Rose abandoned his earlier view that the figures of a background woman and a boy on the southern panel of the Ara Pacis Augustae (Altar of Augustan Peace) in Rome were depictions of Dynamis and her son. In this relief the figures are next to Agrippa. Agrippa had undertaken a three-year tour of the east (Greece, Anatolia, Syria and Judea) to deal with political affairs in the east from late 17/early 16 BC to 13 BC.  However, the woman is a Roman, not a foreign queen.  The boy is an Eastern prince, probably a Parthian.\nThe woman on the Ara Pacis panel wears a brill mistaken for a diadem. Dynamis’ grandfather, Mithridates VI, associated himself with the god Dionysus. Not surprisingly, there was a sanctuary of Dionysus in Panticapaeum, the Bosporan capital. The presence of this foreign prince and others on the Ara Pacis illustrates the success of Roman foreign policy in a now peaceful world. It also provides a visual reference to “the foreign rulers and members of their families who sought refuge or residence with [Augustus] in Rome.\"\nSole rule and allegiances\nHardly anything is known about Dynamis from the ancient literature. The only reference to her are Cassius Dio's mention that she was the wife of Asander and that Scribonius and Polemon I married her and Appian's mention that Pharnaces II offered her in marriage to Gaius Julius Caesar (see above). The fact that she returned to power in the Bosporan kingdom is indicated by numismatic and epigraphic evidence, which also suggests that she ruled on her own.\nTwo inscriptions attest that, during her reign, Dynamis dedicated two statues to Augustus, one in Phanagoria, and the other in Panticapaeum. Another inscription attests a dedication of a statue to Livia Drusilla, the wife of Augustus, by Dynamis at the temple of Aphrodite. In all inscriptions she describes herself as βασίλισσα Δύναμις φιλορώαμιος, Queen Dynamis philoromaios (friend of the Romans). The inscription in Phanagoria reads:\n: αύτoκράτoρα Kαίσαpα θεού υίόν | Σεβαστόν τόν [π]άσης γής καί | [πάσης] θαλάσσης ά[ρχ]οντα | τόν έαυτής σωτ[ήρα καί εὐ]εργέτη[v] | βασίλισσα Δύν[αμις φιλορώ]μαιος\n: The emperor, Caesar, son of god, | August (venerable), of all land and | all sea the overlord, | to her saviour and benefactor, | queen Dynamis philoromaios\nSimilarly, the inscription in Panticapaeum reads:\n: α]ύτoκράτoρα Kαίσαpα θεόν | [θ]εού υίόν Σεβαστόν τόν έαυτής | [σ]ωτήρα καί εὐεργέτηv | [β]ασίλισσα] Δύνα]μις φιλορώμαιος\n: The emperor Caesar, god, | son of god, August, to her| saviour and benefactor, | queen Dynamis philoromaios.\nThe inscription of the statue dedicated to Livia reads:\n: Λιουίαν τήν τού Σεβαστού γuναίκ[α] | [β]ασίλισσα] Δύνα]μις φιλορώμαιος | [τήν έαυ]τής εὐεργέτηv\n: Livia, the wife of the August, | Queen Dynamis philoromaios | to her benefactress.\nThe people of Phanagoria erected a statue dedicated to Dynamis. The inscription reads:\n:[β]ασίλισσα Δύναμις φιλορώμ[αιος | τη]ν έκ βασιλέω[ς μ]εγάλου Φαρνάκου [τό]ν έκ βασιλέως βασιλέων Μιθ[ραδάτη]ν Ευπάτορος [Διό]νυσ[ο]ν [τή]ν έαυτών σ[ώτειραν κ]αί ευε[ργέτι]ν [ό δ]ήμος [ό Άγριπ]πέων.\n:Queen Dynamis philoromaios, | [daughter] of king the great Pharnaces, [son] of king of kings Mithridates Epurator Dionysus, to their saviour and benefactress, the people of the city of Agrippa.\nThese inscriptions show that Dynamis had close associations with Augustus, Livia and Agrippa. Rose sees them as supporting his theory that Dynamis might have gone to Rome with Agrippa and stayed there while Polemon was married with Pythodorida. Roses also suggests that she might have been one of \"the foreign rulers and members of their families who sought refuge or residence\" with Augustus whom he enumerated in his Res Gestae Divi Augusti. One problem with this is that the Res Gestae did not mention Dynamis. However, it can be noted that no women were mentioned.\nRostovtzeff noted that the inscriptions by Dynamis attest some beneficence by Augustus and Livia and of that the one by people of Phanagoria attest some beneficence by Dynamis. All inscriptions refer to some act of salvation.\nRostovtzeff also argued that the evidence points to Dynamis being the sole ruler after 8 BC. The inscription by the people of Phanagoria can be dated approximately. It could not date to before the intervention of Agrippa in the Bosporus and the adoption by this city of the name of Agrippia, which indicates that this city was grateful to him. Orieshnikoff suggests that other city adopted the name of Caesarea at the same time as indicated by two series of coppers coins with the inscriptions Αγριππέωv (Agrippia) and Κασαρέωv (Caesarea) respectively. Orieshnikoff thinks that the city was Panticapaeum and he also connects these coins to a series of gold staters with the heads of Augustus and Agrippa on them which starts from 8 BC and “goes up to 7 AD.”\nThe changes of names by cites in the Bosporus probably date to the time of the start of this series of staters and therefore not to Dynamis' reign in 17-16 BC or the time of her marriage with Polemon. There is no reference to Polemon on the coins and Dynamis appears as the sole ruler. In addition to this, they bear a monogram which Mommsen deciphered into the name of Dynamis. The inscription by the people of Phanagoria states that she was the daughter of Pharnaces I and granddaughter of Mithridates VI. This emphasised her right to the throne by virtue of belonging to the line of these two kings. It would have been a belittling of Polemon. He would not have allowed this.\nAnother inscription which stated that Dynamis was the daughter of Pharnaces and granddaughter of Mithridates was found in February 1957 during excavations in the site of ancient Panticapaeum (near modern Kerch). In this inscription Mithridates is referred to as king, rather than king of kings.\nDynamis dedicated a gravestone to a Sarmatian man called Matian, the son of Zaidar. The gravestone depicts a horseman with a bow and quiver. This indicates that Asander's practice of using Aspurgian cavalry detachments and warriors of Sarmatian origin who used daggers, long swords and quivers to assist the defence of the kingdom was continued by Dynamis.\nRostovtzeff argued that a bronze bust of a female found in the Crimea is the portrait of a member of the Bosporan royal family. He maintained that it represented Dynamis. Roses seems to agree with its attribution to the Bosporan royal family. However, he maintains that its attribution to Dynamis is questionable. The woman wears a diadem and a Phrygian cap decorated with stars. Her hair has long corkscrew curls that fall to the shoulders. Roses argues that her features and hairstyle are much closer to the coin portraits of Gepaepyris, the daughter of Cotys VIII (the king of Sapaean Thracians from 12 AD to 19 AD) and Antonia Tryphaena. The latter was the daughter of Polemon I and Pythodorida.\nTheory of a marriage with Aspurgos\nSeveral scholars have argued that Aspurgos, who was the king of the Bosporus after Dynamis, was a son Dynamis had with her first husband Asander. Rose questions this notion. He notes that this is based on a single piece of evidence, an inscription [CIRB 40] of the late Augustan and the Tiberian periods about a Bosporan king which reads: ἐκ βασιλέως Ἀσανδρόχου (from basileus [king] Asandrochou).) The latter word would allegedly be a scribal error for \"Asandrou\" (of Asander - the son of Asander). However, \"Asandrochou\" would be an unusual mistake for \"Asandrou,\" and Rose agrees this identification was inconclusive and said without more conclusive evidence it \"is difficult to subscribe to this thesis.\" Kiessling considered this Asandrochou as a Sarmatian king who had nothing in common with Asander. Rostovtzeff agreed with Kiessling and went further. He argued that Dynamis married Aspurgos after Polemon's death. Thus, Aspurgos was Dynamis’ fourth husband.\nAccording to Rostovtzeff, it is possible that Agrippa had wanted Polemon and Dynamis to marry to stabilise the Bosporus, but the marriage did not work and out and Polemon married Pythodoris. He thinks that Dynamis fled to one of the neighbouring Sarmatian tribes because, according to Appian, two of these tribes, the Siraces and the Aorsi, had supported Pharnaces I, her father, in his rebellion against Mithridates VI. (Strabo mentioned that the Siraces and Aorsi, who lived on the eastern shores of Lake Maeotis (today's Sea of Azov), supplied him with combined force of 220,000 cavalry.) Dynamis’ mother was probably a Sarmatian woman from one of these two tribes. Aspurgos was probably the king of the tribe which sheltered Dynamis. He might have been a lesser king of the Sarmatian tribes. Rostovtzeff further hypothesises that Aspurgos was the leader of a group of young tribesmen who followed him in his advance to the Bosporus and formed his bodyguard, which assumed the name Aspurgians and gave their name to the land they occupied. Thus, the Aspurgians were not a tribe, but followers of king Aspurgos whom he led “from the shores of the Sea of Azov or from the depths of Sarmatia.”\nAspurgos may have hoped to seize the Bosporus, and thus may have supported Dynamis and married her. Dynamis organised a rebellion by the Sarmatians with the help of Aspurgos. This forced Polemon into military actions, which included the capture of Colchis and the sack of the city of Tanais, which were documented by Strabo. Dynamis, Aspurgos and the tribes on the shores of the Lake Maeotis held out and continued the resistance on and off from 13 BC to 8 BC. Rostovtzeff thought that this interpretation explained Polemon marrying Pythodorida.\nIn this theory, the link between Aspurgos and the Aspurgians is demonstrated by the support the Sarmatians gave to him and his successor, Mithridates VII. Aspurgos was probably also related to Dynamis through her Sarmatian mother.  Rostovtzeff also argued that Strabo enumerated the Maeotian tribes and then set apart the Aspurgians a “new tribe” in the region. However, Strabo mentioned the Aspurgians as having been attacked by Polemon and indicated that all Maeotian tribes were new tribes, not just the Aspurgians (the Aspurgians were one of these tribes).\nThe relevance of a possible link between Aspurgos and the Aspurgians in this theory is that Polemon was captured and killed when he attacked the Aspurgians by treachery. This was discovered, and he was outfoxed. According to Rostovtzeff, Polemon was striving to become the de facto ruler of the Bosporus, rather than just a vassal king. Dynamis succeeded in removing him with the help of Aspurgos. Augustus then had to settle the fate of the Bosporus. He supported Dynamis because of the military strength of Dynamis and Aspurgos, while Pythodorida could not guarantee the stability of the region as she had three children.\nMinns noted that we first hear of the Aspurgians when they defeated and killed Polemon and wrote that \"it is hardly a coincidence that Aspurgos is the name of the next king of whom we know, the rightful heir of Asander. It would be natural to suppose [the Aspurgians] to be a political party of [Aspurgos'] adherents having its chief strength in that part of the country ...\". However, the name Aspurgos occurs in a late third century inscription about an officer of the Bosporan monarchy. This may support Rostovtzeff's theory that the Aspurgians were a military entity. The region where they settled, the Taman Peninsula, was later called τά Ασπουργιανά (Asporgya) and was a local division of the kingdom. Minns made no reference to Rostovtzeff's idea that Dynamis took refuge among the Sarmatian tribes and allied with or married Aspurgos.\nRose notes that “the inscriptions and coins do not support” Rostovtzeff's theory that Dynamis married Aspurgos after Polemon's death.\nMinns related Polemon's struggles in Colchis and the eastern coast of Lake Maeotis, which led to the sack of Tanais, to Polemon having “no possible right to the Bosporus.” His father was from Laodicea on the Lycus in western Anatolia, far from the Cimmerian Bosporus. He had been elevated to the kingship of Lycaonia next to the Pontus, and Lesser Armenia by Mark Antony. Similarly, his second wife, Pythodorida, was the daughter of Pythodoros of Tralles (modern Aydın), also in western Anatolia, whom Mark Antony married to his eldest child, Antonia Prima. She, too, owed her status to Mark Antony.\nViews about the character of Dynamis' rule\nRostovtzeff also thought that with Augustus’ appointment of Dynamis the autonomy of the Bosporan kingdom ended. The head of Dynamis and her full title were not on the coins of the time. Only the mentioned monogram testified that she was the ruler (this was the practice established in 8/9 BC by Augustus for Bosporan coins which endured until 80/1 AD, see above). She was the ruler in the name of Augustus and this was testified by the head of Augustus being on one of the sides of the coins. The head of Agrippa, who by then had died, without an insignia on the other side of the coins was in his memory and a sign of Augustus’ reverence towards a man who had played a crucial role in the establishment of his power in Rome and who had worked hard to settle affairs in the east. The specifications of these coins must have been decided in Rome or by the Roman representative in the Bosporus.\nIn Rostovtzeff's view Dynamis had to show that she was thankful to Augustus and Livia and emphasise that she was philoromaios. The latter was an indication that she was a vassal of Rome despite being a descendant of Mithridates VI. She also felt obliged to change the name of two cities to Caesarea and Agrippia in honour to Augustus and Agrippa and to call Augustus a saviour and benefactor. The city of Phanagoria, which also had risked being sacked by Polemon like Tanais, honoured Dynamis as its saviour with a statue and did not forget to describe her as philoromaios.\nKersley holds a view which contrasts to that of Rostovtzeff and sees Dynamis’ sole rule positively. It could have been expected that when Octavian became the emperor Augustus, he “would have taken steps to curtail or remove from power any other queen within the empire he controlled after the victory over” Mark Antony. During his struggle with Antony, Octavian denigrated Cleopatra VII, the queen of Egypt (Antony's lover and ally) because of her gender and the fact that she was foreign. (Cleopatra committed suicide when she and Antony were defeated, Octavian removed her children from Egypt). Instead, he left in place the ‘political character’ of the Pontic region established by Mark Antony. This led to the recognition of two women as rulers (Dynamis and Pythodorida). The \"cultural difference between Rome and the East over the legitimacy of a female ruler … did not result in Augustus failing to acknowledge the queen of the Bosporan kingdom as an outright ruler.” Despite Rome's tradition of excluding women from politics, “[f]ar from removing Dynamis as a ruler because of sex, Augustus … actually enhanced her authority … [he] maintained her royal power and elevated her status in the cities of the Pontic region and beyond.”\nSee also\n* Bosporan Kingdom\n* Roman Crimea\nNotes\nReferences\n; Primary sources\n*Appian, The Civil Wars, Penguin Classics, 1996;\n*Cassius Dio, Roman History, vol. 5, Books 46-50 (Loeb Classical Library), Loeb, 1989;\n*Cassius Dio, Roman History, vol. 6, Books 51-55 (Loeb Classical Library), Loeb, 1989;\n*Strabo, Geography, vol. 5, Books 10-12 (Loeb Classical Library), Loeb, 1989;\n; Secondary sources\n* Braund, D., Rome and the Friendly King: The Character of the Client Kingship, Palgrave Macmillan, 1984; ; Kindle Edition, Routledge, 2014; ASIN: B00JKEYVK2\n*\n*Gajdukevic, V., Das bosporanische Reich, Akademie-Vlg. in AG mit Hermann Böhlaus Nachf. Berlin/Köln, 1971;\n*Kersley, R. A., Women and Public Life in Imperial Asia Minor, in Tsetskhladze, G. R., (ed.), Ancient West & East, Vol 4, No.1, BRILL, 2010;  [https://books.google.com/books?id=6Xh14u9WmnYC&dq=coins+of+dynamis&pg=PA101]\n* Macurdy, G., Vassal - Queens and Some Contemporary Women in the Roman Empire, Johns Hopkins Press, 1937; ASIN: B000WUFYY0\n* Mayor, A., (2009), ''The Poison King: the life and legend of Mithradates, Rome's deadliest enemy, Princeton University Press. ASIN: B003V5WKPE\n* Minns, E., H., (2011) Scythians and Greeks, A Survey of Ancient History and Archaeology on the North Coast of the Euxine from the Danube to the Caucasus, Cambridge Library Collection – Archaeology, Cambridge University Press; reissue edition, 2011 (original edition 1913);  [https://books.google.com/books?id=ijJ4o2iorhkC&dq=coins+of+dynamis&pg=PA592]\n* Rose, C. B., \"Princes\" and Barbarians on the Ara Pacis, American Journal of Archaeology, Vol. 94, No. 3 (July 1990), pp.&nbsp;453–467 [https://powerimagepropaganda.files.wordpress.com/2011/04/rose-ara-pacis.pdf]\n* Rostovtzeff, M., Queen Dynamis of Bosporus, The Journal of Hellenic Studies, vol. 39 (1919), pp.&nbsp;88–109\n* Smith, W., (ed.). Dictionary of Greek and Roman Biography and Mythology, articles on Asander [https://www.perseus.tufts.edu/hopper/text?doc=Perseus%3Atext%3A1999.04.0104%3Aalphabetic+letter%3DA%3Aentry+group%3D48%3Aentry%3Dasander-bio-1], Pharnaces II [https://www.perseus.tufts.edu/hopper/text?doc=Perseus%3Atext%3A1999.04.0104%3Aalphabetic+letter%3DP%3Aentry+group%3D19%3Aentry%3Dpharnaces-ii-bio-6], Polemon I [https://www.perseus.tufts.edu/hopper/text?doc=Perseus%3Atext%3A1999.04.0104%3Aalphabetic+letter%3DP%3Aentry+group%3D34%3Aentry%3Dpolemon-i-bio-7]; Scribonius [https://www.perseus.tufts.edu/hopper/text?doc=Perseus%3Atext%3A1999.04.0104%3Aalphabetic+letter%3DS%3Aentry+group%3D9%3Aentry%3Dscribonius-bio-1]\n* Sullivan, R.D., Dynasts in Pontus, ANRW II 7.2 (1980) pp.&nbsp;919–20;\n*\n*\n*\nExternal links\n*[https://books.google.com/books?id=HF0m3spOebcC A picture of a Bronze Bust of Dynamis on page 90 from the Encyclopedia of women in the ancient world]. In this picture Dynamis, is wearing a Royal Persian Headdress called the Tiara Orthe'', covered with stars. In Dynamis’ portrait, she may have imitated one of Livia's hairstyles.\n*"
    }
  ]
}