{
  "content": [
    {
      "type": "text",
      "text": "# Earl of Kingston__disambig_1\n\n, when he also adopted the additional surname of Tenison, following his marriage]]\nMitchelstown Castle, [[County Cork, the former seat of the King family.]]\nEarl of Kingston is a title in the Peerage of Ireland. It was created in 1768 for Edward King, 1st Viscount Kingston. The Earl holds the subsidiary titles Baron Kingston, of Rockingham in the County of Roscommon (created in 1764), Viscount Kingston, of Kingsborough in the County of Sligo (created in 1766), Baron Erris, of Boyle in the County of Roscommon (created in 1801), and Viscount Lorton, of Boyle in the County of Roscommon (created in 1806), also in the Peerage of Ireland. He is also a baronet in the Baronetage of Ireland. Between 1821 and 1869 the earls also held the title Baron Kingston, of Mitchelstown in the County of Cork (created in 1821), in the Peerage of the United Kingdom.\nFamily history to 1755\nThe King family descends from Robert King, younger brother of John King, 1st Baron Kingston (a title which became extinct in 1761; see Baron Kingston). In 1682 Robert King was created a baronet, of Boyle Abbey in the County of Roscommon. He subsequently represented County Roscommon and Boyle in the Irish House of Commons. He was succeeded by his son, John, the second Baronet, who also represented County Roscommon and Boyle in the Irish Parliament.\nJohn died childless and was succeeded by his younger brother, Henry, the third Baronet, who like his father and brother represented County Roscommon and Boyle in Parliament. Henry was succeeded by his eldest son, Robert, the fourth Baronet, who sat as Member of Parliament for Boyle. In 1748, aged 24, Robert was created Baron Kingsborough in the Peerage of Ireland. He died unmarried only seven years later, at which time the barony became extinct.\nFamily history 1755–1869\nLord Kingsborough was succeeded in the baronetcy by his younger brother, Edward, the fifth Baronet, who represented Boyle and County Sligo in the Irish Parliament. In 1764 Edward was raised to the Peerage of Ireland as Baron Kingston, of Rockingham in the County of Roscommon, a revival of the barony held by his kinsmen which had become extinct three years earlier. He was further honoured when he was made Viscount Kingston, of Kingsborough in the County of Sligo, in 1766, and Earl of Kingston in 1768, also in the Peerage of Ireland.\nHe was succeeded by his son, Robert, the second Earl, who represented County Cork in the Irish House of Commons.He married his kinswoman, the heiress Caroline Fitzgerald (died 1823), daughter of Richard FitzGerald by the Honourable Margaret King, daughter of James King, 4th Baron King (of the first creation).\nThe second Earl and his wife had Mary Wollstonecraft as governess to their daughters. Her books Thoughts on the Education of Daughters and Original Stories from Real Life drew on her experiences under their roof at Mitchelstown Castle. She influenced their daughter Margaret King, who, as Lady Mount Cashell, undertook a Grand Tour on the Continent.\nThe second Earl was succeeded by his eldest son, George, the third Earl, who represented County Roscommon in the Irish Parliament and later sat in the British House of Lords as an Irish representative peer. In 1821 he was created Baron Kingston, of Mitchelstown in the County of Cork, in the Peerage of the United Kingdom, which gave him and his descendants an automatic seat in the House of Lords. His eldest son, Edward, Viscount Kingsborough, was an antiquarian and also represented County Cork in the British Parliament.\nLord Kingsborough predeceased his father, unmarried, and the earldom devolved on his younger brother, Robert, the fourth Earl. Robert sat as Member of Parliament for County Cork but was later declared to be of an \"unsound mind\". He died unmarried and was succeeded by his younger brother, James, the fifth Earl, who died childless in 1869, when the barony of Kingston created in 1821 became extinct.\nFamily history, 1869–present\nThe fifth Earl was succeeded in the remaining titles by his first cousin, Robert King, 2nd Viscount Lorton, who became the sixth Earl. Robert was the son of General the Honourable Robert King, fourth son of the second Earl, who had been created Viscount Lorton in the Peerage of Ireland in 1806 (see Viscount Lorton for earlier history of this branch of the family). Robert, the sixth Earl, had previously represented County Roscommon in Parliament. He died in October 1869, only a month after he succeeded in the earldom.\nHe was succeeded by his elder son, Robert, the seventh Earl, who died two years later at the age of forty, without any male issue. The seventh Earl was succeeded by his younger brother, Henry, the eighth Earl, who was Lord-Lieutenant of County Roscommon and sat in the House of Lords as an Irish Representative peer. Henry married Frances Margaret Christina King-Tenison, daughter of Edward King-Tenison, of Kilronan Castle, County Roscommon, and assumed in 1883 by Royal licence the additional surname of Tenison.\nHe was succeeded by his second but only surviving son, Henry, the ninth Earl, who fought in both the Second Boer War and the First World War and sat in the House of Lords as an Irish Representative peer. As of 2002 the titles are held by the ninth Earl's great-grandson, Robert, the twelfth Earl, who succeeded in 2002, the titles having descended from father to son. As of 31 July 2002, the twelfth Earl has not successfully proven his succession to the baronetcy and is therefore not on the Official Roll of the Baronetage. The baronetcy is considered dormant.\nExtended family\nThe Honourable Sir Henry King, fourth son of the second Earl, was a politician and soldier. The Honourable James William King, younger son of the second Earl, was a rear-admiral in the Royal Navy. George King, son of Reverend the Honourable Richard FitzGerald King, younger son of the second Earl, was a major-general in the British Army.\nThe Honourable Laurence Harman King-Harman, younger son of the first Viscount Lorton, was the father of Edward King-Harman, a politician (see also Stafford-King-Harman baronets), and Sir Charles King-Harman, High Commissioner to Cyprus.\nA significant cluster of individuals carrying the Kingston surname, in South West Cork, are attributed to a Col. Samuel Kingston settling and establishing a dynasty in the mid 17th century.\nSeats\nThe former seat of the King family was Mitchelstown Castle in Mitchelstown, County Cork which was burned down by the IRA in 1922. It was home of 1st. Lord Kingston.\nMitchelstown Castle 4th Lord Kingston in 1750 had a grand house, which was probably not the original castle.\nMitchelstown Castle (built 1776) a Georgian house was built by 2nd Earl Kingston. Subsequently, demolished in 1823.\nMitchelstown Castle (built 1823) was designed by James and George Richard Pain for 3rd. Earl of Kingston to be the largest house in Ireland. it was home for 4th and 5th Earls.\nKing House, Boyle County Roscommon, Built for Henry King 3rd. Bt. in 1739, possibly incorporating an earlier 17th c. house. Abandoned by the family in early 19th c.\nRockingham, Boyle, County Roscommon built in 1810 by John Nash for Robert King, younger son of 2nd. Earl Kingston. Burnt accidentally 1957.\nKilronan Castle, Keadue, north County Roscommon. Kilronan, reconstruction of Castle Tenison, in 1880s for 8th. Earl of Kingston. Also the home of 9th Earl of Kingston. Abandoned in 1940s following its acquisition by the Irish Land Commission.\nReconstructed in 2000s for use as a hotel.\nKing baronets, of Boyle Abbey (1682)\n*Sir Robert King, 1st Baronet (died 1707)\n*Sir John King, 2nd Baronet (died 1720)\n*Sir Henry King, 3rd Baronet (died 1740)\n*Sir Robert King, 4th Baronet (1724–1755) (created Baron Kingsborough in 1748)\nBarons Kingsborough (1748)\n*Robert King, 1st Baron Kingsborough (1724–1755)\nKing baronets, of Boyle Abbey (1682; Reverted)\n*Sir Edward King, 5th Baronet (1726–1797) (created Earl of Kingston in 1768)\nEarls of Kingston (1768)\n*Edward King, 1st Earl of Kingston (1726–1797)\n*Robert King, 2nd Earl of Kingston (1754–1799)\n*George King, 3rd Earl of Kingston (1771–1839) (elected a Representative Peer in 1807)\n**Edward King, Viscount Kingsborough (1795–1837)\n*Robert Henry King, 4th Earl of Kingston (1796–1867)\n*James King, 5th Earl of Kingston (1800–1869)\n*Robert King, 6th Earl of Kingston (1804–1869)\n*Robert Edward King, 7th Earl of Kingston (1831–1871)\n*Henry Ernest Newcomen King-Tenison, 8th Earl of Kingston (1848–1896) (elected a Representative Peer in 1887)\n**Edward King, Viscount Kingsborough (1873–1873)\n*Henry Edwyn King-Tenison, 9th Earl of Kingston (1874–1946) (elected a Representative Peer in 1917)\n*Robert Henry Ethelbert King-Tenison, 10th Earl of Kingston (1897–1948)\n*Barclay Robert Edwin King-Tenison, 11th Earl of Kingston (1943–2002)\n*Robert Charles Henry King-Tenison, 12th Earl of Kingston (born 1969)\nPresent peer\nRobert Charles Henry King-Tenison, 12th Earl of Kingston (born 20 March 1969) is the only son of the 11th Earl and his wife Patricia Mary Killip. He was styled formally as Viscount Kingsborough between birth and 2002 and was educated at Repton School.\nOn 19 March 2002, he succeeded his father as Earl of Kingston, Baron Erris of Boyle, Viscount Kingston of Kingsborough, Baron Kingston of Rockingham, and Viscount Lorton, all in the peerage of Ireland, and also became the 16th King Baronet.\nIn 1994, he married Ruth Margaret Buckner, and they have two children:\n*Charles Avery Edward King-Tenison, Viscount Kingsborough (born 2000), heir apparent\n*Lady Frances Isobel Barclay King-Tenison (born 2002)\nSee also\n*Viscount Lorton\n*Baron Kingston\nReferences\nSources\n*\n*Kidd, Charles, Williamson, David (editors). Debrett's Peerage and Baronetage'' (1990 edition). New York: St Martin's Press, 1990,\n*Rebel Daughters: Ireland in conflict 1798 (2003) by Janet Todd\nExternal links\n*\n*\n*[http://www.cgoakley.org/efa/1771GK.html Brief biography of George King, 3rd Earl of Kingston]\n*[http://www.smh.com.au/articles/2002/04/05/1017206262443.html Obituary of Barclay King-Tenison, 11th Earl of Kingston]"
    }
  ]
}