{
  "content": [
    {
      "type": "text",
      "text": "# East Newark, New Jersey\n\n}}\n| subdivision_type1  = State\n| subdivision_name1  =\n| subdivision_type2  = County\n| subdivision_name2  =  Hudson\n| government_footnotes =\n| government_type    = Borough\n| governing_body     = Borough Council\n| leader_title       = Mayor\n| leader_name        = Dina M. Grilo (D, term ends December 31, 2027)\n| leader_title1      = Administrator\n| leader_name1       = Fred Confessore\n| leader_title2      = Municipal clerk\n| leader_name2       = Cosmo A. Cirillo\n| established_title  = Incorporated\n| established_date   = July 2, 1895\n| unit_pref          = Imperial\n| area_footnotes     =\n| area_magnitude     =\n| area_total_km2     =  0.32\n| area_land_km2      =  0.27\n| area_water_km2     =  0.06\n| area_total_sq_mi   =  0.13\n| area_land_sq_mi    =  0.10\n| area_water_sq_mi   =  0.02\n| area_water_percent = 16.92\n| area_rank          = 564th of 565 in state12th of 12 in county\n| population_as_of   = 2020\n| population_footnotes =\n| population_total   = 2594\n| population_rank    = 464th of 565 in state12th of 12 in county\n| population_density_km2 = auto\n| population_density_sq_mi = 25301.5\n| population_density_rank = 6th of 565 in state5th of 12 in county\n| population_est     = 2428\n| pop_est_as_of      = 2023\n| pop_est_footnotes  =\n| timezone           = Eastern (EST)\n| utc_offset         = −05:00\n| timezone_DST       = Eastern (EDT)\n| utc_offset_DST     = −04:00\n| elevation_footnotes =\n| elevation_m        =\n| elevation_ft       = 16\n| coordinates_footnotes =\n| coordinates        =\n| postal_code_type   = ZIP Code\n| postal_code        = 07029\n| area_code          = 973\n| blank_name         = FIPS code\n| blank_info         = 3401719360\n| blank1_name        = GNIS feature ID\n| blank1_info        = 0885199\n| website            = }}\n| footnotes          =\n}}\nEast Newark is a borough in the western part of Hudson County, in the U.S. state of New Jersey. The borough, a suburb of Newark, which sits across the Passaic River, is the second-smallest municipality by total area in the state.\nThe Borough of East Newark was established on July 2, 1895, from portions of Kearny lying between the Erie Railroad's Newark Branch right of way and Harrison, based on the results of a referendum held the previous day.\nAs of the 2020 United States census, the borough's population was 2,594, an increase of 188 (+7.8%) from the 2010 census count of 2,406, which in turn reflected an increase of 29 (+1.2%) from the 2,377 counted in the 2000 census.\nGeography\nAccording to the United States Census Bureau, the borough had a total area of 0.13 square miles (0.32&nbsp;km2), including 0.10 square miles (0.27&nbsp;km2) of land and 0.02 square miles (0.06&nbsp;km2) of water (16.92%).\nThe borough is bordered to the north by Kearny and to the south and east by Harrison, both in Hudson County, and to the west by the Passaic River across from which is Newark in Essex County.\nThe Clark Thread Company Historic District is located in the borough.\nDemographics\n, United States Census Bureau. Accessed June 28, 2012. 2020\n}}\n2010 census\nThe 2010 United States census counted 2,406 people, 759 households, and 569 families in the borough. The population density was 23,532.1 per square mile (9,085.8/km2). There were 794 housing units at an average density of 7,765.8 per square mile (2,998.4/km2). The racial makeup was 63.01% (1,516) White, 1.91% (46) Black or African American, 0.42% (10) Native American, 7.81% (188) Asian, 0.04% (1) Pacific Islander, 22.90% (551) from other races, and 3.91% (94) from two or more races. Hispanic or Latino of any race were 61.39% (1,477) of the population.\nOf the 759 households, 36.6% had children under the age of 18; 45.2% were married couples living together; 18.7% had a female householder with no husband present and 25.0% were non-families. Of all households, 15.3% were made up of individuals and 4.3% had someone living alone who was 65 years of age or older. The average household size was 3.17 and the average family size was 3.38.\n22.0% of the population were under the age of 18, 14.6% from 18 to 24, 32.2% from 25 to 44, 24.0% from 45 to 64, and 7.3% who were 65 years of age or older. The median age was 31.9 years. For every 100 females, the population had 101.8 males. For every 100 females ages 18 and older there were 100.1 males.\nThe Census Bureau's 2006–2010 American Community Survey showed that (in 2010 inflation-adjusted dollars) median household income was $54,722 (with a margin of error of +/− $5,909) and the median family income was $59,423 (+/− $9,367). Males had a median income of $41,173 (+/− $3,762) versus $28,224 (+/− $4,249) for females. The per capita income for the borough was $22,242 (+/− $2,054). About 7.9% of families and 12.5% of the population were below the poverty line, including 15.3% of those under age 18 and 16.1% of those age 65 or over.\n2000 census\nAs of the 2000 United States census, there were 2,377 people, 767 households, and 605 families residing in the borough. The population density was . There were 799 housing units at an average density of . The racial makeup of the borough was 67.02% White, 1.68% African American, 0.50% Native American, 2.52% Asian, 0.04% Pacific Islander, 20.99% from other races, and 7.24% from two or more races. Hispanic or Latino of any race were 47.54% of the population.\nAs of the 2000 Census, 10.1% of East Newark's residents identified themselves as being of Peruvian American ancestry. This was the highest percentage of Peruvian American people in any place in the United States. In the same census, 6.2% of East Newark's residents identified themselves as being of Brazilian American ancestry, which was the highest percentage of Brazilian American people in any place in the United States. As of the 2000 Census, 7.67% of East Newark's residents identified themselves as being of Ecuadorian ancestry, which was the highest of any municipality in New Jersey and the third highest percentage of Ecuadorian people in any place in the United States with 1,000 or more residents identifying their ancestry.\nThere were 767 households, out of which 41.9% had children under the age of 18 living with them, 55.0% were married couples living together, 16.0% had a female householder with no husband present, and 21.1% were non-families. 16.0% of all households were made up of individuals, and 5.9% had someone living alone who was 65 years of age or older. The average household size was 3.10 and the average family size was 3.40.\nIn the borough the population was spread out, with 25.9% under the age of 18, 10.9% from 18 to 24, 36.7% from 25 to 44, 18.8% from 45 to 64, and 7.6% who were 65 years of age or older. The median age was 32 years. For every 100 females, there were 103.9 males. For every 100 females age 18 and over, there were 104.5 males.\nThe median income for a household in the borough was $44,352, and the median income for a family was $46,375. Males had a median income of $31,875 versus $24,231 for females. The per capita income for the borough was $16,415. About 11.3% of families and 12.6% of the population were below the poverty line, including 17.7% of those under age 18 and 8.6% of those age 65 or over.\nGovernment\nLocal government\nEast Newark is governed under the borough form of New Jersey municipal government, one of 218 municipalities (of the 564) statewide that use this form, the most commonly used form of government in the state. The governing body is comprised of the mayor and the borough council, with all positions elected at-large on a partisan basis as part of the November general election. The mayor is elected directly by the voters to a four-year term of office. The borough council includes six members elected to serve three-year terms on a staggered basis, with two seats coming up for election each year in a three-year cycle. The borough form of government used by East Newark is a \"weak mayor / strong council\" government in which council members act as the legislative body with the mayor presiding at meetings and voting only in the event of a tie. The mayor can veto ordinances subject to an override by a two-thirds majority vote of the council. The mayor makes committee and liaison assignments for council members, and most appointments are made by the mayor with the advice and consent of the council.\n, the Mayor of East Newark is Democrat Dina M. Grilo, whose term of office ends December 31, 2027; Mayor Grilo is the first woman to serve as East Newark's mayor, having defeated Democratic-turned-Republican incumbent mayor Joseph Smith in the 2019 local election. Members of the East Newark Borough Council are Chair Christopher Reis (D, 2025), Jessica Diaz (D, 2025), Rose M. Evaristo (D, 2027), Kenneth J. Graham (D, 2027), Acacio De Oliveira (D, 2026) and Jeanne Zincavage (D, 2026).\nFederal, state and county representation\nEast Newark is located in the 8th Congressional District and is part of New Jersey's 29th state legislative district.\nPolitics\nAs of November 2024, there are a total of 1,105 registered voters in East Newark.\n}}\nIn the 2012 presidential election, Democrat Barack Obama received 82.3% of the vote (400 cast), ahead of Republican Mitt Romney with 16.5% (80 votes), and other candidates with 1.2% (6 votes), among the 492 ballots cast by the borough's 844 registered voters (6 ballots were spoiled), for a turnout of 58.3%. In the 2008 presidential election, Democrat Barack Obama received 76.0% of the vote (414 cast), ahead of Republican John McCain with 22.6% (123 votes) and other candidates with 0.7% (4 votes), among the 545 ballots cast by the borough's 904 registered voters, for a turnout of 60.3%. In the 2004 presidential election, Democrat John Kerry received 71.2% of the vote (337 ballots cast), outpolling Republican George W. Bush with 26.4% (125 votes) and other candidates with 0.8% (6 votes), among the 473 ballots cast by the borough's 800 registered voters, for a turnout percentage of 59.1.\n{| class=\"wikitable\" style=\"float:right; font-size:95%;\"\n|+ Presidential Elections Results\n!Year\n!Republican\n!Democratic\n!Third Parties\n|-\n| style=\"text-align:center;\" |2024\n| style=\"text-align:center;\" |45.7% 258\n| style=\"text-align:center;\" |51.3%  290\n| style=\"text-align:center; background:honeyDew;\" |3.0% 14\n|-\n| style=\"text-align:center;\" |2020\n| style=\"text-align:center;\" |31.7% 201\n| style=\"text-align:center;\" |64.4%  408\n| style=\"text-align:center; background:honeyDew;\" |3.9% 10\n|-\n| style=\"text-align:center;\" |2016\n| style=\"text-align:center;\" |24.6% 135\n| style=\"text-align:center;\" |71.4% 392\n| style=\"text-align:center; background:honeyDew;\" |3.8% 21\n|-\n| style=\"text-align:center;\" |2012\n| style=\"text-align:center;\" |16.5% 80\n| style=\"text-align:center;\" |82.3% 400\n| style=\"text-align:center; background:honeyDew;\" |1.2% 6\n|-\n| style=\"text-align:center;\" |2008\n| style=\"text-align:center;\" |22.6%  123\n| style=\"text-align:center;\" |76.0% 414\n| style=\"text-align:center; background:honeyDew;\" |0.7% 4\n|-\n| style=\"text-align:center;\" |2004\n| style=\"text-align:center;\" |26.4% 125\n| style=\"text-align:center;\" |71.2%   337\n| style=\"text-align:center; background:honeyDew;\" |0.8% 6\n|-\n|}\nIn the 2013 gubernatorial election, Democrat Barbara Buono received 64.9% of the vote (148 cast), ahead of Republican Chris Christie with 32.9% (75 votes), and other candidates with 2.2% (5 votes), among the 232 ballots cast by the borough's 884 registered voters (4 ballots were spoiled), for a turnout of 26.2%. In the 2009 gubernatorial election, Democrat Jon Corzine received 71.8% of the vote (234 ballots cast), ahead of Republican Chris Christie with 21.8% (71 votes) and Independent Chris Daggett with 4.0% (13 votes), among the 326 ballots cast by the borough's 765 registered voters, yielding a 42.6% turnout.\n}}\n}}\nEducation\nThe East Newark School District serves students in pre-kindergarten through eighth grade. As of the 2023–24 school year, the district, comprised of one school, had an enrollment of 240 students and 19.4 classroom teachers (on an FTE basis), for a student–teacher ratio of 12.4:1.\nFor ninth through twelfth grades, public school students attend Harrison High School in Harrison, as part of a sending/receiving relationship with the Harrison Public Schools. As of the 2023–24 school year, the high school had an enrollment of 784 students and 53.0 classroom teachers (on an FTE basis), for a student–teacher ratio of 14.8:1.\nPublic safety\nEast Newark is protected by a volunteer fire department. There are approximately 34 firefighters who staff one ladder and two engines, one of which is a spare. The department also has shared use of a hazmat mass decontamination trailer unit with the Kearny and Harrison Fire Departments. The fire department has mutual aid agreements with all Hudson County departments and is also a member of the Southern Bergen County Mutual Aid Association.\nEast Newark has a police department, led by Public Safety Director Al Bringa.\nTransportation\nRoads and highways\nin East Newark, just before crossing the Stickel Bridge]]\n, the borough had a total of  of roadways, of which  were maintained by the municipality and  by Hudson County.\nInterstate 280 passes through the southern portion of the borough. The entrances to interchange 16 lie in adjacent Harrison, and those for interchange 15B lie in Newark across the William A. Stickel Memorial Bridge over the Passaic River, which is crossed by the Clay Street Bridge.\nPublic transportation\nNJ Transit bus service is available to Newark on the 30 and 76 routes.\nThe closest NJ Transit rail station to East Newark is the Newark Broad Street Station, with connections to the Montclair-Boonton Line and both branches of the Morris & Essex Lines. The station is also served by the Newark Light Rail. The closest rapid transit service is the PATH's Harrison station, a few blocks south of East Newark.\nThe closest airport with scheduled passenger service is Newark Liberty International Airport, located  south in Newark and Elizabeth. John F. Kennedy International Airport and LaGuardia Airport are in Queens, New York City.\nNotable people\nPeople who were born in, residents of, or otherwise closely associated with East Newark include:\n* Davey Brown (1898–1970), professional soccer player inducted into the National Soccer Hall of Fame in 1951\n* Jimmy Douglas (1898–1972), soccer goalkeeper who spent his career in the first American Soccer League\n* Philip Kearny (1815–1862), United States Army officer, notable for his leadership in the Mexican–American War and American Civil War\n* Ken Kelsch (1947–2023), cinematographer whose films included Bad Lieutenant\n* Cornelius Augustine McGlennon (1878–1931), represented  from 1919 to 1921 and was Mayor of East Newark from 1907 to 1919\n* Erika Vogt (born 1973), sculptor, printmaker and video artist\nReferences\nExternal links\n* [https://www.boroughofeastnewark.com/ Borough of East Newark official website]\n* [https://www.eastnewarkschool.org/ East Newark Public School]\n*\n* [https://nces.ed.gov/ccd/schoolsearch/school_list.asp?Search=1&DistrictID=3404200 School Data for the East Newark Public School], National Center for Education Statistics"
    }
  ]
}