{
  "content": [
    {
      "type": "text",
      "text": "# East Knoyle War Memorial\n\n|location       = East Knoyle, Wiltshire\n|nearest_town   =\n|designer       = Herbert Maryon\n|inscription    =\n| embedded             =\n}}}}\nThe East Knoyle War Memorial is a monument that commemorates the lives of soldiers from East Knoyle, Wiltshire, England, who were killed in war. Unveiled on 26 September 1920, it was originally intended to commemorate the 20 soldiers from the parish who died during the First World War. Subsequent inscriptions were added to recognise twelve who were killed in the Second World War, and a soldier killed by friendly fire in the Iraq War. In 2016 the memorial was designated a Grade II listed building.\nThe memorial was designed by Herbert Maryon, who taught sculpture at the University of Reading. It consists of a three-stepped stone base, a square plinth, and a shaft that rises  and terminates in a small wheel cross. Each side of the plinth is inscribed. The front bears an inscription dedicated to those who died in the world wars; each is named on the right and rear. The left panel includes a Bible verse and the name of the soldier who died in Iraq.\nBackground\nIn the aftermath of the First World War and its unprecedented casualties, thousands of war memorials were built across Britain. Virtually every village, town, or city erected some form of memorial to commemorate their dead. In East Knoyle, a village and civil parish in Wiltshire, England, at least 20 of the 853 people who lived in the village before the war died in military service during it. The dead included three brothers, and five members of the Wyndham family, which tended one of the principal estates in East Knoyle. Shortly before her death in 1920, Madeline Wyndham, the matriarch of the family, commissioned two plaques for St. Mary's Church, one commemorating her five grandsons, and another, designed by Alexander Fisher, recognising all those from East Knoyle who died during the war.\nCommissioning\nA memorial committee was tasked with raising funds for a memorial and for additions to the village hall, to serve as a community centre. Chaired by Colonel Guy Wyndham, the committee had George Sidney Herbert as its honorary secretary, and was assisted by a Mr. F. W. Barnes. The three were well known to the village. Wyndham was the second son of Percy Wyndham and the father of Guy Richard Charles Wyndham, who at the time tended Clouds House, one of the principal estates in the area; his eldest son, George Heremon Wyndham, was killed in action in 1915. Herbert, who lived at Knoyle House across from the memorial's eventual location, was the son of the 14th Earl of Pembroke and brother of the 15th; involved with numerous organisations in East Knoyle and Wiltshire, he was, in the words of the Western Gazette, one of the county's \"best-known and most highly valued public men\". Barnes, meanwhile, was praised some years later for an \"extreme willingness in helping on anyone or any cause in the village\". Ultimately, £1,450 was raised for the cause: £1,000 from the trustees of the Seymour estate, and £450 through subscription.\nThe architect chosen to design the memorial was Herbert Maryon, who taught sculpture, including metalwork, modelling, and casting, at the University of Reading. Maryon had established himself in the Arts and Crafts movement before moving to academia,}} and in the years following the war designed several memorials. The East Knoyle memorial was among his first; the following year he designed the Mortimer War Memorial, a similar monument in Mortimer Common, Berkshire, and in 1923 he created a plaque for Manchester's Chorlton Road Congregational Church. The University of Reading likewise commissioned him to create their war memorial, which was unveiled in 1924.\nDesign\nThe East Knoyle War Memorial is located on a village green in the centre of East Knoyle, at the intersection of Church Road, The Street, and Wise Lane. Before a 1996 bypass, it stood alongside the A350. The location was named Knoyle House Corner when the memorial was built, although the namesake house was razed in 1954. Several hundred feet down Church Road lies St Mary's Church, a grade I listed building dating to the twelfth century.\nThe memorial is carved from Portland stone. It comprises a three-stepped square base set beneath a square plinth, from which a thin, tapering shaft rises  and terminates in a small wheel cross. Several stone flower holders rest on the top step, one of which is inscribed \"BEST KEPT WAR MEMORIAL 1973\".\nThe four sides of the plinth are each inscribed. The side facing the road bears an inscription commemorating those who died in the First and Second World Wars; their names are listed to its right and rear, respectively. John 15:13 is inscribed to its left, above the name of a soldier who died in the Iraq War.\n{| class=\"wikitable\"\n|-\n! Front !! Right !! Rear !! Left\n|-\n| TO·THE·GLORY·OF·GODAND·IN·MEMORY·OF·THEMEN·OF·THIS·PARISHWHO·MADE·THE·SUPREMESACRIFICE·IN·THE·GREATWAR·1914·1918·AND·INTHE·WORLD·WAR·1939·1945 || EDWIN·DURRANT:FRANK·W·KNIGHTGERALD·S·FORWARD:JAMES·J·LAMPARDJAMES·F·FLETCHER:REG·G·LITTLECOTTWILLIAM·T·FRICKER:OLIVER·SNOOKEROBERT·GRIFFITHS:EDWARD·D·SMALLALBERT·J·HARRIS:ERNEST·TANSWELLEDWARD·W·JOLLIFFE:ROBERT·S·TANSWELLFRED·JOLLIFFE:EDGAR·WAREHAMVICTOR·H·JOLLIFFE:GEORGE·WYNDHAMSYDNEY·JUKES:PERCY·L·WYNDHAM || NIGEL·N·ADAMS : WILLIAM·J·BOLTONR·ALAN·J·DENNIS : E·GEORGE·FLOWERH·JAMES·FORD : ERNEST·H·FRANCISVICTOR·J·T·HALLETT · GORDON·HARTJACK·D·PEPPER : GEORGE·E·THOMAS|| GREATER·LOVE·HATH·NOMAN·THAN·THIS·THAT·AMAN·LAY·DOWN·HIS·LIFEFOR·HIS·FRIENDS·IRAQ·2003·MATTHEW HULL\n|}\nHistory\n,  1920–1923]]\nThe memorial was unveiled on 26 September 1920. Henry Seymour Rawlinson, 1st Baron Rawlinson officiated, in one of his last public acts before departing to take up the Indian Command. Rawlinson's mother was from East Knoyle, and he had been brought up there as a child; his cousin Jane Margaret Seymour owned and leased out Knoyle House at the time. Another cousin, Colonel Henry Hales Pleydell-Bouverie, was a trustee to the estate of their uncle Alfred Seymour, which had donated to the memorial's fund. Rawlinson had also been friends with George Wyndham, whose son Percy Lyulph Wyndham had served as Rawlinson's aide-de-camp before his death in the First Battle of the Aisne in 1914.\nRawlinson arrived with his wife and was received by a guard of honour comprising the Comrades of the Hindon and Knoyle Posts and the Knoyle Girl Guides; the Knoyle Band, conducted by a Mr H. Fry, performed as well. Among those in attendance, the Western Gazette reported, included three members of the Wyndham family—Guy Wyndham, his daughter Olivia, and his son Guy Richard Charles—and four of the Herberts: George Herbert, his mother the Dowager Countess of Pembroke, his sister Lady Muriel Jex-Blake, and her husband Arthur John Jex-Blake, whom she had married the previous month. The Seymour estate was represented by Colonel Pleydell-Bouverie. Others included the memorial's architect Herbert Maryon, committee member F. W. Barnes, the local physician and surgeon Joseph Charles Blythe and his wife, the vicar of next-door Hindon Rev. Marshall Winder Lumsden, who was a chaplain during the war, and an Inspector Townshend. Others who were not named also attended, including a substantial number of veterans, and family members of those killed.\nThe ceremony began in St Mary's Church and, led by the choir and clergy, proceeded to the memorial. The rector and curate—Rev. William Neville and Rev. E. A. Reader, respectively—conducted a brief service and Rev. Frank E. Yeomans, the Primitive Methodist minister in nearby Mere, read a lesson, before Rawlinson removed a Union Jack from the memorial and delivered a speech. Rawlinson read the inscription on the front of the memorial, then commented on his childhood in East Knoyle; he recalled a number of people, such as his late uncle Alfred Seymour, and said one had been a close friend and aide-de-camp. Those whose names were engraved had done their duty, Rawlinson said, and the cross was erected as a memorial to their bravery, to record their great deeds, and to perpetuate their memory. Afterwards, the rector dedicated the memorial and led prayers. The hymns When I Survey the Wondrous Cross and There is a Blessed Home were sung, and buglers from the Wiltshire Regiment performed the Last Post. Rawlinson laid a laurel wreath on the memorial and relatives of the dead left flowers. Afterwards, the crowd left for the village hall, where Rawlinson officially opened the new additions.\nSecond World War\nIn late 1945, months after the surrender of Japan marked the close of the Second World War, preparations were made to celebrate the return of veterans to East Knoyle, and commemorate the fallen. The estate of Jane Seymour, who had recently died, had donated the village hall and adjoining land, including the War Memorial Garden, to the parish, and the family of Percy Houghton Brown, a local barrister who had died the previous year, had given £900 for improvements. The funds were given in memory of Houghton Brown's son Alastair, who had died in action in Libya in 1942. In addition, by 27 November 1945, a campaign had raised £185 for a \"Welcome Home Fund\", intended to be distributed among the returning servicemen and women, and another £92 for a \"Memorial Fund\". At a public meeting held on that date, it was decided to add a shelter to the memorial garden, and to inscribe the memorial with the names of those who had died in the Second World War; twelve names were added as a result. It was also decided to transfer the trusteeship and management of the memorial to the parish council.\nIn December 1946 a celebration for the returning servicemen and women was held in the town hall. 65 returning servicemembers were given a cheque and card in thanks.\nAfter the Second World War\nAnother name was added after to the memorial after a soldier was killed by friendly fire in Iraq in 2003.\nOn 4 October 2016 the memorial was designated a Grade II listed building. The listing entry termed the memorial \"an eloquent witness to the tragic impact of world events on the local community and the sacrifice it made in the conflicts of the [twentieth and twenty-first centuries]\". According to the village newsletter, a ceremony was held there on 11 November 2018 to mark the 100th anniversary of the end of the First World War. As part of the observances the village also researched the local men who died during the war, and placed plaques outside their onetime houses. The research pushed the recognised number of East Knoyle deaths from 20 to 27; the additional seven—the brothers Percival Henry and Walter Geoffrey Hill, the brothers James Henry and Tom Samuel Lampard, and William George Caddy, William John Clifford, and George Elliott—were born in East Knoyle but raised elsewhere.\n}}\nBibliography\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\nFurther reading\n*\n*\n*   — For some local information on the memorial, such as:\n:*\n:*\n:*\n:*"
    }
  ]
}