{
  "content": [
    {
      "type": "text",
      "text": "# Eastern Europeans in the United Kingdom\n\nRomanianRussianUkrainianOther Eastern European Languages}}\n| rels             = Christianity, Non-religious, others\n| related-c        = Estonians, Latvians, Lithuanians, Belarusians, Ukrainians, Moldovans, Russians, Poles, Czechs, Slovaks, Hungarians, Slovenes, Croats, Bosniaks, Serbs, Kosovars, Montenegrins, Macedonians, Romanians, Bulgarians, Albanians\n| native_name      =\n| native_name_lang =\n| related_groups   =\n}}\nImmigrants from Eastern Europe and their descendants have been present in the United Kingdom, in small numbers, for several centuries, with subsequent large migrations in the 21st century. At times, British media also included people with Central European ancestry in this category. This is similar to the definition of Eastern European in the United States, Canada, and Australia: Coming from former Eastern Bloc countries.\nThere are roughly 2.2 million Eastern European nationals living in the UK, with the largest groups being Polish, Romanian, and Lithuanian. This includes 1,429,000 nationals from EU8 countries, 570,000 nationals from EU2 countries, 29,000 from Cyprus, Malta, and Croatia outside of the EU's original fourteen (Austria, Belgium, Denmark, Finland, France, Germany, Greece, Ireland, Italy, Luxembourg, the Netherlands, Portugal, Spain and Sweden), and 216,000 from non-EU Europe.\nDemographics\nAccording to the 2011 UK census, Boston, Lincolnshire was the town with the highest percentage of Eastern-European residents in England and Wales.\nEducation\nA 2014 King's College London report found that pupils from this group faced stereotypes associated with their heritage. There were also revealed to be grade differences between different nationalities. A 2019 UCL Institute of Education report found an achievement gap in areas such as Reading and Writing (in English) between Eastern European students and those of a white British background. This, however, could be explained by the fact that English is their second language, as well as the fact that Slavic languages differ from English to a greater degree than Western European languages. Publication also shows much less pronounced differences in maths and suggests that the lower attainment could be due to factors such as: economic and social disadvantages, lack of fluency in English and prejudice (and racism) of the teachers.\nOther research shows Polish pupils perform well in British schools despite language difficulties, moreover their presence in schools appears to improve the performance of other British pupils.\nEmployment\nA 2013 academic report found data suggesting \"Eastern Europeans in Scotland value the opportunities for self-employment.\" In 2015, the majority of the grouping, that were resident in Suffolk, were working-age and often young adults. In 2017, published data showed that many held low-skilled or untrained occupations.\nHistory\nThe 1901 United Kingdom census recorded 86,240 Eastern Europeans in England and Wales, and a further 10,373 in Scotland. This represented an increase of over 55,000 on the previous 1891 census. There was a considerable public backlash against this immigration resulting in the Aliens Act 1905 and the subsequent Aliens Act 1914 which sought to restrict or halt such immigration..\nPost-war refugees and labour\nIn the aftermath of World War II, approximately 80,000 Eastern Europeans, who were displaced or homeless, settled in the United Kingdom. CEE (Central and Eastern European) refugees were also recruited as labourers from the European Voluntary Workers scheme, and were brought into the country by Clement Attlee's government to rebuild post-war Britain.\nEU accession\nSince the opening up of EU accession in the early 21st-century, many Eastern Europeans have migrated to parts of the United Kingdom. This two-decade migration phenomenon has been described as unprecedented in the history of the country. In 2007 Rural Sociology published research which used Eastern Europeans in Britain as one of several examples of exceptional developments in the large-scale use of foreign labour or foreign workers in high-income nation's agricultural markets.\nThis has created some social challenges in Britain. Russell Deacon has highlighted tension in Welsh-speaking areas of Wales, and how Cymuned, a Welsh pressure group, lobbied the Welsh government to prioritize housing for locals over East Europeans in the early 2000s. In 2014, an analysis by John Harris appeared to outline social problems that had been created by large-scale immigration from Eastern Europe (and surrounding areas). Issues included reports of mafias operating, intra-ethnic disputes, killings, but also reported developments, including the ongoing revival of town centres due to East Europeans economic activity.\nBrexit\nIn June 2016, a referendum on the country's membership of the European Union took place. With a result to leave, many Eastern Europeans' relationship with, or perceived status in, the United Kingdom changed permanently. The month after the EU referendum, Under-Secretary of State Karen Bradley spoke in the House of Commons to address the issue of Eastern Europeans receiving xenophobic abuse in the aftermath of the result. In 2018, British media reported growing concern for East European people affected by Brexit. A 2018 study suggested the political process had particularly affected young Eastern Europeans \"positioned in between the category of “migrant” and “citizen”. Increasing living standards back home have been suggested in media as an explanatory driving force for the return of Eastern Europeans to their birth nations in 2019.\nCultural influence\nIn fiction\nFrom a Ukrainian family, British author Marina Lewycka's 2005 and 2007 novels A Short History of Tractors in Ukrainian and Two Caravans focus on Eastern Europeans agricultural workers in England.\nSocial and political issues\nDiscrimination\nRepresentative of the polarising nature regarding the issue of immigration from the region, in 2010, Prime Minister Gordon Brown's election campaign was reported to be negatively affected when he called a member of his party a \"bigoted woman\", after the Labour supporter raised the topic of Eastern Europeans arriving in Britain. In 2013, Romanian diplomat Ion Jinga suggested that \"inflammatory rhetoric\" in politics was increasing the risk of physical attacks on Eastern Europeans resident in the country.\nIntegration\nA 2013 Environment and Planning report correlated a \"positive and strongly significant relationship between self-employment and integration\" for the group. In 2014, University College London's Dr Julia Halej published study which analyzed perceptions created by national media; how Eastern Europeans within the country occupied the social boundary of \"whiteness\" in Britain, being variously portrayed as \"‘valuable’, ‘vulnerable’ and ‘villainous’\". A 2014 King's College London report, which examined the insights and challenges into the rapidly increasing various Eastern European ethnic groups in the UK education system, found that \"Young people from Eastern Europe are seen as a new ‘Other’, both by the white majority and more established minority ethnic groups.\"\nA 2018 research by Dr Magdalena Nowicka, published in the Journal of Intercultural Studies, detailed data-studies which revealed how some people within the group aspired for, or achieved, increased social status by embracing the meritocratic values of the white British class.\nReferences"
    }
  ]
}