{
  "content": [
    {
      "type": "text",
      "text": "# Eastern Shore Railroad (19th century)__disambig_1\n\n|image             =\n|image_size        =\n|image_caption     =\n|locale            = Eastern Shore of Maryland, U.S.\n|start_year        =\n|end_year          =\n|predecessor_line  =\n|successor_line    = New York, Philadelphia and Norfolk Railroad\n|length            =\n|hq_city           = Princess Anne, Maryland\n}}\nThe Eastern Shore Railroad was a railroad, opened in 1860, that connected the Delaware Railroad at Delmar to the Chesapeake Bay at Crisfield, Maryland and by boat to Norfolk, Virginia. It was also used to connect a branch to Pocomoke City, Maryland in 1871. It was reorganized in 1879 and then purchased by the New York, Philadelphia and Norfolk Railroad in 1884. It is unrelated to the 20th century Eastern Shore Railroad which ran on a different set of tracks.\nHistory\nThe Eastern Shore Railroad (ESR) was chartered in 1835 to build a railroad from Elkton, MD to Tangier Sound through the Maryland side of the Eastern Shore. It was promptly given $1 million to encourage its construction - of which only $57,000 was spent. By 1840 the effort had stalled having produced very little and being forced to sell what land it had purchased to cover its debts. The roadbed of this effort remained visible, and unused, for years.\nThe charter sat unused until 1853 when it was amended to extend the Delaware Railroad south from Delmar to Tangier Sound to connect to steamships headed for Norfolk, which was of great importance to the leaders of Philadelphia who bought a large percentage of the stock. The new company was organized on February 22, 1859 and work commenced the following October with financial aid from the state. The first section of the railroad to Salisbury, Maryland opened in late April 1860.\nWork was interrupted by the Civil War but resumed in late 1865. The railroad formally started running to Princess Anne on March 22, 1866, though infrequent trains had been running for several weeks before then. The railroad reached Governor's Point, which was then renamed Crisfield, on Tangier Sound later in the year and started service, provided by the Delaware Railroad, on Nov 20th. Steamers of the Eastern Shore Steamboat Company connected the port to Baltimore and other steamers connected it to Norfolk.\nBusiness interests in Baltimore quickly began to complain that by connecting Maryland's Eastern Shore towns to the Delaware Railroad - and thus to Wilmington and Philadelphia - business was being sent east instead of to Baltimore. They continued to press for a railroad down the Maryland side of the Delmarva Peninsula to Elkton but, despite several efforts and initiatives, one was never constructed.\nIn 1867, the Wicomico and Pocomoke Railroad (W&P) built a connection to the ESR at Salisbury, MD than ran east to Berlin, Maryland and in 1870 they extended the line west a short distance to the Wicomico River. In 1872, they extended it south to Snow Hill, Maryland. The extension and the lines built off it drove additional business to the ESR.\nIn 1871, the Worcester & Somerset Railroad built a 9 mile line branch off of the ESR from a point at Kings Creek, called Peninsular Junction to Pocomoke City in 1871.\nIn 1874, the Eastern Shore built an expensive fill and trestle that extended the rail terminal to what was known as “the Old Island”. And at the same time the W&P built a line from Berlin to Ocean City, Maryland, which opened in 1875 (and was extended across the Sinepuxent Bay in 1881 to the Hotel Atlantic. As a result, the ESR became part of the route between Baltimore and Ocean City.\nIn 1876 the Worcester Railroad built a line from Snow Hill to Franklin City, Virginia and Chincoteague Bay for the purpose of transporting oysters and other shellfish to Philadelphia, but they also built a line north to Selbyville, thereby bypassing the ESR.\nThe ESR constantly struggled to make money, but managed at times with revenue from shipping strawberries and oysters. In 1871 their locomotive, the Somerset, was seized in Delmar due to debts and around the same time the Delaware RR stopped leasing the line and the Eastern Shore took over management. In 1879 the mortgage bondholders foreclosed on the Eastern Shore and sold it at public auction to a new reorganized company of the same name, for which the state amended the charter in 1882.\nIn 1883, the railroad was purchased by Alexander Cassatt and William Lawrence Scott with ownership starting on January 1, 1884. They were at the time building the New York, Philadelphia and Norfolk Railroad and the ESR was absorbed into that railroad, with the line from  \"Pocomoke Junction\" - now Kings Creek - becoming the \"Crisfield Branch\". They immediately upgraded all of the rails from Delmar to Pocomoke Junction with Pennsylvania regulation steel rails.\nList of stations\n* Delmar\n* Salisbury\n* Fruitland\n* Eden\n* Princess Anne\n* Newtown Junction/Peninsula Station\n* Westover\n* Kingston\n* Marion\n* Crisfield\nRemnants\nThe full line eventually became part of the Pennsylvania Railroad and later Penn Central.\nWithin the town of Crisfield, between the city pier and Main Street, Maryland used the right-or-way to widen Maryland Route 413 in 1956. North of Main Street, the railroad track separated the two directions of MD 413: Maryland Avenue formed the southbound lanes while Richardson Avenue comprised the northbound lanes.\nFollowing the 1974 bankruptcy of Penn Central the line was broken into three parts.\nThe line between Delmar, DE and Kings Creek is still in use as the Delmarva Subdivision, owned by Norfolk Southern and operated by the Delmarva Central Railroad; as is the Crisfield Industrial Track extending 1.2 miles south from Kings Creek.\nThe 15.1 mile long line from the end of the Crisfield Industrial Track to Crisfield was sold to the Maryland Department of Transportation as the Crisfield Secondary Branch in 1976. It was reserved in case a line to the deep water port in Crisfield was ever needed again and immediately abandoned. The last train, pulling eight San Luis Central ice reefers of onions for a local plant that produced frozen onion rings at the time, left Crisfield on April 4, 1976. The tracks were soon pulled up, the old freight station torn down and the line within MD 413 was replaced with a landscaped median. The right-of-west between 4th and Daugherty Creek in Crisfield was absorbed by adjacent landowners.\nIn  2018 the County began to turn the remaining right-of-way from E. Pear street in Crisfield to Westover, MD inta the Terrapin Run Recreational Trail. About 4.7 miles of the right-of-way from Crisfield to Marion were used to build phase 1 of the trail in 2019-21 and Somerset County started work on the 3.2 mile phase 2b, between the Big Annemessex River and Westover, in 2024 (with completion in 2027. Future phases will connect the two ends of the trail.\nReferences\nExternal links"
    }
  ]
}