{
  "content": [
    {
      "type": "text",
      "text": "# East Kingston, New York\n\n|area_magnitude           =\n|area_total_km2           = 1.80\n|area_land_km2            = 1.75\n|area_water_km2           = 0.06\n|area_total_sq_mi         = 0.70\n|area_land_sq_mi          = 0.67\n|area_water_sq_mi         = 0.02\n|population_as_of         = 2020\n|population_footnotes     =\n|population_total         = 277\n|population_density_km2   = 158.72\n|population_density_sq_mi = 410.98\n|timezone                 = Eastern (EST)\n|utc_offset               = -5\n|timezone_DST             = EDT\n|utc_offset_DST           = -4\n|elevation_footnotes      =\n|elevation_m              = 46\n|elevation_ft             = 151\n|coordinates              =\n|postal_code_type         =\n|postal_code              =\n|area_code                =\n|blank_name               = FIPS code\n|blank_info               = 36-22370\n|blank1_name              = GNIS feature ID\n|blank1_info              = 0949148\n|website                  =\n|footnotes                =\n|pop_est_as_of =\n|pop_est_footnotes =\n|population_est =\n|unit_pref = Imperial\n}}\nEast Kingston is a hamlet (and census-designated place) in Ulster County, New York, United States. The population was 277 at the 2020 census.\nEast Kingston is located in the southeastern corner of the Town of Ulster. The community is immediately north of the City of Kingston.\nHistory\nSt. Colman's Church\nSt. Colman's Church was built in 1874 by Rev. M.C. O'Farrell of Rondout. The church is constructed of stone and brick and in the Gothic style and seats about 250 parishioners. In 1892, an annex was added by Dr. Burtsell of Rondout. In 1904 the mission became a parish of the Archdiocese of New York. Rev. Robert A. Weir was appointed the first resident pastor.\nin 2015 the parish of St. Colman merged with Saint Catherine Laboure Church in Lake Katrine, but continues to offer weekly Mass.\nGeography\nEast Kingston is located at .\nAccording to the United States Census Bureau, the CDP has a total area of , all land.\nThe community is adjacent to the Hudson River.\nDemographics\n}}\nAs of the census of 2000, there were 285 people, 118 households, and 73 families residing in the CDP. The population density was . There were 131 housing units at an average density of . The racial makeup of the CDP was 94.39% White, 5.26% African American, and 0.35% from two or more races. Hispanic or Latino of any race were 3.86% of the population.\nThere were 118 households, out of which 33.9% had children under the age of 18 living with them, 41.5% were married couples living together, 14.4% had a female householder with no husband present, and 38.1% were non-families. 34.7% of all households were made up of individuals, and 17.8% had someone living alone who was 65 years of age or older. The average household size was 2.42 and the average family size was 3.07.\nIn the CDP, the population was spread out, with 27.7% under the age of 18, 8.1% from 18 to 24, 26.7% from 25 to 44, 20.4% from 45 to 64, and 17.2% who were 65 years of age or older. The median age was 39 years. For every 100 females, there were 108.0 males. For every 100 females age 18 and over, there were 104.0 males.\nThe median income for a household in the CDP was $50,179, and the median income for a family was $56,875. Males had a median income of $33,000 versus $26,250 for females. The per capita income for the CDP was $22,657. About 10.0% of families and 15.3% of the population were below the poverty line, including 39.1% of those under the age of eighteen and 9.0% of those 65 or over.\nEducation\nThe school district for the CDP is Kingston City School District. The comprehensive high school of the Kingston City district is Kingston High School.\nReferences"
    }
  ]
}