{
  "content": [
    {
      "type": "text",
      "text": "# East End of London in popular culture__disambig_1\n\n, ''The Coster's Mansion'', 1899 sheet music]]\nThe East End of London in popular culture covers aspects of popular culture within the area of the East End of London. The area is roughly that covered by majority of the modern London Borough of Tower Hamlets, and parts of the south of the London Borough of Hackney.\nThemes\nCrime, poverty, vice, sexual transgression, drugs, class-conflict and multi-cultural encounters and fantasies involving Jewish, Chinese and Indian immigrants are major themes. Though the area has been productive of local writing talent, from the time of Oscar Wilde's The Picture of Dorian Gray (1891) the idea of 'slumming it' in the 'forbidden' East End has held a fascination for a coterie of the literati.\nThe image of the East Ender changed dramatically between the 19th century and the 20th. From the 1870s they were characterised in culture as often shiftless, untrustworthy and responsible for their own poverty. However, many East Enders worked in lowly but respectable occupations such as carters, porters and costermongers. This later group particularly became the subject of music hall songs at the turn of the century, with performers such as Marie Lloyd, Gus Elen and Albert Chevalier establishing the image of the humorous East End Cockney and highlighting the conditions of ordinary workers. This image, buoyed by close family and social links, and the community's fortitude in the Second World War, came to be represented in literature and film. However, with the rise of the Kray Twins, in the 1960s, the dark side of East End character returned, with a new emphasis on criminality and gangsterism.\nLiterature\nThe Isle of Dogs plays a central role in two Jacobean plays, with which Ben Jonson was associated. The Isle of Dogs (1597) was reported to the authorities as a \"lewd plaie\" full of seditious and \"slanderous matter\". The authors and cast were quickly arrested and the play suppressed.\nCharles Dickens (1812–70), throughout his work, draws extensively on his experiences of poverty in London. His godfather had a sail making business in Limehouse, and he based the Six Jolly Fellowship Porters in Our Mutual Friend (1864–65) on a public house still standing there. The Red Bull, a now demolished inn situated in Whitechapel, features in his Pickwick Papers. On leaving it Sam Weller makes the sage remark that Whitechapel is \"not a wery nice neighbourhood\". Fagin in Dickens's Oliver Twist appears to be based on a notorious 'fence' named Ikey Solomon (1785–1850) who operated in 1820s Whitechapel. Dickens was also a frequent visitor to the East End theatres and music halls of Hoxton, Shoreditch and Whitechapel, writing of his visits in his journals and his journalism. A visit he made to an opium den in Bluegate Fields inspired certain scenes in his last, unfinished, novel The Mystery of Edwin Drood (1870).\nThe experiences of the Jewish community in the East End inspired many works of fiction. Israel Zangwill (1864–1926), educated in Spitalfields, wrote the influential Children of the Ghetto: A Study of a Peculiar People (1892) and other novels on this subject. Another Jewish writer, Simon Blumenfeld (1907–2005) wrote plays and novels, such as Jew Boy (1935), informed by his years in Whitechapel. Wolf Mankowitz, of Bethnal Green, was another Jewish writer from the area. His 1953 book A Kid for Two Farthings, set in the East End, was adapted for the cinema three years later. Alexander Baron (1917–1999) was born in Whitechapel and wrote of his wartime experiences in the Invasions of Italy and Normandy in the trilogy From The City From The Plough, ''There's no Home and The Human Kind. Later he wrote of the East End, including the Jewish gangster novel, King Dido and the Human Kind.\nOne contemporary manifestation exploring the 'collision of worlds' made possible by the East End is the school of psychogeography espoused most prominently by Peter Ackroyd (1949– ) in such novels as Hawksmoor (1985) and Dan Leno and the Limehouse Golem (1994) and Iain Sinclair (1943– ) in such novels as White Chappell, Scarlet Tracings (1987). A more realistic fictionalisation on the contemporary gentrification of the area, and the rise of the yuppie, is provided by Penelope Lively in Passing On (1989) and City of the Mind (1991) and by P. D. James in Original Sin (1994). Emblematic of the current worldwide clash of civilisations between West and East, of which the East End has historically been a microcosm, are Monica Ali's (1967– ) novel Brick Lane (2003), and Salman Rushdie's fantastic and controversial The Satanic Verses (1988) which also uses Brick Lane as a location.\nTV\nEastEnders, a BBC soap opera broadcast since 1985, is set in the fictional London Borough of Walford. The programme is actually filmed at a purpose-built set at the BBC Elstree Centre in Hertfordshire, and the paradigms for the show are thought to lie beyond the East End, in Poplar, Stratford and Walthamstow. In that, the programme does represent the diaspora of East Enders who have moved out of the district, and draws on the themes of family and social integration. The show rarely evidences changes occurring to east London, such as the Docklands development.\nMusic\nMany music hall acts originated in the East End, including Marie Lloyd, Gus Elen and Albert Chevalier. From the middle of the 18th century, inhabitants of the area had begun to be characterised as shiftless, untrustworthy and responsible for their own poverty. These performers, in particular, saw the many honest people fighting poverty in lowly professions and established the image of the humorous East End Cockney as a part of their stage persona. There are only two surviving music halls in the area, Wilton's Music Hall and Hoxton Hall, but many of the songs survive in \"pub songs\"; communal singing in public houses with minimal accompaniment.\nSee also\n*Jack the Ripper in fiction\n*Music hall songs\nReferences\nExternal links\n*[https://web.archive.org/web/20061219204040/http://www.eastendfilmsociety.co.uk/ East End Film Society]\n*[http://www.jewisheastend.com/london.html Jewish East End of London]"
    }
  ]
}