{
  "content": [
    {
      "type": "text",
      "text": "# East Indies theatre of the French Revolutionary Wars\n\nEast India Company\n|combatant2  =  France   Spain\n|commander1  =  Peter Rainier\n|commander2  =   Pierre Sercey   Ignacio Álava\n|campaignbox =\n}}\nThe East Indies theatre of the French Revolutionary Wars was a series of campaigns related to the major European conflict known as the French Revolutionary Wars, fought between 1793 and 1801 between the new French Republic and its allies and a shifting alliance of rival powers. Although the Indian Ocean was separated by vast distance from the principal theatre of the conflict in Western Europe, it played a significant role due to the economic importance of the region to Great Britain, France's most constant opponent, of its colonies in India and the Far Eastern trade.\nProtection of British interests in the region fell primarily to the Royal Navy, supported by the military forces of the East India Company. Naval strategy sought to eliminate enemy forces in the region and provide convoy protection to the large East Indiamen merchant ships and smaller company ships which transported goods and wealth between Britain and its Asian colonies and trade partners. The French Navy maintained commerce raiding operations in the region throughout the war; particularly light frigate squadrons and privateers deployed in an effort to disrupt British trade, supported as the conflict developed by the allies the French accrued in the course of the war, particularly the Batavian Republic and Spain.\nAt the declaration of war on Britain by the newly formed French Republic on 1 February 1793, British forces in the Indian Ocean held a considerably stronger military position, which was immediately utilised to seize the French territories in India. The remaining French forces continued operating from their base on the remote island of Île de France, privateers in particular conducting a highly disruptive campaign against British commerce. Attempts by the Royal Navy, commanded by Rear-Admiral Peter Rainier, to limit their effectiveness resulted in a number of inconsequential clashes and a partial blockade of the French islands. In 1795 the declaration of war on Britain by the newly formed Batavian Republic led to successful invasions of the Batavian colonies of Dutch Ceylon, the Dutch Cape Colony and operations against the Dutch East Indies.\nIn 1796 British control of the region was challenged by a large and powerful French frigate squadron sent to the Indian Ocean under Contre-amiral Pierre César Charles de Sercey. Sercey's squadron operated against British trade for two years with little success; attempts to raid the China trade and coordinate with a Spanish Navy squadron at Manila in the Philippines all ending in failure. Growing resentment on Île de France at the cost of maintaining the squadron eventually required most of the ships to return to France. The survivors, forced to operate independently, were subsequently defeated and captured by the Royal Navy in a series of individual engagements in 1799. By 1800 British control of the Indian Ocean was again assured, Rainier deploying his ships in trade protection duties and in the Red Sea to support the invasion of Egypt in 1801. At the end of the war in 1802 the Peace of Amiens reverted the situation in the region to its pre-war state, Britain returning all seized colonies except for Ceylon.\nBackground\nOn 1 February 1793, amid mounting tensions following the French Revolution of 1789, the recently formed French Republic, already at war with the Austrian Empire and Prussia, declared war on Great Britain and the Dutch Republic. This act spread the French Revolutionary Wars beyond Europe to encompass the British, French and Dutch colonies in the Americas and the East Indies. Britain and France were already rivals in the East Indies, having fought campaigns in the Indian Ocean during both the Seven Years' War (1756–1763) and the American War of Independence (1775–1783). More recently British and French naval forces had fought the Battle of Tellicherry in 1791 as part of the Third Anglo-Mysore War, a conflict between the East India Company (EIC), which controlled British mercantile interests in the East Indies, and the French-supported Kingdom of Mysore in Southern India. The battle was a French defeat, but it had little impact on either the war itself, which saw the EIC extract significant concessions from Tipu Sultan, the ruler of Mysore, or the worsening political climate in Europe.\nBritain, through the EIC, controlled large stretches of the Indian coast, including the three significant ports of Calcutta, Bombay and Madras, when the war began.  On the northern coast of the Bay of Bengal, Calcutta was a highly lucrative port but remote and lacking in naval facilities; Madras on the Coromandel Coast was an open harbour with little in the way of defences; while Bombay, on the western coast, was the point of communication with Europe and the strongest naval base in the region. To the east, British merchants operated from the small harbours of Penang and Bencoolen, which linked directly to the great mercantile centre at Canton in Qing Dynasty China. This linkage was the principal cause of British interest in the East Indies: the connection to and dominance of a lucrative network of intercontinental trade and exploration.\nFrance controlled a number of trading harbours along the Indian coast including Mahé and Chandernagore, all governed from the larger port of Pondicherry. However, the strongest French position in the region was the isolated island of Île de France, later known as Mauritius, with its subordinate bases of Réunion and small settlements on Madagascar in the Seychelles and on Rodrigues. Île de France, centred on the capital Port Louis, had important commercial agricultural features and an economy dominated by African slave labour. The islands were only commercially viable when left ungarrisoned, and if any troops had to be supported or the islands came under blockade there were corresponding economic difficulties and food shortages. The island was most valuable as a naval base, situated in an ideal position for raiders to intercept British trade between Europe and the East Indies. The upheavals of the French Revolution had reached Île de France, with accusations against senior officials leading to arrests in 1792. The arrival of news that the French Convention had abolished slavery in August 1794 almost plunged the island into civil war, and only the intervention of Governor Malartic prevented conflict.\nThe Dutch Empire held the Dutch Cape Colony, Dutch Ceylon and the Dutch East Indies. The latter, now Indonesia, was governed by the Dutch East India Company from the highly lucrative port of Batavia. Batavia was the centre of East Asian trade, reaching as far as Nagasaki in Edo period Japan, supported by other towns and ports including Surabaya and Griessie. The Cape Colony at the Southern tip of Africa was far less significant, acting principally as a resupply harbour with little commercial activity or penetration into the surrounding countryside. The commercially significant harbours of Trincomalee and Colombo on the island of Ceylon were of strategic importance, but weakly garrisoned against attack. These colonies were defended by a Dutch naval squadron, sent to the region in 1782 in the aftermath of the American War of Independence.\nThe Spanish Philippines, somewhat distant to the other European colonies in the region, was a commercial backwater which survived through large subsidies from New Spain. The only significant towns were Manila and Cavite, the latter hosting a powerful Spanish naval squadron. A Portuguese mercantile presence existed in the Indian port of Goa, which was a source of concern to the British as it represented a weak point in the defenses of British India. Portugal also controlled the Chinese port of Macau and a number of trading posts on the East African coast in Portuguese Mozambique. Other European nations, including Denmark and Sweden traded in the East Indies, as increasingly did American merchant ships.\nThe East Indies were very important to the British war effort due to their pivotal position in maintaining British revenue through trade. The EIC controlled the shipment of large quantities of valuable commodities from India, China and other Asian markets to Europe with their fleet of large and well-armed merchant ships, known as East Indiamen, supplemented by smaller local trading vessels known as \"country ships\". The EIC maintained a standing army in India and their own small fleet, designed for the protection of commerce. The EIC navy was supplemented by Royal Navy forces, which had been depleted of forces shortly before the outbreak of war; Rear-Admiral William Cornwallis had only the ship of the line  at Madras, and the frigate  at Calcutta. French forces in the region also comprised two frigates, Cybèle and Prudente under Commodore Saint-Félix, supported by a squadron of smaller vessels and a large but disorganised force of privateers, with orders to operate against British commerce.\nCampaigns\nNews of the French declaration of war arrived by ship in Calcutta, having traveled from George Baldwin, British ambassador in Alexandria, on 1 June 1793. Cornwallis immediately sailed to Pondicherry, instituting a blockade and seizing an ammunition supply ship entering the port. Plans to eliminate the French presence in India had already been drawn up. The British and EIC forces, commanded on land by Colonel John Braithwaite, moved rapidly, seizing Chandernagore, Karaikal, Yanam and Mahé without resistance. Pondicherry proved stronger, and Braithwaite was forced to besiege the city for 22 days until the French commander, Colonel Prosper de Clermont, agreed to surrender. Cornwallis's blockade was augmented by several large East Indiamen, proving sufficient as a deterrent to drive off the French frigate Cybèle and accompanying storeships which sought to resupply the garrison on 14 August.\nby Jean-Baptiste Henri Durand-Brager]]\nWith the French firmly driven from India, Cornwallis returned to European waters with Minerva. Protection of EIC shipping from French forces was left to a small number of light EIC warships.  The trade route through the Sunda Strait proved particularly vulnerable; on 27 September 1793 a squadron of large privateers captured the East Indiaman . In January 1794 a well armed squadron of East Indiamen under Commodore Charles Mitchell were sent to patrol the Sunda Strait by the EIC. During the ensuing Sunda Strait campaign, privateers attacked the East Indiaman Pigot on 17 January before Mitchell defeated the largest privateers, Vengeur and Résolu, on 22 January and fought an inconclusive engagement with Prudente and Cybèle under Captain Jean-Marie Renaud on 24 January. Renaud subsequently captured the Pigot, while she was under repairs at Fort Marlborough. In late February both French and EIC squadrons returned to the Indian Ocean. The Dutch frigate Amazone subsequently captured two French corvettes at Surabaya.\nIn the early spring of 1794, during a major campaign in the Atlantic, a British force led by Captain Peter Rainier in the 74-gun ship of the line , also including , ,  and , was sent to the Indian Ocean. This force diverged en route, with Orpheus, Resistance and Centurion cruising off Isle de France in May. On 5 May this force encountered the captured Princess Royal, now armed as a warship and renamed Duguay-Trouin, and the brig Vulcain. Duguay-Trouin sailed poorly and was intercepted and captured by Orpheus after a short battle. The blockade of Isle de France was maintained during the year and on 22 October Renaud attempted to eliminate it, attacking Centurion and Diomede off Île Ronde on 22 October. The ensuing battle was inconclusive, though ultimately the British squadron was forced to withdraw to India.\nBatavian campaigns\n]]\nRainier decided not to renew the blockade of Isle de France in 1794, concerned by false rumours that a French battle squadron was sailing to the East Indies. In July 1795 news arrived in India which significantly changed the strategic situation: during the winter of 1794–1795 the French Army had overrun the Dutch Republic, reforming the country into an allied client state named the Batavian Republic. Control of the Dutch colonies, whose loyalty was uncertain, became  Rainier's main priority due principally to their strategic positions along intercontinental trade routes, and he immediately organised operations to seize them. The largest force, with Rainier in personal command, descended on Trincomalee, while a smaller force under Captain Edward Pakenham in Resistance sailed for Malacca.\nRainier hoped that the Dutch commanders would peacefully transfer control of their colonies to the British after provision of the Kew Letters from Stadtholder William of Orange. However at Trincomalee the governor resisted and an invasion of Ceylon went ahead. After a short bombardment, Trincomalee capitulated on 26 August, although Diomede was wrecked during the landing operation. With the principal fort taken, the remaining Batavian towns on Ceylon surrendered peaceably over the following month, as did the Batavian trading port of Cochin in India. Pakenham's force was able to seize Malacca without resistance on 17 August 1795.\nBatavian control of the Dutch Cape Colony was a serious risk to British shipping rounding the Cape of Good Hope, and a substantial force under Sir George Keith Elphinstone was sent from Britain to eliminate it. Arriving in early August, Elphinstone initially attempted to intimidate the governor into surrender, but eventually authorised a landing at Simon's Town. On 7 August the expeditionary force fought a skirmish at Muizenberg and clashes continued throughout August. A major Dutch attack on 3 September was forestalled by the arrival of a large fleet of Indiamen carrying British reinforcements, and as these troops came ashore the outnumbered Dutch surrendered. A much-delayed Batavian expeditionary force, sent to retake control of the Cape, arrived in August 1796, but was out-manoeuvered and forced to surrender by Elphinstone at the Capitulation of Saldanha Bay.\nBritish consolidation\nElphinstone's arrival at the Cape officially placed him in overall command of the East Indies squadron, but the great distances involved meant that immediate operational control remained with Rainier. In July 1795 Prudente and Cybèle sailed from Isle de France and attacked shipping in the Sunda Strait, seizing a number of merchant ships. When reports of this attack reached Rainier he took most of his squadron eastwards to the Dutch East Indies, leaving only Gardner's squadron to watch Colombo.  Elphinstone assumed command of the Western Indian Ocean, sending  and  to restore the blockade of Isle de France and taking ,  and sloops  and  to Madras, where he arrived on 15 January 1796. In France, an operation to reinforce the Indian Ocean with a squadron of razee frigates or ships of the line under Contre-amiral Kerguelen had been planned in 1794 but repeatedly delayed due to lack of suitable ships and commitments elsewhere. In the summer of 1795 these plans were abandoned completely following losses at the Battle of Groix and French intervention in the East Indies was not attempted until the spring of 1796.\nThe renewed blockade of Isle de France was lifted in December 1795, and Elphinstone deployed most of his forces in the continued blockade of Colombo. In February a small squadron under Captain Alan Gardner attacked city and secured the total surrender of the remaining Batavian garrison on the island. In March word arrived at Madras of the Batavian attempt to recapture the Cape Colony and Elphinstone returned westwards with Monarch, followed by Stately, Echo and Rattlesnake. In the east, Rainier's force had some success, seizing the considerable clove stores at Amboyna on 16 February 1796 and the nutmeg and mace supplies of Banda Neira on 8 March. The value of these captures was significant: the captains involved each received £15,000. However, these successes were offset by the complicated political position Rainier discovered in the Dutch East Indies; he spent the entirety of the remainder of the year diffusing or defeating a series of uprisings by local rajahs and did not return to India until February 1797.\nAlarmed at the distance Elphinstone had been forced to travel to defend the Cape, the Admiralty separated command of the Cape and the East Indies in Spring 1796. In October 1796, Elphinstone was recalled to Britain, sending a squadron comprising , , ,  and  to again renew the blockade of Isle de France and  and  sent to augment Rainier's squadron, which had been damaged by a storm in the Bay of Bengal. On 2 December a detachment from the blockade squadron, led by Captain John William Spranger in  with Braave and Sphynx attacked and destroyed the French port at Foul Point on Madagascar, seizing five French merchant ships.\nSercey's squadron\n]]\nUntil 1796 there had been no reaction from the French Convention to the operations in the East Indies, and they were eventually inspired to reinforce the region not by British actions but by French ones. In 1795 orders had arrived at Isle de France formally abolishing slavery. The Colonial Assembly on the island, whose wealth relied on slave labour, simply ignored the order. The matter was taken up by the Committee of Public Safety, who ordered two agents, René-Gaston Baco de la Chapelle and Étienne-Laurent-Pierre Burnel, to enforce the ruling. These agents were escorted by a squadron of frigates sailing from Rochefort on 4 March under the command of Counter-admiral Pierre César Charles de Sercey, comprising Régénérée, Cocarde, Forte and  with the corvettes  and . On board were 800 soldiers and two companies of artillery under General .\nSercey's voyage started badly, losing Cocarde to an accident on the French coast and Bonne Citoyenne and Mutine to British frigate patrols in the Bay of Biscay. Once out of European waters, however, his passage was unchallenged, watering at La Palma, where Vertu joined the squadron, and capturing the whaler Lord Hawkesbury in the South Atlantic. Baco and Burnel proved a bigger problem: at one stage the squabbling pair attempted to kill one another and had to be pulled apart by Sercey. The squadron took a Portuguese Indiaman off Cape Agulhas on 24 May and the following day encountered and unsuccessfully pursued HMS Sphynx. On 3 June Sercey seized a British Indiaman and his squadron arrived at Isle de France unopposed on 18 June, the blockade squadron having departed the coast a few days earlier. The Colonial Assembly had been forewarned of the arrival of the government agents, possibly by Sercey, and they were met with armed troops. The agents demanded Magallon attack the colonial troops, but he refused to do so, and Baco and Burnel were forced onto the corvette Moineau. Moineau was instructed to take the agents to Manila, but once at sea they overruled the captain and ordered him to take them back to France.\nSercey refitted his squadron at Isle de France, dividing it into two forces. The largest, comprising Forte, Prudente, Seine, Régénérée, Vertu and Cybèle was to sail eastwards under his command. The second, comprising the recently arrived Preneuse and the corvette Brûle-Gueule was ordered westwards to operate in the Mozambique Channel. Sercey sailed on 14 July 1796, reaching Ceylon by 14 August. He was unaware at this stage that the ports of eastern India were undefended, Rainier's prolonged stay in the East Indies leaving no warships to protect Madras and Calcutta, and Sercey consequently sent the privateer Alerte to scout the Bay of Bengal. Alerte was subsequently captured by the British frigate , and documents detailing Sercey's strength found aboard. This information was used to surreptitiously supply Sercey with false information that a British battle squadron was at anchor in Madras. Dissuaded from further operations in the region, Sercey raided Tranquebar and then sailed for the East Indies.\nAfter attacking Banda Aceh, Sercey sought to raid the British trading post of George Town at Penang, but on 9 September his squadron was intercepted off northwest Sumatra by two British ships of the line,  and , which had been hastily detached from commerce protection duties at Penang. The forces fought an inconclusive action after which both retired with damage, the British to Madras and Sercey to Batavia, where he remained until January 1797. On emerging from Batavia, Sercey cruised in the Java Sea in search of the annual EIC convoy from Macau. Rainier had escorted half of the convoy safely through the Straits of Malacca during his return to India, but the other half sailed unescorted through the Bali Strait, where Sercey ambushed it on 28 January. Captain Charles Lennox saved his convoy by disguising his ships as a Royal Navy squadron and making aggressive moves towards Sercey's ships, intimidating the French admiral into withdrawing without combat. Sercey subsequently returned to Isle de France, where he learned of his error.\nFrench dispersal\nSercey's campaign had ended in failure, with little disruption to British trade or naval operations in the East Indies. The East India Company had however taken more serious losses from the depredations of privateers. Most active was Robert Surcouf, whose small ship Emilie captured the timber ship Penguin off Pegu in October 1795 and country ships Russell, Sambolasse and Diana off the mouth of the Hooghly River in January 1796. More seriously, he also captured the pilot boat Cartier, which he used to seize the large East Indiaman Triton.\nNo French reinforcements reached the East Indies in 1797. A complex strategy had been developed to land an army in Ireland and then use the invasion fleet to attack India as a secondary objective. This ambitious plan collapsed completely during the failed ''Expédition d'Irlande in December 1796 in which thousands of French troops were drowned. The strategic situation in Europe had however shifted once more during 1796 when France and Spain signed the Treaty of San Ildefonso, transferring Spain from an ally of Britain to an ally of France. British attention in the East Indies therefore shifted from the French island territories to the Spanish Philippines, where the defence squadron had been badly damaged in a hurricane in April 1797 and was in dock for extensive repairs. British forces were once again in the ascendant, Rainier commanding five ships of the line, one fourth rate ship and six frigates. Extensive plans were developed by Rainier in conjunction with Sir John Shore, Governor-General of India, and Colonel Arthur Wellesley for a major attack on Manila, to be led by Sir James Craig. The Treaty of Campo Formio and the consequent end of the War of the First Coalition in Europe caused the cancellation of these plans; Britain now fought France and its allies alone and fears were raised that the Tipu Sultan of Mysore might once again attack British colonies in India.  To ensure the safety of the 1798 China Fleet from Spanish attack, in July 1797 Rainier deployed Centurion,  and  to escort a convoy of East Indiamen to Macau. After seeing his charges into harbour in December, Captain Edward Cooke investigated Manila himself in Sybille, accompanied by Fox. There he discovered the weak state of the Spanish squadron.\nOther British ships were operating in the East Indies: in July 1797, Resistance and a force of EIC troops captured Kupang on Timor but were subsequently driven off by an armed uprising by the Malay citizens of the town. In the street fighting 13 British troops and 300 Malays were killed. Resistance'' was subsequently lost on 24 July 1798, accidentally destroyed with more than 300 of its crew in an unexplained ammunition explosion in the Banca Strait. There were originally twelve survivors, but eight died of their injuries and the remaining sailors were captured by Sumatran pirates and sold into slavery. Mahmud Shah III, Sultan of Johor later released them, although only one, named Thomas Scott, was confirmed to have survived.\nMaintaining of the blockade of Isle de France was the responsibility of the substantial British squadron at the Cape Colony, which had suffered severely from unrest inspired by the Spithead and Nore mutinies in Britain. The crews of  and  rose up and deposed their officers, but found the guns of Cape Town trained on their ships, Governor Lord Macartney threatening them with destruction. Intimidated the seamen surrendered, the incident followed by floggings and executions. Despite this paralysis, Sercey's squadron was in no position to contest control of the Indian Ocean: supplies and manpower were severely limited and the Colonial Committee, still resentful following the incident with the agents in 1796, was reluctant to offer support. Sercey's only operations were limited cruises in the Seychelles and the supply of 300 reinforcements to Batavia during the summer of 1797, while Cybèle was sent back to France in the spring of 1797 and Vertu, Régénerée and Seine followed in early 1798. Vertu and Régénerée passed undetected into the Atlantic until they halted at the Îles de Los on 24 April. There they were discovered by the 32-gun frigate  under Captain Samuel James Ballard. Sailing to investigate Ballard came under fire from the French ships and was forced to pass between them, firing broadsides in each direction as he did so. Chased by Régénerée, Pearl withdrew to Sierra Leone with damaged rigging and one man killed. Seine was also intercepted, by a squadron of frigates from the Brest blockade near the Penmarks. Fleeing south, the ship battled its pursuers in the action of 30 June 1798, which ended with Seine and the British frigates  and  all ashore near La Rochelle. Jason and the captured Seine were refloated, but Pique was destroyed.\nRed Sea and Mysore\nIn July 1798 Napoleon Bonaparte led a French expeditionary force across the Mediterranean to invade Egypt, then part of the Ottoman Empire. Initial landings were successful and the Battle of the Pyramids confirmed Bonaparte's control of the country. On 1 August however his fleet was destroyed by a British force under Sir Horatio Nelson at the Battle of the Nile on 1 August, isolating the French army in Egypt. The Admiralty initiated a major response, including dispatching a squadron under Commodore John Blankett to blockade the Egyptian Red Sea coast: there was concern in London that Bonaparte might proceed to attack India from Egypt, in conjunction with the Tipu Sultan and the armies of Mysore. Blankett's force arrived in December 1798, joined by a squadron sent by Rainier. Bonaparte had visited Suez early in the month, and plans had been drawn up for a small French Red Sea squadron, but Blankett's force and the regional supremacy it brought rendered these plans obsolete. Attacks were made on commercial shipping at Suez in April, and the entrance to the Red Sea was effectively blockaded by British occupation of Perim and Mocha, and in July 1799 Blankett ordered the frigates  and Fox to destroy the French-held castle at Qusayr. The town was heavily bombarded, although attempts to make amphibious landings were driven off.\nBritish attention elsewhere in the theatre was focused on Southern India. In January 1798, a French privateer brought envoys from Mysore to Isle de France with a request for support. Malartic supplied 86 volunteers, which were sent to India on Preneuse under Captain Jean-Marthe-Adrien l'Hermite. L'Hermite's mission was meant to be covert, but in April 1798 he attacked and captured two East Indiamen,  and , at Tellicherry, and landed the volunteers at Mangalore on 24 April. This action caused a crisis in relations between the EIC and Mysore, which Tipu Sultan's obvious enthusiasm for French intervention in India inflamed. The Fourth Anglo-Mysore War began in February 1799 when two British armies crossed into Mysorean territory. Forced back to his capital Seringapatam, the Tipu Sultan held out against a siege for several weeks until the city was taken by storm, with Tipu Sultan being killed during the ensuing street-fighting.\nBritish dominance\n, 1816)]]\nDuring the summer of 1798, Forte and Prudente conducted a commerce raiding operation under Captain Ravanel in the Bay of Bengal and the Bali Strait which achieved moderate success but also saw the first of a number of mutinies among Sercey's crews. The French admiral then planned a joint operation with the Spanish squadron at Manila, sailing to Batavia in Brûle-Gueule, to be joined by Preneuse. He had ordered Ravanel to join his force there, but the French captain instead returned to Port Louis where Prudente was seized by the Malartic and sold as a privateer and Forte sent on a commerce raid in the Bay of Bengal in defiance of Sercey's orders. Prudente was captured by Daedalus at the Action of 9 February 1799 off the coast of Natal, while Forte was captured by Sybille off the mouth of the Hooghly River at the  Action of 28 February 1799.\nSercey's fury at the seizure of his strongest frigates was compounded by the condition of Preneuse, which arrived at Batavia in a state of mutiny. L'Hermite had executed five crewmembers on the journey and Sercey immediately sent the ship out again on a cruise off Borneo in an effort to contain the disaffection. With his forces unexpectedly reduced, Sercey then sent his remaining ships to Manila for operations with the Spanish, but the condition of the Spanish ships was so poor that no operations could be undertaken in 1798. An attack on the China Fleet was eventually attempted in January 1799, but on arrival at Macau the combined Spanish squadron refused to engage the powerful British escort and the entire force withdrew, pursued by Captain William Hargood in .\nDisappointed by the failure off Macau and weakened by losses to his squadron, Sercey withdrew to Isle de France in the spring of 1799. There he sent Preneuse on a raiding cruise in the Mozambique Channel. On 20 September, l'Hermite fought a brief and inconclusive night engagement with a small squadron of Royal Navy ships in Algoa Bay, which led three weeks later to an inconclusive clash on 9 October with the 50-gun . Returning to Isle de France with little to show for his three-month cruise, l'Hermite was intercepted off Port Louis by the blockade squadron of Adamant and  at the Battle of Port Louis, during which Preneuse was driven onshore and destroyed. Sercey had already sent Brûle-Gueule back to France at the end of September with political prisoners from Isle de France and more than a million in specie, the corvette eventually being wrecked with the loss of 132 lives on the Pointe du Raz on the Breton coast. Sercey, an admiral without a command, returned to France and retired from the Navy. He subsequently settled on Isle de France.\nPainting of Confiance capturing Kent by Ambroise Louis Garneray\nAs the French naval presence in the Indian Ocean declined, the commerce raiding role was taken up by privateers. These fast vessels operated with considerable success against British merchant shipping, and protecting convoys from their depredations consumed a considerable proportion of Rainier's naval strength: gradually however they were intercepted and captured, including Adele in May 1800 and ''L'Uni in August 1800. Among the more notorious privateers was Iphigenie, which seized a packet ship, Pearl, in the Persian Gulf in October 1799. Pursued by the sloop , the two fought a fierce engagement on 12 October at which both ships were destroyed and more than 200 men killed.\nThe most successful French privateer of the period was Robert Surcouf, who sailed in Clarissa and then Confiance. In the latter he fought a significant battle off the Hooghly River on 9 October 1800 with the East Indiaman Kent. Eventually subdued by a boarding action, Kent'' lost 14 killed, including Captain Robert Rivington, and 44 wounded; Surcouf's men suffered 14 casualties. The privateer conflict continued to the end of the war, the large privateers Grand Hirondelle and Gloire remaining at sea into 1801 before being captured, and Courier and Surcouf's Confiance evading interception entirely.\nFinal actions\nRainier's main priorities remained the protection of trade, but his command came under increasing interference from London, in particular the Secretary of State for War Henry Dundas. Dundas was insistent throughout 1799 and 1800 that the priority for Rainier should be the invasion and capture of Java, thus eliminating the Dutch East Indies entirely. Contradictory orders came from Lord Mornington, who was instructing Rainier to plan an invasion of Isle de France, while Rainier himself wished to resurrect the abandoned operation against Manila. So confused was the command structure that in September 1800 Rainier threatened to resign, but in October 1800 a renewed threat from Egypt redirected the focus of his squadron to the Red Sea and only a handful of minor operations against Dutch posts on Java were carried out by a small force under Captain Henry Lidgbird Ball, capturing a few merchant ships but losing more than 200 men to disease in the process. At the Cape of Good Hope, a gale on 5 December 1799 caused severe damage to shipping in Table Bay: among the wrecks were HMS Sceptre with 290 crew, the Danish ship of the line Oldenburg and several large American merchant ships.\nThe Red Sea campaign of 1801 was intended to complement the British invasion of French-held Egypt from the Mediterranean, which went ahead in March 1801.  Initial operations were trusted to Blankett at Jeddah, who was in poor health and struggling to negotiate with Ghalib Efendi bin Musa'ed, Sharif of Mecca. These problems were compounded when Forte was wrecked entering the port. Blankett's forces landed unopposed at Suez on 22 March, the French having withdrawn their forces in Southern Egypt to oppose the Mediterranean landings. His mission complete, Blankett withdrew in June after sending 300 soldiers to join the conflict in Northern Egypt, and met with a large reinforcement squadron under Captain Sir Home Popham off Qusayr. An army under General David Baird then took passage up the Nile, but did not arrive before the campaign ended with the Capitulation of Alexandria in August.\nby Whitcombe]]\nThe French Navy played little part in opposing the British campaign in Egypt, but a frigate was sent to the Indian Ocean to interfere with the supply lines to the Red Sea. This ship, Chiffonne was based at Mahé in the Seychelles. The voyage had been eventful, Chiffonne seizing a Brazilian frigate Andhorina in the Atlantic and the East Indiaman Bellona, as well as conveying 32 political prisoners sentenced to exile in the Indian Ocean. At the Battle of Mahé on 19 August however, Chiffonne was discovered at anchor by Sybille and captured. The final operations in the Indian Ocean saw British forces consolidate further, landing troops at the Portuguese colonies in the region to prevent the enforcement of the terms of the Treaty of Badajoz, under which Portugal agreed to exclude British shipping from its ports, while the EIC attacked and captured the Dutch island of Ternate.\nAftermath\nThe Peace of Amiens came into effect on 1 October 1801, bringing the French Revolutionary Wars to an end. Confirmation of this armistice did not reach India until 1 February 1802, but it had been widely expected and neither side had undertaken significant naval operations during the interim. The terms of the treaty returned all territory captured by British forces in the East Indies to its original masters with the noted exception of Ceylon, which was officially named a British Crown Colony. No one in the Indian Ocean believed that the Peace would last, each side building substantial forces in the region. As historian William James noted, \"who then could doubt that, although the wax on the seals of the treaty concluding the last had scarcely cooled, a new war was on the eve of bursting forth?\".  The peace was short lived, the Napoleonic Wars erupting in May 1803, by which time Emperor Napoleon had sent substantial reinforcements to Île de France and the other French territories in the East Indies. Although the campaign had personally benefited Rainier by around £300,000 (the equivalent of £|0}} as of 2015), historian C. Northcote Parkinson wrote that \"It cannot be said that the naval war in the Indian Ocean from 1794 to 1801 had been a brilliant success\" for either side. The lack of French reinforcements  and Sercey's ineffectiveness counterbalanced by confused British leadership and scattered priorities, with aborted operations against Manila and Batavia and a marginal campaign in the Red Sea consuming inordinate amounts of time and energy.\nNotes\nCitations\nReferences\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*"
    }
  ]
}