{
  "content": [
    {
      "type": "text",
      "text": "# Ebbw Vale, Queensland\n\n| local_map           = yes\n| zoom                = 12\n| pop                 = 540\n| pop_year            =\n| pop_footnotes       =\n| established         =\n| postcode            = 4304\n| area                = 1.3\n| timezone            = AEST\n| utc                 = +10:00\n| dist1               = 6.6\n| dir1                = ENE\n| location1           = Ipswich CBD\n| dist2               = 33\n| dir2                = SW\n| location2           = Brisbane CBD\n| lga                 = City of Ipswich\n| stategov            = Bundamba\n| fedgov              = Blair\n| near-n              = Bundamba\n| near-ne             = Dinmore\n| near-e              = New Chum\n| near-se             = New Chum\n| near-s              = New Chum\n| near-sw             = Bundamba\n| near-w              = Bundamba\n| near-nw             = Bundamba\n}}\nEbbw Vale () is a suburb of Ipswich in the City of Ipswich, Queensland, Australia. Ebbw Vale is a Welsh name, so the ‘w’ is pronounced with an ‘oo’ sound. In the , Ebbw Vale had a population of 540 people.\nGeography\nThe suburb is bounded to the north by the Main Line railway and to south-east by the Cunningham Highway.\nHistory\nEbbw Vale is named after a coal mine which formerly operated in the area. The coal mine was named after the Welsh town of Ebbw Vale ().\nIn December 1910, the St Helens railway station was renamed Ebbwvale after the coal mine.\nIn 1927, Stafford Brothers of Bundamba were selling 38 suburban blocks in the Whitwood Estate, bounded by Brisbane Road to the north-west, Cairns Road to the south and on both sides of the Robert Street.\nDemographics\nIn the , Ebbw Vale had a population of 526 people.\nIn the , Ebbw Vale had a population of 508 people.\nIn the , Ebbw Vale had a population of 540 people.\nHeritage listings\nsoccer field, 2015]]\nEbbw Vale has a number of heritage-listed sites, including:\n* Brisbane Road: Ebbw Vale Memorial Park\nTransport\nEbbw Vale railway station provides access to regular Queensland Rail City network services to Brisbane, Ipswich and Rosewood via Ipswich.\nEducation\nThere are no schools in Ebbw Vale. The nearest primary schools are in neighbouring Bundamba and with another in nearby Riverview. The nearest secondary school is Bundamba State Secondary College in Bundamba.\nDinosaurs\nActive in the area from the 1800s to the late twentieth century were numerous underground mines, which extracted coal from the Late Triassic (Norian) aged Blackstone Formation of the Brassall Group of the Ipswich Coal Measures. A slab with six dinosaur footprints was recovered at the Rylance No. 5 Opencut colliery, originating from deposits between the Rob Roy coal seam and Striped Bacon coal seam. The original slab (~0.165 metres square) represents the highest concentration of dinosaur tracks known within the southern Queensland region (i.e., extrapolated to approximately 36 tracks per metre square) with two of the footprints are also represented on a counterslab. These footprints measure approximately 7 cm long equating to track-makers approximately 30 cm at the hips. These footprints were made by four individuals. The shape of the tracks is characteristic of the theropod ichnogenus Grallator. The Ebbw Vale site representing earliest evidence of small-bodied dinosaurs in Australia, however, the physical specimen does not appear to have been placed into a public collection and its current location is unknown.\nReferences\nExternal links\n*"
    }
  ]
}