{
  "content": [
    {
      "type": "text",
      "text": "# Ecclesiastical trial of Stewart Ruch\n\nThe ecclesiastical trial of Bishop Stewart Ruch by the Anglican Church in North America (ACNA) began in July 2025 and lasted through October. Following allegations of the ACNA's Diocese of the Upper Midwest mishandling child abuse reports, Ruch was formally presented in 2022 on charges of \"habitual neglect of the duties of the bishop's office\" and of \"conduct giving just cause for scandal or offense\", both in violation of the canons of the ACNA, an Anglican province affiliated with the Global Fellowship of Confessing Anglicans and the Global South Fellowship of Anglican Churches.\nFollowing a series of extensive pretrial motions and the completion of a trial of Bishop Todd Atkinson, the ACNA's seven-member Court for the Trial of a Bishop began hearing the province's case against Ruch in July 2025. Less than a week into the trial, the provincial prosecutor resigned, alleging that the trial had been tainted by a member of the court. Amid further charges of improper actions on the part of court members and provincial employees, the appointment and subsequent resignation of a second prosecutor, and the appointment of a third prosecutor, the trial resumed in October 2025 to allow the new prosecutor to prepare to take up the case. The trial hearings concluded on October 13 and a verdict by the court is expected by December 2025.\nBefore the trial began and while it was ongoing, the ACNA began revising its canons on safeguarding and clergy discipline. In 2024, the ACNA established minimum standards for dioceses with regard to safeguarding and clarified the responsibilities of bishops, and in 2025, it proposed revisions to its disciplinary canons to replace an adversarial system with an inquiry-based model and expand the province's capacity to receive reports of misconduct and discipline bishops.\nBackground\nAllegations of abuse mishandling\nIn May 2019, a nine-year-old girl in Illinois reported to her mother that Mark Rivera, a volunteer lay leader at Christ Our Light Anglican Church in Big Rock and neighbor to the girl, had sexually abused her. According to the victim's mother, she immediately reported the abuse to the priest in charge of the congregation, which was part of the Diocese of the Upper Midwest. The victim's mother then met with Rivera, the priest and another lay volunteer, who said, according to reporting by New York magazine, that the diocese's lawyer \"had advised him and [the priest] that they did not need to report my daughter’s abuse to the authorities.\"\n, the cathedral parish of the Anglican Diocese of the Upper Midwest in Wheaton, Illinois, was previously led by Stewart Ruch as rector and where Ruch keeps an office.]]\nTwo days after this meeting, the victim's mother reported Rivera to police, who arrested him. In June 2019, the victim's mother notified leadership at Church of the Resurrection, the diocesan cathedral formerly led by Stewart Ruch as rector, of seven additional potential victims. (Rivera had been a lay leader and volunteer, including working with youth, at Resurrection from the 1990s to 2013, when Resurrection planted Christ Our Light in Big Rock.)\nRivera was released on bond in November 2019 and welcomed back into the Anglican community in Big Rock. Two other people, including Rivera's neighbor Joanna Rudenborg, came forward with criminal allegations against Rivera in November 2020. An email from Rudenborg sharing her allegation was forwarded to Ruch, who urged Rudenborg to contact authorities. In May 2021, after further pressure from Rudenborg and a group of abuse survivors and survivor advocates, the diocese contracted with an outside firm for a third-party investigation into its handling of the reports of Rivera's abuse. In a letter to the diocese announcing the investigation, Ruch admitted that he \"made regrettable errors in this process,\" including the delay in notifying the diocese of Rivera's arrest. \"I mistakenly assumed] that the necessary criminal investigation was a sufficient next step\" in investigating Rivera's actions, he wrote. \"I anticipated that after this process we would inform the diocese of the court's ruling. I naively expected the trial to occur much sooner than it has.\"\nRivera's trial did not begin until October 2021. According to New York, Ruch personally attended Rivera's first court hearing and the diocese provided his family with financial support. In December 2022, Rivera was found guilty of felony child sexual abuse and assault. He was sentenced to 15 years in prison on this conviction. The following month, he pleaded guilty to felony criminal sexual assault in Rudenborg's case and was sentenced to an additional six years.\nProvincial investigation\nFollowing a series of Twitter posts by Rudenborg in June 2021 alleging mishandling of the abuse reports and Rivera's arrest, Ruch announced that he would take a leave of absence. ACNA Archbishop Foley Beach appointed a provincial-level team to take over the investigation into Ruch's and the diocese's handling of the matters. Rudenborg and other victims and advocates formed ACNAtoo, a MeToo movement-inspired campaign to highlight abuse allegations within the Diocese of the Upper Midwest and the broader ACNA. The provincial investigative team contracted with law firm Husch Blackwell to conduct an investigation into the diocese's handling of the situation.\nThe Husch Blackwell report was released Following claims that some material was improperly left unredacted, the report was removed from the website. By the end of October 2022, neither Husch Blackwell nor the ACNA had re-released the report, so ACNAtoo released the report on its website with further redactions.}} in September 2022. The report found that the priest of Christ Our Light Anglican Church did not report Rivera's abuse of the minor to the Illinois Department of Children and Family Services, claiming that a diocesan attorney had told him he was exempt from mandated reporter laws. According to Religion News Service (RNS), the report found that Ruch \"did not attempt to learn more about additional abuse allegations against Rivera made known to them in 2019\" and \"did not consider \"reaching out to parents of at-risk teens who might have been vulnerable to abuse by Rivera.\" Meanwhile, according to the report, Ruch was aware that a lay volunteer—the one who had participated in the May 2019 meeting with Rivera and the minor victim's mother—had been fired from a teaching job over a \"boundary crossing\" issue with a female student and had taken no action to limit his involvement in church leadership roles or investigate. Ruch admitted to investigators that the Diocese of the Upper Midwest \"lacked protocols for responding to sexual misconduct allegations.\" Ruch ended his leave of absence in October 2022. Based on the report, the provincial investigative team recommended that Ruch be presented for trial for violations of canons governing the actions of bishops.\nPresentments and pre-trial activity\nThree ACNA diocesan bishops submitted a formal presentment, based on the Husch Blackwell report, to Beach in December 2022. The bishops alleged that by failing to notify other parents of the abuse allegations, Ruch did not show concern for the possibility that Rivera may have victimized others, and they charged that he \"habitually neglected to properly vet, train, and/or discipline\" clergy and lay leaders in the diocese, citing 11 other individuals under Ruch's oversight accused of misconduct.\nBeach appointed a team to review the charges and decide whether to refer them to the trial court. Meanwhile, Ruch made what Beach called a \"secret appeal\" to the ACNA's seven-member Provincial Tribunal, which hears appeals from the Court for the Trial of a Bishop. The tribunal issued an order to stay investigatory proceedings into the bishops' presentment. Beach in turn questioned whether four tribunal members had conflicts of interest and argued that the ACNA's canons do not give the tribunal authority to stay an investigation into a presentment. In response, the ACNA's Provincial Council, composed of clergy and lay representatives from every diocese, amended the church's canons to explicitly stop the Provincial Tribunal from intervening in a disciplinary proceeding before it has run its course.\nFollowing receipt of a second presentment filed by clergy and lay members of the Diocese of the Upper Midwest's Minnesota churches, in August 2023, a board of inquiry voted by a more than two-thirds majority that \"there was probable cause to present Ruch for trial\" on grounds of \"violation of his ordination vows, for 'conduct giving just cause for scandal or offense, including the abuse of ecclesiastical power' and for 'disobedience, or willful contravention' of the denominational or diocesan bylaws.\" The clergy and lay presentment cited seven incidents in which Ruch either allegedly failed to prioritize victims' interests following abuse charges or knowingly welcomed individuals, including as clergy, \"with histories of predatory behavior into diocesan churches without alerting church members.\" Among these behavioral histories was: an individual convicted of soliciting a prostitute whom Ruch ordained as a priest afterward; an employee of the diocese's Greenhouse Movement accused of rape whom Ruch allegedly allowed to remain employed until he found new work; an individual convicted of felony domestic violence who was given a staff role at Church of the Resurrection; and a convicted child sex offender who was permitted to attend Resurrection. According to the Washington Post, the priest with a prior conviction of solicitation was accused of sexual assault by a female deacon in the diocese, but Ruch suspended the deacon from ministry after she reported it to him.\nIn early 2024, the Court for the Trial of a Bishop held a trial of Canadian bishop Todd Atkinson on charges of spiritual abuse; he was found guilty and deposed by the ACNA College of Bishops. However, the case against Ruch had not yet been heard despite public calls from ACNA clergy and lay members for action and transparency. In September 2024, newly installed ACNA Archbishop Steve Wood, who had served on the trial court for the Atkinson trial, wrote to the province that through that trial he learned \"that our court is only able to entertain one trial at a time.\" Due to Ruch's pre-trial activity, including the appeal to the tribunal, Wood said, \"by the time Atkinson trial was ready for adjudication it was first on the court’s schedule. Practically, this means that the matters before the court concerning the Diocese of the Upper Midwest have been awaiting the completion of the Atkinson trial.\" That same month, the court issued a schedule for pretrial proceedings in advance of a July 14 start date for the trial. The court later announced that the trial would be held virtually and closed to observers and press. According to RNS, \"[n]one of the four authors of the lay presentment were invited to participate in the trial. One of those authors told RNS that numerous abuse survivors whose cases are included in the presentments were not contacted to be witnesses.\" The ACNA canons envision an adversarial system in which a prosecutor represents the province and the accused is presumed innocent and has the right to counsel. A majority of the seven-member trial court is necessary to reach a verdict.\nTrial proceedings\nThe trial began on July 14 with what the assistant prosecutor, ACNA employee Rachel Thebeau, said was a \"powerful week for the Prosecution.\" However, on July 19, provincial prosecutor C.Alan Runyan resigned from the case in an email to Wood. Runyan stated that \"the trial process had been irreparably tainted\" after an unnamed member of the trial court allegedly questioned a prosecution witness for over an hour on material that had not been introduced into evidence. Runyan said that the material, which related to the ACNA's earlier investigative process, had been ruled improper by the court in an unpublished pre-trial order. According to Thebeau, Runyan objected to the line of questioning, although a statement issued by trial court president David Bryan claimed Runyan had not objected. In resigning, Runyan claimed that \"the trial process had been irreparably tainted\" by the exposure of the other court members to \"an unwarranted suspicion of provincial investigative bias\" outside of the trial record, and he called on the court to release the full trial record and redacted transcripts to ACNA members. In response, Ruch's counsel filed a motion for a directed verdict of \"not guilty\". Wood appointed Archdeacon Job Serebrov to take up the case as provincial prosecutor and the court rescheduled the trial to resume on August 11.\nHowever, Runyan's resignation was followed a week later by a letter from Thebeau to members of the ACNA that was published online. Thebeau alleged that the trial court member whose questioning triggered Runyan to resign had access to the prosecution's files. Thebeau reported that on July 18 she discovered the court member had access to her Dropbox files and during the questioning referred to \"documents and files that I have seen but are not with the Court.\" According to Thebeau, the chief operating officer of the ACNA had granted the court member access to Thebeau's files a month earlier with the approval of the ACNA chancellor. After she learned of the court member's access to her files, according to RNS, Thebeau said \"she was invited by ACNA officers to 'consider (her) termination.' She submitted her resignation on Friday.\" Wood responded by calling Thebeau's allegations \"serious but misguided,\" and the ACNA College of Bishops and the ACNA Executive Committee issued a joint statement that they \"find no evidence to suggest that the Archbishop or members of his staff acted in any way that violates or compromises the proceedings that are active before the court.\" However, some bishops distanced themselves from the joint statement, with Chip Edgar and Alex Cameron—who sat on the Provincial Tribunal that hears appeals from the trial court—saying they recused themselves from the meeting. \"I believe it is inappropriate for the College of Bishops to comment at all on this matter prior to the conclusion of the trial,\" Edgar said in a letter to his diocese.\nMeanwhile, ACNAtoo claimed the newly appointed prosecutor had a conflict of interest, since he had done graduate studies at an institution affiliated with the Diocese of the Upper Midwest's former Greenhouse Movement deanery. The webpage of St. Paul’s House of Formation included a testimonial from Serebrov noting his \"long lasting\" friendships with leaders of the school, including Ruch's canon theologian. While the ACNA chancellor did not believe Serebrov had a conflict and Serebrov said he had never met Ruch, Serebrov resigned from the case on July 31 \"so as to remove even the appearance of impropriety\". On August 1, Thomas Crapps was appointed the province's third prosecutor in three weeks and said that \"[b]ringing justice to victims is my sole interest in this case. . . . [I]f they have been sidelined in any proceedings to date, I am committed to faithfully representing their interests going forward.\"\nTo provide Crapps time to review the trial records, exhibits and transcripts, the court delayed proceedings in the case. The trial resumed on October 8, 2025. On October 15, the court announced that the trial had concluded and that it had adjourned to deliberate, with a verdict expected by December 16.\nImpact\nThe trial and the scandal that initiated have prompted calls for reform from across the ACNA. Even before the trial began—and in response to the scandal in the Upper Midwest, according to then-Governance Task Force chairman Phil Ashey—the ACNA began an effort to overhaul its canons on dioceses, known as Title I, and its disciplinary canons, known as Title IV. In 2024, the ACNA adopted changes to Title I that gave dioceses and their bishops responsibility for preventing and reporting misconduct, and prescribed minimum requirements for safeguarding policies. ACNA priest and attorney William Barto said the changes were made in response to the Ruch disciplinary proceedings, in which \"part of his defense is, 'It wasn’t my job. . . . I trusted the local rector, the local priest in charge, to take care of this.'\" The ACNA's 2024 Provincial Assembly also ratified a canonical change that allowed the archbishop to inhibit a bishop quickly following consent from a panel of three diocesan bishops.\nTitle IV was originally designed to be \"minimalistic\" compared to the disciplinary apparatus of the Episcopal Church from which many ACNA founders separated, according to ACNA Governance Task Force chairman Andrew Rowell, who has noted that the lack of specificity in the ACNA canons caused confusion as they were put into use. Proposed revisions released in July 2025 would replace an 11-page Title IV with a 48-page section that lowers the threshold for a claim to be submitted against a bishop, establishes a \"reports administrator\" at the provincial level and creates a standing committee to review reports, rather than ad hoc investigative teams. The proposed changes would also replace the adversarial system with an \"inquiry model, where a tribunal leads the process by determining core issues and focusing on fact-finding,\" and would facilitate the trials of more than one bishop at once.\nBarto told Religion News Service it was \"a good thing that the proposal has come out at this time, while the challenges of the Ruch trial are fresh in our memories. . . . If you look at the challenges that the trial process has encountered in the Ruch case, almost every one of them is addressed in this proposal.\" Barto said the proposed revisions would increase transparency and legitimacy of disciplinary proceedings. The proposed revisions would be voted on in 2026 by the ACNA Provincial Council and go into effect in 2027.\nNotes\nReferences\nExternal links\n*[https://anglicanchurch.net/updates-on-the-ecclesiastical-trial-of-bishop-stewart-ruch-iii/ ACNA webpage on the trial]\n*[https://anglicanchurch.net/court-for-the-trial-of-a-bishop/ ACNA Court for the Trial of a Bishop webpage]\n*[https://www.acnatoo.org/ruch-trial ACNAToo webpage on the trial]\n*[https://midwestanglican.org/investigationfaq/ Diocese of the Upper Midwest FAQs on the trial and investigation]"
    }
  ]
}