{
  "content": [
    {
      "type": "text",
      "text": "# Economic League (United Kingdom)\n\nThe Economic League was an organisation in the United Kingdom dedicated to opposing what it saw as subversion and action against free enterprise. As part of its activities, it maintained a list of alleged left-wing troublemakers for decades, which corporate members would use to vet job applicants and often deny jobs on the basis of the list. In the late 1980s, press investigations revealed the poor quality of the League's data. After a 1990 parliamentary inquiry and further press reporting, the League closed down in 1993. However, key League personnel continued similar vetting activities by organisations including The Consulting Association.\nEarly history\nThe organisation was founded in August 1919 by a group of industrialists and MP William Reginald Hall under the name of National Propaganda. Hall had been Director of the Naval Intelligence Division of the Admiralty from 1914 to 1919. The organisation's chief function was to promote the point of view of industrialists and businessmen, as well as to keep track of communist and left-wing organizations and individuals. Predating McCarthyism, it worked closely with the British Empire Union. John Baker White worked as the League's Assistant Director and then from 1926 to 1939 as its director. In 1925, the Economic League was organised into a policymaking Central Council of 41 members, with 14 district organizations covering most industrial areas of the UK. Income came from tax-deductible company subscriptions and donations. The Council in 1925 included two Lords; 15 knights; high-ranking military officers; directors of newspapers; and Lord Gainford, chair of the BBC. Hall, the first chair of the organization, had by 1925 been succeeded by Sir Auckland Geddes. The Central Council of the Economic Leagues was a member in the International Entente Against the Third International.\nThe League played a particular role in opposing the 1926 United Kingdom general strike, including printing and distributing a daily newssheet, and opposing the hunger marches that were organised by the National Unemployed Workers' Movement, particularly the one in 1934. In the 1920s and the 1930s, the League organised thousands of public meetings, distributed millions of leaflets annually and began collecting centralised records on communist trade union organisers (some of which had been obtained from police files). In 1938 the League estimated that it had held almost a quarter-million public meetings since its foundation.\nPost-war era\nIn the 1960s and the 1970s, various newspapers reports confirmed the existence of the League's blacklist of left-wing workers, the existence of which the League denied until it confirmed in 1969 in an interview with The Observer that it held files. In 1978, its Annual Report noted that it used those files to supply its members with information. The Daily Express (12 January 1961) reported that firms could check if \"a prospective employee is listed as a Communist sympathiser\", and The Guardian (30 January 1964) reported on the secrecy surrounding such inquiries and quoted a League circular: \"If a director asks for details of our work, he should be told that some of it is highly confidential and therefore cannot be put in writing\". In 1974 reports included the Sunday Times (11 April), Time Out (May), and The Guardian (11 May).\nThe League's running cost was funded by contributions from various companies. According to the Labour Research Department, the League had income of £266,000 in 1968 (), with £61,000 being contributed from 154 known companies, with 21 known banks and financial institutions contributing as much as the 47 known manufacturing companies. In 2013, Labour MP John Mann said he had had a job offer at Ciba-Geigy withdrawn in the 1980s after the company had found his name on the League's list.\nPublicity and decline\nThe League became more visible in the 1980s, as the press investigated its activities, and questions were asked in Parliament in a campaign against the League that was led by Maria Fyfe. Granada TV's World in Action broadcast three reports on the League, the first on 16 June 1987, with another in 1988 showing \"that a League employee called Ned Walsh had been working undercover in the trades union ASTMS for more than twenty years\"\nThose investigations, together with a leaked 1985 League document \"The Need for a Change of Direction\", showed how poor the quality of the files was; much of it amounted to hearsay and circumstantial evidence, much of it was out of date (sometimes by decades) and substantial parts simply not providing enough information to clearly identify specific individuals. \"Speaking to MPs, trades unionists and journalists in the Houses of Parliament (in 1989) the former North West Regional Director, Mr Richard Brett, suggested that 35,000 of the 45,000 files would have to be weeded out because they were either hopelessly inadequate or uselessly out of date\". Despite the poor quality of the files, the attitude of at least some League officials was shown by World in Action filming an official who \"recommended that a company not employ someone because he had the same surname as someone on the blacklist.\"\nIn 1986, the League had income from company subscriptions of around £1 million, . After bad publicity, that fell to around £800,000 in 1988 and £660,000 in 1989. In 1990, the House of Commons Select Committee on Employment took evidence from the Economic League about its blacklist. At the time, Ford Motor Company, one of the League's largest subscribers and one of its few public supporters, cancelled its subscription.\nTrade union collusion\nJack Winder, the former Director of Information and Research at The Economic League, claimed to have had \"Very good relations with certain trade union leaders\", which held anti-communist pro-British views. He named them:\n* Leif Mills (Banking, Insurance and Finance Union)\n* Terry Carroll (Engineering)\n* Eric Hammond (Electrical, Electronic, Telecommunication and Plumbing Trade Union)\n* Dennis Mills (Transport and General Workers' Union, Midlands region)\n* Kate Losinska (Civil and Public Services Association)\nDemise\nAfter the 1990 parliamentary inquiry, press reports maintained pressure on the League. The BBC's Watchdog reported on it, and Paul Foot obtained an entire copy of the blacklist and ran a series of stories in the Daily Mirror.\nThe Economic League had been chaired by Sir Saxon Tate in the late 1970s, and after its demise in 1993, he became a non-executive director of one of its successors, CAPRiM, and two former League directors, Jack Winder and Stan Hardy, were CAPRiM employees. At the time of its closure, the League had files on 22,000 people, including Gordon Brown, 40 Labour MPs, \"as well as journalists and thousands of shopfloor workers\". Another descendant of the League, the Consulting Association, was raided by the Office of the Information Commissioner in February 2009.\nThe Consulting Association had been founded by Ian Kerr, described by the League's 1986-1989 director-general as \"a key guy. He was one of our most effective research people...\". Kerr later gave evidence to Parliament that the Consulting Association was founded in April 1993 with a £10,000 loan from Sir Robert McAlpine and \"was started out of the Services Group (SG), operated by and within the Economic League (EL). A steering committee of key people in construction companies of the SG drafted a constitution.  Key operating features of TCA were decided by representatives of the major construction companies, who were the original members...\".\nUndercover Policing Inquiry\nThe Undercover Policing Inquiry, a public inquiry into undercover policing, took evidence in 2020 related to the Economic League. A former colleague of Chief Superintendent Bert Lawrenson stated that Lawrenson, who had been involved in the undercover monitoring of leftwing activists, was employed by the Economic League after he had left the Metropolitan Police.\nThat added concerns to previous disclosures by the Metropolitan Police that \"on the balance of probabilities\", the Special Branch had improperly disclosed information about trade unionists to the Economic League or similar organisations. The inquiry is due to report in 2023.\nFootnotes\nReferences\n*The Economic League - The Silent McCarthyism, Mark Hollingsworth and Charles Tremayne (National Council for Civil Liberties), 1989,\n*Arthur McIvor, \"'A Crusade for Capitalism': The Economic League, 1919-1939\", Journal of Contemporary History 23 (1988), 631-55\n*Christopher W. Miller, \"'Extraordinary Gentlemen: the Economic League, business networks, and organised labour in war planning and rearmament\", Scottish Labour History 52 (2017), 120-151\nExternal links\n*[https://web.archive.org/web/20080511172706/http://www.friendsoftheheroes.co.uk/archive/issue18.html#4 Friends of the Heroes]\n*[https://publications.parliament.uk/pa/cm198889/cmhansrd/1989-02-08/Writtens-1.html House of Commons Hansard Debates for 8 Feb 1989]\n*[https://web.archive.org/web/20091202082242/http://www.1in12events.co.uk/archive/publications/library/spies/spies.htm Spies at Work], Mike Hughes (1994), 1 IN 12 PUBLICATIONS,\n*[https://mrc.epexio.com/records/WDP/1 Catalogue of the papers of William Driscoll, chief training officer], held at the Modern Records Centre, University of Warwick"
    }
  ]
}