{
  "content": [
    {
      "type": "text",
      "text": "# Ed Stewart (American football)\n\n|birth_place=\n|height_ft=6\n|height_in=1\n|weight_lbs=220\n|high_school=Mount Carmel (Chicago)\n|college=Nebraska (1991–1994)\n|undraftedyear=1995\n|pastteams=\n* Carolina Panthers ()*\n* Amsterdam Admirals (1996)\n* St. Louis Rams ()*\n|highlights=\n* National champion (1994)\n* Consensus All-American (1994)\n* Big Eight Defensive Player of the Year (1994)\n* First-team All-Big Eight (1994)\n}}\nEdward Stewart (born March 2, 1972) is an American college athletics administrator and former football linebacker. He played college football at the University of Nebraska–Lincoln, where he was a consensus All-American in 1994. He was also a member of the Amsterdam Admirals of the World League of American Football.\nEarly life\nEdward Stewart was born on March 2, 1972. He attended Mount Carmel High School in Chicago, Illinois.\nCollege career\nStewart was initially recruited to the University of Nebraska–Lincoln as a defensive back but converted to linebacker. He was a four-year letterman for the Nebraska Cornhuskers from 1991 to 1994 and a three-year starter at will linebacker from 1992 to 1994. He recorded five solo tackles, 13 assisted tackles, and two pass breakups his freshman year in 1991. In 1992, Stewart totaled 26 solo tackles, 38 assisted tackles, 2.5 sacks, two forced fumbles, one fumble recovery, two interceptions, and one pass breakup. He accumulated 39 solo tackles, 40 assisted tackles, three sacks, one forced fumble, one interception, and four pass breakups his junior season in 1993. As a senior team captain in 1994, he recorded a team-leading 96 tackles (41 solo, 55 assisted), 3.5 sacks, one pass breakup, and one blocked kick. Stewart earned first-team All-Big Eight, Big Eight Defensive Player of the Year, and consensus All-American honors that season. The 1994 Cornhuskers were consensus national champions. His 257 career tackles set a school record. He graduated with a Bachelor of Arts in psychology. Stewart was named to Nebraska's All-Century team in 2001 and was inducted into the Nebraska Football Hall of Fame in 2004.\nProfessional career\nStewart signed with the Carolina Panthers in April 1995 after going undrafted in the 1995 NFL draft. On August 12, it was reported that Stewart was listed third on the depth chart at left inside linebacker. He was waived by the Panthers on August 21, 1995.\nStewart was selected by the Amsterdam Admirals of the World League of American Football (WLAF) in the third round of the 1996 WLAF draft. He recorded five defensive tackles and three special teams tackles for the Admirals during the 1996 WLAF season.\nStewart signed with the St. Louis Rams in July 1996. He was waived on August 19 but later signed to the team's practice squad on September 25, 1996.\nPost-playing career\nIn 1997–1998, Stewart was employed by the Michigan State University athletic department as an academic counselor. From 1999 to 2006, Stewart was a member of the executive staff of the University of Missouri athletic department, an associate athletic director for administration, and the administrative liaison for the football program. From 2006 to 2022, Stewart was the executive associate commissioner for football for the Big 12 Conference. In 2022, he was hired by the University of Southern California athletic department as its executive senior associate athletic director for football administration. He also has a Master of Arts degree in adult and continuing education from Michigan State.\nReferences\nExternal links\n*[http://www.justsportsstats.com/footballstatsindex.php?player_id=stewaed001 Stats Crew profile]"
    }
  ]
}