{
  "content": [
    {
      "type": "text",
      "text": "# Eddie Edwards (American football)\n\n| birth_place   = Sumter, South Carolina, U.S.\n| height_ft     = 6\n| height_in     = 5\n| weight_lb     = 256\n| high_school   = Fort Pierce Central\n| college       = Miami (FL)\n| draftyear     = 1977\n| draftround    = 1\n| draftpick     = 3\n| pastteams     =\n* Cincinnati Bengals ()\n| highlights    =\n* PFWA NFL All-Rookie Team (1977)\n* Cincinnati Bengals 50th Anniversary Team\n* First-team All-American (1976)\n| statlabel1    = Sacks\n| statvalue1    = 84.5\n| statlabel2    = Fumble recoveries\n| statvalue2    = 17\n| statlabel3    = Interceptions\n| statvalue3    = 1\n| statlabel4    = Defensive touchdowns\n| statvalue4    = 1\n| pfr           = E/EdwaEd20\n}}\nEddie Edwards (born April 25, 1954) is an American former professional football player who was a defensive end for the Cincinnati Bengals of the National Football League (NFL). He played college football for the Miami Hurricanes.\nEarly life\nEdwards was born in Sumter, South Carolina, and raised in Fort Pierce, Florida. He played high school football at Fort Pierce Central High School.\nCollege career\nHe attended the University of Miami, playing college football for the Miami Hurricanes, where he was a first-team All-American at defensive tackle. In 1976, he was awarded the Jack Harding Memorial Award as the most valuable player for the Hurricanes, as selected by coaches vote.\nProfessional career\nEdwards was selected in the first round of the 1977 NFL draft, the third overall selection, by the Cincinnati Bengals. He played for the Bengals for 12 seasons from 1977 until his retirement in 1988, playing his first three seasons as a defensive tackle. During that time, he recovered 17 fumbles and set a franchise record with 84.5 sacks. However, only 47.5 of those sacks are official, as the NFL did not consider sacks an official statistic until 1982. His 47.5 official sacks remained a Bengals franchise record until Carlos Dunlap passed him in 2015.\nHonors\nEdwards was inducted into the University of Miami Sports Hall of Fame in 1989.\nReferences\nExternal links\n* [https://web.archive.org/web/20101119112729/http://umsportshalloffame.com/inductees.asp University of Miami Sports Hall of Fame Inductees]"
    }
  ]
}