{
  "content": [
    {
      "type": "text",
      "text": "# Edge Hill, Warwickshire\n\n|label_position = left\n|os_grid_reference= SP370470\n|population=\n|population_ref=\n|civil_parish= Ratley and Upton\n|shire_district= Stratford-on-Avon\n|shire_county= Warwickshire\n|region= West Midlands\n|country= England\n|post_town= Banbury\n|postcode_district= OX15\n|postcode_area= OX\n|dial_code= 01295\n|constituency_westminster=\n|website=\n}}\nEdge Hill is an escarpment and Edgehill a hamlet in the civil parish of Ratley and Upton, Stratford-on-Avon District, southern Warwickshire, England. At Ratley, the escarpment rises to  above sea level and  above nearby Radway, within 300 metres of the Warwickshire border with Oxfordshire.\nEdge Hill gave its name to the first battle of the English Civil War, in which it was a prominent feature.\nThe hamlet has a public house, an eccentric building of local Hornton Stone called the Castle Inn that was built in the 1740s to the designs of Sanderson Miller (1716–80). It is controlled by the Hook Norton Brewery.\nBattle\nThe narrow wood on the scarp of Edge Hill, in the south-east overlooks the lower slope and the plain on which the battle was fought.\nThe battle of Edge Hill was fought on Sunday 23 October 1642 and was the first major battle in the English Civil War between the Royalist forces of King Charles I and the Parliamentarian army commanded by the Earl of Essex.\nThe King's army started the day on the plateau above the scarp and Parliament's front line was about  away.  From Edge Hill, the ground drops steeply, levels out, then rises to Battleton Holt and a little beyond it are the Oaks and Graveground Copice.  It was across the latter two that Parliament's army was drawn up ( to ).  The King's forces descended from the escarpment and faced them, extended between the end of the spur at Knowle End and Brixfield Farm ( to ). The King's army had to descend from the edge of the escarpment if they wished to engage the Parliamentarians in battle, because the escarpment was far too steep for Essex to consider an attack against the Royalist army while it was on the edge. At the time of the battle, there were far fewer trees. The battle was inconclusive, with both sides claiming victory. It would take several more years and many more battles before the Parliamentarians won the war.\nIn 1643, following reports of ghostly sightings published by a printer Thomas Jackson, the King sent a Royal commission to visit the site, where they claimed to have seen two phantom armies fighting in the sky above them.\nQuarrying\nThe area around Edge Hill has been quarried extensively for Jurassic ironstone since the 11th century. Later iron ore was quarried and transported on the Edge Hill Light Railway to the Stratford-upon-Avon and Midland Junction Railway near Burton Dassett.\nReferences\nSources\n*\nExternal links\n*\n* [http://www.battleofedgehill.org BattleOfEdgehill.org] - Dedicated website\n* [http://www.battlefieldstrust.com/resource-centre/civil-war/battleview.asp?BattleFieldId=3 Battlefields Trust: Edge Hill]"
    }
  ]
}