{
  "content": [
    {
      "type": "text",
      "text": "# Edge of a Revolution__disambig_1\n\n* hard rock\n| length     = 4:04\n| label      = Republic\n| writer     =\n| producer   =\n| prev_title = Trying Not to Love You\n| prev_year  = 2012\n| next_title = What Are You Waiting For?\n| next_year  = 2014\n| misc       = }}\n}}\n\"Edge of a Revolution\" is a single by Canadian rock band Nickelback from their eighth studio album, No Fixed Address. It was released as the album's lead single on August 18, 2014. It went for Active Rock adds on August 18, and was premiered on Clear Channel radio stations. It was released for sale on August 19, 2014. This was the first release under Nickelback's new label, Republic Records.\nIt was the official theme song of WWE Survivor Series 2014.\nBackground\nThe track was first announced on June 18, 2014, in a radio interview on CFOX-FM, where Chad Kroeger, announced that the band picked the first Rock single from the album, then titled \"Revolution\", to be released sometime in August.\nThe track was described as a departure from Nickelback's original sound, In the interview, Chad stated the song touches upon \"fat cats on Wall Street\" and was inspired by current events such as the Euromaidan in Ukraine and how the government has been treating their citizens. Though in a separate interview, they said that the song was written and recorded before the Ferguson shooting. The song became their eighth number one on the mainstream rock songs chart.\nMusic video\nOn August 12, 2014, Nickelback posted on their social media accounts that they were in the midst of two video shoots, first being the music video for the first pop single, \"What Are You Waiting For\". The following day, they announced \"Edge of a Revolution\", and later that day they posted pictures from the set of the video for \"Edge of a Revolution\". The band released the lyric video on August 28, 2014 and they released the music video for the song on September 5, 2014, both through their YouTube and Vevo account.\nCharts\n{| class=\"wikitable sortable\"\n|-\n!Chart (2014)\n!Peakposition\n|-\n|-\n|-\n|UK Singles (The Official Charts Company)\n|align=\"center\"|91\n|-\n|UK Rock (The Official Charts Company)\n|align=\"center\"|4\n|-\n|-\n|-\n|-\n|}\nRelease history\n{|class=\"wikitable\"\n!Region\n!Date\n!Format\n|-\n|United States\n|\n|Active Rock radio\n|-\n|Worldwide\n|\n|Digital download\n|-\n|}\nReferences"
    }
  ]
}