{
  "content": [
    {
      "type": "text",
      "text": "# Edgware Road\n\n| client      =\n| maint       =\n| coordinates =\n| direction_a = North\n| terminus_a  = Edgware\n| direction_b = South\n| terminus_b  = Marble Arch, London\n| junction    =\n| commissioning_date =\n| construction_start_date = 43 A.D.\n| completion_date =\n| inauguration_date =\n| demolition_date =\n| north       =\n| south       =\n| east        =\n| west        =\n| known_for   = Shopping, various cuisines, Marble Arch, Gaumont State Cinema, Tricycle Theatre, St Augustine's, Kilburn,\n}}\nEdgware Road is a major road in Greater London, England. The route originated as part of Roman Watling Street and, unusually in London, it runs for  in an almost perfectly straight line. Forming part of the modern A5 road, Edgware Road undergoes several name changes along its length, including Maida Vale, Kilburn High Road, Shoot Up Hill and Cricklewood Broadway; but the road is, as a whole, known as Edgware Road, as it is the road leading to Edgware.\nThe road runs from central London to suburban town of Edgware, beginning at Marble Arch in the City of Westminster and heading north to Edgware in the London Borough of Barnet. It is used as the boundary for four London boroughs: Harrow and Brent to the west, and Barnet and Camden to the east.\nRoute\nThe road runs north-west from Marble Arch to Edgware on the outskirts of London. It crosses the Harrow Road and Marylebone Road, passing beneath the Marylebone flyover. The road passes through the areas of Maida Vale, Kilburn and Cricklewood. It then crosses the North Circular Road before West Hendon at Staples Corner. After this, the road continues in the same direction, through the Hyde, Colindale, Burnt Oak, and then reaches Edgware.\nThe southernmost part of the road forms part of the London Inner Ring Road and, as such, is part of the boundary of the London congestion charge zone. However, when the zone was extended in February 2007, the road became part of the \"free through routes\" which allows vehicles to cross the zone during its hours of operation without paying the charge.\nThe southern part of the road between Marble Arch and Maida Vale, noted for its distinct Middle Eastern cuisine and many late-night bars and shisha cafes, is known to Londoners by nicknames such as Little Cairo, Little Beirut  and, especially near Camden, Little Cyprus.\nAs it passes through the various neighbourhoods, the road name changes several times, becoming Maida Vale, Kilburn High Road and Shoot-Up Hill (in Kilburn), and Cricklewood Broadway (in Cricklewood), before becoming Edgware Road once again with intermittent stretches as West Hendon Broadway, and the Hyde. Along the entire route, it retains its identity as the A5 road under the Great Britain road numbering scheme. The A5 continues beyond the end of the Edgware Road, following the old Roman road for much of its route and terminating at Holyhead, Wales (a port for Ireland).\nHistory\nBefore the Romans, today's Edgware Road began as an ancient trackway within the Great Middlesex Forest. The Romans later incorporated the track into Watling Street.\nMany centuries later, the road was improved by the Edgware-Kilburn turnpike trust in 1711, and a number of the local inns, functioned as stops for coaches, although they would have been quite close to the starting point of coach routes from London.\nDuring the 18th century, it was a destination for Huguenot migrants. By 1811, Thomas Telford produced a re-design for what was then known as a section of the London to Holyhead road, a redesign considered one of the most important feats of pre-Victorian engineering. Telford's redesign emerged only a year after the area saw the establishment of Great Britain's first Indian restaurant.\nThe area began to attract Arab migrants in the late 19th century during a period of increased trade with the Ottoman Empire. The trend continued with the arrival of Egyptians and Iraqis in the 1950s, and greatly expanded beginning in the 1970s and continuing to the present when events including the Lebanese Civil War and unrest in Algeria brought more Arabs to the area. They established the present-day mix of bars and shisha cafes, which make the area known to Londoners by nicknames such as \"Little Cairo\" and \"Little Beirut.\"\nOne of the two Edgware Road tube stations was one of the sites of the 7 July bombings. A bomb was detonated on a train leaving the Circle, District and Hammersmith & City lines station and heading for Paddington tube station. Six people were killed in the blast. The perpetrator was the ringleader of the seven bombings, Mohammed Siddique Khan. On the first anniversary of the bombings, a memorial plaque to the victims was unveiled at the station.\nDistricts and surrounding area\nThe name \"Edgware Road\" is used to refer informally to an area of London immediately to the north of Marble Arch and south of the Marylebone flyover.\nThe postal codes of the area are W1, W2, NW1 and NW2.\nThe part of the road between Marble Arch and the Marylebone Flyover also separates the areas of Marylebone and Bayswater.\nEdgware Road is well represented in terms of communities from across the Middle East and North Africa.\nTransport\nEdgware Road has several London bus routes, and is intersected by several London Underground lines along its length or nearby. A number of schemes have been put forward in the past to construct an underground railway line underneath Edgware Road, including a plan to extend the Bakerloo line north to Cricklewood and an unusual proposal to build an underground monorail system, but these schemes did not succeed. Today, London Buses provide the only public transport along the length of the road.\nNational Rail\nMainline and Overground rail stations:\n*Marylebone station (Chiltern Main Line)\n*Paddington station (Great Western Main Line)\n* (Midland Main Line)\n* (Midland Main Line)\n* (Watford DC line)\n* (Watford DC line)\nLondon Underground\n*Edgware Road (Bakerloo line)\n* (Circle, District and Hammersmith & City lines)\n* (Central line)\n* (Bakerloo line)\n* (Bakerloo, Circle and District lines)\n*Paddington (Circle and Hammersmith & City lines)\n* (Jubilee line)\n* (Bakerloo line)\nBus routes\nNight bus N16 is the only route to run the full length of the Edgware Road, from Victoria station to Edgware.\nDay bus routes operating over a significant length of Edgware Road are:\n*6\n*7\n*16\n*23\n*32\n*36\n*98\n*189\n*316\n*332\n*436\nReferences\nExternal links\n* [https://web.archive.org/web/20071114215609/http://www.thelondonpaper.com/cs/Satellite/london/food/article/1157140549763?packedargs=suffix%3DSubSectionArticle Go west for a taste of Arabia – while it lasts] from thelondonpaper"
    }
  ]
}