{
  "content": [
    {
      "type": "text",
      "text": "# Edith Warner\n\nEdith Warner (1893–1951), also known by the nickname \"The Woman at Otowi Crossing\", was an American tea room owner in Los Alamos, New Mexico, who is best known for serving various scientists and military officers working at the Los Alamos National Laboratory during the original creation of the atomic bomb as a part of the Manhattan Project. Warner's influence on the morale and overall attitude of the people there has been noted and written about by various journalists and historians, including several books about her life, a stage play, a photography exhibition, an opera, and a dance.\nEarly life and education\nBorn in Philadelphia as the daughter of a Baptist preacher with four sisters, Warner graduated in 1910 from Lock Haven Normal School before beginning a job in teaching. She hated the occupation, however, and it harmed her mental health over time, resulting in her suffering a mental breakdown in 1921.\nCareer\nAs a station manager and shop owner (1928–1941)\nThat same year, Warner ended up visiting New Mexico in order to improve her health as recommended by her doctor. When she arrived, Warner stayed at the ranch home of John Boyd in the area of Frijoles Canyon. Her mental health did not completely recover, however, and she was later admitted as a patient to the Tilden Health School in Denver, Colorado. After she improved, she worked for a time as a staff member at the school until she returned to New Mexico in 1928 and traveled to Santa Fe. Her previous visit to the state had led her to become enamored with the landscape of the Pajarito Plateau and she decided to move there permanently. While looking for work in the city, she chanced across A.J. Connell, the director of the Los Alamos Ranch School for Boys, who was coincidentally looking for someone to hire. The previous station manager for the \"Chili Line\" stop of the local railway that was located at the school, Adam Martinez, had decided to leave the town and now the position was left vacant. Warner agreed to the job offer and settled down at Otowi Crossing along the Rio Grande river in 1928 in Martinez's old adobe house that stood on the northwest side of the suspension bridge crossing the river.\nAs station manager, she was in charge of keeping watch over the freight shipments being unloaded to prevent theft before they were moved into the school proper. At the same time, as a side job, Warner opened a small store with a tea room where she served the people of Los Alamos. This made her grow closer to the locals, including Peggy Pond Church, the daughter of the founder of the Los Alamos Ranch School, and also had her become an intimate friend with a Native American wanderer named Tilano Montoya from the San Ildefonso Pueblo. He would routinely do tasks around the house, including gathering firewood and water.\nAs a tea room and evening restaurateur (1941–1951)\nThings changed for all residents of the town when World War II began, as the school land and many of the residential homes were taken over by the United States military in 1941 so that the plateau would be vacated and could be used as a base for work on the Manhattan Project. The school would end up being bulldozed by 1943. Though Warner's home was across the bridge and not directly affected by the seizure, the tea room on the school property was ordered to be shut down due to security concerns. With that closure, Warner tried to continue operating the tea room out of her residence, but the tourist trade to the plateau ended completely due to the site being locked up as a military installation. A lack of income forced her to consider having to move back to Pennsylvania, but Robert Oppenheimer, a frequent attendee of her tea room since 1937, convinced her to stay and reconfigure her business directly toward the on-site scientists. She agreed and re-opened her home as both a tea room and a dinner restaurant, leading to her business once again booming thanks to her home acting as a getaway for scientists like Niels Bohr, Philip Morrison, and Enrico Fermi. She decided to name her tea room \"The House by the Side of the Road\". Among the various culinary options she provided, her chocolate cake would be frequently mentioned by the scientists in the years following. Many former residents of the plateau were given the recipe for the chocolate cake by Warner before they had to leave and the recipe would go on to see significant fame in the region.\nThe dining services Warner provided became extremely popular among the laboratory's staff and reservations for her meals ended up becoming booked for months in advance, with Oppenheimer having a constant open reservation whenever he wanted and other close friends allowed to choose one night a week for them to arrive as a group. In order to accommodate the constant stream of evening customers, for which she charged a general $2 a person, an extra expanded dining room was added on to the house for more seating arrangements. The only requirement she had for her dinners was that no alcohol was allowed in her home. The constant work took a toll on her health though, which was noticed by and brought concern to Kitty Oppenheimer and Dorothy McKibbin. To reduce her workload, Harold Agnew and his wife Beverly came by frequently to help out with the chores that Warner and Tilano were becoming too old to complete easily, along with bringing batteries from the laboratory to keep Warner's radio powered. With the increase in supplies being sent to the nearby base, the bridge at Otowi Crossing was determined to no longer be in working order, so in 1947 it was set to be demolished and a new, larger bridge built to accommodate the expanded highway that was being constructed. This would require the removal of Warner's home next to the bridge, however, so people from Los Alamos and San Ildefonso worked together to build a new home for her nearby at the base of the Totavi mesa. Warner would die a few years later in 1951 and be buried in the reservation graveyard at San Ildefonso.\nWarner was an avid writer and frequently created essay and journal entries, along with many letters to her friends. A selection of these works were collected and edited by Patrick Burns before being published as a book called In the Shadow of Los Alamos: Selected Writings of Edith Warner.\nLegacy\nPeggy Pond Church, an accomplished author, would end up writing an entire biography of Edith Warner published in 1960 that she named The House At Otowi Bridge. Another book on Warner was written  by Frank Waters in 1965 and named The Woman at Otowi Crossing. Church donated her personal papers to the University of New Mexico in 1980 and, from these, editor Shelley Armitage published a collection of these writings through Texas Tech titled Bones Incandescent, which heavily features Warner. A stage play was created by playwright Robert Benjamin, a Los Alamos resident, about Warner's life and titled \"Sunrise at Otowi Bridge\". A photography exhibition on Warner and her life was revealed at the Forum for Contemporary Art in St. Louis on May 20–21, 1995 as a part of a broader multimedia installation titled \"Critical Mass\". Additionally, an opera titled \"The Woman at Otowi Crossing\" was written by Stephen Paulus and commissioned by the Opera Theatre of Saint Louis before being premiered on June 15, 1995, at Webster University. Warner was a primary character featured in a dance theatre piece titled \"A Matter of Origins\" developed by choreographer Liz Lerman and performed beginning in September 2010 at the Clarice Smith Performing Arts Center and again in November 2011 at the Museum of Contemporary Art, Chicago.\nPersonal life\nWarner was a dedicated Quaker. Her religious beliefs included elements of mysticism and of a desire to be connected to nature and the land, with her being described by Patrick Burns as \"almost like the first hippie\". She died of cancer at her home in 1951.\nBibliography\n*\nReferences\nFurther reading\n*\n*"
    }
  ]
}