{
  "content": [
    {
      "type": "text",
      "text": "# Edmond Warnock\n\nJohn Edmond Warnock PC(NI) KC (1887–19 December 1971) was an Irish barrister and politician.\nBorn in Belfast, he was educated at Methodist College Belfast and Trinity College, Dublin. He was called to the English Bar in 1911, to the Northern Ireland Bar in 1921 and was appointed as King's Counsel in 1933. He served with the Royal Artillery during the First World War.\nIn 1938, he was elected to the Northern Ireland House of Commons as a Unionist member for Belfast, St Anne's, which he represented until his retirement from Parliament in 1969. He served as Parliamentary Secretary to the Ministry of Home Affairs from 1938 to 1940, when he resigned in protest at the failure to extend conscription to Northern Ireland during the Second World War. In 1944, he rejoined the Government when he was appointed as Minister of Home Affairs, an office which he held until 1946. From June to September 1946 he served as Deputy Attorney General and then from September 1946 until November 1949 as Minister of Home Affairs for a second time. He was then Attorney General for Northern Ireland from 1949–1956. He was appointed to the Privy Council for Northern Ireland in 1944, entitling him to be called The Right Honourable.\nWhile Parliamentary Secretary to the Minister of Home Affairs (1938–40), Warnock, despite being advised by defence experts in Great Britain to prepare for German aerial attacks, decided to cancel orders previously placed for fire-fighting equipment and to recommend not building air raid shelters to protect either the civilian population or workers in factories, even those in the vital Harbour Estate area containing the shipyards and aircraft factories.  Warnock believed that Belfast was too remote for German bombers to reach, and, in any case, they would pass more attractive targets en route.  Also, in the event of a raid, he claimed \"people would not have time\" to reach shelters anyway, as it would \"probably all be over in a matter of minutes\". (see Brian Barton 'The Belfast Blitz: The City in the War Years', Ulster Historical Foundation, 2015. pages 38–41).\nReferences"
    }
  ]
}