{
  "content": [
    {
      "type": "text",
      "text": "# Edmonds Historical Museum\n\n}}\n| locmapin     = Washington\n| map_width    = 300\n| built        =\n| architect    = Ward, H.B.\n| architecture = Edwardian, Beaux Arts\n| added        = April 24, 1973\n| area         = Less than one acre\n| mpsub        = Carnegie Libraries of Washington TR (AD)\n| refnum       = 73001887\n}}\nThe Edmonds Historical Museum is a free, volunteer-run museum in Edmonds, Washington, United States. It was established in 1973 by the Edmonds–South Snohomish County Historical Society and is in the historic Carnegie Library in downtown Edmonds. The museum has a collection of 32,000 items.\nHistory\nThe Carnegie Library was opened on February 17, 1911, with a $5,000 grant from industrialist and philanthropist Andrew Carnegie that was awarded to the Women's Library Club and the city librarian. It was designed by architect and contractor H.B. Ward of Seattle and included the city hall, council chambers, and a jail. The city hall and library were moved into a new civic center in 1962; the Carnegie Library was transferred to the Edmonds Parks and Recreation Department.\nIn 1973, the Edmonds City Council agreed to lease the library building to the newly formed Edmonds-South Snohomish County Historical Society for the creation of the Edmonds Historical Museum. On April 24, 1973, the Carnegie Library was placed on the National Register of Historic Places, the only building in Edmonds to be so designated. The Edmonds Historical Museum opened on August 3, 1973.\nCollection and displays\nThe Edmonds Historical Museum has approximately  of exhibit space, offices, and storage. It is one of the largest museums in Snohomish County and has 32,000 items in its collection. Its holdings include physical artifacts, oral histories, clothing, photographs, books, maps, and other documents related to the history of Edmonds and south Snohomish County. There are also two early fire trucks in the collection. The museum's on-site storage space was replaced by a commercial storage facility in 2015.\nDisplays\nThe upper floor of the Edmonds Historical Museum contains a children's activity area, a research library, and two galleries with rotating exhibits. It also houses a staff office, storage, and work areas.\nThe ground floor consists of a series of permanent displays depicting Edmonds' past, including reconstructions of historical locations and objects. These include a diorama depicting the 1910 Edmonds town site and waterfront, the Cook Victorian Parlor, a room representing an early hotel, a model of a shingle mill, and the preserved jail cell.\nIn front of the museum is \"Marsh Life\", a sculpture by the Coast Salish artist Ty Juvinel. It depicts fisherman and animals in the Coast Salish style and features crescents, trigons (or wedges) and ovals. A skylight shelter features an etching of a frog, a spiritual figure in Coast Salish culture.\nCommunity outreach\nThe Edmonds Historical Museum is operated by the Edmonds–South Snohomish County Historical Society, which hosts programs at the museum and community events. It also partners with the Edmonds Historic Preservation Commission to document local houses and with other non-profits on various joint programs and exhibits.\nReferences\nExternal links\n* [https://web.archive.org/web/20100606070925/http://www.historicedmonds.org/index.html Official website]"
    }
  ]
}