{
  "content": [
    {
      "type": "text",
      "text": "# Edmonds–Kingston ferry__disambig_1\n\nEdmonds Station\n|bus1          = Community Transit\n|road1         =\n|connection2   = Kingston\n|bus2          = Kitsap Transit\n|road2         =\n}}\nThe Edmonds–Kingston ferry is a ferry route across Puget Sound between Edmonds and Kingston, Washington.  Since 1951 the only ferries employed on the route have belonged to the Washington state ferry system, currently the largest ferry system in the United States.  The last regularly operated steam ferry on the West Coast of the United States made its final run on this route in 1969.\nDescription\nThe route crosses the Puget Sound with Edmonds, Washington as the eastern terminus and Kingston, Washington as the western terminus. The crossing is generally 30 minutes from either terminal.\nHistory\nAfter 1951, the main ferry on the route was the  (capacity: 616 passengers; 59 automobiles), with the steam ferry Shasta operating as a reserve boat.  Other ferries used on the route were the Klahanie, the steam ferry San Mateo, and the Evergreen-class motor ferry  (capacity: 981 passengers, 87 autos).\nIn 1968 the Evergreen-class ferry  (capacity: 1,200 passengers, 87 autos) was assigned as the regular boat on the route.  On Labor Day 1969, the San Mateo became the last steam ferry on the West Coast of the United States to run a regular route.\nBy the early 1970s, the relief vessels on the run included  and .  Another vessel sometimes used on extra summer runs in the early 1970s was the .\nTerminals\nBoth terminals at Edmonds and Kingston are equipped with overhead passenger loading. Edmonds is equipped with one vehicle slip, while Kingston is equipped with two. There is also a passenger-only dock at Kingston. It was previously used for the Soundrunner, a passenger only fast-ferry service to Seattle that the Port of Kingston operated between Fall 2010 and Fall 2012. The dock was utilized again starting in November 2018 when Kitsap Transit resumed passenger only fast-ferry service to Seattle with .\nThe Kingston terminal has an extra slip for a spare boat, which was regularly used for a third vessel until the 1970s. In recent years, the spare slip has been used when three vessel service is in place on the Edmonds-Kingston route, usually due to reduced vessel capacity or the suspension of an adjacent run. The spare slip has also been used for storage of vessels when all the slips at the Eagle Harbor maintenance facility are full.\nCurrent status\nBeginning in 1999, the vessels normally assigned to the route are the Jumbo class ferry  and the Jumbo Mark II class ferry . The Jumbo class ferry  is frequently assigned when either of the regular boats is out of service or required elsewhere.\nAs of August 2025, the vessels operating the route included the Jumbo class ferries MV Walla Walla and MV Spokane.\nSee also\n* Washington State Ferries\n* Ferries in Washington State\nNotes\nReferences\n* Demoro, Harre, The Evergreen Fleet – A Pictorial History of Washington State Ferries, Golden West Books, San Marino CA (1971)\n* Kline, Mary S., and Bayless, G.A., Ferryboats -- A Legend on Puget Sound, Bayless Books, Seattle, WA (1983)\n*  Newell, Gordon, R., ed., H.W. McCurdy Marine History of the Pacific Northwest, Superior Publishing, Seattle, WA (1966)"
    }
  ]
}