{
  "content": [
    {
      "type": "text",
      "text": "# Education controversies in the Republic of Ireland\n\nThere have been several educational controversies in Ireland.\nEileen Flynn\nIn 1982 Eileen Flynn, a teacher, was sacked from her teaching post for being pregnant while unmarried.\nDunboyne Controversy\nIn 2002, Tomás Ó Dulaing, the headmaster of Gaelscoil Thúlach na nÓg in Dunboyne, County Meath was dismissed after a controversy over religious education in the school. The school is interdenominational, with education in both Catholic and Church of Ireland faiths. Tomás Ó Dulaing arranged for religious education classes to take place outside regular school hours after consulting with parents and management, but the schools patron body objected and the board of management sacked him. He was sacked for mis-conduct following his unauthorised letter sent to the parents of the children, this dismissal was upheld by the labour court after he withdrew his appeal.\nBalbriggan Controversy\nIn 2007, controversy broke when a school in Balbriggan was reported to have only black pupils, all Irish-born, leading to accusations of de facto segregation in the school system. Some claimed it was an unintended consequence of the school enrolment policies, others blamed the state failing to plan for growth in the area. Because of the shortage of school places, an Educate Together school that was scheduled to open in 2008 was opened a year ahead of schedule.\nDrogheda Controversy\nDuring the 2009 Leaving Certificate examination, a school in Drogheda, County Louth handed out English Paper Two instead of English Paper One. As a result, the original date for English Paper Two was reset to the following Saturday with a different, contingency paper.\nProtestant Schools grant controversy\nAs part of the fallout of the 2009 Irish government budget, the minority Protestant population in the Republic were particularly incensed by cuts announced by the Minister for Education to grants previously available to the 21 Protestant denomination secondary schools which breached a 40-year-old agreement reached when free secondary education was introduced in the Republic by the then Minister for Education, Donogh O'Malley. Under that agreement, Protestant secondary schools which had to provide a boarding element (and therefore charge fees) to provide education for the widespread but sparse Protestant population were treated in the same manner as \"free\" Roman Catholic schools. The Protestant community in return accepted that they could not expect the State to provide a \"free\" secondary school in every locality, and that they would have to pay a level of fees to educate their children. It was planned that Protestant churches through their administration of the grants provided by the Department would ensure that those least able to pay fees are assisted to the greatest extent possible.\nIn October 2008, the Minister of Education grouped these Protestant schools which provided boarding for students living at a distance into the same category as Roman Catholic schools which charged fees. This change meant that the schools must employ fewer teachers per child, and the schools would not receive government funding for non-teaching staff, as the free Roman Catholic schools do. Opposition to these cuts was being mounted by the Church of Ireland, the Methodist Church and the Presbyterian Church as well as the schools and parents.\nSee Protestant Schools grant controversy.\nLeaving Certificate 2010 cheating controversy\nIn June 2010 a student alleged on boards.ie that cheating in the Leaving Certificate exams was happening in her school. The State Examinations Commission confirmed that it was investigating the allegations.\nOn 13 June 2017 it was confirmed that someone somehow took a picture of Irish Paper 2 and was sent to a Facebook group of about 3000 teachers. The State Examinations Commission is now ongoing the investigation.\nBan of Muslim Veil\nAt the start of the 2010–2011 term there was controversy over an announcement that a number of Catholic run second level schools in Ireland have imposed a ban on Muslim girls covering their faces with a full veil, although head scarfs are allowed. Sikhs who attend Catholic run boys schools are allowed wear a turban.\nThe opposition Labour party education spokesperson (later minister of education Ruairi Quinn) had earlier called for a head scarf ban.\nReferences"
    }
  ]
}