{
  "content": [
    {
      "type": "text",
      "text": "# Edward Ball (American author)\n\n}}\n| birth_place   = Savannah, Georgia, U.S.\n| death_date    =\n| death_place   =\n| occupation    = Author, journalist\n| alma_mater    = Brown University\n| spouse        =\n| partner       =\n| children      =\n| years_active  = Since 1987\n| website       =\n}}\nEdward Ball (born 1958) is an American author who has written multiple works on topics such as history and biography. He is best known for works that explore the complex past of his family, whose members were major rice planters and slaveholders in South Carolina for nearly 300 years. One of his more well known works is based around an African-American family, descended from one member of this family and an enslaved woman, whose members became successful artists and musicians in the Jazz Age.\nThe Ball Family Slaveholder Index (BFSI) reports that between 1698 and 1865, six generations of the Ball family \"owned more than twenty rice plantations in Lowcountry South Carolina and enslaved nearly 4,000 Africans and African Americans.\" Edward Ball, who completed his MA in 1984, worked as a freelance journalist before he began researching and writing about his family's history of slaveholding.\nHis books include Slaves in the Family (1998), which won a National Book Award. In Slaves in the Family, he described his great-great grandfather, Isaac Ball (1785-1825), a fifth generation member of the Ball family of slaveholders, who inherited the Comingtee plantation, near Charleston and owned 571 enslaved people.\nHe was also recognized for his Life of a Klansman: A Family History in White Supremacy (2020). In the Life of a Klansman: A Family History in White Supremacy, he wrote about his maternal great-great-grandfather, Constant Lecorgne (1832 -n.d. ). At one time, he was officially classified as \"colored,\" which denoted that he was a mulatto or a mixed race person at the time. Having European ancestors, he changed his name and passed as white. He became an \"embittered racist.\"\nEarly years and education\nEdward Ball was born in 1958 in Savannah, Georgia to parents with deep roots in the South. He is a son of Theodore Ball, an Episcopal priest, and Janet (Rowley) Ball, a bookkeeper. Ball grew up in Georgia, South Carolina, Florida, and Louisiana, as his family moved following his father's church assignments. His father's ancestors had been major planters and slaveholders for six generations in South Carolina. Ball graduated from St. Martin's Episcopal School in 1976.\nBall received a B.A. from Brown University in 1982 and an M.A. from the University of Iowa in 1984.\nDuring the 1980s, Ball worked as a freelance journalist in New York City, writing about art, books, and film for The Village Voice and Condé Nast, Hearst, and Hachette magazines. He also wrote a column about architecture and design for The Village Voice.\nSlaves in the Family\nBall's history Slaves in the Family (1998) was described in a 2020 New York Times review as a \"deeply reported National Book Award-winning history\". Ball had \"tracked down descendants of those who had once been enslaved by his South Carolina ancestors on his father’s side.\" In it he described how the Ball family had owned slaves in South Carolina for six generations. The well-received book was also reviewed at the time of publication by the Washington Times, and The Philadelphia Inquirer.\nEdward Ball's great-great grandfather, Isaac Ball (1785–1825)—a fifth generation of the Ball family slaveholders—had inherited the Comingtee plantation, near Charleston, and owned 571 enslaved people. The Ball Family Slaveholder Index reported that between 1698 and 1865, generations of Ball family \"owned more than twenty rice plantations in Lowcountry South Carolina and enslaved nearly 4,000 Africans and African Americans.\"\nEdward Ball conducted research that went far beyond this work, as he traced numerous slaves named in records, including some who appeared in photographs held by the family. He has recounted the life of an enslaved African woman named Priscilla by his Ball ancestor. She was captured from the area of present-day Sierra Leone in 1756 and sold in Charleston to Isaac Ball (or his overseer). She died at Comingtee plantation near Charleston in 1820. Ball's account, \"Priscilla's homecoming\", was published by The Gilder Lehrman Center for the Study of Slavery, Resistance, and Abolition. In Ball's telling, a former enslaved African American, P.H. Martin (c. 1853-) had written several letters in the 1920s to his former master, also named Isaac Ball.\nLife of a Klansman: A Family History in White Supremacy\nIn his 2020 book, Life of a Klansman: A Family History in White Supremacy, Ball explores the life of his maternal great-great-grandfather, Polycarp Constant Lecorgne (1832–1886), called Constant. Ball's family referred to him as a 19th-century Klansman. He was born in Louisiana and raised in ethnically complex New Orleans. Lecorgne was a middle son in a large, French-speaking white Creole family: his mother's family had owned a plantation in Louisiana and been there for some time, and his father deserted from the French Navy. At one time the Lecorgnes rented a house from a French-speaking free woman of color.\nLecorgne became a carpenter but was not very successful, and was considered part of the poor white working class, known as petit blancs. After serving in the Confederate Army (where he was not very successful), in the early 1870s, during Reconstruction, Lecorgne became active in the White League in his neighborhood; it was one of a number of paramilitary, white supremacist organizations. It operated openly for maximum intimidation of Republican blacks. He participated in an 1873 attack on a local police station but it was suppressed.\nIn this book, Ball also explored the life of Louis Charles Roudanez, a prominent homme de couleur libre, or free man of color, a contemporary in New Orleans of the Lecorgne family. Creoles of color (who like other ethnic French still mostly spoke French), were often descendants of white French or ethnic French fathers and African-descended women, some of whom were women of color, had developed as a separate class in New Orleans, attaining education, property, and standing by the 19th century. Roudanez became educated, and a medical doctor, \"trained in France and at Dartmouth, who published The New Orleans Tribune, a daily newspaper for the Black community.\" It was the first such paper in the United States.\nBall explored Roudanez's descendants and found a great-great grandson in St. Paul, Minnesota. He appeared and identified as white. He grew up knowing only of his white ancestry and culture. He learned in 2005, at the age of 55 after his father's death, that his father had been a Roudanez descendant, recorded at birth in New Orleans as \"colored\", or mixed-race (when much of the South had established laws related to the one-drop rule). Refusing to be limited by state segregation in Louisiana, his father had changed his name and passed as white, studying and graduating from the segregated Tulane University. After that he moved to the upper Midwest, where he lived and worked, married a white woman, and had a family. But, his son said, the father as he knew him as an adult had become \"a resentful white racist.\"\nReception\nAccording to the 2020 Times review of Life of a Klansman,\n\"The interconnected strands of race and history give Ball’s entrancing stories a Faulknerian resonance. In Ball’s retelling of his family saga, the sins and stains of the past are still very much with us, not something we can dismiss by blaming them on misguided ancestors who died long ago.\"\nThe Times quoted Ball saying,\n\"It is not a distortion to say that Constant’s [Lecorgne] rampage 150 years ago helps, in some impossible-to-measure way, to clear space for the authority and comfort of whites living now—not just for me and for his 50 or 60 descendants, but for whites in general. I am an heir to Constant's acts of terror. I do not deny it, and the bitter truth makes me sick at the stomach.\"\nThe book was also reviewed by The Wall Street Journal, which notes that in studying his Louisiana family, Ball explores \"how white supremacy is as much a part of his family history as the institution of slavery. The result is brave, revealing and intimate, an exploration of how one family’s morally complicated past echoes down to the present.\"\nSelected works\n* The Sweet Hell Inside: The Rise of an Elite Black Family in the South (Morrow, 2001) — The history of the Harlestons, a prosperous black family who were descendants of a white Southern slaveholder and his enslaved black cook. They struggled after the end of the Civil War to create a dynasty in art and music during the Jazz Age.\n* Peninsula of Lies: A True Story of Mysterious Birth and Taboo Love (Simon & Schuster, 2004) — The life of English writer Gordon Hall, who, during the 1960s, became one of the first sex-reassignment patients. He transitioned to become Dawn Langley Simmons, a rich white woman. She married a black fisherman. She claimed their mixed-race daughter was her biological child.\n* The Genetic Strand: Exploring a Family History Through DNA (Simon & Schuster, 2007) — After finding a 150-year-old collection of children's hair, kept by his family during the 1800s, Ball turns to DNA science as a tool of family history. He had the locks of hair analysed to reveal their genetic secrets.\n* The Inventor and the Tycoon: A Gilded Age Murder and the Birth of Moving Pictures (Doubleday, 2013) — Ball explores the lives of 19th-century photographer Eadweard Muybridge and railroad capitalist Leland Stanford. Together they invented the technology of motion pictures. Muybridge murdered a man who had seduced his wife.\nOther work\nEdward Ball has taught at Yale University between 2010 and 2015. He has also taught at the State University of New York.\nRecognition\nAwards\n*Fellow, Radcliffe Institute for Advanced Study, Harvard University 2016–17\n*Fellow, Cullman Center for Scholars and Writers, New York Public Library, 2015–16\n*Fellow, National Endowment for the Humanities, Public Scholar Grant, 2015\n*Southern Book Award, 1999\n*National Book Award, Nonfiction, 1998\nNotes\nReferences\nExternal links\n*\n* [https://www.worldcat.org/search?q=au%3ABall%2C+Edward&fq=yr%3A1990..2020+%3E&qt=advanced&dblist=638 Works] by Edward Ball in libraries (WorldCat catalog)\n* [https://www.c-span.org/person/?edwardball Appearances] on C-Span\n* [https://www.radcliffe.harvard.edu/video/edward-ball-life-klansman \"Life of a Klansman\"]  –– Talk by Edward Ball at the Radcliffe Institute, Harvard, 2017\n* [https://www.edwardball.com/media Appearance]  by Edward Ball on the Oprah Winfrey Show\n* [https://people.com/human-interest/why-author-edward-ball-opened-up-about-his-familys-racist-past/ Profile] of Edward Ball in People magazine"
    }
  ]
}