{
  "content": [
    {
      "type": "text",
      "text": "# Edward Stephenson (cricketer)\n\n|         death_place = Blyth, Suffolk, England\n|            heightft =\n|          heightinch =\n|            nickname =\n|              family =\n|             batting = Unknown\n|             bowling =\n|                role =\n|               club1 = Norfolk\n|               year1 = 1914\n|             columns = 1\n|             column1 = First-class\n|            matches1 = 1\n|               runs1 = 0\n|            bat avg1 = 0.00\n|           100s/50s1 = –/–\n|          top score1 = 0\n|      hidedeliveries = true\n|  catches/stumpings1 = 1/–\n|                date = 14 July\n|                year = 2019\n|              source = http://www.espncricinfo.com/england/content/player/34453.html ESPNcricinfo\n}}\nEdward Keppel Stephenson (22 March 1891 &ndash; 21 April 1969) was an English first-class cricketer, British Army officer and educator.\nThe son of Major Keppel Stephenson and his wife, Helena Mary Greathed, he was born at Kensington in March 1891. He was educated at Eton College, before going up to Merton College, Oxford. He played minor counties cricket for Norfolk in 1914, making a single appearance in the Minor Counties Championship.\nHe served during the First World War with the Coldstream Guards, enlisting as a second lieutenant in August 1914, with confirmation in the rank in February 1915. He was promoted to the rank of lieutenant in August 1915. He was promoted to the rank of captain in January 1917, before being seconded to British India in March 1917, where he served as aide-de-camp to the Governor of Bengal. While in British India, he made a single appearance in first-class cricket for a Bengal Governor's XI against a Maharaja of Cooch-Behar's XI at Calcutta in November 1917. Batting twice in the match, he was dismissed in the Governor's XI first-innings without scoring by Jack Newman, while in their second-innings he was dismissed for the same score by Frank Tarrant.\nFollowing the conclusion of the war, he became a schoolteacher at Radley College, where he was active in the Radley Contingent of the Officers' Training Corps. He resigned his commission in 1921, retaining the rank of captain. He was a partner in the Farnborough School at Hampshire, which was dissolved in 1928. He died in April 1969 at Blyth, Suffolk.\nReferences\nExternal links\n*"
    }
  ]
}