{
  "content": [
    {
      "type": "text",
      "text": "# Edwards Villa\n\nEdwards Villa () is a building located in Bornova, İzmir. It currently serves as a university cafeteria and community centre.\nHistory\nEdwards Villa was built by the Edwards Family in 1880, at which time it became the family's own residence. After Charles Edwards died, the villa was given the name \"Murat Villa\".\nIn 1980, it was expropriated by the local government and the İzmir Province Vulnerable Child Protection Unit. In 1983, it was transferred to the General Directorate of the Social Services Society for the Protection of Children.\nIn 2001, The Society for the Protection of Children and Izmir Metropolitan Municipality started a project to comprehensively restore the villa. This project lasted fifteen years. After restoration in 2005, it was given to Ege University and currently serves as a cafeteria and a community center.\nLocation\nThe villa is located in Erzene Mahallesi at no.4 66th Street, opposite the St. Mary Magdalene Anglican Church.\nArchitecture\nThe symmetry of the façade is accentuated by the double doors of the entrance.\nThe porch is surrounded by Ionic columns and approached by a double staircase. The stairs on the porch open onto the southern façade of the main hall and are typical of the Italian architecture used in the entire structure.\nThe porch is a specimen of late Italian civic architecture.\nInterior\nThe interior of the building has a number of ornaments made out of plaster and wood.\nThe ceilings have various eye-catching motifs of animals such as lions and dragons. The ground floor hall is adorned with black-and-white marble plaques, intricate niches and large wooden doors. The fireplace is made out of cast iron. The first floor rooms are decorated simply in stark contrast with the hall's ornate ceiling centers.\nThe restoration process involved stripping the plaster and cladding from the basement and covering the chimney with bricks, as well as replacing the lighting fixtures, which left the architecture inconsistent.\nGallery\nReferences"
    }
  ]
}