{
  "content": [
    {
      "type": "text",
      "text": "# Edward Beck (British Army officer)\n\n| image         =\n| image_size    =\n| alt           =\n| caption       =\n| nickname      =\n| birth_date    =\n| birth_place   =\n| death_date    =\n| death_place   =\n| placeofburial =\n| allegiance    = United Kingdom\n| branch        = British Army\n| serviceyears  = 1900–1945\n| rank          = Major-General\n| servicenumber = 18034\n| unit          = Royal Scots FusiliersKing's Own Yorkshire Light Infantry\n| commands      = 9th (Highland) Infantry Division (1940)2nd Infantry Brigade (1935–36)2nd Battalion, King's Own Yorkshire Light Infantry (1929–32)\n| battles       = Second Boer WarFirst World WarSecond World War\n| awards        = Companion of the Order of the BathDistinguished Service OrderMentioned in Despatches (6)Knight of the Order of Saints Maurice and Lazarus (Italy)Croix de guerre (France)Croix de guerre (Belgium)\n| relations     =\n| laterwork     =\n}}\nMajor-General Edward Archibald Beck,  (16 March 1880 – 11 July 1974) was a senior British Army officer who commanded the 9th (Highland) Infantry Division during the early stages of the Second World War.\nMilitary career\nEdward Archibald Beck was born in 1880 as the son of a colonel in the British Army. He was educated in England at Wellington College, Berkshire and the Royal Military College, Sandhurst, Beck was commissioned into the Royal Scots Fusiliers as a second lieutenant on 20 January 1900. He left Southampton in the SS Assaye the following month, to fight in the Second Boer War with the 2nd battalion of his regiment. In South Africa, he took part in operations in Natal from March to April, then in the Transvaal from May to November 1900, including the action at Frederickstad. He was promoted to lieutenant on 6 April 1901, and that year took him to Cape Colony, north of the Orange River, including action at Ruidam. For his service he received the Queen's Medal with two clasps. Following the end of the war in June 1902, Beck returned home on the SS Kinfauns Castle in October.\nSeconded to the Egyptian Army in 1909, Beck then saw active service in the First World War, during which he was six times mentioned in despatches and awarded the Distinguished Service Order (DSO). After attending and graduating from the first post-war course at the Staff College, Camberley in 1919, he was appointed Chief Instructor at the Small Arms School at Hythe, Kent in 1925, Commander of the 2nd Battalion the King's Own Yorkshire Light Infantry in 1929, and Instructor at the Senior Officers' School at Sheerness in 1932. He went on to be a staff officer with Scottish Command in 1933, Commander of the 2nd Infantry Brigade at Aldershot Command in 1935 and Director of Personal Services at the War Office in 1938. He served in the Second World War as Commander of the 9th (Highland) Division before retiring from the regular army in 1940, continuing his war service with the Perthshire Home Guard until the end of the war. In addition to being County Commander Perthshire Cadets from 1943 to 1950, he was also Honorary Colonel 4/5th Battalion, Royal Scots Fusiliers from 1942 to 1949.\nHe died on 11 July 1974 at the age of 94.\nReferences\nBibliography\n*\nExternal links\n*[https://generals.dk/general/Beck/Edward_Archibald/Great_Britain.html Generals of World War II]"
    }
  ]
}