{
  "content": [
    {
      "type": "text",
      "text": "# Edward Steves Homestead\n\n| image          = Edward steves homestead.jpg\n| caption        = Steves House in 2012\n| location       = 509 King William St.,San Antonio, Texas\n| coordinates    =\n| locmapin       = Texas#USA\n| map_label      = Eduard Steves Homestead\n| locmap_relief  = yes\n| built          =\n| architect      = Alfred Giles\n| architecture   = Second French Empire\n| website        =\n| designated_nrhp_type = January 20, 1972\n| designated_other1 = RTHL\n| designated_other1_date= 1970\n| designated_other1_number = [https://atlas.thc.state.tx.us/Details/5029005117 5117], [https://atlas.thc.state.tx.us/Details/5507015493 15493]\n| designated_other1_num_position = bottom\n}}\nThe Edward Steves Homestead is located in the Bexar County city of San Antonio in the U.S. state of Texas.  It was designed by architect Alfred Giles and designated a Recorded Texas Historic Landmark. The main house was donated to the San Antonio Conservation Society in 1952. The organization completely restored the main house as a museum, which closed in 2022. The complete homestead property consists of four individual structures: the main house museum, the carriage house, the river house, and the servants' quarters.  It is listed on the National Register of Historic Places listings in Bexar County, Texas, as a contributing structure of the King William Historic District.\nHomestead property\nAlfred Giles, as an employ of John H. Kampmann, is credited with designing the main house.  Locally quarried limestone was used in construction of the four-bedroom house. It was completed in 1877 for $15,000. In 1970, the house was listed as a Recorded Texas Historic Landmark. The house features a mansard roof and 13-inch-thick exterior walls.  It was fairly modern for its time, with a telephone line, electric lighting and running water.  The parlor doors in the house featured American-made etched glass panels.\nThe main house at the homestead was deeded to the San Antonio Conservation Society (SACS) in 1952 by the granddaughter of Edward Steves, Edna Steves Vaughan, and her husband Curtis Vaughan.  SACS sold the home to a private buyer in 2022.  When SACS first approached Vaughan about purchasing the house, Vaughan offered to donate the house with the stipulation that the then-current residents be retained as caretakers.  The grounds, exterior and interior of the French Second Empire style house were restored in 1954 as a museum with period furniture. With much of the original furniture gone, the Steves family donated many of their own pieces for the restoration.  Among the pieces added in the restoration was a mosaic table featuring St. Peter's Square in Vatican City. When SACS did the restoration, Yale University donated an antique 1857 Chickering and Sons grand piano.\nThe property contains three buildings in addition to the main house. The carriage house predated the main house and all other structures on the property. Built in 1875, the frame and stone carriage house was restored in 1976–77.  The servants quarters was erected in 1877 and restored in 1983–84. The one-story brick structure known as the river house once contained San Antonio's first natatorium.\nEdward Steves\nEdward Steves (1829–90) was a San Antonio city alderman who had relocated to Texas from his native Germany.  He and his wife Johanna maintained a family home on rural acreage in Kendall County. He ran the successful Steves Lumber Company  in San Antonio from 1866 to 1877. Steves was a civic leader in the San Antonio business community, serving on the Board of Trade, the Volunteer Fire Company No. 2 and the Fair Association. He was active in the city's German community organizations, such as the Schuetzen Verein, the Turnverein and the Casino Club.\nSee also\n*National Register of Historic Places listings in Bexar County, Texas\n*Recorded Texas Historic Landmarks in Bexar County\nReferences\nExternal links"
    }
  ]
}