{
  "content": [
    {
      "type": "text",
      "text": "# Edward East (clockmaker)\n\nEdward East (1602–1696) was watchmaker and clockmaker to King Charles I of England. He was a notable horologist who succeeded David Ramsay. East was trained as a goldsmith, and he was a founding member of the London Clockmakers Company in 1631. [https://www.metmuseum.org/art/collection/search/194060]\nBiography\nEast was apprenticed in 1618 to Richard Rogers in the Goldsmiths' Company. He was one of the ten original assistants named in the charter of incorporation of the Clockmakers' Company, and quickly took a leading role in its activities. After serving in subordinate capacities for a number of years, East was elected master in 1645, and then again in 1652. He was the only treasurer ever appointed by the Clockmakers' Company. The office of treasurer was created in 1647, in response to an incident where the renter warden, Mr. Helden, refused to give the usual security for the stock of the company. There were two nominees for the office – Edward East and a Mr. Hackett – and East was elected. After East's death, the office was allowed to lapse.\nEdward East lived for some time in Pall Mall, near the tennis court, and attended the king when tennis and other games were being played in the Mall. The king often provided one of East's watches as a prize. It seems that Edward East moved to Fleet Street at a later date, because the king is recorded as purchasing a gold alarm watch from his watchmaker, Mr. East of Fleet Street, in order to give the watch as a gift to a certain royal attendant named Mr. Herbert. East was living on Fleet Street in 1635, as noted by a correspondent of Notes and Queries in the year 1900, who had preserved a document (MS. Return of Strangers within the ward of Farringdon Without) that referred to Edward East as living on Fleet Street, in the parish of St. Dunstan's in the West, and as being the employer of a Dutch man named Elias Dupree. A later residence of Edward East is indicated by a reference to \"Mr. East at the Sun, outside Temple Bar,\" in the London Gazette, 22–26 January 1690.\nThere is no record of Edward East's death, but his will was proved (its validity established) in February 1697.\nClocks and watches\nA large silver alarm clock-watch by Edward East, which was kept at the bedside of Charles I, was presented by the king on his way to execution at Whitehall, on 30 January 1649, to Sir Thomas Herbert. The collections of Alfred Morrison contain a warrant dated 23 June 1649, issued by the Committee of Public Revenue to Thomas Fauconbridge, Esq., Receiver-General, authorizing him to pay \"vnto Mr. Edward East, Watchmaker, the some of fortie pounds for a Watch and a Larum of gould by him made for the late King Charles by directions of the Earle of Pembrooke, by order of the Committee, and deliuered for the late King's use the xviith of January last.\"\nThe Ashmolean Museum at Oxford contains a watch made by East with gold case in the form of a melon, studded all over with turquoises, and with a matching blue enamelled pendant. Two other undoubted specimens of this master's work are in the Clockmakers' Museum. The British Museum holds a watch by East with a tortoiseshell case, dating from about 1640. The Victoria and Albert Museum also possesses a specimen of his work. George Carr Glyn exhibited at the Guelph Exhibition a clock-watch made by East in silver pierced cases. The Wetherfield collection also contained four long-case clocks and one bracket clock by East.\nGallery\nFile:Table or bracket clock MET DP350912.jpg\nFile:Table or bracket clock MET DP349141.jpg\nFile:Clock-watch MET DP-12603-091.jpg\nFile:Watch MET DP-12603-086.jpg\nFile:Watch MET DP337218.jpg\nFile:Watch and key MET DP-12603-047.jpg\nFile:Clock-watch MET 137904.jpg\nReferences\n*This article contains text from  which is now in the Public Domain."
    }
  ]
}