{
  "content": [
    {
      "type": "text",
      "text": "# Edward Lewinski-Corwin\n\n|birth_place = Poland\n|death_date =\n|death_place = New York City, New York, United States\n|alma_mater = Columbia University (PhD)\n|workplaces = New York UniversityColumbia University\n|thesis_title = Workman's Insurance in Belgium\n|thesis_year = 1911\n}}\nEdward Henry Lewinski-Corwin (October 13, 1885 &ndash; May 8, 1953) was a New York City-based author of historical books, Polish activist and physician who worked in the public health sector of the city and state, publishing several reports and other works.\nLewinski was born in Poland, receiving the equivalent of a Bachelor of Arts degree from the  within Warsaw in 1902; he received specialized studies at the University of Warsaw between 1903 and 1904. He received a PhD in \"economic, social, and biological sciences\"  from Columbia University in 1910; his doctoral thesis, ''Workman's Insurance in Belgium'', was published in 1911 by the United States Department of Labor, which distributed around 19,000 copies. Lewinski was appointed executive secretary for the New York Academy of Medicine's Committee on Public Health Relations in May 1911; in the same month, he changed his name to Edward Lewinski-Corwin.\nIn 1912, Lewinski-Corwin organized the Association of Outpatient Clinics, which assisted in developing the first medical standards for dispensaries. He also performed the first comprehensive survey of dispensaries between 1917 and 1918. Around the same time, he published The Political History of Poland, spanning from before the establishment of the Polish state to World War 1. It generally received positive reviews; Florian Znaniecki referred to it as \"[filling], at least provisionally, an important gap\" in English-language literature about Polish history, and Robert J. Kerner called it \"the best of its kind in the English language\", while also pinpointing various flaws with Lewinski-Corwin's views on Ruthenia and Lithuanian influence on Polish history.\nIn 1924, Lewinski-Corwin published The Hospital Situation in Greater New York, leading the United Hospital Fund to establish what would eventually become the Hospital Council of Greater New York. He also formed a bureau to develop practice for convalescent care, and in the same year directed a study of convalescent needs in New York City to formulate standards for convalescent homes in the city. For two years, Lewinski-Corwin also taught a course in institutional management at New York University. In 1928 and 1929, he organized the International Hospital Federation, serving as its general secretary and treasurer. He was elected honorary charter fellow of the American College of Healthcare Administrators in 1934.\nLewinski-Corwin was associate professor of public health practice at Columbia University, and was awarded the Order of Polonia Restituta as well as the Cross of Independence. He died on May 8, 1953, after a six-week illness, at St. Luke's Hospital in New York City. His obituary in the New York Times referred to him as \"an internationally known authority on public health\".\nReferences"
    }
  ]
}