{
  "content": [
    {
      "type": "text",
      "text": "# Edward Livingston (speaker)\n\n| birth_place   = Dutchess County, New York, U.S.\n| death_date    =\n| death_place   = Albany, New York, U.S.\n| residence     =\n| resting_place = Albany Rural Cemetery, Menands, New York\n| party         = Jacksonian, Democrat\n| alma_mater    =\n| parents       = Philip Henry LivingstonMaria Livingston\n| spouse        =\n| children      = 7\n| relatives     = See Livingston family\n}}\nEdward Livingston (April 3, 1796 – June 16, 1840) was an American attorney and politician.  He served as Clerk and Speaker of the New York State Assembly.\nEarly life\nHe was born in Dutchess County, New York, the son of Philip Henry Livingston (1769–1831) and Maria Livingston (1770–1828). His paternal uncle was Edward Philip Livingston (1779–1843), the  Lieutenant Governor of New York, and his maternal uncles were Henry Walter Livingston (1768–1810), a U.S. Representative, and Robert Fulton (1765–1815), an engineer who developed a successful steamboat that ferried passengers from New York City to Albany and back again and invented the first practical submarine in history.\nHis paternal grandfather was Philip Philip Livingston (1741–1787), who was born in colonial New York and had settled in Jamaica, West Indies prior to the Revolutionary War, therefore remaining a British subject. Philip Philip's father, Philip Livingston (1716–1778), supported the patriot cause prior to the revolution, and as a delegate to the Second Continental Congress signed the Declaration of Independence. He was married to Christina Ten Broeck (1718-1801), the sister of Abraham Ten Broeck (1734-1810) who was married to Elizabeth Van Rensselaer, sister of Stephen Van Rensselaer II, patroon of Rensselaerwyck.\nHis maternal grandparents were Walter Livingston (1740–1797), the 1st Speaker of the New York State Assembly, and Cornelia Schuyler (1746–1822), the granddaughter of Pieter Schuyler.  Walter was the son of Robert Livingston (1708–1790), 3rd Lord of Livingston Manor.  His paternal great-grandfather, Philip was the younger brother of his maternal great-grandfather, Robert.\nCareer\nHe was Clerk of the New York State Assembly in 1822, 1823, 1824, 1826 and 1827, following Dirck L. Vanderheyden and serving from January 2, 1822, until January 4, 1825, when Horatio Merchant became Clerk.  Livingston again served, replacing Merchant, beginning on January 3, 1826, until January 1, 1828, when Francis Seger, who later became a member of the New York State Senate, took over.\nLivingston served as District Attorney of Albany County from June 14, 1825, to March 27, 1838.\nSpeaker of the New York Assembly\nHe was a member of the New York State Assembly representing Albany Co., in 1833, 1835 and 1837, and was Speaker in 1837, serving alongside Charles Humphrey.\nAt the conclusion of the session where he was Speaker and which was his last public office, the House presented their thanks to Livingston \"for the able, dignified and impartial manner in which he has presided over its deliberations.\" In response, Livingston replied:\nThe flattering compliment which you have awarded to my efforts to subserve the public interests, by unanimously declaring that my conduct as your presiding officer merits approbation, is the reward for which I have labored, and its bestowment will ever be cherished by me with grateful recollections.\nThe time of this session has been engrossed with much business of a local nature, and with many propositions and laws of a general character, in the disposition of which, questions of great public concernment, were involved.  That we have had an active agency in maturing and passing many laws of a local character, which the wants of the community demanded, cannot be denied.  Upon questions in which the people at large have expressed an interest, the Assembly has pronounced its judgment upon most, if not all the leading topics to which their attention has been called.  More of public law than is usually adopted at any session of the Legislature, will be found to have passed into enactments; whether for good or evil, will be determined by our constituents, to whose judgment, I doubt not, we are all alike willing to submit with perfect cheerfulness.  As the diversified claims of our large population for legislative aid annually increase, it is a matter of congratulation that we are enabled to adjourn at an earlier period than the Legislature of last year.  This is a high testimony in favor of your industry and devotion to the public business.\nIn discharging the duties of the station to which your partiality called me, I have been much aided by your strict attention to business, and by your liberal support of the Chair.  To your indulgence in overlooking the many errors into which I may have been betrayed, I feel much indebted; and I assure you that it has been my constant study, in return for favors received, to endeavor to discharge with strict impartiality the delicate and difficult duties confided to me.  In a few moments we shall part, probably never again to assemble together within these walls.  This thought excites painful emotions in my bosom; and my regrets at parting deepen when I cast my eyes on your familiar faces, and perceive that your kind sensibilities are in unison with mine.  I trust that a protecting Providence will watch over and restore you to your friends in health; and that your further progress in life may be happy, will ever be one of the choicest wishes of my heart. Fellow-members, farewell.\nPersonal life\nIn 1819, he was married to Sarah Ray Lansing (1797–1848), the daughter of Cornelia (née Ray) Lansing (1757–1834) and John Ten Eyck Lansing, Jr. (1754–1829), the former Speaker of the New York State Assembly and Chancellor of New York from 1801 to 1814.  Her sister, Jane Lansing (1785–1871) was married to U.S. Representative Rensselaer Westerlo (1776–1851), and sister Frances Lansing (1791–1855) was married to Jacob Livingston Sutherland (1788–1845). Together, they were the parents of:\n* Maria Lansing Livingston, who died unmarried\n* Cornelia Lansing Livingston (1821–1854), who died unmarried\n* Frances \"Fanny\" S. Livingston, who died unmarried\n* Sarah Lansing Livingston (1824–1843), who died unmarried\n* Philip Henry Livingston (1828–1913), who died unmarried\n* John Lansing Livingston (1830–1904), who died unmarried in Paris, France, and was a member of the Union Club.\n* Edward Livingston (1834–1906), who was prominent in New York Society and a member of the Union Club and the Metropolitan Club and lived at 17 East 34th Street, and who married Fanny Hazeltine, of Boston.\nLivingston died in Albany, New York, on June 16, 1840.  He was buried at Albany Rural Cemetery.\nDescendants\nThrough his son, Edward Livingston, he was the grandfather of Clarisse Hazeltine Livingston, who made her debut in 1887, and Edward Livingston, Jr. (b. 1871), who graduated from Harvard in 1893 and Columbia University Law School in 1896.\nReferences\n;Notes\n;Sources\n*[https://archive.org/details/bub_gb_Gm04AAAAMAAJ/page/n402  History of Political Parties in the State of New-York]. John Stilwell Jenkins.  (Alden & Markham, Auburn NY, 1846)\n*[http://www.iment.com/maida/familytree/henry/genealogy/robert2.htm#gilbert Family tree].\n*[https://books.google.com/books?id=E3sFAAAAQAAJ&pg=PA288 The New York Civil List]. Compiled by Franklin B. Hough (Weed, Parsons & Co., Albany NY, 1858)"
    }
  ]
}