{
  "content": [
    {
      "type": "text",
      "text": "# Edward Wong\n\n| birth_place        = Washington, D.C., U.S.\n| death_date         =\n| death_place        =\n| occupation         = Journalist\n| status             =\n| title              =\n| education          = University of Virginia (BA)University of California, Berkeley\n| family             =\n| spouse             =\n| children           =\n| parents            =\n| relatives          =\n| credits            =\n| URL                =\n| module             =\n| signature         = Edward Wong signature 2025.jpg\n}}\nEdward Wong (born November 14, 1972) is an American journalist. He is a diplomatic correspondent for The New York Times.\nEarly life and education\nWong was born on November 14, 1972, in Washington, D.C. He grew up in Alexandria, Virginia.\nWong holds a BA (summa cum laude) in English literature from the University of Virginia (1994), a joint MA in journalism and a MA in international and area studies from the University of California, Berkeley (1999).\nWong studied Mandarin Chinese at Beijing Language and Culture University, National Taiwan University, and Middlebury College.\nCareer\nIn October 1999, Wong joined The New York Times  (NYT). For four years he worked on the Metro, Sports, Business and Foreign desks. From November 2003 to 2007 he covered the Iraq War. From 2008 to 2016, he reported from China. He was the NYTs Beijing bureau chief. Wong has taught international reporting as a visiting professor at Princeton University and UC Berkeley. He has been a Nieman Fellow at Harvard University.\nAwards\nIn 2006, while a reporter for the NYT, Wong received a Livingston Award in the Excellence in International Reporting category for his coverage of the Iraq War. He was a member of the NYT team that was a finalist for the Pulitzer Prize for International Reporting.\nIn November 2024, Wong received Georgetown University Institute for the Study of Diplomacy's Edward Weintal Prize for Distinguished Reporting on Foreign Policy and Diplomacy.\nPublications\nbookstore in June 2024]]\nBooks\n*\nReferences"
    }
  ]
}