{
  "content": [
    {
      "type": "text",
      "text": "# Edward Meneeley\n\nEdward Meneeley (December 17, 1927, in Wilkes-Barre, Pennsylvania, United States – December 29, 2012, in Weatherly, Pennsylvania) was an American artist who created paintings, sculptures, and prints.\nLife\nThe only child of Edward Sr. and Ludwina Halter, Meneeley joined the Navy shortly after the Japanese invasion of Pearl Harbor. He spent most of World War II as a medic caring for paraplegics in Riverside, California, where he befriended Marlon Brando during the filming of The Men, which took place on his ward. Upon discharge, Meneeley returned to Wilkes-Barre and attended the Murray School of Art and began making frequent trips to New York City. He was then recalled for the Korean War, where he served as a Navy photographer at the Philadelphia Naval Hospital. When released, Meneeley staged two solo exhibitions at the Donovan Gallery in Philadelphia before moving to Manhattan to attend New York's School of Visual Arts on his second installment of the GI Bill.\nWork\nA three-time recipient of grants from the Pollock-Krasner Foundation, as well as the National Endowment for the Arts and British Arts Council, Meneeley staged his first one-person exhibit in New York in 1962. Prior to making his mark on the arts community as an artist, Meneeley was best known for his archival photographic record of the works of others, first as a staff photographer of Contemporary Slides and later as owner of Portable Gallery Press and ESM Documentations.\nFrom 6 December 1981–3 January 1982, the Sordoni Art Gallery, Wilkes College, Wilkes-Barre presented Edward Halter Meneeley Painting & Sculpture.\nHis last four decades included several solo and group shows in New York, London, and other major cities including Athens, Edinburgh, Atlanta, and Wilmington, North Carolina.\nMeneeley cut his teeth in the world of abstract expressionism and the New York School beginning in his early adulthood in the 1950s. It was then when he was flavored by rapport with the likes of Franz Kline and Frank O'Hara through their artistic exchanges at the legendary Cedar Tavern and the Artists' Club.\nHe visited the studios and became friends with Willem de Kooning, Helen Frankenthaler, Hans Hofmann, Jasper Johns, Robert Motherwell, Robert Rauschenberg, Theodoros Stamos, and Andy Warhol, among others.\nHis first hand experience with the New York School was furthered by his serving as archival photographer for major exhibits at the Museum of Modern Art under the supervision of Alfred Barr and Dorothy Miller, as well as major shows at such cutting edge galleries as Leo Castelli, Andre Emmerich, Alan Stone, Eleanor Ward, Betty Parsons, and Martha Jackson.\nIn 2010, he was given a solo exhibition within the Cathedral of Saint John the Divine, New York.\nMeneeley died on December 29, 2012, at the age of 85.\nCollections\n* Auckland Art Gallery, Auckland, New Zealand\n* Museum of Modern Art, New York, New York\n* Tate, London, England\n* Victoria and Albert Museum, London, England\n* Whitney Museum, New York, New York\n* Worcester Art Museum, Worcester, Massachusetts\nReferences\n* Castelman, Riva. \"Printed Art: A View of Two Decades\" Museum of Modern Art Catalog\n* Endick, Kenneth. (November 28, 1997) \"Exhibit of this Master Artist Belies His Age\" The Express-Times\n* Fallon, Brian. (November 24, 1976) \"Ed Meneeeley at Dowling Street\" The Irish Times\n* Glueck, Grace. (November 21, 1965) \"Instant Art\" New York Times\n* Heyer, Marigrace. (May 26, 2005) \"Art Show Features Noted Local\" Times News\n* Kenedy, R.C. (October 1971) Art International\n* Melville, Robert. (September 3, 1971) \"Jelly Babies\" New Statesman\n* Morgan, Roy. (October 18, 1989) \"Misericordia Boasts a Striking Art Show\" The Times Leader\n* Outwater, Myra. (October 9, 1999) \"Meneeley Show an Intriguing Testament to Travels, Friends, and Experiences\" The Morning Call\n* Thomas, Robert. (April 1971) Art and Artists\n* Wolff, Theodore. (November 24, 1981) \"The Many Masks of Modern Art\" The Christian Science Monitor\n* Wolff, Theodore. (February 10, 1982) \"Fine Edward Meneeley Show\" The Christian Science Monitor\n;Notes\nExternal links\n* [http://www.edwardmeneeley.com/ www.edwardmeneeley.com]\n*Obituary - [https://web.archive.org/web/20140531090200/http://pennsylvania.obituaries.funeral.com/2012/12/30/edward-meneeley-jr/]"
    }
  ]
}