{
  "content": [
    {
      "type": "text",
      "text": "# Edward Elisha Phelps\n\n}}\n| birth_place     = Peacham, Vermont, US\n| death_date      =\n| death_place     = Windsor, Vermont, US\n| burial_place    =\n| occupation      = Physician\n| awards          =\n| spouse          =\n| children        =\n| education       = Yale School of Medicine\n| signature       =\n| party           =\n}}\nEdward Elisha Phelps (April 24, 1803November 26, 1880) was an American medical doctor.\nEarly life and education\nEdward Elisha Phelps was born in Peacham, Vermont on April 24, 1803. His father, Dr. Elisha Phelps, removed to Windsor soon after his birth.\nHe was a student for two years in medicine with Nathan Smith, then a resident of New Haven, Connecticut, but early in life settled in Cornish, New Hampshire, and at Hanover. He graduated in medicine at Yale, in the class of 1825.\nHealth and personal life\nImpaired health led him to go South for a time, during which he used his mathematical knowledge acquired at Norwich, assisting in the survey of the Dismal Swamp Canal, also following up on his studies in natural science, particularly in botany. In 1828, he commenced his professional life in Windsor, when on September 4, 1830, he married Phoebe Foxcroft Lyon, of Boston, Massachusetts. Both her and their daughter outlived him.\nProfessional career\nIn 1835 he was elected to the Professorship of Anatomy and Surgery in the medical school connected with the Vermont University, at Burlington, Vermount. This chair he held for two years.\nHe received from the Vermont University the honorary degree of A. M. in 1839.\nIn 1841 he was appointed Lecturer on Materia Medica, Medical Botany and Medical Jurisprudence, in Dartmouth Medical College.\nIn 1842 he was chosen Professor of Materia Medica and Therapeutics.\nIn 1849 he was transferred to the chair of Theory and Practice of Medicine and Pathanatomy, then vacated by Prof. Joseph Roby.\nHe retired from the work of teaching in the College and became Professor Emeritus of Theory and Practice of Medicine in 1871.\nAfter 1871 he occupied somewhat in constructing and filling the Museum of Pathological Anatomy, the money for which purpose was furnished by the gift his friend Edwin W. Stoughton, as an evidence of his appreciation of the doctor's services to himself, and of his professional eminence, and that he might aid others to attempt to reach like eminence.\nMilitary service\nOn the breaking out of the American Civil War, his services were early sought by his native State, in securing proper persons to act as medical officers for the volunteer regiments sent out by the State. He was a member of the State Board of Examiners of Surgeons during the war.\nIn the fall of 1861 he went to Washington, and presented himself for examination and appointment as Surgeon in the United States Army. He received an appointment, and served on the staff of the Commander of the First Brigade of Vermont Volunteers during the winter of 1861-1862, and nearly or quite through the Peninsular Campaign in the spring and summer of 1862.\nImpaired health compelled his return to Vermont, where he was appointed to the medical charge (Brigadier Surgeon) of the Camp and the Military Hospital at Brattleboro. This hospital was built up under his own most careful and persistent attention, and it became one of the most perfectly arranged economically conducted hospitals in the country.\nThe large percent of recoveries in it, due to the skill with which he administered it, combined with its healthful situation, gave it and him great and well deserved credit. Near the close o the war he was transferred to a hospital in Kentucky, from which he returned to his home and his practice in Windsor, when his country no longer needed his services.\nCharacter\nIn his prime, Dr. Phelps was a man possessed of great physical and mental vigor. During his lectures at Hanover he would often ride from Windsor to Hanover in the morning, deliver his lecture, and return by a wide circuit for consultation, and attend to a large practice at home before retiring at night, and he would continue thus for weeks. He was a very keen observer and a careful reasoner.\nHe was esteemed in his professional work, by his patrons, for his skill and scientific attainment rather than for his use of the manners and arts which are calculated to please the fancy and prejudice. For these things he cared less than nothing. His professional and scientific study was most untiring and long continued.\nAccomplishments\nHe accomplished a great deal in the way of work with the microscope – an amount which many not half as much occupied by professional work would think it impossible to do. He occupied many hours of the last days of his life, when confined to his room and his bed, in perfecting his microscopial preparations.\nHe read many works in the German language before the demand for German works became so great as to call for their translation and publication in English, and quoted them so largely in his lectures that he was playfully named by the students \"Old Rokitansky.\" (Baron Carl von Rokitansky) He was for many years universally esteemed as the most thoroughly learned man in his profession, in this portion of New England at least.\nLast years\nWith all his learning and love for scientific acquisition, he left nothing in writing, either as a book or writings for periodicals, if except a few papers prepared for the Vermont Journal on the subject of Temperance in its scientific aspects. His last year was largely occupied with thoughts regarding the life to come, and he died with a full belief and acceptance of the truth of the Christian religion.\nEdward Elisha Phelps, M.D. LL.D., died at his residence in Windsor, Vermont, on Friday, November 26, 1880.\nReferences\nSources\n*William Biddle Atkinson, [https://books.google.com/books?id=hlvCXW6S1sEC&pg=PA84 The Physicians and Surgeons of the United States]\n*\n*"
    }
  ]
}