{
  "content": [
    {
      "type": "text",
      "text": "# Edward Ward (cricketer)\n\n|         death_place = Gorleston-on-Sea, Norfolk, England\n|             batting = Right-handed\n|             bowling = Left-arm roundarm fast\n|                role =\n|              family =\n|               club1 = Cambridge University\n|               year1 = 1868–1871\n|               club2 = Marylebone Cricket Club\n|               year2 = 1871\n|             columns = 1\n|             column1 = First-class\n|            matches1 = 11\n|               runs1 = 30\n|            bat avg1 = 2.30\n|           100s/50s1 = –/–\n|          top score1 = 5\n|         deliveries1 = 1,693\n|            wickets1 = 37\n|           bowl avg1 = 14.81\n|            fivefor1 = 1\n|             tenfor1 = –\n|       best bowling1 = 6/29\n|  catches/stumpings1 = 5/–\n|                date = 25 January\n|                year = 2023\n|              source = https://www.espncricinfo.com/cricketers/edward-ward-22727 Cricinfo\n}}\nEdward Ewer Ward (16 July 1847 – 25 March 1940), born Edward Ewer Harrison, was an English clergyman and a cricketer who played in 11 first-class cricket matches for Cambridge University and the Marylebone Cricket Club (MCC) between 1868 and 1871. He was born at Timworth, Suffolk and died at Gorleston, Norfolk. He changed his name from \"Harrison\" to \"Ward\" in August 1868.\nWard was educated privately at Bury St Edmunds and at Jesus College, Cambridge. As a cricketer, he was a right-handed tail-end batsman and a left-arm bowler: sources disagree about whether he was a fast bowler or a medium-paced one, but agree that he bowled in the round-arm style. He played in three matches for Cambridge University in 1868 as \"E. E. Harrison\" without making much impact, and was then not picked for any first-team games at all in 1869. He returned to the university team in 1870 and took seven wickets in his first game, against the MCC. That led to his selection for the 1870 University Match against Oxford University, a game that has been widely known as \"Cobden's Match\" through the feat of the Cambridge bowler Frank Cobden, who took the last three Oxford wickets in three balls – a hat-trick – to win the game for Cambridge by just two runs. Ward was just as influential in the Cambridge victory, his six wickets for 29 in the Oxford second innings, in 32 four-ball overs, being the best bowling performance of his first-class cricket career. He returned to the Cambridge side in 1871, but was less effective, and the University Match of that year, in which he failed to take any wickets, was his last first-class match. He later played minor cricket for Suffolk County Cricket Club.\nWard graduated from Cambridge University with a Bachelor of Arts degree in 1872 and in the same year he was ordained as a Church of England deacon, becoming a priest two years later. He had a highly itinerant clerical career, serving parishes in Sussex, Suffolk, Norfolk, Northumberland, Yorkshire and Staffordshire, retiring in 1931.\nReferences\nExternal links\n*"
    }
  ]
}