{
  "content": [
    {
      "type": "text",
      "text": "# Edward Aburrow Sr\n\n| birth_place = Hambledon, England\n| death_date  =\n| death_place = Slindon, Sussex, England\n| batting     = Right-handed\n| bowling     = Right arm underarm\n| role        = Bowler\n| club1       = Slindon Cricket Club\n| year1       = c.1742 – c.1744\n| club2       = Sussex\n| year2       = c.1744\n| club3       = Richard Newland's XI\n| year3       = c.1744\n| club4       = England\n| year4       = c.1744 – c.1751\n| date        = 25 September\n| year        = 2022\n| source      =\n}}\nEdward Aburrow Sr. ( – 15 April 1763), also known as Cuddy, was an English cricketer of the mid-Georgian period who played for Slindon and Sussex under the patronage of Charles Lennox, 2nd Duke of Richmond. He also represented various England teams. A resident of Slindon, Sussex, he was a contemporary of the three Newland brothers – Richard, John and Adam – who were his colleagues in the Slindon team. Outside of cricket, Aburrow Sr was a tailor in Slindon but he became involved in smuggling. He was jailed in 1745, though he turned King's evidence to gain parole. He relocated to Hambledon, Hampshire and his son Edward Aburrow Jr, also known as \"Curry\", became a regular Hambledon player.\nAburrow Sr was an outstanding bowler who is believed to have been right-handed, but his style and pace are unknown. Like all bowlers of the time, he used an underarm action, and delivered the ball all along the ground.}} Although there are tentative mentions in 1742, Aburrow Sr is first definitely recorded by name in the 1744 season and played until at least 1751.\nCricket career\nEdward Aburrow Sr is often called \"Cuddy\" in sources. He relied for his cricketing opportunities on the 2nd Duke of Richmond, who had captained his own team for many years until he broke a leg in 1733. No longer able to play himself, Richmond channelled his enthusiasm for cricket into patronage of Slindon Cricket Club; the village of Slindon bordered on his Goodwood House estate. Aburrow was a member of Slindon's team as a contemporary and colleague of the three Newland brothers – Richard, John and Adam.\n1742–1743\nThere are references in 1742 match announcements to \"the Sussex Man from Slending\" and \"the noted bowler from Slendon\". Richard Newland was the most famous Slindon player, but as a batting all-rounder. The team's most noted bowler was actually Aburrow. At the end of that season, Slindon played two eleven-a-side matches against London Cricket Club at the Artillery Ground in Finsbury, London, but lost them both, the second by the huge margin of 184 runs. F. S. Ashley-Cooper, in a brief description of Slindon village at the time, says it was most famous for its cricket and \"its chief players were the Messrs Newland – Adam, John and Richard – and Cuddy (Aburrow)\".\n1744\nThe first definite reference in contemporary records to Aburrow by name is in the 1744 season. On 2 June 1744, a combined Surrey and Sussex team played against London at the Artillery Ground. Surrey and Sussex won by 55 runs and the match is now famous for the world's oldest known match scorecard, which lists individual scores but no details of dismissals. London, whose team included given men, was the host club and their opponents were all from the counties of Surrey and Sussex. The visitors batted first and scored 102. London replied with 79, so Surrey and Sussex had a first innings lead of 23. In their second innings, Surrey and Sussex reached 102/6 and then apparently declared their innings closed, although the Laws of Cricket did not allow for declarations in 1744. In the final innings, London needed 126 to win but were all out for 70. Aburrow, whose name is first in the batting order, scored 5 runs in the first innings and 0 in the second. The scorecard was kept by the Duke of Richmond at Goodwood House.\nTwo weeks later, Aburrow played for England against Kent at the Artillery Ground. The match was commemorated in Cricket, An Heroic Poem (1745) by James Love. Kent captain Lord John Sackville is reported to have held a remarkable catch in the second innings to dismiss Richard Newland, who made the top two scores in the match with 18* and 15. Aburrow scored 0 and 2. He apparently took no wickets.}} Sackville's catch may have been the defining moment of the match, which Kent won by one wicket after John Cutbush and William Hodsoll managed to score the remaining few runs with nine wickets down.\nTowards the end of the season, Slindon came into the limelight. They played London at the Artillery Ground on 10–11 September and won by an unknown margin. In celebration, they issued a famous challenge to other clubs by offering to play against \"any parish in England\". As far as is known, the only acceptances came from Addington and Bromley. The match against Addington commenced on the 12th but it was delayed by rain. Slindon led by two runs at close of play but there are no further reports. The match against Bromley was scheduled for the 14th but, again, there are no reports and so it may be assumed that both matches were rained off. Aburrow and Richard Newland are the only players known to have taken part in the London and Addington matches.\nOn 17 September, there was a single wicket \"threes\" match at the Artillery Ground between teams led by Robert Colchin (aka \"Long Robin\") and Richard Newland. Colchin had Val Romney and John Bryant on his side; Newland had Aburrow and Joe Harris. Aburrow was a late replacement for John Mills of Horsmonden, described as \"the famous Kent bowler\". The stake was 200 guineas and the players were described as the \"best in England\". The result, however, is unknown.\nLater career\nAburrow is not mentioned in the 1745 sources. He was jailed in that year for assisting a gang of smugglers (see below). He continued to play cricket after he was released and the last known references to him are from the 1751 season, the year after Richmond had died. Aburrow played in two matches for England against Kent and was on the winning team both times, in the first by 9 runs and in the second by an innings and 9 runs. These were also the last two known matches of Richard Newland's career.\nCriminal activity\nDavid Underdown points out that, like many Sussex villages at the time, Slindon was a violent place with strong smuggling connections. Aburrow was both the village tailor and the cricket team's best bowler, but even so he gained a reputation for smuggling. He was jailed in 1745 after he was found guilty of bearing arms whilst landing \"prohibited goods\" at Elmer's Sluice on the Sussex coast. He spent time in Horsham gaol. However, he turned King's evidence and earned a parole. In 1747, Aburrow married a Slindon girl called Elizabeth Coot. Their eldest son, Edward Aburrow Jr was born at Slindon in 1750 and, soon afterwards, the family relocated to Hambledon, Hampshire. Underdown surmises that their departure may have been necessary because Aburrow Sr, as an informer, could have been threatened with reprisals.\nRichmond's patronage of Slindon presents a paradox because most of the villagers were Roman Catholics and the most influential family there, the Kempes, were Tories. Richmond was both Anglican and \"a passionate Whig\". Another converse arises from Richmond's vehement campaign against smuggling. His main target was the notorious Hawkhurst Gang, but he showed similar intolerance towards Aburrow, whose family he described as \"notorious villains\" (one of Aburrow's brothers had been hanged), even though Aburrow was his best bowler at Slindon.\nNotes\nReferences\nBibliography\n*\n*\n*\n*\n*\n*\n*\n*\n*\nFurther reading\n*  The list includes eleven-a-side matches known to have been played through the span of Aburrow's career.\n*\n*\n*\n*\n*\nExternal links\n* [https://www.slindon.com/history/cricket-in-slindon/ Cricket in Slindon]. Slindon Village."
    }
  ]
}