{
  "content": [
    {
      "type": "text",
      "text": "# Edward Dubroski\n\n| birth_place        = Wilkes Barre, Pennsylvania, U.S.\n| death_date         =\n| death_place        =\n| other_names        =\n| spouse = Genevieve\n| children = 2\n| occupation         = Railway engineer, labor leader\n| known_for          = President of the Brotherhood of Locomotive Engineers\n}}\nEdward E. Dubroski (born c. 1937) is an American railway engineer and union official who served as the president of the Brotherhood of Locomotive Engineers.\nEarly life\nDubroski was born in Wilkes-Barre, Pennsylvania circa 1937. Dubroski served in the United States Army and Air National Guard. During the Korean War, Dubroski was stationed in Allied-occupied Germany.\nCareer\nIn 1955, he joined the Central Railroad of New Jersey as a track worker. In 1960 he became a fireman and in 1963 an engineer with the Central Railroad.\nHe joined the Brotherhood of Locomotive Firemen and Enginemen (BLFE), and held several posts in this union.\nDubroski resigned from the BLFE and in 1970 was elected legislative representative of BLE Division 157. In 1974, he became BLE General Chairman of the General Committee of Adjustment of the Central Railroad of New Jersey. In 1980, he became chairman of Conrail District \"G\", and in 1983 he became Conrail Alternate General Chairman.\nIn 1986, at the Brotherhood of Locomotive Engineer convention, Dubroski was elected to the position of vice president, assigned to the railroads on the east coast of the United States; Amtrak; Conrail; Septa; Metro North; Long Island Rail Road; the New York, Susquehanna and Western Railway; and Delaware and Hudson Railway. Dubroski was elected to a five-year term. During his tenure, he established a new committee called the Brotherhood of Locomotive Engineer Safety Task Force in a joint venture with the National Transportation Safety Board. The team was responsible for traveling to train accidents across the country to determine the cause of the accident and to formally make safety recommendations to prevent future accidents and improve railroad safety.\nIn 1991, Dubroski was elected general secretary and treasurer of the BLE. Dubroski became the first vice president of the Brotherhood of Locomotive Engineers when Clarence Monin was elected president in 1996. In August 1999, Dubroski took over from Monin, who left office after losing a recall vote by a narrow margin. In a separate ballot, Dubroski was elected to succeed Monin as head of the 55,000-member union by about 80% of the vote.\nDuring his tenure there was ongoing tension with the rival United Transportation Union (UTU). On July 23, 2001, the BLE and UTU announced a plan to merge, subject to ratification by their members.\nIn September three officers of the BLE obtained a court injunction to stop the count of the ratification ballot. A few days later, the UTU launched an attempt to be recognized as representing workers of the Kansas City Southern Railway, replacing the BLE.\nAt the Seventh Quinquennial International Convention of the BLE in Miami on 27 September 2001 Dubroski lost the run-off election for the post of International President to Don Hahs, who won by 417 to 211 votes.\nSince his retirement, Dubroski has become active in civic and community work. He has served on the Clark, New Jersey Environmental Commission for almost 10 years and won the New Jersey State Jefferson Award three times for his bravery and public service. The first, was in 2018, for his environmental stewardship for railroads. Dubroski effectively campaigned and won the right to remove and eliminate polychlorinated biphenyl from locomotive engines, roundhouses, and the soil that surrounds train yards. Once in the environment, PCBs can be transported long distances because they bind strongly to soil and sediment.  For that reason, they also remain in the environment for long periods of time. This potential measure alone helped to save numerous lives. In 2019, Dubroski won the New Jersey Jefferson Award for a second time in consecutive years for Leadership and Innovation due. He award recognized his work with the United States Senate and Congress to establish the B.L.E. Safety Task Force, which collaborated with the National Transportation Safety Board to investigate train accidents throughout the United States and make recommendations to improve safety.\nPersonal life\nDubroski and his wife, Genevieve, have two children and two grandchildren. They live in Clark, New Jersey.\nReferences\nCitations\nSources\n*\n|title=BLE installs new international president at Miami convention|date=28 September 2001|journal=Progressive Railroading\n|url=http://www.progressiverailroading.com/rail_industry_trends/news/BLE-installs-new-international-president-at-Miami-convention--5426 |accessdate=2014-03-03}}\n*|url=https://www.ble-t.org/pr/newsletter/0899newsletter/page1.html\n|title=Dubroski new BLE President|journal=BLE News|accessdate=2014-03-03}}\n*|url=https://www.joc.com/dubroski-wins-recall-vote-monin-journal-commerce-staff_19990802.html\n|title=Dubroski wins in Recall Vote of Monin |journal=Journal of Commerce|year=1999|accessdate=2014-03-03}}\n*|url=http://www.nwitimes.com/uncategorized/in-brief/article_9a81762e-c22f-5484-ad5f-3845dddf1824.html\n|title=In Brief|journal=The Times of Northwest Indiana|date=5 August 1999 |accessdate=2014-03-03}}\n*|url=http://www.bmwe.org/journal/2001/10oct/A3.htm\n|title=Judge Impounds BLE / UTU Merger Ballots|accessdate=2014-03-03|journal=BMWE Journal|date=September–October 2001}}"
    }
  ]
}