{
  "content": [
    {
      "type": "text",
      "text": "# Edward Carey (businessman)\n\n| death_place = Edmonton, Alberta, Canada\n| profession= Merchant, prospector, fur trader\n| resting_place=\n| children=at least 2\n}}\nEdward Francis Carey Sr. (c. 1832 &ndash; September 10, 1908) was a Canadian gold prospector, fur trader, and merchant. He was also a politician in Alberta, Canada, serving briefly as a municipal councillor in Edmonton.\nCarey was born in Upper Canada in 1832. Intrigued by the opportunity to acquire a fortune in gold, he was quickly drawn to the California Gold Rush, and later to British Columbia, where he prospected for gold along with his partner, Bill Cust. In the 1860s, the duo made major gold discoveries in the Parsnip River and in Peace River, leading to gold rushes when news spread of the discoveries. Carey later went into the fur trade, establishing himself at Peace River, and later, Lac la Biche. After spending a couple years in the fur trade, he went into the general merchant business, establishing stores in Manitoba, and later in Edmonton, North West Territories, where he would move to in 1882. Carey operated the first store in the town, as well as a cattle business along with fellow merchant, John Norris, until his retirement in the late 1890s. After his retirement, he lived quietly in Edmonton in declining health, until his death in 1908. Regarded as one of the pioneer citizens of Edmonton and earliest settlers of Western Canada, Carey would later be interred at the Edmonton Cemetery.\nEarly life and prospecting career\nCalifornia and British Columbia\nCarey was born in London, Ontario, in 1832, of Irish ancestry. After completing his education in the area, he received word of the California Gold Rush, and intrigued by the possibility of a fortune, Carey headed there in 1849 to pan for gold. Carey remained there until around 1858, gradually moving back north and ending up in the Fraser Valley area, where he partnered up with a fellow prospector, William (Bill) Cust (1823&ndash;1908), in search of gold in the Fraser River. It was also in British Columbia where Carey and Cust co-discovered the Omineca Gold Rush, when in 1861, Carey struck gold along the Parsnip River while prospecting in the area. Along with Cust, he later operated a trading post at Rocky Mountain Portage.  In 1862, the duo of Cust and Carey, along with Pete Toy, another prospector from the Fraser Valley area, headed further north, to Peace River Country.\nPeace River\nAt Peace River, Carey made the initial discovery of gold in Peace River; thereafter along with his partners, they made $50 a day for about six weeks, until they were forced to leave the area due to a lack of resources. Following their departure from the area, however, news spread to several mining camps around the area, precipitating a gold rush. Shortly after leaving the gold industry, Carey, who had remained in the Peace River area, went into the fur trading business, along with his prospector partner Bill Cust and three other locals. The partnership continued for at least four years, when one of the partners, Mr. Brennan, absconded with the company's profits of four years worth of furs during a trip to Chicago. He later moved to the Lac La Biche area, where he again went into the fur trade. In 1874, he entered in a partnership with an American businessman, Mr. Johnson, whom he met when he was travelling from Winnipeg to Edmonton. They purchased stores in the Assiniboia area and engaged in the fur trade in the Lesser Slave Lake area.\nCareer in Edmonton\nCarey moved to permanently settle in Edmonton around 1882, where he purchased land that would later become the neighbourhood of Abbotsfield. In Edmonton, he established a general store on Hardisty Avenue along the trail connecting Edmonton with St. Albert, which was the first privately owned store in the town. He would later partner with another businessman, John A. Norris, and enter the cattle ranching business, importing cattle from as far as Montana. Norris later joined Carey as a partner in his general store, which was known as Norris & Carey, selling mainly groceries and hardware. In 1892, Carey was elected as an alderman to Edmonton's first Town Council, finishing third of fourteen candidates (the top six were elected) with 124 votes.  He did not seek re-election in 1893, and did not engage in politics thereafter. He was also an early member of the Edmonton Board of Trade, serving as its inaugural vice president in 1889. In 1897, he retired from his business interests and returned to his Edmonton home.\nDeath and legacy\nCarey died September 10, 1908, at his home in Edmonton, less a month after the death of his former prospecting partner Bill Cust. He had been in poor health since suffering a stroke that rendered him paralysed 14 years earlier. His funeral was held at the First Presbyterian Church in Edmonton; it was attended by many local dignitaries and notables including James Ross, Henry William McKenney, Daniel Maloney, William Antrobus Griesbach, Daniel R. Fraser, as well as former mayors, Matthew McCauley, Cornelius Gallagher, and sitting Mayor, John Alexander McDougall. Prior to the service, a procession to the church was led by the Edmonton Citizens' Marching Band. He was interred at the Edmonton Cemetery on September 14. He was survived by a son, Edward, of Andrew, Alberta, and a daughter, Mrs. George Hutton, of Edmonton. Regarded as a pioneer citizen of Edmonton and Western Canada, an obituary in the Edmonton Bulletin described Carey as a \"genuine old timer, a distinct species of the race, one of nature's noblemen, who would do anything in the world for a friend and who scarcely knew what it was to have an enemy.\"\nA series of roads, Carey Crescent, Carey Way, Carey Lane, and Carey Close, all located within the Cameron Heights neighbourhood in Edmonton (named after fellow council member John Cameron) are named for Edward Carey.\nReferences"
    }
  ]
}