{
  "content": [
    {
      "type": "text",
      "text": "# Edward Alleyn\n\n|death_place            = London, England\n|years_active           = 1583–1604\n|spouse                 =\n|\n}}\n}}\nEdward Alleyn (; 1 September 156621 November 1626) was an English actor who was a major figure of the Elizabethan theatre and founder of the College of God's Gift in Dulwich.\nEarly life\n, sculpted by Louise Simson, 2005]]\nAlleyn was born on 1 September 1566 in Bishopsgate, London; or so it was recorded in the Biographia Britannica as a product of Alleyn's own writing. Alleyn does record his birth date in a diary several times but does not distinctly identify his birthplace as Bishopsgate. In the St. Botolph parish registers it is recorded that he was baptized on the day after his birth. He was born a younger son of Edward Alleyn with two brothers named John, and William. His father was an innkeeper and porter to Queen Elizabeth I and his mother, Margaret Townley, was the daughter of John Townley. His mother's link to the Lancashire Townley family is somewhat of a mystery. Alleyn said she was the daughter of John Townley of Townley but the claim does not easily fit with the available information on the Townley family tree. Regardless of this, the road that passes Alleyn's School was named after her in 1884. He was baptized at St Botolph-without-Bishopsgate. He was known to contemporaries as \"Ned\"; his surname is alternatively spelled Allen or Alleyne.\nActing career\nEdward Alleyn was four years old when his father died. His mother remarried an actor named Brown. Alleyn, growing up in the home of an actor was believed to have been raised in the theatre culture.\nIt is not known at what date he began to act, but in 1583 his name was on the list of the Earl of Worcester's players. He was rated by common consent as the foremost actor of his time; his only close rival was Richard Burbage.\nHe played the title roles in three of Christopher Marlowe's major plays: Doctor Faustus, Tamburlaine, and Barabas in The Jew of Malta. He created the parts, which were probably written especially for him. Edward Alleyn was known for his physical size and handling of commanding parts. The evidence for his stage career is otherwise fragmentary. Other parts thought to be associated with Alleyn are Orlando in Robert Greene's Orlando Furioso, and perhaps Hieronymo in The Spanish Tragedy by Thomas Kyd. Other works, some now lost, are thought to have had Alleyn in leading roles, including plays by George Peele such as The Battle of Alcazar. In a private letter, he mocked himself as a 'fustian king'.\nTo illustrate Alleyn's dedication, in 1593 Alleyn and the rest of his fellow players were touring the provinces of England, including more rural areas and were apparently not earning enough money worth the travelling. At that time, the bubonic plague was wreaking havoc in London, but Alleyn and the other players were willing to risk their health for the success of the troupe and perhaps, their personal financial stability by staying in London. This tour consisted of players from Lord Strange's Men and the Admiral's Men with which he was associated. The tour extended to Bristol, Shrewsbury, Chester, and York.\nAlleyn retired at the height of his fame around 1598, and it is said that Queen Elizabeth requested his return to the stage, which he did in 1604, the year after her death. Ben Jonson bestowed praise on Alleyn's acting. Thomas Nashe expressed in Pierce Penniless (1593) his admiration for him, in a quartet of English actors including also John Bentley, William Knell and the clown Richard Tarlton; while Thomas Heywood calls him  \"inimitable\", \"the best of actors,\" \"Proteus for shapes and Roscius for a tongue.\"  Thomas Fuller in his Worthies later wrote of Alleyn's reputation of \"so acting to the life that he made any part to become him\".\nAlthough Alleyn had obtained a good amount of his fortune due to his marriage, he also made much of it from his acting career and owned a large estate in Sussex.\nBusiness\nAlleyn went into business with his father-in-law Philip Henslowe and became wealthy. He was part-owner in Henslowe's ventures, and in the end sole proprietor of several profitable playhouses, bear-pits and other rental properties. Among them were the Rose Theatre at Bankside, the Paris Garden and the Fortune Theatre on Finsbury Fields. The Fortune was built for Alleyn and Henslowe in 1600, the year after the rival Globe Theatre was completed south of the river, by the same contractor Peter Street, but was square rather than round; it was occupied by the Admiral's Men, of which Alleyn was the head.\nHe filled, in conjunction with Henslowe, the post of \"master of the king's games of bears, bulls and dogs.\" On some occasions he directed the sport in person, and John Stow in his Chronicles gives an account of how Alleyn baited a lion before James I at the Tower of London.\nCollege founder\nAlleyn's connection with Dulwich began in 1605, when he bought the manor of Dulwich from Sir Francis Calton. The landed property, of which the entire estate had not passed into Alleyn's hands earlier than 1614, stretched from Sydenham Hill on whose summit now stands the Crystal Palace television transmission tower, to the crest of the parallel ridge, three miles nearer London, known in its several portions as Herne Hill, Denmark Hill and Champion Hill. Alleyn acquired this large property for little more than £35,000. He began the task of building and endowing the College of God's Gift at Dulwich.\nThere is a legend associated with the founding of Dulwich which attributes Alleyn's gift to an encounter with an apparition.  English antiquarian John Aubrey was the first to record the legend, saying:\nMr. Alleyn, being a tragedian, and one of the original actors in many of the celebrated Shakespeare plays, in one of which he played a demon, with six others, surprised by an apparition of the devil, which so worked on his fancy that he made a vow, which he performed at this place (Dulwich College).\nAll was completed in 1617 except for the charter or deed of incorporation for setting his lands in mortmain. Delays occurred in the Star Chamber, where Lord Chancellor Bacon brought pressure to bear on Alleyn, with the aim of securing a portion of the proposed endowment for the maintenance of lectureships at Oxford and Cambridge. Bacon's approach was in line with his skepticism about the impact of charitable foundations, compared to a scheme put forward by Sir Henry Savile and Sir Edwin Sandys that lacked funds. Alleyn finally carried his point and the College of God's Gift at Dulwich was founded, and endowed under letters patent of James I, dated 21 June 1619. The construction of the school began in 1613.\nIt is said that Dulwich was built as a gesture of thanksgiving to God for Alleyn's acting ability and success in business dealings. At the time of its founding, Alleyn was not a member of his own foundation, but guided and controlled its affairs under powers reserved for himself in the letters patent. His diary shows that he mixed much and intimately in the life of the college. He engaged the boys in occasional theatrical performances: at a festive gathering on 6 January 1622 \"the boyes play'd a playe.\"\nIn 1610 Alleyn was a member of the corporation of wardens of St Saviour's, Southwark in which parish he founded almshouses in the 'Soap Yard' next to an older foundation of Thomas Cure; he also contributed to the parish grammar school and both institutions still receive distributions from his Dulwich foundation.\nIn 1882 the College of God's Gift was legally divided into three schools: Dulwich College, James Allen's Girls' School and Alleyn's School. Dulwich College has expanded internationally to China, Singapore, and South Korea.\nMarriages\n]]\n, London]]\nAlleyn inherited property in Bishopsgate from his father. He married Joan Woodward, stepdaughter of Philip Henslowe on 22 October 1592. She died on 28 June 1623. Woodward was buried in the Christ's Chapel of God's Gift. On 3 December that same year he married Constance, daughter of John Donne, the poet and dean of St Paul's, though she was 37 years his junior, and he was older than her father. He had no children. Constance remarried in 1630, to Samuel Harvey.\nDeath and memorial\nAlleyn died in November 1626 and was buried in the chapel of the college which he had founded, known as the Christ's Chapel of God's Gift. On 3 November, Alleyn wrote out his last will and testament. His gravestone fixes the day of his death as the 21st. He was buried on 25 November, in the church floor but his memorial stone was moved from the interior to exterior in 1925 to prevent further wear. His body still lies beneath the church floor.\nThere is a memorial window to him in the cathedral, which in his time was the parish church for both the borough and the Clink Liberty in which most of his business activities were based. A portrait of the actor is on display at Dulwich Picture Gallery.\nAlleyn is unusual among figures in 16th-century drama because a large selection of his private papers have survived.  They were published in 1843 as The Alleyn Papers, edited by scholar-forger John Payne Collier. He also developed professional relationships with religious and political figures such as Sir Francis Bacon and Sir Julius Caesar.\nAlleyn had a private book collection of some significance which he bequeathed to Dulwich College.\nArms\n| notes             = Also used by Dulwich College until 1935, when the College of Arms decreed that it was the exclusive property of the Alleyn family. The school's arms are differenced by: \"A chief ermine, thereon a cinquefoil of the second\".\n}}\nNotes\nReferences\n*\nFurther reading\n*S. P. Cerasano, ''Edward Alleyn's 'Retirement' 1597–1600, Medieval and Renaissance Drama in England, 10 (1998), pp.&nbsp;98–112.\n*S. P. Cerasano, Edward Alleyn, the new model actor, and the rise of the celebrity in the 1590s, Medieval and Renaissance Drama in England (2005), pp.&nbsp;47–58.\n*G. L. Hosking, The Life and Times of Edward Alleyn, London: Jonathan Cape, 1952.\n*David Mateer, Edward Alleyn, Richard Perkins and the Rivalry Between the Swan and the Rose Playhouses'', The Review of English Studies 2009 60(243): pp.&nbsp;61–77.\nExternal links\n*[http://www.luminarium.org/encyclopedia/alleyn.htm Edward Alleyn information at Luminarium Encyclopedia Project]\n*[http://www.henslowe-alleyn.org.uk/ Henslowe-Alleyn Digitisation Project]"
    }
  ]
}