{
  "content": [
    {
      "type": "text",
      "text": "# Edward Henry Burke Cooper\n\nEdward Cooper (1912–1937) was a British actor, communist activist, and newspaper worker, who died fighting for the International Brigades during the Spanish Civil War. He was also a close friend of Ralph Winston Fox, and John Cornford, and is memorialised on the Oxford Spanish Civil War memorial.\nEarly life\nBorn in Croydon, England, Edward Cooper was the youngest of four children belonging to Mary Eleanor (nee Burke) from County Mayo, and Richard Edward Synge Cooper from Northamptonshire. His family was very well off, with their household including a live-in cook, housemaid, and \"German governess\".\nAs a student, Cooper participated in the anti-fascist movement. Although Cooper never joined a trade union like many other volunteers, he did join the Communist Party of Great Britain (CPGB) in 1935. Soon afterwards he began working for the CPGB's official newspaper the Daily Worker, today known as the Morning Star. During his time working for the Daily Worker his parents lived in Oxfordshire, seven miles south of Banbury, in a house called 'The Grange' (now Priory Court) in Duns Tew.\nSpanish Civil War and death\nDespite having no previous military experience, in 1936 Cooper volunteered to join the International Brigades to fight for the Second Spanish Republic during the Spanish Civil War. After enlisting in Oxford in October 1936, Cooper travelled to Spain and joined the French Commune de Paris Battalion, and by December was fighting near Madrid. At the end of December 1936, he was transferred to the XIV International Brigade with five other volunteers from the Commune de Paris Battalion. During his time in Spain, Cooper became friends with fellow English communist and Cambridge poet John Cornford. Cooper fought alongside Cornford and Oxford communist Ralph Winston Fox at the Battle of Lopera, however all three of them would die from wounds sustained during the battle. In a letter to Margot Heinemann, Cornford described Cooper as \"a very good guy...promoted to section leader, he did really well on a really nasty bit of the front line\". Claud Cockburn, in an article for the Daily Worker, described how Cooper was put in charge of a machine-gun section, due to his \"extraordinary flair for machinery\"\nEdward Cooper was badly wounded in Cordoba in December 1936, and soon afterwards died at the age of 25 in a hospital in Madrid, 12 February 1937. Unable to contact him, his father died of cancer in early May 1937 never discovering what happened to his son. Cooper's mother then discovered that her son had been killed the same month her husband died of cancer.\nMemorial\nAn appeal was launched in 2014 by the International Brigade Memorial Trust to create and install a memorial in Oxford dedicated to all the people linked to Oxfordshire who fought for the International Brigade. After a long battle with Oxford city council who had rejected the planning proposals for the memorial in the city center, the Oxford Spanish Civil War memorial was eventually raised in east Oxford in 2017. The unveiling of the memorial was attended by the granddaughter of Juan Negrín, the last Prime Minister of the Second Spanish Republic. On the front of the memorial is inscribed the names of the six volunteers who died during the war, one of them being Edward Cooper.\nReferences"
    }
  ]
}