{
  "content": [
    {
      "type": "text",
      "text": "# Edward Killwick Calver\n\nEdward Killwick Calver (6 December 1813 – 28 October 1892) was a captain in the Royal Navy, and hydrographic surveyor. He is particularly noted for his surveying work in the east of Britain, and as the captain of , in oceanographic voyages in 1869 and 1870.\nCalver was born in Southwold in Suffolk. He entered the Navy in July 1828 on board HMS Crocodile on foreign service in the East Indies, where he was active in the search for pirates. In 1832 he joined , under the command of Robert Smart, being involved in the blockade of the Dutch Coast during the Belgian war of independence, and then cruising for slavers off the coast of Brazil. He passed his examination for Second-Master in October 1834, and carried out many surveys, both in Crocodile and Satellite. His surveying work was sufficiently appreciated at home that when he returned to England in April 1836 he was appointed Assistant-Surveyor to Michael Atwell Slater who was in charge of the survey of the east coast of Scotland.\nIn 1841 Calver was appointed Acting-Master on  and Assistant-Surveyor to Captain John Washington, who was completing the great survey of the North Sea which had occupied Captain William Hewett for 10 years until the loss of his ship HMS Fairy with all hands in 1840. He was promoted to Master in January 1842. Washington and Calver then transferred from Shearwater to HMS Blazer, and continued survey work in the North Sea until 1847. During this period Calver was involved in both deep-water surveying, and in making plans of Scarborough and the port of Harwich, the Rivers Orwell Stour and Deben, and the approaches to Yarmouth and Lowestoft Roads.\nHe gave evidence to the Commission on Harbours of Refuge, and also prepared several of the plans used by the committee in preparing its report. Throughout his career he was concerned with the improvements of tidal harbours and entrances. He was elected an Associate of the Institution of Civil Engineers in 1866.\nFrom 1847 until 1872 Calver was in charge of the survey of the east coast of England, first commanding HMS Speedwell, then from 1863 in . He surveyed most of the east coast of England, including rivers and harbours, as well as the offshore sandbanks and channels. He compiled sailing directions for much of the North Sea, including parts of the continental coast. He also carried out surveys on the west coast of Britain during this period including the work that led to the publication of sailing directions for the Bristol Channel. He was promoted to Staff-Commander in June 1863, and to Staff Captain in March 1870.\nCalver was in command of Porcupine for her most famous voyages, the oceanographic cruises in 1869 and 1870 directed by Charles Wyville Thomson and sponsored by the Royal Society. The first cruise was off the west of Ireland in May to July 1869. Dredge hauls and temperature measurement were made in depths up tp . The second cruise, from 17 July to 4 August 1869 was to an area west of Ushant and south-west of Ireland and aimed to sample much deeper water than had previously been obtained. They obtained a dredge at , by far the deepest to date. The sample included a wide range of animal life, disproving the Azoic hypothesis, that life could not exist below about 300 fathoms. Thomson credits Calver's skill in managing the dredging operations, which were carried out at depths that \"would have been previously deemed out of the question\". From 15 August to 15 September 1869, the ship explored the area between Shetland, the Faroes, and the north of Lewis. They confirmed a finding of markedly different temperatures in neighbouring areas of the ocean, irrespective of depth. These findings, though controversial, suggested a deep circulation driven by density differences. They also found more marine life in the cold areas than had been thought from previous explorations. The bottom here was firm, which had prevented the dredge from working as well as on muddy bottoms. Calver suggested attaching hempen \"tangles\" to the sides of the dredge to sweep the sea floor, and this helped to collect more animals for study.  The final cruise was to the Mediterranean, from July to October 1870. The most important findings related to water temperatures and circulation. In the Strait of Gibraltar they found a salinity maximum at about . Using a current drag designed by Calver they were able to show an outward flow of water at this depth, in contrast to the surface current which flowed inward. In 1676 Richard Bolland had suggested using a drag suspended below a boat to detect a deep current. Two centuries later his method was able to confirm the existence of the Gibraltar undercurrent. The success of the Porcupine voyages led to the funding of the Challenger expedition of 1872–1876, which surveyed deep seas around the world.\n|File:Depths Thomson 1873 Figure 51 Hempen Tangles depthsofseaaccou00tho 0319.jpg\n|The hempen tangles attached to the sides of the dredge, to capture marine life from the sea floor\n|File:Carpenter Porcupine 1871 Current-drag 02398928 0020 (cropped).jpg\n|Current-drag designed by Calver. The drag was weighted and suspended below a boat at various depths. The boat was dragged in the direction of the current at that depth, and the velocity of the current could thus be estimated.\n}}\nCalver retired from active service in 1872, with the rank of Captain. In the following year he was elected a fellow of the Royal Society. He died at Vevey in Switzerland in 1892.\nReferences\nPublications\n*\n*\n*\n*\n*\n*\nCalver contributed to the following volumes of sailing directions:\n*  The directions from Dunkerque to the Elbe are by Mr. E. K. Calver, Master, R.N., from the charts of Ryk and Van Rhyn, the Dutch Ariel by Modera, and other authorities, as well as from his own observations.\n*  The directions for Shetland were prepared by Mr. E. K. Calver, Master, R.N., from materials supplied by the late Commander G. Thomas.\n*  Originally written in 1858 by Mr. E.K. Calver, Master, R.N.. Recompiled by Bedford, and published in 1869. This edition revised 1879.\n*  The work was originally prepared in 1857 by Staff Commander E. K. Calver, R.N., who had been employed on the survey of this coast from the year 1836. The second edition was published in 1869,"
    }
  ]
}