{
  "content": [
    {
      "type": "text",
      "text": "# Edward Fokczyński__disambig_1\n\nEdward Fokczyński was one of the four directors of the AVA Radio Company, an electronics firm established in Warsaw, Poland, in 1929.  AVA produced radio equipment for the Polish General Staff's Cipher Bureau, which was responsible for the radio communications of the General Staff's Intelligence Section (Oddział II).\nAfter the Cipher Bureau's mathematician-cryptologist Marian Rejewski in December 1932 deduced the wiring in the German Enigma rotor cipher machine, AVA produced Enigma \"doubles\" and all the electro-mechanical equipment that was designed at the Cipher Bureau to facilitate decryption of the German ciphers.\nLife\nFokczyński was an autodidact whose formal education did not extend beyond four grades of primary school at Pabianice.  He worked there as a journeyman locksmith before moving in 1913 to Łódź, where he found a job in the electrical engineering firm of Knapik and Company.\nIn 1919 Fokczyński enlisted in the Polish Army, serving in a radio battalion and later in Field Wireless Station No. 4. Mustered out in 1922, he worked a couple of years as a technician in the infant Polish broadcasting industry, where he was judged capable, intelligent, reliable, and gifted in radio work.\nIn 1927, Fokczyński opened a small radio workshop in a single room in Warsaw.  Sporadically he received orders from the Cipher Bureau; Captain Maksymilian Ciężki, chief of the Bureau's German section (BS 4), had known him since his army years.  In 1929–32, the shop on Warsaw's New World Street, ten minutes' walk from the General Staff building, was transformed into the AVA Radio Company.  The electronics firm subsequently moved to new facilities in southern Warsaw's Mokotów district.\nOn a cost-plus basis, AVA produced radio equipment for the Polish General Staff's Cipher Bureau, which was responsible for the radio communications of the General Staff's Intelligence Section (Oddział II).\nAfter the Cipher Bureau's mathematician-cryptologist Marian Rejewski in December 1932 deduced the wiring in the German Enigma rotor cipher machine, AVA produced Enigma \"doubles\" and all the electro-mechanical equipment that was designed at the Cipher Bureau to facilitate decryption of the German ciphers.  The Poles' reading of German ciphers laid the foundation for the western Allies' Ultra cipher-breaking operations, beginning seven years later, during World War II. Before the war, AVA also produced the Cipher Bureau-designed Lacida rotor cipher machine.\nAfter the invasion of Poland in 1939, Fokczyński was one of the essential Cipher Bureau and AVA personnel who made it to France to continue their war on the Enigma cipher at PC Bruno, outside Paris, where the Poles collaborated with their French and British allies. When France capitulated to Nazi Germany in June 1940, Fokczyński and his colleagues were transported by their French host, Colonel Gustave Bertrand, to a post codenamed Cadix, outside Uzès, in southern, Vichy France.\nOn 8 November 1942 the Allies landed in North Africa (Operation Torch).  On 9 November Bertrand evacuated Cadix, and the Poles set out for the Côte d'Azur. Two days later, the Germans abruptly invaded the French Free Zone, putting an end to the collaborationist but semi-autonomous Vichy regime and, on 12 November, occupying Cadix.\nThe Polish team sought, in small groups, to cross the Pyrenees from France into Spain. On 13 March 1943 one such expedition, which included Cipher Bureau chief Colonel Langer, Major Ciężki, Antoni Palluth and Fokczyński, were arrested near Perpignan by the Gestapo. They had been betrayed by their guide. The two officers were sent to Frontstalag 122 at Compiègne, France, and on 9 September 1943 to the SS concentration camp, Sonderkommando Schloss Eisenberg, in Czechoslovakia; they were liberated by American forces on 10 May 1945. Palluth and Fokczyński were sent as slave labor to the Sachsenhausen concentration camp, near Berlin, where both died before war's end.  Palluth was killed in an Allied air raid; Fokczyński  died from exhaustion. None of the Poles betrayed to the Germans the secret of Enigma decryption.\nSee also\n*AVA Radio Company\n*Ultra (cryptography)\nNotes\nReferences\n*\nExternal links\n* Laurence Peter, [https://news.bbc.co.uk/2/hi/europe/8158782.stm  How Poles cracked Nazi Enigma secret], BBC News, 20 July 2009"
    }
  ]
}