{
  "content": [
    {
      "type": "text",
      "text": "# Edward Shenton\n\n| title =\n| networth =\n| term =\n| predecessor =\n| successor =\n| party =\n| boards =\n| spouse =\n| children =\n| parents =\n| relatives =\n}}\nEdward Shenton (1895-1977) was an American illustrator, author, editor, poet, and teacher.\nBiography\nEdward Shenton was an illustrator, writer, editor, poet, and teacher. He was born in Pottstown, Pa. November 29, 1895 and grew up in West Philadelphia where he attended high school. At age 13 he was confined to his home for two years with an illness that gave him time to read and teach himself to draw. Most of his drawings were of medieval knights in armor. Returning to school he became the editor of his high school magazine and yearbook, where he contributed both in writing and illustrating. He began studies at the Museum School of Art in 1916 but dropped out in 1917 when he and his brother joined the 103rd Engineers, AEF and served in France during World War I, where he first met writer Al Barrone. His drawings from the front lines were published in The Philadelphia Record in 1919. On return, he enrolled at the Pennsylvania Academy of Fine Arts where his teachers included illustrators Thorton Oakley and George Harding, both from the original classes of Howard Pyle. In 1922 he won the Lee Prize and later two Cresson Traveling Scholarships to study in Paris in 1923-24.\nCareer\nBetween 1923 and 1976, he illustrated over 130 books including The Yearling, Tender Is the Night, Green Hills of Africa, Freedom River Florida 1845, This Is My Country, The Flaming Sword, and three volumes of the Rivers of America Series. He also illustrated \"The Long Trains Roll\" by Stephen W. Meader (Harcourt, Brace and Co.) in 1944. During the 1930s he was the \"house\" illustrator for Scribner's magazine, where he drew interior illustrations as well as covers. For many years he was the illustrator of the \"Stillmeadow\" books written by Gladys Taber, about everyday life in her colonial farmhouse in Southbury, Connecticut, including Stillmeadow and Sugarbridge, co-written by his wife Barbara Webster and based on correspondence between Taber and Webster.\nHe also wrote ten books and seventy-five articles for various magazines, including The Saturday Evening Post, The New Yorker, ''Collier's, and The Atlantic Monthly''.\nDeath\nHe died in 1977.\nReferences\n*[http://edwardshenton.com/index.html Edward Shenton]\nExternal links\n*"
    }
  ]
}