{
  "content": [
    {
      "type": "text",
      "text": "# Edward Ballantine\n\nEdward Ballantine (August 6, 1886 – July 2, 1971), was an American composer and professor of music.\nEarly life\nEdward Ballantine was born in Oberlin, Ohio, on August 6, 1886, the son of William Gay Ballantine, the fourth president of Oberlin College, and Emma Frances Atwood. One brother, Arthur Atwood, was the senior member of the New York law firm of Root, Clark, Buckner & Ballantine—later Dewey, Ballantine, Bushby, Palmer & Wood. Another brother, Henry Winthrop, was Professor of Law, at Boalt Hall School of Law.\nEducation and career\nHe studied with Walter Spalding and Frederick Converse at Harvard University, where he received a BA in 1907. He was awarded highest final honors in music at Harvard University and an orchestral composition of his was played by the Boston Symphony Orchestra at Boston, Massachusetts, on June 14, 1907. He then pursued his studies with Artur Schnabel, Rudolf Ganz, and Philippe Rüferthen in Berlin from 1907 to 1909. He returned to the United States where he joined the Harvard music faculty in 1912, where he remained until his retirement in 1947. His best-known compositions are two sets of piano variations on \"Mary Had a Little Lamb\" (1924, 1943), in which each variation is in the style of a different composer.\nMarriage\nIn 1923 he married, as her second husband, Florence Foster Besse, a childhood friend and the daughter of Henrietta Louisa Segee and Lyman W. Besse, who owned an extensive chain of clothing stores in the Northeast known as \"The Besse System\".. She was a 1907 Phi Beta Kappa graduate of Wellesley College. She had married as her first husband, Kingman Brewster, Sr. They separated in 1923 and were later divorced. They were the parents of Kingman Brewster, Jr., who was an educator, diplomat, and president of Yale University.\nDeath\nHe died on July 2, 1971, at his home at Vineyard Haven, Massachusetts.\nReferences\n*Arzuni, Sahan. 1994. \"An American Jester\". Keyboard Classics & Piano Stylist 14, no. 5:54–56.\n* |reference=Cutter, W.R. (1910). [https://books.google.com/books?id=FM8UAAAAYAAJ&dq=William+Richard+Cutter+and+elisha+huntington+brewster&pg=PA2107 Genealogical and personal memoirs relating to the families of the state of Massachusetts0.] New York: Lewis Historical Publishing Company.}}\n* |reference=Kabaservice, Geoffrey. 2004. The Guardians: Kingman Brewster, His Circle, and the Rise of the Liberal Establishment. New York: Henry Holt and Company. ; [http://www.worldcat.org/oclc 53145580]}}\nFootnotes\n}}\nExternal links\n*Jones, Howard Mumford. \"[https://web.archive.org/web/20110708114239/https://cannells.com/colin/archives/mary_had_a_little_la.php Mary Had a Little Lamb (December 1950)]\". Quodlibet website (Accessed February 23, 2010)"
    }
  ]
}