{
  "content": [
    {
      "type": "text",
      "text": "# Edward A. Temple\n\n| birth_place      = Walkerton, Virginia, United States\n| death_date       =\n| death_place      = Amarillo, Texas, United States\n| buried           = Oakwood Cemetery\n| resting_place_coordinates =\n| religion         = Anglican\n| residence        =\n| parents          = John Temple & Matilda Wright\n| spouse           =\n| children         = 2\n| occupation       =\n| profession       =\n| education        =\n| alma_mater       =\n| motto            =\n| signature        =\n| signature_alt    =\n| coat_of_arms     =\n| coat_of_arms_alt =\n| module           =\n| module2          =\n| other            =\n}}\nEdward Arthur Temple (September 5, 1867 – January 10, 1924) was an American prelate of the Episcopal Church who was missionary bishop of the Missionary District of Northwest Texas, serving from 1910 to 1924.\nEarly life and education\nTemple was born in Walkerton, Virginia, on September 5, 1867, the son of John Temple and Matilda Wright. He studied at the Virginia Polytechnic Institute and then at the Virginia Theological Seminary from where he graduated in 1895. In 1913, he was awarded a Doctor of Divinity from the University of the South and another from the Virginia Theological Seminary, respectively.\nOrdained ministry\nTemple was ordained deacon on June 25, 1895, by Bishop Francis McNeece Whittle of Virginia, at the Chapel of the Virginia seminary, and priest in 1896 by John B. Newton Coadjutor Bishop of Virginia. He then became rector of Calvary Church in Front Royal, Virginia, while in 1903, he became rector of St Paul’s Church in Waco, Texas, where he remained until 1910. He married Mary Craik Davis on November 9, 1909, and they had two children.\nBishop\nIn 1910 Temple was elected as the first missionary bishop of the Missionary District of Northwest Texas. He was consecrated bishop on December 15, 1910, by Presiding Bishop Daniel S. Tuttle. During his episcopacy he help the build the missionary district and established 11 new church buildings. He died in office on January 10, 1924.\nReferences"
    }
  ]
}