{
  "content": [
    {
      "type": "text",
      "text": "# Edward Legge (Royal Navy officer)\n\n| image             =\n| alt               =\n| caption           =\n| birth_name        =\n| other_name        =\n| nickname          =\n| birth_date        = 1710\n| birth_place       =\n| death_date        = 19 September 1747\n| death_place       = Leeward Islands, West Indies\n| placeofburial     =\n| allegiance        = Great Britain\n| branch            = Royal Navy\n| serviceyears      = 1726–1747\n| rank              = Captain\n| unit              =\n| commands          = HMS LivelyHMS PearlHMS SevernHMS HampshireHMS MedwayHMS StraffordHMS WindsorLeeward Islands Station\n| known_for         =\n| battles           =\n*Anglo-Spanish War\n**Thirteenth siege of Gibraltar\n*War of the Austrian Succession\n**George Anson's voyage around the world\n| awards            =\n| memorials         =\n| alma_mater        =\n| spouse            =\n| children          =\n| relations         =\n| laterwork         =\n| signature         =\n|module=\n}}\nCaptain Edward Legge FRS (1710 &ndash; 19 September 1747) was an officer of the Royal Navy who achieved a distinction when he was returned as Member of Parliament for Portsmouth on 15 December 1747, despite the fact that he died 87 days prior in the West Indies.\nLife\nLegge was the fifth son of the William Legge, 1st Earl of Dartmouth. He entered the navy in 1726, on board, HMS Royal Oak, one of the fleet under Sir Charles Wager for the relief of Gibraltar. He afterwards served in HMS Poole, in HMS Kinsale with the Hon. George Clinton, in HMS Salisbury and HMS Namur, and passed his examination on 4 July 1732. He was promoted to be lieutenant of HMS Deptford on 5 March 1734, and to be captain on 26 July 1738. In 1739, he was appointed to HMS Pearl, one of the ships fitting for the voyage to the Pacific under Commodore George Anson. From her, he was moved into HMS Severn, another of Anson's squadron, which after many delays sailed from St. Helens in September 1740.\nIn the violent storm to the southward of Cape Horn, the Severn and the Pearl were separated from the commodore on 10 April 1741. The storm, blowing from the north-west, raged continuously for forty days, during which time they beat to the westward. When the weather permitted they stood to the north, supposing that they had passed into the Pacific. They were in fact still in the Atlantic, the leeway and current together having more than nullified the laborious windward sailing, and on 1 June found themselves off Cape Frio. The case is often referred to as an instance of the extreme uncertainty of the determination of longitude by dead reckoning only. On 30 June, they reached Rio Janeiro in an almost helpless state, having lost a very great many of their men by sickness. After recruiting his ship's company, Legge returned to England, where he arrived in April 1742.\nIn 1745, he commanded HMS Strafford in the West Indies, and in 1746 HMS Windsor on the home station, when he sat as a member of the courts-martial on Admirals Richard Lestock and Thomas Mathews. In 1747, appointed by the  First Lord of the Admiralty  - the 4th Duke of Bedford - Legge went out as commodore and commander-in-chief at the Leeward Islands, with orders to supersede his predecessor, Commodore Fitzroy Henry Lee, and try him by court-martial for misconduct and neglect of duty. Lee, however, was sent home without being tried. Legge shortly afterwards died, on 19 September 1747.\nAfter the 1747 general election, a vacancy occurred in Portsmouth because one of the elected MPs was Thomas Gore who chose to sit for Bedford. Portsmouth was under the control of the Admiralty and the Duke thought of nominating Legge. Legge's brother George (Viscount Lewisham) had been an MP until his death from smallpox, and his brother Henry was sitting on the Bedford interest in Orford.\nHenry wrote back to the Duke on 4 August 1747 to say:\nWith Edward duly returned unopposed as a supporter of the Pelham administration, the Legge family was distressed to learn four days later that he had died three months previously.\nLegge was not the only Member of Parliament returned posthumously, but he is the one returned the longest time after his death.\nNotes\n;Attribution\nReferences\n* History of Parliament 1710-1754, vol. 2, p.&nbsp;206"
    }
  ]
}