{
  "content": [
    {
      "type": "text",
      "text": "# Edward Austin Kent\n\n| birth_place           = Bangor, Maine\n| alma_mater            = Yale UniversityÉcole des Beaux-Arts\n| nationality           = American\n| death_date            =\n| death_place           = Atlantic Ocean\n| parents               = Henry Mellen KentHarriet Ann Farnham\n| spouse                =\n| relations             = William Winthrop Kent (brother)\n| significant_buildings =\n}}\nEdward Austin Kent (February 19, 1854 – April 15, 1912) was a prominent architect in Buffalo, New York.  He died in the sinking of the RMS Titanic and was seen helping women and children into the lifeboats.\nBiography\nEdward Austin Kent was born in Bangor, Maine on February 19, 1854, to Harriet Ann Farnham (1830–1908) and Henry Mellen Kent (1823–1894). Kent moved with his family to Buffalo after the American Civil War, where his father, Henry, opened a successful department store, Flint & Kent.  He was the brother of William Winthrop Kent (1860–1955), also a prominent architect who studied under H. H. Richardson, and Charles Farnham Kent (1856–1878), who died aged 22 in Denver, Colorado.  Kent attended and graduated from Yale, in 1875, and later the École des Beaux-Arts, the famous Beaux-Arts architecture school in Paris.  Returning to the U.S. in 1877, he became junior partner in the Syracuse, New York firm of Silsbee and Kent.  In 1884, he returned to Buffalo and remained there for the rest of his career, helping to found the Buffalo Society of Architects and receiving many prominent commissions, including Flint & Kent. Until his death, he lived at the Buffalo Club.\nIn 1912, he took a two-month vacation to France and Egypt and planned on retiring after returning home. He decided to delay his trip home so he could travel on the maiden voyage of the new and luxurious ocean liner, the .\nAboard the Titanic\nKent traveled as a first-class passenger. He mingled with the other socialites, and with a writers' group which included Helen Churchill Candee and Archibald Gracie. He perished when the ship struck an iceberg and sank on the night of April 14–15, 1912. As the ship was sinking, he disregarded his own safety to help women and children into the lifeboats. He was last seen at around 2:20&nbsp;a.m. making no attempts to save himself as he was swept into the ocean. His body was recovered by the CS Mackay-Bennett as body No. 258 and claimed by his brother when the ship docked. He was laid to rest in the Forest Lawn Cemetery in Buffalo, New York.\nNotable works\n, Buffalo]]\n* Temple Beth Zion (built 1890; destroyed 1961) – erected in the Byzantine style at 599 Delaware Avenue in Buffalo, as a copper-domed synagogue. Destroyed on October 4, 1961, when a fire, fueled by flammable liquids being used to refinish the pews, destroyed the building.\n* Chemical No. 5 Firehouse (built 1894) – erected in the Art Nouveau style at 166 Cleveland Avenue in Buffalo.\n* A. E. Perron Company Building (built 1895) – erected in the Beaux-Arts style at 674 Main Street in Buffalo, as a factory and sales room for the A. E. Perron Company, a manufacturer of early automobiles, sleighs and harnesses.\n* Otto-Kent Building (built 1896) – erected in the Beaux-Arts style at 636-644 Main Street in Buffalo, adjacent to Shea's Buffalo, for his father's department store, Flint & Kent\n* Unitarian Universalist Church of Buffalo (built 1906) – erected in the English Gothic style at 695 Elmwood Avenue in Buffalo and listed on the National Register of Historic Places on June 30, 2015.\nSee also\n*Passengers of the RMS Titanic\nReferences\nExternal links\n*[http://vimeo.com/39634071 A trailer for a film about the life of Edward Austin Kent]"
    }
  ]
}