{
  "content": [
    {
      "type": "text",
      "text": "# Edward Bach\n\n| birth_place    = Moseley, Birmingham, England\n| death_date     =\n| death_place    = Wallingford, Oxfordshire, England\n| nationality    = British\n| education      = University College Hospital\n| years_active   =\n| known_for      = Bach flower remedies\n| field          = Medicine\n| signature      =\n}}\nEdward Bach ( ; 24 September 1886 – 27 November 1936) was a British medical doctor, bacteriologist, homeopath, and spiritual writer, best known for developing the Bach flower remedies, a form of alternative medicine inspired by classical homeopathic traditions.\nBiography\nBorn in Moseley, Worcestershire, he studied medicine at the University College Hospital, London, and obtained a Diploma of Public Health (DPH) at Cambridge.\nIn 1917 Bach had a malignant tumour removed from his spleen. It was predicted that he had only three months left to live, but instead he recovered. Bach died in his sleep on 27 November 1936 in Wallingford, Berkshire, at the age of 50.\nMany of the Bach Flower remedies were designed whilst living in the Norfolk coastal town of Cromer in the 1930s.\nin Oxfordshire, now privately owned by the Ramsell family]]\nBach nosodes\nStarting in 1919, he worked at the London Homeopathic Hospital, where he was influenced by the work of Samuel Hahnemann. In this period, he developed seven bacterial nosodes known as the seven Bach nosodes. Their use has been mostly confined to British homeopathy practitioners.\nThese bowel nosodes were introduced by Bach and the British homeopath John Paterson (1890–1954) and Charles Edwin Wheeler (1868–1946) in the 1920s. Their use is based on the variable bowel bacterial flora associated with persons of different homeopathic constitutional types.\nBach flower remedies\nIn 1930, at the age of 43, he decided to search for a new healing technique. He spent the spring and summer discovering and preparing new flower remedies – which include no part of the plant but simply what Bach claimed to be the pattern of energy of the flower. In the winter he treated patients free of charge.\nRather than being based on medical research, using the scientific method, Bach's flower remedies were intuitively derived and based on his perceived psychic connections to the plants. If he felt a negative emotion, he would hold his hand over different plants, and if one alleviated the emotion, he would ascribe the power to heal that emotional problem to that plant.  He believed that early morning sunlight passing through dew-drops on flower petals transferred the healing power of the flower onto the water, so he would collect the dew drops from the plants and preserve the dew with an equal amount of brandy to produce a mother tincture which would be further diluted before use. Later, he found that the amount of dew he could collect was not sufficient, so he would suspend flowers in spring water and allow the sun's rays to pass through them.\nWhile he recognised the role of the germ theory of disease, defective organs and/or tissue, and other known and demonstrable sources of disease, Bach wondered how exposure to a pathogen could make one person sick, while another was unaffected, when to all appearances and analysis they were in equal states of health. He postulated that illness was the result of a conflict between the purposes of the soul and the personality's actions and outlooks. This internal war, according to Bach, leads to emotional imbalances and energetic blockage, which causes a lack of harmony, thus leading to physical diseases. Bach's remedies focus on treatment of the patient's personality, which he believed to be the ultimate root cause of disease.\nThe Bach Centre\nThe Bach Centre house, Mount Vernon, in Brightwell-cum-Sotwell, Oxfordshire, is owned today by a Registered Charity controlled by the Ramsell family set up by John Ramsell in 1989.\nReferences\nExternal links\n* [https://web.archive.org/web/20080629004352/http://bachtherapy.org/introduction.htm Writings of Dr Edward Bach]\n* [http://www.whonamedit.com/doctor.cfm/315.html Biography from \"Who Named It?\"]\n* [http://bachcentre.com/centre/drbach.htm Bach Centre Ltd]"
    }
  ]
}