{
  "content": [
    {
      "type": "text",
      "text": "# Edward Kennion\n\nEdward Kennion (1744–1809) was an English artist, initially a soldier and businessman.\nLife\nHe was born on 15 January 1744 in Liverpool, where his father James Kennion was in business. His grandfather John Kennion was for many years minister of the Unitarian Ancient Chapel of Toxteth Park, Liverpool. A kinsman, John Kennion, took charge of Edward's education, placing him first at John Holt's school in Liverpool, and sending him when he was fifteen to Mr. Fuller's academy in London, where he probably first studied drawing.\nIn 1762 Kennion sailed for Jamaica, and joined the expedition against Havana under Sir George Pococke and George Keppel, 3rd Earl of Albemarle, in which John Kennion was commissary. After the capture of the place he returned to England for a time, but again went out to Jamaica in 1765 to superintend John Kennion's estates, and remained there almost continuously till July 1769, when he returned to England. By a commission dated 11 April of that year he was appointed an aide-de-camp, with the rank of lieutenant-colonel, to the commander-in-chief of the island.\nOn settling in England Kennion engaged in trade in London. His marriage in 1774 with Ann Bengough for Worcester brought him some property. He continued in business till 1782, when he retired to Rydd Green, near Malvern. The winters of 1787 and 1788 he passed in London, where he gave drawing lessons, and in 1789 he moved there, as teacher and artist. He was admitted a member of the Society of Artists of Great Britain. He was also a Fellow of the Society of Antiquaries of London.\nKennion died suddenly in London on 14 April 1809. He left a widow and four children, including Charles John Kennion (1789–1853) who painted in water-colour.\nWorks\n, Pembrokeshire, engraved by Edward Kennion, after Henry Gastineau.]]\nKennion seldom painted in oil, and his earlier work was usually executed in Indian ink and pencil, but he subsequently tinted his drawings, and finally, under the influence of his friend, George Barret, painted with a full strength of colour. He contributed landscapes to the exhibitions of the Society of Artists, sending in all 24 works; and exhibited eight landscapes at the Royal Academy between 1790 and 1807.\nAbout 1771 he had made the acquaintance of Barret, and in the following years accompanied him on sketching tours. At Rydd Green he occupied himself in making drawings for a book on landscape painting, his long-term project. In 1784 appeared issue No. 1 of a work on remains of antiquity, which contained five perspective views of ancient castles on the Welsh border, and three ground plans engraved in line by Richard Bernard Godfrey, with descriptions by Kennion.\nKennion worked at his book on landscapes during visits to the neighbourhood of Liverpool and the Lake District. In 1790 he etched eight plates as examples of the oak tree, which were published with a preface as No. 1 of Elements of Landscape and Picturesque Beauty. The death in 1791 of an uncle, Dr. Kennion, a Liverpool physician, increased his resources, and in 1803 he issued a full prospectus of the proposed work. His project had expanded into an exhaustive treatise on graphic art in 4 vols. Final arrangements were made for the publication of a first volume early in 1809, but he died that year. An Essay on Trees in Landscape was ready for press, and was issued in 1815, many of the plates being by his son Charles.\nReferences\n;Attribution"
    }
  ]
}