{
  "content": [
    {
      "type": "text",
      "text": "# Edward Mazur\n\nEdward Mazur (October 25, 1946, in Lubzina – May 29, 2023) was a Polish-American businessman.\nPersonal and professional history\nBorn in Lubzina, Poland, Mazur immigrated to the U.S. as a child in the 1960s, and became naturalized in 1969. He obtained a bachelor's degree in Electrical Engineering from the Chicago Technical College and held various executive positions at THE Cargill International and John Deere & Co. After working with those companies on developing their markets in Central Europe, he became involved in a number of his own business ventures in Poland after the end of the Communist rule in 1989. He was a co-founder of Bakoma S.A., the largest yogurt company in Poland, which was eventually acquired by Dannon Company. In 2003, Mazur was listed as one of the 25 richest Poles, with his family's permanent residence in Glenview, IL.\nInvestigation and dropped charges\nMazur was accused by Poland's prosecutors of contracting, in 1998, the murder of Polish National Police chief, General Marek Papała. In August 2014, the Polish prosecution dropped their case against Mazur. After a lengthy prosecution, they cited lack of evidence against him to conclude that he committed the crime.\nMazur was arrested in the U.S. in 2006 on a Polish extradition request. While that request dated back to 2005, the U.S. Justice Department had not taken any action on it until Poland's Minister of Justice Zbigniew Ziobro personally intervened with the Attorney General Alberto Gonzales. The Polish  government alleged that Mazur had paid Polish organized crime figures $40,000 to murder General Papała. On 20 July 2007, after Mazur spent nine months in federal detention, Poland's request was rejected by the Federal Magistrate Arlander Keys (Northern Illinois District Court) for lack of probable cause, mainly because the principal witness, Artur Zirajewski, lacked credibility in the court's view. Judge Keys harshly criticized the extradition request calling the government's reliance on Zirajewski's identification as \"shocking and offensive\" and stated that in his 12 years on the bench he hadn't even been close to rejecting an extradition.\nMazur's lawyer argued that his case exposed weaknesses in the U.S. extradition law  dealing with the countries \"lacking many of the legal safeguards of the United States\". He accused Polish authorities of framing his client out of vindictiveness and a desire to smear the leftist opposition, to which Mazur has close ties, and the U.S. government of pursuing this \"paper-thin\" case out of political expedience to placate an allied government.\nIn August 2014, the charges were dropped by Poland.\nReferences"
    }
  ]
}