{
  "content": [
    {
      "type": "text",
      "text": "# Edward Hamersley (junior)\n\n| birth_place = Paris, France\n| death_date =\n| death_place = York, Western Australia, Australia\n| death_cause =\n| resting_place =\n| resting_place_coordinates =\n| nationality = Australian\n| other_names =\n| education =\n| occupation =FarmerPolitician\n| employer =\n| known_for =\n| title =\n| term =\n| predecessor =\n| successor =\n| party =\n| boards =\n| spouse =\n| children =\n| parents =\n| relatives =\n}}\nEdward Hamersley (1 September 1835 or 1836 &ndash; 14 January 1921) was a Western Australian pastoralist, and a Member of the Western Australian Legislative Council for nearly ten years.\nBiography\nEarly life\nEdward Hamersley was born in Paris on 1 September 1835. The Hamersleys were a well connected family, and he was related by blood or marriage to a number of prominent Western Australian farmers and politicians. His father Edward was one of the leading Western Australian landholders of his day; his brother Samuel and nephew Vernon both became Members of the Legislative Council; William Locke Brockman was his uncle; his sister Margaret married Sir John Forrest; and his wife Jane was sister to Andrew and Charles Dempster.\nIn 1837, his family emigrated to Western Australia, where his father, Edward, became a wealthy and prominent pastoralist. In 1843, the family returned to France, but again went to Western Australia in 1850, building a home in Guildford, Western Australia near Perth.\nCareer\nIn 1853, he took charge of his father's horse station Richmond, in the Williams district. He was extremely unhappy at being sent away from the social scene at Guildford, and he managed the station poorly, prompting a contemporary John Wollaston to write\n:''Hamersley's horse station... seems to me quite an apology for a breeding establishment... not a bit of hay nor handful of corn to be had.... The native dogs destroy the foals as soon as dropped.\nIn 1858, his younger brother took over the station, and Hamersley was transferred to Wilberforce'', another of his father's stations, located in York, Western Australia.\nIn 1857, the governor agreed to allow settlers to elect men whom he would then nominate to the Western Australian Legislative Council.  Edwards stood for election, but was defeated by his father's former partner and later enemy Samuel Pole Phillips.\nWestern Australia having obtained representative government in 1870, he stood for election in 1874, and on 29 September of that year, he was elected to the Legislative Council seat of Toodyay.  Two months later, his father died, and he was bequeathed two of his father's stations, Wilberforce and Woodside.  He resigned his seat in the Legislative Council on 6 October 1875.\nOn 11 February 1880, he was elected to the Legislative Council seat of York. He did not stand for election in 1884 and so ceased to be a member on 27 October of that year. After Western Australia gained responsible government in 1890, he was nominated to the Legislative Council on 24 December of that year, serving until the Council became fully elective in June 1894. He then contested the Legislative Council's East Province, but was unsuccessful.\nPersonal life and death\nOn 4 February 1867, Hamersley married Jane Dempster. They had seven sons and three daughters.  He was widowed in April 1913, and died in York, Western Australia on 14 January 1921.\nTheir eldest son Edward Tours Hamersley (born 1869) married Margaret \"Madge\" du Boulay at Nice, France on 27 May 1930. Du Boulay was an accomplished violinist; her sister Isabel married Sir Edward Wittenoom.\nSee also\n* French Australian\nReferences\n*\n*\nNotes"
    }
  ]
}