{
  "content": [
    {
      "type": "text",
      "text": "# Edward G. Loring\n\n| birth_place   = Boston, Massachusetts, U.S.\n| death_date    =\n| death_place   = Winthrop, Massachusetts, U.S.\n| death_cause   =\n| resting_place =\n| resting_place_coordinates =\n| citizenship   =\n| nationality   =\n| party         =\n| otherparty    =\n| height        =\n| spouse        =\n| partner       =\n| relations     =\n| children      =\n| parents       =\n| mother        =\n| father        =\n| relatives     = Thomas Loring\n| residence     =\n| education     = Harvard University (A.B.)read law\n| alma_mater    =\n| occupation    =\n| profession    =\n| known_for     =\n| salary        =\n| net_worth     =\n| cabinet       =\n| committees    =\n| portfolio     =\n| awards        =\n| signature     =\n| signature_alt =\n| website       =\n| footnotes     =\n}}\nEdward Greely Loring (January 28, 1802 – June 18, 1890) was a Judge of Probate in Massachusetts, a United States Commissioner of the United States District Court for the District of Massachusetts and a judge of the Court of Claims. He was reviled in Massachusetts and much of the North for his ordering the return of fugitive slaves Thomas Sims and Anthony Burns to slavery in compliance with the Fugitive Slave Law of 1850. His action would result in his being removed as Judge of Probate.\nEducation and career\nBorn on January 28, 1802, in Boston, Massachusetts, Loring received an Artium Baccalaureus degree in 1821 from Harvard University and read law with Charles Greely Loring in Boston in 1824. He entered private practice and concurrently served as a master in chancery in Suffolk County, Massachusetts, starting in 1824. He was a United States Commissioner for the United States District Court for the District of Massachusetts from 1840 to 1855. He was a Judge of Probate for Suffolk County from 1847 to 1858. He was a lecturer for Dane Law School (now Harvard Law School) at Harvard University from 1852 to 1855.\nFugitive slave ruling and aftermath\nAs United States Commissioner of the United States District Court, Loring was responsible for issuing warrants for arrest and ruling in cases under the Fugitive Slave Act of 1850, which was widely opposed in Boston and the North. In 1851, an escaped slave named Thomas Sims was captured in Boston; Loring ordered his return to slavery in the South, as required by the new law. Boston abolitionists were outraged. It was not Loring but George Ticknor Curtis who oversaw the legal proceedings that followed and ultimately ruled that Sims would be sent back to the South.\nIn 1854, Loring ordered another escaped slave, Anthony Burns, returned to slavery in Virginia. During the prosecution of this case there was an attack on the courthouse in which James Batchelder, a 24-year-old police officer temporarily employed by the United States Marshal, was stabbed to death. Widespread protests marked the trial and its aftermath. President Franklin Pierce felt obliged to send United States troops to ensure that the ruling be carried out.\nFollowing the Burns decision, abolitionists led by William Lloyd Garrison and Wendell Phillips agitated for Loring to be removed from his office as probate judge. Forming a vigilance committee to monitor judges' activities under the law, they circulated petitions and lobbied against Loring with the Massachusetts legislature. Though he had assisted Burns in his court case, attorney Richard Henry Dana Jr. defended Loring before the legislature. Under pressure from an increasingly antislavery public, the legislature made two unsuccessful attempts to remove Loring from office by passing a [http://www.article8.org/docs/general/HistoryOfBOA.htm Bill of Address] in 1855 and 1856. Governor Henry J. Gardner, elected as a candidate of the Know-Nothing Party, declined to remove him.\nIn 1857, after Nathaniel Prentice Banks, a Republican, was elected Governor of Massachusetts, the legislature passed another Bill of Address against Loring. The new governor complied and removed Loring from office.\nFederal judicial service\nLoring was nominated by President James Buchanan on May 3, 1858, to a seat on the Court of Claims (later the United States Court of Claims) vacated by Judge John Gilchrist. He was confirmed by the United States Senate on May 6, 1858, by a vote of 27 to 13, and received his commission the same day. He served as Presiding Judge from 1859 to 1863. His service terminated on December 14, 1877, due to his resignation.\nPersonal life\nLoring was a fourth great-grandson of New England pioneer Thomas Loring. His double cousin Charles Greely Loring (with whom Edward Loring had read law) was one of the lawyers defending Thomas Sims in the 1851 action.\nLoring died on June 19, 1890, in Winthrop, Massachusetts.\nReferences\nSources\n* William E. Cain (1995), William Lloyd Garrison and the Fight against Slavery: Selections from The Liberator. Boston: Bedford Books. 150, note.\n* Charles Emery Stevens (1855), [https://web.archive.org/web/20060213040015/http://docsouth.unc.edu/stevens/stevens.html Anthony Burns: A History].\n* Henry David Thoreau (July 4, 1854): [https://web.archive.org/web/20081108152931/http://eserver.org/thoreau/slavery.html \"Slavery in Massachusetts\"]\n*\n|years=1858–1877}}\n|years=1859–1863}}"
    }
  ]
}