{
  "content": [
    {
      "type": "text",
      "text": "# Edward Elvines\n\nEdward Elvines  was an English politician who sat in the House of Commons in 1654. He supported the Parliamentary cause in the English Civil War.\nElvines was possibly the son of William Elvines, a baker of Worcester, who left money for the poor of the town by his will of 2 April 1612. On the outbreak of the Civil War, Elvines took the parliamentary side but had to flee the county for  opposing the commissioners of Array in 1642. He tried to recruit men to the parliamentary cause when the Earl of Essex went to Worcester but had to flee again when Sir William Russell took the city for the Royalists. He was away for four years while his whole estate was exposed to the enemy and he had to live on credit. When Worcester fell to Parliament in 1646, he became an alderman of the city and a member of the Parliamentary Committee for Worcestershire. He was persuaded to become mayor, as there was no one else they would confide in, on a faithful promise of reimbursement of all costs. However, Col. Rainsborough was called away and the Committee was dissolved so he did not receive recompense. He was added to the Committee for Sequestrations in Worcestershire on 29 July 1648, and was appointed a sub-commissioner of sequestrations for Worcestershire on 25 February 1650.\nWhen the Scottish army arrived at Worcester in 1651, Elvines had to flee for the third time, but returned with the parliamentary army.  He was persuaded to become mayor again, which he described as  \"to the hazard of his life among the sick Scots\". On 2 March 1652 the Council of State recommended the House of Commons to appoint John Coucher and Elvines, aldermen of Worcester, to be J.P.s  for the city. He was appointed one  of the three Sequestration Commissioners for Worcestershire on 14 December 1653, and  another order of 10 January 1654 made the appointment void.\nIn 1654, Elvines was elected Member of Parliament for Worcester in the First Protectorate Parliament. On 2 May 1654 he petitioned the Oliver Cromwell \" to consider his great expenses and sufferings for the public, and give him an estate to live upon in his old age ..  as he was  now unable to serve, having hardly a subsistence.\" The petition was referred to the Committee who reported that £600 should be paid him from delinquents' estates and an ordinance was made by the Protector and his Council in September 1654 \" for payment of £6oo for his fidelity when Mayor in 1646 and when Governor in 1651, for his losses by the burning of his house, the plundering of his goods, and his expense in money.\"\nReferences"
    }
  ]
}