{
  "content": [
    {
      "type": "text",
      "text": "# Edward Thonen\n\n| birth_place        = Elberfeld, Prussia\n| death_date         =\n| death_place        = Ballarat, Victoria, Australia\n| nationality        =\n| other_names        = Eduard Thönen\n| occupation         = Clerk, teacher of languages, lemonade seller\n| years_active       = 1850–1854\n| known_for          = London diamond robbery, Eureka Rebellion\n| notable_works      =\n}}\nEdward Thonen (26 May 1827 – 3 December 1854) was a German emigrant to Australia, and one of the miners involved in the Eureka Rebellion in Ballarat, Victoria. He was captain of one of the miners' divisions. When soldiers stormed the Stockade on 3 December 1854 in the Battle of the Eureka Stockade, Thonen was one of the first to be killed.\nPrior to his emigration to Australia in 1853, Thonen had gained notoriety in England as a jewellery thief. The story of his capture on a ship off the coast of Wales was widely publicised. It even reached Australia in the 1890s, although no one, at the time, appears to have made the connection between the diamond robbery and the events at Eureka. That connection was only made in 2022, thanks to a collaboration of researchers on the genealogy website WikiTree, whose results were later published by the Ballarat and District Genealogical Society.\nBiography\nEarly life\nThonen was born Eduard Thönen, in the Rommelspütt district of Elberfeld, Rhineland, Prussia (now part of Wuppertal, Germany). He was the seventh of eight children of Adolph Friedrich Thönen, a merchant, and Christina Elisabetha Braches. He was baptised on 20 July 1827 in the Lutheran church in Elberfeld. Edward attended the grammar school in Elberfeld. He then served in the Prussian military for about a year.\nThe revolutions of 1848–1849\nIn an attempt to explain Edward's later role in the Eureka Rebellion, there has been some speculation about what he did during the German revolutions of 1848–1849, whether he was politically active, and if he got in trouble with the law.\nElberfeld's citizens joined in late on the democrats' cause during the revolution. Until early 1849, the mainly protestant Elberfeld had been a royalist stronghold, in contrast to the predominately Catholic provincial capital of Düsseldorf. Opinion shifted rapidly though, and on 29 April 1849, a delegation of 500 to 800 residents of Elberfeld made the trip to Düsseldorf to demand that the Prussian government accept the Frankfurt Constitution. The historian Gregory Blake states in his 2013 thesis that Edward may have been among them, although there is no proof of his participation, or that he even was in Elberfeld at the time. In 2012, Peter FitzSimons speculated that Edward may have been expelled from Prussia and went to England as a result of his participation in the revolution. Others have pointed out that England had become a kind of safe haven for political refugees from Germany, and that Thonen may have been among those who found it more suitable, be it forcefully or on his own accord.\nTravel to England, and the diamond robbery\n, 1866 engraving by Francis Holl, after William Powell Frith. The man with the handcuffs is detective Michael Haydon, about to arrest a fugitive.]]\nIn late 1850, Thonen travelled to England from Ostend, Belgium, arriving at the Port of Dover on 10 December 1850. Shortly after arrival, he was robbed and lost all his possessions.\nThonen moved to Finsbury, London. In January 1851 his hotel keeper recommended him to the diamond merchants Jacques Schwabacher and Louis Birnstingl, praising his ability to speak numerous European languages (including French, German, Dutch, and Spanish). They hired him as a clerk at a weekly wage of £1, under the condition that he could be laid off at any time if he did not suit them. They quickly found that he was not suitable as a clerk. Thonen pleaded to be kept on at a reduced salary, while offering his services as a language teacher. The merchants agreed, and Thonen stayed with them until the middle of April. Schwabacher later testified that he last saw him on 23 April, at which point Thonen left the company, claiming to take on a new job as a teacher of foreign languages in Eastbourne.\nAt that time, the merchants kept a parcel of diamonds (jewellery, including bracelets and earrings, worth £450 in total) in their strong room, to which Thonen had free access. He had long dreamed of finding fortune in some faraway country, and had written to the British government about plans to fight the African slave trade. Desperate and short of money, he seized the occasion and stole the jewellery. Thonen must have thought that he had weeks until the robbery would be discovered, but on 28 April Schwabacher decided to show the diamonds to a friend. Upon finding that the seal had already been tampered with and that the jewels were missing, Schwabacher called the police.\nThonen deposited the earrings with a pawnbroker for £40, and used that money to escape from London. Around 25 April, he took the train to Peterborough, from where he continued on to Liverpool. On 2 May, he sold some more of the jewellery in Liverpool, acquiring another £25 and a gold watch. In the afternoon of 5 May, Thonen boarded a steamer, but his plans were thwarted when the vessel was struck and forced to return to port. Thonen then took the Sardinia'' to New York, leaving Liverpool on the morning of 7 May.\nAround that time, Michael Haydon, a detective of the London City force, arrived in Liverpool. He had been put in charge of the case on 28 April and found that Thonen had not gone to Eastbourne, but had travelled northward. Haydon pursued him to Peterborough, where on the evening of 6 May Haydon took the overnight train to Liverpool. He was informed of Thonen's departure on the Sardinia just four hours after the ship had set sail. Haydon hired a steamer, and was able to overtake the much slower Sardinia just 100 kilometres offshore. He found Thonen on board, but the young man claimed to know nothing about the robbery. Nevertheless, Haydon convinced the ship’s captain to let him detain Thonen. Back in Liverpool, after a thorough search was conducted which revealed the remaining jewels, Thonen admitted the crime and helped the police recover the rest of the loot. Haydon then brought the fugitive back to London.\nWhile the media widely applauded the police, and detective Haydon in particular, for their work in solving the case, not everyone shared that positive opinion. Some, including the witness Thomas Dismore from Liverpool, expressed their dissent. In a letter to the editor of the Liverpool Albion, Dismore wrote that the case could have been solved much sooner if the public had been made aware of the robbery more quickly, and that it was pure luck that Thonen had not evaded prosecution.\nThe trial commenced on 10 May. The prosecutors were sympathetic, and Thonen was recommended to mercy. The judge expressed his pity, saying: \"You appear to be a young man of extraordinary talent and ability, and I very much regret seeing you in your present unhappy position. It is a pity your abilities were not directed in a proper channel.\" The court found that Thonen had acted without premeditation. He was given a one-year prison sentence.\nEmigration to Australia\nFollowing his release from prison, Thonen returned to Prussia. German newspapers at the time were full of enthusiastic reports of gold strikes in Victoria and New South Wales, and of the rising number of Britons who returned from trips to Australia with large sums of money. In May 1852, Edward's mother died; his father and brother moved from Elberfeld to Offenbach am Main in early 1853. It is unclear if he considered to join them, but in April 1853, Edward Thonen, then 26 years old, requested permission to emigrate to Australia. The permission was granted on 28 May 1853, and Edward arrived in Australia later that year.\nThe Eureka Rebellion\n(1854)]]\nThonen immigrated to the Ballarat Goldfields of Victoria, Australia. No immigration record apparently survives in Australian archives, but his death certificate indicates that he had been in Victoria for one to two years when he died in December 1854. Eyewitness accounts of the events at Eureka show that he arrived in Ballarat no later than November 1853. In 1854 Thonen was a \"lemonade seller\" at the goldfields. He was a leader of the southern division of miners at the Eureka Stockade.\nDeath\nEdward Thonen was killed on 3 December 1854, during the battle of the Eureka Stockade. His cause of death is given as \"gunshot wound\" in the death certificate. Eyewitness accounts suggest that Edward Thonen was the first person to die at the stockade.\nThonen was buried at the Ballaarat Old Cemetery. His body was later exhumed and buried with other victims of the uprising. He is listed on the monument that was erected in Ballarat in 1856.\nReception\nThe song \"German Teddy\"\nThe Eureka Stockade in general had a huge effect on Australian history, and is remembered to this day. Edward Thonen in particular was the inspiration for a song, German Teddy, probably dating to the 1880s. A manuscript of the song, dated 15 July 1889, was given to New Zealand composer Alfred Hill by Lieselotte Schreiner from Germany, a friend of his, possibly from Alfred's time at the Leipzig Conservatory. The manuscript is in the Alfred Hill collection of the State Library of New South Wales, where it was rediscovered in the 1980s by musicologist Kay Dreyfus.\nThat song, in turn, inspired the 1984 symphony German Teddy by Kay Dreyfus's husband George Dreyfus, an Australian composer of Jewish descent who, like Edward Thonen, was born in Elberfeld. The symphony premiered in Wuppertal in 1986, and was again performed at the Museum of Australian Democracy at Eureka in 2016.\nClaims of Jewish descent\nPrior to the discovery of Edward Thonen's birth certificate in 2021, which showed that he and his family were Christians, Thonen was thought to be of Jewish descent. In a self-published 1954 article by Lazarus Morris Goldman, later reprinted in the Journal of the Australian Jewish Historical Society, Edward was labelled as Jewish, and this was then propagated, expedited possibly by the large number of articles published for the 100th anniversary of the event. Other people of Jewish descent were also involved in the Eureka Stockade, but Edward Thonen allegedly was the only one among those killed. Over the decades, numerous sources have picked up on Edward's story in the wider context of Jewish history in Australia.\nNotes\n:a.See [https://www.wikitree.com/wiki/Th%C3%B6nen-17#_note-newspaper_list here] for a list of newspaper articles about the incident.\nSee also\nHawley Harvey Crippen, a murderer who tried to escape from England by ship, but was overtaken by the police\nReferences\nExternal links\n* [https://web.archive.org/web/20250108234620/https://www.bvff.de/userfiles/downloads/Funzel/Die-Funzel-111.pdf Newsletter article] from Bergischer Verein für Familienkunde in Wuppertal, and [https://www.wikitree.com/photo.php/c/c1/Church_records_of_the_Amt_Battenberg-2.pdf presentation] about Thonen (in German)\n* , with additional links to primary and secondary sources"
    }
  ]
}