{
  "content": [
    {
      "type": "text",
      "text": "# Edward Solly (chemist)\n\nEdward Solly (1819–1886) was an English chemist and antiquary.\nLife\nHe was born in London on 11 October 1819, the son of Edward Solly the merchant and collector. The Sollys were a nonconformist family, and the philosopher Thomas Solly was a cousin. He studied chemistry in Berlin.\nin 1838 Solly was appointed chemist to the Royal Asiatic Society. In the same year he was elected a member of the Society of Arts. He was appointed lecturer in chemistry at the Royal Institution in 1841, where he associated with Michael Faraday, and he was elected an honorary member of the Royal Agricultural Society in 1842. On 19 January 1843 he was elected a Fellow of the Royal Society, and in 1845 he became professor of chemistry at Addiscombe College.\nIn 1845 and 1846, as honorary professor to the Horticultural Society, Solly conducted a series of experiments on the supposed influence of electricity on vegetable growth. From 1849 he was associated with the Gresham Life Assurance Society, of which he remained a director until his death. He was one of the promoters of the Great Exhibition of 1851, and acted as a juror; and from 9 June 1852 to 4 May 1853 he was secretary to the Society of Arts.\nSolly died at his residence, Camden House, Sutton, Surrey, on 2 April 1886.\nWorks\nIn 1836, at the age of 17, Solly published a paper On the conducting power of iodine, &c., for electricity. He went on to publish numerous papers on the chemistry of plants and on agriculture, and a book on Rural Chemistry (1843; 3rd ed. 1850). A syllabus of his lectures on chemistry appeared in 1849.\nAs a genealogical and literary scholar Solly published in Notes and Queries, The Bibliographer, The Antiquary, and other periodicals. In 1879 he edited Hereditary Titles of Honour for the Index Society, of which he was treasurer.\nLegacy\nSolly collected a large library, which was rich in eighteenth-century literature; it was sold at Sotheby's, London, in November 1886. He presented to the National Gallery, London an anonymous picture called A Venetian Painter.\nFamily\nSolly married Alice Sarah Wayland on 13 September 1851, and left five daughters.\nNotes\n;Attribution"
    }
  ]
}