{
  "content": [
    {
      "type": "text",
      "text": "# Edward Streeter\n\nEdward Streeter (August 1, 1891 &ndash; March 31, 1976), sometimes credited as E. Streeter, was an American novelist and journalist, best known for Father of the Bride and his Dere Mable series.\nBiography\nStreeter was born in Buffalo, New York, and educated at Harvard College where he edited The Harvard Lampoon. He began his career as a reporter for the Buffalo newspaper the Buffalo Express as a war correspondent and travel writer. He enlisted in the United States Army in March 1916 as a private and was promoted to 2nd lieutenant in December 1917 in field artillery. He was promoted to 1st lieutenant in December 1918 and was discharged in May 1919 after serving a year overseas with the American Expeditionary Forces in World War I.\nHe grew in fame with his \"Dere Mable\" letters, a humorous column from an undereducated soldier writing home. Serialized between 1917 and 1919 in the 27th Division's magazine Gas Attack, they were inspired by Streeter's time spent on an army base (Camp Wadsworth, near Spartanburg, South Carolina). The humorous letters were compiled in 1919 in Streeter's full-length books \"Dere Mable\", \"Thats me all over, Mable\", and \"Same old Bill, eh Mable\".\nAfter returning home from the war, Streeter pursued writing casually, deciding to focus on his work as a businessman. For eight years he served as assistant vice president, before transitioning to the Fifth Avenue Bank (later, The Bank of New York) in New York City, where he served as vice president for twenty-five years.\nWhile serving as VP of the bank, Streeter published short stories and articles in magazines such as the Saturday Evening Post and ''McCall's. In 1938, he published his first novel, Daily Except Sundays.  In 1944 he was elected to The Century Association, and remained a member for 32 years.  His next novel, the 1949 comic satire Father of the Bride, became an instant bestseller and was listed among The New York Times'' list of bestselling novels for the year. The following year's successful film adaptation starring Spencer Tracy and Elizabeth Taylor spawned multiple remakes, sequels, and a television series.\nAfter his breakthrough success, Streeter continued to write successful novels. Of the most notable of his subsequent works are ''Mr. Hobbs' Vacation (1954, filmed in 1962), Merry Christmas, Mr. Baxter (1956), Mr. Robbins Rides Again (1958), and Chairman of the Bored (1961). He also wrote two non-fiction books about his European travels: Skoal Scandinavia (1952) and Along the Ridge'' (1964). He finished his writing career with 1969's grim semi-autobiographical ''Ham Martin, Class of '17.\nStreeter died on March 31, 1976, in New York City and was buried at Forest Lawn Cemetery, Buffalo, New York.\nBibliography\n*\"Dere Mable\" (1918)\n*\"Thats me all over, Mable\" (1919)\n*\"Same old Bill, eh Mable\" (1919)\n*Daily Except Sunday (1938)\n*Father of the Bride (1949)\n*Skoal Scandinavia (1952)\n*Mr. Hobbs' Vacation (1954)\n*Merry Christmas, Mr. Baxter (1956)\n*Mr. Robbins Rides Again (1957)\n*Window on America (1957)\n*Chairman of the Bored (1961)\n*Along the Ridge (1964)\n*Ham Martin, Class of '17'' (1969)\nReferences\nExternal links\n*\n*\n*\n*[https://web.archive.org/web/20091120050914/http://dlib.nyu.edu/findingaids/html/fales/streeter2.html Guide to The Edward Streeter Papers] in the Fales Library of New York University"
    }
  ]
}