{
  "content": [
    {
      "type": "text",
      "text": "# Edward Oldfield\n\n| death_place         = Noranda, Western Australia\n| constituency        = Maylands, Mount Lawley\n| party               = Liberal, Independent Liberal, Labor\n| spouse              = Margaret Smith\n| profession          = Commercial traveller\n| religion            =\n| signature           =\n| footnotes           = |\n}}\nEdward Peate Oldfield (23 August 1920 – 2 December 1990) was an Australian politician, and a member of the Western Australian Legislative Assembly from 1951 until 1965 representing the seats of Maylands and Mount Lawley at different times.\nBiography\nOldfield was born in Maylands, an inner Perth suburb, to Ernest Henry Oldfield, a commercial traveller, and Lena Eva (née Peate). He attended Victoria Park Primary School and Perth Boys' School, and obtained work as a truck driver by 1940. On 20 May 1940, with Australia actively involved in the Second World War, Oldfield enlisted in the Australian Imperial Force and served in Egypt, Syria and New Guinea with the HQ Co. 2/16th Battalion. On 24 November 1944, he married Margaret Smith at St George's Cathedral, Perth, with whom he had two sons. After attaining the rank of Private, he was discharged in 1945.\nAfter his war service, he worked as a commercial traveller with Wigmores. In April 1949, he was elected to the Bayswater Road Board as a councillor, in which role he served for six years. He had also joined the Liberal Party and, following the death on 21 January 1951 of the long-serving Independent Liberal member for Maylands, he contested and won the resulting 1951 Maylands state election on 17 February 1951 for the party. He served two terms in that capacity.\nDue to a boundary redistribution at the 1956 election, Maylands had become a safe seat for the Labor Party, so Oldfield instead ran for the neighbouring seat of Mount Lawley. However, former Liberal minister Arthur Abbott was the Liberal Party's official candidate, and in a two-horse race, Oldfield won with 67.8% of the votes. He was subsequently refused admission to the Parliamentary Party, a move which was not uncontroversial as it was seen as rejecting \"unendorsed candidates who had clearly won the confidence of electors\". He sat in Parliament as an \"Independent Liberal\", and was appointed by the Labor government to a Select Committee inquiring into welfare conditions in the Laverton-Warburton Range area.\nAt the 1959 election, Labor narrowly lost to the Liberal-Country coalition led by David Brand. Oldfield and another Independent Liberal, Bill Grayden, held the balance of power. In January 1960, Oldfield had joined the Labor Party and was promised unopposed preselection for the 1962 election by opposition leader Albert Hawke. This meant that the Liberal-Country government could not pass electoral legislation which required a majority on the floor, and the scheduled redistribution took place under the old Act. This returned Oldfield to his original Maylands seat.\nHe continued to serve as a Labor member of parliament until 1965, when he was narrowly defeated by the Liberals' Robert Marshall. He pursued other forms of employment, including self-employment and investing in various companies. He served as a councillor in the WA Industrial Institute and the Council for the Blind, and was president of the Maylands RSL.\nHe died at home in Noranda, a north-eastern Perth suburb, and was cremated at Karrakatta Cemetery.\nHis nephew is David Oldfield, the co-founder of Pauline Hanson's One Nation and Member of the New South Wales Legislative Council from 1999 to 2007.\nReferences"
    }
  ]
}