{
  "content": [
    {
      "type": "text",
      "text": "# Edward Robert Atwill\n\n| birth_place      = Red Hook, New York, U.S.\n| death_date       =\n| death_place      = Kansas City, Missouri, U.S.\n| buried           =\n| resting_place_coordinates =\n| religion         = Episcopalian\n| residence        =\n| parents          = Robert Edward & Margaret E. Atwill\n| spouse           =\n| children         = 7, including Douglass H. Atwill\n| occupation       =\n| profession       =\n| education        =\n| alma_mater       =\n| motto            =\n| signature        =\n| signature_alt    =\n| coat_of_arms     =\n| coat_of_arms_alt =\n| module           =\n| module2          =\n| other            =\n}}\nEdward Robert Atwill (February 18, 1840 – January 24, 1911) was first bishop of the Diocese of Kansas City, serving from 1890 to 1911.\nEarly life and education\nAtwill was born on February 18, 1840, in Red Hook, New York, the only son of Robert Edward and Margaret E. Atwill. He was home schooled until he attended Columbia College from where he graduated in 1862. He also studied at the General Theological Seminary, earning a Bachelor of Divinity in 1864. He was awarded a Doctor of Sacred Theology from the University of Vermont in 1882.\nOrdained ministry\nAtwill was ordained deacon on July 3, 1864, by Bishop Horatio Potter of New York, and priest by the same prelate on April 1, 1865. He served his diaconate year as curate at St Luke's Church in New York, and then in 1865 became rector of St Paul's Church in Williamsburg, Brooklyn. He was also for a time curate to the Bishop of Vermont, stationed at St Paul's Church in Burlington, Vermont, while in 1867 he was appointed rector of that church. From 1882 until 1890 he was rector of Trinity Church in Toledo, Ohio.\nBishop\nIn 1890 Atwill was elected as the first Bishop of West Missouri and was consecrated bishop on October 14, 1890, by Presiding Bishop Daniel S. Tuttle. He remained in office until his death on January 24, 1911. He was buried at Forest Hill Calvary Cemetery in Kansas City.\nReferences\nExternal links\n*"
    }
  ]
}