{
  "content": [
    {
      "type": "text",
      "text": "# Edward Saylor\n\n|death_date=\n|image=Luncheon in honor of Doolittle Raiders 141107-N-CS953-015.jpg\n|caption=Ed Saylor in November 2014\n|nickname=\n|birth_place=Brusett, Montana\n|death_place=South Hill, Washington\n|placeofburial= Tahoma National Cemetery\n|placeofburial_label= Place of burial\n|allegiance= United States\n|branch=  United States Air Force\n|serviceyears= 1939–1967\n|rank=  Lieutenant Colonel\n|unit= 17th Bomb Group\n|commands=\n|battles= World War IIDoolittle RaidEuropean Theater of Operations\n|awards= Distinguished Flying Cross\n|laterwork=\n}}\nLieutenant Colonel Edward J. Saylor, Ret. (March 15, 1920 – January 28, 2015) served in the U.S. Air Force. He was a veteran of World War II and participated in the Doolittle Raid on Japan on April 18, 1942. Saylor was one of the last four surviving Doolittle Raiders at the time of his death in 2015.\nEarly life\nSaylor was born in Brusett, Montana, on March 15, 1920, and raised on a cattle ranch. Tired of ranch life, he joined the military in 1939, having never seen a bus or train outside the movies. Saylor saw a poster that promised $78 per month to be a mechanic and offered peacetime pay. This persuaded him to join the U.S. Army Air Corps out of high school.\nMilitary career\nSaylor enlisted on December 7, 1939, at Fort George Wright, Washington. Afterwards, he was enrolled in the Air Corps Training School at Chanute Field, Illinois. When Saylor completed his training, he served as the flight engineer at bases in Washington, South Carolina, and Florida. At the age of 22, he was assigned to the 89th Bomb Squadron in Columbia, South Carolina.\nDoolittle Raid\nIn February 1942, Saylor volunteered for a \"secret mission\", even though he did not know what duties were involved or any other details. This mission ended up being the critical Doolittle Raid.\nSaylor was the flight engineer for Crew#15 of the Doolittle Raiders. He was credited with ensuring that this crew would be able to participate in the raid after an engine malfunction derailed their mission. James Doolittle personally asked Saylor to fix the problem. He had to dismantle and repair the engine on the deck of the aircraft carrier. Despite the fact that this work would normally be done in a depot, Saylor was able to rebuild the engine successfully.\nSaylor remained in the U.S. military following the end of World War II and served the remainder of the war in Europe. He received battlefield commission on March 4, 1945. He remained in the U.S. Army Air Forces until it became a separate branch, the United States Air Force.\nPost War\nSaylor served as an aircraft maintenance officer until leaving active duty on March 29, 1946, serving in the Air Force Reserve until returning to active duty beginning October 25, 1947. His next assignment was as an aircraft maintenance officer with the 140th Air Force Base Unit and the 2470th Air Force Reserve Training Center at Sioux City, Iowa, from October 1947 to June 1949, followed by service as an aircraft maintenance officer with the 325th Fighter Wing and the 318th Fighter Squadron at Moses Lake Air Force Base and then at McChord Air Force Base, from July 1949 to June 1952.\nSaylor next served as assistant base maintenance officer with the 86th Air Base Squadron and the 529th Material Squadron at Paine Air Force Base from July 1952 to October 1953, and then as an aircraft maintenance officer with the 59th Fighter Interceptor Squadron at Goose Air Base in Newfoundland, Canada, from October 1953 to July 1955. His next assignment was as an aircraft maintenance officer with the 530th Air Defense Group, the 84th Fighter Group, and then the 84th Material Squadron at Geiger Field from July 1955 to October 1958.\nSaylor served as an aircraft maintenance officer with the 25th Air Division at McChord Air Force Base from October 1958 to December 1961, followed by service as an exchange officer with the British Royal Air Force at RAF Coltishall, England, where he served as a Senior Technical Officer with the Air Fighting Development Squadron from December 1961 to January 1964.\nSaylor next served as chief of maintenance of the 337th Fighter Group and 337th Consolidated Aircraft Maintenance Squadron with Air Defense Command at Portland International Airport from January 1964 to March 1966, and then as chief of maintenance of the 328th Fighter Wing at Richards-Gebaur Air Force Base from March 1966 until his retirement from the Air Force on October 1, 1967.\nSaylor later pursued ventures in construction and real estate within the private sector. He also owned a restaurant with his wife.\nSaylor was a recipient of the Distinguished Flying Cross and other awards for his service during the war. In 2014, Saylor and the other Doolittle Raiders were awarded the Congressional Gold Medal. He was also honored as the sixth person to receive Enumclaw's Walk of Fame in 2013.\nDecorations\nSaylor's military decorations and awards include:\n{|\n|\n|Distinguished Flying Cross\n|-\n|\n|Air Force Commendation Medal with oak leaf cluster\n|-\n|\n|Air Force Presidential Unit Citation\n|-\n|\n|Army Good Conduct Medal\n|-\n|\n|American Defense Service Medal\n|-\n|\n|American Campaign Medal\n|-\n|\n|Asiatic-Pacific Campaign Medal with one bronze star\n|-\n|\n|European-African-Middle Eastern Campaign Medal with six service stars\n|-\n|\n|World War II Victory Medal\n|-\n|\n|National Defense Service Medal with one bronze star\n|-\n|}\n{|\n|-\n|\n| Air Force Longevity Service Award with one silver oak leaf cluster\n|-\n|}\n&nbsp;&nbsp;Republic of China Medal of the Armed Forces\n&nbsp;&nbsp;Republic of China War Memorial Medal\nPersonal life\nSaylor was married to Lorraine Saylor for 69 years, until her death in 2011. They had three children.\nEdward Saylor died at an assisted living center in Sumner, Washington, on January 28, 2015, at the age of 94. Members of his family revealed he died from natural causes. His death leaves just two surviving Doolittle Raiders.\nReferences\nFurther reading\n*Glines, Carroll V. ''Doolittle's Tokyo Raiders''. Princeton, N.J.: Van Nostrand Co, 1964.\n*[https://www.nytimes.com/2015/01/31/us/edward-j-saylor-airman-who-took-fight-to-japan-with-the-doolittle-raiders-dies-at-94.html?_r=0 Edward J. Saylor, 94 Dies; Took Fight to Japan with Doolittle Raiders] at The New York Times"
    }
  ]
}