{
  "content": [
    {
      "type": "text",
      "text": "# Edward King (Parliamentarian)\n\nEdward King (c. 1606 – 1681) was an English lawyer and politician who sat in the House of Commons from 1660. He supported the Parliamentary cause in the English Civil War. He was a rigid Presbyterian and protector of Nonconformists after the Restoration.\nEarly life\nKing was the son of Richard King of Ashby de la Launde and his wife Elizabeth Colly, daughter of Anthony Colly of Glaston, Rutland and MP for Rutland. He was a student of Gray's Inn in 1623 but delayed being called to the bar for over 20 years.\nOn the outbreak of the Civil War, he became a captain of foot in the Parliamentary army. He took part in the first attack on Newark, and was indicted for treason at the Lincolnshire assizes in 1643. In the same year, he became Sheriff of Lincolnshire to 1644 and Governor of Boston to 1645. He was also a commissioner for levying money and a commissioner for defence, in the eastern association. In 1644 he was commissioner for assessment for Lincolnshire, Deputy Lieutenant for Lincolnshire and colonel in the parliamentary army. He was freeman of Grimsby in 1645. He quarrelled with Lord Willoughby of Parham and Cromwell regarded him with suspicion. After his commissions were cancelled at the request of the county committee in 1645, he held no further county office until 1658.\nKing was finally called to the bar in 1646 and replaced a Royalist as Recorder of Grimsby which position he held until his death. Also in 1646 he stood unsuccessfully for parliament at Grimsby. In 1647 he was accused of obstructing the collection of taxes. He became an ancient of Gray's Inn in 1650. In 1653 he succeeded to the estates of his father, including Ashby Hall. He was commissioner for sewers for Lincolnshire in 1658. In 1659 he was considered to be one of the Lincolnshire Royalists. He was commissioner for militia in March 1660 and a J.P. for Kesteven from March 1660 to 1663.\nPolitical career\nIn April 1660 King was colonel of the foot militia and was elected Member of Parliament for Grimsby in the Convention Parliament. He was one of the most active MPs, being named to 83 committees, in eight of which he took the chair, acting as teller in 24 divisions, and making 45 recorded speeches. He was commissioner for sewers for Lincolnshire in August 1660, commissioner for assessment for Kesteven, Lincolnshire from August 1660 to 1661, commissioner for disbandment from September 1660 to 1661 and commissioner for maimed soldiers from December 1660 to 1661. He did not stand for re-election in 1661. From 1661 to 1663 he was commissioner for assessment for Lincolnshire and from 1663 to 1664 commissioner for assessment for Kesteven, Lincolnshire. He was described as \"a great abettor of sectaries and nonconformists\". He was arrested by the deputy lieutenants during the Second Anglo-Dutch War which he claimed to be an act of personal revenge by Sir Robert Carr and was released after three months. In February 1666 he was committed to the Tower of London for refusing to guarantee his peaceable demeanour. He was expected to enter into a bond for £2,000 \"to appear where he should be directed by the lord lieutenant or any two deputy lieutenants after 20 hours' notice in writing left at his house, to discover all plots, conspiracies etc. and to abstain from all conventicles and seditious meetings.\" He claimed these conditions were \"illegal, infamous and servile’\" and bribed his way out of prison. He stood unsuccessfully at a by-election at Grimsby in 1667 and then probably moved to London. He was said to appear daily \"upon the Exchange\" in his zeal against the renewal of the Conventicles Act. In 1672, he was granted a licence to hold a Presbyterian meeting at his house in Ashby and it was said that he had counselled or set on above 90 actions at common law in the ecclesiastical court at Lincoln in order to protect those questioned for non-conformity.\nDeath\nKing died at Ashby at the age of about 75.\nKing married Anne Ayscough, daughter of Sir Edward Ayscough of Stallingborough, Lincolnshire and had two sons and four daughters.\nReferences"
    }
  ]
}