{
  "content": [
    {
      "type": "text",
      "text": "# Edward Abbott Parry\n\nSir Edward Abbott Parry (2 October 1863 – 1 December 1943) was a British judge and dramatist.\nParry was born in London into a prominent Welsh family, the second son of barrister John Humffreys Parry and grandson of antiquary John Humffreys Parry, a leader of the Welsh literature movement in the early 19th century. His great-uncle Thomas Parry was bishop of Barbados and his great-grandfather Edward Parry was Rector of Llanferres, Denbighshire.\nParry himself studied at the Middle Temple and was called to the Bar in 1885. He was Judge of Manchester County Court 1894-1911 and became Judge of Lambeth County Court in 1911. He wrote several histories, plays and books for children. He was appointed to sit on a Pensions Appeal Tribunal in the summer of 1917, which dealt with appeals against governmental decisions on military pensions, and later published a book on War Pensions: Past and Present'', co-authored with Sir Alfred Codrington, another member of the Tribunal.\nHe died in Sevenoaks, Kent, aged 80.\nParry's autobiography, My Own Way, as published in 1932. To cite one anecdote, he took a summer holiday, probably in 1895 or 1896, in the tiny village of Rhoscolyn on Anglesey and became a great friend of the Revd. John Hopkins, the Rector. When Hopkins died in 1901, Parry was instrumental (with others) in erecting a fine copper memorial tablet in the church. He also published an appreciation in the Cornhill Magazine. There was mutual empathy and warmth of the friendship between two men of very different backgrounds: the London-educated judge, son of a barrister and the iron miner (before his ordination) and son of a Merthyr publican, fined for selling beer during the time of divine service.\nWorks\n*1888: (ed.) The Love Letters of Dorothy Osborne to Sir William Temple, 1652-54. London: Griffith, Farran, Okeden & Welsh\n*1895: Katawampus, its Treatment and Cure. London: David Nutt (many later editions)\n**Katawampus, its treatment and cure, and the First Book of Krab. Illustrated by Archie Macgregor, coloured by Cynthia Moon. Manchester: Sherratt & Hughes, 1921\n*1897: The First Book of Krab: Christmas stories for young and old; with illustrations by Archie MacGregor. London: David Nutt\n*1900: Don Quixote of the Mancha. Re-told by Judge Parry. Illustrated by Walter Crane. London: David Nutt\n*1914: The Law and The Poor. London: Smith, Elder & Co.\n*1922: What the Judge Thought. London: T. Fisher Unwin\n*1923: The Seven Lamps of Advocacy. London: T. Fisher Unwin\n*1925: The Overbury Mystery. London: T. Fisher Unwin\n*1929: The Drama of The Law. London: Ernest Benn\n*1929: The Bloody Assize. London: Ernest Benn\n*1930: Queen Caroline. London: Ernest Benn\n*1931: The Persecution of Mary Stewart [Mary, Queen of Scots]. London: Cassell\n*1932: My Own Way. London, Ernest Benn\nReferences\n* The seven lamps of advocacy. Published 1968 by Books for Libraries Press in Freeport, N.Y .\nExternal links\n*\n*"
    }
  ]
}