{
  "content": [
    {
      "type": "text",
      "text": "# Edward H. Gillette\n\n| birth_date =\n| birth_place = Bloomfield, Connecticut\n| death_date =\n| alma_mater = New York State College of Agriculture\n}}\nEdward Hooker Gillette (October 1, 1840 &ndash; August 14, 1918) was a nineteenth-century populist politician and editor from Iowa. He was elected on the Greenback Party ticket to represent Iowa's 7th congressional district for only one term in Congress, but remained active in populist political movements. Gillette was the son of Senator Francis Gillette and Elisabeth Daggett Hooker, a descendant of Rev. Thomas Hooker, and the brother of actor/playwright William Gillette.\nBorn in Bloomfield, Connecticut, he attended public schools in Hartford, Connecticut as a child and went on to attend the New York State College of Agriculture in Ovid, New York.\nEarly adult life\nForeseeing westward expansion after the war, Francis Gillette and brother-in-law John Hooker had purchased shares in a concern which owned thousands of acres of sprawling Iowa landscape. Edward left college in 1863 to oversee their investment. He settled on a large farm outside of Des Moines, the new capital of the nation's newly added twenty-ninth state. He raised high-bred livestock and later purchased another farm in Walnut Township, four miles west of Des Moines. There he engaged in several business enterprises, including building and manufacturing, while developing his farm.\nOn June 26, 1866, Edward married Sophia Theresa Stoddard, who had formerly been betrothed to his fallen brother, Robert, who had been killed at Fort Fisher, near Wilmington, North Carolina, the morning after the surrender of the fort.\nEdward served as editor of the Iowa Tribune,'' the central organ of the Populist party of Iowa.  He also served as chairman of the Greenback Party's National Committee, and was a delegate to its National Convention in 1876. In 1878, Gillette was elected as a Greenback Party member to the United States House of Representatives, serving in the 46th Congress with fellow Iowa Greenback Party member James B. Weaver from 1879 to 1881.\nPolitical career\nThe May 1876 convention in Indianapolis resulted in the formation of the Greenback Party, which cooperated with the Democratic Party to elect a joint ticket two years later. Edward, representing the 7th Congressional District, ran for a seat in the 46th Congress with the directness and forthright style of his father. The Greenback-Labor Party, supporting issues important in the rural west at the time, pulled in more than a million votes and sent fifteen congressmen, including Edward, to Washington in 1878.\nOn October 10 the Hartford Times reported,\nThis is certainly a great triumph for this Hartford young man ... nominated for Congress by the Greenbackers, then by the Democrats, in a district that at the last election gave a Republican majority of 6,000, and went into the canvass without a dollar to aid him. Against the money and the organization of the Republicans he brought nothing but a personally spirited contest, and depended wholly for what money he obtained upon the sales of newspapers and documents which he carried with him, and sold at 10 cents each from the platform, and by going personally about among the crowd. That he should, under such circumstances, annihilate a Republican majority of 6,000, and change it into a majority of about 1,000 the other way, is a testimony to the popularity, and doubtless also to the favor with which his political ideas are rewarded in Iowa.\nDuring his congressional term, Edward also served as chairman of the State Central Committee of the Union Labor Party.\nEdward served from March 4, 1879, to March 3, 1881. The Democrats put up their own candidate in the next election, dividing the votes and giving an easy victory to his Republican opponent, former diplomat John A. Kasson, who was returning to Congress for the third time.\nAfter term in congress\nFollowing his return from Washington, Edward remained active in local and party politics in the populist cause. In 1893 he was the People's Party candidate for Iowa Secretary of State, but lost.\nHe and Sophia had three children, a son and two daughters. After divorcing Sophia, Edward married Mrs. Jennie Isabel Apple on February 28, 1907.\nEdward served for ten years as editor of the Iowa Tribune, was chairman of the National Committee Union Labor/Populist Party, and served for years as one of the directors of the Iowa Humane Society.\nCongressman Gillette lived out his life on his farm, Clover Hills Place, near Valley Junction, Iowa, close to Des Moines, and died there on August 14, 1918, at the age of seventy-eight. He was interred in the nearby Glendale Cemetery in Des Moines, the only family member not buried in the Hooker or Gillette family plots in Farmington, Connecticut.\nReferences\nExternal links\n*"
    }
  ]
}