{
  "content": [
    {
      "type": "text",
      "text": "# Edward Wightman\n\n| death_place    = Lichfield, Staffordshire, England\n| death_cause   = Execution by burning\n| education      =\n| occupation     = Mercer then minister\n| spouse         = Frances Darbye of Hinckley\n| parents        =\n| children       = 7 children—2 boys and 5 girls\n}}\nEdward Wightman (1566 – 11 April 1612) was an English radical Anabaptist minister, who was known for his Nontrinitarianism view.\nHe was executed at Lichfield on charges of heresy;  He was the last person to be burned at the stake in England by the crime of heresy.\nLife\nEdward Wightman was born in 1566. He attended Burton Grammar School and entered the clothiers business of his mother's family. Eventually, he served an apprenticeship as a woollen draper in the town of Shrewsbury. He married Frances Darbye of Hinckley in 1593 and settled in Burton upon Trent. Apart from his mercer's business in Burton he also became a minister of the local Anabaptist church.\nCase of Thomas Darling\nWightman became involved with the Puritans and in 1596 was chosen as one of the leaders assigned to the investigation of demonic possession of 13-year-old Thomas Darling. This suggests that by the mid-1590s Wightman was an important and well-respected public figure, taking part in the newly formed movement that began to hold sway over Burton's society and politics. His involvement in the Darling case proved a turning point in his life, making him entirely amenable to the possibility of unmediated spiritual intervention. Darling claimed not just to be possessed by the devil, but engaged in a series of 'spiritual wars' in which both demonic and angelic voices were said to emanate from him:\nAs I know at this present for a certainty, that I have the spirit of God within me: so do I with the like certainty believe, that in my dialogues with Satan, when I [quoted] sundry places of scripture, to withstand the temptations he assaulted me with: I had the spirit of God in me, and by that spirit resisted Satan at those times, by [quoting] the scriptures to confound him.\nReligious persecution\nWightman's adoption of \"heresy\" commenced with his understanding of the mortality of the soul, adopting the \"soul sleep\" view of Martin Luther. In one of his early public messages he preached that \"the soul of man dies with the body and participates not either of the joys of Heaven or the pains of Hell, until the general Day of Judgment, but rested with the body until then\".\nBetween 1603/4 and 1610/11, he became more active and vocal. According to court records, he was a prolific writer, although none of his writings have been found to date. He came to the attention of the local church authorities and a warrant for his arrest was issued. The order instructed the constables of Burton to immediately bring him before the Bishop of Lichfield Richard Neile (or Neale) for interrogation.\nCondemned by King James I\nWightman set about putting together a compendium of his theology for his upcoming hearing and defence. Perhaps thinking that he would at least be allowed time to plead his case, he delivered copies of it to members of the clergy in an effort to shore up support but, perhaps as a last resort, he delivered a copy to King James I, a move that would ultimately seal his fate. No copy survives.\nJames I came to the English throne in 1603, \"thinking himself a competent judge of religious questions and disposed to take seriously his title of 'Defender of the Faith'\". Since 1607 he had been engaged in a battle of books with Roman Catholic apologists over the Oath of Allegiance, both personally and by encouraging others to write in his defence. \"One of the central planks of the king's case was the preservation of his catholic orthodoxy through his adherence to the three great creeds of the church, the Apostles', the Nicene and the Athanasian\".\nWightman was fully aware of the king's firmly orthodox stance, yet he set about to combat both his State and Church. Of the handful of fragments of his defence treatise that have survived, he refers to the doctrine and \"heresies of the Nicolaitan;... most of all hated and abhorred of God himself&nbsp;... the common received faith contained in those three inventions of man, commonly called the Three Creeds&nbsp;... the [Apostles'], Nicene and Athanasius Creed, which faith within these 1600 years past hath prevailed in the world\".\nWightman had by now isolated himself from all orthodox groups, calling into question many tenets of orthodox belief, arguing \"that the baptizing of infants is an abominable custom&nbsp;... the practice of the Sacraments as they are now used in the Church of England are according to Christ his Institution&nbsp;... [and affirming that] only the sacrament of baptism [is] to be administered in water to converts of sufficient age of understanding converted from infidelity to the faith\".\nHowever what finally spelled his end was his public rejection of Trinitarianism. It was presumably on these points that he so vehemently rejected the formulae of the Nicene Creed of 325 and the Athanasian Creed of 381. He claimed that the doctrine of the Trinity was a total fabrication, stating that Christ was only a man \"and a mere Creature and not both God and man in one person... [Although this did not mean that Christ was a man like all others but] only a perfect man without sin\". King James was by now more set than ever in securing the execution of Wightman, since in the intervening years he had launched a dual campaign against heresy at home and abroad.\nTrial and death\nEdward Wightman's examination and hearing was addressed in 16 points:\n#That there is no Trinity;\n#That Jesus Christ is not God, perfect God and of the same substance, eternity and majesty with the Father in respect of his God-head;\n#That Jesus Christ is only man and a mere creature and not both God and man in one person;\n#That Christ was never incarnate and did not fulfill the promise that the seed of the woman shall break the serpents head;\n#The person of the Holy Ghost is not God, co-equal, co-eternal and co-essential with the Father and the Son;\n#That the three creeds of the apostolic church are the heresies of the Nicolaitanes;\n#That he, Edward Wightman, is the prophet spoken of in Deuteronomy 18 in the words \"I will raise them up a prophet\" and in Isaiah \"I alone have trodden the wine press\" and in that place \"Whose fan is in his hand\";\n#That he was the Holy Spirit, the Comforter spoken of in John 16;\n#That the words of Jesus on the sin of blasphemy against the Holy Spirit refer to him;\n#That the fourth of Malachi refers to his person (the prophecy of Elijah);\n#That the soul and body does sleep and this sleep is the first death, and that the soul and body of Jesus did also sleep in the sleep of death;\n#That the souls of the elect departed (that is dead) are not in heaven;\n#That the baptizing of infants is an abominable custom;\n#That the practice of the Church of England in reference to the Lord’s Supper and baptism are incorrect and baptism of water should be administered only to those with sufficient age and understanding;\n#That God has ordained and sent him, Edward Wightman, to do his part in the work of the Salvation of the world, (to admonish the heresy of the Nicolaitanes); in comparison to Christ, who was sent to save the world and by his death to deliver it from sin and to reconcile it to God;\n#That Christianity is not wholly professed and preached in the Church of England, but only in part.\nExecution\nWightman's trial was played out against the backdrop of the so-called \"Vorstius Affair\", involving the intense opposition on the King's part to block the appointment of the German academic Conrad Vorstius to the University of Leiden. Vorstius was being accused of atheism, Arianism and heretical opinions about the Holy Spirit.\nAfter months of being subjected to a series of conferences with \"learned divines\", Wightman was finally brought before Bishop Neile for the last time. According to Wightman, the Bishop told him \"that unless I did recant my opinions he would burn me at a stake in Burton before Allholland day next\".\nHe was ordered to be placed \"in some public and open place below the city aforesaid [and] before the people burned in the detestation of the said crime and for manifest example of other Christians that they may not fall into the same crime\".\nWhen he was finally brought to the stake his courage left him, and as the fires were lit he is said to have quickly cried out to recant and was pulled from the fire, although by then he had been \"well scorched\". Two or three weeks later he was again brought before the courts and, no longer fearing the searing flames, refused and \"blasphemed more audaciously than before\".\nThe King quickly ordered his final execution: the written official order was dated 9 March 1611/12. On 11 April 1612, Wightman was once more led to the stake.\nLegacy\nIn the months that followed Wightman's execution, a number of religious radicals nearly met the same fate, even though the downfall of the bishops and abolition of the High Commission in 1640–2 did not bring about any changes to the constitution:\nOn 2 May 1648, a new 'Ordinance for the Punishment of Blasphemies and Heresies' was created, \"principally those of the triune God, the resurrection, the last judgment, and that the Bible is the Word of God...relapse is to be punished as felony with death without benefit of clergy\". Opposition from Independents and sectaries, however, meant that the ordinance was never enforced. Only with the passage of the Ecclesiastical Jurisdiction Act 1677 (\"forbidding the burning of heretics\") was Wightman's position in history \"as the last person in England to be burned at the stake for heresy\" secured.\nMention of his case came almost 100 years later by a handful of writers in the wake of the Toleration Act 1688. The only immediate result was that of a minority opposition to his execution, a shift in public opinion which may have led to a relative decline in the practice.\nJames I seemed to have lost faith in this method of discouraging heresy (his actions owed more to a thaw in his private attitude to Roman Catholics than to any feelings about the impropriety or inadvisability of burning heretics) and seeing that heresy still survived, \"publicly preferred that heretics hereafter, though condemned, should silently and privately waste themselves away in the prison rather than to grace them, and amuse others, with the solemnity of a public execution\".\nAfter anti-Trinitarian Bartholomew Legate executed in London three weeks earlier, Edward Wightman became last person in England to die with this kind of execution for heresy accusation.\nFamily\nLittle is known about the subsequent fate of Edward Wightman's wife and children. It is known, however, that one son, John, was born on 7 January 1599 in Burton. John's son, George (1632–1722) emigrated to North Kingston, Rhode Island, in 1660.\nReferences\nFurther reading\n*\n*\n*[http://www.reformedreader.org/history/christian/ahob1/ahob.htm A History of the Baptists], by John T. Christian\n*A History of the English Baptists, by Joseph Ivimey\n*The Baptist Heritage: Four Centuries of Baptist Witness, by H. Leon McBeth\n*George Wightman of Quidnessett, RI and Descendants, by Mary Ross Whitman, (1939, Chicago: Edwards Brothers).\n*The Wightman Ancestry, Wade C. Wightman, (1994, Chelsea, MI: Bookcrafters).\nExternal links\n*[http://freepages.genealogy.rootsweb.com/~wightman/Edward1566.htm Bruce Wightman's history of Edward the heretic]\n*[https://archive.today/20130505045611/http://staffordshirehistories.co.uk/47112.html Burnt at the Stake: The Heresies of Edward Wightman]"
    }
  ]
}