{
  "content": [
    {
      "type": "text",
      "text": "# Edward Galas\n\n| birth_place       = Lubienia, Poland\n| death_date        = 2003\n| death_place       =\n| death_cause       =\n| citizenship       = Poland\n| fields            = Biochemistry\n| work_institutions = Lodz University of Technology\n| alma_mater        = Lodz University of Technology\n| doctoral_advisor  =\n| doctoral_students =\n| known_for         =\n| spouse            =\n| children          =\n| prizes            = Knight's Cross of the Order of Polonia Restituta\n| footnotes         =\n| religion          =\n| signature         =\n}}\nEdward Galas (; 2 January 1928 – 2003) was a Polish biochemist, Rector of the Lodz University of Technology in 1975–81.\nHe graduated from the Faculty of Biotechnology of Lodz University of Technology. In 1953 he began working in the Institute of Fermentation Technology, Lodz University of Technology. After receiving his PhD at the Department of Biochemistry of Moscow State Academy of Biotechnology, he was employed by the Institute of Technical Microbiology of Lodz University of Technology. In 1968 he established the Biochemistry Laboratory and managed it from the very beginning. Next he was appointed director of a newly established Institute of Biochemistry and held the position until 1998. He was promoted to assistant professor of chemistry in 1966, professor in 1975, and full professor in 1986.\nHis research interests included screening of industrial microorganisms, microbial/enzymatic synthesis, catalytic properties of enzymes and their applications. He also dealt with bacterial polysaccharide synthesis as well as bioconversion and biotransformation.\nBetween 1970 and 1972 Edward Galas was the dean of the Faculty of Biotechnology, then between 1972 and 1975 he was the vice-rector and deputy rector of Lodz University of Technology and in 1975 he became the rector of Lodz University of Technology, and held this position until 1981. He is the author of 200 scientific publications and 350 research notebooks. He supervised 25 PhD dissertations.\nAn activist of the Polish United Workers' Party since 1951.\nReferences\nBibliography\n*"
    }
  ]
}