{
  "content": [
    {
      "type": "text",
      "text": "# Edward H. Meyer\n\nEdward Henry Meyer (January 8, 1927 – April 11, 2023) was an American advertising executive who was CEO and chairman of Grey Global Group from 1970 until his retirement in 2006 following the firm's sale to WPP in 2005 for $1.5 billion.\nEarly life\nEdward Meyer was born in New York City on January 8, 1927, and grew up on the Upper West Side of Manhattan. He graduated from the Horace Mann School, then enrolled at Cornell University. After a 2-year interruption to join the U.S. Coast Guard during World War II, he graduated from Cornell with a degree in economics in 1949.\nEarly career\nIn 1949, Meyer started in the executive training program in the Bloomingdale's division of Federated Department Stores. He moved into the advertising industry in 1951 with the Biow Company, working on Procter & Gamble's Lava soap account.\nGrey Advertising\nMeyer joined Grey Advertising as an account executive in 1956, when the company's revenues were $34 million. He was named president in 1968 and became CEO and chairman in 1970.\nAs CEO was known for needing to known the details about the company's clients. Meyer took a stint as a waiter and shrimp preparer at a Red Lobster in 1988 in order to understand the chain's inner workings. The company then supplied Red Lobster with the tagline, \"For the seafood lover in you.\" In 1966, when Meyer was Executive Vice President overseeing the P&G account, Grey debuted the tagline \"Choosy mothers choose Jif\".\nOver 35 years, Grey grew to bill $4.2 billion annually and was sold to WPP in 2005. The sale netted Meyer approximately $500 million. The New York Times credited Meyer with building Grey into one of the biggest and most profitable advertising agencies in the industry. As part of the deal, Meyer gave up the CEO and chairman roles of Grey Worldwide in September 2005, then the same titles at Grey Global on December 31, 2006. He retired in 2006 after 36 years leading the company.\nDue to his influential tenure at the firm, the New York Times and the Washington Post called Meyer \"the Rupert Murdoch or Sumner Redstone of Madison Avenue\".\nPhilanthropy\nMeyer and his wife Sandy were large benefactors to Cornell University, his alma mater. The couple bestowed $75 million to Weill Cornell Medicine for the Sandra and Edward Meyer Cancer Center. For his 2014 donation, he was named to Weill's board of directors. In 2011, he donated $4 million to Cornell University for the Edward H. Meyer Professorship of Economics. In 2015, the Meyers endowed the Sandra and Edward Meyer Professor of Cancer Research.\nReferences"
    }
  ]
}