{
  "content": [
    {
      "type": "text",
      "text": "# Edward M. Lewis\n\n|birth_place = Machynlleth, Wales\n|death_date =\n|death_place = Durham, New Hampshire, U.S.\n|spouse= Margaret H. Williams (1896–1936)\n|party= Democratic\n|alma_mater = Williams College (A.B., A.M.)Boston School of Expression\n|signature = EdwardMLewis.svg\n}}\n|birth_place=Machynlleth, Wales\n|death_date=\n|death_place=Durham, New Hampshire\n|debutleague = MLB\n|debutdate=6 July\n|debutyear=1896\n|debutteam=Boston Beaneaters\n|finalleague = MLB\n|finaldate=26 September\n|finalyear=1901\n|finalteam=Boston Americans\n|statleague = MLB\n|stat1label=Win–loss record\n|stat1value=94–64\n|stat2label=Strikeouts\n|stat2value=378\n|stat3label=Earned run average\n|stat3value=3.53\n|teams=\n*Boston Beaneaters (–)\n*Boston Americans ()\n}}\nEdward Morgan Lewis (25 December 1872 – 23 May 1936), otherwise known as Ted Lewis, was an American Major League Baseball right-handed pitcher as well as a professor of English literature, academic administrator, the tenth president of the Massachusetts Agricultural College and fifth President of the University of New Hampshire.\nEarly life\nLewis was born in 1872 in Machynlleth, Wales. He emigrated to the United States in 1880.\nBaseball career\nNicknamed \"The Pitching Professor\" and \"Parson\", Lewis was an ordained minister who earned a master's degree from Williams College. He was one of three Welsh-born players to break into major league baseball in the U.S. He was 23 years old when he debuted with the Boston Beaneaters on 6 July 1896.\nLewis pitched a full season in 1897 and earned 21 wins. He was one of three Boston pitchers to finish the season with more than 20 wins. Boston won the league pennant that season and repeated as champions in 1898. His 26–8 win–loss record in 1898 amounted to a league-high winning percentage (.765).\nLewis earned a 17–11 record in 1899, followed by a 13–12 record in 1900. He finished the 1901 season with a 16–17 record and a 3.53 earned run average (ERA). Lewis finished his career with a 94–64 record and a 3.53 ERA.\nAcademic career\nAfter the 1901 season, Lewis retired from baseball to teach full-time at Columbia University. He was instructor of Elocution at Columbia until 1904, when he returned to Williams College as a public speaking instructor and was later made an assistant professor.\nLewis later left for Massachusetts Agricultural College (MAC), where he served as an English professor, department head and dean. He was the president of MAC between 1924 and 1927, and when his liberal philosophy created disagreements with the college's trustees, he submitted his resignation.\nLewis became president of the University of New Hampshire (UNH) in 1927. The university credits him with continuing the development of the school despite the difficulties associated with the Great Depression. He oversaw the construction of new buildings and athletic fields during his tenure. A recreational area known as Lewis Fields constructed from December 1933 to September 1936 was named in his honor. This area includes UNH's college football stadium—now known as Wildcat Stadium—which was known as Lewis Stadium or Lewis Field until it was formally named Cowell Stadium in 1952 in honor of former head coach Butch Cowell.\nLewis remained at UNH until his death in 1936.\nPolitical career\nLewis ran unsuccessfully for Congress in Massachusetts' 1st congressional district in 1910 and in its 2nd congressional district in 1914. In 1912, he was chairman of the Massachusetts Democratic Party's state convention.\nElectoral history\n}}\n}}\nPersonal life\nLewis died of liver cancer in 1936. At the time of his death, he was married and had two sons, a daughter and three grandchildren. He is buried in Durham Cemetery in Durham, New Hampshire. Lewis was friends with poet Robert Frost, who contributed a reading at Lewis's memorial service.\nReferences\nExternal links\n*[https://archive.today/20070613002001/http://www.unh.edu/president/unhpresidentsbios.htm University of New Hampshire: Office of the President]\n*[https://library.unh.edu/find/archives/university-presidents Full list of University Presidents (including interim Presidents) ], University of New Hampshire Library\n*[https://library.unh.edu/find/archives/collections/edward-morgan-lewis-papers-1927-1936 \"Guide to the Edward M. Lewis Papers, 1927-1936\"], University of New Hampshire Library\n*[https://web.archive.org/web/20070929080344/http://ffaith.brynmawrscene.net/index.php/Ted_Lewis Ffaith]\n*[http://www.baseball-almanac.com/players/player.php?p=lewiste01 Baseball Almanac]\n*"
    }
  ]
}