{
  "content": [
    {
      "type": "text",
      "text": "# Edward Pierce (sculptor)\n\n]]\nEdward Pierce or Pearce (1630&ndash;1695)  was a 17th century English sculptor and architectural sculptor. He was also an avid collector of books, drawings and plaster figures.\nLife\nHe was the son of Edward Pearce (d. 1658), a painter and stainer, noted for his decorative paintings in Old Somerset House.\nHe is thought to have trained under Edward Bird working under Christopher Wren on London church interiors. In 1656 he was made a Freeman of The Painters and Stainers Company. In the 1650s he lived at the lower end of Surrey Street in the parish of St Botolph's, Aldgate.\nHis first wood carvings were for Sir Charles Wolseley, 2nd Baronet at Wolseley Hall, where he was responsible for the dining-room.\nThe Great Fire of London in 1666 proved a major boost to his career and he went into a long-term working relationship with Christopher Wren - executing the interiors for many of Wren's churches (built to replace the many destroyed churches).\nHe lived most of his life in a house on Arundel Street, but died on Surrey Street died in March or April of 1695 with his will being granted on 27 April 1695. He is buried only a dozen metres north in the churchyard of St Clement Danes, close to some of his finest interior work.\nRecognition\nHeld in high esteem in his own lifetime an English-owned villa in Rome in 1711 is said to have been decorated by the heads of Palladio, Raphael and Buonarroti on one side and Inigo Jones, Isaac Fuller and Pierce on the other. Many of his drawings are held in the British Museum, Soane Museum and Ashmolean Museum. Some were earlier mis-attributed to William Talman.\nHe was portrayed at least twice:\n*Joint portrait with his father by Alexander Bannerman\n*Portrait with his bust of Milton by Isaac Fuller\nWren churches\n]]\nPierce worked closely with Wren on many projects, creating interiors for Wren's noble exteriors:\n*St Swithin, London Stone on Cannon Street\n*St Benet Fink\n*St Andrew, Holborn\n*St Paul's Cathedral\n*St Clement Danes (1680/1)\n*St Lawrence Jewry\n*St Matthew Friday Street\nOther known works\n]]\nby Pierce]]\n]]\n*Interiors at Wolseley Hall (now demolished)\n*Interiors at the Church of St Lawrence Jewry (interior destroyed in Blitz)\n*Monument to Lord and Lady Maynard (1670) at Little Easton\n*Carving at Emmanuel College, Cambridge (1670)\n*Frontage carvings on Guildhall, London (1670 to 1673)\n*Carvings on the Coopers Hall (1671/2) for the Worshipful Company of Coopers\n*Carvings on the Grocers Hall (1680–84) for the Worshipful Company of Grocers\n*Dragon weather vane for St Mary-le-Bow\n*Pediment and coat-of-arms at Combe Abbey for Lord Craven (1683) under William Winde\n*Carvings at Hampstead Marshall (1661) under William Winde\n*Staircase at Sudbury Hall in Derbyshire (1677)\n*Stone Font and timber interior in St Matthews Church on Friday Street (1685)\n*Bust of John Milton (1656) for Christ's College, Cambridge\n*Terracotta bust of Oliver Cromwell for the National Portrait Gallery, London now in the British Museum\n*Bronze bust of Oliver Cromwell (1672) for the London museum\n*Bust of Christopher Wren (1673) in the Ashmolean Museum\n*Statue of Sir Thomas Gresham for the Royal Exchange, London (c.1680)\n*Bust of Baldwin Hamey the Younger (1680) at the Royal College of Physicians\n*Bust of Thomas Evans (1680) for the Worshipful Company of Painter-Stainers\n*Wooden statue of Sir William Walworth (c.1680) for the Hall of the Fishmongers Company\n*Statue of Queen Elizabeth I for the Royal Exchange, London (1685) for the Worshipful Company of Fishmongers\n*Statue of King Edward III for the Royal Exchange, London (1685) for the Worshipful Company of Skinners\n*Statue of King Henry V for the Royal Exchange, London (1685) for the Worshipful Company of Goldsmiths\n*Pediment over entrance at Bishop's Palace, Lichfield (1687)\n*Public water cistern on Pancras Lane (1673)\n*Carvings for New Hall in Winchester College (1681)\n*Carving at Hampton Court (1689)\n*Seating and fountain at Whitehall Palace (1695)\n*Ornate chimney-pieces for Castle Bromwich Hall in Warwick (1690)\n*Gate posts at Horseheath Hall in Cambridgeshire for Lady Alington (1665)\n*Gate posts at Clare College, Cambridge\n*Dragons on The Monument\n*White marble vases for Hampton Court - one now at Windsor Castle (1700) completed by John Nost\n*The curious column which forms the centrepiece for Seven Dials, London (1693)\n*\nFamily\nIn 1651 he married Anne Smith, a widow, who died in 1695.\nReferences"
    }
  ]
}