{
  "content": [
    {
      "type": "text",
      "text": "# Edward Hodge (1782–1815)\n\n1782\n|death_date= 17 June 1815\n|image=Edward Hodge (1782-1815), English School, circa 1815.jpg\n|caption=Edward Hodge  1815\n|nickname=\n|birth_place=\n|death_place=\n|allegiance=\n|branch=\n|serviceyears=?–1815\n|rank=Major\n|unit=\n|commands=\n|battles=Napoleonic WarsPeninsular War\n|awards=\n|relations=\n|laterwork=\n}}\nMajor Edward Hodge ( 1782 – 17 June 1815) was a British Army officer killed in action the day before the 1815 Battle of Waterloo.\nDeath\nAs a major in the 7th Hussars he was killed during an unsuccessful charge against French lancers in the narrow streets of Genappe on 17June 1815. Following his death, his widow received a pension of £100 per annum from the British government.\nAccording to a contemporary account:\n\"During the retreat through Genappe, the covering squadron of the Seventh Hussars, under the command of Major Hodge of the same regiment, particularly signalized itself. It was formed opposite the Hotel Roi d’Espagne, when a regiment of French lancers entered that village. The landlord, who was conversing with Major Hodge and another officer, observed—\"Gentlemen, you had better retire;\" to which the gallant Major replied— \"We do not fear them;\" and instantly charging, drove them back. Notwithstanding the repeated defeats which the enemy experienced, he returned to the attack with fresh troops, which still failed to make any attempt on these brave men—but some flanking squadrons having passed the bridge at Wais, to his left, and the Ford of the Dyle at Vieux-Genappe, to the right, he was obliged to retire a short distance, but not until his gallant party had sabered a considerable number of the lancers, among whom was the Colonel, who lost his arm. Having re-formed his squadron opposite the post-house at the other side of the village, he again awaited the lancers; but opening to the right and left as they approached him, he found himself attacked by a squadron of cuirassiers, whose powerful horses and heavy armour rendered him perfectly incompetent to withstand them. This brave and distinguished officer fell, covered with wounds, as also several of his men, in this heroic but unequal contest.\"\nThere is a memorial tablet to Hodge and his fellow officer, Lieutenant Arthur Myers, in the Church of Saint Joseph, Waterloo.\nFamily\nHodge married the younger daughter of Sir Edmund Bacon of the Bacon baronets. Their son, Sir Edward Cooper Hodge, went on to command a regiment at the 1854 Battle of Balaclava.\nReferences"
    }
  ]
}