{
  "content": [
    {
      "type": "text",
      "text": "# Edward D. Hamilton\n\n|death_place =\n|party = Whig Party\n|occupation =Attorney\n|spouse= Katherine Royer\n}}\nEdward D. Hamilton (October 3, 1801 &ndash; December 10 or 12, 1883) was an American attorney, military officer, and politician in what became the state of Oregon. A native of Virginia, he lived in Ohio before fighting in the Mexican-American War. A member of the Whig Party, he served as Secretary for the Oregon Territory in the 1850s. Later he practiced law and was a judge in Portland.\nEarly life\nHamilton was born in Culpeper County, Virginia, on October 3, 1801. He received his education in Virginia and later studied law and was accepted into the bar in that state. Hamilton moved to Portsmouth, Ohio, where he served in the militia and was the editor of the Portsmouth Tribune.\nIn 1830, Hamilton married Katherine Royer in Ohio, with one daughter the result of the marriage. In the militia he attained the rank of general. During the Mexican-American War he served with then General Zachary Taylor, with Hamilton’s rank being captain. In 1848, Taylor was elected as President of the United States.\nPolitical career\nIn 1850, President Taylor appointed the fellow Whig Party politician Hamilton to the position of Secretary of the Oregon Territory. The position had been turned down by Abraham Lincoln. Hamilton replaced Democrat Kintzing Prichette, taking office on September 18, 1850. When he arrived with new governor John P. Gaines aboard the vessel Falmouth, the capitol of the territory was in Oregon City. In 1851, the legislature moved the capitol to Salem, but Hamilton and Gaines refused to accept the new location.Carey, Charles Henry. (1922). [https://archive.org/details/historyoregon00henrgoog/page/n508  History of Oregon.] Pioneer Historical Publishing Co., p. 497-501. Those opposed to the move invoked the one subject rule of the laws governing the territory, claiming that the law passed moving the seat of government contained more than one subject and was invalid. The Oregon Supreme Court and the United States Treasury agreed the capitol was still Oregon City, but Congress later overturned these decisions by passing a law designating Salem as the capitol. Hamilton remained in office until May 14, 1853.\nLater years\nAfter leaving office Hamilton remained in Oregon. He formed a law partnership with Benjamin Stark in 1854 in Portland. Hamilton was also the secretary for the now defunct Oregon City Female Seminary at that time. He was a vice president of the American Sunday School Union from 1854 to 1855. From 1858 to 1862 he served as judge for Multnomah County, where Portland is located, the first judge after statehood. He then served as county clerk. Edward D. Hamilton died on either December 10, or 12, 1883, at the age of 82.\nReferences\nExternal links\n*[https://books.google.com/books?id=FT8-vm8sCl8C&dq=edward+hamilton+oregon&pg=PA153 Financial History of Oregon]"
    }
  ]
}