{
  "content": [
    {
      "type": "text",
      "text": "# Edward Thompson (Royal Navy officer)\n\n1738\n|birth_place      =\n|death_date       = 17 January 1786\n|death_place      = Gulf of Guinea\n|placeofburial    =\n|allegiance       = Kingdom of Great Britain\n|branch           = Royal Navy\n|serviceyears     = 1755–1786\n|rank             = Captain\n|commands         = HMS KingfisherHMS RavenHMS NigerHMS HyaenaHMS Grampus\n|known_for        =\n|battles          =\n*Seven Years' War\n**Battle of Quiberon Bay\n*American Revolutionary War\n**Battle of Grenada\n**Battle of Cape St Vincent\n|awards           =\n|memorials        =\n|alma_mater       =\n|spouse           =\n|children         =\n|relations        =\n|laterwork        =\n|signature        =\n}}\nEdward Thompson (c. 1738– 17 January 1786) was an English Royal Navy officer who rose to the rank of captain, known also as a literary figure with the nickname \"Poet Thompson\".\nLife\nThe son of a merchant of Kingston upon Hull, he received his early education at Beverley, and later at Hampstead under Dr. Cox, formerly of Harrow School. He is said to have made a voyage to Greenland in 1750. In 1754 he was on board an East Indiaman and made a voyage to the East Indies. On his return to England he entered on board , a 64-gun-ship, as a midshipman. Two years later, on 16 November 1757, he passed his examination and was promoted to be lieutenant of , in the North Sea and the Channel; ten days later, in December 1758, he was moved into  with Captain Peter Denis. During the Seven Years' War he was in the long blockade of Brest through the summer of 1759, and was present at the Battle of Quiberon Bay on 20 November in March 1760 he accompanied Denis to , in which he stayed till the end of the war. He was then put on half-pay, and took on the role of man of letters.\nOn 10 January 1771, perhaps through the influence of David Garrick, he was promoted to the rank of commander and appointed to the , in service in the North Sea on preventive work. At the end of the year he was moved into HMS Raven, in which he went out to the Mediterranean, where Sir Peter Denis, the commander-in-chief, promoted him to be captain of  by a commission that was confirmed by the Admiralty and dated 2 April 1772. In June he brought the Niger home and was again for some years on half-pay.\nIn May 1778 Thompson was appointed to , a small frigate, which early in 1779 he took out to the West Indies, returning to England with convoy in September. In December the Hyaena was attached to the fleet which under Sir George Brydges Rodney relieved Gibraltar, and was sent home with despatches. In August 1780 she went out to New York in charge of a convoy, and from there to Charlestown and Barbados. On 29 March 1781 Thompson wrote from Barbados that under the admiral's orders he was going to take Berbice and establish colonies at Demerara and Essequibo. This mission occupied most of the year, Thompson organising the government of the colonies and taking measures for their defence. Rodney had returned to England; Sir Samuel Hood, left in command, had gone to New York; and in November, Thompson, at the request of merchants, convoyed their trade to Barbados. He took on himself the responsibility of shipping it to Europe. In his absence, the Guiana colonies were captured by a small French squadron; and on 1 April Thompson was tried by court-martial on the charge of having left his station and returned to England without orders. The court, however, honourably acquitted him.\nIn 1782 he was appointed to the 50-gun , in which he went out to the west coast of Africa as commodore of the small squadron there.  He died, unmarried, on board the Grampus on 17 January 1786. His portrait was engraved by A. McKenzie.\nWorks\nHis anonymous satire The Meretriciad (1755?), in which he celebrated the charms of Kitty Fisher and some of her associates, reached a sixth edition in 1765. It was followed by the 'Demi-Rep' (1756), by the 'Courtesan,’ and by several other 'Meretricious Miscellanies,’ as the author called them. None of these works bore the author's name. They were collected in 1770 under the collective title of The Court of Cupid. In the previous year he had issued a boisterous ode entitled 'Trinculo's Trip to the [Stratford] Jubilee.' It was dedicated to 'John Hall', i.e. John Hall Stevenson.\nHis 'Sailor's Letters, written to his Select Friends in England during his Voyages and Travels in Europe, Asia, Africa, and America, from the year 1754 to 1759' (2 vols. 1767), which depicts the social life of the navy, as well as giving an account of the battle of Quiberon Bay. Thompson also edited the Works of John Oldham (3 vols. 1771); of Andrew Marvell (3 vols. 1776); and of Paul Whitehead (1777). He wrote sea songs including 'Loose every Sail to the Breeze,’ and 'The Topsail shivers in the Wind.'\nIn 1773 he altered from the old play of Charles Shadwell 'The Fair Quaker: or the Humours of the Navy,’ which was produced at Drury Lane on 11 November 1773 and then printed. Jane Pope played the title rôle and the revival was a success. In 1775 he published 'The Case and Distressed Situation of the Widows of the Officers of the Navy,’ dated from 'St. James's Street,’ and in the following year his two-act masque called 'The Syrens,’ which was given at Covent Garden, and printed during 1776. The dedication, to Mrs. Vaughan, is dated from Kew.\nIn 1784 he visited Charles Murray, the British consul at Madeira, and while there wrote his 'nautic poem' entitled 'Bello Monte,’ in which he describes the discovery of the island.\nReferences\n;Attribution\n*"
    }
  ]
}