{
  "content": [
    {
      "type": "text",
      "text": "# Edward Burton Hughes\n\n|birth_place  = Lansingburgh, New York\n|death_date   =\n|death_place  = Delmar\n|restingplace = Albany Rural Cemetery\n|restingplacecoordinates =\n|birthname    =\n|spouse       = Jane Williams\n|relations    =\n|children     =\n|alma_mater   =\n}}\nEdward Burton Hughes (1905 – 6 June 1987) was an American, the Acting Commissioner of New York State Department of Transportation in 1969, Executive Deputy Commissioner of New York State Department of Transportation from 1967 to 1970, and Deputy Superintendent of New York State Department of Public Works from 1952 to 1967. Hughes worked over 45 years in public service at the DOT. Upon his retirement in 1970, he founded the E. Burton Hughes Achievement Award.\nBiography\nHughes was born in Lansingburgh, New York, in 1905. Edward and his parents, Edward B. Hughes and Susan, resided at 693 Third Avenue, Troy, New York, and it was here Edward Jr.'s brother John was born in 1909. Edward's father worked as a bookkeeper at a local grocery store in Troy, New York. Edward Jr. attended Lansingburgh High School and furthered his education at Rensselaer Polytechnic Institute (the oldest private engineering and technical university in the USA) from which he graduated.\nCareer\nHughes joined the New York State Department of Public Works in 1925 as a junior civil engineer in the Bureau of Bridges and Grade Crossings in the main office at Albany. From 1949, Hughes was appointed Director of the Department of Rights of Way and Claims on a yearly salary of $19,500. For four years before that, he had been Assistant Director. In 1952, Hughes became Deputy Superintendent of New York State Department of Public Works, a post he served continuously until Governor Nelson Rockefeller assigned him the newly created position of Executive Deputy Commissioner of the New York State Department of Transportation in 1967.\nIn 1942, during WWII, Hughes served as a captain assigned to the Division of the United States Army Corps of Engineers (USACE) in Baltimore. In 1944, Hughes was promoted to major. He returned to state service in 1945 and resumed his post as Assistant Director of the Rights of Way and Claims Bureau.\nIn 1952, Hughes was appointed Deputy New York State Superintendent of Public Works. A report in the New York Times announced his promotion. During Hughes' post as Deputy Superintendent of New York State Department of Public Works, he worked alongside the Superintendents Bertram Dalley Tallamy (until 1955), John W. Johnson (1955-1959), and John Burch McMorran (1959-1967).\nIn 1953, at the New York State Conference of Mayors and Other Municipal Officials, Hughes gave his ‘Good Roads for All’ speech, the title of which became associated with him. ‘I suspect all of you, having arrived in Monticello, now are instilled with that insistent Catskill Mountain slogan: ‘We want good roads.’ All of us in the Public Works Department concur, and are doing everything possible to bring more and more good roads to every corner of our great Empire State. It is a tremendous task, and I appreciate this opportunity to outline for you what is being done...etc.’ In May 1953, Governor Thomas Edmund Dewey appointed Hughes as Chairman of the nine-member Advisory Board to help the State Safety Division’s Bureau of Safety and Accident Prevention. The Advisory Board was formed to draft accident prevention policies and programs.\nIn 1954,Hughes announced during a speech he gave at the State Association of Highway Engineers Annual Convention that the State was '20 years behind in essential road work. $4 Billion is needed just to catch up on the backlog of essential highway construction.\" Understandably, the news came as a complete shock to everyone at the convention.\nWhen Nelson Rockefeller became Governor of New York State in 1959 (a post he held until 1973), Hughes and Rockefeller became close working colleagues. In 1967, when Rockefeller created the New York State Department of Transportation, Rockefeller assigned Hughes the position of Executive Deputy Commissioner of the New York State Department of Transportation. Through their working association, their respective families also became friends. An original etching by actor/artist Lionel Barrymore gifted to Nelson Rockefeller by Hughes is housed at the Rockefeller family home Kykuit (also known as the John D. Rockefeller Estate) in Pocantico Hills, in Westchester County, New York.\nIn 1962, as representatives of the Department of Public Works, J. Burch McMorran and Hughes accompanied Governor Nelson Rockefeller on a tour of the Niagara Frontier for a series of inspections and dedication ceremonies involving, power, bridge, arterial and park facilities. The trip included the dedication ceremony of the new South Grand Island Bridge, which was part of the Niagara Power Project.\nWhen John Burch McMorran retired from his post as Commissioner of New York State Department of Transportation on 31 July 1969,\nGovernor Rockefeller appointed Hughes the top-level post of Acting Commissioner of the New York State Department of Transportation for the interim period of two months until the new Commissioner, Theodore W. Parker, could take office.\nHughes was a popular choice. Congressman Robert Cameron McEwan, in the U.S. House of Representatives, hailed the selection of Hughes to be Acting Commissioner of Transportation for the State of New York: ‘I am well acquainted with Mr. Hughes,’ said McEwan, ‘during my 12 years in the New York State Senate, I recognize his ability as an engineer and administrator.’\nIn a telegram from Congressman Robert Cameron McEwan to congratulate Hughes upon being selected for the post, McEwan wrote: ’Your experience, knowledge and understanding of the Department, and the transportation needs of our state, eminently qualify you for this position. The Governor is to be congratulated for his excellent choice.’\nSome newspaper reports rumored Hughes was to have been made the commissioner full-time, but, as happened, Hughes planned to retire from public office several months later (in 1970) after serving 45 years in public service. During his long career, Hughes served alongside 7 Governors of New York: Al Smith (1925-1928), Franklin D. Roosevelt (1929-1932), Herbert H. Lehman (1933-3/12/1942), Charles Poletti (3/12/1942-31/12/1942, Thomas E. Dewey (1943-1954), W. Averell Harriman (1955-1958), and Nelson Rockefeller (1959-1969).\nDuring Hughes' time as Acting Commissioner some of the works he introduced and proposed included a 60-mile-an-hour speed limit on Route 20, proposed the reconstruction of 4.2 miles of the Shore Airport Road (County Route 43) in the village and town of Ticonderoga, Essex County, and announced the proposal of the construction of 2.66 miles of the Susquehanna Expressway, to be known as Interstate Route 88, plus allied connector roads at Oneonta in Otsego county,\nHughes was a member of the University Club of Albany and the American Association of State Highway and Transportation Officials. He died at age 82 on Saturday 6 June 1987 at his home in Delmar, New York. His burial took place at the Albany Rural Cemetery.\nFamily\nHughes married Jane Williams (b. 1906, New York) on July 2, 1930, in Rensselaer, New York. Edward and Jane first lived at 534 Second Avenue in Troy, New York and then 10A Second Avenue, in the same city. For most of their married life the couple resided in Delmar at 26 Wiltshire Drive, Albany County, New York, 12054.\nJane Williams is the niece of the writer and poet Rev. Aeneas Francon Williams. Jane's mother, Grace Williams (b. 1862), was the sister of the renowned Welsh writer and geographer John Francon Williams. In 1885, Grace married Welsh-born Robert Henry Williams (1860-1931) in Bethesda, North Wales, hence Grace and her children retained the Williams surname. In late 1891, Grace and Robert and their two young children, Robert Henry (b. 1886) and William John (b. 1888), emigrated to the US, arriving in New York City in January 1892. The family settled in Granville, Washington, New York. Robert worked as a slate quarryman. Grace and Robert went on to have five more children, all born in America: John Francon (1893-1974, named after her brother), Mary (b. 1896), Jean (b. 1897), Robert C. (b. 1901) and Jane (b. 1906). In the mid-1910s, Robert Henry Williams became a reporter in Lynn, Massachusetts, and an assistant editor on the Lynn Daily Item. During the 1920s, he was a reporter on the Lynn Telegram News.\nThe E. Burton Hughes Achievement Award\nThe prestigious E. Burton Hughes Achievement Award was given annually to an outstanding department employee of the New York State Department of Transportation. It as named in honor of Hughes, who retired in 1970 as Executive Deputy Commissioner after 45 years of Department service. All the recipients of the award receive a silver bowl, an inscribed plaque, and a monetary check.\nRecipients of the E. Burton Hughes Achievement Award\n* 1970: Matthew E. Elder - winner of the first E. Burton Hughes Achievement Award, was a foreman with the State Department of Transportation's Washington County Residency.\n*1971: Larry L. Leggett - winner of the second E. Burton Hughes Achievement Award in the New York DOT.\n* 1973: David Putz - winner of the fourth E. Burton Hughes Achievement Award, worked in the Planning Division of the Planning and Research Bureau.\n* 1974: Philip D. Morey - winner of the fifth E. Burton Hughes Achievement Award, and an employee of the Albany regional office of the Department of Trade.\n* 1978: Richard Chimera - winner of the ninth E. Burton Hughes Achievement Award, a Niskayuna resident. The award signified Chimera's selection as the outstanding employee of the Department of Transportation for 1978. New York State Commissioner of Transportation William C. Hennessy presented Chimera with the award on December 5, 1978.\n* 1979: Mr. Wendell French - winner of the tenth E. Burton Hughes Achievement Award, a former graduate of Pulaski Academy & Central School (1944) and DOT employee for 35 years.\nSee also\nNotes\n* E. Burton Hughes appointed Deputy Superintendent of the State Public Works Department to succeed Fed W. Finch. Finch applied for retirement from the $15,840-a-year post last week because of ill health. Hughes, a native of Troy, has been director of the department's bureau of rights of way and claims since 1949.:Plattsburgh Press-Republican, 19 August 1952, front page – New Deputy Sup’t of State PWD Appointed (report).\n* Governor Nelson Rockefeller appointed E. Burton Hughes as Acting Commissioner of Transportation to fill the vacancy created by the retirement of John Burch McMorran on 31 July 1969:The Adirondack Record-Elizabethtown Post, 31 July 1969, front page – Burton Hughes Named Acting Comm. Of Trans. (report).\n* McEwan Hails the Appointment of Hughes:Ogdensburg Journal, 25 July 1969, front page  – McEwan Hails the Appointment of Hughes (report).\n* E. Burton Hughes remained in the post of (acting) Commissioner of New York State Department of Transportation for two months until 2 September when Theodore W. Parker aged 60 (a retired Army General) was assigned the position:The Massena Observer, 7 August 1969, page 20 – T. Parker Succeeds B. McMorran (report).\n* E. Burton Hughes of Delmar, a State career employee since 1925, has been designated by Governor Rockefeller as Acting Commissioner of Transportation to fill temporarily the vacancy created by the retirement, 31 July, of J. Burgh McMorran. Mr. Hughes, who has been Executive Deputy Commissioner since 1967, joined the Department of Public Works in 1925 as a junior civil engineer. He became its Deputy Superintendent in 1952 and, with the creation of the successor Department of Transportation in 1967 he was named Executive Deputy Commissioner:The Brewster Standard, 31 July 1969, front page – McMorran Quits Public Works Post – Chief of State Transportation Since 1959 Received Praise from Rockefeller as he Reaches Retirement Age of 70 (report).\n* Photograph taken on 27 April 1967 in the Red Room: Nelson Rockefeller signing the Highway Safety Bill: The picture includes John Burns, J. Burch McMorran, E. Burton Hughes, Dr. Andrew Fleck, Albert Danzig, William Eckhof, Dr. Warren Knox, Holden Evans, James Honey, Ellis Tiker, Dr. Hollis Ingram, Richard Stewart, R. Burdell Bixby and James Allen.  Nelson A. Rockefeller photographs, Gubernatorial Press office, Series 3: New York (State). Governor (1959-1973: Rockefeller) Nelson A. (Nelson Aldrich).\n* Nelson A. Rockefeller personal papers, Art, Series C, 1931-1979: Huber-Hull Collection: Nelson A. Rockefeller personal papers, Art, Series C, Sub-series 3: CKU Reference Files: General correspondence and memoranda concerning loans of NAR artworks, possible purchases and inquiries and comments from the public. Huber, Carlos Hubert, Thomas Hudson Guild Hudson, Joseph L. Jr. (The J. L. Hudson Company) Hudson River Museum Hudson River School Hudson Art Valley Association Huethwohl, Charles Huff, Mrs. E. L. Hughes, E. Burton Hughes, Margaret Hulett, Katherine Hull etc.\nFurther reading\n* E. Burton Hughes biography in The New York Red Book, 1977.\n* State Aide is Promoted; E. Burton Hughes Is Appointed Deputy Public Works Chief, 1952.\n* Edward Burton Hughes [https://imageshack.com/a/O6eW7/1 Family Collection]\nReferences"
    }
  ]
}