{
  "content": [
    {
      "type": "text",
      "text": "# Edward Anders\n\n| birth_place       = Liepāja, Latvia\n| death_date        =\n| death_place       = San Mateo, California, U.S.\n| spouse            = Joan F. Anders\n| nationality       = American\n| fields            = Cosmochemistry\n| work_institution  =\n| alma_mater        = Ph.D., Columbia University, 1954\n| known_for         =\n| awards            =\n|Leonard Medal, Meteoritical Society, 1974\n|V. M. Goldschmidt Award, Geochemical Society, 1990\n}}\n| footnotes         =\n}}\nEdward Anders (June 21, 1926 – June 1, 2025) was a Latvian-born American chemist and professor of chemistry at the University of Chicago. His major areas of research included the origin and ages of meteorites, the existence of presolar grains in meteorites, the Solar System abundance of chemical elements, and mass extinctions in Earth history. In the 1970s, he was one of the 142 principal investigators who studied lunar samples brought back to Earth by the Apollo program. After retiring from scientific research in 1991, he became a prominent researcher, speaker and writer on issues related to the Holocaust in Latvia.\nEarly life and education\nAnders was born Edward Alperovitch in the Latvian coastal city of Liepāja in 1926. Both his mother (Erica, née Sheftelovitch-Meiran) and his father (Adolf) were part of a German-speaking Jewish merchant community. In 1940, the Soviet Union occupied Latvia, and in 1941, Latvia was invaded by Nazi Germany. Anders's father was among many Liepaja Jews murdered by the Nazis in the early months of the occupation. Anders and his mother evaded Nazi annihilation by pretending that she was an Aryan foundling raised by Jews,  until they were able to flee Latvia near the end of World War II.\nAfter the end of the war, Anders settled in Munich, where he attended first the UNRRA University, a makeshift institution created by the United Nations Relief and Rehabilitation Administration solely to serve refugees, and then the University of Munich. In August 1948, Anders appeared as a prosecution witness at the Nuremberg High Command Trial, where he gave evidence of German soldiers carrying out lootings and shooting Jewish civilians in Liepaja during 1941.\nIn 1949, Anders arrived in New York City, where he  embarked on a master's degree in chemistry at Columbia University. He earned a Ph.D. from Columbia in 1954, benefiting from the mentorship of Columbia nuclear-chemistry professor Jack Malcolm Miller.\nCareer\nAnders spent most of his scientific career on the chemistry faculty at the University of Chicago. He arrived as an assistant professor in 1955, gained tenure a few years later and was named the Horace B. Horton professor in 1973. He spent 1963–64 at the University of Bern as a visiting professor on sabbatical; he returned to the Swiss university for six shorter stays from 1970–1990. His first academic appointment was as an instructor at the University of Illinois (Champaign-Urbana) from 1954 to 1955. He received the Quantrell Award.\nIn 1959, Anders won the Newcomb Cleveland Prize from the American Association for the Advancement of Science for his work on meteorites and asteroids. His findings during this period included evidence that meteorites come from the asteroid belt, and an explanation for the ways tiny diamonds could be created in meteorites, without requiring the enormous pressure that could only be found in larger bodies with greater gravitational forces.\nIn 1973, Anders received the NASA Exceptional Scientific Achievement Medal, acknowledging his work analyzing multiple batches of lunar samples brought back to Earth by the Apollo project. In 1974, Britain's Royal Astronomical Society named him an honorary foreign member, or associate. He also was elected to the U.S. National Academy of Sciences in 1974.\nAnders and colleagues began documenting evidence of stardust within meteorites in 1978, publishing findings in Science suggesting that \"primitive meteorites contain yet another kind of alien, presolar material: dust grains ejected from red giants.\" Subsequent research by Anders and coworkers established the presence of diamonds, silicon carbide and graphite in meteorites' interstellar grains. In a 1991 interview with Discover, Anders referred to meteorites as \"the poor man's space probe.\"\nIn the 1980s, Anders and colleagues published evidence in Science and Nature of catastrophic fires 65 million years ago, caused by a giant meteorite crash in the Gulf of Mexico. Their research on the Cretaceous–Paleogene extinction event analyzed silt sediments from sites as far away as Europe and New Zealand. In each case, they found high amounts of iridium (a rare element associated with certain meteorites) and massive amounts of carbon (associated with global fires) in the same layers. \"The first year after the impact was a dramatic and dangerous period for life on Earth,\" Anders told The New York Times.\nIn 1989, Anders and Belgian astronomer Nicolas Grevesse published \"Abundances of the Elements,\" a scientific paper cataloging the most reliable estimates to date of meteorite and solar abundances of more than 80 elements, ranging from hydrogen to uranium. Their findings have been cited in more than 11,000 subsequent papers by other scientific researchers, according to Google Scholar.\nHolocaust research\nIn 2003, Anders and co-author Juris Dubrovskis published \"Who Died in the Holocaust? Recovering Names From Official Records\". Their article, which appeared in Holocaust & Genocide Studies, used Latvian, German, Israeli and other records to document the fate of each of Liepaja's 7,140 Jewish residents during Nazi Germany's occupation. Anders and Dubrovskis established that only 208 survived.\nIn 2004, Latvia's president, Vaira Vīķe-Freiberga, spoke at the dedication of a Holocaust memorial in Liepāja. She closed by saying: \"I want to thank the Liepāja Holocaust Memorial Committee, its chairman Mr. Edward Anders, Mr. Vladimirs Bāns, the authors of the project, and all who lent a hand to make this Memorial become reality.\"\nDeath\nAnders died in San Mateo, California, on June 1, 2025, at the age of 98.\nReferences"
    }
  ]
}