{
  "content": [
    {
      "type": "text",
      "text": "# Edward Augustus Freeman\n\n|birth_place   = Metchley Abbey, Harborne, Warwickshire, England\n|death_date    =\n|death_place   = Alicante, Spain\n|education     =\n|alma_mater    = Trinity College, Oxford\n|occupation    = Historian\n|known_for     =\n|title         = Regius Professor of Modern History\n|term          = 1884–1892\n|predecessor   = William Stubbs\n|successor     = James Anthony Froude\n|spouse        =\n|partner       =\n|children      =\n|parents       =\n|website       =\n|footnotes     =\n}}\nEdward Augustus Freeman (2 August 182316 March 1892) was an English historian, architectural artist, and Liberal politician, a one-time candidate for Parliament. He held the position of Regius Professor of Modern History at Oxford, where he tutored Arthur Evans; later he and Evans were activists in the Balkan uprising of Bosnia and Herzegovina (1874–1878) against the Ottoman Empire.\nAfter the marriage of his daughter Margaret to Evans, he and Evans collaborated on the fourth volume of his History of Sicily. He was a prolific writer, publishing 239 distinct works. One of his best known is his magnum opus, The History of the Norman Conquest of England (published in 6 volumes, 1867–1879).\nBiography\nEarly life\nFreeman was born at Metchley Abbey in Harborne, Warwickshire (now a suburb of Birmingham). His parents, John and Mary Ann ( Carless) Freeman, used the Latin name of the month in which he was born as his middle name. They were a family of modest means; however, the paternal grandfather, Joseph Freeman (about 1768–1822), had been a wealthy man, and the owner of Pedmore Hall. On his death, his will was disputed, and lawyers' fees consumed the bulk of the estate. Edward's father, the oldest son, and his two paternal uncles, Keelinge and Joseph, received little to sustain them.\nEdward's mother, Mary Anne, née Carless (or Carlos), had noble ancestry, descending through her father, William, then residing near Birmingham, from the same Colonel William Carless who had assisted the future Charles II as he hid from his enemies in the branches of the Royal Oak after the Battle of Worcester, 1651, the last of the English Civil War. Mary Anne's family still displayed the coat of arms given to them.\nThe family was never in good health. They delayed baptising Edward for a year, hoping to avoid public exposure to contagious diseases. The family was struck by tragedy in November 1824, when the father died of an unknown disease, the mother died four days later of tuberculosis, and the oldest daughter, Mary Anne, then age 14, died of an unknown disease the same day, 25 November. Edward's paternal grandmother, Emmete Freeman, immediately took charge of the three survivors, Edward and his two sisters, Sarah and Emma, aged 13 and 10 respectively, bringing them to her home at Weston-super-Mare. Emma died in 1826 when Edward was three years old.\nEducation and marriage\nin 1891]]\nFreeman was educated at private schools and by a private tutor. Even as a boy, he was interested in religious matters, history and foreign politics. He won a scholarship to Trinity College, Oxford, and a second class in the degree examination, and was elected fellow of his college (1845). While at Oxford he was much influenced by the High Church movement, and thought seriously of taking orders, but abandoned the idea. He married Eleanor Gutch (1818–1903) daughter of his former tutor, the Reverend Robert Gutch, on 13 April 1847 at Seagrave, Leicestershire, and entered on a life of study.\nHe lived in Llanrumney Hall, Cardiff, in the mid 19th century. Freeman later bought a house called \"Somerleaze\", near Wells, Somerset, and settled there in 1860.\nDeath\n, Spain]]\nFrom 1886 Freeman was forced by ill health to spend much of his time abroad. In February 1892 he visited Spain in company with his wife and two younger daughters. He fell ill at Valencia on 7 March, but on the 9th went on to Alicante, where his illness proved to be smallpox. He died at Alicante on 16 March, and was buried in the Protestant cemetery there (now referred to as the \"British cemetery\" section of the Cementerio de Alicante). He left two sons and four daughters. The Latin inscription on his gravestone was written by his son-in-law, Sir Arthur Evans.\nHis eldest son, Harold, married Alice Mary Wakefield. She was the daughter of Daniel Wakefield and the granddaughter of Thomas Attwood.\nCareer\nHistorian\nat Usk Castle, Monmouthshire, in 1876]]\nFreeman was made D.C.L. of Oxford and LL.D. of Cambridge honoris causa, and when he visited the United States on a lecture tour was well received at various institutions of learning. In 1884 he was appointed Regius Professor of Modern History at Oxford, and was, for a time, a non-resident professor at Cornell University. Whilst at Oxford, he presided over the Stubbs Society, an exclusive group of high-achieving historians. He was elected a member of the American Antiquarian Society in 1885.\nHe advanced the study of history in England in two directions: by insistence on the unity of history, and by teaching the importance and right use of primary sources.  Politics was at the core, for he often said, \"History is past politics and politics present history.\" }} He urged that history not be divided \"by a middle wall of partition\" into ancient and modern, nor broken into fragments as though the history of each nation stood apart. He declared it more than a collection of narratives, deeming it a science, \"the science of man in his political character.\" Freeman asserted that the historical student should view all history as within his range, and have his own special range within which he masters every detail (Rede Lecture).\nFreeman's range included Greek, Roman and the earlier part of English history, together with some portions of foreign medieval history, and he had a scholarly though general knowledge of the rest of the history of the European world. Freeman regarded Rome as \"the central truth of European history,\" the bond of its unity, and he undertook his History of Sicily (1891–1894) partly to illustrate this unity. He believed that all historical study is valueless unless based on a knowledge of original authorities, and explained how they should be weighed and used. He did not use manuscript authorities, however, and maintained he had no need to do so for most of his work, as the authorities he needed were already in print.\nHis reputation as a historian rests chiefly on his six-volume History of the Norman Conquest (1867–1879), his longest completed work. In common with his works generally, it is distinguished by exhaustiveness of treatment and research, critical ability, and general accuracy. He is almost exclusively a political historian, and his works are infused with personal insights he gained from his practical experience of people and institutions. His saying that \"history is past politics and politics are present history\" is significant of this limitation of his work, which dealt less with other subjects in a nation's life.\nJ. W. Burrow proposed that Freeman, like William Stubbs and John Richard Green, was a historical scholar with little or no experience of public affairs, with views of the present which were Romantically historicised and who was drawn to history by what was in a broad sense an antiquarian passion for the past, as well as a patriotic and populist impulse to identify the nation and its institutions as the collective subject of English history, making\n}}\nPolitician\nFreeman involved himself in politics, was a follower of Gladstone, and approved the Home Rule Bill of 1886, but objected to the later proposal to retain the Irish members at Westminster. To enter Parliament was one of his ambitions, and in 1868 he unsuccessfully contested Mid-Somerset. Foreign rather than domestic politics were his main interest. He expressed an antipathy for the Turks and was sympathetic with the smaller and subject nationalities of eastern Europe. He was prominent in the agitation which followed \"the Bulgarian atrocities\" of the April Uprising; his speeches were often intemperate, and he was accused of uttering the words \"Perish India!\" at a public meeting in 1876. This, however, was a misrepresentation of his words. He was made a knight commander of the Order of the Saviour by the King of Greece, and also received an order from the Prince of Montenegro.\nFor some years he was an active county magistrate. He served on the royal commission on ecclesiastical courts, being appointed in 1881.\nFreeman was an opponent of the Imperial Federation movement. He was a proponent of Anglo-Saxonism.\nPrejudices\nFreeman's attitude towards Jews has been described as one of disdain. His private correspondence had referred to British Prime Minister Benjamin Disraeli as \"the dirty Jew\". Of Jews in America more generally, he wrote:\n}}\nIn a letter to a friend, describing America, Freeman wrote, \"This would be a grand land if only every Irishman would kill a negro, and be hanged for it\".\nWorks\nArchitecture\nFreeman had a particular interest in ecclesiastical architecture and visited many churches. He soon began a practice of making drawings of buildings on the spot and afterwards tracing them over in ink. His first book, except for his share in a volume of English verse, was a History of Architecture (1849). Though he had not then seen any buildings outside England, it contains a good sketch of the development of the art. In 1851 he published An Essay on the Origin and Development of Window Tracery in England, which proposed the terms \"Flowing\" and \"Flamboyant\" (the latter term already in use in France, though not with exactly the same meaning, continuing right through the English Perpendicular Period) instead of Thomas Rickman's \"Decorated\", which had been generally adopted since it was first published in 1817. The same year Edmund Sharpe published an alternative proposal, The Seven Periods of English Architecture, dividing the fenestration of the Decorated period between a Geometrical Period to 1315 followed by a Curvilinear Period to 1360. Though Rickman's scheme remains in use, the subdivisions proposed by both Freeman and Sharpe are also often found in recent books.\nHistorical works and journalism\nFreeman's life was marked by a prodigious literary output. His published scholarly works include the six large volumes of Norman Conquest, his unfinished History of Sicily, and his William Rufus (1882). He wrote several others on the early Middle Ages, and produced works on Aratus, Sulla, Nicias, William the Conqueror, Thomas of Canterbury, Frederick II and many more. He was also interested in Switzerland and in comparative constitutional history. Freeman wrote articles for various other publications, including reviews for newspapers and other periodicals, and was a prolific contributor to the Saturday Review until 1878, when he ceased to write for it for political reasons.\nThe naturalist William Henry Hudson was dismissive of Freeman's style of argument in his 1920 book ''Dead Man's Plack and an Old Thorn''.\nBibliography\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\nBooks and papers\nFreeman's personal library of some 6,500 volumes was bought for Owens College, Manchester, by the trustees of Sir Joseph Whitworth, and it remains in the college's successor institution, the University of Manchester, though no longer kept together. A catalogue was published by the college in 1894. Most of Freeman's papers are also now held in the University of Manchester Library, including works in manuscript, correspondence and 6,200 of his architectural sketches of European churches.\n}}\nSources\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\nFurther reading\n*\n*\n*\n*\n*\n*\n*\n*  [On the American Frederick Jackson Turner]\n*\n*\n*\n*\n*\nExternal links\n*\n*\n*\n* [https://archiveshub.jisc.ac.uk/manchesteruniversity/data/gb133-eaf Freeman Papers] at John Rylands Library, Manchester."
    }
  ]
}