{
  "content": [
    {
      "type": "text",
      "text": "# Edward Francis Ryan\n\n1956)}}\n1956\n| predecessor = Matthew Francis Brady\n| successor = Robert Francis Joyce\n| ordination = August 10, 1905\n| ordained_by = Giuseppe Ceppetelli\n| consecration = January 3, 1945\n| consecrated_by = Richard James Cushing, Francis Joseph Spellman, and Francis Patrick Keough\n| rank =\n| birth_date =\n| birth_place = Lynn, Massachusetts, U.S.\n| death_date =\n| death_place = Burlington, Vermont, U.S.\n| previous_post =\n| education =\n| motto =\n}}\nEdward Francis Ryan (March 10, 1879 &ndash; November 3, 1956) was an American prelate of the Catholic Church. He served as bishop of the diocese of Burlington in Vermont from 1945 until his death in 1956.\nBiography\nEarly life\nEdward Ryan was born on March 10, 1879, in Lynn, Massachusetts, to Simon Joseph and Mary (née Breen) Ryan. After graduating from Ingalls Grammar School in Lynn, he attended Lynn Classical High School and Boston College in Boston, where he was editor-in-chief of The Stylus. He furthered his studies at the Pontifical North American College in Rome.\nPriesthood\nRyan was ordained to the priesthood in Rome for the Archdiocese of Boston by Archbishop Giuseppe Ceppetelli on August 10, 1905. He said his first mass at the Basilica of San Clemente al Laterano in Rome. He earned a doctorate in theology from the Pontifical Urban College for the Propagation of the Faith in Rome.\nAfter finishing in Rome, the archdiocese assigned Ryan to pastoral work in the archdiocese. After American entry into World War I in 1917, Ryan was commissioned as a first lieutenant in the US Army. He served as a chaplain with the 89th Infantry Division during the 1918 Meuse–Argonne offensive in Belgium and France.\nOn his return to Massachusetts at the end of the war, Ryan served as curate in two parishes before becoming the pastor of Our Lady, Help of Christians Parish in Concord, Massachusetts. He became pastor of Holy Name Parish in the West Roxbury neighborhood of Boston in 1932. Our Lady of Perpetual Help in Roxbury was a mission station of Holy Name. Ryan started construction of an enlarged church in 1937, which was completed in March 1939. He also instituted the practice of a number of novenas. He served as state chaplain for the Catholic Daughters of America.\nBishop of Burlington\nOn November 11, 1944, Ryan was appointed the fifth bishop of Burlington by Pope Pius XII. He received his episcopal consecration on January 3, 1945, at the Cathedral of the Holy Cross in Boston from Archbishop Richard Cushing, with Archbishop Francis Spellman and Bishop Francis Keough serving as co-consecrators. He was installed at the Cathedral of the Immaculate Conception in Burlington on February 7, 1945.\nDuring his 11-year-long tenure as bishop, Ryan established the first Carthusian monastery in the United States in Whitingham, Vermont in 1951.  He also established the Benedictine Priory at Weston, Vermont in 1953, and the College of St. Joseph at Rutland, Vermont, in 1954. He erected almost two dozen new churches, established the Vermont Catholic Tribune in 1956, and provided a camp and a school for boys in Burlington.\nDeath\nEdward Ryan died in Burlington on November 3, 1956, at age 77. He is buried at Resurrection Park Cemetery in South Burlington, Vermont.\nReferences"
    }
  ]
}