{
  "content": [
    {
      "type": "text",
      "text": "# Edward St. John Neale\n\nForefront: French interpreter Blekman, Japanese interpreter.\nBackground (from left to right): Three Japanese governors of Yokohama, Duchesne de Bellecourt, Daimyō Sakai-Hida-no-Kami, Colonel Neale (British representative in Japan), Admiral Jaurès, Admiral Kuper ]]\n, on board the flagship Euralyus in August 1863.]]\nEdward St. John Neale (1812–1866) was a British Lieutenant-Colonel and Diplomat who was active in Asia in the 1860s. He was the Chargé d'affaires of Great Britain in Japan in 1862–1863. Neale, who had been stationed in Beijing from 1860 as Secretary of the Legation following the settlement of the Second Opium War, was transferred to Japan in March 1862, when Rutherford Alcock went home on leave. Alcock returned to Japan in 1864 (to be replaced by Sir Harry Parkes as British Minister in Japan in 1865).\nActions in Japan\nFollowing the murder of Charles Lennox Richardson in September 1862, Neale exercised great caution in his response to the Japanese authorities, earning the furious opprobrium of the Western community in Yokohama, who called for immediate retribution.  He was eventually vindicated by the British Government and appointed CB in 1863 for his coolness. In March 1863, the Emperor of Japan issued the Order to expel barbarians, which led Neale to issue an ultimatum to the Japanese government, which was on the brink of starting a war with foreign powers in order to return to the isolation policy. Neale was extremely vocal when the Bakufu, under pressure from the Emperor, was finally forced to issue a declaration promulgating the end of relations with foreigners. The order was forwarded to foreign legations by Ogasawara Zusho no Kami on 24 June 1863. Lieutenant-Colonel Neale, responded in very strong terms, equating the move with a declaration of war:\nA few days later, on 2 July 1863, Colonel Neale led the negotiations for the reparations following the 1862 Namamugi incident, in which foreigners were attacked and one killed by a party from Satsuma, The failure of Satsuma to apologize and pay for reparations led to the Bombardment of Kagoshima by the Royal Navy in August 1863, in which Neale participated on board the flagship Euralyus.\nModern appraisal\nNeale received a mixed but ultimately complimentary review in the 2004 book by Cortazzi on the relations between Japan and Great Britain:\nNotes\nReferences\n* Cranmer-Byng, J. L. (1962) The old British Legation at Peking, 1860–1959 [http://sunzi1.lib.hku.hk/hkjo/view/44/4401041.pdf]\n* Polak, Christian. (2001). ''Soie et lumières: L'âge d'or des échanges franco-japonais (des origines aux années 1950). Tokyo: Chambre de Commerce et d'Industrie Française du Japon, Hachette Fujin Gahōsha (アシェット婦人画報社).\n* __________. (2002). 絹と光: 知られざる日仏交流100年の歴史 (江戶時代-1950年代) Kinu to hikariō: shirarezaru Nichi-Futsu kōryū 100-nen no rekishi (Edo jidai-1950-nendai). Tokyo: Ashetto Fujin Gahōsha, 2002. ;\n* Rennie, David Field, The British Arms in North China and Japan, Originally published 1864.  Facsimile by Adamant Media Corporation (2005),\n* Sir Ernest Satow (1921), A Diplomat in Japan, Stone Bridge Classics,\n* Denney, John. Respect and Consideration: Britain in Japan 1853–1868 and beyond''. Radiance Press (2011).\nExternal links\n* Sir Hugh Cortazzi (2003) \"The British Bombardment of Kagoshima in 1863\" The Asiatic Society of Japan [https://web.archive.org/web/20080705020758/http://www.asjapan.org/Lectures/2003/Lecture/lecture-2003-05.htm]"
    }
  ]
}