{
  "content": [
    {
      "type": "text",
      "text": "# Edward Casso\n\n| term_end     = January 2013\n| preceded     = Val Vigil\n| succeeded    = Dominick Moreno\n| birth_date   =\n| birth_place=Thornton, Colorado\n| death_date=\n| death_place=\n| spouse=Selena\n| party=Democratic\n|}}\nEdward Casso (born 1974) is a former legislator in the U.S. state of Colorado. Elected to the Colorado House of Representatives as a Democrat in 2006, Casso represented House District 32, which encompasses suburbs of Denver, Colorado in northwestern Adams County, from 2006 to 2012.\nBiography\nBorn in Thornton, Colorado, Casso earned a bachelor's degree in political philosophy from the University of Colorado at Boulder in 1997. He was the first member of his family to attend college. While at CU, Casso was president of the CU College Democrats. There, he was a precinct committeeperson for the Boulder County Democratic Party and a member of the vacancy committee that appointed Ron Tupa to the Colorado State Senate.\nAfter moving to Adams County, Casso served as a precinct committeeperson, co-captain of house district 32-D, and vice-chair and later chair of the Adams County Young Democrats. He has also served as chair of the Colorado Democratic Party Outreach Commission, and worked as an intern for Congressman David Skaggs.\nBefore being elected to the legislature, Casso worked as a teacher in an alternative high school during summers, and as a substitute teacher for Denver Public Schools. Casso resides in Commerce City, Colorado; he and his wife, Selena, have two children: Cecelia and Aristotle.\nLegislative career\n2006 election\nIn the 2006 Colorado legislative elections, Casso defeated Republican Tracey Snyder with 57 percent of the popular vote. Casso was endorsed by the Denver Post, but not the Rocky Mountain News.\n2007 legislative session\nIn the 2007 session of the Colorado General Assembly, Casso sat on the House Education Committee and the House State, Veterans, & Military Affairs Committee.\nDuring the 2007 session, Casso sponsored two bills to revise the ways in which schools' CSAP test scores were reported. One, which would have exempted scores from special education students, was killed in a Senate committee; the other, which would have exempted scores for students whose parents opt the students out of the test, was killed in a House committee at Casso's request because of concerns that it would jeopardize federal school funding.\nFollowing the legislative session, Casso was present at the Colorado State Capitol during an incident in which state troopers shot and killed a mentally ill individual gunman targeting Gov. Bill Ritter. Casso observed the dead body and afterwards supported increased security, including metal detectors, for the state capitol building. He also served on the interim legislative Health Care Task Force and the Police Officers' and Firefighters' Pension Reform Commission between legislative sessions.\nIn October 2007, Casso was honored by LARASA, the Latin American Research And Service Agency with the Lena L. Archuleta Education Service Award, for his work in the legislature, including a vote in committee that benefitted LARASA Learning Centers.\nAfter the legislative session, Casso was elected deputy whip for the House Democratic Caucus.\n2008 legislative session\nIn the 2008 session of the Colorado General Assembly, Casso sits on the House Business Affairs and Labor Committee and the House State, Veterans, & Military Affairs Committee.\nAfter killing a bill he sponsored to extend a combined high school-community college program to school districts on the Ute Mountain and Southern Ute Indian Reservation, at the request of tribal leaders, Casso is expected to travel to the reservations to discuss the program following the legislative session.\n2008 election\nCasso sought a second term in the legislature in 2008 and faced no opposition in either the August Democratic primary or the November general election.\n2009 legislative session\nFor the 2009 legislative session, Casso was named to a seat on the House State, Veterans, and Military Affairs Committee and as vice-chair of the House Business Affairs Committee. He was also nominated for the post of House Majority Caucus Whip, but lost the caucus' vote for the post to Rep. Claire Levy. Casso has also sponsored legislation to declare September 11 a state holiday.\n2010 legislative session\nAfter Casso praised Gov. Bill Ritter's decision not to run for a second term in January 2010 and harshly criticized the sitting Democratic governor, House Speaker Terrance Carroll replaced Casso as vice-chair of the House Business Affairs Committee with Rep. Sara Gagliardi.\n2010 election\n2011 legislative session\n2012 legislative session\nRepresentative Casso announced he would not seek reelection in the 2012 General Election.  Casso is succeeded by former legislative aide Dominick Moreno who was elected over his Republican opponent.\n2016 Congressional election\nCasso formed an exploratory committee for the 2016 election to the United States House of Representatives in .\nReferences\nExternal links\n* [https://web.archive.org/web/20080922015342/http://www.state.co.us/gov_dir/leg_dir/House/members/Hou32.htm Colorado General Assembly profile]"
    }
  ]
}