{
  "content": [
    {
      "type": "text",
      "text": "# Edward Smith Lees\n\n| birth_place   =\n| death_date    =\n| death_place   = Broughty Ferry, Dundee\n| nationality   =\n| other_names   =\n| occupation    = Secretary of the Irish Post OfficeSecretary of the Postmaster General of Scotland\n| years_active  = 1801–1846\n| known_for     =\n| notable_works =\n}}\nEdward Smith Lees (30 March 1783 – 24 September 1846) usually known simply as Edward Lees was Secretary to the Postmasters General of Ireland and later to the Post Office for Scotland remaining in public service for 45 years. He was knighted by King George IV.\nFamily\nBorn in 1783 to Sir John Lees, 1st Baronet and Mary Cathcart, Lees was the fourth son with six brothers and a sister, amongst them the Irish clergyman and political pamphleteer Harcourt Lees. He married a daughter of Capt. Clarke of the 40th Regiment of Foot in 1821 but they had no issue. Lees was personally knighted by King George IV during his state visit to Ireland in the same year.\nFor many years Lees had a heart complaint and died at Broughty Ferry, on the outskirts of Dundee on 24 September 1846.\nCareer\nAt only 18 years of age, by a patant dated 23 March 1801, Lees was jointly appointed with his father as Secretary of the Irish Post Office, a position his father already held in his own right since 1774 until his death in 1811.\nFollowing several official reports, mostly commissioned by the House of Commons, that exposed scandals at the Irish Post Office it was considered that it was no longer possible to let Ireland continue to manage its own postal affairs as it had done since 1784. Between Edward Lees and his father, they held sway for almost 60 years but despite the reports of bribery Edward was not expelled from the post office, instead he was transferred to the same position in Edinburgh in 1831.\nIn April 1840, as part of the British postal reforms, Lees was responsible for informing the Scottish postmaster about the introduction of the first postage stamps and the accompanying postal stationery, sending them samples of the Mulready stationery and the Penny Black, though, as they were not ready at that time, no Two Penny Blue stamp samples were sent. His notice also provided information on possible forgeries and cancelling the new stamps.\nLees had spent 45 years in the public service when he resigned as the Post Office Secretary in Edinburgh in 1846.\nReferences\nFurther reading\n*  (JSTOR subscription required)\n*\nExternal links\n* To all postmasters\n* [https://books.google.com/books?id=5XRbAAAAQAAJ&pg=PA6 Report from the Select Committee on Postage 1843]"
    }
  ]
}