{
  "content": [
    {
      "type": "text",
      "text": "# Edward Barton (diplomat)\n\nSir Edward Barton (c. 1562 – 28 February 1598) was an English diplomat who was Ambassador to the Ottoman Empire, appointed by Queen Elizabeth I of England.\nBarton went to Constantinople in 1578, in the pay of the Levant Company, as secretary to the founder of the English embassy in the city, William Harborne and in 1588 was left by Harborne as English agent. By this time, he was fluent in Turkish and well respected in the court.\nThis was a time of war between England and Spain, and Barton was charged with trying to obtain the support of the Ottomans in this struggle, while of course working to defend English commercial interests by for example trying to persuade the Porte to prevent Florence from trading in cloth in Ottoman territory. Barton requested a portrait of Elizabeth I from England which he could show the Sultan and hang in his lodgings to comfort English visitors.\nIn 1590, Poland asked Barton to urge Sultan Murad III not to attack the Cossacks in Poland, who constantly raided the Empire. His argument was that injury to Poland, which was an active trading partner with England, who were in turn at war with Spain, was in effect aiding \"the main enemy of the Turks\". Barton did so, and the Sultan agreed to peace with Poland.\nIn 1596, Barton accompanied Sultan Mehmet III in his campaign against Hungary and was present at the siege of Eger.\nDuring his time in the city there were difficulties with his neighbours, who were offended by the raucous behaviour of guests at Barton's parties.\nOn 28 February 1598, Barton died of dysentery and his body was ceremonially taken from Pera House to the island of Heybeliada for burial in the cemetery of the Christian church. The Fugger agent in Venice reported that \"the funeral of the late English envoy was carried out with great solemnity and attended by many distinguished gentlemen and representatives of foreign countries\". His grave was later removed to the British Haydarpaşa Cemetery in the district of Üsküdar.\nReferences"
    }
  ]
}