{
  "content": [
    {
      "type": "text",
      "text": "# Edward Morris Erskine\n\nThe Hon. Edward Erskine  (28 March 1817 – 19 April 1883) was a British diplomat who was envoy to Greece and Sweden and Norway.\nEarly life\nEdward Morris Erskine was born on 28 March 1817. He was the fourth son of David Erskine, 2nd Baron Erskine, and his wife Frances Cadwalader (a daughter of General John Cadwalader).\nCareer\nHe entered the diplomatic service as attaché to his father at Munich, and after various junior posts including attaché at Brussels he was appointed secretary of legation at Turin in 1852. He was transferred to the same post at Washington, D.C. in May 1858 but moved again to Stockholm at the end of that year. In April 1860 he was posted to St Petersburg, again as secretary of legation, but moved on in November to the same role at Constantinople. In 1864 he was appointed Minister to Greece.\nDuring his stay there nothing of importance happened until the Dilessi murders in 1870 (the seizure of Lord and Lady Muncaster and their party by brigands, who killed several of the hostages). Erskine's handling of the affair was much criticized, but in his temperate reaction he reflected the view of the British cabinet, which wished to avoid being pushed into Palmerstonian 'gunboat' diplomacy. – Oxford Dictionary of National Biography\nIn 1872 Erskine was transferred to be Minister to Sweden and Norway. His duties there included negotiation of a bilateral treaty on the extradition of criminals (superseded by later European conventions, currently the European Arrest Warrant). He remained at Stockholm until 1881, when he retired on a pension.\nEdward Erskine was appointed CB in 1873.\nPersonal life\nOn 24 July 1847 Edward Erskine married Caroline, daughter of Robert Hamilton Vaughan and widow of Andrew Loughnan. They had three daughters and a son.\nShe died on 23 October 1877. Erskine died at his home, Neville House, Twickenham, on 19 April 1883.\nReferences\nExternal links\n*[http://www.thepeerage.com/p18697.htm#i186965 Hon. Edward Morris Erskine] – thepeerage.com"
    }
  ]
}