{
  "content": [
    {
      "type": "text",
      "text": "# Edward Ofere\n\n| birth_place = Lagos, Nigeria\n| height =\n| position = Striker\n| currentclub = FC Trelleborg\n| clubnumber = 15\n| youthyears1= 1998–2003\n| youthclubs1= Enugu Rangers\n| years1 = 2003–2005 | clubs1 = Enugu Rangers    | caps1 = 77 | goals1 = 18\n| years2 = 2005–2010 | clubs2 = Malmö FF         | caps2 = 85 | goals2 = 24\n| years3 = 2010–2012 | clubs3 = Lecce | caps3 = 18 | goals3 = 3\n| years4 = 2013–2014 | clubs4 = Trelleborgs FF   | caps4 = 11 | goals4 = 8\n| years5 = 2014      | clubs5 = FC Vestsjælland  | caps5 = 7  | goals5 = 2\n| years6 = 2014–2015 | clubs6 = Sogndal  | caps6 = 8  | goals6 = 0\n| years7 = 2015      | clubs7 = Inverness Caledonian Thistle  | caps7 = 10  | goals7 = 5\n| years8 = 2015      | clubs8 = Boluspor  | caps8 = 8   | goals8 = 0\n| years9 = 2016      | clubs9 = Dundee United  | caps9 =  13 | goals9 = 3\n| years10 = 2017      | clubs10 = FC Rosengård  | caps10 = 11 | goals10 = 1\n| years11 = 2018     | clubs11 = FLC Thanh Hóa  | caps11 = 12 | goals11 = 5\n| years12 = 2020–    | clubs12 = FC Trelleborg\n| nationalyears1= 2009 | nationalteam1= Nigeria U-23 | nationalcaps1= 3 | nationalgoals1 = 0\n| club-update = 17:52, 28 March 2021 (UTC)\n}}\nEdward Ofere (born 28 March 1986) is a Nigerian footballer who plays as a striker for FC Trelleborg in Division 3 Södra Götaland. He made three appearances for the Nigeria U-23 in 2009.\nClub career\nMalmö FF\nBorn in Lagos, Nigeria, Ofere started his football at Nigerian side Enugu Rangers and progressed his youth team, as he went on to make seventy–seven appearances and scoring eighteen times in all competitions. At the point, Ofere wanted to play football in Europe as he believed it would benefited his development than in Africa, leading to a trial at Allsvenskan side Malmö FF. It was announced on 1 September 2005 that Ofere joined Allsvenskan side Malmö FF on loan for the rest of the 2005 season following an impressive trial. Upon doing so, he was granted a work permit to play in Sweden.\nOfere made his Malmö FF debut, coming on as a substitute, in a 1–0 loss against Djurgårdens IF on 12 September 2005. He then made his European debut, coming on as a 65th-minute substitute, in a 4–1 loss against Beşiktaş in the second leg of the UEFA Cup first round. Four days later on 3 October 2005, Ofere scored his first Malmö FF goal, in a 4–1 loss against Landskrona. It was announced on 21 October 2005, Ofere signed for the club permanently on a three-year contract. Having appeared in every match since joining the club, he made seven appearances and scoring once in all competitions.\nAhead of the 2006 season, Ofere continued to impress in the club's pre–season tour, including scoring a hat–trick against Thanda Lions on 13 January 2006. Despite suffering from a thigh injury, which he quickly recovered from, Ofere scored on his first appearance of the season, losing 2–1 against Hammarby on 17 April 2006. Three weeks later on 8 May 2006, he scored his second goal of the season, in a 3–1 win against Helsingborg. However, Ofere found his first team opportunities limited, due to competitions from Afonso Alves, José Júnior, Niklas Skoog, Jari Litmanen, Jesper Bech and Jonatan Johansson. As a result, he was sent to the B team for the rest of the 2006 season. At the end of the 2006 season, Ofere made nine appearances and scoring two times in all competitions.\nIn the 2007 season, Ofere spent most of the season, mostly coming on from the substitute bench. This was due to his continuous struggle to fight for his place in the first team, but was called up to the starting line–up following the injuries of strikers. Despite this, he scored four goals, in an 11–0 win against Stenungsunds in the second round of the Svenska Cupen. During the season, Ofere was also sent to the B team. At the end of the 2007 season, he made fifteen appearances and scoring four times in all competitions.\nAt the start of the 2008 season, Ofere suffered a groin injury that he sustained at the pre–season and was sidelined for a month. It wasn't until on 28 April 2008 when he made his first appearance of the season, coming on as a 34th-minute substitute, in a 4–2 loss against Helsingborgs. In a follow–up match against Örebro, Ofere scored a brace, in a 3–0 win. Since returning from injury, Ofere became a first team regular, playing in the striker position under the new management of Roland Nilsson. It wasn't until on 25 August 2008 when he scored the equalising goal for the side, in a 1–1 draw against Trelleborg. Ofere then scored three goals in three matches between 30 September 2008 and 19 October 2008, scoring against Helsingborgs, Örebro and GAIS. In the last game of the season against GIF Sundsvall, he scored twice for the side, in a 6–0 win. At the end of the 2008 season, he made twenty–one appearances and scoring nine times in all competitions. Following this, Ofere signed a two-year contract with the club.\nThe 2009 season saw Ola Toivonen left the club, leading Ofere continuing to be a first team regular for the side. However, he struggled to score goals since the start of the 2009 season. It wasn't until on 14 September 2009 when Ofere scored his first goals of the season, in a 2–1 win against Djurgården. This was followed up by scoring against Elfsborg (twice), Gefle (twice) and Hammarby. After serving a one match suspension, he then scored his fourth brace of the season, as well as, two other goals, in a 5–4 loss against Kalmar. Ofere followed up by scoring his tenth goal of the season, in a 1–1 draw against IF Brommapojkarna in the last game of the season. At the end of the 2009 season, he went on to make twenty–nine appearances and scoring ten times in all competitions. Following this, his performance in the 2009 season attracted interests from Championship side Newcastle United keen to sign him, although the move was denied by Malmö FF.\nHaving missed the opening game of the season due to a groin injury, Ofere made his first appearance of the 2010 season, coming on as an 83rd-minute substitute, in a 3–0 win against Örebro on 23 March 2010. He then scored two goals against Kalmar and Häcken. However during a 2–1 loss against Helsingborgs on 20 April 2010, Ofere suffered a knee injury and was substituted in the 17th minute. As a result, he was sidelined for eight weeks. He was then sent–off on two occasions; the first one came on 4 July 2010, in a 4–1 loss against Mjällby and the second time came on 17 July 2010, in a 2–0 loss against AIK. Once again, Ofere's interest was re–ignited once more, as he was linked with a move to Middle East. Ofere rejected a move to China, citing his desire to continue playing in Europe. By the time Ofere departed from Malmö FF, he made eight appearances and scoring two times in all competitions.\nU.S. Lecce\nOn 30 August 2010, he was signed by Lecce on a three-year contract. Upon moving to Leece, Ofere felt the move was the important step of his career.\nHowever, his debut was delayed after suffering a knee injury that saw him out for a week. But Ofere made his Leece debut, coming on as a substitute for Jeda, in a 1–1 draw against Parma on 22 September 2010. Since making his debut for the club, he found himself in and out of the first team, mostly coming on as a substitute. Ofere then scored his first Serie A goal on 25 October 2010, in a 2–1 win over Brescia. Ofere then scored two goals in two games between 5 December 2010 and 12 December 2010 against Genoa and Chievo Verona. However, Ofere injured the anterior cruciate ligament in his right knee during a match against Lazio on 9 January 2011. After an operation, it was announced that Ofere would be out for four months. While recovering from his knee injury, he watched on the sidelines, as the club successfully avoided relegation following a 2–0 win against Bari on 15 May 2011. At the end of the 2010–11 season, Ofere went on to make twelve appearances and scoring three times in all competitions.\nAt the start of the 2011–12 season, Ofere started signs of recovery on his right knee, possibly making his return. It wasn't until on 11 September 2011 when he made his return from injury,  coming on as a 63rd-minute substitute, in the opening game of the season, in a 2–0 loss against Udinese. However, Ofere struggled to first team and appeared on the substitute bench. To make it worse, Ofere injured his right knee and needed an operation that caused him to miss out throughout the season. Ofere made his return on 5 May 2012 against Fiorentina, where he came on as a substitute for Andrea Bertolacci in the 76th minute. Though the club was relegated to Serie B, Ofere made seven appearances for the club in all competitions.\nFollowing Leece relegation to Serie B, Ofere was among those listed by the newspaper that could leave the club. It was announced on 25 September 2012, after playing very little football for the first few weeks of the 2012–13 season, that his contract was mutually terminated a year early.\nTrelleborg\nAfter being released by Leece, Ofere moved back to Sweden by joining Division 1 Södra side Trelleborgs FF until the end of the season.\nOfere made his Trelleborgs debut on 18 August 2013, providing an assist for Zoran Jovanović, in a 1–0 win over Trollhättan. In a follow–up match, he scored his first goals in the next game, in a 4–2 loss against IF Sylvia. This was followed up by scoring three more goals against Lunds BK, Husqvarna and Krist.FF. Ofere became a first team regular since joining Trelleborgs, playing in the striker position. He then scored three more goals in the last three matches of the season. At the end of the 2013 season, Ofere went on to score eight goals in eleven appearances.\nVestsjælland and Sogndal\nAfter Division 1 Södra season came to an end, Ofere joined FC Vestsjælland until the end of the season on 23 December 2013. Ofere made his Vestsjælland debut on 21 February 2014, starting the whole game, in a 4-0 loss against SønderjyskE. Ofere scored his first Vestsjælland goal on 7 March 2014, in a 1–1 draw against Randers, followed up by his second Vestsjælland goal, in a 2–1 win over Nordsjælland on 15 March 2014. However, injury caused him five matches at Vestsjælland. On 30 May 2014, it was announced that Ofere was released by the club after scoring twice in nine appearances.\nDespite keen to stay in Denmark further, On 8 August 2014, Ofere joined Norwegian side Sogndal until the end of the season. Ofere made his Sogndal debut two days later against FK Bodø/Glimt, coming on as a substitute for  which Sogndal lose 2-0. His time at Norway was poor, as the club were relegated to Norwegian First Division and Ofere made eight appearances for the club. Norwegian media Adresseavisen described Ofere as a disappointment, citing \"He has been far below the level that we had hoped.\" At the end of the season, Ofere was released by the club.\nInverness Caledonian Thistle\nOn 27 February 2015, Ofere signed for Inverness Caledonian Thistle until the end of the 2014–15 season.\nThe following day, he made his debut for the club, and scored, in a game against Motherwell, resulting a 2–1 loss. Since making his debut for the club, Ofere quickly became a first team regular for the side, playing in the striker position. Ofere's second goal later came two months later on 11 April 2015, in a 1–1 draw against Celtic. Ofere scored against Celtic for the second time eight days later, in the semi-final of Scottish Cup, and beat them 3–2 to put them through to their first ever Scottish Cup final. His third goal later came on 25 April 2015, in a 2–1 loss against Aberdeen. Ofere's fourth goal came on 5 May 2015, in a 2–1 win over Dundee United. Ofere played a vital role for the club when he scored a winning goal to guarantee European football for the first time. Ofere started as a striker in the Scottish Cup Final, as Inverness Caledonian Thistle beat Falkirk to win their first ever Scottish Cup Final.\nHaving made thirteen appearances and scoring six times for the side, Ofere was released by the club on 19 June 2015 after failing to negotiate a contract extension beyond the 2014–15 season.\nBoluspor\nAfter leaving Inverness CT, Ofere moved to Turkey by joining Boluspor on 10 August 2015.\nHe made his Boluspor debut, coming on as a 65th-minute substitute, in a 0–0 draw against Kayseri Erciyesspor on 14 August 2015. Since making his debut for the club, Ofere was involved in the first team for the side, making a handful of first team appearances. He then scored his first goals for the side, in a 4–1 win against Ümraniyespor in the Turkish Cup. It was announced on 30 December 2015 that Ofere left the club by mutual consent. By the time he departed from Boluspor, he made eleven appearances and scoring two times in all competitions.\nDundee United\nAfter a spell with Boluspor in Turkey, Ofere joined Dundee United in February 2016 on a contract to the end of the 2015-2016 season.\nHe made his debut for the club on 13 February 2016 coming on as a substitute in a 0-0 draw with Hamilton Academical. Ofere scored his first goal for Dundee United in a 2-1 defeat to rivals Dundee, which ultimately relegated Dundee United. This was followed up by scoring two goals in the next two matches against Inverness CT and Partick Thistle. At the end of the 2015–16 season, making thirteen appearances and scoring three times in all competitions, he was released by the club at the end of his contract.\nFC Rosengård\nOn 22 February 2017 it was confirmed, that Ofere had signed a 1-year contract with Swedish club FC Rosengård.\nOfere made his FC Rosengård debut, starting the whole game, in a 1–0 loss against Skövde AIK in the opening game of the season. It wasn't until on 3 June 2017 when he scored his first goal for the club, in a 3–2 loss against Oskarshamn. Five months later Ofere and Rosengård reached the mutual decision to part ways. By the time Ofere departed from the club, he made ten appearances and scoring once in all competitions.\nFLC Thanh Hóa\nOfere signed for Vietnamese V.League 1 club FLC Thanh Hóa ahead of the 2018 season.\nHe made his debut against Global Cebu in an AFC Cup group match on 10 February. However, Ofere's recent performance for the side earned criticism from Manager Marian Mihail. But Ofere was able to bounce when he scored his first goal for the club, in a 1–0 win against Sông Lam Nghệ An in the opening game of the season. A week later on 11 April 2018, Ofere scored his second goal for the side in the return match against Global Cebu in an AFC Cup, drawing 3–3. A month later on 20 May 2018, he scored twice for the side, as they won 3–1 against Than Quảng Ninh. Having made nine appearances and scoring four times for the side, Ofere left FLC Thanh Hóa at the half of season.\nA year later after leaving Vietnam, Ofere returned to Sweden and had a trial at [http://www.uif.nu Uppåkra IF] but he stated was to regain his fitness.\nInternational career\nOfere also holds a Swedish passport, which made him eligible for selection by playing for either Nigeria and Sweden.\nIn May 2008, Ofere was called up to the Nigeria U-23 squad for the first time and went on to play three times for the U-23 side.\nPersonal life\nOfere speaks Swedish and English. He is married to Sofia Andersson and together, they have two children, Olivia and Alexander.\nHonours\n;Inverness Caledonian Thistle\n*Scottish Cup : 2014–15\nReferences\nExternal links\n*\n*\n*"
    }
  ]
}