{
  "content": [
    {
      "type": "text",
      "text": "# Edward Buckley Wynyard\n\n|birth_date       = 23 November 1788\n|birth_place      = Kensington Palace, London\n|death_date       =\n|death_place      = London\n|resting_place    = Kensal Green Cemetery, London\n|placeofburial_label =\n|placeofburial_coordinates =\n|father           = William Wynyard\n|spouse           = Louisa Warner\n|children         = 7\n|relations        = Robert Wynyard (brother)\n| module          =\n}}\nGeneral Edward Buckley  Wynyard  (1788 – 24 November 1864) was a British Army officer.\nHistory\nHe was born in Kensington Palace, London, the son of Lieutenant-General William Wynyard, Colonel of the 20th Foot.\nHe joined the Army himself as an ensign in 1803 and first served in Sicily. In 1809 he took part in the capture of the islands of Ischia and Procida and served under Lieutenant-General Sir John Oswald in the Ionian Islands but was severely wounded at Santa Maura and returned to London. In 1811 he was appointed aide-de-camp to Sir Harry Burrard and then brigade-major under Sir Moore Disney although his wound prevented him from serving with the brigade at Bergen op Zoom. In 1814 he was promoted lieutenant-colonel of the 58th Foot. In 1816-20 he served on St Helena as military secretary to the Governor, Sir Hudson Lowe and in July 1830 was appointed aide-de-camp to William IV and promoted to colonel in the Grenadier Guards.\nIn 1837 he was placed on half-pay and in the 1838 Coronation Honours made a Companion of the Order of the Bath. In November 1841 he was promoted major-general and in September 1847 put in command of the troops in New South Wales, Van Diemen's Land and New Zealand. During his time in Australia he was a member of the Legislative Council in 1848-51 and of the Executive Council in 1848–53. In 1853 he returned home to England where in January 1860 he was promoted full general.\nHe died of bronchitis in London on 24 November 1864 and was laid to rest in Catacomb B, Kensal Green Cemetery. He had married Louisa Warner and had several children.\nHe left his name to Wynyard Square, Sydney, and probably the town Wynyard in northern Tasmania which he visited in 1850–51.\nSee also\n* Sir Maurice Charles Philip O'Connell\nReferences"
    }
  ]
}