{
  "content": [
    {
      "type": "text",
      "text": "# Edward V. Whiton\n\n| term_start     = January 3, 1852\n| term_end       = April 12, 1859\n| predecessor    = Levi Hubbell\n| successor      = Luther S. Dixon\n| office1        = Justice of the\n| status1        = ex officio\n| term_start1    = September 1, 1848\n| term_end1      = June 1, 1853\n| office2        = Wisconsin Circuit Judge\n| term_start2    = September 1, 1848\n| term_end2      = June 1, 1853\n| predecessor2   = Position Established\n| successor2     = Wyman Spooner\n| office3        = Speaker of the  of&nbsp;the\n| term_start3    = December 2, 1839\n| term_end3      = August 2, 1840\n| predecessor3   = Lucius Israel Barber\n| successor3     = Nelson Dewey\n| office4        = Member of the Council of&nbsp;the  for Rock\n| term_start4    = December 5, 1842\n| term_end4      = January 4, 1847\n| alongside4     = Charles Minton Baker\n| predecessor4   = James Maxwell\n| successor4     = Position Abolished\n| office5        = Member of the  of&nbsp;the  for Rock\n| term_start5    = November 26, 1838\n| term_end5      = December 5, 1842\n| birth_date     =\n| birth_place    = South Lee, Massachusetts, U.S.\n| death_date     =\n| death_place    = Janesville, Wisconsin, U.S.\n| restingplace   = Oak Hill Cemetery, Janesville\n| religion       =\n| party          =\n| spouse         =\n| children       =\n| Edward D. Whiton\n|\n| Catherine Whiton\n|\n| Edward Vernon Whiton Jr.\n|\n}}\n| father         = Joseph Whiton\n| mother         = Amanda (Garfield) Whiton\n| alma_mater     =\n| footnotes      =\n}}\nEdward Vernon Whiton Sr. (June 2, 1805April 12, 1859) was an American lawyer, jurist, politician, and Wisconsin pioneer. He was the first elected chief justice of the Wisconsin Supreme Court (3rd overall), and served on the Supreme Court from its establishment in 1848 until his death in 1859.  As chief justice, he wrote the court's controversial opinion in the case of Ableman v. Booth, which attempted to nullify the federal Fugitive Slave Act of 1850.  He also authored the opinion in Bashford v. Barstow, deciding the outcome of the 1855 Wisconsin gubernatorial election and cementing the role of the Wisconsin Supreme Court as arbiter of the state constitution.\nBefore Wisconsin became a state, Whiton had served eight years in the Wisconsin Territory legislature, elected on the Whig Party ticket and serving terms in both chambers.  He was also a delegate to Wisconsin's second constitutional convention in the Winter of 1847&ndash;1848, where he helped frame the Constitution of Wisconsin.  He was one of the earliest landowners in what is now Rock County, Wisconsin.\nEarly life\nEdward V. Whiton was born in South&nbsp;Lee, in Berkshire County, Massachusetts, in June 1805.  He was raised and educated in Berkshire&nbsp;County, attending common schools there.  He worked several jobs as a young man, learning the trades of millwright and carpenter.  After his formal education, he continued to learn and read law and history while working as a librarian.  He also studied law in the office of a local attorney, William Porter.  He was admitted to the bar in Massachusetts in 1836, but left a short time later to travel west and seek his fortune.\nHe initially stopped in Lorain County, Ohio, where his elder brother had established a homestead, but then continued west to the Wisconsin Territory in early 1837.  In Wisconsin, he settled a tract of prairie land near the present location of Janesville, Wisconsin, becoming one of the first settlers in Rock County, Wisconsin, and one of the first lawyers practicing there.  With his skills as a millwright and carpenter, he built his own cabin and later constructed a more substantial house.\nWisconsin Territory and establishing statehood\nWhiton had already been a member of the Whig Party before moving west to Wisconsin, and quickly became one of the leading Whigs in Rock County, Wisconsin.  In the fall of 1838, he was elected to represent Rock and Walworth counties in the House of Representatives for the 2nd Wisconsin Territorial Assembly.  He was elected speaker of the House for the 3rd session of that legislative term.  He was re-elected in 1840, and served another two years in the House during the 3rd Wisconsin Territorial Assembly&mdash;at the time, he was the only Whig among the five representatives of Rock and Walworth.\nIn 1842, he was elected to the territorial Council (upper chamber of the legislature) and served in the Council for the 4th Wisconsin Territorial Assembly.  He ran for another term on the Council in the fall of 1846, but lost the election to Democrat Andrew Palmer.  At that same election, Democrats won a substantial majority of seats to the first Wisconsin constitutional convention.  The constitutional document produced by that convention, however, was rejected by voters in April 1847, and a new convention was scheduled for the following winter.  That fall, Whiton was elected as a delegate from Rock County.  At the constitutional convention, Whiton served on the judiciary commission as second to Charles Dunn, who was then the chief justice of the territory's Supreme Court.  Whiton was later described in newspapers and historical reflections as one of the key framers of the Constitution of Wisconsin, earning wide admiration from the other delegates regardless of party affiliation.\nWisconsin judicial career\nIn March 1848, Wisconsin voters ratified the constitution drafted at the second Wisconsin constitutional convention, at the same election, Whiton was elected as the first circuit judge for Wisconsin's new 1st circuit, comprising the southern counties of Racine (now Racine and Kenosha), Rock, Walworth, and Green.  As a Wisconsin circuit court judge, he was ex officio a justice of the original Wisconsin Supreme Court.\nIn January 1852, the court met to elect a new chief justice.  The members of the court initially elected Judge Mortimer M. Jackson to serve as chief justice, but when he declined the office, Whiton was chosen.  Later that year, the Wisconsin Legislature voted to establish a separate Supreme Court, distinct from the circuit courts.  That fall, Whiton ran for the office of chief justice for the new Supreme Court and won the election as an independent, defeating Democratic circuit judge Charles H. Larrabee. Whiton then served as chief justice until his death in 1859, having been re-elected in 1857.\nNotable cases\nIn the \"Booth cases\" of 1854 (Ableman v. Booth) and 1855 (In Re: Booth and Ryecraft), Whiton issued significant opinions in favor of states' rights to nullification of federal laws.  The Booth cases centered on Milwaukee abolitionists Sherman Booth and John Ryecraft, who were charged under the Fugitive Slave Act of 1850 with aiding the escape of Joshua Glover to Canada.  Booth was arrested by U.S. Marshall Stephen Ableman, but sought a writ of habeas corpus from a Wisconsin court.  The court granted the writ, and Ableman appealed the ruling to the Wisconsin Supreme Court.  Whiton wrote in the majority, with Justice Abram D. Smith, that the Fugitive Slave Act was unconstitutional, and affirmed that Booth should be released.  The U.S. Supreme Court overruled the Wisconsin decision, asserting the supremacy clause and ruling that the power of the State of Wisconsin \"is limited and restricted by the Constitution of the United States.\"  The Wisconsin Supreme Court refused to file the U.S. Court's mandate&mdash;and never has. The case significantly inflamed abolitionist passions in Wisconsin in the run-up to the American Civil War.  Booth was ultimately pardoned in the final days of the presidency of James Buchanan.\nIn the 1856 Bashford v. Barstow case, Whiton effectively decided the outcome of the 1855 Wisconsin gubernatorial election.  Initially, Democrat William A. Barstow, the incumbent Governor, appeared to be the winner by a mere 157 votes.  His opponent, Republican Coles Bashford challenged the result as fraudulent, an allegation which was borne out by the discovery of fabricated votes from non-existent precincts.  Barstow argued that as head of the executive branch, he had the authority to count the votes and certify the results, and that the legislative and judicial branches could not interfere.  The Court ruled that, according to the Wisconsin Constitution, it was the election, not the canvass, which determined the right to the office.  After the ruling, Barstow's militia, which had been prepared to enforce his election with violence, began to disperse.  Barstow relented, and Bashford was eventually allowed to take office as the 5th governor of Wisconsin.  The case was an important precedent for the Supreme Court as the ultimate arbiter of the law in Wisconsin.\nIn 1859 his health began to fail.  He took a leave from the Court in the spring of 1859 and died at his home in Janesville on April&nbsp;12, 1859.\nPersonal life and family\nEdward Whiton was the third son and sixth of nine children born to General Joseph Whiton and his wife Amanda ( Garfield).  Whiton was a descendant of several early American colonists.  The Whiton family were descendants of James Whiton, who emigrated from England to the Massachusetts Bay Colony in 1640.  Edward's mother, Amanda Garfield, was a descendant of Edward Garfield, who arrived in the Massachusetts Bay Colony from England in the 1630s.  Through his Garfield relatives, Edward Whiton was also a third cousin of U.S. president James&nbsp;A. Garfield.  Additionally, Edward's paternal grandmother, Molly Lucas, was the descendant of a Mayflower passenger.\nEdward's father, Joseph Whiton, had served as a volunteer in the American Revolutionary War under General Horatio Gates.  After the war he became one of the first settlers in the town of Lee, Massachusetts.  He returned to military service as a major general of the Massachusetts militia in the War of 1812, and commanded the defense of Boston during that war.  He also represented Lee for nine years in the Massachusetts General Court.  For his service in the Revolutionary War, he was also granted a tract of land in the Connecticut Western Reserve&mdash;land that became part of the state of Ohio&mdash;where several of his descendants eventually settled.\nBoth of Edward Whiton's elder brothers,  and , served as judges in Ohio.  Joseph Whiton also served one term in the Ohio House of Representatives.  Daniel Garfield Whiton eventually also moved to Wisconsin and also settled near Janesville.}}\n| colspan=\"6\" style=\"text-align:center;background-color: #e9e9e9;\"| General Election, September 1852\nReferences\n}}|years=18481853}}\n1859}}"
    }
  ]
}