{
  "content": [
    {
      "type": "text",
      "text": "# Edward Schröder__disambig_1\n\nEdward Schröder (18 May 1858 &ndash; 9 February 1942) was a Germanist and mediaevalist who was a professor at the University of Göttingen and published editions of numerous texts.\nLife and career\nBorn in Witzenhausen and educated in Kassel, Schröder studied German studies at the Universities of Strasbourg and Berlin and was a docent at the University of Göttingen and then at Berlin. In 1889 he was appointed professor at the University of Marburg and in 1902 at Göttingen, where he spent the rest of his career and died in 1942. His PhD thesis was on the early Middle High German Anegenge; his main work for his Habilitation, which was granted on 20 January 1883, was an unprinted edition of the Legend of Crescentia from the Kaiserchronik; he had been commissioned to edit the entire work for the Monumenta Germaniae Historica.\nIn 1896, he became a member of the Akademischer Verein für Studierende der neueren Philologie zu Marburg (academic association for students of modern philology at Marburg), a student association later renamed the Marburger Burschenschaft Rheinfranken. From 1891 to 1937, he was either editor or co-editor of the Zeitschrift für deutsches Altertum und deutsche Literatur. From 1908 on, he headed the central collection office for the Deutsches Wörterbuch in Göttingen. In November 1933 he was one of the 300 academics who signed the professorial pledge of allegiance to Adolf Hitler and the National Socialist State.\nIn the conflict between the 'Berlin' and 'Leipzig' schools of Germanic philology, Schröder was an adherent of the Berlin school of Karl Lachmann and of his teacher, Wilhelm Scherer, and against, for example, Friedrich Kluge. He and his lifelong friend Gustav Roethe both appear to have chosen to begin their careers at Göttingen because of its potential as a centre of rigorous Germanic studies scholarship. In 1887 Schröder married Gertrud Röthe, Roethe's sister; she died in 1935.\nPublications\nSchröder edited a number of mediaeval German texts, including in addition to the Kaiserchronik (1892) a collection of verse tales by Konrad von Würzburg, Zwei altdeutsche Schwänke (1919) and Zwei altdeutsche Rittermaeren (1894), containing Moriz von Craûn and Peter von Staufenberg. He worked throughout his life on a book about Till Eulenspiegel, Untersuchungen zum Volksbuch von Eulenspiegel, finally published in 1988. He had extremely broad professional interests&mdash;from Old Norse and Old Saxon to Klopstock and Goethe&mdash; but loved the High Middle Ages best. He also assisted Roethe in completing the revised edition of Jacob Grimm's Deutsche Grammatik, and after Scherer's death produced the revised edition of his Geschichte der deutschen Literatur. His studies of onomastics helped establish the field in Germany. His focus in etymologies was on the inventors of the words, and he sought whenever possible to relate a placename to an event in the life of a person who had originated it.\nHonours\nSchröder was a member of the Academies of Sciences of Göttingen, Prussia, Austria and Bavaria and of the Strasburg Scientific Society in Heidelberg, an honorary member of the Modern Language Association of America and the Historical Association of Lower Saxony, was appointed a Geheimer Regierungsrat in 1907, and was awarded the Prussian Order of the Crown 3rd class in 1913 and the Bavarian Maximilian Order for Science and Art in 1927. He received an honorary doctorate in law from the University of Göttingen in 1931 and was an honorary citizen of Witzenhausen (1925) and Göttingen (1937).\nReferences\nFurther reading\n* Edward Wolff. \"Edward Schröder zum Gedächtnis\". Archiv für Landes- und Volkskunde von Niedersachsen 1942, pp.&nbsp;61&ndash;75\nExternal links\n*\n* [https://portal.dnb.de/opac.htm?query=Woe%3D118761838&method=simpleSearch Books by and about Edward Schröder] in the German National Library"
    }
  ]
}