{
  "content": [
    {
      "type": "text",
      "text": "# Edward Brush Fowler\n\n__NOTOC__\n|birth_place      =Manhattan, New York City, U.S.\n|death_date       =\n|death_place = Brooklyn, New York City, U.S.\n|placeofburial    = Green-Wood Cemetery\n|allegiance       =\n|branch           =Union Army\n|commands         =14th Brooklyn Regiment\n|battles          = American Civil War\n*Battle of Gettysburg\n}}\n, Brooklyn, was sculpted by Henry Baerer and dedicated in 1903]]\nEdward Brush Fowler (May 29, 1826 &ndash; January 16, 1896) was an officer in the Union Army during the American Civil War. He is best known for his command of the 14th Brooklyn Regiment and a demi-brigade during the Battle of Gettysburg in July 1863.\nEarly life\nHe was born in Manhattan, and his family moved to Brooklyn when he was an infant. He attended Brooklyn Gaslight School with the intention of becoming an accountant, before entering military service.\nEarly career and personal life\nHe was a sergeant by the time he was 18, and a lieutenant by 1847 when he began his association with the 14th Regiment (New York State Militia), a unit made up primarily of Brooklyn businessmen, tradesmen and firemen. By 1852 he was a lieutenant colonel, and married Annie Cook at the Methodist Church on Hanson Place in Fort Greene. Eventually, Fowler and his wife had three children, two boys and a girl.\nMilitary career\nWhen the Civil War broke out, Fowler was commander of the 14th Brooklyn, which was stationed in Fort Greene Park.  They were deployed to action at the Battle of Bull Run, where their red pants and their fierceness earned them the nickname the \"Red-Legged Devils\".\nSometime in 1862, Fowler wrote a letter home commenting on the regiment, a bit about the uniforms, and the tactics in which he had to use. It was later placed in the regimental history:\nIn 1860 the Board of Officers adopted the French 'chasseur' uniform, consisting of ashy red trousers, white leggings, a blue jacket, red chevrons and shoulder knots. A fixed to the head was to be a french style kepi with blue band, red above and blue top. Little did the officers of that board dream that the uniform that they then adopted would become historic, sung of in poets' lays and transferred to the artist's canvas as that of the \"red-legged devils,\" the Brooklyn Fourteenth.\nFowler was known to his men as \"Ned\", and inspired strong loyalty from them.  The regiment fought again at Second Bull Run (the Battle of Manassas), where 860 of its 960 men were lost.  Fowler himself took bullets in the thigh and convalesced in Alexandria, Virginia, during which he was promoted to full colonel and named to be the commandant of the hospital.\nIn January 1863, Fowler returned to active duty, and commanded the 14th Brooklyn in the Battle of Gettysburg as part of the First Army Corps.  The 14th continued on to fight at the Battle of Mine Run, the Wilderness Campaign and the Battle of Spotsylvania, a total of 22 military engagements.\nAt the end of the 14th's term of service, on March 13, 1865, Fowler was brevetted a brigadier general of United States Volunteers for gallant and meritorious services.\nCivilian life\nFowler returned to Brooklyn, where he lived in Fort Greene and took on the positions of an officer of the Long Island Savings Bank, the treasurer of the Atlantic & Pacific Company, the auditor of the Commercial Cable Company, the chief clerk of the Brooklyn Board of Audit and a member of the Kings County 11th Ward Board of Supervisors.  He maintained his connection with the 14th Brooklyn for two years, assisting with soldier's pension funds, and was active in veterans affairs.\nFowler died at his home at 47 Brevoort Place on January 16, 1896.  His body lay in state at Brooklyn City Hall, and he was buried with full military honors in Green-Wood Cemetery.\nStatue\nOn May 18, 1902, the City of Brooklyn dedicated a statue of Fowler by Henry Baerer in Fort Greene Park.  The statue had deteriorated by the 1960s, and was removed to storage for safekeeping. In 1976 it was reinstalled at a new location, Fowler Square, formerly Lafayette Square, located at the intersection of Lafayette Avenue and Fulton Street at Fort Greene Place.  The statue was conserved in 2005, and the square itself was renovated in 2010.\nSee also\n*\nReferences\nNotes\nExternal links\n*"
    }
  ]
}