{
  "content": [
    {
      "type": "text",
      "text": "# Edward Frederick Knight\n\n| birth_place = England\n| death_date  =\n| death_place = England\n| nationality = English\n| occupation = Writer\n| notableworks =\n|influences =\n| website =\n}}\nEdward Frederick (E. F.) Knight (23 April 1852 – 3 July 1925) was an English barrister, soldier, journalist, and author of 20 books, many based on his dispatches as a war correspondent.\nBiography\n(1904): 1. Robert Collins; 2. David Fraser; 3. Capt. Francois Dhani; 4. Capt. James Jardine; 5. Frederick McKenzie; 6. Edward Knight; 7. Charles Victor-Thomas; 8. Oscar Davis; 9. William Maxwell; 10. Robert MacHugh; 11. William Dinwiddie; 12. Frederick Palmer; 13. Capt. Berkeley Vincent; 14. John Bass; 15. Martin Donohoe; 16. Capt. ____;　17. Capt. Carl von Hoffman; 18. ____; 19. ____; 20. ____; 21. Gen. Sir Ian Hamilton; 22. ____; 23. ____; 24. ____; 25. ____.]]\nKnight was born in England, and travelled with his family to British India at an early age. He was educated at Westminster School and Caius College, Cambridge, where he pursued legal studies. He was called to the Bar from Lincoln's Inn in 1879. However, he abandoned the legal profession to pursue a career in journalism instead, writing primarily for the Morning Post and The Times.\nDuring the Franco-Prussian War of 1870, while living in France at his father's house in Honfleur he attempted to enlist with the French Army near Rouen, but was turned down as he was an alien.  In 1878, he explored Albania and Montenegro, returning to the Balkans during the Russo-Turkish War.\nIn 1889 Knight sailed to the island of Trindade off the coast of Brazil in a 64-foot cutter named the Alerte.  He was in search of treasure. (He had previously visited the island in his first boat the Falcon I). He wrote the book The Cruise of the Alerte about his journey with detailed descriptions of Trindade. He was an influence on children's author Arthur Ransome who used Knight's book Sailing to teach himself how to sail; and in the Swallows and Amazons series as a resource for his fictional characters, who often refer to Knight on Sailing. Ransome also used Knight's descriptions of Trindade as a model for his fictional Crab Island in the book Peter Duck. Erskine Childers was another author who was influenced by Knight's writing. He used ''The 'Falcon' in the Baltic as material for his book The Riddle of the Sands.\nDuring 1890, Knight visited Kashmir and went travelling in the Himalayas to gather material for his book Where Three Empires Meet.  He visited Ladakh and went on to Gilgit. He arrived in Gilgit in time to become involved in the 1891 British campaign against the minor states of Hunza and Nagar, led by the Resident, Col. Algernon Durand. He was temporarily appointed an officer in charge of some native troops, and acted as a correspondent for The Times''.\nKnight subsequently covered Kitchener's Soudan Expedition, the Spanish–American War in Cuba, the French expedition against Madagascar, the Anglo-Boer War. He was severely wounded in South Africa during the Battle of Belmont, resulting in the amputation of his right arm.\nIn 1894 he had visited the new territory of Rhodesia just as Cecil Rhodes was conquering Matabeleland in south-western Rhodesia and his assessment of the country, presented in a series of articles written for The Times, later appeared in book form under the title of Rhodesia of Today.\nFrom 1904 to 1905, he covered the Russo-Japanese War, as a reporter embedded within the Imperial Japanese Army. He was mistakenly reported as killed in action by The New York Times, which ran his obituary on 4 June 1904.\nKnight died in 1925 after a long retirement.\nSelected works\n* 1880 – Albania: A Narrative of Recent Travel\n* 1884 – The Cruise of the Falcon: A Voyage to South America in a 30-ton Yacht (2 volumes)\n* 1885 – The Threatening Eye\n* 1889 – [https://www.amazon.co.uk/dp/B00CC7DE98/ref=dp-kindle-redirect?_encoding=UTF8&btkr=1 The \"Falcon\" on the Baltic]: A Coasting Voyage from Hammersmith to Copenhagen in a Three-ton Yacht\n* 1889 – Sailing (The All-England Series)\n* 1890 – ''The Cruise of the 'Alerte': The Narrative of a Search for Treasure on the Desert Island of Trinidad\n* 1893 – Where Three Empires Meet: A Narrative of Recent Travel in Kashmir, Western Tibet, Gilgit and the Adjoining Countries\n* 1897 – Letters from the Sudan\n* 1898 – A Desperate Voyage\n* 1895 –- Rhodesia of Today: A Description of the Present Condition and the Prospects of Matabeleland and Mashonaland\n* 1901 –- Small-Boat Sailing\n* 1909 – The Awakening of Turkey: A History of the Turkish Revolution\n* 1910 –- Knots and Tackles\n* 1919 – The Harwich Naval Forces – Their Part in the Great War\n* 1923 – [https://catalog.hathitrust.org/Record/006568808 Reminiscences: The Wanderings of a Yachtsman and War Correspondent]\nNotes\nReferences\n* Bullard, Frederic Lauriston. (1914). [https://archive.org/details/famouswarcorres02bullgoog  Famous War Correspondents.] Boston: Little, Brown.  [http://www.worldcat.org/wcpa/oclc/2135019  OCLC 2135019]\n* Roth, Mitchel P. and James Stuart Olson. (1997). [https://books.google.com/books?id=OEphWsER8QYC&q=jiji++and+russo-japanese+war  Historical Dictionary of War Journalism.] Westport, Connecticut: Greenwood Publishing Group.\n* Wilson-Latham, Robert. (1979). [https://books.google.com/books?id=HQeMHQAACAAJ&q=From+our+Special+Correspondent  From Our Special Correspondent: Victorian War Correspondents and Their Campaigns.] London: Hodder and Stoughton.\nExternal links\n*\n*\n*\n*\n* [http://www.booksofzimbabwe.com/rag4.html Rhodesia of Today''.]"
    }
  ]
}