{
  "content": [
    {
      "type": "text",
      "text": "# Edward Williams (British Army officer)\n\n|        birth_place = Pinhoe, Devon, England\n|          death_date =\n|        death_place = Winchester, Hampshire, England\n|            heightft =\n|          heightinch =\n|             batting = Right-handed\n|             bowling = Right-arm slow\n|                role = Occasional wicket-keeper\n|              family =\n|               club1 = Marylebone Cricket Club\n|               year1 = 1933\n|         clubnumber1 =\n|               club2 = Devon\n|               year2 = 1930\n|         clubnumber2 =\n|               club3 = Army\n|               year3 = 1922&ndash;1933\n|         clubnumber3 =\n|               club4 = Combined Services\n|               year4 = 1922&ndash;1931\n|         clubnumber4 =\n|             columns = 1\n|             column1 = First-class\n|            matches1 = 29\n|               runs1 = 2,029\n|            bat avg1 = 41.40\n|           100s/50s1 = 4/9\n|          top score1 = 228\n|         deliveries1 = 54\n|            wickets1 = &ndash;\n|           bowl avg1 = &ndash;\n|            fivefor1 = &ndash;\n|             tenfor1 = &ndash;\n|       best bowling1 = &ndash;\n|  catches/stumpings1 = 13/1\n|                date = 19 April\n|                year = 2011\n|              source = http://www.espncricinfo.com/ci/content/player/23017.html Cricinfo\n}}\nBrigadier Edward Stephen Bruce Williams CBE (2 November 1892 &ndash; 20 January 1977) was a distinguished British Army officer whose career spanned 35 years. He also an English cricketer.  Williams was a right-handed batsman who bowled right-arm slow and who occasionally kept wicket.\nEarly life\nWilliams was born in Pinhoe, Devon, the son of Major-General Sir Hugh Bruce Williams (1865-1942), KCB, DSO (who in 1920 adopted the surname \"Bruce-Wiliams\", Bruce being his mother's maiden surname), of Chillies, near Crowborough, Sussex, who served with the Royal Engineers, and Mabel Augusta (1867-1945), daughter of stockbroker Stephen Heward, of Toronto, Canada (nephew of the politician and lawyer Sir John Robinson, 1st Baronet, of Toronto). He was later educated at Winchester College. There he played for the college cricket team. Following this he undertook his military training at the Royal Military College, Sandhurst, becoming a commissioned officer with the rank of second lieutenant on 20 September 1911. His service number was 1554. Among his fellow graduates were Montagu Stopford, also of the Rifle Brigade, John Evetts, Kenneth Anderson and Eric Nares, all of whom would become general officers. He was assigned to the Rifle Brigade (The Prince Consort's Own), joining the regiment's 1st Battalion.\nMilitary career\nFirst World War\nWilliams received his first promotion on 17 April 1913, to that of a lieutenant. With the outbreak of the First World War in August 1914, Williams initially served with his battalion, which from November formed part of the 25th Brigade of the 8th Division, in France and Belgium from August to October 1914. He spent a brief period time with the Royal Corps of Signals in April 1915. On 15 May 1915 he was promoted to captain, while seeing action in the Gallipoli Campaign and, from October 1915 to March 1916, he served in Egypt. From 14 March 1916 to June 1916, Williams was a General Staff Officer Grade 3 (GSO3) with the Egyptian Expeditionary Force (EEF). He returned to the Western Front in June 1916, where in the course of duty he was wounded twice. In 1917, he was awarded the Légion d'honneur and mentioned in dispatches to this degree. He returned to England in February 1918, where he was a brigade major in the Home Forces, where he ended the war.\nBetween the wars\nHe served shortly after the war in Iraq, where took part in military action to put down the Iraqi revolt against the British, for which he received a medal for. Two years later, in 1920, Williams was in charge of an Officer Company of Gentlemen Cadets at the Royal Military College, Sandhurst, a role he undertook for four years. He attended the Staff College, Camberley from 1926 to 1927, alongside fellow students such as The Hon. Harold Alexander, Charles Hudson, Douglas Wimberley and Roy Bucher. Williams continued with the training theme, when in January 1929 he undertook duties as a General Staff Officer for weapon training at Aldershot Command. 1930 saw him promoted to brevet major, two years later he became a full major. 1930 also saw him take up a post which was to last four years with the Oxford University Contingent, Officer Training Corps. While undertaking the role he was promoted to lieutenant colonel, gaining the rank fully four years later in 1938. Williams served in Malta in 1937, and in 1938 he became the Commanding Officer (CO) of the 2nd Battalion, Rifle Brigade. He went on to lead them in operations in British Palestine during the 1936–1939 Arab revolt.\nSecond World War\nWith the Second World War underway, 1940 saw yet another promotion for Williams, this time to the rank of colonel. After handing over command of the battalion to Lieutenant Colonel James Renton, he served briefly from 22 to 31 January 1940 as the acting commander of the 7th Support Group. In February 1940, he was promoted to acting brigadier and, returning to the United Kingdom, placed in command of the 182nd Infantry Brigade, a second-line Territorial Army brigade, which formed part of the 61st Infantry Division, from February 1940 to July 1941, serving mainly in Northern Ireland on anti-invasion duties. Williams was honoured in King George VI's birthday honours, bestowing him a Commander of the Order of the British Empire (CBE) which he received on 2 June 1943. In July 1941, Williams handed over the 182nd Brigade to Brigadier Charles Hudson, his Staff College classmate, and became the Brigadier General Staff (BGS) of Scottish Command, a role he held until 20 April 1943. Later in 1944, Williams became part of the BGS in East Africa Command, a position he held from 14 February 1944 to 1946. Following the end of the war, Williams was granted the rank of honorary brigadier on 30 December 1946, the date of which he retired from active service.\nCricket\nWilliams was an able sportsman, taking a particular interest in cricket.  Having played cricket for Winchester College in 1909 and 1910, it would not be until after the First World War that he would make his first-class debut. This came in 1922 for the Combined Services against Essex. He played cricket on a first-class level not only for the Combined Services, but also for the British Army, who he played for on 22 occasions, as well as captaining them in some matches. Williams was an able batsman, were it not for his military career it can be assumed he would have played county cricket to some degree.  In 22 matches for the Army, he 1,630 runs at a batting average of 45.27, which made him one of the Army's stand out players of the twenties.  He made three centuries and seven half centuries for the Army. Williams had two stand out first-class seasons with the bat, scoring 366 runs in five innings at an average of 73.20. In that season he scored his maiden double century against Oxford University when opening the batting in the Army first-innings. His other standout season came in 1928 when he scored 344 runs at an average of 114.66, including his second double century and highest first-class score of 228. This came for the Army against the Royal Navy.\nWilliams additionally played first-class cricket for the Free Foresters to some degree of success, in just three first-class matches for them he scored 220 runs an average of 44.00, with a single century score of 142. His highest score for the Foresters came against Oxford University in 1933. He also played a single first-class match for the Marylebone Cricket Club in 1933, against Oxford University. Outside of the first-class game, he played two Minor Counties Championship matches for Devon in 1930 against the Surrey Second XI and the Kent Second XI.\nPersonal life\nWilliams married Elizabeth Frances Chadwyck-Healey, daughter of Sir Charles Edward Heley Chadwyck-Healey, 1st Baronet on 14 April 1925.  Elizabeth died in 1934, with the couple bearing no children. He later remarried with Evelyn Agnes Clay in 1938, the couple had four children; two sons and two daughters. One of their sons, David Arden Bruce Williams (1940&ndash;2007) was a Colonel in the Royal Green Jackets. Williams' father died in 1942.\nWilliams died in Winchester, Hampshire on 20 January 1977, at the age of 84.\nReferences\nExternal links\n*[http://www.espncricinfo.com/ci/content/player/23017.html Edward Williams] at ESPNcricinfo\n*[https://cricketarchive.com/Archive/Players/33/33898/33898.html Edward Williams] at CricketArchive\n*[http://www.unithistories.com/officers/Army_officers_W01a.html#Williams_ESB British Army Officers 1939−1945]\n*[http://www.generals.dk/general/Williams/Edward_Steven_Bruce/Great_Britain.html Generals of World War II]"
    }
  ]
}