{
  "content": [
    {
      "type": "text",
      "text": "# Edward Boker Sterling\n\n|death_place          =\n|education            =\n|spouse               =\n|parents              =\n|children             =\n|discipline           =\n|institutions         =\n|practice_name     =\n|significant_projects =    Created the standard reference work for United States revenue stamps in 1888\n|significant_design   =\n|significant_advance  =\n|significant_awards   =   APS Hall of Fame\n}}\nEdward Boker Sterling  (September 9, 1851 – November 29, 1925), of Trenton, New Jersey, was a philatelist who specialized in the study of United States postage stamps, postal stationery, and revenue stamps.\nCollecting interests\nSterling is famous for his collection and study of United States revenue stamps, which are essentially tax stamps on certain goods and commodities issued by the federal government. Sterling amassed one of the finest such collections and sold it to Hiram Edmund Deats in 1888 for what was then the huge sum of seven thousand dollars.\nIn 1890, he and Deats joined together and purchased seven boxcar loads (amounting to 213 tons) of “excessed” paperwork from the U.S. Treasury. They discovered that the lot contained a “gold mine” of revenue stamps, including unused ones. The government eventually discovered its error, and demanded return of the lot, with most of it being returned.\nAfter selling his revenue collection to Deats, Sterling became a stamp dealer, still specializing in revenue stamps. He made several important purchases, such as the archives of Philadelphia, Pennsylvania security printers and engravers Butler and Carpenter which contained both private and government revenue stamps. The archives contained essays, proofs, “special tax stamps” and other collateral material, most of which he subsequently sold to Deats.\nPhilatelic literature\nSterling issued his postage stamp catalog of United States stamps in 1887. In 1888, he issued his revenue stamp catalog of the United States, which became the standard reference for revenues.\nHonors and awards\nSterling was admitted to the American Philatelic Society Hall of Fame in 1997.\nSee also\n* Philately\n* Philatelic literature\nReferences\n* [https://web.archive.org/web/20091103180501/http://www.stamps.org/Almanac/alm_HallofFame_1995-99.htm#Sterling Edward Boker Sterling ]\nExternal links\n*"
    }
  ]
}