{
  "content": [
    {
      "type": "text",
      "text": "# Edward Howard (novelist)\n\nEdward Howard (baptised 1793 – 30 December 1841) was an English novelist and sub-editor of The Metropolitan Magazine. He then worked for New Monthly Magazine. His best known books were Sir Henry Morgan and Rattlin the Reefer.\nLife\nHoward entered the navy, where Captain Frederick Marryat was his shipmate. On obtaining a discharge, he began to contribute sea stories to periodicals. When Marryat became editor of the Metropolitan Magazine in 1832, he chose Howard as his sub-editor. Howard later joined the staff of the New Monthly Magazine, which was then edited by Thomas Hood.\nEdward Howard died suddenly on 30 December 1841. His widow, Anne Roper Howard, remarried in 1846, to Octavian Blewitt, secretary to the Royal Literary Fund.\nWorks\nHoward's Rattlin the Reefer (3 vols. London, 1836), a maritime novel, bore the inscription \"edited by the author of Peter Simple. This was misunderstood to mean that Marryat wrote it. It is available free as an E-book. Howard's other works, which were mostly issued as \"by the author of Rattlin the Reefer,\" are:\n*The Old Commodore, 3 vols. London, 1837\n*''Outward Bound; or, a Merchant's Adventures, London, 1838; originally Ardent Troughton, the Wrecked Merchant, 1836–1837 in The Metropolitan Magazine, vol. 16–19, was erroneously assigned to Marryat, and under this authorship was published in translations, like French (1838), many Russian editions. and possibly others.\n*Memoirs of Admiral Sir Sidney Smith, K.C.B., 2 vols. London, 1839;[https://archive.org/details/memoirsofadmiral01howauoft/page/134/mode/2up Volume 1] [https://archive.org/details/memoirsofadmiral02howauoft/page/n5/mode/2up Volume 2]\n*Jack Ashore, 3 vols. London, 1840\n*The Centiad: a Poem in four books, London, 1841\n*Sir Henry Morgan, the Buccaneer, 3 vols. London, 1842 (another edition 1857)\n*The Marine Ghost, in Part i. of Tales from Bentley'', 1859\nReferences\nExternal links\n*\n*"
    }
  ]
}