{
  "content": [
    {
      "type": "text",
      "text": "# Edward F. Kileen\n\n|birth_place      = Aurora, Waushara&nbsp;County, Wisconsin, U.S.\n|death_date       =\n|death_place      = Wautoma, Wisconsin, U.S.\n|restingplace     = Oakwood CemeteryBerlin, Wisconsin\n|alma_mater       = University of Wisconsin\n}}\nEdward F. Kileen (January 12, 1869 – April 14, 1944) was an American lawyer, teacher, and Republican politician from Waushara County, Wisconsin. He was a member of the Wisconsin Senate from 1911 to 1915.  Earlier, he served 14 years as district attorney of Waushara County and was village president of Wautoma, Wisconsin.\nBiography\nKileen was born on January 12, 1869, in Aurora, Waushara County, Wisconsin, to Michael Kileen and Hannah Navin. He grew up in Aurora and went to High School In Berlin, Wisconsin.  He graduated in 1890. He then became a teacher and taught for a few years.  He went off to attend Law school at the University of Wisconsin of which he graduated in 1894.\nIn 1899 he married Anna Guinan with whom he had four children.\nHe further established himself in the city by building a grand home across from the County Jail in 1908.  By 1910 he ran for Senator and served two terms in the Wisconsin Senate. He was accredited with the establishment of the trout hatchery in Wild Rose, the Waushara County Normal School and many of the Waushara County Highways. He was a member of the Berlin chapter of the Knights of Columbus, Society of the Holy Name, and Wautoma Lions Club.\nHe died April 14, 1944, and is buried at Oakwood Cemetery in Berlin, Wisconsin.\nPolitical career\nThe year he graduated from law school, Kileen made his first run for district attorney of Waushara County, Wisconsin, and won the office.  He served two consecutive terms, then returned to office after the 1900 election and served five more terms.  While serving as district attorney, he was also elected village president of Wautoma, Wisconsin, and served 8 years in that office.  In 1910, rather than running for another term as district attorney, he ran for Wisconsin Senate in what was then Wisconsin's 9th Senate district.  He won that seat and served in the Senate from 1911 to 1915. He was a Republican.\nElectoral history\nReferences"
    }
  ]
}