{
  "content": [
    {
      "type": "text",
      "text": "# Edward Crozier Creasy\n\n-->\n| nickname      =\n| birth_name    =\n| allegiance    =\n| branch        =\n| serviceyears  =\n| rank          =Major\n| servicenumber =\n| unit          =\n| commands      = Commander and Senior Liaison Officer of the Inter Allied Detachment during the Upper Silesia Plebiscite\n| battles       =World War I\n| battles_label =\n| awards        =\n| relations     =\n| laterwork     =\n}}\nMajor Edward Crozier Creasy (1888–1936) was commander and senior liaison officer of the Inter Allied Detachment during the Upper Silesia plebiscite. In May 1921, he was ambushed and, facing a Polish firing squad, said: \"The Union Jack, though invisible, is round me. You will hit the British flag if you do. You dare not do it\". The Polish execution officers put their weapons down and refused to carry out the execution order.\nAccording to Creasy's obituary in The Times, his liaison work between the Allied Forces Headquarters and General von Hoefer, and the subsequent withdrawal of von Hoefer's troops against the Polish forces of Wojciech Korfanty without further incident, was \"due to the tact and personality of Major Creasy in carrying out the instructions of the Allied Command\". He was awarded the Upper-Silesian Eagle for his bravery.\nLife\nEdward Crozier Creasy was born in Ceylon in 1888, the son of Edward Creasy  who was an officer in the Ceylon Police. His grandfather was Sir Edward Creasy, Chief Justice of Ceylon. Edward Crozier Creasy was educated in England at Bedford Modern School.\nCreasy began his military career in the Royal Garrison Artillery. He was a subaltern in the Indian Army before joining the Shanghai Municipal Police. At the outbreak of World War I he returned to England and gained a commission in the Royal Artillery where he was made captain and later major, seeing service in France, Mesopotamia and the Army Occupation. He was severely wounded in the right shoulder in Mesopotamia and was taken to Basra on the Medjidieh hospital ship which was subsequently criticised for the number of wounded on board.\nCreasy was tasked with service in South East Germany during the Upper Silesia Plebiscite in Command of the Inter Allied Detachment and as Senior Liaison Officer. His liaison work was between the HQ of the Allied Forces and General von Hoefer who had raised an army to oppose the Polish forces of Wojciech Korfanty. In May 1921, Creasy was ambushed and, facing a Polish firing squad, he said: \"The Union Jack, though invisible, is round me. You will hit the British flag if you do. You dare not do it\". The execution officers put down their weapons and refused to carry out the execution order.\nAccording to Creasy's obituary in The Times, his liaison work between the Allied Forces Headquarters and General von Hoefer, and the subsequent withdrawal of von Hoefer's troops without further incident, was \"due to the tact and personality of Major Creasy in carrying out the instructions of the Allied Command\". He was awarded the Upper-Silesian Eagle for his service. After his work in Germany he was briefly reception officer at Wembley where he was responsible for a tour by the Prince of Wales.\nAfter his military work, Creasy went to Ceylon for eight years before returning to England. He died in 1936 and was survived by his widow and two young children.\nReferences"
    }
  ]
}