{
  "content": [
    {
      "type": "text",
      "text": "# Edward Lyman Abbott\n\n| image        = Edward Lyman Abbott profile photo.jpg\n| alt          = Captain Edward Lyman Abbott profile photo wearing military uniform, circa 1915 to 1918.\n| caption      = Captain Edward Lyman Abbott(circa 1915 to 1918)\n| birth_date   =\n| birth_place  = Lovering, Ontario, Canada\n| death_date   =\n| death_place  = Southeast of Amiens, France\n| burial_place = New British CemeteryRoye, France\n| occupation   = Canadian Expeditionary Force\n| known_for    = Battle of Amiens, Abbott Cup\n| years_active = 1915–1918\n| awards       = Military Cross First Bar\n}}\nCaptain Edward Lyman Abbott  (May 1, 1891 – August 14, 1918) was a Canadian multisport athlete and soldier. Abbott was considered a fine sportsman in Regina, Saskatchewan, and won national championships in ice hockey, and rugby football. He is the namesake of the Abbott Cup, and is honoured in the Saskatchewan Sports Hall of Fame. Abbott was a decorated officer in the Canadian Expeditionary Force, and died in action during World War I in France.\nEarly life\nAbbott was born on May 1, 1891, in Lovering, Ontario, the son of James Henry Abbott and Mary Ann Jackson. He moved westward with his family in 1897, and acquired the nickname \"Hick,\" short for hickory. Abbott played hockey in high school, and developed into a fast-skating right-winger, with a knack for scoring. As a member of the Regina Shamrocks and the Regina Bees, he won the Valkenburg Cup in 1911 and 1912, as champion of the Saskatchewan Senior Hockey League. He was captain of the Regina Victorias that won the 1914 Allan Cup, and was a member of the Regina Rugby Club from 1913 to 1915, that won the Western Canada Rugby Football Union each year. Abbott was a law student, and senior civil servant for the Legislative Assembly of Saskatchewan before joining the military.\nMilitary career\nAbbott enlisted in the Canadian Expeditionary Force on September 23, 1915, in Regina. He completed officer training in Winnipeg, and was assigned to the 68th Battalion as a lieutenant. He was deployed for duty on April 28, 1916, from Halifax Harbour, aboard . Abbott was promoted to captain in the 52nd Battalion on October 30, 1916. In combat, he suffered gunshot wounds to his shoulder, and shrapnel in his eye, but continued to serve.}}\nA medal bar was added to his MC three months later after he led a raid on enemy trenches despite being outnumbered. The bar's citation reads:\n}}\nDuring the Battle of Amiens on August 14, 1918, Abbott was killed in action, by a sniper's bullet to the head. Abbott was interred in the New British Cemetery in Roye, France, grave reference I.B.13.\nLegacy\nCaptain Abbott is listed on page 357 of the Book of Remembrance for World War I. Joe Potts of the Saskatchewan Amateur Hockey Association offered a memorial trophy to the Canadian Amateur Hockey Association, in memory of Abbott. The Abbott Cup was founded in 1919 in his honour, and was awarded for the Western Canada junior hockey championship, and a berth in the Memorial Cup. The Abbott Cup and his war medals are displayed at the Hockey Hall of Fame, as an exhibit on World War I. Abbott was inducted into the Saskatchewan Sports Hall of Fame in 2014.\nReferences\nExternal links\n* [http://central.bac-lac.gc.ca/.item/?op=pdf&app=CEF&id=V0004-S028 Digitized service file – Library and Archives Canada]\n*"
    }
  ]
}