{
  "content": [
    {
      "type": "text",
      "text": "# Edward Ginzton\n\n| birth_place       = Yekaterinoslav, Russian Empire (now Ukraine)\n| death_date        =\n| death_place       = Stanford, California, U.S.\n| citizenship       =\n| nationality       = American\n| fields            = Electrical engineering\n| workplaces        = Stanford University\n| alma_mater        = University of California, Berkeley; Stanford University\n| doctoral_advisor  =\n| academic_advisors =\n| doctoral_students =\n| notable_students  =\n| known_for         =\n| influences        =\n| influenced        =\n| awards            = IEEE Medal of Honor\n| footnotes         =\n}}\nEdward Leonard Ginzton (December 27, 1915 &ndash; August 13, 1998) was a Ukrainian-American engineer.\nEducation\nGinzton completed his B.S. (1936) and M.S. (1937) in Electrical Engineering at the University of California, Berkeley, and his Ph.D. in electrical engineering from Stanford University in 1941.\nCareer\nAs a student at Stanford University, Ginzton worked with William Hansen and brothers Russell and Sigurd Varian. In 1941 he became a member of the Varian–Hansen group at the Sperry Gyroscope Company.\nGinzton was appointed assistant professor in physics at Stanford University in 1945 and remained on the faculty until 1961.\nIn 1949, Ginzton and Marvin Chodorow developed the 1 BeV 220-foot accelerator at Stanford University. After completion of the 1 BeV accelerator, Ginzton became director of the Microwave Laboratory, which was later renamed the [https://ginzton.stanford.edu Ginzton Laboratory].\nGinzton, along with Russell and Sigurd Varian, was one of the original board members of Varian Associates, founded in 1948. The nine initial directors of the company were Ginzton, Russell, Sigurd, and Dorothy Varian, H. Myrl Stearns, Stanford University faculty members William Webster Hansen, and Leonard I. Schiff, legal counsel Richard M. Leonard, and patent attorney Paul B. Hunter.\nGinzton became CEO and chairman of Varian Associates after Russell Varian died of a heart attack and Sigurd Varian died in a plane crash.\nGinzton was awarded the IEEE Medal of Honor in 1969 for \"his outstanding contributions in advancing the technology of high power klystrons and their application, especially to linear particle accelerators.\"\nGinzton was a member of the National Academy of Engineering and in the National Academy of Sciences.\nGinzton's biography is available online.\nFamily\n.  Artemas Ginzton also has a trail named for her in the Byrne Preserve in Los Altos Hills.]]\nGinzton was born in Ukraine and lived in China before moving to California in 1929.\nOn June 16, 1939, Ginzton and Artemas Alma McCann (1913–2000) married. Artemas was the daughter of James Arthur and Alma (Hawes) McCann. The Ginztons had four children: Anne Ginzton Cottrell (1942), Leonard Edward Ginzton (1943), Nancy Hader Ginzton (1946), and David Edward Ginzton (1948).\nNotes\nReferences\n*\n*\n*\n*\nExternal links\n*[http://www.nasonline.org/publications/biographical-memoirs/memoir-pdfs/ginzton-edward.pdf National Academy of Sciences Biographical Memoir]\n* [http://www.oac.cdlib.org/findaid/ark:/13030/kt9p3040hr/ Edward Ginzton Paper] s"
    }
  ]
}