{
  "content": [
    {
      "type": "text",
      "text": "# Edward FitzGerald (mountaineer)__disambig_1\n\n| birth_place = Litchfield, Connecticut\n| death_date  =\n| death_place = London, United Kingdom\n| nationality = American\n| occupation  = Mountaineer, author, soldier\n| spouse      = Ménie Muriel Dowie }}\n}}\nEdward Arthur FitzGerald (10 May 1871 – 2 January 1931) was an American mountaineer and soldier, best known for leading the expedition which made the first ascent of Aconcagua, the highest mountain in the Americas, in 1897.\nBackground and education\nof New Zealand (from left): Matthias Zurbriggen, Fizgerald, Arthur Ollivier, George Edward Mannering and Jack Adamson]]\nFitzGerald was born in 1871 at Litchfield, Connecticut, and was the third son of William John FitzGerald, barrister, a British subject, and Mary, daughter of Eli White, of New York. He was educated at St Paul's School, Concord, New Hampshire, and at Trinity College, Cambridge, where he matriculated in 1890 but did not graduate. His elder brother was Augustine (called Austin), a painter, and his elder sister was Caroline, a poet.\nMountaineering\nHe joined the Himalayan explorer Martin Conway for a walk across the Alps in 1894, where he met the Swiss guide Matthias Zurbriggen. Sufficiently impressed, FitzGerald decided to hire Zurbriggen as his guide for the next five years.\nIn 1894/95 FitzGerald travelled to New Zealand, intending to make the first ascent of Mount Cook, but local climbers, alarmed their highest mountain might first be climbed by foreigners, climbed it a few days after FitzGerald's arrival. He and Zurbriggen made the first ascent of Mount Sefton, and with the New Zealander Jack Clarke (who had made the first ascent of Mount Cook), made first ascents of Mount Sealy, Silberhorn, Mount Tasman and Mount Haidinger.\nAconcagua expedition\n| description =\n| pos = right\n| type = speech\n| image =\n}}\nIn 1896/97 FitzGerald personally financed and led a large expedition to South America to complete scientific surveys and make first ascents of some of the highest peaks in the Andes. The expedition included a geologist, surveyor, engineer, and naturalist, and six alpine guides led by Zurbriggen. After reconnoitering the Vacas valley approach to  Aconcagua, FitzGerald made a base camp at around  in the Horcones Valley, where several attempts were made to reach the summit via what is now known as the Normal Route. Five attempts were made over six weeks before Zurbriggen reached the summit alone on 14 January 1897. FitzGerald had been with Zurbriggen during the ascent, but on all attempts became nauseous at around . Eventually, fearing he would never reach the summit and the first ascent of Aconcagua would not be made, he sent Zurbriggen on alone.\nA period of heavy snow followed Zurbriggen's ascent, during which no further attempts could be made, but FitzGerald continued the siege a month later. Again he became ill during the ascent, but on 13 February 1897, the Englishman Stuart Vines and Italian guide Nicola Lanti also reached the summit. Later in the expedition Vines and Zurbriggen also made the first ascent of Tupungato.\nCareer and personal life after Aconcagua\nIn 1900 FitzGerald joined the imperial yeomanry to fight in the South African War, where he received a commission as second lieutenant in the 5th dragoon guards, and first lieutenant in 1901. He was later transferred to the 6th (Inniskilling) Dragoons, and was promoted captain in 1906, and major in 1912. He was employed in the War Office from 1914 to 1919. In 1903 he stopped climbing after an accident in Zermatt and married traveller and author Ménie Muriel Dowie (1866–1945).\nFitzGerald died on 2 January 1931 at London.\nLegacy\nFitzGerald is commemorated in the scientific name of a species of South American lizard, Liolaemus fitzgeraldi.\nReferences\nExternal links\n*"
    }
  ]
}