{
  "content": [
    {
      "type": "text",
      "text": "# Edward S. Michael\n\n| death_date    =\n| birth_place   = Chicago, Illinois\n| death_place   = Fairfield, California\n| placeofburial = Evergreen Cemetery, Springville, Utah\n| placeofburial_label = Place of burial\n| image         = Edward S. Michael.png\n| caption       = Lieutenant Edward S. Michael, official picture\n| alt           =\n| nickname      =\n| allegiance    =\n| branch        =  United States Army Air Forces United States Air Force\n| serviceyears  = 1940 - 1971\n| rank          =  Lieutenant Colonel\n| commands      =\n| unit          =  364th Bombardment Squadron 305th Bomb Group (Heavy) 8th Air Force\n| battles       = World War II\n| awards        =  Medal of Honor Distinguished Flying Cross Purple Heart Air Medal (5)\n| relations     =\n| laterwork     =\n}}\nEdward Stanley Michael (May 2, 1918 &ndash; May 10, 1994) was a United States Army Air Forces officer and a recipient of the United States military's highest decoration—the Medal of Honor—for his actions in World War II.\nEarly life\nEdward S. Michael was born at Chicago, Illinois, 2 May 1918. He was the son of Stanley W. Michael and Lillian Harriet Konior Michael. He graduated from Chicago High School in 1936 and joined the Army Air Corps from his birth city of Chicago, Illinois in November 1940.\nWorld War II\nIn 1941, private Michael was transferred to Wheeler Field, Hawaii to train as a mechanic. At first he failed the aviation cadet examination and was preparing to retake it when the Japanese attacked Pearl Harbor on 7 December 1941. In mid 1942 he was accepted for a pilot training and on 12 April 1943 he received a commissioning and his pilot wings at Douglas Army Air Field, Arizona., Lincolnshire, England, 11 April 1944. (U.S. Air Force)]]By April 1944 he was a first lieutenant piloting B-17 Flying Fortresses with the 364th Bomb Squadron, 305th Bombardment Group. He named his aircraft after his first wife, Bertie Lee. On 11 April, while flying a mission over Germany, his aircraft was singled out by enemy fighters and severely damaged by their cannon fire. As flames burned in the plane's bomb bay, Michael, who had been seriously wounded, ordered his crew to bail out. Finding that one crewman's parachute was unusable, he returned to the controls and managed to evade the enemy fighters and heavy anti-aircraft fire to fly his bomber into Allied territory. He lost consciousness due to blood loss from his wounds, but awoke in time to make a successful crash landing on English soil. All of the seven crewmembers who escaped from the aircraft were captured by the Germans and held as prisoners of war. For his actions, he was awarded the Medal of Honor nine months later, on January 15, 1945.\nMichael returned to the United States for hospitalization. Later, as a captain, he was ferrying aircraft from Love Field, Dallas, Texas.\nUnited States Air Force career\nAfter the war he transferred to the newly created U.S. Air Force and served at Fort Totten, Washington D.C. In April 1949, he graduated from Air University and for the next three years was a pilot at Hill AFB, Utah.\nIn September 1952, he was assigned to Guam and then to Hickam Field, Hawaii, where he served as chief of the Reserve Affairs Branch at Headquarters 1500th Air Base Wing.\nIn June 1955, Michael returned to the Continental United States and served in various positions at Fort Douglas, Utah, McConnell AFB, Kansas (in the rank of major), Travis AFB, California.\nOn 1 August 1963, Michael was promoted to lieutenant colonel.\nHe retired in 1971.\nLater life\nAfter his retirement Michael settled in Fairfield, California.\nHe died at age 76 and was buried at Evergreen Cemetery in Springville, Utah.\nAwards and decorations\n{| style=\"margin:1em auto; text-align:center;\"\n|-\n|colspan=\"3\"|\n|-\n|colspan=\"4\"|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|}\n{| class=\"wikitable\" style=\"margin:1em auto; text-align:center;\"\n|-\n|colspan=\"12\"|USAF Command pilot badge\n|-\n|colspan=\"6\"| Medal of Honor\n|colspan=\"6\"| Distinguished Flying Cross\n|-\n|colspan=\"4\"| Purple Heart\n|colspan=\"4\"| Air Medalwith four bronze oak leaf clusters\n|colspan=\"4\"| Air Force Commendation Medal\n|-\n|colspan=\"4\"| Army Commendation Medal\n|colspan=\"4\"| Air Force Presidential Unit Citation\n|colspan=\"4\"| Air Force Outstanding Unit Award\n|-\n|colspan=\"4\"| Army Good Conduct Medal\n|colspan=\"4\"| American Defense Service Medalwith service star\n|colspan=\"4\"| American Campaign Medal\n|-\n|colspan=\"4\"| Asiatic-Pacific Campaign Medalwith bronze campaign star\n|colspan=\"4\"| European–African–Middle Eastern Campaign Medalwith bronze campaign star\n|colspan=\"4\"| World War II Victory Medal\n|-\n|colspan=\"4\"| Army of Occupation Medal\n|colspan=\"4\"| National Defense Service Medalwith service star\n|colspan=\"4\"| Air Force Longevity Service Awardwith silver and bronze oak leaf clusters\n|-\n|}\nMedal of Honor citation\nMichael's official Medal of Honor citation reads:\nFor conspicuous gallantry and intrepidity above and beyond the call of duty while serving as pilot of a B17 aircraft on a heavy-bombardment mission to Germany, April 11, 1944. The group in which 1st Lt. Michael was flying was attacked by a swarm of fighters. His plane was singled out and the fighters pressed their attacks home recklessly, completely disregarding the Allied fighter escort and their own intense flak. His plane was riddled from nose to tail with exploding cannon shells and knocked out of formation, with a large number of fighters following it down, blasting it with cannon fire as it descended. A cannon shell exploded in the cockpit, wounded the copilot, wrecked the instruments, and blew out the side window. 1st Lt. Michael was seriously and painfully wounded in the right thigh. Hydraulic fluid filmed over the windshield making visibility impossible, and smoke filled the cockpit. The controls failed to respond and 3,000 feet were lost before he succeeded in leveling off. The radio operator informed him that the whole bomb bay was in flames as a result of the explosion of 3 cannon shells, which had ignited the incendiaries. With a full load of incendiaries in the bomb bay and a considerable gas load in the tanks, the danger of fire enveloping the plane and the tanks exploding seemed imminent. When the emergency release lever failed to function, 1st Lt. Michael at once gave the order to bail out and 7 of the crew left the plane. Seeing the bombardier firing the navigator's gun at the enemy planes, 1st Lt. Michael ordered him to bail out as the plane was liable to explode any minute. When the bombardier looked for his parachute he found that it had been riddled with 20mm. fragments and was useless. 1st Lt. Michael, seeing the ruined parachute, realized that if the plane was abandoned the bombardier would perish and decided that the only chance would be a crash landing. Completely disregarding his own painful and profusely bleeding wounds, but thinking only of the safety of the remaining crewmembers, he gallantly evaded the enemy, using violent evasive action despite the battered condition of his plane. After the plane had been under sustained enemy attack for fully 45 minutes, 1st Lt. Michael finally lost the persistent fighters in a cloud bank. Upon emerging, an accurate barrage of flak caused him to come down to treetop level where flak towers poured a continuous rain of fire on the plane. He continued into France, realizing that at any moment a crash landing might have to be attempted, but trying to get as far as possible to increase the escape possibilities if a safe landing could be achieved. 1st Lt. Michael flew the plane until he became exhausted from the loss of blood, which had formed on the floor in pools, and he lost consciousness. The copilot succeeded in reaching England and sighted an RAF field near the coast. 1st Lt. Michael finally regained consciousness and insisted upon taking over the controls to land the plane. The undercarriage was useless; the bomb bay doors were jammed open; the hydraulic system and altimeter were shot out. In addition, there was no airspeed indicator, the ball turret was jammed with the guns pointing downward, and the flaps would not respond. Despite these apparently insurmountable obstacles, he landed the plane without mishap.\nSee also\n*List of Medal of Honor recipients\nReferences\nExternal links\n*[https://www.af.mil/Medal-of-Honor/Michael/ Official Michael' page on United States Air Force website].\n*\n*[https://www.thisdayinaviation.com/tag/edward-stanley-michael/ \"11 April 1944\"]. This Day in Aviation."
    }
  ]
}