{
  "content": [
    {
      "type": "text",
      "text": "# Edward Thomas (British Army officer)\n\n}}\nMajor Edward Thomas MC (15 April 1915 &ndash; 1999) was awarded a Military Cross in May 1941 for his actions at Halfaya Pass.\nEarly life\nEdward Thomas went to school at Emanuel School in London, England, after which he became a surveyor. He joined the Territorial Army and became an officer in the Norfolk Yeomanry.\nWorld War II\nIn May 1941, Halfaya Pass (\"Hellfire Pass\"), Egypt was in British hands under a battalion of infantry and tanks. The Germans attacked on 26 May in great numbers, but the order to retreat was delayed. Thomas was ordered to the head of the pass with one gun and upon finding 260 Battery without officers he took command and arranged the evacuation of the wounded. He then encountered a further 100 men with no leaders from the Royal Indian Army Service Corps; he commandeered their trucks and drove the remaining survivors through a recently established German camp to safety. Upon reaching safety, he was summoned to appear before General Erskine. Thomas had not thought his actions to be out of the ordinary, and so he feared a Court Martial for an accidental misdemeanour. The award of his Military Cross was therefore a great surprise.\nHe was later seconded to the Sudan Defence Force and remained in the Sudan and Abyssinia for the remainder of the war, rising to the temporary rank of Khamakam (Brigadier). His merit led to him administering large areas of Libya from Kufra Oasis, in which his fluency in Arabic came in useful.\nPost war\nAs the war drew to a close he was asked to stay on by both Emperor Haile Selassie and the King of Libya, but elected to return home to England and continue the development of the family property business which he did so successfully.\nLater life\nThomas later became a popular joint master of the Hampshire Hunt and a keen rider. The onset of bronchitis at the age of 60 encouraged him to settle in Spain with his wife, Ruth. He died in 1999 in France.\nFamily\nThomas had two sons, David and Hugh Thomas, a former British olympian and now Badminton Horse Trials director and course designer.\nReferences\n*Obituary in The Daily Telegraph – 7 October 1999"
    }
  ]
}