{
  "content": [
    {
      "type": "text",
      "text": "# Edward Paston\n\nSir Edward Paston (1550–1630), second son of Sir Thomas Paston, was a Catholic gentleman of Norfolk, a poet, and amateur musician living in the reign of Elizabeth I. He is an important figure in the musical history of England, his love of music driving him to acquire and copy musical manuscripts from some of the most important composers of the Renaissance, resulting in a  unique performing collection of 16th-century house music that included works by William Byrd, Thomas Tallis, John Taverner, and Orlando di Lasso. He was especially interested in Byrd, and one of his books is the largest source of consort songs by that composer. Paston played the lute, creating a wide range of vocal settings and accompanying tablatures in partbooks that are still obtainable. As a young man he travelled extensively in Spain, being influenced by the Spanish (and Italian) form of tablature, as seen in his partbooks, rather than the generally used French form.\nIt is believed that the part-books were specially prepared for him, rather than being 'commercially' acquired, in order to suit the performing requirements of his household, thus becoming material tailored to his specific needs. The broad range of music includes motets, madrigals, extracts from masses, and consort songs.\nIn his will, Paston relates that there are various lute books intabulated in the Italian, French, and English styles, both for solo playing and as accompaniment for singing. He also mentions a chest containing sets of Latin, French, and Italian songs, from three- to eight-part versions, that are not yet printed and which he bequeaths to his son, William, until his grandson, Thomas reaches his eighteenth birthday, when they pass into his keeping. Many of these books are now housed in the British Library (formerly in the British Museum), and the Royal College of Music, London.\nReferences\nSources\n* Brett, Philip (2006). William Byrd and His Contemporaries: Essays and a Monograph. University of California Press.\n* Murray, Tessa (2014). Thomas Morley: Elizabethan Music Publisher.  Boydella & Brewer Ltd.\nFurther reading\n*"
    }
  ]
}