{
  "content": [
    {
      "type": "text",
      "text": "# Edward W. Gantt\n\n|image=Edward W. Gantt.jpg\n|caption=Gantt, as depicted in ''Frank Leslie's Illustrated Newspaper'' in 1864\n|birth_place= Maury County, Tennessee, US\n|death_place= Little Rock, Arkansas, US\n|placeofburial= Tulip, Arkansas, US\n|placeofburial_label= Place of burial\n|allegiance= Confederate States of America\n|branch= Confederate States Army\n|serviceyears= 1861–1863\n|rank= Colonel\n|unit=\n|commands= 12th Arkansas Infantry Regiment\n|battles=\n*American Civil War\n**Battle of Belmont (WIA)\n**Battle of Island Number Ten\n|awards=\n|relations=\n|laterwork= Attorney, Freedmen's Bureau agent\n}}\nEdward W. Gantt (1829 – June 10, 1874) was an American politician and Confederate soldier who defected to the Union in the American Civil War. During Reconstruction, he was an agent of the Freedmen's Bureau.\nBorn in Maury County, Tennessee, in 1829, Gantt was a delegate to the 1850 Nashville Convention, which considered secession. Later in the decade, he moved to Arkansas, which he felt allowed him more opportunities to gain prominence. He spread secessionist rhetoric after the 1860 United States presidential election, at which he had been elected to the United States House of Representatives but did not take his seat. After the outbreak of the American Civil War in 1861, Gantt became the colonel of the 12th Arkansas Infantry Regiment. He was wounded in an artillery duel while his regiment was in reserve at the Battle of Belmont, and in April 1862 was captured when the Confederate defenses of Island Number Ten fell.\nImprisoned at Fort Warren for several months, Gantt returned to Arkansas but failed to receive another command appointment amid rumors of alcoholism and womanizing. He defected to the Union in 1863, becoming an opponent of slavery, secession, and the Confederacy. From late 1865 to 1866, he was an agent of the Freedmen's Bureau in southwest Arkansas. After moving to Little Rock, he was a regional prosecuting attorney from 1868 until he resigned in 1870. At the time of his death in 1874, Gantt was working on a compilation of Arkansas state law.\nBiography\nEarly career\nEdward W. Gantt was born in Maury County, Tennessee in 1829. His father, George, was a preacher and teacher. Becoming a lawyer, Gantt practiced in Williamsport, Tennessee and, along with his brother, was a delegate to the Nashville Convention in 1850, which considered secession. Gantt was one of the convention's youngest delegates and did not participate extensively.55}} In 1854 or 1853, he moved to Washington, Arkansas, where he also practiced law. Gantt had ambitions to become a prominent political figure, and did not believe that Tennessee or eastern Arkansas gave him appropriate opportunities.56}} Gantt was elected as prosecuting attorney for the Sixth Judicial District of Arkansas in 1854, 1856, and 1858. He married Margaret Reid in 1855; the couple had four children. Her family was prominent in Dallas County, Arkansas. In 1858, he was reported to own three carriages, eight slaves, and $10,000 of real estate. As an opponent of Arkansas's ruling political \"Family\", Gantt ran for a seat in the United States House of Representatives in 1860. His campaign received the support of Thomas C. Hindman. The Democratic Party was unable to decide on a nominee between Gantt and Charles B. Mitchel, so both candidates ran. Gantt won the general election, polling at 54 percent.\nAbraham Lincoln won the 1860 United States presidential election, and Gantt began canvassing northern and western Arkansas with secessionist speeches. Gantt's speeches focused on the claimed risks that the culture of the northern United States presented to southern ideals of honor, pride, and freedom, although the historian Randy Finley questions whether Gantt actually believed his rhetoric.60}} In November, both he and Hindman made inflammatory speeches to the Arkansas General Assembly. Arkansas seceded in early 1861, and joined the Confederate States of America in May. Gantt never took office in the United States House of Representatives, but was also elected to the Confederate States Congress. He preferred a military command to a legislative office though. In late July, he was elected colonel of the 12th Arkansas Infantry Regiment; Gantt had previously requested to be made a major general.\nCivil War service\nHe and his regiment were transferred to Columbus, Kentucky. On November 7, the 12th Arkansas remained in reserve at the Battle of Belmont, but Gantt was badly wounded during an artillery duel. In December, another regiment was added to Gantt's command, and he and his men were transferred to the defenses of the Island Number 10 and New Madrid, Missouri, area.62}} Gantt's superior, Leonidas Polk, recommended him for promotion to brigadier general, but the request was denied by Judah P. Benjamin, the Confederate States Secretary of War, because Judah desired to only promote individuals that he personally knew were competent. General P. G. T. Beauregard appointed Gantt as an acting brigadier general early the next year.96}} In early April, the Confederate defenses at Island Number 10 collapsed, and Gantt surrendered at Tiptonville, Tennessee, on April 8. He was imprisoned at Fort Warren until August 27, when he was exchanged.63}}\nBack home in Arkansas, Gantt awaited another military assignment, but did not receive one. Rumors of a drinking problem had spread, and there were also claims that he flirted with the wives of other officers. Believing that the Confederacy no longer offered him a chance at prominence, Gantt made his way to the Union lines at Vicksburg, Mississippi, and surrendered. He met with Lincoln the next month, and then returned to Arkansas, where he advocated for Arkansans to reject the Confederacy. On December 11, he received the first pardon given by Lincoln to a Confederate officer. Gantt spoke against the Confederacy, slavery, and secession, and in 1863 and 1864 gave speeches in the northern United States designed to strengthen support in the Union for continuing the war. These speeches contained some militant rhetoric; Finley states that this indicates that he had \"disengaged himself from the carnage of the battlefield\", attributing Gantt's actions to a desire to \"regain and maintain political power at all costs\". Lincoln proposed the ten percent plan for returning the seceded states to the Union, and Gantt promoted this plan in Arkansas. While his family eventually accepted that he had changed, his defection from the Confederacy and support for the Union earned him the disgust of many southerners.67}}\nPostwar activities\nIn March 1865, the Freedmen's Bureau was formed, and the war was mostly over by the next month. According to Finley, with the war over, Gantt opposed giving many Arkansas Confederates pardons; Finley suggests that Gantt was still unhappy over his lack of promotions in Confederate service.69}} However, the historian Carl Moneyhon states that Gantt advocated pardoning some Arkansas Confederates to build support for the Unionist government of the state, with Gantt specifically asking for the pardon of Augustus H. Garland. In September, Gantt became the general superintendent of the Freedmen's Bureau for the Southwest District of Arkansas.69}} In this role, he oversaw the relations between freed slaves and white Arkansans in his district; he spent much time reviewing and mediating labor contracts. Gantt also organized fundraising for a hospital, supported education for former slaves, and encouraged African Americans in his district to have formal marriages.70}} He also attempted to end \"bodily coercion\" as a means of enforcing labor contracts in his district. Due to his postwar activities, Gantt was considered a scalawag.\nIn 1866, Gantt left his role with the Freedmen's Bureau and moved to Little Rock. His work with the Bureau had made him unpopular with Arkansas's class of white elites, which would block his hopes for higher political office. From 1868 to 1870, he was the regional prosecuting attorney. In this role, he integrated juries with African Americans, and tried to make the judicial system fair for both races. He also opposed prostitution, adultery, and \"illegal cohabitation\" among the former slaves. Gantt received death threats, sometimes carried seven weapons on his person, and kept his house dark after sundown. In 186871}} or 1869, he had been badly beaten for his stances. Gantt opposed the activities of the Ku Klux Klan and in 1867 and 1868 supported Ulysses S. Grant's presidential election campaign. Gantt resigned his role as prosecuting attorney in 1870, although he continued to prosecute occasional cases. Powell Clayton, the governor of Arkansas, tasked Gantt in 1873 with compiling Arkansas's legal code. While continuing this work, Gantt died in Little Rock of a heart attack on June 10, 1874, and was buried in Tulip. Finley notes that his work with Freedman's Bureau had a positive impact, and that he helped convince the Union that brutal peace terms in the Confederacy were not necessary.\nReferences\nSources\n*\n* 1874 |publisher=University of Arkansas Press |date=2003 |location=Fayetteville, Arkansas |isbn=1-55728-740-6}}\n* 1865 |date=1970 |journal=Arkansas Historical Quarterly |volume=29 |issue=2 |pages=99111|doi=10.2307/40019277 |jstor=40019277 }}\n* 73}}\n*"
    }
  ]
}