{
  "content": [
    {
      "type": "text",
      "text": "# Edward Pinkowski\n\n| birth_place = Holyoke, Massachusetts, U.S.\n| death_date =\n| death_place = Cooper City, Florida, U.S.\n| occupation = Historian\n}}\nEdward G. Pinkowski (August 11, 1916 – January 11, 2020) was an American writer, journalist, and historian of Polish descent. He was presented with the Polish American Historical Society's Haiman Award in 1989, and the Cavalier's Cross of the Order of Merit by the President of Poland in 2001. He turned 100 in August 2016 and died in January 2020 at the age of 103 and 5 months.\nBooks\n;Pills, Pen & Politics (1974)\nPinkowski's book on Confederate soldier and Baton Rouge mayor Leon Jastremski is the only biography written on the subject. Reviewer Donald Everett found Pinkowski's book took effort to identify Polish immigrants and Polish American families in Louisiana at the time, but at no time could Pinkowski definitively prove that Jastremski had any friends or personal connection to them other than his Polish name. James S. Pula criticized Pills, Pen & Politics because it did not offer enough analysis of the inner motivations behind Jastremski's political career.\n;Lattimer Massacre (1950)\nLattimer Massacre historian Michael Novak credited Pinkowski as \"the true hero\" in preserving the story of the Lattimer Massacre from historical oblivion. According to Novak's historiography, the Massacre was completely unknown to historians until the Slavic Community on Strike (1968) was published by Victor R. Greene, who mentioned several paragraphs on Lattimer. Novak contacted Greene, who stated that his information on Lattimer was from a largely unnoticed pamphlet printed by Edward Pinkowski in 1950.\nResearch\nPinkowski will always be remembered as the man who found the bones of Polish-American war hero, general Casimir Pulaski.\nHis research on Polish trading pioneer Anthony Sadowski led to the discovery of his grave in Douglassville, Pennsylvania, in 1966. Pinkowski's study of Pulaski led him to believe that his body was buried under the Pulaski monument in Savannah, Georgia, contradicting past historians' reports of him being buried at sea. In 1996, the marble statue was removed for repair, and an unmarked coffin was extracted from underneath. The city of Savannah did not earmark any money to finance a DNA test, so Pinkowski personally paid $30,000 to test the body against DNA of Pulaski's living descendants. The results were inconclusive. Pinkowski researched the Lattimer Massacre extensively, and interviewed two surviving marchers, Andrew Meyer and John Miklos, in the 1940s. Pinkowski archived information on Polish American families and prominent Poles in America, collected on an Internet database, poles.org, which contained over 8,000 entries as of 2014.\nPersonal life\nHe had a son Jack who is president of the Poles in America Foundation started by his father, which is continuing the work of research in Polish-American history.\nReferences\nFurther reading\n* Everett, D. (1975). [https://www.jstor.org/stable/2205601 The Journal of Southern History, 41(4), pp. 575-76. doi:10.2307/2205601]\nExternal links\n[https://www.congress.gov/bill/109th-congress/house-joint-resolution/54/text Casimir Pulaski becomes honorary citizen of USA, courtesy of Historian L.u.bek!!!]"
    }
  ]
}