{
  "content": [
    {
      "type": "text",
      "text": "# Edward Byrne Memorial Justice Assistance Grant Program\n\nThe Edward Byrne Memorial Justice Assistance Grant Program, or JAG originates out of the Consolidated Appropriations Act of 2005.  The program is named for New York City police officer Edward Byrne who was killed in the line of duty in 1988 while protecting an immigrant witness who agreed to testify against drug dealers.  The Edward Byrne Memorial Justice Assistance Grant Program (EBMGP) was established by the Anti-Drug Abuse Acts of 1986 and 1988, allocating approximately $200 million dollars to municipalities both local and state. The allocated money was used in efforts to reduce drug-crimes and support drug control, which was of national concern at the time. The JAG program is administered by the Office of Justice Programs's Bureau of Justice Assistance, and provides federal criminal justice funding to state, local and tribal jurisdictions.  The funding is intended for a variety of areas, such as personnel, training, equipment and supplies. In Fiscal Year 2019, $263.8 million in funding was available by the JAG Program. The Recovery Act of 2009 appropriated $2 billion in funding to the JAG program.\nThe United States Department of Justice announced in late July 2017 that more than two hundred sanctuary cities will be disqualified from receiving Byrne grants if their noncompliance with U.S. Immigration and Customs Enforcement continues. Several cities challenged the change in courts, and as of November 2018, cases in District Courts of New York, Pennsylvania, California and Illinois have all found for the cities, with the Seventh Circuit Appeals Court affirming the Illinois district ruling. In February 2020, the United States Court of Appeals for the Second Circuit overturned the New York ruling, making it possible the case will go to the Supreme Court.\nReferences\nExternal links\n* [https://www.bja.gov/ Bureau of Justice Assistance]  official website\n* [https://www.usaspending.gov/federal_account/015-0404 State and Local Law Enforcement Assistance] account on USAspending.gov"
    }
  ]
}