{
  "content": [
    {
      "type": "text",
      "text": "# Edward Whigham\n\n| birth_place = Leadhills\n| death_date  = 3 October 1823\n| death_place =\n| occupation  = Hotel owner and Provost of Sanquhar\n}}\nEdward Whigham (1750–1823) was the landlord of a coaching inn, a bailie, Provost of Sanquhar, bibliophile and one of Robert Burns's close friends during his Nithsdale and Dumfries days. Edward married Jane Osborne (1758 - 6 October 1846).\nLife and character\nAlthough born in Leadhills he moved to Sanquhar as a child and as a young man he took a lease on the town's principal hostelry, the 'New Inn', later the 'Queensberry Arms Hotel' locally known as 'Whigham's Inn', one of Scotland's oldest hostelries. Colloquially known as \"The Inns\", it had been partly rebuilt in Whigham's day and this gave it the name \"New Inn\".\nHe was a bibliophile, had an extensive library and collected old Scottish ballads for himself and Robert Burns.\nWhigham was a bailie in 1788 and was Provost of Sanquhar between the 30 September 1793 and the 29 September 1800.\nAs stated, he married Jane Osborne and the couple had seven sons:\nJames m Elizabeth Hair (02 May 1880 - 1861) on 13 Sept 1829 in Sanquhar. 6 children.\nEdward (1793 - 28 Dec 1874) m Jane Brown (1797 - 15 Feb 1871) on 16 Apr 1846 in Ayr.\nJohn (1782 - 19 Sept 1857)\nGeorge (- 1836)\nRobert (28 July 1783 -)\nWilliam. 2 Children.\nSamuel (1809 - 12 Sept 1880) m Charlotte Scott (1816 - 17 Apr 1838) on 25 Dec 1836. 3 children.\nEdward Whigham died aged 73 on the 3 October 1823 and was buried in Sanquhar churchyard next to the family mausoleum. His wife Jane was buried next to her husband in 1846 and the grave is marked by a marble plaque.\nAssociation with Robert Burns\nHe first met Burns in January 1789 when the poet visited his coaching inn on a journey to Ayrshire, calling it 'the only tolerable inn in the place'. As an excise officer his work brought him here and many visits followed. Burns became close friends with Edward and his wife Jane, referring to them as 'my particular acquaintences'. They remained friends even after Burns moved to Dumfries from Ellisland Farm.\nIn December 1794 Burns became a freeman and burgess of Sanquhar during the time that Whigham was provost, probably therefore through the influence of his friend.\nIt is on record that on Christmas Eve 1794 Burns left Whigham's Inn well before dawn and did not arrive home at Dumfries, totally exhausted, until eleven o'clock that night having visited victuallers in Dunscore, Penpont, Cairnmill, Tynron and Crossford.\nThe Second whistle contest\nA few days after the famous 'Whistle' contest at Friars Carse a second contest using whisky toddy was enacted at 'Whigham's Inn'. Burns had borrowed the whistle from Fergusson of Craigdarroch to show to family and friends at Mauchline. Those involved in this contest were Burns, Whigham, John King and Provost William Johnston of Clackleith, later Blackaddie, the judge being Whigham's son John. It is not recorded who the victor was. John Duff claimed to have a drinking glass that was used in the contest and Mrs William Kerr the punch-bowl that held the whisky-toddy, now held by the Dumfries & Galloway Museums Service.\nThe Kilmarnock Edition\nBurns presented a copy of the first 'Kilmarnock Edition' of his poems to the Whighams, an inscription in an unknown hand actually states 'Mrs Whigham'. Burns also sent them holograph copies of some of his songs. Whigham collected Scottish airs for Burns and the poet sent his wife copies of several of his poems. The 'Kilmarnock Edition' passed into the possession of Mr J.R.Wilson of the Royal Bank in Sanquhar. Wilson lent his copy to the 1896 Burns Exhibition and it is now held by Princeton University.\nOde, Sacred to the Memory\nMrs Mary Oswald of Auchencruive's funeral cortege called at 'Whigham's Inn' on a severe winter night in January 1789 and this resulted in Burns, after an exhausting day's work, having to depart and travel the 12 frozen miles to New Cumnock on his young favourite 'Pegasus', to find warmth, food, drink and a bed for the night. This experience resulted in Burns's first enjoying a warm fire and then settling down to pen the bitter poem Ode, Sacred to the Memory of Mrs Oswald of Auchencruive, beginning, \"Dweller in yon dungeon dark\" which he sent a copy of to Mrs Frances Dunlop, receiving an admonition as a result.\nThe New Inn and Diamond Point Engraving\nAs stated, Burns was a frequent visitor to Sanquhar and he often stayed at the New Inn on the High Street where he is said to engraved lines in 1789 on a windowpane after breakfast one day, something he had done at several other inns across Scotland. The poem engraved was not one composed by Burns himself, but by John Hughes (1677-1720), before 1719, for a window in Wallington House, home of a Mrs Elizabeth Bridges. In the 1880s, the window pane was said to have been broken or removed during repairs to the house, but in the 1880s Miss Allison, a grand-daughter of Edward Whigham, recited the lines from memory for the author of a local guidebook.\nThe lines are also preserved, with minor variation in wording, not though in Burns's hand, in the copy of Burns's Kilmarnock Edition that he is said to have presented to Mrs. Whigham, now in the Princeton University Library. In 1896 the engraved window pane, which may genuinely have been the work of Burns, was reported to be part of the Burns memorabilia collection of Mr David Barker, and it is more recently said to be in New Zealand.\nCorrespondence with Burns\nOn 7 February 1789 Burns wrote to Mrs Jane Whigham \"I received the books safe and sound; and in return, I inclose you the Poem you wanted. You will likewise see the first sketch of the Poem, oh a something different plan. My best compliments to the Bailie: I am much indebted to your kindness and his to the two boys, my brothers in law.\"\nIn 1793 Burns wrote \"Memorandum for Provost E[dward] W[higham], to get from John French his sets of the following Scotch airs -\n1. The auld yowe jumpt o'er the tether.\n2. Nine nights awa', welcome hame my dearie.\n3. A' the nights o' the year, the chapman drinks nae water.\nMr Whigham will either of himself , or through the medium of that worthy veteran of original wit and social ininquity, Clackleith, procure these, and it will be extremely obliging to.\"\nThis was at the time when Burns was collecting old Scottish airs and songs for George Thomson's A Select Collection of Original Scottish Airs for the Voice.\nIn 1996 Christie's auctioned the following: \"BURNS, ROBERT, 1759-1796. Autograph manuscript (signed \"The Author\"), his \"Song--Tune. Humours of glen,\" addressed at bottom by the poet \"To Provost E. Whigham, this first copy of the song,\" n.p., n.d. [1795?]. 1 page, 4to, 240 x 197&nbsp;mm. (9 3/8 x 7 3/4 in.), integral blank, paper weak at a few folds, tiny chip torn from lower edge of sheet.\"\nFamily\nEdward's wife, Jane Osborne died 6 October 1846, aged 88 years; Edward Whigham junior was a merchant in Sanquhar who died 28 December 1874, aged 81 years; John Whigham died on 19 September 1857; Robert, a younger brother living in Glasgow, died some years later. George Whigham joined the Hon. East India Company as an assistant surgeon in Bombay. He died in 1836.\nThe Queensberry Arms Hotel\nLocated at 52 High Street (NS 78194 09837) the old hotel became a shop before being abandoned and boarded up. A plaque on the building exterior erected in 1996 marked the bicentenary of Burns's death. The old hotel is on the 'Buildings at Risk' register.\nSee also\n*Robert Aiken\n*Jean Armour\n*John Ballantine\n*Lesley Baillie\n*Alison Begbie\n*Nelly Blair\n*Isabella Burns\n*May Cameron\n*Mary Campbell (Highland Mary)\n*Jenny Clow\n*Gavin Hamilton (lawyer)\n*Helen Hyslop\n*Nelly Kilpatrick\n*Jessie Lewars\n*William Nicol\n*Anne Rankine\n*Isabella Steven\n*Peggy Thompson\nReferences\n;Notes\nFurther reading\n# De Lancey Ferguson, J. (1931). The Letters of Robert Burns. Oxford : Clarendon Press.\n# Douglas, William Scott (Edit.) 1938. The Kilmarnock Edition of the Poetical Works of Robert Burns. Glasgow : The Scottish Daily Express.\n# Mackay, James (2004). Burns. A Biography of Robert Burns. Darvel : Alloway Publishing. .\n# McQueen, Colin Hunter (2008). ''Hunter's Illustrated History of the Family, Friends and Contemporaries of Robert Burns. Messsrs Hunter McQueen & Hunter.\n# Purdie, David, McCue & Carruthers, G (2013). Maurice Lindsay's The Burns Encyclopaedia.'' London:Robert Hale.\nExternal links\n*[https://www.youtube.com/watch?v=QSgFSvChaH8 Robert Burns and the Queensberry Hotel, Sanquhar]\n*[https://www.facebook.com/groups/554450588374356/ Researching the Life and Times of Robert Burns] Burns Researcher's site."
    }
  ]
}