{
  "content": [
    {
      "type": "text",
      "text": "# Edward Rehatsek\n\nEdward Rehatsek (3 July 1819 &ndash; 11 December 1891) was an Orientalist and translator of several works of Islamic literature including the Gulistan of Saadi Shirazi, ibn Ishaq’s Prophetic biography, and the Rawẓat aṣ-ṣafāʾ. All three translations were originally published by the Kama Shastra Society founded by Richard Francis Burton and Forster Fitzgerald Arbuthnot at the end of the 19th century.\nBiography\nRehatsek was born in 1819 in the town of Ilok, Hungary, which at that time was within the borders of the Austrian Empire. The town today lies within Croatia. Rehatsek attended university in Budapest and received a master's degree in civil engineering. Between 1842 and 1847, he visited France, lived four years in the United States, and sailed at last to India, arriving in Bombay (now, Mumbai) where he spent the rest of his life. He arrived in India the beginning of December, 1847, and therefore completed a residency of 44 years without leaving the country. During his residency, he devoted much of his time to studying Oriental languages and literature, translating literature, writing articles for various agencies and preparing papers for learned societies.\nIn Bombay, Rehatsek studied eastern languages, literatures and customs. He supported himself first by employment in the Public Works Department, later as Professor of Latin and Mathematics at Wilson College. Rehatsek was a proficient linguist, fluent in twelve languages. He provided private lessons to students in Latin and French, as well as Persian and Arabic, and wrote scholarly articles and translations on Asian, particularly Islamic, history and custom, publishing in the Journal of the Royal Asiatic Society. After retiring from Wilson College in 1871, Rehatsek continued to work as Examiner at the Bombay University in Latin, Arabic, Persian, and French until 1881.\nFor the Oriental Translation Fund's New Series, Rehatsek translated and forwarded several works including: The Nigaristan, or Picture Gallery by Muin-uddin Jawini, Biography of Our Lord Muhammad, the Apostle of Allah according to Ibn Hisham, the first two parts of Mirkhond's General History and the first part of The Rauzat-us-safa.\nAlthough he was a man of chaste habits, Rehatsek was not squeamish in worldly matters. His association with Sir Richard Burton's Kama Shastra Society proved he was not prudish. He was in frequent correspondence with Burton, and was a friend of Forster Fitzgerald Arbuthnot, the cofounder with Burton of the Kama Shastra Society, which Rehatsek appreciated would not expurgate his work. Rehatsek was scrupulously devoted to the fidelity of his translations at a time when such fidelity to indelicate tales of eastern literature might lead to western prosecutions for pornography.\nDeath\nRehatsek died in Bombay on 11 December 1891 at the age of 72. He was suffering from cystitis and was cremated in the Hindu fashion.\nAt the time of his death, Rehatsek was working on the third part of The Rauzat-us-safa and in one of his last letters, after describing his maladies, finishes by writing \"Hope, however, never dies; and as work occupies the mind and keeps off despair, I am determined to translate for you, though slowly, the third part of The Rauzat-us-safa, so as to make the history of the Khalifahs complete.\"\nSee also\n* Ottoman Monuments of Ilok\nReferences\nFurther reading\n* Arberry, A. J. Classical Persian Literature. London: George Allen and Unwin, Ltd., 1958.\n* Arbuthnot, F. F. \"Life and Labours of Mr. Edward Rehatsek.\" In Journal of the Royal Asiatic Society of Great Britain and Ireland For 1892. London: Royal Asiatic Society of Great Britain and Ireland, 1892.\n* Rosenbaum, David M. Introduction to ''The Gulistan or Rose Garden of Sa'di. Trans. Edward Rehatsek. Omphaloskepsis Books, 2010.\n* Wright, Thomas. The Life of Sir Richard Burton'', 2 vols. London: Everett & Co., 1906."
    }
  ]
}