{
  "content": [
    {
      "type": "text",
      "text": "# Edward Hawke, 1st Baron Hawke\n\n| image               = Portrait of Admiral of the Fleet Edward Hawke, 1st Baron Hawke (1705-1781) (by George Knapton).jpg\n| imagesize           = 220\n| smallimage          =\n| caption             =\n| order               = First Lord of the Admiralty\n| term_start          = 1766\n| term_end            = 1771\n| vicepresident       =\n| viceprimeminister   =\n| deputy              =\n| president           =\n| primeminister       = Lord Chatham  Duke of Grafton  Lord North\n| predecessor         = Sir Charles Saunders\n| successor           = Lord Sandwich\n| birth_date          =\n| birth_place         = London, England\n| death_date          =\n| death_place         = Sunbury-on-Thames, England\n| resting_place       = St. Nicolas' Church, North Stoneham, Hampshire\n| constituency        =\n| party               =\n| spouse              =\n| profession          = Naval officer, politician\n| religion            =\n| nickname            =\n| allegiance          = Great Britain\n| branch              = Royal Navy\n| serviceyears        = 1720–1781\n| rank                = Admiral of the Fleet\n| unit                =\n| commands            = HMS WolfWestern Squadron Commander-in-Chief, Portsmouth\n| battles             =\n* War of the Austrian Succession\n** Battle of Toulon\n** Second Battle of Cape Finisterre\n* Seven Years' War\n** Battle of Quiberon Bay\n| awards              =\n}}\nAdmiral of the Fleet Edward Hawke, 1st Baron Hawke,  (21 February 1705 – 17 October 1781) was a Royal Navy officer and politician. As captain of the third-rate , he took part in the Battle of Toulon in February 1744 during the War of the Austrian Succession. He also captured six ships of a French squadron in the Bay of Biscay in the second Battle of Cape Finisterre in October 1747.\nHawke went on to achieve a victory over a French fleet at the Battle of Quiberon Bay in November 1759 during the Seven Years' War, preventing a French invasion of Britain. He developed the concept of a Western Squadron, keeping an almost continuous blockade of the French coast throughout the war.\nHawke also sat in the British House of Commons from 1747 to 1776 and served as First Lord of the Admiralty for five years between 1766 and 1771. In this post, he was successful in bringing the navy's spending under control and also oversaw the mobilisation of the navy during the Falklands Crisis in 1770.\nEarly life\nHawke was the only son of Edward Hawke, a barrister of Lincoln's Inn, and his wife Elizabeth Bladen, a daughter of Nathaniel Bladen of Hemsworth in Yorkshire, and widow of Col. Ruthven. Hawke benefited from the patronage of his maternal uncle, Colonel Martin Bladen, a Member of Parliament.\nHawke joined the navy as a volunteer in the sixth-rate  on the North American Station in February 1720. Promoted to lieutenant on 2 June 1725, he transferred to the fifth-rate  on the West Coast of Africa later that month, to the fourth-rate  in the Channel Squadron in April 1729 and to the fourth-rate  in November 1729. After that he moved to the fourth-rate HMS Edinburgh in the Mediterranean Fleet in May 1731, to the sixth-rate  in January 1732 and to the fourth-rate , flagship of Commodore Sir Chaloner Ogle, Commander-in-Chief of the Jamaica Station, in December 1732.\nAfter this, Hawke's career accelerated: promoted to commander on 13 April 1733, he became commanding officer of the sloop  later that month and promoted to captain on 20 March 1734, he became commanding officer of the sixth-rate  later that month. The following year he went on half-pay and did not go to sea again until July 1739 when he was recalled to become commanding officer of HMS Portland on the North American Station and was sent to cruise in the Caribbean with orders to escort British merchant ships. He did this successfully, although it meant his ship did not take part in the British attack on Porto Bello in November 1739 during the War of Jenkins' Ear.\nBattle of Toulon\nHawke became commanding officer of the third-rate  in June 1743: he did not see action until the Battle of Toulon in February 1744 during the War of the Austrian Succession. The fight at Toulon was extremely confused, although Hawke had emerged from it with a degree of credit. While not a defeat for the British, they had failed to take an opportunity to comprehensively defeat the Franco-Spanish fleet when a number of British ships had not engaged the enemy, leading to a mass court martial. Hawke's ship managed to capture the only prize of the battle, the Spanish ship Poder, although it was subsequently destroyed by the French. He was then given command of the second-rate  in August 1745.\nBattle of Cape Finisterre\nDespite having distinguished himself at Toulon, Hawke had few opportunities over the next three years. However, he was promoted to rear admiral on 15 July 1747 and appointed Second-in-Command of the Western Squadron, with his flag in the fourth-rate  in August 1747. He went on to replace Admiral Peter Warren as the Commander-in-Chief, English Channel in charge of the Western Squadron, with his flag in the third-rate , in October 1747. Hawke then put a great deal of effort into improving the performance of his crews and instilling in them a sense of pride and patriotism. The Western Squadron had been established to keep a watch on the French Channel ports. Under a previous commander, Lord Anson, it had successfully contained the French coast and in May 1747 won the First Battle of Cape Finisterre when it attacked a large convoy leaving harbour.\nin 1747, at which Hawke captured six ships of a French squadron: the French ship Intrepid battling against several British ships by Pierre-Julien Gilbert.]]\nThe British had received word that there was now an incoming convoy arriving from the West Indies. Hawke took his fleet and lay in wait for the arrival of the French. In October 1747, Hawke captured six ships of a French squadron in the Bay of Biscay in the Second Battle of Cape Finisterre. The consequence of this, along with Anson's earlier victory, was to give the British almost total control in the English Channel during the final months of the war. It proved ruinous to the French economy, helping the British to secure an acceptable peace at the negotiations for the Treaty of Aix-la-Chapelle.\nPeace\nFor Hawke, however, the arrival of peace brought a sudden end to his opportunities for active service. In December 1747, he was elected as a Member of Parliament for the naval town of Portsmouth, which he was to represent for the next thirty years. He was not on good terms with the new First Lord of the Admiralty, Lord Anson, although they shared similar views on how any future naval war against France should be waged. In spite of their personal disagreements, Anson had a deep respect for Hawke as an admiral, and pushed unsuccessfully for him to be given a place on the Admiralty board. Promoted to vice admiral on 26 May 1748, he became Port Admiral at Portsmouth serving in that post for three years. He was installed as a Knight Companion of the Order of the Bath (KB) on 26 June 1749 and was recalled as Port Admiral at Portsmouth in 1755.\nSeven Years' War\nfrom 1751. While the relationship between the two men was often strained, they had a mutual respect for each other.]]\nAs it began to seem more likely that war would break out with France, Hawke was ordered to hoist his flag in the first-rate HMS St George and to reactivate the Western Squadron in Spring 1755. This was followed by a command to cruise off the coast of France intercepting ships bound for French harbours. He did this very successfully, and British ships captured more than 300 merchant ships during the period. This in turn further worsened relations between Britain and France, bringing them to the brink of declaring war. France would continue to demand the return of the captured merchant ships throughout the coming war. By early 1756, after repeated clashes in North America, and deteriorating relations in Europe, the two sides were formally at war.\nFall of Menorca\nHawke was sent to replace Admiral John Byng as commander in the Mediterranean, with orders to hoist his flag in the second-rate HMS Ramillies, in June 1756. Byng had been unable to relieve Menorca (historically called \"Minorca\" by the British) following the Battle of Minorca and he was sent back to Britain where he was tried and executed. Almost as soon as Menorca had fallen in June 1756, the French fleet had withdrawn to Toulon in case they were attacked by Hawke. Once he arrived off Menorca, Hawke found that the island had surrendered and there was little he could do to reverse this. He decided not to land the troops he had brought with him from Gibraltar. Hawke then spent three months cruising off Menorca and Marseille before returning home where he gave evidence against Byng. Hawke was subsequently criticised by some supporters of Byng, for not having blockaded either Menorca or Toulon. He was promoted to full admiral on 24 February 1757.\nDescent on Rochefort\nHawke blockaded Rochefort in 1757 and later in the year he was selected to command a naval escort that would land a large force on the coast of France. The expedition arrived off the coast of Rochefort in September. After storming the offshore island of Île-d'Aix, the army commander Sir John Mordaunt hesitated before proceeding with the landing on the mainland. Despite a report by Colonel James Wolfe that they would be able to capture Rochefort, Mordaunt was reluctant to attack. Hawke then offered an ultimatum – either the Generals attacked immediately or he would sail for home. His fleet was needed to protect an inbound convoy from the West Indies, and could not afford to sit indefinitely off Rochefort. Mourdaunt hastily agreed, and the expedition returned to Britain without having made any serious attempt on the town. The failure of the expedition led to an inquiry which recommended the court-martial of Mordaunt, which commenced on 14 December 1757 and at which he was acquitted.\nIn 1758 Hawke directed the blockade of Brest for six months. In 1758 he was involved in a major altercation with his superiors at the Admiralty which saw him strike his flag and return to port over a misunderstanding at which he took offence. Although he later apologised, he was severely reprimanded. In Hawke's absence the Channel Fleet was placed under the direct command of Lord Anson.\nBattle of Quiberon Bay\nin 1759, where Hawke won his most famous victory. Hawke believed he would have taken the entire French fleet had he had two hours more daylight.]]\nIn May 1759 Hawke was restored to the command of the Western Squadron. Meanwhile, the Duc de Choiseul was planning an invasion of Britain. A French army was assembled in Brittany, with plans to combine the separate French fleets so they could seize control of the English Channel and allow the invasion force to cross and capture London. When Hawke's force was driven off station by a storm, the French fleet under Hubert de Brienne, Comte de Conflans, took advantage of the opportunity and left port.\nDuring a gale on 20 November 1759 Hawke took the risky decision to follow French warships into an area of shoals and rocky islands. The British, unlike the French, had no maps or knowledge of the area, and the French admiral fully expected the British ships to wreck themselves in the dangerous waters. Hawke ordered the master of his ship to follow the French admiral into these waters. The master of the Royal George, Hawke's flagship, is said to have remonstrated as to the danger of doing so, further compounded by a lee shore. To this Hawke gave his famous reply, \"You have done your duty Sir, now lay me alongside the Soleil Royal\".  He won a sufficient victory in the Battle of Quiberon Bay, that when combined with Admiral Edward Boscawen's victory at the Battle of Lagos, the French invasion threat was eliminated. Although he had effectively put the French channel fleet out of action for the remainder of the war, Hawke was disappointed he had not secured a more comprehensive victory, asserting that had he had two more hours of daylight the whole enemy fleet would have been captured.\nBlockade of Brest\nAlthough Hawke's victory at Quiberon Bay ended any immediate hope of a major invasion of Great Britain, the French continued to entertain hopes of a future invasion for the remainder of the war, which drove the British to keep a tight blockade on the French coast. This continued to starve French ports of commerce, further weakening France's economy. After a spell in England, Hawke returned to take command of the blockading fleet off Brest. The British were now effectively mounting a blockade of the French coast from Dunkirk to Marseille. Hawke attempted to destroy some of the remaining French warships, which he had trapped in the Vilaine Estuary. He sent in fire ships, but these failed to accomplish the task. Hawke developed a plan for landing on the coast, seizing a peninsula, and attacking the ships from land. However, he was forced to abandon this when orders reached him from Pitt for a much larger expedition.\nCapture of Belle Île\nIn an effort to further undermine the French, Pitt had conceived the idea of seizing the island of Belle Île, off the coast of Brittany and asked the navy to prepare for an expedition to take it. Hawke made his opposition clear in a letter to Anson, which was subsequently widely circulated. Pitt was extremely annoyed by this, considering that Hawke had overstepped his authority. Nonetheless, Pitt pressed ahead with the expedition against Belle Île. An initial assault in April 1761 was repulsed with heavy loss but, reinforced, the British successfully captured the island in June. Although the capture of the island provided another victory for Pitt and lowered the morale of the French public by showing that the British could now occupy parts of Metropolitan France, Hawke's criticisms of its strategic usefulness were borne out. It was not a useful staging point for further raids on the coast and the French were not especially concerned about its loss, telling Britain during subsequent peace negotiations that they would offer nothing in exchange for it and Britain could keep it if they wished.\nFirst Lord of the Admiralty\n, between 1768 and 1770.]]\nHawke then retired from active duty, becoming Rear-Admiral of Great Britain on 4 January 1763 and Vice-Admiral of Great Britain on 5 November 1765. He was made First Lord of the Admiralty in the Chatham Ministry in December 1766 and promoted to Admiral of the Fleet on 15 January 1768. His appointment drew on his expertise on naval matters, as he did little to enhance the government politically. During his time as First Lord, Hawke was successful in bringing the navy's spending under control. He also oversaw the mobilisation of the navy during the Falklands Crisis in 1770 and was then succeeded as First Lord by Lord Sandwich in January 1771.\nHawke was influential in the decision to give Captain James Cook command of his first expedition that left in 1768. When at a meeting in the Royal Geographical Society it was suggested that a civilian should lead the expedition, Hawke is supposed to have remarked that he would sooner have his right hand cut off than allow this to happen. Cook named a series of prominent places that he came across in the 'New World' after Hawke as a sign of his gratitude.\nFinal years\n, Hampshire, showing the arms of Hawke (''Argent, a chevron erminois between three boatswain's whistles purple), with inescutcheon of pretence of Brooke quartering Hammond of Scarthingwell, for his heiress wife.]]\nHawke was created Baron Hawke \"of Towton\" (in which Yorkshire parish was situated his residence of Scarthingwell Hall, inherited by his wife) on 20 May 1776. Towards the end of his life he had his country house built in Sunbury-on-Thames and lived alternately there and at a rented home in North Stoneham, Hampshire. He died at his house in Sunbury-on-Thames on 17 October 1781 and was buried at St Nicolas Church, North Stoneham.\nCultural references\nHis memorial, carved by John Francis Moore and depicting the Battle of Quiberon Bay, is in St. Nicolas' Church, North Stoneham.\nIn the Robert Louis Stevenson's 1883 novel Treasure Island, Long John Silver claims that he used to serve in the Royal Navy and lost his leg under \"the immortal Hawke\".\nPlaces named after Hawke include:\n;Australia\n* Cape Hawke in New South Wales.\n;New Zealand\n* Hawke Bay and subsequently Hawke's Bay Region in the North Island.\n;Canada\n* Hawke's Bay, Newfoundland and Labrador.\n* Port Hawkesbury, Nova Scotia.\n;Royal Navy ships named in Hawke's honour\n* The 74-gun   launched in 1820.\n*   built in 1891.\nMarriage and issue\nIn 1737 he married Catherine Brooke, the only daughter and sole heiress of Walter Brooke (1695-1722) of Burton Hall, Gateforth near Hull and of Gateforth Hall in Yorkshire, by his wife Catherine Hammond (d.1721) daughter and heiress of William Hammond of Scarthingwell Hall, in the parish of Saxton, Yorkshire. Hawke made his home at Scarthingwell Hall and took for his barony the territorial designation \"of Towton\" from the parish in which it was situated. By his wife he had three sons and one daughter, who survived, and three children who died in infancy.\nReferences\nSources\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\nExternal links\n*\n*"
    }
  ]
}