{
  "content": [
    {
      "type": "text",
      "text": "# Edward Villiers, 1st Earl of Jersey\n\n| death_place       = England\n| occupation        = Diplomat, politician\n}}\nEdward Villiers, 1st Earl of Jersey (165625 August 1711) was an English diplomat, courtier and Tory politician from the Villiers family. He was created Baron Villiers and Viscount Villiers in 1691 and Earl of Jersey in 1697. A leading opponent of the Whig Junto, he was made Southern Secretary in 1699.\nFamily and early life\nHe was the son of Sir Edward Villiers (1620–1689) of Richmond, Surrey, by his wife Frances Howard, the youngest daughter of Theophilus Howard, 2nd Earl of Suffolk, and Elizabeth Home.\nHis grandfather was Sir Edward Villiers (c.&nbsp;1585–1626), Master of the Mint and Lord President of Munster, who was half brother of George Villiers, 1st Duke of Buckingham and of Christopher Villiers, 1st Earl of Anglesey. His sister was Elizabeth Villiers, the reputed mistress of King William III, who was later Countess of Orkney as the wife of George Hamilton, 1st Earl of Orkney.\nHe was admitted to St John's College, Cambridge in 1671 and took his Master of Arts in 1672.\nCareer\nFollowing the Glorious Revolution of 1688, Villiers was appointed Master of the Horse to Queen Mary II, and in June 1689 he succeeded his father as Knight Marshal to the royal household. On 20 March 1691 he was elevated to the Peerage of England as Viscount Villiers of Dartford and Baron Villiers of Hoo, in part owing to the influence of his sister, Elizabeth. In 1695, he was sent as a diplomat to the Dutch Republic, representing his country at the Congress of Ryswick in 1686, and on 25 May 1697 he was appointed one of the Lords Justices of Ireland, although he rarely visited that country subsequently. The same year, on 13 October he was made Earl of Jersey and English ambassador at The Hague. In 1698 he became the English ambassador in Paris.\nAfter returning to England in 1699, was made Secretary of State for the Southern Department, and on three occasions he was one of the Lords Justices of England. In June 1700, he was appointed Lord Chamberlain by King William, an office he continued to hold after the accession of Queen Anne in 1702. The same year he received an honorary degree from the University of Oxford.\nIn 1701, he persuaded the young writer and diplomat Matthew Prior to abandon his former Whig allies and vote for the impeachment of his fellow Kit Cat Club member and patron Lord Halifax. Jersey replaced Halifax as Prior's patron.\nIn 1704, he was dismissed from office by Queen Anne after objecting to the foreign policy initiatives of Lord Godolphin. After his dismissal, Lord Jersey was activity involved in Jacobite schemes, using his wife, who was a Roman Catholic, as a useful go-between. Despite this, shortly before his death he had been nominated to attend the Congress of Utrecht by the British government. In 1711 the Queen was reluctantly persuaded to bring him back into the Cabinet as Lord Privy Seal, but he died immediately afterwards. He died on 25 August 1711, the day of his investiture, of apoplexy.\nThe Scottish spy, John Macky, observed that Lord Jersey was \"a man of weak capacity [but] he makes a very good figure in his person, being tall, well-shaped, handsome, and dresses clean\".\nMarriage and children\nOn 17 December 1681 he married Barbara Chiffinch (1663before 13 December 1735), only daughter of William Chiffinch (1602–1691), Keeper of the Privy Closet and a confidant of King Charles II, and his wife Barbara Nunn. By her he had two sons and a daughter:\n*William Villiers, 2nd Earl of Jersey (c.&nbsp;168213 July 1721); through him they are ancestors of Diana, Princess of Wales, and of her sons, William, Prince of Wales and Prince Harry, Duke of Sussex.\n*Henry Villiers (died 1743)\n*Mary Villiers (died 17 Jan 1734/35), who married twice:\n**Firstly to Thomas Thynne (died 1710) son of Henry Frederick Thynne and Dorothy Philips, to whom she bore a son: Thomas Thynne, 2nd Viscount Weymouth.\n**Secondly in 1711 she married George Granville, 1st Baron Lansdowne (1666–1735), without sons.\nAfter Lord Jersey's death, his Jacobite-supporting widow took her younger son Henry to France, for the express purpose of having him raised in the Roman Catholic faith, to which she strongly adhered. This caused something of a scandal, as Henry was a minor and a royal ward. Barbara was created suo jure Countess of Jersey in the Jacobite peerage by the exiled Pretender, James Francis Edward Stuart, in 1716.\nReferences\nBibliography\n* Field, Ophelia. The Kit-Cat Club: Friends Who Imagined a Nation. HarperCollins 2009."
    }
  ]
}