{
  "content": [
    {
      "type": "text",
      "text": "# Edward Bishop Dudley\n\n|term_start2         = November 10, 1829\n|term_end2           = March 3, 1831\n|predecessor2        = Gabriel Holmes\n|successor2          = Romulus M. Saunders\n|office3             = Member of the North Carolina House of Commons\n|term3               = 1816–1817\n|birth_date          =December 15, 1789\n|birth_place         =Onslow County, North Carolina, U.S.\n|death_date          =October 30, 1855 (aged 65)\n|death_place         =Wilmington, North Carolina, U.S.\n|party               =Whig\n| spouse             = Elizabeth Henry Haywood\n}}\nEdward Bishop Dudley (December 15, 1789 – October 30, 1855) was the 28th governor of the U.S. state of North Carolina from 1836 to 1841. He served in the United States House of Representatives as a Jacksonian from 1829 to 1831.\nEarly life\nBorn near Jacksonville, North Carolina, the son of Christopher Dudley, a wealthy farmer and businessman, and Margaret Snead. Dudley entered politics early in life. In 1811, at age twenty-one, he was elected to the lower house of the state legislature from Onslow County. He was reelected in 1812, and in 1814 he was elected to the North Carolina State Senate. During the War of 1812, between service in the legislature,\nhe was second in command of a regiment from Onslow. The regiment was stationed at Wilmington, and he liked the area and moved there permanently after the war. In 1815 he married Elizabeth \"Eliza\" Henry Haywood; they had six children. After Eliza's death he married the widow of General John Cowan.\nEntry into politics\nIn 1816 Dudley won election to the lower house of the state legislature from the borough of Wilmington and won reelection in 1817. Dudley did not work with the \"Old Republicans,\" North\nCarolina's dominant political faction, but instead actively joined a group of opportunists who formed a \"People party\" ticket, and in 1824 Dudley was an elector. The People party won and gave\ntheir vote to Andrew Jackson. In 1828, after the \"Old Republicans\" were also backing Jackson, Dudley was again a Jackson elector, and Jackson easily carried the state. Dudley's support of Jackson would soon end. Gabriel Holmes, the congressman from Dudley's district, died, and in 1829 Dudley won a special election to replace him. In his only term in Congress Dudley usually voted against Jackson's party, and he chose not to run for reelection.\nIn 1831 and 1832 Dudley was active in a group, headed by former Secretary of the Navy John Branch, that denounced Martin Van Buren, whom Dudley opposed more vehemently than he did Jackson, while professing to support Jackson. The group nominated Jackson for president and Philip P. Barbour for vice president. Dudley served as an elector, but the Jackson-Barbour ticket was badly beaten. Nevertheless, this coalition of Van Buren's enemies, which had at first received support from National Republicans, would reemerge in the 1830s as the Whig party, of which Dudley became a member.\nIn 1833 a bipartisan movement for statewide internal improvements formed, and Dudley was one of its most active leaders. A statewide meeting in Raleigh with Dudley its chairman demanded a state-supported railroad system. Dudley already was the leading investor in organizing the Wilmington and Raleigh Railroad, and in January 1834 he secured the first charter of the railroad from the state. He had personally invested $25,000, and $113,000 had been raised. In March 1836 the stockholders held their first meeting, and Dudley was elected the railroad's first president with a salary of $2,000 a year. The actual building of the railroad began in October 1836.\nGovernor\nIn 1835 North Carolina's old constitution was replaced by a new one. Dudley joined other eastern Carolina political leaders from both parties in agreeing to make limited concessions to\nthe West, and the new constitution called for direct election of the governor. Dudley was unanimously nominated as his party's choice at a state convention. He accepted the nomination, declaring Van Buren \"a Northern man in soul, in principle and in action\" (Raleigh Register, 23 Feb. 1836). Southern sectionalism was a major Whig issue, and the party's support for distributing the proceeds of public land sales to the states, a measure Jackson had vetoed, greatly helped Dudley. He won the election, defeating the incumbent Governor, Richard Dobbs Spaight by about 4,000 votes. Dudley was the first North Carolina governor elected by popular vote.\nIn his first term Dudley and his party were not able to dominate the state. A Democratic victory in a special election gave the Democrats a majority of the legislature. Whig senator Willie P. Magnum was replaced by a Democrat, and in November 1836 North Carolina voters endorsed Van Buren. The state had received almost $1.5 million as its share of money from the federal government's \"deposit\" bill. The Whig plan, supported by Dudley, to use most of the money for railroads and the state bank was seriously amended by the Democrats, and the Democratic plan passed. This plan was the real beginning of a state internal improvements plan, but the Whigs took sole credit for the system, and Dudley was called the \"father of internal improvements\" in the state.\nDudley easily won reelection in 1838. A meeting of Wake County Democrats nominated Branch, who was in many ways the founder of the Whig party although he now called himself a Democrat. Many Democrats refused to recognize the nomination and stayed away from the polls. Dudley received 64 percent of the vote, the largest margin ever won by an antebellum candidate for governor.\nHe urged more aid to internal improvement and to public schools, but owing primarily to East-West sectionalism, he accomplished relatively little.\nIn 1840 Dudley, although still popular, was barred by the state constitution from running for reelection. He had resigned his Wilmington and Raleigh Railroad presidency in 1837, but he was\nreelected as president of the railroad in 1841 and retained the position until 1847. The railroad, which never went to Raleigh, changed its name to the Wilmington and Weldon Railroad and at one time was the longest railroad in the world.\nLater life\nIn 1847 Dudley retired from active leadership in the railroad. He remained a wealthy gentleman and an ardent Whig, and he entertained, among others, Secretary of State Daniel Webster and Senator Henry Clay. Dudley remained an important railroad developer and Whig leader, fitting the pattern of business interest in the party.  He died at his home in Wilmington in 1855.\nReferences\nExternal links"
    }
  ]
}