{
  "content": [
    {
      "type": "text",
      "text": "# Edward R. Annis\n\nEdward R. Annis (March 27, 1913 – September 14, 2009) was a Florida surgeon who served as president of the American Medical Association and as president of the World Medical Association. He was one of the most foremost critics of the United States Medicare program.\nBiography\nAnnis was born on March 27, 1913, in Detroit, Michigan. He graduated from Annunciation High School and the University of Michigan. In 1938, he received his Doctorate of Medicine from Marquette University School of Medicine and was a member of Phi Chi medical fraternity. He completed his surgical residency at Cook County Graduate School of Surgery. He moved to Florida, practicing medicine in Tallahassee. In 1953, he became chief of surgery at Mercy Hospital in Miami.\nAnnis demonstrated talent as a public speaker while in high school and college, and became a member of the AMA's speaker's bureau in December 1959. As such, he traveled throughout the United States making speeches on the AMA's behalf. From January 1961 to June 1962, Annis made a series of speeches against the King Anderson bill, which would authorize the use of Social Security taxes to pay for health care benefits for retirees. He debated Democratic Senator Hubert Humphrey and the president of the U.A.W. on television.\nPresident John F. Kennedy gave a speech on May 20, 1962, at Madison Square Gardens describing the bill's benefits,  explained the bill's intent. \"...we say that during his working years, he shall contribute to Social Security as he has in the case of his retirement, $12 or $13 a month. When he becomes ill, or she becomes ill over a long period of time. he pays $90 so that people will not abuse it, but then lets say that he has a bill of $1,500...of which $1000 is hospital bills. This bill will pay that $1000 in hospital bills and then I believe, he and the effort he makes with his family can meet his other responsibilities. Now that does not seem such an extraordinary piece of legislation.\" ... \"they (the doctors) do not comprehend what we are trying to do.\" .... \"we do not cover doctor's bills here\"...\"we do not affect the freedom of choice, you can go to any doctor you want.\"\nThe AMA then rented the Gardens and prime time television so that Annis and Leonard Larson, then the President of the AMA, could argue against passage. The AMA's efforts resulted in the King-Anderson Bill dying in committee in 1962 and 1963.\nAnnis stated: \"The King-Anderson Bill is a cruel hoax and illusion. It wastefully covers millions who do not need it, heartlessly ignores millions who do need coverage. It is not true insurance. It will create an enormous and unpredictable burden on every working taxpayer. It offers sharply limited benefits. It will lower the quality and availability of hospital services throughout our country.\" Dr. Annis warned that cost-plus financing of Medicare would doom it to bankruptcy and trigger destruction of the doctor-patient relationship. \"This bill would put the government smack into your hospital,\" he said, \"defining services, setting standards, establishing committees, calling for reports, deciding who gets in and who gets out, what they get and what they do not get, even getting into the teaching of medicine.\" Annis believed that what people against Medicare called \"socialized medicine\" would have consequences for American healthcare including loss of physician autonomy to bureaucratic control and the imposition of government regulation into the patient-physician relationship.\nBuoyed by his popularity from the anti-Medicare campaign, Annis successfully ran for the AMA presidency in June 1962, taking office in June 1963. While AMA president, he intensified the AMA's resistance to Medicare. Annis' term expired in June 1964.\nAnnis authored the partly autobiographical, Code Blue: Health Care In Crisis () in which he reprises his analysis of Medicare's effects, laying most of what he felt is wrong with American health care at the feet of what he viewed as socialist changes without mention of its benefits. He saw the solution as ending the current third party payer system, eliminating state-mandated insurance, and tort reform.\nReferences\n*Lichtenstein, Nelson et al. Political Profiles. Volume 3, \"The Kennedy Years.\" pp 12 – 14. New York: Facts On File, Inc, 1976."
    }
  ]
}