{
  "content": [
    {
      "type": "text",
      "text": "# Edward Darling\n\nEdward Flewett Darling (born 24 July 1933) was Bishop of Limerick and Killaloe from 1985 to 2000.\nBiography\nDarling was born into an ecclesiastical family, growing up in Skibbereen, County Cork, brother to Vivienne and Evelyn. He developed a love of music from an early age, growing up as a choir boy with St. Nicholas Choir, Cork.\nEducated at St. John's School, Leatherhead and Trinity College, Dublin. Initially reading Classics and the arts, he later studied theology attending the Divinity School. he was also an active member of the [https://en.wikipedia.org/w/index.php?title=List_of_Trinity_College_Dublin_student_organisations&oldid=1147710871 Trinity College Choral Society]. Involvement with the society included undertaking the role of Secretary 1955/1956 alongside Assistant Secretary Patricia Mann; later to become his wife.\nHe was ordained in 1956: his first posts being curacies in Belfast. Initially posted to St. Luke's parish Shankill Road for three years before moving to St. John's Orangefield Castlerea. He then held incumbencies at St Gall's Carnalea, County Down in 1962 until 1972 when he move to St John's Malone, Belfast before his ordination to the episcopate over the diocese of Limerick & Killaloe in 1985.\nAfter retirement in 2000, from his posting as Bishop to Limerick & Killaloe, he began working alongside Dr Donald Davison on The Church of Ireland publication, Companion to the Church Hymnal, published in 2005.\nHe became an Honorary Fellow of the Guild of Church Musicians in 2006 and was elected Executive President of the Hymn Society of Great Britain and Ireland at its annual conference in July 2007.\nEdward's father, Vivian William Darling was a previous Archdeacon of Cloyne.\nWilliam Flewett, his grandfather, was Bishop of Cork, Cloyne and Ross from 1933 to 1938.\nPublications\nBishop Darling was General Editor of the interim supplementary hymnal Irish Church Praise in 1990 and of the Church Hymnal, (fifth edition) in 2000. Both books feature some of his tunes and texts, the latter including adaptations, paraphrases and new versions of liturgical canticles.\nHe compiled the lectionary hymn-guides Choosing the Hymns (Collins, 1984) and Sing to the Word (OUP, 2000) and was joint-author with Dr. Donald Davison of Companion to Church Hymnal (Columba, 2005).\nReferences"
    }
  ]
}