{
  "content": [
    {
      "type": "text",
      "text": "# Edward Stanhope\n\n| birth_place = Belgravia, London\n| death_date =\n| death_place = Chevening, Sevenoaks, Kent\n| nationality = British\n| party = Conservative\n| alma_mater = Christ Church, Oxford\n| spouse =\n| parents = Philip Stanhope, 5th Earl Stanhope Emily Harriet\n}}\nEdward Stanhope PC (24 September 1840 – 21 December 1893) was a British Conservative Party politician who was Secretary of State for War from 1887 to 1892.\nBackground and education\nBorn in Belgravia in London in 1840, Stanhope was the second son of Philip Stanhope, 5th Earl Stanhope, by his wife Emily Harriet, daughter of General Sir Edward Kerrison, 1st Baronet. Arthur Stanhope, 6th Earl Stanhope, was his elder brother and Philip Stanhope, 1st Baron Weardale, his younger brother.\nEducated at Harrow School, where he was in the cricket XI in 1857, and Christ Church, Oxford, Stanhope studied law, being called to the bar at the Inner Temple in 1865. He played some cricket at university without making the Oxford First XI, but in 1861 played a single first-class cricket match for Kent County Cricket Club. He played the game regularly for amateur sides such as I Zingari and Free Foresters and in 1879 made two further first-class appearances, one for the Gentlemen of the South and the last for I Zingari. He played association football at school and remained a \"keen fisherman and high class shot\" throughout his life.\nPolitical career\npublished in Vanity Fair in 1879.]]\nIn 1874 Stanhope was elected to the House of Commons for Mid Lincolnshire, a seat he held until 1885, and then represented Horncastle until his death. He soon rose to a position of prominence within the party. In 1875, he became Parliamentary Secretary to the Board of Trade, and in 1878 moved up to Under-Secretary of State for India, where he was a key assistant to India Secretary Lord Cranbrook.\nAfter the Tories' fall from power in 1880, Stanhope supported Commons leader Sir Stafford Northcote against younger Tories led by Lord Randolph Churchill in internal Conservative party squabbling. When the Conservatives returned to the power, Stanhope became vice-president of the Committee of Council on Education, with a seat in the cabinet, and almost immediately thereafter President of the Board of Trade. He moved up to major cabinet office in Salisbury's second government, serving first as Colonial Secretary from 1886 to 1887 and then as Secretary of State for War from 1887 to 1892 following a cabinet reshuffle in January 1887.\nAs War Secretary, Stanhope fought for reform against the reactionary high officers – most notably the Duke of Cambridge, the Commander in Chief, and Sir Garnet Wolseley, the Adjutant-General. In spite of his own inexperience in military affairs and this formidable opposition, Stanhope achieved a fair amount, although it was his Liberal successor, Henry Campbell-Bannerman, who managed to push Cambridge into retirement.\nPersonal life\nStanhope married Lucy Constance Egerton at Eaton Square in 1870. The couple had no children. In December 1893, Stanhope died suddenly of a heart attack, aged 53 whilst visiting his brother at the family estate of Chevening. His wife established a scholarship at Harrow in his name in 1895.\nReferences\n*\nExternal links\n*"
    }
  ]
}