{
  "content": [
    {
      "type": "text",
      "text": "# Edward Settle Godfrey\n\n| death_date    =\n| birth_place   = Kalida, Ohio, U.S.\n| death_place   = Cookstown, New Jersey, U.S.\n| placeofburial = Arlington National Cemetery\n| placeofburial_label = Place of burial\n| allegiance    = United States of America\n| branch        = United States Army\n| serviceyears  = 1861, 1867–1907\n| rank          =  Brigadier General\n| unit          = 21st Ohio Infantry Regiment7th U.S. Cavalry Regiment\n| commands      = 9th US Cavalry RegimentDepartment of the Missouri\n| battles       = American Civil War\n*Battle of Scary Creek\nIndian Wars\n*Battle of the Little Bighorn\n*Battle of Bear Paw\n*Wounded Knee Massacre\nSpanish–American WarPhilippine–American War\n| awards        = Medal of Honor\n}}\nEdward Settle Godfrey (October 9, 1843 – April 1, 1932) was a United States Army Brigadier General who received the Medal of Honor for leadership as a captain during the Indian Wars.\nHe commanded a troop of U.S. Army cavalry soldiers at both the Battle of the Little Bighorn in 1876, and Wounded Knee Massacre in 1890.\nEarly life and education\nGodfrey was born October 9, 1843, in Ottawa, Ohio. He enlisted as a private in the Union Army at the beginning of the American Civil War. He served in Company D, 21st Ohio Infantry from April to August 1861.\nHe was admitted to the United States Military Academy at West Point two years later, and graduated in 1867.\nCareer\nGodfrey joined the 7th U.S. Cavalry Regiment and as a lieutenant was a survivor of Battle of the Little Bighorn. He wrote an account of the battle and his experiences in it, originally published in Century Magazine in January 1892, which was highly influential in shaping perceptions of the battle and Custer's generalship. Despite being severely wounded at the Battle of Bear Paw Mountain against Chief Joseph and the Nez Perce Indians, September 30, 1877, Godfrey continued to lead his men in battle. He received the Medal of Honor in 1894 for his leadership actions during this battle.\nGodfrey was breveted major on February 27, 1890. He served in Cuba in 1898 during the Spanish–American War and in the Philippine–American War overseas (1899–1902). He retired from the army on October 9, 1907, with the rank of Brigadier General.\nAt the ceremony of the burial of the Unknown Soldier from World War I in Arlington, Virginia, Godfrey led two platoons of Medal of Honor recipients as participants.\nGodfrey died on April 1, 1932, at his home in the Cookstown section of New Hanover Township, New Jersey. He is buried at Arlington National Cemetery with his wife, Ida Emely Godfrey.\nWounded Knee Massacre\nGodfrey was Captain of D Troop of the 7th Cavalry and commanded its soldiers at the Wounded Knee Massacre in 1890.\nHe testified:\nMarriage and family\nHis first wife died before the turn of the century. Their surviving children in 1932 were Mary Godfrey and E.S. Godfrey Jr., who became a physician. On October 6, 1892, Edward  married for the second time, Ida D. Emley Godfrey (1856–1941), daughter of Hanry and Phebe Ann Emley.\nMedal of Honor citation\nRank and organization: Captain, 7th U.S. Cavalry. Place and date: At Bear Paw Mountain, Mont., 30 September 1877. Entered service at: Ottawa, Putnam County, Ohio. Born: 9 October 1843, Ottawa, Ohio. Date of issue: 27 November 1894.\nCitation:\nLed his command into action when he was severely wounded.\nControversy\nThere have been several attempts by various parties to rescind the Medals of Honor awarded in connection with the Battle of Wounded Knee. Proponents claim that the engagement was in-fact a massacre and not a battle, due to the high number of killed and wounded Lakota women and children and the very one-sided casualty counts. Estimates of the Lakota losses indicate 150–300 killed, of which up to 200 were women and children. Additionally, as many as 51 were wounded. In contrast, the 7th Cavalry suffered 25 killed and 39 wounded, many being the result of friendly fire.\nCalvin Spotted Elk, direct descendant of Chief Spotted Elk killed at Wounded Knee, launched a petition to rescind medals from the soldiers who participated in the battle.\nThe Army has also been criticized more generally for the seemingly disproportionate number of Medals of Honor awarded in connection with the battle. For comparison, 20 Medals were awarded at Wounded Knee, 21 at the Battle of Cedar Creek, and 20 at the Battle of Antietam. Respectively, Cedar Creek and Antietam involved 52,712 and 113,000 troops, suffering 8,674 and 22,717 casualties. Wounded Knee, however, involved 610 combatants and resulted in as many as 705 casualties (including non-combatants).\nSee also\n* List of Medal of Honor recipients\n* List of Medal of Honor recipients for the Indian Wars\nReferences\n:\nExternal links\n*"
    }
  ]
}