{
  "content": [
    {
      "type": "text",
      "text": "# Edward Niesen\n\n| birth_place = Chicago, Illinois, United States\n| death_date =\n| death_place =New Delhi, India\n| occupation = Educationist\n| nationality = American (USA)\n| ordained    =\n| writings    =\n| congregations = Society of Jesus\n| offices_held =\n| title       = Father\n| spouse      =\n| children    =\n| parents     =\n| footnotes   =\n}}\nEdward Niesen was born in Chicago on June 4, 1908, and died March 12, 1974, in Delhi, India. He was an American Jesuit priest, missionary in India and Nepal where he taught in several schools, amongst them the St. Xavier's High School, Patna, the Godavari St. Xavier's, Kathmandu and St. Xavier's School, Delhi.\nBiography\nAfter joining the Society of Jesus on 20 September 1926, he arrived in India in 1933. He completed his studies at St. Mary's, Kurseong. After tertianship, he joined Fr. Marshall D. Moran in the founding of St. Xavier's High School, Patna, where he initially worked as vice-principal & hostel superintendent. Fr. Niesen could teach several subjects including mathematics and was an able administrator. During his time at St. Xavier's High School, Patna, students performed extremely well academically and won distinctions of various sorts like Rhodes Scholarships.\nIn 1949, when Fr. Moran went to Nepal, Niesen took charge as principal of St. Xavier's High School, Patna. Fr. Niesen introduced the house system at St. Xavier's High School, Patna in which the boys were divided into four houses- Lions, Leopards, Tigers & Panthers. The houses competed against each other in sports and other extra-curricular activities. The system exists at St. Xavier's High School, Patna to this very day and was also replicated at Godavari St. Xavier's, where Niesen later moved. A great sports man himself, Niesen encouraged his students to participate in sports. He formed leagues in all sports and there were tournaments organised throughout the school year that culminated in Annual Sports Day.\nBy 1954, Godavari St. Xavier's was well established and another school at Jawalakhel had been opened for the primary students. Niesen moved to Nepal to take up the work of principal of Godavari High School and superior of the Jesuits in Nepal. He also continued the task of teaching mathematics in all the senior classes. Later, Fr. Niesen moved to Jawalakhel to take over the junior school and built the \"new\" building at Jawalakhel, one of the first structures in Nepal using the then novel reinforced concrete pillars and slabs.\nFr. Niesen suffered from asthma, and later emphysema. By 1968 Fr. Niesen's health had deteriorated, he was asked by the provincial to move to Delhi to take over the junior section of St. Xavier's School, Delhi, where he put all his skills to good use to build up that school, a task he continued until his death in March 1974.\nBibliography\n*Jim Cox SJ: We Band of Brothers- Volume 1, The Patna Jesuit Society, Patna, 1994.\nReferences"
    }
  ]
}