{
  "content": [
    {
      "type": "text",
      "text": "# Edward Leo Krumpelmann\n\n| birth_place        = St. Paul, Minnesota, US\n| death_date         =\n| death_place        = Minneapolis, Minnesota, US\n| body_discovered    =\n| resting_place      = Maryknoll, New York\n| resting_place_coordinates =\n| other_names        =\n| known_for          =\n| education          =\n| alma_mater         = St. Thomas Military Academy in St. Paul, Nazareth Hall Seminary\n| employer           =\n| occupation         = Missionary, priest, relief worker, educator\n| years_active       = 1941&mdash;1975\n| title              = Father\n| height             =\n| term               =\n| predecessor        =\n| successor          =\n| party              =\n| opponents          =\n| boards             =\n| parents            =\n| relations          =\n| signature          =\n| website            =\n| footnotes          =\n}}\nEdward Leo Krumpelmann, MM (, January 30, 1909 &mdash; June 23, 1975) was an American Catholic priest, missionary, relief worker, medical aid worker and educator in Kongmoon (now Jiangmen), Guangdong Province, China and in Hong Kong in the mid 20th century. He was a member of the Maryknoll Society.\nEarly life\nKrumpelmann was born on January 30, 1909, in Saint Paul, Minnesota. He graduated from St. Thomas Military Academy in St. Paul in 1926, with training in electrical and mechanical engineering, then entered University of Minnesota in 1927. He stayed in University of Minnesota for only three years and went to work. In January 1931, he began his studies at the Nazareth Hall Seminary. Subsequently, he entered Maryknoll on August 1, 1934, and studied at The Venard, Bedford, and Maryknoll Seminary. He was ordained to priesthood on June 22, 1941. Until his studies away from St Paul, he had been a parishioner in the Church of St Mark.\nMissionary\nDiocese of Kongmoon\nTogether with the priests Warren Brennan, Winkels, and Sibert, Krumpelmann arrived in Hong Kong on October 15, 1941, aboard the Pan-Am Clipper from Manila. He was immediately sent to the Roman Catholic Diocese of Jiangmen in the city of Kongmoon. He stayed in China throughout the Second World War.\nAmong the many missionary work, medical care is an important category of aid the Maryknoll Fathers provided to those in need. This was no exception in China, and medical aid was part of Krumpelmann's job and a tool for his preaching. Krumpelmann was much praised for his ability to offer medical assistance when there was no medical practitioner available on the spot to help. Jean-Paul Wiest recorded that “Fr Krumplemann went on a mission trip 50 miles up the road and the barber of the town said to him, ‘My son has gone crazy, he is only 15 years old. We have got him tied up.’ So Fr Krumpelmann gave the kid one grain of santonin with one grain of calomel which was a purgative. In three or four days the child was all cured. Of course the father was delighted and the story went around the village and the neighbourhood, and the promotion of that accidental cure was worth hundreds of hours of preaching.”\nVice Rector of Mountain View\nShortly after the war ended, Krumpelmann suffered from tuberculosis, and had to return to the United States in April 1947. He continued to serve as a Maryknoll priest after his return to the States, and was Vice Rector at Mountain View between 1949 and 1958.\nFounding the parish of Kwun Tong\nIn 1958, Krumpelmann was assigned by the Maryknoll to Hong Kong. After having seen Kowloontsai (now Tai Hang Tung) transformed into a thriving, well-established, active Parish and Centre, Bishop Frederick A. Donaghy, Maryknoll’s Regional Superior of Hong Kong and Taiwan, asked Peter Alphonsus Reilly and Krumpelmann in 1959 to found a new parish in the then government planned satellite industrial town, Kwun Tong. They rented a room on in the then new Housing Society public housing on Ngau Tau Kok Road called Garden Estate, organized catechists and catechumenates, and obtained government approval for a new clinic.\nFor two years, Reilly and Krumpelmann lived in a cramped single, tiny room adjacent to the clinic in the first housing estate on Ngau Tau Kok Road and so developed a strong bond of friendship, respect and mutual understanding with the residents of the apartment blocks. This eventually turned into St John the Baptist Parish of Kwun Tong in June 1962.\nIn 1959 Krumplemann, aware of the demand for medical service in the poor neighbourhood, asked for assistance of the Maryknoll Sisters in running a clinic in the Kwun Tong area. He hoped the Sisters’ clinic would replace the existing one managed by the Reilly and himself. In Nov 1959, Monica Marie Boyle and Helen Kenny opened the clinic in Room number 1, first floor of Orchid House. The local Precious Blood Sisters once helped them with their initial needs. While the Hong Kong Government had planned to erect factories and housing for 300,000 people in that area, the government requested the clinic to provide emergency treatment to injured workers in factory accidents.\nIn 1960, the clinic moved to Lily House. The address was Catholic Mission Clinic, Maryknoll Sisters, Ground Floor, Lily House, 293 Ngau Tau Kok Road.\nAs more people moved into Kwun Tong, the problems Krumpelmann faced increased. One of the key problems was education for the children. Solace and comfort sprang from plans for the building of a large 24-classroom school with living quarters on Yee On Street. Within two years, all formalities with the Hong Kong Government, the Education Department, the Crown Land, the designers and the contractors were completed, thus Krumplemann founded St John the Baptist School (morning session of the school became St John the Baptist Catholic Primary School in Kowloon Bay) together with Reilly in Kwun Tong.\nShortly before the present building of St John the Baptist Church at the junction of Yee On Street and Tung Ming Street was completed, the chapel in Orchid House was temporarily moved to 1/F of Hing Tat Mansion, 336-351 Yee On Street.\nSt John the Baptist Parish initially covered all of Kwun Tong, and was subdivided into three parishes in 1967. Both the parish and the school were established to meet demands caused by the rapid population growth of Kwun Tong in the 1950s and 1960s.\nLater service in Hong Kong\nKai Liu is a resettlement estate in Kwun Tong in Kowloon, Hong Kong about fifteen-minute walk from St John the Baptist School, The Maryknoll Fathers negotiated with the government for the entire ground floor and two wings of Block 18 and launched various programmes immediately. Krumpelmann, assembled and built a huge bread baking unit, that he had obtained from an aircraft carrier about to be scrapped. Krumpelmann also built a complicated noodle making machine. Thousands of people weekly received bread and noodles. A clinic, well equipped with a mountain of medicine obtained by Krumpelmann was opened and managed with superior efficiency.  A sewing, tailoring and dress-making school with sewing machines was opened to hundreds of eager female youngsters.  Fashion shows were staged long before the modern trend in leading hotels. Relief programmes were carried out with regularity and order. A large nursery for children of working parents was equipped, opened and managed by the Maryknoll Sisters who were working with zealous cooperation in all parochial welfare and educational programmes. The Maryknoll Sisters also opened in schools in Kai Liu, called Holy Spirit School and Our Lady of China Primary School. Kai Liu has been re-developed and is today called Tsui Ping Estate.\nBetween 1966 and 1975, Krumpelmann worked as Auxiliary Chaplain in the ''Servicemen's Guides' Association'', an organisation which supported United States Navy servicemen in Hong Kong founded by George Gilligan and a committee of American businessmen in Fenwick Street Pier, Wanchai, Hong Kong in 1953. In a report he wrote to the Stanley House, headquarters of Maryknoll in Hong Kong, he reported that since 1965, 2488 American Navy ships had come to Hong Kong carrying well over a million servicemen. He had offered more than 1,000 Sunday Masses on the ships. Krumpelmann became the last Maryknoll Father to serve the pier when he died in 1975; since then, an Irish Jesuit in Hong Kong has taken over.\nDeath\nIn early 1975, Krumpelmann suffered from a blood clot in his left lung and returned to the U.S. on March 31. His condition improved in the following two months, but deteriorated suddenly in late June. He died shortly after his admission to Hennepin General Hospital (now Hennepin County Medical Center) in Minneapolis on June 23. Krumpelmann's body was transported to the Maryknoll headquarters in New York, and was buried in the Maryknoll Cemetery on June 26, 1975.\nAccording to the Maryknoll Hong Kong Chronicle that in November 1975, \"the fruits of Fr Krumpelmann's efforts before his death, 62 tons of medical supplies, arrived on the USS Niagara Falls with the cooperation of Operation Hanclasp. The supplies were handed over to the St. Paul's Hospital Sisters in a simple ceremony on board the ship, with officials from the American Consulate and the US Navy present.\"\nReferences\nExternal links\n* [https://web.archive.org/web/20111004194531/http://www.saintjosephscollege.ws/In_Memoriam/In_Memoriam_Krumpelmann.html  In Memoriam of Fr. Edward Leo Krumpelmann, M.M. St Joseph’s College Website]\n* [http://archives.catholic.org.hk/In%20Memoriam/Clergy-Brother/EL-Krumpelmann.htm Fr Edward Leo Krumpelmann, M.M. RIP]\n* [http://digitallibrary.usc.edu/search/controller/view/impa-m63015.html?x=1307528908785 Maryknoll Priest with two Kongmoon Sisters, Jiangmen, China, ca. 1946  from USC Digital Library Website]\n* [https://archive.today/20121218234642/http://www.catholic.org.hk/v2/cath_db/search.php?id=1632 St John the Baptist Parish]"
    }
  ]
}