{
  "content": [
    {
      "type": "text",
      "text": "# Edward Lowe Martin\n\n| birth_place    = Maysville, Kentucky, U.S.\n| death_date     =\n| death_place    = Excelsior Springs, Missouri, U.S.\n| resting_place  = Elmwood CemeteryKansas City, Missouri, U.S.\n| party          = Democratic\n| spouse         = Mary Elizabeth Ricketts Martin\n| children       = Lulu M. Martin GainesEdward P. Martin\n| signature      = Signature of Edward Lowe Martin (1842–1912).png\n}}\nEdward Lowe Martin (March 12, 1842 – December 15, 1912) was an American politician who served as the Mayor of Kansas City, Missouri. The town of Martin City was named in honor of him; and would eventually be incorporated into and become a neighborhood of Kansas City in 1963.\nEarly life and education\nEdward Lowe Martin was born in Maysville, Kentucky, on March 12, 1842, to parents William Martin and Margaret Sheridan Martin. Edward's parents emigrated to Kentucky from Belfast, Ireland in 1822. Edward was educated in private schools in Kentucky until age 16, when he began working in the field of business.\nBusiness career\nEdward Martin began his business career at age 16 as a shipping clerk for a wholesale grocery house. When the Civil War broke out in 1861, Martin was placed in charge of the business when the owner was jailed as a Confederate sympathizer. Martin liquidated the business and returned the proceeds to the family of the owner. Martin's next occupation was that of head bookkeeper at the largest hardware store in his region of Kentucky. He remained in that position until 1864, when he resigned and moved to a similar position at a large wholesale grocery company in Cincinnati, Ohio. After a year, Martin became a partner in the business and remained there until 1868.\nIn 1868 Martin moved to Kansas City, Missouri, where he was the head of the E. L. Martin & Company wholesale liquor business and organized the Kansas City Distilling Company.\nPublic service\nHe became mayor of Kansas City, Missouri, in 1873. Martin was also active in the Board of Education in which he served from 1875 to 1896.\nPersonal life\nEdward Lowe Martin died in Excelsior Springs, Missouri on December 15, 1912. He was buried in Elmwood Cemetery in Kansas City.\nReferences\nExternal links\n* [http://politicalgraveyard.com/bio/martin3.html The Political Graveyard: Index to Politicians: Martin, E to F]"
    }
  ]
}