{
  "content": [
    {
      "type": "text",
      "text": "# Edward Owen Greening\n\n| birth_place        = Warrington, Lancashire, England\n| death_date         =\n| death_place        = Lee, London, England\n| movement           = Co-operative\n| spouse             =\n}}\nEdward Owen Greening (17 August 1836 &ndash; 5 March 1923) was a British co-operative and radical activist.\nBorn in Warrington, Greening grew up in Bedford, Lancashire and then Manchester, as his father's wire-drawing business moved location.  He was educated at a Quaker school on Mount Street in Manchester, but left when he was thirteen years old, to become an apprentice wire-drawer.  Three years later, he was promoted to an office position, and he began taking evening classes.  Greening's father emigrated to Canada in 1855, and Greening took the opportunity to start his own wire-drawing business with a brother.  This proved successful.\nFrom an early age, Greening became involved in local radical causes, including the Anti-Slavery Society, the United Kingdom Alliance, and the Union and Emancipation Society.  In particular, he became joint honorary secretary of the last of these, and lectured around the country in support of its aim, supporting the north in the American Civil War.  He was a founder of the Manchester and Salford Manhood Suffrage League - the local section of the Reform League - and also became interested in co-operation, beginning to incorporate the ideas into his own business.  He also helped fund a significant number of co-operative ventures, most of which proved unsuccessful.  The key exception was the Agricultural and Horticultural Association, also known as the \"One and All Association\", which provided agricultural tools, seeds, and related items.\nIn 1867, Greening became the founder and editor of Industrial Partnership Record, which the following year became Social Economist, Greening then sharing editing duties with G. J. Holyoake.  That year, he also organised a national conference of co-operative activists, in Manchester, the immediate predecessor of the modern Co-operative Congress.\nGreening stood in Halifax at the 1868 UK general election, with the backing of a local committee of radical workers.  Although he did not receive the backing of the Reform League, its local branch did support his candidacy.  However, he was easily defeated by two official Liberal Party candidates.\nLater in 1868, Greening moved to London, to become managing director of the One and All.  His wire-drawing business collapsed in 1870, and he thereafter remained focused on his co-operative interests.  He founded the Co-operative Institute and the annual National Co-operative Festival.  He was a founder of the International Co-operative Alliance, chairing its first conference, and was its secretary from 1895 until 1902.  He was also a founder of the Co-operative Productive Federation, and the Labour Association.\nThe One and All closed in 1915, its business affected by World War I, and this left Greening short of money.  Co-operative societies twice organised testimonial funds for him, and he remained active in the movement.  In 1917, he moved the motion opposing the formation of the Co-operative Party, as he believed that the movement should be represented through existing political parties. By the autumn of 1917 he had changed his mind and at the party's emergency conference he said that \"after the great vote at Swansea he recognised that it was necessary that the experiment should be made in direct representation\".\nGreening married twice, the first in 1860 to Emily Hepworth. Greening died at his home in Lee, London on 5 March 1923 and was buried in Hither Green Cemetery.\nReferences"
    }
  ]
}