{
  "content": [
    {
      "type": "text",
      "text": "# Edward Ravenscroft\n\nEdward Ravenscroft ( – 1707) was an English dramatist who belonged to an ancient Flintshire family. He was entered at the Middle Temple, but devoted his attention mainly to literature.\nRavenscroft was the first critic to posit that Shakespeare's play Titus Andronicus was not originally written by him. In 1686, he revived the play at the Drury Lane Theatre, which he entitled Titus Andronicus, or the rape of Lavinia. He wrote in the address \"to the Reader\", \"I have been told by some anciently conversant with the Stage, that it was not Originally his (Shakespeare's), but brought by a private Author to be Acted and he only gave some Master-touches to one or two of the Principal Parts or Characters; this I am apt to believe, because 'tis the most incorrect and indigested piece in all his Works, It seems rather a heap of Rubbish then a Structure.\" This position is now known as the \"Ravenscroft tradition\" within literary circles.\nHe wrote a total of twelve plays, in which he adapted freely from Molière, William Shakespeare and others. He ventured to decry the heroic drama, and John Dryden retaliated by satirizing his Mamamouchi, a foolish adaptation from Molière's Bourgeois Gentilhomme and Monsieur de Pourceaugnac, in the prologue to the Assignation (Dryden, Works, ed. Scott, iv. 345 seq.)\nWorks\nAmong his pieces are:\n* The Citizen Turned Gentleman (Dorset Garden, 1671, pr. 1675)\n*The Careless Lovers (Dorset Garden, 1673, pr. 1673), a comedy of intrigue\n* The Wrangling Lovers (Dorset Garden, 1676)\n*Scaramouch a Philosopher, Harlequin a Schoolboy, Bravo a Merchant and Magician (Theatre Royal, 1677)\n* King Edgar and Alfreda (Theatre Royal, 1677)\n*English Lawyer (Theatre Royal, 1678), an adaptation of George Ruggle's Latin play of Ignoramus, presented before James I at Cambridge in March 1615;\n*The London Cuckolds (Dorset Garden, 1681, pr. 1683), which became a stock piece, but was struck out of the repertory by David Garrick in 1751\n* Dame Dobson (1683)\n*Titus Andronicus, or, The rape of Lavinia acted at the Theatre Royall: a tragedy, alter'd from Mr. Shakespears works / by Mr. Edw. Ravens croft. 1686.\n* The Canterbury Guests (Drury Lane, 1694)\n*The Italian Husband (Lincoln's Inn Fields, 1697).\nReferences\nExternal links"
    }
  ]
}