{
  "content": [
    {
      "type": "text",
      "text": "# Edward Lloyd (coffee house owner)__disambig_1\n\nEdward Lloyd ( 1648&nbsp;– 15 February 1713) was the owner of an eponymous coffee house, a publisher and the origin of the names Lloyd's of London and the ''Lloyd's List''.\nLittle is known about Lloyd's early life until he opened his coffee house near the Port of London in 1685–1687. It became a favoured location of merchants, ship owners and sailors and Lloyd provided them with information about ship and cargo movements, maritime losses and market prices. In 1691 Lloyd moved the coffee house to the larger premises on the corner of Lombard Street, in the centre of London's business and finance district. It continued to attract business people, particularly in shipping, and he introduced two short-lived news-sheets—''Lloyd's News'' and one with the running title \"Ships arrived at, and departed from several ports of England\".\nIn Britain, Lloyd was a churchwarden and a constable and questman, an early form of community policeman; abroad he was sufficiently well known in shipping circles that his name was used as a reference in the West Indies and the ports of the Hanseatic League. On his death he bequeathed his coffee house to his daughter, who had recently married the head waiter. Lloyd's name was used when a subsequent owner launched ''Lloyd's List'' in 1734, providing shipping news;  the publication is still being produced. Lloyd's name was also used when the businessman John Julius Angerstein opened a more formal institution for trading, naming it New Lloyd's; this body grew to become Lloyd's of London.\nBiography\n| image2    = The London Gazette 25 June 1688.jpg\n| alt2      = Advertisement for information about a runaway slave\n| caption2  = From 25 June 1688\n| image3    = The London Gazette 26 August 1689.jpg\n| alt3      = Advertisement for information about a lost notebook\n| caption3  = From 26 August 1689\n}}\nLittle is known about Edward Lloyd's early life or his origins, although the writer Sydney Brooks states that he was Welsh and Lloyd's of London—the insurance organisation that still carries his name—states that he originated in Canterbury, Kent. From later records his date of birth has been placed to  1648.}} It is thought his father was with the Worshipful Company of Framework Knitters—the livery company involved with the hosiery and knitting industry—as was Lloyd. The writers Raymond Flower and Michael Wynn-Jones observe \"it is generally believed that he did not serve his apprenticeship in this craft\".\nBy September 1680 Lloyd was living with his wife, Abigail, in Red Cross Alley in the parish of All Hallows Barking in the City of London, near the Tower of London. Their infant son was buried in the local church that month.}} He was one of nine children born to the couple, although only four daughters, survived to adulthood. The Lloyds lived in All Hallows Barking until at least December 1681; by September 1682 they were living in the nearby parish of St Dunstan-in-the-East.\nBetween March 1685 and March 1687 Lloyd opened his coffee house in Great Tower Street in the City of London. It is not known if he took over an existing outlet or opened a new venue; it is also not known if he had any experience in running a coffee-house. The venue was close to the Pool of London, an integral part of the Port of London; Lloyd's clientele included merchants, ship owners and sailors and he supplied them with relevant information about ship and cargo movements, maritime losses and market prices. He kept a corner of his coffee house for the use of captains only.\nThe first written reference to Lloyd's coffee house appeared in The London Gazette on 21 February 1688: an advertisement for information about five stolen watches could be left at the outlet, with a reward of one guinea. According to calculations based on the Consumer Price Index measure of inflation, 1 guinea in 1688 is approximately £ in , according to calculations based on Consumer Price Index measure of inflation.}} Other advertisements naming the coffee-house were also posted in the Gazette. In June that year, one was placed for news of \"one Obdilah, alias Abraham, a Moor, swarthy complexion, short frizzled black hair, a gold ring in his ear\", who had run away from his master; one guinea was offered as a reward for his return. In August the following year there was an advertisement for a lost notebook and a request it be handed in to Lloyd's coffee-house.\nIn 1691 Lloyd moved the coffee house to a larger premises on the corner of Lombard Street, where it had a single frontage, and Abchurch Lane, where it had a double front of about . Lombard Street had been central to London's business and finance district since the medieval period. The coffee house included what was described as a \"pulpit\" from which Lloyd or his staff would make announcements or read the news; auctions also took place from the pulpit, often by candle.}} Within a year of moving to the new premises, the coffee house was prosperous enough for Lloyd to employ two men and three maids to staff it.\nBy January 1692 he was producing a weekly news-sheet, the running title of which was \"Ships arrived at, and departed from several ports of England, as I have account of them in London&nbsp;... [and] an account of what English shipping and foreign ships for England, I hear of in foreign ports\". This was published on Saturdays until September 1699, when publication moved to Fridays; it ran until at least March 1704. In 1696 Lloyd began publishing ''Lloyd's News'' which recorded shipping movements; the news-sheet ran between September 1696 and 1698. It came to an end because of inaccurate reporting of debates in the House of Lords, which was considered at the time as a breach of parliamentary privilege.\nBy 1700 Lloyd's business was well-known enough to be mentioned in \"The Wealthy Shopkeeper and Charitable Citizen\", a piece of doggerel about the daily activity of the eponymous subject:\n:Then to Lloyd's Coffee House he never fails\n:To read the letters and attend the sales.\nThe coffee house was also referenced in The Tatler in 1710 and The Spectator in 1711. Lloyd's name was also used as a mark of trust outside Britain: over three months of 1703 it was used fifteen times by Germans travelling to the ports of the Hanseatic League and Englishmen travelling to the West Indies as reference for their credentials.\nPersonal life\nLloyd was a churchwarden and a constable and questman, an early form of community policeman. In 1698 his wife Abigail died; he then married Elizabeth Mashbourne the same year. She died in October 1712 and Lloyd was married a month later to Martha Denham. He made a new will in January 1713 in which he described himself as \"weak in body though of sound and disposing mind and memory\".\nLloyd died in London on 15 February 1713; his death was announced in the Flying Post news-sheet as \"Died Mr Lloyd the coffee man in Lombard Street\". He was buried at St Mary Woolnoth church in the City of London. A plaque to him was installed in the church in 1931.\nLegacy\n, London, marking the location of Lloyd's coffee house]]\nIn January 1713 Lloyd's youngest daughter, Handy, married William Newton, who was the head waiter at the coffee house.}} Lloyd left the couple the coffee house in his will. Newton died within a year of taking over the coffee house; Handy was married to Samuel Sheppard and the couple continued to run the outlet.\nSheppard was succeeded as the owner of Lloyds by Thomas Jemson in 1727. In 1734 he launched ''Lloyd's List'', providing shipping news.  the publication is still being produced, although it has only been available online since 2013. Also originating from the coffee house was the Lloyd's Register after a committee called the Register Society was formed by the coffee-house's clientele in 1760.\nMerchants and underwriters continued to use Lloyds as a place of business until 1769 when the businessman John Julius Angerstein opened a more formal institution for trading, naming it New Lloyd's; its headquarters was in Pope's Head Alley, off Cornhill in the City of London. It was from this body that Lloyd's of London grew.\nNotes and references\nNotes\nReferences\nSources\nBooks\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\nJournals, news and magazines\n*\n*\n*\n* }}\nWebsites\n*\n* }}\n* }}\n* }}\n* }}\n* }}\n* }}\n* }}\n*"
    }
  ]
}