{
  "content": [
    {
      "type": "text",
      "text": "# Edward George Broadrick\n\nEdward George Broadrick (29 July 1864 – July 1929) was a British colonial administrator who served in British Malaya.\nEarly life\nBroadrick was born on 29 July 1864 in Plymouth, and was educated at Sherborne School.\nCareer\nBroadrick began his career in the civil service as a clerk in the H.M.Office of Works. In 1887, he was appointed cadet in the Straits Settlements, and after passing the civil service examination in 1889 was appointed acting District Officer at Nibong Tebal. In 1895, he was acting Second Magistrate, Penang, combining the role with that of Second Protector of Immigrants, and two years later he was appointed District Officer, Dindings.\nFrom 1897 to 1902, he served in Malacca as the officer in charge of the Treasury, as Municipal Commissioner, and Collector of Land Revenue followed by two years as Senior District Officer, Province Wellesley. In 1904, he went to Singapore where he became President of the Municipal Commission, and Colonial Treasurer, before being appointed Postmaster General, Assistant Colonial Secretary and First Magistrate.\nIn 1911, he left Singapore for Selangor where he was appointed acting Secretary to the British Resident. The same year he served as acting British Resident before he was promoted to British Resident, Selangor, in 1912, occupying the position until his retirement in 1919.\nPersonal life and death\nBroadrick came from a traditional military family. His father was a colonel in the Royal Artillery, and his great-grandfather commanded the Royal Engineers in the Peninsula War. He continued the tradition by joining the Singapore Volunteer Rifles in 1888, and rose up the ranks becoming Lieut. Colonel and first-in-command in 1906. He was a keen cricketer and President of the Selangor Cricket Club.\nIn 1896, he married Edith Carey. He retired in 1919, and died in London in July 1926, aged 65. Broadrick Road in Kuala Lumpur was named after him.\nReferences"
    }
  ]
}