{
  "content": [
    {
      "type": "text",
      "text": "# Edward Caruana Dingli (artist)\n\nEdward Caruana Dingli (10 August 1876 – 9 May 1950) was a Maltese painter.\nBiography\nEdward Caruana Dingli was born on 10 August 1876 in Valletta to Raphael Caruana Dingli and Martha née Garroni. He followed his father in embarking on a career in the civil service, where he was commissioned to the Royal Malta Regiment of Militia, and later he transferred to the Royal Malta Artillery. He left military service in 1913 and became a full-time artist at the age of 37. He married Charlotte Marietta Giovanna Falzon for thirteen years, with whom he had two children, when he was 24. Following his separation from Falzon in 1913, he had a reputedly scandalous relationship with Olga Galea Naudi née Barbora, a long time acquaintance of Caruana Dingli and wife of an ex-military man Carlo Galea Naudi. He would go on to paint various portraits of Olga throughout his career.\nDue to being born into an artistic family and being well connected with the Maltese elite as well as British government in Malta, Caruana Dingli found work as an artist through his family connections with the art scene in Malta as well as the political class of the country. He was the director of the Government School of Arts in Malta between 1919 and 1947. A number of his students later became notable Maltese artists, including Willie Apap, Anton Inglott, Emvin Cremona and Esprit Barthet.\nEdward Caruana Dingli is brother to Robert Caruana Dingli and great-uncle to Debbie Caruana Dingli, both of whom are notable Maltese painters.\nArtistic work\nCaruana Dingli's work incorporates portrait paintings in oil where his main subjects were prominent Maltese figures such as politicians, clerics and prelates. On the other hand, Caruana Dingli also painted folkloristic watercolour and gouaches paintings depicting Maltese landscape, countrysides and local street scenes with merchant sellers, farmers and children playing traditional Maltese games. Giuseppe Calì, who was Caruana Dingli's mentor and close friend, encouraged Caruana Dingli to focus his work on realism whilst holding a romantic idealism.\nHis work may be found in a number of collections such as the Casino Maltese, the National Museum of Fine Arts (nowadays known as MUŻA) at Auberge d'Italie, and the Museum of the Order of St John. He also designed the label for the first Maltese beer label in 1928, the Farsons Pale Ale.\nReferences\nExternal links\n#[http://belgraviaauctions.com/uncategorised/edward-caruana-dingli-1876-1950/ Selection of paintings by Edward Caruana Dingli - Belgravia Auction Gallery]\n#[https://books.google.com/books?id=wHmoSgAACAAJ Edward Caruana Dingli (1876-1950): Portraits, Views and Folkloristics Scenes - Google Books]"
    }
  ]
}