{
  "content": [
    {
      "type": "text",
      "text": "# Edward Raymond Neaher\n\n| birth_place   = Brooklyn, New York\n| death_date    =\n| death_place   = Chevy Chase, Maryland\n| death_cause   =\n| resting_place =\n| resting_place_coordinates =\n| citizenship   =\n| nationality   =\n| party         =\n| otherparty    =\n| height        =\n| spouse        =\n| partner       =\n| relations     =\n| children      =\n| parents       =\n| mother        =\n| father        =\n| relatives     =\n| residence     =\n| education     = Fordham University School of Law (LL.B.)\n| alma_mater    =\n| occupation    =\n| profession    =\n| known_for     =\n| salary        =\n| net_worth     =\n| cabinet       =\n| committees    =\n| portfolio     =\n| religion      =\n| awards        =\n| signature     =\n| signature_alt =\n| website       =\n| footnotes     =\n}}\nEdward Raymond Neaher (May 2, 1912 – April 19, 1994) was a United States district judge of the United States District Court for the Eastern District of New York.\nNeaher was nominated by President Richard M. Nixon on June 14, 1971, to a seat vacated by Joseph C. Zavatt. He was confirmed by the United States Senate on July 22, 1971, and received commission the same day. Assumed senior status on May 28, 1982. Neaher's service was terminated on April 19, 1994, due to death.\nEducation and career\nBorn in Brooklyn, New York, Neaher received an Artium Baccalaureus degree from the University of Notre Dame in 1937 and a Bachelor of Laws from Fordham University School of Law in 1943. He was a special agent for the Federal Bureau of Investigation from 1943 to 1945. He was in private practice of law in New York City from 1945 to 1969. He was a member of the Board of Directors of the New York City Legal Aid Society from 1967 to 1969. He was United States Attorney for the Eastern District of New York from 1969 to 1971.\nFederal judicial service\nNeaher was nominated by President Richard Nixon on June 14, 1971, to a seat on the United States District Court for the Eastern District of New York vacated by Judge Joseph Carmine Zavatt. He was confirmed by the United States Senate on July 22, 1971, and received his commission the same day. He assumed senior status on May 28, 1982. His service was terminated on April 19, 1994, due to his death in Chevy Chase, Maryland.\nReferences\nSources\n*\n|years=1971–1982}}"
    }
  ]
}