{
  "content": [
    {
      "type": "text",
      "text": "# Edward de Courtenay, 3rd/11th Earl of Devon\n\n, seat of the Earls of Devon]]\nEdward de Courtenay, 3rd/11th Earl of Devon (c.1357 &ndash; 5 December 1419), known by the epithet the \"Blind Earl\", was the son of Sir Edward de Courtenay and Emeline Dawnay, and in 1377 succeeded his grandfather, Hugh Courtenay, 10th Earl of Devon, as Earl of Devon. The ordinal number given to the early Courtenay Earls of Devon depends on whether the earldom is deemed a new creation by the letters patent granted 22 February 1334/5 or whether it is deemed a restitution of the old dignity of the de Redvers family. Authorities differ in their opinions, and thus alternative ordinal numbers exist, given here.\nFamily\nEdward Courtenay, born about 1357, was the elder of two sons of Sir Edward de Courtenay (d. between 2 February 1368 and 1 April 1371) and Emeline or Emme Dawnay (c.1329 &ndash; 28 February 1371), daughter and heiress of Sir John Dawney (d.1346/7) by Sybil Treverbyn. He succeeded to the earldom at the age of 20 at the death of his grandfather, Hugh Courtenay, 10th Earl of Devon, on 2 May 1377.\nCourtenay had a younger brother, Sir Hugh Courtenay of Haccombe and Bampton (after 1358 &ndash; 5 or 6 March 1425), who married successively Elizabeth Fitzpayn, Elizabeth Cogan, Philippa Arcedekne, and Maud Beaumont.\nCareer\nSir John Dawney (d.1346/7) is said to have held 'fifteen large manors in Cornwall' which came to the Courtenay family through Edward Courtenay's marriage to Emeline Dawney. In 1378 Courtenay proved his age, and had livery of the lands of his mother and his grandfather, the 10th Earl.\nLike his ancestors, Courtenay was a soldier. He served in the Scottish wars and after some success was knighted in 1380 by the Earl of Buckingham. The following year King Richard II sent Courtenay as an emissary to escort his Queen Anne of Bohemia from Gravelines harbour to London for her marriage. In 1383 he was appointed Admiral of the West, responsible for policing the seas off the coasts of Devon and Cornwall; his brother Sir Hugh Courtenay was a famed pirate. The Council believed that the Earl should protect the River Exe as French pirates had attempted several incursions into the Devonshire interior. Edward however was more of a soldier and relinquished his naval post. He was appointed to the King's Council which in 1395 attended Richard II in Westminster Hall. By 1400, the Earl was blind. He had probably contracted a disease such as leprosy or erysipelas which attacked the retina in his eyes.\nCourtenay died on 5 December 1419, directing in his will that he be buried at Forde Abbey. A 'magnificent monument' at Tiverton Castle, said to be his and destroyed about the end of the 16th century, bore the following inscription, according to Thomas Risdon's Survey of Devon (1630):\nHo, ho who lies here?\nI, the good Earle of Devonshire,\nAnd Mauld my wife that was full deare,\nWe lived together LV yeare.\nThat we spent we had:\nThat we gave we have:\nThat we left we lost.''\nHowever, as Cokayne points out, this inscription is 'certainly far from contemporary' with the 11th Earl's death.\nMarriage and children\nElizabethCourtenayEffigyPorlock.jpg|Alabaster effigy of Elizabeth Courtenay (d.1471) in St Dubricius Church, Porlock, Somerset\nHaringtonEffigiesPorlock.jpg|Drawing from 1890 of effigies in Church of St Dubricius, Porlock, of John Harington, 4th Baron Harington (d.1418) and his wife Elizabeth Courtenay (d.1471), daughter of Edward de Courtenay, 3rd Earl of Devon (d.1419)\nCourtenayHeraldicBoarPorlock.jpg|A boar, which animals were used as heraldic supporters by the Courtenay Earls of Devon, serves as the footrest to the effigy of Elizabeth Courtenay at Porlock Church\nCourtenay married Maud Camoys, the daughter of Sir John de Camoys of Gressenhall, Norfolk by his second wife, Elizabeth le Latimer, the daughter of William le Latimer, 3rd Baron Latimer. They had three sons, and a daughter:\n*Sir Edward de Courtenay (c.1385 – 1418), who married, before 20 November 1409, Eleanor Mortimer, second daughter of Roger Mortimer, 4th Earl of March by Eleanor Holland, daughter of Thomas Holland, 2nd Earl of Kent. They had no children.\n* Hugh de Courtenay, 12th Earl of Devon (1389 – 16 June 1422), who married Anne Talbot, daughter of Richard Talbot, 4th Baron Talbot (d. 8 or 9 September 1396), by Ankaret (d. 1 June 1413), daughter of John Le Strange, 4th Baron Strange of Blackmere. Anne Talbot was the sister of John Talbot, 1st Earl of Shrewsbury (c.1392 – 17 July 1453), whom Thomas Nashe termed 'brave Talbot, the terror of the French'.\n* James Courtenay, who died childless.\n* Elizabeth Courtenay, who married John, 4th Lord Harington in 1411. After his death, 11 April 1418, she remarried to William Bonville, 1st Baron Bonville (1392–1461), a childless marriage. She died on 28 October 1471.\nFootnotes\nReferences\n*M. Cherry, 'The Crown and the Political Community in Devonshire, 1377-1461' (Unpublished PhD Thesis, University of Wales, Swansea, 1981).\n*M. Cherry, \"The Disintegration of a Dominant Medieval Affinity: the Courtenay family\", in: Southern History; 1979 & 1986.\n*\n*\n*\n}}\n* }}"
    }
  ]
}