{
  "content": [
    {
      "type": "text",
      "text": "# Edward Hulton (senior)\n\n| birth_name  =\n| birth_date  =\n| birth_place = Manchester, England\n| death_date  =\n| death_place = Bucklow, Cheshire, England\n| nationality = British\n| other_names =\n| occupation  = Newspaper proprietor\n| spouse      = Mary Mosley\n| relatives   = Sir Edward Hulton, 1st Baronet (son)Margaret, Lady Strickland (daughter)Sir Edward George Warris Hulton (grandson)Sir Jocelyn Stevens (great-grandson)Poppy Delevingne (great-great-great-granddaughter)Cara Delevingne (great-great-great-granddaughter)\n| known_for   =\n}}\nEdward Hulton (1838–1904) was a British newspaper proprietor in Victorian Manchester. Born the son of a weaver, he was an entrepreneur who established a vast newspaper empire and was the progenitor of a publishing dynasty.\nEarly life and publishing business\n}}\nentertainment complex in Manchester at the revamped Withy Grove site of Hulton's business premises]]\nHulton was born in Manchester on 16 July 1838, the son of a weaver.\nWhile working as a compositor for The Manchester Guardian (now known as The Guardian), he earned extra income publishing the Sporting Bell, a popular local horse racing tip sheet, under a pseudonym named after Kettledrum, the 1861 Epsom Derby winner.\nThe Sporting Bell ultimately grew into the Sporting Chronicle newspaper Hulton founded in 1871 with financial backing from Edward Overall Bleackley (1831–1898), a local cotton merchant. Sales were boosted by the decision of several local newspapers including The Manchester Guardian to restrict racing coverage to appease the growing anti-gambling sentiment in society. The Sporting Chronicle, a broadsheet which specialised in horse racing and published starting price odds, became the first major national daily sporting newspaper. Its main competitor was the Sporting Life established in 1859.\nWriting as \"Kettledrum\", Hulton was also the Sporting Chronicle's tipster, and a tipping column was written by others under the same pseudonym until the newspaper closed in 1983. Hulton's publishing business started off in a basement in Spear Street in Manchester city centre. In 1873 premises were established for the expanding business at Withy Grove, the current site of The Printworks entertainment complex.\nIn 1875 Hulton also founded the weekly Athletic News, which covered weekend sports fixtures other than horse racing and supported professional football, and in 1885 he founded the Sunday Chronicle. The newspapers founded by Hulton survived in some form long after his death. In 1931 the Athletic News merged with the Monday edition of the Sporting Chronicle, which ceased publication in 1983. In 1955 the Sunday Chronicle merged with the Empire News, which merged five years later with the News of the World tabloid, which ceased publication in 2011.\nHulton's second son Edward expanded his father's newspaper interests, founding the Manchester Evening Chronicle in 1897, the Daily Dispatch in 1900 and the Daily Sketch tabloid in 1909. Edward sold his publishing business based in London and Manchester, which included a large group of newspapers, for £6 million when he retired in 1923. The newspapers sold included: Sporting Chronicle, Athletic News, Sunday Chronicle, Empire News, Evening Standard, Daily Sketch, Sunday Herald, Daily Dispatch and Manchester Evening Chronicle.\nMarriage and children\nHulton married Mary Mosley in 1859. Through his son Edward (1869–1925), Hulton is the grandfather of magazine publisher Sir Edward George Warris Hulton (1906–1988), and the great-grandfather of magazine publisher and newspaper executive Sir Jocelyn Stevens (1932–2014). Hulton's daughter Theresa married Portuguese baron Sebastião Clemente de Sousa Deiró, 1st Baron of Sousa Deiró (Ponta Delgada, 17 April 1866 – 1916) in 1894. Hulton's fourth daughter, Dame Margaret, DBE (1867–1950), was the second wife of Baron Strickland, 4th Prime Minister of Malta, marrying him in 1926. Together with Strickland's daughter Mabel Edeline Strickland from his first marriage, the couple founded The Times of Malta.\nDeath\nHulton died in 1904 at the age of 65 in Bucklow, Cheshire, and is buried in Sale Brooklands Cemetery in Sale, Greater Manchester. The net value of his estate was £509,000.\nSee also\n*Media coverage of horseracing in Great Britain\n*Media in Manchester\nReferences"
    }
  ]
}