{
  "content": [
    {
      "type": "text",
      "text": "# Edward Burton Gleeson\n\nEdward Burton Gleeson (1803 – 2 February 1870), also known as \"Paddy\" Gleeson, was a South Australian settler, farmer and founder of the town of Clare, which he named for the county of his birth.\nHistory\nGleeson arrived in South Australia on 27 July 1838 with his wife Harriet Gleeson née Llewelyn (c. 1799 – 6 June 1896) on board the Emerald Isle from India.  He became involved in pastoral activities in Adelaide and settled east of the city in what is now the suburb of Beaumont.  He established a property which he named Gleeville near the current Dashwood Road – Sunnyside Road junction, and also took up pastoral runs north of Adelaide, near the Wakefield River.  In 1840, he established the Inchiquin run in the Clare Valley area, and in 1842 laid out a plan for a town.  This would have a number of different names, but from 1846 would eventually be called Clare, after Gleeson's home county in Ireland.\nGleeson became insolvent on 30 July 1846 and as a result, sold Gleeville to Samuel Davenport and moved all his farming interests to the Clare Valley.  Inchiquin then became his main property and business concern.  He was well liked by members of the community and eventually earned the informal title the King of Clare.\nThroughout the rest of his life, he had a variety of interests in the area, including being the town's first mayor and a special magistrate for the region.  He died at Inchiquin in 1870, leaving six children.\nHampton Carroll Gleeson, MHA for Flinders, was a nephew.\nFamily\nEdward Burton Gleeson married Harriet Llewellyn (died 1896). Their family included:\n*eldest daughter Fanny Eliza Gleeson ( – 19 September 1913) married Jonathan Filgate (c. 1821 – 6 April 1866) on 6 December 1854. Filgate was proprietor of Clare Brewery.\n*John William Gleeson (1834 – 13 November 1895) married Christina Alston  (c. 1832 – 18 April 1900) on 4 July 1859. He was a successful horse breeder and auctioneer until injured in shooting accident. He drowned on his own property.\n*Edward Gleeson ( – 1853) died in riding accident\n*Sarah Ann \"Annie\" Gleeson (1840 – 20 November 1928) married George Hamilton Ayliffe (25 May 1840 – 2 November 1906) on 26 February 1864\nHis brother John Hampton Gleeson, and his wife née Carroll (died 1896) also emigrated aboard the Emerald Isle, with their son Hampton Carroll Gleeson and daughter Harriet Gleeson (died 1882). Another passenger was one Robert Gleeson.\nReferences"
    }
  ]
}