{
  "content": [
    {
      "type": "text",
      "text": "# Edward Samuel Ritchie\n\n| birth_place        = Dorchester, Boston\n| death_date         =\n}}\nEdward Samuel Ritchie (1814–1895), an American inventor and physicist, is considered to be the most innovative instrument maker in nineteenth-century America, making important contributions to both science and navigation.\nEarly life and career\nRitchie was born in Dorchester, Massachusetts on August 18, 1814, the son of John and Elizabeth Eliot Ritchie. As a young child Ritchie displayed a great aptitude for both arts and mechanical sciences. After working as an amateur sculptor, he founded a business in 1850 with N.B. Chamberlain to manufacture mechanical and electrical instruments. Chamberlain eventually left, and Ritchie continued the business alone.\nInventions and Innovations\nIn the early 1850s, after examining an example of an electric induction coil made by German instrument maker Heinrich Daniel Ruhmkorff, which produced a small two-inch (50&nbsp;mm) electric spark when energized, Ritchie perceived that it could be made more efficient and produce a longer spark by redesigning and improving its secondary insulation. His own design divided the coil into sections, each properly insulated from each other. Ritchie's first induction coil produced a spark 10 inches (25&nbsp;cm) in length; a later perfected model produced a bolt two feet (60&nbsp;cm) or longer in length.\nIn 1857, one of Ritchie's induction coils was exhibited in Dublin, Ireland at a conference of the British Association for the Advancement of Science, and later at the University of Edinburgh in Scotland. Intrigued, Ruhmkorff himself procured a sample of the Ritchie induction coil and used it as a basis for revising his own design. The German inventor was later awarded a scientific prize by Napoleon III. Disappointed in not receiving recognition for his improvements, Ritchie turned his attention to navigational instruments.\nRitchie began making marine bearing compasses for the U.S. Navy before the American Civil War (→  Union Navy). At the time, British Admiralty dry-mount nautical compasses were considered by all navies and merchant shipping companies as the technological standard of the day. Ritchie thought they could be improved upon, and by 1860 had received a U.S. patent for the first successful and practicable liquid-filled marine compass suitable for general use, a development that has been described as the first major advance in compass technology in several hundred years. With the damping provided by the liquid, together with a gimbal mounting, the floating indicator or card of the Ritchie compass remained relatively stable even when a ship's deck pitched and rolled during periods of severe weather. In Ritchie's third patent application (#38,126) dated April 7, 1863, several features that contributed to the success of his compass are revealed, including a floating card of nearly the same specific gravity as the liquid, an air-tight metallic case, and an elastic chamber that served as a diaphragm, compensating for temperature changes and resultant unequal expansion of the liquid and the bowl.\nRitchie liquid-filled nautical compasses soon became a U.S. Navy standard, and were also widely used by American merchant mariners. He also invented an improved theodolite which was immediately adopted by the U.S. Navy for measuring harbors and port entrances.\nThe business he began in 1850 became E. S. Ritchie & Son in 1866 and E. S. Ritchie & Sons in 1867, and moved from Boston to new facilities in Brookline in 1886. The company specialized in manufacturing compasses, astro-navigation devices, and other nautical equipment for all types of ships, including small hand-bearing compasses for recreational and amateur sailing vessels.\nDeath\nFollowing Ritchie’s death in 1895, his sons transferred the scientific instruments to the L. E. Knott Apparatus Co., while retaining the nautical instrument line. The firm was incorporated as E.S. Ritchie & Sons, Inc. in 1939, and continues operations to the present day. It is now located in Pembroke, Massachusetts, and known as Ritchie Navigation.\nMuseum Displays\nA model of Ritchie's first liquid-filled compass in the collections of the Science Museum (London).\nHonors\nRitchie Rock in Antarctica is named after Edward Samuel Ritchie.\nNotes\nReferences\n* American Academy of Arts and Sciences, Proceedings of the American Academy of Arts and Sciences, Vol. XXIII, May 1895 - May 1896, Boston: University Press, John Wilson and Son (1896)\n* Page, Charles G., History of Induction: The American Claim to the Induction Coil and Its Electrostatic Developments, Boston: Harvard University, Intelligencer Printing house (1867)\n* Rogers, W. B. (Prof.), Brief Account of the Construction and Effects of a very Powerful Induction Apparatus, devised by Mr. E.S. Ritchie, of Boston, United States, British Association for the Advancement of Science, Report of the Annual Meeting (1858)\n* Warner, Deborah, Compasses and Coils: The Instrument Business of Edward S. Ritchie, Rittenhouse Vol. 9, No. 1 (1994)"
    }
  ]
}