{
  "content": [
    {
      "type": "text",
      "text": "# Edward Wilfred Taylor\n\n| image              = Edward_Wilfred_Taylor.jpg\n| image_size         =\n| alt                =\n| caption            = Taylor in May 1952 after his admission into the Royal Society.\n| birth_name         =\n| birth_date         =\n| birth_place        = Bootham, York, England\n| death_date         =\n| death_place        =\n| death_cause        =\n| occupation         = Optical instrument manufacturer and researcher\n| awards             =\n| alma_mater         =\n| thesis_year        =\n| discipline         = Optics\n| sub_discipline     =\n| workplaces         =\n}}\nEdward Wilfred Taylor  (29 April 1891–1 November 1980) was a British manufacturer of optical instruments.\nBiography\nTaylor was born on 29 April 1891 at 20 Bootham, York, to parents Charlotte Fernandes Taylor and Harold Dennis Taylor (a designer of optical instruments for Thomas Cooke & Sons). He attended a preparatory school at Orelton, Scarborough, before, at age 14, attending Oundle School. He left school in 1908 to take up an apprenticeship at Thomas Cooke & Sons in York.\nIn 1912 he travelled to the US aboard  to demonstrate rangefinder equipment to the US government.\nAt the outbreak of the First World War, he enlisted in the 21st Battalion Royal Fusiliers and subsequently commissioned to the Sherwood Foresters as a range finding officer. Taylor subsequently served in the Loyal Regiment (North Lancashire) during the Battle of the Somme, where he was wounded. After recovery he was transferred to the Grand Fleet at Scapa Flow and served aboard the . In 1917 he was seconded to the Royal Navy as a lieutenant and attached to HMS President (shore establishment), where he was involved in the equipping of the naval fleet with new searchlights. He was demobilised in April 1919.\nTaylor returned to York and to work at Thomas Cooke & Sons. He married Winifred Mary Hunter in 1921. In 1926 he was appointed optical manager at his firm and was involved in constructing instruments for Leiden University and the Greenwich Observatory. During the Second World War Taylor was involved in designed and producing rangefinder equipment for the allied armies.\nTaylor was an accomplished naturalist and supported nature conservatory throughout his life. He served as President of the Yorkshire Naturalists Union in 1955; his presidential address was titled \"A summary of our knowledge of Yorkshire mammals 1881-1955\". He was a founding member of the Yorkshire Wildlife Trust.\nHe was a member, and subsequently, a Vice-President of the Yorkshire Philosophical Society. Taylor was awarded a CBE in 1946. He was elected as a Fellow of the Royal Society on 20 March 1952, and was also a Fellow of the Royal Microscopical Society.\nSelect publications\n*1921–22. \"The effect of changes of surface curvature at the focus of an astronomical object glass\", Transactions of the Optical Society 23, 241.\n*1930. \"The Tavistock transit theodolite\", Transactions of the Optical Society 32, 45.\n*1940. \"The effects of eccentricity and misplaced indices of divided circles\", Empire Survey Review 5, 466.\n*1950. \"The application of phase contrast to the ultra-violet microscope\", Proceedings of the Royal Society of London B, 137, 322.\n*1955. Theodolite design and construction. York: Cooke, Troughton & Simms Lt.\nReferences"
    }
  ]
}