{
  "content": [
    {
      "type": "text",
      "text": "# Edward Clark Turner\n\n| birth_place      = Buenos Aires, Argentina\n| death_date       =\n| death_place      = Colorado Springs, Colorado, United States\n| buried           =\n| resting_place_coordinates =\n| nationality      = American\n| religion         = Anglican\n| residence        =\n| parents          = Edward Turner & Eva Helen Clark\n| spouse           =\n| children         = 4\n| occupation       =\n| profession       =\n| previous_post    = Coadjutor Bishop of Kansas (1956-1959)\n| education        =\n| alma_mater       = Northwestern University\n| motto            =\n| signature        =\n| signature_alt    =\n| coat_of_arms     =\n| coat_of_arms_alt =\n| module           =\n| module2          =\n| other            =\n}}\nEdward Clark Turner (March 26, 1915June 21, 1997) was a bishop of the Episcopal Diocese of Kansas between 1959 and 1981.\nEarly life and education\nTurner was born on March 26, 1915, in Buenos Aires, Argentina to Edward Turner and Eva Helen Clark. He came to the United States in 1922. He was then educated at the high school in Evanston, Illinois, and then studied at Northwestern University from where he graduated with a Bachelor of Arts in 1937. He also studied at Seabury-Western Theological Seminary and earned a Bachelor of Divinity in 1940 and an honorary Doctor of Divinity in 1954. On November 19, 1938, he married Virginia Hunter and together had four children.\nOrdained ministry\nTurner was ordained deacon on March 16, 1940, by Bishop Frank McElwain of Minnesota and priest on September 19, 1940, by Bishop Edward Makin Cross of Spokane. He was assigned as vicar to the missions of St. John in Okanogan, St. Paul in Omak, Trinity in Oroville and Transfiguration in Twisp, Washington, where he served from 1940 until 1944. He then became rector of the Church of the Ascension and Holy Trinity in Pueblo, Colorado, where he remained until 1956. He simultaneously served as Dean of the Southern Deanery of Colorado and chaplain and administrator of Parkview Episcopal Hospital.\nBishop\nOn February 12, 1956, Turner was elected Coadjutor Bishop of Kansas during a diocesan convention held in Grace Cathedral. He was consecrated in the same cathedral on May 22, 1956, by Goodrich R. Fenner of Kansas. He then succeeded as diocesan bishop in 1959 and remained in office until his retirement on May 22, 1981. Turner and his wife retired to Colorado, where he died in 1997.\nReferences"
    }
  ]
}