{
  "content": [
    {
      "type": "text",
      "text": "# Edward Stafford, 3rd Baron Stafford\n\nEdward Stafford, 3rd Baron Stafford (7 January 1535 – 18 October 1603) was the second surviving son of Henry Stafford, 1st Baron Stafford and Ursula Pole. He was the younger brother of Henry Stafford, 2nd Baron Stafford. He served in Parliament for Stafford and succeeded his brother to the barony in 1566.\nPublic life\nStafford was elected MP for Banbury in 1554. Following his brother Thomas's rebellion, Edward was questioned by the Privy Council on 3 May 1557, but no connection was found. Edward followed his brother Henry Stafford as Member of Parliament for Stafford in 1558 and 1559 and after his ennoblement was summoned to the House of Lords (1573–1593)\nCaus Castle was part of the marriage settlement between the arranged marriage of John Thynne and Joan Hayward. However, Stafford disputed the ownership of the castle and he had to be ejected by force in 1591.\nFrom about 1574, Stafford was patron of a \"Lord Stafford's Company of Players\", who were first recorded appearing in Barnstaple, appearing often in public records for the next twenty-six years. In 1577, whilst appearing in Southampton, it contained at least ten players. The group continued until at least 1617, under the patronage of the 4th Baron. Other groups of entertainers sponsored by Stafford included a group of bearwards (bear keepers), who appeared with the players in 1579 and a company of trumpeters.\nFamily life\nEdward Stafford was the second surviving son of Henry Stafford, 1st Baron Stafford and Ursula Pole. He became the 3rd Baron Stafford on his elder brother Henry's death in 1566.\nHe was descended from the Plantagenets through both his parents:\n* Henry Stafford, 1st Baron Stafford was a direct descendant of Thomas of Woodstock, youngest son of Edward III, through Thomas' daughter Anne of Gloucester and her husband Edmund Stafford, 5th Earl of Stafford.\n* Ursula Pole was the daughter of Margaret Pole, Countess of Salisbury, the daughter of George Duke of Clarence, brother of Edward IV.\nHe married Mary Stanley, daughter of Edward Stanley, 3rd Earl of Derby on 23 November 1566. They had three children:\n#Edward Stafford, 4th Baron Stafford, (1572–1625); married Isabel Forster, a chambermaid\n#Ursula Stafford; married to Walter Erdeswick\n#Dorothy Stafford, (b. bat 1572); married to Gervais of Chadsden\nHe was succeeded by his son Edward.\nReferences"
    }
  ]
}