{
  "content": [
    {
      "type": "text",
      "text": "# Edward I'Anson\n\n'''Edward I'Anson''' (25 July 1812 – 30 January 1888) was an English architect who was president of both the Royal Institute of British Architects and the Surveyors' Institution.  He was a leading designer of commercial buildings in the City of London.\nLife\nBorn in St. Laurence Pountney Hill in the City of London,  he was the  eldest son of  the surveyor and architect Edward P. I'Anson (1775–1853). He was educated at the Merchant Taylors' School  and at the College of Henri IV in France, and articled to his father at an early age. Subsequently, he entered the office of John Wallen, principal quantity surveyor at that time in the City. At the close of his indentures I'Anson travelled for two years, extending his tour as far as Constantinople. On his return in 1837 he entered into practice, both as assistant to his father and as an independent architect.\nIn 1823, the I'Anson family bought 9, St Laurence Pountney Lane, the house neighbouring their own.   The firm of Edward I'Anson and Sons operated from there from 1850. I'Anson made various changes to the property, including a new roof, and some Venetian-inspired windows. He also acquired the adjoining disused churchyard for use as a garden. In 1861, I'Anson and his wife, Catherine Blakeway, purchased land at Grayshott in Surrey, a village then part of Headley. The  family provided a site for the National School established there  in 1871, and maintained a close connection to the area. I'Anson's son Edward Blakeway made funds available for the construction of the church, and many of his family are buried and memorialised in its churchyard.\nWorks\nHis first important building in the City was the Royal Exchange Buildings, designed for Sir Francis Graham Moon in  1837. There he made use of concrete for the internal works, an early example of this modern construction method that had previously  only been used in experimental or minor projects. This brought him into repute, and obtained for him the chief practice as architect in the City.\nI'Anson developed a career as a pioneering designer of purpose-built commercial buildings in the City. Those executed by him in the Italian style, such as the buildings of the British and Foreign Bible Society at 146 Queen Victoria Street (1866–8) were the most successful. His designs in the Neo-Gothic style  included the school of the Merchant Taylors' Company at the Charterhouse. I'Anson was surveyor to the Merchant Taylors for many years, and also to St. Bartholomew's Hospital, for which he designed a new museum and library. He was responsible for the remodelling of Fetcham Park, Leatherhead, and  the restorations of the Dutch Church in Austin Friars and of St. Mary Abchurch.\nI'Anson was elected a fellow of the Royal Institute of British Architects in 1840, and was chosen president in 1886. He contributed numerous papers to the Transactions of the institute. He was also a fellow of the Geological Society, and in 1886 became president of the Surveyors' Institution. He was a frequent traveller on the continent, and in 1867 visited Russia. In many of his numerous duties as surveyor, and in some of his architectural works, notably the new Corn Exchange in Mark Lane, he was assisted by his eldest son, Edward Blakeway I'Anson.\nDeath\nI'Anson died unexpectedly on 30 January 1888, and was buried at All Saints church in Headley, East Hampshire. A portrait of him will be found in the Builder, xxix. 1006. Edward Blakeway I'Anson continued the practice at St Lawrence Pountney Hill.\nReferences\n;Attribution"
    }
  ]
}