{
  "content": [
    {
      "type": "text",
      "text": "# Edward Synge (bishop of Elphin)__disambig_1\n\nEdward Synge}}\nEdward Synge (1691–1762) was an Anglican bishop in the Church of Ireland who was the Bishop of Clonfert and Kilmacduagh (1730–1732), Bishop of Cloyne (1732–1734), Bishop of Ferns and Leighlin (1734–1740) and Bishop of Elphin (1740–1762).\nSynge was born in Cork. His father was Edward Synge, Archbishop of Tuam. His grandfather was Edward Synge, Bishop of Cork, Cloyne and Ross and his brother Nicholas Synge Bishop of Killaloe. He was educated at Trinity College, Dublin, obtaining a Master of Arts degree in 1712 and a Doctorate of Divinity in 1728. He was briefly Provost of Tuam and Chancellor of St Patrick's Cathedral, Dublin, before he was nominated the Bishop of Clonfert and Kilmacduagh on 14 May 1730 and consecrated on 7 June 1730. He was subsequently translated to Cloyne on 22 March 1732, then to Ferns and Leighlin on 8 February 1734, and finally to Elphin on 15 May 1740.\nSynge's musical ability made a strong impression on Handel when the composer was in Dublin; Handel referred to Synge as 'a Nobleman very learned in Musick'. Synge was in attendance at the first performance of Handel's Messiah and his written comments on the performance are quoted in Richard Luckett's ''Handel's Messiah: a celebration'' (1992).\nSynge is particularly well known for his 221 letters to his daughter Alicia (1733-1807), the only survivor out of the six children of the Bishop and his wife Jane Curtis (d. 1737) whom he married in 1720. These are principally taken up with advice to Alicia  whom Mary Delany said was being 'brought up like a princess'. There is almost no aspect of the young girl's life upon which her father did not comment including dress, health, diet, exercise and behaviour in social situations. His principal concern was with her education generally and specifically her ability to write letters well; his advice to her on this score was to copy Swift for grammar and punctuation. These letters also provide valuable insight into domestic life and the lives of servants. The bequest of these letters to Trinity College Library, University of Dublin, by Synge's descendant Marie-Louise Jenner, has revolutionised eighteenth-century Irish social and women's history.\nSynge died in office in 1762. His father having died in office in 1741.\nHis daughter Alicia married Joshua Cooper MP (1732–1800) of Markree Castle in County Sligo. She was said to have a fortune of £50,000.\nReferences\nBibliography\n*\n* Legg, Marie-Louise (ed.), The Synge Letters 1746-1752 (Lilliput Press: Dublin 1996)."
    }
  ]
}