{
  "content": [
    {
      "type": "text",
      "text": "# Edward Grant (cricketer)\n\n| birth_place        = Stockbridge, Hampshire\n| death_date         =\n| death_place        = Bath, Somerset\n| bowling            = Slow\n| role               = Bowler\n| club1              = Somerset\n| year1              = 1899–1901\n| columns            = 1\n| column1            = First-class\n| matches1           = 5\n| runs1              = 66\n| bat avg1           = 11.00\n| 100s/50s1          = 0/0\n| top score1         = 14\n| deliveries1        = 275\n| wickets1           = 4\n| bowl avg1          = 36.00\n| fivefor1           = 0\n| tenfor1            = 0\n| best bowling1      = 2/19\n| catches/stumpings1 = 6/0\n| source             = http://www.espncricinfo.com/england/content/player/13431.html ESPNcricinfo\n| date               = 31 July\n| year               = 2017\n}}\nEdward Grant (16 June 1874 – 12 January 1953) played first-class cricket for Somerset between 1899 and 1901. Grant was a tail-end batsman and a slow bowler. He played first-class matches in each of three seasons from 1899 to 1901, but took only four wickets in all, with a best return of two for 19 against Gloucestershire in 1899. From 1903 to 1912, Grant played Minor Counties cricket regularly for Wiltshire as a lower-order batsman and front-line bowler.\nLife and career\nGrant was born in West Dean on 16 June 1874, on the Wiltshire/Hampshire border, but moved with his family to Bath in childhood. He left school as soon as he could, and followed in his father's footsteps to become a gardener, and then later worked as a waterworks inspector. He played club cricket for the Bath Cricket Club, and impressed enough to be selected for Somerset County Cricket Club in 1899. He opened the bowling and collected two wickets on his debut, against Kent at the Angel Ground in Tonbridge. Grant played once more for Somerset that season, taking a further two wickets against Gloucestershire. Though he made three further first-class appearances for Somerset—two in 1900 and one in 1901—he did not take any further wickets for the county, and finished his first-class career with five appearances, four wickets and a bowling average of 36.00. He also scored 66 runs at an average of 11.00.\nAfter failing to make an impact on first-class cricket, Grant partnered his cricket at Bath with games for Wiltshire in minor counties cricket. He played over 40 times for the county between 1903 and 1912. In a 1903 match against Monmouthshire, he took a hat-trick on his way to collecting six wickets for just nine runs. The following year, he took seven wickets against a London County Cricket Club side that included a few England Test cricketers of the past and future. His best return for Wiltshire came during a match against Dorset in 1908, when he took seven for 29 in the first innings of the match. Even in minor counties cricket, his batting was weak, though he did score half-centuries against Berkshire in 1907 and Buckinghamshire in 1908. After the end of his playing career, he joined the committee of Bath Cricket Club, and acted as a scorer for the first team. In February 1950 he and Henry Wood were made the first life members of Bath Cricket Club. He died on 12 January 1953, in Bath.\nReferences"
    }
  ]
}