{
  "content": [
    {
      "type": "text",
      "text": "# Edward Neville (courtier)\n\nSir Edward Neville (died 8 December 1538) was an English courtier. He was perhaps born in Kent. He was the son of George Neville, 4th Baron Bergavenny and his wife Margaret, daughter of Hugh Fenn. He married Eleanor Windsor, daughter of Andrew Windsor, 1st Baron Windsor and Elizabeth Blount, before 6 April 1529.  He was the brother of George Nevill, 5th Baron Bergavenny and the two of them became close to King Henry VIII (their distant cousin) and the Queen, Catherine of Aragon.\nEdward Neville was Esquire of the Body, and Sewer Keeper (official overseeing service to Henry VIII's household}}). He lived at Addington Park, Surrey, England. On 25 September 1513 he was invested as a Knight and in 1516 held the offices of Master of the Hounds and Gentleman of the Privy Chamber.\nThe Nevilles and their cousins the Courtenays supported Catherine of Aragon's marriage and for the Pope's authority in England, which alienated King Henry. But Edward seems to have kept the King's favour as late as 1535. He was Henry's Standard Bearer in 1531, and in 1534 he was Constable of Leeds Castle in Kent.\nBut a few years later Henry turned against him. Early in 1538, Henry's chief minister Thomas Cromwell was warned that Edward Neville was secretly trying to obtain the estates of Moatenden Priory, which had been recently dissolved. However, Cromwell had already marked these lands as his own and made a payment of £3,500.\nCromwell, after the death of the Earl of Northumberland in 1537, had marked its property for his own. After the Pilgrimage of Grace, many conservative nobles were accused of treason. Neville was arrested on 3 November 1538, for conspiracy, along with his cousin Henry Pole. They were charged with high treason for conspiracy with Henry's exiled brother, Cardinal Reginald Pole: \"devising to maintain, promote, and advance [Cardinal Pole], late Dean of Exeter, enemy of the King, beyond the sea, and to deprive the King.\" Neville was sent to the Tower, tried at Westminster, and beheaded on 8 December at Tower Hill.\nA patent was issued to Cromwell confirming his estate, possession and interest in the site of the late priory, of Mottenden, and the manors of Mottenden, Plushenden, Plomford, and Delmynden in Kent; the rectory of Lancing, Sussex, and all tithes thereto belonging; the advowson of the parish church of Lancing and the vicarage of the same church; a saltmarsh in Canwynden alias Derwishop, Essex; and all lands, &c., in the counties of Kent, Sussex, and Essex, late of John Gregory alias John Harietsham, late minister of the Trinitarian priory of Mottenden. While it looked as if Cromwell had planned to end Neville for the lands, payments for the area predate any conspiracy theory.\nChildren of Sir Edward Neville and Eleanor.\n* Edward Nevill, 7th Baron Bergavenny (d. 10 Feb 1588/1589)\n* Sir Henry Neville d. 1593\n* Katherine Neville, married Clement Throckmorton. Had issue.\n* Elizabeth Neville\n* Mary Neville b. 1528 d. 1609, who married Henry Dingley/Dinely of Charlton, Cropthorne, Worcestershire\n* Frances Neville, (b. 1519, d. 18 Oct 1599), who married Edward Waldegrave\nNotes\nReferences"
    }
  ]
}