{
  "content": [
    {
      "type": "text",
      "text": "# Edward Tolfree\n\n|         birth_place = Southampton, Hampshire, England\n|          death_date =\n|         death_place = West End, Hampshire, England\n|            heightft =\n|          heightinch =\n|             batting = Unknown\n|             bowling = Unknown\n|              family =\n|               club1 = Hampshire\n|               year1 =\n|         clubnumber1 =\n|             columns = 1\n|             column1 = First-class\n|            matches1 = 5\n|               runs1 = 53\n|            bat avg1 = 8.83\n|           100s/50s1 = –/–\n|          top score1 = 22*\n|         deliveries1 = 324\n|            wickets1 = 2\n|           bowl avg1 = 92.50\n|            fivefor1 = –\n|             tenfor1 = –\n|       best bowling1 = 2/13\n|  catches/stumpings1 = –/–\n|                date = 17 January\n|                year = 2010\n|              source = http://www.cricinfo.com/ci/content/player/21551.html Cricinfo\n}}\nEdward Tolfree (12 July 1881 – 20 March 1966) was an English first-class cricketer.\nThe son of Edward Tolfree, he was born at Southampton in July 1881. Tolfree made his debut in first-class cricket for Hampshire against the touring West Indians at Southampton in 1906, in what was his only appearance of that season. A single first-class appearance followed the following season against Warwickshire in the County Championship, followed by two further appearances in the 1909 County Championship against Surrey and Leicestershire. Tolfree returned to play for Hampshire following the end of the First World War, making his only post-war appearance against Middlesex at Lord's in the 1919 County Championship; his return to playing for Hampshire was likely necessitated by the impact the war had on Hampshire cricket, with many of its leading pre-war players being killed in action during the war. In five first-class appearances, Tolfree scored 53 runs with a highest score of 22 not out, while with the ball he took 2 wickets.\nBy profession, he was a property auctioneer in Southampton. Tolfree died in the Southampton suburb of West End in March 1966.\nReferences\nExternal links\n*"
    }
  ]
}