{
  "content": [
    {
      "type": "text",
      "text": "# Edward H. Burke\n\n| birth_place        = Baltimore County, Maryland, U.S.\n| death_date         =\n| death_place        = Baltimore, Maryland, U.S.\n| resting_place      = Cathedral CemeteryBaltimore, Maryland, U.S.\n| party              = Democratic\n| spouse             =\n| children           =\n| education          =\n| alma_mater         = Loyola College (BA)University of Maryland School of Law\n| occupation         =\n| signature          =\n}}\nEdward Hamilton Burke (January 14, 1886 – July 10, 1955) was an American politician and lawyer from Maryland. He served as a member of the Maryland House of Delegates, representing Baltimore County in 1920.\nEarly life\nEdward Hamilton Burke was born on January 14, 1886, in Baltimore County, Maryland to Colie (née Ady) and N. Charles Burke. His father was a judge. He attended Loyola High School and graduated from Loyola College with a Bachelor of Arts in 1906. He graduated from the University of Maryland School of Law in 1908. He was admitted to the bar on August 5, 1908.\nCareer\nBurke had a private law practice. He was a private in the United States Marine Corps during World War I. After the war, Burke was appointed assistant United States attorney.\nBurke was a Democrat. Burke served as a member of the Maryland House of Delegates, representing Baltimore County in 1920. He was chairman of the standing committee on judiciary. He was a member of the standing committees on printing, education and agriculture.\nIn 1923, Burke joined the law firm Bowie & Clerk. The firm was renamed Bowie & Burke and later named Bowie, Burke & Leonard.\nIn 1933, he was chairman of the New Democratic Organization. He was a member of the commission to revise the land and inheritance laws of Maryland in 1939. He was chairman of the committee to review the judicial system of Maryland from 1952 to 1953. He was chairman of the Baltimore County Charter Board from 1954 to 1955.\nBurke served as president of the Maryland State Bar Association from 1953 to 1954. He was also exalted ruler of the Order of Elks. Burke served four years as president of the Hibernian Society of Baltimore; retiring in 1940.\nPersonal life\nBurke married Elizabeth Carter in 1913. He lived in Reistertown, Maryland.\nBurke died on July 10, 1955, at Union Memorial Hospital in Baltimore. He was buried in Cathedral Cemetery in Baltimore.\nLegacy\nBurke received an honorary Doctor of Laws from Loyola College in 1947.\nReferences\nExternal links\n*"
    }
  ]
}