{
  "content": [
    {
      "type": "text",
      "text": "# Edward Gaylord Bourne\n\n| birth_place     = Strykersville, New York, US\n| death_date      =\n| death_place     = New Haven, Connecticut, US\n| burial_place    = Grove Street Cemetery\n| occupation      = Historian\n| awards          =\n| spouse          =\n| children        = 5\n| education       = Yale University\n| signature       =\n| party           =\n}}\nEdward Gaylord Bourne, Ph. D. (June 24, 1860 &ndash; February 24, 1908) was an American historian.\nBiography\nEdward Gaylord Bourne was born in Strykersville, New York on June 24, 1860. He was educated at Yale, graduating in 1883 with high honors. He taught at Adelbert College, Cleveland from 1888 to 1895 when he became a professor of history at Yale. Bourne is considered one of the founders of Latin American history as a field in the United States.  The publication of his Spain in America (1904), was \"a major landmark in the development of the field,\" which \"gave a lucid synthesis of the institutional life of Spanish America, ranging also through economic, social, and cultural developments....\"  In an assessment of Bourne's work, Charles Gibson and Benjamin Keen state that \"He may justifiably be termed the first scientific historian of the United States to view the Spanish colonial process dispassionately and thereby to escape the conventional Anglo-Protestant attitudes of outraged or tolerant disparagement.\"\nHe married Annie Thomson Nettleton on July 17, 1895, and they had three children.\nBourne died in New Haven, Connecticut on February 24, 1908, and was buried at Grove Street Cemetery.\nPublications\nBourne published many critical papers on historical subjects.  One of them, \"The Legend of Marcus Whitman,\" is considered to have settled the Whitman question, determining that there was no basis in fact for the widespread notion that Whitman \"saved\" Oregon to the United States. His four-volume Spain in America is credited with \"an unequivocally scholarly presentation, in laying a positive assessment of early Hispanic colonization before the [U.S.] American public.\" The work was reissued in 1962, indicating its enduring importance to the field.\nBourne published:\n* The History of the Surplus Revenue of 1837 (1885)\n* Historical Introduction to the Philippine Islands (1903)\n* Spain in America, 1450-1580 (1904) 4 vols. Reissued 1962.\n* Life of J. L. Motley (1905)\n* Discovery, Conquest, and History of the Philippine Islands (1907)\nBourne edited:\n* ''Rocher's Spanish Colonial System (1904), and translated The Narrative of De Soto (1904) and The Voyage of Champlain'' (1905).\nHonors\nBourne was elected a member of the American Antiquarian Society in 1893.\nReferences\nFurther reading\n*Benjamin Keen, \"Edward Gaylor Bourne's Spain in America, in Latin American History: Essays on Its Study and Teaching, 1898-1965. Austin: University of Texas Press 1967, vol. 1, pp.&nbsp;56–58.\n* wikisource:en:Oregon Historical Quarterly/Volume 9/Notes and news (Number 1)\nExternal links\n*\n*\n*[https://penelope.uchicago.edu/Thayer/E/Gazetteer/Places/America/United_States/_Topics/history/_Texts/BOUSIA/home.html Spain in America] at Thayer's American History site"
    }
  ]
}