{
  "content": [
    {
      "type": "text",
      "text": "# Edward Henry Palmer\n\nEdward Henry Palmer (7 August 184010 August 1882), known as E. H. Palmer, was an English orientalist and explorer.\n, ancient Nessana) in the Negev Desert, as illustrated by Palmer (1872) in his The Desert of the Exodus.]]\nBiography\nYouth and education\nPalmer was born in Green Street, Cambridge, the son of a private schoolmaster. He was orphaned at an early age and brought up by an aunt. He was educated at The Perse School, and as a schoolboy showed the characteristic bent of his mind by picking up the Romani language and a great familiarity with the life of the Romani people. From school he was sent to London as a clerk in the city. Palmer disliked this life, and varied it by learning French and Italian, mainly by frequenting the society of foreigners wherever he could find it.\nIn 1859 he returned to Cambridge, almost dying of tuberculosis. He made a miraculous recovery, and in 1860, while he was thinking of a new start in life, fell in with Sayyid Abdallah, teacher of Hindustani at Cambridge, under whose influence he began his Oriental studies. He matriculated at St John's College, Cambridge in November 1863, and in 1867 was elected a fellow on account of his attainments as an orientalist, especially in Persian and Hindustani.\nOrientalism and exploration\nDuring his residence at St John's he catalogued the Persian, Arabic and Turkish manuscripts in the university library and the libraries of King's and Trinity. In 1867 he published a treatise on Oriental mysticism based on the Maqsad-i-aqsa of Aziz ad-Din Nasafi. He was engaged in 1869 to join the survey of Sinai Peninsula undertaken by the Palestine Exploration Fund. He followed up this work in the next year by exploring the desert of El-Tih in company with Charles Francis Tyrwhitt-Drake. They completed this journey on foot and without escort, making friends among the Bedouin, to whom Palmer was known as Abdallah Effendi.\nAfter a visit to the Lebanon and to Damascus, where he made the acquaintance of Sir Richard Burton, then consul there, he returned to England in 1870 by way of Constantinople and Vienna. At Vienna he met Arminius Vambéry. The results of this expedition appeared in the Desert of the Exodus (1871); in a report published in the journal of the Palestine Exploration Fund (1871); and in an article on the \"Secret Sects of Syria\" in the Quarterly Review (1873).\nIn the close of the year 1871 he became Lord Almoner's Professor of Arabic at Cambridge University, married, and settled down to teaching. His salary was small, and his affairs were further complicated by his wife's long illness, who died in 1878. In 1881, two years after his second marriage, he left Cambridge and joined the staff of the Standard to write on non-political subjects. He was called to the English bar in 1874.\nMurder\nEarly in 1882, Palmer was asked by the government to go to the East and assist the Egyptian expedition by his influence over the Arabs of the El-Tih desert (for definition see here). He was instructed, apparently, to prevent the Arab sheikhs from joining the Egyptian rebels and to secure their non-interference with the Suez Canal. He went to Gaza without an escort; made his way safely through the desert to Suez, an exploit of singular boldness; and was highly successful in his negotiations with the Bedouin. He was appointed interpreter-in-chief to the force in Egypt, and from Suez he was again sent into the desert with Captain William Gill and Flag-Lieutenant Harold Charrington to procure camels and gain the allegiance of the sheikhs by considerable presents of money. On this journey he and his companions were led into an ambush and murdered (August 1882). Their remains, recovered after the war by the efforts of Sir Charles (then Colonel) Warren, now lie in St Paul's Cathedral.\nWorks\nBooks\nAccording to the Encyclopædia Britannica Eleventh Edition, \"Palmer's highest qualities appeared in his travels, especially in the heroic adventures of his last journeys. His brilliant scholarship is displayed rather in the works he wrote in Persian and other Eastern languages than in his English books, which were generally written under pressure. His scholarship was wholly Eastern in character, and lacked the critical qualities of the modern school of Oriental learning in Europe. All his works show a great linguistic range and very versatile talent; but he left no permanent literary monument worthy of his powers.\"\nHis chief writings are\n* Oriental Mysticism (1867)\n* The Desert of the Exodus (part 1) (1871) and (part 2)\n* Poems of Beha al-Din Zuhayr (Arabic and English, 1876–1877)\n* Arabic Grammar (1874)\n* [https://archive.org/details/jerusalemcityofh00besarich Jerusalem, the city of Herod and Saladin] (1871), by Walter Besant and Palmer (the latter wrote the part taken from Arabic sources)\n* Persian Dictionary (1876) and English and Persian Dictionary (posthumous, 1883)\n* A translation of the Qur'an (1880) for the Sacred Books of the East series.\nHe was also an editor of Name Lists of the Palestine Exploration.\nManuals of Arabic language and grammar (links)\n*\n*\n*\n*\n*\n*\nArticles\nSeveral articles in the Encyclopædia Britannica, 9th edition (1875–89) and 10th edition (1902–03), including on Firdowsi, Hafiz, Ibn Khaldun and Legerdemain.\nNotes\n*\nReferences\n* [https://archive.org/details/lifeachievements00besaiala The Life and Achievements of Edward Henry Palmer] by Walter Besant. London, 1883.\n*Tribute by Sir Richard Francis Burton:\n**\"The Late E. H. Palmer: I. Personal Reminiscences\" (1883), Academy, Vol. XXIII (5 May), p.&nbsp;311.\n**\"The Late E. H. Palmer: II. The Story of His Death\" (1883), Academy, Vol. XXIII (12 May), pp.&nbsp;329–30.\nExternal links\n*\n*\n* [http://al-quran.info Al-Quran] project includes the Qur'an translation of E. H. Palmer.\n* [http://chass.csupueblo.edu/history/seminar/palmer.htm Profile]\n* Jeffrey Bloomfield The Making of the Commissioner: 1886, R.W. Stone, Q.P.M. (ed.), The Criminologist, Volume 12, No. 3 (Autumn 1988), pp.&nbsp;139–155; the article was reprinted: Paul Begg (Exec. ed.).  The Ripperologist, No. 47, July 2003, pp.&nbsp;6–15."
    }
  ]
}