{
  "content": [
    {
      "type": "text",
      "text": "# Edward W. Forbes\n\n| birth_place = Naushon Island, Dukes County, Massachusetts, U.S.\n| death_date =\n| death_place = McLean Hospital, Belmont, Massachusetts, U.S.\n| death_cause =\n| resting_place =\n| resting_place_coordinates =\n| nationality =\n| other_names =\n| known_for =\n| education = Milton Academy\n| alma mater= Harvard University\n| employer =\n| occupation =\n| title =\n| term =\n| predecessor =\n| successor =\n| party =\n| boards =\n| spouse = Margaret Laighton\n| children = 5\n| parents = William Hathaway ForbesEdith Emerson Forbes\n| relatives = John Murray Forbes (paternal grandfather)Robert Bennet Forbes (paternal great-uncle)William Emerson (maternal great-grandfather)Ralph Waldo Emerson (maternal grandfather)William Cameron Forbes (brother)\nAlexander Forbes (brother)\n}}\nEdward Waldo Forbes (July 16, 1873 &ndash; March 11, 1969) was an American art historian. He was the Director of the Fogg Art Museum at Harvard University from 1909 to 1944.\nEarly life\nEdward Waldo Forbes, of the Forbes family, was born on July 16, 1873, on Naushon Island off Cape Cod in Massachusetts. His father, William Hathaway Forbes, was a co-founder of the Bell Telephone Company with Alexander Graham Bell. His mother, Edith Emerson Forbes, was the daughter of poet Ralph Waldo Emerson. His paternal grandfather, John Murray Forbes, was a French-born railroad magnate, merchant, and abolitionist. His brother, William Cameron Forbes, went on to serve as the United States Ambassador to Japan from 1930 to 1932.\nForbes was educated at the Milton Academy, a boarding school in Milton, Massachusetts. He graduated from Harvard University in 1895. While he was at Harvard, he attended art history lectures by Charles Eliot Norton. Forbes traveled to Europe many times, where he studied Italian paintings. He attended the University of Oxford, studying English Literature from 1900 to 1902.\nCareer\nForbes co-founded the Harvard River Associates in 1902 with Robert Bacon, James Abercrombie Burden, Jr., Augustus Hemenway and Thomas Nelson Perkins. The real estate venture consisted in acquiring land between the Harvard Yard and the Charles River for US$400,000 to preserve the beauty of the area near the Harvard campus remained \"collegiate\". Subsequently, the land became part of the campus in its expansion.\nForbes taught at his alma mater, Middlesex School, from 1904 to 1905. By 1907, he conducted a course on Florentine painting at his other alma mater, Harvard University. He became a lecturer in Fine Arts at Harvard in 1909. By 1935, he was promoted as the Martin A. Ryerson Professor in the Fine Arts at Harvard University. He retired in 1944.\nForbes served as the Director of the Fogg Art Museum at Harvard University from 1909 to 1944. Under his leadership, the art collection was vastly expanded, and a new building was opened in 1927. He led many fundraising campaigns with Paul J. Sachs. He founded the Center for Conservation and Technical Studies, later renamed the Straus Center for Conservation and Technical Studies. He promoted the X-ray study of the paintings in the museum collection. He urged art conservator George L. Stout to work with chemist Rutherford John Gettens, both of whom pioneered scientific art preservation. Moreover, he sailed aboard the Asama Maru from San Francisco, California, to Japan to undertake an art research trip and to visit his brother in 1931. He retired in 1944.\nForbes served as the President of the American Research Center in Egypt from 1948 to 1962.\nThe first Honorary Fellowship of the International Institute for Conservation of Historic and Artistic Works (IIC) was awarded to Edward Forbes in 1958.\nAs a permanent tribute, the plaza outside and the arcade inside Harvard's Holyoke Center were named in his honour. The occasion was marked by a ceremony on October 17, 1966.\nPhilanthropy\nForbes served in the American Red Cross during World War I.\nForbes served on the board of trustees of the Boston Museum of Fine Arts from 1903 to 1963. He also served on the board of trustees of the Wadsworth Athenaeum in Hartford, Connecticut. He served on the administrative committee of the Dumbarton Oaks Collection and Research Library of Byzantine Studies in Washington, D.C., from 1941 to 1963. Additionally, he served on the Board of Trustees of Public Reservations of Massachusetts for six decades. He became honorary fellow of the International Institute for Conservation in 1958, where the annual Edward W. Forbes Prize was named in his honor.\nForbes was a recipient of an honorary A.M. from Harvard in 1921, an honorary LL.D. from the University of Pittsburgh in 1927, and an honorary Doctorate of Arts from Harvard in 1942. He was the recipient of the knighthood of the Legion of Honor from the Republic of France in 1937.\nThe Forbes Symposia and Lectures on Scientific Research in the Field of Asian Art series at the Smithsonian's National Museum of Asian Art is supported by the Edward W. Forbes Fund. This bequest to the Freer Gallery was made by John Thacher in honor of his former colleague, Edward Waldo Forbes, a past director of the Fogg Art Museum at Harvard University and an early proponent of applying technical examination to the study of art.\nPersonal life\nForbes married Margaret Laighton in 1907. They had five children, including John Murray Forbes, Mary Emerson Forbes, Elliott Forbes, Anne Forbes, and Rosamond (Mrs. Carl Pickhardt). They resided at 30 Gerry's Landing Road in Cambridge, Massachusetts. His wife predeceased him in 1966.\nForbes was an avid amateur painter and sailor.\nDeath\nForbes died on March 11, 1969, at the McLean Hospital in Belmont, a suburb of Boston in Massachusetts. He was ninety-five years old.\nReferences"
    }
  ]
}