{
  "content": [
    {
      "type": "text",
      "text": "# Edward Channing\n\n| birth_place        = Dorchester, Massachusetts\n| death_date         =\n| death_place        = Cambridge, Massachusetts\n| death_cause        =\n| region             =\n| nationality        =\n| citizenship        =\n| other_names        =\n| occupation         =\n| period             =\n| known_for          =\n| title              =\n| boards             =\n| spouse             =\n| children           =\n| parents            = William Ellery Channing (father)\n| relatives          =\n| awards             = Pulitzer Prize (1926)\n| education          =\n| alma_mater         = Harvard College\n| thesis_title       =\n| thesis_url         =\n| thesis_year        =\n| school_tradition   =\n| doctoral_advisor   =\n| academic_advisors  =\n| influences         =\n| era                =\n| discipline         = Historian\n| sub_discipline     = U.S. history\n| workplaces         = Harvard University\n| doctoral_students  = Samuel Flagg Bemis\n| notable_students   =\n| main_interests     =\n| notable_works      = History of the United States\n| notable_ideas      =\n| influenced         =\n| signature          = Signature of Edward Perkins Channing (1856–1931).png\n| signature_alt      =\n| signature_size     =\n| footnotes          =\n}}\nEdward Perkins Channing (June 15, 1856 – January 7, 1931) was an American historian and an author of a monumental History of the United States in six volumes, for which he won the  1926 Pulitzer Prize for History.   His thorough research in printed sources and judicious judgments made the book a standard reference for scholars for decades. Channing taught at Harvard 1883–1929 and trained many PhD's who became professors at major universities.\nLife and works\nEdward Channing was born in Dorchester, Massachusetts, the fifth child of Ellen Kilshaw Fuller (1820–1856), a sister of Margaret Fuller, and  William Ellery Channing (1818–1901), the poet and walking companion of Henry David Thoreau. Some months after his birth, his mother died, and he was placed out with a shoemaker and his wife in Abington, Mass. Some time around 1860, his paternal grandfather Walter Channing and his daughter took care of him.  Young Edward Channing attended a private school and entered Harvard College in autumn 1874.  He received his A.B. in 1878, and two years later he received his PhD in history with a thesis on the Louisiana Purchase.  In 1880, his grandfather died, leaving an inheritance of $300 (). He  undertook a nine-months tour through Europe, which led him also to the Near East and North Africa. After he returned, he wrote geographical articles for Science, for example about the Sudan and geography-instruction at German schools. In 1883, he became an instructor of history at Harvard University and an assistant for professor Charles Cutler Torrey. On July 22, 1886, he married the sister-in-law of Thomas Wentworth Higginson, Alice Thacher. They had two daughters.\nHe died at his home in Cambridge, Massachusetts on January 7, 1931.\nAcademic\nIn 1883, Channing received a prize of $150 for his work \"Town and County Government in the English Colonies of North America\". This monograph also brought him the membership in the Massachusetts Historical Society and was the basis of the first paper given at the first meeting of the American Historical Association in 1884 in Saratoga Springs, New York.\nIn 1883, Channing published a revised edition (translated by William H. Tillinghast) of An Epitome of Ancient, Medieval, and Modern History by German historian Karl Ploetz, adding new sections on English and U.S. history.\nIn 1887, Channing became assistant professor, in 1897 professor, and in 1912 McLean Professor of Ancient and Modern History (one of the oldest professorships for secular history in the United States, once held by Jared Sparks). He retired in 1929.\nChanning was elected a fellow of the American Academy of Arts and Sciences, and a Member of the American Academy of Arts and Letters. He was elected a member of the American Antiquarian Society in 1885. Channing was elected president of the American Historical Association in 1919. In 1921 and 1926 respectively, he received honorary doctorates from Michigan University and Columbia University.\nWorks\n*The Navigation Laws (1890)\n*The United States of America, 1765–1865 (1896), a textbook. 2nd ed. 1930.\n*A History of the United States Vol. 1: The Planting of a Nation in the New World, 1000–1660 (1905)\n*A History of the United States Vol. 2: A Century of Colonial History, 1660–1760 (1908)\n*A History of the United States Vol. 3: The American Revolution, 1761–1789 (1912)\n*A History of the United States Vol. 4: Federalists and Republicans, 1789–1815\n*A History of the United States Vol. 5: The Period of Transition, 1815–1848 (1921)\n*A History of the United States Vol. 6: The War for Southern Independence, 1849–1865 (1925), 1926 Pulitzer Prize for History\n* A Short History of the United States for School Use, 1908\nSee also\n* Political history in the United States, for historiography\nSecondary sources\n* Cappon, Lester J. \"Channing and Hart: Partners in Bibliography.\" New England Quarterly 29, no. 3 (Sept. 1956):318–340. [https://www.jstor.org/pss/363012 in JSTOR]\n* DeNovo, John A. \"Edward Channing's 'Great Work' Twenty Years After.\" Mississippi Valley Historical Review 39, no. 2 (Sept. 1952):257–274. [https://www.jstor.org/pss/1892183 in JSTOR]\n* Fahrney, Ralph Ray. \"Edward Channing.\" Mississippi Valley Historical Review 18, no. 1 (June 1931):53–59, obituary [https://www.jstor.org/pss/1897436 in JSTOR]\n* Fahrney, Ralph Ray. \"Edward Channing.\" In The Marcus W. Jernegan Essays in American Historiography, 294–312. Ed. by William T. Hutchinson. (1937).\n* Joyce, Davis D. Edward Channing and the great work (The Hague: Martinus Nijhoff,  1974)\n* Kraus, Michael, and Davis D. Joyce.  The Writing of American History (1990) pp 203–209 [https://books.google.com/books?id=rPQSU37xB74C&dq=channing+intitle%3Awriting+inauthor%3Akraus&pg=PA203 online]\nReferences\nExternal links\n*\n*\n*"
    }
  ]
}