{
  "content": [
    {
      "type": "text",
      "text": "# Edward C. Hegeler\n\n| birth_place = Bremen, German Confederation\n| death_date  =\n| death_place = La Salle, Illinois\n| parents     =\n| spouse      =\n| children    =\n| relations   = Anita Lihme (granddaughter)\n| signature   = CAB 1918 Hegeler Edward C signature.png\n}}\nEdward Carl Hegeler (September 13, 1835June 4, 1910) was an American zinc manufacturer and publisher.\nEarly life\nHegeler was born on September 13, 1835, in Bremen, then a part of the German Confederation. He was the youngest son of Herman Dietrich Hegeler and Anna Catharine (née von Tungeln) Hegeler.  His father, originally of Oldenburg, had traveled in the United States and wished one of his sons to settle there and chose Edward for this task.\nEdward's father had his education mapped out with this purpose in view, educating him in the academy of Schnepfenthal and then having him attend the Polytechnic Institute at Hanover from 1851 to 1853, and later the School of Mines at Freiberg, Saxony from 1853 to 1856.  In Freiberg, Hegeler met Frederick William Matthiessen, a fellow student, who became later his partner in the zinc business.\nCareer\nHegeler and Matthiessen traveled together on the European continent, and in England, before embarking for America and landing in Boston in March 1857.  While looking over the country for a suitable place to settle, they learned of Friedensville, Pennsylvania, where a zinc factory had been built, but it stood idle because the owners had not been able to manufacture the metal. Matthiessen and Hegeler, then 21 and 22 years old, respectively, stepped in, and with the same furnace succeeded in producing spelter, which at that time was pioneer work in America, for hitherto this metal had been imported from Europe. On account of the financial stringency of 1856, which still persisted in 1857, the owners of the Friedensville works refused to put more money into the enterprise, while neither Hegeler nor Matthiessen felt justified in risking their own capital, mainly because they had no confidence in the mines, which actually gave out eight years later.\nHaving investigated conditions in Pittsburgh and Johnstown, Pennsylvania, and also in southeastern Missouri, Hegeler and Matthiessen finally settled in La Salle, Illinois, because its coal fields were nearest to the ore supply at Mineral Point, Wisconsin. Here they started the Matthiessen and Hegeler Zinc Works on a small scale. The few employees of the original works grew in a comparatively short time, to upward of one thousand men, and the modest smelting plant developed into one of the most modernly equipped smelters in the Middle West. His success in life has been attributed to a combination of two qualities in his character: first, the thoroughness with which he investigated from all sides the minutest details of a case when he had to take a stand; and second, the insuperable persistence with which he stuck to it until he had achieved the desired result.\nOpen Court Publishing Company\nIn February 1887, Hegeler founded the Open Court Publishing Company, intended to serve the purpose of discussing religious and psychological problems on the principle that the scientific world-conception should be applied to religion. Hegeler believed in science, but he wanted to preserve the religious spirit with all its seriousness of endeavor, and in this sense he pleaded for the establishment of a religion of science. He recognized, for instance, that man with all his complicated psychical activity was a mechanism, but to him this truth was not derogatory to man, but an evidence of the great significance of machines. The mechanism of thinking is language, and so the speaking animal becomes the rational being. He maintained that through investigation and scientific criticism, religion must be purified, and the result would be a closer approach to truth on the path of progress. Hegeler rejected dualism as an unscientific and untenable view and accepted monism upon the basis of exact science, and for the discussion of the more recondite and heavier problems of science and religion he founded a quarterly, The Monist, in October 1890.\nHegeler was a member of the American Institute of Mining Engineers, the Press Club, and the Art Institute of Chicago.\nPersonal life\nHe visited Germany in 1860 where, on 5 April, he married Camilla Weisbach (1835–1908), the daughter of his admired teacher, Professor Julius Weisbach, of Freiberg, Germany. In July of the same year they settled in La Salle, Illinois, where they resided until the end of their lives. They had ten children, including three daughters who died during his lifetime:\n* Marie Henriette Hegeler (1861–1936), who married author and editor Paul Carus and took over the zinc business from her father\n* Helene Emma Hegeler (1862–1868), who died young.\n* Meta Rosalie Hegeler (1865–1868), who died young.\n* Camilla Hegeler (1863–1955), who married physicist Alfred Bucherer.\n* Julius Weisbach Hegeler (1867–1943), who married Josephine Caesar (1868–1954).\n* Gisela Cazela Hegeler (1869–1892), who died unmarried.\n* Annie Hegeler (1873–1951), who married Dr. Rufus Cole, director of the Hospital of the Rockefeller Institute in New York City.\n* Herman Hegeler (1872–1913), who married Louise Sherwood (1879-1960).\n* Lena Zuleikha Hegeler (1875–1962), who married Baron Karl von Vietinghoff (1870–1923).\n* Olga Hegeler (1878–1956), who married Christian Bai Lihme (1866–1946), a Danish born chemist, industrialist, and art collector.\nIn 1874, Hegeler hired noted Chicago architect William W. Boyington to design a new residence for his family. The home, today known as the Hegeler Carus Mansion, is located at 1307 Seventh Street in La Salle, Illinois.  It is considered one of the Midwest's great Second Empire structures and was designated a National Historic Landmark in 2007.\nHis wife died on May 28, 1908, and Hegeler died on June 4, 1910, in La Salle.\nDescendants\nThrough his daughter Olga, he was the grandfather of Anita Lihme (1903–1976), who became Princess Edward Joseph de Lobkowicz upon her marriage in 1926 to a son of the former Countess Palermy of Bohemia and Prince August de Lobkowicz, Privy Counselor and Lord Chamberlain to the Emperor Franz Josef.  His granddaughter was the mother of Prince Edouard de Lobkowicz (1926–2010), who married Princess Marie-Françoise of Bourbon-Parma, the eldest daughter of Prince Xavier of Bourbon-Parma and of his wife, Madeleine de Bourbon-Busset.\nThrough his daughter the Baroness Zuleikha Vietinghoff, he was the grandfather of Baron Karl von Vietinghoff-Scheel, who married American actress Elizabeth Allen in 1953.\nReferences\nExternal links\n*\n* [https://archives.lib.siu.edu/?p=collections/findingaid&id=2591&q=&rootcontentid=99995 Edward Hegeler- Paul Carus family papers, 1868-1936] at the Southern Illinois University Special Collections Research Center"
    }
  ]
}