{
  "content": [
    {
      "type": "text",
      "text": "# Edward N. Kirk\n\n|death_date=\n|birth_place= Jefferson County, Ohio, US\n|death_place= Chicago, Illinois, US\n|placeofburial= Rosehill Cemetery, Chicago, Illinois\n|placeofburial_label= Place of burial\n|image= Edward N Kirk.jpg\n|caption= Edward N. Kirk, c. 1858\n|allegiance= United StatesUnion\n|branch= United States ArmyUnion Army\n|serviceyears= 1861&ndash;1863\n|rank=  Brigadier General\n|commands= 34th Illinois Infantry\n|unit=\n|battles=\n*American Civil War\n**Battle of Shiloh\n**Battle of Stones River\n|awards=\n|laterwork=\n}}\nEdward Needles Kirk (February 29, 1828 – July 21, 1863) was a Quaker school teacher, attorney, and then a brigadier general in the Union Army during the American Civil War.\nEarly life and career\nKirk was born in rural Jefferson County, Ohio. He was educated at the Friends' Academy in Mount Pleasant, Ohio, and subsequently taught school. He studied law for two years in Cadiz, Ohio, and passed the bar exam in 1853. He established a practice in Baltimore, Maryland. In the spring of 1854, he relocated to Sterling, Illinois. He married Marcella Cameron in Philadelphia on October 17, 1855. The couple had two sons. In 1858, with his business quickly prospering, Kirk built a large mansion, now known as the Paul W. Dillon Home.\nCivil War service\nAt the start of the Civil War, Kirk recruited and organized the 34th Illinois Infantry, serving as the regiment's first colonel dating from September 1861. He saw duty in Kentucky and Tennessee. He commanded a brigade of four regiments during the Battle of Shiloh, where he was wounded in the shoulder on April 7, 1862, and eventually shipped home to recuperate.\nFollowing his lengthy convalescence, Kirk returned to the field in late August, although he was still partially invalided. He and his men participated in parts of the Kentucky Campaign. He was appointed as a brigadier general dating from November 29, 1862. A little more than a month later, he was severely wounded in the hip during the Battle of Stones River near Murfreesboro, Tennessee, the Minié ball lodging near his spine. He was transported to a field hospital and then eventually taken to the Tremont House in Chicago, where he died several months later.\nHe is buried in the Rosehill Cemetery and Mausoleum in Chicago.\nBattery Edward N. Kirk at Fort Stark in New Hampshire was named in his memory. His son, Edward C. Kirk, became one of Pennsylvania's leading dental surgeons and medical educators.\nSee also\n*List of American Civil War generals (Union)\nNotes\nReferences\n* Warner, Ezra J., Generals in Blue: Lives of the Union Commanders, Baton Rouge: Louisiana State University Press, 1964, .\n*Wilson, James G., Biographical Sketches of Illinois Officers Engaged in the War Against the Rebellion of 1861. Chicago: James Barnet, publisher, 1863.\nAttribution\n*\nExternal links\n*"
    }
  ]
}