{
  "content": [
    {
      "type": "text",
      "text": "# Edward Rowe Snow\n\nEdward Rowe Snow (August 22, 1902 Winthrop, Massachusetts – April 10, 1982 Boston, Massachusetts) was an American writer and historian.\nLife\nHe was the son of Edward Sumpter and Alice Nichsols (Rowe) Snow. He graduated from Harvard University, and Boston University, with an M.A.\nSnow married Anna Myrle Haegg, on July 8, 1932, and they had a daughter Dorothy Caroline (Snow) Bicknell.\nHe was a high school teacher in Winthrop, Massachusetts. During World War II, he served with the XII Bomber Command, and he became a first lieutenant.  He was wounded in North Africa in 1942, and discharged because of this in 1943.  He was a daily columnist at The Patriot Ledger newspaper in  Quincy, Massachusetts, from 1957–82.\nCareer\nSnow is widely known for his stories of pirates and other nautical subjects; he wrote over forty books and many shorter publications. In all, he was the author of more than 100 publications, mainly about New England coastal history.\nMr. Snow was also a major chronicler of New England maritime history. With the publication of The Islands of Boston Harbor in 1935, he became famous as a historian of the New England coast and also as a popular storyteller, lecturer, preservationist, and treasure hunter. Forty years later, he was still publishing.\nHe is also famous for carrying on the tradition of the \"Flying Santa\" for over forty years (1936–1980). Every Christmas he would hire a small plane and drop wrapped gifts to the lighthouse keepers and their families.\nIn the 1940s and early 1950s he hosted a weekly Sunday radio show for youngsters and early teens called \"Six Bells\" where one precisely at 3:00 PM would join in hearing of the adventures of pirates and buccaneers along the Atlantic Coast.\nMany credit him with saving Fort Warren, located on Georges Island in Boston Harbor, in the 1950s.\nIn August 2000, a plaque was dedicated to Mr. Snow on his beloved Georges Island.  A Boston Harbor ferry boat was named for him.\nSince 2002, several of his books were released in new editions published by Commonwealth Editions of Beverly, Massachusetts.\nPublications\n* Castle Island, Its 300 Years of History and Romance (Andover MA: Andover Press, 1935)\n* [https://books.google.com/books?id=-oNCNoMuwjgC The Islands of Boston Harbor, their history and romance, 1626–1935] (1935, updated by Jeremy D'Entremont and republished by Commonwealth Editions, 2002)\n* Sailing Down Boston Bay (Yankee Publishing Company, 1941)\n* Historic Fort Warren (Boston: Yankee Publishing, 1941)\n* Storms And Shipwrecks of New England (1943, updated by Jeremy D'Entremont and republished by Commonwealth Editions, 2005)\n* The Romance of Boston Bay (Boston: Yankee Publishing, 1944)\n* Pirates and Buccaneers of the Atlantic Coast (Boston: Yankee, 1944; republished by Commonwealth Editions, 2004)\n* The Lighthouses of New England (1945 and later editions; updated by Jeremy D'Entremont and republished by Commonwealth Editions, 2002)\n* A Pilgrim Returns to Cape Cod (Boston: Yankee Publishing Company, 1946; republished by Commonwealth Editions, 2003).\n* Mysteries and Adventures Along the Atlantic Coast (1948, updated by Jeremy D'Entremont and republished by Commonwealth Editions, 2006)\n* Strange Tales from Nova Scotia to Cape Hatteras (New York: Dodd, Mead, 1949)\n* Secrets of the North Atlantic Islands (New York: Dodd, Mead, 1950)\n* Great Gales and Dire Disasters (New York: Dodd, Mead, 1952)\n* True Tales of Pirates and Their Gold (New York: Dodd, Mead, 1953)\n* New England Sea Drama (New York: Dodd, Mead, 1953)\n* Amazing Sea Stories Never Told Before (New York: Dodd, Mead, 1954)\n* Famous Lighthouses of America (New York: Dodd, Mead, 1955)\n* The Vengeful Sea (New York: Dodd, Mead, 1956)\n* Great Sea Rescues and Tales of Survival (New York: Dodd, Mead, 1958)\n* Piracy, Mutiny and Murder (New York: Dodd, Mead, 1959)\n* New England Sea Tragedies (New York: Dodd, Mead, 1960)\n* Women Of The Sea (1962, updated by Jeremy D'Entremont and republished by Commonwealth Editions, 2002)\n* True Tales of Terrible Shipwrecks (New York: Dodd, Mead, 1963)\n* True Tales of Buried Treasure (New York: Dodd, Mead, 1963)\n* Unsolved Mysteries of Sea and Shore (New York: Dodd, Mead, 1963)\n* The Fury of the Seas (New York: Dodd, Mead, 1964)\n* Astounding Tales of the Sea (New York: Dodd, Mead, 1965)\n* An Island Citadel (Boston: Braintree MA, ca. 1965)\n* Tales of Sea and Shore (New York: Dodd, Mead, 1966)\n* Two Forts Named Independence, (1967)\n* Incredible Mysteries and Legends of the Sea (New York: Dodd, Mead, 1967)\n* Fantastic Folklore and Fact (New York: Dodd, Mead, 1968)\n* True Tales and Curious Legends: Dramatic Stories from the Yankee Past (New York: Dodd, Mead 1969)\n* Great Atlantic Adventures (New York: Dodd, Mead, 1970)\n* The Islands of Boston Harbor (New York: Dodd, Mead, 1971)\n* Ghosts, Gales and Gold (New York: Dodd, Mead, 1972)\n* Supernatural Mysteries and Other Tales (New York: Dodd, Mead, 1974)\n* The Romance of Casco Bay (New York: Dodd, Mead, 1975)\n* Marine Mysteries and Dramatic Disasters of New England (New York: Dodd, Mead, 1976)\n* Boston Bay Mysteries and other Tales  (New York: Dodd, Mead, 1977)\n* Adventures, Blizzards, and Coastal Calamities (New York: Dodd, Mead, 1978)\n* Tales of Terror and Tragedy (New York: Dodd, Mead, 1979)\n* Sea Disasters and Inland Catastrophes (New York: Dodd, Mead, 1980)\n* Pirates, Shipwrecks and Historic Chronicles (New York: Dodd, Mead, 1981)\nReferences\nExternal links\n* [https://www.amazon.com/s?k=edward+rowe+snow&ref=nb_sb_noss Edward Rowe Snow at Amazon.com]\n* [http://www.lighthouseantiques.net/books3/books3.html Lighthouses.net (catalog of publications)]\n*\n* [https://www.nha.org/pdfs/hn/HistoricNan-Winter2008.pdf \"Flying Santa: Edward Rowe Snow and the Romance of History\"], by Joseph P. Theroux"
    }
  ]
}