{
  "content": [
    {
      "type": "text",
      "text": "# Edward Whelan (Canadian politician)\n\nEdward Whelan (1824 – December 10, 1867) was one of Prince Edward Island's delegates to the Québec Conference and one of the Fathers of the Canadian Confederation. Whelan was also a journalist, orator and advocate for responsible government.\nEarly years\nEdward Whelan was born in 1824 in Ballina, County Mayo, in Ireland.  At seven years old, he and his family moved to Halifax, Nova Scotia, in 1831.  Growing up in Halifax, he was greatly influenced by Joseph Howe, where he worked as a printing apprentice, as well as Father Richard Baptist O'Brien, a dynamic Irish priest who was a gifted orator as well as Whelan's teacher at St. Mary's School in Halifax.  These two influences led Whelan to abandon his studies at the age of 18 to take up a position as editor of The Register, an Irish-Catholic, Liberal newspaper.\nJournalism career\nEdward Whelan was a Canadian journalist who worked for a newspaper known as The Register whose target audience was Irish Roman Catholics.\nPolitical career\nIn August 1846, Whelan was elected as an assemblyman for St. Peters in Kings County.  He remained an assemblyman until the last year of his life but had sporadic attendance.  Critics of Whelan point out that his political voice lacked the passion and genius that was apparent in his printed work.\nIn the fall of 1846, Whelan sought to embark on yet another newspaper venture, namely the Examiner. This publication nearly failed, but he managed to keep it going.\nWhelan then devoted much of 1850 to speak at meetings regarding the concept of responsible government. This led to Whelan's rise in stature and in April 1851, Whelan was named to the Executive Council and also appointed the Queen's Printer.\nWithin this new government role, Whelan spent much of his time defending the major Liberal reforms regarding the Free Education Act, extension of the franchise, and the Land Purchase Act.  These Liberal reforms were not without controversy, and Whelan took the brunt of the criticism.\nConfederation\nIn 1864, the union of the British North American colonies was the topic of the day.  Though the Liberals were against confederation, Whelan supported confederation as he saw it as an opportunity for PEI to gain more control of its own affairs. Whelan was chosen to be one of the delegates to the Quebec Conference.  Attending this conference made Whelan an even stronger proponent.  Despite his advocacy, few politicians and residents were persuaded and Whelan became disillusioned.\nEnd of political career\nWhelan's stance on Confederation as well as other issues, led him to become isolated within the Liberal party. In the election of 1867, Whelan was defeated for the first time in 21 years.   There is no single cause for his defeat.  He had lost support from his traditional supporters by denouncing the Tenant League and Fenianism. Moreover, his support of Confederation was unpopular with the people of PEI. On all three of these issues, his opponent, Edward Reilly, had the edge.\nHowever, Whelan believed that the defeat came from the disapproval of the newly appointed cleric of St. Peters, Father William Phelan, a supporter of Reilly. Whelan felt that the clergy had unduly influenced the election.\nWhelan felt very bitter about this defeat and by the autumn of 1867 his health slowly got worse.  Whelan died on December 10, 1867.\nReferences"
    }
  ]
}