{
  "content": [
    {
      "type": "text",
      "text": "# Edward Wilson (actor)\n\n|birth_place=South Shields, County Durham, England\n|death_date=\n|death_place= Los Angeles, California, United States\n|occupation=Actor\n}}\nEdward William \"Ed\" Wilson, FRSA (13 July 1947 – 2 February 2008) was an English actor and the artistic director of the National Youth Theatre from 1987 to 2003; he later moved to Los Angeles.\nEarly life\nBorn in South Shields, County Durham, the son of Thomasina (née Moore), and William James Wilson, a pitman, he attended the local grammar school.\nWhile still a schoolboy, Wilson performed at the National Youth Theatre (NYT) in London during his summer holidays, having auditioned for its founder-director Michael Croft.\nEarly career\nAged 19, he established the South Shields Youth Theatre in his home town, performing in the Pier Pavilion Theatre to rave reviews from the local papers, though the town councillors were less impressed by his choice of \"kitchen sink drama\" repertoire.\nHe read English at Manchester University, then went to the NYT as an actor and director in 1965. During his time at the NYT he appeared in several television series: his most important television role was young Billy Seaton in 35 episodes of When the Boat Comes In (1976–1981).\nProductions and performances\nHis NYT production of Murder in the Cathedral by T.S. Eliot, performed in Christ Church, Spitalfields, St Pancras and Westminster Cathedral was widely acclaimed by audiences and praised by Eliot's widow. Ambitiously, he also arranged to take the production to Moscow Arts Theatre in 1989, where it was very well received.\nAfter the death of Michael Croft in 1986, Wilson took over the National Youth Theatre, becoming its second artistic director (1987–2003) and re-energising the company. There he auditioned and nurtured many notable talents, including Daniel Craig, Orlando Bloom, Catherine Tate, Jessica Hynes (Stevenson) and Little Britain stars Matt Lucas and David Walliams. Wilson also gave the now-celebrated theatre and film director Matthew Warchus his first chance at directing, when the NYT produced Coriolanus at the Glasgow Tram Shed Theatre in 1986.\nIn 1987 and 1988, he appeared in a regular role as DI Flight in two seasons of Rockliffe's Babies.\nWilson championed the musicals of Lionel Bart and brought about a revival of interest in his work with ambitious West End revivals of Blitz! (1990) and Maggie May (1992).\nAs a freelance, he was particularly adept at organising large-scale \"one-off' productions, including community productions in Newbury. He directed several of the Stonewall Equality Shows at the Royal Albert Hall, most recently Europride 2006.\nHis production of The Way of the Light was broadcast live by the BBC from St Paul's Cathedral. He directed the West End premiere of Nightshriek, a rock musical interpretation of Shakespeare's Macbeth by Trisha Ward, which won a Time Out Critics' Award (1986) for its teenage writer, beating such professional productions as The Phantom of the Opera and Les Misérables.\nThe success of Nightshriek led to a number of successful international collaborations between the NYT and the Spanish Shakespeare Foundation, including productions of Romeo and Juliet, Macbeth and Blood Wedding by Lorca, performed in London, Madrid and Valencia.\nHe was a determined and successful fund-raiser for the NYT, winning major sponsorship for the company on many occasions throughout his tenure as Artistic Director. The highlight was his successful bid for a National Lottery grant in 1996 (the NYT's 40th anniversary) which enabled the company to purchase its first permanent headquarters.\nAfter the NYT\nIn 2004 Ed Wilson was persuaded by Michael York (a former member of the NYT) to move to the US to lead the California Youth Theatre at the Ivar Theatre, Hollywood.\nIn his later life he became a devout convert to Roman Catholicism.\nWilson was diagnosed with cancer in 2007 and died at Cedars-Sinai Medical Center in Los Angeles.\nWilson's long-term personal and professional partner was Brian Lee (\"a supremely gifted stage designer\" – Bryan Forbes). Lee – who designed many of Wilson's stage productions – predeceased Wilson, dying of cancer in December 1994.\nHe was a Fellow of the Royal Society of Arts and had an honorary doctorate from the University of Sunderland.\nReferences"
    }
  ]
}