{
  "content": [
    {
      "type": "text",
      "text": "# Edward Green Bradford II\n\n| birth_place   = Wilmington, Delaware, US\n| death_date    =\n| death_place   = Clifton Heights, Pennsylvania, US\n| death_cause   =\n| resting_place =\n| resting_place_coordinates =\n| citizenship   =\n| nationality   =\n| party         =\n| otherparty    =\n| height        =\n| spouse        =\n| partner       =\n| relations     =\n| children      =\n| parents       =\n| mother        =\n| father        = Edward Green Bradford\n| relatives     =\n| residence     =\n| education     = Yale University (A.B.)read law\n| alma_mater    =\n| occupation    =\n| profession    =\n| known_for     =\n| salary        =\n| net_worth     =\n| cabinet       =\n| committees    =\n| portfolio     =\n| awards        =\n| signature     =\n| signature_alt =\n| website       =\n| footnotes     =\n}}\nEdward Green Bradford II (March 12, 1848 – March 30, 1928) was a United States district judge of the United States District Court for the District of Delaware.\nEducation and career\nBorn in Wilmington, Delaware, Bradford received an Artium Baccalaureus degree from Yale University in 1868 and read law to enter the bar in 1870. He entered private practice in Wilmington, and was an attorney for the levy court commissioners, in New Castle County, Delaware. He was a representative in the Delaware House of Representatives from 1880 to 1881, thereafter returning to private practice in Wilmington from 1881 until 1897, when he served as a delegate to the Delaware Constitutional Convention in 1897.\nFederal judicial service\nOn April 26, 1897, Bradford was nominated by President William McKinley to a seat on the United States District Court for the District of Delaware vacated by Judge Leonard Eugene Wales. Bradford was confirmed by the United States Senate on May 11, 1897, and received his commission the same day. He served in that capacity until his retirement on May 20, 1918.\nLater career and death\nFollowing his retirement from the federal bench, Bradford resumed private practice in Wilmington from 1918 to 1928. He died on March 30, 1928, in Clifton Heights, Pennsylvania.\nFamily\nBradford was the son of United States District Judge Edward Green Bradford, who previously held the same seat at the District of Delaware.\nReferences\nSources\n*\n|years=1897–1918}}"
    }
  ]
}