{
  "content": [
    {
      "type": "text",
      "text": "# Edward Bruce Williamson\n\nEdward Bruce Williamson (July 10, 1877  – February 28, 1933) was an American banker and amateur naturalist who took a special interest in the odonata. He has been considered one of the giants of North American dragonfly studies. He also took an interest in gardening and was involved in creating several hybrid irises. The rare dragonfly genus Williamsonia was named after him and it currently includes two species including Williamsonia fletcheri which was described by him in 1923.\nLife and work\nWilliamson was born in Marion, Indiana and grew up on a farm near Bluffton where he became interested in collecting birds' eggs and observing nature as a boy. He then went to Ohio State University and graduating in 1898 he worked as an assistant curator at the Carnegie Museum. He corresponded with Philip P. Calvert and specialized on the dragonflies. After a fallout with his superior at the Carnegie Museum, he taught briefly at a high school in Salem, Ohio. He became a fellow of the Vanderbilt University in 1900 working on zoology. In 1901 he worked as a zoology instructor alongside Clarence H. Kennedy at the University of Indiana, Winona Lake Field Station. He married in 1902 and worked as a cashier at the Wells County Bank in which his father Lent A. Williamson was a president. In 1905 he succeeded his father as president of the bank. His position at the bank allowed him to travel for collections. He published on odonate taxonomy from 1897, conducting his research in his spare time, sometimes with his cousin Jesse H. Williamson. He also collaborated with other naturalists in the region including the amateur botanist Charles Clemon Deam who owned a drugstore at 103 South Main Street just beside Williamson's bank. The hybrid oak known as Deam's oak was discovered by Williamson and his father in 1904 and studied by Deam and others. He also named a species of dragonfly, Celithemis martha, after the amateur entomologist Miss Mattie Wadsworth (1862-1943).  A school teacher R. Heber Howe Jr. (1875–1932) became keenly involved in odonate studies after corresponding with Williamson. The bank that Williamson worked in collapsed in 1928, in the period known as the Great Depression. During the depression years he made money growing irises on his farm. In 1930 he became an associate at the Museum of Zoology in Michigan, serving until his death.\nWilliamson collected dragonflies and damselflies across the US and South America. He also travelled to Burma and Thailand for collecting. He described 14 genera and 92 new species. His collection of nearly 50000 specimens included 310 types and are held at the University of Michigan Museum of Zoology. He also created several registered iris hybrids. In 1918 and 1919 he presided over the Indiana Academy of Sciences. He died of a stroke, leaving behind his wife Anna Tribolet and their foster daughters. The genus Williamsonia was erected by J. J. Davis in 1913. Known by the common name of boghaunter, the two elusive species in the genus, are among the most sought after dragonflies of North America. Michigan odonatologists named their newsletter as Williamsonia while another group in Vermont named theirs as The Boghaunter.\nReferences\nExternal links\n* [https://findingaids.lib.umich.edu/catalog/umich-bhl-0799_aspace_e9b05bb861ebd152edee41acdfa4aeff Archives]"
    }
  ]
}