{
  "content": [
    {
      "type": "text",
      "text": "# Edward Dana Durand\n\nEdward Dana Durand (October 15, 1871 –1960) was the Director of the United States Census Bureau from 1909-1913 under President William Howard Taft, and a chief economist for the Department of Commerce. He also taught at Harvard and Stanford.\nEarly life and education\nDurand was born in Romeo, Michigan and later settled in South Dakota with his family. His parents were Cyrus Yale Durand and Celia C. Day, while his great-grandmother was Eunice Yale of Lee, Massachusetts, sister of Rev. Cyrus Yale.\nHis brother Walter Yale Durand was a Harvard graduate, professor at Oberlin College and Phillips Academy, and assistant chief economist of the Federal Trade Commission, while his other brother, George Harrison Durand, was a graduate from Harvard and taught at Yankton College.\nEdward attended Yankton College for one year before transferring to Oberlin College. He received a Ph.D from Cornell University in 1896.\nCareer\nHe then moved to California and became an assistant professor in political economy and finance at Stanford University. From 1900 to 1903, he became a teacher in economics at Harvard University, then served as Secretary of the U.S. Industrial Commission. He became Deputy Commissioner of the Bureau of Corporations and was hired as a special expert on the Standard Oil investigation.\nPresident Taft appointed Durand to serve as Director of the United States Census Bureau in 1909. He held the position until 1913.\nFrom 1913 to 1917, Durand taught statistics and agricultural economics at the University of Minnesota after which he went on to work for the Commerce Department and the Tariff Commission.\nIn 1921, he helped Herbert Hoover as a consultant in economics for his administration as Secretary of Commerce. He then served as Chief of the Eastern European Division of the Bureau of Foreign and Domestic Commerce. From 1924 to 1929, he became Chief of the Division of Statistical Research in the Department of Commerce. Toward the end of his career, he occupied the posts of Statistical assistant to the Secretary of Commerce, Chief economist of the U.S. Tariff Commission and then commissioner.\nDurand retired from the Tariff Commission in 1952.\nReferences\nExternal links\n*"
    }
  ]
}