{
  "content": [
    {
      "type": "text",
      "text": "# Edward Russell, 2nd Baron Russell of Liverpool\n\nEdward Frederick Langley Russell, 2nd Baron Russell of Liverpool CBE, MC (10 April 1895 – 8 April 1981), known as Langley Russell, was a British soldier, lawyer, historian and writer.\nEarly life, family and education\nRussell was the son of Richard Henry Langley Russell, second son of Edward Russell, 1st Baron Russell of Liverpool, and succeeded his grandfather to the title in 1920. He was educated at Liverpool College and St John's College, Cambridge (1913–1914).\nMilitary service\nWorld War I\nHe left Cambridge to join the British Army soon after the outbreak of war. He served with distinction in the First World War, being awarded the Military Cross three times.\nLegal career\nHe was called to the bar at Gray's Inn in 1931, but never developed a substantial practice on the Oxford circuit. He developed a career in the Judge Advocate's office from the early 1930s.\nWorld War II\nHe became Deputy Judge Advocate General (United Kingdom) to the British Army of the Rhine in 1945. He was one of the chief legal advisers during war-crimes proceedings, for both the Nuremberg trials and the Tokyo tribunal, held following the end of the Second World War.\nHe was honoured with the CBE, Commander of the Order of the British Empire.\nWritings\nHe resigned from his government post over the publication of his book The Scourge of the Swastika: A Short History of Nazi War Crimes. The Daily Express, under proprietor Lord Beaverbrook, published extracts under the heading \"the book they tried to ban\" in 1954, and the book became a bestseller. Russell was accused of misusing his position to profit personally from the war crimes he had investigated.\nRussell followed up this work in 1958 with The Knights of Bushido: A Short History of Japanese War Crimes.\nIn 1959 he and Bertrand Russell, the celebrated mathematician and philosopher, sent a joint letter to The Times explaining that they were different people.\nA6 murder case\nLord Russell became involved in investigating the sensational A6 murder in rural Bedfordshire in August 1961 and the long-running debate that followed it.\nHe wrote the book ''Deadman's Hill: Was Hanratty Guilty? in 1965, which asserted wrongful conviction in the case. Lord Russell and his wife suffered significant harassment, in the form of frequent anonymous telephone calls, from Peter Louis Alphon, who had been an early suspect in the murder, before James Hanratty was found guilty and hanged in April 1962. Alphon was convicted and fined for this harassment, and his long-running involvement in the matter has remained controversial. This case has continued to attract significant interest, with several further books, articles and television programmes investigating it, with many asserting Hanratty's wrongful conviction, and some key aspects are still unclear.\nDeath\nLord Russell of Liverpool died in April 1981, a few days short of his 86th birthday, and was succeeded to the barony by his grandson Simon Russell, as his only son Captain the Hon. Langley Gordon Haslingden Russell had predeceased him.\nWorks\n* The Scourge of the Swastika: A Short History of Nazi War Crimes (1954) (Also translated into Yiddish in 1956)\n* Though the Heavens Fall (1956)\n* The Knights of Bushido: A Short History of Japanese War Crimes (1958)\n* That Reminds Me (1959)\n* ''If I Forget Thee: The Story of a Nation's Rebirth (1960)\n* The Record; The Trial of Adolf Eichmann for His Crimes Against the Jewish People and Against Humanity (1961)\n* The Royal Conscience (1961)\n* Knight of the sword: The Life and Letters of Admiral Sir William Sidney Smith (1962)\n* The Tragedy of The Congo (1962)\n* Prisons and Prisoners in Portugal: An Independent Investigation (1963)\n* Deadman's Hill: Was Hanratty Guilty? (1965)\n* Henry of Navarre; Henry IV of France (1969)\n* The French Corsairs (1970)\n* Bernadotte: Marshal of France & King of Sweden (1981)\nBooks in which Edward Russell, 2nd Baron Russell of Liverpool contributed a foreword or an introduction:\n* Harvest of Hate: The Nazi Program for the Destruction of the Jews of Europe by Leon Poliakov (1954)\n* The Urge to Punish: New Approaches to the Problem of Mental Irresponsibility for Crime by Henry Weihofen (1957)\n* Forgive, But Do Not Forget by Sylvia Salvesen (1958)\n* Commandant of Auschwitz: The Autobiography of Rudolf Hoess by Rudolf Hoess (1961)\nArms\n}}\nReferences\nSources\n*Kidd, Charles, Williamson, David (editors). Debrett's Peerage and Baronetage'' (1990 edition). New York: St Martin's Press, 1990.\n*"
    }
  ]
}