{
  "content": [
    {
      "type": "text",
      "text": "# Edward Natapei\n\n| predecessor         = Sato Kilman\n| successor           = Sato Kilman\n| president2          = Kalkot MataskelekeleMaxime Carlot Korman Iolu Abil\n| term_start2         = 22 September 2008\n| term_end2           = 2 December 2010\n| predecessor2        = Ham Lini\n| successor2          = Sato Kilman\n| president3          = John BaniRoger Abiut Alfred MasengRoger Abiut\n| term_start3         = 13 April 2001\n| term_end3           = 29 July 2004\n| predecessor3        = Barak Sopé\n| successor3          = Serge Vohor\n| office4             = Acting President of Vanuatu\n| primeminister4      = Donald Kalpokas\n| term_start4         = 2 March 1999\n| term_end4           = 24 March 1999\n| predecessor4        = Jean Marie Leye Lenelgau\n| successor4          = John Bani\n| birth_date          = 17 July 1954\n| birth_place         = Futuna Island, Tafea Province, New Hebrides\n| death_date          =\n| death_place         = Port Vila, Vanuatu\n| party               = Vanua'aku Pati\n| spouse              = Leipaki Natapei\n| caption             = Natapei in 2009\n}}\nEdward Nipake Natapei Tuta Fanua`araki (17 July 1954 – 28 July 2015) was a Vanuatuan politician. He was the prime minister of Vanuatu on two occasions, and was previously the minister of Foreign Affairs briefly in 1991, the acting president of Vanuatu from 2 March 1999 to 24 March 1999 (during a time in which he was the speaker of Parliament) and the deputy prime minister. He was the president of the Vanua'aku Pati, a socialist, Anglophone political party.\nPolitics\nNatapei was first elected to Parliament in 1983. In 1996, he was elected as speaker of Parliament, and in 1999 he was elected as President of Vanua'aku Pati. In a parliamentary vote on 25 November 1999, Natapei was a candidate for the position of prime minister, but was defeated by Barak Sopé, receiving 24 votes against 28 for Sope. When Sopé lost a vote of no confidence, Natapei became Prime Minister on 13 April 2001, receiving 27 votes in parliament, with one vote against him. He retained the position after the May 2002 election. Even though his party performed poorly in the July 2004 election, he was re-elected as a Member of Parliament for the Port Vila Constituency with the highest number of votes. He supported Ham Lini for the post of prime minister, but Lini was defeated; however, Serge Vohor was ousted in a motion of no confidence and Ham Lini was elected prime minister. Being Vanua'aku Party President entitled Natapei to the post of Speaker of the House, which he declined and referred to Sam Dan Avock, who was a Party Executive Member.\nNatapei became minister for Infrastructure and Public Utilities in the Lini-led government in July 2005. A split in Vanua'aku Pati was resolved in August 2005, and Natapei was re-elected as its president, receiving 124 votes against 67 for Sela Molisa. In late July 2007 he became Minister of Public Utilities again, replacing Serge Vohor, as well as becoming Deputy Prime Minister.\nSecond term as Prime Minister (2008–2011)\nNatapei was elected Prime Minister on 22 September 2008, by the Parliament of Vanuatu after three weeks of negotiations following the country's September 2nd general election. Natapei received 27 of the 52 votes in Parliament to become prime minister for a second time and a second non-consecutive term. He narrowly beat his nearest opponent, Maxime Carlot Korman, another former Vanuatu Prime Minister and the leader of the Vanuatu Republican Party, who captured 25 votes in Parliament. Natapei succeeded Ham Lini as prime minister and headed a new coalition government encompassing his own Vanua'aku Pati, as well as Lini's National United Party, independents and several smaller political parties, such as Namangi Aute.\nNatapei pledged to continue the policies and reforms of the outgoing Lini government. He announced that some of his government's primary policies would include transparency, good governance and fighting corruption.\nOpposition leader Maxime Carlot Korman attempted a vote of no confidence motion just two days after Natapei became prime minister. The Opposition, led by Korman, claimed that two MPs had defected from the Natapei coalition and were now supporting Korman. However, the Speaker of the Parliament George Wells rejected Korman's motion against Natapei on a technicality saying that one of the two MPs in question had not withdrawn their support for Natapei's government. A no-confidence vote was nevertheless held on 3 October 2008, but the motion was defeated, with 20 votes in favor and 31 votes against. Because Natapei's government won the vote by a substantial margin, it was expected that the political situation would be stabilized as a result. Nevertheless, another motion of no confidence was attempted on 25 November 2008; Natapei survived the vote by a narrow margin of 26 to 24. Three Vanua'aku Pati MPs signed the motion of no confidence, and after they refused to withdraw their signatures, Natapei suspended them from the party immediately prior to the vote.\nIn November 2009 Prime Minister Natapei, facing another vote of no confidence, organized a second major cabinet reshuffle. Natapei removed half of his cabinet members and cut ties with two political parties, the National United Party and the Vanuatu Republican Party, when it was revealed that the parties and their members were planning to launch a no confidence motion against his government.\nNatapei replaced the sacked cabinet members with sixteen members from the opposition Alliance. Among the highest profile reshuffles, Ham Lini, Natapei's predecessor and a member of the NUP, was replaced as Natapei's deputy prime minister by the leader of the Alliance bloc, Sato Kilman. In 2010 Maxime Carlot Korman was replaced as the Speaker of parliament by George Wells only for Kormanti to return later and succeed Wells in the position again . Alliance leader Sato Kilman confirmed that because of the reshuffle the Natapei government now had the support of 33 of the 52 MPs in the House.\nOn 27 November 2009, Natapei became ineligible to continue serving as prime minister. His parliamentary seat was declared vacant as he had missed three parliamentary sittings without informing the Speaker of the House. Despite being overseas on legitimate parliamentary business, his staff had failed to file the necessary paperwork with the Speaker to give notice of his absence. Serge Vohor became the acting prime minister. On December 5, however, Chief Justice Vincent Lunabek ruled that \"the Speaker’s decision to unseat the PM on 27 November 2009 was ‘unconstitutional and of no legal effect’\". On December 10, Parliament formally confirmed their confidence in Natapei, who thus remained Prime Minister.\nAs of June 2010 Natapei retained the prime ministership, with the support of 34 MPs (against 18 for the Opposition).\nOn December 2, 2010 Natapei was ousted by a vote of no confidence. He was succeeded by Sato Kilman.\nOn June 16, 2011 however, Chief Justice Vincent Lunabek ruled in a case put forward by Natapei, contesting the constitutionality of Kilman's election. Lunabek ruled that Kilman's election to office had indeed been unconstitutional, as \"[t]he speaker of Parliament Maxime Carlot Korman [had] appointed Mr Kilman prime minister without following article 41 of the constitution which required he be elected by secret ballot\". Kilman's premiership was annulled, and Natapei was restored as interim prime minister, instructed to convene Parliament for the election of a new prime minister. Natapei immediately indicated that he himself would not be a candidate for the position, and that he would support Serge Vohor's candidacy.\nDuring his interim premiership, Natapei cancelled Vanuatu's diplomatic recognition of Abkhazia, issued by Kilman the previous month.\nOn June 26, Parliament elected Sato Kilman to the premiership, with 29 votes to Serge Vohor's 23, thus ending Natapei's interim duties.\nFirst cabinet\nNatapei named his government's cabinet line-up on 22 September 2008, the day of his election as prime minister. His cabinet included members of his own Vanua'aku Pati (VP) as well as the National United Party (VNUP). Natapei's predecessor, outgoing Prime Minister Ham Lini, was named as the new Minister for Public Utilities and Works.\nNatapei's full cabinet included:\n* Bakoa Kaltongga as the Minister of Justice and Social Welfare (VP)\n* Sela Molisa as Finance Minister (VP)\n* Paul Telukluk as Lands Minister (Namangi Aute) (Telukluk is the lone member of Natapei's cabinet from Namangi Aute.)\n* Charlot Salwai as Minister of Education (Union of Moderate Parties)\n* Serge Vohor as Minister for Infrastructure & Public Utilities (UMP)\n* Sato Kilman as Deputy Prime Minister and Minister for Trade, Commerce and Industries (People's Progressive Party)\n* Moana Carcasses Kalosil as the Minister for Internal Affairs (Greens)\n* Moses Kahu as Minister of Health (VP)\n* Stephen Kalsakau as Minister of Agriculture\n* Joe Natuman as Minister of Foreign Affairs (VP)\n* Raphael Worwor as Minister of Youth, Development and Training (UMP)\nA few days before the motion of no confidence was debated in Parliament Prime Minister Natapei brought into the government side the Union Of Moderate Parties (UMP) and reshuffled his cabinet for the first time as follows:\n* Bakoa Kaltongga as the Minister of Foreign Affairs (VP)\n* Sela Molisa as Finance Minister (VP)\n* Joe Natuman as Minister of Health (VP) (Replacing Roro Sambo (VNUP))\n* Ham Lini as DPM and Minister for Justice and Social Welfare (Replacing Joshua Kalsakau)(VNUP)\n* James Bule as Minister for Trade, Commerce & Industries (VNUP)\n* Patrick Crowby as the Minister for Internal Affairs (VNUP)\n* Havo Moli  as Minister of Agriculture\n* Don Ken as Minister of Youth, Development and Training\n* Serge Vohor as Minister of Infrastructure and Public Utilities (UMP)\n* Raphael Worwor as Minister of Lands (UMP) (Replacing Joe Natuman)\n* Charlot Salwai as Minister of Education (UMP) (Replacing Willie Ruben Abel)\n* Esmon Saimon as Minister of Ni Vanuatu Business (Independent)\nLater career\nNatapei was Leader of the Opposition during Sato Kilman's premiership (2011–2013). On 21 March 2013, Kilman resigned, after eight of his MPs (including two government ministers) had crossed the floor to join the Opposition. Natapei backed Moana Carcasses Kalosil (leader of the Green Confederation) as the new prime minister, and Carcasses appointed him deputy prime minister and minister for foreign affairs on 23 March. As Minister for Foreign Affairs, he applied Carcasses' policy in beginning a clean-up of the sale of diplomatic passports by previous governments. Within his first few days in office, he revoked the passports of \"about ten\" diplomats who are understood to have bought them. In a review praised by Transparency International, he indicated that more than two thirds of the country's diplomats could lose their position, as their appointment had not followed proper procedures.\nNatapei lost office when the Carcasses government was brought down by a motion of no confidence on 15 May 2014.\nNatapei died on 28 July 2015 at the age of 61 following a long illness.\nReferences\nExternal links\n* [http://www.governmentofvanuatu.gov.vu Government of Vanuatu]  – official website\n* [http://www.pacificmagazine.net/news/2002/09/17/west-papua-2-vanuatu-promises-new-backing-for-west-papuans Pacific Magazine: Vanuatu promises new backing for West Papuans]\n* [https://web.archive.org/web/20160303170615/http://www.unmultimedia.org/tv/webcast/2010/09/vanuatu-general-debate-65th-session.html Prime Minister Natapei addresses] the United Nations General Assembly, September 27, 2010\n|years=1999}}\n|-\n|-\n|-\n|years=2011}}"
    }
  ]
}