{
  "content": [
    {
      "type": "text",
      "text": "# Edward Swayne\n\n| birth_place\t\t\t = Erith, Kent, England\n| death_date \t\t\t =\n| death_place \t\t\t = Brisbane, Queensland, Australia\n| restingplace    \t\t =\n| birthname    \t\t\t = Edward Bowdich Swayne\n| spouse\t\t\t = Margaret Ellen Thompson, Olive Lilian Kay\n| party \t\t\t = Country and Progressive National Party\n| otherparty       \t\t = Opposition, Ministerial, Liberal, National, Northern Country Party, Country Party\n| relations\t\t\t =\n| residence\t\t\t =\n| alma_mater \t\t\t =\n| occupation\t\t\t = Farmer\n| profession\t\t\t =\n}}\nEdward Bowdich Swayne (4 December 1857 – 15 June 1946) was a member of the Queensland Legislative Assembly.\nBiography\nSwayne was born in Erith, Kent, the son of Herbert Wigan Swayne (1819–1891) and his wife Eugenia Keir (née Bowdich) (1823–1875). When he arrived in Queensland he took up farming.\nHe was married twice, first to Margaret Ellen Thompson (1867–1915) whom he married in Mackay, and then he married Olive Lilian Kay (1890–1960) in Brisbane. He died in Brisbane in June 1946 and was cremated at the Mount Thompson Crematorium.\nEdward had five children from his first marriage John Bowdich Swayne (1894–1971), Ellen Eugenia Swayne (1895–1964), Florence May Swayne (1897–1946), Edward Vincent Hay Swayne (1899–1970) and Wallis Eric Swayne (1905–1994).\nPublic career\nSwayne represented several political parties during his time in parliament including the Opposition Party, the Ministerialists, Liberal, National, the Northern Country Party, the Country Party, and the Country and Progressive National Party. He started in politics as a councilor in the Pioneer Shire Council.\nHe won the seat of Mackay in the Queensland Legislative Assembly, representing the electorate with Walter Paget at the 1907 Queensland state election. He held Mackay until the 1912 election when it became a one seat constituency and he then was elected to the new seat of Mirani. He remained the member for that seat until 11 May 1935 when he retired from politics.\nStreet name\nA number of street names in the Brisbane suburb of Carina Heights are identical to the surnames of former Members of the Queensland Legislative Assembly. One of these is Swayne Street.\nReferences"
    }
  ]
}