{
  "content": [
    {
      "type": "text",
      "text": "# Edward Rogalski\n\n}}\nEdward Rogalski (born February 16, 1942) is an American religious leader who was the 12th president of St. Ambrose University in Davenport, Iowa, from 1987 to 2007. In 1968, Rogalski became president of St. Ambrose University in 1987. From 1974 to 1980, Rogalski was St. Ambrose’s vice president for administration, and from 1981 to 1986, the institution’s senior vice president. He served as executive vice president at the time of his appointment to the presidency. Throughout his career at the university, Rogalski has also been a member of the faculty in the Department of Education. He holds the rank of professor.\nBiography\nA native of Manville, New Jersey, Rogalski received his Bachelor of Arts degree from Rutgers University, with majors in social sciences and education. He earned his master's degree in student personnel administration and the doctor of philosophy degree in higher education from the University of Iowa.\nRogalski is on the board of directors of US Bank, Genesis Health System, the Handicapped Development Center, and the Scott County Family Y. He has been chairman of the board of directors of the Genesis Health System, president of the Davenport Rotary Club, chairman of DavenportOne, vice chair of the Davenport Civil Rights Commission, on the board of directors for Big Brothers/Big Sisters and on the board of directors for Junior Achievement.\nHe is also past chair and member of the executive committee of the Iowa Association of Independent Colleges and Universities (IAICU) and past chair and member of the executive committee of the Iowa College Foundation. He has been a board member and commissioner on State Policy for the National Association of Independent Colleges and Universities, a member of the Phi Delta Kappa Education Society, and consultant to the Marriott Corporation Educational Division.\nRogalski has been named a Knight of St. Gregory and named an Outstanding Business Leader by Seabury and Smith. He is also a member of the Holy Family Church, an extraordinary minister of Holy Communion, and past president of the parish council. He was awarded an honorary doctorate from Loras College in 1990. Rogalski and his wife, Bobbi, have five sons.\nReferences"
    }
  ]
}