{
  "content": [
    {
      "type": "text",
      "text": "# Edward A. Burdick\n\n| birth_place        = Vernon Center, Minnesota\n| death_date         =\n| death_place        =\n| restingplace       =\n| restingplacecoordinates =\n| birthname          = Edward Arthur Burdick\n| nationality        =\n| party              =\n| otherparty         =\n| spouse             =\n| partner            =\n| relations          =\n| children           =\n| residence          =\n| alma_mater         =\n| occupation         =\n| profession         =\n| cabinet            =\n| committees         =\n| portfolio          =\n| religion           =\n| signature          =\n| signature_alt      =\n| website            =\n| nickname           =\n| allegiance         = United States\n| branch             = Army\n| serviceyears       = 1951–1952\n| rank               =\n| unit               = 135th Infantry Regiment\n| commands           =\n| battles            =\n| awards             =\n}}\nEdward Arthur Burdick (December 26, 1921 – March 9, 2011)[http://www.house.leg.state.mn.us/hinfo/sessiondaily.asp?storyid=2509 Session Daily – Former Chief Clerk Ed Burdick passes away – Minnesota House of Representatives]  was a nonpartisan former chief clerk and parliamentarian of the Minnesota House of Representatives and the past national president of the American Society of Legislative Clerks and Secretaries (ASLCS).[http://news.minnesota.publicradio.org/features/2005/01/10_khoom_burdick/ MPR: Lawmakers honor the \"real\" speaker of the House]\nBurdick served the citizens of the State of Minnesota more than 60 years until his \"final\" retirement from the legislature in 2005.[http://www.leg.state.mn.us/lrl/histleg/officer.asp?position=chiefclerk Minnesota Legislative Reference Library – Chief Clerks of the House of Representatives, 1849-Present] According to Minnesota Public Radio and the Board of Commissioners of Blue Earth County in Minnesota, Burdick introduced 80,953 bills and 23,268 were signed into law by the Governor. Former Governor Tim Pawlenty characterized Burdick as \"a Minnesota icon and a Minnesota institution\" for his legendary service to the nation.[http://www.house.leg.state.mn.us/hinfo/sessiondaily.asp?yearid=2005&storyid=316 Session Daily – Honoring Edward A. Burdick – Minnesota House of Representatives]  Burdick was nationally known as the \"Dean\" of parliamentary procedures and legislative affairs. To recognize and honor his public service, the Minnesota Legislature erected a bronze bust of Burdick in the State Capitol at his \"first\" retirement in 1994.\nEarly education and family newspapers\nBurdick was born in Vernon Center in southern Minnesota. He attended the Vernon Center Grade School, the Garden City High School, and the Mankato Commercial College in Minnesota. He worked in the country newspaper business as his parents operated weekly newspapers at Vernon Center, Good Thunder, and Amboy in Blue Earth County, Minnesota. He was a Sunday school teacher and a Boy Scout leader.\nHis childhood dream of owning a newspaper suddenly changed when he later discovered the opportunity and excitement of public policymaking in legislative sessions at the Minnesota State Capitol in St. Paul. In 1941, he left his parents Harold L. and Carrie M. Burdick in Vernon Center, Minnesota for St. Paul.\nA former journalist and experienced editor, Burdick authored a booklet entitled A Few of My Favorite Anecdotes, a collection of short stories based on his public service and newspaper career. He also edited several books including Glocalization, TRADE for PEACE, and Commercial Providence.\nLegislative and military service\nDuring the 1941 legislative session, Burdick was employed as a page by the Minnesota House of Representatives in St. Paul and that experience led to a full-time public service career. He worked for the legislature on a part-time basis in various capacities until 1957.\nWhen not working at the State Capitol he worked for the U.S. Department of Commerce in 1949–50 and the Minnesota Department of Military Affairs in 1953–57 at Mankato. He also served as the executive director of the Legislative Building Commission in St. Paul in 1957–65 and traveled widely in the State.\nHe served in the 135th Infantry Regiment of the Minnesota Army National Guard from 1951 to 1952 during the Korean War era. In 1951, he was a corporal at Camp Rucker, Alabama and his military duty prevented him from attending the legislative session that year, the only time he missed one in his career.\nHonors and awards\nAs the longest-served chief clerk in the nation, Burdick was recognized as the national authority on parliamentary procedure and legislative process. Minnesota House Minority Leader Matt Entenza (DFL-St. Paul) said: \"Ed, you are our rock star\" in \"the Star of the North\" (Minnesota).\nOther praise for Burdick came from both Republican and Democratic leaders, including former Governor Tim Pawlenty, House Speakers Steve Sviggum, Rod Searle, David Jennings, Dee Long, Robert Vanasek, Phil Carruthers, Martin Sabo, and Irv Anderson as well as former Senate Majority Leader Dean Johnson and Honorable Kathleen Blatz, chief justice of the Minnesota Supreme Court. Popularly known as the \"Voice of Minnesota,\" Edward Burdick \"is quintessentially Minnesotan and [he] is the spirit of the Minnesota House of Representatives,\" concluded Republican Representative Ron Abrams of Minnetonka.\nElected national president of the American Society of Legislative Clerks and Secretaries (ASLCS) in 1971, Burdick received many accolades during his legislative, military, and public service career. Some of which included the Joseph Beek Distinguished Service Award (1983), the Lloyd Short Public Service Award (1985), the National Conference on State Legislatures’ Legislative Staff Award (2002), and the ASLCS Service Award (2003). In 2010, the Minnesota Legislative Society honored Edward Burdick and his counterpart in the Minnesota Senate, Patrick Flahaven, with the Elmer Anderson Award for their years of public service to the State of Minnesota.\nGovernor Tim Pawlenty proclaimed January 10, 2005 as \"Edward A. Burdick Day\" in Minnesota and President George W. Bush wrote on March 14, 2005, that \"our Nation is deeply indebted\" for his military and public service. In his congratulations on Burdick's \"retirement after 62 years of government service, including 38 years as chief clerk for the Minnesota House of Representatives,\" President Bush said, \"Laura and I send our best wishes for many years of happiness\" in the sun-setting chapter of his philanthropic, patriotic, and legendary public service career as a great American statesman.\nIn October, 2012 the annual Edward Burdick Legislative Award was established at the Hubert Humphrey School of Public Affairs at the University of Minnesota. ASLCS also established a Memorial Scholarship honoring its former President Burdick for its associate members in all 50 states.\nReferences\nExternal links\n*[http://www.house.leg.state.mn.us/ Minnesota House of Representatives]\n*[https://web.archive.org/web/20120630030205/http://www.ncsl.org/ National Conference on State Legislatures]\n*[http://mn.gov/governor/ Office of the Governor, Minnesota]\n*[http://www.senate.leg.state.mn.us/ Minnesota Senate]\n*[http://www.umn.edu/ University of Minnesota]"
    }
  ]
}