{
  "content": [
    {
      "type": "text",
      "text": "# Edward Costello (politician)\n\n|birth_place        = Thane's Creek, Queensland, Australia\n|death_date         =\n|death_place        = Warwick, Queensland, Australia\n|restingplace       =\n|birthname          = Edward Costello\n|nationality        = Australian\n|party\t\t        = Country and Progressive National Party\n|otherparty         = Country Party\n|spouse             = Ruth Evelyn Harn (m.1924 d.1969)\n|known_for          =\n| occupation        = Soldier, Grazier\n| relations         =\n| alma_mater        =\n}}\nEdward Costello (7 February 1883 – 27 June 1967) was an Australian soldier and grazier. He was a Member of the Queensland Legislative Assembly.\nEarly days\nCostello was born in Thane's Creek near Warwick, Queensland, to parents James Costello, and his wife Elizabeth Mary (née Ham). The Costello family took up mining grazing leases at Thanes Creek in 1881.  Costello was educated at Thane State School. He followed in his father's footsteps in becoming a grazier.\nMilitary service\nSoon after the outbreak of World War I he joined the military and was the commanding officer of the 25th Battalion in the Australian Military Forces and a major of the 11th Light Horse Regiment.\nHe was awarded the Distinguished Service Order for bravery during the Battle of Semakh, on the Sea of Galilee on the 25 September 1918. This action was claimed to be the only charge ever made by the British Cavalry before daylight. In 1919 he was the Chairman of the Military Courts for the Egyptian Rebellion.\nPolitical career\nIn 1920, Costello, as a Country Party  candidate, won the seat of Carnarvon in the Queensland Legislative Assembly. In 1925 the party merged into the Country and Progressive National Party and Costello held Carnarvon until his defeat in 1935.\nPersonal life\nIn 1924 his family purchased Seagoe, a grazing property at Thane. In 1924, Costello married Ruth Evelyn Harn (died 1969) and together had two sons and two daughters. He was a stalwart of the RSL Warwick Subbranch and a former patron of the Spurs and Feathers Club. He was a Presbyterian.\nCostello died at Warwick in 1967 after suffering a long illness.\nReferences"
    }
  ]
}