{
  "content": [
    {
      "type": "text",
      "text": "# Edward Perceval\n\nMajor General Sir Edward Maxwell Perceval  (13 August 1861 – 26 November 1955) was a British Army officer.\nMilitary career\n, GOC I Corps, confers with Major General Charles Monro, GOC 2nd Division, in a street in France, August 1914. On the far right is Brigadier General J. Gough, Haig's BGGS, talking to Brigadier General E. M. Perceval, BGRA 2nd Division.]]\nEducated at Royal Academy, Gosport and the Royal Military Academy, Woolwich, Perceval was commissioned into the Royal Artillery as a subaltern, with the rank of lieutenant, on 19 May 1880. He was promoted to captain on 15 August 1888 (later amended to 4 August) and major on 23 February 1898.\nHe attended the Staff College, Camberley as a student from January 1895. From January 1897 onwards he served at the Royal Military Academy as an instructor.\nHe saw action in the Second Boer War, which began in October 1899, for which he was awarded the Distinguished Service Order (DSO).\nAfter the end of the war, he returned once more to the Royal Military Academy, this time in the role of a professor. Following this, he served a temporary appointment as a deputy assistant adjutant general before becoming a DAAG at army headquarters. In November 1905 he was promoted to lieutenant colonel and, in May 1908, after being seconded for service on the staff, he took over the post of DAAG at the Staff College, Camberley from Lionel Stopford, and received a promotion to brevet colonel in November that year. In March 1909 he succeeded Walter Braithwaite as a general staff officer, grade 1 (GSO1) at the Staff College. In December of that year he was promoted to colonel.\nAfter serving on the half-pay list, from May 1912, Perceval was then appointed to be assistant director of movements at the War Office in London in October. In April 1914 he relinquished this position in order to become commander, Royal Artillery (CRA) of the 2nd Division. With the new position came a promotion to the temporary rank of brigadier general.\nHe deployed to France with the division, which formed part of the British Expeditionary Force (BEF), in August 1914, shortly after the start of the First World War. He remained in this role until January 1915 when he took over the post of sub-chief of the general staff from Lieutenant General Sir Henry Wilson at the BEF's general headquarters (GHQ). In February he was made a Companion of the Order of the Bath (CB), \"in recognition of the meritorious services\". In June he was promoted to the rank of major general and, in July, he became general officer commanding (GOC) of the 49th (West Riding) Division, a Territorial Force (TF) formation which had recently arrived on the Western Front, which he would command for over two years. Perceval commanded the 49th Division during significant battles, including the Battle of the Somme in 1916 and the Battle of Passchendaele (Third Ypres) in 1917. The division suffered heavy casualties during these battles, particularly during the attack on 3 September 1916, where fatigue and heavy shellfire contributed to the failure of the assault. He was awarded the Order of Leopold, \"for distinguished services during the Campaign\", by the Belgian government. After falling ill, he returned to Britain to become GOC of the 68th Division in December 1917.\nHe was appointed to the Military Order of Aviz, 1st Class in October 1918.\nAfter that he became commander of the troops at Shorncliffe Army Camp in 1919. He retired from the army in April 1920. He was made a KCB in January 1922.\nFamily\nIn 1894 he married Marian Bowles; they had one son. After his first wife died in 1896, he married Norah Mayne in 1906; they had one son and one daughter.\nReferences\n|-"
    }
  ]
}