{
  "content": [
    {
      "type": "text",
      "text": "# Edward Weismiller\n\n| birth_place      =\n| death_date       =\n| death_place      =\n| resting_place    =\n| occupation       =\n| language         =\n| nationality      = American\n| citizenship      =\n| education        =\n| alma_mater       =\n| period           =\n| genre            = poetry\n| subject          =\n| movement         =\n| notableworks     =\n| spouse           =\n| partner          =\n| children         =\n| relatives        =\n| awards           =\n| signature        =\n| signature_alt    =\n| years_active     =\n| module           =\n| website          =\n| portaldisp       =\n}}\nEdward Ronald Weismiller (August 3, 1915 Monticello, Wisconsin - August 25, 2010 Washington, D.C.) was an American poet, scholar and professor of English, George Washington University. .\nLife\nHe was raised in Wisconsin and Vermont. In 1936, the twenty-year-old Edward Weismiller became the youngest poet to win the prestigious Yale Series of Younger Poets prize.\nHe graduated from Cornell College in 1938, from Harvard University with a master’s in 1942, and from Oxford University, with a D.Phil. in 1950, where he was a Rhodes scholar.\nProfessor Weismiller, an eminent scholar of John Milton’s poetry, came to\nWashington, DC in 1968 to study original source materials in the Folger\nLibrary, and stayed on to teach in the English department of the George\nWashington University. After his retirement in 1980 he remained there,\nreveling in the city’s beauty, variety, and cultural ferment. He was in\nlove with words and stories and had a gift for making and keeping friends.\nAn inspiring teacher, he worked to instill the love of beautiful and\nprecise language in his students, and many of them went on to success as\nwriters, artists, actors, teachers.\nWeismiller was proud of what he called a nice American success story. His\nfather, Jacob Weismiller, came of German-Swiss stock; his mother, Georgia\nWilson, was of Scottish descent. Young Edward grew up inventing word games\nand creating crossword puzzles for his sister Jean. The family lived on a\ntiny farm in rural Wisconsin and the children went to a small country\nschool where Edward won good grades from his teachers and attacks from a\nbully. His mother died when he was 11, shattering the family. Two years\nlater, taken in by his older sister Luverne, he began doing better in high\nschool and writing songs and poetry. Gently guided by his brother-in-law,\npaper chemist  Westbrook Steele, he won scholarships to Swarthmore and then\nto Cornell College in Iowa,  where he fell in love with Milton’s poetry and\nbegan to publish his own. At age  20 he became the youngest Yale Younger\nPoet when his first book of poems, The Deer Come Down, was selected for\npublication by series editor Stephen Vincent Benet.\nIn 1936 he was awarded a Rhodes Scholarship to Oxford, soon interrupted\nwhen England and Germany declared war. Repatriated with the other U.S.\nstudents, he earned his master's degree and taught at Harvard, where he\nfounded lifelong friendships with some of the best poets and writers of his\ngeneration. A sojourn at Yaddo nourished his talent. He also met and\nmarried Frances Merewether Power of Redlands, California, a budding poet\nand journalist; their first child was born in 1942. He translated\na prize-winning French novel, The Young Concubine, and began his second\nbook of poems, The Faultless Shore, published after the war, in 1946.\nWhen the U.S. joined the European war, Weismiller’s life took an\nastonishing  twist. In a midnight phone call from the new Office of\nStrategic Services (OSS),  he was recruited for counterespionage. (He never\nknew who had recommended him.) He chose to earn his required commission and\nstartle his friends—and the Commandant—by joining the Marine Corps. On\ndetached service in Europe, he was trained by the British secret services\nMI5 and MI6 and watched the terrible beauty of firebombs falling on the\nroofs of London. Deployed to Cherbourg, France, after D-Day, he became the\nfirst American officer to run a captured enemy agent back against the\nGermans. Eventually he was put in charge of counterespionage in the\nAmerican Zone in  occupied Germany. He was awarded a  Bronze Star and the\nMédaille de la Reconnaissance française. When he turned in his final\nreport, he was told that it was so highly classified that he would never\nsee it again. (He later heard that the British, apparently less secretive,\nwere using their copy in counterespionage training.)\nAfter the war Weismiller declined an invitation to join the newly formed\nCIA, which succeeded the OSS; instead he went home to his family in\nSouthern California and commenced work on his novel, The Serpent Sleeping,\nsustained by a Guggenheim writing fellowship. In 1948 the Rhodes Trust\ninvited back the scholars whose time had been cut short by the war,\nallowing them to bring their new families, so he earned his doctorate from\nOxford. He went on to teach poetry, creative writing, and Milton at Pomona\nCollege. Over the years four more children were born.\nIn 1968, now divorced, he came to Washington and began a new phase of life.\nHis third book of poems, The Branch of Fire, was published in 1970, and he\nwas invited to give a reading of his poems at the Library of Congress in\n1979. After retiring in 1980 he continued to write and reap honors. He\ncontributed to the Princeton Encyclopedia of Poetry, was an editor of the\nVariorum Milton series (a compendium of the best modern scholarship), and\nreceived the 2001 Robert Fitzgerald Award for lifetime contribution to the\nstudy of metrics and versification. In 2002, at age 87, he became the\noldest Yale Younger Poet when the press published Walking Toward the Sun,\nwith a foreword by W. S. Merwin (then U.S. poet laureate).\nWeismiller always saw himself as a citizen soldier, not professional\nmilitary, but his service affected him deeply. The war’s ambience and human\nlessons permeated his 1962 novel, The Serpent Sleeping, recently\nrepublished in a British series of classic spy novels. FOIA requests by\nhistorian Tim Naftali got his final OSS report declassified, setting off a\nmuch-enjoyed series of interviews with historians and popular writers on\nwhat his war was really like. Weismiller had been one of the few Marines\nstationed in Europe; most were in the South Pacific. His unusual situation\neventually yielded a bonus: a White House invitation to attend the 50th\nanniversary celebrations of V.E. Day, traveling to England, France, Prague,\nand all the way to Russia in a special tour with distinguished veterans\nfrom all the services, then-Vice President Gore, and then-Secretary of the\nArmy Togo West.\nHis work has appeared in Kenyon Review and The Atlantic.\nIn 1941, Random House hired Weismiller, then a 26-year-old student, to translate the first award-winning novel of Franco-Khmer poet Makhali-Phal into English. La Favorite de dix ans was published in New York in 1942 as The Young Concubine. In 2008, Professor Weismiller began advising a literary team working to produce an updated version of his original translation incorporating cultural background material unavailable in 1941.\nHe lived in Washington, D.C. until his death on August 25, 2010, at 95.\nAwards\n* 2001 Robert Fitzgerald Prosody Award\n* 1936 Yale Series of Younger Poets Competition\n* 1943 Guggenheim Fellowship\n* Rockefeller Foundation grant\n* National Endowment for the Humanities grant\nWorks\n*[http://www.slate.com/id/33217/ \"Poem\", Slate,  August 25, 1999]\n*[http://www.slate.com/id/31194/ \"Letter Found Blown Against a Fence\", Slate,  June 30, 1999]\n* The Deer Come Down, Yale University Press, 1936\n* The Young Concubine, Random House, 1942 (As translator of La favorite de dix ans by Makhali-Phal)\n* The Faultless Shore, Houghton Mifflin Co., 1946\n*\n*\nNovels\n*\nAnthologies\n*\n* Poets of World War II, Harvey Shapiro (ed.) \"To the Woman in Bond Street Station\",\nReferences"
    }
  ]
}