{
  "content": [
    {
      "type": "text",
      "text": "# Edward Pilgrim\n\nEdward Alexander Pilgrim (12 December 1904 – 24 September 1954) was a British homeowner whose suicide was hastened by bureaucracy.  He was a working class individual with a slight education who worked as a milkman before marrying his wife, Margaret, in 1931. In 1949, he moved to Marlborough Road in Romford and worked as a tool maker for ten pound sterling a week.  He took out a ten-year mortgage on his house to purchase a 2,200&nbsp;square metre lot next to his house to use as a buffer zone between himself and neighboring development, paying £400 for the lot.\nWhat Pilgrim did not know was that the Town and Country Planning Act 1947 had allowed local councils to purchase lands for development for current usage values. Thus, fallow land (and specifically empty lots such as his buffer) would be purchased for its potential value in agriculture rather than its value as housing or commercial space. Owners of empty land could lodge a claim to request compensation for lost development rights, but only if they did so before July 1949. The previous owner of Mr. Pilgrim's lot had not lodged such a claim and had sold to avoid having to take what the council would offer. Indeed, when Romford council began its Mawney Road housing development in July 1952, they offered Pilgrim only £65 for the lot &ndash; a value that was confirmed by the assayer.  Pilgrim, however, did not even know of the offer (and purchase) by the government until the project began, and he did not appeal until February 1954, when construction on the site actually began.  The Romford council had a housing waiting list of 1,600 people, and so it would not remove Mr. Pilgrim's lot from its scheme.  They determined that he was merely an imprudent land speculator who had not bothered to inform himself of the legal issues surrounding his purchase.\nPilgrim tried to reach the Housing Minister Harold Macmillan, the prime minister Winston Churchill, and the Queen.  Macmillan's civil servants agreed with the local council that Pilgrim was simply a man who had not done due preparation.  A Unity housing high rise went up on Pilgrim's lot, until, according to Pilgrim, it blotted out the sun and he needed electric lights even on sunny days.  The lot that he had purchased to ensure a natural buffer was now, in fact, destroying both his view and his quiet. On 24 September 1954, after a weekend of depression, he hanged himself in a tool shed on the disputed land.\nThe Daily Express newspaper made Pilgrim's suicide a cause célèbre and campaigned to have it remembered.  The Crichel Down scandal was also in the news at the time, and Winston Churchill accused Harold Macmillan of killing Pilgrim.  A revision of the Town and Country Planning Act in 1954 included a \"Pilgrim clause\" which allowed future land owners in Pilgrim's place to be compensated.  The local council in Romford offered Mrs. Pilgrim £335 (to be added to the £65 already paid to equal the original purchase price), but this left her still paying interest on the loan.\nThe story of Edward Pilgrim has become an archetype for the well-intentioned abuses of bureaucracy, especially in the United Kingdom.  The figure of Arthur Dent in Douglas Adams's ''The Hitchhiker's Guide to the Galaxy, for example, repeats numerous details of the Pilgrim story.  The character of Harry Buttle/Harry Tuttle in the Terry Gilliam film Brazil also suggests some of the same disquiet with self-satisfied bureaucracy that Pilgrim experienced.\nReferences\n* Davis, John.  \"Edward Alexander Pilgrim,\" in Matthew, H.C.G. and Brian Harrison, eds.  The Oxford Dictionary of National Biography.''  vol. 44, 310–311.  London: OUP, 2004."
    }
  ]
}