{
  "content": [
    {
      "type": "text",
      "text": "# Edward Foote\n\n}}\n|birth_date=20 April 1767\n|death_date= 23 May 1833\n|birth_place= Bishopsbourne, Kent\n|death_place= Southampton, Hampshire\n|image=Vice-Admiral Sir Edward James Foote (1767-1833).jpg\n|caption=\n|nickname=\n|allegiance=  United Kingdom\n|serviceyears= 1780&ndash;1815\n|rank= Vice-Admiral\n|branch= 22px Royal Navy\n|commands=\n|unit=\n|battles=\n* American Revolutionary War\n** Battle of Dogger Bank\n** Battle of the Saintes\n* French Revolutionary Wars\n** Battle of Cape St. Vincent\n** Capture of Sensible\n* Napoleonic Wars\n|awards=Knight Commander of the Order of the Bath\n|laterwork=\n}}\nVice-Admiral Sir Edward James Foote, KCB (20 April 1767 &ndash; 23 May 1833) was a prominent Royal Navy officer during the late eighteenth and early nineteenth centuries. He served on a number of ships and at several actions, but is best known for becoming caught up in the aftermath of the collapse of the Parthenopean Republic at Naples in 1799. Foote had already signed a convention with rebel leaders assuring their safety when he was overruled by Lord Nelson. As a result, most of the rebels, including women, were executed. Nelson was heavily criticised for his role in the executions, but Foote failed to protest the decision until many years later, once Nelson was dead. This overshadowed his career and he did not serve in a position of responsibility again. He commanded the royal yacht during most of the Napoleonic Wars, and although he was knighted and continued to rise through the ranks post-war he did not see active service. He died in 1833 in Southampton.\nLife\nEdward Foote was born 20 April 1767 in Bishopsbourne, the son of Francis Hender Foote, a barrister turned priest, and his wife Catherine née Mann. His maternal uncle was Horatio Mann, a noted politician and cricketer. In 1779, Foote joined the Royal Navy Academy in Portsmouth and the following year was commissioned aboard  during the American Revolutionary War. Later in 1780, Foote transferred from Dublin to the frigate  and in 1781 served at the Battle of Dogger Bank against the Dutch. In the aftermath of the battle he moved again, joining the frigate  under Captain James Gambier and observing the Battle of the Saintes in April 1782. Following the end of the war in 1783, Foote served on several ships as a lieutenant before joining  under Captain William Cornwallis in the East Indies in 1788.\nWhile stationed in the East Indies, Foote was promoted to commander and took over the sloop , returning to Europe in 1792 in command of . In June 1794, Foote was promoted to post captain and was given the frigate . Niger served with the Channel Fleet until 1796, when it sailed to join the Mediterranean Fleet under Vice-Admiral Sir John Jervis. Niger was one of the fleet scouts at the Battle of Cape St. Vincent in February 1797 and returned to Britain the following year. After a period attending King George III at Weymouth, Niger returned to Spithead and Foote, by royal request, was transferred to the larger frigate . Once again attached to the Mediterranean Fleet, Seahorse was one of the ships sent to reinforce the fleet under Rear-Admiral Sir Horatio Nelson prior to the Battle of the Nile. Foote was unable to find Nelson before the battle, but did encounter and capture the French frigate Sensible at the action of 27 June 1798.\nAfter the battle of the Nile, Seahorse was attached to the blockade of Alexandria before transferring to Naples early in 1799. A French invasion of the Kingdom of Naples had overthrown the Neapolitan government and erected the Parthenopean Republic instead, run by disaffected Neapolitans. On 22 June, under pressure from Russian and Turkish forces, the rebels surrendered and Foote, as the senior British officer present signed a treaty promising that the rebels could have free passage to France if they handed over the city and its forts without a fight. However, once the rebels had embarked ships ready for transport, Nelson arrived and repudiated the treaty. The rebels were handed over to King Ferdinand IV and mass executions followed. In breaking the treaty, Nelson broke Foote's word and the admiral was heavily criticised in Britain for his actions. Foote however failed to protest at his commanding officer's decision and remained a faithful follower of Nelson.\nSeahorse subsequently returned to Britain and then back to the Mediterranean, where Foote helped transport troops and General Ralph Abercromby for the 1801 invasion of Egypt. At the Peace of Amiens, he was again summoned by royal request and became captain of King George III's royal yacht Princess Augusta. Foote remained in command of the royal yacht until 1812, when he was promoted to rear-admiral. Failing to secure an active deployment, Foote was briefly second in command at Portsmouth in 1814 but in 1815 entered semi-retirement at the end of the war. Following Nelson's death in 1805, Foote had finally spoken out about the situation at Naples, criticising Nelson heavily for his conduct. Foote subsequently retired to his home near Southampton, and although he continued to rise through ranks, becoming a vice-admiral in 1821 and a Knight Commander of the Order of the Bath in 1831, he did not serve at sea again. He was married twice and had a number of children from both marriages. He died in May 1833 at his home.\nNotes\nReferences\n*\nExternal links\n*\n*\n*"
    }
  ]
}