{
  "content": [
    {
      "type": "text",
      "text": "# Edward Marshall Boehm\n\nEdward Marshall Boehm (August 21, 1913 &ndash; January 29, 1969) was an American figurative expressionist sculptor, known for his porcelain figures of birds and other wildlife. Boehm explained his choice of porcelain as the medium for his art as follows:\"Porcelain is a permanent creation. If properly processed and fired, its colors will never change; and it can be subjected to extreme temperatures without damage. It is a medium in which one can portray the everlasting beauty of form and color of wildlife and nature.\" He and his wife founded an eponymous company, E.M. Boehm Studios, in 1950.\nBiography\nEdward Marshall Boehm was born in Baltimore, Maryland in 1913. His surname is pronounced \"Beam\".\nHis parents separated before his birth. His mother, Elsie, died when he was seven years old. (He did not meet his father until he was in his twenties.) Friends enrolled him in an all-boys school for orphans and the poor, the McDonogh School, where he remained until he was 16 years old, when he left to work as a farmhand. He studied animal husbandry at the University of Maryland, College Park.\nFrom 1934 to 1942, he managed Longacres Farm on the Eastern Shore of Maryland, specializing in Guernsey cattle. During World War II Boehm was in charge of a rehabilitation program for the Air Force at Pawling, New York. After World War II, Boehm apprenticed for six months with sculptor Herbert Haseltine. Boehm studied draftsmanship three times a week and taught himself the ancient process of porcelain making.\nIn 1944, he married Helen Franzolin (12/26/1920–11/15/2010). They moved to Trenton, New Jersey, where they founded their business in 1950. The following year, the American Wing of the Metropolitan Museum of Art in New York ordered two statues for the museum's collection. The marriage was long and happy but childless. The couple remained together until Edward's death in 1969, aged 55.\nBoehm kept a large collection of exotic birds in extensive aviaries and tropical houses at his home in Trenton. These birds became some of the subjects and inspiration for his sculptures. Many of these species were successfully bred, approximately 12 were recognised as being for the first time in captivity anywhere in the world. For these breeding  successes Edward Boehm received a number of commemorative medals and plaques.\nDeath\nEdward Marshall Boehm died from a heart attack on January 29, 1969, aged 55. His widow, Helen Boehm, died in 2010, aged 89. The couple is interred at Saint Mary's Cemetery, Trenton, Mercer County, New Jersey.\nLegacy\nBoehm was accorded his highest honor in 1992 when a wing of the Vatican Museums in Rome was named in his memory. This was the first time in its 500-year history that one of the 13 museums in the Vatican was named for an American citizen, as the twelve other museums are named for popes and royal families.\nTributes\n* ''”The image and likeness of God's world is seen at once in the work of Edward Marshall Boehm. It is not an elusive and esoteric expression like so much of contemporary art. Clarity is its first quality. Its grandeur is in its perfection. It is a disciplined art, mastering the demands of the ancient and distinguished craft of porcelain making”\n* Frank J. Cosentino, president of Edward Marshall Boehm, Inc.'', explained the importance of Boehm's hard-paste porcelain sculpture: ''\"Prior to Edward Marshall Boehm's venture in 1950s, few, if any, American firms had ever made hard-paste porcelain sculpture that successfully compared with the fine centuries-old production of Europe and Asia.\"\nSelected Collections\nToday Boehm porcelain is in the permanent collections of one hundred thirty-four institutions globally including:\n* White House, Washington, D.C.\n* Buckingham Palace, London, England\n* Elysѐe Palace, Paris, France\n* The Vatican Museum, Vatican City\n* Hermitage, Moscow, Russia\n* Metropolitan Museum of Art, New York City\n* Museum of Fine Arts, Houston\n* John F. Kennedy Center for the Performing Arts, Washington, D.C.\n* New Jersey State Museum, Trenton, New Jersey\n* Los Angeles County Museum of Art\n* The Brooks Museum of Art, Memphis, Tennessee\n* The Louisiana State Museum\n* The Smithsonian Institution\n* Bellingrath Gardens and Home, Mobile, Alabama\n* University of Texas Health Science Center at San Antonio\n* [http://www.americancamellias.org The American Camellia Society] at Massee Lane Gardens in Fort Valley, Georgia\n* Future Business Leaders of America-Phi Beta Lambda of Reston, Virginia (near Washington, D.C.)\n* [http://southdownmuseum.org Terrebonne Historical & Cultural Society (THACS)]\n* [http://www.wichitaartmuseum.org/collection/explore_the_collection Wichita Art Museum] , Wichita, Kansas, U.S.\n*Customs House Museum & Cultural Center, Clarksville, TN, US\n* McDonogh School Wilson | Young Archives & Special Collections [https://www.mcdonogh.org/about/history/wilson-young-archives-special-collections/artifact-art-ephemera-collections], Owings Mills, MD, US\nBibliography\n* Frank J. Cosentino, [http://www.worldcatlibraries.org/oclc/1356021&referer=brief_results Boehm's birds; The Porcelain Art of Edward Marshall Boehm] (New York, F. Fell, 1960); OCLC: 1356021\n* F. Cosentino, Edward Marshall Boehm — First Retrospective Exhibition'', Atlantic City, New Jersey, U.S.\nExternal links\n*[http://www.askart.com/AskART/B/edward_marshall_boehm/edward_marshall_boehm.aspx Edward Marshall Boehm, sculpture image at askart.com]; accessed December 11, 2014.\n*[https://web.archive.org/web/20170410213758/https://photos.google.com/share/AF1QipNkU1Ni4q6CjRPCJsNrixhg1-MWew7RLtODflub937uhXYBXXKnaJlKF8Yta59tIQ?key=ekdwQ1JaS24yNUs2UEpRb0RhQXA2cTl6VXRwU2Nn |Edward Marshall Boehm American Figurative Expressionist Porcelain Sculptor of the 1950s at Google Photos]\nReferences"
    }
  ]
}