{
  "content": [
    {
      "type": "text",
      "text": "# Edward Gantt\n\nEdward Gantt (died 1837) was an Episcopal clergyman who served as Chaplain of the Senate of the United States (1801–1804).\nEarly life\nEdward Gantt was born  , the son of Rachel Smith and Thomas Gantt III.  He received his bachelor of arts from Princeton University in 1762, and thereafter studied medicine with Benjamin Rush in Philadelphia and in Edinburgh. He also studied at the University of Leiden in the Netherlands where he matriculated 6 April 1767. Gantt received the degree of M.D. on this University 17 April 1767 The title description of his thesis is: Dissertatio medica inauguralis, de variolis, quam,…, ex Auctoritate Magnifici Rectoris, Davidis Ruhnkeniii, …, Eruditorum Examini submittit Eduardus Gantt, A.B. Anglo-Americanus…. - Lugduni Batavorum : Apud Theodorum Haak, 1767. - 33 p. + [1] p. ; 4oct. Variolis = Smallpox. Later he was entering in the practice of medicine in Somerset County, Maryland.  Sensing a call to ministry, he went to England where he obtained orders in 1770.\nMinistry\nGantt returned home and for a time officiated in his native parish, Christ Church, Calvert County. On January 28, 1776 he began to preach at All Hallow’s Parish in Worcester County.  Four years later he became rector of his native parish, and sustained himself by practicing medicine.  In 1795 Gantt moved to Georgetown in the District of Columbia.  His work in Washington continued to combine ministry and medicine as indicated by an invoice in the White House Historical Association's archives; the doctor’s bill for President Thomas Jefferson’s household dated March 22, 1802, lists the medical services provided to several servants by Dr. Edward Gantt.\nFrom President Jefferson, Dr. Gantt received a supply of smallpox vaccine; soon after January 17, 1802 he vaccinated Miami chief Little Turtle and a group of Miami diplomats who were in Washington,  The supply sufficed to vaccinate over three hundred persons connected with the Executive Mansion.\nChaplain of the Senate\nStarting on December 9, 1800 through November 6, 1804, Gantt served as Chaplain of the Senate.\nAfter Washington\nAbout 1807, under the auspices of Bishop Thomas John Claggett, he went to Kentucky, in the interests of the Episcopal Church.\nPersonal life\nEdward Gantt and Ann Stoughton Sloss, the daughter of Thomas and Mary Sloss, were married June 26, 1768, by the Rev. Thomas John Claggett, Gantt's cousin, later to be Bishop of Maryland.  Their fifteen children include: Thomas Sloss Gantt, William Stoughton Gantt, Edward Sloss Gantt and Captain John Gantt (1790-1849).\nGantt died near Louisville, Kentucky, 1837.\nReferences"
    }
  ]
}