{
  "content": [
    {
      "type": "text",
      "text": "# Edward P. Cliff\n\n| birth_place = Heber City, Utah\n| death_date =\n| death_place = Alexandria, Virginia\n| spouse = Kathryn Mitchell Cliff\n| children = Carolyn Cliff, Jane Cliff\n| occupation = Forester\n| alma_mater= Utah State University\n| awards= USDA Distinguished Service Award;Gifford Pinchot Medal, Society of American Foresters;Bernhard Fernow Award, American Forestry Association;Fellow, Society of American Foresters\n| module =\n}}\nEdward P. Cliff (September 3, 1909 – July 18, 1987) served as the ninth Chief of the United States Forest Service (USFS) of the Department of Agriculture, from March 17, 1962 to April 29, 1972.\nEarly life and education\nEdward Parley Cliff was born in Heber City, Utah, on September 3, 1909. He earned a degree in forestry from Utah State College, graduating in 1931.\nCareer\nAfter graduating, Cliff began his career with the Forest Service on the Wenatchee National Forest in Washington. He went on to become a wildlife specialist in the Pacific Northwest Regional Office in Portland, Oregon. Later he served as supervisor of the Siskiyou National Forest and the Fremont National Forest.\nCliff moved to Washington, D.C. to serve as Assistant Chief in the Division of Range Management in 1944. In 1946 he returned to Utah as assistant regional forester of the Intermountain Region. He was then promoted to regional forester of the Rocky Mountain Region in 1950, before going back to Washington, D.C. as Assistant Chief in 1952. He held the job of Assistant Chief for ten years.\nOn March 17, 1962, Cliff officially became the ninth Chief of the Forest Service.\nAs Chief, Cliff was instrumental in doubling recreational use on the national forests, and played a key role in establishing the National Wilderness Preservation System, the National Wild and Scenic Rivers System, and the National Trails System.\nThe intense nationwide controversy over clearcutting made the last few years of Cliff's tenure tumultuous. By the time of his retirement in 1972, he had begun to improve balance in national forest programs by strengthening interdisciplinary planning and modifying timber-cutting guidelines.\nCliff retired from the Forest Service on April 29, 1972. Following retirement he served as a forestry consultant in the U.S. as well as for the United Nations and in 26 foreign countries.\nCliff served as a Delegate or Chief of Delegation to five FAO Forest Committees in Rome, and to World Forestry Congresses in Seattle, Madrid, Buenos Aires, Jakarta, and Mexico City.\nDuring his career Cliff received numerous honor and awards. Utah State University granted him a Founder's Day Distinguished Service Award in 1958 and an honorary doctorate degree in 1965. Cliff received the U.S. Department of Agriculture Distinguished Service Award in 1962, the National Civil Service League Career Service Award in 1968, the Gifford Pinchot Medal from the Society of American Foresters in 1983, and the Bernhard Fernow Award from the American Forestry Association in 1983. Cliff was also named a Fellow of the Society of American Foresters.\nCliff served as Chairman of the North American Forestry Commission of the United Nations Food and Agriculture Organization, as a charter member of the American Society of Range Management, on the National Council of the Boy Scouts of America, and was a member of the Wilderness Society, the Wildlife Society, the Boone and Crockett Club, and the Cosmos Club.\nCliff died at his home in Alexandria, Virginia, on July 18, 1987.\nSee also\n*United States Chief Foresters\nReferences\nExternal links\n* [https://foresthistory.org/research-explore/us-forest-service-history/people/chiefs/edward-p-cliff-1909-1987/ Edward P. Cliff biographical profile] (Forest History Society)"
    }
  ]
}