{
  "content": [
    {
      "type": "text",
      "text": "# Edward Hutchinson (captain)\n\nEdward Hutchinson (1613&ndash;1675) (sometimes referred to as junior to differentiate him from his uncle) was the oldest child of Massachusetts and Rhode Island magistrate William Hutchinson and his wife, the dissident minister Anne Hutchinson.  He is noted for making peace with the authorities following his mother's banishment from the Massachusetts Bay Colony during the Antinomian Controversy, returning to Boston, and ultimately dying in the service of the colony that had treated his family so harshly.\nBorn in Alford, in eastern England, Hutchinson sailed to New England at the age of 20, a year ahead of the remainder of his family.  Following the events of the Antinomian Controversy, he, his father, and his uncle Edward were among 23 signers of a compact for a new government which they soon established at Portsmouth on Rhode Island.  Young Hutchinson only remained there a short while, and had returned to Boston to occupy the family house.  Here he had 11 children with two wives.\nHe became an early member of the Military Company of Massachusetts (today known as the Ancient and Honorable Artillery Company of Massachusetts) in 1638 and became its lieutenant (second in command) in 1654.  He was elected the company's captain (commanding officer) in June 1657 and served a one-year term.\nHe also served as a Deputy to the General Court in 1658, and in this capacity voiced his opposition to the persecution of the Quakers that took place in the late 1650s.\nDuring King Phillips War, in 1675, Captain Hutchinson and Captain Thomas Wheeler were given an assignment to negotiate with the Nipmuck Indians to keep them out of the war.  While searching for the tribal chief, Muttawmp, the two captains, with a company of men, were ambushed, and both were wounded.  Two weeks later Hutchinson died from his wounds, and was interred in a cemetery in Marlborough, Massachusetts Bay Colony.\nHutchinson is the ancestor of three United States presidents, as well as the loyalist governor of Massachusetts, Thomas Hutchinson.\nEarly life\nBaptized in Alford, Lincolnshire, England on 28 May 1613, Edward Hutchinson was the son of cloth merchant and magistrate William Hutchinson and his famed wife Anne Hutchinson.  Edward was the oldest of the Hutchinson's 15 children, and in 1633 when Edward's pregnant mother realized that she was going to emigrate from England, she allowed Edward to travel to New England a year ahead of the family, and he sailed aboard the Griffin with his uncle Edward Hutchinson (Sr.) and wife, also being on the same ship as the Reverend John Cotton who soon became teaching minister in the Boston church.  While Edward's uncle, Edward, was admitted to the Boston church in 1633, the young Edward wasn't admitted until 10 August 1634, just about the time that the remainder of the family arrived in Boston from England.\nwhere Hutchinson's name appears ninth on the list]]\nIn 1636 Hutchinson sailed back to England, and while there he married Katherine Hamby, likely in Lawford in Essex.  His father-in-law, Robert Hamby, had been a legal counselor in Ipswich. With his wife, he returned to the colonies later the same year, and it was about this time that his mother became embroiled in the events of the Antinomian Controversy.  As the controversy came to a peak, his mother was brought to trial in November 1637, then sentenced to banishment by the General Court of the colony.  She was not allowed to leave, however, until enduring a second trial in March 1638, this time by the clergy, and she was held in detention in the interim.  Many members of the colony who shared the views of Mrs. Hutchinson, including Edward, met on 7 March 1638 to sign a document establishing a new government, and most of the signers left the Massachusetts colony shortly thereafter to go build houses on Aquidneck Island.  Edward was one of the few family members who stayed in Boston in March, and was present at his mother's church trial, when he argued on her behalf that she should not be condemned for holding opinions in which she was not yet settled.  It was then deemed by the church that since he showed natural love for his mother, that he too should be admonished, along with a few others who were also close to Mrs. Hutchinson, and by removing the dissent from the family members, the ministers were able to proceed with the excommunication against her.\nHutchinson likely accompanied his mother and siblings from Boston to Aquidneck Island in early April 1638, and there he became one of the founding settlers of the island community that was initially named Pocasset, but was soon renamed Portsmouth.  However, since no charges were ever preferred against him by the Massachusetts authorities, he soon returned to Boston, and he and his young family became the residents and caretakers of the family house there.  Ownership of the house went to his uncle, Richard Hutchinson, ironmonger of London, who never came to New England, but had many land and business interests there.\nHutchinson's mother, Anne Hutchinson, and many of his younger siblings perished in an Indian massacre in New Netherland in August 1643, and he likely learned of this in early September, about the same time that Governor John Winthrop recorded it in his journal.  It is not clear when he learned that one of his siblings survived the attack and was taken hostage, but it was two and a half years after her capture that Winthrop wrote, \"A daughter of Mistress Hutchinson was carried away by the Indians near the Dutch.\"  After several years of living with the Siwanoy natives, Edward's young sister Susanna was released in an exchange, and brought back to Boston.  While no record has survived detailing which of her siblings took her in, Kirkpatrick believes that it was Edward's house where she came to live.\nHutchinson's wife had seven children before her untimely death about 1650, and he soon after married the widow Abigail Button.  Court records from the time show that in 1656 Abigail testified against Eunice Cole at her witch trial, Cole likely being the only woman convicted of witchcraft in New Hampshire.\nLater life\nIn the late 1650s strict laws had been enacted against the Quakers by the Massachusetts colony, but this didn't prevent Quaker evangelists from coming into the colony from outside.  It was during this period that Hutchinson served for a year as a Deputy to the General Court from Boston, elected in 1658.  While the magistrates were the most zealous enforcers of the laws against the Quakers, the general population was more sympathetic to their plight, and the Deputies, of which Hutchinson was one, made their opposition to the law known.  Hutchinson's first cousin, 11-year-old Patience Scott, the daughter of Providence Quakers Richard and Katherine Scott, had arrived in Boston unaccompanied.  It then became Captain Hutchinson's \"undertaking to send her home,\" and the Court took no action against her.  Historian James Savage stated that Hutchinson \"deserves honor for his firmness in opposing cruelty to the Quakers,\" and he was also tolerant of the Baptists, signing a 1668 petition for the release of those who were imprisoned.\nIn November 1659, Hutchinson was admitted to an equal share with the seven original purchasers of the Humphrey Atherton land investment company for lands in the \"Narragansett Country\" (later North Kingstown, Rhode Island), with his share being about 1000 acres.  The land was in disputed territory, with the three colonies of Connecticut, Rhode Island and Plymouth all staking claims to the area.  Whether Hutchinson actually occupied his land is uncertain, but he and two others were appointed by the Connecticut colony as selectmen to the area which was given the name Wickford in 1663.  Hutchinson's youngest living sister, Susanna, with her husband John Cole, left Boston to become caretakers of his property, and they ended up staying there for the remainder of their lives.\nMilitary service\nHutchinson was active in the militia of the colony.  In 1638, he was one of the early members of the Military Company of Massachusetts (today known as the Ancient and Honorable Artillery Company of Massachusetts) and, in 1641, he was a junior sergeant in the company.  In 1654 he was elected and commissioned as the lieutenant (second in command) of the Company and, three years later, in 1657, he was elected as the captain (commanding officer) of the company.\nAs a captain in the militia, Hutchinson was called to active service during King Philip's War in 1675, and was given command of a company which fell under the overall command of his brother-in-law, Major Thomas Savage.  On 28 July 1675 he co-lead an expedition with Captain Thomas Wheeler and a small company of men to negotiate a peace settlement with the Nipmuc sachem Muttawmp.  The natives evaded the party, however, until on 2 August, near the town of Brookfield, the captains and their men were ambushed in what became known as Wheeler's Surprise. Hutchinson was seriously wounded during the engagement, and Wheeler was also wounded, but the survivors managed to get to a garrison house in Brookfield, where they spent over a week, while being continuously attacked by the natives.\nWith some reinforcements, they eventually escaped from Brookfield, and Wheeler later recounted Hutchinson's fate: \"We came to Marlborough on 14 August when Captain Hutchinson being not recovered of his wounds before his coming from Brookfield, and over-tired with his long journey, by reason of his weakness, soon grew worse, and more dangerously ill, and on the 19th day of the same month, died, and was there the next day after buried...\" He was buried in the town cemetery, now the Springhill Cemetery, where a marker was erected in his honor in 1926. Commenting on his giving his life for the cause of the Massachusetts colony, historian Oliver Roberts noted that \"he, who, with his mother, was persecuted, poured out his blood in the service of that uncharitable country.\"\nFamily\nwas Edward's great grandson.]]\nHutchinson had 11 children with two wives.  His first wife was Katherine Hamby (Hanby/Hambie/Hemby) whom he married shortly after 19 October 1636 (the date of the marriage license), probably at Lawford, Essex, England.  Katherine was baptized at St. Matthews parish in Ipswich, Suffolk on 10 December 1615, the daughter of Robert Hamby and Elizabeth Arnold, her father being a \"counsellor at law in Ipswich, in England.\"\nOf the seven children of Edward and Katherine, Elishua was baptized in Boston on 5 November 1637 and probably died young, and Elizabeth (1639–1728) married Edward Winslow, the son of John Winslow and Mary Chilton, and grandson of Mayflower passenger James Chilton. Elisha (1641–1717) married first Hannah Hawkins, and second Elizabeth (Clark) Freak, and had 12 children. Anne (1643–1717) married first Samuel Dyre (Dyer), the son of William Dyer and Mary Barrett, then married second Daniel Vernon, and had a total of 11 children with both husbands. William, baptized 18 January 1645 and Katherine, baptized 14 May 1648 both probably died young. Susanna (1649-after 1716) married Nathaniel Coddington, the son of Rhode Island Governor William Coddington and his wife Anne Brinley, and the couple had six known children.\nKatherine died sometime after 10 June 1649 when her last child was born, but by 1650 when Hutchinson was married to his second wife. His second wife was Abigail (Fermayes) Button, the daughter of Alice (Blessing) Fermayes (or Vermais), and widow of Robert Button.  The oldest child of this marriage was Edward, who was born 4 January 1651 and died unmarried in 1692.  Katherine, born in 1653, married Henry Bartholomew and was still living about 1730; and Benjamin, born at Boston 2 June 1656 probably died young.  The youngest child of this marriage was Hannah, born at Boston 16 May 1658, who married Peter Walker, probably at Taunton; the couple had six children.\nDescendants of Hutchinson, through his son Elisha, include United States Presidents Franklin D. Roosevelt, George H. W. Bush and George W. Bush, as well as the loyalist governor of the Province of Massachusetts Bay, Thomas Hutchinson.\nSee also\n* List of early settlers of Rhode Island\n* Colony of Rhode Island and Providence Plantations\n* Massachusetts Bay Colony\nReferences\nBibliography\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\nFurther reading\n*\n*\n*\n*\nExternal links\n*[https://alonglineoffamily.blogspot.com/2011/10/line-11-edward-hutchinson-return-from.html biography] includes material on Wheeler's Surprise.\n*[http://www.newbraintreehistoricalsociety.org/12.html History of New Braintree] includes Wheeler's Surprise.\n*[http://www.westbrookfield.org/qp_wheelers_narrative.htm Captain Wheeler's narrative]"
    }
  ]
}