{
  "content": [
    {
      "type": "text",
      "text": "# Edward Howard (public relations firm)\n\nEdward Howard was an Ohio-based public relations, investor relations, marketing communications and graphic design firm that opened in 1925.  The company was acquired by Fahlgren Inc. in March 2010 and officially joined forces with Fahlgren's public relations business unit, Fahlgren Mortine Public Relations, on June 28, 2010. With the acquisition of Edward Howard, Fahlgren Mortine became the largest public relations firm in Ohio and is ranked 22nd on the recent O’Dwyer's ranking of top independent public relations firms.\nAt the time of its acquisition, Edward Howard was the nation's longest-established independent public relations firm and was 100 percent employee owned.\nFahlgren Mortine is known for its expertise in public relations, marketing communications, media relations, crisis communications, reputation management, investor relations, public/government affairs, and more recently, for its leadership in social media and interactive online communications.\nHistory\n1925 - 1950\nEdward Howard was founded in 1925 by Edward Howard II, then a young employee who served as an advertising manager for The Cleveland Trust Company. Among other duties, he edited Cleveland Trust's employee publication and promoted the sale of liberty bonds to help raise finances for World War I through propaganda posters at bank branch offices. Previously, Edward Howard II had worked as a police and sports reporter for The Plain Dealer and had obtained a year of law school education. With $400 in start-up capital, the support of his young wife Claire McMurray Howard, and two clients, he began a new career in the fledgling field of public relations.\nOver the next 29 years, he established and expanded the firm beyond its original two clients – a stock brokerage and a bank (Cleveland Trust) – to include leading organizations such as Hanna Mining Co., Cleveland Graphite Bronze (later Clevite) and the Homestead resort in Hot Springs, Virginia. In the meantime, wife Claire McMurray Howard became a prominent columnist with the Cleveland Plain Dealer, penning a column titled \"Good Morning,\" from 1936 until 1965. In 1941, the J. B. Lippincott Company published Claire's first book, And Beat Him When He Sneezes,  a collection of her columns that appeared in The Plain Dealer. This book later became the basis for Claire's national radio show on NBC Radio.\n1950 - 1970\nEdward Howard II's three sons, Edward Howard III, James S. Howard, and Nathaniel R. (Nat) Howard II all worked in the agency. The Cleveland Clinic, Eaton Corporation, Lubrizol, Reliance Electric, White Motor, and Pickands Mather Co. were all important clients during the 1950s and 1960s.\nEldest son, Edward Howard III, became chief executive officer in 1954 when founder Edward Howard died of a second heart attack. Middle son James Howard, became chief executive office just seven years later in 1961 when his brother Edward Howard III moved to Sydney, Australia to form an Edward Howard branded public relations consulting business there.\nJames Howard focused the firm heavily on both investor relations and political work. In 1967, the company published the nation's first timely disclosure manual for publicly traded companies. The agency was hired by Richard Nixon in 1968 to consult on his candidacy for president of the United States of America. In 1969, Edward Howard acquired three entities of Selvage & Lee, forming Selvage, Lee & Howard and adding offices in New York City, Chicago and Washington, D.C. That transaction demerged just 27 months later, and Selvage & Lee merged with Farley Manning to form Manning, Selvage & Lee in 1972.\n1970–2000\nIn 1970, the company bought back the stock held by members of the Howard family, naming John T. (Jack) Bailey as president. Under Bailey's direction, Edward Howard provided crisis communications consulting work to Oglebay Norton Corporation during the tragic 1975 sinking of the SS Edmund Fitzgerald in Lake Superior. It created the New Cleveland Campaign, one of the nation's earliest economic development marketing programs, and in 1980, Edward Howard handled media relations work for the Jimmy Carter-Ronald Reagan presidential debate in Cleveland.\nBailey served as the firm's top executive for 15 years until he retired as chairman and chief executive officer in 1986 and was succeeded by Stanley L. Ulchaker. Davis B. Young joined the firm shortly thereafter in 1987 and teamed with Ulchaker to lead the firm and serve as its president throughout the 1990s. In 1996, Young authored Building Your Company's Good Name, a book on corporate reputation management published by the American Management Association.\nAn Akron, Ohio office was added in 1989 with the acquisition of David A. Meeker & Associates; this office was merged into the Cleveland office in 2002. A Columbus, Ohio office opened in 1991 as a start-up operation. In 1992, the Dayton, Ohio office was added through the acquisition of Winslow Chappell, Inc.\nWell-known Edward Howard clients during the 1980s and 1990s included Rubbermaid, Progressive Insurance, Major League Baseball, Rockwell International, AT&T Wireless Services, Target Corporation, Cleveland Cavaliers, Invacare, Charter One and Revco Drug Stores.\n2001–2009\nUpon Ulchaker's retirement in 2000, a new management team assumed responsibility for the firm, consisting of chairman and chief executive officer Kathy Cupper Obert; president Wayne R. Hill; and executive vice presidents Nora Jacobs, Donald Hohmeier and Mark Grieves.\nWell-known clients of Edward Howard during this time included organizations such as Wal-Mart, Sherwin-Williams, Cedar Fair, Nokia, Leggett & Platt, The Hoover Company, Dirt Devil, Invisible Fence, Huffy, Kidde, Glimcher, AEP Ohio, the Cleveland Indians, Cliffs Natural Resources, The Step2 Company and the Greater Cleveland Partnership.\n2010\nIt was announced on January 13, 2010, that Edward Howard would be acquired by Columbus, Ohio-based Fahlgren Inc.  The acquisition closed in March 2010, and on June 28, 2010, Edward Howard joined forces with the Fahlgren Mortine Public Relations business unit of Fahlgren Inc.\nCurrent operations and clients\nBased in Columbus, Ohio, Fahlgren Mortine's work is spread nationally and internationally.\nRecognition\nFahlgren Mortine remains a highly regarded agency throughout the nation. The firm is the recipient of 25 Silver Anvils – the highest award of the Public Relations Society of America (PRSA).\nThe most recent Silver Anvil was awarded in 2010 for the company's work in behalf of Lifeline of Ohio's “Changing the Meaning of ‘Organ Donation’ Among Motorcyclists.”\nReferences\nExternal links\n* [http://www.fahlgrenmortine.com/ Fahlgren Mortine Public Relations website]\n* [http://www.fahlgren.com/ Fahlgren website]\n* [http://pmbcgroup.com/ Los Angeles Public Relations Agency]"
    }
  ]
}