{
  "content": [
    {
      "type": "text",
      "text": "# Edward L. Fike\n\n| birth_place      =\n| death_date       =\n| death_place      =\n| resting_place    =\n| education = Duke University\n| occupation       = Journalist  Publisher\n| nationality      = American\n}}\nEdward L. Fike (b. Maryland, March 31, 1930, d. California, August 26, 2011) was a journalist and publisher in California, Montana, North Carolina, Ohio, and Virginia.\nBiography\nChildhood, education, and military service\nFike was born March 31, 1920, in Delmar, Maryland, to Claudius Edwin Fike and Rosa Lake Pegram. He grew up in Ahoskie, North Carolina. He earned a bachelor's degree in economics from Duke University in 1941 and graduated as an ensign from the Naval Officer Candidate School at Northwestern University in 1942. At Duke, he was a member of Red Friars and Omicron Delta Kappa, honorary leadership organizations, and was president of the YMCA branch.\nDuring World War II, Fike was a navigator aboard the ammunition ship USS Mount Baker and the amphibious ship USS Rushmore during the latter's participation in the Battle of Leyte Gulf.\nCareer\nAfter the war, Fike took his first journalism job in 1945 as editor and co-publisher of the Nelsonville Tribune in Nelsonville, Ohio. In 1948 he began a stint as director of public relations at Duke University. In 1950 he worked in the office of the United States Secretary of Defense, and in 1951 he was a member of the United States delegation to the formation of the North Atlantic Council, the governing body of the North Atlantic Treaty Organization in Paris, France.\nFike returned to newspapers in 1953 as associate editor and Sunday editor of the Rocky Mount Evening Telegram in North Carolina. He resigned from the Telegram on April 1, 1957 after he bought the Byerly newspaper chain in Montana, including the Lewiston Daily News, the Glendive Daily Ranger, and the Argus-Farmer.\nFrom 1957 to 1968, Fike was editor and publisher of Fike Newspapers in Montana and California, followed by two years as associate editor of the Richmond News-Leader in Virginia.\nHis California newspaper experience began when he bought the Press-Journal of Wilmington, from William J. Anderson in May 1959. His company name was Harbor Newspapers, Inc. The U.S. Internal Revenue Service seized the newspaper, which was the oldest in Southern California, and a sister publication, Harbor Mail, in April 1963 for failure to pay taxes withheld from employees' salaries. The building was shuttered and the 23 workers told to go home.\nFike was publisher of the Woodland Hills Reporter in 1967.\nIn 1967, coverage of a school-attendance-boundary dispute in Sunland-Tujunga, where Fike owned and edited the Record-Ledger, \"according to many, sharpened the controversy,\" which had racial overtones.\nJerry Cohen of the Los Angeles Times reported that Fike:\n\"willfully aggravated dissension with \"inflammatory editorials\" and \"slanted news.\" One minister said he considers the newspaper \"a divisive force\" in all community affairs involving so-called liberal and conservative issues.\" . . . But Fike denies intent to present the news less than objectively and insists his... editorials merely reflect sincere personal belief in conservative principles.\"\nThe Times printed a response from Fike which stated, in part: \"The suspicion grows and grows that the Los Angeles Board of Education by a one-vote margin knowingly sacrificed the Shadow Hills neighborhood upon the altar of forced integration as demanded by agitators and by the U.S. government as its price for federal aid.\"\nFike moved to San Diego, California, in 1970 as director of news and editorial analysis for Copley Newspapers, and in 1977 he was named editor of the editorial pages of the San Diego Union.\nPolitical opinions\nFike in 1960 called for Montana State University president Harry K. Newburn to \"knock heads together starting with Dr. Leslie Fiedler\" (an American literary critic, known for his interest in mythography and his championing of genre fiction) and quoted a letter from an English Department instructor who accused the department of promoting material of a pornographic nature and making a mockery of religion and morals.\nIn 1962, Fike \"called for a stronger stand against communism throughout the world; charged that intellectual and moral failures have paved the way for communism; claimed that equality cannot be conferred but must be earned; and accused Americans of abandoning the virtues that made the nation strong and no longer holding the Constitution sacred.\" In that year he was registered as a Republican living at 1512 Strand, Manhattan Beach, California.\nFike was noted in 1982 as a \"longtime friend and supporter\" of the Americanism Educational League.\nShooting and legal actions\nOn the night of August 12, 1959, three .22-caliber bullets were fired toward the Fikes' home in Lewistown, two of them entering the house and just missing the head of his wife. Ray Wilson, who was a Lewistown Daily News reporter at the time, was charged with first-degree assault. A jury found Wilson not guilty on December 10, 1960. Wilson filed two civil claims of libel against the Fike Publishing Company, whose newspaper had published a letter by Henry Ronish of Denton in which Ronish said the unidentified shooter had an \"unbalanced mind\" and was a \"menace to society.\" A judge sustained a demurrer which stated there was no cause of action in the complaints.\nDeath\nFike died in Encinitas, California, on August 26, 2011, at the age of 91. He was survived by his wife of 59 years, the former Amy Drake of Lafayette, Alabama, and Cardiff, California; a sister, Ruth Pittman of St. Petersburg, Florida; and four daughters. He was predeceased by his twin brother, Claude Fike, and a sister, Evelyn Laupus.\nReferences"
    }
  ]
}