{
  "content": [
    {
      "type": "text",
      "text": "# Edward Ruthazer__disambig_1\n\n}}\n|birth_place       = New York, U.S.\n|death_date        =\n|death_place       =\n|spouse            = Shiho Kanamaru\n|education         = Princeton University (AB)University of California, San Francisco, PhD)\n|known_for         = Neurodevelopmental research\n|fields            = DevelopmentVisual SystemNeurobiology\n|workplaces        = McGill University\n|doctoral_advisor  = Michael Stryker\n|academic_advisors = Nobuhiko YamamotoHollis Cline\n}}\nEdward S. Ruthazer (born in 1966 in New York, NY) is a Canadian neuroscientist and James McGill Professor in the Department of Neurology and Neurosurgery at McGill University in Montreal, Quebec.\nResearch\nRuthazer's research utilizes in vivo multiphoton fluorescence microscopy of developing brain cells in conjunction with patterned visual stimulation and electrophysiological recordings to understand how patterned sensory experience impacts the development and refinement of neural connectivity in the visual circuits of the brain. His work has also helped underscore the significance of glial cells in this process.\nCareer\nRuthazer is a full professor in the Department of Neurology & Neurosurgery at McGill University in Montreal, Quebec, Canada. He obtained his undergraduate AB degree in Biology with a minor in East Asian Studies from Princeton University in 1988 and his PhD in Neuroscience from UCSF in 1996. During this time, he also served as a bonded medically-versed volunteer Mandarin Chinese interpreter at the UCSF Medical Center. After carrying out postdoctoral research on visual system development at Osaka University and Cold Spring Harbor Laboratory, he established an independent research lab at the Montreal Neurological Institute and Hospital (The Neuro) in 2005. With the support of Drs. David Colman, Director of The Neuro, and Josephine Nalbantoglu, Director of the McGill Integrated Program in Neuroscience (IPN), at that time, Ruthazer founded the IPN Graduate Rotation Program in 2009, which is currently the oldest graduate rotation program in the field of neuroscience in Canada. In 2022, Ruthazer was appointed Director of the McGill University Integrated Program in Neuroscience (IPN) graduate program, the largest Neuroscience graduate training program in North America with over 600 registered full-time students.\nFrom 2018 to 2023, Ruthazer, together with Dr. Takao Hensch (Harvard University), served as Chief Editor of the open access journal Frontiers in Neural Circuits published by Frontiers Media.\nRecognition\nRuthazer is a James McGill Professor and was the recipient of a tier II Canada Research Chair (2005–2015) from the Canadian government and a FRQS chaire de recherche (2015–2019), Quebec's most prestigious career award recognizing research excellence. Ruthazer is also a March of Dimes Basil O’Connor Starter Scholar (2005–2007), an EJLB Foundation Scholar (2006–2010), an MNI Killam Scholar (2007–2012) and two time winner of the NARSAD Young Investigator Award (2004,2007). He was the inaugural recipient of the Young Investigator Award from the Canadian Association for Neuroscience in 2011.\nReferences"
    }
  ]
}