{
  "content": [
    {
      "type": "text",
      "text": "# Edward Lloyd Thomas (surveyor)\n\nEdward Lloyd Thomas, Sr. (1785–1852) was a Methodist preacher, a land speculator, and a surveyor (see surveying) in Georgia, United States.  He had six brothers and a sister. Among his children was Confederate general Edward Lloyd Thomas (1825–1898).\nBiography\nEdward Lloyd Thomas was the son of Phillip Thomas, who served as a Corporal in the Revolutionary War, and was descended from the British politician Edmund Thomas of Glamorgan. and Elizabeth Covington Wailes of two prominent Maryland Families.  Edward L. Thomas was a Methodist preacher (see Methodism), a planter, land speculator and surveyor. He learned surveying from his Uncle Levin Wailes. In 1808, at age 23, he was a Justice of the Peace of Franklin County, Georgia and was Captain of the Militia  District 209. About 1813, he was ordained a Methodist minister, and was living at Watkinsville, Georgia in Clarke County, Georgia. Thomas was the father of Lovick Pierce Thomas, I and Edward Lloyd Thomas, grandfather of lawman Heck Thomas and Col. Lovick Pierce Thomas, Jr.\nEdward surveyed land in many Georgia locations:  in 1819, a district of Walton County, Georgia, in 1820 the county and district lines of Hall County, Georgia and Habersham County, Georgia,  in 1821 Henry County, Georgia district lines, and in 1824, Dooly County, Georgia. He was chief surveyor of a commission appointed by the governor of Georgia to establish the western boundary of Georgia in 1826; for years Alabama disputed this survey, but in 1840, it was accepted.\nDec. 24, 1827, after the Creek Indians (see Muscogee people) ceded lands, the State Legislature passed \"an act to lay out a trading town, and to dispose of all the lands reserved for the use of the State near the Coweta Falls, on the Chattahoochee River, and to name the same.\" Edward was selected to lay out the town of Columbus, Georgia on 1,200 acres. He took with him his young son, Truman, to work on his crew. The boy got sick and died in a small house that still stands on 808 Broadway; his was the first burial in Linwood Cemetery, Columbus. The boundary between the Cherokee and Creek Indian lands was disputed; the final line was a compromise of Andrew Jackson's in 1829. Early in 1831, Edward Lloyd Thomas ran sectional lines for the Cherokee Country which was most of northwest Georgia, north of the Chattahoochee River. In the summer, he ran the Georgia-Florida line which was not agreed upon until 1859. His last important work was in 1837 when he laid out the town of Oxford, Georgia at a site designated by the Georgia Methodist Conference for the establishment of a college, Emory College (see Emory University). There, he built his house and lived out his years. He is buried in the Oxford Cemetery. His house still stands.\nEdward's Will Stated: \"being at this time free from the bondage of debt, the hardest of all masters as far as regards temporal matters—and intending to remain thus free the balance of my life whether long or short, as a valuable legacy, by way of parting advice to my children & all connected with them by marriage, that they imitate my example, and keep clear of debt, if they wish to preserve a serene mind and an unruffled temper.\" He was buried in the Oxford Historical Cemetery.\nMary \"Polly\" Hogue, of Clarke County, Georgia, married Edward in August 1806.  She was one of nine children, four brothers and four sisters. Her Father Jacob Hogue owned a large farming operation; he died in 1817.\nPolly and Edward Lloyd had eight children.  Ed and Fletcher died in infancy. All the men served in the American Civil War. Henry Phillip (1810–1863) was a Colonel in the 16th Regiment of Georgia Infantry and was killed leading a charge in the Battle of Fort Sanders Knoxville, Tennessee.   Lovick Pierce Thomas, I, (1812–1878), served as the quartermaster 35th Georgia Infantry. Wesley Wailes (1820–1906), was a Major in Co. F, Phillip's Legion of Cavalry.  Edward Lloyd Thomas, II (1825–1898), by the War's end, was General of the 35th Georgia Infantry.\nSeveral of Thomas' works are listed on the U.S. National Register of Historic Places.\nWorks\nEdward Lloyd Thomas is cited in the NRIS database of the U.S. National Register of Historic Places five times, for his having some association with National Register listings.\nIn Columbus, Georgia, four National Register listings cite him:\n*For the Colored Cemetery, 10th Ave. Columbus, Georgia, Thomas is cited as probably having set aside its area in Thomas's 1828 plan for the city of Columbus.|title=Historic Resources of Columbus, Muscogee County, Georgia--GA AHP Survey-Inventory: Porterdale Cemetery / The Colored Cemetery |publisher=National Park Service|accessdate=August 24, 2016 |author1=Nancy Alexander |author2=Roger Harris |author3=Janice P. Biggers |date= }}\n*For the Columbus Historic District (Boundary Increase), bounded by Ninth and Fourth Sts., Chattahoochee River and Fourth Ave., Columbus, Georgia, Thomas is also cited\n*For the Old City Cemetery, Linwood Blvd., Columbus, Georgia, Thomas is also cited.\n*For Rankin Square, bounded by Broadway, 1st Ave., 10th and 11th Sts., Columbus, Georgia, Thomas is also cited.\nAnd in Oxford, Georgia one National Register listing cites him:\n*Thomas is cited for the Oxford Historic District, College and residential district centered around Wesley St. Oxford, Georgia.\nNotes\nReferences\n*\n*\n*\n*"
    }
  ]
}