{
  "content": [
    {
      "type": "text",
      "text": "# Edward Davies Davenport\n\n|image = File:Edward Davies Davenport.jpg\n|caption = Edward Davies Davenport, circa 1800\n|office1 = Member of Parliamentfor Shaftesbury\n|term_start1 = 1826\n|term_end1  = 1830\n|alongside1   = Ralph Leycester\n|predecessor1 = Ralph LeycesterLord Robert Grosvenor\n|successor1   = Edward PenrhynWilliam Dugdale\n|birth_name =\n|birth_date =\n|birth_place =\n|death_date =\n|death_place =\n|spouse = Caroline Anne Hurt\n|children =\n|father = Davies Davenport\n|mother = Charlotte Sneyd\n|education = Christ Church, Oxford\n}}\nEdward Davies Davenport of Capesthorne Hall (27 April 1778 – 9 September 1847) was a British landowner, High Sheriff of Cheshire and Member of Parliament for Shaftesbury.\nEarly life\nby George Romney]]\nDavenport was born the son of Davies Davenport of Capesthorne Hall and Court Garden, Marlow and his wife, Charlotte, daughter of Ralph Sneyd of Keele Hall and Barbara Bagot, daughter of Sir Walter Bagot, 5th Baronet. He was educated at Dr. Gretton’s School in Hitcham, Buckinghamshire, which he completed in 1789 followed by Rugby School which he left in 1794 and finally Christ Church, Oxford which he matriculated from in 1797.\nMilitary career\nDavenport entered the 16th The Queen's Lancers as a cornet in 1799 following graduation from Oxford at 21. Due to gambling debts he then transferred to the Grenadier Guards as a lieutenant, serving in Southern Italy and was promoted to captain in 1804, following which in 1807 he resigned his commission, giving poor health and lack of intellectual conversation as his reasons for leaving to his father. Although his resignation from the Army was on the condition that he promised not to accrue any further gambling debts, he was soon in debt again and complained to his father of his lack of ability to pay them off, however, this was eased when his father transferred to him the family Calvely estates on the advice of his mother, Charlotte Sneyd.\nPolitical career\nAlthough he did not enter politics until some twenty years later, Davenport did convince his father, Davies Davenport to run as Member of Parliament for Cheshire as an independent candidate in the 1806 United Kingdom general election. As well as which, following his resignation from the army, his tendencies towards the Whig Party increased as a member of Brooks's. Davenport thoroughly condemned the Peterloo Massacre and wrote a journal on it for the Edinburgh Review although that was not published. Davenport wished to enter parliament in 1820, however his father refused to support his bid, as his sister related to him:\nThe first of these, that the occurrences of last year had brought into too strong evidence the very decided and opposite line of politics you were likely to pursue in Parliament. The other, that the money paid for debts would render it much more unlikely that he would come forward with another sum for another purpose. He communicated himself the result of your application and we said all the things you may suppose on the occasion, and he quarrelled and sulked for a day or two.\nAlthough, Davenport did still stand for Lincoln as an independent candidate, although came third behind the Tory and Whig candidates and when it came up again in 1822 he stood aside for his friend and future brother-in-law John Williams. In 1826 Davenport stood as the Whig candidate for Shaftesbury and won the election and stood until the 1830 United Kingdom general election.\nFamily life\nDavenport married Caroline Anne Hurt, daughter of Richard Hurt of Wirksworth, Derbyshire on 30 November 1830, they had one son:\n* Arthur Henry Davenport of Capesthorne Hall (1832 – 1867), died without issue and was succeeded by his cousin William Bromley-Davenport\nDavenport died on 9 September 1847 and was succeeded by his son, Arthur Henry Davenport.\nReferences\nExternal links\n* [https://www.historyofparliamentonline.org/volume/1820-1832/member/davenport-edward-1778-1847 History of Parliament; DAVENPORT, Edward Davies (1778-1847), of Calveley, Cheshire]"
    }
  ]
}