{
  "content": [
    {
      "type": "text",
      "text": "# Edward Hickmott\n\n|        birth_place = Maidstone, Kent\n|         death_date =\n|        death_place = West Malling, Kent\n|            batting = Right-handed\n|            bowling =\n|               role = Wicket-keeper\n|             family = William Hickmott (nephew)\n|              club1 = Kent\n|              year1 =\n|              type1 = FC\n|         debutdate1 = 31 May\n|         debutyear1 = 1875\n|          debutfor1 = Kent\n|      debutagainst1 = Sussex\n|          lastdate1 = 19 July\n|          lastyear1 = 1888\n|           lastfor1 = Kent\n|       lastagainst1 = Gloucestershire\n|     hidedeliveries = true\n|            columns = 1\n|            column1 = First-class\n|           matches1 = 10\n|              runs1 = 85\n|           bat avg1 = 6.53\n|          100s/50s1 = 0/0\n|         top score1 = 44\n| catches/stumpings1 = 16/3\n|               date = 2 August\n|               year = 2020\n|             source = http://www.espncricinfo.com/ci/content/player/14783.html CricInfo\n}}\nEdward Hickmott (20 March 1850 – 7 January 1934) was an English cricketer. He played ten first-class matches for Kent County Cricket Club between 1875 and 1888.\nHickmott was born at Maidstone in Kent in 1850, the son of John and Harriet Hickmott. His father worked as a cooper and later became a publican, running ''The King's Head in Boxley, a pub which became the family business.\nHe first appeared for Kent Colts sides in 1874, playing in the same match as his twin brother William. Hickmott made his senior debut for the county side the following year, playing twice in 1875 for Kent. His other eight matches for the county took place during the 1880s, with three appearances in 1886 and 1887 and one in each of 1881 and 1888.\nFrom 1880 he was employed as groundsman and as a professional by The Mote in Maidstone, a job which lasted until 1920. Hickmott laid a new wicket at the ground in 1908 and a benefit match was played there for him in 1904. He made his highest first-class score, 44 runs, on the ground in 1886 and scored a number of centuries for The Mote in club cricket.\nAs well as playing cricket, Hickmott was a hunter and a fine swimmer and rower. He lived with his twin brother throughout his life, moving to West Malling with William after he retired from running The King's Arms''. Hickmott died there in 1934 aged 83. William's son, also named William, played for Kent and Lancashire either side of the First World War.\nReferences\nExternal links\n*"
    }
  ]
}