{
  "content": [
    {
      "type": "text",
      "text": "# Edward Hall (archaeological scientist)\n\n| birth_place = London, England\n| death_date =\n| death_place = Oxford, England\n| nationality = British\n| field = Archaeological science\n| work_institution =\n| alma_mater = New College, Oxford (Chemistry)\n| societies =\n| prizes = Commander of the Order of the British EmpireFellow of the British Academy\n| spouse = Jennifer De La Harpe\n| children = Bill HallMartin Hall\n| footnotes =\n}}\nEdward Thomas Hall, CBE, Hon. FBA, FSA (10 May 1924 – 11 August 2001), also known as Teddy Hall, was a British scientist and balloonist who is best remembered for exposing the Piltdown Man as a fraud.\nEarly life and education\nHall was born on 10 May 1924 in London, England, to Walter D'Arcy Hall and Anne Madeleine Hall. He was brought up at Shipton Court, a Jacobean manor house in Shipton-under-Wychwood, Oxfordshire. He was educated at Eton College, an all-boys public school in Berkshire. In 1943, he joined the Royal Naval Volunteer Reserve (RNVR) as an ordinary seaman, serving in landing craft transporting commandos to France.\nAfter the end of the Second World War, he entered New College, Oxford to study chemistry, and graduated with a Bachelor of Arts (BA) degree in 1948. His Doctor of Philosophy (DPhil) degree was undertaken at the Clarendon Laboratory (part of the Department of Physics) under the supervision of Lord Cherwell, and his degree was completed in 1953. His thesis was on the \"development of an x-ray fluorescence spectrometer for the non-destructive analysis of archaeological material\".\nCareer\nIn 1954, Hall became director of the newly founded Research Laboratory for Archaeology and the History of Art (RLAHA) at the University of Oxford. In 1969, he was elected a fellow of Worcester College, Oxford. He was made Professor of Archaeological Sciences in 1975. On retirement from RLAHA in 1989, he was made emeritus professor.\nHall was a member of the council of the International Institute for Conservation from 1971 to 199, and served as its president from 1989 to 1992. He was a trustee of the British Museum (1973–1995), National Gallery (1977–1984) and The Science Museum (1984–1992). He was als0 Prime Warden of the Goldsmiths Company.\nOther activities\nHall was also a hot-air-balloon pilot and owner of Cameron O-84 Flaming Pearl G-AYAJ 1970–1990. He was a member of the Air Squadron.\nIn 1962, Hall co-developed, with his friend Robin Cavendish, a wheelchair with a built-in respirator that allowed Cavendish, who was paralyzed from the neck down from polio and required a medical respirator to breathe, to leave the confinement of his bed. This chair became the model for future devices of its type, with Cavendish eventually using a total of 10 different chairs. This part of Hall's life is shown in the 2017 film Breathe.\nAchievements\nHe was influential in exposing the Piltdown Man fraud which led to his founding the Research Laboratory for Archaeology and the History of Art, Oxford University.\nHe founded Littlemore Scientific Engineering Company (ELSEC).\nHe helped to date the Shroud of Turin to the period 1260–1390.\nHe built the Littlemore Clock in the 1990s, which is the most accurate pendulum clock ever built.\n}}\nPersonal life\nHe married South African model Jennifer De La Harpe and had two sons Bill and Martin.\nHonours\nIn 1951, Hall was elected a Fellow of the Physical Society (FPhysS), a learned society for the physical sciences. In 1984, he was elected an Honorary Fellow of the British Academy (Hon FBA), the United Kingdom's national academy for the humanities and the social sciences.\nReferences\nObituaries\n*Wright, Pearce (20 August 2001). [https://www.theguardian.com/news/2001/aug/20/guardianobituaries.physicalsciences \"Professor ET 'Teddy' Hall:Scientist who exposed the Piltdown Man fraud and dated the Turin Shroud as a medieval fake\"]. The Guardian.\n*[https://www.telegraph.co.uk/news/obituaries/1337670/Professor-E-T-Teddy-Hall.html \"Professor E T 'Teddy' Hall\"]. The Daily Telegraph. 17 August 2001.\n*Saxon, Wolfgang (21 August 2001). [https://query.nytimes.com/gst/fullpage.html?res=9A0CE0DF1F3EF932A1575BC0A9679C8B63 \"E. T. Hall, 77, Archaeologist Who Debunked Piltdown Man\"]. The New York Times."
    }
  ]
}