{
  "content": [
    {
      "type": "text",
      "text": "# Edward Pococke\n\nEdward Pococke (baptised 8 November 160410 September 1691) was an English Orientalist and biblical scholar.\nEarly life\nThe son of Edward Pococke (died 1636), vicar of Chieveley in Berkshire, he was brought up at Chieveley and educated from a young age at Lord Williams's School, Thame, Oxfordshire.  He matriculated at Magdalen Hall, Oxford in 1619, and later was admitted to Corpus Christi College, Oxford (scholar in 1620, fellow in 1628). He was ordained a priest of the Church of England on 20 December 1629.\nThe first result of his studies was an edition from a Bodleian Library manuscript of the four New Testament epistles (2 Peter, 2 and 3 John, Jude) which were not in the old Syriac canon, and were not contained in European editions of the Peshito. This was published at Leiden at the instigation of Gerard Vossius in 1630, and in the same year Pococke sailed for Aleppo, Syria as chaplain to the English factor. At Aleppo he studied the Arabic language and collected manuscripts. He also studied and translated Arabic Islamic works. His Philosophus Autodidacticus, a translation of Ibn Tufayl's Life of Hayy Ibn Yaqzan, may have influenced the political philosopher John Locke.\nAt this time William Laud was both Bishop of London and chancellor of the University of Oxford, and Pococke was recognised as one who could help his schemes for enriching the university. Laud founded a Chair of Arabic at Oxford, and invited Pococke to fill it. He entered the post on 10 August 1636; but the next summer he sailed back to Constantinople in the company of John Greaves, later Savilian Professor of Astronomy at Oxford, to prosecute further studies and collect more books; he remained there for about three years.\nReturn to England\nWhen he returned to England, Laud was in the Tower of London, but had taken the precaution to make the Arabic chair permanent. Pococke does not seem to have been an extreme churchman or to have been active in politics. His rare scholarship and personal qualities brought him influential friends, foremost among these being John Selden and John Owen. Through their offices he obtained, in 1648, the chair of Hebrew at the University of Oxford on the death of John Morris, though he lost the emoluments of the post soon after, and did not recover them until the Restoration.\nThese events hampered Pococke in his studies, or so he complained in the preface to his Eutychius; he resented the attempts to remove him from his parish of Childrey, a college living near Wantage in North Berkshire (now Oxfordshire) which he had accepted in 1643. In 1649, he published the Specimen historiae arabum, a short account of the origin and manners of the Arabs, taken from Bar-Hebraeus (Abulfaragius), with notes from a vast number of manuscript sources which are still valuable. This was followed in 1655 by the Porta Mosis, extracts from the Arabic commentary of Maimonides on the Mishnah, with translation and very learned notes; and in 1656 by the annals of Eutychius in Arabic and Latin. He also gave active assistance to Brian Walton's polyglot bible, and the preface to the various readings of the Arabic Pentateuch is from his hand.\nPost-Restoration\n]]\nAfter the Restoration, Pococke's political and financial troubles ended, but the reception of his magnum opusa complete edition of the Arabic history of Bar-Hebraeus (Greg. Abulfaragii historia compendiosa dynastiarum), which he dedicated to the king in 1663showed that the new order of things was not very favourable to scholarship. After this, his most important works were a Lexicon heptaglotton (1669) and English commentaries on Micah (1677), Malachi (1677), Hosea (1685) and Joel (1691). An Arabic translation of Grotius's De veritate, which appeared in 1660, may also be mentioned as a proof of Pococke's interest in the propagation of Christianity in the East, as is his later Arabic translation of the Book of Common Prayer in 1674. Pococke had a long-standing interest in the subject, which he had talked over with Grotius at Paris on his way back from Constantinople.\nPersonal life\nPococke married Mary Burdet in about 1646, and they had six sons and three daughters. One son, Edward (1648–1727), published several contributions from Arabic literature: a fragment of Abd al-Latif al-Baghdadi's Account of Egypt and the Philosophus Autodidactus of Ibn Tufayl (Abubacer).\nEdward Pococke died on 10 September 1691 and was buried in the north aisle of Christ Church Cathedral, Oxford. His monument, a bust erected by his widow, is now elsewhere in the cathedral.\nLegacy\nHis valuable collection of 420 oriental manuscripts was bought by the university in 1693 for 600l., and is in the Bodleian (catalogued in Bernard, Cat. Libr. MSS. pp.&nbsp;274–278, and in later special catalogues), and some of his printed books were acquired by the Bodleian in 1822, by bequest from the Rev. C. Francis of Brasenose (Macray, Annals of the Bodl. Libr. p.&nbsp;161).\nBoth Edward Gibbon and Thomas Carlyle exposed some \"pious\" lies in the missionary work by Grotius translated by Pococke, which were omitted from the Arabic text.\nThe theological works of Pococke were collected, in two volumes, in 1740, with a curious account of his life and writings by Leonard Twells.\nThe Pococke Garden of Christ Church, Oxford is named after him, and contains the Pococke Tree, an Oriental Plane planted by him, possibly from seed he collected around 1636. This tree, with its circa nine metre girth, may be the inspiration for the Tumtum tree of Lewis Carol's poem Jabberwocky.\nReferences\n* Avner Ben-Zaken, \"Exploring the Self, Experimenting Nature\", in [https://www.amazon.com/Reading-Hayy-Ibn-Yaqzan-Cross-Cultural-Autodidacticism/dp/0801897394/ref=sr_1_3?ie=UTF8&qid=1343310784&sr=8-3&keywords=avner+ben-zaken Reading Hayy Ibn-Yaqzan: A Cross-Cultural History of Autodidacticism] (Johns Hopkins University Press, 2011), pp.&nbsp;101–125.\nExternal links\n*[http://oxoniensia.org/volumes/1991/holt.pdf P. M. Holt, article on Pococke], Oxoniensia vol. 56, 1991\n*\n*[http://emlo-portal.bodleian.ox.ac.uk/collections/?catalogue=edward-pococke The Correspondence of Edward Pococke], Early Modern Letters Online [EMLO], ed. Howard Hotson and Miranda Lewis\n*[https://books.google.com/books?id=FTA-AAAAcAAJ Liturgiæ Ecclesiae Anglicanae partes præcipuæ: sc. preces matutinæ et vespertinæ, ordo administrandi cænam Domini, et ordo baptismi publici; in Linguam Arabicam traductæ] 1674 translation\n*[http://mammana.org/bcp/arabic1826/ Liturgiæ Ecclesiae Anglicanae partes præcipuæ: sc. preces matutinæ et vespertinæ, ordo administrandi cænam Domini, et ordo baptismi publici; in Linguam Arabicam traductæ] 1826 edition, digitized by Richard Mammana\n*[https://www.dailysabah.com/columns/ibrahim-kalin/2018/03/10/hayy-ibn-yaqdhan-and-the-european-enlightenment 'Hayy ibn Yaqdhan' and the European Enlightenment]"
    }
  ]
}