{
  "content": [
    {
      "type": "text",
      "text": "# Edward North, 1st Baron North\n\n1504\n| birth_place         = London\n| death_date          =\n| death_place         = Charterhouse, London\n| resting_place       = All Saints Church, Kirtling, Cambridgeshire\n| restingplacecoordinates =\n| spouse              = |}}\n| children            = with Alice:\n}}\nEdward North, 1st Baron North ( 1504 – 1564) was an English peer and politician. He was the Clerk of the Parliaments 1531–1540 and Lord Lieutenant of Cambridgeshire 1557–1564. A successful lawyer, he was created the first Baron North, giving him a seat in the House of Lords.\nFamily\nBorn about 1504, North was the only son of Roger North of Nottinghamshire, a merchant and haberdasher, and Christiana, the daughter of Richard Warcup of Sinnington, Yorkshire. After the death of Roger North in 1509, Christiana married, as her second husband, Sir Ralph Warren, Lord Mayor of London.\nEdward North had a sister, Joan, who married William Wilkinson (d. 1543), a mercer in the city of London, and sheriff in 1538–9, by whom she had three daughters. After her husband's death she was silkwoman to Anne Boleyn. She died as a Marian exile in 1556 at Frankfurt.\nCareer\nEdward North studied at St Paul's School under William Lyly, and later entered Peterhouse, Cambridge, but seems never to have proceeded to a degree. He then entered one of the Inns of Court, was called to the bar, and became counsel for the City of London, probably through the influence of Alderman Wilkinson, who had married his sister Joan.\nIn 1531 North was appointed clerk of the parliament and was associated in that office with Sir Brian Tuke. In 1536 he appears as one of the king's serjeants.  In 1541 he resigned his office as clerk of the parliament, on being appointed treasurer of the court of augmentations, a court created by the king for dealing with the estates which had been confiscated by the dissolution of the monasteries. In 1541 he was knighted, and he served as High Sheriff of Cambridgeshire for 1543. He was one of the knights of the shire for Cambridgeshire in the English parliaments of 1542, 1547, and 1553.\nOn the resignation of the chancellorship by Sir Thomas Audley in 1544, North was deputed, together with Sir Thomas Pope, to receive the great seal and to deliver it into the hands of the king. In 1545 he was one of a commission of inquiry as to the distribution of the revenues of certain cathedrals and collegiate churches, and about the same time, he was promoted, with Sir Richard Rich, chancellor of the court of augmentations. On the resignation of his colleague, he became sole chancellor of the court. In 1546 he was made a member of the Privy Council of England, received some extensive grants of former abbey lands, and managed by prudence to retain the favour of his sovereign, although on one occasion towards the end of his reign Henry VIII was induced to distrust him, and even to accuse him of peculation, a charge of which he cleared himself. North was named as one of the executors of King Henry's will, and a legacy of £300 was bequeathed to him.\nOn the accession of King Edward VI, North was induced, under pressure, to resign his office as chancellor of augmentations. He continued as a Privy Councillor during the young king's reign, and was one of those who attested his will, but his name does not appear among the signatories of the deed of settlement disinheriting the Princesses Mary and Elizabeth. North was among the supporters of Lady Jane Gray.\nNorth was not only pardoned by Mary, but was again sworn of the privy council, and on 5 April 1554, he was summoned to parliament as a baron of the realm by the title of Lord North of Kirtling. He was chosen among other lords to receive Philip II of Spain at Southampton on 19 July 1554 and was present at the marriage of Queen Mary. In the following November, he attended the reception of Cardinal Pole at St. James's, and he was in the commission for the suppression of heresy in 1557.\nOn the accession of Elizabeth she kept her court for six days (23 to 29 November 1558) at Lord North's mansion in the London Charterhouse, and some time afterwards he was appointed lord-lieutenant of the county of Cambridge and the Isle of Ely. He was not, however, admitted as a privy councillor, though his name appears as still taking part in public affairs. In the summer of 1560, he lost his first wife, who died at the Charterhouse, but was carried with great pomp to Kirtling to be buried. Lord North entertained the queen a second time at the Charterhouse for four days, from 10 to 13 July 1561. Soon after this he retired from court, and spent most of his time at Kirtling in retirement. He died at the Charterhouse on 31 December 1564, and was buried at Kirtling, beside his first wife, in the family vault. His monumental inscription may still be seen in the chancel of Kirtling Church.\n, Cambridgeshire]]\nMarriages and issue\nLord North was twice married. In around 1528 (his thirty-third year) he married Alice (d. 1560), the daughter of Oliver Squier of Southby, Hampshire. Alice was the widow of Edward Murfyn, a wealthy London merchant, the son of Thomas Murfyn (d. 1523), a former Lord Mayor of London and of John Brigandine of Southampton, Hampshire. By this marriage he acquired a fortune large enough to enable him to purchase the estate of Kirtling, near Newmarket, which remained in the possession of his descendants until 1941. By Alice he had two sons:\n* Roger North, 2nd Baron North, and\n* Sir Thomas North, translator of Plutarch's Lives and other works,\nand two daughters:\n* Christiana, wife of William Somerset, 3rd Earl of Worcester, and\n* Mary, wife of Henry Scrope, 9th Baron Scrope of Bolton.\nIn 1534 he became a kinsman of Thomas Cromwell's nephew, Richard, who married Frances, daughter of Thomas Murfyn by his second wife, Elizabeth Donne, and stepdaughter of Sir Thomas Denys.\nHis second wife was Margaret (d. 1575), daughter of Richard Butler of London, and widow of, first, Andrew Francis; secondly, of Robert Chartsey, alderman of London.; and, thirdly, of Sir David Brooke, chief baron of the exchequer. She survived till 2 June 1575. This lady, like his first wife, brought her husband a large fortune, which he left to her absolutely by his will.\n;Attribution\nNotes\nReferences\n*\n*\n*\n*\n*\n*\n*\n*\nExternal links\n*Hawkyard, A. D. K. (1982). \"[http://www.historyofparliamentonline.org/volume/1509-1558/member/north-edward-1504-64 North, Edward (c.1504-64), of Kirtling, Cambs., the Charterhouse, Mdx. and London]\". In Bindoff, S. T. (ed.). The History of Parliament: the House of Commons 1509-1558. – via History of Parliament Online.\n*[https://www.flickr.com/photos/brokentaco/49535791192/in/photostream/ Monument to Edward North, 1st Baron North, Church of All Saints, Kirtling, Cambridgeshire] flickr"
    }
  ]
}