{
  "content": [
    {
      "type": "text",
      "text": "# Edward C. Wall\n\n|birth_place = Milwaukee, Wisconsin, U.S.\n|death_date  =\n|death_place = Milwaukee, Wisconsin, U.S.\n|party       = Democratic\n}}\nEdward Clarence Wall (August 11, 1843April 25, 1915), was an American grain commission merchant and Democratic Party politician from Milwaukee, Wisconsin.\nBackground\nWall was born in Milwaukee on August 11, 1843. He attended the local schools when a boy, and later attended a school in Stockbridge, Massachusetts. Returning to Wisconsin he finished his education at Racine College, and, in 1861, entered his father's general commission business as a retail clerk. In 1866 he was admitted to a partnership, and, upon the death of his father in 1867, succeeded to the management of the business. In 1877 the firm of Wall & Bigelow was formed, which, for years, did an extensive grain commission and freight forwarding business.\nPolitics\nWall admitted in later years that his first vote was cast for Abraham Lincoln in 1864. In 1874, he was elected to represent the First Ward as an alderman on the Milwaukee Common Council.  He was reelected at the expiration of his first term, and served until his resignation in the fall of 1876. In 1876, he made his first appearance in national politics, by becoming national chairman of the Young Men's Tilden and Hendricks club.\nWall was elected to the Wisconsin State Assembly for the First Milwaukee County Assembly district (First Ward of the City of Milwaukee) as a Democrat in 1877 (incumbent James Greeley Flanders, also a Democrat, was not a candidate for re-election), winning 691 votes to 505 for Republican Carl Doerflinger and 30 for Greenbacker George B. Goodwin. He was appointed to the standing committees on state affairs (which he chaired), and on legislative expenditures.\nHe was re-elected the following year as an \"Honest Money Democrat\", with 735 votes to 714 for Republican William McLaren. He remained on the State Affairs committee (though not as chair), and was also on the joint committee on claims. He was not a candidate for re-election the next year, and was succeeded by Republican Charles C. Paine.\nIn 1878, he was chosen a member of the Democratic state central committee and made its treasurer, a position which he held until his resignation in 1885. In 1885, he was appointed United States collector of internal revenue for the Milwaukee district.\nIn January 1890, he was chosen chairman of the Democratic state central committee, to fill an unexpired term; he would be re-elected by each succeeding state convention until 1896, when he declined further re-election. His greatest work as chairman was done in the campaign of 1890, and during the session of the legislature following. His party was triumphant in the election of 1890, the year in which the leading\nquestion was that of the Bennett compulsory education law. In the wake of the Democratic victory, as chairman of the state central committee, he exercised a sort of supervision over legislative activities by the many new and inexperienced Democratic legislators, particularly in the Assembly.\nNational stage\nIn January, 1892, he was appointed by the Democratic National Committee as one of its members, to fill the vacancy caused by the resignation of John L. Mitchell. When the national convention assembled later that year, he was elected a member of that committee by the Wisconsin delegation for the full term of four years. He was later appointed, by the chairman of the national committee, one of the committee of nine to manage the campaign. At the meeting of the national committee in January, 1896, Wall was appointed member of the committee of nine which was given full power to arrange all of the preliminaries for the convention held in Chicago in July, 1896. At that convention he was re-elected a member of the national committee for the full term of four years.\nWall was a political ally of Bourbon Democrat leaders like William Freeman Vilas, and profited by the alliance. He had an arrangement with the Northern Pacific Railroad which allowed him a fee for every acre of land he was able to recover from public domain lands granted to the railroad and later confiscated; he credited much of his success to his friendship with Vilas, and with United States Secretary of the Interior Hoke Smith and U.S. Chief Land Commissioner Silas W. Lamoreaux.\nIn the United States presidential election of 1904, Wall was Wisconsin's favorite son candidate for the Democratic presidential nomination; a campaign pamphlet and at least two campaign ribbons for his candidacy are known. He received 27 of 1,000 votes on the first ballot at the national convention, coming in fifth.\nPersonal life\nWall married Anna Louisa Hearding in 1878; they had one child, Alexander Wall, born in May 1879. Wall was a member of the Episcopal church.\nWall died on April 25, 1915.\nReferences"
    }
  ]
}