{
  "content": [
    {
      "type": "text",
      "text": "# Edward Jones (bishop)\n\nEdward Jones (1641–1703), was a Welsh Anglican bishop who served as Bishop of Cloyne and Bishop of St Asaph.\nJones was born in July 1641 at Llwyn Ririd, near Montgomery, Powys. He was the son of Richard Jones, by Sarah, daughter of John Pyttes of Marrington. He was educated at Westminster School, whence he was elected in 1661 to Trinity College, Cambridge. He graduated B.A. in 1664, and M.A. in 1668, and was made fellow of his college in 1667. Going to Ireland as domestic chaplain to the Duke of Ormonde, the lord-lieutenant, he was appointed master of Kilkenny College, where Jonathan Swift was his pupil. In May 1677 he was collated to a prebend in the church of Ossory, and was promoted to the deanery of Lismore in November 1678.\nEarly in 1683 he was raised to the bishopric of Cloyne, but during Tyrconnel's administration, in James II's reign, hastily returned to England (1688). In November 1692 he was translated to St. Asaph as successor to Bishop William Lloyd. Jones's episcopate was distinguished by corruption, negligence, and oppression, and contrasts ill with the good administration of his predecessor. An address, signed by thirty-eight of the principal beneficed clergymen, was sent to Archbishop Tenison in March 1697, and in the following July the primate appointed the Bishops of Lichfield and Bangor and Dr. Oxenden, dean of arches, commissioners to receive the presentments of the clergy against Jones on 20 July 1698. The archbishop summoned Jones to answer the charges, but Jones's firm adherence to the court party led to delays in bringing him to trial, and the formal hearing before the archbishop did not commence until 5 June 1700.\nJones signed a written confession of his guilt in promoting to a canonry a notorious person \"accused of crimes and excesses\", in permitting laymen to act as curates, and in entering into simoniacal contracts for the disposal of preferments. The archbishop, in June 1701, pronounced a sentence that the bishop be suspended for six months and thenceforth until he gave satisfaction. The deprivation was continued till 5 May 1702. He died on 10 May 1703 at his house in College Court, Westminster, and was buried at the parish church of St. Margaret's, without inscription or monument.\nHe married Elizabeth, eldest daughter of Sir Richard Kennedy, Baronet, of Wicklow, by whom he had six children.\nJones published a few forms of prayer from the church catechism in Welsh (London, 1695), which was mentioned in his defence at the trial; and issued, probably after his restoration, visitation articles for the diocese, printed in London in 1702.\nMatthew Jones (1654–1717), prebendary of Donoughmore, was a younger brother of the bishop. He accompanied his brother to Ireland, and became vicar-choral of Lismore Cathedral in 1681, precentor of Cloyne Cathedral in November 1683, and prebendary of Donoughmore in 1687. He died on 7 December 1717.\nReferences"
    }
  ]
}