{
  "content": [
    {
      "type": "text",
      "text": "# Edward Lawson, 4th Baron Burnham\n\n|image         = The Lord Burnham in 1943.jpg\n|caption       =\n|nickname      =\n|birth_name    = Edward Frederick Levy-Lawson\n|birth_date    =\n|birth_place   = Mayfair, London, England\n|death_date    =\n|death_place   =\n|placeofburial =\n|allegiance    = United Kingdom\n|branch        = Territorial Army\n|serviceyears  = 1910–1945\n|rank          = Major-General\n|servicenumber = 20295\n|unit          = Royal Bucks Hussars\n|commands      = Yorkshire County DivisionRoyal Artillery, 48th (South Midland) Division99th (Buckinghamshire and Berkshire Yeomanry) Field Brigade, Royal ArtilleryMiddlesex Yeomanry\n|battles       = First World War\n* Gallipoli campaign\n* Sinai and Palestine Campaign\nSecond World War\n* Battle of Dunkirk\n|awards        = Companion of the Order of the BathDistinguished Service OrderMilitary CrossTerritorial DecorationMentioned in Despatches (3)\n|relations     = 1st Baron Burnham (grandfather)3rd Baron Burnham (father)Viscount Burnham (uncle)\n|laterwork     = Managing director, The Daily TelegraphSenior Military Adviser, Ministry of InformationDirector of Public Relations, War OfficeChairman, Labour Committee, Newspaper Publishers' Association\n}}\nMajor-General Edward Frederick Lawson, 4th Baron Burnham,  (16 June 1890 – 4 July 1963) was a British newspaper executive and Territorial Army officer who served with distinction in both World Wars.\nEarly life and family\nLawson was born on 16 June 1890, the eldest son of Colonel William Levy-Lawson (1864–1943) and his wife Sibyl Mary Marshall, eldest daughter of Lt-Gen Sir Frederick Marshall. His father was the younger son of Edward Levy-Lawson, 1st Baron Burnham, the proprietor of The Daily Telegraph, and had served in the Scots Guards and then in the part-time Royal Buckinghamshire Yeomanry (Royal Bucks Hussars), with which he had won a Distinguished Service Order (DSO) during the Second Boer War. His first  cousin  was Mrs  Dorothy Coke (née  Levy-Lawson, died 1937),  wife of Major Sir John Coke (died 1957). His  daughter Lucia wrote a  book  about Hall Barn, her home  from  age 11  and the  seat of the Baron Burnham family.\nEdward Lawson was educated at Eton College and Balliol College, Oxford, where he obtained a third-class degree in modern history in 1913 and played polo for the university. In July 1910 he was commissioned into the Royal Bucks Hussars, a cavalry regiment of the recently created Territorial Force (TF), of which his father became honorary colonel in 1913.\nOn leaving Oxford, Lawson joined the family newspaper, The Daily Telegraph'', as a reporter, first in Paris and then in New York. On the outbreak of war in 1914 he returned to the UK to serve with the Royal Bucks Hussars.\nFirst World War\nThe Royal Bucks Hussars was embodied on the outbreak of war and went to its war station near Bury St Edmunds, later joining a concentration of mounted troops around Churn on the Berkshire Downs. In November the 2nd Mounted Division, of which the Royal Bucks formed part, was sent to guard the East Coast in Norfolk. In April 1915 the division was shipped to Egypt, where it was reorganised as a small dismounted division and sent to Gallipoli.\n2nd Mounted Division landed at Suvla Bay on the night of 17/18 August, with Lawson acting as landing officer. Three days later it was sent into action at the Battle of Scimitar Hill, when it was intended to push through to the second objective after the main Turkish positions had been captured. The Yeomanry moved up at 17.00, marching from their bivouacs across the plain of the Salt Lake, where they 'presented such a target as artillerymen dream of'. On reaching Chocolate Hill they paused to reorganise before moving on towards Scimitar Hill through blinding dust and smoke, with little idea of what they were supposed to do and suffering heavy casualties. Most of the division halted at Green Hill, but Brigadier-General Lord Longford led his 2nd South Midland Mounted Brigade (including the Royal Bucks Hussars) in a charge over Green Hill and up to the summit of Scimitar Hill. Longford was killed, and his men were finally driven from the summit.\nThe casualties at Scimitar Hill had been so severe, and manpower wastage through the summer was so heavy, that the 2nd South Midland Mounted Brigade had to be temporarily reorganised as a single regiment, and was evacuated to Egypt in November for rest and recuperation, where it was reunited with its horses. After service in the Senussi Campaign with the Western Frontier Force, the Royal Bucks Hussars went to Palestine to join the Imperial Mounted Division, with which it served in the First and Second Battles of Gaza. The regiment then transferred to the Yeomanry Mounted Division and fought with it in the Third Battle of Gaza and at the Battle of Mughar Ridge, where it participated in a notable mounted charge. It was involved in Allenby's entry into Jerusalem.\nIn April 1918 the Royal Bucks Hussars went to France to serve on the Western Front, but Lawson was not with them: he had been appointed at age 26 acting Lieutenant-Colonel to command the 1st County of London (Middlesex) Yeomanry, which continued to serve with the Desert Mounted Corps in Palestine for the rest of the war, including the Battle of Megiddo. During the final pursuit towards Damascus, Lawson's regiment was lent to T. E. Lawrence, under whose orders it charged the enemy rear and drove them into a trap, completing the destruction of the Turkish Fourth Army.\nDuring the war Lawson was awarded a Distinguished Service Order, Military Cross and three mentions in despatches.}}\nNewspaperman\nAfter the war, Lawson returned to the Daily Telegraph, where he was known as 'The Colonel', and served as effective second-in-command to his uncle Harry Levy-Lawson, 2nd Baron Burnham, who had inherited the newspaper and been created Viscount Burnham. On 28 January 1920 he married Marie Enid Robson, only daughter of Hugh Scott Robson.\nThe Daily Telegraph was losing circulation, and to Lawson's disappointment his uncle decided to sell it to the Berry Brothers in 1927. Sir William Berry (soon to be created Lord Camrose) was impressed by Lawson's ability and made him general manager of the business. Lawson joked that this was because he was the only person capable of finding his way around the labyrinthine Telegraph offices. Lawson was a moderniser and skilful negotiator, supervising the installation of new printing plant, the takeover of The Morning Post in 1937, and chairing the labour committee of the Newspaper Publishers' Association for 25 years. After his father succeeded as 3rd Baron Burnham in 1933, he was styled the Hon. Edward Lawson.\nTerritorial officer\nLawson maintained his links to the Territorial Army between the wars, helping the Royal Bucks Hussars to convert to Royal Artillery and then to merge with the Berkshire Yeomanry to form the 99th (Buckinghamshire and Berkshire Yeomanry) Field Brigade, Royal Artillery, which he commanded from 1929 until 1933 (his uncle, Viscount Burnham, was also the regiment's Honorary Colonel).\nUnusually for a Territorial officer, he was appointed Commander, Royal Artillery (CRA), of 48th (South Midland) Division in 1938, with the rank of Brigadier.\nSecond World War\nOn the outbreak of war, 48th Division was mobilised, and it landed in France as part of the British Expeditionary Force (BEF) in January 1940. When the Germans invaded France and the Low Countries in May, the BEF moved forward to occupy pre-planned positions in Belgium, but the rapid German breakthrough into France caused it to retreat towards Dunkirk.\nOn 23 May, 48th Division was pulled out to form a new defence line along the canal between Saint-Omer and the coast. Lawson was sent with 'X Force' of artillery, machine guns and infantry ahead of the division to occupy the chosen positions. However, the unexpected surrender of Belgian forces on 27 May 1940 led to a gap appearing between 48th Division in action around Saint-Omer and the coast at Nieuwpoort. Until II Corps could arrive to plug this gap, Lawson was responsible for what the Official History calls 'the most dangerously exposed part of the bridgehead'. He was ordered by the commander of the Dunkirk perimeter, Lt-Gen Ronald Adam to improvise a defence line along the canal and prevent the Germans breaking through to the vital beaches east of Dunkirk where much of the BEF was waiting to be evacuated. At 11.00 on 28 May, advanced German troops reached the canal line, but Lawson seized on the Territorial gunners of 53rd (London) Medium Regiment, Royal Artillery, who were marching towards Dunkirk having fired off all their ammunition and destroyed their guns. Together with detachments of Regular gunners from 2nd Medium Regiment and 1st Heavy Anti-Aircraft Regiment, and sappers from 7th Field Company Royal Engineers, they fought as infantry to hold the line. They came under heavy mortar and machine-gun fire, and the Germans seized a bridgehead at Nieuwpoort, but all subsequent attacks that day were repulsed. Lawson's scratch force was relieved next day and then evacuated to Britain.\nLawson was appointed a Companion of the Order of the Bath for distinguished service in this campaign.\nIn February 1941 he was promoted to the acting rank of major-general and appointed General Officer Commanding (GOC) of the new Yorkshire County Division, responsible for three independent infantry brigades that had been organised for home defence from newly raised battalions of conscripts.\nOn the death of his father on 14 June 1943, Edward Lawson succeeded as 4th Baron Burnham of Hall Barn, Beaconsfield, Buckinghamshire, and as the 4th Baronet.\nWith his newspaper background, Lawson became Senior Military Adviser to the Ministry of Information and was Director of Public Relations at the War Office from 1943 to 1945. His rank of major general was made temporary in February 1942 and permanent in 1945.\nPostwar\nLord Burnham returned to the Daily Telegraph as managing director in 1945, remaining in the post until his retirement in 1961.\nHe died in the Middlesex Hospital on 4 July 1963, and was succeeded as 5th Baron by his eldest son.\nFamily\nLord and Lady Burnham had three children:\n|motto = Of Old I Hold}}\nNotes\nReferences\n* C. F. Aspinall-Oglander, History of the Great War: Military Operations Gallipoli, May 1915 to the Evacuation, London: Heinemann, 1932/Imperial War Museum & Battery Press, 1992, ISBN, 0-89839-175-X.\n* Maj A. F. Becke,History of the Great War: Order of Battle of Divisions, Part 2a: The Territorial Force Mounted Divisions and the 1st-Line Territorial Force Divisions (42–56), London: HM Stationery Office, 1935/Uckfield: Naval & Military Press, 2007, .\n* Sir Arthur Bryant, The Turn of the Tide, 1939–1943, London: Collins, 1957.\n* David L. Bullock, ''Allenby's War: The Palestine-Arabian Campaigns 1916–1918, London: Blandford Press, 1988, .\n* Burke's Peerage, Baronetage and Knightage, 100th Edn, London, 1953.\n* Lt-Col Ewan Butler and Maj J.S. Bradford, The Story of Dunkirk, London: Hutchinson/Arrow, nd.\n* Major L. F. Ellis, History of the Second World War, United Kingdom Military Series: The War in France and Flanders 1939–1940, London: HM Stationery Office, 1954. (Online at [http://www.ibiblio.org/hyperwar/UN/UK/UK-NWE-Flanders/index.html].)\n*\n* T. E. Lawrence, Seven Pillars of Wisdom, London: Jonathan Cape, 1935/Penguin Classics, 1962, ..\n* Norman E. H. Litchfield, The Territorial Artillery 1908–1988 (Their Lineage, Uniforms and Badges), Nottingham: Sherwood Press, 1992, .\n* John North, Gallipoli: The Fading Vision, London: Faber & Faber, 1936.\n* F. W. Perry, Order of Battle of Divisions Part 5A. The Divisions of Australia, Canada and New Zealand and those in East Africa, Newport: Ray Westlake Military Books, 1992, .\n* F. W. Perry, History of the Great War: Order of Battle of Divisions, Part 5b: Indian Army Divisions'', Newport: Ray Westlake, 1993, .\n* Huw Richards, 'Lawson, Edward Frederick, fourth Baron Burnham (1890–1963)', Oxford Dictionary of National Biography, Oxford: University Press, 2004–15.\n*\nExternal sources\n*[http://53rdmediumregtra.webs.com 53rd London Medium Regiment website]\n*[https://web.archive.org/web/20051228103659/http://www.regiments.org/regiments/index.htm Land Forces of Britain, the Empire and Commonwealth (Regiments.org)]\n*[https://generals.dk/general/Lawson/Edward_Frederick/Great_Britain.html Generals of World War II]\n|-"
    }
  ]
}