{
  "content": [
    {
      "type": "text",
      "text": "# Edward F. Jones\n\n|death_date=\n|birth_place= Utica, New York\n|death_place= Binghamton, New York\n|placeofburial= Mount Auburn Cemetery in Cambridge, Massachusetts\n|placeofburial_label= Place of burial\n|allegiance= United StatesUnion\n|branch= United States ArmyUnion Army\n|serviceyears=\n|rank=  Colonel Brevet Brigadier General\n|commands= 6th Massachusetts Volunteer Militia26th Massachusetts Volunteer Infantry\n|unit=\n|battles= American Civil War\n|awards=\n|laterwork=\n}}\nEdward Franc Jones (June 3, 1828 &ndash; August 14, 1913) was an American merchant, manufacturer, soldier, author and politician from New York.\nBiography\nHe was born in Utica, New York, the son of Lorenzo B. Jones and Sophronia (Chapman) Jones. He was educated at Leicester, Massachusetts. In 1850, he married Mary A. Tarbell, of Pepperell, Massachusetts.\nIn 1854, he joined the militia as a lieutenant. In 1861, he joined the 6th Massachusetts Militia as a Major, and he was soon named commander with the rank of Colonel. He led the organization on its famed  march through Baltimore, which sparked the first bloodshed of the American Civil War. His troops traveled onward and helped with the defense of Washington, D.C.\nJones later recruited and commanded the 26th Massachusetts Infantry. On February 24, 1866, President Andrew Johnson nominated Jones for the grade of brevet brigadier general, United States Volunteers, to rank from March 13, 1865, for meritorious services during the war. The U.S. Senate confirmed the award on April 10, 1866.\nIn 1862, he married Susan Annie Brown, from Boston. In 1865, he served in the Massachusetts House of Representatives. Soon afterwards, he moved to Binghamton, New York, where he opened a scale manufacturing plant.  He became widely known as \"Jones of Binghamton\" for his company's advertising, which included the slogan \"Jones pays the freight\" or \"Jones, he pays the freight\", to communicate that, unlike his competitors, he would not expect buyers to pay a delivery charge.\nJones served as Binghamton's Police Commissioner, was a Regent of the University of the State of New York, served as President of the State Board of Equalization, and served on the boards of numerous colleges and charities.\nHe was the Lieutenant Governor of New York from 1886 to 1891, elected on the Democratic ticket with Governor David B. Hill in 1885 and 1888.\nIn 1905, he published the novel Richard Baxter: A Story of New England Life of 1830 to 1840.\nJones continued to operate his business until he lost his sight at the age of 79, after which his scale works was operated by his son.\nHe died in Binghamton, New York, and was buried at Mount Auburn Cemetery in Cambridge, Massachusetts.  His home at Binghamton, known as the Gen. Edward F. Jones House, was listed on the National Register of Historic Places in 1982.\nIn popular culture\nEllis Parker Butler referenced Jones' slogan in The Adventure of the Lame and the Halt, one of his  Perkins of Portland stories. The go-ahead advertising man creates a craze for a vile-tasting tonic water by several means, including the slogan \"Perkins Pays the Freight\". The slogan itself becomes a national catch-phrase.\nSee also\n*List of American Civil War brevet generals\n*List of Massachusetts generals in the American Civil War\n*Massachusetts in the American Civil War\nReferences\n*Eicher, John H. and Eicher, David J. Civil War High Commands. Stanford, CA: Stanford University Press, 2001. .\n*Hunt, Roger D. and Brown, Jack R. Brevet Brigadier Generals in Blue.  Gaithersburg, MD: Olde Soldier Books, Inc., 1990. .\n*[http://politicalgraveyard.com/bio/jones3.html]\n*[https://books.google.com/books?id=TWUUAAAAYAAJ&q=edward+f+jones+lieutenant+governor History of the Military Company of the Massachusetts, Now Called, the Ancient and Honorable Artillery Company of Massachusetts: 1637-1888] by Oliver Ayer Roberts (A. Mudge & Son, 1898)\n*[https://books.google.com/books?id=biZ7wnYuRl8C&dq=edward+f+jones+lieutenant+governor+1828&pg=PA14 Broome County in Vintage Postcards] by Ed Aswad & Suzanne M. Meredith (Arcadia Publishing, 2000, , , page 14)\n*[https://books.google.com/books?id=Fs0Ajlnjl6AC&dq=edward+franc+jones+1828+1913&pg=PA324 Civil War High Commands] by John H. Eicher & John Y. Simon (Stanford University Press, 2001, ,  ; page 324)\nExternal links\n*"
    }
  ]
}