{
  "content": [
    {
      "type": "text",
      "text": "# Edward G. Kuster\n\n| birth_place        = Terre Haute, Indiana, US\n| death_date         =\n| death_place        = Lugano, Switzerland\n| alma_mater         = University of Southern California\n| occupation         = Attorney, theatrical producer\n| spouse           =\n*\n*\n*}}\n| children           = 3\n}}\nEdward Gerhard Kuster (August 15, 1878 – September 1961) was a musician and attorney from Los Angeles for twenty-one years before coming to Carmel-by-the-Sea, California, in 1921. He became involved in theater there and established his own theatre and school. He built the Theatre of the Golden Bough in 1924, and a second and third theater, each called Golden Bough Playhouse, the last of which opened in 1952. Kuster directed 85 plays and acted in more than 50 roles in the 35 years he lived in Carmel.\nEarly life and marriages\nKuster was born on August 15, 1878, in Terre Haute, Indiana. He was the son of Charles Edward Kuster (1842–1915), a German-born Los Angeles, California, physician, and Emma Eshman (died 1905). His parents took Kuster to the theatre at an early age. The family moved to Los Angeles in July 1886, where Kuster attended public schools for three years. The family went to Germany where Kuster attended the Hoehere Burger school in Berlin until 1892. He returned to Los Angeles and finished high school in 1896, studying the cello and becoming an avid theatre buff. He went to the University of Southern California (USC) and graduated in 1900 with a degree of Bachelor of Laws. Kuster also became an early automobile enthusiast.\nKuster married Una Lindsay Call on May 31, 1902, in San Andreas, California. Una earned her Bachelor of Arts at USC in 1908 and her Master's in philosophy in 1910. She and Robinson Jeffers, a medical student, became romantically involved. By 1912 the affair became a public scandal, reaching the front page of the Los Angeles Times. She and Kuster divorced in 1913, and she married Jeffers. Kuster married Edith June Emmons on August 1, 1913, in Bakersfield, California. They separated in 1918, and were divorced in 1920.\nKuster married Ruth E. McDowell in 1920. They moved to Carmel where, inspired by castles from his trip to Germany, he and his wife designed and built a small Medieval European-style stone castle in 1920; it was made of granite stones brought up from the Carmel beach. The Jeffers had preceded the Kusters there, and the two couples became great friends. He married Gabrielle Young-Hunter, daughter of Mary Young Hunter, in Germany in 1928.\nCareer\nKuster passed the California Bar Examination on March 13, 1902, joined the law office of Graves, O'Helveny & Shankland and worked there until 1903. He became the chief clerk for attorney H. W. O'Melveny until 1906 and then practiced law privately in Los Angeles, specializing in railroad rate cases, for example the Switching Case that was heard before the Interstate Commerce Commission in 1908. He joined Joseph P. Loeb in the practice of law, and in 1908, they, along with brother Leon Loeb, formed the law firm of Kuster, Loeb & Loeb. In May 1911, Kuster left the law office. Meanwhile, he began acting in small parts at Los Angele's Majestic Theater in his spare time. He also played cello in the Los Angeles Symphony and became a stage manager and learned lighting at the Denishawn school.\nKuster, with Perry Newberry, became involved with the Carmel Arts and Crafts Club. In 1921, he composed and orchestrated the music for the Irish play, The Countess Cathleen, directed by Herbert Heron, at Forest Theater. After the success of the play, the board of the Forest Theater Society elected him president of the board. In July 1922, he directed the play Caesar and Cleopatra. His wife Ruth played Cleopatra.\nDuring World War I Kuster left his law practice and enlisted in the Coast Guard. During a spell of influenza he was discharged from military service and spent six months in Hawaii.\nFirst Golden Bough Theatre\nIn 1923, Kuster built the Theatre of the Golden Bough. It opened on June 3, 1924, at almost the time as the Arts and Crafts Theater, the first two indoor theatres in Carmel.\nKuster built the Carmel Weavers Studio in front of the theatre, for his wife Ruth in September 1922 (now Cottage of Sweets). Kuster had Michael J. Murphy build the Seven Arts Shop in a Tudor Storybook style in 1923 next to the Golden Bough theatre and hired Gottried to build Sade's nearby.\nIn 1926, Kuster obtained the first U.S. rights to The Threepenny Opera seven years before it opened on Broadway. He was criticized, when he put on the plays They Knew What They Wanted and Beggar on Horseback. Maurice Browne and wife Ellen Van Volkenburg directed its the theatre's acting school. In 1927, Kuster studied theatre production techniques in Berlin and Munich for a year. During Great Depression, Kuster had to lease out the theatre for a period of five years, which then operated as a movie theatre.\nIn 1929, Kuster purchased the struggling Arts and Crafts Theater and the Carmel Arts and Crafts Club. He remodeled the theatre facility and renamed it the Studio Theatre of the Golden Bough. He then moved all his plays concerts, traveling theatre groups, lectures and other theatre activities to the renamed Studio Theatre of the Golden Bough.\nFires and rebuilding\nIn 1935, Kuster renegotiated his lease with the movie tenants to perform a stage play one weekend each month. On May 17, 1935, at the Golden Bough, Kuster opened his adaptation of the Austrian comedy By Candlelight, by  and Karl Farkas. Two nights later, the theatre was destroyed by fire. Arson was suspected. Kuster left Carmel and opened a 200-seat Golden Bough Playhouse in San Francisco, where he had produced plays at the San Francisco School of Theater from 1932 to 1934. He directed two seasons for the Fresno Players; his By Candlelight was the opening bill in October 1937 of the Golden Bough Theatre Guild's fall and winter season. He and his wife, Gabrielle, were in the cast. In 1938, labor union problems forced him to give up the project. Later that year he moved to Hollywood for two years as the personal assistant to Max Reinhardt. While there, he taught classes and directed English and American plays in Reinhardt's Theatre Workshop.\nIn 1940, Kuster moved his film operation to Carmel and called it the Filmarte Group. He also restarted the Carmel Arts and Crafts Theatre, renaming it the Golden Bough Playhouse and again put on plays, foreign films, and movies. For two summers, 1940 and 1941, he directed the Golden Bough School of Theatre. Kuster revived By Candlelight on May 16, 1949. However, on May 21, this second Golden Bough also burned down. Once again, arson was suspected. The production moved to the Sunset School Auditorium.\nKuster built a two-theater facility on the site. A third Golden Bough facility was built. The facility opened on October 2, 1952, with a Monterey Symphony Orchestra concert. On May 18, 1956, Kuster ended his thirty-five years of acting and directing by appearing as Grandpere in the play The Happy Time.\nDeath\nKuster died, at age 83, in Lugano, Ticino, Switzerland, while traveling with his wife in Europe. He was buried in Lugano. Gabrielle returned to Carmel Valley, California. She died in August 1978.\nSee also\n* List of Historic Homes in Carmel Point\nReferences\nExternal links"
    }
  ]
}