{
  "content": [
    {
      "type": "text",
      "text": "# Edward Tuckerman\n\nTuck}}\n| birth_place             = Boston, Massachusetts\n| death_date              =\n| death_place             =\n| residence               =\n| citizenship             =\n| nationality             = American\n| ethnicity               =\n| field                   = Botany\n| work_institution        = Amherst College\n| education               = Boston Latin School\n| alma_mater              = Union CollegeHarvard Law SchoolHarvard Divinity School\n| doctoral_advisor        =\n| doctoral_students       =\n| known_for               =\n| author_abbreviation_bot = Tuck\n| author_abbreviation_zoo =\n| prizes                  =\n| spouse                  = Sarah Cushing\n| footnotes               =\n}}\nEdward Tuckerman (December 7, 1817, in Boston, Massachusetts – March 15, 1886) was an American botanist and professor who made significant contributions to the study of lichens and other alpine plants. He was a founding member of the Natural History Society of Boston and most of his career was spent at Amherst College. He did the majority of his collecting on the slopes of Mount Washington in the White Mountains of New Hampshire. Tuckerman Ravine was named in his honor. The standard botanical author abbreviation Tuck. is applied to species he described.\nEarly life and education\nTuckerman was the eldest son of a Boston merchant, also Edward Tuckerman, and Sophia (May) Tuckerman. He studied at Boston Latin School and then at his father's urging at Union College in Schenectady, which he entered as a sophomore and where he completed a BA in 1837 and to which he returned for his MA after taking a law degree at Harvard in 1839, traveling in Germany and Scandinavia, and making the first of his botanical studies in the White Mountains. In 1846, he returned to Harvard as a senior (telling the President he intended to correct his father's error in breaking the family tradition), completed a second BA in 1847, then two or three years later entered the Divinity School and graduated from there in 1852. His brother was Frederick Goddard Tuckerman (1821–1873), the American poet and his first cousin was Henry Theodore Tuckerman (1813–1871), an American writer, essayist and critic. His sister was the writer and spiritualist medium Sophia May Eckley (1822-174).\nCareer\nWhen Meriwether Lewis and William Clark went on their 1804-1806 expedition across the western United States, they collected many plant, seed, and flower species that had never been seen before.  Lewis wrote notes about these species and they were put on scrap book paper.  After Lewis supposedly committed suicide in 1809, dozens of his scrapbook pages were stolen by a botanist who was supposed to draw and classify the plants collected on the expedition.  He took the papers to England to sell for money at an auction in 1842.  Tuckerman noticed the auction and the significance of these papers.  He bought them and then donated them to the Academy of Natural Sciences in Philadelphia.\nAfter teaching at Union College, Tuckerman was a professor at Amherst College from 1854 until his death, successively Lecturer in History, Professor of Oriental History, and from 1858 Professor of Botany. Amherst awarded him an LLD.\nHe was elected a member of the American Antiquarian Society in 1855.\nHis first paper, on New England lichens, was given in 1838 or 1839. In 1843, he published privately the first serious systematic analysis of the genus Carex, Enumeratio Methodica Caricum Quarundam. Tuckerman liked to write his botanical studies in Latin. He also made the first systematic study of native Potamogeton, and after becoming Professor of Botany at Amherst, began preparing A Catalogue of Plants Growing without cultivation within 30 miles of Amherst College (published in 1875).  However, his main focus was lichens. He published a number of important studies in the field, drawing on both his own collecting and specimens sent to him from elsewhere, in particular by Charles Wright from Cuba. His career culminated in the publication of [https://books.google.com/books?id=hK4VAAAAYAAJ Genera Lichenum: An Arrangement of the North American Lichens] (1872) and [http://catalog.hathitrust.org/Record/001497334 Synopsis of the North American Lichens, Part 1] (1882). Between 1847 and 1863 Tuckerman edited three exsiccata-like series, one of them being Lichenes Americae septentrionalis exsiccati, curante Edvardo Tuckerman. His last botanical publication was in 1884, and he may have published anonymous theological articles after that.  Tuckerman did not accept that lichens are a combination of fungi and algae, a theory advanced late in his life.\nHonours\nHe was honoured in the naming of several plant taxa including;\nTuckermania  (family Ericaceae) now a synonym of Corema. and Tuckermannia  (Asteraceae family) now a synonym of Coreopsis.\nIn 1933 Hungarian lichenologist Vilmos Kőfaragó-Gyelnik circumscribed the lichen genus of Tuckermannopsis.\nTuckneraria is a genus of lichen-forming fungi, which was published by Randlane & A.Thell in 1994.\nLastly, Esslinger in 2003 published Tuckermanella, a genus of lichen-forming fungi in the family Parmeliaceae.\nBetween 1937 and 1942 the Farlow Herbarium distributed an exsiccatal series called Reliquiae Tuckermanianae.\nPersonal life\nTuckerman was married to Sarah, daughter of Thomas Parkman Cushing, who was his father's business partner. They had no children.\nTuckerman died on March 15, 1886.\nSee also\n*:Category:Taxa named by Edward Tuckerman\nReferences\nExternal links\n* [https://archivesspace.amherst.edu/repositories/2/resources/52 Edward Tuckerman Botanical Papers] at the Amherst College Archives & Special Collections\n* [https://archivesspace.amherst.edu/repositories/2/resources/373 Edward Tuckerman Materials] at the Amherst College Archives & Special Collections\n* Fred Burchsted, [http://www.huh.harvard.edu/libraries/nenats/NEnatsSZ.html#Tu New England Naturalists: A Bio-Bibliography]\n*[https://www.lib.uchicago.edu/e/scrc/findingaids/view.php?eadid=ICU.SPCL.CRMS146 Guide to Edward Tuckerman, A Synopsis of the Lichenes of New England, the Other Northern States, and British America 1853-1870] at the [https://www.lib.uchicago.edu/scrc/ University of Chicago Special Collections Research Center]"
    }
  ]
}