{
  "content": [
    {
      "type": "text",
      "text": "# Edward Duplex__disambig_1\n\n| death_place        = Sacramento, California, U.S.\n| burial_place       = Marysville City Cemetery, Marysville, California, U.S.\n| known_for          =\n}}\nEdward Parker Duplex (c. 1830 &ndash; January 5, 1900) was an American entrepreneur, politician, and civil rights activist in California. He was the first African-American mayor in California, elected to office in Wheatland in 1888, and was a leader in the state's Colored Conventions movement. Born in Connecticut, he migrated to California during the Gold Rush, and was a partner in the Sweet Vengeance Mine. Duplex used his share of profits from the mine to start his own barbershop in Marysville, California, where he employed other Black barbers. He later moved to Wheatland, where his barbershop became one of the two longest running businesses in the town.\nEarly life and family\nBorn free in New Haven, Connecticut, Edward was the grandson of Revolutionary War veteran Prince Duplex Sr. His paternal grandfather was born a \"servant for life\", but was a \"free man of color\" by the time he enlisted. His paternal grandmother was Lement Parker.\nHis father, Prince Duplex Jr., worked as a steward on the New Haven Steamship Line which ran between Long Island and New York City. Prince Jr. was an active member of the Temple Street African Congregational Church, the first Black church in New Haven, and died in 1832, when Edward was very young.\nHis mother, Adaline Duplex (née Francis), was a professional seamstress. After the death of his father, Adaline was briefly married a second time to a man named Whiting, and raised Edward's older brother Elisha and his sister Adeline Frances. Both Edward and Elisha trained as barbers and moved to California in 1852, but his brother died a few years later of consumption.\nCareer\nMining\nDuplex arrived in California in 1852. He became a partner in a gold mine in Brown's Valley, the Sweet Vengeance Mine, which was owned and operated by African Americans. Despite the Black testimony exclusion law which had passed in California in 1851, Duplex was allowed to testify in court against a white assailant who was convicted of robbery in 1853. He later served on the board of trustees of the Rare, Ripe Gold and Silver Mining Company, incorporated in 1868, as secretary.\nMarysville\nIn 1854, he moved to Marysville, Yuba County, where he became the town's best-known Black citizen. Duplex opened a barbershop in Marysville, Yuba County, using his profit from the gold mine.\nHis barbershop was called the Metropolitan Shaving Saloon, and was on D Street, which was known as \"barber row.\" An employer of other Black barbers, Duplex advertised in 1858 that he would have seven barbers in attendance at the California State Fair. In 1859, The Daily National Democrat reported that Duplex had constructed a row of fans, powered by a steam engine, above the chairs at the Metropolitan Barber Shop. The newspaper praised the constant circulation of air as \"truly delightful\".\nThat year, he traveled to New Haven to bring his mother Adaline back with him to California, where she continued working as a dressmaker. Duplex was active in the Mount Olive Baptist Church in Marysville, and was a Freemason, belonging to the Prince Hall Masonic Lodge.\nColored Conventions Movement\nFrom the 1850s through the 1870s, Duplex was a leader in the Colored Conventions Movement in California, traveling long distances to attend every meeting in Sacramento and San Francisco. He served as a delegate from Yuba County at the California Colored Citizens Convention in 1855, and was a state executive committee member for the convention in 1856. He was an advocate for allowing Black testimony in the court system, and lobbied for equal educational opportunities for African Americans. In 1874, E. P. Duplex spoke in front of the Board of Education in Marysville to request that Black primary school children, who were taught in an underfunded segregated school, receive access to intermediate and grammar school education.\nDuplex occasionally wrote articles about California for ''Frederick Douglass' Paper, an anti-slavery newspaper. He supported the creation of the Mirror of the Times'', California's first Black newspaper, in 1857.\nIn 1861, his name appeared on a petition sent to the United States Congress. The petition listed the names of 240 California Blacks requesting funding to cover the cost of leaving the United States. Historian Rudolph Lapp argues that the petition was a symbolic protest against the narrow objectives of the Civil War prior to the Emancipation Proclamation, rather than a genuine request.\nAfter the Civil War, Duplex continued his involvement with the Black press. He was an agent for The Elevator newspaper and occasionally contributed content to that paper, as well as the Pacific Appeal. Edward and Sophie Duplex became friends of Jennie Carter, who wrote under the pen name Semper Fidelis.\nWheatland\nIn the 1870s, he moved his barbershop, the Hairdressing and Shaving Saloon, to Wheatland, a small, nearly all-white community near Sacramento. He sold a hair care product, \"Eau Lustral Hair Restorative\", and also opened a bath house.\nOn April 11, 1888, Edward Duplex was elected as mayor by the city of Wheatland's board of trustees. He became the first Black mayor of California, two years before a state law passed eliminating segregated schools. He served one term and returned to running his businesses.\nPersonal life\nAt some point in the early 1860s, Edward married Sophie Elizabeth, who was originally from New York. They had at least five children, two of whom survived to adulthood. Their son Edward became a barber in Oakland, California; they also had a daughter named Louisa.\nDeath and legacy\nDuplex died in Sacramento on January 5, 1900, but is buried at the Marysville City Cemetery. His barbershop on 410 Main Street was one of the oldest business in continuous operation in Wheatland. The Edward P. Duplex Continuation High School, which opened in March 2019 in Wheatland, is named after him.\nSee also\n*List of first African-American mayors\n*African American mayors in California\nNotes\nReferences\nExternal links\n* [https://web.archive.org/web/20080501051734/http://www.nps.gov/history/history/online_books/5views/5views2h54.htm Biographical sketch of Edward Duplex at the National Park Service]"
    }
  ]
}