{
  "content": [
    {
      "type": "text",
      "text": "# Edward Bolitho\n\n| image               = Edward Bolitho.jpg\n| imagesize           =\n| caption             = Colonel Bolitho in 2013\n| office              = Lord Lieutenant of Cornwall\n| monarch             = Elizabeth IICharles III\n| term_start          = 19 September 2011\n| term_end            =\n| predecessor         = Lady Mary Holborow\n| successor           =\n| birth_date          =\n| birth_place         = Penzance, Cornwall, England\n| death_date          =\n| death_place         =\n| nationality         = British\n| spouse              = Alexandra, née Morgan-Giles\n| relations           =\n| children            = 2 daughters, 1 son\n| residence           =\n| alma_mater          = Pembroke College, Cambridge\n| occupation          = Landowner\n| profession          = Army officer\n| allegiance          = British\n| branch              = Army\n| unit                = Grenadier Guards\n| serviceyears        =\n| rank                = Colonel\n| mawards             = KCVO, OBE, CStJ\n| signature           =\n| website             = [http://www.cornwall.gov.uk www.cornwall.gov.uk]\n| footnotes           =\n}}\nColonel Sir Edward Thomas Bolitho  (born 30 December 1955) is a former British Army officer, who has served as Lord Lieutenant of Cornwall since 2011.\nEarly life\nBolitho was born into a Cornish gentry family at Penzance, Cornwall, the elder son of Major Simon Edward Bolitho, MC, High Sheriff of Cornwall (1956–57), and grandson of Sir Edward Bolitho, Lord Lieutenant of Cornwall (1936–62).\nAfter Eton, he went up to Pembroke College, Cambridge, but returned to Cornwall in 1998 after serving in the British Army. In 1979, Bolitho married Alexandra, younger daughter of Sir Morgan Morgan-Giles, and the couple have three children, twin daughters and a son; all are enthusiastic Cornish Pirates supporters.\nMilitary career\nBolitho joined the Grenadier Guards in 1978, serving with the regiment for 20 years. He commanded the 1st Battalion between 1993 and 1995, being appointed OBE.\nLater life\nOn returning to Cornwall, Bolitho took over the management of Bolitho Estates, a family-owned business which develops, renovates, and leases out farms, houses, and commercial properties. It also manages some leisure activities, including Trewidden, Trengwainton Garden (in partnership with the National Trust) and holiday properties, being closely involved in conservation matters. Bolitho is also Chairman of the South West Region committee of the Country Land and Business Association (CLA) and plays a part in other local activities, including the Penzance Sea Cadets, the Penwith Farming Forum, as well as the Royal Cornwall Show.\nBolitho served as High Sheriff of Cornwall from March 2011 until March 2012, and jointly from September 2012 as Lord Lieutenant of Cornwall, succeeding Lady Mary Holborow, having served as a Deputy Lieutenant (2008–11). He has been Chairman of the Association of Lord-Lieutenants since 2018.\nAdmitted as a Freeman of the City of London and then a Liveryman of the Goldsmiths' Company, Bolitho is also a member of HM Body Guard of the Honourable Corps of Gentlemen at Arms, and in 2018 became a Commander of the Order of St John (CStJ). Bolitho was appointed Knight Commander of the Royal Victorian Order (KCVO) in the 2024 New Year Honours.\nHe is the President of the Cornwall Heritage Trust.\nReferences\nExternal links\n* [https://www.nationaltrust.org.uk/trengwainton-garden Trengwainton]\n* [https://trewidden.co.uk/trewidden-gardens/history/ Trewidden]\n* [http://www.burkespeerage.com/ www.burkespeerage.com]"
    }
  ]
}