{
  "content": [
    {
      "type": "text",
      "text": "# Edward Rosewater\n\n| birth_place =  Bukovany, Bohemia\n| death_date  =\n| death_place = Omaha, Nebraska\n| occupation     = Editor, Publisher\n| spouse         =\n| children       = Victor Rosewater\n}}\nEdward Rosewater, born Edward Rosenwasser, (January 21, 1841 – August 30, 1906) was a Republican Party politician and newspaper editor in Omaha, Nebraska. Rosewater had a reputation for being \"aggressive and controversial\", and was influential in the Nebraska state Republican Party.\nBiography\nBorn in Bukovany, Bohemia to a Jewish family, Rosewater immigrated to the United States during 1854. Credited for telegraphing the \"Emancipation Proclamation\", and the \"Gettysburg Address\".\nAbolitionist movement\nRosewater attended a commercial college.  He then became an employee of a telegraph company. He worked in Oberlin, Ohio during 1859 during the celebrated abolitionist cause célèbre, the Wellington rescue case. During that time Rosewater became associated with Simeon Bushnell and Charles Langston. \"The outbreak of the American Civil War found him in the employ of the Southwestern Telegraph Company [(later Western Union)] in Alabama, and he was absorbed with it into the Confederacy.  There was no getting away, and he was transferred to Nashville, Tenn.\"\nWhile in Alabama, he had transcribed the speech in which Jefferson Davis vowed to “carry the sword and torch through the northern cities” and sent it to the Associated Press.  In a contretemps between Davis and Rosewater over this speech many years later, Davis intimated (so Rosewater maintained) that “from the information he could procure, [Rosewater] was a northern spy and not admitted into [the] good secession society of northern Alabama.”  When Union forces retook Nashville during February 1862, Rosewater offered his services, supervising the restoration of the army's telegraph lines across the Cumberland Gap.  A brief visit to his family in Cleveland followed, after which he enlisted in the United States Army Telegraph Corps, staying with General John C. Frémont throughout his West Virginia campaign.\nLater Rosewater was attached to the staff of General John Pope, remaining with him until after the Second Battle of Bull Run. Afterwards he was stationed in Washington. While serving at the White House telegraph office, Rosewater was responsible for sending out President Abraham Lincoln's \"Emancipation Proclamation\" on January 1, 1863.\nArrival in Omaha\nDuring the summer of 1863 when Rosewater came to Omaha, it was the terminus of the Pacific Telegraph Company. He was the Western Union manager and an Associated Press agent, and soon became the Omaha correspondent for several eastern daily newspapers.  Rosewater married Leah Colman on November 13, 1864 in Cleveland, Ohio, departing after the wedding for Omaha, Nebraska where he had secured a home for his new bride.\nDuring the autumn of 1870 Rosewater was elected to the Nebraska House of Representatives, and the next year he initiated the newspaper Omaha Bee. Less than a month after initiating the Bee, he initiated the weekly Pokrok Západu (The Progress of the West), the first Czech-language newspaper in Omaha.\nWhile in the Legislature, Rosewater was credited with creating the first Omaha Board of Education.\nWith his control the Omaha Bee'' endorsed progressive ideas such as creation of a school board for the Omaha Public Schools and direct election of senators.  But at the same time, Rosewater opposed women's suffrage.  A period review of his writing style commented that he wrote \"concise, pointed, and clear, and in political campaigns, especially, he is an untiring and dauntless fighter.\"\nRosewater served on the Republican National Committee during the late 19th century. During 1888 he built the Bee Building, a downtown landmark which was demolished during 1966. During 1897, at the behest of President McKinley, Rosewater came to Washington D. C. to direct the U. S. delegation at the Congress of the Universal Postal Union (the international body responsible for promoting efficiency in the flow of mail from country to country, tasked that year with securing cheaper international postage).  This experience influenced his work as an organizer for the 1898 Trans-Mississippi Exposition, for he prevailed on the Post Office to produce a special Trans-Mississippi Issue of nine stamps commemorating the Exposition, and was credited with much of the success of that event. The most profitable event of the exposition, an Indian Congress that convened representatives of some 35 tribes was \"the child of [Rosewater’s] brain,\" according to the Congress's chief ethnological consultant James Mooney, and its \"successful outcome was due chiefly to his tireless activity and unfaltering courage.\" Rosewater also ran two losing campaigns for a U.S. Senate seat in Nebraska. He died at the Omaha Bee building on August 30, 1906.\nControversy\nRosewater constantly pursued his own version of news, and often got into confrontations, with one even being given front page treatment in ''The Day's Doings'', a sensationalist New York City journal. In another fight Rosewater was almost killed by a local worker after reporting on that man's secret romantic affair. Rosewater's style and treatment of the news left him vulnerable to criticism of his journalism, however, they also lent to personal attacks, more than one of which were anti-Semitic in their nature.\nLegacy\nImmediately before his death, Rosewater was involved in founding the American Jewish Committee. After he died suddenly of natural causes, his son Victor Rosewater joined the AJC instead of him. During 1957 the Columbia Broadcasting System and the AJC produced a dramatic television show highlighting Rosewater's arrival in Omaha, his anti-slavery attitude and his journalistic style.\nEdward Rosewater's newspaper reporting style resulted in the Omaha Bee being considered an example of yellow journalism.  Critics believed its sensationalized news contributed to tensions resulting in the Omaha Race Riot of 1919.\nDuring 1910, Rosewater School in Omaha was built in Rosewater's honor.\nSee also\n* History of Omaha\n* Czechs in Omaha, Nebraska\nReferences\nExternal links\n* [https://web.archive.org/web/20070710194541/http://www.nebraskastudies.org/0700/media/0701_013302.jpg Historic photo] of Edward Rosewater.\n*  at the Nebraska State Historical Society\n* This site allows users the ability to read all of the issues of the Omaha Daily Bee from 1872-1922 as they were originally published in PDF format."
    }
  ]
}