{
  "content": [
    {
      "type": "text",
      "text": "# Edward Janiak\n\n| successor        =\n| other_post       = Bishop Emeritus of Kalisz (2020–2021)\n| birth_date       =\n| birth_place      = Malczyce, Poland\n| death_date       =\n| death_place      = Wrocław, Poland\n| previous_post    =\n| coat_of_arms     = Coat of arms of Edward Janiak.svg\n| motto            =\n| module           =\n| date of priestly ordination  = 19 May 1979\n| place of priestly ordination =\n| consecrated by               = Henryk Roman Gulbinowicz\n| co-consecrators              =\n| date of consecration         = 30 Nov 1996\n| place of consecration        = Cathedral of St. John the Baptist in Wroclaw, Archdiocese of Wroclaw\n}}\n}}\nEdward Janiak (14 August 1952 – 23 September 2021) was a Polish prelate of the Catholic Church, who served as the bishop of the Diocese of Kalisz from 2012 to 2020. He was previously an auxiliary bishop of the Archdiocese of Wrocław and titular bishop of Scillium from 1996 to 2012. In 2020, after allegations and an investigation of sexual abuse cover-up by Janiak, Pope Francis permanently removed Janiak from ministry and banned him from the diocese of Kalisz. Janiak died less than a year later in 2021 due to lung cancer.\nBiography\nEarly life\nJaniak was born in the town of Malczyce to a religious family. He had one younger brother who also became a priest. He graduated from the Technical School of Wood Industry in Sobieszów, obtaining a maturity certificate in 1971. Before entering the seminary, he studied for two years at the Faculty of Wood Technology of the University of Life Sciences in Poznań.\nFrom 1973 to 1979 he studied philosophy and theology at the Pontifical Faculty of Theology in Wrocław, and obtained a master's degree in theology. During the same time, he also studied and lived at the Metropolitan Major Seminary in Wrocław. He was ordained a priest on 19 May 1979 in the Cathedral of St. John the Baptist in Wroclaw by local auxiliary bishop . After his ordination he continued his studies at the , where in 1983 he obtained a licentiate in moral theology. From 1983 to 1986 he continued his studies in moral theology at the Pontifical University of St. Thomas Aquinas, from which he graduated with a doctorate degree.\nSexual abuse crisis\nIn 2019 the documentary film by Polish director Tomasz Sekielski titled \"Tell No One\" and its 2020 successor \"Hide and Seek\" brought mainstream attention to how many Polish bishops were ignoring and neglecting reports of sexual abuse by priest in their diocese. The latter documentary was especially critical of Janiak's handling of abuse allegations in the Kalisz diocese, showing him berating the parents of an abuse victim who had filed charges. It was later revealed that in May 2020 the priest of the diocese of Kalisz were asked to sign a letter pledging their obedience to Janiak, but most refused and instead asked the Vatican to investigate him. In June 2020 Pope Francis permanently removed Janiak from episcopal ministry and installed Grzegorz Ryś as a caretaker of the Kalisz diocese.\nDeath\nOn 23 September 2021, Janiak died in a hospital in Wrocław after battling lung cancer for several years.\nReferences"
    }
  ]
}