{
  "content": [
    {
      "type": "text",
      "text": "# Edward Gerstenfeld\n\nEdward (Eduard) Issakovich Gerstenfeld (January 1915 in Lemberg &ndash; December 1943 (?) in Rostov-on-Don, USSR) was a Polish chess master.\nBorn into a Jewish family in Lviv, Galicia (then Austria-Hungary), he came 3rd, behind Henryk Friedman and Izaak Schächter, in the Lviv City championships in 1933. He came 3rd at Lviv 1933 (LKSz, Oskar Piotrowski won), 7th in the Lviv City-ch, and came first in the Lviv City-ch in 1935.\nIn the period between 1935 and 1939, he lived in Łódź. In 1935, Gerstenfeld shared 4th with Jakub Kolski, behind Izaak Appel and Achilles Frydman, in Łódź (quadrangular). He tied for 2nd-5th with A. Frydman, Schächter and Abram Szpiro in Łódź (pre-Olympic tournament, Friedman won), and took 15th in Warsaw (the 3rd Polish Chess Championship, Savielly Tartakower won). In 1936, he played a match against Szpiro in Łódź, shared 2nd with Schächter, behind Szpiro, at Częstochowa (POL-ch elim.), and tied for 2nd with Appel, behind A. Frydman, in Łódź (ŁTZGSz). In 1936/37, he shared 1st with Paulin Frydman and Appel in Łódź. In 1937, he took 5th in the Łódź City-ch, and tied for 9-10th in Jurata (the 4th POL-ch; Tartakower won). In 1938, he took 6th in Łódź (Vasja Pirc won).\nIn summer 1939, before World War II broke out, he returned to Lviv. According to the secret agreement between the Soviet Union and Nazi Germany (Ribbentrop-Molotov Pact), Lviv was captured by the Soviets, and then incorporated to the Ukrainian SSR in Autumn 1939 (the German–Soviet Treaty of Friendship, Cooperation and Demarcation).\nIn March 1940, he took 4th in Lviv (Western Ukrainian championship, Abram Khavin won). In 1940, he tied for 16-17th in Kiev (the 12th Ukrainian Chess Championship, Isaac Boleslavsky won). In August 1940, he won in Lviv, followed by Appel, Friedman and Schächter. In 1940, he shared 1st with Mark Stolberg in Kiev (USSR-ch semi-final). In September–October 1940, Gerstenfeld took 17th in Moscow (the 12th USSR Chess Championship). The event was won by Andor Lilienthal and Igor Bondarevsky. In January/February 1941, he won ahead of Appel, Friedman, Emanuel Rubinstein and Schächter, in the Lviv City championships. In June 1941, he was at 3rd place in Rostov-on-Don (the 13th USSR-ch semi-final), when Operation Barbarossa, the German attack on the Soviet Union, interrupted the event.\nThe exact cause of his death remained unclear. According to one source, he became a victim of Nazi atrocities in Autumn 1942 (the Lemberg Ghetto or the Belzec extermination camp), but to others, he was shot by Nazis during the mass killing of Jewish people in Rostov-on-Don, Russia, in December 1943. Rostov-on-Don was liberated by the Soviet Army on 14 February 1943.\nReferences\nExternal links\n*[http://www.chessgames.com/perl/chessplayer?pid=10744 Chessgames.com ::Eduard Issakovich Gerstenfeld]\n*[http://www.365chess.com/players/Eduard_Issakovich_Gerstenfeld 365Chess.com :: Eduard Issakovich Gerstenfeld]"
    }
  ]
}