{
  "content": [
    {
      "type": "text",
      "text": "# Edward J. Sponga\n\nEdward J. Sponga (February 12, 1918 &ndash; May 3, 2000) was a former Jesuit priest in the Society of Jesus. Sponga served as the 16th President of the University of Scranton from 1963 until 1965. Sponga made headlines when he left the priesthood in July 1968 in order to marry Mary Ellen Barrett, a divorced mother of three.\nEarly life and education\nSponga was born in Philadelphia to Bartholomew and Adeline Sponga on February 12, 1918. He attended Roman Catholic High School and graduated in 1935.\nThat same year, at just 17 years of age, Sponga entered the Society of Jesus at the Jesuit novitiate of St. Isaac Jogues in Wernersville, Pennsylvania. For the next decade before becoming ordained in 1948, Sponga studied theology and philosophy at St. Isaac Jogues and Woodstock College in Maryland. He completed his doctorate in philosophy in 1955 from Fordham University.\nPriesthood\nAs a Jesuit scholastic, before his ordination in 1948, Sponga served as a teacher for three years at St. Joseph's Preparatory School from 1942 until 1945.\nFrom 1950 until 1953, Sponga worked as a professor of philosophy at the University of Scranton, a position which he served for three years before leaving to finish his doctoral studies at Fordham University. Once his degree was completed in 1955, he was again assigned to the University of Scranton, first as a professor of philosophy before assuming the chair of the philosophy department and then being appointed as Dean of the Graduate School, posts he served simultaneously.\nIn 1957, Sponga was named head of Woodstock College, the Jesuit theological center in Maryland, and the rector of its Jesuit community. At thirty-nine years of age, he became the youngest president of the College since it was founded in 1869. Under Sponga's supervision, Woodstock College recruited a number of well known theologians, including Father John Courtney Murray, S.J. He served as Woodstock's president for six years until he was appointed the president of the University of Scranton in 1963.\nPresident of the University of Scranton\nSponga served as the sixteenth president of the University of Scranton from 1963 until 1965. While Fr. Sponga's presidency was to be the shortest of all of the university's presidents except for three acting presidents, it was not without its accomplishments.\nWhile Sponga was president, the university continued its expansion plan, which had been put into place by former University President Fr. John Long. First, he completed the move from the university's original campus on Wyoming Avenue to the former Scranton Family Estate in the lower Hill section. He donated La Salle Hall, the former Christian Brothers residence and a property valued at $360,000, to the city of Scranton in 1964 as a contribution to the Central City Redevelopment Project. In 1964, Sponga also transferred the title of Old Main, the university's first building constructed in 1888, to the Diocese of Scranton and St. Peter's Cathedral. Additionally, Sponga advanced several construction projects which Fr. Long had proposed. During his presidency, he oversaw the completion of buildings which had been in the planning stages during the presidency of Fr. John Long: two larger residence halls, Driscoll Hall and Nevils Hall which were completed in 1965. While the athletic center, named in honor of Fr. John Long, was not completed until 1967, Sponga secured funding for the project and organized construction plans.\nUnder Sponga, Scranton Preparatory School moved to its new location on the 1000 block of Wyoming Avenue from its temporary home in Old Main, the former University building. Additionally, in 1964 the university received a quarter-million dollar electronic computer system designed to facilitate research projects within the local community which would also lay the foundations for instructional programs in computer science.\nSponga also worked extensively with the students of the University of Scranton and encouraged their participation in university affairs. He created a task force, composed of faculty and student representatives, which explored solutions to the problems faced by the growing University. Finally, he revised some of the curriculum requirements, particularly in Theology and Philosophy, developed the Honors Program, and increased the academic and entrance standards of the university.\nProvincial Superior\nIn 1965, it was announced that Sponga would be leaving his post as president of the University of Scranton because he had been appointed the Provincial Superior of the Maryland Province of the Society of Jesus. As Provincial, Sponga oversaw more than 1,000 Jesuit priests, lay brothers, and seminarians in Pennsylvania, New Jersey, Maryland, Delaware, Virginia, West Virginia, North Carolina, and Washington, D.C.\nIn 1968, Sponga resigned from his post as Provincial Superior when he abruptly left the Jesuits and the Roman Catholic priesthood.\nMarriage\nIn July 1968, at the age of 50, Sponga surprised many within the Jesuits when he unexpectedly resigned his post as Provincial Superior and left the Society of Jesus, breaking his vow of celibacy in order to marry a 33-year-old divorced nurse named Mary Ellen Barrett. They married in a civil ceremony on July 12, 1968, and moved to Lansdowne, Pennsylvania.\nBarrett, a former Scranton, Pennsylvania, resident, and Sponga had met several years before their marriage when she had sought \"spiritual counseling\" from Sponga. However, their relationship eventually became much more intimate. Barrett was granted a divorce from her previous husband in February 1968 and retained custody of all three of her children. The nature of Sponga's relationship with Barrett was unknown to most of his fellow Jesuits until their marriage several months later.\nSponga was automatically excommunicated from the Roman Catholic Church for marrying Barrett. However, in a 1968 interview with Time magazine, Sponga stated that he still considered himself Catholic and said he would continue to attend Mass. He also reaffirmed his belief that a vow of celibacy was a good value for Roman Catholic priests. According to Time magazine, Sponga was the highest ranking American ecclesiastic to leave the priesthood between 1966 and 1968. Approximately 350 American priests left the priesthood during that two-year period.\nHe spent the rest of his life working as a counselor. Sponga's marriage produced two children, Sarah Sponga and Bart Sponga. It also ended in divorce, with Mary Ellen marrying a third time and dying a widow in 2012.\nDeath\nSponga died on May 3, 2000. The Jesuits he left allowed him to be buried in the order's graveyard in Woodstock, Maryland.\nReferences\nExternal links\n*[http://www.scranton.edu/ University of Scranton]\n*[http://digitalservices.scranton.edu/ University of Scranton Digital Services]\n*[http://digitalservices.scranton.edu/ui/custom/default/collection/coll_p9000coll7/resources/custompages/presidents/biographies.php#sponga/ Short Biography of Edward J. Sponga]\n*[http://digitalservices.scranton.edu/cdm/search/collection/p15111coll1!aquinas!basketball!p15111coll4!publications!p15111coll2!clippings!p9000coll7!prpubs!SCRYB03/searchterm/sponga%2C%20edward%20j.!text/field/subjec!type/mode/all!exact/conn/and!and/order/type/ University of Scranton Archival Material on Edward J. Sponga]"
    }
  ]
}