{
  "content": [
    {
      "type": "text",
      "text": "# Edward Hamilton Aitken\n\nEdward Hamilton Aitken (16 August 1851, in Satara, India – 11 April 1909, in Edinburgh) was a civil servant in India, better known for his humorist writings on natural history in India and as a founding member of the Bombay Natural History Society. He was well known to Anglo-Indians by the pen-name of Eha.\nEarly life\nEha was born at Satara in the Bombay Presidency on 16 August 1851. His father was the Rev. James Aitken, missionary of the Free Church of Scotland. His mother was a sister of the Rev. Daniel Edward, a missionary to the Jews at Breslau for some fifty years. He was educated by his father in India. His higher education was obtained at Bombay and Pune. He passed M.A. and B.A. of Bombay University, first on the list, and won the Homejee Cursetjee prize with a poem in 1880. From 1870 to 1876, he taught Latin at the Deccan College in Pune. He also knew Greek and was known to be able to read the Greek Testament without the aid of a dictionary.  He grew up in India, and it was only later in life that he visited England for the first time, and he found the weather of Edinburgh severe.\nCareer\nHe entered the Customs and Salt Department of the Government of Bombay in April 1876, and served in Kharaghoda (referred to as Dustypore in The Tribes on my Frontier), Uran, Uttara Kannada and Goa Frontier, Ratnagiri, and Bombay itself. In May 1903, he was appointed Chief Collector of Customs and Salt Revenue at Karachi, and in November 1905, was made Superintendent in charge of the District Gazetteer of Sind. He retired from the service in August 1906.\nHe married Isabella Mary, the third daughter of the Rev. J. Chalmers Blake of the Free Church of Scotland on 22 December 1883 in Bombay and they had two sons and three daughters. Their daughter - Jesse Helen, married James Hood Wilson Lownie (1887-1961), and their son Ralph became a colonial judge and author of Auld Reekie. Their grandson is the author Andrew James Hamilton Lownie.\nNatural history\nHe explored the jungles on the hills near Vihar around Bombay and wrote a book called The Naturalist on the Prowl. His writing style was accurate and at the same time amusing to his readers. He studied most of his subjects in life and was very restricted in his collecting.\nIn response to an appeal for information on rats due to plague in Bombay, he wrote an article for The Times of India (19 July 1899), in which he threw a flood of light on the subject of the habits and characteristics of the Indian rat as found in town and country. He wrote that Mus rattus, the old English black rat, which is the common house rat of India outside the large seaports, has become, through centuries of contact with the Indian people, a domestic animal like the cat in Britain.\nIn 1902 he was deputed to investigate the prevalence of malaria at the Customs stations along the frontier of Goa, and to devise means for removing the position of the Salt Peons who were affected by malaria in these places. During this expedition he discovered a new species of anopheline mosquito, which after identification by Major James, I.M.S., was named after him as Anopheles aitkeni. During his service he took to writing the Annual Reports of the Customs Department and was frequently thanked for the same. Reviewers have commented that these reports are enlivened by his witty literary touch. In the last two years of his service he was put in charge of The Sind Gazetteer. On completion of this work he retired to Edinburgh. He died after a short illness on 25 April 1909.\nHe refused to be depressed by life in India. \"I am only an exile,\" he remarks, \"endeavouring to work a successful existence in Dustypore, and not to let my environment shape me as a pudding takes the shape of its mould, but to make it tributary to my own happiness.\" He therefore urged his readers to cultivate a hobby.\nHe wrote:\n'']]\nHe worked at the museum of the Bombay Natural History Society, an organization that he founded and published many of his notes in the Journal of the Bombay Natural History Society. He was also the first joint-editor of that journal, secretary to the Insect division of the BNHS and president for some time.\nIn one famous case a subordinate of EHA working in the Salt department in Kanara came to his bungalow with a snake on his shoulder. Eha wrote that the man had seen two snakes fighting and said 'I smashed at them with a stick-one got away, but I killed this one and have brought it to you-What is it ?' 'It is a King cobra, and you have not killed it' replied Eha. The snake was put in a crate and sent to the BNHS with the note 'It may not survive the journey. If it does not you will know it by the smell. If there be no smell be careful.' The snake survived for two years in the BNHS.\nHe was a proponent of the study of living birds as opposed to the bird collectors of his time. He wrote in his Birds of Bombay\nIn a similar manner he studied the life-histories of butterflies unlike most butterfly collectors of the time.\n]]\nHe maintained an aquarium and made Sunday-morning expeditions to the ravines at the back of Malabar Hill to search for mosquito larvae to feed its inmates. Mr. Aitken investigated the capabilities for the destruction of larvae, of a small surface-feeding fish with an ivory-white spot on the top of its head, which he had found at Vihar in the stream below the bund. It took him some time to identify these particular fishes (Haplochilus lineatus) which he called  \"Scooties\" for their lightning rapidity of their movements. With these he stocked the ornamental fountains of Bombay to keep them from becoming breeding-grounds for mosquitoes, and they are now largely used throughout India for this very purpose.\nT. R. Bell, a naturalist friend, writing of him after his death said\n:He was a good man in every sense of the word; a strongly religious man, a pleasant companion, broad minded, exceedingly tolerant of the weaknesses of others, gentle and lovable and a rare example of a man without a single enemy.\nEha'' once wrote:\nHe kept many pets at home and Surgeon-General Bannerman noted in his preface to Eha's books that he often found himself having to go on unpleasant trips to the primeval forests of Cumballa Hill to look for mosquito larvae to feed the fish. In appearance Eha has been described as a long, thin, erect, bearded man...with a typically Scots face lit up with the humorous twinkle one came to know so well. A photograph taken in 1902 shows a fringe of hair encircling a bald head which is commented upon by Bannerman as \"a condition which ''Kemp's Equatorial Hair Douche had not been able to prevent\".\nDespite the popular reception for his book, a contemporary review in the Pall Mall Gazette of his book Tribes on my frontier'' termed his work as being entirely based on the kind of humour established by Phil Robinson. The review said:\nWritings\nHis books include\n* An Indian Naturalist's Foreign Policy (1883)\n* [http://catalog.hathitrust.org/Record/100483414 Behind the Bungalow] (1889)\n* The Naturalist on the Prowl (1894)\n* The Five Windows of the Soul (1898)\n* [http://catalog.hathitrust.org/Record/007913001 The Common Birds of Bombay] (1900)\n* The Tribes on my Frontier (1904)\n* [http://catalog.hathitrust.org/Record/000876164 Gazetteer Of The Province Of Sindh] (1907)\nAfter returning to Edinburgh, he wrote a series of articles on birdlife in the Strand Magazine.\nNotes\nReferences\n* Preface to Eha's Concerning animals and other matters by Surgeon-general William Burney Bannerman I.M.S., C.S.I.\n* Preface to Eha's Common birds of Bombay by W. T. Loke\n* Aitken, E. H. (1886): A List of the Bombay butterflies in the Society's collection, with notes. — J. Bombay nat. Hist. Soc. 1: 126–135.\n* Aitken, E. H. (1887): A List of the Butterflies of the Bombay Presidency. — J. Bombay nat. Hist. Soc. 2: 35–44.\nExternal links\n*\n*\n** [https://archive.org/details/commonbirdsofbom00aitkrich Common Birds of Bombay]\n** [https://archive.org/details/CommonBirdsIndia Common birds of India. 3rd edition with preface by Salim Ali and Loke Wan Tho]\n** [https://archive.org/details/behindbungalowby00aitkuoft Behind the Bungalow]\n** [https://archive.org/details/tribesonfrontier00aitkiala Tribes on my Frontier]\n** [https://archive.org/details/cu31924024783445 Concerning Animals and Other Matters]\n** [https://archive.org/details/naturalistonprow1905aitk A Naturalist on the Prowl]"
    }
  ]
}