{
  "content": [
    {
      "type": "text",
      "text": "# Edward J. Voke\n\n|birth_place= Chelsea, Massachusetts\n|birthname         = Edward John Voke\n|death_date=\n|death_place= Boston, Massachusetts\n|nationality= American\n|party= Democratic Party (United States)\n|residence= Chelsea, Massachusetts\n|spouse= Kathryn A. Hunter\n|children= Julia Elizabeth Voke (1925-1991), Edward J. Voke Jr. (1926-1967), John Hunter Voke (1927-2009)\n|alma_mater= Chelsea High School (Massachusetts), Northeastern University\n|profession= Lawyer, Politician\n}}\nEdward John Voke (February 24, 1889 – April 10, 1965) was an American politician who served as the 36th mayor of Chelsea, Massachusetts from 1936 to 1941. In 1946, he was nominated as Justice of the Massachusetts Superior Judicial Court served until his death in 1965. He was a member of the prominent Chelsea political family, having been the brother of Fire Chief Charles G. Voke and City Clerk Richard A. Voke. Voke also served as a delegate to the 1940 Democratic National Convention in Chicago, Illinois. He was also a Triple-A (baseball) pitcher in his youth and a close friend of Joseph P. Kennedy Sr.\nOrigin\nVoke's father, Alfred R. Voke, was a native of Portsmouth, England  who came to Boston in his childhood. Voke's mother, Julia Crowley, was born in the North End of Boston, both of her parents having come from County Cork.\nEarly life and education\nVoke was born February 24, 1889 to Alfred R. Voke, a railroad worker, and Julia E. (née Crowley) Voke. He was the fourth of eight children, only four of whom (all sons) survived. He graduated summa cum laude from Chelsea High School in 1906 and attended night classes at Northeastern University School of Law while working for The Chelsea Record. In 1964, he was given an honorary law degree from Northeastern University.\nMarriage and family\nOn September 24, 1924, he married Kathryn Alicia Hunter, a native of Winthrop, Massachusetts at St. Cecilia's church in Boston. He was the father of Julia E. Mulkern (1925–1991), Edward Voke Jr. (1926–1967), and John H. Voke, esq. (1927–2009).\nCareer\nVoke began his legal practice upon graduating from Northeastern, and in 1936, he was elected mayor. He served three terms, and in 1941, he retired to go back to legal practice. In 1945, Voke served as treasurer on Maurice J. Tobin's  campaign committee. After the death of Everett resident  Judge Nelson P. Brown in 1945, Tobin appointed Voke as Superior Court justice.  Judge Voke served this position until his death in 1965, and he remained active in Chelsea politics through the Knights of Columbus  and the Chelsea Chamber of Commerce.\nDeath\nOn April 5, 1965, Voke suffered a heart attack while with his son, John. He was brought to University Hospital, where he died five days later. He was 76. He was buried on April 14 at Woodlawn Cemetery in Everett, Massachusetts  in the presence of 1,500 mourners.\nReferences"
    }
  ]
}