{
  "content": [
    {
      "type": "text",
      "text": "# Edward Fisher Bodley\n\nEdward Fisher Bodley (1815–1881) was an English businessman, owner of a Staffordshire pottery. It operated on several sites in what is now Stoke-on-Trent. He had been a Congregationalist minister, and retained religious interests.\nEarly life\nIn early life, Bodley was an nonconformist minister. He trained at Highbury College, and ministered at Steeple Bumpstead, Essex, as successor to Ebenezer Temple. He moved south within Essex, to a congregation at Rochford, where he was in 1842. In 1843 he published Three Sermons on Revivals of Religion.\nPotter\nBodley spent time as a commercial traveller. In business on his own account, he was successful as a pottery owner.\nThe pottery company E. F. Bodley & Co. was set up in the early 1860s. A table service used on CSS Alabama was manufactured by it. It was established manufacturing earthenwares at the Scotia Pottery in Burslem in 1862. In 1863–7 its activities or trading are not easily distinguished from those of Bodley & Harrold; Bodley and William Harrold dissolved a partnership in 1865. The parting was not amicable.\nThe business continued to expand, and came to occupy three sites. The Hill Top Pottery in Burslem was a legacy of Samuel Alcock. It came via Alcock & Diggory to Bodley & Diggory in 1870, and to E. F. Bodley & Co. in 1871. Thomas Richard Diggory, partner for a short time with Bodley, was declared bankrupt in 1872.\nBodley was appointed a Justice of the Peace in 1872. He was mayor of Hanley in 1873, and presided over a meeting in 1874 to celebrate the foundation of the Town Mission Hall there. He retired from business in 1875, and his son Edwin James Drew Bodley took over the running of part of the Hill Pottery (from 1882 the Crown Works).\nIn 1876 Bodley laid a chapel foundation stone in Congleton. His residence is given as Shelton, Staffordshire, near Hanley, and Dane Bank House. He died in 1881.\nLegacy\nA company continued to trade under the name E. F. Bodley & Son, of Longport, from c. 1881 until 1898, with mark \"E. F. B. & Son\". Separately, the Bodley & Son company from 1875, successor to Bodley & Diggory, traded from the Hill Pottery, Burslem.\nFamily\nBodley was survived by his second wife Mary Ridgeway, daughter of Joseph Ridgway. John Edward Courtenay Bodley was their son. A further son was Edward Ridgway. The third son Alfred Joseph Ridgway married in 1883 Mary Eleanor Reade, daughter of Rev. John Chorley Reade.\nNotes"
    }
  ]
}