{
  "content": [
    {
      "type": "text",
      "text": "# Edward Villiers Rippingille\n\n| birth_place   = King's Lynn, Norfolk\n| death_date    =\n| death_place   = Swan Village railway station West Midlands\n| nationality   = English\n| known_for     = Oil painting, Watercolour\n| training      =\n| movement      =\n| notable_works =\n| patrons       =\n| awards        =\n| elected       =\n| website       =\n}}\nEdward Villiers Rippingille (c.&nbsp;1790&ndash;1859) was an English oil painter and watercolourist who was a member of the informal group of artists which has come to be known as the Bristol School. In that group he was a particularly close associate of both Edward Bird and Francis Danby.\nEarly life\nRippingille was born in King's Lynn, Norfolk, the son of a farmer. His year of birth is now believed to be c.&nbsp;1790 rather than 1798, as previously thought. For a period he worked taking portraits and teaching drawing in Wisbech, where his paintings were seen and admired by John Clare. In 1813 he exhibited at the Norwich Society of&nbsp;Artists, and showed Enlisting at the Royal Academy.\nBristol School\n'', 1822]]\nHe moved to Bristol, where he participated in the sketching activities of the Bristol School. Rippingille's Sketching Party in Leigh Woods (c.&nbsp;1828) depicts a sketching excursion in Leigh Woods typical of those made by the school's members. He worked particularly closely with Edward Bird, and was influenced by Bird's genre painting, which was naturalistic and freshly coloured. In 1814 they both exhibited works at the Royal Academy with the same subject, The Cheat Detected. Rippingille was also a close friend of Francis Danby, and his style developed alongside that of Danby under Bird's influence. In the 1819 Rippingille had a success at the Royal Academy with The Post Office. In 1822 the Royal Academy Exhibition saw The Recruiting Party, a work following the style of Bird, and The Funeral Procession of William Canynge to St Mary Redcliffe, 1474. These works were among Rippingille's finest achievements in the fields of genre and historical painting respectively.\nHe exhibited by himself at the new Bristol Institution in 1823, and in 1824 was one of the organisers of the first exhibition there by local artists. In 1824 he exhibited The Stage Coach Breakfast at the Royal Academy. This is his best known painting. It depicts some of the literary figures associated with Bristol: Samuel Taylor Coleridge, William Wordsworth and Robert Southey.\nLater years\nIn 1830 Rippingille left Bristol and travelled to France and Germany. He returned to London where he married in 1832, before travelling to France again, in the company of James Baker Pyne. In 1835, returning to London, he held his own exhibition at Regent Street. From 1837 he conducted trips to Italy and concentrated on Italian subjects. He died on 22 April 1859 at Swan Village railway station in the West Midlands.\nRippingille had a brother, Alexander, who was also a painter working in Bristol.\nGallery\nFile:Enlisting (Rippingille).jpg|''Taking the King's Shilling, 1813\nFile:Portrait of Edward Bird.png|Portrait of Edward Bird, 1817\nFile:Edward Villiers Rippingille (1829) - The Post Office - Leeds Museums and Galleries.jpg|The Post Office, 1819\nFile:Edward Villiers Rippingille (1798-1859) - The Stage-Coach Breakfast - 624187 - National Trust.jpg|The Stage Coach Breakfast, 1824\nFile:Edward Villiers Rippingille (1798-1859) - Mendicants of the Roman Campagna - FA.173(O) - Victoria and Albert Museum.jpg|Mendicants of the Roman Campagna'', 1840\nReferences\n}}\nExternal links\n*\n* [https://web.archive.org/web/20101006051814/http://www.bristol.gov.uk/ccm/content/Leisure-Culture/Museums-Galleries/bristols-city-museum---art-gallery.en Bristol City Museum and Art Gallery]"
    }
  ]
}