{
  "content": [
    {
      "type": "text",
      "text": "# Edward A. Eckenhoff\n\n| death_date         =\n| education          = Transylvania University University of KentuckyWashington University School of Medicine\n| known_for          = Founder of the National Rehabilitation Hospital\n}}\nEdward A. Eckenhoff was the founder and president of the National Rehabilitation Hospital in Washington, DC. He had previously been vice president and administrator of the Rehabilitation Institute of Chicago.\nEarly life and education\nEckenhoff grew up in Swarthmore, Pennsylvania. After high school, he spent a year at the University of Munich before returning to the United States where he received a bachelor of science degree from Transylvania University in Kentucky in 1966. He earned his master's degree in Education and Psychology from the University of Kentucky in 1968 before going on to earn another master's degree in Health Care Administration from the Washington University School of Medicine in 1972.\nCareer\nEckenhoff became vice president of administration at the Rehabilitation of Chicago, where he worked from 1974 to 1982. In 1984, he left for Washington, D.C., to open a medical rehabilitation hospital in the area. He founded the National Rehabilitation Hospital, which opened in 1986. Eckenhoff served as president and CEO of the hospital until his retirement in 2009.\nEckenhoff worked with President George W. Bush on the passage of the Americans with Disabilities Act, officially signed into law in July 1990. He was appointed to the Commission on the Care for America’s Returning Wounded Warriors in 2007.\nHe was one of the founding members of the American Medical Rehabilitation Providers Association. In 2018, the Edward A. Eckenhoff Memorial Award was established.\nAwards and recognition\nIn 1988, Eckenhoff was awarded the Citation of a Layman for Distinguished Service, the highest honor bestowed on a non-physician by the American Medical Association. In 1989, Washingtonian magazine named Eckenhoff \"Washingtonian of the Year.\"\nPersonal life\nHe married Judi in 1977. Eckenhoff died in Naples, Florida, on January 10, 2018, at the age of 74.\nReferences\nExternal links\n* [https://web.archive.org/web/20070928090759/http://www.nrhrehab.org/About+NRH/BoardOfDirectors/371.aspx National Rehabilitation Hospital]\n* [https://web.archive.org/web/20060907191201/http://www.transy.edu/news/content/arch_story.asp-id-164-storyDate-7/13/2004-object-index Transylvania University press release] Author Stephen King tells Eckenhoff's story in \"Tribute to Courage.\""
    }
  ]
}