{
  "content": [
    {
      "type": "text",
      "text": "# Edward Snowden asylum in Russia__disambig_1\n\nEdward Snowden's residency in Russia is part of the aftermath from his global surveillance disclosures. On June 23, 2013, Snowden flew from Hong Kong to Moscow's Sheremetyevo International Airport. Observing that his U.S. passport had been canceled, Russian authorities restricted him to the airport terminal. On August 1, after 39 days in the transit section, Snowden left the airport. He was granted temporary asylum in Russia for one year. On August 7, 2014, six days after Snowden's one-year temporary asylum expired, his Russian lawyer announced that Snowden had received a three-year residency permit. It allowed him to travel freely within Russia and to go abroad for up to three months.\nIn October 2020, after Snowden applied to renew his temporary permit, Russia granted him unlimited permanent residency. In November 2020, Snowden announced that he and his wife were applying for Russian citizenship, but that they \"remain Americans, raising our son with all the values of the America we love\".\n2013\nFirst contact and sequestered in the airport\nRussia first received information about Snowden when he was in Hong Kong. At that time, they were told that a person who wanted to fight against human rights violations wanted to seek asylum in Russia. In 2017, during The Putin Interviews with the director Oliver Stone, the Russian president Vladimir Putin described how Russia became involved in the Snowden saga. Russia did not want to get involved because of its strained relationship with the United States which it did not wish to worsen. Thereafter they learned that Snowden was on a plane bound for Moscow, to transfer to another plane bound for Latin America. Most of this information was received through informal channels including information leaked to the press. While he was aboard the plane, his destination countries grew reluctant to allow him in, and Snowden was thus stuck in the transit area of Moscow Sheremetyevo International Airport. While in the airport, U.S. authorities asked Russia to extradite Snowden. However, this was not possible as Russia had proposed a treaty on cooperation in legal matters, requiring mutual extradition of criminals, which the U.S. had not agreed upon. Further, the United States had never extradited any Russian criminal who had taken asylum in the US, hence Snowden's extradition would have been unprecedented. Snowden had not committed a crime as per Russian law.\nGranted temporary asylum\nSnowden left the Moscow airport on August 1 after 39 days in the transit section. He was granted temporary asylum in Russia for one year, with extensions possible. According to his Russian lawyer, Snowden went to an undisclosed location for security reasons. The White House stated that it was \"extremely disappointed,\" and cancelled a previously scheduled meeting with Russian President Vladimir Putin. Additionally, Republican U.S. Senator Lindsey Graham urged President Obama to boycott the 2014 Winter Olympics in Sochi, but House Speaker John Boehner, also a Republican, rejected that idea as \"dead wrong.\"\nIn late July 2013, Lonnie Snowden said he believed his son would be better off staying in Russia, and didn't believe he would receive a fair trial in the U.S. In mid-October, he visited his son in Moscow, later telling the press that he was pleased with Edward's situation, and still believed Russia was the best choice for his asylum, saying he wouldn't have to worry about people \"rushing across the border to render him.\" Lonnie Snowden commented that his son was living comfortably in Russia and found Moscow \"modern and sophisticated.\" Edward Snowden's Russian lawyer, Anatoly Kucherena, announced on October 31 that his client had found a website maintenance job at one of Russia's largest websites, but declined to identify the site. Jesselyn Radack, one of Snowden's American lawyers, said she was unaware of any new job. Asked about this by The Moscow Times in June 2014, The Guardian correspondent Luke Harding claimed that \"Kucherena is completely unreliable as a source. We [The Guardian] did the rounds of Russian IT companies when he made that claim last year and none of them—none of the big ones, at least—confirmed this.\"\nFormer CIA analyst Ray McGovern, who had traveled to Russia to give Snowden a whistleblower award, said that Snowden gave no storage devices such as hard drives or USB flash drives to Russia or China, and had carried four blank laptops with him to Hong Kong and Moscow as a diversion. U.S. officials said they assumed that any classified materials downloaded by Snowden had fallen into the hands of China and Russia, though they acknowledged they had no proof of this. In an October 2013 interview, Snowden maintained that he did not bring any classified material into Russia \"because it wouldn't serve the public interest.\" He added, \"There's a zero percent chance the Russians or Chinese have received any documents.\" In June 2015, however, The Sunday Times reported that British government officials anonymously claimed to the paper that Russia and China had cracked an encrypted cache of files taken by Snowden, forcing the withdrawal of British spies from live operations. The BBC also stated that their sources told them British intelligence assets had been moved as a precaution after the Snowden leaks. Glenn Greenwald charged that the report contained fabrications and did nothing more than quote anonymous British officials; he said parts were removed from the original post without The Times saying it did so.\npresentation in Moscow.]]\nWikiLeaks released video of Snowden on October 11 taken during the Sam Adams Award reception in Moscow, his first public appearance in three months. Former U.S. government officials attending the ceremony said they saw no evidence Snowden was under the control of Russian security services. The whistleblower group said he was in good spirits, looked well, and still believes he was right to release the NSA documents. In the video, Snowden said \"people all over the world are coming to realize\" that the NSA's surveillance programs put people in danger, hurt the U.S. and its economy, and \"limit our ability to speak and think and live and be creative, to have relationships and associate freely\" as well as putting people \"at risk of coming into conflict with our own government.\"\nOn October 31, German lawmaker Hans-Christian Ströbele traveled to Moscow to meet with Snowden, whom he invited to testify before the German parliament to assist investigations into NSA surveillance of German Chancellor Angela Merkel's phone since 2002. After the visit, Snowden indicated a willingness to testify, though not from Moscow as Germany requested. Snowden said he would rather give testimony before the U.S. Congress, his second choice being Berlin.\nAlso in October, Glenn Greenwald stated that the U.S. revoked Snowden's passport while he was in transit to Latin America and threatened other countries that might offer safe passage. WikiLeaks representative Sarah Harrison, who accompanied Snowden from Hong Kong to Moscow, left Russia in early November after waiting until she felt confident he had situated himself and was free from government interference.\nOn December 17, 2013, Snowden wrote an open letter to the people of Brazil offering to assist the Brazilian government in investigating allegations of U.S. spying, and added that he continued to seek, and would require, asylum. Snowden wrote, \"Until a country grants permanent political asylum, the U.S. government will continue to interfere with my ability to speak ... going so far as to force down the Presidential Plane of Evo Morales to prevent me from traveling to Latin America!\" Brazil had been in an uproar since Snowden revealed that the U.S. was spying on Brazilian President Dilma Rousseff, her senior advisors, and Brazil's national oil company, Petrobras. Rousseff and officials of the Brazilian foreign ministry said in response that they could not consider asylum for Snowden because they had not received any formal request. A representative of the foreign ministry said that a fax requesting asylum had been sent to the Brazilian embassy in Moscow in July but it had not been signed and could not be authenticated. David Miranda, the Brazilian partner of Glenn Greenwald, launched an Internet petition urging the Brazilian president to consider offering Snowden asylum.\nSnowden met with Barton Gellman of The Washington Post six months after the disclosure for an exclusive interview spanning 14 hours, his first since being granted temporary asylum. Snowden talked about his life in Russia as \"an indoor cat,\" reflected on his time as an NSA contractor, and discussed at length the revelations of global surveillance and their reverberations. Snowden said, \"In terms of personal satisfaction, the mission's already accomplished ... I already won. As soon as the journalists were able to work, everything that I had been trying to do was validated.\" He commented \"I am not trying to bring down the NSA, I am working to improve the NSA ... I am still working for the NSA right now. They are the only ones who don't realize it.\" On the accusation from former CIA and NSA director Michael Hayden that he had defected, Snowden stated, \"If I defected at all, I defected from the government to the public.\" In 2014, Snowden said that he lives \"a surprisingly open life\" in Russia and that he is recognized when he goes to computer stores.\n2014\nAccording to BuzzFeed, in January 2014 an anonymous Pentagon official said he wanted to kill Snowden. \"I would love to put a bullet in his head,\" said the official, calling Snowden \"single-handedly the greatest traitor in American history.\" Members of the intelligence community also expressed their violent hostility. \"In a world where I would not be restricted from killing an American,\" said an NSA analyst, \"I personally would go and kill him myself.\" A State Department spokesperson condemned the threats.\nOn Meet the Press in late January 2014, speculation arose from top U.S. officials in the House and Senate Intelligence Committees that Snowden might have been assisted by Russian intelligence, prompting a rare interview during which Snowden spoke in his defense. He told The New Yorker \"this 'Russian spy' push is absurd,\" adding that he \"clearly and unambiguously acted alone, with no assistance from anyone, much less a government.\" Investigations by the NSA and the FBI found no evidence that Snowden received any aid. Days later, U.S. Senator Dianne Feinstein stated that she had seen no evidence that Snowden is a Russian spy. Germany's Der Spiegel suggested the accusations were part of a smear campaign by U.S. officials. The accusations did not faze Snowden, who said \"outlets report statements that the speakers themselves admit are sheer speculation.\"\nIn late January 2014, U.S. attorney general Eric Holder, in an interview with MSNBC, indicated that the U.S. could allow Snowden to return from Russia under negotiated terms, saying he was prepared to engage in conversation with him, but that full clemency would be going too far.\nSnowden's first television interview aired January 26, 2014, on Germany's NDR. In April 2014, he appeared on video from an undisclosed location during President Putin's live annual Q&A exchange with the public. Snowden asked whether Russia intercepted, stored or analyzed individuals' communications. Putin replied, \"Russia uses surveillance techniques for spying on individuals only with the sanction of a court order. This is our law, and therefore there is no mass surveillance in our country.\" Benjamin Wittes in The New Republic described the exchange as \"a highly-scripted propaganda stunt for Vladimir Putin\". Snowden insisted his question was designed to hold the Russian president accountable. In an op-ed for The Guardian, Snowden said his question was intended \"to mirror the now infamous exchange in US Senate intelligence committee hearings between senator Ron Wyden and the director of national intelligence, James Clapper, about whether the NSA collected records on millions of Americans, and to invite either an important concession or a clear evasion.\" Snowden called Putin's response \"evasive\". A few days later, The Daily Beast reported that Snowden himself \"instantly regretted\" asking Putin the \"softball question\", which was crafted with several of his key advisers, and that he was mortified by the reaction. ACLU attorney Ben Wizner, one of Snowden's closest advisers, told the Beast that Snowden hadn't realized how much his appearance with Putin would be seen as a Kremlin propaganda victory. \"I know this is hard to believe,\" Wizner acknowledged. \"I know if I was just watching from afar, I'd think, 'Wow, they forced him to do this.' But it's not true. He just fucking did it.\" Asked six months later about the incident, Snowden conceded, \"Yeah, that was terrible! Oh, Jesus, that blew up in my face. ... And in the United States, what I did appearing at that Putin press conference was not worth the price.\"\nIn March 2014, the international advocacy group European Digital Rights (EDRi) said that the European Parliament, in adopting a Data Protection Reform Package, rejected amendments that would have dropped charges against Snowden and granted him asylum or refugee status.\nIn May 2014, NBC's Brian Williams presented the first interview for American television. In June, The Washington Post reported that during his first year of Russian asylum, Snowden had received \"tens of thousands of dollars in cash awards and appearance fees from privacy organizations and other groups,\" fielded inquiries about book and movie projects, and was considering taking a position with a South African foundation that would support work on security and privacy issues. \"Any moment that he decides that he wants to be a wealthy person,\" said Snowden's attorney Ben Wizner, \"that route is available to him,\" although the U.S. government could attempt to seize such proceeds.\nAlso in May, the German Parliamentary Committee investigating the NSA spying scandal unanimously decided to invite Snowden to testify as a witness. In September, opposition parties in the German parliament filed constitutional complaints to force the government to let Snowden testify in Berlin. Snowden had refused a proposed video conference from Moscow, saying he wants to testify only in Berlin and asking for safe conduct.\nOn July 13, 2014, The Guardian published its first story based on an exclusive, seven-hour interview newly conducted with Snowden in a Moscow city centre hotel. Snowden condemned the Data Retention and Investigatory Powers Bill announced to the UK's House of Commons on July 10 bolstering the state's right to keep personal data held by Internet and phone companies. Snowden said it was very unusual for a public body to pass such emergency legislation except during total war. \"I mean we don't have bombs falling. We don't have U-boats in the harbor. It defies belief.\" On July 13 and 17, The Guardian posted video clips, of about 2 minutes and 14 minutes in length, excerpted from the full interview. On July 18, The Guardian published a nearly 10,000-word edited transcript of their Snowden interview. A year after arriving in Moscow, Snowden said he is still learning Russian. He keeps late and solitary hours, effectively living on U.S. time. He does not drink, cooks for himself but doesn't eat much. \"I don't live in absolute secrecy,\" he says. \"I live a pretty open life—but at the same time I don't want to be a celebrity.\" He does not work for a Russian organization, yet is financially secure thanks to substantial savings from his years as a well-paid contractor and more recently numerous awards and speaking fees from around the world.\nOn August 7, 2014, six days after Snowden's one-year temporary asylum expired, his Russian lawyer, Anatoly Kucherena, announced that Snowden had received a three-year residency permit. It allowed him to travel freely within Russia and to go abroad for up to three months. Kucherena explained that Snowden had not been granted permanent political asylum, which required a separate process.\n2015\nIn May 2015, Snowden's lawyer Ben Wizner said that Snowden's main source of income was speaking fees, which sometimes exceeded $10,000 per appearance. In November 2015, Snowden said that he does not intend to play any role in Russian politics and wants to devote his focus to U.S. issues. During a panel event, he said, \"people say I live in Russia, but that's actually a little bit of a misunderstanding. I live on the Internet.\"\n2017\nIn the waning days of the Obama administration, former CIA Director Michael Morell suggested that Russia should extradite Snowden to the United States as a \"gift\" to President-elect Donald Trump. The comment drew harsh criticism by the Russian Foreign Ministry, which said that Snowden had been granted an extension of his stay until 2022, and said what Morell proposed would be a betrayal.\nA senior U.S. official said in February 2017 that Russia was considering extraditing Snowden in order to \"curry favor\" with President Trump. Snowden cited the comment in his own defense, using it as evidence that he was not a Russian spy, stating in a Twitter post, \"Finally: irrefutable evidence that I never cooperated with Russian intel. No country trades away spies, as the rest would fear they're next.\" Edward Snowden's attorney, Ben Wizner, stated that he \"hadn't heard of any such plans and 'Team Snowden has no new reason for concern.'\" President Vladimir Putin also denied the U.S. report, stating that it was \"nonsense\".\n2020\nPermanent residency\nIn October 2020, Snowden was granted permanent residency in Russia. His lawyer said that granting an unlimited residence permit became possible after changes in the migration legislation of the Russian Federation in 2019.\nApplication for Russian citizenship\nIn November 2020, Snowden announced that he and his wife, Lindsay, who was expecting their son in late November, were applying for dual U.S.-Russian citizenship in order not to be separated from him ″in this era of pandemics and closed borders″. Their son will be entitled to Russian citizenship by birthright.\n2022\nOn September 26, Snowden's Russian citizenship was granted. Snowden's wife, Lindsay Mills, had applied for a Russian passport, as well.\nOn December 1, Snowden swore an oath of allegiance to Russia and received a Russian passport, according to his lawyer.\nReferences"
    }
  ]
}