{
  "content": [
    {
      "type": "text",
      "text": "# Edward Gait\n\nSir Edward Albert Gait  (1863–1950) was an administrator in the Indian Civil Service who rose to serve as Lieutenant-Governor of the Bihar and Orissa Province in the Bengal Presidency of British India. He held that office for the years 1915–1920, with a brief absence during April–July 1918 when Edward Vere Levinge officially acted in the position.\nLife and career\nGait graduated from University College, London. He sat the competitive examination for the Indian Civil Service in 1882 and was subsequently appointed, arriving in India on 11 December of that year. He served as assistant commissioner in Assam, and then from 1890 as provincial superintendent for the 1891 census in that region. He wrote the official report for that region's census, which formed a part of the national census undertaken in that year.\nAfter various other roles in the administration, Gait was appointed as a magistrate and District collector in November 1897. In April 1900 he became superintendent of census operations in Bengal, where he worked with Herbert Hope Risley, the Census Commissioner, to produce the official report of the 1901 Census of India. He was himself Census Commissioner from 1902 until after the census of 1911.\nOfficial recognition of his work came with the award of Companion of the Order of the Indian Empire (CIE) in 1907. In 1912 he became a Companion of the Star of India (CSI), and in 1915 he was raised to the rank of Knight Commander (KCSI) in the same Order. In 1917 he was appointed a Knight of Grace of The Grand Priory of the Order of the Hospital of St John of Jerusalem in England.\nHe was Lt.-Governor of Bihar and Orissa during 1915 and 1920. He also founded Bihar and Orissa Research Society in 1915 which was devoted to explore more about Indology and anthropology. The society published a journal with title of Journal of Bihar and Orissa Research Society. Lt. Gait acted as president of the society from 1915 to 1920 while he was taking his office in Patna.\nAmrendra Thakur has said that with the publication of A History of Assam \"historical research in North East India entered into a new age. Truly speaking Gait's was the first full-length history of the province. The book is freely used by scholars as an authentic source material.\"\nPublications\nAside from co-editing the official Reports of the 1901 census of India, Gait wrote other publications. These include:\n*\n*\n*\n*\n*\nSee also\n*Census of India prior to independence\n*List of governors of Bihar and Orissa Province\nReferences"
    }
  ]
}