{
  "content": [
    {
      "type": "text",
      "text": "# Edward Baird (rugby league)\n\n|death_place    = Passchendaele salient, Belgium\n|height         =\n|weight         =\n|first          = RU\n|ru_position         =\n|ru_club1            = North Brisbane\n|ru_year1start       =\n|ru_year1end         =\n|ru_appearances1     =\n|ru_tries1           =\n|ru_goals1           =\n|ru_fieldgoals1      =\n|ru_points1          =\n|position       =\n|club1          = North Brisbane\n|year1start     =\n|year1end       =\n|appearances1   =\n|tries1         =\n|goals1         =\n|fieldgoals1    =\n|points1        =\n|teamA          = Queensland\n|yearAstart     = 1908\n|yearAend       =\n|appearancesA   = 8\n|triesA         =\n|goalsA         =\n|fieldgoalsA    =\n|pointsA        =\n|teamB          = Australia\n|yearBstart     = 1908\n|yearBend       =\n|appearancesB   = 1\n|triesB         = 0\n|goalsB         = 0\n|fieldgoalsB    = 0\n|pointsB        = 0\n|retired        = yes\n|source         =  Whiticker\n| module      =\n| branch      =\n| service_years = 1916-1917\n| unit        = 47th Battalion (Australia)\n| rank        =\n| battles     =\n*World War I\n**First Battle of Passchendaele\n| awards      =\n}}\n}}\nEdward Baird (1884–1917) was a pioneer Australian rugby league footballer, one of his country's first selected national representatives and an Australian Imperial Forces (AIF) soldier who fell in World War I at the Battle of Passchendale.\nEarly life and football career\nBaird was born in Sydney in 1884 and schooled at McDonaldtown School in the inner Sydney suburbs. By 1908 when he was playing rugby league in the code's inaugural competition year, he was located in Brisbane. He was selected in the first ever Queensland Maroons state representative side to play the new \"Northern Union\" style of rugby, taking on Albert Baskerville's New Zealand All Golds on their inaugural tour. Baird played as a reserve as the Queenslanders lost the historic match 34–12. He went on to make another appearance against New Zealand and two against New South Wales.\nWhen the New Zealand team came back on the return leg of their tour, they played three Test matches against the first Australian representative sides ever selected. The first Test was played in Sydney on 9 May 1908 with the Kiwis prevailing. On 30 May the 2nd Test was played in Brisbane. The side had four new players who had not played in the Sydney test, two of them Queenslanders in George Watson and Baird. Baird made his sole national representative appearance at full-back, becoming Kangaroo No. 15. Charlie Hedley was selected at fullback for the 1st and 3rd Tests of the series.\nBaird continued to play at fullback for Queensland against a touring New Zealand Māori rugby league team in 1908.\nWar service\nHe enlisted with the AIF as a Private in the 47th Battalion (Australia) and embarked from Brisbane in May 1916 on HMAT A46 Clan Macgillivray. He was killed on the first day of the First Battle of Passchendaele in Belgium on 12 October 1917. He was one of 3,199 Australian lives lost in the battle.\nReferences\nOther sources\n* Whiticker, Alan & Hudson, Glen (2006) The Encyclopedia of Rugby League Players, Gavin Allen Publishing, Sydney\n* [https://archive.today/20121129231450/http://www.aif.adfa.edu.au:8080/showPerson?pid=10921 Ed Baird at the AIF Project]"
    }
  ]
}