{
  "content": [
    {
      "type": "text",
      "text": "# Edward Strauss\n\nEdward Anthony Strauss (7 December 1862 – 25 March 1939) was an English corn, grain and hop merchant of German-Jewish background. He was a Liberal, later Liberal National Member of Parliament.\nFamily and education\nEdward Strauss was born in Highbury in London, the son of Joseph Strauss, a merchant from Southwark. He was educated at King's College London and at overseas institutions. He never married.\nCareer\nAt an early age he took over his father's business together with his brother. By 1910 he was described as a hop merchant in Southwark.\nPolitics\n1905–1910\nStrauss was adopted as Liberal candidate for the Northern or Abingdon Division of Berkshire in February 1905. At that time he had an address in Abingdon. He gained the seat for the Liberals at the 1906 general election but lost in January 1910. However he was soon adopted as Parliamentary candidate for Southwark West. Richard Causton had been Liberal MP for the constituency from 1888 to January 1910, when he lost to Conservative candidate William Henry Dunn. When Causton announced he did not intend to fight again Strauss replaced him and won the seat back from Dunn by the narrow margin of 18 votes, after a recount. At the time of this victory, Strauss was described as a hop merchant in Southwark who took a prominent interest in the work of the Hops Committee (a Parliamentary Select Committee which considered questions relating to hop growing, production and consumption). He was acknowledged as an authority on agricultural questions. and was particularly interested in the plight of smallholders and the promotion of their rights.\n1910–1918\nIn 1916, Strauss was a member of a deputation to the War Minister, Lord Kitchener to press for better defences against air raids on London.\nStrauss' West Southwark constituency was abolished for the 1918 general election and he stood instead for the new seat of Southwark North. He was designated a Coalition Liberal, standing in support of the Coalition government of David Lloyd George and had presumably been issued with the Coalition coupon as he faced no official Unionist opponent. However, there were apparently Unionist objections to his candidacy because Lieutenant-General Sir John Harrington was invited to stand by local Conservatives as an Independent Unionist. Harrington agreed on the understanding that he was to be regarded as completely independent of party. Harrington had previously been a member of the recently formed right-wing National Party. Also standing against Strauss was George Isaacs for the Labour Party and Mr J J Gebbett, a representative of the National Federation of Discharged Soldiers and Sailors or the Silver Badge Party, an organisation which was later subsumed into the Royal British Legion.  Strauss held the seat with a majority of 2,071 votes over Harrington with Isaacs third and Gebbett at the foot of the poll.\n1922–1924\nStrauss stood at the 1922 general election as a Lloyd George National Liberal.  He was opposed in a straight fight with Labour by Dr Leslie Haden-Guest, the secretary and doctor to the former Labour delegation to Soviet Russia in 1920 and a London County Councillor. The election took place against the backdrop of a set of poor local election results for Labour just two weeks before, when Labour lost all their councillors in Southwark. Strauss held his seat with a majority of 1,112.\nIn 1923 Strauss, now described as a plain Liberal without prefix of suffix, again faced a straight fight against Labour's Leslie Haden-Guest. This time, despite the reunion of the Lloyd George and Asquithian Liberals, and the gains the Liberal Party made overall, Strauss was beaten, albeit by the narrow margin of 362 votes. At the 1924 general election Strauss tried to win his seat back, this time in a three-cornered contest with Haden-Guest and Mr J J Llewellin for the Conservatives. Despite what was reported as a strenuous effort to regain his seat, Strauss lost by 1,030 votes, the intervention of the Unionist (who polled 3,305 votes) probably helping to deprive him of victory.\nBy-election, 1927\nStrauss was handed an unusual opportunity to re-enter Parliament in 1927 when Haden-Guest resigned from the Parliamentary Labour Party in protest against the party's opposition to government policy in China, which he believed placed British nationals in Shanghai at risk and was tantamount to an intervention in the Chinese Civil War. Haden-Guest then chose to resign also from Parliament and cause a by-election in which he sought re-election. He obtained the support of the local Conservative Party in Southwark but stood as an Independent Constitutionalist. He was opposed by Strauss for the Liberals and George Isaacs for Labour. Haden-Guest may not have anticipated the Liberal intervention in the by-election which he wanted to contest as a straight fight between a socialist and an anti-socialist candidate. He had envisaged his by-election as a chance to ask working class voters in particular to choose his brand of 'patriotism' over the attitude of the Labour Party. In the event, Strauss profited from the split in the socialist vote gained the seat with a majority of 1,167 over Isaacs with Haden-Guest in third place with less than 20% of the poll.\n1929\nAt the 1929 general election Strauss again faced George Isaacs as his Labour opponent, as well as a Conservative, Marcus Samuel. The election contest was obviously a bitter one as Strauss announced he was cancelling all his public meetings which he claimed were being systematically disrupted and speakers being howled down by Labour Party supporters. This time Isaacs won the seat, by the narrow margin of 432 votes – the intervention of the Conservative candidate again splitting the anti-Labour vote.\nLiberal National\nIn 1931 an economic crisis led to the formation of a National Government led by prime minister Ramsay MacDonald supported by a small number of National Labour MPs and initially backed by the Conservative and Liberal parties. However most Liberals had concerns about supporting the National coalition over the long run because of the government's commitment to protectionism and tariffs in opposition to the traditional Liberal policy of Free Trade.  Despite these worries, the Liberal Party led by Sir Herbert Samuel agreed to go into the 1931 general election supporting the government.  As a result, Strauss found himself the representative of the coalition against Labour in Southwark North at the election, Marcus Samuel having agreed to stand aside. This time, with no Conservative to split the anti-Labour vote and the great popularity of the National Government as a result of the economic crisis, Strauss won back the seat in a straight fight with Isaacs by a majority of 5,992 taking 65% of the poll.\nAs the initial crisis passed, the Liberal Party became increasingly anxious about the government's stance on Free Trade and worried about the predominance of the Conservatives in the coalition. However a group of Liberal MPs led by Sir John Simon who were concerned to ensure the National Government had a wide cross-party base formed the Liberal National Party to give more open support to MacDonald's administration. Strauss was not one of the original members of this group but by 1932 he had become identified with it. By October 1932, Strauss was writing openly to Herbert Samuel expressing the view that the Liberal Party could not be revived by adopting the slogan 'Back to Free Trade' and that this policy was only one of a number of important issues which needed the government action.\nEven though he was by now 73 years of age, Strauss again stood for re-election in Southwark North as a Liberal National at the 1935 general election. Having been deprived of the seat by small majorities in the past, Strauss was this time the lucky one, squeaking home in another straight fight with Isaacs by just 79 votes. However his age and state of health told upon him and he decided to step down from Parliament at the next general election, though in fact he died before that election was held.\nOther public offices\nStrauss served as a Justice of the Peace for the counties of London and Berkshire. He was also appointed a Freeman and Liveryman of the City of London and Warden of the Worshipful Company of Gardeners. In 1925, Strauss was nominated as Sheriff of Berkshire.\nElection promises court case\nIn a case which, potentially, could have had far-reaching consequences for all democratically elected representatives, Strauss found himself in court in 1913 when one of his constituents, a Mr Arthur Macgillicuddy, brought an action against him to recover damages for alleged breach of contract, i.e. that Strauss had failed to carry out the promises on which he had been elected an MP. Mr Macgillicuddy, who conducted his own case, said he was seeking costs to cover his expenses (e.g. correspondence and printing) in bringing to Strauss' attention his failure to carry out his election pledges. However Judge Granger ruled that Macgillicuddy had no evidence of a contract or formal agreement with Strauss which Strauss could be found to have breached and no doubt politicians everywhere breathed a sigh of relief.\nFinancial troubles\nTowards the end of his life, Strauss experienced financial difficulties because of the collapse of the grain and seed companies with which he was associated. Huge debts had been built up and the businesses were subject to compulsory liquidation.  The problems had been caused by an accumulation of factors including default by debtors due to the fall in the market price of grain, government interference with the companies' trade with the US, cash-flow difficulties and bad decision making in management. While Strauss sought to distance himself from responsibility for these failures saying he had not been personally involved in the day-to-day affairs of the companies for many years, he was nevertheless brought low financially by it. His property and its contents at Kingston Bagpuize, in Berkshire where he had planted hop gardens and erected modern kilns producing high-class hops had to be sold off to raise funds by the liquidators as did commercial properties in London. In the 1935 general election campaign, Strauss had to issue a statement explaining his financial misfortunes and conceding that he was now 'an impoverished man'.\nDeath\nBy late 1938, now in his late seventies and with deteriorating health, Strauss was obliged to enter a nursing home. He remained there for several months eventually dying on 25 March 1939.\nBy-election in North Southwark\nIn the by-election for North Southwark, in the vacancy caused by Strauss' death, George Isaacs again took up the cudgels on behalf of the Labour Party, gaining the seat from the Liberal Nationals in a straight fight with Captain A H Henderson-Livesey by a majority of 1,493 votes.\nReferences\nExternal links\n*"
    }
  ]
}