{
  "content": [
    {
      "type": "text",
      "text": "# Edward Duncan\n\n| birth_place   = London, England\n| death_date    =\n| death_place   = London, England\n| nationality   = British\n| known_for     = Painting\n| training      =\n| movement      =\n| notable_works =\n| patrons       =\n| awards        =\n| website       =\n}}\nEdward Duncan  (21 October 1803 – 11 April 1882) was a British watercolourist known for his depictions of coastal views and shipping. He was a member of the Royal Watercolour Society and received Royal patronage from Queen Victoria.\nBiography\n\" by Duncan, c. 1843, showing HMS Malabar looking on at the ship's final fate after helping rescue its survivors.]]\nEdward Duncan was the son of Thomas Duncan (c. 1781 - 1841) and Peggy, née Watson. He was born on 21 October 1803 at St Pancras in London. He was apprenticed to Robert Havell, the principal aquatint engraver of Audubon's Birds of America. Duncan was thus afforded frequent opportunities of studying the works of Havell's brother, the watercolorist, William Havell. These developed his taste for drawing and the use of colour.\nAfter tutelage under the Havell Brothers in London, Duncan started his own engraving studio, and primarily created print works for Fores of Piccadilly. In 1826, a project to engrave maritime scenes, after paintings by William John Huggins (the official artist to the royal court of King William IV, and King George IV) are said to have sparked Duncan's interest in marine subjects.\nIn about 1835, Duncan married Huggins' daughter Berthia (1811-1884). The couple had six sons and one daughter, Berth(e)a. One of the sons was Walter Duncan, also a painter.\nThe influences of both Havell and Huggins undoubtedly led to Duncan's long and successful career as one of Britain's foremost marine watercolorists.\nEdward Duncan was a painstaking artist with his preferred media. In addition to his early training as an engraver, he was skilled in oils, lithography and etching. Duncan's drawings comprise a wide range of subjects but his best known works depict coastal scenes with shipping and other marine craft.\nDuncan also specialised in landscapes of the southern counties, often populated with animals and farms. In the face of the vogue for painting with body-colours, Duncan relied almost entirely on transparent colours. His watercolours are amongst the most technically defined and detailed paintings of the period and are considered to have a breadth and fluidity that bespeak the earlier traditions of British watercolour.\nDuncan was a prolific exhibitor of his works, showing more than 40 at the Royal Academy and the Society of British Artists, and including more than 500 watercolors and drawings within the shows of the Old and New Watercolor Societies during his career.  His works include;\n* The Shipwreck, 1859\n* The Life-Boat, 1860\n* Blue Lights\n* Oyster Dredgers — Swansea Bay, 1874\n* Landing Fish on the Sands at Whitby\n* Fishing Boats making for the Harbour of Boulogne — early morning\n* Spithead from the Isle of Wight, 1857\nIn 1833 he was elected a member of the New Society of Painters in Water-Colours, but he resigned in 1847 and, in 1849 was elected an Associate of the Royal Watercolour Society (then, the Society of Painters in Water-Colours), and a full member in the following year.\nBetween 1865 and his death in 1882 he spent almost every summer painting in the Gower Peninsula, near Swansea, painting the coastal scenes for which he became known.\nHe died in Hampstead, London, on 11 April 1882 and was buried on the western side of Highgate Cemetery. According to his wishes, as outlined on the inscription on the headstone of the Duncan family grave, he wanted to be buried with his friend Captain Matthew Henry Barker and this wish was carried out, so he is actually buried two graves away from his family.\nA sale of his works at Christie's in 1885 took three days; and a sale of 1887 lists nearly 2,000 of his sketches and paintings.\nGallery\nYarmouth herring boat by Edward Duncan.png|Yarmouth Herring Boat by Edward Duncan, Watercolour and Pencil, 1849\nA Shipwreck by Edward Duncan.png|A Shipwreck by Edward Duncan, Watercolour and Pencil, 1865\nShipping Off the Coast by Edward Duncan.png|Shipping off the Coast by Edward Duncan, Watercolour over pencil\nDestroying Chinese war junks, by E. Duncan (1843).jpg|Destroying Chinese war junks, 1843\nDuncan, Edward 1882.jpg|Duncan family grave in Highgate Cemetery with inscription indicating Edward Duncan's burial place close by\nActual grave of painter Edward Duncan with Friend Captain M H Barker.jpg|Actual grave in Highgate Cemetery of painter Edward Duncan, buried, at his request, with his Friend Captain M H Barker\nReferences\nBibliography\n*\nAttribution:\n*\nFurther reading\n* F. L. Emanuel, Edward Duncan R.W.S. painter ... (London: Walker Galleries, 1923),  38 p. (= Walker's Quarterly; 13)\nExternal links\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*"
    }
  ]
}