{
  "content": [
    {
      "type": "text",
      "text": "# Edward Phelan\n\nEdward Phelan, also Phalen or Felyn (c.1811–1850), was an early settler of Saint Paul, Minnesota. Phelan was born in approximately 1811 in Derry, Ireland and later became, along with John Hays and William Evans, one of the first settlers of Saint Paul. Phelan was later accused of Hays' murder, the first ever in Saint Paul, but was acquitted. He was indicted for perjury a year later but fled to California before he could be prosecuted. Phelan was killed by his companions in what they describe as self-defense before he could reach California. Many locations in Saint Paul, Minnesota are named after Phelan as a result of his early land claims. Phelan's name was spelled variously and as a result most locations are named Phalen and not Phelan\nEarly life\nPhelan was born in approximately 1811 in Derry, Ireland. He immigrated to the United States  and on June 8, 1835 he enlisted in the U.S. Army in New York City. Three years later he was discharged by reason of \"expiration of service\" at Fort Snelling which was, at that time, in Wisconsin Territory. A military report described him as having, \"gray eyes, brown hair, fair complexion and was six feet two and one-half inches high\". (1.89 m)\nLand claims\nWhen Phelan and Evans were discharged from Fort Snelling they both decided to make land claims in what is now Saint Paul. Hays, who was expecting to be discharged several months later, made plans with Phelan to make a claim for Hays nearby on the provision that Hays would later reimburse Phelan. Phelan selected a claim in what is now Downtown Saint Paul and built a log house to spend the winter in while he waited for Hays to be discharged. Phelan started a little opposition to Pierre Parrant or Pig's Eye, the first person to settle in Saint Paul. Hays was discharged in April 1839 and lived with Phelan in the log cabin until September 1839. The two did not get along very well according to other settlers near them. In September, Hays's body was found murdered in the Mississippi River near Carver's Cave by a friendly Indian. His body was badly beaten which to his neighbors indicated a \"desperate murder\"\nTrial\nSuspicion immediately fell on Phelan. Hays was, unlike Phelan, well liked by local soldiers and neighbors. Most of his neighbors were convinced of his guilt. Justice of the Peace, Henry Hastings Sibley, issued a warrant and Phelan was held at Fort Snelling under charges of murder in the first degree. On September 29, 1839, Phelan was arrested for the murder.\nWhen the next steam boat arrived, Phelan was sent down to Prairie du Chien, Wisconsin Territory which was the county that the crime was committed in. This was shown in the testimony given against him in his trial. One woman testified at his trial and said that when she asked him how he and Hays got along he said \"Very badly\" but said \"I'll soon get rid of him.\" Another said he found blood on Phelan and bloody clothes in his house. He went on to state that his dog was able to find the route that Phelan had dragged Hays body down to the river.\nWhile Phelan was away in prison in Fort Crawford, another settler squatted on his claim. In the Spring of 1840 Phelan was tried for Hays murder by a grand jury. Despite two neighbors of Phelan, including his former friend William Evans, the jury was unconvinced of Phelan's guilt and he was let go. It was later found out that a Dakota warrior confessed to killing Hays.\nWhen Phelan returned to Saint Paul he attempted to reclaim his claim by force but was unable to. Phelan subsequently sold his claim for $200 and made a new claim in what is now Swede Hollow near Hamm's Brewery. The claim was sold on September 2, 1844 for $70. The land containing \"Faylin's Creek and Falls\" later contained a saw and gristmill.\nAfter the trial\nPhelan went on to make a total of five various land claims, selling his last one in 1849 to Edmund Rice. In 1850 Phelan was indicted by the first Grand Jury to ever sit in Ramsey County on charges of perjury. Before he could be arrested he fled to California. While traveling he was killed by his companions. Due to his behavior, his companions felt compelled to kill him in self-defense. One writer declared, \"The murdered Hays was avenged!\".\nLegacy\nPhalen Creek has been named after him as a result of claim near the creek in Swede Hollow. Phalen Creek travels from Lake Phalen and drains into the Mississippi River. Near the turn of the century most of the creek was covered over and routed through sewers. The lake that was drained by the creek became known as Phalen's Lake despite Phelan never living near its shores. The lake is now referred to as Lake Phalen. The Saint Paul Water Company set up a supply plant at Lake Phalen in 1869 and the lake was used as Saint Paul's primary source of water until 1913. The lake is one of the largest in Saint Paul with an area of . The area surrounding the lake has been made into a  park, named after Phelan. John Fletcher Williams, a local historian, wrote in 1876 \"It is a disgrace, that the name of this brutal murderer has been affixed to one of our most beautiful lakes - one that supplies our households with water.\"\nNotes\nReferences\n*\n**Republished as:\n*\n*\n*\n*\n*\n*"
    }
  ]
}