{
  "content": [
    {
      "type": "text",
      "text": "# Edward Williams (iron-master)\n\nEdward Williams (10 February 1826 &ndash; 9 June 1886) was a Welsh teacher, industrialist and iron-master. Born in Merthyr Tydfil, he was part of a migration of Welsh iron-workers who moved to Middlesbrough, England, in the 1860s. Williams was the eldest son of Taliesin Williams and the grandson of Iolo Morganwg.\nEarly life\nEdward's father, Taliesin was a notable poet and author, who had moved to Merthyr Tydfil in 1816 to open a school. It was at this school that the young Edward was educated and began a career in teaching, becoming assistant master.\nIn 1842 Williams left his teaching role for the relatively junior position of office clerk at the Dowlais Ironworks. However, Williams was soon noted within the local iron industry as a knowledgeable and energetic figure, taking an active part in the founding of the South Wales Institute of Engineers, and acting as the institute's secretary from its inception in 1857 until his move to London.\nLondon and meeting John Vaughan\nWilliams worked at Dowlais until 1864, when he was appointed as manager of the Dowlais Company's London house. In London, Williams came into close contact with the leading iron-masters of the country. His knowledge of the industry impressed John Vaughan, an iron-master who had worked his way up through the Dowlais works, and had established his own ironworks at Middlesbrough.\nVaughan asked Williams to preside over the floatation of his company, Bolckow Vaughan in 1864, and become the new companies' general manager the following year. Williams would oversee the companies transition from private partnership to the largest registered company ever formed.\nIn Middlesbrough\nAfter just a year in London, Williams had moved to Middlesbrough with Bolckow Vaughan. Williams extended the scope of the companies operations, acquiring more collieries in Durham and iron-mining rights in Spain. In 1868 he was elected president of the North of England Iron-Masters’ Association, and was one of the founders (and presidents) of the Iron and Steel Institute of Great Britain, receiving the institute's Bessemer medal in May 1886.\nWilliams became a respected figure in Middlesbrough, playing a prominent part in the town's public life. He was made a justice of the peace and a member of the town council, and a member of the School Board from its formation. He was also the prime advocate in developing Middlesbrough's dock area. He served as alderman and magistrate before being elected just the second Mayor of Middlesbrough in 1872. Following his financial successes in the town, Williams purchased the Linthorpe iron-works in 1879, becoming an iron-master in his own right.\nLater years\nWilliams maintained an active interest in Wales and the South Wales iron industry, returning to the South Wales Institute of Engineers as president from 1881 until 1883. When the iron industry began to give way to steel, The industry sought to benefit from Williams' knowledge and guidance in an economically turbulent period, and Williams assisted in planning the long and costly rebuild of Cyfarthfa Ironworks, in 1884.\nFamily\nWilliams was the grandson of the famous Iolo Morganwg and the son of Taliesin Williams. Edward's three sons Illtyd, Aneurin Williams and Penry Williams were also prominent figures in the North East of England, and the Welsh communities on Teesside. Penry Williams won the seats of Middlesbrough for the Liberal Party and Aneurin also won the Consett seat in 1918.\nThrough Aneurin, he is the grandfather of Ursula Williams and Iolo Aneurin Williams. Iolo's son, also named Edward was a composer and electronic music pioneer.\nFamily tree\nReferences"
    }
  ]
}