{
  "content": [
    {
      "type": "text",
      "text": "# Edward Mendelson\n\n| birth_place = New York City, U.S.\n| death_date =\n| death_place =\n| death_cause =\n| region =\n| period =\n| occupation =\n| title = Professor of English and Comparative Literature; Lionel Trilling Professor in the Humanities\n| boards =\n| known_for =\n| spouse = Cheryl Mendelson\n| children =\n| signature =\n| signature_alt =\n| signature_size =\n| era =\n| language =\n| discipline = English and Comparative Literature\n| sub_discipline =\n| movement =\n| religion =\n| denomination =\n| education = University of Rochester (BA)Johns Hopkins University (PhD)\n| thesis_title =\n| thesis_url =\n| thesis_year =\n| doctoral_advisor =\n| doctoral_students =\n| notable_students =\n| main_interests =\n| workplaces = Columbia UniversityYale UniversityHarvard University\n| notable_works =\n| notable_ideas =\n| influences =\n| influenced =\n| awards =\n| website =\n| footnotes =\n}}\n__NOTOC__\nEdward Mendelson (born March 15, 1946) is a professor of English and Comparative Literature and the Lionel Trilling Professor in the Humanities at Columbia University. He is the literary executor of the Estate of W. H. Auden and the author or editor of several books about Auden's work, including Early Auden (1981) and Later Auden (1999). He is also the author of The Things That Matter: What Seven Classic Novels Have to Say About the Stages of Life (2006), about nineteenth- and twentieth-century novels, and Moral Agents: Eight Twentieth-Century American Writers (2015).\nHe has edited standard editions of works by W. H. Auden, including Collected Poems (1976; 2nd edn. 1990; 3rd edn., 2007), The English Auden (1977), Selected Poems (1979, 2nd edn., 2007), As I Walked Out One Evening (selected light verse, 1995), and the continuing Complete Works of W. H. Auden (1986– ).\nHis work on Thomas Pynchon includes Pynchon: A Collection of Critical Essays (1978) and numerous essays, including \"The Sacred, the Profane, and The Crying of Lot 49\" (1975; reprinted in the 1978 collection) and \"Gravity's Encyclopedia\" (in Mindful Pleasures: Essays on Thomas Pynchon). The latter essay introduced the critical category of \"encyclopedic narrative,\" further elaborated in a later essay, \"Encyclopedic Narrative from Dante to Pynchon\".\nHe is the editor of annotated editions of novels by Thomas Hardy, George Meredith, Arnold Bennett, H. G. Wells, and Anthony Trollope. With Michael Seidel he co-edited Homer to Brecht; The European Epic and Dramatic Traditions (1977).\nHe was elected to the American Academy of Arts and Sciences in 2015. He was elected a Member of the American Philosophical Society in 2017. He is a Fellow of the Royal Society of Literature, and was the first Isabel Dalhousie Fellow at the Institute for Advanced Studies in the Humanities at the University of Edinburgh.\nBefore teaching at Columbia, he was an associate professor of English at Yale University and a visiting associate professor of English at Harvard University. He received a B.A. from the University of Rochester (1966) and a Ph.D. from the Johns Hopkins University (1969).\nSince 1986 he has written about computing, software, and typography and is a contributing editor of PC Magazine.\nHe is married to the writer Cheryl Mendelson.\nBibliography\nBooks\n*\n** Other editions: Random House, 1976. Revised edition: Vintage Books, 1991 ; Faber & Faber, 1991. Further revised edition: Modern Library, 2007; Faber & Faber 2007.\n* (as co-editor) Homer to Brecht: The European Epic and Dramatic Traditions. Yale University Press, 1977. In collaboration with Michael Seidel.\n* (as editor) Pynchon: A Collection of Critical Essays. Prentice-Hall, 1978.\n* (as editor) W. H. Auden. The English Auden: Poems, Essays and Dramatic Writings, 1927–1939. Faber & Faber, 1977; Random House, 1978.\n* (as editor) W. H. Auden. Selected Poems: New Edition. Vintage Books, 1978; Faber & Faber, 1978; expanded edition: Vintage Books, 2007.\n* Early Auden. Viking, 1981; Faber & Faber, 1981; revised paperback edition: Harvard University Press, 1983; Faber & Faber, 1999; Farrar, Straus & Giroux, 2000.\n* (as editor) The Complete Works of W. H. Auden (eight vols). Princeton University Press, 1986– ; Faber & Faber, 1986– .\n* Later Auden. Farrar, Straus & Giroux, 1999; Faber & Faber, 1999; revised paperback edition: Farrar, Straus & Giroux, 2000.\n* The Things That Matter: What Seven Classic Novels Have To Say About the Stages of Life. Pantheon, 2006; with new afterword, Anchor Books, 2007.\n* Moral Agents: Eight Twentieth-Century American Writers. New York Review Books, 2015.\n* Early Auden, Later Auden: A Critical Biography. Princeton University Press, 2018; revised from two earlier books on Auden.\nEssays and reporting\n* \"The Sacred, the Profane, and The Crying of Lot 49\". Individual and Community: Variations on a Theme in American Literature, ed. Kenneth H. Baldwin and David K. Kirby. Duke University Press, 1975; revised version in Pynchon: A Collection of Critical Essays (see above),\n* \"Gravity's Encyclopedia\". Mindful Pleasures: Essays on Thomas Pynchon, ed. George Levine and David Leverenz. Little, Brown, 1976.\n* \"Encyclopedic Narrative, from Dante to Pynchon\". MLN, 91 (December 1976).\n* \"The Word & the Web\". New York Times Book Review, 2 June 1996.\n*\n*\n*\n*\n*\n*\nBook reviews\n{|class='wikitable sortable' width='90%'\n|-\n!|Year\n!class='unsortable'|Review article\n!class='unsortable'|Work(s) reviewed\n|-\n|2019\n|\n|\n|}\nReferences\nFurther reading\n* Contemporary Authors (Gale Research), vol. 65–68\n* Contemporary Authors: New Revision Series (Gale Research), vols. 11, 87\n* The Oxford Companion to Twentieth-Century Literature in English, ed. by Jenny Stringer (1996)"
    }
  ]
}