{
  "content": [
    {
      "type": "text",
      "text": "# Edward Alexander Wyon__disambig_1\n\n|death_place           = Hastings, East Sussex, England\n|alma_mater            =\n|influences            =\n|influenced            =\n|practice              =\n|significant_buildings = St John the Evangelist's ChurchHollington, Hastings, East Sussex\n|awards                =\n}}\nEdward Alexander Wyon (1842; London – 1872; Hastings) was a London architect and poet, descended from the Wyon family of engravers. His only known building is St John the Evangelist Church in Hollington, Hastings in East Sussex. His posthumous publication, A Memorial Volume of Poems (1874), continues to be reprinted in the 21st century. He died in Hastings prior to his thirtieth birthday.\nBiography\nAncestry\nHis father was Edward William Wyon (1811–1885), a sculptor born in Christchurch, Surrey, who belonged to the Wyon family of engravers and medallists. Edward Alexander's grandfather was Thomas Wyon the elder (1792–1817), and his uncles were Thomas Wyon the younger, and Benjamin Wyon (1802–1858). Edward Alexander's mother was Elizabeth Smyth, (born St James's 1820; died Barnet 1890). His parents were married in 1841, at Marylebone, London.\nEdward Alexander and his siblings\nEdward Alexander Wyon was his parents' eldest son, born in Bloomsbury or St Pancras in the last quarter of 1842. In 1851 he was eight years old and a scholar, living at 36 Stanhope Street, St Pancras, with his father, mother, sister Florence Elizabeth Riddel (born St Pancras 1850), his brother Charles William John (1845–1856) and general servant Mary Anderson. In 1861 he, his parents, his sisters Florence and Jessie Mary Ann (born St Pancras 1855) and a servant Susannah Tayler were at 221 Euston Road, St Pancras. At age eighteen he was already calling himself an architect. In 1871 he was living with his mother at 70 Mornington Road, St Pancras, his two sisters and general servant Eliza Green; his father lived next door. He died in Hastings in the first quarter of 1872, aged 29 years. He never married.\nAfter his death\nEdward Alexander Wyon is credited with the authorship of the posthumous book, A Memorial Volume of Poems (1874). His sister Florence married in 1879 at Marylebone, to Reverend Charles James Goody (born 1835). Their son, Charles Edward Goody (born 1881) and Edward Alexander's nephew, was an Oxford undergraduate in 1901. His sister Jessie Mary Ann Wyon never married; she died about the same time as her mother in 1890 in Barnet, aged 35 years.\nProfessional life and works\nHe practised from an office in Duke Street, London. His only known work is St John the Evangelist Church, Hollington, constructed between 1865 and 1868 by engineer John Howell & Son It is built with Bath Stone dressings; it has one aisle on the south side and a south-east tower. There was a finial on the slimmer, round tower; removed in the 20th century. It was consecrated by Ashurst Gilbert, Bishop of Chichester, in April 1868. This church is not listed.\nReferences\nBibliography\n* Forrer, Leonard, The Wyons (1917)\n* Wyon, Edward Alexander, A Memorial Volume of Poems by the Late Edward Alexander Wyon (1874) (2008, Kessinger Publishing)"
    }
  ]
}