{
  "content": [
    {
      "type": "text",
      "text": "# Edward Melly\n\n| birth_place  = Liverpool, Lancashire, England\n| death_date   =\n| death_place  = Nuneaton, Warwickshire, England\n| occupation   = Businessman, public servant and philanthropist\n| spouse       = Harriet Lees\n| known_for    =\n| children     =\n| parents      = Charles Pierre Melly\n| burial_place =\n}}\nEdward Ferdinand Melly (1857 – 17 May 1941) was an English businessman, public servant and philanthropist. Born into a wealthy Liverpool family, Melly is most remembered for his philanthropic work in his adopted hometown of Nuneaton, Warwickshire.\nLife\nMelly was the son of Charles Pierre Melly, a wealthy Liverpool cotton merchant and noted philanthropist. He attended Rugby School, and then trained at the Nunnery Colliery in Sheffield as a coal mining manager. He was brought to Nuneaton in 1882 to manage the Griff Colliery which had been sold by Lord Newdegate to Edward's mentor, Emerson Bainbridge. Under his management the colliery thrived\nHe was married three times. His first marriage produced three sons, though after six years of marriage, his wife died in childbirth in 1892. He remarried in 1894, but his second wife died five years later after a short illness. In 1906 he married his lifelong friend Harriet Lees (or 'Hattie'), with whom he adopted two children.\nPhilanthropic work\nFollowing his father's death in 1888, Melly arranged with the council to establish a drinking fountain in his memory.\nIn 1890, he donated land for the Chilvers Coton Recreation Ground and gave four of the Pingles Fields \"to be used as a public park forever\".\nMelly also played a major role in the founding of the Nuneaton General Hospital, which became known as the 'Manor Hospital'. He was its financial secretary and he collected £4,500 in donations ()., towards which he donated £500 (). of his own money. One of the wards was later named after him.\n]]\nMelly donated the lands for Riversley Park, which was named after his Liverpool home, which opened on July 6, 1907. He also donated £600 (). towards the Nuneaton Museum & Art Gallery in the park, which was started in 1914, and completed in 1917.\nDuring the First World War in 1916 he established a Red Cross hospital in Weddington Hall in order to treat sick and wounded soldiers. He personally paid for most of the equipment being used in the hospital.\nPublic service\nMelly was a Councillor on the Nuneaton and Chilvers Coton Urban District council, and later the Nuneaton Borough Council. He served as mayor between 1908–10 and 1926–27 and became an Alderman just before the outbreak of the First World War.\nMelly served as a magistrate for 40 years, becoming chairman of the Nuneaton\nBench. He was described as being \"merciful\" towards wrongdoers, the exception being cases involving cruelty to children.\nIn 1930, he was made Freeman of the Borough, the highest honour which the town could bestow.\nDeath\nOn 17 May 1941, Melly's home on Church Street, Nuneaton, was hit by a bomb dropped during a large German air raid on the town. Melly and his wife Hattie were both killed in the explosion. He was 83.\nReferences"
    }
  ]
}