{
  "content": [
    {
      "type": "text",
      "text": "# Edward C. Green\n\nEdward C. (Ted) Green (born 1944) is an American medical anthropologist working in public health and development. He was a senior research scientist at the Harvard School of Public Health and served as senior research scientist at the Harvard Center for Population and Development Studies for eight years, the last three years as director of the AIDS Prevention Project. He was later affiliated with the Department of Population and Reproductive Health at Johns Hopkins University (2011–14) and the George Washington University as research professor (since 2015). He was appointed to serve as a member of the Presidential Advisory Council on HIV/AIDS (2003–2007), and served on the Office of AIDS Research Advisory Council for the National Institutes of Health (2003–2006). Green serves on the board of AIDS.org and the Bonobo Conservation Initiative. and Medical Care Development.\nGreen has worked for more than 40 years in international development. Much of his work since the latter 1980s has been related to AIDS and sexually transmitted diseases, primarily in Africa, but also in Asia, Latin America, the Caribbean, the Middle East and Eastern Europe. He served as a public health adviser to the governments of both Mozambique and Eswatini (Swaziland.) In March 2009 Green's comments were widely quoted in the media when he publicly agreed with Pope Benedict XVI's claim that the distribution of condoms was not helping and might be aggravating the problem of the spread of AIDS in southern and east Africa.\nEducation and research history\nEdward Green attended the Groton School, in Groton, Massachusetts and Seoul American High School in Korea (1960–62). He was educated at George Washington University (B.A., 1967, Anthropology), Northwestern University (M.A., 1968, Anthropology) and the Catholic University of America (Ph.D., 1974, Anthropology).  He held post-doctoral fellowships at Vanderbilt University (1978–79), Harvard University (2001–2002), and visiting lectureships at the University of Kentucky and West Virginia University.\nHe taught public health and anthropology at both Boston University and George Washington University for a short time (1988–89).  Since 1981, Green has held various research positions in social science and consultancy roles in many countries in Africa, Asia and eastern Europe. Between 2002 and 2010, he continued these research projects while serving as a Senior Research Scientist at Harvard University's School of Public Health. He was the 2011 Elizabeth Eddy Visiting Professor of Anthropology at the University of Florida. He is the author of 9 books and over 500 scientific articles, book chapters, and commissioned reports.\nFor his dissertation ethnographic research in the early 1970s, Green spent two years living with the Matawai  Maroons of Suriname, descendants of escaped African slaves. They are one of five groups of Maroons (Saramaka) in Suriname whose descendants have lived for more than two centuries in the Amazon rain forest.\nResearch on indigenous healers\nGreen is a pioneer in anthropological research on indigenous healers. He is one of the first to develop public health programs based on collaboration between African indigenous healers and western-style biomedical personnel. He has guided such programs in Mozambique, Swaziland, South Africa and Nigeria. He has published extensively on indigenous African healing roles and behaviors, as well as underlying health-related knowledge and beliefs. He has written the following three books on these topics: Practicing Development Anthropology (1986), AIDS And STDs in Africa: Bridging the Gap Between Traditional Healing and Modern Medicine (1994), and Indigenous Theories of Contagious Disease (1999). Regarding the last, Prof. Charles Good wrote in Ethnology and reprinted on Amazon.com, \"Green ranks among the foremost practitioners of applied medical anthropology who work in developing societies. His focused contract work and extensive published scholarship reflect a strong commitment to separating myth from reality in public health and medical pluralism.\"\nViews on AIDS prevention\nIn Rethinking AIDS Prevention: Learning from Successes in Developing Countries (2003), Green challenged the accepted wisdom of the AIDS prevention community about the efficacy of condoms, HIV counseling and testing as prevention strategies. He argued that epidemiological evidence showed it was behavioral change leading to declines in number (and perhaps concurrency) of sexual partners that was primarily responsible for Uganda's two-thirds decline in HIV prevalence from 1992 to 2003. He also noted evidence of changes in sexual behavior and HIV-prevention success in other countries. Green summarizes the book's thesis as follows: \"The largely medical solutions funded by major donors have had little impact in Africa, the continent hardest hit by AIDS. Instead, relatively simple, low-cost behavioral change programs--stressing increased monogamy and delayed sexual activity for young people--have made the greatest headway in fighting or preventing the disease's spread. Ugandans pioneered these simple, sustainable interventions and achieved significant results.\"\nA review of Rethinking AIDS Prevention in the Journal of the American Medical Association stated: \"If Green’s analysis is correct, we are faced with a troubling paradox: while our technologically sophisticated system often operates at the margin of acceptable cost efficacy, halfway around the world, secular bias and biomedical fiscal power are responsible for discouraging and discrediting simple yet effective solutions, at the cost of millions of lives.\"\nControversy over Pope Benedict and distribution of condoms\nIn March 2009, Green generated controversy when he supported a remark from Pope Benedict XVI about the role of promoting use of condoms among sexually active persons to prevent AIDS in Africa. In a mid-flight news conference en route to Cameroon, Pope Benedict had said: \"If the soul is lacking, if Africans do not help one another, the scourge cannot be resolved by distributing condoms; quite the contrary, we risk worsening the problem.\"\nGreen commented on this with a March 29, 2009, editorial in The Washington Post (\"The Pope May Be Right\"). In this editorial he argued that empirical data supported the pope, and that condoms have not worked as a primary HIV-prevention measure in Africa. Green argued that the tendency of people in steady relationships to avoid using condoms, and the \"risk compensation\" phenomenon (\"if somebody is using a certain technology to reduce risk, a phenomenon actually occurs where people are willing to take on greater risk\"), may account for the failure of condoms to reduce HIV infections in Africa. (Articles in the medical journals British Medical Journal and The Lancet, by Cassell et al. (2006) and Richens et al. (2000) have discussed the potential for condom use to lead to risk compensation or behavioral disinhibition.) Green concludes, \"So what has worked in Africa? Strategies that break up... sexual networks -- or, in plain language, faithful mutual monogamy or at least reduction in numbers of partners, especially concurrent ones.\"\nGreen gave an extended interview with the BBC Northern Ireland on March 29, 2009, to expand on his comments. In this interview, he said that, while there was no proof of a causal connection between condom usage and a decrease or increase in HIV prevalence at the population level, some evidence supported an association between condom distribution and riskier sexual behavior. He cited a study published in the journal JAIDS which \"followed two groups of young people in Uganda. Members of group that had the intensive condom promotion actually was found to have a greater number of sex partners. So that cancels out the risk reduction that the technology of condoms ought to provide.\"\nGreen also stated, \"the distribution and marketing of condoms is not the solution or the best solution to African AIDS.\" When questioned on his belief that condom promotion should be a backup strategy, he answered, \"they should have a back-up role even in the generalised epidemics of Africa. I believe condoms should be made available to everyone. It should be, as you say, the ABC strategy: Abstinence, be faithful, use a condom.\"\nDuring the same interview, he stated that his Harvard research project was ending. When asked if Harvard had ended the project because of his \"politically incorrect\" views on the failure of condom distribution programs in Africa, Green replied:\n\"My position is very politically incorrect. I have always been politically incorrect. I have always questioned authority and tried to speak truth to power whatever the consequences... I don't know whether our programme would have ended when it's ending if I had been more politically correct. You would have to ask Harvard.\"The administrator of Green's Harvard project later clarified in a statement posted on the BBC website that the end date of the project was unrelated to Green's statements about the Pope or condoms in Africa. The statement said (in part): \"The research grant that Dr. Green runs through Harvard University had a 3 year term which would have ended on February 28, 2009. Harvard University and the funder agreed to an extension for an additional year... So I can verify that in no way has Harvard University ended the project.\"\nGreen updated his argument that sexual behavior needs to be addressed in AIDS prevention in two later books: Broken Promises: How the AIDS Establishment Has Betrayed the Developing World, and, with Allison Herling Ruark, AIDS, Behavior, and Culture: Understanding Evidence-Based Prevention, both published in 2011. On the back cover of the latter book, Africanist scholar Prof. John Janzen wrote \"(this book) should be on every Africanist medical anthropology reading list\".\nNew Paradigm Research Fund\nUpon the conclusion of the Harvard AIDS Prevention Research Project grant in April 2010, Dr. Green established the New Paradigm Fund [http://newparadigmfund.org ] to identify, develop and share superior models for addressing the problems associated with AIDS, addiction, rain forest and primate conservation, and aspects of poverty associated with stateless and minority peoples. The New Paradigm Fund collaborated with the Ubuntu Institute [http://ubuntuinstitute.com Ubuntu Institute – Home] working toward the prevention of HIV/AIDS, empowerment of women, eradication of poverty and providing access to education in Africa through the use of African cultural values, heritage and indigenous knowledge systems.\nSmithsonian Archive\nIn 2016, with funding from the Wenner Gren Foundation, the “Edward C. Green papers, circa 1970-2016” were processed through the National Anthropological Archives at the Smithsonian Institution. The organized and indexed collection includes field notes, personal observations and reflections, photographs, audio recordings, and other materials. Additional content is currently under review for inclusion in the archive.\nAn extensive directory of the materials [http://sova.si.edu/record/NAA.2016-31 Edward C. Green papers | Collection: NAA.2016-31] is available online. In addition, sound recordings, including music and field interviews among the Matawai Maroons (descendants of Africa slaves who escaped from the coastal plantations in the 17-18th centuries) of Suriname, have been digitized and can be streamed online. Other materials are available for review by appointment at the National Anthropological Archives.\nDr. Green also released a memoir in 2023 (On the Fringe: Confessions of a Maverick Anthropologist).\nBoard memberships\n* Member, UNAIDS Steering Committee, AIDS2031, UN Geneva, Switzerland (2008-2009)\n* Presidential Advisory Council for HIV/AIDS (2003-2007)\n* Office of AIDS Research Advisory Council, National Institutes of Health (2003-2006)\n* Scientific Advisory Board, National Foundation for Alternative Medicine, Washington, DC (2001-)\n* Board of Directors, Medical Care Development, Augusta, Maine and Washington, DC (2001-2004)\n* Advisory Board, Global Initiative for Traditional Systems of Health, Oxford University, UK (2000-2008)\n* Founding Board Member, Bonobo Conservation Initiative, Washington, DC (1997-)\n* Editorial Board, Journal of Alternative and Complementary Medicine (1998-2003)\n* Board of Directors, World Population Society (1996-2001)\n* Advisory Board, Health Communications for Child Survival (HEALTHCOM) Project, Academy for Educational Development (1985-1989)\n* Advisory Board, Social Marketing (SOMARC) Project, Academy for Educational Development (1984-1986)\n* Steering Committee (Swaziland TasP Study) Médecins Sans Frontières (MSF, Doctors without Borders) Switzerland, 2013–2016\nBibliography\nBooks\n* On the Fringe: Confessions of a Maverick Anthropologist (2023)\n* (with Allison Ruark) AIDS, Behavior, and Culture (2011)\n* Broken Promises: How the AIDS Establishment Has Betrayed the Developing World (2011)\n* (with Allison Ruark) The ABC Approach to Preventing The Sexual transmission of HIV (2006)\n* Rethinking AIDS Prevention: Learning from Successes in Developing Countries (2003)\n* Indigenous Theories of Contagious Disease (1999)\n* Indigenous Healers and the African State: Policy Issues Concerning African Indigenous Healers in Mozambique and Southern Africa (1996)\n* AIDS and STDs in Africa: Bridging the Gap Between Traditional Healing and Modern Medicine (1994)\n* Practicing Development Anthropology (1986)\n* Planning Psychiatric Services for Southeast Africa (1979)\nCongressional testimony\n* Green, E.C., Testimony, “HIV prevention: How Effective is PEPFAR?” House Government Reform Subcommittee on National Security, Emerging Threats, and International Relations, U.S. House of Representatives, Sept. 6, 2006.\n* Green, E.C., \"Statement on Blood Safety for Disease Prevention.\" Committee on International Relations, Subcommittee on Africa, Global Human Rights, and International Operations, U.S. House of Representatives, June 27, 2006.\n* Green, E.C., \"Testimony, Fighting AIDS in Uganda: What Went Right?\" Hearing before the Subcommittee on African Affairs of the Committee on Foreign Relations, United States Senate, One Hundred Eighth Congress, first session, May 19, 2003 (pp.&nbsp;36–40, also co-author of pp.&nbsp;15–23)\n* Green, E.C., “HIV/AIDS, TB, and Malaria: Combating a Global Pandemic.” Testimony on AIDS in Africa for committee hearing, The House Committee on Energy and Commerce, U.S. House of Representatives, March 20, 2003.\nMusic\nGuitarist in rock band in the 1960s in Seoul, Korea (The Silvertones). Fiddler and multi-instrumentalist in Appalachian string bands in the 1970s (Sweetwater String Band, Washington, DC, [mentioned in the Greater Washington Folklore Society March 1979 newsletter, p.&nbsp;3:],  and the Wild Turkey String Band, Morgantown, WV [an article on the band appears in the July 1977 issue of \"Goldenseal,\" Vol 3 #3, p 55-58; See Author index page,under Charles Bell; also mentioned in the book \"Mountaineer Jamboree: Country Music in West Virginia\" (1984) by Ivan M. Tribe, p.&nbsp;161.] ).\nReferences\nExternal links\n*[https://web.archive.org/web/20110727122037/http://www.newparadigmfund.org/faculty-staff/edward-c-green-nprf.html \"Edward C. Green,\" Biography at Harvard AIDS Prevention Research Project website]\n* [https://web.archive.org/web/20110727122051/http://www.newparadigmfund.org/Edward-C-Green-CV.pdf Edward C. Green's curriculum vitae]\n* [https://web.archive.org/web/20110728071322/http://www.stwr.org/health-education-shelter/dialogue-on-aids-prevention.html Dialogue on AIDS Prevention], Share the World's Resources"
    }
  ]
}