{
  "content": [
    {
      "type": "text",
      "text": "# Edward K. Gaylord\n\n| birth_place        = Muscotah, Kansas, U.S.\n| death_date         =\n| death_place        = Oklahoma City, Oklahoma, U.S.\n| known_for          =\n| spouse             = Inez Kinney (m. 1914)\n| children           = 3\n}}\nEdward King Gaylord (March 5, 1873 – May 30, 1974), often referred to as E.K. Gaylord, was the owner and publisher of The Daily Oklahoman newspaper (now The Oklahoman), as well as a radio and television entrepreneur. A native of Kansas and educated in Colorado, he worked on several publications before moving to Oklahoma and buying an interest in The Daily Oklahoman. He built the publication into a statewide newspaper and took over its parent company, the Oklahoma Publishing Company (OPUBCO), in 1918.\nAfter his death in 1974, Gaylord's family continued to run the newspaper until OPUBCO was sold to The Anschutz Corporation in 2011.\nEarly life and career\nBorn on a farm near Muscotah in Atchison County, in eastern Kansas, Gaylord attended Colorado College in Colorado Springs, Colorado. His older brother, Lewis, talked him into buying the Colorado Springs Telegraph and later got him to work as the business manager of the St. Joseph Dispatch in Missouri.\nOklahoma\nGaylord came to Oklahoma City in December 1902 and bought an interest in The Daily Oklahoman, which had been founded in 1889. He became the paper's business manager in January 1903. Gaylord married Inez Kinney of New York City in 1914. In 1918, he became president of OPUBCO, the newspaper's parent company.\nHe built The Daily Oklahoman into a statewide newspaper, took part in the statehood movement, and was responsible for building a small experimental radio operation into the state's first major radio station, WKY. He also established the state's first television station, WKY-TV.\nGaylord died of a heart attack at his Oklahoma City home on May 30, 1974.\nGaylord family\nGaylord's daughter, Edith Kinney Gaylord, enjoyed a storied career as a journalist before devoting her life to charitable giving. In 1982, she founded both Inasmuch Foundation and Ethics and Excellence in Journalism Foundation (EEJF) to carry out her giving. In 2014, the corporate entities merged and EEJF became a wholly owned subsidiary of Inasmuch Foundation.\nHis son, Edward Gaylord, inherited controlling interest but not complete ownership of The Daily Oklahoman and other family assets worth $50 million in 1974. Educated in business at Stanford University, Edward L. increased the family fortune by a factor of forty, to $2 billion at his death in 2003. The younger Gaylord purchased the Grand Ole Opry in Nashville, Tennessee. He also created the cable television channels The Nashville Network (TNN) and Country Music Television (CMT).\nThe Daily Oklahoman newspaper, renamed The Oklahoman in 2003, remained owned by the Gaylord family until the sale to Anschutz. Although a respected newspaper during E.K. Gaylord's tenure, it became unabashedly partisan after Edward L. became its publisher; in Oklahoma some critics would satirize the paper as \"The Daily Disappointment,\" and the Columbia Journalism Review dubbed it \"The Worst Newspaper in America\" in 1999.\nFrom Edward L.'s death until the 2011 sale, the newspaper was led by his daughter Christy Gaylord Everest. She led a major visual modernizing of the newspaper and was assisted in its operation by her sister, Louise Gaylord Bennett.\nThe Gaylord family have frequently provided selected philanthropic contributions, including major support to the National Cowboy Hall of Fame in Oklahoma City, and have given the University of Oklahoma contributions totaling over $50 million, resulting in a large proportion of the buildings on campus being named after one family member or another. They provided seed money for the university's Gaylord College of Journalism and Mass Communication, which then constructed a new facility thanks in a large part to Gaylord donations.\nReferences\nExternal links\n* [http://digital.library.okstate.edu/encyclopedia/entries/G/GA025.html Encyclopedia of Oklahoma History and Culture - Gaylord, Edward K.]"
    }
  ]
}