{
  "content": [
    {
      "type": "text",
      "text": "# Edward Lombe (1828)\n\n{|\n| Ship name=Edward Lombe\n| Ship namesake=\n| Ship owner=Robert Freeman (1833-1834)\n| Ship operator=\n| Ship ordered=\n| Ship builder=Thomas Brodrick, Whitby\n| Ship original cost=\n| Ship laid down=\n| Ship launched=21 February 1828\n| Ship registry=London 84/1828, 59/1832, 67/1834.\n| Ship acquired=\n| Ship commissioned=\n| Ship decommissioned=\n| Ship in service=\n| Ship out of service=\n| Ship renamed=\n| Ship struck=\n| Ship reinstated=\n| Ship honours=\n| Ship honors=\n| Ship captured=\n| Ship fate=Wrecked on 25 August 1834\n| Ship notes=\n}}\n| Ship class=\n| Ship tons burthen=347, or 347}} (bm)\n| Ship length=\n| Ship beam=\n| Ship draught=\n| Ship draft=\n| Ship hold depth=\n| Ship propulsion=\n| Ship sail plan=Ship-rigged, then barque\n| Ship complement=\n| Ship armament=\n| Ship notes=\n}}\n|}\nEdward Lombe was a merchantman and passenger three-masted barque built in 1828 by Thomas Brodrick, of Whitby, England.\nCareer\nEdwarde Combe first appeared in ''Lloyd's Register (LR) in 1828 with Freeman, master and owner.\nOn 24 August 1830, she arrived at Fremantle, from London, carrying cargo and 22 passengers. She then returned to London. She was sheathed in copper in 1832.\nUnder the command of Whiteman Freeman, she left London with cargo on 25 June 1832. She left Hobart on 28 December, having taken on five convicts that Merope had delivered to Hobart from India. She arrived at Port Jackson, Australia, on 6 January 1833. She left Port Jackson on 15 April 1833 and returned to London, with a cargo of wool and passengers.\nUnder the command of Stuart Stroyan, she left London and arrived at Hobart on 31 July 1834. She left Hobart on 17 August 1834.\nFate\nWhile entering Port Jackson on 25 August 1834, she was blown onto Middle Head during a gale and was wrecked. The captain, four crew members, and six passengers lost their lives, most when heavy seas swept over her; two passengers (one of them a woman), and 16 crew survived. When she broke in half the poop containing most of the survivors remained on the rocks and at dawn the survivors were able to attract the attention of a passing ship.\nPost script\nThe loss of Edward Combe was one of the factors leading in August 1836 to Ann, the first lightship in Australia, being moored at the north-western end of Sow and Pigs Reef. She replaced an iron beacon that in 1820 had been placed on the reef. Between 1856 and 1877  replaced Ann.\nCitations\nReferences\n*\n* Weatherill, Richard (1908) The ancient port of Whitby and its shipping''. (Whitby: Hokne and Son)"
    }
  ]
}