{
  "content": [
    {
      "type": "text",
      "text": "# Edward Killingworth Johnson\n\n| death_place      = Halstead, Essex\n| education        =\n| field            =\n| training         =\n| movement         =\n| works            =\n| patrons          =\n| awards           =\n| spouse           =\n| partner          =\n|children =\n}}\nEdward Killingworth Johnson  (1825 – 1896) was a British wood-engraver, illustrator, and watercolour painter. He is known for creating the first illustrations of Rider Haggard's 1887 novel She.\nBiography\nJohnson was born in Bow, London on 30 May 1825 to an Irish merchant, Richard Johnson, and his wife Mary Meadows. He was trained as an apprentice to the wood-engraver John Orrin Smith from 1839, and then to Smith's business partner William James Linton. He then worked as a wood engraver for several years. He studied drawing at the Langham Life School, and started painting professionally c. 1863. In the 1860s he contributed regularly to the illustrated periodicals The Illustrated London News and from 1869 The Graphic. He became a member of the Society of Painters in Water Colours in 1876; he exhibited his works there, at the Royal Academy, the American Society of Painters in Water Color, the Philadelphia Exhibition and the Paris Universal Exhibition.\nJohnson married Hannah Reynolds in November 1871; they moved out of London to his family home in Baker's Farm, Essex, and had three children. His uncles were the illustrator and watercolourist John Masey Wright and the marine painter James Meadows. He died in Halstead, Essex, on 7 April 1896, and was buried in Sible Hedingham.\nWorks\nJohnson prepared the first illustrations of Rider Haggard's 1887 novel She; these remain among his best-known works.\nMany of Johnson's works are listed in the auction catalogue prepared after his death.\nFile:The Accordion Lesson by Edward Killingworth Johnson 1869.jpg|The Accordion Lesson, Watercolour and bodycolour, 1869\nFile:E K Johnson.jpg|Feeding a pony in a Surrey garden. Watercolour, 1879\nFile:She fire.jpg|The sacred fire in Rider Haggard's She, illustration, 1887\nReferences"
    }
  ]
}