{
  "content": [
    {
      "type": "text",
      "text": "# Edward Powys Mathers\n\n| birth_place      = Forest Hill, London, England\n| death_date       =\n| death_place      = Hampstead, London, England\n| alma_mater       = Trinity College, Oxford\n| occupation       = Translator, poet and cryptic crossword compiler\n| notable_works    = ''Cain's Jawbone''\n| parents          = Edward Peter Mathers and Mary Augusta Powys\n| pseudonym        = Torquemada\n}}\nEdward Powys Mathers (28 August 1892 &ndash; 3 February 1939) was an English translator and poet, and also a pioneer of compiling advanced cryptic crosswords.\nBiography\nPowys Mathers was born on 28 August 1892 in Forest Hill, London, England, the son of Edward Peter Mathers, newspaper proprietor. He was educated at Loretto School and Trinity College, Oxford.\nHe translated J. C. Mardrus's French version of One Thousand and One Nights. His English version of Mardrus appeared in 1923, and is known as Mardrus/Mathers. He also translated The Garden of Bright Waters: One Hundred and Twenty Asiatic Love Poems (1920); and the Kashmiri poet Bilhana in Bilhana: Black Marigolds (1919), a free interpretation in the tradition of Edward FitzGerald, quoted at length in John Steinbeck's 1945 novel Cannery Row. These are not scholarly works, and are in some cases based on intermediate versions in European languages. Some of his translations were set to music by Aaron Copland. As noted by The New York Times, Powys Mathers \"rendered into English poems from almost all the Asiatic languages: from Sanskrit and Chinese, Annamese and Arabic, Hindustani and Afghan.\"\nPowys Mathers was notable as a composer of cryptic crosswords for The Observer, from 1926 until his death, using the pseudonym \"Torquemada\" (in allusion to the first Grand Inquisitor of Spain, Tomás de Torquemada). under which name he reviewed detective stories from 1934 to 1939. Powys Mathers was the author of Crosswords for Riper Years (1925) and The Torquemada Puzzle Book (1934), which included the murder mystery puzzle ''Cain's Jawbone.\nIn 1919, he married Rosamond Crowdy (5 July 1886 – 7 June 1965), third daughter of Colonel H. Crowdy, RE.\nPowys Mathers died in his sleep at his home in Hampstead, London, on 3 February 1939, aged 46.\nReferences\nExternal links\n*\n*\n*\n*\n* [http://www.sacred-texts.com/hin/bilhana/index.htm Black Marigolds at sacred-texts.com]\n* [https://web.archive.org/web/20040622151638/http://www.wenaus.com/poetry/gardenbrightwaters.html The Garden of Bright Waters]"
    }
  ]
}