{
  "content": [
    {
      "type": "text",
      "text": "# Edward G. Janeway\n\n| birth_place         = New Rochelle, New York, U.S.\n| death_date          =\n| death_place         = Hanover, New Hampshire, U.S.\n| resting_place       = Middletown Cemetery, Londonderry, Vermont\n| occupation          = Politician, investment banker, dairy farmer, cattle breeder\n| party               = Republican\n| alma_mater          = Yale University (B.A., 1922)\n| branch              = U.S. Navy\n| rank                = Lieutenant Commander\n| office1             = President of the Vermont State Senate\n| term_start1         = 1969\n| term_end1           = 1975\n| office2             = Member of the Vermont Senate\n| term_start2         = 1959\n| term_end2           = 1979\n| office3             = Member of the Vermont House of Representatives\n| term_start3         = 1951\n| term_end3           = 1957\n| spouse              = Elinor White\n| parents             = Theodore Caldwell Janeway (father); Eleanor Caroline (Alderson) Janeway (mother)\n}}\nEdward G. Janeway (August 25, 1901 &ndash; January 10, 1986) was a Vermont politician who served as President of the Vermont State Senate.\nBiography\nThe son of Theodore Caldwell Janeway and Eleanor Caroline (Alderson) and brother of Charles Alderson Janeway, Edward Gamaliel Janeway was born in New Rochelle, New York on August 25, 1901. He graduated from Yale University in 1922 and became an investment banker with White Weld & Co. in New York City.\nJaneway served in the Navy during World War II, attaining the rank of lieutenant commander.In 1945 he moved to South Londonderry, Vermont, where he was a dairy farmer and cattle breeder.He was also active in several businesses, including serving on the board of directors of the Catamount National Bank and the Stratton Corporation.  He was also involved in several civic projects, including holding the office of President of the Calvin Coolidge Memorial Foundation.\nHe served in several local offices, including town meeting moderator and school board member.\nA Republican, Janeway served in the Vermont House of Representatives from 1951 to 1957.\nJaneway served as a member of the Republican National Committee from 1952 to 1972.\nIn 1958 Janeway was elected to the Vermont Senate.  He served 10 terms, 1959 to 1979, and was Senate President from 1969 to 1975.\nJaneway died in Hanover, New Hampshire on January 10, 1986.He was buried at Middletown Cemetery in Londonderry, Vermont.\nFamily\nJaneway was married to Elinor White, whose family was involved in founding the White Weld & Co. investment company.\nReferences\nExternal links\n*"
    }
  ]
}