{
  "content": [
    {
      "type": "text",
      "text": "# Edward Haughton\n\n|         death_place = Hersham, Surrey, England\n|            heightft =\n|          heightinch =\n|             batting = Unknown\n|             bowling = Unknown\n|                role =\n|              family =\n|               club1 = Europeans\n|               year1 = 1912/13–1914/15\n|             columns = 1\n|             column1 = First-class\n|            matches1 = 7\n|               runs1 = 288\n|            bat avg1 = 22.15\n|           100s/50s1 = –/1\n|          top score1 = 55\n|         deliveries1 = 705\n|            wickets1 = 12\n|           bowl avg1 = 27.50\n|            fivefor1 = –\n|             tenfor1 = –\n|       best bowling1 = 3/30\n|  catches/stumpings1 = 6/–\n|                date = 27 May\n|                year = 2023\n|              source = https://www.espncricinfo.com/cricketers/edward-haughton-29343 ESPNcricinfo\n}}\nEdward Juxon Henry Haughton  (19 January 1883 — 17 November 1955) was an English first-class cricketer and British Indian Army officer.\nThe son of Colonel Thomas Hutchinson Haughton, he was born in British Burma at Moulmein in January 1883. He was educated in England at Bedford, before attending the Royal Military College, Sandhurst. He graduated from there into the Royal Warwickshire Regiment as a second lieutenant in January 1902. He was transferred to the British Indian Army in November 1903, being appointed to the 78th Moplah Rifles and being promoted to lieutenant in April 1904. With the abolition of the 78th under the Kitchener reforms of 1907, Haughton was posted to the Maratha Light Infantry. He was promoted to captain in July 1911. Haughton played first-class cricket in India for the Europeans cricket team, making his debut against the Parsees at Poona in the 1912-13 Bombay Presidency Match. He played for the Europeans until September 1914, making six appearances in the Bombay Presidency Matches. He scored 211 runs in these matches, at an average of 17.58 and a highest score of 55. With the ball, he took 10 wickets at a bowling average of 24.70, with best figures of 3 for 30. In addition to playing for the Europeans, Haughton also made a single first-class appearance for J. G. Greig's XI against the Hindus in August 1912, scoring 77 runs in the match and taking 2 wickets.\nHaughton served in the British Indian Army during the First World War, where he saw action in the Mesopotamian campaign. As part of the 105th Maratha, he joined up with the 3rd (Lahore) Division in September 1916 to take part in the attempt to relieve British forces besieged of Kut, with him seeing action in the First Battle of Jebel Hamlin in March 1917. He had been promoted to major in January 1917. During his deployment to Mesopotamia, Haughton was awarded the Royal Humane Society Bronze Medal for saving the life of a member of the Gurkha Rifles who had fallen into the Shatt al-Arab, with him jumping into the river to save the Rifleman. He was made a Companion of the Distinguished Service Order in February 1918. In the closing stages of the war, the 3rd Lahore Division was transferred to Egypt, but Haughton returned to India. There he served as a brigade major, and saw action in the Third Anglo-Afghan War, where he was wounded in action. He was promoted to lieutenant colonel in May 1926, before retiring from active service in April 1931. Haughton later retired to England, where he died suddenly while playing golf at Burhill Golf Club in Surrey on 17 November 1955.\nReferences\nExternal links\n*"
    }
  ]
}