{
  "content": [
    {
      "type": "text",
      "text": "# Edward M. Sion\n\nEdward M Sion (born January 18, 1946) is an American astrophysicist who is Professor in the Department of Astrophysics and Planetary Science at Villanova University. He specializes in the structure and evolution of white dwarf stars and white dwarf stars in explosive binary star systems known as cataclysmic variables.\nEarly life\nEdward M. Sion is a US citizen of Lebanese descent.\nSion received a BA in Astronomy from the University of Kansas in 1968 and an MA in Astronomy from KU in 1969. He received a PhD in Astrophysics at the University of Pennsylvania in 1975.\nCareer\nIn 1977, Sion co-authored the Catalogue of Spectroscopically Identified White Dwarf Stars with George P. McCook. The book was converted to an online directory by Villanova University and contains over 20,000 identified white dwarf stars. The catalog introduced the WD-number, which uses the equatorial coordinate system to identify each white dwarf on the sky. The book and database are frequently referenced in journals since its creation.\nSion led a team of collaborators who developed the fundamental classification system of white dwarf stars in 1983. This system is used worldwide, and characterizes both the chemical composition  class and surface temperature of each known white dwarf star.\nIn 1984, Sion uncovered empirical evidence that the hydrogen-rich white dwarfs transform into helium-rich white dwarfs when deepening helium convection, as a white dwarf cools, mixes hydrogen downward.\nIn the mid-1990s, Sion led a team of collaborators, using the Hubble Space Telescope, to unveil the physical properties of white dwarfs in explosive cataclysmic variables and how they cool and heat in response to the accretion of mass from a sun-like companion star, a process which leads to nova explosions and, for the most massive white dwarfs, supernova explosions.\nFrom 1996, he served as associate editor of The Astrophysical Journal for six years.\nThe Lebanese government founded a non-profit in 2007, which would become their national academy of sciences. Sion was invited to be a founding member of the national academy, the Lebanese Academy of Sciences, a clone of the French Academy of Sciences.\nSion's studies of white dwarf stars has led to his publishing over 588 scientific articles of which 246 peer-reviewed articles have appeared in journals such the Astrophysical Journal, Astronomical Journal, Astronomy and Astrophysics (the European Journal), Publications of the Astronomical Society of the Pacific, and the Monthly Notices of the Royal Astronomical Society. Sion also acts as a featured expert on Big Think.\nWith over 649 scientific publications, 64 of which share authorship with Villanova students, Dr. Sion continues to have a strong impact on the field and has been ranked in the top 2% of researchers globally by Stanford University in 2019.\nBooks\n*\n*\n*\n*\n*\nAppointments and awards\n* 1989 - Outstanding Faculty Research Prize - Villanova University.\n* 2007 - Founding member of the Lebanese Academy of Sciences.\n* 2010 - University of Kansas Associate Member, Alumni Advisory Board.\n* 2014 - Co-chairman of The Third Middle East and Africa Regional IAU Meeting (MEARIM III) Beirut-Lebanon.\n* 2021 - Outstanding Faculty Research Mentor Award at Villanova University.\n* Elected to the Franklin Institute, Philadelphia, Science and the Arts committee (founded 1824), which confers Benjamin Franklin Medals in physics, chemistry, life sciences, and engineering.\nSion has served sabbatical appointments at Arizona State University, Centre Nationale de la Recherche Scientifique, University of Toulouse and the Hubble Space Telescope Science Institute.\nReferences"
    }
  ]
}