{
  "content": [
    {
      "type": "text",
      "text": "# Edward Wingfield Humphreys\n\n)\n| constituency_MP   = Christchurch North\n| parliament        = New Zealand\n| term_start        = 1889\n| term_end          = 1890\n| predecessor       = Julius Vogel\n| successor         = electorate abolished\n|order2             =\n|office2            =\n|term_start2        =\n|term_end2          =\n|predecessor2       =\n|successor2         =\n|constituency       =\n|majority           =\n|birth_date         = 1841\n|birth_place        = Montgomeryshire\n|death_date         = April 1892\n|death_place        = London\n|restingplace       =\n|restingplacecoordinates =\n|birthname          =\n|nationality        =\n|party              =\n|otherparty         =\n|spouse             = Alice Humphreys (née Hawdon)\n|partner            =\n|relations          = Frederic Jones (cousin)Robert Campbell (brother in law)\nJoseph Hawdon (father in law)\n|residence          =\n|alma_mater         =\n|occupation         =\n|profession         =\n|cabinet            =\n|committees         =\n|portfolio          =\n|religion           =\n|signature          =\n}}\nEdward Wingfield Humphreys (1841 – April 1892) was a New Zealand member of parliament representing Christchurch North from 1889 to 1890.  He was also a farmer in Otago, and his extended family included a number of political figures.\nEarly life\nHumphreys was born in 1841 in Montgomeryshire, Wales. He was the second son of Erskine Humphrey, a barrister at law of Lincoln's Inn. He received his education at Harrow School, a boarding school in north-west London in the town of Harrow.\nHe emigrated to New Zealand and settled in the Strath Taieri district for farming. He purchased several areas of land (Six Mile, Garthmyl and Gladbrook), which were part of runs 213 and 213A.\nHe married Alice Humphreys (née Hawdon), the second daughter of Hon. Joseph Hawdon MLC on 22 April 1869 at St John the Baptist Church in Christchurch. He thus became brother in law with Robert Campbell, who had married Hawdon's eldest daughter, Emma Josephine, on 2 December 1868 in Christchurch. Humphreys was also first cousin with Frederic Jones, who represented the Heathcote electorate from 1887 to 1890.\nPolitical involvement\nAfter having let his property, Humphreys retired to Christchurch in 1888. Although he was a squatter (i.e., a significant pastoral land holder), he had 'decidedly liberal' beliefs, and one of his best friends used to jokingly taunt him with being a 'beastly radical'.\nMember of Parliament\nThe resignation of Sir Julius Vogel caused the 19 June 1889 by-election in the Christchurch North electorate, contested by three candidates. Humphreys, John Ollivier and Eden George received 403, 378 and 184 votes, respectively. Ollivier had prior political experience, representing Christchurch Country in the 2nd New Zealand Parliament. Prior to that, he was the 2nd chairman of the Christchurch Town Council, a role that became that of Mayor of Christchurch a few years later. For Humphreys, who was relatively new to Christchurch, to beat such a well known person with political experience showed how well regarded he had become in a short period of time.\nThe electorates in Christchurch were reorganised for the 5 December 1890 general election. Christchurch North was abolished, and City of Christchurch was set up as a three-member electorate. Humphreys decided to contest this electorate, and the six contenders received the following votes: William Pember Reeves (2774 – elected), Westby Perceval (2721 – elected), Richard Molesworth Taylor (2613 – elected), J. Tippett Smith (1811), Humphreys (1668) and Eden George (119).\nMember of Christchurch City Council\nCharles Gray was elected as Mayor of Christchurch a few days prior to the general election, and his seat in the North-West ward of the Christchurch City Council became vacant. Humphreys declared his candidacy for the city council ward on 10 December. Whilst Humphreys and W. I. Ballinger were nominated on 15 December for the 30 December election, Ballinger withdrew and Humphreys took his seat at the 23 December 1890 council meeting. He retained his seat on the city council until he left for England in September 1891.\nReturn to England\nHumphreys returned to England as he had cancer, and he was given the advice that better specialist medical knowledge was available in his old country. A leaving party was organised for him by the Cambrian Society on 1 September 1891, which had a large attendance. Humphreys died from cancer in London in April 1892. The Humphreys had no children. He was survived by his wife, who married again in England in 1896.\nReferences"
    }
  ]
}