{
  "content": [
    {
      "type": "text",
      "text": "# Edward Lippincott Tilton\n\n| birth_place   = New York City\n| death_date    =\n| death_place   = Scarsdale, New York\n| education     = École des Beaux-Arts\n| significant_buildings = Ellis Island\n| practice      = McKim, Mead & WhiteBoring & TiltonTilton & Githens\n| signature     = Signature of Edward Lippincott Tilton.png\n}}\nEdward Lippincott Tilton (October 19, 1861 – January 5, 1933) was an American architect and archaeologist, with a practice in New York City, where he was born. He specialized in the design of libraries, completing about one hundred in the U.S. and Canada, including many Carnegie libraries and structures for educational institutions.\nEarly life\nTilton was the son of Benjamin W. Tilton and Mary ( Baker) Tilton.\nAt the age of 18, he started working in the banking house of Corlies Macy & Co.\nCareer\nIn about 1881, Tilton abandoned a budding career in banking to work as a draftsman in the office of McKim, Mead & White, a traditional apprenticeship for which he prepared with a private tutor in architecture and which prepared him for a course of further study at the École des Beaux-Arts, Paris (1887–1890). Early commissions came through family connections; they included the casino (1891–92) in Belle Haven, an affluent shoreline community of Greenwich, Connecticut, and the Hotel Colorado in the resort of Glenwood Springs, Colorado (1891–93).\nHe and the partner that he met in Paris, William A. Boring, won a competition in 1897 to design the first phase of new buildings for the U.S. Immigration Station on Ellis Island in New York Harbor.  Four major buildings were all constructed to their designs before the formal partnership was amicably dissolved in 1904. The two architects continued to share an office. He served as president of the American Institute of Architects.\nHe published his thoughts on library planning and construction, in Essentials in Library Planning with A.E. Bostwick and S.H Ranck (1928), and \"Library Planning\" posthumously published in the Journal of the Royal Institute of British Architects (1936).\nWorks\nTilton worked in the partnership Boring & Tilton (1881–1904), as a solo architect, in the partnership Tilton & Githens (1916–1932), then again briefly in solo practice as consulting architect until his death.\nBoring & Tilton (1881–1904)\n, 1897-1900]]\n* U.S. Immigration Station on Ellis Island in New York Harbor:\n** Main Building (1897–1900)\n** Kitchen and Laundry Building (1900–01)\n** Main Powerhouse (1900–01)\n** Main Hospital Building (1900–01)\n* Bayonne Public Library, Bayonne, New Jersey, 1904\nTilton (1904–1916)\n]]\n* Ludington Public Library, Ludington, Michigan, 1906\n* Olean Public Library, Olean, New York, 1907\n* Concordia College campus, Bronxville, New York, 1908\n* Carnegie Science Hall (renamed to Stuart Hall in 1977) at Coe College, Cedar Rapids, Iowa, 1910\n* Elizabeth Public Library, Elizabeth, New Jersey, 1912\n* Springfield City Library, Springfield, Massachusetts, 1912\n* Sioux City Free Public Library, Sioux City, Iowa, 1913\n* Carpenter Memorial Library, Manchester, New Hampshire, 1914 (with architect Edgar Allen Poe Newcomb)\n* Franklin Library, Minneapolis, Minnesota, 1914\n* Belmar Public Library, Belmar, New Jersey, 1914\n* Bond Hall, University of Notre Dame, South Bend, Indiana, 1915\n* [http://www.trentonlib.org/ Trenton Free Public Library] (John Lambert Cadwalader addition), Trenton, New Jersey, 1915\nTilton & Githens (1916–1932)\n* Peabody Library, George Peabody College for Teachers (now part of Vanderbilt University), Nashville, Tennessee, 1919\n* Chester C. Corbin Public Library, Webster, Massachusetts, 1920\n* Riley Hall of Art and Design, University of Notre Dame, South Bend, Indiana, 1920\n* St. Luke's Lutheran Church, NYC, 1922\n* Wilmington Public Library,  Wilmington, Delaware, 1923\n* Knight Memorial Library, Providence, Rhode Island, 1924\n* Mount Pleasant Library, Washington DC, 1925\n* McGregor Public Library, Highland Park, MI, 1926\n* Currier Museum of Art, Manchester, New Hampshire, 1929\n* Central Library, Enoch Pratt Free Library, Baltimore, Maryland, 1931-1933\nPersonal life\nIn 1901, he married Mary Eastman Bigelow. Together, they were the parents of a son:\n* Charles Edward Tilton (1905–2000), an architect who was a graduate of Swarthmore College and the Columbia University School of Architecture.\nTilton died of pneumonia at his home, 89 Greenacres Avenue in Scarsdale, New York on January 5, 1933.\nNotes\nExternal links\n*"
    }
  ]
}