{
  "content": [
    {
      "type": "text",
      "text": "# Edward Bliss Foote\n\n| birth_place = Cleveland, Ohio\n| death_date  =\n| death_place = Larchmont, New York\n| nationality = American\n| other_names =\n| known_for   = Free Speech League\n| occupation  = Author\n}}\nEdward Bliss Foote (February 20, 1829 &ndash; October 5, 1906) was an American medical doctor, writer, and advocate for birth control.\nBiography\nEdward Bliss Foote was born in Cleveland on February 20, 1829.\nIn 1858, he published Medical Common Sense, which contained frank discussion of sexual health for the general public. He was subsequently convicted under the Comstock Act of 1873 and forced to remove information about birth control from the book. He was a co-founder of the Free Speech League.\nHe died in Larchmont, New York on October 5, 1906.\nSelect bibliography\n*Medical Common Sense: Applied to the Causes, Prevention and Cure of Chronic Diseases and Unhappiness in Marriage (1864)\n*Science in story : Sammy Tubbs, the boy doctor, and \"Sponsie,\" the troublesome monkey (1874)\n*Plain Home Talk, Embracing Medical Common Sense (1880)\n*A Fable of the spider and the bees : verified by the facts and press and pulpit comments which should command the serious attention of every American citizen (1881)\n*''Dr. Foote's replies to the Alphites : giving some cogent reasons for believing that sexual continence is not conducive to health (1883)\n*The radical remedy in social science, or, Borning better babies through regulating reproduction by controlling conception : an earnest essay on pressing problems (1886) - Written by his son, E.B. Foote Junior.\n*Dr. Foote's Hand-Book of Health-Hints and Ready Recipes (1888)\n*Dr. Foote's Sexual physiology for the young (1892)\n*Dr. Foote's new book on health and disease : with recipes, including sexology (1903)\n*Dr. Foote's new plain home talk on love, marriage, and parentage. A fair and earnest discussion of human, social, and marital relations (1904)\n*Dr. Foote's home cyclopedia of popular medical, social and sexual science : embracing his new book on health and disease ... also embracing Plain home talk, on love, marriage, and parentage ... (1906)\n*Human Wonders Freaks and Diseases'' (1892)\nReferences"
    }
  ]
}