{
  "content": [
    {
      "type": "text",
      "text": "# Edward Williamson\n\n| ordination       = 1914 (deacon)  1916 (priest)\n| ordained_by      =\n| consecration     = 30 November 1939\n| consecrated_by   =\n| birth_name       = Edward William Williamson\n| birth_date       = 22 April 1892\n| birth_place      =\n| death_date       = 23 September 1953\n| death_place      =\n| buried           = Brecon Cathedral\n| resting_place_coordinates =\n| nationality      =\n| religion         = Anglicanism\n| residence        =\n| parents          =\n| spouse           =\n| children         =\n| occupation       =\n| profession       =\n| education        =\n| alma_mater       =\n}}\nEdward William Williamson was the Bishop of Swansea and Brecon in the Church in Wales from 1939 until his death on 23 September 1953.\nWilliamson was born on 22 April 1892 as the only son to Edward Williamson, a solicitor in Cardiff, and Florence Frances Tipton.  He was educated at The Cathedral School, Llandaff, Westminster School and Christ Church, Oxford, and was ordained in to the diaconate in 1914 and to the priesthood in 1916.\nWilliamson began his ordained ministry with curacies at  St Martin's, Potternewton, and All Saints', South Lambeth, after which he was a lecturer at St Augustine's College, Canterbury. From 1926 to 1939 he was Warden of St Michael's Theological College, Llandaff, when he was appointed to the episcopate. William served as Examining Chaplain to the Bishop of Llandaff from 1931 to 1939, and was also a canon of Llandaff Cathedral from 1930 to 1937, assuming the office of Canon Chancellor in 1937. On 26 July 1949, as Bishop of Swansea and Brecon, he dedicated the new St Martin's Church, Dunvant, which was possibly the first church to be dedicated in Wales after the Second World War. Williamson died unmarried on 23 September 1953 and was buried in Brecon Cathedral.\nWilliamson was also a noted scholar. In 1929, Williamson published a critical edition of Osbert of Clare's letters. Likewise, in 1930, Williamson published a history of Llandaff Cathedral. In 1948, he published his work, The Church in Wales. Williamson broadcast a Radio Lecture on Henry Vaughan in January 1953 that was subsequently published by the B.B.C in that year.\nWorks\n*Williamson, Edward William (1948), The Church in Wales. Cardiff: S. P. C. K.\n*Williamson, Edward William (1953), Henry Vaughan: Annual Lecture Broadcast in the Welsh Home Service on 8 January 1953. London: British Broadcasting Corporation.\n*Williamson, Edward William (1928), The Letters of Osbert of Clare, Prior of Westminster. Oxford: Oxford University Press.\n*Williamson, Edward William (1930), The Story of Llandaff Cathedral. Gloucester and London: The British Publishing Company Limited.\nReferences"
    }
  ]
}