{
  "content": [
    {
      "type": "text",
      "text": "# Edward Cornell\n\n| birth_place = Hartford, Connecticut\n| death_date         =\n| death_place        = Ticonderoga, New York\n| occupation  = artist, theater director, painter\n| education   = Williams College Yale School of Drama\n| website =\n}}\nEdward Cornell (1944–2025)  was an early associate of Joseph Papp at the New York Shakespeare Festival. He was the first managing director of the Festival's experimental wing, The Other Stage, where he directed No Place to Be Somebody, the Festival's first Pulitzer Prize winner.\nLife\nHe lived his early life in the Boston area. His father was a rocket engineer at the MIT's Charles Stark Draper Laboratory. At Williams College, he studied acting and directing under Keith Fowler, and after graduating he attended Yale Drama School where he met Joseph Papp and came to New York as his assistant at The Public Theater. He later resided in the Adirondack Park where he established a career as a painter and sculptor.\nBibliography\n* ''William Shakespeare's Naked Hamlet, Joseph Papp assisted by Ted Cornell; The McMillan Co., 1969.\n* Free for All: Joe Papp, The Public, and the Greatest Theater Story Every Told,  by Kenneth Turan & Joseph Papp, 2009.\nSee also\n* Joseph Papp\n* New York Shakespeare Festival\n* No Place to Be Somebody\nReferences\n* Little, Stuart W. Enter Joseph Papp: In Search of a New American Theater. New York: Coward, McCann & Geoghagan, Inc., 1974, pp.&nbsp;13, 54, 58, 60, 61, 63, 64, 64, 74, 79, 110–111, 117, 136, 137, 156, 157, 159, 163, 165–166, 200, 201, 213, 242.\n* \"Not Since Edward Albee,\" Walter Kerr, The New York Times, May 18, 1969, Section 2, p.&nbsp;1, ff.\n* \"A Dream Grows in Brooklyn,\" Jack Kroll, Newsweek, March 17, 1980, pp.&nbsp;85, 86\n* Joe Papp, An American Life'', Helen Epstein; Little, Brown and Company, 1994\n* \"A Visit to Crooked Brook, an art farm,\" Lee Manchester, Lake Placid News, January 6, 2006, p 21ff.\n* \"Art Farm Creations, Kim Smith Dedam,\" Plattsburgh Press-Republican, September 7, 2006, C1ff.\n* [http://www.crookedbrookstudios.com/al07.pdf Edward Cornell, the Change Artist], Elizabeth Ward, Adirondack Life, January/February 2007, p.&nbsp;19ff.\n* \"Sculptor Ted Cornell Reinvents Self,\" Brian Mann, North Country Public Radio, Interview, October 25, 2007\n* [http://pressrepublican.com/0500_what_to_do/x1702485984/Acting-coach-asks-Just-who-you-do-you-think-you-are Acting coach asks, 'Just who you do you think you are?'], Plattsburgh Press-Republican, January 12, 2012.\nExternal links\n* [http://www.crookedbrookstudios.com Crooked Brook Studios]\n* The Public Theater: [http://www.publictheater.org/ www.publictheater.org]"
    }
  ]
}