{
  "content": [
    {
      "type": "text",
      "text": "# Edward Backhouse\n\nEdward Backhouse (1808–1879) was a Quaker philanthropist and  writer on church history. He was also one of the founding fathers of the Sunderland Echo newspaper. He was recognised as having the gift of vocal ministry in 1854.\nEarly life\nEdward Backhouse was born in Darlington on 8 May 1808, the son of Mary and Edward Backhouse of Darlington. When Edward senior moved to Sunderland in 1816, his family traveled with him. Edward junior remained in Sunderland until just before his death.\nWorking life\nBackhouse became a partner in the family banking firm of Backhouse & Co, but did not take an active part in the business. Instead, he engaged in many philanthropic activities and the concerns of the Religious Society of Friends (Quakers) from 1854. He travelled in the ministry to France and Norway. In 1862 and 1863, he served as Clerk to the annual national gathering of Quakers known as London Yearly Meeting.\nIn Sunderland, he was active in establishing the Sunderland Indigent Sick Society, the British School in Borough Road, Sunderland, and the old Athenaeum and Reformatories.\nPolitical life\nBackhouse, who held Liberal political views, was a leading supporter of Sunderland Infirmary, and of temperance work. At the time of his death in 1879, he was President of the Sunderland Temperance Society and treasurer of the Bible Society. He was also a prominent opponent of the Contagious Diseases Acts, serving as President of the Northern Counties Association for the Repeal of the Contagious Diseases Acts.\nThe political views of Backhouse were shared by Samuel Storey and other leading local politicians of the day. His political opinions eventually led Backhouse to become one of the original seven founders of the Radical-run Sunderland Echo in 1873.\nPersonal life\nBackhouse married Katherine Mounsey in 1856. The couple had no children. He died in Hastings, where he had gone for his health, on 22 May 1879. The work Backhouse carried out on church history was published posthumously.\nPublications\n*Early Church History to the Death of Constantine, edited and enlarged by Charles Tylor (1884) (Available online ).\n*Witnesses for Christ : and memorials of church life from the fourth to the thirteenth century : a sequel to \"Early church history : in two volumes / by Edward Backhouse and Charles Tylor (1887) (Vol.1 is available online ).\n*The  Religious Society of Friends : the doctrines and practices in which they agree with their fellow-Christians, and those in which they differ / by Edward Backhouse. - London; Sunderland : Kitto : William Henry Hills, (1870) (Available online )\n*Det  religiose Vennernes Samfund : laerdomme og skikke, hvori de ere enige med deres Medkristne, og andre, hvori de ere forskjellige / af Edward Backhouse. - Stavanger : Paul T. Dreyer, (1871) [in Norwegian]\n*Biographical memoirs : being a record of the Christian lives, experiences, and deaths of members of the religious Society of Friends, from its rise, to 1653 / By Edward and Thomas J. Backhouse, and the late Thomas Mounsey. Vol. I. - London : W. & F. G. Cash, (1854) (available online ).\n*Martyr scenes of the sixteenth and seventeenth centuries / designed and drawn by Edward Backhouse and William Bell Scott. - ill.. -  (1888) p.&nbsp;56 p.. - London : Hamilton, Adams & Co.\nReferences"
    }
  ]
}