{
  "content": [
    {
      "type": "text",
      "text": "# Edward Hastings, 1st Baron Hastings of Loughborough\n\nEdward Hastings, 1st Baron Hastings of Loughborough, KG PC (c. 1521 in Loughborough, Leicestershire – 1572) was an English peer, the fourth son of George Hastings, 1st Earl of Huntingdon. He married Joane Harrington, daughter of John Harrington of Bagworth, Leicestershire circa 1544.\nIn 1545–1547 he represented Leicester in Parliament. He was High Sheriff of Leicestershire and High Sheriff of Warwickshire in 1550 and MP for Leicestershire from 1547 to 1553.  He fought with his brother against the French which were between Boulogne and Calais. When Mary I came to the throne in July 1553, he used the fact that he had a commission from his relative, the Duke of Northumberland, to raise 4000 infantrymen from Buckinghamshire for the service of Lady Jane Grey to go over in support of Mary. He was rewarded with the Office of Receiver of the honour of Leicester, a parcel of land in the Duchy of Lancaster and being made soon afterwards a Privy Councillor and Master of the Horse. He was MP for Middlesex from 1553 to 1555.\nHe was so well thought of by King Philip of Spain that he was given a pension of 500 crowns of English money. He went with Lord Paget as an envoy  to the Emperor for the purpose of inviting Cardinal Pole to England and in 1555 was elected one of the Knights Companions of the Order of the Garter. He became Lord Chamberlain of the Household on 25 December 1557 and Baron Hastings of Loughborough on 19 January 1558.\nWhen Mary died, he withdrew from public life and became very melancholy. He was imprisoned for hearing mass in 1561 but released on taking the Oath of Supremacy. He founded the hospital of Stoke Poges, Buckinghamshire in April 1564.\nHe lived at the Manor House in the centre of Loughborough and died in March 1572 at Stoke Poges. In his will, he mentions his natural son Edward, who was to be given the Manor of Michelcreche, Somerset when he came of age. He gave his manor of Bosworth to his nephew Henry Hastings, 3rd Earl of Huntingdon. He does not mention his wife in his will, leading to speculation that they may have been estranged.\nHe was buried in the chapel he had built, called the Hastings chapel which forms part of the Church of St Giles, Stoke Poges.\nReferences\n* [http://www.tudorplace.com.ar/HASTINGS2.htm#Edward%20HASTINGS%20%281%C2%B0%20B.%20Loughborough%29 Biographical details]\nFurther reading\n*J. Nugent Bell, \"The Huntingdon Peerage\"\n*J. Nicholls, \"The History & Antiquities of Leicester\"\n*Cross, Claire, The Puritan Earl, The Life of Henry Hastings, Third Earl of Huntingdon, 1536-1596, New York: St. Martin's Press, 1966."
    }
  ]
}