{
  "content": [
    {
      "type": "text",
      "text": "# Edward Vincent (Wisconsin politician)\n\n| birth_date       =\n| birth_place      = Almond, New York, U.S.\n| death_date       =\n| death_place      = Fayette County, Illinois, U.S.\n| death_cause      = Tuberculosis\n| restingplace     = Farina Cemetery,\n| spouse           =\n|\n}}\n| children         =\n| Lucinda C. (Ledbetter)\n|\n| Henry Vincent\n|\n| with Lydia Maxson\n| Russell Edward Vincent\n|\n| Hattie Mabel (Crow)\n|\n}}\n|profession        = Farmer, lawyer\n}}\nEdward Vincent (June 28, 1820May 13, 1875) was an American farmer, lawyer, Republican politician, and Wisconsin pioneer.  He served two years as a member of the Wisconsin State Assembly, representing Rock&nbsp;County during the 1851 and 1859 terms.\nBiography\nEdward Vincent was born in the town of Almond, New&nbsp;York, in June 1820. He was raised and received his early education there before moving to Alfred, New&nbsp;York, with his family in the 1830s, where he briefly attended the Alfred Academy.  At age 18, he began studying religion under Elder James H. Cochrane.  In 1846, he moved with his father's family to the Wisconsin Territory, settling near what is now Milton, Wisconsin.\nIn 1850, Vincent was elected to the Wisconsin State Assembly, running on the Whig Party ticket.  He served in the 4th Wisconsin Legislature.  In 1854, he was a member of the first organizing meetings of the Republican Party in Rock County.  In 1856, he took up the study of law at a law firm in Janesville, Wisconsin.  He was admitted to the bar in 1859, that same year he served his second term in the Assembly, as a Republican.\nIn 1864, Vincent moved to Farina, Illinois, seeking a warmer climate to soothe his poor health.  He continued practicing law in Illinois, and in 1865 was admitted to practice before the Supreme Court of Illinois.  He had a successful law practice in Fayette County, Illinois, and was active until a few weeks before his death.  He died of tuberculosis on May 13, 1875, at his home in Farina.\nPersonal life and family\nEdward Vincent was the seventh of 15 children born to  and his wife Olive ( Spencer).\nEdward Vincent married twice.  He first married Harriet L. Crandall in 1849; they had three children together before her death in 1868.  After his first wife's death, he married Lydia Maxson in January 1869, with whom he had two more children.\nReferences\n|years= January 6, 1851January 5, 1852 }}\n|years= January 3, 1859January 2, 1860 }}"
    }
  ]
}