{
  "content": [
    {
      "type": "text",
      "text": "# Edward C. Molina\n\n|death_date=\n|nationality=American\n|occupation=Engineer\n|known_for=Contributions to teletraffic engineering\n|awards=Elliott Cresson Medal (1952)\n}}\nEdward Charles Dixon Molina (December 13, 1877 – April 19, 1964) was an American engineer, known for his contributions to teletraffic engineering.\nBiography\nEdward Molina was born on December 13, 1877.\nAfter completing high school, he went to work, and was self-taught in mathematics.  He began working for the Western Electric Company in 1898 at the age of 21 and entered the AT&T research department (later Bell Labs) in 1901.  His invention of relay translators in 1906 resulted in the panel dial systems.  In his studies of telephone traffic, Molina independently rediscovered the Poisson distribution in 1908.  It was briefly named in his honor among American telephone engineers until the prior art was recovered. In 1928 he was an Invited Speaker at the ICM in Bologna. Molina pioneered the use of throwdowns, which in essence were Monte Carlo simulations of telephone traffic to find optimal capacity assignments for trunk lines to central offices (Molina, 1922).\nMolina taught mathematics at the Newark College of Engineering from the time of his retirement in 1944 until his death. He was awarded the Franklin Institute's Elliott Cresson Medal in 1952.  He died on April 19, 1964.\nPublications\n* \"Computation Formula for the Probability of an Event Happening at Least C Times in N Trials\", The American Mathematical Monthly, Vol. 20, No. 6 (Jun., 1913), pp. 190–193. .\n* \"The Theory of Probabilities Applied to Telephone Trunking Problems\", Bell System Technical Journal, 1922, p. 69-81.\n* \"Application of the Theory of Probability to Telephone Trunking\", Bell Labs Technical Journal, No 6, pp.&nbsp;461–495, 1927\n*\"Bayes' Theorem: An Expository Presentation\", Annals of Mathematical Statistics, 2(1):23–37, 1931\n*An expansion for Laplacian integrals in terms of incomplete gamma functions, and some applications (1932)\n*''Poisson's exponential Binominal limit (D. Van Nostrand, Co.Inc., 1943).\n*\"Some Fundamental Curves for the Solution of Sampling Problems\", Annals of Mathematical Statistics, 17(3):325–335, 1946\n*\"Some antecedents of quality control\", in Quality Engineering'' 10(4):693–695, 1998. (Notes for a talk given January 17, 1950.) .\n* A letter in reply to \"Mathematical Allusions in Poe\", The Scientific Monthly, Vol. 64 (1), 1947, p. 89. .\nReferences"
    }
  ]
}