{
  "content": [
    {
      "type": "text",
      "text": "# Edward Carrington\n\n|death_date    =\n|birth_place   = Boston Hill Plantation, Goochland County, Virginia (now Cumberland County, Virginia), British America\n|death_place   = Richmond, Virginia, U.S.\n|allegiance    = United States\n|branch        = Continental Army\n|serviceyears  = 1776–1783\n|rank          = Lieutenant colonel\n|battles       =\n*American Revolutionary War\n**Battle of Monmouth (1778)\n**Battle of Cowpens (1781)\n**Battle of Guilford Court House (1781)\n**Battle of Hobkirk's Hill (1781)\n**Siege of Yorktown (1781)\n|signature     = Lieut. Col. Edward Carrington signature.tiff\n| spouse=Elizabeth Jaquelin Ambler Brent Carrington (1765–1842)\n}}\nEdward Carrington (February 11, 1748 – October 28, 1810) was a lawyer, planter, Continental Army officer and politician from central Virginia. During the American Revolutionary War he became a close friend of George Washington. Although his highest rank was lieutenant colonel of artillery in the Continental Army, Carrington distinguished himself as quartermaster general in General Nathanael Greene’s southern campaign. He commanded artillery at Monmouth and Yorktown. He was also present at Cowpens, Guilford Court House, and Hobkirk's Hill. Carrington also served in the 3rd Continental Congress and several times in the Virginia House of Delegates, and later became the first US Marshal appointed from his state and served a term as mayor of Richmond, Virginia. He was an original member of the Society of the Cincinnati.\nEarly and family life\nCarrington was born on February 11, 1748, on his father's Boston Hill Plantation near the town of Cartersville in future Cumberland County, Virginia. He was the eighth of 11 children of George Carrington and Anne Mayo. His father arrived in Virginia in 1727 from Barbados and married Anne around 1732 when he was 21 and she was 20. He became a wealthy planter, served in the House of Burgesses (1752-1765), the Virginia House of Delegates (1778-1781;1783) and held local offices. Edward's oldest brother Paul Carrington also served in the Virginia General Assembly before becoming an eminent jurist.\nEarly career\nAfter returning from Barbados, where he had collected part of an inheritance on his father's behalf, Carrington read law and in 1773 was admitted to the Virginia bar in Cumberland County. Carrington opened a law practice, and also helped his father (who died in February 1785 as did his wife) manage a plantation which operated at least in part using enslaved labor.\nRevolutionary War\n1775–1777\nIn 1775–76 Carrington became a member of the Goochland County Revolutionary Committee. On December 1, 1775, the state of Virginia established an artillery company. On February 13, 1776,  state authorities appointed James Innes the captain and Charles Harrison, Samuel Denney, and Carrington as lieutenants. The Continental Congress accepted the artillery unit into the Continental Army, on March 19 and requested a second company from Virginia to be formed. Innes soon transferred to the infantry.\nIn late 1776, George Washington ordered his artillery chief Henry Knox to begin organizing three artillery regiments to support the Continental Army. Harrison's Continental Artillery Regiment was authorized on 26 November 1776 and assigned to the Southern Department. The regiment was to expand from the two existing companies to a total of ten companies. Harrison was appointed the regiment's colonel while Carrington became lieutenant colonel and second in command. Each company consisted of four officers, one sergeant, four corporals, four bombardiers, eight gunners, and 48 matrosses. The regiment garrisoned Virginia during 1777.\n1778–1780\nOn March 13, 1778, Harrison's Regiment was transferred to the main army. Carrington performed with distinction in the Battle of Monmouth on June 28. Beginning in the early afternoon and continuing for two hours, 10–14 American field guns dueled with eight British cannons and two howitzers. Carrington's guns were placed on the American left flank under William Alexander, Lord Stirling's command. On August 10, 1779, Harrison's Regiment was renamed the 1st Continental Artillery Regiment. In March 1780, Carrington served with Arthur St. Clair, and Alexander Hamilton as commissioners for a prisoner exchange.\nOn April 17, 1780, the 1st Artillery Regiment was assigned to the Southern Department. Carrington was sent south in command of three artillery companies with Johann de Kalb's forces. Harrison unexpectedly joined De Kalb and assumed command of the gunners when the force reached North Carolina, leaving Carrington unemployed. On July 25, Horatio Gates superseded De Kalb in command and gave Carrington a new assignment. Gates ordered him to investigate the best points to cross the Roanoke River for supplying the American forces and finding the best retreat routes. The American army led by Gates was smashed in the Battle of Camden on August 16, 1780.\nNathanael Greene assumed command of the American southern army on December 3. The new leader ordered Carrington to continue reconnoitering possible routes of withdrawal, an action that historian Mark M. Boatner III wrote would \"prove decisive\". Greene split his army into three parts: 600 led by Daniel Morgan, 1,100 under Isaac Huger at Cheraw, South Carolina, and light troops commanded by \"Light Horse\" Harry Lee. Greene appointed Carrington the quartermaster general. At that time there was no money in the military chest, yet the army was kept supplied. Among his new duties was an examination of the Dan River which is the southern branch of the Roanoke. Lee later wrote a glowing account of Carrington's successful execution of this duty.\n1781–1783\nOne historian wrote that, \"this advance planning enabled Carrington to propose a course of action that probably saved the Southern army\". On January 17, 1781, in the Battle of Cowpens, an 1,100-man American force under Morgan fought an equal-sized British force led by Banastre Tarleton. The Americans inflicted losses of 100 killed, 229 wounded, and 600 captured on Tarleton's forces while suffering 12 killed and 60 wounded. Carrington was present at the battle. Sending his column of prisoners to Virginia, Morgan quickly left the battlefield and raced to join Greene's forces. Greene realized that Lord Charles Cornwallis would soon be after Morgan with the main British army. He decided to retreat toward Virginia in the hope that Cornwallis would follow. Greene ordered Carrington to assemble boats on the Dan River and instructed his separate columns under Morgan, Lee, and Huger to head north for a rendezvous.\nOn February 1, 1781, Tarleton's cavalry crossed the Catawba River and defeated the North Carolina militia in actions at Cowan's Ford and Torrence's Tavern. On February 2, Morgan found boats waiting for him at Trading Ford on the Yadkin River; that night his troops crossed. On February 7, Morgan, Huger, and Lee rendezvoused at Guilford Court House, North Carolina. At this time, both Greene and Cornwallis were roughly the same distance from Dix's Ferry on the Dan River. Carrington recommended that the American army cross the Dan  downstream at Irwin's Ferry and  farther at Boyd's Ferry. The proposal was adopted and Carrington arranged to move the boats to the downstream crossings. A 700-man rearguard was organized to hold off Cornwallis. Since Morgan insisted on leaving the army on account of his health, Otho Williams assumed command of the rearguard.\nOn February 10, Greene's army left Guilford Court House and marched toward the two crossings suggested by Carrington,  to the northeast. For two days, Williams succeeded in blocking Cornwallis from finding out the true direction of Greene's retreat. By the morning of February 13, Tarleton had determined Greene's real line of retreat. Sending his vanguard on the same road to deceive the Americans, Cornwallis suddenly shifted his main body to a road farther east. Carrington's boats were now all at Irwin's and Boyd's ferries, so he took command of the cavalry detachment watching the British vanguard. Carrington noted that the vanguard had slowed down and this, combined with other intelligence, confirmed Cornwallis' change of direction. Both armies raced along with hardly a rest, the Americans trying to reach Boyd's Ferry and hold back their foes while the British tried to overrun them. At noon on February 14, Williams received a welcome message from Greene that the American main body had crossed the Dan and was safely on the north bank. At 9 pm, the last American cavalrymen crossed the Dan at Boyd's Ferry with Lee and Carrington in the last boat. Blocked by high water and lacking boats, Cornwallis pulled back to Hillsborough, North Carolina.\nCarrington was present at the Battle of Guilford Court House a few weeks later. On April 19, Greene's army approached the British force under Lord Francis Rawdon at Camden, South Carolina. Deciding that Rawdon's defenses were too strong, Greene took up a position on Hobkirk's Hill to the north of Camden. On 22 April, Greene shifted his position and sent his cannons  north to a secure location. When Greene returned to Hobkirk's Hill on 24 April, Rawdon received intelligence that the Americans were without artillery and low on food. On the morning of April 25, 1781, Carrington arrived in the American camp with the artillery and provisions. That day, Rawdon advanced and defeated the Americans at the Battle of Hobkirk's Hill, but during its early stages he was unpleasantly surprised when Harrison's three 6-pound cannons suddenly opened fire.\nIn July 1781, Greene granted Carrington leave to try to fill the vacancy in the 4th Continental Artillery Regiment after Thomas Proctor resigned in April. Greene filled the quartermaster general position with a deputy in case Carrington returned. During the Siege of Yorktown, Carrington, Ebenezer Stevens, and John Lamb rotated responsibility as Henry Knox's chief assistant. It is not clear if Carrington exercised direct command over Whitehead Coleman's company of the 1st Artillery or the three companies of the 4th Artillery present at Yorktown. Since he never received promotion, Carrington resumed his post as quartermaster general under Greene in the summer of 1782 and served in that capacity until the end of the war.\nPostwar career\nFollowing the conflict, Carrington returned to Cumberland County, where voters elected and re-elected him to one year terms as one of their (part-time) representatives in the Virginia House of Delegates.  Virginia legislators thrice sent Carrington as one of their five delegates to the Continental Congress from 1786 to 1788. However, when Carrington was in New York, Powhatan County voters elected him as one of their representatives. Patrick Henry and his local allies objected to Carrington serving in both legislatures, and he missed one summer Virginia session while attending the Continental Congress in New York, but Powhatan voters re-elected him nonetheless.  Carrington also sought to become a delegate to the Virginia Ratifying Convention of 1788, but lost to antifederalist allies of Henry, and he also made an unsuccessful campaign to be presidential elector in 1789, so he didn't run for Congress.\nCarrington also became a charter member of Virginia's Society of the Cincinnati, and first served as its treasurer on October 9, 1783. During the war, Carrington became a friend and confidant of George Washington, and later advised his former commander about appointments and Virginia politics.  He visited Washington at Mount Vernon several times during his travels in this period. Carrington also ran for Virginia's 9th congressional district in 1788, losing to Theodorick Bland.\nAfter being elected president, Washington appointed Carrington as the first U.S. Marshal for Virginia, a position he held from 1789 until March 1791, which included administering the first federal census in his native state. Carrington then held the lucrative office of supervising federal excise tax collection in Virginia (1791 to 1794), which also involved collecting controversial whiskey taxes in the state. Although his friend Alexander Hamilton considered appointing Carrington as comptroller of the Treasury department, no formal offer came.  Carrington supported Hamilton's financial program, including chartering a national bank. With (future Supreme Court justice) John Marshall, Carrington organized a public meeting in Richmond on August 17, 1793 to condemn the newly appointed French ambassador Edmond Charles Edouard Genet, and to defend Washington's proclamation of neutrality in the conflict between France and Britain.  During his second term, President Washington offered Carrington the posts of Attorney General and Secretary of War, which were declined. In 1795, Carrington declined Presidential invitations to serve as one of the commissioners supervising construction of public buildings in Washington, D.C. and later as quartermaster general of the United States Army.\nIn 1797, Washington wrote to Carrington stating that he had just met with John Marshall, who approved of an improved threshing machine by a Mr. Booker. Washington asked that Carrington forward another letter to Booker. In 1798, President John Adams selected Carrington to be the quartermaster general for the United States Army during the Quasi-War with France, but the position was never filled and was eliminated when normal relations were restored. In 1807, Carrington was foreman of the jury during Aaron Burr's treason trial. His brother-in-law John Marshall was the presiding judge and Burr was acquitted.\nPersonal life\nIn 1792, Edward married the widow Elizabeth Jaquelin Ambler Brent Carrington (1765–1842), but the couple had no children. Her first husband William Brent died. She co-founded the Female Humane Association around 1805 to aid homeless girls and young women, it is now known as the Memorial Foundation for Children. After moving to Richmond, Carrington became one of its leading citizens. He joined the Henrico Parish vestry in 1797 and in 1803 was a founding trustee of the Richmond Academy.\nDeath and legacy\nCarrington died on October 28, 1810, at his home in Richmond. The city council sponsored a massive funeral, with many federal, state and local officials. Per his wishes, Carrington is buried just outside a window at St. John's Church, where in 1775 he, his brother Paul and friends listened to Patrick Henry's famous \"Give me liberty or give me death!\" speech, during which Carrington turned to them and whispered, \"Boys, bury me here, in this very spot!\"\nSee also\n*\n*\nNotes\nReferences\n*\n*\n*\n*\n*\n*\n*\n*"
    }
  ]
}