{
  "content": [
    {
      "type": "text",
      "text": "# Edward De Peyster Livingston\n\n| birth_place    = New York City, New York, U.S.\n| death_date     =\n| death_place    = New York City, New York, U.S.\n| alma_mater     = Columbia UniversityColumbia Law School\n| parents        = Robert Edward LivingstonSusan Maria Clarkson De Peyster Livingston\n| spouse         =\n| children       =\n| relations      = Goodhue Livingston (brother)\n}}\nEdward De Peyster Livingston (March 6, 1861 – January 19, 1932) was an American lawyer and society leader during the Gilded Age.\nEarly life\nLivingston was born in New York City on March 6, 1861.  He was the second son of four children born to Robert Edward Livingston (1820–1889) and Susan Maria Clarkson (née De Peyster) Livingston (1823–1910).  His siblings included Catherine Goodhue Livingston, Robert Reginald Livingston, who married Mary Tailer, and Goodhue Livingston, an architect with Trowbridge & Livingston who designed the Hayden Planetarium.\nHis paternal grandparents were Edward Philip Livingston, the New York State Senator and 11th Lt. Gov. of New York who was master of Clermont Manor, and Elizabeth Stevens Livingston, the eldest daughter of Chancellor Robert R. Livingston.  His maternal grandparents were James Ferguson De Peyster and Susan Maria (née Clarkson) De Peyster, who died in 1823 shortly after his mother's birth.  His uncle was Gen. Frederic James de Peyster.  His maternal grandmother was the daughter of Gen. Matthew Clarkson and sister of Mary Rutherfurd Clarkson, the wife of Peter Augustus Jay.\nLivingston graduated from Columbia University in 1882, and Columbia Law School in 1884.\nCareer\nAfter graduating from law school, where he was a member of Delta Psi, Livingston practiced law at 156 Broadway in New York.\nSociety life\nIn 1892, Livingston was included in Ward McAllister's \"Four Hundred\", purported to be an index of New York's best families, published in The New York Times. Conveniently, 400 was the number of people that could fit into Mrs. Astor's ballroom.  From 1896 until 1917, Livingston was a vestryman of St. Paul's Church in Tivoli, New York.  He was a member of the Union Club of the City of New York, the Calumet Club, the Tuxedo Club, the St. Anthony Club, the St. Nicholas Society, and the Society of Colonial Wars.\nPersonal life\nLivingston, who did not marry, lived at his father's Hudson River estate, \"Northwood\" in Clermont, New York, and in New York City at 271 Fifth Avenue, the former home of his mother, which he shared with his unmarried sister Catherine.  He died at his home in New York on January 19, 1932.\nReferences"
    }
  ]
}