{
  "content": [
    {
      "type": "text",
      "text": "# Edward Holland (mayor)\n\n| death_place         = New York City, New York\n| resting_place       = Trinity Church Cemetery\n| residence           =\n| alma_mater          =\n| party               =\n| profession          = Merchant\n| parents             =\n| spouse              =\n*\n}}\n| children            =\n| relations           =\n}}\nEdward Holland (baptized September 6, 1702 – November 10, 1756) was the first English Mayor of Albany, New York, from 1733 to 1740.  He was the 40th Mayor of New York City from 1747 to 1756, becoming the only man to serve as mayor of both Albany and New York City.\nEarly life\nHolland was born in 1702 in Albany, New York.  He was the son of English-born Henry Holland (1661–1736) and Irish-born Jenny (née Seeley) Edwards (1676–1756). His father was a commissioned officer of the garrison company in Albany.  Over thirty years, he became a lieutenant, captain, and then Commander of the Albany fort. His mother was a widow who met his father when he was stationed in Ireland and the two them married and emigrated to the American Colonies.\nHis brother was Henry Holland Jr. (b. 1704) who received royal appointments as Justice of the Peace, Master of the Chancery Court, and Sheriff of Albany County, and who married Alida Beekman (b. 1702), daughter of Johannes Martense Beekman.\nCareer\nDuring his youth, Holland was a part-time soldier at a time of peace on the northern frontier and, therefore, focused on his father's business, running errands between the frontier outposts and down the Hudson River to New York City.\nFrom 1728 to 1733, he served as an Alderman of Albany and was known as an active member of the Commissioners of Indian Affairs.  In 1733, he was appointed the first English Mayor of Albany, and presiding over the city until 1741.  During his long tenure as mayor, he negotiated a deed with the Indians for the tract of land at the junction of the Mohawk River and the Schoharie Creek that was included in the 1686 Albany City Charter but was not yet incorporated.\nBy the mid-1740s, Holland moved to Manhattan where he owned several ships, becoming quite prosperous and prominent.  In 1747, he was appointed the 40th Mayor of New York City, serving 1747 until his death in 1756.  In 1748, he was named to Gov. George Clinton's Advisory Council and was appointed to the Provincial Chancery Court, serving from 1748 to 1750.\nPersonal life\nOn June 24, 1726, he married Magdalena Bayeux (1706–1737), the daughter of Thomas and Magdalene (née Boudinot) Bayeux, a prominent business family.  Magdalena's older sister, Susanna Bayeux (1704–1747), married Jeremias Schuyler (b. 1698), son of Pieter Schuyler, the first mayor of Albany.  They had several children, four of whom survived to maturity, including:\n* Mary Magdalen Holland, who married Benjamin Nicolls Jr. (1718–1760), a Yale lawyer who became an incorporator, trustee, and governor of Kings College in New York.  Nicolls was a grandson of William Nicoll and, therefore, a nephew of his mother-in-law, Frances Nicoll Holland. He was the son of Benjamin and Charity Floly Nicoll, who after her husband's death, married the Rev. Dr. Samuel Johnson, President of King's College.\nIn 1739, two years after the death of his first wife, Holland was married to Frances Nicoll (1704–1787), the daughter of William Nicoll and Anna (née Van Rensselaer) Nicoll.  Her father was Speaker of the New York General Assembly from 1702 to 1718, her maternal grandfather was Col. Jeremias van Rensselaer and her paternal grandfather was Matthias Nicoll, the 6th Mayor of New York City.\nHolland died on November 10, 1756, in New York City, New York.  He was buried at Trinity Church Cemetery.  After his death, his widow moved to her brother Rensselaer Nicoll's house in Bethlehem, New York. A street in the Bronx is named in his honor (Holland Avenue).\nReferences\nExternal links\n* [https://exhibitions.nysm.nysed.gov/albany/bios/h/edholland.html Edward Holland] at the New York State Museum"
    }
  ]
}