{
  "content": [
    {
      "type": "text",
      "text": "# Edward Grey Institute of Field Ornithology__disambig_1\n\n, after whom the Edward Grey Institute is named]]\nThe Edward Grey Institute of Field Ornithology (EGI), at Oxford University in England, is an academic body that conducts research in ornithology and the general field of evolutionary ecology and conservation biology, with an emphasis on understanding organisms in natural environments. It is named in honour of Edward Grey, 1st Viscount Grey of Fallodon, a notable politician and ornithologist, and is part of the Department of Zoology at Oxford University.\nThe Institute houses the Alexander Library, the best ornithological library in Europe and one of the best in the world, which is named after W. B. Alexander.\nHistory\nThe Edward Grey Institute (EGI) was founded in 1938, having grown out of the Oxford Bird Census, itself founded in 1927. It was the brainchild of Max Nicholson, Bernard Tucker, and Wilfred ('W. B.') Alexander, and was initially founded to promote the economic study of ornithology. It took its name from Viscount Grey, at one time Chancellor of the University and UK Foreign Secretary, and a lifelong birdwatcher, perhaps best known as the man who remarked, on the eve of the First World War: \"The lamps are going out all over Europe; we shall not see them lit again in our lifetime.\"\nThe first Director of the fledgling Institute was W. B. Alexander, remembered in the name of the EGI's library, the Alexander Library. Alexander was succeeded in 1945 by former school-teacher David Lack, one of the pioneers of population biology, who had already published The Life of the Robin. Lack served as Director until his death in 1973, working with field assistants such as Denis Owen, and oversaw the growth of the EGI into an internationally known centre for research into population biology of birds.\nLack was succeeded by Chris Perrins in 1974, who continued as Director until his official retirement in 2002. During this time, work in the EGI expanded from the field of population biology to encompass the new field of behavioural ecology, with John Krebs and Nick Davies (then at Oxford, later Professor of Behavioural Ecology at Cambridge) co-authoring the textbooks that defined the field. The EGI was also the centre for work on The Birds of the Western Palearctic, up to its completion in 1990s, and became increasingly important as a training centre for ornithologists who went on to play important roles in conservation.\nFollowing Perrins' retirement, a major endowment in honour of Dr Luc Hoffmann's eightieth birthday led to the establishment of the Luc Hoffmann Chair in Field Ornithology. Ben Sheldon was elected as the first holder of this chair, and as Director of the EGI in 2004.\nBy the end of 2006, a total of 165 DPhil students had successfully defended their theses based on work carried out at the EGI; this number is at least matched by the number of postdoctoral and other research visitors who have spent time at the Institute. Scientific research work on birds has been conducted on all continents and the major research themes of the EGI, population and evolutionary ecology of birds have been supplemented by a very wide range of research activities.\nNotable staff\n* John Parslow\n* Chris Perrins\n* Ben Sheldon\n* David Lack\n* Nicholas Davies\n* John Krebs\nSee also\n* Department of Zoology, University of Oxford\nReferences\nExternal links\n* [https://egioxford.web.ox.ac.uk/ EGI website]"
    }
  ]
}