{
  "content": [
    {
      "type": "text",
      "text": "# Edward Brinton\n\n|birth_place       = Richmond, Indiana, U.S.\n|death_date        =\n|death_place       = Coeur d'Alene, Idaho\n|field             =\n|work_institutions = Scripps Institution of Oceanography  University of California, San Diego\n|alma_mater        = Haverford College  University of California\n|doctoral_advisor  =\n|doctoral_students =\n|known_for         =\n|prizes            =\n|signature         =\n|footnotes         =\n}}\nEdward Brinton (January 12, 1924 &ndash; January 13, 2010) was a professor of oceanography and research biologist.  His particular area of expertise was Euphausiids or krill, small shrimp-like creatures found in all the oceans of the world.\nEarly life\nBrinton was born on January 12, 1924, in Richmond, Indiana to a Quaker couple, Howard Brinton and Anna Shipley Cox Brinton.  Much of his childhood was spent on the grounds of Mills College where his mother was Dean of Faculty and his father was a professor.  The family later moved to the Pendle Hill Quaker Center for Study and Contemplation, in Pennsylvania where his father and mother became directors.\nAcademic career\nBrinton attended High School at Westtown School in Chester County, Pennsylvania.  He studied at Haverford College and graduated in 1949 with a bachelor's degree in biology. He enrolled at Scripps Institution of Oceanography as a graduate student in 1950 and was awarded a Ph.D. in 1957.  He continued on as a research biologist in the Marine Life Research Group, part of the CalCOFI program. He soon turned his dissertation into a major publication, The Distribution of Pacific Euphausiids. In this large monograph, he laid out the major biogeographic provinces of the Pacific (and part of the Atlantic), large-scale patterns of pelagic diversity and one of the most rational hypotheses for the mechanism of sympatric, oceanic speciation. In all of these studies the role of physical oceanography and circulation played a prominent part. His work has since been validated by others and continues, to this day, to form the basis for our attempts to understand large-scale pelagic ecology and the role of physics of the movement of water in the regulation of pelagic ecosystems. In addition to these studies he has led in the studies of how climatic variations have led to the large variations in the California Current, and its populations and communities. He has described several new species and, in collaboration with Margaret Knight, worked out the complicated life histories of many Euphausiid species. He received a formal tribute from the international GLOBEC program in 2009. He served as a major adviser and scientist for the State Department-sponsored Naga expeditions in the Gulf of Thailand and, later, as the curator of the UNESCO-sponsored Indian Ocean Biological Center in Cochin, India.  He taught numerous students in both venues. His Academic career continued at Scripps until his retirement in the 1991.\nFamily life\nBrinton met and married Desiree Ward in 1948.  He had four children and was widowed in 1976.  He remained unmarried until the time of his death.  His primary residence was in La Jolla, California. He and his family lived in Bangkok, Thailand for a year in 1960, and in Kerala, India from 1965 to 1967.  He died after a long illness on January 13, 2010.\nPublications\n*Brinton, Edward. The distribution of Pacific Euphausiids. Bulletin of the Scripps Institution of Oceanography, vol 8, number 2,1962.\n*Brinton, Edward. Variable Factors affecting the Apparent Range and Estimated Concentration of Euphausiids in the North Pacific. Pacific Science 16, no. 4 (October 1962): 374–408.\n*Brinton, Edward: Euphausiids of Southeast Asian waters. Naga Report volume 4, part 5. La Jolla: University of California, Scripps Institution of Oceanography, 1975.\n*Brinton Edward: The oceanographic structure of the eastern Scotia Sea—III. Distributions of euphausiid species and their developmental stages in 1981 in relation to hydrography. Deep-Sea Research 1985;32:1153–1180.\nReferences\nExternal links\n* [http://www.photoliaison.com/Images/Imogen_Cunningham_Album/pages/Brinton%20Family,%201930s_jpg.htm Portrait of the Brinton family in the 1930s] by Imogen Cunningham, photographer. (Edward at the far left)\n* [http://web.pml.ac.uk/globec/products/OSM3/presentations/WD/WD_Tuesday%201600_discussion.pdf Recent GLOBEC Tribute-summer 2009]\n* [https://oceaninformatics.ucsd.edu/euphausiid/secure/login.php Brinton and Townsend Euphausiid Database]\n* [http://ceo.ucsd.edu/expeditions/transpac/index.html Transpac Expedition]\n* [http://ceo.ucsd.edu/expeditions/downwind/index.html Downwind Expedition]"
    }
  ]
}