{
  "content": [
    {
      "type": "text",
      "text": "# Edward W. Serrell\n\n| birth_place   = London, England\n| death_date    =\n| death_place  = New York, New York, US\n| nationality   = American\n| occupation    = Civil engineer\n| spouse        =\n*\n}}\n| children      = 4\n| signature     = Signature of Edward Wellman Serrell (1826–1906).png\n}}\nEdward Wellman Serrell (November 5, 1826 – April 25, 1906) was an American civil engineer during the mid 19th century. In 1861, during the American Civil War he helped raise a regiment of engineers from New York state, the 1st New York Volunteer Engineer Regiment for the Union Army, and was appointed colonel of the regiment. Later he was brevetted brigadier general. One of his more notable achievements during the war was his work on the \"Marsh Battery\" during the Second Battle of Charleston Harbor.\nEarly life\nSerrell was born in London, England, on November 5, 1826.  He was the tenth of eleven children of William and Ann Serrell.  The family immigrated to New York in 1831, and as a result, Edward received his early education in the schools of New York City. He later took up civil engineering under the direction of his father and an older brother.  On April 6, 1848, he married Jane Pound, an English girl two years his senior.  They had four children.\nCareer\nFrom 1845 up to the time of the Civil War, Serrell was engaged in railroad and bridge design and construction. He was, successively, assistant engineer to the commissioners of the Erie Railroad, and assistant to the chief of the US Army Corps of Topographical Engineers. He was the assistant engineer of the 1848 Panama Survey, where he located the route of the railroad between Aspinwall and Panama. He later had charge of the surveys for the Northern Railroad of New Hampshire, and was for a time the engineer of the Central Railroad of New Jersey. He prepared plans and supervised the construction of the suspension bridge across the Niagara River at Lewiston in 1850; superintended the construction of the bridge at Saint John, New Brunswick; and planned the bridge over the St. Lawrence River at Quebec.  He was later concerned with the building of the Hoosac Tunnel (1858), the Bristol Bridge over the Avon River in England, which had one of the longest spans in that country at that time, and the Union Pacific Railroad.\nDuring the Civil War, Colonel Serrell was in 126 actions.  He was the chief engineer of the Department of the South until the 10th Corps moved to the Army of the James.  He was the chief engineer of the 10th Corps and the Army of the James, and became chief of staff for that army, being brevetted a brigadier general.  He contributed many useful inventions including long wire, armor plates, impromptu gun carriages, and iron viaducts.  After the war, he published many reports on railroads and canals, was a consulting engineer to many corporations, was president of the Washington County Railroad, projected an interocean canal from San Blas to Pearl Island Harbor, and was the consulting engineer to the American Isthmus Ship Canal Company. He was listed as an honorary pallbearer at the funeral of Ulysses S. Grant. He even sketched his idea for a flying machine.\nIn 1879, during the construction of the Brooklyn Bridge, Serrell was called upon as civil engineer to examine the plans and sections of the east river bridge, a new bridge from Brooklyn to New York City. He testified to the Assembly Sub-Committee on Commerce and Navigation, that the calculations of the assumed strength of the bridge were not accurate; and the effect of gales or wind would have upon the structure and upon foot passengers.\nOne daughter, Josephine, married Robert Powell Page Wainwright, a career U.S. Army cavalry officer.  Together they had three children including Jonathan Mayhew Wainwright IV of World War II fame and the namesake of Fort Wainwright in Alaska. Another daughter, Harriette, married Clarence Deems, an 1874 West Point graduate, in 1876 at General Serrell's home near the Academy. She died in 1885, but their son, Clarence, Jr. graduated from West Point in 1900.\nHis wife, Jane, died on August 29, 1896. They had four children, Edward William, Josephine Eva, Jesse Pound, and Harriette Marshall Serrell.  Serrell married a longtime family friend, Marion Seaton Roorbach, on September 3, 1900.  The New York Times reported at the time that he was \"Lying on a sick bed, from which he may never arise\", ill from an attack of gastritis, \"too weak even to sit up.\" He did recover sufficiently to be moved to his wife's home on Staten Island. She died in 1904.\nDeath\nSerrell died in Manhattan on April 25, 1906. He is buried at the Saint Luke's Cemetery in Rossville, New York.\nReferences\nExternal links\n* [https://airandspace.si.edu/collection-archive/edward-wellman-serrell-aeronautical-papers/sova-nasm-2011-0040 Edward Wellman Serrell Aeronautical Papers]\n*"
    }
  ]
}