{
  "content": [
    {
      "type": "text",
      "text": "# Edward Bayntun\n\nSir Edward Bayntun (c.148027 November? 1544), of Bromham, Wiltshire, was a gentleman at the court of Henry VIII of England. He was vice-chamberlain to Anne Boleyn, the King's second wife, and was the brother-in-law of Queen Katherine Howard, Henry VIII's fifth wife.\nEarly life\nEdward Bayntun was born around 1480, a son of Sir John Bayntun of Bromham. Some medieval and Tudor accounts record the name as \"Baynton\", though the spelling around the Tudor period was often \"Bayntun\". In 1516, Bayntun inherited the manors of Bromham and Faulston (Bishopstone, near Salisbury) after the death of his father. Faulstone manor had been owned from 1328 by an ancestor named Thomas Benton, but lost in 1475 after Sir Robert Bayntun supported Henry VI at the Battle of Tewkesbury, then regained by his son John (Sir Edward's father) in 1503.\nCareer at court\nEdward was a soldier and a courtier, and would be a favourite of Henry VIII, as well as a champion of religious reform. Though it is uncertain as to whether or not Katherine of Aragon had a vice-chamberlain, the two were said to be friends, and Edward was said to have visited her house often. She had the archway to Bromham House reconstructed as a gift to Sir Edward. \"It bears the royal arms of the Tudors beneath the oriel window in the upper storey, and in the spandrels of the arch forming the gateway, those of Sir Edward Bayntun, the original builder and his first wife Elizabeth Sulliard, the daughter of Sir John Sulliard, Lord Chief Justice of the Common Pleas. Today this landmark is known to locals as Spye Arch.\"\nThe King granted Sir Edward large tracts of land, making him one of the largest landowners in Wiltshire. Among these were many stewardships, including the stewardship of Salisbury for which Cardinal Wolsey recommended him.\nIn 1522, he was named Sheriff of Wiltshire and knighted. He was Member of Parliament for Wiltshire in 1529, and again in 1539; and in 1542 for Wilton.\nIn 1532, he was named Justice of the Peace for Wiltshire. In 1533, he became vice-chamberlain to Queen Anne Boleyn. He retained the position of vice-chamberlain to Henry VIII's queens for the rest of his life. In June 1535, the King and Queen went on progress through Gloucestershire and Wiltshire and visited houses of nobles engaged in religious reform; they visited Bromham House from 27 August to 3 September.\nWhen Queen Anne's downfall began, Sir Edward was trusted with obtaining confessions from the men accused of having relations with her, one of them being Mark Smeaton. Edward stated \"Only the wretched Mark Smeaton would confess against the Queen, although I have no doubt the others were as fully culpable as ever was he. It would in my foolish conceit, much touch the King's honour if it should no further appear\". In a letter to Thomas Cromwell in 1536, the Princess Mary recommended that Sir Edward's aunt be rewarded for her service to the King.\nWhen Henry VIII married Jane Seymour on 30 June 1536, Edward was in attendance and served as Master of the Queen's Horses. Sir Edward and his wife, Dame Isabel, were also present for the christening of the future Edward VI on 15 October. Queen Jane died on the 24th, and Dame Isabel was one of the twenty-nine women who walked in succession to mark each year of her life. For a short time afterward, Sir Edward and Dame Isabel served as guardians to Mary and Elizabeth I, though the exact amount of time is not known. They played an important role in all three of the royal children's households.\nBaynton was reinstated to his post as vice-chamberlain when he was named to serve the next royal consort in time for the arrival of the suite of Anne of Cleves, Henry VIII's next wife. Anne's household was ready and waiting for her upon her arrival at Greenwich. Sir Edward continued to serve in this office to Queen Katherine Howard, who was the half-sister to his own wife, Dame Isabel. Through her close blood tie to Katherine, Dame Isabel became one of Katherine Howard's Ladies of the Privy Chamber upon her marriage to Henry VIII.\nAfter the execution of Thomas Cromwell, Baynton was given some of his clothes. When Queen Katherine was banished from court in 1541, Isabel was one of the four ladies-in-waiting she was allowed to take with her. An inventory made of the queen's jewels following her arrest noted that as queen, Katherine had given a \"girdle of gold\" to the Lady Bayntun.\nSir Edward and Dame Isabel were present upon the marriage of Queen Katherine Parr to Henry VIII, and Edward was again vice-chamberlain to the new queen.\nWar with France and death\nWhile Sir Edward was vice-chamberlain to the Queen and a courtier, he was also a soldier and served his King during war. He was listed with the English army in Flanders on 7 July 1543, in charge of ten horsemen and 100 footsoldiers. During the second siege the following year, Sir Edward was present with ninety-four horsemen. In October 1544, he was in charge of the transportation of the King's army, with Sir George Carew and a Mr. Harper. They reported that there were 700 ill soldiers who needed transport.\nSir Edward is reported to have died on 27 November 1544 from wounds he may have sustained in battle. His son Andrew was his heir, but property was also left to his younger sons Edward and Henry. Sir Edward wished to be buried at his parish church in Bromham, but his body was never returned from France.\nAfter Sir Edward's death, Henry VIII created a commission to inquire after revenues belonging to chantries, colleges, guilds, and fraternities, and the yearly amount of £6 – 2s – 4d was granted to Dame Isabel as widow of Sir Edward.\nFamily\nBefore 1505, Sir Edward married Elizabeth Sulyard, daughter of Sir John Sulyard, of Wetherden, Suffolk. They had seven children:\n*Bridget Bayntun (1505–1545), married James Stumpe of Malmesbury, and had issue.\n*Andrew Bayntun (1515–1564), married first, Philippa Brulet, and secondly Frances Lee, and had issue.\n*Edward Bayntun (1517–1593), married Agnes Ap Rhys, and had issue.\n*Henry Bayntun (c. 1520), married Dorothy Mantell, and had issue.\n*Anne Bayntun\n*Jane Bayntun (1523–1549), married Sir William St Loe, of Chew Magna, Somerset, who later married as his third wife, Bess of Hardwick. Dame Jane and Sir William had issue.\n*Ursula Bayntun.\nBayntun married Isabel Leigh (born c.&nbsp;1495/7), the daughter of Joyce Culpepper and thus the half-sister of Katherine Howard on 18 January 1531. They had three children.\n*Henry Bayntun (b. c. 1536), married Anne Cavendish, whose father, Sir William, was the ancestor of the Cavendish Dukes of Devonshire through his marriage to Bess of Hardwick. Henry and Anne had four sons. Their fourth son, Ferdinand, born in 1566, married Jane Weare. They had a daughter, Anne Baynton, born in 1602, who married Christopher Batt, gentleman, of Wiltshire. They emigrated to Massachusetts in 1638, where he became a prominent merchant in Boston; they had many New England descendants.\n*Francis Bayntun (b. 1537)\n*Anne Bayntun (d. young)\nBefore Dame Isabel and Sir Edward's marriage, a settlement was created that stipulated that if Sir Edward should die before his wife, Dame Isabel would inherit a number of properties, including the manor at Week.\nAssessment\nBayntun is described by historian Eric Ives as someone who \"shared some of Anne's religious opinions, but he was essentially a career courtier, serving as vice-chamberlain to all Henry VIII's later wives\".\nT. F. T. Baker in The History of Parliament writes: \"... it was Sir Edward who so raised his family above its neighbours that in Wiltshire for a century after the Reformation Bayntons ranked, with Hungerfords and Thynnes, below only the Seymours and the Herberts\".\nReferences"
    }
  ]
}