{
  "content": [
    {
      "type": "text",
      "text": "# Edward Harney\n\n| birth_place = Dublin, Ireland\n| death_date =\n| death_place = South Shields, England\n| nationality = British\n| spouse =\n| party = Free Trade (Australia)Liberal (UK)\n| relations =\n| children = 1\n| residence =\n| alma_mater =\n| occupation = Barrister\n| profession =\n| religion =\n| signature =\n| website =\n| footnotes =\n}}\nEdward Augustine St Aubyn Harney (31 August 1865 – 17 May 1929) was an Irish lawyer who sat in both the Australian Senate and the British House of Commons. He had the distinction of being called to the Bar in Ireland, Australia and England.\nPrivate life and the law\nHarney, a Roman Catholic, was born in Dublin, the fifth son of Richard Harney JP whose family home was County Waterford. He was educated at Castleknock College. He was called to the Irish Bar in 1892. Soon after he emigrated to Australia and was called to the Bar there in 1897. In 1905 he was made a King's Counsel (KC) in Australia. He returned to England and was then called to the Bar by Gray's Inn in 1906, taking silk (that is becoming a KC in England) in 1920. In 1898 he married Clarissa Crewdson Benington, the daughter of a medical doctor from Newcastle upon Tyne. This marriage was dissolved in 1923 and Harney was remarried in 1927 to Kathleen Anderson from South Shields.  They had a son, Desmond, who was born on 14 February 1929, just before his father's death. He went on to join the Diplomatic Service and was a Conservative councillor in Chelsea.\nPolitics\nIn 1901 he was elected a member of the first Senate of Australia from Western Australia as a Free Trader sitting until the expiration of the three-year term to which he had been elected.\nHarney stood as the Liberal Party candidate at the 1922 general election in South Shields.  The sitting MP was Havelock Wilson who had had a chequered political career having been elected as an Independent Labour candidate and then aligning himself with the Lib-Labs before becoming a founder member of the National Democratic Party and later getting back into Parliament in 1918 as a Coalition Liberal – that is a supporter of the Liberal-Conservative coalition government led by David Lloyd George. In a three cornered contest with Havelock Wilson standing as a National Liberal and a Labour candidate, Harney scraped home by just 25 votes over Labour with Havelock Wilson bottom of the poll.\nIn the general election of 1923 and again in 1924, Harney held his seat, this time in straight fights with Labour but with majorities of 7,195 and 6,319. Harney died just before the 1929 general election so no by-election was needed but this time Labour candidate James Chuter Ede gained the seat.\nReferences\nExternal links\n*"
    }
  ]
}