{
  "content": [
    {
      "type": "text",
      "text": "# Edward Youde\n\n| birth_place         = Penarth, Wales\n| death_date          =\n| death_place         = British Embassy, Beijing, China\n| resting_place       = Canterbury Cathedral, England\n| spouse              =\n| children            = 2\n| profession          = Diplomat, sinologist, colonial administrator\n| alma_mater          = University of London\n| branch              = Royal Naval Reserve\n| unit                = Reserves\n| serviceyears        =\n| module              =\n}}\nA uniform of Sir Edward Youde\nSir Edward Youde  (; Cantonese: Yau Tak; 19 June 1924 – 5 December 1986) was a British administrator, diplomat, and Sinologist. He served as Governor of Hong Kong from 20 May 1982 until his death on 5 December 1986.\nEarly years\nYoude was born in Penarth, South Wales, in the United Kingdom and from 1942 attended the University of London's School of Oriental and African Studies. He also served in the Royal Naval Reserve.\nCareer\nIn 1947, Youde joined the Foreign Office, where he would serve the rest of his life, and was swiftly posted to the British embassy in Nanking, then the capital of the Republic of China. In 1949, amidst the Chinese Civil War, HMS Amethyst came under attack by People's Liberation Army forces while sailing on the Yangtze River. The frigate was heavily damaged by artillery fire and became stranded in the Yangtze River. Using his skills in Mandarin, Youde negotiated with the PLA commander to ask for the release of the Amethyst. His negotiations came to naught, but bought enough time for the Amethyst to plan a successful escape to Hong Kong under the cover of darkness. Youde was appointed a Member of the Order of the British Empire (MBE) for his actions.\nIn 1950, following the Communists' victory in the civil war, Britain recognised the People's Republic of China, and the British embassy moved to Beijing. Youde went on to serve a total of four tours of Foreign Office duty in China, the last as ambassador, from 1974 to 1978.  He also served in Washington (1956 to 1959) and as a member of the British mission to the United Nations (1965 to 1969).\nYoude was knighted in 1977.\nHong Kong governorship\nWhen Youde took office as Governor in 1982, he sought to expand Hong Kong's further education system which he considered to be lacking. At that time, there were only two accredited universities in Hong Kong - the University of Hong Kong and the Chinese University of Hong Kong. Statistics also suggested that only 2% of secondary school graduates attended university locally. In view of this, Youde created the City Polytechnic of Hong Kong (now City University of Hong Kong) and the Hong Kong Academy for Performing Arts. The idea of setting up a secondary school to develop students' potential in sport and the visual arts together with a normal academic syllabus was first mooted by Youde. Based upon this idea, the Jockey Club Ti-I College was founded in 1989.\nYoude delivered his first policy address to the Hong Kong Legislative Council in October 1982, in which he stated that he wanted to \"create an environment that encourages citizens to develop their energy and enterprising spirit; only under special circumstances, such as disruption of normal operations and workers not being treated fairly , or Hong Kong's reputation is damaged, the government will intervene in the industrial, commercial and financial sectors.\" Although Hong Kong's economy was in recession, he personally led trade missions to the United Kingdom, Japan, the United States and China to promote Hong Kong's trade. He also promulgated many laws to control and supervise the banking, insurance, securities, finance and trade industries.\nYoude is especially remembered for his tenure as the Hong Kong Governor and his role in negotiating the Sino-British Joint Declaration, which was signed in Beijing in 1984. This, among other things, made it clear the British would leave Hong Kong in 1997 after 156 years of colonial rule. To this end, Youde embarked on further political reforms to support the development of representative democracy in Hong Kong and issued a green paper on Hong Kong democracy in 1984. The reform stated 24 seats in the Legislative Council will be elected by the electoral college and functional constituencies, with 12 seats each elected by voting. On September 26, 1985, Hong Kong held its first indirect election for the Legislative Council, officially starting Hong Kong's representative government system. However, many Hong Kong citizens were worried about the future of Hong Kong. The British-owned Jardine Matheson announced that it would move its head office from Hong Kong to Bermuda . This was regarded by all sectors of society as Britain's intention to withdraw its capital, and as a result, they became even more worried about the future of Hong Kong. Youde also had to deal with a substantial  emigration wave after it became apparent Hong Kong citizens would not be offered British citizenship during the handover, so many many Hong Kongers made private arrangements with emigration to Canada, Australia and the United Kingdom being popular destinations with outflows between 1988 and 1994 averaged about 55,000 per year, although some Hong Kong people returned after in the early years after 1997.\nYoude was Hong Kong's only Welsh Governor was widely liked for his kindly demeanour and greatly admired for his formidable erudition. In an editorial following his death, the Chinese-language Ming Pao newspaper compared him to Zhuge Liang, a chancellor of the state of Shu Han during the Three Kingdoms period, who had 'pledged to work diligently on state affairs until death.' Youde was known for his love of Chinese literature and Chinese language. He once claimed he read several Chinese newspapers every day when he had breakfast.\nDeath and state funeral\nDuring a visit to Beijing, Youde suffered a fatal heart attack in the British Embassy in the early hours of 5 December 1986, while asleep. He was the only Governor of Hong Kong to die in office.\nAt his funeral – Hong Kong's first state funeral with full military honours – the streets were lined with people. The casket, draped in the Governor's Standard, was carried by ten guardsmen, and a 17-gun salute was fired from the shore station of . Youde was cremated, and his ashes interred at Canterbury Cathedral in England, and a memorial plaque was installed in the nave.\nRemembrance and legacy\nA fund, the Sir Edward Youde Memorial Fund, was created from public contributions upon the recommendation of the Legislative Council. The fund is now administered by the HKSAR Government and offers a number of scholarships and sponsorship schemes aimed at encouraging and promoting the education of and research by Hong Kong people. To be eligible for the Sir Edward Youde Memorial Fund, candidates must be proficient in English and Chinese and also have a good mastery of the language in which their studies will be undertaken.\nThe Edward Youde Aviary in Hong Kong Park was named after him in 1992, in recognition of his birdwatching interest. The Pamela Youde Nethersole Eastern Hospital in Hong Kong was named after his wife.\nA plaque to his memory was commissioned by the Hong Kong Civil Service and placed on the wall of St John's Cathedral, in the Central District of Hong Kong. As mentioned above, another was placed at Canterbury Cathedral.\nPersonal and family\nYoude married Pamela Fitt and the couple had two daughters, Jennifer and Deborah.\nReferences\nExternal links\n*\n* [https://www.youtube.com/watch?v=bpZSaIsGQAc 5 December 1986 - TVB Pearl News File report on Sir Edward Youde's death]\n* [https://digital.lib.hkbu.edu.hk/corpus/ Corpus of Political Speeches] Free access to political speeches by Edward Youde and other politicians, developed by Hong Kong Baptist University Library"
    }
  ]
}