{
  "content": [
    {
      "type": "text",
      "text": "# Edward Law, 1st Earl of Ellenborough__disambig_1\n\n| image            = 1stEarlOfEllenborough.jpg\n| caption          = Portrait by Frederick Richard Say, c. 1845\n| order1           = Governor-General of India\n| term_start1      = 28 February 1842\n| term_end1        = June 1844\n| monarch1         = Victoria\n| primeminister1   = Sir Robert Peel\n| predecessor1     = The Earl of Auckland\n| successor1       = William Wilberforce Bird (acting Governor-General)\n| office2          = Member of the House of Lords\n| status2          = Lord Temporal\n| term_start2      = 13 December 1818\n| term_end2        = 22 December 1871\n| predecessor2     = The 1st Baron Ellenborough\n| successor2       = The 3rd Baron Ellenborough\n| office3          = Member of Parliamentfor Mitchell\n| term_start3      = 1813\n| term_end3        = 1818\n| predecessor3     = George Hobart\n| successor3       = Sir George Staunton\n| office4          = President of the Board of Control\n| term_start4      = 6 March 1858\n| term_end4        = 5 June 1858\n| predecessor4     = The Lord Lyvedon\n| successor4       = Lord Stanley\n| office5          =\n| term_start5      = 4 September 1841\n| term_end5        = 23 October 1841\n| predecessor5     = Sir John Jobhouse\n| successor5       = The Lord FitzGerald and Vesey\n| office6          =\n| term_start6      = 18 September 1834\n| term_end6        = 23 April 1835\n| predecessor6     = The Lord Glenelg\n| successor6       = Sir John Jobhouse\n| office7          =\n| term_start7      = 17 September 1828\n| term_end7        = 1 December 1830\n| predecessor7     = The Viscount Melville\n| successor7       = The Lord Glenelg\n| office8          = First Lord of the Admiralty\n| term_start8      = 1846\n| term_end8        = 1846\n| predecessor8     = The Earl of Haddington\n| successor8       = The Earl of Auckland\n| birth_date       =\n| birth_place      =\n| death_date       =\n| death_place      = Southam House, Gloucestershire\n| nationality      = British\n| party            = ToryConservative\n| spouse           =\n* }}\n| parents          =\n| alma_mater       = St John's College, Cambridge\n}}\nEdward Law, 1st Earl of Ellenborough (8 September 1790 – 22 December 1871), was a British Tory politician. He was four times President of the Board of Control and also served as Governor-General of India between 1842 and 1844.\nBackground and education\nEllenborough was the eldest son of Edward Law, 1st Baron Ellenborough, and Anne Towry, daughter of George Towry. He was educated at Eton College and St John's College, Cambridge. In 1812, he became Chief Clerk of the Court of King's Bench (his father's court), a sinecure which was worth nearly £8,000 a year. Owing to the political embarrassment it caused, it was commuted for a life pension in 1838.\nPolitical career, 1813–1842\nEllenborough represented the subsequently disfranchised rotten borough of St Michael's, Cornwall, in the House of Commons, until the death of his father in 1818 gave him a seat in the House of Lords. In the Duke of Wellington's government of 1828, Ellenborough was made Lord Privy Seal; he also took part in the business of the foreign office, as an unofficial assistant to Wellington, who recognised his talents. He hoped to be Foreign Secretary, but had to be content with the presidency of the Board of Control, which he retained until the fall of the ministry in 1830. Ellenborough was an active administrator, and took a lively interest in questions of Indian policy. The revision of the East India Company's charter was approaching, and he held that the government of India should be transferred directly to the crown. He was impressed with the growing importance of a knowledge of central Asia, in the event of a Russian advance towards the Indian frontier, and despatched Alexander Burnes to explore the district.\nEllenborough subsequently returned to the Board of Control in Robert Peel's first and second administrations. He had only held office for a month on the third occasion when he was appointed by the court of directors to succeed Lord Auckland as Governor-General of India.\nGovernor-General of India, 1842–1844\nHis Indian administration of two and a half years, or half the usual term of service, was from first to last a subject of hostile criticism. His own letters sent monthly to the Queen, and his correspondence with the Duke of Wellington, published in 1874, afford material for an intelligent and impartial judgment of his meteoric career. The events chiefly in dispute are his policy towards Afghanistan and the army and captives there, his conquest of Sind, and his campaign in Gwalior.\nEllenborough went to India to \"restore peace to Asia\" but the whole term of his office was occupied by war. On his arrival there the news that greeted him was that of the massacre of Kabul, and the sieges of Ghazni and Jalalabad, while the sepoys of Madras were on the verge of open rebellion. In his proclamation of 15 March 1842, as in his memorandum for the queen, dated the 18th, he stated with characteristic clearness and eloquence the duty of first inflicting some signal and decisive blow on the Afghans, and then leaving them to govern themselves under the sovereign of their own choice. Unhappily, when he left for upper India and learned of the failure of General England, he instructed George Pollock and William Nott, who were advancing triumphantly with their avenging columns to rescue the British captives, to fall back. The army proved true to the governor-general's earlier proclamation rather than to his later fears; the hostages were rescued and the scene of Sir Alexander Burnes's murder in the heart of Kabul was burned down.\nDost Mahommed Khan was quietly released from a prison in Calcutta to the throne in the Bala Hissar, and Ellenborough presided over the painting of the elephants for an unprecedented military spectacle at Ferozepur, on the south bank of the Satluj. When Mahmud of Ghazni, in 1024, sacked the Hindu temple of Somnath on the north-west coast of India, he carried off the richly-studded sandalwood gates of the fanes and set them up in his capital of Ghazni. The Muslim puppet of the English, Shah Shuja, had been asked, when ruler of Afghanistan, to restore them to India; and what he had failed to do the Christian ruler of opposing Muslim and Hindus resolved to effect in the most solemn and public manner. In vain had Major (afterwards Sir Henry) Rawlinson proved that they were only reproductions of the original gates, to which the Ghazni moulvies clung merely as a source of offerings from the faithful who visited the old conqueror's tomb. In vain did the Hindu sepoys show the most chilling indifference to the belauded restoration. Ellenborough could not resist the temptation to copy Napoleon's magniloquent proclamation under the pyramids. The fraudulent folding doors were conveyed on a triumphal car to the fort of Agra, where they were found to be made not of sandalwood but of deal. That Somnath proclamation (immortalized in a speech by Macaulay) was the first step towards its author's recall.\nHardly had Ellenborough issued his medal with the legend \"Pax Asiae Restituta\" when he was at war with the amirs of Sind. The tributary amirs had on the whole been faithful, for Major James Outram controlled them. He reported some opposition, and Ellenborough ordered an inquiry, but entrusted the duty to Sir Charles Napier, with full political as well as military powers. Mir Au Morad was intrigued with both sides so effectually that he betrayed the amirs on the one hand, while he deluded Napier on the other. Ellenborough was led on till events were beyond his control, and his own instructions were forgotten. Sir Charles Napier made more than one confession like this: \"We have no right to seize Sind, yet we shall do so, and a very advantageous, useful and humane piece of rascality it will be.\" The battles of Meeanee and Hyderabad followed; and the Indus became a British river from Karachi to Multan.\nSind had hardly been disposed of when the Britain started eyeing other parts of the Indian subcontinent. On the north, the Sikh confederacy was going through rapid changes and internal power shifts after the death of Maharaja Ranjit Singh  . In Gwalior to the south, the feudatory Mahratta state, there was dissent from the army, and factions in the council of ministers. These conditions brought Gwalior to the verge of civil war. Ellenborough reviewed the danger in the minute of 1 November 1845, and told Sir Hugh Gough to advance. Further treachery and military licence rendered the battles of Maharajpur and Punniar (fought on the same day), inevitable though they were, a surprise to the combatants. The treaty that followed was as merciful as it was wise.  But by this time the patience of the directors was exhausted. They had no control over Ellenborough's policy; his despatches to them were haughty and disrespectful; and in June 1844 they exercised their power of recalling him.\nPolitical career, 1844–1858\n]]\nOn his return to England, Ellenborough was created Earl of Ellenborough, in the county of Cumberland, Knight Grand Cross of the Order of the Bath and received the thanks of Parliament; but his administration soon became the theme of hostile debates, though it was successfully vindicated by Peel and Wellington. When Peel's cabinet was reconstituted in 1846 Ellenborough became First Lord of the Admiralty. In 1858 he took office under Lord Derby as president of the board of control, for the fourth time. It was then his congenial task to draft the new scheme for the government of India which the Indian Rebellion of 1857 had rendered necessary. But his old fault of impetuosity again proved his stumbling block. He wrote a caustic despatch censuring Lord Canning for the Oudh proclamation, and allowed it to be published in The Times without consulting his colleagues, who disavowed his action in this respect. General disapprobation was excited; votes of censure were announced in both Houses; and, to save the cabinet, Ellenborough resigned.\nBut for this act of rashness, he might have enjoyed the task of carrying into effect the home constitution for the government of India which he sketched in his evidence before the select committee of the House of Commons on Indian territories on 8 June 1852. Paying off his old score against the East India Company, he then advocated the abolition of the court of directors as a governing body, the opening of the civil service to the army, the transference of the government to the crown, and the appointment of a council to advise the minister who should take the place of the President of the Board of Control. These suggestions of 1852 were carried out by his successor Lord Stanley, in 1858, so closely even in details, that Lord Ellenborough must be pronounced the author, for good or evil, of the system of direct rule of India that was introduced at that time. Though acknowledged to be one of the foremost orators in the House of Lords, and taking a frequent part in debate, Ellenborough never held office again.\nSee History of the Indian Administration (Bentley, 1874), edited by Lord Colchester; Minutes of Evidence taken before the Select Committee on Indian Territories (June 1852); volume i. of the Calcutta Review; the Friend of India, during the years 1842–1845; and John Hope, The House of Scindea: A Sketch (Longmans, 1863). The numerous books by and against Sir Charles Napier, on the conquest of Sind, should be consulted.\nFamily\nLord Ellenborough was married twice. He married firstly Lady Octavia Catherine Stewart, daughter of Robert Stewart, 1st Marquess of Londonderry, in 1813. They had no children. She died of tuberculosis in March 1819.\nHe married secondly Jane Digby, daughter of Admiral Sir Henry Digby. They had one child, the Hon. Arthur Dudley Law (15 February 1828 – 1 February 1830). Arthur's biological father was Jane's cousin; after her cousin ended their affair, she had at least two more affairs. After the news of her affair with Prince Felix of Schwarzenberg became public, Lord and Lady Ellenborough were divorced by Act of Parliament in 1830.\nHe did not remarry, although he had illegitimate children with his mistress. The stage actor St. Clair Bayfield (born John St. Clair Roberts) was his grandson through his illegitimate daughter, Ida Roberts.\nDeath\nEllenborough died at his seat, Southam House, near Cheltenham, in December 1871, aged 81. On his death, the viscountcy and earldom became extinct while he was succeeded in the barony by his nephew, Charles Towry-Law, 3rd Baron Ellenborough. He was buried in the family mausoleum at Oxenton Church.\n| image = Coat of arms of Edward Law, 1st Earl of Ellenborough.svg\n| imagesize = 250px\n| crest = A cock gules charged on the breast with a mitre pendant from a chain round the neck or.\n| escutcheon = Ermine on a bend engrailed between two cocks gules three mullets pierced or.\n| supporters = Two eagles, wings elevated, sable, each gorged with a chain or, and pendant therefrom on the brest of the dexter supporter a mitre, and on the sinister a covered cup gold.\n| motto = Compositum Jus Fasque Animi (Law and equity combined)\n| orders = Order of the Bath (Knight Grand Cross, civil division - GCB)\n}}\nNotes\nReferences\n*\nExternal links\n*\n*\n*\n*\n*"
    }
  ]
}