{
  "content": [
    {
      "type": "text",
      "text": "# Edward J. Mechenbier\n\n|death_date=\n|birth_place= Morgantown, West Virginia\n|death_place=\n|placeofburial=\n|placeofburial_label=\n|image=File:Official portrait of General Edward J. Mechenbier.jpg\n|caption=\n|nickname= Squire\n|allegiance= United States of America\n|branch=United States Air Force\n|serviceyears=1960–2004\n|rank=  Major General\n|commands=162nd Tactical Fighter Squadron\n|unit=\n|battles= Vietnam War\n|awards= Distinguished Service MedalSilver Star (2) Distinguished Flying Cross (2) Bronze Star Medal with \"V\" device Purple Heart (2)Meritorious Service MedalAir Medal (9)Air Force Commendation MedalPrisoner of War MedalVietnam Service Medal (9)Republic of Vietnam Gallantry Cross with PalmRepublic of Vietnam Campaign Medal\n|relations=\n|laterwork=\n}}\nMajor General Edward J. Mechenbier (born 29 June 1942) is a retired United States Air Force (USAF) officer.\nEarly life and education\nHe was born on 29 June 1942 in Morgantown, West Virginia.\nMilitary career\nHe graduated from the U.S. Air Force Academy as a second lieutenant on 3 June 1964. From July 1964 to August 1965 he attended undergraduate pilot training at Vance Air Force Base, Oklahoma. From September 1965 to February 1966 he attended McDonnell Douglas F-4C Phantom II flight training at Davis-Monthan Air Force Base, Tucson, Arizona. From February 1966 to November 1966 he flew with the 92nd Fighter Squadron at RAF Bentwaters, England.\nIn December 1966 he was transferred to the 390th Fighter Squadron at Da Nang Air Base, South Vietnam. In June 1967, he was shot down on his 80th mission over North Vietnam and was a prisoner of war for nearly six years. During his captivity he was promoted to Captain on 3 December 1967. He was released during Operation Homecoming on 18 February 1973.\n, 18 February 1973]]\nFollowing his return from captivity he served as a pilot in the Fighter Branch, 4950th Test Wing, Wright-Patterson Air Force Base, Ohio from May 1973 to June 1975. He resigned his regular commission in 1975 and then served as pilot, command post controller and operations officer, 162nd Tactical Fighter Squadron, Ohio Air National Guard, Springfield Airport from July 1975 to June 1984 and then as commander of that squadron until June 1991 flying the North American F-100 Super Sabre and then the LTV A-7 Corsair II. He was promoted to Major on 3 June 1978 and to lieutenant colonel on 14 January 1984.\nIn 1991, he transferred to the Air Force Reserve, where he served with the Joint Logistics Systems Center and Headquarters Air Force Materiel Command. The command conducts research, development, test and evaluation, and provides acquisition management services and logistics support necessary to keep Air Force weapons systems ready for war. From June 1991 he served at Wright-Patterson AFB first as senior mobilization assistant to the commander, Joint Logistics Systems Center until January 1995. He was promoted to colonel on 15 March 1992. From January 1995 to July 1997, he served as mobilization assistant to the director of Logistics, Headquarters Air Force Materiel Command. He was promoted to brigadier general on 20 May 1997. From July 1997 to April 2000, he served as mobilization assistant to the commander, Aeronautical Systems Center. He was promoted to major general on 30 June 1999. From April 2000 to June 2004, he served as mobilization assistant to the commander, Headquarters Air Force Materiel Command.\nIn late May 2004 in his last military mission, he piloted the Lockheed C-141 Starlifter Hanoi Taxi to Hanoi to repatriate the remains of two US servicemen killed in the Vietnam War. He retired in June 2004 as the last Vietnam-era POW serving in the military.\nHe was a command pilot with more than 3,700 flying hours in A-7, F-100, F/RF-4, T-39 and C-141C, plus more than 20 other aircraft for familiarization including the F-15, F-16, F/A-18 and MiG-29.\nLater life\nHe co-authored Life on a $5 Bet with Linda D. Swink, an account of his time as a POW.\nDecorations\nHis military decorations and awards include the Distinguished Service Medal, Silver Star with oak leaf cluster, Distinguished Flying Cross with oak leaf cluster, Bronze Star Medal with \"V\" device, Purple Heart with oak leaf cluster, Meritorious Service Medal, Air Medal with silver and three bronze oak leaf clusters, Air Force Commendation Medal, Prisoner of War Medal, Vietnam Service Medal with eight service stars, Republic of Vietnam Gallantry Cross with Palm and Republic of Vietnam Campaign Medal.\nReferences"
    }
  ]
}