{
  "content": [
    {
      "type": "text",
      "text": "# Edward Athey\n\nEdward L. Athey (October 26, 1921 – February 28, 2010) was a sports coach and athletic director at Washington College. His name was enshrined in the school's Hall of Fame on October 15, 1982. Athey was born in Moundsville, West Virginia but grew up and went to high school in Cumberland, Maryland. He died in Chestertown, Maryland, the home of Washington College.\nPlaying career, education, and military service\nAthey was a three-sport athlete while he attended Washington College, having roles as the quarterback on the football team, a guard on the basketball team, and also an outfielder for the school's baseball team.  The fall of 1942 going into the spring of 1943 was a very successful time for Athey as he was a member of the soccer, basketball, and baseball teams for the Shoremen. Although the archives for the soccer team only began in 1946, the 1942&ndash;43 basketball team went 14&ndash;4. Also, in the spring Ed Athey went 3–3 as an outfielder for the Shoremen baseball team.\nAthey's college career as a student and an athlete was interrupted when he enlisted in the United States Army Air Forces after the 1943 spring semester. He served as a flight instructor and later as a pilot in China, Burma, and India during World War II. His main line of duty included flights of C-47s of supply forces over the Himalaya Mountains to China.\nHe returned to Washington College after serving in the war and earned his bachelor's degree in 1947.[http://faculty.washcoll.edu/edwardathey/ Washington College | Edward Athey]   Upon graduation, he was awarded the Gold Pentagon, Clark-Porter Character Medal, and was named Best All-Around Athlete.\nCoaching career\nAthey coached the Shoremen baseball team for 28 seasons, from 1968 to 1997 while only taking one year off. He also coached the Shoremen basketball team for 12 seasons and the Shoremen soccer team for 30 seasons.\nAdministrative career\nAthey went through many different positions throughout his lifetime. Ed Athey was Washington College's athletic director from 1949 to 1987[https://wacalumninews.blogspot.com/2010/03/services-for-edward-l-athey-47.html WAC Alumni News: Services for Edward L. Athey '47] which is a tremendous accomplishment considering he was only two years removed from graduating before he was appointed the position. Along with serving as the school's athletic director, he also served as the president of the Mason-Dixon Conference and the president of the Mid-Atlantic Conference. He is also a former-president of the Intercollegiate Lacrosse Association and also a secretary in the same association.[http://alumni.washcoll.edu/halloffame/1982/ea47.html Washington College Hall of Fame]\nHonors\nAthey Park is home to Washington College's oldest intercollegiate sport&mdash;baseball.  The facility is named in honor of Athey.  A new field was installed in 2007 and the current stadium architecture and press box were completed in 2009. The college's \"Western Shore\" dorms line the outfield and students often grill and lounge in \"Atheyville\" on game days.[http://washingtoncollegesports.com/insideAthletics/facilities/athey_park Washington College Athletics]\nOn October 4, 2008, the groundbreaking ceremonies for the Washington College baseball team's new home commenced.  Former athletes, coaches, administrators, and students were in attendance for the groundbreaking, which took place prior to the team's annual alumni game.  At the ceremony, Athey was honored with a commemorative plaque, which was corner-stoned into the new park.  On April 18, 2009, after months of construction, Athey Park was dedicated to Athey prior to a double-header ballgame between Washington College and Dickinson College.  Washington College swept the series by scores of 13&ndash;4 and 12&ndash;11, respectively, with the second game being capped off by a walk-off home run by freshman Ben Keaton in the bottom of the ninth inning.\nWritten works\nAthey is a co-author of the book ''Athey's Field'' which was published in 2009 by the Literary Press House of Washington College. The following is an excerpt from the book:\n:Ed Athey '47 got mad once. It's true because even he remembers it.\n:He was in his second year of employment at Washington College when he lost his temper, and it was because he Shoremen Basketball Team was getting badly whipped in the first half of a contest. \"I knew we didn't have our heads in the game and I wanted to shake the boys up at half time,\" he remembered. \"I stormed into the locker room with a basketball in my hand intending to throw it against the wall as hard as I could --- you know, get their attention. So, I cocked back and heave the ball, and it went right through the locker room window. That cost me a few dollars.\"\nHead coaching record\nBaseball\n* 1968: 6–10\n* 1969: 6–10\n* 1970: 7–7\n* 1971: 5–9\n* 1972: 6–5\n* 1974: 3–8\n* 1975: 3–4\n* 1976: 7–15\n* 1977: 5–11–1\n* 1978: 8–10\n* 1979: 9–11–1\n* 1980: 8–7\n* 1981: 6–15\n* 1982: 11–9\n* 1983: 16–16\n* 1984: 19–11–2   (MAC Tournament)\n* 1985: 11–10\n* 1986: 19–9\n* 1987: 18–15\n* 1988: 16–8\n* 1989: 7–15\n* 1990: 13–14–2\n* 1991: 16–9\n* 1992: 12–16\n* 1993: 11–15\n* 1994: 17–10\n* 1995: 15–12\n* 1996: 19–11\n* 1997: 21–13\nBasketball\n* 1948–49: 7–11\n* 1949–50: 13–9   (Mason-Dixon Conf. Tournament)\n* 1950–51: 8–14\n* 1951–52: 12–12   (Mason-Dixon Conf. Tournament)\n* 1952–53: 8–15\n* 1955–56: 9–11\n* 1956–57: 5–15\n* 1957–58: 10–10\n* 1958–59: 11–10   (Mason-Dixon Conf. Tournament)\n* 1959–60: 10–11   (Mason-Dixon Conf. Tournament)\n* 1960–61: 11–9   (Mason-Dixon Conf. Tournament)\n* 1961–62: 7–14   (Mason-Dixon Conf. Tournament)\n* 1962–63: 3–17   (Mason-Dixon Conf. Tournament)\nSoccer\n* 1949: 3–3–3\n* 1950: 6–3\n* 1953: 5–2–4\n* 1954: 7–3–2   (MAC Champions)\n* 1955: 5–2–3\n* 1956: 4–3–3\n* 1957: 7–3\n* 1958: 7–1–2\n* 1959: 8–2–2   (MAC Tournament)\n* 1960: 7–4\n* 1961: 7–3–1   (Mason-Dixon Conf. Champions)\n* 1962: 3–5–2\n* 1963: 8–2–2\n* 1964: 11–1   (Mason-Dixon Conf. Champions)\n* 1965: 8–4   (MAC Tournament)\n* 1966: 3–6–1\n* 1967: 7–4\n* 1968: 5–6–1\n* 1969: 8–2–2   (Mason-Dixon Conf. Tournament, MAC Co-Champions)\n* 1970: 4–7–1\n* 1971: 9–4–1   (Mason-Dixon Conf. Tournament, MAC Tournament)\n* 1972: 11–3\n* 1973: 9–5–1   (Mason-Dixon Conf. Tournament, MAC Tournament, NCAA Tournament)\n* 1974: 8–4–1\n* 1975: 10–3\n* 1976: 7–6–1\n* 1977: 6–5\n* 1978: 10–5–2\n* 1979: 11–5–2\n* 1980: 6–8–1\n* 1981:6–7–1\nReferences"
    }
  ]
}