{
  "content": [
    {
      "type": "text",
      "text": "# Edward Anhalt\n\n|death_place=Pacific Palisades, California, U.S.\n|occupation=Screenwriter, producer, documentary filmmaker\n}}\nEdward Anhalt (March 28, 1914 – September 3, 2000) was an American screenwriter, producer, and documentary filmmaker. After working as a journalist and documentary filmmaker for Pathé and CBS-TV, he teamed with his wife Edna Anhalt, one of his five wives, during World War II to write pulp fiction.\nAs a screenwriter, Anhalt won two Academy Awards: He shared the Oscar for Best Writing, Motion Picture Story with his wife Edna Anhalt for Panic in the Streets (1950) and a second Oscar for Best Writing, Screenplay Based on Material from Another Medium for Becket (1964).\nEarly life and education\nAnhalt was born in New York City. He began writing at the age of 15, with his first play being On the Rocks: A Political Comedy by George Bernard Shaw. He got criticized by Shaw for messing with his work, and went to attend  Columbia and Princeton universities instead.\nCareer\nDuring World War II, Anhalt served with the Army Air Force's First Motion Picture Unit in Culver City, California as a scenarist for training films.\nAfter the war, Anhalt graduated to writing screenplays for thrillers, initially using the joint pseudonym Andrew Holt. The works by him and his wife, Edna Anhalt had attracted Hollywood, and they moved from New York to Los Angeles, where he made his first screenwriting debut in 1946 with Strange Voyage.\nPut under contract by Columbia, the Anhalts scripted Bulldog Drummond Strikes Back (1947). After a stint at Twentieth Century Fox during which they won the Academy Award for Best Story for the screen story to the urban thriller Panic in the Streets (1950), the husband and wife team returned to Columbia as writer-producers, earning another Academy Award nomination for their story to the thriller The Sniper in 1952.\nThe Anhalts wrote the 1952 screen version of Carson McCullers' The Member of the Wedding, which preserved the stage performances of Julie Harris, Brandon deWilde and Ethel Waters.\nAfter the couple divorced, Anhalt proved a versatile, consistently effective (and reputedly speedy) scenarist. He penned the adaptation of Irwin Shaw's World War II novel The Young Lions (1958) and Wives and Lovers (1963). The screenwriter earned a second Academy Award for his adaptation of Jean Anouilh's play Becket (1964).\nSubsequent solo outings included Girls! Girls! Girls! (1962), The Boston Strangler (1968), The Madwoman of Chaillot (1969), and two for Ely A. Landau's American Film Theater, Luther (1974) and The Man in the Glass Booth (1975). He had box office successes with The Satan Bug (1965) and Jeremiah Johnson (1972). In the early 1970s, Anhalt returned to the small screen, earning an Emmy nomination for the ABC miniseries QB VII (1974). Three years later, he scripted the Frank Sinatra vehicle Contract on Cherry Street (NBC) and contributed to the small screen remake of Madame X (NBC, 1981) and the biblically inspired The Day Christ Died (CBS, 1982). Anhalt was also the guiding force behind the 1985 NBC miniseries Peter the Great.\nHis feature film output towards the end of his life included films like Escape to Athena (1979), Green Ice (1981), The Holcroft Covenant (1985) and The Neon Empire.\nFilmography\n{| class=wikitable\n|-\n!Year\n!Title\n!Role\n!Notes\n|-\n|1967||Hour of the Gun||Denver Doctor||Uncredited\n|-\n|1983||The Right Stuff||Grand Designer||\n|-\n|1988||Two Idiots in Hollywood||Jury Foreman||(final film role)\n|}\nReferences\nExternal links\n*\n}}"
    }
  ]
}