{
  "content": [
    {
      "type": "text",
      "text": "# Edward Matthew Ward\n\nEdward Matthew Ward, , (14 July 1816 – 15 January 1879) was a British painter who specialised in historical genre. He is best known for his murals in the Palace of Westminster depicting episodes in British history from the English Civil War to the Glorious Revolution.\nLife\nEarly career\nWard was born in Pimlico, London. As a youth, he created illustrations for the well-known book Rejected Addresses, written by his uncles James and Horace Smith. He also illustrated the papers of Washington Irving.\nIn 1830, he won the \"silver palette\" from the Society of Arts. With support from David Wilkie and Francis Leggatt Chantrey, he became a student at the Royal Academy Schools. In 1836 he travelled to Rome, where in 1838 he gained a silver medal from the Academy of St Luke for his Cimabue and Giotto, which in 1839 was exhibited at the Royal Academy.\nWhile a student at the Schools, Ward became a member of The Clique, a group of painters, led by Richard Dadd. Like other members of the Clique, Ward saw himself as a follower of Hogarth and Wilkie, considering their styles distinctly national. Many of his early paintings were set in the eighteenth century and were on Hogarthian subjects. He also painted episodes from seventeenth-century history, influenced by the thinking of his friend the historian Thomas Babington Macaulay. He also painted subjects from the history of the French Revolution.\nIn 1843, he entered the Palace of Westminster cartoon competition and failed to win a prize.\n'' (1847), a Hogarthian subject in the Tate Gallery]]\n's novel Kenilworth]]\nOpposition to Pre-Raphaelitism\nIn the 1850s Ward came into conflict with the Pre-Raphaelites, especially Millais, whose style of art he considered un-British. Ward's painting of Charlotte Corday being led to execution beat Millais's Ophelia for a prize at Liverpool, leading to much debate at the time.\nHis historical paintings led to Ward's commission to paint eight scenes in the corridor leading into the House of Commons, despite the fact that he had won nothing at the original 1843 competition. These were to depict parallel episodes on the Royalist and Parliamentary sides in the Civil War. Ward's paintings depict the opposed figures as if confronting one another across the corridor.\nLater work and death\nWard continued to paint Hogarthian versions of episodes from British history throughout the 1860s, including ''Hogarth's Studio in 1739 (1863; York Art Gallery) and the Antechamber at Whitehall during the Dying Moments of Charles II (1865; Walker Art Gallery, Liverpool). In the 1870s, he painted some modern-life genre subjects.\nTowards the end of the 1870s, he began to suffer painful illness and depression. On 10 January 1879, he was found raving on the floor of his dressing room, his throat cut with a razor, shouting \"I was mad when I did it; the devil prompted me\". Medical help arrived, but he died on 15 January at his home, 3 Queens Villas, in Windsor. The inquest in Windsor on 17 January found that he committed suicide while temporarily insane.\nin the ante-room of Lord Chesterfield, in Chesterfield House, Westminster. Coloured engraving by E. M. Ward and C. W. Sharpe.]]\nFamily\nIn 1843, Ward met the 11-year-old Henrietta Ward (her maiden and married names were the same, but she was no relation); they married secretly in May 1848, shortly before her 16th birthday, after an elopement aided by Ward's friend Wilkie Collins. Henrietta's mother never forgave the elopement, and disinherited her. Collins may have based the plot of his 1852 novel Basil on the Ward engagement. Henrietta also became a successful painter.\nShe became a notable art teacher after her husband's death and wrote two autobiographical memoirs about their life together. His son, Leslie, became a popular caricaturist for the magazine Vanity Fair, and later the journal The World, under the nickname \"Spy\".\nGallery\nFile:Napoléon prison.jpg|Napoleon in the Prison of Nice in 1794, 1841\nFile:Edward Matthew Ward (1816-1879) - The Disgrace of Lord Clarendon, after his Last Interview with the King - Scene at Whitehall Palace, in 1667 (replica) - N00431 - National Gallery.jpg|The Disgrace of Lord Clarendon, 1846\nFile:Edward Matthew Ward (1816-1879) - Daniel Maclise - NPG 616 - National Portrait Gallery.jpg|Daniel Maclise, 1846\nFile:Edward Matthew Ward (1816-1879) - The Execution of the Marquis of Montrose - 1877-12 - Salford Museum and Art Gallery.jpg|The Execution of the Marquis of Montrose, 1853\nFile:Josephine Signing the Act of her Divorce.png|Josephine Signing the Act of Her Divorce, 1853\nFile:Edward Matthew Ward (1816-1879) - Hogarth's Studio in 1739 - YORAG , 349 - York Art Gallery.jpg|''Hogarth's Studio in 1739'', 1863\nFile:Edward Matthew Ward (1816-1879) - Anne Boleyn at the Queen's Stairs - TWCMS , B2517 - Sunderland Museum and Winter Gardens.jpg|''Anne Boleyn at the Queen's Stairs'', 1871\nReferences\nExternal links\n*\n* [http://www.racollection.org.uk/ixbin/indexplus?_IXACTION_=file&_IXFILE_=templates/full/person.html&_IXTRAIL_=Academicians&person=5953 Profile on Royal Academy of Arts Collections]"
    }
  ]
}