{
  "content": [
    {
      "type": "text",
      "text": "# Edward Root\n\n|birth_place         = Alexandria, New South Wales, Australia\n|death_date          =\n|death_place         = Brighton-Le-Sands, New South Wales, Australia\n|height              = 5ft 10.5in\n|weight              = 12st 12lb\n|position            =\n|club1               = South Sydney\n|year1start          = 1923\n|year1end            = 29\n|appearances1        = 69\n|tries1              = 29\n|goals1              = 1\n|fieldgoals1         = 0\n|points1             = 89\n|club2               = Newtown\n|year2start          = 1930\n|year2end            =\n|appearances2        = 12\n|tries2              = 7\n|goals2              = 1\n|fieldgoals2         = 0\n|points2             = 23\n|club3               = South Sydney\n|year3start          = 1931\n|year3end            = 33\n|appearances3        = 31\n|tries3              = 5\n|goals3              = 0\n|fieldgoals3         = 0\n|points3             = 15\n|club4               = St. George\n|year4start          = 1935\n|year4end            = 36\n|appearances4        = 24\n|tries4              = 3\n|goals4              = 0\n|fieldgoals4         = 0\n|points4             = 9\n|teamA               = New South Wales\n|yearAstart          = 1927\n|yearAend            = 32\n|appearancesA        = 25\n|triesA              = 8\n|goalsA              = 3\n|fieldgoalsA         = 0\n|pointsA             = 30\n|teamB               = Australia\n|yearBstart          = 1929\n|yearBend            = 30\n|appearancesB        = 0\n|triesB              = 0\n|goalsB              = 0\n|fieldgoalsB         = 0\n|pointsB             = 0\n|teamC               = Metropolis\n|yearCstart          = 1923\n|yearCend            = 30\n|appearancesC        = 4\n|triesC              = 5\n|goalsC              = 1\n|fieldgoalsC         = 0\n|pointsC             = 17\n|teamD               = NSW City\n|yearDstart          = 1928\n|yearDend            = 32\n|appearancesD        = 4\n|triesD              = 3\n|goalsD              = 0\n|fieldgoalsD         = 0\n|pointsD             = 9\n| coachteam1         = St George\n| coachyear1start    = 1936\n| coachyear1end      =\n| coachgames1        = 13\n| coachwins1         = 3\n| coachdraws1        = 0\n| coachlosses1       = 10\n|retired = yes\n|updated             = 20 June 2019\n|source              =\n| module       =\n}}\nEdward Alexander Root (26 June 1902 – 7 May 1986) was an Australian rugby league footballer who played in the 1920s and 1930s. A New South Wales state and Australia national representative forward, his club career was played in Sydney with South Sydney, Newtown and St. George.\nEarly life\nRoot was born in Alexandria, New South Wales on 26 June 1902. The South Sydney Sentinel reported, contemporaneous to his playing career, that Root's age was uncertain, likely owing to his underage military enlistment during World War I.\nRoot enlisted to serve with the Australian Imperial Force on 31 March 1917, then aged 14 years and nine months. The South Sydney Sentinel states that Root \"served at the front\" and the Brisbane Courier claimed he wore a returned serviceman's medal. However, according to Rugby League Project, military records show that Root was discharged in April 1917 when it was discovered he was underage.\nIt has been claimed that Root holds the distinction of being the last representative footballer to go to the Great War.\nPlaying career\nA South Sydney junior, Root started playing first grade for Souths in 1923, becoming a mainstay in the side in 1926. That year he first tasted premiership success with Souths, who also won the following two years' competitions. He was sent off in the 1926 decider against University. He made his representative debut for New South Wales in 1927 and was regularly selected for the Blues over the next six seasons. He was selected to go on the 1929–30 Kangaroo tour of Great Britain, playing in fifteen tour matches but no Tests. When the NSWRL changed the South Sydney/Newtown boundary distinction in 1930 Root spent the following season with Newtown due to the strict residential criteria of the time. He then returned to Souths and played in the back-to-back premiership-winning Souths sides of 1931 and 1932.\nIn 1935 he was signed by St. George and scored two tries in the record-breaking 91–6 win over competition newcomers Canterbury-Bankstown before later becoming the club's captain-coach. He played with Saints for two seasons before retiring. His son, Stan Root was also a St. George Dragons player between 1941 and 1950.\nDeath\nRoot died on 7 May 1986 at Brighton-Le-Sands, New South Wales,\nNotes and references\nNotes\nReferences\nSources\n* Whiticker, Alan  & Hudson, Glen (2006) The Encyclopedia of Rugby League Players, Gavin Allen Publishing, Sydney\n* Andrews, Malcolm (2006) The ABC of Rugby League Austn Broadcasting Corpn, Sydney\nExternal links\n*[http://www.yesterdayshero.com.au/PlayerProfile_Eddie-Root_7095.aspx Eddie Root at yesterdayshero.com.au]\n*[https://web.archive.org/web/20080728231909/http://www.nrlstats.com/archive/players.cfm?PlayerID=2626 Eddie Root at nrlstats.com]"
    }
  ]
}