{
  "content": [
    {
      "type": "text",
      "text": "# Edward Hawkins\n\n, c.1855]]\nEdward Hawkins (27 February 1789 – 18 November 1882) was an English churchman and academic, a long-serving Provost of Oriel College, Oxford known as a committed opponent of the Oxford Movement from its beginnings in his college.\nLife\nHe was born at Bath, Somerset, 27 February 1789. He was the eldest child of Edward Hawkins, successively vicar of Bisley in Gloucestershire and rector of Kelston in Somerset. Caesar Henry Hawkins and Francis Hawkins were his brothers. After passing about four years at a school at Elmore in Gloucestershire, Edward was sent to Merchant Taylors' School in February 1801. His father died in 1806 leaving a widow with ten children, and Edward was one of his executors. In June 1807 he was elected to an Andrew exhibition at St John's College, Oxford, and in 1811 graduated B.A. with a double first class (M.A. 1814, B.D. and D.D. 1828). In 1812 he became tutor of his college, and in 1813 he was elected fellow of Oriel.\nWith Edward Copleston, John Davison, Richard Whately, and John Keble among its fellows, Oriel was at this time a distinguished college. Hawkins remained there, first as Fellow and then as Provost, for more than sixty years. Tutor for a few months to Viscount Caulfeild, son of Francis Caulfeild, 2nd Earl of Charlemont, he was in Paris at the time of Napoleon's escape from Elba in 1815, and left that city on the morning of the day on which Napoleon entered it, 20 March. He was ordained, and in 1819 became tutor of his college. From 1823 to 1828 he was vicar of the University Church of St Mary the Virgin, Oxford, a college living. There he introduced the Sunday parochial afternoon sermon, made famous under his successor, John Henry Newman. He was select preacher to the university in 1820, 1825, 1829, and 1842, and Whitehall preacher in 1827 and 1828.\nOn 2 February 1828 Hawkins was elected by the fellows provost of Oriel, in succession to Copleston who had been appointed bishop of Llandaff. The choice lay between Hawkins and Keble, whose Christian Year had just been published; and Hawkins's election owed much to support from Edward Pusey and Newman, at that time in the college. Newman at this period was close to Hawkins. With the provostship came a canonry at Rochester Cathedral and the living of Purleigh in Essex. From 1847 to 1861 Hawkins was the first Dean Ireland's Professor of the Exegesis of Holy Scripture at Oxford.\nAs Provost he was not at ease with the undergraduates, and in his relations with the fellowship was jealous of his authority. In 1831 the three tutors, Newman, Richard Hurrell Froude, and Robert Wilberforce, wished to make some changes in the tutorial system, but Hawkins blocked them, and the three tutors resigned. He made efforts to take their place by lecturing himself and getting Renn Dickson Hampden to assist him. but the college seems to have never quite recovered their loss. As a member of the old Hebdomadal Board, dissolved in 1854, Hawkins exercised wider influence in the University. He was at first a reformer, but later resisted all change. He sided with Hampden at the time of his appointment to the Regius Professorship of Divinity in 1836, and opposed the tractarian movement. When, in February 1841, the heads of houses proposed a sentence of condemnation on the Tract 90, to become notorious, Hawkins was commissioned to draw up the document; and for several years his life was embittered by the struggle with the tractarians.\nHe was one of the heads of houses who supplied no official information to the university commissioners appointed in 1850; but when, in 1854, a new order of things was established both in the college and the university, he accepted it. In 1874 a vice-provost was on Hawkins's petition to the Visitor (the Crown) appointed at Oriel, and Hawkins, at the age of eighty-five, finally left Oxford. He retired to his house in the precincts at Rochester. He protested in vain in 1875 against the future severance of the canonry at Rochester from the provostship of Oriel, and in 1879 addressed a memorial to the Oxford University commissioners against the abolition at Oriel of the necessity for all the fellows, except three, to be in holy orders. He died, after a few days' illness, on 18 November 1882, within three months of completing his ninety-fourth year, and was buried in the cathedral cemetery at Rochester.\nWorks\nOn 31 May 1818 he preached in the university pulpit a sermon that became well known. The substance of the sermon was published in 1819, and was reprinted by the Christian Knowledge Society in 1889, with the title, A Dissertation upon the Use and Importance of Unauthoritative Tradition. John Henry Newman, who as an undergraduate heard it preached, mentioned it in his Apologia Pro Vita Sua:\nHawkins afterwards treated the same subject more fully in his Bampton lectures (1840) under the title, An Inquiry into the connected Uses of the principal means of attaining Christian Truth; these being the scriptures and the church, human reason and illuminating grace.\nHawkins edited John Milton's poetical works, with notes, and Newton's life of the poet, 4 vols. Oxford, 1824. He also published numerous sermons, including\n* 'The Duty of Private Judgment,' Oxford, 1838;\n* 'The Province of Private Judgment and the Right Conduct of Religious Inquiry,' 1861; and\n* 'The Liberty of Private Judgment within the Church of England,' 1863.\nOther works are:\n* 'Discourses upon some of the Principal Objects and Uses of the Historical Scriptures of the Old Testament,' Oxford, 1833.\n* 'A Letter ... upon the Oaths, Dispensations, and Subscription to the XXXIX Articles,' &c., 1835.\n* 'The Duty and the Means of Promoting Christian Knowledge without Impairing Christian Unity,' London, 1838.\n* 'The Apostolical Succession,' London, 1842.\n* 'The Nature and Obligation of Apostolic Order,' London, 1842.\n* 'Sermons on the Church,' London, 1847.\n* 'A Manual for Christians; designed for their Use at any time after Confirmation,' Oxford, 1826, which went through at least seven editions before 1870.\n* 'Sermons on Scripture Types and Sacraments,' London, 1851.\n* 'The Duty of Moral Courage,' Oxford, 1852.\n* 'A Letter ... upon the Future Representation of the University of Oxford,' Oxford, 1853.\n* 'A Letter ... upon a Recent Statute ... with Reference to Dissent and Occasional Conformity,' 1855.\n* 'Spiritual Destitution at Home,' Oxford, 1860.\n* 'Notes upon Subscription, Academical and Clerical,' Oxford, 1864.\n* 'Additional Notes on Subscription,' &c., Oxford, 1866.\n* 'The Pestilence in its Relation to Divine Providence and Prayer,' London, 1867.\nFamily\nHe married on 28 December 1828 Mary Ann Buckle (died 14 January 1892) who with a son and daughter survived him. Two daughters and his eldest son died before him; the latter went out on the universities' mission to Central Africa, and died in 1862 at the age of twenty-nine.\nReferences"
    }
  ]
}