{
  "content": [
    {
      "type": "text",
      "text": "# Edward Ball Wakulla Springs State Park__disambig_2\n\n| area = 6,000 acres(24 km2)\n| established =\n| visitation_num =\n| visitation_year =\n| governing_body = Florida Department of Environmental Protection\n| embedded1 =\n}}\nEdward Ball Wakulla Springs State Park is a Florida State Park in Wakulla County, Florida, United States. This 6,000 acre (24&nbsp;km2) wildlife sanctuary, located south of Tallahassee, is listed on the National Register of Historic Places, and designated a National Natural Landmark.\nHistory\nThe park draws its name from Edward Ball, the DuPont family financial manager who sold the park lands to the state of Florida. He built the lodge in 1937. His trust posthumously sold the tract to the state in 1986.\nPaleo Indians are known to have camped at the spring 12,000 years ago, where they hunted mastodons, bison, and other ancient animals. The bottom of the spring bowl is littered with bones of mastodons, giant sloths, giant armadillos, and camels. Glass bottom boat tours no longer operate due to a decrease in water clarity, but standard boat tours of the spring and river operate all year.\nFifty-four archaeological sites have been identified in the park. Excavation of part of the Wakulla Springs Lodge site (8WA329) found successive strata of artifacts from 20th century, Seminole, Fort Walton culture, Weeden Island culture, Norwood culture, Archaic, and Paleoindian occupations.\nFeatures\nThe park has three nature trail systems which lead the visitor through pine forests, bald cypress wetlands and hardwood hammock. Hikers, bicyclists and horse riders are welcome. The wildlife found in the forest includes white-tailed deer, wild turkey, and many other bird species, while American alligators, bass, gar, various snakes, and West Indian manatee (during the winter) populate the springs, swamps, and river.\nIt contains Wakulla Springs, one of the world's largest and deepest first-order freshwater springs and an exit point of the Floridan Aquifer. Wakulla Springs' highest outflow has been measured at 860,000 U.S. gallons per minute (54 m3/s). The spring's average flow is about 400,000 US gallons per minute (25 m3/s). The opening of the spring is 180 feet (55 m) down, through which cave divers, especially those of the Woodville Karst Plain Project have explored many miles of its underwater tunnels. The spring gives rise to Wakulla River which flows several miles to the south where it empties into the Gulf of Mexico.\nSally Ward Spring and Cherokee Sink are located within the Park, while Leon Sinks Geological Area is nearby and part of the same karst system.\nThe Park contains the Wakulla Springs Lodge, which functions as a hotel.\nRecreational activities\nThe park has such amenities as birding, boat tours (water contamination makes glass-bottomed boat tours now rare), cabins, hiking, horse trails, picnicking areas, snorkeling, swimming, and wildlife viewing. An interpretive exhibit and concessions are also available\nSee also\n* Wakulla Springs\nNotes\nReferences\n*\nExternal links\n* [https://www.floridastateparks.org/parks-and-trails/edward-ball-wakulla-springs-state-park Edward Ball Wakulla Springs State Park] at [https://www.floridastateparks.org Florida State Parks]"
    }
  ]
}