{
  "content": [
    {
      "type": "text",
      "text": "# Edward Sacheverell Chandos-Pole (1826–1873)\n\n| birth_place = Radbourne Hall, Derby, Derbyshire\n| death_date  =\n| death_place = Radbourne Hall, Derby, Derbyshire\n| education   = Eton College\n| alma_mater  = Balliol College, Oxford\n| spouse      =\n| parents     = Edward Sacheverell Chandos-PoleAnna Maria Wilmot\n| children    = 11\n}}\nEdward Sacheverell Chandos-Pole JP DL (10 January 1826 – 30 November 1873) was an English landowner and barrister who served as High Sheriff of Derbyshire.\nEarly life\nRadbourne Hall\nChandos-Pole was born at Radbourne Hall, Derby, Derbyshire on 10 January 1826. He was the eldest son of Edward Sacheverell Chandos-Pole and Anna Maria Wilmot.  His younger brother, Henry, took the arms and surname Gell when he succeeded to the estate at Hopton Hall. His sister, Charlotte, married Hon. John Yarde-Buller (a son of the 1st Baron Churston), and other sister, Eleanor, married Vice-Admiral Henry Bagot (a son of Rt. Rev. Hon. Richard Bagot).\nHis paternal grandparents were Mary Ware and Sacheverell Pole, who later adopted the additional surname of Chandos, in 1807.  His maternal grandparents were the Rev. Edward Sacheverell Wilmot and Anne ( Chambers) Wilmot.\nHe was educated at Eton College and Balliol College, Oxford.\nCareer\nA Barrister-at-Law, Chandos-Pole was called to the bar by the Honourable Society of the Middle Temple in Hilary term 1867. He was a Justice of the Peace and Deputy Lieutenant for Derbyshire. Upon his father's death in 1863, he inherited the family property of Radbourne Hall. Like his father before him, he served as High Sheriff of Derbyshire in 1867.\nChandos-Pole was part of a coaching revival which began with Capt. Hayworth, the Charles Somerset, 8th Duke of Beaufort, and others, in 1866.\nPersonal life\nin Vanity Fair, 1888]]\nOn 13 November 1850, he married Lady Anna Caroline Stanhope (1832–1914), elder daughter of Leicester Stanhope, 5th Earl of Harrington and Elizabeth Williams Green. Together, they were the parents of at least eleven children, including:\n* Reginald Walkeline Chandos-Pole (1853–1930), who married Violet Katharine Beckett-Denison, daughter of William Beckett-Denison (a younger son of Sir Edmund Beckett, 4th Baronet) and Hon. Helen Duncombe (a daughter of the 2nd Baron Feversham), in 1882. After her death in 1883, he married Inez Blanche Marie Clothilde Eva Arent in 1898.\n* Anna Maria Chandos-Pole (1855–1944), who died unmarried.\n* Evelyne Chandos-Pole (1856–1875), who died unmarried.\n* Carolina Chandos-Pole (1857–1911), who married Lord Claud John Hamilton, son of James Hamilton, 1st Duke of Abercorn and Lady Louisa Jane Russell (a daughter of the 6th Duke of Bedford), in 1878.\n* John Chandos-Pole (1858–1909), who died unmarried.\n* Edward Ferrers Chandos-Pole (1859–1907), who died unmarried.\n* Samuel Chandos-Pole (1861–1901), who married Kathleen Annie Thurburn in 1889. They divorced in 1899.\n* Mary Chandos-Pole (1863–1914), who married Baron Nicolas Pilar von Pilchau, in 1886. They divorced.\n* Francis Chandos-Pole (1864–1917), who died unmarried.\n* Margaret Chandos-Pole (1866–1935), who married Rev. John Adolphus Liddell Fellowes, a son of the Rev. Thomas Lyon Fellowes and brother to Edward Fellowes, in 1918.\n* Alianore Chandos-Pole (1868–1952), who married Capt. Sir Wroth Lethbridge, 5th Baronet, son of Sir Wroth Lethbridge, 4th Baronet and Ann Williams Benyon, in 1892. They divorced in 1911 and she married her first cousin, Hon. Walter Yarde-Buller, son of Hon. John Yarde-Buller and Charlotte Chandos-Pole, in 1913.\nChandos-Pole died at Radbourne Hall on 30 November 1873, and was buried at St Andrews Churchyard in Radbourne.\nDescendants\nThrough his eldest son Reginald, he was a grandfather of John Walkelyne Chandos-Pole (1913–1994), who served as High Sheriff of Derbyshire in 1959.\nReferences\nExternal links\n*[https://discovery.nationalarchives.gov.uk/details/c/F40218 Pole, Edward Sacheverell Chandos-, (1826-1873), High Sheriff of Derbyshire] at The National Archives (United Kingdom)"
    }
  ]
}