{
  "content": [
    {
      "type": "text",
      "text": "# Edward Shatov\n\nEdward Shatov, Augustinians of the Assumption (born on 10 October 1973, Vladimir Oblast, USSR) is a Russian Catholic priest and a Catholic convert from Russian Orthodoxy.\nBiography\nShatov was born in a small village in the Vladimir Oblast and was baptized as an infant in the Russian Orthodox Church. In 1995, he graduated from the Faculty of History of the Vladimir Pedagogical University, while still a student he interested in Catholicism. While working at the State Library in Moscow, Shatov went to the church of Saint Louis, where he had frequent contact with the abbot Bernard Le Leannekom, AA. In 1995, after his graduation, Edward converted to Roman Catholicism from Russian Orthodoxy and decided to become an Assumptionist Catholic monk. The first year of formation held in Romania, in the monastic community, he studied French and Romanian languages. He then left for France, where there was a novitiate. He studied at the Catholic Institute of Paris, which holds a Bachelor of Theology. After graduation, he continued his studies in London. On 18 November 2000, Shatov made the eternal vows. On November 16, 2002, Auxiliary Bishop of Westminster, Monsignor James Joseph O'Brien, ordained brother Edward to the diaconate. On 8 November 2003, he was ordained to the priesthood by Bishop Tadeusz Kondrusiewicz in Roman Catholic Church of Saint Louis. Father Shatov is the director of the Center for Family of the Roman Catholic Archdiocese of Mother of God at Moscow.\nReferences\nExternal links\n* [http://www.procatholic.ru/index.php?option=com_content&view=article&id=101:-q-q&catid=35:2008-02-12-20-45-58&Itemid=63 Procatholic.ru]\n* [http://www.bogoslov.ru/persons/474997/index.html Bogoslov.ru]\n* [http://www.russ.ru/Mirovaya-povestka/Garri-Potter-sekret-vnutri Russ.ru]\n* [http://www.cathmos.ru/content/ru/publication-2009-07-27-12-37-12.html Cathmos.ru]\n* [http://regions.ru/news/2190151/ Regions.ru]"
    }
  ]
}