{
  "content": [
    {
      "type": "text",
      "text": "# Edward Alden Egery\n\nEdward Alden Egery (November 11, 1851 – ?) was an American printer, newspaper editor and insurance agent from Racine, Wisconsin, who served a single one-year term as a member of the Wisconsin State Assembly.\nBackground\nHe was born in Three Rivers, Michigan, on November 11, 1851, and was educated in the public schools there.\nHe went to work in a printing office at an early age, and took up the printer's trade. In 1876 he married Emeline Woolnough, the youngest daughter of W. W. Woolnough, of Battle Creek, Michigan, a newspaper editor and former state legislator himself. He moved to Wisconsin in 1878 and settled in Racine, becoming the editor of the Racine Daily Argus, which ceased publication in January 1881.\nPublic office\nEgery was nominated in 1886 as the candidate of the Wisconsin People's Party, sometimes called the Labor Party for the 1st Racine County Assembly district (the City of Racine). He was then endorsed by the Democrats, which is why he is sometimes listed in historical documents as a Democrat. He was elected with 1,808 votes, to 1,354 for Republican incumbent Louis Christian Klein, and 162 for Prohibitionist Eugene Leach. He was assigned to the standing committee on engrossed bills. He was not a candidate in 1888, and was succeeded by Republican Alfred L. Buchan.\nAfter the Legislature\nEgery became an insurance agent in West Superior, Wisconsin, and in 1892 was accused of embezzling money from two insurance companies which he represented. He was arrested in Canada, where he was traveling under the name \"Edward Alden\". His wife was said to be living somewhere in Michigan, but he refused to divulge where. Although he claimed the whole thing was a matter of dispute and animus, he was convicted on August 11, 1892, and sentenced to one year in the state penitentiary. He was pardoned in May 1893 by Governor George Peck on the recommendation of the judge and district attorney in his case, on the grounds that there were \"no aggravating but many extenuating circumstances\" and that the sentence had been excessive.\nIt is unclear what happened to Egery after his pardon, but he eventually went back to newspaper work. In 1910, he is listed as editor of the Olivet Leader in Olivet, South Dakota., but left the Leader by October 1910 for Antigo, Wisconsin. In March 1911, it was announced that he was leaving a position as editor and manager of the Antigo Weekly News Item to become editor of the Wausau Sun. From 1911-1912, he was editor of the Abbotsford Clarion in Abbotsford, Wisconsin, in Clark County; he is mentioned in October 1912 as having been at the Phillips Bee in Price County.\nEgery was reported to have died in Rib Lake \"in the latter part of March\" of 1914.\nEmeline Egery returned to Battle Creek, and after 25 years as a reporter and 20 years of retirement, died June 18, 1940, from complications of a broken hip; no mention of Egery is made in her lengthy obituary.\nReferences"
    }
  ]
}