{
  "content": [
    {
      "type": "text",
      "text": "# Edward S. Ayensu\n\n| birth_place       = Sekondi, Western Region\n| death_date        =\n| death_place       =\n| citizenship       = Ghanaian\n| nationality       = Ghanaian\n| fields            =\n| workplaces        =\n| alma_mater        =\n| thesis_title      = Vegetative anatomy and taxonomy of the dioscoreaceae\n| thesis_url        = https://worldcat.org/en/title/681131864\n| thesis_year       = 1966\n| doctoral_advisor  =\n| academic_advisors =\n| doctoral_students =\n| notable_students  =\n| known_for         =\n| author_abbrev_bot =\n| author_abbrev_zoo =\n| influences        =\n| influenced        =\n| awards            =\n| signature         =\n| signature_alt     =\n| footnotes         =\n}}\nEdward Solomon Ayensu (August 28, 1935 – April 22, 2023) was a Ghanaian life scientist and professor. He was an international development advisor on science, technology and economic development. He was a founding Fellow of the African Academy of Sciences.\nEducation\nAyensu was born in Sekondi in Western Region of Ghana on 28 August 1935. Ayensu obtained his doctorate from the University of London, and was appointed a visiting fellow at Wolfson College, Oxford University. His doctoral research considered the taxonomy of dioscorea.\nCareer\nIn 1978, the Smithsonian Institution established the Office of Biological Conservation, with Ayensu as director. Here he was responsible for the Smithsonian conservation activities, and the development of new conservation initiatives. Here he wrote \"Endangered and Threatened Plants of the United States.\"\nAyensu held many leadership positions in African sciences, including acting as the Chairman of the Presidential Advisory Council on Science, Technology and Innovation (PACSTI) Ghana, chairman of the board of trustees of the African Institute for Mathematical Sciences (AIMS) Ghana, chairman of the board of trustees of the Accra Institute of Technology (AIT) and president of the Energy Globe Foundation. He was Chairman of the World Bank Inspection Panel; chairman of the Council for Scientific and Industrial Research (CSIR) Ghana; senior advisor to the president and director of Central Projects Department, African Development Bank and President of the Pan-African Union for Science and Technology. He was also formerly member of the board of trustees of the UN University for Peace, member of the advisory board of the Sustainable Forestry Management Limited (SFM) and secretary-general of the International Union of Biological Sciences and he was the founding chairman of the African Biosciences Network.\nHonours and recognition\nIn addition to being a Fellow of the Ghana Academy of Arts and Sciences, Ayensu was a Foreign Fellow of the India National Sciences Academy, Fellow of TWAS Academy of Sciences for the Developing World, Founding Fellow of the African Academy of Sciences and Fellow of the New York Academy of Sciences. He was awarded the TWAS Medal in Biology in 2004.\nHe travelled extensively the world over for field research in the biological sciences and workshops, meetings and conferences on environment and development; and as a consultant on science and technology for development especially in agro-industries, energy and mining in developing countries and the promotion of private sector initiatives in Africa.\nAyensu has authored many books and published numerous scientific and technical papers.  In 1997 he authored a book named Ashanti Gold.\nPersonal life\nHis mother, Grace Ayensu was a member of parliament during the first republic. He was a prolific writer and an amateur photographer.\nReferences\nExternal links\n* [https://edwardayensu.com https://www.edwardayensu.com]"
    }
  ]
}