{
  "content": [
    {
      "type": "text",
      "text": "# Edward Shortt\n\nEdward Short}}\n| birth_place =\n| death_date =\n| death_place = Kensington, London, England\n| nationality = British\n| party = Liberal\n| alma_mater = University College, Durham (BA)\n| spouse = Isabella Stewart Scott\n}}\nEdward Shortt, KC (10 March 1862 – 10 November 1935) was a British lawyer and Liberal Party politician. He served as a member of David Lloyd George's cabinet, most significantly as Home Secretary from 1919 to 1922.\nBackground and education\nShortt was born in Newcastle upon Tyne and was the son of the Church of England vicar Rev. Edward Shortt of Woodhorn, Northumberland. Though born and bred in England, Shortt came from a family with roots in County Tyrone. Shortt was educated at Durham School, where he was a King's scholar and competed for the school boat club. He continued his education at the neighbouring Durham University, where he was Lindsay scholar at University College and for two years competed for Durham University Boat Club. He did not excel academically, taking a gentleman's degree in Classics in 1884.\nShortt had three brothers. One, Dr William Rushton Shortt, was a surgeon who acted as a Civil Surgeon to the Natal Field Force during the Second Boer War and was present at the Relief of Ladysmith. However, his health having declined in South Africa, he was forced to retire early, and died in November 1913. An older brother, the Rev. Joseph Rushton Shortt (1860–1919), having previously attended Exeter College, Oxford, joined the Durham University staff as a lecturer in Classics and was Bursar of Hatfield College from 1889 to 1898.\nLegal career\nHe was called to the Bar at the Middle Temple in 1890 and practised on the North Eastern Circuit. He soon acquired a large junior practice in both civil and criminal cases, with his 'breezy personality' making him an effective advocate in front of juries. His business being mostly in the North East, he was little known in London at this time. He was appointed as Recorder (part-time judge) of Sunderland in 1907 and took silk in 1910.\nPolitical career\nShortt became active in politics for the Liberal Party. In 1908, Shortt was an unsuccessful candidate for Newcastle upon Tyne in a by-election, losing a seat previously held by the party when the Social Democratic Federation put up a candidate against him. However, in the January 1910 election he was elected, and remained an MP until 1922, transferring in 1918 to the new Newcastle upon Tyne West constituency.  Within the Liberal Party, Shortt allied with David Lloyd George in the party split which occurred between him and H. H. Asquith. When Lloyd George came to power in 1916, Shortt was soon appointed to the government.\nChief Secretary of Ireland\nShortt took an active interest in Irish affairs and became known for his frequent interventions during the debates over the Third Home Rule Bill. His appointment to chair a Select committee to review the operation of the Military Service Acts proved to be the turning-point in his political career. The public hearings of this committee, with witness after witness coming forward to tell stories of medical and administrative chaos, caused a major political storm and sounded the end of the old system. In August 1917 the committee produced a report whose main recommendation was the transfer of medical examinations of recruits from the War Office to a civilian authority. This apparently impressed Lloyd George, and would lead to the advancement of Shortt's career after several years of relative obscurity in public life. In May 1918, Lloyd George appointed him as Chief Secretary for Ireland, at a pivotal stage in the First World War and when Irish Republicanism was on the increase. Taking to this new role with great energy and, suspicious of any alleged German intrigue to encourage sedition, he had 150 members of Sinn Féin arrested as a precaution.\nThe government had also decided to introduce conscription in Ireland to provide more soldiers for the Western Front, linked to support for Irish home rule, but still found that opposition to the British increased. Shortt gave his support to an unusual plan to encourage Irish soldiers to join the French army, while persuading the Roman Catholic hierarchy in Ireland to support conscription. However, both parts of the plan collapsed due to infighting within the government and the military establishment. Conscription was never implemented in Ireland.\n]]\nHome Secretary\nOnce the war was over, Shortt was promoted to Home Secretary in January 1919, during the middle of a police strike.\nOn the issue of the fate of enemy aliens who had been detained on the outbreak of war, he resisted demands made by Charles Yate in February 1919 that all foreign waiters on strike should be immediately deported, arguing that 'the fact that an alien takes part in a strike in company with British subjects of the same occupation is not alone a sufficient reason for his deportation'. Shortt oversaw the deportation of the Estonian anarchist Eduard Sõrmus, the so-called 'Red Violinist', who was ultimately removed from the country on 15 February 1919.\nIn a November 1919 meeting with representatives from the Board of Deputies of British Jews Shortt rejected their proposals for an appeal to a judge in chambers prior to the making of a deportation order, arguing that the necessity of tackling political subversives in the aftermath of the Great War depended on the government holding on to what he described as 'abnormal' powers. He also reprieved Ronald True, who had been condemned to death for murder, after finding the issue of his sanity in doubt. He was unpopular with some people in Parliament because of his regional partiality: tending to appoint barristers from the North East to many top posts.\nShortt was in favour of denying entry to Mormon missionaries, with the Home Office believing such a policy would prove unpopular with the public. Malcolm R. Thorp has suggested that Shortt's position as Recorder of Sunderland before he entered parliament may have influenced his feelings, as Sunderland experienced anti-Mormon riots in 1912, which Shortt presumably witnessed. These experiences could have convinced him that a more generous policy towards the Church of Jesus Christ of Latter-day Saints would have prompted renewed violence.\nWhen Lloyd George's coalition government fell in October 1922 in the aftermath of the Carlton Club meeting, he realised his Cabinet career was effectively over and stood down from Parliament.\nCareer after Parliament\nHe subsequently held a number of official posts, including the chairmanship of the committees on the rating of machinery, trusts, heavy motor traffic, and the investigation into the Agricultural Marketing Act.\nIn November 1929, Shortt was appointed as second President of the British Board of Film Censors (BBFC) succeeding T.P. O'Connor. This was an odd appointment as Shortt had no real interest and actively disliked sound films, and was also known to be critical of Hollywood.\nThe Board had been set up by the film industry and had no statutory role (local councils being technically responsible for judging who could see a film) but in practice its rulings were always obeyed. In March 1930 the BBFC rejected Her Unborn Child after a viewing by Shortt. This was the first time that the BBFC had been presented with a film that depicted the act of childbirth, and the decision to reject was never reversed. At the time, educational bodies were keen to exploit the emergence of sound films in Europe with serious scientific films. After academic pressure, Shortt would soften his position later that year and the BBFC would become more open to such productions. One beneficiary was the 1927 German film Nature and Love.\nShortt, however, generally followed previous policy of a highly restrictive licensing. In the Board's report for 1931, he outlined his concern about the increasing number of films dealing with sexual topics, and promised further restrictions. In 1932 he rejected the Tod Browning film Freaks, a ban that would not be lifted until 1963. The following year he had to contend with Island of Lost Souls by the American director Erle C. Kenton, which had already caused some controversy in the US over its alleged portrayal of cruelty to animals. Consequently, Shortt was concerned enough to view the film himself instead of one of his censors, and he imposed a ban throughout the country. He banned 120 films in five years and in 1932 ordered cuts to 382, a record number; one of which was Red-Headed Woman, starring Jean Harlow. He also introduced the 'H' rating (for horror), which was the origin of the later X rated film.\nShortt was very upfront about the power of cinema to shape public opinion:\n:There is in our hands as citizens an instrument to mould the minds of the young, to mould the mind of the adolescent, and to create great and good and noble citizens for our future. There is the instrument right to our hands. If we control it, if we work public opinion up to the pitch of controlling it properly, there is a great future for our old country, and I cannot understand why with our united cooperation, we should not finally attain to that perfect ideal.\nIn the last year of his life he founded the security firm Nightwatch Services, which would later develop into Securicor. His company was one of the first specialist security firms to be established in the modern era, and provided guarding services.\nAssessment\nShortt was described by John Maynard Keynes in The Economic Consequences of the Peace as 'a capable but obstinate man too much bound to preconceived opinions', though Michael Bentley wryly notes that such qualities may have been useful in his position as President of the BBFC.\nHe was 'sociable, good-humoured and well-meaning', remembered affectionately as 'Teddie' in his native Newcastle, though very much shaped by his traditional 19th century education and experience. Liberal in politics, he was paternalistic in matters of human behaviour, art, and entertainment.\nPersonal life\nShortt married Isabella Stewart Scott, who had been born in Valparaiso, Chile to British parents. They had one son, Lieutenant William Edward Dudley Shortt, who was killed on 12 October 1917 while serving as a junior officer with the Scots Guards at the Battle of Passchendaele. He also had three daughters, including Doreen Ingrams. His old university, Durham, conferred the honorary degree of DCL upon him in 1920.\nShortt was an active freemason and was a member of University of Durham Lodge no. 3030, a London-based masonic lodge formed for alumni of Durham University. He served as Worshipful Master of the lodge in 1919 and again in 1926 and 1927.\nHe died on 10 November 1935 at his home in London, 140 Oakwood Court in Kensington at the age of 73. His obituary in The Times described the cause of death as blood poisoning after influenza.\nAt the time of his death he was President of Den Norske Klub.\nSee also\n* List of MPs elected in the January 1910 United Kingdom general election\n* List of Home Secretaries\n* List of Durham University people\nReferences\n*\nExternal links\n*"
    }
  ]
}