{
  "content": [
    {
      "type": "text",
      "text": "# Edward Stanley, 11th Earl of Derby\n\n| birth_place =\n| death_date  =\n| death_place =\n| occupation  =\n| education   =\n| nationality =\n| movement    =\n| family = Stanley\n| father      = Sir Thomas Stanley, 4th Baronet\n| spouse      = Elizabeth Hesketh\n| children    = James Smith-Stanley, Lord Strange\n}}\nEdward Stanley, 11th Earl of Derby (27 September 1689 – 22 February 1776), known as Sir Edward Stanley, 5th Baronet, from 1714 to 1736, was a British nobleman, peer, and politician.\nDerby was the son of Sir Thomas Stanley, 4th Baronet, and Elizabeth Patten of Preston, and succeeded his father in the baronetcy in 1714. This branch of the Stanley family, known as the \"Stanleys of Bickerstaffe\", were descended from Sir James Stanley, younger brother of Thomas Stanley, 2nd Earl of Derby.\nHe was appointed High Sheriff of Lancashire in 1723. He was elected to the House of Commons for Lancashire in 1727, a seat he held until 1736, when he succeeded his distant relative James Stanley, 10th Earl of Derby, as eleventh Earl of Derby, and took his seat in the House of Lords. He later served as Lord Lieutenant of Lancashire from 1741 to 1757 and again from 1771 to 1776.\nAs Lord Lieutenant, Derby was ordered to embody the Lancashire Militia in September 1745 after the government's forces had been defeated by the Jacobite rebels at the Battle of Prestonpans. The regiments had not been called out for training for 30 years, and Derby and his deputy lieutenants scrambled to raise money and find officers who could train the raw troops. Derby was appointed Colonel on 25 October and by 5 November he had assembled one regiment of eight companies. The regiment guarded Liverpool while the Jacobites marched through Lancashire to Derby, and one of its detached companies harried the Jacobites during their subsequent retreat. The regiment was disembodied in January 1746 when the crisis had passed.\nLord Derby married Elizabeth Hesketh, daughter of Robert Hesketh, in 1714. He died in February 1776, aged 86, and was succeeded in the earldom by his grandson Edward, his son James Smith-Stanley, Lord Strange, having predeceased him. His daughter, Lady Charlotte Stanley, married General John Burgoyne. His great-great-grandson Edward Smith-Stanley, 14th Earl of Derby, was three times Prime Minister of the United Kingdom.\n}}\nNotes\nReferences\n* ''Burke's Peerage, Baronetage and Knightage, 100th Edn, London, 1953.\n*Kidd, Charles, Williamson, David (editors). Debrett's Peerage and Baronetage'' (1990 edition). New York: St Martin's Press, 1990.\n* [https://books.google.com/books?id=V6GgAAAAMAAJ Maj R.J.T. Williamson & Col J. Lawson Whalley, History of the Old County Regiment of Lancashire Militia, London: Simpkin, Marshall, 1888.]\n*\n*[http://www.thepeerage.com/p1382.htm#i13815 Elizabeth Hesketh], [http://www.thepeerage.com The Peerage]. Accessed 4 July 2017.\n*[http://www.thepeerage.com/ www.thepeerage.com]\n|-"
    }
  ]
}