{
  "content": [
    {
      "type": "text",
      "text": "# Edward Ardizzone\n\n| birth_place = Haiphong, Tonkin, French Indochina\n| death_date =\n| death_place = Rodmersham Green, Kent, England\n| occupation = Artist, illustrator, writer\n| nationality = British\n| period =\n| genre = Children's books\n| movement =\n| notableworks = Tim All Alone (1956) Stig of the Dump (1963)\n| pseudonym = Diz\n| spouse =\n| influences =\n| influenced =\n| signature =\n| website =\n| relatives = Christianna Brand (cousin)\n}}\nEdward Jeffrey Irving Ardizzone,  (16 October 1900 – 8 November 1979), who sometimes signed his work \"DIZ\", was a British painter, printmaker and war artist, and the author and illustrator of books, many of them for children. For Tim All Alone (Oxford, 1956), which he wrote and illustrated, Ardizzone won the inaugural Kate Greenaway Medal from the Library Association for the year's best children's book illustration by a British subject. For the 50th anniversary of the Medal in 2005, the book was named one of the top ten winning titles, selected by a panel to compose the ballot for public election of an all-time favourite.\nEarly life\nArdizzone's father, Auguste Ardizzone, was a naturalised Frenchman of Italian descent, who was born a Pied-Noir in French Algeria, then a colony of France, and worked on overseas government service elsewhere in the French colonial empire. Ardizzone's mother, Margaret, was English. Her father, Edward Alexander Irving, was assistant colonial secretary of the Straits Settlements, in what is now known as Singapore, as well as the Malaysian states of Penang and Malacca. Edward Ardizzone was born in the port city of Haiphong, Tonkin, in the north of French Indo-China, a city now in Vietnam, while his father was working for the Eastern Extension Telegraph Company.\nIn 1905, Margaret Ardizzone returned to England with her three eldest children. They were brought up in Suffolk, largely by their maternal grandmother, while Margaret returned to join her husband in the Far East. The Ardizzone family lived in Corder Road, Ipswich, between 1905 and 1910, and then in Gainsborough Road from 1911 to 1912. Ardizzone was educated first at Ipswich School and then, from 1912, at Clayesmore School, a boarding school in Dorset. At Clayesmore, his interest in drawing was encouraged by an art teacher.\nEarly career\nArdizzone left school in 1918 and twice tried to enlist in the British Army but was refused. After spending six months at a commerce college in Bath, Ardizzone spent several years working as an office clerk in both Warminster and London, where he began taking evening classes at the Westminster School of Art, which were taught by Bernard Meninsky. In 1922, Ardizzone became a naturalised British citizen. While working as an office clerk, Ardizzone had spent his weekends and free time painting and in 1926, with financial support from his father, gave up his office job to concentrate on establishing himself as a professional, freelance artist.\nArdizzone's first major commission was to illustrate an edition of In a Glass Darkly by Sheridan Le Fanu in 1929. He also produced advertising material for Johnnie Walker whisky, and illustrations for both Punch and The Radio Times, including the 1937 and 1948 Christmas covers of the latter. The first book by Ardizzone listed by the US Library of Congress is The Mediterranean: An Anthology (London: Cassell, 1935, OCLC 2891569), compiled by Paul Bloomfield, \"decorated by Edward Ardizzone\" with \"each chapter preceded by illustrated half-title\". In 1936, he inaugurated his best-known work, the Tim series of books, featuring the maritime adventures of its eponymous young hero, which he both wrote and illustrated. Little Tim and the Brave Sea Captain was published by Oxford University Press in both London and New York that year. In 1939, he illustrated the first of a series of four Mimff children's books by H.J.Kaesar.\nBy 1939 Ardizzone was regularly holding one-man exhibitions at the Bloomsbury Gallery and, later, the Leger Gallery. At this time the major theme of his paintings was life in London, with affectionate illustrations of the pubs and parks near his home in Maida Vale. His style was naturalistic but subdued, featuring gentle lines and delicate watercolours, with great attention to particular details.\nSecond World War\nOpera house, 1943]]\nin his diary on 26 April 1945: 'To Bremen again with Brian de Grineau']]\nIn the Second World War, after a short spell serving in an anti-aircraft unit, Ardizzone was assigned to the War Office by the War Artists' Advisory Committee and posted overseas as a full-time official war artist. He first served with the British Expeditionary Force and depicted its retreat through France and Belgium before he was evacuated back to Britain from Boulogne in May 1940. In Britain, he recorded troops at their training camps and spent nights sketching in the London Underground, where tube tunnels were being used as air-raid shelters during the Blitz. Ardizzone spent the early part of 1941 travelling around Scotland. In January 1942, he recorded the arrival of American troops in Northern Ireland. In March of that year, he went to Cairo and joined the British First Army on its march to Tunisia, and then joined the Eighth Army. By July 1943, Ardizzone was in Sicily, where he witnessed combat at close quarters, and unusually for him, painted the aftermath of the fighting. He travelled on through Italy with the Eighth Army until April 1944, when he flew to Algiers, from where he sailed back to Britain. In June 1944, he went to France during the Allied invasion, but by September 1944 was back in Italy. He again travelled widely there and witnessed the fall of Reggio Calabria and Naples. He spent the winter of 1944 in Italy before travelling to Germany for the final months of the War. By the time Ardizzone returned to England in May 1945 he had completed almost 400 sketches and watercolours of the War, most of which, along with his wartime diaries, are held at the Imperial War Museum. His early experiences between Arras and Boulogne are illustrated and described in his book Baggage to the Enemy (London 1941), while Diary of a War Artist, published in 1974, described his later experiences during the conflict.\nPost-war career\nAfter the War, Ardizzone resumed his freelance career and received commissions from The Strand Magazine for cover artwork, from the Ealing film studios for promotional material and from the Guinness company for adverts. Ardizzone was commissioned to produce a watercolour portrait of Winston Churchill and continued to write and illustrate books. The most famous Tim book is the inaugural Greenaway Medal-winner, Tim All Alone (Oxford, 1956). The series continued until 1972 with ''Tim's Last Voyage which was followed in 1977 by Ship's Cook Ginger''.\nBesides writing and illustrating his own books, Ardizzone also illustrated books written by others, including some editions of Anthony Trollope and H. E. Bates's My Uncle Silas. He illustrated the C. Day Lewis children's novel, The Otterbury Incident (1948). One of his happiest collaborations was that with Eleanor Farjeon, especially on The Little Bookroom (Oxford, 1955 collection). Ardizzone illustrated some novels by the American author Eleanor Estes, including Pinky Pye, The Witch Family, The Alley, Miranda the Great, and The Tunnel of Hugsy Goode (1958 to 1972). In 1962, he illustrated an edition of J. M. Barrie's Peter Pan, retold by Eleanor Graham, and A Ring of Bells (1962), John Betjeman's abridged version for children of his autobiographical poem Summoned by Bells (1960).\nFor illustrating Titus in Trouble, written by James Reeves, Ardizzone was a commended runner-up for the 1959 Greenaway Medal. Ardizzone is particularly noted for having not just illustrated the covers and contents of books, but inked in the title text and author's name in his own hand, giving the books a distinctive look on shelves. An example is Clive King's Stig of the Dump from 1963. The Nurse Matilda series of children's books (1964–74) was written by his cousin Christianna Brand, who was seven years younger. Their shared grandmother had told the stories to both cousins and she had learned them from her father.\nEarly in the 1970s, Ardizzone illustrated a new edition of the 20-year-old Little books by Graham Greene: The Little Train, The Little Fire Engine, The Little Horse Bus, and The Little Steamroller. He also illustrated a re-telling of the Don Quixote story for children by James Reeves and his illustrations for The Land of Green Ginger by Noel Langley are regarded as classics in their own right. His 1970 autobiography, The Young Ardizzone - an autobiographical fragment, was illustrated with his own drawings.\nArdizzone also illustrated several telegrams for the Post Office in the 1950s and 1960s, many of which are considered collector's items. He also held a number of teaching posts, working part-time as an instructor in graphic design at Camberwell School of Art and as a visiting tutor at the Royal College of Art. In 1960 he retired from his teaching posts and began spending more time at Rodmersham Green in Kent before moving there permanently in 1972. In 1929, Ardizzone married Catherine Josephine Berkley Anderson (1904-1992), and the couple had two sons and a daughter. Ardizzone died of a heart attack in 1979 at his home in Rodmersham Green. After Catherine's death in 1992, the British government accepted 64 of Ardizzone's sketchbooks in lieu of inheritance tax, and these are now held by the Ashmolean Museum in Oxford. The British Library published an illustrated bibliography of his works in 2003. A blue plaque unveiled in 2007 commemorates Ardizzone's home at 130 Elgin Avenue in Maida Vale.\nSelected works\nBooks written and illustrated by Ardizzone\nFront cover of Stig of the Dump (1971 paperback with original cover art)\n* Little Tim and the Brave Sea Captain (1936)\n* Lucy Brown and Mr Grimes (1937)\n* Tim and Lucy Go to Sea (1938)\n* Baggage to the Enemy (1941)\n* Nicholas and the Fast-Moving Diesel (1947)\n* Paul, the Hero of the Fire (1948)\n* Tim to the Rescue (1949)\n* Tim and Charlotte (1951)\n* Tim in Danger (1953)\n* Tim All Alone (1956) - Kate Greenaway Medal winner, 1956\n* Johnny the Clockmaker (1960)\n* ''Tim's Friend Towser (1962)\n* Peter the Wanderer (1963)\n* Diana and her Rhinoceros (1964)\n* Tim and Ginger (1965)\n* Sarah and Simon and No Red Paint (1966)\n* The Little Girl and the Tiny Doll (with Aingelda Ardizzone) (1966)\n* Tim to the Lighthouse (1968)\n* The Young Ardizzone - An Autobiographical Fragment (1970)\n* The Wrong Side of the Bed (1970)\n* Johnny's Bad Day (1970)\n* Tim's Last Voyage (1972)\n* The Old Ballad of the Babes in the Wood (1972)\n* Diary of a War Artist (1974)\n* Ship's Cook Ginger (1977)\n* Indian Diary 1952-53 (1984)\nBooks by others, illustrated by Ardizzone\n* In a Glass Darkly, (1929), by Sheridan Le Fanu\n* The Library, (1930), by George Crabbe\n* A Mediterranean Anthology, (1935), by Paul Bloomfield\n* Tom, Dick, and Harriet, (1937), by Neil Lyons\n* My Uncle Silas, (1939), by H E Bates\n* The Local, (1939), by Maurice Gorham\n* Great Expectations, (1939), by Charles Dickens\n* Mimff, (1939), by H. J. Kaeser\n* The Battle of France, (1940), by Andre Maurois, translated by F.R. Ludman\n* The Road to Bordeaux, (1941), by Dennis Freeman and Douglas Cooper\n* Peacock Pie: A Book of Rhymes, (1946), by Walter de la Mare\n* Poems of François Villon, (1946), translated by H. B. McCaskie\n* The Pilgrim's Progress, (1947), by John Bunyan\n* Hey Nonny Yes: passons and conceits from Shakespeare, (1947), by Hallam Fordham\n* Three Brothers and a Lady, (1947), by Margaret Black\n* Desbarollda, The Waltzing Mouse, (1947), by Noel Langley\n* Charles Dickens' Birthday Book, (1948), by Enid Dickens-Hawksley\n* The Otterbury Incident, (1948), by Cecil Day-Lewis\n* Jubilee Book, (1948), by Leonard Daniels\n* Back to the Local, (1949), by Maurice Gorham\n* Mimff in Charge, (1949) by H.J.Kaeser\n* Showmen and Suckers, (1951), by Maurice Gorham\n* Londoners, (1951), by Maurice Gorham\n* The Blackbird in the Lilac, (1952), by James Reeves\n* The Warden, (1952), by Anthony Trollope\n* Barchester Towers, (1952), by Anthony Trollope\n* Mimff Takes Over, (1954), by H.J.Kaeser\n* The Newcomes, (1954), by William Thackeray, edited by Arthur Pendennis, introduction by Angela Thirkell\n* The Fantastic Tale of the Plucky Sailor and the Postage Stamp, (1954), by Stephen Corrin\n* David Copperfield, (1954), by Charles Dickens\n* Bleak House, (1954), by Charles Dickens\n* The Little Bookroom, (1955), by Eleanor Farjeon\n* The Suburban Child, (1955), by James Kenward\n* Pictures on the Pavement, (1955), by George Walter Stonier\n* Minnow on the Say, (1955), by Philippa Pearce\n* Sun Slower Sun Faster, (1955) by Meriol Trevor\n* A Stickful of Nonpareil, (1956), by George Scurfield\n* Hunting with Mr. Jorrooks from Handley Cross, (1956), by Robert Smith Surtees\n* Pigeons and Princesses, (1956), by James Reeves\n* The Wandering Moon, (1956), by James Reeves\n* Henry Esmond, (1956), by William Makepeace Thackeray\n* St. Luke's Gospel, (1956)\n* Ding Dong Bell, (1957), by Percy Young\n* Lottie, (1957), by John Symonds\n* Prefabulous Animiles, (1957), by James Reeves\n* Sugar for the Horse, (1957), by H. E. Bates\n* The School in Our Village, (1957), by Joan Goldman\n* Pinky Pye, (1958), by Eleanor Estes\n* Jim at the Corner, (1958), by Eleanor Farjeon\n* The Story of Joseph, (1958), by Walter de la Mare\n* Mimff Robinson, (1958), by H.J.Kaeser\n* Shakespeare's Comedies, (1958)\n* Brief to Counsel, (1958), by Henry Cecil\n* Holiday Trench, (1959), by Joan Ballantyne\n* The Godstone and the Blackymor, (1959), by Terence Hanbury White\n* Titus in Trouble, (1959), by James Reeves\n* The Adventures of Don Quixote, (1959), retold by James Reeves\n* Elfrida and the Pig, (1959), by John Symonds\n* The Nine Lives of Island MacKenzie, (1959), by Ursula Moray-Williams\n* The Story of Moses, (1959), by Walter de la Mare\n* The Adventures of Father Brown, (1959), by G. K. Chesterton\n* The Rib of the Green Umbrella, (1960), by Naomi Mitchison\n* Boyhood of the Great Composers, (1960), by Catherine Gough\n* The Story of Samuel and Saul, (1960), by Walter de la Mare\n* Stories from the Bible, (1960), by Walter de la Mare\n* Kidnappers at Coombe, (1960), by Joan Ballantyne\n* Italian Peepshow, (1960), by Eleanor Farjeon\n* A Penny Fiddle, (1960), by Robert Graves\n* The Witch Family, (1960), by Eleanor Estes\n* Merry England, (1960), by Cyril Ray\n* Tom Sawyer, (1961), by Mark Twain\n* Huckleberry Finn, (1961), by Mark Twain\n* Down in the Cellar, (1961), Nicholas Stuart Grey\n* Folk Songs of England, Ireland, Scotland and Wales, (1961), by William Cole\n* Sailor Rumblelow and Britannia, (1962), by James Reeves\n* Mrs. Malone, (1962), by Eleanor Farjeon\n* Let's Make an Opera, (1962), by Eric Crozier\n* Peter Pan, (1962), retold by Eleanor Graham\n* The Singing Cupboard, (1962), by Dana Faralla\n* A Ring of Bells, (1962), by John Betjeman\n* Naughty Children: An Anthology, (1962), compiled by Christianna Brand\n* Kaleidoscope, (1963), by Eleanor Farjeon\n* Boyhood of the Great Composers Book II, (1963), by Catherine Gough\n* Hurdy Gurdy, (1963), by James Reeves\n* Wine List Decorations, (1963), by John Harvey & Sons, further illustrations by David Gentleman, Asgeir Scott and Shelia Waters\n* J. M. Barrie's Peter Pan: the story of the Play, (1963), by Eleanor Graham\n* Stig of the Dump, (1963), by Clive King\n* Nurse Matilda, (1964), by Christianna Brand\n* Hello Elephant, (1964), by Jan Wahl\n* Swanhilda-of-the-Swans, (1964), by Dana Faralla\n* Thirty-Nine Steps, (1964), by John Buchan\n* The Land of Up and Down, (1964), by Eva-Lis Wuorio\n* Three Tall Tales, (1964), by James Reeves\n* The Island of Fish in the Trees, (1964), by Eva-Lis Wuorio\n* Ann at Highwood Hall: Poems for Children, (1964), by Robert Graves\n* The Alley, (1964), by Eleanor Estes\n* Old Perisher, (1964), by Diana Ross\n* Timothy's Song, (1965), by William J Lederer\n* The Truants, (1965), by John Walsh\n* The Year Round, (1965), by Leonard Clark\n* The Milldale Riot, (1965), by Freda Nicholls\n* Know About the Law, (1965), by Henry Cecil\n* The Old Nurse's Stocking Basket, (1965), by Eleanor Farjeon\n* The Story of Jackie Thimble, (1965), by James Reeves\n* The Land of Green Ginger, (1966), by Noel Langley\n* The Dragon, (1966), by Archibald Marshall\n* The Muffletumps, (1966), by Jan Wahl\n* Long Ago When I was Young, (1966), by E. Nesbit\n* The Eleanor Farjeon book: a tribute to her life and work 1881-1965, (1966), introduction by Naomi Lewis\n* The Growing Summer, (1966), by Noel Streatfeild\n* The Secret Shoemakers, (1966), by James Reeves\n* A Likely Place, (1966), by Paula Fox\n* Daddy Long Legs, (1966), by Jean Webster\n* A Group of Apostles, (1966), by Paul Claudel\n* The Stuffed Dog, (1967), by John Symonds\n* Kali and the Golden Mirror, (1967) by Eva-Lis Wuorio\n* Nurse Matilda Goes to Town, (1967), by Christianna Brand\n* Robinson Crusoe, (1967), by Daniel Defoe\n* Miranda the Great, (1967), by Eleanor Estes\n* Rhyming Will, (1967), by James Reeves\n* Upsidedown Willie, (1967), by Dorothy Clewes\n* The Magic Summer, (1967), by Noel Streatfeild\n* Travels with a Donkey, (1967), by R. L. Stevenson\n* Special Branch Willie, (1968), by Dorothy Clewes\n* Do You Remember What Happened?, (1969), by Jean Chapman\n* The Angel and the Donkey, (1970), by James Reeves\n* Fire Brigade Willie, (1970), by Dorothy Clewes\n* Rain, Rain, Don’t Go Away, (1972), by Shirley Morgan\n* The Tunnel of Hugsy Goode, (1972), by Eleanor Estes\n* The Little Fire Engine, (1973), by Graham Greene\n* The Little Horse Bus, (1974), by Graham Greene\n* A Child's Christmas in Wales, (1978), by Dylan Thomas\nAwards and honours\n* 1956 Kate Greenaway Medal, for Tim All Alone''\n* 1962 Elected Associate member of the Royal Academy of Arts\n* 1970 Elected a full member of the Royal Academy\n* 1971 Appointed a Commander of the Order of the British Empire (CBE) in the 1971 New Year Honours\n* 1974 Royal Designer for Industry\n* 1975 Senior member of the Royal Academy\nNotes\n}}\nReferences\nFurther reading\n* Brian Alderson, 'Edward Ardizzone: a preliminary hand-list of his illustrated books, 1929–1970', in The Private Library; 2nd series, 5:1 (1972 Spring), pp. 2–64\n* Brian Alderson, Edward Ardizzone: A Bibliographic Commentary (2003. Private Libraries Association) )\n* Gabriel White, Edward Ardizzone Artist and Illustrator (1979)\n* Malcolm Yorke, To War with Paper and Brush: Captain Edward Ardizzone, official War Artist (2007. Fleece Press, Upper Denby Huddersfield)\n* Edward Ardizzone, 'Brian Robb', in Signature; new series, 11 (1950), pp. 37–45\n* Edward Ardizzone, 'On the illustrating of books', in The PLA Quarterly; 1st series, 1/3 (1957 July), pp. 25–30\n* Edward Ardizzone, 'The Born Illustrator', in Motif; 1 (1958 November), pp. 37–44 (reprinted in Folio (1962 January–March), pp.&nbsp;1–16)\n* Richard Knott, 'The Sketchbook War', The History Press, 2013.\n* Justin Wintle and Emma Fisher, 'Edward Ardizzone', in ''The Pied Pipers: Interviews with the influential creators of children's literature'', (1975. Paddington Press, London) pp. 35–48\nExternal links\n*\n* [http://www.edward-ardizzone-archive.org/ Edward Ardizzone Archive website]\n*\n*\n* [http://www.iwm.org.uk/collections/search?query=Edward%20Ardizzone Works by Ardizzone] in the Imperial War Museum collection.\n* [https://web.archive.org/web/20180109085634/http://genome.ch.bbc.co.uk/page/69dedefe082f49e6a4edbaf1d2e8177a Cover of the 1937 Christmas edition] of the Radio Times, signed \"Ardizzone\"\n* [https://web.archive.org/web/20181218194057/https://genome.ch.bbc.co.uk/page/3d2889a1f4f643cc952e07e5b454b5c6 Cover of the 1948 Christmas edition] of the Radio Times, signed \"DIZ\"\n* [https://specialcollections.usm.edu/repositories/4/resources/34 Edward Ardizzone Papers], Special Collections at The University of Southern Mississippi (de Grummond Children's Literature Collection)"
    }
  ]
}