{
  "content": [
    {
      "type": "text",
      "text": "# Edward Gerrard & Sons\n\nEdward Gerrard & Sons was a taxidermy firm which operated in Camden, London from 1853 to the mid 1960s.\nHistory\nEdward Gerrard & Sons was a taxidermy firm founded and run by the Gerrard family from 1853 in Camden, London. The company also made anatomical models and dealt in sale of artefacts. The company was founded by Edward Gerrard, who was an employee of the British Museum's zoological department, as an attendant. The business originally ran from the family home, 54 Queen's Street, Camden and later at a yard behind 61 College Place. They were initially known for their taxidermy of large game animals, but by the late 1800s, they were producing more small mounts which included some exotic animals. By the 1890s, Gerrard's son, also called Edward had taken over the business which he ran until his death in 1929. Each inheriting Gerrard was called Edward, with the next Edward dying in 1906, the company was inherited by his son Edward. In turn, his son Edward (the fifth generation Edward Gerrard) inherited the firm, but he had no sons to pass the business to leading to his cousin Harry taking ownership.\nThe company was considered one of the finest taxidermy firms in the United Kingdom. One of their more famous mounts, of the greyhound Mick the Miller, is on display in the Natural History Museum at Tring. Among their clients were the British Museum and the Natural History Museum, Dublin.\nAfter the death of Harry Gerrard, Charles Gerrard (brother of the fifth Edward) purchased the company. His son, Edward, ran the company with him. There was a marked decline in demand for taxidermy by the 1950s, leading to them splitting the company into smaller parts. One part continued to mount taxidermy on a much smaller scale, and another arm hired out their stock for filming and as props. Their premises feature in the Alfred Hitchcock 1955 film, The Man Who Knew Too Much. After a number of years in decline, the company closed in either 1965 or 1967.\nThe company is mentioned in episode 6, season 4 (2022) of the BBC comedy series Ghosts.\nReferences\nFurther reading\n*"
    }
  ]
}