{
  "content": [
    {
      "type": "text",
      "text": "# Edward Fishman\n\nEdward Fishman is an American author, international relations scholar, and former diplomat who is currently a Senior Research Scholar at the Center on Global Energy Policy and an Adjunct Professor of International and Public Affairs at Columbia University. He is the author of the book Chokepoints: American Power in the Age of Economic Warfare and also holds fellowships at the Center for a New American Security and the Atlantic Council.\nPreviously, Fishman was a member of the U.S. Secretary of State's Policy Planning Staff and the Russia and Europe Lead in the U.S. State Department's Office of Economic Sanctions Policy and Implementation. He has also served in roles at the U.S. Department of Defense and the U.S. Department of the Treasury. Outside of government, Fishman has been an editor at Foreign Affairs and has written articles in The New York Times, The Wall Street Journal, The Atlantic, and Washington Post.\nEarly life and education\nFishman grew up in Bryn Mawr, Pennsylvania. He earned a B.A. in history from Yale University, where he was elected to Phi Beta Kappa as part of the class of 2011. He also earned an M.Phil. in international relations from the University of Cambridge; and an MBA from Stanford University, where he graduated as an Arjay Miller Scholar.\nCareer\nBetween 2011 and 2017, Fishman served in various roles at the U.S. Department of State, the U.S. Department of Defense, and the U.S. Department of the Treasury. In 2011, Fishman served as special assistant to the Under Secretary for Terrorism and Financial Intelligence at the Treasury Department. From 2013 to 2014, Fishman was a member of the Iran sanctions team at the State Department, focusing on strengthening sanctions during international nuclear negotiations.\nIn 2014, Fishman served as a special assistant to the Chairman of the Joint Chiefs of Staff at the Pentagon, within the Defense Department.\nAfter Russia's 2014 annexation of Crimea, Fishman served as the first Russia and Europe Lead in the State Department's Office of Economic Sanctions Policy and Implementation. He contributed to designing sanctions on Russia and negotiating them with the EU and the G7 in response to the Ukraine crisis.\nFrom 2015 to 2017, Fishman was a member of the U.S. Secretary of State's Policy Planning Staff, where he advised on Europe and Eurasia and led initiatives on economic sanctions and strategic planning.\nWriting\nFishman began his career as an editor at Foreign Affairs. He has published articles in The New York Times, The Wall Street Journal, Foreign Affairs, Boston Review, and Politico Magazine, among other publications. He is also the author of Chokepoints: American Power in the Age of Economic Warfare.\nSelected publications\n*\n*\n*\n*\n*\n*\nAwards and recognition\nFishman has received the U.S. State Department's Superior Honor Award twice and the Meritorious Honor Award for his contributions to U.S. policy concerning Ukraine, Russia, Belarus, and Iran.\nReferences"
    }
  ]
}