{
  "content": [
    {
      "type": "text",
      "text": "# Edward Anthony (writer)__disambig_1\n\n|birth_place = New York City, New York\n|death_date  =\n|death_place = Gloucester, Massachusetts\n|known_for   = Collaboration with Frank Buck\n|occupation  = Writer\n|nationality = American\n|spouse      =\n|children    = Richard Anthony (born 1931)\n}}\nEdward Anthony (August 4, 1895 – August 16, 1971) was an American journalist and writer who co-wrote Frank Buck's first two books, ''Bring 'Em Back Alive, and Wild Cargo.\nEarly career\nAfter completing high school, according to the 1940 US Census, Anthony got his start as a journalist on The Bridgeport Herald in Connecticut and then worked for the New York Herald in 1920–23. An associate editor for a short time of Judge'', the humor magazine, Anthony joined the staff of the Crowell group of magazines, later Crowell-Collier Publishing Company, in 1924. In 1928, he served as eastern press director for Herbert Hoover's presidential campaign.\nCollaboration with Frank Buck\nOf Frank Buck's three co-authors, Edward Anthony, Ferrin Fraser, and Carol Weld, Anthony was the most talented at imparting immediacy and freshness to Buck's narrative. Anthony wrote Buck's stories in a modest, matter-of-fact, yet almost every one has danger in it. With his knack for eliciting telling details, Anthony created a sense of drama, and as a result, Frank Buck's first two books are his best.\n(right) and Edward Anthony stand with a copy of Wild Cargo c. 1932.]]\nIn his autobiography, Anthony describes his collaborator:\n\"Frank Buck was a first-class actor and his pantomimic footnotes to some of his verbal explanations were most effective. One night during a session on the book our room in the hotel got stuffy—we both had been smoking for hours—so we opened the door wide and put a chair against it to start the air circulating. We were working on a chapter about a leopard—it eventually wound up in the Lincoln Park Zoo in Chicago—which had inconsiderately damaged its cage and wriggled free on one of the cargo decks of the S.S. Granite State en route from Calcutta to San Francisco and was roaming the ship while nearly everyone fled for cover. Buck, to illustrate one of the animal's maneuvers, had slipped to the floor and was moving about on his hands and knees preparatory to springing at an unwary seaman, giving off guttural growls as he prepared to deplete the freighter's population. As he was about to leap at his victim he heard a sound in the hall and looking up he saw that he was playing to a gallery!—a bellboy and several patrons. He saw the humor of the situation, gave vent to a hearty soure cabatcha! [a Hindustani epithet], and prepared to resume operations. 'Are we disturbing you?' asked the bellboy. 'Yes,' said Buck, and our gallery vanished.\"\nIn 1933, Anthony filed suit in Brooklyn Supreme Court to recover two percent of the motion picture profits Buck had earned on the film adaptation of ''Bring 'Em Back Alive, effectively ending their collaboration.\nAnthony wrote or co-wrote other books, among them The Big Cage with wild animal trainer Clyde Beatty.\nLater career\nAnthony was the publisher of Woman's Home Companion from 1942 to 1952 and Collier's from 1949 to 1954. Collier's folded shortly afterwards. Anthony wrote an autobiography, This Is Where I Came In:The Impromptu Confessions of Edward Anthony (1960).\nReferences\nExternal links\n*[https://web.archive.org/web/20100720202902/http://diglib.princeton.edu/ead/getEad?eadid=TC125&kw=American%20literature Edward Anthony Papers, Princeton University Library]\n*[https://scua.uoregon.edu/repositories/2/resources/906 Edward Anthony papers] at the University of Oregon\n* [https://web.archive.org/web/20101027055352/http://www.time.com/time/magazine/article/0,9171,789342,00.html \"Books: Beastcatcher\"]. Time. June 6, 1932. (review of Wild Cargo, 1932)\n* [https://web.archive.org/web/20071118091201/http://www.time.com/time/magazine/article/0,9171,740478,00.html \"White Seals\"]. Time. October 6, 1930. (review of Bring Em Back Alive'', 1930)\n*"
    }
  ]
}