{
  "content": [
    {
      "type": "text",
      "text": "# Edward F. Johnston\n\n| birth_place = Newmill, Elgin, Scotland\n| death_date =\n| death_place = London, United Kingdom\n| resting_place = Elgin\n| citizenship = Scottish\n| known_for = 1st President of Sevilla FC\n| occupation =\n}}\n}}\nEdward Farquharson Johnston (14 October 1854 – 14 June 1924) was a Scottish football executive and referee who was one of the founders of Spanish club Sevilla FC on 25 January 1890, serving as the club's first president of the club for 15 years, from 1890 to 1905. He was also the co-owner of the firm MacAndrews & Co. and the British vice-consul in Sevilla from 1879 to 1906. A keen sportsman he was involved in golf, tennis, and was also president of the Pigeon-shooting Society.\nEarly history\nEdward Farquharson Johnston was born on 14 October 1854, in Newmill, Elgin, as the son of a woolen manufacturer James Johnston and Margaret Miller Farquharson. He began his studies at Weston House, a prestigious educational center in his hometown, where he would come to meet Alexander Graham Bell. Later, he completed his academic training at the Mill Hill School, a famous English public school near London. Upon completing his education, Johnston began his professional career by joining the shipping company of Robert MacAndrews & Co (based on London), with whom he was directly related through his maternal family. Robert's shipping company had commercial lines between Spain and the United Kingdom, and had extensive business connections in Spain and Asia Minor.\nLife in Seville\nIn 1871, after a couple of months in the London office, the 17-year-old Johnston was sent to Seville as a representative of the MacAndrews shipping company. The company had established an important trade line between Seville and Scotland through the port of Dundee, where they shipped tons of bitter oranges from Seville for the manufacture of their famous marmalade. For around 30 years he remained in charge of supervising the activities of the company, which he managed with remarkable success, significantly increasing already relevant operations.\nIn 1875, Johnston, together with Welton and MacPherson (among others), founded the Club de Regatas de Sevilla. The oldest account of a sporting activity made by him can be found in 1878 aboard the Macareno boat in a regattas held on the Guadalquivir, next to Tablada, in honor of the Spanish royal family, who were visiting Seville. The race was won by Macareno, which was rowed by Bucknall, Niño, García, Johnston, and directed by Welton. A keen sportsman he was involved in golf, tennis, and was also president of the Pigeon-shooting Society.\nOn 23 January 1879, Johnston was appointed British vice-council in Seville until his retirement on 5 October 1906. From the beginning, he became a prominent figure in the social and economic life of Seville. However, it was his role as founding president of Sevilla FC that had the most permanent impact on the city.\nSevilla FC\nOn 25 January 1890, Johnston, together with some of his co-workers and fellow Seville residents of British origin, attended an old café to mark the traditional Scottish celebration of Burns Night, but instead, they ended up founding Sevilla FC, thus being one of the oldest football clubs in Continental Europe and the oldest in Spain founded exclusively for the practice of football, since Recreativo de Huelva, founded a month earlier, on 23 December 1889, did so as a recreational club. Due to Johnston's status in the city, he was elected the club's first-ever president, while another Scot, a native of Glasgow, Hugh MacColl, became the first captain. Among the agreements made by the club's founders on that historic evening, it was agreed that Sevilla FC should play under the rules of the English FA. The MacAndrew shipping company, of which he was co-owner and director in Seville, was in charge of supplying sports equipment to the club, such as balls, socks, boots and shirts, which were smuggled; as well as supplying a large number of players, such as William MacAndrews.\nA few weeks after founding the club, on 25 February 1890, Isaías White Méndez, the then secretary of Sevilla FC, wrote a letter to the Huelva recreational club to invite them to play a football match in Seville, which took place on 8 March 1890 at the Hipódromo de Tablada, a horse racing track, with Seville winning 2–0. Johnston, then aged 36, was already beyond his playing days, so he instead made a different contribution to Spanish football as the refereed of the match, thus going down in history as the referee of the first football match played in Spain under the rules of the FA.\nJohnston's activity as a referee would be common, since a few months later, on 27 December 1890, he again was \"the deciding judge\". In an interview with a Huelva newspaper in 1933, Daniel Young, a worker at Rio Tinto Co., stated that \"Mr. Johnson\" was almost always the referee of their matches. Years later, in January 1908, Johnston, who was still in Seville, refereed another match between Sevilla FC and Receativo de Huelva in La Tablada, which ended in a 4–0 win to the locals. In the following year, in January 1909, the city of Seville mobilized to help the victims of the bloody 1908 Messina earthquake, and organized a tribute match to the victims of the tragedy, and like years ago, Johnston was the referee.\nPersonal life\nJohnston seems to have left Spain by 1911, since he was living in Woking with his family in that year. In 1879 Johnston married Mary Crombie at Balgownie Lodge, Aberdeen. The couple had three children, all born in Seville. The first son, Gilbert, died in infancy. His second child, Edward John, was killed in the trenches in France during World War I. Johnston's third son, James, joined his father in the family business.\nDeath\nJohnston eventually returned to Britain, where he died in The Boltons in Chelsea, London, on 14 June 1924 at the age of 69. He was cremated at Golder's Green Crematorium. His ashes, placed in an urn enclosed in an oak coffin, were taken on the night train from King's Cross to Elgin, via Aberdeen. At first, it was not known where his gravestone had been placed, but his grave was finally found in Elgin by the Sevilla club historian Javier Terenti.\nIn his last wills, Johnston \"left £50 to Mrs. Mackenzie, who was in charge of 'The Camp' (his father's residence on the coast), and another £50 to Jessie Cooper, for many years his cook, as well as a year's wages to each of the servants in his house, stable, garden and garage\".\nReferences"
    }
  ]
}