{
  "content": [
    {
      "type": "text",
      "text": "# Edward Downe Jr.\n\nEdward Reynolds Downe Jr. (born 1929) is an American businessman and socialite.\nBiography\nDowne graduated from the University of Missouri's Missouri School of Journalism in 1952.  He worked in a variety of capacities at two Virginia newspapers before joining True magazine.   In 1954, he left True to become an editor at the rival magazine Argosy; he later moved into advertising at Argosy.  In 1966, Downe purchased Family Weekly, a newspaper insert similar to Parade Magazine.  He founded Downe Communications in 1967. Through this company he went on to acquire magazines including The Ladies' Home Journal, and The American Home. Downe eventually sold Downe Communications to the Charter Company, a Jacksonville, Florida based oil and insurance conglomerate for approximately $9 million.\nDowne divorced his first wife, Naomi Susan Campbell, in 1977. Downe married heiress Charlotte Ford (mother of Elena Ford) on his 57th birthday, August 31, 1986.\nInsider trading\nIn 1992, the Securities and Exchange Commission charged that in the mid- to late-1980s Downe and associated exchanged inside information in order to make illegal stock trades.\nIrish cottage controversy\nIn February 2009 the Hartford Courant ran a story concerning US senator Christopher Dodd's acquisition of his vacation home in Roundstone, Ireland. The article pointed out Dodd's close links to Downe, his disgraced former partner in buying the home.  After paying an $11 million fine for his role in the scam, Downe later obtained a pardon in the waning days of the Bill Clinton administration. The controversial pardon was granted after Dodd lobbied Clinton on Downe's behalf. Dodd later acquired the interests of his partners after the pardon was granted. Dodd was also criticized for claiming the Roundstone home was worth less than $250,000 in Senate ethics filings; some observers estimated the likely value in excess of $1 million USD.\nSee also\n* List of people pardoned or granted clemency by the president of the United States\nReferences"
    }
  ]
}