{
  "content": [
    {
      "type": "text",
      "text": "# Edward Charles Spitzka\n\nEdward Charles Spitzka (November 10, 1852 – January 13, 1914) was an eminent late-19th century alienist, neurologist, and anatomist. Dr. Spitzka was the author of the landmark psychiatric manual \"Treatise on Insanity, Its Classification, Diagnosis and Treatment\" published in 1883. He pioneered studies of the anatomy of the human nervous system.\nEducation\nSpitzka was born in New York City, the son of Charles A. Spitzka and Johanna née Tag. He attended Public School No. 35, the College of the City of New York, and the Medical Department of the University of the City of New York, where he graduated in 1873. He spent the next three years in Europe, where he studied at the medical schools of the University of Leipzig and the University of Vienna. From 1874 to 1875 he served as an assistant to the chair of embryology at the University of Vienna.\nCareer\nIn 1876 Spitzka returned to New York City, specializing in the diagnosis and treatment of internal diseases, particularly of the human nervous system.  He practiced surgery at Mount Sinai Hospital and was a consulting neurologist to the North-Eastern Dispensary and St. Mark's Hospital. He was a professor of nervous and mental diseases and of medical jurisprudence at the New York Post-Graduate Medical College from 1882 to 1887. In 1890, Spitzka served as president of the American Neurological Society.  In 1883/1884, he served as president of the New York Neurological Society. He was a founding member of the American Anthropometric Society whose purpose was to collect the brains of eminent scientists to further brain science.\nSpitzka was the attending physician at the execution of William Kemmler in New York's Auburn Prison on August 6, 1890, the first execution using the new electric chair. During the execution he confirmed Kemmler to be dead, only for it to be discovered that he was in fact, not.\nTrial of Charles J. Guiteau\nIn 1881, Spitzka was an expert witness at the trial of Charles J. Guiteau, who was accused of the assassination of United States President James A. Garfield.\nThe trial was one of the first high-profile cases in the United States where the insanity defense was considered.\nWhile on the stand, Spitzka testified that he had \"no doubt\" that Guiteau was both insane and \"a moral monstrosity.\"  Spitzka came to the conclusion that Guiteau had \"the insane manner\" he had so often observed in asylums, adding that Guiteau was a \"morbid egotist\" who \"misinterpreted and overly personalized the real events of life.\"\nGuiteau was found guilty of assassinating Garfield, despite his lawyers raising an insanity defense. He was sentenced to death, and executed by hanging on June 30, 1882, in Washington, D.C.\n(Nearly twenty years later, Spitzka's son, Edward Anthony Spitzka, a distinguished brain anatomist, would perform the autopsy on Leon Czolgosz, the assassin of President William McKinley).\nDeath\nSpitzka died on January 13, 1914. In his obituary The New York Times reported that Spitzka, \"the noted neurologist, anatomist and alienist, who has been ill for some time of necrosis of the upper jaw, died suddenly yesterday morning of apoplexy at his home, 66 East Seventy-third Street, at the age of 61 years.\".\nSelected bibliography\n*[https://books.google.com/books?id=yKYYAAAAYAAJ&q=edward+spitzka Insanity, Its Classification, Diagnosis, and Treatment: a Manual, by Edward Charles Spitzka, 1883]\n*[http://journals.lww.com/jonmd/Citation/1880/04000/Art__IV__THE_ARCHITECTURE_AND_MECHANISM_OF_THE.4.aspx  The Architecture and Mechanism of the Brain, Journal of Nervous & Mental Disease: April 1880 – Volume 7 – Issue 2 – ppg 208–249]\n“The Legal Disabilities of Natural Children Justified Biologically and Historically,” The Alienist and Neurologist (1899–1902).\n“Mental Disease, Forensic Medicine,” The Medical Critic (1902).\n“Political Assassins: Are They All Insane?” The Journal of Mental Pathology 2(2) (1902): 69–82 and 2(3) (1902): 121–139.\nBrill, Nathan Edwin.  “In Memoriam Dr. Charles Edward Spitzka,” New York Medical Journal 99 (May 9, 1914): 935–937.\nDana, Charles L.  “Early Neurology in the United States,” Journal of the American Medical Association 90(18) (1928): 1421–1424.\nReferences\nExternal links\n*\n*"
    }
  ]
}