{
  "content": [
    {
      "type": "text",
      "text": "# Edward J. Larson\n\n| birth_place      = Mansfield, Ohio, U.S.\n| death_date       =\n| death_place      =\n| resting_place    =\n| occupation       =\n| language         =\n| ethnicity        =\n| citizenship      =\n| education        =\n| alma_mater       = Williams College Harvard University University of Wisconsin–Madison\n| period           =\n| genre            = History of science\n| subject          =\n| movement         =\n| notableworks     =\n| spouse           =\n| partner          =\n| children         =\n| relatives        =\n| awards           = Pulitzer Prize for History\n| signature        =\n| signature_alt    =\n| years_active     =\n| module           =\n| website          =\n| portaldisp       =\n}}\nEdward John Larson (born September 21, 1953) is an American historian and legal scholar.  He is university professor of history and holds the Hugh & Hazel Darling Chair in Law at Pepperdine University.  He was formerly Herman E. Talmadge Chair of Law and Richard B. Russell Professor of American History at the University of Georgia. He continues to serve as a senior fellow of the University of Georgia's Institute of Higher Education, and is currently a professor at Pepperdine School of Law, where he teaches several classes including \"Property for the 1Ls\".\nBackground and education\nLarson was born in Mansfield, Ohio, and attended Mansfield public schools. He graduated from Williams College and received his J.D. from Harvard University and his Ph.D. in the history of science from the University of Wisconsin–Madison.\nCareer\nLarson has lectured on topics in the history of science, religion, and law at universities across the United States and in Canada, China, Britain, Australia, and South America.  The author of books and articles dealing with voyages of scientific exploration, he has also given lectures at natural history museums and on cruise boats.  His articles have appeared in Nature, Scientific American, The Nation, American History, Time, and various academic history and law journals.\nLarson received the 1998 Pulitzer Prize for History for his book ''Summer for the Gods: The Scopes Trial and America's Continuing Debate Over Science and Religion. The book argues that Inherit the Wind'' (both the play and the movie) misrepresented the actual Scopes Trial. Unlike in the play and movie, in which reason and tolerance triumph over religiously motivated, unsophisticated anti-evolutionists, Larson's book portrays the trial as an opening salvo in an enduring twentieth-century cultural war involving powerful national forces in science, religion, law and politics. \"Indeed,\" he concludes in the book, \"the issues raised by the Scopes trial and legend endure precisely because they embody the characteristically American struggle between individual liberty and majoritarian democracy, and cast it in the timeless debate over science and religion.\"\nIn 2004 Larson received an honorary Doctorate in Humane Letters from The Ohio State University. He held the Fulbright Program's John Adams Chair in American Studies in 2000-01 and participated in the National Science Foundation's 2003 Antarctic Artists and Writers Program.  He was a founding fellow of the International Society for Science and Religion.\nIn 2005 Larson was interviewed by Jon Stewart on The Daily Show on evolution alongside William Dembski and Ellie Crystal. Frequently interviewed on American television and radio, Larson has also appeared multiple times on C-SPAN, including as a featured guest on Booknotes; PBS, including as a historian on Nova and American Experience; NPR, including as a featured guest on Fresh Air with Terry Gross, The Diane Rehm Show, and Talk of the Nation - Science Friday; and History (U.S. TV channel). He has a course on the history of the theory of evolution with The Teaching Company. Larson received the Richard Russell Teaching Award from the University of Georgia and was a charter member of the university's Teaching Academy.\nDr. Larson is a former Fellow at Seattle's Discovery Institute but according to an article in The New York Times by Jodi Wilgoren, “...left in part because of its drift to the right.” According to science writer Chris Mooney, Larson joined the institute \"prior to its antievolutionist awakening.\" At the time, Larson lived in Washington state and the Seattle-based Discovery Institute dealt with Northwest regional issues. In a talk at the Pew Forum entitled \"The Biology Wars: The Religion, Science and Education Controversy\", Larson said \"Behe has never developed his arguments for intelligent design in peer-reviewed science articles.\"\nBooks\n* Declaring Independence: Why 1776 Matters. W. W. Norton & Company. 2025. .\n*\n*\n*\n*\n*\n* ''A Magnificent Catastrophe: The Tumultuous Election of 1800, America's First Presidential Campaign. New York: Free Press, 2007. .\n* The Creation-Evolution Debate: Historical Perspectives. Athens: Univ. of Georgia Press, 2007. .\n* .\n* Evolution's Workshop: God and Science on the Galapagos Islands. New York: Basic Books and London: Penguin, 2001. .\n* The History of Science and Religion in the Western Tradition: An Encyclopedia. (editor), with Gary B. Ferngren and Darrel W. Amundsen, Routledge, June 13, 2000.\n*\n* Sex, Race, and Science: Eugenics in the Deep South. Baltimore: Johns Hopkins University Press, 1995. .\n* Trial and Error: The American Controversy Over Creation and Evolution. New York: Oxford University Press, 1985, 1989 (expanded edition), 2003 (updated edition). .\nAwards and honors\n*1998 Pulitzer Prize\n*2014 California Book Awards Nonfiction Finalist for The Return of George Washington\n*2017 NCSE Friend of Darwin Award\nNotes\nExternal links\n* [https://law.pepperdine.edu/faculty-research/faculty/default.htm?faculty=ed_larson Pepperdine University biography]\n*\n**[https://web.archive.org/web/20111115141753/http://booknotes.org/Watch/105855-1/Edward+Larson.aspx Booknotes interview with Larson on Summer for the Gods: The Scopes Trial and America's Continuing Debate Over Science and Religion''], June 28, 1998.\n*[https://web.archive.org/web/20150225022832/http://cassian.memphis.edu/counterpoint/darwinismontrial.mp3 Edward Larson interview on Counterpoint Radio] with Marcus W. Orr Center for the Humanities at the University of Memphis."
    }
  ]
}