{
  "content": [
    {
      "type": "text",
      "text": "# Edward Davis (buccaneer)\n\nEdward Davis or Davies (fl. c. 1680&ndash;1688) was an English buccaneer active in the Caribbean during the 1680s and would lead successful raids against Leon and Panama in 1685, the latter considered one of the last major buccaneer raids against a Spanish stronghold. Much of his career was later recorded by writer William Dampier in A New Voyage Round the World (1697).\nEarly career\nPossibly of Flemish ancestry, he is first recorded as one of the members of the Pacific Adventure led by Bartholomew Sharp and John Coxon in 1680. But first and foremost he emerges in the Caribbean on a French privateer commanded by Captain Yanky. He was transferred to Captain Tristian's ship, the crew mutinied at Petit-Goâve, southwest of Port-au-Prince in Saint-Domingue (Haiti). Davis then sailed under Capt John Cook arriving in April 1683 at Chesapeake Bay, where he met William Dampier.\nBriefly serving as a navigator, he and several others including James Kelly left the expedition within a year and returned overland through Panama with John Cook.\nDavis & Cook\nOn 23 August 1683, while selling captured prizes in Virginia, he agreed to join a privateering expedition as a quartermaster under the pirate John Cook. Sailing eastward, they soon captured the 36-gun Delight (or ''Bachelor's Delight) shortly after arriving off West Africa at Guinea. Sailing to the Pacific in November 1683 by way of Cape Horn, Davis and the others were joined by the buccaneer John Eaton before raiding Spanish cities along the coast of South America.\nIn March 1684, Bachelor's Delight met Nicholas'', Capt John Eaton's ship off Valdivia. They sailed to the Juan Fernandez Islands where they were greeted by a Miskito Indian, who had accidentally been left behind in January 1681 by Capt Bartholomew Sharp. On 3 May, Captains Cook and Eaton headed for the Galapagos Islands.\nFollowing the death of Cook on 19 July 1684, the crew of the ''Bachelor's Delight elected Davis Captain to succeed him. However, the expedition ran into some difficulty as a failed attack on El Realejo, Nicaragua would result in the departure of Eaton as well as raids against Paita, Peru and Guayaquil, Ecuador turning up little of value, although the capture of several slave ships resulted in 15 slaves joining the crew.\nTurning back towards Panama, he raided Spanish shipping carrying silver from Peru to Spain before joining forces with a fleet under the command of Francois Grogniet, Pierre le Picard and Francis Townley. Davis sailed for Port St Helena. Sailing back towards Ecuador, he encountered the Cygnet on 2 October under Captain Charles Swan and Peter Harris (the nephew of privateer Peter Harris killed in the Pacific Adventure only four years before) and persuaded them to join the expedition.\nWith the Bachelor's Delight, the Cygnet'' and various smaller captured Spanish vessels, he would successfully lead an attack with Charles Swan and others on against Panama. Although they planned to attack the Peruvian silver fleet, Spanish officials managed to transfer over 500,000 pesos in two galleons and escorted by three smaller warships which was able to evade the awaiting pirate fleet by sailing in an outwardly westward course. While awaiting the treasure fleet, Davis and the others encountered a Spanish patrol off the coast of Peru on 8 June and were eventually chased by a Spanish fleet to Corba Island. At this time Davis' ship was not flying English flags: \"as he was furnished with a French commission, and France was still at war with Spain, he carried aloft a white flag, in which was painted a hand and sword.\"\nBreakaway from Grogniet\nQuarreling amongst themselves following their defeat, with many pirates blaming the Frenchman Francois Grogniet, Davis left the expedition along with Swan on 3 September, Townley, Harris, William Knight and sailed north with eight ships and 640 buccaneers.\nOn 1 January 1685, Davis seized a Packet-boat bound for Lima with orders captured on the Plate silver fleet for Panama. On 7 January Davis and Swan sailed for Pear Island to intercept the silver fleet. By 15 February, it had still not arrived. About to abandon all hope, they sighted the fleet on 28 May. It had already ditched its cargo at La Villa, as they redeployed buccaneer vessels in Panama Bay. The pirates had foregathered, but in the Battle of Panama they were outnumbered by the Spaniards by at least ten to one. The outcome was indecisive. Davis and Swan and two other ships split from the alliance - raids against Leon and Realejo met with little success resulting in the departures of Swan and Townley who left for Mexico and, Harris left after much of his crew died from yellow fever in Honduras: the group splitting on 25 August 1685. Dampier sailed westwards across the Pacific to East Indies. With William Knight, the 'cruising' buccaneers raided coastal settlements of Peru and Chile, but food was scarce. Knight departed for the West Indies. After arriving at the Juan Fernández Islands in November, Davis and Knight decided to divide the spoils with each crew member receiving £1,150 according to Raveneau de Lussan with Knight leaving for the Caribbean. Davis spent Christmas 1685 at Juan Fernandez Island - the crew felt an earthquake at Callao and Lima 450 miles offshore at 4 am.\nDavis raided and stole £25,000 in jewels and silver from the city of Zaña, Peru in March 1686. Although later raids yielded smaller wealth, 39 African slaves were liberated from Paita and later joined the expedition. Raiding five more towns between the months of May and June, including the failed attack on La Serena, many priests and officials were killed attempting to hide the city's treasury until the defenders of Pisco agreed to pay £5,000 in ransom. Davis continued with 80 men and looted £10,000 from Arica, Chile in February 1687. Learning from captives of Spanish plans to send a squadron from Peru against Captain Pierre le Picard, he arrived at Guayaquil in May and helped defeat the fleet and split £50,000 with the French buccaneer. Leaving Guayaquil on June 12, Davis stopped at the Galápagos Islands and Juan Fernández Islands and also supposedly sighted Davis Land while making his way down to Cape Horn, on his return voyage to the American colonies.\nDavis and the Delight arrived in the West Indies in early 1688 and eventually arrived in Philadelphia in May. Although he and Lionel Wafer and John Hingson would be arrested on 22 June 1688 for piracy in Virginia for two years as they crossed Port Comfort to Elizabeth River. On 26 June 1688 at his trial, Davis denied ever being a privateer, saying he had been a resident of Jamaica for seven years. A black servant, Peter Cloise, contradicted the statement on 16 August 1688; Davis petitioned under King James II's Proclamation of 1685 for Privateering. In October 1686, Lord Sunderland issued a Council of Trade and Plantations instruction for their prosecution - but they may have received a royal pardon.\nDavis was pardoned under the 1687/8 Act of Grace.\nIn August 1689, the Council of Virginia ordered the buccaneers to return to England. By November they had arrived, but without their possessions. In December 1687, Davis's expedition had found a land mass 500 leagues south of the Galapagos at 27°20′S; named Davis Land, it is shown on the frontispiece to Dampier's A New Voyage Round the World. In 1721, Dutch West Indies Company, and three ships under Jacob Roggeveen could not find the island, although it could be Easter Island.\nLater years\nDavis would eventually return to England in 1690 and successfully managed to have most of his former property and estates returned to him within two years. A royal order of March 1692 agreed to return Davis fortune, but £300 was retained by the Crown; and he kept about one quarter of the Jamestown property.  The moneys may have been put toward building the College of William and Mary at Williamsburg, Virginia.  In November 1693, the Council of Virginia invited creditors of the three men forward.  Davis signed with a cross and so may have been illiterate.\nThe ''Batchelor's Delight itself was sold to some of its former crew, and sailed for the Indian Ocean under Captain George Raynor.\nHe is claimed as one of the earliest buccaneers to have buried treasure on Cocos Island with his flagship, the Bachelor's Delight'', in 1684 and 1702.  Anchoring in Chatham Bay, he supposedly left behind several chests containing ingots, pieces-of-eight and £300,000 in silver bar and plate taken from settlements in Peru and Chile. He may or may not have been the same privateer to accompany Captain William Kidd to America after a meeting at St. Mary's Island in 1697.\nReferences\nBibliography\n*[https://web.archive.org/web/20070928015014/http://www.athelstane.co.uk/kingston/voyagers/vyage21.htm Notable Voyagers, W.H.G. Kingston and Henry Frith] - Chapter XXI: Voyages and adventures of William Dampier — from A.D. 1674\n* Rogozinski, Jan. (1996) Pirates!: Brigands, Buccaneers, and Privateers in Fact, Fiction, and Legend. New York: Da Capo Press"
    }
  ]
}