{
  "content": [
    {
      "type": "text",
      "text": "# Edward Pine Coffin\n\nCommissary-general Sir Edward Pine Coffin (1784 – 1862) was an English commissary officer.\nLife\nEdward Pine Coffin, youngest son of the Rev. John Pine, was born at Eastdown, Devonshire, on 20 October 1784. He entered the commissariat as clerk on 25 July 1805, was made acting assistant in the following year, assistant commissary-general in 1809, deputy commissary-general in 1814, and commissary-general on 1 July 1840. He served at the Cape from 1805 to October 1808, in Spain in 1808–9, including the Corunna retreat, and in the Peninsular from April 1809 to August 1810, from October 1810 to June 1811, and from July 1812 to September 1814; also in the Netherlands and France in 1815–16, on special service at Brussels in 1819, and in Canada from June 1819 to December 1822.\nDuring the next ten years he was on half-pay in China, and afterwards on service in Canada from September 1833 to August 1835. From that time until April 1841 he was in Mexico charged with the duty of raising dollars for the commissariat chests, after which he served from April 1843 to July 1845 in China, and from January 1846 to March 1848 in Ireland and Scotland, and had charge of the relief operations at Limerick and in the west of Ireland during the Famine up to August 1846, at the termination of which he was knighted by patent in recognition of his services. He was employed and paid from 1 April 1848 as one of the commissioners of inquiry into the working of the Royal Mint, whose report will be found in the Parliamentary Papers. Coffin, who was unmarried, died at his residence, Gay Street, Bath, 31 July 1862.\nSources\n* Commissariat Records in the possession of the War Office;\n* ''The Gentleman's Magazine 3rd series, xiii. 372;\n* Parliamentary Papers: Accounts and Papers, 1847, vol. li. (Ireland, Distress, Commissariat series), 1849, vol. xxviii. (Mint Commissioners).\nSee also\n* John Pine Coffin\nReferences\nCitations\nBibliography\n*\n* Chichester, H. M.; Lunt, James (2004). [https://www.oxforddnb.com/view/10.1093/ref:odnb/9780198614128.001.0001/odnb-9780198614128-e-5806 \"Coffin, Sir Edward Pine\"]. In Oxford Dictionary of National Biography''. Oxford: Oxford University Press. n.p."
    }
  ]
}