{
  "content": [
    {
      "type": "text",
      "text": "# Edward Hide\n\n|birth_place = Stanton Lacy, England\n|death_date  =\n|death_place =\n|career wins  =\n|race  = British Classic Race wins as jockey:\n|awards =\n|honours  =\n|horses  =\n|\n}}\nEdward William George Hide (12 April 1937 – 7 September 2023) was a British multiple classic winning jockey. He was, at his peak, the sixth most successful jockey in British racing history and remained the ninth most successful jockey over 30 years after his retirement.\nEarly years\nEdward William George Hide was born on 12 April 1937, in Stanton Lacy, Shropshire, to Bill Hide and Connie (née Edwards). He was initially apprentice to his father, Bill, and had his first race ride on 29 August 1950, aged 13, on a horse called Copper Wire, which came last in a race at Birmingham. He would have his first winner a year later – Ritornello at Chepstow on 22 September 1951.\nCareer\nDuring his career, Hide was mainly seen on the northern and Scottish racing circuit. He rode for the Malton-based trainers Charles Elsey and his son Bill, and was often associated with Mick Easterby, winning the 1977 1,000 Guineas for the trainer, but was never officially stable jockey. Briefly, he was retained jockey to Sir Gordon Richards and Clive Brittain.\nHide was champion apprentice in 1954, 1956 and 1957 (when he was also runner-up in the main jockeys' championship). His first big race winner was Limereagh in the 1954 Naas November Handicap and he rode his first winner for The Queen, Opera Score, at Newmarket on 3 May 1957. In 1958 he won the Chesham Stakes at Royal Ascot on champion juvenile, Tudor Melody.\nHide was \"Cock of the North\" (winningmost rider in the North of England) 16 times between 1957 and 1983 and in 1974 he set a record of 137 winners for a jockey based in the north of Britain, a record which stood until Kevin Darley passed it in 1993. Hide was, however, also successful on big race days in the south, his classic race victories being the 1973 Derby on Morston, two 1,000 Guineas – Waterloo (1972) and Mrs McArdy (1977) – and two St. Legers on Cantelo (1959) and Julio Mariner (1978). Other big race victories included the Lincoln (three times), Northumberland Plate, Magnet Cup, November Handicap and the 1967 Ayr Gold Cup on Farm Walk. In 1976, he won the Temple Stakes, King's Stand Stakes, July Cup and Nunthorpe Stakes (then known as the William Hill Sprint Championship) on champion sprinter, Lochnager. He was identifiable to racing fans by a toothy grin.\nRetirement\nHide first retired in 1986, though he rode his final winner on Lexus at Newmarket on 22 May 1993, after riding 2,593 winners in Britain. Only eight jockeys have ridden more winners in Britain as of 2023, and Hide's total was for a long time the highest for a rider who was never British champion jockey until surpassed by Joe Fanning. He twice rode five winners in a day – at Liverpool on 28 June 1961 and at Newcastle on 27 July 1981 and 10 times rode a century of winners in a season.\nAt first after retirement, he planned to be a Jockey Club stewards' secretary, but was turned down for the role. Instead, he ended up as agent to Walter Swinburn, followed by a spell as assistant trainer to John Gosden and as a racing manager. He also bred horses, including the winners of around 80 races, from a farm near Malton, North Yorkshire. More recently, he was in the news when it was revealed a lifetime racecourse entry badge he had been given after his retirement was surprisingly retracted. His case was taken up by the Professional Jockeys' Association.\nPersonal life\nHide married in 1961 and had a daughter and a son. His wife Susan became a breeder and judge of show ponies. His nephew, Philip Hide, was a National Hunt jockey on the southern circuit and became a racehorse trainer after his retirement.\nHide died on 7 September 2023, at age 86.\nClassic race victories\nGreat Britain\n* 1,000 Guineas – Waterloo (1972), Mrs McArdy (1977)\n* Epsom Oaks – Pia (1967)\n* Epsom Derby – Morston (1973)\n* St. Leger – Cantelo (1959), Julio Mariner (1978)\nSource:\nReferences\n}}\nBibliography\n*\n*\n*"
    }
  ]
}