{
  "content": [
    {
      "type": "text",
      "text": "# Edward Duffy (Fenian)\n\nfor living people supply only the year with  unless the exact date is already widely published, as per WP:DOB. For people who have died, use . -->\n| birth_place   =\n| death_date    = 1868\n| death_place   =\n| nationality   = Irish\n| other_names   =\n| occupation    =\n| years_active  =\n| known_for     =\n| notable_works =\n}}\nEdward (Ned) Duffy (c. 1840 – 1868) was an Irish Fenian.\nDuffy was a native of Loughglynn, Castlerea, County Roscommon. He moved to Dublin about 1860 where he was employed as a clerical worker at Pim's drapery. He was one of a number of such workers recruited by Thomas Clarke Luby for the Fenians, taking the Irish Republican Brotherhood (IRB) oath about March 1861. He was employed as a messenger by James Stephens and sometimes lodged with Joseph Denieffe.\nEarly in 1863 he was working in Castlerea, County Roscommon, with his former employer Bernard Gannon, a hardware merchant. On Stephen's orders he left this job and became a full-time Fenian. His activities included distribution of the Irish People, recruiting new members, organisation and training, and classes in Fenian dogma.\nDuffy was by this time suffering from TB, yet refused to slow his pace, as the Connacht branch of the organisation lagged behind that of the other provinces. He became involved with the poet Ellen O'Leary, to whom he became engaged in 1867.\nDuffy was one of a number of Fenians arrested at Fairfield House, Sandymount, Dublin, on 11 November 1865. His prosecution was abandoned in January 1866 as his illness worsened and the authorities believed him close to death. However, he made his way to Paris, where in March, Stephens appointed him his deputy in Ireland. Duffy's ill-health prevented him acting in this capacity, which was in any case \"a calculated attempt by Stephens to use a trusted subordinate to protect his own position.\" (2009, p.&nbsp;509)\nIn February 1867 he was in London as one of the four elected provincial fenian representatives meeting English-based and Irish-American members to organise a provisional government in preparation for the rising, set to occur on 5 March 1867. From there he returned to Connacht but was arrested at O'Leary's hotel in Boyle, County Roscommon on 9 March. He was tried and convicted in May to fifteen years penal servitude for treason felony. He died at Millbank prison, London, on 12 January 1868. He was buried later that month in Glasnevin cemetery. His comrade and friend, Jeremiah O'Donovan Rossa, (who was also imprisoned in Milbank at the time of Duffy's death), wrote \"A Lament for Edward Duffy\".\nReferences\n* Duffy, Edward, in Dictionary of Irish Biography, p.&nbsp;509, Cambridge, 2009.\n* http://www.nga.ie/Fenians-Duffy_Edward.php"
    }
  ]
}