{
  "content": [
    {
      "type": "text",
      "text": "# Edward Tyrer\n\n|image=Edward_Tyrer.jpg\n|image_size=\n|office1=Commissioner of Police, Hong Kong\n|term1=19 December 1966 – 21 July 1967\n|governor1=Sir David Trench\n|predecessor1=Henry Heath\n|successor1=Ted Eates\n|birthname = Edward Tyrer Egg\n|birth_date= 19 September 1917\n|birth_place= British Guiana\n|death_date=\n|death_place= Bedfordshire, United Kingdom\n|profession=Police, civil servant\n}}\nEdward Tyrer (born Egg; Traditional Chinese: 戴磊華, formerly 邰華, 19 September 1917 – 24 August 2004) was a senior British colonial police officer who was Commissioner of Police, Hong Kong, from December 1966 to July 1967.\nWhen the leftist riots broke out in May 1967, he was unable to command the Force because he had been on vacation leave in Britain. Shortly after returning in mid-June, he suddenly flew to London on 14 July to report the latest development to the Commonwealth Office. And on 21 July, he was approved for early retirement on \"health grounds\", leaving many speculations as to the real reasons behind his decision. A few pieces of confidential official documents declassified and released in 2012 revealed that Tyrer was instructed to apply for immediate early retirement because he had refused to follow the instructions of the acting governor Michael Gass to suppress the riots.\nTyrer joined the Trinidad police force as a police cadet in 1937 and was promoted to the rank of Assistant Superintendent the next year. During World War II, he saw active service in the Army from 1939 to 1942 before serving briefly in British India's police force. In September 1945, he joined the British provisional military administration of Hong Kong as a captain, handling policing matters in the territories. He was later appointed an Assistant Superintendent of the Hong Kong Police in 1946, an Assistant Commissioner in 1953, and Deputy Commissioner in 1963. He was sent to Britain for advanced police training in 1952, 1956 and 1963 prior to becoming Commissioner.\nBiography\nEarly years\nEdward Tyrer was born Edward Tyrer Egg in British Guiana (now Guyana) on 19 September 1917. He later renounced his surname and assumed the name of \"Edward Tyrer\" in 1945 by enrolling a deed poll in the Supreme Court of England and Wales. Both his parents- Richard Tyrer Egg, who was a native colonial legal officer in British Guiana who later became a high court judge in the Gold Coast (now Ghana). and Lilian Maude Egg-were of English descent. Tyrer had an elder sister called Leila Tyrer Egg as well as a younger brother called John Edgar Tyrer Egg. John was a Foreign Office official who also renounced by deed poll his surname of \"Egg\" in 1963.\nTyrer spent his early childhood in British Guiana before receiving education in England, where he entered, firstly, St Paul's School in London, and followed by Exeter College, Oxford. He began his law enforcement career when he joined the police force of Trinidad, then a British crown colony, as a police cadet in 1937. He was promoted to the rank of Assistant Superintendent the next year. When the Second World War broke out, he saw active service in the Army from 1939 to 1942. During the war he was first commissioned as 2nd. Lt Edward Tyrer Egg (service No. 338545) on 15 June 1944. At the end of the war in 1945 he relinquished his command and was promoted upon discharge as Hon. Captain E. Tyrer (service No. unchanged : 338545) but minus his surname \"Egg\". According to Sinclair, he then briefly served in the police force of British India before joining the civil administration in Hong Kong.\nPolice career\nin Kowloon.]]\nIn September 1945, Tyrer was transferred to the British provisional military administration of Hong Kong as a captain, handling policing matters in the territories. When civil-colonial rule resumed in May 1946, he was appointed an Assistant Superintendent of the Hong Kong Police. In April 1951, he and P. I. M. Irwin were the first batch of officers in the Force who were promoted to the rank of Senior Superintendent. He was sent to the National Police College in Ryton-on-Dunsmore, Warwickshire, to receive advanced police training in 1952. While in the United Kingdom, he joined the funeral procession of the late King George VI in London on 19 June 1952, representing the Hong Kong Police. He returned to Hong Kong in August the same year and was appointed an acting Assistant Commissioner. He was later formally promoted to that rank in February 1953.\nFrom May to June 1956, Tyrer was sent to the National Police College for a second time to attend a colonial police commanding course. He resumed his duty as an Assistant Commissioner upon completing the course and acted as Deputy Commissioner in several occasions from 1960 to 1963. In 1963, he was sent to Britain to receive advanced police training for a third time, this time at the Police Staff College, Bramshill. Upon returning to Hong Kong, he succeeded the retiring Ken Bidmead as Deputy Commissioner in November the same year. As Deputy Commissioner, he acted as Commissioner for a couple of times when his chief, Henry Heath, was on leave. In the capacity as acting Commissioner, he officiated at the opening of the new wing of Mongkok Police Station on 12 August 1965.\nIn October 1966, the Secretary of State for Commonwealth Affairs agreed to appoint Tyrer to succeed Heath, who had reached the normal retiring age of 55, as Commissioner of Police. He formally took up the appointment in December while Ted Eates, a Senior Assistant Commissioner, was in turn appointed Deputy Commissioner. Prior to the promotion, Tyrer had been bestowed a Colonial Police Medal in 1950 and a Queen's Police Medal in 1956.\nEarly retirement\nSoon after he became Commissioner, the leftist riots, which lasted for some seven months, broke out in May 1967. The massive civil disorder originated in a labour dispute at an artificial plastic flower factory in San Po Kong, East Kowloon, and was quickly fuelled by the local leftists and the \"Cultural Revolution\" in the mainland. On 6 May, clashes between the strikers and the police began and the situation turned so serious that a curfew in East Kowloon was declared by the government on 11 May. On 16 May, the leftists formed the Anti-British Struggle Committee, aimed at \"fighting against the oppressive colonial-rule of the British\" and becoming a threat to the colonial authority.\n(now Foreign and Commonwealth Office) in London.]]\n.]]\nJust before the outbreak of the civil disorder, it happened that Tyrer had been on vacation leave and had left Hong Kong for Britain since 3 May, leaving the Force to his deputy, Ted Eates. Under the command of Eates, the police responded to the rioters swiftly and toughly to control the situation. Riot police were sent to maintain law and order and a curfew was briefly implemented on Hong Kong Island. Tyrer returned to Hong Kong and resumed command of the Force in mid-June but the situation did not relax. On 8 July, a gun fight between militiamen from the mainland and the border police took place at Sha Tau Kok, killing five police officers, including three ethnic Chinese and two ethnic Pakistani, and injuring many others. On the next day, the leftist rioters staged another attack in the downtown on Queen's Road West, where a 21-year-old ethnic Chinese police officer was fatally attacked with a hook while on duty. These attacks attracted much attention from the media and intensified public panic in the colony.\nOn 12 July, Tyrer, in full uniform and with his left arm wrapped in a black ribbon, led the Police Force to attend a number of ceremonies which mourned over the killed police officers. In the morning, he paid the last tribute to two ethnic Chinese policemen who were killed in the riots in a funeral at the St. Michael's Catholic Cemetery in Happy Valley. The funeral was followed by another public memorial ceremony held at the Police Headquarters in Wanchai, in which he took the lead to follow Chinese tradition by bowing three times to the coffins of another two killed Chinese officers. In the evening, he attended one more ceremony at Kai Tak Airport, where he escorted the coffins of two Pakistani officers killed in the gun fight of Sha Tau Kok to an aeroplane, sending the remains back to their ancestral home in Pakistan.\nTwo days later on 14 July, Tyrer suddenly flew to London. At first, the spokesman of the Information Services Department explained that he was to report the latest development and to discuss the structure of the Force with the senior officials of the Commonwealth Office. However, one week later on 21 July, it was announced by the Commonwealth Office that Tyrer could not return to Hong Kong on \"health grounds\" and had been approved for early retirement by the Secretary of State for Commonwealth Affairs. The announcement also stated that Tyrer would provide advisory services to the Commonwealth Office in the coming months before formally leaving the service. His deputy, Eates, was immediately appointed to succeed him as Commissioner of Police. The riots later came to an end in December 1967, some five months after Tyrer's early retirement.\nTyrer was only 50 years of age at the time of his early retirement, which was five years before reaching the normal age of retirement of 55. He was also the shortest-serving Commissioner of Police in Hong Kong's history, serving for seven months only. His departure left many questions unanswered. Although the British government announced that Tyrer had applied for early retirement on \"health grounds\", he had appeared to be both physically and mentally fit when he discharged his duties as Commissioner in numerous public occasions like the Force's prize-presenting ceremony. On 18 April 1967, he was even healthy enough to join the Force's blood donation day. Since he had never been reported to have health problems, his decision to retire early sparked speculations. A major leftist newspaper, Ta Kung Pao, which described Tyrer as \"a headsman whose hands were full of blood of Hong Kong Chinese\", commented that he was forced to quit the job because of poor performance. Both the British government and the Hong Kong government refused to disclose further details surrounding the early retirement of Tyrer but in later years it became known that Prime Minister Harold Wilson was very angry about the situation at the onset.\nLater years\nTyrer lived a quiet life in the United Kingdom in retirement and never publicly talked about his early retirement. Many years later, he died at his home in Bedfordshire on 24 August 2004, aged 86, taking the secret of his departure in 1967 to his grave. Kevin Sinclair, a reporter of Hong Kong's South China Morning Post, attempted to search for documents in relation to Tyrer's early retirement from Hong Kong's Public Records Office and the Records and Historical Department of the British Foreign and Commonwealth Office in 2004. Nevertheless, the requests were not answered, leaving unexplained the mystery of his decision not to return to duty.\nIn a book on the 1967 Leftist riots published in 2012, the author, Hong Kong journalist Gary Ka-wai Cheung, provides some insights into the mysterious retirement of Tyrer. Citing a few pieces of colonial confidential documents just declassified and released by the British government, he reveals that in a secret meeting chaired by the acting governor Michael Gass, Tyrer refused to follow the instructions of Gass to suppress the riots, fearing that he would be condemned or even face legal challenges. On 12 July 1967, Gass, losing confidence in Tyrer to lead the Police Force, requested him to apply for early retirement by 10:00 the next morning, or else the government would initiate compulsory retirement process against him. As a result, Tyrer applied for early retirement on \"health grounds\". Cheung further reveals that in a meeting with officials of the Commonwealth Office after returning to the United Kingdom, Tyrer questioned that the suppression would worsen the situation and would be a sign of backwardness of the government.\nHonours\n* :\n** Recipient of the Colonial Police Medal (CPM) (1950)\n** Recipient of the  Queen's Police Medal (QPM) (1956)\nSee also\n* Hong Kong 1967 Leftist riots\n* Commissioner of Police (Hong Kong)\n* Michael David Irving Gass\nRemarks\nFootnotes\nReferences\nEnglish materials\n* \"List or Manifest of Alien Passengers for the United States Immigration Officer at Port of Arrival (Port of New York)\". US: Immigration Service, US Department of Labor, 9 May 1922.\n* The Colonial Office List. Great Britain: H.M.S.O., 1951.\n* Edited by Luzzatto, Rola, ''Hong Kong Who's Who: An Almanac of Personalities and Their History, 1958– 1950. Hong Kong: Ye Olde Printers, 1960.\n* The Colonial Office List''. Great Britain: H.M.S.O., 1962.\n* \"The Force's \"firsts\"\", OffBeat Issue 769. Hong Kong: Hong Kong Police Force, 18 February to 2 March 2004.\n* Sinclair, Kevin, \"Ex-police Chief Takes Secret of His Departure to the Grave\", South China Morning Post. Hong Kong: SCMP, 5 September 2004.\n* \"Tyrer, Edward\", Calendars of the Grants of Probate and Letters of Administration (England and Wales), 2004.\n* \"John Tyrer: Foreign Office civil servant\", The Times, 21 May 2009.\nChinese materials\n* 〈副警務處長必明達退休〉，《工商日報》第四頁，1963年11月24日。\n* 〈警務處長伊輔返英渡假，邰華代警務處長〉，《華僑日報》第二張第一頁，1965年2月21日。\n* 〈署理警務處長邰華官式譯名將改戴磊華〉，《華僑日報》第二張第一頁，1965年2月23日。\n* 〈新旺角警署舉行啟用禮，署理警務處長戴磊華主持〉，《工商日報》第七頁，1965年8月12日。\n* 〈伊輔十二月榮休，戴磊華將升任為警務處長〉，《華僑日報》第二張第三頁，1966年8月10日。\n* 〈伊輔處長今晨離港，戴磊華陞處長〉，《華僑日報》第二張第一頁，1966年12月19日。\n* 〈警務處長戴磊華勉勵警察須運用冷靜頭腦〉，《華僑日報》第二張第三頁，1967年3月11日。\n* 〈警務處長戴磊華捐血〉，《華僑日報》第二張第三頁，1967年4月19日。\n* 〈殉職警員葬禮哀榮〉，《華僑日報》第二張第三頁，1967年7月13日。\n* 〈抗暴衝擊深達敵陣，戴磊華突「炒魷魚」反映港英傾軋甚深〉，《大公報》第一張第四版，1967年7月22日。\n* 〈戴磊華獲准退休，伊達善續署理警務處長職務〉，《工商日報》第四頁，1967年7月22日。\n* 梁可欣編，《最後六任港督的聲音》，香港：商務印書館，2010年。\n* 〈[http://hk.apple.nextmedia.com/news/art/20070506/7072957 六七暴動40周年回顧：走過香港文革的歲月]〉，《蘋果日報》，2007年05月06日。\n* 張家偉，《六七暴動：香港戰後歷史的分水嶺》。香港：香港大學出版社，2012年。\n* 《[https://web.archive.org/web/20080501020242/http://www.ngensis.com/mad-ref/mad-2.htm 文化大革命志補卷一：赤禍香港]》，延陵科學綜合室，造訪於2012年8月5日。\nExternal links\n* \"[http://www.police.gov.hk/offbeat/769/eng/ Police Now & Then : The Force's \"firsts\"]\", OffBeat Issue 769\n* \"[http://www.police.gov.hk/offbeat/773/eng/ Heads of the Force from 1945]\", OffBeat Issue 773"
    }
  ]
}