{
  "content": [
    {
      "type": "text",
      "text": "# Edward Montgomery Phillpotts\n\nAdmiral Edward Montgomery Phillpotts, CB (1 August 1871 – 9 April 1952) was a Royal Navy officer.\nBiography\nBackground and early life and career\nThe son of William Phillpotts, Archdeacon of Cornwall, Phillpotts entered HMS Britannia as a cadet in July 1884. He went to sea in 1886 and was made an acting sub-lieutenant in August 1890. He joined the cruiser HMS Mohawk in 1892; the same year, he was confirmed as sub-lieutenant, and promoted to lieutenant, with seniority backdated to 1891. He then joined the gunnery school HMS Excellent in 1893, and HMS Thesus in 1896 as gunnery lieutenant. In 1897, he was landed for service in the Benin Expedition under Rear-Admiral Rawson. He was appointed gunnery lieutenant of HMS Renown, the flagship of Vice-Admiral Sir John Fisher, Commander-in-Chief, Mediterranean Fleet, in 1900.\nPromoted to commander in 1902, he joined HMS Bulwark, serving as its acting flag captain from 1905 to 1906. Promoted to captain in 1906, he took command of the protected cruiser HMS Grafton the same year. He was appointed to command the armoured cruiser HMS Euryalus in 1907 and the battleship HMS Prince of Wales in 1909, as flag captain to Prince Louis of Battenberg, Commander-in-Chief, Atlantic Fleet. From 1911 to 1912 he was Captain of Signal School, Portsmouth and Superintendent of Signal Schools. In 1912, he was appointed Naval Assistant to the Second Sea Lord, Prince Louis of Battenberg.\nFirst World War\nTaking command of the new battleship HMS Warspite in 1915, Phillpotts grounded her on 17 September 1915, incurring the \"severe displeasure\" of the Admiralty. Phillpotts commanded Warspite at the Battle of Jutland in 1916, where she scored hits on the German battlecruiser Von der Tann and battleship Markgraf, being hit fifteen times in return. On 24 August 1916, Phillpotts was in command when Warspite collided with her sister ship HMS Valiant after a night-shooting exercise: he was sentenced to be reprimanded by court-martial, but the sentence was later quashed. He was Naval Assistant to the First Sea Lord, Sir John Jellicoe, from December 1916 to October 1917. He was appointed a Companion of the Order of the Bath in 1916.\nScouting\nIn 1928, he succeeded Earl Jellicoe as the Commissioner for London Boy Scouts, until 1936 when he retired due to ill-health. In early 1932, Phillpotts attended a revue staged by Rover Scouts from Holborn District; he suggested to the producer, Ralph Reader, that he might arrange a larger-scale production to raise funds for Scouting in London and the result was the first London Gang Show, which opened at the Scala Theatre in October of that year.\nReferences"
    }
  ]
}