{
  "content": [
    {
      "type": "text",
      "text": "# Edward Butler (Irish republican)\n\n| death_date    =\n| birth_place   = Castleconnell, County Limerick, Ireland\n| death_place   = Castleconnell, County Limerick, Ireland\n| branch        =\n| branch_label  = Paramilitaries\n| unit          = Balcombe Street gang\n| battles       = The Troubles\n| battles_label = Conflict\n}}\nEdward Butler (17 April 1949 – 2 May 2024) is a former member of both the Official Irish Republican Army and the Provisional Irish Republican Army (IRA). He was part of different IRA units based in Ireland and then England. Butler and three others were called the \"Balcombe Street Gang\" or the \"Balcombe Street Four\" by news media during a five-day siege in the street of that name near Marylebone station, London. He and his co-accused were gaoled for seven murders plus other charges.\nBiography\nHe was one of seven children. His mother was from Castleconnell, County Limerick – where he grew up – and his father from Carrick-on-Suir, County Tipperary. His father had been a private in the Irish defence forces. The family lived in a cottage in Castleconnell. Butler became a labourer, working for the old Limerick County Council. He was inspired by the civil rights marches in the late sixties. He sold republican newspapers outside the local church, St. Joseph's. After joining the Official IRA, he left to join the Provisionals when the former announced a ceasefire in 1972. He spent time with a border unit in Ireland and left his home area about a year before he was caught in London.\nThe high number of attacks by the Provisional IRA in Great Britain had exercised British police forces. Spanning 14 months, there were 40 explosions and 35 people killed. Operation Comb had been instigated, involving approximately a thousand plain-clothes detectives deployed to observe London's streets. On 6 December 1975, officers working for the Metropolitan Police chased Butler, Joe O'Connell, Hugh Doherty and Harry Duggan by car through London's streets after they'd witnessed the group directing automatic fire into Scott's restaurant in Mayfair. They became trapped, forced their way into the home of Sheila and John Matthews at 22B Balcombe Street and kept the couple as hostages for five days. With constant media coverage and after food parcels from the balcony above, appeals and days of negotiations, the four surrendered, staggering their exit between the release of their hostages.\nButler and the three others were convicted of the murders of Roger Goad, Gordon Hamilton Fairley, Robert Anthony Lloyd, Graham Ronald Tuck, Audrey Edgson and John Francis Bately – all killed by bombs – and Ross McWhirter – shot at his home. On 10 February 1977, Judge Joseph Cantley sentenced the four to 47 life terms, recommending 30-year terms of imprisonment. There was a claim that Butler and colleagues were an SAS-style, highly trained and independent unit, unknown to the local Republican community, referred to as \"the most violent, ruthless and highly-trained unit ever sent to Britain by the Provisional IRA.\"\nIn May 1998, after 23 years in British prisons, Butler was moved from England to Portlaoise Prison, a few days later spending time celebrated with his gaoled colleagues at Sinn Féin's Ard fheis, before returning to Portlaise. He was released the following April, just before his 50th birthday, under the terms of the Good Friday Agreement. Archives were released in 2009 indicating a collection of planned targets for attack; a list of human targets – seen by Prime Minister Harold Wilson – was withheld.\nButler died on 2 May 2024 in Castleconnell.\nReferences"
    }
  ]
}