{
  "content": [
    {
      "type": "text",
      "text": "# Edward Watson (dancer)\n\nEdward Watson MBE (born 21 May 1976) is a British ballet dancer. He is a retired principal dancer and currently a coach with the Royal Ballet in London.\nEarly years\nEdward Watson was born in Bromley, Kent and was brought up in Dartford with his twin sister, Liz.  He first attended dance classes at the age of 3, and was later accepted as a student at the Royal Ballet School, eventually joining the full-time school at White Lodge, Richmond Park.  Whilst at the school, he trained with Anatoly Grigoriev, a former dancer of the Kirov Ballet and was one of six male students who graduated into the Upper School at the age of 16.  At the Upper School his teachers included German Zammel and Julie Lincoln.  Whilst training at the Upper School, Watson danced a number of roles:\n*Checkmate by Ninette de Valois, 1993 (Role: Black Castle)\n*Simple Symphony by Matthew Hart, 1993\n*Monotones No. 2 by Frederick Ashton, 1994\n*Napoli by August Bournonville, 2004 (Role: Pas de Six)\nCareer\nWatson graduated into The Royal Ballet in 1994 and was promoted to Principal in 2005. His repertory with the Company includes major roles in works by Frederick Ashton and Kenneth MacMillan. His many role creations for Wayne McGregor include in Symbiont(s), Qualia, Chroma, Infra, Limen, Carbon Life, Raven Girl, Tetractys, Woolf Works, Obsidian Tear and Multiverse, and for Christopher Wheeldon Lewis Carroll/The White Rabbit in Alice’s Adventures in Wonderland), Leontes in The Winter’s Tale and John Singer Sargent in Strapless. Watson has worked with numerous other choreographers, including Siobhan Davies, David Dawson, Javier de Frutos, Alastair Marriott, Cathy Marston, Ashley Page and Arthur Pita.\nIn August 2020, it was announced that Watson would retire following a performance of McGregor's The Dante Project. He has remained with the company as a coach. His official title is répétiteur to the principal dancers.\nAwards\nAt the National Dance Awards in 2008, Watson won 'Best Male Dancer'. He also won the Olivier Award in 2012 for Outstanding Achievement in Dance for his performance as Gregor Samsa in Arthur Pita's interpretation of Franz Kafka's Metamorphorsis at the Linbury Studio. In 2015 he won Prix Benois de la Danse for his performance as Leontes in Christopher Wheeldon ''The Winter's Tale'' at the Royal Ballet.\nHonours\nIn the 2015 Birthday Honours, Watson was appointed a Member of the Order of the British Empire (MBE) for services to dance.\nReferences"
    }
  ]
}