{
  "content": [
    {
      "type": "text",
      "text": "# Edward Lewknor (died 1605)\n\nSir Edward Lewknor or Lewkenor (1542 – 19 September 1605) was a prominent member of the puritan gentry in East Anglia in the later Elizabethan period, and an important voice on religious matters in the English Parliament.\nOrigins and young life\nEdward was the eldest son of the courtier Edward Lewknor of Kingston Buci, Sussex, and his wife Dorothy, daughter of Robert Wroth and Jane Hawte, and sister of Sir Thomas Wroth. His father grew up in the wardship of Robert Wroth (an associate of Thomas Cromwell and Richard Rich), who left directions in his will (1536) for the marriage of his ward to his daughter Dorothy. The elder Lewknor's career as a courtier benefited from the high favour in which King Edward VI held his brother-in-law Thomas Wroth, one of the Gentleman of the Privy Chamber, whose wife Mary was a daughter of Richard Rich. However, with King Edward's death and the accession of Queen Mary in 1553, Wroth (a strong favourer of the Protestant reform) went with Sir John Cheke and Sir Anthony Cooke into exile abroad.\nThe elder Lewknor, who was reputedly Groom Porter to both monarchs, kept his position at court, but became implicated in the \"Dudley conspiracy\" (of Henry Dudley and Henry Peckham) to depose Queen Mary and install her sister Elizabeth when he used his situation to procure a copy of King Henry VIII's will on their behalf. In 1556 he was found guilty of treason, attainted, and imprisoned in the Tower of London under deferral of execution awaiting a possible pardon. At this time the Queen sought urgently to force Sir Thomas Wroth to return to England, but without success, and after three months in the Tower attended by his wife and one of his daughters Lewknor expired there in September 1556. His son Edward at the age of 14 therefore faced a complete reversal of his childhood status and expectations when his father was buried at the Tower.\nMany lands, including the manor and advowson of Hamsey, East Sussex, were restored to his mother in February 1556/57 by Mary's Letters Patent. In the first year of Elizabeth an act was passed, on the petition of Lewknor's four sons (Edward, Thomas, Stephen and William) and six daughters (Jane, Maria, Elizabeth, Anne, Dorothie and Lucrece) to restore them to their blood, lineage and degree. This restored all their ancestral hereditaments excepting those held in use, possession or reversion by their father at the time of his treason and attainder, or any which either Mary or Elizabeth should have found cause to withhold. They were therefore entitled to make their pedigrees as Lewknor's heirs as if he had never been attainted, and to make conveyances thereof, except of lordships, honours and other benefits to which their Majesties were entitled on account of the attainder.\nHis fortunes so far restored, Edward was educated at St John's College, Cambridge, matriculating a pensioner at Easter 1559 and graduating B.A. in 1561, and was a fellow of the college from 1561 to 1563. He entered the Middle Temple in 1562 to study law. His son recorded in his father's printed epitaph that he next found some service in the royal household of Queen Elizabeth. His next brother Thomas Lewknor (presumably the same who matriculated from Trinity College, Cambridge in Lent term 1557–58 and graduated B.A. in 1562–63) was presented Rector of Hamsey by the Diocesan 'by lapsed authority' in 1563, remaining until 1568.\nMarriage and relocation to Suffolk\nAround 1570 Edward married Susan, daughter of Sir Thomas Heigham of Higham Hall, Suffolk and his wife Martha, daughter of Sir Thomas Jermyn of Rushbrooke Hall. While his mother Dorothy Lewknor remained of Kingston Buci, in consequence of his marriage Edward moved to Suffolk, settling at Denham near Bury St Edmunds, Suffolk, near to Rushbrooke and Higham, and established his family there, where the male line continued in three generations. This placed him firmly within the kinship of the central East Anglian gentry, and, so far as his immediate Jermyn and Heigham relations were concerned, with a group embodying the radical puritan interest in Suffolk. Lewknor assumed this role naturally and energetically: the twin social pillars of the magistracy and ministry working together under the authority of this particular family group (which had a strong parliamentary presence) form the subject of an oft-quoted case-study by Professor Collinson.\nSusan Heigham's father Sir Thomas Heigham was the grandson and senior heir of John Heigham (died c. 1522), whose younger brother Clement Heigham of  Lavenham (died 1500) was father of Sir Clement Heigham of Barrow, Suffolk (died 1571) Speaker of the House of Commons in 1554, an open Catholic, and a notable persecutor of Protestants. Speaker Higham's son Sir John Heigham (died 1626), however, with whom Lewknor had more to do, was a central patron of the puritan movement in East Anglia. The Jermyns were similarly bi-partisan. Martha Jermyn's father Sir Thomas died in 1552, and her brother Sir Ambrose Jermyn (died 1577) was reportedly a fervent Roman Catholic and strong persecutor of Protestants in East Anglia during the reign of Queen Mary, but by another account took immediate steps to curb the excesses of commissioners as soon as Elizabeth came to the throne. His son, Sir Robert Jermyn (died 1614), however, was an uncompromising puritan and patron, and the associate of John Heigham.\nMartha Heigham held the manor of Denham as her jointure and may have been responsible for building Denham Hall (beside the church), the old fabric of which remains behind its later facade. Strongly puritan in sympathy, she lived down to 1593. Her minister there was Robert Pricke, alias Oldmayne, whose family name was apparently changed to evade persecution during Mary's reign. In 1577 Oldmayne baptized his son Timothy at Denham, and remained minister there for 30 years throughout the time of Edward and Susan Lewknor. In 1581 Robert Jermyn's sister Frances died leaving endowments for Fellowships at St John's and Trinity College, Cambridge, granting Robert the choice of appointments, and she gave copies of the Tremellius bible to several East Anglian ministers including Richard Pricke and John Knewstub. Upon the foundation of Emmanuel College, Cambridge in 1584, Sir Robert's heir Thomas Jermyn was at once enrolled, Sir Robert himself endowed a Fellowship there, and a lasting connection was begun in which the Lewknors followed.\nParliament\nLewkenor was sponsored in a successful Parliamentary career by Puritan sympathisers such as the Earl of Leicester, with whose help in 1571 he was elected MP for Tamworth. In 1572 he was elected MP for New Shoreham, near his ancestral domains. He was then elected for Maldon in 1584 and 1586. Lewknor, Sir John Heigham (knighted 1579, MP for Ipswich in 1584 and for Suffolk in 1586) and Sir Robert Jermyn (MP for Suffolk in the same parliaments) led a strongly Puritan faction in Parliament, often working together in committee, advocating the importance of a learned clergy and the reform of episcopal powers and activities, with which Jermyn in particular came into direct confrontation.\nIn 1584 Lewkenor was involved with a bill for the more reverent observation of the Sabbath – which, as an intervention in Church affairs, met with royal resistance. Later in that year he served on a committee to consider petitions for the liberties of godly preachers. In 1585 he offered a petition concerning abuses in the ministry on behalf of the people of Sussex, simultaneously overseeing the formulation of an official prayer of thanksgiving to God for the great benefits bestowed upon the realm by Queen Elizabeth, to be used in Parliamentary proceedings. In late 1586, in test or proof of this loyalty, he, Heigham and Jermyn were appointed with others to consider a means by which Mary, Queen of Scots might be brought to the execution of justice.\nThis, however, did not protect him when, in 1587, a revised Book of Common Prayer and accompanying bill were put before the House by Anthony Cope, M.P. for Banbury, Oxfordshire. It was hoped thereby to reform certain problems in ecclesiastical affairs, and the proposer asked for it to be read and to be approved to replace the existing books in all churches. Lewkenor was among those who spoke, solemnly but unsuccessfully, in favour of its reading. These proceedings caused immediate royal disapproval, and when an issue of freedom of speech was raised the Member doing so (Peter Wentworth) was sent to the Tower of London. On the following day Cope and three others including Edward Lewkenor were also imprisoned there. Sir John Heigham and Sir Robert Jermyn were among those appointed 11 days later to consider their release: their durance lasted about a month.\nLater life\nLewkenor was not in the Parliament of 1588–89. In 1589, when he sat for Maldon again, his mother Dorothy Lewknor died at Kingston Buci, making Edward sole executor responsible for her legacies. In these she and he were bound by a recognizance of two thousand marks made with her kinsman Sir Francis Walsingham in 1570, limiting to £1000 any bequests or payments thereof made to unmarried daughters, with which she exactly complied. In 1594 Lewknor sold the manor and advowson of Hamsey, which in 1563 had been granted to him in reversion to take effect after his mother's death. In the previous year, he once more sitting for Maldon, his mother-in-law Martha Heigham died at Denham, also making Edward her sole executor and leaving him very extensive estates, Denham itself coming to him in Susan's share of the matrilineal inheritance divided between the two Heigham daughters.\nMartha by her will established a scholarship at Emmanuel College (which it fell to Edward Lewknor to implement) on condition that it be enjoyed by Timothy Oldmayne when he should be ready to take it up, which Timothy accordingly did in 1595, proceeding to BA in 1598–99 and MA in 1602. Robert Jermyn, the younger son of Sir Robert, matriculated from Emmanuel in 1597 and graduated BA in 1599–1600. The Suffolk preacher Richard Blackerby, meanwhile, of Trinity College (admitted 1587, BA c. 1590), who was greatly influenced by the teaching of William Perkins, on leaving Cambridge lived in the household of Sir Robert Jermyn as his chaplain, and then for two years lived at Denham in the same capacity to the Lewknors, before marrying Timothy Oldmayne's sister. Lewknor's elder son, Edward, was admitted to Emmanuel in 1599.\nEdward Lewknor was MP for Newport, Cornwall in 1598. He continued active in parliamentary business of various kinds, including the extended consideration of proposed bills for relief of the poor and prevention of idle beggars in November 1597. Having been knighted by King James I in 1603, he was returned as MP for Maldon in 1604, and resumed his intense involvement in questions of church and religion. In particular he strongly advocated that the requirement of subscription should extend only to the Thirty-nine Articles and not to the Prayer-book, so that the \"godly ministers\" should not be excluded from the established ministry.\nThe younger Edward Lewknor (the second of Denham) was admitted pensioner at Emmanuel College in July 1604, and his elder brother graduated BA in 1605. Called home from Cambridge to Denham with a neighbour's son in 1605, to avoid a smallpox outbreak, the friend brought the infection with him which, at the beginning of October 1605, claimed the lives of their mother and father on consecutive days.\nDeath and exequies\nThe dates of death for Dame Susan (who died first) and Sir Edward vary slightly between the tomb inscription (2 and 3 October), the printed epitaph and the funeral certificate (3 and 4 October). They were buried in St Mary's church, Denham on 5 October 1605, and Sir Edward was succeeded as heir by his elder son Edward Lewknor.\nThe funeral, which was held on 9 January following, was a formal heraldic occasion, his sons, daughters and sons-in-law attending as mourners, the standard being borne by his sister Mary's son John Machell, and the pennon by Edward as Chief Mourner. Robert Prick alias Oldmayne delivered a funeral sermon which was published. Edward the son erected an elaborate canopied table monument featuring painted stone carvings of Sir Edward, his wife and their eight children at prayer, within a chapel in the church recently built for that or another purpose. He also published a Threnody for his father, in which Latin, English, Greek and Hebrew verse tributes from many university theologians were collected, including some lines from William Bedell, then of Emmanuel College and afterwards of Horringer, and from Joseph Hall, also of Emmanuel, then minister at Hawstead.\nThe funeral was directed by the Richmond and Somerset Heralds (John Raven and Robert Treswell). The heraldry of the tomb includes as a canopy centrepiece a shield with many quarterings alluding to the ancestry of Lewkenor's great-grandfather, another Sir Edward (d. 1522), both in his paternal descent from the Bardolph, Tregoz, Noel and D'Oyly, the Dallingridge and Echingham families, and in his maternal Camoys and De Braose inheritance through Elizabeth (Isabella) Radmylde. It is an emblazoning to represent the House of Lewkenor of Kingston Buci in that branch, no additional heraldry being shown for the intervening generations. The meaning and contemporary understanding of this descent is shown in an extensive pedigree drawn up in 1612 and 1615 in the time of the younger Sir Edward Lewkenor, who in 1610 became son-in-law of Sir Henry Neville.\nIn an equivalent position at either end of the canopy are impalements showing the same quarterings for Lewkenor (dexter) with eight-quarters for Heigham (sinister). Individual Lewkenor impalements for the marriages of Sir Edward's children are displayed on the transoms of the canopy, those at the eastern side being prepared for the two sons with the sinister pales left invitingly blank. The Latin tomb inscription (no doubt written by his son Edward) refers to his loyal and valuable services for court, parliament and commonwealth, which earned him the approbation of all good men, and his work to introduce the preaching of the Gospel in Denham. The Christian virtues of Dame Susan, her devout modesty, chastity, generosity and kindness to the poor are also commended.\nSir Edward died possessed of considerable estates (including the half of Sir Thomas Heigham's estate which his wife had inherited), to which his eldest son was heir. The Inquisition post mortem was held on 9 January 1605/06.\nChildren\nThe children of Sir Edward Lewkenor and his wife Susan Heigham are shown as follows:\n*Dorothie (1575–1603), married Robert Castell, armiger, of East Hatley, Cambridgeshire. She is said to have died without issue, though a son Robert was christened at Denham in 1598. She died before her parents, and is not among the mourners depicted on Sir Edward's tomb. Sir Robert remarried and had five children, the elder son being named Robert.\n*(Sir) Edward (1586–1618), of Denham Hall, was admitted pensioner at Emmanuel College, Cambridge in 1599 and proceeded to B.A. in 1604–05. He married (?1607 or 1610) Mary, daughter of Sir Henry Neville and Ann Killegrew of Billingbear House, Berkshire, by whom he had six children. He was knighted in 1606, was M.P. for West Looe in the Parliament of 1614 and served as High Sheriff of Suffolk in 1617, while holding which office he died. He was buried at Denham.\n*(Sir) Robert (1588–1636), was admitted pensioner at Emmanuel College in 1604. He was knighted in 1607, married Mary (daughter and coheir of Alexander Hamon of Acrise, Kent), by whom he had five children. Sir Robert was to inherit the manor of Kingston Buci, but also inherited the manor of Acrise from his father-in-law, and was High Sheriff of Kent in 1630.\n*Hester (d. 1612), married (1601) Robert Quarles of Romford, Essex, eldest son of James Quarles of Ufford near Peterborough, Clerk of the Green Cloth. Robert, knighted in 1608, was brother of the poet Francis Quarles. Robert made two further marriages.\n*Anne (d. 1608), married (c. 1598) Godfrey Rodes, armiger, of Great Houghton, Yorkshire, eldest son of the second marriage of the judge Sir Francis Rodes of Barlborough Hall. They had five children.\n*(Martha, died in childhood).\n*Martha (d. before 1639), married Thomas Gurney, armiger, eldest son of Henry Gurney of Ellingham, Norfolk. They had eight children. She survived her husband and was buried at Barsham, Norfolk.\n*Sarah, married Thomas Stuard, armiger, son of Thomas Stuard of Barton Mills, Suffolk (and probably grandson of Simeon Stuard of Lakenheath). Six of their children were christened at Denham between 1608 and 1619.\n*Elizabeth (b. 1591), married (before 1618) Thomas Catelyn (possibly second son of Richard Catelyn or Catlin, Serjeant-at-arms, of Wingfield Castle). Three of their children were christened at Denham between 1619 and 1622.\n*Susan (d. 1609), without issue.\nReferences\nExternal links\n*[http://www.oxforddnb.com/view/article/74412?docPos=1 Entry in Oxford DNB]"
    }
  ]
}