{
  "content": [
    {
      "type": "text",
      "text": "# Edward Rochester\n\n|children          =\n|relatives         =\n|home              = Thornfield Hall\n}}\nEdward Fairfax Rochester (often referred to as Mr Rochester) is a character in Charlotte Brontë's 1847 novel Jane Eyre. The brooding master of Thornfield Hall, Rochester is the employer and eventual husband of the novel's titular protagonist, Jane Eyre. He is regarded as an archetypal Byronic hero.\nIn Jane Eyre\nEdward Rochester is the oft-absent master of Thornfield Hall, where Jane Eyre is employed as a governess to his young ward, Adèle Varens. Jane first meets Rochester while on a walk, when his horse slips and he injures his foot. He does not reveal to Jane his identity and it is only that evening back at the house that Jane learns he is Mr Rochester.\n(1840–1875)]]\nRochester and Jane are immediately interested in each other. She is fascinated by his rough, dark appearance as well as his abrupt manner. Rochester is intrigued by Jane's strength of character, comparing her to an elf or sprite and admiring her unusual strength and stubbornness. The two quickly become friends, often arguing and discussing topical matters. Rochester confides to Jane that Adèle is the daughter of his past lover, French opera dancer Céline Varens, who had run off with another man. Rochester does not claim paternity of Adèle but had brought the orphaned child to England.\nRochester quickly learns that he can rely on Jane in a crisis. On one evening, Jane finds Rochester asleep in his bed with all the curtains and bedclothes on fire; she puts out the flames and rescues him. Jane and Rochester grow closer and fall in love with each other.\nWhile Jane is working at Thornfield, Rochester invites his acquaintances over for a week-long stay, including the beautiful socialite Blanche Ingram. Rochester lets Blanche flirt with him constantly in front of Jane to make her jealous and encourages rumours that he is engaged to Blanche, which devastates Jane. Rochester tells Jane he is to be married, at which point Jane is prepared to leave Thornfield, believing Blanche is his bride. Eventually Rochester stops teasing Jane, admitting that he loves her and that he never intended to marry Blanche, especially as he had exposed Blanche's interest in him as solely mercenary when he caused a rumour that he is far less wealthy than she imagined. He asks Jane to marry him and she accepts.\nDuring their wedding ceremony, two men arrive claiming that Rochester is already married. Rochester admits to this, but believes he is justified in his attempt to marry Jane. He takes the wedding party to see his wife of fifteen years, Bertha Antoinetta Mason, and explains the circumstances of his marriage. He claims he had been rushed into marrying Bertha by his father and the Mason family, and only after they were wed did he discover that Bertha is violently insane. Unable to live with Bertha due to her madness, Rochester tried to keep her existence a secret and kept her on the third floor of Thornfield Hall with a nursemaid, Grace Poole. It was Bertha who had set Rochester's bedsheets on fire, along with a number of other disruptive incidents. Rochester confesses that he had travelled around Europe for ten years trying to forget his failed marriage and keeping various mistresses. Eventually he gave up on searching for a woman he could love, came home to England, and fell in love with Jane.\nRochester asks Jane to go to France with him, where they can pretend to be a married couple. Jane refuses to be his mistress and runs from Thornfield. Much later, she finds out that Rochester searched for her everywhere, and, when he couldn't find her, sent everyone else away from Thornfield and shut himself up alone. After this, Bertha set the house on fire one night and burned it to the ground. Rochester rescued all the servants and tried to save Bertha, too, but she committed suicide by jumping from the roof of the house and he was injured. Now Rochester has lost an eye and a hand and is blind in his remaining eye.\nJane returns to Mr Rochester and offers to take care of him as his nurse or housekeeper. He asks her to marry him and they have a quiet wedding. They adopt Adèle Varens, and after two years of marriage Rochester gradually gets his sight back – enough to see his and Jane's firstborn son.\nCharacteristics\nRochester is depicted as aloof, intelligent, proud and sardonic. A Romantic figure, he is passionate and impetuous, but tormented beneath his brusque manner. Mrs Fairfax states that he \"is nearly forty\".}} Rochester is described as being of average height and an athletic build, \"broad-chested and thin-flanked, though neither tall nor graceful.\" His face is described as not beautiful, but \"harsh featured and melancholy looking\". He is described as having black hair, a \"decisive nose\", a \"colourless, olive face, square, massive brow, broad and jetty eyebrows, deep eyes, strong features,\" and a \"firm, grim mouth\". In the novel, Jane often compares him to a wild bird, such as an eagle, falcon and cormorant. During the fire at Thornfield he loses a hand, one eye and his sight, which is only partially returned after he marries Jane.\nRochester is described to have a fine singing voice — \"a mellow, powerful bass\" — and acting skills which he displays during entertainments for his guests. He is adept at disguise and deception; while his guests are staying, Rochester disguises himself as a fortune-teller gypsy woman in order to spend time alone with Jane and interrogate her about how she feels about her employer.\nInfluences\nCharlotte Brontë may have named the character after John Wilmot (1647–1680), the second Earl of Rochester. Murray Pittock argued that the Earl is not merely Rochester's namesake but that his \"career as it was popularly recorded is the model for the rakehell and penitent phases underlying the development of Mr. Rochester's character.\" Robert Dingley argued that it is possible Brontë drew specifically upon Wilmot's depiction in William Harrison Ainsworth's 1841 novel ''Old St. Paul's'', wherein the Earl has a penchant for disguise and twice attempts to entrap the woman he loves in a spurious marriage.\nLiterary critics also note the influence of Lord Byron, of whom Brontë was a known admirer, on Rochester's development. The character's threads of Byronism evolved out of Brontë's intimate knowledge of Byron's works including Cain, ''Childe Harold's Pilgrimage and Don Juan'', as well as Thomas Moore's Life of Byron, and William Finden's engravings illustrating Byron's poetry and life. Caroline Franklin specified the narrator of Don Juan as potentially a significant inspiration behind Rochester's mercurial and seductive mannerism.\nThe character was also influenced by the men in Brontë's personal life. Andrew McCarthy, the director of the Brontë Parsonage Museum, suggested that Rochester may have been inspired by Constantin Heger, a tutor whom Brontë fell in love with while studying in Brussels in 1842. John Pfordresher, author of The Secret History of Jane Eyre, argued that besides Heger, real-life influences on the character were Brontë's ill-tempered father, Patrick, and hedonistic brother, Branwell. In Patrick, Pfordresher argued, Brontë \"had observed Rochester’s physical vigor, determined will, passionate temper, and defiant courage.\" When Patrick began to suffer from cataracts in his old age, Brontë nursed him, as Jane Eyre does the blinded Rochester. Pfordresher argued that Rochester's hedonistic tendencies were inspired by Branwell — who was fired for having an affair with his employer’s wife before becoming the \"self-destroying family humiliation\" through his abuse of alcohol and opium — and that Jane's playful exchanges with Rochester were based on Brontë's habit of sparring with her brother, \"her mental equal\" and childhood companion.\nThemes\nByronic hero\nAlongside Heathcliff from Emily Brontë's Wuthering Heights, Rochester is commonly regarded as an archetypal Byronic hero — a \"passionate hero with a darkly mysterious erotic past\".\nAllusions to folklore\nLiterary critics note Rochester as a parallel of the titular character in the French folktale \"Bluebeard\" — a wealthy serial bridegroom who keeps the remains of his previous murdered wives in a locked room of his castle. Rochester echoes Bluebeard as a wealthy, middle-aged gentleman with a wife kept in a secret attic of his house, and like Bluebeard, is \"a man of voracious sexual appetite.\" Brontë alluded to Bluebeard in her description of Rochester and his home. Before Rochester's wife's existence is revealed the novel describes the third story of Thornfield Hall where Bertha is secretly kept as looking \"like a corridor in some Bluebeard’s castle\". While negotiating the terms of her marriage to him, Jane refers to Rochester as a \"three-tailed bashaw\", a title that was applied to the character of Bluebeard in late 18th-century texts. John Sutherland argues that Rochester is also a wife-killer like Bluebeard; questioning why Rochester does not place Bertha in professional care for her insanity, he considered the character to be responsible for Bertha's death through \"indirect assassination\".\nRochester has also been equivalated with the sultan Shahriyar in the Middle Eastern folktale collection Arabian Nights, as a disillusioned despot who distrusts women. Like Shahriyar, Rochester is tamed and eventually reformed by an intelligent woman. Brontë made several direct references to Arabian Nights in Jane Eyre, including having Jane compare Rochester to a sultan.\nAbigail Heiniger wrote that Jane Eyre resonates closely with the motifs of Beauty and the Beast as \"Rochester is not a Prince Charming; he is a beast in need of rehumanising.\" Rochester resembles the Beast because he is repeatedly described as not being handsome, Karen Rowe wrote, arguing that associating him with the Beast emphasises Jane's confrontation with male sexuality, symbolised by Rochester's \"animality\". Rowe argues that Rochester transforms in Janes eyes from \"monster to seeming prince to an 'idol'\", showing her that \"immersion in romantic fantasy threatens her integrity\".\nReception\nRochester was voted the most romantic character in literature in a 2009 UK poll by Mills & Boon. Commenting on the poll in The Daily Telegraph, novelist Penny Vincenzi said the result was \"no surprise\", as Rochester is endowed with a \"brooding, difficult, almost savage complexity\".\nIn other literature\nRochester features in much literature inspired by Jane Eyre, including prequels, sequels, rewritings and reinterpretations from different characters' perspectives.\nSeveral novels retell Jane Eyre from the perspective of Rochester. The 2017 novel Mr. Rochester by Sarah Shoemaker gives an account of Rochester's childhood and life prior to his meeting Jane through to the events of the original novel. Rochester is given a childhood to mirror Jane Eyre's, with a father and brother who are cruel towards him and being raised in a boarding school.\nThe 2023 novel, Jane & Edward: A Modern Reimagining of Jane Eyre by Melodie Edwards is a re-telling of the Jane Eyre story set in contemporary times.\nWide Sargasso Sea\nJean Rhys' 1966 novel Wide Sargasso Sea gives an account of Rochester's meeting of and marriage to Antoinette Cosway (Rhys' revision of Bertha Mason). The first part of the novel is told from the point of view of Antoinette and the second part from Rochester's perspective. The novel depicts Rochester as an unfaithful and cruel spouse, and in its reshaping of events related to Jane Eyre suggests that Bertha's madness is not congenital but instead the result of negative childhood experiences and Mr. Rochester's unloving treatment of her.\nRochester has appeared in adaptations of Wide Sargasso Sea.\nPortrayals in media\nJane Eyre adaptations\nFilm\nSilent films\nas Rochester with Alice Brady as Jane in Woman and Wife (1918)]]\n*Frank H. Crane in Jane Eyre (1910)\n*John Charles in Jane Eyre (1914)\n*Irving Cummings in Jane Eyre (1914)\n*Franklin Ritchie in Jane Eyre (1915)\n*Elliott Dexter in Woman and Wife (1918)\n*Norman Trevor in Jane Eyre (1921)\n*Olaf Fønss in Orphan of Lowood (1926)\nFeature films\nas Rochester with Joan Fontaine as Jane in Jane Eyre (1943).]]\n*Colin Clive in Jane Eyre (1934)\n*Orson Welles in Jane Eyre (1943)\n*Dilip Kumar as Shankar, Rochester's equivalent in the 1952 Hindi-language adaptation Sangdil ()\n*Yehia Chahine as Murad, Rochester's equivalent in the 1962 Egyptian adaption The Man I Love\n*Kalyan Kumar as Rochester's equivalent in the 1968 Indian Kannada-language film Bedi Bandavalu\n*Gemini Ganesan as Baskar, Rochester's equivalent in the 1969 Indian Tamil-language film Shanti Nilayam ()\n*George C. Scott in Jane Eyre (1970)\n*William Hurt in Jane Eyre (1996)\n*Ciarán Hinds in Jane Eyre (1997)\n*Michael Fassbender in Jane Eyre (2011)\nRadio\n*Orson Welles in Jane Eyre by The Campbell Playhouse (31 March 1940)\n*Brian Aherne in Jane Eyre by The Screen Guild Theater (2 March 1941)\n*Orson Welles in Jane Eyre by The Lux Radio Theatre (5 June 1944)\n*Victor Jory in Jane Eyre by Matinee Theater (3 December 1944)\n*Orson Welles in Jane Eyre by The Mercury Summer Theatre of the Air (28 June 1946)\n*Robert Montgomery in Jane Eyre by The Lux Radio Theatre (14 June 1948)\n*Ciarán Hinds in Jane Eyre on BBC Radio 7 (24-27 August 2009)\n*Tom Burke in Jane Eyre on BBC Radio 4's 15 Minute Drama (2016)\nTelevision\n*Charlton Heston in the Studio One in Hollywood episode Jane Eyre, aired on 12 December 1949\n*Kevin McCarthy in the Studio One in Hollywood episode Jane Eyre, aired on 4 August 1952\n*Stanley Baker in the 1956 BBC miniseries Jane Eyre\n*Patrick Macnee in the 1957 NBC Matinee Theatre drama Jane Eyre\n*Zachary Scott in Jane Eyre, a 1961 television film directed by Marc Daniels\n*Richard Leech in the 1963 BBC series Jane Eyre\n*Jan Kačer in Jana Eyrová, a 1972 production by Czechoslovak Television\n*Michael Jayston in the 1973 BBC serial Jane Eyre\n*Joaquín Cordero as Eduardo, Rochester's equivalent in the 1978 Mexican telenovela Ardiente secreto ()\n*Joe Flaherty in BBC Classics Presents: Jane Eyrehead, a parody by SCTV (1982)\n*Timothy Dalton in the 1983 BBC serial Jane Eyre\n*Toby Stephens in the 2006 BBC serial Jane Eyre\n*Ravindra Randeniya as Edward Deraniyagala, Rochester's equivalent in the 2007 Sri Lankan teledrama Kula Kumariya, screened on Swarnavahini\nTheatre\n*Reginald Tate in Jane Eyre: A Drama of Passion in Three Acts (1936) adapted by Helen Jerome. The production was aired on British television in 1937.\n*Henry Edwards in The Master of Thorfield (1944) adapted by Dorothy Brandon.\n*In the 1958 production of Huntington Hartford's American play The Master of Thornfield, Rochester was portrayed by Errol Flynn. After Flynn withdrew from the production it was renamed Jane Eyre and Eric Portman cast as Rochester.\n*Charles McKeown in Jane Eyre (1973), adapted by John Cannon.\n*In the musical Jane Eyre, Rochester was portrayed by Anthony Crivello from 1995 to 1996 and James Stacy Barbour from 1999 to 2000.\nWide Sargasso Sea adaptations\n*Nathaniel Parker in the 1993 film Wide Sargasso Sea\n*Rafe Spall in the 2006 television adaption Wide Sargasso Sea.\n*Trystan Gravelle in the 2016 BBC Radio Four dramatization Wide Sargasso Sea (repeated 2020).\nNotes\nReferences\n;Print sources\n:Websites and news articles are listed in the References section only.\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\nExternal links\n*[https://web.archive.org/web/20210527050034/https://www.bbc.co.uk/bitesize/guides/zyvbgk7/revision/3 Edward Rochester] at BBC Bitesize\n*[https://www.sparknotes.com/lit/janeeyre/character/edward-rochester/ Edward Rochester] at SparkNotes\n*[https://www.yorknotes.com/alevel/english-literature/jane-eyre/study/critical-approaches/02000100_characterisation Mr Rochester and St John Rivers] at York Notes\n*[https://www.britannica.com/topic/Mr-Rochester Edward Rochester] at Encyclopædia Britannica\n*[https://www.oxfordreference.com/view/10.1093/oi/authority.20110803100425376 Edward Fairfax Rochester] at Oxford Reference"
    }
  ]
}