{
  "content": [
    {
      "type": "text",
      "text": "# Edward Cresy\n\nEdward Cresy FSA (7 May 1792 – 12 November 1858) was an English architect and civil engineer.\nLife\nCresy was born at Dartford, Kent, and was educated at Rawes's academy at Bromley in the same county. He became a pupil of James T. Parkinson, architect, of Ely Place, who, in addition to a moderate private practice, was entrusted at that time with the laying out of the Portman estate. After the termination of his articles, with the object of perfecting himself in the financial branches of his profession, he served two years with George Smith of Mercers' Hall, and in 1816, accompanied by his friend and colleague George Ledwell Taylor, he undertook a walking tour through England for the purpose of studying, measuring, and drawing the cathedrals and most interesting buildings. The next three years found Cresy and Taylor engaged in similar pursuits on the continent; chiefly on foot, they journeyed through France, Switzerland, Italy, and Greece, to Malta and Sicily, and back again by Italy and France home. The chief aim of their studies was to present the dimensions of each building in English measurements, and the foliage and ornaments one quarter of the real size. Having returned to England the two friends published The Architectural Antiquities of Rome, measured and delineated by G. L. Taylor and E. Cresy, (2 vols. fol., London, 1821–22; new edition, including the more recent discoveries [edited by A. Taylor], fol., London, 1874); and a few years later Architecture of the Middle Ages in Italy illustrated by views … of the Cathedral, &c. of Pisa (fol., London, 1829). A third work on the architecture of the Renaissance was to have followed, but after the publication of two parts, was abandoned from want of encouragement.\nCresy hastily accepted an engagement in Paris, where he designed the Square d'Orléans, which although successful interfered with his professional prospects at home. His practice was almost exclusively private, as he considered the system of open competition to be injurious to art. In his capacity of a superintending inspector under the general board of health Cresy did good work in a branch of engineering then all but unknown, and  gave evidence before the Health of Towns and Metropolitan Sanitary Commission.\nHe became a fellow of the Society of Antiquaries in 1820, and was also a member of the British Archaeological Association.\nPublications\nCresy furnished materials for the Appendix to Report on Drainage of Potteries,  1849, &c., and wrote the Report as to the Fall of the Extension of the Main Sewer from the Ravensbourne to the Outlet, 1855, both of which were embodied in the reports of the Metropolitan Commission of Sewers. Among his other works are:\n*A Practical Treatise on Bridge Building (fol., London, 1839).\n*Illustrations of Stone Church, Kent, with an historical account, published for the London Topographical Society )London, 18400.\n*An Encyclopædia of Civil Engineering (8vo, London, 1847; 2nd ed. 8vo, London, 1856).\n*(With Cuthbert William Johnson) On the Cottages of Agricultural Labourers (London [1847]).\nDeath\nCresy died at South Darenth, Kent, on 12 November 1858 (Gent. Mag. 1858, v. 654).\nFamily\nBy his marriage, on 17 March 1824, to Eliza, daughter of W. Taylor of Ludgate Street (ib. xciv. pt. i. p.&nbsp;367), he left two sons and two daughters. His eldest son, Edward, followed his father's profession, and became principal assistant clerk at the Metropolitan Board of Works, and architect to the fire brigade. He died at Alleyn Road, Dulwich, on 13 October 1870, in his 47th year (Times, 14 October 1870; obituary). Mrs. Cresy is known by her translation, with Notes and Additional Lives, of Milizia's Memorie degli Architetti antichi e moderni, 2 vols. 8vo, London, 1826.\nReferences\n* This article incorporates text from\nSee also:\n* Gordon Goodwin, ‘Cresy, Edward (1792–1858)’, rev. Diana Cressy Burfield, first published 2004, 730 words."
    }
  ]
}