{
  "content": [
    {
      "type": "text",
      "text": "# Edward G. Biester Jr.\n\n| term_start2    = January 3, 1967\n| term_end2      = January 3, 1977\n| predecessor2   = Willard S. Curtin\n| successor2     = Peter H. Kostmayer\n| birth_name     = Edward George Biester Jr.\n| birth_date     =\n| birth_place    = Trevose, Pennsylvania, U.S.\n| death_date     =\n| death_place    =\n| party          = Republican\n| education      = Wesleyan University (BS)Temple University (JD)\n}}\nEdward George Biester Jr. (born January 5, 1931) is a retired Republican politician and judge who served as a member of the U.S. House of Representatives from Pennsylvania, from 1967 to 1977. Biester served in the U.S. House of Representatives from 1967 to 1977. He was Pennsylvania's attorney general for from 1979 to 1980 and became a judge in 1980. He graduated from Temple University Law School in 1955.\nBiography\nBiester graduated from George School in Newtown, Bucks County, Pennsylvania in 1948, Wesleyan University in 1952, and Temple University School of Law in 1955. He was Assistant District Attorney for Bucks County, Pennsylvania 1958 through 1964. He was elected as a Republican to the 90th and to the four succeeding Congresses. He was not a candidate for reelection in 1976. In 1977, he was elected to the Common Cause National Governing Board. He was Attorney General of Pennsylvania from 1979 to 1980.\nBiester served as a judge on the Bucks County Court of Common Pleas (7th Judicial District) from 1980 to 2006 and was senior judge from 2001 to 2006. He has been a member of the Office of Military Commissions in the Department of Defense since 2003.\nIn September 2004 he was appointed to the United States Court of Military Commission Review. In April 2007, Biester joined JAMS, The Resolution Experts, as a full-time mediator and arbitrator at the JAMS Philadelphia Resolution Center at the Bell Atlantic Tower on Arch Street.\nReferences\nSources\nExternal links\n* [http://www.jamsadr.com JAMS Website]\n|-\n|-\n''|years=}}"
    }
  ]
}