{
  "content": [
    {
      "type": "text",
      "text": "# Edward the Black Prince__disambig_1\n\n}}\n| issue        =\n| issue-link   = #Family\n| issue-pipe   = more...\n| house        = Plantagenet\n| father       = Edward III of England\n| mother       = Philippa of Hainault\n}}\nEdward of Woodstock (15 June 1330 – 8 June 1376), known as the Black Prince, cites le Baker Chronicle) was Duke of Cornwall (from 1337), the Prince of Wales (from 1343) and the Prince of Aquitaine (1362–1372). Sometimes called Edward IV ( cites Walsingham Eulogium). For details of the origins of the sobriquet \"Black Prince\" see the section \"Appellation 'Black Prince.}} was the eldest son and heir apparent of King Edward III of England. He died before his father and so his son, Richard II, succeeded to the throne instead. Nevertheless, Edward earned distinction as one of the most successful English commanders during the Hundred Years' War, being regarded by his English contemporaries as a model of chivalry and one of the greatest knights of his age. Edward was made Duke of Cornwall, the first English dukedom, in 1337. He was guardian of the kingdom in his father's absence in 1338, 1340, and 1342. He was created Prince of Wales in 1343 and knighted by his father at La Hougue in 1346.\nIn 1346, Prince Edward commanded the vanguard at the Battle of Crécy, his father intentionally leaving him to win the battle. He took part in Edward III's 1349 Calais expedition. In 1355, he was appointed the king's lieutenant in Gascony and ordered to lead an army into Aquitaine on a chevauchée, during which he pillaged Avignonet and Castelnaudary, sacked Carcassonne, and plundered Narbonne. In 1356, on another chevauchée, he ravaged Auvergne, Limousin, and Berry but failed to take Bourges. The forces of King John II of France met Edward's armies near the city of Poitiers. After negotiations between the two sides broke down, the Anglo-Gascon forces under Edward routed the French army and captured King John at the Battle of Poitiers.\nIn 1360, he negotiated the Treaty of Brétigny. He was created Prince of Aquitaine and Gascony in 1362, but his suzerainty was not recognised by the lord of Albret or other Gascon nobles. He was directed by his father to forbid the marauding raids of the English and Gascon free companies in 1364. He entered into an agreement with Kings Peter of Castile and Charles II of Navarre, by which Peter covenanted to mortgage Castro Urdiales and the province of Biscay to him as security for a loan; in 1366 a passage was secured through Navarre. In 1367, he received a letter of defiance from Henry of Trastámara, Peter's half-brother and rival. The same year, after an obstinate conflict, he defeated Henry at the Battle of Nájera. However, after a wait of several months during which he failed to obtain either the province of Biscay or liquidation of the debt from Don Pedro, he returned to Aquitaine. Edward persuaded the estates of Aquitaine to allow him a hearth tax of ten sous for five years in 1368, thereby alienating the lord of Albret and other nobles.\nPrince Edward returned to England in 1371 and resigned the principality of Aquitaine and Gascony in 1372. He led the Commons in their attack upon the Lancastrian administration in 1376. He died in 1376 of dysentery and was buried in Canterbury Cathedral, where his surcoat, helmet, shield, and gauntlets are still preserved.\nEarly life (1330–1343)\nEdward—the eldest son of Edward III of England, Lord of Ireland and ruler of Gascony, and Queen Philippa—was born at Woodstock, Oxfordshire, on 15 June 1330. On 10 September Edward III allowed five hundred marks per year from the profits of the county of Chester for his son's maintenance; on 25 February 1331, the whole of these profits were assigned to the queen for maintaining Edward and the king's sister Eleanor. In July 1331 the king proposed to marry Edward to a daughter of Philip VI of France.\nTensions between England and France reached a breaking point during the reign of Edward III. Disputes over English lands in France, feudal obligations due to king Philip IV of France, and Edward III's claim to the French throne culminated in Edward declaring war on France in 1337, beginning the first phase of the Hundred Years' War.\nOn 18 March 1333, Prince Edward was invested with the earldom and county of Chester, and in the parliament of 9 February 1337 he was created duke of Cornwall and received the duchy by charter dated 17 March. This is the earliest instance of the creation of a duke in England. By the terms of the charter the duchy was to be held by Edward and the eldest sons of kings of England. His tutor was Dr. Walter Burley of Merton College, Oxford. His revenues were placed at the disposal of his mother in March 1334 for the expenses she incurred in bringing up him and his two sisters, Isabella and Joan. Rumours of an impending French invasion led the king in August 1335 to order that he and his household should remove to Nottingham Castle as a place of safety.\nWhen two cardinals came to England at the end of 1337 to make peace between Edward III and Philip VI, Prince Edward reportedly met the cardinals outside the City of London and, in company with many nobles, conducted them to Edward III. On 11 July 1338 his father, who was on the point of leaving England to campaign in the Low Countries, appointed him guardian of the kingdom during his absence, and he was appointed to the same office on 27 May 1340 and 6 October 1342; he was, of course, too young to take any save a nominal part in the administration, which was carried on by the council. To attach John III, Duke of Brabant, to his cause, the king in 1339 proposed a marriage between Edward and John's daughter Margaret, and in the spring of 1345 wrote urgently to Pope Clement VI for a dispensation for the marriage.\nOn 12 May 1343, Edward III created Edward Prince of Wales in a parliament held at Westminster, investing Edward with a circlet, gold ring, and silver rod. Edward accompanied his father to Sluys on 3 July 1345, and the king tried to persuade the burgomasters of Ghent, Bruges and Ypres to accept his son as their lord, but the murder of Jacob van Artevelde put an end to this project. Both in September 1345 and in April 1346, Edward was called on to furnish troops from his principality and earldom for the impending campaign in France, and as he incurred heavy debts in the king's service, his father authorised him to make his will and provided that, in case he fell in the war, his executors should have all his revenue for a year.\nEarly campaigns (1346–53)\nBattle of Crécy\n, 1888, shows the prince contemplating his slain opponent, King John of Bohemia. Telfair Museums, Savannah, Georgia]]\nEdward, Prince of Wales, sailed with King Edward III on 11 July 1346, and as soon as he landed at La Hougue he received knighthood from his father in the local church of Quettehou. Then, in the words of his biographer Chandos Herald, he \"made a right good beginning\", for he rode through the Cotentin, burning and ravaging as he went. Edward distinguished himself at the taking of Caen and in the Battle of Blanchetaque with the force under Sir Godemar I du Fay, which endeavoured to prevent the English army from crossing the Somme.\nEarly on 26 August 1346, before the start of the Battle of Crécy, Edward received the sacrament with his father at Crécy, and took the command of the right, or van, of the army with the earls of Warwick and Oxford, Sir Geoffroy d'Harcourt, Sir John Chandos, and other leaders, commanding 800 men-at-arms, 2,000 archers, and 1,000 Welsh foot soldiers, though the numbers are by no means trustworthy. When the Genoese bowmen were discomfited and the front line of the French was in some disorder, Edward apparently left his position to attack their second line. At this moment, however, the Count of Alençon charged his division with such fury that Edward was in great danger, and the leaders who commanded with him sent a messenger to tell Edward III that he was in great straits and to beg for assistance. When Edward III learned that his son was not wounded, he responded that he would send no help, for he wished to give Edward the opportunity to \"win his spurs\" (he was in fact already a knight), and to allow him and those who had charge of him the honour of the victory. Edward was thrown to the ground and was rescued by Sir Richard Fitz-Simon, his standard-bearer, who threw down the banner, stood over his body, and beat back his assailants while he regained his feet. Harcourt sent to Earl of Arundel for help, and he forced back the French, who had probably by this time advanced to the rising ground of the English position.\nA flank attack on the side of Wadicourt was next made by the Counts of Alençon and Ponthieu, but the English were strongly entrenched there, and the French were unable to penetrate the defences and lost the Duke of Lorraine and the Counts of Alençon and Blois. The two front lines of their army were utterly broken before King Philip's division engaged. Then Edward III appears to have advanced at the head of the reserve, and the rout soon became complete. When Edward III met his son after the battle was over, he embraced him and declared that he had acquitted himself loyally, and Edward bowed low and did reverence to his father. The next day he joined the king in paying funeral honours to King John of Bohemia. is an ostrich feather used as a mark of reference to a previous page, on which the same device occurs, \"ubi depingitur penna principis Walliæ\", with the remark: \"Et nota quod talem pennam albam portabat Edwardus, primogenitus E. regis Angliæ, super cristam suam, et illam pennam conquisivit de Rege Boemiæ, quem interfecit apud Cresy in francia\", Although the reference and remark in Sloane MS. 56 may be by Seton and not by Arderne, the prince's physician, it is evident that probably before the prince's death the ostrich feather was recognised as his peculiar badge, assumed after the battle of Crécy. While the crest of John of Bohemia was the entire wings of a vulture \"besprinkled with linden leaves of gold\" the ostrich seems to have been the badge of his house; it was borne by Queen Anne of Bohemia, as well as by her brother Wenceslaus IV of Bohemia, and is on her effigy on her tomb. The feather badge occurs as two feathers on four seals of the prince , and as three feathers on the alternate escutcheons placed on his tomb in accordance with the directions of his will The prince in his will says that the feathers were \"for peace\", ie for jousts and tournaments, and calls them his badge, not his crest. Although the ostrich feather was his special badge, it was placed on some plate belonging to his mother, was used in the form of one or more feathers by various members of the royal house, and (by grant of Richard II), by Thomas de Mowbray, 1st Duke of Norfolk. The story of the prince's winning the feathers was printed, probably for the first time, by Camden in his Remaines In his first edition (1605) he states that it was \"at the battle of Poictiers\", but corrects this in his next edition (1614), Secondly, as to the motto, it appears that the prince used two mottoes, \"Houmout\" and \"Ich dien\", which are both appended as signature to a letter under his privy seal. In his will he directed that \"Houmout\" should be written on each of the escutcheons round his tomb. But it actually occurs only over the escutcheons bearing his arms, while over the alternate escutcheons with his badge, and also on the escroll upon the quill of each feather, are the words ich diene . \"Houmout\" is interpreted as meaning high mood or courage. No early tradition connects \"Ich dien\" with John of Bohemia. Like \"Houmout\", it is probably old Flemish or Low German. Camden in his 'Remaines' (in the passage cited above) says that it is old English, \"Ic die\", that is \"I serve\", and that the prince \"adjoyned\" the motto to the feathers, and he connects it, no doubt rightly, with the prince's position as heir, referring to Ep. to Galatians, iv. 1.}}\n, 1453, illustration from the Bruges Garter Book, British Library]]\nEdward was present at the siege of Calais (1346–1347), and after the surrender of the town harried and burned the country for  around, and he brought much booty back with him. He returned to England with his father on 12 October 1347, took part in the jousts and other festivities of the court, and was invested by the king with the new Order of the Garter in 1348.\nSiege of Calais and Battle of Winchelsea\nPrince Edward shared in the king's expedition to Calais in the last days of 1349, came to the rescue of his father, and when the combat was over and the king and his prisoners sat down to feast, he and the other English knights served the king and his guests at the first course and then sat down for the second course at another table. When the king embarked at Winchelsea on 28 August 1350 to intercept the fleet of La Cerda, the Prince sailed with him, though in another ship, and in company with his brother, the young John of Gaunt, Earl of Richmond. During the Battle of Winchelsea his ship was grappled by a large Spanish ship and was so full of leaks that it was likely to sink, and though he and his knights attacked the enemy manfully, they were unable to take her. Henry of Grosmont, Earl of Lancaster, came to his rescue and attacked the Spaniard on the other side; she was soon taken, her crew were thrown into the sea, and as the Prince and his men got on board her their own ship foundered.\nCheshire expedition\nIn 1353 some disturbances seem to have broken out in Cheshire, for the Prince as Earl of Chester marched with Henry of Grosmont, now Duke of Lancaster, to the neighbourhood of Chester to protect the justices, who were holding an assize there. The men of the earldom offered to pay him a heavy fine to bring the assize to an end, but when they thought they had arranged matters the justices opened an inquisition of trailbaston, took a large sum of money from them, and seized many houses and much land into the prince's, their earl's, hands. On his return from Chester the prince is said to have passed by the Abbey of Dieulacres in Staffordshire, to have seen a fine church which his great-grandfather, Edward I, had built there, and to have granted five hundred marks, a tenth of the sum he had taken from his earldom, towards its completion; the abbey was almost certainly not Dieulacres but Vale Royal.\nFurther campaigns (1355–64)\nAquitaine\nWhen Edward III determined to renew the war with France in 1355, he ordered Edward to lead an army into Aquitaine while he acted with the king of Navarre in Normandy, and the Duke of Lancaster upheld the cause of John of Montfort in Brittany. Edward's expedition was made in accordance with the request of some of the Gascon lords who were anxious for plunder. On 10 July the king appointed Prince Edward his lieutenant in Gascony and gave Edward powers to act in his stead and to receive homages. Edward left London for Plymouth on 30 June, was detained there by contrary winds, and set sail on 8 September with about 300 ships, in company with four earls (Thomas Beauchamp, Earl of Warwick, William Ufford, Earl of Suffolk, William Montagu, Earl of Salisbury, and John Vere, Earl of Oxford) and in command of 1,000 men-at-arms, 2,000 archers, and a large body of Welsh foot soldiers. At Bordeaux the Gascon lords received him with much rejoicing. It was decided to make a short campaign before the winter, and on 10 October he set out with 1,500 lances, 2,000 archers, and 3,000 light foot. Whatever scheme of operations the king may have formed during the summer, this expedition of Edward was purely a piece of marauding. After grievously harrying the counties of Juliac, Armagnac, Astarac, and part of Comminges, he crossed the Garonne at Sainte-Marie a little above Toulouse, which was occupied by John I, Count of Armagnac, and a considerable force. The count refused to allow the garrison to make a sally, and Edward passed on into the Lauragais. His troops stormed and burnt Montgiscard, where many men, women, and children were ill-treated and slain, and took and pillaged Avignonet and Castelnaudary. The country was \"very rich and fertile\" according to Edward, and the people \"good, simple, and ignorant of war\", so the prince took great spoil, especially of carpets, draperies, and jewels, for \"the robbers\" spared nothing, and the Gascons who marched with him were especially greedy. The only castle to resist the English forces was Montgey. Its châtelaine defended its walls by pouring beehives onto the attackers, who fled in panic.\nCarcassonne was taken and sacked, but Edward did not take the citadel which was strongly situated and fortified. Ourmes (or Homps, near Narbonne) and Trèbes bought off his army. He plundered Narbonne and thought of attacking the citadel, for he heard that there was much booty there, but he gave up the idea on finding that it was well defended. While there a messenger came to him from the papal court, urging him to allow negotiations for peace. He replied that he could do nothing without knowing his father's will. From Narbonne he turned to march back to Bordeaux. The Count of Armagnac tried to intercept him, but a small body of French having been defeated in a skirmish near Toulouse the rest of the army retreated into the city, and the prince returned in peace to Bordeaux, bringing back with him enormous spoils. The expedition lasted eight weeks, during which the prince only rested eleven days in all the places he visited, and without performing any feat of arms did the French king much mischief. During the next month, before 21 January 1356, the leaders under his command reduced five towns and seventeen castles.\nBattle of Poitiers\n, from the Grandes Chroniques de France]]\nOn 6 July 1356 Edward set out on another expedition, undertaken with the intention of passing through France to Normandy and there giving aid to his father's Norman allies, the party headed by the king of Navarre and Geoffrey d'Harcourt. In Normandy he expected to be met by his father. He crossed the Dordogne at Bergerac on 4 August and rode through Auvergne, Limousin, and Berry, plundering and burning as he went until he came to Bourges, where he burnt the suburbs but failed to take the city. He then turned westward and made an unsuccessful attack on Issoudun on 25–27 August. Meanwhile, King John II was gathering a large force at Chartres, from which he was able to defend the passages of the Loire, and was sending troops to the fortresses that seemed in danger of attack. From Issoudun Edward returned to his former line of march and took Vierzon. There he learnt that it would be impossible for him to cross the Loire or to form a junction with Lancaster, who was then in Brittany. Accordingly he determined to return to Bordeaux by way of Poitiers, and after putting to death most of the garrison of the castle of Vierzon he set out on 29 August towards Romorantin.\nSome French knights who skirmished with the English advanced guard retreated into Romorantin, and when Prince Edward heard of this he said: \"Let us go there; I should like to see them a little nearer\". He inspected the fortress in person and sent his friend Chandos to summon the garrison to surrender. The place was defended by Boucicault and other leaders, and on their refusing his summons he assaulted it on 31 August. The siege lasted three days, and the prince, who was enraged at the death of one of his friends, declared that he would not leave the place untaken. Finally he set fire to the roofs of the fortress by using Greek fire, reduced it on 3 September.\nOn 5 September Edward proceeded to march through Berry. On 9 September King John II, who had gathered a large force, crossed the Loire at Blois and went in pursuit of them. When the king was at Loches on 12 September he had as many as 20,000 men-at-arms, and with these and his other forces he advanced to Chauvigny. On 16 and 17 September his army crossed the Vienne. Meanwhile, Edward was marching almost parallel to the French and at only a few miles distance from them. From 14 to 16 September he was at Châtellerault, and 17 September as he was marching towards Poitiers, some French men-at-arms skirmished with his advance guard, pursued them up to the main body of his army, and were all slain or taken prisoners. The French king had outstripped him, and his retreat was cut off by an army at least 50,000 strong, while Edward he about 7,500 men. Lancaster had endeavoured to come to his relief but had been stopped by the French at Pont-de-Cé.\nWhen Prince Edward knew that the French army lay between him and Poitiers, he took up his position on some rising ground to the south-east of the city in the commune of Beauvoir and remained there that night. On 18 September Cardinal Hélie Talleyrand endeavoured to make peace. Edward was willing to come to terms and offered to give up all the towns and castles he had conquered, to set free all his prisoners, and not to serve against the king of France for seven years, besides, it is said, offering a payment of 100,000 francs. King John, however, was persuaded to demand that Edward and 100 of his knights should surrender themselves as prisoners, and to this Edward would not consent. The cardinal's negotiations lasted the whole day and were protracted in the interest of the French, for John was anxious to give time for further reinforcements to join his army. Considering the position of Edward, it seems probable that the French might have destroyed his army by hemming it in with a portion of their host, and so either starving it or forcing it to leave its strong station and fight in the open with the certainty of defeat. John made a mistake in allowing Edward respite during the negotiations, during which he employed his army in strengthening its position. The English front was well covered by vines and hedges; on its left and rear was the ravine of the Miausson river and a good deal of broken ground, and its right was flanked by the wood and abbey of Nouaillé. All through the day the army was busily engaged in digging trenches and making fences, so that it stood, as at Crécy, in a kind of entrenched camp.\nPrince Edward drew up his men in three divisions, the first being commanded by the earls of Warwick and Suffolk, the second by himself, and the rear by Salisbury and Oxford. The French were drawn up in four divisions, one behind the other, and so lost much of the advantage of their superior numbers. In front of his first line and on either side of the narrow lane that led to his position the prince stationed his archers, who were well protected by hedges, and detached a force of 300 men-at-arms and 300 mounted archers who were to fall on the flank of the second enemy division, commanded by the Dauphin, Charles, Duke of Normandy.\nAt daybreak on 19 September Prince Edward addressed his army, and the fight began. An attempt was made by 300 picked men-at-arms to ride through the narrow lane and force the English position, but they were shot down by the archers. A body of Germans and the first division of the army which followed were thrown into disorder; then the English force in ambush charged the second division on the flank, and as it began to waver the English men-at-arms mounted their horses, which they had kept near them, and charged down the hill. Edward kept Chandos by his side, and his friend did him good service in the fray. As they prepared to charge he cried: \"John, get forward; you shall not see me turn my back this day, but I will be ever with the foremost\", and then he shouted to his banner-bearer, \"Banner, advance, in the name of God and St. George!\". All the French except the advance guard fought on foot, and the division of the Duke of Normandy, already wavering, could not stand against the English charge and fled in disorder. The next division, under Philip, Duke of Orléans, also fled, but the rear under King John did not break. The combat lasted until a little after 3&nbsp;pm. The French forces were fully routed and left 11,000 dead on the field, of whom 2,426 were men of gentle birth. Nearly 100 counts, barons, and bannerets, as well as 2,000 men-at-arms were made prisoners, and the king and his youngest son Philip were among those who were taken. The English losses were not large.\nWhen King John was brought to him, Edward received him with respect, helped him to take off his armour, and entertained him and the greater part of the princes and barons who had been made prisoners at supper. He served at the king's table and would not sit down with him, declaring that \"he was not worthy to sit at table with so great a king or so valiant a man,\" and spoke many comforting words to the king, for which the French praised him highly. The next day Edward continued his retreat towards Bordeaux; he marched carefully, but his armies were unharrased.\nAt Bordeaux, which Prince Edward reached on 2 October, he was received with much rejoicing, and he and his men wintered there. The contemporary chronicler Jean Froissart records that the prince and his retinue wasted a large part of the gold and silver they had gathered in their campaign in feasts and merriment. On 23 March 1357 Edward concluded a two years' truce, for he wished to return home. The Gascon lords were unwilling to see King John should be carried off to England, and the prince gave them 100,000 crowns to silence their murmurs. He left the country under the government of four Gascon lords and arrived in England on 4 May, landing at Plymouth. He entered London in triumph on 24 May with King John as his prisoner.\nEngland, tournaments and debts\nAfter his return to England, Prince Edward took part in the many festivals and tournaments of his father's court, and in May 1359 he, the king, and other challengers held the lists at a joust proclaimed at London by the mayor and sheriffs, and, to the great delight of the citizens, the king appeared as the mayor and the prince as the senior sheriff. Festivities of this sort and the lavish gifts he bestowed on his friends brought him into debt, and on 27 August, when a new expedition into France was being prepared, the king granted that if he fell his executors should have his whole estate for four years for the payment of his debts.\nReims campaign\nIn October 1359 Prince Edward sailed with his father to Calais and led a division of the army during the Reims campaign. At its close he took the principal part on the English side in negotiating the Treaty of Brétigny, and the preliminary truce arranged at Chartres on 7 May 1360 was drawn up by proctors acting in his name and the name of Charles, Duke of Normandy, the regent of France. He probably did not return to England until after his father, who landed at Rye on 18 May. On 9 July he and Henry, Duke of Lancaster, landed at Calais in attendance on the French king. As, however, the stipulated instalment of the king's ransom was not ready, he returned to England, leaving King John in the charge of Sir Walter Manny and three other knights. He accompanied his father to Calais on 9 October to assist at the liberation of King John and the ratification of the treaty. He rode with John to Boulogne, where he made his offering in the Church of the Virgin. He returned with King Edward to England at the beginning of November.\nMarriage to Joan\nIn spring 1361 Edward married his second cousin once removed Joan, Countess of Kent, daughter of Edmund of Woodstock, Earl of Kent (younger son of Edward I, and Margaret, daughter of Philip III of France) and widow of Thomas Holland, 1st Earl of Kent, with whom she had five children. The wedding was performed in secret, without the knowledge of the Prince's parents. The marriage has been believed to be a love match both by contemporary chronicles and modern historians, as Prince of Wales acted without his father's approval and Joan was a widow in relatively advanced age, that did not make her ideal candidate for a future queen and mother of next royal heir; additionally Joan was an English noblewoman, which made her unusual choice of bride for the future king as there was no domestic queen in England since the time of conquest.\nBecause Edward and Joan were related in the third degree (and since Edward was the godfather of Joan's eldest son Thomas) a dispensation was needed to make their marriage valid; it was eventually obtained from Pope Innocent VI. While the wedding the couple had early that year was declared null, the Prince of Wales and his chosen bride were allowed to have a second ceremony, that was performed at Windsor on 10 October 1361 in the presence of King Edward III, by Simon Islip Archbishop of Canterbury. Edward and Joan resided at Berkhamsted Castle in Hertfordshire and held the manor of Princes Risborough; though local history describes the estate as \"his [Edward's] palace\", many sources suggest it was used more as a hunting lodge.\nPrince of Aquitaine and Gascony\n, shelfmark: Cotton MS Nero D VI, f.31]]\n, found in Montpensier, France in 1866. Now in the Louvre, Paris.]]\nOn 19 July 1362 Edward III granted Prince Edward all his dominions in Aquitaine and Gascony, to be held as a principality by liege homage on payment of an ounce of gold each year, together with the title of Prince of Aquitaine and Gascony. During the rest of the year he was occupied in preparing for his departure to his new principality, and after Christmas he received the king and his court at Berkhamsted, took leave of his father and mother, and in the following February sailed with Joan and all his household for Gascony, landing at La Rochelle.\nAt La Rochelle the prince was met by John Chandos, the king's lieutenant, and proceeded with him to Poitiers, where he received the homage of the lords of Poitou and Saintonge; he then rode to various cities and at last came to Bordeaux, where from 9 to 30 July he received the homage of the lords of Gascony. He received them graciously and kept an extravagant court, residing sometimes at Bordeaux and sometimes at Angoulême.\nThe prince appointed Chandos constable of Guyenne and provided the knights of his household with profitable offices. Their extravagance displeased the people. Many of the Gascon lords were dissatisfied at being handed over to the dominion of the English, at the favouritism the prince displayed towards his own countrymen, and at ostentatious magnificence they exhibited. Arnaud Amanieu, Lord of Albret, and many more were always ready to give what help they could to the French cause, and Gaston, Count of Foix, though he visited the prince on his first arrival, was thoroughly loyal to the French cause; in 1365 he refused to do homage for Bearn. Charles V, who succeeded to the throne of France in April 1364, encouraged the malcontents, and the prince's position was by no means easy.\nIn April 1363 Edward mediated between the Counts of Foix and Armagnac, who had for a long time been at war with each other. He also attempted in February 1364 to mediate between Charles of Blois and John of Montfort, rivals for the Duchy of Brittany. Both appeared before him at Poitiers, but his mediation was unsuccessful.\nIn May 1363 the prince entertained Peter, King of Cyprus, at Angoulême and held a tournament there. At the same time he and his lords excused themselves from assuming the cross—that is, they declined to join Peter's proposed crusade. In the summer the lord of Albret was at Paris, and his forces and several other Gascon lords held the French cause in Normandy against the party of Navarre. Meanwhile, war was renewed in Brittany; the prince allowed Chandos to raise and lead a force to come to the aid of the party of Montfort, and Chandos won the Battle of Auray (29 September 1364) against the French.\nAt this time the French countryside was continually being harried by roving bands of unemployed mercenaries, known as free companies or routiers, primarily composed of former English and Gascon soldiers. Because of their origins, these companies left Aquitaine untouched, and the prince was suspected, probably not without cause, of encouraging or at least of taking no pains to discourage their proceedings. Accordingly on 14 November 1364 Edward III called upon him to restrain their ravages.\nSpanish campaign (1365–67)\nIn 1365 the free companies under Sir Hugh Calveley and other leaders took service with Bertrand du Guesclin who employed them in 1366 in compelling King Peter of Castile to flee from his kingdom and in setting up his bastard brother, Henry of Trastámara, as king in his stead. Peter, who was in alliance with Edward III, sent messengers to Prince Edward asking his help, and on receiving a gracious answer at Corunna set out for Bayonne with his son and his three daughters. The prince met him at Capbreton and rode with him to Bordeaux. Many of the prince's lords, both English and Gascon, did not want him to take up Peter's cause, but he (according to John Froissart) declared that it was not \"either decent or proper that a bastard should possess a kingdom as an inheritance, nor drive out of his realm his own brother, heir to the country by lawful marriage; and no king, or king's son, ought ever to suffer it, as being of the greatest prejudice to royalty.\"\nPeter won friends by declaring that he would make Edward's son king of Galicia and would divide his riches among those who helped him. A parliament was held at Bordeaux, in which it was decided to ask the wishes of the English king. Edward III replied that it was right that his son should help Peter, and the prince held another parliament at which the king's letter was read. Then the lords agreed to give their help, provided that their pay was secured to them. To give them the required security, the prince agreed to lend Peter whatever money was necessary.\nEdward and Peter then held a conference with Charles of Navarre at Bayonne and agreed with him to allow their troops to pass through his dominions. To persuade him to do this, Peter had, besides other grants, to pay Charles 56,000 florins, and this sum was lent to him by Edward. On 23 September a series of agreements (the Treaty of Libourne) were entered into between Edward, Peter, and Charles at Libourne, by which Peter covenanted to put the prince in possession of the province of Biscay and the territory and fortress of Castro de Urdialès as pledges for the repayment of this debt, to pay 550,000 florins for six months' wages at specified dates, 250,000 florins being the prince's wages, and 800,000 florins the wages of the lords who were to serve in the expedition. Peter consented to leave his three daughters in Edward's hands as hostages for the fulfillment of these terms, and he further agreed that whenever the king, the prince, or their heirs should march in person against the Moors, they should have the command of the vanguard before all other Christian kings, and that if they were not present the banner of the king of England should be carried in the vanguard side by side with the banner of Castile.\nEdward received 100,000 francs from his father out of the ransom of John II, the late king of France, and used a part of this money to help to pay the soldiers he was taking into his pay. While his army was assembling he remained at Angoulême and was there visited by Peter. He then stayed over Christmas at Bordeaux, where Joan gave birth to their second son Richard. Prince Edward left Bordeaux early in February 1367 and joined his army at Dax where he remained three days and received a reinforcement of 400 men-at-arms and 400 archers sent out by Edward III under his brother John of Gaunt. From Dax, Edward advanced via Saint-Jean-Pied-de-Port through Roncesvalles (in the Pyrenees) to Pamplona (the capital of Kingdom of Navarre).\n]]\nWhen Calveley and other English and Gascon leaders of free companies found that Prince Edward was about to fight for Peter, they withdrew from the service of Henry of Trastámara and joined Edward \"because he was their natural lord\". While the prince was at Pamplona he received a letter of defiance from Henry. From Pamplona Edward marched by Arruiz to Salvatierra, which opened its gates to his army, and thence advanced to Vitoria, intending to march on Burgos by this direct route. A body of his knights, which he had sent out to reconnoitre under Sir William Felton, was defeated by a skirmishing party, and he found that Henry had occupied some strong positions, and especially Santo Domingo de la Calzada on the right of the river Ebro, and Zaldiaran mountain on the left, which made it impossible for him to reach Burgos through Álava. Accordingly he crossed the Ebro and encamped under the walls of Logroño. During these movements the prince's army had suffered from want of provisions both for men and horses, and from wet and windy weather. At Logroño, however, though provisions were still scarce, they were somewhat better off.\nOn 30 March 1367, the prince wrote an answer to Henry's letter. On 2 April he left Logroño and moved to Navarrete, La Rioja. Meanwhile, Henry and his French allies had encamped at Nájera, so that the two armies were now near each other. Letters passed between Henry and Edward, for Henry seems to have been anxious to make terms. He declared that Peter was a tyrant and had shed much innocent blood, to which Edward replied that Peter had told him that all the persons he had slain were traitors. On the morning of 3 April, Edward's army marched from Navarrete, and all dismounted while they were yet some distance from Henry's army. The bulk of Edward's army was composed of mercenary free companies, and probably numbered between eight and ten thousand men.\nAs the Battle of Nájera began, the knights of Castile attacked and pressed the English vanguard, but the wings of Henry's army failed to move, so that the Gascon lords were able to attack the main body on the flanks. Then Edward brought the main body of his army into action, and the fighting became intense. At length Henry's vanguard gave way, and he fled from the field. When the battle was over Edward asked Peter to spare the lives of those who had offended him. Peter assented, with the exception of one notorious traitor, whom he at once put to death; and he also had two others slain the next day.\nAmong the prisoners was the French marshal Arnoul d'Audrehem, whom Edward had formerly taken prisoner at Poitiers and whom he had released on the condition that d'Audrehem give his word that he would not bear arms against the prince until his ransom was paid. When Edward saw him he reproached him bitterly and called him \"liar and traitor\". D'Audrehem denied that he was either, and Edward asked him whether he would submit to the judgment of a body of knights. To this d'Audrehem agreed, and Edward chose 12 knights—four English, four Gascons, and four Bretons—to judge between him and the marshal. After he had stated his case, d'Audrehem replied that he had not broken his word, for the army Edward led was not his own; he was merely in the pay of Peter. The knights considered that this view of Edward's position was sound and gave their verdict for d'Audrehem.\nOn 5 April 1367, Edward and Peter marched to Burgos, where they celebrated Easter. Edward, however, did not take up his quarters in the city but camped outside the walls at the Monastery of Las Huelgas. Peter did not pay him any of the money he owed him, and Edward could get nothing from him except a solemn renewal of his bond of the previous 23 September, which he made on 2 May 1367 before the high altar of the Cathedral of Burgos. By this time, Edward began to suspect his ally of treachery. Peter had no intention of paying his debts, and when Edward demanded possession of Biscay, Peter told him that the Biscayans would not consent to be handed over to him. To get rid of his creditor, Peter told Edward that he could not get money at Burgos and persuaded Edward to take up his quarters at Valladolid while he went to Seville, whence he declared he would send the money he owed.\nEdward remained at Valladolid during some very hot weather, waiting in vain for his money. His army suffered so terribly from dysentery and other diseases that it is said that scarcely one Englishman out of five ever saw England again. Edward was seized with a sickness from which he never thoroughly recovered and which some said was caused by poison. Food and drink were scarce, and the free companies in his pay harried the surrounding country.\nMeanwhile, Henry made war upon Aquitaine, took Bagnères and wasted the country. Fearing that Charles of Navarre would not allow him to return through his dominions, Edward negotiated with King Peter IV of Aragon for a passage for his troops. Peter IV made a treaty with him, and when Charles of Navarre heard of it he agreed to allow Edward, the Duke of Lancaster, and some of their lords to pass through his country; so they returned through Roncesvalles and reached Bordeaux early in September 1367.\nWar in Aquitaine (1366–70)\nSome time after he had returned to Aquitaine, the free companies, some 6,000 strong, also reached Aquitaine, having passed through Kingdom of Aragon. As they had not received the whole of the money Edward had agreed to pay them, they took up their quarters in his country and began pillage the countryside. Edward persuaded the captains to leave Aquitaine, and the companies under their command crossed the Loire and did much damage to France. This greatly angered Charles V, who retaliated by encouraging disaffection among the Gascon lords.\nWhen Edward had been gathering his army for his Spanish expedition, the Lord of Albret had agreed to serve with 1,000 lances. Considering, however, that he had at least as many men as he could find provisions for, Edward on 8 December 1366 had written to him requesting that he would bring only 200 lances. The Lord of Albret was much incensed at this, and, though peace was made by his uncle the Count of Armagnac, did not forget the slight, and Froissart speaks of it as the \"first cause of hatred between him and the prince\". A more powerful cause of this lord's discontent was the non-payment of an annual pension which had been granted him by Edward. About this time he agreed to marry Margaret of Bourbon, sister of the queen of France. Edward was annoyed at this betrothal and, his temper probably being soured by sickness and disappointment, behaved with rudeness to both Albret and his intended bride. On the other hand, Charles offered the lord the pension which he had lost, and thus drew him and his uncle, the Count of Armagnac, altogether over to the French side.\nThe immense cost of the late campaign and his constant extravagance had brought Edward into financial difficulties, and as soon as he returned to Bordeaux he called an assembly of the estates of Aquitaine (Parliament) to meet at Saint-Émilion to obtain a grant from them. It seems as though no business was done then, for in January 1368 he held a meeting of the estates at Angoulême and there persuaded them to allow him a hearth tax of ten sous for five years. An edict for this tax was published on 25 January 1368. The chancellor, Bishop John Harewell, held a conference at Niort, at which he persuaded the barons of Poitou, Saintonge, Limousin, and Rouergue to agree to this tax, but the great vassals of the high marches refused, and on 20 June and again on 25 October the Counts of Armagnac, Périgord, and Comminges, and the lord of Albret laid their complaints before the king of France, declaring that he was their lord paramount. Meanwhile, Chandos, who strongly urged Edward against imposing this tax, had retired to his Norman estate.\nCharles took advantage of these appeals, and on 25 January 1369 sent messengers to Prince Edward, who was then residing at Bordeaux, summoning him to appear in person before him in Paris and there receive judgment. He replied: \"We will willingly attend at Paris on the day appointed since the king of France sends for us, but it shall be with our helmet on our head and sixty thousand men in our company\". Prince Edward caused the messengers to be imprisoned, and in revenge for this the Counts of Périgord and Comminges and other lords set on Sir Thomas Wake,.}} the high-steward of Rouergue, slew many of his men, and put him to flight. The prince sent for Chandos, who came to his help, and some fighting took place, though war was not yet declared. His health was now so feeble that he could not take part in active operations. By 18 March 1369 more than nine hundred towns, castles, and other places signified in one way or another their adherence to the French cause.\nPrince Edward had already warned his father of the intentions of the French king, but there was evidently a party at Edward III's court that was jealous of the prince's power (probably including the prince's younger brother, John of Gaunt), and his warnings were slighted. In April 1369, however, war was declared. Edward III sent the Earls of Cambridge and Pembroke to the prince's assistance, and Sir Robert Knolles again took service with him. The war in Aquitaine was desultory and, though the English maintained their ground fairly in the field, their hold on the country weakened every day the fighting dragged on.\nOn 1 January 1370, Prince Edward sustained a heavy loss in the death of Chandos. Several efforts were made by Edward to conciliate the Gascon lords, but they were fruitless and can only have served to weaken the prince's authority. It is probable that John of Gaunt was working against him at the English court, and when he was sent out in the summer to help his elder brother, he came with such extensive powers that he almost seemed as though he had come to supersede him.\nIn the spring, Charles raised two large armies for the invasion of Aquitaine; one, under Louis I, Duke of Anjou, was to enter Guyenne by La Reole and Bergerac, the other, under John, Duke of Berry, was to march towards Limousin and Quercy, and both were to unite and besiege the prince in Angoulême. Ill as he was, Edward left his bed of sickness and gathered an army at Cognac where he was joined by the Barons of Poitou and Saintonge, and the Earls of Cambridge, Lancaster, and Pembroke. The two French armies took many cities, united and laid siege to Limoges, which was treacherously surrendered to them by the bishop, Jean de Murat de Cros, who had been one of the prince's trusted friends.\nin 1370]]\nWhen Prince Edward heard of the surrender of Limoges to the French, he swore \"by the soul of his father\" that he would have the place again and would make the inhabitants pay dearly for their treachery. He set out from Cognac with an army of about 4,000 men. Due to his sickness he was unable to mount his horse, and was carried in a litter. During the siege of Limoges, the prince was determined to take the town and ordered the undermining of its walls. On 19 September, his miners succeeded in demolishing a large piece of wall which filled the ditches with its ruins. The town was then stormed, with the inevitable destruction and loss of life.\nThe Victorian historian William Hunt, author of Prince Edward's biography in the Dictionary of National Biography (1889), relying on Froissart as a source,), a contemporary court historian and a major historical source of the Prince's campaigns}} wrote that when the bishop was brought before Edward, he told the bishop that his head should be cut off (though Lancaster persuaded him not to carry out the deed) and that the city was nevertheless pillaged and burnt, and 3,000 persons of all ranks and ages were massacred. However, modern scholarship, including the historian Richard Barber writing in 2008 in the Oxford Dictionary of National Biography, and drawing on a wider range of evidence, places casualties much lower than Froissart does – around 300 garrison soldiers and civilians in total. Edward returned to Cognac; his sickness increased, and he was forced to give up all hope of being able to direct any further operations and to proceed first to Angoulème and then to Bordeaux.\nReturn to England\nThe death of Edward's eldest son Edward of Angoulême in 1371 caused him a great deal of grief. His health continued to deteriorate, and his personal doctor advised him to return to England. Edward left Aquitaine with the Duke of Lancaster and landed at Southampton early in January 1371. Edward met his father at Windsor. At this meeting, Prince Edward interceded to stop a treaty Edward III had concluded the previous month with Charles of Navarre because he objected to the ceding of lands to King Charles. After this, Edward returned to his manor in Berkhamsted.\nOn his return to England, Edward was publicly recognised as the natural opponent of the anti-clerical and Lancastrian party's influence. On 2 May he met the convocation of Canterbury at the Savoy and persuaded them to make an exceptionally large grant. His health began to improve, and in August 1372 he sailed with his father to the relief of Thouars; but contrary winds meant that the fleet never reached the French coast. On 6 October he resigned the principality of Aquitaine and Gascony, giving as his reason that its revenues were no longer sufficient to cover expenses. He acknowledged his resignation in Parliament the next month. At the conclusion of this parliament, after the knights had been dismissed, he met the citizens and burgesses \"in a room near the white chamber\" and prevailed on them to extend the customs granted the year before for the protection of merchant shipping for another year.\nEdward's illness returned in force, though when the \"Good Parliament\" met on 28 April 1376 he was the House of Commons' main ally in their criticism of the administration, and evidently acted in concert with William of Wykeham in opposing the influence of Lancaster, and he had good cause to fear that his brother's power would prove dangerous to the prospects of his son Richard. Richard Lyons, the king's financial agent who was impeached for gigantic frauds, sent him a bribe of £1,000 and other gifts, but Edward refused to receive it, though he afterwards said that it was a pity he had not kept it and sent it to pay the soldiers who were fighting for the kingdom.\nDeath\nin Canterbury Cathedral]]\nFrom the period of the Good Parliament, Edward knew that he was dying. His fits of dysentery had become so violent they occasionally caused him to faint.; ).}} He left gifts for his servants in his will and said goodbye to Edward III, whom he asked to confirm his gifts, pay his debts quickly out of his estate, and protect his son Richard. Edward's illness is thought to have started after his victory at the Battle of Nájera in 1367, relapsing sporadically over the next 9 years of his life. There are several diverse infections or inflammatory conditions that may have led to his demise. These might include malaria (specifically vivax), brucellosis, inflammatory bowel disease, or long-term complications of acute dysentery. However, chronic dysentery is probably unlikely.\nHis death was announced at the Palace of Westminster on 8 June 1376. cites Chandos, vol. 1. p. 4201)}} In his last moments, he was attended by the Bishop of Bangor who urged him to ask forgiveness of God and of all those he had injured. He \"made a very noble end, remembering God his Creator in his heart\" and asked people to pray for him.\non display in Canterbury Cathedral]]\nEdward was buried in Canterbury Cathedral on 29September. His funeral and the design of his tomb were conducted in accordance to the directions dictated in his will. It has a bronze effigy beneath a tester depicting the Holy Trinity with his heraldic achievementshis surcoat, helmet, shield and gauntletshung over the tester; they have since been replaced with replicas; the originals now reside in a glass-fronted cabinet within the cathedral. His epitaph, inscribed around his effigy, is in French; one frequently quoted  English translation reads (in part):\nSuch as thou art, sometime was I.\nSuch as I am, such shalt thou be.\nI thought little on th'our of Death\nSo long as I enjoyed breath.\nOn earth I had great riches\nLand, houses, great treasure, horses, money and gold.\nBut now a wretched captive am I,\nDeep in the ground, lo here I lie.\nMy beauty great, is all quite gone,\nMy flesh is wasted to the bone.\nArms and heraldic badge\n| width1= 103\n| image2 = Arms of the Prince of Wales (Shield of Peace).svg\n| alt2 = Arms of the Prince of Wales (Shield of Peace)\n| width2=103\n| caption2 = The \"shield for peace\", with the ich dien motto..}}\n}}\nArms: Quarterly, 1st and 4th azure semée of fleur-de-lys or (France Ancient); 2nd and 3rd gules, three lions passant guardant or (England); overall a label of three points argent. Crest: On a chapeau gules turned up ermine, a lion statant or gorged with a label of three points argent. Mantling: gules lined ermine. Edward's coat of arms as Prince of Wales were those of the kingdom, differenced by a label of three points argent. Edward also used an alternative coat of Sable, three ostrich feathers argent, described as his \"shield for peace\" (probably meaning the shield he used for jousting). This shield can be seen several times on his tomb chest, alternating with the differenced royal arms. John of Gaunt used a similar shield on which the ostrich feathers were ermine. Edward's \"shield for peace\" is believed to have inspired the badge of three ostrich feathers used by later Princes of Wales. The motto \"Ich dien\" means \"I serve\".\nFamily\nEdward married his second cousin once removed Joan, Countess of Kent, in early 1361. Their wedding was conducted in secret, and was later annulled the same year because of lack of needed dispensation, but afterwards the couple managed to obtain the necessary documents and married once again on 10 October 1361. Joan was the daughter and heiress of Edmund, Earl of Kent, the younger son of King Edward I by his second wife Margaret of France. She and Edward had two sons, both born in Aquitaine:\n* Edward of Angoulême, born at Angoulême on 27 January 1365, died shortly before his father's return to England in January 1371, and was buried in the church of the Austin Friars, London\n* Richard, who succeeded his grandfather as king\nFrom his marriage to Joan he also became stepfather to her children by Thomas Holland:\n* Thomas Holland, 2nd Earl of Kent, whose daughter, Joan Holland, later married Edward's brother, Edmund of Langley.\n* John Holland, 1st Duke of Exeter, who married Edward's niece, Elizabeth of Lancaster, daughter of his brother, John of Gaunt.\n* Joan Holland, Duchess of Brittany, who married John IV, Duke of Brittany\n* Maud Holland, Lady Courtenay, Countess of Ligny, Countess of St Pol, who married firstly, Hugh Courtenay, grandson of Hugh de Courtenay, 10th Earl of Devon; Secondly, Waleran III of Luxembourg, Count of Ligny. One Daughter from the marriage to Waleran III of Luxembourg\n* Edmund Holland (c. 1354), who died young\nEdward had several natural sons before his marriage.\nWith Edith de Willesford (died after 1385):\n* Sir Roger Clarendon ( – executed 1402); he married Margaret (d. 1382), a daughter of John Fleming, Baron de la Roche.\nWith unknown mother:\n* Sir John Sounders\nAncestry\n| 5 = 5. Isabella of France\n| 6 = 6. William I, Count of Hainaut\n| 7 = 7. Joan of Valois\n| 8 = 8. Edward I of England\n| 9 = 9. Eleanor of Castile\n| 10 = 10. Philip IV of France\n| 11 = 11. Joan I of Navarre\n| 12 = 12. John II, Count of Holland\n| 13 = 13. Philippa of Luxembourg\n| 14 = 14. Charles, Count of Valois\n| 15 = 15. Margaret, Countess of Anjou\n}}\nAppellation \"Black Prince\"\nEdward is often referred to as the \"Black Prince\". The first known source to use this sobriquet was the antiquary John Leland in the 1530s or early 1540s (about 165 years after Edward's death). Leland mentions it in two manuscript notes of this period, with the implication that it was in relatively widespread use by that date. In one instance, he refers in Latin to \"Edwardi Principis cog: Nigri (i.e., \"Edward the Prince, cognomen: The Black\"); in the other, in English to \"the Blake Prince\". In both instances, Leland is summarising earlier works – respectively, the 14th-century Eulogium Historiarum and the late 15th-century chronicle formerly attributed to John Warkworth – but in neither case does the name appear in his source texts. In print, Roger Ascham in his 1545 Toxophilus refers to \"ye noble black prince Edward beside Poeters\"; while Richard Grafton in his 1569 Chronicle at Large uses the name on three occasions, saying that \"some writers name him the black prince\", and elsewhere that he was \"commonly called the black Prince\". Raphael Holinshed uses it several times in his 1577 Chronicles; and it is also used by William Shakespeare in his plays Richard II (written c. 1595; Act 2, scene 3) and Henry V (c. 1599; Act 2, scene 4). In 1688, it appears in the title of Joshua Barnes's The History of that Most Victorious Monarch, Edward IIId, King of England and France, and Lord of Ireland, and First Founder of the Most Noble Order of the Garter: Being a Full and Exact Account Of the Life and Death of the said King: Together with That of his Most Renowned Son, Edward, Prince of Wales and of Aquitain, Sirnamed the Black-Prince.\nThe origins of the name are uncertain, though many theories have been proposed, falling under two main themes, that it is derived from Edward's black shield (and/or the rumours that he wore black armour), or from his brutal reputation, particularly towards the French in Aquitaine. It was possibly intended as a double entendre, combining these two meanings.\nThe black (sable) field of his \"shield for peace\" is well documented. However, there is no sound evidence that Edward wore black armour, although John Harvey (without citing a source) refers to \"some rather shadowy evidence that he was described in French as clad at the battle of Crécy ' en armure noire en fer bruni ' – in black armour of burnished steel\". Richard Barber suggests that the name's origins may have lain in pageantry, in that a tradition may have grown up in the 15th century of representing the prince in black armour. He points out that several chronicles refer to him as Edward IV (the title he would have taken as king had he outlived his father): this name would obviously have become confusing when the actual Edward IV succeeded in 1461, and this may have been the period when an alternative had to be found.\nEdward's reputation for brutality in France is well documented, and it is possible that this is where the title had its origins. French soldier Philippe de Mézières refers to Edward as the greatest of the \"black boars\" – those aggressors who had done so much to disrupt relations within Christendom. Other French writers made similar associations, and Peter Hoskins reports that an oral tradition of ''L'Homme Noir'', who had passed by with an army, survived in southern France until recent years. In Shakespeare's Henry V, the King of France alludes to \"that black name, Edward, Black Prince of Wales\". John Speed reported in 1611 that the Black Prince was so named \"not of his colour, but of his dreaded Acts in battell\"; a comment echoed in 1642 by Thomas Fuller, who wrote that he was named \"from his dreaded acts and not from his complexion\". Joshua Barnes claimed in 1688 that it was from the time of the Battle of Crécy that \"the French began to call [him] Le Neoir, or the Black-Prince\", appearing to cite a record of 2 Richard II (i.e. 1378–1379); but his reference is insufficiently precise to be traceable. However, it is unclear how a French sobriquet might have crossed to England, and Barber finds this derivation of the name \"unlikely\".\nHistoriography and Legacy\nEdward the Black Prince has been a common subject in scholarly work and interest of the period and beyond specifically in the Georgian and Victorian periods. One of the sources of the romanticized historical view of Edward came from a biography written in 1836. Another more modern source looks at Edwards role in promoting patriotism and chivalry. Another modern look at Edward has a much broader scope in that it uses his military career to look at The Hundred Years War, and other developments in Medieval European History.\nSee also\n* Black Prince's Ruby, which he forced Peter of Castile to give to him after the Castilian campaign. It is actually a large red spinel, now set at the front of the British Imperial State Crown. (Originally, the term \"ruby\" was given to any red gemstone.)\n* Black Prince (tank) A43 Infantry Tank, a British experimental AFV design, essentially a \"super Churchill\" of which six prototypes were built very late in World War II.\n* Cultural depictions of Edward the Black Prince\n* HMS Black Prince, for Royal Navy ships named in his honour\n* Junio Valerio Borghese, an Italian Navy commander also known as the Black Prince due to his aristocratic connections and adherence to fascism.\n* List of knights and ladies of the Garter\nNotes\nReferences\nSources\n*\n*\n*\n* ;\n*\n*\n*\n*\n*\n*\n*\n*\n*  Endnotes\n* .\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n* .\n*\n*\n*\nOther sources\n* Sloane MS, S. 56 and 335;\n* For the battle of Poitiers\n**\n**\n* For the Spanish campaign,\n* For other references see under , in text of above article, and in the notes of M. Luce's Froissart.\nFurther reading\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n**  – eulogistic and wordy, but useful; in the edition of 1836 James defends his work from the strictures of the Athenæum;\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\nExternal links\n*\n**\n}}\n*\nWelsh title: Owain Glyndwr (1400/15)"
    }
  ]
}