{
  "content": [
    {
      "type": "text",
      "text": "# Edward Fulton Denison\n\n|birth_place       = Omaha, Nebraska\n|death_date        =\n|death_place       = Washington, D.C.\n|spouse            = Elsie Lightbown\n|residence         =\n|nationality       = American\n|alma_mater        = Brown University\n|thesis_title      =\n|thesis_year       =\n|doctoral_advisor  =\n|known_for         =\n|field             = Statistics\n|work_institutions = George Washington University\n|prizes            =\n}}\nEdward Fulton Denison (December 18, 1915, Omaha – October 23, 1992, Washington D.C.) was an American economist. He was a pioneer in the measurement of the United States gross national product and one of the founders of growth accounting.\nDenison earned a bachelor's degree in economics in Oberlin College in 1936, a master's degree in Brown University in 1938, and a doctorate from Brown in 1941. In 1948, he became acting chief of the National Income Division of the Bureau of Foreign and Domestic Commerce. The next year, Edward also acted as assistant director and Chief Economist of the Office of Business Economics. In 1956 he left OBE to work for the Committee for Economic Development. From 1963, he served as a senior member of the Brookings Institution on economic research.\nIn 1966 Denison was elected as a Fellow of the American Statistical Association.\nHe became a distinguished fellow of the American Economic Association in 1981.\nHe married Elsie Lightbown. His daughter, Janet Howell has served in the Virginia Senate since 1992.\nSelected works\n*Trends in American economic growth, 1929-1982 (1962), published on The Journal of Business\n*The Residual Factor and Economic Growth (Paris, 1962)\n*The Sources of Economic Growth in the United States & the Alternatives Before us (New York City, 1962), one that describes his theory mostly\n*Why growth rates differ; postwar experience in nine western countries (Washington D. C., 1967)\n*Accounting for United States economic growth, 1929-1969 (Washington D. C., 1974)\n*Accounting for slower economic growth : the United States in the 1970s (Washington D. C., 1979)\nReferences"
    }
  ]
}