{
  "content": [
    {
      "type": "text",
      "text": "# Edward A. Wilcox\n\n| death_place  = Minonk, Illinois\n| state_senate = Illinois\n| district     = 20th\n| predecessor  =\n| successor    = Henry J. Frantz\n| term_start   =\n| term_end     =\n| party        = Republican\n| residence    = Minonk, Illinois\n| profession   = Physician\n}}\nEdward A. Wilcox (September 8, 1830 – September 23, 1910) was an American physician and politician from Pennsylvania. Coming to Illinois at a young age with his family, Wilcox attended both public and private schooling before matriculating at Rush Medical College. He established a practice in Minonk, Illinois in 1858 which he operated until his death in 1910. Wilcox was also active in politics as a member of the county and state Republican Parties. He served two two-year terms in the Illinois Senate starting in 1872. He co-founded the North Central Illinois Medical Association in 1874.\nBiography\nEdward A. Wilcox was born in Wattsburg, Pennsylvania on September 8, 1830. He was the eldest child born to Dr. Levi Wilcox, who practiced medicine and was later a U.S. Consul to Kankow, China. Two of Wilcox's uncles were also physicians, and one of Wilcox' brothers would also pursue that profession. In 1837, Wilcox's family moved to Lacon, Illinois. Wilcox attended public school there and later attended private schooling at Mount Morris Academy. Wilcox's father died young, so Wilcox studied medicine under one of his uncles, R. B. Rodgers, in Lacon. He later studied with Robert Boal, a former partner of his father.\nWilcox matriculated at Rush Medical College in Chicago, Illinois, graduating in 1857. He returned to Lacon to practice for a year, then moved to Minonk, Illinois. He practiced there until his death. Wilcox was thrice named mayor of Minonk and served two terms on its school board. He was postmaster for eight years and sixteen years on the Woodford County Republican central committee. For twelve years, he served on the Illinois Republican Central Committee, four on its executive committee. He was twice a delegate to the Republican National Convention. In 1872, Wilcox was elected to the Illinois Senate, where he served two consecutive two-year terms; he was the only physician in the Senate at the time and thus focused on charitable institutions. Rush presented Wilcox with an honorary degree in 1874.\nWilcox married Caroline Mathis on June 23, 1857; they had eight children. She died in 1878 and Wilcox married a year later to Victoria Boyle. Wilcox and Boyle had another five children. Son Frederick W. practiced medicine in Minonk. Son Alfred R. (Twin Falls, Idaho) and Brainard (Minonk) practiced dentistry. Wilcox served with the Illinois Medical Society and the Woodford County Medical Organization. He co-founded the North Central Illinois Medical Association with fourteen other physicians in 1874. Wilcox died in Minonk on September 23, 1910.\nReferences"
    }
  ]
}