{
  "content": [
    {
      "type": "text",
      "text": "# Edward Horsman\n\n| birth_place =\n| death_date =\n| death_place = Biarritz, France\n| nationality = British\n| party =\n| alma_mater = Trinity College, Cambridge\n| spouse = Charlotte Ramsden\n}}\nEdward Horsman PC, PC (Ire) (8 February 1807 – 30 November 1876), was a British politician.\nBackground and education\nHorsman was the son of William Horsman, a well-to-do gentleman of Stirling, Scotland, who died 22 March 1845, aged 86. His mother was Jane, third daughter of Sir John Dalrymple, 4th Baronet, and sister of the seventh and eighth Earls of Stair; she died in 1833. He entered Rugby School at Midsummer 1819, and afterwards proceeded to Trinity College, Cambridge, but did not take a degree. While at Cambridge he took part in three first-class cricket matches. He was admitted an advocate of the Scottish bar in 1832, but did not long continue to practise his profession.\nPolitical career\n, 1872]]\nAs a moderate liberal he unsuccessfully contested Cockermouth in 1835, but was successful at the following election on 15 February 1836, and continued to represent the constituency till 1 July 1852. Defeated at the general election of that date, he was returned unopposed on 28 June 1853 for Stroud, and sat for that town till 11 November 1868. At the 1868 general election he stood unsuccessfully in Falkirk Burghs. From 11 May 1869 to his death he was member for Liskeard, but he had then so far separated himself from the Liberal Party that he was opposed on both occasions by more advanced members of his own partyin 1869 by Sir F. Lycett, and in 1874 by Leonard Courtney.\nEarly in his political career (January 1840) Horsman, when addressing his constituents at Cockermouth, denounced James Bradshaw, M.P. for Canterbury, for speaking ill of the queen, and for secretly sympathising with the chartists. A bitter correspondence was followed by a duel at Wormwood Scrubbs, which was without serious results. Finally Bradshaw apologised. Horsman was from September to August 1841 a junior Lord of the Treasury in Lord Melbourne's administration. He criticised severely, and at times with personal bitterness, the ecclesiastical policy of Lord John Russell's ministry of 1847, as being far too favourable to the bishops. A vote of censure on the ecclesiastical commissioners was moved by him and rejected 14 December 1847. On 26 April 1850, in the discussion on the Ecclesiastical Commission Bill, Horsman smartly attacked the bishops, and roused Goulburn to denounce him as \"a disappointed man\" foiled of his hopes of office. In March 1855, when Lord Palmerston became prime minister and the Peelites withdrew from the cabinet, Horsman was made Chief Secretary for Ireland, and was sworn a member of both the British and Irish Privy Councils. He resigned the chief secretaryship after the general election in April 1857, and thenceforth assumed a more independent position in the House of Commons. With Robert Lowe, afterwards Viscount Sherbrooke, he resisted the Reform Bill brought in by William Ewart Gladstone in March 1866. John Bright, speaking on the second reading (13 March 1866), ascribed Mr. Lowe's hostility to Horsman's influence, and depicted Horsman retiring 'into what may be called his political cave of Adullam, to which he invited every one who was in distress, and every one who was discontented.' According to Bright Horsman's party, to which Bright's sobriquet of the \"cave\" has since adhered, consisted only of himself and Mr. Lowe, but thirty-three liberal members voted against the second reading of the bill upon which the ministry was afterwards defeated in committee (18 June). Horsman maintained his independent attitude to the last. He best served the public by exposing jobs and other weak points in the ecclesiastical system.\nIn 1841, while he was a junior lord of the treasury, he gained notoriety for attacking Lord John Russell's ecclesiastical policy in 1847 and subsequent years. In 1855, under Lord Palmerston, he was made Chief Secretary for Ireland, but resigned in 1857. He gradually took up a position as an independent Liberal, and was well known for his attacks on the Church, and his exposures of various \"jobs\".  His name became principally connected with his influence over Robert Lowe, 1st Viscount Sherbrooke in 1866 at the time of Gladstone's Reform Bill, to which he and Lowe were hostile; and it was in describing the Lowe-Horsman combination that John Bright spoke of the \"Cave of Adullam\". In the 1867 debate on extending the franchise, he said in the House of Commons:  \"There is an irreconciliable enmity between democracy and freedom\".\nFamily\nHorsman married Charlotte Louisa, only daughter of John Charles Ramsden, MP, on 18 November 1841. He died at Biarritz, France, on 30 November 1876, aged 68, and was buried there on 2 December.\nPublications\n# \"Speech on the Bishopric of Manchester Bill\", 1847, two editions.\n# \"Five Speeches on Ecclesiastical Affairs delivered in the House of Commons, 1847, 1848, and 1849\".\n# \"Speech on the Present State of Parties and Public Questions\", 1861.\nHis views and assertions were criticised in \"Mr. Horsman's Statement respecting the Horfield Manor Lease\", by J. H. Monk, bishop of Gloucester, 1852; in \"Mr. Horsman's Motion in the House of Commons [on the institution of Bennett to vicarage of Frome], tested by Extracts from 'Letters to my Children'\", by the Rev. W. J. E. Bennett, 1852 (HANSARD, 20 April 1852, pp.&nbsp;895–916); and in \"An Usurious Rate of Discount limits and prevents the Working Classes from obtaining Employment. Being a reply to Mr. Horsman\", by R. Wason, 1866.\nReferences\nAttribution:\n*\n*\n*\nExternal links\n*\n* [http://www.stonehousehistorygroup.org.uk/page37.html Edward Horsman cuts first sod – Stonehouse Nailsworth Branch Railway 1864]"
    }
  ]
}