{
  "content": [
    {
      "type": "text",
      "text": "# Edward Mitchell (New York politician)\n\n|birth_place = New York City, New York, US\n|death_date =\n|death_place = New York City, New York\n|resting_place = Woodlawn Cemetery, Bronx, New York\n|party = Republican\n|spouse = Caroline C. Woolsey (m. 1867-1909, his death)\n|children = 1\n|relatives = John M. Mitchell (brother)\n|education = Columbia CollegeColumbia Law School\n|profession = Attorney\n|allegiance = United StatesNew York\n|branch = New York National Guard\n|rank = Lieutenant Colonel\n|unit = 1st Division\n|serviceyears = 1881–1886\n}}\nEdward Mitchell (April 15, 1842 – February 15, 1909) was an American lawyer and politician from New York. A Republican, He was a graduate of  Columbia College and Columbia Law School. Mitchell was most notable for his service in the New York State Assembly in 1880, and United States Attorney for the Southern District of New York from 1889 to 1894.\nEarly life\nMitchell was born on April 15, 1842, on Charlton Street in New York City, New York, the eldest son of Edward Mitchell, a lawyer and judge who served on the New York Supreme Court and the New York Court of Appeals, and Mary P. Berrian. His brother was congressman John M. Mitchell.\nMitchell attended Columbia Grammar School from 1854 to 1857. He then went to Columbia College in 1857, graduating from there with a B.A. in 1861.\nStart of career\nHe then went to Columbia Law School, but he left that year to serve in the American Civil War a volunteer field agent for the United States Sanitary Commission. He served in Richmond, Antietam, Port Hudson, and the Red River expedition. Afterwards, he finished his studies at Columbia Law School, graduating from there with an LL.B. in 1865. He was admitted to the bar later that year and practiced law. In 1867, he married Caroline Carson Woolsey. They had a daughter, Eliza.\nIn 1879, Mitchell was elected to the New York State Assembly as a Republican, representing the New York County 21st District. He served in the Assembly in 1880. In 1880, he became a trustee of Columbia. From 1881 to 1886, he was a lieutenant colonel in the New York National Guard and a Judge Advocate of the 1st Division. In 1883 and 1886, he unsuccessfully ran for the New York Supreme Court.\nLater career\nIn 1889, President Harrison appointed him United States Attorney for the Southern District of New York. He served in the office until 1894. In 1897, he briefly served as New York City Commissioner of Parks. For many years, he was also senior member of the law firm Mitchell & Mitchell.\nCivic and professional memberships\nMitchell was an incorporator of the University Club. He was a member of the American Geographical Society. He was a member of the New York City Bar Association, serving as its treasurer from 1874 to 1885 and vice-president from vice-president from 1885 to 1886. He was also a member of the New York State Bar Association, the Metropolitan Club, the Union League Club, the Tuxedo Club, the Shinnecock Hills Golf Club, and the Washington D.C. Metropolitan Club.\nDeath and burial\nMitchell died at his Manhattan home on February 15, 1909. He was buried in Woodlawn Cemetery.\nReferences\nExternal links\n* [https://politicalgraveyard.com/bio/mitchell3.html#285.45.65 The Political Graveyard]\n* [https://www.findagrave.com/memorial/197072061/edward-mitchell Edward Mitchell] at Find a Grave"
    }
  ]
}