{
  "content": [
    {
      "type": "text",
      "text": "# Edward Percival Wright\n\n| birth_place       = Donnybrook, Dublin, Ireland\n| death_date        =\n| death_place       = Dublin, Ireland\n| death_cause       =\n| resting_place     =\n| resting_place_coordinates =\n| other_names       =\n| siglum            =\n| pronounce         =\n| citizenship       = Irish\n| nationality       =\n| fields            =\n| workplaces        =\n| patrons           =\n| education         =\n| alma_mater        = Trinity College Dublin\n| thesis_title      =\n| thesis_url        =\n| thesis_year       =\n| doctoral_advisor  =\n| academic_advisors =\n| doctoral_students =\n| notable_students  =\n| known_for         =\n| influences        =\n| influenced        =\n| awards            =\n| author_abbrev_bot =\n| author_abbrev_zoo =\n| spouse            =\n| partner           =\n| children          =\n| parents           =\n| father            =\n| mother            =\n| relatives         =\n| signature         =\n| signature_alt     =\n| website           =\n| footnotes         =\n}}\nEdward Percival (Perceval) Wright FRGSI (27 December 1834, Donnybrook – 2 March 1910) was an Irish ophthalmic surgeon, botanist and zoologist.\nFamily, education and career\nHe was the eldest son of barrister, Edward Wright and Charlotte Wright. One of his brothers was Charles Henry Hamilton Wright. Edward was educated by a private tutor, and was taught natural history by George James Allman. From 1852 he studied at Trinity College Dublin, graduating BA in 1857. In that same year he became curator of the University Museum at Trinity and, the following year, 1858, lecturer in zoology, a post which he held for ten years. At the same time he undertook medical studies and lectured in botany at the medical school of Dr Steevens' Hospital, Dublin gaining an M.A. (University of Dublin) in 1859 and an MA Ad eundem degree (University of Oxford). He graduated M.D in 1862. Wright was also a founding editor of the Journal of Anatomy and Physiology in 1867.\nWright next studied ophthalmic surgery in Vienna, Paris and Berlin. In Berlin he was taught by Hermann Loew's pupil Albrecht von Gräfe. He practised this profession both before and after becoming professor of botany at Trinity College Dublin, in 1869, a position he held until 1905, having previously assisted William Henry Harvey in this post. He was also appointed curator of the herbarium.\nIn 1872 he married Emily Shaw, second daughter of Colonel Ponsonby Shaw. The couple had no children.\nTravel\nWright was a keen traveller spending most vacations on the continent of Europe collecting natural history specimens and\nin 1867 he spent six months in the Seychelles making large collections of the fauna and flora. Some animals, for instance the Whale shark were studied in depth.\nHe spent the spring of 1868 in Sicily and the autumn of this year in dredging off the coast of Portugal. He joined Alexander Henry Haliday on a later entomological expedition to Portugal and two further natural history trips to Sicily, then little known. \"I have still a strong harkening for Sicily were it but to set foot on the soil and breathe the air of it\". Haliday died shortly after the last trip and Wright became his entomological executor after a twenty-year friendship.\nNatural history and scientific zoology\nWright had very varied natural history interests and in 1854 founded the Natural History Review which he edited. He contributed articles on Irish birds, fungi parasitic upon insects, mollusc collecting, Irish filmy ferns, the flora of the Aran Islands, Irish sea anemones, sponges, and sea slugs. More scientific work followed.\nIn 1857 he joined Alexander Henry Haliday on a speleological excursion to Mitchelstown Caves in County Galway to study the Cave insects. One, Lipura wrightii was subsequently named for him. With Dr Théophile Rudolphe Studer he reported on the corals (Alcyonaria) of the Challenger expedition producing a report in 1889.\nAlso in the 1850s an exceptional assemblage of Upper Carboniferous fossil amphibians (these are very rare only two other occurrences are known worldwide) were discovered in coal measures at Jarrow Colliery, Castlecomer. They were described by Wright with Thomas Henry Huxley.\nHis principal research was in marine zoology however and at the Leeds meeting of the British Association for the Advancement of Science in 1858, he, with Joseph Reay Greene, gave a report on the marine fauna of the south and west coasts of Ireland. He was one of the earliest workers in deep water dredging at (800–900&nbsp;m) at Setubal Bay, Portugal. He also described a species of copepod Pennella in 1870, published on Irish sponges in 1869 and on algae. The alga Cocconeopsis wrightii (O'Meara, 1867) was named in his honour.\nWright was the Secretary of the Dublin University Zoological and Botanical Association the Royal Geological Society of Ireland and a member of the Dublin Microscopical Club and president of the Royal Society of Antiquaries of Ireland (1900–02). He became a member of the Royal Irish Academy in 1857 and in 1883 he was awarded their prestigious Cunningham Medal for editing the society's Proceedings\nHe died at Trinity College on 2 March 1910, and was buried at Mount Jerome Cemetery, Dublin.\nLegacy\nWright is commemorated in the scientific name of a species of lizard, Trachylepis wrightii.\nWorks\nPartial list\n* (1855) Catalogue of British Mollusca. Natural History Review Society (Proceedings of Societies) 2: 69–85.\n* (1859) Notes on the Irish nudibranchiata. Natural History Review Society (Proceedings of Societies) 6: 86–88.\n* (1859) with Greene, J.R. 1859 Report on the marine fauna of the south and west coasts of Ireland. Report for the British Association for the Advancement of Science : 176–181\n* (1860) Wright, E.P. 1860 Notes on the Irish people nudibranchiata. Proceedings of the Natural History Society of Dublin 2: 135–137.\n* (1864) Translation of F. C. Donders's The Pathogeny of Squint (1864)\n* (1865) A modification of Liebreich's ophthalmoscope in ?\n* (1865) Notes on Colias edusa. Proceedings of the Dublin Natural History Society 5: 7–8.\n* (1866) with Huxley, T. H.  On a collection of fossils from the Jarrow Colliery, Kilkenny Geological Magazine, v. 3, p.&nbsp;165–171.\n* (1867) with Huxley, T.H. On a Collection of Fossil Vertebrata from the Jarrow Colliery County Kilkenny Ireland. Transactions of the Royal Irish Academy Vol. 24 – Science.\n* (1867) Remarks on freshwater rhizopods Quarterly Journal of Microscopical Science, new ser., v. 7, p.&nbsp;174–175.\n* (1868) Notes on the bats of the Seychelles group of islands. Annals and Magazine of Natural History.\n* (1868) Notes on Irish sponges. Proceedings of the Royal Irish Academy 10: 221–228.\n* (1870). Six months at the Seychelles. Spicilegia Zoologica, Dublin 1, 64–65.\n* (1872) English translation and revision of Louis Figuier The ocean world. New York: D. Appleton.(Louis Figuier was a prolific writer on scientific and technological matters for the general public. Much of the scientific information in the novels of Jules Verne was taken from his work. Wright's translations earned substantial royalties).\n* (1875) English translation and revision of Louis Figuier Mammalia, Their Various Forms and Habits London, Cassell & Company, Ltd. Reprinted until 1892.\n* (1877) On a new genus and species of sponge Proceedings of the Royal Irish Academy, ser. 2, v. 2, p.&nbsp;754–757, pl. 40.\n* (1889) with Studer, T. Report on the Alcyonaria -Voyage of H.M.S. Challenger Zoology 31, i–lxxvii + 1.– 314.\n* (1896) The herbarium of Trinity College, a retrospect Notes from the Botanical School of Trinity College, Dublin, 1, 1–14\nReferences\nFurther reading\n*Foster, J.W., and Chesney, H.C.G (eds.) (1977). Nature in Ireland: A Scientific and Cultural History. Lilliput Press. .\n*McDowell, R.B., and Webb, D.A.  Trinity College, Dublin, 1592–1952: an academic history.\n*Webb, D.A. (1991) \"The herbarium of Trinity College, Dublin its history and contents\". Botanical Journal of the Linnean Society 106: 295–327.\n*Irish Naturalist, 19 (1910), 61–3. Portrait.\nExternal links\n*\n*[https://web.archive.org/web/20080224024556/http://www.tcd.ie/Geology/MAIN-PAGE/museum.php Geological Museum Trinity College]"
    }
  ]
}