{
  "content": [
    {
      "type": "text",
      "text": "# Edwardsville High School__disambig_1\n\n| district                = District 7\n| superintendent          = Patrick Shelton\n| principal               = Alex Fox (Interim)\n| staff                   =\n| faculty                 =\n| teaching_staff          = 136.49 (FTE)\n| ratio                   = 17.16\n| ceeb                    =\n| average_class_size      =\n| gender                  = coed\n| schooltype              = Public Secondary\n| grades                  = 9–12\n| campus                  = suburban\n| campus_size             =\n| athletics_conference    = Southwestern Conference\n| slogan                  =\n| song                    =\n| fight_song              = \"Go Tigers\"\n| motto                   =\n| accreditation           =\n| mascot                  = Tiger\n| mascot_image            =\n| nickname                =\n| school_colors           =  orange black\n| yearbook                = The Tiger\n| publication             =\n| newspaper               = [https://www.ehstigertimesonline.com/ Tiger Times (online)], The Claw (print)\n| opened                  = 1997 (current building)\n| status                  =\n| closed                  =\n| nobel_laureates         =\n| enrollment              = 2,342 (2023-2024)\n| free_label              =\n| Student Section         =\n| free_label1             =\n| free_text1              =\n| free_label2             =\n| free_text2              =\n| free_label3             =\n| free_text3              =\n| free_label4             =\n| free_text4              =\n| free_label5             =\n| free_text5              =\n| picture                 =\n| homepage                =\n}}\nEdwardsville Senior High School is a public high school located in Edwardsville, Illinois.\nHistory\nEdwardsville High School was first located on North Kansas Street in downtown Edwardsville. Due to the expansion of the town, a new high school was commissioned in 1921. Today, the first building is Columbus Elementary School.\nThe second Edwardsville High School was completed in 1925, on 145 West Street. Rather than rebuild a bigger school, it was expanded over the years to meet the demands of the growing school district.\nIn 1993, Edwardsville High school was unable to be expanded any longer, and a motion was passed to turn the old High School into a middle school, and build a new state of the art High School at 6161 Center Grove Road.\nThe current Edwardsville High School complex was completed in 1996 by the Korte Company and began regular use in 1997\nFeatures\nEdwardsville High School's Chuck Fruit aquatic center is home to the only Olympic size swimming pool in the Metro East\nAthletics\nEdwardsville High School competes in the Illinois Southwestern Conference. The associated sports include: boys and girls basketball, boys baseball, boys and girls bowling, boys and girls cross country, boys football, boys and girls golf, boys and girls ice hockey, girls lacrosse, boys and girls soccer, girls softball, boys and girls swimming, boys and girls tennis, boys and girls track and field, boys and girls volleyball, boys and girls wrestling, girls cheerleading, girls dance team, girls field hockey, girls flag football, boys and girls bass fishing.\nThe school has won a number of state championships:\nBoys Baseball: 1990, 1998, 2019, 2022, 2023\nBoys Track and Field: 2015, 2017, 2024\nBoys Soccer: 2000, 2014\nIncidents\nThe school has been the target of several bomb and shooting threats, most notably in 2004, 2010, 2014, and 2018.\nIn November 2019, several fights broke out following the circulation of racially charged posts on Snapchat that led to school disruptions and increased security measures. The incidents began when inflammatory statements targeting African-Americans were shared across several social media platforms, primarily Snapchat, which triggered a series of physical altercations between groups of students on and off of the school's campus. In the week following the spread of the offensive post, a number of white male students engaged in further provocative behavior, most notably when a student inscribed several anti-African American slurs onto the side of his pickup truck, and paraded the message around the school's parking lot and surrounding neighborhoods.  The situation escalated to the point where a student created a social media post threatening to bring a gun to the high school, though this threat was later determined to be false. School administrators responded by implementing a temporary increased police presence at the high school to ensure student safety and manage the emerging tensions.\nIn May 2023, Edwardsville High School was involved in controversy after another racist Snapchat post, allegedly created by a student, was reported to school administrators. The post contained offensive content and led to an investigation in coordination with the Edwardsville Police Department.\nBoth the 2019 and 2023 incidents were part of a broader pattern of reported racial harassment that continued in subsequent years, as highlighted by community members during school board meetings. Parents, including Scott Ahart, a 1985 alumnus, and Donna Charleston, openly criticized the persistence of racist behaviors among students, describing incidents such as students being called racial slurs, being referred to as \"slaves,\" and experiencing racially offensive social media posts. Despite existing policies prohibiting racial harassment in the student handbook and district strategic plan, community members continued to call for more robust enforcement, clearer consequences, and comprehensive education about racial harassment.\nIn response to the 2023 incident and related concerns, Superintendent Jason Henderson stated that educational strategies to address racism were being developed, potentially including the formation of an Equity Task Force. These strategies included equity-focused training for staff and students, as well as updates to school policies to promote a more inclusive environment. District officials emphasized that these changes were part of ongoing efforts to address racial and gender-based discrimination in the school system.\nThe 2023 incident also resulted in increased police presence at Edwardsville High School, with law enforcement working to ensure safety and manage disruptions following community tensions. Reports noted that the school community experienced significant disruption, including heightened concerns about student safety.\nCommunity dialogue and media coverage reflected the seriousness of the situation, with further calls for transparency and long-term commitments to addressing systemic discrimination. Videos shared by local outlets documented the school board's response and the growing pressure from the community to ensure meaningful change.\nThis controversy reflects larger systemic issues that extend beyond the school district, particularly in the intersection of technology and equity. Social media platforms, such as Snapchat, have been criticized for enabling the rapid spread of harmful or discriminatory content. These systems often lack mechanisms to prevent misuse, which can amplify bias and disproportionately harm marginalized communities. Technological tools and institutional structures must account for societal inequities to avoid reinforcing existing power imbalances. Edwardsville High School’s experience serves to highlight the issues that educational institutions face in addressing systemic discrimination. The school’s response, which included policy changes and training initiatives, aligns with broader calls for systemic reform to confront inequity in schools, technology, and society.\nNotable alumni\n* Jason Boyd, former MLB player (Pittsburgh Pirates, Philadelphia Phillies, San Diego Padres, Cleveland Indians)\n* Rodney Coe, former NFL player\n* A. J. Epenesa, NFL defensive end (Buffalo Bills)\n* Justin Hampson, Former MLB player (Colorado Rockies, San Diego Padres, New York Mets)\n* Barb Honchak - professional Mixed Martial Artist, inaugural Invicta FC Flyweight Champion, currently competing in the UFC\n* Bob Hoskins, former NFL player (San Francisco 49ers)\n* Mannie Jackson, All-American college basketball guard for Illinois Fighting Illini from 1957–60, 1st African-American owner of major sports corporation (Harlem Globetrotters), Naismith Basketball Hall of Fame Inductee, 2002\n* Craig James, NFL player\n* Mark Little, Former MLB player (St. Louis Cardinals, Colorado Rockies, New York Mets, Arizona Diamondbacks, Cleveland Indians)\n* Kate Martin, WNBA basketball player (Golden State Valkyries)\n* Laurie Metcalf, Emmy-award-winning actress, known for roles on TV's Roseanne and the Toy Story movies\n* Don Ohl, college basketball guard for Illinois Fighting Illini from 1955–58, 5th round 1958 NBA draft pick by the Philadelphia Warriors, 5x NBA All-Star from 1963-1967\n* Riley Patterson, NFL player\n* Vincent Valentine (American football), current Defensive Lineman for the NFL's New England Patriots.\n* Govoner Vaughn, All-American college basketball forward for Illinois Fighting Illini from 1957–60\nReferences"
    }
  ]
}