{
  "content": [
    {
      "type": "text",
      "text": "# Edward Bagshaw (theologian)\n\nEdward Bagshaw (Bagshawe), the younger (1629–1671) was an English Nonconformist minister and theologian, known as a controversialist. His sympathies were with the fringe Independent sects of the Commonwealth period, and after the English Restoration of 1660 his life was embattled. Richard Baxter criticized Bagshaw as \"an Anabaptist, Fifth Monarchy man, and a Separatist\".\nLife\nHis father Edward Bagshawe was a lawyer and politician. Henry Bagshaw (1632–1709) was his brother.\nHe was educated at Christ Church, Oxford, where John Locke was also, when Bagshaw was a Student (i.e. Fellow of the college). Locke's Two Tracts on Government, representing more orthodox views of the time, were intended as replies to Bagshaw's views on religious toleration, published as The Great Question concerning things indifferent in religious worship in 1659.\nA position teaching at Westminster School  in 1656 ended badly when he quarreled with headmaster  Richard Busby. He was ordained in 1659 by Ralph Brownrigg, and became vicar at Ambrosden, but was soon ejected for non-conformity.\nA large and acrimonious pamphlet literature grew up around Bagshaw, some of it generated by his hostility to George Morley, the Restoration bishop of Worcester (translated in 1662 to Winchester), and Dean of Christ Church from 1660. He was chaplain to Arthur Annesley, 1st Earl of Anglesey in 1661. He then spent a time imprisoned in the Tower of London, from early 1663. He was attacked in print by Roger L'Estrange.\nIn the last year of his life he published a biography of Vavasor Powell. To the end he was also arguing out the separatist case against Richard Baxter, who hoped to keep dissenters (apart from the extremes) within the Church of England. Bagshaw hit out at Baxter's lukewarm position on dissent. In 1672, Baxter was still accusing Bagshaw of tricky polemics, in trying to draw discussion of the position of honest Nonconformist dissenters onto the touchy grounds of full toleration, politics and war.\nHe died while on parole from Newgate Prison, and was buried in Bunhill Fields.\nNotes\nExternal links\n*[http://www.sovereignredeemerbooks.com/views/books/show.php?id=10 Bagshaw's book entitled Discourse Concerning God’s Decrees]\nReferences\n*Andrew Pyle (editor), Dictionary of Seventeenth Century British Philosophers (2000), article on Bagshaw, pp.&nbsp;47–51."
    }
  ]
}