{
  "content": [
    {
      "type": "text",
      "text": "# Edward Southwell Sotheby\n\n| image            =\n| caption          =\n| birth_date       =\n| birth_place      =\n| death_date       =\n| death_place      =\n| resting_place    =\n| education        =\n| alma_mater       =\n| father           =\n| mother           = Lady Mary Anne Bourke\n| spouse           = Lucy Elizabeth Adeane\n| children         = 3\n| occupation       =\n| known_for        =\n| relatives        = William Sotheby (uncle)\n| module           =\n| branch           =\n| serviceyears     = 1832-1870\n| unit             = Pearls Naval Brigade\n| rank             = Admiral\n| awards           = Mentioned in dispatchesCBKCB\n| battles          =\n*Egyptian–Ottoman War\n*First Opium War\n*New Zealand Wars\n*Indian Rebellion of 1857\n}}\n}}\nAdmiral Sir Edward Southwell Sotheby  (14 May 1813 – 6 January 1902) was an English naval officer in the Royal Navy.\nEarly life and education\nSotheby was born at Clifton, Bristol, the second son of Admiral of the Blue Thomas Sotheby (1758–1831), and his second wife, Lady Mary Anne (d. 1830), fourth daughter of Joseph Bourke, 3rd Earl of Mayo and Archbishop of Tuam. The poet William Sotheby (1757–1833) was his uncle and Rear-Admiral Charles Sotheby his cousin. He was from the southern branch of the famed Sotheby family from Yorkshire, which found success as auctioneers. He attended the Royal Naval College, Portsmouth, entering the Royal Navy on 3 August 1826, aged 13.\nCareer\nSotheby passed the Royal Navy examination in 1832 before going to sea. He was commissioned as a lieutenant, 3 October 1835. He served on  during the 1840 operations off the coast of Syria during the Egyptian–Ottoman War. For his services during the conflict, he was promoted to commander on 30 October 1841.\nHe saw conflict again on Dido in 1842 during the First Opium War, when the British unleashed \"gunboat diplomacy\" to defeat the Chinese. In 1846–1847, he commanded  against the Māori in the New Zealand Wars. In 1850, he took command of  and exerted himself in the suppression of the slave trade along the west coast of Africa. He was promoted to captain in September 1852.\nFrom 1855 to 1858, Sotheby was captain of , a 21-gun screw corvette which he commanded in the Pacific Ocean, China, and India. While on route to India for the Indian Rebellion of 1857, Pearl rescued the crew of the wrecked transport HMS Transit, which wrecked off Bangka Island, Sumatra. Sotheby was called to shore and took command of the Pearls Naval Brigade for 10 months. For his assistance in suppressing the Indian uprising, Sotheby received the thanks of both Houses of Parliament, the Governor-General of India, the Lords Commissioners of the Admiralty, and the Naval and Military Commanders-in-Chief in India for services rendered.\nIn 1860, Sotheby was captain of the battleship , a 101-gun  screw-propelled first-rate ship of the line of the Royal Navy. He served in the English Channel until late 1861, when Conqueror was despatched to carry troops supporting the French intervention in Mexico. On 29 December 1861, the ship was wrecked on the reefs of Rum Cay, in the Bahamas, without loss of life. It was determined the master failed to allow for the local currents. When Sotheby was brought to court-martial, he argued that the captain was not responsible for the navigation of the ship, which was the role of the master. The court accepted Sotheby's argument and admonished the master. However, Admiral of the Fleet Sir Alexander Milne, 1st Baronet disagreed with the outcome of the court-martial and successfully wrote a letter to the Admiralty, in which he not only attributed the loss of Conqueror  to carelessness, but blaming Sotheby personally for his failure to supervise the master. On 20 March 1862, the Admiralty reconsidered the court case and revised the regulations by placing the ultimate responsibility for a ship's safety on the captain. After the court case, Sotheby had no further commands in the Royal Navy. In 1863, he commanded the Portland coastguard division, his final command.\nSotheby was made a rear-admiral on 1 September 1867, a vice-admiral on 25 August 1873, and an admiral in June 1879. He retired from active service on 1 April 1870.\nAfter his retirement, Sir Edward devoted himself to his philanthropic work for the blind. For many years, he was chairman of the Blind Institute in Tottenham. In 1886, he was made a commissioner for investigating and reporting on the condition of the blind.\nHonours\nFor his role in suppressing the Indian uprising, Sotheby and his brigade were mentioned in dispatches 13 times. He was made a Companion of the Order of the Bath (CB) and an extra aide de camp to Queen Victoria  (1858–67). In the 1875 Birthday Honours, he was promoted to a Knight Commander of the Order of the Bath (KCB).\nPersonal life\nSotheby married Lucy Elizabeth Adeane, third daughter of Henry John Adeane and granddaughter of Lord Stanley of Alderley. They had three sons: William Edward Southwell Sotheby, Alfred Frederick Sotheby, and Herbert George Sotheby.\nSir Edward died at his home at 26 Green Street, Mayfair, aged 88.\nReferences"
    }
  ]
}