{
  "content": [
    {
      "type": "text",
      "text": "# Edward De Robertis\n\n| birth_place       = Cambridge, Massachusetts\n| death_date        =\n| death_place       =\n| death_cause       =\n| nationality       =\n| fields            = embryology\n| workplaces        =\n| education         =\n| alma_mater        =\n| doctoral_advisor  = John Gurdon\n| known_for         = Dorsal-Ventral patterning, Evo-Devo, Xenopus\n| awards            =\n| website           = https://www.hhmi.ucla.edu/derobertis/\n| spouse            =\n| children          =\n}}\nEdward Michael De Robertis (born June 6, 1947) is an American embryologist and Professor at the University of California, Los Angeles. His work has contributed to the finding of conserved molecular processes of embryonic inductions that result in tissue differentiations during animal development. He was elected to the National Academy of Sciences in 2013, worked for the Howard Hughes Medical Institute for 26 years, and holds a Distinguished Professor at the University of California, Los Angeles. In 2009 Pope Benedict XVI appointed De Robertis to a lifetime position in the Pontifical Academy of Sciences, and in 2022 Pope Francis appointed him Councillor of the Academy for four years.\nEarly life and education\nEdward De Robertis was born on June 6, 1947, in Cambridge, Massachusetts, while his father, neurobiologist Eduardo De Robertis, was an MIT postdoctoral fellow. From the age of three, he was reared in Uruguay, where he received his medical degree at age 24 from the Universidad de la República del Uruguay. This was followed by the completion of a Ph.D. in chemistry at the Leloir Institute in Buenos Aires, Argentina.\nCareer and research\nDe Robertis' postdoctoral training (1974-1977) was with Nobel laureate Sir John Gurdon at the Medical Research Council in Cambridge England.\nIn 1984, De Robertis together with his late colleague Walter Gehring's and their laboratories cloned the first vertebrate development-controlling gene, today known as Hox-C6. Hox genes are responsible for anterior-to-posterior (head-to-tail) differentiation. The finding that Hox genes are conserved in both vertebrates and fruit flies heralded the beginning of the nascent scientific field of Evolution and Development, or Evo-Devo.\nIn the 1990s, the laboratory of De Robertis dissected systematically the molecular pathways that mediate embryonic induction. Hans Spemann and Hilde Mangold discovered in 1924 an area of the amphibian embryo that, when transplanted, might promote the creation of Siamese twins. De Robertis identified the genes expressed in Xenopus embryos in this area, beginning with the goosecoid homeobox gene.\nTogether with his colleagues, he discovered Chordin, a protein secreted by dorsal cells that binds Bone Morphogenetic Protein (BMP) growth factors, facilitating their transport to the ventral side of the embryo, where Chordin is digested by a protease called Tolloid, allowing BMPs to signal once more. In most bilateral species, such as fruit flies, spiders, early chordates, and mammals, this flow of growth factors dictates dorsal (back) to ventral (belly) cell and tissue differentiation. The Chordin/BMP/Tolloid biochemical pathway is cross-regulated by interactions with other signalling pathways such as Wnt. His lab has recently established a link between the canonical Wnt pathway, macropinocytosis, multivesicular endosomes, lysosomes, and protein degradation.\nHe has also served for over two decades on the scientific board of the Pew Charitable Trusts Latin American Fellows programme.\nPersonal life\nDe Robertis was born in the United States to Argentine parents who were exiled by Juan Perón. Through his father, Eduardo De Robertis, he is of Italian descent. His daughter, Caro De Robertis, is an author and professor of creative writing at San Francisco State University.\nHonors and awards\n*Member, National Academy of Sciences, 2013.\n*Doctor Honoris Causa, Université Pierre et Marie Curie, Paris, France, 2013.\n*Academician, Pontifical Academy of Sciences, the Vatican, 2009.\n*Ross Harrison Prize in Developmental Biology, 2009.\n*Membre Honoré, Societé de Biologie, Paris, France, 2008.\n*Corresponding Member, Latin American Academy of Sciences, 2002.\n*Fellow, American Academy of Arts and Sciences, 2000.\n*Public lecture series and Medal of the Collège de France, Paris, 1997.\n*Member, European Molecular Biology Organization, 1982.\n*Jane Coffin Childs Memorial Fund postdoctoral fellow, 1976-1977.\nPublications\n* Carrasco, A.E., McGinnis, W., Gehring, W.J. and De Robertis, E.M. (1984). Cloning of an Xenopus laevis gene expressed during early embryogenesis that codes for a peptide region homologous to Drosophila homeotic genes: implications for vertebrate development. Cell 37, 409-414.\n* De Robertis, E.M. and Sasai, Y. (1996). A common plan for dorso-ventral patterning in Bilateria. Nature 380, 37-40.\n* De Robertis, E.M. and Tejeda-Muñoz N. (2022). Evo-Devo of Urbilateria and its larval forms. Dev. Biol., 487, 10-20.\n* Cho, K.W.Y, Blumberg, B., Steinbeisser, H. and De Robertis, E.M. (1991). Molecular Nature of Spemann's Organizer: the Role of the Xenopus Homeobox Gene goosecoid. Cell 67, 1111-1120.\n* Sasai, Y., Lu, B., Steinbeisser, H., Geissert, D., Gont, L.K. and De Robertis, E.M. (1994). Xenopus chordin: a novel dorsalizing factor activated by organizer-specific homeobox genes. Cell 79, 779-790.\n* Piccolo, S., Sasai, Y., Lu, B. and De Robertis, E.M. (1996). Dorsoventral patterning in Xenopus: Inhibition of ventral signals by direct binding of Chordin to BMP-4. Cell 86, 589-598.\n* Piccolo, S., Agius, E., Lu, B., Goodman, S., Dale, L. and De Robertis, E.M. (1997). Cleavage of Chordin by the Xolloid metalloprotease suggests a role for proteolytic processing in the regulation of Spemann organizer activity. Cell 91, 407-416.\n* Lee, H.X., Ambrosio, A.L., Reversade, B. and De Robertis, E.M. (2006). Embryonic dorsal-ventral signaling: secreted Frizzled-related proteins as inhibitors of Tolloid proteinases. Cell 124, 147-159.\nReferences\nExternal links\n* [http://www.hhmi.ucla.edu/derobertis/ De Robertis Laboratory Home Page]\n* [http://www.hhmi.org/research/investigators/derobertis_bio.html Howard Hughes Medical Institute]\n* [http://faculty.biolchem.ucla.edu/institution/personnel?personnel%5fid=45782 UCLA Biological Chemistry]\n* [http://www.hhmi.ucla.edu/derobertis/doc/Our%20Papers/2008/Q%20&%20A%20CurrBiol_08.pdf Interview with Current Biology]\n* [https://web.archive.org/web/20100712011851/http://www.cancer.ucla.edu/Index.aspx?page=644&recordid=284 Pope Appoints Cancer Researcher to Prestigious Scientific Academy]\n* [http://www.casinapioiv.va/content/accademia/en/academicians/ordinary/derobertis.html Pontifical Academy of Sciences]\n* [http://www.hhmi.ucla.edu/derobertis/doc/Our%20Papers/2013/DeRobertis_PNAS_Profile_13_1.pdf NAS Profile]"
    }
  ]
}