{
  "content": [
    {
      "type": "text",
      "text": "# Edward Devereux, 11th Viscount Hereford\n\nEdward Devereux, 11th Viscount Hereford (baptised 12 August 1710 – 20 August 1760) was a British peer. In 1748, he succeeded his distant cousin as Viscount Hereford, the Premier Viscount in the Peerage of England.\nAncestry\nDevereux was a son of Arthur Devereux (d. 1711) of Nantcribba, Montgomeryshire, and his second wife, Elizabeth Glyn, daughter of Richard Glyn of Maesmawr Hall. He was baptised on 12 AUgust 1710 in Forden. He was the three-times great-grandson of Walter Devereux, 1st Viscount Hereford, through his second wife, Margaret Garneys.\nArthur Devereux was a son of Vaughan Devereux of Munlyn (d. 1700) and his wife, Mary Fox. His paternal grandparents were MP George Devereux (d. 1682) of Vaynor Park, Montgomeryshire, and Bridget Price.\nGeorge Devereux was a namesake son of Hon. Sir George Devereux of Sheldon Hall (d. 1665) and his wife Blanch Ridge, and a nephew of Walter Devereux, 5th Viscount Hereford, who held the title from 1646 to 1658. The descendants of Walter held the title from 1658 to 1700. A senior line of descendants of Sir George had held the title from 1700 to the death of their last male-line member in 1748. The 11th Viscount then inherited the title as their closest male-line relative.\nWalter and George Devereux were both sons of Sir Edward Devereux, 1st Baronet of Castle Bromwich (d. 1622), and his wife, Catherine Arden. The baronet was the fourth son of Walter Devereux, 1st Viscount Hereford, by his second wife. Walter was created Viscount Hereford in 1550 and held the title until his death in 1556. A senior line of his descendants held the title from 1556 to the death of their last male-line member in 1646.\nMary Grey was a daughter of Thomas Grey, 1st Marquess of Dorset, and his second wife Cecilia Bonville, 2nd Baroness Bonville.\nMarriage and children\nOn 13 April 1738, Edward married Catherine Mytton (d.1748). She was a daughter of Richard Mytton of Pontyscowryd and Garth, High Sheriff of Montgomeryshire, and Dorothy Wynn. They had five children:\n*Hon. Bridget Devereux (9 May 1739 – 21 May 1781), married Price Jones\n*Arthur Devereux (25 March 1740 – buried 17 July 1743), died in infancy\n*Edward Devereux, 12th Viscount Hereford (1741–1783), married in 1774 Henrietta Charlotte Tracy, Maid of Honour to Queen Charlotte; daughter of Anthony Tracy)\n*Arthur Devereux (baptised 14 February 1741/2 – 17 September 1743), died in infancy\n*George Devereux, 13th Viscount Hereford (1744–1804), married in 1768 his cousin Marianne Devereux; father of the 14th Viscount\n*Hon. Catherine Devereux (7 February 1743 – 1814), married 1793 Rev. John Acland of Broadclyst\nHe died at his seat, Vaynor Park, Montgomeryshire, and was succeeded by elder and younger sons, respectively.\nReferences"
    }
  ]
}