{
  "content": [
    {
      "type": "text",
      "text": "# Edward Manibusan\n\n|term_start   = January 12, 2015\n|term_end     =\n|predecessor  = Gilbert Birnbrich\n|successor    =\n|governor1    = Pedro Tenorio\n|term_start1  = July 1, 1989\n|term_end1    = January 8, 1990Acting\n|predecessor1 = Alexandro Castro\n|successor1   = Robert Naraja\n|office2      = Chair of the Northern Mariana Islands Democratic Party\n|term_start2  = April 6, 2012\n|term_end2    = January 1, 2014\n|predecessor2 = Jesus Borja (acting)\n|successor2   = Jesus Borja (acting)\n|birth_name   = Edward Eladio Manibusan\n|birth_date   =\n|birth_place  =\n|death_date   =\n|death_place  =\n|party        = Democratic\n|spouse       = Delfina\n|children     = 3\n|education    = University of GuamCalifornia State University, Fullerton (BA)Gonzaga University (JD)\n}}\nEdward Eladio Manibusan (born 1952/1953) is a Northern Mariana Islander attorney and politician serving as the first elected Attorney General of the Northern Mariana Islands. He took office on January 12, 2015. He previously served in the position  from July 1, 1989 to January 8, 1990 when it was a gubernatorial appointment.\nEarly life and education\nHe graduated from Marianas High School in 1972. He attended the University of Guam from 1972 to 1975 where he earned an associate's degree in political science. Manibusan graduated from California State University at Fullerton with a Bachelor of Arts degree in Criminal Law in 1977. He then attended Gonzaga University School of Law and graduated in 1982.\nLegal career\nAfter graduating law school, Manibusan became a public defender. One year later, he was made an assistant attorney general assigned to the criminal division. In 1986, Governor Pedro Pangelinan Tenorio appointed Manibusan, the Director of the Department of Public Safety. Manibusan was sworn in as DPS director on November 14, 1986.\nHe was the appointed Attorney General from 1989 to 1990. He was an Associate Judge of the Superior Court of the Commonwealth of the Northern Mariana Islands from February 1993 to July 1998, the Presiding Judge of the NMI Superior Court from July 1998 to March 2003, and an attorney in solo private practice.  Prior to the election he also held an honorary appointment as the Civilian Aide to the United States Secretary of the Army for the CNMI.\nIn 1998, Judge Procter Ralph Hug Jr. of the U.S. Court of Appeals for the Ninth Circuit appointed Manibusan as a special judge at the District Court for the Northern Mariana Islands from January 26, 1998 to December 31, 1998.\nInterim\nManibusan retired from active government service on March 14, 2003. On April 6, 2012, he became the chairman of the reorganized Democratic Party of the Northern Mariana Islands, succeeding acting chair Jesus Borja. In that capacity he worked to rebuild ties with the Democratic National Committee, achieving such recognition at the 2012 Democratic National Convention. He also sought to ensure the party ran a gubernatorial candidate in the 2014 election, after it failed to do so in 2009. He resigned on January 1, 2014, and was succeeded in the interim by Jesus Borja (who had been acting chair before Manibusan's election) and permanently by Benjamin M. Cepeda in February 2014. Cepeda then resigned on May 19, 2014 to join Juan Babauta's 2014 election independent campaign slate, with Rosiky Camacho initially becoming acting chair until he permanently held the post.\nAttorney General\nThe Attorney General, previously an appointed position, became an elected position effective for the 2014 general election. Manibusan was elected in 2014, defeating attorney Michael Evangelista by about a two to one margin. Manibusan succeeded Gilbert Birnbrich, who was appointed by Governor Eloy Inos five months before the election. He was reelected in 2018, without opposition. In 2022, Manibusan defeated former judge Juan Tudela Lizama by approximately ten points to be reelected Attorney General.\nElectoral history\n}}\n}}\n}}\nReferences\nExternal links\n*[http://www.naag.org/naag/attorneys-general/whos-my-ag/northern_mariana_islands/edward-manibusan.php Official Biography] at the National Association of Attorneys General\n|-\n|-"
    }
  ]
}