{
  "content": [
    {
      "type": "text",
      "text": "# Edward E. Rice\n\n|birth_place       = Brighton, Massachusetts, U.S.\n|death_date        =\n|death_place       = New York City, U.S.\n}}\nEdward Everett Rice (December 21, 1847 – November 16, 1924) was an American musical theatre composer and producer active during the late 19th and early 20th centuries, known as a pioneer of American musical theatre, who introduced to Broadway Clorindy, a musical by African-American writers with African-American performers.\nBiography\nRice was born in Brighton, Massachusetts to Edmund Rice and Martha A. Rice, née Fletcher. His father gained wealth in the wholesale meat business and provided a superior education for his sons, two of whom fought in the U.S. Civil War. He arranged a private music tutor for the eight-year-old Edward; after a year's tuition, the boy could not read music but could improvise fluently, playing by ear. Some years later, his father offered to send him to Europe for another attempt at a musical education, but B. J. Lang, a leading Boston organist, advised against it, saying the world wants songs, not more sonatas.\nSheet music cover for the song \"Darktown Is Out Tonight\", from Rice's Clorindy (1898)\nRice was first employed in printing and publishing, and for a while managed a newspaper. By the 1870s he was amanuensis for James Alexander, Boston agent for the Cunard Steamship Company, and was a member of Boston's Papyrus Club. In one version of how he began composing for musical comedy, he and  J. Cheever Goodwin saw the Lydia Thompson production of Farnie and Reece's burlesque Oxygen, and agreed that they could do better. In another version, he saw the English production of The Black Crook and became interested in creating an American musical. In 1874 Rice and Goodwin created an extravaganza, Evangeline; or, The Belle of Acadia, a musical burlesque of Henry Wadsworth Longfellow's Evangeline, that became the first American production billed as a musical comedy. Rice composed the music for more than eighteen productions that appeared on Broadway, including Hiawatha and Summer Nights, that toured the country. Rice had no formal musical education and he could not read sheet music, but he played by ear on the piano. His method of composition would be to \"dictate\" to a scribe tunes that he would play on the piano, and he would make suggestions for orchestration.\nAs a producer, Rice introduced popular performers Pauline Hall, Lillian Russell, and Fay Templeton, and in 1898, he booked Clorindy, or The Origin of the Cake Walk by Will Marion Cook and Paul Laurence Dunbar, one of the earliest musicals by African Americans and the first to appear on Broadway at the prestigious Casino Theatre. Rice's biggest hit was 1894's Adonis, which starred Henry Dixey, one of the most popular performers of the era. He produced the burlesque extravaganza musical 1492 Up to Date in 1893 in New York City. His final Broadway production was a 1904 revival of the British musical Mr. Wix of Wickham, with new songs by Jerome Kern.\nRice died at the age of 76 in New York City.\nGenealogy and family relations\nRice's first cousin Edmund Rice was a brigadier general and Medal of Honor awardee. Rice was a direct descendant of Edmund Rice, an English immigrant to Massachusetts Bay Colony.\nRice married Clara E. Rich, daughter of Isaac E. Rich, in 1869, and they had a daughter Carrie B. Rice (born 1870) and sons, Aubrey L. Rice (born 1876) and Anthony D. Rice (born 1876).\nReferences\n*\n*Kenrick, John. [http://www.musicals101.com/who7b.htm Who's Who in Musicals]\nNotes"
    }
  ]
}