{
  "content": [
    {
      "type": "text",
      "text": "# Edward P. Ferry House\n\n| locmapin = Michigan#USA\n| area = less than one acre\n| built =\n| architecture = Italianate\n| added = March 19, 1982\n| refnum = 82002860\n|designated_other1= Michigan State Historic Site\n}}\nThe Edward P. Ferry House is a private house located at 514 Lafayette Street in Grand Haven, Michigan. It was listed on the National Register of Historic Places in 1982.\nHistory\nThis house was constructed in 1871 or 1871-72 by or for Phillip Wooley, about whom little is known. However, Wooley apparently never lived in the house, as he sold it to Edward Payson Ferry in June 1872. Ferry was born in 1837 in Grand Haven, the son of Rev. William M. Ferry, who participated in the platting of Grand Haven and was one of its first settlers. William Ferry was involved in a range of Grand Haven enterprises, including stores, banking, shipping, shipbuilding, land speculation, and lumbering. William's sons, including Edward, were often partners in his ventures. Specifically, William and Edward Ferry partnered with George E. Dowling to found Ferry, Dowling & Co. This firm platted the nearby village of Montague, Michigan in 1865; the town became a bustling lumbering center in the 1870s.\nAfter the elder Ferry's death in 1867, Edward Ferry inherited shares in his father's businesses, including the lumbering business of Ferry & Son managed by Edward's brother (and later US Senator) Thomas W. Ferry. Edward Ferry continued as one of Grand Haven's most prominent businessmen through the 1870s and into the 1880s. In the mid-1880s, as the lumber business sagged, Ferry moved from this house to Wisconsin, and later to Park City, Utah to take up silver mining. Ferry sold the house in Grand Haven in 1885.\nDescription\nThe Edward P. Ferry House is a narrow-front two-story Italianate structure with a hip roof on a brick foundation. The exterior has fanciful, Italian-inspired detailing about the main cornice, the west-side bay window, and the doorway and window openings. These details were likely added by Ferry some time after the house was constructed. The windows have round heads, and the front entrance is a double door arrangement with large panels of frosted glass in each door.\nOn the interior, the first floor is a side hall plan, with a high-ceilinged stair hall in the corner. Off the side hall are a front parlor and a dining room. Both rooms have plaster ceilings with heavy molded cornices and a central rectangular panel and marble mantlepieces.\nReferences\nExternal links"
    }
  ]
}