{
  "content": [
    {
      "type": "text",
      "text": "# Edward Albert Palmer Memorial Chapel and Autry House\n\n| locmapin                       = Texas#USA\n| built                          = 1921\n| added                          = October 31, 1984\n| area                           = less than one acre\n| refnum                         = 84000388\n| designated_other1              = RTHL\n| designated_other1_date         = 1994\n| designated_other1_number       = [http://atlas.thc.texas.gov/Details/5201010599 10599]\n| designated_other1_num_position = bottom\n}}\nThe Edward Albert Palmer Memorial Chapel and Autry House is a two-part building complex located at Rice University in Houston, Texas. It houses the James L. Autry House, which was built in 1921 by the Episcopal Church as a community center for the university.\nA temporary community center was built on the location (at 6265 Main Blvd.) in 1919 by Rev. Harris Masterson, Jr., and replaced in 1921 with a permanent building designed by architects Cram & Ferguson and William Ward Watkin. Due to the lack of public gathering areas at Rice University before the opening of the Fondren Library in 1949, and aided by the cheap food served by the Autry House's cafeteria, it became the university's de facto community center for several decades. A student chapel was built next door in 1927, quickly expanding into a full-fledged church, Palmer Memorial Episcopal Church, in 1929.\nAs Rice University's campus added a number of community facilities in the 1940s and 1950s that rendered those at Autry House redundant, the house began outreach towards students and employees at the Texas Medical Center, and continued to operate a cafeteria. The house was renovated in the 1970s, and added an art gallery focusing on the work of student artists; in the 1980s, it was opened to a number of community groups, such as the Houston Youth Chorus and the American Cancer Society. The house was added to the National Register of Historic Places in 1984.\nIn 2001, the house was merged administratively and architecturally with Palmer Memorial Episcopal Church: a \"bridge building\" was built connecting the two buildings, and the church took over operation and maintenance of the house.\nThe house was listed on the National Register of Historic Places within \"Edward Albert Palmer Memorial Chapel and Autry House\" in 1984.  The listing included work designed by architects Ralph Adams Cram, William Ward Watkin, John Fanz Staub, and Pompeo Coppini.\nReferences"
    }
  ]
}