{
  "content": [
    {
      "type": "text",
      "text": "# Edward Hindle\n\nEdward Hindle FRS FRSE FIB FRGS FRPSG (21 March 1886&ndash;22 January 1973) was a British biologist and entomologist who was Regius Professor of Zoology at the University of Glasgow from 1935 to 1943. He specialised in the study of parasites.\nEarly years\nEdward Hindle was born in Sheffield on 21 March 1886 the son of Sarah Elizabeth Dewar and Edward James Hindle.\nHe was educated at home. From Bradford Technical College, now the University of Bradford, he obtained a scholarship in biology at the Royal College of Science in 1903. He was further educated at King's College London, and after research at the Liverpool School of Tropical Medicine, he gained a Ph.D at Berkeley University of California in 1910. Returning to England, he entered Magdalene College, Cambridge, becoming DSc in 1926.\nFirst World War and following years\nAlready a member of the Territorial Army, in 1914 he became a Second Lieutenant in the Royal Engineers. He served in France and Palestine until he was demobilised in Egypt in 1919.\nIn 1922, he was elected a Fellow of the Royal Society of Edinburgh. His proposers were James Hartley Ashworth, John Stephenson, Francis Marshall and George Leslie Purser. He served as the Society's Vice President from 1943 to 1946.\nAppointed Professor of Biology at Cairo University School of Medicine, in 1924 he returned to research in England at the London School of Hygiene and Tropical Medicine. From there in 1925 he joined and became leader of the expedition mounted by the Royal Society to China, returning in 1928 to research at the Wellcome Bureau of Scientific Research and then at the National Institute for Medical Research.\nGlasgow\nHindle was Regius Professor of Zoology at the University of Glasgow in succession to John Graham Kerr, and was curator of the Hunterian Museum from 1935 to 1943. During his time at the university, he encouraged research in genetics and freshwater biology. Among the talented scientists he invited to work in his department was Guido Pontecorvo, who returned to the university from internment as an enemy alien in 1942.\nIn 1938, Hindle had joined the university's Officers' Training Corps becoming a lieutenant colonel and its commanding officer. He also commanded a battalion of the Glasgow Home Guard.\nHe was a founder of the Zoological Society of Glasgow, which opened Calderpark Zoo after he had left the city.\nHe was elected a Fellow of the Royal Society in 1942\nRegent's Park\nIn 1943, he was appointed the first Scientific Director of the Zoological Society of London, a new post mainly concerned in organising all the scientific branches of the Society’s work as well as scientific problems concerning the animals at Regent’s Park Zoo and Whipsnade Zoo.\nRetirement and achievements\nHindle retired from Regent's Park Zoo in 1951, when he also gave up his post as General Secretary of the British Association for the Advancement of Science. Among many interests, he continued his work for the Royal Geographical Society, being Honorary Secretary from 1951 to 1961 and Honorary Vice-President in 1962.\nThe major achievements of his career were his work on leishmaniasis, on yellow fever and on spirochaetosis, all three arthropod-borne. A minor achievement was that every golden hamster in Europe and elsewhere descends from two pairs found in Syria that Saul Adler gave him in 1931.\nPersonal life\nIn 1919, he married Irene Margaret Twist (d.1933), first cousin of Sir John Graham Kerr. In 1936, he married the former Ellen Mary Theodora Schroeder. They separated in 1951. There were no children by either marriage.\nHindle died in a taxi in London on 22 January 1973.\nSources\n* P. C. C. Garnham, Edward Hindle 1886-1973, Biographical Memoirs of Fellows of the Royal Society, Vol. 20 (Dec., 1974), pp.&nbsp;217–234 https://www.jstor.org/stable/769639\n* [http://175heroes.bradfordcollege.ac.uk/edward_hindle.html Edward Hindle] at 175 Heroes\nReferences"
    }
  ]
}