{
  "content": [
    {
      "type": "text",
      "text": "# Edward A. Frieman\n\n| birth_place       = New York City, US\n| death_date        =\n| death_place       = La Jolla, California, US\n| fields            = Plasma physics\n| workplaces        = Los Alamos Laboratory, Scripps Institution of Oceanography\n| patrons           =\n| education         = Columbia University (B.S.)  Polytechnic Institute of Brooklyn (M.S., Ph.D.)\n| alma_mater        =\n| thesis_title      = The Proton-Proton Reaction and Energy Production in the Sun\n| thesis_url        =\n| thesis_year       = 1951\n| doctoral_advisor  = Lloyd Motz\n| academic_advisors =\n| doctoral_students = Charles Kennel\n| notable_students  =\n| known_for         =\n| influences        =\n| influenced        =\n| awards            =\n| author_abbrev_bot =\n| author_abbrev_zoo =\n| spouse            =\n| partner           =\n| children          =\n| signature         =\n| signature_alt     =\n| website           =\n| footnotes         =\n}}\nEdward Allan Frieman (January 19, 1926 – April 11, 2013) was an American physicist who worked on plasma physics and nuclear fusion. He was the director of the Scripps Institution of Oceanography from 1986 through 1996, and then the senior vice president of science and technology at the Science Applications International Corporation from 1996 on until his death in 2013.\nEarly life and career\nFrieman was born in New York in 1926. During World War II, he served as a deep-sea diving officer and was a participant in the atomic tests at Bikini Atoll. After the war, Columbia University granted him a bachelor's degree in engineering in 1946. He then received his master's and doctorate degrees in physics from the Polytechnic Institute of Brooklyn in 1948 and 1951 respectively.\nFrieman spent 25 years at Princeton University, becoming a professor of astrophysical science in 1961. It was during this period of time where he was noted to have advised Charles Kennel on his doctoral thesis.\nIn 1979, he was nominated by President Jimmy Carter to be the director of Office of Science within the United States Department of Energy. He served in the position from 1980 to 1981.\nIn 1981, he became an executive vice president of the Science Applications International Corporation, a high-tech company in La Jolla. In 1986, Frieman became the director of the Scripps Institution of Oceanography, a research institution at the University of California, San Diego. Frieman also served on the boards of the American University in Paris and the U.S.-Israel Binational Science Foundation.\nAwards and honors\nIn 1962, Frieman was elected a fellow of the American Physical Society (APS) and then inducted into the National Academy of Sciences in 1981. He was elected a member of the American Philosophical Society in 1990. In 2002, Frieman was awarded the James Clerk Maxwell Prize for Plasma Physics by APS.\nPersonal life\nFrieman is the father of theoretical astrophysicist Joshua A. Frieman.\nReferences\nExternal links\n* [https://www.aip.org/history-programs/niels-bohr-library/oral-histories/33688 Oral history interview transcript with Edward Frieman in 25 June 1986, American Institute of Physics, Niels Bohr Library & Archives]\n* [https://www.aip.org/history-programs/niels-bohr-library/oral-histories/40912-5 Oral history interview transcript with Edward Frieman in June 2004, American Institute of Physics, Niels Bohr Library & Archives]\n* Charles F. Kennel. [https://www.amphilsoc.org/sites/default/files/2017-07/attachments/Frieman.pdf Edward A. Frieman. Biographical Memoirs] // PROCEEDINGS OF THE AMERICAN PHILOSOPHICAL SOCIETY VOL. 160, NO. 3, SEPTEMBER 2016"
    }
  ]
}