{
  "content": [
    {
      "type": "text",
      "text": "# Edward MacCabe\n\nDublin, Ireland\n| nationality      = Irish\n| religion         = Roman Catholic\n| parents          =\n| previous_post    = Titular Bishop of Gadara and Auxiliary of Dublin (1877–1879)\n| education        =\n| alma_mater       = Maynooth College\n| motto            = Aut vincere aut mori\n| coat_of_arms     =\n}}\nEdward Cardinal MacCabe or McCabe (14 February 1816 – 11 February 1885) was the Roman Catholic Archbishop of Dublin from 1879 until his death and a Cardinal from 1882.\nBiography\nMacCabe's father was a poor shopkeeper. Edward was educated at Father Doyle's School, Arran Quay and in 1861 entered Maynooth College, and was ordained priest on 24 June 1839. After his ordination he served successively as curate in Clontarf and in 1853 as administrator at St Mary's Pro-Cathedral, Marlborough Street, in Dublin. He was selected, in 1854, for the see of Grahamstown in South Africa. He turned it down as he did not wish to leave Ireland, and in 1856 became parish priest of St. Nicholas Without, in Dublin.\nHe was transferred of the united more parish of Dún Laoghaire (then called Kingstown), Monkstown and Glasthule, from 1865 until 1879, and became a member of the chapter and vicar-general. For the twelve following years his was the ordinary life of a pastor. In 1877 he was appointed Titular bishop of Gadara and Auxiliary of Dublin, and on the death of Paul Cardinal Cullen, the incumbent Archbishop, he was chosen in 1879 to be Cullen's successor.\nThree years later, on 27 March 1882, Pope Leo XIII created him Cardinal-Priest of S. Sabina. His pastoral letter in October 1881 denounced in fierce terms the No Rent Manifesto of the Irish National Land League; thus his return from Rome with the \"red hat\" almost went un-noticed.\nThe six years in which he was Archbishop of Dublin were troubled times in Ireland, the years of the Land League and of the National League, of violent agitation and savage coercion, when secret societies were strong in Dublin, and the Phoenix Park Murders and many others of less note were committed. On Sunday 4 January 1880, a collection was made in aid of the distressed districts of Ireland at chapels in the Dublin Diocese, but like his predecessor, Cardinal McCabe came to have a distrust of popular movements. Brought up in the city, he was unacquainted with agrarian conditions and he identified with the political movement under Davitt. In pastorals and public speeches he ranged himself against agitation and on the side of government and law, with the result that Nationalist newspapers and public men attacked him as a \"Castle\" bishop, who favoured coercion and was an enemy of the people. His life was threatened and for a time he was under the protection of the police.\nMacCabe died at his home in Dun Laoghaire on 11 February 1885.\nHis papers are available in Dublin for consultation by scholars.\nReferences\nExternal links\n*[http://www.dublindiocese.ie/index.php?option=com_content&task=view&id=599&Itemid=292 Biography on the website of the Archdiocese of Dublin]\n*[http://paperspast.natlib.govt.nz/cgi-bin/paperspast?a=d&d=NZT18850220.2.13.2&l=mi&e=-------10--1----0-all Obituary in the New Zealand Herald]\n1885}}\n1885}}"
    }
  ]
}