{
  "content": [
    {
      "type": "text",
      "text": "# Edward Jurith\n\n|president    = Barack Obama\n|term_start   = January 20, 2009\n|term_end     = May 7, 2009\n|predecessor  = John Walters\n|successor    = Gil Kerlikowske\n|president1   = George W. Bush\n|term_start1  = January 20, 2001\n|term_end1    = December 7, 2001\n|predecessor1 = Barry McCaffrey\n|successor1   = John Walters\n|birth_date   =\n|birth_place  =\n|death_date   =\n|death_place  = Washington, D.C., U.S.\n|party        = Democratic\n|education    = American University Brooklyn Law School\n}}\nEdward Jurith (September 11, 1951 – November 9, 2013) served as acting director of the Office of National Drug Control Policy from January 20, 2001, to February 5, 2001.  He was appointed for this term by President Clinton in 2001, and was then appointed to be the acting director of the Office of National Drug Control Policy again in 2009 by President Obama. Since 1994, he also served as ONDCP's General Counsel, Senior Counsel and Director of Legislative Affairs.\nBackground\nJurith was born in Brooklyn, New York. He attended Bishop Loughlin Memorial High School in Brooklyn in New York City, graduated with honors from American University in 1973, and then received a Juris Doctor degree from Brooklyn Law School in 1976. He joined Lyon & Erlbaum in Kew Gardens, Queens, New York as an appellate trial attorney.\nCareer in government\nHis first government post was  counsel for Congressman Leo Zeferreti, chairman of the House Select Committee on Narcotics Abuse and Control, in 1982. According to the Daily News, \"Studies his office initiated on narcotics enforcement, such as bail reform and mandatory sentencing, resulted in reams of legislation, including the Anti-Drug Abuse Act of 1986, one of the bedrocks of our national drug policy.\" He was named staff director of that agency in 1987, joining the drug control policy office as director of legislative affairs in 1993. The Washington Post in 1993 called him \"a widely respected drug expert.\" He was instrumental in developing the Anti-Drug Abuse Acts of 1986 and 1988.\nHe subsequently became General Counsel to the Office of National Drug Control Policy.\nTeaching\nIn 2010, he became an adjunct professor at the American University Washington College of Law. He taught a seminar about the intersection of law and drug policy. From the first year that he taught to the second, his enrollment increased from seven students to capacity with a waiting list.\nFamily\nHe died of cancer in his home in North-West Washington  on November 9, 2013. Mr. Jurith is survived by his wife, Kathleen Healy, and his sons Theodore and William.\nReferences\n|years=2001}}\n|-\n|years=2009}}"
    }
  ]
}