{
  "content": [
    {
      "type": "text",
      "text": "# Edward W. Saunders\n\nEdward Saunders}}\n|birth_place  = Franklin County, Virginia, US\n|death_date   =\n|death_place  = Rocky Mount, Virginia, US\n|religion     =\n|signature    =\n|alma_mater   = University of Virginia\n|spouse       =\n|profession = lawyer, politician, judge\n}}\nEdward Watts Saunders (October 20, 1860 – December 16, 1921) was a Virginia lawyer, politician and judge, who served as Speaker of the Virginia House of Delegates, U.S. Representative and justice of the Supreme Court of Virginia.\nBiography\nSaunders was born in Franklin County, Virginia.  His primary education was received from tutors at home and at Bellevue Academy in Bedford County.  From the Academy, he entered the University of Virginia.  After graduation, he joined Professor F.P. Brent in conducting a classical school at Onancock, in Accomack County.  Returning to the University in the fall of 1881, he became a member of the law class taught by Professor John B. Minor and received his Bachelor of Law degree in 1882.  That same year, he opened an office in Rocky Mount, Virginia.  In 1887, he was elected to the Virginia House of Delegates and served there for seven terms, including two years (1899–1901) as Speaker. In 1901 he was elected Judge of the Fourth Judicial Circuit.  When the circuits in Virginia were reorganized, as ordered by the Constitution of 1902, he became Judge of the Seventh Judicial Circuit.  While serving in that capacity, he was elected to fill a vacancy in the United States Congress, where he remained for thirteen years.  In 1920, he was elected to the Supreme Court of Appeals of Virginia.  Judge Saunders served less than two years on this court before he died at his home in Rocky Mount, during the vacation of the court.\nElectoral history\n*1906; Saunders was elected to the U.S. House of Representatives with 50.88% of the vote in a special election, defeating Republican John W. Simmons; he concurrently was elected in the general election unopposed.\n*1908; Saunders was re-elected with 50.28% of the vote, defeating Republican John M. Parsons and Independent E. Matthews.\n*1910; Saunders was re-elected with 50.35% of the vote, defeating Republican Parsons, Independent John B. Anglin, and Socialist Bruce Anderson.\n*1912; Saunders was re-elected with 62.05% of the vote, defeating Republican A.B. Hamner and Independent J. Celphas Shelton.\n*1914; Saunders was re-elected with 65.47% of the vote, defeating Republican Charles A. Hermans, Independent William A. Fulton, and Socialist W.R. Keele.\n*1916; Saunders was re-elected unopposed.\n*1918; Saunders was re-elected unopposed.\nReferences\nExternal links\n*\n*[http://vavh.iath.virginia.edu/php/bio.php?pid=6579 Edward W. Saunders]  at The Virginia Elections and State Elected Officials Database Project, 1776-2007"
    }
  ]
}