{
  "content": [
    {
      "type": "text",
      "text": "# Edward Buckland\n\n|         birth_place = Laleham, Middlesex, England\n|          death_date =\n|         death_place = Winchester, Hampshire, England\n|            heightft =\n|          heightinch =\n|             batting = Right-handed\n|             bowling = Right-arm off breakRight-arm underarm fast\n|              family = Francis Buckland (brother)\n|               club1 = Oxford University\n|               year1 =\n|               club2 = Marylebone Cricket Club\n|               year2 = 1885\n|               club3 = Middlesex\n|               year3 =\n|               club4 = Hampshire\n|               year4 = 1895\n|             columns = 1\n|             column1 = First-class\n|            matches1 = 48\n|               runs1 = 1,414\n|            bat avg1 = 18.12\n|           100s/50s1 = 1/6\n|          top score1 = 148\n|         deliveries1 = 5,886\n|            wickets1 = 110\n|           bowl avg1 = 19.62\n|            fivefor1 = 8\n|             tenfor1 = 1\n|       best bowling1 = 7/17\n|  catches/stumpings1 = 54/–\n|                date = 17 February\n|                year = 2010\n|              source = http://www.cricinfo.com/ci/content/player/9281.html Cricinfo\n}}\nEdward Hastings Buckland (20 June 1864 — 10 February 1906) was an English first-class cricketer and educator.\nThe youngest son of The Reverend Matthew Buckland, he was born at Laleham in June 1864. He was educated at Marlborough College, where he gained a good reputation as a schoolboy cricketer. From there, he matriculated to New College, Oxford, where he studied jurisprudence. As a member of the Oxford University Cricket Club he made his debut in first-class cricket for Oxford against Lancashire at Oxford in 1884. He played first-class cricket for the university until 1887, making 27 appearances. Buckland was largely instrumental in Oxford's 1886 and 1887 victories over Cambridge University in The University Match. Considered an all-rounder, he scored 739 runs at an average of 17.18 for Oxford, with three half centuries and one century; this century, a score of 148 came against Surrey in 1887, which helped Oxford to a victory over their county opponents. As a bowler took 45 wickets Oxford at a bowling average of 20.88; he took three five wicket hauls, with best figures of 7 for 17. His best bowling performance for Oxford arguably came against Cambridge in the 1886 University Match, taking 5 for 14 from 20.1 overs. At Oxford, Buckland also played first-class cricket for a number of other teams. In 1885, he played once for the MCC against Lancashire and played four times for Middlesex in 1885 and once in 1887. He also toured North America with Ned Sanders' personal team, making two first-class appearances on the tour against the Gentlemen of Philadelphia in the winter of 1886. The tour was a success for Buckland, with him taking 21 wickets at an average of 10.14. In 1887, he played twice for the Gentlemen in the Gentlemen v Players fixtures at Lord's and The Oval.\nAfter graduating from Oxford with a third-class degree, Buckland gained employment in an office in London for a short time. He continued to play first-class cricket after leaving Oxford. He played four further matches for Middlesex in 1888, bringing his total for the county to nine matches. In these, he scored 254 runs and took 27 wickets at an average of 18.51. In 1888, he also played for the Gentlemen of England and an Oxford University Past and Present team against the touring Australians, and for Charles Thornton's personal team against Cambridge University. It was in 1888 that he accepted the post of assistant-master at Winchester College. Before his appointment at Winchester, the college cricket team had performed badly and under Buckland's guidance, its performance greatly improved, with The Times suggesting he may have gained a reputation akin to R. A. H. Mitchell had it not been for his future ill-health. Following the death of The Reverend C. H. Hawkins in 1900, Buckland succeeded him as a housemaster. While teaching at Winchester, he played first-class cricket for Hampshire in the 1895 County Championship, making four appearances in August. These final matches took his total first-class appearances to 48. In these, he scored 1,414 runs at an average of 18.12, while as a bowler he took 110 wickets at a bowling average of 19.62, taking eight five wicket hauls and ten-wickets in a match once. In his final years he suffered from a \"long and most trying illness\", to which he succumbed to at Winchester in February 1906. His brother, Francis, was also a first-class cricketer.\nReferences\nExternal links\n*"
    }
  ]
}