{
  "content": [
    {
      "type": "text",
      "text": "# Edward Duffield Neill\n\n|native_name      =\n|native_name_lang =\n|birth_name       =\n|other_name       =\n|nickname         =\n|birth_date       =\n|birth_place      =\n|death_date       =\n|death_place      =\n|placeofburial    =\n|placeofburial_label =\n|placeofburial_coordinates =\n|allegiance       =\n|branch           =\n|branch_label     =\n|serviceyears     =1861–1863\n|serviceyears_label =\n|rank             =\n|rank_label       =\n|servicenumber    =\n|unit             =1st Minnesota Volunteers\n|commands         =\n|known_for        =\n|battles          =American Civil War\n|battles_label    =\n|awards           =\n|memorials        =\n|alma_mater       =\n|spouse           =\n|children         =\n|relations        =\n|laterwork        =\n|signature        =\n|signature_size   =\n|signature_alt    =\n|module           =\n}}\nEdward Duffield Neill (1823 – 1893) was an American author and educator.\nNeill was born in Philadelphia. After studying at the University of Pennsylvania for some time, he enrolled at Amherst College and graduated from Amherst in 1842, then studied theology at Andover.\nAfter ordination as a Presbyterian minister, he moved to St. Paul, Minnesota, in 1848 where he became pastor of the First Presbyterian church. He also worked as Superintendent of Public Instruction for the Minnesota Territory in 1851–53, and served as chancellor of the University of Minnesota from 1858 to 1861.\nDuring the Civil War he served in the army as a regimental chaplain with the 1st Minnesota Volunteers from 1861 to 1862 and as a hospital chaplain from 1862 to 1863.  He worked for Presidents Lincoln and Johnson, who in 1869 nominated him United States Commissioner of Education to replace Henry Barnard, however, President Grant appointed him Consul to Dublin in 1869.\nHe returned to the United States in 1870, and served as the president of Macalester College in St. Paul in 1873–74, thenceforth as professor of history and literature.\nHe wrote many historical books, mostly of the Colonial period.\nPartial bibliography\n* History of Minnesota (1858; fifth edition, 1883)\n* Terra Mariœ (1867), a history of early Maryland\n* History of the Virginia Company of London (1869)\n* English Colonization of America during the Seventeenth Century (1871)\n* Minnesota Explorers and Pioneers (1881)\n* Virginia Vetusta (1885)\n* Virginia Carolorum (1886)\nReferences"
    }
  ]
}