{
  "content": [
    {
      "type": "text",
      "text": "# Edward Wormald\n\n|         death_place = Brighton, Sussex\n|              family =\n|             batting = Right-handed\n|             bowling = Right-arm fast\n|               club1 = Kent\n|               year1 = 1870\n|             columns = 1\n|             column1 = First-class\n|            matches1 = 1\n|               runs1 = 16\n|            bat avg1 = 8.00\n|           100s/50s1 = 0/0\n|          top score1 = 15*\n|         deliveries1 = 24\n|            wickets1 = 0\n|           bowl avg1 = –\n|            fivefor1 = –\n|             tenfor1 = –\n|       best bowling1 = –\n|  catches/stumpings1 = 1/–\n|                date = 29 August\n|                year = 2014\n|              source = http://www.espncricinfo.com/ci/content/player/23191.html Cricinfo\n}}\nEdward Wormald (4 December 1848 &ndash; 16 October 1928) was an English businessman and cricketer who played a single first-class cricket match in 1870 for Kent County Cricket Club.\nWormald was born at Islington in Middlesex in 1848, the son of banker John Wormald and his wife Caroline (née Jeafferson). He was educated at Eton College where he played cricket for the school, including in 1867 in the Eton v Harrow match at Lord's. After going up to Trinity College, Cambridge later in the year he played some cricket at university, although not making the University side.\nMost of Wormald's club cricket was played for Eton Ramblers. Described in the 1907 History of Kent Cricket as \"a straight but short bowler, a free hitter and a beautiful thrower\", he made a single appearance for the Kent county side, playing against the Gentlemen of the Marylebone Cricket Club during the 1870 Canterbury Cricket Week, making scores of 1 and 15 runs in his two innings. He had appeared at The Week in 1867, playing a non-first-class match for the Gentlemen of Kent amateur side against I Zingari and played in the same fixture in 1870, taking three wickets.\nWormald married Annette Hood, the oldest daughter of William Charles Hood, at Croydon in 1872. The couple lived at 15 Berkley Square in central London and had three daughters. Wormald was a partner in Charles Skipper and East, a firm of printers in London. Annette died in 1925 and Wormald, a wealthy man who left at estate valued at more than £500,000, died at Brighton, Sussex in 1928 aged 79.\nReferences\nExternal links\n*"
    }
  ]
}