{
  "content": [
    {
      "type": "text",
      "text": "# Edward Douglass White House\n\n| locmapin = Louisiana#USA\n| area =\n| built = 1790\n| architect =\n| architecture =\n| designated_nrhp_type = December 8, 1976\n| added = December 8, 1976\n| refnum = 76000964\n}}\nThe Edward Douglass White House, also known as Edward Douglass White Louisiana State Commemorative Area, is a state historic site near Thibodaux, Louisiana. The house was home to both Edward Douglass White, Sr., the tenth governor of the state of Louisiana, and his son, Edward Douglass White, a U.S. senator and a Chief Justice of the United States.  It was designated a National Historic Landmark in 1976 for its association with the latter White, who was in the 7-1 majority ruling on Plessy v. Ferguson, 163 U.S. 537 (1896), a landmark decision of the U.S. Supreme Court that upheld the constitutionality of racial segregation laws for public facilities in a doctrine that came to be known as \"separate but equal.\"\nHistory\nThe house was built from hand-hewn cypress as a Creole-style raised cottage. The house was built on the banks of Bayou Lafourche facing what is now Louisiana Highway 1. E.D. White, Sr. purchased the property in 1829 from Guillaume Arcement, and around 1834 began remodeling the house to reflect the prevalent Greek Revival style of architecture. It was declared a National Historic Landmark in 1976.\nArchitecture\nThe main floor includes a central hallway dividing four rooms, reflecting the typical symmetry of Greek Revival architecture. An inverted stairwell at the end of the hall leads to two bedrooms on the second floor. The high ceilings, wide front gallery, and raised brick cellar served to cool the house during the summer.\nMuseum\nThe house is owned by the Louisiana State Museum and is operated as a historic house museum known as the E. D. White Historic Site. An exhibit inside the home demonstrates the history of the Bayou Lafourche area, with features on the Chitimacha Indians, Acadian settlers, slavery, sugar cane plantations, and the White family.\nSee also\n*List of National Historic Landmarks in Louisiana\n*National Register of Historic Places listings in Lafourche Parish, Louisiana\nReferences\nExternal links\n*[http://louisianastatemuseum.org/museums/ed-white-historic-site/ E. D. White Historic Site]  - Louisiana State Museum"
    }
  ]
}