{
  "content": [
    {
      "type": "text",
      "text": "# Edward Tregear\n\n| image       = Edward Robert Tregear.png\n| alt         = Edward Robert Tregear\n| caption     = Edward Robert Tregear\n| office      = Wellington City Councillor\n| term_start  = 1912\n| term_end    = 1915\n| predecessor =  David McLaren\n| office2     =  1st President of the Social Democratic Party\n| term_start2 =  1913\n| term_end2   =  1914\n| vicepresident2 =  Frederick Cooke\n| predecessor2 =\n| successor2 =  Hiram Hunter\n| other_names =\n| birth_date  =\n| death_date  =\n| birth_place = Southampton, England\n| death_place = Picton, New Zealand\n| party       = Social Democratic (1913–16)Labour (1916–31)\n| occupation  = Engineer\n| spouse      = Bessie Tregear\n| children    = 1\n|nickname     =\n|allegiance   = New Zealand Army\n|branch       =\n|serviceyears = 1867–69\n|rank         =  Captain\n|unit         =\n|commands     =\n|battles      = New Zealand Wars\n|awards       = Officier of the Ordre des Palmes AcadémiquesImperial Service OrderNew Zealand Medal\n}}\nEdward Robert Tregear , Ordre des Palmes académiques (1 May 1846 – 28 October 1931) was a New Zealand public servant and scholar. He was an architect of New Zealand's advanced social reforms and progressive labour legislation during the 1890s.\nBiography\nHe was born in Southampton, England, on 1 May 1846, the son of Captain William Henry Tregear, a descendant of an old Cornish family. Tregear was educated in private schools and trained as a civil engineer. He arrived in Auckland in June 1863 and took a position as a surveyor. This work brought him into close contact with the Māori, and he began to study their language and culture. Poverty forced Tregear to enlist in the Auckland Engineer Volunteers. He saw action against the Māori in the Tauranga area and was awarded the New Zealand War Medal. Between 1869 and 1873 he worked as a surveyor on the goldfields at Thames and Coromandel and on Māori lands near Tokoroa. His investments in gold mining and saw milling ventures proved disastrous, and he lost what little money he had, setting a pattern for the rest of his life in financial matters. In 1877 he moved to Patea, working privately until 1881 as a surveyor for roads boards. He also captained the Patea Rifle Volunteers.\nHis research on comparative mythology and linguistics was expressed in a controversial book The Aryan Maori (1885), in which he placed the Māori language in the ranks of the Indo-European language family and further claimed, interpreting racial rather than linguistic aspects of the theories of Friedrich Max Muller, that Māori were descended from Hindu Brahmins who spread south, from India; he argued therefore that Māori had the same Indo-Iranian origins as Europeans. While this 'Aryan Māori' theory was hotly contested in New Zealand it received favourable attention overseas. Tregear frequently contributed articles on Māori anthropology to scholarly British journals, received fellowships of the Royal Geographical Society and the Royal Historical Society. Following on the heels of these fellowships, in 1893 he received a silver medal and an offer of a fellowship from the Society of Science, Letters and Art, which he wisely refused, a refusal that triggered an exposé in New Zealand, which proved the institution to be without authenticity. Tregear was to repeat and refine his theory of the Aryan origin of Māori in many works during the succeeding two decades.\nA freethinking socialist, Tregear was a personal friend of the politicians Ballance and Reeves. When the Liberal Party took office in 1891, he was named head of the new Bureau of Industries, later known as the Department of Labour. Working closely with Reeves as Minister, Tregear was responsible for the huge amount of progressive labour legislation passed in the 1890s. He was editor of the Journal of the Department of Labour.\nIn 1891 Tregear published the Maori-Polynesian Comparative Dictionary which is regarded as his most important contribution to scholarship. In 1892 he co-founded the Polynesian Society with Percy Smith, with whom he co-edited the journal of the society. The French Government took official cognisance of the great amount of work devoted to the dialects of the Pacific Islands under the control of France, and he received the high honour of Officier of the Ordre des Palmes Académiques. He completed a substantial work, The Maori Race in 1904. Following his retirement as Secretary of Labour in 1910, he was honoured with the Imperial Service Order.\nTregear never stood for Parliament, despite Ballance's urgings. In a 1912 by-election, he was elected to the Wellington City Council (re-elected 1913) and became president of the militant Social Democratic Party. However, in 1914, afflicted with failing eyesight and gravely troubled and disheartened by the failure of the waterfront strike, Tregear suddenly resigned all his offices. He retired to Picton in the South Island where he died on 28 October 1931. He was survived by his wife Bessie and their only daughter Vera.\nContribution\nTregear is regarded as an architect of the advanced social reforms which drew the world's attention to New Zealand. He was a prolific writer in a range of creative writing genres including poetry, satire and children's fairy stories, besides scholarly papers of anthropology and sociology. While his theory on the origins of the Māori people has been proved incorrect, his linguistic work has proven to be more durable. He was an engaged thinker. \"Tregear was among the country's most prominent, prolific and controversial intellectuals. Besides Polynesian studies, he produced journal and newspaper articles and public lectures on religion, philology, mythology, literature, science, economics, women, philosophy, ancient history, politics – indeed almost the entire spectrum of human history and experience\" (Howe 2006).\nMount Tregear in the Southern Alps is named after him in close proximity to peaks named after other Liberal Party figures Notman, Ballance and Stout.\nTregear's documentation of Moriori Census on the Chatham Islands as of 1889 is essential even today for the preservation of this unique culture: [Read before the Wellington Philosophical Society, 4 December 1889.] on the Moriori of the Chatham Islands:\nBy Edward Tregear, F.R.G.S.\n\"Thinking that, as the Moriori are rapidly dying out, scientists at the end of the next half-century might be interested in knowing what was the exact state of the native population in 1889, I made a census-inquiry, with the following result:—\nChatham Islands, 23 September 1889.\nAt Manukau.\nMen: Hiriona Tapu, Tiritiu Hokokaranga, Heta Namu (half-caste, Maori and Moriori), Horomona te Rangitapua, Apieta Tume, Te Karaka Kahukura, Te Ohepa nga Mapu (half-caste, Maori and Moriori).\nWomen: Rohana Tapu, Paranihi Heta, Pakura te Retiu, Himaira Horomana, Harireta te Hohepa, Ruiha te Hira (half-caste, Maori and Moriori).\nChildren: Tame Horomana (boy), Mika Heta (boy), Ngana Riwai (girl).\nAt Kaingaroa.\nMen: Hoani Whaiti Ruea, Te Ropiha Rangikeno (an old man), Riwai te Ropiha, Tamihana Heta.\nWomen: Eripeta Hoani Whaiti, Kiti Rīwai (a quarter-caste pakeha—i.e., child of pakeha and half-caste woman), Emiri Parata (half Maori, half Moriori).\nAt Waitangi.\nMen: Pumipi te Rangaranga (a very old man), Heremaia Tau, Wi Hoeta Taitua, Te Teira Pewha, Timoti Wetini, Taitua Hangi, Temuera Numi.\nWomen: Hipera te Teira, Paranihi Taitua, Ereni Timoti (or E Puti) (half-caste, Maori and Moriori).\nMaking twenty-seven of pure Moriori descent, and five half-breeds. The Maoris on the islands number about two hundred and fifty souls, and there is roughly about the same number of a white population.\"\nList of honours\n* Imperial Service Order (United Kingdom)\n* Officier of the Ordre des Palmes Académiques (France)\nNotes\nReferences\n* (1966): Tregear, Edward, I.S.O. (1846–1931). In: : Encyclopaedia of New Zealand III: 446–447. Government Printer, Wellington.\n* (1991): Singer in a Songless Land: a life of Edward Tregear, 1846–1931, Auckland University Press\n* (1934): [https://nzetc.victoria.ac.nz/tm/scholarly/tei-Gov09_01Rail-t1-body-d7.html/ \"Famous New Zealanders, No. 13, Edward Tregear – Pioneer, Scholar, Humanitarian\"]: The New Zealand Railways Magazine; Volume 9, Issue 1 (2 April 1934).\nFurther reading\n*  (1891): [https://nzetc.victoria.ac.nz/tm/scholarly/metadata-tei-TreMaor.html Maori-Polynesian Comparative Dictionary]. Lyon and Blair, Wellington. Online version 2005-FEB-16.\n*"
    }
  ]
}