{
  "content": [
    {
      "type": "text",
      "text": "# Edward Kern\n\nor 1823\n| birth_place        = Philadelphia, Pennsylvania\n| death_date         =\n| death_place        = Philadelphia, Pennsylvania\n| burial_place       = New Glenwood Cemetery, Broomall, Philadelphia\n| nationality        = American\n| citizenship        =\n| occupation         = Explorer, artist, cartographer, topographer, and United States Army officer\n| known_for          = Exploring, documenting and imaging the American West\n| spouse             =\n| signature          =\n| signature_size     =\n| module             =\n| branch= United States Army\n| serviceyears=\n| rank= Lieutenant\n| commands= Sutter's Fort\n| awards=\n| laterwork=\n| embed = yes\n}}\n}}\nEdward Meyer Kern (October 26, 1822 or 1823 – November 25, 1863) was an American artist, topographer, and explorer of California, the Southwestern United States, and East Asia. He is the namesake of the Kern River and Kern County, California.\nEarly life\nKern was born in Philadelphia, the son of John Kern III and Mary Elizabeth Bignell. He was trained as an artist. His brother Richard Kern (1821–1853) was also an accomplished artist, and his brother Benjamin Kern (1818–1849) was a doctor. They joined him on several expeditions.\nExpeditions\nCalifornia\nIn 1845–46, Kern accompanied explorer Captain John C. Frémont on his Third Expedition into Mexican Alta California. Kern received a daily salary of $3.00. He served as a cartographer as well as a documentation artist, collecting botanical and animal specimens on the journey. Each night of the trip Kern drew a field map of the day's route with longitudes and latitudes, and sketched landmarks.\nJust before they reached Klamath Lake, Klamath tribesmen attacked the expedition and several members were killed. A brutal counterattack by Frémont and his group upon a native village resulted in the deaths of many Klamath people. Kern recorded the counterattack in an engraving that was later published with Frémont's report.\nFrémont then ordered his main party&nbsp;– which included Kern and Joseph Walker&nbsp;– to travel the southern Sierra route over the pass Walker had discovered a decade earlier, while Frémont and a few others crossed the northern Sierra at Donner Pass. Frémont named the pass through which Walker led the party Walker Pass. Kern mapped the Kern River, which at the time was known as the Rio de San Felipe, as named by the Spanish. Later, Frémont named the river after his artist. Kern's campsite in the Kern River Valley, at the junction of the South and North Forks of the Kern River, now lies submerged by Lake Isabella. A historical monument for Kern's site was placed above the reservoir near its eastern shore on Highway 178.\nDuring the 1846 Bear Flag Revolt against Mexico, Frémont placed the 23-year-old Kern in command of Sutter's Fort and its company of dragoons in the Sacramento Valley. That left John Sutter the assignment as lieutenant of the dragoons, and second-in-command of his own fort, until 1847.\nWhile in command there, news of the stranded Donner Party reached Kern, as Sutter's Fort had been their destination.[https://archive.org/details/desperatepassage00etha/page/165   Internet Archive: \"Desperate Passage: The Donner Party's Perilous Journey West\"], by Ethan Rarick, pg. 165. Kern vaguely promised the federal government would do something for a rescue party across the Sierra, but had no authority to pay anyone. He was later criticized for his mismanagement delaying the search.\nIn February 1847, Kern's forces were requested by several settlers who wished to intimidate Indians who had been involved in raids. Kern brought in 20 men, joined by 30 more led by John Sutter, and then proceeded with a series of attacks that killed 20 California Indians in what became known as the Kern and Sutter massacres.\nSouthwest\nIn 1848−1849, Edward Kern and his brothers Richard and Benjamin joined Frémont's Fourth Expedition, to the Rocky Mountains in present-day southern Colorado and northern New Mexico. By the time the last surviving member of the expedition reached Taos on February 12, 1849, 10 of the party had died. To move more quickly to safety, it had been necessary for the brothers to hide their goods (including sketches) in a cave. After arriving in the New Mexico Territory, Benjamin Kern and Frémont's guide Old Bill Williams returned for the hidden goods but were killed by a band of Utes.\nIn August 1849, Edward and Richard Kern joined the John M. Washington military reconnaissance expedition to the Navajo in 1849, to punish the Navajo for raids on the New Mexico settlements and to secure a treaty with them, in addition to surveying the country. The expedition brought both brothers back to New Mexico. Richard's role, as second assistant and artist, was to make portraits of Indian chiefs, costume, scenery, geological formations, ruins, and to copy ancient writings found on stones. Edward's role was as first assistant and topographer.\nEdward and Richard stayed in New Mexico for two years, working for the Corps of Topographical Engineers. The Kern brothers gave the American public some of its earliest authentic images of the people and landscape of Arizona, New Mexico, and southern Colorado, with views of Canyon de Chelly, Chaco Canyon, and El Morro (Inscription Rock).\nIn 1853, Edward joined Lieutenant John Pope, who was seeking a better route between Santa Fe and Fort Leavenworth. His brother Richard was killed in 1853, while on the Gunnison–Beckwith Expedition to survey a railroad route that would pass through the Rocky Mountains.\nAsia\nLying Off Whampoa\"]]\nFrom 1853 to 1855, Edward Kern served on the ship USS Vincennes'' on an expedition to East Asia. The captain, Cadwalader Ringgold, was declared insane when they reached Hong Kong. Kern used both photography and drawing during this trip. The expedition landed on the eastern shores of Siberia, where Kern spent several weeks. It returned home via Tahiti and San Francisco.\nIn 1858, Kern joined Lieutenant John Mercer Brooke on a survey of the sea lanes between California and China, returning in 1860.\nCivil War\nDuring the American Civil War, Kern served under Frémont, who had command of the Army of the West, but when Frémont was relieved of command, Kern was as well.\nPersonal life\nKern suffered from epilepsy beginning at a young age. Late in life he established a studio in Philadelphia. He died in November 1863 of an epileptic seizure, at his home on 1305 Chestnut Street in Philadelphia. He was buried in Glenwood Cemetery, and later re-interred in New Glenwood Cemetery.\nLegacy\nKern's diaries were discovered under the floorboards in an old hotel in Delaware Water Gap, Pennsylvania, and provided source material for David Weber's book on his brother, Richard Kern. The diary and papers are now in the Beinecke Rare Book and Manuscript Library at Yale University.\nThe Boston Museum of Fine Arts holds more than eighty of Kern's works. The Kern River and Kern County, both in California, were named for him.\nCalifornia Historical Landmark\n}}\nAt the Entrance to Old IsabelIa Rd Recreation Area, at Lake Isabella, is a marker, Edward Kern Campsite, referring to Captain John C. Frémont's third expedition with Edward M. Kern. Old IsabelIa Road Recreation Area is on California State Route 178 on the south side of the lake.\nCalifornia Historical Landmark reads:\n:''NO. 742 CAMPSITE OF EDWARD M. KERN - Near this spot at the confluence of the north and south forks of the Kern River, the Theodore Talbot party of Captain John C. Frémont's third expedition to the West camped for several weeks during December 1845 and January 1846. Frémont named the river in honor of Edward M. Kern, topographer for the expedition - Kern County was established in 1866.\nSee also\n* California Historical Landmarks in Kern County\n*California Historical Landmark\nReferences\nBibliography\n* Edward Kern and American Expansion, by Robert V. Hine, Yale University Press, 1962\n* In the Shadow of Fremont: Edward Kern and the Art of American Exploration, 1845-1860, by Robert V. Hine, University of Oklahoma Press, 1982.\n* Indian Customs of California (Mar., 1853), in Archive of Aboriginal Knowledge, by Henry H. Schoolcraft (Philadelphia, 1865)\n* Journal of an Exploration of the Mary's or Humboldt River, Carson Lake, and Owens River and Lake, in 1845, Appendix Q, in Report of Explorations across the Territory of Utah in 1859, by J. H. Simpson (Washington, DC, 1859)\n* [https://web.archive.org/web/20080509073006/http://www.reeseco.com/papers/sources.htm \"Searching for New Sources in Western History\"]\nExternal links\n* [https://web.archive.org/web/20081224234804/http://www.siskiyous.edu/shasta/art/m40.htm Siskiyous.edu: Expedition Artists of the Frémont Expeditions: The Mid-1840s]\n* [http://www.ansp.org/research/library/archives/0100-0199/kern146/ Academy of Natural Sciences, Ewell Sale Stewart Library: \"Kern Drawings of the American Southwest\"] — gallery of 75 images''."
    }
  ]
}