{
  "content": [
    {
      "type": "text",
      "text": "# Edward Scott (died 1646)\n\n| death_date                = Before\n| resting_place             =\n| resting_place_coordinates =\n| occupation                =\n| known_for                 =\n| spouse                    =\n*\n*\n}}\n| children                  = with Alice:\n| parents                   =\n| relatives                 =\n| family                    =\n| alma_mater                = Hart Hall, Oxford\n}}\nSir Edward Scott (&nbsp;–&nbsp;before 12 January 1646) of Scot's Hall, Smeeth, Kent, was an English landowner, soldier and politician who sat in the House of Commons from 1626 to 1629. He was elected MP for the seat of Kent in 1626 and Hythe in 1628. He was made a Knight of the Bath at the coronation of Charles I.\nEarly life\n, Smeeth, Kent]]\nScott was the 5th surviving son of Sir Thomas Scott (d. 1594) of Scot's Hall, Smeeth, Kent and his 1st wife, Elizabeth Baker, daughter of Sir John Baker of Sissinghurst.\nHe matriculated at Hart Hall, Oxford on 25 October 1589, aged 11.\nHis father left him an annuity of only £30, but his marriage to Alice Stringer, a local heiress, in 1601, made him \"a man of substance\". He inherited Nettlestead Place and the Scot's Hall estate on the death of his brother, John, who died without issue in 1616.\nMarriages and issue\n]]\n, Kent, and his wife Elizabeth Scott]]\nHe married three times:\n* first: after 30 December 1600, Alice Stringer, daughter and coheir of William Stringer, of Bishopsbourne, Kent, by whom he had a son and a daughter:\n** Edward Scott (d. 1663), of Scot's Hall and Nettlestead, married Lady Catherine Goring, daughter of George Goring, 1st Earl of Norwich and Mary Nevill, daughter of Edward Nevill, 8th Baron Bergavenny.\n** Elizabeth Scott, married John Browne, son of Richard Browne of Shingleton, in Great Chart, Kent, with whom she had a son and a daughter:\n*** Richard Browne, married Elizabeth Andrews, daughter of Sir William Andrews, 1st Bt. and Anne Temple, daughter of Sir Thomas Temple, 1st Bt., by whom he had a daughter:\n**** Elizabeth Browne (d. 1678), who married Thomas Leigh, 2nd Baron Leigh of Stoneleigh in 1669.\n*** Margaret Browne.\n* second: after 26 August 1616, Katherine Honywood (bapt. 21 September 1578), daughter of John Honywood, of Elmsted, Kent, by whom  he had no issue.\n* third: after 25 July 1639, Mary Aldersey, daughter and coheir of John Aldersey, haberdasher, of London, widow of Thomas Westrowe, alderman and grocer, of Cornhill, London and of Sir Norton Knatchbull (d. 1636), of Mersham Hatch, Kent. By Mary he had no issue.\nCareer\nScott, like his ancestors, was a soldier by profession and was captain of a troop of horse in Kent.\nHe was appointed a commissioner for sewers in Kent and Sussex borders in 1604, Denge Marsh, Kent in 1604, Sussex 1617, Kent in 1620 and 1645, Sheerness in 1622; captain militia foot, Lathe of Shepway, Kent in 1605 until at least 1625.\nHe was Sheriff of Kent from 1619 to 1620 and a justice of the peace (JP) in Kent by 1613 to 1627, 1628 to 1636, 1644 to 1646.\nHe was appointed a commissioner for the subsidy, Kent in 1621 to 1622, 1624, 1641, piracy and Cinque Ports from 1625 to at least 1638, Forced Loan, Kent in 1626, for the repair of highways, Kent in 1631, Poll Tax in 1641, assessment 1643 to 1646, sequestration in 1643, levying money in 1643, defence, South-Eastern Association from 1643 to 1644, gaol delivery from 1644 to 1646, New Model Ordinance in 1645.\nIn 1625 he was again Sheriff of Kent. He was made a Knight of the Bath at the coronation of Charles I on 2 February 1626, and was elected MP for Kent in the same year. He was elected MP for Hythe in 1628 and sat until 1629 when King Charles decided to rule without parliament for eleven years.\nHe was made a freeman of Hythe in 1628 and was steward to Archbishop Abbot by 1631.\nOn 21 August 1645 he was appointed to the Kent sewer commission.\nDeath\nHe had died by 12 January 1646, when his will of 3 October 1641 was proved. In his will he requested to be buried at either Smeeth or Nettlestead, ″there to remain until the resurrection of all flesh″, and he left cash bequests amounting to more than £630, including £100 to his granddaughter, Margaret. The residue of his estate descended to his son, Edward. His widow died at the age of 89 in 1678, and there is a memorial dedicated to her in St Nicholas' Church, Berden.\nNotes\nReferences\n*\n*\n*}}\n*}}\n*\n*}}\n*\n*\nExternal links\n* [https://archive.org/details/memorialsoffamil00scot/page/209/mode/1up?view=theater Will of Sir Edward Scott]"
    }
  ]
}