{
  "content": [
    {
      "type": "text",
      "text": "# Edward Diethrich\n\nEdward \"Ted\" B. Diethrich, MD (August 6, 1935 – February 23, 2017), was an American cardiovascular surgeon, author, and innovator.\nHe was renowned for his contributions to the field of vascular surgery and for founding the Arizona Heart Hospital in Phoenix, Arizona.\nEarly life and education\nDiethrich was born in Hillsdale, Michigan, in 1935. He earned his undergraduate degree in 1956 and his medical degree in 1960 from the University of Michigan.\nHe completed his surgical residency at St. Joseph's Mercy Hospital in Ann Arbor, Michigan, and the Henry Ford Hospital in Detroit. Diethrich then pursued specialized training in thoracic and cardiovascular surgery at the Baylor College of Medicine in Houston, Texas, where he collaborated with renowned surgeon Michael DeBakey on the development of human heart transplantation.\nCareer\nAfter moving to Arizona, Diethrich founded the Arizona Heart Institute in 1971, the nation's first freestanding clinic solely devoted to cardiac and vascular diseases. The institute expanded to establish the nation's first outpatient cardiac catheterization laboratory in 1979 and the world's first school of cardiac ultrasound in 1982.\nIn 1998, Diethrich founded the Abrazo Arizona Heart Hospital and served as its medical director and Chief of Cardiovascular and Endovascular Surgery from 1998 to 2010. Notably, in 1996, he performed the first endovascular aneurysm repair (EVAR) for a ruptured abdominal aortic aneurysm. In 1997, Diethrich co-founded ENDOLOGIX, a company based on the stent graft research and patents of Myles Douglas, MD, a cardiovascular surgeon on the Arizona Heart Institute staff. That same year, he achieved another milestone by performing the first stent graft treatment of a thoracic aortic dissection.\nOver his career, Diethrich co-authored nearly 400 papers and trained over a thousand surgeons and specialists in cardiovascular and endovascular techniques. Many of his trainees went on to become leaders in vascular and cardiac surgery, including Venkatesh Ramaiah, who succeeded him in 2010 as medical director of Abrazo Arizona Heart.\nDiethrich gained national recognition for performing live televised surgeries, including operating on then-Senator Barry Goldwater in 1982.\nLater in life, Diethrich was diagnosed with glioma, a lethal form of brain tumor, attributed to his frequent exposure to radiation during medical procedures. He worked with the Organization for Occupational Radiation Safety in Interventional Fluoroscopy and became the focus of a documentary highlighting the harmful effects of radiation on the human body.\nOutside of medicine, Diethrich was one of the founding owners of the United States Football League (USFL). After an unsuccessful attempt to secure a team for Phoenix, he became the principal owner of the Chicago Blitz, coached by George Allen. Frustrated with low attendance despite the team’s success and wishing to devote more time to medical research, Diethrich sold the Blitz and purchased the Arizona Wranglers. He orchestrated an unusual exchange in which Allen and most of the Blitz’s NFL veteran roster moved to Phoenix, while the Wranglers’ players moved to Chicago. The new Wranglers reached the 1984 USFL title game, but continued poor attendance led Diethrich to sell his player contracts to the Oklahoma Outlaws, who relocated to Arizona as the Arizona Outlaws.\nRecognition\nDiethrich received numerous awards and honors throughout his career, including the Frederick A. Coller Award, the presidency of the Denton A. Cooley Cardiovascular Surgical Society, and the Medal for Innovation in Vascular Surgery from the Society for Vascular Surgery. In recognition of his profound impact on the field and his dedication to training future generations, his trainees established the Edward B. Diethrich Vascular Surgical Society in his honor.\nDeath\nIn his later years, Diethrich became a vocal advocate for raising awareness about the dangers of radiation exposure associated with his work as a cardiovascular surgeon. He highlighted the risks faced by medical professionals who regularly use fluoroscopy and other radiation-based technologies in their practice.\nDiethrich died in 2017 at the age of 81 due to complications from a brain tumor, which he attributed to his frequent exposure to radiation over the course of his career.\nReferences"
    }
  ]
}