{
  "content": [
    {
      "type": "text",
      "text": "# Edward Cakobau\n\n| birth_place = Bau, Fiji\n| death_date =\n| death_place = Suva, Fiji\n| office1 = Deputy Prime Minister of Fiji\n| primeminister1 = Kamisese Mara\n| term_start1 = 1972\n| term_end1 = 1973\n| successor1 = Penaia Ganilau\n| office2 = Member of the House of Representatives\n| term2 = 1972–1973\n| constituency2 = Suva East National (Fijian)\n| successor2 = Mosese Qionibaravi\n| term3 = 1966–1972\n| constituency3 = Central Cross-Voting (Fijian)\n| office4 = Minister for Commerce, Industry and Labour\n| term4 = 1967–1972\n| office5 = Member for Commerce, Industry and Tourism\n| term5 = 1966–1967\n| office6 = Nominated Member of the Legislative Council\n| term6 = 1944–1966\n| module =\n}}\nRatu Sir Edward Tuivanuavou Tugi Cakobau  (21 December 1908 – 25 June 1973) was a Fijian chief, soldier, politician and cricketer. He was a member of the Fijian legislature from 1944 until his death, also serving as Minister for Commerce, Industry and Labour and Deputy Prime Minister. During the 1940s he made two appearances for the Fiji national cricket team.\nBiography\nCakobau was born in December 1908, the son of King George Tupou II of Tonga and his mistress Adi Litia Cakobau, who was a granddaughter of Seru Epenisa Cakobau, the first King of Fiji. He was a half-brother of Queen Salote Tupou III of Tonga.\nHe was educated at Wanganui Technical College between 1923 and 1928, and then Auckland Technical College. Whilst in New Zealand, he played a single first-class match for Auckland in the 1930–31 Plunket Shield and later made two first-class appearances for Fiji in 1948 against Otago and Auckland. He later attended Wadham College, Oxford to study colonial administration.\nCakobau returned to Fiji and worked as a schoolteacher. He later became a civil servant, starting as a clerk in the Native Affairs Department and rising to become Deputy Secretary for Fijian Affairs. He was one of Fiji's representatives at the coronation of George VI in 1937. During World War II he served in the Solomon Islands, for which he was awarded the Military Cross. In 1944 he was appointed to the Legislative Council as one of the five nominated Fijian members. He later returned to military service during the Malayan Emergency, serving in Malaya in 1953 and 1954, during which he became commanding officer of the Fiji Battalion. He was awarded the OBE for his service in Malaya, and was given a CBE in the 1966 Birthday Honours.\nCakobau continued to be nominated to the Legislative Council until the 1966 elections, when he elected unopposed in the Fijian Central cross-voting constituency. Following the elections, he was appointed Member for Commerce, Industry and Tourism. In 1967 he became Minister for Commerce, Industry and Labour. He was knighted in the 1971 New Year Honours. In the 1972 elections he ran for the Fijian seat in the Suva East national constituency and was elected to the House of Representatives. He was subsequently appointed Deputy Prime Minister by Kamisese Mara.\nCakobau died on 25 June 1973, and was buried on Bau on 29 June. He had four sons; the eldest, Viliame Dreunimisimisi (1937–2000) was responsible for the first distillery in the South Pacific and served as Minister for Tourism and Agriculture. The second son, Epeli Nailatikau was also a politician, serving as Speaker of the House of Representatives and later President. His third son, Tu'uakitau Cokanauto was also a minister; the fourth son was Keni Vuiyasawa.\nSee also\n*List of Auckland representative cricketers\nReferences"
    }
  ]
}