{
  "content": [
    {
      "type": "text",
      "text": "# Edward A. Irvin\n\n| birth_place        = Curwensville, Pennsylvania, U.S.\n| death_date         =\n| death_place        = Curwensville, Pennsylvania, U.S.\n| resting_place      = Oak Hill CemeteryCurwensville, Pennsylvania, U.S.\n| party              = Republican\n| spouse             =\n| children           = 4\n| education          =\n| alma_mater         =\n| occupation         =\n| signature          =\n}}\nEdward Anderson Irvin (January 13, 1838 – October 13, 1908) was an American politician from Pennsylvania. He served as a member of the Pennsylvania Senate from 1905 to 1906.\nEarly life\nEdward Anderson Irvin was born on January 13, 1838, in Curwensville, Pennsylvania, to Jane (née Patton) and William Irvin. He attended common schools and the Mount Holly Academy and Edge Hill School, both in Princeton, New Jersey.\nCareer\nIrvin engaged in mercantile, coal and lumber businesses. He was commissioned as a captain at Camp Curtin in Harrisburg on May 29, 1861, with K Company of the 42nd Pennsylvania Regiment. He was wounded at the Battle of Antietam. He was captured at the Battle of Mechanicsville and was imprisoned at Andersonville Prison and Libby Prison for two months. He was exchanged and participated in the Second Battle of Bull Run. He succeeded Thomas L. Kane in command. Irvin was promoted to lieutenant colonel of the regiment on September 10, 1863. He was wounded in the head by a minie ball at the Battle of South Mountain on September 14, 1863. He was surgeon discharged on May 1, 1863, for wounds received in action.\nIrvin ran unsuccessfully for U.S. Senate in 1899. He was an organizer and president of the Citizens National Bank from 1903 to 1908. The bank would merge with Curwensville National Bank. He was elected as a Republican, to complete the unexpired term of A. E. Patton, to the Pennsylvania Senate and represented the 34th district from 1905 to 1906. He was a member of the corporations, education, forestry, military affairs, and new counties and county seats committees. He was chairman of the library committee.\nPersonal life\nIrvin married Emma A. Graham in 1860 or 1862, sources differ. They had four children, including Hugh and Elizabeth. His wife predeceased him. He was a member of the Presbyterian Church.\nIrvin died on October 13, 1908, at the family cottage in Atlantic City, New Jersey. He was interred at Oak Hill Cemetery in Curwensville.\nLegacy\nThe town of Irvona, Pennsylvania, was named in his honor. It was incorporated on September 2, 1890. Prior to his death, Irvin was president of the commission to memorialize his Civil War regiment with a monument. It was dedicated on April 27, 1908. He donated the land that would later become the black-granite Bucktail Monument on State Street in Curwensville in 2003.\nReferences\nExternal links\n*"
    }
  ]
}