{
  "content": [
    {
      "type": "text",
      "text": "# Edward Simpson (naval officer)\n\n|death_date   =\n|birth_place  = New York City, New York\n|death_place  = Washington, D.C.\n|placeofburial=\n|placeofburial_label= Place of burial\n|image        = Edward Simpson (naval officer).jpg\n|caption      =\n|nickname     =\n|allegiance   = United States of America\n|serviceyears = 1840–1886\n|rank         =  Rear admiral\n|branch       = United States Navy Union Navy\n|unit         = USS Passaic  USS Isonomia  President of the Naval Advisory Board  President of the Board of Inspection and Survey\n|battles      = Mexican–American WarAmerican Civil War\n|awards       =\n}}\nEdward Simpson (March 3, 1824 – December 1, 1888) served as an officer in the United States Navy during the Mexican–American War and the American Civil War, eventually attaining the rank of rear admiral. His service included being assigned as commanding officer of several Navy ships and serving with distinction in various shore assignments.\nEarly life\nEdward Simpson was born on March 3, 1824, in New York City, to parents Edmund and Elizabeth (Jones) Simpson, both actors.\nU.S. Navy career\nSimpson was appointed midshipman in the United States Navy in February 1840, shortly before his sixteenth birthday. He served afloat until late 1845, when he became a member of the first class of midshipmen to be trained at the new United States Naval Academy in Annapolis, Maryland.\nPre-Civil War service\nAfter graduation on July 9, 1846, Simpson reported to USS Vixen and participated in numerous bombardments during the Mexican–American War.\nDuring the next 15 years, he served afloat in the Brazil Squadron and the China Squadron and with the United States Coast Survey, and ashore in two tours at the U.S. Naval Academy, first as gunnery instructor, then in 1860 as head of the department of ordnance and gunnery.\nCivil War service\nIn May 1861, shortly after the outbreak of the American Civil War, Simpson moved with the Naval Academy to Newport, Rhode Island, where it was relocated for the duration of the war. In 1862 he became Commandant of Midshipmen.\nIn June 1863 he took command of the monitor, USS Passaic. He participated in bombardments at Charleston, South Carolina, from July to November 1863. From July to December 1864, he commanded Isonomia in the East Gulf Blockading Squadron; and, then served from February to April 1865 as Fleet Captain of the West Gulf Blockading Squadron and of the forces attacking Mobile, Alabama.\nPost-war activity\nAfter the war, he alternated tours of command ashore and afloat with tours of ordnance duty, including a mission to Europe in 1870–72, and command of the Naval Torpedo Station in 1873 and again from 1874 to 1875. As of 1880, he was the officer in charge of the naval station in New London, Connecticut. In 1883, he was appointed president of a board to select a site for a government gun factory and made another study trip to Europe.\nPromoted to rear admiral on February 9, 1884, he served as president of the Naval Advisory Board and president of the Board of Inspection and Survey until his retirement on March 3, 1886.\nPost-Navy career\nRear Admiral Simpson died in Washington, D.C., December 1, 1888, and was buried in Cypress Hills Cemetery. The destroyer USS Simpson (DD-221), commissioned on November 3, 1920, was named in his honor.  His son, Edward Simpson Jr., also became a rear admiral, and his daughter Ruth married Rear Admiral Charles Mitchell Thomas.\nPromotions\n* Midshipman – February 11, 1840\n* Passed midshipman – July 11, 1846\n* Master – July 10, 1854\n* Lieutenant – April 18, 1855\n* Lieutenant commander – July 16, 1862\n* Commander – March 3, 1865\n* Captain – August 15, 1870\n* Commodore – April 26, 1878\n* Rear admiral – February 9, 1884\n* Retired list – March 3, 1886\nSee also\n* Mexican–American War\n* American Civil War\n* Board of Inspection and Survey\n* [https://www.gutenberg.org/ebooks/73887 Modern ships of war] at Project Gutenberg\nReferences\n:"
    }
  ]
}