{
  "content": [
    {
      "type": "text",
      "text": "# Edward Beecher\n\n| birth_place = East Hampton, New York\n| death_date  =\n| death_place = Brooklyn, New York\n| occupation  = Theologian\n| spouse      = Isabella Jones\n| parents     = Lyman Beecher\n| children    = Eleven\n}}\nEdward Beecher (August 27, 1803 – July 28, 1895) was an American theologian, the son of Lyman Beecher and the brother of Harriet Beecher Stowe and Henry Ward Beecher.\nBiography\nBeecher was born August 27, 1803, in East Hampton, New York.  He graduated from Yale College in 1822.  After this, he studied theology at Andover Theological School.\nIn 1826, he became the pastor of Park Street Church in Boston, Massachusetts. Beecher hoped to inspire more Biblical purity among parishioners and, as a result, disciplinary actions at the Park Street Church were at an all-time high under Beecher's tenure. He married Isabella (Porter) Jones in 1829 and together they had eleven children. In 1830, he became the first president of Illinois College at Jacksonville, Illinois, where he remained president for 14 years. He was a close friend of Elijah P. Lovejoy and helped organize the first anti-slavery society in Illinois. His wife, Isabella, wrote to his sister, Harriet Beecher Stowe, to inspire her to write ''Uncle Tom's Cabin.\nHe returned to Boston in 1844. He was the pastor of Salem Street Church until 1855, when he returned to Illinois and became the pastor of the First Congregational Church of Galesburg. In 1871 he settled in Brooklyn, New York, where from 1885 to 1889 he was pastor of the Parkville church. He died there on July 28, 1895.\nHe was senior editor of The Congregationalist (1849—1855), and an associate editor of the Christian Union from 1870.\nPublished works\nSource:\n*Addresses on the Kingdom of God (1827)\n*Six Sermons on the Nature, Importance, and Means of Eminent Holiness throughout the Church (New York, 1835)\n*History of the Alton Riots (1837)\n*Statement of Anti-Slavery Principles (1837)\n* [https://archive.org/details/narrativeofriot00beec Narrative of Riots at Alton: in Connection with the Death of Rev. Elijah P. Lovejoy] (1838)\n*[https://archive.org/details/baotismimports00beecuoft Baptism, With Reference to its Import and Modes] (1849)\n*[https://archive.org/details/conflictages00beecrich The Conflict of Ages: or, The Great Debate on the Moral Relations of God and Man] (1853)\n*[https://archive.org/details/papalconspiracye00beeciala The Papal Conspiracy Exposed, and Protestantism Defended: in the Light of Reason, History & Scripture] (1855)\n* [https://archive.org/details/deathnotlifeorde00blai Death Not Life, or, The Destruction of the Wicked (Commonly Called Annihilation) Established and Endless Misery Disproved by a Collection and Explanation of all Passages on Future Punishment] (1859)\n*The Concord of Ages (1860)\n*[https://archive.org/details/secretsocietiesd00macd Secret Societies: A Discussion of their Character and Claims] (1867)\n*History of Opinions on the Scriptural Doctrine of Future Retribution'' (1878)\nSee also\nBeecher family\nReferences\nExternal links\n*[https://web.archive.org/web/20100225050152/http://newman.baruch.cuny.edu/digital/2001/beecher/edward.htm Edward Beecher]\n*[https://web.archive.org/web/20070504054208/http://www.harrietbeecherstowecenter.org/life/beecher_genealogy.shtml Beecher Genealogy]\n*[http://www.britannica.com/ebi/article-197303 Beecher family - Edward Beecher]\n*[https://web.archive.org/web/20070708103848/http://www.mtholyoke.edu/lits/library/arch/col/msrg/mancol/ms0509r.htm Beecher family papers, 1822-1903]\n*[https://wayback.archive-it.org/all/20100823045931/http://www.harrietbeecherstowecenter.org/hbs/beecher_family.shtml Beecher Family]\n*\n*"
    }
  ]
}