{
  "content": [
    {
      "type": "text",
      "text": "# Edward Callaway\n\n| birth_place       = Los Angeles, California, USA\n| nationality       = American\n| fields            = Neuroscience\n| workplaces        = Salk Institute for Biological Studies\n| alma_mater        = Stanford University (B.S.), California Institute of Technology (Ph.D.)\n| known_for         = Neural circuit mapping, visual cortex research, development of viral tools for neuroscience\n| awards            = National Academy of Sciences (2019), American Academy of Arts and Sciences (2012), AAAS Fellow (2010)\n}}\nEdward M. Callaway (born August 3, 1962) is an American neuroscientist recognized for his research on the organization and function of neocortical circuits, particularly within the visual system. He is known for developing innovative viral tools to map neural connections, a method known as viral neuronal tracing. He developed the monosynaptic-rabies tracing system and has shown how specific cortical and thalamic cell types integrate visual information. Callaway was elected to the National Academy of Sciences in 2019.\nEarly life and education\nEdward Matthew Callaway was born on August 3, 1962, in Los Angeles, California. He earned his Bachelor of Science in Biology from Stanford University in 1984. He then pursued a Ph.D. in Neurobiology at the California Institute of Technology, completing his doctorate in 1988 under the mentorship of David Van Essen. His doctoral research focused on neuromuscular development.\nFollowing his Ph.D., Callaway conducted postdoctoral research with Larry Katz at the Rockefeller University, and later at Duke University, investigating the development of visual cortical circuitry.\nAcademic career\nIn 1995, Callaway joined the Salk Institute for Biological Studies as an Assistant Professor in the Systems Neurobiology Laboratory. He currently holds the position of Professor and is the Vincent J Coates Chair in Molecular Neurobiology at the institute.\nResearch contributions\nCallaway's research has significantly advanced the understanding of neural circuits in the cerebral cortex, with a particular emphasis on the visual system. His notable contributions include:\n* Development of Viral Tools for Circuit Mapping: Callaway developed the method for using a modified rabies viruses to trace monosynaptic connections between neurons. This technique allows for the mapping of direct synaptic inputs to specific neurons, providing unprecedented insights into neural circuit organization.\n* Visual Cortex Organization: His studies have elucidated the functional organization of the primate visual cortex, detailing how different cell types contribute to visual processing and how information is integrated across cortical layers.\n* Cortico-Thalamo-Cortical Circuits: His recent work involves mapping cortico-thalamo-cortical pathways, revealing complementary organizations of driver and modulator circuits in the mouse visual system.\n* Cell-Type Specific Cortical Pathways: A 2023 study led by Callaway used single-cell profiling and circuit tracing to identify distinct neuron types that project to and from different brain regions, deepening our understanding of cell-type-specific connectivity throughout the brain. A 2024 study combined single cell profiling and monosynaptic rabies tracing to identify transcriptomic cell types connecting to specific classes of excitatory neurons in the visual cortex.\nAwards and honors\n* Sloan Research Fellow (1992–1994)\n* McKnight Technological Innovations in Neurosciences Award (2006)\n* Fellow of the American Association for the Advancement of Science (2010)\n* Fellow of the American Academy of Arts and Sciences (2012)\n* Krieg Cortical Discoverer Award (2013)\n* Election to the National Academy of Sciences (2019)\nReferences"
    }
  ]
}