{
  "content": [
    {
      "type": "text",
      "text": "# Edward J. Sanderlin\n\n| birth_place   = New Orleans, Louisiana\n| death_date    =\n| death_place   = Denver, Colorado\n| nationality   = American\n| other_names   =\n| occupation    = Entrepreneur, investor\n| years_active  = 1852&ndash;1890\n| known_for     =\n| notable_works =\n}}\nEdward J. Sanderlin (September 14, 1835 – April 15, 1909) was born into slavery. He was in Cincinnati by 1850, where he attended the Gilmore School. He took part in the California Gold Rush and the Pike's Peak Gold Rush in Colorado. He operated a barbershop and restaurant in Denver in its early frontier days. He became a wealthy businessman and investor in mines in Colorado and California.\nSanderlin fought for voting rights for African American males by lobbying at the local, territorial, and federal levels. He was among those who argued that Colorado should not become a state until all males could vote. Sanderlin negotiated for education for black children. He was inducted into the Blacks in Colorado Hall of Fame in 1973.\nEarly life\nSanderlin was born on September 14, 1835, in New Orleans, Louisiana. His mother was an enslaved woman. His British father was Wilson Sanderlin who immigrated to the United States and lived in North Carolina before settling in Tennessee. He owned large plantations in Montgomery County and Shelby County. Wilson had two families, one with his wife and another with an enslaved woman who was biracial. When he died, Wilson had an estate of about million dollars. Edward's mother fought for the rights of her children and ultimately each of her children received $30,000 as the result of a lawsuit.\nSanderlin attended Gilmore High School in Cincinnati. The school was established in 1844, during the Antebellum period. It provided secondary education for African Americans in Cincinnati, other places in Ohio, and across the country, including biracial children of Southern planters.\nCareer\nIn 1849, Sanderlin headed west from Tennessee during the California Gold Rush (1848–1855), which made him wealthy. He lost his fortune, though, by speculating in the eastern part of the country. In 1850, he was a nineteen year old barber, living with the William A. Caffrey family.\nHe went to Colorado for the Pike's Peak Gold Rush (1858–1861), arriving in Denver on June 11, 1859. At that time, the settlement was in the Kansas Territory (1854&ndash;1861). The South Platte River separated an encampment of Cheyenne and Arapaho Native Americans from the young frontier town of Denver.  Denver served Gold Rush miners by providing restaurants, saloons, gambling, and stores.\nHe operated a restaurant and barber shop. He paid premium prices for good food, like having oysters transported from the Missouri River or purchasing high quality dairy products locally. He invested in real estate and ranches, and was made rich due to his mining investments. By the time that Sanderlin retired he was worth $200,000 (). He lost most of his money during the Panic of 1893.\nCivil rights\n}}\nIn 1861, the Colorado Territory General Assembly passed an act that taxed African American property owners to fund public schools, even though their children could not attend the schools. Lewis Henry Douglass, William Jefferson Hardin, and Sanderlin fought for equal educational opportunities. They obtained what was meant to be a \"separate but equal\" plan. At first, white and black children were taught in the same school, but on different floors. Black children were taught in a rented building the next year and then in two churches, until 1873 when Denver's schools were integrated. Sanderlin also called for education for blacks to learn skilled trades.\nColorado Territory received permission to apply for statehood in 1864. African Americans lost their voting rights the following year when the territorial legislature amended its laws.\nSanderlin, William Jefferson Hardin, Henry O. Wagoner and Barney Ford lobbied to Congress, the territorial legislature, and residents to only accept statehood until all males could vote in the state. Hardin circulated a petition for voting rights, which was presented to the United States Congress. Frederick Douglass and two sons were brought in to help with the campaign. After a number of years, Colorado achieved statehood on August 1, 1876, and the constitution did not restrict voting rights.\nPersonal life\nSanderlin married Georgiana Epps, born in Ohio about 1837. She was the daughter of Margaret, born in Kentucky, and Jesse Epps, a trader born in Virginia. They were married on January 13, 1858, in Hamilton, Ohio. They had seven children: William (d. 1917), Isabel, Cora, Harry (d. 1892), Clara, Maude (d. 1889), and Georgiana.}} His wife was one of the founders of the Zion Baptist Church.\nHe was a friend of Barney Ford, another successful African America investor and businessman, and among a group of four men who were born into slavery and became successful through a \"momentous struggle\": H. O. Wagoner; W. J. Hardin, an orator; W. H. Green, a capitalist; E. J. Sanderlin, a capitalist. Others in their orbit helped one another succeed, such as William Sanderlin, Lewis Price, Louis H. Douglass, the son of Frederick Douglass; and many more. He helped African-American people settle in Colorado, as well as helping people by a house.\nHe retired in 1890. His wife, who died in August 1908. He died of pneumonia at his home at 1359 Pecos Street on April 15, 1909. He lost most of his fortune during the Panic of 1873. At the end of his life, he was \"comparatively a poor man,\" but he still had four contiguous lots in Denver worth $500 (). He was buried at Riverside Cemetery in Denver, Colorado on April 18, 1909.\nSee also\n* History of slavery in Colorado\n* List of African American pioneers of Colorado\nNotes\nReferences"
    }
  ]
}