{
  "content": [
    {
      "type": "text",
      "text": "# Edward Skeletrix\n\n| alias             = Cight, Syckli, ShieldLess, Im A Monster\n| birth_date        = 1998 (age 26)\n| birth_place       = Florida, US\n| origin            = Atlanta, Georgia, US\n| genre             =\n| occupation        =\n| years_active      =\n| past_member_of    = 0% Boys, Mizustation\n| website           =\n}}\nEdward King Bass IV (born 1998), known professionally as Edward Skeletrix, is an American rapper, clothing designer, and visual artist. He began producing music in 2013 for different rap artists like Night Lovell, and founded the streetwear brand Syckli in 2018. Bass adopted the name Edward Skeletrix in mid-2019. He gained popularity in 2024 after uploading AI-generated videos to TikTok. He released his debut project Skeletrix Language in 2023, and released Museum Music in 2025.\nBiography\nEdward Bass was born in 1998 in Florida. He grew up in Albany, Georgia, and began making music in 2013. Bass began producing under the name Cight, collaborating with rappers Night Lovell and XXXTentacion. Bass was also a founding member of underground production groups 0% boys and Mizustation. Bass created the streetwear brand Syckli in late 2018. In mid-2019, Bass adopted the name Edward Skeletrix and in 2024 began uploading AI-generated memes to TikTok, which quickly gained popularity. During this period, Bass worked at a psychiatric hospital in Baltimore, which he says \"triggered a sort of psychotic episode that lasted for about a year\".\nBass began releasing singles in early 2023, and released his debut project, Skeletrix Language, in December of that year. Shortly afterward, he teased a project by the name of Skeletrix Islvnd Rvdix 66.7, although it was never released. Following the release of Skeletrix Language, Bass began teasing Museum Music. In the final days of 2024, Edward Skeletrix held a pop-up art gallery in New York City to promote the album, during which he sat inside of a glass box while fans poured water on him, prodded him with provided objects, and attempted to light him on fire. Upon its release on January 1, 2025, Museum Music was met with mixed reception from music critics.\nBass announced his third album, Body of Work, on June 23, 2025. Though initially scheduled for a July 1, 2025 release date, it was delayed for unknown reasons. On July 14, 2025, in an interview with Our Generation Music, Bass accused longtime collaborator Brennan Jones of mental and physical abuse, stating that Jones threatened to \"kill Edward in his sleep\" and that he was \"not well\".\nArtistry\nEdward Skeletrix's visual art embraces the surreal and uncanny valley aspects of AI-generated content. He has expressed himself in multiple forms of art producing the music videos for his songs which were later taken off of social media platforms along with photography also used to promote his singles, many of which were later replaced with a dark plum colored image, which was also used as the album cover for Skeletrix Language and the Im A Monster version of Museum Music. His sophomore album Museum Music is a mix of cloud rap, rage, and trap, and often incorporates loud synthesizers and Auto-Tuned vocals.\nDiscography\nAlbums\n{| class=\"wikitable sortable plainrowheaders\" style=\"text-align:center;\"\n!Title\n!Album details\n|-\n! scope=\"row\" |Skeletrix Language\n|Released: 1 December 2023\nLabel: self-released\nFormat: Digital\n|-\n! scope=\"row\" |Museum Music\n|Released: 1 January 2025\nLabel: Range Music\nFormat: Digital\n|-\n! scope=\"row\" |Body of Work\n|Released: TBD\n|}\nAs Cight\nEP\n{| class=\"wikitable\"\n! Title\n! Release info\n|-\n| ARCHITECTURE\n|\n* May 31, 2014\n|}\nReferences"
    }
  ]
}