{
  "content": [
    {
      "type": "text",
      "text": "# Edward Jay Allen\n\n| birth_place = New York City, New York, USA\n| death_date =\n| death_place = Pittsburgh, Pennsylvania, USA\n| education = University of Pittsburgh  South Ward School\n}}\nEdward Jay Allen (April 27, 1830 – December 26, 1915) was an entrepreneur and prominent businessman based in Pittsburgh, Pennsylvania. In his younger years, he had been a pioneer in the Oregon Territory for a few years. He was an officer in the Civil War and survived major battles.\nEdward Jay Allen traveled west over the Oregon Trail in 1852 and made his way to Puget Sound, arriving in December of that year. Allen played a significant role in the early history of Washington Territory and left a detailed account of his years in the west (1852–1855).\nUpon returning to Pittsburgh, he married, raised a family, served with distinction in the Civil War as a colonel in the 155th Pennsylvania Infantry. In later life he became quite prosperous as secretary/treasurer of the Atlantic and Pacific Telegraph Company. He was a member of the exclusive South Fork Fishing and Hunting Club that gained notoriety for contributing to the disastrous 1889 Johnstown Flood.\nEarly life\nThe Allen family emigrated from Warwickshire, England, crossing the Atlantic on the ship Anacreon. They arrived in New York City on September 4, 1827. The youngest of six children, Edward Jay Allen was born to Edward and Millicent (Bindley) Allen on April 27, 1830. After nearly three years in New York City, the Allen family moved to Pottsville, Pennsylvania, a bustling coal center that supplied Philadelphia’s fuel needs via a newly constructed canal.\nIn 1834 the family moved again, traveling by Conestoga wagon to Pittsburgh, where they remained. The senior Edward Allen worked as a bricklayer and later as a construction contractor. He and his wife ensured that their three sons and three daughters were well educated and versed in the classics. Edward Jay Allen attended Pittsburgh's South Ward School and the University of Pittsburgh (then known as the Western University of Pennsylvania.\nSuffering from a severe long-term lung ailment, Allen found respite in the summer of 1851 wandering the hills of Westmoreland County, Pennsylvania with friends. Looking for relief from his illness, he decided to make a trip to the West.\nOut West\nAllen was unusual among the emigrants heading to Oregon. He was college-educated, knew nothing about farming, and traveled without a family. He hoped, in addition to securing property under the Donation Land Claim Act, that the trip west would improve his health.\nLeaving Pittsburgh by steamboat in the spring of 1852, Allen traveled to Iowa. There he joined a wagon train for the six-month journey. Other travelers were chiefly farmers and their families from Wapello County, Iowa. Allen kept a diary  and wrote fourteen letters to his family, which he sent from various locations along his route.\nThese letters were published in the Pittsburg Dispatch newspaper and saved in a scrapbook by his sister Rebecca.\nAllen's western journey officially began May 11, 1852 at Council Bluffs, Iowa (a.k.a. Kanesville). He had a typical Oregon Trail passage until reaching the Snake River Valley in Idaho. Having badly sprained his ankle, Allen concluded that he could walk no further. He decided to turn his wagon bed into a boat and float down the Snake River, soon learning why so few emigrants chose this method of travel. After days of running rapids and portaging around waterfalls, Allen and his waterborne companions arrived at Fort Boise. They were lucky to be alive and agreed to give up water travel.\nAllen remained at Fort Boise for four weeks, temporarily setting himself up in business. \"Diary August 19: We found there was but one flat here to ferry the emigration over, and that discovery was the origin of the 'Pennsylvania Ferry Company.\" He left behind accounts of the ferry business and of the comings and goings at Fort Boise of Native Americans, Hudson's Bay Company employees, fur traders and travelers.\nAfter his sojourn at the ferry, Allen continued west on horseback. He was soon back on foot, however. Still lame, he had to walk through the desert country of eastern Oregon after losing his horse in the Blue Mountains. In October 1852, Allen reached Portland, Oregon Territory. He paused briefly before heading north over the Cowlitz Trail to the small village of Olympia at the south end of Puget Sound.\nAllen was diverted on his journey north to serve as a delegate to the Monticello Convention. He participated in the beginnings of the political process that separated Washington Territory from Oregon. In December 1852, finally reaching his destination, Allen built a cabin on his Donation Land Claim three miles up Budd Inlet from Olympia. He decided to negotiate with local Native Americans to pay them for the land before he took up residence on it. This was unusual for the time.\nFrom late 1852 until January 1855, Allen remained in Washington Territory. In June 1853 he surveyed the Indian trail over Naches Pass in the Cascade Mountains as a potential route for a wagon road to divert incoming emigrants from the Willamette Valley to Puget Sound. From July through October he led a construction crew that began building the wagon road.\nThat winter he explored Puget Sound to its northern reaches by whaleboat, ran for a position in the territorial senate (he lost), and shared his cabin with Captain George B. McClellan and George Gibbs (geologist), both on assignment to conduct various government surveys of the newly created Washington Territory. Allen wrote up their reports and also created a dictionary of the Chinook Jargon. (This unpublished dictionary may be found in \"Hervey Allen Papers,\" Special Collections Department, University of Pittsburgh.)\nIn 1854 Allen and his crew returned to the mountains to improve the wagon road. He took time out from his road building to make what is believed to be the first ascent of Mount Adams by a European American.\nReturn to Pittsburgh\nAllen returned to Pittsburgh in 1855 after three years out west. In July 1857 he married Elizabeth Robinson and together they raised five children. At the outbreak of the Civil War, Allen was constructing a railroad in today's West Virginia. He and his family were seized by Confederate forces and held captive until repatriated at Washington, D.C. He offered his services to his friend, George McClellan, then a general and commander of the Army of the Potomac. Instead Allen fought in the battles of Lewisburgh and Cross Keys in Virginia's Shenandoah Valley.\nAllen later became a colonel in the 155th Pennsylvania Volunteer Infantry Regiment and fought at Fredericksburg and Gettysburg. He was medically discharged after Gettysburg. He continued in a civilian role to provision the Union army in the Shenandoah Valley.\nIn the post-Civil War years Allen made his fortune serving as secretary/treasurer of the Atlantic and Pacific Telegraph Company. He was among the elite, powerful and wealthy men in Pittsburgh. About 1880 they organized an exclusive South Fork Fishing and Hunting Club, to develop and enjoy a summer retreat in the mountains outside Pittsburgh. The property included an earthen dam and reservoir, known as Lake Conemaugh. In 1889 the dam collapsed, causing the disastrous Johnstown Flood. Houses and buildings were destroyed downstream and in the city; some 2200 people died. The club was legally defended in four court suits over the following years; neither the club nor its members were held legally responsible for damages to survivors.\nIn his 50s, Allen made two cross-country trips to Washington state, in 1889 and 1891. Edward Jay Allen died on December 26, 1915. He is buried in Homewood Cemetery, Pittsburgh, Pennsylvania.\nLegacy\nAllen wrote numerous letters to his siblings from his travels West, which his sister Rebecca collected. He kept a diary in Oregon Territory. In his later years, he continued to write. One of his unpublished manuscripts has recently been discovered by researchers among his grandson's papers. They have also found letters from his siblings to him during his years in the West. Much of this material is held by the University of Pittsburgh, in papers of his grandson Hervey Allen (1831-1965).\nHe was a poet and also wrote music lyrics. He published several works, including Hiou Tenas Iktah (\"A Lot of Trifles\" in Chinook jargon). In addition, he was a mentor to artist John White Alexander.\nRepresentation in other media\n*Dennis M. Larsen and Karen L. Johnson, Our Faces Are Westward: The 1852 Oregon Trail Journey of Edward Jay Allen, paperback, 2012\n*A Yankee on Puget Sound (2013), edited by Karen L. Johnson and Dennis M. Larsen\nReferences\nExternal links\n*[https://archive.org/details/undermaltesecros00unit Under the Maltese Cross, Antietam to Appomattox: the loyal uprising in western Pennsylvania, 1861-1865; campaigns 155th Pennsylvania regiment, by United States Army, Pennsylvania Infantry Regiment, 155th (1862-1865)], text at Internet Archive"
    }
  ]
}