{
  "content": [
    {
      "type": "text",
      "text": "# Edward Trelawny (colonial administrator)\n\n| birth_place = Trelawne, Pelynt\n| death_date  = 16 January 1754 (aged 54–55)\n| death_place = London, England\n| occupation  = Military officer, politician, colonial administrator\n| allegiance  =\n| branch      =    Imperial Army\n| rank        = Colonel\n| battles     =\n* War of the Polish Succession\n* First Maroon War\n}}\nColonel Edward Trelawny ( – 16 January 1754) was a British Army officer, politician and colonial administrator who served as the governor of Jamaica from April 1738 to September 1752. He is best known for his role in signing the treaty which ended the First Maroon War between the colony of Jamaica and the Jamaican Maroons. Trelawny also sat in the British House of Commons from 1724 to 1735, representing the constituencies of West Looe and East Looe.\nEarly life\nEdward Trelawny was born  in Trelawne, Pelynt. His father was Sir Jonathan Trelawny, 3rd Baronet, a Church of England bishop who played a major role in the Glorious Revolution. After studying at Westminster School and the University of Oxford, Trelawny entered into a political career, being elected to the British House of Commons in January 1724 after a parliamentary by-election, representing the constituency of West Looe. He was also given the position of commissioner of victualling, and spoke both in favour and against the policies of the Walpole–Townshend and Walpole ministries, claiming that he did not wish to be thought of \"as a party man, which I think I am as little as any one, perhaps too little to please any one\".\nA friend of fellow politician Sir Charles Wager, Trelawny vacated his parliamentary seat after being given the job of commissioner of customs in Edinburgh by Prime Minister Robert Walpole in December 1732. Two years later, he left Scotland and joined the Imperial Army of the Habsburg monarchy to fight against the French in the War of the Polish Succession. Trelawny was elected in absentia to Parliament for the constituencies of both West Looe and East Looe. However, both elections were declared void, as he was still serving as commissioner of customs in Edinburgh and ineligible to sit in Parliament. Trelawyn wrote to Thomas Robinson on the matter:\nThe elections, you know, are void of course upon account of my place. If Sir Charles does not get me out before a new election can be made, I can’t receive the benefit of the Looers’ favour so voluntarily bestowed on the mad volunteer: but I have left everything to Sir Charles Wager and whether I am to be senator, commissioner, or neither, I shall be easy under his decision and management.\nHe stopped serving as commissioner of customs in Edinburgh in 1737, having given up his office as commissioner of victualling in December 1732.\nGovernor of Jamaica\n, which was named in Trelawny's honour]]\nIn April 1738, Trelawny was appointed as the governor of Jamaica, succeeding John Gregory at a time when the colony of Jamaica was in the midst of the First Maroon War against the Jamaican Maroons. Quickly realising that the British were unable to defeat the Maroons, he offered the Leeward Maroon village of Cudjoe's Town a peace agreement, which its leader Cudjoe accepted, renaming his settlement \"Trelawny Town\" in Trelawny's honour. Trelawny quickly offered a similar treaty to the Windward Maroons, which was supported by Jamaica's white settler population. Both treaties formally recognised the Maroons' status as free people of colour, officially allocated them land in the Jamaican interior to establish settlements and exempted them from paying tax to the colonial authorities. In return, the Maroons agreed to return all escaped slaves back to their enslavers and take part in suppressing future slave rebellions when called upon to do so. The Windward Maroons accepted the treaty as well, bringing the conflict to an end.\nDuring his tenure as governor, Trelawny, at the rank of colonel, raised Edward Trelawney's Regiment of Foot in 1743 from eight independent companies of the British Army stationed in Jamaica during the War of Jenkins' Ear between Great Britain and Spain. In 1745, Trelawny wrote and published a pamphlet titled An Essay concerning Slavery, in which he expounded his abolitionist sentiments, arguing that slavery in Jamaica should be abolished. The pamphlet immediately proved controversial among the Jamaican slavocracy, who Trelawny felt owned too many slaves and mistreated those they already enslaved. However, Trelawny was aware that the Jamaican economy would collapse without slavery, and so stipulated that he would ultimately be content with merely the slave trade to Jamaica being abolished, which in his view would lead to the eventual abolition of slavery in the colony. He left the office in September 1752, being replaced by Charles Knowles.\nLater life and death\nWhile serving as governor, Trelawny married Catherine Penny on 2 February 1752. Penny was the widow of Attorney General of Jamaica Robert Penny, and had inherited from her husband between £30,000 and £40,000 \"in Jamaican money\". However, shortly after marrying her, Trelawny requested that he be replaced due to having contracted a cardiovascular disease. He subsequently received praise from the Jamaican House of Assembly for conducting a \"just administration\" and the \"many important services\" he had made during his tenure as governor. On November 1752, Trelawny returned to England onboard the Royal Navy frigate Assurance. In April 1753, as Assurance was nearing the Isle of Wight, it struck Goose Rock near The Needles and was wrecked, though Trelawny was rescued. He died on 16 January 1754 in London at the age of 55, bequething his properties in Trelawne and Looe to his brother John, as his marriage with Penny produced no children.\nReferences"
    }
  ]
}