{
  "content": [
    {
      "type": "text",
      "text": "# Edward Trenchard\n\n| placeofburial_label = Place of burial\n| placeofburial =\n| birth_place = Salem, New Jersey, U.S.\n| death_place =\n| placeofburial_coordinates =\n| nickname =\n| allegiance =\n| branch = United States Navy\n| serviceyears = 1800&ndash;1824\n| rank = Captain\n| unit =\n| commands =\n| battles = Quasi-WarFirst Barbary WarWar of 1812Second Barbary War\n| awards =\n| relations = Stephen Decatur Trenchard (son)\n| laterwork =\n}}\nEdward Trenchard (1785&ndash;1824) was a captain of the United States Navy, who saw service in the Quasi-War with France, the First Barbary War, the War of 1812, and the Second Barbary War. He was the father of Rear Admiral Stephen Decatur Trenchard.\nBiography\nEarly life and background\nTrenchard was born in Salem, New Jersey, the son of Curtis Trenchard. The family were descendants of George Trenchard (1655–1712) from the village of Wolverton in Dorset, who had come to America with William Penn in 1682. Edward's grandfather, also George, (1706–1780), was the Attorney-General of West New Jersey in 1767-1775 and commanded the Salem Light Horse during the Revolutionary War. Edward was initially apprenticed as an engraver under his uncle, James Trenchard, the editor of the Columbian Magazine, and a distinguished designer and an engraver of book-plates. However, a sea voyage to England at the age of 16 turned his mind to a military career, and on his return, he obtained a midshipman's warrant on April 30, 1800.\nWar service\nHe was appointed to the frigate  for a cruise in the West Indies during the Quasi-War with France. A strong friendship sprang up between Trenchard and a junior lieutenant, Stephen Decatur, so much so that Trenchard later named his son, Stephen Decatur Trenchard.\nAfter the French war the Adams was ordered to the Mediterranean, and participated in the operations off Tripoli in 1803. The following year Trenchard was transferred to the  seeing more action off Tripoli, and when his ship was fired upon by the Spanish batteries near the Strait of Gibraltar on September 21, 1805.\nTrenchard served aboard the  in the Home Squadron from 1806 to 1810, and was assigned to duty at the Brooklyn Navy Yard in 1811.\nOn August 30, 1812, he was ordered to Sacketts Harbor on Lake Ontario, to supervise the building of the sloop  by Henry Eckford. The building of Madison progressed with extraordinary speed, the 500-ton ship being launched on November 26. Trenchard assumed command of the Madison with the rank of Master Commandant and took part in the naval operations on Lake Ontario during the War of 1812. Trenchard fell ill with \"lake fever\" (the Madison at one time having eighty of her two hundred men on the sick list) and on July 21, 1813, left the ship to recuperate. On May 15, 1814, he rejoined the ship, taking part in the blockade of Kingston, Ontario, in September 1814. After the end of the war he commanded the frigate , and took part in the operations off Algiers, Tripoli, and Tunis, during the Second Barbary War of 1815.\nAfrica Squadron\nIn 1820 Trenchard was placed in command of the 20-gun sloop-of-war  of the Africa Squadron on anti-slavery operations off the west coast of Africa. His officers included Matthew C. Perry, Silas Stringham, and William Mervine, who all went on to distinguished navy careers. Cyane had not long been on station when on April 10, she captured two brigs and five schooners close in shore near the mouth of the River Gallinos. The officers and crew of the captured vessels were sent to the United States. However malaria and yellow fever, endemic in West Africa, took a heavy toll on the crew of Cyane. On April 20, Trenchard reported that thirty-six of his men were on the sick-list. In response Cyane was ordered home, and the  replaced her. On his return to the United States, Trenchard was assigned to duty in the Brooklyn Navy Yard, but his health had been irrevocably damaged; he died in 1824.\nReferences"
    }
  ]
}