{
  "content": [
    {
      "type": "text",
      "text": "# Edward W. Snedeker\n\n|death_date=\n|birth_place= Peoria, Illinois, US\n|death_place= Carlsbad, California, US\n|placeofburial= Eternal Hills Memorial Park, San Diego\n|placeofburial_label=\n|image=Edward Walter Snedeker.jpg\n|caption= LTG Edward W. Snedeker, USMC\n|nickname= \"Sneddy\"\n|allegiance= United States\n|branch= United States Marine Corps\n|serviceyears= 1926–1963\n|rank= Lieutenant general\n|servicenumber= 0-4082\n|commands= Marine Corps Schools, Quantico1st Marine Division2nd Marine Division7th Marine RegimentThe Basic School\n|unit=\n|battles=\nNicaraguan CampaignHaitian CampaignWorld War II\n*Battle of Tulagi\n*Battle of Guadalcanal\n*Battle of Vella Lavella\n*Bougainville Campaign\n*Battle of Okinawa\nKorean War\n*Battle of Pusan Perimeter\n*Battle of Masan\n*First Battle of Naktong Bulge\n*Battle of Inchon\n*Second Battle of Seoul\n*Battle of Chosin Reservoir\n*Battles of Wonju\n|awards=Navy CrossSilver StarLegion of Merit (3)Bronze Star MedalNavy Commendation MedalAir Medal (2)\n|relations=\n|laterwork=\n}}\nEdward Walter Snedeker (February 19, 1903 – May 5, 1995) was a highly decorated officer of the United States Marine Corps with the rank of lieutenant general. He was decorated with the Navy Cross, the United States military's second-highest decoration awarded for valor in combat, for his service as commanding officer of 7th Marine Regiment during the Battle of Okinawa in June 1945. He completed his career as commandant of the Marine Corps Schools, Quantico on July 1, 1963.\nEarly career\nEdward W. Snedeker was born on February 19, 1903, in Peoria, Illinois, as the son of Albert Henry Snedeker and Mabel A. Kennedy. His family later moved to Benkelman, Nebraska, and he attended high school there in 1922. Snedeker subsequently received appointment to the United States Naval Academy at Annapolis, Maryland, and during his years there, he competed in track, boxing and football. He graduated on June 3, 1926, with bachelor's degree and was commissioned second lieutenant in the Marine Corps on the same date.\nAs any other new officer, Snedeker went first to the Basic School at Philadelphia Navy Yard for officer training. He completed the school in the spring of 1927 and was attached to the newly activated 11th Marine Regiment at Marine Barracks Quantico, Virginia. His regiment was then ordered to Nicaragua to support government units against rebel bandits under Augusto César Sandino. Snedeker spent three months there as a member of 1st Battalion, before his unit was ordered to Cap-Haïtien, Haiti at the end of August 1927.\nHe was ordered back to the States in August 1929 and attached to the Communications Officers' course at Army Signal School at Fort Monmouth, New Jersey. Snedeker graduated in June 1930 and subsequently was ordered back to Haiti in January 1931. He was promoted to the rank of first lieutenant in October of that year and participated in the patrols against Cacos bandits until May 1933. Snedeker then attended post-graduate course in applied communications at the Naval Postgraduate School then at Annapolis, Maryland, and graduated with master's degree in 1936. He was promoted to the rank of captain in July 1936 and attached to the staff of 2nd Marine Brigade under Colonel Emile P. Moses as Brigade's communications officer.\nWorld War II\nSnedeker later attended Senior Course at Marine Corps Schools, Quantico and graduated in December 1940 and meanwhile received promotion to the rank of major in September of that year. He was then appointed transport quartermaster aboard the attack transport ship USS Barnett for next six months.\nHis next assignment ordered him to Marine Corps Base Quantico in June 1941, where was appointed Signal Officer of 1st Marine Division under Major General Philip H. Torrey. Snedeker participated with the division in the landing exercise in New River, North Carolina, and was responsible for the combat readiness of 1st Division signal troops.\nFollowing the Japanese Attack on Pearl Harbor in December 1941, he sailed with the division's advanced echelon to New Zealand in May 1942 and subsequently took part in the amphibious landing at Tulagi at the beginning of August 1942. He was promoted to the rank of lieutenant colonel one month later and participated in the actions against Japanese garrison on Guadalcanal.\nOn the night of 13 October 1942, salvos of gunfire from Japanese warships interrupted all wire circuits on the division switchboard, Lieutenant Colonel Snedeker, realizing that the security of the beachhead was threatened by the probability of a land attack, personally took charge of a wire repair crew. With utter disregard for his own safety, he fearlessly exposed himself during more than one hour of intensive naval bombardment in an effort to restore communications. For his actions during the night attack, he was decorated with the Silver Star for valor.\nSnedeker subsequently took part in the defense combat on Guadalcanal until December 1942, when 1st Marine division was withdrawn to Australia for rest and refit. For the later part of the campaign, he also received the Bronze Star Medal with Combat \"V\".\nWhile in Australia, Major General Alexander Vandegrift, commander of 1st Marine Division, was appointed commanding general of I Marine Amphibious Corps in July 1943. Vandegrift, who was aware of Snedeker's qualities as signal officer, appointed him corps signal officer. Snedeker was then ordered as an observer with army units during Battle of Vella Lavella in August and September 1943.\nHe rejoined the I Marine Corps at the end of September 1943, but was reassigned as assistant chief of staff for operations. In this capacity, he was co-responsible for the planning of operation for the upcoming Bougainville Campaign. In January 1944, Snedeker was transferred back to the States under rotation policy. He received Navy Commendation Medal with Combat \"V\" for his service on Bougainville.\nFollowing his return to the United States, he was attached to the Headquarters Marine Corps in Washington, D.C., as chief of Operations Section at Division of Plans and Policies under Brigadier General Gerald C. Thomas. While in this capacity, Snedeker was promoted to the rank of colonel in June 1944. However this administrative work did not suit him, and he requested for combat duty again.\nSnedeker was ordered back to the Pacific and rejoined 1st Marine Division under Major General Pedro del Valle at Russell Islands in November 1944. Upon the arrival, he relieved temporary commander, Lieutenant Colonel Norman Hussa and was appointed commanding officer of 7th Marine Regiment on November 8. The 7th Marines were heavily beaten down following the fighting on Peleliu in September 1944 and suffered nearly 1,500 wounded and killed. Snedeker was tasked with the transformation the regiment to the effective combat force again. He took his regiment to Guadalcanal in January 1945 to conduct exercises for future combat deployment – Okinawa.\nThe 7th Marines landed on the eastern shore of Okinawa on April 3, 1945, and met only slight enemy resistance. Rugged terrain and poor roads made advance difficult and 7th Marines was tasked with mopping up operations. Snedeker and his regiment were redeployed to the Shuri line, Japanese heavily defended network of fortifications, at the beginning of May 1945 and took part in the assault on Dakeshi Ridge. The fierce resistance and counterattacks inflicted heavy losses, but Snedeker and his regiment took part in the assault on Wana Ridge in the second half of May. The 7th Marines then remained in reserve until June 2, 1945.\nThe regiment then attacked enemy's emplacements near Kokuba River and continued to Oroku Peninsula. The last enemy's stronghold was at Kunishi Ridge, where Japanese forces prepared defensive positions and waited for attack. Unfortunately all daylight assaults were halted by fierce Japanese resistance and rugged terrain. Snedeker personally conducted an aerial reconnaissance of the area and subsequently planned and executed a night attack, which surprised the enemy. On June 17, the 7th Marines under his command penetrated the enemy lines and caused total destruction of organized resistance.\nColonel Snedeker and his regiment were relieved by Colonel Wallace's 8th Marines from 2nd Marine Division on June 18 and ordered to Motobu Peninsula for rest and refit. For his leadership of the 7th Marines during Okinawa campaign, Snedeker was decorated with the Navy Cross, the United States military's second-highest decoration awarded for valor in combat. He also received Air Medal for his participation in the aerial recon flight over the Okinawa.\nPostwar career and Korea\nSnedeker returned to the Division of Plans and Policies at Headquarters Marine Corps in November 1945 and served as Chief of Operations section until May 1946. He was subsequently transferred to the Marine Corps Base Quantico and served briefly as Chief of Instruction section, before he was appointed commander of the Basic School in August 1946. In this capacity, he was responsible for Marine officers' training and taught them the basics of being an \"Officer of Marines\". He went overseas again in June 1949, when he was appointed assistant chief of staff for plans and area Marine officer within the staff of Commander Naval Forces Marianas under Rear Admiral Charles A. Pownall.\nWith the outbreak of the Korean War in June 1950, Snedeker was transferred back to the States one month later and attached to the staff of reactivated 1st Provisional Marine Brigade in San Diego. He was appointed Brigade's Chief of staff under Brigadier General Edward A. Craig and sailed for Korea at the beginning of August 1950. The 1st Brigade landed at Pusan and following the brief fighting, it was ordered to Masan, where took part in the defensive actions, before it was ordered to the Naktong Bulge. Snedeker's unit was used as \"fire brigade\" within Eighth United States Army, and Snedeker personally visited front line areas several times to obtain firsthand information. He then planned and coordinated brigade's attack, which decimated Korean People's Army units in the area.\n(outgoing 1st Marine Division commander), Gerald C. Thomas (new division commander) and Chesty Puller (division assistant commander).]]\nAfter the fighting of Pusan Perimeter, 1st Provisional Marine Brigade was absorbed by 1st Marine Division and Snedeker was appointed deputy chief of staff. He also received the Legion of Merit with Combat \"V\" for his service with 1st Marine Brigade at Pusan, Masan and Naktong and second Air Medal for his inspection tours by helicopter.\nWhen North Korean Army launched a great offensive at the beginning of September 1950, supreme United Nations Command planned amphibious landing on Inchon in order to attack enemy from the rear. The 1st Marine Division was chosen to lead the Inchon landing on September 15. Snedeker then took part in the Second Battle of Seoul at the end of September of that year and subsequently received his second Legion of Merit.\nSnedeker remained with 1st Division until the end of October and then was attached for temporary duty to Pacific Fleet Evaluation Group. He rejoined 1st Marine Division on December 3, just for the Chosin Reservoir Campaign, in fact a breakout of U.N. forces from encirclement. Snedeker established the control and regulating post at Chinghung-ni, along the 1st Marine Division's withdrawal route from Chosin, and coordinated the movement of division units.\nHe was appointed division chief of staff in February 1951 and took part in the operations against Chinese and North Korean troops in Central Korea. Snedeker was ordered stateside in May 1951. For his service at Chosin and later in the Central Korea, he was decorated with his third Legion of Merit.\nIn July 1951, Snedeker was appointed chief of staff of 3rd Marine Brigade at Camp Pendleton, California. He was promoted to the rank of brigadier general in December 1951 and transferred to Marine Corps Base Quantico, Virginia, in May of the following year. Snedeker served as deputy director of the Marine Corps Educational Center until June 1954.\nHe then served as assistant commander, 2nd Marine Division under Major General Lewis B. Puller. General Puller was given new command in February 1955, and Snedeker assumed his responsibilities. He was promoted to the rank of major general in April of that year. He remained with 2nd Division until the beginning of July 1955 and was transferred to Washington, D.C., for duties as assistant chief of staff for operations at Headquarters Marine Corps. Snedeker subsequently assumed command of 1st Marine Division at Camp Pendleton in February 1958 and spent there next year and half.\nHis final assignment came in November 1959, when he was promoted to the rank of lieutenant general and relieved Lieutenant General Merrill B. Twining as commandant of the Marine Corps Schools, Quantico. In this capacity, he was responsible for the training and education at The Basic School, Officer Candidates School, Amphibious Warfare School and other facilities there.\nRetirement\nSnedeker retired from the active service on July 1, 1963, after 37 years of commissioned service. He settled in Carlsbad, California, and served on the Carlsbad Planning Commission and as a member of the board of directors of the MiraCosta College Foundation. He also assisted in the establishment of the Marine Military Academy in Harlingen, Texas, in 1965. Following the death of his wife, Minnie Johnson Douthit on August 14, 1979, Snedeker then married Vestena N. Burns on April 5, 1986.\nSnedeker died on May 5, 1995, at his home in Carlsbad, California.\nDecorations\nHere is the ribbon bar of Lieutenant General Edward W. Snedeker:\n{| style=\"margin:1em auto; text-align:center;\"\n|colspan=\"4\"|\n|-\n|\n|\n|\n|\n|-\n|\n|\n|\n|\n|-\n|\n|\n|\n|\n|-\n|\n|\n|\n|\n|-\n|}\n{| class=\"wikitable\" style=\"margin:1em auto; text-align:center;\"\n|-\n!1st Row\n|colspan=\"5\"|Navy Cross\n|colspan=\"6\"|Silver Star\n|colspan=\"5\"|Legion of Merit with Combat \"V\" and two \" Gold Stars\n|-\n!2nd Row\n|colspan=\"4\"|Bronze Star Medal with Combat \"V\"\n|colspan=\"4\"|Air Medal with one \" Gold Star\n|colspan=\"4\"|Navy Commendation Medal with Combat \"V\"\n|colspan=\"4\"|Navy Presidential Unit Citation with one silver and one bronze stars\n|-\n!3rd Row\n|colspan=\"4\"|Navy Unit Commendation\n|colspan=\"4\"|Marine Corps Expeditionary Medal\n|colspan=\"4\"|Second Nicaraguan Campaign Medal\n|colspan=\"4\"|American Defense Service Medal with Fleet Clasp\n|-\n!4th Row\n|colspan=\"4\"|American Campaign Medal\n|colspan=\"4\"|Asiatic-Pacific Campaign Medal with one silver 3/16 inch service star\n|colspan=\"4\"|World War II Victory Medal\n|colspan=\"4\"|Navy Occupation Service Medal\n|-\n!5th Row\n|colspan=\"4\"|National Defense Service Medal with one service star\n|colspan=\"4\"|Korean Service Medal with one silver 3/16 inch service star\n|colspan=\"4\"|United Nations Korea Medal\n|colspan=\"4\"|Republic of Korea Presidential Unit Citation with two Oak Leaf Clusters\n|}\nNavy Cross citation\nCitation:\nJohn Fitzgerald Kennedy The President of the United States of America takes pleasure in presenting the Navy Cross to Colonel Edward Walter Snedeker (MCSN: 0-4082), United States Marine Corps, for extraordinary heroism as Commanding Officer of the Seventh Marines, FIRST Marine Division, in action against enemy Japanese forces on Okinawa, Ryukyu Islands, from 2 to 22 June 1945. Following a period of sixty-two days of continuous fighting against a determined enemy, Colonel  Edward Walter Snedeker assumed responsibility for a zone of action previously assigned two assault regiments. Skillfully maneuvering his forces to pass through these elements, Ed launched an aggressive assault on the enemy and, in a series of rapid advances, let his unit forward until it reached the sea, thereby splitting Japanese forces strongly entrenched on Oroku Peninsula. Completing this mission, Ed immediately directed his Regiment against the final enemy defensive position on Kunishi Ridge. When repeated daylight assaults to overrun the stronghold were halted by fierce hostile resistance and difficult terrain, Colonel  Edward Walter Snedeker personally undertook an aerial reconnaissance of the area. Thereafter, Ed planned and executed a daring attack by night and, taking the enemy by surprise, succeeded in penetrating the hostile defenses and effecting subsequent total destruction of organized resistance. By his courage and determination in the face of overwhelming odds, Colonel Edward Walter Snedeker contributed materially to the success of his Regiment in winning the bitter fight for Southern Okinawa. His leadership throughout was in keeping with the highest traditions of the United States Naval Service.\nSilver Star citation\nCitation:\nThe President of the United States of America takes pleasure in presenting the Silver Star to Lieutenant Colonel Edward Walter Snedeker (MCSN: 0-4082), United States Marine Corps, for gallantry and intrepidity in action while acting as Division Signal Officer, FIRST Marine Division, Fleet Marine Force, at Guadalcanal, British Solomon Islands, on the night of 13 October 1942. When the opening salvos of gunfire from hostile warships interrupted all wire circuits on the division switchboard, Lieutenant Colonel Snedeker, realizing that the security of our beachhead was threatened by the probability of a land attack, personally took charge of a wire repair crew. With utter disregard for his own safety, he fearlessly exposed himself during more than one hour of intensive naval bombardment in an effort to restore communications. His heroic conduct, employed at great risk in the face of grave danger, was in keeping with the highest traditions of the United States Naval Service.\nSee also\n*List of 1st Marine Division Commanders\n*List of 2nd Marine Division Commanders\n*Battle of Okinawa\n*7th Marine Regiment\nReferences\n:"
    }
  ]
}