{
  "content": [
    {
      "type": "text",
      "text": "# Edward S. Zelazo\n\n| succeeded           = Anthony P. McBride\n| state_house = Massachusetts\n| term_start2 =\n| term_end2 =\n| governor2 =\n| predecessor2 =\n| sucessor2 =\n| birth_date =\n| birth_place = Adams, Massachusetts, U.S.\n| death_date =\n| death_place = North Adams Regional Hospital, North Adams, Massachusetts, U.S.\n| nationality =\n| party = Republican\n| spouse =\n| relations =\n| children =\n| residence = Adams, Massachusetts, U.S.\n| alma_mater = Boston University\n| occupation =\n| profession = Lawyer\n| religion =\n| signature =\n| website =\n| footnotes =\n}}\nEdward S. \"Red\" Zelazo (May 27, 1924 – March 9, 2008) was a lawyer and state politician in Massachusetts.\nEarly life and education\nEdward Zelazo was born in Adams, Massachusetts to the late Stanley and Susanna (Siara)\nZelazo.  Zelazo attended schools in Adams during his childhood, and graduated from the former Adams High School in 1942, where he played basketball, football and baseball.  Zelazo then entered the military during World War II, serving with the United States Navy aboard a destroyer in both the Atlantic and Pacific theaters.  Upon his honorable discharge, he entered the University of Massachusetts at the Fort Devens branch to pursue his law degree on the GI Bill. He later transferred to the Boston University School of Law, where he graduated in 1951.\nProfessional career\nZelazo returned to Adams after graduating from Boston University, and established his own law practice.  He served on the Adams School Committee from 1952 to 1954, and the Emergency Finance Board from 1953 to 1959.  He was then elected State Representative for the 2nd Berkshire District for two consecutive terms, from 1962 to 1966. Zelazo served on the Public Safety Committee during his first term from 1962 to 1964, and on the Counties and Legal Affairs Committees during his second term, from 1964 to 1966.  He was later named to the Massachusetts Industrial Accident Board, where he was a hearing judge and later its chairman.  After his tenure at the Massachusetts Industrial Accident Board, he returned to Adams and resumed his law practice, until retiring in 1993.\nPersonal life\nZelazo married Catherine R. Perenick on October 10, 1953.  They had 8 children.  Additionally, Zelazo operated a farm in Florida, Massachusetts where he raised Christmas trees and blueberries for over 40 years.\nReferences"
    }
  ]
}