{
  "content": [
    {
      "type": "text",
      "text": "# Edward Keeling\n\nSir Edward Herbert Keeling, MC (1883 The Times obituary and other sources seem to have mistakenly assumed a birth year of 1888, which is when the birth of an Edward George Keeling was registered in Market Drayton. – 23 November 1954) was a Conservative Party politician in the United Kingdom who served as a Member of Parliament (MP) from 1935 to 1954.\nThe younger son of the Reverend William Hulton Keeling, headmaster of Bradford Grammar School, he was educated at Bradford and University College, Oxford, graduating with a master's degree in jurisprudence. He was called to the bar at Lincoln's Inn. In 1902 he received employment in the Supply and Accounting Department of the Admiralty. His siblings include the social activist Dorothy Keeling and the Canadian communist writer Margaret Fairley.\nKeeling moved to be a member of the Harbour Commission in Burma, then a British colony.\nWith the outbreak of the First World War, Keeling received a commission as an officer in the Indian Army Reserve of Officers. He served in the Mesopotamian Campaign, and was present at the surrender of Kut by the British at the hands of Ottoman forces. Following the surrender, he served as a prisoner of war in Turkey until his escape, which eventually landed him in Bolshevik Russia. He returned to England, he served as the head of a special branch (responsible for Turkey and Bulgaria) in the British General Staff for enabling officers to escape. He was awarded the Military Cross in October 1918.\nPost war activity\nHe gained credentials as a journalist for the Westminster Gazette and in July 1919 entered Russia, accompanied by William Thomas Goode. Whilst the Russian Government invited Goode to continue to Moscow Keeling remained stranded at Velikie Luki. According to\nHe published his story as Adventures in Turkey and Russia in 1924.\nAfter the war he entered business: he was General Manager of the Turkish Petroleum Company, a member of Lloyd's of London and a director of the Wallsend and Hebburn Coal Company.\nKeeling unsuccessfully contested the 1929 general election in the Southwark Central constituency, a safe seat for the Labour Party.\nHis next parliamentary candidacy was at the 1935 general election, when he was elected as MP for Twickenham. His name is best known in legislative and Parliamentary circles as a result of the question he asked of the then Prime Minister, Neville Chamberlain, on 26 July 1938: \"whether he has considered a memorandum on the evils of legislation by reference submitted to him by a number of Members; and whether he has any statement to make\".\nThe Prime Minister, as the Minister responsible for the work of the Office of the Parliamentary Counsel, who draft all UK Government legislation, replied that: \"I have considered the memorandum with interest ... The suggestion made is, in effect, that a Bill amending or applying an existing enactment by reference should contain a Schedule setting out the enactment as it will read when amended by the Bill ... This method is not, I understand, put forward as a panacea to be used in all cases ... There are, however, undoubtedly some cases where the method suggested by the memorandum would be both practicable and advantageous; and I have instructed the Parliamentary Counsel to proceed experimentally on the lines suggested in suitable cases\". These Schedules have subsequently become known as 'Keeling schedules'.\nFrom 1945–1946 Keeling served as Mayor of Westminster. In 1952 he was knighted.\nKeeling held the Twickenham seat until his death in 1954. The resulting by-election in January 1955 was won by the Conservative candidate, Gresham Cooke.\nReferences\n*\n*\nExternal links\n*"
    }
  ]
}