{
  "content": [
    {
      "type": "text",
      "text": "# Edwin Ward Moore\n\n| birth_place         = Alexandria, Virginia, US\n| death_date          =\n| death_place         = New York City, US\n| placeofburial_label =\n| allegiance          = United StatesRepublic of Texas\n| branch              = United States NavyTexas Navy\n| serviceyears        = US Navy - 1825-1839Texas Navy - 1839-1843\n| serviceyears_label  =\n| rank                = Commodore of the Texas Navy\n| rank_label          =\n| servicenumber       =\n| unit                =\n| commands            =\n| battles_label       =\n| battles             =\n| awards              =\n| memorials           =\n| spouse              =\n| children            =\n| relations           =\n| laterwork           =\n| signature           =\n| signature_size      =\n| signature_alt       =\n| website             =\n| module              =\n}}\nEdwin Ward Moore (July 15, 1810 &ndash; October 5, 1865), was an American naval officer who also served as commander-in-chief of the Navy of the Republic of Texas.\nEarly life\nMoore was born in Alexandria, Virginia. His grandfather and uncle had served in the American Revolution. Moore was a classmate of Robert E. Lee's at the Alexandria Academy.\nEarly naval career\nMoore entered the United States Navy as a midshipman in 1825 at the age of 15.\nHis first assignment came when he was posted to the USS Hornet, followed by stints on the Fairchild and the Delaware. He saw active service on the Atlantic Coast and the Mediterranean Sea. In 1830, Moore was stationed at the Gosport Navy Yard, and five years later was commissioned a lieutenant and assigned to the sloop-of-war Boston on July 1, 1836. While serving on the Boston,  Moore saved the ship from sinking when it encountered heavy seas in a hurricane.\nIn September 1836, the Boston captured the Texas privateer Terrible off the coast of New Orleans. The Texas ship was sent to Pensacola, Florida, on piracy charges. This contact with the Texans is believed to have prompted Moore to re-evaluate his military career. Promotion within the U.S. Navy at this time was a slow process, as many of the officers who served in the War of 1812 still held rank above Moore.\nMoore's journey to and with the Republic's Navy\nIn 1839, Moore was accused of recruiting officers and up to 80 sailors from the Boston to join him in enlisting with the Republic of Texas Navy. Moore's cousin, Alexander Moore, confirmed this rumor to Commodore Charles Ridgley, who forwarded the charges to the Secretary of the Navy. On July 8, 1839, Moore resigned from the U.S. Navy to become commander of the Republic of Texas Navy.\nU.S. Secretary of the Navy, John Forsyth, tried to bring charges against Moore based on his violation of the Neutrality Act of 1819, but Moore resigned his commission before any trial was held.\nFrom 1840&ndash;1841, he sailed off the Mexican coast to hasten peace negotiations between the Republic of Texas and Mexico.  On collapse of the negotiations, Moore returned to Texas and to the support of Texas President Mirabeau B. Lamar. Lamar signed a treaty with the Mexican state of Yucatán for the lease  the Texas navy for $8,000 per month and to protect their ports from being blockaded by the Mexican Navy. On September 18, 1840, Moore received orders to guard the Yucatán coast in conformity with the Texas-Yucatán Treaty and on December 13, 1840, left Galveston, Texas, with three ships to join the small Yucatán fleet at Sisal, Yucatán, under the command of former Texas Navy officer Captain James D. Boylan. Moore later captured the town of San Juan Bautista, Tabasco, and then surveyed the Texas coast. His chart was later published by the British Admiralty.\nInvasion of Tabasco\nIn September 1840, Moore invaded the Mexican state of Tabasco in support to the Tabasco federalist forces, collaborating in the overthrow of the centralist governor José Ignacio Gutierrez, capturing the state capital San Juan Bautista on November 17, 1840.\nSubsequently, and due to a disagreement with the new federalist government, for the lack of a payment of $25,000 Mexican pesos promised to Moore, on December 14, 1840, he bombarded the capital again, until he reached a new agreement with the government of Tabasco for the payment of the debt.\nPresident Sam Houston\nUpon becoming President of the Republic of Texas, Sam Houston suspended the treaty with the Yucatán and ordered the fleet to return to Texas. Houston was not a big supporter of the Texas Navy.  When funds for naval repairs, approved by the Texas Congress, were withheld by Houston, Moore reinstated the treaty with the Yucatán in defiance of Houston's orders. Moore and two other Texas ships, along with a few from the Yucatán navy, engaged the Mexican fleet in May 1843 in the Battle of Campeche. Mexico's naval fleet consisted of the British-built ironclad steam-powered warship the Guadalupe and was the most advanced fleet ever assembled in the Gulf of Mexico at that time. Their battle was determined a draw, though Mexico suffered high casualties. The Mexican government even coined a medal of bravery for their sailors. Mexican Commodore Francisco de Paula Lopez, a naval veteran, was recalled for his failure to defeat a smaller and out-gunned force, and was court-martialed.\nEnd of career\nOn January 16, 1843, the Texas Congress ordered the sale of the Texas fleet. On June 1, 1843, Moore and the fleet had received Houston's proclamation accusing them of disobedience and piracy and suspending Moore from the Texas Navy. Houston even went so far as to ask for any friendly nation to capture and execute the Texas fleet. Moore returned to Galveston on July 14, and turned himself in at the port of Menard's Wharf, a hero to the people of Texas, and demanded a trial.\nAccording to later newspaper reports he was charged by the Texas government with disobeying orders and treason (in support of the Yucatan polity), and discharged from the Texas Navy on March 21, 1843, which then led to piracy, and the hanging by Moore from the yardarm four sailors, Antonio Landois, James Hudgins, Isaac Allen, and William Simpson, which the Texians deemed murder.\nLater years\nAfter the dissolution of the Texas Navy, Moore spent many years in prosecuting financial claims against Texas. In 1844, the Texas House of Representatives concluded that Moore was owed $26,510.41. He was paid, in installments, with the last payment coming in 1856.  Moore married Emma Matilda Stockton Cox of Philadelphia in 1849. She was a distant cousin of Commodore Robert Stockton.\nIn 1850, Moore and other officers petitioned the U.S. Navy to recognize their rank as officers with the Texas Navy. The House Naval Affairs Committee supported their claim, but the United States Supreme Court did not agree, holding that when Texas joined the Union, only property, and not human beings, belonged to the United States. On March 3, 1857, Congress finally closed the books on Moore and the other officers by granting them five years of back pay at the salaries of corresponding U.S. Navy officers.\nHe was in New York City for a time attempting to perfect a machine to revolutionize marine engineering. His quarrel with Sam Houston over the justice of his suspension from the navy continued during Houston's term as U.S. Senator.\nIn 1860, Moore returned to Galveston, where he built the Galveston Customhouse. Moore died in New York City on October 5, 1865, of apoplexy.\nMemorials\n*Moore County in the Texas Panhandle is named for him. An  exhibit honoring Moore is at the Window on the Plains Museum in Dumas, the county seat of Moore County.\nSee also\n*Texas Revolution\nReferences\nSources\n*[http://www.tshaonline.org/handbook/online/articles/fmo24 Edwin Ward Moore in the Handbook of Texas]\nFurther reading\n*Bauer, K. Jack, (1969). Surfboats and Horse Marines: U.S. Naval Operations in the Mexican War, 1846-1848,United States Naval Institute. pp.&nbsp;291 [https://books.google.com/books?id=67AMAAAAYAAJ Url]\n* Brockmann, R. John, (2009).  Commodore Robert F. Stockton, 1795-1866: Protean Man for a Protean Nation, the only scholarly biographyCambria Press, Amherst, Massachusetts, pp.&nbsp;622, , [https://books.google.com/books?id=jFxOa9KMRhIC Url]\n* Douglas, Claude Leroy, (1936). Thunder on the gulf: or, The story of the Texas navy, Publisher, pp.&nbsp;128, [https://books.google.com/books?id=KSkXAAAAIAAJ Url]\n* Dienst, Alex  (2007). The Texas NavyFireship Press, (Originally published by Dienst in 1909 as The Navy of the Republic of Texas) pp.&nbsp;208, , [https://books.google.com/books?id=Rad3_v9z_y8C Url]\n* Fischer, Earnest G  (1900). Robert Potter: Founder of the Texas Navy,Pelican Publishing Company Incorporated, pp.&nbsp;320, , [https://books.google.com/books?id=OysMAAAACAAJ Url]\n* Garrison, George P., Editor, (1910). The Quarterly of the Texas State Historical Association, Volume 13,Texas State Historical Association, pp.&nbsp;344, [https://books.google.com/books?id=dVYUAAAAYAAJ&q=stockton Url]\n* Hill, Jim Dan  (1987). The Texas Navy: in forgotten battles and shirtsleeve diplomacy, State House Press, pp.&nbsp;224, , [https://books.google.com/books?id=rdeFAAAAIAAJ Url]\n*Meed, Douglas (2001). The Fighting Texas Navy, 1832-1843Republic of Texas Press, Plano, TX,  , [https://www.amazon.com/Fighting-Texas-Navy-1832-1843-Douglas/dp/1556228856 Url]\n* Sullivan, Roy F.  (2010). The Texas Navies,AuthorHouse, Bloomington, IN, pp.&nbsp;176, , [https://books.google.com/books?id=XG9bGVrEm-AC&q=stockton Url]\n* United States (Government), Naval History Division, (1968), The Texas Navy, Volume 2; Volume 31,U.S. Government Printing Office, pp.&nbsp;40, [https://books.google.com/books?id=rNLrxB4_EzIC Url]\nExternal links\n* [https://web.archive.org/web/20081013172038/http://texashistory.unt.edu/permalink/meta-pth-2419 Texas Navy] hosted by [http://texashistory.unt.edu/ The Portal to Texas History].  A survey of the Texas Navy during the Texas Revolution and the Republic Era. Includes maps, sketches, a list of ships of the Texas Navy, and a chronology. Also includes photographs of 20th century U.S. Navy ships named after Texans or Texas locations."
    }
  ]
}