{
  "content": [
    {
      "type": "text",
      "text": "# EGroupware__disambig_1\n\n| latest release date    =\n| latest preview version =\n| latest preview date    =\n}}\nEGroupware is free open-source groupware collaboration software intended for businesses from small to enterprise. Its primary functions allow users to manage contacts, appointments, projects and to-do lists. The project releases its software under the terms of GNU General Public License (GPL).\nIt is used either via its native web-interface, making access platform-independent, or by using different supported groupware clients, such as Kontact, Novell Evolution, or Microsoft Outlook. It can also be used by mobile phone or PDA via SyncML.\nIt has translations for more than 25 languages, including right-to-left language support.\nHistory\nEGroupware is the most current manifestation of a chain of projects.  The original project was called .  In 2000 development on the project  began, which was based on ; and in 2003 the EGroupware fork was born.  EGroupware has a very pronounced community character compared with its predecessors.\nThere is an EGroupware constitution, adopted in 2005, which guarantees freedom and security to the community and establishes admin elections.\nFor a short time Tine 2.0 was an official subproject of EGroupware. The goal of the subproject was the development of future technologies for the EGroupware project. Due to internal disagreements, the projects EGroupware and Tine 2.0 had separated from each other in February 2008.\nIn July 2009 the first professional Version of EGroupware was made available. It was being sold as a software subscription. This product line, called \"EGroupware Premium Line\" (EPL) includes a maintenance agreement for the source code and corresponding RPMs, that enables automatic updates.\nVersion 14.2 ist became available in December 2014. E-Share-Option: Since version 14.2 EGroupware Filemanager offers a file sharing option for an data exchange. It includes, for example, the option to send links to read or edit files to persons that do not use EGroupware. Beside that, files can be moved via drag and drop. Filemanager is used as an alternative to the filehosting service Dropbox. Home Screen: The Home Screen is a virtual pinboard, that makes important contacts, projects or tasks always available for the user. Mobile Template: The third update in 14.2 is the mobile template, that has been optimized for small screens and touch handling. It enables the usage of EGroupware on tablets and supports swipe gestures and an adaptation of the format while turning the device.\nVersion 16.1 was released in 2016. It included a new calendar and further improvements of the mobile template.\nVersion 20.1 was released on 12 August 2020. It integrated a new smallPART application for video-based learning & teaching. A push server was implemented and the source code was converted to TypeScript. Even before the release of version 20.1, the video conferencing solution Jitsi and the web remote desktop solution Apache Guacamole were integrated due to the Corona pandemic.\nVersion 21.1 was released on 25 May 2021. The module smallPART (video-based learning tool) now supported tests and exams with single-choice, Multiple choice and open text questions. New additions include an integrated Kanban board and cloud telephone system integration (CTI). Further innovations included EGroupware Firewall, Dark Mode, File sharing for internal users, and EGroupware Mail server.\nTechnology\nEGroupware is developed in the script language PHP/TypeScript and is therefore platform-independent (Linux, Windows). Open source databases (MariaDB, PostgreSQL or also MySQL) can be used as databases. Authentication can be done against the own user accounts in SQL as well as LDAP, mail server, Active Directory (AD), CAS, SAML 2.0/Shibboleth/SimpleSAMLphp and others.\nComparable programs are proprietary groupware servers such as Microsoft Exchange or Lotus Domino.\nEGroupware can manage mail servers (Dovecot, Cyrus). User administration, e-mail accounts, absence notes/filters(via Sieve), mail aliases, quotas and forwardings are directly administrable in EGroupware or can be set by the user. A suitable e-mail server is offered as an installation package.\nEGroupware can be synchronised with Apple- and Android devices. Appointments, addressbook entries and tasks from Infolog application can be synchronised. ESync and CalDAV are thereby used as protocols.\nApplications and functions\n* Contact-manager using an SQL database or LDAP\n* Calendar (including support for scheduling of groups, resources and contacts)\n* Integrated IMAP webmail client (FelaMiMail)\n* Infolog, an application for tasks and notes\n* File manager\n* File sharing\n* Kanban board\n* Knowledge base\n* Element based project manager highly integrated with all other apps\n* Resources management (inventory) and booking tool integrated into EGroupware calendar\n* Wiki\n* SiteMgr: web based authoring system with fine granulated access control lists\n* CalDAV and CardDAV server\n* News\n* Time-tracker application\n* Bookmarks\n* Tracking system\nOther included/connected applications:\n* Chat (Rocket.Chat)\n* Video conference (Jitsi/BigBlueButton)\n* Remote desktop (Apache Guacamole)\n* Online office suite (Collabora Online)\n* smallPART\nSee also\n*  compares its features with others\n* List of project management software\nScreenshots\nFile:EGroupware Calendar 01.png|alt=EGroupware Calendar in desktop webbrowser|EGroupware Calendar in the desktop web browser with context menu\nFile:EGroupware Calendar 02.png|alt=EGroupware Calendar in desktop webbrowser - planner by user|EGroupware Calendar in the desktop web browser - planner by user with tooltip\nFile:EGroupware Address book.png|alt=EGroupware Address book in desktop webbrowser|EGroupware Address book in the desktop web browser with context menu\nFile:EGroupware InfoLog.png|alt=EGroupware InfoLog in desktop webbrowser|EGroupware InfoLog (tasks, notes, ...) in the desktop web browser with context menu\nFile:EGroupware E-mail.png|alt=EGroupware E-mail client in desktop webbrowser|EGroupware E-mail client in the desktop web browser with context menu\nFile:EGroupware Kanban.png|alt=EGroupware Kanban in desktop webbrowser|EGroupware Kanban in the desktop web browser with context menu\nFile:EGroupware File Manager 01.png|alt=EGroupware File Manager list view in desktop webbrowser|EGroupware File Manager (list view) in the desktop web browser with context menu\nFile:EGroupware File Manager 02.png|alt=EGroupware File Manager tile view in desktop webbrowser|EGroupware File Manager (tile view) in the desktop web browser with context menu\nFile:EGroupware Project Manager 02.png|alt=EGroupware Project Manager (Gantt view) in desktop webbrowser|EGroupware Project Manager (Gantt view) in the desktop web browser with context menu\nFile:EGroupware smallPART.png|alt=EGroupware smallPART in desktop webbrowser|EGroupware smallPART in the desktop web browser with context menu\nFile:EGroupware Timesheet.png|alt=EGroupware Timesheet in desktop webbrowser|EGroupware Timesheet in the desktop web browser with context menu\nFile:EGroupware Ressources.png|alt=EGroupware Ressources in desktop webbrowser|EGroupware Ressources in the desktop web browser with context menu\nFile:EGroupware CRM view.png|alt=EGroupware CRM view InfoLog (tasks) in desktop webbrowser|EGroupware CRM view (tasks) in the desktop web browser with context menu\nLiterature\n* Ralf Becker, Birgit Becker, Michaela Knotte, Ingo Kreißelmeyer: Manual EGroupware 1.4, English, Outdoor Unlimited Training GmbH, 1.Edition, January 2008,\n* Ralf Becker, Birgit Becker, M. Knotte, I. Kreißelmeyer: Benutzerhandbuch EGroupware 1.4, German, Outdoor Unlimited Training GmbH, 1. Edition, August 2007,\nReferences\nExternal links\n*\n* [https://www.egroupware.org/en/products/installation-on-your-own-server-free-version/ EGroupware Community Edition]\n*"
    }
  ]
}