{
  "content": [
    {
      "type": "text",
      "text": "# Egyptian intervention in the Crimean War\n\nThe Egypt Eyalet began a military intervention in Crimea at the request of the Ottoman Sultan Abdulmejid I after the Russian armies crossed the Prut River in 1853, they occupied the states of Wallachia and Moldavia (currently Romania), and peaceful efforts failed to resolve the deteriorating situation.\nBackground\nWhen the signs of the decline of the Ottoman Empire began to loom in the 18th century; Russia aspired to expand at the expense of the Ottomans, establishing a naval military presence on the northern coast of the Black Sea, then extending its influence and military control over the region of the straits, and enabling its ships to cross the Bosporus and Dardanelles in times of peace and war, without any conditions.\nTo achieve these goals, Russia engaged in a series of continuous wars against the Ottoman Empire, either alone or in alliance with countries hostile to the Ottomans. With the intention of exhausting the Ottomans, and preventing them from renewing their strength or catching their breaths; Until the body of the Ottoman Empire became easily divided between countries fighting to devour it.\nTreaty of Küçük Kaynarca\nThe Ottoman Empire entered into a fierce war that lasted for six years with Russia (1768 - 1774), in which the Ottoman Empire suffered painful defeats, forcing it to conclude a shameful treaty on July 21, 1774, which is known as the Treaty of Küçük Kaynarca, in which the Russians’ hopes that the Black Sea would be transformed from a purely Ottoman lake into an Ottoman-Russian lake were fulfilled, and Russian navigation now enjoyed freedom of movement in the Black Sea without restrictions or conditions. The treaty included that the Ottoman Empire would pay a fine to Russia amounting to 15,000 bags of gold, and that the Russians would obtain the right to care for the Orthodox population in the Ottoman lands. This clause would have meant that Russia would intervene in the affairs of the Ottoman Empire on an ongoing basis.\nMeeting of the Russian Tsar and the English Ambassador\nRussia was not satisfied with the gains it gained from the Ottoman Empire, but its sights extended to tearing the state apart and distributing its property. It raised its voice by waging wars against it, and its politicians were astonished at the failure of European countries to participate with Russia in its war against the Ottomans. The conversation between Nicholas I, Tsar of all Russia, and Sir Hamilton Seymour, the British ambassador to Constantinople, reveals Russia's expansionist policy.\nThe Tsar described the Ottoman Empire as a country that was collapsing, and that it was a very \"sick man\" who might die suddenly, and it was necessary to agree on how to dispose of his lands before he died. He indicated that the matter would be settled between England and Russia without a war breaking out between them, and he frankly explained his desire for the independence of the Balkan countries under the protection of Russia, and to seize the Ottoman capital, and in exchange for that, Britain would seize Egypt, but this project was not successful or found a response from Britain, which was rejecting Russia's access to the straits.\nSpark of war\nThe Ottoman Empire continued to maintain a balance between the Roman Catholics and the Orthodox in their respective rights to manage the places of pilgrimage in Jerusalem, especially the Church of the Nativity in Bethlehem. The dispute between them was simple, but it gained its importance from the Russian Tsar's support for Orthodox demands, while Napoleon III, Emperor of the French, supported the demands of the Catholic Church regarding the Holy Places, and France considered itself a protector of Christians in the East since the time of the Crusades. This conflict ended with Sultan Abdulmejid issuing a decree in favor of the Catholic Church in 1852.\nThis decision greatly angered the Tsar, so he ordered a Russian army to be mobilized and sent to the Prut River, and at the same time he sent an arrogant delegation to Constantinople headed by Prince Alexander Sergeyevich Menshikov, not to ask for urgent satisfaction regarding the holy places, but to demand the conclusion of a treaty between the two countries, which is more unfair to the rights of the Ottoman Empire than all previous treaties with Russia; It guaranteed the Tsar the right to protect all Orthodox subjects living under the Ottoman Empire. The Sultan rejected these demands.\nThe Egyptian army in Crimea\nRussian armies crossed the Prut River in 1853, occupying Wallachia and Moldavia (now Romania). Peaceful efforts failed to resolve the precarious situation; So Sultan Abdulmejid I sent a request for help from Egypt, and Abbas Pasha I, the wāli of Egypt, complied and ordered the preparation of a fleet of twelve ships, equipped with about 6,850 naval soldiers and 642 cannons under the command of Admiral Hassan Pasha al-Iskandarani, in addition to a land army led by Selim Fathi Pasha. It included about 20,000 soldiers and 72 cannons, equipped with machinery and weapons.\nThe Egyptian historian Prince Omar Toussoun recorded the news of this relief in full detail in his valuable book: “The Egyptian Army in the Russian War Known as the Crimean War.”\nBattle of Sinop\nThe Ottoman Empire declared war on Russia on Muharram 1, 1270 AH / October 4, 1853 AD, and sent a section of its naval fleet alongside the Egyptian vessels Damiat and Pervaz-i Bahri to the port of Sinop on the Black Sea. It consisted of thirteen naval vessels led by Osman Pasha, and then arrived at the port. On Muharram 18, 1270 AH / October 21, 1853 AD, some Russian naval vessels were led by Pavel Nakhimov, commander of the Russian fleet, to uncover the locations of the Ottoman fleet and know the extent of its strength. They remained stationed outside the port, besieging the Ottoman ships. Nakhimov sent to his country requesting to supply him with more vessels. The Navy arrived, and when it arrived, he placed four of his warships outside the port; to cut off the Ottoman ships' line of return if they tried to escape.\nWhen Osman Pasha expected the treachery of the Russian fleet, he ordered his commanders and soldiers to be prepared and patient when fighting, despite the pledge of Nicholas I, Tsar of Russia, and his promise not to attack the Ottoman forces unless they started fighting, but the Tsar broke his promise. The Russian ships opened fire on the Ottoman and Egyptian naval ships, which were few in number and small in size when compared to the Russian ships, on the 28th of Safar 1270 AH / 30 November 1853 AD.\nThe Egyptian frigate Damiat, which had 56 cannons and 500 Egyptian sailors on board, began firing at the Russian ships amidst the shouting of the Egyptian sailors. The Egyptian frigate Damiat was the fourth largest ship on the Ottoman side, so it was spotted by the Russian ships.\nWhile the battle was underway and outside the Gulf of Sinop, the second Egyptian steam frigate, Pervaz-i Bahri, its captain was the Sagh Kol Aghassi (Major) Saleh Qabdan, was coming from Constantinople to the Sinop Gulf, and its crew did not know that a battle was taking place in the first place. A huge Russian steam frigate named Vladimir (commanded by Lieutenant-Commander Grigory I. Butakov) spotted the Egyptian steamship, Pervaz-i Bahri.\n]]\nThe Admiral of the Egyptian Khedival Fleet, Ismail Pasha Sarhank, mentioned in his book “News Facts about the Countries of the Seas,” that the Russian crew implemented a smart plan, so that they raised the Ottoman flag on the Russian ship. The Egyptian crew on Pervaz-i Bahri thought that the ship was an ally, and they allowed the Russian steam frigate Vladimir to approach them. As soon as it approached the Egyptian ship, the Egyptian crew noticed that there was something strange going on. The Russian steam frigate, Vladimir, began a direct attack on Pervaz-i Bahri, thus beginning the first action between steamships in history. They hit her steam engines, so Pervaz-i Bahri was unable to move regularly. Although it was a direct hit that would have prevented any ship from continuing the battle, Pervaz-i Bahri and its Egyptian crew refused to surrender.\nThe Egyptian steam frigate, Pervaz-i Bahri, spent 3 hours fighting the Russian steam frigate, Vladimir, to the point that one of the Egyptian shells killed five of the command crew, including Vice Admiral, Lieutenant Gezaiselznov, in addition to wounding the Russian Admiral himself, Vladimir Alexeyevich Kornilov.\nAfter a violent Russian bombardment, the death of 19 members of the Egyptian crew, including a Yuzbashi, two lieutenants, and sixteen sailors, and the wounding of 21 others, the crew of the Pervaz-i Bahri surrendered, and the Russian fleet towed the ship to the port of Sevastopol, and its Egyptian crew was treated as prisoners of war with respect due for their honorable fighting.\nThe Russians subsequently repaired the ship, Pervaz-i Bahri, and changed its name to Admiral Kornilov, after the Chief of Staff of the Russian Black Sea Fleet, who led the Battle against Pervaz-i Bahri.\nBoth the Vladimir and the newly named Kornilov were scuttled in Sevastopol at the end of the war – trapped there, like other Russian warships, by the blockade imposed by the Royal Navy.\nThe battle between Pervaz-i Bahri and Vladimir is considered the first battle between two steamships in history, and the Russians celebrate it every year as one of the Days of Military Honour.\nIn the heart of the Gulf of Sinop, the Egyptian sailors found that most of the Ottoman ships were sunk and destroyed, other than the sinking of the Egyptian steam frigate and the martyrdom of its Egyptian crew in the middle of a prolonged scene. And not only that, they found that the rest of the Ottoman ships were fleeing the battlefield and heading to anchor on the beaches. There was nothing left beside the Egyptian ship Damiat except one Ottoman steam frigate called Taif, which also escaped in the direction of Constantinople (and the truth is not known whether it escaped at the time of the sinking of Damiat or before that). The Egyptian sailors knew that their fate was inevitable, but out of faith and that they were representing the Egyptian nation in a strange war and in a strange land to their country, they continued the battle with all valor.\nThe entire Russian ships were attacking the Damiat frigate alone, which was defending the port of Sinop with all valor. In the end, as is known, abundance prevails over courage.\nThe Damiat frigate was hit in devastating places, which led to its sinking becoming a matter of time. The Egyptian sailors began to prepare themselves, and the heroic frigate Damiat sank, and 500 Egyptian sailors were martyred in an epic scene learned by the Egyptian Navy and the Russian Navy. The Egyptian frigate Damiat receives great respect from the Russians to this day.\nPrince Omar Toussoun says about the Battle of Sinop:“The Turkish and Egyptian naval ships, despite their small size and the huge size of the Russian ships, were fighting with all valor and courage, but this was to no avail, as the strength of the Russian navy was much greater than the strength of the Turkish and Egyptian navy, and the aforementioned war resulted in the destruction of the ships of this navy and the killing of most of its sailors.”He says again:“The Egyptians raised their status in the eyes of the world through their courage, bravery, and the intensity of their struggle against the Russians.”This action angered France and England, so they decided to enter into a war against the Russian Tsar on the side of the Ottoman Sultan. It lasted about two years, a war known as the Crimean War.\nIn late 1853, the Egyptian ground forces participated in some of the fiercest battles on the Danube River, while the Egyptian fleet proceeded to maneuver on the coast of the Crimea, with the flags of the Ottoman Empire on its masts, waiting for the fighting to begin. Less than 6 months later, France and Britain joined Turkey against the Russians, and the Crimean War began. In particular, the occupation of the city of Sevastopol, which was besieged by the coalition starting in September 1854 for an entire year, until they captured it and regained it from a Russian occupation that lasted 80 years.\nPrince Toussoun mentioned that the Ottoman coalition forces, including the Turks, Egyptians, British, and French in particular, defeated the Russian army in 1854, which was led by General Alexander Sergeyevich Menshikov, in one of the most famous battlefields, which was the Battle of Alma, after which the Egyptian fleet returned on October, 31 of that year to Istanbul. During its return, two Egyptian battleships sank in the Black Sea due to storms, and the Egyptian Navy lost 1,920 sailors including the fleet commander Hassan Pasha al-Iskandarani, and only 130 survived.\nThe news of the tragedy that befell the Egyptian Navy was published in an issue of the magazine The Illustrated London News published on December 2 of that year.\nSiege of Silistria (11 May – 23 June 1854)\nThe Egyptian ground forces were the first and most important division led by Isma'il Pasha Haqqi. It participated in the defense of the city of Silistria in northeastern Bulgaria from May 11 to June 23, 1854, and repelled the Russian attacks on it, killing 2,000 of them on the night of May 28 alone.\nSustained Ottoman-Egyptian resistance had allowed French and British troops to build up a significant army in nearby Varna. Under additional pressure from Austria, the Russian command, which was about to launch a final assault on the fortress town, was ordered to lift the siege and retreat from the area, thus ending the Danubian phase of the Crimean War.\nBattle of the Alma (5 April – 25 June 1854)\nThe 13th G and 14th G-Alai (regiment) Bayada (infantry) of the Egyptian 3rd Brigade, commanded by Suleiman Pasha al-Arnauti, contributed to this battle. The Russians were defeated there under the leadership of their general, Alexander Sergeyevich Menshikov.\nHere is what was reported in The Illustrated London News in its issue dated October 14, 1854, regarding the participation of Egyptian soldiers in that battle:“In the Alma incident, 7,000 Egyptian soldiers were marching on the shore of the salt sea under the command of Suleiman Pasha al-Arnaouti.”\nSiege of Sevastopol (17 October 1854 – 11 September 1855)\nThe Illustrated London News, in its issue dated September 16, 1854, published news that came to it from its offices in Constantinople on the aforementioned September 7 regarding the Allied army and its number, and said:\"Our offices in Constantinople sent us a letter dated September 7th saying that the army to be sent to Crimea would consist of 90,000 soldiers, including 40,000 French soldiers, 20,000 English soldiers, 10,000 Turkish soldiers, 10,000 Egyptian soldiers, and 5,000 Tunisians. And 5,000 of different kinds.”Since it was decided to move the battlefield to the Crimea to establish a siege around Sevastopol, the two aforementioned armies took off again from Varna and landed in the Crimea on September 14, 1854. The siege of Sevastopol began on September 20, 1854, and lasted for a year because its capture took place on September 8, 1855.\nThe rest of the ground forces proceeded to Crimea, and its artillery division constituted more than half of the Ottoman coalition forces consisting of 23,000 soldiers. In a few days, the Egyptians were able to occupy the famous city of Yevpatoria on 9 February 1855, an important strategic port for those who intended to occupy it.\nThe Egyptians who were transferred to it consisted of 9 G and 10 G Alai Bayada, consisting of the First Brigade, led by Ismail Pasha Abu Jabal, and 13 G and 14 G Bayada, consisting of the Third Brigade, led by Suleiman Pasha al-Arnaouti. As for the second brigade of Egyptian soldiers, consisting of 11 G and 12 G-Alai Bayada, under the command of Ali Pasha Shukri, it remained in Rumelia on the Danube River. Naturally, the head of these commanders, Major General Selim Fathi Pasha, moved to Yevpatoria with most of them. When the Turkish and Egyptian armies arrived, the flames of war broke out. On February 11, the Russian army, which was stationed in front of Yevpatoria, began an offensive movement, initially seizing a Tatar cemetery located east of the city, but it was expelled from it as a result of a severe attack by the Turks and Egyptians.\nTherefore, the Russians responded on February 16 and 17, 1855, with a reluctant attack. Surprisingly, 19,000 soldiers, equipped with the latest weapons, the most important of which were 108 cannons, participated in it to retake the city.\nThe Egyptians repelled them with fierce fighting, described as one of the fiercest in the Crimean War. The Russians were forced to withdraw irregularly. In that battle alone, 400 Egyptians fell, who were buried in the city's Islamic cemetery. The commander of the Egyptian ground forces, Selim Pasha Fathi, also fell there, and they buried him next to the Juma-Jami Mosque in Yevpatoria which is the oldest and most famous in the city. The Mirliva (brigadier general), Mahammad Rustum Bey, and the Mirliva, Ali Bey, commanders of 9G and 14G Alai Bayada, also fell.\nIt was mentioned in the book \"The History of the War in Russia and Turkey\" that Lord Raglan, Commander-in-Chief of the British troops in Crimea, said in his report that when the Russians attacked in the battle of Eupatoria, the Egyptians responded to that attack with amazing fortitude, and that this indicates that the fame that the Egyptian armies gained on the Danube River was only earned by merit and entitlement. This fame has remained constant for them without the slightest change.\nWhen the obituary of Selim Fathi Pasha came to Egypt, Sa'id of Egypt appointed Lieutenant General Ahmad Pasha al-Munkali in his place as Commander-in-Chief of the Egyptian armies in Turkey. He accompanied him with the Mirliva Ali Bey Mubarak, to be one of his pillars of war, and the two traveled to the battlefield.\nIn early 1855, Egyptian land rescue soldiers were mobilized, which Sa'id Pasha ordered to be sent to assist in this war. They sailed from Alexandria to Constantinople and then traveled on April 4 of the aforementioned year to the battlefield.\nThe Illustrated London News, in its issue dated April 14, 1855, published the news of the arrival of 8,000 Egyptian soldiers to Opatoria to reinforce the Ottoman army of the Serdar (Commander-in-Chief) Ikram Omar Pasha there. Here is what the aforementioned newspaper said in this regard:\"Omar Pasha's army in Opatoria was strengthened by the arrival of 8,000 Egyptian soldiers.\"It happened that when this help arrived, the Allied armies felt severely bothered due to the lack of combat soldiers. Marshal Kenrobert, commander of the Egyptian armies, proposed requesting supplies from Egyptian soldiers to support the Allied armies in this war. This is undoubtedly something that gives Egypt the greatest honor. This strange coincidence was mentioned by Mr. Fortescue in his book \"History of the British Army\".\nIn mid-June 1855, the Turkish Serdar Ikram Omar Pasha came from Eupatoria to the city of Sevastopol with an army of Egyptians and Turks numbering 15,000 soldiers, stationed in the area where the English Guardia Brigade and the Second English Division were stationed near the Inkerman Heights, in preparation for attacking this fortified city.\nThe Illustrated London News published the news of the arrival of Serdar Ikram Omar Pasha with this army to Sebastbol in its issue dated June 23, 1855, saying:\"In the final round of the siege of Sevastopol, Omar Pasha came with an army of 15,000 Turkish and Egyptian soldiers in preparation for the attack. It was stationed in the area occupied by the English 2nd Division and the English Guardia Regiment, next to the Inkerman Heights.\"On September 8 of this year, Sevastopol Castle fell after a long siege that lasted a year. French Marshal Pélisset, the commander of the allied armies, decided to explore the Russians' positions with the intention of attacking them. General Dalonville sent to Eupatoria with three French cavalries. The Turkish Field Marshal Ahmed Pasha was with him, accompanied by thirty cannons and three divisions, one of them from the Bayada, the second from the Turkish Sawari (cavalry), and the third from the Egyptian Bayada.\nGeneral Dalonville departed from Eupatoria on September 19, 1855, with 3,000 soldiers from the Turkish and Egyptian Bayada, 1,500 Turkish Sawari and 1,000 French cavalries. This army was divided into two parts, one of which headed towards the north under the command of Ahmed Pasha, and the other towards the south-east under the command of General Dalonville.\nThe latter section rose at midnight and arrived at four o'clock in the morning at the Russian army's forward points. Immediately, the armies gathered there retreated and released smoke into the air to warn of the enemy's approach.\nWhile General Dalonville was preparing to take advantage of the turmoil that had occurred among the Russian ranks due to this surprise by attacking them, a fog rose and spread until it prevented one from seeing anything within 20 paces.\nAt eight o'clock, this fog dissipated, and the soldiers began marching, and two groups of Egyptians crawled in front, supported by two other Turks, assisted by a Turkish battery and a French battery. There were 3,000 Russian cavalries and two batteries in front of this force, but they did not wait until they collided with them, but rather retreated, abandoning their fodder and grain. Turkish Field Marshal Ahmed Pasha also forced the Russians to withdraw.\nReferences"
    }
  ]
}