{
  "content": [
    {
      "type": "text",
      "text": "# Ein Gedi (archaeological site)\n\n| grid_position =\n| location = Israel\n| region = Judaean Desert\n| type = Settlement\n| part_of = Ein Gedi\n| length =\n| width =\n| area =\n| height =\n| builder =\n| material =\n| built = 4th millennium BCE (Chalcolithic temple)\n8th/7th century BCE (Judahite outpost and settlement), 5th century BCE (rebuilt Jewish settlement)\n| abandoned = 6th century BCE; 7th century CE\n| epochs = Chalcolithic, Iron Age, Hellenistic, Roman, Byzantine\n| cultures = * Ghassulian\n* Jewish (Iron Age Judah, Second Temple-era, Rabbinic era)\n| dependency_of =\n| occupants =\n| event = Babylonian captivity, First Jewish–Roman War, Bar Kokhba revolt\n| excavations = 1949, 1958, 1961–1965, 1970–1972, 1980s, 1993–1995, 1996–2002\n| archaeologists = Benjamin Mazar, Yohanan Aharoni, Yosef Porath, Gideon Hadas, Yizhar Hirschfeld, Dan Barag\n| condition = In ruins\n| ownership =\n| management = Israel Nature and Parks Authority\n| public_access = Yes\n| website = [https://en.parks.org.il/reserve-park/engedi/ En Gedi Antiquities National Park]\n| notes =\n}}\nEin Gedi () was an ancient settlement located in the Judaean Desert, along the western shore of the Dead Sea. In antiquity, it was an important Jewish settlement. The remains of the settlement are part of an archaeological park situated in southern Israel.\nEin Gedi is frequently mentioned in the Bible, in the works of Josephus, in rabbinic literature, and in early Christian sources. The site was inhabited during different periods, and the earliest activity dates to the Chalcolithic period. The ruins, including a 6th-century synagogue, testify to a continuous Jewish settlement in the area between the 5th century BCE to the 7th century CE.\nAdjacent to the archaeological park is the Ein Gedi Nature Reserve, a national park known for its oasis, waterfalls, and walking trails. To the south lies modern Ein Gedi, a kibbutz (collective community) established in 1954. The site was excavated in the 20th century.\nHistory and archaeology\nChalcolithic\n]]\nA Chalcolithic temple (ca. mid-fourth millennium BCE) belonging to the Ghassulian culture was excavated on the slope between two springs, Ein Shulamit and Ein Gedi. More Chalcolithic finds were made at the Moringa and Mikveh Caves. The archaeologists did not discover a settlement associated with the temple. Roi Porat who discovered the Chaloclithic activity in Moringa Cave believes it to be indicative of a nearby settlement. However, David Ussishkin – who excavated at the temple – disagreed saying \"had there been a Chalcolithic settlement in Ein Gedi, its remains would have been detected long ago\".\nThough there is no evidence of Bronze Age settlement at Ein Gedi.\nIron Age\nIn the 7th century BCE, or possibly even earlier under King Hezekiah (reign c. 716/15–687/86 BCE), the Kingdom of Judah began to expand into the Judaean Desert. As part of this expansion, a small outpost was established near the oasis of Ein Gedi, which remained active during the first half of the 7th century BCE. The high standard of the structure suggests that the outpost was likely commissioned by the monarchy. The site, consisting of the remains of a stone platform, is thought to be the foundation of a tower or, according to another interpretation, a cultic site similar to the biblical bamah. This early evidence of Judahite presence in Ein Gedi may be linked to a Hebrew inscription on a stalagmite at Naḥal Yishai, 1.2 km northeast of the Ein Gedi spring, dating to the same period.\nAround the mid-7th century BCE, the focus of activity in Ein Gedi shifted from the small outpost to a new settlement at Tel Goren (also known as Tell el-Jurn), represented by Stratum V at the site. Some scholars suggest that there is enough evidence to support the establishment of this settlement as early as the late 8th century BCE. This development was likely driven by new economic opportunities arising from the Dead Sea's natural resources, including salt, bitumen, and the cultivation of valuable crops for food and possibly perfume. Around this period, Ein Gedi became an important center for cultivating the highly prized Judean date palms, possibly encouraged by the Neo-Assyrian Empire, which held hegemony over Judah. Two personal seals, likely from the time of Josiah, were found at the site, one belonging to 'Uriyahu, [son of] Azarayhu.' Two other names are also attested in remains from this period.\nThe Iron Age settlement flourished as a key economic hub throughout the final century of the Kingdom of Judah. The village was destroyed just before the Babylonian captivity, possibly due to an Edomite raid. Archaeological evidence suggests it was destroyed around 582 BCE.\nEin Gedi in the Bible\nIn , Ein Gedi is enumerated among the wilderness cities of the Tribe of Judah in the desert of Betharaba, and in , it is prophesied that one day, its coastal location will make it into a fishing village, after the water of the Dead Sea has been made sweet:\n: Fishing nets will be spread from En-gedi to En-eglaim.\nFleeing from King Saul, David hides in the strongholds at Ein Gedi ( and ) and Saul seeks him \"even upon the most craggy rocks, which are accessible only to wild goats\" (). Psalm 63, subtitled a Psalm of David when he was in the wilderness of Judah, has been associated with David's sojourn in the desert of En-gedi.\nIn  Ein Gedi is identified with Hazazon-tamar, Hazezon Tamar, Hatzatzon-Tamar  or Hazezontamar (חַצְצוֹן תָּמָר ḥaṣṣōn tāmār, \"portion [of land] of date palms\"), on account of the palm groves which surrounded it, where the Moabites and Ammonites gathered in order to fight Josaphat, king of Judah. In  Hazazon-tamar is mentioned as being an Amorite city, smitten by Chedorlaomer in his war against the cities of the plain.\nThe Song of Songs () speaks of the \"vineyards of Ein Gedi\".\nThe words of Ecclesiasticus 24:18, \"I was exalted like a palm tree in Cades\" ('en aígialoîs), may perhaps be understood as the palm trees of Ein Gedi.\nSecond Temple period\nA new settlement on the same site was established in the Persian period. Remains from this period include jar handles bearing the letters YHD, indicating that Ein Gedi was part of the Judah province. The settlement was in turn destroyed in the 4th century BCE.\nThis was followed by a new fortified settlement that was probably destroyed in the 1st century BCE. Remains from the Roman period include a bathhouse which would have been used by the garrison on the site.\nDuring the late Hasmonean period, Ein Gedi was likely inhabited by tenant farmers. The residents used cave tombs for multiple burials, continuing the burial practices of Iron Age Israel. Thanks to the region's climate and soil conditions, several wooden coffins dating from the 2nd and 1st centuries BCE, influenced by Hellenistic design, were found complete and exceptionally well-preserved, alongside other wooden grave goods.\nDuring the Herodian period (late first century BCE to early first century CE), Ein Gedi reached its greatest extent, expanding from the mound of Tel Goren to the north across a natural terrace.\nAccording to 1st-century Jewish historian Josephus, Ein Gedi served as the capital of a toparchy, and there were excellent palm trees and balsam growing there. The date palm's fruit and the balsam plant's fragrance were essential to the village's economy. The balsam plant also served as a source for expensive medications. According to Roman author Pliny the Elder, writing in the same period, Ein Gedi \"was second only to Jerusalem in the fertility of its land and its groves of palm-dates\".\nJewish–Roman wars\nDuring Passover in 68 CE, the Sicarii, a radical Jewish faction then occupying Masada, attacked Ein Gedi. According to Josephus, they drove away the men, killed seven hundred women and children, and looted the victims' homes, taking all supplies to Masada. After the war, Roman historian Pliny the Elder wrote that Ein Gedi was, \"like Jerusalem, a heap of ashes\". After the destruction of Jerusalem in 70 CE, control of Ein Gedi's balsam plantations was transferred to the Roman treasury. Around this time, a Roman bath, likely serving the Roman administration, was constructed in Ein Gedi using reused Herodian stones.\nA glimpse into Ein Gedi's status during the period between the two major Jewish revolts can be found in a document dated May 6, 124, known as P.Yadin 11, discovered in Babatha's archive. This Greek-language document refers to Ein Gedi as \"the village of our Lord the Emperor\" (Greek: ), suggesting it was part of the emperor's private property. Additionally, it mentions that the military unit, cohors I milliaria Thracum, was stationed there. Another text from the same archive, dated 127 CE, reveals that by this time, Ein Gedi was no longer the center of a toparchy but had become part of a new one, governed from Jericho.\nDuring the Bar Kokhba revolt (132–136 CE), some inhabitants of Ein Gedi fled to caves in the nearby wilderness, such as the Cave of Letters (located 6 km to the south of the oasis), taking with them everyday vessels, important documents, and personal artifacts. Additionally, house keys were found, which the refugees took after leaving and locking their homes. When archaeologists discovered the cave, they found some of these items along with human remains, including the skeletons of three men, eight women, and six children. Religious literature, including a copy of Psalm 15, was also found, alongside a few Greek-written Bible pieces. From the remains, fifty names of Ein Gedi inhabitants or courtiers sent to them are now known, most of them Hebrew names.\nAlso evident in documents from the Cave of Letters are connections between the Jewish communities of Ein Gedi and Maḥoza (south of the Dead Sea). The Babatha archive, in particular, highlights strong familial ties between these communities, with family members living in both areas, managing property, and marrying across regions. These connections likely formed after the First Jewish Revolt, when Roman attacks forced Ein Gedi's families to seek refuge in Maḥoza, due to its similar environment.\nDuring the suppression of the Bar Kokhba revolt, the settlement was severely damaged.\nLate Roman and Byzantine periods\nEin Gedi was resettled after the catastrophic aftermath of the Bar Kokhba revolt, and continued to exist until the sixth or seventh centuries. After the Bar Kokhba revolt Ein Gedi was reinhabited, initially at a smaller scale with growth into the Byzantine period. The settlement became a \"very large village of Jews,\" as Eusebius testified in the Onomasticon in the early fourth century CE. Archaeologist Gideon Hadas estimated that during the Byzantine period, the population of Ein Gedi was around 1,000 people, who cultivated approximately 1,000 dunams of farmland.\nEin Gedi became famous for growing balsam for perfumes, balsam oil, and medicines. Rabbinic literature mentions balsam plantations from Ein Gedi to Ramata, and the plantations of Ein Gedi are also referenced by Eusebius and Jerome. These plantations disappeared when the village was destroyed several centuries later.\nIn the early 3rd century CE, a synagogue was built in the center of the village. Its remains include a Hebrew and Judeo-Aramaic inscription mosaic now on display at Jerusalem's National Archaeology Campus warning inhabitants against \"revealing the town's secret\" – possibly the methods for extraction and preparation of the much-prized balsam resin, though not stated outright in the inscription – to the outside world.\nIn the mosaic uncovered in the synagogue at the site, a curse is inscribed on anyone who dares to reveal the \"secret of the town\". Most researchers believe that this secret is the method of making balsam oil. Jodi Magness presents a different interpretation, based among other elements on a similar phrase from the Damascus Document from nearby Qumran and the Cairo Geniza. Magness argues that betraying one's own Jewish community to the Gentiles was seen as deserving the death penalty, which could be meted out either by God himself, or by the Jews in the name of God.\nGalen (129 – c. 216 CE) is the only pagan writer who explicitly links the special oil known as Shemen Afarsimon to Ein Gedi.\nDestruction and abandonment\nEin Gedi was destroyed in a fire during the late Byzantine period. According to the archaeologists who excavated the synagogue, the village was destroyed during the early 6th century by Byzantine emperor Justinian as part of his persecution campaign against Jews in his empire. Others claim that the village was destroyed in a Bedouin raid that occurred before the Persian invasion, probably around the late 6th or early 7th century.\nAfter Ein Gedi was destroyed, the cultivation of balsam around the Dead Sea ceased, and it is believed that its Jewish residents, who were now refugees, took the knowledge of cultivating the balsam with them, causing this knowledge to be lost forever.\nLater history\nIn 1838, Edward Robinson reported that the whole area was covered with gardens, mainly cucumbers, all belonging to the Rashaideh tribe. In April 1848, Lieutenant William Francis Lynch led an American expedition down the Jordan River into the Dead Sea, that stopped at Ein Gedi (Ain Jidy).\nEin Gedi synagogue\nAn ancient synagogue was discovered in Ein Gedi, dating from the late Roman and early Byzantine period. It was first discovered in 1966, and excavated between 1970 and 1972. The synagogue's origins are placed in the 3rd century. The building, like the rest of the village, was ultimately destroyed in a conflagration in the early 7th century, with imprints of burnt roof beams remaining visible on the building's floor.\nThe building underwent three major phases of construction and renovation, evolving from a simple hall with geometric mosaic flooring (phase IIIC) into a basilica-style synagogue with expanded features (phase IIIA), including a bema, an ark, colorful mosaics depicting birds (likely crowned cranes alongside francolins or partridges), and menorahs. The western aisle of the prayer hall contained a mosaic inscription, among the longest found in ancient synagogues. It lists biblical figures, zodiac signs, and the months of the year, also presenting dedicatory texts. Among the names mentioned in the inscriptions are Halfi and his three sons (Yosi, Ezrin, and Hezkin), a certain Rabbi Yosi, and Yonathan Hazana (i.e. Jonathan the cantor).\nAmong the most notable discoveries at the site was a burnt Torah scroll, which was found to be the Book of Leviticus.}} This is the only scroll ever found in an ancient synagogue. It was stored within a reed ark alongside silver pendants, oil lamps, coins, glass fragments, and 132 animal bones from kosher species (mainly goat and sheep but also chicken and fish). The bones, showing butchery marks, may represent food remains from religious meals, though their storage in the ark remains unexplained, possibly stored there as genizah due to their perceived sanctity. Additional features included graffiti of ships on plastered walls and pillars, which may have been decorative or votive in nature. Other findings from the synagogue include a metal (probably silver) seven-branch menorah, of a type unique for its time, and singular coins found along with an ark hoard of coins.\nOther archeological findings\nOther findings in the village include walls, pillars, and residential houses and other structures belonging to the village, documenting its eastward and northward expansion. Among those buildings is a mikveh, evidence of the ongoing Jewish presence at the site.\nThe Perfume Street at the east side of the settlement, two unique production facilities were discovered, used in the production of the special oil known as \"Shemen Afarsemon\". Unique lintels and doorposts were discovered at the northern gate, lacking bolts, which indicates that they were not meant for practical, but for halakhic use. Ceramics in various sizes where found inside the village, as well as plain and decorated candlestick lamps.\nBotanical findings\nExcavations at Ein Gedi revealed thousands of plant remains, primarily from the Byzantine period, with some also from the Roman period. Notable findings include seeds from the indigo plant, hoary nightshade, lilac chaste tree, and Abraham's balm, all of which are linked to the cloth and wool industry, suggesting such activities took place in the settlement. Fruit remains included the pits of date palms (of at least two varieties), Arabian jujube, and pomegranate peel. Additionally, Assyrian plums, used to prepare glue for hunting birds, were found. The remains of small-grain wheat, two-rowed barley, and edible legumes such as lentils, faba beans, and broad beans were also discovered.\nResearch history\nAmong the early explorers who studied the site were Edward Robinson in 1865, Claude R. Conder and Herbert Kitchener of the PEF in 1875, Sandel in 1905, William F. Albright in 1925. During this early phase, Tel Goren was identified for the first time as the site of an ancient settlement, and water systems were documented.\nIn 1949, the year after the establishment of Israel, the first excavations at Tel Goren were conducted by Benjamin Mazar, who discovered remains of a Hasmonean citadel and potsherds from earlier periods. Large-scale surveys followed in the 1950s, alongside the transformation of ancient terraces for modern agricultural use. Yohanan Aharoni conducted excavations of Roman-era buildings in 1958, and Naveh explored a large building above the Ein Gedi spring, later identified as the Chalcolithic temple. Large-scale excavations by Benjamin Mazar took place from 1961 to 1965 at Tel Goren, where he uncovered a burial cave, a lime kiln, and a Roman bathhouse, also excavating the Chalcolithic temple.\nFrom 1970 to 1972, Dan Barag of the Hebrew University of Jerusalem and Yosef Porath of the Israel Department of Antiquities excavated the synagogue and adjacent buildings. Starting in the 1980s, Gideon Hadas conducted several salvage excavations on behalf of the Israel Antiquities Authority, preparing the Roman-Byzantine village around the synagogue for public presentation between 1993 and 1995. These excavations uncovered three distinct strata: the first from the Roman period, which was likely destroyed at the end of the Bar Kokhba revolt; the second from the Byzantine period, destroyed in the mid-6th century CE; and the third from Mamluk times, which was dismantled when the area was cleared for modern farming.\nIn 1996–2002, Yizhar Hirschfeld led excavations at the Roman-Byzantine village and the medieval settlement, with re-excavation of the Roman bathhouse. In 1998–99, Hirschfeld systematically excavated what has been called \"the Essenes site\", first discovered by Yohanan Aharoni in 1956. After Hirschfeld’s death, Gideon Hadas continued the excavation, bridging gaps between previous areas of the village.\nTourism and conservation\nThe remains of the ancient settlement of Ein Gedi are part of the En Gedi Antiquities National Park, managed by the Israel Nature Parks Authority. The site has a separate entrance and ticketing system from the nearby En Gedi Nature Reserve, which features the oasis, waterfalls, and walking trails. While the entry ticket for the nature reserve covers access to the antiquities park, visitors can also purchase a separate, lower-priced ticket specifically for the antiquities area.\nSee also\n* Archaeology of Israel\n* Cave of the Swords\n* Qumran\nReferences\nFootnotes\nNotes\nBibliography\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\nFurther reading\n*\n*\n*\n*"
    }
  ]
}