{
  "content": [
    {
      "type": "text",
      "text": "# Eko Heritage Awards\n\n}}\nThe Eko Heritage Awards was established in 2021 and is endorsed by the Lagos State Government. The Award celebrates and appreciates promoters of the Lagos State's cultural heritage which includes individuals and organisations from different sectors of the economy like Fashion, Agriculture, Media and also the Oil and Gas industries. The award is presented by Ivory forte entertainment and it is in two segments; The Honorary award category and the Online Voting Category. Some notable recipients of the Eko Heritage Awards include Makayla Malaka, Nancy Isime, Toyin Lawani, Nasboi, Deyemi Okanlawon, Mercy Aigbe, Kayode Kasum, Osas Ighodaro, Mr. Macaroni, Iyabo Ojo and several others.\nCeremonies\nFirst edition (2021)\nThe maiden edition was launched in 2021.\nSecond edition (2022)\nThe second edition of the Eko Heritage Awards was held on July 10, 2022, at the Lagos Oriental Hotel, over 25 persons received honorary awards some of which include HRM Oba Olufolarin, Hazmat Yusuf, Babajimi Benson, Makayla Malaka, Maria Chike Benjamin, MC perenpe and several others. They were musical performances by Makayla Malaka, Bustapop, Yemilee and Adeyemi and his afrosonic band.  The show also witnessed a beauty pageant, Miss Eko International, which was won by Miss Surulere. One of recognised brand at the second edition was De Sure Fraimz as they emerged Real estate company of the year at the voter's choice category.\nThird edition (2023)\nThe third edition was held on Sunday July 16, 2023 at the Lagos Oriental Hotel. Nollywood actresses Mercy Aigbe and Nancy Isime emerged winners of Eko leadership award and Eko Most Stylish Personality respectively. Popular content creator Moyosoreoluwa emerged media personality of the year, content creator Nasboi emerged social content creator of the year. and Ashmusy also emerged winner at the third edition. Some of the brands that emerged winners at the third edition is a traveling agency, TMT Travels and tours Limited, they emerged the best distinctive traveling agency of the year. Mr Ideal Nigeria also emerged Best Male pageant brand.\nCategories\nThe following are the current categories as of 2024\nHonorary award categories\n* Eko distinctive traditional ruler of the year\n* Eko most supportive traditional ruler of the year\n* Eko traditional ruler of the year\n* Eko outstanding white cap chief of the year\n* Eko distinctive customary chief of the year\n* Eko distinctive cultural ambassador of the year\n* Eko youth leader of the year\n* Eko young personality of the year\n* Eko most stylish personality of the year\n* Eko distinctive personality of the year\n* Eko entrepreneur of the year\n* Eko youth mentor of the year\n* Eko innovative mentor of the year\n* Eko outstanding government official of the year\n* Eko leadership award\n* Eko distinctive local government chairman of the year\n* Eko distinctive senator of the year\n* Eko distinctive house of assembly member of the year\n* Eko political leader of the year\n* Eko humanitarian award\nOnline voting award categories\n* Eko fashion designer of the year\n* Eko pageant king of the year\n* Eko pageant queen of the year\n* Eko emerging catwalk coach of the year\n* Eko teen queen of the year\n* Eko pageant kid of the year\n* Eko celebrity kid of the year\n* Eko Kid model of the year\n* Eko Kid excellence award\n* Eko Kid influencer of the year\n* Eko brilliant kid of the year\n* Eko multi talented kid of the year\n* Eko fashion influencer of the year\n* Eko events planner of the year\n* Eko next rated actor of the year\n* Eko actor of the year\n* Eko music producer of the year\n* Eko movie producer of the year\n* Eko breakout artist of the year\n* Eko OAP of the year\n* Brand influencer of the year\n* Eko radio station of the year\n* Eko TV station of the year\n* Eko social content creator of the year\n* Eko media personality of the year\n* Eko events centre of the year\n* Eko magazine of the year\n* Eko disc jockey of the year\n* Eko makeup artist of the year\n* Eko emerging fashion designers\n* Eko fashion brand of the year\n* Eko emerging fashion brand\n* Eko emerging makeup artist of the year\n* Eko tourism brand of the year\n* Eko travelling agency of the year\n* Eko real estate brand of the year\n* Eko realtor of the year\n* Eko skincare/spa brand of the year\n* Eko recreational spot of the year\n* Eko emerging entrepreneur of the year\n* Eko cosmetics brand of the year\nReferences"
    }
  ]
}