{
  "content": [
    {
      "type": "text",
      "text": "# El Dorado Confederate Monument\n\n| locmapin              = Arkansas#USA\n| map_caption  = Location in Arkansas##Location in United States\n| built                 =\n| architect             =\n| architecture          = Classical Revival\n| added                 = April 26, 1996\n| area                  = less than one acre\n| mpsub                 =\n| refnum                = 96000463\n| nrhp_type2            = cp\n| nocat                 = yes\n| designated_nrhp_type2 = August 21, 2003\n| partof                = El Dorado Commercial Historic District\n| partof_refnum         = 03000773\n}}\nThe El Dorado Confederate Monument is located on the grounds of the Union County Courthouse in El Dorado, Arkansas, near the corner of North Main and South Washington Streets.  It consists of a statue of a Confederate Army soldier in mid-stride, mounted on top of a temple-like structure supported by four cannon-shaped Ionic columns.  The columns support a lintel structure bearing inscriptions on three sides, above which is a tiered roof with cannonballs at the corners.  The temple structure is  high, and  square; the statue measures  by  by .  Both the statue and the temple are constructed of gray/blue striated marble.\nThe monument was built in 1910 at a cost of over $2,800, and was paid for by the local chapter of the United Daughters of the Confederacy.  It is believed to be the first fountain-style Confederate monument in the South.  The front (south) side of the monument is inscribed \"CSA 1861 - 1865 / ERECTED BY THE HENRY G. BUNN CHAPTER / UNITED DAUGHTERS OF THE CONFEDERACY / 1909\".  The north side is inscribed \"'TRUTH CRUSHED TO EARTH SHALL RISE AGAIN.' / 'EVEN DEATH CANNOT SEVER THE CORDS OF MEMORY.'\"  The western lintel reads \"'IN HONOR OF THE CONFEDERATE SOLDIERS / OF UNION COUNTY, ARK.'\".  The eastern lintel has a pair of crossed swords on it.\nThe monument was listed on the National Register of Historic Places in 1996.  It was included in the El Dorado Commercial Historic District in 2003.\nThe statue was one of several monuments that became the center of controversy during the 2020 Black Lives Matter protests.\nSee also\n*National Register of Historic Places listings in Union County, Arkansas\nReferences"
    }
  ]
}