{
  "content": [
    {
      "type": "text",
      "text": "# El Matadero (Fear the Walking Dead)\n\n| director     = Stefan Schwartz\n| writer       = Alan Page\n| length       = 45 minutes\n| music        =\n| guests       = * Michael Greyeyes as Qaletaqa Walker\n* Edwina Findley as Diana\n* Justin Rain as Lee\n* Miguel Pérez as El Matarife\n| prev         = This Land Is Your Land\n| next         = Things Bad Begun\n| episode_list = List of Fear the Walking Dead episodes\n| season_article = Fear the Walking Dead (season 3)\n}}\n\"El Matadero\" (Spanish for The Slaughterhouse), is the fourteenth episode of the third season of the post-apocalyptic horror television series Fear the Walking Dead, which aired on AMC on October 8, 2017.\nThis episode marks the final appearance of Mercedes Mason (Ofelia Salazar) who died after she was bitten in \"This Land Is Your Land\".\nThe episode's title is a reference to the classic short story El Matadero (The Slaughter Yard) by the Argentine writer Esteban Echeverría.\nPlot\nOfelia falls off the water truck and the others in the group see  that she has been bitten. Madison promises that she'll see her father, sells half their weapons so she can rest in the bazaar and spends more to keep her comfortable. Strand criticizes her for wasting resources while a grieving Walker finds honor in observing her last wish. Madison and Walker look after Ofelia. Madison manages to reach Daniel, but Ofelia dies just as Daniel arrives. Nick goes on a binge of drugs and drinking, wrangling Troy into joining him, eventually wading through a group of walking dead when Nick confesses that he can't go with Madison. The next morning, Daniel agrees to let Madison's group come to the dam but Nick and Troy decide to stay at the bazaar. Elsewhere, Alicia's scavenging attracts the dead who are killed by Diana. The two women initially threaten each other but decide to share the food Alicia found.\nReception\nmade her final regular appearance as Ofelia Salazar in this episode.]]\n\"El Matadero\", received positive reviews from critics. On Rotten Tomatoes, \"El Matadero\" garnered an 80% rating, with an average score of 7.45/10 based on 9 reviews.\nMatt Fowler of IGN gave \"El Matadero\" an 8.2/10.0 rating, stating; \"Fear the Walking Dead more solidly found its tone and voice this season by embracing the arid landscape, ramping up the human-on-human conflict, and rallying around Kim Dickens' anti-hero mom, Madison, as the driving character.\"\nRatings\n\"El Matadero\" was seen by 2.26 million viewers in the United States on its original air date, below the previous episodes rating of 2.38 million.\nReferences"
    }
  ]
}