{
  "content": [
    {
      "type": "text",
      "text": "# El Pueblo de Los Ángeles Historical Monument__disambig_1\n\n| locmapin = United States Los Angeles Central\n| nocat = yes\n| area =\n| architect =\n| architecture =\n| added = November 3, 1972\n| refnum=72000231\n| designated_other1 = Los Angeles\n| designated_other1_date = April 1, 1970 (as 'Plaza Park')\n| designated_other1_number = 64\n}}\nEl Pueblo de Los Ángeles Historical Monument, also known as Los Angeles Plaza Historic District and formerly known as El Pueblo de Los Ángeles State Historic Park, is a historic district taking in the oldest section of Los Angeles, known for many years as El Pueblo de Nuestra Señora la Reina de los Ángeles del Río de Porciúncula.  The district, centered on the old plaza, was the city's center under Spanish (1781–1821), Mexican (1821–1847), and United States (after 1847) rule through most of the 19th century. The 44-acre park area was designated a state historic monument in 1953 and listed on the National Register of Historic Places in 1972.\nHistoric images\nFile:LA founding pueblo marker detail.jpg|Inscription on historical marker \"El Pueblo de Nuestra Señora La Reina de Los Ángeles - Felipe de Neve - September Fourth 1781\"\nImage:LosAngeles-Plaza-1869.jpg|Plaza in 1869\nFile:LA-plaza-1876.jpg|Los Angeles Plaza (1876)\nFile:Lugo Adobe housing Leeching Hung and Co.png|The Lugo Adobe (built 1840s, demolished 1950s) long anchored the east side of the Plaza\nFile:Panoramic view of the Los Angeles Plaza, looking west, ca.1905 (CHS-5081).jpg|Los Angeles Plaza (c. 1905)\nImage:Old Plaza, 1930.jpg|The Old Plaza around 1930\nHistory\nFounding of the Pueblo\nA plaque across from the Old Plaza commemorates the founding of the city.  It states: \"On September 4, 1781, eleven families of pobladores (44 persons including children) arrived at this place from the Gulf of California to establish a pueblo which was to become the City of Los Angeles.\nAt least ten (and up to 26) of the 44 were Black.\nSpain also settled the California region with a number of African and mulatto Catholics, including at least ten (and up to 26) of the recently re-discovered Los Pobladores, the 44 founders of Los Angeles in 1781.\nThis colonization ordered by King Carlos III was carried out under the direction of Governor Felipe de Neve.\"  The small town received the name El Pueblo de Nuestra Señora Reina de los Ángeles sobre El Río Porciúncula, Spanish for The Town of Our Lady Queen of the Angels on the Porciúncula River.\nThe original pueblo was built to the southeast of the current plaza along the Los Angeles River and near the Tongva village of Yaanga. Excavations at the church site \"recovered beads and other artifacts used during the period of mission recruitment.\" In 1815, a flood washed away the original pueblo, and it was rebuilt farther from the river at the location of the current plaza.\nGrowth of the Pueblo\nDuring its first 70 years, the Pueblo grew slowly from 44 in 1781 to 1,615 in 1850—an average of about 25 persons per year.  During this period, the Plaza Historic District was the Pueblo's commercial and social center.\nIn 1850, shortly after California became part of the United States, Los Angeles was incorporated as a city.  It experienced a major boom in the 1880s and 1890s, as its population grew from 11,200 (1880) to 50,400 (1890) and 102,500 in 1900.  As the City grew, the commercial and cultural center began to move south away from the Plaza, along Spring Street and Main Street.\nIn 1891, the Los Angeles Times reported on the shifting city center:\nThe geographical center of Los Angeles is the old plaza, but that has long since ceased to be the center of population. ... While at one time most of the population was north of the plaza, during the past ten years 90 per cent of the improvements have gone up in the southern half of the city. ... These are solid facts which it is useless to attempt to ignore by playing the ostrich acts and level-headed property holders in the northern part of the city are beginning to ask themselves seriously what is to be done to arrest or at least delay the steady march of the business section from the old to the new plaza on Sixth Street ...\nPreservation as a historic park\nThe  surrounding the Plaza and constituting the old pueblo have been preserved as a historic park roughly bounded by Spring, Macy, Alameda and Arcadia streets, and Cesar Chavez Boulevard (formerly Sunset Boulevard).  There is a visitors center in the Sepúlveda House. A volunteer organization known as Las Angelitas del Pueblo provides tours of the district.\nThe district includes the city's oldest historic structures clustered around the old plaza.  The buildings of historical significance include Nuestra Señora La Reina de Los Ángeles Church (1822), Avila Adobe (1818) (the city's oldest surviving residence), the Olvera Street market, Pico House (1870), and the Old Plaza Fire Station (1884).  Four of the buildings have been restored and are operated as museums.\nIn addition, archaeological excavations in the Pueblo have uncovered artifacts from the long indigenous period before European contact and colonization. These include animal bones, household goods, tools, bottles, and ceramics.\nThe district was designated as a state monument in 1953, and listed on the National Register of Historic Places in 1972.  These steps, however, did not prevent the demolition, in the decades to come, of numerous historic and very old buildings, particularly those that once formed the eastern edge of the Plaza.\nContemporary images\nImage:Old Plaza (Los Angeles).jpg|Musicians performing at the Plaza\nFile:MNSR de LA entryway 027.jpg|Plaza Church in early 2007.\nImage:Old Plaza Firhouse (Los Angeles).jpg|Old Plaza Firehouse\nImage:Garnier Building (Los Angeles).jpg|Garnier Building\nFile:LA founding historical mural.jpg|Mural shows important events\nFile:Plaza Methodist Church.jpg|Eugene Biscailuz Building and former Methodist Church HQ, now Mexican Cultural Center\nFile:Sanchez Street, Los Angeles.jpg|Sanchez Street, which runs south from the center of the Plaza's south side\nFile:Brunswig Building.jpg|Brunswig Building\nFile:Equestrian Statue of Antonio Aguilar, Plaza de Los Angeles.jpg|Equestrian statue of Antonio Aguilar\nMajor sites\nThe Plaza\nAt the center of the Historic District is the plaza . It was described in 1982 as \"the focal point\" of the state historic park, symbolizing the city's birthplace and \"separating Olvera Street's touristy bustle from the Pico-Garnier block's empty buildings.\" Built in the 1820s, the plaza was the city's commercial and social center. It remains the site of many festivals and celebrations. The plaza has large statues of two figures in the city's history, including one of Charles III of Spain, the monarch who ordered the founding of the Pueblo de Los Ángeles in 1780, and another of Felipe de Neve, the Spanish Governor of the Californias who selected the site of the Pueblo and laid out the town. In addition to this, the plaza is dedicated to commemorating the original forty-four settlers (Los Pobladores), and the four soldiers who accompanied them. A large plaque listing their names was erected in the plaza, and later plaques dedicated to the individual eleven families were placed in the ground encircling the gazebo in the center of the plaza.\nBuildings on the Plaza\nLa Placita Church\nThe parish church in the Plaza Historic District, known as La Iglesia de Nuestra Señora la Reina de Los Ángeles (The Church of Our Lady the Queen of the Angels), was founded in 1814. The structure was completed and dedicated in 1822. The present church, which replaced it, was built in 1861. The church was one of the first three sites designated as Historic Cultural Monuments by the City of Los Angeles, and has also been designated as a California Historical Landmark.\nOld Plaza Firehouse\nThe Old Plaza Firehouse is the oldest firehouse in Los Angeles. Built in 1884, it operated as a firehouse until 1897. The building was thereafter used as a saloon, cigar store, poolroom, \"seedy hotel\", Chinese market, \"flop house\", and drugstore.  The building was restored in the 1950s and opened as a firefighting museum in 1960.\nLos Angeles Plaza Park\nLos Angeles Plaza Park (formerly known as Father Serra Park) is an open area within the plaza. It is the site of the demolished Lugo Adobe. In June 2020 protestors toppled a statue of Father Junípero Serra, due to Serra's role during the colonization of California.\nBuildings on Olvera Street\nOlvera Street, known for its Mexican marketplace, was originally known as Wine Street. In 1877, it was extended and renamed in honor of Judge Augustín Olvera, the first ever elected county judge in Los Angeles.  Many of the Plaza District's contributing historic buildings, including the Avila Adobe and Sepulveda House, are located on Olvera Street.  In 1930, it was adapted by local merchants into the colorful marketplace that operates today.\n}}\nBuildings on Main Street\nBuildings on Los Angeles Street\nHistorical Mural painting\nVarious historical events of Los Angeles are depicted in a colourful trompe-l'œil mural painting.\nPart of historic trails\nJuan Bautista de Anza National Historic Trail\nThe Pueblo de Los Ángeles is participating site of the Juan Bautista de Anza National Historic Trail, a National Park Service area in the United States National Trails System. A driving tour map and list of sites by County can be used to follow the trail.\nOld Spanish National Historic Trail\nThe Pueblo de Los Ángeles was the final destination of the Old Spanish Trail. It is a site on the Old Spanish National Historic Trail, which was established in 2002.  Museums, historic sites, and markers along the Old Spanish Trail identify sites from Santa Fe to Los Angeles. The visitor center of the Avila Adobe offers a National Park Passport Stamp for the trail.\nHistoric map\nSee also\n* List of Registered Historic Places in Los Angeles\n*History of Los Angeles\n*Fort Moore Pioneer Memorial\n*LA Plaza de Cultura y Artes\n*Mariachi Plaza\n*Pueblo de Los Angeles\nReferences\nExternal links\n* [http://elpueblo.lacity.org El Pueblo de Los Angeles Historical Monument] - official site\n* [https://web.archive.org/web/20080617202556/http://www.lasangelitas.org/buildings.htm Las Angelitas del Pueblo: The Docents of El Pueblo de Los Angeles]\n* [https://web.archive.org/web/20080730041849/http://www.olvera-street.com/html/olvera_street.html The Olvera Street website]\n*[https://www.nps.gov/juba/index.htm official National Park Service Juan Bautista de Anza National Historic Trail website]"
    }
  ]
}