{
  "content": [
    {
      "type": "text",
      "text": "# Elaine Howard Ecklund\n\nFaculty  The People of Rice  Rice University |url=https://profiles.rice.edu/faculty/elaine-howard-ecklund |access-date=2023-10-27 |website=profiles.rice.edu |language=en}}  University at Buffalo, SUNY, 2006-2008\n| patrons           =\n| alma_mater        = Rice University, postdoctoralCornell University, BS, MA, PhD\n| thesis_title      =\n| thesis_url        =\n| thesis_year       =\n| doctoral_advisor  =\n| academic_advisors =\n| doctoral_students =\n| notable_students  =\n| known_for         = Social Sciences and Religion\n| author_abbrev_bot =\n| author_abbrev_zoo =\n| influences        =\n| influenced        =\n| awards            =\n| signature_alt     =\n| website           =\n| footnotes         =\n| spouse            =\n}}\nElaine Howard Ecklund (born 16 February 1973) is a published author and professor of sociology at Rice University. She is also the director of the Boniuk Institute for Religious Tolerance at Rice, a Rice Scholar at the James A. Baker III Institute for Public Policy, and the president of the Religious Research Association. Her research focuses on institutional change in the areas of religion, immigration, science, medicine, and gender.\nCareer\nNotable Publications\nIn 2006, Ecklund published Korean American Evangelicals: New Models for Civic Life, an examination of the civic narratives, practices, and identities of second-generation Korean American evangelicals. The book looks at how Korean Americans use religion to negotiate civic responsibility and create racial and ethnic identity. The work compares the views and activities of second-generation Korean Americans in two different congregational settings: one ethnically Korean and the other multi-ethnic. The book was reviewed in several academic journals.\nEcklund's research project, Religion among Scientists in an International Context (RASIC) surveyed 9,422 scientists from France, Hong Kong, India, Italy, Taiwan, Turkey, the United Kingdom, and the United States, and included qualitative interviews with 609 of these scientists. In 2016 Ecklund, along with co-authors, published \"Religion among Scientists in International Context: A New Study of Scientists in Eight Regions\" in the journal Socius: Sociological Research for a Dynamic World.\nIn 2010, Ecklund published Science vs. Religion: What Scientists Really Think, a survey of approximately 1,700 scientists with 275 interviews. In Science vs. Religion, Ecklund writes, “Much of what we believe about the faith lives of elite scientists is wrong. The 'insurmountable hostility' between science and religion is a caricature - a thought-cliché, perhaps useful as a satire on groupthink, but hardly representative of reality.\"\nEcklund found that at least 50% of scientists surveyed considered themselves to have religious traditions. Some of Ecklund's other findings about scientists' self-reported spiritual and religious belief include the following:\n* Some 34% of scientists were atheists (12% of whom also called themselves spiritual), 30% were agnostic, 27% had some belief in God, and 9% of scientists said they had no doubt of God's existence. While more atheistic than the rest of the U.S. population, the research demonstrates that about a third (36%) of these scientists maintain some belief in God, a smaller proportion than the approximately 90% in the general American population.\n* Most scientists who expressed some belief in God considered themselves to be “religious liberals.”\n* Some self-identified atheist scientists still considered themselves to be \"spiritual.”\n* Religious scientists reported that their religious beliefs affected the way they think about the moral implications of their work.\nEcklund theorizes that scientists who believe in God may live \"closeted lives\" to avoid discrimination. Others are what she calls \"spiritual entrepreneurs,” seeking creative ways to work with the tensions between science and faith outside the constraints of traditional religion. Ecklund reveals how scientists&mdash;believers and skeptics alike&mdash;struggle to engage the religious students in their classrooms. She argues that many are searching for \"boundary pioneers\" to cross the picket lines separating science and religion and overcome the \"conflict thesis.”\nEcklund has published over 100 articles in peer-reviewed social scientific, medical, and other journals. In 2018, she delivered the Gifford Lectures on Science and Religion in Global Public Life at the University of Edinburgh.\nCriticism\nJason Rosenhouse, an associate professor of mathematics at James Madison University, has been critical of some of Ecklund's summaries and conclusions. He contests her claim that \"as we journey from the personal to the public religious lives of scientists, we will meet the nearly 50 percent of elite scientists who are religious in a traditional sense\" (page 6, Ecklund, 2010). Rosenhouse argues that \"religious in a traditional sense\" is never clearly defined. He suggests that she may be referring to her finding that 47% of scientists affiliate themselves with some religion but says that calling them \"religious in a traditional sense\" is therefore misleading because only 27% of scientists have any belief in a God, even though many more than that associate with religious cultures.\nReligion and Public Life Program\nEcklund founded and served as the director of the Religion and Public Life Program (RPLP) at Rice University from 2010 to 2022. The RPLP was launched in 2010 as part of the Social Sciences Research Institute at Rice University.\nPublished works\n*Ecklund, Elaine Howard, and David R. Johnson (2021). Varieties of Atheism in Science. New York, NY: Oxford University Press. .\n*Ecklund, Elaine Howard (2020). Why Science and Faith Need Each Other: Eight Shared Values That Move Us beyond Fear. Grand Rapids, MI: Brazos Press. .\n*Ecklund, Elaine Howard, David R. Johnson, Brandon Vaidyanathan, Kirstin R. W. Matthews, Steven W. Lewis, Robert A. Thomson, Jr., and Di Di (2019). Secularity and Science: What Scientists Around the World Really Think About Religion. New York: Oxford University Press. .\n*Ecklund, Elaine Howard, and Christopher P. Scheitle (2017). Religion vs. Science: What Religious People Really Think. New York: Oxford University Press. .\n*Ecklund, Elaine Howard, and Anne E. Lincoln (2016). [https://books.google.com/books?id=VwjMCgAAQBAJ&dq=failing+families+failing+science&pg=PP1 Failing Families, Failing Science: Work-Family Conflict in Academic Science]. New York: New York University Press. .\n*\n*\nSee also\n* Relationship between religion and science\nReferences\nExternal links\n*\n* [https://web.archive.org/web/20091119140759/http://sociology.rice.edu/Content.aspx?id=117 Ecklund's faculty listing, Rice University Department of Sociology]\n* [https://web.archive.org/web/20161110045222/https://reli.rice.edu/Content.aspx?id=2147483720 Ecklund's faculty affiliate listing, Rice University Department of Religion]\n* [http://www.bakerinstitute.org/experts/elaine-howard-ecklund/ Ecklund's profile at the James A. Baker III Institute for Public Policy]\n* [http://rplp.rice.edu/ Religion and Public Life Program website]"
    }
  ]
}