{
  "content": [
    {
      "type": "text",
      "text": "# Electronic parking brake__disambig_2\n\nin a Volkswagen Golf Variant]]\nAn electronic parking brake (EPB), also known as an electric parking brake or electric park brake, is an electronically controlled parking brake, whereby the driver activates the holding mechanism with a button and the brake pads are electrically applied to the rear wheels of the car. This is accomplished by an electronic control unit (ECU) and an actuator mechanism. There are two mechanisms that are currently in production, Cable puller systems and Caliper integrated systems.  EPB systems can be considered a subset of Brake-by-wire technology.\nFirst introduced on the 2001 Lancia Thesis, electronic parking brakes have since appeared in a number of vehicles.\nFunctionality\nApart from performing the basic vehicle holding function required of park brakes, the EPB systems provide other functions like automatic release of the park brakes when the driver presses the accelerator or slips the clutch, and re-clamping using additional force on detection of vehicle motion. Further, the hill-hold function, which applies brakes to prevent roll-back when pulling away on a gradient, can also be implemented using the EPB.\nHistory\nDespite electric parking brake systems being a relatively new characteristic in the preponderance of modern production vehicles, many older concept vehicles have also implemented the feature. During the 1980s, many companies across the industry, such as Mazda, BMW, and Volkswagen, began to truly experiment with the idea of a fully electric, driver actuated parking brake. Volkswagen in particular was able to first realize this in the form of the Volkswagen Futura concept vehicle, which was presented at the Frankfurt Motor Show in October 1989.\nThe electric parking brake was first introduced in production vehicles with the emergence of the Lancia Thesis saloon car in 2001. BMW began to make use of EPB technology that same year, offering it as an option in their flagship saloon car, the BMW 7 Series. Followed by Ford Motor Companies Lincoln Division's refresh of the Lincoln LS Sedan in its 2003 MY.  Other German automakers such as Audi and Volkswagen soon followed suit in the form of the Audi A8 (2006) and Volkswagen Passat (2008). The use of EPBs has only grown in popularity since then, eventually finding its way into all classes of vehicles. In some markets, the majority of new cars sold feature electric parking brakes as standard equipment.\nImplementation\nThe implementation of the control logic for the actuators is carried out by either using a stand-alone ECU or by integrating it in the ECU for electronic stability control.\nStandards\nThe design of electric park brakes in the United States should be compliant with:\n*FMVSS 105\n*FMVSS 135\n*ECE 13H\nReferences"
    }
  ]
}