{
  "content": [
    {
      "type": "text",
      "text": "# Electoral Count Reform and Presidential Transition Improvement Act of 2022\n\n, Division P\n| cite statutes at large = 136 Stat. 5233\n| acts repealed =\n| sections amended = ,  note\n| leghisturl = https://www.congress.gov/bill/117th-congress/senate-bill/4573/actions\n| introducedin = Senate\n| introducedbill = S.4573\n| introducedby = Susan Collins (R–ME)\n| introduceddate = July 20, 2022\n| committees = United States Senate Committee on Rules and Administration\n| passedbody1 =\n| passedvote1 =\n| passeddate1 =\n| passeddate2 =\n| passedbody2 =\n| passedvote2 =\n| agreedbody3 = Senate\n| agreeddate3 = December 22, 2022\n| agreedvote3 = [https://www.senate.gov/legislative/LIS/roll_call_votes/vote1172/vote_117_2_00421.htm 68–29] as Division P of the Consolidated Appropriations Act, 2023\n| agreedbody4 = House\n| agreeddate4 = December 23, 2022\n| agreedvote4 = [https://clerk.house.gov/Votes/2022549 225–201–1] as Division P of the Consolidated Appropriations Act, 2023\n| passedbody4 =\n| passeddate4 =\n| passedvote4 =\n| signedpresident = Joe Biden as part of the Consolidated Appropriations Act, 2023\n| signeddate = December 29, 2022\n}}\nThe Electoral Count Reform and Presidential Transition Improvement Act of 2022 is a revision of the Electoral Count Act of 1887, adding to procedures set out in the Constitution of the United States for the counting of electoral votes following a presidential election. It also amended the Presidential Transition Act.\nThe Act was passed on December 23, 2022, by the 117th Congress, and signed into law by President Joe Biden as Division P of the Consolidated Appropriations Act, 2023.\nBackground\nThe act is intended to prevent a repeat of the January 6 United States Capitol attack following President Trump's refusal to concede the 2020 election. It mainly focuses on preventing the direct cause of this attack, Trump's fake elector plan legitimized by disinformation about the President of the Senate's alleged ability to reject state elector slates. In the aftermath of his election loss, Trump conspired with his campaign team to submit documents in several states (all of which had been won by Biden) which falsely claimed to be legitimate electoral certificates for President Trump and Vice President Mike Pence. After the submission of these documents, the Trump campaign intended that the presiding officer of the United States Senate, either President of the Senate Pence or President pro tempore Chuck Grassley, would claim to have the unilateral power to reject electors during the January 6, 2021 vote counting session; the presiding officer would reject all electors from the several states in which the Trump campaign had submitted false documents, leaving 232 votes for Trump and 222 votes for Biden, thereby overturning the election results in favour of Trump. The plans for January 6 failed to come to fruition after Pence refused to follow the campaign's proposals. These events, culminating with the attack during the vote counting session, led to a delay in the transition to the Biden administration. The act addressed issues such as these by allowing some transition to begin even when an election result is unclear, and clarified the vice president's role in the certification of electoral votes.\nLegislative history\nThe bill was sponsored by Senator Susan Collins of Maine and Senator Joe Manchin of West Virginia in July 2022. After five months of negotiations, it became Division P of the Consolidated Appropriations Act, 2023, which passed 68–29 in the Senate on December 22, 2022, and 225–201 in the House the following day. On December 29, 2022, it was signed into law by President Joe Biden.\nProvisions\nThe law includes multiple revisions to the voting, certification, counting, and transition process.\nState procedures\nThe law identifies the governor – or, in the case of Washington, D.C., the district's mayor – as responsible for submitting certificates of ascertainment, unless otherwise specified by state laws or constitutions. In addition, a certificate that was revised as ordered by a state or federal court judgment before the meeting of electors supersedes all previous certificates.\nUnder the law, states that select electors by popular vote can modify the period of voting only in the case of \"extraordinary and catastrophic\" events. The modification may occur only according to laws that were passed before the voting period.\nThe date on which the electors convene to vote also changes under the law, to the \"first Tuesday after the second Wednesday in December\". It was previously one day earlier.\nReview of claims brought by candidates\nAn action brought by an aggrieved candidate for president or vice president is guaranteed an expedited review.\nAccording to the law, the venue for such an action shall be the United States district court of the federal judicial district where the state capital is located. The action shall be heard by a three-judge judicial panel consisting of two circuit court of appeals judges and one district court judge. The court shall expedite the disposition of the action, in accordance with deadlines established by the law. Any appeal from the court's judgment may be heard directly by the Supreme Court on an expedited basis, and the court's final order on remand must occur at the latest on the day before the electors' meeting.\nCongressional proceedings\nThe law clarifies that the vice president's role in the counting of the electoral votes is \"solely ministerial,\" with no power to \"determine, accept, reject, or otherwise adjudicate or resolve disputes over the proper list of electors, the validity of electors, or the votes of electors.\"\nAny objection made by senators or representatives during the counting of the electoral votes must be made in writing and signed by at least one-fifth of the senators and one-fifth of the members of the House of Representatives. Previously, an objection required the signatures of only one member of each chamber.\nThe law also limits the grounds for an objection to one of the following:\n# The electors of a state were not lawfully certified\n# An elector's vote was not \"regularly given\"\nTransition funds\nThe law allows multiple \"apparent successful candidates\" to receive federal presidential transition funds if more than one candidate has not conceded five days after the election. It provides guidelines for the administrator of the General Services Administration to determine when and to whom funds should be released.\nReferences\nExternal links\n*\n*\n*,"
    }
  ]
}