{
  "content": [
    {
      "type": "text",
      "text": "# Eleventh Battle of the Isonzo__disambig_1\n\n|combatant2=|}}\n|commander1  =  Luigi Cadorna |  Luigi Capello|  Emanuele Filiberto di Savoia}}\n|commander2  =  Arthur Arz von Straußenburg|  Svetozar Boroević von Bojna}}\n|units1     =  Second Army| Third Army}}\n|units2     =  Army Group Boroević\n|strength1=\n|strength2=\n|casualties1=158,000 casualties:\n|casualties2=115,000 casualties:\n}}\nThe Eleventh Battle of the Isonzo was a World War I battle fought by the Italian and Austro-Hungarian Armies on the Italian Front between 18 August and 12 September 1917.\nBackground\nOn the Soča (Isonzo) River, Luigi Cadorna, the Italian Chief of Staff, concentrated three quarters of his troops: 600 battalions (52 divisions) with 5,200 guns.\nBattle\nThe attack was carried forth from a front from Tolmin (in the upper Isonzo valley) to the Adriatic Sea. The Italians crossed the river at several points on temporary bridges, but the main effort was exerted on the Banjšice Plateau, whose capture was to further the offensive and break the Austro-Hungarian lines in two segments, isolating the strongholds of Mount Saint Gabriel and Mount Hermada.\nAfter fierce and deadly fightings, the Italian Second Army, led by General Capello, pushed back Boroević's Isonzo Armee, conquering the Banjšice Plateau and Sveta Gora. Other positions were taken by the Duke of Aosta's Third Army. However, Mount Saint Gabriel and Mount Hermada turned out to be impregnable, and the offensive wore out.\nThe battle was a significant tactical victory for the Italians, who conquered the Banjšice Plateau (Bainsizza) and made gains of about 10–12 kilometers. The Austro-Hungarians, exhausted and unable to sustain another attack, were on the verge of collapse. This led them to request German intervention in the area of the Isonzo. The Italians, however, could not find the resources necessary for another assault, even though it might have been the decisive one. Moreover, the bloodbath left the Italian Second Army (until then the most successful of the Italian Armies) split in two parts across the Soča (Isonzo), a weak point that was exploited by the Germans and Austrians in the subsequent Battle of Caporetto.\nTo commemorate the participation of the Royal Bavarian Infantry Lifeguards Regiment, Georg Fürst wrote the March \"Isonzo-Marsch\". The Italians fired 5.5 million artillery shells during the battle, including poison gas shells.\nSee also\nReferences\nFurther reading\n*\nExternal links\n*[http://www.firstworldwar.com/battles/isonzo11.htm Eleventh Battle of the Isonzo]\n*[http://www.firstworldwar.com/battles/isonzo.htm FirstWorldWar.Com: The Battles of the Isonzo, 1915-17]\n*[http://www.firstworldwar.com/maps/italianfront.htm Battlefield Maps: Italian Front]\n*[http://www.worldwar1.com/itafront/isonzo11.htm 11 battles at the Isonzo]\n*[https://web.archive.org/web/20071027160636/http://www.potimiruvposocju.si/ The Walks of Peace in the Soča Region Foundation]. The Foundation preserves, restores and presents the historical and cultural heritage of the First World War in the area of the Isonzo Front for the study, tourist and educational purposes.\n*[https://web.archive.org/web/20071119143924/http://www.kobariski-muzej.si/ang/razstave.html The Kobarid Museum]\n*[http://drustvo-soskafronta.si/ Društvo Soška Fronta ]\n*[http://prohereditate.com/en/ Pro Hereditate - extensive site ]"
    }
  ]
}