{
  "content": [
    {
      "type": "text",
      "text": "# Eli Schwartz\n\nEliezer (Eli) Schwartz (Hebrew: אליעזר שוורץ; born in Jerusalem, Israel) MD, DTMH is an Israeli physician, known for his specialty in tropical diseases and travel medicine. He is a founding member of the International Society of Travel Medicine (ISTM) and served as chair of its Professional Education Committee. Schwartz is currently president of the Asia Pacific Travel Health Society (APTHS) as well as the Israel Society for Parasitology, Protozoology and Tropical Diseases (ISPPTD). At clinical practice, he is head of the Center for Travel Medicine and Tropical Diseases at the Sheba Medical Center. He is also a professor at the Sackler Faculty of Medicine, Tel Aviv University.\nBiography\nBorn in Jerusalem, Israel, he completed his MD at the Tel Aviv University.  He later traveled to London to receive a DTMH at the London School of Hygiene and Tropical Medicine.\nSchwartz specialises in tropical diseases and travel medicine since 1980. He has lived in Nepal for two years and worked in the CIWEC Clinic Travel Medicine Center in Kathmandu, and travels to many countries in Asia and Africa, thus gaining much expertise. He is a professor at the Sackler Faculty of Medicine, Tel Aviv University, where he guides doctoral student, among others. He has published over 200 scientific papers in his scientific field.\nIn 1999 he was awarded the Vincenzo Marcolongo Memorial Lectureship.\nProfessional organizations\nSchwartz is a founding member of the International Society of Travel Medicine, has been part of its executive committee (2003–2007) and served as chair of its Professional Education Committee. He is currently member of the Continuing Professional Development Committee and the Examination Committee. Schwartz is member of the editorial board of the Journal of Travel Medicine  In the GeoSentinel global surveillance network of the ITSM and the CDC, he is the Israeli site director.\nHe is also president of the Asia Pacific Travel Health Society (APTHS). In Israel he is president of the Israel Society for Parasitology, Protozoology and Tropical Diseases (ITPPTD).\nOther activities\nSchwartz is a consultant for the Israeli Ministry of Foreign Affairs as well as various governments in tropical countries. In this position, he has treated UN troops in Angola, as well as the leader of Eritrea, thus serving Israel's diplomatic relations as well as his patients. He has also worked at the Cambodian refugee camps in 1980, and served as a consultant to the Government of Zanzibar (1994) and worked in Ethiopia (1991, 1999) and Senegal (2001).\nPublications\n* Tropical Diseases in Travelers (Eli Schwartz ed). John Wiley & Sons, NY, 2009. 504 pages.\n* Travel Medicine: Tales Behind the Science (Advances in Tourism Research) (Annelies Wilder-Smith, Eli Schwartz, Marc Shaw ed). Elsevier Science, NY, 2008. 333 pages.\n* A Hidden Traveler: Narratives of travelers with tropical diseases. By: Eli Schwartz, Orna Schatz-Oppenheimer. Ramot Publishing, Tel Aviv University, Tel Aviv, 2009. 248 pages. The ISBN even at the publisher (978-965-274-448-4) is bad, causing a checksum error.\nReferences\nExternal links\n* [https://eng.sheba.co.il/webfiles/fck/files/publication%20PDF%282%29.pdf Eli Schwartz's Short CV (2012)]"
    }
  ]
}