{
  "content": [
    {
      "type": "text",
      "text": "# Elizabeth the Queen (play)__disambig_1\n\nElizabeth the Queen was a 1930 Broadway three-act play written in blank verse by Maxwell Anderson, produced by the Theatre Guild, directed by Philip Moeller and with scenic and costume design by Lee Simonson. It ran for 147 performances from November 3, 1930, to March 1931 at the Guild Theatre. The starring roles were played by Lynn Fontanne as Elizabeth and Alfred Lunt as Lord Essex.\nIt was adapted into a film The Private Lives of Elizabeth and Essex (1939) directed by Michael Curtiz and starring Bette Davis, Errol Flynn and Olivia de Havilland and a television movie, Elizabeth the Queen (1968) directed by George Schaefer and starring Judith Anderson and Charlton Heston.\nOn radio, it has been adapted four times: for NBC's \"Great Plays\" program on WJZ (May 7, 1939), with Mady Christians and Wesley Addy; on Matinee Theater (December 17, 1944) with Judith Evelyn and Victor Jory; on The Theatre Guild on the Air (December 2, 1945) with Lynn Fontanne and Alfred Lunt and on Best Plays (November 9, 1952) with Eva Le Gallienne.\nPlot\nThe play revolves around the turbulent love affair between the aging Queen Elizabeth I of England and her much younger suitor Robert Devereux, 2nd Earl of Essex, who is ambitious for the throne.\nCast\n* Lynn Fontanne as Elizabeth\n* Alfred Lunt as Lord Essex\n* Mab Anthony as Mary\n* Morris Carnovsky as Francis Bacon\n* Percy Waram as Sir Walter Raleigh\n* Robert Conness as Lord Burghley\n* Arthur Hughes as Sir Robert Cecil\n* Whitford Kane as Burbage\n* Phoebe Brand as Ellen\n* Louise Huntington as a Lady-in-waiting\n* Annabelle Williams as a Lady-in-waiting\n* Royal Beal as\tMarvel\n* Barry Macollum as the fool\n* Philip Foster as Captain Armin\n* Edla Frankau as Tressa\n* Anita Kerry as Penelope Gray\n* Edward Oldfield as a captain of the guards\n* Curtis Arnall as Poins, and as a courtier, a guard and a man-at-arms\n* Charles Brokaw as a courier and as Heming\n* Robert Caille as a courtier\n* John Ellsworth as a man-at-arms\n* Vincent Sherman as a herald\nMultiple roles as Courtiers, Guards, Men-at-arms:\n* Michael Borodin\n* James A. Boshell\n* Thomas Eyre\n* George Fleming\n* Perry King\n* Henry Lase\n* Guy Moore\n* Stanley Ruth\n* Nick Wiger\n* James Wiley\nReferences\nSources\n*\n*The Private Lives of Elizabeth and Essex\nExternal links\n*"
    }
  ]
}