{
  "content": [
    {
      "type": "text",
      "text": "# Elizabeth Jane Howard\n\n| image = ElizabethJaneHowardImg.jpg\n| imagesize =\n| caption =\n| birth_date =\n| birth_place = London, England, UK\n| death_date =\n| death_place = Bungay, Suffolk, England, UK\n| occupation = Writer\n| genre = Fiction, non-fiction\n| spouse =\n*\n*\n}}\n| children = 1\n}}\nElizabeth Jane Howard  (26 March 1923 – 2 January 2014), was an English novelist. She wrote 12 novels including the best-selling series The Cazalet Chronicle.\nEarly life\nHoward's father was Major David Liddon Howard  (1896–1958), a timber merchant who followed the work of his own father, Alexander Liddon Howard (1863-1946). Her mother was Katharine Margaret Somervell (1895–1975), a dancer with Sergei Diaghilev's Ballets Russes and daughter of composer Sir Arthur Somervell. (Howard's brother, Colin, lived with her and her third husband, Kingsley Amis, for 17 years.) Mostly educated at home, Howard briefly attended Francis Holland School before attending domestic-science college at Ebury Street and secretarial college in central London.\nCareer\nHoward worked briefly as an actress in provincial repertory and occasionally as a model before her writing career, which began in 1947.\nThe Beautiful Visit (1950), Howard's first novel, was described as \"distinctive, self-assured and remarkably sensual\". It won the John Llewellyn Rhys Prize in 1951 for best novel by a writer under 30. She next collaborated with Robert Aickman, writing three of the six short stories in the collection We Are for the Dark (1951).\nHer second novel, The Long View (1956), describes a marriage in reverse chronology; Angela Lambert remarked, \"Why The Long View isn't recognised as one of the great novels of the 20th century I will never know.\"\nHoward published five additional novels before she embarked on her best known work, the five-volume Cazalet Chronicle. As Artemis Cooper describes it: “Jane had two ideas, and could not decide which to embark on; so she invited her stepson Martin [Amis] round for a drink to ask his advice. One idea was an updated version of Sense and Sensibility … the other was a three-volume family saga … Martin said immediately, “Do that one.”\nThe Chronicle was a family saga \"about the ways in which English life changed during the war years, particularly for women.\" It follows three generations of a middle-class English family and draws strongly from Howard's own life and memories. The first four volumes, The Light Years, Marking Time, Confusion, and Casting Off, were published from 1990 to 1995. Howard wrote the fifth, All Change (2013), in one year; it was her final novel. Millions of copies of the Cazalet Chronicle have been sold worldwide, and the novels remain in print ten years after her death.\nThe Light Years and Marking Time were serialised by Cinema Verity for BBC Television as The Cazalets in 2001. A BBC Radio 4 version in 45 episodes was also broadcast from 2012.\nHoward wrote the screenplay for the 1989 movie Getting It Right, directed by Randal Kleiser, based on her 1982 novel of the same name. She also wrote TV scripts for the popular series Upstairs, Downstairs.\nShe wrote a book of short stories, Mr. Wrong (1975), and edited two anthologies, including ''The Lover's Companion'' (1978).\nAutobiography and biographies\nHoward's autobiography, Slipstream, was published in 2002.\nA biography, entitled Elizabeth Jane Howard: A Dangerous Innocence by Artemis Cooper, was published by John Murray in 2017. A reviewer said it was \"strongest in the case it makes for the virtues of Howard's fiction\".\nPersonal life\nHoward was age 19 when she married conservationist Sir Peter Scott, the only child of Antarctic explorer Captain Robert Falcon Scott, in 1942; they had a daughter, Nicola. Howard left Scott in 1946 to become a writer, and they were divorced in 1951. In 1955, she fell in love with the writer Arthur Koestler. Howard became pregnant while with Koestler and had an abortion. After breaking with Koestler, Howard had love affairs with poets Laurie Lee and Cecil Day-Lewis, father of the actor Daniel Day-Lewis. Howard was friends with both of the men's wives.  At the time of her divorce she was employed as part-time secretary to the pioneering canals conservation organisation the Inland Waterways Association. There she met and collaborated with Robert Aickman. She described their affair in her autobiography Slipstream (2002). She also had affairs with the critics Cyril Connolly and Kenneth Tynan.\nHer second marriage, to Australian broadcaster Jim Douglas-Henry in 1958, was brief and unhappy. In 1962, while organising the Cheltenham Literary Festival, Howard met the novelist Kingsley Amis. Both were married at the time. Amis became Howard's third husband in a marriage that lasted from 1965 to 1983. For part of that time, 1968–1976, they lived at Lemmons, a Georgian house in Barnet, where Howard wrote Something in Disguise (1969). Her stepson, Martin Amis, credited her with encouraging him to become a more serious reader and writer.\nIn later life, Howard lived in Bungay, Suffolk. She was appointed CBE in the 2000 Birthday Honours. She died at home on 2 January 2014, aged 90.\nWorks\n* Winner of the John Llewellyn Rhys Prize\n* (a collection containing three stories by Howard and three by Robert Aickman)\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n* (Contains the three stories included in We Are for the Dark, plus \"Mr Wrong\".)\n*\n*\n*\n*\nReferences\nFurther reading\n* [http://orlando.cambridge.org/public/svPeople?person_id=howael Elizabeth Jane Howard: Overview], Orlando (website), Cambridge University Press, accessed 1 November 2010, [https://web.archive.org/web/20110725135212/http://orlando.cambridge.org/public/svPeople?person_id=howael archived] by WebCite on 31 October 2010.\n* [https://www.bbc.co.uk/radio4/womanshour/2002_44_tue_01.shtml \"Elizabeth Jane Howard\"], BBC Radio 4, 29 October 2002. Accessed 1 November 2010.\n* Ciuraru, Carmela (2023). Lives of the Wives: Five Literary Marriages. .\n* Millard, Rosie. [https://web.archive.org/web/20110615182424/http://entertainment.timesonline.co.uk/tol/arts_and_entertainment/books/article4925052.ece \"The beauty and the psycho\"], The Times, 12 October 2008. Accessed 1 November 2010.\nExternal links\n*\n*[https://www.bbc.co.uk/programmes/p0093p5m Elizabeth Jane Howard] on Desert Island Discs\n*"
    }
  ]
}