{
  "content": [
    {
      "type": "text",
      "text": "# Elkington, Lincolnshire\n\n| shire_district           = East Lindsey\n| shire_county             = Lincolnshire\n| region                   = East Midlands\n| constituency_westminster = Louth and Horncastle\n| post_town                = Louth\n| postcode_district        = LN11\n| postcode_area            = LN\n| dial_code                =\n| os_grid_reference        = TF296883\n| london_distance_mi       = 130\n| london_direction         = S\n}}\nElkington is a civil parish in the East Lindsey district of Lincolnshire, England. It comprises the village of South Elkington, and the hamlets of North Elkington, Boswell, and Thorpe, and is situated approximately  north-west from the market town of Louth.\nSouth Elkington\nThe parish church is a Grade II* listed building dedicated to All Saints, built using chalk, ironstone, and limestone, and dating from the 13th century, with a 15th-century font. The nave was rebuilt in 1843, and the chancel in 1873.\nThe base and part of the shaft of a scheduled stone cross are in the churchyard. The cross is medieval in date and is constructed of limestone.\nBorn in South Elkington was racing driver of the 1930s and 1940s, Charles Brackenbury. He operated a garage close to Brooklands Racetrack.\nNorth Elkington\nThe Grade II listed former parish church (now closed) was dedicated to Saint Helen and built 1851-52 and by S. S. Teulon in Early English style. Built into both the side walls of the porch are 13th-century coffin lid fragments. It has been sold and is now in private ownership.\nBoswell\nBoswell has a scheduled Bronze Age Bowl Barrow, north of \"Cocked Hat Plantation\".\nThorpe\nThorpe Hall, in Thorpe hamlet, is a Grade II* listed Country House. The Hall was built in 1584 for Sir John Bolle who lived there until his death in 1606 and is buried in Haugh Church. A 17th-century pigeoncote at Thorpe Hall is also Grade II listed, as is an 18th-century wrought iron gateway.\nFrom 1895 to 1906, Thorpe Hall was owned by Captain Julius Tennyson, nephew of the Poet Laureate, Alfred, Lord Tennyson. Captain Langston Brackenbury, MP for Louth, bought the Hall in 1906 and lived there until 1920. In the Second World War, Thorpe Hall housed evacuees and was later requisitioned as an Army Officers' Mess. After the war it was a Diocesan healing centre. Later it was home to Lady Evelyn Patrick, daughter of the 3rd Earl of Lovelace.\nReferences\nExternal links\n*"
    }
  ]
}