{
  "content": [
    {
      "type": "text",
      "text": "# Ellen Buckingham Mathews\n\n]]\nEllen Buckingham Mathews (26 August 1849 – 10 March 1920) was a popular English novelist during the late 19th and early 20th centuries. She was also known as Mrs Reeves after her marriage in 1877 to Dr. Henry Albert Reeves (1841–1914) but was best known under her pen name, Helen Mathers.\nBiography\nShe was born in Misterton, Somerset, to Thomas Mathews, a horsehair manufacturer, and Maria Ann Mathews. Her first novel, ''Comin' thro' the Rye was published in 1875. It was partly based on people in her life and on her own early romantic experiences. She also acknowledged Rhoda Broughton as an early influence. She continued to write until her death.\nShe was educated at a boarding school in  Chantry near Frome in Somerset. In her first novel, Comin' thro' the Rye, she describes some of her experiences at school. Mr Russell in the novel was the Rev. Mr. Fussell in real life, who was the Lord of the manor and founder of the school. In the novel she calls the village Charteris. From 1875 to 1895, the novel sold more than 35,000 copies.\nDue to a confusion of titles, some sources attribute a number of books by Scottish novelist Anne S. Swan to Mathers. Mathers published a short novel entitled Land o' the Leal, by the Author of Comin' Thro' the Rye\" in 1878.\nShe died in Brondesbury in 1920.\nBibliography\n*Comin’ Thro' the Rye,  1875\n*The Token of the Silver Lily,  1877. Poetry\n*Cherry Ripe!: A Romance,  1878\n*Land o' the Leal,  1878\n*As He Comes up the Stair,  1878\n*My Lady Greensleeves,  1879\n*Story of a Sin,  1882\n*Eyre's Acquittal,  1883\n*Sam's Sweetheart,  1883\n*Jock o' Hazelgreen,  1884 (also contains The Land o' the Leal and other stories)\n*Found Out: A Story,  1885\n*Murder or Manslaughter,  1885\n*The Fashion of this World,  1886\n*Blind Justice,  1890\n*The Mystery of No 13,  1891\n*My Jo,  John: A Novel,  1891\n*T'other Dear Charmer,  1892\n*The Fate of Fenella,  1892. Mathers contributed one chapter to this multi-author novel.\n*A Study of a Woman,  1893\n*What the Glass Told,  1893\n*A Man of Today,  1894\n*The Lovely Malincourt: A Novel,  1895\n*The Rebel,  1896\n*The Juggler and the Soul,  1896\n*The Sin of Hagar,  1896\n*Bam Wildfire: A Character Sketch,  1898\n*Becky,  1900\n*Cinders: A Novel,  1901\n*Honey,  1902\n*Venus Victrix (What the Glass Told; The Mystery of No. 13; What the Glass Told; My Jo,  John),  1902\n*Dahlia and Other Stories,  1903\n*Dimples,  1903\n*Griff of Griffithscourt,  1903\n*The Face in the Mirror and Other Stories,  1903\n*The New Lady Teazle and other stories,  1903\n*Side-shows,  1904\n*The Ferryman,  1905\n*Tally,  Ho!,  1906\n*Pigskin and Petticoat,  1907\n*The Pirouette and Other Stories (2nd edition,  1907)\n*Gay Lawless,  1908\n*Love the Thief,  1909\n*Man is Fire,  Woman is Tow and Other Stories'',  1912\nReferences\nSources\n*\nExternal links\n*\n*\n*"
    }
  ]
}