{
  "content": [
    {
      "type": "text",
      "text": "# Emanuel Steward\n\n| birth_place = Bottom Creek, West Virginia, U.S.\n| death_date =\n| death_place = Chicago, Illinois, U.S.\n}}\nEmanuel \"Manny\" Steward (July 7, 1944&nbsp;– October 25, 2012) was an American boxer, trainer, and commentator for HBO Boxing. Known as \"the godfather of Detroit boxing,\" Steward trained 41 world champion fighters throughout his career, most notably Thomas Hearns, through the famous Kronk Gym and later heavyweights Lennox Lewis and Wladimir Klitschko. Emanuel trained over two dozen boxers who turned out to be champions in the course of his career. His heavyweight fighters had a combined record of 34–2–1 in title fights. He was an inductee of the International Boxing Hall Of Fame, and the World Boxing Hall of Fame. Steward was also known for his charity work in Detroit, Michigan, helping youth to attain an education.\nLife and career\nSteward was born in Bottom Creek, West Virginia, but, by the age of 12, he had moved with his mother to Detroit, Michigan, after she divorced his father, who was a coal miner.  After moving to Detroit, he worked briefly in the auto industry before eventually going to Brewster Recreation Center, where Joe Louis and Eddie Futch trained. Steward began an amateur boxing career there. He compiled a record of 94 wins and 3 losses as an amateur boxer, including winning the 1963 national Golden Gloves tournament in the bantamweight division.\nIn 1971, Steward took his half brother, James Steward, to the nearby Kronk Gym, a hot-bed for amateur boxers in the 1970s, and became a part-time coach there.  Steward trained many of the nation's top amateurs. He eventually translated his success with amateurs into a career training championship-level professional fighters.\nOn March 2, 1980, Hilmer Kenty became Steward's first world champion by knocking out world lightweight champ Ernesto España. Steward achieved his most notable early success with welterweight Thomas Hearns, whom he changed from a light hitting boxer into one of the most devastating punchers in boxing history.  Hearns became one of Steward's most successful and popular fighters, fighting Sugar Ray Leonard, knocking out Roberto Durán, and challenging undisputed middleweight champion Marvelous Marvin Hagler.\nHe was well known for his outgoing personality and endless energy. In addition, he was very giving and was known for being a father figure. He even, at one point, obtained a 97–3 title. Even though he fought, his main passion was training.\nDeath\nSteward died on October 25, 2012, after undergoing surgery for diverticulitis. He was 68. Colon cancer was subsequently reported as a contributing factor to his death.\nHonors\n*Elected into the International Boxing Hall of Fame\n*Elected into the World Boxing Hall of Fame\nKronk Gym\nKronk Gym became a property of Steward's, who was also famous for his collection of Rolls-Royce cars and mansions. He opened a branch of the gym in Tucson, Arizona, and started an association with the Dodge Theater in Phoenix to present boxing undercards once a month.\nSteward often turned up the thermostat to make boxers so uncomfortable that some would claim that even the walls would sweat.\nFighters trained\nAmong the world champions and top rated contenders who trained or sought Steward's guidance at some point of their careers were:\n* Dennis Andries\n* Johnathon Banks\n* Wilfred Benítez\n* Jesse Benavides\n* Mark Breland\n* Cornelius Bundrage\n* Oba Carr\n* Julio César Chávez\n* Kermit Cintron\n* Miguel Cotto\n* Chad Dawson\n* Oscar De La Hoya\n* Domonique Dolton\n* Tyson Fury\n* Yuriorkis Gamboa\n* Miguel Ángel González\n* Mickey Goodwin\n* Naseem Hamed\n* Thomas Hearns\n* Evander Holyfield\n* John David Jackson\n* Hilmer Kenty\n* Ole Klemetsen\n* Wladimir Klitschko\n* Andy Lee\n* William \"Caveman\" Lee\n* Lennox Lewis\n* Oliver McCall\n* Mike McCallum\n* Gerald McClellan\n* Milton McCrory\n* Steve McCrory\n* Michael Moorer\n* Andrew Murray\n* Jimmy Paul\n* Aaron Pryor\n* Graciano Rocchigiani\n* Tarick Salmaci\n* Adonis Stevenson\n* Jermain Taylor\n* Duane Thomas\n* James Toney\n* Syd Vanderpool\n* Ricky Womack\nReferences\nExternal links\n* [http://kronkgym.com Kronk Gym]"
    }
  ]
}