{
  "content": [
    {
      "type": "text",
      "text": "# Emblem of the Ukrainian Soviet Socialist Republic\n\n|orders           =\n|other_elements   =\n|earlier_versions = See below\n|use              = }}\nThe emblem of the Ukrainian Soviet Socialist Republic was adopted on 14 March 1919 by the government of the Ukrainian Soviet Socialist Republic and subsequently modified on 7 November 1928, 30 January 1937 and 21 November 1949. The coat of arms from 1949 is based on the coat of arms of the Soviet Union and features the hammer and sickle, the red star, a sunrise, and stalks of wheat on its outer rims. The rising sun stands for the future of the Soviet Ukrainian nation, the red star as well as the hammer and sickle for communism and the \"world-wide socialist community of states\".Бажан, Микола Платонович (editor) (1967) Украинской Советской Энциклопедии (Ukrainian Soviet Encyclopedia) Kyiv, Ukraine,  in Ukrainian\nThe banner bears the Soviet Union state motto \"Workers of the world, unite!\" in both the Ukrainian and Russian languages; in Ukrainian, it is Пролетарі всіх країн, єднайтеся! (). The name of the Ukrainian SSR is shown only in Ukrainian, and reads \"Українська PCP\".\nIn 1992, after the dissolution of the Soviet Union and when Ukraine became independent, the emblem was changed to the present coat of arms of Ukraine the tryzub (trident) coat of arms, which was affirmed in the new Constitution of Ukraine in 1996, and was first proposed in 1917. The use of this former emblem is currently banned in modern-day Ukraine.\nThe emblem shares a common background with that of the Russian SFSR.\nHistory\nFirst version\nIn the Constitution of the Ukrainian SSR, approved by the All-Ukrainian Congress of Soviets on 10 March 1919 and adopted in the final version of the CEC on 14 March 1919, the coat of arms was described in Article 34:\nThe section on the symbols of the republic in the Constitution of the Ukrainian SSR of 1919 was not amended even after the amendments to the Constitution of the Ukrainian SSR, which was adopted by the 9th All-Ukrainian Congress of Soviets on 10 May 1925.\nFirst revision\nUnder the Article 80 of the Constitution of the Ukrainian SSR in 1929, the arms did not undergo significant changes. The abbreviation was changed from \"У.С.С.Р.\" to \"У.С.Р.Р.\".\nSecond version\nThe Constitution of the Ukrainian SSR (1937), approved on 30 January 1937, slightly changed the coat of arms. The abbreviation changed from \"У.С.Р.Р.\" to \"У.Р.С.Р.\", and the amount of the rays of sunlight increase.\nThird version\nIn the summer of 1947, the Central Committee of the Communist Party (Bolsheviks) (the Communist Party of Ukraine) discussed the question of bringing the coat of arms of the Ukrainian Soviet Socialist Republic to the standard in the USSR: the top was decided to add a star, change the location of the inscriptions.\nCorrespondence with Moscow and Stalin\nOn 1 December 1947, to consult with the design of the coat of arms, Mykhailo Hrechukha, who was the Chairman of Presidium of Verkhovna Rada at the current time, send a letter to Demyan Korotchenko, who was the head of state of the Ukrainian SSR. He concerned about the design of the coat of arms of the Ukrainian SSR at that time, which only consists of the motto in Ukrainian language.\nAfter that, Korotchenko and Hrechukha continued the letter to Lazar Kaganovich, who was the First Secretary of the Communist Party of Ukraine (Bolsheviks).\n, The Politburo of the Central Committee of the Communist Party (Bolshevik), considering the question \"On Amendments to the Image of the State Emblem of the Ukrainian SSR\", decided to add to the image of the coat of arms of the Ukrainian SSR at the top of it, between the ears, a five-pointed star, as the emblem of the USSR.\nIn the process of implementing this decision, it became necessary to bring the State Emblem of the Ukrainian SSR into line with the arms of the majority of the Union republics, in which the words \"Proletarians of all countries!\" Were inscribed in two languages - Russian and the corresponding national language.\nRepresents to you two versions of the draft of the State Emblem of the Ukrainian SSR, developed by us, with all the changes and additions, and also the draft resolution of the Central Committee of the Communist Party (Bolshevik).\nDemyan Korotchenko\nMykhailo Hrechukha}}\nIn an official correspondence, Kaganovich, together with V. Nyzhnyk, the Chairman of the Presidium of the Supreme Soviet of the Ukrainian SSR, continue to discuss this matter with Nikolay Shvernik, who was the Chairman of the Presidium of the Supreme Soviet of the USSR at that time. Kaganovich and Nyzhnyk send a correspondence to Shvernik at 3 January 1948.\nOn 14 January 1948, Hrechukha received a reply from Shvernik from his letter.\nAfter the changes were done, the result was given to Nikita Khrushchev, who was the First Secretary of the Communist Party of Ukraine (Bolsheviks). Then, he send the result of the discussion to Joseph Stalin.\nApproval\nBy the decree of the Presidium of the Supreme Soviet of the Ukrainian SSR of 21 November 1949 and by the law adopted by the Supreme Soviet of the Ukrainian SSR on 5 July 1950, a red five-pointed star was added at the top of the Ukrainian SSR's coat of arms, and also the motto, the name of the republic in Ukrainian, and the motto in Ukrainian and Russian language is transferred to the lateral coils of the red tape.\nIn the Constitution of the Ukrainian SSR, the coat of arms was described in Article 166:\nGallery\nCOA of the Ukrainian SSR (1918).svg|Coat of arms of the Ukrainian Soviet Socialist Republic (1918)\nГерб УССР 1919.jpg|Coat of arms of the Ukrainian SSR (1919)\nEmblem of the Ukrainian SSR (1929–1937).gif|Emblem of the Ukrainian SSR (1929–1937)\nCOA of the Ukrainian SSR (1937-1949).svg|Emblem of the Ukrainian SSR (1937–1949)\nEmblem of the Ukrainian SSR.svg|Emblem of the Ukrainian SSR (1949–1991) and of Ukraine (1991–1992)\nKharkiv city hall - UkSSR coat of arms.jpg|The Ukrainian SSR's emblem shown on top of Kharkiv's city hall in 2008.\nSee also\n* Flag of the Ukrainian Soviet Socialist Republic\n* Anthem of the Ukrainian Soviet Socialist Republic\n* Coat of arms of Ukraine\nNotes\nExternal links\n* [http://eh.lenin.ru/russian/1ru/ukraine/ukr-hist3.htm \"1919-1991 Украинская Советская Социалистическая Республика\"] Encyclopedia Heraldica Coats of arms and flags of the Ukrainian Soviet Socialist Republic 1919-1991"
    }
  ]
}