{
  "content": [
    {
      "type": "text",
      "text": "# Emerald Software\n\nEmerald Software was a video game publisher founded in 1988 by two UK entertainment executives – David Martin of Martech, and Mike Dixon who previously worked with EMI and worked as the company CEO.\nThe company was headquartered in a three-story Georgian house (\"Washington Lodge\") in Wilkin Street, Waterford, Ireland.\nThe company released a number of games between 1988 and 1990, but a number of critical delays in the development program eventually led to its closure in 1991.\nPeople\nThe company was mostly populated by graduates or placement students from the then-named Waterford Regional Technical College – with some from University College Dublin and others with no formal computer training.\nAt its peak, Emerald Software employed 17 programmers and 5 graphic artists. These people were spread across 5 departments, loosely split to cover each of the supported development platforms and graphic art – with two additional personnel in administration and human resources.\nDevelopment\nThe company authored games for the Commodore Amiga, IBM PC, Atari ST, Commodore 64, ZX Spectrum and Amstrad CPC systems.\nDevelopment for Amiga and Atari ST games was carried out using Manx C, and Motorola 68000 Assembly language. As both Amiga and ST were 68000-based machines, games were typically authored on the Amiga and then ported using an in-house authored porting / remote-debug / development environment; this allowed the code to be edited on the more capable Amiga, then transmitted to the ST and remotely executed/debugged from the Amiga. Graphics and sound routines required re-authoring, but in many cases this was straightforward.\nThe Amiga games did not run on top of Workbench/AmigaOS – but on a custom-written tiny OS (KOS) with a proprietary disk format which offered higher data capacity per diskette, as well as helping to impede casual copying.\nDevelopment for Spectrum and CPC games took place on a commercially available cross-assembler development environment (PDS) hosted on an IBM PC clone which was connected to a Spectrum. This allowed the game to be authored on the stable PC environment (complete with disk backup), then \"blasted\" directly into the Spectrum memory to allow for immediate testing. Developing in this manner allowed for higher development speeds than could be achieved by native development on the Spectrum.\nAs both ZX Spectrum and CPC 464 were Zilog Z80-based machines, CPC versions were usually ported versions of the Spectrum games, with the graphics display on the more-capable CPC reconfigured to be close to that of the more primitive Spectrum. The team developed a graphics display system for the CPC 464 that emulated the Spectrum screen layout which meant graphics routines could be ported quickly. Employees also developed a macro programming language that meant that code could be compiled and shared instantly across both platforms. Z80 development was actually done on a PC where the code could be edited and compiled quickly, and then was ported via RS232 direct onto the Spectrum and CPC machines for testing.\nGames\nThe company produced a number of games during its brief existence, to somewhat mixed reviews. These were largely ports of existing arcade games (Vigilante for example) or original movie tie-ins (The Running Man) but there were also some original game concepts (e.g. Phantom Fighter):\n*The Deep (1988)\n*If It Moves, Shoot It! (1988)\n*Phantom Fighter (1988)\n*The Running Man (1989)\n*Vigilante (1989)\n*''Michael Jackson's Moonwalker (1989)\n*Fallen Angel (1989)\n*Treasure Trap'' (1990)\nThe intro sequence for the Amiga version of 'The Running Man' occupied practically one full 800k diskette of the two diskette set. Running in a continuous loop till interrupted, it featured digitised voice, music and video sequences from the film, and so was often left running in computer stores as an Amiga feature demonstrator.\nReferences\nExternal links\n* [https://web.archive.org/web/20160317070344/http://gamedevelopers.ie/the-emerald-isle/ Article about Emerald on GameDevelopers.ie] (archived 2016)"
    }
  ]
}