{
  "content": [
    {
      "type": "text",
      "text": "# Émile Wartel__disambig_1\n\nLouis Émile Wartel (31 March 1834, Paris – 5 May 1907, Paris) was an opera singer and teacher active in Paris. He was the son of the musicians François Wartel and Thérèse Wartel.\nLife and career\nWartel was an established singer at the Théâtre Lyrique in Paris from 1858 until 1868, creating many baritone roles in new operas premiered there.\nHis repertoire was:\n1858\n*Valère in Le médecin malgré lui (premiere)\n*Bartholo in Les noces de Figaro\n*Lysandre in ''L'agneau de Chloé (premiere)\n*Gambara in Le harpe d'or (premiere)\n1859\n*Omar in Abou Hassan\n*l’Agent de Cardinal Mazarin in Les petits violons du roi (premiere)\n1860\n*le Docteur Sangrado in Gil Blas (premiere)\n*le Marquis de Panillac in Les valets de Gascogne (premiere)\n*Père Richard in L'auberge des Ardennes (premiere)\n*Monsieur Oronte in Crispin, rival de son maitre (premiere)\n*le Capitaine Barbagallo in Les pêcheurs de Catane (premiere)\n1861\n*Magnus and Astaroth in Astaroth (premiere)\n*Monsieur d’Assonvilliers in Madame Grégoire (premiere)\n*Badroulboudour in Les deux cadis (premiere)\n*Kaloum in La statue (premiere)\n*le Marquis in Le café du roi\n*Placidus in La nuit aux gondoles (premiere)\n*Don Gregorio in Le tête enchantée (premiere)\n1862\n*Utobal in Joseph''\n*l'Ogre de la forêt in La chatte merveilleuse (premiere)\n1863\n*Don Armado in ''Peines d'amours perdues\n*Sparafucile in Rigoletto\n1864\n*Ambroise in Mireille (premiere)\n*Le baron in Violetta\n*Le docteur in Le cousin Babylas (premiere)\n1865\n*Candaule in Le roi Candaule (premiere)\n*Le bourgmestre in Lisbeth ou la Cinquantaine\n*Lord Tristan in Martha\n1866\n*Ford in Les joyeuses commères de Windsor\n*Van Daff in Les dragées de Suzette (premiere)\n1867\n*le Duc de Vérone in Roméo et Juliette (premiere)\n*Simon Glover in La jolie fille de Perth (premiere)\n1868\n*Pandolphe in L'irato\n*Toby in Le brasseur de Preston''\nReferences"
    }
  ]
}