{
  "content": [
    {
      "type": "text",
      "text": "# Emiratis in the United Kingdom\n\nEnglish\n| population = UAE-born residents11,457 (2011 census)\n| popplace = London\n| rels = Islam\n| related =\n}}\nEmiratis in the United Kingdom are Emirati expatriates in the United Kingdom. They number several thousand and include many students pursuing higher education.\nDemographics\nAt the time of the 2001 UK census, there were 5,406 people born in the United Arab Emirates (UAE) who were residents in the United Kingdom. The 2011 census recorded 10,139 UAE-born residents in England, 382 in Wales, 873 in Scotland and 63 in Northern Ireland.\nIn the 2009/10 academic year, around 400 new UAE students enrolled in various higher education institutions across the UK and the overall number of Emirati-domiciled students registered on higher education courses totalled over 2,800. This represents growth from 2005/2006, when the population numbered 2,000, which itself was an increase of 15 per cent on the previous academic year. In the 2002/03 academic year, there were 1,400 students. The UK remains one of the top choices for overseas work, study or tourism amongst UAE nationals. As of 2013, up to 3,200 students from the UAE were pursuing education in the UK.\nAccording to UAE government figures, between 1990 and 2012, around 250 UAE nationals became British citizens. The UAE does not allow dual citizenship.\nCommunity\nBritain is one of the most popular destinations for UAE expats and is the most popular choice of Emirati students travelling overseas for their higher education. Around 40,000 Emiratis visit the UK every year. Many of the UAE's leaders received their education in UK universities and institutions. Language and cultural difficulties, living outside the \"comfort zone\" and the different weather conditions are reported to be perpetual difficulties for new Emirati students in the UK. The London branch of the Dubai National Bank is considered to be one of the central social venues for the capital's Emirati community.\nEmirati students tend to retain certain cultural and religious practices when studying in the UK, especially during the holy month of Ramadan. The Emiratis see Ramadan as a time during which they can fast and more frequently offer prayers. It is also a period of interaction, something they miss during their time in London.\nThe UAE government has issued its own version of a tourist map of London for Emiratis who visit the UK, with the map identifying \"dangerous areas\" to avoid. The warning came as a measure after incidents of fraud, theft and attacks on Emirati nationals in London.\nNotable people\nNotable Emirati expatriates in the UK include:\n* Layla Kaylif, singer-songwriter and film director\n* Ali F. Mostafa, film director\n* Mahdi Al Tajir, businessman\n* Saeed bin Suroor, racehorse trainer for Godolphin Stables based at Newmarket, Suffolk\n* Princess Haya, former wife of UAE royal, Shiekh Mohammed; she escaped from the UAE with their two children and divorced him.\n* Princess Shamsa and Princess Latifa, daughters of UAE royal shiekh Mohammed; they escaped from the UAE.\nSee also\n* United Arab Emirates–United Kingdom relations\n* British Arabs\n* Britons in the United Arab Emirates\nReferences"
    }
  ]
}