{
  "content": [
    {
      "type": "text",
      "text": "# Emperor Annei\n\n}}\n| succession   = Emperor of Japan\n| image        = Tennō Annei thumb.jpg\n| caption      =\n| reign        = 549 BC – 511 BC (traditional)\n| coronation   =\n| cor-type     = Japan\n| predecessor  = Suizei\n| successor    = Itoku\n| posthumous name = Chinese-style shigō:Emperor Annei ()Japanese-style shigō:Shikitsuhikotamatemi no Sumeramikoto ()\n| spouse       = Nunasokonakatsu-hime\n| issue        =\n*Emperor Itoku\n*\n}}\n| royal house  = Imperial House of Japan\n| father       = Emperor Suizei\n| mother       = Isuzuyori-hime\n| religion     = Shinto\n| birth_date   = 567 BC\n| birth_place  =\n| death_date   = 511 BC (aged 56)\n| death_place  =\n| burial_place =  (Kashihara)\n}}\n, also known as  was the third legendary emperor of Japan, according to the traditional order of succession. Very little is known about this Emperor due to a lack of material available for further verification and study. Annei is known as a \"legendary emperor\" among historians as his actual existence is disputed. Nothing exists in the Kojiki other than his name and genealogy. Annei's reign allegedly began in 549 BC, he had one wife and three sons. After his death in 511 BC, his second or third son supposedly became the next emperor.\nLegendary narrative\nEmperor Annei's name appears in both the Kojiki and Nihon Shoki where only his genealogy are recorded. While the Japanese have traditionally accepted this sovereign's historical existence, no extant contemporary records have been discovered that confirm a view that this historical figure actually reigned. Before his accession to the throne, he was allegedly known as Prince Shikitsu-hiko Tamatemi. Shikitsu-hiko Tamatemi was either the eldest son or the only son of Emperor Suizei with Isuzuyori-hime. The Kojiki records that he ruled from the palace of }} at Katashiro in Kawachi in what would come to be known as Yamato Province. During Emperor Annei's alleged lifetime, he had one wife named \"Nunasokonakatsu-hime\" and fathered three children with her. Annei's reign lasted from 549 BC until his death in 511 BC, his second or third son then took the throne and would later be referred to as Emperor Itoku.\nKnown information\nThe existence of at least the first nine Emperors is disputed due to insufficient material available for further verification and study. Annei is thus regarded by historians as a \"legendary Emperor\", and is considered to have been the second of eight Emperors without specific legends associated with them..}} The name Annei-tennō was assigned to him posthumously by later generations, and literally means \"steady tranquillity\". His name might have been regularized centuries after the lifetime ascribed to Annei, possibly during the time in which legends about the origins of the imperial dynasty were compiled as the chronicles known today as the Kojiki. The name \"Annei\" is first credited to Japanese scholar and writer Ōmi no Mifune, who allegedly came up with the name sometime in the latter half of the 8th century.\nWhile the actual site of Annei's grave is not known, the Emperor is traditionally venerated at a memorial Shinto shrine (陵,misasagi) in Kashihara. The Imperial Household Agency designates this location as Annei's mausoleum, and is formally named Unebi-yama no hitsujisaru Mihodo no i no e no misasagi(畝傍山西南御陰井上陵,The royal tomb over the mihodo at the south west of mount unebi) . The first emperor that historians believe might have actually existed is Emperor Sujin, the 10th emperor of Japan. Outside of the Kojiki, the reign of Emperor Kinmei}} (&nbsp;– 571 AD) is the first for which contemporary historiography is able to assign verifiable dates. The conventionally accepted names and dates of the early Emperors were not confirmed as \"traditional\" though, until the reign of Emperor Kanmu between 737 and 806 AD.\nFamily tree\nConsorts and Children\n*Empress: , Prince Kamo's daughter (Kotoshironushi's son)\n**\n** , later Emperor Itoku\n** |磯城津彦命}}\nSee also\n* Emperor of Japan\n* List of Emperors of Japan\n* Imperial cult\nNotes\nReferences\n— a stylized chrysanthemum blossom]]\nFurther reading\n* Aston, William George. (1896). [https://books.google.com/books?id=_oEfAAAAYAAJ  Nihongi: Chronicles of Japan from the Earliest Times to A.D. 697.] London: Kegan Paul, Trench, Trubner.\n* Brown, Delmer M. and Ichirō Ishida, eds. (1979). [https://books.google.com/books?id=w4f5FrmIJKIC&q=Gukansho  Gukanshō: The Future and the Past.] Berkeley: University of California Press. ;\n* Chamberlain, Basil Hall. (1920). [http://www.sacred-texts.com/shi/kj/index.htm The Kojiki.] Read before the Asiatic Society of Japan on April 12, May 10, and June 21, 1882; reprinted, May, 1919.\n* Nussbaum, Louis-Frédéric and Käthe Roth. (2005). [https://books.google.com/books?id=p2QnPijAEmEC  Japan encyclopedia.] Cambridge: Harvard University Press. ;\n* Ponsonby-Fane, Richard Arthur Brabazon. (1959). [https://books.google.com/books?id=SLAeAAAAMAAJ&q=The+Imperial+House+of+Japan  The Imperial House of Japan.] Kyoto: Ponsonby Memorial Society.\n* Titsingh, Isaac. (1834). Nihon Ōdai Ichiran; ou, [https://books.google.com/books?id=18oNAAAAIAAJ&q=nipon+o+dai+itsi+ran  Annales des empereurs du Japon.]  Paris: Royal Asiatic Society, Oriental Translation Fund of Great Britain and Ireland.\n* Varley, H. Paul. (1980). [https://books.google.com/books?id=tVv6OAAACAAJ  Jinnō Shōtōki: A Chronicle of Gods and Sovereigns.] New York: Columbia University Press. ;"
    }
  ]
}