{
  "content": [
    {
      "type": "text",
      "text": "# Emperor Kanmu\n\n}}\n| image        = Emperor Kammu large.jpg\n| caption      = Portrait of Emperor Kanmu, 16th century\n| succession   = Emperor of Japan\n| reign        = 30 April 781 – 9 April 806\n| coronation   = 10 May 781\n| cor-type     = japan\n| predecessor  = Kōnin\n| successor    = Heizei\n| posthumous name = Chinese-style shigō:Emperor Kanmu ()Japanese-style shigō:Yamatonekoamatsuhitsugiiyateri no Sumeramikoto ()\n| spouse       = Fujiwara no Otomuro\n| issue        =\n| issue-link   = #Consorts and children\n| issue-pipe   = among others...\n| royal house  = Imperial House of Japan\n| father       = Emperor Kōnin\n| mother       = Takano no Niigasa\n| birth_name   = Yamabe ()\n| birth_date   = 4 February 736\n| birth_place  =\n| death_date   =\n| death_place  =\n| burial_place = Kashiwabara no misasagi (柏原陵) (Kyoto)|\n}}\n, or Kammu, was the 50th emperor of Japan, according to the traditional order of succession. Kammu reigned from 781 to 806, and it was during his reign that the scope of the emperor's powers reached its peak. His reign saw the transition from the Nara period to the Heian period.\nTraditional narrative\nKammu's personal name (imina) was . He was the eldest son of Prince Shirakabe (later known as Emperor Kōnin), and was born prior to Shirakabe's ascension to the throne. According to the , Yamabe's mother, Yamato no Niigasa (later called Takano no Niigasa), was a 10th generation descendant of Muryeong of Baekje (462–523).\nAfter his father became emperor at the age of 61, Kammu's half-brother, Prince Osabe was appointed to the rank of crown prince. His mother was Princess Inoe, a daughter of Emperor Shōmu; but instead of Osabe, it was Kammu who was later named to succeed their father. After Inoe and Prince Osabe were confined and then died in 775, Osabe's sister – Kammu's half-sister Princess Sakahito – became Kammu's wife. Later, when he ascended to the throne in 781, Kammu appointed his young brother, Prince Sawara, whose mother was Takano no Niigasa, as crown prince. Hikami no Kawatsugu, a son of Emperor Tenmu's grandson Prince Shioyaki and Shōmu's daughter Fuwa, attempted to carry out a coup d'état in 782, but it failed and Kawatsugu and his mother were sent into exile. In 785 Sawara was expelled and died in exile.\nThe Nara period saw the appointment of the first shōgun, Ōtomo no Otomaro by Emperor Kammu in 794 CE. The shōgun in this time was not the type of de facto military dictator of Japan as in later history but was appointed to pacify the northern borderlands. The full title \"Sei-i Taishōgun\" means \"Barbarian-subduing Great General\". Emperor Kammu granted the second title of shōgun to Sakanoue no Tamuramaro for subduing the Emishi in northern Honshu.\nKammu had 16 empresses and consorts, and 32 imperial sons and daughters. Among them, three sons would eventually ascend to the imperial throne: Emperor Heizei, Emperor Saga and Emperor Junna. Some of his descendants (known as the Kammu Taira or Kammu Heishi) took the Taira hereditary clan title, and in later generations became prominent warriors. Examples include Taira no Masakado, Taira no Kiyomori, and (with a further surname expansion) the Hōjō clan. The waka poet Ariwara no Narihira was one of his grandsons.\nKammu is traditionally venerated at his tomb; the Imperial Household Agency designates , in Fushimi-ku, Kyoto, as the location of Kammu's mausoleum.\nEvents of Kammu's life\nKammu was an active emperor who attempted to consolidate government hierarchies and functions. Kammu appointed Sakanoue no Tamuramaro (758–811) to lead a military expedition against the Emishi.\n* 737: Kammu was born.\n* 773: Received the title of crown prince.\n* April 30, 781(): In the 11th year of Kōnin's reign, he abdicated; and the succession was received by his son Kammu. Shortly thereafter, Emperor Kammu is said to have ascended to the throne. During his reign, the capital of Japan was moved from Nara (Heijō-kyō) to Nagaoka-kyō in 784. Shortly thereafter, the capital would be moved again in 794.\n* July 28, 782 (): The sadaijin Fujiwara no Uona was involved in an incident that resulted in his removal from office and exile to Kyushi. Claiming illness, Uona was permitted to return to the capital where he died; posthumously, the order of banishment was burned and his office restored. In the same general time frame, Fujiwara no Tamaro was named Udaijin. During these days in which the offices of sadaijin and udaijin were vacant, the major counselors (the dainagon) and the emperor assumed responsibilities and powers which would have been otherwise delegated.\n* 783 (): The udaijin Tamaro died at the age of 62 years.\n* 783 (): Fujiwara no Korekimi became the new udaijin to replace the late Fujiwara no Tamaro.\n* 793 (): Under the leadership of Dengyō, construction began on the Enryaku Temple.\n* 794: The capital was relocated again, this time to Heian-kyō, where the palace was named .\n* November 17, 794 (): The emperor traveled by carriage from Nara to the new capital of Heian-kyō in a grand procession. This marks the beginning of the Heian period.\n* 794 appointed Ōtomo no Otomaro as the first Shōgun \"Sei-i Taishōgun—\"Barbarian-subduing Great General\", together with Sakanoue no Tamuramaro subdues the Emishi in Northern Honshu.\n* 806: Kammu died at the age of 70. Kammu's reign lasted for 25 years.\nEras of Kammu's reign\nThe years of Kammu's reign are more specifically identified by more than one era name (nengō).\n* ''Ten'ō (781–82)\n* Enryaku'' (782–806)\nPolitics\nDomestic relations\nEarlier Imperial sponsorship of Buddhism, beginning with Prince Shōtoku (574–622), had led to a general politicization of the clergy, along with an increase in intrigue and corruption. In 784 Kammu shifted his capital from Nara to Nagaoka-kyō in a move that was said to be designed to encumber the powerful Nara Buddhist establishments out of state politics—while the capital moved, the major Buddhist temples, and their officials, stayed put. Indeed, there was a steady stream of edicts issued from 771 right through the period of Kūkai's studies which, for instance, sought to limit the number of Buddhist priests, and the building of temples. However, the move was to prove disastrous and was followed by a series of natural disasters including the flooding of half the city. In 785 the principal architect of the new capital, and royal favourite, Fujiwara no Tanetsugu, was assassinated.\nMeanwhile, Kammu's armies were pushing back the boundaries of his empire. This led to an uprising, and in 789 a substantial defeat for Kammu's troops. Also in 789 there was a severe drought and famine—the streets of the capital were clogged with the sick, and people avoiding being drafted into the military, or into forced labour. Many disguised themselves as Buddhist priests for the same reason. Consequently, in 792 Kammu abolished national conscription, replacing it with a system wherein each province formed a militia from the local gentry, however this system vitiated the authority of the Emperor and led to proliferation of private armies. Then in 794 Kammu suddenly shifted the capital again, this time to Heian-kyō, which is modern day Kyoto. The new capital was started early the previous year, but the change was abrupt and led to even more confusion amongst the populace. Kammu's rule witnessed the frontiers of Japan expanding into Izawa and Shiba, under the command of a preeminent commander, Tamura Maro.\nPolitically Kammu shored up his rule by changing the syllabus of the university. Confucian ideology still provided the ''raison d'être for the Imperial government. In 784 Kammu authorised the teaching of a new course based on the Spring and Autumn Annals based on two newly imported commentaries: Kung-yang and Ku-liang. These commentaries used political rhetoric to promote a state in which the Emperor, as \"Son of Heaven,\" should extend his sphere of influence to barbarous lands, thereby gladdening the people. In 798 the two commentaries became required reading at the government university.\nEmperor Kanmu was the first person to conceive the Shinsen Shōjiroku'', a Japanese genealogical record in 799 to properly track the clans' then ambiguous lineages, but it was not able to be completed before his death in 806. The project was later carried over by his sons and was completed during Emperor Saga's reign in 814.\nForeign relations\nChina\nKammu also sponsored the travels of the monks Saichō and Kūkai to China, from where they returned to found the Japanese branches of, respectively, Tendai and Shingon Buddhism.Alam, M. J. (2016). The early Japanese and their religio-cultural life: A historical overview. Philosophy and Progress, 55(1-2), 69–90.\nKorea\nHe was specifically interested in Paekche (and to an extent, Goguryeo) as his mother was of Paekche descent.\nKammu's emphasis towards his foreign heritage became prominent as his mother was not of the Imperial line, but was in fact a royal consort to Emperor Kōnin on top of coming from a clan of Korean origin, which could have negatively affected his ascension as emperor and be deemed illegitimate by some. To circumvent this, Kammu focused heavily on the mythological aspects of his mother's ancestor, Muryeong of Baekje and Muryeong's own ancestor, Dongmyeong of Goguryeo (Ko Chumong), emphasizing Chumong's heritage as a grandchild of the god Habaek and Kammu's own lineage that continued it claiming that he was part of the \"heavenly lineage\". He mentions this in Shoku Nihongi when honoring his late mother.\n\"The empress dowager's clan (surname) was Yamato and her name was Niigasa. Her majesty had astonishing looks that spoke of maturity that was quickly recognized. She was married to Emperor Kōnin before he was officially inaugurated when she had his son (Kammu/Yamabe). Her ancestor was the son of King Muryeong of Baekje, Prince Junda. The king of Baekje is said to be the descendant of King Dongmyeong who hatched from an egg when his mother, the daughter of Habaek was touched by sunlight. The empress dowager, therefore I, am the direct descendant of them.\"|author=Emperor Kanmu|title=Shoku Nihongi|source=Enryaku, 9th year, January 15th}}\nIn 790, Emperor Kanmu issued a rescript that treated the Kudara no Konikishi clan (a fellow Japanese clan of Paekche descent) as \"relatives by marriage\".\n\"The Kudara no Konikishi clan are my relatives by marriage.\"|author=Emperor Kanmu|title=Shoku Nihongi|source=Enryaku, 9th year, September 27th}}\nIt was related to the fact that the emperor's mother belonged to the Paekche-originated Yamato no Fuhito clan, who then claimed its roots in the Paekche royal family. In addition, according to the Shoku Nihongi, Takano no Niigasa was a 10th-generation descendant of King Muryeong of Baekje through his son Prince Junda (Nihon Shoki, chapter 17), making Emperor Kammu an 11th-generation descendant of Muryeong through maternal lineage. The Kudara no Konikishi clan fell under the influence of the southern branch of the Fujiwara clan after Kudara no Konikishi Myōshin had married Fujiwara no Tsugutada around 754. Emperor Kanmu's rescript of 790 aimed to support Myōshin's appointment as lady-in-waiting (尚侍), the highest post among court ladies, due to her similar background with Kammu.\nA 14th century book called \"Jinnō Shōtōki\" by Kitabatake Chikafusa states that a record that claimed of Japan's origin with Korea was lost during Kammu's time, which indicates that such intentions were highly regarded during Emperor Kanmu's reign up until the book's disappearance.\n\"Originally, it was recorded that \"Japan and the Three Kingdoms of Korea are the same\" but the book was lost during Emperor Kanmu's reign.\"|author=Kitabatake Chikafusa|title=Jinnō Shōtōki|source=}}\nIt can be deduced that Kammu advocated his Korean ancestry for both political and social reasons at the time, which was later officially recognized by the government coming from the Emperor of Japan.\nKugyō\nis a collective term for the very few most powerful men attached to the court of the Emperor of Japan in pre-Meiji eras.\nIn general, this elite group included only three to four men at a time. These were hereditary courtiers whose experience and background would have brought them to the pinnacle of a life's career. During Kammu's reign, this apex of the Daijō-kan included:\n* Sadaijin, Fujiwara no Uona (藤原魚名), 781–82.\n* Sadaijin, Fujiwara no Tamaro (藤原田麿), 783.\n* Udaijin, Ōnakatomi no Kiyomaro (大中臣清麿), 771–81\n* Udaijin, Fujiwara no Tamaro (藤原田麿), 782–83.\n* Udaijin, Fujiwara no Korekimi (藤原是公), 783–89.\n* Udaijin, Fujiwara no Tsuginawa (藤原継縄), 790–96.\n* Udaijin, Miwa ōkimi or Miwa oh (神王), 798–806\n* Udaijin, Fujiwara no Uchimaro (藤原内麻呂) 756–812, 806–12.\n* Dainagon\nWhen the daughter of a chūnagon became the favored consort of the Crown Prince Ate (later known as Heizei-tennō), her father's power and position in court was affected. Kammu disapproved of Fujiwara no Kusuko, daughter of Fujiwara no Tanetsugu; and Kammu had her removed from his son's household.\n* Chūnagon, Fujiwara no Tadanushi\nConsorts and children\nEmperor Kammu's Imperial family included 36 children.\n*Empress (Kōgō): Fujiwara no Otomuro (藤原乙牟漏), Fujiwara no Yoshitsugu’s daughter\n**First Son: Imperial Prince Ate (安殿親王) later Emperor Heizei\n**Fourth Son: Imperial Prince Kamino (賀美能親王/神野親王) later Emperor Saga\n**Imperial Princess Koshi (高志内親王; 789–809), married to Emperor Junna\n*Madame (Bunin later Kōtaigō): Fujiwara no Tabiko (藤原旅子), Fujiwara no Momokawa’s daughter\n**Fifth Son: Imperial Prince Ōtomo (大伴親王) later Emperor Junna\n*Consort (Hi): Imperial Princess Sakahito (酒人内親王), Emperor Kōnin’s daughter\n**First Daughter: Imperial Princess Asahara (朝原内親王; 779–817), 12th Saiō in Ise Grand Shrine (782–before 796), and married to Emperor Heizei\n*Madame (Bunin): Fujiwara no Yoshiko (藤原吉子; d.807), Fujiwara no Korekimi’s daughter\n**Second Son: Imperial Prince Iyo (伊予親王; 783–807)\n*Madame (Bunin) : Tajihi no Mamune (多治比真宗; 769–823), Tajihi no Nagano's daughter\n**Sixth Son: Imperial Prince Kazurahara (葛原親王; 786–853)\n**Ninth Son: Imperial Prince Sami (佐味親王; 793–825)\n**Tenth Son: Imperial Prince Kaya (賀陽親王; 794–871)\n**Imperial Prince Ōno (大野親王/大徳親王; 798–803)\n**Imperial Princess Inaba (因幡内親王; d.824)\n**Imperial Princess Anou (安濃内親王; d.841)\n*Madame (Bunin): Fujiwara no Oguso (藤原小屎), Fujiwara no Washitori's daughter\n**Third Son: Imperial Prince Manta (万多親王; 788–830)\n*Court Lady (Nyōgo) : Ki no Otoio (紀乙魚; d.840), Ki no Kotsuo's daughter\n*Court Lady (Nyōgo) : Kudarao no Kyōhō (百済王教法; d.840), Kudara no Shuntetsu's daughter\n*Court Lady (Nyōgo) : Tachibana no Miiko (橘御井子), daughter of Tachibana no Irii (橘入居)\n**Imperial Princess Sugawara (菅原内親王; d.825)\n**Sixteenth Daughter: Imperial Princess Kara (賀楽内親王; d.874)\n*Court Lady (Nyōgo) : Fujiwara no Nakako (藤原仲子), Fujiwara no Ieyori's daughter\n*Court Lady (Nyōgo) : Tachibana no Tsuneko (橘常子; 788–817), Tachibana no Shimadamaro's daughter\n**Ninth Daughter: Imperial Princess Ōyake (大宅内親王; d.849), married to Emperor Heizei\n*Court Lady (Nyōgo): Fujiwara no Shōshi (藤原正子), Fujiwara no Kiyonari's daughter\n*Court Lady (Nyōgo): Sakanoue no Matako (坂上全子, d.790), Sakanoue no Karitamaro's daughter\n**Twelfth Daughter: Imperial Princess Takatsu (高津内親王; d.841), married to Emperor Saga\n*Court Lady (Nyōgo): Sakanoue no Haruko (坂上春子, d.834), Sakanoue no Tamuramaro's daughter\n**Twelfth Son: Imperial Prince Fujii (葛井親王; 800–850)\n**Imperial Princess Kasuga (春日内親王; d.833)\n*Court Lady (Nyōgo): Fujiwara no Kawako (藤原河子, d.838), Fujiwara no Ōtsugu's daughter\n**Thirteenth Son: Imperial Prince Nakano (仲野親王; 792–867)\n**Thirteenth Princess: Imperial Princess Ate (安勅内親王; d.855)\n**Imperial Princess Ōi (大井内親王; d.865)\n**Imperial Princess Ki (紀内親王; 799–886)\n**Imperial Princess Yoshihara (善原内親王; d.863)\n*Court Lady (Nyōgo): Fujiwara no Azumako (藤原東子, d.816), Fujiwara no Tanetsugu's daughter\n**Imperial Princess Kannabi (甘南備内親王, 800–817), Married to Emperor Heizei\n*Court Lady (Nyōgo): Fujiwara no Heishi/Nanshi (藤原平子/南子, d.833), Fujiwara no Takatoshi's daughter\n**Eighth Daughter: Imperial Princess Ito (伊都内親王), married to Prince Abo\n*Court Lady (Nyōgo): Ki no Wakako (紀若子), Ki no Funamori's daughter\n**Seventh Son: Imperial Prince Asuka (明日香親王, d.834)\n*Court Lady (Nyōgo): Fujiwara no Kamiko (藤原上子), Fujiwara no Oguromaro's daughter\n**Imperial Princess Shigeno (滋野内親王, 809–857)\n*Court Lady (Nyōgo): Tachibana no Tamurako (橘田村子), Tachibana no Irii's daughter\n**Imperial Princess Ikenoe (池上内親王, d.868)\n*Court Lady (Nyōgo): Kawakami no Manu (河上好), Nishikibe no Haruhito's daughter\n**Imperial Prince Sakamoto (坂本親王, 793–818)\n*Court Lady (Nyōgo): Kudarao no Kyōnin (百済王教仁), Kudara no Bukyō's daughter\n**Imperial Prince Ōta (大田親王, d.808)\n*Court Lady (Nyōgo): Kudarao no Jōkyō (百済王貞香), Kudara no Kyōtoku's daughter\n**Imperial Princess Suruga (駿河内親王, 801–820)\n*Court Lady (Nyōgo): Nakatomi no Toyoko (中臣豊子), Nakatomi no Ōio's daughter\n**Fifth Daughter: Imperial Princess Fuse (布勢内親王, d.812), 13th Saiō in Ise Shrine, 797–806\n*Court lady (Nyoju): Tajihi no Toyotsugu (多治比豊継), Tajihi no Hironari's daughter\n**Nagaoka no Okanari (長岡岡成, d.848), removed from the Imperial Family by receiving the family name from Emperor (Shisei Kōka, 賜姓降下) in 787\n*Court Lady (Nyoju):: Kudara no Yōkei (百済永継), Asukabe no Natomaro's daughter\n**Yoshimine no Yasuyo (良岑安世, 785–830), removed from the Imperial Family by receiving the family name from Emperor (Shisei Kōka, 賜姓降下) in 802\nAncestry\nLegacy\nIn 2001, Japan's emperor Akihito told reporters \"I, on my part, feel a certain kinship with Korea\", given the fact that it is recorded in the Chronicles of Japan that the Emperor Kammu's mother was one of the descendant of King Muryong of Baekje (462–523). It was the first time that a Japanese emperor publicly referred to any Korean ancestry in the imperial line. According to the Shoku Nihongi, Emperor Kammu's mother, Takano no Niigasa (720–90), is a descendant of Prince Junda, son of Muryeong, who died in Japan in 513 (Nihon Shoki, Chapter 17).\nSee also\n* Emperor of Japan\n* List of Emperors of Japan\n* Heian-kyō\n* Heian Shrine\n* Kammu Seamount\nNotes\n— a stylized chrysanthemum blossom]]\nReferences\n*\n* Ponsonby-Fane, Richard. (1959). [https://books.google.com/books?id=SLAeAAAAMAAJ&q=The+Imperial+House+of+Japan  The Imperial House of Japan.] Kyoto: Ponsonby Memorial Society.\n* Titsingh, Isaac. (1834). [https://books.google.com/books?id=18oNAAAAIAAJ&q=nipon+o+dai+itsi+ran  Annales des empereurs du Japon] (Nihon Ōdai Ichiran). Paris: Royal Asiatic Society, Oriental Translation Fund of Great Britain and Ireland.\n* Varley, H. Paul. (1980). [https://books.google.com/books?id=tVv6OAAACAAJ  Jinnō Shōtōki: A Chronicle of Gods and Sovereigns.] New York: Columbia University Press. ;"
    }
  ]
}