{
  "content": [
    {
      "type": "text",
      "text": "# Emperor Kōgon__disambig_2\n\n}}\n| succession     = 1st Northern Emperor\n| image          = 光厳法皇像.jpg\n| caption        =\n| reign          = 22 October 1331 – 7 July 1333\n| coronation     =\n| predecessor    = Go-Daigo\n| successor      = Kōmyō\n| posthumous name = Tsuigō:Emperor Kōgon ( or )\n| spouse         = Princess Hisako\n| issue          = Emperor SukōEmperor Go-Kōgon\n| issue-link     = #Genealogy\n| issue-pipe     = among others...\n| royal house    = Imperial House of Japan\n| father         = Emperor Go-Fushimi\n| mother         =   Saionji (Fujiwara) Neishi\n| birth_date  = 1 August 1313\n| birth_place =\n| death_date  =\n| death_place =\n| place of burial=\n| signature =\n|}}\nwas the first of the Emperors of Northern Court during the Period of the Northern and Southern Courts in Japan. His reign spanned the years from 1331 through 1333.\nGenealogy\nBefore his ascension to the Nanboku-chō throne, his personal name (his imina) was Kazuhito-shinnō (量仁親王).  He was the third son of Emperor Go-Fushimi of the Jimyōin line.  His mother was Kōgimon'in Neishi (広義門院寧子). He was adopted by his uncle, Emperor Hanazono. His family included:\n*Empress: Imperial Princess Yoshiko (懽子内親王) later Senseimon-in (宣政門院), Emperor Go-Daigo’s daughter\n**Second daughter: (b. 1335)\n**Third daughter: Imperial Princess Mitsuko (b. 1337; 光子内親王)\n*Consort: Imperial Princess Hisako (寿子内親王) later Kianmon-in (徽安門院), Emperor Hanazono’s daughter\n*Lady-in-waiting: Sanjō Shūshi (三条秀子) later Yōrokumon’in (陽禄門院), Ogimachi Sanjo Kinhide's daughter\n**First daughter: (b. 1333)\n**Princess\n**First son: Imperial Prince Okihito (興仁親王) later Emperor Sukō\n**Second son: Imperial Prince Iyahito (弥仁親王) later Emperor Go-Kōgon\n*Naishi: Ima-no-kata, Saionji Sanehira's daughter\n*Naishi: Dai-no-kata, Saionji Saneakira's daughter\n**Fourth Son: Imperial Prince Sonchō (1344–1378; 尊朝親道親王)\n**Princess\n*Naishi: Ichijo-no-tsubone, Ogimachi Kinkage's daughter\n**Imperial Prince Yoshihito (died 1415; 義仁親王)\n*Naishi: Oinomikado Fuyuuji's daughter\n**daughter: (1331–1402)\n*Unknown\n**Daughter: Hanarin Songen (d. 1386; 華林恵厳)\nEvents of Kōgon's life\nIn his own lifetime, Kōgon and those around him believed that he occupied the Chrysanthemum Throne from 22 October 1331 until 7 July 1333.  Kazuhito-shinnō was named Crown Prince and heir to Emperor Go-Daigo of the Daikakuji line in 1326. At this time in Japanese history, by decision of the Kamakura shogunate, the throne would alternate between the Daikakuji and Jimyōin lines every ten years.  However, Go-Daigo did not comply with this negotiated agreement.\nIn 1331, when Go-Daigo's second attempt to overthrow the shogunate became public, the Shogunate seized him, exiled him to the Oki Islands, and enthroned Kōgon on 22 October. Emperor Go-Daigo used the 17-petal chrysanthemum emblem during his exile. He escaped Oki in 1333, with the help of Nawa Nagatoshi and his family, and raised an army at Funagami Mountain in Hōki Province (the modern town of Kotoura in Tōhaku District, Tottori Prefecture).  Meanwhile, Ashikaga Takauji (足利 尊氏), the chief general of the Hōjō family, turned against the Hōjō and fought for Emperor Go-Daigo in the hopes of being named shōgun. Takauji attacked Hōjō Nakatomi and Hōjō Tokimasu, the Rokuhara Tandai, or chiefs of the Kamakura shogunate in Kyoto. They both fled to the east, but were captured in Ōmi Province. On 7 July 1333, Go-Daigo seized the throne from Emperor Kōgon and attempted to re-established Imperial control in what is referred to as the Kenmu Restoration (1333–1336). Go-Daigo's attempt failed, however, after Ashikaga Takauji turned against him.\nIn 1336, Takauji installed Kōgon's younger brother on the throne as Emperor Kōmyō. Go-Daigo fled to Yoshino, in Yamato Province and continued to lay proper claim to the throne, establishing what would come to be known as the Southern Court. Kōmyō's court remained in Kyoto and would come to be known as the Northern Court. This marked the beginning of the Northern and Southern Courts Period of Japanese history, which lasted until 1392.\nIn April 1352, taking advantage of a family feud in the Ashikaga clan known as the Kan'ō Disturbance, Emperor Go-Murakami of the Southern Court captured Kyōto, and carried away Emperor Kōgon, Emperor Kōmyō, Emperor Sukō, and the Crown Prince Tadahito.  They finally ended up in Anau, the location of the Southern Court.\nFollowing this, Kōgon was held under house arrest for the remainder of his life. In his final years, he converted to Zen Buddhism, and died on 5 August 1364.\nEras of Kōgon's reign\nThe years of Kōgon's reign are more specifically identified by more than one era name or nengō.\n:'Pre-Nanboku-chō period'\n** Genkō (1331–1334)\n** Kenmu                (1334–1336)\n:'Nanboku-chō Southern court\n*Eras as reckoned by legitimate Court (as determined by Meiji rescript)\n** ...\n:Nanboku-chō Northern court'\n*Eras as reckoned by pretender Court (as determined by Meiji rescript)\n** Shōkei (1332–1338)\nSouthern Court Rivals\n* Emperor Go-Daigo\nAncestry\n|boxstyle_1=background-color: #fcc;\n|boxstyle_2=background-color: #fb9;\n|boxstyle_3=background-color: #ffc;\n|boxstyle_4=background-color: #bfc;\n|boxstyle_5=background-color: #9fe;\n|1= 1. Emperor Kōgon\n|2= 2. Emperor Go-Fushimi (1288-1336)\n|3= 3. Saionji Neishi/Yasuko (1292-1357)\n|4= 4. Emperor Fushimi (1265-1317)\n|5= 5. Itsutsuji Tsuneko (d. 1324)\n|6= 6. Saionji Kinhira (1264-1315)\n|7= 7. Fujiwara Kaneko\n|8= 8. Emperor Go-Fukakusa (1243-1304)\n|9= 9. Tōin Inshi (1246-1329)\n|10= 10. Itsutsuji Tsuneuji\n|11=\n|12=12.Saionji Sanekane (1249-1322)\n|13=13. Nakanoin Akiko\n|14=14. Fujiwara Mitsuyasu\n|15=\n|16= 16. Emperor Go-Saga (1220-1272)\n|17= 17. Fujiwara no Kitsushi (1225-1292)\n|18= 18. Tōin Saneo (1219-1273)\n|19= 19. Fujiwara Kurako\n|20=\n|21=\n|22=\n|23=\n|24= 24. Saionji Kinsuke (1223-1267)\n|25= 25. Nakahara\n|26= 26. Nakanoin Michinari (1222-1287)\n|27=\n|28=\n|29=\n|30=\n|31=\n}}\nNotes\n— a stylized chrysanthemum blossom]]\nReferences\n* Ponsonby-Fane, Richard Arthur Brabazon. (1959). [https://books.google.com/books?id=SLAeAAAAMAAJ&q=The+Imperial+House+of+Japan  The Imperial House of Japan.] Kyoto: Ponsonby Memorial Society. [http://www.worldcat.org/wcpa/oclc/194887 OCLC 194887]\n* Titsingh, Isaac, ed. (1834). [Siyun-sai Rin-siyo/Hayashi Gahō, 1652], Nipon o daï itsi ran; ou, [https://books.google.com/books?id=18oNAAAAIAAJ&q=nipon+o+dai+itsi+ran  Annales des empereurs du Japon.]  Paris: Oriental Translation Fund of Great Britain and Ireland.\nSee also\n* Emperor of Japan\n* List of Emperors of Japan\n* Imperial cult\n* Emperor Go-Kōgon"
    }
  ]
}