{
  "content": [
    {
      "type": "text",
      "text": "# Emperor Wenzong of Tang__disambig_1\n\n| succession   = Emperor of the Tang dynasty\n| predecessor  = Emperor Jingzong\n| successor    = Emperor Wuzong\n| image        = TangWenzongAlt.jpg\n| birth_date   = 20 November 809\n| death_date   = 10 February 840 (aged 30)\n| burial_place = Zhang Mausoleum (章陵)\n| family_name  = Lǐ (李)\n| clan_name    =\n| given_name   = Initially Hán (涵),Later Áng (昂) (changed 827)\n| reign        = 13 January 827 – 10 February 840\n| house        = Li\n| dynasty      = Tang\n| era dates    =\n| era name     =\n| temple name  = Wénzōng (文宗)\n| posthumous name = Emperor Zhaoxian (昭獻皇帝) (short)  Emperor Yuansheng Zhaoxian Xiao(元聖昭獻孝皇帝) (full)\n| father       = Emperor Muzong\n| mother       = Empress Zhenxian\n| issue        = Li YongPrincess XingtangPrincess XipingPrincess LangningPrincess Guanghua\n}}\n| l = \"Cultured Ancestor of the Tang\"\n| p = Táng Wénzōng\n| altname = Li Ang\n| c2 =\n| l2 = (personal name)\n| p2 = Lǐ Áng\n}}\nEmperor Wenzong of Tang (809–840), personal name Li Ang, né Li Han (李涵), was an emperor of the Tang dynasty of China. He reigned from 827 to 840. Emperor Wenzong was the second son of Emperor Muzong and younger brother of Emperor Jingzong. A rare occurrence in Chinese history, Emperor Wenzong, along with his elder brother Emperor Jingzong and younger brother Emperor Wuzong, reigned in succession.\nBackground\nLi Han was born in late 809, during the reign of his grandfather Emperor Xianzong.  His father, Li You was then the Prince of Sui under Emperor Xianzong, but while Li You was considered, under Confucian principles of succession, to be the proper heir to the throne, because his mother (Li Han's grandmother) Consort Guo, was Emperor Xianzong's wife and crown princess while Emperor Xianzong was crown prince, Li You was not created crown prince for some time; his older brother Li Ning, by Emperor Xianzong's concubine Consort Ji, was. Only after Li Ning's death in 811 was Li You, whose name was then changed to Li Heng, created crown prince in 812.  Li Han was Li You's second son, being born four months after his older brother Li Zhan. His mother was Li You's concubine Consort Xiao.\nIn 820, Emperor Xianzong died, and Li Heng took the throne (as Emperor Muzong).  In 821, Emperor Muzong created a large number of his brothers and sons imperial princes, and Li Han was created the Prince of Jiāng.  In 824, Emperor Muzong died and was succeeded by Li Zhan (as Emperor Jingzong).  Around the new year 827, Emperor Jingzong was assassinated by a group of imperial guards and eunuchs, led by the eunuch Liu Keming (劉克明).  Liu initially tried to have Emperor Muzong's younger brother Li Wu the Prince of Jiàng (note different tone) made emperor, but soon, a group of powerful eunuchs—the directors of palace communications Wang Shoucheng and Yang Chenghe (楊承和) and commanders of the Shence Armies Wei Congjian (魏從簡) and Liang Shouqian (梁守謙) counteracted against the conspirators, launching forces to slaughter them.  Li Wu was also killed in this event.  Wang and the other eunuchs subsequently had Li Han named the new emperor by orders issued in the name of his grandmother Consort Guo (who was then grand empress dowager) (as Emperor Wenzong).  His name was changed to Li Ang.\nReign\nEarly Dahe/Taihe Era\nIt was said that at the start of Emperor Wenzong's reign, he, having observed the wastefulness that his father Emperor Muzong and brother Emperor Jingzong displayed in their reigns, sought to conserve, govern diligently, and meet with the officials frequently.  The people thought that a peaceful time would be coming.  However, it was also said that Emperor Wenzong, while humble and willing to open to suggestions, was indecisive, often changing his mind after initially agreeing to the chancellors' suggestions.  At one point, the chancellor Wei Chuhou objected and offered to resign, but Emperor Wenzong did not accept his resignation.  Meanwhile, Emperor Wenzong honored his mother Consort Xiao as an empress dowager, and continued to honor his grandmother Grand Empress Dowager Guo and Emperor Jingzong's mother Empress Dowager Wang as well, so there were three empresses dowager in the palace.  It was said that he served them with filial piety, always offering the best of the tributes to them first.\nOne of the major moves that Emperor Wenzong had to make, however, dealt with war—as, at the very end of Emperor Jingzong's reign, after the death of Li Quanlüe (李全略) the military governor (Jiedushi) of Henghai Circuit (橫海, headquartered in modern Cangzhou, Hebei), Li Quanlüe's son Li Tongjie seized control of the circuit without imperial sanction, hoping to succeed his father.  Initially, the imperial government took no action, and after Emperor Wenzong took the throne, Li Tongjie sent his secretary Cui Congzhang (崔從長) and brothers Li Tongzhi (李同志) and Li Tongsun (李同巽) to the capital Chang'an to pay homage to Emperor Wenzong, hoping that Emperor Wenzong would approve of his succession.  In response, Emperor Wenzong commissioned Li Tongjie as the military governor of Yanhai Circuit (兗海, headquartered in modern Jining, Shandong) and transferred a former military governor of Henghai, Wu Chongyin, to Henghai.  Li Tongjie decided to resist militarily, and he was supported by the warlord Wang Tingcou, the military governor of neighboring Chengde Circuit (成德, headquartered in modern Shijiazhuang, Hebei).  Emperor Wenzong mobilized a number of circuits around Henghai to attack it, but could not immediately achieve success.  Not until 829 was Li Tongjie defeated by the imperial general Li You (note different character than Emperor Muzong).\nIn the aftermath of Li Tongjie's defeat, however, one of the other warlords of the region, Shi Xiancheng the military governor of Weibo Circuit (魏博, headquartered in modern Handan, Hebei), fearing that he would be the imperial forces' next target, offered to surrender his circuit to imperial control.  Emperor Wenzong transferred Shi to Hezhong Circuit (河中, headquartered in modern Yuncheng, Shanxi) and commissioned the imperial general Li Ting (李聽) to succeed him.  Before Shi could depart Weibo, however, the Weibo soldiers mutinied, killed him, and supported the officer He Jintao as their leader in resisting Li Ting.  Subsequently, He Jintao defeated Li Ting, and the imperial government, with its treasury drained by the Henghai campaign, decided not to wage another war, and Emperor Wenzong allowed He Jintao to become the military governor of Weibo.\nIn late 829, Nanzhao, irritated by incursions by Tang's Xichuan Circuit (西川, headquartered in modern Chengdu, Sichuan) troops, who were forced to resort to raiding Nanzhao's border regions due to the reduction in salaries by Xichuan's military governor, the former chancellor Du Yuanying, made a major attack against Xichuan.  The Nanzhao forces advanced all the way to Chengdu, almost capturing it.  Nanzhao demanded that Emperor Wenzong take action against Du, and Emperor Wenzong exiled him and subsequently entered into a peace agreement with Nanzhao.  Still, Nanzhao forces seized tens of thousands of people from Xichuan and took them to Nanzhao as captives.\n830 saw the start of factionalism, later known as the Niu-Li Factional Struggles, within Emperor Wenzong's administration—as, by this point, Wei Chuhou had died, and fellow chancellor Pei Du, in his old age, had taken less of a lead on government decisions (and was eventually sent out of the capital to serve as a military governor).  The succeeding chancellors Li Zongmin and Niu Sengru were considered factional figures (of the faction historians later referred to as the Niu Faction, named after Niu), and they, together, ejected allies of their political rival Li Deyu (after whom the Li Faction was later named by historians) from government.  (Pei had recommended Li Deyu to be chancellor, but Li Zongmin was said to have triumphed over Li Deyu due to assistance by the eunuchs.)  Meanwhile, Emperor Wenzong, tired of the eunuchs' influence over his governance and control of the palace, was secretly planning with the official Song Shenxi on how the eunuchs, particularly Wang Shoucheng, could be disarmed.  To further plan this, Emperor Wenzong made Song a chancellor as well.  However, when Wang and his strategist Zheng Zhu later heard about the plot in 831, they counteracted by falsely accusing Song of planning to overthrow Emperor Wenzong and replace him with his brother Li Cou the Prince of Zhang.  As a result, both Li Cou and Song were exiled.\nAn event of major historical controversy occurred in 831.  Li Deyu was then the military governor of Xichuan.  Xidamou (悉怛謀), the Tufan defender of Wei Prefecture (維州, in modern Ngawa Tibetan and Qiang Autonomous Prefecture, Sichuan), had surrendered Wei Prefecture to him.  Li Deyu advocated accepted Xidamou's surrender and further use it as a base to launch a major attack on Tufan.  Niu, citing the peace treaty that Tang had entered with Tufan and that a Tufan attack against the Chang'an region would be devastating, advised against accepting Xidamou.  Emperor Wenzong agreed and ordered Li Deyu to return Wei Prefecture to Tufan.  Tufan subsequently slaughtered Xidamou and his subordinates, leading to a public outcry.  (For centuries following, up to today, historians disagree over whether Li Deyu or Niu was correct.)\nLate Dahe/Taihe Era\nIn 832, Emperor Wenzong created his son Li Yong crown prince.  (Emperor Wenzong had previously planned to create Emperor Jingzong's oldest son Li Pu the Prince of Jin crown prince, but Li Pu died in 828, and it was said that Emperor Wenzong was so saddened that he waited for years before creating Li Yong crown prince.)\nAlso in 832, in the aftermaths of the Xidamou incident, with popular sentiment turning against Niu Sengru, Niu resigned his chancellor position to become the military governor of Wuchang Circuit (武昌, headquartered in modern Wuhan, Hubei), and Li Deyu was recalled to Chang'an, becoming chancellor in 833.  Li Deyu used the opportunity to attack Li Zongmin's associates for factionalism, and many were demoted.  Li Zongmin himself was soon sent out of Chang'an to serve as the military governor of Shannan West Circuit (山南西道, headquartered in modern Hanzhong, Shaanxi).\nAround the new year 833, Emperor Wenzong suffered a stroke.  As Zheng Zhu was a talented physician, Wang Shoucheng recommended Zheng to Emperor Wenzong, and after Zheng was able to treat Emperor Wenzong, Emperor Wenzong became close to Zheng, but it was said that from this point on, Emperor Wenzong's spirit was weakened and could not be as strong as before.  Subsequently, another associate of Wang's, Li Zhongyan, also became a close associate of Emperor Wenzong's, despite Li Deyu's attempts to reject him based on his past crimes.  In order to counteract Li Deyu, Zheng and Li Zhongyan advocated for Li Zongmin's return from Shannan West, to again serve as chancellor, with Li Deyu sent to Zhenhai Circuit (鎮海, headquartered in modern Zhenjiang, Jiangsu).  It was said that around this time, Emperor Wenzong, exasperated at the factionalism that the Niu and Li Factions were engaging, commended, \"It is easy to destroy the bandits [(i.e., the warlords)] north of the Yellow River, but difficult to destroy the factionalism among officials.\"  Subsequently, with Li Deyu having been accused of being closely associated with Li Cou's wet nurse Du Zhongyang (杜仲陽), he was further demoted and exiled.  When the chancellor Lu Sui tried to intercede for Li Deyu, he, too, was sent out of the capital to serve as the military governor of Zhenghai.\nLi Zongmin, however, would also not remain long as chancellor.  He had offended Zheng by refusing to give Zheng a high-ranking post, and subsequently, when the family members of his close associate Yang Yuqing (楊虞卿) the mayor of Jingzhao Municipality (京兆, i.e., the Chang'an region) were accused of spreading rumors that Zheng was making immortality pills for Emperor Wenzong that used infant hearts and livers as ingredients, Yang was arrested and exiled.  When Li Zongmin tried to intercede for Yang, he too was exiled.  It was said that Li Zhongyan (whose name had been changed to Li Xun by this point) and Zheng then used the opportunity to accuse any official they did not like as factional associates of Li Deyu or Li Zongmin, having them ejected from the imperial government.  Serving as chancellors, by this point, were Li Xun, Li Xun's associates Jia Su and Shu Yuanyu, and the senior official Wang Ya.\nMeanwhile, Emperor Wenzong, Li Xun, and Zheng, who were not suspected by the eunuchs because Li Xun and Zheng had both been recommended by Wang, had been planning a plot to slaughter the powerful eunuchs, and several key eunuchs had been taken out individually through assassinations and exiles (followed by executions) by this point.  In winter 835, the plan was beginning to be put into motion, as Zheng was sent to Fengxiang Circuit (鳳翔, headquartered in modern Baoji, Shaanxi), to establish an army to use against the eunuchs.  When, subsequently, Wang Shoucheng was forced to commit suicide on Emperor Wenzong's orders, Emperor Wenzong, Li Xun, and Zheng planned to use Wang Shoucheng's funeral as an excuse to gather the eunuchs and then use Zheng's troops to slaughter them.  However, Li Xun, who was secretly jealous of Zheng, had a different plan that even Emperor Wenzong did not know about—to attack the eunuchs several days before Wang's funeral and then also destroy Zheng.  To this end, on 14 December, Li Xun had his associate, the general Han Yue (韓約), falsely announce that there were sweet dews (甘露, ganlu in Chinese) on a tree near Han's headquarters, planning to trap the leading eunuchs, Qiu Shiliang and Yu Hongzhi (魚弘志) the commanders of the Shence Armies, at Han's headquarters and then slaughtering the eunuchs there.  However, Qiu and Yu, once they arrived at Han's headquarters, realized that something was amiss, and quickly returned to the imperial hall and seized Emperor Wenzong, returning to the palace with him.  They subsequently launched the Shence Army soldiers and slaughtered and arrested a high number of officials, including Li Xun.  Jia, Shu, and Wang Ya were subsequently also executed, along with a large number of Li Xun's associates, under the accusation that they had planned to overthrow Emperor Wenzong and support Zheng as the new emperor.  Zheng was also assassinated at Fengxiang.  (Because the claims of sweet dews were used as a tool to try to trap the eunuchs, this incident later became known as the Ganlu Incident.)  In the aftermaths of the incident, Emperor Wenzong became physically under the eunuchs' hold, and he, the new chancellors Li Shi and Zheng Tan, and the other imperial officials, had their authorities severely reduced.\nKaicheng Era\nIn spring 836, the warlord Liu Congjian the military governor of Zhaoyi Circuit (昭義, headquartered in modern Changzhi, Shanxi), submitted harshly-worded petitions accusing Qiu Shiliang and the other eunuchs of crimes.  It was said that only after Liu's petitions that Qiu and the other eunuchs became apprehensive and allowed Emperor Wenzong, Li Shi, and Zheng Tan some ability to govern based on their own will.  Still, when Emperor Wenzong ordered that Wang Ya and 10 other officials who were killed in the Ganlu Incident buried, Qiu had those officials bodies dug out of the tombs and thrown into the Wei River.\nIt was said Emperor Wenzong, after the Ganlu Incident, became depressed and never smiled, and he was often seen mumbling to himself even at grand feasts.  At one point, in a conversation with the imperial scholar Zhou Chi, when he asked Zhou what kind of ancient rulers he could be compared with, and Zhou, to flatter him, responded that he could be compared with the mythical benevolent rulers Emperor Yao and Emperor Shun, Emperor Wenzong instead compared himself to the final rulers of the Zhou dynasty and Han dynasty—King Nan of Zhou and Emperor Xian of Han.  When Zhou Chi, surprised, noted that both were dynasty-ending rulers, Emperor Wenzong stated:\nIn 837, Li Shi, after Qiu made an assassination attempt on him, resigned his chancellorship, and in his place, Chen Yixing, Yang Sifu, and Li Jue became chancellors successively, along with Zheng.  Soon, partisanship again flared among the chancellors, pitting Zheng and Chen, both of whom were considered Li Faction leaders, against Yang and Li Jue, both of whom were considered Niu Faction leader, and it was said that the chancellors' advice became motivated by partisan considerations, making it difficult for Emperor Wenzong to rule on them, until Zheng and Chen were removed in 839.\nMeanwhile, Emperor Wenzong's favorite concubine Consort Yang made false accusations against Li Yong's mother Consort Wang, and Consort Wang died as a result.  Subsequently, there were further accusations that Li Yong was living in excess, and in 838, Emperor Wenzong briefly put Li Yong under arrest and considered removing him.  Only at the urging of the imperial officials and Shence Army officers did Emperor Wenzong relent.  However, Li Yong died shortly after, and some historians believe that Li Yong was murdered at Emperor Wenzong's implicit approval.\nAfter Li Yong's death, with Li Zongjian Prince of Jiang the only other son of Wenzong presumably already died, Consort Yang recommended Emperor Wenzong's younger brother Li Rong the Prince of An to be the new crown prince.  When Emperor Wenzong consulted the chancellors, however, Li Jue opposed.  Emperor Wenzong thus created Emperor Jingzong's youngest son Li Chengmei the Prince of Chen to be the new crown prince in late 839.  By spring 840, Emperor Wenzong was seriously ill.  He had his trusted eunuchs Liu Hongyi (劉弘逸) and Xue Jileng (薛季稜) summon the chancellors Li Jue and Yang Sifu to the palace, intending to entrust Li Chengmei to them.  However, Qiu and Yu Hongzhi, in control of the palace, opposed Li Chengmei because they were not consulted before Emperor Wenzong created Li Chengmei crown prince.  Despite Li Jue's opposition, they issued an edict in Emperor Wenzong's name demoting Li Chengmei back to Prince of Chen (under the excuse that Li Chengmei was too young) and creating another brother of Emperor Wenzong's, Li Chan the Prince of Ying crown prince.  Emperor Wenzong soon died, and after Emperor Wenzong's death, Chou persuaded Li Chan to order Li Chengmei, as well as Consort Yang and Li Rong, to commit suicide.  Li Chan then took the throne (as Emperor Wuzong).\nCulture\nEmperor Wenzong issued an imperial decree, stating Li Bai's poetry, Zhang Xu's calligraphy and Pei Min's swordplay as the \"Three Wonders of the Great Tang Empire\".\nIn 837, a project commissioned by Emperor Wenzong, to have the texts and commentaries of the Confucian classics carved on stone tablets and publicly displayed, was completed at the imperial university for nobles (國子監, Guozi Jian).\nForeign relations\nEmperor Wenzong caused a letter to be drafted for delivery to the Emperor of Japan, which he sent via Japanese ambassadors who had traveled from Heian-kyō as part of a diplomatic mission.  On their return home in 839, these ambassadors presented the communication from the Chinese emperor to Emperor Ninmyō.\nChancellors during reign\n* Dou Yizhi (827–828)\n* Pei Du (827–830, 839)\n* Wei Chuhou (827–828)\n* Wang Bo (827–830)\n* Lu Sui (828–835)\n* Li Zongmin (829–833, 834–835)\n* Niu Sengru (830–832)\n* Song Shenxi (830–831)\n* Li Deyu (833–834)\n* Wang Ya (833–835)\n* Jia Su (835)\n* Li Guyan (835, 836–837)\n* Shu Yuanyu (835)\n* Li Xun (835)\n* Zheng Tan (835–839)\n* Li Shi (835–838)\n* Chen Yixing (837–839)\n* Yang Sifu (838–840)\n* Li Jue (838–840)\n* Cui Dan (839–840)\nConsorts and issue\n* Virtuous Consort, of the Wang clan (; d. 838)\n** Li Yong, Crown Prince Zhuangke (; d. 838), first son\n* Worthy Consort Yang, of the Yang clan of Hongnong (; d. 840)\n*Pure Consort Wang, of the Wang clan (王淑妃 王氏)\n*Worthy Consort Liu, of the Liu clan (刘贤妃 刘氏)\n*Lady, of the Guo clan (郭氏)\n* Unknown\n** Li Zongjian, Prince Jiang (), second son, created 837, presumably died no later than 838\n** Princess Xingtang ()\n** Princess Xiping ()\n** Princess Langning (; 827–866), fourth daughter\n** Princess Guanghua ()\nReferences\nCitations\nSources\n* Liu Xu et al., Old Book of Tang, vol. 17, part 1, part 2.\n* Titsingh, Isaac, ed. (1834). [Siyun-sai Rin-siyo/Hayashi Gahō, 1652], Nipon o daï itsi ran; ou, [https://books.google.com/books?id=18oNAAAAIAAJ&dq=nipon+o+dai+itsi+ran  Annales des empereurs du japon.]  Paris: Oriental Translation Fund of Great Britain and Ireland.\n* Ouyang Xiu et al., New Book of Tang, vol. 8.\n* Sima Guang et al., Zizhi Tongjian, vols. 243, 244, 245, 246."
    }
  ]
}