{
  "content": [
    {
      "type": "text",
      "text": "# Emperor Taizu of Jin\n\n|image=Wanggiyan_Aguda.jpg\n|full name=Sinicised name: Wanyan Min (完顔旻)Jurchen name: Aguda (阿骨打)\n|successor = Emperor Taizong of Jin\n|father=Helibo\n|mother=Lady Nalan\n|spouse=Empress ShengmuEmpress GuangyiEmpress QinxianEmpress XuanxianConsort YuanConsort ChongDunuke\n|issue=ShengguoWobenWolibuWuzhuothers\n|birth_date=1 August 1068\n|death_date=\n| burial_place = Rui Mausoleum (睿陵, in present-day Fangshan District, Beijing)\n|succession= Emperor of the Jin dynasty\n|reign=28 January 1115 – 19 September 1123\n|era dates=Shouguo (收國): 1115–1116Tianfu (天輔): 1117–1123\n|house=Wanyan\n|dynasty=Jin\n|temple name=Taizu (太祖)\n|posthumous name=Emperor Yingqian Xingyun Zhaode Dinggong Renming Zhuangxiao Dasheng Wuyuan (應乾興運昭德定功仁明莊孝大聖武元皇帝)\n}}\nEmperor Taizu of Jin (August 1, 1068 – September 19, 1123), personal name Aguda, sinicised name Min (), was the founder and first emperor of the Jurchen-led Jin dynasty of China. He was originally the chieftain of the Wanyan tribe, the most dominant among the Jurchen tribes which were subjects of the Khitan-led Liao dynasty. Starting in 1114, Aguda united the Jurchen tribes under his rule and rebelled against the Liao dynasty. A year later, he declared himself emperor and established the Jin dynasty. By the time of his death, the Jin dynasty had conquered most of the Liao dynasty's territories and emerged as a major power in northern China. In 1145, he was posthumously honoured with the temple name Taizu by his descendant Emperor Xizong.\nThe name [Wanyan] Aguda is transcribed [Wan-yen] A-ku-ta in Wade-Giles; the alternative spelling Akutta (possibly from reconstruction of Jurchen language) appears in a very small number of books as well.\nLife\nAguda was an eighth-generation descendant of Hanpu, the great progenitor of the entire Wanyan clan. His father was Helibo, the chieftain of the Wanyan clan. His mother was a daughter of the chieftain of the Nalan () tribe. He was born in 1068 near the Ashi River within present-day Harbin, Heilongjiang Province. He was well-known within his tribe for his bravery, and had participated in numerous campaigns against rival Jurchen tribes at the command of the Khitan-led Liao dynasty. In 1109, during the height of a widespread famine, Aguda assisted his father in absorbing famished warriors from other Jurchen tribes to strengthen his own tribe. Later, he fought wars against other Jurchen tribes and succeeded in unifying all Jurchens under the Wanyan tribe's leadership.\nIn 1113, Aguda succeeded his elder brother Wuyashu as the leader of his tribe. Like other Jurchens, Aguda loathed what he considered the exploitation of his tribesmen by corrupt Liao officials. In 1112, when the Liao ruler, Emperor Tianzuo, went on a fishing expedition in Jurchen territory, he ordered all the chieftains to dance for him. Aguda became famous among the Jurchens when he was the only person who defied the order.\nIn early 1114, Aguda sent spies into Liao territory and prepared to revolt against the Khitan regime, which he considered decadent. His chief advisors were Wanyan Zonghan and Wanyan Xiyin. In September, Aguda rallied his tribesmen (around 2,500 men) at Liushui (流水; near present-day Lalin River in Fuyu, Jilin Province) and openly rebelled against the Liao dynasty. His cavalry captured Ningjiangzhou (寧江州; present-day Fuyu, Jilin Province) and defeated a 7,000-strong Liao army at the Battle of Chuhedian in November. In January 1115, following a series of military successes, Aguda proclaimed himself emperor, established the Jin dynasty, and adopted the regnal name \"Shouguo\" (). In August, his army conquered Huanglong Prefecture (黄龍府; present-day Nong'an County, Jilin Province) and defeated 700,000 Liao troops with only 20,000 horsemen at the Battle of Hubudagang. By 1116, Aguda had completed the conquest of the entire Liaodong Peninsula. Between 1119 and 1122, his army repeatedly defeated Liao forces and captured all of the Liao dynasty's five capitals.\nSince the Jin dynasty was an enemy of the Liao dynasty, the Han Chinese-led Northern Song dynasty considered the Jin dynasty to be their natural allies. In 1117, the Song dynasty sent emissaries to the Jin dynasty, ostensibly to buy horses, but in reality to negotiate an alliance against the Liao dynasty. Between 1117 and 1123, seven Song delegations visited the Jurchens, and six Jin embassies went to the Song capital, Bianjing (present-day Kaifeng, Henan Province). Between 1115 and 1123, the Jin and Song dynasties negotiated and formed the Alliance Conducted at Sea against the Liao dynasty. Under the conditions of the alliance, the Song dynasty would attack the Liao dynasty from the south, while in return, the Jin dynasty would hand over control of the Liao dynasty's Sixteen Prefectures to the Song dynasty.\nDuring the war against the Liao dynasty, Aguda also took time to establish the new feudal governmental system based on Jurchen tribal customs. He also organised the national agriculture with a collectivist system known as the Miŋgan Moumukə (). Furthermore, Aguda absorbed elements of Han Chinese culture and ordered his chancellor Wanyan Xiyin to develop a unique Jurchen writing system.\nAguda died in August 1123, at the age of 56. His death came a few months after the Jin and Song dynasties signed a treaty which recognised each other as equals and required the Song to pay the Jin an annual tribute of 200,000 taels of silver and 300,000 bolts of silk. Aguda was succeeded by his younger brother, Wuqimai (Emperor Taizong). Wuqimai continued the campaign against the Liao dynasty and captured the Liao emperor, Emperor Tianzuo in 1125, thereby ending the Liao dynasty's existence. Soon after conquering the Liao dynasty, the Jin dynasty waged war against the Northern Song dynasty. Aguda was buried in the Rui Mausoleum () at Dafangshan () outside Zhongdu (中都; present-day Beijing).\nCommemoration\nMounted statues of Aguda and his chief commander, Wanyan Zonghan, have been erected on the grounds of the Jin Dynasty History Museum () at the former location of the old Jin capital, Shangjing (), which is near present-day Acheng District, Harbin, Heilongjiang Province.\nFamily\nParents:\n* Father: Helibo, posthumously honoured as Emperor Shizu\n* Mother: Lady Nalan (), posthumously honoured as Empress Yijian ()\nConsorts and their children:\n*Empress Shengmu, of Tangkuo clan (聖穆皇后 唐括氏)\n**Wanyan Zongjun, Emperor Huizong (徽宗 完顏宗峻), 3rd son\n**Wanyan Zongchao, Prince of Feng (豐王 完顏宗朝), 7th son\n**Wanyan Zongjie, Prince of Zhao (趙王 完顏宗傑, d. 1127)\n*Empress Guangyi, of the Peiman clan (光懿皇后 裴滿氏)\n**Wanyan Zonggan, Prince of Liao  (遼王 完顏宗幹, d. 17 June 1141), 1st son\n*Empress Qinxian, of the Heseri clan (欽憲皇后 紇石烈氏)\n**Wanyan Zongwang, Prince Huansu of Song (宋桓肅王 完顏宗望), 2nd son\n**Wanyan Zongjun, Prince of Chen (陳王 完顏宗雋), 6th son\n**Wanyan Elu, Prince of Shen (瀋王 完顏訛魯)\n*Empress Xuanxian of the Pusan clan (宣獻皇后 僕散氏)\n** Wanyan Zongyao, Emperor Ruizong (睿宗 完顏宗堯, 1096 – 1135), 5th son\n** Wanyan Eluduo, Prince of Bin (豳王 完顏訛魯朵)\n*First Consort, of the Wugulun clan (元妃 烏古論氏)\n** Wanyan Zongbi, Prince of Liang (梁王 完顏宗弼, d. 19 November 1148), 4th son\n** Wanyan Zongqiang, Prince of Wei (衛王 完顏宗強, d. 1142), 8th son\n** Wanyan Zongmin, Prince of Shu (蜀王 完顏宗敏, d. 1150), 9th son\n*Consort Chong, of the Xiao clan (崇妃蕭氏, d. 20 September 1150)\n** Wanyan Xinilie, Prince of Ji (紀王 完顏習泥烈)\n** Wanyan Ningji, Prince of Xi (息王 完顏寧吉)\n** Wanyan Yansun, Prince of Ju (莒王 完顏燕孫)\n*Lady Dunuke (獨奴可) - a slave\n**Wanyan Wohu, Prince of Ye (鄴王 完顏斡忽)\n*Unknown:\n**Wanyan Wulu (完颜兀魯; 21 November 1152), 1st daughter\n***Married Tushan Dingge (徒單定哥)\n***Married Tushan Gong (徒單恭)\n**Princess of Bi (畢國公主), 2nd daughter\n***Married Wugulun Elun (烏古論訛論) and had issue (one son)\n**Princess Wanyan, 3rd daughter\n***married Pucha Shijianu (蒲察石家奴)\nReferences\nCitations\nSources\n* Herbert Franke, 1997 (I): \"Chinese Texts on the Jurchen (I): a Translation of the Jurchen in the ''San ch'ao pei-meng hui-pien. Originally published in Zantralasiatische Studien 9. Wiesbaden, 1975.  Reprinted in: Herbert Franke and Hok-lam Chan, \"Studies on the Jurchens and the Chin Dynasty\", Variorum Collected Series Studies: CS591,  Ashgate, 1997. . (The work whose name is transcribed in Wade-Giles as San ch'ao pei-meng hui-pien'' is Xu Mengxin's (徐夢莘)  \"Collected Accounts of the Treaties with the North under Three Reigns\" (三朝北盟会编, pinyin: San chao beimeng huibian). Franke translates and comments on Chapter 3 of this collection, which deals with the history and customs of the Jurchen people).\n*\n* Jing-shen Tao, The Jurchen in Twelfth-Century China. University of Washington Press, 1976, .\n* Guy Gavriel Kay, River of Stars is set in a fictionalized Liao China during the Jurchen invasion."
    }
  ]
}