{
  "content": [
    {
      "type": "text",
      "text": "# Emperor Suzong of Tang__disambig_1\n\n| image        = TangSuzong.jpg\n| caption      =\n| succession   = Emperor of the Tang dynasty\n| coronation   = 12 August 756\n| reign        = 12 August 756 – 16 May 762\n| predecessor  = Emperor Xuanzong\n| successor    = Emperor Daizong\n| birth_date   = yihai day, 711\n| death_date   =\n| burial_place = Jian Mausoleum (建陵)\n| family_name  = Lǐ (李)\n| posthumous name = Emperor Wenming Wude Dasheng Daxuan Xiao文明武德大聖大宣孝皇帝\n| house        = Li\n| dynasty      = Tang\n| given_name   = Hēng (亨)\n| era name     = Zhìdé (至德) 756–758Qiányuán (乾元) 758–760Shàngyuán (上元) 760–762Bǎoyìng (寶應) 762\n| temple name  = Sùzōng (肅宗)\n| father       = Emperor Xuanzong\n| mother       = Empress Yuanxian\n| spouse       = Lady Wei of Jingzhao(div. 746)Lady Zhang (m. –762)Empress Zhangjing(m. 725; died 730)\n| spouse-type  = Consorts\n| issue-link   = #Consorts and issue\n| issue        = Emperor DaizongLi Tan\n}}\n| l = \"Respectful Ancestor of the Tang\"\n| p = Táng Sùzōng\n| altname = Li Heng\n| c2 =\n| l2 = (personal name)\n| p2 = Lǐ Hēng\n}}\nEmperor Suzong of Tang (yihai day, 711 – 16 May 762; r. 756 – 762), personal name Li Heng, né Li Sisheng (), known as Li Jun () from 725 to 736, known as Li Yu () from 736 to 738, known briefly as Li Shao () in 738, was an emperor of the Chinese Tang dynasty and the son of Emperor Xuanzong.\nSuzong ascended the throne after his father fled to Sichuan during the An Lushan Rebellion in 756; Li Heng himself had fled in the opposite direction, to Lingwu, where he was declared emperor by the army. Much of Emperor Suzong's reign was spent in quelling the aforementioned rebellion, which was ultimately put down in 763 during the reign of his son Emperor Daizong.\nDuring Emperor Suzong's reign, the tradition of eunuchs becoming top-ranked officials began, with Li Fuguo becoming the commander of the imperial guards and possessing nearly absolute power near Emperor Suzong's reign.\nLi Fuguo allied and befriended Emperor Suzong's wife, Empress Zhang, at the beginning of Emperor Suzong's reign, and in an alliance of power, both cleared the court of any opposition against them and controlled everything, but at the end of Emperor Suzong's reign, both became enemies. In 762, with Emperor Suzong gravely ill, Li Fuguo killed Empress Zhang in a power struggle and shortly after that, Emperor Suzong died.\nHe was succeeded by his son Emperor Daizong, who was eventually able to kill Li Fuguo, but the tradition of eunuchs in power had started. Suzong's death on 16 May came only 13 days after the death of his father, the Emperor Xuanzong.\nBackground\nLi Sisheng was born in 711, during the second reign of his grandfather Emperor Ruizong, as the third son of his father, then the Crown Prince, Li Longji, who would later become Emperor Xuanzong.  His mother Consort Yang Guipin (posthumously Empress Yuanxian) was from the imperial clan of the preceding Sui dynasty.\nHer great-grandfather Yang Shida () was a high -level official during Sui and had been given the title Prince of Zheng ().  Her father Yang Zhiqing () was a general of the imperial guards during Tang.  At the time that Consort Yang Guipin was pregnant with Li Sisheng, Li Longji was locked in a power struggle with his aunt, Emperor Ruizong's sister Princess Taiping, and it was said that Princess Taiping had placed many associates in the crown prince's palace to spy on Li Longji and that she did not want him to have many sons.  (He already had two by that point—Li Sisheng's older brothers Li Sizhi, later named Li Cong (by Consort Liu) and Li Siqian, later named Li Ying (by Consort Zhao).)\nLi Longji was worried that, if Princess Taiping found out that Yang Guipin was pregnant, Princess Taiping's associates might harm him, and he spoke to a close associate, Zhang Yue, stating: \"A powerful individual did not want me to have many sons.  I am afraid that this woman would become a target.  What do you think?\"  Li Longji began to prepare an herbal stew that, in traditional Chinese medicine, was believed to be able to induce an abortion, but as he did so, fell asleep and had a dream that a god descended and overturned the ding holding the stew.  When he told Zhang this as well, Zhang responded, \"This is heaven's will.  You should not worry.\"  (As a result, later on in life, Li Sisheng would feel personally indebted to Zhang Yue.)\nIn 712, Emperor Ruizong passed the throne to Li Longji, who took the throne as Emperor Xuanzong, but Emperor Ruizong retained actual power as Taishang Huang (retired emperor).  Shortly after Emperor Xuanzong took the throne, Emperor Ruizong, as retired emperor, was the one who created Li Sisheng the Prince of Shan.\n(After Emperor Xuanzong suppressed Princess Taiping's associates in 713 and forced her to commit suicide, Emperor Ruizong transferred imperial authorities to Emperor Xuanzong and was no longer involved in politics.)  Li Siqian, whose mother Consort Zhao was then Emperor Xuanzong's favorite concubine, was created crown prince.  Li Sisheng, although his mother alive, was raised by Emperor Xuanzong's wife Empress Wang, who was herself sonless.\nIt was said that in his childhood, he was kind and studious, and Emperor Xuanzong was pleased with him.  Emperor Xuanzong thus made the officials He Zhizhang (), Pan Su (), Lü Xiang (), Huangfu Bin (), and Xing Su () accompany him in his studies.\nIn 724, due to the machinations of Consort Wu, who had by then become Emperor Xuanzong's favorite concubine, Empress Wang was deposed, and she died shortly after.  Thereafter, Consort Wu began a campaign, in association with the chancellor Li Linfu, to have her own son Li Qing the Prince of Shou made crown prince, but was not able to initially succeed.  Meanwhile, in 726, Li Sisheng's title was changed to the Prince of Zhong, and his name was changed to Li Jun.  In 728, his own mother Consort Yang Guipin died.\nIn 729, when there was a Khitan and Kumo Xi incursion, Li Jun was put in titular command of the army sent to repel the Khitan and the Xi, with Emperor Xuanzong's second cousin Li Hui () the Prince of Xin'an in actual command of the army.  After Li Hui defeated the Khitan and the Xi, Li Jun was nevertheless rewarded with the honorific title of Situ (), one of the Three Ducal Ministers.  In 735, his name was changed to Li Yu.\nIn 737, due to the machinations of Consort Wu, Li Ying, along with his brothers Li Yao () the Prince of E and Li Ju () the Prince of Guang, was accused of crimes, deposed, and forced to commit suicide.  Consort Wu and Li Linfu continued to lobby for Li Qing (whose name had been changed to Li Mao at this point) to be created crown prince, but with Consort Wu having died herself later in 737 and Emperor Xuanzong believing that Li Yu was capable, he hesitated.\nAt the urging of the eunuch Gao Lishi, who believed that one of his older sons should be made crown prince, Emperor Xuanzong created Li Yu crown prince on 24 Jun 738 and renamed him Li Shao.  (As it was quickly pointed out that he thus shared a name with the Liu Song crown prince Liu Shao, who killed his father and usurped the throne, his name was then quickly changed to Li Heng and would not change again thereafter.)  One of his consorts, Consort Wei, the sister of the official Wei Jian (), was created crown princess.\nAs crown prince\nAs Li Heng's ascension to be crown prince was against Li Linfu's wishes, and also because Wei Jian, who drew favor from Emperor Xuanzong due to his abilities to increase revenues for the imperial treasury, was becoming a rival to Li Linfu at court, Li Linfu looked for ways to incriminate both Wei and Li Heng.  In 746, when the official Yang Shenjin (), at Li Linfu's instigation, reported to Emperor Xuanzong that, one night, Li Heng met Wei while both were sightseeing, and shortly after, Wei met a friend of his, the general Huangfu Weiming () at a Taoist temple, Li Linfu used these incidents to accuse Wei and Huangfu of secretly pledging allegiance to Li Heng and planning to remove Emperor Xuanzong to replace him with Li Heng.\nWei and Huangfu were arrested and interrogated by Yang, Wang Hong (), and Ji Wen (), but Emperor Xuanzong, who did not want the case to further explode into a major incident although he believed Li Linfu's accusations, demoted Wei and Huangfu out of the capital and, for the time being, stopped the investigation.  However, when Wei Jian's brothers Wei Lan () and Wei Zhi () submitted a defense of their brother Wei Jian later in 746—and the defense cited words from Li Heng—Emperor Xuanzong was incensed.\nLi Heng, in fear, divorced Crown Princess Wei and asked for the Wei brothers to be punished.  The Wei brothers, along with a number of their associates—including the former chancellor Li Shizhi, Wei Bin (), Wei Jian's nephew Li Quan () the Prince of Xue, Pei Kuan (), and Li Qiwu (), were all demoted.  (In 747, at Li Linfu's instigation, the Wei brothers, Huangfu, and Li Shizhi were all forced to commit suicide.)\nLater in 746, yet another incident again nearly brought disaster to Li Heng.  One of Li Heng's other consorts, Consort Du, was a daughter of the official Du Youlin ().  Consort Du's brother-in-law Liu Ji () had a dispute with the Du family and falsely accused them of using witchcraft in favor of Li Heng.  Li Linfu had Ji Wen interrogate Liu, and Ji implicated Liu in the alleged plot as well.  Du Youlin, Liu, and Liu's friend Wang Zeng () were all caned to death, and Li Heng felt compelled to expel Consort Du from the household as well.  Li Linfu also used this case to have two other officials friendly with Liu, Li Yong () and Pei Dunfu (), executed by caning.\nIn 747, when one of Emperor Xuanzong's favorite generals, An Lushan, visited the capital Chang'an to pay respect to Emperor Xuanzong, An, who was not Han, initially refused to bow to Li Heng—pretending that he was only loyal to Emperor Xuanzong and to no one else, including the crown prince, and that he did not even know what a crown prince was.\nOnly after Emperor Xuanzong explained what a crown prince is—the reserve emperor, to succeed him later—was An willing to bow to Li Heng.  This caused Emperor Xuanzong to favor An even more, but also later caused An to be apprehensive of whether Li Heng would bear continued resentment toward him over the incident.\nLater in 747, Li Linfu tried to use yet another case to undermine Li Heng.  The general Wang Zhongsi, who was raised with Li Heng inside the palace because his father Wang Haibin () had died in battle in service to the empire, was accused of interfering with the campaign of another general, Dong Yan'guang (), against Tibetan Empire.\nLi Linfu broadened the accusation to an accusation that Wang was planning to start a coup to overthrow Emperor Xuanzong and replace him with Li Heng.  At the intercession of another general, Geshu Han, however, Wang was spared from death, and Li Heng was not implicated.  It was said that during this time period, Li Linfu made other attempts to undermine Li Heng, but with Gao Lishi and Zhang Shuo's son Zhang Ji (), who had married Li Heng's sister Princess Ningqing, protecting Li Heng, Li Heng escaped unharmed each time.\nAs of 754, the chancellor in power was Yang Guozhong (Li Linfu having died in 752), the cousin of Emperor Xuanzong's then-favorite concubine Yang Guifei (unrelated to Li Heng's mother).  Yang Guozhong and An were locked in a power struggle, and Yang repeatedly accused An of plotting a rebellion, but Emperor Xuanzong would not believe it, although Li Heng eventually came to agree with Yang Guozhong.\nIn late 755, with Yang Guozhong repeatedly trying to provoke An into a rebellion, An finally did, from his base at Fanyang (范陽, in modern Beijing).  After the rebellion started, Emperor Xuanzong briefly considered making Li Heng regent, but at the pleas of Consort Yang and her three sisters (who were fearful that Li Heng would act against them if he had regent powers), did not actually do so.\nBy summer 756, An had declared a new state of Yan as its emperor, and his forces were approaching Chang'an.\nOn July 14, 756, Emperor Xuanzong, with Yang Guozhong suggesting that they flee to Jiannan Circuit (劍南, headquartered in modern Chengdu), abandoned Chang'an and fled with Gao Lishi, Yang Guozhong, Wei, Li Heng, Consort Yang, and her family. The following day, July 15, the imperial guards accompanying the emperor, angry at Yang Guozhong, rose at Mawei Station (馬嵬, in modern Baoji, Shaanxi) and killed him and forced Emperor Xuanzong to kill Consort Yang as well.\nEmperor Xuanzong then poised to continue to head toward Jiannan.  The people in the Mawei region tried to persuade Emperor Xuanzong not to continue on—believing that Chang'an could be recaptured.  Emperor Xuanzong asked Li Heng to try to comfort the people.  Once Li Heng left Emperor Xuanzong's presence, however, Li Fuguo and Li Heng's sons Li Tan the Prince of Jianning and Li Chu the Prince of Guangping, persuaded Li Heng not to follow Emperor Xuanzong to Jiannan—arguing that with the physical barriers between Chang'an and Jiannan, that once they had left the region, Chang'an could no longer be captured.\nLi Heng agreed and had Li Chu report this to Emperor Xuanzong.  Emperor Xuanzong agreed with Li Heng's decision, but he himself continued on to Jiannan.  Li Heng, escorted by a small number of guard soldiers commanded by Li Tan, then headed to the border city of Lingwu.  With the army at Lingwu pressuring him to take imperial title, Li Heng declared himself emperor on August 13 (as Emperor Suzong).\nWhen news of this reached Emperor Xuanzong in Jiannan, Emperor Xuanzong recognized Emperor Suzong as emperor and took the title of Taishang Huang (retired emperor), although he continued to exercise some imperial authority—including, for example, issuing an edict that posthumously honored Emperor Suzong's mother Consort Yang as Empress Yuanxian.  (Some historians, including the modern historian Bo Yang, believed that Emperor Xuanzong's continued issuance of edicts, while not on the surface conflicting with Emperor Suzong's authority, caused Emperor Suzong pressure to try to recapture Chang'an as quickly as possible to avoid any contention for the throne—either in the form of Emperor Xuanzong himself resuming imperial authority or in the form of another imperial prince rising to defeat Yan.)\nReign\nEmperor Suzong, once he became emperor, set his eyes on recapturing Chang'an from Yan forces, as Yan forces faced heavy resistance from the people of the Guanzhong region (i.e., the region around Chang'an) and was not able to keep the region under firm control.  (By this point, An Lushan had been assassinated and succeeded by his son An Qingxu, as the emperor of Yan.)\nHowever, an immediate attempt to do so, commanded by the chancellor Fang Guan, was defeated by the Yan forces near Chang'an with heavy losses.  Meanwhile, around the same time, Emperor Suzong's brother Li Lin the Prince of Yong tried to mount a challenge against him, seeking to effectively secede with the region south of the Yangtze River, but was quickly defeated and killed by forces loyal to Emperor Suzong.  Emperor Suzong's court was also itself filled with internal struggles, with Li Fuguo aligned with Emperor Suzong's favorite concubine Consort Zhang, in opposition to Li Chu, Li Tan, and Emperor Suzong's trusted advisor Li Mi.\nIn early 757, after Li Tan repeatedly accused Li Fuguo and Consort Zhang of corruption, Li Fuguo and Empress Zhang in turn falsely accused him of trying to assassinate Li Chu, who was older than he was, in order to become the heir.  Emperor Suzong, in anger, ordered Li Tan to commit suicide, which drew fear from Li Chu and Li Mi.  Li Chu considered assassinating Li Fuguo and Consort Zhang, but at Li Mi's urging, stopped his plans to do so.\nEmperor Suzong, finding it difficult to recapture Chang'an just with his own troops, then entered into an alliance with Huige's Bayanchur Khan Yaoluoge Moyanchuo, where Huige forces arrived at Emperor Suzong's then-headquarters at Fengxiang (鳳翔, in modern Baoji) to join the elite Tang forces recalled from the Anxi Circuit and the Western Regions (Xiyu).  (Emperor Suzong did so by promising that the Huige forces would be permitted to pillage the Chang'an region once it was recaptured.)\nLi Mi suggested that these forces be used to attack Yan's power base at Fanyang first, to root out the possibility of a Yan recovery.  Emperor Suzong chose not to do so and decided to attack Chang'an first, with Li Chu in command of the joint forces.  The forces recaptured Chang'an in fall 757, allowing Emperor Suzong to rebuild his administration in the capital. (Huige forces were set to pillage Chang'an, but Li Chu bowed to the Huige prince commanding Huige forces to plead to delay the pillage—pointing out that if pillaging were carried out, the people of the eastern capital Luoyang, then serving as Yan's capital, would resist heavily, and asking that Huige pillage Luoyang instead.  The Huige prince agreed.)\nAfter Emperor Suzong recaptured Chang'an, Li Mi resigned and became a hermit, leaving Li Fuguo, Consort Zhang (who was then created empress), and Li Chu the lead figures at court, and Li Fuguo, in command of the imperial guards, would soon have such paramount powers that even Emperor Suzong was afraid of offending him.\nEmpress Zhang, meanwhile, wanted to make her son Li Shao () crown prince, but Emperor Suzong, believing Li Chu, who was his oldest son, to be capable and accomplished, created him crown prince instead and changed his name to Li Yu.  Emperor Suzong also welcomed Emperor Xuanzong back from Jiannan and housed him at a palace converted from Emperor Xuanzong's old residence as an imperial prince, Xingqing Palace ().\nA month after Chang'an was recaptured, Tang and Huige forces recaptured Luoyang as well, and Luoyang suffered heavy pillaging by Huige forces.  An Qingxu fled to Yecheng and took up position there, but most Yan territory resubmitted to Tang, and war appeared to be poised to end.  To cement the alliance with Huige, Emperor Suzong also gave his daughter Princess Ningguo in marriage to Yaoluoge Moyanchuo.\nAl-Mansur sent his diplomatic delegations regularly to China. Al-Mansur's delegations were known in China as Heiyi Dashi (Black Clothed Arabs). In 756 al-Mansur sent 3,000 mercenaries to assist Emperor Suzong of Tang in the An Lushan rebellion. A massacre of foreign Arab and Persian Muslim merchants by former Yan rebel general Tian Shengong happened during the An Lushan rebellion in the Yangzhou massacre (760),\nIn 758, however, one of the major Yan generals who had submitted to Tang, Shi Siming, claiming that there had been a plot by Emperor Suzong and the Tang general Li Guangbi, to have his subordinate Wu Cheng'en () assassinate him, re-rebelled and advanced south.  In spring 759, he engaged the Tang forces then sieging An Qingxu at Yecheng, and while the initial battle was indecisive, the Tang forces panicked during the battle and collapsed, allowing the siege of Yecheng to be lifted.\nShi Siming then led An Qingxu into a trap and killed him, taking over as the emperor of Yan and further advancing south to recapture Luoyang, again making it Yan's capital.  However, his further attempts to advance against Chang'an was blocked by Li Guangbi, and the Yan and Tang forces went into a stalemate.\nWhile the stalemate was continuing, in 760, after the eunuch Xing Yan'en () reported to Emperor Suzong that the general Liu Zhan () was disobeying orders, and that Liu's name was in mystical prophecies, Emperor Suzong accepted Xing's suggestion to find a way to eliminate Liu.  After Liu found this out, he was forced into rebellion in late 760; he had successes against other Tang generals and controlled the lower Yangtze region for several months until he was defeated by another Tang general, Tian Shen'gong ().\nMeanwhile, Emperor Xuanzong settled into a routine at Xingqing Palace, with Chen Xuanli () and Gao Lishi attending to him. Also often attending to him were his sister Li Chiying () the Princess Yuzhen, the lady-in-waiting Ru Xianyuan (), and the eunuchs Wang Cheng'en () and Wei Yue ().  The imperial musicians often played for him, and he often climbed up Changqing Tower () to receive well wishes from the populace.  He also often held feasts for generals and people from Jiannan, with Li Chiying and Ru serving as hostesses.\nEmperor Xuanzong's attendants looked down at Li Fuguo. To retaliate, Li Fuguo began to try to convince Emperor Suzong that Emperor Xuanzong and his attendants were plotting to seize power back.  In 760, with Emperor Suzong's tacit, although not explicit, approval, on one occasion when Emperor Xuanzong was out riding, Li Fuguo intercepted him and forced him to move back to the main palace.\nEven on that occasion, however, Gao would not submit to Li Fuguo and even yelled at Li Fuguo to force him to get off his horse and to escort Emperor Xuanzong on foot, along with Gao.  Soon after Emperor Xuanzong was forcibly moved, Li Fuguo forced Chen to retire, Li Chiying to return to her temple (she had become an ordained Daoist nun in 711), and exiled Gao, Wang, Wei, and Ru.  Emperor Suzong then had his daughters Princesses Wan'an and Xianyi attend to Emperor Xuanzong, but Emperor Xuanzong, having lost his trusted attendants, became silent and ill.  For the time being, Emperor Suzong frequently visited Emperor Xuanzong, but he himself grew ill as well and rarely visited.\nHe also regretted permitting Li Fuguo to take these actions and considered killing him, but hesitated and ultimately did not do so because Li Fuguo commanded the imperial guards.  Indeed, thereafter, Li Fuguo became minister of defense, and Emperor Suzong was often forced to comply with his wishes as far as governance was concerned, although Emperor Suzong rebuffed his wishes to become chancellor.\nIn 761, Shi Siming was assassinated and succeeded by his son Shi Chaoyi, and it was said that other Yan generals, who were originally Shi Siming's equals, began to disobey Shi Chaoyi's orders.  Tang forces thus were able to beat back the Yan forces but were not able to dislodge Shi Huaiyi from Luoyang, and final victory over Yan would not come in Emperor Suzong's lifetime.\nIn summer 762, Emperor Xuanzong died.  Emperor Suzong was bedridden by this point, and it was said that he was so saddened by Emperor Xuanzong's death that his illness further advanced.  He thus granted regent powers on Li Yu.  By this point, Empress Zhang and Li Fuguo were no longer allies, and Empress Zhang summoned Li Yu, wanting an alliance with him to kill Li Fuguo and his subordinate Cheng Yuanzhen.  Li Yu refused, pointing out that this would cause alarm to the very-ill Emperor Suzong.\nEmpress Zhang then entered into an alliance with Li Yu's younger brother Li Xi () the Prince of Yue, and they tried to set a trap for Li Fuguo, with 200 strong eunuchs loyal to her and Li Xi ready to act against Li Fuguo.  On May 14, 762, she issued an order in Emperor Suzong's name, summoning Li Yu into the palace.  However, Cheng received this news and reported this to Li Fuguo and Li Yu, and Cheng then escorted Li Yu to the imperial guard headquarters.\nImperial guards commanded by Li Fuguo and Cheng then entered the palace and arrested Empress Zhang, Li Xi, and their associates.  It was said that with Emperor Suzong resting at Changsheng Hall (), the soldiers dragged Empress Zhang and the attending ladies in waiting and eunuchs away from his presence.  Emperor Suzong was said to be left alone without attendants.  He died on May 16, only 13 days after Emperor Xuanzong's death. Li Fuguo executed Empress Zhang, Li Xi, and Li Xian () the Prince of Yan and then declared Li Yu emperor (as Emperor Daizong).\nChanges to the calendar during the Shangyuan and Baoying eras\nOn 23 Oct 761, Emperor Suzong declared that the ''jian'zi month (the 11th month) would be the start of the new year. On 13 May 762, he reverted the change, so that the jian'yin month was again the start of the new year.\nChancellors during reign\n* Wei Jiansu (756–757)\n* Cui Yuan (756–758)\n* Fang Guan (756–757)\n* Pei Mian (756–757)\n* Cui Huan (756–757)\n* Li Lin (757–758)\n* Miao Jinqing (757–759, 760–762)\n* Zhang Gao (757–758)\n* Wang Yu (758–759)\n* Lü Yin (759, 759–760)\n* Li Xian (759)\n* Li Kui (759–761)\n* Diwu Qi (759)\n* Xiao Hua (761–762)\n* Pei Zunqing (761–762)\n* Yuan Zai (762)\nConsorts and issue\n* Crown Princess, of the Wei clan of Jingzhao (; d. 757)\n** Li Xian, Prince Yan (; d. 762), sixth son\n** Princess Yonghe (; d. 768), eighth daughter\n*** Married Wang Quan of Langya, Duke Xintai (), and had issue (three sons, one daughter)\n** Princess Yongmu (), personal name Shu ()\n*** Married Wei Hui of Jingzhao (), and had issue (one daughter)\n* Empress, of the Zhang clan (; d. 762)\n** Li Zhao, Crown Prince Gongyi (; 753–760), 12th son\n** A daughter (b. 755)\n** Li Dong, Prince Ding (; d. 762), 13th son\n* Empress Zhangjing, of the Wu clan (; 713–730)\n** Li Yu, Daizong (; 726–779), first son\n** Princess Hezheng (; 728–764), second daughter\n*** Married Liu Tan of Hedong (; d. 768) in 750, and had issue (five sons, three daughters)\n*Consort Cui, of the Cui clan (崔妃 崔氏)\n* First Imperial Concubine, of the Pei clan ()\n** Li Guang, Prince Xiang (; d. 791), ninth son\n* Fairness Lady, of the Chen clan ()\n** Li Jin, Prince Peng (; d. 783), fifth son\n* Fairness Lady, of the Duan clan ()\n** Li Chui, Prince Qi (; d. 798), tenth son\n* Beauty, of the Zhang clan ()\n** Li Ting, Prince Jing (; d. 784), seventh son\n* Lady, of the Sun clan ()\n** Li Xi, Prince Yue (; d. 762), second son\n* Lady, of the Zhang clan ()\n** Li Tan, Emperor Chengtian (; d. 757), third son\n* Lady, of the Wang clan ()\n** Li Bi, Prince Wei (), fourth son\n*Lady, of the unknown clan (后宫某氏)\n** Li Rong, Prince Yun (), eighth son\n*Lady, of the unknown clan (后宫某氏)\n** Li Xi, Prince Song (), 14th son\n* Unknown\n** Princess Su ()\n*** Married Doulu Zhan of Changli ()\n** Princess Xiao (), second daughter\n*** Married Zheng Xun of Xingyang ()\n*** Married Xue Kangheng of Hedong ()\n*** Married Bayanchur Khan (d. 759) in 758\n** Princess Tan (; 729–786), fifth daughter\n*** Married Zhang Qing, Duke Fanyang (), and had issue (one son)\n** Princess Ji (; 733–807), personal name Shu (), sixth daughter\n*** Married Zheng Pei of Xingyang (; 738–796) in 759, and had issue (one son, one daughter)\n** Princess Gao (; d. 790)\n*** Married Pei Hui of Hedong (; d. 756), and had issue (one son)\n*** Married Xiao Sheng of Lanling (), and had issue (five sons, one daughter)\nSee also\n#Chinese emperors family tree (middle)\nReferences\n* Old Book of Tang, vol. 10.\n* New Book of Tang, vol. 6.\n* Zizhi Tongjian'', vols. 210, 211, 212, 213, 214, 215, 216, 217, 218, 219, 220, 221, 222.\n*"
    }
  ]
}