{
  "content": [
    {
      "type": "text",
      "text": "# Emperor Wu of Northern Zhou__disambig_1\n\n| death_place  =\n| burial_place = Xiao Mausoleum (孝陵)\n| family_name     = Yuwen (宇文)\n| given_name      = Yong (雍)\n| posthumous name = Emperor Wu (武皇帝)\n| temple name  = Gaozu (高祖)\n| era name        =\n| era dates       =\n* Bǎodìng (保定): 561-565\n* Tiānhé (天和): 566-572\n* Jiàndé (建德): 572-578\n* Xuānzhèng (宣政): 578\n| father       = Yuwen Tai\n| mother       = Empress Xuan\n| spouse       = Empress Wucheng AshinaEmpress Dowager Li Ezi\n| spouse-type  = Consorts\n| issue        = Emperor XuanYuwen ZanYuwen ZhiYuwen YunYuwen ChongYuwen DuiYuwen YuanPrincess QingdouPrincess Yiyang\n}}\nEmperor Wu of Northern Zhou ((北)周武帝) (543 – 21 June 578), personal name Yuwen Yong (宇文邕), Xianbei nickname Miluotu (禰羅突), was an emperor of the Xianbei-led Northern Zhou dynasty of China. As was the case of the reigns of his brothers Emperor Xiaomin and Emperor Ming, the early part of his reign was dominated by his cousin Yuwen Hu, but in April 572 he ambushed Yuwen Hu and seized power personally. He thereafter ruled ably and built up the power of his military, destroying the rivaling Northern Qi dynasty in 577 and annexing its territory. His death the next year, however, ended his ambitions of uniting China, and under the reign of his erratic son Emperor Xuan (Yuwen Yun), Northern Zhou itself soon deteriorated and was usurped by Yang Jian, who founded the Sui dynasty, in 581.\nBackground\nYuwen Yong was born in 543, as the fourth son of the Western Wei paramount general Yuwen Tai. His mother was Yuwen Tai's concubine Lady Chinu. He was born at Yuwen Tai's then-headquarters at Tong Province (同州, roughly modern Weinan, Shaanxi). He was considered filially pious, respectful, and intelligent in his youth. During six years his father entrusted him and his brother to general Li Xian for his protection and education, as the court had become too dangerous. In 554, Emperor Fei of Western Wei created him the Duke of Fucheng.\nYuwen Tai died in 556, and in spring 557, Yuwen Yong's cousin Yuwen Hu, entrusted with the governing authority by Yuwen Tai, forced Emperor Gong of Western Wei to yield the throne to Yuwen Yong's older brother Yuwen Jue, ending Western Wei and establishing Northern Zhou. Yuwen Jue took the throne as Emperor Xiaomin, but used the alternative title of \"Heavenly Prince\" (Tian Wang). Yuwen Hu served as regent, and later that year, when Emperor Xiaomin tried to seize power from him, Yuwen Hu deposed Emperor Xiaomin and then killed him, replacing him with another older brother of Yuwen Yong's, Yuwen Yu, who took the throne as Emperor Ming. Emperor Ming created Yuwen Yong the greater title of Duke of Lu and often consulted Yuwen Yong on important matters. Although Yuwen Yong did not speak much, Emperor Ming made the observation, \"He did not often speak, but whatever he spoke was always right.\"\nIn 559, Yuwen Hu formally returned his authorities to Emperor Ming, and Emperor Ming began to formally rule on governmental matters, but Yuwen Hu retained the command of the military. In 560, Yuwen Hu, apprehensive of Emperor Ming's abilities, had the imperial chef Li An () poison him with sugar cookies. Emperor Ming, realizing that he was near death, designated Yuwen Yong as his successor, and after he soon died, Yuwen Yong took the throne as Emperor Wu. However, the control of the government again fell into Yuwen Hu's hands.\nDNA analysis\nA 2024 genetic study analyzed the genetic makeup of Emperor Wu, determining him to be of primarily Ancient Northeast Asian ancestry (c. 62%), with lower amounts of 'Yellow River farmers' ancestry associated with Han Chinese (c. 32%). The remaining 6% was derived from Western Steppe Herders. It was furthermore revealed that he might have died of a stroke, as he carried several risk-alleles. The study's authors also could reconstruct how he looked like, determining him to have had \"a typical East or Northeast Asian facial appearance\". A previous study on his wife, Empress Ashina of the early Turkic ruling class, the Ashina tribe, determined her to be of nearly entirely Ancient Northeast Asian ancestry. (This made them far northerners, as at such a recent time \"Yellow River\" was already predominant even on some territory of today's independent Mongolia)\nHis face was reconstructed in 2024 using the DNA analysis, [https://www.cnn.com/2024/03/28/asia/ancient-dna-chinese-emperor-wu-scn/index.html CNN] posted his [https://media.cnn.com/api/v1/images/stellar/prod/the-facial-reconstruction-of-emperor-wu-who-was-ethnically-xianbei-credit-pianpian-wei.jpg?c=16x9&q=h_653,w_1160,c_fill/f_webp reconstructed face].\nEarly reign\nEmperor Wu was said to be largely a silent emperor early in his reign, giving Yuwen Hu free rein over the government, although he appeared to start cultivating a group of officials who would be loyal to him as the years went by. He formally bestowed Yuwen Hu with not only the military authorities, but also authority over all six ministries.\nWith the Liang dynasty general Wang Lin and the throne claimant that he supported, Xiao Zhuang, having been defeated by the Chen dynasty in spring 560 and having fled to Northern Qi, Northern Zhou (and its vassal Western Liang, with Emperor Xuan of Western Liang as its emperor) contended for control of Xiao Zhuang's former territory with Chen, precipitating a confrontation. Starting in winter 560, the Northern Zhou generals Heruo Dun () and Dugu Sheng () began a drawn-out stalemate with the Chen general Hou Tian, initially being successful in thwarting Hou's attacks. Around the new year 561, however, Dugu was forced to withdraw, and Heruo was isolated. In spring 561, Hou agreed to let Heruo withdraw if Heruo would yield, and so Heruo withdrew; the modern Hunan region thus became Chen territory. (Yuwen Hu, believing Heruo to be at fault for losing the region, removed him from his posts.)\nAlso in 561, Emperor Wu honored his mother Lady Chinu empress dowager.\nIn spring 562, to foster a peaceful relationship with Chen, Northern Zhou returned the brother of Emperor Wen of Chen, Chen Xu, as well as Chen Xu's wife Liu Jingyan and son Chen Shubao, to Chen. In exchange, Chen gave the city of Lushan (魯山, in modern Wuhan, Hubei) to Northern Zhou.\nIn summer 562, Emperor Wu, seeing that previously, nobles were not receiving any material benefits from their titles, began to have the nobles receive stipends based on the size of their fiefs.\nIn spring 563, while on a visit to Yuan Province (原州, roughly modern Guyuan, Ningxia), Emperor Wu suddenly returned to the capital Chang'an without explanation. One of his attendants, Houmochen Chong the Duke of Liang, speculated to his associates that Yuwen Hu had died. When Houmochen's speculations became known, Emperor Wu publicly rebuked Houmochen, and the same night, Yuwen Hu sent troops to surround Houmochen's mansion, forcing him to commit suicide. Soon thereafter, he publicly bestowed Yuwen Hu the honor of having his name be subject to naming taboo, an honor that Yuwen Hu declined.\nAlso in spring 563, Emperor Wu promulgated a new 25-volume criminal code drafted by the official Tuoba Di (), which divided the criminal punishment into 25 classes.\nIn fall 563, Northern Zhou entered into an alliance treaty with the Gokturks, known to the Chinese as Tujue, against Northern Qi, part of which involved a promise that Emperor Wu would marry the daughter of Ashina Qijin, Tujue's Mugan Khan. In winter 563, the joint forces of Northern Zhou and Tujue launched a two-prong attack on Northern Qi, with the northern prong attacking Northern Qi's secondary capital Jinyang (晉陽, in modern Taiyuan, Shanxi) and the southern prong attacking Pingyang (平陽, in modern Linfen, Shanxi). The northern prong, commanded by the general Yang Zhong, put Jinyang under siege, but was soon defeated by the Northern Qi general Duan Shao and forced to withdraw. In response, the southern prong, commanded by Daxi Wu (), also withdrew. Still, the attack demonstrated the growing Northern Zhou strength—as previously, in the winter months, Northern Zhou forces would break the ice on the Yellow River to prevent possible Northern Qi attacks, but around this time and thereafter, Northern Qi forces broke the ice on the river to prevent possible Northern Zhou attacks.\nIn fall 564, in order to placate Yuwen Hu, Emperor Wucheng of Northern Qi returned Yuwen Hu's mother Lady Yan and his (and Emperor Wu's) aunt (Yuwen Tai's sister), who had been trapped in Northern Qi territory several decades earlier, to Northern Zhou. In order to celebrate Lady Yan's return, Emperor Wu issued a general pardon, and prostrated himself before her as an ordinary nephew would. In turn, Yuwen Hu considered calling off planned joint attacks with Tujue against Northern Qi, but was fearful that Tujue would believe that Northern Zhou was abandoning the alliance, and therefore launched another joint attack with Tujue in winter 564. The assault, the main brunt of which was against Luoyang, however, was unsuccessful, and soon was abandoned.\nIn spring 565, Emperor Wu sent his brother Yuwen Chun () the Duke of Chen, Yuwen Gui () the Duke of Xu, Dou Yi () the Duke of Shenwu, and Yang Jian (楊薦, different person than the more-known Yang Jian, referenced above and below) the Duke of Nanyang, to lead a ceremonial guard corps to Tujue to welcome back Ashina Qijin's daughter for marriage to him. However, when they arrived at Ashina Qijin's headquarters, he turned against the treaty and detained Yuwen Chun and his attendants.\nMiddle reign\nIn 566, the non-Chinese tribes of Xin Province (信州, modern eastern Chongqing) rebelled and captured Baidicheng, under the leadership of the chieftains Ran Lingxian () and Xiang Wuziwang (). The general Lu Teng (), however, was able to persuade some of Rang's subjects to turn against him, and he subsequently defeated Rang and Xiang, killing them and suppressing the revolts.\nIn 567, in light of the death of Chen's Emperor Wen and succession by his son Emperor Fei of Chen in 566, the high level Chen officials engaged in infighting, and Emperor Wen's brother Chen Xu was victorious. The general Hua Jiao (), the governor of Xiang Province (roughly modern Changsha, Hunan), felt uneasy, and therefore sought aid from Northern Zhou and Western Liang. Yuwen Hu, over the opposition by the official Cui You (), sent an army commanded by Emperor Wu's brother Yuwen Zhi () the Duke of Wei to assist Hua and Western Liang, which was also aiding Hua. The Chen general Wu Mingche, however, quickly defeated the joint forces of Northern Zhou, Western Liang, and Hua, forcing Hua and Yuwen Zhi to both give up the war and flee to the Western Liang capital Jiangling. Chen was able to retain all of Hua's territory and further make minor territorial gains against both Northern Zhou and Western Liang as well. Yuwen Hu relieved Yuwen Zhi from his posts, and while Yuwen Zhi was eventually restored to them, Yuwen Zhi, who had previously had a cordial relationship with Yuwen Hu, bore a grudge against Yuwen Hu and secretly encouraged Emperor Wu to act against Yuwen Hu.\nIn spring 568, a major storm at Tujue's headquarters inflicted substantial damage, and Ashina Qijin took it as a sign of divine displeasure at his rescission of the marriage agreement with Northern Zhou. He therefore returned Yuwen Chun, along with the daughter he promised Emperor Wu, back to Northern Zhou.  Emperor Wu personally welcomed her and created her empress.\nPerhaps in light of the new adversarial relationship with Chen, when Northern Qi made peace overtures in fall 568, Northern Zhou accepted, and there was peace between the states for about a year, until fall 569, when Emperor Wu's brother Yuwen Xian the Prince of Qi led an army to siege Northern Qi's city of Yiyang (宜陽, in modern Luoyang, Henan) -- and for more than a year, the two states would engage in struggle for the control of Yiyang. Meanwhile, in fall 570, the Chen general Zhang Zhaoda put siege to Jiangling, nearly capturing it, but was eventually fought off by Northern Zhou and Western Liang's joint forces.\nIn 569–570, Emperor Wu organized a debate between Buddhists and Daoists and commissioned two reports - the Xiaodao Lun and the Erjiao Lun - on the suitability of either religion for their adoption by the Chinese government. He came out with a more favorable impression of Daoism, and would found the Tongdao Guan () for Daoist research, which would eventually compile the first Daoist encyclopedia, the Wushang Biyao ().\nIn winter 570—as forewarned by the Northern Zhou general Wei Xiaokuan, who advised against the Yiyang campaign—the famed Northern Qi general Hulü Guang left Yiyang and instead advanced onto Northern Zhou territory north of the Fen River (汾水, flowing through modern Linfen), building forts and capturing substantial territory from Northern Zhou. While a counterattack by Yuwen Xian subsequently fought Hulü to a stalemate, damage had been done, and Northern Zhou was further forced to give up on the Yiyang campaign in fall 571 to concentrate against Hulü.\nAlso in 571, Hua went to Chang'an, and on the way, he met Yuwen Zhi at Xiang Province (襄州, roughly modern Xiangfan, Hubei), suggesting to Yuwen Zhi that Western Liang was in such a desperate shape that if Northern Zhou wanted to see it preserved, Northern Zhou should lend some land to Western Liang. Yuwen Zhi agreed and made the proposal to Emperor Wu; in response, Emperor Wu gave three provinces—Ji (), Ping (), and Ruo () (together making up about modern Jingmen and Yichang, Hubei) to Western Liang.\nBy 572, Yuwen Hu had controlled the military for 16 years and the government for nearly as long. Emperor Wu had long wanted him out of the way, although he showed few outward signs of it. He conspired with Yuwen Zhi, distant relatives Yuwen Shenju () and Yuwen Xiaobo (), and Wang Gui () against Yuwen Hu. In spring 572, he made his move. After Emperor Wu and Yuwen Hu had a meeting, he invited Yuwen Hu into the palace to meet with Empress Dowager Chinu. On the way to her palace, he told Yuwen Hu that Empress Dowager Chinu was having problem with alcoholism and not listening to his advice to stop her drinking, so he wanted Yuwen Hu to advise her to change her ways as well. He further gave Yuwen Hu the text of the Jiu Gao () -- an anti-alcoholism declaration written by King Cheng of Zhou—and suggested that he read the Jiu Gao to Empress Dowager Chinu. Once they reached her palace, Yuwen Hu, pursuant to Emperor Wu's request, started reading the Jiu Gao. Before he could finish it, Emperor Wu stepped behind him and used a jade tablet to strike the back of his head. Yuwen Hu fell to the ground, and Yuwen Zhi, who was hiding nearby, jumped out, and cut off Yuwen Hu's head, ending Yuwen Hu's hold on power. Yuwen Hu's sons, brothers, and key associates were all executed.\nLate reign\nHaving been instrumental in Yuwen Hu's death, Yuwen Zhi sought to take over Yuwen Hu's post, but Emperor Wu, who wanted to directly control the government, divided the authority between several officials, retaining most authorities in himself. He took the opportunity posthumously to honor his brother Emperor Xiaomin (Yuwen Hu had refused to do so previously) and create his son Yuwen Yun the Duke of Lu crown prince. He also began to oppose overt luxury and destroyed several palaces that he found overly luxurious as well as other items that he considered ornately decorated.\nAlso in summer 572, Emperor Wu learned that Northern Qi's emperor Gao Wei, apprehensive of Hulü Guang, had executed Hulü. Being glad, Emperor Wu declared a general pardon.\nBy 573, it had come to Emperor Wu's attention that Crown Prince Yun was not paying attention to matters of state but instead associated with immoral people. In response, Emperor Wu selected staff members for Crown Prince Yun who were known for their strict conduct. This made the crown prince unhappy.\nAround the new year 574, Emperor Wu gathered Confucian scholars, Taoist monks, and Buddhist monks, and had them debate about their philosophies. He ranked Confucianism the highest, then Taoism, and then Buddhism. Subsequently, in summer 574, he banned both Taoism and Buddhism, ordering their monks to return to secular life. He also banned the worship of minor deities whose cults were not registered with the government. (This became known as the second of the Three Disasters of Wu)\nIn spring 574, Empress Dowager Chinu died. Emperor Wu mourned for more than a month, eating only a small amount of rice during this period.\nIn fall 574, while Emperor Wu was at Yunyang (雲陽, in modern Xianyang, Shaanxi), Yuwen Zhi, who had long resented not receiving more authority, rebelled at Chang'an. The official Yuchi Yun (), one of the officials in charge of the capital along with Crown Prince Yun, defeated Yuwen Zhi, forcing him to flee. Yuwen Zhi was soon captured and executed.\nBelieving Northern Qi to have been substantially weakened not only by Hulü's death but also by the successful campaign that Chen waged against it in 573 (capturing the provinces between the Yangtze River and the Huai River), by 575, Emperor Wu was seriously considering a major campaign against Northern Qi. However, he kept the matter secret, consulting only Yuwen Xian, Wang Yi (), and Yu Yi (). Only until he was ready in fall 575 did he announce it generally. He aimed his attack at Luoyang, but he spent about 20 days sieging it and could not capture it, and became ill.  He withdrew, with virtually no gain.\nIn spring 576, pursuant to Emperor Wu's orders, Crown Prince Yun launched a campaign against Tuyuhun; a campaign that appeared to be moderately successful. Yet the campaign would bring another deterioration of the relationship between father and son, as Wang Gui, who officially served as the crown prince's lieutenant (along with Yuwen Xiaobo) but was in charge of the operation, reported a matter of immoral acts that the crown prince and his associates Zheng Yi () and Wang Duan () engaged in. Emperor Wu himself caned the crown prince and his associates, expelling the associates from the crown prince's palace. (Crown Prince Yun, however, soon recalled his associates.) Emperor Wu was also exceedingly strict with Crown Prince Yun, disallowing him from resting or drinking. Whenever he had faults, Emperor Wu would batter him or whip him, and further warn him that he would be deposed. Emperor Wu further ordered the crown prince's staff to report all of his actions to the emperor. Fearful of his father, Crown Prince Yun learned to feign upright behavior, and the emperor thought that the crown prince had changed.\nIn winter 576, Emperor Wu again attacked Northern Qi; this time, changing strategy and attacking Pingyang instead. He was able to capture Pingyang quickly, before Northern Qi troops could arrive. The Northern Qi emperor Gao Wei soon advanced toward Pingyang with a large army, and Emperor Wu, not wanting to engage Gao Wei's army directly, withdrew, leaving the general Liang Shiyan () in charge of defending Pingyang. Gao Wei put Pingyang under siege, and at one point nearly captured it. Emperor Wu, after reorganizing his forces, relaunched his army and headed for Pingyang, seeking to lift the siege. Around the new year 577, he arrived near Pingyang and Gao Wei chose to engage him—but, once the battle began, panicked when his favorite concubine Consort Feng Xiaolian falsely believed that the army had been defeated—and he abandoned the army, causing its collapse. Gao Wei fled to Jinyang, and Emperor Wu gave chase. No longer having the will to fight Emperor Wu, Gao Wei further fled back to the Northern Qi capital Yecheng, leaving his cousin Gao Yanzong in charge of Jinyang. Gao Yanzong launched a counterattack, catching Emperor Wu by surprise and nearly killing him. However, after the victory, Gao Yanzong's army went into a celebration, and he was unable to reorganize it, and Emperor Wu soon defeated and captured him, and headed for Yecheng.\nGao Wei, after passing the throne to his young son Gao Heng to deflect ill omens, considered resisting, but instead decided to flee southeast across the Yellow River, planning to regroup and see if he could make a last stand—but if not, to flee to Chen. In spring 577, Emperor Wu entered Yecheng. With Gao Wei's official Gao Anagong feeding him intelligence on Gao Wei's location, he was able to capture Gao Wei.  After Gao Wei was returned to Yecheng, he treated Gao Wei with respect and created Gao Wei the Duke of Wen. Gao Wei's uncle Gao Jie () and cousin Gao Xiaoheng (), making one last stand at Xindu (信都, in modern Hengshui, Hebei), were also soon defeated and captured. Another of Gao Wei's cousins, Gao Shaoyi, after making a failed bid to resist, fled to Tujue and came under the protection of Ashin Qijin's successor Tuobo Khan. Other than Ying Province (營州, roughly modern Zhaoyang, Liaoning), held by the official Gao Baoning (), a distant relative to Northern Qi's imperial Gao clan, all of Northern Qi's territory came under Northern Zhou rule.\n]]\nIn summer 577, Emperor Wu returned to Chang'an with Gao Wei and other members of the Gao clan in tow. In winter 577, apprehensive of the Gao clan members, he falsely accused Gao Wei of conspiring with the former Northern Qi official Mu Tipo and killed Mu and ordered Gao Wei and the other members of the Gao clan to commit suicide.\nIn light of Northern Qi's defeat, Chen, then ruled by Chen Xu (who had deposed Emperor Fei and took the throne himself as Emperor Xuan), launched an attack commanded by Wu Mingche on Pengcheng (modern Xuzhou, Jiangsu), an important city on the former Chen/Northern Qi border. Emperor Wu sent Wang Gui to relieve Pengcheng, and in spring 578, Wang defeated Wu, capturing him.\nBy summer 578, Emperor Wu was engaging in military campaigns on two fronts: against Tujue in the north and against Chen in the south. However, he suddenly grew ill and, after stopping at Yunyang, ended the attack against Tujue. He entrusted the important matters to Yuwen Xiaobo, and he soon died at the age of 35. Crown Prince Yun succeeded him (as Emperor Xuan), and by 581 Northern Zhou had fallen, its throne having been seized by Emperor Xuan's father-in-law Yang Jian.\nMausoleum\nEmperor Wu was buried at the Northern Zhou Qiaoling Mausoleum, together with his Turkic wife, Empress Ashina.\nA recent study on the remains of Emperor Wu (his skull was nearly completely preserved), has shown that \"Emperor Wu had typical East or Northeast Asian facial characteristics\", which bring some light on the appearance of the people of Xianbei ancestry, to whom Emperor Wu belonged, in the 6th century CE.\nRelation with xiangxi\nYuwen Yong was a great fan of xiangxi, he wrote a book about it, Xiang Jing, in 569 AD.\nFamily\nConsorts and Issue:\n* Empress Wucheng, of the Ashina clan (; 551–582)\n* Empress Dowager, of the Li clan (; 535–588), personal name Ezi ()\n** Yuwen Yun, Emperor Xuan (; 559–580), first son\n** Yuwen Zan, Prince Han (; d. 581), second son\n* Shifu, of the Xue clan ()\n** Yuwen Dui, Prince Cai (; d. 581), sixth son\n* Lady, of the Kuhan clan ()\n** Yuwen Zhi, Prince Qin (; d. 581), third son\n** Yuwen Yun, Prince Cao (; d. 581), fourth son\n* Lady, of the Feng clan ()\n** Yuwen Chong, Prince Dao (; d. 581), fifth son\n* Lady, of the Zheng clan ()\n** Yuwen Yuan, Prince Jing (; d. 581), seventh son\n* Unknown\n** Princess Qingdu ()\n*** Married Yan Pi, Duke Shibao (), and had issue (two sons including Yan Liben)\n** Princess Yiyang ()\n*** Married Yu Xiangxian, Duke Qinchang ()\n** A daughter (b. 570)\nPopular culture\n*Portrayed by Daniel Chan in Prince of Lan Ling TV series.\n*Portrayed by Hanson Ying in The Legend of Dugu TV series.\nReferences\n|- style=\"text-align: center;\"\n|-\n|-\n|-"
    }
  ]
}