{
  "content": [
    {
      "type": "text",
      "text": "# Emperor Xiaowu of Jin__disambig_1\n\n}}\n|succession      = 9th Emperor of the Eastern Jin dynasty\n|reign           = 12 September 372 – 6 November 396\n|predecessor     = Emperor Jianwen\n|regent          = Empress Dowager Chu Suanzi (373 – 376)\n|successor       = Emperor An\n|birth_date      = 362\n|birth_place     =\n|death_date      =\n|death_place     = Jiankang, Eastern Jin\n|place of burial = Longping Mausoleum (), Nanjing, Jiangsu\n|era dates       = Ningkang (): 373–375Taiyuan (): 376–396\n|family_name     = Sīmǎ ()\n|given_name      = Yao ()\n|posthumous name = Emperor Xiàowǔ\n|temple name     = Lièzōng ()\n|house           = House of Sima\n|dynasty         = Eastern Jin\n|father          = Emperor Jianwen\n|mother          = Empress Dowager Xiaowuwen\n|spouse          = Empress XiaowudingEmpress Dowager Ande\n|spouse-type     = Consorts\n|issue           = Emperor AnEmperor GongPrincess Jinling\n}}\nEmperor Xiaowu of Jin (; 362 – 6 November 396), personal name Sima Yao (), courtesy name Changming (), was an emperor of the Eastern Jin Dynasty in China.  During his reign, Jin saw his dynasty survive a major attempt by Former Qin to destroy it, but he would nevertheless be the last Jin emperor to actually exercise imperial power, as his sons Emperor An and Emperor Gong would be controlled by regents and warlords (e.g. Huan Xuan and Liu Yu).  Emperor Xiaowu died an unusual death—he was killed by his concubine Honoured Lady Zhang after he insulted her.\nEarly life\nSima Yao was born in 362, when his father Sima Yu was Prince of Kuaiji and prime minister for his grandnephew, Emperor Ai.  Sima Yao's mother, Li Lingrong, was originally a servant involved in textile production but, based on a magician's words that she would bear his heir (his sons all having died early by that point), Sima Yu took her as his concubine and she gave birth to Sima Yao. As he was born at dawn, she named him Yao, with the courtesy name Changming, both meaning \"dawn\". A year later she gave birth to his brother, Sima Daozi. As the oldest surviving son of Sima Yu, Sima Yao was designated as the heir apparent early in his life, and in 365, when he was just three years old, Emperor Fei offered the greater title of Prince of Langya to his father and the title of Prince of Kuaiji to him. Sima Yu declined, both personally and on his son's behalf, and Emperor Fei did not insist on them taking on the greater titles.\nIn 371, having lost a devastating battle to the Former Yan general Murong Chui in 369, the paramount general Huan Wen accused Emperor Fei of impotence and of not being the biological father of his sons. He then deposed him and made Sima Yu the new emperor (as Emperor Jianwen), although actual power was in Huan's hands. In 372, Emperor Jianwen grew ill and he named Sima Yao crown prince on 12 September but in his will, he offered the throne to Huan, if he wanted it. When his official Wang Tanzhi () objected, Emperor Jianwen gave approval for an amendment, written by Wang, wherein Huan was only compared to the statesmen Zhuge Liang and Wang Dao. Nevertheless, when Emperor Jianwen died, many officials were apprehensive of Huan, and not immediately willing to declare Crown Prince Yao as the new emperor. Finally, at the instigation of Wang Biaozhi (), Crown Prince Yao took the throne as Emperor Xiaowu.\nEarly reign\nThe new emperor was only 10 years old. Therefore, his cousin Empress Dowager Chu (Emperor Kang's wife and niece of Xie Shang) served as regent, but the decisions were actually being made by Xie An and Wang Tanzhi; Huan Wen, apparently fearful of being entrapped, declined an offer to be regent. In 373, Huan Wen died and the fears of a Huan usurpation dissipated as his brother and successor, Huan Chong, was committed to the survival of the imperial government.\nA major issue for the Jin government was the continued military pressure exerted by the powerful northern rival, Former Qin. In 373, Former Qin attacked and seized Jin's Liang (梁州, modern southern Shaanxi) and Yi (益州, modern Sichuan and Chongqing) provinces. Internally, however, Jin was apparently well-governed by Xie and Huan Chong.\nOn 1 October 375, Emperor Xiaowu married Wang Fahui (the daughter of the official, Wang Yun ()) as his empress. He was 13 and she was 15. He also started studying the Chinese classic texts and writing poetry. In 376, Empress Dowager Chu officially removed herself from the regent position and returned her powers to Emperor Xiaowu, although the decisions were still largely being made by Xie.\nIn 376, the Jin vassal, Former Liang, was attacked by Former Qin. Jin forces, under Huan Chong's command, attempted to relieve the pressure on Former Liang by attacking Former Qin, but Former Liang fell quickly and Huan Chong withdrew his forces. In apprehension of a Former Qin attack, Jin evacuated much of its population north of the Huai River to regions south of the river.\nIn 378, Former Qin made major attacks against the important Jin cities of Xiangyang, Weixing (魏興; southeast of present-day Suqian, Jiangsu), and Pengcheng. While general Xie Xuan was able to immediately recapture Pengcheng after it fell, Xiangyang and Weixing were taken by Former Qin forces in 379.\nOn 24 October 380, Empress Wang died. Emperor Xiaowu did not have another empress for the rest of his life.\nIn 381, Emperor Xiaowu began to study Buddhist sutras and he established a Buddhist study hall inside his palace, inviting monks to live within.\nIn 383, Huan Chong made a counterattack against Former Qin, hoping to recapture Xiangyang and the southwest. However, after initial losses, Huan abandoned the campaign.\nThe Battle of Fei River\nIn November 383, Former Qin's emperor, Fu Jiān, launched a major attack against Jin, intending to destroy it and unite China. At the Battle of Fei River, however, his forces panicked after trying to retreat to draw Jin forces across the river, and his army was routed with great losses, including his brother and prime minister, Fu Rong. Former Qin began to collapse after this defeat and never again posed a threat to Jin.\nMiddle reign\nAfter defeating Former Qin forces, Xie Xuan spearheaded a campaign to regain lost territory, and Jin captured most of the Former Qin provinces south of the Yellow River, as well as regaining Liang and Yi provinces. However, Prime Minister Xie An, who was most credited with the victory, began to lose favor in Emperor Xiaowu's eyes; Xie's son-in-law, Wang Guobao (), unhappy that Xie did not give him important posts, began to flatter both Emperor Xiaowu and his brother, Sima Daozi, the Prince of Kuaiji, as a means of undercutting Xie. Xie remained prime minister, however, until his death in 385; he was replaced by Sima Daozi. Both Emperor Xiaowu and Sima became obsessed with feasting and drinking, and neither spent much time on affairs of state.\nIn 387, Emperor Xiaowu named his oldest son, five-year-old Sima Dezong, crown prince, notwithstanding the fact that Sima was developmentally disabled—so severely that even after he grew older, he was described as not being able to talk, dress himself, or to tell whether he was full or hungry while eating.\nIn 390, Emperor Xiaowu began to tire of how his brother, Sima Daozi, was taking his favors for granted, and he decided to look for counterbalancing forces. He made the officials Wang Gong (王恭, Empress Wang's brother) and Yin Zhongkan () key regional governors, despite warnings that both Wang and Yin were talented but narrow-minded, and might create issues later.\nLate reign\nBy 395, the conflict between Emperor Xiaowu and Sima had flared into the open, but because of the intercession of Empress Dowager Li, Emperor Xiaowu did not remove his brother. After further mediation by Xu Miao (), the relationship between the brothers seemed to be restored.\nBy 396, Emperor Xiaowu was spending so much of his time on drinking and women that he was not tending to important matters of state. His favorite consort was the beautiful Honoured Lady Zhang. On 6 November 396, when she was almost 30 years old, Emperor joked at a feast saying, \"Based on your age, you should yield your position. I want someone younger.\" That night, after Emperor Xiaowu fell drunk, she ordered all the eunuchs away, bribing them with wine, and then ordered her servant girls to suffocate Emperor Xiaowu by putting a blanket over his face. She further bribed the attendants and claimed that the emperor died suddenly in his sleep. The death was not investigated and the next day, Sima Dezong assumed the throne as Emperor An, with Sima Daozi as regent.\nEra names\n* Ningkang (寧康, níng kāng): 9 February 373 – 8 February 376\n* Taiyuan (太元, tài yuán): 9 February 376 – 12 February 397\nConsorts and issue\n* Empress Xiaowuding, of the Wang clan of Taiyuan (; 360–380), personal name Fahui ()\n* Empress Dowager Ande, of the Chen clan (; 362–390), personal name Guinü ()\n** Sima Dezong, Emperor An (; 382–419), first son\n** Sima Dewen, Emperor Gong (; 386–421), second son\n* Guiren, of the Zhang clan ()\n* Unknown\n** Princess Jinling (; d. 432)\n*** Married Xie Hun of Chen, Duke Wangcai (; d. 412)\n*** Married Wang Lian of Langya ()\nAncestry\nReferences\n*\n| title=晉書 | trans-title=Book of Jin | language=Chinese\n| editor=Fang Xuanling 房玄齡\n| date=648\n| volume=9\n| url=http://book.guqu.net/jinshu/4680.html | access-date=22 July 2017\n}}\n*Sima, Guang: Comprehensive Mirror in Aid of Governance (Zizhi Tongjian)"
    }
  ]
}