{
  "content": [
    {
      "type": "text",
      "text": "# Emperor Chūkyō__disambig_1\n\n}}\n| succession   = Emperor of Japan\n| image        = Emperor Chūkyō by Kōtarō Miyake.jpg\n| caption      =\n| reign        = 13 May 1221 – 29 July 1221\n| coronation   =\n| predecessor  = Juntoku\n| successor    = Go-Horikawa\n| posthumous name = Chinese-style shigō:Emperor Chūkyō ()\n| spouse       =\n| issue        =\n| royal house  = Imperial House of Japan\n| father       = Emperor Juntoku\n| mother       = Fujiwara no Ritsushi\n| birth_date   = 30 October 1218\n| birth_place  =\n| death_date   =\n| death_place  =\n| place of burial = Kujō no Misasagi (九條陵) (Kyoto)|\n}}\n(30 October 1218 – 18 June 1234) was the 85th emperor of Japan, according to the traditional order of succession. His reign spanned only two months in 1221, and he was not officially listed amongst the emperors until 1870 because of doubts caused by the length of his reign. The Imperial Household Agency recognizes Kujō no misasagi (九條陵) near Tōfuku-ji in Fushimi-ku, Kyoto as his tomb.\nGenealogy\nBefore his ascension to the Chrysanthemum Throne, his personal name (his imina) was .\nHe was the first son of Emperor Juntoku. His mother was Ritsushi (?) (立子), daughter of Kujō Yoshitsune (九条良経).\n* Consort: Ukyonodaibu-no-Tsubone (右京大夫局), Priest's daughter\n** First Daughter: Imperial Princess Yoshiko (義子内親王) later Wademon’in (和徳門院, 1234 - 1289)\nEvents of Chūkyō's life\nChūkyō was enthroned at the age of two following the deposition of his father, the Emperor Juntoku in preparation for the Jōkyū Incident, an unsuccessful attempt by Juntoku's father, the Retired Emperor Go-Toba, to overthrow the Kamakura Bakufu.\n* 13 May 1221 (Jōkyū 3, 20th day of the 4th month): In the 11th year of Juntoku-tennōs reign (順徳天皇十一年), the emperor abdicated; and the succession (‘‘senso’’) was received by his eldest son who was only two years old.  Shortly thereafter, Emperor Chūkyō is said to have acceded to the throne (‘‘sokui’’).\nThat same year, after the Jōkyū Incident, he was dethroned and replaced by his first cousin once removed Emperor Go-Horikawa, the nephew of Emperor Go-Toba.\nBecause of his dethronement just 2 months after the Jōkyū Incident, his enthronement was not recognized.  He was known as the Kujō Dethroned Emperor (Kujō Haitei, 九条廃帝), the Half-Emperor (半帝), and the Later Dethroned Emperor (Go-Haitei, 後廃帝, a reference to Emperor Junnin who was often called Haitei, 廃帝).\nIn 1870, he was recognized as an Emperor and given the posthumous name of Emperor Chūkyō.\nKugyō\nKugyō (公卿) is a collective term for the very few most powerful men attached to the court of the Emperor of Japan in pre-Meiji eras.\nIn general, this elite group included only three to four men at a time.  These were hereditary courtiers whose experience and background would have brought them to the pinnacle of a life's career.  During Chūkyo's reign, this apex of the  Daijō-kan included:\n* Sesshō, Kujō Michiie, 1193–1252.\n* Sadaijin, Kujō Michiie.\n* Udaijin\n* Nadaijin\n* Dainagon\nEras of Chūkyō's reign\nThe year of Chūkyō's reign is more specifically encompassed within a single era name or nengō.\n* Jōkyū (1219–1222)\nSee also\n* Emperor of Japan\n* List of Emperors of Japan\n* Imperial cult\nNotes\n— a stylized chrysanthemum blossom]]\nReferences\n* Brown, Delmer M. and Ichirō Ishida, eds. (1979). [ Jien, c. 1220], Gukanshō ([https://books.google.com/books?id=2KOxHQAACAAJ&q=The+Future+and+the+Past,+a+translation+and+study+of+the+Gukansh%C5%8D,+an+interpretative+history+of+Japan+written+in+1219 The Future and the Past, a translation and study of the Gukanshō, an interpretative history of Japan written in 1219]). Berkeley: University of California Press.\n* Ponsonby-Fane, Richard Arthur Brabazon. (1959). [https://books.google.com/books?id=SLAeAAAAMAAJ&q=The+Imperial+House+of+Japan  The Imperial House of Japan.] Kyoto: Ponsonby Memorial Society. [http://www.worldcat.org/wcpa/oclc/194887 OCLC 194887]\n* Titsingh, Isaac, ed. (1834). [Siyun-sai Rin-siyo/Hayashi Gahō, 1652], Nipon o daï itsi ran; ou, [https://books.google.com/books?id=18oNAAAAIAAJ&q=nipon+o+dai+itsi+ran Annales des empereurs du Japon.]  Paris: Oriental Translation Fund of Great Britain and Ireland.\n* Varley, H. Paul, ed. (1980). [ Kitabatake Chikafusa, 1359], Jinnō Shōtōki  ([https://books.google.com/books?id=tVv6OAAACAAJ&q=A+Chronicle+of+Gods+and+Sovereigns:+Jinn%C5%8D+Sh%C5%8Dt%C5%8Dki+of+Kitabatake+Chikafusa A Chronicle of Gods and Sovereigns: Jinnō Shōtōki]. New York: Columbia University Press."
    }
  ]
}