{
  "content": [
    {
      "type": "text",
      "text": "# Emperor Guangwu of Han__disambig_1\n\n| image        = Han Guangwu Di.jpg\n| caption      = Emperor Guangwu, as depicted by the Tang artist Yan Liben (600–673)\n| succession   = Emperor of the Han dynasty\n| reign        = 5 August AD 25 – 29 March AD 57\n| predecessor  = Gengshi Emperor\n| successor    = Emperor Ming\n| birth_date   = 15 January 5 BC\n| birth_place  = Jiyang County, Chenliu Commandery\n| death_date   = 29 March AD 57 (aged 62)\n| death_place  = Luoyang\n| full name    = )|Given name: Xiu ()|Courtesy name: Wenshu ()}}\n| era dates    = ): AD 25–56|Jianwu Zhongyuan (): AD 56–58}}\n| posthumous name = Emperor Guangwu ()\n| temple name  = Shizu ()\n| house        = Eastern Han\n| house-type   = Dynasty\n| father       = Liu Qin\n| mother       = Fan Xiandou\n| spouse       =\n| spouse-type  = Consorts\n| issue        =\n}}\n| s = 汉光武帝\n| p = Hàn Guāngwǔ dì\n| w = Han4 Kuang1-wu3 ti4\n| mi =\n| gr = Hann Guangwuu dih\n| j = Hon4 Gwong1-mou5 dai6\n| y = Hòhn Gwōng-móuh daih\n| tl = Hàn Kng-bú tè\n}}\nEmperor Guangwu of Han (; 15 January 5 BC29 March AD 57), born Liu Xiu (), courtesy name Wenshu (), was a Chinese monarch. He served as an emperor of the Han dynasty by restoring the dynasty in AD 25, thus founding the Eastern Han dynasty. At first, he only ruled over parts of China, since his dynasty was formed through rebellion against the short-lived Xin dynasty, but through suppression and conquest of regional warlords, the whole of China proper was consolidated by the time of his death in AD 57. During his reign, Taoism was made the official religion of China, and the Chinese folk religion began to decline.\nLiu Xiu was one of the many descendants of the Han imperial family. Following the usurpation of the Han throne by Wang Mang and the ensuing civil war during the disintegration of Wang's Xin dynasty, he emerged as one of several descendants of the fallen dynasty claiming the imperial throne. After assembling forces and proclaiming himself emperor in the face of competitors, he was able to defeat his rivals, destroy the peasant army of the Chimei, known for their disorganization and marauding, and finally reunify China in AD 36.\nHe established his capital in Luoyang,  east of the former capital Chang'an (modern Xi'an), ushering in the Eastern Han (Later Han) dynasty. He implemented some reforms (notably land reform, albeit not very successfully) aimed at correcting some of the structural imbalances responsible for the downfall of the Former/Western Han. His reforms gave a new 200-year lease of life to the Han dynasty.\nEmperor Guangwu's campaigns featured many able generals, but he lacked major strategists. That may very well be because he himself appeared to be a brilliant strategist; he often instructed his generals on strategy from afar, and his predictions generally would be accurate. This was often emulated by later emperors who fancied themselves great strategists but who actually lacked Emperor Guangwu's brilliance—usually to disastrous results.\nAlso unique among emperors in Chinese history was Emperor Guangwu's combination of decisiveness and mercy. He often sought out peaceful means rather than bellicose means of putting areas under his control. He was, in particular, one rare example of a founding emperor of a dynasty who did not kill, out of jealousy or paranoia, any of the generals or officials who contributed to his victories after his rule was secure.\nFamily background\nLiu Xiu was the sixth generation descendant of Emperor Jing of the Western Han dynasty. He was the son of Liu Qin (劉欽), magistrate (縣令 i.e., head official) of Nandun County (南頓縣), near present-day Xiangcheng, Henan. Liu Qin was the son of Liu Hui (劉回), vice governor in charge of military affairs for Julu Commandery (鉅鹿都尉). Liu Hui was the son of Liu Wai (劉外), governor of Yulin Commandery (鬱林太守). Liu Wai was the son of Liu Mai (劉買), known posthumously as Marquess Jie of Chongling (舂陵節侯). Liu Mai was the son of Liu Fa (劉發), known posthumously as Prince Ding of Changsha (長沙定王). The Prince of Changsha was a brother of Emperor Wu, a famous emperor of the Former Han and the son of Emperor Jing and Lady Tang. As a descendant of Liu Fa, this also made Liu Xiu third cousin to the Gengshi Emperor.\nLiu Qin was married to the daughter of one Fan Chong (樊重), and he and his wife had three sons – Liu Yan, Liu Zhong (劉仲), and Liu Xiu. Liu Qin died early, and the brothers were raised by their uncle Liu Liang (劉良). Liu Yan was ambitious, and ever since Wang Mang usurped the Han throne in AD 8 and established the Xin dynasty, Liu Yan was constantly considering starting a rebellion to restore the Han dynasty. Liu Xiu, in contrast, was a careful man who was content to be a farmer. However, his brother-in-law Deng Chen (鄧晨), the husband of his sister Liu Yuan (劉元), who believed in a prophecy that a man named Liu Xiu would be emperor, constantly encouraged him to be more ambitious.\nJoining Lulin rebellion against Wang Mang\nIn AD 22, with virtually the entire empire rebelling against Wang Mang's incompetent rule, Liu Yan prepared his rebellion. He planned, along with his brothers, and Li Tong (李通) and his cousin Li Yi (李軼), to kidnap the governor for Nanyang Commandery (roughly modern Nanyang, Henan) and call for the people of the commandery to join him. When the young men of their home territory of Chongling heard about the rebellion, they were all scared to join—until they saw that Liu Xiu was part of the rebellion as well, figuring that if even a careful man like Liu Xiu was part of the rebellion, the rebellion was carefully planned.\nHowever, the news of the plan leaked out, and Li Tong and Li Yi barely escaped with their lives (but their family was slaughtered). Liu Yan changed his plan and persuaded two branches of the Lulin – the Xinshi Force (新市兵) and Pinglin Force (平林兵) to join forces with him, and they had some military success. Encouraged, Liu Yan made a frontal assault against Wancheng (宛城), the capital of Nanyang Commandery—and suffered a major loss. Liu Yan and Liu Xiu, along with their sister Liu Boji (劉伯姬), survived, but their brother Liu Zhong and sister Liu Yuan died in the battle. Liu Yan's allies, seeing his defeat, considered leaving him, but Liu Yan was able to persuade them, along with another branch of the Lülin, the Xiajiang Force (下江兵), to join him. In AD 23, they had a major victory against Xin forces, killing Zhen Fu (甄阜), the governor of Nanyang Commandery.\nAs official under Gengshi Emperor\nThe Gengshi Emperor\nBy this point, many other rebel leaders had become jealous of Liu Yan's capabilities, and while a good number of their men admired Liu Yan and wanted him to become the emperor of a newly declared Han dynasty, they had other ideas. They found another local rebel leader, Liu Xuan, a third cousin of Liu Yan, who was claiming the title of General Gengshi (更始將軍) at the time and who was considered a weak personality, and requested that he be made emperor. Liu Yan initially opposed this move and instead suggested that Liu Xuan carry the title \"Prince of Han\" first (echoing the founder of the Han dynasty, Emperor Gaozu). The other rebel leaders refused, and in early AD 23, Liu Xuan was proclaimed emperor. Liu Yan became prime minister. Liu Xiu, along with many other rebel leaders, carried the title \"general\".\nThe Battle of Kunyang\nLiu Xiu would be instrumental in the key victory that sealed Wang Mang's fate. Wang, aware that Gengshi Emperor was becoming a major threat, sent his cousin Wang Yi (王邑) and his prime minister Wang Xun (王尋) with what he considered to be overwhelming force, some 430,000 men, intending to crush the newly constituted Han regime. The Han forces were at this point in two groups—one led by Wang Feng (王鳳), Wang Chang (王常), and Liu Xiu, which, in response to the arrival of the Xin forces, withdrew to the small town of Kunyang (昆陽, in modern Ye County, Henan) and one led by Liu Yan, which was still besieging Wancheng. The rebels in Kunyang initially wanted to scatter, but Liu Xiu opposed it; rather, he advocated that they guard Kunyang securely, while he would gather all other available troops in surrounding areas and attack the Xin forces from the outside. After initially rejecting Liu Xiu's idea, the Kunyang rebels eventually agreed.\nLiu Xiu carried out his action, and when he returned to Kunyang, he began harassing the sieging Xin forces from the outside. Wang Yi and Wang Xun, annoyed, led 10,000 men to attack Liu Xiu and ordered the rest of their troops not to move from their siege locations. Once they engaged in battle, however, after minor losses, the other units were hesitant to assist them, and Liu Xiu killed Wang Xun in battle. Once that happened, the Han forces inside Kunyang burst out of the city and attacked the other Xin units, and the much larger Xin forces suffered a total collapse. The soldiers largely deserted and went home, unable to be gathered again. Wang Yi had to withdraw with only several thousand men back to Luoyang. This was a major blow to Xin, psychologically; after this point on, there would be no hope for it.\nLiu Yan's death and Liu Xiu's survival\nThe very first major incident of infighting in Gengshi Emperor's regime would happen in this time, though. The Gengshi Emperor was fearful of Liu Yan's capabilities and was keenly aware that many of Liu Yan's followers were angry that he was not made emperor. One, Liu Ji (劉稷), was particularly critical of Gengshi Emperor. The Gengshi Emperor arrested Liu Ji and wanted to execute him, but Liu Yan tried to intercede. The Gengshi Emperor, encouraged by Li Yi (who had by that point turned against Liu Yan) and Zhu Wei (朱鮪), took this opportunity to execute Liu Yan as well.\nAt this time, Liu Xiu was fighting on the frontlines. When he heard about his brother's death, he quickly left his army and went back to the temporary capital Wancheng to beg forgiveness. When Liu Yan's followers greeted him, he only thanked them but did not speak of his feelings, but rather blamed himself and did not mention of his achievements at Kunyang. He did not dare to mourn his brother. The Gengshi Emperor, ashamed of what he had done, spared Liu Xiu and created him the Marquess of Wuxin (武信侯).\nAround this time, Liu Xiu married his childhood sweetheart, the famed beauty Yin Lihua. (According to Hou Han Shu, when Liu Xiu was younger, he visited the capital Chang'an; he became impressed with the mayor of the capital (zhijinyu, 執金吾) and, also impressed by Yin's beauty, he made the remarks: \"If I were to be an official, I want to be zhijinyu; if I were to marry, I want to marry Yin Lihua\". He eventually was able to accomplish both of these things and more.)\nRole in reorganization of Gengshi Emperor's regime and dispatch to northern China\nFirst days under the new emperor\nbronze chariot and cavalry figurines excavated from a tomb]]\nSoon, Wang Mang's Xin dynasty and its capital Chang'an fell to the Gengshi Emperor's forces, and Gengshi Emperor was acknowledged by virtually the entire empire as the emperor of the restored Han dynasty. He initially planned to set his capital at Luoyang, and he made Liu Xiu governor of the capital region. Liu Xiu was commissioned to repair the palaces and governmental offices at Luoyang. Of all of the major Han officials following the restoration, Liu Xiu alone quickly showed his talent for organization, and his agency quickly grew to resemble its pre-Wang Mang counterpart.\nIn any case, Gengshi Emperor's regime was only able to obtain nominal submission from many regions of the empire, and one of the troublesome regions was north of the Yellow River. The Emperor considered dispatching a general to try to pacify the region, and his cousin Liu Ci (劉賜), who had succeeded Liu Yan as prime minister, endorsed Liu Xiu for that task. Liu Yan's political enemies, including Li and Zhu, opposed, but after Liu Ci repeatedly endorsed Liu Xiu, the Gengshi Emperor relented and, in autumn of AD 23, he sent Liu Xiu to the region north of the Yellow River.\nLiu Xiu was initially met with great gladness by the people north of the Yellow River. It was around this time that Deng Yu joined him (later to be his prime minister); other later important figures who joined him around this time included Feng Yi and Geng Chun (耿純). Deng, seeing that the Gengshi Emperor lacked the ability to rule, persuaded Liu Xiu to keep his sights broad and consider eventual independence.\nNorthern expedition\n(25 AD-220 AD) mural showing a procession of chariots and cavalry, from the Dahuting Tomb of Zhengzhou, Henan province, China]]\nLiu Xiu would soon have a major problem on his hand, however, in winter 23, as he faced a pretender for the Han throne. A fortune teller in Handan named Wang Lang claimed to be actually named Liu Ziyu (劉子輿) and a son of Emperor Cheng. He claimed that his mother was a singer in Emperor Cheng's service, and that Empress Zhao Feiyan had tried to kill him after his birth, but that a substitute child was killed instead. After he spread these rumors among the people, the people of Handan began to believe that he was a genuine son of Emperor Cheng, and the commanderies north of the Yellow River quickly pledged allegiance to him as emperor. In the spring of AD 24, Liu Xiu was forced to withdraw to the northern city of Jicheng (modern Beijing). Not long after, he faced rebellions in his immediate vicinity, and was nearly killed by rebels who pledged allegiance to Wang. He reached two commanderies in modern central Hebei that were still loyal to Gengshi Emperor—Xindu (信都, roughly modern Hengshui, Hebei), whose governor was Ren Guang (任光), and Herong, (和戎, roughly part of modern Shijiazhuang, Hebei), whose governor was Pi Tong (邳彤). Ren's deputy Li Chong (李忠), Wan Xiu (萬脩) and Liu Zhi (劉植), who was powerful clan in the region, also joined him. Additionally, he began to make Liu Zhi persuade Liu Yang (劉楊) the Prince of Zhending, who held 100,000 troops, to join him. He entered into a political marriage with Guo Shengtong, the niece of Liu Yang, and combined his forces. He mobilized their forces and won some major battles against Wang's generals.\nMeanwhile, a follower of Liu Xiu, Geng Yan, the son of the governor of Shanggu Commandery (上谷, roughly modern Zhangjiakou, Hebei), had fled back to his father's commandery, and persuaded both his father Geng Kuang (耿況) and the governor of the neighboring Yuyang Commandery (漁陽, roughly modern Beijing), Peng Chong (彭寵), to support Liu Xiu. Geng Yan, being supported by Gen Kuang's deputy Kou Xun (寇恂) and Jing Dan (景丹), and Peng's deputy, Wu Han, led the two commanderies' cavalry and infantry forces south to join Liu Xiu. The combined forces gave Liu Xiu enough strength to make a direct assault against Handan, trapping and killing Wang Lang.\nAfter Wang's death, Gengshi Emperor made Liu Xiu the Prince of Xiao and summoned him back to the capital (then moved to Chang'an). Liu Xiu, persuaded by Geng Yan that he should be ready to set out his own course because the people were badly shaken by Gengshi Emperor and his officials' misrule, declined and claimed that the region still needed to be pacified.\nIndependence from the Gengshi Emperor\nIn the autumn of AD 24, Liu Xiu, still ostensibly an official under Gengshi Emperor, successfully pacified some of the larger agrarian rebel groups and merged them into his own forces. He also started replacing officials loyal to Gengshi Emperor with those loyal to himself. He consolidated his power north of the Yellow River and, as he predicted that the powerful Chimei would destroy Gengshi Emperor's government for him, he waited by for that to happen, not intervening on either side as that conflict was developing. He put Kou Xun in charge of the Henei (modern northern Henan, north of the Yellow River) region and made it the base for food and manpower supplies, while commissioning Deng with an expedition force to the modern Shaanxi region, waiting for the confrontation between Gengshi Emperor and Chimei. In early AD 25, Deng, on his way west, seized the modern Shanxi region and put it under Liu Xiu's control, before crossing the Yellow River into modern Shaanxi.\nAt this point, territories that Liu Xiu controlled were already impressive, compared to any other regional power in the empire broken apart by civil war—but he still carried just the title Prince of Xiao (which Gengshi Emperor had created him) and still ostensibly was controlling those territories as Gengshi Emperor's deputy, even as he was already engaging militarily against some generals (e.g. Xie Gong – 謝躬) loyal to Gengshi Emperor (During this incident, Liu Xiu succeeded to persuade Ma Wu (馬武), who was the deputy of Xie Gong, to join him.). In the summer of AD 25, after repeated urging by his followers, he finally claimed the title of emperor and the right to succeed to the Han throne—as Emperor Guangwu.\nCampaign to unify the empire\nVictory over the Chimei\n(25 AD-220 AD) Chinese ceramic figurine of a soldier with a missing spear]]\nSoon after Emperor Guangwu's ascension, the Gengshi Emperor's regime was destroyed by the Chimei, who supported their own pretender to the Han throne, Liu Penzi. The Chimei leaders, despite being militarily powerful, were however even less capable at ruling than the Gengshi Emperor, and they soon alienated the people of the Guanzhong (關中, modern central Shaanxi) region, which they had taken over when they overthrew the Gengshi Emperor. They pillaged the Guanzhong region for supplies, but as eventually the supplies ran out, they were forced to withdraw east in an attempt to return home to what is now modern Shandong and northern Jiangsu. Emperor Guangwu, anticipating this, set up his forces to harass and tire the Chimei out, and then block them off at Yiyang (宜陽, in modern Luoyang, Henan). With their path blocked and their troops exhausted, the Chimei leaders surrendered. Emperor Guangwu spared them, including their pretender Liu Penzi.\nGradual victories over other regional powers\nChimei was the largest of the enemy forces that Emperor Guangwu had to deal with in his campaign to reunify the empire under the rule of his Eastern Han dynasty, but there were a number of regional powers that he had to deal with. These included:\n* Liu Yong (劉永), also claiming to be the proper emperor of Han, based on his lineage—as the son of Liu Li (劉立), the Prince of Liang under the reigns of Emperor Cheng, Emperor Ai, and Emperor Ping who had been forced by Wang Mang to commit suicide; he controlled the modern eastern Henan and northern Jiangsu region.\n* Peng Chong, who had been by this point aggravated by Emperor Guangwu's official Zhu Fu (朱浮) into rebellion (in a rare case of a succession of wrong decisions by Emperor Guangwu—mistakes that he learned from and would not repeat); he claimed the title of the Prince of Yan and controlled the modern Beijing region.\n* Zhang Bu (張步), nominally the Prince of Qi under Liu Yong, but who independently controlled the modern Shandong region.\n* Wei Xiao (隗囂), nominally the commander of the Xizhou (西州) region paying allegiance to Emperor Guangwu, but who independently controlled the modern eastern Gansu region, east of the Yellow River.\n* Dou Rong (竇融), nominally the governor of Liang Province (涼州) paying allegiance to Emperor Guangwu, but who independently controlled the modern western Gansu and northern Qinghai region, west of the Yellow River.\n* Lu Fang (盧芳), who also claimed the name Liu Wenbo (劉文伯) and claimed to be a descendant of Emperor Wu and the proper Han emperor. He, supported by Xiongnu's Chanyu Yu (輿), controlled the modern central and western Inner Mongolia region. Some Russian archaeologists have identified a Han-era Chinese-style palace unearthed near Abakan (in Southern Siberia) in 1941–45 as Lu Fang's residence after he had left China for the lands of the Xiongnu.\n* Gongsun Shu, who proclaimed himself emperor of Chengjia, who controlled the Yi Province, modern Sichuan, Chongqing and parts of Shaanxi, Guizhou, and Yunnan.\nOf these powers, Gongsun Shu's Chengjia was wealthy and powerful, but Gongsun was content to maintain his regional empire and not carry out any military expeditions outside his empire. Instead, he sat by as Emperor Guangwu carried out his unification campaign. Emperor Guangwu, hesitant to carry out annihilation campaigns, largely preferred first trying to persuade the regional warlords to submit to him. Wei and Dou did in AD 29, and as they were assisting Eastern Han forces to the north of Chengjia, Gongsun was further discouraged from trying to expand his empire.\nAlso in AD 29, Liu Yong's son and heir Liu Yu (劉紆) was defeated by Eastern Han forces and killed. Also in AD 29, Peng's slaves assassinated him, leading to a collapse of his regime. Zhang, seeing the futility of resistance, surrendered and was created a marquess. By AD 30, all of eastern China was under Emperor Guangwu's rule.\nWei, seeing that Eastern Han was gradually unifying the empire, inexplicably began considering independence. He tried to persuade Dou to enter into an alliance with him to resist Eastern Han; Dou refused. When Eastern Han started considering conquering Chengjia, Wei, apprehensive of the implications of Chengjia's fall, tried to persuade Emperor Guangwu not to carry out a campaign against Chengjia, and later refused to lead his forces south against Chengjia.\nEmperor Guangwu, who in any case preferred peaceful resolution, repeatedly wrote both Wei and Gongsun with humble terms, trying to get them to submit to him, promising them titles and honors. Wei continued to nominally submit but act as an independent power, while Gongsun refused outright—but continued to be indecisive and took no actions while Eastern Han's rule was being confirmed throughout the land.\nRealizing that neither Wei nor Gongsun would voluntarily submit, Emperor Guangwu started a campaign against Wei in the summer of AD 30—assisted by Wei's friend Ma Yuan, who had served as Wei's liaison officer to Emperor Guangwu and had tried in vain to persuade him not to take the course of independence. In response, Wei formally submitted to Gongsun and accepted a princely title—Prince of Shuoning—from him, and also tried to persuade Dou to join him. Dou refused, and attacked Wei in coordination with Emperor Guangwu's forces. After some initial successes, Wei's small independent regime eventually collapsed under overwhelming force and was reduced severely. In AD 33, Wei died and was succeeded by his son Wei Chun (隗純). In the winter of AD 34, Shuoning's capital Luomen (落門, in modern Tianshui, Gansu) fell, and Wei Chun surrendered.\nEmperor Guangwu then turned his attention to Chengjia. He commissioned his generals Wu Han, Cen Peng (岑彭), Lai She (來歙), and Gai Yan (蓋延) to go on a two-pronged attack on Chengjia—Wu and Cen leading an army and a navy up the Yangtze river from modern Hubei, while Lai and Gai led an army south from modern Shaanxi. Instead of fighting the Eastern Han expedition on the battlefield, Gongsun tried to repel them by assassinating their generals—and he was initially successful, assassinating Cen and Lai and temporarily causing the Eastern Han forces to halt. However, Eastern Han forces regrouped, and in 36 they had Gongsun surrounded in his capital Chengdu (成都, modern Chengdu, Sichuan). However, initial attempts to siege the city was unsuccessful, and Wu, then in command of the expeditory force, considered withdrawing. Persuaded by his lieutenant Zhang Kan (張堪) that Gongsun was in desperate straits, however, Wu tricked Gongsun into believing that the Eastern Han forces were collapsing from fatigue, drawing him out of the city and engaging in battle. Gongsun was mortally wounded in battle, and Chengdu surrendered in the winter of AD 36. Liu's general Wu Han then killed more than 10,000 people.\nAfter Chengjia's fall, Dou turned over the lands under his control to Emperor Guangwu in AD 36, and was made prime controller. Lu, after initially submitting to Emperor Guangwu and made the Prince of Dai (as Emperor Guangwu maintained the fiction that Lu was actually from imperial lineage), eventually rebelled again, but, unable to succeed, eventually fled to Xiongnu in AD 42. The empire was entirely under Emperor Guangwu's rule. During the wartime, Liu's general Geng Yan massacred 300 cities.\nReign over unified empire\n'']]\nAlthough Emperor Guangwu had already created many of his generals and officials marquesses, in AD 37, after the conquest of the empire was largely complete, he readjusted their marches in accordance with their accomplishments. He also considered what would be the best way to preserve the relationships between him and his generals and to protect their title and position so he therefore resolved to give the generals large marches but not give them official positions in his government. He rewarded them with great wealth and often listened to their advice, but rarely put them in positions of authority. He thereby reduced friction between him and his generals, thus allowing for their relationships to be preserved. In this, he was matched perhaps only by Emperor Taizu of Song.\nAs the emperor of the unified empire, Emperor Guangwu's reign was marked by thriftiness, efficiency, and laxity of laws. For example, in AD 38, his official Liang Tong (梁統) submitted a petition to restore the criminal laws of late Western Han dynasty—which were far more severe. After discussion with other officials, Emperor Guangwu tabled Liang's suggestion. But he originated the order that servants in the inner palace must be eunuchs.\nEmperor Guangwu, however, had to deal with two campaigns against non-Chinese peoples. In AD 40, a Vietnamese woman named Trưng Trắc (Chinese: Zheng Ce (徵側)) and her sister Trưng Nhị (Chinese: Zheng Er (徵貳)) rebelled. Trưng Trắc claimed the title of queen, and she ruled over an independent kingdom for several years. In AD 41, Emperor Guangwu sent Ma Yuan against the Trưng sisters. In AD 43, he defeated the Trưng sisters and killed them. (According to Vietnamese historians, they committed suicide by jumping into a river.)\nEmperor Guangwu also had to deal with periodic minor battles against the Xiongnu to the north. However, throughout his reign, there were no major wars with Xiongnu. Nevertheless, because of raids by Xiongnu, Wuhuan, and Xianbei, the northern commanderies became largely unpopulated, as the people suffered great casualties and also fled to more southerly lands.\nWith these engagements, Emperor Guangwu declined yet another foreign engagement. In AD 46, many Xiyu (modern Xinjiang and former Soviet central Asia) kingdoms were suffering under the hegemony of one of the kingdoms, Shache (Yarkand). They petitioned Emperor Guangwu to again reestablish the Western Han post of the governor of Xiyu. Emperor Guangwu declined, stating that his empire was so lacking in strength at the time that he could not expend efforts to protect Xiyu kingdoms. In response, the Xiyu kingdoms submitted to Xiongnu.\nMarital and succession issues\nWhile still under the Gengshi Emperor's reign, Emperor Guangwu married his childhood sweetheart Yin Lihua. Later, in AD 24, while he was on his expedition north of the Yellow River, he entered a political marriage with Guo Shengtong (郭聖通), the niece of a regional warlord, Liu Yang (劉楊) the Prince of Zhending. In AD 25, Guo birth him a son, Liu Jiang (劉疆).\nIn AD 26, Emperor Guangwu was prepared to create an empress, and he favored his first love, Yin. However, Yin had not yet had a son by that point, and she declined the empress position and endorsed Guo. Emperor Guangwu therefore made Guo empress and her son Prince Jiang crown prince.\nBut by AD 41, Empress Guo had lost the emperor's favor. She continuously complained about that fact, and this angered Emperor Guangwu. In AD 41, he deposed her and made Yin empress instead. Rather than imprisoning Guo (as is often the fate of deposed empresses), he made her son Liu Fu (劉輔) the Prince of Zhongshan and made her the Princess Dowager of Zhongshan. He made her brother Guo Kuang (郭況) an important official and, perhaps as a form of alimony, rewarded him with great wealth.\nNot having the heart to depose both mother and son, Emperor Guangwu initially left Guo's son, Jiang, as the crown prince. However, Crown Prince Jiang, realizing that his position was precarious, repeatedly offered to step down. In AD 43, Emperor Guangwu agreed and made Liu Yang (劉陽), the oldest son of Empress Yin, crown prince instead. Former Crown Prince Jiang was made the Prince of Donghai. He also changed Prince Yang's name to Zhuang (莊).\nLate reign\nIn AD 47, an opportunity arose with regard to Xiongnu. Xiongnu had a succession dispute, pitting the current chanyu, Punu (蒲奴) against his cousin Bi (比), the son of a former chanyu. In AD 48, Bi also claimed the title of chanyu, and submitted to Emperor Guangwu's authority. Punu also submitted, in response, and the divided Xiongnu stopped waging war against Han.\nIn AD 49, a rare blot on Emperor Guangwu's rule occurred. He had once again commissioned Ma Yuan to go on an expedition—against the indigenous people of the Wulin Commandery (modern northwestern Hunan and eastern Guizhou), who had rebelled. While Ma was on the expedition, however, a number of Ma's political enemies made false accusations against Ma. Emperor Guangwu, believing these accusations, began investigating Ma, who happened to die of illness while on the campaign. With Ma dead and unable to defend himself, Emperor Guangwu stripped Ma of his marquess title and denounced him posthumously. (Ma's reputation was not restored until his daughter later became empress to Emperor Guangwu's son Emperor Ming.)\nIn AD 57, Emperor Guangwu died. He was succeeded by Crown Prince Zhuang, who ascended the throne as Emperor Ming.\nEra names\n*Jianwu (建武): AD 25–56\n*Jianwuzhongyuan (建武中元): AD 56–58\nConsorts and issue\n* Empress Guanglie, of the Yin clan (; 5–64), personal name Lihua ()\n** Liu Zhuang, Emperor Xiaoming (; 28–75), fourth son\n** Liu Cang, Prince Xian of Dongping (; d. 83), sixth son\n** Princess Nieyang (), personal name Zhongli (), second daughter\n*** Married Dou Gu of Fufeng, Marquis Xianqin (; d. 88)\n** Liu Jing, Prince Si of Guangling (; d. 67), eighth son\n** Liu Heng, Duke Huai of Linhuai (; d. 41), ninth son\n** Liu Jing, Prince Xiao of Langya (; d. 81), 11th son\n* Empress, of the Guo clan (; d. 52), fifth cousin, personal name Shengtong ()\n** Liu Qiang, Prince Gong of Donghai (; 25–58), first son\n** Liu Fu, Prince Xian of Pei (; d. 84), second son\n** Liu Kang, Prince An of Jinan (; d. 97), fifth son\n** Princess Guantao (; d. 73), personal name Hongfu (), third daughter\n*** Married Han Guang (; d. 73), and had issue (one son)\n** Liu Yan, Prince Zhi of Fuling (; d. 89), seventh son\n** Liu Yan, Prince Jian of Zhongshan (; 39–90), tenth son\n* Meiren, of the Xu clan (; d. 86)\n** Liu Ying, Prince Chu (; d. 71), third son\n* Unknown\n** Princess Wuyang (), personal name Yiwang (), first daughter\n*** Married Liang Song of Anding, Marquis Ling (), and had issue (one son)\n** Princess Yuyang (), personal name Liliu (), fourth daughter\n*** Married Guo Huang, Marquis Yang'an (; d. 92) in 52\n** Princess Liyi (; d. 59), personal name Shou (), fifth daughter\n*** Married Yin Feng (; d. 59)\nSee also\n* Family tree of the Han dynasty\n* Resurgence of Guangwu\nReferences\n*Bielenstein, Hans. (1986). \"Wang Mang, the Restoration of the Han Dynasty, and Later Han\", in ''The Cambridge History of China: Volume I: the Ch'in and Han Empires, 221 B.C. – A.D. 220, 223–290. Edited by Denis Twitchett and Michael Loewe. Cambridge: Cambridge University Press. .\n* Zizhi Tongjian by Sima Guang, vols. 38–44 (original available at :zh:s:資治通鑑), and Modern Chinese Edition edited by Bo Yang (Taipei, 1982–1989).\n* Hou Han Shu'' by Fan Ye, vol. 1 (Biography of Emperor Guangwu), [https://web.archive.org/web/20080210141642/http://ef.cdpa.nsysu.edu.tw/ccw/02/hhb01.htm].\nExternal links\n*"
    }
  ]
}