{
  "content": [
    {
      "type": "text",
      "text": "# Emperor Go-Murakami\n\n}}\n| succession   = Emperor of Japan\n| image        = Emperor Go-Murakami cropped.jpg\n| caption      =\n| reign        = September 18, 1339 – March 29, 1368\n| coronation   = November 6, 1339\n| cor-type     = Japan\n| predecessor  = Go-Daigo\n| successor    = Chōkei\n| posthumous name = Tsuigō:Emperor Go-Murakami ( or )\n| reg-type     = Shōgun\n| regent       = Ashikaga TakaujiAshikaga Yoshiakira\n| issue        = Emperor ChōkeiEmperor Go-Kameyama\n| issue-link   = #Genealogy\n| issue-pipe   = more...\n| royal house  = Imperial House of Japan\n| father       = Emperor Go-Daigo\n| mother       = Fujiwara no Renshi\n| birth_name   =\n| birth_date   = 1328\n| birth_place  =\n| death_date   =\n| death_place  =\n| place of burial = Hinoo no Misasagi (檜尾陵) (Osaka)\n| signature    = |\n}}\n(1328 – March 29, 1368) was the 97th emperor of Japan, according to the traditional order of succession, and a member of the Southern Court during the Nanboku-chō period of rival courts.  He reigned from September 18, 1339, until March 29, 1368 (Shōhei 23, 11th day of the 3rd month). His personal name was .  He reigned from Sumiyoshi, Ōsaka, Yoshino, Nara, and other temporary locations.\nThis 14th-century sovereign was named after the 10th-century Emperor Murakami and go- (後), translates as \"later\"; and thus, he is sometimes called the \"Later Emperor Murakami\". The Japanese word go has also been translated to mean the \"second one\"; and in some older sources, this emperor may be identified as \"Murakami, the second\", or as \"Murakami II\".\nEvents of Go-Murakami's life\n\"Prince Norinaga\" was Go-Daigo's son from his \"favorite consort of his later years\".  This was Lady Renshi.\nHe lived during the turbulent years of conflict between rival claimants to the Chrysanthemum Throne.  The contested succession pitted what were known as the Northern and Southern Courts against each other.  These years are also known as the Nanboku-chō period.  When Emperor Go-Daigo began his Kenmu Restoration, the still very young prince, along with Kitabatake Akiie, in 1333 went to Tagajō in what is now Miyagi Prefecture, at the time Mutsu Province, to return the eastern samurai to their allegiance and destroy the remnants of the Hōjō clan.  However, in 1336, because Ashikaga Takauji had raised a rebellion, the Emperor returned to Sakamoto with a strong force to confront him.\nHe was accompanied by Kitabatake Akiie, in order to confront Takauji.  When Takauji defeated them in Kyōto in 1336, they again returned to Mutsu Province.  In 1337, because Tagajō was attacked, they returned yet again to the west, returning to Yoshino while constantly fighting battles.\nIn 1338, he headed to Tagajō, but returned to Yoshino because of a storm.  In Oct. 1338, he was named Crown Prince.  On 19 Sept. 1339, he became emperor upon the death of Emperor Go-Daigo. Kitabatake Chikafusa became his advisor.\nIn 1348, Kō no Moronao attacked Yoshino, and the Emperor left for modern-day Nishiyoshino Village in Yoshino District, Nara Prefecture, which was then Yamato Province.  In 1352, he entered Otokoyama in Yamashiro Province.  As a result of the Battle of Shichijō Ōmiya, Kusunoki Masanori recovered Kyōto from Ashikaga Yoshiakira.\nAt this time, April 1352, the Retired Northern Emperors Kōgon, Kōmyō, and Sukō were taken to Anau, the location of the Southern Court.  However, within twenty days, Ashikaga Yoshiakira had recaptured Kyōto.\nThe Emperor and his retinue were confined to Otokoyama, but escaped to Kawachi Province during an attack by Yoshiakira, and a few months later returned to Yoshino.\nIn 1361, Hosokawa Kiyōji and Kusunoki Masanori, who had returned to the Southern Court's allegiance, attacked Kyōto, and temporarily recovered it.  But, Yoshiakira quickly responded, and they evacuated Kyōto in less than twenty days.\nThey continued trying to recover Kyōto, but the Southern Court's power was already weakening, and by the Emperor's death in 1368, Ashikaga Yoshimitsu was in power and the throne had been moved to Sumiyoshi.\nGo-Murakami's tomb is known as Hinoo no misasagi (檜尾陵); it is located in the precincts of Kanshin-ji temple (観心寺) in Kawachinagano, Osaka.\nKugyō\nKugyō (公卿) is a collective term for the very few most powerful men attached to the court of the Emperor of Japan in pre-Meiji eras. Even during those years in which the court's actual influence outside the palace walls was minimal, the hierarchic organization persisted.\nIn general, this elite group included only three to four men at a time.  These were hereditary courtiers whose experience and background would have brought them to the pinnacle of a life's career.  During Go-Murakami's reign, this apex of the Daijō-kan included:\n* Sadaijin\n* Udaijin\n* Naidaijin\n* Dainagon\nEras of Go-Murakami's reign\nThe years of Go-Murakami's reign are more specifically identified by more than one era name or nengō.\n:'Nanboku-chō southern court'\n*Eras as reckoned by legitimate Court (as determined by Meiji rescript)\n** Engen               (1336–1340)\n** Kōkoku              (1340–1346)\n** Shōhei              (1346–1370)\n:'Nanboku-chō northern court'\n*Eras as reckoned by pretender Court (as determined by Meiji rescript)\n** Ryakuō       (1338–1342)\n** Kōei     (1342–1345)\n** Jōwa                (1345–1350)\n** Kannō          (1350–1352)\n** Bunna               (1352–1356)\n** Embun               (1356–1361)\n** Kōan  (1361–1362)\n** Jōji                (1362–1368)\n** Ōan                 (1368–1375)\nGenealogy\nHe was the seventh son of Emperor Go-Daigo\n*Consort: Minamoto (Kitabatake) Akiko (源 (北畠) 顕子), Kitabatake Chikafusa's daughter\n**First daughter: Imperial Princess Noriko (憲子内親王; 1345–1391) later Shin-Sen'mon-in (新宣陽門院)\n*Court Lady: Fujiwara no Shōshi (藤原勝子) later Kaki Mon'in, Ano Sanetama's daughter\n**First son: Imperial Prince Yutanari (寛成親王) later Emperor Chōkei\n**Second son: Imperial Prince Hironari (熙成親王) later Emperor Go-Kameyama\n**Fourth son: Imperial Prince Yasunari (泰成親王, 1360–1423)\n*Consort: Okurakyo-no-Tsubone (大蔵卿局)\n**Third son: Imperial Prince Korenari (惟成親王, d. 1423)\n**Fifth son: Imperial Prince Moronari (師成親王, 1361–1431)\n*Consort: Reizen-no-Tsubone (冷泉局)\n**Seventh son: Imperial Prince Yoshinari (良成親王, d. 1395)\n*unknown\n**Sixth son: Imperial Prince Kanenari (説成親王)\n**daughter: Imperial Princess Sadako (貞子内親王)\nSee also\n* Imperial cult\n* List of Emperors of Japan\nReferences\n— a stylized chrysanthemum blossom]]\nReferences\n* Ponsonby-Fane, Richard Arthur Brabazon (1959). [https://books.google.com/books?id=SLAeAAAAMAAJ The Imperial House of Japan.] Kyoto: Ponsonby Memorial Society. .\n* Titsingh, Isaac, ed. (1834). [Siyun-sai Rin-siyo/Hayashi Gahō, 1652], Nipon o daï itsi ran; ou, [https://books.google.com/books?id=18oNAAAAIAAJ Annales des empereurs du Japon].  Paris: Oriental Translation Fund of Great Britain and Ireland. ."
    }
  ]
}