{
  "content": [
    {
      "type": "text",
      "text": "# Emperor of Sand\n\n| recorded     = October–December 2016\n| venue        =\n| studio       =\n| genre        = |stoner metal|hard rock}}\n| length       =\n| label        =\n| producer     = Brendan O'Brien\n| prev_title   = Once More 'Round the Sun\n| prev_year    = 2014\n| next_title   = Cold Dark Place\n| next_year    = 2017\n| misc         =\n}}\nEmperor of Sand is the seventh studio album by American heavy metal band Mastodon. It was released on March 31, 2017 through record label Reprise Records. The album's first single, \"Show Yourself\", peaked at number 4 on the US Billboard Mainstream Rock Songs chart in 2017. The second single, \"Steambreather\", peaked at number 18 on the same chart. It was ranked on several year-end lists, including at number three on The Independents \"Top 20 Rock & Metal Albums of 2017\".\nBackground\nEmperor of Sand is Mastodon's seventh studio album. The album was recorded at the Quarry in Kennesaw, Georgia and mixed at Henson Recording Studios in Los Angeles. The band worked with record producer Brendan O'Brien, with whom they collaborated on their 2009 album Crack the Skye. The songs were recorded as originally arranged, then they revisited each track to edit and refine the sound. Drummer Brann Dailor completed his drum tracks and began drafting lyrics while guitars and bass were being recorded by other band members.\nScott Kelly of Neurosis and Kevin Sharp of Brutal Truth both appear as guest vocalists on \"Scorpion Breath\" and \"Andromeda\" respectively. Kelly appeared as a guest vocalist on every Mastodon studio album from Leviathan (2004) to the compilation Medium Rarities (2020).\nConcept and lyrical themes\nThe concept and story in Emperor of Sand follows a desert wanderer who has been handed a death sentence. Themes of death and survival are woven into the songs' lyrics, which were inspired by experiences members of the band had when family and friends were recently diagnosed with cancer.\n\"At the end of the story, the person simultaneously dies and is saved,\" Dailor said. \"It's about going through cancer, going through chemotherapy and all the things associated with that. I didn't want to be literal about it. But it's all in there. You can read between the lines.\"\n\"We're reflecting on mortality,\" bassist and vocalist Troy Sanders said in a statement. \"To that end, the album ties into our entire discography. It's 17 years in the making, but it's also a direct reaction to the last two years. We tend to draw inspiration from very real things in our lives.\"\nRelease\nEmperor of Sand was released on March 31, 2017 through record label Reprise. A snippet of \"Sultan's Curse\" was previewed on the band's website on January 25, 2017, and the full track was released on January 27. The album's first single, \"Show Yourself\", was released in February 2017. Its second single, \"Steambreather\", was released in August 2017.\nFollowing the album's release, the band embarked on a tour in the United States from April 14 to May 20, 2017, with support from Eagles of Death Metal and Russian Circles.\nCritical reception\n| rev2 = Consequence of Sound\n| rev2score = B\n| rev3 = Exclaim!\n| rev3score = 8/10\n| rev4 = The Guardian\n| rev4Score =\n| rev5 = NME\n| rev5score = (4/5)\n| rev6 = Pitchfork\n| rev6score = 7.6/10\n| rev7 = PopMatters\n| rev7score =\n| rev8 = Rock Sound\n| rev8score = 8/10\n| rev9 = Rolling Stone\n| rev9score =\n| rev10 = Sputnikmusic\n| rev10score = 4.5/5\n}}\nEmperor of Sand was well-received by contemporary music critics upon its initial release. At Metacritic, which assigns a normalized rating out of 100 to reviews from mainstream publications, the album received an average score of 78, based on 24 reviews, indicating \"generally favorable reviews\".\nAmongst the more positive articles was Calum Slingerland's review for Exclaim!. In it, Slingerland stated that \"Drawing as much from their past as well as their present, Mastodon refuse to go extinct just shy of two decades of music-making. Emperor of Sand is at once emotionally powerful and musically arresting.\" Anita Bhagwandas was also highly positive in a four-star review for NME, saying \"Metal needed this album. It needed a record that's doomy, heavy and magnificently multilayered, and Mastodon's seventh album is exactly that.\" Reviewing that album for Consequence of Sound, Katherine Turman wrote \"From the incendiary solos of 'Word to the Wise' to the evocatively personal/universal lyrics ('The throne of maladies/It's right in front of me/Your malignancy'), Emperor of Sand proves cathartic for the listener and, hopefully, for the band members as well.\" Rob Sayce wrote the review for Rock Sound suggesting that \"Few bands out there twist metal into such bewildering, bewitching shapes, and – somehow – there’s little sign of their well running dry.\"\nIn the review for AllMusic, critic Thom Jurek was more critical of the album, claiming \"Emperor of Sand is not perfect; it doesn't attain the glories of the first trilogy. That said, it's easily on par with The Hunter and stronger than ''Once More 'Round the Sun'', while being more diverse than any record they've cut. Arguments about quality should go beyond the aesthetics to embody process and honesty, which are what ultimately matters. In order to be true to themselves, Mastodon had to make Emperor of Sand at this time. There was no other option. As such, its urgency, sophistication, and emotional heft make it a necessary entry in their catalog.\" Jordan Blum of PopMatters similarly concluded that \"Emperor of Sand is by no means a bad album, but there's little here that the band hasn't already explored.\" Contributor Saby Reyes-Kulkarni wrote the review for Pitchfork declaring \"Mastodon haven't gone past the point of no return in pursuit of accessibility. If anything, Emperor of Sand proves the opposite. Musicians often rationalize losing their edge by talking about 'maturity'. Mastodon can now feel free to use the word without lying to their fanbase.\"}}\n|-\n!scope=\"row\"|Loudwire\n| 25 Best Metal Albums of 2017\n| }}\n|-\n!scope=\"row\"|Metal Hammer\n| 100 Best Metal Albums of 2017\n| }}\n|-\n!scope=\"row\"|Revolver\n| 20 Best Albums of 2017\n| }}\n|-\n!scope=\"row\"|Rolling Stone\n| 20 Best Metal Albums of 2017\n| }}\n|}\nIn 2018, the first track of the album, \"Sultan's Curse\", won the Grammy Award for Best Metal Performance. The album was nominated for Best Rock Album, but lost to The War on Drugs' A Deeper Understanding.\nDecade-end rankings\n{| class=\"wikitable sortable plainrowheaders\"\n!Publication\n!Accolade\n!Rank\n|-\n!scope=\"row\"|Louder Sound\n| The 50 Best Metal Albums of the 2010s\n| }}\n|-\n!scope=\"row\"|Loudwire\n| The 66 Best Metal Albums of the Decade\n| }}\n|}\nCommercial performance\nThe album sold around 43,000 copies in the United States in its first week of release, debuting at No. 7 on the Billboard 200, making it the band's best selling album, as Crack the Skye debuted at number 11 with 41,000 copies in its first week.\nTrack listing\nPersonnel\nMastodon\n* Brann Dailor – drums, percussion, vocals, keyboards, bass on \"Jaguar God\" Intro\n* Brent Hinds – lead guitar, vocals\n* Bill Kelliher – rhythm guitar, synth guitar on \"Clandestiny\"\n* Troy Sanders – bass, vocals, bass pedals on \"Roots Remain\", \"Ancient Kingdom\" and \"Jaguar God\"\nGuest musicians\n* Scott Kelly – vocals on \"Scorpion Breath\"\n* Kevin Sharp – vocals on \"Andromeda\"\n* Mike Keneally – keyboards on \"Jaguar God\"\nProduction\n* Brendan O'Brien – production, mixing\n* Tom Syrowski – mixing, recording\n* Tom Tapley – recording\n* T.J. Elias – second engineer\n* Bryan Dimaio – second engineer\n* Billy Joe Bowers – mastering, editing\n* Ivy Skoff – production coordination\nArtwork\n* Brann Dailor – art direction\n* Alan \"Medusawolf\" Brown – illustration artwork\n* Donny Phillips – album design for KIHL Studio\nManagerial\n* Nick John – management for The Rick Sales Entertainment Group\n* Erine Gonzalez – management assistance\n* Joe Serling – legal for Serling Rooks Hunter McKoy & Worab, LLP\n* Robert Polay – business management for Polay Financial Management\n* Scott Sokol – North American booking agent for Pinnacle Entertainment\n* John Jackson – international booking agent for K2 Agency\n* Ken Livitan – Brendan O'Brien Management for Vector Management\n* Mike Elizondo – A&R\n* Xavier Ramos – marketing\n* Damian Elahi – business affairs for Reprise Records\nCharts\nWeekly charts\n{| class=\"wikitable sortable plainrowheaders\" style=\"text-align:center\"\n|-\n! scope=\"col\"| Chart (2017)\n! scope=\"col\"| Peak position\n|-\n|-\n|-\n|-\n|-\n|-\n|-\n|-\n|-\n|-\n|-\n|-\n|-\n|-\n|-\n|-\n|-\n|-\n|-\n|-\n|-\n|-\n|-\n!scope=\"row\"|US Top Alternative Albums (Billboard)\n|align=\"center\"|1\n|-\n|-\n!scope=\"row\"|US Top Hard Rock Albums (Billboard)\n|align=\"center\"|1\n|-\n!scope=\"row\"|US Top Tastemakers (Billboard)\n|align=\"center\"|1\n|}\nYear-end charts\n{| class=\"wikitable sortable plainrowheaders\" style=\"text-align:center\"\n|-\n! scope=\"col\"| Chart (2017)\n! scope=\"col\"| Position\n|-\n! scope=\"row\"| Belgian Albums (Ultratop Flanders)\n| 177\n|-\n! scope=\"row\"| US Top Rock Albums (Billboard)\n| 75\n|}\nReferences\n}}"
    }
  ]
}