{
  "content": [
    {
      "type": "text",
      "text": "# Emperor Yūryaku__disambig_1\n\n}}\n| succession     = Emperor of Japan\n| image          = Tennō Yūryaku detail.jpg\n| caption        = Woodblock print of Yūryaku hunting Wild Boars by Adachi Ginkō, 1896\n| reign          = 456 – 479 (traditional)\n| coronation     =\n| predecessor    = Ankō\n| successor      = Seinei\n| posthumous name = Chinese-style shigō:Emperor Yūryaku ()Japanese-style shigō:Ōhatsuse Wakatakeru no Mikoto ()\n| spouse         = Kusaka-no-hatabihime\n| issue          = Emperor Seinei\n| issue-link     = #Consorts and children\n| issue-pipe     = among others...\n| royal house    = Imperial House of Japan\n| father         = Emperor Ingyō\n| mother         = Oshisaka no Ōnakatsuhime\n| birth_date     = 417–418}}\n| birth_place    =\n| death_date     = 479 (aged 61–62) This age differs from the Kojiki which gives an \"advanced age\" of 124. Edmond Papinot gives an age of 62 for Yūryaku which matches the \"417\" birth year given by other sources.}}\n| death_place    = Hatsuse no Asakura Palace\n| burial_place   =  (Habikino, Osaka)\n|}}\n(417/18 – 479) was the 21st Emperor of Japan, according to the traditional order of succession. According to the Kojiki, this Emperor is said to have ruled from the Thirteenth Day of the Eleventh Month of 456 (Heishin) until his death on the Seventh Day of the Eight Month of 479 (Kibi). He is the first archaeologically verifiable Japanese emperor.\nProtohistoric narrative\nThe Japanese have traditionally accepted this sovereign's historical existence, and a mausoleum (misasagi) for Yūryaku is currently maintained. The following information available is taken from the pseudo-historical Kojiki and Nihon Shoki, which are collectively known as  or Japanese chronicles. These chronicles include legends and myths, as well as potential historical facts that have since been exaggerated and/or distorted over time. It is recorded in the Kiki that Yūryaku was born to  sometime in 417 or 418 AD, and was given the name |大泊瀬稚武皇子}}. As the fifth and youngest son of Emperor Ingyō he was never given the title of \"Crown Prince\" due to his two older living brothers.\nAscension\nŌhatsuse was thrown into a fit of rage when he learned that his brother Emperor Ankō was assassinated in 456 AD.}} which prompted Ōhatsuse to kill them both individually with a sword. He then turned his rage towards the boy assassin  (Prince Mayowa), and his other brother Kurohiko by burning him to death. This just left Emperor Richū's eldest son Prince Ichinobe no Oshiwa in contention for the throne.\nŌhatsuse was resentful that Ankō had formally wished to transfer the kingdom to Ichinobe. Both the Nihon Shoki and Kojiki describe how Ōhatsuse took Prince Ichinobe and his younger brother Prince Mima out hunting and \"treacherously\" killed them. The sons of Prince Ichinobe fled to Harima and went into hiding, later becoming Emperor Kenzō and Emperor Ninken. Ōhatsuse (later known as Emperor Yūryaku) was then enthroned sometime afterwards in November 456. The new emperor subsequently made Asakura no Miya at Sakurai, Nara the location of his imperial palace. Emperor Richū's widow Kusaka no Hatabi no hime was appointed Empress with three concubines in March 457.\nReign\nAccording to the Kiki, Emperor Yūryaku's reign was full of tyranny and cruelty. He allegedly ordered a girl to \"have her four limbs stretched on a tree and be roasted to death\" due to misplaced affection. Another account states that he killed one of his servants during a hunt because his servant did not understand how to cut up animal meat. Yūryaku also allegedly removed a high official to a distant post so he could help himself to the man's wife. The Emperor arbitrary and capriciously killed so many men and women that he was referred to as Emperor of Great Wickedness by the public. However, it is noted that Yūryaku improved his behavior after being admonished by the empress. On a more positive side, Yūryaku greatly encouraged agriculture during his reign and had his consort plant mulberry trees and cultivate silkworms. The Emperor was also known as a poet, and someone who enjoyed arts and crafts as expert handicraftsmen were commissioned from Baekje (Korea). While the Empress herself never bore Yūryaku any children, he had three sons and two daughters with his concubines.\nIn the 22nd year of his reign (477 AD) Yūryaku moved a shrine dedicated to Toyouke-hime from Tanba to Ise (modern day Ise, Mie). This newly founded shrine named  is now a part of the Ise Shrine complex. According to \"\" (written in 884 AD), the goddess Toyouke originally came from Tamba. It records that Emperor Yūryaku was told by Amaterasu in his dream that she alone was not able to supply enough food, so that Yūryaku needed to bring , or the goddess of divine meals, from Hijino Manai in ancient Tanba Province.\nYūryaku appointed his son  as heir apparent in 478 AD before dying in the following year. The Nihon Shoki mentions that Yūryaku lived to be 104, while the Kojiki gives his age as 124. His son Shiraka was later enthroned as Emperor Seinei in 480 AD.\nFolklore\nIn Shinto folklore, events during Yūryaku's reign include meeting the Kami \"Hitokotonushi\" while hunting on Mount Katsuraki in 460 AD. The Kami appeared to him as a tall man whose face and demeanor resembled the Emperor's. After introductions Hitokotonushi joined Yūryaku as the two hunted deer until sunset. He then escorted the Emperor \"as far as the waters of Kume.\" Another encounter with a Kami occurred in 463 AD through an invitation to the thunder god of  to the Imperial Palace. The Emperor sent his royal messenger Chiisakobe no muraji Sugaru, who carried a halberd with a red banner that symbolized his authority. Sugaru enlisted the help of priests to enshrine the kami into a portable carriage, to be brought in the Emperor's presence, as a great serpent. Things took a turn for the worse as Yūryaku had neglected beforehand to practice proper ritual purification and religious abstinence. The thunder kami showed his displeasure through a thundering menacing appearance which caused the Emperor to flee into the interior of his palace. The great serpent was returned to Mimuro, and the Emperor made many offerings to appease the angry deity.\nHistorical assessment\nYūryaku is regarded by historians as a ruler during the 5th century whose existence is generally accepted as fact. Scholar Francis Brinkley lists Emperor Yūryaku under \"Protohistoric sovereigns\" where he remarks that while some historians have described him as an \"austere\" man, \"few readers of his annals will be disposed to endure such a lenient verdict.\" He also added that the year 475 AD marks the first \"absolute agreement between the dates given in Japanese history and those given in Korean…“ This in turn has caused critics to admit the trustworthiness of Japanese history in the late 5th century. Scottish Orientalist scholar and journalist James Murdoch regards Yūryaku as a \"much maligned person who was a strong if somewhat ferocious ruler.\" British academic and author Richard Ponsonby-Fane noted that the Emperor is described as a \"mighty hunter\", as it is recorded that the God \"Hitokotonushi\" accompanied him in the chase.\nThe Emperor's interest in poetry is amongst the more well-documented aspects of his character and reign. Poems attributed to him are included in the ''Man'yōshū, and a number of his verses are preserved in the Kojiki and the Nihonshoki. Archaeological research has also confirmed that large keyhole-shaped tombs belonging to the chiefs of local ruling families disappeared from around the end of the 5th century when Yūryaku reigned.\nA modern-day cognitive analysis, \"as deciphered in the Nihon shoki\", was conducted in 2024 by the National Institute of Japanese Literature. In this analysis, Emperor Yūryaku was included as an example of \"impulsive murder and the tendency to become enraged.\" Factors such as \"the disproportion between the triggering events\", \"the violence expressed by the emperor on such occasions (quite extreme in degree)\", and the \"frequent occurrence of such descriptions\" were then considered for a conclusion. It is suggested that Emperor Yūryaku may have had an \"intermittent explosive disorder, a type of Impulse-control disorder.\"}} (&nbsp;– 571 AD) is the first for which contemporary historiography has been able to assign verifiable dates. The conventionally accepted names and dates of the early Emperors were not confirmed as \"traditional\" until the reign of Emperor Kanmu between 737 and 806 AD.\nGreat King of Yamato\n]]\nDuring this moment in history, the calendar system of the Nihon Shoki changes from before and after Yūryaku's reign. As his name is mentioned at the beginning of the Man'yōshū and Nihon Ryōiki, this is seen as a historical turning point. Previously the Japanese archipelago had been a confederation of powerful ruling families from various regions. This appeared to have  changed with the appearance of Emperor Yuryaku as the autocratic rule of the Great King was established and a centralized system centered on the Great King began. This is further supported by a major discovery that occurred in 1968 when the iron Inariyama burial-mound sword was extracted from a tomb. In 1978, X-ray analysis revealed a gold-inlaid inscription that comprises at least 115 Chinese characters. The given year on the sword is denoted as \"xin-hai\" (\"Year of the Metal Pig\") according to the Chinese sexagenary cycle, in which the name of the year is recycled every 60 years. While this year is generally regarded in Japan to correspond to 471 AD, at least one historian suggests that 531 is a more likely date.\nThe person buried in the tomb is given the name \"Wowake\", who was thought to be an influential warrior in the region. King Waka Takiru in the transcription is thought to be the same person as Ōhatsuse-wakatakeru-no-mikoto as mentioned in the Nihon Shoki, an alias of Emperor Yūryaku. As each inscription contains the name of an official position, this suggests that a system similar to the Bemin was already in place. While the Eta Funayama Sword also apparently mentions the name \"Waka Takiru\", many characters on that sword are illegible possibly due to polishing by a Japanese sword sharpener at the end of the Taisho period. If Yūryaku's name can be corroborated to this sword then it can be interpreted that the power of the Great King had already extended from Kyushu to Togoku by the latter half of the 5th century.\nThere is no evidence to suggest that the title tennō (meaning \"emperor\") was used during the time to which Yūryaku's reign has been assigned. Instead, his title could have possibly been , meaning \"the great king who rules all under heaven\", or  \"Great King of Yamato\". The name Yūryaku-tennō was more than likely assigned to him posthumously by later generations. His name might have been regularized centuries after the lifetime ascribed to Yūryaku, possibly during the time in which legends about the origins of the imperial dynasty were compiled as the chronicles known today as the Kojiki.\nKing Bu\nIt's theorized that Emperor Yūryaku may be synonymous with King Bu (武) as written in the Chinese records. According to the Book of Song, Bu dispatched envoys to Emperor Shun of Song (a Southern Chinese dynasty) in both 477 and 478 AD. The first envoy was to inform the Chinese emperor that King Kō (Emperor Ankō) had died, and his older brother had become king. It is written that he called himself \"King of Wa\", and the military commander of several different Kingdoms. Its written that in the following year Emperor Shun appointed Bu the title of Grand Peacekeeper-General of the East. The full context of this latter passage describes how Bu's ancestors conquered countries, and expanded their power to the east and west. It describes how they crossed the sea to the north and reached the southern part of the Korean Peninsula. Although the kings of Wa repeatedly requested that the Emperors of the Song dynasty recognize their military control over Baekje, their efforts were denied. The reason for this is thought to be that the Song dynasty placed importance on Baekje, which was located in a strategically important area. By not offering recognition the Song Emperors could put the Northern Wei in check, and avoid opposition from Goguryeo which was in conflict with Wa. Scholar Francis Brinkley notes that the power of the Koma clan (supported by the Liu Song dynasty) in Goguryeo increased steadily during this time. Brinkley suggests that Emperor Yūryaku's attempts to establish close relations with the Chinese Emperor seem to be from a desire to isolate Korea, which ended in failure.\nThe other two recorded instances regarding King Bu are mentioned in the books of Qi, and Liang. As compared to the former mention in 478 AD, these are not considered to be reliable. Japanese historian Mori Kimiaki points out that both of these appointments coincide with the founding year of their respective dynasties. This is thought to be an administrative matter, and it is not clear whether King Bu (Yūryaku) himself requested it or not. There is at least one theory that supports the envoy being sent to Southern Qi in 479 as being factual. This is solely based on the description in the title of  included in . The fourth and final appointment allegedly made by King Bu (Yūryaku) falls outside of his recorded lifetime. As the Kiki states that Emperor Yūryaku died in 479, the last given year of 502 AD would be implausible.\nGravesite\nWhile the actual site of Yūryaku's grave is not known, this regent is traditionally venerated at a memorial Shinto shrine (misasagi) in Habikino, Osaka. As designated by the Imperial Household Agency as Yūryaku's mausoleum, its formal name is Tajihi no Takawashi-no-hara no misasagi. Aside from this shrine in Osaka, there is another burial site named  where Yūryaku is a possible burial candidate. Those in doubt of this theory, though, point to the construction style of the Kofun which may have begun several decades after Emperor Yūryaku's death. This has led some researchers to add Emperor Ankan as a burial candidate for the Kofun. Yūryaku is also enshrined at the Imperial Palace along with other emperors and members of the Imperial Family at the Three Palace Sanctuaries. He is additionally deified at the  in Gose, Nara.\nConsorts and children\nSpouse/Concubine\n{| class=\"wikitable\"\n|-\n! Position || Name || Father || Issue\n|-\n| Empress(Kōgō)\n| }}|草香幡梭姫皇女}}\n| Emperor Nintoku\n| align=\"center\"| None\n|-\n| Consort(Hi)\n|\n| Katsuragi no Tsubura no Ōmi\n|\n|-\n| Consort(Hi)\n|\n| Kibi no Kamitsumichi no Ōmi\n|\n|-\n| Consort(Hi)\n|\n| Kasuga no Wani no Ōmi Fukame\n|\n|}\nIssue\n{| class=\"wikitable\"\n|-\n! Status || Name || Comments\n|-\n| Prince\n|\n| Shiraka became the next Emperor (Seinei).\n|-\n| Princess\n|\n| Also known as \"Waka-tarashi-hime\", she \"attended to the sacrifices of the Great Deity of Ise\" (Amaterasu). Taku was also a Saiō princess and died sometime in 459 AD.\n|-\n| Prince\n|\n| Iwaki died sometime between 479 and 481 AD.\n|-\n| Prince\n|\n| Wakamiya died sometime in 479 AD.\n|-\n| Princess\n|\n| Ōiratsume was later married to Emperor Ninken.\n|}\nSee also\n* Emperor of Japan\n* List of Emperors of Japan\n* Imperial cult\nNotes\nReferences\nFurther reading\n* Aston, William George. (1896). [https://books.google.com/books?id=_oEfAAAAYAAJ  Nihongi: Chronicles of Japan from the Earliest Times to A.D. 697.] London: Kegan Paul, Trench, Trubner.\n* Batten, Bruce Loyd. (2006). [https://books.google.com/books?id=vaSzIi_HQlsC&q=Gateway+to+Japan   Gateway to Japan: Hakata in war and peace, 500–1300.] Honolulu:University of Hawaii Press. ; ;   OCLC\t254764602]\n* Brown, Delmer M. and Ichirō Ishida, eds. (1979). [https://books.google.com/books?id=w4f5FrmIJKIC&q=Gukansho  Gukanshō: The Future and the Past.] Berkeley: University of California Press. ;\n* Nippon Gakujutsu Shinkokai (1969). The Manyōshū: The Nippon Gakujutsu Shinkokai Translation of One Thousand Poems. New York: Columbia University Press.\n* Ponsonby-Fane, Richard Arthur Brabazon. (1959). [https://books.google.com/books?id=SLAeAAAAMAAJ&q=The+Imperial+House+of+Japan  The Imperial House of Japan.] Kyoto: Ponsonby Memorial Society.\n* Titsingh, Isaac. (1834). Nihon Ōdai Ichiran; ou, [https://books.google.com/books?id=18oNAAAAIAAJ&q=nipon+o+dai+itsi+ran  Annales des empereurs du Japon.]  Paris: Royal Asiatic Society, Oriental Translation Fund of Great Britain and Ireland.\n* Varley, H. Paul. (1980). [https://books.google.com/books?id=tVv6OAAACAAJ  Jinnō Shōtōki: A Chronicle of Gods and Sovereigns.] New York: Columbia University Press. ;\nExternal links\n*[https://web.archive.org/web/20080618090904/http://nihonshoki.wikidot.com/ Nihon Shoki] Online English Translations. [https://web.archive.org/web/20110823073040/http://nihonshoki.wikidot.com/scroll-14-yuryaku Scroll 14 - Emperor Yuryaku]"
    }
  ]
}