{
  "content": [
    {
      "type": "text",
      "text": "# Emperor Huai of Jin__disambig_1\n\n|full name=Family name: Sima (司馬; sī mǎ)Given name: Chi (熾, chì)\n|posthumous name=Full: Xiaohuai (孝懷, xiào huái)literary meaning \"Filial and missed\"Short: Huai (懷, huái)literary meaning \"Missed\"\n|birth_date=284\n|death_date=\n|image=Harvard drs 49802792 繡像三國演義續編 v.1 (晉懷帝).jpg\n|succession = Emperor of the Jin dynasty\n|reign= 11 January 307 – 14 March 313\n|predecessor= Emperor Hui of Jin\n|successor=Emperor Min of Jin\n|succession1 = Crown Prince of the Jin Dynasty\n|reign1 = 4 February 305 – January 307\n|predecessor1 = Sima Ying\n|successor1 = Sima Quan\n|reign-type1 = Tenure\n|father=Emperor Wu\n|mother=Lady Wang Yuanji\n}}\nEmperor Huai of Jin (; 284 – March 14, 313), personal name Sima Chi (司馬熾), courtesy name Fengdu (豐度), was an emperor of the Jin dynasty.\nEmperor Huai was captured in July 311 (Disaster of Yongjia) and later executed in 313 under the order of Liu Cong, ruler of the Xiongnu state of Han-Zhao.\nAs Prince of Yuzhang and crown prince\nSima Chi was one of the youngest sons of Sima Yan, the founding emperor of Jin, by his concubine Consort Wang Yuanji (王媛姬). Just prior to Emperor Wu's death in May 290, Prince Chi was created the Prince of Yuzhang on 22 December 289.  During the early stages of the War of the Eight Princes during the reign of his developmentally disabled half-brother Sima Zhong, unlike the other princes fighting for power, Prince Chi did not involve himself in political or military matters, but spent his time studying history instead.\nIn late 304, when Emperor Hui was forcibly taken from the capital Luoyang to Chang'an, then under the control of the regent Sima Yong Prince of Hejian, Prince Chi was forced to accompany the emperor.  In February 305, when his more ambitious half-brother Sima Ying the crown prince was demoted back to Prince of Chengdu by Sima Yong, Prince Chi was created crown prince to replace him.  He was initially going to decline the honor, believing that his nephew Sima Tan the Prince of Qinghe and one-time crown prince should be returned to that position, but was persuaded to accept by his associate Xiu Su ().  Later, after Sima Yue the Prince of Donghai defeated Sima Yong in 306, Crown Prince Chi accompanied Emperor Hui and returned to Luoyang.\nIn January 307, Emperor Hui was poisoned.  (Most historians believe that Sima Yue ordered the murder, but there is no conclusive evidence.)  Emperor Hui's wife, Yang Xianrong, believing that she would not be honored as empress dowager if her brother-in-law inherited the throne, tried to have Sima Tan declared emperor; she was rebuffed by Sima Yue, however, and Crown Prince Chi succeeded to the throne as Emperor Huai.  Emperor Huai honored her with the title \"Empress Hui,\" but not empress dowager.  He created his wife Crown Princess Liang Lanbi empress.\nReign\nEmperor Huai was commonly regarded as an intelligent man, and he tried to institute reforms that he felt would allow the empire to recover from the ravages of the War of the Eight Princes and the subsequent Wu Hu and agrarian uprisings.  However, Sima Yue maintained a tight grip on power and would not allow the emperor to exercise much actual authority.\nOn 8 May 307, Emperor Huai created Sima Tan's brother (and therefore fellow son of Emperor Huai's half-brother Sima Xia () the Prince of Qinghe) Sima Quan () crown prince.  (His apparent conclusion, at the young age of 23, that he should make a nephew his heir, may indicate that he considered himself infertile.)\nIn spring 307, Sima Yue left Luoyang and set up headquarters at Xuchang (許昌, in modern Xuchang, Henan), but continued to control the government remotely.  In 309, Sima Yue, concerned about Emperor Huai's increasing exercise of authority, made a sudden return to Luoyang and arrested and executed a number of Emperor Huai's associates, including Emperor Huai's uncle Wang Yan (). Other than privately mourning them, there was nothing that Emperor Huai could do. Sima Yue further disbanded the imperial guards and put his own personal forces in charge of protecting the emperor.\nFor all of Sima Yue's assertion of authority, he could not stop Han, under its generals Liu Cong the Prince of Chu (the son of Han's emperor Liu Yuan), Liu Yao the Prince of Shi'an (Liu Yuan's nephew), Wang Mi (), and Shi Le (), from disrupting Jin rule throughout northern and central China and gradually wearing out Jin forces and capturing Jin cities and towns.  In late 309, he managed to fight off a joint attack by Liu Cong and Wang on Luoyang, but that victory was the exception to Han's inexorable advances.  After Liu Yuan died in 310 and was succeeded by Liu Cong, Han renewed its attacks on the Luoyang region.  Meanwhile, Sima Yue continued to alienate other generals and officials, and when Liu Kun (), the military commander of Bing (并州, roughly modern Shanxi) proposed to him the plan of an attack on the Han capital Pingyang (平陽, in modern Linfen, Shanxi) in conjunction with the powerful Xianbei chieftain Tuoba Yilu () the Duke of Dai, Sima Yue was fearful of a backstabbing attack by some of these warlords and therefore did not accept Liu's plan.  Indeed, when Emperor Huai and Sima Yue sent out calls for the various governors to come to Luoyang's aid later that year, there were few responses.  Sima Yue became uncertain of himself, and late in 310 left Luoyang with virtually all of the central government's remaining troops, along with a large number of officials, effectively stripping Luoyang and Emperor Huai bare of their defenses, except for a small detachment commanded by Sima Yue's subordinate He Lun (), intended as much to monitor as to protect Emperor Huai.  From that point on, Luoyang was left even without a police force and became largely a city abandoned to bandits and thugs.\nEmperor Huai soon entered into a plan with Gou Xi (苟晞), the military commander of Qing Province (青州, modern central and eastern Shandong), who had been dissatisfied with Sima Yue, to overthrow Sima Yue's yoke.  Sima Yue discovered this plan, but was unable to wage a campaign against Gou.  He grew ill in his anger and distress, and died in April 311. The generals and officials in his army, instead of returning to Luoyang, headed east toward Sima Yue's principality of Donghai (roughly modern Linyi, Shandong) to bury him there.  He Lun, upon hearing about Sima Yue's death, also withdrew from Luoyang and sought to join that force.  However, both were intercepted by Shi Le and wiped out.  Shi, declaring that Sima Yue had caused the empire much damage, burned Sima Yue's body.  Sima Yue's sons were all captured and presumably killed by Shi.\nSima Yue's death, however, only left Emperor Huai even more vulnerable to Han attacks.  Gou sent a force to welcome Emperor Huai to move the capital to Cangyuan (倉垣, in modern Kaifeng, Henan), and Emperor Huai was going to do so, but his officials all still missed Luoyang and did not want to leave.  Soon, however, the famine that had already overtaken Luoyang got even more severe.  Emperor Huai resolved to head for Cangyuan, but with Gou's force having already left Luoyang, was unable to even leave the palace without being attacked by bandits, and therefore was forced to return to the palace.  In summer 311, knowing that Luoyang was defenseless, the Han generals Liu Yao, Wang Mi, Shi Le, and Huyan Yan converged on Luoyang, and they easily captured Emperor Huai on 13 July, in what is known as the Disaster of Yongjia. A large number of Jin nobility was slaughtered, although Emperor Huai was, for the time being, spared and delivered to the Han capital Pingyang, to be presented to the emperor Liu Cong.  Liu Cong created Emperor Huai the Duke of Ping'e.\nAfter capture by Han\nFor one and a half years, the former Jin emperor lived a humiliating existence in the Han capital.  In 312, Liu Cong promoted him to the title of the Duke of Kuaiji.  Once, after inviting the duke to a feast, Liu Cong commented on a meeting they had while the former emperor was still the Prince of Yuzhang, leading to a notable colloquy.  Liu Cong first stated,\n:When you were the Prince of Yuzhang, I had once visited you with Wang Ji (王濟).  Wang praised me, and you said, \"I have long heard of your fame.\"  You showed me the music that you had written, and then asked me and Wang to write lyrics for them. We wrote lyrics praising you, and you liked them.  Then, we spent some time shooting arrows; I hit the target 12 times, and both you and Wang hit nine times.  You gave me gifts of a mulberry bow and a silver inkstone.  Do you still remember?\nThe duke responded, \"How can I forget?  What I regret is not realizing that I was in the presence of a dragon.\"  Liu Cong, impressed by the flattery, then asked, \"How is it that your clan members slaughtered each other?\"  The duke replied:\n:This is not a human matter, but was the will of Heaven.  The great Han was going to receive divine favor, so our clan eliminated itself for Han.  If our clan members could follow the directives of Emperor Wu and remain united, how could Your Imperial Majesty become emperor?\nLiu Cong was impressed, and they spent all night talking.  The next day, Liu Cong gave one of his favorite concubines to the duke as a gift, creating her as the Duchess of Kuaiji.\nIn 313, however, the former emperor would suffer his death.  At the imperial new year celebration, Liu Cong ordered him to serve the high level officials wine, and former Jin officials Yu Min () and Wang Juan () could not control their emotions at seeing his humiliation, and cried out loudly. This made Liu Cong angry, and he falsely accused Yu and Wang, along with a number of former Jin officials, of being ready to betray Pingyang and offer it to the Jin general Liu Kun. He then executed those former Jin officials and poisoned the former emperor.\nEra name\n*Yongjia (永嘉 Yǒngjiā) 307–313\nConsorts\n* Empress, of the Liang clan of Anding (), personal name Lanbi ()\n* Lady, of the Liu clan ()\nAncestry\nReferences\n* Fang, Xuanling. Book of Jin (Jin Shu)."
    }
  ]
}