{
  "content": [
    {
      "type": "text",
      "text": "# Emperor Xian of Han__disambig_1\n\n}}\n| image = File:Emperor Xian Qing illustration.jpg\n| caption = A Qing dynasty illustration of Emperor Xian\n| birth_date = 2 April 181\n| birth_place = Luoyang, Eastern Han\n| death_date =\n| death_place = Henei Commandery, Cao Wei\n| full name = Family name: Liu (劉)Given name: Xie (協)Courtesy name: Bohe (伯和)\n| succession = Emperor of the Han dynasty\n| reign = 28 September 189 – 11 December 220\n| predecessor = Emperor Shao\n| regent =\n| succession1 = Duke of Shanyang (山陽公)\n| reign1 = 13 December 220 – 21 April 234\n| reign-type1 = Tenure\n| successor1 = Liu Kang\n| succession2 = Prince of Bohai (渤海王)\n| reign2 = 189\n| reign-type2 = Tenure\n| succession3 = Prince of Chenliu (陳留王)\n| reign3 = 189\n| reign-type3 = Tenure\n| house = Liu\n| dynasty = Han (Eastern Han)\n| posthumous name = Emperor Xiaoxian (孝獻皇帝) (conferred by Cao Wei)Emperor Xiaomin (孝愍皇帝) (conferred by Shu Han)\n| father = Emperor Ling\n| mother = Empress Linghuai\n| spouse = Empress FuConsort DongEmpress XianmuConsort Cao (Xian)Consort Cao (Hua)Consort Song\n| spouse-type = Consorts\n| issue = unnamed eldest sonLiu Feng, Prince of NanyangLiu Xi, Prince of JiyinLiu Yi, Prince of ShanyangLiu Mao, Prince of JibeiLiu Dun, Prince of Donghaitwo other sonstwo other daughtersPrincess Changle\n}}\nEmperor Xian of Han (2 April 181 – 21 April 234), personal name Liu Xie (劉協), courtesy name Bohe, was the 14th and last emperor of the Eastern Han dynasty of China. He reigned from 28 September 189 until his abdication and subsequent end of the dynasty on 11 December 220.\nLiu Xie was a son of Liu Hong (Emperor Ling) and was a younger half-brother of his predecessor, Liu Bian (Emperor Shao). In 189, at the age of eight, he became emperor after the warlord Dong Zhuo, who had seized control of the Han central government, deposed Emperor Shao and replaced him with Liu Xie. The newly enthroned Liu Xie, historically known as Emperor Xian, was in fact a puppet ruler under Dong Zhuo's control. In 190, when a coalition of regional warlords launched a punitive campaign against Dong Zhuo in the name of freeing Emperor Xian, Dong Zhuo ordered the destruction of the imperial capital, Luoyang, and forcefully relocated the imperial capital along with its residents to Chang'an. After Dong Zhuo's assassination in 192, Emperor Xian fell under the control of Li Jue and Guo Si, two former subordinates of Dong Zhuo. The various regional warlords formally acknowledged Emperor Xian's legitimacy but never took action to save him from being held hostage.\nIn 195, Emperor Xian managed to escape from Chang'an and return to the ruins of Luoyang during a feud between Li Jue and Guo Si, where he soon became stranded. A year later, the warlord Cao Cao led his forces into Luoyang, received Emperor Xian, took him under his protection, and escorted him to Xu, where the new imperial capital was established. Although Cao Cao paid nominal allegiance to Emperor Xian, he was actually the de facto head of the central government. He skillfully used Emperor Xian as a \"trump card\" to bolster his legitimacy when he attacked and eliminated rival warlords in his quest to reunify the Han Empire under the central government's rule. Cao Cao's success seemed inevitable until the winter of 208–209, when he lost the decisive Battle of Red Cliffs against the southern warlords Sun Quan and Liu Bei. The battle paved the way for the subsequent emergence of the Three Kingdoms of Wei, Shu, and Wu.\nIn late 220, some months after Cao Cao's death, Cao Cao's successor, Cao Pi, forced Emperor Xian to abdicate the throne to him. He then established the state of Cao Wei with himself as the new emperor – an event marking the formal end of the Han dynasty and the beginning of the Three Kingdoms period in China. The dethroned Emperor Xian received the noble title Duke of Shanyang () from Cao Pi and spent the rest of his life in comfort and enjoyed preferential treatment. He died on 21 April 234, about 14 years after the fall of the Han dynasty.\nFamily background\nLiu Xie was born in 181 to Emperor Ling and his Consort Wang Rong (王荣). During her pregnancy, Consort Wang, fearful of Emperor Ling's Empress He, had taken drugs that were intended to induce an abortion, but was not successful in her attempt. Soon after she gave birth to Liu Xie, the jealous Empress He poisoned her by putting poison in her food. Emperor Ling was enraged and wanted to depose her, but the eunuchs pleaded on her behalf, and she was not deposed. Liu Xie was raised personally by Emperor Ling's mother Empress Dowager Dong and known by the circumspect title \"Marquis Dong\". (This is due to superstition; Emperor Ling had lost a number of sons previously, and therefore both Liu Xie and his elder half-brother Liu Bian were known by such titles; Liu Bian, having been raised by Shi Zimiao (), was known as \"Marquis Shi\"). Liu Bian was born of the empress and was older, but Emperor Ling viewed his behaviour as being insufficiently solemn and therefore considered appointing Liu Xie as his crown prince, but hesitated and could not decide.\nWhen Emperor Ling died in 189, an influential eunuch official whom he trusted, Jian Shuo, wanted to first kill Empress He's brother, General-in-Chief He Jin, and then install Liu Xie on the throne, and therefore set up a trap at a meeting he was to have with He Jin. He Jin found out, and preemptively declared Liu Bian the new emperor. Later that year, Emperor Shao granted Liu Xie the title \"Prince of Bohai\" () and later changed his title to \"Prince of Chenliu\" ().\nAccession to the throne and collapse of the Han dynasty\nRise of Dong Zhuo\nAfter Liu Bian became emperor, He Jin became the most powerful official in the imperial court, and he and his advisor Yuan Shao quickly entered into a conspiracy to exterminate the eunuchs. They were, however, rebuffed by Empress Dowager He, and they hatched the plan to secretly order a number of warlords to advance on the capital Luoyang to force Empress Dowager He to agree to their demands. One of these warlords was Dong Zhuo, who saw this as an opportunity to control the central government.\nHe Jin's plan was discovered by the eunuchs, who laid a trap for him and killed him. Yuan Shao then led his forces into the palace and killed the majority of the eunuchs. The remaining eunuchs initially took the young emperor and Liu Xie hostage, but were eventually forced to commit suicide when the battle turned against them. When Dong Zhuo then arrived on scene, he, impressed with his own power and unimpressed with the nervous Emperor Shao, forced the young emperor to yield the throne to Liu Xie (partly because he was raised by Empress Dowager Dong who, while not related to Dong Zhuo, was therefore respected by Dong Zhuo), who then ascended the throne as Emperor Xian. Dong Zhuo then murdered Empress Dowager He and the former Emperor Shao, and became firmly in control of the political scene.\nForced relocation west and the death of Dong Zhuo\n, detail of a mural from the Dahuting Tomb (打虎亭漢墓) of the late Eastern Han dynasty, located in Zhengzhou, Henan.]]\nIn the spring of 190, a number of local officials, loosely forming a coalition led by Yuan Shao, quickly rose up against Dong Zhuo. Even though they still feared Dong Zhuo's military power and did not directly advance on Luoyang, Dong Zhuo was also fearful of their collective strength, and therefore determined to move the capital west to the old Han capital Chang'an, closer to his power base in Liang Province (涼州; covering present-day Gansu). On 9 April 190, he forced Emperor Xian to relocate to Chang'an and set fire to Luoyang, leaving it largely in ruins.\nAfter the revolting coalition collapsed, a number of officials, led by Wang Yun and Lü Bu, assassinated Dong on 22 May 192. For a while, it appeared that the Han regime might return to normal, as Wang Yun quickly established relatively friendly relations with the local officials resisting Dong but by this time acting more as local warlords. However, due to Wang Yun's failure to pacify Dong Zhuo's former subordinates, they rose in revolt and killed Wang.\nReturn to Luoyang's ruins\n, located in Zhengzhou, Henan.]]\nDong Zhuo's former subordinates, led by Li Jue and Guo Si, took Emperor Xian and the imperial court under their control. However, Li Jue and Guo Si did not have serious ambitions, and their incompetence in governance furthered the breakdown of the Han Empire into warlord regimes. In 195, Li Jue and Guo Si had a major fallout, and Li took Emperor Xian hostage while Guo took the officials hostage as they battled. Later in the year, after peace talks between Li Jue and Guo Si, they agreed to allow Emperor Xian to return to Luoyang, but as soon as Emperor Xian departed Chang'an, they regretted their decision and chased him with their troops. While they were never able to capture him, Emperor Xian's court was rendered poor and unable to fend for itself, and once it returned to Luoyang, it lacked even the basic essentials of life. Many officials starved to death. At this time, Yuan Shao's strategist Ju Shou suggested that he welcome Emperor Xian to his base in Ji Province so that he could effectively be in control of the central government, but the other strategists Guo Tu and Chunyu Qiong opposed – under the faulty logic that if he did, he would have to yield to Emperor Xian on key decisions. Yuan Shao listened to Guo Tu and Chunyu Qiong and never again considered welcoming Emperor Xian.\nTight control by Cao Cao\nWhat Yuan Shao would not do, Cao Cao did. Cao Cao was at this time a relatively minor warlord, as the governor of Yan Province (covering present-day western Shandong and eastern Henan), with his headquarters at Xu (present-day Xuchang, Henan). He saw the strategic advantage in having the emperor under his control and protection, and in 196 he marched west to Luoyang and, after securing an agreement with Emperor Xian's generals Dong Cheng and Yang Feng, convincing them of his loyalty, he entered Luoyang and technically shared power with Dong and Yang, but was in fact in command.\nUnlike the situation with Dong Zhuo, though, Cao Cao knew how to assuage the other generals and nobles, and while he gave them little power, he made sure that they remained honoured, so minimal opposition against him developed at the imperial court. He then moved the capital to Xu to affirm his control over the central government, and when Yang Feng opposed him, he defeated Yang in November 196, and was able to move the capital.\nCao Cao then began to issue imperial edicts in Emperor Xian's name – including a harshly-worded edict condemning Yuan Shao for taking over nearby provinces – even though it still bestowed Yuan with the highly honorific post of Grand Commandant. Cao Cao and Emperor Xian maintained a superficially cordial relationship, but this did not prevent two major confrontations involving Cao and other court officials.\nillustration of the historical novel Romance of the Three Kingdoms.]]\nIn early 199, as Cao Cao was facing a major military confrontation against Yuan Shao, Dong Cheng claimed to have received a secret edict issued by Emperor Xian (hidden in a belt), and he entered into a conspiracy with Liu Bei, Zhong Ji () and Wang Fu () to assassinate Cao Cao. Late in 199, Liu Bei started a rebellion and waited for Dong Cheng to act in the capital, but in 200, Dong's conspiracy was discovered, and he, along with Zhong Ji and Wang Fu, were killed. Liu Bei was later defeated by Cao Cao and forced to flee to Yuan Shao's territory. Dong Cheng's daughter, an imperial consort, was pregnant, and Emperor Xian personally tried to intercede for her, but Cao Cao had her executed anyway.\nEmperor Xian's empress, Empress Fu Shou, angry and fearful about how Consort Dong died, wrote her father, Fu Wan (), a letter accusing Cao Cao of cruelty, and implicitly asking her father to start a new conspiracy against Cao. Fu Wan was fearful of Cao Cao and never acted on the letter, which was discovered in 214. Cao Cao was angry and forced Emperor Xian to have Empress Fu deposed. Emperor Xian was hesitant, and Cao Cao sent his soldiers into the palace to put pressure on the emperor. Empress Fu hid inside the walls, but was finally discovered and dragged out. As she was led away, she cried out to Emperor Xian for him to save her life, but his only response was that he could not even know what would happen to him. She was killed, along with her two sons and family on 8 January 215. On 6 March 215,. Cao Cao forced Emperor Xian to instate his daughter Cao Jie, then an imperial consort, as the new empress.\nAbdication and death\nCao Cao died on 15 March 220. His son and successor, Cao Pi, soon forced Emperor Xian to abdicate the throne in favour of himself, ending the Han dynasty. Cao Pi established a new state known as Cao Wei, and he granted Emperor Xian a noble title – Duke of Shanyang (), and gave him a fiefdom of 10 000 households, with Zhuolucheng (浊鹿城) as the capital. Liu Xie was also ranked above vassal princes, didn't have to refer to himself as a subject while speaking to the emperor and didn't have to kneel when receiving edicts. The former Emperor Xian died in April 234 and was buried with honours befitting an emperor, using Han ceremonies, and the then emperor of Wei, Cao Rui, was one of the mourners. As Emperor Xian's crown prince was already dead, his grandson Liu Kang () inherited his dukedom, which lasted for 73 more years and two more dukes, Liu Jin () and Liu Qiu (). The line was exterminated during the Jin dynasty in June or July 307, when rebel forces led by Ji Sang and Shi Le sacked the city of Ye. This practice of an emperor conferring hereditary nobility on his predecessor, from whom he usurped the throne, was known as \"two crownings and three respects\".\nEra names\n*189: Yonghan ()\n*190–193: Chuping ()\n*194–195: Xingping ()\n*196–220: Jian'an ()\n*220: Yankang ()\nConsorts and issue\n* Empress, of the Fu clan (; d. 215), personal name Shou ()\n** Liu Feng, Prince of Nanyang (; d. 9 August 200)\n** Two other sons (d. 215)\n* Empress Xianmu, of the Cao clan (; 197–260), personal name Jie ()\n** Princess Changle (), personal name Man ()\n* Guiren, of the Dong clan (; d. 200)\n**unborn child (d.200)\n* Guiren, of the Cao clan (), personal name Xian ()\n* Guiren, of the Cao clan (), personal name Hua ()\n*Guiren, of the Song clan (宋貴人), personal name Dou (都)\n* Unknown\n** Unnamed eldest son\n** Liu Xi, Prince of Jiyin ()\n** Liu Yi, Prince of Shanyang ()\n** Liu Mao, Prince of Jibei ()\n** Liu Dun, Prince of Donghai ()\n** Two other daughters, both married Cao Pi (187–226)\nSee also\n* Chinese emperors family tree (early)#Han dynasty, Xin dynasty and Shu Han\n* Lists of people of the Three Kingdoms\nReferences\nCitations\nNotes\nSources\n* Chen Shou (280s or 290s). Records of the Three Kingdoms. Pei Songzhi, annotation, 429. Hong Kong: Zhonghua Publishing, 1971. 5 vols. Cited as Sanguozhi.\n*\n*  Cited as Houhanshu.\n*\n}} Cited as Sanguozhi zhu.\n*  }}"
    }
  ]
}