{
  "content": [
    {
      "type": "text",
      "text": "# Empire Earth II\n\n}}\n|genre = Real-time strategy\n|modes = Single-player, multiplayer\n|platforms = Microsoft Windows\n}}\nEmpire Earth II is a real-time strategy video game developed by Mad Doc Software and published by Vivendi Universal Games and their subsidiary Sierra Entertainment on April 26, 2005. It is a sequel to Empire Earth, which was developed by the now-defunct Stainless Steel Studios. The game features 15 epochs, 14 different civilizations and has three playable campaigns: a Korean, German, and American one, as well as several other playable scenarios. The game received a positive reaction, earning a 79% average rating on GameRankings.\nGameplay\nEmpire Earth II has several new gameplay features from the original gameplay of Empire Earth, such as the Picture-in-Picture window, a small window within the game interface which allows the player to control activities such as unit and building construction. The Citizen Manager can be configured to tell a citizen what to do if they have no set task, and the Diplomacy System allows the player to make tributes and manage alliances and wars with other players. The War Planner is another new addition, which is a map of the game that the player can display and use to coordinate attacks with allies. The crown system grants strategic bonuses to players who are first to master an epoch's military, economic, or imperial paths at the cost of losing a faster age progression. Weather, another new feature, changes over time on the map and affects the look of the map and performance of units and, in the case of airplanes in thunderstorms, hit points.\nBesides campaigns and special scenarios, there is also a skirmish mode where the player can play against a computer player. The player can also play against other human players, however, the common EULA clause that each player needs his own copy of the game is actually enforced, even for LAN games. Unlike campaigns or scenarios, the winning conditions never change. There are eight different game modes in skirmish mode, which can also be played in Multiplayer.\nThere are 15 epochs in the game, each representing a part of history. As the player advances through the epochs, new and improved units and structures become available. Some of the epochs in Empire Earth II are identical to their counterparts in the original Empire Earth—one exception is that Empire Earth II does not allow players to expand their empires into space. The epochs are the Stone Age, Copper Age, Bronze Age, Iron Age, Dark Ages, Middle Ages, Renaissance, Imperial Age, Enlightenment Age, Industrial Age, Modern Age, Atomic Age, Digital Age, Genetic Age, Synthetic Age.\nBefore buildings and units can be made or created, resources must be gathered. There are two kinds of resources: the main resources and special resources. The main resources are available in all epochs and they are food, wood, gold, and stone. To collect resources, a citizen (or a band of citizens) is selected, and are directed to a resource. The citizens thus begin harvesting it.\nThe special resources are available in only some epochs. These special resources are tin—available until epoch 6, iron—first available in epoch 4 and is no longer used after epoch 9, saltpeter—first available in epoch 7 and is used until epoch 12, oil—first available in epoch 10, and uranium—first available epoch 13.\nEmpire Earth II has technologies to improve each player's civilization. Technologies are divided into three groups. The first is Military, which provides benefits mostly to military units. The next is Economic technologies, which increases resource gathering rate, decreases cost and building time for units and buildings and decreases tribute tax amount. The final group is Imperial, which provides benefits mostly to special units and increases the health of units and buildings.\nThere are four technologies of each group for each epoch. Technologies can be researched by spending tech points. To get tech points, an appropriate number of citizens must be garrisoned in a university and/or an appropriate number of priests must be garrisoned in a temple. Technologies are researched through the main interface (no longer through a building) by clicking the Technology Tree button. When the correct number of tech points are available, the tech tree button will light up and new technology to research can be chosen. However, when research is no longer used (at the highest epoch specified before starting a game), the garrisoned units will become idle.\nIn Empire Earth II, each civilization belongs to a particular world region, each having its own regional powers. These can be activated on the game interface by clicking on a crown in the top right corner. All of the regional powers are timed; once the time is up to use it, it takes a long time for the regional powers to be recharged to use again. Each regional power can only be used in a respective group of epochs. For example, the regional power of Overtime can only be used by a player using a Far Eastern civilization in epochs 11–15.\nLike many games before it in the same genre, Empire Earth II has civilizations for players to lead to greatness. Each civilization has a unique power, giving it an advantage in a particular field. Each civilization also has a unique unit, which is a more powerful version of a given unit type. The Greek Hoplite, for instance, is a more effective heavy infantry than the other tribes' counterparts. The western civilizations are the Americans, British, Germans, Greeks, and the Romans. The Middle Eastern civilizations are the Babylonians, Egyptians, and the Turks. The Far Eastern civilizations are China, Japan, Korea. Finally, the Meso-American civilizations are the Aztecs, Incas, and the Mayans.\nCampaigns\nEmpire Earth II contains three single-player campaigns, a collection of scenarios called \"turning points\" and a tutorial campaign. The tutorial campaign features the Aztecs, featuring four scenarios to allow players to learn the gameplay. The first scenario is about the founding of the city of Tenochtitlan, followed by a scenario about the Spanish conquest of the Aztec Empire, which ends with the Aztecs driving out Hernán Cortés and his conquistadors. These scenarios are followed by ones about an Aztec alliance with the United States and a war with the Incas, occurring before World War II.\nKorean campaign\nThe Korean campaign is about early Korean history, from 2333 BC to 676 AD, divided into eight scenarios. The first two scenarios are about the founding of the state of Gojoseon and its first contacts with other Korean states and China, followed by scenarios about Korea's first wars with the Chinese and other Korean states. The next scenarios follow the Korean civil war and the state of Silla's decision to ally with China, and its eventual conquest over the other Korean states. The last scenario for this campaign is the final war with China.\nGerman campaign\nThe German Campaign deals with the years between 1220 and 1871 in central Europe. The first four scenarios are about the struggles of the Teutonic Order and the knights' eventual downfall. The next two scenarios are about the rise of Prussia and the Seven Years' War. The next scenario is about the war with Napoleon I of France. The final scenario is about the war with Denmark, Austria and France and the unification of Germany under Otto von Bismarck.\nAmerican campaign\nThe American Campaign is part-fact and part-fiction, set between 1898 and 2070. The first scenario is about the Spanish–American War in Cuba, followed by one about the Meuse-Argonne Offensive in World War I. The scenarios are about World War II, featuring the North African Campaign and a fictionalized version of the Ardennes Offensive. These are followed by Cold War spy missions against the Soviet Union. The next scenarios are fictionalized, about an attempted coup led by a disillusioned General Charles Blackworth against the US government; the player is charged with stopping this coup, eventually engaging Blackworth and his followers in the Amazon rainforest. When the player wins the last scenario in this campaign, there is a short film about mankind and the Earth. When that film ends, the credits for the game are shown.\nSpecial scenarios\nThere are four special scenarios in Empire Earth II called turning points. These scenarios can be played from either side of a battle or war which changed the course of history. The Normandy scenario takes place during the D-Day invasion, where the player can play as the Allies to repeat the success of Operation Overlord, or play as the Germans to stop the Allied invasion force from breaching the Atlantic Wall. The Three Kingdoms recreates the period after the end of the Han dynasty, where the player can play as the Kingdom of Wei or the Wu Kingdom, either winning historically as the Wei or changing history as the Wu.\nDevelopment and release\nEmpire Earth II was developed by Mad Doc Software as a sequel to the 2001 game Empire Earth and published by Vivendi Universal Games on April 26, 2005.\nAn expansion pack, which was released by Mad Doc Software called Empire Earth II: The Art of Supremacy, was released on February 14, 2006.\nEnd of support\nThe Multiplayer servers by GameSpy were taken offline on October 10, 2012.\nAfter the end of the official support, some of the game's community has continued to support the game and produced unofficial patches. The most prominent of these patches is aptly called the Empire Earth II Unofficial Path, which is still being updated. Among other things, some of the unofficial patches, including the Unofficial Patch, support all possible screen resolutions, fixes maximization problems on Windows 8 / 8.1 / 10 / 11, and enables DirectX 9 support to fix problems with only integrated graphics card being detected on Nvidia Optimus laptop under Windows 10. On 16 October 2015, Dr.MonaLisa (the creator of Unofficial Patches) released Unofficial Version 1.5.5 which brings back the old Multiplayer Lobby, which is now hosted on a new server.\nReception\nEmpire Earth II garnered generally positive reviews, and holds an average of 79% on aggregate web site GameRankings. The game also scored 8.9 out of 10 by IGN, and 8.0 by GameSpot. Shortly after the game's release, it was generally complimented for good gameplay and the options players had to customize the game.\" Criticisms of the game included high system requirements, issues with unit pathfinding, modest graphics, a poor unit counter system, a clunky, complicated, almost non-existent mission editor, and the increased complexity caused by the new game features.\" Others included poor in-game music and few terrain types.\nEmpire Earth II was a finalist for PC Gamer USs \"Best Real-Time Strategy Game 2005\" award, which ultimately went to Age of Empires III. During the 9th Annual Interactive Achievement Awards, the Academy of Interactive Arts & Sciences nominated Empire Earth II for \"Strategy Game of the Year\", which was ultimately awarded to Civilization IV.\nReferences\nExternal links\n* [https://web.archive.org/web/20080822040456/http://www.empireearth2.com/home.html Official website] (archive.org - the original redirects to Activision's website)\n* [https://web.archive.org/web/20071015035558/http://www.maddocsoftware.com/games_ee2.htm Empire Earth II at Mad Doc Software] - (archive.org - original domain expired)\n*\n*[http://www.mbohbot.com Michel Bohbot Illustration] at www.mbohbot.com"
    }
  ]
}