{
  "content": [
    {
      "type": "text",
      "text": "# Empire of Atlantium__disambig_1\n\n}}\n}}\nThe Empire of Atlantium is a micronation and secular, pluralist progressive lobby group based in New South Wales, Australia.\nMicronations: The Lonely Planet Guide to Home-Made Nations describes Atlantium as espousing \"progressive, liberal policies\" and characterises it as a \"secular humanist utopia\".\nIn 2015, the micronation had almost 3,000 \"citizens\", most of whom signed up online from over a hundred countries, and have never been to Atlantium.\nHistory\nAtlantium was established in 1981 by three Sydney teenagers&nbsp;– George Francis Cruickshank, Geoffrey John Duggan and Claire Marie Coulter (née Duggan). The three claimed a  \"provisional territory\" in the southern suburb of Narwee as Atlantium's first capital, and declared Cruickshank to be Sovereign head of state, with the title \"Emperor George II\". Geoffrey Duggan was elected as prime minister in 1982, serving until 1986. Damian Scott held the position from 1986 to 1988 and Kevin Fanucchi became Prime Minister in 1988, but by 1990, when the original group members had graduated from university and moved away, the group ceased to be active.\nIn 1999 Cruickshank purchased an apartment in the inner Sydney suburb of Potts Point, and soon after revived Atlantium, launching a website, which was instrumental in attracting new members. The  apartment, known as the Imperium Proper, became the second capital of Atlantium. Concordia became the third capital of Atlantium on 12 January 2008, when the rural  Province of Aurora, approximately  southwest of Sydney, was created. The Atlantium website describes Aurora as Atlantium's \"global administrative capital, ceremonial focal point and spiritual homeland\".\nStatus and operations\nThe Atlantium website used several different self-descriptions, including \"self-declared state\", \"aspirant microstate\" and \"global sovereign state\". In line with its claim to be a \"primarily non-territorial\" state Atlantium does not maintain any formal territorial claims; however, it does promote the idea that Cruickshank's apartment, and the Province of Aurora, have extraterritorial status. In practice these properties remain under Australian jurisdiction.\nNo established nation had recognised Atlantium's sovereignty claims, and it had no reciprocal diplomatic relations. Atlantium had appointed \"unaccredited diplomatic representatives\" called \"Imperial Legates\" in the United States, Pakistan, Poland, Brazil, India, Italy, Iran, Singapore, Serbia and Switzerland. The group had awarded \"Imperial Honours\" to various recipients, generally in recognition of political activism or for service to local communities.\nStamps, coins and banknotes\nStamps, coins and banknotes were sold by Atlantium, which used a decimal currency system of 100 imperial centi to the imperial solidus. Atlantium's website claimed that the profits from those sales are used for \"the Empire's ongoing operations\" as well as charitable causes.\nThe earliest documented media report referring to Atlantium is a 1984 philatelic magazine article about its cinderella stamp releases. There were 12 issues of Atlantian stamps.\nCitizenship\n, Atlantium had almost 3,000 citizens from (and still therein residing due to the small area of the Empire of Atlantium) over 100 countries. The website names individuals holding such functions as minister, director, magister and imperial legate. Atlantium said its citizenship does not supersede existing citizenships. Atlantians contend that they are all dual citizens, and that Atlantium actively encourages its citizens to participate in the political processes of their resident countries.\nSee also\n* List of micronations\nReferences\nBibliography\n*\n*\nFurther reading\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\nExternal links\n*[https://web.archive.org/web/20060109175531/http://www.atlantium.org/ Official website]\n*[https://web.archive.org/web/20121018104505/http://www.numismondo.com/pm/atm/ Atlantium Paper Money]"
    }
  ]
}