{
  "content": [
    {
      "type": "text",
      "text": "# Empire Stores\n\n| address            = 53-83 Water St, Brooklyn, NY 11201\n| opening_date       = 2016\n| closing_date       =\n| developer          = Midtown Equities\n| manager            =\n| owner              =\n| architect          =\n| number_of_stores   =\n|mapframe=yes\n| number_of_anchors  =\n| floor_area         =\n| floors             = 5\n| parking            =\n| publictransit      =\n| website            =\n| footnotes          =\n| embedded           =\n}}\nEmpire Stores is a former warehouse complex along the waterfront Brooklyn Bridge Park within the neighborhood of Dumbo, Brooklyn, New York City, in the U.S. state of New York. It hosts a food hall and market operated by Time Out New York, which opened in 2019, as well as an art gallery called Gallery 55.\nDescription and history\nEmpire Stores comprises seven buildings with a total of  of space. The building was originally completed in 1869, with additions made in 1885. It housed a number of businesses in its life as a cargo warehouse (coffee beans, sugar, molasses) for nearly a century, before being abandoned in the 1960s.\nIn 2013, Brooklyn developer Midtown Equities was selected to redevelop the abandoned Empire Stores warehouses into a mix of commercial and office space, designed by Studio V Architecture and S9 Architecture. The plan contained commercial and office space; restaurants and event areas; and a publicly accessible central passageway, courtyard, and rooftop. Many of the original design features were retained, such as schist walls, iron hoisting wheels, and coffee chutes. The ground floor was lowered several inches to integrate more smoothly with the rest of the park, but since the buildings are located directly on the waterfront, this makes them vulnerable to flooding during a storm surge. As a result, deployable flood barriers were purchased for Empire Stores, and the complex includes transformers on the seventh floor and a backup power generator.\nThe Brooklyn Historical Society (BHS) was selected to operate a  museum to celebrate Brooklyn's industrial history. Other future tenants included the area restaurant Vinegar Hill House, the watchmaker Shinola, a beer garden on the roof, and several other eateries.\nMidtown Equities originally intended to open Empire Stores in 2015. The flagship West Elm store, opened in August 2016, was the first tenant to open in Empire Stores, and for a year was the only tenant within the shopping complex. This was followed by the BHS Dumbo exhibition space in May 2017. Upon the opening of other shops, Empire Stores' waterfront location quickly became a popular spot for selfies, especially those with the Brooklyn Bridge in the background.\nTime Out Market New York\nIn early 2018, it was announced that Time Out Market New York would open a food hall in Empire Stores with 20 restaurants and three bars. The market opened in May 2019.\nReferences\nExternal links\n*"
    }
  ]
}