{
  "content": [
    {
      "type": "text",
      "text": "# Empire of the Atom\n\nEmpire of the Atom is a science fiction novel by Canadian-American writer A. E. van Vogt.  It was first published in 1957 by Shasta Publishers in an edition of 2,000 copies.  The novel is a fix-up of the first five of van Vogt's Gods stories, which originally appeared in the magazine Astounding.  The remaining Gods stories are combined in the sequel The Wizard of Linn.\nA genealogical chart of the ruling family of the Empire of Linn is included.\nComponents\nVan Vogt based Empire of the Atom largely on the plot of I, Claudius by Robert Graves, putting it into a science-fictional setting.  The work was originally presented as five novelettes published in Astounding Science Fiction between May 1946 and December 1947.\n*\"A Son Is Born\"  (May 1946)\n*\"Child of the Gods\"  (August 1946)\n*\"Hand of the Gods\" (December 1946)\n*\"Home of the Gods\"  (April 1947)\n*\"The Barbarian\"  (December 1947)\nThe critics James Blish and Damon Knight observed the similarity to Robert Graves' Claudius novels. Knight said that the plot was \"lifted almost bodily\" from that of I, Claudius. Brian Stableford wrote that the novel seemed to be a \"transfiguration\" of Graves' novel.\nPlot\nSome time a little over 10,000 years from now, a noblewoman gives birth to a deformed child, a consequence of having been accidentally exposed to radiation from one of the temples of the Atom Gods.  The baby is kept alive because one of the atom priests wants to conduct an experiment to see what will happen if the boy, unlike other mutant children, is given the full education of an atom priest.\nIn his teens the mutant boy Clane helps his father win a war with Mars.  He also continues his studies while his grandfather, who is Lord Leader, and his tutors protect him from the Machiavellian intrigues swirling around him, especially those of his grandmother Lydia.\nReaching his majority, Clane turns his estate into a laboratory where he can test new inventions and machines that he has retrieved from the ruins of ancient cities and reactivated.  When his grandfather dies, Clane becomes a target for assassination, but shortly thereafter Lady Lydia receives a vase containing the assassin’s ashes.  Even a direct frontal assault by a militia fails against Clane and Lady Lydia is compelled to cease her attacks on him.\nA war between the Linnan Empire and rebels on Venus provides an opportunity for Clane to take an expedition to explore the ruins of an ancient city there.  When the Venusians capture the Lord Advisor and thousands of his troops and prepare to hang them, Clane appears in their camp and displays the awesome power of the Atom Gods.  With the war won, Clane returns to Earth with his findings.\nIn spite of Clane’s warnings, the Linnan Empire is taken by surprise by an invasion of barbarians from Europa, the largest of Jupiter’s moons.  The invaders kill the Lord Advisor and Clane must take command of the imperial forces.  Disguised as a slave, Clane sneaks into his townhouse in the city of Linn and touches an artifact that he found on Venus.  With the power it gives him he compels the barbarian chieftain, Czinczar, to surrender, but not before Czinczar shows him the body of an alien, one of a species that Czinczar believes caused the cataclysm that devastated human civilization thousands of years before.  The Europan threat is vanquished, but now Clane has a new worry.\nThe story continues and concludes in The Wizard of Linn.\nReviews\nIn 1956 Kirkus Reviews had this to say about the novel:\n}}\nGalaxy reviewer Floyd C. Gale faulted the novel for its odd internal contradictions, in particular a scene where \"a fleet of spaceships makes a strafing run over the enemy, loosing flights of arrows from point-blank range.\" Science Fiction author George Hay said that, while he did have criticism of Vogt's prose, Empire of the Atom was \"well written by orthodox standards.\"\nNotes\nSources\n*\n*\n*\nExternal links\n*\n* [https://web.archive.org/web/20101014234409/http://baencd.thefifthimperium.com/23-TheEasternFrontCD/1635TheEasternFrontCD/Transgalactic/index.htm Transgalactic]: A Baen collection of A. E. Vogt stories, edited by Eric Flint and David Drake, which includes Empire of the Atom and The Wizard of Linn."
    }
  ]
}