{
  "content": [
    {
      "type": "text",
      "text": "# Empire State Express\n\n| el          =\n| speed       =\n| map         =\n| map_state   = collapsed\n}}\nThe Empire State Express was one of the named passenger trains and onetime flagship of the New York Central & Hudson River Railroad (a predecessor of the later New York Central Railroad). On September 14, 1891, it covered the 436&nbsp;miles (702&nbsp;kilometers) between New York City and Buffalo in 7&nbsp;hours and 6&nbsp;minutes (including stops), averaging 61.4 miles-per-hour (98.8&nbsp;km/h), with a top speed of 82&nbsp;mph (132&nbsp;km/h).\nHistory\nDrumhead logos such as these often adorned the ends of observation cars on the Empire State Express.]]\nThe train soon gained worldwide acclaim, and its route would later stretch to 620&nbsp;miles (998&nbsp;kilometers), to Cleveland, Ohio. The Empire State was the first passenger train with a schedule speed of over 52&nbsp;mph and the first to make runs of 142.88&nbsp;miles (230&nbsp;km) between stops (between New York City and Albany: the longest scheduled nonstop run until then).\nThe 1893 Guide shows an 8 hr 40 min schedule for 440 miles New York to Buffalo. As early as the 1930s the train served as a connector train for people making a transfer in Utica, New York for day trains through the Adirondack Park and on to Malone, New York and Montreal, Quebec.\nOn December 7, 1941, the New York Central inaugurated a new stainless-steel streamlined (Budd) train, powered by a streamlined J-3a Hudson (4-6-4) steam locomotive. The streamlined shrouding of the J-3a Hudson was designed by Mr. Chase H. Knowlton and Mr. George M. Davies. Henry Dreyfuss wasn't involved with the project. The inauguration was mostly overshadowed by the bombing of Pearl Harbor the same day.\nLike many long haul passenger trains through the mid-1960s, the \"Empire State Express\" carried a 60-foot stainless steel East Division (E.D.) Railway Post Office (R.P.O.) car operated by the Railway Mail Service (RMS) of the United States Post Office Department which was staffed by USPOD clerks as a \"fast mail\" on each of its daily runs. Mail handled by the ''\"Empire State's\"'' RPOs was canceled or backstamped by hand applied circular date stamps (CDS) reading \"N.Y. & CHICAGO R.P.O.\" and the train's number: \"TR 50\" (eastbound) or \"TR 51\" (westbound). The train was distinctively the most limited in stops (aside from the elite 20th Century Limited) in the New York City to Albany section. Beyond 125th Street, it only made a stop at Croton-Harmon, the location for switching from electric to diesel power, and made no other stops until Albany.\nFrom the post-war 1940s to the 1960s the train split at Buffalo. One section went along the south shore of Lake Erie to Cleveland. Another section went through Southwestern Ontario, Canada to Detroit, Michigan. From the early 1960s the Buffalo to Detroit section was a separate connecting train. Also at this time, coaches on the train from New York broke off at Buffalo and joined with the Buffalo-Toronto Express in partnership with Canadian Pacific bound for Toronto. This Toronto segment ended by April 1964. In 1967 the train was extended from being a day train to continuing to Chicago, Illinois as an overnight train. With the December 1967 schedule the Empire State Express name was gone, and #51 was shortened to Buffalo to Chicago, via Cleveland. The eastbound #50 was from Detroit to Buffalo.\nAmtrak\nWhen Amtrak took over the nation's passenger service on May 1, 1971, it consolidated trains on the New York&mdash;Albany&mdash;Buffalo corridor into the \"Empire Service\". Amtrak revived the name, although not the route to match, on January 6, 1974, when it gave names to Empire Service trains. The Empire State Express returned as a New York&mdash;Buffalo train, numbers 71 and 78. On October 31 that year Amtrak extended the train to Detroit via Southwestern Ontario with dining car and baggage service. This was the first instance of restored New York City to Detroit through Ontario service since the Penn Central's successor to the New York Central's Wolverine. On April 25, 1976, Amtrak renamed this train the Niagara Rainbow. Amtrak brought the name back in 1978 as a New York&mdash;Buffalo service, which in 1979 was extended to Niagara Falls. A few years later Amtrak dropped train names on the Empire Corridor.\nEmpire State Express locomotive No. 999\nNew York Central and Hudson River Railroad No. 999, the \"Queen of Speed,\" slows to  as it leads the Empire State Express through Palatine, New York in 1905.\nThe key to the ''Empire State's initial fame was a -long American-type 4-4-0 steam locomotive built in West Albany, New York especially to haul the train. The handmade unit had 86\" diameter driving wheels and was the first of its kind to have brakes on the front truck. The bands, pipes, and trim were polished; the boiler, smokestack, domes, cab, and tender were given a black satin finish, and \"Empire State Express\" was applied to the sides of the tender in  high gold leaf lettering.\nAfter touring the nation and making appearances at numerous expositions including the Chicago Railroad Fair, the unit was retired from service in May 1952, at which time it was relegated switching service in western New York shuttling express service milk cars. The New York Central donated the locomotive to the Chicago Museum of Science and Industry in 1962, where it has been preserved and placed on display. It lacks its original 86\" drivers, which were removed sometime after the historic speed run and replaced with smaller 70\" driving wheels.\nEquipment used\nAn early (circa'' 1905) heavyweight train car consist:\n* Buffet\n* Coach (2)\n* Sleeper (drawing room car)\nNote: The Vice President's private car was often attached to the end of the train for excursions.\nIn 1941 the New York Central ordered new lightweight stainless steel cars for the ESE trains from Budd. Initially a Hudson with matched [https://web.archive.org/web/20160304023700/http://www.railroad.net/photos/empiresteam/index.php streamlined stainless steel] panels was used. The NYC planned their first day of operation with the new fluted equipment on December 7, 1941, but drew little fanfare as the US was focused on the attack of Pearl Harbor. A set of the 1941 cars is owned by the Fort Wayne Railroad Historical Society.\nFirst Consist\n# Streamlined J-3a 4-6-4 Hudson Steam Locomotive & Coal Tender No. 5426\n# ALONZO B. CORNELL Baggage 60' Railway Post Office Car\n# GROVER CLEVELAND Baggage Buffet 36 seat Lounge Car\n# CHARLES E. HUGHES 30 Revenue seat Parlor Car with 5 seat Parlor Drawing Room\n# HERBERT H. LEHMAN 30 Revenue seat Parlor Car with 5 seat Parlor Drawing Room\n# NATHAN L. MILLER 30 Revenue seat Parlor Car with 5 seat Parlor Drawing Room\n# GEORGE CLINTON 44 seat Dining Car\n# REUBEN E. FENTON 56 Revenue seat Coach\n# 2569 56 Revenue seat Coach\n# 2567 56 Revenue seat Coach\n# 2566 56 Revenue seat Coach\n# HAMILTON FISH 56 Revenue seat Coach\n# DEWITT CLINTON 44 seat Dining Car\n# DAVID B. HILL 56 Revenue seat Coach\n# MORGAN LEWIS 56 Revenue seat Coach\n# WILLIAM L. MARCY 56 Revenue seat Coach\n# THEODORE ROOSEVELT 56 seat Tavern Bar Lounge Observation\nSecond Consist\n# Streamlined J-3a 4-6-4 Hudson Steam Locomotive & Coal Tender No. 5429\n# JOHN A. DIX Baggage 60' Railway Post Office Car\n# MARTIN VAN BUREN Baggage Buffet 36 seat Lounge Car\n# LEVI P. MORTON 30 Revenue seat Parlor Car with 5 seat Parlor Drawing Room\n# ALFRED E. SMITH 30 Revenue seat Parlor Car with 5 seat Parlor Drawing Room\n# SAMUEL J. TILDEN 30 Revenue seat Parlor Car with 5 seat Parlor Drawing Room\n# JOHN JAY 44 seat Dining Car\n# EDWIN D. MORGAN 56 Revenue seat Coach\n# 2564 56 Revenue seat Coach\n# 2565 56 Revenue seat Coach\n# 2568 56 Revenue seat Coach\n# WILLIAM H. SEWARD 56 Revenue seat Coach\n# HORATIO SEYMOUR 44 seat Dining Car\n# DANIEL D. TOMPKINS 56 Revenue seat Coach\n# CHARLES S. WHITMAN 56 Revenue seat Coach\n# SILAS WRIGHT 56 Revenue seat Coach\n# FRANKLIN D. ROOSEVELT 56 seat Tavern Bar Lounge Observation\nIn popular culture\n]]\nOn October 12, 1896, The Empire State Express, a short documentary film made in the experimental 68mm American Mutoscope Company process, premiered at Hammerstein's Olympia Music Hall Theater in New York City. The film was described by the critics of the day as \"the greatest train view ever taken.\"\nIn 1965, blues singer and guitarist Eddie James \"Son\" House Jr., at the time a New York Central employee, recorded \"Empire State Express\" at the New York Folk Festival:\n:Went down to the station,\n:Leaned against the door.\n:Went down to the station,\n:I...leaned against the door.\n:I knew it was the Empire State,\n:Can tell by the way she blows.\nNo. 999 preserved on static display at the Museum of Science and Industry in Chicago, photo from 2003.\n:Asked the depot agent,\n:\"Please let me ride the blinds.\"\n:Asked the depot agent,\n:\"Please let me ride the blinds.\"\n:He said, \"Son, I like to help you...you know,\n:''But the Empire State ain't mine\".\n:The Empire State...you know she,\n:Rides on Eastern time.\n:The Empire State,\n:She rides on Eastern time,\n:She's the \"rollingest\" baby,\n:On the New York Central line.\n::excerpt from \"Empire State Express\" by Son House\nNo. 999 was the inspiration for the eponymous steam engined-shaped space vehicle in the Galaxy Express 999 series of manga and animated films.\nThe 2007 Lyle Lovett song \"This Traveling Around\" includes the verse:\n:And that 999,\n:It's so fast you cannot see.\n:And that 999,\n:It's so fast you cannot see.''\nMembers of the Chicago band, Empire State Express (ESE), drew inspiration in naming their project from both the Son House song (a staple of ESE's live performances) and the No. 999's static display at the Chicago Museum of Science and Industry. The band's 2009 debut EP was titled \"Land Speed Record\" in honor of the train's legacy.\nNotes\n}}\nReferences\n*\n*\n*\n*\nExternal links\n* [https://web.archive.org/web/20071217093857/http://www.canadasouthern.com/caso/images/pass43-45.jpg New York Central Sleeping and Parlor Car Equipment and Assignment of Space for the Empire State Express, Part I].\n* [https://web.archive.org/web/20110928115744/http://www.canadasouthern.com/caso/images/pass43-46.jpg New York Central Sleeping and Parlor Car Equipment and Assignment of Space for the Empire State Express, Part II].\n* .\n* [https://web.archive.org/web/20060503220929/http://www.horologist.com/gallery_3.htm The Empire State Express & Webb C. Ball] contains various vintage images and trivia."
    }
  ]
}