{
  "content": [
    {
      "type": "text",
      "text": "# Empire, Ohio\n\n|area_magnitude           =\n|area_total_km2           = 0.78\n|area_land_km2            = 0.78\n|area_water_km2           = 0.00\n|area_total_sq_mi         = 0.30\n|area_land_sq_mi          = 0.30\n|area_water_sq_mi         = 0.00\n|population_as_of         = 2020\n|population_est           = 225\n|pop_est_as_of            = 2023\n|pop_est_footnotes        =\n|population_footnotes     =\n|population_total         = 232\n|population_density_km2   = 298.25\n|population_density_sq_mi = 773.33\n|timezone                 = Eastern (EST)\n|utc_offset               = -5\n|timezone_DST             = EDT\n|utc_offset_DST           = -4\n|elevation_footnotes      =\n|elevation_ft             = 676\n|coordinates              =\n|postal_code_type         = ZIP code\n|postal_code              = 43926\n|area_code                = 740\n|blank_name               = FIPS code\n|blank_info               = 39-25368\n|blank1_name              = GNIS feature ID\n|blank1_info              = 2398831\n|website                  =\n|footnotes                =\n}}\nEmpire is a village in Jefferson County, Ohio, United States, along the Ohio River. The population was 232 at the 2020 census. It is part of the Weirton–Steubenville metropolitan area.\nHistory\nEmpire has been known by several names over the years, including Shanghai, McCoy's Station, Olive City, and Empire. A post office called Empire has been in operation since 1886. Empire was incorporated as a village in 1897.\nGeography\nAccording to the United States Census Bureau, the village has a total area of , all land.\nDemographics\n}}\n2010 census\nAs of the census of 2010, there were 299 people, 119 households, and 82 families living in the village. The population density was . There were 139 housing units at an average density of . The racial makeup of the village was 94.6% White, 2.7% African American, 2.0% Native American, and 0.7% from two or more races.\nThere were 119 households, of which 35.3% had children under the age of 18 living with them, 46.2% were married couples living together, 15.1% had a female householder with no husband present, 7.6% had a male householder with no wife present, and 31.1% were non-families. 29.4% of all households were made up of individuals, and 9.3% had someone living alone who was 65 years of age or older. The average household size was 2.51 and the average family size was 3.06.\nThe median age in the village was 36.7 years. 25.1% of residents were under the age of 18; 9.1% were between the ages of 18 and 24; 30.1% were from 25 to 44; 26.5% were from 45 to 64; and 9.4% were 65 years of age or older. The gender makeup of the village was 46.8% male and 53.2% female.\n2000 census\nAs of the census of 2000, there were 300 people, 124 households, and 86 families living in the village. The population density was . There were 139 housing units at an average density of . The racial makeup of the village was 97.00% White, 1.00% African American, 0.67% Native American, 0.67% Pacific Islander, and 0.67% from two or more races. Hispanic or Latino of any race were 1.33% of the population.\nThere were 124 households, out of which 36.3% had children under the age of 18 living with them, 43.5% were married couples living together, 18.5% had a female householder with no husband present, and 30.6% were non-families. 29.0% of all households were made up of individuals, and 8.9% had someone living alone who was 65 years of age or older. The average household size was 2.42 and the average family size was 2.90.\nIn the village, the population was spread out, with 27.3% under the age of 18, 7.0% from 18 to 24, 32.7% from 25 to 44, 22.7% from 45 to 64, and 10.3% who were 65 years of age or older. The median age was 36 years. For every 100 females, there were 92.3 males. For every 100 females age 18 and over, there were 86.3 males.\nThe median income for a household in the village was $21,442, and the median income for a family was $24,250. Males had a median income of $30,625 versus $16,786 for females. The per capita income for the village was $11,667. About 16.5% of families and 16.3% of the population were below the poverty line, including 9.9% of those under the age of eighteen and 9.5% of those 65 or over.\nEducation\nPublic education in the village of Empire is provided by the Edison Local School District. Campuses serving the village include [https://web.archive.org/web/20090129103631/http://edisonlocal.k12.oh.us/district/buildings/stanton/stanton.html Stanton Elementary School] (Preschool-Grade 8) and Edison High School [https://web.archive.org/web/20090214162140/http://www.edisonlocal.k12.oh.us/district/buildings/ehs/ehs.html] (Grades 9-12).\nNotable person\n* Don Sutherin, Canadian Football Hall of Fame inductee, also played in the NFL\nSee also\n* List of cities and towns along the Ohio River\nReferences"
    }
  ]
}