{
  "content": [
    {
      "type": "text",
      "text": "# Empire in Flames\n\nEmpire in Flames is a supplement published by Games Workshop in 1989 as the final installment of The Enemy Within Campaign created for the fantasy role-playing game Warhammer Fantasy Roleplay. Many players found this product disappointing, and in a later edition of the campaign, it was heavily revised.\nDescription\nEmpire in Flames is the sixth and final part of The Enemy Within campaign, and picks up where the previous supplement, Something Rotten in Kislev, ends. The player characters return to the city of Middenheim and discover a civil war has broken out. The player characters must travel into the dangerous Black Fire Mountains to recover Ghal-maraz, the lost hammer of Sigmar in order to restore order to the empire.\nPublication history\nThe six-part campaign The Enemy Within, designed for the fantasy role-playing game Warhammer Fantasy Roleplay, was published between 1986 and 1989. The sixth installment, Empire in Flames, was a 152-page hardcover book written by Carl Sargent . Cover art was by John Blanche, interior art was by Tony Ackland, Paul Bonner,  Gary Chalk, Colin Howard, Martin McKenna, Russ Nicholson, Adrian Smith, Stephen Tappin, and Bill Thornhill, and cartography was by Charles Elliot. It was released in 1989.\nIn 1995, Hogshead Publishing acquired the license to Warhammer Fantasy Roleplay and published an updated version of the series as six hardcover books.\nIn 2017, Cubicle 7 acquired the license for Warhammer Fantasy Roleplay, and in 2019, began publishing a Director's Cut of the campaign for the fourth edition of the game. There had been complaints that Empire in Flames was disappointing, and Cubicle 7 heavily revised it, releasing it as the retitled Empire in Ruins (2021), created by Graeme Davis, with contributions by Dave Allen, John Foody, TS Luikart, Pádraig Murphy, Clive Oldfield, Dylan Owen, Anthony Ragan, KC Shi, and Simon Wileman.\nReception\nIn his 2023 book Monsters, Aliens, and Holes in the Ground, RPG historian Stu Horvath noted that Empire in Flames was \"a disappointing climax [to the Enemy Within campaign] ... It is worth noting that Cubicle 7's lush, 10-volume modernization of the campaign (2020-2022) dramatically overhauls Empire, which is a welcome course correction.\" Nonetheless, Horvath suggested that this product as well as its predecessor, Something Rotten in Kislev, were both unneeded, and that the Enemy Within campaign should have ended with the fourth installment, Power Behind the Throne.\nIn Issue 10 of Warpstone, John Foody suggested that players avoid Empire in Flames and instead wait for a revised product to be published.\nBeasts of War reviewed the Cubicle 7 revision to this product, Empire in Ruins, and commented, \"The new books have been well laid out, packed with details, stunning artwork and some nice nods to the editions of old. They really are a love letter to The Old World and Warhammer Fantasy Role-Play, a perfect way to dive into this grimdark setting.\"\nReferences"
    }
  ]
}