{
  "content": [
    {
      "type": "text",
      "text": "# Empire of Pain\n\nEmpire of Pain: The Secret History of the Sackler Dynasty is a 2021 book by Patrick Radden Keefe. The book examines the history of the Sackler family, including the founding of Purdue Pharma, its role in the marketing of pharmaceuticals, and the family's central role in the opioid epidemic. The book followed Keefe's 2017 article on the Sackler family in The New Yorker, titled \"The Family That Built an Empire of Pain\".\nSummary\nArthur, Mortimer, and Raymond Sackler were children of Jewish immigrants that were raised in Brooklyn. All three brothers became medical doctors, but the eldest, Arthur, showed a particular talent for advertising, combining both his passions by joining and later owning William Douglas McAdams Inc., an advertising firm that exclusively handled medicinal clients and pioneered the technique of advertising medication directly to doctors. Despite having many conflicts of interest, Arthur was able to keep these associations hidden by leaving his brothers, friends, and ex-wife as figureheads for various companies. As Arthur continued to amass his fortune, he and his younger brothers begin to make important philanthropic contributions, donating money to museums and for scholarships. The brothers eventually grew estranged; when Arthur died in 1987, his complicated legacy was left to multiple heirs including his brothers, his wife, his ex-wife, and his four children. When the fight to split the assets devolved into acrimony, his children agreed to sell their shares in Purdue Frederick, a small drug manufacturer, to their uncles Mortimer and Raymond.\nMortimer and Raymond Sackler invested in research into opioids with their investment in research eventually leading to Oxycodone. After Mortimer and Raymond joined the board at Purdue Frederick, the family began to roll out a sales force to sell Oxycodone using techniques pioneered by Arthur in order to influence politicians, government officials and doctors into endorsing the pill. Their new drug was an immediate success, but almost equally quickly, users began to abuse the drug. In 2010, the company discontinued their initial version of the drug and made a version that was impossible to crush; this led to a 25% drop in sales and a rise in heroin which was arguably caused by opioid abuse. As lawsuits began to build against Purdue Frederick, the Sackler family sought to insulate themselves both financially and publicly from the drug. All Sacklers declined interviews and the Sacklers on the board of the company repeatedly voted to give themselves huge financial bonuses.\nBy 2017, a series of articles linking the Sacklers to Oxycodone as well as a public campaign by photographer Nan Goldin to link the Sacklers to the opioid crisis, led to stigmatization of the Sackler name with many museums and universities refusing financial gifts from the Sacklers.\nWhile the family was eventually sued, the Sacklers used their company to declare bankruptcy, link their personal finances to the fortunes of Purdue Frederick, and ultimately managed to escape any financial consequences at all. The family continued to maintain that they knew nothing about the abusive and deceptive marketing practices of the company and maintained the lie that their opioids were not addictive and that the few people who abused their drugs were already addicts to begin with.\nReception\nNew York noted that Empire of Pain differs from other coverage of the Sackler's role in the opioid crisis, calling the book \"principally a family history\". Zachary Siegel, writing in The New Republic, called the book an \"important record of private greed facilitated by a corrupted government\". Publishers Weekly called the book a \"damning review\" of the family's involvement in the opioid epidemic. Joanna Walter praised Patrick Radden Keefe's telling of the decade-spanning story in Literary Review: \"He expertly draws all the threads together to bring us the full, frightening saga... the sum of its parts is a stunning crime story.\"\nThe book won the 2021 Baillie Gifford Prize for Non-fiction and the Goodreads Choice Award for History & Biography, was shortlisted for the 2021 Financial Times and McKinsey Business Book of the Year Award, and was longlisted for the 2022 Andrew Carnegie Medal for Excellence in Nonfiction. It was also selected for The Washington Posts \"10 Best Books of 2021\" list.\nReferences"
    }
  ]
}