{
  "content": [
    {
      "type": "text",
      "text": "# Empire (newspaper)\n\n|Samuel Bennett and William Hanson }}\n| founder                = Henry Parkes\n| publisher              =\n| president              =\n| editor                 =\n| chief_editor           =\n| deputy_editor          =\n| associate_editor       =\n| managing_editor        =\n| general_manager        =\n| news_editor            =\n| managing_editor_design =\n| director_interactive   =\n| dirvisuals             =\n| dirvideo               =\n| campus_editor          =\n| campus_chief           =\n| metro_editor           =\n| metro_chief            =\n| opinion_editor         =\n| sports_editor          =\n| photo_editor           =\n| staff_writers          =\n| founded                =\n| political_position     =\n| language               = English\n| ceased_publication     =\n| relaunched             =\n| headquarters           =\n| publishing_city        = Sydney\n| publishing_country     = Australia\n| circulation            =\n| circulation_date       =\n| circulation_ref        =\n| readership             =\n| sister_newspapers      = The Evening News\n| ISSN                   =\n| eISSN                  =\n| oclc                   =\n| RNI                    =\n| website                =\n| free                   =\n}}\nThe Empire was a newspaper published in Sydney, New South Wales, in colonial Australia. It was published from 28 December 1850 to 14 February 1875, except for the period from 28 August 1858 to 23 May 1859, when publication was suspended. It was later absorbed by The Evening News.\nHistory\nHenry Parkes founded the Empire and was its editor/proprietor until the business failed in August 1858. He made it \"a newspaper destined to be the chief organ of mid-century liberalism and to serve as the rallying and reconciliation point for the sharpest radical and liberal minds of the day\".\nThe paper was bought by Samuel Bennett and William Hanson and resumed publication in May 1859 with the promise that \"The Empire … will continue under the new management to advocate the same great principles by which it has hitherto been distinguished\". In 1875, labour difficulties forced Bennett to merge the Empire with another of his papers, the Evening News. The Evening News continued to be published until 1931 at which point it was closed by Associated Newspapers Ltd, which had acquired most Sydney newspaper titles by that time.\nDigitisation\nThe paper has been digitised as part of the Australian Newspapers Digitisation Program project of the National Library of Australia.\nSee also\n* List of newspapers in New South Wales\nReferences\nExternal links\n*\n**\n* [https://www.newspapers.com/paper/33607 The Empire Archive] at Newspapers.com\n* [https://newspaperarchive.com/search/location/au/nsw/sydney/sydney-empire/ Sydney Empire] at NewspaperArchive"
    }
  ]
}