{
  "content": [
    {
      "type": "text",
      "text": "# Empress Zheng (Song dynasty)__disambig_1\n\n| image        = 宋徽宗后坐像_軸.jpg\n| caption      =\n| succession   = Empress consort of the Northern Song dynasty\n| reign        = 20 March 1110 – 18 January 1126\n| predecessor  = Empress Xiangong\n| successor    = Empress Renhuai\n| birth_date   = 1079\n| birth_place  = Bianjing, Henan, China\n| death_date   =\n| death_place  = Wuguo, Heilongjiang, China\n| burial_place = Yongyouling (永佑陵)  Shaoxing, Zhejiang\n| spouse       = Emperor Huizong of Song\n| issue        = Zhao Yupan, Princess JiadeZhao Cheng, King of YanZhao Jinluo, Princess An'dePrincess ShoushuPrincess RongshuZhao Hu'er, Princess Chengde\n| house        = Family name: Zheng (鄭)\n| house-type   = Clan\n}}\nEmpress Zheng (1079 – 1130) was the empress of Emperor Huizong of Song.\nImperial life\nZheng was born to a member of the gentry in Kaifeng. She served as a lady-in-waiting to Empress Xiang, who was the official mother of the future Emperor Huizong of Song. When Huizong was still only a prince, he lived outside the imperial palace and would often visit the empress, who instructed Zheng and another one of her ladies to wait upon him. In 1099, Empress Xiang arranged for him to marry Lady Wang. As a wedding present, Empress Xiang presented Zheng and the other lady-in-waiting, also called Wang, to him as concubines.\nIn 1100, Huizong succeeded his brother as emperor. Huizong was not close to his primary wife, Empress Wang and Zheng competed with Consort Wang for his favour. Zheng was apparently studious and adept at music.\nHuizong had many additional favourites, including consorts Wei and Quai, several maids of Consort Zheng, and Consort Liu Mingda. However, Zheng is not described as having been jealous of them. Zheng was described as a beauty, a skillful dancer and singer, with an ability to amuse and flatter the emperor. In 1102, Huizong granted Zheng the rank of Virtuous Consort.\nIn 1110, two years after the death of Empress Wang, Huizong appointed Zheng to the position of empress. Her elevation was somewhat controversial, as empresses were generally members of military or official families, not former servants. The influence of Empress Zheng was also resented.\nExile\nEmperor Huizong abdicated in favor of his son Emperor Qinzong in 1126. In 1127, the capital of Kaifeng was captured by the Jurchen during the Jin–Song Wars. Emperor Qinzong was deposed, and he was captured and exiled to Manchuria, along with Emperor Huizong and most of the imperial court, in what is now called the Jingkang Incident. The consorts, concubines and palace women who were captured were distributed among the Jurchen men.\nThe Jurchen defined five of Huizong's consorts as wives, among them Empress Zheng, which meant that they accompanied him into exile. Patricia Buckley Ebrey states that Empress Zheng would have been too old at this point to have been considered a good war prize for the Jurchen.\nDeath\nEmpress Zheng died in 1130 in Wuguo, Heilongjiang, where the Jurchen held the exiled members of the imperial clan.\nWhen Emperor Gaozong was eventually told of the death of Huizong and Empress Zheng in 1137, he reportedly reacted quite severely, ordering an extended period of mourning.\nTitle\n*During the reign of Emperor Shenzong of Song (25 January 1067 – 1 April 1085)\n**Lady Zheng (鄭氏; from 1074)\n** Servant (侍女; from Unknown date)\n**Concubine (妾; from 1099)\n*During the reign of Emperor Huizong of Song (23 February 1100 – 18 January 1126)\n** Able Consort (賢妃; from 1100)\n** Virtuous Consort (德妃; from 1102)\n** Empress (皇后; from 1108)\n** Empress Ningde (寧德皇后; from 1130)\n** Empress Xiansu (顯肅皇后)\nIssue\nAs a Able Consort:\n* Princess Jiade (嘉德帝姬; 1100–1141), personal name Yupan (玉盤), The emperor's 1st daughter\n* Zhao Cheng, Prince Yan (兗王 趙檉; 1101), The emperor's 2nd son\nAs a Virtuous Consort:\n* Princess Shoushu (壽淑帝姬), The emperor's 4th daughter\n* Princess Ande (安德帝姬; 1106–1127), personal name Jinluo (金羅), The emperor's 8th daughter\n* Princess Rongshu (榮淑帝姬),The emperor's 11th daughter\nAs a Empress:\n* Princess Chengde (成德帝姬; b. 1110), personal name Hu'er (瑚兒), The emperor's  13th  daughter\nReferences\nNotes\nWorks cited\n*"
    }
  ]
}