{
  "content": [
    {
      "type": "text",
      "text": "# End of World War II in Asia\n\nWorld War II officially ended in Asia on September 2, 1945, at 3:24 with the surrender of Japan on the . Before that, the United States dropped two atomic bombs on Japan, and the Soviet Union declared war on Japan, causing Emperor Hirohito to announce the acceptance of the Potsdam Declaration on August&nbsp;15, 1945, which would eventually lead to the surrender ceremony on September&nbsp;2.\nAfter the ceremony, Japanese forces continued to surrender across the Pacific, with the last major surrender occurring on October&nbsp;25, 1945, with the surrender of Japanese forces in Taiwan to Chiang Kai-shek. The American occupation of Japan lasted from the end of the war until April&nbsp;28, 1952, when the Treaty of San Francisco came into effect.\nPrelude\nSoviet agreements to invade Japan\nAt the Tehran Conference (November 28-December 1, 1943),  the Soviet Union agreed to invade Japan \"after the defeat of Germany\", but this would not be finalized until the Yalta Conference between February 4 and February 11, 1945, when the Soviet Union agreed to invade Japan within 2 or 3 months. On April 5, 1945, the Soviet Union denounced the Soviet–Japanese Neutrality Pact that had been signed on April 13, 1941, as now the Soviet Union had plans for war with Japan.\nSurrender of Axis forces in Europe\nJapan's biggest allies in Europe began to surrender in 1945, with the last Italian troops surrender in the \"Rendition of Caserta\" on April 29, 1945, and the Germans surrendering on May 8, 1945, leaving Japan as the last major Axis power standing.\nThe Potsdam Conference and Declaration\nOn July 17, 1945, the Potsdam Conference began. While mostly dealing with events in Europe after the Axis surrenders, the Allies also discussed the war against Japan, leading to the Potsdam Declaration being issued on July 26, 1945, calling for the unconditional surrender of Japan, and \"prompt and utter destruction\" if Japan failed to surrender. Yet, the ultimatum also claimed that Japan would not \"be enslaved as a race or destroyed as a nation\".\n, Harry S. Truman, and Joseph Stalin at the Potsdam Conference.|alt=This is Clement Attlee, Prime Minister of the United Kingdom, Harry Truman, President of the United States, and Joseph Stalin, leader of the Soviet Union, sitting together at the Potsdam Conference.]]\nJapan's peace attempts and response to the Potsdam Declaration\nSome scholars believe Japan had begun to want to make peace with the Allies, as early as the spring of 1944. The unannounced aim of the Suzuki cabinet, which took office on April 7, 1945, may have been to secure peace. Japan may have made attempts to stop the war, including sending Fumimaro Konoe to Moscow in an attempt to try to get the Soviet Union to make the Americans stop the war. However, the Soviet Union wanted to declare war on Japan before the Allies made peace.\nJapan responded to the Potsdam Declaration with a policy of mokusatsu.  Scholars debate if Japan “ignored” the Allies’ demand for Japan’s surrender, or if it  “withheld comment,” meaning it needed more time to formulate a response.\nFinal stages\nBefore the informal surrender of Japan\nAtomic bombings of Hiroshima and Nagasaki\nOn August 6, 1945, a gun-type nuclear bomb, Little Boy, was dropped on Hiroshima from a special B-29 Superfortress named Enola Gay, flown by Col. Paul Tibbets. It was the first use of atomic weapons in combat. 70,000 were killed instantly; 30,000 more would die by the end of the year. Hiroshima was chosen as the target to demonstrate the destructiveness of the bomb.\nAfter the bombing of Hiroshima, Harry Truman said that \"We have spent two billion dollars on the greatest scientific gamble in history—and won.\" Japan still continued the war, though, despite some officials' attempts to make peace through the Soviets.\nOn August 9, 1945, a second and more powerful plutonium implosion atomic bomb, Fat Man, was dropped on Nagasaki from a different Silverplate B-29 named Bockscar, flown by Major General Charles Sweeney. The original target was Kokura, but thick clouds covered the city, so the plane was flown to the secondary target, Nagasaki, instead. It killed 40,000 instantly, and another 30,000 would die by the end of the year.\nThe atomic bombings were one possible reason why Emperor Hirohito decided to surrender to the Allies.\nSoviet war against Japan\nOn August 8, 1945, the Soviet Union declared war on Japan, breaking the Soviet–Japanese Neutrality Pact. This dashed any hopes of peace negotiated through the Soviet Union and was a major factor in the surrender of Japan. The next day, Soviet armies invaded Manchuria, attacking from all sides except the south. On August 10, 1945, Soviet forces invaded Karafuto Prefecture. Following the declaration, Japan was at war with almost all non-neutral nations.\nKorea\nOn August 11, 1945, with the drafting of General Order No. 1, the 38th Parallel was set as the delineation between the Soviet and US occupation zones in Korea, with Japanese forces north of the parallel surrendering to the Soviets, and those to the south surrendering to the Americans.\nThe informal Japanese surrender\nOn August 9, after the Nagasaki atomic bombing, shortly before midnight, Hirohito entered a meeting with his cabinet, where he said that he did not believe Japan could continue to fight the war. The next day, the Japanese Foreign Ministry transmitted to the Allies that they would accept the Potsdam Declaration. In the evening of August 14, Hirohito was recorded accepting the Potsdam Declaration at the NHK broadcasting studio. It would not be broadcast until the next day at noon.\nAfter the informal surrender\nsigns the instrument of surrender on  in Tokyo Bay on September 2, 1945.|alt= A man in formal clothes bends over a table to write on a paper. A white man in uniform watches him. A Japanese man in formal clothes watches from behind. In the background, lots of white men in uniform observe.]]\nDouglas MacArthur\nGeneral Douglas MacArthur was the Supreme Commander for the Allied Powers, and as such had complete control over the occupation of Japan. He issued General Order No. 1 on August 17, which ordered all Japanese forces to unconditionally surrender to an Allied power in the Pacific, depending on the location. On August 30, MacArthur arrived at Atsugi Air Base in Japan to begin the occupation of Japan by the Allied Powers.\nLast air casualty\nOn August 18, Japanese pilots attacked two B-32s of the 386th Bombardment Squadron and 312th Bombardment Group on a photo reconnaissance mission over Japan. Sergeant Anthony Marchione, 19, a photographer's assistant, was fatally wounded in the attack and would be the last American killed in air combat in the Second World War.\nAllied operations after the informal surrender\nTroop actions\nOn August 18, Soviet troops began invading the Kuril Islands, starting with amphibious landings in Shumshu. Five days later, the last Japanese troops there surrendered. On August 30, after the informal surrender, British forces returned to Hong Kong.\n; August 26, 1945: Hutou Fortress, a final Japanese Army stronghold, fell into Soviet hands during the final battle in Manchuria\n; August 27, 1945: B-29s begin to drop supplies to prisoners in Japanese camps as part of Operation Blacklist, which included providing Allied prisoners of war with adequate supplies and care and to evacuate them from their prisons.\n; August 29, 1945: A B-29 was shot down over Korea while supplying POWs in the camp at Konan. Bill Streifer and Irek Sabitov argue the Soviets shot the plane down to prevent the Americans from identifying facilities supporting Japan's atomic bomb program.\n; September 2, 1945: Formal Japanese surrender ceremony aboard  in Tokyo Bay; U.S. President Harry S. Truman declares Victory over Japan Day.\nAftermath\n, March 1945|alt=Portrait of Chiang Kai-shek, a generalissimo for China.]]\n; September 2, 1945: Japanese garrison in Penang surrenders, while the British begin to retake Penang under Operation Jurist.\n; September 4, 1945: Japanese troops on Wake Island surrender.\n; September 5, 1945: The British land in Singapore.\n; September 5, 1945: The Soviets complete their occupation of the Kuril Islands.\n; September 6, 1945: Japanese forces in Rabaul and across Papua New Guinea surrender.\n; September 8, 1945: MacArthur enters Tokyo.\n; September 8, 1945: US forces land at Incheon to occupy Korea south of the 38th parallel.\n; September 9, 1945: Japanese forces in China surrender.\n; September 9, 1945: Japanese forces on the Korean Peninsula surrender.\n; September 10, 1945: Japanese forces in Borneo surrender.\n; September 10, 1945: Japanese in Labuan surrender.\n; September 11, 1945: Japanese in Sarawak surrender.\n; September 12, 1945: Japanese in Singapore formally surrender.\n; September 13, 1945: Japanese in Burma formally surrender.\n; September 16, 1945: Japanese in Hong Kong formally surrender.\n; October 25, 1945: Japanese in Taiwan surrender to Generalissimo Chiang Kai-shek.\nThailand (Siam)\nAfter Japan's defeat in 1945, most of the international community, with the exception of Britain, did not accept Thailand's declaration of war, as it had been signed under duress. Thailand was not occupied by the Allies, but it was forced to return the territory it had regained to the French. In the postwar period, the Thai government had close relations with the United States, which it saw as a protector from the communist revolutions in neighbouring countries.\nOccupation of Japan\nAt the end of World War II, Japan was occupied by the Allies, led by the United States with contributions also from Australia, India, New Zealand and the United Kingdom. This foreign presence marked the first time in its history that the island nation had been occupied by a foreign power. The San Francisco Peace Treaty, signed on September 8, 1951, marked the end of the Allied occupation, and after it came into force on April 28, 1952, Japan was once again an independent country.\nJapanese demobilization and repatriation\nOne problem faced by the allies were the 3 million Japanese civilian and 3.5 million demobilized military personnel scattered around the region. Gen. MacArthur desired their immediate repatriation to Japan, not just for humanitarian reasons but also to lift the economic burden of the newly liberated territories. Conversely, there were more than 1 million nationals from occupied countries who found themselves in Japan at the end of the war.\nOn November 30, 1945, under the SCAP directive, the Japanese government dissolved the Ministry of War and Ministry of the Navy. In their place came about First Demobilization Ministry (Army) and the Second Demobilization Ministry (Navy). By mid-1946, both agencies were downgraded to Bureaus and formed under the Welfare Ministry.\nRepatriation happened immediately, but Japanese authorities faced logistical issues given that the Japanese maritime industry faced a shortage of ships to transport back the Japanese POWs and civilians. Across the region, the Japanese were mainly confined to concentration camps. From October 1, 1945, to December 31, 1946, the repatriation of more than 5,103,300 Japanese were completed. The Soviet Union retained 1,316,000 POWs, the United Kingdom held 81,000, Netherlands East Indies Government retained 13,500 POWs, while the Chinese government retained 70,000 POWs, for forced labor and reconstruction efforts of their territories in the Western Pacific.\nInternational Military Tribunal for the Far East\ncourt chamber]]\nDuring the occupation of Japan, leading Japanese war crime charges were reserved for those who participated in a joint conspiracy to start and wage war, termed \"Class A\" (crimes against peace), and were brought against those in the highest decision-making bodies; \"Class B\" crimes were reserved for those who committed \"conventional\" atrocities or crimes against humanity; \"Class C\" crimes were reserved for those in \"the planning, ordering, authorization, or failure to prevent such transgressions at higher levels in the command structure.\"\nTwenty-eight Japanese military and political leaders were charged with Class A crimes, and more than 5,500 others were charged with Class B and C crimes, as lower-ranking war criminals. The Republic of China held 13 tribunals of its own, resulting in 504 convictions and 149 executions. The Philippines also conducted their own trials with the conviction of Class B and C war criminals. On July 4, 1953, Pres. Elpidio Quirino pardoned 105 of the Japanese war criminals, paving their way for their repatriation to Japan.\nEmperor Hirohito and all members of the imperial family such as Prince Asaka, were not prosecuted for involvement in any the three categories of crimes. Herbert Bix explains that \"the Truman administration and General MacArthur both believed the occupation reforms would be implemented smoothly if they used Hirohito to legitimise their changes.\"  As many as 50 suspects, such as Nobusuke Kishi, who later became Prime Minister were charged but released without ever being brought to trial in 1947 and 1948. Shirō Ishii received immunity in exchange for data gathered from his experiments on live prisoners. The lone dissenting judge to exonerate all indictees was Indian jurist Radhabinod Pal.\nThe tribunal was adjourned on November 12, 1948.\nSee also\n* Timeline of Axis surrenders in World War II\n* End of World War II in Europe\n* Japanese holdout\n* Aftermath of World War II\nReferences"
    }
  ]
}