{
  "content": [
    {
      "type": "text",
      "text": "# Endorsements in the 2024 Venezuelan presidential election\n\nPresidential elections were held in Venezuela on 28 July 2024 to choose a president for a six-year term beginning on 10 January 2025. President Nicolás Maduro ran for a third consecutive term, while former diplomat Edmundo González Urrutia represented the Unitary Platform (; PUD), the main opposition political alliance.\nThe Unitary Platform held primaries in October 2023, which were won in a landslide by María Corina Machado. A few months earlier, in June 2023, she had been disqualified for fifteen years by the Comptroller General of Venezuela, but the decision was pending in court.\nAfter she was barred from running, Machado's endorsement of González was an important factor in the election as he gained support from even former socialist supporters of the government, along with support from the Machado-led opposition.\nA list of endorsements in the 2024 Venezuelan presidential election follows.\nEdmundo González\n;Executive officials\n*  – Former president of the National Electoral Council\n* Rodrigo Cabezas Morales – Former Minister of Economy and Finance\n* Héctor Navarro – Former Minister of Education of Venezuela\nNational officials\n* Omar Barboza, former president of the National Assembly\n* Julio Borges, former president of the National Assembly\n* Henry Ramos Allup, former president of the National Assembly\n* Juan Guaidó, former partially recognised president of Venezuela and of the National Assembly\n* Juan Pablo Guanipa, former deputy to the National Assembly\n* Tomás Guanipa, former deputy of the National Assembly\n* María Corina Machado, former deputy to the National Assembly and former nominee for president of the Unitary Platform\n* Carlos Ocariz, former deputy to the National Assembly\n* Delsa Solórzano, former deputy of the National Assembly\n* Freddy Superlano, former deputy of the National Assembly\n;Local officials\n* Oswaldo Álvarez Paz, former governor of Zulia state\n* Henrique Capriles, former governor of Miranda state and former nominee for president of the Democratic Unity Roundtable\n* Henri Falcon, former governor of Lara state and former candidate for president\n* , governor of Barinas state\n* Antonio Ledezma, former Metropolitan Mayor of Caracas\n* Leopoldo López, former mayor of Chacao municipality\n* César Pérez Vivas, former governor of Táchira state\n* Manuel Rosales, governor of Zulia state\n* David Smolansky, former mayor of El Hatillo municipality\n* Andrés Velásquez, former governor of Bolivar state\n* Henrique Salas Römer, former governor of Carabobo state\n;Notable individuals\n* Fabiana Rosales, former partially recognised  First Lady of Venezuela\n* Corina Yoris, former candidate for president of the Unitary Platform\n;Political parties\n* Justice First\n* Popular Will\n*Democratic Action\n*Come Venezuela\n* Radical Cause\n* Copei\n* Encuentro Ciudadano\n* National Convergence\n* Red Flag (officially)\n* Ecological Movement of Venezuela (de jure)\n* Un Nuevo Tiempo\n*\n* Movement to Socialism\n* Democratic Republican Union\n*\n*  (de jure)\n* Movement for a Responsible, Sustainable and Entrepreneurial Venezuela\n* Neighborhood Force (faction)\n* Project Venezuela\n* Fearless People's Alliance\n*\n*\n*\n*\n*\n;International politicians\n* Brian A. Nichols, american diplomat\n* Marco Rubio, United States senator from Florida, current United States Secretary of State\n* Lindsey Graham, United States senator from South Carolina\n* Carlos Gimenez,  U.S. representative for Florida's 28th congressional district\n* Maria Salazar,  U.S. representative for Florida's 27th congressional district\n* Jared Moskowitz,  U.S. representative for Florida's 23rd congressional district\nNicolás Maduro\n;Executive officials\n* Jorge Arreaza, Former Vice President of Venezuela\n* Elías Jaua, Former Vice President of Venezuela\n* Delcy Rodriguez, Vice President of Venezuela\n; National officials\n* Diosdado Cabello, Deputy of the National Assembly\n* Jorge Rodríguez,  President of the National Assembly\n*  – Former Deputy to the National Assembly\n; Local officials\n*Carmen Meléndez – Former governor of Lara state\n*Héctor Rodríguez Castro, governor of Miranda state\n*Rafael Lacava, governor of Carabobo state\n* Morel Rodríguez, governor of Nueva Esparta state\n* Alberto Galindez, governor of Cojedes state\n* Juan Carlos Zamora, mayor of Tinaco municipality\n; Political parties\n* United Socialist Party of Venezuela\n* Venezuelan Popular Unity\n* Patria Para Todos\n* For Social Democracy\n* Movimiento Revolucionario Tupamaro\n* People's Electoral Movement\n* Authentic Renewal Organization\n; Individuals\n*Henrys Silva– singer\n*Roger Waters – English singer\n;International politicians\n* Daniel Ortega, President of Nicaragua\n* Rosario Murillo, Vicepresident of Nicaragua\n* Evo Morales, Former President of Bolivia\nOthers\nLuis Eduardo Martínez was endorsed by Juan Carlos Alvarado, Deputy to the National Assembly; Luis Ratti, former independent candidate for president; and the political parties Democratic Action (minority faction), COPEI (minority faction) and Red Flag (minority faction).\nAntonio Ecarri was endorsed by political parties Neighborhood Force (partial); ; Progressive Advance (intervened by the National Electoral Council); and Cambiemos Movimiento Ciudadano.\nEnrique Márquez was endorsed by the Communist Party of Venezuela and the Networks Party.\nReferences"
    }
  ]
}