{
  "content": [
    {
      "type": "text",
      "text": "# Enemy aliens in Queensland during World War I\n\nDuring World War I in Queensland, Australia, enemy aliens (people from enemy nations)  were frequently arrested and detained. Strong anti-German sentiment resulted in many arrests and investigations. German place names in Queensland were frequently renamed with British names.\nBefore World War I\nBefore the outbreak of the World War I in August 1914, German migrants were held in high esteem for their industriousness and agricultural skills. Successive Queensland Governments actively encouraged German immigrants, who came to dominate rural communities in the Logan River district, Lockyer Valley, Darling Downs, Binjour Plateau in the Burnett, and centres in Far North Queensland.\nDuring World War I\nThe British Empire and its allies – including Australia – had four major combatants: Germany, the Austro-Hungarian and Ottoman (Turkish) Empires and Bulgaria, which together formed the Central Powers. While there were relatively few Turks, Bulgarians and Austro-Hungarians residing in Queensland, Germans and their descendants constituted a major segment of the population. As such they were the most visible \"enemy aliens\".\nDespite initial calls for restraint, the release in 1915 of the Bryce Report on alleged German atrocities, the sinking of the liner Lusitania by a German U-boat and the growing casualty lists from Gallipoli, all contributed to hardening attitudes against Germans and other former residents of the Central Power countries. As a precautionary measure, suspicious enemy alien military reservists were incarcerated in the Enoggera Internment Camp from September 1914, while non-reservists were registered and released on parole. The process of internment was selectively widened to embrace Lutheran pastors and other influential leaders of the German community. The steadily growing number of internees ultimately led to the closure of Enoggera in April 1916 and the transfer of 325 enemy aliens south to Holsworthy on the outskirts of Sydney. They would be joined there by others as a curious social phenomenon took hold on the Queensland home front.\nWith hostilities on the far side of the world, propaganda and a determination to contribute to the Allied cause resulted in the manufacture of war within Australia itself. Towns and street names of Germanic origin were altered to make them more \"British\", while many people of direct British descent became ultra-loyalists, seeking out the \"enemy\" wherever they could be found. Their activities were reinforced from February 1916 by Commonwealth legislation which classified even the Australian-born as \"aliens\" if they had fathers or grandfathers born in a hostile country. Nor did naturalisation necessarily provide any protection as it was not recognised beyond Australian shores and came to mean little within.\nAs Jurgen Iwers of Mackay found, applying for naturalisation was itself fraught with danger. Iwers was provided with a good character reference by local police only to become the object of suspicion when a horse was shot dead near his property. A subsequent police raid uncovered prohibited firearms and ammunition, with the Commissioner of Police concluding that Iwers was \"a dangerous man\" and recommending his internment.\nOthers were watched closely by their \"British\" neighbours who sought any evidence of disloyalty. Even the famed \"Beachcomber\" of Dunk Island, Edmund Banfield, was not immune from the prevailing war psychosis. In December 1915 Banfield informed the Under Secretary for Home Affairs that a German named Henschel was preparing to purchase 300 acres of land on adjacent Clump Point, the frontage offering commanding views of the coast. Although conceding that Henschel appeared to be \"a decent sort\", Banfield reminded the Under Secretary of the \"perfidy of the race and its duplicity\", suggesting that the sale should be blocked. It was, and Henschel was interned.\nIn the Boonah district of South-East Queensland police investigated claims that German farmers were stockpiling gold and silver to aid their homeland, an allegation soon found to be patently false. The mere presence of enemy aliens was also held to be an important factor in falling enlistment rates, and loyalist bodies such as the Kedron Recruiting Committee in Brisbane argued that \"persons of enemy origin\" should \"pay a special War Tax\". Under the provisions of the War Precautions Act authorities seized company shares held by enemy aliens, including those of 85-year-old C Reese of Fortitude Valley, who had been resident in Australia since 1852.\nIdle chat put many at risk. At the Leyburn Cheese Factory Australian-born William George Greisheimen innocently remarked to a fellow milk supplier in December 1914 that with hostilities underway \"I am afraid England will have a rough time of it\". His comments were reported to military authorities, who ordered local police to investigate. Constable John Reed found no evidence of \"disloyalty\".\nAs the archival records show, there were occasions when the Queensland Police and the Queensland Government sided with enemy aliens against vindictive loyalists. Demands to purge the Queensland Public Service of all enemy aliens were unsuccessful, largely owing to the sheer number of the people involved. In January 1916, 65 \"Germans\" were serving police officers, while another 192 were employed on the railways. No distinction was made, however, between the naturalised, non-naturalised or Australian-born.\nOwing to their homelands being under the control of belligerent nations, Syrians and Poles were among other ethnic groups caught up in the home front conflict. Their numbers, however, were relatively insignificant. Bulgarians and Turks were similarly few in number: in November 1915 authorities identified just 14 Bulgarians residing in Queensland. Yet, such was the prevailing fear that Bulgarians and Turks were arrested and interned, later being transferred from Enoggera to Holsworthy in April 1916.\nAfter the war many of the internees were deported to their country of origin, including the most prominent internee of all – Eugen Hirschfeld, the honorary German consul to Queensland. A gifted medical man and naturalised British subject, Hirschfeld moved in society's highest circles and on the eve of the First World War he was appointed to the Queensland Legislative Council, a position from which he felt obligated to resign after the outbreak of the war. Unfortunately, Hirschfeld was an ardent advocate for the maintenance of German language and culture, contributing in no small measure to his persecution.\nVery few women and children were interned, as authorities found it cheaper to pay the wives of internees 10 shillings per week, with an additional 2/6d per week for each child under 14 years of age, leaving these families in poverty.\nUntil 1917 it was possible to escape increasing persecution by fleeing to the United States of America, which was also a destination for deportation. However, the United States was not always willing to accept deportees, such as strike leader Paul Freeman. The origins of Paul Freeman are obscure: at different times he claimed to be either American or Canadian. His guttural accent suggested that he was German. Freeman was also a member of the proscribed radical labour organisation, Industrial Workers of the World (IWW), foreign-born members of which had already experienced incarceration and deportation. In January 1919 Freeman was arrested at his lonely prospecting camp near Cloncurry and taken under armed guard to Sydney, from where he was deported to the United States. The Americans refused entry and Freeman was sent back to Sydney. The Australian Government authorities tried again – with the same result: Freeman was finally deported to Rotterdam in the Netherlands.\nGerman Australians in the Australian forces\nDespite the concern about Germans and German descendants in Australia, many German Australians were very loyal to Australia and enlisted in the Australian armed forces. Some attempted to disguise their German heritage by adopting a more \"British\" name, often an Anglicisation of their German name. For example, Private John Jacob Bond enlisted in January 1916, using his step-father's surname Bond in preference to his own more Germanic surname Funk. He also listed his mother as his next of kin as simply \"Mrs S Bond\" avoiding the use of her Germanic given names Matilda Augusta.\nSee also\n* List of Australian place names changed from German names\nReferences\nAttribution\nThis Wikipedia article was originally based on [https://web.archive.org/web/20160203060911/http://www.archives.qld.gov.au/Researchers/History/Pages/Treatment-of-Enemy-Aliens-in-Queensland-1914-1920.aspx \"Treatment of Enemy Aliens in Queensland 1914–1920\"] (March 2014) by Murray Johnson published by the State of Queensland under [https://creativecommons.org/licenses/by/3.0/au/ CC-BY 3.0 AU] licence (accessed on 3 February 2016, [https://web.archive.org/web/20160203060911/http://www.archives.qld.gov.au/Researchers/History/Pages/Treatment-of-Enemy-Aliens-in-Queensland-1914-1920.aspx archived] on 3 February 2016)."
    }
  ]
}