{
  "content": [
    {
      "type": "text",
      "text": "# Engfa Waraha\n\n| birth_place      = Uthai Thani, Thailand\n| other_names      = Mook\n| occupation       =\n| years_active     = 2018–present\n| height           = 1.70m\n| title            = Miss Grand Thailand 2022\n| competitions     =\n| website          =\n}}\nEngfa Waraha (, , ; born February 15, 1995) is a Thai musician, beauty pageant titleholder and actress.\nShe appeared in the seventh season of The Voice Thailand. In 2022, she won Miss Grand Thailand 2022 representing Bangkok. Later that year, she represented Thailand at Miss Grand International 2022, held in Indonesia on 25 October, where she finished as first runner-up.\nIn 2024, she starred in the movie The Paradise of Thorns, which broke the 150M baht box office record and earned her the Best Actress of the Year award at the 2025 Thailand Box Office Awards. Her performance and advocacy work gained international recognition, including an honor at the Red Sea Film Festival Foundation the Women in Cinema Gala held during the 2025 Cannes Film Festival. Her efforts also sparked important discourse around LGBTQ rights in Thailand.\nEarly life and career\nWaraha was born on 15 February 1995 in Uthai Thani province into a family of musicians; her father was a keyboardist and her mother was a luk thung (Thai pop-country) singer. She has 2 older sisters, Keytawan and Plaifa (also known as Daaddaew).\nSince she was born into a musical family, Waraha was able to learn musical skills from her parents, and began performing on stage at the age of six. Moreover, her acquaintance and closeness with hometown traditions since childhood inspired her to dream of becoming a Likay, as well as a Thai blessing ceremonial officiant (). At the age of 17, due to her father's terminal cancer, she signed a 12-year contract with the Bangkok-based artist management organ Sangravee Entertainment to pay for her father's cancer treatment, and released four singles; two in 2015 and the rest in 2016. Later in 2013, a year after her father's death, she had the opportunity to meet with a master of the Thai blessing ceremony Phonraphee Maneethai () who later persuaded her to study to be an officiant skill, as well as a Thai verse singing () until proficient enough to be able to use it for a career. In addition, before entering the national entertainment industry, she also worked as a waitress, greengrocer, food vendor, caddie, and model.\nWaraha became known as Engfa Sangravee after participating in the seventh season of the reality singing contest The Voice Thailand in 2018. She was eliminated in the knockout round, of the second phase of the contest. Since then, she has appeared in several TV programs, such as a guest appearance in the situation comedy Pen Tor and Raberd Terd Terng, as well as taking part in many game show programmes, such as 123 Ranking Show, Still Standing Thailand, and Guess My Age.\nPageantry\nIn 2020, Waraha entered the Miss Grand Suphanburi contest, a provincial preliminary pageant for Miss Grand Thailand, but withdraw due to contractual problems. She returned to pageantry in 2022 and won Miss Grand Bangkok 2022. She then went on to win Miss Grand Thailand 2022.\nShe also took part in Miss Grand International 2022 and was first runner-up.\nRecognition\nWomen In Cinema Spotlight\nIn May 2025, Thai actress Engfa Waraha was honored at the prestigious Women in Cinema Gala, hosted by the Red Sea Film Festival Foundation during the 2025 Cannes Film Festival. Held at the iconic Hôtel du Cap-Eden-Roc in Cap d’Antibes, the gala spotlighted seven women from the Arab world, Africa, and Asia who have made significant contributions to the film and entertainment industries.\nWaraha was celebrated for her breakout role as Meena in the 2023 television series Show Me Love, followed by acclaimed performances in Bangkok Blossom (2024) as Kulap and delivered a standout performance as Mo Jongyoi in The Paradise of Thorns (2024), The film was a major box office success and earned her the Best Actress of the Year award at the 2025 Thailand Box Office Awards, as well as a runner-up position for Best Actress at the 14th Thai Film Director Awards.\nHer growing body of work includes roles in Petrichor (2024) as Tul Chanwimol, along with appearances Unlimited Love and The Tipsy Mystery, further showcasing her versatility across genres.\nHer recognition at Cannes coincided with the announcement of her upcoming film Lady Bee, a cinematic adaptation of the Thai literary classic The Story of Jan Dara. The project is currently being marketed international by Mokster Films.\nWith her expanding filmography and critically recognized performances, Engfa Waraha is fast becoming one of the most compelling actress of her generation.\nThe Women in Cinema initiative, now in its third year, aims to celebrate female storytellers and creators who are redefining the film industry. Waraha’s inclusion marked a milestone for Thai representation on the global stage, alongside fellow honorees such as Elham Ali, Jacqueline Fernandez, Gaya Jiji, Amina Khalil, Rungano Nyoni, and Sarah Taibah.\nFilmography\nMovies\n{| class=\"wikitable sortable plainrowheaders\"\n|-\n! scope=\"col\" | Year\n! scope=\"col\" | Title\n! scope=\"col\" | Role\n! scope=\"col\" | Notes\n|-\n! scope=\"row\" | 2024\n| The Paradise of Thorns\n| Mo Jongyoi\n|\n|-\n! scope=\"row\" | 2026\n| Lady Bee\n| Khun Boonleung,Lady Bee\n|\n|-\n|2026\n|Mal\n|Malee\n|}\nTelevision series\n{| class=\"wikitable sortable plainrowheaders\"\n|-\n! scope=\"col\" | Year\n! scope=\"col\" | Title\n! scope=\"col\" | Role\n! scope=\"col\" | Notes\n|-\n! scope=\"row\" | 2023\n| Show Me Love\n| Meena\n|\n|-\n! scope=\"row\" rowspan=3 | 2024\n| Club Friday Hot Love Issue\n| Night\n|Episode Love Bully\n|-\n| Bangkok Blossom\nบางกอกคณิกา\n| Kulap\n|\n|-\n| Petrichor\n| Tul Chanwimol\n|\n|-\n! rowspan=\"2\" scope=\"row\" | 2025\n| The Tipsy Mystery\n| Ping\n|\n|-\n| Unlimited Love\n| Phlu\n|\n|-\n!\n| The Water\n| \"Nam\" Apo Wathinwanit\n|\n|-\n|}\nLady Bee at Cannes Film Festival 2025\nIn May 2025, Waraha was featured at the 2025 Cannes Film Festival, where her upcoming film Lady Bee was officially announced during the Cannes Market. Although Lady Bee was not part of the official screening line up, its unveiling generated significant buzz due to its bold narrative shift and the casting of Engfa Waraha. It directed by Rutaiwan Wongsirasawad and Thanika Jenjesda, the film is a feminist reinterpretation of The Story of Jan Dara, a Thai literary classic by Utsana Phloengtham. Waraha stars as Lady Boonleung, also known as Lady Bee, a character reimagined as the central figure in a narrative exploring identity, desire, and power.\nThe announcement coincided with Waraha’s recognition at the Women in Cinema Gala, hosted by the Red Sea Film Festival Foundation, which honored seven women from Asia, Africa, and the Arab world for their contributions to cinema. Lady Bee is scheduled to begin principal photography in late 2025, with a global release expected in 2026.\nAwards and nominations\n}}\n{| class=\"wikitable sortable plainrowheaders\"\n|+Name of the award ceremony, year presented, category, nominee of the award, and the result of the nomination\n|-\n! scope=\"col\" | Award\n! scope=\"col\" | Year\n! scope=\"col\" | Category\n! scope=\"col\" | Nominated work\n! scope=\"col\" | Result\n! scope=\"col\" class=\"unsortable\" |\n|-\n|Miss Grand Bangkok\n|2022\n|Miss Grand Bangkok\n|—\n|\n|\n|-\n|Miss Grand Thailand\n|2022\n|Miss Grand Thailand\n|—\n|\n|\n|-\n|Miss Grand International\n|2022\n|Miss Grand International\n|—\n|\n|\n|-\n| rowspan=\"2\" |TikTok Awards Thailand\n| rowspan=\"2\" |2022\n|Best Live Creator Ent. & Music\n|\n|\n|\n|-\n|Celebrity of the Year\n|\n|\n|\n|-\n| rowspan=\"2\" |Kazz Awards\n| rowspan=\"2\" |2022\n|Most Trending on Social Media\n|\n|\n|\n|-\n|Best Girl of the Year\n|\n|\n|\n|-\n|Kom Chad Luek Awards\n|2022\n|Best Female Artist - Cover Folk Music\n|\n|\n|\n|-\n| rowspan=\"2\" |TV Pool Stars Party Retire & Reborn\n| rowspan=\"2\" |2022\n|Celebrity of the Year\n|\n|\n|\n|-\n|Couple of the Year (Englot)\n|\n|\n|\n|-\n|The Idol Awards\n|2022\n|The Idol Award\n|\n|\n|\n|-\n| rowspan=\"3\" |Thairath Best Of The Year\n| rowspan=\"3\" |2022\n|Celebrity of the Year\n|\n|\n|\n|-\n|Entertainment News of the Year\n|\n|\n|\n|-\n|Couple of the Year (Englot)\n|\n|\n|\n|-\n|Sanook Top Of The Year\n|2022\n|Inspirational Woman of the Year\n|\n|\n|\n|-\n| rowspan=\"2\" |Beauty Queen College Awards\n| rowspan=\"2\" |2022\n|Queen of the Year\n|\n|\n|\n|-\n|Most Fans Favorite\n|\n|\n|\n|-\n|Maya TV Awards\n|2023\n|Charming Woman of the Year\n|\n|\n|\n|-\n|Kazz Awards\n|2023\n|Shining Star of the Year\n|\n|\n|\n|-\n|Sanook\n|2023\n|Most Talked About of the Year\n|\n|\n|\n|-\n|Miss Grand\n|2023\n|Grand Voice Award\n|\n|\n|\n|-\n|Siamrath Online Awards\n|2023\n|Couple of the Year (Englot)\n|\n|\n|\n|-\n|The National Council On Social Welfare Thailand\n|2024\n|\n|—\n|\n|\n|-\n|EFM Awards\n|2024\n|The Rival Couple of the Year (Engfa-Jeff)\n|\n|\n|\n|-\n|HOWE Awards\n|2024\n|Hottest Actress Award\n|\n|\n|\n|-\n|Thailand Headline Person Of The Year Awards\n|2024\n|Most Popular Actress in Thailand & China\n|\n|\n|\n|-\n|Daily News Awards\n|2024\n|D-Superstar Award\n|\n|\n|\n|-\n|Likay Festival Soft Power Awards\n|2024\n|\n|—\n|\n|\n|-\n|Nineentertain Awards\n|2024\n|\n|\n|\n|\n|-\n|Cinefile Audience Awards\n|2025\n|Best Leading Actress\n|The Paradise of Thorns\n|\n|\n|-\n|Sanook Top Of The Year\n|2025\n|Actress of the Year\n|\n|\n|\n|-\n|13th Thailand Social Awards\n|2025\n|Best Creator Performance on Social Media - Actor & Actress\n|\n|\n|\n|-\n|Thailand Box Office Awards\n|2025\n|Best Actress of the Year\n|The Paradise of Thorns\n|\n|\n|-\n||Thailand Box Office Awards\n|2025\n|Best Actress of the Year\n|Bangkok Blossom\n|\n|\n|-\n|4th The People Awards\n|2025\n|Popular of the Year\n|\n|\n|\n|-\n|Maya TV : Superstar Idol Awards\n|2025\n|Hot Star Female Idol of the Year\n|\n|\n|\n|-\n|14th Thai Film Director Awards\n|2025\n|Best Actress in Leading Role\n|The Paradise of Thorns\n|\n|\n|-\n|The Viral Hits Awards\n|2025\n|Best Yuri Couple of the Year (Englot)\n|\n|\n|\n|-\n|16th Nataraj Awards\n|2025\n|Best Actress in Leading Role\n|Bangkok Blossom\n|\n|\n|-\n| rowspan=\"2\" |Nineentertain Awards\n| rowspan=\"2\" |2025\n|\n|\n|\n|\n|-\n|Best Actress of the Year\n|\n|\n|\n|-\n|21st Kom Chad Luek Awards\n|2025\n|Best Actress in Film\n|The Paradise of Thorns\n|\n|\n|-\n|21st Baannang Klang Lakorn Awards\n|2025\n|Best Actress in Leading Role\n|The Paradise of Thorns\n|\n|\n|-\n|Kazz Awards\n|2025\n|People Of The Year\n|\n|\n|\n|-\n| rowspan=\"2\" |Thailand Y Content Awards\n| rowspan=\"2\" |2025\n|Best Leading Actress\n|Petrichor The Series\n|\n|\n|-\n|People's Choice Award\n|\n|\n|\n|-\n|Trust Gu Thai Film Awards\n|2025\n|Best Actress in Leading Role\n|The Paradise of Thorns\n|\n|\n|-\n| rowspan=\"2\" |FEED x Khaosod Awards\n| rowspan=\"2\" |2025\n|Girl Love Best Leading Actress\n|Petrichor The Series\n|\n|\n|-\n|Popular Actress of the Year\n|\n|\n|\n|-\n|Suphannahong National Film Awards\n|2025\n|Best Actress\n|The Paradise of Thorns\n|\n|\n|-\n| rowspan=\"2\" |HOWE Awards\n| rowspan=\"2\" |2025\n|Hottest Actress Award\n|\n|\n|\n|-\n|The 50 Influential People\n|\n|\n|\n|-\n|Thairath Best Of The Year\n|2025\n|Actor of the Year\n|\n|\n|\n|-\n|The Viral Hits Awards\n|2025\n|Best Leading Actress of the Year\n|\n|\n|\n|}\nReferences\nExternal links\n*\nAndrea Aguilera\n}}\nNi Ni Lin Eain\n}}"
    }
  ]
}