{
  "content": [
    {
      "type": "text",
      "text": "# English invasion of Scotland (1385)\n\n14,000 men\n| strength2   = Unknown\n| strength3   = Up to 2,500\n| casualties1 = Unknown\n| casualties2 = Unknown\n| casualties3 = Unknown\n| notes       =\n| campaignbox =\n}}\nIn July 1385 Richard II, King of England, led one of a long series of 14th-century invasions of Scotland. The campaign was retaliation for Scottish border raids but was also provoked by the arrival of an allied French army in Scotland in 1384. England and France were engaged in the Hundred Years' War, and France and Scotland had a treaty of mutual support. Richard had only recently come of age and was expected to emulate his father Edward the Black Prince's, and grandfather Edward III's martial success. The English nobility had an appetite for war but they disagreed on whether to invade France or Scotland. Richard's uncle, John of Gaunt, favoured France, which would gain him a tactical advantage in Castile, the throne of which he claimed through his wife, Constance. The King's friends—several of whom were also Gaunt's enemies—preferred Scotland as a target. The previous year's parliament had granted funds for a continental campaign; it was deemed unwise to ignore the House of Commons. Without funding, the Crown could not afford a campaign. Richard chose to summon the feudal levy, which had not been called for 58 years, and was never to be again. The summons caused uproar and was abandoned; the Crown raised troops the usual way, contracting with its tenants-in-chief to raise and arm their tenants and receive wages for doing so.\nRichard promulgated ordinances to maintain discipline in his invasion force, but problems beset the campaign from the start. One of Richard's knights was killed by the King's half-brother before the army reached Edinburgh. There, the leadership was divided and often occupied itself more with infighting than with campaigning. The Franco-Scottish army retired in the face of the English advance and refused battle, destroying provisions and infrastructure as they retreated. The English swiftly exhausted their food and other supplies. Little of military value was achieved, apart from burning private property. In late August the army withdrew to England. As it did, a Franco-Scottish force raided England from the West March, reaching Carlisle, and pillaging the region. Richard launched few military campaigns following this; his last, to Ireland in 1399, saw his deposition in his absence by Gaunt's son, Henry Bolingbroke, who became Henry IV.\nBackground\nBy the late 14th century, England had been at war with France for nearly 50 years. With outbreaks of plague and harvest failures, this strained the country's finances, which could not support a major campaign. Major garrisons in Aquitaine, Brest, Calais and Cherbourg required funding, but three of the four recent parliaments had refused the King grants. Following Richard II's 1377 coronation, facing a resurgent French Crown, many English continental possessions were lost. By 1385 the war had lost momentum; fighting predominantly took place through proxy wars, such as during the 1383–1385 Portuguese interregnum. Richard's chancellor and favourite, Michael de la Pole, Earl of Suffolk, was blamed for this lack of success and accused of appeasement. The historian Nigel Saul has suggested that \"military retrenchment was not so much a matter of choice for Chancellor Pole; it was forced upon him by circumstances\".\nKing Richard's other supporters, particularly the Earls of Nottingham and Oxford, had fallen out with the King's uncle, John of Gaunt, Duke of Lancaster, in 1384, leading to popular rumours that the Duke was to be assassinated during a tournament. The patronage they received from the King was viewed as \"lavish to the point of foolishness\", says Richard's biographer Anthony Tuck. Both Mowbray and de Vere, for example, had their own private apartments within the King's palaces at Eltham and Kings Langley.|group=note}} Gaunt was a powerful man, the richest in the kingdom after the King, but was not particularly popular: Saul describes him as \"too important to be ignored, and yet too unpopular to be able to carry many others with him\". The rift between Richard and Gaunt originated in differences over foreign policy. In December 1384 the royal council favoured a military expedition to Scotland, who had been allied to France against England since 1295. Gaunt (and his brother, the Duke of Gloucester), though, had favoured a continental campaign. The meeting collapsed into recriminations, and Gaunt departed angry. Following the rumours of his possible murder, Gaunt retired to Pontefract Castle, only obeying the King's summons to Westminster early the next year, and even then accompanied by a large and heavily armed retinue comprising his household bodyguard and armed tenantry.\nFrance was resurgent under Charles V's leadership, and by 1377 had regained much of the territory won by Edward III, particularly in the southwest. This threatened both English national pride and economic interests. In 1384, de la Pole announced a royal expedition, but avoided specifying its target. The choice was made for the Crown when the French sent Jean de Vienne, Admiral of the French Fleet, to Scotland with an army the following year with about 1,300 men-at-arms and 250 crossbowmen. This force would provide the Scots with technical assistance and encourage an invasion of England. In early June 1385, the Reading council decided in response that Scotland would be the young King's first campaign. The invasion was part of a general policy of responding harshly to breaches of the standing Anglo-Scottish truce; the English Anonimalle Chronicle says it was \"badly kept\" by Scotland, as the Douglases eroded English holdings north of the border. During this period truces could be flexible; the previous truce—between England, France and Scotland—had been negotiated in 1383. It was frequently broken; in April 1384 Gaunt led a ―a punitive raid characterised by pillaging and brutality, intended to both inflict economic destruction and damage morale―into south-east Scotland. This reached Edinburgh but no further.\nGaunt's preferred Scottish policy was peace―he had recruited Scotsmen into his retinue―mainly for personal reasons. Peace on the northern border would smooth the way for his preferred campaign in Iberia. He had been well treated by the Scots  in 1381, when the Peasants' Revolt broke out in England; they had given him refuge for ten days. Instead, they destroyed his palatial London townhouse, the Savoy.|group=note}} Gaunt's policy collapsed with de Vienne's forces arriving in Scotland. His pro-peace strategy was not necessarily poorly conceived: if successful, the northern theatre of war would have been neutralised, allowing England to refocus on France. According to the historian James Gillespie, Gaunt's proposal \"was a gamble, but a sensible gamble\". Their poor relationship influenced the King's rejection of Gaunt's strategy, while Norfolk's and Oxford's influence with Richard also ensured Gaunt's views were dismissed.\nThe journey north was one of several lengthy progresses—celebratory visits to regions with ceremonial processions through the towns—that Richard undertook during his reign,|group=note}} during which he left a caretaker government comprising the Mayor of London, the Archbishop of Canterbury, the Bishop of London, Lord Cobham and Sir Robert Knolles.\nThe French army in Scotland\nUnder their treaty with France, Scotland had reassurances that France would support her militarily in a war with England. Gaunt's attempts at furthering peace between England and Scotland did not suit France, which was, says the medievalist May McKisack, \"eager to profit by England's domestic embarrassments\". A French advance party reached Scotland in May 1384. Their arrival followed the fall of Lochmaben Castle, the last English outpost north of the border. The loss of this castle, says Anthony Tuck, left Cumberland \"more vulnerable than it had been for the past fifty years\". This provided justification for an English invasion of Scotland over France.\nThe French fleet under de Vienne left Sluys on 22 March 1385 and avoided the patrolling English ships. It arrived in Leith three days later with 1,315 men-at-arms, 300 crossbowmen and 200 unspecified others (\"gross varlets\" in the French records). The historian Jonathan Sumption estimates that \"with the usual hangers-on\" the army amounted to around 2,500 men. They brought horses, 600 suits of armour and other materiel for the Scottish army and 50,000 livres in gold florins for King Robert II. On 1 July, French and Scottish battle captains signed articles of agreement (in French)|group=note}} in Edinburgh outlining their campaign. These ordinances were highly detailed. Their campaign was to launch on 8 July. De Vienne intended to lay waste the entire English border, although, suggests Sadler, this goal was \"based on a total lack of understanding of the nature of marcher conflict\".\nEnglish preparations\n|group=note}}]]\nThe latest truce with Scotland was due to expire on 15 July 1385, and the English muster scheduled for the previous day indicates that the invasion was to be launched immediately. King Richard, nearly eighteen, saw the campaign as an opportunity to cast him as a conqueror of kingdoms in the mould of his father and grandfather. According to the historian Christopher Fletcher, it would show \"not just what a King would do but also what a man would do\", and Richard would demonstrate his royal independence. Anthony Goodman suggests that apart from the campaign's strategic necessity, its political purpose was to increase Richard's military prestige and political profile, and Sumption notes, \"the presence of the English King... proved to be a powerful recruiting agent\".\nOn 10 June, the army reached Nottingham, and was in York by mid-month where the first wages were distributed. The army, expected in Newcastle by the 14th, was nearly a week late. On 16 July suppliers in Durham, Yorkshire, Northumberland, Cumberland and Westmorland were instructed to follow the army \"with all victuals needful for maintenance of man and horse and to sell them to the army at a reasonable price for ready payment\". Towns along the route were instructed to \"bake and brew\" food and drink, while their market rights were suspended for the war's duration. A final muster occurred at Berwick.\nThe King's ordinances\nMilitary and naval ordinances were drawn up|group=note}} in Durham, drafted by Richard, Gaunt—as Steward of England—and Thomas Mowbray, Earl Marshal since 30 June,|group=note}} and several \"wise knights\". The ordinances were promulgated on 17 July.\n|salign=center| source =Maurice Keen, \"Richard II's Ordinances of War of 1385\" (1995) | align = left |quoted=yes| width = 25em | bgcolor = #FFFFF0 }}\nWhile disciplinary ordinances had military precedent in Christendom—being issued to the army of the Second Crusade in 1147 and several by Edward III in 1346—those of 1385 are the earliest complete code of English military discipline now surviving. Written in French, they comprise twenty-six clauses, codifying troops' behaviour during the offensive, for example, explicitly prohibiting rape and sacrilege. Clause three forbade soldiers:\n... or any woman, or to take prisoner any person not bearing arms, or to rape any woman, on pain of being hanged.}}\nThey provided practical instructions, such as reminding ships' captains to stay close to the flagship in storms and guidance on punishments for soldiers' wrongdoing. They mandated that English soldiers wear the arms of St George, and that Scottish soldiers caught doing likewise should be killed.|group=note}}\nSuch ordinances were necessary to maintain discipline, particularly in an indentured army. Since armies were raised only for specific periods, it was impossible to drill martial discipline into troops as with a standing army. Medieval armies were recruited for a campaign season, often of only a few months, and then disbanded. As such it was impossible to ensure that men bound by previous regulations would be recruited again. The Crown preferred the mobility and reliability of paid, professional soldiers over an army of raised feudal tenantry.\nFeudal levy\nAnother problem inherent to warfare was financing. The parliament of November 1384 had granted the King a subsidy for a campaign against France rather than Scotland. The Commons' wishes, while unwritten, were to be respected by any king wanting good future relations with them. Parliament may have generally approved of de la Pole's foreign policy as a cheaper alternative to the frequent, heavy taxes required by Edward III. In 1385, Richard refused to use the Commons' grant, stating this to be his choice, not that of the Council. He planned a substantial invasion force, and it would have been one of the largest English armies of the 14th century, and the biggest raised during the Hundred Years' War. Although eventually smaller than Richard planned, it was still larger than most by contemporary estimates. An extant order of battle indicates around 14,000 men in the invading army, and Exchequer receipts record payment to over 12,000 men. With at least 142 captains present, the nobility brought larger armies to the King's host than the traditional feudal summons would have required of them.  |salign=center|source= Alastair J Macdonald, \"Border Bloodshed: Scotland and England at War, 1369-1403\" (2000)| width = 25em | bgcolor = #FFFFF0 | quoted = true }}\nAs the King had committed not to use the parliamentary subsidy, in June 1385 he resorted to the ancient feudal due of scutage―through the feudal levy―to raise funds. This was effectively a tax—originating in the 11th century—on those unable or unwilling to perform knight-service; they would pay the crown a lump sum instead of providing soldiers. It has been estimated that it could have raised around  while six-weeks' campaigning generally cost in the region of ., while those of 1373–1374 could have surpassed £58,000. \"Sums on this scale\", says Saul, \"were virtually impossible for the government to raise in the 1380s\". To give this some context, before the war the English Crown's entire annual income was often less than £30,000.|group=note}} Writs were sent to 56 tenants-in-chief on 13 June. They included a commission of array to the Bishop of Winchester which requested him to \"arm and array all abbots, priors, men of religion and other ecclesiastical persons of his diocese\". By bringing the power of the church to bear against Scotland—which, like France, supported the antipope, Clement VII—he hoped to gain Pope Urban VI's support against the schismatic Scottish church. This explains the deliberate targeting of religious houses during the campaign, unlike Gaunt's the previous year, which had spared monasteries.|group=note}}\nThe levy aimed to reduce expense by using the nobility as subcontractors and to avoid paying the typical bonuses or ransoms. It may have also served to reaffirm the levy as a viable mechanism. It had last been raised by Edward III in 1327, and even that had been the first for around 50 years. Richard's summons ensured, however, that the Crown maintained its claim to feudal service. Sumption has questioned whether it was ever intended to be followed through with, however, suggesting that it could have been \"a prelude to a round of horse-trading\". In the event, the levy caused such uproar that it was abandoned, with Richard denying in parliament that he had ever intended to enforce scutage. Sumption's suggestion of horse trading is based on the fact that at this point his captains then waived their right to bonuses and ransoms. Although never enacted, this was the final summons of the feudal levy in English history. Richard may have sought publicity from the summons, reminding his subjects that he was not just the Black Prince's son but Edward I's great-great-grandson. Men would serve, and to serve not merely  (because they owed service) but  (because they owed allegiance).\nThe final army, therefore, was recruited through bastard feudal relations, mustering in Newcastle under financial contract rather than tenurial bonds.|group=note}}\nCampaign\nThe campaign began poorly, even before reaching the border. In July, Ralph Stafford—son and heir of Hugh, Earl of Stafford, and a household knight—was murdered between York and Bishopsthorpe by the King's half-brother, the Earl of Huntingdon. It may have been an act of revenge for the killing of Huntingdon's squire by one of Ralph's retinue during a scuffle. The historian Carol Rawcliffe argues the affair threatened the entire campaign; it drew significant commentary. Huntingdon fled into Lancashire, while Richard angrily demanded that Huntingdon be hunted as a common killer.\nMore positively, the King and Gaunt reconciled on the journey north. Reaching Durham on 20 July, the Duke dined with the Earls of Nottingham, Oxford and Salisbury. Before entering Scotland, Richard made his uncles Edmund and Thomas dukes of York and Gloucester and de la Pole Earl of Suffolk. While Richard was nominally in charge, Gaunt likely held material command, given his military experience and connections in Scotland,. In contrast, the King lacked experience of personal command, relying instead on trusted councillors.\nThe army included most of the English nobility. Gaunt, Gloucester and Nottingham commanded the vanguard; the Earls of Arundel and Warwick held the central battle, under Richard while Lords Clifford and Neville brought up the rear. Gaunt's son, Henry Bolingbroke, Earl of Derby, brought a retinue. Gloucester brought 400 men-at-arms and 800 archers. Arundel and Nottingham brought nearly 200 men-at-arms and 300 archers between them, while Warwick led around 120 of the former and 160 of the latter. Sir Henry Percy, son and heir of the Earl of Northumberland, brought 60 men-at-arms and archers, half of whom were  (men not from the East March).|group=note}} Oxford and the Bishop of Durham, crozier in hand, brought substantial contingents. But these combined forces of over 2,000 men were still outnumbered by Gaunt's force of around 3,000. The King's household officers commanded about 10% of the host—450 men-at-arms and 500 archers—from both the civil service (departments including the Chancellor, Treasurer and the Keeper of the Privy Seal) and the household (its Secretary, Steward, Chamberlain and the Controller of the Wardrobe). The army also included members of the Queen's Household (for example, Henry Burzebo and Henry Hask, both of Bohemia), as well as Spaniards and Welshmen. They bore 38 royal standards, over 90 bearing the arms of St. George while the flag of St Cuthbert—patron saint of the Palatinate of Durham—was carried before them. Ultimately, Richard led an army of about 14,000 men from nearly every peer of England, two-thirds being archers.\nFranco-Scottish preparations\nKing Robert also issued military ordinances. These, says the medievalist Anne Curry, contained \"clauses unique to the circumstances of a joint Franco-Scottish force\". The French encountered several difficulties with their hosts from their arrival. They planned immediate border raids, but the Scots were uncooperative. It was not until 8 July that the two armies went south from Edinburgh, raiding Northumberland in expectation of the English army's imminent arrival. The French soldiers wore black surcoats with white St Andrew's crosses, as probably did the 3,000 Scottish soldiers also. It may have been the first time Scottish soldiers wore what became the national emblem. Crossing the Tweed, comments Sumption,\n}}\nDe Vienne led the French army, while the Scots were under James, Earl of Douglas, supported by his cousin Archibald, Lord of Galloway, King Robert's son Robert, Earl of Fife, Sir William Douglas of Nithsdale and George Dunbar, Earl of March, each with a retinue. They captured and slighted―damaged sufficiently to prevent further practical use―the castles of Cornhill and Ford. At Roxburgh Castle, an assault was considered but rejected due to its near-impregnability. While it had been a target for Scottish armies throughout the Middle Ages, de Vienne was not anxious to endanger his knights. He insisted that if the castle was taken, it would be a French prize; these terms were unacceptable to the Scots. This disagreement over Roxburgh effectively ended Franco-Scottish cooperation. Roxburgh may have been deemed impregnable; Wark Castle was a different matter. Wark was in severe disrepair following many years of neglect and previous Scottish attacks. When Scottish leaders declined to participate in an assault, the French attacked Wark alone. After two days of bitter fighting the castle fell, mainly due to French crossbowmen and hand-to-hand fighting on the walls. The garrison was killed, the captain held for ransom, and outbuildings razed. Relations between the allies, already strained after Roxburgh, were now irretrievable. The armies separated: the Scots returned over the border while the French, with the Earl of Douglas, continued into Northumberland, sacked English-held Berwick—although in Scotland, at the junction of the Tweed and Teviot valleys, this was one of the most important English enclaves—and invaded Northumberland, reaching as far as Morpeth. In late July, receiving word of Richard's arrival in Newcastle with a large army, they retreated to Edinburgh. Wark's capture remained the Franco-Scottish alliance's sole notable victory.\nEnglish invasion\nThe army arrived at Berwick in late July and on 6 August crossed into Scotland. The English immediately faced food shortages. No supply train had been established and the populace had fled, taking their supplies and burning all else. The Scots killed English stragglers and foragers when they caught them. The abbeys of Dryburgh, Melrose and Newbattle were burned on the basis of Scotland's support for the Antipope. French support for the antipopes, agrees Goodman, \"did add a political dimension\" as claimed by the Westminster chronicler. Both Melrose and Dryburgh had recently petitioned Clement, rather than Urban, suggesting where their loyalties in the Schism lay. The destruction of religious houses was not universally acclaimed: \"even the patriotic chronicler Walsingham\", says Macdonald, \"lamented the destruction of Melrose\".|group=note}} Later royal proclamations claimed these abbeys were legitimate targets for the support they provided the Scottish army. According to the chronicler Henry Knighton, Richard originally left Melrose unmolested—\"moved by mercy and by reverence for God and Church\"—but when the soldiers he had billeted there were murdered, the abbey was burned in retaliation. Most contemporary chroniclers considered the destruction as terrorism.\nArson was not prohibited under the ordinances, and much of Lothian was razed. The English reached Edinburgh on 11 August, finding it deserted except for a garrison at the castle. Civilians had fled and the Franco-Scottish army retreated via Ettrick Forest to the south. The city was sacked and burned. The medievalist Richard Oram notes that this has led previous generations of Scottish historians to condemn England's \"wanton vandalism\"; the 19th-century antiquarian Robert Chambers, for example, lamented how Edinburgh \"suffered its full share of calamities attendant upon these disastrous wars\". Musselburgh Hospital was severely damaged, while St Giles' Kirk was so badly damaged that it had to be rebuilt. English strategy, says Saul, was to be their traditional one: \"to draw their adversaries into battle at the earliest opportunity and to crush them by sheer weight of numbers\". The Scots refused the bait, withdrawing into the hillsides, living off the land and leaving little for the English army to forage. The French disapproved of this withdrawal strategy, preferring, like the English, the honour and glory of the pitched battle, although De Vienne recognised the Scottish policy as the most effective. The English army devastated much of Lothian while foraging, compounded by the Scots' scorched earth policy. The English army showed little quarter, often summarily executing prisoners rather than the more usual practice of ransoming them.\nSuch brutality may have been on the King's command. While in Edinburgh, he learned of the death of his mother, Joan, Countess of Kent, to whom he was very close. while her ODNB biographer, Richard Barber, suggests the 14th. Contemporaries speculated that she had died of grief at the quarrel that had suddenly blown up between her sons Richard and Huntingdon over the death of Hugh Stafford.|group=note}} With the city burning—including St Giles'—only Holyrood Palace escaped among the major buildings. Gaunt may have ordered it spared, as he had received lodging and hospitality in 1381. According to the chronicler Andrew of Wyntoun, the English army was given \"free and uninterrupted play [for] slaughter, rapine and fire-raising all along a six-mile front\". The Scots watched \"impotently\" from the castle walls, says Sumption.\nEnglish internal strife\nIndecision arose among the English captains on whether to proceed or withdraw. Divisions between Richard and his uncle, superficially healed at Durham, re-emerged. Food scarcity, combined with rumours of a Franco-Scottish incursion into the West March, rapidly escalated discontent. Disease and hot weather exacerbated the situation. Disagreement within the English leadership was also worsened by jealousy and distrust between Gaunt's and Richard's retinues, probably explaining chroniclers' confusion as to events. When Gaunt suggested advancing deeper into Scotland, Richard rejected it (probably, says Goodman, on the \"reasonable logistical grounds that victuals were scarce and it was likely to lead to starvation among the common soldiers\"). The Westminster Chronicle reports Richard harshly criticised the Duke, saying \"many shameful things\", even accusing him of treason. When the King declared that he would retire south with his men, Gaunt replied, \"but I am one of your men\"; Richard retorted, \"I see no evidence of that\".\nThe chronicler Jean Froissart—who had spent many years in Edward III's court and knew several of the leading men of Richard's Guilhem Pépin tempers this, positing that while narrative sources such as Froissart should be treated with caution, \"being systematically hyper-critical may lead us to forget that Froissart gives us much valuable information\".|group=note}}—says that Gaunt advocated crossing the Pennines to intercept the Franco-Scottish force thought to be in Cumbria. The other main source for these discussions, the Westminster Chronicle, supports the view that Gaunt wanted to advance into Scotland. Saul argues that this chronicler's report should be considered \"dubious\" as it was based on a source clearly biased against Gaunt, preferring Froissart's account. Oxford worsened relations by telling the King that Gaunt proposed this manoeuvre hoping that Richard would die during the hazardous journey. Consequently, Richard told Gaunt if he wanted to follow de Vienne, he would do so alone.\nEnglish withdrawal\nThe King chose to return to England. Richard's rejection of Gaunt's advice may have been wise, if, as the historian Anthony Steel suggests, Gaunt planned to \"fling himself into the Highlands in a hopeless search for the enemy\", a strategy that had achieved little in his 1384 campaign. Perhaps Gaunt recognised this himself, as he did not pursue the strategy. The King seems to have been particularly concerned for the well-being of the troops, telling his uncle that \"though you and the other lords might have plenty of food for yourselves, the rest, the humbler, and lowlier members of our army, would certainly not find such a wealth of victuals as would prevent their dying of hunger\". As Saul puts it, \"the English... had no enemy to fight and no food to eat. Increasingly hungry and frustrated, they took what revenge they could.\"\nWith little accomplished except the extensive destruction of property, the commanders agreed on a withdrawal to start around 17 August. Before departure, Richard and Gaunt yet again reconciled. Young Henry Percy—now nicknamed Hotspur by the Scots for the speed and aggression of his attacks—guarded the army against several flank attacks. Three days later, the King reached Newcastle. The army, presumably travelling behind him, disbanded when it got there.|group=note}} Within the fortnight he was in Westminster. Protection of the north was left to Percy, his 1,200-man retinue and the garrisons of Carlisle and Roxburgh.\nFrench counter-attack and Franco-Scottish divisions\nReports of a Franco-Scottish raid into the northwest proved true; with the English departure they could counter-attack. Crossing the undefended border around 15 August, they plundered Cumberland. The invaders approached Carlisle,  from the border around the same day. The Douglases, de Vienne and \"the whole youth and flower of Scottish chivalry\" approached across the Solway Firth. Douglas of Nithsdale invested Carlisle with a small force and distinguished himself. The main army penetrated further into Cumberland, reaching and passing Penrith―the furthest a Scottish raid had penetrated into England in decades. They then returned north—according to Sumption, \"bowed beneath the weight of their loot\"—joining the siege of Carlisle on 7 September, deploying French cannon. The walls were old and weak, but the experienced garrison repelled several assaults. Attacks on strongholds like Carlisle indicated aims beyond mere border raiding. The siege was raised by Hotspur, attacking from across the Pennines, although Knighton claimed that Scots withdrew in panic after the Virgin Mary appeared above the walls.\nThey made their way back to Scotland through the lowlands, perhaps contemplating a renewed attempt at Roxburgh. While the Franco-Scottish army gained significant plunder, they achieved little militarily. Froissart—with what Sumption calls \"calculated ambiguity\"—claimed they had won more than the Kingdom of Scotland possessed. Cumberland's devastation led to reduced taxes of £200 the following year, in acknowledgement of \"the great mischiefs and destructions\" the county had incurred.\nThe French and Scottish captains' differing approaches reflected their war experiences. Nicholson has suggested that \"in this type of warfare there was little room for French knights\". Correspondingly, argues Sumption:}}\nNeither's strategy was compatible with the other, leading to mutual hostility. Relations further soured from the contempt of the French knights for their hosts. The French had been told that Edinburgh was a Paris of the north, but were unimpressed to find only the castle, cathedral and about 400 houses. They were dismayed at the \"primitiveness\" of both the land and the people, as well as the King himself. While Froissart's portrayal of Robert as \"no valiant man, but one who would rather remain at home than march to the field\" has been rejected by modern scholarship, the French considered his subjects savages, lacking the courtesy and chivalry they held so highly. They found much to complain about, ranging from the size of their lodgements and the hardness of the beds, to the quality of the provisions and the lack of good wine. Relations worsened when the knights, as was customary, sent their servants out to forage from the land and villages. This went down poorly with the locals, who often retaliated, sometimes killing the Frenchman. When the Scots did trade with them, the French complained of being overcharged exorbitantly. Froissart claimed that only Douglas and Moray regularly visited de Vienne, and that Robert never ventured from what the chronicler called , the King's Gaelic heartlands in the west. Froissart also suggested that the Scots deliberately delayed their attack on England to extort even more money from their allies. Though French commanders considered wintering in Scotland and continuing the campaign the following year, poor relations prevented future cooperation.\nFor the Scots, says Sumption, \"the resentment was mutual\". The French were considered foreigners, unwilling to speak the language, who damaged crops by riding warhorses several abreast. Although the Scottish leaders—the King and his lords, such as the Earls of Douglas and Moray—respected the French as peers, the acrimony over the Wark Castle had worsened already poor relations. Even after the English withdrawal, the Scots refused to allow de Vienne to leave when his army did in early October. He was held hostage until the Scots received a substantial sum in compensation for the damage caused by French knights and departed in November 1385. McKisack posits that when he eventually left, it \"was less due to English activity than to French distaste for living conditions in Scotland\": de Vienne later described the country as containing nothing but \"wild beasts, forests and mountains\".\nPrisoners\nThe campaign was short yet bloody, mainly consisting of ambush and guerrilla tactics, with some small battles fought by Douglas of Nithsdale and Hotspur. Despite giving no quarter in Scotland, the English took prisoners at the siege of Carlisle. The Percies captured Paton Herring, who was later described in the Exchequer roll as \"Patron Heryng, a Scotsman, whom the Earl has in Alnwick Castle as prisoner\". They still held him in November the following year when the Crown sought to gain his keeping. Herring was sufficiently important a figure to be worth the Crown paying Percy .|group=note}} Several senior French knights were held in Carlisle Castle. Among them was Hennequin du Bos, who assisted his captors by advising how much ransom they could expect for his comrades. He chose  (\"to become English and to take the part of the English\", as the French judicial record notes), and became an English spy in Calais detailed to undertake intelligence work against the fleet then being assembled at Sluys.|group=note}}\nAftermath\nin 1385, from an illustration in Froissart's \"Chronicles\"|alt=Contemporary illustration of de Vienne's attack on Wark Castle]]\nOn Richard's departure, Gaunt stayed north to oversee a Scottish truce. Although this had been brokered in September, it did not come into effect until 24 October. This was intended to last until 31 May 1387. His and the King's relationship was worse than ever. Alienating Gaunt was unwise on Richard's part, as Gaunt would later fail to support him when Richard came into conflict with his barons. The 1385 expedition to Scotland had left the south coast of England vulnerable to French attack, and a French fleet was assembling at Sluys—then in the County of Flanders, part of the Duchy of Burgundy—that same year. Although the widely expected French invasion did not materialise, the continuing threat cast a pall over the parliament which assembled in October 1386. The prevailing sentiment was anger, both at Richard's attempt to reintroduce scutage and the extravagant largesse bestowed by the King upon de la Pole and his other favourites. Such was the indignation of both the Lords and the Commons that—\"with one mind...complaining grievously\", states the parliamentary record—de la Pole's impeachment was sought as a prerequisite to the expected royal request for funds.\nGaunt's ambitions returned to Iberia, in which he had had interests ever since his marriage to Constance of Castile, daughter and heir of King Peter, and by whom Gaunt had a claim to the Castillian crown. By now, Peter was long dead, and his crown was being fought over in a civil war. In late 1385, Gaunt was persuaded by the news of the crushing Castilian defeat at Aljubarrota that he should enter the dynastic contest. The following year, he took an army to enforce his claim. His absence from England upset the balance of power in English politics, and he could use neither his wealth nor his retinue in defence of his nephew the King when the attacks of the 1386 parliament came. In March 1386, eager to be rid of Gaunt, Richard recognised him as King of Castile and advanced him a loan of 20,000 marks|group=note}} for his campaign. Gaunt was not to return to England for another three years, and Richard took advantage of Gaunt's absence to advance his favoured courtiers further; for example, de Vere was promoted to Duke of Ireland, the first time a dukedom had been bestowed outside the immediate royal family. This further fuelled discontent among other members of the nobility. By October 1386, the political crisis was apparent to all.\nLater events\nThe ordinances that King Richard issued before the campaign were later the basis of those issued by Henry V before his 1415 French campaign. Although Henry's contained nearly twice the number of clauses as Richard's, twenty out of Henry's first twenty-three were copies from 1385. A similar summons was used by Henry VII in 1492 to raise the army that briefly invaded Brittany. Ordinances issued in 1585—when Elizabeth I ordered the invasion of the Low Countries—were modelled on those of 200 years earlier.|group=note}} Richard's ordinances provided a model for these later summonses and, says the medievalist Maurice Keen, \"remained the principal means of recruitment of royal hosts, and influenced the regulation of armies even longer\".\nFor the Scots, they had established the low value of their relationship with France. They would never again embark on such close coordination with their erstwhile allies, choosing instead to fight opportunistically rather than when called upon or when continental events dictated. John Sadler argues that the alliance's failures \"had achieved that which English diplomacy had failed to do—they had they had driven a clear wedge between the French and the Scots\". The French also weighed their allies and found them wanting; in a later report to the French royal council, de Vienne said they had erred in overrating their allies. He concluded that the whole country was worth less, in his view, than a minor French principality such as Savoy.\nRichard maintained his plans for military success abroad. He planned, albeit without fruition, another invasion of Scotland in 1389. Complaints persisted through Richard's reign that the Scots violated the truce. Anglo-Scottish truces were subject to regular breaches, many of them never recorded; even in a time of truce, there was a perennial atmosphere of conflict, with local raids the norm. The truce was renewed in 1389 and again ten years later. Richard's subsequent foreign campaigns were in Ireland in 1394 and 1399. During the latter invasion he was deposed by Gaunt's son, Bolingbroke—whom Richard had dispossessed of his inheritance after Gaunt died—and who took the throne as Henry IV.\nHistoriography\nWhether the King's campaign was considered a success depends on which of his priorities are considered. Historians often view it as a failure; G. L. Harriss calls it \"ignominious\" and McKisack, \"inglorious\", while Gillespie argues that it had \"failed to live up to the careful preparations\" which had preceded it, spending as it did less than a fortnight in enemy territory. Alastair Macdonald suggests an important feature of the campaign was its indecisiveness. Tuck argues that if considered more in the nature of a punitive raid, it was probably a success: the Scots were forced to accept repeated truces. This, says Steel, was a far more positive result for the campaign than has generally been accepted, considering \"southern Scotland had been wasted so effectively that there was no more danger from the north\" for much of the remainder of the century. Sadler suggests that the Scots were no more successful than the English had been. Their raids had been repelled, their capital city destroyed and their alliance with France exposed as a chimera. For the English, he suggests that the King's \"lumbering host had done almost as much damage in England as it had in Scotland and the marchers may well have considered the price of royal intervention too costly by far\". Macdonald also argues that Richard's expedtion had a secondary, punitive purpose: to punish the Scots when he could not defeat them. Gillespie has highlighted the King's character traits that the 1385 campaign revealed. The  to Edinburgh, he suggests, indicates \"a headstrong ruler determined to exact vengeance on the Scots\" although he also later made Melrose Abbey a grant towards its rebuilding. Similarly, Richard's concern for the well-being of the ordinary soldiers is, he says, an early indicator of the \"remarkable concern... that would later endear the King to his Cheshire guard\". Tuck, too, has remarked upon Richard's \"unusual sensitivity\" and compares it to similar empathy demonstrated towards the rebelling peasants of 1381. Professor Peter Stone credits Richard's ordinances as one of the earliest examples of cultural property protection in war, particularly referencing its protection of religious buildings.\nRichard's main problem in the aftermath of the campaign was popular perception, which saw a large army and great expense but which resulted in few material or political gains. More positively though, the campaign revealed the King to have \"a grasp of strategy and the will—perhaps even the courage—to carry it out\". While the campaign may have had successful aspects, Richard had failed to live up to the image of the successful warrior princes as epitomised by his father and grandfather as had been intended. The war had ended in stalemate, and ultimately had exposed Richard's financial and military impotence.\nNotes\nReferences\nBibliography\n*\n*\n*\n* 1328–1385)|last=Barber|first=R.|date=2004|doi=10.1093/ref:odnb/14823|archive-url=https://archive.today/20250528093542/https://wikipedialibrary.wmflabs.org/?next_url=/ezproxy/r/ezp.2aHR0cHM6Ly93d3cub3hmb3JkZG5iLmNvbS9kaXNwbGF5LzEwLjEwOTMvcmVmOm9kbmIvOTc4MDE5ODYxNDEyOC4wMDEuMDAwMS9vZG5iLTk3ODAxOTg2MTQxMjgtZS0xNDgyMz9yc2tleT1HWnpCTkomcmVzdWx0PTE-|archive-date=28 May 2025|url-status=live|access-date=28 May 2025|website=Oxford Dictionary of National Biography|publisher=Oxford University Press|url-access=subscription}}\n*\n*\n*\n*\n*\n*\n*\n*\n*\n* 1150–1500: Essays in Honour of Michael Prestwich|year=2008|pages=214–249|publisher=Boydell Press|location=Woodbridge|isbn=978-1-84383-389-5|chapter=The Military Ordinances of Henry V: Texts and Contexts}}\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n* #\n*\n*\n* 1404), Historian and Poet|last=Jones|website=Oxford Dictionary of National Biography|publisher=Oxford University Press|first=M.|date=2004|doi=10.1093/ref:odnb/13529 |archive-url=https://archive.today/20250527175210/https://wikipedialibrary.wmflabs.org/?next_url=/ezproxy/r/ezp.2aHR0cHM6Ly93d3cub3hmb3JkZG5iLmNvbS9kaXNwbGF5LzEwLjEwOTMvcmVmOm9kbmIvOTc4MDE5ODYxNDEyOC4wMDEuMDAwMS9vZG5iLTk3ODAxOTg2MTQxMjgtZS01MDE5NT9yc2tleT1jejZuS1AmcmVzdWx0PTE-|archive-date=27 May 2025|url-status=live|access-date=27 May 2025|url-access=subscription}}\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n* 1332–1400|pages=136–156|last=Oram|first=R. D.}}\n*\n*\n*\n*\n* }}\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*"
    }
  ]
}