{
  "content": [
    {
      "type": "text",
      "text": "# Enid–Pond Creek Railroad War\n\nThe Enid–Pond Creek Railroad War occurred in Oklahoma Territory between 1893 and 1894, and pitted the citizens of two United States designated county seats against the Rock Island Railroad.\nBackground\nIn the late 1880s, the Rock Island Railroad built a rail line into Indian Territory, entering near Caldwell, Kansas, and following the Chisholm Trail. Along the infrastructure, the company established railroad stations near a couple of the existing stage stations along the trail. The original stations, Round Pond, built at Pond Stage Stand on Round Pond Creek, and Skeleton Station (later known as Enid station), located in North Enid, Oklahoma near the Skeleton Ranch headquarters, would become involved in a controversy between the railroad, the new county seats, and the Department of the Interior.\nControversy\nThe troubles began when the United States Department of the Interior set about opening the Cherokee Strip (or Cherokee Outlet) to settlement. Hoping to lessen the problem of county seat wars—a common event in newly settled areas of the American Old West—the Department divided the strip into counties and assigned them county seats. They picked Pond Creek in \"L\" County and Enid in \"O\" County. Following the Interior Department's announcement of the official county seats, several citizens of the Cherokee Nation exercised their options to select their land allotments in the Outlet, and chose them at the two designated stores county seat town sites. Railroad officials were accused of conspiring with the Native Americans to speculate on town development, so officials in the Interior Department moved the government approved towns to different but nearby locations.\nA land run opened the Cherokee Outlet in 1893, and settlers, mainly from Kansas, occupied all four town sites; railroad Pond Creek, government Pond Creek, railroad Enid (North Enid), and government Enid (South Enid). The Rock Island responded to the government's action by refusing to stop trains at the government towns. Citizens in the government towns at first applied political pressure to get the railroad to provide service, and the Oklahoma Territorial government and United States House of Representatives backed them up. But the United States Senate took the railroad's side and refused to act. Government officials then notified the Rock Island that they had to furnish mail service to the two government towns. Rock Island responded by installing a hook to pick up and deliver mail, without slowing their trains. When the mail pouches broke open, citizens accused the railroads of purposely strewing their mail along the tracks.\nWith the stalemate in Washington, D.C., and intransigence by the railroads, citizens of both government towns began direct actions. Enid passed an ordinance setting a speed limit on trains passing through town; the Rock Island ignored it. Citizens in both government towns began attempting to flag down trains, placed dummies on the tracks, and then left wagons and debris across the rails.\nWith no relief from Washington or the railroads, citizens began further actions. In June 1894, citizens of Pond Creek tore up about a hundred yards of track and wrecked a freight train. No one was killed, but by then citizens of both South Enid and Pond Creek were taking potshots at trains passing through. By July citizens were placing bombs on the tracks, and, in the most drastic action of all, unknown persons sawed partially through a number of supports on the trestle near Enid, wrecking an unscheduled freight train preceding the scheduled passenger train.\nMen of the United States Marshals Service and troops from Fort Reno and Fort Supply were sent in to restore order and patrol the railroad right-of-way, but violence continued.\nFinally the U.S. Senate decided to move and on August 8, 1894, President Grover Cleveland signed an act (28 Stat. 263) requiring railroads \"to establish and maintain passenger stations and freight depots at or within one-fourth of a mile of the boundary limits of all town sites established prior to August 8, 1894, in said Territories.\"\nAftermath\nRailroad Pond Creek was renamed Jefferson and relocated to higher ground; government Pond Creek (often called Round Pond by the Rock Island) remained but the Grant County seat (formerly \"L\" County) was eventually moved to Medford.  Railroad Enid became North Enid; government Enid, or South Enid, became simply Enid, the county seat of Garfield County (formerly \"O\" County).\nSee also\n* Family feuds in the United States\nNotes\nBibliography\n*Chapman, Berlin B. \"The Enid 'Railroad War': An Archival Study\". Chronicles of Oklahoma 43:2 Summer 1965 126.\n*Lemon, G.E. [http://digital.library.okstate.edu/Chronicles/v022/v022p435.pdf \"Pond Creek History\"] . Chronicles of Oklahoma 22:4 Winter 1945 452-456. (accessed October 23, 2006).\n*Milam, Joe B. [http://digital.library.okstate.edu/Chronicles/v010/v010p115.html \"The Opening of the Cherokee Outlet\"] . Chronicles of Oklahoma 10:1 March 1932 115-134. (accessed October 23, 2006).\n*Stagner, Lloyd (editor). [https://web.archive.org/web/20060924014237/http://www.gptm.us/dispatcher/05_11.pdf \"Historian Recalls Enid, OK. Railroad Wars\"]. Great Plains Dispatcher 4:11 November 2005 3. (accessed October 23, 2006)."
    }
  ]
}