{
  "content": [
    {
      "type": "text",
      "text": "# Enoggera Reservoir, Queensland\n\n| local_map           = yes\n| zoom                = 11\n| pop                 = 33\n| pop_year            =\n| pop_footnotes       =\n| established         = 15 December 1990\n| postcode            = 4520\n| area                = 37.8\n| timezone            = AEST\n| utc                 = +10:00\n| lga                 = City of Brisbane(The Gap Ward)\n| stategov            = Cooper\n| fedgov              = Ryan\n| dist1               = 19.2\n| dir1                = WNW\n| location1           = Brisbane CBD\n| dist2               =\n| dir2                =\n| location2           =\n| dist3               =\n| dir3                =\n| location3           =\n| dist4               =\n| dir4                =\n| location4           =\n| near-n              = Jollys LookoutCamp Mountain\n| near-ne             = Upper Kedron\n| near-e              = The Gap\n| near-se             = Brookfield\n| near-s              = Upper Brookfield\n| near-sw             = Lake Manchester\n| near-w              = Lake Manchester\n| near-nw             = Mount NeboHighvale\n}}\nEnoggera Reservoir is an outer north-western suburb in the City of Brisbane, Queensland, Australia. In the , Enoggera Reservoir had a population of 33 people.\nGeography\nThe suburbs borders City of Moreton Bay to the north. It contains the neighbourhood of Peewee Bend ().\nHistory\nThe Enoggera Reservoir suburb is named after the Enoggera Dam. The name Enoggera is a corruption of the Yuggera word yauar-ngari meaning corroboree ground. The suburb was officially named and bounded on 15 December 1990.\nAs of 12 February 2011, sufficient water inflows returned the reservoir to usable levels, and water is now used to supply neighbouring suburbs. Prior to this the reservoir levels were insufficient for water supply, primarily due to the drought which was experienced by South-East Queensland prior to the January 2011 floods.\nDemographics\nIn the , Enoggera Reservoir had a population of 24 people.\nIn the , Enoggera Reservoir had a population of 25 people.\nIn the , Enoggera Reservoir had a population of 33 people.\nHeritage listings\nEnoggera Reservoir has a number of heritage-listed sites, including:\n* 30 & 50 Mount Nebo Road (): Enoggera Dam\n* 847 Mount Nebo Road (): Slab Hut Farm\nEducation\nThere are no schools in Enoggera Reservoir. The nearest government primary schools are The Gap State School in The Gap to the east and Mount Nebo State School in Mount Nebo to the north-east. The nearest government secondary school is The Gap State High School in The Gap to the east.\nReferences\nExternal links\n*\n*"
    }
  ]
}