{
  "content": [
    {
      "type": "text",
      "text": "# Enrique Edwards Orrego\n\n| birth_place  = Monte Águila, Chile\n| death_date   =\n| death_place  = Santiago, Chile\n| office       = Member of the Chamber of Deputies\n| constituency = 7th Departmental Grouping\n| term_start   = 25 April 1958\n| term_end     = 15 May 1965\n| nationality  = Chilean\n| occupation   = Politician, lawyer, business executive\n| party        = Liberal PartyNational Renewal\n| spouse       = María Angélica SilvaMaría del Pilar Rodríguez\n| children     = None\n| parents      = Lionel EdwardsEsther Orrego\n}}\nEnrique Edwards Orrego (31 July 1930 – October 2006) was a Chilean lawyer, politician, and business executive affiliated with the Liberal Party and later a founding member of National Renewal (RN). He served as Deputy of the Republic for the 7th Departmental Grouping, representing Santiago, during the legislative periods 1957–1961 and 1961–1965.\nBiography\nEdwards was born in Monte Águila on 31 July 1930, the son of Lionel Edwards Atherton and Esther Orrego Salazar. He married María Angélica Silva Escobar in Santiago in 1966, and later María del Pilar Rodríguez Subercaseaux on 5 May 1976. He had no children.\nHe studied at the Colegio San Gabriel, the Patrocinio de San José, and the National Boarding School Barros Arana (INBA). He later entered the Faculty of Law at the University of Chile, where he earned his degree.\nEarly career\nHe began his professional career at La Chilena Consolidada Insurance Company (1948–1949) and subsequently worked for the General Directorate of Pawn and Auction Credit (1949–1953), where he became a procurator in 1951. He served as Secretary-General of the Technical Cooperation Movement and the Industrial Convention. From 1955 onward he was manager of ASIMET, the Chilean Association of Metallurgical Industries. He also held executive positions at EMELCO S.A. (1959–1963), CIC S.A., Maderas Prensadas Cholguán S.A., and other companies in insurance, advertising, and cinema production.\nIn 1951 he attended the Berlin Congress as an observer delegate, visiting several European countries. Between 1954 and 1955 he studied in the United States as the first Chilean recipient of the Eisenhower Exchange Fellowship, conducting studies at Harvard University.\nPolitical career\nA lifelong liberal, Edwards served as president of the Federation of Secondary Students and, in 1949, ran as the Liberal Party's candidate for president of the University of Chile Student Federation (FECH). He was twice president of the Liberal Youth and served as its General Director and Councillor. In 1987 he was among the one hundred signatories of the founding act of National Renewal (RN).\nHe was elected Deputy in a complementary election for the 7th Departmental Grouping “Santiago,” 3rd District, replacing the late Fernando Rojas Wolff. He assumed office on 25 April 1958 and was re-elected for the 1961–1965 period, representing the 1st District. During his tenure, he served on the Permanent Commissions of Economy and Commerce, Health and Social Assistance, Interior Government, Finance, and Labor and Social Legislation. He also participated in several special committees, including those on Child Vagrancy (1959), the Central Unitaria de Trabajadores (CUT) (1961), the Dollar Issue (1962), and Constitutional Accusations (1962).\nIn 1961 he was appointed Delegate with the rank of Ambassador to the General Assembly of the United Nations.\nLater life\nOutside politics, Edwards was a prominent business leader and active member of civic institutions. He belonged to the 1st Fire Company of Santiago, the International Tennis Club, and the Club de Septiembre. He died in Santiago in October 2006.\nReferences\nExternal links\n* [https://www.bcn.cl/historiapolitica/resenas_parlamentarias/wiki/Enrique_Edwards_Orrego BCN Profile]"
    }
  ]
}