{
  "content": [
    {
      "type": "text",
      "text": "# Enterprise social software__disambig_1\n\nEnterprise social software (also known as or regarded as a major component of Enterprise 2.0), comprises social software as used in \"enterprise\" (business/commercial) contexts.  It includes social and networked modifications to corporate intranets and other classic software platforms used by large companies to organize their communication.  In contrast to traditional enterprise software, which imposes structure prior to use, enterprise social software tends to encourage use prior to providing structure.\nCarl Frappaolo and Dan Keldsen defined Enterprise 2.0 in a report written for Association for Information and Image Management (AIIM) as \"a system of web-based technologies that provide rapid and agile collaboration, information sharing, emergence and integration capabilities in the extended enterprise\".\nApplications\nFunctionality\nSocial software for an enterprise must (according to Andrew McAfee, Associate Professor, Harvard Business School) have the following functionality to work well:\n* Search: allowing users to search for other users or content\n* Links: grouping similar users or content together\n* Authoring: including blogs and wikis\n* Tags: allowing users to tag content\n* Extensions: recommendations of users; or content based on profile\n* Signals: allowing people to subscribe to users or content with RSS feeds\nMcAfee recommends installing easy-to-use software which does not impose any rigid structure on users. He envisages an informal roll-out, but on a common platform to enable future collaboration between areas. He also recommends strong and visible managerial support to achieve this.\nIn 2007 Dion Hinchcliffe expanded the list above by adding the following four functions:\n# Freeform function: no barriers to authorship (meaning free from a learning curve or from restrictions)\n# Network-oriented function, requiring web-addressable content in all cases\n# Social function: stressing transparency (to access), diversity (in content and community members) and openness (to structure)\n# Emergence function: requiring the provision of approaches that detect and leverage the collective wisdom of the community\nEnterprise search differs from a typical web search in its focus on \"use within an organization by employees seeking information held internally, in a variety of formats and locations, including databases, document management systems, and other repositories\".\nCriticism\nThere has been recent criticism that the adaptation of the social paradigm (e.g. openness and altruistic behavior) does not always work well for the enterprise setting, which led some authors to question the proper functioning of enterprise social software. The findings from a novel study suggests that free and non-anonymous sharing of trusted information (beyond marketing or product information) is significantly influenced by concerns from business users.\nSee also\n* Business Intelligence 2.0 (BI 2.0)\n* Collaborative software\n* Corporate social media\n* Enterprise bookmarking\n* Enterprise social networking\n* Semantic Web\n* Semantic wiki\n* SLATES\n* Social media use by businesses\n* Wikinomics\nReferences"
    }
  ]
}