{
  "content": [
    {
      "type": "text",
      "text": "# Envelope tracking__disambig_1\n\nEnvelope tracking (ET) describes an approach to radio frequency (RF) amplifier design in which the power supply voltage applied to the RF power amplifier is continuously adjusted to ensure that the amplifier is operating at peak efficiency for power required at each instant of transmission.\nA conventional RF amplifier designed with a fixed supply voltage operates most efficiently only when operating in compression.\nAmplifiers operating with a constant supply voltage become less efficient as the crest factor of the signal increases, because the amplifier spends more time operating below peak power and, therefore, spends more time operating below its maximum efficiency.\nBackground\nThe need for greater efficiency arises particularly as modulation schemes become more complicated and their peak to average power ratio increases. Older modulation schemes based on phase or frequency modulation with no amplitude information carried on the signal can use amplifiers that are driven into compression and offer high levels of efficiency. As of 2014 mobile communications basestations consumed ~1% of global electricity.\nIn contrast, many new communications systems from WiMAX to LTE do use amplitude information. The amplifier cannot be run into compression, because the amplitude information becomes distorted. These amplifiers can only achieve their peak efficiency on the peaks of the amplitude. The remainder of the time power is being dissipated unnecessarily.\nThus signals with a high peak to average power ratio mean that low efficiency levels are achieved, with the excess energy being wasted, ultimately as heat.\nVariable voltage\nEnvelope tracking adjusts the voltage applied to an RF power amplifier to deliver the power needed at that instant. Envelope information is derived from the IQ modem and is passed to an envelope tracking power supply to provide the required voltage. Envelope tracking powers supplies can be divided in two main categories: continuous and discrete trackers. Continuous trackers allow maximum performance in the RF power amplifier by keeping it continuously in compression as the signal envelope varies, but they come at the expense of linear and inefficient parts. Discrete trackers, such as the Power-DAC, quantize the envelope at discrete voltage steps which can be efficiently generated with switching converters, but result in a lower power amplifier efficiency, especially for a low number of levels.\nIn 2013, Qualcomm became the first company to ship a chip with such technology, which it claimed to be the industry’s first for 3G and 4G LTE mobile devices. R2 Semiconductor became the industry's first ET company to ship a phone with ET in the Samsung Galaxy S5 Mini.\nAs of September 2014, at least 16 phones employ ET, including the Samsung Galaxy Note 3, Galaxy S5 Mini, Nexus 5, and iPhone 6. Other component makers evaluating the technology include R2 Semiconductor,  Mediatek, RF Micro Devices, Skyworks, Texas Instruments, Analog Devices, Nujira and Eta Devices.\nEta Devices, an MIT spinoff based in Cambridge, Massachusetts, is preparing a base station module and a chip that it claims decreases battery drain and work well in high-bandwidth applications. The company says the chip helps lower electricity consumption by 20 percent and helps reduce heat generation by up to 30 percent. Eta's approach increases efficiency at the cost of greater signal noise. The company uses advanced digital signal processing to handle the problem. The Eta basestation is a little smaller than a shoebox, is the first 4G LTE transmitter to achieve average efficiency greater than 70 percent, up from the typical 45 to 55 percent.\nReferences\nExternal links\n* [https://www.electronics-notes.com/articles/radio/rf-envelope-tracking/what-is-envelope-tracking-basics-primer.php Envelope Tracking Tutorial] includes video and all aspects of envelope tracking\n* [http://www.artechhouse.com/International/Books/Envelope-Tracking-Power-Amplifiers-for-Wireless-Co-2163.aspx Zhancang Wang, \"Envelope Tracking Power Amplifiers for Wireless Communications\", Artech House, MA: Boston, 2014.]\n* [http://www.r2semi.com R2 Semiconductor] Startup working on Envelope Tracking technology"
    }
  ]
}