{
  "content": [
    {
      "type": "text",
      "text": "# Environment Modules (software)\n\n| operating_system = Unix-like\n| programming_language = Tcl\n| license = GNU General Public License#Version 2\n| website =\n}}\nThe Environment Modules system is a software tool designed to help users dynamically modify their shell environment. It provides a mechanism for managing and switching between sets of environment variable settings, often used to configure different software packages, compilers, and libraries.\nOverview\nEnvironment Modules allows users to dynamically configure their shell environment without permanently altering login scripts. This is especially useful in high-performance computing (HPC) environments where users may need to access multiple versions of the same application. Users load and unload scripts called modulefiles to modify environment variables such as  or .\nEnvironment Modules is shell independent and supports all major Unix shells (Bash, ksh, Zsh, Fish, sh, tcsh, and csh), Windows shells (CMD.EXE and PowerShell) and several Scripting languages (Perl, Python, Ruby, Tcl, CMake and R)\nEnvironment Modules handles all kinds of items part of the shell environment, including environment variable, shell alias, shell function and command-line completion.\nHistory\nEnvironment Modules was first developed in the early 1990s by John L. Furlani at Sun Microsystems. Version 1 was developed as pure shell scripts. With version 2 Environment Modules became a C program evaluating modulefiles written in Tcl.\nIn the mid 1990s Peter W. Osel at Siemens and Jens Hamisch at Strawberry released the 3.0beta version. R.K. Owen at the National Energy Research Scientific Computing Center (NERSC) took over the project in the late 1990s and ported it to Linux. He released version 3.1 in 2000 under the GNU General Public License (GPL).\nDuring the 2000s, Environment Modules gained traction in the high-performance computing (HPC) world and started to be used at the largest computing centers. Environment Modules was specified as a Baseline Configuration requirement of the DoD High Performance Computing Modernization Program (HPCMP).\nIn 2004, Mark Lakata of MIPS Technologies developed a pure Tcl reimplementation of Environment Modules. Maintenance of this alternative version was later continued by Kent Mein at the University of Minnesota.\nIn 2008, Robert McLay of the Texas Advanced Computing Center (TACC) introduced Lmod, an alternative implementation project of Environment Modules written in Lua.\nAfter the release of version 3.2.10 in December 2012, development of the C implementation of Environment Modules was discontinued. In the following years, the Lmod project grew in popularity within the HPC community.\nIn 2017, stewardship of the Environment Modules project was transferred to Xavier Delaruelle of the French Alternative Energies and Atomic Energy Commission (CEA). He released version 4, based on the pure Tcl implementation, which was adapted to maintain compatibility with the earlier C version. Since then, new features have been introduced regularly to enhance usability and extend functionality.\nIn 2025, Modules became a Linux Foundation project part of the High Performance Software Foundation (HPSF).\nArchitecture\nEnvironment Modules provides the command  along with a shell function or alias named . The command interprets modulefiles, scripts written in Tcl that define environment modifications, and produces the corresponding shell code. The shell function or alias then evaluates this code to update the current shell session accordingly.\nA modulefile typically modifies environment variables such as , , or . The example below shows a simple modulefile for a sample software package:\n{{syntaxhighlight|lang=tcl|code=#%Module\nmodule-whatis {Example software version 1.2}\nset root /usr/local/example-1.2\nprepend-path PATH            $root/bin\nprepend-path LD_LIBRARY_PATH $root/lib\nappend-path  MANPATH         $root/man\n}}\nModulefiles are organized into directories known as modulepaths. These modulepaths can be centrally managed to provide system-wide access or placed in personal directories for user-specific configurations.\nUsers can:\n* Load a modulefile (i.e., apply environment changes defined) using\n* Unload a modulefile (i.e., undo its environment changes) with\n* Switch between modulefiles using\n* View available modulefiles with\n* Display content of a modulefile using\n* List currently loaded modulefiles with\n* Save currently loaded modulefiles in a collection using\n* Restore environment described by a collection with\n* Enable a modulepath with\nUsage examples\nCreate sample modulefiles in a user-specific modulepath:\nViewing available modules:\nLoading a module:\nList loaded modules:\nSwitching versions:\nUnloading all loaded modules:\nDefine a default version for sample test module:\nLoad default test module:\nAvailability\nEnvironment Modules is distributed by a wide range of Linux and Unix operating systems. It is available under the package name  in Debian, Ubuntu, Red Hat Enterprise Linux and Fedora. The software is also packaged for macOS through the Homebrew project, and a version is available for Windows systems. Where pre-packaged distributions are not provided, the project supplies source code and documentation to support manual installation and configuration.\nReferences\nExternal links\n*\n*\n* John L. Furlani, [https://modules.sourceforge.net/docs/Modules-Paper.pdf Modules: Providing a Flexible User Environment] Proceedings of the Fifth Large Installation Systems Administration Conference (LISA V), pp.&nbsp;141–152, San Diego, CA, September 30 - October 3, 1991.\n* [https://web.archive.org/web/20140203041538/http://rcc.its.psu.edu/user_guides/system_utilities/modules/ PennState Environment Modules User Guide]\n* [https://modules.sourceforge.net/docs/MC2_whitney_paper.pdf Drag your design environment kicking and screaming into the '90s with Modules!] - SNUB Boston 2001 - Erich Whitney, Axiowave Networks, Mark Sprague, ATI Research\n* [https://web.archive.org/web/20150217180220/https://www.xsede.org/software-environments Xsede Software Environments]. The Extreme Science and Engineering Discovery Environment ― National Science Foundation\n* [http://www.lysator.liu.se/cmod/ cmod] ― Alternative C implementation developed in the 1990s\n* [https://www.tacc.utexas.edu/research-development/tacc-projects/lmod Lmod] ― Lua-based module system\n* [https://spack.io/ Spack] ― Flexible package manager for HPC software\n* [https://easybuild.io/ EasyBuild] ― Software build and installation framework to manage software on HPC systems"
    }
  ]
}