{
  "content": [
    {
      "type": "text",
      "text": "# Equatorial Guinea–Nigeria Maritime Boundary Treaty\n\n| location_signed     = Malabo, Equatorial Guinea\n| date_sealed         =\n| date_effective      =\n| condition_effective =\n| date_expiration     =\n| signatories         =\n| parties             =\n*\n*\n| ratifiers           =\n| depositor           =  United Nations Secretariat\n| language            = English; Portuguese\n| languages           =\n| wikisource          =\n}}\nThe Equatorial Guinea – Nigeria Maritime Boundary Treaty is a 2000 treaty between Equatorial Guinea and Nigeria which delimits a portion of the maritime boundary between the two countries.\nThe treaty was signed in Malabo on 23 September 2000 by Equatoguinean president Teodoro Obiang Nguema Mbasogo and Nigerian president Olusegun Obasanjo.\nDemarcation\nThe boundary set out by the text of the treaty does not demarcate the entire Equatorial Guinea – Nigeria treaty. When the treaty was signed, the International Court of Justice (ICJ) was hearing a case about a maritime dispute between Cameroon and Nigeria; because the result of that case would affect the maritime boundaries in the Gulf of Guinea, it was decided to leave the complete delimitation of the boundary until after the ICJ case concluded.\nThe boundary defined in the treaty runs through the Bight of Bonny and separates the Nigerian mainland from Equatorial Guinea's Bioko Island. The boundary consists of nine straight-line maritime segments defined by ten individual coordinate points. Rather than adopting an equidistant line between the two countries, the treaty takes into account both countries' established economic interests in the Gulf of Guinea, including existing oil wells, oil drilling installations, and existing resource consent licences.\nThe full name of the treaty is Treaty between the Federal Republic of Nigeria and the Republic of Equatorial Guinea concerning their maritime boundary.\nNotes\nReferences\n* Charney, Jonathan I., David A. Colson, Robert W. Smith. (2005). International Maritime Boundaries, 5 vols. Hotei Publishing: Leiden. ; ; ; ; ; [https://www.worldcat.org/oclc/23254092  OCLC 23254092]\n* Daniel, Tim. [https://web.archive.org/web/20091014225916/http://www.gmat.unsw.edu.au/ablos/ABLOS01Folder/DANIEL.PDF \"Maritime Boundaries in the Gulf of Guinea\"], [http://unsw.edu.au University of New South Wales]\nExternal links\n*[http://untreaty.un.org/unts/144078_158780/1/8/10506.pdf Full text of treaty]"
    }
  ]
}