{
  "content": [
    {
      "type": "text",
      "text": "# Eremas Wartoto\n\nEremas Wartoto is a Papua New Guinean businessman, based in Kokopo, PNG. He founded the airline Travel Air, based in Madang, PNG, and is part of the Sarakolok West Transport (SWT) Group, owned by Wartoto. Travel Air flies from Hoskins, Lae, Madang, Mt. Hagen, Port Moresby and Rabaul.\nWartoto is currently in Australia and is the Chief Executive of Travel Car Australia Pty Ltd.\nControversies\nAhead of the launch of Travel Air in July 2011, allegations were made by the media in PNG that parliamentarian Paul Tiensten had assisted with illegally financing the company by giving K10 million to Wartoto. Wartoto had purchased four airplanes with the funds.\nWartoto confirmed he had received K10 million for Travel Air but stated that in 2010 his company had applied for a subsidy from the government budget, amounting to 10 per cent of the K100 million investment Wartoto had planned to make in transport infrastructure based out of Madang. Wartoto said “We appreciate the government’s vision to at least subsidise 10 per cent of that investment.”\nWartoto threatened to sue those involved in the media attacks, including the Post Courier, a newspaper, and the Ombudsman Commission. Further, in September 2011, he filed a Judicial Review application in the National Court at Waigani over police questioning him about the alleged misappropriation of K10 million air freight subsidy.\nWartoto was arrested in August 2011 and charged in relation to the misappropriation of K7 million intended for the renovation of Kerevat National High School. Wartoto is currently out on a K5,000 bail but is allegedly “reluctant” to return to PNG. Wartoto’s lawyers stated that he was in Cairns for medical treatment after suffering hypertension and being seriously fatigued. A Papua New Guinea corruption Task Force has put 33 prominent citizens on a watch list, including Eremas Wartoto and several politicians, telling the national airline to monitor their travel.\nOn 17 January 2012, Timothy Rowland, the General Manager of SWT, owned by Wartoto, was arrested by the PNG Task Force Sweep amid a corruption investigation into PNG’s planning department. SWT are alleged to have tried to extort $4.5 million from the Manus provincial government by selling it a boat that had already been paid for by the National Planning Department.\nReferences"
    }
  ]
}