{
  "content": [
    {
      "type": "text",
      "text": "# Erin King\n\n| birth_place = Sydney, Australia\n| height_cm= 170\n| weight_kg= 76\n| school =\n| university =\n| relatives =\n| spouse =\n| children =\n| occupation =\n| weight_update =\n| ru_currentposition = Back Row\n| ru_currentteam =\n| youthyears1 =\n| youthclubs1 = Leinster U18\n| amatyears1 =\n| amatteam1 =\n| amatapps1 =\n| amatpoints1 =\n| ru_amupdate =\n| years1 =\n| clubs1 = Old Belvedere RFC\n| apps1 =\n| points1 = 0\n| ru_clubupdate =\n| ru_provinceyears1 =\n| ru_province1 =\n| ru_provinceapps1 =\n| ru_provincepoints1 =\n| ru_provinceupdate =\n| repyears1 = 2024–\n| repteam1 = Ireland\n| repcaps1 =4\n| reppoints1 =0\n| ru_ntupdate =\n| ru_sevensnationalyears1 = 2021–\n| ru_sevensnationalteam1 = Ireland\n| ru_sevensnationalcomp1 =\n| ru_sevensupdate =\n}}\nErin King (born 21 October 2003) is an Irish Rugby Union player who plays for the Ireland women's national rugby union team and the Irish Rugby Sevens team. In 2024, she was named World Rugby Women's 15s Breakthrough Player of the Year at the World Rugby Awards. She represented Ireland at the 2024 Summer Olympics.\nEarly life\nKing was born in Sydney, Australia to English parents. She is of Irish descent through her maternal grandmother. She has four brothers - Daniel, Matty, Connor, and Liam. She also lived with her family in Dubai and Doha. The family moved back to Wicklow in Ireland for her teenage years. King played youths rugby at Naas RFC and represented Leinster and Ireland U18 rugby union sides. She plays her club rugby for Old Belvedere RFC.\nRugby career\nKing made her debut for the Ireland sevens team at the Dubai Sevens in December 2021, after being identified as a Player of National Interest at the age of 17 and joining the Ireland Sevens program in January 2021.\nShe played an important role in the Irish women’s team becoming the first ever to win a World Series silver medal in February 2022, in Spain. She scored her first tries for Ireland in a 22-21 win against Canada at the French HSBC World Rugby Sevens Series event in Toulouse in May 2022. She was named in the Ireland squad for the 2022 Rugby World Cup Sevens – Women's tournament held in Cape Town, South Africa in September 2022.\nShe represented Ireland at the 2024 Summer Olympics in Paris. She then made her international fifteens debut for Ireland against Australia on 14 September 2024 at Kingspan Stadium in Belfast. Playing for the Ireland 15-a-side team she scored twice as they beat New Zealand at the WXV1 competition in Canada in September 2024. In November 2024, she was named World Rugby Women's 15s Breakthrough Player of the Year at the World Rugby Awards.\nShe was named in Ireland's side for the 2025 Six Nations Championship in March. A knee injury suffered in April 2025 in the Six Nations against England ruled her out of the 2025 World Cup.\nReferences"
    }
  ]
}