{
  "content": [
    {
      "type": "text",
      "text": "# Erkinger I von Seinsheim, Baron of Schwarzenberg\n\nErkinger I von Seinsheim\nErkinger I von Seinsheim, Baron of Schwarzenberg (also Erkinger VI von Seinsheim; 1362 in Stephansberg (Kleinlangheim) – December 11, 1437; buried in Astheim Charterhouse) was the chief hunter of the Prince-Bishopric of Würzburg. From 1416 he had the title of Imperial Councilor. He was raised to the  (baron) and banner lordship in 1429. Erkinger is considered the progenitor of the later Franconian-Bohemian Princes of Schwarzenberg.\nLife\nErkinger von Seinsheim was born in 1362 as the first and only son of Michael I von Seinsheim. His mother was Margarethe von Rosenberg, whom his father married after the death of his first wife. Michael von Seinsheim was the captain of the Marienberg Fortress.  Erkinger grew up at Stephansberg Castle near Haidt.\nAfter his father's death on July 30, 1399, Erkinger took over the possessions. The family was wealthy and the young nobleman was able to increase the family property by buying additional property.  In 1399 he bought the village of Astheim by Volkach, in 1406 he became the chief hunter of the Prince-Bishopric of Würzburg. On June 2, 1409, Erkinger and his first wife Anna von Bibra transferred the village of Astheim to the Carthusian order as an endowment. The Astheim Charterhouse became a burial place for the family beginning with Anna.\nAn inscription at the Astheim Charterhouse explained the chartering and recharting of the monastery by Erkinger and immediate family\nThe proximity to King Sigismund of Luxembourg led to the appointment to the Imperial Council in 1416. A year earlier, in 1415, the village of Scheinfeld was elevated to town by imperial order which must have been in the hand of Erkinger. The nobleman had acquired Schwarzenberg Castle near Scheinfeld from the Lords of Vestenberg, Abenberg and debt holder Würzburg prince-bishopric.\nErkinger moved the family home to the mighty Steigerwald fortress and henceforth called himself \"Herr zu (Lord of) Schwarzenberg\". At the same time, the nobleman began to grant loans to the local authorities. For example, the Würzburg prince-bishopric and the burgrave of Nuremberg borrowed money from the lords of Schwarzenberg. In 1417 Erkinger traveled alongside the king to the Council of Constance and met the followers of the Hussite teaching for the first time.\nIn 1420 and 1429, Erkinger became field captain of the king and went into the field against the Hussites. Erkinger reached the peak of his career in 1429. He was appointed Freiherr (baron) and flag bearer by the king. At the same time, however, Erkinger was still a Ministeriale of the Würzburg Prince Bishop . From this he bought an estate on Marienberg above Würzburg in 1432.\nPreviously, on February 3, 1430, Seinsheim raided the town of Schwarzach near the Münsterschwarzach Abbey. Seckendorff had handed it over to the bailiff Lamprecht. Seckendorff, however, owed Erkinger money that he hoped to collect through the attack. Seinsheim had brought several citizens of the city to his side, including the mayor Peter Kometer, but was betrayed by a Münsterschwarzach man. The raid failed and two of the Erkinger's horsemen were shot.\nIn 1432 Erkinger had acquired the Hohenlandsberg Castle and Office and had become an official administrative district. The sons of Erkinger called themselves Lords of Seinsheim, barons of Schwarzenberg, while the grandchildren already abandoned the name Seinsheim and only bore the title Schwarzenberg. Erkinger  died on December 11, 1437, and was buried in his Astheim Charterhouse.\nMarriages and offspring\nErkinger married twice. First he married Anna von Bibra (daughter of Dietrich von Bibra and his first wife, Engel), who died on March 4, 1418. She was the first to be buried in the Charterhouse. With her he had six children, including his successor Michael II.\n* Michael (died on March 19, 1469; = in Astheim Abbey)\n* Matern (died in 1411)\n* Heinrich (died in 1423)\n* Hermann (died on September 15, 1448)\n* Margareta (died on April 11, 1468)\n* Agnes\nAfter the death of his wife, Erkinger married Barbara von Abensberg. With her he fathered nine children. She died on November 2, 1448, and was buried next to her husband in Astheim.\n* Erkinger (died on September 26, 1503, in Astheim), around 1473 canon to Eichstätt\n* Friedrich\n* Ulrich (died in 1456)\n* Jobst\n* Johann (born around 1428; died probably on May 16, 1460, near Giengen an der Brenz )\n* Sigmund (born 1430; died on July 3, 1502)\n* Kunigunde (died on September 2, 1469, in Eger )\n* Magdalene (died after November 14, 1485)\n* Ada/Antoinette (died 1460, in Cupar, Scotland)\nReferences\nBibliography\n* Hans Dresch: Die Schwarzacher Miniaturen in der Würzburger Bischofschronik des Lorenz Fries. In: Hans Dresch (Hrsg.): 25 Jahre Markt Schwarzach am Main. Zwei Aufsätze zum Jubiläumsjahr. Stadtschwarzach 1999. pp.&nbsp;1–6.\n* Herbert Meyer: Ahnherr und Klostergründer. In: Ute Feuerbach (Hg.): Unsere Mainschleife. 1993–2007. Volkach 2008. pp.&nbsp;73–76.\n* Herbert Meyer: Erkinger von Seinsheim und die Kartause Astheim. In: Ute Feuerbach (Hg.):Volkach. 906–2006. Volkach 2006. pp.&nbsp;146–148.\nExternal links"
    }
  ]
}