{
  "content": [
    {
      "type": "text",
      "text": "# Ernest Howard Armstrong\n\n| birth_place = Kingston, Nova Scotia\n| death_date =\n| death_place = Bridgewater, Nova Scotia\n| residence =\n| order1               = 9th\n| office1              = Premier of Nova Scotia\n| term_start1          = January 24, 1923\n| term_end1            = July 16, 1925\n| monarch1             = George V\n| lieutenant_governor1 = MacCallum GrantJames Robson Douglas\n| predecessor1         = George Henry Murray\n| successor1           = Edgar Nelson Rhodes\n| office2              = MLA for Yarmouth County\n| term_start2          = June 20, 1906\n| term_end2            = July 27, 1920\n| predecessor2         = George G. Sanderson\n| successor2           = Howard Corning\n| alongside2           = Henry S. LeBlanc, Henry T. d'Entremont\n| office3              = MLA for Shelburne County\n| term_start3          = July 27, 1920\n| term_end3            = June 25, 1925\n| predecessor3         = Frank E. Smith\n| successor3           = Norman Emmons Smith\n| alongside3           = Frank E. Smith, Robert Irwin\n| party                = Liberal\n| spouse               =\n| occupation           = Lawyer, journalist\n}}\nErnest Howard Armstrong,  (July 27, 1864 – February 15, 1946) was a Canadian politician and journalist who served as the ninth premier of Nova Scotia from 1923 to 1925.\nEarly life and career\nBorn in Kingston, Nova Scotia, the son of Edward and Sarah A. (Currell) Armstrong, Armstrong studied at Acadia University and Dalhousie University where he received a Bachelor of Laws degree.\nHe was created King's Counsel in 1907. He practiced law in Weymouth, Nova Scotia from 1889 to 1892 and during that period was also editor of the Weymouth Free Press.\nIn 1892, he moved to Yarmouth, Nova Scotia where he held the office of vice and deputy United States Consul from 1894 to 1906.\nPolitical career\nHe was elected to the town council in 1900 and was the mayor of Yarmouth from 1904 to 1906, when he won a seat in the Nova Scotia House of Assembly. He joined the  Cabinet of Liberal Premier George Henry Murray in 1911 and served as minister of public works and then as minister of mines.\nIn 1923, Armstrong succeeded Murray as Premier and inherited a Liberal government that had been in power for 40 years. Armstrong was unable to overcome the effects of a serious economic downturn in the region, underestimated the strength of the Maritime Rights Movement and the feelings of alienation among Nova Scotians, and also mishandled labour unrest in Cape Breton, all of which led to the defeat of his government in the 1925 election. The Liberals won only three seats out of 43 in the legislature. He died in Bridgewater, Nova Scotia.\nReferences\n* [https://archive.org/details/historyofnovasco03alliuoft History of Nova Scotia (Volume 3) (1916)]"
    }
  ]
}