{
  "content": [
    {
      "type": "text",
      "text": "# Ernst Schwarz (sinologist)\n\nErnst Schwarz (chinese 恩斯特·施華滋 / 施华滋, 6 August 1916, Vienna – 6 September 2003, Münichreith) was an Austrian sinologist, translator and author.\nLife\nErnst Josef Schwarz was born as the youngest of four siblings in Vienna-Hietzing. His Jewish parents, Berta (née Stern, 1881–1926) and Desiderius Schwarz (1872–1935), owned a prosperous merchant business on Mariahilfer Straße. Having grown up in a sheltered environment, he began to study medicine in 1935 and changed later to the Faculty of Philosophy – Egyptology, at the University of Vienna. After the annexation of Austria to the German Reich in March 1938, he was forced to leave the university and, shortly thereafter, the country, as he was doubly endangered – as a Jew due to the racial policies and additionally due his prohibited social democratic activities. While his two sisters Lilli (married Hofstätter) and Francisca (married Fischl) managed to move to the United States, he emigrated with his brother Egon by sea to Shanghai. This city was one of the very few places in the world that took in Jews and other refugees without visas or financial resources at that time. Initially, Schwarz lived with his also Jewish fiancée from Vienna, then his wife Annemarie (née Hecht, later married Pordes)  in the French Concession. In Shanghai he learned Chinese through self-study, while he worked as a physical education teacher. Occasionally he stayed in Buddhist monasteries, where he began studying classical Chinese. However, during the Japanese occupation in World War II, living conditions for Jewish emigrants and exiles changed dramatically in the Shanghai Ghetto from 1941 onwards (Pacific War). Survival became increasingly difficult, there was hardly any food, and racial persecution threatened once again. For two years, he found protection from persecution in a Buddhist monastery in southern Shanghai, led by Fan Cheng (范诚). However, the marriage fell apart during this difficult time of war and occupation.\nIn 1945, after divorcing his wife, he worked in Nanjing as a translator. During his employment at the National Central Library in Nanjing (Zhōngyāng túshūguǎn, now Nanjing Library), he collaborated with the poet Mao Yumei (茅于美) on the prestigious project of translating Shen Deqian's extensive collection of ancient poetry sources (古詩源, Gǔshīyuán) into English. In 1946–47 he also taught English literature at the Private University of Nanking. From 1947 to 1950, he was secretary at the Austrian Legation in Nanjing. He was involved here when, in 1949, with the help of US Ambassador John Leighton Stuart, good relations were to be established between the newly founded People's Republic of China and the USA. In addition to his official duties, Ernst Schwarz initiated the establishment of the Sino-Austrian Cultural Association (SACA) with the support of envoy Felix Stumvoll. Zhu Jiahua, Minister of Education in the Kuomintang government, played a major role in establishing important contacts for this purpose. Among the renowned supporters of SACA was Zong Baihua (宗白華 / 宗白华), with whom Schwarz would share a lifelong friendship. But the legation was closed in 1950 (in this phase of the Cold War, particularly after the beginning of Korean War, also Austria breaks off diplomatic relations with the now Maoist China). Subsequently, he worked again as a translator, this time for the Foreign Languages Press in Beijing. From 1958 to 1960, he taught English at the Hangzhou University (Hángzhōu Dàxué, now Zhejiang University). Here he met Xia Chengtao (夏承焘) in 1958, who is considered a pioneer of Chinese philology. As a professor and member of the Academy, he conducted research on the poetry of the Tang and Song dynasties and became an important discussion partner and friend to Ernst Schwarz. But during the Great Leap Forward, he was physically ill, increasingly mentally and morally exhausted, and once again politically persecuted, he knew that he had to leave People's Republic of China as quickly as possible. But only a few – socialist – countries still had diplomatic representations in China, but which were necessary for obtaining permission to leave China. The consulate of the GDR offered rescue and promised at the same time work at a university.\nTogether with his wife, Amina Agischewa, whom he had married in 1953, and his little daughter, via the cargo ship route North Korea, Burma, Great Britain, and Belgium, he finally arrived in the GDR. Between 1961 and 1970, he taught Chinese language and literature as a research assistant and later as a lector at the East Asian Institute of the Humboldt University in East Berlin. In 1965, he received his doctorate in philosophy with a thesis on the problems of Qu Yuan research. After he retired from the University, he worked as a freelance translator and held occasional lectures at the Diplomatic Academy of Vienna. Chancellor of Austria Bruno Kreisky arranged him a teaching position at the Diplomatic Academy. He was personally acquainted with Trade Minister Fritz Bock, a childhood friend, Foreign Minister Rudolf Kirchschläger, Science Minister Hertha Firnberg, Health Minister Ingrid Leodolter, Friedrich Hoess diplomat, and Chief Magistrate Josef Bandion, among others. Over the years, Schwarz made various efforts to expand cultural and economic relations between the GDR, Austria, and China. His numerous contacts, in connection with his Austrian citizenship, but also partly his memberships in the Association of Persecutees of the Nazi Regime – Federation of Antifascists, in the Writers' Association of the GDR, and in PEN International (PEN Center of the GDR or German PEN Center East) were helpful. After Deng Xiaoping's reform and opening-up policy allowed direct contact and travel again, Schwarz met up with an old friend from his time in Nanjing: Wang Zhimin (王志民), who had survived the various persecutions and deportations as a “rightist deviant”. The two developed various exchange projects with China.\nIn 1993, Schwarz returned from Berlin to Vienna. In 1994, it came to light that he worked for the Ministry of State Security of the GDR (called \"Stasi\"); he admitted his activities as an unofficial collaborator, without publicly repenting it. He retired to Münichreith in the Waldviertel, Lower Austria, where he spent his latter years.\nErnst Schwarz was best known for his translations of classical poems and philosophical texts from Chinese, which proved to be very popular with the reading public and they set high standards concerning Tao Yuan-Ming, Confucius and Lao Tse in the German-speaking world. His later publications increasingly addressed Buddhist themes. In 1999, he presented the first complete German translation of the Blue Cliff Record. After Richard Wilhelm, he was the second sinologist in the German-speaking world to make significant contributions to the popularization of Chinese thought, through a wide range of translations with high print runs. According to Yu Ligong (俞力工), 2004–2011 president of the Association of Chinese Language Writers in Europe, it can be said without bias that contemporary sinologists in the West who have made such significant contributions to the field of cultural exchange between China and the West can be counted on the fingers of one hand.\nHe also wrote a series of essays, for example for Die Weltbühne, but also for radio broadcasts (Deutschlandradio and others).\nHis autobiography, Tausend Tore hat die Wahrheit (A Thousand Gates have the Truth), was supposed to be published in Berlin in 2001, but it was not released as a book to the market.\nIn 1981, Ernst Schwarz received the F.-C.-Weiskopf Prize and in 1992 the Ehrenmedaille der Bundeshauptstadt Wien in Gold (Honorary Medal of the Federal Capital Vienna in Gold) to serve as recognition for special achievements for Vienna in cultural, scientific, or economic fields.\nHe is the father of Melan Schwarz (梅澜.施华滋) aka the film and television actress Marijam Agischewa.\nSelected works\n* Hsiao-Shih Hu & Ernst J. Schwarz: The position of Nanking in Chinese literature (lecture delivered on November 25th, 1949). Sino-Austrian Cultural Association, Nanking, 1949 (Chinese/English)\n* Wang Chi Min (Wang Zhimin) & Ernst J. Schwarz: Post-War Austria, with an Introduction by Dr. F. Stumvoll, Austrian Minister to China. Austrian Information Service, Nanking [1949] (Chinese)\n* Zong Baihua & Ernst J. Schwarz: Space-consciousness in chinese poetry and painting (lecture delivered on March 11th, 1949). Hsin Chung-Hua Tsa Chih, 1949, 12 (no. 10)\n* Die klassische chinesische Literatur und das Weltbild Chinas im Feudalzeitalter, Berlin 1964\n* Zur Problematik der Qu Yuan-Forschung, Berlin 1965 (thesis at Humboldt University of Berlin)\n* Der Glücksbegriff in China, Vienna 1976\n* Stein des Anstoßes, Berlin 1978 (poetry, with autobiographical notes)\n* Damit verdien ich mir mein Paradies. Unbekannte Bildwerke in den Domen zu Magdeburg und Stendal (Gedichte), mit Fotografien von Ute Mahler, Berlin 1986 (poetry, with photographs)\n* Der alte Mönch. Gedichte zu chinesischen Tuschezeichnungen, Berlin 1990 (poetry)\n* Die Weisheit des alten China, Mythos – Religion – Philosophie – Politik, Munich 1994 (on the history of the Qin dynasty)\n* Das Leben des Bodhidharma, Düsseldorf [a.o.] 2000 (novel)\nAnthologies (Translations and Editing)\n* Der Reiter im grünen Gewand (Chinas Völker erzählen; Folge&nbsp;1), Beijing 1964; new edition in three volumes: Die schönsten Volkssagen aus China – Der Reiter im grünen Gewand , Die Legende vom Reis , Das langhaarige Mädchen  (Beijing, Verlag für fremdsprachige Literatur 2005). (Chinese legends)\n* Chrysanthemen im Spiegel. Klassische chinesische Dichtungen, Berlin 1969 (classical Chinese poetry)\n* Lob des Steinquells. Koreanische Lyrik, Weimar 1973 (classical Korean poetry)\n* Der Ruf der Phönixflöte. Klassische chinesische Prosa, Texte aus drei Jahrtausenden, Berlin 1973 (classical Chinese prose from three millennia)\n* Von den müßigen Gefühlen. Chinesische Liebesgedichte aus drei Jahrtausenden, Leipzig [a.o.] 1978; also publ. as Chinesische Liebesgedichte, Frankfurt (Main) 1980 (Chinese love poetry from three millennia)\n* Wang Sche-Fu (Wang Shifu): Das Westzimmer, Leipzig 1978 (editor; original translation by Vincenz Hundhausen]\n* So sprach der Weise. Chinesisches Gedankengut aus drei Jahrtausenden, Berlin 1981 (Chinese philosophy from three millennia)\n* Li Tsching-dschau (Li Qingzhao) & Dschu Schu-dschen (Zhu Shuzhen): Chinesische Frauenlyrik. Tzi-Lyrik der Sung-Zeit, Munich 1985 (Chinese women's poetry)\n* Vom Weg allen Geistes. Sentenzen aus dem alten China, Berlin 1985 (sentences from the ancient China)\n* Das gesprengte Grab, Berlin 1989 (Chinese stories about the consequences of the Cultural Revolution)\n* So sprach der Meister, Munich, 1994 (ancient Chinese philosophy)\n* Amina Agischewa & Ernst Schwarz: Die heilige Büffelfrau. Indianische Schöpfungsmythen, Munich 1995 (Native American creation myths)\n* Ein Spiegel ist des Weisen Herz. Sinnsprüche aus dem alten China, Munich 1996 (Chinese wisdoms)\n* Ernst Schwarz & Amina Agischewa: Der Trank der Unsterblichkeit. Chinesische Schöpfungsmythen und Volksmärchen, Munich 1997 (Chinese creation myths and fairy tales)\n* Die Glocke schallt, die Glocke schweigt. Zen-Buddhistische Weisheit, Zürich [a.o.] 1999 (Zen Buddhist wisdoms)\n* Der rechte Weg. Chinesische Weisheiten, Berlin 2000 (Chinese wisdoms)\nTranslations\n* Jian Bozan,  (Shào Xúnzhèng 邵循正), Hu Hua: Kurzer Abriß der chinesischen Geschichte, Beijing 1958.\n* Gao Yübao: Meine Kindheit, Beijing 1962\n* Konfuzius: Gespräche des Meisters Kung (Lun Yü). Mit der Biographie des Meisters Kung aus den&nbsp;› Historischen Aufzeichnungen‹, Munich 1985 (complete translation, with historical biography by Sima Qian)\n* Konfuzius: Meister Kung sprach. Aus den „Gesprächen“ des Konfuzius, Wien 1985 (thematically ordered selection, different translation)\n* Laudse (Laozi): Daudedsching (Tao Te King), Leipzig 1970, expanded 1978 (also as license issue, but add. with bibliography: Munich 1980) and as revised edition (titeled Lao-tse: Tao-te-king): Munich 1995\n* Li Tai Bo: Li Tai-bo, Berlin 1979 (Tang poetry)\n* Li Nan-li etc.: Lo Tsai, der Tigerjäger und andere Geschichten, Beijing 1958 (Chinese stories)\n* Schu-Ting (Shu-Ting, aka Gong Peiyu): Schu Ting, Berlin 1988, Frankfurt (Main) 1992 (modern Chinese poetry)\n* Tao Yüan-ming: Pfirsichblütenquell, Leipzig 1967\n* Tschin Dshao-jang (Qin Zhaoyang): Dorfskizzen, Beijing 1956\n* Yuanwu: Bi-yän-lu. Aufzeichnungen des Meisters vom Blauen Fels, Koan-Sammlung, Munich 1999\n* Zong Baihua: Little poems of floating clouds; Poetry and I., in: Chinese Literature 1 (1987), pp.&nbsp;160–167, 168–175\nFurther reading\n* Günter Albrecht, Kurt Böttcher, Herbert Greiner-Mai and Paul-Günter Krohn: Schriftsteller der DDR. 2., unchanged edition. Bibliographisches Institut, Leipzig 1975.\n* Carl Ludwig Lang (ed.) and Ingrid Bigler (assist.): Deutsches Literatur-Lexikon. Biographisch-bibliographisches Handbuch, Vol.&nbsp;17 Schwalb – Siewert, third, completely revised edition, K.G. Saur, Bern [a.o.] 1997, columnes 31–32.\n* Martin Kern: The emigration of German sinologists 1933–1945. Notes on the history and historiographys of Chinese studies, in: Journal of the American Oriental Society, vol.&nbsp;118, no&nbsp;4 (1998)\n* Bernhard Führer: Vergessen und verloren. Die Geschichte der österreichischen Chinastudien, Bochum 2001\n* Bernhard Führer, Knut Walf: Ernst Schwarz (6.8.1916–6.9.2003), in: Hefte für Ostasiatische Literatur 35 (2003/2)\n* Lutz Bieg: Schriftenverzeichnis Ernst Schwarz – unter besonderer Berücksichtigung seiner Übersetzungen aus dem Chinesischen, in: Hefte für Ostasiatische Literatur Nr.&nbsp;36 (2004/1). (bibliography)\n* Knut Walf: »...daß man alle Willkür, alles Machen meidet«. Zur Lektüre und Wirkung daoistischer Texte während der Nazizeit (1933–1945), in: Orientierung&nbsp;73 (2009), pp.&nbsp;267–272.\n* Konrad Herrmann: Über den Einfluss des Exils auf das wissenschaftlich-literarische Schaffen des österreichischen Sinologen Ernst Schwarz, in: Mechthild Leutner & Klaus Mühlhahn (eds.): Reisen in chinesischer Geschichte und Gegenwart. Erfahrungen, Berichte, Zeugnisse. Wiesbaden 2008, pp.&nbsp;203–214.\n* Konrad Herrmann: Begegnungen mit Ernst Schwarz. Books on Demand, Norderstedt 2012.\n* Eva Jancak: Dreizehn Kapitel. Selbstverlag, Vienna 2014.\n* Wang Zhimin: In den Strudeln. Vier Aufzeichnungen. Books on Demand, Norderstedt 2011 (translated from Chinese to German by Konrad Herrmann)\n* Li Xuetao (ed.): Bibliographie zur chinesischen Literatur in deutscher Sprache 1980–2020 (Geschichte der chinesischen Literatur, vol&nbsp;8). De Gruyter Saur, Berlin [o.a.] 2021.\n* Gedenkbuch für die Opfer des Nationalsozialismus an der Universität Wien 1938, Herbert Posch: [https://gedenkbuch.univie.ac.at/person/ernst-schwarz Gedenkbuch Ernst Schwarz] (Memorial Book for the Victims of National Socialism at the University of Vienna 1938; please use the German version)\nReferences"
    }
  ]
}