{
  "content": [
    {
      "type": "text",
      "text": "# Esarhaddon, King of Assyria\n\n\"Esarhaddon, King of Assyria\" (\"Ассирийский царь Асархадон\") is a short story by Leo Tolstoy written in 1903. Tolstoy wrote it as part of an anthology dedicated to the victims of the Kishinev pogrom in Russia, with all of the proceeds going to a relief fund. It is the story of a king who oppresses his subjects.\nPlot\nAccording to book reviewers in 1903, the story is about the king Esarhaddon, who abuses his subjects and beheads the warriors of his enemies.  Then a prophet visits him, and is able to force him to live through the entire life of one of the subjects that the king has oppressed. Certainly inspired by the biblical Esarhaddon, this story diverts from that one, in which Esarhaddon is contemplating how to kill Lailie, the rival king he has just captured, when the prophet interrupts him, and miraculously tells Esarhaddon what he was thinking. According to the Francis Gribble, literary critic writing for Fortnightly Review, this work was in the same theme as many others of Tolstoy, in which he believed that \"all men are brothers because all men are manifestations of the divine.\"\nKishinev Pogrom\nIt was translated to English in 1903 or 1904 by Louise Maude and Aylmer Maude, and the proceeds of this edition went to the Kishinev Relief Fund, a charity to support those who suffered during the Kishinev pogrom in Kishinev, Bessarabia (modern day Chişinǎu, Moldova), where an estimated 120 were killed and 500 wounded. All of the publisher's and the writer's profits went to this fund.\nIn 1903, Tolstoy received a letter from Sholem Aleichem, who detailed the atrocities of the pogroms in Russia and requested Tolstoy's help in making an anthology to benefit the victims. Tolstoy responded with numerous letters, contributing three new stories to the final anthology. Tolstoy was clearly inspired by these events, as the story of Esarhaddon begins with a king who \"had conquered the kingdom of King Lailie, [and] had destroyed and burnt the towns...\" Sholem Aleichem would afterwards write the material that formed the basis of Fiddler on the Roof.\nReception\nThe St. Louis Globe-Democrat said in 1905 that this story \"shows the Russian writer at his very best.\"\nSee also\n* Bibliography of Leo Tolstoy\n* Twenty-Three Tales\nReferences\nExternal links\n* Original text:\n** [http://www.revoltlib.com/?id=10364 Esarhaddon, King of Assyria], from RevoltLib.com\n** [https://www.marxists.org/archive/tolstoy/1903/esarhaddon-king-of-assyria.html Esarhaddon, King of Assyria], from Marxists.org"
    }
  ]
}