{
  "content": [
    {
      "type": "text",
      "text": "# Española mockingbird__disambig_1\n\n| genus = Mimus\n| species = macdonaldi\n| authority = (Ridgway, 1890)\n| synonyms = Nesomimus macdonaldi\n| range_map = Mimus macdonaldi map.svg\n}}\nThe Española mockingbird (Mimus macdonaldi), also known as the Hood mockingbird, is a species of bird in the family Mimidae. It is endemic to Española Island in the Galápagos Islands, Ecuador, and it is one of four closely related mockingbird species endemic to the Galápagos archipelago. It is found in dry forests and is omnivorous, though it primarily is a carnivore or scavenger. The species has a highly territorial social structure and has no fear of humans. It is the only species of Galápagos mockingbird that Charles Darwin did not see or collect on the voyage of HMS Beagle.\nTaxonomy\nThe Española mockingbird was formally described in 1890 by the American ornithologist Robert Ridgway based on a specimen collected by naturalists on the USS Albatross on the island of Española in the Galápagos Islands. Ridgway coined the binomial name Nesomimus macdonaldi where the specific epithet was chosen to honour Marshall McDonald who was the United States Commissioner of Fisheries. The Española mockingbird is now one of 14 species placed in the genus Mimus that was introduced in 1826 by the German zoologist Friedrich Boie. The species is monotypic: no subspecies are recognised.\nDescription\nSimilar to the other species of Galápagos mockingbirds, this species has a mottled gray and brown plumage with a white underbelly. A long tail and legs give the bird its distinctive appearance. The species has a long, thin beak, useful for tapping into the eggs of seabirds. The species has the largest bill of any of the Galápagos mockingbirds. The species, along with the other Galápagos mockingbirds, is most closely related to the Bahama mockingbird (Mimus gundlachii), despite the closer geographical proximity of Ecuador's long-tailed mockingbird (Mimus longicaudatus).\nHabitat\nIts natural habitats are subtropical or tropical dry forests and subtropical or tropical dry shrubland. Found only on Española Island, the bird can be found throughout the dry scrub of the island.\nDiet\nThe species has an omnivorous diet, but is mainly a predator or scavenger. The species will eat the eggs of seabirds nesting on the island, as well as eat from dead animals and kills made by other predators, such as the Galápagos hawk. Sometimes, just like a vampire finch, they will feed on blood of wounded seabirds.\nBehavior\nThe bird is extremely aggressive and curious, and has no fear of humans whatsoever. The bird will chase after tourists in search of food, drink, or any unusual object. In some cases, the species will attempt to obtain water from tourists by pecking at their water bottles.\nThe birds have a strong social structure organized into family groups. Highly territorial, these groups will cooperatively hunt within their area as well as defend it against other groups. Lower-ranking members of the group will assist in caring for the young.\nStatus\nThe bird is considered to be vulnerable in the wild by BirdLife International due mainly to its limited area. The fragile ecosystem and high risk of adverse weather conditions put the species at particular risk of population loss. It is estimated that there are fewer than 2,500 left in the wild.\nReferences"
    }
  ]
}