{
  "content": [
    {
      "type": "text",
      "text": "# Estêvão da Gama (16th century)__disambig_1\n\n1560.\n| order               =\n| office              = Governor of India\n| term_start          = 1540\n| term_end            = 1542\n| monarch             = John III\n| predecessor         = Garcia de Noronha\n| successor           = Martim Afonso de Sousa\n| birth_date          = 1505\n| birth_place         = Kingdom of Portugal\n| death_date          = 1576 (age 71–72)\n| death_place         = Lisbon, Kingdom of Portugal\n| restingplace        =\n| restingplacecoordinates =\n| birthname           =\n| citizenship         =\n| nationality         = Portuguese\n| party               =\n| otherparty          =\n| spouse              =\n| partner             =\n| relations           =\n| children            =\n| residence           =\n| alma_mater          =\n| occupation          =\n| profession          =\n| cabinet             =\n| committees          =\n| portfolio           =\n| religion            =\n| signature           =\n| signature_alt       =\n| nickname            =\n| allegiance          = Portuguese Empire\n| branch              =\n| serviceyears        =\n| rank                =\n| unit                =\n| commands            =\n| battles             = Ottoman–Portuguese conflicts (1538–1557)\n| awards              =\n| military_blank1     =\n| military_data1      =\n| military_blank2     =\n| military_data2      =\n| military_blank3     =\n| military_data3      =\n| military_blank4     =\n| military_data4      =\n| military_blank5     =\n| military_data5      =\n}}\n, in Lisbon, Portugal.]]\nD. Estêvão da Gama ( 1505–1576) was the Portuguese governor of Portuguese Gold Coast (1529–1535) and Portuguese India (1540–1542). Named after his paternal grandfather Estêvão da Gama, Estêvão was the second son of Vasco da Gama, and the brother of Cristóvão da Gama.\nHe commanded the fleet that entered the Red Sea, with the intent of attacking the Ottoman fleet in its harbor at Suez, leaving Goa on 31 December 1540 and reaching Aden on 27 January 1541. The fleet reached Massawa on 12 February, where Gama left a number of ships and continued north. Reaching Suez, he discovered that the Ottomans had long had intelligence of his raid, and foiled his attempt to burn their beached ships. Gama was forced to retrace his steps to Massawa, although pausing to attack the port of El-Tor on the Sinai Peninsula.\nOnce back at Massawa, Gama found the men he had left were restless and convinced by the self-described patriarch João Bermudes that they should provide military assistance to the beleaguered emperor of Ethiopia. Gama acquiesced to their demands, and landed 400 men, 130 military slaves, and sufficient supplies for them at Massawa and the nearby port of Arqiqo under the charge of his brother Cristóvão, before departing for India on 9 July.\nCampaign in Ethiopia\nIn 1541, Estêvão da Gama, led a military expedition to Ethiopia to aid the Christian emperor Gelawdewos against the Muslim forces of Imam Ahmad ibn Ibrahim al-Ghazi, known as “Ahmad Gragn” (“the Left-Handed”).\nThe Portuguese force, about 400 musketeers supported by artillery, landed at Massawa and marched inland through the rugged Ethiopian highlands. Despite harsh conditions, attrition, and clashes along the way, they eventually joined the Ethiopian royal army. The combined forces engaged Ahmad Gragn at the Battle of Wayna Daga in February 1543. In the fierce combat that followed, Ahmad was killed, and his army was routed, securing a decisive Christian victory that ended the Muslim advance and preserved the independence of the Ethiopian kingdom.\nCultural depiction\n* Estêvão da Gama appears in the 2011 Indian film Urumi, portrayed by the American actor Alexx O'Nell.\nExternal links\n* Don Juan de Castro [http://www.columbia.edu/itc/mealac/pritchett/00generallinks/kerr/vol06chap03sect01to05.html The Voyage of Don Stefano de Gama from Goa to Suez, in 1540, with the intention of Burning the Turkish Galleys at that port] (Volume 6, Chapter 3, eText)"
    }
  ]
}