{
  "content": [
    {
      "type": "text",
      "text": "# Estonian Working People's Union\n\nThe '''Estonian Working People's Union' () was a front organization of the Communist Party of Estonia  (de facto'' controlled by the Soviet Union and the Communist Party of the Soviet Union) formed to contest in the rigged 1940 Estonian parliamentary election, as the sole officially allowed bloc. It consisted of 22 organizations, including the formally independent Estonian Communist Party, Estonian branch of Komsomol, the Central Union of Estonian Trade Unions and cultural society \"Idea\". Its platform claimed to unite \"democratic strata of the society\" and demanded friendship and alliance between Estonia and the USSR, democratic liberties, raising salaries, combatting unemployment, social security, land for the landless, assistance for small farms, lowering the workers' burden of debt, re-organization of personal taxation, free education, ethnic equality, democratization of the military and wide development of national culture. According to official results, 92.8% of voters voted for the bloc, with a voter turnout of 84%.\nSimilar organizations were set up in the other two occupied Baltic States for the same purpose: Union of the Working People of Lithuania and Latvian Working People's Bloc.\nJuly Council\nThe new People's Parliament of Estonia . Despite the fact that the platform of the bloc did not explicitly call for the unification of Estonia with the Soviet Union, only for their alliance, the parliament, informally called \"Juulivolikogu\" (\"July Council\"), on its first session, on July 21, voted unanimously to convert the state to Estonian SSR, renamed itself to \"the Provisional Supreme Soviet of the Estonian Soviet Socialist Republic\" and on July 22 declared accession to the Soviet Union. On June 23 the parliament sent a petition to the Soviet Supreme Soviet asking to join, which was granted on August 6, 1940.\nSee also\n*List of members of the Supreme Soviet of the Estonian Soviet Socialist Republic, 1940–1947\n*Soviet occupation of the Baltic states.\nReferences\n*Estonian Soviet Encyclopedia, Tallinn, 1987, vol 2, p. 456."
    }
  ]
}