{
  "content": [
    {
      "type": "text",
      "text": "# Ethem (Jaredite king)\n\n, one of the sacred scriptures of Mormonism and the source of the account of Ethem]]\nEthem (Deseret: 𐐀𐐛𐐇𐐣), in the beliefs of the Latter Day Saint movement (Mormons), was a Jaredite king, the son of Ahah. Information about him is found in the Book of Ether, a part of the sacred scriptures of Mormonism. His reign belongs to the later period of Jaredite history and was reportedly marked by wickedness and the activities of prophets calling for repentance. Ethem's rule lasted until his death.\nThe figure of Ethem is the subject of theological speculation and is sometimes referenced by Mormon apologists. Additionally, the name Ethem appears among Māori who follow Mormonism.\nPronunciation and spelling\nThe pronunciation of this name has sparked some interest among Mormon researchers. It was included in the pronunciation guide that has been attached to each copy of the English-language version of the Book of Mormon since 1981. However, sources indicate a significant difference between the preferred and common pronunciation today and that of the early period of Utah Territory's colonization. The original pronunciation, especially that used by Joseph Smith, holds some significance in the study of proper names found in the Book of Mormon, though it is not a decisive factor in Mormon theology. To determine the pronunciation used by Smith, scholars refer to the Book of Mormon edition in the Deseret alphabet from 1869.\nHowever, there are accounts from those involved in the process known as the translation of the Book of Mormon by the Latter-day Saints that shed light on how Smith initially dealt with unfamiliar words. Hugh Nibley, citing the accounts of Smith's scribes, stated that \"he never pronounced such words, always settling for spelling them out\". Strictly speaking, within Mormon theology, the original pronunciation of this word is not sought, just as no such inquiry is made for the Nephite words and names themselves.\nAdditionally, within Mormon theology, the inherent difficulty of pronouncing names and words belonging to this sacred text is recognized. This is because none of these words were transmitted to Joseph Smith orally, except perhaps for the name Moroni, who introduced himself to Smith in a vision. From a doctrinal standpoint, the way the characters in the Book of Mormon pronounced these words remains unknown to the first Mormon leader.\nIn the manuscript handed to the printer responsible for the first edition of the Book of Mormon (1830), the name appeared as \"Etham\" instead of the \"Ethem\" used in the English text. This error was corrected in the text that was printed. The mistake likely stemmed from the unaccented final syllable of the word, and it pertained to the passage that, in the contemporary verse division, corresponds to the 11th verse of the 11th chapter of the Book of Ether. In all subsequent editions, the form \"Ethem\" consistently appeared.\nLocation in the Book of Mormon\nIn a strictly theological sense, the account of Ethem is found in the section of material referred to as the plates of Mormon, which is a summary of the larger plates of Nephi, made by Mormon. This section is placed within the part of the text added to the plates of Mormon by Moroni. The content of the Book of Ether, of which the account of Ethem is a part, consists of a summary of the 24 gold plates of Ether, compiled by Moroni.\nIn the official editions of the Book of Mormon, including the one in use since 1981, Ethem is mentioned in verses 8 and 9 of the first chapter of the Book of Ether, as well as in verses 11, 12, and 14 of the 11th chapter of the same book. The chapter and verse division system in use today dates back to 1879. In the first edition of the Book of Mormon, published in 1830, references to Ethem were part of chapters 1 and 4 of the Book of Ether. It is estimated that the material referring to Ethem was recorded on 25 and 28 May 1829.\nRole in the Book of Mormon\nInformation about Ethem, like other Jaredite figures, is found in the Book of Ether. His reign belongs to the later period of Jaredite history. According to the genealogy preserved in the Book of Mormon, he was the son of Ahah and the father of Moron. In his 1891 work A Dictionary of the Book of Mormon, Comprising Its Biographical, Geographical, and Other Proper Names, the elder George Reynolds suggested that the life of this ruler should be placed in the 8th century BCE. According to one interpretation, the suggestion directly derived from the source text that Ethem may have been a descendant of Ahah rather than his direct son can be dismissed based on a comparative analysis of the two genealogies in the Book of Ether.\nHis reign was marked by wickedness. It was also the time when numerous prophets worked in the Jaredite lands. They warned of inevitable destruction if there was no repentance and rejection of Jesus Christ. Commentaries have also speculated about the circumstances under which Ethem ascended the throne, suggesting that they may not have been peaceful. He ruled until his death. After his death, his son took over the throne. Commentators have speculated about the nature of the succession after Ethem, suggesting that, similar to the previous generation's transition of power, it may not have been peaceful. It has been noted that the name of Ethem's son and successor is identical to the name of the city that was the Jaredite capital.\nIn Mormon theology and studies on the Book of Mormon\nThe existence of Ethem has not been confirmed in external sources. Linguists associated with The Church of Jesus Christ of Latter-day Saints have considered the etymology of this ruler's name, but no likely etymology has been identified. They have questioned the previously suggested Semitic etymology. In studies of names typical of the Book of Mormon, the name Mormon has appeared for over a century. In his 1909 work New Witnesses for God: Part III. The Evidences of the Truth of the Book of Mormon, B. H. Roberts used the name of this monarch to demonstrate the difference between the naming practices of the Jaredites and the Nephites.\nIn a strictly theological sense, studies on the etymology of Jaredite proper names remain speculative. However, certain results have been achieved, especially if one accepts that some names were translated into the language used by the Nephites. It has also been stated in another source that a convincing connection between the Jaredites and known ancient cultures could shed light on this matter.\nJohn W. Welch, in his extensive commentary on the Book of Mormon published in 2020, noted that Ethem appears twice in this text, each time in a specific order. The first time, he is placed in a genealogical order, starting with Ether and ending with Jared. The second time, he appears chronologically, with Jared as the progenitor of the Jaredites at the beginning, and Ether, the prophet, chronicler, and prince, at the end. The precision of this reversed placement of Ethem in the text was considered remarkable, and Welch regarded it as one of the manifestations of divine inspiration, enabling Joseph Smith to translate the Book of Mormon.\nIn Mormon culture\nRegardless of the etymological and theological speculations, Ethem has found a place in Mormon culture. He appears in church-published materials of an entertaining and educational nature, such as in the Friend magazine from May 1987. The name Ethem (spelled as Etheme) is also found among Māori converts to Mormonism.\nReferences\nBibliography\n*\n*\n*\n*\n*"
    }
  ]
}