{
  "content": [
    {
      "type": "text",
      "text": "# Ethiopian Republican Guard\n\n| disbanded                     =\n| country                       =\n| allegiance                    =\n| branch                        =\n| type                          = Praetorian GuardSpecial operations forceAirborne forcesMechanized infantry\n| role                          = Special operationsCounter-terrorismSpecial reconnaissanceAirborne infantry\n| size                          =\n| command_structure             =  Ethiopian National Defense Force\n| garrison                      =\n| garrison_label                =\n| nickname                      =\n| patron                        =\n| motto                         =\n| colors                        =\n| colors_label                  =\n| march                         =\n| mascot                        =\n| anniversaries                 =\n| equipment                     =\n| equipment_label               =\n| battles                       =\n* Ethiopian civil conflict (2018-present)\n** Tigray War\n** War in Amhara\n| decorations                   =\n| battle_honours                =\n| battle_honours_label          =\n| flying_hours                  =\n| website                       =\n| commander1                    = President Taye Atske Selassie\n| commander1_label              = Supreme Commander\n| commander2                    = Prime Minister Abiy Ahmed\n| commander2_label              = Commander-in-chief\n| commander3                    = Abraham Belay\n| commander3_label              = Ministry of Defense\n| commander4                    = Field Marshal Birhanu Jula\n| commander4_label              = Chief of the General Staff\n| commander5                    = General Abebaw Tadesse\n| commander5_label              = Deputy Chief of the General Staff\n| commander6                    = Brigadier General Tesfaye Regassa\n| commander6_label              = Commander of the Republican Guard\n| notable_commanders            =\n| identification_symbol         =\n| identification_symbol_label   =\n| identification_symbol_2       =\n| identification_symbol_2_label =\n| identification_symbol_3       =\n| identification_symbol_3_label =\n| identification_symbol_4       =\n| identification_symbol_4_label =\n| identification_symbol_5       =\n| identification_symbol_5_label =\n}}\nThe Ethiopian Republican Guard (ERG; ) is an elite praetorian guard unit and the special forces branch of the Ethiopian National Defense Force (ENDF). It is tasked with providing protection to the Prime Minister and top government officials in Ethiopia and specializes in special operations.\nHistory\nEthiopia had an Imperial Guard during the reign of Emperor Haile Selassie, but the Derg disestablished it in 1974. Since 1991, Ethiopian leaders and officials have been protected by security details assigned by the Ethiopian National Intelligence and Security Service (NISS). The security arrangement did not, however, form a force specifically dedicated to this task.\nThe Republican Guard was established in summer 2018, following an alleged assassination attempt by an explosion of a hand grenade in the middle of a crowd attending a speech in Addis Ababa of Prime Minister Abiy Ahmed on 23 June 2018.\nAlongside the June 2018 attack, the Office of Prime Minister linked the establishment of the Republican Guard to other disturbances occurred in Ethiopia.\nand Mike Pompeo.]]\nMission\nThe Republican Guard is tasked with defending the Ethiopia's constitution and constitutional order, specifically by protecting the highest level of Ethiopian leadership from threats and attempted attacks. In its specific objective, the Republican Guard is mandated to use any means necessary.\nOrganization\nThe Republican Guard is its own independent branch within the ENDF and separate from the Ethiopian Ground Forces, and answerable only to the Prime Minister.\nAt the time of its establishment, the Chief Commander of the Republican Guard was Brigadier General Birhanu Jula, later replaced by Major General Berhanu Bekele.\nAccording to Michael Schmidt, the Guard is mostly staffed by soldiers of ethnic Oromo descent.\nBranches\nAs of 2021, the Republican Guard is structured on four different branches, tasked with various missions. The bulk of the Republican Guard members is tasked with protecting VIPs.\n* Counter Military Unit: the Counter Military Unit is a militarily uniformed unit inside the Republican Guard that carries heavy assault rifles such as Tavor-21 and American M-4's and other heavy weapons such as long range snipers that can penetrate bullet proof glass.\n* Republican Guard Special Force: the Republican Guard Special Force is tasked with protecting any high level locations that are militarily, economically, and of national security importance such as Headquarters of the ENDF generals and high military officials.\n* Republican Guard Military Police: the Military Police is tasked with dealing with security issue should the Federal Police fail.\nEquipment\nThe Republican Guard are armed with the Israeli-made Tavor Tar-21 and CAR 816 assault rifles, and long range snipers. The Republican Guard also uses helicopters like the Mi-8 and Mi-17 as well as armored vehicles like the BRDM-2 and WZ-551 to protect the Prime minister and President of Ethiopia. They carry hidden guns and use in ear communication. They participate in both special forces and airborne operations and are estimated to be in the thousands.\nReferences"
    }
  ]
}