{
  "content": [
    {
      "type": "text",
      "text": "# Ethiopian Marxist–Leninist Revolutionary Organization\n\nThe Ethiopian Marxist–Leninist Revolutionary Organization (Amharic: ማርክሳዊ ሌኒናዊ ሪቮሊሽናዊ ድርጅትን), commonly known by its Amharic acronyms Malered or Emelared (Amharic: ማሌሪድ), was a communist organization in Ethiopia active from 1974 to the late 1970s.\nFormation\nAccording to Bahru Zewde, the organization was formed through the merger of a domestic faction and an exiled splinter group of the Ethiopian People's Revolutionary Party (EPRP). According to Christopher Clapham, Malered could have been formed by EPRP members who wished to cooperate with the Derg military junta. Andargachew Tiruneh, on the other hand, states that Malered could have emerged as an offshoot of the All-Ethiopian Socialist Movement (MEISON) Youth League. Fred Halliday supports the theory that Malered originated in Meison.\nOrganization\nMalered was led by Gulilat. Politically, Malered was close to Meison. Malered gave support to the Derg military junta, and the group was represented in the Provisional Office for Mass Organizational Affairs (POMOA). Malered supported the entry of Seded (the new political organization formed by Derg militaries schooled in Marxism-Leninism) into POMOA. When the National Democratic Revolutionary Programme of Ethiopia was declared in April 1976, Malered expressed its support to it and its willingness to join a common front with other groups supporting the revolution. In December 1976, Malered published its own programme.\nIn 1977, Malered took part in forming the Union of Ethiopian Marxist-Leninist Organizations together with four other groups (MEISON, Seded, Echat and Waz League). Malered was the smallest of these five parties.\nConclusion\nAfter the split between the Derg and Meison, the Derg would eventually begin crushing the smaller leftist groups like Malered. Malered was eliminated from POMOA. As of July 1979, there were reports that member of Malered had been arrested. At the time, Malered was the sole civilian political group still aligned with the Derg.\nReferences"
    }
  ]
}