{
  "content": [
    {
      "type": "text",
      "text": "# European Commissioner for Democracy, Justice, the Rule of Law and Consumer Protection\n\nThe European Commissioner for Democracy, Justice, the Rule of Law and Consumer Protection is a member of the European Commission. The current holder is Michael McGrath.\nPortfolio\nThe post was created in 2010 by splitting the previous Justice, Freedom and Security portfolio into a justice post (the subject covered here) and a security post: the Commissioner for Home Affairs. This split was made as a concession to the liberals in the European Parliament to gain their support for the second Barroso Commission.\nA major innovation of the Juncker Commission is the nomination of a First Vice-President, Frans Timmermans, for Better Regulation, Inter-Institutional Relations, Rule of Law and the EU Charter of Fundamental Rights. His role includes to \"guide and coordinate all other Justice and Home Affairs(JHA)-related Commissioners, in particular those of the new DG Justice (Věra Jourová) and the DG Home Affairs (Dimitris Avramopoulos)\".\nThe portfolios of Justice and Equality were previously combined as Commissioner for Justice, Consumers and Gender Equality under commissioner is Věra Jourová; however, the two portfolios were split in 2019.\nThe portfolio of the Commissioner has evolved under the Juncker Commission and renamed into Justice, Consumers and Gender Equality. Major changes are:\n*\"The Commissioner for Justice no longer holds the title [of \"Commissioner for EU Citizenship\"] that was used in the previous Commission. [...] Other citizenship-related matters regarding ‘communication to citizens’ have been moved from DG Communication and attributed to the new Commissioner for Education, Culture, Youth and Citizenship.\"\n*\"Issues related to non-discrimination in employment [and the rights of persons with disabilities] have been removed from DG JUST and placed back under DG Employment, Social Affairs and Inclusion. However, DG JUST still holds responsibility for the wider non-discrimination portfolio.\"\n*DG JUST gained competences on issues related to Corporate Governance and Social Responsibility, previously in DG Internal Market and Services (MARKT), and on issues related to Consumer Affairs. Regarding Consumer Affairs, the whole directorate has been transferred from DG Health and Consumers (SANCO) - now DG Health and Food Safety (SANTE), except for Health Technology and Cosmetics issues, for which DG Enterprise and Industry (ENTR) gained responsibility.\n*The responsibility of Anti-Drug Policy has been transferred to DG Home Affairs (HOME).\nList of commissioners\nDG Justice, Freedom and Security (1995–2010)\n{| class=\"wikitable\"\n|-\n!colspan=2|Name\n!Country\n!Period\n!Commission\n|-\n|\n| Anita Gradin\n|\n| 1995–1999\n| Santer Commission\n|-\n|\n| António Vitorino\n|\n| 1999–2004\n| Prodi Commission\n|-\n|\n| Franco Frattini\n|\n| 2004–2008\n| Barroso Commission I\n|-\n|\n| Jacques Barrot\n|\n| 2008–2010\n| Barroso Commission I\n|}\nDG Justice and Consumers (2010–2024)\n{| class=\"wikitable\"\n|-\n!colspan=2|Name\n!Country\n!Period\n!Commission\n|-\n|\n| Viviane Reding\n|\n| 2010–2014\n| Barroso Commission II\n|-\n|\n| Věra Jourová\n|\n| 2014–2019\n| Juncker Commission\n|-\n|\n| Didier Reynders\n|\n| 2019–2024\n| Von der Leyen Commission I\n|}\nDemocracy, Justice, the Rule of Law and Consumer Protection (2024-present)\n{| class=\"wikitable\"\n|-\n! colspan=\"2\" |Name\n!Country\n!Period\n!Commission\n|-\n|\n| Michael McGrath\n|\n| 2024–2029\n| Von der Leyen Commission II\n|}\nSee also\n* Directorate-General for Justice\n* European Commissioner for Home Affairs\n** Directorate-General for Home Affairs\n* Justice and Home Affairs Council (Council of the European Union)\n** Directorate-General for Justice and Home Affairs\n* European Parliament Committee on Civil Liberties, Justice and Home Affairs\n* Area of freedom, security and justice\n* Charter of Fundamental Rights\n* Four Freedoms\n* Eurojust\n* Fundamental Rights Agency\n* Court of Justice\nExternal links\n* [http://ec.europa.eu/commission/2014-2019/jourova_en Commissioner's Website]\n* [http://ec.europa.eu/justice/index_en.htm Directorate-General for Justice Website]\nReferences"
    }
  ]
}