{
  "content": [
    {
      "type": "text",
      "text": "# European Arrest Warrant__disambig_1\n\nThe European Arrest Warrant (EAW) is an arrest warrant valid throughout all member states of the European Union (EU). Once issued, it requires another member state to arrest and transfer a criminal suspect or sentenced person to the issuing state so that the person can be put on trial or complete a detention period. It is a simplified cross-border judicial surrender method, and has replaced the lengthy extradition procedures that used to exist between member states. The EAW has been in force since 1 January 2004 in all Member States.\nAn EAW issued by one of the Member States is valid in the entire territory of the EU. The mechanism is based on the principle of mutual recognition. An EAW can be issued only for the purposes of conducting a criminal prosecution (not merely an investigation), or for enforcing a custodial sentence. It can be issued only for offences carrying a minimum penalty of one year or more in prison. Where the sentence has already been passed, an EAW can be issued only if the prison term to be enforced is at least four months long.\nConsidering the severe consequences an EAW can have, it should always be proportional to its aim. This means that the judicial authority issuing an EAW should always carry out a proportionality check, before deciding on whether to issue it in the first place. Such a check is carried out by considering several factors that can be used to determine whether issuing an EAW is justified.\nThe introduction of the EAW system was intended to increase the speed and ease of extradition throughout EU countries by removing the political and administrative phases of decision-making which had characterised the previous system of extradition in Europe, and converting the process into a system run entirely by the judiciary. Since it was first implemented in 2004 the use of the EAW has risen. Member state country evaluation reports suggest that the number of EAWs issued has increased from approximately 3,000 in 2004 to 15,200 in 2009, but dropped back to 10,400 in 2013.\nEven though the system has reinforced the fight against organized crime, it is also considered \"highly controversial\" due to its potential for abuse. It, for instance, raises issues with constitutional law. Moreover, human rights organizations have expressed concerns about the imprisonment of innocent persons, the disproportionality of the EAW and violations of procedural rights.\nBackground\nMeasures which sought to harmonise extradition rules across EU member states date from the mid-1990s when the EU instituted two treaties under the Maastricht Treaty which sought to streamline existing extradition procedures under the European Convention on Extradition. In 1999, the European Council further proposed to abolish formal extradition procedures for sentenced persons. In 2001, the Chairman of the European Parliament's Committee on Citizens’ Rights and Freedoms, Justice and Home Affairs – MEP Graham Watson – piloted through Parliament an Own-Initiative Report calling for the creation of a European Arrest Warrant and proposing the structure and content of legislation to achieve it. The Report was adopted by Parliament on 5 September. Watson's initiative was welcomed by the EU's Justice and Home Affairs Commissioner, Antonio Vitorino. Its timing was propitious, since only six days later, in the immediate aftermath of the September 11 attacks in the United States, these far-reaching proposals were taken up by the European Commission, which made a formal legislative proposal to Council and Parliament. The political decision to adopt the EAW legislation was made at the Laeken European Council in December 2001, the text being finally agreed in June of the following year.\nThe European Arrest Warrant was established by an EU framework decision in 2002. Framework decisions were legal instruments of the third pillar of the European Community akin to directives and only take effect when implemented by EU member states by transposing them into their domestic law. The European Arrest Warrant replaced the 1957 European Convention on Extradition (ECE) which had previously governed extraditions between most member states, and various legal instruments which had been adopted to streamline the process of extradition under the ECE such as the 1989 agreement on the simplification of the transmission requests for extradition, the 1995 Convention on simplified extradition procedure, the 1996 Convention on extradition between Member States, and the provisions of the Schengen Agreement regarding extradition.\nThe EAW Framework Decision came into force on 1 January 2004 in eight member states, namely Belgium, Denmark, Finland, Ireland, Portugal, Spain, Sweden, and the United Kingdom. By 1 November 2004, all member states had implemented the legislation except Italy, which did so on 22 April 2005. Bulgaria and Romania implemented the Decision on their accession in 2007.  When the UK exercised its opt-out from the area of freedom, security and justice in 2014, its request to continue participating in the EAW was approved.\nDistinctive features\nThere are several features of the European Arrest Warrant which distinguish it from the treaties and arrangements which previously governed extradition between EU member states. EAWs are not issued through diplomatic channels, they can be executed for a wide variety of offences without any requirement that the offence to which the warrant relates corresponds to an offence under the law of the state asked to execute the warrant, there is no exception for political, military or revenue offences, and there is no exception clause allowing a state to refuse to surrender its own nationals.\nDouble criminality\nDouble criminality is a feature of international extradition law by which states may refuse to extradite fugitives if the conduct which is alleged to have constituted a criminal offence in the state requesting extradition would not have resulted in the commission of a criminal offence in the state being asked to effect the extradition.\nUnder the EAW Framework Decision, the requirement for double criminality is removed for a wide range of categories of crimes, and made a discretionary rather than a compulsory ground for a refusal to extradite for offences not falling within those categories.\nThe categories within which are as follows:\n* Arson,\n* Computer-related crime,\n* Corruption,\n* Counterfeiting currency,\n* Counterfeiting and piracy of products,\n* Crimes within the jurisdiction of the International Criminal Court,\n* Environmental crime, including illicit trafficking in endangered animal species and in endangered plant species and varieties,\n* Facilitation of unauthorised entry and residence,\n* Forgery of means of payment,\n* Forgery of administrative documents and trafficking therein,\n* Fraud, including fraud affecting the financial interests of the European Union,\n* Illicit trade in human organs and tissue,\n* Illicit trafficking in cultural goods, including antiques and works of art,\n* Illicit trafficking in hormonal substances and other growth promoters,\n* Illicit trafficking in narcotic drugs and psychotropic substances,\n* Illicit trafficking in nuclear or radioactive materials,\n* Illicit trafficking in weapons, munitions and explosives,\n* Kidnapping, illegal restraint and hostage-taking,\n* Laundering of the proceeds of crime,\n* Murder, grievous bodily injury,\n* Organised or armed robbery,\n* Participation in a criminal organisation,\n* Racism and xenophobia,\n* Rape,\n* Racketeering and extortion,\n* Sabotage\n* Sexual exploitation of children and child pornography,\n* Swindling,\n* Terrorism,\n* Trafficking in human beings,\n* Trafficking in stolen vehicles,\n* Unlawful seizure of aircraft or ships.\nThe Framework Decision is silent as to whether secondary participation in, or an attempt to commit, an offence of the kind listed here itself excluded from the requirement for correspondence.\nAnother issue which has arisen is the accuracy of a description of an offence as being in a category exempt from the requirement for correspondence, and whether the executing judicial authority is required to accept the issuing judicial authority's classification as definitive.\nSurrender of nationals\nPrior to the adoption of the EAW Framework Decision in 2002, 11 of the then 15 member states – namely Austria, Belgium, Denmark, Finland, France, Germany, Greece, Luxembourg, Portugal, and Sweden — had domestic rules which prevented the extradition of their nationals. Although the Nordic EU members – Denmark, Finland, and Sweden – did allow the extradition of their nationals to each other and to other Nordic countries, they refused the extradition of both their nationals and the nationals of other Nordic countries elsewhere. In addition seven of the 12 member states which joined between 2004 and 2007 – namely Bulgaria, Cyprus, the Czech Republic, Latvia, Lithuania, Poland, and Slovenia – employed a similar prohibition prior to their accession.\nUnder the Framework Decision, member states are precluded from refusing the surrender of their own nationals wanted for the purposes of prosecution, but they may condition the surrender of a requested person on his or her being returned to the issuing state to serve any sentence ultimately imposed. The Netherlands which requires issuing states to return both Dutch nationals and permanent residents, also requires issuing states to agree that any sentences imposed will be converted into those applicable under Dutch law using the 1995 Convention on the Transfer of Sentenced Persons. This has the effect of re-introducing the double-criminality requirement for Dutch nationals and permanent residents, as the conversion of a sentence imposed in an issuing state could not be converted into a comparable sentence by a Dutch court if the conduct constituting the criminal offence in the issuing state does not constitute a criminal offence in the Netherlands.\nGrounds for refusal to execute warrant\nThe EAW Framework Decision sets out the reasons by which the executing judicial authority must or may refuse to surrender a person subject to an arrest warrant. Many member states have enacted other reasons by which surrender may be refused which are not referred to in the Framework Decision. Some countries also consider the risks of possible human rights violations, such as inadequate conditions of detention or lack of fair trial guarantees in the issuing state. In such cases, national courts may refuse to execute the EAW based on the principles of international law and the decisions of the European Court of Human Rights.\nMandatory grounds under the Framework Decision\nUnder the Framework Decision the executing judicial authority must refuse to surrender the requested person if:\n* The alleged offence comes under the jurisdiction of the courts of the executing state and is the subject of an amnesty there,\n* The requested person has been acquitted in a member state of the European Union of an offence in respect of the same acts as contained in the arrest warrant, or was convicted of that offence and has served the sentence imposed (if any) for that offence, or\n* The requested person is below the age of criminal responsibility in the executing state.\nOptional grounds under the Framework Decision\nUnder the Framework Decision the executing judicial authority may refuse to surrender the requested person if:\n* The requested person is being prosecuted in the executing member state for the same act;\n* The prosecutorial authorities in the executing state decided not to prosecute the requested person, or, having begun such a prosecution halted it;\n* The requested person was being prosecuted in the executing member state, that case having progressed to final judgement;\n* The act on which the EAW is based comes under the jurisdiction of the executing member state and would be statute-barred there;\n* The requested person was prosecuted in a third country, the final judgement having been made, provided that the sentence in respect of the offence (if one was imposed) had been served or may no longer be executed under the laws of the third country;\n* The offence was committed or alleged to have been committed in the territory of the executing state; or\n* The offence was committed or alleged to have been committed other than in the territory of the issuing state and the law of the executing state would not allow for the prosecution of the same offence if committed outside its territory.\nTrials in absentia\nIn 2009 the Council of Ministers amended the EAW framework decision with the express intention of \"enhancing the procedural rights of persons and fostering the application of the principle of mutual recognition to decisions rendered in the absence of the person concerned at the trial\". Framework Decision 2009/299/JHA deleted Art. 5(1) FD 2002/584/JHA and introduced Art. 4a. Article 4a introduced a ground for optional refusal to execute by the respective executing judicial authority. Art. 5(1) allowed the execution of a European Arrest Warrant dependant, on a guarantee by the issuing judicial authority concerning an opportunity for a retrial if the EAW was issued to enforce an in absentia decision. It was deemed necessary to replace the former Art. 5(1), because it left the assurance provided by the issuing authority up for the judgment to the executing judicial authority. In absentia trials have been problematic since the very beginning of the EAW, also since there was uncertainty as to what exactly entails the concept of “in absentia” in the Member States. The 2009 amendment besides introducing Art. 4a, has also specified the admissible grounds for refusal of the execution of a European Arrest Warrant.  Under the 2009 framework decision, an executing judicial authority may refuse to execute a European Arrest Warrant unless the requested person:\n* was summoned in person and, knowing the time and place of the trial in due time and that judgement might be made against him or her if he or she failed to attend, failed to attend;\n* was not summoned in person but, it was unequivocally established that he or she was aware of the time and place of the trial in due time and that judgment might be made against him or her if he or she failed to attend, failed to attend;\n* knowing that a trial was scheduled, had instructed lawyers to defend the case, who duly did so;\n* was served with the judgement and told of his or her right to a retrial or appeal de novo, and decided not to contest the judgement or failed to request such a retrial or appeal within the applicable time limit; or\n* may request a retrial or make a de novo appeal upon his or her surrender.\nThe 2009 Framework Decision should have been implemented by member states by 28 March 2011.\nHowever, even after the amendment, there are still significant issues with the application of Art. 4a(1). InAbsentiEAW research project has shown that there are significant differences between Member States in the execution as well as issuing of the EAW. The report has analyzed the judicial cooperation between several Member States and has concluded that issues with the application of Art. 4a(1) can cause delays, and extra costs, necessitating executing authorities to request supplementary information or even unjustified refusals to execute the EAW. Such issues meddle with the idea of a high level of mutual trust between judicial authorities and hinder the objectives of the EAW.\nHuman rights\nArticle 3 of the Framework Decision which lists grounds upon which executing states must refuse to surrender a requested person does not expressly include any ground for refusing the surrender of a requested person if that surrender would infringe a person's human rights. However recitals (12) and (13) of the preamble and Article 1(3) do refer to human rights:\nIn 2006, 20 of the then 25 member states included text which was based on at least one of these provisions or which explicitly referred to the European Convention on Human Rights, in their domestic implementing legislation. The others took the view that the rights exist independently from the Framework Decision.\nFair Trials International (FTI), the London-based human rights non-governmental organisation, claims to have highlighted a number of cases which demonstrate that the European Arrest Warrant system is causing serious injustice and jeopardising the right to a fair trial. In particular, FTI allege that:\n* European Arrest Warrants have been issued many years after the alleged offence was committed.\n* Once warrants have been issued there is no effective way of removing them, even after extradition has been refused.\n* They have been used to send people to another EU member state to serve a prison sentence resulting from an unfair trial.\n* Warrants have been used to force a person to face trial when the charges are based on evidence obtained by police brutality.\n* Sometimes people surrendered under an Arrest Warrant have to spend months or even years in detention before they can appear in court to establish their innocence.\nConditional surrender\nThe Framework Decision also establishes the possibility for executing member states to request certain guarantees from issuing states prior to ordering the surrender of a requested person. Whether and how member states require such guarantees depends on the law of the member state in question.\n* Where a requested person is liable on conviction to life imprisonment, the executing state may make the surrender subject to the requested person having the legal right to apply for parole after having served twenty years.\n* Where a requested person is a national or a resident of the executing state, the executing state may make the surrender subject to the requested person being returned to the executing state to serve any prison sentence ultimately imposed.\nProcedure\nIssuing judicial authority\nA European Arrest Warrant may only be issued by the competent judicial authority in an EU member state or a state with a special agreement with the EU. The issuing judicial authority must complete a form stating identity and nationality of the person sought, the nature and legal classification of the offence, the circumstances surrounding the alleged committal of the offence including when and where it was committed and the degree of participation of the person sought, and scale of penalties for the offence.\nMany member states have designated public prosecutors as their judicial authorities for the purposes of the framework decision. Such designations have been questioned before the British and Irish courts on the basis that in order for an authority to be judicial it should be a court or judge. In both countries, the designated issuing authority is a judge. However the courts of each have rejected these arguments. In Assange v Swedish Prosecution Authority the High Court of England and Wales found that:\n}}\nOn appeal, the UK's Supreme Court affirmed the decision of the High Court and found that, when comparing different language versions, the framework decision demonstrated an intention to regard public prosecutors as judicial authorities and that the conduct of the member states since its enactment confirmed this interpretation.\nTransmission\nUnlike traditional extradition arrangements, EAWs need not be transmitted to any particular state. The intent of the Framework Decision is that EAWs be immediately recognised by all member states once issued. When a person subject of an EAW is found within the jurisdiction of a member state and arrested, that member state is required by the Framework Decision to execute the warrant.\nIf the whereabouts of the person sought are known, the EAW may be transmitted directly to the designated central authority of that member state. Otherwise the issuing judicial authority may seek the assistance of the European Judicial Network in circulating the warrant, may seek to issue an alert under the Schengen Information System, or may seek the services of Interpol.\nMinimum threshold\nThe EAW Framework Decision requires that a warrant can only be issued when an offence is punishable by imprisonment or a detention order for a maximum period of at least one year, or in conviction cases, where the remaining term of imprisonment is four months or more. This can nonetheless include a wide variety of trivial offences. In 2007, a report commissioned by the Presidency of the Council of Ministers noted that EAWs had been issued for such offences as possession of 0.45&nbsp;grams of cannabis, possession of 3 ecstasy tablets, theft of two car tyres, driving under the influence of alcohol where the limit was not significantly exceeded, and theft of a piglet. The report concluded that it would be appropriate to have a discussion at EU level on the proportionate issuance of European Arrest Warrants.\nArrest\nWhile the manner in which the arrest of a person the subject of an EAW is not specified in the Framework Decision, once arrested, he or she has the right to be informed of the warrant, its contents, and the person's right to consent to his or her surrender to the member state that issued the warrant. The Framework Decision also provides that the requested person have the right to the assistance of legal counsel and to an interpreter \"in accordance with the national law of the executing Member State\".\nTime limits\nThe Framework Decision prescribes time limits for the making of a final decision to a surrender request. Where a requested person consents to his or her surrender, the executing judicial authority should make a final decision within ten days of such a consent. Where a requested person refuses to consent to his or her surrender, the executing judicial authority should make a final decision within 60 days of the arrest. In 2011 the European Commission reported that the average time for the surrender of persons who consented was 16 days while the average time for those who did not consent was 48.6 days.\nSpecialty\nA state wishing to prosecute a surrendered person for offences committed before his or her surrender, or extradite a surrendered person to a third state, must, subject to certain exception, obtain the permission of the executing judicial authority. Such a request is made in the same form as a European Arrest Warrant, and granted or refused using the same rules which determine whether surrender would be granted or refused.\nThis requirement is referred to as the principle of 'specialty' and is intended to ensure that a state cannot seek the surrender of a person for an extraditable offence whilst intending to prosecute that person for a non-extraditable offence once surrendered, or extradite the surrendered person to a third state for an offence which would not have been extraditable offence from the original executing state.\nBy default the principle of 'specialty' applies to all persons surrendered pursuant to a European Arrest Warrant unless the executing judicial authority indicates otherwise. However this position may be reversed where both the issuing and the executing states have made declarations to that effect.\nThe permission of the executing state is not required:\n* For offences which could not incur custodial sentences, or which could only incur them as a result of the failure to pay a fine,\n* Where the surrender person was discharged from custody and having had the opportunity to leave that state (i.e. the original issuing state) remained there for 45 days, or left that state only to return,\n* The surrendered person renounced his or her right to specialty either before or after his or her surrender,\n* Where the person is sought by another state pursuant to a European Arrest Warrant and consents to being surrendered to that state.\nControversy\nSince its implementation in 2004, the EAW system has been occasionally criticised for inappropriate or disproportionate use. Following a report by an internal working party, the Presidency of the Council of the European Union suggested in 2007 that it would be appropriate to have a discussion at EU level on the\nprinciple of proportionality which is outset in article 5 of the Treaty establishing the European Community and how to take this principle into consideration by judicial authorities when issuing a European arrest warrant.\nEAWs have been issued for minor offences such as possession of 0.45&nbsp;grams of cannabis; theft of two car tyres; driving a car under the influence of alcohol, where the limit was not significantly exceeded (0.81&nbsp;mg/L) and the theft of a piglet. In the UK, persons arrested under an EAW have been extradited for minor offences such as the stealing of ten chickens (Romania), unintentionally receiving a stolen mobile phone (Poland), and theft of £20 worth of petrol (Czech Republic).\nAt the other extreme, the EAW has failed in some cases. The Irish Supreme Court refused to extradite an Irish citizen to Hungary who was alleged to have killed two children through negligent driving. While the Irish Court never questioned the facts of the case or the fairness or outcome of the Hungarian trial, it decided that the person did not technically \"flee\" from Hungary, only \"failed to return\", having left the country with the consent of the Hungarian authorities; therefore, the legal requirements for extradition under an EAW had not been established. However, the requirement that the person have \"fled\" the requesting jurisdiction has since been removed from Irish law, and a new warrant has been issued by the Hungarian authorities.\nIn the case of Carles Puigdemont (alleged to have committed sedition by Spanish authorities in connection with the 2017 Catalan independence referendum), some MEPs and legal commentators criticised the Spanish Government for appearing to have opportunistically issued and withdrawn his European Arrest Warrant based on the likelihood of its success in different EU member states Puigdemont was travelling through.\nSee also\n*Area of freedom, security and justice\n*Eurojust\n*European Investigation Order\nReferences\nExternal links\n*[http://eur-lex.europa.eu/LexUriServ/LexUriServ.do?uri=CELEX:32002F0584:EN:HTML Text of the framework decision] (as enacted)\n*[http://eur-lex.europa.eu/LexUriServ/LexUriServ.do?uri=CONSLEG:2002F0584:20090328:EN:PDF Consolidated text of the framework decision]\n*[http://ec.europa.eu/justice/criminal/recognition-decision/european-arrest-warrant/index_en.htm Information page on European Arrest Warrants] from the European Commission\n*Schorkopf, Frank. [https://archive.today/20130129081228/http://www.mpepil.com/sample_article?id=/epil/entries/law-9780199231690-e611&recno=17& European Arrest Warrant], Max Planck Encyclopedia of Public International Law\n*[http://www.asser.nl/default.aspx?site_id=8/ T.M. C Asser Instituut: European Arrest Warrant Project]\n*[http://www.ecba-eaw.org/cms/ European Criminal Bar Association: European Arrest Warrant]\n*[https://web.archive.org/web/20131029191419/http://www.cps.gov.uk/legal/d_to_g/extradition/importation_extradition_-_within_the_european_union/ UK Crown Prosecution Service: Legal Guidance on the European Arrest Warrant]\nFurther reading\n* Klimek, Libor (2015). [https://www.springer.com/us/book/9783319073378 European Arrest Warrant]. Springer. ."
    }
  ]
}