{
  "content": [
    {
      "type": "text",
      "text": "# European Urban Renaissance__disambig_1\n\nThe European Urban Renaissance is an architectural movement aiming at developing European cities according to traditional urban design principles and architectural styles. The movement is contemporaneous with the American New Urbanism movement.\nTypology of intervention\nstyle to give back a more historic urban appearance to the Brussels-Central railway station area]]\nThe first exhibition dedicated to the movement was opened in March 1996 by H.R.H. The Prince of Wales at the “A Vision of Europe”  Bologna Triennale II.\nThe exhibition has been curated by Gabriele Tagliaventi and assembling more than 150 projects and built works in 24 countries. Both the exhibition and the accompanying English/French/Italian catalogue were organized by using an order of typology of intervention:\n# Reconstructing the area of the former Putterie/Putterij quarter that was destroyed for the construction of Brussels-Central railway station, 1985–95\n# Continuity of the classical tradition in the construction of the American capital city Washington, D.C., 1905–95\n# Continuing the construction of a bourgeois city, 1985–95\n# Urbanizing the suburbs\n# Extending the city with new urban quarters\n# Founding new traditional cities\n# Re-qualifying the urban space through the demolition of obsolete modernist buildings\n# Constructing new traditional public buildings\n# Reconquering the centre of the city\n# Reconquering the sacred space\n# Revitalizing the garden city\n# Healing the city\nWorks and main figures\nin England, constructed in the New Urbanism form from 1988–present]]\nThe catalogue, published by Grafis, Bologna, contains a foreword by H.R.H. The Prince of Wales and essays by Gabriele Tagliaventi, Leon Krier, Maurice Culot, Dawid Watkin, Carroll William Westfall and featured for the first time the largest operation of Urban Renaissance in Europe: the new mixed-use urban block of Rue de Laeken (1989–1995) designed by Tagliaventi & Associates, Atelier 55, Sylvie Assassin, Barthelemy Dumons, Philippe Gisclard, Nathalie Prat, Jean Philippe Garric, Valerie Negre, Javier Cenicacelaya, Iñigo Saloña, Liam O’Connor, John Robins, Joseph Altuna, Marie Laure Petit.\nSince 1996, the movement for the Urban Renaissance spread all over Europe, from the new town of Poundbury in England (1988–2007) master-planned by Leon Krier to the new Medina of Hammamet (2000–2005) designed by Tarak Ben Miled, from the new town of Potsdam Kirchsteigfeld (1993–2002) in Germany designed by Rob Krier and Christoph Kohl to the new urban neighborhood in Lisbon Bairro Alto (2000–2007) designed by José Baganha, from the Borgo Città Nuova new urban neighborhood in Alessandria (1995–2002)  designed by Leon Krier and Gabriele Tagliaventi to the new town of Val d'Europe (1995–2007) built near Paris according to the master-plan by Cooper-Robertson to the new village of Pitious at Spetses (1992–96) designed by Demetri Porphyrios, from the Richmond Riverside neighborhood (1987–1992) in London by Quinlan Terry to the new urban neighborhood of Sankt Eriksgaten in Stockholm (1995–2004) designed by Alexander Wolodarski.\nDue to the success of these operations of re-urbanization of both suburban and central areas, many new interventions are actually under construction all around Europe, including the Quartier am Tacheles in Berlin-Mitte (2000–2007) master-planned by Andres Duany & Elizabeth Plater-Zyberk with buildings by Demetri Porphyrios, Piotr Choynowski, Tagliaventi & Associates, Hammond Beeby Rupert Ainge, Robert A. M. Stern, Calvin TsaO, the reconstruction of the historical centre of Palermo (1996–2007), the new Beguinage at Valenciennes (2002–2007) by Styles Architectes, the new urban centre of Plessis-Robinson, France, (1992–2007) designed by Jean François Spoerry, Xavier Bohl, Marc and Nada Breitman, the new urban centre of the Via della Pietra Neighborhood in Bologna by Tagliaventi & Associates (2002–2007).\nSee also\n* Traditional architecture\n* Urban vitality\nReferences\n*Tagliaventi, Gabriele (1996),URBAN RENAISSANCE, Grafis - Bologna\n*Culot, Maurice (1995), THE RECONSTRUCTION OF THE LAEKEN STREET IN BRUXELLES, AAM Ed.- Bruxelles\n*Tagliaventi, Gabriele (2004),NEW CIVIC ARCHITECTURE. THE ECOLOGICAL ALTERNATIVE TO SUB-URBANIZATION, ALINEA - Florence,\n*Culot, Maurice (2005), XX ALTER ARCHITECTURE, AAM Ed.- Bruxelles\n*Tagliaventi, Gabriele (2006),FROM SLAB-URBIA TO THE CITY, ALINEA - Florence\nExternal links\n*[http://www.avoe.org A Vision of Europe]\n*[https://web.archive.org/web/20190911030238/https://www.cnu.org/ Congress for the New Urbanism]\n*[https://web.archive.org/web/20070315073250/http://www.planning.org/newurbanism/index.htm American Planning Association New Urbanism Division]"
    }
  ]
}