{
  "content": [
    {
      "type": "text",
      "text": "# European Heritage Days\n\nthumb\nEuropean Heritage Days (EHD) is a joint programme of the Council of Europe and the European Union involving all 48 signatory states of the European Cultural Convention. The annual programme offers opportunities to visit buildings, monuments and sites, many of which are not normally accessible to the public. It aims to widen access and foster care for architectural and environmental heritage. These events are also known as Doors Open Days and Open Doors Days in English-speaking countries.\nThe event began in France in 1984, with La Journée portes ouvertes dans les monuments historiques, sponsored by the Ministry of Culture. In 1985, in Granada, at the 2nd European Conference of Ministers responsible for Architectural Heritage, the French Minister of Culture proposed that the project be internationalised under the Council of Europe. The Netherlands held their first Open Monumentendag in 1987. Sweden and Ireland joined in 1989, as well as Belgium and Scotland in 1990.\nIn 1991 these events were united as European Heritage Days at the initiative of the Council of Europe, supported by the EU. By 2010, 50 signatory states of the European Cultural Convention had joined the EHD.\nThe Secretariat of the EHD is carried out by the Directorate for Democracy, under the responsibility of the Council of Europe's Steering Committee for Culture, Heritage and Landscape (CDCPP).\nMember states\nParticipating member states of the European Heritage Days are:\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\nResponsible institutions per European country\n, Rotterdam, the Netherlands, on 14 September 2014 during the European Heritage Days. As of 2014, the van Nelle Factory, a World Heritage site, was only open to visitors during the European Heritage Days.]]\n* : \"Jornades europees del patrimoni\" by Patrimoni Cultural\n* : Tag Des Denkmals by Bundesdenkmalamt\n* :\n** : [http://www.monument.irisnet.be/fr/sensibi/newsjdp.htm Journées du patrimoine à Bruxelles]  / [http://www.monument.irisnet.be/nl/sensibi/newsomd.htm Open Monumentendagen in Brussel]\n** : [http://www.openmonumenten.be/ Open Monumentendag Vlaanderen]\n** : [http://www.journeesdupatrimoine.be/ Journées du patrimoine en Wallonie]\n* : [http://www.journeesdupatrimoine.culture.fr \"Journées européennes du patrimoine\"] under the auspices of the Ministry of Culture\n* : Tag des offenen Denkmals by the Deutsche Stiftung Denkmalschutz\n* : Heritage Week by the Heritage Council\n* : \"Giornate Europee del Patrimonio\" by Ministero per i Beni e le Attività Culturali\n* : \"Eiropas kultūras mantojuma dienas\" by National Heritage Board of Latvia\n* : \"Open Monumentendag\" by Stichting Open Monumentendag\n* : \"Europejskie Dni Dziedzictwa\" (\"European Heritage Days\") by National Heritage Board of Poland\n* : [http://www.patrimoniocultural.pt/en/recursos/projectos-de-divulgacao/ \"Jornadas Europeias do Património\"] by Direção Geral do Património Cultural\n* : \"Las Jornadas Europeas de Patrimonio\" by Instituto del Patrimonio Cultural de España (Ministry of Culture and Sport)\n** : \"Les Jornades Europees de Patrimoni\" by Patrimoni Cultural\n* :\n**: Heritage Open Days.  London also has an additional event, Open House London.\n** : Doors Open Days by Scottish Civic Trust\n** : Open Doors Days (Welsh: Drysau Agored) by Civic Trust for Wales\n** : European Heritage Open Days\n* : \"Europäischer Tag des Denkmals - Journées européennes du patrimoine - Giornate europee del patrimonio\" by the Swiss Information Centre for Cultural Heritage Conservation\nSimilar concepts\nThis idea is popular outside Europe, too, with similar schemes in Canada since 1974 in Alberta, Australia, and other countries, at various times of year. In Argentina and Uruguay the corresponding Día del Patrimonio is held on the last weekend of September, while in Chile the same event is held on the last Sunday of May.\nSee also\n*Culture of Europe\n*European Integration\n*European Year of Cultural Heritage (2018)\nReferences\nExternal links\n* [https://www.europeanheritagedays.com/ European Heritage Days] — includes links to the national sites of all participants\n* [http://www.europeanheritagedays.com/Home.aspx Home page]"
    }
  ]
}