{
  "content": [
    {
      "type": "text",
      "text": "# Eustace King\n\n| birth_place        = Evanston, Illinois, U.S.\n| death_date         =\n| death_place        =\n| occupation         = Sports agent\n| known_for          = Co-creator of O2K Sports Management\n| notable_works      =\n| alma_mater         =\n| years_active       = 1994–present\n}}\nEustace King (born April 21, 1972) is a sports agent and co-creator of O2K Sports Management. Before O2K, King began his sports career as a goaltender for the Omaha Lancers and Dubuque Fighting Saints from 1989 to 1992. With the United States Hockey League teams, King won the Clark Cup twice with the Lancers while reaching the finals of the Clark Cup once with the Fighting Saints. King continued his goaltending career as part of the Miami Redskins men's ice hockey team in Ohio. As a Central Collegiate Hockey Association goalie from 1992 to 1996, King held the Miami season record in goals against average during the 1995–96 season.\nAfter his playing career, King worked for Leo Burnett Worldwide in media buying before joining the NHL Diversity Task Force in 1994. As an NHL executive, King was a manager and director before he started his position with O2K in 2004. King has represented players including Chris Stewart, Wayne Simmonds, and Raffi Torres. With O2K, King is one of a few people of color working as an agent for the National Hockey League Players' Association. During the COVID-19 pandemic, King created a social distancing team called the North LA Stars for minor ice hockey players in Los Angeles.\nEarly life and education\nKing was born in Evanston, Illinois on April 21, 1972. His mother moved from Jamaica to the United States shortly after the 1968 assassination of Martin Luther King Jr. She worked as a seamstress and a nurse. King's father, who was a dog breeder and construction worker, also moved to the United States from Jamaica. Growing up, King played hockey as an after-school activity. He was also on multiple minor ice hockey teams.\nFollowing his move to Omaha, Nebraska from Evanston during high school, King cancelled his plan to attend college. He instead joined the United States Hockey League to help him receive an athletic scholarship. For his post-secondary studies, King received a Bachelor of Science from Miami University in 1996. He later went to Harvard Law School to study negotiation.\nCareer\nPlaying career\nAs a goalie for the Omaha Lancers from 1989 to 1991, Eustace appeared in 36 games. During these years, King had five wins and two losses during the 1989–90 season. By January 1991, King had nine wins, four losses, and two ties with the Lancers. With the Lancers, King and the team won the Anderson Cup during the 1989-90 regular season. During the playoffs, King and the Lancers won the Clark Cup during the 1989–90 and 1990–91 seasons.\nIn June 1991, King remained in the USHL when he was traded to the Dubuque Fighting Saints. With Dubuque, King did not miss any regular-season game leading up to the USHL playoffs scheduled for April 1992. The Des Moines Buccaneers defeated King and Dubuque at the 1992 Clark Cup finals. In the same year, King and the team reached the round-robin stage of the 1992 National Junior-A championship hosted by USA Hockey. In his 33 goaltending games with the Fighting Saints, King had 16 wins, 12 losses, and 2 ties during the 1991–92 season.\nFrom 1992 to 1996, King continued his goalie career in Ohio where he joined the Central Collegiate Hockey Association for Miami University. As part of the Miami Redskins men's ice hockey team, King was on the ice for 77 minutes between 1993 and 1995. In February 1995, King was one of several players who received a one-game suspension for unsportsmanlike conduct after a game against the Michigan State Spartans. During the 1995–96 season, King had the Miami season record for goals against average with 3.90. By January 1996, King had appeared in seven games for Miami. After appearing in 20 games during 1996, King had five wins, seven losses and two ties for Miami.\nExecutive career\nBefore his hockey career, King worked for Leo Burnett Worldwide in media buying. While with Leo Burnett, King became part of the NHL Diversity Task Force in 1994 and became a manager. He remained in the NHL when he went to work in sponsorship as a director. In 2004, King became a sports agent when he and Matthew Oates created O2K Sports Management. At O2K, King works in multiple departments, including healthcare and finance. With O2K, King is a member of the National Hockey League Players' Association. Following the hiring of Brett Peterson in 2009 and Harkie Singh in 2020, King was one of a few people of color working as an agent for the NHLPA in 2020.\nDuring his NHL experience, King began to represent Chris Stewart in 2006 when King was starting as an agent. During the early 2010s, he was the agent for Wayne Simmonds when Simmonds experienced multiple events of racial discrimination while playing hockey. King also represented Raffi Torres when Torres used blackface as part of his costume for Halloween in 2011. During the 2010s to 2020s, King represented players such as Jared Spurgeon and Jason Zucker. In 2021, King represented Willie O'Ree when skates were worn to recognize O'Ree as the NHL's first person of color player. King created a social distancing hockey team called the North L.A. Stars while working as an NHL agent during the COVID-19 pandemic. He made the Stars after the pandemic prevented children from playing minor ice hockey in Los Angeles.\nReferences"
    }
  ]
}