{
  "content": [
    {
      "type": "text",
      "text": "# Evanslea, Queensland\n\n| pop                 = 31\n| pop_year            =\n| pop_footnotes       =\n| established         =\n| postcode            = 4356\n| area                = 58.6\n| timezone            = AEST\n| utc                 = +10:00\n| dist1               = 24.7\n| dir1                = SW\n| location1           = Oakey\n| dist2               = 28.7\n| dir2                = NNW\n| location2           = Pittsworth\n| dist3               = 41.5\n| dir3                = W\n| location3           = Toowoomba CBD\n| dist4               = 169\n| dir4                = W\n| location4           = Brisbane\n| lga                 = Toowoomba Region\n| stategov            = Condamine\n| fedgov              = Groom\n| near-n              = Jondaryan\n| near-ne             = Yargullen\n| near-e              = Mount Irving\n| near-se             = Mount Tyson\n| near-s              = Mount Tyson\n| near-sw             = Bongeen\n| near-w              = Bongeen\n| near-nw             = Mount Moriah\n}}\nEvanslea is a rural locality in the Toowoomba Region, Queensland, Australia. In the , Evanslea had a population of 31 people.\nGeography\nThe Toowoomba–Cecil Plains Road runs through from east to west.\nEvanslea railway station is an abandoned railway station on the closed Cecil Plains railway line  ().\nNorillee is a neighbourhood ().\nThe land use is predominantly crop growing with some grazing on native vegetation, mostly in the south-east of the locality.\nEvanslea has the following mountains:\n* Mount Russell ()\n* Mount Taylor ()\nHistory\nThe locality takes its name from the Evanslea railway station, which was named after Charles Barnard Evans, Commissioner for Railways in Queensland from 1911 to 1918. The railway station on the Cecil Plains railway line opened in September 1915 with Evanslea as its terminus. It was subsequently extended to Cecil Plains.\nThe neighbourhood of Norillee takes its name from the Norillee railway station (in neighbouring Bongeen), which was named by the Queensland Railways Department on12 December 1918. It is an Aboriginal name meaning mountain ridge or series of peaks.\nDemographics\nIn the , Evanslea had a population of 41 people.\nIn the , Evanslea had a population of 31 people.\nEconomy\nThere are a number of homesteads in the locality:\n* Mount Russell ()\n* Poplar ()\n* Prairie View ()\n* Rockwood ()\n* Shiralee ()\n* Valhalla ()\nEducation\nThere are no schools in Evanslea. The nearest government primary schools are Mount Tyson State School in neighbouring Mount Tyson to the south-east and Jondaryan State School in neighbouring Jondaryan to the north. The nearest government secondary schools are Oakey State High School in Oakey to the north-east and Pittsworth State High School in Pittsworth to the south-east.\nThere are Catholic primary schools in Oakey and Pittsworth.\nReferences"
    }
  ]
}