{
  "content": [
    {
      "type": "text",
      "text": "# Evelyn Pierrepont, 1st Duke of Kingston-upon-Hull\n\n|image            = 1st Duke of Kingston-upon-Hull.JPG\n| caption = Portrait by Godfrey Kneller\n|office1          = Lord President of the Council\n|monarch1         = George I\n|term_start1      = 6 February 1719\n|term_end1        = 11 June 1720\n|predecessor1     = The Earl of Sunderland\n|successor1       = Viscount Townshend\n|birth_date       = &nbsp;1665\n|death_date       = 5 March 1726\n|spouse           = Lady Mary Feilding  Lady Isabella Bentinck\n|children         = 6, including Mary\n}}\nEvelyn Pierrepont, 1st Duke of Kingston-upon-Hull,  (&nbsp;16655 March 1726) was an English aristocrat.\nHe was born at West Dean, Wiltshire, the third son of Robert Pierrepont of Thoresby, Nottinghamshire (son of William Pierrepont ), and his wife Elizabeth Evelyn (daughter of John Evelyn ). His older brothers were the 3rd Earl and 4th Earl of Kingston-upon-Hull, who both died childless.\nHe was educated at Winchester College, and entered Christ's College, Cambridge in 1683.\nPolitical career\nHe was elected member of parliament for East Retford in 1689, before his accession to the peerage as 5th Earl of Kingston-upon-Hull on the death of his brother in 1690. While serving as one of the commissioners for the union with Scotland, he was created Marquess of Dorchester in 1706, and took a leading part in the business of the House of Lords. He was made a privy councillor and in 1715 was created Duke of Kingston-upon-Hull; afterwards serving as Lord Privy Seal and Lord President of the Council. The Duke was a prominent figure in the fashionable society of his day.\nFamily\nHis first wife was Lady Mary Feilding, a daughter of William Feilding, 3rd Earl of Denbigh, and his wife Mary King, whom he married in 1687. They had three daughters and a son:\n*Lady Mary Pierrepont (died 1762), who married the diplomat Edward Wortley-Montagu\n*Lady Frances Pierrepont (died 1761), who married John Erskine, Earl of Mar\n*Lady Evelyn Pierrepont (died 1727), who married John Leveson-Gower, 1st Earl Gower, and was mother of Gertrude, Duchess of Bedford\n*William Pierrepont, Earl of Kingston-upon-Hull, who died of smallpox, aged 20, in July 1713. He married Rachel, (legal daughter of Thomas Baynton of Little Chalfield, Wiltshire, but biological daughter and heiress of John Hall of Bradford, Wiltshire), and had a daughter Frances (died 1795) and a son Evelyn.\nHis second wife was Lady Isabella Bentinck, daughter of Hans William Bentinck, 1st Earl of Portland, whom he married in 1714. They had two daughters:\n*Lady Caroline Pierrepont (died 1753), who married Thomas Brand (senior), MP\n*Lady Anne Pierrepont (1719–1739)\nHe was succeeded by his grandson Evelyn, son of William.\nReferences\n|-"
    }
  ]
}