{
  "content": [
    {
      "type": "text",
      "text": "# Every Singaporean Son II – The Making of an Officer\n\n| last_aired           =\n| related              =\n}}\nEvery Singaporean Son II – The Making of an Officer is a Singaporean documentary released in August 2012. Different from Every Singaporean Son and Every Singaporean Son – Epilogue, the new series showcase the life after BMT, whereby 13 newly minted private soldiers will turn from Officer Cadets into an Commissioned Officer in 38 weeks of trainings. 21 episodes will be released. The first episode aired on 16 August 2012 on YouTube, subsequent episodes were released on every Thursday, each clip lasted for 5 to 11 minutes. The last episode aired on 17 January 2013.\nThe series was filmed by Dominic Ow and his crew from One Dash 22 and Project Peanut.\nPlot\nIn this brand new second season, the series showcase a group of 13 Officer Cadets going through various tough challenges, in hopes to become an Officer. Through 38 weeks of training, each soldier will be pushed to their limits.\nEach of the cadet officers will also master the specialized skills given to them to lead as Armour, Logistics, Transport, Signals, Infantry and Engineer Officers.\nThis season will also feature many explosions and gun battles, through success and failure in the challenges, each cadet officer will gain confidence and self-belief in becoming a better leader among peers.\nEpisodes\n|OriginalAirDate =\n|ShortSummary    =\n|LineColor       = 9C9C00\n}}\n|OriginalAirDate =\n|ShortSummary    =\n|LineColor       = 9C9C00\n}}\n|OriginalAirDate =\n|ShortSummary    =\n|LineColor       = 9C9C00\n}}\n|OriginalAirDate =\n|ShortSummary    =\n|LineColor       = 9C9C00\n}}\n|OriginalAirDate =\n|ShortSummary    =\n|LineColor       = 9C9C00\n}}\n|OriginalAirDate =\n|ShortSummary    =\n|LineColor       = 9C9C00\n}}\n|OriginalAirDate =\n|ShortSummary    =\n|LineColor       = 9C9C00\n}}\n|OriginalAirDate =\n|ShortSummary    =\n|LineColor       = 9C9C00\n}}\n|OriginalAirDate =\n|ShortSummary    =\n|LineColor       = 9C9C00\n}}\n|OriginalAirDate =\n|ShortSummary    =\n|LineColor       = 9C9C00\n}}\n|OriginalAirDate =\n|ShortSummary    =\n|LineColor       = 9C9C00\n}}\n|OriginalAirDate =\n|ShortSummary    =\n|LineColor       = 9C9C00\n}}\n|OriginalAirDate =\n|ShortSummary    =\n|LineColor       = 9C9C00\n}}\n|OriginalAirDate =\n|ShortSummary    =\n|LineColor       = 9C9C00\n}}\n|OriginalAirDate =\n|ShortSummary    =\n|LineColor       = 9C9C00\n}}\n|OriginalAirDate =\n|ShortSummary    =\n|LineColor       = 9C9C00\n}}\n|OriginalAirDate =\n|ShortSummary    =\n|LineColor       = 9C9C00\n}}\n|OriginalAirDate =\n|ShortSummary    =\n|LineColor       = 9C9C00\n}}\n|OriginalAirDate =\n|ShortSummary    =\n|LineColor       = 9C9C00\n}}\n|OriginalAirDate =\n|ShortSummary    =\n|LineColor       = 9C9C00\n}}\n|OriginalAirDate =\n|ShortSummary    =\n|LineColor       = 9C9C00\n}}}}\nCast\nOfficer cadets\n* OCT Shawn Chng\n* OCT Sean Lai\n* OCT Douglas Ng\n* OCT Jai Ganesh\n* OCT Garrett Chew\n* OCT Ryan Lim Wei Qiang\n* OCT Noor Zamir\n* OCT Muhammad Zacky Bin Razali\n* OCT Kelvin Ang\n* OCT Raviin Kumar\n* OCT Justine Lee\n* OCT Ravi Shankar\n* OCT Kyser Tan\n* OCT Noor Zamir - School of Infantry\n* OCT Luke Sim - School of Armour\n* OCT James Loo - School of Armour\n* OCT Ong Xuan Hao - School of Armour\nTrainers\n* LTC Ramezan (Bravo Wing Commander)\n* CPT Jay Chan (Armour Wing Commander)\n* CPT Thaw (Jungle Training Instructor)\n* LTA Utama (Platoon Commander)\n* 2LT Vanga (Section Instructor)\n* 2LT Joel Lim (Section Evaluator)\n* 2WO Philip Lee (Jungle Training Instructor)\nProduction\nOfficer Cadets featured in the series were from the 85th Officer Cadet Course's Bravo Wing. Their training started on 16 October 2011 and cadets are commissioned on 15 July 2012.\nDue to an undisclosed heart condition, OCT Douglas Ng had been deemed unfit by the Medical Officer to continue in the course.\nIn Episodes 7 and 8, the cadets took part in Exercise Scorpion King.\n* OCT Ganesh was posted as a Bridging Engineer in Episode 11, while OCT Kelvin Ang was 1 of the 4 posted as an Explosive Ordnance Disposal Engineer.\n* Episode 13 contains a Viewer Discretion Warning, citing footage of animals being killed in the Jungle Survival Training.\n* Episode 13 was filmed in the 23rd week of training, during a 2-week overseas training exercise.\n* Episode 16 features the M3G, which is a bridge that floats on water.\n* The Officer Cadets traveled to Germany in Episode 17 and 18.\n* PAC includes a 50m swim, and subsequently a casualty evacuation run in Full Battle Order which constitutes carrying stretchers with filled Jerry Cans to a checkpoint, performing individual tasks along the way, a series of obstacles, the firing of 5 live rounds each at the Live Firing Range and concluding with a 3&nbsp;km run to the parade square.\n* The Officer Cadets took part in their final Exercise - Exercise Panther - in Episodes 20 and 21.\n* OCT Zacky and Ganesh were awarded the Sword of Merit, awarded to only 20% of the whole cohort. They were posted to Infantry and Engineers respectively.\n* OCT Garret Chew was appointed as the OCS Flag Bearer in the Commissioning Parade.\n* OCT Ryan Lim Wei Qiang was awarded the Sword of Honor for the Logistics formation.\nMarketing\nIn a publicity campaign by National Geographic Channel Singapore, actors dressed in army gear and camouflaged faces assembled at Raffles Place. Passers-by were allowed to give drill commands to the squad who will execute the commands. The Ministry of Defence and the Singapore Armed Forces in a statement, did not endorse or sponsor the event. The campaign drew mixed responses from the public, ranging from harmless to demeaning to Singapore soldiers. National Geographic Channel Singapore explained it was trying to show how a soldier's job can be difficult and apologised for the campaign.\nReferences\nExternal links\n* [http://www.mindef.gov.sg/everysingaporeanson/library2.html Official website]"
    }
  ]
}