{
  "content": [
    {
      "type": "text",
      "text": "# Every Man a King (album)\n\n}}\nEvery Man a King is the eighth solo studio album by Australian singer/songwriter James Reyne released on 5 May 2007.\nOn the album, Reyne rips into several of his pet hates and finds plenty going askew with the Australian character; showing contempt for celebrity culture, men who are 'chasing the chattering classes' and aspiring to be a part of the 'million balconies facing the sun' and John Howard and George W. Bush are written about in \"Light in the Tunnel\" and \"Little Man You've Had a Busy Day.\"\nReyne said; \"If there's any theme to this album it's people being easily impressed. This silliness that they aspire to, the lives they read about in magazines. Their obsession with trash culture, the bizarre values we seem to live by. It's all just endlessly and perversely fascinating to me\".\nThe album was recorded at Hobby Horse Studios in St Kilda West and at Supersonic Studios in Scott Kingman's home studio.\nReview\nTomas Mureika of All Music said \"Reyne issues his most satisfying studio set since Design for Living (1999). While not as strong an album as his early solo work, Every Man a King is a solid affair from an artist who continues to stay relevant nearly 30 years after Australian Crawl. \"Broken Romeo\" and \"Superannuated Idol\" are just two of the highlights found here. The title of the album comes from Huey Long and the record has a populist theme running through it. Reyne still loves to use his lyrics to tell stories, but this time the individual characters are \"Everymen.\" Every Man a King proves that Reyne continues to be one of the best singer/songwriters in the world, let alone his native Australia. A powerful collection\".\nTrack listing\n;CD/DD\n# \"Little Man You've Had a Busy Day\" (James Reyne) - 4:51\n# \"Stop Draggin' My Name Around\"\t(Reyne) - 4:22\n# \"Mr. International\"\t(Reyne, Gary Clark, Eric Pressly) - 4:03\n# \"Sammy & Doofus & Our Man in New York\" (Reyne, Scott Kingman) - 3:28\n# \"Light in the Tunnel\" (Reyne) - 3:50\n# \"Cry Baby Killer\" (Reyne) - 3:50\n# \"Broken Romeo\" (Reyne) - 3:23\n# \"Superannuated Idol\" (Reyne) - 2:29\n# \"I'm a Man\" (Reyne, Kingman) - 3:40\n# \"Lapis Lazuli\" (Reyne, Kingman) - 4:16\n# \"The Postman\" (David Baerwald) - 3:20\n# \"Light in the Tunnel\"  (reprise)  (Reyne) - 5:38\nCredits\n* Bass – Andy McIvor\n* Drums – John Watson\n* Guitar – Brett Kingman (tracks: 5)\n* Guitar, Mandolin, Bass, Drum Programming, Keyboards – Scott Kingman\n* Photography By – Robert Miles\n* Piano, Organ – Bruce Haymes\n* Steel Guitar [Lap Steel] – Chris Hawker (tracks: 1)\nCharts\n{|class=\"wikitable plainrowheaders\"\n|+Chart performance for Every Man a King\n|-\n! scope=\"col\"| Chart (2007)\n! scope=\"col\"| Peakposition\n|-\n! scope=\"row\"| Australian Albums (ARIA)\n|align=\"center\"| 141\n|}\nRelease history\n{| class=\"wikitable plainrowheaders\"\n|-\n!scope=\"col\"|Region\n!scope=\"col\"|Date\n!scope=\"col\"|Format(s)\n!scope=\"col\"|Label\n!scope=\"col\"|Catalogue\n|-\n!scope=\"row\"|Australia\n|5 May 2007\n|Compact Disc, Music download\n|Liberation Records\n|LIBCD92392\n|-\n|}\nExternal links\n*\nReferences"
    }
  ]
}