{
  "content": [
    {
      "type": "text",
      "text": "# Evolution of the French colonial empire\n\nFrom the 16th to the 17th centuries, the First French colonial empire stretched from a total area at its peak in 1680 to over , the second largest empire in the world at the time behind only the Spanish Empire. During the 19th and 20th centuries, the French colonial empire was the second largest colonial empire in the world only behind the British Empire; it extended over  of land at its height in the 1920s and 1930s. In terms of population however, on the eve of World War II, France and her colonial possessions totaled only 150 million inhabitants, compared with 330 million for British India alone. The total area of the French colonial empire, with the first (mainly in the Americas and Asia) and second (mainly in Africa and Asia), the French colonial empires combined, reached , the second largest in the world (the first being the British Empire). The French colonial empire had an enormous impact on world history. France had about 80 colonies throughout its history, the second most colonies in the world behind only the British Empire. Around 40 countries gained independence from France throughout its history, the second most in the world behind only the British Empire.  Over 50% of the world's borders today, were drawn as a result of British and French imperialism.\nThis is a list of all territories that were part of the French colonial empires in the last 500 years, either entirely or in part, either under French sovereignty or as mandate or protectorate. When only a part of the country was under French rule, that part is listed in parentheses after the country. When there are no parentheses, it means the whole country was formerly part of any one of the French colonial empires. Countries listed are those where French sovereignty applied effectively. Areas that were only claimed, but not effectively controlled (such as Manhattan or Western Australia) are not listed.\n;N.B.:\n*\"1st\" means the country/territory was part of the first French colonial empire. (pre 1814/1815)\n*\"2nd\" means the country/territory was part of the second French colonial empire. (post 1830)\n*\"Now\" means this is a territory still part of the French Republic today.\nThe Americas\nNorth America\n*Canada (most of eastern and central Canada, see Acadia and Canada, New France)—1st\n*Saint-Pierre and Miquelon—1st, 2nd, & now\n*United States (entire basin of the Mississippi and Missouri rivers, Great Lakes, see Louisiana (New France))—1st\nCaribbean\n*Anguilla (briefly)—1st\n*Antigua and Barbuda (briefly)—1st\n*Dominica—1st\n*Dominican Republic (briefly)—1st\n*Grenada—1st\n*Guadeloupe—1st, 2nd, & now\n*Haiti—1st\n*Martinique—1st, 2nd, & now\n*Montserrat (briefly)—1st\n*Saint Martin (northern half only)—1st, 2nd, & now\n*Saint-Barthélemy—1st, 2nd, & now\n*Saint Lucia—1st\n*Saint Vincent and the Grenadines—1st\n*Sint Eustatius (briefly)—1st\n*St Kitts and Nevis (St Kitts, but not Nevis)—1st\n*Trinidad and Tobago (Tobago only)—1st\n*US Virgin Islands (Saint Croix only)—1st\nSouth America\n*Brazil (Rio de Janeiro briefly, and São Luís briefly)—1st\n(see France Antarctique and France Équinoxiale)\n*French Guiana—1st, 2nd, & now\nAfrica\nNorth Africa\n{| class=\"wikitable\"\n!width=\"300\"|Name of territory\n!width=\"100\"|Dates\n!width=\"400\"|Status\n!width=\"400\"|Comments\n|-\n|rowspan=\"3\"|Algeria\n|1830\n|Colony\n|\n|-\n|1848\n|annexed to France\n|\n|-\n|1962\n|Independent\n|\n|-\n|rowspan=\"2\"|Morocco\n|1912\n|protectorate\n|\n|-\n|1956\n|Independent\n|\n|-\n|rowspan=\"2\"|Egypt\n|1798\n|protectorate\n|\n|-\n|1801\n|Independent\n|\n|-\n|rowspan=\"2\"|Tunisia\n|1881\n|protectorate\n|\n|-\n|1956\n|Independent\n|\n|-\n|-\n|}\nWest Africa\n*Benin (as Dahomey)—2nd\n*Burkina Faso (as Upper Volta)—2nd\n*Côte d'Ivoire—2nd\n*Guinea—2nd\n*Mali (as French Sudan)—2nd\n*Mauritania—2nd\n*Niger—2nd\n*Senegal—1st & 2nd\n*Togo—2nd\nEquatorial Africa\n*Cameroon (91% of Cameroon)—2nd\n*Central African Republic (as Oubangui-Chari)—2nd\n*Chad—2nd\n*Democratic Republic of Congo ('Congo-Kinshasa')—2nd\n*Gabon—2nd\n*Republic of the Congo ('Congo-Brazzaville')—2nd\nIndian Ocean\n*Comoros—2nd\n*Madagascar—2nd\n*Mauritius—1st\n*Mayotte—2nd & now\n*Réunion—1st, 2nd, & now\n*Scattered Islands in the Indian Ocean—2nd & now\n*Seychelles—1st\n*Tanzania (Zanzibar, briefly)—2nd\nRed Sea\n*Djibouti (as French Somaliland)—2nd\n*Yemen (Cheikh Saïd peninsula)\nAsia\nMiddle East\n*Lebanon—2nd\n*Syria—2nd\n*Turkey (Sanjak of Alexandretta, now called Hatay Province)—2nd\nSouth Asia\n*India\n**half of India (see French India)—1st\n**only Pondicherry, Karikal, Yanaon, Mahé, and Chandernagore—2nd\nEast Asia\n*China\n**Kwang-Chou-Wan leased territory, now the city of Zhanjiang (Guangdong province)—2nd\n**French concessions in Shanghai, Guangzhou, Tianjin, and Hankou—2nd\n**French sphere of influence recognized by China over the provinces of Yunnan, Guangxi, Hainan, and Guangdong—2nd\nSouth East Asia\n*Cambodia—2nd\n*Laos—2nd\n*Vietnam (as Tonkin, Annam, and Cochinchina)—2nd\n*Eastern Thailand under French Sphere of Influence—2nd\nOceania\n*Clipperton—2nd & now\n*New Caledonia—2nd & now\n*French Polynesia—2nd & now\n*Vanuatu (condominium shared with the British Empire)—2nd\n*Wallis and Futuna—2nd & now\nAntarctic Ocean\n*French Southern and Antarctic Lands—2nd & now\nSee also\n* History of France\nReferences"
    }
  ]
}