{
  "content": [
    {
      "type": "text",
      "text": "# Evolutionary invasion analysis\n\nEvolutionary invasion analysis, also known as adaptive dynamics, is a set of mathematical modeling techniques that use differential equations to study the long-term evolution of traits in asexually and sexually reproducing populations. It rests on the following three assumptions about mutation and population dynamics:\n# Mutations are infrequent. The population can be assumed to be at equilibrium when a new mutant arises.\n# The number of individuals with the mutant trait is initially negligible in the large, established resident population.\n# Mutant phenotypes are only slightly different from the resident phenotype.\nEvolutionary invasion analysis makes it possible to identify conditions on model parameters for which the mutant population dies out, replaces the resident population, and/or coexists with the resident population. Long-term coexistence of the two phenotypes is known as evolutionary branching. When branching occurs, the mutant establishes itself as a second resident in the environment.\nCentral to evolutionary invasion analysis is the mutant's invasion fitness. This is a mathematical expression for the long-term exponential growth rate of the mutant subpopulation when it is introduced into the resident population in small numbers. If the invasion fitness is positive (in continuous time), the mutant population can grow in the environment set by the resident phenotype. If the invasion fitness is negative, the mutant population swiftly goes extinct.\nIntroduction and background\nThe basic principle of evolution via natural selection was outlined by Charles Darwin in his 1859 book, On the Origin of Species.  Though controversial at the time, the central ideas remain largely unchanged to this date, even though much more is now known about the biological basis of inheritance. Darwin expressed his arguments verbally, but many attempts have since then been made to formalise the theory of evolution. The best known are population genetics which models inheritance at the expense of ecological detail, quantitative genetics which incorporates quantitative traits influenced by genes at many loci, and evolutionary game theory which ignores genetic detail but incorporates a high degree of ecological realism, in particular that the success of any given strategy depends on the frequency at which strategies are played in the population, a concept known as frequency dependence.\nAdaptive dynamics is a set of techniques developed during the 1990s for understanding the long-term consequences of small mutations in the traits expressing the phenotype. They link population dynamics to evolutionary dynamics and incorporate and generalise the fundamental idea of frequency-dependent selection from game theory.\nFundamental ideas\nTwo fundamental ideas of adaptive dynamics are that the resident population is in a dynamical equilibrium when new mutants appear, and that the eventual fate of such mutants can be inferred from their initial growth rate when rare in the environment consisting of the resident. This rate is known as the invasion exponent when measured as the initial exponential growth rate of mutants, and as the basic reproductive number when it measures the expected total number of offspring that a mutant individual produces in a lifetime. It is sometimes called the invasion fitness of mutants.\nTo make use of these ideas, a mathematical model must explicitly incorporate the traits undergoing evolutionary change. The model should describe both the environment and the population dynamics given the environment, even if the variable part of the environment consists only of the demography of the current population. The invasion exponent can then be determined. This can be difficult, but once determined, the adaptive dynamics techniques can be applied independent of the model structure.\nMonomorphic evolution\nA population consisting of individuals with the same trait is called monomorphic. If not explicitly stated otherwise, the trait is assumed to be a real number, and r and m are the trait value of the monomorphic resident population and that of an invading mutant, respectively.\nInvasion exponent and selection gradient\nThe invasion exponent S_r(m) is defined as the expected growth rate of an initially rare mutant in the environment set by the resident (r), which means the frequency of each phenotype (trait value) whenever this suffices to infer all other aspects of the equilibrium environment, such as the demographic composition and the\navailability of resources. For each r, the invasion exponent can be thought of as the fitness landscape experienced by an initially rare mutant. The landscape changes with each successful invasion, as is the case in evolutionary game theory, but in contrast with the classical view of evolution as an optimisation process towards ever higher fitness.\nWe will always assume that the resident is at its demographic attractor, and as a consequence S_r(r) = 0 for all r, as otherwise the population would grow indefinitely.\nThe selection gradient is defined as the slope of the invasion exponent at m=r, S_r'(r). If the sign of the selection gradient is positive (negative) mutants with slightly higher (lower) trait values may successfully invade. This follows from the linear approximation\n::S_r(m) \\approx S_r(r)+ S_r'(r) (m - r)\nwhich holds whenever m \\approx r.\nPairwise-invasibility plots\nThe invasion exponent represents the fitness landscape as experienced by a rare mutant. In a large (infinite) population only mutants with trait values m for which S_r(m) is positive are able to\nsuccessfully invade. The generic outcome of an invasion is that the mutant replaces the resident, and the fitness landscape as experienced by a rare mutant changes. To determine the outcome of the resulting series of invasions pairwise-invasibility plots (PIPs) are often used. These show for each resident trait value r all mutant trait values m for which S_r(m) is positive. Note that S_r(m) is zero at the diagonal m=r.  In PIPs the fitness landscapes as experienced by a rare mutant correspond to the vertical lines where the resident trait value r is constant.\nEvolutionarily singular strategies\nThe selection gradient S_r'(r) determines the direction of evolutionary change. If it is positive (negative) a mutant with a slightly higher (lower) trait-value will generically invade and replace the resident. But what will happen if S_r'(r) vanishes? Seemingly evolution should come to a halt at such a point. While this is a possible outcome, the general situation is more complex.  Traits or strategies r^* for which S_{r^*}'(r^*)=0, are known as evolutionarily singular strategies. Near such points the fitness landscape as experienced by a rare mutant is locally `flat'. There are three qualitatively different ways in which this can occur. First, a degenerate case similar to the saddle point of a qubic function where finite evolutionary steps would lead past the local 'flatness'. Second, a fitness maximum which is known as an evolutionarily stable strategy (ESS) and which, once established, cannot be invaded by nearby\nmutants. Third, a fitness minimum where disruptive selection will occur and the population branch into two morphs. This process is known as evolutionary branching.  In a pairwise invasibility plot the singular strategies are found where the boundary of the region of positive invasion fitness intersects the diagonal.\nSingular strategies can be located and classified once the selection gradient is known. To locate singular strategies, it is sufficient to find the points for which the selection gradient vanishes, i.e. to find r^* such that S'_{r^*}(r^*) = 0. These can be classified then using the second derivative test from basic calculus. If the second derivative evaluated at r^* is negative (positive) the strategy represents a local fitness maximum (minimum). Hence, for an evolutionarily stable strategy r^* we have\n::S_{r^*}''(r^*)\nIf this does not hold the strategy is evolutionarily unstable and, provided that it is also convergence stable, evolutionary branching will eventually occur. For a singular strategy r^* to be convergence stable monomorphic populations with slightly lower or slightly higher trait values must be invadable by mutants with trait values closer to r^*. That this can happen the selection gradient S_r'(r) in a neighbourhood of r^* must be positive for r  and negative for r > r^*. This means that the slope of S_r'(r) as a function of r\nat r^* is negative, or equivalently\n::\\frac{d}{dr} S_r'(r)\\Big| _{r=r^*}\nThe criterion for convergence stability given above can also be expressed using second derivatives of the invasion exponent, and the classification can be refined to span more than the simple cases considered here.\nPolymorphic evolution\nThe normal outcome of a successful invasion is that the mutant replaces the resident. However, other outcomes are also possible; in particular both the resident and the mutant may persist, and the population then becomes dimorphic. Assuming that a trait persists in the population if and only if its expected growth-rate when rare is positive, the condition for coexistence among two traits r_1 and r_2 is\n::S_{r_1} (r_2) > 0\nand\n::S_{r_2} (r_1) > 0,\nwhere r_1 and r_2 are often referred to as morphs. Such a pair is a protected dimorphism. The set of all protected dimorphisms is known as the region of coexistence. Graphically, the region consists of the overlapping parts when a pair-wise invasibility plot is mirrored over the diagonal\nInvasion exponent and selection gradients in polymorphic populations\nThe invasion exponent is generalised to dimorphic populations straightforwardly, as the expected growth rate S_{r_1, r_2}(m) of a rare mutant in the environment set by the two morphs r_1 and\nr_2. The slope of the local fitness landscape for a mutant close to r_1 or r_2 is now given by the selection gradients\n::S_{r_1, r_2}'(r_1)\nand\n::S_{r_1, r_2}'(r_2)\nIn practise, it is often difficult to determine the dimorphic\nselection gradient and invasion exponent analytically, and one often\nhas to resort to numerical computations.\nEvolutionary branching\nThe emergence of protected dimorphism near singular points during the course of evolution is not unusual, but its significance depends on whether selection is stabilising or disruptive. In the latter case, the traits of the two morphs will diverge in a process often referred to as evolutionary branching. Geritz 1998 presents a compelling\nargument that disruptive selection only occurs near fitness minima. To understand this heuristically, consider a dimorphic population r_1 and r_2 near a singular point. By continuity\n::S_r(m) \\approx S_{r_1,r_2}(m)\nand, since\n::S_{r_1, r_2}(r_1) = S_{r_1, r_2}(r_2) = 0,\nthe fitness landscape for the dimorphic population must be a perturbation of that for a monomorphic resident near the singular strategy.\nTrait evolution plots\nEvolution after branching is illustrated using trait evolution plots. These show the region of coexistence, the direction of evolutionary change and whether points where the selection gradient vanishes are fitness maxima or minima. Evolution may well lead the dimorphic population outside the region of coexistence, in which case one morph is extinct and the population once again becomes monomorphic.\nOther uses\nAdaptive dynamics effectively combines game theory and population dynamics. As such, it can be very useful in investigating how evolution affects the dynamics of populations. One interesting finding to come out of this is that individual-level adaptation can sometimes result in the extinction of the whole population/species, a phenomenon known as evolutionary suicide.\nReferences\nExternal links\n* Diekmann, Odo (2004). [http://www.environnement.ens.fr/IMG/file/DavidPDF/DYAD/OdoDiekmann2004beginnersguide.pdf A beginner's guide to adaptive dynamics].\n* Metz, J.A.J.; Geritz, S.A.H.; Meszéna, G.; Jacobs, F.J.A.; van Heerwaarden, J.S. (September 1995). [http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.199.2875&rep=rep1&type=pdf Adaptive Dynamics: A Geometrical Study of the Consequences of Nearly Faithful Reproduction].\n* Brännström, Åke; Johansson, Jacob; von Festenberg, Niels (24 June 2013). [http://www.mdpi.com/2073-4336/4/3/304 The Hitchhiker's guide to adaptive dynamics].\n* Kisdi, E. (2023) [http://www.mv.helsinki.fi/home/kisdi/addyn.htm Adaptive Dynamics Papers], a list of academic papers about adaptive dynamics.\n* Hauert, Christof (2004). [http://www.univie.ac.at/virtuallabs/Branching/ The origin of cooperators and defectors], an interactive tutorial introducing adaptive dynamics from a game theoretical perspective."
    }
  ]
}