{
  "content": [
    {
      "type": "text",
      "text": "# Executive Council of Prince Edward Island__disambig_1\n\nThe Executive Council of Prince Edward Island (informally and more commonly, the Cabinet of Prince Edward Island) is the cabinet of that Canadian province.\nAlmost always made up of members of the Legislative Assembly of Prince Edward Island, the Cabinet is similar in structure and role to the Cabinet of Canada while being smaller in size.  As federal and provincial responsibilities differ there are a number of different portfolios between the federal and provincial governments.\nThe Lieutenant-Governor of Prince Edward Island, as representative of the King in Right of Prince Edward Island, heads the council, and is referred to as the Governor-in-Council. Other members of the Cabinet, who advise, or minister, the vice-regal, are selected by the Premier of Prince Edward Island and appointed by the Lieutenant-Governor. Most cabinet ministers are the head of a ministry, but this is not always the case.\nCurrent cabinet\nThe current cabinet was formed on February 21, 2025 following the resignation of Premier Dennis King from the Executive Council.\n{| class=\"wikitable\"\n! colspan=2 | Lieutenant-Governor\n|-\n| colspan=1 | His Honour The Honourable Wassim Salamoun\n| (2024–present)\n|-\n!Portfolio\n!Minister\n|-\n| Premier of Prince Edward Island\n:Minister Responsible for Intergovernmental Affairs and Indigenous Relations\n| Rob Lantz\n|-\n| Deputy Premier of Prince Edward Island\n:Minister of Agriculture\n:Minister of Justice and Public Safety\n:Attorney General\n| Bloyce Thompson\n|-\n|Minister of Education an Early years\n| Robin Croucher\n|-\n|Minister of Housing, Land and Communities\n|Steven Myers\n|-\n|Minister of Transportation and Infrastructure\n|Ernie Hudson\n|-\n|Minister of Fisheries, Tourism, Sport and Culture\n|Zack Bell\n|-\n|Minister of Economic Development, Innovation and Trade\n|Darlene Compton\n|-\n|Minister of Health and Wellness\n|Mark McLane\n|-\n|Minister of Environment, Energy and Climate Action\nMinister Responsible for Acadian and Francophone Affairs\n|Gilles Arsenault\n|-\n|Minister of Finance\n|Jill Burridge\n|-\n|Minister of Social Development and Seniors\n|Barb Ramsay\n|-\n|Minister of Workforce, Advanced Learning and Population\nMinister Responsible for the Status of Women\n|Jenn Redmond\n|}\nReferences\nExternal links\n* [https://www.princeedwardisland.ca/en/information/executive-council-office/meet-team Cabinet of Prince Edward Island]"
    }
  ]
}