{
  "content": [
    {
      "type": "text",
      "text": "# Exhibition of the Fascist Revolution\n\n| image         = Mostra-rivoluz-fascista 1934 sala 1914.jpg\n| caption       = Esodo Pratelli. Room A, Exhibition of the Fascist Revolution, Rome 1932–1934.\n| date          = 28 October 1932 – 28 October 1934 (2 years)\n| venue         = Palazzo delle Esposizioni, Rome\n| location      = Rome, Kingdom of Italy\n| coordinates   =\n| theme         = Propaganda\n| organizers    = Dino Alfieri and the National Fascist Party\n}}\nThe Exhibition of the Fascist Revolution () was an art exhibition held in Rome at the Palazzo delle Esposizioni from 1932 to 1934. It was opened by Benito Mussolini on 28 October 1932 and was the longest-lasting exhibition ever mounted by the Fascist regime. Nearly four million people attended the exhibition in its two years.Cf.  Intended to commemorate the revolutionaries who had taken part in the rise to power of Italian fascism, the Exhibition was supposed to be, in Mussolini's own words, \"an offering of faith which the old comrades hand down to the new ones so that, enlightened by our martyrs and heroes, they may continue the heavy task.\"\nBackground\nIn the early 1930s the Fascist regime's popularity was approaching its peak in Italy and abroad. The idea of an exhibition celebrating the first decade of Fascist rule originated with Dino Alfieri, the president of the National Institute of Fascist Culture, in 1928. Alfieri presented the program of the Exhibition in a meeting of the National Fascist Party directorate on 14 July 1931, in the presence of Mussolini, who enthusiastically approved it. Alfieri was involved in the project with a group of young, radical artists including, among others, the painters Mario Sironi and Achille Funi and the rationalist architects Adalberto Libera and Giuseppe Terragni. The artists were called to translate the epic of the Fascist Revolution into plastic form making use of contemporary styles in graphic arts and architecture. The purpose of the Exhibition was, in Mussolini's words, to “create something ultramodern and audacious, free from melancholy memories of the decorative styles of the past.”\nUnlike Adolf Hitler and the Nazi Party, who openly attacked modern architecture and art on both stylistic and racial grounds, denigrating its practitioners as decadent if not actually communists or Jews, Fascism had been since its early inception closely linked to avant-garde artistic movements, such as Futurism. Many of Italy's best artists and architects were ardent fascists who tried in every possible way to embody fascist values in their work. Mario Sironi contributed a large number of cartoons—over 1700 in all—to ''Il Popolo d'Italia and La Rivista Illustrata del Popola d'Italia, the Fascist newspapers, and, together with Modernist architect Giovanni Muzio, designed a pavilion for Il Popolo d'Italia at the 1928 Milan trade fair. As Diane Ghirardo has shown \"The Modern Movement received substantial state support in Italy as it did from no other major power in the decade before World War II\". As of 1930, indeed, very few governments had offered official support to the European avant-garde art, perhaps with the exception of the Soviet Union and the Weimar Republic. While Hitler’s Degenerate Art exhibition placed avant-garde art on display for ridicule, Mussolini used modernist art as a tool to promote Fascist ideology, linking the Fascist revolution to an equally revolutionary style in art.\nEvent\nThe Exhibition of the Fascist Revolution opened on October 28, 1932, on the tenth anniversary of the March on Rome. The anniversary was called the Decennale (evoking the ancient Roman Decennalia). The Exhibition was the propaganda centerpiece of the Decennale. It was the largest official display organized by the Fascist regime to date. Its director and designer was Dino Alfieri, with the cooperation of Luigi Freddi, , and Cipriano Efisio Oppo. As artistical-technical consultant for the exhibition, Oppo was joined by Filippo Tommaso Marinetti, the Futurist leader and a longtime friend of Mussolini, and by a small group of artists, including the architect Enrico Del Debbio and the painter Giovanni Guerrini. The organizing body included a special Propaganda Office, that worked directly with the undersecretary of the Ministry of Interior Leandro Arpinati.\nThe Exhibition celebrated the Fascist' rise to power in October 1922 and presented the Fascist view of Italian history from Mussolini's foundation of his newspaper, ''Il Popolo d'Italia'', in November 1914, to the March on Rome. It was never conceived as an objective representation of the facts or as being solely based on the exhibiting of historic documents, but as a work of Fascist propaganda to influence and involve the audience emotionally. The idea behind the exhibition, in the words of one Fascist journal, was \"to express a faith, which must be represented with the kind of fervor that ... can arouse religious feelings.\" For this reason not only historians were called in to assist in the exhibition, but also exponents of various artistic currents of the era. Documents and memorabilia were displayed to help describe the events leading to the rise of Fascism. The exhibition’s organizers solicited items from Italian citizens such as symbols, photographs, medals, newspapers, letters connected to Fascism's historical origins, totaling 18,040 items collected by the end of this campaign. The exhibits were laid out in a series of twenty-three rooms, with specific rooms being devoted to periods of history. Each room of the exhibition was designed by a team composed of an historian and an artist, most of whom were young avant-garde designers, such as Mario Sironi, Enrico Prampolini, Gerardo Dottori, Adalberto Libera and Giuseppe Terragni. The rooms were filled with mural photomontages (or “photo-mosaics”), sculptures, collages, sound clips, and quotes that surrounded visitors with visions of World War I and achievements of the Fascist movement. The extensive use of photomontages was inspired by Soviet constructivist artist El Lissitzky's \"The Task of the Press is the Education of the Masses\" in the Soviet Pavilion at the 1928 Cologne International Press Exhibition.\nThe Palazzo delle Esposizioni was given a temporary façade by Adalberto Libera and Mario de Renzi dominated by four twenty-five-meter tall tin-plate fasces and two six-meter X's, one on either side of the entry. The X's represented a ten-year span of Fascist history. One \"X\" looked to the past, beginning in 1922, the second \"X\" pointed to the future (from 1932 to 1942). The façade conveyed a sense of startling modernity through its use of modern materials and stark simplicity of design.\nThe exhibition was designed in such a way that it led visitors sequentially from one space to the other. Visitors were led through nineteen chronological and thematic halls covering the period from the outbreak of World War I to the victory of Fascism. The nineteen rooms were divided into five units corresponding to the general history of pre- and early Fascism. Rooms A-C covered the years from 1914 to 1918. Rooms D and E covered the early postwar period from 1918 to March of 1919. Rooms F and G presented the year 1919, beginning with the foundation of the Fasci Italiani di Combattimento on March 23. The chief themes of these early rooms were intervention, the italian mobilization, Fascism's emergence, and idealization of the sacrifice of the Italian soldier. Rooms H through N were devoted to the squad years from 1920 to 1921. Clashes between Socialists and Blackshirts were dramatized as battles over the soul of the nation leading up from the decadence of the years immediately following the war to the triumph of Fascism and the beginning of the new era. Room O (1922) presented the final year of Fascist struggle before the March on Rome. Rooms P-S covered the March on Rome and also stood as commemorative chambers to Fascism. The exhibition culminated in a Sala del Duce ('Room of the Duce') narrating the life of Mussolini from its humble beginnings to his rise to world leadership.\nHaving completed the long detour through the history of Fascism, the visitor finally reached the Sacrario dei Martiri della Rivoluzione Fascista ('Shrine of the Martyrs of the Fascist Revolution'), the most theatrical and cathartic space of the entire exhibition. This large cylindrical space, over thirteen meters in diameter and seven meters in height, was designed by the Rationalist architect Adalberto Libera and the theater designer Antonio Valente (creator of the famous Carro di Tespi). The Sacrario commemorated to the thousands of soldiers and scores of Fascist Party members who gave their lives for the cause and soon became the focal point of patriotic pilgrimages.\nThe government offered travel discounts and other perks to incentivize visitors. Schools were closed from October 24 to November 5 1932, so that entire families could view the Exhibition in its opening days and primary schools were offered numerous incentives to visit it. Over half a million posters were printed together with tourist pamphlets in several languages.\nAlthough the Exhibition was initially intended to be temporary, lasting only six months, it proved so popular that the closing date, April 21, 1933, had to first be postponed until October and then again until the following October. The Exhibition was seen by 3,854,927 Italian and foreign visitors over the course of nearly two years.  Outside Italy the Exhibition was widely hailed for its aesthetic value. Among the many foreigners who came to see it were Le Corbusier, André Gide, Auguste Perret, Maurice Denis, and Paul Valéry.\nThe exhibition made known to a wider public many young artists and architects. Some of them, including the sculptor Marino Marini and the painter Enrico Paulucci, would become leading figures in Italian and European art after the war. Others, like Esodo Pratelli or Leo Longanesi, went on to active careers in cinematography and the photographic documentary. The exhibition has been praised by many art historians, such as Giulio Carlo Argan and Bruno Zevi, who have both written appreciatively of Libera's and Terragni's contributions.\nSubsequent events\nGiven its great success, the Exhibition of the Fascist Revolution was repeated in 1937 and 1942, though these two repeats did not have the same public success. The Exhibition of 1937 took place in conjunction with the much larger and more important \"Mostra Augustea della Romanità\", celebrating the bimillennium of the birth of Augustus. This second version of the exhibit was held in the National Gallery of Modern Art. Italian rationalist architect Cesare Bazzani designed a new façade for the gallery. The Exhibition was updated to cover the Second Italo-Ethiopian War, the proclamation of the Fascist Empire and the deeds of the Italian volunteers fighting for the Nationalist faction in the Spanish Civil War. The second edition attracted far fewer visitors than the first version. It closed after a year and reopened in a slightly altered form on March 23, 1939, the twentieth anniversary of the founding of the Fasci Italiani di Combattimento.\nIn the Exhibition of 1942, new rooms were added, one dedicated to the Doctrine of Fascism, another to artifacts recovered during the African campaigns, and yet another against Jews and Communists, who were given the blame for starting the war. The inauguration ceremony was presided over by a German delegation. A room on \"Victory\" was promised soon. The Exhibition was still open when the Germans occupied Rome in July 1943. Most of the documentary material was then transferred to the seat of the new Italian Social Republic, in Salò on Lake Garda. Today much of this material is preserved in the Central Archives of the State in Rome.\nReferences\nBibliography\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n* Rocco, Vanessa (2009). “Acting on the Visitor's Mind': Architectonic Photography at the Exhibition of the Fascist Revolution in Rome, 1932.” In Public Photographic Spaces: Exhibitions of Propaganda from Pressa to The Family of Man, ed. Jorge Ribalta, 245–55.\n*\n*\nExternal links\n*\n*\n*\n*\n*"
    }
  ]
}