{
  "content": [
    {
      "type": "text",
      "text": "# Expeditionary Combat Readiness Center\n\nThe Expeditionary Combat Readiness Center is an organization of the United States Navy which falls under the larger umbrella of the Naval Expeditionary Combat Command.\nECRC directly assists Individual Augmentee (IA) and GSA IA Sailors by ensuring they are properly uniformed and equipped while coordinating with the Army to ensure they get the proper stateside training. Training includes instruction in individual combat skills and specialized mission areas to help IAs succeed in their mission and keep them as safe as possible while deployed.\nECRC assigns Action Officers (AOs) to IA Sailors and provisional units grouped by mission. AO's review missions and training pipelines and communicate directly with IA Sailors throughout the mobilization process to ensure that IAs are fully ready to deploy both medically and administratively. AOs ensure the IA Sailors get answers to their questions including contact information in theater, and the peace of mind of knowing that they have a Navy advocate to guide them through the transition into Combat Support and Combat Service Support missions.\nECRC provides Navy Liaison Officer (LNO) teams to provide direct assistance to sailors at a pre-deployment training site. They update sailor information used to support students and family members during student training and deployment. LNOs assist with berthing, pay issues, communications, scheduling, uniforms, transportation, documentation, surveys, database update and information archives.\nECRC provides logistic support by coordinating IA Sailors’ return home through the redeployment/demobilization process, helping get Sailors home expeditiously and safely.\nReferences\nExternal links\n*[https://www.necc.usff.navy.mil/Press-Room/Fact-Sheets/Article/2437553/navy-expeditionary-combat-readiness-center/ Navy Expeditionary Combat Readiness Center @ necc.usff.navy.mil]\n*[https://www.militarynews.com/norfolk-navy-flagship/news/top_stories/ecrc-for-ias-basic-needs-essential-to-complete-a-successful-operational-mission/article_fb79f165-bef3-5ce6-9481-de12996644da.html ECRC: For IAs, basic needs essential to complete a successful operational mission]\n*[https://www.dvidshub.net/unit/ECRC Expeditionary Combat Readiness Center @dvidshub.net]\n*[https://m.facebook.com/ECRC.HQ ECRC HQ Official Facebook page]"
    }
  ]
}