{
  "content": [
    {
      "type": "text",
      "text": "# Expeditions: Viking\n\n| platforms     = Windows\n| released      = April 27, 2017\n| genre         = Tactical role-playing\n| modes         = Single-player\n}}\nExpeditions: Viking is a squad-based tactical role-playing game developed by Logic Artists and released for Windows on April 27, 2017. The player takes the role of a Danish viking leading an expedition to Great Britain circa 790 AD. It is the second game in the Expeditions series, a sequel to Expeditions: Conquistador. The third game in the series, Expeditions: Rome, was released in 2022.\nGameplay\nExpeditions: Viking is set during the Viking Age. Players take the role of a clan chieftain (which they can design with character creator) and can become either conquerors, merchants, or diplomats.\nRelease\nExpeditions: Viking was announced in May 2015. In October 2016, the game was scheduled for release in the first quarter of 2017. It was eventually released on April 27, 2017.\n| 4P = 60/100\n| Destruct = 7/10\n| GSpot = 6/10\n| RPG = 4.0/5\n| rev1 = Digitally Downloaded\n| rev1Score = 4/5\n}}\nExpeditions: Viking received \"mixed or average\" reviews according to review aggregator Metacritic.\nDaniel Starkey of GameSpot summarized: ''\"Viking lives in its atmosphere, so it's appreciated that most of the game is a spirited romp. For now, that experience is mangled by dozens of technical hiccups and anachronisms.\"\nCharalampos Papadimitriou of RPGamer said that \"Viking isn’t the most refined game, with limited camera control, repetitive graphics that lack detail, and a lack of high-production presentation. It nevertheless succeeds in immersing the player in its world through an intriguing main story focused on local politics and motivations and driven by realistic struggles and constraints.\"''\nGinny W. of Digitally Downloaded recommended the game to \"anyone with a passing interest in tactical RPGs\".\nReferences\nExternal links\n* (archived)"
    }
  ]
}