{
  "content": [
    {
      "type": "text",
      "text": "# Expedition League\n\n| folded            =\n| president         = Steve Wagner (2015–2022)\n| motto             = Where Tomorrow's Stars Play...Today\n| teams             = 4\n| country           =\n| headquarters      = Rapid City, South Dakota, United States\n| champion          = Souris Valley Sabre Dogs\n| champ_season      = 2022\n| most_champs       = Souris Valley Sabre Dogs (2)\n| website           = [https://web.archive.org/web/20220601232728/https://www.expeditionleague.com/ Expedition League]\n}}\nThe Expedition League was a collegiate summer baseball league in the Great Plains region of the United States and Canada. The league was founded in 2015 in Rapid City, South Dakota, by Steve Wagner, who also served as president. The league's inaugural season was 2018 with eight teams.  It played its final season in 2022.\nTeams played a 64-game season from late May through the beginning of August. Playoffs took place in the second week of August with teams seeded for the playoffs, with each team making the playoffs.  The first round of the playoffs and the League Championship Series were best-of-three series.\nHistory\nThe league was founded in 2015 and featured eight teams in its inaugural season that began in May 2018. It added the Wheat City Whiskey Jacks and the Fremont Moo for the 2019 season.\nThe Rapid City Jackalopes, originally announced for the 2020 season, were described in early 2020 as being \"at least one more year away\" due to the lack of a suitable stadium. The Hub City Hotshots suspended operations for the 2020 season and the city of Aberdeen, South Dakota terminated their contract for use of Fossum Field. In December 2019, the Sioux Falls Sunfish announced that the team would begin play in the 2020 season, playing at Karras Park Home of Ronken Field in Sioux Falls, South Dakota; due to COVID, they started playing in 2021. The Canyon County Spuds and the Mining City Tommyknockers joined the league for the 2021 season in Caldwell, Idaho and Butte, Montana, respectively. In February 2021, the league announced plans for a new team in Grand Forks, North Dakota, later named the Red River Pilots, to debut in 2022. Due to the COVID-19 pandemic closing the US-Canada border, the Wheat City Whiskey Jacks played their 2021 home games at Kraft Field in Grand Forks, North Dakota. The Pierre Trappers chose not to seek renewal of their ballpark lease after the 2022 season.\nDuring the 2022 season, the Expedition League was forced to end its season early after the Red River Pilots and North Iowa Ragin Roosters both folded by July 4, causing a best of three series between the Pierre Trappers and Souris Valley Sabre Dogs. The Sabre Dogs collected their second straight championship after defeating the Trappers by three games to one. The Trappers and Sabre Dogs folded soon after, alongside the league, in 2022.\nTeams\nMembership timeline\nDateFormat = yyyy\nImageSize = width:1070 height:auto barincrement:20\nPeriod = from:2018 till:2023\nTimeAxis = orientation:horizontal\nPlotArea = right:20 left:0 bottom:50 top:5 #> to display a count on left side of graph, use \"left:20\" to suppress the count, use \"left:20\"\nChampions\n*2022  Souris Valley Sabre Dogs\n*2021  Souris Valley Sabre Dogs\n*2020  Fremont Moo\n*2019  Badlands Big Sticks\n*2018  Western Nebraska Pioneers\nNotable Expedition League alumni\n*Jacen Roberson, Western Nebraska Pioneers (2019). 16th Round, Arizona Diamondbacks, 2021\n*Jack Sinclair, Western Nebraska Pioneers (2018). 16th Round, Washington Nationals, 2021\n*Austin Callahan, Fremont Moo (2021). 18th Round, Cincinnati Reds, 2021\n*Robert Cruz, Casper Horseheads (2018–19). Free Agent, Washington Nationals, 2021\n*Alex Achtermann, Western Nebraska Pioneers (2018). 30th Round, Colorado Rockies, 2019\n*Jackson Pokorney, Wheat City Whiskey Jacks (2019) / Souris Valley Sabre Dogs (2020). 29th Round, Atlanta Braves, 2016\n*Cal Smith, Pierre Trappers (2018). 33rd Round, Boston Red Sox, 2015\nReferences\nExternal links\n*\n*"
    }
  ]
}