{
  "content": [
    {
      "type": "text",
      "text": "# Expedition against the Hindustani Fanatics (1857–8)\n\nNaranjiChinglaiPanjtarMangal ThanaSittana\n| coordinates       =\n| map_type          =\n| latitude          =\n| longitude         =\n| map_size          =\n| map_caption       =\n| map_label         =\n| territory         =\n| result            = Company victory\n| status            =\n| combatant1        =  British Raj\n| strength1         =\n| strength2         =\n| casualties1       =\n| casualties2       =\n| combatant2        =  Mujahideen\n| commander1        =  Maj. Gen. Sydney Cotton\n| commander2        =  Sayyid Mubarak Shah\n}}\nThe British expedition against the Hindustani Fanatics in 1857–1858 was part of a long relationship since their first discovery of the Fanatics in 1852. The Expedition in 1857–1858 also coincided with the 1857 Mutiny, as mutineers of the 55th Infantry had taken refuge and joined Sayyid Mubarak Shah, the son of Sayyid Akbar Shah of Hazara, who was linked to the Hindustanis as the former treasurer and counselor under Syed Ahmed Barelvi, and had later been proclaimed the king of Swat and Hazara. Sayyid Mubarak Shah raised an army for the purposes of war in Panjtar, but the instability of his rule also meant he could not venture far for fear of losing control of his kingdom. The mutineers fought for Mubarak Shah in a battle, which increased his influence. Mubarak Shah borrowed a sum of money from a grey-haired Jamadar of the rebels, but the sum was soon exhausted, and he was unable to pay them more. Thus the mutineers were unwilling to fight for him. At the same time, Mubarak Shah's usage of the mutineers was seen as a threat to the influence of Saidu Baba, the Gujjar herdsman turned religious leader, who expelled Mubarak Shah.  Thus the advent of the mutineers in the region brought a political change in Swati politics.  The Hindustani Fanatics were invited by Mubaraz Khan who invited the Hindustanis to the village of Chinglai. It was at this moment that a few border villages had asked appealed to the Hindustanis and Mubaraz Khan to come down and begin a way for Islam. The fighting of the Hindustanis was marked with fanaticism; they came boldly and doggedly on. They were all dressed in white, while some of the leaders wore velvet cloaks. Inayat Ali's attacks were initially successful, and occupied both Nawakilla and Sheikh Jana. The British expeditions included the Battle of Shekh Jana in July 1857, Battle of Naranji in August 1857, Battle of Chinglee in April 1858. The British again sent an expedition storming the heights of Mangal Thana, where they found a citadel built of large stone and fine timber to house a permanent and sizeable garrison. Finally, the battle of Sittana was fought at May 1858. The British reported Hindustani volunteers from Rampur as well as Bengal among the dead. The Hindustanis who survived fled to the village of Malka, where they furnished to accommodate upwards of 3,000 men.\nReferences"
    }
  ]
}