{
  "content": [
    {
      "type": "text",
      "text": "# Expedition of Khalid ibn al-Walid (Dumatul Jandal)\n\n([https://archive.org/details/muhammadatmedina029655mbp free online])\n|place=Dumat Al-Jandal\n|result=*Ukaydir b. 'Abd al-Malik al-Kindi agrees to pay Jizyah\n*2,000 camels, 800 slaves, 400 coats of mail, and 400 lances, of ransom paid.\n|commander1=Khalid ibn al-Walid\n|commander2=Ukaydir ibn Abd al-Malik al-Kindi\n|strength1= 420 horsemen\n|strength2= Unknown\n|casualties1=0\n|casualties2=1Ukaydir captured\n}}\nExpedition of Khalid ibn al-Walid, to Dumat Al-Jandal, to attack the Christian Prince of Duma, took place in March 631 AD, 9AH, 11th month of the Islamic Calendar, or October 630 AD according to William Montgomery Watt.\nExpedition\nAttack on Duma Castle\nAccording to Ar-Rahīq al-Makhtum (The Sealed Nectar), a modern Islamic hagiography of Muhammad written by the Indian Muslim author Saif ur-Rahman Mubarakpuri, Muhammad sent Khalid ibn Walid to Dumatul Jandal, against Ukaydir ibn Abd al-Malik al-Kindi, the Christian prince of Dumatul Jandal (the area is also known as Duma).\nKhalid ibn Walid was sent with 450 horsemen (or 420 according to other sources) and Muhammad said to Khalid: \"You will see him hunting oryxes\".\nWhen Khalid came to the castle of the Christian prince, he saw oryxes coming out rubbing their horns against the castle gate, and he saw Ukaydir hunting the oryxes.\nUkaydir's brother was also out hunting, and after a short struggle, Khalid ibn Walid captured and killed him. Then he took Ukaydir captive, but he was quickly surrounded by his followers.\nHostage and ransom\nAfter Khalid took Ukaydir captive, he threatened to kill him if the gates of Duma were not opened.\nKhalid brought him back to Muhammad, who spared his life for a ransom of 2000 camels, 800 slaves, 400 armours and 400 lances. He brought all this booty back to Madinah, along with the captive, he also brought another brother of the Prince of Duma. Mubarakpuri, mentions that another condition for sparing his life and making peace with him, was that he recognize the duty of paying the tribute (Jizyah) and must collect the Jizyah from Dumat, Tabuk, Ailah and Taima’.}}\nThe event is also mentioned in the Sunni hadith collection Sunan Abu Dawud, it is written:\n}}\nSee also\n*Military career of Muhammad\n*List of expeditions of Muhammad\nReferences"
    }
  ]
}