{
  "content": [
    {
      "type": "text",
      "text": "# Expedition Unknown\n\n| last_aired         = present\n| related            =\n}}\nExpedition Unknown is an American reality television series produced by Ping Pong Productions, which follows explorer, archeologist and television presenter Josh Gates as he investigates mysteries and legends. The 15th season premiered on June 18, 2025.\nHistory\nExpedition Unknown premiered on January 8, 2015, on the Travel Channel and broadcast seasons 1-4. At the start of the 5th season in 2018, the series moved to the Discovery Channel, which became its new home.\nIn February 2020, a spinoff Expedition X premiered on Discovery. The series focuses on paranormal subjects and is hosted by Gates with Phil Torres, Jessica Chobot (seasons 1-7), and Heather Amaro (season 8-). The eighth season of Expedition X premiered on August 14, 2024.\nIn April 2020, Gates debuted Josh Gates Tonight, a talk show spinoff on Discovery which originated as replacement programming during the COVID-19 pandemic. The series features Gates interviewing celebrity guests via videoconference. The series last aired in 2022 with its 5th season.\nIn May 2021, Gates and camera operator Brian Weed visited OceanGate CEO Stockton Rush to test out the Titan submersible, with plans to eventually film a dive to the Titanic wreck on the Titan for an episode of Expedition Unknown. A planned test dive in the Puget Sound with Gates and Weed onboard had to be scrubbed after multiple technical issues, and on the journey back Gates grew suspicious of Rush's lack of care for basic safety and brushing over the fact that the Titan was neither certified nor had been properly tested at the depths of the Titanic. Feeling it would be unethical to promote Oceangate to potential customers, Gates asked the network to cancel the planned episode, and the Titan later imploded during a dive to the Titanic in 2023, killing Rush and four others. Footage from Gates' visit was shown in the 2025 HBO documentary Implosion: The Titanic Sub Disaster, with contemporary interviews of Gates recalling his concerns.\nSeries overview\n| end1       =\n| color2     = #800080\n| link2      = #Season 2 (2015-16)\n| episodes2  = 20\n| start2     =\n| end2       =\n| color3     = #8A4500\n| link3      = #Season 3 (2016-17)\n| episodes3  = 18\n| start3     =\n| end3       =\n| color4     = #A79548\n| link4      = #Season 4 (2017-18)\n| episodes4  = 10\n| start4     =\n| end4       =\n| color5     = #00FF32\n| link5      = #Season 5 (2018)\n| episodes5  = 7\n| start5     =\n| end5       =\n| color6     = #FF6C00\n| link6      = #Season 6 (2019)\n| episodes6  = 9\n| start6     =\n| end6       =\n| color7     = #0013FF\n| link7      = #Season 7 (2019)\n| episodes7  = 13\n| start7     =\n| end7       =\n| color8     = #ffff00\n| link8      = #Season 8 (2020)\n| episodes8  = 8\n| start8     =\n| end8       =\n| color9     = #22BBAA\n| link9      = #Season 9 (2021)\n| episodes9  = 6\n| start9     =\n| end9       =\n| color10    = #332288\n| link10     = #Season 10 (2022)\n| episodes10 = 14\n| start10    =\n| end10      =\n| color11    = #A485FF\n| link11     = #Season 11 (2023)\n| episodes11 = 8\n| start11    =\n| end11      =\n| color12    = #F366AA\n| link12     = #Season 12 (2023)\n| episodes12 = 8\n| start12    =\n| end12      =\n| color13    = #F37744\n| link13     = #Season 13 (2024)\n| episodes13 = 7\n| start13    =\n| end13      =\n| color14    = #2E6427\n| link14     = #Season 14 (2024)\n| episodes14 = 6\n| start14    =\n| end14      =\n| color15    = #A7BDD7\n| link15     = #Season 15 (2025)\n| episodes15 = 7\n| start15    =\n| end15      =\n| color16    = #5F4181\n| link16     = #Season 16 (2025)\n| episodes16 =\n| start16    =\n| end16      =\n| color51S   = #B40405\n| link51S    = #Extra Finds (2016-17)\n| linkT51S   = EF\n| episodes51S =\n| start51S   =\n| end51S     =\n| color52S   = #87CEFA\n| link52S    = #Hunt for the Yeti (2016)\n| linkT52S   = YETI\n| episodes52S = 4\n| start52S   =\n| end52S     =\n| color53S   = #2E5392\n| link53S    = #Hunt for Extraterrestrials (2017)\n| linkT53S   = ET\n| episodes53S = 4\n| start53S   =\n| end53S     =\n| color54S   = #00AEFF\n| link54S    = #Search for the Afterlife (2018)\n| linkT54S   = AL\n| episodes54S = 4\n| start54S   =\n| end54S     =\n| color55S   = #E0C4AD\n| link55S    = #Aftershows\n| linkT55S   = AS\n| episodes55S =\n| start55S   =\n| end55S     =\n| color56S   = #010101\n| link56S    = #Josh Gates Tonight\n| linkT56S   = JGT\n| episodes56S =\n| start56S   =\n| end56S     =\n| color57S   = #EEAA00\n| link57S    = #Expedition: Back to the Future (2021)\n| linkT57S   = BTTF\n| episodes57S = 4\n| start57S   =\n| end57S     =\n}}\nEpisodes\nSeason 1 (2015)\n| Viewers =\n|ShortSummary=Josh seeks new evidence on the disappearance of Amelia Earhart. He first sets off to Papua New Guinea, where he treks through the uncharted jungle of tribal lands; then Fiji, where he tries to discover her remains.\n|LineColor=006161\n}}\n| Viewers = 0.78\n| ShortSummary = In a search for a lost city, Josh goes to the remote jungles of Cambodia to investigate the ancient Khmer Empire to find a Linga stone, a 1,000-year-old relic that, legend has it, was used by the God King to incinerate his enemies.\n| LineColor = 006161\n}}\n| Viewers = 0.85\n| ShortSummary = Josh's hunt for the Amber chamber takes him to Catherine Palace in St. Petersburg, Russia. Then in Germany, he retraces the steps of Nazi soldiers who looted the treasure in WWII as he explores abandoned bunkers and a silver mine in hopes of finding the chamber.\n| LineColor = 006161\n}}\n| Viewers =\n| ShortSummary = Josh searches the American Midwest for outlaw Jesse James' \"gold loot,\" which he and his gang stole in Mexico. He walks a mile in James's boots, from his farm in Kearney, Missouri to Robbers Cave, where he rappels off a cliff to find this hidden treasure, then to Cement, Oklahoma, to join a team using high-tech equipment.\n| LineColor = 006161\n}}\n| Viewers = 0.86\n| ShortSummary = Josh travels through Peru in search of the Incan lost city of Paititi. His journey takes him from Cusco to Machu Picchu and into the Amazon's jungles.\n| LineColor = 006161\n}}\n| Viewers = 0.92\n| ShortSummary = Josh tries to unlock the secrets to the Sunstone of the Vikings while traveling through the British island of Alderney and Norway, where he explores a crypt underneath Nidaros Cathedral to find the final resting place of Viking king St. Olaf. Later, he descends into a  calcite mine to make his own sunstone, testing its power while at sea with locals who live like Vikings.\n| LineColor = 006161\n}}\n| Viewers = 1.01\n| ShortSummary = Josh joins archaeologists in Panama as they search for the Satisfaction, the sunken flagship of pirate Captain Henry Morgan. He also searches one of many shipwrecks near Fort San Lorenzo at the reef, where Morgan's ship ran aground.\n| LineColor = 006161\n}}\n| Viewers = 0.93\n| ShortSummary = Josh searches the Virginia backcountry for the Thomas Beale treasure. He meets up with local treasure hunters and explores a 4-mile search radius in Bedford County using a printed copy of the Declaration of Independence, believed to have hidden symbols that James B. Ward, “The Beale Papers” author, encoded. He then meets with a crypto-analyst to get further evidence on the hoax.\n| LineColor = 006161\n}}\n| Viewers = 0.83\n| ShortSummary = Josh investigates the fall of the Mayan Empire. He explores the many cenotes— caverns believed to be gateways to the underworld—below the jungles and ruins of Mexico, including the largest Mayan city, Chichén Itzá. While scuba diving in the dark Holtun Cenote, he unearths human skulls and ancient sacrificial altars, which get him closer to why their empire collapsed.\n| LineColor = 006161\n}}\n| Viewers = 0.97\n| ShortSummary = Josh flies to Peru to investigate the giant geoglyphs known as the Nazca Lines that were drawn into the desert by the ancient Nazca tribe. By studying newly found lines recently discovered on a mountain made by the Paracas people and joining a Nazca psychedelic ritual, he uncovers the supposed meaning behind the tracings.\n| LineColor = 006161\n}}\n| Viewers = 0.86\n| ShortSummary = Josh heads to Japan to search for the missing Honjo Masamune sword. After learning about the legend of this katana, his search takes him to the back alleys of Tokyo and the city's red-light district, an ancestral burial ground, Imperial tunnels in Nagano, and an ancient mountaintop Shinto shrine in Togakushi.\n| LineColor = 006161\n}}\n| Viewers = 0.72\n| ShortSummary = Josh travels to Myanmar to join in the search for the Golden Bell of King Dhammazedi, believed to be sunk at the bottom in the center of the Bago River, the Yangon River and the Pazundaung Creek when Portuguese warlord Filipe de Brito e Nicote's ship was wrecked in 1599 after stealing it.\n| LineColor = 006161\n}}\n}}\nSeason 2 (2015–16)\n| Viewers = 0.60\n|ShortSummary=Josh investigates whether King Arthur was real and, if so, who he was. He searches in Arthur's reputed birthplace at Tintagel Castle in Cornwall, and then in the ruins of Glastonbury Abbey in Somerset, the site of the alleged tomb of King Arthur and Queen Guinevere. Finally, he visits Dunadd in Scotland, where he meets an author who believes a Scot named Arthur MacAedan is the historical basis of King Arthur.\n|LineColor=800080\n}}\n| Viewers = 0.63\n|ShortSummary=Josh researches the legends about Genghis Khan to search for his long-lost tomb. It is believed to be in Mongolia at the \"forbidden zone\" on top of the \"Holy Mountain\" or Burkhan Khaldun, which is guarded by a local tribe and closed off to foreigners.\n|LineColor=800080\n}}\n| Viewers = 0.55\n|ShortSummary=Josh goes searching for Blackbeard's buried gold. He explores underwater caves in Cayman Brac, gets up close to his wrecked flagship ''Queen Anne's Revenge'', and drives the Outer Banks on North Carolina's coast to dig up artifacts on Ocracoke Island, the site of his last stand.\n|LineColor=800080\n}}\n| Viewers = 0.52\n|ShortSummary=Josh digs up the truth behind vampire legends. He starts at Curtea Veche in Romania, where he learns about Vlad the Impaler, the inspiration behind Dracula. Then off to Marotinu de Sus, a Romanian village, where six men desecrated a grave, believing it to be a \"strigoi.\" He ends in Perperikon, Bulgaria, to examine a supposed vampire grave.\n|LineColor=800080\n}}\n| Viewers = 0.52\n|ShortSummary=Josh travels the English countryside on a mission to learn if Robin Hood was a real man and if he's a legendary hero or a murderous outlaw. He visits London's British Library, explores tunnels and caves beneath Nottingham, and joins historians in search of Hood's grave, in Kirklees Priory, Yorkshire, and at a churchyard in Loxley, where researchers believe an outlaw named Roger Godberd, the real Robin Hood is buried.\n|LineColor=800080\n}}\n| Viewers = 0.46\n|ShortSummary=Josh searches for the treasure of art dealer Forrest Fenn, who, after being diagnosed with terminal cancer, hid his $2 million fortune deep in the Rocky Mountains north of his hometown of Santa Fe, New Mexico.\n|LineColor=800080\n}}\n| Viewers = 0.66\n|ShortSummary=The search for Christopher Columbus continues with finding his missing remains. Josh follows his five-century voyage across two continents to search for his final resting place, believed to be at Columbus Lighthouse in Santo Domingo, Dominican Republic and at Cathedral of Saint Mary of the See in Seville, Spain, both countries laying claim to his bones.\n|LineColor=800080\n}}\n| Viewers = 0.63\n|ShortSummary=Josh goes to Yonaguni Island, the westernmost Japanese island on the East China Sea, to determine whether undersea structures are geological or artificial. The Yonaguni Monument discoverer, Kihachiro Aratake, shows him the undersea steps leading up to a level platform where Josh takes a sample for geologic analysis. In Osaka, archaeologist Michio Maezano shows Josh a rock tomb proving that ancient people could have carved the Yonaguni structures, and an earthquake could have sunk them. Geologist Masahide Furukawa examines the rock sample composed of layered sandstone and shale, and a stress test causes it to break along bedding planes, forming a flat surface, concluding the Yonaguni monument is a natural product of tectonics and wave action.\n|LineColor=800080\n}}\n| Viewers = 0.88\n|ShortSummary=Josh searches for the True Cross, a relic said to have mystical healing powers. He visits Jerusalem, Israel and Istanbul, Turkey to find it. It was cut into three pieces on the orders of Empress Helena. He examines this legend at the Church of the Holy Sepulchre in the Old City, where the tomb of Jesus is located and where he was crucified. Then he learns more about crucifixion in Tel Aviv and discovers ancient cross wall carvings at the Church of the Nativity in Bethlehem. Next, he heads to the Ayasofya in Constantinople, where priests hid pieces under the Hippodrome. Lastly, he joins archaeologists at a dig in Sinop, Turkey.\n|LineColor=800080\n}}\n| Viewers = 0.63\n|ShortSummary=Josh hunts for the Heart of Suleiman the Magnificent, ruler of the Ottoman Empire in the 16th century. When Suleiman died in 1566 during a battle in Hungary, his body was brought back to Istanbul, but not before a ritual was performed to remove his heart, place it in a gold container, and bury it beneath his tent. The Sultan's followers believed he had magical powers and continued to beat, waiting to be returned to its host. The town of Tubek was built over the burial site to honor the Sultan. Invaders destroyed this now-lost city a century later, and the heart vanished.\n|LineColor=800080\n}}\n| Viewers = 0.70\n|ShortSummary=Josh travels to South Africa to search for the missing Kruger Millions, the gold coins of the country's entire financial reserve, which vanished overnight after South African President Paul Kruger loaded the hoard on a train in 1900 during the Boer War.\n|LineColor=800080\n}}\n| Viewers = 0.68\n|ShortSummary=Josh searches for a lost city in the Kalahari Desert in Africa. First discovered by circus pioneer The Great Farini in 1885, he supposedly came across the ruins of a lost city half-buried in the sand. Those who followed in his footsteps came up empty-handed and claimed it a hoax, while others vanished. Josh joins a modern explorer who's launched an all-new expedition.\n|LineColor=800080\n}}\n| Viewers = 0.74\n|ShortSummary=Josh searches for Yamashita's Gold, millions of dollars in Southeast Asian gold and jewels looted by Japan and covertly transported to the Philippines under the direction of Japanese general Tomoyuki Yamashita during WWII. The fortune was hidden by gangsters, military generals, and a secret organization in tunnels and caves. Still, it was lost when the Allies won the war, until a treasure hunter found part of it in 1970, and has been searching for it ever since.\n|LineColor=800080\n}}\n| Viewers = 0.59\n|ShortSummary=Josh investigates the myths behind Christopher Columbus. He is an epic hero to some, to others, a bloodthirsty conqueror. He learns the truth about the explorer's early years, nationality, and real discoveries.\n|LineColor=800080\n}}\n| Viewers = 0.64\n|ShortSummary= Josh searches high in the Himalayas for Shangri-La to learn of its legend as a hidden utopia. In the most remote reaches of Nepal near the border of Tibet is an area known as the Mustang, that's been closed off to the outside world and the passage of time. But now Josh and his fellow archaeologists have been granted access to explore it. He finds secrets hiding inside its sky caves and artificial chambers carved into cliff walls.\n|LineColor=800080\n}}\n| Viewers = 0.83\n|ShortSummary=After learning about the ancient Buddhist realm of Shambhala in Kathmandu and exploring the sky caves, Josh continues his search for the real Shangri-La. He discovers a rock tower used for human burials and filled with bones dating back to 800 A.D. Next, he travels to Lo Manthang for another day of investigation in the Martzon area to climb a cave system called Pumamba, which is linked to the legend. Then he heads to Chuusang, a remote cave monastery that has never been excavated.\n|LineColor=800080\n}}\n| Viewers = 0.68\n|ShortSummary=Josh searches for the civilization of Teotihuacan, a lost empire left behind in Mexico with pyramids dedicated to the gods, temples, and a treasure trove of cryptic art. He seeks answers on who these indigenous people were, finds out their secrets that have been buried for 2,000 years, and what they left behind.\n|LineColor=800080\n}}\n| Viewers = 0.73\n|ShortSummary=Josh searches for the lost mummy of Atahualpa, the last king of the Incan empire, hidden high in the Andes Mountains and in the jungles and highlands of Ecuador. His reign ended when Spanish Conquistador Francisco Pizarro murdered him and brought the Inca civilization to an end. His body was mummified in a ritual that supposedly gave him sway over the world of the living. Then, his body vanished, and archaeologists have been searching ever since.\n|LineColor=800080\n}}\n| Viewers = 0.76\n|ShortSummary= Josh exposes Nazi secrets as he searches for the lost fortune of war criminal Adolf Hitler's billions in gold, art, and relics stolen on his orders by the Nazis. They also built networks of hidden tunnels and bunkers. Today, archaeologists use modern technology to recover treasure and excavate the underground legacy of the Third Reich. Josh joins them, first finding answers in Germany, identifying gold in a Nazi train hidden inside a mountain in Poland. Then, an underground facility in Austria, to build a top-secret lab and a war machine.\n|LineColor=800080\n}}\n| Viewers = 0.94\n|ShortSummary= The search for Nazi secrets and their stolen gold continues underground and underwater. Josh dives for relics of the Nazi foreign minister Joachim Von Ribbontrop who sank his family's entire fortune in Lake Fuschlsee in the Austrian Alps. To learn if the Nazis were building an atomic bomb, he starts his quest in Hitler's hometown of Linz. Then, he stops at the Mauthausen-Gusen concentration camp memorial in Sankt Georgen an der Gusen to pay his respects to the hundreds of thousands who perished here. He also explores 25 miles of tunnel under the Bergkristall complex, the largest secret underground facility ever built. It was designed by SS General Hans Kammler to oversee the Nazi's nuclear project.\n|LineColor=800080\n}}\n}}\nSeason 3 (2016–17)\n| Viewers = 0.70\n|ShortSummary=Josh sets off for gold rush country to search for the lost fortune of a Montana sheriff. He explores hidden cave systems and blows open a mine sealed for over a century.\n|LineColor=8A4500\n}}\n| Viewers = 0.87\n|ShortSummary=Josh travels to Hungary to join three archeological teams looking for the lost tomb of Attila the Hun. Legends and ancient texts lead the search from the bottom of the Danube to the mountain forests outside of Budapest.\n|LineColor=8A4500\n}}\n| Viewers = 0.90\n|ShortSummary=On the Mediterranean island of Crete, the Minoans built one of the most glorious ancient civilizations, then vanished. Josh travels to Greece to discover exactly how Europe's first superpower disappeared.\n|LineColor=8A4500\n}}\n| Viewers = 0.77\n|ShortSummary=Josh joins leading archeologists as they investigate America's first missing-persons case, the lost colony of Roanoke.\n|LineColor=8A4500\n}}\n| Viewers = 1.03\n|ShortSummary=To help clone the extinct woolly mammoth back to life, Josh visits the Korean biotech lab driving the project and excavates ancient bones in a working Canadian gold mine. He then descends into a vast sinkhole in Siberia to unearth frozen DNA.\n|LineColor=8A4500\n}}\n| Viewers = 0.96\n|ShortSummary=To find a viable sample of mammoth DNA, Josh retrieves bone samples from the massive Batagay crater, then journeys far upriver to a site in the Siberian wilderness where tusk hunters carve out troves of bones from the permafrost. He takes the DNA samples to the lab and watches the process of treating and testing the specimens. At last, he views the DNA results to determine if the woolly mammoth will walk the earth again.\n|LineColor=8A4500\n}}\n| Viewers = 0.94\n|ShortSummary=Josh investigates the only unsolved plane hijacking in US history. He joins private individuals hunting for D.B. Cooper in the Pacific Northwest. He discovers new clues and theories before jumping out of a plane, as Cooper did.\n|LineColor=8A4500\n}}\n| Viewers = 0.91\n|ShortSummary=Josh sets off deep into the Australian Outback, following the footsteps of explorer Harold Lasseter, who claims to have found a vast field of gold. He speaks to two of Australia's Lasseter experts.\n|LineColor=8A4500\n}}\n| Viewers = 0.92\n|ShortSummary=Josh goes to Tasmania to investigate sightings of the supposedly extinct thylacine, the tasmanian tiger. Recent eyewitness accounts and photographic evidence suggest it may not be extinct.\n|LineColor=8A4500\n}}\n| Viewers = 0.89\n|ShortSummary=Josh retraces the footsteps of Captain Kidd to find his buried treasure. From the East Coast to the Caribbean, the search takes him to a real pirate shipwreck and the island hideout of the buccaneer.\n|LineColor=8A4500\n}}\n| Viewers = 0.92\n|ShortSummary=Josh journeys to the wilds of Namibia to embark on a deep dive in Lake Otjikoto for a long lost WWI treasure.\n|LineColor=8A4500\n}}\n| Viewers = 0.92\n|ShortSummary=Josh emulates Indiana Jones as he searches in Israel and Ethiopia for the lost Ark of the Covenant, the relic said to contain the Ten Commandments.\n|LineColor=8A4500\n}}\n| Viewers = 1.04\n|ShortSummary=Josh tries to find the lost treasure of King John. He explores the marshlands of England to find the king's crown jewels, which were swept away in a freak tidal surge in the 13th century.\n|LineColor=8A4500\n}}\n| Viewers = 0.92\n|ShortSummary=Josh hunts for the hidden treasure of Erwin Rommel, a Nazi general who plundered the wealth of North Africa as his tank corps fled the continent. The search brings him to never-explored underground lakes and undersea relics of WWII.\n|LineColor=8A4500\n}}\n| Viewers = 0.93\n|ShortSummary=To find the plundered riches of the Roman Empire, Josh looks for the tomb of the Visigoth king Alaric in Italy. The hunt extends from Rome to the southern city of Cosenza, where the mayor is spearheading an effort to find the tomb.\n|LineColor=8A4500\n}}\n| Viewers = 0.92\n|ShortSummary=Josh travels to India in search of Dwarka, a mythical kingdom swallowed by the ocean. To find evidence that the golden city is real, he dives into the Arabian Sea and visits a dig site.\n|LineColor=8A4500\n}}\n| Viewers = 0.92\n|ShortSummary= Josh travels to the coast of Florida and Cuba in search of a sunken treasure from a fleet of Spanish ships sunk in 1715; the hunt takes him deep into the Atlantic and the National Archives of Cuba.\n|LineColor=8A4500\n}}\n}}\nSeason 4 (2017–18)\n| Viewers =\n|ShortSummary=Josh investigates how a group of Norse tribesmen gained power in medieval Europe, traveling to Denmark and Iceland.\n|LineColor=#A79548\n}}\n| Viewers =\n|ShortSummary=Josh follows the Vikings' westward expansion from Iceland to Greenland and North America.\n|LineColor=#A79548\n}}\n| Viewers =\n|ShortSummary=Josh travels to Britain to explore the origins of Stonehenge and views a selection of monuments.\n|LineColor=#A79548\n}}\n| Viewers =\n|ShortSummary=Josh travels all over the US to attempt to find the treasures featured in The Secret, a cryptic book published in the 1980s. He meets with members of the book's following, who each think they're about to find one of the ten remaining treasures.\n|LineColor=#A79548\n}}\n| Viewers =\n|ShortSummary=Josh investigates Butch Cassidy's missing money in Colorado, Utah, and Nevada.\n|LineColor=#A79548\n}}\n| Viewers =\n|ShortSummary=Josh goes to the jungles of Ecuador to explore a flooded cave, looking for some metal plates.\n|LineColor=#A79548\n}}\n| Viewers =\n|ShortSummary=Josh goes to Egypt to investigate Hatshepsut, Nefertiti, and Cleopatra.\n|LineColor=#A79548\n}}\n| Viewers =\n|ShortSummary=Josh continues to investigate Hatshepsut, Nefertiti, and Cleopatra.\n|LineColor=#A79548\n}}\n| Viewers =\n|ShortSummary=Game show on the theme of extraterrestrials\n|LineColor=#A79548\n}}\n| Viewers =\n|ShortSummary=Josh attempts to uncover a treasure left behind by the Aquarian Foundation.\n|LineColor=#A79548\n}}\n}}\nSeason 5 (2018)\nSeason 5 started on Tuesday May 29, 2018.\n| OriginalAirDate=\n| Viewers =\n|ShortSummary=With a potential breakthrough in the search for a Snake King tomb, Josh returns to the jungles of Guatemala and the archaeological dig at the ancient Mayan city of El Mirador; the archeologists attempt to pinpoint the tomb's location.\n|LineColor=#0013FF\n}}\n| Viewers =\n|ShortSummary=Josh is on a nationwide treasure hunt to solve a mystery no one has cracked for 40 years: The Secret. He travels coast-to-coast and back in time using cutting-edge augmented reality and tapping into a network of obsessed Secret detectives.\n|LineColor=#0013FF\n}}\n| Viewers =\n|ShortSummary=Josh has a fresh lead on the massive lost treasure of the shipwrecked 1715 Spanish fleet. He returns to Florida's Atlantic coast and dives in with a new expedition that uses the latest tech to locate the fleet's flagship.\n|LineColor=#0013FF\n}}\n| Viewers =\n|ShortSummary=Four years after Josh went on a journey to find the lost heart of Sultan Suleiman the Magnificent, he travels to the newly rediscovered town of Turbek for some shocking new revelations about the case.\n|LineColor=#0013FF\n}}\n| Viewers =\n|ShortSummary=Breaking news sends Josh racing across the globe. One of the wickedly hard puzzles of The Secret, which he has been chasing for years, might have been solved, and while he's been crisscrossing the US, this solution is in his hometown.\n|LineColor=#0013FF\n}}\n}}\nSeason 8 (2020)\n| Viewers = 1.515\n|ShortSummary=Josh touches down in Normandy to investigate land, air, and sea battles. The expedition reveals a Nazi threat greater than ever imagined, unearthing a massive German bunker complex buried for 75 years.\n|LineColor=#FFFF00\n}}\n| Viewers = 1.510\n|ShortSummary= The mysterious vanishing of Northwest Flight 2501 with 58 people aboard.\n|LineColor=#FFFF00\n}}\n| Viewers = 1.264\n|ShortSummary= In search of humanity's origins, Josh joins researchers in Tanzania who are unearthing traces of human ancestors at the prehistoric site Laetoli. He witnesses the predatory behavior of lions and joins a traditional hunt with the Hadza people.\n|LineColor=#FFFF00\n}}\n| Viewers = 1.192\n|ShortSummary=Josh continues his exploration of human evolution, observing chimpanzees at Gombe Stream National Park. In South Africa, he delves into the Sterkfontein caves where the Australopithecus Little Foot was discovered and visited a prehistoric archaeological site in Pondoland.\n|LineColor=#FFFF00\n}}\n| Viewers = 1.436\n|ShortSummary=Searching across England, Josh unearths a cache of ancient treasure as he chases the legend of Queen Boudica, the legendary Celtic queen who nearly defeated the invading Roman army 2,000 years ago.\n|LineColor=#FFFF00\n}}\n| Viewers = 1.227\n|ShortSummary=Josh takes on the Indian Ocean's punishing waters as he chases the lost treasure of Olivier Levasseur, AKA \"The Buzzard,\" rumored to be worth more than a billion dollars.\n|LineColor=#FFFF00\n}}\n| Viewers = 1.374\n|ShortSummary=Josh dives into the mysteries of the Bermuda Triangle. His investigation leads him to the ocean floor, the skies above, and even the edge of space as he tackles some of the most intriguing disappearances in history.\n|LineColor=#FFFF00\n}}\n| Viewers = 1.441\n|ShortSummary=Concluding his epic investigation, Josh uses cutting-edge technology to investigate the Triangle's most infamous shipwreck and lost flights.\n|LineColor=#FFFF00\n}}\n}}\nSeason 9 (2021)\n| Viewers = 0.88\n|ShortSummary=Josh travels the American Midwest tracing the history of legendary outlaw John Dillinger.\n|LineColor=#22BBAA\n}}\n| Viewers =\n|ShortSummary=Josh joins Project Recover to search for a lost WWII bomber in the waters near California's Channel Islands.\n|LineColor=#22BBAA\n}}\n| Viewers =\n|ShortSummary=Josh searches the Pacific Northwest for clues to the mystery of D. B. Cooper.\n|LineColor=#22BBAA\n}}\n| Viewers = 1.01\n|ShortSummary=Josh heads to Colombia to investigate the golden treasures and lost cities that inspired the legend of El Dorado.\n|LineColor=#22BBAA\n}}\n| Viewers =\n|ShortSummary=Josh continues his trek in search of lost Tairona cities in the Colombian jungle.\n|LineColor=#22BBAA\n}}\n| Viewers =\n|ShortSummary=Josh joins a salvage team off the North Carolina coast to investigate the sunken steamship Pulaski and its hoard of rare coins.\n|LineColor=#22BBAA\n}}\n}}\nSeason 10 (2022)\n| Viewers = 1.152\n|ShortSummary=Josh joins a team in Poland to explore a WWII Nazi tunnel that may contain stolen artwork.\n|LineColor=#332288\n}}\n| Viewers = N/A\n|ShortSummary=Josh continues his quest to find Nazi plunder and artifacts hidden in Poland.\n|LineColor=#332288\n}}\n| Viewers = N/A\n|ShortSummary=Josh travels to Kansas and Oklahoma to search for the lost treasure of the infamous Dalton Gang.\n|LineColor=#332288\n}}\n| Viewers = N/A\n|ShortSummary=Josh visits Paris, then scours the wilderness of Maine and Newfoundland to find the wreckage of ''L'Oiseau Blanc'' (The White Bird), which disappeared in 1927 while competing for the Orteig Prize.\n|LineColor=#332288\n}}\n| Viewers = N/A\n|ShortSummary=Josh searches England and Poland to unearth the secret world of the Knights Templar, the legendary warriors rumored to have amassed vast riches and treasures, including the coveted Holy Grail.\n|LineColor=#332288\n}}\n| Viewers = N/A\n|ShortSummary=Josh investigates the buried fortune of Prohibition era mobster Dutch Schultz; he joins divers in the murky waters near a New York mansion where Dutch once lived and explored underground passageways in the bunker that concealed the bootlegger's secret distillery.\n|LineColor=#332288\n}}\n| Viewers = N/A\n|ShortSummary=Josh heads to Alcatraz in San Francisco to trace the route of three missing convicts from a famous 1962 escape attempt. Then, he searches the jungles of Brazil for evidence that the fugitives might have fled there.\n|LineColor=#332288\n}}\n| Viewers = N/A\n|ShortSummary=Egypt's ministry of antiquities invites Josh to join an active dig at Saqqara, where he unearths mummies and treasure buried in 4000-year-old tombs. He examines the pyramid of Merenre and the mummy found within, which could be the oldest known remains of a pharaoh.\n|LineColor=#332288\n}}\n| Viewers = N/A\n|ShortSummary=Josh visits Luxor, then continues excavating at the Saqqara necropolis, where he uncovers another mummy. He explores the tomb of a high-ranking Old Kingdom official that hints at the societal collapse that led to the First Intermediate Period.\n|LineColor=#332288\n}}\n| Viewers = N/A\n|ShortSummary=Josh learns the history of the \"King of the Everglades,\" bank robber and rum-runner John Ashley while searching Florida's swamps for his possible hidden treasure.\n|LineColor=#332288\n}}\n| Viewers = N/A\n|ShortSummary=Josh investigates the history of Moses, exploring Egyptian tombs that may relate to his story, visiting Saint Catherine's Monastery at Mount Sinai, and climbing the holy mountain.\n|LineColor=#332288\n}}\n| Viewers = N/A\n|ShortSummary=Josh continues to follow the legends of Moses, searching for evidence of Semitic languages at Serabit el-Khadim in the Sinai Peninsula. He tours an archaeological dig at Khirbet el-Mastarah in the West Bank, dives into the Sea of Galilee, and visits Nabi Musa which is believed by some to be the tomb of Moses.\n|LineColor=#332288\n}}\n| Viewers = N/A\n|ShortSummary=Josh ventures into the snowy Sierra Nevada mountains near Truckee, California with a group who are re-tracing the path of the ill-fated Donner Party and investigates the heroic story of their rescuers.\n|LineColor=#332288\n}}\n| Viewers = N/A\n|ShortSummary=Josh learns about the ancient Etruscan civilization and its influence on Roman culture as he explores tombs at Tarquinia and Cerveteri.\n|LineColor=#332288\n}}\n}}\nSeason 11 (2023)\n| Viewers         = 0.837\n| ShortSummary    = Just before the outbreak of the 2023 Sudan conflict, Josh visits Sudan to explore the ancient pyramids of the Nubian Kingdom of Kush. At Nuri, he joins archaeologists in an underwater excavation of the sunken tomb of Nastasen.\n| LineColor       = #A485FF\n}}\n| Viewers         = 1.106\n| ShortSummary= Josh concludes his investigation of Kush as he climbs the holy mountain Jebel Barkal to learn the religious and martial reasons behind the Kushite rule of Egypt. At Nastasen's tomb, divers recover apparent proof of the king's from his sarcophagus.\n| LineColor       = #A485FF\n}}\n| Viewers         = 0.949\n| ShortSummary    = In the Golan Heights, Josh visits archaeological sites claimed to be Bethsaida, the lost settlement which, according to the gospels, was the hometown of three apostles and a place where Jesus performed miracles.\n| LineColor       = #A485FF\n}}\n| Viewers         = 0.956\n| ShortSummary    = Josh searches the coast of The Lizard in Cornwall for the loot of Henry Avery, who reportedly escaped with the largest treasure in the history of piracy.\n| LineColor       = #A485FF\n}}\n| Viewers         = 1.070\n| ShortSummary    = Josh dives into Lake Superior in search of the lost WWI French minesweepers Inkerman and Cerisoles, exploring the waters near the Upper Peninsula of Michigan and Michipicoten Island in Canada.\n| LineColor       = #A485FF\n}}\n| Viewers         =\n| ShortSummary    = Josh travels to Asturias in Spain to investigate the truth behind the legend of the 8th century King Pelayo. He joins researchers to uncover ceremonial human burials deep in the La Garma cave complex.\n| LineColor       = #A485FF\n}}\n| Viewers         =\n| ShortSummary    = Josh joins archaeologists at Koh Ker which briefly was the capital of the Khmer Empire. The team uncovers ancient temple carvings and searches for evidence that could help repatriate stolen statues lost through the illicit antiquities trade.\n| LineColor       = #A485FF\n}}\n| Viewers         =\n| ShortSummary    = Josh continues his investigation into artifacts looted by former Khmer Rouge soldiers and traded by controversial antiquities dealer Douglas Latchford. He examines possible reasons for the historical fall of Koh Ker, dives for statue fragments in a temple moat, and helps to recover a piece of the pedestal of an iconic statue.\n| LineColor       = #A485FF\n}}\n}}\nSeason 12 (2023)\n|viewers=12 |country=U.S. |episodes=\n| Viewers         =\n| ShortSummary    = Josh joins Project Recover at Chuuk Lagoon in Micronesia to search for the remains of missing-in-action servicemen and aircraft from Operation Hailstone.\n| LineColor       = #F366AA\n}}\n| Viewers         =\n| ShortSummary    = Josh concludes his stay at Chuuk Lagoon by visiting underwater sites identified by sonar survey, including a dive to a recently discovered Douglas SBD Dauntless.\n| LineColor       = #F366AA\n}}\n| Viewers         =\n| ShortSummary    = Josh joins an expedition to uncover the Maya lost city of Sac Balam located deep in the Lacandon Jungle of Chiapas, Mexico.\n| LineColor       = #F366AA\n}}\n| Viewers         =\n| ShortSummary    = Josh's hunt for the pirate king Amaro Pargo's hidden stolen treasure in the Canary Islands leads him beneath an active volcano.\n| LineColor       = #F366AA\n}}\n| Viewers         =\n| ShortSummary    = Josh teams up with a former FBI agent looking for information in an East Texas cave used as a hideout that once belonged to the infamous bank robbers Bonnie and Clyde.\n| LineColor       = #F366AA\n}}\n| Viewers         =\n| ShortSummary    = At Little Bahama Bank, Josh joins a salvage team financed by businessman Carl Allen to recover artifacts from the 1656 wreck of the Spanish galleon Nuestra Señora de las Maravillas.\n| LineColor       = #F366AA\n}}\n| Viewers         =\n| ShortSummary    = Josh traverses Denmark, Sweden, and Poland exploring the legend of King Harald Bluetooth and the lost Viking settlement Jomsborg that may be his final resting place.\n| LineColor       = #F366AA\n}}\n| Viewers         =\n| ShortSummary    = Josh joins a salvage team seeking the wreckage of the XP5Y, a prototype U.S. Navy seaplane that crashed off the coast of San Diego, California in 1953.\n| LineColor       = #F366AA\n}}\n}}\nSeason 13 (2024)\n| Viewers         =\n| ShortSummary    = Josh investigates the lost tomb of Alexander the Great, visiting the tomb of Phillip II in Vergina, Greece and an archaeological dig in the middle of modern Alexandria, Egypt.\n| LineColor       = #F37744\n}}\n| Viewers         =\n| ShortSummary    = Josh continues the search in Alexandria, then visits the British Museum in London and St Mark's Basilica in Venice to pursue one researcher's theory that Alexander's remains might actually lie in the place of Saint Mark's relics.\n| LineColor       = #F37744\n}}\n| Viewers         =\n| ShortSummary    = In Pennsylvania, Josh joins researchers who are investigating the hideouts and possible lost fortune of the Doan Outlaws, a Loyalist family of spies and robbers who opposed the Patriots during the American Revolutionary War.\n| LineColor       = #F37744\n}}\n| Viewers         =\n| ShortSummary    = Josh joins shark expert Tristan Guttridge in the waters off Key West in an attempt to track sharks to the lost wreck of the Norlindo, a fuel tanker sunk by a German U-boat during Operation Drumbeat.\n----\nThis episode aired as part of Discovery's Shark Week 2024.\n| LineColor       = #F37744\n}}\n| Viewers         =\n| ShortSummary    = Josh meets the restoration team of the Fleet Air Arm Museum searching for parts of Fairey Barracudas, a model of British bombers of which no intact examples exist. He excavates a former airfield in St Andrews, Scotland then finds wreckage near Alta in the far north of Norway, where Barracudas once attacked the Nazi battleship Tirpitz.\n| LineColor       = #F37744\n}}\n| Viewers         =\n| ShortSummary    = Josh travels to Zanzibar and Mafia Island in Tanzania in search of Rhapta, a lost city of fortune at the bottom of the ocean that's described as the Atlantis of Africa.\n| LineColor       = #F37744\n}}\n| Viewers         =\n| ShortSummary    = Josh teams up with Project Recovery again, searching for a Douglas C-47 Skytrain plane that was lost off the coast of Côte d'Ivoire in 1945 while transporting 18 members of the Women's Army Corps (WAC) .\n| LineColor       = #F37744\n}}\n}}\nSeason 14 (2024)\n| Viewers         =\n| ShortSummary    = To investigate the ancient Nabataeans, Josh joins a team in Petra, Jordan with permission to excavate in front of its iconic Treasury. Then he travels to the ruins of Sela where a cliffside inscription may explain how the fall of the Kingdom of Edom led to the Nabataeans' rise to power.\n| LineColor       = #2E6427\n}}\n| Viewers         =\n| ShortSummary    = Josh concludes his visit to Petra, joining archaeologists as they open the tomb below the Treasury, finding skeletal remains and artifacts likely dating to the first century BCE. Then Josh visits scientists using computer imaging to reconstruct scrolls that reveal how the Nabataeans influenced later cultures.\n| LineColor       = #2E6427\n}}\n| Viewers         =\n| ShortSummary    = Josh joins a team off the coast of San Juan, Puerto Rico searching for the wreck of a Douglas DC-4 named Clipper Endeavor, which was involved in a tragic 1952 accident that changed over-water airline safety regulations.\n| LineColor       = #2E6427\n}}\n| Viewers         =\n| ShortSummary    = Josh meets up with treasure hunters in Indiana, on the search for the lost loot of the Reno Gang, a group of 19th century train robbers.\n| LineColor       = #2E6427\n}}\n| Viewers         =\n| ShortSummary    = Searching for the sunken treasure of \"Black Sam\" Bellamy, Josh joins a team at the shoals off Cape Cod, Massachusetts who are excavating the Whydah, the only authenticated wreck of a pirate ship from the Golden Age of Piracy ever discovered.\n| LineColor       = #2E6427\n}}\n| Viewers         =\n| ShortSummary    = Josh goes in search of the bones of Saint Nicholas, the historical inspiration for Santa Claus. He visits the saint's place of origin in Myra Turkey and locations of his possible remains: Bari and Venice in Italy and even in Chicago.\n| LineColor       = #2E6427\n}}\n}}\nSeason 15 (2025)\n| Viewers         =\n| ShortSummary    = In Poland, Josh inspects evidence of the Nazi Amerikabomber program which intended to build a long-range aircraft to attack the United States. He joins a team searching the tunnels of the Międzyrzecki Rejon Umocniony (MRU) and excavates the possible site of an underground aircraft factory.\n| LineColor       = #A7BDD7\n}}\n| Viewers         =\n| ShortSummary    = Josh travels to Tsavo, Kenya, visiting the sites of the Tsavo Man-Eaters attacks, where a pair of rogue lions killed numerous people in 1898. He heads into the field with rangers of the Big Life Foundation conservation group as they track aggressive lions responsible for livestock attacks. Then, conservators at Chicago's Field Museum reveal recent discoveries from the scientific study of the man-eating lions' skulls.\n| LineColor       = #A7BDD7\n}}\n| Viewers         =\n| ShortSummary    = Josh examines the theory that Western showman Buffalo Bill Cody may have been buried on Cedar Mountain near Cody, Wyoming, rather than the more commonly accepted gravesite on Lookout Mountain in Colorado. Then he joins a treasure hunter searching for a potential buried cache of Buffalo Bill's whiskey.\n| LineColor       = #A7BDD7\n}}\n| Viewers         =\n| ShortSummary    = In the waters near the Greek island Fourni, Josh joins archaeologists investigating a concentration of ancient shipwrecks and recovering amphorae from the sea floor. The team tests a theory that unpredictable winds and currents made one strait particularly treacherous to seafarers.\n| LineColor       = #A7BDD7\n}}\n| Viewers         =\n| ShortSummary    = Josh joins treasure hunters in the swamps of South Carolina looking for the lost fortune of the infamous pirate Anne Bonny, whose fate remains unknown. Then they search for the remnants of a potential trading post on the former King's Highway that could relate to Bonny.\n| LineColor       = #A7BDD7\n}}\n| Viewers         =\n| ShortSummary    = Josh again joins the Project Recover team at Chuuk Lagoon, Micronesia to find the lost Republic P-47 Thunderbolt of WWII fighter pilot Gordon Beecroft who went missing in action.\n| LineColor       = #A7BDD7\n}}\n| Viewers         =\n| ShortSummary    = At Göbekli Tepe in Turkey, Josh examines a Neolithic settlement that holds some of the world's oldest known megalithic structures. At nearby Karahan Tepe, he joins archaeologists who are excavating the ruins of ritual sites.\n| LineColor       = #A7BDD7\n}}\n}}\nSeason 16 (2025)\n| Viewers         =\n| ShortSummary    = With rare private access to the passages inside the Great Pyramid of Giza, Josh tests conspiracy theories about the monument, including the possibility it may hold still undiscovered treasures of Khufu.\n| LineColor       = #5F4181\n}}\n| Viewers         =\n| ShortSummary    = In the conclusion of his exploration of the Great Pyramid, Josh examines records left by its builders, tests a method to move giant limestone blocks, and uses photogrammetry to find potential clues to an undiscovered chamber.\n| LineColor       = #5F4181\n}}\n| Viewers         =\n| ShortSummary    = Josh searches the mountains near Weaverville, California for gold stolen in 1892 by stagecoach robbers the Ruggles brothers. He is joined by guest Parker Schnabel from Gold Rush.\n| LineColor       = #5F4181\n}}\n}}\nExtra Finds (2016–17)\nExtra Finds episodes involve viewers interacting with Gates.\n| Viewers =\n|ShortSummary=Additional coverage of Josh's attempt to find Captain Morgan's lost gold and sunken flagship.\n|LineColor=B40405\n}}\n| Viewers =\n|ShortSummary=Additional coverage of Josh's search for the Linga stones.\n|LineColor=B40405\n}}\n| Viewers =\n|ShortSummary=Additional coverage of the Nazca Lines.\n|LineColor=B40405\n}}\n| Viewers =\n|ShortSummary=Additional coverage of the season one Mayan Empire episode.\n|LineColor=B40405\n}}\n| Viewers =\n|ShortSummary=\n|LineColor=B40405\n}}\n| Viewers =\n|ShortSummary=\n|LineColor=B40405\n}}\n| Viewers =\n|ShortSummary=Additional coverage of the Thomas Beale treasure.\n|LineColor=B40405\n}}\n| Viewers =\n|ShortSummary= Additional coverage of the City of Gold.\n|LineColor=B40405\n}}\n| Viewers =\n|ShortSummary=\n|LineColor=B40405\n}}\n| Viewers = 0.62\n|ShortSummary=\n|LineColor=B40405\n}}\n| Viewers = 0.59\n|ShortSummary= Additional coverage of Shangri-La.\n|LineColor=B40405\n}}\n| Viewers =\n|ShortSummary=\n|LineColor=B40405\n}}\n| Viewers = 0.31\n|ShortSummary= Additional coverage of Jesse James' lost gold.\n|LineColor=B40405\n}}\n| Viewers =\n|ShortSummary= Additional coverage of the Amber Chamber.\n|LineColor=B40405\n}}\n| Viewers =\n|ShortSummary=\n|LineColor=B11030\n}}\n| Viewers =\n|ShortSummary=\n|LineColor=B11030\n}}\n| Viewers =\n|ShortSummary=\n|LineColor=B11030\n}}\n| Viewers = 0.60\n|ShortSummary=\n|LineColor=B40405\n}}\n| Viewers = 0.55\n|ShortSummary=\n|LineColor=B40405\n}}\n| Viewers = 0.58\n|ShortSummary=\n|LineColor=B40405\n}}\n| Viewers = 0.53\n|ShortSummary=\n|LineColor=B40405\n}}\n| Viewers = 0.56\n|ShortSummary=\n|LineColor=B40405\n}}\n| Viewers = 0.59\n|ShortSummary=\n|LineColor=B40405\n}}\n| Viewers = 0.63\n|ShortSummary=\n|LineColor=B40405\n}}\n}}\nHunt for the Yeti (2016)\n| Viewers = 0.773\n|ShortSummary= Josh visits Kathmandu and hikes into the Himalayan mountains once again searching for the legendary Yeti.\n|LineColor=87CEFA\n}}\n| Viewers =\n|ShortSummary= Josh continues his exploration of the Himalayas and examines sacred artifacts that some Nepalese people believe come from the creature.\n|LineColor=87CEFA\n}}\n| Viewers =\n|ShortSummary= Josh explores the slopes of Mount Everest, then travels to the forests of Bhutan, where he once found an alleged Yeti footprint on Destination Truth.\n|LineColor=87CEFA\n}}\n| Viewers =\n|ShortSummary= Josh wraps up his rafting trek in Bhutan, then returns to the US where scientists analyze the evidence he collected.\n|LineColor=87CEFA\n}}\n}}\nHunt for Extraterrestrials (2017)\n| Viewers = 0.76\n|ShortSummary= Josh begins his search for extraterrestrial life with a once-in-a-lifetime visit to NASA and an alien-hunting expedition in Chile, where scientists and ufologists are making new discoveries.\n|LineColor=2E5392\n}}\n| Viewers = 0.70\n|ShortSummary= Josh journeys to remote Easter Island, where ancient alien theorists believe extraterrestrials visited a millennium ago; the site of a recent meteorite strike in Zimbabwe could prove life on Earth began in outer space.\n|LineColor=2E5392\n}}\n| Viewers = 0.80\n|ShortSummary= The hunt for alien life continues in Zimbabwe, where Josh interviews witnesses from Ariel School, one of the largest UFO sightings in modern history. Then he revisits the infamous case that has become known as Europe's Roswell in England.\n|LineColor=2E5392\n}}\n| Viewers = 0.71\n|ShortSummary= Josh's epic search for alien life comes to a close in the US, where a legendary investigation team brings him to a hot case in Arkansas. Then, he visits with a researcher who may have new information on the mother of all UFOs.\n|LineColor=2E5392\n}}\n}}\nSearch for the Afterlife (2018)\n| Viewers =\n|ShortSummary=Seeking evidence of the afterlife, Josh enters an ancient Roman gate to hell that still claims victims; in New York, a medical doctor shows how consciousness survives death; in California, a gifted medium shocks Josh with a message from beyond.\n|LineColor=#00AEFF\n}}\n| Viewers =\n|ShortSummary=Dr. Deepak Chopra advises Josh to investigate the phenomenon of reincarnation in India; in Turkey, Josh explores an Islamic path to paradise; he returns to face a man possessed by an evil spirit.\n|LineColor=#00AEFF\n}}\n| Viewers =\n|ShortSummary=From ancient tombs to the latest technology, humans have always been obsessed with cheating death; Josh visits a tribe in Indonesia where people live with mummies; a Russian cryonics laboratory freezes humans for the future.\n|LineColor=#00AEFF\n}}\n| Viewers =\n|ShortSummary=In the Amazon, Josh meets a shaman who takes him on an ayahuasca trip to the brink of the afterlife; a team of investigators guide Josh into one of the most haunted places on Earth.\n|LineColor=#00AEFF\n}}\n}}\nExpedition: Back to the Future (2021)\nIn this four-part Discovery+ miniseries, Josh Gates is joined by Back to the Future star Christopher Lloyd as they journey across the U.S. in search of all surviving DMC DeLorean vehicles which were used in the film trilogy. Their mission is to sell a time machine at auction to benefit The Michael J. Fox Foundation.\n| Viewers =\n|ShortSummary= Josh and Christopher Lloyd set off to find all the DeLorean time machines used in the film series.\n|LineColor=#EEAA00\n}}\n| Viewers =\n|ShortSummary= Josh and Christopher Lloyd search out versions of the original time machine held by collectors.\n|LineColor=#EEAA00\n}}\n| Viewers =\n|ShortSummary= Josh and Christopher Lloyd examine the DeLoreans at Universal Studios Florida in Orlando, Florida, but they are hit with a new problem.\n|LineColor=#EEAA00\n}}\n| Viewers =\n|ShortSummary= As time runs out, the guys need to construct their own DeLorean time machine.\n|LineColor=#EEAA00\n}}\n}}\nAftershows\nAfter the Hunt is a series of aftershows for Expedition Unknown.\nHunt for Extraterrestrials: After the Hunt (2017)\n| Viewers = 0.64\n|ShortSummary=\n|LineColor=E0C4AD\n}}\n| Viewers = 0.62\n|ShortSummary=\n|LineColor=E0C4AD\n}}\n| Viewers = 0.66\n|ShortSummary=\n|LineColor=E0C4AD\n}}\n| Viewers = 0.60\n|ShortSummary=\n|LineColor=E0C4AD\n}}\n}}\nExpedition Unknown: After the Hunt &mdash; Season 6 (2020)\nSeason 6 of After the Hunt, aftershows for season 8 of Expedition Unknown\n| Viewers =\n|ShortSummary=\n|LineColor=E0C4AD\n}}\n| Viewers =\n|ShortSummary=\n|LineColor=E0C4AD\n}}\n| Viewers =\n|ShortSummary=\n|LineColor=E0C4AD\n}}\n| Viewers =\n|ShortSummary=\n|LineColor=E0C4AD\n}}\n| Viewers =\n|ShortSummary=\n|LineColor=E0C4AD\n}}\n| Viewers =\n|ShortSummary=\n|LineColor=E0C4AD\n}}\n| Viewers =\n|ShortSummary=\n|LineColor=E0C4AD\n}}\n}}\nShark Week Specials\nExpedition Unknown special episodes aired during Discovery's Shark Week in 2019 and 2021. These two specials are not classified as belonging to any season. Additionally, a shark-themed episode \"Sharks vs. Nazis in Paradise\" aired as part of Shark Week 2024, and is listed as the fourth episode of season 13.\n| Viewers = 1.845\n|ShortSummary= Josh travels across Mexico and South Africa to find fossilized traces of the Megalodon. Joined by shark experts, he goes diving to learn what it might have been like to encounter the ancient giant shark.\n|LineColor=99ADCD\n}}\n| OriginalAirDate=\n| Viewers = 0.94\n|ShortSummary= Josh and William Shatner go on a shark diving adventure in The Bahamas.\n|LineColor=99ADCD\n}}\n}}\nJosh Gates Tonight\nJosh Gates Tonight is a spinoff series originally created to fill in the end of season 8 of Expedition Unknown in April 2020 due to the COVID-19 lockdown period. Initially considered part of Expedition Unknown, Josh Gates Tonight later was classified as a separate series. The fifth season premiered in May 2022.\nThis talk show features Josh Gates interviewing celebrity guests via videoconference, field segments, comedy bits, and cocktail recipes. At the start of the pandemic, the program was recorded in Gates' home, though production moved to the \"Expedition Headquarters\" studio starting with episode 14 of the first season.\nSeason 1 (2020)\n| Viewers =\n|ShortSummary= While remaining safe at home, Josh interviews Damien Duffy, host of the Discovery series Legends of the Wild.\nNote: The first three episodes of the series are 10 minutes in duration.\n|LineColor=030303\n}}\n| Viewers =\n|ShortSummary= Josh recaps his woolly mammoth expedition and tests his videoconferencing skills with the hosts of Legends of the Wild.\n|LineColor=030303\n}}\n| Viewers =\n|ShortSummary= Josh shares updates and footage from his adventures hunting the mysterious mountain-dwelling yeti; TV personality Dave Turin (''Gold Rush: Dave Turin's Lost Mine) joins in to discuss his season finale and winter challenges.\n|LineColor=030303\n}}\n| Viewers =\n|ShortSummary= In this Earth Day special, Josh welcomes Joel McHale, talks environmentalism with various stars of Discovery networks shows, and discusses Team Trees with Mark Rober.\nNote: From this episode forward, the series expands to one hour, including commercials.\n|LineColor=030303\n}}\n| Viewers =\n|ShortSummary= Josh is joined by TV personalities Jack Osbourne (Portals to Hell), Sig Hansen (Deadliest Catch), YouTube blacksmith The Hacksmith, and Richard Wiese (president of The Explorers Club). Josh tries to learn the art of axe throwing in his backyard.\n|LineColor=030303\n}}\n| Viewers =\n|ShortSummary= Josh interviews Olympic gymnast Shawn Johnson East and discusses stolen art with The Monuments Men author Robert M. Edsel. Josh hosts a virtual summit of \"explorer\" TV hosts including Josh Bernstein, Jeff Corwin, and Don Wildman.\n|LineColor=030303\n}}\n| Viewers =\n|ShortSummary= In this Indiana Jones special, Josh interviews actors Karen Allen and John Rhys-Davies (Raiders of the Lost Ark), Adam Savage shows off his Indy props, and Reza Aslan discusses the history of Jesus. Josh learns how to crack a bullwhip in his backyard.\n|LineColor=030303\n}}\n| Viewers =\n|ShortSummary= Josh discusses the Bermuda Triangle and welcomes guests Bruce Campbell, Michael Emerson, Mike Baker (Black Files Declassified), and Gwen Grimes (Naked and Afraid XL''). Josh has a very short expedition to the \"Beverly Hills Bermuda Triangle\" an L.A. intersection that's rumored to be cursed.\n|LineColor=030303\n}}\n| Viewers =\n|ShortSummary= Josh explores British legends with Terry Gilliam (Monty Python), Cary Elwes, Jeremy Wade (River Monsters), and Oberon Zell-Ravenheart from the Grey School of Wizardry. Josh forges a sword with Hollywood blacksmith Tony Swatton.\n|LineColor=030303\n}}\n| Viewers =\n|ShortSummary= Josh looks back at WWII history with Dennis Quaid, Project Recover, retired SEAL Team Six member Will Chesney, and Flula Borg. Mixologist Jeff \"Beachbum\" Berry explains the WWII origin of the suffering bastard cocktail. Josh acts as an attack dummy for military dog training.\n|LineColor=030303\n}}\n| Viewers =\n|ShortSummary= Josh chats about the wild west with Louie Anderson, Lou Diamond Phillips, Stephen Root, and Marty Raney from Homestead Rescue. Josh tries to learn shooting and lasso tricks.\n|LineColor=030303\n}}\n.\n| Viewers =\n|ShortSummary= Josh talks ancient Egypt and interviews Steven Soderbergh, Lucy Lawless, Padma Lakshmi, Patricia Velásquez, and archaeologist Sarah Parcak.\n|LineColor=030303\n}}\n| Viewers =\n|ShortSummary= Josh revisits his Siberian expeditions and talks to actors Scott Glenn, Jason Isaacs, and Danny Trejo, as well as TV hosts Phil Keoghan and Mike Rowe. Josh learns the art of ice sculpture and visits a vodka distillery.\n|LineColor=030303\n}}\n| Viewers =\n|ShortSummary= Josh virtually discusses secret codes and treasures with Jesse Eisenberg, Penn & Teller, Kyle MacLachlan, and former CIA agent Amaryllis Fox. Josh tries to learn lock picking.\nNote: Starting with this episode, production of the show moves from Josh Gates' house to the \"Expedition HQ\" studio.\n|LineColor=030303\n}}\n| Viewers =\n|ShortSummary= Josh pays tribute to his favorite science fiction with Anthony Daniels, Jonathan Frakes, Marina Sirtis, Lance Henriksen, and Keith David. Special effects makeup artist Jim Ojala transforms Josh into an alien.\n|LineColor=030303\n}}\n| Viewers =\n|ShortSummary= Josh celebrates 1980s pop culture with actors Lea Thompson (Back to the Future), Alex Winter (''Bill and Ted's Excellent Adventure), and Sean Astin (The Goonies) and looks to pry clues to The Secret'' from illustrator John Jude Palencar.  Josh asks his kid's karate instructor to teach him the crane kick from The Karate Kid.\n|LineColor=030303\n}}\n| Viewers =\n|ShortSummary= It's game night as Josh interviews guests Neil deGrasse Tyson, John Smoltz, Gary Cole, and Ben Bailey from Cash Cab. Josh tries to run the course from Dodgeball Thunderdome, a show which aired on Discovery at the time.\n|LineColor=030303\n}}\n| Viewers =\n|ShortSummary= Josh discusses survival with David Arquette (You Cannot Kill David Arquette), Josh Lucas (Alive), and the hosts of the Discovery show 100 Days Wild. Josh goes survivalist shopping at a military surplus store.\n|LineColor=030303\n}}\n| Viewers =\n|ShortSummary= Josh explores heists with Elliott Gould (''Ocean's Eleven), Kevin Pollak (The Usual Suspects''), Luis Guzmán, and hostage negotiator Christopher Voss. Josh learns getaway car driving from a Hollywood stunt driver.\n|LineColor=030303\n}}\n| Viewers =\n|ShortSummary= Josh explores cinematic gods and monsters with the actors Orlando Jones, Sarah Wayne Callies, and Doug Jones. Josh tours the collection of movie memorabilia dealer Joe Maddalena.\n|LineColor=030303\n}}\n| Viewers =\n|ShortSummary= Josh goes on a virtual Anglophile adventure interviewing John Cleese, Lucy Davis, Cat Deeley, and Ed Stafford. Josh visits the Will Rogers Polo Club.\n|LineColor=030303\n}}\n| Viewers =\n|ShortSummary= Josh investigates life's mysteries with actor Matthew Modine, author Deepak Chopra, Chazz Palminteri, and Arthur Brand. Josh hires a private detective to tail his writer, comedian Tony Sam.\n|LineColor=030303\n}}\n| Viewers =\n|ShortSummary= Josh celebrates the works of Stephen King with guests Anthony Michael Hall (The Dead Zone), Dee Wallace (Cujo), David Morse (The Green Mile), and Danny Lloyd (The Shining). Josh and his cameraman Evan B. Stone visit a socially-distanced drive-through Halloween haunted attraction.\n|LineColor=030303\n}}\n}}\nJosh Gates Tonight: Shark Week (2020)\n| Viewers =\n|ShortSummary=\n|LineColor=EFEFEF\n}}\n| Viewers =\n|ShortSummary=\n|LineColor=030303\n}}\n| Viewers =\n|ShortSummary=\n|LineColor=EFEFEF\n}}\n| Viewers =\n|ShortSummary=\n|LineColor=EFEFEF\n}}\n| Viewers =\n|ShortSummary=\n|LineColor=EFEFEF\n}}\n}}\nSeason 2 (2020)\nA second season of seven episodes premiered in November 2020.\n| Viewers =\n|ShortSummary= Josh discusses the paranormal with guests Matthew McConaughey and Dean Haglund. Josh joins Phil Torres & Jessica Chobot of Expedition X in Wisconsin for a behind-the-scenes look at the production of season 3.\n|LineColor=202020\n}}\n| Viewers =\n|ShortSummary= Josh discusses exploration with guests John Lithgow, explorer Ranulph Fiennes, and astronauts Bob Behnken and Doug Hurley. Josh gets a demonstration in urban mushing with a team of sled dogs.\n|LineColor=202020\n}}\n| Viewers =\n|ShortSummary= Josh discusses Thanksgiving with guests Guy Fieri, Cheryl Hines, and Alfonso Ribeiro. Josh visits a pumpkin patch and gets lost in a corn maze.\n|LineColor=202020\n}}\n| Viewers =\n|ShortSummary= Josh discusses superheroes with Katee Sackhoff, Joe Manganiello, and Famke Janssen. Josh tours the set of BattleBots.\n|LineColor=202020\n}}\n| Viewers =\n|ShortSummary= Josh talks space exploration with guests astronaut Charles Duke, Mayim Bialik, Tim Heidecker, and Keir Dullea. Josh experiences weightlessness on a reduced-gravity aircraft.\n|LineColor=202020\n}}\n| Viewers =\n|ShortSummary= Josh celebrates Christmas films with guests Peter Billingsley, Judy Greer, and Reginald VelJohnson. Josh takes a festive tour of SkyPark at Santa's Village.\n|LineColor=202020\n}}\n| Viewers =\n|ShortSummary= Josh promotes Discovery+ with the stars of the streaming service's programs, including David Schwimmer who narrates the nature docuseries Mysterious Planet.\n|LineColor=202020\n}}\n}}\nSeason 3 (2021)\nThe third season premiered in April 2021.\n| Viewers =\n|ShortSummary= Josh pays tribute to Back to the Future with actors Christopher Lloyd and Craig Robinson.\n|LineColor=303030\n}}\n| Viewers =\n|ShortSummary= Josh talks horror movies with guests Robert Englund, Seth Green and Joe Dante.\n|LineColor=303030\n}}\n| Viewers =\n|ShortSummary= Josh explores magic with guests Dominic Monaghan, Billy Boyd, Michael Carbonaro, and Piff the Magic Dragon.\n|LineColor=303030\n}}\n| Viewers =\n|ShortSummary= Josh discusses ghosts with guests Kevin Bacon, Haley Joel Osment, Jack Osbourne, and the cast of Ghost Brothers.\n|LineColor=303030\n}}\n| Viewers =\n|ShortSummary= Josh talks cars with Larry the Cable Guy, Gabriel Iglesias, Kurt Busch, and the cast of Street Outlaws.\n|LineColor=303030\n}}\n| Viewers =\n|ShortSummary= Josh pays tribute to pop culture villains with guests Giancarlo Esposito, Paul Reiser, and Michelle Gomez. Josh visits a stunt performer training school.\n|LineColor=303030\n}}\n}}\nJosh Gates Tonight: Shark Week (2021)\n| Viewers =\n|ShortSummary= Josh chats with Shark Week guest hosts Tiffany Haddish, Steve-O & Sean \"Poopies\" McInerney from Jackass, and Dickie Chivell. Josh swims with the sharks at Shark Reef at Mandalay Bay.\n|LineColor=DDDDDD\n}}\n| Viewers =\n|ShortSummary= Josh interviews William Shatner, Brad Paisley, and Robert Irwin from ''Crikey! It's the Irwins.\n|LineColor=DDDDDD\n}}\n| Viewers =\n|ShortSummary= Josh welcomes J. B. Smoove, Kevin Smith, and shark experts Alison Towner and Riley Elliott.\n|LineColor=DDDDDD\n}}\n| Viewers =\n|ShortSummary= Josh talks with \"Dr. Pimple Popper\" Sandra Lee, Rob Gronkowski, Shark Week filmmakers Lauren and Joe Romeiro, and the fans behind a community-driven Jaws'' remake.\n|LineColor=DDDDDD\n}}\n| Viewers =\n|ShortSummary= Josh interviews David Blaine, Kevin O'Leary from Shark Tank, and shark expert Tristan Guttridge. Josh dives with sharks at a shipwreck in The Bahamas.\n|LineColor=DDDDDD\n}}\n}}\nSeason 4 (2021)\n| Viewers =\n|ShortSummary= Josh chats about lost cities with Tom Green, Rhys Darby, and BD Wong.\n|LineColor=505060\n}}\n| Viewers = 0.65\n|ShortSummary= Josh welcomes television sitcom stars Harry Shearer, Kelsey Grammer, Susan Olsen, Susie Essman, and Ted Lange.\n|LineColor=505060\n}}\n| Viewers =\n|ShortSummary= Josh recounts maritime mysteries with actor Tim Robbins, Billy Zane, William Fichtner, and the screenwriter of Jaws Carl Gottlieb.\n|LineColor=505060\n}}\n| Viewers =\n|ShortSummary= Josh chats about urban legends with JoBeth Williams, Kane Hodder, and the Expedition X team of Jessica Chobot and Phil Torres. Josh attends a séance.\n|LineColor=505060\n}}\n| Viewers =\n|ShortSummary= In this mobster-themed episode, Josh chats with actors Paul Sorvino, Michael Imperioli, Steve Schirripa, and Vincent D'Onofrio. Josh visits the Mob Museum in Las Vegas.\n|LineColor=505060\n}}\n| Viewers =\n|ShortSummary= Josh pays tribute to inventions and interviews Terrence Howard, Brent Spiner, Dan Harmon, and Aaron Krause the inventor of Scrub Daddy. Josh steps into a flight simulator cockpit.\n|LineColor=505060\n}}\n}}\nSeason 5 (2022)\n| Viewers =\n|ShortSummary= Josh chats about subterranean locations and interviews guests Evangeline Lilly, Joe Pantoliano, and the Expedition X team.\n|LineColor=6E5151\n}}\n| Viewers =\n|ShortSummary= Josh discusses art theft and interviews guests Parker Posey, Robert M. Edsel author of Monuments Men, and Dan Fogler. Josh and Jess Chobot try out an art heist themed escape room.\n|LineColor=6E5151\n}}\n| Viewers =\n|ShortSummary= Josh talks about legendary outlaws with actors Anson Mount, Troy Kotsur, and Tom Blyth. Josh tries his hand at mounted shooting.\n|LineColor=6E5151\n}}\n| Viewers =\n|ShortSummary= In this aviation-themed episode, Josh chats with LeVar Burton, Parker Schnabel from Gold Rush, and Steven Weber. Josh takes a ride on an acrobatic plane.\n|LineColor=6E5151\n}}\n| Viewers =\n|ShortSummary= Josh delves into secret societies and interviews guests Austin Butler, Mark Proksch, and Love In The Jungle contestant Dishon Isaac. Josh meets up with mentalists at the Magic Castle.\n|LineColor=6E5151\n}}\n| Viewers =\n|ShortSummary= Josh discusses the prohibition era and interviews guests Baz Luhrmann, Joe Mantegna, and Danica Patrick. Josh has a lesson in flair bartending.\n|LineColor=6E5151\n}}\n}}\nExpedition X\n| name                 = Expedition X\n| director             =\n| starring             =\n| country              = United States\n| language             = English\n| num_seasons          = 10\n| num_episodes         = 68\n| executive_producer   =\n| editor               =\n| cinematography       =\n| runtime              = 42 minutes\n| company              = Ping Pong Productions\n| network              = Discovery Channel\n| first_aired          =\n| last_aired          = present\n}}\nExpedition X is an American paranormal reality series which premiered on Discovery Channel on February 12, 2020. A spinoff of Expedition Unknown, Expedition X exclusively explores paranormal topics. The program is hosted by Josh Gates, biologist Phil Torres, television personality/writer Jessica Chobot (seasons 1-7), and paranormal investigator Heather Amaro (seasons 8-present). Gates presents the program from the Expedition HQ studio, though he does not usually accompany the team in the field, with the exceptions of the two-part episodes that opened seasons three, six, eight, and ten.\nWhile Josh Gates was hosting Josh Gates Tonight in summer 2020, his regular camera crew were filming the second season of Expedition X after the initial COVID-19 lockdown cleared. The second season premiered on November 11, 2020. The eighth season premiered on August 14, 2024.\nSeason 1 (2020)\n| Viewers =\n|ShortSummary= Phil and Jess travel to Point Pleasant, West Virginia in search of Mothman.\n|LineColor=33DD77\n}}\n| Viewers =\n|ShortSummary= Phil and Jess investigate the tek tek, a Cambodian Bigfoot-like creature.\n|LineColor=33DD77\n}}\n| Viewers =\n|ShortSummary= The team visits the infamous Island of the Dolls in Mexico City.\n|LineColor=33DD77\n}}\n| Viewers =\n|ShortSummary= The team searches for ghostly phenomena at Mammoth Cave National Park.\n|LineColor=33DD77\n}}\n| Viewers =\n|ShortSummary= The team visits the site of the Kenneth Arnold UFO sighting.\n|LineColor=33DD77\n}}\n| Viewers =\n|ShortSummary= The Expedition X team heads up the Rio Negro river in the Amazon to investigate a haunted outpost.\n|LineColor=33DD77\n}}\n| Viewers =\n|ShortSummary= The team dives into Lake Lanier, the so-called \"world's most haunted lake.\"\n|LineColor=33DD77\n}}\n}}\nSeason 2 (2020)\n| Viewers =\n|ShortSummary= Phil and Jess investigate tales of curses and ghosts in Nevada City, Montana.\n|LineColor=77DD99\n}}\n| Viewers =\n|ShortSummary= The team examines reports of cattle mutilations in the Pacific Northwest.\n|LineColor=77DD99\n}}\n| Viewers =\n|ShortSummary= Phil and Jess delve into the legend of the Bell Witch in Tennessee.\n|LineColor=77DD99\n}}\n| Viewers =\n|ShortSummary= The team investigates the mystery of the Light of Saratoga in the Big Thicket of Texas.\n|LineColor=77DD99\n}}\n| Viewers =\n|ShortSummary= The X team heads to New Jersey to search for the Jersey Devil.\n|LineColor=77DD99\n}}\n| Viewers =\n|ShortSummary= The team dives into Lake Champlain looking for the legendary Champ.\n|LineColor=77DD99\n}}\n}}\nSeason 3 (2021)\n| Viewers =\n|ShortSummary= Josh joins Jess and Phil in the field as they search for the Beast of Bray Road.\n|LineColor=77DDDD\n}}\n| Viewers =\n|ShortSummary= Josh and the team continue their search for a legendary werewolf in rural Wisconsin.\n|LineColor=77DDDD\n}}\n| Viewers =\n|ShortSummary= Phil and Jess head to Socorro, New Mexico the site of the Lonnie Zamora incident.\n|LineColor=77DDDD\n}}\n| Viewers =\n|ShortSummary= The team investigates legends of hauntings on the Chesapeake and Ohio Canal.\n|LineColor=77DDDD\n}}\n| Viewers =\n|ShortSummary= Phil and Jess travel to Ape Canyon at Mount St. Helens in search of Bigfoot.\n|LineColor=77DDDD\n}}\n| Viewers =\n|ShortSummary= The Expedition X team dive into the waters off Catalina Island to investigate unidentified objects as seen in the Pentagon UFO videos.\n|LineColor=77DDDD\n}}\n| Viewers =\n|ShortSummary= The team are joined by Luis Elizondo as they continue to search the waters off Catalina, where they witness unexplained lights.\n|LineColor=77DDDD\n}}\n}}\nSeason 4 (2021)\n| Viewers =\n|ShortSummary= Hikers are going missing amid reports of grotesque, human-like creatures prowling Appalachia's great smoky mountains. Phil and Jess ventures into the unforgiving wilderness to investigate the truth behind terrifying sightings of feral people.\n|LineColor=55BBDD\n}}\n| Viewers =\n|ShortSummary=Horrified locals in southern Iowa are reporting sightings of a giant winged creature. The same mysterious beast that terrorized the town of Van Meter 100 years ago. Phil and Jess  are on a mission to unearth clues to what's lurking in the shadows.\n|LineColor=55BBDD\n}}\n| Viewers =\n|ShortSummary=Phil and Jess investigate the Kaokala UFO cult in Bangkok that claims to receive predictions of future natural disasters.\n|LineColor=55BBDD\n}}\n| Viewers =\n|ShortSummary=The team heads to Whitefish Point on Lake Superior's Shipwreck Coast to investigate reported ghost lights.\n|LineColor=55BBDD\n}}\n| Viewers =\n|ShortSummary=The team investigates reports of ghostly phenomena at the historic Fort Morgan in Alabama.\n|LineColor=55BBDD\n}}\n| Viewers =\n|ShortSummary=Jess and Phil continue their investigation at Fort Morgan joined by Amy Bruni and Adam Berry from Kindred Spirits.\n|LineColor=55BBDD\n}}\n}}\nSeason 5 (2022)\n| Viewers = N/A\n|ShortSummary= Jess and Phil investigate unidentified lights seen above the Mexican volcano Popocatépetl.\n|LineColor=349EE4\n}}\n| Viewers = N/A\n|ShortSummary= The team searches for the Ozark Howler, a legendary beast reportedly sighted in Arkansas.\n|LineColor=349EE4\n}}\n| Viewers = N/A\n|ShortSummary= The team investigates paranormal activity in the cenotes of the Yucatán Peninsula.\n|LineColor=349EE4\n}}\n| Viewers = N/A\n|ShortSummary= The team investigates a reported haunting at the site of the 1910 Wellington, Washington avalanche disaster that killed ninety-six people.\n|LineColor=349EE4\n}}\n| Viewers = N/A\n|ShortSummary= The team search whitewater rapids and Alaska's Iliamna Lake for a legendary beast that's now the target of serious scientific inquiry.\n|LineColor=349EE4\n}}\n| Viewers = N/A\n|ShortSummary= Deep in the Peruvian jungle, Phil tracks what could be an unknown species, while Jess hunts for evidence of a legendary creature known as Yacumama.\n|LineColor=349EE4\n}}\n| Viewers = N/A\n|ShortSummary= Phil and Jess travel to Andros, Bahamas to dive into its blue holes to find the creatures that may have inspired the mythical sea monster known as the Lusca.\n|LineColor=349EE4\n}}\n}}\nSeason 6 (2023)\n| Viewers = N/A\n|ShortSummary= Josh joins Jess and Phil in the field to hunt for evidence of ghosts at Eloise Psychiatric Hospital in Michigan.\n|LineColor=6600CC\n}}\n| Viewers = N/A\n|ShortSummary= Josh, Jess, and Phil conclude their investigation at Eloise.\n|LineColor=6600CC\n}}\n| Viewers = N/A\n|ShortSummary= Jess and Phil investigate stories of the Honey Island Swamp monster in the bayou near New Orleans.\n|LineColor=6600CC\n}}\n| Viewers = N/A\n|ShortSummary= Phil and Jess travel to Monterrey, Mexico to examine tales of brujas, practitioners of witchcraft.\n|LineColor=6600CC\n}}\n| Viewers = N/A\n|ShortSummary= Phil and Jess look for ghosts at Cerro Gordo, California the abandoned silver mining town owned by entrepreneur and social media personality Brent Underwood.\n|LineColor=6600CC\n}}\n| Viewers = N/A\n|ShortSummary= Phil and Jess investigate sites in Dublin and at the Hellfire Caves in West Wycombe for paranormal activity said to be connected to the historical Hellfire Club.\n|LineColor=6600CC\n}}\n| Viewers = N/A\n|ShortSummary= Phil and Jess visit the Uinta Basin in Utah, where witnesses have reported skin-walkers and UFOs.\n|LineColor=6600CC\n}}\n| Viewers = N/A\n|ShortSummary= The team continue their examination of Uinta Basin, focusing on the area's UFO sightings.\n|LineColor=6600CC\n}}\n}}\nSeason 7 (2024)\n| Viewers = N/A\n|ShortSummary= Jess and Phil explore the Hoia Baciu Forest in Romania, the site of Josh's most memorable paranormal experience which occurred during the production of a 2009 episode of Destination Truth (\"Haunted Forest/Alux\").\n|LineColor=8811BB\n}}\n| Viewers = N/A\n|ShortSummary= The team visits the forests of Alaska's Kenai Peninsula to investigate legends of an aggressive sasquatch.\n|LineColor=8811BB\n}}\n| Viewers = N/A\n|ShortSummary= The team arrives on Mackinac Island, Michigan after the summer tourist season to investigate reported paranormal activity at a hotel.\n|LineColor=8811BB\n}}\n| Viewers = N/A\n|ShortSummary= As the team continues to explore Mackinac, they are joined by paranormal investigators the Ghost Brothers (Dalen Spratt, Juwan Mass, and Marcus Harvey).\n|LineColor=8811BB\n}}\n| Viewers = N/A\n|ShortSummary= Phil and Jess search the caves of Okinawa, Japan following reports of hauntings tied to WWII deaths.\n|LineColor=8811BB\n}}\n| Viewers = N/A\n|ShortSummary= Jess and Phil head to the Peak District of England after recent sightings of British big cats.\n|LineColor=8811BB\n}}\n| Viewers = N/A\n|ShortSummary= The team looks into hauntings reported in the vicinity of Niagara Falls and learns about the history of deaths near the landmark.\n|LineColor=8811BB\n}}\n| Viewers = N/A\n|ShortSummary= Jess and Phil explore abandoned areas of Fukushima, Japan to investigate UFO sightings that followed the 2011 nuclear accident. The team witnesses unidentified objects above Senganmori mountain in Iino, a small town with a reputation as an extraterrestrial hotspot.\n|LineColor=8811BB\n}}\n}}\nSeason 8 (2024)\n| Viewers = N/A\n|ShortSummary= Josh joins Phil Torres and new co-host Heather Amaro in the field to investigate paranormal sightings at the Trans-Allegheny Lunatic Asylum in West Virginia.\n|LineColor=770011\n}}\n| Viewers = N/A\n|ShortSummary= Josh, Phil, and Heather continue their exploration of the reportedly haunted hospital.\n|LineColor=771111\n}}\n| Viewers = N/A\n|ShortSummary= In Scotland, Phil and Heather search for evidence of the Loch Ness Monster. Actor and cryptid enthusiast Rhys Darby makes an appearance to discuss the legendary beast.\n|LineColor=771111\n}}\n| Viewers = N/A\n|ShortSummary= Heather and Phil set up a ghost investigation at the Sorrel–Weed House, which is claimed to be one of the most haunted locations in Savannah, Georgia.\n|LineColor=771111\n}}\n| Viewers = N/A\n|ShortSummary= Heather and Phil continue exploring areas in and near Savannah including The Savannah Theatre and Ebenezer Creek, the location of a Civil War tragedy.\n|LineColor=771111\n}}\n| Viewers = N/A\n|ShortSummary= Heather and Phil head into the swamps of Florida to investigate the legendary skunk ape.\n|LineColor=771111\n}}\n| Viewers = N/A\n|ShortSummary= Phil and Heather set up a paranormal investigation at Chillingham Castle, a location with a dark history of violence that is claimed to be one of the most haunted castles in England .\n|LineColor=771111\n}}\n| Viewers = N/A\n|ShortSummary= Phil and Heather look into claims that the Michigan Dogman could be linked to a military conspiracy.\n|LineColor=771111\n}}\n}}\nSeason 9 (2025)\n| Viewers = N/A\n|ShortSummary= Josh sends Phil and Heather to investigate paranormal claims of hostile ghosts linked to past murders at Chateau de Veauce, the most haunted chateau in France.\n|LineColor=FFD700\n}}\n| Viewers = N/A\n|ShortSummary= Phil and Heather travel to Fouke, Arkansas to investigate reports of the Fouke Monster which has been terrorising residents for over a century.\n|LineColor=FFD700\n}}\n| Viewers = N/A\n|ShortSummary= In the Czech Republic, Phil and Heather investigate Houska Castle, reportedly the site of Nazi occult experiments.\n|LineColor=FFD700\n}}\n| Viewers = N/A\n|ShortSummary= Phil and Heather move their investigation of Nazi occult history into Poland, where they visit Książ Castle and the tunnels of Project Riese.\n|LineColor=FFD700\n}}\n| Viewers = N/A\n|ShortSummary= In France, the team explores the history of the Beast of Gévaudan and modern reports of an unknown beast or werewolf.\n|LineColor=FFD700\n}}\n| Viewers = N/A\n|ShortSummary= In Belize, Heather and Phil conduct a paranormal investigation in the ancient Mayan ruins of Xunantunich.\n|LineColor=FFD700\n}}\n| Viewers = N/A\n|ShortSummary= Heather and Phil continue their travels in Belize, entering a cave system associated with Xibalba, the Mayan underworld.\n|LineColor=FFD700\n}}\n| Viewers = N/A\n|ShortSummary= Heather and Phil search for sasquatches in Kentucky.\n|LineColor=FFD700\n}}\n| Viewers = N/A\n|ShortSummary= Heather and Phil investigate paranormal reports at Brushy Mountain State Penitentiary in Tennessee.\n|LineColor=FFD700\n}}\n}}\nSeason 10 (2025)\n| Viewers = N/A\n|ShortSummary= While Phil is on paternity leave, Josh joins Heather at Spike Island, County Cork in Ireland. They conduct a paranormal investigation in the cells of the reportedly haunted former prison.\n|LineColor=CCEE99\n}}\n| Viewers = N/A\n|ShortSummary= Heather and Josh conclude their investigation at the fort and the nearby abandoned village on Spike Island.\n|LineColor=CCEE99\n}}\n| Viewers = N/A\n|ShortSummary=\n|LineColor=CCEE99\n}}\n| Viewers = N/A\n|ShortSummary=\n|LineColor=CCEE99\n}}\n| Viewers = N/A\n|ShortSummary=\n|LineColor=CCEE99\n}}\n| Viewers = N/A\n|ShortSummary=\n|LineColor=CCEE99\n}}\n| Viewers = N/A\n|ShortSummary=\n|LineColor=CCEE99\n}}\n| Viewers = N/A\n|ShortSummary=\n|LineColor=CCEE99\n}}\n| Viewers = N/A\n|ShortSummary=\n|LineColor=CCEE99\n}}\n| Viewers = N/A\n|ShortSummary=\n|LineColor=CCEE99\n}}\n}}\nShark Week specials\nExpedition X aired a special episode during Discovery's Shark Week 2025.\n| Viewers = N/A\n|ShortSummary= Hundreds of miles off the coast of Columbia, Phil and Heather join a scientific team trying to locate and tag El Monstruo, a huge shark seen in the waters off Malpelo Island, home to unique shark populations.\n|LineColor=#119EF6\n}}\n}}\nExpedition Files\nExpedition Files is a documentary television series and spin-off of Expedition Unknown that debuted on Discovery Channel with a preview episode on October 30, 2024, followed by the remainder of the first season beginning on November 27. The series is hosted by Josh Gates from a virtual set, where he narrates re-enactments of unusual historical events, unsolved mysteries, and paranormal phenomena. The second season premiered on April 16, 2025.\nSeason 1 (2024-2025)\n| Viewers =\n|ShortSummary=\n|LineColor=206161\n}}\n| Viewers =\n|ShortSummary=\n|LineColor=206161\n}}\n| Viewers =\n|ShortSummary=\n|LineColor=206161\n}}\n| Viewers =\n|ShortSummary=\n|LineColor=206161\n}}\n| Viewers =\n|ShortSummary= Stories involving encoded messages: the Zodiac Killer, the Fenn treasure, and the Voynich manuscript\n|LineColor=206161\n}}\n| Viewers =\n|ShortSummary=\n|LineColor=206161\n}}\n}}\nSeason 2 (2025)\n| Viewers =\n|ShortSummary=\n|LineColor=444477\n}}\n| Viewers =\n|ShortSummary=\n|LineColor=444477\n}}\n| Viewers =\n|ShortSummary= Tales of conspiracies surrounding deaths: the serial killer H. H. Holmes, Grand Duchess Anastasia Nikolaevna of Russia, the disappearances of congressmen Hale Boggs and Nick Begich Sr.\n|LineColor=444477\n}}\n| Viewers =\n|ShortSummary= Josh presents stories of Billy the Kid's rumored survival, the alien abduction story of Betty and Barney Hill, the identity of the Man in the Iron Mask.\n|LineColor=444477\n}}\n| Viewers =\n|ShortSummary= Three mysteries and their potential explanations: The Amityville Horror, spontaneous human combustion, the sinking of the H. L. Hunley\n|LineColor=444477\n}}\n| Viewers =\n|ShortSummary= Stories of missing people and things: D. B. Cooper, Michael Rockefeller, and James Dean's purportedly cursed Porsche 550 Spyder.\n|LineColor=444477\n}}\n}}\nSeason 3 (2025)\n| Viewers =\n|ShortSummary= Josh presents stories on the disappearance of Jimmy Hoffa, the search for the Holy Grail, and the suspicious death of Rudolf Diesel.\n|LineColor=701C47\n}}\n| Viewers =\n|ShortSummary= Josh presents new theories that could explain the Salem witch trials, the Rendlesham Forest incident, and the death of Grigori Rasputin.\n|LineColor=701C47\n}}\n| Viewers =\n|ShortSummary= Three historical mysteries: the Somerton Man, whether the myths of Troy have basis in fact, and the Shakespeare authorship question\n|LineColor=701C47\n}}\n}}\nSpecials\nA special episode aired as part of Discovery Channel's Shark Week in 2025. This special also appears under the title \"Expedition Files: Blood in the Water\".\n| Viewers =\n|ShortSummary= Josh presents stories of the Jersey Shore shark attacks of 1916, the 1852 sinking of the HMS Birkenhead, and the Sydney Shark Arm case of 1935.\n|LineColor=555555\n}}\n}}\nReferences\nExternal links\n*Travel Channel:\n*Discovery Channel:\n*\n*"
    }
  ]
}