{
  "content": [
    {
      "type": "text",
      "text": "# Expedition of Muhammad ibn Maslamah\n\n*10 tribe members killed, 1 prisoner captured\n*150 camels and 3000 goats captured as booty\n|commander1    = Muhammad ibn Maslamah\n|commander2    = Thumamah ibn Uthal\n|strength1     = 30\n|strength2     = Unknown\n|casualties1   = 0 killed\n|casualties2   =10 killedThumamah ibn Uthal captured\n}}\nThe Expedition of Muhammad ibn Maslamah took place in July, 627 AD in Muharram, 6AH.\nExpedition\nA platoon of thirty Muslims under the leadership of Muhammad bin Maslamah was despatched on a military mission. They headed for the habitation of the sept of Banu Bakr. The Muslims attacked the sept and dispersed them in all directions. The Muslims captured war booty and returned with the chief of the tribe of Banu Hanifa, called Thumamah bin Uthal Al-Hanafi.\nMuhammad's Companions tied him to a pole of a Mosque. To a question posed by Muhammad, Thumamah used to say: \"If you were to kill someone, then you would have to choose one of noble descent, if you were to be gracious, then let it be to a grateful man and if you were to ask for money, you would have to ask for it from a generous man.\" He repeated that three times on three different occasions. On the third time, the Muhammad ordered that he should be released and later he converted to Islam.\nDuring this raid the Muslims killed ten people while others fled offering no resistance. The Muslims captured 150 camels and 3000 goats as booty\nIslamic sources\nBiographical literature\nThis event is mentioned in the works of the Muslim Jurist Tabari. The Muslim jurist Ibn Qayyim Al-Jawziyya also mentions the event in his biography of Muhammad, Zad al-Ma'ad. Modern secondary sources which mention this, include the award winning book, Ar-Raheeq Al-Makhtum (The Sealed Nectar). The event is also mentioned by the Muslim jurist Ibn Qayyim Al-Jawziyya in his biography of Muhammad, Zad al-Ma'ad.\nThe event is also mentioned by the Muslim scholar Ibn Sa'd in his book about Muhammad's military campaigns., he wrote about the expedition:\nHadith literature\nIn this expedition, the chief of the Banu Hanifa tribe was captured, he was called Thumamah bin Uthal Al-Hanafi. The Sahih Muslim hadith collection also mentions this:\n}}\nalso mentions this.\nSee also\n*Military career of Muhammad\n*List of expeditions of Muhammad\n*Muslim–Quraysh War\nNotes"
    }
  ]
}