{
  "content": [
    {
      "type": "text",
      "text": "# Expedition to Mostaganem (1558)\n\n| map_caption = Location of the Expedition of Mostaganem in Algeria.\n| map_size    = 300\n| map_label   = Expedition of Mostaganem\n| date        = August–September 1558\n| place       = Mostaganem, Ottoman Algeria\n| result      = Algerian victory\n| combatant1  =\n| combatant2  =  Regency of Algiers   Kingdom of Beni Abbas\n| commander1  =  Count Alcaudete\n| commander2  =  Hasan Pasha  Abdelaziz El Abbes\n| strength1   = 12,000+ soldiers\n| strength2   = Unknown\n| casualties1 = 6,000 killed6,000 prisoners\n| casualties2 = Unknown\n| campaignbox       =\n}}\nThe Expedition of Mostaganem occurred in 1558, when Spanish forces attempted to capture the city of Mostaganem. The expedition was supposed to be a decisive step in the conquest of the Ottoman base of Algiers, but it ended in failure, and has been called a \"disaster\".\nBackground\nThe harbour of Mostaganem had been taken by the Spanish from the Muslims in 1506. The harbour became part of numerous Spanish possessions on the coast of the Maghreb, which had been captured since 1496:\n* Melilla (1496),\n* Mers-el-Kebir (1505),\n* Oran (1509),\n* Bougie (1510),\n* Tripoli (1510),\n* Algiers,\n* Shershell,\n* Dellys,\n* Ténès.\nIn 1516, Mostaganem was seized by Hayreddin Barbarossa from his base of Algiers. He then strengthened its defences, and the city became a rival of Oran. From 1519, Barbarossa placed himself under the protection of the Ottomans, thereby transforming Mostaganem into an Ottoman dominion.\nPrevious Spanish expeditions had taken place in 1543 and 1547, which failed as the Spanish forces were repulsed and then pursued in retreat by Turkish and tribal forces.\nThe expedition of 1558 to retake Mostaganem from the Ottomans followed a string of Ottoman successes in the Mediterranean, especially with the Siege of Tripoli in 1551, and the evacuation of Al-Mahdiyeh by the Spaniards. Concurrently, the corsairs of Barbary were operating from their base in Algiers.\nPreparations\nThe Count of Alcaudete made preparations in Spain to recruit sufficient troops for his expedition. He recruited many soldiers from the Spanish nobility. He was at the head of an army of 10 to 11,000 men partly inexperienced (he had received authorization to recruit 8,000) to which are added the 1,200 experienced soldiers from the place of Oran and artillery, some field and siege guns. 6,000 men gathered in Cartagena under the orders of the Count and 5,000 men under the orders of one of his sons, Don Martin, embarked from Malaga.\nAt the same time Hassan Pasha returned from an indecisive campaign in Fez in March–April 1558 when he learned of the preparations for a Spanish raid from Oran.\nTo counter the Spaniards, Hassan Pasha's army then consisted of 15,000 men: 5,000 Turks and renegades, 1,000 spahis to which were added 6,000 cavalry, and 10,000 Arab infantry and according to B. de Moralès 8,000 seasoned soldiers, many Moorish infantry and 10,000 cavalry.\nBattle\nOn August 24 at 10 a.m., the Spaniards arrived under the walls of Mostaganem. Moorish and Turkish guards came out to push them back but they were beaten by the vanguard and fled, leaving the city gates open. A sergeant then launched the assault which was stopped dead on the orders of Martín Alonso Fernández who stubbornly undertook a regular siege. This strategy appeared to be risky, the city could have been taken but against all odds Alcaudete had this sergeant arrested and punished for his bravery. When all the troops were gathered, a camp was set up on the heights out of reach of the defenders and the defense was prepared by digging a ditch and installing a field battery while the armies of Tlemcen and Algiers converged on a forced march towards the Spanish position.\nOn August 25 at noon, the arrival of the beylerbey of Algiers near Mostaganem was announced. Alcaudete sent his son to make sure of the situation. In the evening, the Spanish troops weighed a surprise attack from the beylerbey camp allowing the troops to refuel but nothing was decided. The count wanted to wait firmly for the troops of the regency and confront them on the spot. However, while Alcaudete was still waiting for the necessary ammunition and supplies by sea which were carried by a ship and four brigantines with 600 men on board were armed but the ship having turned around, the four brigantines were attacked and taken by five Turkish galleys. Without food or ammunition, Alcaudete understood that he could neither stand up to the troops of the Regency of Algiers, nor sustain the siege against Mostaganem. The situation was perilous. Facing the troops of Hassan Pasha and surrounded by a population of hostile Moors, Alcaudete made the decision to retreat during the night and withdrew his exhausted troops.\nOn August 26, Don Martin, son of Alcaudete, at the head of the rear guard, tried to cover the retreat of the troops in vain. He was wounded and put out of action by an arquebus shot. The captains themselves fled, which increased the disorder. The vanguard reached Mazagran and took refuge in the village. Alcaudete had the artillery on the enclosure and with his old, more experienced soldiers from Oran, they then covered the retreat of the troops.\nAlcaudete fought with small groups of 100, 200 or 500 men. Around 3 p.m., another terrible event struck the Spaniards; the fire blew up barrels of gunpowder and killed several hundred men, including Army Major-General Navarrete. The soldiers outside the entrenchments converged there, which provoked a movement of the crowd. It was at this moment that Count Alcaudete perished.\nThe morale of the Spaniards was at its lowest because of intense fighting since the morning, hunger and thirst weighed on the troops. Hassan Pasha finally captured the son Don Martin as well as most of the survivors. At sunset, the army decides to surrender.\nConsequences\nThe Spanish army suffered a crushing defeat, and around 12,000 Spanish soldiers were taken prisoner. Count Alcaudete, Governor of Oran, died in the expedition. His son Don Martín de Córdoba, the future Governor of Oran, was also captured and was imprisoned as a Christian slave in Algiers under the beylerbey Hasan Pasha, until he was exchanged for a huge ransom of 23,000 escudos.\nThis battle put an end to the governorship of Oran by count Martín Alonso Fernández, and definitively closed a period when Spain intervened in the Oranian region's affairs. This episode, described as a disaster,  saw the Spanish lose their most capable generals in Africa, it also marked the end of Spanish territorial claims on western Algeria, corresponding to the former domain of the Zayyanid sultans of Tlemcen. Mansur b. Bûghânim, a Zayyanid caïd who had joined the Spaniards, and was involved in all the struggles to restore the Zayyanid dynasty, changed sides after the battle of Mostaganem and joined the Ottomans. The Spaniards therefore renounced major land expeditions in western Algeria and concentrated on maintaining their positions in Oran and Mers el-Kébir. Henceforth the whole coast escaped their grasp; the ports of Bône, Béjaïa, Cherchell, Ténès and Mostaganem served as bases for the Ottoman Algerian navy.\nThe failure of the expedition of Mostaganem also ended attempts for an alliance between Spain and Morocco against the common Ottoman enemy.\nIn popular culture\nThe battle of Mostaganem was celebrated in Algerian popular songs through the works of the saint and poet Sidi Lakhdar ben Khlouf. He joined the army of  Hassan Pasha in Mazagran to fight the Spaniards, which inspired him to write epic poems. He wrote two long poems in which he recounted with precision the high deeds of the battles waged against the Spanish conquerors, the first of which was called \"Cherchell\", this one recounts the poet's combat journey between Algiers, Mostaganem and Mazagran via Blida, and the second and most famous was called \"Mazagran\" in which the poet recounts the battles of [azavran, Algeria|Mazagran]] in 1558 and\nMostaganem and the epic he devotes to the battle of Mazagran of August 26, 1558 against the Spaniards.\nSee also\n*Expedition to Mostaganem (1543)\n*Expedition to Mostaganem (1547)\nNotes\nSources\n*\n*\n*\n*"
    }
  ]
}