{
  "content": [
    {
      "type": "text",
      "text": "# Explant culture\n\nIn biology, explant culture is a technique to organotypically culture cells from a piece or pieces of tissue or organ removed from a plant or animal. The term explant can be applied to samples obtained from any part of the organism. The extraction process is extensively sterilized, and the culture can be typically used for two to three weeks.\nThe major advantage of explant culture is the maintenance of near in vivo environment in the laboratory for a short duration of time. This experimental setup allows investigators to perform experiments and easily visualize the impact of tests.\nThis ex vivo model requires a highly maintained environment in order to recreate original cellular conditions. The composition of extracellular matrix, for example, must be precisely similar to that of in vivo conditions in order to induce naturally observed behaviors of cells. The growth medium also must be considered, as different solutions may be needed for different experiments.\nThe tissue must be placed and harvested in an aseptic environment such as sterile laminar flow tissue culture hood. The samples are often minced, and the pieces are placed in a cell culture dish containing growth media. Over time, progenitor cells migrate out of the tissue onto the surface of the dish. These primary cells can then be further expanded and transferred into fresh dishes through micropropagation.\nExplant culture can also refer to the culturing of the tissue pieces themselves, where cells are left in their surrounding extracellular matrix to more accurately mimic the in vivo environment e.g. cartilage explant culture, or blastocyst implant culture.\nApplication\nHistorically, explant culture has been used in several areas of biological research. Organogenesis and morphogenesis in fetus have been studied with explant cultures. Since the explant culture is grown in the lab, the area or cells of interest can be labeled with fluorescent markers. These transgenic labels can help researchers observe growth of specific cells. For example, neural tissue development and central nervous system regeneration have been studied with organotypic explant culture.\nThe role of a specific gene, gene expression, and the mechanism of action all can be studied with explant culture as well. Certain factors that control or contribute to growth could be identified during different stages of embryogenesis. Looking at the expression pattern would allow tracking of where the gene transcripts have been. How much gene has been expressed could be quantified too.\nCoupling with stem cell research, researchers have successfully grown simple organs derived from autologous human pluripotent stem cells. So far bladder and trachea have been developed. This method attempts to address tissue rejection, and there are already cases of successful transplantation. A research team from Wake Forest Institute for Regenerative Medicine in Winston-Salem, North Carolina, successfully transplanted stem cell-engineered bladders to seven pediatric patients with malfunctioning bladders. Another case was from a team at University College, London, UK, which transplanted a wind pipe derived from the patient's own stem cells.\nEven with all the advantages to explant culture, there still are several caveats. The downside of explant culture is that it does not provide sufficient time to study chronic diseases. Although two to three weeks may be enough time to study acute changes, it is not fit for experiments requiring long-term observations.\nCurrent research\nRetina\nMany neurobiological processes have been studied with retinal explant cultures. Understanding retina's development has led the way for researchers to study pathological neurodegeneration and related retinal diseases more closely. Cellular grafts derived from retinal stem cell therapy is an active area of research to treat macular degeneration, retinitis, pigmentosa, and glaucoma.\nReferences"
    }
  ]
}