{
  "content": [
    {
      "type": "text",
      "text": "# Explorations Volume 2: Survival, Growth & Re-birth\n\n| length     =\n| label      = World Pacific\n| producer   = Richard Bock\n| prev_title = Explorations: Reflections\n| prev_year  = 1960\n| next_title =\n| next_year  =\n}}\nExplorations Volume 2: Survival, Growth & Re-birth (commonly known simply as Re-birth) is a three-LP box-set by the English writer and philosopher Gerald Heard. It was released on World Pacific Records in 1961 (see 1961 in music). The box-set includes lectures by Heard and music co-written with Jay Michael Barrie. Conceptually, Re-birth is often considered one of, the first, if not the first, psychedelic albums, for both the topics discussed, and the crude arrangements recorded by classically trained musicians.\nIn 1942, Gerald Heard, along with his contemporary Aldous Huxley, founded the spiritual retreat known as Trabuco College, where together they taught a philosophy that combined aspects of mysticism, Buddhism, Hinduism, and the use of psychedelic drugs to, in theory, extract the extraordinary potential that lay untapped by most humans (later known as the Human Potential Movement). Remaining active in the 1950s as a writer and lecturer, Heard continued his teachings on the evolution of higher consciousness, spiritual enlightenment, and meditation. In the latter half of the decade, Heard recorded five spoken-word albums largely based on his lectures. Heard had one additional recording project, an interpretation of the Nyingma text found in the Tibetan Book of the Dead, which he attempted to interest Huxley and composer Igor Stravinsky in joining.\nNeither of the two were seriously interested, although Huxley did incorporate certain aspects of the book in his last novel, Island. Undeterred, Heard wrote the script for Re-birth during a three-month stay in Hawaii in late 1960, and commenced recording for the album in early 1961. Analyzing the content of Re-birth, scholar John V. Cody noted \"He (Heard) believed that the psychedelics potentially could be employed as sacramental 'medicaments' to could be used in traversing all the major life-cycle transitions. He envisioned them as catalystic agents in a life-long therapy of growth through the major life-stages, not only as a tool for liberation from the fear of death, etc.\". Although the drug is not explicitly mentioned, it is hypothesized that the album's extensive lecturing on proper psychophysical rituals inspired Huxley to take LSD as he laid on his deathbed.\nThe occasional musical portions of Re-birth features crudely recorded pipe organ instrumentals, while classically trained vocalists William Sutherland and Jay Michael Barrie offer advice to a \"nobly born\" listener undergoing a psychophysical ritual. It takes a dramatically unexpected shift as the two utter unusual shrieks and moans reminiscent of the later work by the Mothers of Invention.\nRe-birth is the final recording Heard, who died in 1971, produced in his lifetime. In 1976, World Pacific Records reissued the album on cassette.\nAlbums\n* Disc one - Survival\n* Disc two - Growth\n* Disc three - Re-birth\nReferences"
    }
  ]
}