{
  "content": [
    {
      "type": "text",
      "text": "# Explorers' Monument (Western Australia)\n\nThe Maitland Brown Memorial, also known as '''Explorers' Monument''', is a monument located in Esplanade Park in Fremantle, Western Australia. Unveiled on 8 February 1913, it is approximately  high, and consists of a head and shoulders statue of Maitland Brown sitting on granite pedestals on a granite base inset with five plaques, one depicting three explorers, Frederick Panter, James Harding and William Goldwyer. Brown died on 8 July 1905,  years prior to the unveiling of the monument, and Panter, Harding and Goldwyer  years prior on 13 November 1864. The monument was commissioned by George Julius Brockman who is depicted by one of the five plaques, and the statue of Brown was sculpted by Pietro Porcelli. Because the monument as originally erected is biased, such as by celebrating colonists \"as intrepid pioneers\" in contrast to Aboriginal people that \"are condemned as treacherous natives\", an additional plaque was added on 9 April 1994 that left the original offensive and biased aspects in place.\nHistory\nPanter, Harding and Goldwyer were killed by Aboriginal people while exploring in the Kimberley region of Western Australia.  When the men failed to return, Brown was commissioned to lead the La Grange expedition, which searched for the whereabouts of the missing men. Brown's party found the men speared to death, two of them evidently in their sleep. Shortly afterwards, between six and twenty Aboriginal persons were killedhighly controversially even at the timeby Brown's party and reported by Brown as a battle brought on by an Aboriginal ambush, but which has often since been characterised as a punitive massacre of Aboriginal people by white settlers. Indeed, the monument itself has plainly called the group of people that conducted the expedition and that it memorialises the \"punitive party\" for the past  years.\nOne of the original plaques on the pedestal reads as follows:\nBrockman as a fellow bush wanderer's tribute to the memory of Panter, Harding and Goldwyer. Earliest explorers after Grey and Gregory of this \"\" [this \"unknown land\"], attacked at night by treacherous natives, were murdered at Boole Boola near Le Grange Bay on 13 November 1864. Also as an appreciative token of remembrance of Maitland Brown, one of the pioneer pastoralists and premier politicians of this state, intrepid leader of the government search and punitive party. His remains together with the sad relics of the ill fated three recovered at great risk and danger from the lone wilds repose under a public monument in the East Perth Cemetery \"lest we forget.\"}}\nAdditional plaque\nIt has long been held that the monument is a racist work that presentedand continues to presenta biased interpretation of the events at La Grange because, for example, it celebrates the colonists \"as intrepid pioneers\" in contrast to the Aboriginal people that \"are condemned as treacherous natives\". In 1994, an attempt was made to redress this by placing an additional plaque on the monument.\n}}\nFurther reading\n*\n*\n*\n*\n*\n|display=title |format=dec}}"
    }
  ]
}