{
  "content": [
    {
      "type": "text",
      "text": "# Extemporaneous speaking__disambig_1\n\n}}\nExtemporaneous speaking (extemp, or EXT) is a speech delivery style/speaking style, and a style used in specific forensic competitions. The competitive speech event is based on research and original analysis, done with a limited-preparation; in the United States those competitions are held for high school and college students. In an extemporaneous speech competition, enrolled participants prepare for thirty minutes on a question related to current events and then give a seven-minute speech responding to that question. The extemporaneous speaking delivery style, referred to as \"off-the-cuff\", is a type of delivery method for a public presentation, that was carefully prepared and practiced but not memorized.\nExtemporaneous speech is considered to have elements of two other types of speeches, the manuscript (written text that can be read or memorized) and the impromptu (making remarks with little to no preparation). When searching for \"extemporaneous\", the person will find that \"impromptu\" is a synonym for \"extemporaneous\". However, for speech delivery styles, this is not the case. An extemporaneous speech is planned and practiced, but when delivered, is not read. Presenters will normally rely on small notes or outlines with key points. This type of delivery style is recommended because audiences perceive it as more conversational, natural, and spontaneous, and it will be delivered in a slightly different manner each time, because it's not memorized.\nStrategies for extemporaneous speaking\nSpeakers may find it challenging to deliver a speech using extemporaneous speech style in order to make the delivery organized, conversational, and responsive to the audience and context. An extemporaneous delivery will require that the speaker use a limited number of notes, and avoid a read or memorized presentation; instead, the speaker should practice and rehearse as many times as needed to become familiar with the subject and deliver the content using their own words and a conversational style. A conversational style is engaging for the audience, while the organization allows for greater understanding of the topic. The first couple of times the speech is rehearsed, speakers may stumble and forget words or what order to follow. Because of this, it is recommended that speakers practice multiple times well in advance of the speech event. Practice should be realistic, replicating the speaking event as closely as possible (using presentation aids and technology, including an audience, the size of the room, mic, etc.). As such, it is imperative that speakers practice with their speaker notes, allowing for familiarity and adjustments to be made so they are useful at a glance. Therefore, practicing the speech out loud is better than silently because it will help master the content being presented.\nKnowing how to create an outline for an extemporaneous speech helps speakers remember the order that should be followed, a word that the speaker might find it difficult to pronounce or main topics of the speech. An outline used for an extemporaneous speech can be called a \"working outline\" and it consists of three main sections, the introduction, body, and conclusion. Transitions should also be used and are a good way to go from the introduction to the body and from one main point to the other; it helps the speaker keep on track and listeners to follow along.\nExtemporaneous speakers are recommended to follow an organization pattern. In the introduction, the speaker should gain the audience attention, establish credibility, state the relevancy of the topic to the audience, and clearly state the thesis and main points. In the body, the speaker should have the main points of the presentation (that were already stated in the introduction) and the supporting material (or evidence for persuasive speeches) for each main point, such as facts, statistics, examples, etc. Writing down authors' names, qualifications, where the article was found, and date might be very useful in order to share the correct information with the audience. The same techniques should be used to outline the conclusion; end on a strong note, cause impact between the audience, and make it clear what the listeners should take away from the presentation. In order to achieve all of the strategies listed above, speakers can opt to have a simpler outline, just with topics and subtopics or a more detailed outline with complete sentences and notes that they find it difficult to remember; speakers will learn what work best for them, but is important to remember, the outline should never be read and instead it should only be used for reference.\nThere are verbal and nonverbal actions that can be used when delivering a speech, in any style, that will make an audience perceive the speech more favorably. Keeping eye contact will make the audience give credence to what the speaker is sharing, and it will show confidence and knowledge on the topic being presented. The speaker's pronunciation, diction and articulation of words will make the audience believe on what is being said, especially words in the field of the presentation, it will show that the speaker knows what they are talking about. In addition, speakers should also stand up, move, and use gestures because it will convey vitality, energy and naturality.\nIn order to be successful, speakers should try to pace themselves; when talking too fast, the audience might not understand everything being shared, but talking too slow might make the audience lose interest. The tone should also vary, loudness and pitch. A monotone presentation is going to be perceived as boring. Asking for feedback from friends and family before the real presentation might be useful to get an outsider's opinion on how the speaker is doing and things to improve; some speakers might find value in recording their practice speeches for self-critique.\nFormat of the event\nStructure of a speech\nA successful Extemporaneous Speech begins with an introduction that catches the listener's attention, introduces the theme, and answers the question through two to three areas of analysis. This is followed by a conclusion, which summarizes the speech and may have an impact upon the audience.\nThe introduction is usually structured as a 1-minute, 30-second section, grabbing the attention of the audience, utilizing background information (including sources) to build credibility, and finishing with a statement of significance (stating why the topic is important). After that, competitors conclude their introduction by going into a basic overview of the structure of the speech, including the question, an umbrella answer (sometimes called a thesis), and a preview of the areas of analysis.\nAn individual point in Extemporaneous Speaking is typically structured like a basic paragraph, with a claim, warrant, and impact that collectively take up 1 minutes and 30 seconds. Each point usually incorporates two to three sources to build credibility and provide information for analysis, and a mix of both broad argumentation and specific examples. Finally, the end of a point usually links back to the speaker's answer to the question, which functions as an impact. Some schools of thought argue that the impact of a point should link to a scenario outside of the scope of the question, but most competitive circuits in high school and collegiate competition value a link back to the answer to the question instead.\nThe conclusion, which lasts for between 30 seconds and 1 minute follows the basic format of the introduction, but backwards, starting with the speaker restating the question, answer, and review of the three points. Finally, the speech finishes with a \"clincher\"—a rhetorical tool that leaves an audience with something to think about.\nDelivery\noften used in an extemporaneous speech]]During a speech, the Speaker's triangle\" is fairly common. In it, a competitor stands in the middle of the stage for the introduction, walks to the left for their first point, moves back to the middle for their second point, walks to the right for their third point, and walks to the middle (and sometimes forward) for their conclusion.\nIn addition using body language such as posture and hand movements is an important part of the event and many judges consider nonverbal communication as well as the structure of the speech.\nExtemporaneous Speaking sometimes allows for the use of index cards, but many competitors forgo their usage as they hinder effective delivery, and most leagues do not allow them outside of novice competitions.\nPreparation\nIn preparing an Extemporaneous Speech, competitors consult with a variety of sources and attempt to make an outline for their speech. Before personal computers, teams would bring packets of sources with them around the country but now most competitors elect to store their sources on a laptop computer. However, even after the invention of the internet, its use was prohibited until fairly recently when many competitions started to allow it over the COVID-19 pandemic.\nTypes of extemp\nSome tournaments both offer Domestic (The United States) and International Extemp, focusing on issues in the United States and around the world respectively. However, some tournaments, such as the Tournaments of Champions, will choose one, since nationally competitive students are prepared for both.\nCompetition\nDuring the speech, competitors are evaluated by way of comparison to the other speakers in a \"round\" of competition. Generally, there are five to seven competitors in a given round. Judges rank all students in a room in order, with the first rank being the best and the worst speaker ranked last (sixth, for example in a round of six competitors).\nIn High School competition, the National Speech and Debate Association (NSDA), and the National Catholic Forensic League (CFL) govern most of the Extemp tournaments. However most tournaments are held by independent schools. Both leagues have a national tournament at the end of every year, with the NSDA tournament drawing a larger number of competitors. There is also the Extemporaneous Speaking Tournament of Champions, held each May at Northwestern University, the National Individual Events Tournament of Champions, and the Tournament of Champions at the University of Kentucky. In addition, there are highly prestigious national \"circuit\" tournaments. These include the Glenbrooks Tournament in Chicago, the Yale Invitational at Yale University, the Barkley Forum at Emory University, the Berkeley Tournament in University of California, Berkeley, and the Harvard Invitational at Harvard University. There is also a major round-robin, which has the prestige of a championship tournament, held at Montgomery Bell Academy (MBA).\nIn collegiate competition, a myriad of organizations provide national competition in Extemporaneous Speaking. The American Forensic Association (AFA) and the National Forensic Association(NFA) are organizations responsible for Extemporaneous speaking at the four year level, with Phi Rho Pi serving the two year, community college level. Other organizations that offer Extemporaneous Speaking competition include Pi Kappa Delta, Delta Sigma Rho-Tau Kappa Alpha, and the International Forensic Association. Collegiate competition is almost identical to High School competition, with most tournaments hosted by universities. The AFA hosts a National Individual Events Tournament (NIET), usually in April. The NFA hosts a separate tournament with easier qualification requirements known as NFA Nationals. Additionally, collegiate competition consists of dozens of tournaments across the country, like the Norton Invitational, hosted by Bradley University, and the Hell Froze Over swing tournament.\nMost competition is held in the United States however countries around the world have Extemp tournaments.\nRankings\nRankings for High School Extemporaneous Speaking are officially maintained by National Speech & Debate Association (NSDA), and two community-run organizations: Extemp Central and The Extemper's Bible\nNational champions\nIn American High School Extemporaneous Speaking, the Montgomery Bell Academy Round Robin, Tournament of Champions, Extemp Tournament of Champions, National Individual Events Tournament of Champions, National Catholic Forensic League (NCFL) Grand National Championship, NSDA National Championship in United States Extemp, and NSDA National Championship in International Extemp are all considered to be national championships or of equivalent level.\nThe collegiate circuit features two national tournaments through two governing bodies: the American Forensics Association (AFA), and the National Forensics Association (NFA).\nDifferent organizations track and rank competitors based on the aforementioned national championships and circuit tournaments throughout the season. These different \"races,\" the NSDA Points Race in Extemp, Extemper's Bible National Points Race, and Extemp Central National Points Race, rank and track competitors throughout the season, before crowning a champion at the end of the season.\n2024-2025\nIn the 2024–2025 season, Waleed Haider (Hendrickson High School, Texas) won the Montgomery Bell Academy Round Robin.  Charlotte Reitman (NSU University School, Florida) defended her Tournament of Champions title.  Daphne Kalir-Starr (The College Preparatory School, California) won the Extemp TOC at Northwestern University.  Anwen Williams (Lawrence Free State High School, Kansas) won the NIETOC.  Nicholas Zylstra (Eastview High School, Minnesota) won NCFL Grand Nationals.  At the NSDA National Tournament, Anthony Babu (Concord-Carlisle High School, Massachusetts) defended his title in International Extemp and won the final round.  In United States Extemp, Robert Zhang (Elkins High School, Texas) won the national championship and the final round.  The Extemp Central National Points crowned Zhang was its champion.  Kalir-Starr was second and Haider was third.\nOn the collegiate circuit, Gursimrat Dahry (University of Minnesota, Twin Cities), won the American Forensics Association's national tournament and the National Forensics Association's national tournament.\n2023-2024\nIn the 2023–2024 season, April Zhang (Neuqua Valley High School, Illinois) won the Montgomery Bell Academy Round Robin. Charlotte Reitman (NSU University School, Florida) won the Tournament of Champions. Sasha Morel (Plano West High School, Texas) won the Extemp TOC at Northwestern University. Robert Zhang (Elkins High School, Texas) won the NIETOC, and Amy Cao (Ridge High School, New Jersey) won the NCFL Grand Nationals. Tea Shouldice (Half Hollow Hills High School East, New York) won the NSDA National Championship in United States Extemp, also winning the final round. Anthony Babu (Concord-Carlisle High School, Massachusetts) won the NSDA National Championship in International Extemp, also championing the final round. The Extemp Central points race crowned Brandon Cheng (Flintridge Preparatory School, California) as its champion. Sruti Peddi (BASIS Scottsdale High School, Arizona) placed second in the points race and Anthony Babu placed third.\nOn the collegiate circuit, Gustavo Lanz (George Mason University, Fairfax), won the American Forensics Association's national tournament and Gursimrat Dahry (University of Minnesota, Twin Cities) won the National Forensics Association's national tournament.\n2022–2023\nIn the 2022–2023 season, McKinley Paltzik (Phoenix Country Day School, Arizona) won the Montgomery Bell Round Robin, the NSDA National Championship in International Extemp, the Extemp Central Points Race, the Extempers Bible Points Race and the Extemp Tournament of Champions. Theodore Gercken (The College Preparatory School, California) won the NSDA Points Race in Extemp. Agrim Joshi (Shakopee High School, Minnesota) won the National Individual Events Tournament of Champions. Kyle Letterer (Plano West Sr. High School, Texas) won the NSDA National Championship in United States Extemp.\n2021–2022\nIn the 2021–2022 season, Daniel Kind (Lake Highland Preparatory School, Florida) won the NCFL Grand National Championship, Extemp Central Points Race, Extemper's Bible National Points Race, and the NSDA Points Race in Extemp. McKinley Paltzik (Phoenix Country Day School, Arizona) won the Montgomery Bell Round Robin, the Tournament of Champions, and the NSDA National Championship in International Extemp. Peter Alisky (Smoky Hill, Colorado) won the NSDA National Championship in United States Extemp. Gabriel Bo (Plano West Sr. High School, Texas) won the National Individual Events Tournament of Champions. Cameron Roberts (Jack C Hays High School, Texas) won the Extemp Tournament of Champions.\n2020–2021\nIn the 2020–2021 season Kay Rollins (The Potomac School, Virginia) won the Montgomery Bell Round Robin, the Tournament of Champions, the National Individual Events Tournament of Champions, and the NSDA Points Race in Extemp. Mukta Dharmapurikar (Durham Academy, North Carolina) won the Extemp Tournament of Champions and the Extemper's Bible National Points Race. Ananth Veluvali (Edina High School, Minnesota) won the NCFL Grand National Championship. Pranav Pattatathunaduvil (Plano West Sr. High School, Texas) won the NSDA National Championship in International Extemp. Laurel Holley (Riverside High School, South Carolina) won the NSDA National Championship in United States Extemp. Due to the COVID-19 pandemic, the Extemp Central National Points Race was not held that season. Extemp Central did not release standings for the 2020–2021 season.\nReferences"
    }
  ]
}