{
  "content": [
    {
      "type": "text",
      "text": "# F. Millward Grey\n\nFrederick Millward Grey (5 August 1899 – 1957), generally called \"Millward Grey\", was an English painter, etcher and art teacher who had a substantial career in South Australia.\nHistory\nGrey studied under Gerald Spencer Pryse, at the Central School of Art in London, and arrived in Adelaide in 1923 to take up a position with Fred C. Britton's North Adelaide School of Fine Arts, Tynte Street, North Adelaide. Grey and Britton held a joint exhibition in November 1924 which was well received. His sketches were used in the design of the War Memorial on North Terrace. He succeeded Britton as director of the School of Fine Arts. Nora Heysen was a notable student. In 1939 he stood for the Robe ward of the Adelaide City Council, but was defeated by H. G. Willcox. Grey was acting principal of the South Australian School of Arts and Crafts during John Goodchild's absence, and appointed to the position in 1946, and served (later title: Director of the South Australian School of Art) until 1956. He was a member of the Royal South Australian Society of Arts and in 1953 he was elected president after outgoing president Goodchild controversially named him as his fitting successor. He served as President 1953–1956.\nSome works\n*In 1935 Grey and The News cartoonist J. L. \"Jack\" Quayle shared first prize for a sketch commemorating South Australia's Centenary. Around this time he and John Goodchild were commissioned by the South Australian Tourist Bureau to produce a series of lithographed posters which were extensively used on railway station billboards and elsewhere.\n*He had a major role in the design of South Australia's Coat of Arms, granted in 1936, replaced in 1984.\n*A large mural version of a design by Grey of Piccadilly Circus, commissioned by the theatre owner Dan Clifford,  reproduced by Frank Hussey, adorned the wall above the circle staircase of the Piccadilly Theatre in North Adelaide when it opened in 1941. The mural was later painted over, but was rediscovered during the 2022 renovation of the cinema.\n*He designed the silver tea and coffee service made by the Kenwrick brothers as a wedding gift from South Australia to the Princess Elizabeth and the Duke of Edinburgh and the ceremonial chairs used by the royal couple during their official visit in 1954.\n*He designed the cairn and plaque memorial for Daisy Bates at Ooldea, South Australia.\nFamily\nMillward Grey married Beatrice Helen Fisher on 3 January 1929, and lived in Jeffcott Street, North Adelaide. Their son David, father to Kendall and Kent, was born on 24 September 1933.\nReferences"
    }
  ]
}