{
  "content": [
    {
      "type": "text",
      "text": "# Fabian Ware\n\n| image            = Fabian Ware.jpg\n| image_size       =\n| alt              =\n| caption          = Ware in October 1916\n| nickname         =\n| birth_date       =\n| birth_place      = Clifton, Bristol, England\n| death_date       =\n| death_place      = Barnwood, Gloucestershire, England\n| placeofburial    =\n| allegiance       =United Kingdom\n| branch           = British Army\n| serviceyears     = 1915–1921; 1939–1944\n| rank             = Major-general\n| servicenumber    =\n| unit             =\n| commands         =\n| battles          = First World WarSecond World War\n| awards           = Knight Commander of the Royal Victorian OrderKnight Commander of the Order of the British EmpireCompanion of the Order of the BathCompanion of the Order of St Michael and St GeorgeMentioned in Despatches (2)Grand Officer of the Legion of Honour (France)Croix de guerre (France)Commander of the Order of the Crown (Belgium)\n| relations        =\n| laterwork        =\n}}\nMajor-General Sir Fabian Arthur Goulstone Ware  (17 June 186928 April 1949) was a British educator, journalist, and the founder of the Imperial War Graves Commission (IWGC), now the Commonwealth War Graves Commission (CWGC). He also served as Director of Education for the Transvaal Colony and editor of The Morning Post.\nWare was born in Clifton, Bristol, and graduated from the University of Paris in 1894. Several years after graduation, he travelled to the Transvaal Colony where, as a member of Milner's Kindergarten, he became Director of Education in 1903. Two years later, Ware became editor of The Morning Post and returned to England. While editor, he expanded the paper and reoriented it to focus on colonial affairs. After several controversies, culminating in a failed effort to purchase an airship for the United Kingdom, Ware was forced to retire in 1911.\nWhen the First World War started in August 1914, Ware attempted to join the British Army but was rejected because he was too old. With the assistance of Alfred Milner, he obtained an appointment as the commander of a mobile ambulance unit provided by the British Red Cross Society. In this role he began marking and recording the graves of those killed. The unit soon began to focus exclusively on graves, and the organisation was transferred to the British Army in 1915. The following year the Army Department of Graves Registration and Enquiries was created with Ware at its head. On 21 May 1917 the Imperial War Graves Commission was founded. Ware served as vice-chairman. He ended the war as a major-general, having been mentioned in despatches twice.\nPost-war, Ware was heavily involved in the IWGC's function. He frequently led negotiations with foreign nations over cemeteries and memorials, dealt with prominent figures in the commission, and worked to ensure the commission's financial security. Ware also attempted to raise support for his ideal of cooperation between the Dominions. In the lead-up to the Second World War, he attempted to use the IWGC's work as a tool for ensuring peace. When war broke out, he continued to serve as vice-chairman of the IWGC and was re-appointed director-general of Graves Registration and Enquiries. He retired from the Commission in 1948 and died the following year.\nEarly life\nWare was born in Clifton, Bristol, on 17 June 1869 to Charles and Amy Carew Ware,  Goulstone. He was privately tutored until his father died when he was 18. Ware then taught in private schools to pay for tuition at the University of London. Dissatisfied with his education, Ware left the university and after saving enough money began attending the University of Paris, graduating with a Bachelor of Science in 1894. He worked as an assistant schoolmaster from 1889 to 1899; the last four years at the Bradford Grammar School. While teaching, he was occasionally employed as an examiner for the Civil Service Commission. He married Anna Margaret (1868–1952) on 1 August 1895; they had a daughter and a son.\nTransvaal\nWare began contributing articles to The Morning Post in 1899. He served as the representative of the Education Committee of the Royal British Commission at the Exposition Universelle of 1900 in Paris and afterwards worked as an inspector of schools for the Board of Education. In October 1901 Ware was appointed assistant director of education in the Transvaal by Alfred Milner, 1st Viscount Milner, becoming a member of an informal group of young Britons later known as Milner's Kindergarten. He moved to the Transvaal and stopped writing for The Morning Post. As assistant director Ware chaired two committees in 1902 and 1903 on the topic of technical education in the colony. The Transvaal Technical Institute was created in early 1904 upon their recommendations. Ware served as chairman of the institute's council.\nIn early 1903 Ware became acting director of education when Edmund Beale Sargantthe director of education for the Transvaal and Orange River Colonyreturned to England in failing health. On 17 June 1903 Ware was made a member of the Transvaal Legislative Council, and in July he became permanent director of education for the Transvaal. Author  wrote that as a member of the council Ware was \"probably the only South African Superintendent of Education that has represented education directly before the legislature\". Under Ware, the number of children in education in the Transvaal doubled in less than four years. As director, he advocated the eventual creation of a de-centralised system of education with responsibility largely in the hands of local authorities.\nThe Morning Post\nWhen the editor-in-chief of The Morning Post, James Nicol Dunn, resigned during the Russo–Japanese War, Ware had written to Oliver Borthwick and asked whether he could work on the paper's staff. Several years later, in April 1905, Lord Glenesk offered the editorship of The Morning Post to Ware, in part through Milner's influence. Ware accepted, and moved back to England, taking the position in March. Historian A. J. A. Morris wrote that Glenesk intended for Ware to \"be the much needed new broom\" for the paper. When Ware became editor, The Morning Post had no offices. Its staff worked instead in temporary wooden sheds. He began expanding the paper by hiring Richard Jebb as a contributor, who in turn hired many other correspondents.\nThe two began to focus the paper on the British Dominions, a move they presented as a means to increase the paper's circulation; though it allowed for new sources of advertising, the move did not lead to higher circulation. Ware aimed to make the paper \"the authority on all colonial questions,\" and supported social and tariff reform. He invited radicals such as William Beveridge and R. H. Tawney to contribute to the paper. Shortly after beginning work, Ware came into conflict with Glenesk, who thought he should not promote tariff reform, and wrote asking Lord Glenesk's daughter, Lady Bathurst,|name=|group=}} to intervene and threatening to resign. As a result of his initiatives, Ware was disliked by some members of the paper's staff, particularly Spenser Wilkinson, the paper's leader writer, and E. E. Peacock, the paper's manager. Ware also supported Richard Jebb's campaign against respected conservative Robert Cecil for the Marylebone East Parliament seatwhich cost the paper readership.\nAfter the First Moroccan Crisis in 1905, Ware campaigned heavily against war with Germany. He later said\nat any rate she is every month becoming less prepared, relatively to Germany to fight her than she was then.|sign=|source=}}\nWhen Glenesk died in November, Lady Bathurst became owner of the paper. Lady Bathurst and Ware generally got along as they both held a political stance firmly to the right - though Ware's instincts for social reform were very strong. Ware was involved in hiring Robbie Ross as an art editor for the paper in August 1908. After the Bosnian Crisis in 1908, Ware became further convinced that the United Kingdom was falling behind Germany in military strength, a stance Wilkinson did not agree with. In a letter to Wilkinson, Ware wrote that The Morning Post \"should boldly point to the German danger\" and \"rub in the immediate necessity of universal military service and the re-organisation of naval matters\". He said that if the newspaper did not adopt that stance, \"I cannot... continue to accept the responsibility of its editorship.\" Wilkinson considered the letter \"a demand that I should abandon my sincerity as a writer, that is commit suicide\". He felt Ware wanted \"to hasten a war with Germany while I hope it may be averted by proper attention to navy and army and by sound foreign policy\".\nIn response to the perceived military deficiency of the United Kingdom and Germany's successful test of a Zeppelin, The Morning Post announced the creation of a National Airship Fund on 21 June 1909. The aim of the fund was to raise £20,000 through public subscription to purchase the United Kingdom an airship. Lady Bathurst contributed an initial £2,000 to the fund. Ware travelled to Paris in July and signed a contract for Lebaudy Frères to build the Lebaudy Morning Post. In August, it was revealed that the Daily Mail had offered to pay for a hangar while an airship from Clément-Bayard was shipped to England. Ware rushed to ensure The Morning Posts airship arrived first, and by May 1910 he began helping plan the airship's route to England. However, the Clément-Bayard No.2, sponsored by The Daily Mail, arrived in England on 16 October 1910. The War Office purchased the airship and the National Airship Fund was left out of negotiations. The Lebaudy Morning Post was damaged when it arrived in England ten days after the Clément-Bayard No.2 because its hangar was too small, and it crashed on its first test flight. Ware was accused by H. Massac Buist and Lancelot Julian Bathurst, the paper's manager and Lady Bathurst's brother-in-law, of financial mismanagement and poorly managing the paper. After threatening to sue Lancelot Julian Bathurst over libel, Ware was given £3,000 and agreed to retire. His retirement was announced on 14 June 1911.\nAfter leaving The Morning Post, Ware planned to create a weekly paper independent from political parties, with funding from various British Dominions. The project was unsuccessful. Ware became a special commissioner for Rio Tinto, negotiating with the French government. a board member, or special commissioner/consultant.|name=|group=}} In 1912 he published The Worker and His Country, which historians John Lack and Bart Ziino describe as \"an alarmist diagnosis of social unrest in France and Britain\". In the book, Ware advocated for land redistribution to ease tensions between British social classes.\nFirst World War\nMobile ambulance unit\nWith the outbreak of the First World War in 1914, the Royal Automobile Club began assisting the war effort with the creation of the Royal Automobile Club Volunteer Force. On 12 September 1914 several members of the club volunteered their services to the British Red Cross, which established the Motor Ambulance Department. Warewho was 45 years oldhad been rejected from serving in the British Army because he was too old, and obtained an appointment to command a mobile Red Cross ambulance unit with the assistance of Lord Milner. He arrived in France and took command of the unit on 19 September 1914.\nOne of several Red Cross units in France, Ware's unit operated in northern France as a semi-autonomous command. He had a degree of independence afforded by the Joint Finance Committee of St John Ambulance and the Red Cross, who gave Ware his own operating budget for three-month periods. Ware was struck by the lack of an official mechanism for managing the graves of those killed and following British defeats at Mons and Le Cateau in September, Ware's unit began sharing information with Lord Robert Cecil, the head of the Red Cross's Wounded and Missing Department.\nAccording to an Imperial War Graves Commission (IWGC) report, the original object of the unit was to \"search for British wounded and missing in the district which had been overrun by the Germans during the retreat from Mons, and to convey them back to the British lines or to a British base\". However, by early October 1914, the unit had begun extensively working with the French and handling their casualties. By mid-October, Ware's unit had added a medical staff and mobile light hospital. That month Ware visited an extension of the Béthune cemetery which had British graves not maintained and some not even recorded. He soon convinced the Red Cross to fund durable grave markers. By December, the unit had dealt with more than four thousand wounded soldiers.\nWare began to focus on searching for dead soldiers on battlefields in northern France. In February 1915 the unit asked Reginald Brade to help ensure the unit's continuing work and Ware unsuccessfully applied for a pass from the provost marshal at St Omer to continue grave work. The unit's usefulness as an ambulance group declined as French capabilities to handle their casualties increased. In early 1915 the commander of the French 10th Army Corps declined an offer of help from the unit. When the unit was disbanded in May 1915, it had dealt with 12,000 casualties and treated 1,000 at its hospital.\nGraves Registration Commission\nWare met with the Adjutant-General to the Forces, Nevil Macready, in mid-February 1915 to discuss the future of his work. With the support of Macready the British Army formally recognised a Grave Registration Commission (GRC) on 2March that was created from Ware's unit. The Commission represented a joint effort between the British Army and the British Red Cross.the Red Cross continued to supply men and vehicles, while Ware was given the local rank of major... and the army took on the costs of crosses, rations and fuel\" |name=|group=}} Ware initially divided the Commission into four regions with six men and four vehicles each, led by a headquarters of forty-four workers. On 22 May he was made a temporary major in the British Army to provide his work added authority.25}} On 9September the promotion was antedated to 22 February 1915.\nThe GRC's work continued to rapidly expand through 1915: by May 4,300 graves had been registered. That spring Ware began serving as an intermediary between the French and British governments over grave-related matters. The GRC was reorganised in summer 1915 into eight sections writes there were \"two parts, with seven distinct sections\" by August 1915 while  writes that by summer 1915 work was \"re-divided  eight sections\".  suggests the discrepancy is due a GRC report that lists \"only seven sections of GRC staff, however, it goes on to describe eight sections. This was likely due to two sections being stationed at Bethune.\"}} and began handling requests at a headquarters in Lillers. The sections worked on grave maintenance. By mid-August, 18,173 graves had been registered. Ware's role in the commission was to serve as \"the sole intermediary between the British Army in the Field and the French Military and Civil Authorities in all matters relating to graves\". He thus led negotiations between France and Britain beginning in March 1915, particularly with the French Grand Quartier Général, Ministry of War and Ministry of the Interior.\nThese negotiations attempted to resolve areas of disagreement between the two nations, particularly that of land expropriation for the cemeteries. The negotiations resulted in an \"expropriation bill\" which was presented to the Chamber of Deputies in July. Ware shepherded the bill through its passage, urging prominent British figures such as the adjutant-general and King George V to support it. By May 1916, the GRC had selected 200 sites for cemeteries. The law was passed by the French government on 29 December 1917 after objections in the senate were resolved. It gave Britain the ability to control their war graves in \"perpetuity of sepulture\" and provided for the establishment of a British authority to manage the cemeteries.\nWhen Will Gladstone, a Member of Parliament and the grandson of former Prime Minister William Ewart Gladstone, was killed in action near Laventie on 13 April 1915, his family attempted to have the body exhumed and returned to England. Despite a ban on exhumations established by French General Joseph Joffre, his family received special permission to take the body and bury it in Hawarden, Wales. In response, with Ware's influence a ban on future exhumations was established. To facilitate ease of remembrance, Ware hoped burials would be in relatively centralised cemeteries and worked against isolated burials occurring.\nOn 10 September 1915 he was appointed a chevalier of the French Legion of Honour. The GRC had registered over 31,000 graves by October 1915 and 50,000 by May 1916. As the war continued, Ware and others became concerned about the fate of the graves in the post-war period. Following a suggestion by the British Army, the government created the National Committee for the Care of Soldiers' Graves in January 1916, with Edward, Prince of Wales agreeing to serve as president and Ware as a member. Ware was promoted to temporary lieutenant colonel on 11 February 1916 as a result of his increasing responsibility over grave-related matters as the war expanded to more fronts.\nDirectorate of Graves Registration and Enquiries\nWare competed with Sir Alfred Mond, the First Commissioner of Works, for responsibility over the graveyards. The Department of Works had managed war graves during previous British conflicts, and Mond wanted a share in managing graves from the First World War. Ware felt the scale of the war was so unprecedented a new organisation was needed to care for the graves and wanted to keep Mond out of the work. Though the feud continued into the 1930s, Ware's Commission was ensured priority when the GRC was formally integrated into the Army in May 1916 as the Directorate of Graves Registration and Enquiries (DGRE).\nRepresentatives from various relevant government departments were included and in September 1916 representatives from the dominions of the British Empire were included. Ware was made director of Graves Registration and Enquiries at the War Office on 15 May 1916, a post he held until the end of the war. That month he began working in London at Winchester House, St James's Square.\nThe move to London was in part because it was easier to develop photographs and women could work as clerks. It also became necessary as the DGRE expanded operations to areas outside France and Belgium. Only one-fifth of the typists Ware had requested initially arrived, but his staff eventually grew to around 700. The DGRE had expanded to include an Italian and an Eastern section; the latter included Salonika, Egypt, and Mesopotamia. Ware was soon given the nickname 'Lord Wargraves', reflecting his heavy involvement in grave-matters.\nAs Ware's work with graves continued, discussion about a \"double identity disc\" (previously there was only one per soldier) began in 191540, 42}} and continued into early 1916. Ware wrote Macready on 21 June 1915; in the letter he included a sketch of a pair of discs made of compressed fibreone could be removed and the other left with the corpse. On 24 June his proposal was accepted and four million were ordered. Discs began arriving in large numbers in mid-November. Such discs were issued to soldiers throughout the rest of the First World War and the Second World War despite the fibre decomposing quickly. The British Army stopped using the design in 1960.40, 42}}\nWhile director, Ware was made a temporary brigadier-general on 12 August 1916. The DGRE regulated graves, making every aspect from spacing of graves to marking the graves uniform. He attempted to resolve differences between soldiers of different religious affiliations, decreeing for instance: \"On no account should [Egyptian] Mohammedans be buried in Christian consecrated ground [...] Jewish graves were to be marked with a double triangle on a stake [and] under no circumstances should a cross be erected over an Indian Grave.\"\nEfforts to neaten the cemeteries had begun in early 1916 when Ware invited Arthur William Hill, assistant director of the Royal Botanic Gardens, Kew, to tour the cemeteries and advise upon further planting efforts. Hill visited 37 cemeteries and wrote a report on how to plant them. Efforts began slowly, but by 1917 the commission had established four nurseries. In the 1917 New Year Honours, Ware was made a companion of the Order of St. Michael and St. George (CMG). By April 1917 the DGRE had registered over 156,500 graves; at least 150,000 in France and Belgium, 2,500 in Salonika and 4,000 in Egypt.\nImperial War Graves Commission\nBy early 1917 several members of the National Committee for the Care of Soldiers' Graves believed a formal imperial organisation would be needed to care for the graves after the war. With the help of the Prince of Wales, Ware submitted a memorandum to the Imperial War Conference in 1917 suggesting that such an organisation be constituted. The suggestion was accepted and on 21 May 1917 the Imperial War Graves Commission was established by royal charter, with the Prince of Wales serving as president and Secretary of State for War Lord Derby as chairman.\nThe IWGC had the responsibility for soldiers of members of the British Empire who died in active service.25}} At its first meeting on 20 November, Ware was appointed vice-chairman. Historian Tim Skelton wrote that he was \"de facto, chief executive\" of the commission. The IWGC could purchase land, build memorials, and restrict other memorials in the cemeteries.\nIn September 1917 Ware was given authority to wear the insignia of a commander of the Belgian Ordre de la Couronne. That month Belgium granted Britain land for cemeteries in perpetuity. Similar agreements were soon negotiated with Egypt, Italy, Serbia, and Greece. Once land for cemeteries and memorials had been guaranteed, the task of recording the details of the dead could fully begin. Around 587,000 graves had been identified and 559,000 soldiers listed as having no known grave by 1918. On 7October 1918 Ware was given the temporary rank of major-general as director-general of the DGRE.\nPlanning\nIn May 1917 architect Edwin Lutyens wrote to Ware, urging \"great stone[s] of fine proportion twelve feet long set fair or finely wrought\". The proposal, supported by Ware, was criticised by figures such as Randall Davidson, the Archbishop of Canterbury, for its lack of religious motifs. Ware told Lutyens he was \"shocked\" by the response and was considering giving the Office of Works responsibility for graves. He still felt \"the 'stone' will win yet.\" Lutyens considered Ware \"a most excellent fellow and very keen to do the right thing without fear or favour of the present sentiment. With a preference for the most permanent and perfect.\"\nIn June 1917 Ware proposed a £10 budget per grave (equivalent to £ in  terms), which became the standard sum for the IWGC. On 9July a committee organised by Ware, consisting of the Director of the Tate, Charles Aitken, the author J. M. Barrie, and the architects Lutyens and Herbert Baker, toured the cemeteries in order to form a plan for the post-war activities of the commission. The committee met on 14 July and decided all cemeteries should have a general theme, though one had not yet been decided. They agreed there would be four variations on the theme: monumental, garden or woodland, village, and town cemeteries; and grave markers would be uniform, with no individual crosses or monuments. In August Lutyens suggested there be \"one kind of monument throughout [the cemeteries], whether in Europe, Asia, or Africa\". He suggested that his Great War Stones be used as the monument.\nOn 21 September Ware, Hill, Lutyens, and Baker met in London to discuss preliminary plans. No agreement was reached. Lutyens continued to promote his concept of war stones as respectful to all religions, but Aitken and Baker favoured crosses. Both sides attempted to gain Ware's endorsement for their view. Upon Ware's invitation, author Rudyard Kipling was appointed the commission's literary adviser in October 1917. In late 1917 Ware began searching for a replacement to Aitken, who did not fully support Ware's vision for the commission. He also looked into establishing a 'Religious Advisory Committee' to help settle religious questions.\nAs Aitken's replacement, Frederic G. Kenyon was made artistic director of the Commission on 20 November 1917, largely to serve as a mediator in frequent conflicts between the architects. As part of his job he began to write a report deciding which proposals would be instituted in the IWGC's cemeteries. On 22 November Ware formally announced that there would be no difference \"between officers and men lying in the same cemeteries in the form or nature of the memorials\". In 1918 Lutyens, Baker, and Reginald Blomfield were appointed the commission's principal architects.\nIn 1918 Kenyon finished his report, titled War Graves: How the Cemeteries Abroad Will Be Designed, and presented it to the commission. The report outlined many factors of how the cemeteries would be designed, particularly emphasising equal treatment of all soldiers. It also supported the programme of planting under Arthur Hill. Kenyon proposed having young architects design the cemeteries under the supervision of more experienced and senior architects such as Baker and Lutyens. Kenyon accepted Lutyens' proposal and critics were appeased by support for a Cross of Sacrifice designed by Blomfield, and a recommendation that a cross be placed in every cemetery. The war stones became known as the Stones of Remembrance, and more than a thousand were erected. Kipling proposed the inscription \"their name liveth for evermore\" for the monuments.\nFor his work during the war, Ware was mentioned in despatches twice, including by Douglas Haig on 10 April 1919. The same year he was made a companion of the Order of the Bath, and in 1920 a knight commander of the Order of the British Empire. He received the Croix de Guerre and was made a commander of the Order of the Crown of Belgium. On 1 March 1921 Ware relinquished his commission, leaving the army, and was granted the rank of honorary major-general. In May 1922 he was made knight commander of the Royal Victorian Order. In 1929 the University of Aberdeen granted him an honorary doctorate.\nPostwar\nUpon the end of the First World War, the IWGC could fully begin work. When the war ended, cemeteries were in disarray and many soldiers were still unburied. Though it technically was not responsible for burials and Ware's proposals for a 'burial corps' were rejected, in practice the commission was held responsible for making sure all bodies were buried. Ware continued to work for the commission, undertaking negotiations with foreign nations and hiring further professionals.\nBuilding remembrance\nAs people would soon begin visiting, the IWGC rushed to make the cemeteries presentable. The commission began building experimental cemeteries at Le Tréport, Forceville and Louvencourt in 1918. These were complete in early 1920 and were generally positively received, particularly the one at Forceville. Various changes were made based on the experimental cemeteries; notably cutting the cost of building cemeteries. The commission's work continued rapidly; by April 1920, there had been 128,577 re-interments in France and Belgium and the IWGC was managing 788 cemeteries. In March 1920 Ware predicted there would be more than half a million graves in 1,200 cemeteries in France and Belgium. Charles Holden was made a fourth principal architect that year.\nHerbert Ellison managed most of the IWGC's business as Ware handled political issues. Ware was considered one of the faces of the commission, and gave annual Remembrance Day addresses to the United Kingdom to urge against future wars. He also had a film made, gave lectures, and organised photographic exhibits about the IWGC's work. At the Imperial War Conference in June 1918 it was agreed to make funding for the commission proportional to the number of soldiers each nation had lost based on figures submitted by Ware. The United Kingdom funded the vast majority of the commission's workaround 80%. His £10 figure had become standard reckoning, and in November 1918 the IWCG created a finance committee. In May and June 1919, Ware argued that the IWGC should be made independent of HM Treasury, which was observing the commission's finances, and this largely occurred after a meeting on 20 June.\non Gallipoli]]\nThough many nations had given Britain control of their war graves and cemeteries in perpetuity, the Commission continued to seek similar concessions from other nations, including those who had fought against the United Kingdom during the war. One of the most difficult such areas was Gallipoli, which had been the site of the Gallipoli campaign. New Zealand and Australia, whose ANZAC forces had been heavily involved in the fighting, felt strongly that the IWGC should secure land for a cemetery. Charles Bean, the influential journalist and author of Australia's official war history proposed that \"the complete Anzac site, including the Turkish trenches on the reverse slope adjoining it, be vested in the Graves Commission\".\nWare had unsuccessfully attempted to begin negotiations with Turkey in 1917, separately asking the Red Cross, the Catholic Church, and the United States to serve as intermediaries. At the Paris Peace Conference from 1919 to 1920, the IWGC pushed for the right to land on Gallipoli called the 'ANZAC estate'as soon as possible. Ware was personally involved in these negotiations. The Commission gained such a concession in the Treaty of Sèvres, signed in August 1920. Renegotiation occurred after the Turkish War of Independence, and in the Treaty of Lausanne the IWGC gained the right to land the Allies considered \"necessary for the establishment of cemeteries for the regrouping of graves, for ossuaries or memorials\". By 1926, the IWGC had built 31 cemeteries and five memorials on the peninsula.\nWare travelled extensively after the war, visiting Canada (1925), Egypt (1929), India and Iraq (1930), and Australia and New Zealand (1934). The Commission faced criticism over not allowing individual memorials for soldiers, and repatriation of bodies of the dead, including in a petition spearheaded by Lady Florence Cecil (wife of William Cecil, the Bishop of Exeter) that was presented to the Prince of Wales in spring 1920 with over eight thousand signatures.}} Ware worked with William Burdett-Coutts, an MP, to write statements urging Parliament to allow the IWGC to continue its work. The disagreements led to a debate in Parliament over funding of the commission on 4May 1920. Sir James Remnant started the debate, followed by numerous speakers; notably speeches by Burdett-Coutts in favour of the commission's principles and Lord Robert Cecil (Lady Florence Cecil's brother-in-law) supporting those who wanted repatriation and opposed uniformity of grave markers.\nWinston Churchill, the then Secretary of State for War, closed the debate and asked that the issue not proceed to a vote. Remnant withdrew his motion, allowing the commission to carry out its work assured of support for its principles. In 1921 the commission moved to offices at 82 Baker Street. Most cemeteries were completed by the mid-1920s, at a total cost of £8,150,000 (about £ million in  terms), in what was, according to architectural historian Gavin Stamp, \"one of the largest schemes of public works ever undertaken\".\nMonuments\nFollowing the end of the war, there was an influx of Commonwealth organisations that wanted to construct memorials in France and Belgium. Private divisional monuments and memorials for individual countries were quickly proposed and the National Battlefield Memorial Committee was set up in 1919 to oversee the construction of monuments for the United Kingdom. Ware and the IWGC had the ability to license all such memorials and he began working with the various groups.\nAlthough Ware felt the primary focus of the IWGC should be cemeteries, by August 1921 it had gained responsibility for battlefield monuments as the National Battlefield Memorial Committee was dissolved. The Commission planned to build twelve monuments to missing soldiers in France and Belgium, and several others to sailors lost at sea and across Europe.\nDiscussions on how to commemorate the Ypres Salient, the first monument the IWGC worked on, dated back to 1919, when Winston Churchill said, \"I should like us to acquire the whole of the ruins of Ypres as a memorial [...] A more sacred place for the British race does not exist in the world\". The Belgian government agreed to give Britain the ruins of the Menin Gate to build a memorial for Commonwealth soldiers whose graves were unknown. Reginald Blomfield was appointed to design the monument. He proposed a triumphal arch and central hall. The IWGC struggled to navigate various commissions when building monuments in the United Kingdom.\nDuring planning for the Mercantile Marine Memorial in London, the Royal Fine Arts Commission (RFAC) rejected Lutyens's initial proposal at Temple Gardens on the bank of the River Thames, suggesting Tower Hill instead. Upset, Lutyens and Ware unsuccessfully urged the RFAC to reconsider. To commemorate sailors lost at sea, the IWGC planned three naval memorials of the same design in Chatham, Portsmouth, and Plymouth. They were designed by Sir Robert Lorimer with Henry Poole as a sculptor. Though Ware worked closely with the Admiralty on the monuments, he disliked it, saying the idea of their involvement \"fills me with dismay\".\nWhen the Menin Gate was completed in 1927, 57,000 names were inscribed on the monument.}} In July 1932 he urged the Canadian prime minister R. B. Bennett to support an 'Imperial Economic Committee' outside the British Treasury's control. Ware was the first to seriously propose something of the kind, submitting a draft charter for the establishment of the 'Imperial Economic Commission', which would function as an economic general staff for the empire. The proposal gained little support.\n]]\nWare was an honorary associate at the Royal Institute of British Architects, and a director of the journal Nineteenth Century and After. As a director of the journal, he made the decision to appoint Arnold Wilson as editor and later insisted on his removal for poor coverage of the Spanish Civil War. He was an adviser at the 1937 Imperial Conference. Ware also served the county of Gloucestershire in various capacities, including as president of the Gloucestershire Rural Community Council from 1940 to 1948, chairman of the executive committee of the Parents' National Educational Union in 1939, and chairman of the Gloucestershire Branch of the Council for the Preservation of Rural England.\nSecond World War and death\nWare travelled to Cologne in October 1936 and attended a conference of the German War Graves Commission (). In his speech he said war cemeteries would promote \"a blessed healing of wounds\", but at the same time warned \"armed conflict [...] between these great nations would result in deeper wounds, wounds so deep that they would defy healing.\" The speech was well received and republished by the German press.\nWare continued his efforts against war even as the Anschluss and the Munich Agreement occurred. He spoke at the Volksbund's celebration in 1938, again advocating against war. In 1939 he spoke to Ivan Maisky, the Ambassador of the Soviet Union to the United Kingdom, and worked on negotiations between the USSR and IWGC. That year Ware began preparations for a possible war.\nAt the outbreak of the Second World War, Ware was recalled to serve as director-general of Graves Registration and Enquiries at the War Office on 30 August 1939. On 3September he was granted an emergency commission with the honorary rank of major-general. He also continued in his role as vice-chairman of the commission and facilitated cooperation between the organisations.\nIn Autumn 1940 Ware began working on a programme to memorialise civilian dead as a result of the war. He wrote a letter to Winston Churchill, by then Prime Minister, saying the IWGC could not \"omit to commemorate these [civilian casualties] if the higher purposes inspiring their work\" were to continue to be respected, and the IWGC began recording civilian deaths \"caused by enemy action\" in January 1941. Despite support from the King and Registrar General, the Commission struggled to record all informationparticularly the addresses of next of kin.\nAfter Ware toured some of the areas with the most deaths, local authorities were enlisted to help. By releasing various announcements and a radio broadcast by Ware in November, the IWGC had collected information on more than 18,000 people. In January 1942 he proposed listing dead civilians in the Warrior's Chapel in Westminster Abbey on a roll of honour. Though the Dean of Westminster supported the proposal, Herbert Morrison, the minister of home security, argued such a list should be put up after the war. Following discussions, it was agreed the rolls would not be announced until after the war ended.\nWare resigned as director-general of Graves Registration and Enquiries in 1944, leaving the army, to continue his work with the commission. Progress was hampered as the DGRE and IWGC struggled to cooperate. In April 1944 Ware spoke at a conference on war memorials organised by the Royal Society of Arts. He toured cemeteries in France and Belgium in August 1945. He resigned as vice-chairman of the Commission in 1948 due to old age and failing health, particularly his chronic phlebitis.\nWare died on 28 April 1949 in Barnwood House Hospital, Gloucester, and was buried in Holy Trinity Churchyard, Amberley on 2May. His grave has an IWGC-style headstone. There are memorial tablets to him in St George's Chapel at Westminster Abbey and in Gloucester Cathedral. The road Boulevard Fabian Ware in Bayeux, the location of Bayeux War Cemetery, is named in his honour.\nList of works\n*\n*\n*\n*\n*\n*\n*\nNotes\nReferences\nCitations\nCited sources\nBooks\n*\n*\n*\n*\n*\n*\n*\n*\n*\n* }}\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n* 927|title=The dictionary of national biography : founded in 1882 by George Smith|editor-last1=Lee|editor-first1=Sidney|editor-last2=Nicholls|editor-first2=C. S.|editor-last3=Stephen|editor-first3=Leslie|last=Sillar|first=F.C.|date=1959|publisher=Oxford University Press|others=Internet Archive|oclc=254428002}}\n* }}\n*\n*\n*\n*\n* |language=en}}\n*\n*\n*\n*\n*\n*\n*\nNewspapers, gazettes, journals and others\n*\n* }}\n* |language=en|oclc=1644708}}\n* |publisher=Marcus F. Marks, Government Printer|language=en}}\n*\n*\n*\n*\n*\n}}\n*\n}}\n*\n}}\n*\n}}\n*\n}}\n*\n}}\n*\n}}\n*\n}}\n*\n}}\n*\n}}\n*\n}}\n*\n}}\n*\n}}\n*\n}}\n*\n}}\n*\n}}\n*\n}}\n*\n}}\n*\n* |issn=0362-4331}}\n* }}\n* |issn=0140-0460}}\n*\n* 42|issn=2057-0422}}\n* }}\n, |\"Sir Fabian Ware to retire\", The Times (London), 19 March 1948, p. 7.|\"The Imperial War Graves Commission\", The Times (London), 22 November 1917, p. 7; cf. minutes of the eleventh meeting of the Imperial War Graves Commission, 1 May 1919 (Commonwealth War Grave Commission Archives, CWGC/2/2/1/11), p. 1, and minutes of the twelfth meeting, 20 May 1919 (Commonwealth War Grave Commission Archive, CWGC/2/2/1/12) p. 7.}}"
    }
  ]
}