{
  "content": [
    {
      "type": "text",
      "text": "# Fabian Edwards\n\n| birth_place     = Kingston, Jamaica\n| death_date      =\n| death_place     =\n| death_cause     =\n| residence       =\n| nationality     =\n| height          =\n| weight_lb       = 185\n| weight_class    = Middleweight\n| reach           = 79+1/2 in\n| style           =\n| stance          =\n| rank            = Black belt in Brazilian Jiu-Jitsu\n| fighting_out_of = Erdington, Birmingham, England\n| team            = Team Renegade BJJ & MMA (2015–present)  Ultimate Training Centre (2010–2015)\n| years_active    = 2017–present\n| kickbox_win     =\n| kickbox_kowin   =\n| kickbox_loss    =\n| kickbox_koloss  =\n| kickbox_draw    =\n| kickbox_nc      =\n| mma_kowin       = 6\n| mma_subwin      = 3\n| mma_decwin      = 7\n| mma_koloss      = 1\n| mma_subloss     =\n| mma_decloss     = 3\n| mma_draw        =\n| mma_nc          =\n| relatives       = Leon Edwards (brother)\n| sherdog         = 200595\n| university      =\n| footnotes       =\n| updated         =\n}}\nFabian Edwards (born 24 March 1993) is an English professional mixed martial artist who competes in the Middleweight division of the Professional Fighters League (PFL), where he is the 2025 PFL Middleweight Tournament Champion. He is the younger brother of former UFC Welterweight Champion Leon Edwards.\nBackground\nEdwards was born in Kingston, Jamaica, where he and his family shared a single bed, one room, and a wooden house. They were living in squalor without realising it. Edwards's father was the boss of a neighbourhood gang, going by the name \"The General.\" Edwards became desensitised to gun violence since it occurred so frequently in his neighbourhood where gang and criminal activity were rife. Gunshots were commonplace. When Edwards was seven years old, his parents divorced, and his father was already residing in London while continuing to provide for the family financially from afar. They relocated to England to be closer to him, first to London and then to Aston, Birmingham. There were gangs there as well, and until they discovered MMA and formed Team Renegade, they spent their time blending in. Fabian started MMA five to six years after Leon, at the age of 16, due to the insistence of his brother.\nWhen Edwards was eleven, his father was shot dead in a London nightclub.\nMixed martial arts career\nEarly career\nPrior to going pro, he had a 9–0 record as an amateur. He rose up the ranks by working as a janitor and a carpenter. He did not leave his janitorial position until after signing his first deal with Bellator, at which point he believed his MMA career was already well started. The younger Edwards alternated between a day job and a fighting career for many years, working both jobs to exhaustion. But someday, he assured them, \"I'd be making enough money not to do that. I simply persisted, and it sort of paid off.\nBefore joining the British organisation BAMMA, he made his professional MMA debut with Bellator on 19 May 2017 against Rafał Cejrowski, winning by flying knee knockout in the first round. He reeled off five straight stoppages under the BAMMA promotion to start off his career in style. Starting with Aaron Kennedy via rear-naked choke at BAMMA 30, Louis King via rear-naked choke at BAMMA 33, Kent Kauppinen via armbar at BAMMA 34, and finally Claudio Conti via body kick TKO at BAMMA 35.\nBellator MMA\nAfter his highlight flying knee knockout, Edwards signed a multi-fight deal with Bellator.\nEdwards faced Lee Chadwick on 9 February 2019 at Bellator Newcastle, defeating the experienced veteran via unanimous decision.\nDebuting in his hometown for the first time, Edwards faced Falco Neto on 4 May 2019 at Bellator Birmingham, defeating Neto in highlight fashion, landing multiple upkicks on Neto that knocked him down, afterwards being finished by Edwards on the ground. Neto later tested positive for metabolites of methyltestosterone and nandrolone and was handed down a six-month suspension.\nAfter the win, Edwards signed a new deal with Bellator and in his first bout of the deal faced Jonathan Bosuku on 22 June 2019 at Bellator 223. He won the bout via unanimous decision.\nEdwards faced Mike Shipman on 23 November 2019 at Bellator London 2, defeating him in a close bout via split decision.\nAfter initially being booked against Costello Van Steenis for 16 May 2020 at Bellator London 3, the event was cancelled due to the COVID pandemic. The bout was rebooked for 26 September 2020 at Bellator Milan 2, where Fabian lost his first bout in his career via split decision.\nEdwards faced Austin Vanderford on 21 May 2021 at Bellator 259, losing the bout via unanimous decision.\nEdwards, as a replacement for Norbert Novenyi, was scheduled to face Charlie Ward at Bellator 270 on 5 November 2021. Ward had to pull out however due to a ruptured bicep and was replaced by promotional newcomer Robert Fonseca. Fonseca couldn't get paperwork sorted in time and the bout was scratched, with no replacement sought.\nEdwards was scheduled to face Marian Dimitrov at Bellator 275 on 25 February 2022. However, the bout was scrapped a week before for unknown reason. Edwards was rebooked against Lyoto Machida at Bellator London.\nEdwards faced former UFC Light Heavyweight Champion Lyoto Machida on 13 May 2022 at Bellator 281. He won the fight via knockout in the first round, catching Machida with an elbow after breaking from a clinch.\nEdwards faced Charlie Ward on 29 October 2022 at Bellator 287. He won the bout via unanimous decision.\nEdwards faced Gegard Mousasi in a Bellator Middleweight title eliminator fight on 12 May 2023, at Bellator 296. He won the fight via unanimous decision.\nEdwards faced Johnny Eblen for the Bellator Middleweight Championship on 23 September 2023, at Bellator 299. He lost the fight via knockout in the third round.\nEdwards faced Aaron Jeffery on 22 March 2024, at Bellator Champions Series 1. In a bout filled with lots of clinching against the fence, Edwards came out with a unanimous decision victory.\nEdwards was scheduled to rematch Johnny Eblen for the Bellator Middleweight Championship on 14 September 2024, at Bellator Champions Series 5. On September 3, the bout was rescheduled for a later date with no reason given. The bout was rebooked to take place on 19 October 2024 at PFL Super Fights: Battle of the Giants. Edwards lost the fight by unanimous decision.\nProfessional Fighters League\nOn February 25, 2025, the promotion officially revealed that Edwards joined the 2025 PFL Middleweight Tournament.\nIn the quarterfinal, Edwards faced Impa Kasanganay on April 18, 2025, at PFL 3. Initially Edwards withdrew from the tournament for unknown reasons and was briefly been replaced by Jordan Newman. Subsequently, it was announced that Edwards was pushed back in his original spot. He won the fight via technical knockout in round two.\nIn the semifinals, Edwards faced Josh Silveira at PFL 7 on June 27, 2025. He won the fight via unanimous decision.\nEdwards faced Dalton Rosta in the final at PFL 10 on August 21, 2025. He won the fight via head kick knockout in the third round.\nChampionships and accomplishments\nMixed martial arts\n* Professional Fighters League\n** 2025 PFL Middleweight Tournament Champion\nMixed martial arts record\n|-\n|Win\n|align=center|16–4\n|Dalton Rosta\n|KO (head kick)\n|PFL 10 (2025)\n|\n|align=center|3\n|align=center|1:28\n|Hollywood, Florida, United States\n|\n|-\n|Win\n|align=center|15–4\n|Josh Silveira\n|Decision (unanimous)\n|PFL 7 (2025)\n|\n|align=center|3\n|align=center|5:00\n|Chicago, Illinois, United States\n|\n|-\n|Win\n|align=center|14–4\n|Impa Kasanganay\n|TKO (punches)\n|PFL 3 (2025)\n|\n|align=center|2\n|align=center|2:14\n|Orlando, Florida, United States\n|\n|-\n|Loss\n|align=center|13–4\n|Johnny Eblen\n|Decision (unanimous)\n|PFL Super Fights: Battle of the Giants\n|\n|align=center|5\n|align=center|5:00\n|Riyadh, Saudi Arabia\n|\n|-\n|Win\n|align=center|13–3\n|Aaron Jeffery\n|Decision (unanimous)\n|Bellator Champions Series 1\n|\n|align=center|3\n|align=center|5:00\n|Belfast, Northern Ireland\n|\n|-\n|Loss\n|align=center|12–3\n|Johnny Eblen\n|KO (punches)\n|Bellator 299\n|\n|align=center|3\n|align=center|0:21\n|Dublin, Ireland\n|\n|-\n|Win\n|align=center|12–2\n|Gegard Mousasi\n|Decision (unanimous)\n|Bellator 296\n|\n|align=center|5\n|align=center|5:00\n|Paris, France\n|\n|-\n|Win\n|align=center|11–2\n|Charlie Ward\n|Decision (unanimous)\n|Bellator 287\n|\n|align=center|3\n|align=center|5:00\n|Milan, Italy\n|\n|-\n|Win\n|align=center|10–2\n|Lyoto Machida\n|KO (elbow and punches)\n|Bellator 281\n|\n|align=center|1\n|align=center|3:18\n|London, England\n|\n|-\n|Loss\n|align=center|9–2\n|Austin Vanderford\n|Decision (unanimous)\n|Bellator 259\n|\n|align=center|3\n|align=center|5:00\n|Uncasville, Connecticut, United States\n|\n|-\n|Loss\n|align=center|9–1\n|Costello van Steenis\n|Decision (split)\n|Bellator Milan 2\n|\n|align=center|3\n|align=center|5:00\n|Milan, Italy\n|\n|-\n|Win\n|align=center|9–0\n|Mike Shipman\n|Decision (split)\n|Bellator London 2\n|\n|align=center|3\n|align=center|5:00\n|London, England\n|\n|-\n|Win\n|align=center|8–0\n|Jonathan Bosuku\n|Decision (unanimous)\n|Bellator 223\n|\n|align=center|3\n|align=center|5:00\n|London, England\n|\n|-\n|Win\n|align=center|7–0\n|Falco Neto\n|TKO (upkicks and punches)\n|Bellator Birmingham\n|\n|align=center|1\n|align=center|3:51\n|Birmingham, England\n|\n|-\n|Win\n|align=center|6–0\n|Lee Chadwick\n|Decision (unanimous)\n|Bellator Newcastle\n|\n|align=center|3\n|align=center|5:00\n|Newcastle, England\n|\n|-\n|Win\n|align=center|5–0\n|Claudio Conti\n|TKO (body kick)\n|BAMMA 35\n|\n|align=center|1\n|align=center|1:00\n|Dublin, Ireland\n|\n|-\n|Win\n|align=center|4–0\n|Kent Kauppinen\n|Submission (armbar)\n|BAMMA 34\n|\n|align=center|1\n|align=center|4:52\n|London, England\n|\n|-\n|Win\n|align=center|3–0\n|Louis King\n|Submission (rear-naked choke)\n|BAMMA 33\n|\n|align=center|1\n|align=center|1:15\n|Newcastle, England\n|\n|-\n|Win\n|align=center|2–0\n|Aaron Kennedy\n|Submission (rear-naked choke)\n|BAMMA 30\n|\n|align=center|2\n|align=center|0:44\n|Dublin, Ireland\n|\n|-\n|Win\n|align=center|1–0\n|Rafał Cejrowski\n|KO (flying knee)\n|Bellator 179\n|\n|align=center|1\n|align=center|3:44\n|London, England\n|\n|-\nSee also\n* List of current Bellator MMA fighters\n* List of male mixed martial artists\nReferences\nExternal links\n*\n*"
    }
  ]
}