{
  "content": [
    {
      "type": "text",
      "text": "# Faculty of Agriculture, University of Peradeniya\n\n|}}\nFaculty of Agriculture, University of Peradeniya is one of the nine faculties of University of Peradeniya and the oldest agriculture faculty in Sri Lanka. It conducts undergraduate programs and the Post-graduate Institute of Agriculture, which is affiliated to the faculty conducts graduate programs in the field of agriculture.\nFaculty operates in two locations as main administration buildings are situated in the main campus of University of Peradeniya and a separate sub-campus is located in Mahailuppallama, North Central province of Sri Lanka. It was established in 1947 with an initial batch of 16. Mahailuppallama sub-campus was established in 1968.\nPrograms\n* B.Sc. Degree in Agricultural Technology & Management\n* B.Sc. Degree in Food Science & Technology\n* B.Sc. Degree in Animal Science And Fisheries\nFarms\n*A livestock field station is located at Mawela, about 1.5&nbsp;km from the faculty. It serves undergraduate training and research. The station maintains European dairy cattle, buffaloes, broilers, swine, ducks, goats, rabbits, guinea pigs and micro livestock.\n*An experimental station is located at Dodangolla, 20&nbsp;km from the faculty. This farm occupies 83 hectares of productive land.\n*The Department of Agricultural Engineering maintains a farm at Meewathura, by the Mahaweli River.\nDeans of the faculty\n* Prof. P. Seneviratne (1966-1972)\n* Prof. R.R. Appadurai (1973-1978)\n* Prof. T. Jogaratnam (1978-1978)\n* Prof. Y.D .A. Senanayake(1978-1982)\n* Prof. H.P.M. Gunasena (1982-1987) & (1988-1994)\n* Prof. M.W. Thenabadu (1987-1988)\n* Dr. M.W.A.P. Jayatilake (1994-1997)\n* Prof.K.G.A.Goonesekera (1997-2000)\n* Prof.E.R.N.Gunawardena (2000-2003)\n* Prof.B. Marambe (2003-2009)\n* Prof.K. Samarasinghe (2009-2015)\n* Prof. D.K.N.G. Pushpakumara (2015-2021)\n* Prof. S.S. Kodithuwakku (2021–Present)\nCentres\n*Agribusiness Centre (AbC)\n*Agricultural Biotechnology Centre (AgBC)\n*Clean Development Mechanism (CDM) Study Centre\n*Soil Survey Laboratory & SRICANSOL Resource Centre\nReferences\nExternal links\n*[http://agri.pdn.ac.lk/ Official website]"
    }
  ]
}