{
  "content": [
    {
      "type": "text",
      "text": "# Fairmont Century Plaza\n\n| start_date       =\n| completion_date  =\n| building_type    = Hotel\n| antenna_spire    =\n| roof             =\n| top_floor        =\n| floor_count      = 19\n| rooms            = 400\n| elevator_count   =\n| cost             =\n| floor_area       =\n| architect        = Minoru Yamasaki\n| structural_engineer =\n| main_contractor  =\n| developer        =\n| owner            = Next Century Associates\n| management       = Fairmont Hotels and Resorts\n| references       =\n}}\nThe Fairmont Century Plaza is a 19-story luxury hotel in Century City, Los Angeles, US. The hotel fronts the Avenue of the Stars, adjacent to the twin Century Plaza Towers and the 2000 Avenue of the Stars complex. At the time of its opening in 1966, the hotel was the highest building in Century City, with views extending all the way to the Pacific Ocean. It was also the first hotel to have color televisions in all of its rooms. The hotel closed for renovations in 2016, and reopened on September 27, 2021, operated by Fairmont Hotels and Resorts. It is a member of Historic Hotels of America. The hotel was formerly known as The Century Plaza Hotel.\nHistory\nIn 1961, developer William Zeckendorf and Alcoa bought about  from 20th Century Fox after the studio had suffered a string of expensive film flops, culminating in the box-office disaster Cleopatra. Century City was built as \"a city within a city\" with the arc-shaped, 19-story, 750-room Minoru Yamasaki-designed Century Plaza as the centerpiece.\nWhen the Century Plaza began operating in 1966, its doormen wore red Beefeater costumes. The hotel was managed by Western International Hotels, which later changed its name to Westin Hotels. The hotel's ballrooms became the center for numerous high-profile events, including an opening charity gala in 1966 with Bob Hope as master of ceremonies, who with singer Andy Williams entertained Ronald and Nancy Reagan and Walt and Lillian Disney. In 1967, 1,300 club-swinging police clashed with about 10,000 anti-Vietnam War demonstrators as President Johnson spoke at a Democratic fundraiser at the hotel. On August 13, 1969, President Richard Nixon hosted a lavish state dinner in the Los Angeles Ballroom to celebrate the Apollo 11 Moon landing astronauts.\nIn 1984, the hotel added a 322-room tower on the south portion of the property, adjacent to Olympic Boulevard. The Tower at Century Plaza was marketed as a luxury wing of the hotel and increased capacity to 1,072 rooms. Ronald Reagan by arrangement signed in as the first guest of the newly completed Tower on December 27, 1984. In 1999 the hotel rededicated its penthouse suite comprising the entire 32nd floor the Ronald Reagan Suite. While Reagan was in office, he stayed in the Tower so frequently the media dubbed it his Western White House. President Reagan had recently celebrated his re-election to a second term as President on the stage of the Los Angeles Ballroom in the original Century Plaza Hotel on November 6, 1984. In 2000, soon after Westin was acquired by Starwood, the Tower was converted into a separate hotel under a more luxurious Starwood brand, The St. Regis Los Angeles. That hotel was then sold by the owners of the Century Plaza in 2005 to developers who closed it for conversion to residential use. With its 1980s ceilings too low to meet modern residential demands, the relatively new building was razed to make way for The Century, a high-rise condominium completed in fall 2009.\nIn 2006, after being managed for its entire forty-year history by Westin Hotels, the property was taken over by Hyatt Hotels and renamed Hyatt Regency Century Plaza. However, the sign above the main entrance reading The Century Plaza was left unchanged.\nSunstone Hotel Investors Inc. bought the Hyatt Regency Century Plaza in 2005 for US$293 million and then spent $22 million upgrading the guest rooms and common areas. On June 1, 2008, Sunstone sold the Hyatt Regency Century Plaza to Next Century Associates for $366.5 million,  $505,000 per room, one of the highest paid for a hotel in California. On December 18, 2008, the new owners announced plans to demolish the hotel and build a pair of fifty-story towers in its place. On April 28, 2009, The Century Plaza Hotel was added to The National Trust for Historic Preservation's list of the 11 most endangered historic places in America. In February 2010, the developer announced that it would renovate the historic hotel building and convert some of the floors to condominiums, rather than demolishing and replacing the building as previously proposed.\n2016-21 Renovations & Residential Twin Towers Addition\nThe hotel closed on March 1, 2016 to begin the $2.5 billion overhaul. It ceased to be operated by Hyatt at this time. The two residential towers (named Century Plaza North Tower and Century Plaza South Tower) that were to replace the hotel were, instead, built behind it. Designed by Pei Cobb Freed, Gensler, and Marmol Radziner, they contain 268 condominiums. The original 726-room hotel tower was rebuilt with 400 much larger guest rooms and 63 condominiums. The hotel reopened on September 27, 2021 as the Fairmont Century Plaza, managed by Fairmont Hotels and Resorts. The Fairmont Century Plaza was then inducted into Historic Hotels of America, a program of National Trust for Historic Preservation, in 2022.\nIn 2026, Century City station on the D Line will open nearby at the intersection of Avenue of the Stars and Constellation Boulevard.\nNotable people and events\nand then-governor of California Ronald Reagan meeting in the President's Suite in 1974]]\nThe Century Plaza has played host to various celebrities, foreign dignitaries, and presidents; among them, Marshal Josip Broz Tito, Moshe Dayan, Lyndon Johnson, Ronald Reagan, Prince Philip, and David Ben-Gurion. The hotel was the venue for the 1967 Emmy Awards, and the 1970 and 1971 Grammy Awards. It was also the venue for the 2009 and 2010 Visual Effects Society's prestigious annual awards ceremony. In early\n2022 the newly re-opened Hotel hosted the Academy Awards Nominees lunch, the Critics Choice awards, and the Producers Guild Awards honouring George Lucas.\nIn popular culture\nThe Century Plaza Hotel's dramatic curved facade is seen in the 1980 film, 9 To 5, both from a distant establishing shot and from one of the balconies, when the character Missy Hart is staying in the hotel.\nThe Century Plaza Hotel is featured in the 2008 video game, Midnight Club: Los Angeles, and is mimicked in the 2004 video game, Grand Theft Auto: San Andreas.\nReferences\nExternal links\n* [https://fairmontcenturyplaza.com/ Fairmont Century Plaza official website]\n* [https://www.thecenturyplaza.com/ Century Plaza condominiums official website]\n* [http://www.seeing-stars.com/Hotels/CenturyPlaza.shtml Seeing-stars.com: Los Angeles Landmarks, Century Plaza Hotel]\n* [http://www.laconservancy.org/centuryplaza/index.php Los Angeles Conservancy: \"The Century Plaza Hotel history and its planned demolition\" article]\n* [http://www.latimes.com/entertainment/news/la-et-century-city1-2009jun01,0,1259194.story  Los Angeles Times'.com: \"Century Plaza as L.A. Statement\"]−(June 1, 2009)\n* [https://businessimagegroup.com/century-plaza-hotel/ Story of the Century Plaza Hotel and the making of the Ronald Reagan Suite at the Century Plaza Tower] — ''exhibit with photos celebrating the hotel's 30th anniversary and the 1926 construction of Fox Studios' 70th anniversary (1996)''."
    }
  ]
}