{
  "content": [
    {
      "type": "text",
      "text": "# Faisal Subzwari\n\n| native_name         = سید فیصل علی سبزواری\n| native_name_lang    = ur\n}}\nSyed Faisal Ali Subzwari (Urdu: سید فیصل علی سبزواری; born 4 August 1975) is a Pakistani politician and senior leader of Muttahida Qaumi Movement – Pakistan (Khalid Maqbool Group). He was elected as a member of the Provincial Assembly of Sindh on the ticket of MQM-P in 2013 Pakistani general election and has served as the opposition leader in Sindh Assembly.\nPolitical career\nFaisal Subzwari started his political career as leader of All Pakistan Muttahida Students Organisation, the student wing of Muttahida Qaumi Movement. In the 2002 Pakistani general election, he was elected as a member of the Provincial Assembly of Sindh on the ticket of MQM from Karachi.\nIn the 2008 Pakistani general election, Faisal Subzwari was elected as a member of the Provincial Assembly of Sindh on the ticket of MQM from Karachi and served as minister of Youth Affairs in Government of Sindh as well was the deputy parliamentary leader of MQM in Sindh Assembly during the tenure.\nAfter the 2013 Pakistani general election, Faisal Subzwari was again elected as a member of the Provincial Assembly of Sindh on the ticket of MQM from Karachi and was made MQM's parliamentary leader in Sindh Assembly. He has served as opposition leader. He was also the adviser to the Chief Minister of Sindh on Youth Affairs.\nFaisal Subzwari was absent from politics since July 2015. Later, he tweeted he will join politics soon after his return to country. He was on holidays with his family in U.S.A.\nSubzwari, who is usually vocal on the media, was in the US for sometime and his absence from the political scene had raised questions.\nOn 3 March 2021, he was elected as a member of Senate of Pakistan in the 2021 Pakistani Senate election from Sindh.\nPolitical background\nFaisal Subzwari started his political career soon after completing his Higher Secondary Education. His uncle was a member of MQM (led by Mr Altaf Hussain) and was elected and served as a councillor from 1987 to 1992, He was allegedly detained by plainclothes police on 6 July 1995, however, the case was never officially taken up. In 1997, the family tried to lodge a First Information Report (FIR), but could not proceed against the police officer and was given a \"cold shoulder\".\nExpulsion from MQM-London\nIn October 2016, after creation of MQM-Pakistan, Faisal Subzwari along with other party workers were expelled by MQM-London led by Altaf Hussain due to violation of party rules. He also refused to be recognised as a Muhajir on the Sindh Assembly floor, and supported a resolution for treason charges against MQM's founder and leader Altaf Hussain.\nReferences"
    }
  ]
}