{
  "content": [
    {
      "type": "text",
      "text": "# Faking a Murderer\n\n| runtime        = 96 minutes\n| country        = Canada\n| language       = English\n}}\nFaking a Murderer is a Canadian mockumentary film, directed by Stuart Stone and released in 2020. An affectionate parody of the true crime genre, the film stars Stone and his filmmaking partner and brother-in-law Adam Rodness as themselves, trying to make a true crime documentary about their efforts to track down David Stoner, a man they have found seemingly confessing to murders in a series of bloody internet videos.\nAt the outset of the project, Stone and Rodness made a number of short videos with actor Tony Nappo playing David Stoner in grisly, bloody scenarios that were deliberately ambiguous about whether they represented murders or not, and posted them to a private YouTube channel. From there, they proceeded to pitch the project as if the videos were real, in order to get genuine unscripted reactions out of their friends and family, the police, and executives for Breakthrough Entertainment and Hollywood Suite; only once they're out on Stoner's trail do fictionalized scenes, scripted and performed by actors, begin to enter the narrative.\nThe film premiered on October 14, 2020, on Hollywood Suite, as part of the channel's Shocktober lineup of Hallowe'en horror programming. It screened at various international horror film festivals, and was released to international video on demand platforms, in 2021.\nCritical response\nBobby LePire of Film Threat wrote that the film's mix of horror and comedy tones don't always mesh together neatly, but concluded that the film \"ultimately proves worthy of a recommendation. Rodness and Stone are smart enough to understand that a story such as this can only have one inevitable conclusion. As a result, they don’t try to pull the rug out from under viewers, and the final few minutes generate what is probably the largest belly laugh of the entire production.\"\nThe film's production and release earned Stone and Rodness a reputation as pranksters; in November 2021, when a truck containing approximately $250,000 worth of production equipment was stolen from the set of their 2022 narrative comedy film Vandits, they were widely believed at first to have staged a publicity stunt.\nReferences\nExternal links\n*"
    }
  ]
}