{
  "content": [
    {
      "type": "text",
      "text": "# Fall Brawl '95: War Games\n\n|lastevent  = Collision in Korea\n|nextevent  = Halloween Havoc\n|event      = Fall Brawl\n|lastevent2 = 1994\n|nextevent2 = 1996\n}}\n'''Fall Brawl '95: War Games''' was the third Fall Brawl professional wrestling pay-per-view (PPV) event produced by World Championship Wrestling (WCW). It took place on September 17, 1995 from the Asheville Civic Center in Asheville, North Carolina. As of 2014 the event is available on the WWE Network.\nFall Brawl '95 was the first WCW PPV of the Monday Night War era of September 4, 1995 to March 26, 2001, during which WWF Monday Night Raw/WWF Raw Is War and WCW Monday Nitro competed for ratings in a weekly Monday night time slot, which is now widely seen in retrospect as having been a \"golden age\" of pro wrestling.\nProduction\nBackground\nThe WarGames match was created when Dusty Rhodes was inspired by a viewing of Mad Max Beyond Thunderdome. It was originally used as a specialty match for the Four Horsemen. The first WarGames match took place at The Omni in Atlanta during the NWA's Great American Bash '87 tour, where it was known as War Games: The Match Beyond. It became a traditional Fall Brawl event from 1993 to 1998.\nStorylines\nThe event featured professional wrestling matches that involve different wrestlers from pre-existing scripted feuds and storylines. Professional wrestlers portray villains, heroes, or less distinguishable characters in the scripted events that build tension and culminate in a wrestling match or series of matches.\nEvent\n{| class=wikitable style=\"font-size:90%; margin: 0.5em 0 0.5em 1em; float: right; clear: right;\"\n|+ Other on-screen personnel\n!Role:\n!Name:\n|-\n|rowspan=2|Commentators\n|Tony Schiavone\n|-\n|Bobby Heenan\n|-\n|Interviewer\n|Gene Okerlund\n|-\n|rowspan=2|Ring announcers\n|Michael Buffer\n|-\n|David Penzer\n|-\n|rowspan=2|Referees\n|Randy Anderson\n|-\n|Nick Patrick\n|}\nThe pre pay-per-view portion of the show was broadcast live on WCW Main Event. During Main Event Eddy Guerrero made his WCW television debut in a match against Alex Wright. The match ended when Wright requested that referee Nick Patrick stop the match after Guerrero suffered an injury. The #1 contender for the WCW United States Championship match between Johnny B. Badd and Brian Pillman originally ended in a 20-minute time limit draw, but the referee allowed the contest to continue until there was a winner. Before Cobra's match against Sgt. Craig Pittman, an army cadet came to ringside to deliver a message from Pittman. Pittman then made his entrance by rappelling from the top of the arena, and attacking Cobra from behind.\nIn the next match for the WCW TV Title, Diamond Dallas Page beat the Renegade, after Maxx Muscle held Renegades leg for Page to hit the Diamond Cutter. In the WCW Tag-Team Title, while Nick Patrick was trying to settle the fight between Bunkhouse Buck and Booker T, Col. Robert Parker & Sherri decided to get in the ring & solidify their Relationship by kissing each other.  Because of this, the Nasty Boys came in and hit Dick Slater with his own Boot to help Harlem Heat regain the World Tag-Team Titles. Sherri and Parker stopped kissing whenever Buck pulled Parker away from Sherri and then Sherri too had to explain what happened or more importantly why she kissed Parker and she claimed it was pretend. She got out of the ring as she continued explaining herself, and that's whenever they showed the replay, which whenever you look at it, they (Parker and Sherri) looked like they just won the lottery than the replay made it look even more like Sherri wasn't telling Harlem Heat the truth. To sum up the post interview segment, Col. Parker declared he'd get his Team another Title match but also declared his love for Sherri and that he had to stay with her.\nIn Ric Flair's match with Arn Anderson, Arn Anderson hit the DDT on Ric Flair after Flyin' Brian Pillman kicked Ric Flair in the back of the head. As a result of this, they ended up having Ric Flair feud with both Pillman and Anderson.  As a result of his team winning the WarGames Match Hulk Hogan got five minutes alone in the cage with The Taskmaster. During those five minutes, The Giant interrupted and attacked Hogan, injuring his neck. In the match Lex Luger was a replacement for Vader, who had left the promotion a week prior to the event. The substitution was announced on the previous Monday Nitro.\nResults\n|note1=pre\n|match1= Big Bubba Rogers defeated Mark Thorn\n|stip1=Singles match\n|time1=01:04\n|note2=pre\n|match2=Disco Inferno defeated Joey Maggs\n|stip2=Singles match\n|time2=02:33\n|note3=pre\n|match3=Alex Wright vs. Eddy Guerrero ended in a no-contest\n|stip3=Singles match\n|time3=06:36\n|note4=pre\n|match4=The American Males (Marcus Bagwell and Scotty Riggs) defeated The Nasty Boys (Brian Knobbs and Jerry Sags)\n|stip4=Tag team match\n|time4=04:15\n|match5=Johnny B. Badd defeated Brian Pillman\n|stip5=Singles match\n|time5=29:14\n|match6=Craig Pittman defeated Cobra\n|stip6=Singles match\n|time6=01:22\n|match7= Diamond Dallas Page (with The Diamond Doll and Max Muscle) defeated The Renegade (c)\n|stip7=Singles match for the WCW World Television Championship\n|time7=08:07\n|match8=Harlem Heat (Booker T and Stevie Ray) (with Sister Sherri) defeated Bunkhouse Buck and Dick Slater (c) (with Col. Robert Parker)\n|stip8=Tag team match for the WCW World Tag Team Championship\n|time8=16:49\n|match9= Arn Anderson defeated Ric Flair\n|stip9=Singles match\n|time9=22:37\n|match10=Hulk Hogan, Randy Savage, Lex Luger and Sting (with Jimmy Hart) defeated The Dungeon of Doom (Kamala, The Zodiac, The Shark and Meng) (with The Taskmaster)\n|stip10=WarGames match\n|time10=18:47\n}}\nReferences"
    }
  ]
}