{
  "content": [
    {
      "type": "text",
      "text": "# Famine in Travancore during World War II\n\nFamine during World War II was a severe food crisis in the princely state of Travancore (now part of Kerala, India) between 1942 and 1944, peaking in 1943, causing widespread malnutrition and an estimated 90,000 excess deaths.\nBackground\nTravancore’s late 19th and early 20th-century economic transformation into a cash crop economy (tea, rubber, cardamom, coir) increased dependence on rice imports, primarily from Burma. The Japanese conquest of Burma in 1942 cut off Travancore’s main rice supply. Combined with wartime logistic constraints and inter-regional supply competition across British India, this precipitated severe shortages in Travancore.\nEconomic transformation and import dependence\nCash cropping replaced local subsistence rice cultivation, embedding vulnerability to external conditions through reliance on imported rice via Indian seaports and Burma.\nWartime disruptions after the fall of Burma\nThe 1942 fall of Burma severed the primary rice source. Competing wartime demands from Ceylon, Cochin, and other deficit regions stressed remaining supplies, leading to price rises and scarcity.\nLocal substitutes and limitations\nTapioca was promoted as a famine substitute but did not prevent widespread malnutrition and mortality.\nOnset and chronology\nEarly signs in 1942\nAdministrative and missionary reports cite increasing distress and scarcity following rice import collapse in late 1942.\nPeak crisis in 1943\nSevere scarcity culminated in famine-like conditions, with widespread hunger, starvation deaths, and disease outbreaks. Estimated excess mortality reached about 90,000.\nContinued distress in 1944\nProcurement and rationing tightened, but incomplete records and prevailing wartime censorship left many deaths unrecorded.\nCauses\nStructural dependence and supply shock\nThe abrupt loss of Burmese rice and redirected demand to Indian mainland producers created acute shortages in Travancore.\nPolicy and administrative factors\nThe Diwan of Travancore, C. P. Ramaswami Iyer, implemented a series of reactive measures including permits, stock declarations, and eventually centralized rationing. Implementation was hampered by delays, evasion, and inadequate ration levels.\nMarket disruptions and employment shocks\nBlack market activities and collapse of key trades (e.g., coir exports) worsened purchasing power, augmenting food insecurity.\nMortality and health impacts\nSevere malnutrition increased vulnerability to diseases such as cholera and smallpox, which contributed to excess deaths. Parish records estimate about 90,000 deaths from 1942 to 1944.\nGovernment response\nTravancore’s initial regulatory approach relying on permits and trader self-reporting failed to control prices. Later stages saw centralization of procurement and rationing, but ration quotas remained low and leakages were significant. Neighboring Cochin adopted firmer and timelier procurement policies.\nComparison with Bengal and official inquiries\nThe Bengal famine of 1943 caused far higher absolute mortality, but Travancore’s proportional losses were significant. The 1945 Famine Inquiry Commission focused mainly on Bengal and lacked sufficient data to classify Travancore’s crisis formally as a famine.\nSocial and political consequences\nWartime scarcity delegitimized the princely regime and catalyzed leftist political mobilization, contributing to the rise of communism in Kerala. Public memory of the famine remained muted for decades compared to Bengal.\nHistoriography\nRecent research reconstructs mortality and policy responses, challenging narratives minimizing the crisis based on tapioca substitution. Lack of official statistics necessitates reliance on alternative sources.\nSee also\n*Travancore\n*Kingdom of Cochin\n*Kerala\n*Bengal famine of 1943\n*India in World War II\n*C. P. Ramaswami Iyer\n*Punnapra-Vayalar uprising\n*Food security in India\nNotes\nReferences\nFurther reading\n*\n*\n*\n*\n*\nExternal links\n*[https://www.cambridge.org/core/services/aop-cambridge-core/content/view/BB804EA24281112CC57ACAAADDB5BFD2/S0026749X21000706a.pdf Full-text PDF of Balasubramanian (2023)]\n*[https://www.theindiaforum.in/history/forgotten-famine-and-rise-communism-kerala The India Forum essay]"
    }
  ]
}