{
  "content": [
    {
      "type": "text",
      "text": "# Family Kingdom Amusement Park\n\n| theme           =\n| homepage        =\n| owner           =\n| general_manager =  Donald Sipes (since 1993)\n| operator        =\n| opening_date    =  1966\n| closing_date    =\n| previous_names  =  Grand Strand Amusement Park (1966 – 1991)\n| season          =  Early April through Early October\n| visitors        =\n| area            =\n| rides           =   37\n| coasters        =   3\n| water_rides     =\n| other_rides     =\n| shows           =\n| slogan          =\n| status          =   Operating\n| footnotes       =\n}}\nFamily Kingdom Amusement Park is a seaside amusement park in Myrtle Beach, South Carolina. Located on Ocean Boulevard in Myrtle Beach, the amusement park has 37 rides for adults and children of all ages, including thrill rides, family rides, kiddie rides and go karts. In 2008 TripAdvisor ranked it at number five on its list of the top 10 amusement parks outside Orlando.\nIn business for more than 40 years, the park has the 2,400 foot, figure eight Swamp Fox wooden roller coaster, which is one of roughly one hundred wooden roller coasters still operating in North America  and ranked number 10 on About.com's list of the top 10 most underrated roller coasters in North America. In 2016, American Coaster Enthusiasts marked the 50th anniversary of the Swamp Fox by adding a historical marker. The Swamp Fox was also declared a historic structure by the city in March 2017.\nOther signature rides include O.D. Hopkins Log Flume, Great Pistolero Round-up and the Giant Wheel.\nFamily Kingdom's \"Giant Wheel\" Ferris wheel has round open gondolas that give a 100-foot-high view of Myrtle Beach and the Atlantic Ocean. For 19 years, until 2011, it reigned as the highest Ferris wheel in the state\nThere is no admission price to enter the open park. Ride tickets can be purchased independently. Wristbands that entitle patrons to ride all day are available. The park provides free entertainment such as clowns, magicians, jugglers, stilt walkers, face painters and balloon sculptors. Family Kingdom Amusement Park is located on both banks of historic Withers Swash. The swash is a point where a natural stream meets the beach and ocean, and through which tides flow. Much of the surrounding area was part of a 66,000-acre king's grant to Robert Francis Withers in the early 1700s, who operated it as an indigo plantation overlooking the swash.\nFamily Kingdom Amusement Park is approximately 13 acres.\nHistory\nFamily Kingdom Amusement Park opened as Grand Strand Amusement Park in 1966. The park was purchased by the Ammons family in 1992 and renamed “Family Kingdom Amusement Park”.\nCountry music star Kenny Chesney shot part of his \"Anything but Mine\" music video at Family Kingdom in 2005.\nSplashes Oceanfront Water Park\n}}\nSplashes Oceanfront Water Park, originally known as Wild Rapids, was a water park attraction in Myrtle Beach, South Carolina. A two-acre facility with 500 feet of Atlantic Ocean frontage, it was located across Ocean Boulevard from Family Kingdom Amusement Park.\nThe park's attractions included a lazy river with waterfalls, water flumes, and eight kiddie slides. In 2007, TripAdvisor named Family Kingdom and Splashes number five on its list of the top 10 amusement parks outside Orlando.\nThe park was located at 300 South Ocean Boulevard. It had 18 attractions, including two enclosed body waterslides, two speed slides, two open flume slides, and an enclosed flume slide; a children's area that includes splash pools, eight kiddie slides, two rain trees, and a play pool with a multi-tiered waterfall.\nHistory\nThe park first opened under the name \"Wild Rapids\" in 1977.  In 1997, Family Kingdom Amusement Park purchased the water park, expanded the water attractions, and renamed it \"Family Kingdom Water Park\".  In 2013, the water park was renamed \"Splashes Oceanfront Water Park\".\nIn 2022, the waterpark was permanently closed and demolished after Family Kingdom was purchased by new owners.\nCurrent rides\nRoller coasters\nFamily Kingdom features three different roller coasters. The oldest is Swamp Fox.\n{| class=\"wikitable\"\n|-\n!Name!!Manufacturer !!Type!!Design!!Year opened\n!Description\n|-\n|Swamp Fox||Philadelphia Toboggan Coasters; Designed by John Allen||Wooden||Sitdown||1966\n| The oldest roller coaster in the park, which features 2,400 foot, figure eight wooden roller coaster, which is one of only 122 wooden roller coasters operating in North America.  and ranked number 10 on About.com's list of the top 10 most underrated roller coasters in North America.\n|-\n|Twist ‘n’ Shout||Zamperla||Steel||Sitdown|||2014\n|A steel roller coaster with several sharp turns and big dips. Previously operated at Magic Springs and Crystal Falls as Twist ‘n’ Shout from 2000 to 2012 and first opened at Gillian’s Wonderland Pier as Wild Wonder.\n|-\n|Dragon Coaster||Jung-Max Rides||Steel||Sitdown||2023\n|A small dragon themed roller coaster meant for children with a small drop, a few hills and a few non-banked turns.\n|}\nOther rides\n{| class=\"wikitable sortable\"\n|-\n! Name !! Year opened !! Manufacturer !! Model !! Description\n|-\n|Carousel\n|1923\n| Philadelphia Toboggan Company\n| Carousel\n| An antique carousel from the Philadelphia Toboggan Company.\n|-\n|Antique Cars\n|1969\n| Arrow Development\n| Electric Cars\n| An antique car ride. Features Electric- powered cars that go along a track.\n|-\n|Bumper Boats\n|1969\n| Arrow Development\n| Bumper Boats\n| A water-based bumper ride. The small boats can hold one or two people and have oversized fenders that resemble a large tractor tire inner tube\n|-\n|Train\n|1970\n|Crown Metal Products\n|Train\n|A train ride that takes riders around the park.\n|-\n| Yo-Yo\n| 1980\n| Chance Rides\n| Chair-O-Plane\n| This ride is a swing ride that is a variation on the carousel in which the seats are suspended from the rotating top of the carousel.\n|-\n|Ferris Wheel\n|1990\n|Chance Rides\n|Ferris Wheel\n|A 100-foot tall ferris wheel ride where riders can get a panoramic view of the park.\n|-\n| Hurricane\n| 1990\n| Moser's Rides\n| Music Express\n| A quick circular ride that travels clockwise around an undulating track.\n|-\n| Tilt-A-Whirl\n| 1993\n| Larson\n| Tilt-A-Whirl\n| The ride consists of seven freely-spinning cars that hold three or four riders each, which are attached at fixed pivot points on a rotating platform. As the platform rotates, parts of the platform are raised and lowered, with the resulting centrifugal and gravitational forces on the revolving cars causing them to spin in different directions and at variable speeds.\n|-\n| The Great Pistolero Roundup\n| 1995\n| Sally Dark Rides\n| Quick Draw (interactive dark ride)\n|A two-passenger, interactive dark ride themed to a gold robbery in a cartoonish-styled Mexico. Previously a Mexican restaurant located within the park.\n|-\n| Thunderbolt\n| 1995\n| Chance Rides\n| Flying Bobs\n| Similar to \"Hurricane\" but with suspended vehicles.\n|-\n| Galleon\n| 1998\n| Zamperla\n| Galleon\n| This is a boat suspended from a giant \"A\" frame structure. The boat swings back and forth until it achieves a height of 40 feet (12 m) and is at a 75-degree angle with its initial resting position, giving riders the sensation of weightlessness.\n|-\n|Log Flume Water Ride\n|1998\n| Hopkins\n| Log Flume\n| A log flume water ride and a water roller coaster, built in 1998 and consisting of two lifts, a spillway that is 20-feet (6 m), and a roller coaster track section.\n|-\n| Dodgems Bumper Cars\n| 2000\n| Duce\n| Bumper Cars\n| A classic bumper cars attraction\n|-\n|Kite Flyer\n|2001\n| Zamperla\n| Kite Flyer\n| This is a ride with vehicles in the shape of hang gliders that spins and tilts at a 50-degree angle.\n|-\n| F5\n| 2023\n| KMG\n| Freakout\n| A 69 ft (21 m) pendulum ride that swings around on am arm reaching 240- degrees at its maximum while riders sit in suspended seats while the ride vehicle spins while the arms swings.\n|}\nChildren’s rides\n{| class=\"wikitable\"\n|-\n! Name !! Year opened !! Manufacturer !! Model !! Description\n|-\n| 4 x 4 Big Trucks\n| 2000\n| Zamperla\n| Convoy\n| A kiddie ride with Truck-like carts and an oval track.\n|-\n| Canoes\n| 1966\n| Allan Herschell Company\n| Canoe\n|\n|-\n|Cycles\n| 1990\n| Hampton Amusements\n| Motorcycle Jump\n| Riders sit on little motorcycles that go around a small oval.\n|-\n|Flight School\n| 1998\n| Zamperla\n| Flying Tigers\n| This ride features 16 tiger shaped cars that travel along an oblong track and \"whip\" as they go around the bend at either end.\n|-\n|Frog Hopper\n| 2001\n|\n| Frog Hopper\n| A small drop tower meant for children.\n|-\n| Hampton Combo\n| 1988\n| Hampton Amusements\n| Umbrella ride\n| A kiddie ride with Firetruck shaped carts and an oval track.\n|-\n| Jump Around Buggies\n| 2009\n| Zamperla\n| Jump Around\n| This family ride has vehicles rotating around a core that features a colorful design theme.\n|-\n| Kiddie Speedway\n| 1990\n| Allan Herschell Company\n| Kiddie Speedway\n| Small race cars that travel on an oval track.\n|-\n| Kiddie Swing\n| 1990\n| Zamperla\n| Kiddie Swing\n| A small version of the Yo-Yo, although this ride does not lift or undulate.\n|-\n| Kiddie Wheel\n| 1999\n| Zamperla\n| Mini Ferris Wheel\n| A children's version of the Giant Wheel.\n|-\n| Magic Bikes\n| 2009\n| Zamperla\n| Magic Bikes\n| This ride has colorful vehicles with elevated seats and bicycle pedals.\n|-\n| Mini Bumper Cars\n| 2008\n| Zamperla\n| Mini Bumper Cars\n| A miniature bumper cars ride with cat-and-mouse–themed cars.\n|-\n| Mini Enterprise\n| 2009\n| Zamperla\n| Mini Enterprise\n| Riders steer a rocket ship.\n|-\n| Red Baron\n| 1966\n| Allan Herschell Company\n| Aeroplane\n| A small airplane type ride with 2 person vehicles.\n|-\n| Wet Boats\n| 1975\n| Allan Herschell Company\n| Boat ride\n|\n|}\nReferences\nExternal links\n*[http://www.FamilyKingdomFun.com Family Kingdom] official website\n*[https://www.familykingdomfun.com/water-park/ Family Kingdom – Splashes Oceanfront Water Park] official website\n*\n*"
    }
  ]
}