{
  "content": [
    {
      "type": "text",
      "text": "# Fantasy Empires\n\nFantasy Empire}}\nFantasy Empires is a role-playing fantasy wargame for MS-DOS made by Silicon Knights and published by Strategic Simulations in 1993. The game uses the Dungeons & Dragons license, and is set in the fictional world of Mystara.\nGameplay\nThe player is first tasked with creating a character along iconic Dungeons & Dragons roles. This persona serves as the leader of the army during battles, but does not fight. The main portion of the game is played on the 'strategic map'. In this portion of the game, the main tasks include expanding territory by invading and conquering provinces either neutral or enemy owned, constructing building improvements on provinces already owned, and hiring troops. Troops can only be hired if the appropriate buildings are constructed.\nApart from humans, the game also has provinces where orcs, dwarves, elves, halflings, and shadow elves can all be built as units in the army.\nThe game comes with a full view or fog of war option. The full view allows the entire world to be seen, while the fog of war only allows knowledge of adjacent kingdoms.\nThe AI uses a neural net.\nSome features of the game are making truces (the breaking of which could cause lawful or neutral characters to become chaotic), creating different types of heroes (fighter, dwarf, elf, magic user, cleric), setting the battle scale (from 20:1 to 1:1) and casting magic spells based upon the points derived from heroes (magic user, clerical, and druidic).\nMultiple battles with the same troops against 50 or more opponents could cause them to become veterans or even elites in rank.\nThe game comes with a number of NPC opponents, some of whom go all the way through the 36th level and present a formidable challenge.\nReception\nComputer Gaming World in 1994 stated that \"Fantasy Empires succeeds at all levels\", approving of the randomized countries and \"seamless integration\" of human and computer opponents. The game was reviewed in 1994 in Dragon #207 by Sandy Petersen in the \"Eye of the Monitor\" column. Petersen gave the game 3 out of 5 stars. A review in the German computer gaming magazine POWERPLAY 12/1993 rated 61% for the original 1993 floppy disk version.\nAccording to GameSpy, \"Fantasy Empires was a solid and fun strategy game, as well as an oddly forgotten credit for an excellent developer\".\nReferences\nExternal links\n*"
    }
  ]
}