{
  "content": [
    {
      "type": "text",
      "text": "# Farooqui dynasty\n\n||none}}\n| image_map_caption      = Khandesh Sultanate in the 1526, with neighbouring polities, on the eve of the establishment of the Mughal Empire.\n| religion               = Sunni Islam\n| capital                = AsirgarhBurhanpur\n| government_type        = Sultanate\n| legislature            =\n| title_leader           = Sultan\n| leader1                = Malik Raja\n| year_leader1           = 1382 –1399\n| leader2                = Bahadur Khan\n| year_leader2           = 1597–1601\n| common_languages       = Persian, Marathi, Deccani Urdu, and Ahirani\n| today                  = India\n}}\nThe Farooqi dynasty (also spelt Farooqui, Faruqi), also known as the Farooq Shahi dynasty, was a ruling Arab dynasty of the Khandesh Sultanate (named after the Khandesh region) from its inception in 1382 till its annexation by the Mughal emperor Akbar in 1601. The founder of the dynasty, Malik Ahmad (also known as Malik Raja) participated in a rebellion against the Bahmani ruler Muhmmad Shah I in his early years. When he was compelled to flee from Deccan, he established in Thalner on the Tapti River (in present-day Dhule district in Maharashtra). After receiving the grant of the fiefdoms of Thalner and Karanda (the present day Karwand, 19&nbsp;km north of Thalner) from Firuz Shah Tughluq in 1370, he conquered the region around Thalner, which later became known as Khandesh (the land of the Khans). By 1382, he started ruling independently.\nMalik Raja claimed his descent from the second Caliph Umar-al-Faruq. Hence, the dynasty founded by him was known as Faruqi dynasty. The next ruler, Nasir Khan conquered the Asirgarh fort and made it his capital. He founded the new capital Burhanpur in 1399.\nThe most illustrious ruler of the Farooqi dynasty is considered Adil Khan II. During his long reign, Burhanpur was transformed to a major centre for trade and textile production. In 1599, Akbar's army occupied Burhanpur and on January 17, 1601, the citadel of Asirgarh also fell after a long siege. The last ruler Bahadur Shah surrendered to the Mughals. Khandesh became a Mughal Subah.\nHistory of Farooqui dynasty\nMalik Ahmad Farooqui\nin Burhanpur District in Madhya Pradesh (formerly part of Khandesh Region under Farooqi Rulers), India]]\n}}\nMalik Raja claimed his descent from the second Caliph Umar-al-Faruq. Hence, the dynasty founded by him was known as Faruqi dynasty. The ancestors of Malik Ahmad belonged to a ruling family of Khorasan, one of the prominent rulers of the family was Abu Bin Adham or Sultan Ibrahim Bin Adham Balkhi, a famous muslim saint who gave up throne and became sufi. Some of its members escaped toward Dehli via Uch city (now in Pakistan) after conquest of Balakh in 1220 A.D by Genghis Khan. They were welcomed by Sultan Iltutmish of dehli and were counted amongst the most respectable nobles in the courts of Ala-ud-Din Khalji and Muhammad bin Tughluq because of their blue blood .\nMalik Raja's father Khan-i-Jahan or Khwaja e Jahan Faruqi was a minister in the Delhi court. In 1365, Malik Raja and some other chieftains of Berar and Baglana, joined a rebellion against the Bahmani ruler led by the governor of Daulatabad, Bahram Khan Mazindarani. It failed, and he was forced to flee from Deccan. He settled at Thalner. He helped Firuz Shah Tughluq during one of his hunting expeditions in Gujarat. In return he was first made an officer of two thousand horses and then in 1370, he was granted the fiefdoms of Thalner and Karanda. In the same year, he defeated the Raja of Baglana and forced him to agree upon paying annual tributes to the Delhi sultan. In exchange, Firuz Shah Tughluq gave him the title of Sipah-salar (governor) and raised him to the rank of a commander of three thousand horses. Within a few years he was able to muster twelve thousand horses and raise contributions from neighbouring rulers.\nBy 1382, he became a completely independent ruler of the Khandesh. At the time of his accession, Khandesh was a backward region populated by a few thousand Bhils and Kolis. The only prosperous area in Khandesh was Asirgarh, populated by the rich cowherds, Ahirs. One of the first acts of Malik Raja was taking steps to develop the agriculture in his kingdom.\nDuring his rule he was able to increase his area of control to such an extent that even the Gond Raja of Mandla was forced to pay tributes to him. Soon after his accession as an independent ruler, he attacked Gujarat and annexed Sultanpur and Nandurbar. Almost immediately, the governor of Gujarat Zafar Khan (Muzaffar Shah) retaliated and laid siege to Thalner. Malik Raja had to return all the territories annexed by him. He died on April 19 (April 28, according to Ferishta), 1399 and was buried in Thalner.\nSultan Nasir Khan Faroqi\nNasir Khan or Malik Nasir (also known as Garib Khan) was the elder son of Malik Raja, who succeeded him in 1399. He commenced his rule from Laling, as Thalner was under the control of his younger brother Malik Iftikar Hasan. Soon after his accession in 1400, he captured the fort of Asirgarh and killed its Hindu ruler. It became his capital till he shifted to Burhanpur, the new city founded by him. In 1417, with the help of Malwa sultan Hoshang Shah, he captured the fort of Thalner and imprisoned his brother Malik Iftikar (who was later granted asylum in Gujarat). Next, the combined forces of Khandesh and Malwa attacked Gujarat and occupied the Sultanpur fort. But soon, Gujarat sultan Ahmad Shah's general Malik Turk repulsed the attack and Thalner was besieged. After swearing fealty to the Gujarat sultan, the siege was raised and Ahmad Shah honoured Malik Nasir with the title of Khan.\nIn 1429, he married off his daughter to the Bahmani prince Ala-ud-Din (Ala-ud-Din Ahmad Shah II), son of Ahmad Shah I. In the same year, Raja Kanha of Jhalawar fled from Gujarat and took refuge to Asirgarh. Later on his advice, Raja Kanha went to Bidar to ask help from the Bahmani sultan Ahmad Shah I. After initial advances in Nandurbar by the Raja along with the legions of Khandesh and Bahmani army, the Gujarat army defeated the combined forces.\nIn 1435, Nasir Khan supported by the Raja of Gondwana and some discontented Bahmani officials attacked and captured Berar. The Bahmani governor fled to Narnala. In retaliation, the Bahmani sultan Ala-ud-Din Ahmad Shah II's army led by his general Malik-ut-Tujjar, first defeated him in Rohankhedaghat, then followed him to Burhanpur, ransacked the city and finally crushed his army in Laling. Nasir Khan died within a few days after this humiliating defeat on September 18 (September 19, according to Ferishta), 1437. He was also buried in Thalner.\nMiran Adil Khan Faroqi  I\nMiran Adil Khan succeeded his father Nasir Khan. After the army of Gujarat reached Sultanpur for his help, Malik-ut-Tujjar raised the siege and went back. He accepted the suzerainty of Gujarat sultanate. He was probably assassinated in Burhanpur on April 30, 1441. He also was buried in Thalner by the side of his father\nMiran Mubarak Khan Faroqi I\nMiran Mubarak Khan succeeded his father. He did not attempt any conquest, except two campaigns against the Raja of Baglana. He died on June 5 (May 17, according to Ferishta), 1457 and buried in Thalner.\nMiran Adil Khan Faroqi II\nMiran Adil Khan II, the eldest son of Miran Mubarak succeeded him. He was the most powerful ruler of the Khandesh Sultanate. He fortified Asirgarh and built the citadel of Burhanpur. After overpowering Gond Rajas of Gondwana and Mandla, he carried his conquest to Jharkhand and assumed the title of Shah-i-Jharkhand. He declared his independence from Gujarat and stopped paying tributes. As a result, in 1498 Gujarat army entered Khandesh. Unable to cope, Adil Khan II agreed to pay the arrears. He died on September 28, 1501 (April 8, 1503 according to Ferishta).  He was buried near his palace in Burhanpur.\nSultan Daud Khan Faroqi\nAs Adil Khan II died without any male issue, his younger brother Daud Khan succeeded him. Daud Khan was a weak ruler and dependent on two brothers, Hussain Ali and Yar ali. Hussain Ali was appointed his wazir and given the title of Malik Hisam-ud-Din. Due to his instigation, Daud decided to attack Ahmadnagar. But instead, the Ahmadnagar army marched into Khandesh. He asked sultan of Malwa to help him. Sultan of Malwa sent an army to dispel the army of Ahmadnagar but forced him to accept his subordination also. His uneventful rule ended with his death on August 28, 1508 (August 6, 1510 according to Ferishta).\nSultan Ghazni Khan Faruqi\nAfter the death of Daud Khan, his son Ghazni Khan succeeded him but ruled for only 10 days (or 2 days, according to Ferishta), as he was poisoned to death by Hisam-ud-Din.\nAlam Khan Faruqi\nWith the support of the rulers of Ahmadnagar and Berar, the nobles of Khandesh placed Alam Khan, a scion of Farooqi dynasty on the throne. But the Gujarat sultan Mahmud Shah I opposed him and supported the claim of Adil Shah, the great-grandson of Mailk Iftikar Hasan, brother of Malik Nasir and reached Thalner. Alam Khan had no other option but to flee from Burhanpur.\nMiran Adil Khan Faroqi III\nOn April 10, 1509, Adil Khan III was installed on the throne by Mahmud Shah I in Thalner and he assumed the title of Azim Humayun. Adil Khan III after shifting to Burhanpur sent Hisam-ud-Din to Thalner. On suspecting complicity on his part, he was called to Burhanpur and was killed outside the court. Soon, Ahmad Nizam Shah along with Alam Khan reached the border of Khandesh. On his request, his father-in-law Gujarat sultan Muzaffar Shah II sent a large army for his help. When Ahmad Nizam Shah retreated, he used the army to force the Raja of Baglana to pay a huge sum as a tribute. In 1517, he accompanied Muzaffar Shah in his campaign against Rana Sanga of Chittaur and Medini Rai, a rebel minister of Malwa. On August 25, 1520, he died of illness at Burhanpur.\nMiran Muhammad Shah Faroqi I\nMran Muhammad Shah, eldest son of Adil Khan III succeeded his father. During his rule, Ala-ud-Din Imad Shah of Berar took refuge in his kingdom after being defeated by Burhan Nizam Shah of Ahmadnagar. At the same time, after initial turmoil for succession caused due to the death of Mujaffar Shah, Bahadur Shah occupied the throne in Gujarat. On request from Miran Muhammad and Ala-ud-Din Imad Shah, he sent the combined forces of Gujarat, Khandesh and Berar to attack Ahmadnagar in 1528. The Daulatabad fort was captured and later, the combined forces retreated only after Burhan Nizam Shah agreed upon a humiliating treaty. In 1532, Miran Muhammad joined Bahadur Shah in his campaign against Malwa and Chittaur. In 1534, Mughal emperor Humayun after occupying Malwa and Gujarat reached Khandesh. But before he could attack Khandesh, he had to return to Agra because of the advancement of Sher Shah's army in his territory. Bahadur Shah re-occupied Gujarat and sent Miran Muhammad along with Malwa governor Mallu Khan to re-occupy Malwa. Miran Muhammad occupied Mandu, the capital of Malwa. Here, on hearing the death of Bahadur Shah, he declared himself the sultan of Gujarat. On the way to Ahmedabad, he died due to illness on May 4, 1535, and buried in Burhanpur.\nMiran Mubarak Khan Faroqi II\n.]]\nAfter the death of Miran Muhammad the nobles of Khandesh installed his son Raja on the throne. But Miran Mubarak, the brother of Miran Muhammad, soon deposed him. After the death of Bahadur Shah, the nobles of Gujarat decided to put Mahmud Khan (Mahmud Shah III), the son of Latif Khan (rebel brother of Bahadur Shah) on the throne. Miran Mubarak refused to hand over Mahmud Khan who was in his custody. The Gujarat army defeated him and took back Mahmud Shah. Again, when he supported a rebel Gujarat officer Imad-ul-Mulk, he had to face again the Gujarat army led by Mahmud Shah.  Later, he signed a treaty with Gujarat and acquired the districts of Sultanpur and Nandurbar.\nThe last sultan of Malwa, Baz Bahadur after being defeated by Akbar in 1561, took refuge in Khandesh. The Mughal general Pir Muhammad Khan followed him to Khandesh, devastated the kingdom and overran Burhanpur. Miran Mubarak asked Tufal Khan of Berar for help. The joint army of Berar and Khandesh defeated Pir Muhammad Khan, re-occupied Malwa and re-instated Baz Bahadur. Miran Mubarak died on December 24, 1566.\nMiran Muhammad Shah Faroqi  II\nMiran Muhammad Shah II succeeded his father Miran Mubarak. Immediately after his accession, a noble of Gujarat, Changiz Khan attacked and captured Nandurbar and proceeded towards Thalner. With the assistance sent by Tufal Khan, Miran Muhammad II defeated him and reoccupied the lost territories. Next, he claimed his stake to the throne of Gujarat and advanced towards Ahmedabad but was defeated very badly and finally Akbar annexed Gujarat in 1572 CE. In 1574 CE, Murtaza Nizam Shah of Ahmadnagar annexed Berar. Miran Muhammad II sent an army to support a pretender in Berar. In retaliation, Ahmadnagar army marched inside Khandesh, overran Burhanpur and followed him to Asirgarh. He had to pay a huge indemnity to buy peace with Ahmadnagar. He died of illness in 1576.\nSultan Hasan Khan\nMiran Muhammad II was succeeded by his minor son Hasan Khan, who was soon deposed by Raja Ali Khan, the brother of Miran Muhammad II.\nRaja Ali Khan / Miran Adil Khan Faroqi IV\nof Akbar, minted in Asir. This coin was issued in the name of the Mughal ruler Akbar, to commemorate the capture of the Khandesh sultanate Asirgarh (Asir) Fort on 17 January 1601 CE. Legend: \"Allah is great, Khordad Ilahi 45, struck at Asir\".]]\nIn 1577, Akbar sent an expeditionary force to Khandesh to secure its sub-ordination. Raja Ali Khan was compelled to accept it. In 1586 CE, Akbar's governor of Malwa Khan Azam invaded Berar. Raja Ali Khan joined hands with Ahmadnager and defeated him. In 1591 CE, Akbar sent Faizi to Khandesh and Ahmadnagar courts to invite them to accept Mughal suzerainty. Raja Ali Khan agreed to accept. Later, Raja Ali Khan was assigned a rank (mansab) of 5000. On February 5, 1597, he died in the battle of Sonpet between the Mughals and Ahmadnagar, while fighting on the Mughal side. His body was brought to Burhanpur for burial.\nKhizar Qadir Khan (Bahadur Shah Faroqi )\nRaja Ali Khan was succeeded by his son Qadir Khan (or Khizr Khan according to Ain-i-Akbari) who took the title of Bahadur Shah. In a meeting with Akbar's emissary Abu'l Fazl, he refused to join Mughal army in person. Again, in January 1599 when prince Daniyal reached Burhanpur, he refused to meet him. Later, he took refuge in the Asirgarh fort and started preparation for war. On April 8, 1599, Akbar reached Burhanpur. He sent Abdur Rahim Khan-i-Khanan to lay siege to Asirgarh and appointed Abul Fazl as governor of Khandesh. On December 10, 1600, Bahadur Shah surrendered to Akbar but the fort was still held by his general Yakut Khan. Asirgarh fell to the Mughals only on January 17, 1601 Khandesh was annexed to the Mughal empire. Prince Daniyal was appointed viceroy of the Subah. Bahadur Shah was taken prisoner and he died later in Agra in 1624.\nList of rulers\n{| width=100% class=\"wikitable\"\n! style=\"background-color:#F0DC72\" width=22% | Title/Name\n! style=\"background-color:#F0DC72\" width=22% | Reign\n|-\n|colspan=4 align=\"middle\"| Independence from Delhi Sultanate as Sultanate of Khandesh\n|-\n|align=\"center\"|Malik Raja\n|align=\"center\"|1382 – 19 April 1399\n|-\n|align=\"center\"|Nasir Khan\n|align=\"center\"|1399 – 18 September 1437\n|-\n|align=\"center\"|Miran Adil Khan I\n|align=\"center\"|1437 – 30 April 1441\n|-\n|align=\"center\"|Miran Mubarak Khan I\n|align=\"center\"|1441 – 5 June 1457\n|-\n|align=\"center\"|Miran Adil Khan II\n|align=\"center\"|1457 – 28 September 1501\n|-\n|align=\"center\"|Daud Khan\n|align=\"center\"| 1501 – 28 August 1508\n|-\n|align=\"center\"|Ghazni Khan\n|align=\"center\"| 1508\n|-\n|align=\"center\"|Alam Khan\n|align=\"center\"| 1508 – 1509\n|-\n|align=\"center\"|Miran Adil Khan III\n|align=\"center\"| 1509 – 1520\n|-\n|align=\"center\"|Miran Muhammad Shah I\n|align=\"center\"| 1520 – 4 May 1535\n|-\n|align=\"center\"|Miran Mubarak Khan II\n|align=\"center\"| 1537 – 24 December 1566\n|-\n|align=\"center\"|Miran Muhammad Shah II\n|align=\"center\"| 1566 – 1576\n|-\n|align=\"center\"|Hasan Khan\n|align=\"center\"|1576\n|-\n|align=\"center\"|Raja Ali Khan\n|align=\"center\"| 1576 – 5 February 1597\n|-\n|align=\"center\"|Bahadur Khan\n|align=\"center\"| 1597 – 17 January 1601 (died 1624)\n|-\n|colspan=4 align=\"middle\"|  Conquered by Emperor Jalaluddin Muhammad Akbar of the Mughal Empire\n|}\nFamily tree\nSee also\n*Farooqi\n*List of Sunni Muslim dynasties\n*Tadvi Bhil\nNotes\nReferences\n#.\n#.\nExternal links\n*\n*\n* [https://web.archive.org/web/20110728184130/http://www215.pair.com/sacoins/public_html/khandesh/khandesh_nas.htm Copper coin of Nasir Khan] (archived 28 July 2011)\n* [https://web.archive.org/web/20110728184156/http://www215.pair.com/sacoins/public_html/khandesh/khandesh_bah.htm Copper coin of Bahadur Shah] (archived 28 July 2011)"
    }
  ]
}