{
  "content": [
    {
      "type": "text",
      "text": "# Fates Warning\n\n| origin            = Hartford, Connecticut, United States\n| label             =\n| spinoffs          =\n| current_members   = Jim MatheosRay AlderJoey VeraBobby JarzombekMichael Abdow\n| past_members      = Victor ArduiniJohn ArchJoe DiBiaseFrank ArestiSteve ZimmermanMark ZonderNick D'Virgilio\n| website           =\n}}\nFates Warning is an American progressive metal band, formed in Hartford, Connecticut, in 1982 by vocalist John Arch, guitarists Jim Matheos and Victor Arduini, bassist Joe DiBiase, and drummer Steve Zimmerman. There have been numerous lineup changes over the course of their -year career, and Matheos has been the only constant member. As of 2020, the band consists of Matheos, vocalist Ray Alder (who replaced Arch in 1987), bassist Joey Vera (who replaced DiBiase in 1996), drummer Bobby Jarzombek and guitarist Michael Abdow. Fates Warning also had a revolving cast of drummers and guitarists by the time Jarzombek and Abdow joined the band in 2007 and 2017 respectively.\nA pioneer of the progressive metal movement, Fates Warning has been referred to as one of the \"Big Three\" of the genre, creating and popularizing the style along with Queensrÿche and Dream Theater. Their early work, influenced by the new wave of British heavy metal (NWOBHM), is also important in the development of American power metal. Fates Warning has released thirteen studio albums, two live albums, one compilation album, one VHS cassette, three DVDs (each featuring live concerts) and four demo tapes. The band experienced its first commercial success with the 1986 release of their third studio album, Awaken the Guardian, which peaked at No.&nbsp;191 on the Billboard 200 and became the first album released on Metal Blade to enter that chart. Their next three albums — No Exit (1988), Perfect Symmetry (1989) and Parallels (1991) — were also successful; the first two peaked at No.&nbsp;111 and No.&nbsp;141 on the Billboard 200, respectively. By 2001, Fates Warning had sold over a million albums worldwide. Their latest studio album, Long Day Good Night, was released on November 6, 2020.\nHistory\nEarly career and first three albums (1982–1986)\nThe band's first album, Night on Bröcken, was released in 1984 on the Metal Blade label. The album was mainly influenced by Iron Maiden and other heavy metal bands, in songs like the title track and \"Damnation\" in particular. There were progressive aspects that would be further developed in subsequent albums. The Spectre Within (1985) featured a more progressive approach with songs like \"The Apparition\", \"Epitaph\", \"Pirates of the Underground\" and \"Traveler in Time\", with many tempo changes, a greater complexity in the arrangements, and fantasy lyrics full of symbolism and double meaning. During this period, Fates Warning had become a live staple in the East Coast and Midwest areas of the US, sharing the stage with numerous bands like Motörhead, Queensrÿche, Anthrax, Overkill, Anvil and Armored Saint.\nIn 1986, original guitarist Victor Arduini was dismissed from the band and was replaced by Frank Aresti, and the third Fates Warning album, Awaken the Guardian, was released in November of that year. It has been regarded as a groundbreaking and essential progressive metal release, working towards creating a more mythical atmosphere and a more fully realized progressive approach in song form; with complex and unusual riffs, and numerous tempo changes amidst frenetic and evocative vocal lines, however maintaining a basic fluidity. Awaken the Guardian also made history by becoming the first album released on Metal Blade to enter the Billboard 200 chart, and saw Fates Warning sharing the stage with bands like Queensrÿche and Saxon.\nLineup changes and rise to near fame (1987–1993)\nIn 1987, original vocalist John Arch was dismissed from the band prior to the start of work on their next album, and was replaced by Ray Alder. Their first album with Alder, No Exit was released in March 1988 and further developed the direction taken by the prior album with a more powerful sound all the while setting aside the fantasy themes and atmospheres. It featured one of the first prog metal suite of the genre, \"The Ivory Gate of Dreams,\" which is based on the gates of horn and ivory. No Exit gave Fates Warning their highest chart position to date on the Billboard 200, entering at number 111 and staying on the chart for thirteen weeks; it also helped build the band's popularity worldwide, with the videos for \"Anarchy Divine\" and \"Silent Cries\" receiving considerable airplay on MTV's Headbangers Ball, and Fates Warning touring almost non-stop in support of the album, playing with bands like Krokus, Savatage, Armored Saint and Flotsam and Jetsam.\nFollowing the tour in support of No Exit, original drummer Steve Zimmerman left the band in 1988 and was replaced by Mark Zonder, just as Fates Warning was preparing for their fifth studio album. The resulting album, Perfect Symmetry, was released in August 1989. The album abandoned the aggressive sound of No Exit, in favor of a more melodic and experimental one along with a melancholic atmosphere and intimate lyrics. Perfect Symmetry was full of extremely complex arrangements and an unusual and very articulated rhythm section, and is often regarded as a seminal prog metal album, \"which laid the foundations of the sound of the 90s\". Kevin Moore (keyboardist for Dream Theater at the time) was featured as a guest on the song \"At Fate's Hands\", while the cover was designed by Hugh Syme, famous for his work with the Canadian progressive rock band Rush. Although Perfect Symmetry was not as successful as No Exit, the album charted for nine weeks on the Billboard 200, while its only music video \"Through Different Eyes\" managed to get some airplay on Headbangers Ball. The album also saw the band embark on their first full-length world tour, which lasted for a year between November 1989 and November 1990; they opened for Manowar in Europe and toured there again with Sanctuary, who had also opened for Fates Warning in the US in early 1990.\n1991 saw the release of Parallels, distributed by Warner. The album, which started the collaboration with Rush producer Terry Brown, contains more accessible and streamlined songs than in the past, except for tracks such as \"The Eleventh Hour\" and \"Life in Still Water\", which features guest vocals by James LaBrie (who had just joined Dream Theater). Parallels is considered by some an essential album that \"has influenced a great amount of subsequent musicians\" and is possibly the band's most commercially successful record, despite the fact that it did not enter the Billboard 200 chart like the previous three albums did and was released during the grunge breakout; it did, however, chart on the Billboard Heatseekers chart and reach the top 10 on the Heatseekers chart. With Parallels, Fates Warning's popularity was still dominant in the US and Europe, with the videos for \"Point of View\" and \"Eye to Eye\" receiving heavy rotation on Headbangers Ball, and the band going on high-profile tours with the likes of Pantera and Savatage during 1992 as well as headlining the second night of the Wacken Open Air festival in Germany in 1993.\nCurrent and former members of Fates Warning (namely Matheos and DiBiase) have claimed “Parallels” to be amongst if not their favorite in the Fates Warning catalog.\nLater years (1994–2009)\nSlowing down after the commercial success of previous releases, the follow-up to Parallels took two and a half years for Fates Warning to make. The resulting album, Inside Out (1994), continued in the general vein of the previous album while adding more melody to their songs. The band's lineup also remained intact between albums for the first time since Spectre Within. Band members have attributed the album's comparative lack of success to confusion while writing this album in the wake of the success of Parallels and their subsequent failure to maintain creative momentum. Just like Parallels, Inside Out entered the Top 10 on Billboard Heatseekers chart in spite of little or no airplay due to the increasing popularity of grunge and alternative, and following its release, the band opened for Dream Theater in the U.S. and Europe on their Awake tour. A compilation album, Chasing Time, was released in 1995 and included two previously unreleased songs.\nIn 1996, both Joe DiBiase and Frank Aresti left the group. The three remaining members, Alder, Matheos and Zonder, joined by new member Joey Vera on bass and Kevin Moore as a guest keyboardist, released A Pleasant Shade of Gray the following year. Written as a concept album, A Pleasant Shade of Gray revealed a much darker and bleaker mood in writing style than had been heard before from the band. The album consists of a single 53-minute song split into twelve parts, making it the longest track Fates Warning has ever recorded. A live two-CD set, Still Life, was released in 1998, containing A Pleasant Shade of Gray performed live in its entirety. Joey Vera (bass), Bernie Versailles (guitars) and Jason Keazer (keyboards) accompanied the group on this album. A Japanese version included a studio cover of the Scorpions' \"In Trance\". The lineup for A Pleasant Shade of Gray consisting of Alder, Matheos, Zonder, Vera, and Moore, returned to record Disconnected in 2000. In 2003, Frank Aresti was asked to fill in on a tour with Dream Theater and Queensrÿche. He officially rejoined the band as a full-time member in 2005.\nTheir tenth studio release FWX was released in 2004. Drummer Mark Zonder stated it would be his last album with the band, as he wished to pursue other interests, and left in 2005. Although an official member again, Frank Aresti did not appear on the album because the writing had been completed and contracts had been signed already. Live in Athens, a concert DVD, was released in 2005; this DVD included guest drummer Nick D'Virgilio.\nIn the liner notes to the 2005 expanded edition of Awaken the Guardian, Dream Theater drummer Mike Portnoy noted that \"very often fans and critics credit Dream Theater for creating a whole new genre of progressive metal music in the late '80s/early '90s, [...] but the truth is Fates Warning were doing it years before us.\"\nThe band provided the song \"Nothing Left to Say\" to the soundtrack to the 1991 movie ''Freddy's Dead: The Final Nightmare. They have recorded songs for various tributes, including the tracks \"Closer to the Heart\" on the Rush tribute album Working Man, \"Saints in Hell\" on the 1997 Judas Priest tribute album Legends of Metal, and \"Sign of the Southern Cross\" on the 2000 Holy Dio Ronnie James Dio tribute album.\nReunions with former members, Darkness in a Different Light and Theories of Flight (2010–2017)\nIn 2010, Fates Warning played select dates with the Parallels lineup (Alder, Matheos, Zonder, Aresti and DiBiase) to celebrate the reissued, remastered and expanded edition of the classic album.\nAt the beginning of 2011, an announcement was made that Matheos and original vocalist John Arch had formed a band called Arch/Matheos. Their debut album was released in the autumn of that year, also featuring Joey Vera on bass guitar, Bobby Jarzombek on drums, and Frank Aresti on additional lead guitar.\nAfter many delays, Fates Warning released its eleventh studio album Darkness in a Different Light'' on September 27, 2013. It was the band's first album since 2004's FWX.\nTo celebrate the album's 30th anniversary, the Awaken the Guardian lineup (Arch, Matheos, Aresti, DiBiase and Zimmerman) reunited for a headlining appearance at the Keep It True festival in Germany on April 30, 2016. That lineup also headlined the Progpower USA Festival in Atlanta, Georgia on September 9, 2016. Both performances were recorded and filmed and later released on April 28, 2017, by Metal Blade Records as Awaken the Guardian Live on CD, double vinyl, DVD, and Blu-ray.\nFates Warning entered the studio in December 2015 to begin recording their twelfth studio album, which was planned for release in early 2016. The album, titled Theories of Flight, was released on July 1, 2016.\nReturn to Metal Blade and Long Day Good Night (2018–2022)\nWhen asked in a June 2018 interview about the thirteenth Fates Warning album, frontman Ray Alder stated: \"Right now, we're not in a writing mode. Everyone is kind of doing their own thing. I'm sure that will come out soon enough, of what everyone is doing. For the meantime, there are no plans to write another Fates Warning album — not in the near future, at least.\" Alder also commented on the band's future, saying: \"Right now, there's just no plans to go into the studio or write. But, people are working on different things and we're working on another tour right now for South America, so that is still a little up in the air. It's 90 percent sure, but we'll see what happens with that. I can't say anything until it's confirmed.\"\nOn February 15, 2019, it was announced that Fates Warning had re-signed to Metal Blade Records, and planned to begin working on a new album, for a 2020 release, after their spring tour with Queensrÿche. In a December 2019 interview, bassist Joey Vera stated, \"Fates Warning is not quite done writing, but pretty close. I think that the Fates record is also gonna be recording probably around January, February. I'm still very involved in both of those bands, obviously. So, for sure, a new Armored Saint record and a new Fates Warning record is on the horizon in the next 18 months, for sure.\"\nOn May 13, 2020, Alder announced on his Instagram profile that \"the vocals for Fates Warning's 13th album are done. 13 songs in 12 days.\" It was announced on August 25, 2020, that the album was titled Long Day Good Night and would be released on November 6, 2020, just two weeks after Punching the Sky by Vera's other band Armored Saint.\nPossible fourteenth studio album and future of the band (2023–present)\nWhen commenting on the possibility of another album, Alder stated in a May 2023 interview with Rock Hard that Matheos has no interest in writing new material as Fates Warning, but did not rule out any future tours: \"That was basically his saying he doesn't wanna write any more Fates Warning music. It doesn't mean we won't ever tour again. I would love to tour again, and Jim would as well; we've already discussed it. It's just a matter of getting everyone together.\" In an interview with Prog magazine a few months later, Alder reiterated that Matheos does not want to write new material as Fates Warning, but added, \"That could change, I don't know, you'd have to talk to him. It's not to say there won't be any more live shows. The band didn't break up. It's just that there won't be any more new music. And I need an outlet; music has been my life for over thirty years.\" The members began discussing a 40th anniversary tour however.\nBand members\n;Current Members\n*Jim Matheos − guitars\n*Ray Alder − vocals\n*Joey Vera − bass\n*Bobby Jarzombek − drums\n*Michael Abdow − guitars\n;Former Members\n*Victor Arduini − guitars\n*John Arch − vocals\n*Steve Zimmermann − drums\n*Joe DiBiase − bass\n*Frank Aresti − guitars\n*Mark Zonder − drums\n*Nick D'Virgilio − drums\n;Touring/Session Members\n*Chris Cronk − vocals\n*Kevin Moore − keyboards\n*Ed Roth − keyboards\n*Jason Keazer − keyboards\n*Bernie Versailles − guitars\n*Shaun Michaud − keyboards, guitars\n*Mike Portnoy − drums\n*Nick Van Dyk − keyboards\nFile:Jim Matheos of Fates Warning in Bratislava.jpg|Jim Matheos\nFile:Ray Alder with Fates Warning (2).jpg|Ray Alder\nFile:Joey Vera with Fates Warning (1).jpg|Joey Vera\nFile:Frank Aresti with Fates Warning (2) Keep It True Festival 2016.jpg|Frank Aresti\nFile:John Arch, original Fates Warning vocalist during the Keep It True Festival (Awaken The Guardian album 30th Anniversary Show) in Lauda-Königshofen, Germany (2016.04.30).jpg|John Arch\nTimeline\nTimeAxis = orientation:horizontal format:yyyy\nLegend = orientation:horizontal position:bottom\nScaleMajor = increment:4 start:1982\nScaleMinor = increment:1 start:1982\nColors =\nid:Vocals  value:red        legend:Vocals\nid:Guitars value:green      legend:Guitars\nid:Bass    value:blue       legend:Bass\nid:Drums   value:orange     legend:Drums\nid:Studio  value:black      legend:Studio_Album\nLineData =\nlayer:back\ncolor:Studio\nat:09/09/1984\nat:10/15/1985\nat:11/10/1986\nat:03/30/1988\nat:08/29/1989\nat:10/29/1991\nat:07/26/1994\nat:04/22/1997\nat:07/25/2000\nat:10/05/2004\nat:09/30/2013\nat:07/01/2016\nat:11/06/2020\nBarData =\nbar:Arch       text:\"John Arch\"\nbar:Alder      text:\"Ray Alder\"\nbar:Matheos    text:\"Jim Matheos\"\nbar:Arduini    text:\"Victor Arduini\"\nbar:Aresti     text:\"Frank Aresti\"\nbar:Abdow      text:\"Michael Abdow\"\nbar:DiBiase    text:\"Joe DiBiase\"\nbar:Vera       text:\"Joey Vera\"\nbar:Zimmermann text:\"Steve Zimmermann\"\nbar:Zonder     text:\"Mark Zonder\"\nbar:D'Virgilio text:\"Nick D'Virgilio\"\nbar:Jarzombek  text:\"Bobby Jarzombek\"\nPlotData=\nwidth:11 textcolor:black align:left anchor:from shift:(11,-4)\nbar:Arch       from:start      till:08/01/1987 color:Vocals\nbar:Alder      from:08/01/1987 till:end        color:Vocals\nbar:Matheos    from:start      till:end        color:Guitars\nbar:Arduini    from:start      till:12/31/1985 color:Guitars\nbar:Aresti     from:01/01/1986 till:07/01/1996 color:Guitars\nbar:Aresti     from:01/01/2003 till:02/01/2005 color:Guitars width:3\nbar:Aresti     from:02/01/2005 till:12/31/2016 color:Guitars\nbar:Abdow      from:09/30/2013 till:01/01/2017 color:Guitars width:3\nbar:Abdow      from:01/01/2017 till:end        color:Guitars\nbar:DiBiase    from:start      till:07/01/1996 color:Bass\nbar:Vera       from:07/01/1996 till:end        color:Bass\nbar:Zimmermann from:start      till:11/01/1988 color:Drums\nbar:Zonder     from:11/01/1988 till:02/01/2005 color:Drums\nbar:D'Virgilio from:02/01/2005 till:05/01/2007 color:Drums\nbar:Jarzombek  from:05/01/2007 till:end        color:Drums\n}}\nEquipment\nGuitar rig and signal flow\nA detailed gear diagram of Jim Matheos' 2012 Fates Warning guitar rig is well-documented.\nDiscography\nStudio albums\n*Night on Bröcken (1984)\n*The Spectre Within (1985)\n*Awaken the Guardian (1986)\n*No Exit (1988)\n*Perfect Symmetry (1989)\n*Parallels (1991)\n*Inside Out (1994)\n*A Pleasant Shade of Gray (1997)\n*Disconnected (2000)\n*FWX (2004)\n*Darkness in a Different Light (2013)\n*Theories of Flight (2016)\n*Long Day Good Night (2020)\nLive albums\n*Still Life (1998)\n*Awaken the Guardian Live (2017)\n*Live Over Europe (2018)\nCompilation albums\n*Chasing Time (1995)\nSingles\n*\"Anarchy Divine\" (1988)\n*\"Silent Cries\" (1988)\n*\"Through Different Eyes\" (1989)\n*\"Point of View\" (1991)\n*\"Eye to Eye\" (1992)\n*\"We Only Say Goodbye\" (1992; a remix version was going to be the third single from Parallels, later appeared in the compilation Chasing Time)\n*\"Pale Fire\" (1994)\n*\"Monument\" (1994)\n*\"A Pleasant Shade of Gray pt. 2\" (1997)\n*\"Simple Human\" (2004)\n*\"Firefly\" (2013)\nDVDs and VHSs\n*A Pleasant Shade of Gray (1998, VHS)\n*Live at the Dynamo (2000)\n*The View from Here (2003)\n*Live in Athens (2005)\n*A View from Here (2007)\n*Awaken the Guardian Live (2017)\nMiscellaneous releases\n*Demo 1983 (1983)\n*Misfit Demo (1983)\n*Demo 1984 (1984)\n*Dickie Demo (1985)\n*Inside Out / Disconnected (combined re-release with bonus tracks) (2007)\nMusic videos\n*\"Kyrie Eleison\" (1986)\n*\"Anarchy Divine\" (1988)\n*\"Silent Cries\" (1988)\n*\"Through Different Eyes\" (1989)\n*\"Point of View\" (1991)\n*\"Eye to Eye\" (1992)\n*\"Monument\" (1994)\n*\"Simple Human\" (2004)\n*\"I Am\" (2013)\n*\"Firefly\" (2013)\n*\"From the Rooftops\" (lyric video) (2016)\n*\"Seven Stars\" (2016)\n*\"SOS\" (2016)\n*\"Begin Again\" (2020)\nReferences\nBibliography\n*\nExternal links\n*[http://www.fateswarning.com/ Official website]\n*[http://st-news.com/issues/st-news-volume-10-issue-1/features/interviews/fates-warning/ Interview with the band, 1994]\n*[https://www.discogs.com/artist/252066-Fates-Warning Discography (on Discogs) ]"
    }
  ]
}