{
  "content": [
    {
      "type": "text",
      "text": "# Fearnley award\n\nof Myron in bronze]]\n, award winner in 1984.]]\n, award winner in 1994.]]\n, award winner in 2002]]\n, award winner in 2004.]]\n, award winner in 2006.]]\nwith Marit Breivik as head coach, became award winners in 2008]]\n, award winner in 2010.]]\nThe Fearnley Olympic Award (Fearnleys olympiske ærespris) is a Norwegian Athletics Award. The award is given for  outstanding achievements by a Norwegian Olympic participant. No competitor may win the award more than once. In 2021, it was decided that the prize would also be awarded for achievements at the Paralympics.\nHistory\nThe award was initiated  by Norwegian ship owner Thomas Fearnley (1880–1961) in connection with the 1952 Winter Olympics in Oslo. Thomas Fearnley  was a member of the International Olympic Committee from 1927 until 1948 and an honorary member from 1948 until 1950.\nThe Fearnley Olympic Award includes a statue in bronze by sculptor Per Palle Storm (1910–1994). It is  modeled after the Discobolus of Myron, the  Hellenic  statue dating from ca. 460–450 BC.\nThe Fearnley Olympic Award has been awarded for every Olympic Games since 1952, with the exception of the 1964 Summer Olympics in Tokyo (where no medals were awarded to Norway) and the 1980 Summer Olympic Games at Moscow (which was boycotted by Norway and other countries).\nThe first prizes went to speed skater  Hjalmar Andersen (1923–2013) at the 1952 Winter Olympics at Oslo and to  shooter Erling Kongshaug (1915–1993), who won a very close competition in the 1952 Summer Olympic Games at Helsinki.\nIn 1991, the prize was awarded to Norwegian sports official  Arne Mollén (1913–2000). Mollén was the president of the Norwegian Athletics Association from 1953 to 1955, vice chairman of the Norwegian Olympic Committee )Norges idrettsforbund'') 1965 to 1969 and chairman from 1969 to 1985. Mollén is so far the only person to have received the award other than for participation in an Olympic event. The award extended to  Mollén was also the only one made outside of Olympic years.\nPast winners\n* 1952 Winter Olympics, Hjalmar Andersen, Gold 1500, 5000 og 10000 meter, speed skating\n* 1952 Summer Olympics, Erling Kongshaug, Gold in shooting sports 50 m rifle\n* 1956 Winter Olympics, Hallgeir Brenden, Gold 15&nbsp;km cross-country\n* 1956 Summer Olympics, Egil Danielsen, Gold Javelin\n* 1960 Winter Olympics, Knut Johannesen, Gold 10000 meter speed skating\n* 1960 Summer Olympics, Peder Lunde, jr., Gold in sailing, class Flying Dutchman\n* 1964 Winter Olympics, Toralf Engan, Gold in ski jumping, large hill\n* 1964 Summer Olympics,  ' ' No assignment ' ' | | (no Norwegian medals) | |\n* 1968 Winter Olympics, Ole Ellefsæter, Gold in the 50&nbsp;km and the 4 x 10&nbsp;km relay, cross-country skiing\n* 1968 Summer Olympics, Tore Berger, Steinar Amundsen, Egil Søby and Jan Johansen, Gold on the K4 1000 metres\n* 1972 Winter Olympics, Paal Tyldum, Gold in the 50&nbsp;km cross-country skiing\n* 1972 Summer Olympics, Knut Knudsen, Gold medal in 4000 m track cycling\n* 1976 Winter Olympics, Sten Stensen, Gold in the 5000 m speed skating\n* 1976 Summer Olympics, Alf and Frank Hansen, gold in the 2000 m rowing double sculls\n* 1980 Winter Olympics, Bjørg Eva Jensen, Gold medal in the 3000 m speed skating\n* 1980 Summer Olympics, ' ' No assignment ' ' | | (Norwegian boycott) | |\n* 1984 Winter Olympics, Eirik Kvalfoss, Gold in the 10&nbsp;km Biathlon\n* 1984 Summer Olympics, Grete Waitz, Silver on the Marathon\n* 1988 Winter Olympics, Erik Johnsen, Silver in ski jumping, large hill\n* 1988 Summer Olympics, Tor Heiestad, Gold in shooting sports, 50 meter running target, Shooting at the 1988 Summer Olympics; Jon Rønningen, Gold in Greco-Roman wrestling (52&nbsp;kg), Wrestling at the 1988 Summer Olympics\n* 1991, Arne B. Mollén Service for the Norwegian Olympic sport. Among them, the Chairman of the Norway's Olympic Committee from 1969 to 1985.\n* 1992 Winter Olympics, Bjørn Dæhlie, Gold in the 50&nbsp;km Freestyle, 15&nbsp;km pursuit and the 4 x 10&nbsp;km relay, cross-country skiing | Nordic skiing at the 1992 Winter Olympics, 1992 Summer Olympics, Linda Andersen, Gold in Europe, Sailing at the 1992 Summer Olympics\n* 1994 Winter Olympics, Johann Olav Koss, Gold in the 1500, 5000 and 10000 meters speed skating\n* 1996 Summer Olympics, Vebjørn Rodal, Knut Holmann, Gold on the 800 m K1 1000 metres, Athletics at the 1996 Summer Olympics, Canoeing at the 1996 Summer Olympics\n* 1998 Winter Olympics, Ådne Søndrål, Gold in the 1500 metres speed skating\n* 2000 Summer Olympics, Women's national team in football, Trine Hattestad, Gold in football, Gold in Javelin\n* 2002 Winter Olympics, Ole Einar Bjørndalen, Gold 10&nbsp;km sprint, the 20&nbsp;km individual, the 12.5&nbsp;km pursuit and the 4 x 7.5&nbsp;km relay biathlon\n* 2004 Summer Olympics, Andreas Thorkildsen, Eirik Verås Larsen, Gold in Javelin, Gold in The k-1 1000 metres\n* 2006 Winter Olympics, Kjetil André Aamodt, Gold Super-G, Alpine skiing\n* 2008 Summer Olympics, Women's national team in handball, Olaf Tufte, Gold in handball, Gold in the single scull\n* 2010 Winter Olympics, Marit Bjørgen, Gold Classic sprint, the double pursuit and the 4 x 5&nbsp;km relay cross-country skiing\n* 2012 Summer Olympics, Bartosz Piasecki, Silver in fencing\n* 2014 Winter Olympics, Kjetil Jansrud, alpine skiing, Gold in super-G, Bronze in downhill\n* 2016 Summer Olympics, Are Strandli and Kristoffer Brun, rowing, Bronze in Lwt double sculls\n* 2018 Winter Olympics, Maren Lundby, jumping, Gold in Individual NH and Håvard Holmefjord Lorentzen, skating, Gold in 500 m, Silver in 1000 m\n* 2020 Summer Olympics, Karsten Warholm, athletics hurdles, Gold in 400 m hurdles, WR\n* 2022 Winter Olympics, Marte Olsbu Røiseland, biathlon, Gold in sprint, pursuit, mixed raley, Bronze in individual and mass start\nReferences"
    }
  ]
}