{
  "content": [
    {
      "type": "text",
      "text": "# Feather-plucking\n\n, showing signs of feather-plucking on its chest]]\nFeather-plucking, sometimes termed feather-picking, feather damaging behaviour or pterotillomania, is a maladaptive, behavioural disorder commonly seen in captive birds that chew, bite or pluck their own feathers with their beak, resulting in damage to the feathers and occasionally the skin. It is especially common among parrots (order Psittaciformes), with an estimated 10% of captive parrots exhibiting the disorder. The areas of the body that are mainly pecked or plucked are the more accessible regions such as the neck, chest, flank, inner thigh and ventral wing area. Contour and down feathers are generally identified as the main target, although in some cases, tail and flight feathers are affected. Although feather-plucking shares characteristics with feather pecking commonly seen in commercial poultry, the two behaviours are currently considered to be distinct as in the latter, the birds peck at and pull out the feathers of other individuals.\nFeather-plucking has characteristics that are similar to trichotillomania, an impulse control disorder in humans, and hair-pulling which has been reported in mice, guinea pigs, rabbits, sheep and muskox, dogs and cats, leading to suggestions for a comparative psychology approach to alleviating these problems.\nCauses\n, are particularly prone to the problem.]]\nFeather-plucking is generally regarded as a multifactorial disorder, although three main aspects of bird keeping may be related to the problem: (1) cage size often restricts the bird's movements; (2) cage design and barrenness of the environment often do not provide sufficient behavioural opportunities to meet the bird's sensitivity, intelligence and behavioural needs; and (3) solitary housing, which fails to meet the high social needs of the bird.\nSocial and environmental factors\nEarly experience\nFeather-plucking is often attributed to a variety of social causes that may include poor socialisation or absence of parents during the rearing period and because of this, the individual subsequently expressing the disorder fails to learn appropriate preening behaviour. Several studies have focused on the importance of rearing methods (wild-caught, parent-raised, hand-reared).\nIsolation\nIn captivity, pet birds are often kept isolated from conspecifics whereas in the wild they would form stable, sometimes large, flocks. These birds may not deal well with a solitary lifestyle. Deprivation of a social or sexual partner may lead to 'separation anxiety', ‘loneliness’, ‘boredom’, sexual ‘frustration’ and ‘attention-seeking’ behaviour. These factors may all contribute to feather-plucking, although no empirical studies have been performed to test these ideas.\nBarren environment\nIncreasing environmental complexity can reduce feather-plucking, however, other studies have only managed to stabilise existing plumage problems.\nRe-directed foraging behaviour\nIncreasing foraging opportunities can markedly reduce feather-plucking. This has many similarities with the redirected foraging behaviour hypothesis proposed for feather pecking in commercial poultry. Birds in captivity are usually given energy-dense, readily available food that is consumed rapidly, whereas in the wild they would have to spend many hours foraging to find this. It is considered that a combination of a barren environment and the 'excess' foraging time available is then spent redirecting foraging to feathers of other individuals. When 18 feather-plucking grey parrots (Psittacus erithacus) were provided with food in pipe feeders rather than bowls, their foraging time significantly increased by 73 minutes each day and their plumage improved noticeably within one month.\nStress\nFeather-plucking has also been interpreted as a coping strategy for negative affective states e.g. stress, loneliness, boredom, induced by inappropriate social or environmental factors. Findings in favour of the stress hypothesis include a study in which distinctive room position affected occurrence of the disorder. Orange-winged amazon parrots (Amazona amazonica) that were housed in proximity and direct line of sight to the door showed significantly more feather-plucking compared to individuals housed further away from the door, indicating presence of stressors as a causal factor. In addition, parrots that feather-pluck have been found to have higher levels of corticosterone, a hormone secreted by many animals when they are exposed to chronic stress. It has also been suggested that long day-lengths can cause feather-plucking; presumably this could relate to birds becoming overly tired and therefore stressed.\nMedical and physical factors\nMany medical causes underlying the development of feather-plucking have been proposed including allergies (contact/inhalation/food), endoparasites, ectoparasites, skin irritation (e.g. by toxic substances, low humidity levels), skin desiccation, hypothyroidism, obesity, pain, reproductive disease, systemic illness (in particular liver and renal disease), hypocalcemia, psittacine beak and feather disease (PBFD), proventricular dilatation syndrome, colic, giardiasis, psittacosis, airsacculitis, heavy metal toxicosis, bacterial or fungal folliculitis, genetic feather abnormalities, nutritional deficiencies (in particular vitamin A) and dietary imbalances, and neoplasia. For many of the above-mentioned factors, a causative relationship or correlation has not been established and may therefore merely be the result of coincidental findings.\nApproximately 50% of parrots exhibiting feather damaging behaviour have been diagnosed as having inflammatory skin disease based on paired skin and feather biopsies. The birds try to relieve itching by grooming their feathers, but this often leads to over-grooming and eventually feather-plucking.\nNeurobiological factors\nLittle is currently known on brain dysfunction in feather-plucking. However, it may be hypothesized that abnormal brain function is involved, especially in those cases that appear sensitive to treatment with behavioural intervention and environmental changes. Psychotropic therapy for birds has been suggested as treatment for feather-plucking although responses seem variable.\nGenetic factors\nIn orange-winged amazon parrots, a heritability estimate of 1.14 ± 0.27 was found for feather-plucking, indicating that a genetic basis exists. This study, however, only involved analysis of full siblings and a small number of birds, explaining the heritability value of greater than 1. Quantitative trait loci (QTL) analysis could provide more insight in possible genetic markers that are involved in feather-plucking.\nTreatment\nVeterinary treatment or an improved and more stimulating environment may help birds suffering from feather-plucking. Organic bitter sprays are sold in pet stores to discourage plucking, especially of newly grown feathers, although this may make general beak-based grooming difficult for the animal. This is not recommended since it does not address the real reason why the bird is picking feathers. Likewise, physical items such as collars or vests, which are commercially available or may be improvised by the parrot's owner from items such as pipe insulation tubes (placed around the neck) or socks (cut into a vest which the bird is made to wear) may prevent the bird from plucking by providing a barrier which makes the act more difficult, but does not deal with the underlying cause of the feather-plucking.\nStudies have shown that administration of haloperidol to affected birds will cause a long-term reduction in obsessive feather-plucking, however the birds always relapsed as soon as the medication was withdrawn. Clomipramine is also linked to minor long-term improvement for the condition, although it is not generally as effective as haloperidol.\nAdministration of fluoxetine is also known to reduce feather-plucking activity but only for very short periods of time, with the birds generally relapsing after several weeks of therapy and requiring a continually increasing dose of the medication. Use of fluoxetine for this condition is also linked to major relapse of feather-plucking when the medication is withdrawn, and it is known to cause severe psychological side-effects in certain birds.\nSee also\n* Abnormal behaviour of birds in captivity\n* Animal psychopathology\n* Comparative psychology\n* Stereotypy\n* List of abnormal behaviours in animals\nReferences\nExternal links\n*[https://web.archive.org/web/20080828034015/http://www.theafricangreyparrot.com/articles/African-Grey-Parrot-Articles-African-Grey-Parrot-feather-plucking.html Feather Plucking in African Grey Parrots]\n*[http://www.parrotloversforum.com/index.php?/page/index.html/_/parrotcare101/behavorandtraining/feather-picking-r32 Feather Picking at parrotloversforum.com]\n*[http://ricobird.wordpress.com/ Ricobird: A Solution for Self-Mutilation and Feather Picking]"
    }
  ]
}