{
  "content": [
    {
      "type": "text",
      "text": "# Federation of Revolutionary Syndicalist Organizations of Brazil\n\n| location_country         = Brazil\n| leader_title             =\n| leader_name              =\n| board_of_directors       =\n| key_people               =\n| parent_organization      =\n| subsidiaries             =\n| secessions               =\n| affiliations             = International Confederation of Labour (ICL)\n| ror_id                   =\n| website                  = }}\nThe Federation of Revolutionary Syndicalist Organizations of Brazil (in ), formerly known as the Fórum de Oposições pela Base (FOB), is a Brazilian revolutionary syndicalist organization founded in 2013. It participated in the founding of the International Confederation of Labor (CIT/ICL), which is a reconstruction of the historical International Workingmen's Association (IWA), alongside other revolutionary syndicalist and anarcho-syndicalist organizations from various countries. The FOB brings together popular organizations, autonomous unions, and student organizations.\nHistory and practice\nThe FOB originated by primarily acting within the labor movement as an internal trend within Conlutas and in the student movement as the Class Struggle Student Network (CSSN), in opposition to the National Union of Students and ANEL. Its founding assembly took place in 2013 during the first ENOPES (National Meeting of Popular, Student, and Labor Oppositions).\nDuring the 2nd ENOPES in 2017, the FOB approved an organizational transition aimed at building federations of grassroots autonomous unions, as well as popular and student organizations. Its action strategy is based on revolutionary syndicalism and general strikes. Among the principles advocated are class struggle, socialism, autonomy from political and economic power, direct action as a method of struggle, federalist direct democracy, mutualism, internationalism, opposition to patriarchy, and anti-racism.\nIts participants come from various categories of workers:\nIn 2013, the FOB participated in the 2013 protests in Brazil (also known as the June Days) and, along with other social movements in Rio de Janeiro, built the Popular Independent Front (FIP), which was one of the few organized groups capable of effectively leading a campaign and organizing protests in Brazil against the 2014 FIFA World Cup. The FIP faced significant media criminalization and violent repression.\nSince 2018, the FOB has been involved in the construction of the International Confederation of Labor (CIT/ICL), which is a reconstruction of the historical International Workingmen's Association. Organizations such as the Confederación Nacional del Trabajo (Spain) (CNT), the USI (Italy), the FAU (Germany), the Industrial Workers of the World (IWW) (USA-Canada), the ESE (Greece), the Argentine Regional Workers' Federation (FORA), and the IP (Poland) have been part of this construction, having already been approved within their own bases. Since then, it has acted jointly with organizations from other countries, such as the international campaign that successfully advocated against the mass layoffs of workers from a clothing factory in India during the COVID-19 pandemic.\nDuring the COVID-19 pandemic in Brazil, in 2020/2021, the FOB launched a campaign against Bolsonarism and supported the establishment of squats through occupations, such as the Menino Benjamin Filho squat in Rio de Janeiro and the Carlos Marighella squat in Ceará. The organization also worked alongside indigenous peoples, implementing solidarity actions.\nSee also\n* Anarchism in Brazil\nReferences"
    }
  ]
}