{
  "content": [
    {
      "type": "text",
      "text": "# Fellows & Stewart\n\nFellows & Stewart Inc. was a shipbuilding company in San Pedro, California on Terminal Island's Pier 206. To support the World War II demand for ships Fellows & Stewart built Crash rescue boats and submarine chasers. The Crash rescue boats were operated by both the US Navy and US Army during the war. Some crash rescue boat also served in the Korean War. Fellows & Stewart was founded as Joe Fellows Boat Shop in 1896. Joe Fellows was an English immigrant who learned boat building in Seattle and San Francisco. The company changed to Fellows & Stewart as the shipyard manager, Victor Stewart joined in as a partner. Many of the boats were designed by Joseph Pugh. From 1907 to 1917 called the Joe Fellows Yacht and Launch Company. In the 1910s, 1920s and 1930s the shipyard built many yachts and sailboats. The name changed to the Fellows & Stewart Inc. in 1917. In 1967 the shipyard was sold to Harbor Boatbuilding. The shipyard is sometimes listed as being in Wilmington. The records of Fellows & Stewart are housed at the Los Angeles Maritime Museum. Notable boats and ships: , , Rudolph Valentino's 1926 yacht Charade (Phoenix) and the Ranger built in 1917 active at the Santa Barbara Maritime Museum.\nBuilders\nSome of the builders:\n*Joseph (\"Rusty\") Fellows Sr. (1865–1942)\n*Richard Joseph Fellows (1906–1962)\n*Lois Anderson Fellows\n*Victor Stewart (1876–1956)\n*Joseph T. Pugh, built and raced the sloop Mischief in 1909.\nJoseph Fellows Sr. was born in Staffordshire, England on May 31, 1865, his family came to America in 1873. His father Isaac Fellows (?–1901) was a carpenter in Decorah, Iowa. At age 14 he became an apprentice first in Spokane, then Portland and then Seattle. He became the shipyard supervisor at the San Francisco Launch Company. In 1898 came to San Pedro to work on the  yacht J.C. Elliott. In 1899 he founded his own boat company with Joseph T. Pugh on Terminal Island at Berth 206. Fellows was the co-founder of the South Coast Yacht Club. Starting 1907 his company designed and built many racing boats. Fellows Sr. married Joise McMeans, daughter of James A. McMeans, a Nebraska State Senator (1879). Notable racing boats: Venus, the Minerva, the Minerva II, the Mischief, Mischief II the Myth, Fellows IV and the Monsoo.  Notable classic yacht: Stan Laurel's Ida May (1926).\nAir-sea rescue boat\nFellows & Stewart Air-sea rescue boat, also called a crash boat (ARB), were: Model 314 at , length of , beam of , draft of . Powered by  Hall-Scott Defender V12 petrol engines with a top speed of . They had a crew of 7 or 8 and were armed with two .50 calibre M2 Browning machine guns. The boat has two rigid  United States Rubber Company bullet sealing fuel tanks. This was a speed boat used to rescue pilots, crew and passengers from downed aircraft in search and rescue, air-sea rescue missions.\nSubmarine chaser\nFellows & Stewart Submarine Chaser were a  at 94 tons with a length of , a beam of , a draft of , a top speed of . They had a crew of 28. Power was provided by two  General Motors, Electro-Motive Division, 16-184A diesel engines, and two propellers. They were armed with one Bofors 40 mm gun, two Browning M2 .50 cal. machine guns, two depth charge projector \"Y guns\", and two depth charge tracks. Some of the submarine chasers were lent to Allies of the United States as part of the Lend-Lease program. Fellows & Stewart's SC-1011 went to the Soviet Union.\nUS Army tugboats\nIn 1954 Fellows & Stewart built 46 steel-hulled small harbor tugboats for the US Army. The tugboats were: 48 tons net, , with a length of , a beam of . Powered by a diesel White Atlas Imperial engine with  and one propeller. The Fellows & Stewart tugboats were numbered from ST 2100 to ST 2198 of a design 3004. The design 3004 tugboats were completed too late to service in the Korean War, some served in the Vietnam War.\nSee also\n*California during World War II\n*Maritime history of California\n* Wooden boats of World War 2\n*Cryer & Sons\nReferences"
    }
  ]
}