{
  "content": [
    {
      "type": "text",
      "text": "# Feminism: The Essential Historical Writings\n\nFeminism: The Essential Historical Writings is an anthology edited with an introduction and commentaries by Miriam Schneir. It was originally published in 1972 and re-published in 1994 by Vintage Books. It consists of essays, fiction, memoirs, and letters by what Schneir labels the major feminist writers. The content included ranges from 1776 to 1929 and focuses on topics of civil rights and emancipation. The book has had an influence on education, being used as a resource in women's studies classes. Various scholars have given both positive and negative reviews of this book. It remains in print to this day.\nIntroduction and commentaries\nSchneir supplied the introduction to the book as well as commentaries on each work and its author. In the introduction, she defines the book's main purpose as simply to acquaint women with the great feminist writings of the past. She notes how much of the included content focuses on \"still-unsolved feminist problems\", and therefore the book is about both the past and future of the feminist movement.\nContent\nThe book is made up of essays, fiction, memoirs, and letters by what Schneir labels the major feminist writers, including Elizabeth Cady Stanton, George Sand, Mary Wollstonecraft, Abigail Adams, Emma Goldman, Friedrich Engels, Sojourner Truth, Susan B. Anthony, John Stuart Mill, Margaret Sanger, Virginia Woolf, and many others. The presented materials range from the 18th to 20th century, with the earliest work being from 1776 and the latest from 1929. Schneir describes this as the phase of \"old feminism\". Most of the works included were written by Americans, with the addition of some by European writers. The book has five sections: Eighteenth Century Rebels, Women Alone, An American Women’s Movement, Men as Feminists, and Twentieth-Century Themes. The content is related to a theme of civil rights and emancipation, specifically focusing on topics of marriage, economic dependence, and personal independence and selfhood. It also includes multiple works written by male socialists, linking ideas of feminism and socialism together.\nChoice of content\nSchneir described her process of choosing the material for the book as looking for the basic, essential writings of feminism that everyone should know. She justifies the use of predominantly American content through her American nationality and the idea that the United States was the world center of \"old feminism\". The influence of Schneir’s leftist background can also be considered when examining the content chosen for this book.\nList of content included\nSchneir includes experts from the works below. The works are listed in chronological order.\n{| class=\"wikitable\"\n|+Content\n|Work\n|Author\n|-\n|Familiar Letters of John Adams and His Wife, Abigail Adams, During the Revolution\n|Abigail Adams\n|-\n|A Vindication of the Rights of Woman\n|Mary Wollstonecraft\n|-\n|Course of Popular Lectures\n|Frances Wright\n|-\n|Indiana\n|George Sand\n|-\n|Letters of George Sand\n|George Sand\n|-\n|The Intimate Journal of George Sand\n|George Sand\n|-\n|Letters on the Equality of the Sexes and the Condition of Women\n|Sarah Moore Grimké\n|-\n|Early Factory Labour in New England\n|Harriet M. Robinson\n|-\n|The Song of the Shirt\n|Thomas Hood\n|-\n|Woman in the Nineteenth Century\n|Margaret Fuller\n|-\n|Married Women's Property Act, New York, 1848\n|N/A\n|-\n|Declaration of Sentiments and Resolutions, Seneca Falls\n|N/A\n|-\n|Editorial from The North Star\n|Frederick Douglass\n|-\n|Intelligent Wickedness\n|William Lloyd Garrison\n|-\n|Letter from Prison of St. Lazare, Paris\n|N/A\n|-\n|Ain't I a Woman?\n|Sojourner Truth\n|-\n|What Time of Night It Is\n|Sojourner Truth\n|-\n|Not Christianity, but Priestcraft\n|Lucretia Mott\n|-\n|Marriage of Lucy Stone Under Protest\n|Lucy Stone\n|-\n|Disappointment Is the Lot of Women\n|Lucy Stone\n|-\n|Address to the New York State Legislature, 1854\n|Elizabeth Cady Stanton\n|-\n|Address to the New York State Legislature, 1860\n|Elizabeth Cady Stanton\n|-\n|Married Women's Property Act, New York, 1860\n|N/A\n|-\n|Petitions Were Circulated\n|Ernestine Rose\n|-\n|Keeping the Thing Going While Things are Stirring\n|Sojourner Truth\n|-\n|The United States of America vs. Susan B. Anthony\n|Susan B. Anthony\n|-\n|Woman Wants Bread, Not the Ballot!\n|Susan B. Anthony\n|-\n|Virtue: What It Is, and What It Is Not\n|Victoria Woodhull & Tennessee Claflin\n|-\n|Which Is to Blame?\n|Victoria Woodhull & Tennessee Claflin\n|-\n|The Elixir of Life\n|Victoria Woodhull & Tennessee Claflin\n|-\n|Womanliness\n|Elizabeth Cady Stanton\n|-\n|Solitude of Self\n|Elizabeth Cady Stanton\n|-\n|The Subjection of Women\n|John Stuart Mill\n|-\n|A Doll's House\n|Henrik Ibsen\n|-\n|The Origin of the Family, Private Property, and the State\n|Friedrich Engels\n|-\n|Women and Socialism\n|August Bebel\n|-\n|The Theory of the Leisure Class\n|Thorstein Veblen\n|-\n|Women and Economics\n|Charlotte Perkins Gilman\n|-\n|The Lady\n|Emily James Smith Putnam\n|-\n|Senate Report - History of Women in Industry in the United States\n|N/A\n|-\n|Women's Share in Social Culture\n|Anna Garlin Spencer\n|-\n|The World Movement for Woman Suffrage 1904 to 1911: Is Woman Suffrage Progressing?\n|Carrie Chapman Catt\n|-\n|I Incite This Meeting to Rebellion When Civil War Is Waged by Women\n|Emmeline Pankhurst\n|-\n|Bread and Roses\n|N/A\n|-\n|The Traffic in Women\n|Emma Goldman\n|-\n|Marriage and Love\n|Emma Goldman\n|-\n|Women and the New Race\n|Margaret Sanger\n|-\n|My Recollections of Lenin: An Interview on the Woman Question\n|Clara Zetkin\n|-\n|A Room of One's Own\n|Virginia Woolf\n|-\n|On Understanding Women\n|Mary Ritter Beard\n|}\nInfluence\nEducational use\nThis book has held influence in education as it has been used to teach students about feminism. In the absence of the history of feminism from traditional history books, students studied this book in women's studies classes. Some scholars say that it is an accessible and useful resource for undergraduate courses focusing on the history of feminism. It is said to be good because it covers old materials in an engaging way and encourages students to continue learning about them. Others recognize that it provides insight into how particular discourses and narratives are established and think of it as a resource for students to be critical of and challenge the dominant constructions of feminist history.\nReviews\nOne common point of discussion throughout reviews is the construction of the history of feminism that this book produces. Knowledge production is often critiqued, as sometimes it is based on very few ideas. This book produces a knowledge of feminism without considering multiple ideas. Some argue that this book highlights a linear progression of a western narrative of feminism, not examining feminism in different historical periods or different countries. This results in the absence of diverse views and perspectives. Further, some note that the book fails to consider race. The construction of feminist history produced in it both misrepresents and does not appropriately include Black women's perspectives.\nMultiple scholars mentioned Schneir's introduction and commentaries in their reviews. The writing on the back cover of the book is critiqued for being misleading. It states that the book highlights ignored or forgotten materials, but most of the material is actually pretty well known. Some also feel that more critical introductions to the works and more critical bibliographies for each writer would have added value to the book.\nSome scholars recognize the importance of the book. They feel that it is an excellent collection of works from the history of feminism. Others additionally note that the book holds historical significance.\nReferences"
    }
  ]
}