{
  "content": [
    {
      "type": "text",
      "text": "# Ferdinand Kowarz\n\nFerdinand Kowarz (23 February 1838, Planá – 22 September 1914, Františkovy Lázně), was a Bohemian-Austrian entomologist who described many new species of Diptera mainly from central Europe\nKowarz was a post office official. To supplement his income he sold collections of Diptera to others in the same field.\nPublications\n* 1867 Beschreibung sechs neuer Dipteren-Arten. Verh. zool. bot. Ges. Wien, 17: 319–324, 4 figs.\n* 1868 Dipterologische Notizen II. Verh. zool. bot. Ges. Wien., 18: 213–222\n*1868 Dipterologische Notizen II. Verh. zool. bot. Ges. Wien., 18: 213–222.\n* 1869 Beitrag zur Dipteren fauna Ungarns. Verh. zool. bot. Ges. Wien., 19: 561- 566.\n*1874 Die Dipteren-Gattung Chrysotus Meig. Verh. zool. bot. Ges. Wien., 24: 453–478 + 1 pl.\n* 1878 Die Dipteren-Gattung Medeterus Fischer. Verh. zool. bot. Ges. Wien., 27 (1877): 39–76, 24 figs.\n* 1879 Die Dipteren-Gattungen Argyra Macq. und Leucostola Lw. Verh. zool. bot. Ges. Wien., 28 (1878): 437–462, 26 figs\n* 1880 Die Dipterengattung Lasiops Mg. ap Rd., ein Beitrag zum Studium der europäischen Anthomyiden. Mitt. Münch. ent. Ver., 4: 123–140.\n* 1882 Eine neue Art der Dipteren-Gattung Leucostola Lw. Wien. Ent. Zeitg., 1: 32–33.\n* 1883 Beiträge zu einem Verzeichnisse der Dipteren Böhmens I. -III. Wien. Ent. Zeitg., 2: 108–110 (I), 168–170 (II), 241- 243 (III) .*.\n* 1883 Contributiones ad faunam Comitatus Zemplémensis in Hungaria superiore. Diptera Comitatus Zempléniensis collectionis Dies Cornelli Chyzer. Mag. orvos. term., 22: 233–246. (In Hung.; Latin title.)\n* 1884 Beiträge zu einem Verzeichnisse der Dipteren Böhmens IV. Wien. Ent. Zeitg., 3: 45–57.\n* 1885 Mikianov. gen. Dipterorum. Wien. Ent. Zeitg.., 4: 51–52.\n* 1885 Beiträge zu einem Verzeichnisse der Dipteren Böhmens VI. Wien. Ent. Zeitg.., 4: 105–108, 133–136, 167–168, 201–208, 241–244.\n* 1887 Beiträge zu einem Verzeichnisse der Dipteren Böhmens VI. Wien. Ent. Zeitg., 6: 146–154.\n* 1889 Die europäischen Arten der Dipteren-Gattung SympycnusLw. Wien. Ent. Zeitg., 8: 175–185.\n* 1894 Catalogus insectorum faunae bohemicae. -II. Fliegen (Diptera) Böhmens. Prag, 42 pp\nThere is an online biography Online Biography\nNotes\nSources\n* Osten-Sacken, C. R. 1903: Record of my life and work in entomology. – Cambridge (Mass.) 135–137.\n* Pont, A. C. 1997: [Kowarz, F.] – Studia dipterologica 4(2) 353–358.\n* Rozkošný, R. 1971: Bibliography of Diptera in Czechoslovakia 1758–1965. – Vyd. Univ. Brno 91–93."
    }
  ]
}