{
  "content": [
    {
      "type": "text",
      "text": "# Ferking\n\nKing Ferking was a semi-legendary figure recorded in local church literature. He lived in the 7th century, controlling a realm that included western parts of island of Karmøy, in southern Norway. The name Ferking is probably derived from the nickname or title Farthegn, meaning \"travelling gentleman\" or \"travelling merchant\".\nBiography\n's daughter at Stavasletta]]\nThe legend was first recorded by Icelandic historian,  Tormod Torfæus in Historia rerum Norvegicarum, about 1700. The legend claims that King Ferking lived at Ferkingstad, where he had built large houses of stones.  The banquet halls were so huge that 500-600 men could dance in honor of the gold calf, which Ferking worshiped. To prevent anyone from taking the gold calf, Ferking buried it somewhere in this area. The hiding place is said to have been marked on a map that was destroyed when the vicarage of Falnes burned down in 1842.\nKing Ferking was a ruler of the sea, a Viking who spent most of his time on board a ship, and he brought home with him many treasures.  The most beautiful treasure was some pearls that his queen wore during feasts in the King's manor.\nKing Ferking  fought King Augvald over the sovereignty of Karmøy.  King Augvald had attended Ferkingstad for a midwinter sacrificial banquet with a group of people, among them two of his daughters. They were female warriors or Shieldmaidens (Skjøldmøy). The two kings suddenly fell foul of each other resulting in Augvald gathering up his men and returning home. His daughters, however, were held captive at Ferkingstad. The two kings remained sworn enemies from that day forth.\nFerking decided  to travel north with his army but came no further than Skeie, where King Augvald and his army met him. The last battle between the two kings took place in a field at the site now known as The field of Stava (Stavasletta) about 500 meters from Ferkingstad.  It was a fierce battle with a great loss of men, and King Augvald was mortally wounded.   When his daughters saw their father was killed, they screamed, leaped into the river and drowned.  They were buried at Stava and stones were erected on their graves. These stones are called the Shieldmaidens (Skjoldmøyene).  The two stones (0.75 m and 1.25 m in height) were once part of a triangular cluster of stones.\nThe legends don't tell how King Ferking died, but some say that he was buried in a mound at Kvilhaug not far away from his manor. The legends also tell of the  King's fortress  (Kongsborgen),  which was burnt to the ground during the 7th century. The Fartegn estate was later raised on the same site by Ferking's son, who also bore the name Fartegn.\nReferences\nOther source\n* Torfæus, Tormod Historia rerum Norvegicarum  (Copenhagen: 1711)"
    }
  ]
}