{
  "content": [
    {
      "type": "text",
      "text": "# Fernando Poe Jr. 2004 presidential campaign\n\n| logo = Fernando Poe Jr. 2004 presidential campaign logo.png\n|affiliation=Koalisyon ng Nagkakaisang PilipinoPwersa ng Masang PilipinoLaban ng Demokratikong Pilipino (Angara wing)Nationalist People's Coalition (Maceda wing)PDP–Laban\n|status= Lost election:\n| key_people =\n* Vicente \"Tito\" Sotto III (campaign manager and speechwriter)\n* Chiz Escudero (campaign spokesman)\n* Rod Reyes (media bureau chief)\n* Gringo Honasan (security votes chief)\n| slogan   = Bayan Ang BidaMay Bagong Umagang Parating\n}}\nThe 2004 presidential campaign of Fernando Poe Jr. was formally launched on November 27, 2003, upon announcing his candidacy at the Manila Hotel in the City of Manila. Poe was the Koalisyon ng Nagkakaisang Pilipino (KNP)'s nominee for President of the Philippines in the 2004 election. He chose Loren Legarda, the sitting Majority Floor Leader of the Philippine Senate, as his vice presidential running mate on January 1, 2004. A public figure in his movie career and known for his charitable but unpublicized endeavors, he targeted his candidacy at the same poor whom he championed in his films.\nPoe accepted the nomination for president in December 2003 by KNP and was to be the standard opposition bearer for the Philippines' 2004 presidential election. Some accounts portray him as a reluctant candidate who was only prevailed upon to accept the nomination by his best friend, deposed former President Joseph Estrada. But other accounts say he was convinced to cast his bid for the presidency because of the overwhelming crowd that gathered for the first rally of the FPJ for President Movement at the Cuneta Astrodome in Pasay held on October 23, 2003.\nPre-election\nIn 2002, after visiting Ilocos Norte, a known province dominated by the Marcos family, Poe was rumored that he will be paired with then-Governor Bongbong Marcos as his running mate for 2004 elections.\nDisqualification case\nOne of the primary issues that Poe faced during the campaign period were three disqualification cases filed before the Commission on Elections (Comelec) by attorneys Maria Jeanette C. Tecson, Zoilo Antonio Velez and Victorino X. Fornier. These cases were subsequently consolidated and elevated to the Supreme Court. Even though Poe was born in the Philippines, the lawyers who filed the disqualification cases argued that he was not a natural-born Filipino, a requirement for a presidential candidate. They argued that he was an illegitimate child who should have followed the citizenship of his American mother. They further argued that Poe's father was not a Filipino because records indicated that Poe's father was a Spanish national. The Supreme Court voted 8–5, with one abstention, in favor of Poe. The high court upheld the previous Comelec ruling and declared Poe was a \"natural-born citizen and qualified to run\". Supreme Court Justice Hilario Davide Jr. said a preponderance of evidence established that Poe's father was a Filipino because Poe's grandfather, Lorenzo, had not declared allegiance to Spain by virtue of the Treaty of Paris and the Philippine Bill of 1902. Davide said that, in the case of an illegitimate child whose father is a Filipino and whose mother is an alien, proof of paternity is enough for the child to take after the citizenship of his putative father.\nDeath of Maria Jeanette Tecson\nOn September 28, 2007, 8:30 p.m, Maria Jeanette Tecson, one of the lawyers who filed a case against Fernando Poe Jr in 2004, was found dead — with multiple wounds in her throat and wrist — in room 204, of the Richmonde Hotel on San Miguel Avenue, Ortigas Center, Pasig. Senior Superintendent Francisco Uyami, Pasig police chief stated that the limbs of Tecson's body were already stiff when the corpse was found, suggesting that the 40-year-old lawyer was already several hours dead before her remains were discovered.\nCampaign period\n. In front of her is Chief Justice Hilario Davide Jr. The result of the election was a loss for Poe.]]\nPolitical critics charged Poe of being heavily linked to political interest groups, and tried to compare his candidacy to that of Estrada, who ran on a similar platform, but was deposed from office and put under house arrest after numerous corruption scandals. While initially seen as the frontrunner in the campaign, his performance in opinion polls was eventually surpassed by the incumbent Gloria Macapagal Arroyo, who did win the election.\nWhile campaigning in Lacson's home town in Cavite, Poe was hit in his head's temple by an anti-supporter of a small piece of wood while motorcading in Dasmariñas by 4 o'clock.\nPoe also failed to gather the support of Davao City Mayor Rodrigo Duterte, one of the members of Pimentel's PDP–Laban. Poe's camp also failed to gather the support of Puerto Princesa Mayor Edward Hagedorn (which Poe portrayed in one of his movies). Hagedorn supported Arroyo's campaign.\nUnification talks with Lacson\nLacson and Poe wanted to be unified by many opposition members by April, but no talks happened. Tito Sotto, campaign manager of Poe said that they need to assess \"the possible scenarios of cheating by the administration.\"\nConflict with media personnel\nPoe has gained a reputation for being a difficult personality to cover, with he constantly shies away from interviews, and statements are made by his aides and KNP officials. There's an instance that he threatened to punch a foreign news photographer during a campaign in Pampanga, when it attempted to clamber on the campaign vehicle.\nWhile campaigning in Iloilo on April 2, 2004, Poe approached GMA News reporter Sandra Aguinaldo, who has been preparing to do a \"stand up\" for a live broadcast of 24 Oras, its flagship newscast. She was surprised when berated by Poe stating \"Ikaw na lang kaya (why don’t you speak instead)!\", and told to one of the anchors of the newscast that he followed up with \"Hindi nga, gusto mo ata magsalita (Why not? You seem to want to speak)?\". Due to its scene location being at the middle of a crowd, it prompted an outburst. Legarda, a former news journalist and Sotto sided with Poe and wanted Aguinaldo to apologize to end the issue, but the latter insisted not to apologize. Sotto reportedly demanded to GMA News replace the correspondent covering the campaign. He was also reportedly shouted at a journalist during Legarda's birthday celebration at the Century Park Hotel in Manila in January 28 of the same year.\nAfter the day of the incident with Aguinaldo, Spokesman Chiz Escudero release a statement saying Poe will not apologize to Aguinaldo, but the candidate wasn't angry at her at all. The news department of GMA defended the latter, saying she is only doing her job as a field journalist. Many politicians berated Poe's action including Malacañang officials, led by Presidential Spokesman Ignacio Bunye and Arroyo's campaign spokesman Michael \"Mike\" Defensor, former President Fidel Ramos gave unsolicited advice with facing media fairly and it can be a showing of asset for good governance. Also, Bulacan Congressman Willie Villarama and Davao City Congressman Prospero Nograles stated that Poe's treatment of media members as a potential sign of losing press freedom if he was elected, Congressman Teddy Boy Locsin, a newspaper columnist said Poe should appreciate media coverage, and be prepare for media interviews. Raul Roco, one of Poe's rival stated that he's just showing his true behavior, calling him mataray (bitchy in Tagalog) and ungentleman, and compared him to a gold-plated jewel whose shine fades off after being soaked in vinegar. Sotto, the campaign manager of Poe, compared the incident into an \"April Fool's Comedy\" (as the incident happened in April 2, after the April Fool's Day). But fellow movie actor and personal friend Eddie Garcia defended Poe, pointing Aguinaldo is the one distracting during the middle of a serious campaign speech.\nBut in May 4, Aguinaldo had a second close encounter with Poe, with asking the actor if he will appeal to the reported decisions of Iglesia, and El Shaddai endorsements of President Arroyo. But Sotto cut and changed topic about of a video shown in a news broadcast and saw nothing that showed Poe being hit by an object. Poe stated that mango sap stuck in his hair, with Eddie Garcia helped him to remove it with tissue paper, and stated to media personnel for fairness of the news.\nEndorsements\n;Philippine Congress\n* Tito Sotto, Senator (1992–2004)\n* Gringo Honasan, Senator (1995–2004) and chief security votes\n* Nene Pimentel, Senator (1987–1998; 1998–2010), and Senate President (2000–2001)\n* Ernesto \"Ernie\" Maceda, Senator (1987–1998), Senate President (1996–1998)\n* Edgardo \"Ed\" Angara, Senator (1987–1998; 2001–2013), Senate President (1993–1995)\n* Juan Ponce Enrile, Senator (1987-1992; 1995-2001)\n* Chiz Escudero, Congressman from Sorsogon (1998–2007) and campaign spokesman\n* Dennis Roldan, Representative of the 3rd District of Quezon City (1992-1998), actor, basketball player\n* Imelda Marcos, Leyte's 1st district congresswoman (1995–1998), First Lady of the Philippines (1965–1986)\n* Imee Marcos, Ilocos Norte's 2nd district representative (1998–2007)\n* Win Gatchalian, Valenzuela's 1st district representative (2001–2004)\n;Governors\n* Bongbong Marcos, Governor of Ilocos Norte (1983-1986; 1998–2007), Representative of the 2nd District of Ilocos Norte (1992-1995)\n* Wilfrido Enverga, Governor of Quezon Province (1998-2007), Representative of the 1st District of Quezon (1987-1998)\n;Local officials\n* Reuben Canoy, Mayor of Cagayan de Oro (1971–1986)\n* Jejomar Binay, Mayor of Makati (1988–1998; 2001–2010)\n* JV Ejercito, Mayor of San Juan (2001–2010)\n* Mel Lopez, former Mayor of Manila (1988–1992)\n* Isko Moreno, Actor and councilor of Manila's 1st district (1998–2007)\n* Boying Remulla, former member of the Cavite Provincial Board (1992–1995), and congressional candidate for Cavite's 3rd district (PMP)\n;Celebrities\n* Dolphy Quizon, Comedian, actor\n* Susan Roces-Poe, actress, and Poe's wife\n* Vic Sotto, actor, tv host, comedian\n* Joey de Leon, actor, comedian, tv host\n* Eddie Garcia, Versatile actor, director\n* Eddie Gutierrez, versatile actor\n* Robert Arevalo, versatile actor\n* Wendell Ramos, actor, model and Comedian\n* Rudy Fernandez, Action star and former mayoral candidate\n* German Moreno, former comedian, TV host and talent mamager\n* Richard Gomez, actor, model, sportsman\n* Boots Anson-Roa, actress and senatorial candidate of the campaign ticket (KNP)\n* Armida Siguion-Reyna, actress, singer, movie producer, chairman of the Movie and Television Review and Classification Board (1998-2001)\n* Red Sternberg, actor and candidate for City councilor of Pasay (LDP)\n* Rez Cortez, actor\n* Efren Reyes Jr., actor, director\n;Others:\n* Grace Poe Llamanzares, adoptive daughter and campaign volunteer\n* Rex Gatchalian, candidate for Valenzuela's 1st district representative\n;Organizations\n* FPJ-for-President Movement\n}}\nReligious endorsements\nThe issue with the Lacson's campaign which splits opposition made the Iglesia Ni Cristo and El Shaddai endorse the incumbent Arroyo. Also, while in campaign Rod Reyes, the media bureau head of the campaign stated that they don't need the voting bloc  to win, which was criticized by some of its members, and compared the campaign's boastfulness with the campaign of Estrada in 1998, who was treated as a brother by then-INC head Eraño Manalo.\nPoll protest\nAfter Poe's unsuccessful bid to the presidency, his supporters, which include the deposed Estrada's supporters, viewed the election results as flawed, and came under legal protest by Poe and his vice-presidential running-mate, former Senator Loren Legarda. The poll protest was later thrown out by the Supreme Court acting as the Presidential Electoral Tribunal, as well as Legarda's protest. There is a controversy, known as the Hello Garci scandal, on whether Gloria Macapagal Arroyo had actually won the elections due to allegations of vote rigging, but this was denied by Arroyo.\nPublic opinion\nOn January 25, 2008, a Pulse Asia survey (commissioned by the Genuine Opposition (GO) per former Senator Sergio Osmeña III) stated that 58% percent of Filipinos in Mindanao believed that President Gloria Macapagal Arroyo cheated in the 2004 Philippine general election. 70% also \"believed that because of recurring allegations of election fraud, the credibility of the balloting process in Mindanao was at a record low.\" Many Pangasinenses, on the other hand, still find it really hard to believe that Poe got no votes at all in the municipality of Santo Tomas, Pangasinan.\nAftermath\nFernando Poe Jr. died on December 14, 2004, after three days in comatose due to dizziness in the Christmas party at his production studio.\n12 years after FPJ's presidential run, his adopted daughter Grace Poe ran in the 2016 presidential election, finishing third in the vote count with over nine million votes, behind Mar Roxas and Davao City Mayor Rodrigo Duterte.\nSee also\n* Panfilo Lacson 2004 presidential campaign\n* Gloria Macapagal Arroyo 2004 presidential campaign\n* Raul Roco 2004 presidential campaign\nReferences"
    }
  ]
}