{
  "content": [
    {
      "type": "text",
      "text": "# Feudal barony of Clifford\n\nClifford Castle, Herefordshire, [[caput baroniae of the feudal barony of Clifford, destroyed in 1402 by Welsh forces during the rebellion of Owain Glyndŵr]]\nThe feudal barony of Clifford (or Honour of Clifford) was a feudal barony with its caput baroniae at Clifford Castle in Herefordshire, England.\nDescent\nde Tony\nThe Domesday Book of 1086 records that Clifford Castle was then held by Ralph de Tony (d.1102) (alias de Tosny, Tosni, etc.), feudal baron of Flamstead in Hertfordshire. It had been built by his brother-in-law William FitzOsbern, 1st Earl of Hereford (d.1071). William FitzOsbern was the husband of  Adeliza de Tosny, daughter of Roger I of Tosny and sister of Ralph de Tony (d.1102).\nde Clifford\nAt some time before 1127 the barony passed by means unexplained to Richard FitzPons (died 1138). Richard was the brother and heir of Drogo FitzPons, a tenant of estates in Herefordshire listed in the Domesday Book. Richard married Maud de Gloucester, daughter of Walter of Gloucester (died ) and sister of Miles of Gloucester, 1st Earl of Hereford. The son and heir of Richard FitzPons took the surname de Clifford after his father's barony (or due to his possible place of birth at Clifford Castle), as Walter de Clifford (died 1190).\nHe was succeeded by Richard de Clifford (died ), who died childless, and was succeeded by Walter de Clifford (died 1221), probably his brother. His eldest son Walter de Clifford (died 1263) succeeded to the barony, but leaving no male children the barony descended via his daughter, see below. Walter's younger son however was Roger de Clifford (died 1231) of Tenbury, who founded his own long-lived line of the Clifford family, later feudal barons of Appleby and feudal barons of Skipton, Baron de Clifford (1299), Earl of Cumberland (1525), Baron Clifford (1628) and Baron Clifford of Chudleigh (1672), which last title survives in 2015, borne by his direct male descendant, seated at Ugbrooke Park in Devon.\nWalter de Clifford (died 1263), heir to his father in the feudal barony of Clifford, married Margaret, the daughter of Prince Llywelyn ab Iorwerth of Wales, by whom he left a daughter and sole heiress Maud de Clifford (d.1282/5), who married firstly William Longespée (d.1257), grandson of William Longespée, 3rd Earl of Salisbury, and secondly John Giffard (d.1299) of Elston in Wiltshire, who held the barony jure uxoris. Maud de Clifford's daughter and sole heiress, by her 1st husband William Longespée, was Margaret Longespée (d.1306/10), de jure Countess of Salisbury, who regained possession of the barony following the death of her step-father John Giffard in 1299. She married Henry de Lacy, 3rd Earl of Lincoln (d.1311), feudal baron of Skipton. In 1310 the barony of Skipton was granted by the king to the junior de Clifford line, in the person of Robert de Clifford, 1st Baron de Clifford (d.1314), seated at Appleby Castle in Westmorland. Margaret Longespée's daughter and sole heiress was Alice de Lacy (d.1348), who died childless, having married three times: firstly to Thomas, Earl of Lancaster (d.1322), secondly to Ebulo Lestrange (1335) and thirdly to Hugh de Frene (d.1336). Clifford Castle was destroyed in 1402 by Welsh forces during the rebellion of Owain Glyndŵr.\nSources\n*Sanders, I.J. English Baronies: A Study of their Origin and Descent 1086-1327, Oxford, 1960, pp.&nbsp;35–6, Clifford\nReferences"
    }
  ]
}