{
  "content": [
    {
      "type": "text",
      "text": "# Feudal barony of Trematon\n\nThe Feudal barony of Trematon (or Honour of Trematon) was one of the three feudal baronies in Cornwall which existed during the mediaeval era. Its caput was at Trematon Castle, Cornwall. In 1166 it comprised 60 knight's fees, thus about 60 separate manors.\nDescent\nde Vautort\n, Devon: Argent, three bends gules a bordure sable bezantée. A bordure bezantée is a feature in the arms of many families which held under the overlordship of the Earls of Cornwall]]\nThe barony of Trematon was unusual in that unlike most other British feudal baronies it was not held from the king in-chief but from the descendants of Robert, Count of Mortain, half-brother of King William the Conqueror. It was held for several generations by the de Vautort family, Latinized as de Valletorta, which was once thought to come from Vautorte in Maine, but has since been shown to originate in Torteval in Normandy. The descent of the barony was as follows:\n*Godfrey de Vautort, held the Honour of Trematon from the Count of Mortain in 1084.\n*Reginald I de Vautort (died about 1123), was by 1086 a major tenant of Robert, Count of Mortain, with 57 manors centred on the castle and market of Trematon.\n*Roger I de Vautort (died about 1163), his son and heir, married Emma.\n*Ralph I de Vautort (died before 1173), his son and heir, who in 1166 according to the Cartae Baronum held 59 knight's fees from the earl of Cornwall, and one knight's fee in-chief.\n*Roger II de Vautort (died 1206), his son and heir.\n*Reginald II de Vautort (died 1245), his son and heir, married Joan, daughter of Thomas Basset of Headington.\n*Ralph II de Vautort (died 1257), his brother, married Joan, daughter of Reginald de Dunstanville, Earl of Cornwall.\n*Reginald III de Vautort (died 1269), his son and heir, died young without children.\n*Roger III de Vautort (died 1274), his uncle, after disposing of most of the family's holdings and leaving vast debts, died childless.\nWhat was left of the estates eventually found its way to the descendants of two daughters of Ralph I de Vautort. A younger son of Reginald I de Vautort was Joel de Vautort, whose descendants held lands in Somerset centred on the manor of Currypool in Spaxton until about 1332.\nEarls of Cornwall\n*Richard, 1st Earl of Cornwall (1209–1272), second son of King John and Isabella of Angoulême,  bought the barony in 1270.\n*Edmund, 2nd Earl of Cornwall (1249–1300), son and heir, died without progeny when the barony escheated to the crown.\n*Piers Gaveston, 1st Earl of Cornwall (d.1312), was granted the barony in 1309, but following his execution in 1312 it reverted to the crown.\n*Queen Isabella, wife of King Edward II, granted the barony in 1317, which she retained during her husband's reign.\n*John of Eltham, Earl of Cornwall (1316–1336), second son of King Edward II and his queen Isabella of France, was granted the barony in 1331, and died without progeny.\n*Edward, the Black Prince (d.1376), eldest son of King Edward III, was granted the barony in 1337.\nSources\n*Sanders, I.J. English Baronies: A Study of their Origin and Descent 1086–1327, Oxford, 1960, pp.&nbsp;90–1, Barony of Trematon\nReferences"
    }
  ]
}