{
  "content": [
    {
      "type": "text",
      "text": "# Feudal barony of Gloucester\n\nThe feudal barony of Gloucester or Honour of Gloucester was one of the largest of the mediaeval English feudal baronies in 1166, comprising 279 knight's fees,  or manors. The constituent landholdings were spread over many counties. The location of the caput at Gloucester is not certain as Gloucester Castle appears to have been a royal castle, but it is known that the baronial court was held at Bristol in Gloucestershire.\nDescent\nPre-Norman Conquest\nBrictric son of Algar\nAlthough English feudal baronies are generally stated to have been brought into existence by the early Norman kings of England following the Norman Conquest of 1066 and the subsequent feudal land tenure per baroniam, in the instance of the barony of Gloucester it is well recorded that many of the lands of the Norman barony had been held before 1066 by the great Saxon thegn Brictric son of Algar. According to the account by the Continuator of Wace and others, in his youth Brictric declined the romantic advances of Matilda of Flanders (c. 1031 – 1083), later wife of King William the Conqueror, and his great fiefdom was thereupon seized by her.\nDevonshire manors\nThe barony held many manors in Devon, where its local caput appears to have been the manor of Winkleigh. The principal sources of the barony's lands in Devonshire were from the former holdings of:\n*Brictric son of Algar/Queen Matilda\n*Walter de Claville\n*Gotshelm\n*Ansger\n*Aiulf\n*Morin of Caen\n*Saxon thanes of William the Conqueror:\n**Colwin\n**Godric\n**Godwin\nPost-Norman Conquest\nRobert FitzHamon\nMatilda of Flanders (c. 1031 – 1083), later wife of King William the Conqueror, seized Brictric's lands which after her death in 1083 reverted to the royal demesne of her eldest son  King William Rufus (1087–1100). The feudal barony proper was created when William Rufus granted the lands to his follower  Robert FitzHamon (died 1107), the conqueror of Glamorgan.\nRobert de Caen, 1st Earl of Gloucester\nMaud (or Mabel) FitzHamon the daughter and sole heiress of Robert FitzHamon brought the barony to her husband Robert de Caen, 1st Earl of Gloucester (pre-1100-1147), a natural son of King Henry I (1100–1135), the younger brother and successor of King William Rufus. Robert was created Earl of Gloucester by Henry I in 1122.\nWilliam Fitz Robert, 2nd Earl of Gloucester\nWilliam Fitz Robert, 2nd Earl of Gloucester (1116–1183), eldest son and heir of Robert de Caen, 1st Earl of Gloucester by his wife Maud FitzHamon, heiress of the barony. In his 1166 Cartae Baronum return he reported holding 279 knight's fees,  or manors. He was pre-deceased by his only son and thus left his three daughters as his co-heiresses, who became wards of the crown, Mabel, Isabel and Amice.\nPrince John Plantagenet\nFollowing the death of William Fitz Robert, 2nd Earl of Gloucester, in 1183, the barony escheated temporarily to the crown and was controlled by King Henry II (1154-1189) until 1189. In 1187 the custodian of the barony was charged scutage on 327 knight's fees, which included lands in Wales. In 1189 he granted one of the 2nd Earl's daughters in his wardship, Isabel FitzWilliam (d.1217), in marriage to his younger son the future King John (1199-1216), who was thereupon also granted by his father the feudal barony of Gloucester, to be held jointly with Isabel his wife, one of the co-heiresses to the barony.\nGeoffrey de Mandeville, 2nd Earl of Essex\nKing John (1199-1216) was divorced from Isabel in  1199 but retained control of the barony until 1214 when it passed to Geoffrey de Mandeville, 2nd Earl of Essex (c.1191-1216), whom King John had forced Isabel to marry. De Mandeville died two years later in 1216 then the barony escheated to the crown.\nHubert de Burgh, 1st Earl of Kent\nFollowing the death of her first husband in 1216, Isabel married secondly in 1217 to Hubert de Burgh, 1st Earl of Kent (c.1160–c.1243) Justiciar of England and Ireland, to whom the barony passed, until the death of Isabel in 1217.\nAmice FitzWilliam\nOn the death of Isabel in 1217 shortly after her second marriage, the barony passed to her surviving sister Amice FitzWilliam (d.1220), widow of Richard de Clare, 3rd Earl of Hertford  (c. 1153–1217), feudal baron of Clare in Suffolk. The barony subsequently passed into the family of her descendants the de Clare family, Earls of Gloucester, until the death of Gilbert de Clare, 7th Earl of Hertford, 8th Earl of Gloucester (1291–1314) at the Battle of Bannockburn in 1314.\nGilbert de Clare, 4th Earl of Hertford, 5th Earl of Gloucester\nor badge of de Clare: Gules, three clarions or. The clarions, a form of mouth-organ, are believed not only to be a play on the family's original seat of Clare in Suffolk but also a play on their position as Lords of Glamorgan. These arms are visible on the seal of Margam Abbey in Glamorgan, the arms of Keynsham Abbey in Somerset and on the armorial tiles of Neath Abbey, Glamorgan, all of which houses were either founded by or escheated to the early Earls of Gloucester in the pre-heraldic era. They were later adopted by the Grenville family of Bideford in Devon, held from the de Clares as feudal barons of Gloucester, and Stowe, Kilkhampton in Cornwall. The de Clares used an additional coat of arms: Or, three chevrons gules]]\nGilbert de Clare, 4th Earl of Hertford (c.1180-1230) also  5th Earl of Gloucester, (or 1st Earl of Gloucester of new creation), feudal baron of Clare. He married in 1217 Isabel Marshal and was recognised in 1218 as Earl of Gloucester.\nRichard de Clare, 5th Earl of Hertford, 6th Earl of Gloucester\nRichard de Clare, 5th Earl of Hertford, 6th Earl of Gloucester (4 August 1222 – 14 July 1262)\nGilbert de Clare, 6th Earl of Hertford, 7th Earl of Gloucester\nGilbert de Clare, 6th Earl of Hertford, 7th Earl of Gloucester (1243–1295)\nGilbert de Clare, 7th Earl of Hertford, 8th Earl of Gloucester\nGilbert de Clare, 7th Earl of Hertford, 8th Earl of Gloucester (1291–1314). On his death the feudal barony of Clare passed to his youngest sister Elizabeth de Clare (d.1360). His co-heiresses to the feudal barony of Gloucester were his two sisters Eleanor de Clare (d.1337) and Margaret de Clare (d.1342).\nSources\n*Sanders, I.J. English Baronies, a Study of their Origin and Descent 1086-1327, Oxford, 1960, p.&nbsp;6, Barony of Gloucester\nReferences"
    }
  ]
}