{
  "content": [
    {
      "type": "text",
      "text": "# Filip Hammar and Fredrik Wikingsson\n\nLars Filip Hammar (born 26 March 1975) and Fredrik Wikingsson (born 16 August 1973), commonly known as Filip och Fredrik, are two Swedish writers, television hosts and journalists both known for their youthful, though intellectual, humor and unconventional journalism. In 2024, they released their film The Last Journey, becoming the highest-grossing Swedish documentary in history, later it was selected as the Swedish entry for the Best International Feature Film at the 97th Academy Awards.\nFilip and Fredrik have produced eleven different TV shows together and are book authors. The duo founded their company \"Framgångsfabriken\" (The Success Factory), which started in 2001 and takes credit for their media appearances. The pair have had their sexuality questioned repeatedly by the people they interact with on camera. Although they are heterosexual, jokes about their would-be gay relationship have become a running gag.\nEarly life and career\nFilip was born in Köping, Sweden, the son of teachers Lars and Tiina Hammar. His mother is from Estonia. He is the brother of Linda Hammar. Fredrik was born in Vänersborg, Västra Götaland County, Sweden but moved to Sundsvall as a young boy. He studied journalism at the Mid Sweden University. In the 1990s they mostly worked as freelance journalists with Café, VeckoRevyn, Bon and Elle. Wikingsson was for a short time reporter for a harness racing show on TV4.\nFilip Hammar and Fredrik Wikingsson met each other when they were both working for Aftonbladet in 1996.\nTelevision career\nTheir first TV appearance together was in 2000 as Christer Ulfbåge's sidekicks in Hello Sydney, Sveriges Television's TV coverage of the Olympic Games in Sydney. In each program, the TV viewers could chat with Filip and Fredrik who then, in short segments, presented the viewers' opinions about different topics and events. The duo was heavily criticized for their efforts and did not get along well with the show's host Ulfbåge. Anders Björkman, a famous Swedish TV critic, disliked Filip and Fredrik's appearance in the show to the extent that he wrote the line \"give me a gun and two shells and the problem will be over\" as a comment on the show. Also according to Filip and Fredrik themselves, the show was considered a flop. But this was the first time the viewer could watch them as a duo.\nThe first breakthrough came in 2002 with their hidden camera program Ursäkta röran (vi bygger om) (Pardon the mess (we're redecorating)) broadcast by TV4. The program created viewer storms, and debates and was reported to the Swedish Broadcasting Commission several times. Six episodes were made but only four aired. The concept involved Filip and Fredrik making fun of both famous and unknown people using a hidden camera and similar setups. The show was largely influenced by shows like Pyjamas, a similar show that aired the year before on the youth channel ZTV. The jokes were of a rather unusual, sometimes experimental, nature and some viewers took offense, feeling that the pair were humiliating innocent people. Often the \"jokes\" were taken far beyond what in most people produced a laugh. The show made headlines due to a segment called \"the Swedish Nazi-reference championship\" where they fooled singer and former Expedition Robinson-star Emma Andersson into an interview where they made as many Nazi references as possible and observed her reactions. Due to that segment, TV4 was fined by the Swedish Broadcasting Commission which argued that, since Emma was not a political person, the segment was intrusive to her privacy and integrity. Fredrik later said that Ursäkta röran (vi bygger om) was an order from TV4 because they wanted a show that 90% hated and 10% liked.\nFilip and Fredrik were after Ursäkta röran guests in the program Position X, also on TV4, where they showed Tommy Körberg's phone number on TV. The duo managed to provoke the audience again, which meant that they left TV4 and went to a small Stockholm-specific local channel called Öppna kanalen, where they made a talk show called Öppna dagar (Open days) in 2003. All technical personnel were female high school students and the featured guests were mostly local celebrities. The show was canceled in the middle of the season due to its lack of popularity.\n2003–2005: High Chaparall\nLater in 2003, now working for the Swedish broadcasting company Kanal 5, Filip and Fredrik made a comeback in the program series High Chaparall, which was a success. In High Chaparall, Filip and Fredrik took a camera team to the United States, where they filmed a series of interviews with minor celebrities and has-beens such as Fabio Lanzoni, Pamela Anderson, Ron Jeremy, Tonya Harding, Uri Geller, and Gary Busey. A typical episode features Filip and Fredrik visiting a celebrity at home in Los Angeles, asking them personal questions while taking a tour of their house, singing a song for them (often a Swedish song that has been translated into English), an outing to one of the star's favorite places to eat and a series of elaborate would-you-rather questions. At some point, they administer a quick quiz called \"Bra eller anus\" (Good or anus) in which the interviewee is presented with an idea, a thing, or a description of a person, and must deem them \"bra\" or \"anus.\" The series is almost entirely in English.\nWith varying levels of success, Filip and Fredrik would be welcomed into the lives of these celebrities who would introduce them to their families, sing with them, take the Swedes to their favorite restaurants and speak candidly about their lives. Some of their interview subjects seemed to become genuinely entertained with and endeared to the duo (Vince Neil of Mötley Crüe and his parents, Charlene Tilton of the TV series \"Dallas\" and her daughter) whereas the subjects of other episodes become increasingly more uncomfortable during their relentless onslaught of questions, games and songs (Lorenzo Lamas). The viewing figures for the first season had an average of 223,000, which was at that time a huge number for Kanal 5.\n1 October 2004, the duo released their second book 100 höjdare – Sveriges roligaste ögonblick genom tiderna. A month later, a TV version of the book with the same name, aired. It was a countdown show where Filip and Fredrik listed their choices of the funniest moments in Swedish history. The moments selected were originally not intended to be funny, i.e. no sketches or jokes, etc. The second and third seasons became a talk show where Filip and Fredrik showed clips from around the world for the guests, though it still had the same countdown style.\nIn 2005, in between season two and season three of 100 höjdare, the duo made a show called Grattis världen. It was a travel show where Filip and Fredrik visited New Zealand, Tokyo, the Cook Islands, and Estonia among others. The travel program differed much from the previous Swedish travel programs because Filip and Fredrik often wanted to show off alternative sides of the various places they visited. For example, they tested the legal recreational drugs in New Zealand. The general plot was quite similar to High Chaparall and accompanied by eccentric people picked up by the way. Pål Hollender, known from Expedition: Robinson, shows up here and there in the program as the program's feature producer. This was the first time he worked with Filip and Fredrik, something that he has been doing after Grattis världen too.\n2006–2007: The Kristallen awards and becoming more \"folksy\"\n2006 and 2007 were two eventful years for Filip and Fredrik. It started with their new program Ett herrans liv, a program where they celebrated different famous Swedish people. In that program, they got the chance to meet the Swedish prime minister at that time, Göran Persson. According to Fredrik, this was the thing that made them more \"folksy\" among the Swedish viewers. Filip and Fredrik were appointed 2006 years innovators by the Swedish television award Kristallen. And they also got one award for Grattis världen and one for season three of 100 höjdare. In the autumn, they reinvented the 100 höjdare concept and made it to a show where they met 10 eccentric persons in each episode. They were hosts for Rockbjörnen 2006 in January 2007. The spring continued with more Ett herrans liv and season five of 100 höjdare, where they expanded their search for unique people to Denmark and Norway.\nIn September 2007 both the show Boston Tea Party and the animated sitcom Myggan premiered. Boston Tea Party was described as a \"knowledge program on steroids\" and \"asks the questions you've always been thinking about but never dared to ask\". Myggan was an animated sitcom in style with The Simpsons and Family Guy. The sitcom featured and ridiculed a lot of famous Swedish people.\n2008–2010: Vem kan slå Filip and Fredrik and Söndagsparty\nA Swedish version of ProSieben's Schlag den Raab, Vem kan slå Filip and Fredrik (Who can beat Filip and Fredrik?), which first aired 9 September 2008, on Kanal 5. Ingvar Oldsberg host the show and each week a contender selected by the audience compete against Filip and Fredrik in 15 games spread across three programs. The show ended after 9 episodes. In season 2 there was a new challenger for every program, competing in 11 games. This time the show was hosted by Felix Herngren. In season 3, Pontus Gårdinger is hosting the show.\nIn 2009, Söndagsparty med Filip & Fredrik (Sunday party with Filip and Fredrik) premiered. This talk show premiered on 19 April at 9&nbsp;pm on Sweden's Kanal 5, and is one of the most expensive shows it has ever produced. Based in New York, the program features American and Swedish celebrities. The program itself is mostly in Swedish and the studio audience is made up of New York-based Swedes. Filip & Fredrik describe the show as \"a little sweaty, a little naked, and a whole lotta soul\".\nThe first show featured Marilyn Manson and Jonas Gardell and confirmed future guests include television chef Tina Nordström, singer-songwriter Håkan Hellström, actor Mikael Persbrandt, as well as Joan Rivers and Martin Sheen. Recurring segments include skits with personalities from 100 höjdare and Reverend Hammar of the Universal Life Church exercising his newly acquired licence to perform wedding ceremonies on couples flown in from Sweden.\n2010–2012: Filip and Fredrik's podcast\nIn 2010, it was announced that Aftonbladet would produce and distribute a podcast hosted by Filip and Fredrik, a podcast that was to become one of the largest Swedish podcasts on iTunes. The first season started in the summer of 2010 and lasted for no more than five episodes. The podcasts were recorded while Filip and Fredrik were driving around Stockholm as well as the Swedish countryside on their way to various locations. The content of the first season existed mainly in a bunch of phone calls made by Filip and Fredrik to a number of Swedish celebrities as well as a few discussions and observations about current events and more.\nThe second and current season was launched in the fall of 2010 and this time without both the celebrity phone calls and the road trip element. Now the podcast is instead almost always recorded with Filip sitting in his new home in Los Angeles and with Fredrik sitting \"with a slight slouch\" down in the basement of his house back in Stockholm or, recently, in his car as it's the only place where he has a solid internet connection.\nThe podcast is edited by Sigge Eklund and the theme song, which has been covered in various music genres and languages by several podcast listeners, was created by Stefan Andolf. Swedish folk duo First Aid Kit performed a version of the theme song for the 72nd episode, released on 9 February 2012.\nAs of early 2012, the podcast is no longer distributed by or in any way affiliated with Aftonbladet. And as of 19 September 2012, the podcast can also be found on Spotify as well as, according to Fredrik, \"the somewhat fuzzy\" Radio Play.\nBetween the years 2010 and 2012, Filip and Fredrik continued to produce different kinds of shows, for example, Lite sällskap, a reality show about lonely people finding company, and Nittileaks, a talk show about memories from the '90s.\nThe duo wins the Kristallen award for \"Best male TV host\" in 2011 and 2012.\n2011–2018: Nexiko and Breaking News\nThe group's talk show Breaking News with Filip and Fredrik premiered on Kanal 5 in the fall of 2011. During each show, a number of guests were invited to discuss current topics. At the turn of the year 2012–13 the duo left the production company Stockholm-Köpenhamn which they started in 2001 (and sold in 2007). They announced that they've started a new production company called Nexiko together with Lars Beckung, who was program director at Kanal 5 until April 2012. The first program of the new company was an interview program series called Hissen (The elevator). In 2015, their successful travel show Six Degrees of Separation premiered.\n2019–present: Alla mot Alla\nIn 2019, Filip and Fredrik's long-running trivia show, Alla mot Alla (\"Head to head\") premiered. The show quickly gained a large, loyal following which has allowed it to run for more than 12 seasons, airing over 700 episodes. The format has since also been produced in Denmark, Norway, Finland and Belgium.\nThe Last Journey\nFilip and Fredrik's third feature film The Last Journey is a deeply personal documentary about Filip's aging father, the high school teacher Lars Hammar, who after his retirement, found it hard to keep his spirits high. Filip and Fredrik embark on a trip to southern France, aiming to rekindle the zest for life of Filip's father.\nThe film has achieved groundbreaking success in Swedish cinemas, becoming the most-watched documentary in the country's history. The Last Journey has also been selected as Sweden's official submission for Best International Feature at the 97th Academy Awards. The film was also screened in some Asian cinemas.\nPersonal life\nFilip Hammar\nFilip Hammar resides in Los Angeles with his fiancée, actress Agnes Lindström Bolmgren, and his two children Ilse and Tage.\nFredrik Wikingsson\nFredrik Wikingsson lives in Stockholm, Sweden with his wife Johanna Swanberg and their two daughters Pella and Joni.\nFilmography\n;Own produced shows\n* ''Ursäkta röran (vi bygger om) \"Pardon the mess (we're redecorating)\" (2002)\n* Öppna dagar \"Open Days\" (2003)\n* High Chaparall (2003–2005, 2008)\n* 100 höjdare \"100 Highlights\" (2004–2008)\n* Grattis världen \"Congratulations, the World\" (2005)\n* Ett herrans liv \"What a Life!\" (2006–2007)\n* Boston Tea Party (2007–2010)\n* Söndagsparty \"Sunday Party With Filip and Fredrik\" (2009)\n* Lite sällskap \"A Little Company\" (2010)\n* Nittileaks \"Ninetyleaks\" (2011)\n* Breaking News \"Breaking News With Filip and Fredrik\" (2011–2013, 2015)\n* Får vi följa med? \"May We Join You?\" (2012)\n* Hissen \"The Elevator\" (2013)\n* Nugammalt \"New & Old\" (2013)\n* La Bamba (2014)\n* Ska vi göra slut? \"Should we call it Quits?\" (2014)\n* Jorden runt på 6 steg \"Six Degrees of Separation\" (2015–2016)\n* Alla mot alla med Filip och Fredrik \"Everyone against everyone with Filip and Fredrik\" (2019–)\n;Specials\n* Racet till Vita huset \"Race To The White House\" (2008)\n* Filip & Fredriks årskrönika \"The Yearbook\" (2011, 2012)\n* Oscarsgalan med Filip och Fredrik \"The Oscars with Filip and Fredrik\" (2011, 2012)\n* Roast & toast: 10 år med Filip och Fredrik \"Roast & Toast, 10 years with Filip and Fredrik\" (2013)\n* Kanal 5's nyårsgala \"Channel 5's New Year Gala\" (2013)\n;Participation in other programs\n* Hello Sydney (2000)\n* Rockbjörnen \"Swedish Grammys\" (2006)\n* Sverige dansar och ler \"Sweden dances and smiles\" (2007)\n* På spåret \"On the Tracks\" (2007–2010)\n* Vem kan slå Filip & Fredrik? \"Who can Beat Filip and Fredrik\" (2008–2012, 2014–2015)\n* Doobidoo (2013)\nBibliography\n*Två nötcreme och en Moviebox \"Two nutcremes and a Moviebox\" (2003)\n*100 höjdare \"100 Highlights\" (2004)\n*Så tar du ut din lön i Choklad \"How to cash your paycheck in chocolate\" (2006)\n*Tårtgeneralen \"The Cake General\" (2018)\n*The Last Journey \"Den sista resan\"'' (2024)\nReferences"
    }
  ]
}