{
  "content": [
    {
      "type": "text",
      "text": "# Final Battle (2020)\n\n|buyrate    =\n|tagline    =\n|liveevent  = Y\n|lastevent  = Gateway to Honor\n|nextevent  = ROH 19th Anniversary Show\n|event      = Final Battle\n|lastevent2 = 2019\n|nextevent2 = 2021\n|future     =\n|current    =\n}}\nFinal Battle (2020) was a professional wrestling event produced by American promotion Ring of Honor (ROH). It took place on Thursday December 10, 2020 and aired on tape delay on Friday, December 18 at the UMBC Event Center in Baltimore, Maryland. It was the 19th event under the Final Battle chronology.\nThis was ROH's only pay-per-view event in 2020, as two previously scheduled events to have taken place in March (ROH 18th Anniversary Show and Supercard of Honor XIV) were cancelled due to the COVID-19 pandemic, with ROH subsequently going on a five-month hiatus during the pandemic, and resuming operations in August.\nStorylines\n{|class=wikitable style=\"font-size:90%; margin: 0.5em 0 0.5em 1em; float: right; clear: right;\"\n|+ Other on-screen personnel\n!|Role:\n!|Name:\n|-\n|rowspan=3|Commentators\n|Ian Riccaboni\n|-\n|Caprice Coleman\n|-\n|Rocky Romero\n|-\n|Ring announcer\n|Bobby Cruise\n|-\n|rowspan=2|Referees\n|Joe Mandak\n|-\n|Todd Sinclair\n|-\n|Interviewer\n|Quinn McKay\n|}\nThe event featured 10 professional wrestling matches, which involve different wrestlers from pre-existing scripted feuds, plots, and storylines that play out on ROH's television programs. Wrestlers portray villains or heroes as they follow a series of events that build tension and culminate in a wrestling match or series of matches.\nResults\n|note1  = pre\n|match1 = Tony Deppen defeated LSG, Josh Woods, Dak Draper\n|stip1 = Four Corner Survival match for a shot at the ROH World Television Championship later in the show\n|time1 = 11:42\n|note2  = pre\n|match2 = The Foundation (Tracy Williams and Rhett Titus) defeated Fred Yehi and Wheeler Yuta\n|stip2 = Pure Rules tag team match\n|time2 = 13:51\n|match3 = The Foundation (Jay Lethal and Jonathan Gresham) (c) defeated  Mark Briscoe and PCO\n|stip3 = Tag team match for the ROH World Tag Team Championship\n|time3 = 12:40\n|match4 = Rey Horus defeated Dalton Castle\n|stip4 = Singles match\n|time4 = 9:10\n|match5 = The OGK (Matt Taven and Mike Bennett) defeated The Righteous (Vincent and Bateman) (with Vita VonStarr)\n|stip5 = Tag team match\n|time5 = 16:19\n|match6 = Danhausen defeated Brian Johnson by disqualification\n|stip6 = Singles match\n|time6 = 8:44\n|match7 = Dragon Lee (c) defeated Tony Deppen\n|stip7 = Singles match for the ROH World Television Championship\n|time7 = 11:50\n|match8 = Shane Taylor defeated Jay Briscoe\n|stip8 = Singles match\n|time8 = 13:49\n|match9 = Jonathan Gresham (c) defeated Flip Gordon by referee stoppage\n|stip9 = Pure wrestling rules match for the ROH Pure Championship\n|time9 = 24:37\n|match10 = Rush (c) defeated Brody King\n|stip10 = Singles match for the ROH World Championship\n|time10 = 16:35\n}}\nNotes\nReferences"
    }
  ]
}