{
  "content": [
    {
      "type": "text",
      "text": "# Fiona Hill (presidential advisor)\n\n| image            = Fiona Hill MSC 2017 (cropped).jpg\n| office = Chancellor of Durham University\n| 1blankname =\n| 1namedata =\n| term_start       = 29 June 2023\n| term_end         =\n| predecessor      = Sir Thomas Allen\n| successor        =\n| office1          = Senior Director for Europe and Russia on the United States National Security Council\n| term_start1      = April 4, 2017\n| term_end1        = July 19, 2019\n| president1       = Donald Trump\n| predecessor1     = Celeste Wallander\n| successor1       = Tim Morrison\n| birth_date       =\n| birth_place      = Bishop Auckland, County Durham, England\n| death_date       =\n| death_place      =\n| citizenship      =\n| spouse           =\n| children         = 1\n| alma_mater       =\n}}\nFiona Hill  (born 1 October 1965) is a British-American academic, foreign affairs advisor and author, who since 2023 has served as Chancellor of Durham University.\nAppointed a defence adviser upon Labour's election to Government in July 2024, Hill was formerly an official at the U.S. National Security Council, specializing in Russian and European affairs. She was a witness in the November 2019 House hearings regarding the impeachment inquiry during the first impeachment of Donald Trump.\nHill read Russian at the University of St Andrews (graduating MA), then pursued postgraduate studies in History at Harvard University (taking a PhD in 1998), before being elected a Senior Fellow at the Brookings Institution in Washington.\nEarly life and education\nHill was born in 1965 at Bishop Auckland, County Durham, in North East England, a daughter of a coal miner, Alfred Hill, and midwife, June Murray. Her father died in 2012; her mother still lives in Bishop Auckland. In the 1960s, as many of the local coal mines were closing, her father wanted to emigrate to find work in the mines of Pennsylvania or West Virginia, but his mother's poor health required him to stay in England. He subsequently worked as a porter in a hospital.\nHill's family struggled financially. June sewed clothes for her daughters and at the age of 13, Fiona began working at odd jobs, including washing cars and working as a waitress at a local hotel. She and her sister attended Bishop Barrington School, a local comprehensive school. In 2017, she recalled applying for the University of Oxford: \"I applied to Oxford in the '80s and was invited to an interview. It was like a scene from Billy Elliot: people were making fun of me for my accent and the way I was dressed. It was the most embarrassing, awful experience I had ever had in my life.\"\nShe then read history and studied Russian at the University of St. Andrews in Scotland. She has said the manager of the Royal and Ancient Golf Club threatened to blacklist her when she reported being sexually assaulted while waitressing during her student days in St Andrews.\nIn 1987, she was an exchange student in the Soviet Union, where, while interning for NBC News as a translator, she witnessed the signing of the Intermediate-Range Nuclear Forces Treaty by Ronald Reagan and Mikhail Gorbachev. An American professor encouraged Hill to apply for a graduate program in the United States. She later wrote about her negative experience in The Siberian Curse: \"I noticed that many aspects of British (and, by relation, American) culture were surprisingly, even unexpectedly similar, and that the Russians and the West had a good deal in common. Before long, other aspects of the Soviet and Russian [...] mentalities and cultures reared their heads, and these gaps seemed larger and more consuming than any novel or textbook could transmit\". Continuing in another passage, she writes: \"Whether or not these gaps can be effectively bridged or, at least, mitigated will remain the guiding question for this field of study for decades to come.\"\nAt Harvard University, she graduated with a master's degree in Russian and Modern History in 1991, and a Ph.D. in History in 1998 under Richard Pipes, Akira Iriye, and Roman Szporluk. While at Harvard, Hill was a Frank Knox Fellow. Her doctoral thesis was In search of great Russia: elites, ideas, power, the state, and the pre-revolutionary past in the new Russia, 1991–1996.\nCareer\nat a June 27, 2018 meeting with Vladimir Putin]]\nEarly career\nFrom 1991 to 1999, Hill worked in the research department at the John F. Kennedy School of Government at Harvard University. In 1992, she served as coordinator for a \"Trilateral Study on Japanese-Russian-U.S. Relations\" there and, from 1993 to 1994, she was director of the Ethnic Conflict Project.\nIn 1999, Hill was associate director of Harvard University's Strengthening Democratic Institutions project. She served as director of Strategic Planning for the Eurasia Foundation from 1999 to 2000.\nU.S. Government service\nHill was an intelligence analyst under Presidents George W. Bush and Barack Obama from 2006 to 2009 with the National Intelligence Council as an analyst of Russia and Eurasia.\nThink tanks\nHill is a member of the Council on Foreign Relations and the board of trustees of the Eurasia Foundation.\nAt the Brookings Institution, Hill worked closely with Igor Danchenko. In 2010, Danchenko, Hill and Erica Downs co-authored a paper titled \"''One Step Forward, Two Steps Back? The Realities of a Rising China and Implications for Russia's Energy Ambitions''\". Hill introduced Danchenko to Christopher Steele and to U.S.-based public relations executive Charles Dolan Jr., who would later become one of Danchenko's sources for the Trump–Russia dossier.\nTrump administration (2017–2019)\nIn 2017, Hill took a leave of absence from the Brookings Institution, where she was director for the Center on the United States and Europe, while also on the National Security Council.\nHill was appointed, in the first quarter of 2017, Deputy Assistant to the President and Senior Director for European and Russian Affairs on President Trump's National Security Council staff.\nHill had been due to leave the White House to return to Brookings in April 2019. She developed a close working relationship with National Security Advisor John Bolton, and at Bolton's request, Hill agreed to stay on until mid-July, after which Tim Morrison would replace her. As planned, Hill left the White House on July 15, ten days before the Trump–Zelenskyy telephone call.\nSubsequently, Hill has spoken of the difficulty of maintaining a consistent U.S.-Russia policy under President Trump, a result of the clash of her \"hawkish\" view on Russia and Trump's intermittently warm and welcoming approach, and of the difficulty of ascertaining what Trump and Putin discussed in private meetings. Hill believed that Trump idolized Putin and fell into a trap he set at the Helsinki meeting.\nImpeachment inquiry testimony\nOn October 14, 2019, responding to a subpoena, Hill testified in a closed-door deposition for ten hours before a committee of the United States Congress as part of the impeachment inquiry against President Donald Trump during his first impeachment. Some Republicans questioned the credibility of her testimony, including Connie Mack IV, who described Hill as a \"George Soros mole infiltrating the national-security apparatus\".\nShe testified in public before the same body on November 21, 2019. While being questioned by Steve Castor, the counsel for the House Intelligence Committee's Republican minority, Hill commented on Gordon Sondland's involvement in the Ukraine matter: \"It struck me when (Wednesday), when you put up on the screen Ambassador Sondland's emails, and who was on these emails, and he said these are the people who need to know, that he was absolutely right,\" she said. \"Because he was being involved in a domestic political errand, and we were being involved in national security foreign policy. And those two things had just diverged.\"\nIn response to a question from that committee's chairman, Rep. Adam Schiff, Hill stated: \"The Russians' interests are frankly to delegitimize our entire presidency...&nbsp;The goal of the Russians [in 2016] was really to put whoever became the president — by trying to tip their hands on one side of the scale —&nbsp;under a cloud.\"\nPost-White House\nIn her post-White House career, Hill returned to academia. With four other Russia experts, Jon Huntsman Jr. (former Republican Governor and Trump's Ambassador to Russia), Robert Legvold (a retired Professor in International Relations), Rose Gottemoeller (professor and former Deputy Secretary-General of NATO), and Thomas R. Pickering (retired diplomat and Clinton's Ambassador to Russia), she wrote an op-ed in Politico Magazine wherein they state that, although Russia is and will likely remain greatly disharmonious with Western Europe and North America, it is in the security interests of the United States to seek co-operation where possible.\nHill's views on Russia could be characterized by increasing pessimism on co-operation with the United States, as she expressed fear that even Russia's foremost oppositional politician, the now-deceased Alexei Navalny, employed populism and had a history of engaging nationalism. When asked if such statements could be considered \"russophobic\", Hill responded that \"people may think what they will\" and that \"it's foolish to disregard objective truths\" in service of political etiquette.\nAmong many analysts sought for their assessment of the January 6 assault on the Capitol in 2021, Hill stated to The Daily Beast, \"The President was trying to stage a coup. There was little chance of it happening, but there was enough chance that the former Defense Secretaries had to put out that letter, which was the final nail through that effort. They prevented the military from being involved in any coup attempt. But instead, Trump tried to incite it himself, [t]his could have turned into a full-blown coup had he had any of those key institutions following him. Just because it failed or didn't succeed doesn't mean it wasn't real.\" On January 11, 2021, an opinion authored by Hill explicated the basis for her assessment of the attempted coup that precipitated the second impeachment of Donald Trump.\nOctober 2021 saw the release of Hill's book There Is Nothing for You Here: Finding Opportunity in the 21st Century, published by Houghton Mifflin Harcourt. NPR described the book as \"part memoir, part history tome, and part policy prescription\".\nIn an October 2021 interview, while recounting her tenure at the White House, Hill drew several parallels between Trump and Putin, noting that both leaders had displayed a penchant for personal power, public performance, and used public nostalgia to gain support. Trump for his part described her as \"a deep state stiff with a nice accent\".\nDuring an interview by The New York Times on April 11, 2022, Hill was asked about the motivation for the January 6 rally and provoking the assault on the Capitol. She responded that it was \"Trump pulling a Putin\" in that he was attempting to remain in office similarly to Putin's having extended his term, because of Trump's yearning \"to stay in power like the strongmen he admired\".\nShe succeeded Sir Thomas Allen as Chancellor of Durham University in June 2023.\nShe was elected to a six-year term on the Harvard Board of Overseers in 2023. Hill was appointed Companion of the Order of St Michael and St George (CMG) in the 2024 New Year Honours for \"services to international relations\".\nOn March 28, 2025, Hill's security clearance was revoked by Director of National Intelligence, Tulsi Gabbard.\n2022 Russian invasion of Ukraine\nOn February 28, 2022, during the Russian invasion of Ukraine, Hill was asked by Politico's senior editor Maura Reynolds if she thought Vladimir Putin would use Russia's nuclear weapons and responded by saying, \"Putin is increasingly operating emotionally and likely to use all the weapons at his disposal, including nuclear ones.\" She stated, \"Every time you think, 'No, [Putin] wouldn't, would he?' Well, yes, he would.\" Hill also stated that she believes that World War III is in progress and that the invasion of Ukraine exemplifies that.\nIn a later interview with Politico, Hill said the war is the third great power conflict in Europe in a little over a century, saying \"it's the end of the existing world order. Our world is not going to be the same as it was before.\"\nUK Government service\nHill was appointed a Defence Advisor to HMG following the 2024 United Kingdom general election, and is one of three external reviewers leading its Strategic Defence Review, with General Sir Richard Barrons and Lord Robertson of Port Ellen.\nPersonal life\nHill met her husband, Kenneth Alvin Keen (born 1966), at Cabot House while a graduate student at Harvard. They have a daughter. Hill became a U.S. citizen in 2002.\nSelected works\nHill's books include:\n*\n*\n*\n*\nSee also\n*Trump–Ukraine scandal\n*Second impeachment of Donald Trump\nReferences\nExternal links\n*\n* [https://www.theglobalist.com/fiona-hill-impeachment-hearings-donald-trump-russia-ukraine/ Hill articles] at The Globalist"
    }
  ]
}