{
  "content": [
    {
      "type": "text",
      "text": "# First Luso-Malabarese War\n\n)\n| place             = Indian Ocean, Malabar Coast, India.\n| result            = Portuguese victory\n| territory         =\n| combatant1        =  Portuguese Empire  Supported by: Kingdom of CochinKingdom of Cannanore (until 1507)Kingdom of KollamKingdom of Tanur (1504 on)\n| combatant2        = Kingdom of Calicut  Supported by: Mamluk EgyptKingdom of Tanur (up to 1504)\n| commander1        =\n* Lourenço de Brito\n* Afonso de Albuquerque\n* Tristão da Cunha\n* Dom Fernando Coutinho\n*Unni Goda Varma of Cochin\n*Narayan\n}}\n| commander2        = Zamorin of CalicutNaubeadarimKhawaja KasseinKhawaja AmbarKunjali MarakkarAmir Husain Al-Kurdi\n| strength1         =\n| strength2         =\n| casualties1       =\n| casualties2       =\n}}\nThe First Luso–Malabarese War was the first armed conflict fought by the Portuguese Empire in Asia, and the first of nine against the Zamorin of Calicut, then the preeminent power on the Malabar Coast, in India. Hostilities broke out in 1500 and continued for thirteen years until the ruling Zamorin was assassinated and his successor signed a peace treaty with the Portuguese governor of India Afonso de Albuquerque.\nThe conflict erupted over trade. Though himself a Hindu, the Zamorin was closely associated with and heavily dependent on the influential Muslim merchant community of Calicut. Wary of the threat that the Portuguese posed to their interests, they interfered with and disrupted Portuguese attempts to trade in India or negotiate with the Zamorin.\nSome of the most famous Portuguese personalities of the Age of Discovery participated in the war, such as Vasco da Gama, Pedro Álvares Cabral, Dom Francisco de Almeida and Afonso de Albuquerque, while the actions of some commanders like the defense of Cochin by Duarte Pacheco Pereira are considered of some of the greatest exploits in the military history of Portugal. It involved a significant part of Portuguese society whether directly or indirectly, many joining the service of King Manuel in the armadas attracted by the prospects of wealth and glory despite the very high risks due to disease, enemy action or shipwrecks. \"It was a supreme national effort that called on all the available resources of manpower, shipbuilding, material provision and strategic vision to exploit a window of opportunity before Spain could react. In the process, the Portuguese took both Europe and the peoples of the Indies by complete surprise.\"\nBy simply sailing to India around Africa, the Portuguese incurred in the hostility of the entire Muslim community involved in the east–west trade, as well as the Republic of Venice whose commercial interests were threatened. Although the Nair armies of the Zamorin were large, they proved inflexible compared to the smaller but heavily armed forces of the Portuguese, while his actions were almost invariably spied upon and leaked to the Portuguese by their Malabarese allies who resented the rule of Calicut. The Portuguese also gathered the support of the Saint Thomas Christians. The Zamorin sought to hire experienced Arab privateers and took in European defectors or specialists, though this ultimately proved insufficient to counteract the Portuguese.\nDissenting voices favouring terms with the Portuguese eventually rose within Calicut itself. Losses were heavy for Calicut, whether in terms of lives, resources or prestige: several vassals defected, a large number of merchants quit the city to trade elsewhere, and ultimately the ruling Zamorin was himself assassinated. His successor negotiated a peace treaty and a fortress was built at Calicut.\nThe Trimumpara raja of Cochin was a rebellious tributary vassal of Calicut and the first ruler in India to seek an alliance with Portugal. He emerged from the conflict as an alternative power to the Zamorin on the Malabar Coast as a result of his association with the Europeans.\nThe conflict is also noteworthy as the first war fought by Europeans on the subcontinent ever since the withdrawal of the Seleucids and the Greeks from India over 1500 years prior.\nBackground\nAfter decades of exploratory efforts around the coasts of Africa, on 17 May 1498 Vasco da Gama reached Calicut in India.\nCalicut was at this time the most important commercial city in the Malabar Coast. Arabs had established trade there about 600 years before and the city contained a great number of Muslim merchants from Egypt and Arabia or born locally, called Mappilas. They imported great quantities of valuable goods from the Middle-East through the Red Sea on large fleets and took back spices and local products, mostly pepper. These were bought at Alexandria in Egypt by Venetians, and redistributed to Europe. As a result of this trade, they were wealthy and highly influential in Calicut.\n.]]\nPleased by the arrival of a new set of foreigners that would increase the trade in his city, the Zamorin offered to provide the Portuguese with as much cargo as they desired. Wary of Portuguese competition however, the powerful Muslim merchant community sought by every means to sabotage or interfere with the Portuguese and get them ejected from the country. They warned the Zamorin against any treaties with the newcomers and slandered them, while key ministers of the raja were bribed. A merchant who had converted to Islam personally informed Gama aboard his flagship of the plot. Portuguese envoys to the Zamorin were subjected to constant delays but allowed to open a warehouse and trade in the city. The agent sent ashore by Gama to acquire spices were only supplied poor-quality products but he pretended not to notice and always paid great sums for the merchandise. The chief-minister of Zamorin having been bribed, he suggested that the Portuguese were spies and should therefore all be captured and executed.\n.]]\nGama eventually managed to speak personally to the Zamorin and deliver a letter from King Manuel, though he was later detained for a few days and kept under watch by his chief of the royal guard. The Zamorin ordered the execution of the Portuguese along with the confiscation of their goods but then changed his mind and allowed Gama to depart with an apology.\nDespite numerous shortcomings, the expedition of Vasco da Gama was a resounding success. He was afforded a hero's welcome upon his return and the achievement was celebrated across Portugal with public thanksgivings, feasts and entertainments. Among other things, he delivered to King Manuel a letter from the Zamorin which read:\nCasus Belli\nKing Manuel decided to follow up with a new and larger expedition and the following year Pedro Álvares Cabral was entrusted by King Manuel with a powerful fleet of 13 ships to overawe the Muslims who were sure to put up opposition, and rich gifts to impress the Zamorin. It was manned by 1200 carefully selected men, including some of the boldest and most famous navigators of the generation, such as Bartolomeu Dias and Nicolau Coelho. Cabral was presented with a royal banner blessed by the Bishop of Viseu and he departed on 9 March 1500. His instructions were filled with commercial information, and little to the effect of hostility towards the Zamorin, who was believed to be a Christian and therefore one whom an alliance ought to be forged with.\nCabral made a landfall in South America en route to India. The fleet arrived at Calicut with only six ships, four having been lost rounding the Cape of Good Hope, while two returned to Portugal and one strayed to the Red Sea due to the ineptitude of the pilot. Cabral reached Calicut on 30 August. The Zamorin that had welcomed Gama had died, and his nephew had since succeeded him. Cabral landed with thirty men to meet the Zamorin on the beach and costly presents were gifted to the raja. After two and a half months of negotiations, a treaty was signed, the terms engraved on metal plates and a trading post opened in the city, placed under the direction of the experienced agent Aires Correia with 70 Europeans.\nCalicut Massacre\nOn the request of the Zamorin, Cabral had a passing merchant ship from the neighbouring Kingdom of Cochin carrying a valuable cargo of elephants seized. While the Zamorin was willing to have the Portuguese as customers, the more numerous Arab community of merchants sought to thwart their supply of pepper and spices. They sabotaged and interfered with the supply and after three months the Portuguese could load no more than two carracks, while Muslim vessels were secretly departing with full cargoes. Cabral was informed of this by Coje Bequi, who championed one of the rival factions of merchants at Calicut and had befriended Aires Correia. After Cabral complained to the Zamorin, the raja allowed him to arrest any ship trying to evade customs and confiscate their cargo, however when Cabral had a ship arrested a riot sparked in the city. The feitoria in the city was attacked by an armed mob and about 50 Portuguese were killed, among them the agent Aires Correia, a number of Franciscan friars and Pero Vaz de Caminha, while the rest managed to escape to the fleet, most of them wounded. Some were sheltered at the home of Coje Bequi.\nCourse of hostilities\nAfter the massacre at the feitoria, Cabral demanded to hear from the Zamorin, but no answer was ever provided by the ruler. After a day his silence was interpreted as hostile.\nBombardment of Calicut\nTen merchant ships in the harbour were seized and their crews were killed. The following morning Calicut was subjected to a fierce bombardment that continued for two days. A few small cannon onshore replied, but Portuguese firepower was overwhelming. Shots tore into the city and demolished several buildings, including some of the Zamorin, who left Calicut. The death toll was estimated at over 500 or 600 persons, including one of the Zamorin's close notables and the bombardment was only ceased due to the damage that the recoil from the cannon was causing to the ships.\nThe position of the Portuguese was now serious, as the season to sail had nearly passed, Cabral had acquired almost no pepper at all, and they were at war with Calicut and without a friendly port in the region.\nAlliances with Cochin and Cannanore\nThe Portuguese were informed by Gaspar da Gama that the Raja of Cochin was an unwilling vassal of Calicut seeking independence and would probably welcome an alliance. After the bombardment of Calicut therefore, Cabral directed his fleet to Cochin further south, and on the way there he had Pandarane attacked and two more trade ships captured.\nHe arrived at Cochin on 24 December and a treaty of commerce and alliance was signed with its raja, Unni Goda Varma. A trading post was opened on the city and Gonçalo Gil Barbosa left ashore as its director with six men. While at Cochin, Cabral was sought by deputations from the rulers of Cannanore and Kollam, who also wished to sign alliances with Portugal against the Zamorin. A number of Saint Thomas Christians from Cranganore also contacted Cabral and requested passage to Europe.\nOn 10 January, a large fleet from Calicut carrying 1500 men appeared off Cochin, however it hesitated in attacking the Portuguese ships. A storm overcame the ships as Cabral directed his vessels to attack, and they were driven out to sea. Five days later, the Portuguese called at Cannanore, signed a treaty with its raja and took in an ambassador before leaving for Portugal.\nFirst Battle of Cannanore\nEvery outgoing fleet had to leave Lisbon before the arrival of vessels from India if they were to reach the subcontinent before the Monsoon set in. As such, King Manuel dispatched four ships under the command of the Galician noble João da Nova to trade in India, before Cabral had returned, based on the assumption that trade had been successfully been opened with Calicut.\nNova set sail from Belém on 10 April 1501, and on 7 July anchored his ships at Mossel Bay near the Cape of Good Hope. A message was found in a shoe hanging from a tree, left there a month prior by one of Cabral's captains, Pero de Ataíde. Among other things, Ataíde informed any commanders bound to India of the situation at Calicut and that safe-havens could be found at Cochin and Cannanore.\nNova arrived at Cannanore in November and was well received by the local raja. A number of agents were left ashore to purchase spices to be loaded on the way back to Portugal, while Nova departed for Cochin to collect those already acquired by the agents there left by Cabral the year before.\nWhile on his way to Cochin, Nova engaged some vessels of Calicut, in sight of the city. At Cochin he found that the trading agents had been lodged by the Trimumpara in his own palace for security reasons and also been unable to sell their wares due to a boycott and therefore been unable to secure the necessary money to buy spices. Lacking the funds to do so himself, the captain-major negotiated with the Trimumpara to serve as his security for 1000 hundredweight of pepper, 450 of cinnamon, 50 of ginger and some bales of cloth.\nBefore returning to Portugal, Nova still called at Cannanore first, but while in the harbour, he captured a wealthy trade ship from Calicut and was later attacked by a large fleet of the Zamorin, numbering about 180 vessels or more. The first Battle of Cannanore was noteworthy as the first time a line of battle was employed, and despite the numerical disparity, Nova was able to breach through the Zamorins fleet out to high seas, and before long the Hindu fleet was discouraged from seeking further combat due to the damage sustained by Portuguese artillery.\nSecond bombardment of Calicut\nWith the return of Cabral to Portugal, King Manuel was informed that opposition to the Portuguese was mounting, hence after the small fleet of Nova, King Manuel decided to dispatch an even larger armada of 20 well-armed ships. Cabral however was sidelined for failing to secure trade diplomatically and command fell on Gama.\nEn route to Cannanore, the Portuguese intercepted a large trade ship coming from the Red Sea, and on board the Portuguese found 10 or 12 of the wealthiest merchants of Calicut, headed by Ioar Afanquy, chief agent of the Sultan of Cairo in Calicut. After the ship was plundered therefore, Gama decided to make an example of the merchants for their part in instigating the riot at Calicut and the Zamorin against the Portuguese, hence the vessel was bombarded and sunk with all on board as retribution.\nAt Cannanore, Gama received messages from the Zamorin requesting talks. He sailed to Calicut and demanded that the Muslims be expelled as a condition for peace. The Zamorin refused but proposed that bilateral relations be re-established and remade anew instead. At this juncture however, Gama was forwarded a number of letters which the Zamorin had written to the King of Cochin urging obedience and co-operation against the Portuguese.\nTalks continued after this act of duplicity was uncovered but they quickly broke down, Gama had a number of Muslim merchants implicated in the massacre of the feitoria along with some fishermen hanged from the yard-arms, and Calicut was subjected to a new bombardment for two days. After over 400 heavy shots were fired Gama proceeded to Cochin but left Vicente Sodré behind with six carracks and a caravel to blockade Calicut.\nAmbush in the harbour of Calicut\nThe blockade of Sodré caused hardship at Calicut and the Zamorin dispatched a Brahmin to Cochin inviting Gama to continue talks. Gama was impressed by the high status of the envoy, and as he expected to find the squadron of Sodré at Calicut he sailed there with just his flagship accompanied by a caravel. Upon arriving, however, Gama found Sodré to be missing, because he had left to resupply at Cannanore, and the caravel was sent to seek him.\nNow that Gama was isolated, however, in the early hours of the following morning before daybreak his flagship was unexpectedly surrounded and fired upon by 70 to 80 armed oarships that the Portuguese watches had mistaken for fishing vessels. Their proximity prevented the Portuguese from firing their artillery, while a complete lack of wind prevented flight. Only the chance arrival of Sodré with his vessels brought in tow by oarships forced the withdrawal of the Zamorins fleet. Furious at this second act of duplicity under the guise of peace talks, Gama had a number of envoys from the Zamorin still in his flagship hanged and their bodies floated ashore in a canoe before returning to Cochin.\nNaval battle of Calicut, 1503\nAfter the second bombardment of Calicut, the Zamorin sought to gather a powerful fleet aimed at expelling the Portuguese from India. After arriving at Cochin, Gama gave the Trimumpara rich gifts and letters sent by King Manuel, and was informed by him that the Zamorin was preparing a large naval force under the command of Khawaja Kassein (Coja Cassem in Portuguese) and Khawaja Ambar (Cojambar in Portuguese) who was a famous privateer from Arabia and had come to Malabar to offer the Zamorin his services against the Portuguese.\nof Vasco da Gama.]]\nThe Trimumpara dispatched some boats to scout the waters around Calicut while Gama sent for Sodré. The Zamorin sent a Brahmin to Cochin to spy, however, he was denounced by Coje Bequi and the Brahmin was tortured before being sent back.\nOnce Gama had completed the loading of his carracks, he set sail to Cannanore accompanied by the squadron of Sodré. Upon passing in front of Calicut one morning the armada of the Zamorin was sighted, consisting of one squadron with 20 large ships and 70 light oarships under Cojambar and another under Coja Cassem following, consisting of about 100 sails, mostly sambuks. Sodré sailed closer to shore and had his ships form a line before closing in. The Portuguese unleashed successive broadsides on the armada and the main mast of Cojambars flagship was torn down. The flagship of Coja Cassein was then boarded and captured. Heavily damaged, the armada of Calicut began to scatter, with many of its crewmen jumping overboard. One ship belonging to Cojambar was boarded by the Portuguese and captured with a rich cargo.\nInvasion of Cochin, 1503\nIn addition to blockading Calicut, Sodré was commissioned by Gama to stay behind in India and protect Cochin but also to engage in commerce raiding against hostile Muslim shipping sailing to the Red Sea, and he therefore departed to Arabia, though two of his captains refused to abandon Cochin and relinquished their commands. On his way to the Red Sea Sodré captured five merchant ships laden with valuable cargo along the coast of Gujarat, but he was later lost in a wreck by the Khuriya Muriya Islands. His four remaining captains turned back with their ships.\nAfter Gama and Sodré had left, the Zamorin advanced with a large army towards Cochin and issued its ruler an ultimatum. Several members of the Court of Cochin recommended that the Portuguese be handed over so as to avoid war, but the raja refused. Many vassals of Cochin defected, and at Edappally the Zamorin gathered  50,000 men.\nCochin was subsequently overrun, the heir Narayan was killed in combat with the few troops that had been possible to muster, and the Trimumpara withdrew to the island of Vypin with his last remaining forces, including the Portuguese under his protection. Cochin was burned but Vypin proved easily defensible and inaccessible to the Zamorin, who tried to assault it several times but failed. With the monsoon season approaching, he withdrew to Calicut in August, leaving behind a garrison. Two Italian engineers who had travelled to Cochin in the fleet of Vasco da Gama but were secretly in the pay of the Republic of Venice also defected to Calicut, to help the Zamorin fight the Portuguese.\nPrecariously cornered in Vypin, the Trimumpara and the Portuguese were relieved by the arrival of substantial reinforcements from Europe: 10 ships, of which 2 were under the command of António de Saldanha and 3 under Francisco de Albuquerque, plus 4 from the squadron of Sodré returning from Arabia and 1 straggled ship from the fleet of Gama. Struck with terror at the arrival of such reinforcements, the garrison of the Zamorin left behind at Cochin promptly fled to Calicut.\nConstruction of Fort Manuel\nThe Trimumpara was thanked by Francisco de Albuquerque for his unwavering loyalty, re-established on his capital and awarded a sum equivalent to 10,000 ducats on behalf of King Manuel of Portugal. A number of neighbouring vassals around the Vembanad Lagoon who had defected to the side of the Zamorin were attacked by the forces of Francisco de Albuquerque and the Trimumpara restored to his authority in the region.\nKing Manuel had realized that as long as the hostile Zamorin remained heavily involved with the powerful Muslim merchant community at Calicut, a fortress with a garrison was needed to secure the trade in India and his ally the king of Cochin. The Trimumpara agreed to the construction of fort on his territory and even offered to pay for it. He supplied the manpower for the construction, in which the Portuguese soldiers also participated without distinction for birth or rank. Four days later 3 more ships arrived from Europe with more men under the command of Afonso de Albuquerque, who had been separated from Francisco and Saldanha en route to India and a simple fort was soon complete. Because of the lack of stone, the walls were made of double rows of coconut tree stem stockades, securely fastened together with earth firmly rammed in between and further protected by a moat. It was the first Portuguese fortress in India and christened Manuel after the reigning monarch of Portugal.\nIncident at Kollam\nAlbuquerque sailed to Kollam further south with three ships to take in cargo before returning to Portugal. The king of Kollam was away and the Zamorin attempted to incite him and deputy officials against the Portuguese, backed by gifts or bribes to key figures but to no avail. While the loading was in progress, a fleet of 30 to 90 ships from Calicut arrived on route to Coromandel and anchored in the harbour under the cover of the night. Their crews claimed the protection of the king of Kollam and not wishing to hostilize the ruler of Kollam by fighting in his harbour Albuquerque departed shortly afterwards.\nAttempted peace\nThe war had greatly disrupted the supply of pepper in the region and the Zamorin and the Muslims of Calicut used their influence in the trade networks of the Malabar Coast to cut or sabotage the supply of pepper to Cochin, which was greatly reduced.\nWith the Zamorin alarmed by both by the construction of Fort Manuel as well as his inability to subdue Cochin and the Portuguese by their difficulty in acquiring enough spices, Francisco de Albuquerque entered talks with the Zamorin, though it's unclear which party had the initiative to propose them. By mid-December the Zamorin had agreed to supply the Portuguese 900 caddies of pepper as compensation, shut down Muslim trade between Calicut and the Middle East, sign a peace with Cochin and return the two Italian deserters. The treaty caused outrage among the Muslim merchants of Calicut, and many quit the city.\nAfter the first shipment of pepper was supplied however, a fracas took place between the Portuguese and the men of the Zamorin at Cranganore and the peace was broken, though it's not certain on which side lay the fault.\nSiege of Cochin, 1504\nWhen Afonso and Francisco de Albuquerque departed on 27 February and 6 February respectively they left behind Duarte Pacheco Pereira at the command of Fort Manuel with one carrack, 2 caravels, 2 longboats and 90 to 150 men, all of whom had volunteered. Ships would not arrive from Europe for eight months and many believed the garrison would not survive the ordeal.\nIn March the Zamorin approached Cochin with 50,000 men among Nairs and Muslim warriors, 300 war elephants and 200 vessels. The Trimumpara urged the Portuguese to seek refuge in Arabia so he could submit to the Zamorin but Pereira refused and told the raja that they would die defending him if necessary.\nUntil the arrival of reinforcements, Pereira managed \"a brilliant strategic victory\". Cochin was located at the tip of a peninsula surrounded by salt-water creeks and channels, crossable only in a few narrow fording points, which were blocked with stockades, lines of sharpened stakes and caltrops. Pereira was one of, if not the first to observe the close relationship between the lunar phases and tides and thus could predict when the fordings were open for crossing. The celebrated heroics of the minuscule Portuguese garrison commanded by Duarte Pacheco Pereira in the defense of Cochin throughout 4 months in the marshy landscape around the Vembanad lagoon constitute one of the most spectacular exploits in Portuguese history. Kept up to date by reliable intelligence, Pereira was able to anticipate, ambush, bottle-neck and inflict severe defeats upon the numerous but under-equipped and inflexible army of the Zamorin, whose nairs came under heavy fire at every attack. Cholera broke out in the camp of his large army and after seven failed assaults the Zamorin withdrew in July 1504.\nThird bombardment of Calicut\nLopo Soares de Albergaria was the commander-in-chief of the fleet of 1504, and after reaching Cannanore he sailed to Calicut on the request of the Zamorin to discuss terms. Albergaria demanded the return of the Italian gunsmiths but the Zamorin refused, and as a result, the city was once more subjected to a two-day bombardment. Afterwards he proceeded to Cochin, where he took part in the final phases of the siege.\nAfter the third bombardment of Calicut, two Saint Thomas bishops wrote a letter to the Catholicos Mar Elias in the Middle East describing the arrival of the Portuguese and the situation in the Malabar Coast, which read:\nBattle of Cranganore and defection of Tanur\n.]]\nWhile at Cochin, Albergaria gave a large gift in cash to Unni Goda Varma on behalf of King Manuel and was informed by the raja that the Zamorin was fortifying Cranganore 15 miles north and had assembled a force there commanded by his nephew and heir Naubeadarim, in preparation to attack Cochin as soon as he left for Portugal. Cranganore was a strategic place as it commanded several ramifications of the Kerala backwaters. 1 caravel, 15 armed longboats and 25 natives prahus with 1000 Portuguese soldiers were therefore dispatched to that city by the sea while 1000 Nair auxiliaries marched overland.\nUpon arriving at the mouth of the Cranganore river, the Portuguese found that the water was not deep enough for the Portuguese vessels to enter fully loaded, hence the infantry was forced to land and march to the city, causing the element of surprise to be lost. Nevertheless, upon arriving at Cranganore, the five transports and 80 prahus of the Zamorin either anchored in the harbour close to shore or breached were boarded and burnt after a brief fight. The warriors of Calicut ashore were then routed by Lopo Soares and Cranganore also sacked and burnt, though the homes of the Saint Thomas Christians were spared. A number of soldiers were knighted in the Saint Thomas churches at Cranganore.\nAfter the raid on Cranganore, the King of Tanur switched sides. He informed Albergaria through an ambassador that he had inflicted a defeat on the forces of the Zamorin and now requested military support to expel them from his territory. Albergaria dispatched a detachment of soldiers on a caravel and with the support of the king of Tanur the forces of Calicut were forced to withdraw.\nBattle of Pandarane, 31 December 1504\n.]]\nOn 26 December 1505, Albergaria set sail back to Portugal with his fleet but after departing from Cochin he still called at Cannanore. While at this port he gathered that there was a convoy of 17 large Muslim merchant ships from Calicut anchored at Pandarane with an estimated 4000 men and Albergaria decided to attack it before leaving for Portugal. This fleet had gathered there in preparation to evacuate back to Arabia and Egypt a large number of Muslim merchants with their families and belongings disheartened by the losses incurred because of the Portuguese.\nThe merchant ships were found linked together in four groups anchored very close to shore, with the bows turned to sea and defended by Mamluk or mercenary Turkic archers while a battery of cannon on a cape overlooked the Pandarane bay. Because the carracks were too heavily loaded to take part in the shallow waters so close to shore, Albergaria decided to attack with a detachment of 360 soldiers on two war-caravels and 25 longboats, which was risky though Portuguese morale was high. In spite of heavy resistance, the Portuguese soldiers managed to grapple, board and burn all 17 of the much taller Muslim vessels, at the cost of 25 dead and 168 wounded.\nAfter the battle of Pandarane, despondency overcame the Zamorin as a growing number of merchants quit Calicut, and as a result, hunger struck the city. The repercussions of the rupture caused by the Portuguese in the traditional trading system \"were being felt in ever-widening circles\". The Venetians had hoped that the Cape Route would prove to be too long or hazardous to be viable, but the Portuguese armadas sailed on every year though 1800 or thirty-five percent out of the 5500 men who departed for India between 1497 and 1504 never returned, most being lost to shipwrecks.\nDom Francisco de Almeida appointed viceroy, 1505\nRealizing that the affairs in India were difficult to manage from Portugal, King Manuel decided to nominate Dom Francisco de Almeida as Viceroy of India for a period of three years. Almeida was the first member of the Portuguese high nobility to participate in the India venture, he was then 55 years old, experienced in military, diplomatic and nautical matters, lacked home ties, was mature in his judgements and unmaterialistic. He was attributed a set of instructions 101 pages long, the detail and accuracy of which reveal the level of Portuguese understandment of the Indian Ocean, gained in seven years. They embody a sophisticated grasp on concepts modern authors have identified as \"geopolitics\" and believed were not understood before the 19th century. Almeida was instructed to only sign peace if the Zamorin agreed to expel the Muslim community from Calicut. He departed on 25 March with 21 ships and 1500 men, including his son Dom Lourenço de Almeida, considered \"physically stronger than anyone else, expert in the use of all weapons.\"\nAfter calling at Angediva Island to build Fort São Miguel, Dom Francisco proceeded to Honavar, which was sacked for harbouring a number of vessels hostile to the Portuguese, also burnt. On this occasion Almeida was offered the vassalage or an alliance to the King of Portugal by a local privateer, Timoja, who agreed not to attack Portuguese shipping. At Cannanore Dom Francisco began the construction of Fort Sant'Ângelo, which was garrisoned by 150 men.\nThe losses caused by the Portuguese caused an increasing number of Muslim merchants to quit the Malabar Coast and look for spices further east. The viceroy Dom Francisco de Almeida therefore dispatched his son Dom Lourenço de Almeida with a squadron of ships to the Maldives, with orders to explore the region and intercept any hostile merchantships sailing between Ceylon, Sumatra or Malacca and the Red Sea, as the archipelago was a known stopping point for water and supplies. As the Portuguese were unfamiliar with the archipelago however, they were driven to Ceylon by contrary winds. Dom Lourenço had his ships anchor at Colombo and signed a treaty with the King of Kotte Parakramabahu VIII, who agreed to supply the Portuguese with cinnamon in exchange for a military alliance.\nSecond battle of Cannanore, 1506\nDom Francisco de Almeida sought a defensive posture and limited the action of Portuguese fleets to convoy escort duty. In April 1506, the Zamorin outfitted a fleet of over 200 ships and thanks to the aid of the two Italian gunsmiths he now owned 400 or 500 assorted cannon, though he later had the two gunsmiths executed for trying to leave his service. The second battle of Cannanore nevertheless resulted in disaster for the fleet of the Zamorin, as its Hindu, Arab and Turkish mercenary crews were totally untrained and uncoordinated, hence many of the larger vessels were sunk and the crews either killed or drowned by three naus and a caravel commanded by Dom Lourenço de Almeida.\nWestern Indian coast campaign, 1507\nWhen news reached Dom Francisco that the Zamorin attempted to strike an alliance with the lord of Diu Malik Ayyaz (Melique Az in Portuguese), the viceroy once more dispatched Dom Lourenço at the head of a fleet, with orders to escort an allied convoy of trade ships to Chaul and engage in commerce-raiding when possible.\nAt Chaul, seven Muslim trade ships from Calicut were found in the harbour and were burnt. At Dabul a fleet from Calicut under the command of Kunjali Marakkar was spotted, but although Dom Lourenço wished to attack it at once, the Portuguese captains considered that it was too risky and overruled the commander in a war council, hence the Portuguese withdrew. Four leagues away a ship was chased up a river to a town, and the all the ships in the harbour were burnt, with the exception of two richly laden vessels from Hormuz, which were taken.\nSiege of Fort Sant'Ângelo, 1507\n.]]\nThe Kolathiri raja who had welcomed the Portuguese died in April 1507 and as his succession was contested, the Zamorin managed to place a preferred candidate who was less inclined to the Portuguese on the throne.\nThe captain of Fort Sant'Ângelo Lourenço de Brito was informed by the nephew of the ruler of Cannanore of an impending siege, and so he requested aid from the garrison at Cochin. 18,000 men converged on the city of Cannanore and the Zamorin supplied 21 cannon. A trench was dug across the peninsula where the fort stood in order to cut off the Portuguese but a first assault was repulsed. As the only freshwater source consisted of a well outside the walls and the Portuguese had to fight to get water, they dug a mine that led underneath it.\nThe besiegers erected barricades and ramparts with bales of cotton, which proved sufficient against small cannon and small arms fire, but a large cannon shot scattered them. The garrison was reduced to dire straits and eating cats, dogs, lizards or other animals until the sea unexpectedly cast shoals of crabs and prawns on the beach near the fort. One last assault of nairs was repulsed with difficulty and when almost all of the garrison was wounded they were relieved on 27 August by the timely arrival of 11 ships from Europe under the command of Tristão da Cunha. The king of Cannanore signed a peace treaty favourable to Portugal thereafter.\nThe battles of Chaul and Diu\nThe prominent merchant Mayimama Marakkar (Maimame in Portuguese) had been dispatched by the Zamorin to Egypt as an ambassador and he lobbied vocally in Cairo for military aid and a united front against the Portuguese. In November 1505 the Sultan of Egypt Qansuh al-Ghuri dispatched a squadron of four carracks, a galleon and 1100 men under the command of Amir Husain Al-Kurdi (Mirocem in Portuguese), tasked with contesting the Indian Ocean and expelling the Portuguese from India. The Mamluk fleet was however plagued by various deficiencies, including outdated intelligence, which indicated that the Portuguese had no more than one fort and four ships on the Indian Ocean. At Diu in Gujarat, Hussain was joined by Malik Ayyaz with 40 oarships and Kunjali Marakkar (Cunhale in Portuguese) with 70-150 war-boats of Calicut.\nUnaware of these developments, in January 1508 Dom Lourenço de Almeida once more set out from Cochin tasked with escorting a convoy of allied trade ships to Chaul, with three carracks, three caravels and two galleys. Along the way, the lord of Dabul was forced to pay a yearly tribute. While at Chaul, the Portuguese squadron was unexpectedly attacked at anchor by the joint Mamluk and Gujarati fleet, and Dom Lourenço perished when his flagship was sunk while commanding a withdrawal. The battle of Chaul proved a pyrrhic victory for the Muslims however, and both Amir Hussein and Malik Ayyaz returned to Diu to conduct repairs and wait for reinforcements.\nThe presence of the Mamluk fleet in India presented a serious threat to continued Portuguese presence and the viceroy Dom Francisco determined to destroy it and avenge his son. With the backing of prominent fidalgos and noblemen, he refused to allow his appointed successor Afonso de Albuquerque take office and departed to Diu, where he routed the joint Muslim armada. It was one of the most significant battles in history for it confirmed Portuguese (or European) dominion of Asian seas that would last until World War Two.\nAttack on Calicut, 4 January 1510\nAfonso de Albuquerque succeeded Dom Francisco as governor of India on 5 November 1509, after the Marshal of Portugal arrived from Portugal with a fleet of 14 ships, and Dom Francisco left for Lisbon, though he'd perish along the way.\nDom Fernando bore orders from King Manuel to destroy Calicut. In order to conceal the objective of the expedition, Albuquerque leaked the information that he was about to attack Goa and gathered intel from a local contact of the Portuguese, the Hindu privateer Timoja. On behalf of the Portuguese, the Trimumpara sent two Brahmins to spy on Calicut while letters were sent to inland lords, vassals and friends in the mountainous country urging them to attack the Zamorin; Albuquerque was also supplied with 20 prahus so he'd be able to land soldiers. The Brahmins reported that the Zamorin had left the city to fight inland, that there were few Nayars in the city and its defenses included some wooden barricades and pitfalls along the beach, plus six large cannon.\nThe Portuguese gathered 2000 men and 20 ships for the attack. The fleet left Cochin on the last day of December 1509 and anchored off Calicut on 3 January 1510. The beachfront barricades were quickly captured the following day.\nBy that point, the sun had already risen high and in spite of the heat, Dom Fernando insisted that they press inland into the city. Against the advice of Albuquerque, Dom Fernando proceeded into the city and reached the royal palace of the Zamorin with his troops, though by that point they were too fatigued to continue. The Portuguese met little resistance, though great numbers of nairs began gathering and threatening to cut off their path to the sea. The palace of the Zamorin was plundered and set alight, but as the Portuguese tried to reach their ships they were badly mauled, with Coutinho being killed along with several prominent officers and Albuquerque seriously wounded. Only the timely arrival of Dom António de Noronha and Rodrigo Rebelo with fresh reinforcements prevented a disastrous rout. The Portuguese suffered 300 dead and 400 wounded, while about a 1000 were estimated dead on the Zamorins side, plus the city was badly damaged and the vessels in the harbour burnt.\nBlockade of Calicut, 1510-1513\n.]]\nAfter the failed attack on Calicut, Afonso de Albuquerque disengaged from the war against the Zamorin even more than Dom Francisco in order to pursue more important objectives further afield and he reduced the activity against Calicut to a blockade. As governor of India he conquered Goa in 1510, Malacca in Malaysia in 1511, and in 1513 led a campaign to the Red Sea, though this required withdrawing the ships blockading Calicut.\nUpon returning from the Red Sea, Albuquerque sailed his ships to Chaul, the port city of the Ahmadnagar Sultanate. While there, he received information that the merchant fleet of Calicut had attempted to sail to Arabia after he left Goa but on account of a storm the convoy had been scattered and its merchant ships forced to seek shelter in harbours ranging from Gujarat to as far south as the prominent Mount Dely.\nA vessel at nearby Danda was seized and found to contain a rich cargo of 3000 quintals of pepper and ginger. Lopo Vaz de Sampaio was then detached with three ships to blockade the port of Dabul until its authorities surrendered two large trade ships found therein, a demand which was quickly met. António Raposo was dispatched with a galiot to blockade Bhatkal until another vessel there was surrendered, while Fernão Gomes de Lemos was sent  with similar orders on a fusta to Mangalore, where two more ships were at. Thus, Albuquerque captured the entire ocean-going fleet of Calicut that had set sail to the Red Sea that year, causing the Muslim merchants of Calicut to be ruined.\nAlbuquerque then sailed to Goa, where he was received triumphantly by the local inhabitants and garrison.\nThe assassination of the Zamorin\nPeace negotiations had been going on intermittently for the past three years ever since Albuquerque took office, but even when the Zamorin requested talks he proved indecisive and evasive, which left a poor impression on the governor.\nAfter Albuquerque returned to Goa, Francisco Nogueira reported that he had been unable to sign a peace with the Zamorin due to the influence of the Muslims. Albuquerque dispatched his nephew Dom Garcia de Noronha to convince the Zamorin, but Dom Garcia was likewise unable to obtain more than procrastinatory replies. Albuquerque corresponded with the heir of Calicut who was pro-Portuguese and persuaded him to have the ruling Zamorin poisoned.\nPeace\nAfter having had his brother poisoned and succeeding on the throne, the new Zamorin expelled any Muslims against the peace and so their opposition was broken. The kings of Cochin and Cannanore considered the peace with Calicut disadvantageous to them and sought to prevent its signing, but Albuquerque did not wish to protract the war and considered this an intrusion on internal Portuguese affairs. Dom Garcia concluded a peace at Calicut and Albuquerque sailed there to meet the Zamorin in an amicable encounter.\nAlbuquerque initiated the construction of a fort at Calicut, similar to that of Cochin, with a three-storey keep and four towers, two of which faced the sea along with the gate. Francisco Nogueira was appointed its first commander with a sufficient force and Albuquerque departed accompanied by two ambassadors from the Zamorin to King Manuel, with letters and gifts.\nThe treaty signed at Calicut in 1513 contains terms favourable to both sides and represents a triumph of Portuguese diplomacy. The most important clauses included the construction of a fort at Calicut, the payment of half the ports dues as tribute to pay for the upkeep of the garrison, the signing of a trade agreement and Portuguese military aid to the Zamorin. The treaty signed on 24 December 1513, listed 21 items in total:\n1) That the Portuguese would be able to sell merchandise in the feitoria of Calicut like they did in other kingdoms; 2) That the items would be coral, silkstuffs, vermillion, copper, lead, saffron, alum and any merchandise brought from Portugal; 3) that the Zamorin would see that the Portuguese were provided with all the necessary spices until their ships were loaded; 4) that the Portuguese would pay duty on the goods they purchased, and the buyers of Portuguese merchandise would pay the usual duties; 5) that Muslim ships that arrived in Calicut from Hormuz, Cambay, Malacca, Samatra, Pegu, Canacarim, Bengal, Coromandel, Ceylon, Jaffna, Caell and elsewhere, would pay their dues as usual, and if the Portuguese imported horses or elephants they would pay the usual dues; 6) that the Portuguese would provide cartazes to any sambuks who sought them in Calicut 7) that the 1000 bahars of pepper lost at Calicut in 1500 would be paid in three installments in three years; 8) that any local who quarrelled with the Portuguese would be taken to the Zamorin to be punished, and any Portuguese who quarreled with the locals would be brought to the captain of the fortress to be punished;  9) That the Portuguese would provide military aid in men and ships to the Zamorin against any hostile power that was not an ally of Portugal, and vice-versa; 10) that Portuguese ships would be provided with equipment and aforementioned merchandise if necessary; 11) that the income of the houses of the trading post would be divided between the Zamorin and the King of Portugal; 12) That the governor of India allowed the Zamorin to send two tradeships to Hormuz in 1513 exceptionally; 13) that the Portuguese would buy all the pepper according to the prices and weights of Cannanore, paid in merchandise, and dues would be paid in money; 14) that the Portuguese would buy all the ginger they wished to producers and merchants at accorded prices; 15) That the dues owed over pepper and ginger and any other merchandise the Portuguese purchased would be paid as per usual; 16) that all merchandise bought from the Portuguese would be paid in accordance to the prices of pepper and any other merchandise; 17) that if the Zamorin stands in as guarantor until Portuguese had paid for their merchandise, the Portuguese trade agent would lend the sum in the feitoria to the people the Zamorin orders to; 18) That the trade agent would not sell nor buy any merchandise that was not duly registered by the clerks so the dues may be paid; 19) That the captain and royal trade agent may allow the local tradeships to take spices only to non-prohibited places, as much as 10 bahars of ginger and 5 of pepper; 20) That Portuguese cruzados would be exchanged at a rate of 19 fanams each; 21) That the royal trade agent would not lend merchandise with the Zamorin as guarantor without the knowledge of the Zamorin.\nAftermath\nAt the end of the war, Albuquerque considered Calicut to still be the most important city on the Malabar Coast. Its preeminent position would however steadily decline along the course of the 16th century.\nThe new Zamorin appears to have been among the first Asian rulers who sought to emulate Portuguese or European norms, as he had only a single wife and also dispatched a young relation with his ambassador to King Manuel to be educated in Portugal. He spent five years in Portugal, learnt to read and write Portuguese and converted to Christianity, adopting the name Dom João da Cruz.\nThe king of Cochin was Portugal's first ally in Asia and as a reward for his loyalty, he was gifted a golden crown, paid 6000 cruzados annually, and given the right to mint coin, which he had been denied as a vassal of the Zamorin. The Portuguese resided safely at Cochin, where they had their own settlement, fortress, hospital, feitoria and church. Coje Bequi was appointed as magistrate at Goa by Afonso de Albuquerque as a reward for his aid and loyalty.\nThe historian Bailey Diffie commented that \"it has usually escaped notice outside Portugal that the fifteen-year burst of national activity that followed the return of Vasco da Gama was one of the most purposeful and decisive in the history of the Western world. No one, except the Portuguese, ever dreamed that less than a generation after da Gama's weather-beaten ships turned up on the roads of Calicut, his small but determined nation on the western rim of Europe could establish itself firmly as master of the Indian Ocean, twelve thousand sea miles from home... Probably no nation so tiny has ever established its influence more widely or against greater odds - nor done so more deliberately.\"\nSee also\n*Military history of Portugal\n*Portuguese India\n*Portuguese India Armadas\n**2nd Portuguese India Armada (Cabral, 1500)\n**3rd Portuguese India Armada (Nova, 1501)\n**4th Portuguese India Armada (Gama, 1502)\n**5th Portuguese India Armada (Albuquerque, 1503)\n**6th Portuguese India Armada (Albergaria, 1504)\n**7th Portuguese India Armada (Almeida, 1505)\nReferences"
    }
  ]
}