{
  "content": [
    {
      "type": "text",
      "text": "# First Battle of Morlancourt\n\n| map_type          = France\n| map_relief        = 200\n| map_caption       =\n| map_label         = Morlancourt\n| result            = Allied victory\n| combatant1        =\n| combatant2        =\n| commander1        =  John Monash\n| commander2        =  Unknown\n| units1            =  3rd Division\n| units2            =  1st Division 18th Division\n| strength1         = Unknown\n| strength2         = Unknown\n| casualties1       = 450+ killed or wounded\n| casualties2       = 500+ killed or wounded320 captured\n| campaignbox       =\n}}\nThe First Battle of Morlancourt was fought over the period 28&ndash;30 March 1918, on the Western Front during World War I. The battle saw troops from the Australian 3rd Division advance to fill a gap in the Allied line that had formed north of the River Somme during the German spring offensive. This advance towards Morlancourt was checked by German troops short of the Australian's objective of the spur overlooking Morlancourt and the Australians were subsequently counter-attacked by elements of the German 18th Division. These attacks were repulsed with heavy casualties, as Allied forces blunted the German advance towards Amiens, which subsequently stabilised the Allied line north of the Somme. The fighting then largely moved south; however, in the months following, two further actions &ndash; albeit minor &ndash; were fought around Morlancourt as the Australians sought to consolidate their positions around the village prior to the start of the Allied Hundred Days Offensive.\nBackground\nSituated on the northern bank of the River Somme, Morlancourt is about  north-east of Amiens, in the Somme department of northern France. The battle took place amidst the backdrop of the German spring offensive, which saw the Germans launch a large-scale offensive on the Western Front that had rapidly gained ground through the Somme after it had commenced on 21 March. It was fought in conjunction with the First Battle of Dernancourt, about  to the north. With the vital railhead at Amiens under threat, on 25 March two divisions of the Australian Corps, the 3rd and 4th, were moved south from Belgium and rushed into the front line on the Somme. Major General John Monash's 3rd Division was to take up position to the right of the British 35th Division and to the left of the 1st Cavalry Division, where it was deployed to fill a gap between the British Third and Fifth Armies in an area between the River Ancre and the River Somme. In the meantime, a small British cavalry screen was maintained in the gap, along with a composite brigade of British, Canadian and US frontline and support troops under Brigadier General (later Major General) George Carey, which had been attempting to maintain contact between the two armies since 26 March.\nArriving on 27 March, Monash's troops initially occupied a position between Mericourt and Sailley-le-Sec; however, this disposition was found to be dislocated from those of the flanking Allied units, which were about  further forward. In order to tie-in with the British Fifth Army located to the south of the Australians, the following day Monash ordered an advance of  towards the cross spur overlooking Morlancourt, in two  bounds, with the objective being to straighten the front. Two brigades &ndash; the 10th (Brigadier General Walter McNicoll) and 11th Brigade (Brigadier General James Cannan) &ndash; were assigned, while the division's third brigade, the 9th (Brigadier General Charles Rosenthal), which had been held back in reserve around Corbie where it held the junction of the Somme and Ancre Rivers, was sent south to Villers-Bretonneux to shore up the flank between the British Fifth Army and the French First Army.\nBattle\nMonash ordered a general advance, for which the 10th Brigade was assigned to the north of the Bray–Corbie Road with its left flank anchored by the River Ancre, while the 11th Brigade would attack to the south of the road, with its right flank bounded by the River Somme. From the beginning, the attack went awry for the Australians. Inexperience in planning quickly in open warfare situations resulted in the two brigades largely planning in isolation, and this would prove costly. As the two brigades of field artillery &ndash; the British 189th and the Australian 7th &ndash; that were assigned to the 3rd Division were dislocated to the north of the Ancre, the assault would lack artillery support, with only limited, and largely long range, support being provided.\nCommencing around 3:40&nbsp;pm, the 40th Battalion, from the 10th Brigade, began to move out of its positions around Heilly station and moved towards the next crest. They were under orders to advance north of the Bray&ndash;Corbie Road in concert with the 11th Brigade's 41st Battalion, which would advance through the 43rd Battalion's position to the south of the road. Reaching their stepping off point, however, it became clear to the men of the 40th that the 41st Battalion had not been given the same timing. Nevertheless, the commanding officer of the 40th Battalion, Major Leslie Payne, was determined to carry out his orders and as a result, at around 5:00&nbsp;pm, the Tasmanians of the 40th Battalion began their advance towards positions held by elements of the German 1st Division, including the 1st Grenadier Regiment and the 13th Infantry Regiment. Moving through the centre of the Australian position they advanced into open ground with no flank protection, while what little artillery support they had had largely fell short. Coming up against heavy German machine gun and artillery fire, the 40th Battalion suffered heavy casualties &ndash; about 150 killed or wounded &ndash; and the advance came to a halt after only , essentially halfway through the first planned bound. Presently, it began to rain.\nThe 11th Brigade's advanced elements subsequently stepped off around 5:45&nbsp;pm, with several patrols of South Australians from the 43rd Battalion being pushed forward with a view to taking Sailly-Laurette. Coming under intense fire, this patrol was able to slowly work its way forward over the course of just over an hour, and began establishing a line of outposts, but these were well short of the objective. The 42nd Battalion, a Queensland-recruited unit, also established several posts opposite the village. As dusk fell, the 39th Battalion moved north around the 40th and pushed the line forward on the Australian left, to conform with the 40th, and began to dig-in. Shortly afterwards, the 41st belatedly moved up on the 40th Battalion's right to join the line between the 40th Battalion and the outposts established by the 42nd and 43rd Battalions, thus establishing a contiguous line between the Ancre and the Somme.\nA renewed effort was ordered by Monash and after dark, the Australians made another attack. In the centre, they were held up by a German defensive position in a copse, while the flanking force from the 44th Battalion that had been dispatched to capture Sailly-Laurette was ambushed by several machine gun posts from the 3rd Grenadier Regiment and suffered heavy losses. The Western Australians from the 44th Battalion subsequently withdrew from the village, taking as many wounded with them as possible, as Lewis gunners laid down covering fire. Despite continuing German machine gun fire, small parties were sent out throughout the night to bring wounded soldiers back to the Australian lines. Meanwhile, the Australians brought up artillery and as the rain fell on 29 March the guns began to attrite the German defences that had held up the infantry. Meanwhile, the infantrymen began digging-in along the new line that the occupied, while on the left of the 3rd Division's position, the Australians exploited a brief lull in the battle to carry out a reconnaissance of the spur that extended between the 35th Division's positions around Treux and Morlancourt. A small skirmish was fought by a patrol of Victorians from the 38th Battalion &ndash; who, along with the 37th had assisted the 35th Division the day before around Treux and Marrett Wood during the First Battle of Dernancourt &ndash; around the northern end of the spur, which resulted in up to 30 Germans being killed and five members of the 13th Infantry Regiment (13th Division) being captured.\nFollowing this, the Germans rotated their forces and on 30 March, troops from three German infantry regiments &ndash; the 31st, 85th and 86th &ndash; of the 18th Division launched a strong counter-attack, focused on the 11th Brigade's positions along the southern part of the Australian front. The 31st Infantry was assigned the role as the main assault unit, supported by two battalions from the 85th Infantry. The remaining battalion from the 85th Infantry concentrated against Sailly-le-Sec, with elements of the 86th, advancing across the Australians' front from Morlancourt, in support. The supporting artillery had only limited ammunition and its observation was obscured by sleet. In total, three attacks were made by the Germans throughout the day, but these were turned back by strong machine gun, rifle and artillery fire which inflicted heavy losses and repulsed the attackers before they could get within  of the Australian positions. Australian casualties over the course of the battle amounted to over 450 killed or wounded, while the Australians initially estimated German casualties at around 500, with subsequent assessments rising to between 3,000 and 4,000 although the latter figures are now considered to be too high.\nAftermath\nIn the aftermath, the 3rd Division's remaining artillery support arrived late on 30 March, and the British 35th Division was withdrawn. Temporarily, the Australians subsequently occupied the length of the line between the Somme and Albert, with the 13th Brigade, from the 4th Division, replacing the 35th Division along the Buire railway line, and the 3rd Division taking over the British positions at Treux. Both Australian divisions were at two-thirds strength, as they had each detached one brigade to support flanking units. Nevertheless, the British and Australian forces had managed to secure the front north of the Somme, and the focus subsequently moved further south, where heavy fighting took place around Villers-Bretonneux in early April.\nTwo further actions were fought around Morlancourt in the final stages of the Spring Offensive. A second battle was fought around Morlancourt over the period 4&ndash;9 May 1918. This battle saw the 9th Brigade launch a limited attack on the German frontline, which had been established there following the first battle. Using the peaceful penetration tactic, the initial Australian attack captured about . A total of 170 German soldiers were taken prisoner, while the Australians lost 264 killed or wounded. In response, the Germans launched a counter-attack against the Australian 5th Brigade on 14 May, which initially met with some success before being cut-off with another 48 soldiers being captured. Australian losses during the German counter-attack amounted to 60 men killed or wounded.\nA third action took place on 10 June 1918, during which the Australian 7th Brigade launched an attack against the spur overlooking the village of Sailly-Laurette, situated to the south of Morlancourt. The attack was successful for the Australians, completing the advance that had been halted in the First Battle of Morlancourt with 325 Germans being taken prisoner for the loss of 400 Australians killed or wounded. The German Spring Offensive finally came to an end in July after the Second Battle of Marne. Following this there was a brief lull before the Allies went on the offensive. During this lull, the Australians, along with several US companies, launched a successful attack around Hamel on 4 July. This was followed, in early August, with the Hundred Days Offensive which ultimately brought the war to an end.\nReferences\nCitations\nBibliography\n*\n*\n*\n*\n*\n*\n*\n*\nFurther reading\n*"
    }
  ]
}