{
  "content": [
    {
      "type": "text",
      "text": "# First Republic of Korea\n\n| era                    = Cold War\n| government_type        = Unitary presidential republic under an authoritarian dictatorship\n| year_start             = 1948\n| date_start             = 15 August\n| today                  =\n| event_start            = Proclamation of the Republic of Korea\n| event1                 = Korean War\n| date_event1            = 25 June 1950 &ndash; 27 July 1953\n| event2                 = April Revolution\n| date_event2            = 19 April 1960\n| event_end              = Disestablished\n| year_end               = 1960\n| date_end               = 15 June\n| p1                     = United States Army Military Government in Korea\n| flag_p1                = Flag of the United States (1912-1959).svg\n| s1                     = Second Republic of Korea\n| flag_s1                = Flag of South Korea (1949–1984).svg\n| image_flag             = Flag of South Korea (1949–1984).svg\n| image_flag2            =\n| flag_type              = Flag(1949–1960)\n| image_coat             = Coat of arms of South Korea (1948-1963).svg\n| symbol_type            = Emblem\n| other_symbol           =\n| other_symbol_type      =\n| image_map_caption      =\n| capital                = Seoul (1948&ndash;1950, 1952&ndash;1960)Busan (1950&ndash;1952)\n| national_anthem        = 애국가\"Aegukga\" (1948)\"Aegukga\" (1948&ndash;1960)\n| image_map              = File:Locator map of South Korea.svg\n| map_caption            =\n| image_map2             =\n| map_caption2           = First Republic of Korea in November 1950\n| common_languages       = Korean\n| title_leader           = President\n| leader1                = Syngman Rhee\n| year_leader2           = 1960\n| leader2                = Ho Chong (acting)\n| year_leader1           = 1948–1960\n| title_deputy           = Vice President\n| deputy1                = Yi Si-yeong\n| year_deputy1           = 1948–1951\n| deputy2                = Kim Seong-su\n| year_deputy2           = 1951–1952\n| deputy3                = Ham Tae-young\n| year_deputy3           = 1952–1956\n| deputy4                = Chang Myon\n| year_deputy4           = 1956–1960\n| title_representative   = Prime Minister\n| representative1        = Lee Beom-seok\n| year_representative1   = 1948–1950\n| representative2        = Shin Song-mo\n| year_representative2   = 1950 (acting)\n| representative3        = Chang Myon\n| year_representative3   = 1950–1952\n| representative4        = Yi Yun-yong\n| year_representative4   = 1952 (acting)\n| representative5        = Chang Taek-sang\n| year_representative5   = 1952\n| representative6        = Paik Too-chin\n| year_representative6   = 1952–1954\n| representative7        = Pyon Yong-tae\n| year_representative7   = 1954\n| legislature            = National Assembly\n| stat_year1             =\n| stat_area1             =\n| stat_pop1              =\n| currency               = Won (to 1953)Hwan (1953–62)\n| footnotes              = As Korean Republic\n| religion               = Christianity, Confucianism, Buddhism, Korean Shamanism, Cheondoism\n}}\nThe First Republic of Korea () was the government of South Korea from August 1948 to June 1960. The First Republic was founded on 15 August 1948, and it became the first independent republican government in Korea. Syngman Rhee was the first president of South Korea. The National Assembly was created following the May 1948 general election, and the National Assembly in Seoul promulgated South Korea's first constitution in July, establishing a presidential system of government.\nIn 1947, the United Nations proposed elections under its supervision to establish a unified Korean government. South Korea participated, leading to the formation of the Republic of Korea. The Soviet Civil Administration in northern Korea refused, and North Korea was established separately, which ultimately led to the division. Accordingly, on 12 December 1948, the United Nations recognized the Republic of Korea as the only lawful government in Korea by UN General Assembly Resolution 195. The first republic claimed sovereignty over all of Korea but only controlled Korea south of the 38th parallel until the end of the Korean War in 1953, when the border was modified. The first republic was characterized by Rhee's authoritarianism, limited economic development, strong anti-communism, and by the late 1950s growing political instability and public opposition to Rhee. The April Revolution in April 1960 led to Rhee's resignation and the transition to the second Republic of Korea.\nPolitics\nRhee was supported in the elections by the Korea Democratic Party, but didn't include any of its members in his cabinet. In retaliation, the members of the party formed a united opposition Democratic Nationalist Party, and began to advocate a cabinet system which would remove power from the president. This led to a regrouping of the Rhee faction into the Nationalist Party, which later became the Liberal Party, and remained Rhee's base throughout his administration. The country's second parliamentary elections were held on May 30, 1950, and gave the majority of seats to independents.\nThe South Korean government continued many of the practices of the U.S. military government. This included the brutal repression of leftist activity. The Rhee government continued the harsh military action against the Jeju uprising. It also crushed military uprisings in Suncheon and Yeosu, which were provoked by orders to sail to Jeju and participate in the crackdown.\nKorean War\nOn June 25, 1950, North Korean forces invaded South Korea, starting the Korean War. Led by the United States, a 16-member coalition undertook the first collective action under the umbrella of the U.N. Command (UNC). Oscillating battle lines inflicted a high number of civilian casualties and wrought immense destruction. With the entry of the People's Republic of China on behalf of North Korea in 1951, the fighting came to a stalemate close to the original line of demarcation.\nArmistice negotiations, initiated in July 1951, finally concluded on July 27, 1953 at Panmunjom, now in the Demilitarized Zone (DMZ). The resulting Armistice Agreement was signed by the North Korean army, Chinese People's Volunteers and the U.S.-led and South Korean-supported United Nations Command. A peace treaty has not been signed up to now. Following the armistice, the South Korean government returned to Seoul on the symbolic date of August 15, 1953.\nThis government oversaw several massacres, the most notable being the Bodo League massacre following the North Korean invasion in June 1950. The government executed 60,000 to 200,000 suspected communists.\nPostwar events\nAfter the armistice, South Korea experienced political turmoil under years of Syngman Rhee's presidency, which was ended by student revolt in 1960. Throughout his rule, Rhee sought to take additional steps to cement his control of the government. These began in 1952 (shortly after being elected to a second term), when the government was still based in Busan due to the ongoing war. In May of that year, Rhee pushed through constitutional amendments which made the presidency a directly elected position. In order to do this, he declared martial law and jailed the members of parliament whom he expected to vote against it. Rhee was subsequently elected by a wide margin. He regained control of parliament in the 1954 elections, and thereupon pushed through an amendment to exempt himself from the eight-year term limit.\nRhee's prospects for reelection during the presidential campaign of 1956 initially seemed dim. Public disillusionment regarding his attempt to seek a third term was growing, and the main opposition candidate Shin Ik-hee drew immense crowds during his campaign. Shin's sudden death while on the campaign trail, however, allowed Rhee to win the presidency with ease. The runner-up of that election, Cho Bong-am of the Progressive Party, was later charged with espionage and executed in 1959.\nThe events of 1960, known as the April Revolution, were touched off by the violent repression of a student demonstration in Masan on the day of the presidential election, March 15. Initially, these protests were quelled by local police, but they broke out again after the body of a student was found floating in the harbor. Subsequently, nonviolent protests spread to Seoul and throughout the country, and Rhee resigned on April 26.\nEducation\nThis period saw growth in education at all levels, even during the turmoil of the Korean War. The First Republic saw the full implementation of an educational system that had been sketched out by the Council for Korean Education under USAMGIK. This education was shaped by the ideal of Hongik Ingan, the person who is a benefit to all, and sought to prepare students for participation in a democratic society. Some contend that this democratic education contributed to the student protests which brought down the authoritarian Rhee government in 1960.\nThe first Education Law came into force on December 31, 1949. The most important aspect of this was the introduction of universal compulsory education at the primary level. This requirement led to widespread school construction; by the end of the First Republic, primary-school enrollment had topped 95%. In addition, the dual ladder system used by the Japanese occupation government was replaced by a single-ladder system, with 6 years of primary education, 3 of middle-school education, 3 of high-school education, and 4 of college education.\nThis period also saw the adoption of South Korea's first national curriculum.\nEconomy\nDuring 1945–1950, United States and South Korean authorities carried out a land reform that retained the institution of private property. They confiscated and redistributed all land held by the Japanese colonial government, Japanese companies, and individual Japanese colonists. The South Korean government carried out a reform whereby South Koreans with large landholdings were obliged to divest most of their land. A new class of independent, family proprietors was created.\nInternational relations\nbestowing a medal on U.S. Navy admiral Ralph A. Ofstie]]\nRhee sought to align his government strongly with the United States, and against both North Korea and Japan. The policy of the First Republic on North Korea, before and after the Korean War, was one of \"unification by force.\" Although some talks towards normalization of relations with Japan took place, they achieved little. Meanwhile, the government took in vast sums of American aid, in amounts sometimes near the total size of the national budget.\nOn January 18, 1952, Rhee declared South Korean sovereignty over the waters around the Korean Peninsula, in a concept similar to that of today's exclusive economic zones. The maritime demarcation thus drawn up, which Rhee called the \"Peace Line\", included Liancourt Rocks as South Korean territory.\nSee also\n*History of South Korea\n*History of Korea\nReferences\nCitations\nSources\n*\n*\n*\n*\n*"
    }
  ]
}