{
  "content": [
    {
      "type": "text",
      "text": "# First Free Settlers Monument\n\n| location = Sandgate Road, Nundah, City of Brisbane, Queensland, Australia\n| beginning_label = Design period\n| beginning_date = 1919–1930s (interwar period)\n| built = 1938\n| built_for =\n| demolished =\n| architect =\n| architecture =\n| owner =\n| designation1 = Queensland Heritage Register\n| designation1_offname = First Free Settlers Monument, First Free Settlers of Queensland Memorial Cairn\n| designation1_type = state heritage (built)\n| designation1_date = 26 June 1998\n| delisted1_date =\n| designation1_partof =\n| designation1_number = 601926\n| designation1_free1name = Significant period\n| designation1_free1value = 1930s (fabric)\n| designation1_free2name = Significant components\n| designation1_free2value = memorial – cairn, garden edging/balustrades/planter boxes, trees/plantings, plaque, drinking fountain, seating, flagpole/flagstaff\n| designation1_free3name = Builders\n| designation1_free3value =\n}}\nFirst Free Settlers Monument is a heritage-listed memorial at Sandgate Road, Nundah, City of Brisbane, Queensland, Australia. It was built in 1938. It is also known as First Free Settlers of Queensland Memorial Cairn. It was added to the Queensland Heritage Register on 26 June 1998.\nHistory\nThe First Free Settlers Monument at Nundah, a blunt tapered octagon of rusticated sandstone blocks, commemorates the centenary of the arrival of free settlers in the Moreton Bay district which was later to become a part of Queensland. It was unveiled on Easter Saturday 23 April 1938 as a part of Nundah's celebration of the centenary of Queensland's free settlement.\nThe original group of settlers were recruited for the colony by the Rev. John Dunmore Lang who had heard of the works of their leader, Pastor Johannes Evangelista Gossner during his journey to England to recruit free settlers. Lang had a vision for improving the calibre of Australia's settlers by encouraging people of good Protestant stock to emigrate. Gossner had established a community in Germany where he trained lay people for missionary work. These people eminently filled the requirements that Dunmore Lang had established for his free settlers and he encourage Gossner to prepare a group for travel to Moreton Bay.\nIn 1837, ten men volunteered to travel to Moreton Bay which was, at the time a convict settlement based at Brisbane. The men, inspired by Lang's descriptions, intended to establish a mission for the Aborigines living in the vicinity of the convict settlement. Several of the men brought their wives and families with them. Two clergymen joined the group to provide pastoral care and guidance to the mission. Each of the lay men had practical skills with trades such as shoemaking, farming, brickmaking, tailoring, blacksmithing and medicine which would assist in the establishment of the proposed missionary colony. Schneider, the medical student, died of typhus at the quarantine station in Sydney on his arrival in the new country. Four more men arrived in 1844 to further the work of the mission, however although accepted by the local Aborigines, the settlers were unsuccessful in their efforts to convert them to Christianity.\nThe original settlement of Zion was located on the rise behind Toombul Shopping Centre in the vicinity of the street now known as Walkers Way. It was watered by Kedron Brook, now contained within an artificial canal. The mission itself was unsuccessful in converting any of the local Aborigines, but when, in 1848, the Government surveyed the land into blocks, many of the original settlers and their families chose to remain and purchase the land for their own use. The area became known as German Station as a consequence of their presence and was later renamed Nundah, as the suburb is now known. Many of the first free settlers are buried in Nundah Cemetery established in the 1840s.\nThe monument was erected as a consequence of the suggestion of George Joy Walker, born 1852 who, as an infant in arms had travelled with his family to the settlement at Zion when his father was appointed as tutor to the families of the first settlers. Walker died in 1933 and never saw the monument, although he would have been aware of the activities of the First Free Settlers Committee which took up the challenge with which he had presented them.\nThe location of the monument was described as the intersection of new and old Sandgate Roads (old Sandgate Road passing through the Nundah shopping street and new Sandgate Road passing through the George Bridges Tunnel) and the original setting of the cairn is shown in early photographs as being a broad swathe of mown grass which has subsequently been formalised into the clearly defined space evident today. The monument was designed to \"rise from the turf without step or platform, symbolising the growth of European civilisation in Queensland out of the soil of Nundah.\" It was unveiled by His Excellency the Governor, Sir Leslie Orme Wilson, under the auspices of the First Free Settlers Committee. The unveiling ceremony was broadcast by radio station 4QG and a celebration ball was held in the evening.\nEach year, in October, a ceremony is held at the memorial to commemorate the arrival of the first free settlers. The ceremony is generally attended by representatives of both Queensland and local government, diplomats, as well as local residents and others who are descended from the first missionary settlers.\nDescription\nThe First Free Settlers Monument is located at the corner of Sandgate Road and Bage Street in Nundah. It stands within a small park dedicated to the first free settlement in Queensland.\nThe monument itself consists of a simple, blunt octagonal cairn which tapers towards the top and rises without step or platform from the surrounding grass. It is constructed from rusticated sandstone blocks and on four faces are fixed bronze plaques explaining the purpose of the dedication and the occasion which it celebrates. The southern plaque lists the names of the original male settlers, the eastern plaque indicates that the memorial was dedicated by the people of Queensland on the occasion of the centenary of free European settlement in Queensland. The northern plaque refers to the work of John Dunmore Lang and Goszner and the western refers to the past and present British rulers. The penultimate course of stonework has a sawn face which contains incised lettering, gilded, which reads \"Queensland's First Free Settlers\". The word \"free\" is placed above the plaque naming the settlers.\nThe park is well-maintained and stands surrounded by streets. Sandgate Road passes along the straight side of the park to the north-east, while Bage Street passes on the south-western side. The remaining side is flanked by a short divided road (unnamed) which provides access to Bage Street from Sandgate Road. The park is curved in form with a low, clipped plumbago hedge surrounding it. A low curved garden edge constructed from concrete embedded with a variety of small stones surrounds the hedge, of which that on the Bage Street side is more recently planted than that on the opposite side. Two poinciana trees flank the memorial and a bench is located under the south-eastern tree, which is a replacement of the originally planted tree. A cast iron drinking fountain is located in front of the bench. Entrance is gained through two breaks in the hedge which are placed on the central axis opposite the memorial. To the left of the entry on the curved side a low stone tablet was placed in 1988 marking the one hundred and fiftieth anniversary of free settlement which coincided with Australia's Bicentenary. The plaque re-confirms German-Australian friendship.\nThree flagpoles are placed at regular intervals along the northern side of the park and a timber sign of more recent origin is placed to the western side of the northern entrance to clearly identify the monument to the passing traffic on Sandgate Road.\nTablet 1: Pastor Eipper, Pastor W Schmidt, Lay Missionaries, L Doege, F T Franz, A T W Hartenstein, G Hauszmann, P Niquet, A Olbrecht, A Rode. G Wagner, J L Zillmann.\nTablet 2: These missionaries with their families, settled at Zion's Hill near this spot in the year 1838. This monument was erected by the People of Queensland, The Hon W Forgan-Smith LL.D. M.L.A Premier, Ald. The Hon. A J Jones, Lord Mayor, Brisbane.\nTablet 3: This settlement was inspired by John Dunmore Lang and Johannes Goszner.\nTablet 4: 1838 H.M. Queen Victoria, H.E. Sir George Gipps Governor of New South Wales. 1938 H.M. King George VI, H.E. Colonel the Right Honourable Sir Leslie Orme Wilson GCS GCMG GCIE, DSO LL.D Governor of Queensland.\nThe German-Australian Friendship Plaque was unveiled during the German Australian Pioneer Week on the 15 October 1988 by the Hon. W. A. (Bill) Gunn, Deputy Premier, Minister for Public Works, Main Roads and Expo and Police and Dr Karl-Heinz Berninger Consul-General for the Federal Republic of Germany in commemoration of 150 years first free settlement in Queensland by German Missionaries who settled in 1838 at Walkers Way, Nundah.\nHeritage listing\nFirst Free Settlers Monument was listed on the Queensland Heritage Register on 26 June 1998 having satisfied the following criteria.\n'''The place is important in demonstrating the evolution or pattern of Queensland's history.'''\nThe First Free Settlers Monument, Nundah, was erected in 1938 to commemorate the first free settlement within the area of Moreton Bay, later to become Queensland. The first settlers were German Protestant families who were recruited by the Rev. John Dunmore Lang. The monument is significant as it commemorates an important part of the evolution of Queensland's history, of which little physical evidence remains.\nThe place is important in demonstrating the principal characteristics of a particular class of cultural places.\nThe place demonstrates the principal characteristics of a memorial structure, by the use of materials and forms commonly associated with memorials and the formal layout of the surrounding park.\nThe place is important because of its aesthetic significance.\nIt is also of aesthetic significance due to its design qualities and landmark presence within the streetscape.\nThe place has a strong or special association with a particular community or cultural group for social, cultural or spiritual reasons.\nThe place has strong associations with the Nundah and German communities, and others who attend the annual ceremony to commemorate the arrival of the first group of free settlers who established a community based on religious faith and hard work.\n'''The place has a special association with the life or work of a particular person, group or organisation of importance in Queensland's history.'''\nThe place also has a special association with the life and work of John Dunmore Lang, as it commemorates the initiatives provided by him for the establishment in Australia of a community of people with strong religious beliefs and pioneer spirit.\nReferences\nAttribution\nFurther reading\n*  — full text available [http://handle.slv.vic.gov.au/10381/185263 online]\nExternal links"
    }
  ]
}