{
  "content": [
    {
      "type": "text",
      "text": "# First break picking__disambig_1\n\nIn seismology, first-break picking is the detecting or picking the onset arrivals of refracted signals from all the signals received by receiver arrays and produced by a particular source signal generation. It is also called first arrival picking or first break detection. First-break picking can be done automatically, manually or as a combination of both. With the development of computer science and the size of seismic surveys, automatic picking is often preferred.\nSignificance\nFirst-break picks associated with the refracted arrival times are used in an inversion scheme to study the near-surface low-velocity zone and subsequent determination of static corrections.\nStatic correction is a correction applied to geophysical data, especially seismic data, to compensate for the effect of near-surface irregularities, differences in the elevation of shots and geophones, or any application to correct the positions of source and receivers.\nHistory of First Break Picking\nGelchinsky and Shtivelman(1983) used correlation properties of signals and applied a statistical criterion for the estimation of first arrivals time.\nCoppens(1985) calculated the ratio of energy of seismogram of the two windows and used that to differentiate in signal and noise.\nMichael D. McCormark et al.(1993) introduced a backpropagation neural network (BNN) method. The Neural network which edits seismic data or pick first breaks was trained by users, who were just selecting and presenting to the network examples of trace edits or refraction picks. The network then changes internal weights iteratively until it can reproduce the examples accurately provided by the users.\nFabio Boschetti et al.(1996) introduce a fractal-based algorithm, which detects the presence of a signal by analyzing the variation in fractal dimension along the trace. This method works when signal-to-noise ratio is small, but it is considerably slow.\nA direct correlation method was introduced by Joseph et al.(1999) which was developed for use in highly time-resolved, low-noise signals acquired in the laboratory. In this method, the greatest value of Pearson's correlation coefficient between segments of observed waveforms near the pulse onset and at an appropriate reference serves as the time determination criterion.\nZuolin Chen, et al.(2005) introduced a multi-window algorithm to detect the first break. In this method, three moving windows were used and the averages of absolute amplitudes in each window need to be calculated, then ratios based on the averages of the windows provide standards to differentiate signals from unwanted noise.\nWong et al.(2009) introduced STA/LTA ratio method. This method is similar as Coppens' algorithm. The difference is to do the ratio of two averages of energy between a short-term window and a long-term window, which is denoted as STA/LTA (short-term average/long-term average), instead of calculating the ratio of energy of seismogram of the two windows in Coppens' algorithm.\nMethods of Automatic First Break Picking\nSTA/LTA ratio Method\nSource:\nThis method is similar as Coppens' (1985) algorithm. The difference is to do the ratio of two averages of energy between a short-term window and a long-term window, which is denoted as STA/LTA (short-term average/long-term average), instead of calculating the ratio of energy of seismogram of the two windows in Coppens' algorithm. The numerical derivative of the ratio can be defined as,\n: \\begin{align}\n& d_i=r_{i+1}-r_i , i=1,2,...(n-1)    \\\\\n\\end{align}\nwhere ri+1 is the STA/LTA ratio at time index i+1, and ri  is the STA/LTA ratio at time index i. For noise-free seismograms, the maximum value of the numerical derivative of the STA/LTA ratio is close to the time of the first arrival.\nWong et al. (2009) modified the algorithm of the energy ratio method, where they named the method as modified energy ratio. In this method, they define the energy ratio as,\n: \\begin{align}\n& er_i=\\sum_{j=i}^{i+ne}\nx^2_j/\\sum_{j=i-ne}^i\nx^2_j \\\\\n\\end{align}\nwhere xi is the times series representing a seismogram with the time index i=1, 2 ... N. and the number of points in an energy window is ne. Then, the modified energy ratio is defined as\n: \\begin{align}\n& er3_i=(abs(x_i)^*er_i)^3 \\\\\n\\end{align}\nThe peak of the modified energy ratio er3i is very closed to the time of first arrivals on noise-free seismograms.\nMulti-Window Method\nSource:\nThis method needs to calculate the averages of absolute amplitudes from a seismic trace by using three moving time windows before and after each time point (sample).\nWhen the instantaneous absolute amplitude exceeds an automatically adjusted threshold, ratios based on the averages of the windows over previous time samples provide standards to differentiate signals from unwanted noise.\nThe multi-window automatic P phase picker operates in the time-domain. It includes procedures to define: time windows, standards, corresponding thresholds and waveform correction.\n1. The averages of absolute amplitudes within BTA (Before Term Average), ATA (After Term Average) and DTA (Delayed Term Average) windows are respectively defined as follows:\n: \\begin{align}\n&\\overline{BTA(t)}=\\sum_{i=1}^{m}\\frac{|u(t-i)|}{m}\\\\\n&\\overline{ATA(t)}=\\sum_{i=1}^{n}\\frac{|u(t+j)|}{n}\\\\\n&\\overline{DTA(t)}=\\sum_{j=1}^{q}\\frac{|u(t+j+d)|}{q}\\\\\n&R_2(t)=\\frac{\\overline{ATA(t)}}{\\overline{BTA(t)}}\\\\\n&R_3(t)=\\frac{\\overline{DTA(t)}}{\\overline{BTA(t)}}\\\\\n\\end{align}\nStandards R2(t) and R3(t) are used for the discrimination of high-amplitude short-duration and long-duration noise.\n2.Thresholds is defined as\n: \\begin{align}\n& H_1(t)=E_m(t-p)+\\alpha E_{sd}(t-p) \\\\\n\\end{align}\nwhere Em is mean and Esd is standard deviation; p is the number of shifted samples; α is the coefficient to adjust the height of the first threshold and is taken to be 3. From this equation it is obvious that H1(t) is automatically adjusted with the variance of the background noise.\n3. H1(t) is defined larger than most pre-existing noise levels, and the instantaneous absolute amplitude at the trigger time point is higher than H1(t), according to the configuration of the first arrival of an event the real onset time must be earlier than the trigger time point. A waveform correction should be used to compensate this belated onset time. For an impulsive first arrival, the height of the absolute amplitude and the representative gradient at the trigger point can be used to accomplish the correction.\nAvailable Code\nPotash SU is a package including Seismic Unix style codes developed by Balazs Nemeth, it provides a subroutine called simple window-based first break picker, the figure shows the seismic images before and after the application of subroutine.\nFuture Trend of the Topic\nMethods of Picking: automatic first-break picking has played an important role in seismic data processing, and directly influences the quality of seismic sections. Because of the increase of seismic survey size, more efficient and fast first break picking methods are needed, with parallel methods being preferred.\nApplication of First Break detection: Traditionally the geophysicist uses first breaks for static correction. First break signal can also be used as observation data for history matching.\nNotes"
    }
  ]
}