{
  "content": [
    {
      "type": "text",
      "text": "# First Anglo-Mysore War\n\n*Treaty of Madras\n| territory         =\n| combatant1        =\n* Arakkal Kingdom Nizam of Hyderabad (defected in 1768)\n*Savanur State\n* Banganapalle State\n| combatant2        =  Carnatic state\n| commander1        =  Haider Ali\n* Latif Ali Beg\n* Makdum Ali\n* Tipu Sultan\n* Reza Sahib\n* Husain Ali Khan Bahadur\n* Asaf Jah II (defected in 1768)}}\n| commander2        =  Joseph Smith\n* John Wood\n* Colonel Brooks\n* Wallajah}}\n}}\nThe First Anglo-Mysore War (1767–1769) was a conflict in India between the Sultanate of Mysore and the East India Company. The war was instigated in part by the machinations of Asaf Jah II, the Nizam of Hyderabad, who sought to divert the company's resources from attempts to gain control over the Northern Circars.\nBackground\nThe eighteenth century was a period of great turmoil in Indian subcontinent. Although the century opened with much of the subcontinent under the control of the Mughal Empire, the death in 1707 of Emperor Aurangzeb resulted in the fracturing of the empire, and a struggle among viceroys and other local rulers for territory. In the 1740s and 1750s, French and British colonial companies became more active in these local conflicts. By the Third Carnatic War (1757–1763), the British had gained somewhat solid footholds at Bombay, Madras, and Calcutta, and had also marginalised (although not eliminated) the influence of other colonial powers. Their eastern holdings at Madras were strongly influenced by treaties with the Nawab of Carnatic, Muhammed Ali Khan Wallajah, whose territory surrounded Madras. The other major powers in the east were the Nizam of Hyderabad, formerly a viceroyalty of the Mughal Empire but declared independent in the 1720s, held in the 1760s by Asaf Jah II, and the Sultanate of Mysore, which occupied the high plains between the Eastern and Western Ghats, the mountain ranges separating the coastal plains of India from the interior.\nNominally ruled by the Wodeyar dynasty, Mysore had come into the hands of Hyder Ali, a Muslim military leader, in 1761. Each of these powers intrigued with and against the others, and sought to draw the power of the French and British colonial companies to serve their objectives. The colonial powers sought to influence the local powers to gain either direct control of territory, or the revenues from territory nominally controlled by a local ruler beholden to them for financial and military support. Since European military training was significantly better than local practices, the latter was particularly important; small numbers of disciplined European or European-trained forces could defeat larger Indian armies composed mainly of poorly trained infantry and cavalry.\nCauses of war\n.]]\nThe British East India Company, seeking an overland connection between its holdings at Madras and Bengal, sought to gain access to the Northern Circars, a series of coastal territories held by the French until 1758, when they were ousted with British military support. They had applied to the Nizam, offering to pay rent well above that he was currently receiving from the nawab of Arcot; the Nizam rejected their offers. Lord Robert Clive next applied to Mughal Emperor Shah Alam II, who in August 1765 issued a decree granting the company rights to that territory.\nAt the same time, the Nizam was involved in an alliance with the Marathas. Both he and the Marathas' ruling peshwa, Madhavrao I were concerned over the expansionist threat posed by Hyder Ali. After assisting the Marathas in dealing with one of their confederates 1765, the allies began developing plans to invade Mysore. When the British began occupying the Northern Circars in March 1766, the Nizam objected, issuing threatening letters to company authorities in Madras. He considered going to war against the company, but his poor financial condition made this impossible. Instead he negotiated a treaty with the company in November 1766. Under its terms the company received four of the five circar immediately (Guntur, the fifth, having been granted to the Nizam's son as a jaghir, was to be delivered upon the son's death) in exchange for 7 lakh rupees or military support to the Nizam in his endeavours. One historian describes the Nizam's agreement to the treaty as one of financial necessity, and that he was \"resentful\" of English power. Pursuant to this treaty, the company provided two battalions of troops to the Nizam. Under the treaty, there were no limits placed on the number of troops the Nizam could request, nor were there checks on the uses (offensive or defensive) to which he could put them.\nConflict involving Madras authorities, Muhammed Jinnah and Tipu Sultan, was also simmering. Muhammed Ali Khan Wallajah, allied to the British, whose territory his surrounded, was upset that Hyder was harboring opponents of his, including his older brother Mahfuhz Khan, and Raja Saheb, the son of Chanda Saheb, a previous contender for the throne of the Carnatic. Hyder was annoyed that the British had established a fortified outpost at Vellore, and that the company had several times rebuffed his offers of alliance. An offer he made in late 1766 was rejected because the local company council viewed it as incompatible with the treaty signed with the Nizam. The First Anglo-Mysore War saw Hyder Ali gain some measures of success against the British, almost capturing Madras.\nCourse of the war\nThe war began in January 1767, when the Marathas, possibly anticipating movements by the Nizam, invaded northern Mysore. They reached as far south as the Tunghabadhra River, before Haider entered into negotiations to end the invasion. In exchange for payments of 30 lakhs rupees the Marathas agreed to withdraw north of the Krishna River; by March, when the Nizam began his invasion, they had already withdrawn. According to Mysore historian Mark Wilks, this action by the Marathas was a somewhat typical move to acquire wealth that might otherwise be claimed by other belligerents. The Nizam advanced as far as Bangalore, accompanied by two battalions of company troops under Colonel Joseph Smith.\nIn May, Smith discovered that Hyder and The Nizam were negotiating an alliance, he consequently withdrew most of his troops to the Carnatic frontier. The deal struck between the two powers to join against the British. The alliance accord stated that Hyder Ali was to pay Rs. 18 lakhs to the Nizam for him to be able to pay off the Marathas who in turn would end their invasion of the southern regions whereas Nizam was to consider Hyder's son Tipu Sultan as Nawab of the Carnatic subsequent to the claim of Carnatic territory.\nThis diplomatic maneuvering resulted in an attack against a company outpost at Changama by the combined Mysore and Hyderabad army under Hyder's command. Despite significantly outnumbering the British force (British estimates place the allied army size at 70,000 to the British 7,000), the allies repulsed the British causing them heavy losses. Hyder moved on to capture Kaveripattinam after two days of siege, while Colonel Smith, who commanded at Changama, eventually retreated to Tiruvannamalai for supplies and reinforcements. There Haider again attacked, and was decisively repulsed on 26 September 1767. With the onset of the monsoon season, Haider opted to continue campaigning rather than adopting the usual practice of suspending operations because of the difficult conditions the weather created for armies. After overrunning a few lesser outposts, he besieged Ambur in November 1767, forcing the British to resume campaigning. The British garrison commander refused large bribes offered by Haider in exchange for surrender, and the arrival of a relief column in early December forced Haider to lift the siege. He retreated northward, covering the movements of the Nizam's forces, but was disheartened when an entire corps of European cavalry deserted to the British. The failures of this campaign, combined with successful British advances in the Northern Circars and secret negotiations between the British and the Nizam, led to a split between Haider and the Nizam. The latter withdrew back to Hyderabad and eventually negotiated a new treaty with the British company in 1769. Haider, apparently seeking an end to the conflict, made peace overtures to the British, but was rebuffed.\nopposed the East India Company in 1766, and initially allied himself with Haider Ali during the First Anglo-Mysore War, particularly during the Battle of Chengam, but later abandoned Mysore's cause in 1768.]]\nIn early 1768, company authorities in Bombay organised an expedition to Mysore's Malabar coast territories. Hyder had established a small fleet, based primarily in the port of Mangalore, in the mid-1760s. This fleet, which the British reported as numbering about ten ships, deserted en masse, apparently because the captains were unhappy with Lutf Ali Beg, a Mysorean cavalry officer, as fleet commander. Owing to a British deception, Lutf Ali Beg also withdrew much of the Mangalore garrison to move on what he perceived to be the British target, Onore. The British consequently occupied Mangalore against minimal opposition in February. This activity, combined with the loss of the Nizam as an ally, prompted Hyder to withdraw from the Carnatic, and move with speed to the Malabar. Dispatching his son Tipu with an advance force, Haider followed, and eventually retook Mangalore and the other ports held by the over-extended British forces. He also levied additional taxes as punishment against rebellious Nair districts that had supported the British.\nDuring Haider's absence from the Carnatic, the British recovered many places that Hyder had taken and only weakly garrisoned, and advanced as far south as Dindigul. They also convinced the Marathas to enter the conflict, and a large force of theirs, under the command of Morari Rao, joined with Colonel Smith at Ooscota in early August 1768. This army then began preparations to besiege Bangalore, but Hyder returned to Bangalore from the Malabar on 9 August, in time to harass the allies before the siege could begin. On 22 August Hyder attacked the Maratha camp at Ooscota, but was repulsed with heavy losses. Hyder was then foiled in an attempt to prevent the arrival of a second British column at the allied camp; the strength of these combined forces convinced him to retreat from Bangalore toward Gurramkonda, where he was reinforced by his brother in law. He also attempted diplomatic measures to prevent a siege of Bangalore, offering to pay ten lakhs rupees and grant other land concessions in exchange for peace. The British countered with an aggressive list of demands that included payments of tribute to the Nizam and larger land concessions to the British East India Company. Hyder specifically refused to deal with Muhammed Ali Khan Wallajah, whose lands were where much of the fighting had taken place, and a man Hyder intensely disliked. The negotiations failed to reach common ground.\nOn 3 October, Hyder, while moving his army from Guuramkonda back toward Bangalore, surprised a small garrison of Muhammed Ali Khan Wallajah's men at a rock fort called Mulabagilu, near Hosakote. British reinforcements were sent, and Colonel Wood was able to recover the lower fort but not the upper. The next day he went out with a few companies of men to investigate movements that might have been cover for enemy reinforcements. This small force, numbering four companies, was surrounded by Hyder's entire army. A stratagem by another officer, Colonel Brooks, prevented the loss of this detachment; Colonel Brooks and another two companies dragged two cannons to the top of a nearby rise, and Brooks called out \"Smith! Smith!\" while firing the cannons. Both sides interpreted this to mean that Colonel Smith was arriving in force, and Hyder's troops began to retreat. This enabled Colonel Wood to join with Brooks and other reinforcements from Mulwagal before Hyder realised he had been fooled. Hyder renewed his attack, but was eventually repulsed with heavy losses: he was estimated to lose 1,000 men while the British lost about 200. The severity of the conflict convinced Colonel Smith that he would be unable to effectively besiege Bangalore without first inflicting a major defeat on Hyder in open battle. Company officials blamed Smith for the failure to decisively defeat Hyder, and recalled him to Madras. Hyder took the opportunity to besiege Hosur, and Colonel Wood marched in relief of the town. As Wood approached, Hyder raised the siege, sneaked around Wood's column, and attacked his baggage train near Bagalur. Hyder successfully captured supplies and arms, and drove Wood in disgrace toward Venkatagiri. Wood was consequently recalled and replaced by Colonel Lang.\nHyder then raised additional forces in Mysore and went on the offensive. In November 1768 he split his army into two, and crossed the ghats into the Carnatic, regaining control of many minor posts held by the British. En route to Erode Hyder overwhelmed one contingent of British, who were sent as prisoners to Seringapatam when it was established that one of its officers was fighting in violation of a parole agreement. After rapidly establishing control over much of the southern Carnatic, his march turned toward Madras. This prompted the British to send an envoy to discuss peace; because of Hyder's insistence that the nawab of the Carnatic be excluded from the negotiations, they went nowhere. Hyder then surprised company authorities by taking a picked force of 6,000 cavalry and a small number of infantry, and made a three-day forced march of  to the gates of Madras.\nThis show of force compelled the company to negotiate further, since Madras had been left nearly defenceless by military movements made to counter those of Hyder's main force. Hyder, who was seeking diplomatic leverage against the Marathas, wanted an alliance of mutual defence and offence. The company refused to accede to an offensive military treaty; the Treaty of Madras signed on 29 March 1769 had terms that each would support the other if attacked.\nConsequences\nHyder Ali, apparently emboldened by the agreement with the British, engaged in war with the Marathas in 1770, and asked the British support them if and when the Marathas penetrated Mysorean territory. The British refused to assist him, even though they were also drawn into conflict with the Marathas in the 1770s. Hyder's battles did not fully end until 1779, when the Marathas negotiated an alliance with him and the Nizam for united action against the British. This led to the beginning of the Second Anglo-Mysore War in 1780. This conflict devastated much of the Carnatic, and also failed to decisively resolve differences between Mysore and the British. Resolution occurred in 1799 with the defeat and killing of Hyder's son Tipu Sultan, and the restoration of the Wodeyars as British clients.\nNotes\nReferences\n*\n*\n*\n*\n*\n*\n*\n*  Rao Punganuri was, according to Brown, in the employ of both Hyder and Tipu.\n*\n*\n*\n*  Biography of Hyder and memoir by one of his French officers; coauthor Gholam Mohammed was Tipu Sultan's son.\n*\n*"
    }
  ]
}