{
  "content": [
    {
      "type": "text",
      "text": "# First Battle of Edea\n\nBritish Empire\n* British Nigeria\n*  French Equatorial Africa\n| combatant2  =  German Empire\n* German Kamerun\n| combatant3  =\n| commander1  =   General Charles M. Dobell   Colonel Mayer Commander L. W. Braithwaite\n| commander2  =   Major Carl Zimmermann\n| commander3  =\n| units1      =\n| units2      =\n| units3      =\n| strength1   =\n| strength2   =\n| strength3   =\n|casualties1=\n|casualties2=\n|campaignbox =\n}}\nThe First Battle of Edea involved the British and French assault on German forces stationed in the village of Edea during the Kamerun campaign of the First World War. Allied forces from Duala launched their advance on 20 October. Following stiff resistance along the southern railway line between Duala and Edea, German forces withdrew from the town to Jaunde, allowing Allied troops to finally occupy Edea on 26 October 1914.\nBackground\nAfter British and French forces had landed in and occupied the major port city of Duala in September 1914, the German garrison that had once protected it retreated inland. One group withdrew along the northern rail line to Dschang, while another traveled up the Wuri River to Jabassi. The largest group which included Kamerun's governor, Karl Ebermaier and commandant, Major Zimmermann, had moved southeast along the southern railway line to the village of Edea. During their retreat, German forces damaged or destroyed much of the railway. General Dobell, the British commander at Duala feared that the German forces that had retreated could pose a threat to his new acquisitions, prompting attacks on Jabassi and Edea in October 1914.\nAfter the German defeat at the Battle of Jabassi in early October, river vessels and manpower became available for an assault on Edea which lay on the Sanaga River to the southeast of Jaunde.\nFrench assault on the Yapoma Bridge\nDuring the retreat to Edea, German forces damaged the railway bridge at Yapoma, just outside Duala. A small German detachment remained entrenched on the far side of the Dibamba River at the damaged bridge while the majority of the force had retreated to Edea. The German control of the bridge was seen as a great danger to the Allied occupation of Duala due to Japoma's close proximity to the town. On 6 October, a French force of 400 tirailleurs under Colonel Mayer assisted by British naval bombardment made an assault on this position. The French troops crossed the bridge under severe fire from the entrenched German force who withdrew. Securing the partially damaged railway bridge made a push to Edea, further to the southeast, possible.\nAssault on Edea\nWith Yapoma  and Jabassi (Yabassi) secured, Dobell initiated the assault on Edea. On 20 October he launched an expedition up the Njong River to the village of Dehane which lay to the south of Edea. A track through the jungle connected the two settlements. The British force that had sailed up the Njong arrived in Dehane on 21 October and began to march north to Edea. A second British column under Commander L. W. Braithwaite would move up the Sanaga River. Colonel Mayer's French force would advance eastward along the railway line from Yapoma. One French and two British officers were killed among others when their boat capsized on the Njong river early in the operations. The Sanaga River flotilla had great difficulty navigating because of the many natural obstacles such as sand bars that lay below the surface.\nThe columns moving north from Dehane and up the Sanaga did not experience significant resistance from German forces but did face disease. Zimmerman chose to focus the defense of Edea on the southern railway line. The French column under Mayer that had moved east along the railway line from Yapoma encountered heavy resistance throughout their advance and suffered severe casualties as a result. Realizing that the Japoma column continued to advance despite their resistance and that other columns were closing in from Dehana and the Sanaga, German forces including the governor and commandant withdrew to Jaunde, approximately 100 miles to the east. On 26 October British and French forces entered and occupied Edea, finding the Germans fled.\nAftermath\nAfter the capture of Edea, Allied troops moved 20 miles further inland to Kopongo. A German attempt to recapture Edea would fail at the Second Battle of Edea in early January 1915.\nFollowing the success at Jabassi and now Edea, the only remaining German unit that had withdrawn from Duala in September was the one which moved north towards the fort at Dschang. In December 1914 a British force under Colonel Edmund H. Georges would begin its march toward Dschang. On 2 January 1915 George's force reached Dschang and began a bombardment of the German fort there, which forced the garrison's surrender. The British force destroyed the fort before withdrawing to more secure lines of communication at the railhead at Bare.\nNotes\nReferences\n*Burg, David F., and L. Edward. Purcell. Almanac of World War I. Lexington, KY: University of Kentucky, 1998.\n*Dane, Edmund. British Campaigns in Africa and the Pacific, 1914-1918,. London: Hodder and Stoughton, 1919.\n*Germans in East and West Africa. Journal of the African Society 15 (1915): 1-10.\n*O'Neill, Herbert C. The War in Africa and the Far East. London: London Longmans Green, 1918.\n*Strachan, Hew. The First World War in Africa. Oxford University Press. 2004.\n*Dobell, Charles M. United Kingdom. War Office. [http://www.naval-history.net/WW1Battle1409Cameroons.htm Cameroons Campaign Army Despatch.]  1 March 1916. Web."
    }
  ]
}