{
  "content": [
    {
      "type": "text",
      "text": "# First English Civil War, 1642\n\nThe First English Civil War started in 1642. By the end of the year neither side had succeeded in gaining an advantage, although the King's advance on London was the closest Royalist forces came to threatening the city.\nPrelude to war\nWhen the King raised his standard at Nottingham on 22 August 1642, war was already in progress on a small scale in many districts; each side endeavouring to secure, or to deny to the enemy, fortified country-houses, territory, and above all arms and money. On the other hand as the trained bodies who had attended the occasion went home, and his standard blew down that evening it was not clear whether he could rally sufficient forces to his cause to constitute an army. Peace negotiations went on in the midst of these minor events, until there came from the Parliament an ultimatum, so aggressive as to fix the war-like purpose of the still vacillating court at Nottingham, and in the country at large, to convert many thousands of waverers to active Royalism.\nCampaign of 1642\nEre long, Charles who hitherto had fewer than 1,500 men, was at the head of an army which, though very deficient in arms and equipment, was not greatly inferior in numbers or enthusiasm to that of Parliament. The latter (20,000 strong, exclusive of detachments) was organized during July, August, and September about London, and moved from there to Northampton under the command of Lord Essex.\nAt this moment, the military situation was as follows: the Marquess of Hertford in South Wales, Hopton in Cornwall, and the young Earl of Derby in Lancashire, and small parties in almost every county of the west and the Midlands, were in arms for the King. North of the Tees, Newcastle, a great territorial magnate, was raising troops and supplies for the King, while Queen Henrietta Maria was busy in Holland, arranging for the importation of war material and money. In Yorkshire, opinion was divided, the royal cause being strongest in York and the North Riding, that of the Parliamentary party, in the clothing towns of the West Riding.\nThe important seaport of Hull, had a royalist civilian population, but Sir John Hotham, the military governor, and the garrison supported Parliament. During the summer Charles had tried to seize ammunitions stored in the city but had been forcefully rebuffed.\nThe Yorkshire gentry made an attempt to neutralise the county, but a local struggle soon began, and Newcastle thereupon prepared to invade Yorkshire. The whole of the south and east, as well as parts of the Midlands and the west, and the important towns of Bristol and Gloucester, were on the side of the Parliament. A small Royalist force was compelled to evacuate Oxford on 10 September.\nOn 13 September, the main campaign opened. The King, to find recruits amongst his sympathisers and arms in the armouries of the Derbyshire and Staffordshire, trained bands and also, to be in touch with his disciplined regiments in Ireland by way of Chester, moved westward to Shrewsbury. Essex followed suit by marching his army from Northampton to Worcester. Near here, a sharp cavalry engagement, Powick Bridge, took place on 23 September between the advanced cavalry of Essex's army, and a force under Prince Rupert, which was engaged in protecting the retirement of the Oxford detachment. The result of the fight was the immediate overthrow of the Parliamentary cavalry, and this gave the Royalist troopers a confidence in themselves and in their brilliant leader, which was not shaken until they met Oliver Cromwell's Ironsides.\nRupert soon withdrew to Shrewsbury, where he found many Royalist officers eager to attack Essex's new position at Worcester. But the road to London now lay open and it was decided to take it. The intention was not to avoid a battle, for the Royalist generals wanted to fight Essex before he grew too strong, and the temper of both sides made it impossible to postpone the decision. In the Earl of Clarendon's words: \"it was considered more counsellable to march towards London, it being morally sure that Essex would put himself in their way\". Accordingly, the army left Shrewsbury on 12 October, gaining two days' start on the enemy, and moved south-east via Bridgnorth, Birmingham, and Kenilworth. This had the desired effect.\nParliament, alarmed for its own safety, sent repeated orders to Essex to find the King and bring him to battle. Alarm gave place to determination, when it was discovered that Charles was enlisting papists and seeking foreign aid. The militia of the home counties was called out. A second army under Warwick was formed round the nucleus of the London trained bands, and Essex, straining every nerve to regain touch with the enemy, reached Kineton, where he was only seven miles (eleven kilometres) from the King's headquarters at Edgecote, on 22 October.\nBattle of Edgehill\nRupert promptly reported the enemy's presence, and his confidence dominated the irresolution of the King, and the caution of the Earl of Lindsey, the nominal Commander-in-Chief. Both sides had marched, widely dispersed to live, and the rapidity with which, having the clearer purpose, the Royalists drew together, helped considerably to neutralise Essex's superior numbers.\nDuring the morning of 23 October 1642, the Royalists formed in battle order on the brow of Edge Hill, facing towards Kineton. Essex, experienced soldier as he was, had distrusted his own raw army too much to force a decision earlier in the month, when the King was weak; he now found Charles in a strong position with an equal force to his own 14,000, and some of his regiments were still some miles distant. But he advanced beyond Kineton, and the enemy promptly left their strong position and came down to the foot of the hill; situated as they were, they had either to fight wherever they could induce the enemy to engage, or to starve in the midst of hostile garrisons.\nRupert was on the right of the King's army with the greater part of the horse; Lord Lindsey and Sir Jacob Astley in the centre with the foot, while Henry Wilmot, Earl of Rochester (with whom rode the Earl of Forth, the principal military adviser of the King) with a smaller body of cavalry, was on the left. In rear of the centre were the King and a small reserve. Essex's order was similar. Rupert charged as soon as his wing was deployed, and before the infantry of either side were ready. Taking ground to his right front and then wheeling inwards at full speed, he instantly rode down the Parliamentary horse, opposed to him. Some infantry regiments of Essex's left centre shared the same fate as their cavalry.\nOn the other wing, Forth and Wilmot likewise swept away all that they could see of the enemy's cavalry. The undisciplined Royalists of both wings pursued the fugitives in wild disorder up to Kineton, where they were severely handled by John Hampden's infantry brigade (which was escorting the artillery and baggage of Essex's army). Rupert brought back only a few rallied squadrons to the battlefield, and in the meantime, affairs there had gone badly for the King.\nThe right and centre of the Parliamentary foot (the left having been brought to a halt by Rupert's charge) advanced with great resolution. Being at least as ardent as, and much better armed than Lindsey's men, they engaged the latter fiercely and slowly gained ground. Only the best regiments on either side, however, maintained their order, and the decision of the infantry battle was achieved mainly by a few Parliamentary squadrons.\nOne regiment of Essex's right wing had been the target of Wilmot's charge. The other two had been at the moment, invisible, and every Royalist troop on the ground, including the King's guards, joined in the mad ride to Kineton. This regiment, Essex's life-guard, and some troops that had rallied from the effect of Rupert's charge (amongst them, Captain Oliver Cromwell's), were the only cavalry still present. They now joined with decisive effect in the attack on the left of the royal infantry.\nThe King's line was steadily rolled up from left to right. The Parliamentary troopers captured his guns, and regiment after regiment broke up. Charles himself stood calmly in the thick of the fight, but he had not the skill to direct it. The Royal Standard was taken and retaken; Sir Edmund Verney, the standard-bearer, was killed as was Lindsey in a separate melée. By the time that Rupert returned, both sides were incapable of further effort and disillusioned as to the prospect of ending the war at a blow, so far from settling the issue the Battle of Edgehill was to be the first of a series of pitched battles.\nOn 24 October Essex retired, leaving Charles to claim victory and to reap its results. Banbury and Oxford were reoccupied by the Royalists, and by 28 October, Charles was marching down the Thames valley on London. Negotiations were reopened, and a peace party rapidly formed itself in London and Westminster. Yet, field fortifications sprang up around London, and when Rupert stormed Brentford and sacked it on 12 November, the trained bands moved out at once and took up a position at Turnham Green, barring the King's advance.\nHampden, with something of the fire and energy of his cousin, Cromwell, urged Essex to turn both flanks of the Royal army via Acton and Kingston; experienced professional soldiers, however, urged him not to trust the London men to hold their ground, while the rest manoeuvred. Hampden's advice was undoubtedly premature. A Sedan or Worcester was not within the power of the Parliamentarians of 1642. In Napoleon's words: \"one only manoeuvres around a fixed point\", and the city levies at that time were certainly not, vis-à-vis Rupert's cavalry, a fixed point.\nAs a matter of fact, after a slight cannonade at the Battle of Turnham Green on 13 November, Essex's two-to-one numerical superiority of itself compelled the King to retire to Reading. Turnham Green has justly been called the \"Valmy of the English Civil War\"; for like the Battle of Valmy it was a victory without having to come to battle, and the tide of invasion having reached this far, ebbed and never returned.\nThe winter of 1642–43\nIn the winter, while Essex's army lay inactive at Windsor, Charles by degrees consolidated his position in the region of Oxford. The city was fortified as a redoubt for the whole area, and Reading, Wallingford, Abingdon, Brill, Banbury and Marlborough constituted a complete defensive ring which was developed by the creation of smaller posts from time to time.\nIn the North and West, winter campaigns were actively carried on: \"It is summer in Yorkshire, summer in Devon, and cold winter at Windsor\", said one of Essex's critics. At the beginning of December 1642, Newcastle crossed the River Tees, defeated Sir John Hotham, the Parliamentary commander in the North Riding. He then joined hands with the hard-pressed Royalists at York, establishing himself between that city and Pontefract. Lord Fairfax of Cameron and his son Sir Thomas Fairfax, who commanded for the Parliament in Yorkshire, had to retire to the district between Hull and Selby, and Newcastle was now free to turn his attention to the Puritan \"clothing towns\" of the West Riding, Leeds, Halifax and Bradford. The townsmen, however, showed a determined front. Sir Thomas Fairfax with a picked body of cavalry rode through Newcastle's lines into the West Riding to help them, and about the end of January 1643, Newcastle gave up the attempt to reduce the towns.\nNewcastle continued his march southward, however, and gained ground for the King as far as Newark-on-Trent, so as to be in touch with the Royalists of Nottinghamshire, Derbyshire and Leicestershire (who, especially about Newark and Ashby-de-la-Zouch, were strong enough to neutralise the local forces of Parliament), and to prepare the way for the further advance of the army of the north, when the Queen's convoy should arrive from overseas.\nIn the west, Hopton and his friends, having obtained a true bill from the grand jury against the Parliamentary disturbers of the peace, placed themselves at the head of the county militia. They drove the rebels from Cornwall, after which they raised a small force for general service and invaded Devonshire in November 1642. Subsequently, a Parliamentary army under the Earl of Stamford was withdrawn from South Wales to engage Hopton, who had to retire into Cornwall. There, however, the Royalist general was free to employ the militia again, and thus reinforced, he won a victory over a part of Stamford's forces at the Battle of Bradock Down near Liskeard on 19 January 1643 and resumed the offensive.\nAbout the same time, Hertford, no longer opposed by Stamford, brought over the South Wales Royalists to Oxford. The fortified area around that place was widened by the capture of Cirencester on 2 February. Gloucester and Bristol were now the only important garrisons of the Roundheads in the west. In the Midlands, in spite of a Parliamentary victory won by Sir William Brereton at the Battle of Nantwich on 28 January, the Royalists of Shropshire, Staffordshire, and Leicestershire soon extended their influence through Ashby-de-la-Zouch into Nottinghamshire and joined hands with their friends at Newark.\nAround Chester, a new Royalist army was being formed under the Lord Byron, and all the efforts of Sir John Brereton and of Sir John Gell, 1st Baronet, the leading supporter of Parliament in Derbyshire, were required to hold their own, even before Newcastle's army was added to the list of their enemies. The Lord Brooke, who commanded for Parliament in Warwickshire and Staffordshire and was looked on by many as Essex's eventual successor, was killed in besieging Lichfield Cathedral on 2 March, and, though the cathedral soon capitulated, Gell and Brereton were severely handled in the indecisive Battle of Hopton Heath near Stafford on 19 March, and Prince Rupert, after an abortive raid on Bristol (7 March), marched rapidly northward, storming Birmingham en route, and recaptured Lichfield Cathedral. He was, however, soon recalled to Oxford to take part in the main campaign.\nThe position of affairs for Parliament was perhaps at its worst in January. The Royalist successes of November and December, the ever-present dread of foreign intervention, and the burden of new taxation which Parliament now found itself compelled to impose, through the Committee for the Advance of Money, disheartened its supporters. Disorders broke out in London, and, while the more determined of the rebels began thus early to think of calling in the military assistance of the Scots, the majority were for peace on any conditions.\nBut soon the position improved somewhat; the Earl of Stamford in the west and Brereton and Gell in the Midlands, though hard pressed, were at any rate in arms and undefeated, Newcastle had failed to conquer West Riding, and Sir William Waller, who had cleared Hampshire and Wiltshire of \"malignants\", entered Gloucestershire early in March, destroyed a small Royalist force at Highnam on 24 March, and secured Bristol and Gloucester for Parliament.\nFinally, some of Charles's own intrigues opportunely came to light. The waverers, seeing the impossibility of plain dealing with the court, rallied again to the party of resistance. The series of negotiations called by the name of the \"Treaty of Oxford\" closed in April, with no more result than those which had preceded Edgehill and Turnham Green.\nAbout this time too, following and improving upon the example of Newcastle in the north, Parliament ordered the formation of the celebrated \"associations\" or groups of counties, banded together by mutual consent for defence. The most powerful and best organised of these was that of the eastern counties (headquartered in Cambridge), where the danger of attack from the north was near enough to induce great energy in the preparations for meeting it, and at the same time, too distant effectively to interfere with these preparations. Above all, the Eastern Association was from the first, guided and inspired by Colonel Cromwell.\nThe field fortifications that were hastily thrown up during the summer of 1642 to defend London, were supplemented with the Lines of Communication (the name given for new ring of fortifications around the City of London and the outer boroughs) that were commissioned by Parliament in 1642 and completed in 1643.\nNotes\nReferences\n*\n;Attribution\n*\n{| class=\"wikitable\" style=\"margin: 1em auto 1em auto\"\n|-\n|1642||First English Civil War||1643 →\n|}"
    }
  ]
}