{
  "content": [
    {
      "type": "text",
      "text": "# First Nations Australian traditional custodianship\n\n}}\n. While these lands and seas are widely recognised as Larrakia Country, some sources also list the Belyuen and Wadjiginy people as traditional custodians.]]\nThe concept of First Nations Australian traditional custodianship derives from Aboriginal and Torres Strait Islander peoples' strong traditional connection with the lands and seas they reside on, known collectively as \"Country\". The term \"traditional custodian\" is often used interchangeably with \"traditional owner\" in the context of native title in Australia, including in acknowledgements of Country. The role of a custodian, however, implies a responsibility to care for Country, reflecting a worldview that is not necessarily compatible with the Western concepts of land ownership and the right to property.\nWhile specific practices and interpretations of custodianship may differ among the hundreds of distinct Aboriginal Australian and Torres Strait Islander groups, they all seemingly share a close affiliation with the land and a responsibility to look after it. Since the 1980s, First Nations and non-First Nations Australian academics have developed an understanding of a deeply rooted custodial obligation, or custodial ethic, that underpins Aboriginal Australian culture, and could offer significant benefits for sustainable land management and reconciliation in Australia.\nDefinitions in Australian literature\nAboriginal Australian academics Joann Schmider (Mamu), Samantha Cooms (Nunukul) and Melinda Mann (Darumbal) offer the following simple definition of traditional custodians: \"the direct descendants of the Indigenous people of a particular location prior to colonisation\". However, they add the caveat that \"western worldviews are encapsulated within the English language and using western terminology to illuminate Indigenous ways of knowing, being and doing is inevitability fraught with misinterpretations and imperfect understandings\". As noted by Wiradjuri scholar Yalmambirra and European Australian archaeologist Dirk Spennemann: \"before the onset of European administration, there was no collective concept for the original custodians of this continent, and each community, culturally divergent from its neighbours, had its own identity\".\nThe English-language term \"traditional custodians\" is not unique to First Nations Australians, and has been used to refer to local communities' relationships with land and resources in West Africa, Southern Africa, and Canada. It has been applied in an Australian context since 1972 at the latest, when sections 4 and 9 of the Western Australian Aboriginal Heritage Act 1972 defined them as \"a representative body of persons of Aboriginal descent [that] has an interest in a place or object to which this Act applies that is of traditional and current importance to it\".\nFollowing progress on First Nations land rights, European Australian understanding of traditional custodianship improved in the 1980s. In 1981, journalist Jack Waterford wrote of Aboriginal law as a system of \"religious obligations, duties of kinship and relationship, caring for country and the acquisition and passing on of the community's store of knowledge\". Geographer Elspeth Young, in 1987, elaborated on the concept of \"caring for country\" as \"a set of practices that articulated primary rights to land, which were based on spiritual custodianship, with secondary land use rights\". By 1992, handing down their judgment on the landmark Mabo case, High Court Justices William Deane and Mary Gaudron acknowledged that \"[u]nder the laws or customs of the relevant locality, particular tribes or clans were, either on their own or with others, custodians of the areas of land from which they derived their sustenance and from which they often took their tribal names. Their laws or customs were elaborate and obligatory.\"\nIn a 2021 report, the Australian federal Department of Climate Change, Energy, the Environment and Water defined traditional custodians as \"Indigenous people or nations who have responsibilities in caring for their Country\". This contrasted with traditional owners, defined as \"an Indigenous owner of their traditional Country, as determined through the purchase of freehold, as granted by government or as determined through the native title process\". Since 2022 the Australian Public Service has advised capitalising the first letters in each word when referring to traditional custodians, i.e. \"Traditional Custodians\".\nFirst Nations understandings of custodianship\nman Josh Whiteland (2015) sharing a traditional Dreamtime story, offering an explanation for how humans came to bear the custodial responsibility of caring for the natural environment around them]]\nFirst Nations Australians have expressed their interpretations of traditional custodianship through academic writing, political advocacy, traditional stories, poetry and music.\nNumerous Aboriginal and Torres Strait Islander cultures share an understanding that, contrary to Western views on land ownership, the land \"owns us\". Elders including Quandamooka woman Oodgeroo Noonuccal, Gai-mariagal and Wiradjuri man Dennis Foley, and Yankunytjatjara man Bob Randall discuss this theme at length, often in a spiritual context, referring to Country as an owner or a maternal figure, and a core component of cultural identity. Noonuccal assigns particular importance to the following maxim: \"We cannot own the land for the land owns us\".\nDrawing on this important relationship with Country, many First Nations Australians — including Aboriginal Australians across the continent and Torres Strait Islanders alike — identify a sense of responsibility or obligation to care for Country as a central tenet of traditional custodianship. Yolŋu woman Djuwalpi Marika outlined this sense of responsibility within her community in a 1993 report: \"The Yolngu people belong to a number of separate clan groups, each consisting of individual families. Each clan is spiritually connected to their own particular ancestral homeland place (wanga), and being the traditional custodians are responsible for the care and management of their wanga. Living in their own lands make people feel happy and brings the relationship of the land, its people and their ancestors together.\"\nTurbuna man Jim Everett and Barkandji woman Zena Cumpston both identify a custodial obligation to care for Country as a shared foundation of First Nations communities across Australia, embedding a sense of deep respect and accountability for the natural world. According to this view, being on Country is not considered a right, but a privilege; as Warrwa-Noongar woman Louise O'Reilly explains: \"it is not about our right to own land, it is about our right to protect that land. Our right to ensure that land is looked after in a way that will ensure its healthy, sustainable existence. It is a deeply imprinted sense of connection and responsibility that Aboriginal people feel to the land and not about having land as a possession.\"\nFirst Nations poets and musicians often express their affinity with Country and associated custodial responsibility through their works:\n|align  = center\n|width  = 35%\n}}\n|align  = center\n|width  = 35%\n}}\n|align  = center\n|width  = 35%\n}}\nCustodians may be referred to by different names in the hundreds of distinct Australian Aboriginal languages. These include \"nguraritja\" in Pitjantjatjara, \"kwertengerle\" in Arrernte, \"kurdungurlu\" in Warlpiri, and \"djungkay\" in Kuninjku – although these words may refer more specifically to familial roles within traditional kinship networks that bestow a particular custodial responsibility. In the Dharug language, the related phrase \"yanama budyari gumada\" means \"walk with good spirit\".\nCustodianship and ownership\nThe distinction between traditional custodians and traditional owners is made by some, but not all, First Nations Australians. On one hand, Yuwibara man Philip Kemp states that he would \"prefer to be identified as a Traditional Custodian and not a Traditional Owner as I do not own the land but I care for the land.\" Wurundjeri man Ron Jones shared this sentiment, claiming that the words \"traditional owners\" are not typically used by Aboriginal and Torres Strait Islander peoples. In 2017, the Referendum Council received several submissions expressing a desire to have First Nations Australians recognised as traditional custodians or guardians in the preamble of the Constitution of Australia, although the Council's final report recommended prioritising a Voice to Parliament and Makarrata Commission rather than symbolic recognition of this status.\nConversely, advocates for Australian Indigenous sovereignty may prefer to emphasise their status as traditional owners rather than solely traditional custodians. Addressing the 2018 Barunga Festival, deputy chair of the Northern Land Council John Christophersen proclaimed: \"We're not custodians, we're not caretakers. We weren't looking after [the land] for somebody else to come and take away. We were the owners. And occupiers. And custodians. And caretakers.\" Wurundjeri, Yorta Yorta and Taungurung man Andrew Peters expressed the view that \"using the phrase ‘traditional owners’ indicates an Indigenous definition of ownership that has never involved monetary payments, title, or exclusive rights, but rather the recognition of thousands of years of respect, rights and responsibilities shared among many.\"\nProposals to amend the constitution to acknowledge Aboriginal and Torres Strait Islander peoples as First Peoples, whether framed as owners, custodians, or otherwise, have not been successful. The failed 1999 referendum would have added a preamble to the Constitution that included \"honouring Aborigines and Torres Strait Islanders, the nation's first people, for their deep kinship with their lands and for their ancient and continuing cultures which enrich the life of our country\"; while the failed 2023 referendum would have established a Voice to Parliament \"in recognition of Aboriginal and Torres Strait Islander peoples as the First Peoples of Australia\".\nCustodial ethic\non the laws of obligation to land and her interpretation of the custodial ethic]]\nMary Graham, a Kombu-merra and Wakka Wakka woman, developed the philosophical concept of a unique Aboriginal \"custodial ethic\". Acknowledging that different people and cultures develop different theories on the \"question of existence\", Graham posits that Aboriginal Australians identified land or nature as \"the only constant in the lives of human beings\", to such an extent that the physical and spiritual worlds were regarded as inherently interconnected. This emphasises the importance of the custodial ethic, effectively an obligatory system for people to play a role in following natural wisdom, looking after the land on which they live, and renewing its flora and fauna.\nElaborating further, Graham identifies two principles that together comprise the custodial ethic: \"1. the ethical principle of maintaining a respectful, nurturing relationship with Land, Place and community, and 2. the organising governance principle based on autonomy and identity of Place\". These two principles can complement and balance each other to permit \"a non-ego-based society\", and a unique mode of thinking expressed in the following four basic assumptions: that we are not alone in the world; that our needs are more than just physical; a deep reflective motive of long-term strategic thought; and a rejection of self-oriented survivalist thinking that ultimately normalises competitiveness.\nOther First Nations authors have adopted the concept of a custodial ethic. Wiradjuri man Glenn Loughrey suggests that it may offer a more accurate understanding of Aboriginal alternatives to the Western concepts of spirituality, justice and rights: \"In Aboriginal ways of being [these are] not needed as it is taken for granted we will care for each other, in whatever shape and form the other comes in. It can be described as the custodial ethic and is the reason there are no owners of country, only custodians.\" Noonuccal woman Samantha Cooms concurs that the custodial ethic is \"a profound concept rooted in the belief that all things are considered equal, autonomous, and protected through the wisdom of the collective\".\nThe importance of commitment to a custodial ethic has also been acknowledged by some elements of non-First Nations Australian society. The Royal Societies of Australia (a national group representing the scientific academies of New South Wales, Victoria, Queensland, Western Australia, South Australia and Tasmania) in 2021 proposed that: \"This custodianship approach has to be the foundation of our stewardship of country, with priority for support for country on ethical and pragmatic grounds (it is the right\nthing to do; we rely on it for daily living). We must be looking to the long term, thinking strategically. A society with a custodial ethic must do this.\"\nCustodianship of knowledge\nIn being responsible for Country, Aboriginal and Torres Strait Islander people's traditional custodians typically serve as custodians of accompanying systems of traditional knowledge; they bear a \"cultural imperative for protecting, maintaining and creating knowledge\". Much, but not all, of this knowledge relates to land and environmental management, including controlled burning, wildlife observation, pest control, water conservation, and erosion control.\nEuropean Australian journalist Jeff McMullen cites Gurindji stockman and land rights activist Vincent Lingiari as an example of a custodian of knowledge: \"As a senior lawman, Vincent Lingiari was drawing on his grandfatherʼs knowledge and connection to Gurindji country, reclaiming and asserting the core responsibility of custodianship. Like the very strongest Earth science, this foundational concept of the Aboriginal system of knowledge gives every man, woman and child some responsibility to help maintain the balance of the living system of life, the source of well-being for all creatures now and into the future.\"\nFirst Nations Australians' knowledge of Country, and the practices underpinning traditional custodianship, have been incorporated into some Australian education programs.\nChallenges to custodianship\nSome First Nations groups in Australia have spoken out about their struggles to receive recognition as traditional custodians within Australia's current political and legal frameworks. Traditional knowledge had historically been passed down via the oral tradition through kinship networks, and despite some progress, Aboriginal and Torres Strait Islander peoples allege that more work needs to be done to protect their custodial knowledge.\nAccording to Kamilaroi man Marcus Waters, attempts to form a broad pan-Aboriginal political community of scholars in Australian academia, even if well-intentioned, may end up sacrificing the nuance and context of the different custodial governance systems in different First Nations cultures. There is also some concern that the term \"traditional custodianship\" lacks specificity. In 2017, the Final Report of the Referendum Council noted that custodianship is one of several concepts that are currently \"legally ambiguous\".\nSee also\n*Australian Aboriginal sacred site\n*\n*Corporate environmental responsibility\n*Earth jurisprudence\n*Environmental stewardship\n*History of Indigenous Australians\n*Land ethic\n*Tangata whenua\n*Traditional ecological knowledge\nReferences"
    }
  ]
}