{
  "content": [
    {
      "type": "text",
      "text": "# First Mongol invasion of Hungary\n\nUgrin Csák Denis Tomaj  Pousa of Transylvania Benedict Osl Nicholas Szák Paul Geregye Simon Nagymartoni Rembald de Voczon\n----\nFrederick II of Austria\n----\nKöten\n| commander2 =  Batu Khan Subutai Shiban Berke Boroldai\n| units1 = Primarily light cavalryKnights TemplarCrossbowmenInfantry\n| units2 = Cavalry, predominantly horse archers and lancers Stone throwersPossibly Chinese firearm units and other gunpowder units\n| strength1 = ~30,000 soldiers (contemporary sources)Other estimations(Mohi only):80,00025,00050,000\n| strength2 = ~40,000 cavalry (contemporary sources)Other estimations(Mohi only):70,00025,00050,000\n| casualties1 = 10,000+ soldiers killed\n| casualties2 = Unknown, but heavy\n| campaignbox =\n| casus =\n}}\nThe first invasion of the Kingdom of Hungary by the Mongol Empire started in March 1241. The Mongols started to withdraw in late March 1242.\nBackground\nMongol invasion of Europe\nThe Hungarians had first learned about the Mongol threat in 1229, when King Andrew II granted asylum to some fleeing Rus' boyars. Some Magyars (Hungarians), left behind during the main migration to the Pannonian basin, still lived on the banks of the upper Volga (it is believed by some that the descendants of this group are the modern-day Bashkirs, although these people now speak a Turkic language, not Magyar). In 1237 a Dominican friar, Julianus, set off on an expedition to lead them back, and was sent back to King Béla with a letter from Batu Khan, Mongol ruler and founder of the Golden Horde. In this letter, Batu called upon the Hungarian king to surrender his kingdom unconditionally to the \"Tatar\" forces or face complete destruction. Béla did not reply, and two more messages were later delivered to Hungary. The first, in 1239, was sent by the defeated Cuman tribes, who asked for and received asylum in Hungary. The second was sent in February 1241 from Poland which was facing an invasion from another Mongol force.\nHungary's failed defence strategy\nThe military doctrine of the Hungarian kings prohibited nobles from constructing private stone castles/fortresses for their own protection within the realm during most of the high medieval era. Consequently, the building of stone castles was an exclusive royal monopoly in the Kingdom of Hungary. It was believed that privately built strongholds by landowners could ultimately lead to the strengthening of oligarchy and a decline in the royal power. Castles were only authorized to be built in strategically significant locations deemed important by the monarchs, primarily along the western border near the Holy Roman Empire. This policy proved to be successful to preserve the nearly absolute royal power in the realm, however it backfired during the Mongol attacks.\nCuman refugees\nFollowing their defeat in 1239 soon after the Mongol invasion of Rus', many Cuman-Kipchak peoples were driven from their steppes further west or south. One such tribe was that of Khan Köten. According to Rogerius, Köten led a group consisting of 40,000 familias (a Latin phrase with multiple meanings) into Hungary. Some historians interpret this as Köten's tribe consisting of 40,000 families, though as pointed out by Hungarian historian András Pálóczi-Horváth the land the Cumans were expected to settle on could only support 17,000 families, suggesting Köten led 40,000 people in total. Köten sought asylum in the nearby kingdom of Hungary; the king responded that they could do so as long as the Cumans would convert to Catholicism and acknowledge him as their overlord, providing military service.\nKöten agreed to Béla's conditions, promising to convert to Christianity and fight the Mongols (referred to as \"Tatars\" by the Hungarians). The king promptly gave them leave to settle in the plains along the Tisza River. However the Cumans, used to a nomadic and raid-based lifestyle, did not get on well with the sedentary population of Hungary. Many cases of robbery and rape were reported with Cumans as the perpetrators; Béla often refused to punish these transgressions, as he was reluctant to start a conflict with the Cumans, especially when he was already expecting a Mongol invasion. Townspeople also accused the Cumans of being agents of the Mongols.\nHungarian preparations\nInvasion\nFive separate Mongol armies invaded Hungary in 1241. The main army under Batu and Subutai crossed through the Verecke Pass. The army of Qadan and Büri crossed through the Borgói Pass. Two smaller forces under Böchek and the noyan Bogutai entered Hungary from the southeast. The army that had invaded Poland under Orda and Baidar invaded Hungary from the northwest.\nHungary\nMohi\nEsztergom\nCroatia and Dalmatia\nEvents surrounding the Mongol invasion invasion of Dalmatia were described by medieval chronicler of Split - Thomas the Archdeacon - who was also a contemporary of these events. Thomas described the atrocities committed by the Tatars against the population of Hungary. Thomas claims that after king Béla IV returned from Austria, he spent some time in Zagreb, contemplating what to do next. Thomas claims that Béla evacuated his wife and daughters along with remains of St Stephen from Szekezfehervar and send them to the littoral parts of the Kingdom. King and his entourage eventually left Zagreb and came to Split. He demanded its citizens to prepare him a boat, which they couldn't do as fast as he demanded, so Béla took refuge on an island in nearby Trogir where he also placed his court. Meanwhile, Mongols went on pursuit after king. Thomas claims that Mongols did not manage to kill much of the Slavic population as people took refuge in mountains and forests. After massacring prisoners near what is probably Srb, Mongol armies reached Split. As Mongols ravaged the town hinterland, citizens of Split prepared ballistic devices on their town walls.\nAccording to Thomas, Mongols thought that Béla resided in nearby Klis fortress, so they started attacking the fortress, but they could not inflict much damage due to Klis' strategic position on a hilltop. They therefore dismounted from their horses and climbed the steep rocks on which the fortress was built. Defenders hurled rocks on climbing Tatars, kiling several, but the attacks became even fearcer and eventually hand-to-hand combat ensued, and the Mongols started looting the fortress. The Mongols eventually realized that the Hungarian king was not in Klis, so they aborted their attacks on the fort and went towards Trogir and Split.\nThomas claims that Mongols reached the coast of Trogir and scouted the town for weakpoints. Béla meanwhile, evacuated his family on a boat he had rented and observed what would happen next. The Mongols issued several threats to Trogir citizens \"in a Slavic language\", demanding them to hand over the king. The guards gave them no response, as ordered by king Béla.\nThomas claims that Tatars then simply withdrew and spent entire month of March in their camps in Croatia and Dalmatia. On five or six occasions they came back to these towns, only to return to their camps. The Mongol armies eventually withdrew completely. Béla sent scouts who confirmed that Mongol armies withdrew completely, so he immediately returned to Hungary proper. Béla's queen and his family remained in Klis fortress until September 1249. Thomas claims that two of Béla's daughters died there and were put to rest in Cathedral of Saint Domnius in Split. In the immediate aftermath of Mongol withdrawal there was also a famine which came as a consequence of the invasion.\nMongol withdrawal\nDuring the summer and autumn of 1241, most of the Mongol forces were resting on the Hungarian Plain. In late March, 1242, they began to withdraw. The most common reason given for this withdrawal is the Great Khan Ögedei's death on December 11, 1241, which supposedly forced the Mongols to retreat to Mongolia so that the princes of the blood could be present for the election of a new great khan. This is attested to by one primary source: the chronicle of Giovanni da Pian del Carpine, who after visiting the Mongol court, stated that the Mongols withdrew for this reason; he further stated that God had caused the Great Khan's death to protect Latin Christendom.\nHowever, Rashid Al-Din, a high minister and historian of the Mongol Ilkhanate, specifically states that Batu did not know about Ogedei's death when he decided to withdraw. He states that they withdrew from Hungary to put down a Cuman rebellion, and then left Europe later in 1242 because they felt they had completed their mission, not because of the influence of any outside force. Rashid had access to the official Mongol history when writing the Ilkhanate's history (Altan Debter); additionally as historian John Andrew Boyle points out, the section where Rashid addresses the Mongol withdrawal from central Europe contains orthography that indicates he took this version of the events directly from earlier Mongol records. By Carpini's account, a messenger would have to be able to make the journey from Mongolia to Central Europe in a little over 3 months in the middle of winter. Carpini himself accompanied a Mongol party in a much shorter journey (from Kiev to Mongolia) during the summer and fall of 1246, where the party \"made great speed\" in order to reach the election ceremony in time, and made use of several horses per person while riding nearly all day and night. It took five months. The History of Yuan does not mention any particular reason for the withdrawal, but does note that Batu did not seek to attend a kurultai at all, and was only convinced to attend by Subutai in the year 1244, long after he had left Hungary.\nThe true reasons for the Mongol withdrawal are not fully known, but numerous plausible explanations exist. The Mongol invasion had bogged down into a series of costly and frustrating sieges, where they gained little loot and ran into stiff resistance. They had lost a large number of men despite their victories (see above). Finally, they were stretched thin in the European theater, and were experiencing a rebellion by the Cumans in what is now southern Russia, and the Caucasus (Batu returned to put it down, and spent roughly a year doing so). Another theory relates to Europe's weather: Hungary has a high water table and floods easily. An analysis of tree rings by modern researchers has found that Hungary had a cold wet winter in early 1242 (contributing to the famine), which likely turned Hungary's central plain into a huge swamp. Lacking pastures for their horses, the Mongols would have had to fall back to Russia in search of better grasslands.\nRegardless of their reasons, the Mongols had completely withdrawn from Central Europe by mid-1242, though they still launched military operations in the west at this time, most notably the 1241–1243 Mongol invasion of Anatolia. After the withdrawal of the Mongol troops, Subutai was reassigned by Guyuk to engage the Southern Song, and died of old age in 1248.\nAftermath\nDevastation of Hungary\nThe effects of the Mongol invasion were tremendous in the Kingdom of Hungary. The worst damage was incurred in the plains regions, where 50-80% of settlements were destroyed. The combination of massacres perpetrated by the Mongols, the famines induced by their foraging, and the simultaneous devastation of the countryside by the fleeing Cumans resulted in an estimated loss of 15–25% of Hungary's population, some 300,000–500,000 people in total. The only places that held in the face of Mongol assaults were approximately eighty fortified places, including all of the few stone castles in the kingdom. Among these places were Esztergom, Székesfehérvár, and the Pannonhalma Archabbey. However, these places were relatively few; a German chronicler in 1241 noted that Hungary \"had almost no city protected by strong walls or fortresses\", so the majority of settled areas were extremely vulnerable.\nDuring the 1241-2 Mongol invasion of Hungary, Mongol mass rapes of Hungarian women were recorded by the monk Rogerius who said they \"found pleasure\" in the act. The mass rapes of Hungarian women by the Mongols were recalled later when the Russian empire occupied Hungary in 1849 and when the Soviet army occupied Hungary in 1945.\nRogerius of Apulia's account of devastation and slaughter the Mongols wrought upon Europeans during the Mongol invasion of Hungary and Transylvania is in his book Carmen Miserabile. Denis Türje fought with Hungarian King Béla IV against the Mongols at the Battle of Mohi.\nExperts have been attempting to reconstruct the broader picture from the available fragments, which, over time, will elucidate the extent of the Mongol devastation in Hungary by region. Regarding the final assessment of the Mongol invasion, it is impossible to provide precise statistical data. The most that can be estimated is the extent of settlement destruction, from which conclusions can be drawn. The area most affected was the central, southern, and southeastern parts of the Great Hungarian Plain, where the vast majority of villages disappeared, leaving these regions depopulated. The destruction here is estimated to have been between 80-100%. Significant damage also occurred in the eastern strip of Transdanubia along the right bank of the Danube, as well as in the region between Székesfehérvár and the Danube. In the northern areas, considerable destruction can still be observed in the valleys of the Danube's left-bank tributaries. However, it appears that the northern region of Lake Balaton and the counties of Vas and Zala experienced the least devastation. The human losses are even more difficult to assess, as no comprehensive statistical records exist, and the population of Hungary at the time is not precisely known. It is also impossible to estimate the number of individuals who managed to escape from plundered villages or towns, nor how many perished. According to Hungarian medievalist József Laszlovszky, it is not far from the truth to state that, when considering the massacred, those who fell in battle, and the victims of epidemics and famine, the death toll likely numbers in the tens of thousands, or even more plausibly, in the hundreds of thousands. Taking into account the population of Hungary during that period, this suggests that the destruction was proportionally far greater than the substantial human losses incurred during World War II.\nHungarian resistance and massacres\nFor a long time, knowledge about the Mongol invasion came solely from written sources. Historians both believed and doubted the many horrors described, knowing that medieval chroniclers did not always strive for objectivity. In fact, embellishing their narratives was almost expected. However, in recent decades, more and more archaeological evidence has been unearthed, providing physical proof to support or clarify the written accounts. Since the late 1990s and early 2000s, traces of direct, widespread destruction from the Mongol invasion have begun to emerge one after another. This was largely due to the rapidly expanding highway construction projects, which pass through areas most affected by the invasion. During the archaeological excavations carried out prior to these construction projects, numerous traces of burned-down houses, human remains, and weapons were uncovered. In the past decades, it has become typical for experts to conduct targeted research based on both sources and so-called historical indicators. As a result, even more direct evidence has emerged, primarily from the Great Hungarian Plain: traces of flight, burned buildings, massacred people, and unburied dead. In some cases, unmistakable signs of cannibalism have also been found.\nOne of the most famous finds became known as a terrible memento of a family tragedy. The ruins of a half-buried house were uncovered near Cegléd, with a hearth once standing in one corner. Inside the hearth, the skeletons of two children, a boy and a girl around 10–12 years old, were found, alongside their mother’s remains: only her upper body was inside the hearth, with her legs sticking out. It is believed that during a Mongol raid, the family tried to hide, but the house was set on fire, collapsed, and buried them beneath the rubble.\nSome were overtaken by Mongol cavalry while attempting to flee, as, for example, near Szank in the Great Hungarian Plain, where many perished in a house, locked inside with their valuable jewelry. There are also findings showing that those seeking refuge in the church had the building set on fire.\nMore and more former Hungarian settlements are being uncovered where the inhabitants tried to defend themselves against the Mongols. Typically, they surrounded a more defensible location, usually near the church, with an earthen rampart. With just a few days of work, a relatively effective stronghold could be created, and the trench left by the excavated earth provided an additional advantage. In such former trenches, the remains of men are often found, surrounded by weapons, indicating they were likely the ones who fought on and behind the ramparts. Once the Mongols broke the resistance, the survivors were massacred, women, children, the elderly, everyone. Their bodies were either thrown into the rampart trench or left unburied where they were killed.\nArchaeologists have discovered the remains of young people executed with extreme cruelty, as well as a massive \"carpet\" of animal bones, during an excavation that has been ongoing for 15 years on the outskirts of Bugac in Aranymonostor. The skeletal remains of the child victims provide a tangible evidence of the destruction and mass killings carried out during the Mongol invasion of 1241–42. The Mongol soldiers executed the defenseless women and children en masse, and afterward established their headquarters in the fortified monastery. The Mongols did not feel entirely safe here, which is why they withdrew into these fortified monasteries, from where they could keep watch over the surrounding area. The remains of children executed while seated in a row or crouching indicate that Bugac was completely taken over. Archaeologists discovered \"carpet\" of animal bones, consisting of the remains of thousands of animals. The archaeozoological report highlighted that this is a very unusual finding, as the remains of both young and old animals, domestic and wild, were found in the ditch. This indicates that it was not the result of routine slaughter during peacetime, but rather an ad hoc, rapid provisioning effort, as the Mongol army had to be fed quickly.\nBased on archaeological findings, the destruction was the greatest in the central regions of the Kingdom of Hungary (Great Hungarian Plain), some areas were completely depopulated. Elsewhere, the situation was somewhat better. Recent archaeological results show that in several places, the Hungarian population took up arms to resist the overwhelming Mongol superiority. The inhabitants of individual villages fought life-and-death battles against the largest empire in the world. Archaeologists are increasingly finding evidence of these local struggles at various sites. When the people of a village took up arms, they organized their own defense and fought against the forces of the Mongol Empire. In Hungary, many of these fortifications from that time have been restored to their original condition. Those who were not killed were taken captive, the men were forced into the Mongol army and later sent to the front lines, used as \"cannon fodder\". Those who remained were decimated by famine and disease, struggling to rebuild their destroyed churches, homes, and farms. Following the conquest, epidemics and famine took hold, and the consequences of the latter were something experts had long been uncertain about, unsure whether to fully believe the historical accounts. Contemporary sources, however, report instances of cannibalism, but since these claims could not be supported by other evidence, they were considered exaggerations for a long time. Recently, however, human bones were discovered that had been deliberately scraped of flesh with sharp tools from that time.\nAccording to Hungarian medievalist József Laszlovszky, the Mongols' worldview held that all countries in the world were the property of the Great Khan, and all peoples were meant to serve him. The conquest served to turn this order into reality. Efficiency was an important consideration, which is why the appearance of the Mongols was accompanied by chilling and often entirely senseless cruelty and destruction: terror and intimidation were used to smooth the conquest process and minimize resistance. From this point on, the attacked people had two possible outcomes. If no resistance was offered, the Mongols selected and took away those who were useful to them: people with valuable skills, the learned, those who spoke various languages, and men suitable for military service. The latter were immediately conscripted into the army and used as \"cannon fodder\" in the front lines of the next battle. They also took slaves and women intended as concubines, but the others were left unharmed. The alternative was armed resistance, and according to the findings, people in several Hungarian settlements fought to the very end, even when victory or survival seemed utterly impossible. The consequence of resistance was massacre, regardless of age or gender.\nReaction from other European rulers\nWhile the king kept himself apprised of the situation in the rest of the country, he made numerous attempts to contact other rulers of Europe, including the Pope, the Holy Roman Emperor, and the King of France. None of them were willing to provide significant support to Hungary, either during or after the invasion. Pope Gregory IX called a Crusade against the Mongols, wrote to numerous German princes telling them to gather their forces, and ordered the clergy to give refuge to the Hungarian king and his subjects should they seek refuge from the Mongols. However, he warned the Hungarian king that help was unlikely to materialize as long as the Holy Roman Emperor remained belligerent and in conflict with the church.\nHis prediction was ultimately correct, as the Holy Roman Empire (HRE) took little part in fighting the Mongols, bar repelling minor scouting parties in Bohemia, Moravia, Bavaria, and Austria. Emperor Frederick II, in his warning letter to Christendom, grimly assessed the situation but also tried to use it as leverage over the Papacy. However, Frederick was well aware of the threat they posed. Even before the Pope's summons, Emperor Frederick II and his son, Conrad IV, called a Landfrieden throughout Germany. Conrad ordered the magnates to levy their armies, while Frederick II ordered them to strengthen their defenses. The states of the Holy Roman Empire intended to bog the Mongols down laying siege to thousands of castles and fortified towns and fighting thousands of small sallying forces, rather than riding out to meet the Mongols in one large field battle as the Hungarians and Poles had done. A letter written by Emperor Frederick II, found in the Regesta Imperii, dated to June 20, 1241, and intended for all his vassals in Swabia, Austria, and Bohemia, included a number of specific military instructions. His forces were to avoid engaging the Mongols in field battles, hoard all food stocks in every fortress and stronghold, and arm all possible levies as well as the general populace. Duke Frederick of Austria paid to have Austria's border castles strengthened at his own expense. In Bohemia king Wenceslaus I had every castle strengthened and provisioned, as well as providing soldiers and armaments to monasteries in order to turn them into refuges for the civilian population. In the end these preparations were unnecessary, as the Mongols never launched a full-scale invasion of the Holy Roman Empire. There were Mongol raids and sieges in the HRE border states in the aftermath of their victories in Poland and Hungary, in which Frederick's instructions seemed to have been followed, but these were minor affairs and quickly abandoned.\nThe Duke of Austria and Styria, Frederick I, took advantage of the chaos of the invasion to occupy three Hungarian counties which he then had fortified. During the second half of 1242, following the Mongol withdrawal,\nthe Hungarians mustered their remaining troops and invaded the disputed counties. They would be fought over infrequently for the next four years, until the Battle of the Leitha River, where Frederick's death resulted in the counties being ceded to Hungary.\nHungarian reforms and future raids\nWhile devastated, the kingdom of Hungary was intact. Within a year of the withdrawal of the Mongols, the three westernmost counties (Moson, Sopron, and Vas) that were extorted as ransom by Duke Frederick of Austria were recaptured, and a local uprising in Slavonia was quashed. In the decades following, the khans of the Golden Horde would repeatedly demand submission from Hungary – for example, Berke demanded once in 1259 and again in 1264 that Hungary become part of his empire and contribute its army to his planned invasion of central Europe in exchange for tax exemption and a share of the plunder – but were always ignored. The threat of another Mongol invasion, this time taken seriously, was the source of national unity and provided the impetus for Béla IV's extensive expansion of Hungarian defenses, especially the building of new stone castles (forty-four in the first ten years) and the revitalization of the army, including expanding the number of heavily armoured cavalry and knights in the royal army. Béla IV is seen now as a second founder of the nation, partly in recognition of all that was done during his reign to reconstruct and fortify the country against foreign invasion from the east. These improvements were to pay off in 1285 when Nogai Khan attempted an invasion of the country (raids along the frontier had been frequent in the intervening years, but Nogai's attack was the first major invasion since 1242). In that event, the invasion was defeated quickly, as were a number of other attacks before and after.\nSee also\n*Lament for the Destruction of Hungary by the Tartars\nNotes\nReferences\n* Cartledge, Bryan (2011). A History of Hungary. C. Hurst & Co. .\n*\n* Salagean, Tudor (2016). Transylvania in the Second Half of the Thirteenth Century: The Rise of the Congregation System. Brill.\n* Saunders, J. J. (1971). The History of the Mongol Conquests. London: Routledge & Kegan Paul.\n*\n* Sverdrup, Carl (2010). \"Numbers in Mongol Warfare\". Journal of Medieval Military History. Boydell Press. 8: 109–17 [p.&nbsp;115]. .\n*\n*"
    }
  ]
}