{
  "content": [
    {
      "type": "text",
      "text": "# First Anglo-Sikh War__disambig_1\n\nBritish Empire\n*  East India CompanySupported by:\nPatiala State  Jind State\n| combatant2        =\n| commander1        =  Sir Hugh Gough\n|  Henry Hardinge\n|  Robert Dick\n|  Harry Smith\n|  Robert Sale\n|  George Broadfoot\n|  Walter Gilbert\n|  Henry Lawrence\n}}\n| commander2        =\n| Akali Hanuman Singh\n| Sham Attariwala\n| Ranjodh Majithia\n| Raja Ajit Singh\n}}\n| casualties1       =\n| casualties2       =\n}}\nThe First Anglo-Sikh War was fought between the Sikh Empire and the British Empire from 1845 to 1846 around the Firozpur district of Punjab. It resulted in the defeat and partial subjugation of the Sikh Empire and cession of Jammu & Kashmir as a separate princely state under British suzerainty.\nBackground\nThe Sikh kingdom of Punjab was expanded and consolidated by Maharajah Ranjit Singh during the early years of the nineteenth century, about the same time as the British-controlled territories were advanced by conquest or annexation to the borders of the Punjab.\nWhen shown the map of India, Ranjit Singh said, \"What does the red colour stand for?\" The cartographer replied \"Your Majesty, red marks the extent of British possessions.\" The Maharaja scanned the map with his single eye and saw nearly the whole of Hindustan except the Punjab painted red. He turned to his courtiers and remarked  (\"one day it will all be red\"). It was said that his prophecy was going to be fulfilled.\nRanjit Singh maintained a policy of wary friendship with the British, ceding some territory south of the Sutlej, while at the same time building up his military forces both to deter aggression by the British and to wage war against the Afghans. He hired American and European mercenary soldiers to train his army, and also incorporated contingents of Hindus and Muslims into his forces.\nEvents in the Punjab\nMaharaja Ranjit Singh died in 1839. After his death, his kingdom began to fall into disorder. Ranjit's unpopular legitimate son, Kharak Singh, was removed from power within a few months, and later died in prison under mysterious circumstances. It was widely believed that he was poisoned. He was replaced by his able but estranged son Kanwar Nau Nihal Singh, who also died within a few months in suspicious circumstances, after being injured by a falling archway at the Lahore Fort while returning from his father's cremation. At the time, two major factions within the Punjab were contending for power and influence; the Sikh Sindhanwalias and the Hindu Dogras. Sher Singh was crowned Maharaja of the Sikh Empire in January 1841, with Dhian Singh Dogra as his prime minister.\nThe army expanded rapidly in the aftermath of Ranjit Singh's death, from 29,000 (with 192 guns) in 1839 to over 80,000 in 1845 as landlords and their retainers took up arms. It proclaimed itself to be the embodiment of the Sikh nation. Its regimental panchayats (committees) formed an alternative power source within the kingdom, declaring that Guru Gobind Singh's ideal of the Sikh commonwealth had been revived, with the Sikhs as a whole assuming all executive, military and civil authority in the state, which British observers decried as a \"dangerous military democracy\". British representatives and visitors in the Punjab described the regiments as preserving \"puritanical\" order internally, but also as being in a perpetual state of mutiny or rebellion against the central Durbar (court).\n'', 29 November 1845]]\nMaharajah Sher Singh was unable to meet the pay demands of the army, although he reportedly lavished funds on a degenerate court. In September 1843 he was murdered by his cousin, an officer of the army, Ajit Singh Sindhanwalia. The Dogras took their revenge on those responsible, and Jind Kaur, Ranjit Singh's youngest widow, became regent for her infant son Duleep Singh. After the vizier Hira Singh was killed, while attempting to flee the capital with loot from the royal treasury (toshkana), by troops under Sham Singh Attariwala, Jind Kaur's brother Jawahar Singh became vizier in December 1844. In 1845 he arranged the assassination of Pashaura Singh, who presented a threat to Duleep Singh. For this, he was called to account by the army. Despite attempts to bribe the army he was butchered in September 1845 in the presence of Jind Kaur and Duleep Singh.\nJind Kaur publicly vowed revenge against her brother's murderers. She remained regent. Lal Singh became vizier, and Tej Singh became commander of the army. Sikh historians have stressed that both these men were prominent in the Dogra faction. Originally Hindus from outside of Punjab, both had converted to Sikhism in 1818.\nBritish actions\nImmediately after the death of Ranjit Singh, the British East India Company (EIC) had begun increasing its military strength, particularly in the regions adjacent to the Punjab, establishing a military cantonment at Firozpur, only a few miles from the Sutlej River which marked the frontier between British-ruled India and the Sikh Empire. In 1843, the British conquered and annexed Sindh (in present-day Pakistan), located to the south of the Punjab, in a move which many British people regarded as cynical and ignoble. This did not gain the British any respect in the Punjab and instead increased suspicions of British motives.\nThe actions and attitudes of the British, under Governor-General Lord Ellenborough and his successor, Sir Henry Hardinge, are disputed. By most British accounts, their main concern was that the Sikh army, without strong leadership to restrain them, was a serious threat to British territories along the border. Sikh and Indian historians have countered that the military preparations made by these Governor-Generals were offensive in nature and were made with the intention to conquer the Punjab; for example, they prepared bridging trains (prefabricated bridges) and siege gun batteries, which would be unlikely to be required in a purely defensive operation.\nNevertheless, the unconcealed and seemingly aggressive British military build-up at the borders had the effect of increasing tension within the Punjab and the Sikh Khalsa Army.\nCombatants\nKhalsa Army\nThe army under Ranjit Singh had expanded from around 35,000 troops in the 1820s to over 100,000 by 1845. In 1822 Ranjit Singh decided to base his army on the French model and this process was complete by the time of his death in 1839.\nThe first brigade of the army was the Fauj-i-Khas (Royal Army), which contained 3,176 infantry, 1,667 cavalry and 34 guns. The brigades of the Fauj-i-ain were modelled on that of the Khas and this force had grown from 35,000 in 1838 to 70,000 by 1845 with seven divisions being created in 1844–1845 from the existing troops.\nThe Sikh cavalry, though no longer the preferred branch, remained a well-disciplined force with 6,235 cavalrymen in 1845 with 2 regiments of lancers, 2 of cuirassiers, and 6 dragoon regiments. There was also 22,000 Fauj-i-sowar which consisted of irregular cavalry deemed unsuitable for fighting an organised enemy but well-suited for chasing a routed enemy and conducting guerrilla warfare.\nThe artillery was large though unstandardised, increasing from 40 guns in 1808 to 381 by 1845, with an additional 388 swivel guns. Some of the artillery units had been organised and trained by European mercenaries. The British unwisely underestimated the Khalsa artillery prior to the outbreak of war.\nThere also existed the Jargirdar Fauj. This component of the Khalsa Army was the feudal army provided by the nobility of the state. It numbered 55,000. Gulab Singh's army in particular contained between 12,000 and 17,000 infantry and cavalry as well as 94 guns. Additionally, there were 1,000 Nihangs, religious warriors who fought primarily as mounted infantry.\nAlthough the leaders and principal units of the army were Sikhs, there were also Punjabi, Pashtun and Kashmiri infantry units. In total the Khalsa army could count on approximately 153,000 regular and irregular soldiers. It was however led by Lal Singh who, with Tej Singh, betrayed the Sikhs during the course of the war. The two generals were regularly supplying information and even receiving instructions from British officers.\nAn alternative estimate of the troops is given by Amarpal Singh who states it contained in 1845 on the eve of war 53,576 regular infantry, 6,235 regular cavalry, 16,292 irregular cavalry and 10,698 gunners this not including the tens of thousands of Jargirdari Fauj.\nBritish Army\nThe British army in India at the time generally consisted of three types: the regular units of the British Army (sometimes referred to in India as \"Queen's troops\"), who were used as the shock formations of the military in India, which in combination with disease resulted in them being almost permanently understrength; the European troops raised by the East India Company, who represented a tiny proportion of the troops present; the native Indian troops (sepoys) who formed the vast majority. Seventy-four battalions in the Bengal Army alone existed at the commencement of hostilities in addition to 8 light and lancer cavalry regiments and 18 irregular cavalry regiments. The sepoys were often used as garrisons and baggage train guards to leave the fighting to the European soldiers predominantly. In most infantry and cavalry brigades, there was usually one British unit to every three or four Bengal units. The artillery of the Bengal Army contained t brigades and 5 battalions. Most of the artillery which took part in the war consisted of light guns from the elite Bengal Horse Artillery.\nDespite an overwhelming superiority in overall numbers, the British struggled to assemble an army above 35,000 for the campaign and even at the end of the war, by the Battle of Sobraon, fewer than 20,000 soldiers were actively fighting.\nThe army was commanded by Sir Hugh Gough, the Commander in Chief of the Bengal Army, who was accompanied by Sir Henry Hardinge, the British Governor General of Bengal, who placed himself beneath Gough in the military chain of command. Gough was an aggressive commander who was unwilling to wait for reinforcements. This almost led to disaster as the Sikh army was consistently able to enter actions against the British with equal or superior numbers, even despite the open treachery of the two Sikh generals.\nOutbreak\n, leader of Sikh forces, 1846]]\nAfter mutual demands and accusations between the Sikh Durbar and the East India Company, diplomatic relations were broken. An EIC army began marching towards Firozpur, where a British division was already stationed.\n]]\nIn response to the British move, the Sikh army began crossing the Sutlej on 11 December 1845. The Sikhs claimed they were only moving into Sikh possessions (specifically the village of Moran, whose ownership was disputed between the Sikhs and the British) on the east side of the river, but the move was regarded by the British as clearly hostile and therefore they declared war.\nLadwa battles\nBattle of Wadni Fort\nAfter Raja Gurdit Singh's death, his son Ajit Singh succeeded him. Ajit Singh upgraded his fort at Ladwa to face the danger of the British. During the First Anglo-Sikh war in 1845, he fought on the side of the Sikh army against the British, where he was defeated. The Sikh defenders of Wudnee surrendered on 30 December after the Sikh defeat at Ferozeshah prevented the Sikh army reinforcing them.\nBattle of Phillaur Fort\nAjit Singh fought what would be his final battle at Phillaur Fort, designed by Dewan Mohkam Chand, with the assistance of Ranjit Singh's French and Italian generals. It was constructed as a response to the British, who built Lodi Fort in nearby Ludhiana. The fort's architecture has a distinct European character, with channels dug out along the boundary of the fort, watchtowers on the two gateways, four bastions on four nooks and high walls around the fort. The fort afforded Ajit Singh victory.\nLahore battles\nBattle of Mudki\nThe Battle of Mudki was fought on 18 December 1845. An army under Tej Singh crossed the Sutlej and advanced against the British outpost at Firozpur, although they did not attempt to attack or surround it. Another force under Lal Singh clashed with Gough's and Hardinge's advancing army at the Battle of Mudki late on 18 December. The British won an untidy encounter battle.\nBattle of Ferozeshah\n]]\nThe Battle of Ferozeshah was fought on 21 December 1845. After Mudki, Gough's army came in sight of the large Sikh entrenchment at Ferozeshah on 19 December. Gough wished to attack at once, but Hardinge used his position as Governor General to overrule him and order him to wait for the division from Firozpur to arrive. When they appeared late on 21 December, Gough attacked in the few hours of daylight left. The well-served Sikh artillery caused heavy casualties among the British, and their infantry fought desperately. On the other hand, the elite of the Sikh army, the irregular cavalry (ghodachadas), were comparatively ineffective against Gough's infantry and cavalry as they had been kept from the battlefield by Lal Singh.\nBy nightfall, some of Gough's army had fought their way into the Sikh positions, but other units had been driven back in disorder. Hardinge expected a defeat on the following day and ordered the state papers at Mudki to be burned in this event. However, on the following morning, the British and Bengal units rallied and drove the Sikhs from the rest of their fortifications. Lal Singh had made no effort to rally or reorganise his army.\nAt this point, Tej Singh's army appeared. Once again, Gough's exhausted army faced defeat and disaster, but Tej Singh inexplicably withdrew, claiming that British cavalry and artillery which were withdrawing to replenish ammunition were actually making an outflanking move.\nOperations temporarily halted, mainly because Gough's army was exhausted and required rest and reinforcements.\nBattle of Baddowal\nThe Battle of Baddowal was fought on 21 January 1846. Ranjodh Singh Majithia was the son of Desa Singh Majithia, one of the most able ministers under Maharaja Ranjit Singh. He commanded a large army, (10,000 infantry and some regular cavalry with sixty guns) and crossed the Sutlej in force and was joined by Ajit Singh of Ladwa. They marched towards Ludhiana and burned a portion of the British cantonment. Sir Harry Smith, who was sent to relieve Ludhiana, marched eastwards from Firozpur, keeping a few miles away from the Sutlej.\nOn learning of the strength of the Sikh forces, and receiving further orders from Gough, Smith instead force-marched his troops via Jagraon, collecting a British regiment there, to reach Ludhiana ahead of the Sikh main body. On 21 January, as he left Baddowal, the Sikh irregular cavalry (Gorchurras) continually attacked his rearguards. They captured most of Smith's baggage animals (mules, bullocks and elephants), and cut down any straggling troops. Nevertheless, Smith succeeded in reaching Ludhiana, with his troops exhausted. A brigade of troops from Delhi, including two Gurkha battalions, reinforced him.\nBattle of Aliwal\nThe Battle of Aliwal was fought on 28 January 1846. After resting his troops, Smith once again advanced to Baddowal. The Sikhs had withdrawn to Aliwal on the Sutlej, awaiting reinforcements. On 28 January, Smith advanced against them, cautiously at first. Finding a weak point in the Sikh position, he won a model victory which eliminated the Sikh bridgehead and captured almost all of Ranjur Singh's artillery and his army's baggage and equipment.\nBattle of Sobraon\nThe Battle of Sobraon was fought on 10 February 1846. The Sikhs had been temporarily dismayed by their defeats and by their commanders' inaction, but rallied when fresh units and leaders, including Sham Singh Attariwala, joined them, and Maharani Jind Kaur exhorted 500 selected officers to make renewed efforts.\nGough had intended to attack the Sikh army in its entrenchments at Sobraon as soon as Smith's division rejoined from Ludhiana, but Hardinge forced him to wait until a heavy artillery train of the Bengal Army had arrived. At last, he moved forward early on 10 February. The start of the battle was delayed by heavy fog, but as it lifted, 35 British heavy guns and howitzers opened fire. The Sikh cannons replied. The bombardment went on for two hours without much effect on the Sikh defences. During the battle, Gough was told that his heavy guns were running short of ammunition and is alleged to have replied, \"Thank God! Then I'll be at them with the bayonet.\"\nTwo British divisions under Harry Smith and Major General Sir Walter Gilbert made feint attacks on the Sikh left, while another division under Major General Robert Henry Dick made the main attack on the Sikh right, where the defences were of soft sand and were lower and weaker than the rest of the line. (It is believed that Lal Singh had supplied this information to Major Henry Lawrence, the Political Agent at Gough's headquarters.) Nevertheless, Dick's division was driven back by Sikh counter-attacks after initially gaining footholds within the Sikh lines, Dick himself was killed. As the British fell back, some frenzied Sikh soldiers attacked British wounded left in the ditch in front of the entrenchments, enraging the British soldiers.\nThe British, Gurkhas and Bengal regiments renewed their attacks along the entire front of the entrenchment, and broke through at several points. On the vulnerable Sikh right, engineers blew a breach in the fortifications and British cavalry and horse artillery pushed through it to engage the Sikhs in the centre of their position. Tej Singh had left the battlefield early. It is alleged in many Sikh accounts that he deliberately weakened the pontoon bridge, casting loose the boat at its centre, or that he ordered his own artillery on the west bank to fire on the bridge on the pretext of preventing British pursuit. British accounts claim that the bridge simply broke under the weight of the numbers of soldiers trying to retreat across it, having been weakened by the swollen river. Whichever account is correct, the bridge broke, trapping nearly 20,000 of the Sikh Army on the east bank.\nNone of the trapped Sikh soldiers attempted to surrender. Many detachments, including one led by Sham Singh Attariwala, fought to the death. Some Sikhs rushed forward to attack the British regiments sword in hand; others tried to ford or swim the river. British horse artillery lined the bank of the river and continued to fire into the Sikh crowds in the water. By the time the firing ceased, the Sikhs had lost between 8,000 and 10,000 men. The British had also captured 67 guns.\n, 10 February 1846]]\nKangra battles\nSiege of Kangra Fort\nThis siege of Kangra Fort lasted from mid-April until 28 May 1846. Lawrence reached the fort on 3 May 1846. This was the only battle fought between the Sikh forces of Kangra and the British. The British controlled the valley after defeating them and the fort.\nMohali battles\nBattle of Sohana\nAkali Hanuman Singh along with 500 troops were heading for Ghuram when they were attacked near Sohana by the British. The British defeated this force and Hanuman Singh was killed in action at age 90.\nAftermath\nentering his palace in Lahore, while escorted by British troops]]\nIn the Treaty of Lahore on 9 March 1846, the Sikhs were made to surrender the valuable region (the Jullundur Doab) between the Beas and Sutlej rivers. The Lahore Durbar was also required to pay an indemnity of 15&nbsp;million rupees. Because it could not readily raise this sum, it ceded Kashmir, Hazarah and all the forts, territories, rights and interests in the hill countries situated between the Rivers Beas and Indus to the East India Company, as equivalent to 10&nbsp;million rupees. In a later separate arrangement (the Treaty of Amritsar), the Raja of Jammu, Gulab Singh, purchased Kashmir from the EIC for a payment of 7.5&nbsp;million rupees and was granted the title Maharaja of Jammu and Kashmir. After the conclusion of the war, the areas of the following districts were annexed by the British: Ambala, Firozpur, Hoshiarpur, Jalandhar, Kangra, and Ludhiana districts.\nThe estate of Ladwa, belonging to Ajit Singh who had fought against the British at Buddowal and Aliwal, was confiscated in 1846. \"The Raja of Ladwa, with an estate of 10,000 pounds a year, almost openly avowed his treason, and, after a time, went over to the enemy with all his troops and artillery\", reads the Dispatch of the Governor General, sent to London on 17 November 1846. On 22 September 1847, through a sanad, the British awarded his house at Haridwar to the Raja of Patiala. Ajit Singh was taken into custody and sent as a prisoner to the Allahabad fort. He contrived to escape, after killing his keeper, and after long wanderings in hills, is supposed to have died in Kashmir. His children, who held in joint tenure eight villages along with Bhadour sardars, were dispatched by the British to these villages.\n– arrival of the captured Sikh guns]]\n]]\nMaharaja Duleep Singh remained ruler of the Punjab and at first his mother, Maharani Jindan Kaur, remained as Regent. However, the Durbar later requested that the British presence remain until the Maharaja attained the age of 16. The British consented to this and on 16 December 1846, the Treaty of Bhyroval provided for the Maharani to be awarded a pension of 150,000 rupees and be replaced by a British resident in Lahore supported by a Council of Regency, with agents in other cities and regions. This effectively gave the East India Company control of the government.\nSikh historians have always maintained that, in order to retain their hold on power and maintain the figurehead rule of Duleep Singh, Lal Singh and Tej Singh embarked on the war with the deliberate intent of breaking their own army. In particular, Lal Singh was corresponding with a British political officer and betraying state and military secrets throughout the war. Lal Singh's and Tej Singh's desertion of their armies and refusal to attack when opportunity offered seem inexplicable otherwise.\nThe Sikh empire was until then one of the few remaining states in India after the rise of the East India Company and the fall of the Mughal empire. Although the Sikh Army was weakened by the war, resentment at British interference in the government led to the Second Anglo-Sikh War within three years.\nSee also\n* First Anglo-Sikh War Memorial\nReferences\nCitations\nWorks cited\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\nExternal links\n* [https://www.worldhistory.org/First_Anglo-Sikh_War/ World History Encyclopedia – First Anglo-Sikh War]\n* [http://www.sikhlionz.com/anglosikhwar1.htm First Anglo-Sikh War]\n* [https://web.archive.org/web/20081120162429/http://www.searchsikhism.com/anglo.html Anglo-Sikh Wars]"
    }
  ]
}