{
  "content": [
    {
      "type": "text",
      "text": "# First Battle of Sirte__disambig_1\n\nBattle of Sirte}}\n| result            = Inconclusive\n| combatant1        =      Netherlands\n| combatant2        =\n| commander1        =  Andrew Cunningham Philip Vian\n| commander2        =  Angelo Iachino Guido Porzio Giovanola\n| strength1         = 5 light cruisers  14 destroyers\n| strength2         = 4 battleships  2 heavy cruisers  3 light cruisers  13 destroyers\n| casualties1       = 1 killed  2 destroyers damaged\n| casualties2       = None\n| campaignbox       =\n}}\nThe First Battle of Sirte was fought between forces of the British Mediterranean Fleet and the  (Italian Royal Navy) during the Battle of the Mediterranean in the Second World War. The engagement took place on 17 December 1941, south-east of Malta, in the Gulf of Sirte. The engagement was inconclusive as both forces were protecting convoys and wished to avoid battle.\nIn the following days, two Royal Navy forces based at Malta ran into Italian minefield T off Tripoli and two British battleships were disabled by Italian Human torpedo during the Raid on Alexandria. By the end of December, the balance of naval power in the Mediterranean had shifted in favour of the .\nBackground\nThe British Eighth Army and the Axis armies in North Africa were engaged in battles resulting from Operation Crusader, which had been fought between 18 November and 4 December. Its aim was to defeat the Afrika Korps and relieve the siege of Tobruk. This had been achieved and Axis forces were conducting a fighting retreat; by 13 December, they were holding a defensive line at Gazala, east of Benghazi. The Axis were desperate to supply their forces, intending to transport stores to Tripoli, their main port in Libya and Benghazi, the port closest to the front line. The island garrison of Malta was under siege and the British wanted to supply their forces on the island.\nPrelude\nConvoy M41/M42\nThe Italians were preparing to send Convoy M41, of eight ships, to Africa on 13 December 1941. That morning, their previous supply attempt, two fast cruisers carrying fuel to Tripoli, had failed when they were sunk at the Battle of Cape Bon by a force of destroyers en route to Alexandria. The eight merchant ships were in three groups, with a close escort of five destroyers and a distant cover force of the battleships  and , four destroyers and two torpedo boats. Soon after sailing on 13 December, a group of Convoy M41 was attacked by the British submarine  and two ships were sunk; later that day two ships collided and had to return to base, while the distant cover force was sighted by the submarine  and Vittorio Veneto was torpedoed and forced to return to port.\nSupermarina, the high command of the Italian navy, rattled by these losses and a report that a British force of two battleships was at sea, ordered the ships to return to await reinforcement but the \"force of two battleships\" was a decoy operation by the minelayer . On 16 December, the four-ship Italian convoy, renamed Convoy M42, left Taranto, picking up escorts along the way. The close escort was provided by seven destroyers and a torpedo boat; by the time they reached Sicily they were also accompanied by a close cover force, comprising the battleship , three light cruisers and three destroyers. The distant covering force consisted of the battleships Littorio,  and , two cruisers and 10 destroyers.\nAllied convoy\nThe British planned to run supplies to Malta using the fast merchant ship Breconshire, covered by a force of cruisers and destroyers, while the destroyers from the Cape Bon engagement would proceed to Alexandria from Malta covered by Force K and Force B from Malta on 15 December. The British force was depleted when the light cruiser  was torpedoed and sunk by , just before midnight on 14 December. U-557 was accidentally sunk less than 48 hours later, by the Italian torpedo boat Orione. On 15 December, Breconshire sailed from Alexandria escorted by three cruisers and eight destroyers under Rear-Admiral Philip Vian in . On 16 December, the four destroyers of 4th Flotilla (Commander G. Stokes in ) left Malta, covered by Force K (Captain William 'Bill' Agnew in ), two cruisers and two destroyers. Thirty Italian warships were escorting four cargo ships. The two British groups were also at sea and steaming toward each other; the opposing forces were likely to cross each other's tracks east of Malta on 18 December.\nBattle\nOn 17 December, an Italian reconnaissance aircraft spotted the British westbound formation near Sidi Barrani, apparently proceeding from Alexandria to intercept the Italian convoy. The British convoy was shadowed by Axis aeroplanes and attacked during the afternoon but no hits were scored and Agnew and Stokes met the westbound convoy. By late afternoon the Italian fleet was close by and spotter planes from the battleships had made contact with the British convoy, but the planes misidentified Breconshire as a battleship. At 17:42, the fleets sighted each other; Admiral Angelo Iachino—commander of the Italian forces—moved to intercept to defend his convoy.\nVian also wished to avoid combat, so with the British giving ground and the Italians pursuing with caution, the British were easily able to avoid an engagement. Just after sunset, an air attack on the British ships caused them to return fire with their anti-aircraft guns, allowing the Italian naval force to spot them. Iachino took in the distant covering force and opened fire at about , well out of range of the British guns. Vian immediately laid smoke and moved to the attack while Breconshire moved away, escorted by the destroyers  and .\nLacking radar and mindful of their defeat in the night action at the Battle of Cape Matapan, the Italians wished to avoid a night engagement. The Italians fired for only 15 minutes before disengaging and returning westwards to cover convoy M42.  suffered the loss of one midshipman and some damage due to a near-miss either from an  shell, possibly fired by the Italian cruiser  or as stated by British official reports by  shell splinters from Andrea Doria and Giulio Cesare, that knocked down wireless aerials and holed the hull, superstructure and ship's boats. According to Italian sources, the Royal Australian Navy (RAN) destroyer  was also damaged by near-misses from the . British reports tell of other warships punctured by splinters.\nAftermath\nMinefield T\nAfter dark, Vian turned to return with Stokes to Alexandria, leaving Agnew to bring Breconshire to Malta, joined by Force B, one cruiser (the other was under repair) and two destroyers. Breconshire and her escorts arrived in Malta at 15:00 on 18 December. At midday, the Italian force also split up and three ships headed for Tripoli, accompanied by the close cover force, while the German supply ship Ankara, headed for Benghazi. The distant cover force remained on station in the Gulf of Sidra until evening, before heading back to base. The British had now realised that the Italians had a convoy in the area; Vian searched for it without success as he returned to Alexandria.\nIn the afternoon, the position of the Tripoli group was established; a cruiser and two destroyers of Force B and two cruisers and two destroyers of Force K (Captain O'Conor, on the cruiser ) sortied from Malta at 18:00 to intercept. The force ran into a minefield (Minefield T)  off Tripoli, in the early hours of 19 December. The minefield took the British by surprise as the water-depth was , which they had thought was too deep for mines. Neptune struck four mines and sank, the destroyer  struck a mine and was scuttled the following day. The cruisers Aurora and  were badly damaged but were able to return to Malta. About 830 Allied seamen, many of them New Zealanders from Neptune, were killed. The Malta Strike Force, which had been such a threat to Axis shipping to Libya during most of 1941, was much reduced in its effectiveness and was later forced to withdraw to Gibraltar.\nAttack on Alexandria\nWhile steaming back to Alexandria along with Vian's force, destroyer  reported an apparently successful depth-charge attack on an unidentified submarine. The only axis submarine off Alexandria was the Italian , which was carrying a group of six Italian frogmen commandos, including Luigi Durand De La Penne, equipped with manned torpedoes. Shortly after Vian's force arrived in Alexandria, on the night of 18 December, the Italians penetrated the harbour and attacked the fleet. Jervis was damaged, a large Norwegian tanker disabled and the battleships  and  were severely damaged. This was a strategic change of fortune against the Allies whose effects were felt in the Mediterranean for several months.\nResults\nBoth sides achieved their strategic objectives; the British got supplies through to Malta and the Axis got their ships through to Tripoli and Benghazi, although Benghazi fell to the Eighth Army five days later, on 24 December.\nOrder of battle\nForces present 17 December 1941\nItaly\nAdmiral Angelo Iachino (on Littorio)\n* Close covering force – Vice Admiral Raffaele de Courten (on ''Duca d'Aosta)\n** One battleship:\n** Three light cruisers (7a Divisione Incrociatori): , ,\n** Three destroyers, , , and\n* Distant covering force – Vice Admiral Angelo Parona (on Gorizia)\n** Three battleships: ,  and\n** Two heavy cruisers:  , and\n** 10 destroyers, ,  (9a Squadriglia Cacciatorpediniere)\n:: (10a Squadriglia Cacciatorpediniere)\n::,  (12a Squadriglia Cacciatorpediniere)\n::, , ,  (13a Squadriglia Cacciatorpediniere)\n:: (16a Squadriglia Cacciatorpediniere)\n* Close escort:\n** Six destroyers:  (7a Squadriglia Cacciatorpediniere)\n::,  (14a Squadriglia Cacciatorpediniere)\n::,  (15a Squadriglia Cacciatorpediniere)\n:: (16a Squadriglia Cacciatorpediniere)\n*\n* Convoy M42\n** motorships Monginevro, Napoli, Vettor Pisani\n** freighter Ankara (German)\nAllies\n* Convoy Escort – Rear-Admiral Philip Vian (on Naiad)\n** Three light cruisers: , ,\n** Eight destroyers, , , ,  (damaged),  (damaged), ,  and  (14th Destroyer Flotilla)\n* Convoy\n** Fast merchantman: Breconshire''\n* Force K\n** Two light cruisers: ,\n** Two destroyers ,\n* Force B\n** One cruiser:\n** Two destroyers: ,\n* 4th Destroyer Flotilla\n** Four destroyers, , , ,\nSee also\n* Second Battle of Sirte\nNotes\nReferences\n*\n*\n*\n*\n*\n*\n*\n*\n*\nFurther reading\n*\n*\n*\n*\nExternal links\n* [https://web.archive.org/web/20090912020612/http://www.regiamarinaitaliana.it/Sirte1.html La I Battaglia della Sirte]\n* [http://digilander.libero.it/planciacomando/WW2/primasirte1.htm Prima battaglia della Sirte] – Plancia di Commando\n* [https://www.regiamarina.net/ The Italian Navy in World War II]"
    }
  ]
}