{
  "content": [
    {
      "type": "text",
      "text": "# First-fit bin packing\n\nFirst-fit (FF) is an online algorithm for bin packing. Its input is a list of items of different sizes. Its output is a packing - a partition of the items into bins of fixed capacity, such that the sum of sizes of items in each bin is at most the capacity. Ideally, we would like to use as few bins as possible, but minimizing the number of bins is an NP-hard problem. The first-fit algorithm uses the following heuristic:\n* It keeps a list of open bins, which is initially empty.\n* When an item arrives, find the first bin into which the item can fit, if any.\n** If such a bin is found, the new item is placed inside it.\n** Otherwise, a new bin is opened and the coming item is placed inside it.\nApproximation ratio\nDenote by FF(L) the number of bins used by First-Fit, and by OPT(L) the optimal number of bins possible for the list L. The analysis of FF(L) was done in several steps.\n* The first upper bound of FF(L) \\leq 1.7\\mathrm{OPT}+3 for FF was proven by Ullman in 1971.\n* In 1972, this upper bound was improved to FF(L) \\leq 1.7\\mathrm{OPT}+2 by Garey, Graham and Ullman, Johnson and Demers.\n* In 1976, it was improved by Garey, Graham, Johnson, Yao and Chi-Chih to FF(L) \\leq \\lceil 1.7\\mathrm{OPT}\\rceil, which is equivalent to FF(L) \\leq 1.7\\mathrm{OPT}+0.9 due to the integrality of FF(L) and \\mathrm{OPT}.\n* The next improvement, by Xia and Tan  in 2010,  lowered the bound to FF(L) \\leq 1.7\\mathrm{OPT}+0.7.\n* Finally, in 2013, this bound was improved to FF(L) \\leq \\lfloor 1.7\\mathrm{OPT}\\rfloor by Dósa and Sgall. They also present an example input list L, for which FF(L) matches this bound.\nBelow we explain the proof idea.\nAsymptotic ratio at most 2\nHere is a proof that the asymptotic ratio is at most 2. If there is an FF bin with sum less than 1/2, then the size of all remaining items is more than 1/2, so the sum of all following bins is more than 1/2. Therefore, all FF bins except at most one have sum at least 1/2. All optimal bins have sum at most 1, so the sum of all sizes is at most OPT. Therefore, number of FF bins is at most 1+OPT/(1/2) = 2*OPT+1\nAsymptotic ratio at most 1.75\nConsider first a special case in which all item sizes are at most 1/2. If there is an FF bin with sum less than 2/3, then the size of all remaining items is more than 1/3. Since the sizes are at most 1/2, all following bins (except maybe the last one) have at least two items, and sum larger than 2/3. Therefore, all FF bins except at most one have sum at least 2/3, and the number of FF bins is at most 2+OPT/(2/3) = 3/2*OPT+1.\nThe \"problematic\" items are those with size larger than 1/2. So, to improve the analysis, let's give every item larger than 1/2 a bonus of R. Define the weight of an item as its size plus its bonus. Define the weight of a set of items as the sum of weights of its contents.\nNow, the weight of each FF bin with one item (except at most one) is at least 1/2+R, and the weight of each FF bin with two or more items (except at most one) is 2/3. Taking R=1/6 yields that the weight of all FF bins is at least 2/3.\nOn the other hand, the weight of every bin in the optimal packing is at most 1+R = 7/6, since each such bin has at most one item larger than 1/2. Therefore, the total weight of all items is at most 7/6*OPT, and the number of FF bins is at most 2+(7/6*OPT/(2/3)) = 7/4*OPT+2.\nAsymptotic ratio at most 1.7\nThe following proof is adapted from. Define the weight of an input item as the item size x some bonus computed as follows:\nbonus(x) := \\begin{cases}\n0 & x \\leq 1/6\n\\\\\nx/2-1/12 & 1/6\nweight(x) := x + bonus(x).\nThe asymptotic approximation ratio follows from two claims:\n# In the optimal packing, the weight of each bin is at most 17/12;\n# In the First-Fit packing, the average weight of each bin is at least 5/6 = 10/12.\nTherefore, asymptotically, the number of bins in the FF packing must be at most 17/10 * OPT.\nFor claim 1, it is sufficient to prove that, for any set B with sum at most 1, bonus(B) is at most 5/12. Indeed:\n* If B has no item larger than 1/2, then it has at most five items larger than 1/6, and the bonus of each of them is at most 1/12;\n* If B has an item larger than 1/2 but no item in [1/3,1/2], then it has room for at most two items in (1/6,1/3), and the sum of their bonuses is at most (1/2 / 2 - 1/6) = 1/12, so the total bonus is 4/12+1/12=5/12.\n* If B has an item larger than 1/2 and an item in [1/3,1/2], then it has no more room for items of size larger than 1/6, so the total bonus is again 4/12+1/12 = 5/12.\nTherefore, the weight of B is at most 1+5/12 = 17/12.\nFor claim 2, consider first an FF bin B with a single item.\n* If sum(B)1/2. For all these bins, weight(B)>1/2+1/3 = 5/6.\nConsider now the FF bins B with two or more items.\n* If sum(B)2/3. Denote them by B[1],B[2],...B[k], by the order they are opened. For each i in 1,...,k, we prove that the sum of B[i] plus the bonus of B[i+1] is at least 5/6: sum(B[i])+bonus(B[i+1]) ≥ 5/6. Indeed, if sum(B[i]) ≥ 5/6 then the inequality is trivial. Otherwise, let sum(B[i]) := 1 - x. Note that x is between 1/6 and 2/6, since sum(B[i]) is between 2/3 and 5/6. Since B[i+1] is opened after B[i], B[i+1] contains at least two items, say c1 and c2, that do not fit into B[i], that is:   c1,c2 > 1-sum(B[i]) = x > 1/6. Then the bonus of each of c1 and c2 is at least x/2 - 1/12. Therefore, the bonus of B[i+1] is at least x-1/6, so sum(B[i]) + bonus(B[i+1]) ≥ (1-x)+(x-1/6) = 5/6.\n* We can apply the above inequality to successive pairs, and get: sum(B[1]) + bonus(B[2]) + sum(B[2]) + bonus(B[3]) + ... + sum(B[k-1]) + bonus(B[k]) ≥ 5/6*(k-1).\nTherefore, the total weight of all FF bins is at least 5/6*(FF - 3) (where we subtract 3 for the single one-item bin with sum present a tighter analysis that gets rid of the 3, and get that FF ≤ 17/10*OPT.\nLower bound\nThere are instances on which the performance bound of 1.7OPT is tight. The following example is based on. The bin capacity is 101, and:\n* The sequence is:  6 (x7), 10 (x7), 16 (x3), 34 (x10), 51 (x10).\n* The optimal packing contains 10 bins: [51+34+16] (x3), [51+34+10+6] (x7). All bin sums are 101.\n* The First Fit packing contains 17 bins: [6 (x7) + 10 (x5)], [10 (x2) + 16 (x3)], [34+34] (x5), [51] (x10).\n** The bin sums are: 92, 68, 68 (x5), 51 (x10).\n** The rewards (normalized to 101) are 0, 0, 16.8 (x5), 33.7 (x10).\n** The total weights (normalized to 101) are 92, 68, 84.8 (x5), 84.7 (x10). It can be seen that almost all weights are close to 101*5/6=84.1.\nPerformance with divisible item sizes\nAn important special case of bin-packing is that which the item sizes form a divisible sequence (also called factored). A special case of divisible item sizes occurs in memory allocation in computer systems, where the item sizes are all powers of 2. If the item sizes are divisible, and in addition, the largest item sizes divides the bin size, then FF always finds an optimal packing.\nRefined first-fit\nRefined-First-Fit (RFF) is another online algorithm for bin packing, that improves on the previously developed FF algorithm. It was presented by Andrew Chi-Chih Yao.\nThe algorithm\nThe items are categorized in four classes, according to their sizes (where the bin capacity is 1):\n* A-piece - size in (1/2,1].\n* B_1-piece - size in (2/5,1/2].\n* B_2-piece - size in (1/3,2/5].\n* X-piece - size in (0,1/3].\nSimilarly, the bins are categorized into four classes: 1, 2, 3 and 4.\nLet m \\in \\{6,7,8,9\\} be a fixed integer.  The next item i \\in L is assigned into a bin in -\n* Class 1, if i is an A-piece,\n* Class 2, if i is an B_1-piece,\n* Class 3, if i is an B_2-piece, but not the (mk)th B_2-piece seen so far, for any integer k \\geq 1.\n* Class 1, if i is the (mk)th B_2-piece seen so far,\n* Class 4, if i is an X-piece.\nOnce the class of the item is selected, it is placed inside bins of that class using first-fit bin packing.\nNote that RFF is not an Any-Fit algorithm since it may open a new bin despite the fact that the current item fits inside an open bin (from another class).\nApproximation ratio\nRFF has an approximation guarantee of RFF(L) \\leq (5/3) \\cdot \\mathrm{OPT}(L) +5 . There exists a family of lists L_k with RFF(L_k) = (5/3)\\mathrm{OPT}(L_k) +1/3 for \\mathrm{OPT}(L) = 6k+1.\nSee also\n* First-Fit-Decreasing (FFD) is the offline variant of First-Fit: it accepts all input items, orders them by descending size, and calls First-Fit. Its asymptotic approximation ratio is much better: about 1.222 instead of 1.7.\nImplementations\n* Python: The [https://github.com/erelsgl/prtpy prtpy package] contains [https://github.com/erelsgl/prtpy/blob/main/prtpy/packing/first_fit.py an implementation of first-fit].\nReferences"
    }
  ]
}