{
  "content": [
    {
      "type": "text",
      "text": "# First Barons' War__disambig_1\n\n| combatant3        =\n| commander1        =\n* Hubert de Burgh\n* William Longespée\n* Ranulf de Blondeville\n* Peter des Roches\n* William de Ferrers\n* William Marshal (from March 1217)}}\n| commander2        =\n* Eustace the Monk}}\n| commander3        =\n| strength1         =\n| strength2         =\n| strength3         =\n| casualties1       =\n| casualties2       =\n| casualties3       =\n| notes             =\n| campaignbox       =\n}}\nThe '''First Barons' War''' (1215–1217) was a civil war in the Kingdom of England in which a group of rebellious major landowners (commonly referred to as barons) led by Robert Fitzwalter waged war against King John. The conflict resulted from King John's disastrous wars against King Philip II of France which led to the collapse of the Angevin Empire, and John's subsequent refusal to accept and abide by Magna Carta, which John had sealed on 15 June 1215.\nThe rebellious barons, faced with an uncompromising king, turned to King Philip's son Louis, who in 1216 sailed to England with an army despite his father's and the pope's disapprovals. Louis captured Winchester and soon controlled over half of the English kingdom. He was proclaimed \"King of England\" in London by the barons, although he was never actually crowned.\nLouis's ambitions of ruling England faced a major setback in October 1216, when John's death led to the rebellious barons deserting Louis in favour of John's nine-year-old son Henry III, and the war dragged on. Louis's army was finally beaten at the Battle of Lincoln on 20 May 1217. After a fleet assembled by his wife Blanche of Castile attempted to bring him French reinforcements but was defeated off the coast of England on 24 August 1217, he was forced to make peace on English terms. He signed the Treaty of Lambeth and surrendered the few remaining castles that he held. The treaty had the effect of Louis agreeing he had never been the legitimate king of England. That formalised the end of the civil war and the departure of the French from England.\nBackground\nOn 15 June 1215 King John was forced to put his seal to \"The Articles of the Barons\" by a group of powerful barons who were no longer willing to tolerate John's failed leadership and despotic rule. In exchange, the barons renewed their fealty to John on 19 July. A formal document to record the agreement was drafted by the royal chancery on 15 July; this was the original Magna Carta. \"The law of the land\" is one of the great watchwords of Magna Carta by standing in opposition to the king's mere will.\nMagna Carta holds clauses that theoretically noticeably reduce the authority of the king, such as Clause 61, the \"security clause\", which allows a group of 25 barons to override the king at any time by means of force, a medieval legal process known as distraint that was normal in feudal relationships, albeit had never been applicated towards a king. After numerous months of half-hearted attempts to reach a settlement in the summer of 1215, open conflict was unleashed amongst the rebel barons' alliance and the loyalist factions of the Kingdom of England.\nCourse of events\nFrench intervention\nThe war began over Magna Carta but quickly turned into a dynastic war for the throne of England. The rebel barons, faced with a powerful king, turned to Louis, the son and heir apparent of King Philip II of France and the grandson-in-law of King Henry II of England. The Norman Conquest had occurred 149 years before, and the relationship between England and France was not as simply adversarial as it later became. The contemporary document the Annals of Waverley saw no contradiction in stating that Louis was invited to invade to \"prevent the realm being pillaged by aliens.\"\nIn November 1215 Louis sent the barons a contingent of knights to protect London. However, even at that stage he also agreed to an open invasion, despite the discouragement from his father and from Pope Innocent III. That came in May 1216, when watchmen on the coast of Thanet detected sails on the horizon, and on the next day John and his armies saw Louis's troops disembark on the coast of Kent.\nJohn decided to escape to Winchester, and so Louis had little resistance on his march to London. He entered London, also with little resistance, and was openly received by the rebel barons and citizens of London and was proclaimed (though not crowned) king at St Paul's Cathedral. Many nobles gathered to give homage to him, including Alexander II of Scotland, who held fiefs in England. Many of John's supporters, sensing a tide of change, moved to support the barons. Gerald of Wales remarked: \"The madness of slavery is over, the time of liberty has been granted, English necks are free from the yoke.\"\nPursuing John, Louis led his army south from London on 6 June, arriving the following day in Reigate where he found the castle abandoned. He moved onwards to Guildford Castle on 8 June, which surrendered immediately. Farnham Castle initially closed its gates but surrendered as the French started to lay siege. He met resistance only when he reached Winchester Castle on 14 June, but it fell after a ten-day siege. Louis's campaign continued, and by July about a third of England had fallen under his control.\nFirst siege of Dover\nIn the meantime, Philip taunted Louis for trying to conquer England without first seizing its key port at Dover. The royal castles at Canterbury and Rochester, their towns, and indeed, most of Kent had already fallen to Louis. However, when he moved on to Dover Castle on 25 July, it was prepared. Its constable, Hubert de Burgh, had a well-supplied garrison of men.\nThe first siege began on 19 July, with Louis taking the high ground to the north of the castle. His men successfully undermined the barbican and attempted to topple the castle gate, but de Burgh's men managed to repel the invaders, blocking the breach in the walls with giant timbers. (After the siege the weak northern gate was blocked and tunnels were built in that area, to St John's Tower, and the new Constable's Gate and Fitzwilliam's Gate.)\nIn the meantime, Louis's occupation of Kent was being undermined by a guerrilla force of Wealden archers raised and led by William of Cassingham. After three months spent besieging the castle and a large part of his forces being diverted by the siege, Louis called a truce on 14 October and returned to London.\nSieges of Windsor and Rochester\nApart from Dover, the only castle to hold out against Louis was Windsor Castle, where 60 loyalist knights survived a two-month siege, despite severe damage to the structure of its lower ward. That was immediately repaired in 1216 by Henry III, who further strengthened the defences with the construction of the western curtain wall, much of which survives today. The damage was caused possibly by the castle having been besieged by the barons in 1189, less than 30 years earlier.\nIn 1206 John had spent £115 money.}} on repairs to Rochester Castle, and he had even pre-emptively held it during the year of the negotiations leading up to Magna Carta, but the charter's terms had forced him to hand it back into the custody of Stephen Langton, Archbishop of Canterbury, in May 1215. The rebel barons had then sent troops under William d'Aubigny to the castle, to whom its constable Reginald de Cornhill opened the castle's gates. Thus, during October 1215 on his marching from Dover to London, John found Rochester in his way and on 11 October began besieging it in person.\n.]]\nThe rebels were expecting reinforcements from London, but John sent fire ships out to burn the bridge over the Medway to stall the advance. Robert Fitzwalter rode out to stop the king and fought his way onto the bridge but was eventually beaten back into the castle. John also sacked Rochester Cathedral, took anything of value and stabled his horses in it, all as a slight to Langton. Orders were then sent to the men of Canterbury.\nFive siege engines were erected, and work was carried out to undermine the curtain wall. John's forces entered and held the bailey in early November and began attempting the same tactics against the keep, including undermining the south-eastern tower. The mine-roof was supported by wooden props, which were then set alight using pig fat. On 25 November John had sent a writ to the justiciars saying, \"Send to us with all speed by day and night, forty of the fattest pigs of the sort least good for eating so that we may bring fire beneath the castle\". The fire caused one entire corner of the keep to collapse. The rebels withdrew behind the keep's cross-wall but still managed to hold out. A few were allowed to leave the castle but on John's orders had their hands and feet lopped off as an example.\nThe castle was taken on 30 November 1215 by starvation and not by force. John set up a memorial to the pigs and a gallows with the intention of hanging the whole garrison, but one of his captains, Savari de Mauléon, persuaded him not to hang the rebels since hanging those who had surrendered would set a precedent if John ever surrendered; only one man was hanged (a young bowman who had previously been in John's service). The remainder of the rebel barons were taken away and imprisoned at various royal-held castles, such as Corfe Castle. Of the siege, the Barnwell Chronicle states \"No one alive can remember a siege so fiercely pressed and so manfully resisted\" and \"There were few who would put their trust in castles\".\nDeath of King John\nIn October 1216 John contracted dysentery, and he died at Newark Castle, Nottinghamshire, and with him the main reason for the fighting. Louis now seemed much more of a threat to baronial interests than John's nine-year-old son, Henry. Pierre des Roches, Bishop of Winchester, and a number of barons rushed to have the young Henry crowned as King of England. London was held by Louis (it was his seat of government) and therefore could not be used for this coronation so, on 28 October they brought the boy from Devizes Castle to Gloucester Abbey in front of a small attendance presided over by Papal Legate Guala Bicchieri. They crowned Henry with a necklace of gold.\nOn 12 November Magna Carta was reissued in Henry's name with some of the clauses omitted, including clause 61. The revised charter was sealed by Henry's regent William Marshal. A great deal of the country was loyal to Louis, with the southwest of England and the Midlands favouring Henry. Marshal was highly respected, and he asked the barons not to blame Henry for his father's sins. The prevailing sentiment, helped by self-interest, disliked the idea of depriving a boy of his inheritance. Marshal also promised that he and the other regents would rule by Magna Carta. Furthermore, he managed to get support from the pope, who had already excommunicated Louis.\nLouis's losses\nWilliam Marshal slowly managed to get most barons to switch sides from Louis to Henry and attack Louis. The two opposing sides fought for about a year. On 6 December 1216 Louis took Hertford Castle but allowed the defending knights to leave with their horses and weapons. He then took Berkhamsted Castle in late December, which again allowed the royal garrison to withdraw honourably with their horses and weapons.\nBy early 1217, Louis decided to return to France for reinforcements. He had to fight his way to the south coast through loyalist resistance in Kent and Sussex, losing part of his force in an ambush at Lewes, with the remainder pursued to Winchelsea and were saved from starvation only by the arrival of a French fleet. in 1217.|left|230x230px]]Since the truce had been arranged with Dover, the Dover garrison had repeatedly disrupted Louis's communication with France, and so Louis sailed back to Dover to begin a second siege. The French camp, set up outside Dover Castle in anticipation of the siege, was attacked and burned by William of Cassingham and Oliver fitz Regis just as the fleet carrying the reinforcements arrived. Louis was forced to land at Sandwich and march to Dover, where he began his siege in earnest on 12 May 1217. The siege diverted so much of Louis's forces that Marshal and Falkes de Breauté were able to attack and heavily defeat pro-Louis barons at Lincoln Castle on 15 May or 20 May, in what became known as the Second Battle of Lincoln.\nMarshal prepared for a siege against London next. In the meantime, Louis suffered heavy defeats in the naval Battle of Sandwich at the hands of William's ally and Dover's constable Hubert de Burgh. Louis's reinforcement convoy under Eustace the Monk was destroyed, making it nearly impossible for Louis to continue fighting.\nAftermath\nAfter a year and a half of war, most of the rebellious barons had defected. That and the defeat of the French in 1217 forced Louis to negotiate. A few of Henry's supporters held out for unconditional surrender, but William Marshal successfully argued for the more moderate terms.\nAt the Treaty of Lambeth, which was signed on 11 September 1217, Louis had to give up his claim to be the King of England and agree that he had never been the legitimate king. The principal provisions of the treaties were an amnesty for English rebels, but the barons who had joined Louis had to pay the French prince 10,000 marks to expedite his withdrawal. Louis surrendered the few remaining castles that he had held and exhorted to his allies—Scottish and Welsh troops under Alexander II and Llywelyn the Great respectively—to lay down their arms. Louis also agreed to not attack England again.\nMuseums\n* Dover Castle, which saw vast sieges in 1216 and 1217, has an exhibition in the Napoleonic casemates at the castle's north, roughly the site of the section of wall that was breached in the 1216 siege.\n* Rochester City Museum contains a model of the castle keep under siege.\nSee also\n* Second Barons' War\nFootnotes\nCitations\nSources\n*\n*\n*\n*\n*\n* Salter, Mike (2000). The Castles of Kent. Folly Publications, Malvern.\n*\n*\n*\nFurther reading\n* [http://johnsmilitaryhistory.com/dover.html Photos and article]\n*  (the online version lacks the diagrams of the print version)"
    }
  ]
}