{
  "content": [
    {
      "type": "text",
      "text": "# First presidential transition of Donald Trump\n\n| headquarters = 1717 Pennsylvania Avenue NW, Washington, D.C., United States\n| owner =\n| sec_gen =\n| leader_title = Chairman\n| leader_name = Mike Pence\n| leader_title2 = Director of Appointments\n| leader_name2 = Bill Hagerty\n| board_of_directors =\n| main_organ =\n| budget =\n| budget_year =\n| disbursements =\n| expenses =\n| expenses_year =\n| staff =\n| staff_year =\n| slogan =\n| mission =\n| website = [https://greatagain.gov GreatAgain]\n}}\nThe first presidential transition of Donald Trump began when he won the presidential election on November 8, 2016, and became the president-elect. Trump was formally elected by the Electoral College on December 19, 2016. The results were certified by a joint session of Congress on January 6, 2017, and the transition concluded when Trump was inaugurated on January 20, 2017.\nTransition procedures\nIn accordance with the Pre-Election Presidential Transition Act of 2010, candidate transition teams are provided office space by the General Services Administration (GSA). Transition teams are also eligible for government funding for staff; spending on Mitt Romney's transition team in 2012 was $8.9&nbsp;million (~$}} in ), all funds appropriated by the U.S. government.\nUnder existing federal law and custom, a nominee becomes eligible to receive classified national security briefings once their nomination is formalized at their party's national convention.\nResponsibilities\nKey responsibilities of a presidential transition include the identification and vetting of candidates for approximately 4,000 non-civil service positions in the U.S. government whose service is at the pleasure of the president; arranging the occupancy of executive residences including the White House, One Observatory Circle, and Camp David; liaising with the United States Strategic Command for receipt of the Gold Codes; and briefing senior civil service personnel about a new administration's policy priorities.\nRecent developments\nA law enacted by the United States Congress in 2016 amending the Presidential Transition Act requires the incumbent president to establish \"transition councils\" by June of an election year to facilitate the eventual handover of power.\nThe National Academy of Public Administration (NAPA), meanwhile, launched a new program called \"Transition 2016\" in 2016. Led by Ed DeSeve and David S. C. Chu, the program was described by NAPA as one which provides management and procedural advice to the leading candidates in establishing transition teams.\nTimeline\nPre-election\nIn April 2016, representatives from the Trump campaign, as well as the campaigns of four other then-running Republican candidates, met in New York with representatives of the Partnership for Public Service to receive a two-day briefing and overview of the transition process. According to Trump campaign manager Corey Lewandowski, the campaign shortly thereafter began implementing the recommendations provided at the meeting.\nIn early May 2016, after Trump became the presumptive nominee, campaign officials announced they would name the members of a presidential transition team within the \"upcoming weeks\". On May 6, The New York Times reported that Trump had asked Jared Kushner to begin work on putting a transition team together. Corey Lewandowski and Paul Manafort worked with Kushner in the selection of a transition chief. Three days later, Trump announced that New Jersey Governor (and former rival presidential candidate) Chris Christie had agreed to head the effort.\nOn Friday, June 3, 2016, the Agency Transition Directors Council first assembled at the White House to review transition plans of each of the major executive departments; neither the Trump nor Clinton campaigns sent representatives to this initial meeting. At about the same time, the White House began transferring its preceding eight years of accumulated electronic files to the National Archives and Records Administration's Electronic Record Archive for preservation.\nThe transition planning came under heavy criticism for lagging behind other recent transition planning efforts when it was shown to have hired only a \"handful\" of staff by late July. At that time, Chris Christie named Bill Palatucci, a corporate attorney from New Jersey and the state's Republican National Committeeman, as general counsel; Palatucci reportedly began meeting with senior members of Mitt Romney's 2012 transition team shortly thereafter. Meanwhile, on July 29, White House chief of staff Denis McDonough led a conference call with Chris Christie to discuss transition procedures. During the call, McDonough informed Christie that Anita Breckenridge and Andrew Mayock will be the administration's primary \"points of contact\" with the Trump campaign moving forward. The pair also discussed the planned availability of office space at 1717 Pennsylvania Avenue for the Trump transition team, which the General Services Administration was to make available beginning August 2, 2016.\nDuring the first week of August, the Trump transition office was officially opened. The same month, William F. Hagerty, a former member of Mitt Romney's transition team, was named director of appointments while John Rader, a senior aide to United States Senate Foreign Relations Committee chair Bob Corker, was retained in the position of deputy director of appointments.\nIn an example of \"how removed the transition process is from the tumult and rancor of the campaign\", representatives of the Trump and Clinton transition teams began holding a series of meetings with each other, and with White House officials, to plan details of the transition process.\nBy October, it was reported the transition team had grown to more than 100 staff, many of whom were policy experts brought aboard to compensate for a dearth of policy staff employed by the Trump campaign. For example, in October 2016, Robert Smith Walker, former chairman of the House Science Committee, was appointed space policy advisor.\nto the United States armed forces informed them of the pending transfer of military command.]]\nImmediate post-election\nIn the early hours of November 9, 2016, media outlets reported Trump would secure enough votes in the Electoral College to win the presidential election. Democratic Party nominee Hillary Clinton conceded the election to him later that day.\nSecurity enhancements\nPrior to Trump's return to his private residence at Trump Tower, the United States Secret Service initiated \"unbelievable security measures\", including closing East 56th Street to all traffic, reinforcing a cordon of sand-laden dump trucks that had been placed around the building the night before to defend the site from being rammed with a car bomb, and deploying New York City Police Department tactical teams around the skyscraper. The FAA, meanwhile, ordered a flight restriction over midtown Manhattan.\nTrump business interests\nFollowing his victory at the election, Trump began transferring control of the Trump Organization to the company's other executives, including his three oldest children; Donald Jr., Ivanka, and Eric Trump in a blind trust. According to a November 11 statement from the Trump Organization, it was \"in the process of vetting various structures with the goal of the immediate transfer of management of the Trump Organization and its portfolio of businesses\".\nAt a press conference on January 11, 2017, Trump said he and his eldest daughter Ivanka would resign all management roles with the Trump Organization by inauguration day, January 20. Its assets would be put into a trust run by his two oldest sons Donald Jr. and Eric, together with existing chief financial officer Allen Weisselberg. Trump would continue to own the business. At the press conference, Trump attorney Sheri Dillon made a substantial presentation on the legal structure that was being put in place for the Trump Organization during the presidency. \"No new foreign deals will be made whatsoever during the duration of President Trump's presidency,\" Dillon said, and new domestic deals \"will go through a vigorous vetting process\" and President Trump will have no role in them, among other assertions.\nBeginning of transition process\ndelivers a statement following the victory of Donald Trump.]]\nvisits Michelle Obama at the White House.]]\nShortly after noon on November 9, outgoing president Barack Obama made a statement from the Rose Garden of the White House, in which he announced that he had spoken, the previous evening, with Trump and formally invited him to the White House the next day, November 10, for discussions to ensure \"that there is a successful transition between our presidencies\". President Obama said he had instructed his staff to \"follow the example\" of the George W. Bush administration in 2008, who he said could \"not have been more professional or more gracious in making sure we had a smooth transition\".\nThe same day, United States secretary of defense Ash Carter issued a memo to the United States armed forces informing them of the pending transfer of National Command Authority to a new administration. Also on November 9, the U.S. Intelligence Community offered the full President's Daily Brief to Trump and Mike Pence, with Trump receiving his first brief on November 15 in his office at Trump Tower.\nBy the afternoon of November 9, a transition website – greatagain.gov – had been launched. The website provided information on transition procedures and information for the media. The website was later criticized for reposting content originally created by the Partnership for Public Service, however, Partnership CEO Max Stier declined to criticize the use and noted that the organization had been working with the major campaigns on transition planning, explaining that he hoped the group's materials would be \"a resource that is used for the betterment of transitions\". Content on the transition website was licensed under a Creative Commons Attribution 4.0 License.\nAt 11:00a.m. on November 10, the president and president-elect held a private, 90-minute meeting at the White House, which was followed by a joint media availability in the Oval Office with a press pool composed of journalists from Reuters, Voice of America, Bloomberg, the Associated Press, Agence France-Presse, ABC News, and McClatchey syndicate. During the availability, Trump thanked Obama for their meeting and said he looked forward to tapping him for future counsel, although this did not eventuate. According to Trump, Obama convinced him, during their discussion, to retain certain aspects of his signature policy Obamacare, including the ban on insurance companies denying new coverage to those with pre-existing conditions and the right of parents to keep their adult children on their health insurance policies until the age of 25. During the same day, First Lady Michelle Obama had tea with incoming First Lady Melania Trump and also gave her a tour of the White House residence.\nNovember 11 reshuffle\nThe transition was formerly led by Chris Christie until he and a number of his supporters were replaced or demoted on November 11 when Trump telephoned and told him his involvement with the Bridgegate scandal was a political liability and his performance heading the transition unsatisfactory (Trump, later, also expressed private frustration at Christie's retention of lobbyists in key transition posts). At the end of the call, Trump fired Christie from his position as transition chair. Over the next twenty-four hours, and with little warning, Christie loyalists were quickly removed from the transition team in what was characterized by NBC News as a \"Stalinesque purge\". Transition executive Richard Bagger, for instance, found himself suddenly locked-out of the transition team's offices. Bill Palatucci, Mike Rogers, and others, were also among those removed.\nImmediately after the reshuffle, Mike Pence was elevated to transition chair by Trump. Under Christie, many of the members of the transition team were registered lobbyists who had worked on issues overseen by the agencies they were charged with staffing or affected by policies they were preparing. However, by November 16, Pence had introduced new restrictions that Politico described as \"in some ways far more rigid than President Barack Obama's groundbreaking lobbyist ban\". Under the new rules, while incoming administration officials who are currently registered lobbyists would be allowed, they would have to sign documents forfeiting their ability to re-register as lobbyists for five years after departing government.}} In addition, Pence ordered that all lobbyists be removed from the transition team, with Politico reporting two days later that staff members who were registered lobbyists had begun to resign.\nPence's tenure\nOn November 15, Trump requested security clearance for son-in-law Jared Kushner (a member of the transition team), which would allow him to attend the full President's Daily Brief – a request that experts have called \"unprecedented\". As of November 15, all briefings of the transition team by government were on hold pending the need for incoming chair Mike Pence to sign an agreement with the Obama administration.\nOn November 16, Trump met with Alabama senator Jeff Sessions, who had been discussed as a possible contender for several cabinet positions. Trump also met with New York City mayor Bill de Blasio.\nOn November 17, Trump met with former secretary of state Henry Kissinger in order to discuss matters relating to foreign affairs. Later that day, Trump met with Japanese prime minister Shinzo Abe in an informal visit at Trump Tower. After the meeting, which was attended by Michael T. Flynn and Ivanka Trump, Abe said he had \"great confidence\" in Trump and described their discussion as \"very candid\".\nPast and current State Department officials, however, were disturbed by Ivanka's presence. Moira Whelan, a former John Kerry 2004 presidential campaign staffer who left the department in July after serving as a deputy assistant secretary for digital strategy in the U.S. Department of State, averred that \"anyone present for such a conversation between two heads of state should, at a minimum, have security clearance, and should also be an expert in Japanese affairs ... meeting of two heads of state [sic] Also, neither was Mr. Trump a head of state at the moment.}} is never an informal occurrence. Even a casual mention or a nod of agreement or an assertion left unchallenged can be interpreted in different ways\".\nOn December 6, Michael G. Flynn, the son of Michael T. Flynn, was forced out of the transition team. Spokesman Jason Miller did not identify the reason for Flynn's dismissal; however, The New York Times reported that other officials had confirmed it was related to a tweet he made regarding the Pizzagate conspiracy theory.\nOn December 14, Trump met with CEOs and representatives from Silicon Valley tech companies in Trump Tower.\nTransition team\nLeadership\nThe Trump transition team was led by Vice President-elect Mike Pence. It originally had six vice-chairs, which was expanded on November 29, 2016 to thirteen vice-chairs:  Ben Carson, Chris Christie (previously head of the transition from May 2016 through election day), Michael Flynn (incoming national security advisor), Newt Gingrich, Rudy Giuliani, Jeff Sessions (incoming attorney general), with the addition of K. T. McFarland (incoming deputy national security advisor), Governor Mary Fallin, Senator Tim Scott, Representative Marsha Blackburn (previously on the executive committee), Representative Cathy McMorris Rodgers, Representative Tom Reed, and outgoing representative Cynthia Lummis.\nThe transition team also had an Executive Committee which included:\n* Steve Bannon relieved of duties on August 18, 2017. Succeeded by Kellyanne Conway\n* Representative Lou Barletta\n* Representative Marsha Blackburn (moved to vice-chair)\n* Florida attorney general Pam Bondi\n* Representative Chris Collins\n* Representative Tom Marino\n* Rebekah Mercer – director of the Mercer Family Foundation and daughter of major Trump (and Cruz) donor Robert Mercer.\n* Steven Mnuchin — former partner at Goldman Sachs, incoming secretary of the treasury\n* Representative Devin Nunes\n* Reince Priebus – Republican National Committee chairman; named incoming White House chief of staff on November 13\n* Anthony Scaramucci – Hedge-fund manager and founder of investment firm SkyBridge Capital, formerly at Goldman Sachs\n* Peter Thiel – Co-founder of PayPal, now a venture capitalist involved in several groups including Clarium Capital and Founders Fund.\n* Donald Trump Jr.\n* Eric Trump\n* Ivanka Trump\n* Jared Kushner, businessman; husband of Ivanka Trump\nAdditional executive committee members added on November 29, 2016:\n* Representative Sean Duffy\n* Representative Trey Gowdy\n* Representative Dennis Ross\n*  Pastor Darrell C. Scott\n*  Kiron Skinner\nStructure and staff\nAn organizational chart of the transition team was made public by the New York Times. It divided the work into two areas: \"agency action\" led by Ron Nicol and \"policy implementation\" led by Ado Machida. The agency side, which oversaw appointments, was divided into six arenas:\n* National security, led by former representative Mike Rogers, until he was abruptly fired on November 15.\n* Economic issues, led by David Malpass, the former chief economist at Bear Stearns, and William L. (\"Bill\") Walton, who heads the private equity firm Rappahannock Ventures and Rush River Entertainment. Walton is Vice President of the Council for National Policy and a senior fellow for Discovery Institute's Center on Wealth, Poverty and Morality.\n* Domestic issues, led by Ken Blackwell – the former mayor of Cincinnati, treasurer of Ohio, and secretary of state of Ohio\n* Defense, led by Keith Kellogg, the former commanding general of the 82nd Airborne Division.\n* Management and budget, led by former attorney general Ed Meese and Kay Coles James.\n* Agency transformation and innovation, led by Beth Kaufman.\nThe policy side had three senior leaders including Ado Machida as director of policy implementation, Andrew Bremberg as executive legal action lead, and Carlos Diaz Rosillo as executive authority advisor. Bremberg is Senior Advisor and Chief of Staff for US Health and Human Services for the George W. Bush administration and advisor to Senate majority leader Mitch McConnell and for presidential bid of Wisconsin governor Scott Walker; he was previously reported to be serving the transition as an advisor on health issues.\nThe policy implementation team included the following policy areas:\n* Defense and national security, led by Major General Bert Mizusawa.\n* 'Immigration reform and building the wall'', led by Danielle Cutrona, counsel to Senator Jeff Sessions.\n* Energy independence, led by Michael Catanzaro, an energy lobbyist whose clients include American Fuel and Petrochemical Manufacturers, Hess, Devon Energy, and Encana Oil and Gas.\n* Tax reform, led by Jim Carter, a lobbyist employed by Emerson.\n* Regulatory reform, led by Rob Gordon, who serves as staff director/senior policy advisor for the House Natural Resources Committee, Oversight and Investigations Subcommittee.\n* Trade reform, led by Rolf Lundberg, a lobbyist and former employee of the Chamber of Commerce.\n* Education, led by Gerard Robinson of the American Enterprise Institute.\n* Transportation and infrastructure, led by Martin Whitmer, a lobbyist at Whitmer & Worrall whose clients include the American Association of Railroads, National Asphalt Pavement Association and the Utilities Technology Council.\n* Financial services reform, led by Brian Johnson, chief financial institutions counsel for the House Financial Services Committee\n* Healthcare reform, led by Paula Stannard, former deputy general counsel and acting general counsel of HHS and currently a lawyer at Alston & Bird.\n* Veterans Administration reform, led by Bill Chatfield\n* Protecting Americans' constitutional rights''', led by Ken Klukowski, senior counsel and director of strategic affairs for the First Liberty Institute.\nOther people reported to have been working on the transition team included:\n* James Carafano – a senior fellow at the George Washington University Homeland Security Policy Institute and former professor at the U.S. Naval War College led appointment selections to the U.S. State Department\n* Jeffrey Eisenach – a Verizon and other telecommunications client consultant helped to pick staff members at the Federal Communications Commission\n* Kris Kobach – the secretary of state of Kansas served as a policy advisor on immigration\n* Nick Langworthy – the chairman of the Erie County, New York Republican Committee\n* Robert Smith Walker – former member of Congress from Pennsylvania and chair of the Hydrogen and Fuel Cell Technical Advisory Committee of the U.S. Department of Energy, advised the transition on space policy\nForeign policy advisors of the Obama Administration complained that, \"Trump representatives...have been focused on issues of process and how the office functions, rather than issues of substance involving an explanation of current national security threats and the state of the world the new administration will inherit.\nCabinet designees\nAll positions, except chief of staff and vice president, require the advice and consent of the United States Senate prior to taking office.\nOn November 30, Politico, which viewed Trump's chosen administration nominees as being more conservative as opposed to previous presidential administrations, described Trump as \"well on his way to building a conservative dream team that has Republicans cheering and liberals in despair.\" On the other hand, The Wall Street Journal stated that \"it's nearly impossible to identify a clear ideological bent in the incoming president's\" cabinet nominations.\nThe Washington Post noted that Trump's cabinet would be \"the wealthiest administration in modern American history.\" The Post also noted that while some of Trump's appointments consisted of \"his staunchest and most controversial allies\" such as Bannon, Flynn and Sessions, other appointments appealed to the Republican establishment and had \"the imprint of Mike Pence\".\nAssessment of the transition\nThe Trump transition has been assessed by some as having been a troubled transition, with many calling it \"chaotic\". The chaotic nature of the transition has been largely attributed to Trump's decision making, including his firing of Chris Christie and scrapping of the pre-election planning which Christie had undertaken for the transition, which meant that the transition had to start their planning from scratch.\nIn 2020, Tom Wheeler wrote for the Brookings Institution that \"the Trump presidential transition in 2016-17 proved that a transition delayed is a transition denied\", arguing that the Trump transition's delay in placing transition teams at federal agencies was ultimately damaging to the Trump administration.\nIn 2024, Max Stier said the transition set a 'low bar' for modern transitions, followed by the George H. W. Bush transition.\nSee also\n* Fire and Fury (a book by Michael Wolff which details the first year of the Trump presidency)\n* The Fifth Risk (a book by Michael Lewis that examines the Trump transition and administration)\n* Let Me Finish (a book by Chris Christie detailing his involvement with the Trump campaign and transition)\n* Fossil fuels lobby\n* Hiring and personnel concerns about Donald Trump\n* Timeline of the Donald Trump presidencies\n* Timeline of post-election transition following Russian interference in the 2016 United States elections\n* Donald Trump 2016 presidential campaign\n* First inauguration of Donald Trump\n* Second presidential transition of Donald Trump\nNotes\nReferences\nExternal links\n* [https://greatagain.gov GreatAgain]  the official Presidential Transition website\n* [https://web.archive.org/web/20161111071256/https://presidentialtransition.usa.gov/transition-overview/ The Presidential Transition Directory] at the General Services Administration\n* [https://web.archive.org/web/20191202100113/https://medium.com/greatagain/agency-landing-teams-54916f71f462 Agency Landing Teams] at the official Presidential Transition website (archived)"
    }
  ]
}