{
  "content": [
    {
      "type": "text",
      "text": "# First Brazilian Republic\n\n| conventional_long_name =\n| common_name            = Brazil\n| p1                     = Empire of Brazil\n| flag_p1                = Flag of Brazil (1853-1889).svg\n| s1                     = Second Brazilian Republic\n| flag_s1                = Flag of Brazil (1889-1960).svg\n| image_flag             = Flag of Brazil (1889–1960).svg\n| flag_type              = Flag(1889–1930)\n| image_map              = Brazil (orthographic projection).svg\n| image_map_caption      = Brazil at its largest territorial extent, including Acre\n| image_map_alt          = Map of South America with Brazil highlighted in green\n| symbol                 =\n| symbol_type            = Coat of Arms(1889–1930)\n| image_coat             = Coat of arms of Brazil (1889–1968).svg\n| capital                = Rio de Janeiro\n| national_motto         = Ordem e Progresso\n| national_anthem        =  Hino Nacional Brasileiro\n| common_languages       = Portuguese\n| government_type        = Federal presidential republic under a military dictatorship (1889–1894) Oligarchic federal presidential republic (1894–1930)\n| title_leader           = President\n| leader1                = Deodoro da Fonseca\n| year_leader1           = 1889–1891\n| leader2                = Washington Luís\n| year_leader2           = 1926–1930\n| title_deputy           = Vice President\n| deputy1                = Floriano Peixoto\n| year_deputy1           = 1891\n| deputy2                = Melo Viana\n| year_deputy2           = 1926–1930\n| era                    = Belle Époque\n| status                 =\n| year_start             = 1889\n| year_end               = 1930\n| event_start            = Proclamation of the Republic\n| date_start             = 15 November\n| event1                 = Republican Constitution\n| date_event1            = 24 February 1891\n| event2                 = Naval Revolts\n| date_event2            = 1893–1894\n| event3                 = Federalist Revolution\n| date_event3            = 1893–1895\n| event4                 = Civilian rule\n| date_event4            = 15 November 1894\n| event_end              = Revolution of 1930\n| date_end               = 24 October\n| legislature            = National Congress\n| house1                 = Senate\n| house2                 = Chamber of Deputies\n| currency               = Real\n| stat_year1             = 1890\n| stat_pop1              = 14,333,915\n| stat_year2             = 1900\n| stat_pop2              = 17,438,434\n| stat_year3             = 1920\n| stat_pop3              = 30,635,605\n| religion_year          = 1910\n| religion_ref           =\n| religion               =\n}}\nThe First Brazilian Republic, also referred to as the Old Republic (, ), officially the Republic of the United States of Brazil, was the Brazilian state in the period from 1889 to 1930. The Old Republic began with the coup d'état that deposed emperor Pedro II in 1889, and ended with the Revolution of 1930 that installed Getúlio Vargas as a new president. During the First Republic, the country's presidency was dominated by the most powerful states of São Paulo and Minas Gerais. Because of the power of these two states, based on the production of coffee and dairy, respectively, the Old Republic's political system has been described as \"milk coffee politics\". At local level, the country was dominated by a form of machine politics known as coronelism, in which the political and economic spheres were centered around local bosses, who controlled elections and would often conduct electoral fraud.\nThe country was also marked by a series of rebellions and revolutions against the ruling oligarchies, which culminated into the Revolution of 1930, when the Liberal Alliance, a force of urban middle-class, planters from outside São Paulo and military reformists composed mostly by junior officers (known as Tenetism), deposed ruling president Washington Luís (representative of the São Paulo oligarchies) and led to the ascension of Getúlio Vargas as president, heralding the start of the Vargas Era.\nBackground\nDecline of the Empire of Brazil\nAfter the Paraguayan War, the Brazilian military gained political influence. Emperor Pedro II's worsening health gradually removed him from his active role in politics, which caused tension between the imperial elite and the military as there was no moderating force between them. Pedro II's successor, Princess Isabel, had a husband who had a controversial personality. The church had also worn down the government to some extent.\nIn 1889, Deodoro da Fonseca, a marshal of the Brazilian Army, attended a meeting with prestigious civilian and military men who pressured him to begin a movement against the monarchy; there had been a rumor that he would be arrested. This resulted in him launching a coup d'état on 15 November 1889, which was bloodless and unopposed. It is unknown if whether on the day itself he had declared the birth of the republic, or had only removed the Prime Minister, the Viscount of Ouro Preto from power.\nRepublic of the Sword, 1889–1894\nThe officers who joined Field Marshal Deodoro da Fonseca in ending the Empire had made an oath to uphold it. The officer corps would eventually resolve the contradiction by linking its duty to Brazil itself, rather than to transitory governments. The Republic was born rather accidentally: Deodoro had intended only to replace the cabinet, but the republicans manipulated him into founding a republic.\nProvisional Government (1889–1891)\nFollowing the coup, Deodoro da Fonseca was chosen to be the leader of the new republic.\nMany of the tasks which the new government were faced with were solved by executive decree, which drew opposition from republicans and non-republicans. The governments' first decree stated that until a constitution was adopted, a federal republic would govern. Followed by decrees which allowed those with literacy and were above the age of 21 to vote, (it was implicitly understood that women did not vote), separated church and state, and dissolved state assemblies under the Empire.\nRuy Barbosa was the main handler of financial problems. In the last years of the imperial regime, many financial problems had begun. Ruy Barbosa attempted to solve these problems by allowing certain banks and businesses concerns favored by the government to triple the nation's credit. This plan was called the \"Encilhamento\". The immediate effects were mass speculation and inflation, which caused foreign investors and banks to pull out of Brazil. It would be several years before the country regained the trust of foreign bankers.\n5 days after the overthrow of the empire, Argentina and Uruguay recognised the new republic, Chile followed suit by the before end of 1889. The next year, most of Latin America and the United States had recognised the new republic, together with most other nations, though it was coldly received in Europe at first due to its lack of a constitution.\nWith the liberals fearing a military dictatorship and the europe's icy reactions towards the new republic, a constitution was promulgated two years later.\nThe constitution of 1891\nThe Constituent Assembly, which drew up the constitution of 1891, was divided between two factions. Those who sought to limit executive power, which was dictatorial in scope under President Deodoro da Fonseca and the other being the Jacobins, who opposed the paulista coffee oligarchy and who wanted to preserve and intensify presidential authority. The constitution created by this assembly established a federation that was officially governed by a president, a bicameral National Congress (Congresso Nacional; hereafter, Congress), and a judiciary.\nThe laws in the constitution regarding voting rights were restrictive; only the literate were able to vote, leaving out 95% of the population. Though there was no specific law that forbade women from voting, it was implicitly understood that women did not vote. Voting was also made voluntary, which meant that there was little incentive or reason to vote, especially to people living in rural areas of Brazil with little government presence. Even in the most competitive presidential elections, (excluding the final election of the old republic, the election of 1930), vote counts would never be above a million.\nThe Oligarchical System\nRegardless of the constitution, the real power was held by the states, and by local potentates called \"colonels.\" The colonels largely controlled Brazil's internal politics through a system of unwritten agreements known as coronelismo. Coronelismo, which supported state autonomy, was called the \"politics of the governors\". Under it, the local oligarchies chose the state governors, who in turn selected the president.\nThis informal but real distribution of power emerged, the so-called politics of the governors, to take shape as the result of armed struggles and bargaining. The populous and prosperous states of Minas Gerais and São Paulo dominated the system and swapped the presidency between them for many years. The system consolidated the state oligarchies around families that had been members of the old monarchical elite. And to check the nationalizing tendencies of the army, this oligarchic republic and its state components strengthened the navy and the state police. In the larger states, the state police were soon turned into small armies. The Head of the Brazilian army ordered that it would doubled so they could defend them.\nFloriano Peixoto government (1891–1894)\nWith a new constitution, the first election in Brazilian history was held in 1891. The candidates were Deodoro de Fonseca, and Floriano Peixoto, the former's Minister of War. Deodoro de Fonseca was elected President, and Floriano Peixoto was elected Vice President against their respective candidates. The latter won 156 votes and the former won 129. Deodoro da Fonseca had difficulty adjusting to sharing power with Congress and dissolved it in November 1891, which provoked revolts in the navy (First Navy Revolt) and in Rio Grande Do Sul. In hopes to mollify the opposition, he resigned to allow Vice President, Floriano Peixoto to take over the presidential position.\nUpon taking office, Floriano ousted all state governors that had supported Deodoro, which triggered violence in many parts of the country. One of the bloodiest of these was the civil war in Rio Grande Do Sul, which quickly spread to neighbouring states such as Santa Catarina and Parana, pitting former monarchist liberals against republicans. While the civil war in Rio Grande Do Sul was raging, a Second Navy Revolt in Guanabara Bay began. The revolt was put down by a fleet of ships with American crews.\nMilitary\nWith the monarchy suddenly eliminated, the Army was left as the country's only long-lasting and powerful national institution. Although the Roman Catholic Church continued its presence throughout the country, it was not national but rather international in its personnel, doctrine, liturgy, and purposes. The army assumed this new position strategically; the monarchy had become unpopular with Brazil's conservative economic elite after the abolition of slavery, and the army capitalized on that shift in opinion to amass support for itself within the upper class. Thanks to their success in this area, the army's prestige managed to eclipse even other military institutions, like the Navy and the National Guard. The navy's attempts to prevent such hegemony were defeated militarily during the early 1890s. Although it had more units and men in Rio de Janeiro and Rio Grande do Sul than elsewhere, the Army's presence was felt throughout the country. Its personnel, its interests, its ideology, and its commitments were national in scope.\nThe army was not a united institution, it was distinctly divided into two factions. The faction under Deodoro de Fonseca, and the faction under Floriano Peixoto. The key difference between the two factions being that the latter's followers adopted positivism and the formers' did not.\nFirst civilian presidencies, 1894–1910\nFloriano Peixoto's resignation marked the end of the first phase of the old Republic, the Republic of the Sword, where Brazil was ruled militarily, without a civilian president. After Peixoto's resignation, he handed over the presidency to Prudente de Morais, the first civilian president of Brazil.\nPrudente de Morais government (1894–1898)\nMorais' first actions in office were to negotiate an end to the Federalist Revolt and grant amnesty to the rebels while lowering the influence of the military in politics. During his presidency, tensions between Civilian and military forces were high. The military was suspicious of the new president, and believed that Morais would rob them of the victory in creating the republic. No military men would take office until Hermes da Fonseca in 1910, and the role of the military in politics was greatly reduced. The , was shut down between 1896 and 1901. During his presidency, tensions between the political elite of the states and the radical Jacobins were also amplified. The Jacobins were mainly made out of the lower middle class, military men, and workers, who had been affected by rising costs of living. They believed that a strong, centralized republic would be able to fend off monarchist threats, which they believed were in every corner of the republic. They were also anti-Portuguese, as they would disrupt Portuguese commerce in Rio De Janeiro.\nDuring this period, territorial disputes with foreign powers were also resolved. Prudente de Morais resolved a dispute with Britain regarding the latter's occupation of Trindade island, bringing in Portugal as a mediator. A more violent situation occurred in the state of Amápa, where french troops invaded and burned several villages in the area as the result of a long-standing border dispute. The situation was resolved with Switzerland as a mediator. The result of both of these territorial disputes was favourable to Brazil.\nIn 1896, A war began between the village of Canudos and the republic, the former led by Antonio Maciel. The conflict began with an incident regarding the cutting of some timber. The governor of Bahia decided to attack the Canudos settlement, though his expedition was defeated. Two more expeditions were defeated soon after, which drew a wave of violence and protest in São Paulo. In 1897, a well-equipped expedition led by General Artur Oscar with 8000 men razed the settlement. The conflict drew attention from many jacobins, who saw the conflict as monarchist-perpetrated uprising. Their proof was that Antonio Maciel had preached for the return of the monarchy, and as a priest, saw republics and democracy as \"atheist inventions\".\nCampos Sales Government (1898–1902)\nFollowing Prudente de Morais, Campos Sales' assumed the presidency. During his presidency, he created a political system known as the , where elections would be controlled by powerful oligarchs who would receive favours from presidential candidates in return for supporting their presidency. These powerful oligarchs would then offer favours to the populace in exchange for them to vote for a certain candidate. He also stabilized the economy with the help of austerity measures.\nRodrigues Alves Government (1902–1906)\nFollowing Campos Sales, Rodrigues Alves assumed the presidency as his appointed successor. His government was marked by pushing for better healthcare and greater urbanisation in the capital city at the time, Rio de Janeiro. The early years of the First Republic were marked by poor sanitation and healthcare in many cities. The capital, Rio de Janeiro was in an especially unhealthy state as it was wedged between many water bodies, and a sharply rising ocean. Flooding would occur during the rainy season, and ineffectiveness of the city's drainage system led to the city's land still remaining marshy after the flood. This also led to pockets of stagnant water, which made ideal breeding places for mosquitos carrying yellow fever and malaria. His government was also marked by the Vaccine Revolt, caused by popular discontent when a law was passed issuing mandatory vaccination in Rio de Janeiro.\nAfonso Pena Government (1906-1909)\nUpon taking office, he surrounded himself with young politicians who he appointed as members of his cabinet. During his government, he signed the Taubaté Agreement, created the Rondon Commission, and reorganized the Brazilian army by repealing the Sortition Law.\n1910s–1922 and World War I\nPreceding\nPolitical dynamics\nFollowing the creation of the republic in 1889, there were many political and social rebellions that had to be subdued by the regime, such as the Two Naval Revolts (1891 & 1893–94), the Federalist Rebellion (1893–95), War of Canudos (1896–97), Vaccine Revolt (1904), Revolt of the Whip (1910) and the Revolt of Juazeiro (\"Sedição de Juazeiro\", 1914). The Contestado War, a rebellion pitting settlers against landowners, also raged from 1912 to 1916. Therefore, with the onset of World War I, Brazilian elites were interested in studying the events of the Mexican Revolution with more attention than those related to the War in Europe.\nBy 1915 it was also clear that the Brazilian elites were dedicated to making sure Brazil followed a conservative political path; they were unwilling to embark upon courses of action, whether domestically (i.e. adopting the secret ballot and universal suffrage) or in foreign affairs (making alliances or long-term commitments), that could have unpredictable consequences and potentially risk the social, economic, and political power held by the Brazilian elite. This course of conduct would extend throughout the 20th century, an isolationist foreign policy interspersed with sporadic automatic alignments against \"disturbing elements of peace and international trade\".\nRuy Barbosa was the main opposition leader, campaigning for internal political changes. He also stated that, due to the natural conflict between Brazilian commercial interests and the Central Powers' strategic ones (demonstrated for example in the German submarine campaign as well as in the Ottoman control over the Middle East), Brazilian involvement in the war would be inevitable. So he advised that the most logical way to proceed would be to follow the United States, which was working for a peace agreement but at the same time since the sinking of the RMS Lusitania was also preparing for war.\nThe formation of the operary class takes its place at the end of 19th century, and it was related with the ongoing changes caused by the expansion of the coffee economy. Because of that expansion, the \"progress\" of the capitalist economy sufficed the conditions for the establishment of a nucleus of service and fabril workers at São Paulo. Beyond that, many immigrants from Europe had arrived, and between them were the refugees of the Paris Commune, bringing communist and anarchist ideas. Because of those ideas, problems for the very conservative regime of large estate owners emerged. Further on, masses of industrial workers became unhappy with the status quo and began engaging in massive protests, mostly in São Paulo and Rio de Janeiro. After a General Strike in 1917, the government attempted to brutally repress the labor movement in order to prevent new movements from beginning. This repression, supported by legislation, was very effective in preventing the formation of labor unions considered to be really free by the workers involved.\nWar\ndeclares war on the Central Powers, October 1917.]]\nThere were two main lines of thought regarding Brazil's joining the war: One, led by Ruy Barbosa, called for joining the Entente; another side was concerned about the bloody and fruitless nature of trench warfare, nurturing critical and pacifist feelings in the urban worker classes. Therefore, Brazil remained neutral in World War I until 1917. However, as denunciations of corruption exacerbated internal problems in the state, President Venceslau Brás began feeling the need to divert public attention from his government; this goal could be accomplished by focusing on an external enemy and thus stoking a sense of unity and patriotism.\nDuring 1917, the German Navy sank Brazilian civilian ships off the French coast, creating such an opportunity. On October 26 the government declared war on the Central Powers: Germany, Austria-Hungary, and the Ottoman Empire. Soon after, the navy was ordered to capture Central Powers' ships found on the Brazilian coast, and three small military groups were dispatched to the Western Front. The first group consisted of medical staff from the Army, the second consisted of Army sergeants and officers, and the third consisted of military aviators, both of Army and Navy. The Army's members were attached to the French Army, and the Navy's aviators to the British Royal Air Force. By 1918 all three groups were already in action in France.\nBy that time Brazil had also sent a Naval fleet, the Naval Division in War Operations or DNOG, to join the Allies' Naval Forces in the Mediterranean.\nDuring 1918, protests broke out against the military recruitment; this, in conjunction with the news of the ongoing revolution in Russia, only strengthened the isolationist sentiment among the Brazilian elites. In addition, the devastating advent of Spanish flu further prevented the Brás administration from getting involved more deeply. Ultimately, the armistice in November 1918 prevented the government from carrying out its plan for war. Despite its modest participation, Brazil gained the right to partake in the Paris Peace Conference.\nDecline and fall of the Old Republic, 1922-1930\nIn the early twentieth century, demographic changes and structural shifts in the economy threatened the primacy of the agrarian oligarchies. Under the Old Republic, the growth of the urban middle sectors, though slowed by dependency and entrenched oligarchy, was eventually strong enough to propel the middle class into the forefront of Brazilian political life. In time, growing trade, commerce, and industry in São Paulo undermined the domination of the republic's politics by the landed gentries of that state (dominated by the coffee industry) and Minas Gerais, dominated by dairy interests, known then by observers as the politics of café com leite; 'coffee with milk'.\n.]]\nEconomy\nLong before the first revolts of the urban middle classes to seize power from the coffee oligarchs in the 1920s, Brazil's intelligentsia and farsighted agro-capitalists, dreamed of forging a modern, industrialized society inspired by positivism— the \"world power of the future\". This sentiment was later nurtured throughout the Vargas years and under successive populist governments, before the 1964 military junta repudiated Brazilian populism. While these populist groups were somewhat ineffectual under the Old Republic, the structural changes in the Brazilian economy opened up by the Great War strengthened these demands.\nThe outbreak of World War I in August 1914 was the turning point for the dynamic urban sectors. Wartime conditions prevented Britain from exporting goods to Brazil, thus creating space for Brazil's domestic manufacturing sector to grow. These structural shifts in the Brazilian economy helped to increase the ranks of the new urban middle classes. Meanwhile, Brazil's manufacturers and those employed by them enjoyed these gains at the expense of the agrarian oligarchies. This process was further accelerated by the declining world demand for coffee during World War I. The central government, dominated by rural gentries, responded to falling world coffee demand by bailing out the oligarchs, reinstating the valorization program. Valorization, government intervention to maintain coffee prices by withholding stocks from the market or restricting plantings, had some successes in the short term; however, coffee demand plunged even more precipitously during the Great Depression, creating a decline too steep for valorization to reverse.\nParadoxically, economic crisis spurred industrialization and a resultant boost to the urban middle and working classes. The depressed coffee sector freed up the capital and labor needed for manufacturing finished goods. A chronically adverse balance of trade and declining rate of exchange against foreign currencies was also helpful; Brazilian goods were simply cheaper in the Brazilian market. The state of São Paulo, with its relatively large capital base, large immigrant population from Southern and Eastern Europe, and wealth of natural resources, led the trend, eclipsing Rio de Janeiro as the center of Brazilian industry. Industrial production, though concentrated in light industry (food processing, small shops, and textiles) doubled during the war, and the number of enterprises (which stood at about 3,000 in 1908) grew by 5,940 between 1915 and 1918. The war was also a stimulus for the diversification of agriculture. Growing wartime demand of the Allies for staple products— for instance, sugar, beans, and raw materials— sparked a new boom for products other than sugar or coffee. Foreign interests, however, continued to control the more capital-intensive industries, distinguishing Brazil's industrial revolution from that of the rest of the West.\nDemographic changes\nFrom 1875 until 1960, about 3 million Europeans emigrated to Brazil, settling mainly in the four southern states of São Paulo, Paraná, Santa Catarina, and Rio Grande do Sul. Immigrants came mainly from Portugal, Italy, Germany, Spain, Japan, Poland, and the Middle East. The world's largest Japanese community outside Japan is in São Paulo. In contrast, Brazil's indigenous population, located mainly in the northern and western border regions and in the upper Amazon Basin, continued to decline during this same period; largely due to the effects of contact with the outside world such as commercial expansion into the interior. Consequently, indigenous full-blooded Amerindians now constitute less than 1% of Brazil's population.\nSocio-economic Development\nWith manufacturing on the rise and the coffee oligarchs imperiled, the old order of café com leite and coronelismo eventually gave way to the political aspirations of the new urban groups: professionals, government and white-collar workers, merchants, bankers, and industrialists. Increasing support for industrial protectionism marked 1920s Brazilian politics with little support from a central government dominated by the coffee interests. Under considerable middle class pressure, a more activist, centralized state adapted to represent the interests that the new bourgeoisie had been demanded for years — one that could utilize a state interventionist policy consisting of tax breaks, lowered duties, and import quotas to expand the domestic capital base. Manufacturers, white-collar workers, and the urban proletariat alike had earlier enjoyed the respite of world trade associated with World War I. However, the coffee oligarchs, relying on the decentralized power structure to delegate power to their own patrimonial ruling oligarchies, were uninterested in regularizing Brazil's personalistic politics or centralizing power. Getúlio Vargas, leader from 1930 to 1945 and later for a brief period in the 1950s, would later respond to these demands.\nDuring this time period, the state of São Paulo was at the forefront of Brazil's economic, political, and cultural life. Known colloquially as a \"locomotive pulling the 20 empty boxcars\" (a reference to the 20 other states) and still today Brazil's industrial and commercial center, São Paulo led this trend toward industrialization due to the foreign revenues flowing into the coffee industry.\nProsperity contributed to a rapid rise in the population of recent working class Southern and Eastern European immigrants, a population that contributed to the growth of trade unionism, anarchism, and socialism. In the post-World War I period, Brazil was hit by its first wave of general strikes and the establishment of the Communist Party in 1922.\nMeanwhile, the divergence of interests between the coffee oligarchs— devastated by the Depression— and the burgeoning, dynamic urban sectors was intensifying. According to prominent Latin American historian Benjamin Keen, the task of transforming society \"fell to the rapidly growing urban bourgeois groups, and especially to the middle class, which began to voice even more strongly its discontent with the rule of the corrupt rural oligarchies\". In contrast, the labor movement remained small and weak (despite a wave of general strikes in the postwar years), lacking ties to the peasantry, who constituted the overwhelming majority of the Brazilian population. As a result, disparate social reform movements would crop up in the 1920s, ultimately culminating in the Revolution of 1930. The 1920s revolt against the seating of Artur Bernardes as president signaled the beginning of a struggle by the urban bourgeoisie to seize power from the coffee-producing oligarchy.\nThis era sparked the Tenente revolts as well. Junior military officers (tenentes, or lieutenants), who had long been active against the ruling coffee oligarchy, staged their own revolt in 1922 amid demands for various forms of social modernization, calling for agrarian reform, the formation of cooperatives, and the nationalization of mines. Though ultimately unsuccessful, the Tenente revolts illustrated the conflicts that would go on to underpin the Revolution of 1930.\nThe 1930 general election\nThe Great Depression set off the tensions that had been building in Brazilian society for some time, spurring revolutionary leaders to action.\nThe elections of 1930 pitted Júlio Prestes, of the pro-establishment Republican Party of São Paulo, against Getúlio Vargas, who led a broad coalition of middle-class industrialists, planters from outside São Paulo, and the reformist faction of the military known as the tenentes.\nTogether, these disparate groups made up the Liberal Alliance. Support was especially strong in the provinces of Minas Gerais, Paraíba and Rio Grande do Sul, because in nominating another Paulista to succeed himself, outgoing President Washington Luís had violated the traditional alternation between Minas Gerais and São Paulo. Vargas campaigned carefully, needing to please a large range of supporters. He used populist rhetoric and promoted bourgeois concerns. He opposed the primacy of São Paulo, but did not challenge the planters' legitimacy and kept his calls for social reform moderate.\nThe election itself was plagued by corruption and denounced by both sides: when the victory of Prestes with 57,7% of votes was declared, Vargas and the Liberal Alliance refused to concede defeat, sparking tensions in the country. On July 26, 1930, vice-presidential candidate João Pessoa of the Liberal Alliance was assassinated in Recife, sparking the beginning of the Brazilian Revolution.\nThe Revolution\nThe 1930 revolution began in Rio Grande do Sul on October 3 at 5:25pm. Osvaldo Aranha telegraphed Juarez Távora to communicate the beginning of the Revolution. It spread quickly through the country. Eight state governments in the northeast of Brazil were deposed by revolutionaries.\nOn the 10th of October, Vargas launched the manifesto, \"Rio Grande standing by Brazil\" and left, by rail, towards Rio de Janeiro, the national capital at the time.\nIt was expected that a major battle would occur in Itararé (on the border with Paraná), where the federal troops were stationed to halt the advance of the revolutionary forces, led by Colonel Góis Monteiro. However, on October 12 and 13, the Battle of Quatiguá took place (possibly the biggest fight of the revolution), although it has been little studied. Quatiguá is located to the east of Jaguariaíva, near the border between São Paulo state and Paraná. The battle did not occur in Itararé since the generals Tasso Fragoso and Mena Barreto and Admiral Isaiah de Noronha ousted President Washington Luís on October 24 and formed a joint government.\nAt 3pm on November 3, 1930, the junta handed power and the presidential palace to Getulio Vargas; the new administration abrogated the 1891 Constitution, dissolved the National Congress and started to rule by decree, ending the Old Republic and marking the beginning of the Vargas Era and subsequently the Second Brazilian Republic.\nPolitics\nAccording to the republican Constitution enacted in 1891, the government was a constitutional democracy, but democracy was nominal. In reality, the elections were rigged, voters in rural areas were pressured or induced to vote for the chosen candidates of their bosses (see coronelismo) and, if all those methods did not work, the election results could still be changed by one sided decisions of Congress' verification of powers commission (election authorities in the República Velha were not independent from the executive and the Legislature, dominated by the ruling oligarchs). This system resulted in the presidency of Brazil alternating between the oligarchies of the dominant states of São Paulo and Minas Gerais, who governed the country through the Republican Party of São Paulo (PRP) and the Republican Party of Minas Gerais (PRM). This regime is often referred to as \"café com leite\", 'coffee with milk', after the respective agricultural products of the two states.\nThe Brazilian republic was not an ideological offspring of the republics born of the French or American Revolutions, although the Brazilian regime would attempt to associate itself with both. The republic did not have enough popular support to risk open elections. It was a regime born of a coup d'état that maintained itself by force. The republicans made Deodoro president (1889–91) and, after a financial crisis, appointed Marshal Floriano Vieira Peixoto Minister of War to ensure the allegiance of the military.\nEconomy\nAround the start of the 20th century, the vast majority of the population lived in communities that were essentially semi-feudal in structure, though accumulating capitalist surpluses for overseas export. Because of the legacy of Ibero-American slavery, abolished as late as 1888 in Brazil, there was an extreme concentration of such landownership reminiscent of feudal aristocracies: 464 great landowners held more than 270,000 km2 of land (latifúndios), while 464,000 small and medium-sized farms occupied only 157,000 km2.\nAfter the Second Industrial Revolution in the advanced countries, Latin America responded to mounting European and North American demand for primary products and foodstuffs. A few key export products— coffee, sugar, and cotton— thus dominated agriculture. Because of specialization, Brazilian producers neglected domestic consumption, forcing the country to import four-fifths of its grain needs. As in most of Latin America, the economy around the start of the 20th century therefore rested on certain cash crops produced by the fazendeiros, large estate owners exporting primary products overseas who headed their own patriarchal communities. Each typical fazenda (estate) included the owner's chaplain and overseers, his indigent peasants, his sharecroppers, and his indentured servants.\nBrazil's dependence on factory-made goods and loans from the technologically and economically superior North Atlantic diminished its domestic industrial base. Farm equipment was primitive and largely non-mechanized; peasants tilled the land with hoes and cleared the soil through the inefficient slash-and-burn method. Meanwhile, living standards were generally squalid. Malnutrition, parasitic diseases, and a lack of medical facilities limited the average life span in 1920 to twenty-eight years. Because of the comparative advantage system and lack of an open market, Brazilian industries could not compete against the technologically superior Anglo-American economies. In this context the Encilhamento (a Boom & Bust process that first intensified, and then crashed, in the years between 1889 and 1891) occurred, the consequences of which were felt in all areas of the Brazilian economy throughout the subsequent decades.[9]\nThe middle class was not yet active in political life. The patron-client political machines of the countryside enabled the coffee oligarchs to dominate state structures to their advantage, particularly the weak central state structures that effectively devolved power to local agrarian oligarchies.\nDuring this period, Brazil did not have a significantly integrated national economy. Rather, Brazil had a grouping of regional economies that exported their own specialty products to European and North American markets. The absence of a big internal market with overland transportation, except for the mule trains, impeded internal economic integration, political cohesion and military efficiency. The regions, \"the Brazils\" as the British called them, moved to their own rhythms. The Northeast exported its surplus cheap labor and saw its political influence decline as its sugar lost foreign markets to Caribbean producers. The rubber boom in Amazônia lost its world primacy to efficient Southeast Asian colonial plantations after 1912. The nationally oriented market economies of the South were not dramatic, but their growth was steady and by the 1920s allowed Rio Grande do Sul to exercise considerable political leverage. Real power resided in the coffee-growing states of the Southeast— São Paulo, Minas Gerais, and Rio de Janeiro— which produced the most export revenue. Those three and Rio Grande do Sul harvested 60% of Brazil's crops, turned out 75% of its industrial and meat products, and held 80% of its banking resources.\nDemographics\nFrom 1875 until 1960, about 3 million Europeans emigrated to Brazil, settling mainly in the four southern states of São Paulo, Paraná, Santa Catarina, and Rio Grande do Sul. Immigrants came mainly from Portugal, Italy, Germany, Spain, Japan, Poland, and the Middle East. The world's largest Japanese community outside Japan is in São Paulo. In contrast, Brazil's indigenous population, located mainly in the northern and western border regions and in the upper Amazon Basin, continued to decline during this same period; largely due to the effects of contact with the outside world such as commercial expansion into the interior. Consequently, indigenous full-blooded Amerindians now constitute less than 1% of Brazil's population.\nReferences\nBibliography\nEnglish Sources\n*\n*\n*\n*\n*\n*\n*\n*\nPortuguese Sources\n* (Portuguese)\n*Cardim; Carlos Henrique (2007) \"A Raiz das Coisas. Rui Barbosa: o Brasil no Mundo\" (in Portuguese) Civilização Brasileira\nExternal links\n* Frederik Schulze: \"[https://encyclopedia.1914-1918-online.net/article/brazil/ Brazil]\", in: 1914-1918-online. International Encyclopedia of the First World War."
    }
  ]
}