{
  "content": [
    {
      "type": "text",
      "text": "# First Serbian–Ottoman War\n\n)\n| place             = Serbia\n| result            = Indecisive\n| territory         = Status quo ante bellum\n| combatant1        =\n| combatant2        =\n| commander1        =  František Zach\n* Đura Horvatović\n* Mihailo Ilić\n* Ranko Alimpić\n* Milojko Lešjanin\n* Nićifor Dučić\n* Mikhail Chernyayev\n}}\n| commander2        =  Osman Nuri\n* Süleyman Hüsnü\n* Mehmed Ali\n}}\n| strength1         = 130,000 with 160 guns\n| strength2         = 153,000 with 192 guns\n| casualties1       = 6,000 killed, 9,500 wounded\n| casualties2       = 1,000+ killed, 6,000+ wounded\n}}\nThe First Serbian–Ottoman War (), was a military conflict fought by the Principality of Serbia against the Ottoman Empire. Serbia declared war on the Ottoman Empire on 30 June 1876, during the Herzegovina Uprising. A Serbian south- and westward offensive was repulsed by Ottoman troops after just three weeks of fighting, upon which Turkey then invaded Serbia proper. Eastern Serbia was quickly occupied, but on the southern front the Serbian army successfully stopped the Ottoman advance, defending the fortified positions around Aleksinac for more than two months.\nThe Russian Empire brokered a ceasefire in autumn of 1876 by threatening military intervention, and the European Great Powers then organized the Constantinople Conference to settle the war and wider issues in the Balkans. Peace was signed on 28 February 1877 on the basis of status quo ante bellum.\nSerbian offensive\nOn July 2, 1876, all four major Serbian armies crossed the border into the Ottoman territory, hoping to inspire massive popular uprisings of the local Christian population. However, local support was mostly absent: in all, no more than 3,000 Ottoman Christian rebels joined the Serbian army, which was not enough to make a difference.\nOn the western border, a Serbian army of about 20,000 men crossed the Drina river and invaded Bosnia, but was unable to take Bijeljina and retreated back to Serbia after several days.\nFurther south, another Serbian army of about 11,500 men marched on Sjenica and Novi Pazar, but was defeated in the first Battle of Kalipolje and forced to retreat to Javor mountain, where it fought several defensive battles till the end of the war.\nOn the eastern border, another Serbian army of about 25,000 troops invaded Ottoman Bulgaria and advanced on Kula, but was quickly outmaneuvered by the Ottoman army from Vidin with 10,000 troops, who then went on the offensive into Serbian territory and took Veliki Izvor near Zaječar on July 3. The Serbian Eastern Army was immediately forced to go on defensive, and the Serbian High Command sent orders to the Serbian Army of the South, made up of 68,000 men to reinforce it, aborting the main Serbian offensive on the southern border, aimed on Niš, after only a few days. However, Serbian attempts to push the Ottomans back on the eastern border failed with a decisive defeat at Veliki Izvor (6–11 July).\nOttoman offensive\nAfter the Ottoman victory at Veliki Izvor, the Serbian eastern and southern armies were pushed back (July 15–August 6), and the Ottoman forces took Zaječar and Knjaževac. However, the Ottoman eastern army was unable to push further into Serbia proper on the eastern front, due to the very rough and impassable mountain terrain of the eastern Serbia. In fact, although the Ottomans successfully occupied the Timok Valley, the only route from there into Serbia was through but two mountain passes (Čestobrodica and Bovan Gorge near Sokobanja), which were already fortified and heavily defended by the Serbian Eastern army. So the main Ottoman army (some 60,000 strong) had to attack from the south, from its base at Niš through the Morava Valley.\nHowever, the Serbian southern border and the Morava Valley were defended by heavily fortified towns of Aleksinac and Deligrad, which was also the base of the main Serbian army, some 68,000 strong, with more than 100 pieces of artillery. So the first Ottoman attack on Aleksinac (on August 23) was soundly beaten back in the Battle of Šumatovac. Realising that the main Serbian fortifications in Aleksinac (on the eastern bank of the Morava) were too strong to breach, the Ottoman command sent the bulk of its forces on the western bank of the Morava, where Serbian fortifications were few and far between. So, on the western bank of the Morava, Ottoman forces successfully beat the Serbian army back in the battles of Adrovac (September 1), Krevet (October 1) and Veliki Šiljegovac (October 19). After the fall of Đunis on October 29, the last Serbian fortification on the western bank of the Morava, the Serbian southern front was effectively breached.\nCeasefire and peace\nIt was at this point that the Russian Empire intervened offering an ultimatum to the Porte to grant both Serbia and Montenegro an armistice within 48 hours or face Russian military intervention. Such an armistice lasting for two months was granted on 1 November 1876 and subsequently extended until 1 March 1877, when a definitive peace treaty was signed between the Ottoman Empire and the Serbia. The treaty preserved the status quo ante bellum. Serbia gained no territory, but was not forced to cede anything either or pay a war indemnity.\nAnnotations\nReferences\nSources\n*\n*\n*\n*\n*\n*\n*\nFurther reading\n*\n*\n*\n*\n*\n*"
    }
  ]
}