{
  "content": [
    {
      "type": "text",
      "text": "# First Battle of Dalton__disambig_1\n\n&ndash;\n|place= Whitfield County, Georgia\n|casus=\n|territory=\n|result=Confederate victory\n|combatant1= United States of America (Union)\n|combatant2= Confederate States of America\n|combatant3=\n|commander1= George H. Thomas\n|commander2= Joseph E. Johnston\n|commander3=\n|units1= Army of the Cumberland\n|units2= Army of Tennessee\n|strength1 = 25,000\n|strength2 = 40,000\n|casualties1= 300\n|casualties2= 140\n|notes=\n}}\nThe First Battle of Dalton was a series of American Civil War skirmishes that took place between February 22 and February 27, 1864, in Whitfield County, Georgia.\nBattle\n.]]\nAt the suggestion of Union Major General Ulysses S. Grant, Major General George H. Thomas, decided to probe General Joseph E. Johnston's strength to determine if the loss of two full divisions to reinforce Confederate forces elsewhere had made the Confederate Army of Tennessee vulnerable to Union attack. On February 22, Thomas began the reconnaissance movement, which consisted of three columns of Union troops. After several days of intense skirmishing, Thomas's army retreated, since it was obvious that Johnston was still capable of repelling a major Union assault. Thomas's force had lost 300 officers and men killed or wounded, against 140 men for the Confederates.\nBattlefield condition\nMuch of the battlefield landscape has been compromised by Interstate 75, development along US Route 41, the growth of the City of Dalton, and subdivision of the Crow Valley and Tunnel Hill areas.\n}}\nExternal links\n* [https://www.nps.gov/civilwar/search-battles-detail.htm?battleCode=ga006 National Park Service battle description]\n* [https://web.archive.org/web/20120907080512/http://www.nps.gov/hps/abpp/CWSII/GeorgiaBattlefieldProfiles/Adairsville%20to%20Davis%20Cross%20Roads.pdf CWSAC Report Update and Resurvey: Individual Battlefield Profiles]\n*[http://www.history.com/this-day-in-history/battle-of-dalton-georgia-begins History.com]\n*[http://www.daltondailycitizen.com/news/local_news/civil-war-anniversary-the-battles-for-dalton-feb--/article_570f0d57-60c1-54e1-bcba-a9796657e1aa.html Jenkins, Robert, \"Civil War anniversary: The Battles for Dalton Feb. 24-26 and May 7-12, 1864,\" 150th Civil War Commission, The Daily Citizen.]\n*[https://texashistory.unt.edu/ark:/67531/metapth152618/ The War of the Rebellion: A Compilation of the Official Records of the Union And Confederate Armies. Series 1, v.32, pt.1 (Reports)]"
    }
  ]
}