{
  "content": [
    {
      "type": "text",
      "text": "# FIVB Senior World Rankings\n\nThe FIVB Senior World Rankings is a ranking system for men's and women's national teams in volleyball. The teams of the member nations of Fédération Internationale de Volleyball (FIVB), volleyball's world governing body, are ranked based on their game results with the most successful teams being ranked highest. A points system is used, with points being awarded based on the results of all FIVB-recognised full international matches. The rankings are used in international competitions to define the seeded teams and arrange them in pools. Specific procedures for seeding and pooling are established by the FIVB in each competition's formula, but the method usually employed is the serpentine system.\nThe ranking system has been revamped in 2020, responding to criticism that the preceding calculation method did not effectively reflect the relative strengths of the national teams. The old version of the ranking system was finally used on 31 January 2020.\nAs of 8 January 2025, the highest ranked team in the men's category is Poland, while in the women's category is Italy.\nPrevious calculation method\nThe system of point attribution for the selected FIVB World and Official Competitions below is as follows:\n*Olympic Games and qualifying tournaments: included for 4 years and points are also granted for the qualification matches, to the best non-qualified teams.\n*World Championship and qualifying tournaments: included for 4 years and points are also granted for the qualification matches, to the best non-qualified teams.\n*World Cup: included for 4 years\n*World Grand Prix: included for 1 year\n*World League: included for 1 year\nCurrent calculation method\nIn 2019, FIVB collaborated with Hypercube Business Innovation of the Netherlands to design a new world ranking platform. The previous calculation method had a problem of circularity in the international volleyball calendar: only countries who participated in the major volleyball events could earn ranking points, whilst the number of ranking points of countries also determined the seeding and access to major events. This unfair principle did not contribute to the sporting and commercial quality of volleyball.\nOn 1 February 2020, the new ranking system was implemented and took into account all results from 1 January 2019 and later. The system is consistently updated to reflect the latest results and performances. The ranking considers the match results from:\n*Olympic Games and qualifying tournaments\n*FIVB World Championship\n*FIVB World Cup\n*FIVB Nations League and Challenger Cup\n*Confederations' Championship and qualifying tournaments\n*Annual Official Continental Confederations' Events\n*Annual Official Zonal Associations' Events\nNotes:\n*Olympic qualifying tournaments, FIVB World Cup and FIVB Challenger Cup are discontinued tournaments (as of 2025).\n*Official competitions must feature a minimum of four senior national teams to be eligible for world ranking points.\n*Matches played in multi-sport events, friendly matches or unofficial competitions are not eligible for world ranking points.\n*From 2023: Matches from Annual Continental and Zonal Events are not considered for the world ranking if they involve teams that are also participating in the FIVB Volleyball Nations League (VNL) in the same year.\n*From 2025: Each Continental Confederation may include up to two Annual Continental Events in the world ranking.\n*From 2025: Each Zonal Association may include one Annual Zonal Event in the world ranking.\nThe rankings outcome of each match depends on two main factors:\n*The playing strength of the teams competing.\n*The actual match performance or final result of the match.\nRanking Procedure\nIt is based on the zero-sum system, like CONCACAF Ranking Index or FIFA World ranking, where, after each game, points will be added to or subtracted from a team's rating according to the formula:\n:S_\\text{after} = S_\\text{before} + {K(R-E) \\over 8}\nwhere:\n*S_\\text{after} – the team's number of World Ranking scores  after the game\n*S_\\text{before} – the team's number of World Ranking scores  before the game\n*K – the match weight factor; see below\n*R – the result of the game depended on match and sets won (3–0, 3–1, 3–2, 2–3, 1–3 or 0–3); see below\n*E – the expected result of the game has the value between -2 and +2.  If the match is completely balanced, the expected result is 0. The bigger the surprise, the more points are transferred; see below for calculation details.\nA key principle of the world ranking is that a team winning a match cannot lose ranking points and a team losing a match cannot gain ranking points. Hence, if a team wins a match but the result is lower than expected, with R, the team will be rewarded with the minimum ranking points (0.01), i.e.\n:S_\\text{after} = S_\\text{before} + 0.01\nThe team that lost the match will instead lose the minimum ranking points (0.01), i.e.\n:S_\\text{after} = S_\\text{before} - 0.01\nMatch weight factor\nThe match weight factor is set to reflect the prestige of the tournament. In 2025, FIVB changed the match weight factors for some events:\n{| class=\"wikitable\"\n|-\n! rowspan=2 | Event !! colspan=2 | Match weight factor (K)\n|-\n! 2019–2024 !! 2025–\n|-\n| Annual Official Zonal Events || style=\"text-align: center;\" | – || style=\"text-align: center;\" | 30.0\n|-\n| Annual Official Continental Events || style=\"text-align: center;\" | 10.0 || style=\"text-align: center;\" | 30.0\n|-\n| Continental Championship qualifying || style=\"text-align: center;\" | 17.5 || style=\"text-align: center;\" | –\n|-\n| FIVB Challenger Cup || style=\"text-align: center;\" | 20.0 || style=\"text-align: center;\" | –\n|-\n| Olympic Games qualifying / FIVB World Cup || style=\"text-align: center;\" | 35.0 || style=\"text-align: center;\" | –\n|-\n| Continental Championship || style=\"text-align: center;\" | 35.0 || style=\"text-align: center;\" | 40.0\n|-\n| FIVB Nations League || style=\"text-align: center;\" | 40.0 || style=\"text-align: center;\" | 40.0\n|-\n| FIVB World Championship || style=\"text-align: center;\" | 45.0 || style=\"text-align: center;\" | 50.0\n|-\n| Olympic Games || style=\"text-align: center;\" | 50.0 || style=\"text-align: center;\" | 50.0\n|}\nMatch result\nWe set the result  R=R_n, where n is the index of the actual result (set score)\n*n=1 – A win 3–0\n*n=2 – A win 3–1\n*n=3 – A win 3–2\n*n=4 – A lose 2–3\n*n=5 – A lose 1–3\n*n=6 – A lose 0–3\n{| class=\"wikitable\" style=\"font-size: 100%; text-align: center;\"\n!Match Result || R_n || P_n\n|-\n|style=\"text-align: left;\"|A win 3–0  ||+2   || P\\text{1}\n|-\n|style=\"text-align: left;\"|A win 3–1  ||+1.5 || P\\text{2}\n|-\n|style=\"text-align: left;\"|A win 3–2  ||+1   || P\\text{3}\n|-\n|style=\"text-align: left;\"|A lose 2–3 ||-1   || P\\text{4}\n|-\n|style=\"text-align: left;\"|A lose 1–3 ||-1.5 || P\\text{5}\n|-\n|style=\"text-align: left;\"|A lose 0–3 ||-2   || P\\text{6}\n|}\nExpected match result\nThe expected results is then calculated as\nE = R_1 P_1 + R_2 P_2 + R_3 P_3 + R_4 P_4 + R_5 P_5 + R_6 P_6\nwhere P_n is the probability of the outcome R_n obtained using the following model (known as Ordered probit):\n;Team A win 3–0\n: P_\\text{1} = \\Phi(C_\\text{1}+\\Delta)\n;Team A win 3–1\n: P_\\text{2} = \\Phi(C_\\text{2}+\\Delta) - \\Phi(C_\\text{1}+\\Delta)\n;Team A win 3–2\n: P_\\text{3} = \\Phi(C_\\text{3}+\\Delta) - \\Phi(C_\\text{2}+\\Delta)\n;Team A lose 2–3\n: P_\\text{4} = \\Phi(C_\\text{4}+\\Delta) - \\Phi(C_\\text{3}+\\Delta)\n;Team A lose 1–3\n: P_\\text{5} = \\Phi(C_\\text{5}+\\Delta) - \\Phi(C_\\text{4}+\\Delta)\n;Team A lose 0–3\n: P_\\text{6} = 1- \\Phi(C_\\text{5}+\\Delta)\nwhere \\Phi(z) is the Cumulative distribution function of the Normal distribution, and\nC_1,\\ldots, C_5  are the cut-points\n*C_1=-1.06\n*C_2=-0.394\n*C_3=0\n*C_4=0.394\n*C_5=1.06\nset so that P_n is the probability of the outcome n between two equal strength opponents (that is when \\Delta=0), which is derived from the actual match results of the past decade.\nThe parameter \\Delta represents the scaled difference of the teams rankings\n: \\Delta = {8(S_\\text{teamA}-S_\\text{teamB}) \\over 1000}\nwhere:\n*S_\\text{teamA} – the team A's number of World Ranking scores before the game\n*S_\\text{teamB} – the team B's number of World Ranking scores before the game\nExamples\nBefore the match at the FIVB Volleyball World Championship (K = 50), Brazil (Team A) is ranked number 1 with a 415 WR score and Japan (Team B) is ranked number 11 with a 192 WR score.\n;Strength difference between Brazil and Japan\n: \\Delta = {8(415-192) \\over 1000} = 1.784\n;Expected match result\n*P_1 = \\Phi(-1.060+1.784)\n*P_2 = \\Phi(-0.364+1.784) - \\Phi(-1.060+1.784)\n*P_3 = \\Phi(0.000+1.784) - \\Phi(-0.364+1.784)\n*P_4 = \\Phi(0.364+1.784) - \\Phi(0.000+1.784)\n*P_5 = \\Phi(1.060+1.784) - \\Phi(0.364+1.784)\n*P_6 = 1 - \\Phi(1.060+1.784)\nExpected match result for Brazil:\n: E = 76.5%(+2) + 15.2%(+1.5) + 4.5%(+1) + 2.2%(-1) + 1.2%(-1.5) + 0.2%(-2) = +1.76\nExpected match result for Japan:\n: E = 0.2%(+2) + 1.2%(+1.5) + 2.2%(+1) + 4.5%(-1) + 15.2%(-1.5) + 76.5%(-2) = -1.76\n;World Ranking scores after Brazil win 3–0\nWorld Ranking scores for Brazil:\n:S_\\text{after} = \\text{415} + {50(2-1.76) \\over 8} = 416.5\nWorld Ranking scores for Japan:\n:S_\\text{after} = \\text{192} + {50(-2+1.76) \\over 8} = 190.5\n;World Ranking scores after Brazil win 3–1\nWorld Ranking scores for Brazil:\n:R=1.5 and E=1.76, thus R so\n:S_\\text{after} = \\text{415} + 0.01 = 415.01\nWorld Ranking scores for Japan:\n:R=-1.5 and E=-1.76, thus R>E so\n:S_\\text{after} = \\text{192} - 0.01 = 191.99\n;World Ranking scores after Brazil win 3–2\nWorld Ranking scores for Brazil:\n:R=1 and E=1.76, thus R so\n:S_\\text{after} = \\text{415} + 0.01 = 415.01\nWorld Ranking scores for Japan:\n:R=-1 and E=-1.76, thus R>E so\n:S_\\text{after} = \\text{192} - 0.01 = 191.99\n;World Ranking scores after Brazil lose 0–3\nWorld Ranking scores for Brazil:\n:S_\\text{after} = \\text{415} + {50(-2-1.76) \\over 8} = 391.5\nWorld Ranking scores for Japan:\n:S_\\text{after} = \\text{192} + {50(2+1.76) \\over 8} = 215.5\n;World Ranking scores after Brazil lose 1–3\nWorld Ranking scores for Brazil:\n:S_\\text{after} = \\text{415} + {50(-1.5-1.76) \\over 8} = 394.63\nWorld Ranking scores for Japan:\n:S_\\text{after} = \\text{192} + {50(1.5+1.76) \\over 8} = 212.38\n;World Ranking scores after Brazil lose 2–3\nWorld Ranking scores for Brazil:\n:S_\\text{after} = \\text{415} + {50(-1-1.76) \\over 8} = 397.75\nWorld Ranking scores for Japan:\n:S_\\text{after} = \\text{192} + {50(1+1.76) \\over 8} = 209.25\nInactive teams\nEvery year on 1 January, the teams that have not played any matches that counts towards the world ranking in the previous two years lose 50 ranking points. The inactive teams with less than 20 ranking points are removed from the official ranking list.\nPreviously, teams were considered inactive after one year without participating in competitions eligible for ranking points. This was extended to two years in 2025.\nWorld and Continental Rankings\nThe five Continental Rankings filter the World Ranking points won and lost in matches played between teams from the same Continental Confederation.\n*Intercontinental Tournaments – calculated in World Rankings, but some matches can be calculated in Continental Rankings\n**Olympic Games final and intercontinental qualification tournaments\n**FIVB World Championship final and intercontinental qualification tournaments\n**FIVB World Cup\n**FIVB Volleyball Nations League and Challenger Cup\n**some Continental Cups: Pan-America\n**some FIVB recognised international events, e.g. Pan American Games, Montreux Volley Masters\n*Continental Tournaments – calculated in World and Continental Rankings\n**Olympic Games continental qualification tournaments\n**FIVB World Championship continental qualification tournaments\n**FIVB Challenger Cup qualification tournaments\n**Continental Championships: Asia (AVC), Africa (CAVB), Europe (CEV), North America (NORCECA), and South America (CSV)\n**some Continental Cups: Asia (both AVC Cup and Challenge Cup)\n**Zonal Championships, e.g. Eastern Asia, ASEAN, Central America\n**some FIVB recognised international events, e.g. African Games, Asian Games, European Games\n;Examples\nJapan (Asian Volleyball Confederation) vs Italy (Confédération Européenne de Volleyball)\nThe points calculated in FIVB World Rankings.\nJapan (Asian Volleyball Confederation) vs South Korea (Asian Volleyball Confederation)\nThe points calculated in FIVB World Rankings, and AVC Continental Rankings.\nFIVB World Rankings\nCurrent men's top teams\nCurrent women's top teams\nHistoric men's leaders\nFor historical men's FIVB rankings from October 2005 to present.\nHistoric women's leaders\nFor historical women's FIVB rankings from September 2005 to present.\nSee also\n*FIVB Senior Continental Rankings\n*FIVB Youth and Junior World Rankings\nNotes and references\n*"
    }
  ]
}