{
  "content": [
    {
      "type": "text",
      "text": "# Flag of the Kirghiz Soviet Socialist Republic\n\n| Article =\n| Nickname =\n| Image = Flag of the Kyrgyz Soviet Socialist Republic.svg\n| Use = 110000\n| Symbol =\n| Proportion = 1:2\n| Adoption = 22 December 1952\n| Design = A red field with a golden hammer and sickle and a gold-bordered red star in its upper canton with two navy blue bars and a white stripe in the middle of the flag.\n| Designer = Truskovsky Lev Gavrilovich\n| Imagetext2 = Reverse side of the flag after 1980.\n| Image2 = Flag of the Kirghiz Soviet Socialist Republic (reverse).svg\n| Nickname2 =\n| Use2 = Reverse flag\n| Symbol2 =\n| Proportion2 = 1:2\n| Adoption2 =\n| Design2 =\n| Designer2 =\n}}\nThe flag of the Kirghiz SSR was adopted by the Presidium of the Supreme Council of the Kirghiz SSR decreed by its Decree on 22 December 1952. The 1978 constitution of the Kirghiz SSR states that the ratio of the flag is 1:2 with the blue/white/blue stripes in the middle taking  of the flag height and the white stripes  of flag height.\nAccording to the constitution in detail in article 168:\n}}\nThe flag differences from the flag of the Soviet Union and the flags of the Soviet Republics was a larger star (in comparison with the image of the sickle and hammer) and the location of the hammer and sickle practically on the border of the red and blue stripes: on the flags of all other republics (except for Georgia and Turkmenia), the diameter of the circle into which the 5-terminal star was inscribed was exactly half the size of the side of the square in which the sickle and hammer were inscribed, and on the flag of Kirghizia, the diameter of the star (1/10 of the width of the flag) was more than half Side of the square (1/6 of the width of the flag).\nHistory\nAfter the formation of the Kirghiz SSR on 5 December 1936 the first flag of the Kirghiz SSR was adopted.\nThe first variant of the flag used the Latin version of the Kyrgyz alphabet. This flag was in use from 1937 to 1940.\nFlag of the Kirghiz SSR (1936–1940)\n|File:Flag of the Kirghiz Soviet Socialist Republic (1936–1940, variant).svg| Variant flag of the Kirghiz SSR (1936–1940)\n}}\nAfter the adoption of the Cyrillic alphabet new flag design was created.\nFlag of the Kirghiz SSR (1940–1952)\n}}\nOn 22 December 1952, the red flag was replaced with a new red flag with a blue and white stripes in the middle of the entire length of the flag.\nAfter independence, this flag remained the flag of the newly independent Kyrgyzstan until 1992 when a new flag was introduced.\nColours\n{| class=\"wikitable\" width=\"600px\" border=\"1\" cellpadding=\"2\" cellspacing=\"0\" style=\"background: #f9f9f9; border: 1px solid #aaaaaa; border-collapse: collapse; white-space: nowrap; text-align: left\"\n|- style=\"text-align: center; background: #eee\"\n! (1952–1992)\n!style=\"background:#FFFFFF; color:#000; width:150px\"| White\n!style=\"background:#CE0000; color:#FFF; width:150px\"| Red\n!style=\"background:#FFD800; color:#000; width:150px\"| Yellow\n!style=\"background:#001B99; color:#FFF; width:150px\"| Blue\n|-\n| Pantone\n| Safe\n| 3546c\n| 115c\n| 2746c\n|-\n| CMYK\n| 0-0-0-0\n| 0-100-100-19\n| 0-15-100-0\n| 100-82-0-40\n|-\n| RGB\n| 255-255-255\n| 206-0-0\n| 255-216-0\n| 0-27-153\n|-\n| Hexadecimal\n| #FFFFFF\n| #CE0000\n| #FFD800\n| #001B99\n|}\nSee also\n* Flag of the Soviet Union\n* Coat of arms of the Kirghiz Soviet Socialist Republic\n* Flag of Kyrgyzstan\nReferences\nde:Flagge Kirgisistans#Geschichte"
    }
  ]
}