{
  "content": [
    {
      "type": "text",
      "text": "# Flag of the Abkhaz Autonomous Soviet Socialist Republic\n\nThe flag of the Abkhaz Autonomous Soviet Socialist Republic was adopted in 1951 by the republic's government. Its primary visual features are identical to those of the flag of the Georgian Soviet Socialist Republic. A later version of the flag includes a gold inscription under the canton of the republic's name.\nHistory\nOn 7 January 1935, the Abkhaz ASSR adopted a new constitution. Its flag is described in article 84 of the constitution:\n}}\nAnother version of the constitution, in Russian, describes the inscription as АССР rather than ASSR. On 2 August 1937, the 8th All-Abkhazian Congress of Soviets approved the constitution. Its two original versions, in Abkhaz and Russian, had different descriptions of the flag:\n{| class=\"wikitable\"\n|+ Constitution of the Abkhaz ASSR\n! Abkhaz version !! Russian version\n|-\n|The state flag of the Abkhaz Autonomous Soviet Socialist Republic is the flag of the Georgian Soviet Socialist Republic. The flag consists of a red cloth; in the upper left corner of the square, the sides of which are equal to a quarter of the entire length of the cloth, \"Georgian SSR\" is inscribed in Georgian, Abkhaz and Russian. Below it is the inscription \"Abkhaz ASSR\" in Georgian, Abkhaz and Russian.\n|The state flag of the Abkhaz Autonomous Soviet Socialist Republic is the flag of the Georgian Soviet Socialist Republic, which consists of a red cloth; in the upper left corner of the square, the sides of which are equal to a quarter of the entire length of the cloth, \"Georgian SSR\" is inscribed in gold in Georgian, Abkhaz and Russian.\n|}\nIn 1938, the Abkhaz writing system was changed from Cyrillic script to an alphabet based on Georgian scripts. The Abkhaz inscription on the flag was also changed.\nAfter the adoption of a new flag by the government of the Georgian SSR in 1951, it became the national flag of the Abkhaz ASSR by decree of its Supreme Council on 26 April of that year. There were no additional inscriptions on the flag. Its design was reconfirmed in the Regulations on the State Flag of the Abkhaz ASSR (approved on 31 March 1956) and, with changes, on 28 April 1971 and 3 November 1978.\nOn 3 November 1978, the Abkhaz government changed the first article in the Regulations on the State Flag of the Abkhaz ASSR; under the blue square, \"Аҧсны АССР\" was inscribed. On 21 July 1981, a decree approved new Regulations on the State Flag of the Abkhaz ASSR. The regulations stipulated the size of the inscription: one line of separated letters, one-tenth of the flag's width. A 29 August 1981 resolution by the Abkhaz Council of Ministers adopted an Instruction on the Application of the Regulations on the State Flag of the Abkhaz ASSR.\nGallery\nFlag of SSR Abkhazia.svg|alt=Red flag with hammer, sickle, star and Cyrillic CCPA|7 January 1935 - 2 August 1937, based on the constitution's Russian version\nFlag of the Abkhaz ASSR (1935-1937).svg|alt=Latin-alphabet ASSRA|Same flag, based on the Abkhaz version of the constitution\nFlag of the Abkhaz ASSR (1937-1938), variant 1.svg|alt=No hammer, sickle or star; Georgian and Cyrillic inscriptions|2 August 1937 - 1938\nFlag of the Abkhaz ASSR (1937-1938), variant 2.svg|alt=More inscriptions, emphasising Cyrillic|2 August 1937 - 1938\nFlag of the Abkhaz ASSR (1938-1951), variant 1.svg|alt=Georgian script emphasised|1938 - 26 April 1951\nFlag of the Abkhaz ASSR (1938-1951), variant 2.svg|alt=More inscriptions, again emphasising Georgian|1938 - 26 April 1951\nFlag of the Georgian Soviet Socialist Republic.svg|alt=Red-and-blue Georgian SSR flag|26 April 1951 - 3 November 1978\nFlag of the Abkhaz ASSR.svg|alt=Same as Georgian flag, with \"Abkhaz ASSR\" inscribed|3 November 1978 - 23 July 1992 (adoption of the Flag of Abkhazia)\nReferences\nSee also\n*Emblem of the Abkhaz Autonomous Soviet Socialist Republic\n*Flag of Abkhazia\n*Flag of the Georgian Soviet Socialist Republic"
    }
  ]
}