{
  "content": [
    {
      "type": "text",
      "text": "# Flag of the Latvian Soviet Socialist Republic\n\n| Imagetext = Flag of the Latvian SSR (1953–1990)\n| Image = Flag of the Latvian Soviet Socialist Republic.svg\n| Noborder =\n| Use = 110110\n| Symbol =\n| Proportion = 1:2\n| Adoption = 17 January 1953\n| Design = A plain red flag with a golden hammer and sickle and a gold-bordered red star in its upper canton with the blue and white rippling water at the bottom.\n| Designer =\n| Imagetext2 = Reverse flag\n| Image2 =  Flag of the Latvian Soviet Socialist Republic (1953–1990, reverse).svg\n| Noborder2 =\n| Use2 = Reverse flag\n| Symbol2 =\n| Proportion2 = 1:2\n| Adoption2 =\n| Design2 =A red field with a blue-white wave pattern on the bottom.\n| Designer2 =\n}}\nThe flag of the Latvian Soviet Socialist Republic shows a yellow hammer and sickle and outlined star on a red field above rippling water at the bottom, and was adopted by the former Latvian Soviet Socialist Republic on January 17, 1953.\nHistory\nThe first socialist Latvian state, the Latvian Socialist Soviet Republic, shown a red flag with the inscription LSPR.\nPrior to this, from 25 August 1940, the flag was red with the gold hammer and sickle in the top-left corner, with the Latin characters LPSR (Latvijas Padomju Sociālistiskā Republika) above them in gold in a serif font.\nThe Soviet-era flag was officially replaced on 27 February 1990, when the national flag of Latvia was reintroduced. Since 2013, the use of a Latvian SSR flag at public events is banned.\nGallery\nFlag of Latvian SSR (1918-1920).svg|Flag of the Latvian SSR (1918–1920)\nFlag of Latvian SSR (1940).svg|Flag of the Latvian SSR (1940–1953)\nFlag of the Latvian Soviet Socialist Republic (1953–1967, variant).svg|Early variant of the flag of the Latvian SSR (1953–1967)\nFile:Flag of the Latvian Soviet Socialist Republic.svg|Flag of the Latvian SSR (1953–1990)\nSee also\n* Coat of arms of the Latvian SSR\n* Flag of the Soviet Union\n* Flag of Latvia\nReferences"
    }
  ]
}