{
  "content": [
    {
      "type": "text",
      "text": "# Flo-Bert Award\n\nThe Flo-Bert Award honors \"outstanding figures in the field of tap dance\".\nHistory\nNamed for eminent African-American performers Florence Mills and Bert Williams, the awards began in 1991. Flo-Bert, Ltd, the non-profit organization that makes the selections, was founded by historian and researcher Delilah Jackson in 1989. The organization is sponsored by the New York Foundation for the Arts.\nThe Flo-Bert Award is given annually. Honorees include Gregory Hines, Cab Calloway, Gene Kelly, Savion Glover, and the Nicholas Brothers. The award is meant to recognize life achievement in performing, teaching or supporting the art of tap dance.\nThe organization holds an awards show, The Tap Extravaganza. It is produced by The New York Committee to Celebrate National Tap Dance Day.\nHonorees\n:listed alphabetically; year of award indicated\n*Jerry Ames, founder and artistic director of Jerry Ames Tap Dance Company; 2006\n*Maceo Anderson, original member of The Four Step Brothers, early innovator of the acrobatic tap style; 1994\n*Cholly Atkins, partner of Charles \"Honi\" Coles; Motown choreographer; 1993\n*Bob Audy; 2007\n*Jean Bach; 2008\n*Clayton \"Peg Leg\" Bates; 1991\n*John Bedford; 2006\n*Phil Black; 1996\n*Bunny Briggs; 1999\n*Ernest \"Brownie\" Brown, member of the Hoofer's Club, original member of The Original Copasetics, half of vaudeville duo Cook and Brown; 2003\n*Brenda Bufalino, creator and choreographer for the American and International Tap Dance Orchestras; 1999\n*Cab Calloway, dancer and bandleader; 1992\n*Lon Chaney; 1991\n*The Cotton Club Girls; 1992\n*Harold Cromer, Stumpy of the tap team Stump and Stumpy; 2005\n*Stanley Donen, film director (Singing in the Rain, Seven Brides for Seven Brothers); 2003\n*Paul Draper, partner of Larry Adler; 1993\n*Arthur Duncan; 2004\n*Mercedes Ellington, choreographer, dancer, producer; first black member of the June Taylor Dancers, granddaughter of Duke Ellington; 2009\n*Savion Glover, star of Bring in da Noise, Bring in da Funk; 2000\n*Yvette Glover, mother of Savion Glover; 2007\n*Jane Goldberg, tap performer and historian; 2002\n*Chuck Green; 1991\n*Ralph Guild; 2006\n*Lionel Hampton, musician; 1995\n*Barry Harris, pianist, composer and teacher; 1998\n*George Hillman; 1991\n*Gregory Hines, brother of Maurice Hines; 1998\n*Maurice Hines, brother of Gregory Hines; 2008\n*Milt Hinton, jazz bassist; 1997\n*Melba Huber; 1996\n*Delilah Jackson, founded Flo-Bert, Ltd. and the Flo-Bert Awards; 2001\n*Gene Kelly; 1994\n*Sali Ann Kriegsman; 1997\n*Mable Lee, singer-dancer, one of the original Apollo Girls; 2004\n*Jeni LeGon, member of the Whitman Sisters; 2001\n*Henry LeTang, taught Gregory Hines; choreographer of the movies Tap and The Cotton Club, Broadway plays Eubie, Black and Blue and Sophisticated Ladies; 1995\n*Bernard Manners; 1991\n*Frankie Manning, member of Whitey's Lindy Hoppers; 2004\n*Ann Miller; 1994\n*Deborah Mitchell, founder of the New Jersey Tap Ensemble; 2007\n*Cobi Narita; 2005\n*The Nicholas Brothers; 1992\n*Donald O'Connor; 1997\n*Frank Ownes, pianist/arranger/composer; 2002\n*Radio City Rockettes; 1996\n*Leonard Reed, inventor of the Shim Sham Shimmy; 2000\n*LaVaughn Robinson; 2005\n*Jo Rowan; 2006\n*The Silver Belles; 1992\n*Randy Skinner; 2010\n*Jimmy Slyde; 1991\n*Prince Spencer, one of the Four Step Brothers; 2009\n*Peggy Spina; 2008\n*Bross Townsend, pianist; 1996\n*Tommy Tune; 2003\n*Dianne Walker; 2003\n*George Wein, originator of the Newport Jazz Festival; 2004\n*Ruth Williams, founder of the Ruth Williams Dance Studio in Harlem; 1996\n*Heather Cornell, co-founder of Manhattan Tap; 2012\nNotes\nExternal links\n* [http://www.florencemills.com/flobert.htm Flo-Bert Awards] by Bill Egan at florencemills.com"
    }
  ]
}