{
  "content": [
    {
      "type": "text",
      "text": "# Floriculture\n\nshows some of the diversity of floricultural plants]]\n, Netherlands]]\nFloriculture (from  ) is the study of the efficient production of the plants that produce showy, colourful and even edible flowers and foliage. It is a commercially successful branch of horticulture and agriculture found throughout the world. Efficient production practices have been developed over the years, for the hundreds of plant taxa used in the floral industry, increasing the overall knowledge of whole plant biology. Plant breeding and selection have produced tens of thousands of new genotypes for human use.\nOverview\nFlowers are an important part of human society that are often used at times of joy and sadness, and as a part of everyday life. Flowers and plants may be indoors in a sunny window, as part of the landscape in the front yard or on the patio or deck in the back yard. People have been studying flowers and plants and their interaction with humans and how to produce these flowers and plants so all humans can enjoy them. Floriculture scientists throughout the world to do this work.\nFloriculture crops include cut flowers and cut cultivated greens, bedding plants (garden flowers or annuals, and perennials, houseplants (foliage plants and flowering potted plants). These plants are produced in ground beds, flower fields or in containers in a greenhouse. Protected cultivation is often used because these plants have a high value to humans.\nFlower crops are grown in simple to highly sophisticated ways. These crops can be grown in soil in farm fields or in field soil in inexpensive high tunnel greenhouses. For years, flowers were grown, seasonally for the specific crop, close to the market in Europe, North America and Asia. However, many crops of the floral industry have moved to a specific climate, typically in the mountains of South America, Africa and China, so certain plants can be grown year around where hand labor is available.\nProtected horticulture (greenhouses) has developed simultaneously with the continued changes in the flower crops and markets. Floriculture is a major component of controlled-environment agriculture (CEA). Floriculture crops have a high value to humans, so the cost of an expensive production system - greenhouses, automated environmental control, automated irrigation and fertilization, robotic seed, transplant and container handling, supplemental photosynthetic lighting - is necessary to produce these plants efficiently for the world-wide markets. Some are irrigated manually, but most are irrigated with drip irrigation, boom irrigation or flood floors. Hydroponics can be used for many cut flower crops.\n. Floriculture value 2022\nThe global Floriculture market size is estimated to be worth US$50.04 billion in 2022 and is forecast to be a readjusted size of US$58.03 billion by 2028 with a compound annual growth rate of 2.5% during the review period.\nThe total wholesale value of sales across all U.S. floriculture crops totaled US$6.69 billion in 2022 from 8,951 floriculture producers with a production area of 833 million square feet.\nFloriculture advancements\nPlant enthusiasts and growers learned significant details about growing certain plants over the years. Chrysanthemums have been cultivated in China for over 3000 years, so growers knew about the plant and how to grow it. Floriculture scientists have simply continued this trend to control the plant's environment to control flowering for the significant dates when humans want flowers for celebrations and gatherings.\nPhotoperiodism\nChrysanthemum was one of the plants used in experiments that led to the definitions of photoperiod and photoperiodism. Yet, it's likely that Chinese, Korean and Japanese plantsmen had a good understanding based on their years of experience. The occurrence of this physiological response and the reasons for it have been the subject of many experiments at universities and in industry.  Poinsettias are another short day plant with importance to flower growers. These and additional experiments and experience have shown that temperature has an impact on the photoperiodic response. Many cut flower and bedding plant species respond to long day or short day treatments for faster flowering. The use of lighting treatments to extend the day and black cloth treatments to shorten the day are important additions to floriculture to increase the efficiency of plant production.\nPlant tissue culture, micropropagation\nPlant propagation has always been a part of flower and plant gardening. Plant tissue culture began as a way to save orchid embryos as orchid fanciers bred new cultivars. Most horticulture and many botany programs in the world had scientists working on plant propagation through tissue culture techniques from the 1950s to the 1980s. These programs expanded the knowledge base on a wide range of taxa and allowed industry to find the connection to commercial production. Plant tissue culture allowed new, unique phenotypes and genotypes to be propagated in large numbers quickly. Many cultivars of foliage plants are available only from tissue culture. Uniquely, tissue cultured geraniums were heat treated to allow the identification and removal of many viruses, virus-indexed. As viruses were removed, many horticultural characteristics of the many cultivars disappeared; this led plant breeders to leave many viruses in breeding lines for future cultivars. Heat treatment of tissue culture of many taxa has since been used to remove bacteria and virus pathogens in various floriculture crops.\nContainers and growing media\nContainers of various kinds have been used in the culture of plants for a long time. Field soil or garden soil possibly with an addition of organic matter (compost) was placed in the container or pot and a plant was added followed by regular watering. It required experience and a watchful eye to prevent overwatering.\nThis success was tied to a relatively deep pot, usually 6–10 inches (15–25&nbsp;cm) deep or larger. Gravity was sufficient to pull or drain water from the soil so an adequate portion of the soil in the pot was well drained and oxygen would be available to the root system. As US greenhouses began to expand the bedding plant business in the 1950s and 1960s, they needed smaller containers for the logistical aspects of plant spacing and shipping. Vacuum formed plastic trays and packs offered the smaller sizes but composted field soil was easy to overwater in the smaller containers. The first step was to add peat moss and perlite to the field soil in a 1:1:1 ratio. The next step was to use other materials, sphagnum moss peat and vermiculite, in a 1:1 ratio, the Cornell peat-lite mix. In the 1970s, more materials were used for growing media by the companies formed to process and distribute growing media to operations across the country. The physical properties of all the products had to be evaluated on a standard basis to make wise choices with economic decisions the operations were making. As plug (young plant) production, mechanization of seed germination and mechanization of transplanting, began in the 1980s more work was necessary to manage the small volume of growing media in plug trays. Research continues of all aspects of growing media and container design.\nThe harvest and use of peat for growing media remains an environmental issue in North America and Europe. Alternative and more sustainable materials continue to be added to growing media processing - pine bark, processed pine bark, coco coir, wood fiber, etc. Sustainable solutions for growing media materials remain a high priority for the industry.\nPesticide residues\nPesticide residues remain a significant issue for floriculture crops. Many countries have limited controls on pesticide usage but flower handlers and consumers could be contaminated by the residue.\nThe impact of certain pesticides, neonics, on bees and other pollinators has become a significant concern. The application of these pesticides on garden flowers during greenhouse production can have a major impact on pollinator populations in a consumer's garden.\nResearch continues on biological control of greenhouse insect, mite and plant pathogens to reduce pesticide use in floriculture crop production.\nSupplemental lighting\nSupplemental lighting for flower crops began with photoperiod treatments and interest expanded to determine whether artificial light from electric lamps could substitute for sunlight during winter conditions. Incandescent lamps were not successful, so floriculture had to wait for lighting technology to improve. Advancements with fluorescent lamps and industrial lamps (mercury vapor, high pressure sodium, low pressure sodium, etc.) led to improved plant production for geraniums, roses and other crops. In the following decades, artificial lighting became standard practice in Europe, North America and Japan.\nWork was completed to standardize a plant's need for light (radiant energy) from natural and artificial sources. The term daily light integral (DLI) was introduced as a measurement of the optimal amount of radiant energy each plant requires for optimal growth.\nThe introduction of light emitting diode (LED) lamps offered more opportunities for supplemental lighting. These lamps were more efficient at light production, cooler and allowed the manipulation of light quality from different wavelengths of light compared to other lamps.\nSupplemental lighting has been used to optimize production of seedlings, bedding plants, cut flowers and other crops.\nPlant nutrition, water quality and irrigation\nFlower crops were grown in field soil like all horticultural and agricultural crops. Nutrients important to the flowers were held in the soil matrix and supplemented with additions of organic matter and animal manure. These organic additions were labor-intensive and inconsistent, reducing the ability to optimize flower production. Floriculture moved to growing media and inorganic fertilizer products in the 1950s and 1960s as container production became more important. This move was supported by hydroponic research more than soil science research. The \"soil-less\" nature of hydroponics was more similar to the \"soil-less\" nature of growing media.\nSee also\n*Floriculture in Canada\n*Floriculture in Taiwan\nReferences\n*\nFurther reading\n* [https://usda.mannlib.cornell.edu/MannUsda/viewDocumentInfo.do?documentID=1072 USDA - National Agricultural Statistics Service Floriculture Crops ]\n* [http://hort.ifas.ufl.edu/floriculture/ University of Florida]\n* [http://ccfc.org/ California Cut Flower Commission]\n* [http://www.ces.ncsu.edu/depts/hort/floriculture/ North Carolina State University Floriculture Information Center]\n* https://www.researchgate.net/publication/295862115_Diversification_Through_Floriculture_in_Kashmir_Valley\nExternal links\n*"
    }
  ]
}