{
  "content": [
    {
      "type": "text",
      "text": "# Florence Nightingale David Award\n\nThe Florence Nightingale David Award is an award given every two years (in odd-numbered years) jointly by the Committee of Presidents of Statistical Societies and Caucus for Women in Statistics to a distinguished female statistician.\nDescription\nThe award's purpose is to \"recognize a female statistician who exemplifies the contributions of Florence Nightingale David\" and who \"has advanced the discipline and proven herself to be an outstanding role model\". Since the founding of the award, it has become a \"prestigious hallmark of achievement\" among female statisticians.\nWinners\nThe Florence Nightingale David Award was first given in 2001, with David herself being given the award retroactively, dated to 1994. The winners of the award have been:\n{| class=\"wikitable\" width=\"auto\" style=\"text-align: left\"\n!Year\n!Name\n!Contributions\n|-\n|1994\n|Florence Nightingale David\n|\"For her efforts in opening the door to women in statistics; for contributions to the profession over many years; for contributions to education, science, and public service; for research contributions to combinatorics, statistical methods, applications, and understanding history; and her spirit as a lecturer and as a role model.\"\n|-\n|2001\n|Nan Laird\n|\"For exemplary leadership addressing challenging issues in genetics and public health; and for her inspiring role in guiding statisticians learning to balance their personal and professional lives.\"\n|-\n|2003\n|Juliet Popper Shaffer\n|\"For her pioneering contributions to statistical methods in education and psychometrics; for her exceptional role in fostering opportunities for and in support of the advancement of women in the sciences\"\n|-\n|2005\n|Alice S. Whittemore\n|\"For her achievements in the theory and methodology of biostatistics applied to epidemiology, environmental pollution, occupational exposure, cancer genetics and public health; for her active role in the statistical profession; for her constant involvement in major public health issues; and for the role model for women she has engendered by the above.\"\n|-\n|2007\n|Nancy Flournoy\n|\"For her fundamental research contributions in adaptive designs, sequential analysis, clinical trials, and particularly in bone marrow transplantation trials; for her devoted teaching; for her passionate mentoring to young statisticians, new investigators, women and minorities, and researchers in small universities; for her leadership in the profession including her role as the chair of a major statistics department.\"\n|-\n|2009\n|Nancy Reid\n|\"For her pioneering research in statistical asymptotics, her imaginative teaching, and her outstanding record of service to the statistical profession.\"\n|-\n|2011\n|Marie Davidian\n|\"For important contributions to the development of methods for analyzing data from longitudinal studies and clinical trials, and for outstanding leadership and dedication to the statistical profession.\"\n|-\n|2013\n|Lynne Billard\n|\"For world-leading research in sequential analysis, stochastic processes, epidemiology and symbolic data analysis; for extensive collaborations, especially in poultry science and computer science; for exceptional contributions to leadership in the profession; and for outstanding contributions as a role model, fostering opportunities especially for academic women as leaders, researchers, administrators, and educators.\"\n|-\n|2015\n|Francesca Dominici\n|\"For her premiere research in biostatistics and public health, including development of statistical methods for the analysis of large observational data with the ultimate goal of addressing important questions in environmental health science, health-related impacts of climate change, and public health; for her outstanding contribution to research on outdoor air pollution and health which has formed the critical basis for policies on air quality; for her leadership in multidisciplinary collaborations for policy relevant research and her commitment to scientific research at the highest level with studies designed to improve public health; and for being an insightful mentor and exemplary role model for future generations of statisticians, especially young women.\"\n|-\n|2017\n|Xihong Lin\n|\"For leadership and collaborative research in statistical genetics and bioinformatics; and for passion and dedication in mentoring students and young statisticians.\"\n|-\n|2019\n|Susan S. Ellenberg\n|\"For impactful leadership roles at the NIH, FDA and the University of Pennsylvania developing and evaluating new methodologies and specialized approaches to improve the conduct of clinical trials; for influencing ethical practice and leading development of important regulatory policies; for leadership in setting standards for clinical trial data monitoring committees; for senior statistical leadership for many multicenter clinical research network clinical trials; for distinguished leadership in numerous professional societies and national and international committees addressing major public health challenges; and for serving as an exceptional academic role model for faculty and students.\"\n|-\n|2021\n|Alicia L. Carriquiry\n|\"For being an outstanding role model for female and Latin American statisticians and for statisticians striving for scientific impact; for influential Bayesian, forensics, transportation, and nutrition research; for effective leadership of multidisciplinary groups; for extensive engagement in the National Academies and professional statistical societies; and for advocacy for female and early-career statisticians.\"\n|-\n|2023\n|Karen Bandeen-Roche\n|\"For outstanding leadership and service in the statistics and biostatistics community, for her leadership in statistical education, and for her achievements in biostatistical research, particularly in the field of aging research and frailty.\"\n|}\nReferences\n}}"
    }
  ]
}