{
  "content": [
    {
      "type": "text",
      "text": "# Floward\n\n}}\nFloward (Arabic: فلاورد) is an online store specializing in ordering and delivering flowers and gifts. Floward was founded in 2017 and is headquartered in Riyadh, Saudi Arabia. It operates in Kuwait, Saudi Arabia, Qatar, Bahrain, the United Arab Emirates, Jordan, Oman, Egypt, and the United Kingdom.\nHistory\nFloward was founded in 2017 by Abdulaziz Bassem Al Loughani and Mohammed Al Arifi as an online flower and gift delivery store. In December 2021, the company announced a four-year sponsorship deal with the Saudi football club Al Hilal, effective for the 2021–2022 season. On November 25, 2021, Floward set two Guinness World Records by creating both the largest and the most floral word designs in the world, using a total of 16,491 roses across the two attempts. In the same year, Forbes Middle East included Floward in its annual ranking of the 50 Most-Funded Startups in the Middle East and North Africa.\nBy 2022, the company had expanded to nine countries and was operating in approximately 40 cities across the Middle East, North Africa, and the United Kingdom. In September 2022, Floward obtained an official license for the 2022 FIFA World Cup, becoming the first company in the floral sector to receive such authorization. The company introduced a collection of officially licensed flower arrangements featuring the tournament’s logo, including a limited-edition golden football vase. The announcement was made at a ceremony in Doha attended by former international footballers Ricardo Kaká, David Villa, Didier Drogba, John Terry and Iker Casillas.\nAs of 2023, Floward had completed several funding rounds, raising over $190 million from investors including STV, Aljazira Capital, Rainwater Partners, and Impact46. That year, the company announced its plans to pursue an initial public offering (IPO) in Saudi Arabia.\nIn 2023, Floward acquired Mubkhar, a Kuwait-based fragrance brand established in 2015 with operations in Kuwait, Saudi Arabia, Bahrain, and Qatar. In October 2024, the company was selected to join the Sustainability Champions program launched by the Ministry of Economy and Planning in Saudi Arabia.\nIn February 2025, Floward became the main partner of the Mubadala Abu Dhabi Open tennis tournament. In May 2025, Floward introduced what it described as the first automated flower vending machine in the Middle East and North Africa, with initial installations in Saudi Arabia, the United Arab Emirates, Qatar, and Kuwait.\nReferences\nExternal links\n* [https://floward.com/ Official website]"
    }
  ]
}