{
  "content": [
    {
      "type": "text",
      "text": "# Food Wars! Shokugeki no Soma season 4\n\n| last_aired    =\n| prev_season   = The Third Plate\n| episode_list  = List of Food Wars! Shokugeki no Soma episodes\n| next_season   = The Fifth Plate\n}}\nThe fourth and penultimate season of Food Wars!: Shokugeki no Soma anime television series, subtitled , was produced by J.C.Staff and directed by Yoshitomo Yonetani. The series was first broadcast in Japan on Tokyo MX. It aired from October 12 to December 28, 2019, with additional broadcasts on BS11 and Animax. In addition, AbemaTV streamed the season. Stereo Dive Foundation performed the opening theme song \"Chronos\", while the ending theme song is  by Nano Ripe.\nIn the United States, Adult Swim's Toonami programming block ran the English dub from August 22 to November 28, 2021.\n__TOC__\nEpisodes\nList of Food Wars! Shokugeki no Soma episodes}}\n|director=12 |directorR= |aux2=12 |aux2T=Storyboarded by |aux2R= |airdate=12 |airdateR= |altdate=12 |altdateT=English air date |altdateR= |episodes=\n| AltDate         = August 22, 2021\n| ShortSummary    = With the first round resulting in a sweeping victory for the rebels, the second round begins with Kuga, Megishima, Mimasaka competing against Tsukasa, Rindou, and Saitou respectively. The theme ingredients are green tea for Kuga and Tsukasa, tuna for Mimasaka and Saitou, and cayenne pepper for Megishima and Rindou. Rindou decides to use alligator meat, revealing her specialization in rare, exotic ingredients. Megishima also takes advantage of his ramen specialization, intending to use char siu pork to create an \"African ramen\". In a flashback, it is shown that Megishima initially did not want to join the rebels, wanting to protect the local ramen shops in his hometown instead. However, he was convinced by Soma's determination, and joined the fight against Central. In the present, both Megishima and Rindou prepare to add cayenne pepper to their dishes.\n| LineColor       = FFE15D\n}}\n| AltDate         = August 29, 2021\n| ShortSummary    = As the second round continues, Mimasaka provides Kuga with a bottle of specially prepared smoked soy sauce, reminding everybody that under the rules of a Team Shokugeki, chefs on the same team can help each other. Kuga then starts smoking fried pork with green tea leaves. Meanwhile, Mimasaka faces off against Saitou, a sushi chef, making tuna a perfect ingredient for him. Mimasaka uses an improved version of his Perfect Trace technique, Perfect Trace Flash, to instantly copy Saitou's moves. Mimasaka and Saitou complete their nearly identical sushi dishes, while Rindou completes her Laziji Caiman dish and Megishima finishes his African Ramen. However, Mimasaka and Megishima lose to Rindou and Saitou. Kuga then presents his dish to the judges.\n| LineColor       = FFE15D\n}}\n| AltDate         = September 5, 2021\n| ShortSummary    = Kuga, who seeks to surpass Tsukasa after being humiliated by him a past Shokugeki, presents a smoked pork dish that incorporates both Sichuan and French cuisine. However, Tsukasa presents his own dish, which is a purée that incorporates all four types of green tea, and the judges declare Tsukasa the winner. This makes the second round a sweep for the Elite Ten. Despite their victories, both Tsukasa and Rindo are too exhausted to participate in the third round, all according to Erina's plan. The next day, the third round's matchups are Soma against Saitou with butter, Takumi against Eizan with beef, and Megumi against Momo with apples. As the third round begins, Shinomiya arrives at the arena.\n| LineColor       = FFE15D\n}}\n| AltDate         = September 12, 2021\n| ShortSummary    = Megumi remembers the training Shinomiya gave her during the train ride to improve her cooking with vegetables. Once cooking begins, Soma, Takumi, and Megumi begin working together to assist each other with their dishes, improving their efficiency. Momo finishes her Queen's Apple Tart, an apple tart with the apples soaked in Damask rose syrup. Megumi responds with a dorayaki filled with diced apples. While it looks plain, the judges notice that the flavors are brought out thanks to Megumi's use of apple butter. Megumi reveals she used the Monte au Beurre technique, a skill she learned from Shinomiya, to make the apple butter. While impressed, the judges aren't convinced that Megumi's dorayaki is superior to Momo's apple tart until they discover something inside the dorayaki that shocks them.\n| LineColor       = FFE15D\n}}\n| AltDate         = September 19, 2021\n| ShortSummary    = The judges discover that Megumi hid apple confiture in the center of her dorayaki. Despite this, the judges vote 2-1 in favor of Momo, as the confiture's bitter taste overpowered the apple butter. However, Momo acknowledges Megumi's skill and potential. Meanwhile, Takumi cooks a pizza with shigureni beef. When Takumi puts his pizza in the oven, Eizan reveals his dish is a roast beef with cream sauce incorporating artichokes and that the cynarine in artichokes will cause the judges' taste buds to react more violently to sweet flavors. As shigureni is naturally sweet, this will ruin the flavors of Takumi's pizza. After the judges taste Eizan's dish, Takumi presents his pizza, which is separated into two halves; one side is purely cheese, and the other has shigureni. Takumi reveals that he predicted Eizan would try to neutralize the taste of his shigureni, so he adjusted his sauce to be more bitter to compensate. The cheese half of the pizza is made of a mix of four cheeses to further complement the taste of the shigureni. Impressed with Takumi's ability to make all the dishes complement each other, the judges unanimously declare him the winner.\n| LineColor       = FFE15D\n}}\n| AltDate         = September 26, 2021\n| ShortSummary    = Soma and Saitou continue their match. Saitou starts off by juicing oranges, while Soma makes a white sauce using kirimochi. Saitou finishes his dish first, presenting a buttered seafood rice bowl. By using lemon and orange, he is able to incorporate large amounts of butter into his dish without affecting its taste. Satoshi explains that Saitou honed his skills running his mother's sushi restaurant when she fell ill, defeating all the old fashioned, traditional sushi chefs who disrespected his mother because she was a woman. Soma asks Saitou why he sided with Central, and he explains that he was motivated to protect those who suffered at the hands of the cooking establishment. Soma then presents his own dish, Yukihira-style Toasted Butter Pilaf Inari Sushi. The judges and Saitou are amazed at Soma's incorporation of techniques he learned from his classmates to maximize the flavor of his dish, and declare Soma the victor.\n| LineColor       = FFE15D\n}}\n| AltDate         = October 3, 2021\n| ShortSummary    = For the fourth round, the matchups are: Satoshi against Tsukasa with wild rabbit, Takumi against Rindo with spear squid, and Erina against Momo with brown sugar. Momo finishes her dish first: a miniature castle made out of roll cakes, with soy sauce, fruit, and candy added to the cream to enhance the sweetness of the brown sugar. As Momo waits for Erina to finish, she reminisces about her life before Totsuki. Erina responds with a soufflé with a layer of brown sugar red bean paste hidden inside. Momo is shocked at how delicious Erina's dish is, realizing that instead of using cheese for the meringue, Erina used Greek yogurt, which would complement the red bean paste rather than overwhelm it. Erina reveals that her dish was inspired by Megumi's, and points out that Momo has been feeling frustrated because she couldn't understand Megumi's dish. Momo is forced to admit that Erina's dish is cute while the judges declare Erina the victor. Suddenly, Azami arrives on the stage and announces that he will be the judge for the remaining Shokugeki matches.\n| LineColor       = FFE15D\n}}\n| AltDate         = October 10, 2021\n| ShortSummary    = The students protest at Azami's involvement, but he points out that Senzaemon approved the change of judges. Azami brings his own WGO judges, Courage and Decora, but Anne insists on remaining as a judge. Takumi presents his calamari ripieni dish and Rindo presents a Peruvian causa which incorporates pirarucu fish. Rindo's dish outclasses Takumi's and the judge vote for her unanimously. Meanwhile, Satoshi and Tsukasa continue cooking. Satoshi makes a traditional Japanese wanmono soup, which shocks the rebels since rabbit meat will overwhelm the soup's taste. When the judges taste the soup, Nene voices her frustration and jealousy at how Satoshi is naturally skilled at everything. Satoshi reveals that even though he was skilled, he initially had no passion for cooking. It was only when he saw Nene practicing that he realized he could cook for fun rather than just to advance his family's tradition. Meanwhile, the judges are surprised that Satoshi was able to neutralize the rabbit meat's gamey taste, and are caught off guard when the clear soup suddenly transforms into a miso soup. The combination of miso soup and rabbit meat creates a powerful taste which the judges agree can rival anything Tsukasa can make.\n| LineColor       = FFE15D\n}}\n| AltDate         = November 7, 2021\n| ShortSummary    = Tsukasa serves a Lièvre à la Royale, a dish typically reserved for French royalty. The rabbit meat is prepared flawlessly alongside a layer of royale custard on the bottom of the dish to accentuate its flavor. The judges unanimously declare Tsukasa the winner. Tsukasa offers to let Satoshi join Central as his assistant, but Satoshi declines. This leaves Soma, Erina, Tsukasa, and Rindo as the remaining contestants. Senzaemon declares that the next match will be the final one, with the contestants facing off in a 2v2 match where one team member must prepare an appetizer while the other makes the main course. Megashima confronts Rindo, who admits that she feels troubled. She reveals that 5 years ago, she promised Tsukasa that they would take the top two seats of the Elite Ten. But after achieving their goal, Tsukasa began to resent how people would praise his cooking without any thought, and he fell under Azami's influence. As the final match begins, Rindo cooks the appetizer while Tsukasa handles the main course. Soma reluctantly agrees to cook the appetizer only after losing a game of rock-paper-scissors to Erina.\n| LineColor       = FFE15D\n}}\n| AltDate         = November 14, 2021\n| ShortSummary    = As the match continues, Rindo serves a mushroom mille-fuelle with formic acid collected from ants. Tsukasa then serves his Sauce Chevreuil, which he baked in a salt crust. The judges and the crowd are shocked at the delicious flavor both dishes are able to demonstrate. To combat this, Soma takes advantage of Erina's God Tongue by having her taste test his cooking. As instructed by Erina, Soma makes a Pâté de Campagne appetizer, but adds his own twist. The judges are caught off guard by his addition of marinated beef, bacon, yakiniku sauce, and consommé to the pâté. Azami admits that Soma's dish is comparable to Tsukasa's, but since Soma treated his appetizer like a main course, Azami is confident that it will ruin the taste of Erina's dish. Soma tells Erina he disobeyed her instructions because he knows Erina cannot beat Tsukasa unless she comes up with her own \"specialty.\" By serving his appetizer like a main course, he has challenged Erina to make something that can surpass his dish.\n| LineColor       = FFE15D\n}}\n| AltDate         = November 21, 2021\n| ShortSummary    = Erina accepts Soma's challenge and recruits his help in making a new dish, despite having only 10 minutes left. Erina completes her dish, which is a chicken and egg rice bowl. Azami refuses to taste the dish, believing it is pointless, but agrees to taste it if Tsukasa and Rindo acknowledge it. Both Tsukasa and Rindo are caught off guard by how good both dishes taste. Erina reveals that in order to account for Soma's dish, she modified the croûte she wrapped her chicken in by using minced squid and peanut butter. She also adds aspic cubes on top of the dish as seasoning, improving the taste of her dish even further which the judges are forced to acknowledge. Azami attempts to resist, saying that without Central, Erina will lose her passion for cooking like Joichiro did. Erina counters that she won't lose her passion as long as she has her friends, and it's thanks to them that she's the chef she is today. Azami is forced to admit defeat, and the rebels are declared the winners of the Team Shokugeki.\n| LineColor       = FFE15D\n}}\n| AltDate         = November 28, 2021\n| ShortSummary    = Tsukasa wonders how Soma and Erina beat him, and Satoshi tells him it was because they were having fun cooking. A defeated Azami leaves the arena, where he meets Joichiro and Dojima, who reassure Azami that they are still friends. The expelled rebels are reinstated to Totsuki and the rebels who participated in the Team Shokugeki are given priority placement on the Elite Ten. Erina nominates Soma to be the 1st seat and Soma nominates her to be the new director of Totsuki. Both nominations are supported by Senzaemon and the rebels. Several months later, the new term begins. The new Elite Ten is revealed: Megumi Tadokoro is in the 10th seat, Nene Kinokuni is in 9th,Etsuya Eizan is in 8th, Takumi Aldini is in 7th, Alice Nakiri is in 6th, Ryõ Kurokiba is in 5th,Akira Hayama is in 4th,Terunori Kuga is in 3rd, and Satoshi Isshiki is in 2nd and in the first seat Sõma Yukihira.The third year students graduate and go their separate ways. Thanks to Soma's declaration that he will accept any Shokugeki, Shokugekis between students become more commonplace. Meanwhile, Megumi travels the world to learn about more cuisines, and defeats a mysterious chef in an impromptu Shokugeki. While seeing visitors, Erina meets a mysterious young man.\n| LineColor       = FFE15D\n}}\n}}\nHome media release\nJapanese\n{| class=\"wikitable\" style=\"text-align: center; width: 70%;\"\n|+ Warner Bros. Japan (Japan – Region 2/A)\n|-\n! colspan=\"2\" | Title\n! width=\"20%\" | Episodes\n! width=\"15%\" | Release date\n! width=\"5%\"  | Ref.\n|-\n| rowspan=\"2\" width=\"1%\" style=\"background: #FFE15D;\" |\n| Box Set\n| 1–12\n| April 29, 2020\n|\n|}\nEnglish\n{| class=\"wikitable\" style=\"text-align: center; width: 70%;\"\n|+ Sentai Filmworks (North America – Region 1/A)\n|-\n! colspan=\"2\" | Title\n! width=\"20%\" | Episodes\n! width=\"15%\" | Release date\n! width=\"5%\"  | Ref.\n|-\n| rowspan=\"1\" width=\"1%\" style=\"background: #FFE15D;\" |\n| Complete Collection\n| 1–12\n| February 23, 2021\n|\n|}\nNotes\nReferences\nExternal links\n*\n*  at Crunchyroll\n*  (The Fourth Plate)\n*"
    }
  ]
}