{
  "content": [
    {
      "type": "text",
      "text": "# Football in the Sahrawi Arab Democratic Republic\n\nFootball is the most popular sport among the Sahrawi people who live in Western Sahara, a territory that is disputed between Morocco and the Sahrawi Arab Democratic Republic (SADR). The sport is governed by the Sahrawi Football Federation (FSF), which is a member of ConIFA, an organisation for non-FIFA-affiliated nations.\nHistory\nFootball was introduced to Western Sahara by Spain, which colonised the territory until 1975. After Spain's withdrawal, Morocco annexed most of Western Sahara and claimed sovereignty over it. The SADR, which was proclaimed by the Polisario Front, a liberation movement that fought against Morocco, also claimed sovereignty over the territory and established a government-in-exile in Tindouf Province, Algeria.\nThe FSF was formed in 1989 and is based in the city of Laayoune. The FSF runs the Western Sahara national football team, which represents the SADR in international competitions. The team is composed of members of the Sahrawi diaspora in Spain and other countries, as well as players from the Sahrawi refugee camps in Algeria.\nThe FSF is not affiliated to the Confederation of African Football (CAF) nor to FIFA. In December 2003, the FSF became provisionally affiliated to the N.F.-Board, an organisation for non-FIFA-affiliated nations. The N.F.-Board organised the Viva World Cup, a competition that Western Sahara entered once, in 2012. Due to pressure from Morocco, the hosts of the tournament, Kurdistan didn't display the Sahrawi flag for the competition.\nThe N.F.-Board disbanded in January 2013 and was replaced by ConIFA. Western Sahara joined ConIFA, but has not participated in any of the ConIFA World Football Cups organised by the organisation.\nCompetitions\nThe FSF hosts the Sahwari Republic Cup, a domestic tournament for teams from the refugee camps. The cup was first held in 2010 and has been played annually since then. The current champions are Dakhla FC, who won the 2020 edition.\nThe FSF also organises friendly matches with other non-FIFA-affiliated teams, such as Galicia, Darfur, Esperanto and UGA Ardeiv.\nSee also\n* Sahrawi Arab Democratic Republic\nReferences"
    }
  ]
}