{
  "content": [
    {
      "type": "text",
      "text": "# Ford-class seaward defence boat\n\n|section2=\n*\n*\n*\n*  Nigerian Navy\n*  Biafran Navy\n|class_before=\n|class_after=\n|subclasses=\n|cost=\n|built_range= 1950s\n|in_service_range= 1952–1967\n|in_commission_range=\n|total_ships_building=\n|total_ships_planned=\n|total_ships_completed=23\n|total_ships_canceled=\n|total_ships_active=\n|total_ships_laid_up=\n|total_ships_lost=\n|total_ships_retired=\n|total_ships_preserved= HMS Gifford\n}}\n|section3= standard\n*  full load\n|length=*  o/a\n*  p/p\n|beam=\n|height=\n|draught=\n|depth=\n|decks=\n|deck_clearance=\n|power=\n|propulsion=* 1 × Foden diesel (centre shaft)\n* 2 × Davey Paxman 12YHAX  diesels (outer shafts)\n* 23 tons oil fuel\n|speed=\n|range=\n|endurance=\n|capacity=\n|complement=19\n|armament=Depth charge rails with both large and small charges\n|armour=\n|notes=\n}}\n}}\nThe Ford-class seaward defence boats were built for the Royal Navy (with three built for the South African Navy) in the 1950s.\nDevelopment\nThey were designed to detect and attack hostile submarines, including midget submarines in inshore waters such as the approaches to large ports. They were powered by diesel engines and were planned to be armed with a single barreled Squid anti-submarine mortar. This special version of the Squid was a failure however, with the first Ford-class boat, HMS Shalford being fitted with a normal three-barreled Squid and the remaining vessels with a more conventional anti-submarine armament of depth-charge throwers. A single Bofors 40 mm gun completed the armament.\nHMS Droxford served for a time as the tender for Glasgow and Strathclyde Universities Royal Naval Unit, and was administered by RNR Clyde. The vessel was used to train Midshipmen who were students of the universities and participated in fishery protection duties along the west coast of Scotland. HMS Beckford (P3104) was renamed HMS Dee and served as the tender to Liverpool University Royal Naval Unit.\nShips\n*  (P3101)\n*  (P3102) - Transferred to Kenyan Navy as KNS Nyati\n*  (P3103) - Transferred to Nigerian Navy as NNS Kaduna\n*  (P3104)\n*  (P3105) - Transferred to South African Navy, initially as HMSAS Gelderland - Renamed to SAS Gelderland\n*  (P3106) - Transferred to Nigerian Navy as NNS Ibadan II.\n*  (P3107)\n*  (P3108) - Transferred to Royal Ceylon Navy as HMCyS Kotiya\n*  (P3109)\n*  (P3111) - Transferred to Nigerian Navy as NNS Bonny\n*  (P3113)\n*  (P3114)\n*  (P3115)  - Transferred to Nigerian Navy as NNS Benin\n*  (P3116)\n*  (P3119)  - Transferred to Nigerian Navy as NNS Sapele\n*  (P3120) - Transferred to South African Navy, initially as HMSAS Nautilus - Renamed to SAS Nautilus\n*  (P3121)\n*  (P3122)\n*  (P3123) Sold in Singapore 1967.\n*  (P3124) - Transferred to Nigerian Navy as NNS Ibadan. Captured by Biafran forces during the Nigerian Civil War and put into Biafran navy as BNS Vigilance. Sunk by Nigerian Navy on 9 October 1967 at Port Harcourt.\n*  - Renamed SAS Rijger\n*  - Renamed SAS Haerlem\n*  - Renamed SAS Oosterland\nReferences\n* Blackman, Raymond V. B. ''Jane's Fighting Ships 1971–72. London: Sampson Low, Marston & Company, 1971. .\n* Gardiner, Robert and Stephen Chumbley. Conway's All The World's Fighting Ships 1947–1995''. Annapolis, Maryland USA: Naval Institute Press, 1995. ."
    }
  ]
}