{
  "content": [
    {
      "type": "text",
      "text": "# Foreign relations of the Eastern Roman Empire\n\nThe foreign relations of the Eastern Roman Empire were conducted by the emperor. Preferring diplomacy over war, the emperor would use alliances, treaty's and diplomatic tactics to achieve goals. Military confrontations also occurred, with Dimitri Obolensky calling it as a form of \"defensive imperialism\". The conduct of its foreign relations is a large factor to the Empire's longevity of 1,123 years.\nOverview\nThe Empire's longevity has been said to be due to its aggressive diplomacy in negotiating treaties, the formation of alliances, and partnerships with the enemies of its enemies Even when it had more resources and less threats in the 6th century, the costs of defense were enormous; foreign affairs had become more multi-polar, complex and interconnected; further the challenges in protecting the empire's primarily agricultural income as well as numerous aggressive neighbors made avoiding war a preferred strategy.\nThe primary objective was survival, not conquest, and the foreign relations strategy was fundamentally defensive or as Dimitri Obolensky has claimed \"defensive imperialism\".\nBetween the 4th and 8th centuries, the Empire's leveraged its status as Orbis Romanus and sophistication as a state, which influenced the formation of new settlements on former Roman territories. Relations with Muslim states were more centred around war. Telemachos Lounghis notes that relations with Western Europe became more challenging from 752/3 and later with the Crusades, as the balance of power shifted. A change in policies by emperors in the 9th and early 10th centuries laid the groundwork for future activity which included involved halting, reversing, and attacking Muslim power; cultivating relations and alliances with Armenians and Rus; and subjugating the Bulgarians. By the late era, Militant Islam threatened the state geographically and Latin Christians challenged it economically.\nEast Roman and Persian-Turk relations\nGöktürk relations: 6th–7th centuries\nThe Göktürks of the First Turkic Khaganate, which came to prominence in 552 CE, were the first Turkic state to use the name Türk politically. They played a major role with the East Roman Empire's relationship with the Persian Sasanian Empire. The first contact is believed to be 563 and relates to the incident in 558 where the slaves of the Turks (the Pannonian Avars) ran away during their war with the Hephthalites.\nThe second contact occurred when Maniah, a Sogdian diplomat, convinced Istämi (known as Silziboulos in Greek writings) of the Göktürks to send an embassy directly to the East Roman Empire's capital Constantinople, which arrived in 568 and offered silk as a gift to emperor Justin II. While the Sogdians were only interested in trade, the Turks in the embassy proposed an alliance against the Persians which Justin agreed to. The Persians had previously broken their alliance with the Turks due to the competitive threat they represented. This alliance guaranteed the arrival of west-bound silks from China and increased the risk of a war on two fronts for the Persians, with hostilities that would eventuate with the Byzantine–Sasanian War of 572–591. In 569 an embassy led by Zemarchus occurred which was well received and likely solidified their alliance for war.\nAnother set of embassies occurred in 575–576 led by Valentine which were received with hostility by Turxanthos due to alleged treachery. They required the members of the East Roman delegation at the funeral of Istämi to lacerate their faces to humiliate them. The subsequent hostility shown by the new ruler Tardu would be matched in East Roman writings. With the insults reflecting a breakdown of the alliance, the likely cause is that the anger was due to the Turks not having their expectations met from their agreements and realising they were being used when they no longer aligned with the current goals of the East Roman Empire (who correspondingly lacked trust in the Turks as partners).\nYears later, they would collaborate again when their interest aligned. The Turks attacked the Avars when they sacked an East Roman city in the Balkans (Anchialos in 584). Toward the end of the Byzantine–Sasanian War of 602–628, the Turks allied with the East Roman Empire and played a decisive role with the Third Perso-Turkic War.\nSasanian Persian relations: 3rd–7th centuries\nThe Sasanian Empire succeeded the Parthian Empire, the traditional arch-rival of the Roman Empire. They were recognized as one of the leading world powers alongside its main rival the East Roman Empire. This was from the overthrow of  the Parthian dynasty in the 3rd century by Ardashir I until their total collapse against the Arabs. There would be many wars between the rivals during this period.\nThe East Roman Empire's final war weakened the Sasanian Empire which set up its destruction by the Arabs. The Byzantine–Sasanian War of 602–628, which included the siege of the East Roman capital Constantinople, ended with both sides having drastically exhausted their human and material resources.  In 627, allied with Turks, Heraclius invaded the heartland of Persia. A civil war broke out in Persia, during which the Persians killed their king, and sued for peace. By the end of the conflict, both sides were weakened. Consequently, they were vulnerable to the sudden emergence of the Islamic Rashidun Caliphate, whose forces invaded both empires only a few years after the war. The Muslim armies swiftly conquered the entire Sasanian Empire as well as the East Roman territories in the Levant, the Caucasus, Egypt, and North Africa.\nSeljuk relations: 11th–13th centuries\nThe Seljuk Turks was a Sunni Muslim dynasty from the Qiniq branch of the Oghuz Turks. They gradually became Persianate and contributed to the Turco-Persian tradition in the medieval Middle East and Central Asia. The Seljuks established both the Seljuk Empire and the Sultanate of Rum, which at their heights stretched from modern day Iran to Anatolia, and were targets of the First Crusade.\nAfter the conquest of territories in present-day Iran by the Seljuq Empire, a large number of Oghuz Turks arrived on the East Roman Empire's borderlands of Armenia in the late 1040s. Eager for plunder and distinction in the path of jihad, they began raiding the East Roman provinces in Armenia. At the same time, the eastern defenses of the East Roman Empire had been weakened by Emperor Constantine IX Monomachos (), who allowed the thematic troops (provincial levies) of Iberia and Mesopotamia to relinquish their military obligations in favour of tax payments. As a consequence of this invasion, the Battle of Kapetron occurred in 1048.\nOver the next century, the Byzantine and Seljuk armies would fight many battles, with the Battle of Manzikert in 1071 considered a turning point in the history of Anatolia. The legacy of this defeat would be the loss of the East Roman Empire's Anatolian heartland. The battle itself did not directly change the balance of power between the East Romans and the Seljuks; however the ensuing civil war within the East Roman Empire did, to the advantage of the Seljuks.\nEmperor Alexios I Komnenos sent envoys that would have a large impact on history. He was worried about the advances of the Seljuks in the aftermath of the Battle of Manzikert of 1071, who had reached as far west as Nicaea, and sent envoys to the Council of Piacenza in March 1095 to ask Pope Urban II for aid against the invading Turks. What followed was the First Crusade. The Seljuk sultans bore the brunt of the Crusades and eventually succumbed to the Mongol invasion at the 1243 Battle of Köse Dağ. For the remainder of the 13th century, the Seljuks acted as vassals of the Ilkhanate. Their power disintegrated during the second half of the 13th century. The last of the Seljuk vassal sultans of the Ilkhanate, Mesud II, was murdered in 1308.\nOttoman relations: 13th–15th centuries\nThe dissolution of the Seljuk state left behind many small Turkish principalities. Among them were the Ottoman dynasty, which originated from the Kayı tribe\n*\n* }} branch of the Oghuz Turks in 1299, and which eventually conquered the rest and reunited Anatolia to become the Ottoman Empire. Over the next 150 years, the Byzantine–Ottoman wars were a series of decisive conflicts between the Ottoman Turks and Byzantine Romans that led to the final destruction of the Eastern Roman Empire and the dominance of the Ottoman Empire.\nIn 1453, the Ottoman Empire conquered Constantinople, the capital city of the East Roman Empire. They followed by conquering its splinter states, such as the Despotate of the Morea in 1460, the Empire of Trebizond in 1461, and the Principality of Theodoro in 1475.\nEast Roman and Arab relations\ndefeats the Hamdanid Emirate of Aleppo at Andrassos in 960, from the Madrid Skylitzes]]\nTaking advantage of the empire's weakness after the Revolt of Thomas the Slav in the early 820s, the Arabs re-emerged and captured Crete. They also successfully attacked Sicily, but in 863 general Petronas gained a decisive victory at the Battle of Lalakaon against Umar al-Aqta, the emir of Melitene (Malatya). Under the leadership of Emperor Krum, the Bulgarian threat also re-emerged, but in 815–816 Krum's son, Omurtag, signed a peace treaty with Leo V.\nIn the 830s the Abbasid Caliphate started military excursions culminating with a victory in the Sack of Amorium. The East Romans counter-attacked and sacked Damietta in Egypt. The Abbasid Caliphate responded by sending troops into Anatolia again, sacking and marauding until they were eventually annihilated by the East Romans at the Battle of Lalakaon in 863.\nIn the early years of Basil I's reign, Arab raids on the coasts of Dalmatia and the siege of Ragusa (866–868) were defeated, and the region once again came under secure East Roman control. This enabled East Roman missionaries to penetrate to the interior and convert the Serbs and the principalities of modern-day Herzegovina and Montenegro to Christianity.\nBy contrast, the East Roman position in Southern Italy was gradually consolidated; by 873 Bari was once again under East Roman rule, and most of Southern Italy remained in the empire for the next 200 years. On the more important eastern front, the empire rebuilt its defences and went on the offensive. The Paulicians were defeated at the Battle of Bathys Ryax and their capital of Tephrike (Divrigi) taken, while the offensive against the Abbasid Caliphate began with the recapture of Samosata.\nUnder Basil's son and successor, Leo VI the Wise, the gains in the east against the enfeebled Abbasid Caliphate continued. Sicily was lost to the Arabs in 902, and in 904 Thessaloniki, the empire's second city, was sacked by an Arab fleet. The naval weakness of the empire was rectified. Despite this revenge, the East Romans were still unable to strike a decisive blow against the Muslims, who inflicted a crushing defeat on the imperial forces when they attempted to regain Crete in 911.\nThe death of the Bulgarian Emperor Simeon I in 927 severely weakened the Bulgarians, allowing the East Romans to concentrate on the eastern front. Melitene was permanently recaptured in 934, and in 943 the famous general John Kourkouas continued the offensive in Mesopotamia with some noteworthy victories, culminating in the reconquest of Edessa. Kourkouas was especially celebrated for returning to Constantinople the venerated Mandylion, a relic purportedly imprinted with a portrait of Jesus.\nThe soldier-emperors Nikephoros II Phokas () and John I Tzimiskes (969–976) expanded the empire well into Syria, defeating the emirs of northwest Iraq. Nikephoros took Aleppo in 962, and the Arabs were decisively expelled from Crete in 963. The recapture of Crete in the siege of Chandax put an end to Arab raids in the Aegean, allowing mainland Greece to flourish again. Cyprus was permanently retaken in 965, and the successes of Nikephoros culminated in 969 with the siege of Antioch and its recapture, which he incorporated as a province of the empire. His successor John Tzimiskes recaptured Damascus, Beirut, Acre, Sidon, Caesarea and Tiberias, putting East Roman armies within striking distance of Jerusalem, although the Muslim power centres in Iraq and Egypt were left untouched. After much campaigning in the north, the last Arab threat to Byzantium, the rich province of Sicily, was targeted in 1025 by Basil II, who died before the expedition could be completed. By that time the empire stretched from the straits of Messina to the Euphrates and from the Danube to Syria.\nEast Roman and Western Europe relations\nHoly See relations\nThe Holy See, as we know it today, was under the formal authority of the East Roman Empire until the 8th century. The apostolic see of Diocese of Rome was established in the 1st century. However, the legal status of the Christian Church and its property was not recognised until the Edict of Milan in 313 by Constantine the Great, and it became the state church of the Roman Empire by the Edict of Thessalonica in 380 by Emperor Theodosius I. Based in Ravenna, the Praetorian prefecture of Italy following the death of Constantine from 337 had authority over the diocese of Rome, including after the fall of the Western Roman Empire in 476 and was replaced with the Exarchate of Ravenna (and the Duchy of Rome) from 584 to 751 following the Lombard invasion in 568.\nThe Holy See began to exhibit independence in the 5th century and a rivalry. A crisis began in 726, called the Byzantine Iconoclasm, that had the Bishop of Rome, Pope Gregory II, formally in opposition to the emperor Leo III the Isaurian. Further, following the loss of Castle of Sutri that was part  East Roman territory, the Pope negotiated back the lost territory with the Lombards. It would be the first time land was granted outside of Duchy of Rome and is known as the Donation of Sutri in 728 of King Liutprand of the Lombards. Sovereignty was established by the Donation of Pepin in 756 by King Pepin of the Franks, which began the Papal States. Tensions increased with the East Roman Empire when Pope Leo III crowned Charlemagne as Roman Emperor by translatio imperii in 800, a title that had been used by the East Roman emperor in Constantinople since the time of Constantine. The Donation of Constantine, composed probably in the 8th century, was a forged Roman imperial decree by emperor Constantine supposedly transferred authority over Rome and the western part of the Roman Empire to the Pope.\nThe struggle between the imperial state and Patriarch of Constantinople with the See of Rome continued through the Macedonian period, spurred by the question of religious supremacy over the newly Christianised state of Bulgaria.\nUnder the Komnenoi, the empire played a key role in the Crusades within the Holy Land, which Alexios I had helped bring about, while also exerting enormous cultural and political influence in Europe, the Near East, and the lands around the Mediterranean Sea under John and Manuel. Contact between Byzantium and the \"Latin\" West, including the Crusader states, increased significantly during the Komnenian period. Venetian and other Italian traders became resident in large numbers in Constantinople and the empire (there were an estimated 60,000 Latins in Constantinople alone, out of a population of three to four hundred thousand), and their presence together with the numerous Latin mercenaries who were employed by Manuel helped to spread East Roman technology, art, literature and culture throughout the Latin West, while also leading to a flow of Western ideas and customs into the empire.\nThe rivalry developed into the 1054 East–West Schism. It led to the permanent split of the two churches into the modern-day Catholic Church and Eastern Orthodox Churches. Although there was a formal declaration of institutional separation on 16 July, when three papal legates entered the Hagia Sophia during Divine Liturgy on a Saturday afternoon and placed a bull of excommunication on the altar, the so-called Great Schism was actually the culmination of centuries of gradual separation. The East Roman emperors appealed to the West for help in the final years of its existence, but the Pope would only consider sending aid in return for a reunion of the Eastern Orthodox Church with the See of Rome. Church unity was considered, and occasionally accomplished by imperial decree, but the Orthodox citizenry and clergy intensely resented the authority of Rome and the Latin Rite.\nEmperor Alexios I Komnenos, worried about the advances of the Seljuks in the aftermath of the Battle of Manzikert of 1071 who had reached as far west as Nicaea, sent envoys to the Council of Piacenza in March 1095 to ask Pope Urban II for aid against the invading Turks. What followed was the First Crusade. Some troops arrived to bolster the Christian defence of Constantinople, but most Western rulers, distracted by their own affairs, did nothing as the Ottomans picked apart the remaining East Roman territories.\nFranks relations: 5th–9th centuries\nAlthough the Frankish name does not appear until the 3rd century, at least some of the original Frankish tribes had long been known to the Romans under their own names, both as allies providing soldiers, and as enemies. They would eventually form into the Merovingian dynasty and Carolingian dynasty.\nThe Franks, in partnership with the Pope, distinguished a new Roman empire and rival power centre. The Libri Carolini published in the 790s made the first mention of the term \"Empire of the Greeks\" (Latin: Imperium Graecorum) and Imperator Graecorum (Emperor of the Greeks) was an insult first formally attributed to Pope John XIII. Western medieval sources thereafter beginning to refer to the Byzantine Empire as such. This was done to reestablish equal imperial dignity to the Empire of the Franks and what would later become known as the Holy Roman Empire. It would not be until the 19th century that the term \"Empire of the Greeks\" was replaced with the now modern term \"Byzantine Empire\".\nFollowing the Treaty of Verdun in 843, the Frankish Realm was divided into three separate kingdoms: West Francia, Middle Francia and East Francia. In 870, Middle Francia was partitioned again, with most of its territory being divided among West and East Francia, which would hence form the nuclei of the future Kingdom of France and the Holy Roman Empire respectively, with West Francia (France) eventually retaining the choronym.\nRepublic of Venice relations: 8th–15th centuries\nVenice started as a Roman city in 421 CE. Following the collapse of the Western Roman Empire and the reconquest of the Italian peninsula under Justinian I, it would come under the jurisdiction of the East Roman Empire through the Duchy of Ventia under the Exarchate of Ravenna in 584. The changing politics of the Frankish Empire began to change the factional divisions of Venice. The pro-Frankish fraction seized power and elected Obelerio degli Antenori but he would subsequently flee and the failed siege by Pepin of Italy became a turning point for Venice. The independence of Venice was possibly confirmed by the Pax Nicephori, an agreement between Charlemagne and Nicephorus, which recognized Venice as East Roman territory and also recognized the city's trading rights along the Adriatic coast, as Charlemagne previously ordered the Pope to expel the Venetians from the Pentapolis.\nThe East Roman Empire's relationship with Venice evolved into dependence. Around 841, the Republic of Venice sent a fleet of 60 galleys (each carrying 200 men) to assist the East Romans in driving the Arabs from Crotone, but failed. The Golden Bull of 1082 issued by Alexios I Komnenos granted Venenian merchants with tax exempt trading rights throughout the Byzantine Empire in return for their defense of the Adriatic Sea against the Normans. Subsequent extensions of these privileges and the Empire's naval impotence at the time resulted in a virtual maritime monopoly and stranglehold over the Empire by the Venetians.\nSubsequent East Roman Emperors tried to reduce Venice's influence which eventually made them enemies. John II Komnenos tried to refuse the 1082 treaty but was forced to come to terms after a retaliation. Manuel I Komnenos would go a step further and conclude agreements with Venice's rivals: Pisa, Genoa and Amalfi. Gradually, all four Italian cities were also allowed to establish their own quarters in the northern part of Constantinople itself, towards the Golden Horn. This created tensions and the subsequent imprisonment of Venetian merchants led to the Byzantine–Venetian war of 1171 that devastated the Venetian fleet. The subsequent predominance of the Italian merchants caused economic and social upheaval in the East Roman Empire and this would lead to the 1182 Massacre of the Latins. These events are noteworthy because they created the political background to the 1204 Sack of Constantinople by the Fourth Crusade.\nCrusader armies looted and destroyed parts of Constantinople, forever changing the Byzantine Empire. After the capture of the city, the Latin Empire (known to the East Romans as the Frankokratia or the Latin Occupation) was established and Baldwin of Flanders was crowned Emperor Baldwin I of Constantinople in the Hagia Sophia. After the city's sacking, most of the East Roman Empire's territories were divided up among the Crusaders. East Roman aristocrats also established a number of small independent splinter states, one of them being the Empire of Nicaea, which would eventually recapture Constantinople in 1261 and proclaim the reinstatement of the Empire.\nFollowing the recapture of Constantinople in 1261, Venice's privileged position deteriorated. In 1268, the East Roman Empire and the Republic of Venice agreed to temporarily end the hostilities which had erupted after Emperor Michael VIII Palaiologos success in 1261. It would be renegotiated and extended for two years with the Byzantine–Venetian treaty of 1277. The Byzantine–Venetian War (1296–1302) was an offshoot of the second Venetian–Genoese War of 1294–1299.\nOther notable events\n* Nicaean–Venetian treaty of 1219\n* Treaty of Gallipoli\n* Byzantine civil war of 1341–1347\n* Byzantine civil war of 1373–1379\nEast Roman and Eastern Europe relations\nBulgarian relations: 7th–14th centuries\n()]]\n]]\nEnding eighty years of peace between the two states, the powerful Bulgarian Tsar Simeon I invaded in 894 but was pushed back by the East Romans, who sailed up the Black Sea to attack the Bulgarian rear, enlisting the support of the Hungarians. The East Romans were defeated at the Battle of Boulgarophygon in 896 and agreed to pay annual subsidies to the Bulgarians.\nLeo the Wise died in 912, and hostilities resumed as Simeon marched to Constantinople at the head of a large army. Although the walls of the city were impregnable, the East Roman administration was in disarray and Simeon was invited into the city, where he was granted the crown of basileus (emperor) of Bulgaria and had the young Emperor Constantine VII marry one of his daughters. When a revolt in Constantinople halted his dynastic project, he again invaded Thrace and conquered Adrianople. The empire now faced the problem of a powerful Christian state within a few days' marching distance from Constantinople, as well as having to fight on two fronts.\nA great imperial expedition under Leo Phocas and Romanos I Lekapenos ended with another crushing East Roman defeat at the Battle of Achelous in 917, and the following year the Bulgarians were free to ravage northern Greece. Adrianople was plundered again in 923, and a Bulgarian army laid siege to Constantinople in 924. Simeon died suddenly in 927 and Bulgarian power collapsed with him. Bulgaria and Byzantium entered a long period of peaceful relations, and the empire was free to concentrate on the eastern front against the Muslims. In 968, Bulgaria was overrun by the Rus' under Sviatoslav I, but three years later, John I Tzimiskes defeated the Rus' and re-incorporated eastern Bulgaria into the East Roman Empire.\nBulgarian resistance revived under the Cometopuli dynasty, but Emperor Basil II () made the submission of the Bulgarians his primary goal. Basil's first expedition against Bulgaria resulted in a defeat at the Gates of Trajan. For the next few years, the emperor was preoccupied with internal revolts in Anatolia, while the Bulgarians expanded their realm in the Balkans. The war dragged on for nearly twenty years. The East Roman victories of Spercheios and Skopje decisively weakened the Bulgarian army, and in annual campaigns Basil methodically reduced the Bulgarian strongholds. At the Battle of Kleidion in 1014 the Bulgarians were annihilated: their army was captured, and it is said that 99 out of every 100 men were blinded, with the hundredth man left with one eye so he could lead his compatriots home. When Tsar Samuil saw the broken remains of his once formidable army, he died of shock. By 1018, the last Bulgarian strongholds had surrendered, and the country became part of the empire. This victory restored the Danube frontier, which had not been held since the days of the Emperor Heraclius.\nSee also\n* Byzantine–Bulgarian treaty of 716\n* Byzantine–Bulgarian treaty of 815\n* Christianization of Bulgaria\n* Sviatoslav's invasion of Bulgaria\nRus relations: 9th–15th centuries\nunder the walls of Constantinople (860)]]\n]]\nBetween 850 and 1100, the empire developed a mixed relationship with the Kievan Rus', which had emerged to the north across the Black Sea. This relationship had long-lasting repercussions in the history of the East Slavs, and the empire quickly became the main trading and cultural partner for Kiev. The Rus' launched their first attack against Constantinople in 860, pillaging the suburbs of the city. In 941, they appeared on the Asian shore of the Bosphorus, but this time they were crushed, an indication of the improvements in the East Roman military position after 907, when only diplomacy had been able to push back the invaders. Basil II could not ignore the emerging power of the Rus', and following the example of his predecessors he used religion as a means for achieving political purposes. Rus'–Byzantine relations became closer following the marriage of Anna Porphyrogeneta to Vladimir the Great in 988, and the subsequent Christianisation of the Rus'. East Roman priests, architects, and artists were invited to work on numerous cathedrals and churches around Rus', expanding East Roman cultural influence even further, while numerous Rus' served in the East Roman army as mercenaries, most notably as the famous Varangian Guard.\nEven after the Christianisation of the Rus', relations were not always friendly. The most serious conflict between the two powers was an invasion of Bulgaria in 968, but several Rus' raiding expeditions against the East Roman cities of the Black Sea coast and Constantinople are also recorded. Although most were repulsed, they were often followed by treaties that were generally favourable to the Rus', such as the one concluded at the end of the war of 1043, during which the Rus' indicated their ambitions to compete with the East Romans as an independent power.\nOther relations\nEast Roman and Vandal relations: 3rd–7th centuries\nRelations between the East Roman Empire and the Kingdom of the Vandals were marked by periodic outbursts of hostility between the two powers. The Vandals seized Carthage and Northern Africa from the western Roman empire in 439 A.D. The attack caused the East Romans to fear a potential Vandalic attack on Constantinople and take precautions against it. An expedition was briefly launched against them in 441, but recalled soon after due to other pressures on the state. However, the Vandals would begin launching raids against Byzantium in the middle of the century.  The first major military action against them was the disastrous expedition launched in tandem with the forces of the western empire in 469. At Cape Bon, over 100 Roman ships were destroyed by Vandal fire ships, debatably due to the treachery or incompetence of the Roman commander, Basiliscus. This failure would eventually spell the doom of the western empire, while causing a massive drain on the resources of the Eastern empire.  The last major confrontation between the Vandals and the East Romans would come in the Vandalic War, wherein East Roman troops under the command of Belisarius successfully invaded North Africa and destroyed the Vandalic kingdom under Gelimer. The Vandal state was annexed into East Roman territory.\nSee also\n* List of Byzantine wars\n* List of Byzantine battles\nNotes\nReferences\nWorks cited\n*\n*\n*\n*\n**\n**\n**\n**\n**\n**\n**\n**\n*\n*\n*\n*\n*\n*\n*\n*\n*\n**\n**\n**\n**\n**\n**\n*\n*\n*"
    }
  ]
}