{
  "content": [
    {
      "type": "text",
      "text": "# Foreign relations of the United Kingdom__disambig_1\n\nThe diplomatic foreign relations of the United Kingdom are conducted by the Foreign, Commonwealth and Development Office, headed by the foreign secretary. The prime minister and numerous other agencies play a role in setting policy, and many institutions and businesses have a voice and a role.\nThe United Kingdom was the world's foremost power during the 19th and early 20th centuries, most notably during the so-called \"Pax Britannica\"a period of unrivaled supremacy and unprecedented international peace during the mid-to-late 1800s. The country continued to be widely considered a superpower until the Suez crisis of 1956 and the dismantling of the British Empire left the UK's dominant role in global affairs to be gradually diminished. Nevertheless, the United Kingdom remains a great power and a permanent member of the United Nations Security Council. The UK is a founding member of AUKUS, the Commonwealth, the Council of Europe, the European Court of Human Rights, the G7, the G20, the International Criminal Court, NATO, the OECD, the OSCE, the World Health Organization, and the World Trade Organization, additionally the UK is a member of CPTPP. The UK was also a founding member state of the European Union, however due to the outcome of a 2016 membership referendum, proceedings to withdraw from the EU began in 2017 and concluded when the UK formally left the EU on 31 January 2020, and the transition period on 31 December 2020 with an EU trade agreement. Since the vote and the conclusion of trade talks with the EU, policymakers have begun pursuing new trade agreements with other global partners.\nHistory\n- a Peninsular War battle between the French and the British armies in France in 1813]]\nFollowing the formation of the Kingdom of Great Britain (which united England and Scotland) in 1707, British foreign relations largely continued those of the Kingdom of England. British foreign policy initially focused on achieving a balance of power within Europe, with no one country achieving dominance over the affairs of the continent. This policy remained a major justification for Britain's wars against Napoleon, and for British involvement in the First and Second World Wars. Secondly Britain continued the expansion of its colonial \"First British Empire\" by migration and investment.\nFrance was the chief enemy until the defeat of Napoleon in 1815. It had a much larger population and a more powerful army, but a weaker navy. The British were generally successful in their many wars. The notable exception, the American War of Independence (1775–1783), saw Britain, without any major allies, defeated by the American colonials who had the support of France, the Netherlands and (indirectly) Spain. A favoured British diplomatic strategy involved subsidising the armies of continental allies (such as Prussia), thereby turning London's enormous financial power to military advantage. Britain relied heavily on its Royal Navy for security, seeking to keep it the most powerful fleet afloat, eventually with a full complement of bases across the globe. British dominance of the seas was vital to the formation and maintaining of the British Empire, which was achieved through the support of a navy larger than the next two largest navies combined, prior to 1920. The British generally stood alone until the early 20th century, when it became friendly with the U.S. and made alliances with Japan, France and Russia and Germany former antagonist now ally.\n1814–1914\n(as of 1910). At its height, it was the largest empire in history.]]\nThe 100 years were generally peaceful—a sort of Pax Britannica enforced by the Royal Navy.  There were two important wars, both limited in scope. The Crimean War (1853–1856) saw the defeat of Russia and its threat to the Ottoman Empire. The Second Boer War (1899–1902) saw the defeat of the two Boer republics in South Africa and Boxer Rebellion happen the same year. London became the world's financial centre, and commercial enterprise expanded across the globe. The \"Second British Empire\" was built with a base in Asia (especially India) and Africa.\nFirst World War\n1920s\nAfter 1918 Britain was a \"troubled giant\" that was less of a dominant diplomatic force in the 1920s than before. It often had to give way to the United States, which frequently exercised its financial superiority.  The main themes of British foreign policy included a leading role at the Paris Peace Conference of 1919–1920, where Lloyd George worked hard to moderate French demands for revenge on Germany. He was partly successful, but Britain soon had to moderate French policy toward Germany further, as in the Locarno Treaties of 1925.  Furthermore, Britain obtained \"mandates\" that allowed it and its dominions to govern most of the former German and Ottoman colonies.\nBritain became an active member of the new League of Nations, but its list of major achievements was slight.\nDisarmament was high on the agenda, and Britain played a major role following the United States in the Washington Naval Conference of 1921 in working toward naval disarmament of the major powers.  By 1933 disarmament agreements had collapsed and the issue became rearming for a war against Germany.\nBritain was partially successful in negotiating better terms with United States regarding the large war loans which Britain was obliged to repay. Britain supported the international solution to German reparations through the Dawes Plan and the Young Plan. After the Dawes Plan had helped stabilize Germany's currency and lowered its annual payments, Germany was able to pay its annual reparations using money borrowed from New York banks, and Britain used the money received to pay Washington. The Great Depression starting in 1929 put enormous pressure on the British economy. Britain revived Imperial Preference, which meant low tariffs within the British Empire and higher barriers to trade with outside countries. The flow of money from New York dried up, and the system of reparations and payment of debt died in 1931.\nIn domestic British politics, the emerging Labour Party had a distinctive and suspicious foreign policy based on pacifism. Its leaders believed that peace was impossible because of capitalism, secret diplomacy, and the trade in armaments. Labour stressed material factors that ignored the psychological memories of the Great War and the highly emotional tensions regarding nationalism and the boundaries of countries.  Nevertheless, party leader Ramsay MacDonald devoted much of his attention to European policies.\n1930s\n, which gave the Sudetenland to Nazi Germany.]]\nVivid memories of the horrors and deaths of the First World War inclined many Britons—and their leaders in all parties—to pacifism in the interwar era. This led directly to the appeasement of dictators (notably of Mussolini and of Hitler) in order to avoid their threats of war.\nThe challenge came from those dictators, first from Benito Mussolini, Duce of Italy, then from Adolf Hitler, Führer of a much more powerful Nazi Germany. The League of Nations proved disappointing to its supporters; it failed to resolve any of the threats posed by the dictators. British policy involved \"appeasing\" them in the hopes they would be satiated. By 1938 it was clear that war was looming, and that Germany had the world's most powerful military. The final act of appeasement came when Britain and France sacrificed Czechoslovakia to Hitler's demands at the Munich Agreement of September 1938. Instead of satiation, Hitler menaced Poland, and at last Prime Minister Neville Chamberlain dropped appeasement and stood firm in promising to defend Poland (31 March 1939). Hitler however cut a deal with Joseph Stalin to divide Eastern Europe (23 August 1939); when Germany did invade Poland in September 1939, Britain and France declared war, and the British Commonwealth followed London's lead.\nSecond World War\nHaving signed the Anglo-Polish military alliance in August 1939, Britain and France declared war against Germany in September 1939 in response to Germany's invasion of Poland. This declaration included the Crown colonies and India, which Britain directly controlled. The dominions were independent in foreign policy, though all quickly entered the war against Germany. After the French defeat in June 1940, Britain and its empire stood alone in combat against Germany, until June 1941. The United States gave diplomatic, financial and material support, starting in 1940, especially through Lend Lease, which began in 1941 and attain full strength during 1943. In August 1941, Churchill and Roosevelt met and agreed on the Atlantic Charter, which proclaimed \"the rights of all peoples to choose the form of government under which they live\" should be respected. This wording was ambiguous and would be interpreted differently by the British, Americans, and nationalist movements.\nStarting in December 1941, Japan overran British possessions in Asia, including Hong Kong, Malaya, and especially the key base at Singapore. Japan then marched into Burma, headed toward India. Churchill's reaction to the entry of the United States into the war was that Britain was now assured of victory and the future of the empire was safe, but the rapid defeats irreversibly harmed Britain's standing and prestige as an imperial power. The realisation that Britain could not defend them pushed Australia and New Zealand into permanent close ties with the United States.\nPostwar\nin 2016 (blue) and military interventions since 2000 (red).]]\nEconomically in dire straits in 1945 (saddled with debt and dealing with widespread destruction of its infrastructure), Britain systematically reduced its overseas commitments. It pursued an alternate role as an active participant in the Cold War against communism, especially as a founding member of NATO in 1949.\nThe British had built up a very large worldwide Empire, which peaked in size in 1922, after more than half a century of unchallenged global supremacy. The cumulative costs of fighting two world wars, however, placed a heavy burden upon the home economy, and after 1945 the British Empire rapidly began to disintegrate, with all the major colonies gaining independence. By the mid-to-late 1950s, the UK's status as a superpower was gone in the face of the United States and the Soviet Union. Most former colonies joined the \"Commonwealth of Nations\", an organisation of fully independent nations now with equal status to the UK. However it attempted no major collective policies. The last major colony, Hong Kong, was handed over to China in 1997. Fourteen British Overseas Territories maintain a constitutional link to the UK, but are not part of the country per se.\nBritain slashed its involvements in the Middle East after the humiliating Suez Crisis of 1956. However Britain did forge close military ties with the United States, France, and Germany, through the NATO military alliance. After years of debate (and rebuffs), Britain joined the Common Market in 1973; which became the European Union in 1993. However it did not merge financially, and kept the pound separate from the Euro, which partly isolated it from the Euro area crisis. In June 2016, the UK voted to leave the EU.\n21st century\nwith US President Joe Biden at the White House, July 2024]]\nForeign policy initiatives of UK governments since the 1990s have included military intervention in conflicts and for peacekeeping, humanitarian assistance programmes and increased aid spending, support for establishment of the International Criminal Court, debt relief for developing countries, prioritisation of initiatives to address climate change, and promotion of free trade. The British approach has been described as \"spread the right norms and sustain NATO\".\nLunn et al. (2008) argue:\n:Three key motifs of Tony Blair's 10-year premiership were an activist philosophy of 'interventionism', maintaining a strong alliance with the US and a commitment to placing Britain at the heart of Europe. While the 'special relationship' and the question of Britain's role in Europe have been central to British foreign policy since the Second World War...interventionism was a genuinely new element.\nThe GREAT campaign of 2012 was one of the most ambitious national promotion efforts ever undertaken by any major nation. It was scheduled take maximum advantage of the worldwide attention to the Summer Olympics in London. The goals were to make British more culture visible in order to stimulate trade, investment and tourism. The government partnered with key leaders in culture, business, diplomacy and education. The campaign unified many themes and targets, including business meetings; scholarly conventions; recreational vehicle dealers; parks and campgrounds; convention and visitors bureaus; hotels; bed and breakfast inns; casinos; and hotels.\nIn 2013, the government of David Cameron described its approach to foreign policy by saying:\n:For any given foreign policy issue, the UK potentially has a range of options for delivering impact in our national interest. ... [W]e have a complex network of alliances and partnerships through which we can work.... These include – besides the EU – the UN and groupings within it, such as the five permanent members of the Security Council (the “P5”); NATO; the Commonwealth; the Organisation for Economic Cooperation and Development; the G8 and G20 groups of leading industrialised nations; and so on.\nThe UK began establishing air and naval facilities in the Persian Gulf, located in the United Arab Emirates, Bahrain and Oman in 2014–15. The Strategic Defence and Security Review 2015 highlighted a range of foreign policy initiatives of the UK government. Edward Longinotti notes how current British defence policy is grappling with how to accommodate two major commitments, to Europe and to an ‘east of Suez’ global military strategy, within a modest defence budget that can only fund one. He points out that Britain's December 2014 agreement to open a permanent naval base in Bahrain underlines its gradual re-commitment east of Suez. By some measures, Britain remains the second most powerful country in the world by virtue of its soft power and \"logistical capability to deploy, support and sustain [military] forces overseas in large numbers.\" Although commentators have questioned the need for global power projection, the concept of “Global Britain” put forward by the Conservative government in 2019 signalled more military activity in the Middle East and Pacific, outside of NATO's traditional sphere of influence.\nAt the end of January 2020, the United Kingdom left the European Union, with a subsequent trade agreement with the EU in effect from 1 January 2021, setting out the terms of the UK-EU economic relationship and what abilities the Foreign, Commonwealth & Development Office can use in foreign relations related to trade.\nDiplomatic relations\nBritish diplomatic relations date back to the 13th century. The United Kingdom has established diplomatic relations with all United Nations members, aside from Bhutan, in addition to 2 Non-UN member states: Holy See, and Kosovo. Moreover, the UK established official relations with the Sovereign Military Order of Malta on 9 October 2024. The following table lists the date from which diplomatic relations were established with other countries:\n{| class=\"wikitable sortable\"\n|+ List of diplomatic relations of the United Kingdom\n|-\n!Country\n!Date\n!source\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n| Syria\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|}\nBilateral relations\nAfrica\n{| class=\"wikitable sortable\"\n! Country\n! Since\n!class=unsortable|Notes\n|- valign=\"top\"\n|||||See Algeria–United Kingdom relations\nwith Algerian Prime Minister Abdelmalek Sellal in Algeriasouth afr, January 2013.]]\nThe UK established diplomatic relations with Algeria in 1962.\n*Algeria maintains an embassy in London.\n* The United Kingdom is accredited to Algeria through its embassy in Algiers.\nBoth countries share common membership of the United Nations, the World Health Organization, and the World Trade Organization. Bilaterally the two countries have a Double Tax Convention, and a Strategic Partnership.\n|- valign=\"top\"\n||||| See Angola–United Kingdom relations\nDavid Lammy with Angolan President João Lourenço in Brussels, June 2025.]]\nThe UK established diplomatic relations with Angola on 14 October 1977.\n*Angola maintains an embassy in London.\n* The United Kingdom is accredited to Angola through its embassy in Luanda.\nBoth countries share common membership of the Atlantic Co-operation Pact, the United Nations, the World Health Organization, and the World Trade Organization. Bilaterally the two countries have a High Level Prosperity Partnership.\n|- valign=\"top\"\n|||||See Benin–United Kingdom relations\nThe UK established diplomatic relations with Benin on 6 October 1960, then known as Dahomey.\n*Benin does not maintain an embassy in the United Kingdom.\n*The United Kingdom is not accredited to Benin through an embassy; the UK develops relations through its high commission in Accra, Ghana.\nBoth countries share common membership of the Atlantic Co-operation Pact, the International Criminal Court, the United Nations, and the World Trade Organization. Bilaterally the two countries have an Investment Agreement.\n|- valign=\"top\"\n|||||See Botswana–United Kingdom relations\nin Botswana, February 2012.]]\nThe UK established diplomatic relations with Botswana on 30 September 1966.\n*Botswana maintains a high commission in London.\n* The United Kingdom is accredited to Botswana through its high commission in Gaborone.\nThe UK governed Botswana from 1885 to 1966, when it achieved full independence.\nBoth countries share common membership of the Commonwealth, the International Criminal Court, the United Nations, and the World Trade Organization, as well as the SACUM–UK Economic Partnership Agreement. Bilaterally the two countries have a Double Tax Convention.\n|- valign=\"top\"\n|||||See Foreign relations of Burkina Faso\nwith Burkinabè President Blaise Compaoré in London, January 2011.]]\nThe UK established diplomatic relations with Burkina Faso on 6 October 1960, then known as Upper Volta.\n*Burkina Faso does not maintain an embassy in the United Kingdom.\n*The United Kingdom is not accredited to Burkina Faso through an embassy; the UK develops relations through its high commission in Accra, Ghana.\nBoth countries share common membership of the International Criminal Court, the United Nations, and the World Trade Organization.\n|- valign=\"top\"\n|||||See Foreign relations of Burundi\nThe UK established diplomatic relations with Burundi on 1 July 1962.\n*Burundi maintains an embassy in London.\n* The United Kingdom is accredited to Burundi through its embassy office in Bujumbura.\nBoth countries share common membership of the United Nations, and the World Trade Organization. Bilaterally the two countries have an Investment Agreement.\n|- valign=\"top\"\n|||||See Cameroon–United Kingdom relations\nwith Cameroonian Prime Minister Pierre Moukoko Mbonjo, September 2013.]]\nThe UK established diplomatic relations with Cameroon on 1 February 1960.\n*Cameroon maintains a high commission in London.\n* The United Kingdom is accredited to Cameroon through its high commission in Yaoundé.\nThe UK governed western Cameroon from 1916 to 1961, when it joined the Federal Republic of Cameroon.\nBoth countries share common membership of the Commonwealth, the United Nations, and the World Trade Organization. Bilaterally the two countries have an Economic Partnership Agreement.\n|- valign=\"top\"\n|||||See Foreign relations of the Central African Republic\nThe UK established diplomatic relations with the Central African Republic on 9 December 1960.\n*The Central African Republic does not maintain an embassy in the UK.\n* The United Kingdom is not accredited to the Central African Republic through an embassy; the UK develops relations through its embassy in Kinshasa, DR Congo.\nBoth countries share common membership of the International Criminal Court, the United Nations, and the World Trade Organization.\n|- valign=\"top\"\n|||||See Foreign relations of Chad\nThe UK established diplomatic relations with Chad on 9 December 1960.\n*Chad does not maintain an embassy in the UK.\n* The United Kingdom is accredited to Chad through its embassy in N'Djamena.\nBoth countries share common membership of the International Criminal Court, the United Nations, and the World Trade Organization. Bilaterally the two countries have a Development Partnership.\n|- valign=\"top\"\n|||||See Foreign relations of the Comoros\nThe UK established diplomatic relations with the Comoros on 3 October 1977.\n*The Comoros  does not maintain an embassy in the UK.\n*The United Kingdom  is not accredited to the Comoros through an embassy; the UK develops relations through its embassy in Antananarivo, Madagascar.\nBoth countries share common membership of the International Criminal Court, the United Nations, the World Health Organization, and the World Trade Organization, as well as the Eastern and Southern Africa–UK Economic Partnership Agreement.\n|- valign=\"top\"\n|||||See Democratic Republic of the Congo–United Kingdom relations\nwith Congolese President Felix Tshisekedi in London, October 2022.]]\nThe UK established diplomatic relations with the Democratic Republic of the Congo on 7 July 1960.\n* The Democratic Republic of the Congo maintains an embassy in London.\n* The United Kingdom is accredited to the Democratic Republic of the Congo through its embassy in Kinshasa.\nBoth countries share common membership of the International Criminal Court, the United Nations, and the World Trade Organization. Bilaterally the two countries have a Development Partnership.\n|- valign=\"top\"\n|||||See Foreign relations of Djibouti\nMahamoud Ali Youssouf in London, May, 2013.]]\nThe UK established diplomatic relations with Djibouti on 25 January 1978.\n*Djibouti does not maintain an embassy in the UK.\n* The United Kingdom is accredited to Djibouti through its embassy in Djibouti.\nBoth countries share common membership of the International Criminal Court, the United Nations, and the World Trade Organization.\n|- valign=\"top\"\n|||  ||See Egypt–United Kingdom relations\nAbdel Fattah el-Sisi at COP27 in Sharm El Sheikh, October 2023.]]\nThe UK established diplomatic relations with Egypt on 19 December 1914.\n*Egypt maintains an embassy in London.\n* The United Kingdom is accredited to Egypt through its embassy in Cairo.\nThe UK governed Egypt from 1882 to 1956, when it achieved full independence.\nBoth countries share common membership of the United Nations, the World Health Organization, and the World Trade Organization. Bilaterally the two countries have an Association Agreement, a Development Partnership, and a Double Taxation Convention.\n|- valign=\"top\"\n|||||See Foreign relations of Equatorial Guinea\nThe UK established diplomatic relations with Equatorial Guinea on 20 June 1969.\n*Equatorial Guinea does not maintain an embassy in the United Kingdom; the Equatoguinean government closed its embassy in London.\n* The United Kingdom is not accredited to Equatorial Guinea through an embassy; the UK develops relations through its high commission in Yaoundé, Cameroon.\nBoth countries share common membership of the Atlantic Co-operation Pact, and the United Nations.\n|- valign=\"top\"\n|||||See Eritrea–United Kingdom relations\nThe UK established diplomatic relations with Eritrea on 16 November 1993.\n*Eritrea maintains an embassy in London.\n*The United Kingdom is accredited to Eritrea through its embassy in Asmara.\nThe UK governed Eritrea from 1941 to 1952, when Eritrea united with Ethiopia into a federation.\nBoth countries share common membership of  the United Nations.\n|- valign=\"top\"\n|||||See Eswatini–United Kingdom relations\nThe UK established diplomatic relations with Eswatini on 6 September 1968.\n*Eswatini maintains a high commission in London.\n* The United Kingdom is accredited to Eswatini through its high commission in Mbabane.\nThe UK governed Eswatini from 1903 to 1968, when it achieved full independence.\nBoth countries share common membership of the Commonwealth, the United Nations, and the World Trade Organization, as well as the SACUM–UK Economic Partnership Agreement. Bilaterally the two countries have a Double Tax Convention, an Investment Agreement.\n|- valign=\"top\"\n|||||See Ethiopia–United Kingdom relations\nwith Ethiopian Emperor Haile Selassie in 10 Downing Street, October 1954.]]\nThe UK established diplomatic relations with Ethiopia in 1841.\n*Ethiopia maintains an embassy in London.\n* The United Kingdom is accredited to Ethiopia through its embassy in Addis Ababa.\nThe UK governed Ethiopia from 1941 to 1942. The UK continued to governed the regions of Ogaden and Haud from 1941, until both territories were relinquished to Ethiopia in 1948 and 1955 respectively.\nBoth countries share common membership of the United Nations. Bilaterally the two countries have a Development Partnership, a Double Taxation Convention, and an Investment Agreement.\n|- valign=\"top\"\n|||||See Gabon–United Kingdom relations\nAli Bongo in London, February 2014.]]\nThe UK established diplomatic relations with Gabon on 9 December 1960.\n*Gabon maintains a high commission in London.\n* The United Kingdom is accredited to Gabon through an honoury consul in Libreville.\nBoth countries share common membership of the Atlantic Co-operation Pact, the Commonwealth, the International Criminal Court, the United Nations, and the World Trade Organization.\n|- valign=\"top\"\n|||||See The Gambia–United Kingdom relations\nThe UK established diplomatic relations with the Gambia on 1 January 1965.\n*The Gambia maintains a high commission in London.\n* The United Kingdom is accredited to the Gambia through its high commission in Banjul.\nThe UK governed the Gambia from 1816 to 1965, when The Gambia achieved full independence.\nBoth countries share common membership of the Atlantic Co-operation Pact, the Commonwealth, the International Criminal Court, the United Nations, the World Health Organization, and the World Trade Organization. Bilaterally the two countries have a Double Taxation Convention, and an Investment Agreement.\n|- valign=\"top\"\n|||||See Ghana–United Kingdom relations\nNana Akufo-Addo in 10 Downing Street, April 2022.]]\nThe UK established diplomatic relations with Ghana on 6 March 1957.\n*Ghana maintains a high commission in London.\n* The United Kingdom is accredited to Ghana through its high commission in Accra.\nThe UK governed Ghana from 1821 to 1957, when Ghana achieved full independence.\nBoth countries share common membership of the Atlantic Co-operation Pact, the Commonwealth, the International Criminal Court, the United Nations, and the World Trade Organization. Bilaterally the two countries have a Development Partnership, an Interim Trade Partnership Agreement, a High Level Prosperity Partnership, and an Investment Agreement.\n|- valign=\"top\"\n|||||See Foreign relations of Guinea\nThe UK established diplomatic relations with Guinea on 28 May 1959.\n*Guinea maintains an embassy in London.\n* The United Kingdom is accredited to Guinea through its embassy in Conakry.\nBoth countries share common membership of the Atlantic Co-operation Pact, the International Criminal Court, the United Nations, and the World Trade Organization.\n|- valign=\"top\"\n|||||See Foreign relations of Guinea-Bissau\nThe UK established diplomatic relations with Guinea-Bissau on 12 March 1975.\n*Guinea-Bissau does not maintain an embassy in the United Kingdom.\n*The United Kingdom is not accredited to Guinea-Bissau through an embassy; the UK develops relations through its embassy in Dakar, Senegal.\nThe UK governed parts of Guinea-Bissau from 1792 to 1870, when it was ceded to Portugal.\nBoth countries share common membership of Atlantic Co-operation Pact, the United Nations, and the World Trade Organization.\n|- valign=\"top\"\n|||||See Ivory Coast–United Kingdom relations\nMark Simmonds with Ivorian Prime Minister Daniel Kablan Duncan in London, June 2013.]]\nThe UK established diplomatic relations with Ivory Coast on 12 October 1960.\n*Ivory Coast maintains an embassy in London.\n* The United Kingdom is accredited to Ivory Coast through its embassy in Abidjan.\nBoth countries share common membership of the Atlantic Co-operation Pact, the International Criminal Court, the United Nations, the World Trade Organization, and the World Trade Organization. Bilaterally the two countries have an Economic Partnership Agreement, a High Level Prosperity Partnership, and an Investment Agreement.\n|- valign=\"top\"\n|||||See Kenya–United Kingdom relations\nWilliam Ruto at a United Nations General Assembly in New York City, September 2024.]]\nThe UK established diplomatic relations with Kenya in 1963.\n*Kenya maintains a high commission in London.\n* The United Kingdom is accredited to Kenya through its high commission in Nairobi.\nThe UK governed Kenya from 1895 to 1963, when Kenya achieved full independence.\nBoth countries share common membership of the Commonwealth, the International Criminal Court, the United Nations, the World Health Organization, and the World Trade Organization. Bilaterally the two countries have an Economic Partnership Agreement, a Defence Cooperation Agreement, a Development Partnership, a Double Taxation Agreement, and an Investment Agreement.\n|- valign=\"top\"\n|||||See Lesotho–United Kingdom relations\nwith Masotho Prime Minister Tom Thabane in London, April 2014.]]\nThe UK established diplomatic relations with Lesotho on 4 October 1966.\n*Lesotho maintains a high commission in London.\n* The United Kingdom is accredited to Lesotho through its high commission in Maseru.\nThe UK governed Lesotho from 1868 to 1966, when it achieved full independence.\nBoth countries share common membership of the Commonwealth, the United Nations, the World Trade Organization, and the World Trade Organization, as well as the SACUM–UK Economic Partnership Agreement.  Bilaterally the two countries have an Investment Agreement.\n|- valign=\"top\"\n|||||See Liberia–United Kingdom relations\nEllen Johnson Sirleaf in London, November 2012.]]\nThe UK established diplomatic relations with Liberia on 1 August 1849.\n*Liberia maintains an embassy in London.\n* The United Kingdom is accredited to Liberia through its embassy in Monrovia.\nBoth countries share common membership of the Atlantic Co-operation Pact, the International Criminal Court, the United Nations, and the World Trade Organization. Bilaterally the two countries have a Development Partnership. and a Tax Information Exchange Agreement.\n|- valign=\"top\"\n|||||See Libya–United Kingdom relations\nAbdul Hamid Dbeibeh in 10 Downing Street, June 2021.]]\nThe UK established diplomatic relations with Libya on 24 December 1951.\n*Libya maintains an embassy in London.\n*The United Kingdom is accredited to Libya through its embassy in Tripoli.\nThe UK governed Libya from 1942 to 1951, when Libya gained full independence.\nBoth countries share common membership of the United Nations. Bilaterally the two countries have a Double Taxation Agreement, and have signed an Investment Agreement.\n|- valign=\"top\"\n|||||See Madagascar–United Kingdom relations\nJames Duddridge with Malagasy President Hery Rajaonarimampianina in London, November 2015.]]\nThe UK established diplomatic relations with Madagascar on 27 June 1960.\n*Madagascar maintains an embassy in London.\n*The United Kingdom is accredited to Madagascar through its embassy in Antananarivo.\nThe UK governed Madagascar from 1942 to 1943, when Madagascar was transferred to France.\nBoth countries share common membership of the International Criminal Court, the United Nations, and the World Trade Organization, as well as the Eastern and Southern Africa–UK Economic Partnership Agreement. Bilaterally the two countries have a Development Partnership.\n|- valign=\"top\"\n|||||See Malawi–United Kingdom relations\nThe UK established diplomatic relations with Malawi on 6 July 1964.\n*Malawi maintains a high commission in London.\n* The United Kingdom is accredited to Malawi through its high commission in Lilongwe.\nThe UK governed Malawi from 1893 until 1964, when Malawi gained full independence.\nBoth countries share common membership of the Commonwealth, the International Criminal Court, the United Nations, and the World Trade Organization. Bilaterally the two countries have a Development Partnership, and a Double Taxation Agreement.\n|- valign=\"top\"\n|||||See Foreign relations of Mali\nThe UK established diplomatic relations with Mali on 22 March 1961.\n* Mali does not maintain an embassy in the United Kingdom.\n* The United Kingdom is accredited to Mali through its embassy in Bamako.\nBoth countries share common membership of the International Criminal Court, the United Nations, and the World Trade Organization.\n|- valign=\"top\"\n|||||See Foreign relations of Mauritania\nHamady Ould Hamady in Nouakchott, October 2011.]]\nThe UK established diplomatic relations with Mauritania on 28 November 1960.\n* Mauritania maintains an embassy in London.\n* The United Kingdom is accredited to Mauritania through its embassy in Nouakchott.\nBoth countries share common membership of the Atlantic Co-operation Pact, the United Nations, and the World Trade Organization. Bilaterally the two countries have a Development Partnership.\n|- valign=\"top\"\n|||||See Mauritius–United Kingdom relations\nwith Mauritian Prime Minister Pravind Jugnauth at a United Nations General Assembly in New York City, September 2022.]]\nThe UK established diplomatic relations with Mauritius on 12 March 1968.\n*Mauritius maintains a high commission in London.\n* The United Kingdom is accredited to Mauritius through its high commission in Port Louis.\nThe UK governed Mauritius from 1810 to 1968, when Mauritius achieved full independence.\nBoth countries share common membership of the Commonwealth, the International Criminal Court, the United Nations, the World Health Organization, and the World Trade Organization, as well as the Eastern and Southern Africa–UK Economic Partnership Agreement. Bilaterally the two countries have a Double Tax Convention.\n|- valign=\"top\"\n|||||See Morocco–United Kingdom relations\nNasser Bourita in Rabat, June 2025.]]\nThe UK established diplomatic relations with Morocco on 28 June 1956.\n* Morocco maintains an embassy in London.\n* The United Kingdom is accredited to Morocco through its embassy in Rabat.\nBoth countries share common membership of the Atlantic Co-operation Pact, the United Nations, and the World Trade Organization. Bilaterally the two countries have an Association Agreement, and an Investment Agreement.\n|- valign=\"top\"\n|||||See Mozambique–United Kingdom relations\nArmando Guebuza in 10 Downing Street, May 2012.]]\nThe UK established diplomatic relations with Mozambique on 27 August 1975.\n*Mozambique maintains a high commission in London.\n* The United Kingdom is accredited to Mozambique through its high commission in Maputo.\nBoth countries share common membership of the Commonwealth, the United Nations, and the World Trade Organization, as well as the Southern Africa Customs Union and Mozambique–UK Economic Partnership Agreement. Bilaterally the two countries have a Development Partnership, a High Level Prosperity Partnership, and an Investment Agreement.\n|- valign=\"top\"\n|||||See Namibia–United Kingdom relations\nThe UK established diplomatic relations with Namibia in 1990.\n*Namibia maintains a high commission in London.\n* The United Kingdom is accredited to Namibia through its high commission in Windhoek.\nBoth countries share common membership of the Commonwealth, the International Criminal Court, the United Nations, and the World Trade Organization, as well as the SACUM–UK Economic Partnership Agreement.\n|- valign=\"top\"\n|||||See Foreign relations of Niger\nThe UK established diplomatic relations with Niger on 6 October 1960.\n*Niger maintains a consulate in the Milton Keynes.\n*The United Kingdom is accredited to Niger through its embassy in Niamey.\nBoth countries share common membership of the International Criminal Court, the United Nations, and the World Trade Organization. Bilaterally the two countries have a Development Partnership.\n|- valign=\"top\"\n|||||See Nigeria–United Kingdom relations\nMuhammadu Buhari at a Commonwealth summit in Kigali, June 2022.]]\nThe UK established diplomatic relations with Nigeria on 1 October 1960.\n*Nigeria maintains a high commission in London.\n*The United Kingdom is accredited to Nigeria through its high commission in Abuja, and a deputy high commission in Lagos.\nThe UK governed Nigeria from 1862 to 1960, when Nigeria achieved full independence.\nBoth countries share common membership of the Commonwealth, the International Criminal Court, the United Nations, and the World Trade Organization. Bilaterally the two countries have a Development Partnership, a Double Taxation Agreement, an Enhanced Trade and Investment Partnership, an Investment Agreement, and a Security and Defence Partnership.\n|- valign=\"top\"\n|||||See Foreign relations of the Republic of the Congo\nThe UK established diplomatic relations with the Republic of the Congo on 9 December 1960.\n*The Republic of the Congo maintains an embassy in London.\n* The United Kingdom is not accredited to the Republic of the Congo through an embassy; the UK develops relations through its embassy in Kinshasa, DR Congo.\nBoth countries share common membership of the Atlantic co-operation pact, the International Criminal Court, the United Nations, and the World Trade Organization. Bilaterally the two countries have an Investment Agreement.\n|- valign=\"top\"\n|||||See Rwanda–United Kingdom relations\nPaul Kagame in 10 Downing Street, May 2023.]]\nThe UK established diplomatic relations with Rwanda on 1 July 1962.\n*Rwanda maintains a high commission in London.\n* The United Kingdom is accredited to Rwanda through its high commission in Kigali.\nBoth countries share common membership of the Commonwealth, the United Nations, and the World Trade Organization. Bilaterally the two countries have a Development Partnership.\n|- valign=\"top\"\n|||||See Foreign relations of São Tomé and Príncipe\nThe UK established diplomatic relations with São Tomé and Príncipe on 3 December 1979.\n* São Tomé and Príncipe does not maintain an embassy in the United Kingdom.\n* The United Kingdom is not accredited to São Tomé and Príncipe through an embassy; the UK develops relations through its embassy in Luanda, Angola.\nBoth countries share common membership of the Atlantic co-operation pact, and the United Nations.\n|- valign=\"top\"\n|||||See Senegal–United Kingdom relations\nMadické Niang in London, November 2010.]]\nThe UK established diplomatic relations with Senegal on 20 June 1960.\n*Senegal maintains an embassy in London.\n* The United Kingdom is accredited to Senegal through its embassy in Dakar.\nBoth countries share common membership of the Atlantic Co-operation Pact, the International Criminal Court, the United Nations, and the World Trade Organization. Bilaterally the two countries have a Defence Cooperation Agreement, a Double Tax Convention, an Investment Agreement, and a Technical Cooperation Agreement.\n|- valign=\"top\"\n|||||See Seychelles–United Kingdom relations\nJames Michel in 10 Downing Street, February 2012]]\nThe UK established diplomatic relations with Seychelles on 29 June 1976.\n*Seychelles maintains a high commission in London.\n* The United Kingdom is accredited to Seychelles through its high commission in Victoria.\nThe UK governed Seychelles from 1811 to 1968, when Seychelles achieved full independence.\nBoth countries share common membership of the Commonwealth, the International Criminal Court, the United Nations, the World Health Organization, and the World Trade Organization, as well as the Eastern and Southern Africa–UK Economic Partnership Agreement. Bilaterally the two countries have an Economic Security Partnership.\n|- valign=\"top\"\n|||||See Sierra Leone–United Kingdom relations\nThe UK established diplomatic relations with Sierra Leone in April 1961.\n*Sierra Leone maintains a high commission in London.\n* The United Kingdom is accredited to Sierra Leone through its high commission in Freetown.\nBoth countries share common membership of the Atlantic co-operation pact, the Commonwealth, the International Criminal Court, the United Nations, and the World Trade Organization. Bilaterally the two countries have an Investment Agreement.\n|- valign=\"top\"\n|||||See Somalia–United Kingdom relations\nMohamed Hussein Roble in London, July 2021.]]\nThe UK established diplomatic relations with Somalia on 7 July 1960.\n*Somalia does not maintain an embassy in London.\n* The United Kingdom is accredited to Somalia through its embassy in Mogadishu.\nThe UK governed Somaliland from 1884 to 1940 and 1941–1960, Somaliland achieved full independence on 26 June 1960. The UK also governed the remaining territory of modern Somalia from 1941 to 1950, until it became an Italian Trust Territory. Both of these territories unified on the 1 July 1960 to become Somalia.\nBoth countries share common membership of the United Nations. Bilaterally the two countries have a Development Partnership, and a Strategic Partnership.\n|- valign=\"top\"\n|||N/A||See Somaliland–United Kingdom relations\nThe UK has not established diplomatic relations with Somaliland; the UK does not recognise Somaliland to be a sovereign nation.\n*Somaliland maintains a diplomatic mission in London.\n* The United Kingdom does not have a diplomatic mission in Somaliland.\nThe UK governed Somaliland from 1884 to 1940 and 1941–1960, Somaliland achieved full independence on 26 June 1960. The Republic of Somaliland declared independence from Somalia on 18 May 1991.\n|- valign=\"top\"\n|||||See South Africa–United Kingdom relations\nCyril Ramaphosa in 10 Downing Street, November 2022.]]\nThe UK established diplomatic relations with South Africa on 10 March 1931.\n*South Africa maintains a high commission in London.\n* The United Kingdom is accredited to South Africa through its high commission in Pretoria.\nThe UK governed South Africa from 1806 until 1931, when South Africa gained full independence.\nBoth countries share common membership of the Commonwealth, the G20, the International Criminal Court, the United Nations, and the World Trade Organization, as well as the SACUM–UK Economic Partnership Agreement. Bilaterally the two countries have a Development Partnership, and a Double Taxation Convention.\n|- valign=\"top\"\n|||||See South Sudan–United Kingdom relations\nRiek Machar in London, January 2013.]]\nThe UK established diplomatic relations with South Sudan on 9 July 2011.\n*South Sudan maintains an embassy in London.\n* The United Kingdom is accredited to South Sudan through its embassy in Juba.\nThe UK governed South Sudan from 1899 to 1956, when Sudan achieved full independence.\nBoth countries share common membership of the United Nations. Bilaterally the two countries have a Development Partnership.\n|- valign=\"top\"\n|||||See Sudan–United Kingdom relations\nThe UK established diplomatic relations with Sudan on 3 March 1956.\n*Sudan maintains an embassy in London.\n* The United Kingdom is accredited to Sudan through its embassy in Khartoum. Due to the Battle of Khartoum, the embassy has been temporarily relocated to Addis Ababa, Ethiopia.\nThe UK governed Sudan from 1899 to 1956, when Sudan achieved full independence.\nBoth countries share common membership of the United Nations.\n|- valign=\"top\"\n|||||See Tanzania–United Kingdom relations\nMahmoud Thabit Kombo at a Commonwealth summit in Apia, October 2024.]]\nThe UK established diplomatic relations with Tanzania on 22 April 1964.\n*Tanzania maintains a high commission in London.\n*The United Kingdom is accredited to Tanzania through its high commission in Dar es Salaam.\nThe UK governed Tanganyika from 1916 to 1961, when Tanganyika achieved full independence; the UK governed Zanzibar from 1890 to 1963, when Zanzibar achieved full independence. Both countries unified on 26 April 1964 to become Tanzania.\nBoth countries share common membership of the Commonwealth, the International Criminal Court, the United Nations, and the World Trade Organization. Bilaterally the two countries have a Development Partnership, and a High Level Prosperity Partnership.\n|- valign=\"top\"\n|||||See Togo–United Kingdom relations\nThe UK established diplomatic relations with Togo on 27 April 1960.\n*Togo maintains a high commission in London.\n*The United Kingdom is not accredited to Togo through a high commission; the UK develops relations through its high commission in Accra, Ghana.\nThe UK occupied Togo from 1914 to 1916, when Togo became a French mandate.\nBoth countries share common membership of the Atlantic co-operation pact, the Commonwealth, the United Nations, and the World Trade Organization.\n|- valign=\"top\"\n|||||See Tunisia–United Kingdom relations\nThe UK established diplomatic relations with Tunisia on 19 June 1956.\n*Tunisia maintains an embassy in London.\n* The United Kingdom is accredited to Tunisia through its embassy in Tunis.\nBoth countries share common membership of the International Criminal Court, the United Nations, the World Health Organization, and the World Trade Organization. Bilaterally the two countries have an Association Agreement, a Double Taxation Convention, and an Investment Agreement.\n|- valign=\"top\"\n|||||See Uganda–United Kingdom relations\nJessica Alupo at a Commonwealth summit in Apia, October 2024.]]\nThe UK established diplomatic relations with Uganda on 9 October 1962.\n*Uganda maintains a high commission in London.\n* The United Kingdom is accredited to Uganda through its high commission in Kampala.\nThe UK governed Uganda from 1894 to 1962, when Uganda achieved full independence.\nBoth countries share common membership of the Commonwealth, the International Criminal Court, the United Nations, and the World Trade Organization. Bilaterally the two countries have a Development Partnership, and an Investment Agreement.\n|- valign=\"top\"\n|||||See United Kingdom–Zambia relations\nHakainde Hichilema in Lusaka, August 2023.]]\nThe UK established diplomatic relations with Zambia on 17 October 1964.\n*Zambia maintains a high commission in London.\n* The United Kingdom is accredited to Zambia through its high commission in Lusaka.\nThe UK governed Zambia from 1911 to 1964, when Zambia achieved full independence.\nBoth countries share common membership of the Commonwealth, the International Criminal Court, the United Nations, and the World Trade Organization. Bilaterally the two countries have a Development Partnership, a Double Taxation Agreement, an Energy Africa Partnership Agreement, a Green Growth Compact, and have signed an Investment Agreement.\n|- valign=\"top\"\n|||||See United Kingdom–Zimbabwe relations\nSibusiso Moyo at a Commonwealth summit in London, April 2018.]]\nThe UK established diplomatic relations with Zimbabwe on 18 April 1980.\n*Zimbabwe maintains an embassy in London.\n* The United Kingdom is accredited to Zimbabwe through its embassy in Harare.\nThe UK governed Zimbabwe from 1923 to 1980, when Zimbabwe achieved full independence.\nBoth countries share common membership of the United Nations, and the World Trade Organization, as well as the Eastern and Southern Africa–UK Economic Partnership Agreement. Bilaterally the two countries have a Development Partnership, a Double Taxation Convention, and have signed an Investment Agreement.\n|-\n|}\nAsia\n{| class=\"wikitable sortable\" style=\"width:100%; margin:auto;\"\n|-\n! style=\"width:15%;\"| Country\n! style=\"width:12%;\" | Since\n!Notes\n|- valign=\"top\"\n|||||See Afghanistan–United Kingdom relations\nHamid Karzai in Kabul, June 2010.]]\nThe UK established diplomatic relations with Afghanistan on 22 November 1921. The UK currently recognises the Islamic Republic of Afghanistan government, over the de facto Islamic Emirate of Afghanistan government, as the legal administrator of the country.\n*Afghanistan maintains an embassy in London.\n*The United Kingdom was accredited to Afghanistan through its embassy in Kabul. Following the fall of Kabul, the embassy has been co-located with the British Embassy in Doha, Qatar.\nThe UK governed Afghanistan from 1879–1919, when Afghanistan achieved full independence.\nBoth countries share common membership of the International Criminal Court, the United Nations, the World Health Organization, and the World Trade Organization. Bilaterally the two countries have a Development Partnership.\n|- valign=\"top\"\n|||||See Armenia–United Kingdom relations\nNikol Pashinyan at a European Political Community summit in Blenheim Palace, July 2024.]]\nThe UK established diplomatic relations with Armenia on 20 January 1992.\n*Armenia maintains an embassy in London.\n* The United Kingdom is accredited to Armenia through its embassy in Yerevan.\nBoth countries share common membership of the Council of Europe, the European Court of Human Rights, the International Criminal Court, the OSCE, the United Nations, the World Health Organization, and the World Trade Organization. Bilaterally the two countries have a Double Taxation Convention, an Investment Agreement, and a Strategic Partnership.\n|- valign=\"top\"\n|||||See Azerbaijan–United Kingdom relations\nIlham Aliyev in Downing Street, April 2018.]]\nThe UK established diplomatic relations with Azerbaijan on 11 March 1992.\n*Azerbaijan maintains an embassy in London.\n* The United Kingdom is accredited to Azerbaijan through its embassy in Baku.\nBoth countries share common membership of the Council of Europe, European Court of Human Rights, the OSCE, the United Nations, and the World Health Organization. Bilaterally the two countries have a Double Taxation Agreement, and an Investment Agreement.\n|- valign=\"top\"\n|||||See Bahrain–United Kingdom relations\nSalman bin Hamad Al Khalifa in 10 Downing Street, June 2025.]]\nThe UK established diplomatic relations with Bahrain on 21 August 1971.\n*Bahrain maintains an embassy in London.\n*The United Kingdom is accredited to Bahrain through its embassy in Manama.\nThe UK governed Bahrain from 1861 to 1971, when it achieved full independence.\nBoth countries share common membership of the United Nations, the World Health Organization, and the World Trade Organization, as well as the Bahrain–US Comprehensive Security Integration and Prosperity Agreement. Bilaterally the two countries have a Double Taxation Agreement. Both countries are negotiating a Free Trade Agreement.\n|- valign=\"top\"\n|||||See Bangladesh–United Kingdom relations\nSheikh Hasina in Downing Street, January 2011.]]\nThe UK established diplomatic relations with Bangladesh on 4 February 1972.\n*Bangladesh maintains a high commission in London.\n*The United Kingdom is accredited to Bangladesh through its high commission in Dhaka.\nThe UK governed Bangladesh from 1699 to 1947, when it achieved independence as part of Pakistan.\nBoth countries share common membership of the Commonwealth, the International Criminal Court, the United Nations, the World Health Organization, and the World Trade Organization.\nBilaterally the two countries have a Development Partnership, a Double Taxation Convention, an Investment Agreement, and an Illegal Migration Returns Agreement.\n|- valign=\"top\"\n|||N/A||See Foreign relations of Bhutan\nin London, February 2013.]]\nThe UK has not established diplomatic relations with Bhutan; the UK does recognise Bhutan to be a sovereign nation.\n*The UK is accredited to Bhutan through its deputy high commission in Kolkata, India.\nRelations between Bhutan and the UK date back to the 18th Century\nBoth countries share common membership of the United Nations, and the World Health Organization.\n|- valign=\"top\"\n|||||See Brunei–United Kingdom relations\nHassanal Bolkiah in Downing Street, December 2024.]]\nThe UK established diplomatic relations with Brunei on 1 January 1984.\n*Brunei maintains a high commission in London.\n*The United Kingdom is accredited to Brunei through its high commission in Bandar Seri Begawan.\nThe UK governed the Brunei from 1888 to 1984, when Brunei achieved full independence.\nBoth countries share common membership of the Commonwealth, CPTPP, the United Nations, the World Health Organization, and the World Trade Organization. Bilaterally the two countries have a Double Taxation Agreement.\n|- valign=\"top\"\n|||||See Cambodia–United Kingdom relations\nThe UK established diplomatic relations with Cambodia on 5 May 1952.\n*Cambodia maintains an embassy in London.\n*The United Kingdom is accredited to Cambodia through its embassy in Phnom Penh.\nBoth countries share common membership of the International Criminal Court, the United Nations, the World Health Organization, and the World Trade Organization. Bilaterally the two countries have a Development Partnership.\n|- valign=\"top\"\n|||||See China–United Kingdom relations\nwith Chinese President Xi Jinping at a G20 summit in Rio de Janeiro, November 2024.]]\nThe UK established diplomatic relations with the People's Republic of China on 17 June 1954.\n*China maintains an embassy in London.\n*The United Kingdom is accredited to China through its embassy in Beijing, and consulate generals in Guangzhou, Hong Kong, and Shanghai.\nThe UK governed the territories of Hong Kong, from 1841 to 1941 and 1945 to 1997, as well as Weihaiwei from 1898 to 1930.\nBoth countries share common membership of the G20, the UNSC P5, the United Nations, the World Health Organization, and the World Trade Organization. Bilaterally the two countries have a Double Taxation Agreement, an Investment Agreement, and the Sino-British Joint Declaration.\n|- valign=\"top\"\n|||||See Cyprus–United Kingdom relations\nNikos Christodoulides in Downing Street, October 2024.]]\nThe UK established diplomatic relations with Cyprus on 1 October 1960. The UK is a \"guarantor power\" of Cyprus's independence.\n* Cyprus maintains a high commission in London, and honorary consulates in Belfast, Birmingham, Bristol, Dunblane, Glasgow, and Leeds.\n*The United Kingdom is accredited to Cyprus through its high commission in Nicosia.\nThe UK governed Cyprus from 1878 until 1960, when it achieved full independence.\nBoth countries share common membership of the Coalition of the Willing, the Commonwealth, the Council of Europe, European Court of Human Rights, the International Criminal Court, the OSCE, the United Nations, the World Health Organization, and the World Trade Organization. Bilaterally the two countries have a Double Taxation Agreement.\n|- valign=\"top\"\n|||1992||See Georgia–United Kingdom relations\nwith Georgian Prime Minister Giorgi Kvirikashvili in London, November 2015.]]\nThe UK established diplomatic relations with Georgia on 27 April 1992.\n* Georgia maintains an embassy in London.\n* The United Kingdom is accredited to Georgia through its embassy in Tbilisi.\nBoth countries share common membership of the Council of Europe, European Court of Human Rights, the International Criminal Court, OSCE, the United Nations, the World Health Organization, and the World Trade Organization. Bilaterally the two countries have and an Investment Agreement, and a Strategic Partnership and Cooperation Agreement.\n|- valign=\"top\"\n|||N/A||See Hong Kong–United Kingdom relations\nDonald Tsang in Downing Street, September 2011.]]\nThe UK established modern diplomatic relations with Hong Kong on 1 July 1997.\n*Hong Kong is represented through its Economic and Trade Office in London.\n*The United Kingdom is accredited to Hong Kong from its consulate general on Hong Kong Island.\nThe UK governed Hong Kong from 1841 to 1941 and 1945 to 1997, when Hong Kong's sovereignty was ceded to the People's Republic of China in 1997.\nBoth share common membership of the World Trade Organization. Bilaterally the two have an Investment Agreement.\n|- valign=\"top\"\n|||||See India–United Kingdom relations\nNarendra Modi in Mumbai, October 2025.]]\nThe UK established diplomatic relations with India on 14 August 1947.\n*India maintains a high commission in London.\n*The United Kingdom is accredited to India through its high commission in New Delhi, as well as Deputy High Commissions in Ahmedabad, Bangalore, Chandigarh, Chennai, Hyderabad, Kolkata, Mumbai, and a Nationals Assistance Office in Goa.\nThe UK governed the India from 1858 to 1947, when it achieved full independence.\nBoth countries share common membership of the Commonwealth, the G20, the United Nations, the World Health Organization, and the World Trade Organization. Bilaterally the two countries have a Comprehensive Economic and Trade Agreement, a Comprehensive Strategic Partnership, and a Development Partnership.\n|- valign=\"top\"\n|||||See Indonesia–United Kingdom relations\nPrabowo Subianto in Downing Street, November 2024.]]\nThe UK established diplomatic relations with Indonesia on 27 December 1949.\n*Indonesia maintains an embassy in London.\n*The United Kingdom is accredited to Indonesia through its embassy in Jakarta, as well as an honorary consulate in Bali.\nThe United Kingdom occupied Indonesia from 1811 to 1816 and 1945 to 1946, on both occasions Indonesia was transferred to the Netherlands.\nBoth countries share common membership of the G20, the United Nations, the World Health Organization, and the World Trade Organization. Bilaterally the two countries have a Development Partnership, a Double Taxation Agreement, an Investment Agreement, and a Strategic Partnership.\n|- valign=\"top\"\n|||||See Iran–United Kingdom relations\nHassan Rouhani at a United Nations General Assembly in New York City, September 2016.]]\nThe UK established diplomatic relations with Iran on 5 June 1807.\n*Iran maintains an embassy in London.\n*The United Kingdom is accredited to Iran through its embassy in Tehran.\nThe UK governed southern Iran from 1941 until 1946.\nBoth countries share common membership of the United Nations, and the World Health Organization. Bilaterally the two countries have an Air Transport Agreement.\n|- valign=\"top\"\n|||||See Iraq–United Kingdom relations\nMohammed Shia Al Sudani in Downing Street, January 2025.]]\nThe UK established diplomatic relations with Iraq on 4 October 1932.\n*Iraq maintains an embassy in London.\n*The United Kingdom is accredited to Iraq through its embassy in Baghdad.\nThe UK governed Iraq from 1921 until 1932, when it achieved full independence.\nBoth countries share common membership of the United Nations, the World Health Organization, and the World Trade Organization. Bilaterally the two countries have a Development Partnership, a Partnership and Cooperation Agreement, and a Strategic Partnership.\n|- valign=\"top\"\n|||1948 ||See Israel–United Kingdom relations\nIsaac Herzog in 10 Downing Street, September 2025.]]\nThe UK established diplomatic relations with Israel in 1950.\n*Israel maintains an embassy in London.\n*The United Kingdom is accredited to Israel through its embassy in Tel Aviv.\nThe UK governed Israel from 1921 until 1948, when it achieved full independence.\nBoth countries share common membership of the OECD, the United Nations, the World Health Organization, and the World Trade Organization. Bilaterally the two countries have a Trade and Partnership Agreement, a Reciprocal Healthcare Agreement, and a Strategic Partnership. The two countries are currently negotiating a new Free Trade Agreement.\n|- valign=\"top\"\n|||||See Japan–United Kingdom relations\nShigeru Ishiba at a G20 summit in Rio de Janeiro, November 2024.]]\nThe UK established diplomatic relations with Japan on 26 August 1858.\n*Japan maintains an embassy in London.\n* The United Kingdom is accredited to Japan through its embassy in Tokyo.\nBoth countries share common membership of the Coalition of the Willing, the CPTPP, the G7, the G20, the International Criminal Court, OECD, the United Nations, the World Health Organization, and the World Trade Organization. Bilaterally the two countries have a Comprehensive Economic Partnership Agreement, a Double Taxation Convention, and a Reciprocal Access Agreement.\n|- valign=\"top\"\n|||||See Jordan–United Kingdom relations\nAbdullah II in 10 Downing Street, November 2024.]]\nThe UK established diplomatic relations with Jordan on 17 June 1946.\n*Jordan maintains an embassy in London.\n*The United Kingdom is accredited to Jordan through its embassy in Amman.\nThe UK governed Jordan from 1921 until 1946, when it achieved full independence.\nBoth countries share common membership of the International Criminal Court, the United Nations, the World Health Organization, and the World Trade Organization. Bilaterally the two countries have an Association Agreement, a Development Partnership, a Double Taxation Convention, and a Strategic Partnership.\n|- valign=\"top\"\n|||||See Kazakhstan–United Kingdom relations\nKassym-Jomart Tokayev at COP29 in Baku, November 2024.]]\nThe UK established diplomatic relations with Kazakhstan on 19 January 1992.\n*Kazakhstan maintains an embassy in London.\n*The UK is accredited to Kazakhstan through its embassy in Astana.\nBoth countries share common membership of the OSCE, the United Nations, the World Health Organization, the World Health Organization, and the World Trade Organization. Bilaterally the two countries have a Development Partnership, a Double Taxation Convention, an Investment Agreement, and a Strategic Partnership and Cooperation Agreement.\n|- valign=\"top\"\n|||||See Kuwait–United Kingdom relations\nSabah Al-Khalid Al-Sabah at a United Nations General Assembly in New York City, September 2024.]]\nThe UK established diplomatic relations with Kuwait on 8 November 1961.\n*Kuwait maintains an embassy in London.\n*The United Kingdom is accredited to Kuwait through its embassy in Kuwait City.\nThe UK governed Kuwait from 1899 to 1961, when it achieved full independence.\nBoth countries share common membership of the United Nations, the World Health Organization, and the World Trade Organization. Bilaterally the two countries have signed an Investment Agreement. The UK and the Gulf Cooperation Council, of which Kuwait is a member, are negotiating a Free Trade Agreement.\n|- valign=\"top\"\n|||||See Kyrgyzstan–United Kingdom relations\nJeenbek Kulubayev in Bishkek, April 2024.]]\nThe UK established diplomatic relations with Kyrgyzstan on 12 June 1992.\n*Kyrgyzstan maintains an embassy in London.\n*The UK is accredited to Kyrgyzstan through its embassy in Bishkek.\nBoth countries share common membership of the OSCE, the United Nations, the World Health Organization, and the World Trade Organization. Bilaterally the two countries have a Development Partnership, a Double Taxation Agreement, and an Investment Agreement.\n|- valign=\"top\"\n|||||See Laos–United Kingdom relations\nSaleumxay Kommasith in Vientiane, July 2025.]]\nThe UK established diplomatic relations with Laos on 5 September 1955.\n*Laos maintains an embassy in London.\n*The UK is accredited to Laos through its embassy in Vientiane.\nBoth countries share common membership of the United Nations, the World Health Organization, and the World Trade Organization. Bilaterally the two countries have an Investment Agreement.\n|- valign=\"top\"\n|||||See Lebanon–United Kingdom relations\nNajib Mikati in 10 Downing Street, October 2024.]]\nThe UK established diplomatic relations with Lebanon on 9 February 1942.\n*Lebanon maintains an embassy in London.\n*The UK is accredited to Lebanon through its embassy in Beirut.\nBoth countries share common membership of the United Nations, the World Health Organization, and the World Trade Organization. Bilaterally the two countries have an Association Agreement, and a Development Partnership.\n|- valign=\"top\"\n|||N/A||See Foreign relations of Macao\nThe UK established modern diplomatic relations with Macao on 20 December 1999.\n*Macao does not maintain a diplomatic mission in the United Kingdom.\n*The United Kingdom is not accredited to Macao through a diplomatic mission; the UK develops relations through its Consulate General in Hong Kong.\nBoth share common membership of the World Trade Organization.\n|- valign=\"top\"\n|||||See Malaysia–United Kingdom relations\nAnwar Ibrahim in 10 Downing Street, January 2025.]]\nThe UK established diplomatic relations with Malaysia on 31 August 1957.\n*Malaysia maintains a high commission in London.\n*The United Kingdom is accredited to the Malaysia through its high commission in Kuala Lumpur.\nThe UK governed the Malaysia from 1826 to 1942 and 1945 to 1957, when it achieved full independence.\nBoth countries share common membership of the Commonwealth, CPTPP, the Five Power Defence Arrangements, the United Nations, the World Health Organization, and the World Trade Organization. Bilaterally the two countries have a Double Taxation Agreement, and an Investment Agreement.\n|- valign=\"top\"\n|||||See Maldives–United Kingdom relations\nMohamed Muizzu at COP29 in Baku, November 2024.]]\nThe UK established diplomatic relations with the Maldives on 26 July 1965.\n*The Maldives maintains a high commission in London.\n*The United Kingdom is accredited to the Maldives through its high commission in Malé.\nThe UK governed the Maldives from 1796 to 1965, when the Maldives achieved full independence.\nBoth countries share common membership of the Commonwealth, the International Criminal Court, the United Nations, the World Health Organization, and the World Trade Organization. Both countries are currently negotiating a Free Trade Agreement.\n|- valign=\"top\"\n|||||See Mongolia–United Kingdom relations\nBattsetseg Batmunkh in Ulaanbaatar, April 2024.]]\nThe UK established diplomatic relations with Mongolia on 23 January 1963.\n*Mongolia maintains an embassy in London.\n*The United Kingdom is accredited to Mongolia through its embassy in Ulaanbaatar.\nBoth countries share common membership of the International Criminal Court, the United Nations, the World Health Organization, and the World Trade Organization. Bilaterally the two countries have an Air Services Agreement, a Development Partnership, a Double Taxation Agreement, and an Investment Agreement.\n|- valign=\"top\"\n|||||See Myanmar–United Kingdom relations\nAung San Suu Kyi in 10 Downing Street, September 2016.]]\nThe UK established diplomatic relations with Myanmar on 7 July 1947.\n*Myanmar maintains an embassy in London.\n*The United Kingdom is accredited to Myanmar through its embassy in Yangon.\nThe UK governed Myanmar from 1824 to 1942 and 1945 to 1948, when Myanmar achieved full independence.\nBoth countries share common membership of the United Nations, the World Health Organization, and the World Trade Organization. Bilaterally the two countries have a Development Partnership, and a Double Taxation Agreement.\n|- valign=\"top\"\n|||||See Nepal–United Kingdom relations\nK. P. Sharma Oli at a United Nations General Assembly in New York City, September 2018.]]\nThe UK established diplomatic relations with Nepal on 4 March 1816.\n*Nepal maintains an embassy in London.\n*The United Kingdom is accredited to Nepal through its embassy in Kathmandu.\nBoth countries share common membership of the United Nations, the World Health Organization, and the World Trade Organization. Bilaterally the two countries have a Development Partnership, and an Investment Agreement.\n|- valign=\"top\"\n|||||See North Korea–United Kingdom relations\nThe UK established diplomatic relations with North Korea on 12 December 2000.\n*North Korea maintains an embassy in London.\n*The United Kingdom is accredited to North Korea through its embassy in Pyongyang.\nBoth countries share common membership of the United Nations.\n|- valign=\"top\"\n|||||See Oman–United Kingdom relations\nHaitham bin Tariq in 10 Downing Street, August 2024.]]\nThe UK established diplomatic relations with Oman on 21 May 1971.\n*Oman maintains an embassy in London.\n*The United Kingdom is accredited to Oman through its embassy in Muscat.\nThe UK governed Oman from 1891 until 1951, when Oman achieved full independence.\nBoth countries share common membership of the United Nations, the World Health Organization, and the World Trade Organization. Bilaterally the two countries have a Comprehensive Agreement on Enduring Friendship and Bilateral Cooperation, a Double Taxation Agreement, an Investment Agreement, and a Mutual Defence Agreement. Both countries are negotiating a Free Trade Agreement.\n|- valign=\"top\"\n|||||See Pakistan–United Kingdom relations\nShehbaz Sharif at a United Nations General Assembly in New York City, September 2024.]]\nThe UK established diplomatic relations with Pakistan on 14 August 1947.\n*Pakistan maintains a high commission in London.\n*The United Kingdom is accredited to Pakistan through its high commission in Islamabad, as well as a deputy high commission in Karachi.\nThe UK governed Pakistan from 1824 to 1947, when Pakistan achieved full independence.\nBoth countries share common membership of the Commonwealth, the United Nations, and the World Trade Organization. Bilaterally the two countries have a Development Partnership, a Double Taxation Convention, and an Investment Agreement.\n|- valign=\"top\"\n||| N/A ||See Palestine–United Kingdom relations\nMahmoud Abbas in 10 Downing Street, October 2025.]]\nThe UK has not established diplomatic relations with Palestine}}; the UK does recognise Palestine to be a sovereign nation.\n*Palestine maintains a diplomatic mission in London.\n*The United Kingdom is not accredited to Palestine through an embassy; the UK develops relations through its Consulate General in Jerusalem, Israel.\nThe UK governed Palestine from 1921 until 1948, when it achieved full independence.\nBoth countries share common membership of the International Criminal Court, and the United Nations. Bilaterally the two countries have a Development Partnership, and a Political, Trade and Partnership Agreement.\n|--valign=\"top\"\n|||\n|See Philippines–United Kingdom relations\nTess Lazaro in Kuala Lumpur, July 2025.]]\nThe UK established diplomatic relations with the Philippines on 4 July 1946.\n*The Philippines maintains an embassy in London.\n*The United Kingdom is accredited to the Philippines through its embassy in Manila.\nBoth countries share common membership of the United Nations, the World Health Organization, and the World Trade Organization. Bilaterally the two countries have an Investment Agreement.\n|- valign=\"top\"\n|||||See Qatar–United Kingdom relations\nTamim bin Hamad Al Thani at a peace summit in Sharm El Sheikh, October 2025.]]\nThe UK established diplomatic relations with Qatar on 24 May 1972.\n*Qatar maintains an embassy in London.\n*The United Kingdom is accredited to Qatar through its embassy in Doha.\nThe UK governed Qatar from 1916 to 1971, when it achieved full independence.\nBoth countries share common membership of the United Nations, the World Health Organization, and the World Trade Organization. Bilaterally the two countries have a Climate Technology Partnership, a Security Pact, a Strategic Investment Partnership, and have signed an Investment Agreement. The two countries are negotiating a Free Trade Agreement.\n|- valign=\"top\"\n|||||See Saudi Arabia–United Kingdom relations\nMohammed bin Salman in Riyadh, December 2024.]]\nThe UK established diplomatic relations with Saudi Arabia on 20 May 1927.\n*Saudi Arabia maintains an embassy in London.\n*The United Kingdom is accredited to Saudi Arabia through its embassy in Riyadh, as well as a consulate general in Jeddah.\nBoth countries share common membership of the United Nations, the World Health Organization, and the World Trade Organization. Bilaterally the two countries have a Critical Minerals Partnership, a Defence Agreement, a Double Taxation Agreement, and a Strategic Partnership. Both countries are negotiating a Free Trade Agreement.\n|- valign=\"top\"\n|||||See Singapore–United Kingdom relations\nLawrence Wong at a Commonwealth summit in Apia, October 2024.]]\nThe UK established diplomatic relations with Singapore on 9 August 1965.\n*Singapore maintains a high commission in London.\n*The United Kingdom is accredited to Singapore through its high commission in Singapore.\nThe UK governed the Singapore from 1819 to 1942 and 1946 to 1963, when Singapore achieved independence within Malaysia.\nBoth countries share common membership of the Commonwealth, CPTPP, the Five Power Defence Arrangements, the United Nations, the World Health Organization, and the World Trade Organization. Bilaterally the two countries have a Digital Economy Agreement, a Double Taxation Agreement, a Free Trade Agreement, and an Investment Agreement.\n|- valign=\"top\"\n|||||See South Korea–United Kingdom relations\nLee Jae-myung with British Prime Minister Keir Starmer at a G7 summit in Kananaskis, June 2025.]]\nThe UK established diplomatic relations with South Korea on 18 January 1949.\n*South Korea maintains an embassy in London.\n* The United Kingdom is accredited to South Korea through its embassy in Seoul.\nBoth countries share common membership of the G20, the International Criminal Court, the OECD, the United Nations, the World Health Organization, and the World Trade Organization. Bilaterally the two countries have a Double Taxation Convention, the Downing Street Accord, and a Trade Agreement. The two countries are negotiating a new Free Trade Agreement.\n|- valign=\"top\"\n|||||See Sri Lanka–United Kingdom relations\nThe UK established diplomatic relations with Sri Lanka on 22 October 1946.\n*Sri Lanka maintains a high commission in London.\n*The United Kingdom is accredited to Sri Lanka through its high commission in Colombo.\nThe UK governed Sri Lanka from 1802 to 1948, until it achieved full independence as Ceylon.\nBoth countries share common membership of the Commonwealth, the United Nations, the World Health Organization, and the World Trade Organization. Bilaterally the two countries have an Investment Agreement.\n|- valign=\"top\"\n|||||See Syria–United Kingdom relations\nAsaad al-Shaibani in Riyadh, January 2025.]]\nThe UK re-established diplomatic relations with Syria on 5 July 2025.\n*Syria's embassy in London remains closed despite the re-establishment of diplomatic relations.\n*The UK 's embassy in Damascus is currently closed with all consular operations suspended.\nBoth countries share common membership of the United Nations, the World Health Organization, and the World Trade Organization. Bilaterally the two countries have a Development Partnership.\n|- valign=\"top\"\n|||N/A||See Taiwan–United Kingdom relations\nThe UK has not established formal diplomatic relations with Taiwan; the UK does not recognise Taiwan to be a sovereign nation.\n* Taiwan maintains the Taipei Representative Office in London, in addition to a branch office in Edinburgh.\n* The United Kingdom is accredited to Taiwan through its office in Taipei.\nIn 1950, the UK switched its recognition from the Republic of China (ROC) to the People's Republic of China (PRC).\nBoth countries share common membership of the World Trade Organization.\n|- valign=\"top\"\n|||||See Tajikistan–United Kingdom relations\nSirojiddin Muhriddin in Dushanbe, April 2024.]]\nThe UK established diplomatic relations with Tajikistan on 15 January 1992.\n*Tajikistan maintains an embassy in London.\n*The UK is accredited to Tajikistan embassy in Dushanbe.\nBoth countries share common membership of the International Criminal Court, the OSCE, the United Nations, the World Health Organization, and the World Trade Organization. Bilaterally the two countries have a Development Partnership, and a Double Taxation Agreement.\n|--valign=\"top\"\n|||\n|See Thailand–United Kingdom relations\nPrayut Chan-o-cha in 10 Downing Street, June 2018.]]\nThe UK established diplomatic relations with Thailand on 18 April 1855.\n* Thailand maintains an embassy in London.\n* The UK is accredited to Thailand through its embassy in Bangkok.\nBoth countries share common membership of the United Nations, the World Health Organization, and the World Trade Organization.\n|- valign=\"top\"\n|||||See Timor-Leste–United Kingdom relations\nJosé Ramos-Horta in London, April 2025.]]\nThe UK established diplomatic relations with East Timor in 2002.\n*East Timor maintains an embassy in London.\n*The United Kingdom is accredited to East Timor from its embassy in Jakarta; there is no British embassy in Timor-Leste. On 29 February 2024, the UK announced its intentions to re-open an embassy in Dili.\nBoth countries share common membership of the International Criminal Court, the United Nations, the World Health Organization, and the World Trade Organization.\n|- valign=\"top\"\n|||||See Turkey–United Kingdom relations\nRecep Tayyip Erdoğan in Ankara, October 2025.]]\nThe UK established diplomatic relations with Turkey on 2 September 1924.\n*Turkey maintains an embassy in London, and consulates generals in Edinburgh, London and Manchester.\n*The United Kingdom is accredited to Turkey through its embassy in Ankara, a consulate general in Istanbul, and an honorary vice consulate in Antalya. The United Kingdom also has a consulate in İzmir, and honorary consulates in Bodrum, Fethiye, and Marmaris.\nBoth countries share common membership of the Coalition of the Willing, the Council of Europe, G20, NATO, OECD, OSCE, the United Nations, the World Health Organization, and the World Trade Organization. Bilaterally the two countries have a Free Trade Agreement, and an Investment Agreement.\n|- valign=\"top\"\n|||||See Turkmenistan–United Kingdom relations\nBatyr Bazarov at a Trade & Industry Council meeting in London, January 2018.]]\nThe UK established diplomatic relations with Turkmenistan on 23 January 1992.\n*Turkmenistan maintains an embassy in London.\n*The UK is accredited to Turkmenistan through its embassy in Ashgabat.\nBoth countries share common membership of the OSCE, the United Nations, and the World Health Organization. Bilaterally the two countries have a Development Partnership, a Double Taxation Convention, and an Investment Agreement.\n|- valign=\"top\"\n|||||See United Arab Emirates–United Kingdom relations\nThe UK established diplomatic relations with the United Arab Emirates on 6 December 1971.\n*The United Arab Emirates maintains an embassy in London.\n*The United Kingdom is accredited to the United Arab Emirates through its embassies in Abu Dhabi and Dubai.\nThe UK governed the United Arab Emirates from 1920 to 1971, when the United Arab Emirates achieved full independence.\nBoth countries share common membership of the United Nations, the World Health Organization, and the World Trade Organization. Bilaterally the two countries have a Defence Cooperation Accord, an Investment Agreement, and a Partnership for the Future. Both countries are negotiating a Free Trade Agreement.\n|- valign=\"top\"\n|||||See United Kingdom–Uzbekistan relations\nBakhtiyor Saidov at COP29 in Baku, November 2024.]]\nThe UK established diplomatic relations with Uzbekistan on 18 February 1992.\n*Uzbekistan maintains an embassy in London.\n*The United Kingdom is accredited to Uzbekistan through its embassy in Tashkent.\nBoth countries share common membership of the OSCE, and the United Nations. Bilaterally the two countries have a Development Partnership, a Double Taxation Agreement,  and a Partnership and Cooperation Agreement.\n|- valign=\"top\"\n|||||See United Kingdom–Vietnam relations\nTô Lâm in 10 Downing Street, October 2025.]]\nThe UK established diplomatic relations with Vietnam on 11 September 1973.\n*Vietnam maintains an embassy in London.\n*The UK is accredited to Vietnam through its embassy in Hanoi, and a Consulate General in Ho Chi Minh City.\nBoth countries share common membership of CPTPP, the United Nations, the World Health Organization, and the World Trade Organization. Bilaterally the two countries have a Comprehensive Strategic Partnership, a Double Taxation Agreement, a Free Trade Agreement, and an Investment Agreement.\n|- valign=\"top\"\n|||||See United Kingdom–Yemen relations\nAhmad Awad bin Mubarak in London, May 2024.]]\nThe UK established diplomatic relations with Yemen on 24 October 1951.\n*Yemen maintains an embassy in London.\n*The United Kingdom is accredited to Yemen through its embassy in Sana'a.\nThe UK governed the Yemen from 1837 to 1967, when it achieved full independence as South Yemen.\nBoth countries share common membership of the United Nations, the World Health Organization, and the World Trade Organization. Bilaterally the two countries have a Development Partnership, and an Investment Agreement.\n|}\nEurope\n{| class=\"wikitable sortable\" style=\"width:100%; margin:auto;\"\n|-\n! style=\"width:15%;\"| Country\n! style=\"width:12%;\"| Since\n!Notes\n|- valign=\"top\"\n|||||See Albania–United Kingdom relations\nBajram Begaj in Tirana, May 2025.]]\nThe UK established diplomatic relations with Albania on 9 November 1921.\n* Albania maintains an embassy in London.\n* The United Kingdom is accredited to Albania through its embassy in Tirana.\nBoth countries share common membership of the Council of Europe, European Court of Human Rights, the International Criminal Court, NATO, OSCE, the United Nations, and the World Trade Organization. Bilaterally the two countries have a Double Taxation Agreement, an Investment Agreement, a Partnership, Trade and Cooperation Agreement, a Readmission Agreement, and an Agreement on the Transfer of Sentenced Persons.\n|- valign=\"top\"\n|||  ||See Andorra–United Kingdom relations\nThe UK established diplomatic relations with Andorra on 9 March 1994.\n* Andorra does not maintain an embassy in the United Kingdom.\n* The United Kingdom is not accredited to Andorra through an embassy; the UK develops relations through its Consulate General in Barcelona, Spain.\nBoth countries share common membership of the Council of Europe, European Court of Human Rights, the International Criminal Court, OSCE, the United Nations, and the World Health Organization. Bilaterally the two countries have a Double Taxation Convention.\n|- valign=\"top\"\n| ||  || See Austria–United Kingdom relations\nChristian Stocker at a Western Balkans Summit in Lancaster House, October 2025.]]\nThe UK established diplomatic relations with Austria on 8 November 1919.\n* Austria maintains an embassy in London.\n* The United Kingdom is accredited to Austria through its embassy in Vienna.\nBoth countries share common membership of the Coalition of the Willing, the Council of Europe, the European Court of Human Rights, the International Criminal Court, NATO, the OSCE, the United Nations, and the World Trade Organization. Bilaterally the two countries have a Double Taxation Convention.\n|- valign=\"top\"\n|||||See Belarus–United Kingdom relations\nThe UK established diplomatic relations with Belarus on 27 January 1992.\n* Belarus maintains an embassy in London.\n* The United Kingdom is accredited to Belarus through its embassy in Minsk.\nBoth countries share common membership of the OSCE, and the United Nations. Bilaterally the two countries have a Double Taxation Agreement, and an Investment Agreement.\n|- valign=\"top\"\n|||||See Belgium–United Kingdom relations\nAlexander De Croo in 10 Downing Street, January 2024.]]\nThe UK established diplomatic relations with Belgium on 1 December 1830.\n* Belgium maintains an embassy in London.\n* The United Kingdom is accredited to Belgium through its embassy in Brussels.\nBoth countries share common membership of the Atlantic Co-operation Pact, the Coalition of the Willing, the Council of Europe, the European Court of Human Rights, the International Criminal Court, NATO, the OECD, the OSCE, the United Nations, and the World Trade Organization. Bilaterally the two countries have a Classified Information Protection Agreement, a Double Taxation Convention, and a Maritime Cooperation Agreement.\n|- valign=\"top\"\n|||||See Bosnia and Herzegovina–United Kingdom relations\nElmedin Konaković in Sarajevo, May 2025.]]\nThe UK established diplomatic relations with Bosnia and Herzegovina on 13 April 1992.\n*Bosnia and Herzegovina maintains an embassy in London.\n*The United Kingdom is accredited to Bosnia and Herzegovina through its embassy in Sarajevo.\nBoth countries share common membership of the Council of Europe, the European Court of Human Rights, the International Criminal Court, the United Nations, and the OSCE. Bilaterally the two countries have a Double Taxation Convention, an Investment Agreement, and a Reciprocal Healthcare Agreement.\n|- valign=\"top\"\n|||||See Bulgaria–United Kingdom relations\nRosen Zhelyazkov at a Western Balkans Summit in Lancaster House, October 2025.]]\nThe UK established diplomatic relations with Bulgaria on 23 July 1879.\n*Bulgaria maintains an embassy in London.\n* The United Kingdom is accredited to Bulgaria through its embassy in Sofia.\nBoth countries share common membership of the Coalition of the Willing, the Council of Europe, European Court of Human Rights, the International Criminal Court, NATO, OSCE, the United Nations, and the World Trade Organization. Bilaterally the two countries have an Investment Agreement, and a Strategic Partnership.\n|- valign=\"top\"\n|||||See Croatia–United Kingdom relations\nAndrej Plenković in Downing Street, February 2020.]]\nThe UK established diplomatic relations with Croatia on 24 June 1992.\n* Croatia maintains an embassy in London.\n* The United Kingdom is accredited to Croatia through its embassy in Zagreb.\nBoth countries share common membership of the Coalition of the Willing, the Council of Europe, European Court of Human Rights, the International Criminal Court, NATO, OSCE, the United Nations, and the World Trade Organization. Bilaterally the two countries have a Double Taxation Agreement, and an Investment Agreement.\n|- valign=\"top\"\n|||||See Czech Republic–United Kingdom relations\nPetr Fiala at a European Political Community summit in 10 Downing Street, July 2025.]]\nThe UK established diplomatic relations with Czech Republic on 26 October 1918.\n*The Czech Republic maintains an embassy in London.\n*The United Kingdom is accredited to the Czech Republic through its embassy in Prague.\nBoth countries share common membership of the Coalition of the Willing, the Council of Europe, the European Court of Human Rights, the International Criminal Court, NATO, the OSCE, the United Nations, and the World Trade Organization. Bilaterally the two countries have a Double Taxation Convention.\n|- valign=\"top\"\n|||||See Denmark–United Kingdom relations\nMette Frederiksen in 10 Downing Street, February 2025.]]\nThe UK established diplomatic relations with Denmark on 25 October 1401.\n*Denmark maintains an embassy in London.\n*The United Kingdom is accredited to Denmark through its embassy in Copenhagen.\nBoth countries share common membership of the Coalition of the Willing, the Council of Europe, the European Court of Human Rights, the International Criminal Court, the Joint Expeditionary Force, NATO, the OECD, the OSCE, the United Nations, and the World Trade Organization. Bilaterally the two countries have a Double Taxation Agreement, and a Voting Participation Agreement.\n|- valign=\"top\"\n|||||See Estonia–United Kingdom relations\nKristen Michal at a JEF summit in Tallinn, December 2024.]]\nThe UK re-established diplomatic relations with Estonia on 5 September 1991.\n*Estonia maintains an embassy in London.\n*The United Kingdom is accredited to Estonia through its embassy in Tallinn.\nBoth countries share common membership of the Coalition of the Willing, the Council of Europe, European Court of Human Rights, the International Criminal Court, Joint Expeditionary Force, NATO, OECD, OSCE, the United Nations, and the World Trade Organization. Bilaterally the two countries have a Defence Cooperation Agreement, and a Double Taxation Agreement.\n|- valign=\"top\"\n|||N/A||See European Union–United Kingdom relations\nUrsula von der Leyen in Brussels, October 2024.]]\nThe UK was a founding member of the European Union on 1 November 1993; it seceded on 1 January 2021.\n*Relations between the two are governed by the EU–UK Trade and Cooperation Agreement.\nBoth the EU and the UK share common membership of the Coalition of the Willing, the G7, the G20, and the World Trade Organization.\n|- valign=\"top\"\n||| N/A ||See Faroe Islands–United Kingdom relations\nwith Faroese Prime Minister Kaj Leo Johannesen in London, April 2012.]]\nThe UK maintains relations with the Faroe Islands through its relations with Denmark.\n*The Faroe Islands maintains a representation in London.\n*The United Kingdom is accredited to the Faroe Islands through its consulate in Tórshavn.\nThe UK occupied Faroe Islands from 1940 until 1945, when the Faroe Islands were returned to Denmark.\nBilaterally the two countries have a Double Taxation Agreement, and a Free Trade Agreement.\n|- valign=\"top\"\n|||||See Finland–United Kingdom relations\nAlexander Stubb  in Downing Street, March 2025.]]\nThe UK established diplomatic relations with Finland on 28 March 1919.\n* Finland maintains an embassy in London and honorary consulates in Aberdeen, Belfast, Birmingham, Bristol, Cardiff, Dover, Dundee, Edinburgh, Gibraltar, Glasgow, Hamilton, Harwich, Hull, Immingham, Leeds, Lerwick, Liverpool, Manchester, Middlesbrough, Newcastle-Upon-Tyne, Nottingham, Plymouth, Rochester, Sheffield, Southampton and St Helier.\n* The United Kingdom has an embassy in Helsinki and honorary consulates in Åland, Jyväskylä, Kotka, Kuopio, Oulu, Rovaniemi, Turku, Tampere and Vaasa.\nBoth countries share common membership of the Coalition of the Willing, the Council of Europe, European Court of Human Rights, the International Criminal Court, Joint Expeditionary Force, NATO, OECD, OSCE, the United Nations, and the World Trade Organization. Bilaterally the two countries have a mutual defence agreement, and a strategic partnership agreement.\n|- valign=\"top\"\n|||||See France–United Kingdom relations\nEmmanuel Macron in 10 Downing Street, January 2025.]]\nThe UK established diplomatic relations with France in 1396.\n* France maintains an embassy in London, and consulates general in London and Edinburgh.\n*The United Kingdom is accredited to France through its embassy in Paris, and consulates in Bordeaux and Marseille.\nBoth countries share common membership of the Coalition of the Willing, the Council of Europe, European Court of Human Rights, the G7, the G20, the International Criminal Court, NATO, the OECD, the OSCE, the United Nations, and the World Trade Organization. Bilaterally the two countries have the Combined Joint Expeditionary Force, a Double Taxation Convention, the Lancaster House Treaties, and Maritime Boundary Agreements in the   Caribbean and the Pacific.\n|- valign=\"top\"\n|||||See Germany–United Kingdom relations\nFriedrich Merz in Stevenage, July 2025.]]\nThe UK established diplomatic relations with the Federal Republic of Germany on 20 June 1951.\n* Germany maintains an embassy in London.\n* The United Kingdom is accredited to an embassy in Berlin, and consulates generals in Düsseldorf and Munich.\nBoth countries share common membership of the Coalition of the Willing, the Council of Europe, the European Court of Human Rights, the G7, the G20, the International Criminal Court, NATO, the OECD, the OSCE, the United Nations, and the World Trade Organization.  Bilaterally the two countries have a Double Taxation Convention, and the Kensington Treaty.\n|- valign=\"top\"\n|||||See Greece–United Kingdom relations\nKyriakos Mitsotakis in Downing Street, December 2024.]]\nThe UK established diplomatic relations with Greece on in 1834.\n* Greece maintains an embassy in London, and honorary consulates in Belfast, Birmingham, Edinburgh, Gibraltar, Glasgow, and Leeds.\n* The United Kingdom is accredited to Greece through its embassy in Athens, and vice consulates in Corfu, Crete, Rhodes, Thessaloniki, and Zakynthos.\nThe UK governed the Ionian Islands from 1815 to 1864, when they were ceded to Greece.\nBoth countries share common membership of the Coalition of the Willing, the Council of Europe, European Court of Human Rights, the International Criminal Court, NATO, OECD, OSCE, the United Nations, and the World Trade Organization. Bilaterally the two countries have a Defence and Security Agreement, a Double Taxation Agreement, and a Strategic Bilateral Framework.\n|- valign=\"top\"\n|||||See Holy See–United Kingdom relations\nin 10 Downing Street, September 2010.]]\nThe UK established diplomatic relations with the Holy See on 16 January 1982.\n*The Holy See maintains an apostolic nunciature in London.\n* The United Kingdom is accredited to the Holy See through its embassy in Rome.\nBoth countries share common membership of the OSCE.\n|- valign=\"top\"\n|||||See Hungary–United Kingdom relations\nViktor Orbán in 10 Downing Street, May 2021.]]\nThe UK established diplomatic relations with Hungary on 22 May 1921.\n* Hungary maintains an embassy in London.\n* The United Kingdom is accredited to Hungary through its embassy in Budapest.\nBoth countries share common membership of the Council of Europe, the European Court of Human Rights, the International Criminal Court, NATO, the OECD, the OSCE, the United Nations, and the World Trade Organization. Bilaterally the two countries have a Double Taxation Convention.\n|- valign=\"top\"\n|||||See Iceland–United Kingdom relations\nKatrín Jakobsdóttir in 10 Downing Street, May 2019.]]\nThe UK established diplomatic relations with Iceland on 8 May 1940.\n*Iceland maintains an embassy in London.\n*The United Kingdom is accredited to Iceland through its embassy in Reykjavík.\nThe UK occupied Iceland from 10 May 1940 until July 1941, when the United States assumed responsibility of the country.\nBoth countries share common membership of the Atlantic Co-operation Pact, the Coalition of the Willing, Council of Europe, European Court of Human Rights, Joint Expeditionary Force, the International Criminal Court, NATO, OECD, OSCE, the United Nations, and the World Trade Organization. Bilaterally the two countries have a Double Taxation Convention, and a Free Trade Agreement.\n|- valign=\"top\"\n|||||See Ireland–United Kingdom relations\nSimon Harris in Downing Street, July 2024.]]\nThe UK established diplomatic relations with Ireland on 6 December 1922.\n*Ireland maintains an embassy in London.\n*The United Kingdom is accredited to Ireland through its an embassy in Dublin.\nThe UK governed Ireland from the 12th century until 1800, when it was incorporated into the United Kingdom. The Republic of Ireland achieved full independence on the 6 December 1922.\nBoth countries share common membership of the Atlantic co-operation pact, the Coalition of the Willing, the Council of Europe, the European Court of Human Rights, the International Criminal Court, the OECD, the OSCE, the United Nations, and the World Trade Organization. Bilaterally the two countries have a Common Travel Area, and the Good Friday Agreement. The two countries have a sovereignty dispute over the Rockall Bank.\n|- valign=\"top\"\n|||||See Italy–United Kingdom relations\nGiorgia Meloni in Rome, September 2024.]]\nThe UK established diplomatic relations with Italy on 13 April 1859.\n* Italy maintains an embassy in London.\n* The United Kingdom is accredited to Italy through its embassy in Rome, and a consulate general in Milan.\nBoth countries share common membership of the Coalition of the Willing, the Council of Europe, the European Court of Human Rights, G7, G20, the International Criminal Court, NATO, the OECD, the OSCE, the United Nations, and the World Trade Organization. Bilaterally the two countries have an Export and Investment Partnership, and a Double Taxation Convention.\n|- valign=\"top\"\n|||||See Kosovo–United Kingdom relations\nwith Kosovan Prime Minister Albin Kurti in London, October 2025.]]\nThe UK established diplomatic relations with Kosovo on 18 February 2008.\n* Kosovo maintains an embassy in London.\n* The United Kingdom is accredited to Kosovo through its embassy in Pristina.\nBilaterally the two countries have a Double Taxation Agreement, a Partnership, Trade and Cooperation Agreement, and a Reciprocal Healthcare Agreement.\n|- valign=\"top\"\n|||||See Latvia–United Kingdom relations\nEvika Siliņa at a European Political Community summit in Blenheim Palace, July 2024.]]\nThe UK re-established diplomatic relations with Latvia on 5 September 1991.\n* Latvia maintains an embassy in London.\n* The United Kingdom is accredited to Latvia through its embassy in Riga.\nBoth countries share common membership of the Coalition of the Willing, the Council of Europe, the European Court of Human Rights, the International Criminal Court, the Joint Expeditionary Force, NATO, the OECD, the OSCE, the United Nations, and the World Trade Organization. Bilaterally the two countries have a Double Taxation Convention.\n|- valign=\"top\"\n|||||See Liechtenstein–United Kingdom relations\nDaniel Risch at a European Political Community summit in Blenheim Palace, July 2024.]]\nThe UK established diplomatic relations with Licehtenstein on 6 February 1992.\n*Liechtenstein does not maintain an embassy in the United Kingdom.\n*The United Kingdom is not accredited to Liechtenstein through an embassy; the UK develops relations through its embassy in Bern, Switzerland.\nBoth countries share common membership of the Council of Europe, European Court of Human Rights, the International Criminal Court, OSCE, the United Nations, and the World Trade Organization. Bilaterally the two countries have a Double Taxation Convention, a Free Trade Agreement, a Separation Agreement, a Social Security Coordination Convention, and a Trade Agreement.\n|- valign=\"top\"\n|||||See Lithuania–United Kingdom relations\nGitanas Nauseda at a United Nations General Assembly in New York City, September 2022.]]\nThe UK re-established diplomatic relations with Lithuania on 4 September 1991.\n* Lithuania maintains an embassy in London.\n* The United Kingdom is accredited to Lithuania through its embassy in Vilnius.\nBoth countries share common membership of the Coalition of the Willing, the Council of Europe, the European Court of Human Rights, the International Criminal Court, the Joint Expeditionary Force, NATO, the OECD, the OSCE, the United Nations, and the World Trade Organization. Bilaterally the two countries have an Investment Agreement.\n|- valign=\"top\"\n|||||See Luxembourg–United Kingdom relations\nLuc Frieden at a European Political Community summit in Blenheim Palace, July 2024.]]\nThe UK established diplomatic relations with Luxembourg on 8 June 1891.\n* Luxembourg maintains an embassy in London.\n* The United Kingdom is accredited to Luxembourg through its embassy in Luxembourg City.\nBoth countries share common membership of the Coalition of the Willing, the Council of Europe, the European Court of Human Rights, the International Criminal Court, NATO, the OECD, the OSCE, the United Nations, and the World Trade Organization. Bilaterally the two countries have a Double Taxation Convention.\n|- valign=\"top\"\n|||||See Malta–United Kingdom relations\nGeorge Vella in 10 Downing Street, March 2020.]]\nThe UK established diplomatic relations with Malta on 7 September 1964.\n*Malta maintains a high commission in London.\n* The United Kingdom is accredited to Malta through its high commission in Valletta.\nThe UK governed Malta from 1800 until 1964, when it achieved full independence.\nBoth countries share common membership of the Commonwealth, the Council of Europe, European Court of Human Rights, the International Criminal Court, the OSCE, the United Nations, and the World Trade Organization. Bilaterally the two countries have a Bilateral Cooperation Framework, and a Double Taxation Convention.\n|- valign=\"top\"\n|||||See Moldova–United Kingdom relations\nMaia Sandu in Church House, May 2023.]]\nThe UK established diplomatic relations with Moldova on 17 January 1992.\n* Moldova maintains an embassy in London.\n* The United Kingdom is accredited to Moldova through its embassy in Chişinău.\nBoth countries share common membership of the Council of Europe, the European Court of Human Rights, the International Criminal Court, the OSCE, the United Nations, the World Health Organization, and the World Trade Organization. Bilaterally the two countries have a Development Partnership, a Double Taxation Convention, and a Strategic Partnership, Trade and Cooperation Agreement.\n|- valign=\"top\"\n|||||See Monaco–United Kingdom relations\nPierre Dartout at a European Political Community summit in Blenheim Palace, July 2024.]]\nThe UK established diplomatic relations with Monaco on 21 September 2007.\n*Monaco maintains an embassy in London.\n*The United Kingdom is not accredited to Monaco through an embassy; the UK develops relations through its embassy in Paris, France.\nBoth countries share common membership of the Council of Europe, the European Court of Human Rights, the OSCE, and the United Nations. Bilaterally the two countries have a Tax Information Exchange Agreement.\n|- valign=\"top\"\n|||||See Montenegro–United Kingdom relations\nMilojko Spajić at a Western Balkans Summit in Lancaster House, October 2025.]]\nThe UK established diplomatic relations with Montenegro on 13 June 2006.\n* Montenegro maintains an embassy in London.\n* The United Kingdom is accredited to Montenegro through its embassy in Podgorica.\nBoth countries share common membership of the Council of Europe, European Court of Human Rights, the International Criminal Court, NATO, OSCE, the United Nations, and the World Trade Organization. Bilaterally the two countries have a Double Taxation Convention, and a Reciprocal Healthcare Agreement.\n|- valign=\"top\"\n|||||See Netherlands–United Kingdom relations\nDick Schoof at a NATO summit in The Hague, June 2025.]]\nThe UK established diplomatic relations with the Netherlands on 1 April 1603.\n*The Netherlands maintains an embassy in London.\n* The United Kingdom is accredited to the Netherlands through its embassy in The Hague.\nBoth countries share common membership of the Atlantic Co-operation Pact, the Coalition of the Willing, the Council of Europe, the European Court of Human Rights, the International Criminal Court, the Joint Expeditionary Force, NATO, the OECD, the OSCE, the United Nations, and the World Trade Organization. Bilaterally the two countries have a Double Taxation Convention.\n|- valign=\"top\"\n|||||See North Macedonia–United Kingdom relations\nHristijan Mickoski at a European Political Community summit in Tirana, May 2025.]]\nThe UK established diplomatic relations with North Macedonia on 16 December 1993.\n*North Macedonia maintains an embassy in London.\n* The United Kingdom is accredited to North Macedonia through its embassy in Skopje.\nBoth countries share common membership of the Council of Europe, European Court of Human Rights, the International Criminal Court, NATO, OSCE, the United Nations, and the World Trade Organization. Bilaterally the two countries have a Partnership, Trade and Cooperation Agreement.\n|- valign=\"top\"\n|||||See Norway–United Kingdom relations\nJonas Gahr Støre in Bergen, December 2024.]]\nThe UK established diplomatic relations with Norway on 6 November 1905.\n*Norway maintains an embassy in London, and an honoury consulate general in Edinburgh.\n* The United Kingdom is accredited to Norway through its embassy in Oslo.\nBoth countries share common membership of the Atlantic Co-operation Pact, the Coalition of the Willing, the Council of Europe, the European Court of Human Rights, the International Criminal Court, the Joint Expeditionary Force, NATO, the OECD, the OSCE, the United Nations, and the World Trade Organization. Bilaterally the two countries have a Free Trade Agreement, a Green Partnership, and a Strategic Partnership Agreement.\n|- valign=\"top\"\n|||||See Poland–United Kingdom relations\nDonald Tusk in Warsaw, January 2025.]]\nThe UK established diplomatic relations with Poland on 15 July 1919.\n* Poland maintains an embassy in London.\n* The United Kingdom is accredited to Poland through its embassy in Warsaw.\nBoth countries share common membership of the Coalition of the Willing, the Council of Europe, European Court of Human Rights, the International Criminal Court, NATO, OECD, OSCE, Trilateral Security Pact, the United Nations, and the World Trade Organization. Bilaterally the two countries have a Defence and Security Agreement, a Double Tax Convention, and a Strategic Partnership.\n|- valign=\"top\"\n|||||See Portugal–United Kingdom relations\nAntónio Costa in 10 Downing Street, June 2022.]]\nThe UK established diplomatic relations with Portugal on 9 May 1386.\n* Portugal maintains an embassy and a consulate general in London and consulates in Belfast, Edinburgh, Hamilton and St Helier.\n* The United Kingdom is accredited to Portugal through its embassy in Lisbon, and a vice consulate in Portimão.\nBoth countries share common membership of the Atlantic Co-operation Pact, the Coalition of the Willing, the Council of Europe, European Court of Human Rights, the International Criminal Court, NATO, the OECD, the OSCE, the United Nations, the World Health Organization, and the World Trade Organization. Bilaterally the two countries have the Anglo-Portuguese Alliance, and a Double Taxation Convention.\n|- valign=\"top\"\n|||||See Romania–United Kingdom relations\nMarcel Ciolacu in 10 Downing Street, November 2024.]]\nThe UK established diplomatic relations with Romania on 20 February 1880.\n* Romania maintains an embassy in London, and consulate generals in Edinburgh and Manchester. Romania also maintains honorary consulates in Hirwaun, Leeds, Morpeth-Newcastle and Southampton.\n* The United Kingdom is accredited to Romania through its embassy in Bucharest.\nBoth countries share common membership of the Coalition of the Willing, the Council of Europe, European Court of Human Rights, the International Criminal Court, NATO, the OSCE, the United Nations, and the World Trade Organization. Bilaterally the two countries have a Defence Cooperation Agreement, and a Double Taxation Convention.\n|- valign=\"top\"\n|||||See Russia–United Kingdom relations\nVladimir Putin in Hangzhou, September 2016.]]\nThe UK established diplomatic relations with Russia on 24 August 1553.\n*Russia maintains an embassy in London.\n* The United Kingdom is accredited to Russia through its embassy in Moscow, and a consulate in Yekaterinburg.\nIn March 2022, the United Kingdom was added to Russia's unfriendly countries list.\nBoth countries share common membership of the European Court of Human Rights, G20, the OSCE, the UNSC P5 and the United Nations. Bilaterally the two countries have an Investment Agreement.\n|- valign=\"top\"\n|||||See San Marino–United Kingdom relations\nThe UK established diplomatic relations with San Marino on 18 November 1998.\n* San Marino does not maintain an embassy in the United Kingdom.\n* The United Kingdom is not accredited to San Marino through an embassy; the UK develops relations through its embassy in Rome, Italy.\nBoth countries share common membership of the Council of Europe, European Court of Human Rights, the International Criminal Court, OSCE, the United Nations, and the World Health Organization. Bilaterally the two countries have a Double Taxation Convention, and a Tax Information Exchange Agreement.\n|- valign=\"top\"\n|||||See Serbia–United Kingdom relations\nĐuro Macut at a Western Balkans Summit in Lancaster House, October 2025.]]\nThe UK established full diplomatic relations with Serbia on 7 February 1870.\n* Serbia maintains an embassy in London.\n* The United Kingdom is accredited to Serbia through its embassy in Belgrade.\nBoth countries share common membership of the Council of Europe, European Court of Human Rights, the International Criminal Court, OSCE and the United Nations. Bilaterally the two countries have a Double Taxation Convention, an Investment Agreement, a Partnership, Trade and Cooperation Agreement, and a Reciprocal Healthcare Agreement.\n|- valign=\"top\"\n|||||See Slovakia–United Kingdom relations\nEduard Heger in Lancaster House, March 2022.]]\nThe UK established diplomatic relations with Slovakia on 1 January 1993.\n*Slovakia maintains an embassy in London.\n* The United Kingdom is accredited to Slovakia through its embassy in Bratislava.\nBoth countries share common membership of the Council of Europe, the European Court of Human Rights, the International Criminal Court, NATO, the OECD, the OSCE, the United Nations, and the World Trade Organization. Bilaterally the two countries have a Double Taxation Convention.\n|- valign=\"top\"\n|||||See Slovenia–United Kingdom relations\nJanez Jansa in 10 Downing Street, September 2021.]]\nThe UK established diplomatic relations with Slovenia on 15 January 1992.\n*Slovenia maintains an embassy in London.\n* The United Kingdom is accredited to Slovenia through its embassy in Ljubljana.\nBoth countries share common membership of the Coalition of the Willing, the Council of Europe, European Court of Human Rights, the International Criminal Court, NATO, OECD, OSCE, the United Nations, and the World Trade Organization. Bilaterally the two countries have a Double Taxation Convention, and an Investment Agreement.\n|- valign=\"top\"\n|||||See Foreign relations of the Sovereign Military Order of Malta\nThe UK established official relations with Sovereign Military Order of Malta on 9 October 2024.\n*The Sovereign Military Order of Malta maintains the Grand Priory of England in London.\n* The United Kingdom is not accredited to the Sovereign Military Order of Malta through a mission.\n|- valign=\"top\"\n|||||See Spain–United Kingdom relations\nPedro Sánchez in 10 Downing Street, September 2025.]]\nThe UK established diplomatic relations with Spain in 1505.\n*Spain maintains an embassy in London.\n*The United Kingdom is accredited to Spain through its embassy in Madrid, a consulate general Barcelona, and consulates in Alicante, Ibiza, Las Palmas, Málaga, Palma de Mallorca, and Santa Cruz de Tenerife.\nBoth countries share common membership of the Atlantic Co-operation Pact, the Coalition of the Willing, the Council of Europe, the European Court of Human Rights, the International Criminal Court, NATO, the OECD, the OSCE, the United Nations, and the World Trade Organization. Bilaterally the two countries have a Double Taxation Convention.\n|- valign=\"top\"\n|||||See Sweden–United Kingdom relations\nUlf Kristersson at a JEF summit in Tallinn, December 2024.]]\nThe UK established diplomatic relations with Sweden on 23 December 1653.\n*Sweden maintains an embassy in London.\n*The United Kingdom is accredited to Sweden through its embassy in Stockholm.\nBoth countries share common membership of the Coalition of the Willing, the Council of Europe, the European Court of Human Rights, the International Criminal Court, the Joint Expeditionary Force, NATO, the OECD, the OSCE, the United Nations, and the World Trade Organization. Bilaterally the two countries have a Double Taxation Convention, a Mutual Defence Agreement, and a Strategic Partnership.\n|- valign=\"top\"\n|||||See Switzerland–United Kingdom relations\nViola Amherd at a European Political Community summit in Blenheim Palace, July 2024.]]\nThe UK established diplomatic relations with Switzerland in 1891.\n* Switzerland maintains an embassy in London, an honorary consulate general in Edniburgh, and honorary consulates in Belfast, Bermuda, Cardiff, the Cayman Islands, Gibraltar, and Manchester.\n* The United Kingdom is accredited to Switzerland through its embassy in Bern.\nBoth countries share common membership of the Council of Europe, European Court of Human Rights, the International Criminal Court, OECD, OSCE, the United Nations, and the World Trade Organization. Bilaterally the two countries have the Berne Financial Services Agreement, a Double Taxation Convention, and a Trade Agreement. The two countries are currently negotiating a Free Trade Agreement.\n|- valign=\"top\"\n|||||See Ukraine–United Kingdom relations\nwith Ukrainian President Volodymyr Zelenskyy in Kyiv, January 2025.]]\nThe UK established diplomatic relations with Ukraine on 10 January 1992.\n*Ukraine maintains an embassy in London, and a consulate in Edinburgh.\n* The United Kingdom is accredited to Ukraine through its embassy in Kyiv.\nBoth countries share common membership of the Coalition of the Willing, the Council of Europe, the European Court of Human Rights, the OSCE, a Trilateral Security Pact, the United Nations, and the World Trade Organization. Bilaterally the two countries have a Development Partnership, a Digital Trade Agreement, a Double Tax Convention, a Security Agreement, and a Political, Free Trade and Strategic Partnership Agreement.\n|}\nNorth America\n{| class=\"wikitable sortable\" style=\"width:100%; margin:auto;\"\n|-\n! style=\"width:15%;\" | Country\n! style=\"width:12%;\" | Since\n!Notes\n|- valign=\"top\"\n|||||See Antigua and Barbuda–United Kingdom relations\nThe UK established diplomatic relations with Antigua and Barbuda on 1 November 1981. Both countries are Commonwealth Realms.\n* Antigua and Barbuda maintains a high commission in London.\n* United Kingdom is accredited to Antigua and Barbuda through its high commission in Saint John's.\nThe UK governed Antigua and Barbuda from 1632 to 1981, when Antigua and Barbuda achieved full independence.\nBoth countries share common membership of the Caribbean Development Bank, the Commonwealth, the International Criminal Court, the United Nations, and the World Trade Organization, as well as the CARIFORUM–UK Economic Partnership Agreement.\n|- valign=\"top\"\n|||||See The Bahamas–United Kingdom relations\nThe UK established diplomatic relations with the Bahamas on 10 July 1973. Both countries are Commonwealth Realms.\n*The Bahamas maintains a high commission in London.\n*The United Kingdom is accredited to the Bahamas through its high commission in Nassau.\nThe UK governed the Bahamas from 1648 to 1973, when the Bahamas achieved full independence.\nBoth countries share common membership of the Caribbean Development Bank, the Commonwealth, the International Criminal Court, the United Nations, and the World Trade Organization, as well as the CARIFORUM–UK Economic Partnership Agreement. Bilaterally the two countries have a Tax Information Exchange Agreement.\n|- valign=\"top\"\n|||||See Barbados–United Kingdom relations\nMia Mottley at a United Nations General Assembly in New York City, September 2024.]]\nThe UK established diplomatic relations with Barbados on 30 November 1966.\n* Barbados maintains a high commission in London.\n*The United Kingdom is accredited to Barbados through its high commission in Bridgetown.\nThe UK governed Barbados from 1625 to 1966, when Barbados achieved full independence.\nBoth countries share common membership of the Caribbean Development Bank, the Commonwealth, the International Criminal Court, the United Nations, and the World Trade Organization, as well as the CARIFORUM–UK Economic Partnership Agreement. Bilaterally the two countries have an Investment Agreement.\n|- valign=\"top\"\n|||||See Belize–United Kingdom relations\nDean Barrow in London, June 2013.]]\nThe UK established diplomatic relations with Belize on 21 September 1981. Both countries are Commonwealth Realms.\n* Belize maintains a high commission in London.\n* The United Kingdom is accredited to Belize from its high commission in Belmopan.\nThe UK governed Belize from 1783 to 1981, when Belize achieved full independence.\nBoth countries share common membership of the Atlantic Co-operation Pact, Caribbean Development Bank, the Commonwealth, the International Criminal Court, the United Nations, and the World Trade Organization, as well as the CARIFORUM–UK Economic Partnership Agreement. Bilaterally the two countries have a Defence Cooperation Agreement,  and an Investment Agreement.\n|- valign=\"top\"\n|||||See Canada–United Kingdom relations\nMark Carney in Westminster City Hall, September 2025.]]\nThe UK established diplomatic relations with Canada on 1 July 1926. Both countries are Commonwealth Realms.\n*Canada maintains a high commission in London.\n* The United Kingdom is accredited to Canada through its high commission in Ottawa, and consulate generals in Calgary, Montreal, Toronto, and Vancouver.\nThe UK governed Canada from 1783 to 1931, when Canada achieved full independence.\nBoth countries share common membership of the Atlantic Co-operation Pact, the Coalition of the Willing, the Commonwealth, CPTPP, Five Eyes, the G7, the G20, the International Criminal Court, NATO, the OECD, the OSCE, the UKUSA Agreement, the United Nations, and the World Trade Organization. Bilaterally the two countries have a Double Taxation Convention, and a Trade Continuity Agreement.\n|- valign=\"top\"\n||| 1848 ||See Costa Rica–United Kingdom relations\nThe UK established diplomatic relations with Costa Rica on 28 February 1848.\n*Costa Rica maintains an embassy in London.\n*The United Kingdom is accredited to Costa Rica from its embassy in San José.\nBoth countries share common membership of the Atlantic Co-operation Pact, the International Criminal Court, the OECD, the United Nations, and the World Trade Organization, as well as the Central America–UK Association Agreement. Bilaterally the two countries have an Investment Agreement.\n|- valign=\"top\"\n|||||See Cuba–United Kingdom relations\nThe UK established diplomatic relations with Cuba on 20 May 1902.\n*Cuba maintains an embassy in London.\n* United Kingdom is accredited to Cuba from its embassy in Havana.\nBoth countries share common membership of the United Nations, and the World Trade Organization. Bilaterally the two countries have an Investment Agreement, and a Political Dialogue and Co-operation Agreement.\n|- valign=\"top\"\n||||| See Dominica–United Kingdom relations\nCharles Savarin in Lancaster House, May 2023.]]\nThe UK established diplomatic relations with Dominica on 13 December 1978.\n* Dominica maintains a high commission in London.\n*The United Kingdom is not accredited to Dominica through a high commission; the UK develops relations through its high commission in Bridgetown, Barbados.\nThe UK governed Dominica from 1763 to 1978, when Dominica achieved full independence.\nBoth countries share common membership of the Atlantic Co-operation Pact, Caribbean Development Bank, the Commonwealth, the International Criminal Court, the United Nations, the World Health Organization, and the World Trade Organization, as well as the CARIFORUM–UK Economic Partnership Agreement. Bilaterally the two countries have a Tax Information Exchange Agreement, an Investment Agreement.\n|- valign=\"top\"\n||| 1850 ||See Dominican Republic–United Kingdom relations\nDavid Rutley with Dominican Republic President Luis Abinader in London, May 2023.]]\nThe UK established diplomatic relations with the Domican Republic on 6 March 1850.\n* Dominican Republic maintains an embassy in London.\n*The United Kingdom is accredited to Dominican Republic from its embassy in Santo Domingo.\nBoth countries share common membership of the Atlantic Co-operation Pact, the International Criminal Court, the United Nations, and the World Trade Organization, as well as the CARIFORUM–UK Economic Partnership Agreement. Bilaterally the two countries have a Maritime Boundary Agreement.\n|- valign=\"top\"\n|||1883||See El Salvador–United Kingdom relations\nBernhard Garside with Salvadoran President Salvador Sánchez Cerén in San Salvador, March 2015.]]\nThe UK established diplomatic relations with El Salvador in 1883.\n* El Salvador maintains an embassy in London.\n*The United Kingdom is accredited to El Salvador from its embassy in San Salvador.\nBoth countries share common membership of the International Criminal Court, the United Nations, and the World Trade Organization, as well as the Central America–UK Association Agreement. Bilaterally the two countries have an Investment Agreement.\n|- valign=\"top\"\n||| N/A ||See Greenland–United Kingdom relations\nThe UK maintains relations with Greenland through its relations with Denmark.\n*Greenland does not maintain a representation in the United Kingdom; Greenland develops relations with the UK through the Danish embassy in London.\n*The United Kingdom is accredited to Greenland through its consulate in Nuuk.\nBilaterally the two countries are negotiating a Free Trade Agreement.\n|- valign=\"top\"\n|||||See Grenada–United Kingdom relations\nThe UK established diplomatic relations Grenada on 7 February 1974. Both countries are Commonwealth Realms.\n*Grenada maintains a high commission in London.\n*The United Kingdom is accredited to Grenada through its high commission in Saint George's.\nThe UK governed Grenada from 1762 until 1974, when Grenada achieved full independence.\nBoth countries share common membership of the Caribbean Development Bank, the Commonwealth, the International Criminal Court, the United Nations, and the World Trade Organization, as well as the CARIFORUM–UK Economic Partnership Agreement.\n|- valign=\"top\"\n|||1837||See Guatemala–United Kingdom relations\nCarlos Raúl Morales in London, November 2014.]]\nThe UK established diplomatic relations with Guatemala on 12 July 1837.\n* Guatemala maintains an embassy in London.\n* The United Kingdom is accredited to Guatemala from its embassy in Guatemala City.\nBoth countries share common membership of the Atlantic Co-operation Pact, the International Criminal Court, the United Nations, and the World Trade Organization, as well as the Central America–UK Association Agreement.\n|- valign=\"top\"\n|||1859||See Haiti–United Kingdom relations\nThe UK established diplomatic relations with Haiti on 13 May 1859.\n* Haiti maintains an embassy in London.\n* The United Kingdom is accredited to Haiti from its embassy in Port-au-Prince.\nBoth countries share common membership of the United Nations, and the World Trade Organization. Bilaterally the two countries have an Investment Agreement.\n|- valign=\"top\"\n|||1849||See Honduras–United Kingdom relations\nThe UK established diplomatic relations with Honduras on 16 June 1849.\n* Honduras maintains an embassy in London.\n* The United Kingdom is not accredited to Honduras through an embassy; the UK is accredited to Honduras through its embassy in Guatemala City.\nThe UK governed the Mosquito Coast from 1638 to 1787 and 1816 to 1819.\nBoth countries share common membership of the International Criminal Court, the United Nations, the World Health Organization, and the World Trade Organization, as well as the Central America–UK Association Agreement.\n|- valign=\"top\"\n|||||See Jamaica–United Kingdom relations\nAndrew Holness in 10 Downing Street, April 2018.]]\nThe UK established diplomatic relations with Jamaica on 2 August 1962.  Both countries are Commonwealth Realms.\n*Jamaica maintains a high commission in London.\n*The United Kingdom is accredited to Jamaica through its high commission in Kingston.\nThe UK governed Jamaica from 1655 to 1962, when Jamaica achieved full independence.\nBoth countries share common membership of the Caribbean Development Bank, the Commonwealth, the International Criminal Court, the United Nations, and the World Trade Organization, as well as the CARIFORUM–UK Economic Partnership Agreement. Bilaterally the two countries have an Investment Agreement.\n|- valign=\"top\"\n|||||See Mexico–United Kingdom relations\nJuan Ramón de la Fuente in Toronto, November 2025.]]\nThe UK established diplomatic relations with Mexico on 26 December 1826.\n*Mexico maintains a high commission in London.\n*The United Kingdom is accredited to Mexico through its embassy in Mexico City, and a consulate general in Cancún.\nBoth countries share common membership of CPTPP, the G20, the International Criminal Court, the OECD, the United Nations, and the World Trade Organization. Bilaterally the two countries have a Double Taxation Convention, an Investment Agreement, and a Trade Continuity Agreement. Additionally the two countries are negotiating a Free Trade Agreement.\n|- valign=\"top\"\n|||||See Nicaragua–United Kingdom relations\nSamuel Santos López in London, November 2013.]]\nThe UK established diplomatic relations with Nicaragua on 18 January 1859.\n*Nicaragua maintains an embassy in London.\n*The United Kingdom is accredited to Nicaragua from its embassy in San Jose, Costa Rica; there is no British embassy in Nicaragua.\nThe UK governed the Mosquito Coast from 1638 to 1787 and 1816 to 1819.\nBoth countries share common membership of the United Nations, and the World Trade Organization, as well as the Central America–UK Association Agreement. Bilaterally the two countries have an Investment Agreement.\n|- valign=\"top\"\n|||||See Panama–United Kingdom relations\nJuan Carlos Varela in 10 Downing Street, May 2018.]]\nThe UK established diplomatic relations with Panama on 9 April 1908.\n*Panama maintains an embassy in London.\n*The United Kingdom is accredited to Panama from its embassy in Panama City.\nBoth countries share common membership of the International Criminal Court, the United Nations, the World Health Organization, and the World Trade Organization, as well as the Central America–United Kingdom Association Agreement. Bilaterally the two countries have a Double Taxation Convention, and an Investment Agreement.\n|- valign=\"top\"\n||| N/A ||See Foreign and intergovernmental relations of Puerto Rico\nThe UK maintains relations with Puerto Rico through its relations with the United States.\n*Puerto Rico does not maintain a representation in the United Kingdom; Puerto Rico develops relations with the UK through the US embassy in London.\n*The United Kingdom is accredited to Puerto Rico through its consulate in San Juan.\n|- valign=\"top\"\n|||||See Saint Kitts and Nevis–United Kingdom relations\nThe UK established diplomatic relations with Saint Kitts and Nevis on 19 September 1983. Both countries are Commonwealth Realms.\n*Saint Kitts and Nevis maintains a high commission in London.\n*The United Kingdom is accredited to Saint Kitts and Nevis from its high commission in Bridgetown; there is no British high commission in Saint Kitts and Nevis.\nThe UK governed Saint Kitts and Nevis from the 17th century to 1983, when Saint Kitts and Nevis achieved full independence.\nBoth countries share common membership of the Caribbean Development Bank, the Commonwealth, the International Criminal Court, the United Nations, and the World Trade Organization, as well as the CARIFORUM–UK Economic Partnership Agreement.\n|- valign=\"top\"\n|||||See Saint Lucia–United Kingdom relations\nStephenson King in Lancaster House, April 2011.]]\nThe UK established diplomatic relations with Saint Lucia in 1979. Both countries are Commonwealth Realms.\n*Saint Lucia maintains a high commission in London.\n* The United Kingdom is accredited to its high commission in Castries.\nThe UK governed Saint Lucia from 1803 to 1979, when Saint Lucia achieved full independence.\nBoth countries share common membership of the Caribbean Development Bank, Commonwealth, the International Criminal Court, the United Nations, the World Trade Organization, and the CARIFORUM–UK Economic Partnership Agreement. Bilaterally the two countries have an Investment Agreement.\n|- valign=\"top\"\n|||||See Saint Vincent and the Grenadines–United Kingdom relations\nRalph Gonsalves in London, December 2024.]]\nThe UK established diplomatic relations with Saint Vincent and the Grenadines on 27 October 1979. Both countries are Commonwealth Realms.\n*Saint Vincent and the Grenadines maintains a high commission in London.\n* The United Kingdom is accredited to its high commission in Kingstown.\nThe UK governed Saint Vincent and the Grenadines as part of the Windward Islands colony from 1833 to 1979, when Saint Vincent and the Grenadines achieved full independence.\nBoth countries share common membership of the Caribbean Development Bank, Commonwealth, the International Criminal Court, the United Nations, the World Trade Organization, and the CARIFORUM–UK Economic Partnership Agreement.\n|- valign=\"top\"\n|||||See Trinidad and Tobago–United Kingdom relations\nCharles in Trinidad and Tobago, March 2008.]]\nThe UK established diplomatic relations with Trinidad and Tobago on 31 August 1962.\n*Trinidad and Tobago maintains a high commission in London.\n* The United Kingdom is accredited to its high commission in Port of Spain.\nThe UK governed Trinidad and Tobago from 1797 to 1962, when Trinidad and Tobago achieved full independence.\nBoth countries share common membership of the Caribbean Development Bank, the Commonwealth, the International Criminal Court, the United Nations, the World Trade Organization, and the CARIFORUM–UK Economic Partnership Agreement. Bilaterally the two countries have a Double Taxation Convention,\n|- valign=\"top\"\n|||||See United Kingdom–United States relations\nDonald Trump in Chequers, September 2025.]]\nThe UK established diplomatic relations with the United States on 1 June 1785. UK–US diplomatic relations is commonly described as the \"Special Relationship\".\n*The United States maintains an embassy in London.\n* The United Kingdom is accredited to the United States through its embassy in Washington, D.C.\nThe UK governed the United States from 1585 to 1783, when the United States achieved full independence.\nBoth countries share common membership of the Atlantic Co-operation Pact, AUKUS, Five Eyes, the G7, the G20, NATO, the OECD, the OSCE, the UKUSA Agreement, the UNSC P5, the United Nations, and the World Trade Organization. Bilateral the two countries have a Double Taxation Convention, an Economic Prosperity Deal, and a Mutual Defence Agreement.\n|}\nOceania\n{| class=\"wikitable sortable\" style=\"width:100%; margin:auto;\"\n|-\n! style=\"width:15%;\"| Country\n! style=\"width:12%;\" | Since\n!Notes\n|- valign=\"top\"\n|||||See Australia–United Kingdom relations\nAnthony Albanese at a Commonwealth summit in Apia, October 2024.]]\nThe UK established diplomatic relations with Australia in March 1936. Both countries are Commonwealth Realms.\n*Australia maintains a high commission in London.\n* The United Kingdom is accredited to Australia through its high commission in Canberra, the UK also maintains consulate generals in Brisbane, Melbourne, and Sydney, additionally the United Kingdom maintains a consulate in Perth.\nThe UK governed Australia from the late 18th century until 1942, when Australia achieved full independence.\nBoth countries share common membership of AUKUS, the Coalition of the Willing, the Commonwealth, CPTPP, Five Eyes, the Five Power Defence Arrangements, the G20, the International Criminal Court, OECD, the UKUSA Agreement, the United Nations, the World Health Organization, and the World Trade Organization. Bilaterally the two countries have a Climate and Energy Partnership, Defence Agreement, a Double Taxation Agreement, a Free Trade Agreement, and a Reciprocal Healthcare Agreement.\n|- valign=\"top\"\n||| N/A ||See Cook Islands–United Kingdom relations\nMark Brown at a United Nations General Assembly in New York City, September 2023.]]\nThe UK has not established diplomatic relations with the Cook Islands; the UK does not recognise the Cook Islands to be a sovereign nation.\n*The Cook Islands does not maintain an embassy in the United Kingdom.\n*The United Kingdom is not accredited to the Cook Islands through an embassy; the UK develops relations through its high commission in Wellington, New Zealand.\nThe UK governed the Cook Islands from 1888 until 1901, when the Cook Islands were transferred to New Zealand.\nBoth countries share common membership of the World Health Organization.\n|- valign=\"top\"\n|||||See Foreign relations of the Federated States of Micronesia\nThe UK established diplomatic relations with the Federated States of Micronesia on 31 August 1992.\n*Federated States of Micronesia does not maintain an embassy in the United Kingdom.\n*The United Kingdom is not accredited to the Federated States of Micronesia through an embassy; the UK develops relations through its high commission in Suva, Fiji.\nBoth countries share common membership of the United Nations, and the World Health Organization.\n|- valign=\"top\"\n|||||See Fiji–United Kingdom relations\nSitiveni Rabuka in London, May 2024.]]\nThe UK established diplomatic relations with Fiji on 10 October 1970.\n*Fiji maintains a high commission in London.\n* The United Kingdom is accredited to Fiji through its high commission in Suva.\nThe UK governed Fiji from 1874 until 1970, when Fiji achieved full independence.\nBoth countries share common membership of the Commonwealth, the International Criminal Court, the United Nations, the World Health Organization, and the World Trade Organization, as well as the Pacific States–United Kingdom Economic Partnership Agreement. Bilaterally the two countries have a Double Taxation Convention.\n|- valign=\"top\"\n|||||See Kiribati–United Kingdom relations\nThe UK established diplomatic relations with Kiribati on 12 July 1979.\n*Kiribati does not maintain a high commission in the United Kingdom.\n*The United Kingdom is not accredited to Kiribati through a high commission; the UK develops relations through its high commission in Suva, Fiji.\nThe UK governed Kiribati from 1892 until 1979, when Kiribati achieved full independence.\nBoth countries share common membership of the Commonwealth, the International Criminal Court the United Nations, and the World Health Organization. Bilaterally the two countries have a Double Taxation Agreement.\n|- valign=\"top\"\n|||||See Marshall Islands–United Kingdom relations\nThe UK established diplomatic relations with the Marshall Islands on 2 February 1992.\n*The Marshall Islands does not maintain an embassy in the United Kingdom.\n*The United Kingdom is not accredited to the Marshall Islands through an embassy; the UK develops relations through its high commission in Suva, Fiji.\nBoth countries share common membership of the International Criminal Court, the United Nations, and the World Health Organization. Bilaterally the two countries have a Tax Information Exchange Agreement.\n|- valign=\"top\"\n|||||See Nauru–United Kingdom relations\nZac Goldsmith with Nauruan President Russ Kun in London, May 2023.]]\nThe UK established diplomatic relations with Nauru on 1 December 1977.\n*Nauru does not maintain an embassy in the United Kingdom.\n*The United Kingdom is not accredited to Nauru through an embassy; the UK develops relations through its high commission in Honiara, Solomon Islands.\nThe UK officially governed Nauru jointly with Australia and New Zealand from 1914 until 1968, when Nauru achieved full independence.\nBoth countries share common membership of the Commonwealth, the International Criminal Court, the United Nations, and the World Health Organization.\n|- valign=\"top\"\n|||||See New Zealand–United Kingdom relations\nChristopher Luxon at a Commonwealth summit in Apia, October 2024.]]\nThe UK established diplomatic relations with New Zealand in March 1939. Both countries are Commonwealth Realms.\n*New Zealand maintains a high commission in London.\n* The United Kingdom is accredited to New Zealand through its high commission in Wellington, in addition to a consulate general in Auckland.\nThe UK governed New Zealand from 1840 until 1947, when New Zealand achieved full independence.\nBoth countries share common membership of the Coalition of the Willing, the Commonwealth, CPTPP, Five Eyes, the Five Power Defence Arrangements, the International Criminal Court, OECD, the UKUSA Agreement, the United Nations, the World Health Organization, and the World Trade Organization. Bilaterally the two countries have Free Trade Agreement, and a Reciprocal Healthcare Agreement.\n|- valign=\"top\"\n|||N/A||See Niue–United Kingdom relations\nThe UK has not established diplomatic relations with Niue; the UK does not recognise Niue to be a sovereign nation.\n*Niue does not maintain an embassy in the United Kingdom.\n*The United Kingdom is not accredited to Niue through an embassy; the UK develops relations through its high commission in Wellington, New Zealand.\nThe UK governed Niue from 1900 until 1901, when Niue was transferred to New Zealand.\nBoth countries share common membership of the World Health Organization.\n|- valign=\"top\"\n|||||See Foreign relations of Palau\nThe UK established diplomatic relations with Palau on 16 August 1996.\n*Palau does not maintain an embassy in the United Kingdom.\n*The United Kingdom is not accredited to Palau through an embassy; the UK develops relations through its embassy in Manila, Philippines.\nBoth countries share common membership of the United Nations, and the World Health Organization.\n|- valign=\"top\"\n|||||See Papua New Guinea–United Kingdom relations\nJames Marape in Port Moresby, April 2023.]]\nThe UK established diplomatic relations with Papua New Guinea on 16 September 1975. Both countries are Commonwealth Realms.\n*Papua New Guinea maintains a high commission in London.\n* The United Kingdom is accredited to Fiji through its high commission in Port Moresby.\nThe UK governed Papua New Guinea from 1884 until 1906, when the territory was transferred to Australia.\nBoth countries share common membership of the Commonwealth, the International Criminal Court, the United Nations, the World Health Organization, and the World Trade Organization, as well as the Pacific States–United Kingdom Economic Partnership Agreement. Bilaterally the two countries have a Double Taxation Convention, an Investment Agreement, and a Security Agreement.\n|- valign=\"top\"\n|||||See Samoa–United Kingdom relations\nFiamē Naomi Mataʻafa at a Commonwealth summit in Apia, October 2024.]]\nThe UK established diplomatic relations with Samoa in September 1970.\n*Samoa is not accredited to the UK through an embassy; Samoa develops relations through its embassy in Brussels, Belgium.\n* The United Kingdom is accredited to Samoa through its high commission in Apia.\nBoth countries share common membership of the Commonwealth, the International Criminal Court, the United Nations, the World Health Organization, and the World Trade Organization, as well as the Pacific States–United Kingdom Economic Partnership Agreement.\n|- valign=\"top\"\n|||||See Solomon Islands–United Kingdom relations\nThe UK established diplomatic relations with the Solomon Islands on 7 July 1978. Both countries are Commonwealth Realms.\n*Solomon Islands does not maintain a high commission in the United Kingdom.\n*The United Kingdom is accredited to the Solomon Islands through its high commission in Honiara.\nThe UK governed the Solomon Islands from 1893 until 1978, when the Solomon Islands achieved full independence.\nBoth countries share common membership of the Commonwealth, the United Nations, the World Health Organization,  and the World Trade Organization, as well as the Pacific States–United Kingdom Economic Partnership Agreement. Bilaterally the two countries have a Double Taxation Agreement.\n|- valign=\"top\"\n|||||See Tonga–United Kingdom relations\nThe UK established diplomatic relations with Tonga on 4 June 1970.\n*Tonga maintains an high commission in London.\n* The United Kingdom is accredited to Tonga through its high commission in Nuku'Alofa.\nThe UK governed Tonga from 1900 until 1970, when Tonga achieved full independence.\nBoth countries share common membership of the Commonwealth, the United Nations, the World Health Organization, and the World Trade Organization. Bilaterally the two countries have an Investment Agreement.\n|- valign=\"top\"\n||| 1978 || See Tuvalu–United Kingdom relations\nThe UK established diplomatic relations with Tuvalu on 1 October 1978.\n*Tuvalu maintains an honorary consulate in London.\n*The United Kingdom is not accredited to Tuvalu through a high commission; the UK develops relations through its high commission in Suva, Fiji.\nThe UK governed Tuvalu from 1892 until 1978, when Tuvalu achieved full independence.\nBoth countries share common membership of the Commonwealth, the United Nations, and the World Health Organization. Bilaterally the two countries have a Double Taxation Arrangement.\n|- valign=\"top\"\n|||||See United Kingdom–Vanuatu relations\nThe UK established diplomatic relations with Vanuatu on 30 July 1980.\n*Vanuatu does not maintain a high commission in the United Kingdom.\n*The United Kingdom is accredited to Vanuatu through its high commission in Port Vila.\nThe UK governed Vanuatu from 1887 until 1980, when Vanuatu achieved full independence.\nBoth countries share common membership of the Commonwealth, the United Nations, the World Health Organization, and the World Trade Organization. Bilaterally the two countries have signed an Investment Agreement.\n|}\nSouth America\n{| class=\"wikitable sortable\" style=\"width:100%; margin:auto;\"\n|-\n! style=\"width:15%;\" | Country\n! style=\"width:12%;\" | Since\n!Notes\n|- valign=\"top\"\n|||||See Argentina–United Kingdom relations\nJavier Milei at a G20 summit in Rio de Janeiro, November 2024.]]\nThe UK established diplomatic relations with Argentina on 2 February 1825.\n*Argentina maintains an embassy in London.\n*The United Kingdom is accredited to Argentina through its embassy in Buenos Aires.\nBoth countries share common membership of the Atlantic Co-operation Pact, the International Criminal Court, the United Nations, the World Health Organization, and the World Trade Organization. Bilaterally the two countries have a Double Taxation Convention, and an Investment Agreement.\n|- valign=\"top\"\n|||||See Bolivia–United Kingdom relations\nDavid Choquehuanca in London, March 2024.]]\nThe UK established diplomatic relations with Bolivia on 29 September 1840.\n*Bolivia maintains an embassy in London.\n*The United Kingdom is accredited to Bolivia through its embassy in La Paz.\nBoth countries share common membership of the International Criminal Court, the United Nations, the World Health Organization, and the World Trade Organization. Bilaterally the two countries have a Double Taxation Convention.\n|- valign=\"top\"\n|||||See Brazil–United Kingdom relations\nLuiz Inácio Lula da Silva at a G20 summit in Rio de Janeiro, November 2024.]]\nThe UK established diplomatic relations with Brazil on 17 August 1827.\n*Brazil maintains an embassy in London.\n*The United Kingdom is accredited to Brazil through its embassy in Brasília, and consulates in Belo Horizonte, Recife, Rio de Janeiro, and São Paulo.\nBoth countries share common membership of the Atlantic co-operation pact, the G20, the International Criminal Court, the United Nations, the World Health Organization, and the World Trade Organization.\n|- valign=\"top\"\n|||||See Chile–United Kingdom relations\nGabriel Boric at a G20 summit in Rio de Janeiro, November 2024.]]\nThe UK established diplomatic relations with Chile on 14 September 1823.\n*Chile maintains an embassy in London.\n*The United Kingdom is accredited to Chile through its embassy in Santiago.\nBoth countries share common membership of CPTPP, the International Criminal Court, OECD, the United Nations, the World Health Organization, and the World Trade Organization. Bilaterally the two countries have an Association Agreement, and a Double Taxation Convention.\n|- valign=\"top\"\n|||||See Colombia–United Kingdom relations\nJuan Manuel Santos in Downing Street, November 2016.]]\nThe UK established diplomatic relations with Colombia on 18 April 1825.\n*Colombia maintains an embassy in London.\n*The United Kingdom is accredited to Colombia through its embassy in Bogotá.\nBoth countries share common membership of the International Criminal Court, the OECD, the United Nations, the World Health Organization, and the World Trade Organization, as well as the Andean Countries–UK Free Trade Agreement. Bilaterally the two countries havea Cultural Agreement, a Double Taxation Agreement, an Investment Agreement, a Partnership for Sustainable Growth, and a Security Agreement.\n|- valign=\"top\"\n|||||See Ecuador–United Kingdom relations\nJeremy Browne with acting Ecuadorian Foreign Minister Kintto Lucas in Quito, July 2011.]]\nThe UK established diplomatic relations with Ecuador on 29 January 1853.\n*Ecuador maintains an embassy in London.\n*The United Kingdom is accredited to Ecuador through its embassy in Quito.\nBoth countries share common membership of the International Criminal Court, the United Nations, the World Health Organization, and the World Trade Organization, as well as the Andean Countries–UK Trade Agreement. Bilaterally the two countries have a Double Taxation Agreement.\n|- valign=\"top\"\n|||||See Guyana–United Kingdom relations\nIrfaan Ali at a Commonwealth summit in Apia, October 2024.]]\nThe UK established diplomatic relations with Guyana on the 26 May 1966.\n*Guyana maintains a high commission in London.\n*The United Kingdom is accredited to Guyana through its high commission in Georgetown.\nThe UK governed Guyana from 1803 to 1966, when Guyana achieved full independence.\nBoth countries share common membership of the Atlantic Co-operation Pact, the Caribbean Development Bank, the Commonwealth, the International Criminal Court, the United Nations, the World Health Organization, and the World Trade Organization, as well as the CARIFORUM–United Kingdom Economic Partnership Agreement. Bilaterally the two countries have a Double Taxation Convention, and an Investment Agreement.\n|- valign=\"top\"\n|- valign=\"top\"\n|||||See Paraguay–United Kingdom relations\nRubén Ramírez Lezcano in London, July 2025.]]\nThe UK established diplomatic relations with Paraguay on 4 March 1853.\n*Paraguay maintains an embassy in London.\n*The United Kingdom is accredited to Paraguay through its embassy in Asunción.\nBoth countries share common membership of the International Criminal Court, the United Nations, the World Health Organization, and the World Trade Organization. Bilaterally the two countries have an Investment Agreement.\n|- valign=\"top\"\n|||||See Peru–United Kingdom relations\nElmer Schialer in London, January 2025.]]\nThe UK established diplomatic relations with Peru on 10 October 1823.\n*Peru maintains an embassy in London.\n*The United Kingdom is accredited to Peru through its embassy in Lima.\nBoth countries are members of CPTPP, the International Criminal Court, the United Nations, the World Health Organization, and the World Trade Organization, as well as the Andean Countries–UK Free Trade Agreement. Bilaterally the two countries have an Investment Agreement.\n|- valign=\"top\"\n|||||See Suriname–United Kingdom relations\nThe UK established diplomatic relations with Suriname on 31 March 1976.\n*Suriname does not maintain an embassy in the UK.\n*The United Kingdom is not accredited to Suriname through an embassy; the UK develops relations through its high commission in Georgetown, Guyana.\nEngland governed Suriname from 1650 to 1667, when Suriname was ceded to the Netherlands. The UK occupied Suriname from 1799 until 1816.\nBoth countries share common membership of the Atlantic Co-operation Pact, the Caribbean Development Bank, the International Criminal Court, the United Nations, the World Health Organization, and the World Trade Organization, as well as the CARIFORUM–United Kingdom Economic Partnership Agreement.\n|- valign=\"top\"\n|||||See United Kingdom–Uruguay relations\nLuis Lacalle Pou in 10 Downing Street, May 2022.]]\nThe UK established diplomatic relations with Uruguay on 21 February 1833.\n*Uruguay maintains an embassy in London.\n*The United Kingdom is accredited to Uruguay through its embassy in Montevideo.\nBoth countries share common membership of the Atlantic Co-operation Pact, the International Criminal Court, the United Nations, the World Health Organization, and the World Trade Organization. Bilaterally the two countries have a Double Taxation Convention, and an Investment Agreement.\n|- valign=\"top\"\n|||||See United Kingdom–Venezuela relations\nThe UK established diplomatic relations with Venezuela on 29 October 1834.\n*Venezuela maintains an embassy in London.\n*The United Kingdom is accredited to Venezuela through its embassy in Caracas.\nBoth countries share common membership of the International Criminal Court, the United Nations, the World Health Organization, and the World Trade Organization. Bilaterally the two countries have an Investment Agreement.\n|}\nSovereignty disputes\nMarie Byrd Land.\n]] celebrations in 2013]]\nList of territorial disputes involving the United Kingdom:\n{| class=\"wikitable sortable\"\n! Territory\n! width=160px|Claimants\n! class=\"unsortable\"|Notes\n|-\n|Antarctica\n|\n|See Territorial claims in Antarctica\nThe United Kingdom claims the area between  and  as a British Overseas Territory. The area between 25°W and 53°W overlaps Argentina's claim. The area between 74°W and 80°W overlaps Chile's claim. The area between 53°W and 74°W overlaps the claims of both Argentina and Chile.\n|-\n|Chagos Archipelago\n|\n|See Chagos Archipelago sovereignty dispute\nThe United Kingdom de facto administers the archipelago as the British Indian Ocean Territory. Mauritius claims the islands. On 22 May 2025, Mauritius and the United Kingdom signed a deal to hand sovereignty over to Mauritius; the dispute will end once the deal is ratified by both parties.\n|-\n|Rock of Gibraltar\n|\n|See Status of Gibraltar\nThe United Kingdom de facto governs Gibraltar as a British Overseas Territory. Spain claims Gibraltar, disputing the interpretation of the Treaty of Utrecht, as well as the location of the border. Gibraltarians voted overwhelmingly to remain under British sovereignty in 1967 and 2002.\n|-\n|Falkland Islands\n|\n|See Falkland Islands sovereignty dispute\nThe United Kingdom de facto governs the Falkland Islands as a British Overseas Territory. Argentina claims the Islands as part of its Province of Tierra del Fuego, Antarctica and South Atlantic Islands province. In 1982, the dispute escalated when Argentina invaded the islands during the Falklands War. In 2013, the Falkland Islanders voted overwhelmingly to remain a British Overseas Territory.\n|-\n|Rockall Bank\n|\n|See Rockall Bank dispute\nRockall is an uninhabited islet located within the exclusive economic zone of the UK. Ireland, Denmark, Iceland, and the UK have all made submissions to the commission set up under the United Nations Convention on the Law of the Sea (UNCLOS).\n|-\n|South Georgia,South Sandwich Islands\n|\n|See South Georgia and the South Sandwich Islands sovereignty dispute\nThe United Kingdom de facto governs South Georgia and the South Sandwich Islands as a British Overseas Territory. Argentina claims the Islands as part of its Province of Tierra del Fuego, Antarctica and South Atlantic Islands province. In 1982, the dispute escalated when Argentina invaded South Georgia during the Falklands War.\n|-\n|}\nCommonwealth of Nations\n.]]\nThe UK has varied relationships with the countries that make up the Commonwealth of Nations which originated from the British Empire. Charles III of the United Kingdom is Head of the Commonwealth and is King of 15 of its 56 member states. Those that retain the King as head of state are called Commonwealth realms. Over time several countries have been suspended from the Commonwealth for various reasons. Zimbabwe was suspended because of the authoritarian rule of its President.\nInternational organisations\nThe United Kingdom is a member of the following international organisations:\n* ACP - Atlantic Co-operation Pact\n* ADB - Asian Development Bank (nonregional member)\n* AfDB - African Development Bank (nonregional member)\n* Arctic Council (observer)\n* Australia Group\n* BIS - Bank for International Settlements\n* Commonwealth of Nations\n* CBSS - Council of the Baltic Sea States (observer)\n* CDB - Caribbean Development Bank\n* Council of Europe\n* CERN - European Organization for Nuclear Research\n* CPTPP - Comprehensive and Progressive Agreement for Trans–Pacific Partnership\n* EAPC - Euro-Atlantic Partnership Council\n* EBRD - European Bank for Reconstruction and Development\n* ESA - European Space Agency\n* FAO - Food and Agriculture Organization\n* FATF - Financial Action Task Force\n* G7 - Group of Seven\n* G10 - Group of Ten\n* G20 - Group of Twenty\n* IADB - Inter-American Development Bank\n* IAEA - International Atomic Energy Agency\n* IBRD - International Bank for Reconstruction and Development (also known as the World Bank)\n* ICAO - International Civil Aviation Organization\n* ICC - International Chamber of Commerce\n* ICCt - International Criminal Court\n* ICRM - International Red Cross and Red Crescent Movement\n* IDA - International Development Association\n* IEA - International Energy Agency\n* IFAD - International Fund for Agricultural Development\n* IFC - International Finance Corporation\n* IFRCS - International Federation of Red Cross and Red Crescent Societies\n* IHO - International Hydrographic Organization\n* ILO - International Labour Organization\n* IMF - International Monetary Fund\n* IMO - International Maritime Organization\n* IMSO - International Mobile Satellite Organization\n* Interpol - International Criminal Police Organization\n* IOC - International Olympic Committee\n* IOM - International Organization for Migration\n* IPU - Inter-Parliamentary Union\n* ISO - International Organization for Standardization\n* ITSO - International Telecommunications Satellite Organization\n* ITU - International Telecommunication Union\n* ITUC - International Trade Union Confederation\n* MIGA - Multilateral Investment Guarantee Agency\n* MONUSCO - United Nations Organization Stabilization Mission in the Democratic Republic of the Congo\n* NATO - North Atlantic Treaty Organization\n* NEA - Nuclear Energy Agency\n* NSG - Nuclear Suppliers Group\n* OAS - Organization of American States (observer)\n* OECD - Organisation for Economic Co-operation and Development\n* OPCW - Organisation for the Prohibition of Chemical Weapons\n* OSCE - Organization for Security and Co-operation in Europe\n* Paris Club\n* PCA - Permanent Court of Arbitration\n* PIF - Pacific Islands Forum (partner)\n* SECI - Southeast European Cooperative Initiative (observer)\n* UN - United Nations\n* UNSC - United Nations Security Council\n* UNCTAD - United Nations Conference on Trade and Development\n* UNESCO -  United Nations Educational, Scientific and Cultural Organization\n* UNFICYP - United Nations Peacekeeping Force in Cyprus\n* UNHCR - United Nations High Commissioner for Refugees\n* UNMIS - United Nations Mission in Sudan\n* UNRWA - United Nations Relief and Works Agency for Palestine Refugees in the Near East\n* UPU - Universal Postal Union\n* WCO - World Customs Organization\n* WHO - World Health Organization\n* WIPO - World Intellectual Property Organization\n* WMO - World Meteorological Organization\n* WTO - World Trade Organization\n* Zangger Committee - (also known as the Nuclear Exporters Committee)\nSee also\n* Timeline of British diplomatic history\n* Timeline of European imperialism\n* Anglophobia\n* British diaspora\n* History of the United Kingdom\n* Soft power of the United Kingdom\n* Foreign, Commonwealth and Development Office\n* Heads of United Kingdom Missions\n* List of diplomatic missions of the United Kingdom\n* European Union–United Kingdom relations\n* Latin America–United Kingdom relations\n* Accession of the United Kingdom to CPTPP\n* Free trade agreements of the United Kingdom\n* United Kingdom–Crown Dependencies Customs Union\n* International relations of Countries of the United Kingdom\n* International relations of Scotland\n* International relations of Wales\n* 2025 UK refugee plan\nReferences\nBibliography\n* Casey, Terrence. The Blair Legacy: Politics, Policy, Governance, and Foreign Affairs (2009) [https://www.amazon.com/Blair-Legacy-Politics-Governance-Foreign/dp/0230216625/  excerpt and text search]\n* Daddow, Oliver, and Jamie Gaskarth, eds. British foreign policy: the New Labour years (Palgrave, 2011)\n* Daddow, Oliver. \"Constructing a ‘great’ role for Britain in an age of austerity: Interpreting coalition foreign policy, 2010–2015.\" International Relations 29.3 (2015): 303-318.\n* Dickie, John. The New Mandarins: How British Foreign Policy Works (2004)\n* Dumbrell, John. A special relationship: Anglo-American relations from the Cold War to Iraq (2006)\n* Finlan, Alastair. Contemporary Military Strategy and the Global War on Terror: US and UK Armed Forces in Afghanistan and Iraq 2001-2012 (2014)\n* Gallagher, Julia. \"Healing the scar? Idealizing Britain in Africa, 1997–2007.\" African Affairs 108.432 (2009): 435-451 [https://www.researchgate.net/profile/Julia-Gallagher-3/publication/249289692_Healing_The_Scar_Idealizing_Britain_in_Africa_1997-2007/links/56eabf8408ae95fa33c85abf/Healing-The-Scar-Idealizing-Britain-in-Africa-1997-2007.pdf online]\n* Honeyman, V. C. \"From Liberal Interventionism to Liberal Conservatism: the short road in foreign policy from Blair to Cameron.\" British Politics (2015). [http://eprints.whiterose.ac.uk/90411/ abstract]\n* Lane, Ann. Strategy, Diplomacy and UK Foreign Policy (Palgrave Macmillan, 2010)\n* Leech, Philip, and Jamie Gaskarth. \"British Foreign Policy and the Arab Spring.\" Diplomacy & Statecraft 26#1 (2015).\n* Lunn, Jon, Vaughne Miller, Ben Smith. \"British foreign policy since 1997 - Commons Library Research Paper RP08/56\" (UK House of Commons, 2008) 123pp [http://www.parliament.uk/briefing-papers/RP08-56.pdf online]\n* Magyarics, Tamas. [https://www.e-ir.info/2019/03/13/balancing-in-central-europe-great-britain-and-hungary-in-the-1920s/ Balancing in Central Europe: Great Britain and Hungary in the 1920s]\n* Seah, Daniel. \"The CFSP as an aspect of conducting foreign relations by the United Kingdom: With Special Reference to the Treaty of Amity & Cooperation in Southeast Asia\" International Review of Law (2015)   \"[https://dx.doi.org/10.5339/irl.2015.1 online]\n* Seton-Watson, R. W. Britain in Europe (1789–1914): A Survey of Foreign Policy (1937)  [https://archive.org/download/in.ernet.dli.2015.226175/2015.226175.Britain-In.pdf online]\n* Stephens,  Philip.  Britain Alone: The Path from Suez to Brexit (2021) [https://www.amazon.com/Britain-Alone-Path-Suez-Brexit/dp/0571341772/ excerpted]\n* Whitman, Richard G. \"The calm after the storm? Foreign and security policy from Blair to Brown.\" Parliamentary Affairs 63.4 (2010): 834–848.  [https://purehost.bath.ac.uk/ws/portalfiles/portal/283584/Whitman_ParlAff_2010_63_4_834.pdf online]\n* Williams, Paul. British Foreign Policy under New Labour (2005)\nPrimary sources\n* Blair, Tony. A Journey: My Political Life (2010)\n* Howe, Geoffrey. Conflict of Loyalty (1994), memoir covers 1983 to 1989 [https://archive.org/details/conflictofloyalt0000howe/page/n5/mode/2up online]"
    }
  ]
}