{
  "content": [
    {
      "type": "text",
      "text": "# Foreign relations of the Ryukyu Kingdom__disambig_1\n\nThe foreign relations of the Ryukyu Kingdom were shaped through heavy mutual contact and trade with surrounding nations, most notably Japan and China. The influence exerted by both of these nations differ throughout each era of Ryukyuan history. To a lesser extent, other nations played a role in Ryukyuan diplomacy.\nHistory\nSanzan period\nIn 1372, a Ming official named Yang Zai traveled to Okinawa, which at the time was split among local lords. Satto, the lord of Chūzan, was successfully persuaded by Yang Zai to open formal tributary ties with the Ming dynasty. As a result of this, the Chinese court recognized Satto as a king of Ryukyu for diplomatic purposes.\nIn addition to trade with China, the Ryukyu Kingdom also traded in Southeast Asia to gain materials such as pepper and sappanwood, which weren't locally produced in the Ryukyu Islands. Areas that traded with the Ryukyuans include Siam, Java, Malacca, Sumatra, etc. Additionally, this network allowed indirect product exchange between China and Southeast Asia.\nRecords dating to the year 1390 show the aji of the Miyako Islands paying tribute to Chūzan in return for its protection, allowing for Miyakoan sailors to raid the nearby Yaeyama Islands.\nPre-Satsuma\nFollowing the unification of Okinawa Island under Chūzan in 1429, Ryūkyū as a country saw its establishment as a Shuri-centered kingdom. Tributary ties with China remained in place following this event. By the 16th century, the Ryukyu Kingdom controlled the outlying Sakishima and Amami Islands.\nThe Ryukyu Kingdom and the Satsuma Domain had soured ties over territorial disputes in the Satsunan Islands. Tokugawa Ieyasu had also asked Ryukyu to become his tribute, though to no avail. Another diplomatic quarrel occurred when the Japanese asked Ryukyu to support them in the Japanese invasions of Korea by sending supplies. Ryukyu only sent around half of what was demanded, partially due to its close ties with China, which at the time was currently fighting Japan at the Korean peninsula.\nPost-Satsuma\nIn 1609, the Satsuma Domain launched an invasion of the Ryukyu Kingdom following decades of rising tensions. This war, authorized by Tokugawa, resulted in a decisive Satsuma victory. The result forced Ryukyu to pay tribute to Satsuma while also giving up the Satsunan Islands.\nSatsuma initially promoted the introduction of Japanese culture into the Ryukyu Kingdom. This idea was later reversed due to the desire of keeping Ryukyu's appearance as an independent nation. This was done in order to appease China, which would've severed its trade with Ryukyu if it were to find out its vassalage to Japan. Common methods used to conceal Ryukyuan ties to Satsuma included a ban on Japanese cultural or physical expression. Under this loophole, Satsuma was able to profit off of Chinese trade in the region despite the lack of tributary ties between the Ming Dynasty and mainland Japan.\nFor the next 2 centuries, the Ryukyu Kingdom underwent an era of Satsuma dominance and continued tributary ties with China. Following the Meiji Restoration, the Ryukyu Kingdom was turned into the Ryukyu Domain. It was also forced to sever ties with the Qing dynasty. In 1879, the Ryukyu Domain was annexed into Japan as Okinawa Prefecture, ending the existence of an independent Ryukyuan state.\nSee also\n* Ryukyuan missions to Edo\n* History of the Ryukyu Islands\n* Ryūkyū Disposition\nReferences"
    }
  ]
}