{
  "content": [
    {
      "type": "text",
      "text": "# Forge (software)\n\n]]\nIn free and open-source software (FOSS) development communities, a forge is a web-based collaborative software platform for both developing and sharing computer applications.\nFor software developers it is an online service to host the tools they need to work and communicate with their coworkers. It provides a workflow to propose modifications and engage in discussions. The goal is to reach an agreement that will allow these modifications to be merged into the software repository.\nFor users, a forge is a repository of computer applications, a place where bugs can be reported, a channel to be informed of security issues, etc.\nThe source code itself is stored in a revision control system and linked to a wide range of services such as a code review, bug database, continuous integration, etc. When a development community forks, it duplicates the content of the forge and is then able to modify it without asking permission. A community may rely on services scattered on multiple forges: they are not necessarily hosted under the same domain.\nHistory\nThe term forge refers to a common prefix or suffix adopted by various platforms created after the example of SourceForge in 2001. This usage of the word stems from the metalworking forge, used for shaping metal parts.\nIn 2023 the two most widely used collaborative development platforms are not advertised as being forges. The GitHub tagline is \"The complete developer platform to build, scale, and deliver secure software\". The GitLab tagline is \"the most comprehensive AI-powered DevSecOps Platform\". Although they share all the technical aspects of what constitutes a forge, the documentation and marketing material does not make use of the term forges.\nHowever, in FOSS development communities and since the inception of the first SourceForge fork in 2001, the term forge is still commonly used to designate online collaborative software platforms.\nSimilar online services for developers\nSome online services do not qualify as a forge, even when they share some of its essential aspects. For instance a standalone code review service such as Gerrit is sometimes integrated in a forge that lacks integrated code review but cannot be used to distribute the software to end users.\nSimilarly, online services that focus on project management or issue tracking such as Trac, Redmine or OpenProject do not provide a workflow to be used by software developers to discuss the changes they propose and merge the outcome in the software repository. These services may include limited integration with a range of version control system, for visualization and citing code it contains, but that alone is more of a feature than a workflow a developer can use.\nTechnology\nTwo different kinds of concepts are commonly referred to by the term forge:\n* a service offered on a Web platform to host software development projects;\n* an integrated set of software elements which produce such platforms, ready for deployment.\nAll these platforms provide similar tools helpful to software developers working in the hosted projects:\n* source code management systems\n* mailing-lists or forums\n* wikis\n* download services\n* bug tracking system\nSome provide other features as well:\n* code review\nInteroperability\nAPI and webhooks\nIn addition to the web user interface, it is common for a forge to provide a REST API with a documentation (GitHub, GitLab, Gitea, etc.) to enable interoperability with other products. Forge users can also install webhooks to notify a third party online service when an event happens on their software project (for instance the webhook can be called when a new issue is created).\nFederation\nFederation and the associated protocol ActivityPub (introduced in 2018) allows forges to communicate with each other about their  activities (for instance when issues are created or a commit is pushed). Although native federation support is sometime discussed or in progress it is not yet available. Third party projects emerged to bridge the gap such as a plugin for the pagure forge or a proxy supporting ActivityPub and translating it to REST API calls to the designated forge.\nAuthentication\nThere is no SSO that applications and users could rely on to authenticate with all forges. Instead it is common for a forge to support a number of authentication providers: if a user already has an account they can use it to authenticate on the forge and do not need to create a new account (for instance GitLab supports OAuth2 providers such as GitHub). Some forges can act as an authentication provider (for instance Gitea is an OAuth2 provider as well as GitLab).\nIntegration\nTo improve the user and the system administrator experience when using multiple online services, some forges are integrated with popular third-party software and services such as online chat (for instance mattermost has a plugin for GitHub and is natively support by GitLab).\nExamples\nFree software\n* Allura\n* Forgejo\n* FusionForge\n* Gitea\n*  (GitHub compatible)\n* Gogs\n* Kallithea\n* Launchpad Suite\n* Phorge (Phabricator fork/continuation)\n* RhodeCode\n*\n* Tangled\n* Tuleap\nOpen-core software\n* GitLab (Community Edition and Enterprise Edition)\nFreemium software\n* GForge Advanced Server\nFree online services\n* Codeberg\n* OSDN (Open Source Development Network)\n* SourceForge\n* GNU Savannah\nFreemium online services\n* GitLab\n* GitHub\n* Bitbucket\n* SourceHut\nDiscontinued software\n* Phabricator\n* Savane (software)\n* GForge Community Edition (last release April 23, 2010), not to be confused with the proprietary GForge first released October 1, 2018.\nDiscontinued online services\n* BerliOS (It was disbanded in 2014, some projects have been moved to Joinup collaboration platform.)\n* CodePlex (Shut down on December 15, 2017)\n* Gitorious (deprecated, superseded by GitLab)\n* Gna.org\n* Google Code\n* Open Source Assistive Technology Software (OATS)\n* Project Kenai (created by Sun Microsystems but shut down by Oracle)\n* Tigris.org (Shut down on July 1, 2020)\nSee also\n* Collaborative development environment (CDE)\n* Project management software (PMS)\n* Software project management\n* Comparison of source-code-hosting facilities\n* List of free software project directories\n* Application lifecycle management (ALM)\nReferences"
    }
  ]
}