{
  "content": [
    {
      "type": "text",
      "text": "# Former Indian National Army Monument\n\n| removed          =\n| coordinates      =\n| location         = Esplanade Park\n| nearest_town     = Downtown Core, Singapore\n| designer         =\n| total_burials    =\n| unknowns         =\n| commemorated     =\n| by_country       =\n| by_war           =\n| inscription      = Ittehad, Ittemad, Qurbani\n| embedded         =\n| source           =\n}}\nin Singapore is now marked by a plaque erected by the National Heritage Board.]]\nThe Former Indian National Army Monument (Chinese: 印度国民军纪念碑) is a historical site and a demolished war memorial at the Esplanade Park located at Connaught Drive within the downtown of Singapore.\nHistory\nFoundation stone laying by Subhas Chandra Bose and construction\nThe monument was constructed to commemorate the \"Unknown Warrior\" of the Indian National Army (INA). The words inscribed on the war memorial were its motto, which is Unity (Ittehad), Faith (Ittemad) and Sacrifice (Qurbani). It was built during the Japanese Occupation of Singapore as the Japanese and the INA had one enemy in common, i.e., the British.\nSubhas Chandra Bose (\"Netaji\") laid the foundation stone on 8 July 1945, and the words inscribed upon the War Memorial were the motto of the INA: Unity (Etihaad), Faith (Etmad) and Sacrifice (Kurbani). The monument was then erected within a month by the Japanese in August 1945, a few months before Singapore was recaptured by the British. The memorial was designed and erected by Colonel Cyril John Stracey, 1/14th Punjab Regiment, an Anglo-Indian officer of the INA, who had volunteered to serve INA after being captured by the Japanese. The construction of the monument was proposed by Bose, the co-founder of the INA and Head of State of the Provisional Government of Free India. The INA was backed by the Japanese forces for its goal of gaining India's independence from Britain.\nDemolition by British\nLord Louis Mountbatten, the head of Southeast Asia Command, ordered the Former Indian National Army Monument to be demolished when Singapore was recaptured by the Allies in 1945. It has been suggested by some historians that Mountbatten's decision to demolish the INA memorial was part of a larger effort to prevent the spread of the nationalist ideals of the INA in the political atmosphere of the Cold War and the decolonization of Asia.\nRestoration: Erection of plaque by National Heritage Board\nIn 1995, the National Heritage Board marked the place as a historical site and subsequently with financial donations from the Indian community in Singapore, a new monument commemorating the previous one was erected on that spot.\nGallery\nINA Memorial 1945.jpg|Bose visiting the now-demolished INA Memorial at Esplanade Park during June 1945.\nPrime Minister Narendra Modi pays homage to INA martyrs at the Indian National Army Memorial Marker in Singapore.jpg|The Prime Minister of India, Narendra Modi paying homage to INA martyrs on 24 November 2015 at the present-day plaque which marks the site of former INA Memorial.\nOther INA related sites in Singapore\n; Indian National Army related\n* Cathay Building\n* Farrer Park Field\n* INA Martyrs' Memorial\n* Indian National Army in Singapore\n* INA treasure controversy\nSee also\n; Other war memorials in Singapore\n* Civilian War Memorial\n* Kranji War Memorial\n* The Cenotaph, Singapore\n; General\n* History of Singapore\n* Japanese Occupation of Singapore\n* Greater India\nReferences"
    }
  ]
}