{
  "content": [
    {
      "type": "text",
      "text": "# Forrest Howard McDonald\n\n| birth_place   = Austin, Texas\n| death_date    =\n| death_place   =\n| nationality   = American\n| other_names   =\n| occupation    = Musician\n| years_active  =\n| known_for     =\n| notable_works =\n}}\nForrest Howard McDonald (born April 22, 1950), is an American blues rock musician who has written hundreds of songs and played on many records.\nEarly life\nForrest Howard McDonald was born in Austin, Texas. He started playing the guitar at age 14. In his early 20s he studied at the Dick Grove Conservatory of music in Studio City, CA and at the Howard Roberts GIT. He is the son of Constitutional scholar Forrest McDonald. However, he does not involve himself in politics calling it spiritually draining and not good for creativity.\nCareer\nMcDonald met and was influenced by Muddy Waters in 1964.\nWhile visiting his father in Alabama, he stopped at the Muscle Shoals Sound Studios, and played the guitar solo on the Bob Seger hit \"Old Time Rock and Roll\". He was not credited for this performance on the Stranger in Town album, but was later credited on the Greatest Hits album and Ultimate Hits: Rock and Roll Never Forgets.\nHe is a three time Just Plain Folk blues award winner, and was voted “Best Southern Blues Band” 1999-2001 by Real Blues Magazine.\n''Finger Lickin' Blues'' was voted the best southern blues release by RBM in 2001.\nForrest McDonald's band plays slow blues, jump, torch, boogie, jazz and good time swing.\nMcDonald has appeared or headlined many festivals such as The Atlanta Blues Festival, The Gasparilla Festival, Spring Fest,  The River Place Arts Festival, Bay Fest, The Vallejo Jazz & Blues Fest, Sun Fest, The Carolina Blues & Seafood Festival, Bluesapalooza, The Montreaux Atlanta Festival, The Jacksonville Beach Annual Festival, The Melbourne Art Festival, The Hi-Fi Buys Amphitheater,  the King Biscuit Blues Festival and others.\nHis Certified Blue CD features his wife, vocalist Kaylon McDonald, who began singing and playing the guitar when she was 10 years old.  She won the Atlanta Female Entertainer of the year award in 1991.\nHis 15th CD, Blues in a Bucket, remained on the Charts for 5 months receiving rave reviews from Paris, Greece, to Chicago and LA.\nDiscography\n*Blues in a Bucket (2020) World Talent Records\n*Stand My Ground (2017) World Talent Records\n*Turnaround Blues (2014) World Talent Records\n*Certified Blue (2010) World Talent Records\n*A Decade Of Blues (2008) World Talent Records\n*Nothing Wrong With Dreaming (2007) World Talent Records\n*Colorblind (2004) World Talent Records\n*Fiona Boys (2003) Live in Atlanta\n*I Am Sam Soundtrack (2002) V2 Records\n*Forrest McDonald Live (2002) World Talent Records\n*Finger Lickin’ Blues (2001) World Talent Records\n*''What's It Gonna Take? (2000) World Talent Records\n*Spirit of the Blues (1999) World Talent Records\n*Under the Gun (1998) World Talent Records\n*On Fire (1997) World Talent Records\n*I Need You (1995) World Talent Records\n*Stranger in Town (1978) Bob Seger, Capitol Records\n*Roads of Life (1978) Bobby Womack, Capitol Records\n*Silver Platinum and Gold Live in LA (1977) Farr Records\n*Silver Platinum and Gold (1976) Farr Records\n*Bad Bad Woman (1975) J.D Reed and The Golden Gate Express, Infinity\n*The Righteous Rock of Roger Dollarhide (1975) Tom Cat Records\n*Wadsworth Mansion'' (1972) Budda Records\nReferences\nSources\n* MELISSA RUGGIERI TIMES-DISPATCH STAFF WRITER, Forrest and Kaylon McDonald at Capital Ale House\n* Newleyweds sing the blues by Liana Kleeman Richmond Style Paper,\n* Spirit of the Blues Reviewed By Connie Myers Fort Wayne Blues Society,[http://forrestmcdonald.com/press.htm#Fort]\n* Spirit of the Blues Reviewed By John Hathaway Natchel Blues Network,[http://forrestmcdonald.com/press.htm#Natchel]\n* World Talent Records: 42253-2 Reviewed By Wolfgang Spider Detroit Blues Society,[http://forrestmcdonald.com/press.htm#Fort]\n* Spirit of the Blues Reviewed By Blues Access Guitar-based blues at its best here on tunes like \"Anchor to a Drowning Man\" and \"Texas.\" McDonald is a really fine   guitarist in the T-Bone Walker mold, and for all you gear-heads, the liner notes detail the guitar, amp and settings for every tune. [http://forrestmcdonald.com/press.htm#Blues]\n*Spirit of the Blues Reviewed By Andy Grigg Real Blues. [http://forrestmcdonald.com/press.htm#Real]\n*Spirit of the Blues Reviewed By Rock & Blues News. [http://forrestmcdonald.com/press.htm#Rock2]\n*Finger Lickin' Blues Reviewed By Blues Revue December 2001. [http://forrestmcdonald.com/press.htm#BluesR]\n* Finger Lickin' Blues Reviewed By Blues Access December 2001. [http://forrestmcdonald.com/press.htm#Blues]\n* Whats it gonna take? Reviewed By Southwest Blues, November 2000 Extraordinary musicianship! McDonald's glowing guitar teamed with Victor's whiskey-drenched gutter voice, exceptional piano work and strong songwriting is a winning combination. Where have these guys been hiding? [http://forrestmcdonald.com/press.htm#SWB]\n* The Lilburn Courier Forrest McDonald at the Roxy Theatre, Atlanta, GA\" Reviewed By Kevin J. Moran, September 21, 2002. [http://forrestmcdonald.com/press.htm#Roxy].\n* Blues Revue Magazine Forrest McDonald ~ Live Reviewed By Michael Cote,   Feb/Mar 2003 [http://forrestmcdonald.com/press.htm#BLUESR3]\n* Songfacts: Old Time Rock & Roll [https://www.songfacts.com/facts/bob-seger/old-time-rock-and-roll]\nExternal links\n* [http://www.forrestmcdonald.com Official website]\n* [http://www.wtrhq.com wtrhq. com]"
    }
  ]
}