{
  "content": [
    {
      "type": "text",
      "text": "# Forsaking All Others\n\n| writer         = Joseph Mankiewicz (screenplay)\n| narrator       =\n| starring       = Robert MontgomeryJoan CrawfordClark Gable\n| music          = William Axt\n| cinematography = Gregg TolandGeorge J. Folsey\n| editing        = Tom Held\n| studio = Metro-Goldwyn-Mayer\n| distributor    = Loew's Inc.\n| released       =\n| runtime        = 83 minutes\n| country        = United States\n| language       = English\n| budget         = $392,000\n| gross          = $2.2 million\n}}\nForsaking All Others is a 1934 American romantic comedy drama film directed by W. S. Van Dyke, and starring Robert Montgomery, Joan Crawford and Clark Gable. The screenplay was written by Joseph L. Mankiewicz, which was based upon a 1933 play by Edward Barry Roberts and Frank Morgan Cavett starring Tallulah Bankhead.\nIn this comedy of errors, three friends of long standing are involved in a love triangle lasting many years.\nForsaking All Others is the sixth of eight cinematic collaborations between Crawford and Gable.\nPlot\nEver since Jeff Williams (Clark Gable) was a child, he has been in love with Mary Clay (Joan Crawford). Returning from Madrid, Spain, he wants to propose to her firsthand. However, he comes to a halt, as he finds out that she is being married to Dillon 'Dill' Todd (Robert Montgomery) the very next day. The three had been friends since childhood, but no one besides the butler realized Jeff's feelings. So instead, he wishes all the best for the couple.\nHowever, the next day, Dill doesn't show up to the altar, as it turns out that the night before the wedding, he ran off and married Connie Barnes (Frances Drake), a woman with whom he had had an affair in Europe some months before. Mary quickly gets out of her wedding dress and projects strength instead of fainting.\nAlthough what Dill did to Mary was terrible, she still has a soft spot for him. Jeff and Mary are invited to a party at Dill and Connie's house, and the two decide to attend in order to cause some havoc and shock the newlywed couple. While the tension between Mary and Connie is palpable, Dill is shocked to see Mary. Dill and Mary share a romantic moment outside, and Connie awkwardly walks in on them. Jeff tries to smooth the situation over, but Connie remains furious.\nLater, Dill calls Mary and Jeff finds out they intend to see each other. Mary knows she should not go, but the two go up to Aunt Paula's (Billie Burke) country house in Phoenicia, New York. The two share a romantic day, and they profess their love for each other. Dill calls his butler to tell him to pick them up tomorrow morning, but Connie overhears and sets off for Phoenicia. Aunt Paula also realizes the two are at her house, and goes there with Jeff in order to prevent the scandal from getting worse. In fact, the night previously, Dill accidentally burned himself, and the two did not sleep together.\nAs Connie arrives, Jeff and Mary pretend to be a couple, but Connie does not buy it. She wants to punish Dill for his perceived unfaithfulness, while Aunt Paula wants to avoid scandal. Connie accepts a lucrative settlement and leaves for Europe, thus leaving Dill free to marry Mary. Right before the ceremony, Jeff proclaims his love for Mary and tells her that he is leaving on a boat back to Spain. When the friend Shep (Charles Butterworth), tells her the cornflowers sent to her last wedding were from Jeff and not Dill, Mary realizes she loves Jeff instead. She breaks off her marriage with Dill and joins Jeff on the boat—when Dill arrives at the wharf, the ship has already sailed.\nCast\n* Robert Montgomery as Dillon 'Dill' Todd\n* Joan Crawford as Mary Clay\n* Clark Gable as Jeff Williams\n* Charles Butterworth as Shep (friend)\n* Billie Burke as Aunt Paula\n* Frances Drake as Connie Barnes Todd\n* Rosalind Russell as Eleanor\nProduction\nForsaking All Others was adapted from a successful Broadway play starring Tallulah Bankhead. The original play opened in New York City, New York, US on March 1, 1933 and had 110 performances. Tallulah Bankhead played Mary Clay and the cast included Ilka Chase, Barbara O'Neil, Cora Witherspoon and Fred Keating.\nThis film was Crawford's first collaboration with screenwriter Joseph L. Mankiewicz. According to TCM, the script originally was intended for Loretta Young, George Brent and Joel McCrea, but MGM decided to turn it into a Joan Crawford vehicle. Crawford reacted favorably to the script, and the two worked on a total of nine films together. He evidently understood the secret of Crawford's appeal: working-class women identified with her.\nReception\nVariety called it \"Clever and smart, packing a lot of comedy in action, situation, and dialogue....\" and commented, \"On the performance end, it is one of Miss Crawford's best.\"\nBox office\nThe film was released on December 23, 1934 nationwide. A budget of $392,000 made Forsaking All Others a rather expensive MGM production. According to MGM records, it earned $1.399 million in the US and Canada, a very considerable sum and an indication of the continuing high wide popularity of Joan Crawford with her fans. With foreign revenue of $800,000 and a cumulative total profit of $2.2 million, MGM earned a profit of $1.132 million.\nSee also\n* Joan Crawford filmography\n* Clark Gable filmography\nReferences\nExternal links\n*\n*\n*"
    }
  ]
}