{
  "content": [
    {
      "type": "text",
      "text": "# Fort Edward Johnson\n\nFort Edward Johnson was a series of Confederate States of America (CSA) military breastworks constructed in April 1862 by the four-thousand member brigade known as the \"Army of the Northwest\". The Army of the Northwest was a remnant of the Confederate Army of the Northwest which had been disbanded in February 1862. The Army of the Northwest was commanded by Colonel Edward \"Alleghany\" Johnson and had been ordered to secure a major roadway through the Appalachian Mountains known as the Staunton and Parkersburg Turnpike. Johnson ordered the construction of fortifications and breastworks at a high point along the turnpike on top of Shenandoah Mountain, which is in the U.S. state of Virginia,  west of Staunton.\nThough Colonel Johnson had been victorious at the Battle of Camp Allegheny, where Johnson had been given the nickname \"Allegheny\" and was subsequently officially promoted to General, they suffered significant losses, and other Confederate setbacks in the Western Theater of operations influenced Robert E. Lee to order Johnson to take his forces east to better protect the strategic city of Staunton, as well as the Shenandoah Valley. Johnson moved his forces  east along the Staunton and Parkersburg Turnpike and determined that the low gap along the crest of Shenandoah Mountain where the turnpike passed through would be the best location to build a defensive position to fight off any advancing Union Army forces. Starting on April 5, 1862, members of the Army of the Northwest spent the next two weeks constructing breastworks and cutting down parts of the forest along the western approaches to the fort. The fort was named after the commanding officer on April 6. General Johnson was ordered east to rendezvous with General Thomas \"Stonewall\" Jackson's army near Staunton on April 19, and the fort was abandoned to the advancing Union forces who occupied the position without a shot being fired. On May 7, 1862, Johnson's resupplied army again advanced west and retook the fort that had been abandoned by the Union forces. Johnson did not linger, by the next day his forces had left the fort and they marched westward to engage their opponents.\nFort Edward Johnson is adjacent to U.S. Route 250 at the mountain pass of the route on top of Shenandoah Mountain and is  west of Staunton, Virginia (). A  walkway leading from a parking area through the confederate breastworks provides an interpretive opportunity. The parking area also provides access to the Shenandoah Mountain Trail and Ramsey's Draft Wilderness. The remains of the fort are within George Washington and Jefferson National Forests on the border of Augusta and Highland counties, Virginia.\nReferences"
    }
  ]
}