{
  "content": [
    {
      "type": "text",
      "text": "# Fort Garry Historical Society\n\n| location = St. Norbert and Fort Garry in Winnipeg, Manitoba, Canada\n| coordinates =\n| type = non-profit historical society\n| key_holdings = Henderson House\n| director =\n| curator =\n| collections = Historic homes\n| visitors =\n| publictransit = 162 Richamond Express - St. Norbert91 St. Norbert\n| website =\n}}\nThe Fort Garry Historical Society was a non-profit organization formed in 1971 and folded in 2016. In February 2017, the Society was officially dissolved. Founded in conjunction with the 100th anniversary of Manitoba's entrance into the Canadian Confederation, its mandate was to foster the preservation of heritage sites in St. Norbert and Fort Garry in Winnipeg, Manitoba, Canada.\nThe museum is affiliated with CMA, CHIN, and Virtual Museum of Canada.\nFollowing its dissolution, the Society voted to donate its remaining funds to local schools, establishing scholarships for students pursuing studies in Canadian history, with special consideration to those focused on Fort Gary and St. Norbert's cultural heritage. Vincent Massey Collegiate, Fort Richmond Collegiate, and St. Norbert Collegiate were gifted $5,000 each, with the freedom to determine the scholarship's requirements, delegate funds, and select recipients.\nHeritage sites\nOne of historical society's primary heritage sites is the St. Norbert Provincial Heritage Park, a  park, with 14 interpretive plaques about the cultural history and development of the community. The plaques form a self-guiding tour along the La Salle and Red River, ending at the historic junction of the two rivers, which faces the floodway bridge and gates.\nResponsible for the preservation of at least three historical homes, the site features the Maison Bohémier House, Maison Turenne House, and Maison Delorme House. The Turenne and Bohémier homes are fully-restored historic house museums and feature late 19th century furnishings.\nThe houses are also known as the Fort Garry Historical Society Museum. The houses are open in the summer season.\nThe house owned by Pierre Delorme, a prominent Métis politician, is also located in the park, but has not been restored.\nHenderson House built in 1854 and originally at 2112 Henderson Highway in North Kildonan is also in the park and it was moved to a site next to the Delorme House in 1979. It has not been restored but the North East Winnipeg Historical Society has plans to restore the house and hopefully move it back to North Kildonan.\nExternal links\n*[https://web.archive.org/web/20090402172836/http://fortgarry.cimnet.ca/cim/59C188_279T14631T281T14632.dhtm Fort Garry Historical Society] - Town of Fort Garry site\n*[https://www.gov.mb.ca/conservation/parks/education/centres/st_norbert-fghsm.html St. Norbert Provincial Park] - Manitoba Conservation Department"
    }
  ]
}