{
  "content": [
    {
      "type": "text",
      "text": "# Fort Edward, New York\n\n| area_total_km2     = 70.99\n| area_land_km2      = 68.93\n| area_water_km2     = 2.06\n| area_total_sq_mi   = 27.41\n| area_land_sq_mi    = 26.62\n| area_water_sq_mi   = 0.80\n| area_water_percent =\n| elevation_footnotes =  tags-->\n| elevation_m        =\n| elevation_ft       =\n| population_as_of   = 2020\n| population_footnotes =\n| population_note    =\n| population_total   = 5991\n| population_est     =\n| pop_est_as_of      =\n| population_density_km2 = auto\n| population_density_sq_mi = auto\n| timezone1          =\n| utc_offset1        =\n| timezone1_DST      =\n| utc_offset1_DST    =\n| coordinates        =\n| postal_code_type   = ZIP code\n| postal_code        = 12828\n| area_code          = 518\n| website            = https://fortedward.net/\n| footnotes          =\n| pop_est_footnotes  =\n| blank_name         = FIPS code\n| blank_info         = 36-115-26781\n}}\nFort Edward is a town and the county seat of Washington County, New York, United States. The population was 5,991 at the 2020 census. The municipal center complex is on U.S. Route 4 between the villages of Hudson Falls and Fort Edward. When construction of the complex was completed in 1994, most of the administrative offices were moved from the original county seat of Hudson Falls to this location. The town of Fort Edward is part of the Glens Falls Metropolitan Statistical Area.\nThe town contains a village also named Fort Edward. Both are located on the western border of the county.\nHistory\nThe town is located at the \"Great Carrying Place\", a portage around the falls on the Hudson, which had been used by Native Americans for thousands of years before European colonization. It was located on the Native American \"Great War Path\", later used by French and English colonists during their own warfare, during the colonial years, especially during the eighteenth century.\nDuring the French and Indian War (1754-1763), General Phineas Lyman constructed Fort Lyman here in 1755.  In that year, Ephraim Williams, founder of Williams College, was killed in an ambush by French and Native American fighters on the road from Lake George.  It was renamed Fort Edward in 1756 by Sir William Johnson, the British Superintendent for Indian Affairs in the region, in honor of Prince Edward, the grandson of King George II.  Edward was a younger brother of the later King George III.\nThe town of Fort Edward was established in 1818 from Argyle and Greenwich. In 1849, the community of Fort Edward set itself off from the town by incorporating as a village.\nThe Fort Edward D&H Train Station, Fort Miller Reformed Church Complex, St. James Episcopal Church, Rogers Island, Old Fort House, and Wing-Northup House are listed on the National Register of Historic Places.\nNotable people\n*Jane McCrea was abducted from Fort Edward during the American Revolutionary War.\n*Solomon Northup married in Fort Edward and lived in the old fort house\n*Susan B. Anthony taught school in the community of Moses Kill, New York.\nGeography\nAccording to the United States Census Bureau, the town has a total area of 27.4&nbsp;square miles (71.0&nbsp;km2), of which 26.8&nbsp;square miles (69.4&nbsp;km2)  is land and 0.6&nbsp;square mile (1.6&nbsp;km2)  (2.19%) is water.\nThe western town line is defined by the Hudson River and is the border of Saratoga County, New York.\nU.S. Route 4 follows the course of the Hudson River along the western side of the town and joins New York Route 197 at Fort Edward village.  The Hudson River passes through the northern part of the town.\nThe site of the actual fort can be found off  Old Fort Street, just off  Rte. 4 heading south.\nDemographics\n|footnote=U.S. Decennial Census\n}}\nAt the 2000 census, there were 5,892 people, 2,248 households and 1,571 families residing in the town. The population density was . There were 2,487 housing units at an average density of . The racial makeup of the town was 98.59% White, 0.34% Black or African American, 0.24% Native American, 0.22% Asian, 0.10% from other races, and 0.51% from two or more races. Hispanic or Latino of any race were 0.53% of the population.\nThere were 2,248 households, of which 32.8% had children under the age of 18 living with them, 50.2% were married couples living together, 14.2% had a female householder with no husband present, and 30.1% were non-families. 24.5% of all households were made up of individuals, and 9.7% had someone living alone who was 65 years of age or older. The average household size was 2.52 and the average family size was 2.95.\nAge distribution was 24.4% under the age of 18, 7.6% from 18 to 24, 28.8% from 25 to 44, 22.9% from 45 to 64, and 16.3% who were 65 years of age or older. The median age was 38 years. For every 100 females, there were 93.6 males. For every 100 females age 18 and over, there were 90.7 males.\nThe median household income was $34,973, and the median family income was $41,630. Males had a median income of $31,875 versus $23,429 for females. The per capita income for the town was $17,201. About 6.5% of families and 9.9% of the population were below the poverty line, including 16.8% of those under age 18 and 3.0% of those age 65 or over.\nRail transportation\nAmtrak, the national passenger rail system, provides service to Fort Edward.  Its  Adirondack route operates daily in both directions between Montreal and New York City. The Ethan Allen Express operates daily in both directions between Burlington, Vermont, and New York City. The Amtrak stop is designated Fort Edward-Glens Falls; it also serves Hudson Falls and Fernwood.\nCommunities and locations in the town\n* Durkeetown &ndash; A hamlet on the eastern town line, located east of Fort Edward.\n* Fort Edward &ndash; A village in the northwestern part of the town.\n* Fort Edward Center &ndash; A former community located approximately two miles (3&nbsp;km) south of Fort Edward village.\n* Fort Miller &ndash; A hamlet in the southern part of the town, on Galusha Island in the Hudson River. Site of lock 6 on the Champlain Canal.\n* Old fort house - A museum added to the National register of historical places in 1983\n* Moses Kill (also \"Mock\") &ndash; A former community on the Hudson River, south of Fort Edward village, named after a stream that enters the river there.\n* Roger's Island &ndash; An island in the Hudson River adjacent to Fort Edward village. It was fortified during the French and Indian War and home to rogers rangers from 1757-1763\nReferences\nExternal links\n* [https://fortedward.net/ Town of Fort Edward]\n* [http://www.fortedward.org Fort Edward Union Free School District]\n* [http://www.fortedwardchamber.org Fort Edward Chamber of Commerce]"
    }
  ]
}