{
  "content": [
    {
      "type": "text",
      "text": "# Fort Ancient\n\n]]\nThe Fort Ancient culture is a Native American archaeological culture that dates back to . Members of the culture lived along the Ohio River valley, in an area running from modern-day Ohio and western West Virginia through to northern Kentucky and parts of southeastern Indiana. A contemporary of the neighboring Mississippian culture, Fort Ancient is considered to be a separate \"sister culture\". Mitochondrial DNA evidence collected from the area suggests that the Fort Ancient culture did not directly descend from the older Hopewell Culture.\nMaterial evidence also suggests that the Fort Ancient peoples introduced maize agriculture to Ohio, and other evidence connects this culture to the Great Serpent Mound. In 1999, an archaeological study by Brad Lepper and Tod A. Frolking used radiocarbon testing to show that the Alligator Effigy Mound in Granville also dates to the Fort Ancient era, rather than the assumed Hopewell era. Both the Serpent and Alligator Mounds, first understood as burial locations, have been shown to be Fort Ancient ceremonial effigy sites.\nName\nAlthough the name of the culture originates from the earthworks site at Fort Ancient, Ohio, this site is believed to have been built by the Ohio Hopewellian people and only occupied later by the Fort Ancient culture. The site is on a hill above the Little Miami River, close to Lebanon, Ohio. Despite the name of the site, most archaeologists do not believe that Fort Ancient was used as a fortress by either the Ohio Hopewell culture or the Fort Ancient culture. It is believed to have been a ceremonial location.\nArchaeological record\nChronology\n{| class=\"wikitable\"\n|-\n! Periods || Phase || Dates\n|-\n| Early Fort Ancient\n| Croghan\n| 1000 to 1200\n|-\n| Middle Fort Ancient\n| Manion\n| 1200 to 1400\n|-\n| rowspan=\"2\"| Late Fort Ancient\n| Gist\n| 1400 to 1550\n|-\n| Montour\n| 1550 to 1750\n|}\nIn about 1000 CE, terminal Late Woodland groups in the Middle Ohio Valley adopted maize agriculture. They settled in small, year-round, nuclear family households and settlements of up to 40-50 individuals. These scattered settlements, located along terraces that overlooked rivers and occasionally on flood plains, would be occupied only briefly before the groups would migrate elsewhere.\nBy 1200 CE, the small villages had grown into settlements of up to 300 people. These settlements were occupied for up to 25 years. The houses were designed as single-family dwellings during the Early and Middle Fort Ancient periods. Later, Fort Ancient buildings became more extensive and could house multiple families. Settlements were rarely more permanent than one or two generations, as inhabitants generally migrated once natural resources surrounding the village had been exhausted. Villages were arranged around an open oval central plaza, surrounded by circular and rectangular domestic structures facing this plaza.\nThe arrangement of buildings in Fort Ancient settlements is believed to have served as a solar calendar, marking the positions of the solstices and other significant dates. The occupants also built low platform mounds for ceremonial purposes, and many villages added defensive palisades to their boundaries. The plaza served as the focal point of village life, hosting communal activities such as ceremonies, games (such as the hoop and stick game Chunkey), and other significant social events.\nThe Late Fort Ancient period from 1400 to 1750 CE was the protohistoric era of the Middle Ohio Valley. During this era, the formerly dispersed populations began to coalesce. The Gist-phase villages (1400 to 1550 CE) became more significant than during the preceding period, with populations as high as 500. Archaeologists have speculated that the larger villages and palisades are evidence that after 1450, warfare and inter-group strife increased, leading the people to consolidate their villages for better protection.\nIncreased contact with Mississippian people also likely occurred in this era, some of them may even have migrated to and been integrated into Fort Ancient villages. The Madisonville horizon of artifacts after 1400 CE include relatively high proportions of bowls, salt pans, triangular strap handles, colanders, negative painted pottery, notched and beaded rims, and some effigies. These items and styles are usually associated with the Mississippian cultures of the Lower Ohio Valley, at sites such as Angel Mounds and Kincaid Mounds. These sites were abandoned during this time.\nDuring the Montour phase (1550 to 1700), villages were occupied year-round, although less densely in the winter than in the summer months. This may indicate that during the winter, family groups and hunting parties may have returned to the regions previously occupied by their ancestors. Such a pattern was observed during historic times, for example, among the Miami and Potawatomi. Through trading activities, the Fort Ancient people gained access to European trade items such as glass, iron, brass, and copper. These materials have all been found as grave goods at sites such as Lower Shawneetown and Hardin Village. Such artifacts appeared and were used in the area before the arrival of European explorers or settlers.\nAlthough the inhabitants of Fort Ancient did not encounter European settlers at this time, they, like other groups in the interior of the continent, may have suffered high fatalities from their diseases, transmitted among Native Americans by trade contacts. The next-known inhabitants of the area, who were encountered by French and English explorers, were the historic Shawnee tribe. Scholars believe that the Fort Ancient society, like the Mississippian cultures to the south and west, may have been severely disrupted by waves of infectious disease epidemics from the first Spanish explorers in the mid-16th century.\nAfter 1525, at the Madisonville site, the type site for the Madisonville phase, dwellings were built on a smaller scale and in fewer numbers. This change indicated the culture was less attached to agriculture and a sedentary life. Scholars generally believe that similarities in material culture, art, mythology, and Shawnee oral history link the historic tribe to the Fort Ancient people. However, there is also evidence that the Algonquian Shawnee culture may have been more of an admixture or intrusion to the site, which may have previously been Siouan occupied.\nEvolution of society\nEarly phase ( 1000–1250 CE)\nDuring this period, the Fort Ancients were several poor, sedentary societies. They lived in non-palisaded villages and had slight regional variances. The locals farmed primarily corn, beans, and sunflower—the latter being a plant first domesticated as a food source in Ohio. Most homes were what is known as a pit house, created by digging several feet into the ground and covering over the top of the resulting hole with a wooden frame roof covered in bark. Carbon dating has shown that Fort Ancient lands in West Virginia did not begin to be conquered until the middle phase.\nMiddle phase (approx. 1250–1450 CE)\n]]\nAt this time, the cultures became far richer, began to expand, and began to merge into a single, continuous culture. Villages grew larger, became palisaded and pit houses began to be phased out in favor of the style of native dwelling colonial peoples would refer to as a Cabin style. This was a rectangular, peak-roofed home of either an adobe-like or wooden make and covered over by the same style of roof as the pit house.\nElsewhere, the far richer and larger Mississippian culture began shifting its centers away from the Mississippi River and into the American Southeast. Iroquoian expansions to the northeast of the Fort Ancients brought new Algonquian and Iroquoian neighbors into their region. The result of these migrations was Fort Ancients adopting aspects of these cultures. Eastern Fort Ancients began amalgamating a mound burial with Iroquoian techniques of removing the flesh and organs of the dead and urn burials. In western Ohio, there is strong evidence that they took on the Algonquian Green Corn Ceremony, in which part of the immature corn crop was \"sacrificed\" by burning and its ashes were used to fertilize the fields. Around 1300, however, it appears that mound burials were replaced entirely by the Eastern Siouan tradition of under-the-home burials.\nLate phase (approx. 1450–1750 CE)\nThe late phase of Fort Ancient culture was its zenith. Only one known Fort Ancient tribe has been verified by name in the historical record—the Mosopelea, presumably of southeast Ohio. There is also a chance that a Siouan people called the Keyauwee, who appear alongside the Tutelo (an Eastern Siouan tribe from West Virginia) in North Carolina around 1700 could also have been of Fort Ancient stock. During the time of the French explorers, a Ho-chunk native named Tonti told them that these people had been known as the Chonque. Mosopelea language is marked as being the only known Siouan tongue to use the \"f\" sound, which is far more common among the Muskogean languages of the Mississippians.\nDespite no historical accounts of contact existing, there has been a remarkable amount of European-made goods excavated from Fort Ancient sites—including brass and steel items, as well as glassware. Fort Ancients even melted down old or broken goods and re-forged them into new items. No single gun part has yet been discovered in conjunction with a Fort Ancient site. The Fort Ancients were heavily affected by European disease, as well as the Beaver Wars period. Carbon dating seems to indicate that disease affected the Fort Ancients in waves. The most recent of all surviving sites date from Northern Kentucky alone—those from 1680 onwards. Although French explorers are known to have arrived during that time, they appear to have left no authentic accounts of contact. However, the French did note that most of both sides of the Ohio River Valley were covered in similarly styled villages in various states of destruction or abandonment.\nFour foci\nThe Fort Ancient culture is divided into four distinct local variations known as foci. These are the Madisonville focus, the Baum focus, the Fort focus, and the Anderson focus. Additionally, Fort Ancient culture can be subdivided into at least 8 phases that span different time periods and regions of southern Ohio and adjacent states. There was an increasing similarity between Fort Ancient phases leading up to 1650 CE, characterized by the presence of native artifacts and European trade goods found at the Madisonville site.\nSocial hierarchy\nfrom a Fort Ancient site in Ohio, now at the Southern Ohio Museum and Cultural Center in Portsmouth, Ohio]]\nThe rise in socio-political complexity evidenced by the building of substructure mounds and new village layouts may indicate influences from Middle Mississippian cultures down the Ohio River (the north-eastern-most extent of Middle Mississippian was the Prather Complex in the Falls of the Ohio region  away). The differences in ceramics show that Fort Ancient culture was distinct from that of the Middle Mississippian peoples, lacking Mississippian traits such as political centralization and elite social structures.\nAlthough there seem to have been positions of leadership, the Fort Ancient culture appears to have been egalitarian. Grave goods rarely vary between individuals, which shows that social levels were weakly defined. Scholars believe that their societies were organized into groups based on kinship. If social organization was based on kinship, people likely achieved some status by virtue of personal qualities, such as generosity, charisma, and being a good hunter, as well as their deeds. People of higher status were probably leaders of communities and were potentially responsible for organizing trade, settling disputes among other members of the village, and presiding over ceremonies. Evidence indicates that Fort Ancient leadership was more like that of the historic Iroquois, whose egalitarian obligations left leaders to be buried with no more than others of their age.\nCeramics\nPottery making was primarily the responsibility of women using a technique known as coiling. Potters rolled clay into long, rounded strips, which they used to model the vessel, layering strips on top of each other. The items were then smoothed out internally with a potter anvil (a smooth round stone), and externally with a wooden paddle. Cord-marking and engraving were used to decorate pots in styles according to particular periods and peoples.\nAt the time, Fort Ancient pottery was known for having thinner walls than preceding Woodland pottery. Common items include large plain cooking jars with strap or loop handles. A hallmark of Fort Ancient pottery is engraved decorations on the rim and neck of the vessels, consisting of a series of interlocking lines, called Guilloché. As this design emerged with the beginning of the Fort Ancient culture in the region, scholars used it as a characteristic to identify the culture.\nImage:Ft Ancient Pottery HRoe 2005.jpg|A small pot with guilloché designs\nFile:Fort Ancient Effigy handle Storage jar HRoe 2011.jpg|A storage pot with an unknown animal as effigy handles\nFile:Fort Ancient Storage jar HRoe 2011.jpg|A large storage jar with cord-marked decorations and strap handles\nMississippian influences\nDuring the Early Fort Ancient period, grit (crushed stone) and grog (crushed pottery) were often used as tempering agents, with ground mussel shells occasionally being used. Over time, women increasingly chose mussel shells or a mixture of mussel shells with other agents as the tempering agent. The use of ground shells as a temper is a feature often associated with Mississippian cultures, and its acceptance spread in Fort Ancient culture, moving north and east from the Ohio River and the direction of the closest Mississippian groups in the southwest.\nWith the change of temper, different vessel forms and decorations became more prevalent; several of them are also strongly associated with Mississippian cultures. Early Fort Ancient vessels were often jug forms with lug handles. By the Middle Fort Ancient period, bowls and plates were being produced more frequently, and artisans added strap handles. Negative painting (a decoration often associated with the Angel phase sites in the Lower Ohio Valley) and Ramey Incised designs (elite motifs associated with the Cahokia polity in Illinois) have been found on some pots. Others show a blending of different styles, for instance, with the engraved guilloché decoration overlaid with negative painting. Archaeological excavations have found examples of non-local pottery from this period as well. The pieces were made from non-local clay sources, and have designs or vessel forms atypical for local wares. A head pot was discovered at the Madisonville site similar to those produced in the Central Mississippi Valley by the peoples of the Middle Mississippian Parkin and Nodena phases. Archaeologists suggest that the change in pottery styles was a result of increased contact with the Mississippian cultures to the south and west of the Fort Ancient peoples.\nTools\n.]]\nThe Fort Ancient peoples made tools from a variety of materials, including stone, bone, horn, shells and antlers. Stone tools have been found more frequently than those of other materials. The culture is known for its distinctive small triangular flint arrowheads and large triangular flint knives. Fort Ancients made hoes for farming from mussel shells. Fort Ancients had also grounded and polished stones into axes to use in felling trees. Most of the flint tools were made from varieties of locally available materials, showing the Fort Ancient peoples either felt no need for it or did not have access to exotic stone varieties through trade routes.\nDiet\nThe Fort Ancient were primarily a farming and hunting people. Their diet was mainly composed of the New World staples that are known as the three sisters (maize, squash, and beans). This diet was supplemented by hunting and fishing in nearby forests and rivers. Important game species included the black bear, turkey, white tail deer and elk. Archaeologists have found evidence at some sites which suggests that turkeys were kept in pens. The average lifespan during this time period decreased from that of their ancestors. The people were smaller in stature and less able to fend off infectious diseases than previous generations. Archaeological investigations of their cemeteries have shown that almost all of Fort Ancient's people showed pathology of some kind, with a high incidence of dental disease and arthritis.\nSites\n{|class=\"wikitable sortable\" style=\"width:98%\"\n!  width=\"18%\"|Site\n!  width=\"13%\"|Image\n!  width=\"69%\"|Description\n|-\n|Bentley site\n|\n|A Madisonville horizon (post 1400) archaeological site overlain by an 18th-century Shawnee village located near South Portsmouth in Greenup County, Kentucky.\n|-\n| Buckner site\n||\n|| A Middle Fort Ancient site located in Bourbon County, Kentucky on Strodes Creek. It has two large circular village areas, each surrounding its central plaza and several smaller special use areas to the north and northeast of the site.\n|-\n| Buffalo Indian Village Site\n||\n|| A site with at least two overlapping Mid to Late Fort Ancient villages (1300 to 1600) located near Buffalo, Putnam County, West Virginia along the Kanawha River.\n|-\n| Cleek–McCabe site\n||\n|| A Middle Fort Ancient site located near Walton in Boone County, Kentucky with several components, including two mounds and a village.\n|-\n| Clover site\n||\n|| A Late Fort Ancient Madisonville focus site (the type site for the Clover phase 1550 to 1600) located near Lesage in Cabell County, West Virginia.\n|-\n| Feurt Mounds and Village Site\n||\n|| A site with three burial mounds and an associated village, located in Scioto County, Ohio. It is the type site for the Feurt focus.\n|-\n| Fort Ancient Site\n||\n|| The site is the largest prehistoric hilltop enclosure in the United States with walls spanning three and one-half miles (18,000&nbsp;ft) in a  complex, built by the Hopewell peoples, who lived in the area from the 1st century BCE to the 6th century CE. Centuries later, during the Fort Ancient period, a village and cemetery were constructed within the embankments. When archaeologists excavated the site in the nineteenth century, they mistakenly believed that the \"fort\" and the village were built by the same people. It is located in Washington Township, Warren County, Ohio, along the eastern shore of the Little Miami River about  southeast of Lebanon on State Route 350.\n|-\n| Fox Farm site\n||\n|| A Manion phase site located near Mays Lick in Mason County, Kentucky. The site consists of a large village complex on a ridge  south of the Licking River and  south of the Ohio River. The site covers  and has midden areas up to  thick.\n|-\n| Hardin Village site\n||\n|| A Montour phase site located on a terrace of the Ohio River near South Shore in Greenup County, Kentucky. It was occupied from sometime in the early 1500s and abandoned by about 1625. During its occupation, it covered an area of about . Like other Fort Ancient villages, it had a defensive palisade surrounding it, but unlike other sites it does not seem to have had a central oval plaza.\n|-\n| Hobson site\n||\n||  Located  below Middleport, Ohio on the north bank of the Ohio River. It has minor traces of Archaic, Woodland and Late Prehistoric artifacts. However, the largest component is a village of the Feurt Phase dating to 1100 to 1200 CE.\n|-\n| Leo Petroglyph\n||\n|| A sandstone petroglyph containing 37 images of humans and animals as well as footprints of each, located near the small village of Leo, Ohio in Jackson County, Ohio.\n|-\n| Madisonville site\n||\n|| A Fort Ancient Site located on the banks of the Little Miami River in Mariemont, Ohio. The site includes an effigy mound and the remains of a village.\n|-\n| Ronald Watson Gravel site\n||\n|| A Middle Fort Ancient Anderson focus site located near Petersburg in Boone County, Kentucky, on an inside bend of a meander of the Ohio River.\n|-\n| Sand Ridge Site\n||\n|| A Madisonville focus site located along a prominent ridgeline to the west of the old Union Bridge along the road between Cincinnati and Batavia.\n|-\n| Serpent Mound\n||\n|| The Fort Ancient people built the largest effigy mound in the United States according to carbon dating of charcoal found underneath the mound.\n|-\n|State Line Site\n|\n|A Middle Fort Ancient complex of sites west of Elizabethtown, Ohio on both sides of the Indiana/Ohio border, composed of five contributing properties spread out across  of land. Pottery found at the site was found to use shell tempering and had other characteristics such as distinctive styles of painting and the presence of pottery modelled after owls and the human heads, traits which signify contact with Middle Mississippian cultures.\n|-\n| Sunwatch Indian Village\n||\n|| A recreated Fort Ancient village located in Dayton, Ohio. Many archaeological excavations were done here at the park which has revealed much about the Fort Ancient people.\n|-\n| Thompson site\n||\n|| A Croghan phase site located near South Portsmouth, Kentucky in Greenup County, next to the Ohio River across from the mouth of the Scioto River.\n|-\n| Turpin site\n||\n|| An Early Fort Ancient Madisonville focus site located near Newtown in Hamilton County, Ohio. The site includes the remains of a village and multiple burial mounds.\n|-\n|}\nContemporaries and neighbors\nTo the northeast in present-day Western Pennsylvania, Eastern Ohio and West Virginia were the peoples of the Monongahela culture, who inhabited the Monongahela River Valley from 1050 to 1635. They had a similar lifestyle to the Fort Ancients; as they were also maize agriculturalists and lived in well laid out palisaded villages with central oval plazas, some of which consisted of as many as 50-100 structures. To the northwest of the Fort Ancients were the people of the Oliver phase who lived along the east and west forks of the White River in central and southern Indiana from 1200 and 1450. Their villages were also circular with palisades. Although their sites began in central Indiana, over the years they spread to the southeast toward the Fort Ancients. The Oliver phase people were part of the Western Basin Tradition which also includes the Springwell's phase, the Younge phase, and the Riviere au Vase phases of Northern Ohio and Indiana. The colder weather of the Little Ice Age may have caused inter-group battles over food and other resources, according to some scholars. The crops did not prosper as well during this colder period, causing food shortages for populations that had grown after their introduction. Some studies show that the culture began failing due to poor health conditions.\nThese groups, along with others such as the Oneota, were once classified as Upper Mississippian cultures under the assumption that they were either Mississippian peoples intruding into these areas, or they were heavily influenced by the Mississippian peoples to their south and east. Today it is thought that these groups were local in situ developments of Late Woodland peoples.\nLocated  down the Ohio River to the southwest of the westernmost Fort Ancient settlements were the Middle Mississippian culture peoples of the Prather Complex. This stretch of river was an empty buffer zone, possibly for social or political reasons, although it might possibly have been because the narrowing of the alluvial valley between the Falls of the Ohio region near Louisville, Kentucky and the mouth of the Miami River at Cincinnati, Ohio made it less suitable for the intensive maize agriculture practiced by both societies.\nPossible symbolism\nMany artifacts have been found associated with the Fort Ancients, the most common being four-handled funerary urns, salamanders and snakes. Possible symbolism of the urn may be a connection to common Siouan religious beliefs. At least one artifact containing the Siouan religious symbol known as the medicine wheel (a cross inside of a circle) has been found. This stands, primarily, for the fact that all life sprung from the same place and returns to that source in the end. The four-handled urns may be to evoke that symbol, more so than having any real, practical use.\nTwo possibilities of the salamander motif can also be explored. One possibility is that, like in Plains Indian culture, salamanders represented boys and turtles represented girls. Mothers would have a special medicine pouch made for one or the other to represent their children and containing the umbilical cord, which they would wear so long as both still lived. The other possibility comes from the Eastern Siouan's, who express a belief that \"when a Salamander barks, someone will soon die.\" As such, the salamander may have been a sort of death omen to the Fort Ancients or had something to do with the door between the living and dead worlds.\nThe Serpent Burial Mound was made specifically to mirror a constellation known to many Siouan peoples, known as the Snake. It is depicted as swallowing an egg whole, representing the struggle against overwhelming odds for the sake of the people. Furthermore, some Siouan peoples seem to have believed that the stars seen at night were a mirror of the spirit world itself, each one representing an ancestor at peace. Therefore, this mound may have been a special place to bury those with special honors, in order to anchor such people and their descendants to the earth. This symbolic connection to the Snake constellation suggests that this mound may have been especially significant to the Fort Ancients.\nReferences\nBibliography\n* Koch, Felix J. (1882–1933): A Visit to Fort Ancient, Ohio Archaeological and Historical Society Publications: Volume 20 [1911], pp.&nbsp;248–252.\nExternal links\n*[http://www.fortancient.org/ Official Fort Ancient Website]\n*[http://www.ancientohiotrail.com/?q=ftancient_temp Fort Ancient, Ancient Ohio Trail]\n*[http://www.ancientohiotrail.com/?q=timeline Earthworks Timeline, Ancient Ohio Trail]\n*[https://whc.unesco.org/en/tentativelists/5243/ Hopewell Ceremonial Earthworks UNESCO World Heritage Nomination]\n*[https://web.archive.org/web/20060209044156/http://www.ohiohistoryteachers.org/03/04/sw03.shtml Ohio History Teachers' page on Fort Ancient]\n*[https://web.archive.org/web/20060619233507/http://www.mnsu.edu/emuseum/prehistory/northamerica/culture/plains/fort_ancient.html Fort Ancient Culture]\n*[http://www.sunwatch.org/ SunWatch - a restored Fort Ancient village]\n*[http://ohsweb.ohiohistory.org/gallery2/main.php?g2_itemId=783 Fort Ancient Culture] , Virtual First Ohioans\n*\n*"
    }
  ]
}