{
  "content": [
    {
      "type": "text",
      "text": "# Forward Guernsey\n\n| logo = Logo of the Forward Guernsey.png\n| abbreviation = FG\n| leader = Gavin St Pier\n| founded =\n| headquarters = Guernsey\n| predecessor = Future Guernsey\n| ideology =\n| position =\n| colours =\n| website =\n| seats1_title = States of Guernsey\n| seats1 = }}\n| country = Guernsey\n}}\nForward Guernsey is a political party in Guernsey launched on 11 April 2025. The party was created as an electoral vehicle to contest the 2025 Guernsey general election, adopting the manifesto developed by the separate Future Guernsey policy movement \"in its entirety\".\nForward Guernsey candidates are expected to vote the same way on the manifesto's six key policy areas: housing, health, education, the economy, public finances and climate change. On all other issues falling outside of the manifesto, candidates are able to vote independently.\nBackground and formation\nRelationship with Future Guernsey\nForward Guernsey was created to address legal limitations faced by Future Guernsey, a policy movement launched by Gavin St Pier in November 2024. Future Guernsey, as an unregistered political movement, was prohibited by electoral law from endorsing or supporting candidates in elections.\nTo circumvent this restriction, St Pier and four other individuals formed Forward Guernsey as a separate registered political party. The new party adopted Future Guernsey's comprehensive manifesto without modification, effectively transferring the policy development work to an electoral vehicle that could legally contest elections.\nSt Pier resigned his role as Political Adviser to Future Guernsey upon launching Forward Guernsey, stating: \"It has been necessary to form a separate party for one simple reason: Future Guernsey is not permitted by its constitution or electoral law to endorse and support candidates.\"\nPolitical precedent\nThe relationship between Future Guernsey and Forward Guernsey represents an unusual structure in Guernsey politics, where a policy development organisation operates separately from its electoral wing. This arrangement has been described as a response to the \"endemic inertia and indecision\" that St Pier believes results from having independent deputies with individual agendas.\nHistory\nFormation and early development\nForward Guernsey's formation was first hinted at in October 2024 when Gavin St Pier confirmed he was working on forming a new political organisation. The groundwork involved extensive policy development through the Future Guernsey movement, which conducted research showing that only 13% of islanders believed the current political system was working effectively.\nThe party was officially launched on 11 April 2025 with four founding candidates. Unlike St Pier's previous political ventures, none of his former colleagues from the Guernsey Partnership of Independents joined the new party, with many choosing to stand as independent candidates instead.\nElectoral structure\nCandidate selection\nForward Guernsey employs a three-stage candidate selection process:\nStage 1: Completion of application and vetting forms\nStage 2: Candidates are interviewed by an independent panel, which makes a recommendation to the party committee\nStage: The committee makes a final decision on candidate admission\nParty discipline\nForward Guernsey candidates commit to voting together on manifesto policies but retain independence on other issues. This structure aims to provide policy coherence while maintaining some individual autonomy for elected deputies.\n2025 election campaign\nCandidates\nForward Guernsey fielded six candidates for the 2025 Guernsey general election:\n* Gavin St Pier (party leader)\n* Tom Rylatt\n* Rhona Humphreys\n* Dicky Parmar\n* Sofi Noakes\n* Stuart Jehan\nCampaign themes\nThe party's campaign emphasizes the need for policy-based governance over personality-driven politics. St Pier has criticized the current system as \"systemically dysfunctional\" due to having \"38 individual deputies with 38 individual agendas\".\nForward Guernsey positions itself as offering \"a different approach\" to governance, promising accountability through its manifesto commitments and arguing that independent candidates historically \"failed to deliver or reneged on their promises\".\nSee also\n* Future Guernsey\n* Gavin St Pier\n* Guernsey Partnership of Independents\n* Politics of Guernsey\n* 2025 Guernsey general election\nReferences\nExternal links\n* [https://web.archive.org/web/20210613104521/https://guernseypartnership.gg/ Website of the Guernsey Partnership of Independents (archived)]"
    }
  ]
}