{
  "content": [
    {
      "type": "text",
      "text": "# Forward Wales\n\n| colorcode = red\n| logo = Forward Wales logo\n| leader = John Marek\n| chairman = Ron Davies (policy director)\n| foundation = 8 November 2003\n| dissolution = 2010\n| ideology = SocialismWelsh devolution\n| position = Left-wing\n| international =\n| european =\n| europarl =\n| colours = Red and White\n| headquarters =\n| website = None\n}}\nForward Wales () was a socialist political party operating in Wales. It evolved from the John Marek Independent Party (JMIP), formed by the ex-Labour member of the Welsh Assembly, John Marek who was the party's national convenor.\nOn 8 November 2003, the JMIP decided to rename itself Forward Wales. The party sought to advance socialist policies for Wales as an alternative to what it perceived as a Labour Party which had moved away from socialism.\nForward Wales had recruited various existing politicians disillusioned with their current parties such as:\n*Ron Davies, a former Secretary of State for Wales under the Labour Party;\n*Graeme Beard, a former Plaid Cymru councillor in Caerphilly;\n*Klaus Armstrong-Braun, a former Green Party councillor on Flintshire County Council.\nPrinciples\nThe party listed its principles as being:\nFor a democratic socialist Wales:\n#All people of Wales regardless of ethnic origin, creed, gender or sexual orientation are equal citizens and Forward Wales will represent all without favour or discrimination and based on these founding principles.\n#Wales should enjoy parity with Scotland within the current constitutional arrangements in the UK and should enjoy no fewer powers than any other of the UK nations or regions should any further devolution arrangements be enacted.\n#The UK is a rich state but has unacceptable variations in wealth and opportunity between its peoples and regions. We seek to reduce those variations and wish to secure for Wales levels of public spending that accurately reflect the relative levels of economic prosperity and social provision between Wales and other parts of the UK.\n#We are committed to open and pluralist politics and will co operate with other political parties in Wales, the UK and Europe where common causes exist.\n#We will support and take part in international movements designed to secure peace, freedom, international co-operation for sustainable world development and social justice.\n#Recognising the quality of modern economic and social life depends on public services, we are committed to the maintenance of such services within the public realm.\n#Understanding that healthy politics requires robust debate, party members shall at all times be respectful, tolerant and considerate to others.\n#We defend the civil rights of all language communities. Understanding the value, importance, but threatened status, of the Welsh language, we support special measures throughout Wales and especially in vulnerable core areas to nurture the language and build sustainable communities on which it ultimately depends.\n#As a democratic party we encourage local participation, with the aim of creating self-reliant and sustainable communities equipped to take maximum decisions on their own behalf as the basis for a socialist society.\n#Sustainability is the most fundamental of all principles. We do not believe anyone has the right to act in a way which diminishes the life chances of future generations and so the long-term consequences shall guide our policies in all that we seek to do.\nThe party was strongly pro-devolution but opposed notions of Welsh independence.\nHistory and results\nAt the European election in 2004, they polled 17,280 votes, 1.9% of the Welsh total. In the 2007 National Assembly for Wales election, Marek and Davies, while both remaining part of the Forward Wales leadership, stood as independents, but neither was elected and no-one stood as a Forward Wales candidate leaving the party without representation in the National Assembly. Abortive talks were also held with Blaenau Gwent People's Voice Group.\nForward Wales contested the 2004 Wrexham County Borough Council election in which they won one seat, closely missing out on a second, and received 11.7% of the votes in the election. David Bithell was elected for the Johnstown ward for Forward Wales, but would later become an independent who is still elected to Wrexham County Borough Council as of the 2022 Wrexham County Borough Council election.\nAlwyn Humphreys unsuccessfully contested Clwyd South for Forward Wales in the 2005 UK General Election where he received 2.4% of the vote share.\nIt was announced in January 2010 that Forward Wales would not renew its registration with the electoral commission and the party was disbanded. Marek subsequently joined the Conservative Party in March 2010. Ron Davies unsuccessfully stood as the Plaid Cymru candidate in Caerphilly during the 2011 Welsh Assembly elections.\nReferences\nExternal links\n*"
    }
  ]
}