{
  "content": [
    {
      "type": "text",
      "text": "# Forward Operating Base Kalsu\n\n-->\n| gridref =\n| image_map =\n| image_mapsize =\n| image_map_alt =\n| image_map_caption =\n| pushpin_map =\n| pushpin_mapsize =\n| pushpin_map_alt =\n| pushpin_map_caption = Shown within Iraq\n| pushpin_relief =\n| pushpin_image =\n| pushpin_label = FOB Kalsu\n| pushpin_label_position =\n| pushpin_mark =\n| pushpin_marksize =\n| ownership = Ministry of Defence\n| operator = United States Army\n| controlledby =\n| open_to_public =\n| site_other_label =\n| site_other =\n| site_area =\n| code =\n| built =\n| used = 2003–\n| builder =\n| materials =\n| height =\n| length =\n| fate =\n| condition =\n| battles = Iraq War\n| events =\n| current_commander =\n| past_commanders =\n| garrison =\n| occupants =\n| designations =\n| website =\n| footnotes =\n| IATA =\n| ICAO =\n| FAA =\n| TC =\n| LID =\n| GPS =\n| WMO =\n| elevation =\n| r1-number =\n| r1-length =\n| r1-surface =\n| h1-number =\n| h1-length =\n| h1-surface =\n| airfield_other_label =\n| airfield_other =\n}}\nForward Operating Base Kalsu, also known as 'FOB Kalsu', COS Kalsu or simply Camp Kalsu, was a U.S. Military installation in Northern Babil Province , Iraq, 20 miles south of Baghdad. It was officially closed by members of the 1st Brigade Combat Team, 1st Cavalry Division, on December 12, 2011 as part of the US Army's withdrawal from Iraq.\nHistory\nFOB Kalsu was established in May 2003 by the New York Army National Guard unit the 105th Military Police (MP) Company, 104th Military Police Battalion, 53rd Troop Command based in Buffalo, NY. It was named in honor of Buffalo Bills and the University of Oklahoma All-American football player Bob Kalsu who was killed serving in the Vietnam War. The 105th and 300th MP companies were supported by elements of the Oregon Army National Guard's 1st Battalion, 162nd Infantry Regiment, 41st Infantry Brigade Combat Team and Bravo Company, 1092nd Engineer Combat Battalion, WV ARNG from August to November 2003.\nSubsequent deployments\nAfter Operation Iraqi Freedom 1 (OIF1), FOB Kalsu was occupied by Company A, 1st Battalion, 152nd Infantry Regiment, Indiana Army National Guard from October 2003 to January 2004 acting as a quick reaction force (QRF) for Main Supply Route (MSR) Tampa and conducting combat patrols.\nThe base was then occupied by B Co, 2-505th Infantry Regiment, 82nd Airborne Division from January 2004 to May 2004 effectively conducting combat patrols and acting as the QRF for MSR Tampa.\nIt was then occupied by the 118th MP CO (ABN), 16th MP BDE (ABN) along with the attached A CO 1-185th Armor Regiment (Provisional Infantry), and the Mortar & Scout platoons of HHC 1-185th Armor, 81st Heavy Brigade Combat Team of the California Army National Guard from March 2004 to February 2005 conducting combat patrols and acting as a QRF for MSR Tampa. On May 25, 2004, Specialist Daniel P. Unger, Specialist Alan N. Bean Jr., and Sgt. Kevin F. Sheehan, were killed, along with numerous others wounded, during what some have described as one of the worst mortar attacks in the history of the war up until that time. The new dining facility later built at FOB Kalsu was named \"Unger Hall\" in honor of Specialist Unger, who put the lives of several Iraqi workers he was guarding ahead of his own to ensure they were safely inside the bunker during the main attack, and was posthumously awarded the Bronze Star Medal with Valor for his heroism.\nIn July 2004 the 24th Marine Expeditionary Unit (MEU), 1st Marine Division, assumed command of FOB Kalsu using it as a command post for operations in the Anbar Province and the areas south of Baghdad to northern part of Babil and then subsequently the assault on Fallujah in November 2004. One month after the Marines took over command of FOB Kalsu the mortar and rocket attacks dramatically decreased. In February 2005 155th Heavy Brigade Combat Team of the Mississippi Army National Guard assumed command through January 2006. 2nd Squadron, 11th Armored Cavalry Regiment from FT Irwin, Ca, was attached to the 155th HBCT during this period. In November 2005 the 155th was visited by Mississippi Governor Haley Barbour.\nFrom November 2005 to November 2006, FOB Kalsu was occupied by 2nd Brigade Combat Team, 4th Infantry Division (United States). Units of 2BCT/4ID that occupied FOB Kalsu included 2nd Battalion 8th Infantry Regiment, 2nd Special Troops Battalion, and 2nd Brigade Headquarters Company. Prior to the end of the deployment 2nd BCT's 3rd Battalion, 16th Field Artillery Regiment and 204th Brigade Support Battalion had also moved to FOB Kalsu.\nSecond Lieutenant Emily Perez was stationed at FOB Kalsu in September 2006 when, while leading a convoy conducting re-supply operations in the vicinity of Al-Najaf, her HMMWV hit an IED, making her the first female West Point graduate to be killed in Iraq. The COS Troop Medical Clinic was named in her honor.\nFrom October 2006 to December 2007, FOB Kalsu was occupied by the 4th Brigade Combat Team (Airborne), 25th Infantry Division headquartered at Fort Richardson in Anchorage, Alaska.\nIn October 2007, the 4th BCT of the 3rd Infantry Division took control of the FOB. In December 2008, the Vanguard Brigade transferred authority to the 172nd Infantry Brigade Combat Team (Blackhawk Brigade) headquartered at Grafenwoehr, Germany.\nFrom September 2009 to September 2010, COS Kalsu was manned by elements of 3HBCT (Heavy Brigade Combat Team), 3rd Infantry Division.\nFrom September 23, 2010, and continuing until August 2011, COS Kalsu was occupied by the 3rd Armored Cavalry Regiment, as well as their subordinate units, 1st Squadron 3rd Armored Cavalry Regiment (Tiger Squadron) and Regimental Support Squadron (Muleskinner Squadron) in support of Operation New Dawn.\nIn July 2011 the 2nd Battalion, 5th Cavalry Regiment (2-5 CAV) and the 115th Brigade Support Battalion of the 1st Brigade Combat Team, 1st Cavalry Division replaced 3rd Armored Cavalry Regiment in support of Operation New Dawn.\nTurnover in 2011\nIn December 2011, COS Kalsu was officially transferred to the care of the Iraqi Army as U.S. forces of the 2nd Battalion, 5th Cavalry Regiment, and 115th BSB, 1st Brigade Combat Team, 1st Cavalry Division closed down FOB Kalsu.\nOn 19 April 2024, an explosion occurred at Kalsu base, killing one fighter and wounding six others.\nSee also\n* Triangle of Death (Iraq)\n* List of United States Military installations in Iraq\nReferences"
    }
  ]
}