{
  "content": [
    {
      "type": "text",
      "text": "# Forward observers in the U.S. military\n\nForward observers in the U.S. military are artillery observers who carry the Military Occupational Specialty designator of 13F in the United States Army and  0861 in the United States Marine Corps. They are officially called \"joint fire support specialists\" in the U.S. Army and \"fire support marines\" in the U.S. Marine Corps. They are colloquially known as \"FiSTers\", regardless of whether they are members of a FiST (fire support team). A battalion fire support officer (FSO) is the officer in charge of a battalion fire support element.\nU.S. Army\nForward observers in the U.S. Army hold the Military Occupational Specialty of 13F for enlisted and 13A for officers designating them as members of the field artillery corps. After completion of basic combat training, enlisted soldiers attend an eleven-week course (AIT) on the fundamentals of call-for-fire techniques as well as general field craft and small unit tactics at Fort Sill, Oklahoma. From there those being assigned to airborne units, most notably the 82nd Airborne Division, 173rd Airborne Brigade, and 75th Ranger Regiment will attend the United States Army Airborne School after the completion of training at Fort Sill. Additionally, Ranger School is open to both enlisted and officers serving as forward observers. Members of forward observer teams are required to attain and maintain a secret security clearance due to the requirement for forward observers to be aware of not only the mission of their own unit but of other U.S. and allied units in the same operating area. Officers are referred to as \"fire support officers\" (FSO) while enlisted troops hold the title of forward observers.\nOnce training is complete members are assigned to a forward observer platoon generally part of a headquarters and headquarters company inside a larger infantry, cavalry, armor, or artillery battalion. Observer teams are expected to be able to move, communicate, interact and carry out missions as members of these units with a high level of proficiency in addition to their responsibilities as forward observers. Observers must be able to work independently for long periods of time and, because the clandestine nature of their work and their frequent placement on or behind enemy lines, the ability to operate with minimal support is of great importance as some missions can often last for days or weeks.\nCurrently three methods of directing artillery fire are taught in the U.S. Army. The first and most common is called a \"grid mission\", where artillery fire is directed based on the map grid coordinate of the target based on a standard map. The second is \"shift from known point\" where artillery based on his direction and distance from a fixed, pre-established geographic or man-made point. The third and least common is \"polar\", where the observer gives their current grid location and provides distance and direction to the target. This is typically unpopular due to the FDC confusing the observer's location as the target.\nCombat observation lasing teams (COLTs) are a sub-specialization within the Army's 13F career field which train in the directing of long-range fire such as rocket-assisted artillery or GPS guided munitions like the 155&nbsp;mm Excalibur series weaponry. They have a secondary spotting-reconnaissance capability and are trained to operate with other unconventional forces such as sniper and scout teams for long periods of time with minimal support.\nSince 2003 the U.S. Army has also used the RQ-7B Shadow unmanned aircraft, flown by soldiers in the 15W MOS, in Iraq and Afghanistan for artillery correction, close air support and reconnaissance.\nWith the need for coordinated indirect-fire support control at higher levels, fire support specialists are also assigned to the \"fire support element\", at the battalion level, and as the \"fires\" section of the operations staff from brigade or regiment level through to the corps level.\nField artillery forward observer 1189\nField artillery forward observer 1189 was a World War II Army officer position. Officer classification, commissioned and warrant military classification and coding.\nThe primary duties of the 1189 was to \"direct the fire of an artillery unit from a forward position. Observes shell bursts and adjusts fire by forward observation or computation methods; consults with commanders of supported unit in determination of appropriate artillery targets, normal barrage, and zones of defense; trains personnel in procedures of artillery operation; organizes observation posts; sets up and maintains communication systems.\"\nU.S. Marine Corps\nThe requirements for USMC observers are nearly identical to their Army counterparts. They attend training at Fort Sill, are required to obtain a secret security clearance, and are generally assigned as specialist members of larger combat units or specialized units like Air Naval Gunfire Liaison Company.  Both the Army and USMC observers may be certified as joint fires observers (JFOs) which allows them to assist the joint terminal attack controller in conducting aerial strikes.\nU.S. Navy\nThe U.S. Navy has a small corps of Naval gunfire liaison officers trained to provide observation and correction of naval gunfire in support of Army and Marine Corps ground units during amphibious and coastal operations. As early as 1921 the United States Marine Corps identified naval gunfire as one of the six key elements for amphibious operations. The trajectory of high velocity naval artillery was significantly different from field artillery howitzers typically used for gunfire support. Infantry officers were surprised by the inability of flat trajectory naval guns to hit targets behind low hills; and the relatively wide distribution of fall of shot along the axis of fire sometimes endangered friendly troops behind or in front of the target. Shells intended to penetrate armored ships produced a relatively small damage radius against unfortified targets; and shipboard observation devices designed to observe shell splashes at sea were unable to determine whether their shells were striking intended shore targets.\nAlthough Marine Corps officers who have served aboard warships are more familiar with naval artillery, Army officers without such experience are often in positions requiring gunfire support during amphibious landings. Naval officers familiar with shipboard guns are able to advise infantry officers ashore concerning the capabilities of naval artillery to engage specific targets. The naval officer's familiarity with shipboard communications systems enables him to translate the infantry objectives and fall of shot observations to the appropriate shipboard personnel for effective engagement of targets. The tentative manual of 1934 became Fleet Training Publication 167 in 1938; and the Army issued a field manual with virtually identical text in 1941. The use of naval gunfire support reached its peak during WWII with the numerous amphibious landings, to include a small number who completed the Army's elite Airborne School and parachuted into Normandy to provide gun fire support for paratroopers during the D-Day landings.\nIn the modern age NGLOs are assigned to a marine artillery battalion or marine artillery regiment to assist in providing naval gunfire support.  When deploying as part of a marine expeditionary unit, the NGLO is typically attached to the operations section (S-3) of the ground combat element and is responsible for a shore fire control party consisting of RT operators and forward observers.\nWhile NGLOs are trained to spot naval gunfire, their primary responsibilities are in the fire support coordination center, to plan and coordinate naval gunfire with other firing agencies (artillery, close air support, and mortars) in conjunction with the fire support coordinator and fire support team leaders, and advise him on its employment. NGLOs can also be assigned to air naval gunfire liaison companies (ANGLICO), or the various marine expeditionary force or division headquarters staff.\nSpecific training consists of the Naval Gunfire Liaison Officer Course, a five-week resident course taught in Coronado, California. NGLOs assigned to ANGLICO units may receive further training as JTACs at the discretion of the assigned unit and are jump qualified.\nU.S. Air Force\nAlthough the U.S. Air Force has no formal forward observer training of its own, members of the special tactics community are generally required to have a basic familiarity with techniques of call for fire and artillery spotting in addition to their normal duties. The closest thing the Air Force has to forward observers are Joint Terminal Attack Controllers (JTACs), who are specialized in calling in air support; and TACPs, who may or may not be JTAC-certified, and typically embed within both conventional and special operations units from the Army.\nJoint fires observer\nThe joint fires observer (JFO) course is a two-week course which provides select personnel from all branches of the military with standardized training to engage targets with joint fires through the detailed integration with TACs and fire support teams (FSTs). Students who graduate this course will be able to request, control, and adjust mortar, field artillery, and naval gunfire support; provide targeting information for A-10, AC-130, and other close air support (CAS) aircraft, terminal guidance operations, initial terminal guidance operations, SOF gunship call for fire, close combat attack and joint fire-support planning at the company level. Additionally, a JFO is trained in controlling multiple ground and air based fire-support assets at the same time, ensuring the different assets are deconflicted by time, lateral or vertical space, or a combination of the two tactics.\nJFOs in the Army and Marine Corps are typically officers or enlisted forward observers or special operations personnel who are awarded the L7 additional skill identifier. The first certifying JFO course was established at Nellis Air Force Base in 2004. It was then moved to Fort Sill in 2006, and also Einsiedlerhof, Germany, at the Warrior Preparation Center. The Marines have also established their own JFO course in Quantico, Virginia.\nThe JFO course consists of seven graded simulations with numerous fire missions and CAS missions. In these simulations the trainee conducts mortar, artillery, naval, attack aviation and special operations call for fire missions, and CAS with JTAC or FAC(A), using night-vision devices, laser guided bombs, JDAMs, Hellfire missiles, rockets, with laser designators or just a map, protractor and compass.\nNotable U.S. military forward observers\n* George P. Hays, Medal of Honor recipient\n* John R. Fox, Medal of Honor recipient (posthumous)\n* Forrest E. Peden, Medal of Honor recipient (posthumous)\n* James E. Robinson Jr., Medal of Honor recipient (posthumous)\n* Ronald E. Rosser, Medal of Honor recipient\n* Lee R. Hartell, Medal of Honor recipient (posthumous)\n* Harold Bascom Durham Jr., Medal of Honor recipient (posthumous)\n* Paul H. Foster, Medal of Honor recipient (posthumous)\n* Brian Miles Thacker, Medal of Honor recipient\n* Jared C. Monti, Medal of Honor recipient (posthumous)\n* Ryan M. Pitts, Medal of Honor recipient\n* Maynard James Keenan, lead singer of American rock band Tool\n* Craig Morgan, country music singer\n* Luke Thomas, MMA journalist\n* Lombardo Boyar, film and television actor\n* Mel Brooks, actor, comedian, composer, and filmmaker\n* John A. Chapman, United States Air Force Combat Controller, Medal of Honor recipient (posthumous)\nPodcasts\n*[https://youtube.com/@formeractionguys?si=dbKE-QZhKJw60Tf- Former Action Guys Podcast]\n*Forward observers in Vietnam\nNotes\nReferences\n*U.S. Army FM 6-30\n*U.S. Army FM 21-18 Procedures and Techniques of Foot Marches\n*U.S. Army ATP 3-09.30"
    }
  ]
}