{
  "content": [
    {
      "type": "text",
      "text": "# Forward Movement\n\nForward Movement is the name taken by a number of Christian Protestant movements in the United Kingdom, United States, Canada and other countries. The movement emphasised holiness. It generally promoted a form of \"practical Christianity\" that responded to issues such as poverty and social decline not only through preaching, but also through acts of service and efforts toward broader reform. Hugh Price Hughes, a leading figure in the movement, encouraged a renewed vision for the Methodist Church—one that was more engaged with society, attentive to social concerns, and actively involved in the everyday lives of the working class.\nUnited Kingdom and British Empire\nThe term \"Forward Movement\" is said to have been used for the first time in the mid-1880s, at an informal gathering, by Mrs Maria McArthur, the wife of Alexander McArthur, an Irish-born Methodist businessman and politician who at the time lived in Brixton, London. The expression was quickly adopted more widely, with the encouragement of the Methodist leader, William Fiddian Moulton, and in 1891 a Welsh minister, John Pugh, and his friend Seth Joshua took the initiative in Wales by erecting a tent in Splott, Cardiff, as a way of starting a new Calvinistic Methodist church. It was acknowledged, however, that the origins of the movement went back as far as the 1870s. It was also closely associated with the \"Holiness movement\" and the work of American evangelical leader Robert Pearsall Smith.\nAnother Welsh minister, Hugh Price Hughes, became the unofficial leader of the \"Forward Movement\" in the British Methodist denominations. The movement encouraged the building of Methodist Central Halls as social work centres as well as meeting-places. Hughes founded the Methodist Times in 1885, and the movement became closely associated with Liberal politics in the UK.\nNew Zealand\nIn a mission tour of New Zealand and Australia in 1891, the Cornish Methodist Rev. Mark Guy Pearse brought stories of the West London Mission to Methodist churches there. He was met with great enthusiasm, and the New Zealand Railway Commissioners gave him a free pass over all the railways of the colony.\nRev. Pearse was a popular storyteller, but he did not hesitate to offend those women who were in the throes of an eminently successful suffrage movement. In July 1891 he declared in Sydney Australia that women were \"a waste product whose chief use is to dispense afternoon tea.\"\nThe New Zealand version of the Forward Movement gained its footing in 1893 with the help of Australians. Rev. H. W. Horwill lectured in Dunedin in June 1893 about the meaning of the movement, and - knowing his audience - emphasized the rights of women, including their right to Church leadership positions, public speaking, publishing in newspapers and social reform. The Movement came to life first in Wellington with two Congregational ministers, the Reverends William A. Evans and G. H. Bradbury. Evans resigned from his parsonage in Nelson and Bradbury from his in Canterbury to move to Wellington. Evans had recently married the university graduate and suffragist Kate Edger whose ideas strongly influenced the Movement and drew other progressive thinkers such as Ernest Beaglehole; Lily May Kirk and her future husband Arthur Atkinson; and Maurice Richmond, later professor of law at Victoria University College. They held their first meeting on 27 August 1893, and began organising public lectures and classes on history, literature, philosophy, civics and economics. Their work was well received, and by 1895 they had begun publishing The Citizen. Some examples of the contents were described in an advertisement notice in the (Wellington) Evening Star in February 1896:\n:We have received through Wise and Co., the local agents, the November and December numbers of ' The Citizen,' the organ of the Forward movement in Wellington. In the earlier number Sir Robert Stout discusses the banking legislation of the last two sessions; Mr A. R. Atkinson concludes his criticism of Carlyle's ' Sartor Resartus.' In the last number the Rev. W. A. Evans deals with the 'Social Ideal'; Mr A. S Menteath has a powerful reply to the fiscal heresies of Mr Skoch, of Wellington; and Lady Stout defines the position of the New Woman in certain walks—political and otherwise—where she can make for the uplifting of the race without losing any of the virtues that adorn true womanhood.\nDuring a Congregational Union convention in Wellington in early 1896 the ministers revised their Articles of Constitution to give \"members working in mission stations or in forward movement missions\" the same standing as pastors of regular congregations. The Forward Movement caught on in other churches, including the Wesleyan Methodists, the Primitive Methodists, and the Baptists.\nWith the rise of Lily May Kirk Atkinson (now married) to the national presidency of the Women's Christian Temperance Union of New Zealand, the return of Rev. Evans to the Congregational ministry in 1904, and the Supreme Court justice Sir Robert Stout becoming chancellor at the University of New Zealand, the Forward Movement in New Zealand began to lose its most ardent voices.\nWales\nThe movement continued into the 20th century, with Martyn Lloyd-Jones becoming a notable leader in Wales. Abandoning his Harley Street medical practice in 1927, Dr Lloyd-Jones became minister of Bethlehem Evangelical Church in Port Talbot, originally built as an outlying mission of a Calvinistic Methodist Church in the town centre. This church remains open.\nUnited States\nThe current Forward Movement in the United States is a ministry of the Episcopal Church in the United States, whose mission is to reinvigorate the life of the church. Since 1935, Forward Movement has published the quarterly devotional Forward Day by Day, as well as books and pamphlets that foster spiritual growth and encourage discipleship. As a self-sustaining agency of the church, Forward Movement relies on sales and donations to carry out its work.\nHistory\nForward Movement was created during a time when the Episcopal Church seemed weary and divided. The 51st General Convention in 1934 charged the newly chartered Forward Movement to “reinvigorate the life of the church and to rehabilitate its general, diocesan and parochial work.” Bishop Henry Hobson of Southern Ohio chaired the Forward Movement Commission, which consisted of five bishops, five priests, and ten laymen. Although the National Council gave a small subsidy during its first three years, Forward Movement soon became a self-supporting ministry, largely through literature sales.\nBy the 1937 General Convention, Forward Movement had produced twenty-five tracts and booklets in addition to Forward Day by Day. All this was achieved through mostly volunteer labor, with the Diocese of Southern Ohio providing office space and support staff. The 1937 General Convention sought to integrate Forward Movement into the larger church by naming the new presiding bishop, Rt. Rev. Henry St. George Tucker of Virginia, as chair of the Forward Movement Commission, although Bishop Hobson continued to oversee operations in Cincinnati until 1976 (even after his retirement as bishop in 1969).\nGilbert Symons became the Forward Movement's first editor and held the post until 1950. He wrote many of the early issues of Forward Day by Day, in addition to dozens of other titles. The Diocese of Southern Ohio paid Symons's salary, though he devoted nearly all his time to Forward Movement. The diocese also provided rent-free office space (though expenses were shared) in downtown Cincinnati (although for a time circa 2004 the Forward Movement's ministries used space outside downtown, it again has offices within diocesan headquarters).\nBy 1940, Bishops Tucker and Hobson felt the National Council could assume many of Forward Movement's ministries. At the General Convention of that year, therefore, the Forward Movement Commission was not discharged. But Forward Movement's success as a publisher led Tucker to ask that the executive committee continue publishing literature for the church. To indicate the ministry's nature more clearly, the name was changed in 1949 to Forward Movement Publications.\nDay by Day\nForward Movement's first publication was Forward Day by Day, a quarterly devotional magazine which has been published continuously since 1935. Circulation is now 300,000 printed copies per quarter, 84 percent of which is within The Episcopal Church, the rest going to other provinces of the Anglican Communion, primarily to the Anglican Church of Canada. In total, Forward Movement has subscribers in 68 nations. More than 100,000 copies of Forward Day by Day are distributed each year, at no charge, to prisons, jails, hospitals, convalescent homes, juvenile detention centers, and overseas military bases.\nForward Movement today\nForward Movement publishes more than one hundred other titles, mostly pamphlets and booklets, on prayer, discipleship, worship, sacraments, Anglican history and spirituality, and pastoral concerns. Roughly thirty new print titles are issued each year. Distribution is through an online bookstore, parish churches, and an annual catalog. Several titles are published in Spanish. Some current titles are available on the Amazon Kindle and Barnes & Noble Book stores, as well as other popular locations.\nForward Movement's offices are located in downtown Cincinnati, Ohio, and have been since the company's inception. Executive Director Scott Gunn oversees a staff of eight full-time and eight part-time employees.\nReferences"
    }
  ]
}