{
  "content": [
    {
      "type": "text",
      "text": "# Fourth Battle of Komárom\n\n|combatant2=\n|commander1=\n|commander2=\n|strength1=Total: 19,124 men, 292 cannons - II. corps: 9,564 men (8,561 infantry, 1,003 cavalry), 28 cannons - VIII. corps: 7,560 men, 20 cannons - Sappers: 800 men - The artillery of the fortress: 1,200 men, 244 cannons\n|strength2=Total: 13,841 men, 62 cannons - Pott brigade: 3,239 men, 6 cannons - Colloredo division: 10,602 men, 56 cannons\n|casualties1=Total: 224 men -30 July: 3 dead, 11 wounded -3 August: 80 dead, 130 wounded\n|casualties2=Total: 799 (1,000)/ 2,000 men, 21 cannons-30 July: 22 dead, 32 wounded, 165 missing and captured -3 August: 195 dead, 97 wounded, 507 missing and captured\n|}}\nThe Fourth Battle of Komárom was fought in 30 July and 3 August 1849 between the Hungarian garrison of the fortress of Komárom led by General György Klapka and the besieging Austrian army led by Lieutenant field marshal Anton Freiherr Csorich von Monte Creto. Thanks to the capturing, by a Hungarian detachment of Hussars, of a statement containing the number of the besieging Austrian II. corps, Klapka understood, that he actually has numerical superiority over the besiegers. So in two sorties made on 30 July and 3 August he managed to crush their siege on the northern, then also on the southern section of the fortress, chasing them towards West, and causing them heavy losses. Thanks to this victory Klapka liberated the region between Komárom and Győr, planning to attack Austria, when he learned about the surrender of the Hungarian main troops from 13 August, and as result of this, he retreated with his troops in Komárom.\nBackground\nWhen, after the battle of Komárom from 11 July, on 12–13 July the Hungarian Army of the Northern Danube led by General Artúr Görgei's departed from Komárom towards Vác, in the fortress remained around 18,300 soldiers.\nThe Hungarian troops stationing in Komárom were the II. and the VIII. corps, their commander being the 29 years old Major General György Klapka. After the departure of Görgei's troops, on 13 July Klapka organized the units which remained in Komárom as it follows. The two corps were organized in 5 infantry and one cavalry division, the division leaders being for the VIII. corps: Col. Móric Kosztolányi, Col. count Pál Esterházy, Col. Pál Janik; for the II. corps: Lieutenant Colonel Samu Rakovszky, Lieutenant Colonel Pál Horváth and Lieutenant Colonel Ignác Mándy as the commander of the cavalry division. The commander was Major General György Klapka. The command post was led by Colonel Ferenc Ascherman as the commander of the fortress, the chief of staff was Colonel Péter Szillányi, while the main aide-de-camp was Lieutenant Colonel János Prágay, Lieutenant colonel Sándor Mednyánszky and Major Latinovics were aide-de-camps and orderly officers, Lieutenant colonel Karl Jungwirth was the commander of the artillery of the fortress, Lieutenant colonel Zsigmond Thaly the director of the fortification works of the fortress, and Lieutenant colonel Szabó the camp commander. And the government commissioner László Újházi represented the Hungarian government. On 14 July the Austrian troops encircled the fortress, closing the Hungarians inside it. From that day nobody from the fortress and the town was allowed to leave it without permission, and the soldiers and the inhabitants had to content themselves with a daily food ration.\nKlapka's duty was, with an active defence, to tie down as many enemy troops as possible, keeping them away, as long as possible, from participating in Field Marshal Julius Jacob von Haynau's main armies campaign in the main theatre of war. For 10 days Klapka managed to fulfill this mission, keeping two Austrian corps with 28 000 soldiers and 114 cannons under the fortress, but on 23 July Haynau ordered to General Franz Schlik to march with the I. corps to Pest, so the siege armies number dropped to less than its half. The cause of the I. corps departure was probably the fact that the defenders did not shown enough activity, and did not made enough sorties and attack against the besiegers, which made Haynau to think that only half of the besieging troops are enough to station under Komárom. In this respect we can say that the defenders did not fulfilled their task to tie down the enemy.\nThe Austrian siege corps led by Lieutenant field marshal Anton Freiherr Csorich von Monte Creto, was composed by 3 brigades, led by Major General Baron Joseph Johann Nepomuk Freiherr von Barco, Major General Karl Liebler von Asselt and Lieutenant General Gustav Ritter von Pott. In total the Austrian siege corps was composed by 16 infantry battalions, 6 cavalry companies and 75 cannons (from these 18 were long range 18-pounder guns). Csorich's chief of staff was Lieutenant Colonel Franz Jungbauer, his chief of artillery being Major Bahr, and Lieutenant General Franz de Paula Gundackar II. Fürst von Colloredo-Mannsfeld was the commander of the division which contained the aforementioned three brigades. The Barco-brigade occupied the line between the Herkály grange (Puszta-Herkály), through the Ács forest to the Danube and the Monostor wineyards from Monostor, its detachments holding the Csém grange, Mocsa and Dunaalmás. The Liebler brigade took positions in Csallóköz, massing soldiers in Csallóközaranyos, Keszegfalva, and the bridgehead from Nagylél. Pott's brigade was positioned on the left bank of the Vág river, its detachments holding Martos, Ógyalla and Bagota, sending outposts to  Puszta-Káva, Puszta-Konkoly, Csuzi and Halom-szeg, stretching them later to Hetény, Kurtakeszi and Marcelháza. In order to strengthen their position the Austrians dug from the Herkály grange (Puszta-Herkály), through the Ács forest to the Danube 7 big ramparts with several trenches, barricading the edge of the Ács forest with cut trees. In Csallóköz in order to strengthen the position from the bridgehead from Nagylél and the position from Csallóközaranyos, the Austrians built 6 defence works, and they dug a trench between Csallóközaranyos and Dudva. The same happened also on the left bank of the Vág river, where Pott, seeing that the river Zsitva's water got so down, that, in the case of an attack, the Hungarians could cross it easily, ordered his soldiers to build barricades and parapets at Halomszeg and Konkoly, strengthening also Komáromszentpéter.\nThe reduction of the number of the enemy army was sensed by the defenders after two days.\nPrelude\nKlapka learned that the Austrians stockpiled a large amount of food supplies at Tata, so he decided to attack the garrison from there. On 25 July Klapka sent a detachment against Mocsa, to divert the attention of the Austrians from his main purpose: the attack against Tata. The detachment of the defenders which attacked Tata consisted of two battalions of infantry, a cavalry company and a half battery of cannons, led by Colonel Kosztolányi. The surprise attack with the help of the people from the nearby villages was a full success: they took all the garrison from Tata prisoners, together with a major, three captains and a lieutenant. The loot was substantial: a large amount of food, several wagons, many horses, the pharmacy of the Austrian army, and the Vienna stagecoach, filled with money and a document which showed the number and positioning of the Austrian troops around Komárom. Thanks to this Klapka learned that the besiegers are less than the garrison of the fortress, and that the Austrians think that the Hungarian defenders are much less than they were in reality, thinking that the soldiers of Klapka are only around 8000. On the stagecoach they found a so-called Black book, which contained the list of the Hungarians whom the Austrians planned to capture and execute. From the captured money Klapka paid extra military compensation for two days for all his soldiers.\nFrom the captured documents Klapka understood that he has a chance to defeat the besiegers in detail, and crush the siege. So Klapka decided to crush the siege with a large scale sortie. His job was eased also by the fact that the Danube split the Austrian siege corps into two which, because of this, could not help each other in the case of an attack, and the Vág river which flows in the Danube from the North, added a similar obstacle for the Austrian troops from the Northern shore. Klapka wanted to chase away first the Austrian units from the northern (left) shore of the Danube. There stationed the weaker enemy units, and with the attack against them he hoped to create the false feeling in the Austrians that the Hungarian army wants to continue its operations on the Northern shore of the Danube.\nOpposing forces\nCommander in chief: General György Klapka;\nCommander of the Fortress: Colonel Ferenc Aschermann;\n133 infantry companies, 11\tcavalry companies, 292 cannons,\t19,124 soldiers.\n{| class=\"wikitable\"\n! width=20% | Corps\n! width=20% | Division\n! width=35% | Unit\n! width=5% | Infantry company\n! width=5% | Cavalry company\n! width=5% | Saddled horse\n! width=5% | Traction horse\n! width=5% | Cannon\n! width=5% | Number\n|-\n| rowspan=5 |\nII. Corps\n&nbsp;&nbsp;\nColonel József Kászonyi\n|\nRakovszky infantry division\n&nbsp;\nLieutenant colonel Samu Rakovzsky\n|\n* 25. Honvéd battalion\n* 48. Honvéd battalion\n* 52. Honvéd battalion\n* 56. Honvéd battalion\n* 1 battalion of the \"Dom Miguel\" infantry regiment\n| 30\n| -\n| -\n| -\n| -\n| 3643\n|-\n|\nHorváth infantry division\n&nbsp;\nLieutenant colonel Pál Horváth\n|\n* 49. Honvéd battalion\n* 54. Honvéd battalion\n* 60. Honvéd battalion\n* 61. Honvéd battalion\n* 63. Honvéd battalion\n| 30\n| -\n| -\n| -\n| -\n| 4358\n|-\n|\nMándy cavalry division\n&nbsp;\nLieutenant Colonel Ignác Mándy\n|\n* 6 companies of the \"Württemberg\" Hussar regiment\n* 2 companies of the \"Bocskay\" Hussar regiment\n| -\n| 8\n| 1023\n| -\n| -\n| 1003\n|-\n|\nArtillery\n|\n* 1 six-pounder infantry battery\n* 1 six-pounder infantry battery\n* 1 three-pounder infantry battery\n| -\n| -\n| 44\n| 313\n| 28\n| 560\n|-\n| Total\n|\n| 60\n| 8\n| 1067\n| 313\n| 28\n| 9564\n|-\n| rowspan=6 |\nVIII. Corps\n&nbsp;&nbsp;\nColonel Ferenc Aschermann\n|\nKosztolányi infantry division\n&nbsp;\nColonel Móric Kosztolányi\n|\n* 18. Honvéd battalion\n* 37. Honvéd battalion\n* 64. Honvéd battalion\n* 3. battalion of the \"Alexander\" infantry regiment\n| 24\n| -\n| -\n| -\n| -\n| ?\n|-\n|\nJanik infantry division\n&nbsp;\nColonel János Janik\n|\n* 46. Honvéd battalion\n* 57. Honvéd battalion\n* 70. Honvéd battalion\n* 71. Honvéd battalion\n| 20\n| -\n| -\n| -\n| -\n| ?\n|-\n|\nEsterházy infantry division\n&nbsp;\nColonel Pál Esterházy\n|\n* 5. Honvéd battalion\n* 40. Honvéd battalion\n* 98. Honvéd battalion\n* 99. Honvéd battalion\n| 22\n| -\n| -\n| -\n| -\n| ?\n|-\n|\nCavalry\n|\n* 3 companies of the \"Lehel\" Hussar regiment\n| -\n| 3\n| -\n| -\n| -\n| ?\n|-\n|\nArtillery\n|\n* 1 three-pounder infantry battery\n| -\n| -\n| -\n| -\n| 20\n| ?\n|-\n| Total\n|\n| 66\n| 3\n| ?\n| ?\n| 20\n| 7560\n|-\n| rowspan=3 |\nArmy-adjacent units\n|\nSappers\n|\n* sapper companies\n| 7\n| -\n| -\n| -\n| -\n| 800\n|-\n|\nCavalry\n|\n* 1 company of the Cuman hussars\n| -\n| 1\n| -\n| -\n| -\n| ?\n|-\n|\nFortress artillery\n|\n* 1 three-pounder infantry battery\n| -\n| -\n| -\n| -\n| 244\n| 1200\n|-\n| Grand total\n|\n|\n| 133\n| 11\n| 1400\n| 313+?\n| 292\n| 19,124\n|}\nCommander in chief: Lieutenant General Anton Csorich;\nChief of staff: Lieutenant Colonel Franz Jungbauer;\n93 infantry companies, 6 cavalry companies, 62 cannons,\t13,841 soldiers.\n{| class=\"wikitable\"\n! width=15% | Corps\n! width=15% | Division\n! width=15% | Brigade\n! width=40% | Unit\n! width=5% | Infantry company\n! width=5% | Cavalry company\n! width=5% | Horse\n! width=5% | Cannon\n! width=5% | Number\n|-\n| rowspan=\"12\" |\nII. Corps\n&nbsp;&nbsp;\nLieutenant General Anton Csorich\n| rowspan=\"8\" |\nColloredo division\n&nbsp;\nLieutenant General Franz Colloredo Mannsfeld\n| rowspan=\"4\" |\nBarco brigade\n&nbsp;\nMajor General Joseph Barco\n|\n* 1. battalion of the \"Mazzuchelli\" infantry regiment\n* 2. battalion of the \"Mazzuchelli\" infantry regiment\n* 3. battalion of the \"Mazzuchelli\" infantry regiment\n* 3. battalion of the \"Baugartner\" infantry regiment\n* Landwehr battalion of the \"Baugartner\" infantry regiment\n* 4. Otočac battalion\n| 42\n| -\n| -\n| -\n| ?\n|-\n|\n* Civalart uhlans\n| -\n| 3\n| 788\n| -\n| ?\n|-\n|\n* 3. six-pounder infantry battery\n* 3. twelve-pounder infantry battery\n* 4. twelve-pounder infantry battery\n* 12. cavalry battery\n| -\n| -\n| -\n| 26\n| ?\n|-\n| Total\n| 42\n| 3\n| 788\n| 26\n| 6447\n|-\n| rowspan=\"4\" |\nLiebler brigade\n&nbsp;\nMajor General Karl Liebler\n|\n* 1. battalion of the \"Archduke Stephen\" infantry regiment\n* 2. battalion of the \"Archduke Stephen\" infantry regiment\n* 3. battalion of the \"Archduke Stephen\" infantry regiment\n* Landwehr battalion of the \"Archduke Stephen\" infantry regiment\n* 2. battalion of the \"Wimpfen\" infantry regiment\n| 23\n| -\n| -\n| -\n| ?\n|-\n|\n* Civalart uhlans\n| -\n| 1\n| 284\n| -\n| ?\n|-\n|\n* 3 ½ six-pounder battery\n* eighteen-pounder battery\n* cavalry battery\n| -\n| -\n| -\n| 30\n| ?\n|-\n| Total\n| 23\n| 1\n| 284\n| 30\n| 4155\n|-\n| rowspan=\"4\" |\n| rowspan=\"4\" |\nPott independent brigade\nMajor General Gustav Pott\n|\n* 4. battalion of the \"Deutschmeister\" infantry regiment\n* 3. battalion of the \"Koudelka\" infantry regiment\n* 3. battalion of the \"Fürstenwärther\" infantry regiment\n* 3. battalion of the \"Haynau\" infantry regiment\n* 4. battalion of the \"Haynau\" infantry regiment\n| 28\n| -\n| -\n| -\n| ?\n|-\n|\n* Civalart uhlans\n| -\n| 2\n| 264\n| -\n| ?\n|-\n|\n* 11. six-pounder battery\n| -\n| -\n| -\n| 6\n| ?\n|-\n| Total\n| 28\n| 2\n| 264\n| 6\n| 3239\n|-\n| Grand total\n|\n|\n|\n| 93\n| 6\n| 1336\n| 62\n| 13,841\n|}\nBattle\n30 July\nThe attack against the Austrian troops from the northern shore of the Danube began on the night from 29 to 30 July. Colonel Rakovszky crossed the Zsitva river with 3 battalions of infantry, 6 cannons and two companies of Hussars at 2 a.m., chasing away the Austrian garrison from there, advancing towards Komáromszentpéter. At 5 a.m. Colonel Móric Kosztolányi attacked with 3 battalions of infantry, 6 cannons and two companies of Hussars  the enemy positioned at Hetény, pushing them back, then Lieutenant General Pott led his retreating troops on the heights between Komáromszentpéter and Bagota, where he tried to resist until his two battalions of infantry, one platoon of uhlans and one gun, detached to Marcelháza and Kurtakeszi, will join him. But Kosztolányi's troops pression was so hard that Pott could not withstand, and also Bátori-Sulcz's reserve column of 3 battalions, 1 hussar company and 6 cannons appeared in the distance, so he retreated further back, where finally his two detachments he waited for arrived and joined him, so Pott retreated so far as Bajcs. Here the Austrian lieutenant general, in order to cover his troops retreat over the Zsitva river, ordered his rearguard, made of 3 infantry, 1 cavalry companies and 6 cannons to occupy the woods from Bajcs, where they held for an hour the advance of the Hungarians, then they too retreated after they dismantled the bridge.\nKosztolányi's attack was so unstoppable that the Austrians retreated before the two battalions of Rakovszky sent towards Izsa to encircle Pott's brigade from the left  arrived, so they could retreat behind the Zsitva river. If Kosztolányi would have waited for a while with his attack, all the soldiers of the Pott brigade would have become prisoners.\nIn the meanwhile, Bátori-Sulcz's reserve column chased out the Austrian garrison from Halomszeg, pushing them back to Martos, then through Puszta-Káva to Kőszegfalva, while its detachment chased the Austrian units from Puszta-Konkoly and Csuzi to Bagota, from where they continued their retreat through Naszvad until they joined Pott's brigade. Despite the fact that they managed to escape, Pott's soldiers suffered important losses: Báthori-Sulcz occupied Ógyalla, and his Bocskay Hussars and artillery killed and wounded many Austrians fleeing from Kosztolányi's troops on the road to Érsekújvár. The hussars returned with 150 prisoners and a wagon. At the end of this action, Kosztolányi's and Rakovszky's columns met at Komáromszentpéter, as it was planned.\nIn order to conceal the attack towards the northeast, Lieutenant colonel Horváth at 3 a.m. was sent with 2 battalions of infantry, 1 hussar company and 6 cannons towards northwest to make a feint attack against the Austrian garrison from Csallóközaranyos, but they were so successful that the enemy retreated to Puszta-Pál, where they received important reinforcements, repulsing the Hungarian attack. At 11 a.m. Horváth, whose job was only to make a diversion attack, retreated with 60 captured oxen, losing 3 dead and 11 wounded soldiers.\nThe result of this action was that on 30 July the Hungarians broke the Austrian siege against Komárom on the northern shore of the Danube river. On 31 July the Hungarian troops which participated in the attack remained in the positions which they occupied: Kosztolányi in around Bajcs and Bagota, Bátori-Sulcz in Ógyalla, and Rakovszky at Komáromszentpéter.\n31 July - 2 August\nThe troops which participated in this action, stayed in their positions, occupied on the left banks of the Danube. On the night from 31 July to 1 August a Hungarian detachment made an attack towards Surány, forcing Pott to retreat from Érsekújvár to Tardoskedd, while an other detachment attacked by surprise the Austrian sappers who wanted to take away the elements of the bridge from Kőszegfalva, which they dismantled a day before, putting them in disorder. and with  returned to Komárom at 1 and 2 August. Only after that Pott returned with his brigade to Érsekújvár.\nFrom the informations he gathered from the captured correspondence of the Austrians and the letter to tzar Nicholas I of Russia by the Russian Major General Berg, assigned to the Austrian general headquarters, Klapka understood that Haynau marched with his troops from Pest towards Szeged, and now he wanted to ease the pressure of the Austrians on the Hungarian Army of the South by an attack on the right bank of the Danube against the besieging Austrian forces. The tactical plan for this attack was elaborated by Klapka and his chief of staff Péter Szillányi.\nThe defeating of the Austrian troops from the southern (right) shore of the Danube was a more difficult task, than those from the northern (left) bank. Here too Klapka planned a pincer movement. 3 battalions, one battery and one hussar squadron, had to attack in two columns led by Colonel Kosztolányi and Major József Krivácsy, and occupy Mocsa. East to them was the stronger Hungarian column (4 infantry battalions, 2 squadrons of hussars and two batteries) under the leadership of Colonel Ferenc Ascherman, which before the start of the planned action, it was augmented with another battalion, and organized in two columns: the attacking column was led by Colonel Rakovszky, while the second column under the leadership of Major Antal Brunszvik was in reserve. The troops under Ascherman were the most battle hardened units of Klapka's troops: in Rakovzsky's attacking column were assigned the Dom Miguel (1. battalion of the 39. infantry regiment), the 48. and the 25. battalions, Major Brunszvik was leading the 108. and the 56. Honvéd battalions, the cavalry was represented by riders of the 6. Würtemberg Hussar regiment, and the artillerists were experienced cannoners as well under the command of Major Mihály Mezey. Ascherman's battalions first had to march towards East alongside the Danube's stream, and after chasing away from there the Austrian garrison of several companies from Dunaalmás, Ascherman had to hold for a while at the Tömörd grange (southeast from Mocsa), and wait for the result of the attack against Mocsa, then with a huge roundabout to southwest-south-northwest, bypassing Mocsa and Csém, they had to seize the military bridge from Lovad, and the heights near it. This bridge connected the southern and northern shores of the Danube, and if it was captured, all the Austrian troops from the right bank of the Danube would have had to surrender.\nIn the Center Colonel Bódog Bátori-Sulcz with two infantry battalions and two batteries had to demonstrate before the Herkály grange, until the troops of Kosztolányi's and Krivácsy's bypassing column occupied Csém and arrived there. After that with joined forces they had to attack Herkály, the Ács forest, then, crossing the Concó creek, the Ács village.\nOn the right wing the two infantry battalions and one battery led by Colonel János Janik had to execute diverting actions in front of the Ács forest, in order to tie down the Austrian troops, which had built strong defensive positions and trenches here, to send help to their comrades defending Csém and the Herkály grange,  and only after these were occupied by Kosztolányi's and Bátori-Sulcz's columns, together with them to attack, from several directions, the Ács forest.\nIn the entrenched camp from Komárom all the battalions left two of their companies as garrison.\nBefore Klapka's decisive attack on the right (southern) shore of the Danube, Major General Barco had the following troops at his disposal:\n- On the left wing the Meggyfa (Cherry) Woods from the shore of the Danube was held by the 3. battalion of the Mazzuchelli regiment;\n- On the center the section of the Ács forest eastwards from the country road, and the hill right to the Herkály grange was controlled by the Landwehr battalion of the Baugartner regiment. In the 7 trenches dug in this section were positioned two 18 and eight 12-pounder guns, two Civalart Uhlan platoons were used as outposts, while 5 other uhlan platoons were with a half cavalry battery guarded Herkály;\n- Behind the Ács forest as reserves stood the 1. and 2. battalions of the Mazzuchelli regiment with four 12-pounder cannons, three companies from them being in the Ács village, to guard the ammunition dump.;\n- the Csém grange was held by a half company, while in Mocsa stationed three companies of infantry and a platoon of uhlans;\n- Dunaalmás was guarded by the 3 infantry companies, 1 cavalry company and a half cavalry battery led by Major Sternfeld.\n3 August\nThe troops of Colonel Ascherman (4 infantry battalions, 4 hussar companies and 12 cannons) started their sortie, from the Star Trench (Csillagsánc) of Komárom on the night of 2 to 3 August, right after midnight. Although Rakovszky's troops arrived from Komáromszentpéter only a couple of hours earlier (after 15–20&nbsp;km of walking), they were among Ascherman's troops, which had the hardest job of the military actions planned for that day. They attacked Dunaalmás at 2,30 a.m, with the 25. battalion on the front, but they were initially repulsed, but against the attack of the 48. battalion the Austrians could not withstand, the battle hardened Hungarian battalion pushing them out from their positions, chasing them East to Neszmély.\nAt 7 a.m., under the personal lead of Klapka, the columns of Kosztolányi and Krivácsy (2 battalions, 6 cannons, and 2 hussar companies each) started their march towards Mocsa, and thanks to the bumpy terrain which hid them from the eyes of the Austrians, they approached unseen, then attacked them from three directions, encircling the 3 companies and a squad of Uhlans strong Austrian garrison, from the Baugartner regiment of the trenches from Mocsa, The Austrian cavalry units fled away, while the infantry, after a short resistance surrendered at 11 a.m. The Hungarians around 9 a.m. took positions on the sand dunes lying towards Igmánd, where Ascherman rested his units, especially the 25. and 48. battalions, which earlier came from Komáromszentpéter. Suddenly behind the back of the Hungarians a huge cloud of dust rose up. The Hungarians initially thought that the enemy  got reinforcements, so they wanted to shoot with their artillery on the dust cloud, but then they realized that this was actually not the enemy cavalry but a huge herd of 3000 oxen, the Austrian food supply, captured by the Hussars, who were herding them towards Komárom.\nThe commander of the Austrian brigade from the right bank of the Danube, Major General Joseph Barco in order to relieve the Austrian companies from Mocsa, headed from the Herkály grange towards there with the rest of the Baugartner battalion (5 infantry companies), 1,5 company of Uhlans and a half battery, leaving in Herkály an infantry battalion and four 12-pounder cannons, announcing in the same time his superior Lieutenant General Prince Colloredo, but after he arrived near Csém, he saw that the Hungarians already occupied Mocsa, and they are approaching towards his unit with two battalions, two Hussar companies and 12 cannons. Heading towards Csém, Colloredo was announced that Hungarian units are advancing towards the Ács forest, so when he arrived, he ordered to Barco to retreat to the Herkály grange, where he took with him the reserves, and started to organize the Austrian defence line west from Komárom.\nColloredo and Barco estimated that the Hungarians have 8-9 battalions infantry, three divisions of Hussars and 4 batteries with 32 cannons, while they had at his disposal 3 battalions from the Mazzuchelli regiment (500 soldiers each), the 4. Ottochaner battalion, the Baugartner battalion, the 1. Uhlan division with 2-12-pounder batteries, in total 3000 men and 17 cannons, Colloredo deploying on the right wing, on a hill south to the Herkály grange the 12-pounder battery of Lieutenant Jantner, faced towards Csém, 200 paces to left from them two 18-pounder guns were directed towards Újszőny; between these two artillery groups a platoon from the Mazzuchelli and a company from the Baugartner infantry regiments were aligned in skirmish line. The rest of the Baugartner Landwehr battalion was placed in platoons behind the hills, further behind, as a second line, 8 Mazzuchelli companies were aligned. Finally behind the right wing Colonel Count Nostitz, with 5 uhlan platoons and a half cavalry battery, placed in a hook-like shape, were protecting the right wings back. Coloredo and Barco also ordered the Austrian troops stationing in Csallóköz to rush to help his troops, but these arrived only in the late afternoon, towards the end of the battle, while the reinforcements from the direction of Ács, which they also demanded, did not came because the apparition of the column of Colonel János Janik, who with his successful diverting actions in front of the Ács forest, tied down the Austrian troops from here.\nJanik did not started a decisive attack here because, he had to wait, according to Klapka's order, for Ascherman's encircling division.\nAt 3 p.m. the Hungarian troops under the leadership of Klapka occupied Csém, capturing from the retreating Austrians a couple of wagons, and established the contact between all the attacking Hungarian units - excepting Ascherman's column - threatening the Austrians with encirclement. Now Klapka had at his disposal the columns of Kosztolányi and Krivácsi on the left flank, Colonel Bátori-Sulcz's 2 infantry battalions, 2 batteries on the center, and Colonel Janik's 2 infantry battalions, 1 battery on the right flank, to break the Austrian defensive positions West from Komárom.\nAround 5 p.m. Ascherman's troops still did not show up, resting on the heights from Nagyigmánd, but Klapka could not wait any more, also because of the damaging artillery fire from the Austrian positions, which caused mounting casualties for his soldiers, so he finally ordered the decisive attack. The columns of Krivácsy and Kosztolányi attacked from the left the Austrian trenches, Bódog Bátori-Sulcz's two battalions charged from the front with a strong artillery support, while Janik's column attacked the Austrian fortified positions from the Ács forest.\nOn the Hungarian left wing (the Austrian right) and center, Krivácsi's and Kosztolányi's column faced a successful resistance mainly because of the effective fire of the half battery of the Austrian right wings rearguard led by Colonel Nostitz, so their advancement was slower. But then, from the direction of Újszőny the column led by Bátori-Sulcz showed up, and despite the counterattack, at Colloredo's order, of the 2 1/2 companies strong Austrian reserve, after an hour heroic resistance, and losing 5 officers and 76 soldiers, the imperials were forced to retreat. Klapka in his memoirs states that among the attacking troops the most heroic were the soldiers of Bátori-Sulcz, who attacked the enemies fortified positions from the front with a thin skirmisher line, the infantry in battle positions, with the cavalry on their flanks, shouting Long live the Hungarian, advancing through terrible grape-shot and fusillade to the enemy parapets.  Being shattered by this unstoppable attack, and fearing from an encirclement, the Austrians started to rout. Seeing that their flanks are collapsing, and fearing an encirclement, Lieutenant field marshal Anton Csorich gave the order of retreat to the other side of the Concó at the Ács village. In order to cover the retreat over the creek, Lieutenant General Colloredo with a section of his troops, took position at the southeastern edge of the Ács forest, where thanks to Nostitz's uhlans, they covered the retreat with success against the attacking column of Krivácsi and Kosztolányi. The Austrians crossed the Concó creek to Ács, where with 1 1/2 company of uhlans, repulsed a hussar attack, but this was only to give some time for the, now routing Austrian soldiers to escape to fall prisoners.\nOn the Hungarian right wing Janik's troops attacked the Austrians defending the Ács and the Meggyfa woods, led by General Teuchert, who, knowing the disastrous situation from the other parts of the battlefield, did not resisted, but they started to retreat. But when they exited the forest, and headed towards the Concó creek, the Austrians saw that Hungarian units are heading from south towards the Danube. These were Bátori-Sulcz soldiers, who were sent by Klapka to encircle the Austrians from the Ács woods. Seeing this the Austrians started to rout, and tumultuously tried to cross the creek at the mouth of the Concó into the Danube, leaving in the Hungarians possession two 12-pounder guns, and the Mazzuchelli company from their rear.\nUnder the lead of Lieutenant General Colloredo, the fleeing Austrian troops arrived to the Danube bridge from Lovad, where they were waited by  an infantry battalion, a column of uhlans and a 6-pounder battery sent by Major General Karl Liebler von Asselt from his brigade on the Northern banks of the Danube. They, together with Nostitz's uhlans, saved the retreating Austrian troops from the total collapse and annihilation. Still the most important cause of their escape was Ascherman's delay, who arrived to the Lovad bridge only around 8 p.m., while he should have arrived there hours before. The Austrian troops crossed the bridge from Lovad at 7 p.m., and dismantled it before the Hungarians could use it to cross the Danube, and to chase them on the northern bank of the river. Asherman arrived to the bridge only after the Austrians crossed it, he tried to shoot at them with his artillery, but with no effect.\nAftermath\nThe attack of the Hungarian troops led by General György Klapka crushed the Austrian blockade around Komárom, liberating the fortress completely, dispersing the besieging II. corps, and cutting the supply routs of the Austrian main forces led by Haynau.\nThe Austrians suffered important losses: Péter Szillányi, chief of Klapka's general staff wrote about 1500 prisoners, Wilhelm von Ramming, member of the General Staff of the FZM Haynau, wrote about more than 1000 Austrian prisoners and mentions by name 5 dead and 12 wounded officers. In the battle the Hungarians captured two 18-pounder, two 12-pounder, and two 6-pounder guns, a 7-pounder long howitzer a huge number of rifles, 4 ammunition wagons, 7 simple wagons, 32 luggage carts, 2624 oxen, 804 pigs for fattening, 74 horses and 35 ships filled with food and equipment, then after the battle, when on 4 August they took over the outposts formerly held by the Austrian siege corps, in Gönyő they found 700 quintals of gunpowder, in Nagylél fourteen 18-pounder spiked cannons.\nIn that evening the Austrians retreated to Nagylél while Klapka placed his troops as it follows: Ascherman's and Janik's columns between Ács and Lovad, those of Bátori-Sulcz behind Ács, while the outposts were placed towards Gönyő and Nagyigmánd.\nThe defeat created panic among the Austrians. The beaten II. corps units retreated in the vicinity of Vienna, as it follows: on 4 August the Barco and Liebler brigades retreated to Nyárasd and Gutta, on 5 August to Lég and Dunaszerdahely, on 6 August to Waltersdorf and Bruck an der Leitha in Austria; while Pott was ordered to retreat to Pozsony, but on his way towards there, he received an order to go back, and guard the line of the river Vág.\nAfter crushing the imperial blockade around Komárom, General Klapka sent Ascherman with a newly formed corps, and liberated Győr. In this way he cut the communication of the imperial troops from Hungary led by Haynau and Vienna, the capital of the Habsburg Empire. Because of this, now the Austrian courriers, carrying the reports, had to make a huge southern detour towards their capital. Now with the road to Vienna and the Austrian provinces, Klapka planned to liberate all the Transdanubia region, and to attack Styria.\nThe victory had an important effect on the Hungarians living in the Transdanubia region, waking up their hopes in the possibility of defeating the Austrian and Russian invaders of their country. As a result of this the people of Székesfehérvár revolted against the Austrians, chasing out the imperial garrison from the town. Klapka started to recruit new troops in the liberated regions, increasing the numbers of the garrison of Komárom to more than 20 000 soldiers. He sent messengers to the Hungarian governor Lajos Kossuth and general Artúr Görgei, promising that in a few weeks he will recruit 30 000 new soldiers, and encouraged them to continue the fight, and with enough perseverance the war is still winnable. Unfortunately Klapka's couriers met Kossuth when he already crossed the Danube, arriving in Turkey, and Görgei after he surrendered to the Russians on 13 August.\nBut the successful sortie of Klapka's troops came too late to bring important changes in the fate of the war. When Haynau learned about the Hungarian victory, his troops already entered in Temesköz, preparing for the decisive battle with the Hungarian main army. The Austrian main commander taught that if he wins this battle, Klapka will have only one choice: to turn back in Komárom. And indeed, on 13–14 August Klapka was forced to retreat from Győr, and to turn back in Komárom. The Hungarian main army led by Artúr Görgei put down its weapons on 13 August after the disastrous defeat of Lieutenant General Józef Bem in the Battle of Temesvár from 9 August. On 19 August the Austrian army appeared again before Komárom, and demanded the unconditional surrender, but Klapka refused, prolonging for another  months the resistance of the fortress.\nSee also\n* First Battle of Komárom (1849)\n* Second Battle of Komárom (1849)\n* Third Battle of Komárom (1849)\nNotes\nSources\n*\n*\n*\n*\n*\n*\n*\n*"
    }
  ]
}