{
  "content": [
    {
      "type": "text",
      "text": "# Four big families of the Republic of China\n\nand Soong Mei-ling]]\nThe four big families () are four politically influential families in the Republic of China, first in Mainland China, then Taiwan. The concept was believed to be coined by Chen Boda, a political figure and political theorist of the People's Republic of China. Chen alleged that the four families amassed approximately 20 billion US dollars during the Second Sino-Japanese War, a claim that gained traction in Chinese society, particularly during major political and economic crises. This perception was encapsulated in a popular saying:\nHistory\nIn 1923, Qu Qiubai, a Communist leader, wrote in the party's journal that several political families controlled bureaucratic capital in China. In 1946, Communist journalist Chen Boda published a book titled The Four Big Families of China, accusing the Chiang, Soong, Kung, and Chen families of exploiting over 20 billion US dollars from the Chinese people during the Second Sino-Japanese War. Since then, the concept of the \"Four Big Families\" has gained widespread recognition. The Kuomintang's defeat in the Chinese Civil War intensified political pressure on U.S. President Harry S. Truman’s China policy. To deflect responsibility, the Truman administration attributed the loss of China to widespread corruption within the Kuomintang. With the Kuomintang's retreat to Taiwan, the influence of the four big families in China significantly declined. Yet, the narrative of the immense wealth of the \"Four Big Families\" persisted in the United States, inspiring Sterling Seagrave's publication of the Soong Dynasty in the 1980s.\nWith the declassification of historical documents following the deaths of key family members, growing evidence indicates that the Chen and Chiang families did not accumulate significant wealth through politics, while the Kung and Soong families were already affluent prior to their political involvement. According to a document owned by Chang Kia-ngau, Japanese intelligence investigated the deposits of major Chinese government officials in Shanghai. Their findings estimated the assets of Chiang Kai-shek at 8.09 million US dollars, Soong Mei-ling at 3.77 million, T. V. Soong at 6.37 million, and H. H. Kung at 6.35 million—figures significantly lower than Chen Boda's claims.\nFamilies\nChiang family\nBeginning in 1928, Chiang Kai-shek ruled China for approximately 20 years before continuing his leadership in Taiwan for another 30 years. Despite his long tenure, he had only two sons, Chiang Ching-kuo and Chiang Wei-kuo. Chiang Ching-kuo succeeded his father in Taiwan, leading for 10 years during which he implemented several reforms. However, the Chiang family's influence waned in subsequent political struggles. Demos Chiang Yu-bou, the grandson of Chiang Ching-kuo remains a popular figure in Taiwanese media.\nChiang Ching-kuo had two sons with his mistress Chang Ya-juo, among which was Hsiao-yen, who only adopted Chiang as the family name until the death of Chiang Ching-kuo's wife Chiang Fang-liang in 2004. Hsian-yen's son, Chiang Wan-an being the only Chiang who is still active in Taiwanese politics.\nSoong family\nThe Soong family is renowned for the Soong sisters: Soong Ching-ling, who married Sun Yat-sen; Soong Mei-ling, who married Chiang Kai-shek; and Soong Ai-ling, who married H. H. Kung. The Soong family was widely regarded as the wealthiest among the four major families, with T. V. Soong serving as China's finance minister. T. L. Soong was a prominent Chinese diplomat, while T. A. Soong, though less well-known, worked in the banking sector and served as a board member of the Kwangtung Provincial Bank. T. A. Soong's son, Leo Soong, later founded the Crystal Geyser Water Company.\nThe Soong family after Soong Mei-ling was entirely based in the United States, with very few still fluent in Chinese. After the death of Soong Mei-ling, the last member of the Soong sisters, the family left the spotlight.\nKung family\nThe Kung family are believed to be descendants of Confucius. H. H. Kung and Soong Ai-ling were successful businesspeople first in energy and then in various other industries. They funded the 1911 Revolution led by Sun Yat-sen. Before the Kuomintang's retreat to Taiwan, the family had moved to the United States, and hardly engaged with any Chinese since then. H. H. Kung had two sons and two daughters, among them Kung Ling-chun was the first manager of Grand Hotel in Taipei.\nChen family\n, Chan Ayin, and Chen Guofu at the inauguration ceremony of the Chen Qimei statue in 1929]]\nBrothers Chen Lifu and Chen Guofu became powerful after being in charge of the internal affairs of the Kuomintang for Chiang Kai-shek. They were regarded as the poorest among the four families. They were kicked out of politics after the retreat to Taiwan. Chen Guofu died in Taiwan in 1951 without any children. Most of the family members had moved to the United States, with only two in Taiwan.\nSee also\n* Four big families of Hong Kong\nReferences\nFurther reading\n*"
    }
  ]
}