{
  "content": [
    {
      "type": "text",
      "text": "# Four-stroking\n\nFour-stroking is a condition of two-stroke engines where combustion occurs every four strokes or more, rather than every two. Though normal in some instances at idle, extremely high engine speeds, and when letting off the throttle, such firing is uneven, noisy and may, in cases of malfunction, damage the engine if allowed to continue unabated.\nFour stroking will occur in a correctly adjusted two stroke engine at full throttle without load when the air-fuel mixture becomes overly rich and prevents the engine from running faster. At such high speeds a mixture that is too lean will cause the engine to over-rev as well as overheat, and in engines running on premixed fuel a mixture that is too lean will cause poor lubrication.\nIn chain saw operation, where natural fluctuation of chain bite during a cut can cause momentary over-revving, the full throttle mixture is adjusted for four-stroking to occur at a set high rpm, cutting engine speed and enriching lubrication.\nCauses\nTwo stroke engines rely on effective scavenging in order to operate correctly. This clears out the combustion exhaust gases from the previous cycle and allows refilling with a clean mix of air and fuel. If scavenging falters, the mixture of unburnable exhaust gas with the new mixture may produce an overall charge that fails to ignite correctly. Only when this charge is enriched by a second volume of clean mixture does it become flammable again. The engine thus begins to  fire every second cycle (every four strokes), rather than correctly on every cycle. Four-stroking begins gradually, so the engine first starts to run with an unpredictable mixture of two- and four-stroke cycles. When severe, this may even become six- or eight-stroking.\nScavenging of small two-stroke engines relies on inertial scavenging through the Kadenacy effect. At low rpm and low gasflow velocities, this effect is reduced. Scavenging thus becomes less effective when idling, and so it is when idling (at either low rpm or low throttle) that four-stroking is most likely to become a problem. Schnuerle or loop scavenging is considered to be less prone than the simpler cross-scavenging.\nFour-stroking is not caused by an over-rich mixture, as is widely believed, although this can make it worse. Nor is it caused by excessive oil/fuel lubrication mixtures.\nFour-stroking in diesels\nFour-stroking is less likely with compression ignition engines (i.e. diesel engines) than it is with spark-ignition engines (i.e. petrol engines). Diesel engines are also rare as the small two-strokes where inertial scavenging is used. When large two-stroke diesel engines are used, these have scavenging by forced induction and so are generally immune to four-stroking when idling at low speed or low power. These scavenge blowers may be mechanically-driven Roots blowers or turbochargers. As a turbocharger has some lag time coming up to speed, turbo-charged two-stroke diesels often display four-stroking when starting, or when suddenly accelerating from idle. Some large engines, such as those from EMD, minimize this by using a turbocharger with an auxiliary mechanical drive to give better scavenging at low rpm.\nModel engines\nFour-stroking is a common and expected behaviour with model engines, both glow fuel and diesel. These small engines rely on scavenging at their extremely high rotational speeds. When started, they run as inertially-scavenged four strokes and have a distinctive change in engine note when they accelerate past the point at which they begin to operate as two strokes. Owing to the scaling laws of such small engines, this four-stroking is an unavoidable consequence of limitations on their scavenging at slow speeds. However the same scaling laws also make the effects of four-stroking less severe and so the engines can idle satisfactorily in this mode without damage.\nThe pilots of control line aerobatic model aircraft often depend on \"four-stroking\" of their glow fuel burning two stroke model engines for optimal flight performance, including with fixed-venturi four stroke model engines.\nHazards of four-stroking\nWhen a four-stroking engine eventually fires, the excess mixture from the previous failed combustion stroke causes an excessive cylinder pressure. This can be nearly double the normal pressure, leading to excess noise and potentially failure of overloaded bearings in the connecting rod.\nFour-stroking is particularly noisy, especially as it occurs when the engine is otherwise relatively quiet and a vehicle potentially stationary at idle. In some cases, particularly with two-stroke engines installed in cars, extra exhaust silencing may be installed to offset this.\nAvoiding four-stroking\nFour-stroking is problematic when a quiet, docile engine is required and also when the load on an engine suddenly changes.\nRetarding ignition timing reduces four-stroking, as it allows more time for scavenging to take effect. Two-stroke engines, when running at low power, are less sensitive to ignition timing changes than four-stroke engine. If the timing is retarded for low throttle positions, from perhaps 35° before top dead center at normal speeds to top dead center or even 10° after TDC at slow idle, the engine runs well without four-stroking. Opening up the throttle and simultaneously advancing the timing, allows a rapid pickup in speed. This system is widely used for marine outboard motors, particularly when used to pull water skiers.\nTwin- or multi-cylinder engines may improve low-speed scavenging to one cylinder by shutting down the other cylinder at low speeds. This may be done simply by cutting the ignition spark to one, thus increasing the load on the other cylinder and thus the power and gas-flow required. This has the drawback of wasting fuel in the un-ignited cylinder, potentially also risking oiling-up its spark plug and clogging the exhaust system. More sophisticatedly, as was done for some Johnson outboard motors, the transfer passage for one cylinder may be closed by an additional throttle butterfly, shutting that cylinder off completely and isolating it from the fuel air mixture. This avoids the risk of oil-fouling and routes all gas-flow through the operating cylinder, greatly increasing fuel economy.\nNotes\nReferences\nWorks cited\n*"
    }
  ]
}