{
  "content": [
    {
      "type": "text",
      "text": "# Fourth Army Corps (Spanish–American War)\n\nThe Fourth Army Corps was a unit of the United States Army raised for the Spanish–American War. After the declaration of war, General Order 36 of May 7, 1898 approved the organization of eight \"army corps,\" each of which was to consist of three or more divisions of three brigades each.\nEach brigade was to have approximately 3,600 officers and enlisted men organized into three regiments and, with three such brigades, each division was to total about 11,000 officers and men. Thus the division was to be about the same size as the division of 1861, but army corps were to be larger. The division staff initially was to have an adjutant general, quartermaster, commissary, surgeon, inspector general and engineer, with an ordnance officer added later. The brigade staff was identical except that no inspector general or ordnance officer was authorized.\nGeneral Order 46 of May 16, 1898 assigned commanding officers and training camps to the new corps. Major General John J. Coppinger was named as commander of Fourth Army Corps, which was to assemble at Mobile, Alabama. The corps spent the summer of 1898 traveling between organization and training sites in Alabama and Florida. On June 2, it began moving to Tampa, Florida and on July 3, the corps's Third Division was transferred to Fernandina, Florida. On June 20, the First Division, under command of Brigadier General Theodore Schwan, was transferred to Miami. On June 27, the Fourth and Seventh Army Corps exchanged their First Divisions, the Seventh's having remained in Tampa when the corps headquarters moved to Jacksonville, Florida.\nOn August 11, with the end of the war in sight, the corps was transferred again, to Huntsville, Alabama.\nWhen Coppinger reached the mandatory retirement age of 64 in October 1898, Major General Joseph Wheeler (USV) took command on October 13, and stayed at the head of the corps until December 3. A revolving door of commanders led the Fourth through the remainder of its service, as follows:\n* Brigadier General Abraham K. Arnold (USV), December 14–20, 1898\n* Major General Henry W. Lawton (USV), December 20–29, 1898\n* Brigadier General Royal T. Frank, December 29, 1898 – January 16, 1899\nAt the same time Frank took command of the corps, its headquarters was transferred to Anniston, Alabama. The Fourth Army Corps was \"discontinued\" on January 16, 1899; its strength on the last day of 1898 was 545 officers and 13,337 enlisted men.\nReferences\nSee Also\nCorps Badges of the Spanish-American War by Robert Borrel Sr. at [https://www.jstor.org/stable/44031529 JSTOR]"
    }
  ]
}