{
  "content": [
    {
      "type": "text",
      "text": "# Foxwarren (album)\n\n| studio       =\n| genre        =\n| length       = 35:46\n| label        =\n| producer     =\n| prev_title   = Has Been Defeated\n| prev_year    = 2011\n| next_title   = 2\n| next_year    = 2025\n| misc         =\n}}\nFoxwarren is the debut studio album by Canadian band Foxwarren. It was released by Anti- and Arts & Crafts on November 30, 2018. It received a Juno Award nomination for Alternative Album of the Year at the Juno Awards of 2020.\nBackground and recording\nFoxwarren was formed about 10 years earlier. It consists of brothers Darryl Kissick and Avery Kissick, accompanied by members Dallas Bryson and Andy Shauf. The band is named after the Kissicks' Manitoba hometown. Shauf and Bryson, who were school friends from Caronport, first met the Kissick brothers through Regina's music scene and through the Sears call centre, where Shauf and Avery worked.\nWith the exception of one song recorded in 2017, all of the tracks on the album were recorded four years earlier in Regina and Manitoba. Shauf had presented the album to his record labels and they were receptive to it, but the album remained unreleased as Shauf was busy with his solo touring and recording schedule. The band did however anticipate it would be released, with Foxwarren's bassist Darryl Kissick calling it \"just a matter of when would it make sense to put it out\". All tracks on the album were recorded by the band themselves with the exception of \"Your Small Town\", which was recorded by the band with sound engineer Rob Morrison.\nFoxwarren was Shauf's first project since the release of his acclaimed concept album The Party (2016), also released by Anti-. It was widely billed as being Foxwarren's \"self-titled debut\". However, the band previously released an album entitled Has Been Defeated in 2011. That album, however, is radically stylistically different from the self-titled LP. It was also never pressed on vinyl. CBC described Has Been Defeated as not being \"widely known or recognized by the band\". NOW Toronto described Foxwarren as being \"technically Foxwarren's sophomore album, but Shauf has been rather secretive about the group's past work.\"\nRelease\n, July 2019]]\nThe album was first announced on November 5, 2018, alongside the release of the single \"Everything Apart\". A second single, \"To Be\", was released on November 14, 2018.\nCritical reception\n| rev1 = AllMusic\n| rev1score =\n| rev2 = Exclaim!\n| rev2score = 8/10\n| rev3 = Far Out Magazine\n| rev3score =\n| rev4 = Mojo\n| rev4score =\n| rev5 = No Ripcord\n| rev5score = 8/10\n| rev6 = NOW Toronto\n| rev6score = NNNN\n| rev7 = Pitchfork\n| rev7score = 7.3/10\n| rev8 = Q\n| rev8score =\n| rev9 = Uncut\n| rev9score = 8/10\n}}\nFoxwarren was met with positive reviews. At Metacritic, which assigns a normalised rating out of 100 from reviews from professional critics, the album received a score of 79, based on 8 reviews.\nWyndham Wallace of Uncut assessed it as an \"understated debut of mature sophistication\". AllMusic's Marcy Donelson wrote, \"Foxwarren remains both off-kilter and irresistibly comforting, like the feeling of the pull of sleep.\" Margaret Farrell of Pitchfork wrote, \"These songs suggest the continuous struggle to be comforted, and Shauf finds himself stronger in the company of others. Even in the detail of lonesome battles, Foxwarren's kinship and warmth persist.\" No Ripcords Juan Edgardo Rodriguez wrote, \"Shauf and his troupe handle their debut project with an exceptional level of attention and care that points to its potential longevity.\" Mojo called it a \"likable debut\" which \"peaks on \"Everything Apart\"'s breezy kosmische shuffle, and Lennon-ish \"I'll Be Alright\", but its airiness doesn't always work.\"\nTrack listing\nAll songs written and arranged by Foxwarren.\nPersonnel\nCredits adapted from the album's liner notes.\n* Foxwarren – recording (all tracks)\n** Dallas Bryson\n** Darryl Kissick\n** Avery Kissick\n** Andy Shauf\n* Rob Morrison – recording (track 7)\n* Jon Anderson – mixing\n* Philip Shaw Bova – mastering\n* Chris Graham – photos\n* Danielle Tocker – photos\n* Mat Dunlap – layout and graphic design\nNotes\nReferences"
    }
  ]
}