{
  "content": [
    {
      "type": "text",
      "text": "# Foyle's War series 5\n\nSeries 5 of the ITV programme 'Foyle's War' was first aired in 2008; comprising three episodes, it is set in the period from April 1944 to May 1945.\nEpisodes\n\"Plan of Attack\"\n{| class=\"wikitable\" width=99%\n|- style=\"background-color: #F0F8FF;\" |\n| Writer: Anthony Horowitz || Director: Tristram Powell || Airdate: 6 January 2008 || Net duration: 93 minutes || Set: April 1944   || Viewers: 7.37 million\n|-\n|- style=\"background-color: #F0F8FF;\" |\n|colspan=\"6\"|Guests: Fiona Glascott, Martin Hutson, Julian Wadham, Robert Whitelock, Nicholas Day, Elizabeth McKechnie, Malcolm Sinclair, Philip Fox, Vince Leigh, Clifford Rose, Michael Jayston\n|-\n|colspan=\"6\"|Milner arrests a prominent trucking racketeer, Bill Burton, who threatens Milner with his \"powerful friends\". DCS John Meredith, Foyle's uncharismatic replacement, has created unease at the station, and a number of officers have transferred or left to join the army. At a nearby Air Ministry building, where Sam Stewart now works as a civilian, Airman Henry Scott, a capable but highly strung cartographer, is troubled by irregularities in map data. He is later found hanged in the local woods. His friend and confidant, a Catholic priest from St Jude's, German refugee Martin Keppler, attends an ecumenical conference opposing the seemingly wanton bombing of Germany into unconditional surrender. A shooter opens fire on Milner and Meredith as they are leaving the station, hitting and killing Meredith. At the urging of Assistant Commissioner Henry Parkins, Foyle agrees to return from retirement to solve the case. He soon exposes Wing Commander Stephen Foster for taking bribes from Burton, including for hiring his unqualified nephew Adam Everitt. He also reveals Keppler's true role as a German spy and his responsibility for the murders of Scott and Meredith.\n|-\n|}\nCast and characters\nFoyle has been in retirement after his resignation a year earlier at the end of \"Casualties of War\". Stewart has been removed as a police driver by Foyle's replacement, Meredith, and has been working as a librarian in the Air Ministry's cartography facility at Beverley Lodge for the last six months. She is also assisting Foyle as his typist for his book on the Hastings Constabulary during the war (even though she is not a proficient typist). Her uncle Aubrey Stewart (Brian Poyser), a country vicar, returns from the episode \"The French Drop\", when he visits Hastings for the ecumenical conference. Milner, unhappy since Foyle's departure, seeks the latter's counsel after finding Meredith difficult to work with and considers leaving Hastings. By the end of the episode, the original team is reunited when Foyle and Milner both decide to stay, and Stewart quits to rejoin them.\nBackground and production\nThe episode mentions increased troop movements down to the south coast and that \"the end of the war is in sight\", indicating a pre-D Day setting. The cartography activity at fictitious Beverly Lodge (filmed at Langley Park, Slough, Berkshire) is based on the secret map-making activities undertaken at Hughenden Manor during World War II, that were not known until two years before the shooting of this episode. Anthony Horowitz based much of the story on the experiences of Victor Gregory, a cartographer at Hughenden, who was engaged as a consultant during the shooting of the episode. Another theme is various efforts by the Church of England to preach forgiveness of the enemy, establish relations with the German church (such as the German Confessing Church), and accept from Germany a conditional (rather than unconditional) surrender to prevent the unnecessary killing of civilians by bombing of German cities. The efforts of Dietrich Bonhoeffer are mentioned, as are events reflecting George Bell, Bishop of Chichester.\n\"Broken Souls\"\n{| class=\"wikitable\" width=99%\n|- style=\"background-color: #F0F8FF;\" |\n| Writer: Michael Chaplin || Director: Simon Langton || Airdate: 13 April 2008  || Net duration: 91 minutes || Set: October 1944 || Viewers: 7.74 million\n|-\n|- style=\"background-color: #F0F8FF;\" |\n|colspan=\"6\"|Guests: Nicholas Woodeson, Graham Crowden, Duncan Bell, Phyllida Law, Natasha Little, Joseph Mawle, Roger Sloman, Jay Simpson, Jesse Birdsall\n|-\n|colspan=\"6\"|Foyle meets his friend, Dr Josef Novak, a Polish-Jewish psychiatrist, for a chess game. Novak works at a nearby Sackville House Hospital, a military mental health institution, headed by Dr Iain Campbell. The young and ambitious Dr Julian Worth is found murdered there after publishing an article based on Novak's patients without permission. Foyle is called in, and Stewart volunteers to help find a missing East End boy, 15-year-old Tommy Crooks. Meanwhile, Fred Dawson, a disabled former POW, arrives back at his farm to find his wife Rose and son Daniel being assisted by Johann Schultz, a German POW. Dawson quickly suspects Rose of overly-fraternising with the German and resents Schultz's friendship with Daniel. At the hospital, Campbell is romantically involved with his secretary, Joy Phelps, wife of Peter, a patient at the hospital, who is committed to an asylum following the death of Worth. Knowing that his time at the Dawson farm is over, Schultz escapes the camp and is later found dead nearby. Foyle's investigation reveals Campbell's killing of Worth over a stolen love letter and the killing of Schultz by Novak – who had just seen a newsreel report on horrors at the concentration camp where members of his family were held – based on instinct and survivor guilt.\n|}\nCast and characters\nNovak was in Paris during the invasion of Poland, and his wife and daughter remained there. During the episode, we learn of their transfer to a ghetto (probably the Lublin Ghetto), and then to the Majdanek concentration camp, news of which triggers Novak's suicide attempt. His uncle was apparently a Polish chess grandmaster. Dawson had been a prisoner since the Battle of Dunkirk, four years earlier but recently escaped and was injured by frostbite. Tommy Crooks, a 15-year-old missing former child-evacuee, arrives to stay with Sir John and Lady Muriel Sackville, the gentry who had lived in the country house that had been requisitioned and converted into a  hospital and whose son was killed in the 1942 raid on Dieppe Raid. As a telegram boy, Crooks was traumatised by the reactions of those to whom he delivered bad news and also the recent death of his mother in a V-1 flying bomb attack. His father, Morris, arrives in Hastings seeking his return.\nBackground and production\nGerman POWs are being billeted near Hastings at the Bexhill-on-Sea POW Camp. At the Ruby Cinema, the 1944 film Going My Way, starring Bing Crosby, is being screened, along with a Pathé News newsreel. The radio news report heard by Novak was by BBC correspondent Alexander Werth. Also, Brooke discusses a staff football betting pool at the station, in which they win £100, which Foyle suggests donating to Jewish refugees. The fictional article in the episode is in the October 1944 issue of The Journal of Mental Science, titled The Mental Trauma of War: Some Case Studies and published by the Royal Medico-Psychological Association. Foyle is also seen looking through newspapers dated 14 October 1944, including Daily Mirror, Daily Express, and The Daily Telegraph.\n\"All Clear\"\n{| class=\"wikitable\" width=99%\n|- style=\"background-color: #F0F8FF;\" |\n| Writer: Anthony Horowitz || Director: Tristram Powell || Airdate:  20 April 2008 || Net duration: 93 minutes || Set: May 1945  || Viewers: 7.92 million\n|-\n|- style=\"background-color: #F0F8FF;\" |\n|colspan=\"6\"|Guests: Mark Bazeley, John Ramm, Jay Benedict, Frances Grey, Martin Savage, Jay Simpson, Paul Thornley, Ellie Haddington, Frank Mills\n|-\n|colspan=\"6\"|The episode begins on 2 May 1945, with the arrival at the Majestic Hotel of Major John Kieffer, now haunted by visions of dead American soldiers. With VE Day soon upon them, Foyle is asked to assist the council's celebration committee, along with Austrian GP Dr Henry Ziegler and Martin Longmate, the owner of the Majestic and an aspiring Conservative politician. Foyle attempts to rekindle his friendship with Kieffer, but the latter, now a heavy drinker, only wants to return to the US. The council's committee member, Mark Griffiths – formerly a major in the Royal Signals – is also haunted by his past, as are Edward Hylton, a demobilised soldier, and his wife Janice. When Ziegler is stabbed to death, Foyle investigates and soon learns of Griffiths' suicide. Suspicion turns to Michael Brown – the aged museum curator, who cannot explain how the murder weapon was taken from a display – and to also Kieffer's interest in Griffiths. Foyle then meets Hilda Pierce in London and learns of Operation Tiger in Devon. Confronting Kieffer, he learns of how he tracked down and hounded Griffiths, the man he held responsible for the disaster. He also learns of Longmate's killing Ziegler to cover-up his fabricated army medical check. The episode ends with the celebration of VE Day on May 8 and Foyle's departure from the Hastings police station.\n|-\n|}\nCast and characters\nKieffer (from Series 4 \"Invasion\") returns in this episode, and we learn of his wife and two children. Also returning are Foyle's son Andrew, who had been flying in Malta prior to his discharge, and Pierce (from Series 2 \"War Games\" and Series 3 \"The French Drop\"). With the war in Europe ending, Foyle is retiring again and the station is being moved. Milner receives a promotion to DI and a transfer to Brighton, while Edith, his new wife, is expecting their first child. When the delivery starts, Foyle gets behind the wheel and drives them to the hospital, revealing his deception about not driving. Stewart is uneasy about her post-war career and Foyle suggests volunteering with the military charity SSAFA. Andrew Foyle attempts to apologise and propose to Stewart and rekindle their friendship and romance.\nBackground and production\nA big part of the story concerns the Slapton Sands disaster and it being covered up. Others include the preparations for the celebration of VE Day in Hastings (including profiteering from the sale of flags and bunting) and the difficulties experienced by returning servicemen in adapting to civilian life. One inconsistency is that Andrew says he won't continue as a pilot because \"sinusitis has affected my vision\" but sinusitis, while a reason for temporary grounding because of the pain caused by unpressurised cockpits, extremely rarely affects vision permanently. Several newspapers are used as props, Foyle is seen reading a copy of The Hastings Chronicle with a \"Hitler Dead\" headline; a few days later, a child reads The Evening News stating \"Germany Surrenders\"; and, in the station, Brooke discusses a Jane comic from the Daily Mirror. The episode ends with Churchill's victory speech and It's a Lovely Day Tomorrow, sung by Vera Lynn.\nInternational broadcast\nSeries Five was broadcast in Australia on ABC weekly from 20 July 2008, in the United States on PBS stations on Masterpiece Mystery! as ''Foyle's War V'' on 7 and 14 June 2009, and on Netflix as of April 2014.\nReferences\nExternal links\n* [https://www.imdb.com/title/tt0310455/episodes?season=5 Series 5] on IMDb"
    }
  ]
}