{
  "content": [
    {
      "type": "text",
      "text": "# Foyle's War series 2\n\nSeries 2 of the ITV programme 'Foyle's War' was first aired in 2003; comprising four episodes, it is set in autumn 1940. Series 2 was broadcast in the United States on PBS on Mystery!, on 18 and 25 July, and 1 and 8 August 2004, as ''Foyle's War II,'' and on Netflix as of April 2014.\nEpisodes\n\"Fifty Ships\"\n{| class=\"wikitable\" width=99%\n|- style=\"background-color: #F0F8FF;\" |\n| Writer: Anthony Horowitz || Director: Giles Foster || Airdate: 16 November 2003 || Net duration: 99 minutes || Set: September 1940 || Viewers: 9.30 million\n|-\n|- style=\"background-color: #F0F8FF;\" |\n|colspan=\"6\"|Guests: Clive Merrison, Amanda Root, Janine Duvitski, Tom Georgeson, Geoffrey Chater, Nicholas Le Prevost, Henry Goodman, Guy Henry, Bryan Dick\n|-\n|colspan=\"6\"|The building where Stewart lives is partially destroyed by a high-explosive bomb, and Foyle, there to check on her, soon learns of the theft of valuables from the damaged building. Now homeless, she bunks temporarily with Milner, until his wife comes home one night unexpectedly, forcing Stewart to sleep in a police cell. Foyle also investigates the apparent suicide of an alcoholic handyman, Richard Hunter, who had been at Oxford University at the same time that American millionaire, Howard Paige, was there as a Rhodes Scholar. Complicating matters, Hunter's son Kenneth appears connected to a gang of auxiliary firefighters, who are secretly looting bombed-out houses. Meanwhile, Hans Maier, a \"Dutch refugee\", is found, but when he turns out to be a German spy he faces execution. Surprisingly his cousin, the wife of the local doctor, lives nearby and seems complicit in his arrival. In the end, Foyle's investigations reveal Paige's involvement in stealing Hunter's concept for a synchromesh gearbox and in his murder. Stopped by Paige's minder from arresting the American, who is responsible for helping to convince the U.S. to supply arms to the U.K., Foyle vows to bring Paige to justice after the war.\n|}\nCast and characters\nThis episode introduces Foyle's former love, Elizabeth Lewes, whom he had hoped to marry some 20 years ago, if permission had not been withheld by her father. She expressed great regret, saying she never loved her husband although he was always kind. She wanted to start over with Foyle, but he was too decent to betray her good husband and their two sons, one named Christopher, presumably after him.\nIt is established that Stewart is 22 years old. Also, Foyle’s warning to Paige in this episode is later fulfilled in \"The Eternity Ring\" (Series 7, Episode 1), when Foyle returns from America having confronted Paige there and perhaps provoked his suicide.\nBackground and production\nThe title refers to the Destroyers for Bases Agreement, under which the United States traded 50 U.S. Navy destroyers to the U.K. in exchange for land rights in certain British colonies. The agreement was a reversal of the U.S.'s isolationist policy and a precursor to the much more substantial Lend-Lease programme. The edition of the Eastbourne Chronicle announcing the visit of Paige to Hastings is dated \"Wednesday September 14, 1940\". Therefore, this episode starts the day after the Season 1 episode - \"Eagle Day\". The episode also reveals the darker side of the war effort: those willing to profit in wartime at the expense of their countrymen. The subplot involving the capture of the character Hans Maier is based upon a real incident in which a German spy, Carl Meier, was caught in a similar way.\n\"Among the Few\"\n{| class=\"wikitable\" width=99%\n|- style=\"background-color: #F0F8FF;\" |\n| Writer: Anthony Horowitz & Matthew Hall || Director: Jeremy Silberston || Airdate: 23 November 2003 || Net duration: 99 minutes || Set: September 1940 || Viewers: 8.78 million\n|-\n|- style=\"background-color: #F0F8FF;\" |\n|colspan=\"6\"|Guests: Damian O'Hare, Christina Cole, David Troughton, Sean Baker, Selina Cadell\n|-\n|colspan=\"6\"|At a Home Guard checkpoint, Foyle and Stewart are surprised by a lorry that rams the barricade and speeds off. Their pursuit culminates when the lorry goes off the road and explodes, killing the driver and revealing an illicit fuel racket based at the nearest centralised fuel depot. Since no experienced undercover agent is available, Foyle allows Stewart, using her driving training, to infiltrate the depot run by manager Michael Bennett. She befriends another female driver, Connie Dewar, and is soon invited into the singles world of dances, servicemen and \"neutral\" Irish labourers. She is surprised to learn that one of the young men in Dewar's group is Andrew Foyle. His best friend — and Dewar's beau — is another RAF pilot named Rex Talbot. Soon Stewart notices an irregularity at the depot, when Dewar fails to fully empty the fuel tanker. But before anything can be done, Dewar is found dead at the bottom of the stairs in her guesthouse. Foyle's investigations reveal that Dewar was pregnant when she died; that the baby's father was the local nightclub manager — a racketeer tied to the fuel thefts and an attempted bombing of the depot — that Pamela Bennett, Michael’s wife, was complicit in the thefts; and how Talbot's secret feelings for Andrew led to Dewar's accidental death.\n|-\n|}\nCast and characters\nThe relationship and sense of trust between Christopher Foyle and his son Andrew is tested when Foyle learns details of Andrew’s secret sexual relationship with (and \"engagement\" to) Dewar's friend Violet Davies. Foyle again \"bends the rules\" in deference to the needs of wartime by allowing Talbot, who has confessed to accidentally causing Dewar's death, to lead the squadron on one last sortie, in which he is killed. He then consoles his own son afterwards by praising Talbot as a good man.\nBackground and production\nThis episode addresses petrol theft and black-marketeering in the new era of wartime rationing, in which petrol was the first item to be restricted.. The flying Supermarine Spitfire featured in this episode was [http://www.historicaircraftcollection.ltd.uk/index.html Historic Aircraft Collection's] Spitfire Mk.Vb BM597, and the airfield filming took place at Dunsfold.\n\"War Games\"\n{| class=\"wikitable\" width=99%\n|- style=\"background-color: #F0F8FF;\" |\n| Writer: Anthony Horowitz & Michael Russell || Director: Giles Foster || Airdate: 30 November 2003|| Net duration: 99 minutes || Set: October 1940 || Viewers: 8.90 million\n|-\n|- style=\"background-color: #F0F8FF;\" |\n|colspan=\"6\"|Guests: Alan Howard, Emily Blunt, Christopher Benjamin, Ian Redford, Tim Preece, Laurence Fox\n|-\n|colspan=\"6\"|A young secretary, originally from Hastings, falls to her death from the high-rise London headquarters of a food manufacturing company. Soon afterwards, an unreported and apparently unrelated burglary occurs at the country house belonging to Sir Reginald Walker, the company's owner. The break-in draws Foyle's attention, particularly after Harry Markham, the prime suspect — recently released from prison and a member of the Home Guard — is shot and killed during \"war games\" on the Sussex Downs, for which Foyle is acting as referee. The situation is complicated by the return of a corrupt former police colleague, Jack Devlin, and the involvement of barrister Stephen Beck. A friend of Foyle's, Beck is a German who fled to Britain in 1935 and is now secretly working for British intelligence.  He had met with Markham only days before his death, and he also knew the dead secretary. Using evidence collected by local children as paper salvage, Foyle confronts Walker and his son, Simon, uncovering their illicit connections with the Nazis and the younger Walker's hand in the two murders.\n|}\nCast and characters\nThis episode marks the brief return (prior to reassignment to North Africa with the 7th Armoured Division) of Foyle's former police sergeant, Jack Devlin. Now a British Army captain, Devlin left with the BEF for France and was wounded by shrapnel there. It also provides details of how Devlin was involved in planting evidence and perverting the course of justice in the Markham case six months earlier. Throughout the episode, Foyle is confronted with moral dilemmas and legal compromises made for the sake of the war. And it marks the first appearance of Hilda Pierce of British intelligence, played by Ellie Haddington, who later appears in the episodes \"The French Drop\" and \"All Clear\", before becoming a lead character in series 7 and 8.\nBackground and production\nThis episode introduces children competing to win a wartime salvaging competition by scavenging scrap aluminium, glass and used paper. It also deals with the looting of Jewish treasures and the war profiteering of British companies who continued trading with the Germans in contravention of the Trading with the Enemy Act 1939.\n\"The Funk Hole\"\n{| class=\"wikitable\" width=99%\n|- style=\"background-color: #F0F8FF;\" |\n| Writer: Anthony Horowitz || Director: Jeremy Silberston || Airdate: 7 December 2003 || Net duration: 99 minutes || Set: October 1940 || Viewers: 9.74 million\n|-\n|- style=\"background-color: #F0F8FF;\" |\n|colspan=\"6\"|Guests: Joanna David, Nicholas Farrell, Jonathan Tafler\n|-\n|colspan=\"6\"|The theft of rationed goods from a government warehouse goes wrong when guards critically shoot one of the perpetrators, 19-year-old Matthew Farley. When his mother reports him missing, investigations lead to a local guesthouse where Farley had worked, Brookfield Court, a home patronised by well-off Londoners with the means to move to safer territory. Around this time, Foyle is accused of making seditious remarks in a shelter during an air raid in London. Detective Chief Inspector Collier arrives from London to investigate, and Foyle is temporarily suspended and placed under house arrest. Investigations soon refocus on Brookfield Court when Farley's body is uncovered in the woods nearby, and the house is searched for contraband. The plot thickens when Frank Vaudrey, a London town councillor staying at Brookfield Court, is found dying. Milner is unconvinced by Collier's conclusion of suicide and risks his career by giving Foyle details of both cases. Foyle then secretly travels to London, where he soon learns the truth of Vaudrey's complicity in the deaths of Collier's mother and sister during a botched air-raid evacuation – clear evidence that Collier is the killer.\n|-\n|}\nCast and characters\nAndrew is on a week’s medical leave, after fog forced him to ditch his plane in the English Channel. After Stewart’s invitation for a companionable outing at his father's suggestion turns sour, he apologises to Stewart and takes her to see Gone With the Wind. After the movie, while walking back home, they share a kiss and begin a romantic relationship. Meanwhile, Foyle's tense relationship with his former boss's successor is also shown, when Foyle arrives unannounced in London and confronts him over the handling of the case against him. Also, in Foyle's absence, Stewart is unwillingly compelled to return temporarily to her position at the Mechanised Transport Corps depot.\nBackground and production\nIn the first year of the war, the British government made dire predictions of the amount of bombing in major cities that would occur and evacuated people to the countryside. Later, the government reversed these predictions but certain people who had the means to pay preferred to stay in their temporary lodgings, out of danger. Such hotels and guest houses became known as \"funk holes\" because their residents' actions were regarded as cowardice. With daily goods and pet-food in short supply due to wartime rationing, the black market in foodstuffs was also a problem for the authorities.\nInternational broadcast\nSeries 2 was broadcast in Australia on ABC weekly from 25 April 2004, in the United States on PBS on Mystery!, on 18 and 25 July, and 1 and 8 August 2004, as ''Foyle's War II,'' and on Netflix as of April 2014.\nReferences\nExternal links\n* [https://www.imdb.com/title/tt0310455/episodes?season=2 Series 2] on IMDb"
    }
  ]
}