{
  "content": [
    {
      "type": "text",
      "text": "# Fracking proppants\n\nA proppant is a solid material, typically sand, treated sand or man-made ceramic materials, designed to keep an induced hydraulic fracture open, during or following a fracturing treatment, most commonly for unconventional reservoirs. It is added to a fracking fluid which may vary in composition depending on the type of fracturing used, and can be gel, foam or slickwater-based. In addition, there may be unconventional fracking fluids. Fluids make tradeoffs in such material properties as viscosity, where more viscous fluids can carry more concentrated proppant; the energy or pressure demands to maintain a certain flux pump rate (flow velocity) that will conduct the proppant appropriately; pH, various rheological factors, among others. In addition, fluids may be used in low-volume well stimulation of high-permeability sandstone wells ( per well) to the high-volume operations such as shale gas and tight gas that use millions of gallons of water per well.\nConventional wisdom has often vacillated about the relative superiority of gel, foam and slickwater fluids with respect to each other, which is in turn related to proppant choice. For example, Zuber, Kuskraa and Sawyer (1988) found that gel-based fluids seemed to achieve the best results for coalbed methane operations, but as of 2012,  slickwater treatments are more popular.\nOther than proppant, slickwater fracturing fluids are mostly water, generally 99% or more by volume, but gel-based fluids can see polymers and surfactants comprising as much as 7 vol%, ignoring other additives.  Other common additives include hydrochloric acid (low pH can etch certain rocks, dissolving limestone for instance), friction reducers, guar gum, biocides, emulsion breakers, emulsifiers, 2-butoxyethanol, and radioactive tracer isotopes.\nProppants have greater permeability than small mesh proppants at low closure stresses, but will mechanically fail (i.e. get crushed) and produce very fine particulates (\"fines\") at high closure stresses such that smaller-mesh proppants overtake large-mesh proppants in permeability after a certain threshold stress.\nThough sand is a common proppant, untreated sand is prone to significant fines generation; fines generation is often measured in wt% of initial feed. One manufacturer has claimed untreated sand fines production to be 23.9% compared with 8.2% for lightweight ceramic and 0.5% for their product. One way to maintain an ideal mesh size (i.e. permeability) while having sufficient strength is to choose proppants of sufficient strength; sand might be coated with resin, to form curable resin coated sand or pre-cured resin coated sands. In certain situations a different proppant material might be chosen altogether—popular alternatives include ceramics and sintered bauxite.\nProppant weight and strength\nIncreased strength often comes at a cost of increased density, which in turn demands higher flow rates, viscosities or pressures during fracturing, which translates to increased fracturing costs, both environmentally and economically. Lightweight proppants conversely are designed to break the strength-density trend, or even afford greater gas permeability. Proppant geometry is also important; certain shapes or forms amplify stress on proppant particles making them especially vulnerable to crushing (a sharp discontinuity can classically allow infinite stresses in linear elastic materials).\nProppant deposition and post-treatment behaviours\nProppant mesh size also affects fracture length: proppants can be \"bridged out\" if the fracture width decreases to less than twice the size of the diameter of the proppant. As proppants are deposited in a fracture, proppants can resist further fluid flow or the flow of other proppants, inhibiting further growth of the fracture. In addition, closure stresses (once external fluid pressure is released) may cause proppants to reorganise or \"squeeze out\" proppants, even if no fines are generated, resulting in smaller effective width of the fracture and decreased permeability. Some companies try to cause weak bonding at rest between proppant particles in order to prevent such reorganisation. The modelling of fluid dynamics and rheology of fracturing fluid and its carried proppants is a subject of active research by the industry.\nProppant costs\nThough good proppant choice positively impacts output rate and overall ultimate recovery of a well, commercial proppants are also constrained by cost. Transport costs from supplier to site form a significant component of the cost of proppants.\nOther components of fracturing fluids\nOther than proppant, slickwater fracturing fluids are mostly water, generally 99% or more by volume, but gel-based fluids can see polymers and surfactants comprising as much as 7 vol%, ignoring other additives. Other common additives include hydrochloric acid (low pH can etch certain rocks, dissolving limestone for instance), friction reducers, guar gum, biocides, emulsion breakers, emulsifiers, and 2-Butoxyethanol.\nRadioactive tracer isotopes are sometimes included in the hydrofracturing fluid to determine the injection profile and location of fractures created by hydraulic fracturing. Patents describe in detail how several tracers are typically used in the same well. Wells are hydraulically fractured in different stages. Tracers with different half-lives are used for each stage. Their half-lives range from 40.2 hours (lanthanum-140) to 5.27 years (cobalt-60). Amounts per injection of radionuclide are listed in The US Nuclear Regulatory Commission (NRC) guidelines. The NRC guidelines also list a wide range of radioactive materials in solid, liquid and gaseous forms that are used as field flood or enhanced oil and gas recovery study applications tracers used in single and multiple wells.\nIn the US, except for diesel-based additive fracturing fluids, noted by the American Environmental Protection Agency to have a higher proportion of volatile organic compounds and carcinogenic BTEX, use of fracturing fluids in hydraulic fracturing operations was explicitly excluded from regulation under the American Clean Water Act in 2005, a legislative move that has since attracted controversy for being the product of special interests lobbying.\nSee also\n* List of additives for hydraulic fracturing\n* Hydraulic fracturing and radionuclides\nReferences"
    }
  ]
}