{
  "content": [
    {
      "type": "text",
      "text": "# Fractal (software)\n\n| discontinued =\n| ver layout =\n| latest release version =\n| latest release date = }}\n| latest preview version =\n| latest preview date =\n| programming language = Rust\n| operating system =\n| platform = Unix-like\n| size =\n| language =\n| language count = 26\n| language footnote =\n| genre = IM, chat\n| license = GPLv3\n| standard = Matrix\n| AsOf =\n}}\nFractal is an instant messaging client and collaboration software for the GNOME desktop based on the Matrix protocol.\nIt is free software under the GNU General Public License version 3.\nFractal can be installed on various Linux distributions via Flathub, which is the recommended installation method, although some distributions provide packages through their official repositories.\nFeatures\nFractal integrates well into the GNOME desktop with a clean and easy-to-use user interface design that is optimized for collaboration in big groups. The functionality was still limited in early releases from spring 2018, when features such as video chat and end-to-end encryption were missing.\nThe user interface targets both smartphones and desktop systems and adapts to different screen sizes and formats.\nArchitecture\nFractal is written in Rust and has a graphical user interface that, like software for GNOME, is based on the GTK widget toolkit. For the adaptive user interface, it uses a software library called Libadwaita. Logon credentials can be stored in any local password manager that provides the Secret Service API. The functionality is to be split into separate frontends for mass chat and personal instant messaging using a common backend, tentatively called Discussions and Messages, respectively.\nHistory\nThe first code was committed to Fest (formerly known as ruma-gtk) on December 29, 2016, from which the Fractal codebase was forked by Daniel García Moreno in August 2017. For the first release (v0.1.0) on November 10, 2017, it was called Guillotine.\nWith the release of version 0.1.22 on March 27, 2018, it entered beta status. With GNOME version 3.30 of September 5, 2018, it reached release status.\nOver that summer, two students worked on Fractal, which was sponsored as part of the Google Summer of Code program, including the development of localization and spell-checking support. Computer manufacturer Purism is working to integrate it into the crowd-funded Linux smartphone Librem 5, scheduled for market release in \"Q4 2019\". Purism is therefore sponsoring the development of some features such as support for Matrix' end-to-end encryption (E2EE) that was standardized in 2018. E2EE is implemented as a separate software module whose basic functionality was available by autumn 2018.\n}}\nExternal links\n*\n*[https://gitlab.gnome.org/GNOME/fractal Source code repository]"
    }
  ]
}