{
  "content": [
    {
      "type": "text",
      "text": "# Fragments: Memories of a Wartime Childhood\n\n}}\nFragments: Memories of a Wartime Childhood is a 1995 book, whose author used the pseudonym Binjamin Wilkomirski, which purports to be a memoir of the Holocaust. It was debunked by Swiss journalist and writer  in August 1998. The subsequent disclosure of Wilkomirski's fabrications sparked heated debate in the German- and English-speaking world. Many critics argued that Fragments no longer had any literary value. Swiss historian and anti-Semitism expert Stefan Maechler later wrote, \"Once the professed interrelationship between the first-person narrator, the death-camp story he narrates, and historical reality are proved palpably false, what was a masterpiece becomes kitsch.\" The controversy was the origin of the term Wilkomirski syndrome for similar cases of fraud.\nSummary\nWilkomirski's supposed memories of World War II are presented in a fractured manner and using simple language from the point of view of the narrator, an overwhelmed, very young Jewish child. His first memory is of a man being crushed by uniformed men against the wall of a house; the narrator is seemingly too young for a more precise recollection, but the reader is led to infer that this is his father. Later on, the narrator and his brother hide out in a farmhouse in Poland before being arrested and interned in two Nazi concentration camps, where he meets his dying mother for the last time. After his liberation from the death camps, he is brought to an orphanage in Kraków and, finally, to Switzerland where he lives for decades before being able to reconstruct his fragmented past.\nAuthor and publication\nBinjamin Wilkomirski, whose real name is Bruno Dössekker (born Bruno Grosjean; 12 February 1941 in Biel/Bienne), is a musician and writer. In 1995, Wilkomirski, a professional clarinettist and instrument maker living in the German-speaking part of Switzerland, published a memoir entitled Bruchstücke. Aus einer Kindheit  1939–1948 (later published in English as Fragments: Memories of a Wartime Childhood). In the book, he described what he falsely claimed were his experiences as a child survivor of the Holocaust.\nFirst published in German in 1995 by the Jüdischer Verlag (part of the highly respected Suhrkamp Verlag publishing house), Bruchstücke was soon translated into nine languages; an English translation by Carol Brown Janeway with the title Fragments appeared in 1996, published by Schocken. The book earned widespread critical admiration, most particularly in Switzerland and in the English-speaking countries, and won several awards, including the National Jewish Book Award in the United States, the Prix Mémoire de la Shoah in France, and the Jewish Quarterly literary prize in Britain. The book sold well, but contrary to common belief it was not a bestseller.\nWilkomirski was invited to participate in radio and television programs as a witness and expert, and was interviewed and videotaped by reputable archives. In his oral statements Wilkomirski elaborated on many aspects which remained unclear or unexplained. For example, he provided the names of the concentration camps in which he claimed to have been interned (Majdanek and Auschwitz), and added that he had been the victim of unbearable medical experiments.\nExposure\nGanzfried\nIn August 1998, a Swiss journalist and writer named  questioned the veracity of Fragments in an article published in the Swiss newsweekly Weltwoche. Ganzfried argued that Wilkomirski knew the concentration camps \"only as a tourist\", and that, far from being born in Latvia, he was actually born Bruno Grosjean, an illegitimate child of an unmarried mother named Yvonne Grosjean from Biel in Switzerland. The boy had been sent to an orphanage in Adelboden, Switzerland, from which he was taken in by the Dössekkers, a wealthy and childless couple in Zürich who finally adopted him.\nWilkomirski had become a cause célèbre in the English-speaking world, appearing on 60 Minutes and the BBC and in Granta and The New Yorker. He insisted that he was an authentic Holocaust survivor who had been secretly switched as a young boy with Bruno Grosjean upon his arrival in Switzerland. His supporters condemned Ganzfried, who nonetheless presented further evidence to support his theory. Wilkomirski could not verify his claims, but Ganzfried was also unable to prove his arguments conclusively.\nMaechler\nIn April 1999, Wilkomirski's literary agency commissioned the Zürich historian Stefan Maechler to investigate the accusations. The historian presented his findings to his client and to the nine publishers of Fragments in the autumn of that year. Maechler concluded that Ganzfried's allegations were correct, and that Wilkomirski's alleged autobiography was a fraud.\nMaechler described in detail in his report how Grosjean-Wilkomirski had developed his fictional life story step-by-step and over decades. He discovered that Wilkomirski's alleged experiences in German-occupied Poland closely corresponded with real events in his childhood in Switzerland, to the point that he suggested the author rewrote and reframed his own experience in a complex manner, turning the occurrences of his real life into that of a child surviving the Holocaust.\nIt remained unclear to Maechler whether Grosjean-Wilkomirski had done this deliberately or if the writer actually believed what he had written, but he was skeptical that the writer was a \"cold, calculating crook\", as Ganzfried assumed. Amongst other things, Maechler revealed that a Holocaust survivor Wilkomirski claimed to have known in the camps, a woman named Laura Grabowski, had been earlier unearthed as a fraud, and had previously used the name Lauren Stratford to write about alleged satanic ritual abuse—a story which itself had been debunked nearly a decade earlier.\nMaechler's first report was published in German in March 2000; the English edition appeared one year later and included the original English translation of Fragments which had been withdrawn by the publisher after Maechler's report. Subsequently, the historian published two essays with additional findings and analysis, while Ganzfried (2002) published his own controversial version of the case. Journalist Blake Eskin covered the affair. Prior to the exposure, Eskin wrote and told the story of Wilkomirski's trip to the US to become reunited with people he claimed to be distant family, of which Eskin was a part. This story was aired in act two of This American Life episode 82, \"Haunted\".   The writer Elena Lappin published an extensive report in May 1999. She had become acquainted with Wilkomirski two years before, when the Jewish Quarterly awarded him its prize for nonfiction. At the time, she was editor of that English magazine. In the course of her research, she identified a number of contradictions in Wilkomirski's story and came to believe that Fragments was fiction.\nIn addition, she reported that Wilkomirski's uncle, Max Grosjean, said that as children he and his sister Yvonne (Wilkomirski's biological mother) had been Verdingkinder (or \"earning children\")—in other words, that they had been part of the old Swiss institution of orphaned children working for families, with overtones of child slavery. Eskin's interest in Wilkomirski had its origins in genealogy: his family had ancestors in Riga and, initially, they believed that the author of Fragments could perhaps be a long-lost relative. In the same year (2002) the public prosecutor of the canton of Zürich announced that she found no evidence of criminal fraud. She added that a DNA test she had ordered had confirmed that Wilkomirski and Grosjean were the same person.\nAftermath\nThe disclosure of Wilkomirski's fabrications altered the status of his book. Many critics argued that Fragments no longer had any literary value. \"Once the professed interrelationship between the first-person narrator, the death-camp story he narrates, and historical reality are proved palpably false, what was a masterpiece becomes kitsch\". But some scholars believe the merits of the work still remain, even as a pseudomemoir. \"Those merits reside in a ferocious vision, a powerful narrative, an accumulation of indelible images, and the unforgettable way in which a small child's voice is deployed in an unfeeling adult world, during the war and thereafter\".\nThe Wilkomirski case was heatedly debated in Germany and Switzerland as a textbook example of the contemporary treatment of the Holocaust and of the perils of using it for one's own causes. However, the affair transcends the specific context of the Holocaust (see e.g. Chambers, 2002; Gabriel, 2004; Langer, 2006; Maechler, 2001b; Oels, 2004; Suleiman, 2006; Wickman, 2007). Wilkomirski's case raises questions about the literary genre of autobiography, the aesthetics of a literary work's reception, oral history, witness testimony, memory research, trauma therapies, and the like. The case is discussed in great detail by psychologists Carol Tavris and Elliot Aronson as an interesting case of self-inflicted false memories.\nThe debate led to the creation of the term Wilkomirski syndrome which has been applied to several other cases. The  held a conference named  in Potsdam in 2001.\nSee also\n* Misha Defonseca (Misha: A Mémoire of the Holocaust Years, 1997)\n* Marie Sophie Hingst (Read On, My Dear, Read On)\n* Enric Marco (Memorias del infierno, 1978)\n* Rosemarie Pence (Hannah: From Dachau to the Olympics and Beyond, 2005)\n* Herman Rosenblat (Angel at the Fence)\n* Donald J. Watt (Stoker, 1995)\nReferences\nBibliography\n* Ross Chambers: \"Orphaned Memories, Foster-Writing, Phantom Pain: The Fragments Affair\", in: Nancy K. Miller and Jason Tougaw (eds.) Extremities: Trauma, Testimony, and Community, Urbana and Chicago: University of Illinois Press, 2002, pp.&nbsp;92–111\n*\n* Daniel Ganzfried: \"Die Holocaust-Travestie. Erzählung\". In: Sebastian Hefti (ed.): ... alias Wilkomirski. Die Holocaust-Travestie. Jüdische Verlagsanstalt, Berlin 2002, pp.&nbsp;17–154,\n* Yiannis Gabriel: \"The Voice of Experience and the Voice of the Expert – Can they Speak to each Other?\" In: Brian Hurwitz, Trisha Greenhalgh, Vieda Skultans (eds.): Narrative Research in Health and Illness, Malden: Blackwell Publishing, 2004, , pp.&nbsp;168–186\n* Lawrence L. Langer: Using and Abusing the Holocaust, Bloomington: Indiana University Press, 2006,\n*\n*\n* Susan Rubin Suleiman: Crises of Memory and the Second World War, Cambridge etc.: Harvard University Press, 2006,\n* Carol Tavris and Elliot Aronson: Mistakes Were Made (but not by me): Why we justify foolish beliefs, bad decisions and hurtful acts, New York: Harcourt, 2007,\n* Matthew Wickman: ''The Ruins of Experience. Scotland's \"Romantik\" Highlands and the Birth of Modern Witness, Philadelphia: University of Pennsylvania Press, 2007,\n* Binjamin Wilkomirski: Fragments. Memories of a Wartime Childhood. Translated from the German by Carol Brown Janeway. New York: Schocken Books, 1996 (reprinted in Maechler, 2001a, pp.&nbsp;375–496)\n* Froma Zeitlin: \"New Soundings in Holocaust Literature: A Surplus of Memory\". In: Moishe Postone and Eric Santer (eds.): Catastrophe and Meaning. The Holocaust and the Twentieth Century''. Chicago and London: The University of Chicago Press, 2003, , pp.&nbsp;173–208\nJournal articles\n* Elena Lappin: 'The Man with Two Heads,' Granta 66 (1999), pp.&nbsp;7–65; published in abridged form as:\n*\n* Timothy Neale (2010): \". . . the credentials that would rescue me': Trauma and the Fraudulent Survivor\". In: Holocaust & Genocide Studies, vol. 24, no. 3, pp.&nbsp;431–48\n*\nExternal links\n*[https://web.archive.org/web/20100902060300/http://www.othervoices.org/2.1/salecl/wilkomirski.html \"Why One Would Pretend to be a Victim of the Holocaust: The Wilkomirski Memoir\"] by Renata Salecl published in Other Voices, v.1 n.3, 2000\n* [https://www.bbc.co.uk/programmes/p00545lr \"Truth, Lies and Fiction\"], BBC Radio 4 In Our Time podcast, 15 July 1999\n*"
    }
  ]
}