{
  "content": [
    {
      "type": "text",
      "text": "# Franco-German war of 978–980\n\nThe Franco-German war of 978–980 was fought over possession of Lotharingia and over personal honour. In the summer of 978, King Lothair of West Francia (France) launched a surprise attack on Aachen, almost capturing the Emperor Otto II, king of East Francia (Germany) and of Italy. By autumn Lothair had returned to West Francia, while Otto had convoked a diet and assembled an army. To avenge his honour, Otto invaded West Francia. Unable to take Paris after a brief siege, he returned to Lotharingia. During his retreat, after the bulk of his army had crossed the river Aisne, the West Franks caught up to his baggage train and slaughtered it. In 980, the kings made peace. Lothair renounced his claim to Lotharingia.\nBackground\nIn the years 976–978, Otto II was beset by simultaneous unrest in the southeast and northwest of Germany and by the machinations of his West Frankish neighbour. It is probable that there was some coordination between his opponents. In 977, Otto was victorious in the War of the Three Henries. That same year, he appointed Lothair's exiled brother Charles to the duchy of Lower Lotharingia. This was an insult to Lothair, who had his own claims to Lotharingia. Perhaps also perceived as a slight at Lothair's court at this time was the sidelining by Otto of his mother, Adelaide, who was also the mother of Lothair's queen, Emma, Otto's half-sister.\nIn 978, Otto turned against the Reginarids in the northwest. This campaign ended in a compromise with the brothers Reginar and Lambert, who claimed the county of Hainaut. Otto was resting in Aachen after this campaign when he was surprised by the West Frankish invasion. The Annals of Niederaltaich claim that Reginar and Lambert instigated Lothair to attack, a claim which may find support in a letter of Gerbert of Aurillac.\nThe earliest narrative account of the war is found in the Annals of Saint Gall, according to which Lothair was disputing the border between his kingdom and Otto's when he decided to invade Lotharingia. Lotharingia had been annexed by East Francia from West Francia in 925. It was divided into Lower Lotharingia and Upper Lotharingia in 959. In May 978, the duke of Upper Lotharingia, Frederick I, died and was succeeded by his underage son, Theoderic I. This created an opportunity for Lothair to attack. It also brought Lothair's interests into alignment with those of Hugh Capet, his most powerful subject, whose sister, Beatrice, was the widow of Duke Frederick and who therefore regarded Charles as a rival of his nephew in Lotharingia. By contrast, in conflicts in 940 and 946 between Lothair's father (Louis IV) and Otto's father (Otto I), Hugh's father (Hugh the Great) had sided with Otto.\nCourse\nFrench invasion\nLothair, with a large suite of bishops, visited Dijon, the seat of Hugh's brother, Duke Henry I of Burgundy, in March 978. Shortly after, he convoked an assembly at Laon to approve his planned invasion of Lotharingia. It was approved without debate. The target, Aachen, was to be kept secret from the troops until the last moment.  According to Richer of Reims, the assembled army numbered 20,000, which is certainly an exaggeration.\nIn August 978,  Lothair launched a surprise invasion of Lotharingia, striking for Aachen to capture the Emperor Otto II and Empress Theophanu. He was accompanied by his most powerful vassals, Hugh Capet and Henry of Burgundy. It is not clear from the sources if seizing the imperial couple was Lothair's original intention, or if in striking towards Aachen he was merely taking advantage of the couple's presence during a broader effort to seize all of Lotharingia. According to Richer, Lothair was more offended that Otto \"did not hesitate to approach his borders\" than that the latter was in occupation of the disputed territory. That this was Lothair's primary motivation, however, seems unlikely, since Otto is known to have visited Aachen in July 973 and Easter 975 without incident.\nWhen Otto was first alerted the invasion, he did not believe the reports. It was only when Lothair was almost at the gates of the city that he and Theophanu made their escape to Cologne. Lothair occupied the palace of Aachen without resistance. According to the History of the Franks of Sens, he met no resistance. He permitted his troops to loot the palace and he ordered the bronze eagle on the roof turned to face the other way. According to Richer, the Germans had made it face west as an indication of their ability to invade West Francia at any time; Lothair turned it back to the east to indicate the opposite. Thietmar of Merseburg, on the other hand, says that Lothair turned it to face west, since whoever held Aachen traditionally made the eagle to face their kingdom. It is clear from the conflicting accounts that while the intent of Lothair's gesture was well-known, the particular meaning of it was not and the directionality of the eagle probably had no real traditional significance.\nA lack of provisions forced Lothair to abandon Aachen after three days. He pillaged the palace before leaving. Having lain claim to all the land between the Moselle and the Rhine after his victory, according to the Annals of Saint Gall, he tried and failed to take Metz. There he was opposed by the bishop, Theoderic, who wrote a letter urging Otto II to respond in kind to Lothair's insolence. By the autumn, Lothair had retreated to West Francia with the intention of returning to Lotharingia. The History of the Franks of Sens indicates that the Germans did not pursue him.\nGerman counter-invasion\nAccording to the Gesta episcoporum Cameracensium, Otto swore revenge on Lothair. He convoked a general assembly of the whole empire. According to Alpert of Metz, noblemen from every region, including Italy, attended. They agreed that West Francia could not be allowed to raid the empire with impunity and counselled Otto to respond. The Gesta reports that the emperor sent an envoy to Lothair with what amounted to a declaration of war, promising to invade his kingdom on 1 October.\nAccording to the Annals of Saint Gall, Otto invaded West Francia with 30,000 horsemen. When he crossed the border, Lothair retreated to Étampes. Otto sacked the royal palaces at Compiègne and Attigny, seized Laon and was unopposed at Reims and Soissons. The Annals depict the Germans ravaging the West Frankish countryside. The Gesta, however, contrasts the good conduct of the German army with the pillaging and carousing of the West Franks. It credits Otto with sparing churches and even giving them donations. On this last point, the West Frankish historian Richer agrees, praising Otto for his good treatment of the churches and describing his anger when his troops destroyed the nunnery of Sainte-Balthilde-de-Chelles.\nOtto set up Charles as king in opposition to Lothair, a fact known only from a pair of angry letters exchanged between Charles and Bishop Theoderic of Metz in 984. Both letters were written by Gerbert of Aurillac, who later apologized to Theoderic for the tone of Charles's letter. Otto's failed attempt to replace Lothair is ignored in all the narrative accounts of the war, but it may explain why Hugh Capet remained loyal to the latter in 978.\nOtto devastated the suburbs of Paris, pitched his camp on Montmartre and began a siege. He had a priestly choir chant the Alleluia in front of the city to demonstrate his glory. What happened at the siege is a matter of disagreement. According to the History of the Franks of Sens, one of Otto's nephews promised to break his lance on the doors only to be killed at the gate. Lothair, Hugh and Henry then sallied and put the Germans to flight, pursuing them as far as Soissons, killing multitudes. Richer, probably in mere imitation of classical models, records an instance single combat before the gates of Paris. This story became amplified in legend and incorporated into the Gesta consulum Andegavorum and Chronique de Nantes, the family histories of the dukes of Brittany and the counts of Anjou.\n, depicting Lothair falling on Otto's troops at the Aisne]]\nUnable to take Paris, Otto retreated to Lotharingia in November 978. The bulk of his army had crossed the river Aisne when some West Frankish pursuers fell on the baggage train. In the resultant chaos, many lives were lost. According to the History of the Franks of Sens, so many were the corpses that they clogged the river and it overran its banks. Brun of Querfurt blames the slaughter on the troops' gluttony and drunkenness.\nPeace\nIn 979, Lothair was preoccupied by a local dispute in Flanders. In 980, Otto sued for peace. The kings met at Margut on the border and Lothair renounced any claim on Lotharingia. Thietmar writes that Lothair obtained Otto's friendship by going to him with gifts. According to Richer, Lothair reconciled with Otto to gain his support against his main internal rival, Hugh Capet. The exclusion of Hugh from the terms of the treaty reached at Margut meant that he remained unreconciled to Charles and at odds with Lothair for the remainder of the latter's reign.\nThe peace did not long outlive Otto II, who died in 983. Lothair attended the court held at Quedlinburg during Easter 984 by Henry the Quarrelsome, regent for the young Otto III. In 985, he violated the peace and seized Verdun. His death the following year (986), followed closely by that of his son, Louis V (987), ended the conflict over Lotharingia. Hugh Capet was elected king of West Francia and handed back Verdun.\nNotes\nBibliography\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*"
    }
  ]
}