{
  "content": [
    {
      "type": "text",
      "text": "# Frances Manwaring Caulkins\n\n| language = English\n| residence =\n| education        =\n| alma_mater       =\n| period           =\n| genre            =\n| subject          =\n| movement         =\n| notable_works    =\n| spouse =\n| partner          =\n| children         =\n| parents         =\n| relatives        =\n| awards           =\n| signature        = Frances M. Caulkins signature.png\n}}\nFrances Manwaring Caulkins (April 26, 1795 – 1869) was a 19th-century American historian and genealogist, the author of histories of New London, Connecticut and Norwich, Connecticut. Through her father, she was descendant of Hugh Caulkins, who came with Richard Blinman, the first minister of the Plymouth Colony. On her mother's side, her ancestry was noted in early English history, Sir Ranulphus de Manwaring being justice of Chester, in 1189–99; another, Sir William, was killed in the streets of Chester, defending Charles I on October 9, 1644. Her father died before Fanny was born, and her uncle, Christopher Manwaring, was exceedingly fond of his talented niece, aiding her with his library, and for seven years, she lived with him. When she wanted to start teaching, he set apart a room as her schoolroom. The first of her writings, now known to have been printed, appeared in the Connecticut Gazette on April 17, 1816.\nIn 1849, Caulkins was the first woman elected to be a member of the oldest historical society in the United States, the Massachusetts Historical Society. Her histories of New London and Norwich aggregated the prominent features and details of the lives of the earliest inhabitants. Her private papers show that she was sometimes affected by depression, and especially felt that she had accomplished very little in life.\nFamily background and education\nFrances (nickname, \"Fanny\") Manwaring Caulkins was born in New London, Connecticut, on April 26, 1795. She was the daughter of Joshua and Fanny (Manwaring) Caulkins. Her ancestry, on the paternal side, can be traced to the early settlers of the vicinity of Plymouth. Richard Blinman, minister in Chepstow, Monmouthshire, England, having been silenced for non-conformity to the established church, migrated to the United States, and is supposed to have arrived at Plymouth in autumn 1640. He was accompanied in his voluntary exile by several members of his church, with their families, and all taken together were styled the \"Welch party\". Monmouthshire borders upon Wales, and probably most of them were of Welsh origin, but English appears to have been their native language. The exact time of their arrival is not known, but a part of them, including Rev. Blinman and Hugh Cauken, were propounded for freemanship at Plymouth on March 2, 1640, which was too early for any immigrant vessel to have arrived that year. In the first New England record, the family name is written as Cauken. It was stated by a writer in the Register that the original name was probably Colkin. William Colkin lived in King John's reign (1199–1216) and founded a hospital in Canterbury, which bore his name. The Caulkins and Gookings, with the different variations and changes in the spelling and pronunciation of the names, were all probably descended from a Colkin. Subsequently, there is great diversity, even among acknowledged relatives of the same stock, in spelling the name; some using u and s, and others rejecting one or both of these letters.\nJoshua Caulkins, the fifth child of Jonathan and Lydia, was born on January 19, 1772. He married Fanny Manwaring in 1792, by whom he had two children, and died of yellow fever at Port-au-Prince early in 1795, while on a trading voyage to the island of Saint-Domingue. Their second child, Frances Manwaring Caulkins, was born a few months later, on April 26, 1795. Their first child was Pamela (1793–1883).\nDuring 1806, she became the student of Rev. Joshua Williams, who taught a select school for young ladies in Norwichtown. While attending this school, before she turned twelve years old, she patiently wrote out from memory a volume of educational lectures as they were delivered, from week to week. The elements of science which she acquired at this time were the foundation of all her future knowledge and attainments in literature; for, with occasional opportunities of instruction from the best teachers, she was yet in a great measure self-taught; and when once aided in the rudiments of a study or language would, herself, make all the progress she desired. She was an insatiable reader. While she enjoyed fiction and works of a lighter character, her taste for solid reading was early developed, and at eleven years of age, she was familiar with the English translation of the Iliad and Odyssey, and the thoughts of the standard English writers of the seventeenth and eighteenth centuries. The beginnings of the strong affection for historical literature which characterized her later life was seen occasionally in her early years.\nIn 1807, Fanny married Philemon Haven (d. 1819). There was at least one child from this union, Henry Philomen Haven, who was associated with the establishment of New London Public Library.\nIn 1811 and 1812, Nancy Maria Hyde and Lydia Sigourney were teaching a young ladies' school in Norwich, and Caulkins entered their school in September 1811. Her first composition was on the subject \"Antiquities\". Even after she left the school, Caulkins and Sigourney remained warm friends and frequent correspondents. Caulkins evinced a remarkable aptitude for the acquisition of languages, and with some advantages enjoyed under different teachers, she added private study, and acquired a thorough knowledge of Latin, and was able to read and teach both that language and the French with facility and acceptance.\nA considerable portion of her time, from 1812 to 1819, while her mother resided in Norwich, was spent by her in the family of her uncle Christopher Manwaring at New London. He was a great admirer of Alexander Pope, Samuel Johnson and the old English authors. He had a good library and became very fond of the society of his niece, and proud of her talents. He was a friend of James Madison and an early admirer of Andrew Jackson. Caulkins had shown an unusual talent for versification as well as for prose writing, but she did not receive encouragement from the family to produce works for publication. Among her manuscripts are many fugitive pieces of poetry without date, but evidently written in early life. The first, in apparently the oldest book, is entitled the \"Indian Harp\", and would do credit to her later years. The fourth in order, in this book, is a long poem on \"Thanksgiving\" and the only one dated. This is stated to have been written in 1814. One earlier piece is on a loose sheet, dated October 26, 1813, and entitled \"The Geranium's Complaint\". The first of her writings, now known to have been printed, appeared in the Connecticut Gazette on April 17, 1816.\nCareer\nAfter her step-father's death in 1819, having before this been occasionally employed in teaching small schools, Caulkins became determined to support herself and, if necessary, to aid her mother. On January 4, 1820, she opened a select school for young ladies in Norwichtown. As her talent for teaching was developed, her scholars increased, and the school acquired an excellent reputation and was well sustained for nine years.\nIn 1829, she accepted an invitation from the trustees of the female academy at New-London, to take charge of that institution. She was invited back to Norwich in 1832, and was principal of the academy there, with a large number of pupils, until the close of the year 1834, when she relinquished finally the duties of a teacher. During those fifteen years, she had under her charge nearly 400 young ladies. Among her pupils were the wives of Senators Jabez W. Huntington and William Alfred Buckingham and three daughters of Charles Lathrop, afterwards missionaries to India. Very many of her pupils became themselves teachers. The year following the close of her school she spent visiting her friends and in recreation. She spent some time in the family of Rev. Levi Nelson, of Lisbon, Connecticut, in 1825, for the special purpose of advancing her knowledge of Latin, and took lessons in the French language, from M. Roux. While living in New York City, she pursued the study of German, and under the instructions of Maroncelli, gained such a knowledge of Italian, that she was able to read Dante and Tasso in the originals. In spring 1836, she went to New York and resided in the family of her cousin, D. H. Nevins, until May 1842, when she removed to New London, remaining there until she died.\nDuring her residence in New York, she was intimately acquainted with William Allen Hallock and Mr. Cook, secretaries of the American Tract Society. In 1835, that society published a premium tract entitled, Do your Children reverence the Sabbath? and the following year, The Pequot of a Hundred Years, both written by Caulkins, and of which they had issued 1,058,000 copies. She next prepared for them, in 1841, Children of the Bible, all in verse and original, and, in 1846, ''Child's Hymn-Book, partly a compilation. In 1847, she furnished the Tract Primer, one of the most popular and useful books ever published by that society. They printed 950,000 copies of it in English, and tens of thousands were published in Armenian, and other foreign languages. The society, at a meeting of its publishing committee on April 23, 1849, by vote, invited her to prepare a suitable series of books for children and youth, to follow the Primer. In compliance with this request, she furnished six volumes of Bible-Studies, forming an illustrative commentary on the whole Scriptures, and showing accurate scholarship and biblical research, interesting to the young, but full of valuable information for all who love the word of God. She was five years (from 1854 to 1859) in preparing this series, and contributed to the society, in 1861, one more work, entitled Eve and her Daughters, being sketches of the distinguished women of the Bible in verse. She was also, up to her death a frequent contributor to their American Messenger'', furnishing them, but one week before her death, \"The Aged Emigrant\" — a few verses of poetry — the last line being \"A Steppingstone to Heaven\".\nA deep sense of her religious obligation pervaded her life, and was a part of her literary work. She loved to linger among the graves and written records of people's lives and deeds. She recovered many an almost obliterated tombstone, and preserved its story from oblivion. Nearly every burial place in the county was personally examined and any stone of great age or special interest was faithfully transcribed.\nHer contributions to the local papers of New London were numerous, and with any striking event in the history of the place, or with the decease of any aged or distinguished person, an interesting article was written, in which passing events were interwoven with previous history.Something from the mass of historical and genealogical information which she had accumulated, was first given to the public in the form of a history of the town of Norwich, in 1845. It was a book of 360 pages, with some local illustrations, and was well received and appreciated by the public. In 1852, she published a larger work, The History of New-London, of 672 pages. This was very carefully and thoroughly prepared, and won many commendations from distinguished scholars and antiquaries. In 1860, some of the volumes of this history being still in sheets, twenty pages were added and bound up with the original book, thus giving eight years additional records. Her materials having greatly increased since the issue of the first history of Norwich, and the edition being out of print, she re-wrote the entire work, and a new volume of 700 pages was given to tho public in 1866.\nCaulkins had now become widely known to many of the leading writers, particularly of antiquarians, in different parts of the country. Edward Everett, Robert C. Winthrop, George Bancroft and others frequently corresponded with her, and acknowledged her ability and accuracy. Sylvester Judd, of Northampton, and the Hon. James Savage, of Boston, fully appreciated her historical knowledge, and frequently availed themselves of her stores of information respecting the early colonists of New England. Roger S. Baldwin and Henry White of New-Haven were among those who highly esteemed her works. She was elected to honorary and corresponding membership by several historical societies, which appreciated her historical researches and her accumulated antiquarian lore. At the time of her death, she was the only woman upon whom the Massachusetts Historical Society conferred the honor of membership.\nReligion\nIt is very evident from her early writings that she fully accepted and believed the main doctrines of the Scriptures as they were received and held by her Puritan ancestors. She was profoundly impressed with a sense of her accountability to God, and the responsibility which ever rested upon her to use the talents which He had given her. Within her highest aspirations, she retained a prevailing sense of subjection to the Divine Will. The great doctrines of religion were especially the subject of anxious thought and solemn reflection, from 1826 to 1831. During the latter year, she developed a deep yearning for a knowledge of God.\nUnder the preaching of Rev. Dr. McEwen, pastor of the First Church in New London, she felt a sense of personal sinfulness and need of a divine saviour; and she publicly acknowledged her deliverance from doubts and fears, and her confidence in Jesus as her Redeemer by a public profession of her faith and union with the First Church on July 5, 1831. She immediately engaged in Sunday school work, and gave some time each week to regular Biblical study with her own school. In removing to Norwich, she became connected with the Second Congregational Church there, and, while in New York, united with the Mercer Street Presbyterian Church. After taking up permanent residence at New London, she transferred her connection to the Second Congregational Church in that city in February 1843. She served as secretary of the Ladies' Seamen's Friend Society for more than twenty years.\nDeath and legacy\nNever possessing a strong physical frame, she suffered from a long and slow fever in summer 1866. At this same time, the second edition of her history of Norwich had just gone to the printer, and the last proofs had been corrected. For a time, she slowly regained a comfortable measure of health and strength, and was able to resume her literary labors, which were continued until the last week of her life. She died in New London, Connecticut, on February 3, 1869, and was buried at Cedar Grove Cemetery, New London.\nA large mass of historical information and genealogical notes, and hundreds of pages of moral and religious prose, remain among her manuscripts. Many of her poetical effusions relating to the private affairs of family and life are part of her collection. The most precious papers are a number of pieces written within a few months before her death, the themes being of the coming life. A large collection of autographs —many of them not names alone, but letters of distinguished men and women- attest her interest in that department of antiquarian research; and a valuable assortment of ancient and modern coins had been assiduously gathered during her last fifty years. Specimens of continental currency, with many curious and rare pamphlets and sermons of ancient date, were treasured up, and the peculiar issues of corporate, state and governmental paper, representing fractional parts of a dollar, which were so general in the early years of the American Civil War, were to a good extent preserved in a specimen book. A mass of genealogical and antiquarian lore remained in manuscript in the possession of her relatives.\nSelected works\nReferences\nAttribution\n*  }}\n*  }}\n*  }}\n*  }}\n*  }}\n*  }}\nBibliography\n*\nExternal links\n*"
    }
  ]
}