{
  "content": [
    {
      "type": "text",
      "text": "# Francis Kingsley Ato Codjoe\n\n| birth_place         =  Ekumfi Essarkyir, Ghana\n| death_date          =\n| death_place         =\n| restingplace        =\n| restingplacecoordinates =\n| birthname           =\n| nationality         = Ghanaian\n| party               = New Patriotic Party\n| otherparty          =\n| spouse              =\n| partner             =\n| relations           =\n| children            =\n| residence           =\n| alma_mater          = University of Ghana\n| occupation          = Politician\n| profession          = Country Controller\n| cabinet             =\n| committees          =\n| portfolio           =\n| signature           =\n| signature_alt       =\n| website             =\n| footnotes           =\n}}\nFrancis Kingsley Ato Codjoe (born 31 July 1971) was a Ghanaian politician and member of the Seventh Parliament of the Fourth Republic of Ghana representing the Ekumfi Constituency in the Central Region on the ticket of the New Patriotic Party. He is a former Deputy Minister for Fisheries and Aquaculture Development.\nEarly life and education\nCodjoe was born on 31 July 1971 and hails from Ekumfi Essarkyir in the Central Region of Ghana. He graduated with a bachelor's degree in finance from the University of Ghana.\nCareer\nCodjoe was the country controller of NCR (Ghana) Limited in Accra.\nPolitics\nCodjoe is a member of the New Patriotic Party.\n2016 election\nIn the 2016 Ghanaian general election, he won the Ekumfi Constituency parliamentary seat with 12,240 votes making 50.1% of the total votes cast whilst the NDC parliamentary candidate Abeiku Crentsil had 11,632 votes making 47.6% of the total votes cast, the PPP parliamentary candidate Stephen Quansah had 505 votes making 2.1% of the total votes cast and the CPP parliamentary candidate Kweku Essuoun had 70 votes making 0.3% of the total votes cast.\nMinister\nCodjoe was the Deputy Minister for Fisheries & Aquaculture from 11 April 2017 to 7 January 2021.\n2020 election\nIn the 2020 Ghanaian general election, he lost the Ekumfi Constituency parliamentary seat to the NDC parliamentary candidate Abeiku Crentsil. He lost with 13,468 votes making 45.0% of the total votes cast whilst Abeiku had 16,037 votes making 53.6% of the total votes cast, the GUM parliamentary candidate Regina Amoah had 371 votes making 1.2% of the total votes cast and the CPP parliamentary candidate Ibrahim Anderson had 0 vote making 0.0% of the total votes cast.\nPersonal life\nCodjoe is a Christian.\nReferences"
    }
  ]
}