{
  "content": [
    {
      "type": "text",
      "text": "# Frank King (British Army officer)\n\n|image=\n|alt=\n|caption=\n|nickname=\n|birth_date=\n|birth_place= Brightwell-cum-Sotwell, Berkshire\n|death_date=\n|death_place=\n|placeofburial=\n|allegiance= United Kingdom\n|branch= British Army\n|serviceyears= 1939–1978\n|servicenumber= 138204\n|rank= General\n|unit= Royal Welch FusiliersRoyal FusiliersReconnaissance CorpsParachute RegimentWiltshire Regiment\n|commands= NATO Northern Army Group and British Army of the Rhine (1976–1978)General Officer Commanding Northern Ireland (1973–1975)Army Strategic Command (1971–1972)Royal Military College of Science, Shrivenham (1969–1971)Army Air Corps (1967–1968)11th Infantry Brigade (1963–1965)2nd Battalion, The Parachute Regiment (1960–1962)\n|battles= Second World WarUnited Nations Operation in the CongoThe Troubles\n|awards= Knight Grand Cross of the Order of the BathMember of the Order of the British Empire\n|relations= Major General Dair Farrar-Hockley (son-in-law)\n|laterwork= Company Chairman\n}}\nGeneral Sir Frank Douglas King,  (9 March 1919 – 30 March 1998) was a British Army officer who served as General Officer Commanding of the British Army in Northern Ireland at the height of the Troubles. He held a number of other senior posts in the British Army, having begun his military career in the ranks during the Second World War.\nEarly life and Second World War\nKing was born on 9 March 1919 in Brightwell, which was then in Berkshire, where his parents, Arthur and Kate King, were farmers. He was educated at Wallingford Grammar School, and but for the outbreak of the Second World War would have carried on the family farm. Initially in the ranks of a Territorial Army unit, he was commissioned into the Royal Welch Fusiliers as a second lieutenant on 4 July 1940. Now a war substantive lieutenant, he briefly transferred to the Royal Fusiliers from 14 June 1941, and then to the Reconnaissance Corps on 15 July, and finally to the Parachute Regiment on 19 October 1943. He participated in Operation Market Garden, and was wounded and taken prisoner of war at Arnhem.\nPost-war\nKing was selected for staff training, and was one of the first students to pass through the Royal Military College of Science, Shrivenham Technical Staff course in 1946; he was then granted a regular commission as a lieutenant in the Wiltshire Regiment on 22 February 1947 (with seniority from 7 November 1941), and he was subsequently promoted to captain from the same date (with seniority from 1 July 1946). 1947 also saw his marriage to Joy Emily Ellen Taylor-Lane.  In 1950 he passed the General Staff course at Staff College, Camberley, he also qualified as pilot, He was promoted major on 7 May 1953 (with seniority from 9 March 1953). For two years prior to this he had served as a General Staff Officer Grade II in the Infantry Directorate at the War Office, working on standardisation of infantry weapons with his Belgian, Canadian and American counterparts, this work led to his appointment as a Member of the Order of the British Empire (MBE) in the 1953 Coronation Honours. He transferred back to the Parachute Regiment on 31 May 1958, serving as second-in-command of the 1st battalion. After a brief spell as Assistant Military Secretary at the War Office, he was promoted to lieutenant colonel on 1 April 1960, and became commanding officer of 2nd Battalion, The Parachute Regiment, based in Cyprus and Bahrain, and also during its participation in the British intervention in Kuwait.\nKing was promoted colonel on 10 December 1962, and then commanded the 11th Infantry Brigade group, based at Minden in Germany, from 1963 to 1965. He became Military Adviser (Overseas Equipment) in the Ministry of Defence in 1965, and was promoted brigadier on 17 December 1965, continuing in the same role for the rest of 1966. On 1 January 1967 he was promoted major general and appointed Director, Land/Air Warfare, and Commandant of the Army Air Corps. On 5 August 1968 he became Director, Military Assistance Overseas, back at the Ministry of Defence, stepping down on 15 May 1969. He was then appointed Commandant of the Royal Military College of Science on 10 July 1969, and in the 1971 New Year Honours was appointed a Companion of the Order of the Bath (CB), he relinquished the post on 1 October 1971. It was widely expected that given his technical background he would become Master-General of the Ordnance; but his command experience was equally strong and as a result, on promotion to lieutenant general on 1 November 1971 (with seniority from 2 February 1971), he was appointed General Officer Commanding-in-Chief, Army Strategic Command, and in the 1972 New Year Honours was promoted to Knight Commander of the Order of the Bath (KCB). The home commands were abolished in 1972, and so on 1 April King became Deputy Commander-in-Chief UK Land Forces, subordinate to General Sir Basil Eugster, the Commander-in-Chief, he stepped down on 15 January 1973.\nNorthern Ireland\nOn 1 February 1973 King succeeded Sir Harry Tuzo as GOC Northern Ireland and Director of Operations. This was the worst period of the Troubles, nearly 12,000 bombing and shooting incidents had occurred the year before King's appointment, but by the end of his period in command, the figure was down to just under 2,500 a year. His obituary in The Times states that he \"was regarded by many as the best and most successful Director of Operations in Northern Ireland in the 1970s and 1980s\", though it also notes that he himself would be happy to attribute much of the preparatory work to Tuzo (who has been described in similar terms). His success was attributable to a number of factors: he regularly visited the troops on the ground which gave him a good picture of the difficulties faced in particular areas; once a unit or commander had proved itself, he was happy to delegate considerable authority, in particular to his immediate subordinate, Commander Land Forces (Sir) Peter Leng; he had a good relationship with the Secretary of State for Northern Ireland, Merlyn Rees, who said of King \"You have never played at politics and I have never played at being a soldier; that's why we have got on so well.\" He was replaced in the post by Lieutenant-General Sir David House on 1 August 1975. King was promoted to Knight Grand Cross of the Order of the Bath (GCB) in the 1976 New Year Honours.\nLater career and retirement\nOn 20 January 1976, King was granted local rank as general, and appointed Commander NATO Northern Army Group and Commander-in-Chief British Army of the Rhine, again succeeding Tuzo. He was promoted to substantive general on 16 March 1976 (with seniority from 1 September 1975). He delivered the Kermit Roosevelt lectures in the United States' staff colleges in 1977, and relinquished his appointment on 30 September 1978, and retired from the army on 27 December 1978.\nIn addition to his command roles, King held the largely honorary appointments of colonel commandant of the Army Air Corps from 1 November 1974 to 1 January 1980, and of Aide de Camp General to the Queen from 1977 to his retirement.\nFollowing his retirement from the army, he served as a director and company chairman for a variety of firms, was chairman of the Arnhem Veterans' Association, and kept in close contact with the Parachute Regiment. He died on 30 March 1998, and was honoured with a memorial service at the Royal Garrison Church, Aldershot Garrison on 8 June 1998.\nReferences\n|-\n|-\n|-\n|-"
    }
  ]
}