{
  "content": [
    {
      "type": "text",
      "text": "# Frank Edwards (writer and broadcaster)\n\nFrank Allyn Edwards (August 4, 1908 – June 23, 1967) was an American writer and broadcaster, and one of the pioneers in radio. He hosted a radio show broadcast across the United States in the 1940s and 1950s. Late in his life, he became additionally well known for a series of popular books about UFOs and other paranormal phenomena.\nBiography\nEarly life and career\nFrank Edwards was born in Mattoon, Illinois. Edwards broadcast on pioneering radio station KDKA in the 1920s, making him one of the earliest professional radio broadcasters.\nDuring the 1930s, Edwards continued his career in radio, but also worked a variety of other jobs, including a stint as a professional golfer. He was hired by the US Treasury Department during World War II to promote war bond sales.\nNational radio, UFOs and controversy\nAfter WWII, the Mutual Broadcasting System hired Edwards to host a nationwide news and opinion program sponsored by the American Federation of Labor. Edwards' program was a success, and became nationally popular.\nIn 1948, Edwards received an advance copy of \"Flying Saucers Are Real,\" a magazine article written by retired U.S. Marine Corps Major Donald E. Keyhoe. Though already interested in the UFO reports that had earned widespread publicity since 1947, Edwards was captivated by Keyhoe's claims that the US military knew the saucers were actually extraterrestrial spaceships.\nEdwards began mentioning UFOs on his radio program, and wrote several books on the subject.\nHe was dismissed from the radio program in 1954, for reasons that remain uncertain. His interest in UFOs was believed to be a factor, but Edwards's editor and friend Rory Stuart wrote, \"[AFL President] George Meany insisted that Frank Edwards not mention any [competing labor union] CIO labor leaders on his program. He flatly refused and was fired.\" In spite of thousands of letters in protest of his dismissal, Edwards was not reinstated.\nLater career\nAfter his dismissal from Mutual, Edwards continued working in radio, mostly at smaller local stations. He created and hosted a syndicated radio program, Stranger Than Science, which discussed UFOs and other Forteana. In 1959, he published a book with the same title, largely a collection of his radio broadcasts.\nFrom 1955 to 1959 and from 1961 to 1962, Edwards served as a commentator for WTTV television in Indianapolis. He was on radio station WXLW, also in Indianapolis, in 1964 and returned to television on WLWI in 1965. His book \"Strange People\" recalls a television interview that was videotaped on October 3, 1961, with psychic Peter Hurkos. It is not known if any of these programs survive. During his time at WTTV, his program was the subject of experiments in subliminal advertising during 1958. The movie preceding his show contained the subliminal message \"Watch Frank Edwards\" inserted along with similar messages for bacon. Neither was a success in changing viewer habits. It is unknown if Edwards knew of the experiments.\nEdwards was a frequent contributor to Fate Magazine, and wrote the introduction to their compendium \"Strange Fate\".\nEdwards made an appearance on the Johnny Carson-era Tonight Show in October 1966. The episode was guest-hosted by singers Steve Lawrence and Eydie Gorme. Although Carson saved videos of the show past 1969, this episode is presumed lost. On that telecast, Gorme made references to the fact that she enjoyed various science-fiction shows, like Star Trek and Time Tunnel, and Edwards made various references to experts' sightings of UFOs to promote his then-current book, \"Flying Saucers—Serious Business!\"\nHis death\nIt is one of the myths of ufology that Edwards died on June 24, 1967, exactly 20 years after Kenneth Arnold's famous first \"flying saucer\" sighting. In fact, Edwards had died a few minutes before midnight on June 23, but his death was announced at the Congress of Scientific Ufologists in New York City on June 24, 1967.\nSelected works\nBooks\n*[https://worldradiohistory.com/BOOKSHELF-ARH/Biography/My-First-10000000-Sponsors-Edwards-1956.pdf My First 10,000,000 Sponsors.] New York: Ballantine Books (1956). .\n*Strangest of All. New York: Lyle Stuart (1956). .\n*Stranger Than Science. New York: Lyle Stuart (1959). . .\n*Strange People. Seacaucus, NJ: Citadel (1961). .\n*Strange World. New York: Ace Books, with Lyle Stuart (1964). .\n*Flying Saucers–Serious Business. New York: Lyle Stuart (1966). .\n*Flying Saucers–Here and Now! New York: Lyle Stuart (1967). .\nReferences\n*Clark, Jerome. 1998. The UFO Encyclopedia: The Phenomenon From The Beginning: Volume 1: A-K. Detroit: Omnigraphics.\n*Story, Ronald: The Encyclopedia of UFOs. Garden City: Doubleday & Company, Inc. .\nExternal links\n*[http://www.saturdaynightuforia.com/html/articles/articlehtml/ourspeakertonight-frankedwards.html Saturday Night Uforia.com: \"Our Speaker Tonight... Frank Edwards\"]"
    }
  ]
}