{
  "content": [
    {
      "type": "text",
      "text": "# Frank E. Edwards\n\n| office              = 35th Mayor of Seattle\n| term_start          = June 4, 1928\n| term_end            = July 14, 1931\n| predecessor         = Bertha Knight Landes\n| successor           = Robert H. Harlin\n| birth_date          =\n| birth_place         = England, United Kingdom\n| death_date          =\n| death_place         =\n| nationality         =\n| party               = Republican\n| spouse              =\n| restingplace        =\n| children            =\n| birthname           =\n| alma_mater          =\n| occupation          =\n| profession          =\n| religion            =\n| signature           =\n| website             =\n| footnotes           =\n}}\nFrank E. Edwards (1874–1943) was the 35th mayor of Seattle, serving from 1928 until 1931 when he was recalled from office for firing popular Seattle City Light superintendent James Delmage Ross.\nSeattle mayor\nEdwards ran for mayor in 1928 against Bertha Knight Landes, the first female mayor of a major American city as a \"businessman's candidate\" but was seen as a political unknown. The Edwards campaign was secretive and raised large sums of money but was not endorsed publicly by major organizations, compared to the Landes campaign, which was endorsed by newspapers, the Central Labor Council, the Prohibition Party, and women's organizations. His campaign spent more than $27,000, setting a record that would not be broken until 1948.\nEdwards' major critique of Landes was that she was a woman, refusing to debate her saying, \"...the questions that are encased in your pent up bosom\" because it was \"manifestly hard\" for a man to debate \"a hostile or infuriated woman.\" At the debate, Landes would place an empty chair on the platform and ask, \"Can it be true that a man is afraid of a woman?\"\nEdwards defeated Landes in the March general election, 60% to 40%. Landes would complain that Edwards had devoted excessive funds to his campaign, with prosecutor Edward C. Colvin stating that he would do a thorough investigation. As mayor during the Great Depression, Edwards focused on getting unemployed people working to fight communism. In October 1929, Edwards would tell the council, \"If you are willing to work to the best interest of our citizens, whom we have the honor to represent, I recommend that the legislative and executive departments join hands in a most serious effort to provide decent and proper relief of the unemployed by pushing forward such municipal work as will require the maximum of labor.\" In the 1930 election, Edwards defeated city councilmember Otto A. Case, 60% to 40%.\nRecall election\nIn 1931, a charter amendment giving Seattle City Light superintendent James Ross authority over engineering projects was on the ballot. Private corporations were against the charter amendment, including power production company Stone & Webster and the Seattle Daily Times. On March 9, 1931, the day before the election, Edwards fired Ross on a dare citing \"inefficiency, disloyalty and willful neglect of duty.\" Edwards planned for the news to come out the following day, while people were voting, but The Seattle Star published a special late evening edition carrying a story by Ross and urging voters to pass the charter amendment. Ross was later appointed the head of the Bonneville Power Administration by U.S. president Franklin D. Roosevelt.\nThe charter amendment would pass, and the voters began a petition, led by the Municipal Utilities Protection League and future congressmen Marion Anthony Zioncheck, to recall Edwards, gathering 200,000 signatures. In a July 1931 special election, Edwards would become the second Seattle mayor recalled from office with 62% voting in favor of the recall.\nPersonal life\nEdwards was born in England in 1874 and moved to Seattle in 1900. Before his election, he owned a theater. After his 1928 election win, the Seattle Post-Intelligencer ran a photo of Edwards with his wife with the caption, \"[Edwards] receives the first signal of his success — an acknowledging curtsy of obeisance from his wife.\"\nReferences"
    }
  ]
}