{
  "content": [
    {
      "type": "text",
      "text": "# Franco-Japanese Treaty of 1907\n\n| location_signed     = Paris, France\n| date_sealed         =\n| date_effective      =\n| condition_effective =\n| date_expiration     =\n| signatories         =\n| parties             =\n| ratifiers           =\n| depositor           =\n| languages           = French and Japanese\n| wikisource          =\n}}\nThe , () was a treaty between the French Third Republic and the Empire of Japan denoting respective spheres of influence in Asia, which was signed in Paris on 10 June 1907, by Japanese Ambassador Shin’ichiro Kurino and French Foreign Minister Stéphen Pichon.\nRelations between France and Japan prior to the Russo-Japanese War of 1904-1905 had been chilly. France was a member of the Triple Intervention, which Japan had felt humiliatingly limited her gains in the First Sino-Japanese War. France was also a vocal supporter of Russia in the recent conflict, although had been constrained by the Entente cordiale with the United Kingdom and the foreign policies of Théophile Delcassé from taking an open role. However, with Japan emerging as victor in the Russo-Japanese War and with France increasingly becoming estranged from an increasingly belligerent Germany, French foreign policy shifted.\nThe draft of the treaty was completed in May 1907 and sent to Tokyo on 16 May for ratification by the Japanese government.\nIn the Franco-Japanese Treaty of 1907, both parties stated their commitment to the territorial integrity of China, as well as their support of the Open Door Policy, but also stated that both parties had a “special interest” in maintaining peace and order in areas of China adjacent to territories where both parties had rights of sovereignty, protection or occupation. The non-public supplement of the agreement defined these areas as Manchuria, Mongolia and the province of Fukien for Japan, and the provinces of Yunnan, Guangxi and Guangdong for France.\nThe treaty implicitly recognized France’s position in French Indochina and one of the results of the treaty was a crackdown on the activities of Indochinese independence supporters and Vietnamese exiles in Japan by the Japanese police.\nHowever, the wording of the supplemental portions of the treaty were leaked to the French press, causing concern in the United States and in China regarding French and Japanese territorial ambitions in China, and the future of the Open Door Policy. Further negotiations between Japan and the United States to clarify their respective positions contributed to the Root–Takahira Agreement of 1908.\nThe treaty was part of building a coalition as France took the lead in creating alliances with Japan, Russia and (informally) with Britain. Japan wanted to raise a loan in Paris, so France made the loan contingent on a Russo-Japanese agreement and a Japanese guaranty for France's strategically vulnerable possessions in Indochina. Britain encouraged the Russo-Japanese rapprochement. Thus was built the Triple Entente coalition that fought World War I.\nReferences\n*\n*\n*\n* White, John Albert. Transition to Global Rivalry: Alliance Diplomacy & the Quadruple Entente, 1895-1907 (1995) 344 pp. re France, Japan, Russia, Britain\nExternal links\n* [http://www.mofa.go.jp/mofaj/annai/honsho/shiryo/qa/meiji_05.html Ministry of Foreign Affairs of Japan HP, with photo of the treaty]\nNotes"
    }
  ]
}