{
  "content": [
    {
      "type": "text",
      "text": "# Frances Bowes-Lyon, Countess of Strathmore and Kinghorne\n\n| name                = The Countess of Strathmore and Kinghorne\n| image               = File:Frances Bowes-Lyon.png\n| mother              = Henrietta Mildred Hodgson\n| father              = Oswald Smith\n| spouse              = Claude Bowes-Lyon, 13th Earl of Strathmore and Kinghorne\n| children            = 11\n| birth_name          = Frances Dora Smith\n| birth_date          =\n| birth_place         = Marylebone, London, England\n| death_date          =\n| death_place         = 19 Hans Place, Chelsea, London, England\n| resting_place       = Glamis Castle, Angus\n}}\nFrances Dora Bowes-Lyon, Countess of Strathmore and Kinghorne  (née Smith; 29 July 18325 February 1922) was a British noblewoman. She was the paternal grandmother of Queen Elizabeth The Queen Mother, and thus a great-grandmother of Queen Elizabeth II.\nEarly life\nFrances Smith was born to Oswald Smith (1794–1863), of Blendon Hall, Bexley, Kent, banker with Smith, Payne, and Smith, and Henrietta Mildred Hodgson (1805–1891).\nMarriage\nOn 28 September 1853, Frances married Claude Bowes-Lyon (21 July 182416 February 1904). He became the 13th holder of the Earldom of Strathmore and Kinghorne following the death of his brother Thomas in 1865. Frances then assumed the title and style of Countess of Strathmore and Kinghorne. Together the couple had 11 children:\n* Claude Bowes-Lyon, 14th Earl of Strathmore and Kinghorne (14 March 18557 November 1944), the father of Queen Elizabeth The Queen Mother and grandfather of Queen  Elizabeth II. He married Cecilia Cavendish-Bentinck (11 September 186223 June 1938) on 16 July 1881. They had 10 children.\n* Francis Bowes-Lyon (23 February 185618 February 1948), married Lady Anne Lindsay (24 December 185815 December 1936) on 23 November 1883. They had 7 children, including Lilian Bowes Lyon.\n* Ernest Bowes-Lyon (4 August 185827 December 1891), married Isobel Hester Drummond (21 May 186015 July 1945) on 23 August 1882. They had 6 children, including Ernestine Bowes-Lyon.\n* Herbert Bowes-Lyon (15 August 186014 April 1897), never married.\n* Patrick Bowes-Lyon (5 March 18635 October 1946), a major of the British Army and a tennis player. He married Alice Wiltshire (18671 March 1953) on 9 August 1893. They had 4 children.\n* Lady Constance Frances Bowes-Lyon (8 October 186519 November 1951), married Robert Blackburn (27 April 186421 March 1944) on 21 December 1893. They had 4 children.\n* Kenneth Bowes-Lyon (26 April 18679 January 1911), never married.\n* Lady Mildred Marion Bowes-Lyon (18689 June 1897), a music composer, famous for Etelinda (an opera premiered in Florence in 1894). She married Augustus Jessup (20 June 186116 October 1925) on 1 July 1890. They had 2 children.\n* Lady Maud Agnes Bowes-Lyon (12 June 187028 February 1941), never married.\n* Lady Evelyn Mary Bowes-Lyon (16 July 187215 March 1876), died in infancy.\n* Maj. Malcolm Bowes-Lyon (23 April 187423 August 1957), a lieutenant colonel of the British Army. He married Winifred Gurdon-Rebow (10 October 187630 May 1957) on 28 September 1907. They had a daughter.\nLater Life Death\nThe Earl of Strathmore and Kinghorne died on 16 February 1904, in the Liguria region of Italy, where the Strathmores owned a large house Villa Etelinda. Lady Strathmore took ownership of the property following her husband's death, and it was later sold to Queen Margherita, the Queen Mother of Italy in 1913.\nThe Countess survived her late husband by almost eighteen years. Her London residence during her widowhood was No. 19 Hans Place, Chelsea. She died at her London residence on 5 February 1922, aged 89. She was buried at Glamis Castle, Angus, the family seat of the earls of Strathmore and Kinghorne.\nAncestry\nHer paternal grandparents were George Smith, and wife Frances Mary Mosley, daughter of Sir John Parker Mosley, 1st Baronet, and wife Elizabeth Bayley, granddaughter of Nicholas Mosley and wife Elizabeth Parker, and sister of Oswald Mosley, 2nd Baronet, great-great-grandfather of Oswald Mosley.\nReferences"
    }
  ]
}