{
  "content": [
    {
      "type": "text",
      "text": "# Frank Warren (American football)\n\n| birth_place = Birmingham, Alabama, U.S.\n| death_date  =\n| death_place = Birmingham, Alabama, U.S.\n| height_ft   = 6\n| height_in   = 4\n| weight_lbs  = 285\n| draftyear   = 1981\n| draftround  = 3\n| draftpick   = 57\n| high_school = Birmingham (AL) Phillips\n| college     = Auburn\n| teams       =\n* New Orleans Saints (1981–1994)\n| highlights  =\n* New Orleans Saints Hall of Fame (2002)\n* Saints 50th Anniversary Team (2019)\n* 3× First-team All-SEC (1978, 1979, 1980)\n| statlabel1  = Games played\n| statvalue1  = 189\n| statlabel2  = Games started\n| statvalue2  = 83\n| statlabel3  = Sacks\n| statvalue3  = 52.5\n| statlabel4  = Interceptions\n| statvalue4  = 1\n| statlabel5  = Fumbles recovered\n| statvalue5  = 11\n| statlabel6  = Touchdowns\n| statvalue6  = 4\n| statlabel7  = Safeties\n| statvalue7  = 2\n| pfr         = WarrFr20\n}}\nFrank William Warren (September 14, 1959 – December 14, 2002) was an American professional football player who was a defensive lineman for the New Orleans Saints of the National Football League (NFL). He played college football for the Auburn Tigers and selected by the Saints in the third round of the 1981 NFL draft. He was a member of Omega Psi Phi fraternity at Auburn.\nProfessional career\nFrank Warren went on to play 189 games during his 14-year career with the New Orleans Saints, which is the third most games played with the team and the most for a New Orleans defensive lineman. He recorded 52½ sacks ranking fifth in team history. He missed the entirety of 1990 season due to an NFL suspension for violating the league's substance abuse policy for a third time and missed part of the 1993 season due to injuries but other than that was a constant presence on the defensive line. His teammates chose Frank for the Ed Block Courage Award in 1993 due to his inspiration, sportsmanship, and courage.  His impressive career earned him an induction into the New Orleans Saints Hall of Fame in 2002 and inclusion on the Saints 50th Anniversary Team in 2019. He is one of only 7 players to have been drafted by the Saints and to have played 10+ years retiring without playing for any other teams.\nFrank retired in 1994, at the age of 35, and joined the Saints coaching staff as a player liaison under coach Jim Mora. He attempted a football comeback in 1996 but doctors discovered multiple heart blockages and he had cardiac surgery less than two years later.\nHealth issues and death\nWarren had battled drug addiction since his early days on the Saints and was caught up in a Federal DEA investigation involving cocaine and marijuana use and distribution along with several other Saints players including Chuck Muncie and Mike Strachan in 1983. He attended an unspecified rehab in 1989 before his league suspension took effect. He had been previously diagnosed with cardiac issues and had cardiac surgery in the late 90s. Frank Warren died in 2002, at the age of 43, after suffering a heart attack at his home in Birmingham, Alabama. By tragic coincidence, he had only five days earlier been interviewed for the HBO television program Real Sports with Bryant Gumbel to discuss the dangers of rising obesity among NFL linemen, many of whom now top . Warren stated that his weight scared him and left him wondering every night if he'd wake up to see the next morning.\nReferences\nExternal links\n*Video tribute from Saints: https://m.youtube.com/watch?v=IN1dlekPPTU\n*[https://web.archive.org/web/20050310233917/http://www.nfl.com/teams/story/NO/6019312 NFL.com news story about his death]"
    }
  ]
}