{
  "content": [
    {
      "type": "text",
      "text": "# Franklin Township School District (Warren County, New Jersey)\n\n| grades         = PreK-6\n| schools        = 1\n| enrollment     = 197 (as of 2022–23)\n| faculty        = 25.0 FTEs\n| ratio          = 7.9:1\n| free_label     = District Factor Group\n| free_text      = DE\n| website        =\n| module         =\n}}\nThe Franklin Township School District is a community public school district that serves students in pre-kindergarten through sixth grade from Franklin Township, in Warren County, in the U.S. state of New Jersey.\nAs of the 2022–23 school year, the district, comprising one school, had an enrollment of 197 students and 25.0 classroom teachers (on an FTE basis), for a student–teacher ratio of 7.9:1.\nThe district is classified by the New Jersey Department of Education as being in District Factor Group \"DE\", the fifth-highest of eight groupings. District Factor Groups organize districts statewide to allow comparison by common socioeconomic characteristics of the local districts. From lowest socioeconomic status to highest, the categories are A, B, CD, DE, FG, GH, I and J.\nPublic school students in seventh through twelfth grades attend the schools of the Warren Hills Regional School District, which also serves students from the municipalities of Mansfield Township, Washington Borough, Washington Township and Oxford Township (for 9-12 only, attending on a tuition basis). Schools in the district (with 2022–23 enrollment data from the National Center for Education Statistics) are\nWarren Hills Regional Middle School with 468 students in grades 7 and 8 (located in Washington Borough) and\nWarren Hills Regional High School with 1,068 students in grades 9 - 12 (located in Washington Township).\nSchool\nThe Franklin Township School had an enrollment of 199 students in grades PreK-6 as of the 2022–23 school year.\n*Matt Eagleburger, principal\nAdministration\nCore members of the district's administration include:\n*Matt Eagleburger, superintendent\n*Timothy Duryea, business administrator and board secretary\nBoard of education\nThe district's board of education, comprised of nine members, sets policy and oversees the fiscal and educational operation of the district through its administration. As a Type II school district, the board's trustees are elected directly by voters to serve three-year terms of office on a staggered basis, with three seats up for election each year held (since 2012) as part of the November general election. The board appoints a superintendent to oversee the district's day-to-day operations and a business administrator to supervise the business functions of the district.\nReferences\nExternal links\n*[http://www.franklinschool.org/ Franklin Township School District]\n*\n*[https://nces.ed.gov/ccd/schoolsearch/school_list.asp?Search=1&DistrictID=3405520 School Data for the Franklin Township School District], National Center for Education Statistics\n*[https://www.warrenhills.org/ Warren Hills Regional School District]"
    }
  ]
}