{
  "content": [
    {
      "type": "text",
      "text": "# France Billie Jean King Cup team\n\n2; 10 February 2020)\n| ITF max = 1\n| ITF max date = 24 November 2003\n| ITF min = 18\n| ITF min date = 22 April 2013\n| Colors             = blue & red\n| First year         = 1963\n| Years played       = 54\n| Ties played        = 145 (89–56)\n| WG played          = 51 (67–48)\n| Titles             = 3 (1997, 2003, 2019)\n| Runners-up         = 3 (2004, 2005, 2016)\n| Best               =\n| Player wins        = Nathalie Tauziat\n| Singles wins       = Amélie Mauresmo (30–9)\n| Doubles wins       = Nathalie Tauziat (20–9)\n| Best doubles       = Françoise Dürr/Janine Lieffrig (8–4)\n| Most ties          = Nathalie Tauziat (40)\n| Most years         = Nathalie Tauziat (16)\n}}\nThe '''France women's national tennis team''' represents France in international women's tennis and is directed by the Fédération Française de Tennis. The team played in the first ever tournament in 1963, and is one of four teams that has taken part in every single edition since.\nWhile the France national team has not been one of the most successful in women's tennis, it has been very consistent over the years. Throughout the first ten years of competition, it never failed to reach the quarterfinals, and continued its good record through the early 1980s, accumulating a 63% win–loss percentage, reaching four semifinals, and winning the consolation rounds in 1982 despite being defeated in the first round of the main draw. The team experienced a slight downturn in the mid-to-late 1980s, winning only 40% of their ties from 1983 to 1989, but they returned to a successful form by reaching all but four semifinals from 1990 to 1999 and managing to win the 1997 edition, mainly thanks to their sizable contingent of top-twenty singles and doubles players the French had throughout that period in time. The triumphs continued through to the 2000s when, in addition to acquiring their first and so far only World No. 1 singles player, they claimed their second title in 2003 and reached two more finals in 2004 and 2005. These achievements were solidified when France became the second, and so far only one of five countries to reach the ITF No. 1 ranking in November 2003. However, the French team has experienced a relative decline in recent times, falling from the highest level of competition, the World Group, for the first time since initiation in 2011 and falling out of the ITF Top 15 the following year. However, France built their way back up to the World Group in the 2014 Fed Cup, and in 2016, the team reached their first final since 2005. Third world coronation arrives in 2019.\nFormer World No. 3 and 1998 Wimbledon finalist Nathalie Tauziat holds the record for most Fed Cup doubles wins and total wins by a French player, whilst also participating in more ties and more years for the French team than any other person. Amélie Mauresmo, France's first and so far only World No.&nbsp;1 singles player, on the other hand, holds the record for most singles wins in Fed Cup by a Frenchwoman. Mauresmo is also the current captain of the French Fed Cup team, having taken over the position from former ATP Top 20 player Nicolas Escudé in 2012.\nCurrent team\n{| class=\"wikitable sortable\" style=font-size:97%\n|- align=\"center\"\n! rowspan=\"2\"| Name\n! rowspan=\"2\"| DOB\n! rowspan=\"2\"| First\n! rowspan=\"2\"| Last\n! rowspan=\"2\"| Ties\n! class=\"unsortable\" colspan=\"3\"| Win/Loss|group=lower-alpha}}\n|-\n! Sin\n! Dou\n! Tot\n! Sin\n! Dou\n|-\n|\n|\n| 2010\n| 2011\n| 3\n| 0–1\n| 1–1\n| 1–2\n|align=center|221\n|align=center|133\n|-\n|\n|\n| 2008\n| 2013\n| 11\n| 2–9\n| 2–4\n| 4–13\n|align=center|44\n|align=center|92\n|-\n|\n|\n| 2002\n| 2012\n| 2\n| 1–0\n| 1–1\n| 2–1\n|align=center|101\n|align=center|94\n|-\n|\n|\n| 2013\n| 2016\n| 7\n| 8–4\n| 5–1\n| 13–5\n|align=center|25\n|align=center|3\n|-\n|\n|\n| 2012\n| 2017\n| 11\n| 4–6\n| 9–2\n| 13–8\n|align=center|31\n|align=center|3\n|-\n|\n|\n| 2010\n| 2017\n| 8\n| 4–8\n| 1–0\n| 5–8\n|align=center|64\n|align=center|223\n|-\n|\n|\n| 2001\n| 2012\n| 13\n| 9–3\n| 5–4\n| 14–7\n|align=center|160\n|align=center|205\n|-\n|\n|\n| 2010\n| 2011\n| 2\n| 2–2\n| 0–0\n| 2–2\n|align=center|169\n|align=center|\n|-\n|}\nHistory\n1963–1972: early consistency\nFrance participated in the inaugural Federation Cup competition in Queen's Club, London in 1963, when it was instituted as a way of celebrating the fiftieth anniversary of the ITF. Janine Lieffrig was the team's first captain and she participated also as a player alongside Françoise Dürr. Together, the two were considered the best upcoming women's tennis players in Europe at the time.\nThey were drawn against West Germany for their first ever tie. Dürr was defeated by 1961 Wimbledon mixed doubles finalist Edda Buding in straight sets, but Lieffrig managed to defeat Margot Dittmeyer in singles and Buding and Renate Ostermann in doubles alongside Dürr. This led to France advancing to the quarterfinals, where they were drawn against Lieffrig's future senior's tennis nation South Africa. The team was defeated cleanly by Margaret Hunt and 1959 Australian Championships finalist Renée Schuurman, failing to win a rubber.\nSuccess for the team grew in the next two years. In 1964, Wimbledon player Jacqueline Rees-Lewis joined the team as a singles player, and together with Dürr and Lieffrig managed to easily defeat Switzerland, and then beat Netherlands and the Germans once again despite losses to future Wimbledon finalist Betty Stöve and future German Junior champion Heide Orth. However, the French were eventually stopped by Australia, the eventual winners, who were accompanied by multiple Grand Slam champions Margaret Smith and Lesley Turner. The following year, they suffered very similar fortunes. Dürr and Lieffrig easily defeated the Japanese, and won over Brazil despite the presence of World No. 1 Maria Bueno. They then lost once again to the Australians who were once again accompanied by Smith and Turner.\nSuccess dropped slightly for the team in the next years, however. 1967 Australian Championships doubles finalist Évelyne Terras joined the team in 1966, but managed to only win two games in singles against Erzsébet Széll in France's 2–1 defeat of Hungary. Dürr and Lieffrig were then beaten in the next round by the eventual champions United States. Following this, Monique Bensusan-Hamelin replaced Lieffrig as captain, and Monique Salfati joined the team. However, they suffered their third straight defeat against the Australians in the quarterfinals after passing through due to the Poles withdrawing.\nThey then suffered similar fortunes in 1968, after Dürr left despite winning the French Championships in singles and doubles. The addition of 1968 Championnat de France de tennis féminin Rosy Darmon saw the team progress through their sixth consecutive quarterfinals, however, where they were defeated by the Americans again. Former Wimbledon player Jacqueline Kermina then took over as captain and successful doubles player Gail Benedetti joined the team for 1969, but were once again unable to defeat Benedetti's former country, Australia, in the quarterfinals.\nBy 1970, France's fortunes lifted. 1966 French Championships girls' singles champion Odile de Roubin and 1963 Championne de France Junior Christiane Spinoza came into the team, and together with Benedetti they defeated both the Japanese and the Italians, 2–1, before succumbing to West Germany. Dürr then rejoined the team in December 1970, having reached the Top 3 in singles, and No. 1 in doubles after winning several Grand Slam titles with Benedetti, while world-renowned player and promoter of tennis Philippe Chatrier took over from Kermina as captain. This new team led to France progressing past the final eight for the first time since 1965, before suffering their fifth straight defeat by Australia. The exact same team competed again in 1972, where they again enjoyed success winning five straight rubbers and allowing the team to reach their tenth consecutive quarterfinals, but they lost to home team South Africa, 1–2.\n1973–1979: mixed fortunes\nThe team rapidly changed for the 1973 tournament. Jacqueline Kermina returned to the captaincy, and Odile de Roubin came back as a player as Françoise Dürr and Gail Benedetti left. 1973 Championnat de France de tennis féminin Nathalie Fuchs and doubles player Florence Guédy also entered the team. They were drawn against the Netherlands for their first tie, and succumbed to their first ever first round defeat after the ambidextrous Marijke Schaar won her singles rubber over Fuchs and the doubles rubber over de Roubin and Guédy. As a result, France partook in their first ever consolation round matches. They easily passed through the quarterfinals after de Roubin and Guédy together won over Denmark and Brazil without losing a rubber, and Fuchs and de Roubin then managed to defeat the Irish to lead France to the semifinals. They also gathered a quick lead over Japan after Fuchs won over Australian Open semifinalist Kazuko Sawamatsu. However, they were soundly defeated in the next two rubbers, winning only three games thereafter.\nIn 1974 however, France returned to success, mainly due to the return of Benedetti to the team. In the first round, they gained revenge by defeating the Netherlands, with Benedetti defeating Schaar in three sets, and then went on to beat Austria to progress through to their eleventh quarterfinals. Although they soundly lost to the United States in their next match, the team's good results continued through 1975. Rosy Darmon returned to the team, and with her, France was able to easily beat Bulgaria and defeat Hungary despite losing a singles rubber to six-time Hungarian women's tennis champion Éva Szabó. This allowed them to once again play in their quarterfinals, where they achieved one of their best wins by defeating 1967, 1971 and 1972 finalists and many-time semifinalists Great Britain, with Fuchs managing to stun 1976 French Open champion Sue Barker in three sets and Benedetti and Darmon teaming up to defeat Glynis Coles and multiple Grand Slam doubles winner Virginia Wade in doubles. This allowed the team to reach their fourth semifinal, and become just the fifth team since initiation to reach four semifinals. Although they lost in their next round to Czechoslovakia, whose team was composed of future Grand Slam finalist Renáta Tomanová and the renowned Martina Navratilova, their performance would end up being one of the best for years.\n1976 saw a sharp downturn for the team. Kermina left the captaincy for a second time, to be replaced by Philippe Duxin, and although the same team from 1975 was competing, they suffered their second first round defeat, only winning an average of four games per rubber at the hands of British players Barker and Wade. This led to the French playing in the consolation rounds once again. They initially suffered to a terrible draw with the Czechoslovaks in the first round, but gained a bye after the Eastern European team withdrew amidst the tense political situation of the time. They faced little resistance from Rhodesia or Brazil to pass through to the consolation final, but they eventually fell to Romanian multiple Grand Slam finalists Florența Mihai and Virginia Ruzici.\nThe team's performance picked up again slightly for the next three years. Kermina and Dürr returned to the team while part-time French No. 1 Frédérique Thibault made her debut with 1978 French Open semifinalist Brigitte Simon-Glinel in 1977. The team made an excellent start to the tournament, defeating Luxembourg and Greece in the first two ties whilst only dropping two and six games respectively, but they were beaten in the quarterfinals by the Americans. Duxin retook the captaincy for the next year, but otherwise the team remained unchanged and very similar results occurred. The team won over Sweden and Argentina in the first two rounds, mainly due to the singles performances of Benedetti and Dürr, but were beaten in the quarterfinals by the United States. For 1979 an entirely new captain, player and broadcaster Jean-Paul Loth, and Benedetti momentarily departed from the team. However, the team for a third consecutive year managed to reach the quarterfinals, but were defeated by the United States, who were on a sixteen-tie winning streak.\n1980–1989: lack of success\nFrançoise Dürr left the team for the final time in 1980, leaving the team in a rather weak state despite the re-addition of Benedetti; of the WTA in the Year-End 1979, Thibault was the highest-ranked at No. 75, while Simon was the only other player to compete in Fed Cup who was within the Top 100 (at No. 84). This lack of depth was shown in the French results, as the team suffered another first-round lost, this time to Sweden, sending them to another consolation tournament. They played well in the consolation rounds, managing to easily pass through Denmark and Belgium, who were accompanied by Australian Open quarterfinalist Michele Gurdal, but the streak did not last as they only narrowly defeated South Korea in the semifinals and were beaten soundly by Canada in the final.\nFor 1981, the team had a complete reshuffle. Benedetti and Simon were dropped, despite being the only French players in the 1980 singles Top 110, and were replaced with No. 145 Corinne Vanier, No. 173 Catherine Tanvier and the No. 180 Sophie Amiach; the latter two being capable doubles players who managed to reach the 1980 Australian Open doubles quarterfinals. This new team began well, avenging the Canadians, 3–0, but were beaten in the next round by the British. They were drawn against Hungary for the second round of the consolation rounds, but they withdrew prior to the tie. After this, Thibault and Simon returned to the team at the expense of Amiach and Tanvier. Vanier played for a second consecutive year, having become France's top singles player over last year and broken into the Year-End Top 70. However, this did not translate into success for the team as they suffered a shocking first-round defeat by Brazil, not even being able to win a set. This sent the team to yet another consolation tournament, where their fortunes soundly improved with wins over Austria, Spain and Italy to reach the final with Canada. Simon lost to teenager and junior champion Carling Bassett, but Vanier managed to acquire a win as Canada's No. 1 Marjorie Blackwood retired a set and a break down. Vanier and Thibault then teamed up to ultimately secure the tie and France's win of the consolation rounds. That would be the furthest that the team would ever progress during the history of that round.\nJean-Paul Loth departed from the role of captaincy following 1982; he was replaced by former Fed Cup player Françoise Dürr. Thibault and Simon also left the team for the final time, while Tanvier made a return and newcomer to the tour Catherine Suire made her debut. However, this change-up once again did not translate into success, as they suffered their third first round defeat in four years, going down to Argentina with Vanier losing in singles and doubles alongside Tanvier. This loss was one of a few upsets that occurred in Federation Cup that year, and meant that France would be defending their consolation win. Though the team's poor form worsened further when they were beaten in their first tie by South Korea; Suire losing in three sets to Seol Min-kyung and Vanier in two to Shin Soon-ho. This meant that France had their first year of competition without winning a single tie.\nFollowing the poor results, the team had another change-up. Dürr left the captaincy, to be replaced by Patrick Favière, and Vanier left while Marie-Christine Calleja played in her first tournament. Tanvier reached the singles Top 30, and Suire reached the Top 60 shortly before the competition, meaning the team was in one of the best positions it had been for a number of years. These statistics were reflected in their results, as they managed to defeat Netherlands in the first round despite the presence of French Open junior champions Digna Ketelaar and Simone Schilder, and Denmark in the second round in spite of top junior player Tine Scheuer-Larsen. Though they lost in the next round to defending and eventual champions Czechoslovakia, their performance was the best for five years.\nFor 1985 the team changed completely, with all four players being debutantes: 1983 junior singles champion Pascale Paradis, upcoming Nathalie Tauziat, and junior players Isabelle Demongeot and Emmanuelle Derly. This new team did not continue the success of the previous year, as they suffered their fourth first round defeat in six years to the New Zealanders Belinda Cordwell and Julie Richardson. They managed to beat Uruguay in their first tie of the consolation rounds, but they lost thereafter to eventual consolation victors Soviet Union, who were accompanied by successful doubles players Larisa Savchenko and Svetlana Cherneva.\nFavière left as captain for 1986, and was replaced by 1959 Summer Universiade gold medalist François Jauffret. Derly left the team after one year, and Tanvier, who had established herself as a prominent world player, returned again. With this team, they made a first round win over Sweden; Tanvier securing the tie by defeating consistent Top 20 player Catarina Lindqvist in three sets. However, they were defeated in the next round by Maleeva-led Bulgaria. This level of play continued to the next year, as Demongeot and Tauziat worked their way up the rankings and even managed to win a doubles tournament together in Paris, they went past Austria, who was assisted by the upcoming Judith Wiesner, but they were beaten soundly in the second round by the defending champion Americans, the celebrated Chris Evert and Pam Shriver. Following this, Demongeot and Tauziat left the competition for a year, as Tanvier and Suire (who teamed up to, amongst various other achievements, win the 1988 $100,000 tournament Nice in doubles) and newcomers Karine Quentrec and Maïder Laval completed the 1988 team. They easily defeated Japan in the first round, but lost for a second consecutive time to the defending champions, West Germany, in the second round.\nIn 1989, Demongeot and Tauziat were returned amidst good results for both of team, as they won three more WTA titles together in doubles and had both reached the Top 40 in singles. However, they succumbed to an unfortunate first round draw against Spain, who consisted of upcoming teenager Conchita Martínez and recent 1989 French Open champion Arantxa Sánchez Vicario. They fell, 0–2, with Demongeot being beaten in three close sets to Martínez and Tauziat losing comprehensively to Sánchez Vicario. This caused them to be placed to their first consolation rounds in four years, but they withdrew prior to their first tie against South Korea.\n1990–1997: re-ascendance and first victory\nIsabelle Demongeot and the French singles No. 1 Nathalie Tauziat were joined by 1988 French Open girls' singles winner and French No. 2 (and Top 50 player) Julie Halard and Franco-American fifteen-year-old Mary Pierce for the 1990 edition. This new team began spectacularly well, beating Chinese Taipei while only dropping on average four games a match and managing an easy revenge of New Zealand. They fell to Spain in the next round, with Arantxa Sánchez Vicario securing the tie by defeating Tauziat in a match with a very close first set, but their run to the third round was their best since 1984.\nFrance's opportunities grew as their players fortunes increased. Tauziat won her first WTA title in singles in Bayonne, and her first WTA Tier II title in doubles in Brighton, while Pierce accumulated both singles and doubles titles in Palermo. However, this did not translate into success for the team in 1991; they suffered a massive upset defeat at the hands of Poland, who had not won a Federation Cup World Group match since 1974, mainly due to No. 170 singles player Katarzyna Nowak's shock victory over Tauziat. This set France back to the World Group play-offs, but they quickly regained form by easily beating Yugoslavia, who were being forced to play their World No. 828 Ljudmila Pavlov due to the absence of No. 1 Monica Seles. This allowed the French to play in the 1992 World Group, with their new returning captain Philippe Duxin. Pierce, who had recently won two additional singles titles in Italy, played alongside the continuing French No. 1 Tauziat and Demongeot, who after winning several WTA doubles titles became the French doubles No. 1. The team managed to defeat China in the first round, despite Li Fang managing to upset Tauziat in three sets, and CIS easily in the second round. The team's semifinal drought continued though when they were beaten by the United States in the quarterfinals in spite of Tauziat winning over Lori McNeil, mainly due to the singles and doubles prowess of Gigi Fernández.\nFrançoise Dürr returned as captain, but the team suffered a blow just prior to the 1993 competition as Pierce, who had become France's highest-ranking player, withdrew for personal reasons; she was replaced by Top 50 player Pascale Paradis-Mangon. Nevertheless, France managed to reach their third quarterfinal in four years, the first occasion they had achieved such success since 1979, with wins over Canada and Sweden due to the singles and doubles prowess of Halard and Tauziat. The team then went one step further, finally reaching their first semifinal since 1975 by upsetting the Czech Republic. Halard defeated World No. 12 and multiple Grand Slam finalist Helena Suková in the first tie, before Tauziat beat World No. 8 and 1993 Wimbledon runner-up Jana Novotná in a match in which the Czech served numerous double faults. France's streak ended, once again, at the hands of the Spaniards, who, for the past three years, had a 93% win–loss record.\nParadis-Magnon left tennis at the end of the year, but Pierce, who reached the final of the 1994 French Open, returned for 1994, and Alexandra Fusai made her Cup debut. This team allowed the recent success to continue, as they beat South Korea and Italy, with only Halard dropping a set to Silvia Farina. They then played Bulgaria in a very tight tie that involved Halard defeating Katerina Maleeva in three sets, but Pierce losing to the sister Magdalena Maleeva in an extremely close two-and-a-half-hour match. Halard and Tauziat ended the tie with a victory, however, defeating the Maleeva sisters in doubles also in three sets, delivering France to its first consecutive semifinal since 1965. They continued to fail to reach any further though, as the United States managed to win over them; No. 11 Mary Joe Fernández beating Halard easily and No. 6 Lindsay Davenport beating Pierce despite losing the first set with many errors including four-foot faults.\nIn 1995, the format of the competition was revamped to try and mirror the success that the Davis Cup had with theirs, and to provide the nations more opportunities to play in their own countries. This meant that France, because of their good recent results, participated in and was seeded for the 1995 World Group. Because of the nature of the revamp, countries playing in any level above zonal competition would be playing in five-rubber ties, the first four of which would be singles. France first tie of 1995 was against South Africa and held in Metz on red clay.\nThe French team was accompanied again by Halard, Tauziat, and Pierce who at the 1995 Australian Open became the first Frenchwoman in the Open Era to win a Grand Slam singles title. The tie began evenly, with Pierce and the South African No. 1 Amanda Coetzer gaining wins. but Coetzer gained an upset by beating Pierce in straight sets in the third rubber. Halard, however, saved the team's fortunes by winning in singles and doubles with Tauziat. The same team competed against the United States, and similar initial results followed. A defeat and a win of the part of Halard and Pierce respectively tied the first two rubbers, but a loss by Pierce at the hands of Lindsay Davenport set up an eventual defeat as Halard and Tauziat failed to beat experienced doubles players Gigi Fernández and Davenport in the final rubber, in spite of a singles win by Halard over an injured Mary Joe Fernández.\nIn 1996, the newly married Julie Halard-Decugis was having the best season start of her career, winning her fifth WTA tournament in Hobart and following up with her first Tier II victory in Paris. In addition, Halard-Decugis and Tauziat were performing well in doubles, reaching the final of Paris and the Tier I tournament at Indian Wells. This allowed the French to perform in their Fed Cup tie against Argentina, despite Pierce, who was having a terrible start to the year due to injury, not being present; Halard-Decugis defeated Florencia Labat and Paola Suárez in singles, and Patricia Tarabini and Labat in doubles with Tauziat, despite a poor singles tournament from Tauziat. This allow France to progress to its fourth consecutive semifinals, where they were drawn to play Spain for the fifth time. Pierce returned to play in the tie in Bayonne, and they started fairly well as the former Australian Open champion won over French Open and Wimbledon runner-up Arantxa Sánchez Vicario in singles, despite Halard-Decugis losing to Spanish No. 1 Conchita Martínez. However, although Halard-Decugis also managed to defeat Sánchez Vicario in singles, Martínez managed to win her second singles match over Pierce and Halard-Decugis was forced to retire in the doubles rubber whilst, 4–6, 1–2, with a right wrist injury.\nDürr departed from the captaincy for 1997; 1983 French Open winner and former Davis Cup captain Yannick Noah took over. In addition, Fusai returned to the team with Pierce, who reach the final of the Australian Open again, and Tauziat, while seventeen-year-old Top 40 player Anne-Gaëlle Sidot made her debut. The team faced its first match against Japan, a tie they were expected to win due to the Japanese No. 1 Ai Sugiyama having far fewer experience compared to Pierce and Tauziat. The rubbers began as expected, with Pierce getting France off to a good start to beat Naoko Sawamatsu and Tauziat coming from having a match point against her to defeat Sugiyama in three sets. The tables turned, however, as Pierce was upset in the third rubber by Sugiyama, and Tauziat was taken to an extremely long match against Sawamatsu, that mirrored a match that occurred between the two players at the 1991 French Open. Eventually, Tauziat emerged victorious, 7–5, 4–6, 17–15, in a rubber that remains the longest in the Fed Cup history in terms of games. This, combined with the other singles rubbers and the doubles rubber which Fusai and Sidot won, meant that the tie contained 172 games, which continues as the most in the tournament's history, but also resulted in France being the only semifinalist of the previous two years to win a 1997 tie.\nIn the semifinals, France was drawn against Belgium. The team quickly faced a setback as Pierce was unable to partake in competition due to an arm injury, and Tauziat was rested due to poor form of clay courts. Top 25 player Sandrine Testud, who had recently upset former World No. 1 Monica Seles at Wimbledon, thus made her debut while 57th ranked Fusai was called in the play her first singles matches. The tie went to a doubles decider, with Fusai managing an upset win over Sabine Appelmans, and France won with Fusai and Tauziat finishing the final rubber by winning eight straight games over Els Callens and Dominique Van Roost. This allowed them to progress through to their first ever final, against the Netherlands, which was to be held originally in France, but was later hosted by 's-Hertogenbosch. The Dutch chose to play on carpet, hoping that the French No. 1 and World No. 8 Pierce would have difficulty on the fast surface, but this tactic came to no avail as she easily defeated No. 50 Miriam Oremans after Testud disposed of the Dutch No. 1 and Top 20 player Brenda Schultz-McCarthy in three sets. The Dutch rallied slightly, with Schultz-McCarthy winning over Pierce in three sets and Oremans winning the first set over Testud in only 23 minutes, but Testud came back to take the fourth rubber and the tie for the French, and Fusai and Tauziat won in doubles to complete their 4–1 win. This was the first Fed Cup title for France, and made them the seventh country to win Fed Cup.\n1998–2003: continued success, second victory and No. 1 ranking\nThe French entered 1998 as defending champions, and with plenty of depth in their team. Mary Pierce remained their No. 1 player, finishing 1997 as World No. 7, while Nathalie Tauziat and Sandrine Testud were at No. 11 and No. 13 respectively. In addition, Tauziat and Alexandra Fusai were on good form in doubles, reaching the final of the prestigious Chase Championships and ending the previous year as the World No. 13 and 14 respectively.\nFor France's first tie of 1998 in April, France was drawn against Belgium again. Testud, Fusai and Tauziat all took part, but Pierce did not leaving Top 45 player Sarah Pitkowski to take her place. This team split the first two ties, as Testud defeated Sabine Appelmans, but Pitkowski fell to the Belgian No. 1 Dominique Van Roost. Van Roost then allowed Belgium to take the lead, beating Testud in two close sets, but Pitkowski fought back from one set down to beat Appelmans, and Fusai and Tauziat easily won the doubles rubber to take the tie.\nFrance has a difficult draw for her next tie, however, as the Swiss were accompanied by World No. 1 Martina Hingis and upcoming teenager Patty Schnyder, who had won five titles in the year. Despite the formidable opposition, captain Yannick Noah refused to allow Testud or Pierce, who had recently fallen out of the Top 10, to join the team due to an ankle injury and a poor attitude respectively. The team was thus led by the new French No. 1, World No. 10 and Wimbledon finalist Tauziat, with Julie Halard-Decugis, who was coming back from injury, and former junior world champion Amélie Mauresmo joining Fusai to make up the team. The tie ended up being a disaster for the French, as Hingis and Schnyder both defeated Halard-Decugis and Mauresmo each, despite the latter proving a surprisingly tough opponent and taking both her matches to three sets, before Emmanuelle Gagliardi and Schnyder teamed up to upset Fusai and Tauziat in doubles. Despite the poor result, Mauresmo's performance was lauded by her teammates.\nNoah stepped down as captain in September 1998, a move that upset the players, and was replaced by Davis Cup captain Guy Forget. At the beginning of 1999, Mauresmo gained further success by reaching the final of the Australian Open, defeating No. 1 Lindsay Davenport en route. This good result allowed her to become one of four Frenchwomen to reach the Top 15 (alongside Pierce, Tauziat and Testud), and owed to her being included in the team's first tie against Russia. However, they were upset, 2–3, due a poor singles performance from Tauziat and a loss in the decisive doubles.\nThe fact that France had remained in the World Group for so long meant that for the 2000 Fed Cup, they once again automatically qualified for the highest level of competition. This time, the World Group took place in three different pools, with the French being drawn in Pool C alongside Belgium, Russia and Australia. The French team had even more depth this year, with Pierce holding up as French singles and doubles No. 1 (at World No. 4 in both), while Tauziat, Halard-Decugis and Testud were 5 and 10, 9 and 15, and 11 and 14 in singles and doubles. Mauresmo and Fusai rounded out the respective French Top Fives, Mauresmo being No. 16 in singles and Fusai being No. 12 in doubles. However, Pierce and Mauresmo both opted out of play due to injury, leaving debutante and singles No. 20 Nathalie Dechy to take her place alongside Tauziat, Halard-Decugis and Testud.\nThe slightly weakened team still managed to defeat Russia with ease, with Halard-Decugis taking the tie by defeating the injured Russian No. 1 Anna Kournikova, who hit 43 unforced errors throughout the match. They then won over Australia, with Halard-Decugis and Tauziat winning the doubles rubber after Testud suffered a close loss to 1998 Junior champion Jelena Dokic. From this point they were expected to win the pool, as the remaining team, Belgium, was without its top players Van Roost and Appelmans and thus led by sixteen-year-old Kim Clijsters. Nevertheless, the Belgians managed to upset the French with Callens and Clijsters stunning Halard-Decugis and Tauziat in singles. The Belgians then followed up their surprise win with a defeat of Russia, which sealed their win of the pool and therefore France's denial of a chance in the final stage.\nFrance's inability to reach the finals in 2000 meant that they were forced to play through World Group play-offs to reach the 2001 World Group. They were drawn against Italy, who were in a midst of internal turmoil at that moment and thus were led by their No. 5 and World No. 102 Adriana Serra Zanetti. This meant that, although Pierce was struggling with injury and Tauziat was in trouble after her Wimbledon performance, the team, led by World No. 7 and new French No. 1 Mauresmo, was still expected to easily win. Alongside Mauresmo was Testud, who had recently had an eye injury, and Dechy and young newcomer Virginie Razzano, who were due to play doubles. Ultimately, the tie went as predicted as Mauresmo and Testud dominated the Italians in singles to claim the victory.\nNow part of the 2001 World Group, France was placed in Pool A along with Argentina, Czech Republic and Russia. Joined by their top three players: Mauresmo, Tauziat, and Testud (No. 7, 11 and 14 respectively), the French team was predicted to perform well in competition, since their closest rivals in Russia were again without their No. 1 Anna Kournikova due to injury, and so were led by the inexperienced World No. 12 Elena Dementieva. The French began strongly, defeating the Czechs without losing a set, but the Russians managed to upset France with their two singles players, Dementieva and Nadia Petrova defeating Testud and Mauresmo. Although the team then beat Argentina in spite of a penalty placed against them due to a last-moment team switch-up on the first rubber, their loss was enough to ensure they would once again fail to qualify for the final.\nThe Fed Cup format changed again for 2002, with the World Group featuring a four-round knockout tournament featuring sixteen teams in the first round. France was once again drawn against Argentina for their first tie, to be played in the South American country. They won, 3–2, with Mauresmo, still the French No. 1, continuing to impress in singles, to set up a quarterfinal tie against Slovakia. Mauresmo, who reached the semifinals of Wimbledon a few weeks ago, once again led to French, while upcoming teenager and Pacific Life Open champion Daniela Hantuchová led the Slovaks. The French team were upset by the Slovaks, with Mauresmo getting beaten in three sets by Hantuchová and Suchá defeating Dechy, who was tearful after the defeat. Slovakia went on to win the 2002 competition and claim the first ITF World No. 1 spot, while France were placed at No. 6.\nFor 2003, France was drawn against Colombia in the first round; a match anticipated to be a clear French victory since the two highest ranked Frenchwomen (Mauresmo and Dechy) were over forty-five places higher than the top Colombian (Fabiola Zuluaga), who was also the only Colombian in the top two hundred. Nevertheless, Forget and Mauresmo were becoming increasingly frustrated with the seeming lack of success of the team since 1997, making a victory key for team morale. The team started off well, accumulating a 2–0 advantage with Dechy removing Zuluaga and Mauresmo winning by default as Catalina Castaño retired due to dehydration, before France sealed the win as Mauresmo, despite citing her game as needing improvements, beat Zuluaga in straight sets. They had a daunting next round, however, against the ITF No. 2 team Spain. Mauresmo, who had been struggling with a rib injury, skipped Wimbledon to prepare for the tie. This paid against the Spanish, weakened by the absence of Conchita Martínez and the recent retirement of Arantxa Sánchez Vicario, as they dominated in the singles ties to advance to the semifinals with Russia. Pierce returned to the team, having embarked on a small comeback in recent months, joining Mauresmo in playing singles. Despite Russia having four Top 15 players in Elena Dementieva, Anastasia Myskina, Nadia Petrova and Vera Zvonareva, No. 4 Mauresmo easily defeated Zvonareva, 6–2, 6–2, to get off the French to a fantastic start. Pierce dropped a match point to be defeated in the second rubber by Myskina, but the two Frenchwomen eventually beat the Russians in the next two matches to advance to their first final since their 1997 victory.\nThe French played the United States in the final, only a few days after the semifinals, with Pierce and Mauresmo once again leading in singles; Pierce in particular receiving praise for her performance. Despite the newfound presence of unbeaten Fed Cup player and multiple major champion Martina Navratilova, the American team was missing many of its top singles players, meaning the French team had a good chance to succeed. This was fulfilled, with Mauresmo thrashing 30-year-old Lisa Raymond in straight sets, and Pierce outlasting Meghann Shaughnessy, 6–3, 3–6, 8–6. Mauresmo then sealed the victory, beating Shaughnessy, 6–2, 6–1, Émilie Loit completed a singles clean sweep with a defeat of Alexandra Stevenson. Americans Navratilova and Raymond then teamed to take the doubles rubber. France's Fed Cup victory was their second and allowed them to be just the sixth country to win two titles, as well as the only one of those countries to have a 100% success rate in finals. In addition, following the win they claimed the ITF World No. 1 team ranking; just the second country to do so after Slovakia.\n2004–2007: World Group play\nAs the defending champions for 2004 and the World No. 1, France was the first seed in the World Group stage. For their first match, they were drawn against Germany, with the tie to be played on clay in Amiens. No. 3 Amélie Mauresmo led the French team with Nathalie Dechy, Mary Pierce and Émilie Loit, while the Germans were led by No. 100 Anna-Lena Grönefeld. The French began very well: Dechy recovered after a shaky start to beat Grönefeld in three sets, while Mauresmo only dropped three games to beat Barbara Rittner. Mauresmo then won the tie for France, defeating Grönefeld, before Loit, Dechy and Mauresmo respectively won the next singles and doubles rubbers to complete a whitewash victory to the quarterfinals.\nPlayers\n{|\n| valign=\"top\" |\nMost ties played\n{| class=\"wikitable sortable\" style=\"text-align: center;\" style=font-size:90%\n|-\n!#\n!Name\n!FRA career\n!Ties\n!Tot W/L\n|-\n|1\n|align=\"left\"|\n|1985–2001\n|40\n|33–21\n|-\n|2\n|align=\"left\"|\n|1969–1980\n|33\n|26–25\n|-\n|3\n|align=\"left\"|\n|1963–1979\n|27\n|31–17\n|-\n|4\n|align=\"left\"|\n|1990–2005\n|22\n|18–14\n|-\n|5\n|align=\"left\"|\n|1998–2009\n|21\n|32–11\n|-\n|6\n|align=\"left\"|\n|1990–2000\n|19\n|22–13\n|-\n|7\n|align=\"left\"|\n|2000–2009\n|18\n|17–15\n|-\n|8\n|align=\"left\"|\n|1977–1982\n|16\n|9–11\n|-\n|8\n|align=\"left\"|\n|1985–1993\n|16\n|12–8\n|-\n|10\n|align=\"left\"|\n|1977–1982\n|14\n|11–4\n|-\n|}\n| valign=\"top\" |\nMost singles wins\n{| class=\"wikitable sortable\" style=\"text-align: center;\" style=font-size:90%\n|-\n!#\n!Name\n!FRA career\n!Ties\n!Sin W/L\n!Dou W/L\n|-\n|1\n|align=\"left\"|\n|1998–2009\n|21\n|30–9\n|2–2\n|-\n|2\n|align=\"left\"|\n|1990–2005\n|22\n|16–10\n|2–4\n|-\n|2\n|align=\"left\"|\n|1963–1979\n|27\n|16–8\n|15–9\n|-\n|4\n|align=\"left\"|\n|1969–1980\n|35\n|14–16\n|13–10\n|-\n|5\n|align=\"left\"|\n|1985–2001\n|40\n|13–12\n|20–9\n|-\n|5\n|align=\"left\"|\n|1990–2000\n|19\n|13–10\n|9–3\n|-\n|5\n|align=\"left\"|\n|2000–2009\n|18\n|13–7\n|4–8\n|-\n|8\n|align=\"left\"|\n|2001–\n|13\n|9–3\n|5–4\n|-\n|8\n|align=\"left\"|\n|1977–1982\n|14\n|9–3\n|2–1\n|-\n|10\n|align=\"left\"|\n|1997–2002\n|10\n|8–5\n|1–0\n|}\n| valign=\"top\" |\nMost doubles wins\n{| class=\"wikitable sortable\" style=\"text-align: center;\" style=font-size:90%\n|-\n!#\n!Name\n!FRA career\n!Ties\n!Dou W/L\n!Sin W/L\n|-\n|1\n|align=\"left\"|\n|1985–2001\n|40\n|20–9\n|13–12\n|-\n|2\n|align=\"left\"|\n|1963–1979\n|27\n|15–9\n|16–8\n|-\n|3\n|align=\"left\"|\n|1969–1980\n|33\n|13–10\n|14–16\n|-\n|4\n|align=\"left\"|\n|1985–1993\n|16\n|9–5\n|3–3\n|-\n|4\n|align=\"left\"|\n|1990–2000\n|19\n|9–3\n|13–10\n|-\n|6\n|align=\"left\"|\n|1990–2000\n|16\n|7–4\n|2–7\n|-\n|7\n|align=\"left\"|\n|1968–1976\n|11\n|6–5\n|2–2\n|-\n|8\n|align=\"left\"|\n|2001–\n|13\n|5–4\n|9–3\n|-\n|8\n|align=\"left\"|\n|1983–1988\n|8\n|5–3\n|0–1\n|-\n|8\n|align=\"left\"|\n|1994–1998\n|6\n|5–1\n|1–1\n|-\n|}\n|}\nCaptains\nStatistical summary\n{| class=\"wikitable sortable\" style=\"text-align: center; font-size:90%;\"\n|-\n!Name\n!Career span\n!Ties\n!W\n!L\n!%\n!class=\"unsortable\"|Best Achievement\n!class=\"unsortable\"|Best Player\n|-\n|style=\"text-align: left;\"|\n|1963–1966\n|11\n|7\n|4\n|63.63\n|style=\"text-align: left;\" |1964 – SF\n|style=\"text-align: left;\" |Françoise Dürr\n|-\n|style=\"text-align: left;\"|\n|1967–1968\n|3\n|1\n|2\n|33.33\n|style=\"text-align: left;\" |1968 – QF\n|style=\"text-align: left;\" |Rosy Darmon\n|-\n|style=\"text-align: left;\" |\n|1969–1970, 1973–1975, 1977\n|20\n|13\n|7\n|65.00\n|style=\"text-align: left;\" |1975 – SF\n|style=\"text-align: left;\" |Gail Benedetti\n|-\n|style=\"text-align: left;\"|\n|1971–1972\n|6\n|4\n|2\n|66.67\n|style=\"text-align: left;\" |1971 – SF\n|style=\"text-align: left;\" |Françoise Dürr\n|-\n|style=\"text-align: left;\" |\n|1976, 1978, 1992\n|10\n|6\n|4\n|60.00\n|style=\"text-align: left;\" |1978 – QF, 1992 – QF\n|style=\"text-align: left;\" |Gail Benedetti\n|-\n|style=\"text-align: left;\"|\n|1979–1982\n|15\n|10\n|5\n|66.67\n|style=\"text-align: left;\" |1979 – QF\n|style=\"text-align: left;\" |Brigitte Simon-Glinel\n|-\n|style=\"text-align: left;\" |\n|1983, 1993–1996\n|14\n|8\n|6\n|57.14\n|style=\"text-align: left;\" |1993 – SF, 1994 – SF\n|style=\"text-align: left;\" |Julie Halard-Decugis\n|-\n|style=\"text-align: left;\"|\n|1984–1985\n|6\n|3\n|3\n|50.00\n|style=\"text-align: left;\" |1984 – QF\n|style=\"text-align: left;\" |Catherine Tanvier\n|-\n|style=\"text-align: left;\"|\n|1986–1991\n|13\n|6\n|7\n|46.15\n|style=\"text-align: left;\" |1990 – QF\n|style=\"text-align: left;\" |Nathalie Tauziat\n|-\n|style=\"text-align: left;\"|\n|1997–1998, 2016–2018\n|6\n|4\n|2\n|66.67\n|style=\"text-align: left;\" |1997 – W\n|style=\"text-align: left;\" |Mary Pierce\n|-\n|style=\"text-align: left;\"|\n|1999–2004\n|18\n|13\n|5\n|72.22\n|style=\"text-align: left;\" |2003 – W\n|style=\"text-align: left;\" |Amélie Mauresmo\n|-\n|style=\"text-align: left;\"|\n|2005–2008\n|9\n|5\n|4\n|55.55\n|style=\"text-align: left;\" |2005 – F\n|style=\"text-align: left;\" |Amélie Mauresmo\n|-\n|style=\"text-align: left;\"|\n|2009–2012\n|8\n|3\n|5\n|37.50\n|style=\"text-align: left;\" |2009 – QF, 2010 – QF\n|style=\"text-align: left;\" |Marion Bartoli\n|-\n|style=\"text-align: left;\"|\n|2013–2016\n|9\n|6\n|3\n|66.67\n|style=\"text-align: left;\" |2016 – F\n|style=\"text-align: left;\" |Caroline Garcia\n|-\n|}\nResults\n{|class=wikitable style=text-align:center;font-size:80%\n!Tournament!!1963!!1964!!1965!!1966!!1967!!1968!!1969!!1970!!1971!!1972!!1973!!1974!!1975!!1976!!1977!!1978!!1979!!1980!!1981!!1982!!1983!!1984!!1985!!1986!!1987!!1988!!1989!!1990!!1991!!1992!!1993!!1994!!W–L\n|-\n|colspan=40 align=left|Federation Cup\n|-\n|align=left|World Group\n|bgcolor=ffebcd|QF\n|bgcolor=yellow|SF\n|bgcolor=yellow|SF\n|bgcolor=ffebcd|QF\n|bgcolor=ffebcd|QF\n|bgcolor=ffebcd|QF\n|bgcolor=ffebcd|QF\n|bgcolor=ffebcd|QF\n|bgcolor=yellow|SF\n|bgcolor=ffebcd|QF\n|bgcolor=afeeee|1R\n|bgcolor=ffebcd|QF\n|bgcolor=yellow|SF\n|bgcolor=afeeee|1R\n|bgcolor=ffebcd|QF\n|bgcolor=ffebcd|QF\n|bgcolor=ffebcd|QF\n|bgcolor=afeeee|1R\n|bgcolor=afeeee|2R\n|bgcolor=afeeee|1R\n|bgcolor=afeeee|1R\n|bgcolor=ffebcd|QF\n|bgcolor=afeeee|1R\n|bgcolor=afeeee|2R\n|bgcolor=afeeee|2R\n|bgcolor=afeeee|2R\n|bgcolor=afeeee|1R\n|bgcolor=ffebcd|QF\n|bgcolor=afeeee|1R\n|bgcolor=ffebcd|QF\n|bgcolor=yellow|SF\n|bgcolor=yellow|SF\n|42–32\n|-\n|align=left|Consolation Rounds\n|colspan=6 style=color:#ccc|Not Held\n|A\n|A\n|A\n|A\n|bgcolor=yellow|SF\n|style=color:#ccc|NH\n|A\n|bgcolor=thistle|F\n|A\n|style=color:#ccc|NH\n|A\n|bgcolor=thistle|F\n|bgcolor=afeeee|2R\n|bgcolor=lime|W\n|bgcolor=afeeee|2R\n|A\n|bgcolor=ffebcd|QF\n|A\n|A\n|A\n|bgcolor=afeeee|2R\n|A\n|A\n|A\n|A\n|style=color:#ccc|NH\n|13–5\n|-\n!style=text-align:left|Win–loss\n!1–1\n!3–1\n!2–1\n!1–1\n!0–1\n!1–1\n!1–1\n!2–1\n!2–1\n!2–1\n!3–2\n!2–1\n!3–1\n!2–2\n!2–1\n!2–1\n!2–1\n!3–2\n!1–2\n!4–1\n!0–2\n!2–1\n!1–2\n!1–1\n!1–1\n!1–1\n!0–2\n!2–1\n!1–1\n!2–1\n!3–1\n!3–1\n!56–37\n|-\n|}\n{|class=wikitable style=text-align:center;font-size:80%\n!Tournament!!1995!!1996!!1997!!1998!!1999!!2000!!2001!!2002!!2003!!2004!!2005!!2006!!2007!!2008!!2009!!2010!!2011!!2012!!2013!!2014!!2015!!2016!!2017!!2018!!2019!!W–L\n|-\n|colspan=40 align=left|Fed Cup\n|-\n|align=left|World Group\n|bgcolor=yellow|SF\n|bgcolor=yellow|SF\n|bgcolor=lime|W\n|bgcolor=yellow|SF\n|bgcolor=ffebcd|QF\n|bgcolor=afeeee|5th\n|bgcolor=afeeee|3rd\n|bgcolor=ffebcd|QF\n|bgcolor=lime|W\n|bgcolor=thistle|F\n|bgcolor=thistle|F\n|bgcolor=ffebcd|QF\n|bgcolor=yellow|SF\n|bgcolor=ffebcd|QF\n|bgcolor=ffebcd|QF\n|bgcolor=ffebcd|QF\n|bgcolor=ffebcd|QF\n|A\n|A\n|A\n|bgcolor=yellow|SF\n|bgcolor=thistle|F\n|bgcolor=ffebcd|QF\n|bgcolor=yellow|SF\n|bgcolor=lime|W\n|38–28\n|-\n|align=left|World Group play-offs\n|A\n|A\n|A\n|A\n|A\n|style=color:#ccc|NH\n|bgcolor=lime|W\n|A\n|A\n|A\n|A\n|bgcolor=lime|W\n|A\n|bgcolor=lime|W\n|bgcolor=lime|W\n|bgcolor=lime|W\n|bgcolor=thistle|L\n|A\n|A\n|bgcolor=lime|W\n|A\n|A\n|bgcolor=lime|W\n|A\n|A\n|10–1\n|-\n|align=left|World Group II\n|A\n|A\n|A\n|A\n|A\n|colspan=5 rowspan=2 style=color:#ccc|Not Held\n|A\n|A\n|A\n|A\n|A\n|A\n|A\n|bgcolor=thistle|L\n|bgcolor=thistle|L\n|bgcolor=lime|W\n|A\n|A\n|A\n|A\n|A\n|1–2\n|-\n|align=left|World Group II play-offs\n|A\n|A\n|A\n|A\n|A\n|A\n|A\n|A\n|A\n|A\n|A\n|A\n|bgcolor=lime|W\n|bgcolor=lime|W\n|A\n|A\n|A\n|A\n|A\n|A\n|2–0\n|-\n|align=left|Europe/Africa Group I\n|A\n|A\n|A\n|A\n|A\n|A\n|A\n|A\n|A\n|A\n|A\n|A\n|A\n|A\n|A\n|A\n|A\n|A\n|A\n|A\n|A\n|A\n|A\n|A\n|A\n|0–0\n|-\n!style=text-align:left|Win–loss\n!1–1\n!1–1\n!3–0\n!1–1\n!0–1\n!2–1\n!3–1\n!1–1\n!4–0\n!3–1\n!2–1\n!1–1\n!1–1\n!1–1\n!1–1\n!1–1\n!0–2\n!1–1\n!1–1\n!2–0\n!1–1\n!2–1\n!1-1\n!1-1\n!3-0\n!38–22\n|-\n!style=text-align:left|Year End Ranking\n|colspan=7 style=color:#ccc|\n|bgcolor=EEE8AA|6\n|bgcolor=lime|1\n|bgcolor=lime|1\n|bgcolor=thistle|2\n|bgcolor=99CCFF|3\n|bgcolor=99CCFF|3\n|bgcolor=EEE8AA|5\n|11\n|bgcolor=EEE8AA|9\n|15\n|16\n!\n!\n!\n|bgcolor=thistle|2\n!\n!\n|bgcolor=lime|1\n|-\n|}\n{|class=wikitable style=text-align:center;font-size:80%\n!Tournament!!2020–21!!2022!!2023!!2024!!W–L\n|-\n|colspan=40 align=left|Billie Jean King Cup\n|-\n|align=left|Finals\n|bgcolor=ffebcd|RR\n|A\n|bgcolor=ffebcd|RR\n|A\n|6-6\n|-\n|align=left|Qualifying round\n|A\n|bgcolor=thistle|L\n|bgcolor=lime|W\n|bgcolor=thistle|L\n|5-7\n|-\n|align=left|Play-Offs\n|A\n|bgcolor=lime|W\n|A\n|TBD\n|3-1\n|-\n!style=text-align:left|Win–loss\n!0-2\n!1-1\n!2-1\n!0-1\n!3-5\n|}\nRecords\nLongest winning streak\n{| class=\"wikitable\"\n|-\n! width=\"50\"| Year\n! width=\"225\"| Competition\n! width=\"150\"| Date\n! width=\"175\"| Location\n! width=\"150\"| Opponent\n! width=\"50\"| Score\n! width=\"60\"| Result\n|-\n| align=\"center\" rowspan=\"4\"| 2003\n| World Group, first round\n| align=\"center\"| 26–27 May\n| align=\"center\"|\n|\n| align=\"center\"| 5–0\n| align=\"center\" bgcolor=\"#98FB98\"| Won\n|-\n| World Group, Quarterfinals\n| align=\"center\"| 19–20 July\n| align=\"center\"| Oviedo (ESP)\n|\n| align=\"center\"| 4–1\n| align=\"center\" bgcolor=\"#98FB98\"| Won\n|-\n| World Group, Semifinals\n| align=\"center\"| 19–20 November 2003\n| align=\"center\" rowspan=\"2\"| Moscow (RUS)\n|\n| align=\"center\"| 3–2\n| align=\"center\" bgcolor=\"#98FB98\"| Won\n|-\n| World Group, Final\n| align=\"center\"| 22–23 November 2003\n| }}\n| align=\"center\"| 4–1\n| align=\"center\" bgcolor=\"#98FB98\"| Won\n|-\n| align=\"center\" rowspan=\"4\"| 2004\n| World Group, first round\n| align=\"center\"| 24–25 April 2004\n| align=\"center\"| Amiens (FRA)\n|\n| align=\"center\"| 5–0\n| align=\"center\" bgcolor=\"#98FB98\"| Won\n|-\n| World Group, Quarterfinals\n| align=\"center\"| 10–11 July 2004\n| align=\"center\"| Rimini (ITA)\n|\n| align=\"center\"| 3–2\n| align=\"center\" bgcolor=\"#98FB98\"| Won\n|-\n| World Group, Semifinals\n| align=\"center\"| 24–25 November 2004\n| align=\"center\" rowspan=\"2\"| Moscow (RUS)\n|\n| align=\"center\"| 5–0\n| align=\"center\" bgcolor=\"#98FB98\"| Won\n|-\n| World Group, Final\n| align=\"center\"|\n|\n| align=\"center\"| 2–3\n| align=\"center\" bgcolor=\"#FFA07A\"| Lost\n|}\nFinals: 6 (3 titles, 3 runners-up)\n{|class=\"sortable wikitable\" style=font-size:97%;background:#EBC2AF\n!Outcome\n!Year\n!width=300|Venue\n!Surface\n!width=130|Team\n!width=100|Opponents\n!width=140|Opposing Team\n!width=30|Score\n|-bgcolor=FFFFCC\n|bgcolor=98FB98|Winner||1997||Brabant Hall, 's-Hertogenbosch, Netherlands||Carpet (i)||Nathalie TauziatAlexandra FusaiSandrine TestudMary PierceAnne-Gaëlle Sidot||||Brenda Schultz-McCarthyMiriam OremansManon BollegrafCaroline Vis||4–1\n|-bgcolor=FFFFCC\n|bgcolor=98FB98|Winner||2003||Olympic Stadium, Moscow, Russia||Carpet (i)||Amélie MauresmoNathalie DechyÉmilie LoitMary PierceStéphanie Cohen-AloroVirginie Razzano||||Meghann ShaughnessyLisa RaymondAlexandra StevensonMartina Navratilova||4–1\n|-bgcolor=FFFFCC\n|bgcolor=98FB98|Winner||2019||RAC Arena, Perth, Australia||Hard||Alizé CornetCaroline GarciaFiona FerroKristina MladenovicPauline Parmentier||||Ashleigh BartyDaria GavrilovaKimberly BirrellPriscilla HonSamantha Stosur||3–2\n|-bgcolor=FFFFCC\n|bgcolor=FFA07A|Runner-up||2004||Ice Stadium Krylatskoe, Moscow, Russia||Carpet (i)||Nathalie DechyTatiana GolovinAmélie MauresmoÉmilie LoitMarion Bartoli||||Anastasia MyskinaSvetlana KuznetsovaVera Zvonareva||2–3\n|-\n|bgcolor=FFA07A|Runner-up||2005||Court Philippe Chatrier, Paris, France||Clay||Amélie MauresmoMary PierceVirginie RazzanoNathalie DechySéverine Beltrame||||Elena DementievaAnastasia MyskinaDinara Safina||2–3\n|-bgcolor=FFFFCC\n|bgcolor=FFA07A|Runner-up||2016||Rhénus Sport, Strasbourg, France||Hard (i)||Caroline GarciaKristina MladenovicAlizé CornetPauline Parmentier||||Karolína PlíškováPetra KvitováBarbora StrýcováLucie Hradecká||2–3\n|-\n|-bgcolor=98FB98|Winner||2019||\n|-\n|}\nMedia coverage\nFrance's Fed Cup matches are currently televised by France Télévisions.\nSee also\nNotes\nReferences\nExternal links\n*\n* [https://www.fft.fr/ Fédération Française de Tennis (French Tennis Federation)]"
    }
  ]
}