{
  "content": [
    {
      "type": "text",
      "text": "# Frederick Jackson Turner Award\n\nThe Frederick Jackson Turner Award is given each year by the Organization of American Historians for an author's first book on American history.\nIt was started in 1959, by the Mississippi Valley Historical Association, as the Prize Studies Award.\n{| class=\"wikitable\"\n|-\n! Year\n! Winner\n! Title\n|-\n|1959\n|Donald F. Warner\n| The Idea of Continuous Union: Agitation for the Annexation of Canada to the United States, 1849-1893 (University of Kentucky Press).\n|-\n|1960\n|No award given.\n|\n|-\n|1961\n|Robert E. Quirk\n| An Affair of Honor: Woodrow Wilson and the Occupation of Vera Cruz (University Press of Kentucky).\n|-\n|1962\n|Donald O. Johnson\n| The Challenge to American Freedoms: World War I and the Rise of the American Civil Liberties Union (University of Kentucky Press).\n|-\n|1963\n|No award given.\n|\n|-\n|1964\n|No award given.\n|\n|-\n|1965\n|Ronald E. Shaw\n| Erie Water West: A History of the Erie Canal, 1792-1854 (University of Kentucky).\n|-\n|1966\n|James T. Patterson\n| Congressional Conservatism and the New Deal: The Growth of the Conservative Coalition in Congress, 1933-1939 (University of Kentucky Press).\n|-\n|1967\n|Ross E. Paulson\n| Radicalism and Reform, 1837-1937 (University of Kentucky Press).\n|-\n|1968\n|No award given.\n|\n|-\n|1969\n|Ross Gregory\n| Walter Hines Page: Ambassador to the Court of St. James (University of Kentucky Press).\n|-\n|1970\n|Robert Griffith\n| The Politics of Fear: Joseph McCarthy and the Senate (University of Kentucky Press).\n|-\n|1971\n|John Garry Clifford\n| The Citizen Soldiers (University of Kentucky Press).\n|-\n|1972\n|Edward A. Purcell, Jr.\n| The Crisis of Democratic Theory: Scientific Naturalism and the Problem of Value (University of Kentucky Press).\n|-\n|1973\n|Mary O. Furner\n| Advocacy and Objectivity: A Crisis in the Professionalization of American Social Science, 1865-1905 (University of Kentucky Press).\n|-\n|1974\n|Thomas H. Bender\n| Toward an Urban Vision (University of Kentucky Press).\n|-\n|1975\n|No award given.\n|\n|-\n|1976\n|No award given.\n|\n|-\n|1977\n|Merritt Roe Smith,\n|Harpers Ferry Armory and the New Technology (Cornell University Press).\n|-\n|1978\n|Daniel T. Rodgers\n| Work Ethic in Industrial America, 1850-1920 (University of Chicago Press).\n|-\n|1979\n|Charles F. Fanning, Jr.\n| Peter Finley Dunne and Mr. Dooley: The Chicago Years (University of Kentucky Press).\n|-\n|1980\n|John Mack Faragher\n| Women and Men on the Overland Trail (Yale University Press).\n|-\n|1981\n|William C. Widenor\n|Henry Cabot Lodge and the Search for an American Foreign Policy (University of California Press).\n|-\n|1982\n|Clayborne Carson\n|To Struggle: SNCC and the Black Awakening of the 1960s (Harvard University Press).\n|-\n|1983\n|Rosalind Rosenberg\n|Beyond Separate Spheres (Yale University Press).\n|-\n|1984\n|Steven Hahn\n|The Roots of Southern Populism: Yeoman Farmers and the Transformation of the Georgia Upcountry, 1850-1890 (Oxford University Press).\n|-\n|1985\n|Barton C. Shaw\n|''The Wool-Hat Boys: Georgia's Populist Party (Louisiana State University Press).\n|-\n|1985\n|Sean Wilentz\n| Chants Democratic: New York City and the Rise of the American Working Class, 1788-1850 (Oxford University Press).\n|-\n|1986\n|Chester M. Morgan\n|Redneck Liberal: Theodore G. Bilbo and the New Deal (Louisiana State University Press).\n|-\n|1987\n|Alexander Keyssar\n|Out of Work: The First Century of Unemployment in Massachusetts (Cambridge University Press).\n|-\n|1988\n|David Montejano\n|Anglos and Mexicans in the Making of Texas, 1836-1986 (University of Texas Press).\n|-\n|1989\n|Bruce Nelson\n|Workers on the Waterfront: Seamen, Longshoremen, and Unionism in the 1930s (University of Illinois Press).\n|-\n|1990\n|James H. Merrell\n|The Indians' New World: Catawbas and their Neighbors from European Contact Through the Era of Removal (The University of North Carolina Press for the Institute of Early American History and Culture).\n|-\n|1991\n|Christopher F. Clark\n|The Roots of Rural Capitalism: Western Massachusetts, 1780-1860 (Cornell University Press).\n|-\n|1992\n|Ramón A. Gutiérrez\n|When Jesus Came, the Corn Mothers Went Away: Marriage, Sexuality, and Power in New Mexico, 1500-1846 (Stanford University Press).\n|-\n|1993\n|Daniel K. Richter\n|The Ordeal of the Longhouse: The Peoples of the Iroquois League in the Era of European Colonization (The University of North Carolina Press for the Institute of Early American History and Culture).\n|-\n|1994\n|Peter Way\n|Common Labour: Workers & the Digging of North American Canals 1780-1860 (Cambridge University Press).\n|-\n|1995\n|George Chauncey\n|Gay New York: Gender, Urban Culture, and the Making of the Gay Male World, 1890-1940 (Basic Books).\n|-\n|1996\n|James T. Campbell\n|Songs of Zion: The African Methodist Episcopal Church in the United States and South Africa (Oxford University Press).\n|-\n|1997\n|Glenda Elizabeth Gilmore\n|Gender and Jim Crow: Women and the Politics of White Supremacy in North Carolina, 1896-1920, (The University of North Carolina Press).\n|-\n|1998\n|Neil Foley\n|White Scourge: Mexicans, Blacks, and Poor Whites in Texas Cotton Culture, (University of California Press).\n|-\n|1999\n|Amy Dru Stanley\n|From Bondage to Contract: Wage Labor, Marriage, and the Market in the Age of Slave Emancipation (Cambridge University Press).\n|-\n|2000\n|Timothy B. Tyson, University of Wisconsin-Madison\n|Radio Free Dixie: Robert F. Williams and the Roots of Black Power (University of North Carolina Press).\n|-\n|2000\n|Walter Johnson, New York University\n|Soul by Soul: Life Inside the Antebellum Slave Market (Harvard University Press).\n|-\n|2001\n|Lisa Norling,  University of Minnesota\n|Captain Ahab Had a Wife:  New England Women and the Whalefishery, 1720-1870 (The University of North Carolina Press).\n|-\n|2002\n|Adam Rome, Pennsylvania State University\n|The Bulldozer in the Countryside:  Suburban Sprawl and the Rise of American Environmentalism (Cambridge University Press).\n|-\n|2003\n|James F. Brooks,  University of California, Santa Barbara\n|Captives and Cousins:  Slavery, Kinship, and Community in the Southwest Borderlands (University of North Carolina Press).\n|-\n|2004\n|Thomas A. Guglielmo, University of Notre Dame\n|White on Arrival:  Italians, Race, Color, and Power in Chicago, 1890-1945 (Oxford University Press).\n|-\n|2005\n|Mae M. Ngai, University of Chicago\n|Impossible Subjects: Illegal Aliens and the Making of Modern America (Princeton University Press).\n|-\n|2006\n|Tiya Miles, University of Michigan\n|Ties that Bind: The Story of an Afro-Cherokee Family in Slavery and Freedom (University of California Press).\n|-\n|2006 Honorable Mention\n|Eiichiro Azuma, University of Pennsylvania\n|Between Two Empires: Race, History, and Transnationalism in Japanese America (Oxford University Press).\n|-\n|2007\n|Ned Blackhawk, University of Wisconsin, Madison\n|Violence over the Land: Indians and Empires in the Early American West (Harvard University Press).\n|-\n|2007 Honorable Mention\n|Aaron Sachs, Cornell University\n|The Humboldt Current: Nineteenth-Century Exploration and the Roots of American Environmentalism (Viking).\n|-\n|2008\n|Charles Postel, California State University, Sacramento\n|The Populist Vision (Oxford University Press).\n|-\n|2009\n|Leslie Brown, Williams College\n|Upbuilding Black Durham: Gender, Class, and Black Community Development in the Jim Crow South (The University of North Carolina Press).\n|-\n|2010\n|Bethany Moreton, University of Georgia\n|To Serve God and Wal-Mart: The Making of Christian Free Enterprise (Harvard University Press).\n|-\n|2010 Honorable Mention\n|Charlotte Brooks, Baruch College\n|Alien Neighbors, Foreign Friends: Asian Americans, Housing, and the Transformation of Urban California (University of Chicago Press).\n|-\n|2010 Honorable Mention\n|Christine Keiner, Rochester Institute of Technology\n|The Oyster Question: Scientists, Watermen, and the Maryland Chesapeake Bay since 1880 (University of Georgia Press).\n|-\n|2010 Honorable Mention\n|Lisa Levenstein, The University of North Carolina at Greensboro\n|A Movement without Marches: African American Women and the Politics of Poverty in Postwar Philadelphia (University of North Carolina Press).\n|-\n|2011\n|Danielle L. McGuire, Wayne State University\n|At the Dark End of the Street: Black Women, Rape, and Resistance–a New History of the Civil Rights Movement from Rosa Parks to the Rise of Black Power (Alfred A. Knopf).\n|-\n|2012\n|David Sehat, Georgia State University\n|The Myth of American Religious Freedom (Oxford University Press).\n|-\n|2012 Honorable Mention\n|James T. Sparrow, University of Chicago\n|Warfare State: World War II Americans and the Age of Big Government (Oxford University Press).\n|-\n|2013\n|Jonathan Levy, Princeton University\n|Freaks of Fortune: The Emerging World of Capitalism and Risk in America (Harvard University Press).\n|-\n|2014\n|Geraldo L. Cadava, Northwestern University\n|Standing on Common Ground: The Making of a Sunbelt Borderland (Harvard University Press).\n|-\n|2014 Honorable Mention\n|Dawn Bohulano Mabalon, San Francisco State University\n|Little Manila Is in the Heart: The Making of the Filipina/o American Community in Stockton, California (Duke University Press).\n|-\n|2015\n|Allyson Hobbs, Stanford University\n|A Chosen Exile: A History of Racial Passing in American Life (Harvard University Press).\n|-\n|2015 Honorable Mention\n|Jamie Cohen-Cole, George Washington University\n|The Open Mind: Cold War Politics and the Sciences of Human Nature (University of Chicago Press).\n|-\n|2015 Honorable Mention\n|Katherine C. Mooney, Florida State University\n|Race Horse Men: How Slavery and Freedom Were Made at the Racetrack (Harvard University Press).\n|-\n|2015 Honorable Mention\n|Kyle G. Volk, University of Montana\n|Moral Minorities and the Making of American Democracy (Oxford University Press).\n|-\n|2016\n|Mark G. Hanna,University of California, San Diego\n|Pirate Nests and the Rise of the British Empire, 1570-1740 (University of North Carolina Press for the Omohundro Institute of Early American History and Culture).\n|-\n|2016 Honorable Mention\n|Joshua L. Reid, University of Washington\n|The Sea is My Country: The Maritime World of the Makahs (Yale University Press).\n|-\n|2016 Honorable Mention\n|Andrew J. Torget, University of North Texas\n|Seeds of Empire: Cotton, Slavery, and the Transformation of the Texas Borderlands, 1800-1850 (University of North Carolina Press).\n|-\n|2017\n|Max Krochmal,Texas Christian University\n|Blue Texas: The Making of a Multiracial Democratic Coalition in the Civil Rights Era (University of North Carolina Press).\n|-\n|2018\n|Brian McCammack, Lake Forest College\n|Landscapes of Hope: Nature and the Great Migration in Chicago (Harvard University Press).\n|-\n|2018 Honorable Mention\n|Courtney Fullilove, Wesleyan University\n|The Profit of the Earth: The Global Seeds of American Agriculture (University of Chicago Press).\n|-\n|2018 Honorable Mention\n|Julilly Kohler-Hausmann, Cornell University\n|Getting Tough: Welfare and Imprisonment in 1970s America (Princeton University Press).\n|-\n|2019\n|Elizabeth Gillespie McRae, Western Carolina University\n|Mothers of Massive Resistance: White Women and the Politics of White Supremacy (Oxford University Press).\n|-\n|2019 Finalist\n|Jonathan Gienapp, Stanford University\n|The Second Creation: Fixing the American Constitution in the Founding Era (Harvard University Press).\n|-\n|2019 Finalist\n|Monica Muñoz Martinez, Brown University\n|The Injustice Never Leaves You: Anti-Mexican Violence in Texas (Harvard University Press).\n|-\n|2019 Finalist\n|Ana Raquel Minian, Stanford University\n|Undocumented Lives: The Untold Story of Mexican Migration (Harvard University Press).\n|-\n|2020\n|Vincent DiGirolamo, Baruch College\n|Crying the News: A History of America's Newsboys (Oxford University Press).\n|-\n|2021\n|Johanna Fernandez, Baruch College\n|The Young Lords: A Radical History (University of North Carolina Press).\n|-\n|2022\n|Gabriel Winant, University of Chicago\n|The Next Shift: The Fall of Industry and the Rise of Health Care in Rust Belt America (Harvard University Press).\n|-\n|2023\n|Kathryn Olivarius, Stanford University\n|Necropolis: Disease, Power, and Capitalism in the Cotton Kingdom (Belknap Press of Harvard University Press)\n|-\n|2024\n|Michael A. Blaakman, Princeton University\n|Speculation Nation: Land Mania in the Revolutionary American Republic'' (University of Pennsylvania Press)\n|}\nSee also\n* List of history awards\nReferences"
    }
  ]
}