{
  "content": [
    {
      "type": "text",
      "text": "# Fred Anderson (historian)\n\n| birth_place      = United States\n| death_date       =\n| death_place      =\n| resting_place    =\n| occupation       = Historian\n| language         =\n| nationality      =\n| citizenship      =\n| education        =\n| alma_mater       = Colorado State University (BA)Harvard University (PhD)\n| period           =\n| genre            = Non-fiction\n| subject          = North American history\n| movement         =\n| notableworks     = Crucible of War: The Seven Years' War and the Fate of Empire in British North America, 1754-1766\n| spouse           = Virginia Anderson\n| partner(s)       =\n| children         =\n| relative(s)      =\n| awards           = Jamestown Prize, Institute of Early American History and Culture, 1982, for A People's Army; citation of honor, Society of Colonial Wars, 1987, for A People's Army; National Book Critics Circle Award nomination, Colorado Book Award, Francis Parkman Prize, Mark Lynton History Prize, all 2001, all for The Crucible of War.\n| signature        =\n| signature_alt    =\n| website          =\n| portaldisp       =\n}}\nFred Anderson (born 1949) is an American historian of early North American history.\nEducation and career\nAnderson received his B.A. from Colorado State University in 1971 and his Ph.D. from Harvard in 1981. He has taught at Harvard and at the University of Colorado, Boulder, where he is currently Professor Emeritus of History. He has held fellowships from the National Endowment for the Humanities, the Charles Warren Center of Harvard University, the Guggenheim Foundation and the Rockefeller Foundation.\nHe is the author or editor of five books including ''Crucible of War: The Seven Years' War and the Fate of Empire in British North America, 1754-1766 (New York: Alfred A. Knopf, February 11, 2000; London: Faber and Faber, 2000), which won the Mark Lynton History Prize and the 2001 Francis Parkman Prize as best book in American history. Together with Andrew Cayton (Miami University), he has published The Dominion of War: Empire and Liberty in North America, 1500-2000 (New York: Viking; London: Atlantic Books, 2005).\nHis newest book, The War That Made America: A Short History of the French and Indian War (Viking) is a companion to the four-hour PBS series \"The War that Made America,\" which was broadcast January 18 and 25, 2006. The series and book were released to coincide with the 250th anniversary of the French and Indian War, organized by French and Indian War 250 Inc., as part of a collaborative effort with a variety of museums, historic sites and educational workshops spanning several states.\nIn late 2006, it was announced that Anderson and Cayton have been assigned the volume on the later colonial period (Volume II: 1674-1764) of the newest (and partially published) Oxford History of the United States.\nProfessor Anderson retired from the University of Colorado-Boulder in 2018.\nPublications\nAs Sole Author\n*A People's Army: Massachusetts Soldiers and Society in the Seven Years' War.  Univ of North Carolina Press, 1984.\n*Crucible of War: The Seven Years' War and the Fate of Empire in British North America, 1754-1766. Knopf, 2000.\n*The War That Made America: A Short History of the French and Indian War.  Viking Adult, 2005.\nWith Andrew Cayton\n*The Dominion of War: Empire and Liberty in North America, 1500-2000.  Viking Adult, 2004.\nAs editor\n*George Washington Remembers: Reflections on the French and Indian War.  Rowman & Littlefield Publishers, 2004.\nReferences\nExternal links\n* [http://www.pritzkermilitary.org/whats_on/pritzker-military-presents/fred-anderson-andrew-cayton-dominion-war/ Interview] on The Dominion of War'' at the Pritzker Military Museum & Library\n*[http://www.colorado.edu/honors/faculty/anderson.html University of Colorado official faculty page]\n*"
    }
  ]
}