{
  "content": [
    {
      "type": "text",
      "text": "# Frederick Stewart (colonial administrator)\n\nFrederick Stewart () (17 October 1836 – 29 September 1889) was an educationist and British colonial administrator, who served as the Colonial Secretary in Hong Kong from 1887 to 1889. He is considered \"The Founder of Hong Kong Education\" for integrating a modern western-style education model into the colonial Hong Kong school systems. Stewart could speak fluent Cantonese, which was vital to his work in the 19th century.\nEarly life\nThe son of James Stewart and Jean Brown, Stewart was born in Rathen, Aberdeenshire in Scotland on 30 October 1836. He was educated in King's College at the University of Aberdeen.\nCareer\nHe was teaching in a temporary position at Stubbington House School when a post was announced in the Aberdeen Journal on 7 August 1861 for the headmaster position of the newly established \"Government Central School\", known today as Queen's College. Five months later, Stewart would accept the position, reaching Hong Kong at the age of 25 on 15 February 1862. Ho Kai was one of his pupils.  As part of a new British government initiative, he also became the inspector for all government schools in Hong Kong that same year.\nOn 30 June 1865 Stewart became the first head of the \"Government Education Department\" in Hong Kong.  He resigned on 19 May 1881 at the age of 45.  In 1879 his alma mater, the University of Aberdeen, awarded him the honorary degree of LL.D for furthering the interests of education in Hong Kong.\nStewart was appointed police magistrate in 1881 and Registrar-General in 1883. From 1887 to 1889 he would serve as the Colonial Secretary, second only to the Governor of Hong Kong. Informally, he would also act as the leading advisor on educational matters in Hong Kong.  He was also the dean of the \"Faculty of Medicine\", the precursor of the University of Hong Kong until his death in 1889.\nMemory\nSteward died in sudden illness while in the office of Colonial Secretary in 1889. A memorial stained glass window was erected in St. John's Cathedral. Stewart Terrace (十間) on the Peak was named after him.\nSee also\n* Grant School (Hong Kong)\nReferences\nExternal links\n*[https://web.archive.org/web/20051024001126/http://www.cefc.com.hk/uk/pc/articles/art_ligne.php?num_art_ligne=1710 Cefc Book review]\n*[https://web.archive.org/web/20070311014157/http://www.chineseupress.com/asp/e_Book_card.asp?BookID=1550&Lang=E Chineseupress.com Book review]"
    }
  ]
}