{
  "content": [
    {
      "type": "text",
      "text": "# Fred Award\n\n| reward      = NZ$5,000\n| website     = [https://www.comedyfestival.co.nz/about-us/development-initiatives/the-fred-award/ Fred Award]\n}}\nThe Fred Award is the highest honour at the New Zealand International Comedy Festival, awarded to the best show written and performed by a New Zealand comedian.\nThe award is named in honour of New Zealand comedian John Clarke's most well-known character, Fred Dagg. Dagg was one of New Zealand's most recognisable comedic characters during the 1970s and is considered to be an icon of New Zealand pop culture. The winner receives a trophy of Dagg's gumboot.\nHistory\nThe award was established in 2006 by the NZ Comedy Trust to recognise \"The outstanding work of an established professional kiwi comedian.\" In 2014 the criteria were simplified to become \"best show\" by a New Zealander.\n\"The Fred\" Gumboot is presented along with the Billy T Award at the end of festival prize-giving showcase \"Last Laughs\" where nominated finalists perform their final set of the festival. The winner is decided by a panel of judges and the prize is presented by the winner from the previous year.\nWinners\n{| class=\"wikitable\"\n|+Fred Award winners by year\n!Year\n!Winner\n!Other nominees\n|-\n|2006\n|Brendhan Lovegrove, The Brendhan Lovegrove Project\n|\n|-\n|2007\n|Dai Henwood, Dai-namic Scenario\n|Ewen GilmourTe Radar\n|-\n|2008\n|Ben Hurley, Boom\n|The OutwitsJustine Smith, Return of the Jussi\n|-\n|2009\n|Te Radar, Eating the Dog\n|Paul EgoSteve Wrigley\n|-\n|2010\n|Wilson Dixon, ''Wilson Dixon's American Dream\n|\n|-\n|2011\n|Jan Maree, Fever Bitch!\n|\n|-\n|2012\n|Rhys Darby, This Way to Spaceship\n|Brendhan Lovegrove, Bury Me HappyThe Boy With Tape On His Face, More Tape\n|-\n|2013\n|Jarred Christmas, Let's Go Mofo\n|James Nokise, So-So GangstaNick Rado, The Funniest Joke in the World\n|-\n|2014\n|Trygve Wakenshaw, Kraken\n|Jamie Bowen, Heart Goes BoomRhys Darby, Mr. Adventure\n|-\n|2015\n|Dai Henwood, Daigression\n|Jamie Bowen, Head Goes BangUrzila Carlson, Man Up\n|-\n|2016\n|Rhys Mathewson, Nouveau Rhys\n|Pax Assadi, In Mid-Season FormNic Sampson, Nic Sampson Has Fallen Down A Well\n|-\n|2017\n|Rose Matafeo, Sassy Best Friend\n|Fuq Boiz (Hamish Parkinson and Ryan Richards), Fuq BoizEli Matthewson, The Year of Magical FuckingGuy Montgomery, Let's All Get in a Room Together\n|-\n|2018\n|Chris Parker, Camp Binch\n|Frickin Dangerous Bro (Pax Assadi, James Roque, Jamaine Ross), HumbleRose Matafeo, HorndogNick Rado, Nail It!\n|-\n|2019\n|James Nokise, God Damn Fancy Man\n|Barnie Duncan, Tap HeadJames Roque, Boy Mestizo\n|-\n|2021\n|Eli Matthewson, Daddy-Short-Legs\n|David Correos, David Correos is David PostofficeTwo Hearts (Laura Daniel and Joseph Moore), We're Pregnant and The Baby is Music\n|-\n|2023\n|Guy Montgomery, My Brain is Blowing Me Crazy\n|Brendon Green, I'm Happy You're HereJamaine Ross, Vaguely Familiar\n|-\n|2024\n|Barnie Duncan and Trygve Wakenshaw, Different Party\n|Alice Snedden, Highly CredibleHayley Sproull, Wild Flutters\n|-\n|2025\n|Angella Dravid, I'm Happy for You\n|Melanie Bracewell, A Little TreatAbby Howells, Welcome to my Dream''\n|}\nReferences"
    }
  ]
}