{
  "content": [
    {
      "type": "text",
      "text": "# Frederick J. Warnecke\n\n| birth_place      = New York City, New York, U.S.\n| death_date       =\n| death_place      = Boca Raton, Florida, U.S.\n| buried           =\n| resting_place_coordinates =\n| religion         = Anglican\n| residence        =\n| parents          = Charles Warnecke & Florence Barr\n| spouse           = Edith Grace Rhoads\n| children         = 2\n| occupation       =\n| profession       =\n| previous_post    = Coadjutor Bishop of Bethlehem (1953-1954)\n| education        =\n| alma_mater       =\n| motto            =\n| signature        =\n| signature_alt    =\n| coat_of_arms     =\n| coat_of_arms_alt =\n| module           =\n| module2          =\n| other            =\n}}\nFrederick John Warnecke (July 26, 1906 – February 23, 1977) was bishop of the Episcopal Diocese of Bethlehem in Bethlehem, Pennsylvania from 1954 to 1971.\nEarly life and education\nWarnecke was born on July 26, 1906, in New York City, and was educated in public schools. Later he studied at Columbia University and graduated with a Bachelor of Arts in 1926. He then studied at the Virginia Theological Seminary and graduated with a Bachelor of Divinity in 1929. In 1939 he graduated from General Theological Seminary with a Master of Sacred Theology.\nCareer\nOrdained ministry\nHe was ordained deacon in May 1929 by Bishop Wilson Reiff Stearly of Newark, and a priest in July 1930 by Bishop Henry St. George Tucker. He was appointed as minister-in-charge of Christ Church in Luray, Virginia, while in 1932 he became rector of St Clement's Church in Hawthorne, New Jersey. Between 1941 and 1949 he served as rector of St Mark's Church in Richmond, Virginia. He then became Dean of Trinity Cathedral in Newark, New Jersey. Whilst in Newark, Dean Warnecke also served in the department of Christian education of the diocese. During his time as Dean of the cathedral, he over sought the restoration of the building.\nBishop\nOn November 7, 1952, Warnecke was elected Coadjutor Bishop of Bethlehem during a special convention, which took place in the Cathedral Church of the Nativity in Bethlehem, Pennsylvania. He was then consecrated as bishop on February 5, 1953, in Nativity Cathedral by Presiding Bishop Henry Knox Sherrill, assisted by Frank W. Sterrett the Bishop of Bethlehem and Benjamin M. Washburn the Bishop of Newark. He became diocesan bishop in 1954, a post he retained until December 31, 1971.\nDeath\nWarnecke died on February 23, 1977, in Boca Raton, Florida.\nReferences\nExternal links\n*[http://episcopalarchives.org/cgi-bin/ENS/ENSpress_release.pl?pr_number=77066 Obituary at Episcopal Archives]"
    }
  ]
}