{
  "content": [
    {
      "type": "text",
      "text": "# Frederick B. Warder\n\n|death_date=\n|birth_place= Grafton, West Virginia, US\n|death_place= Ocala, Florida, US\n|placeofburial=\n|image=\n|caption=\n|nickname= Fearless Freddie\n|allegiance= United States\n|branch=\n|serviceyears= June 1921 –July 1962\n|rank=  Rear admiral (RADM)\n|commands=\n|unit=\n|battles= World War II\n|awards=\n|laterwork=\n}}\nFrederick Burdett Warder (March 19, 1904 &ndash; February 1, 2000) was a highly decorated United States Navy submarine officer during World War II. He was a two time recipient of the Navy Cross for extraordinary heroism in combat, and a four time recipient of the Legion of Merit for meritorious service. He served from June 1921 to July 1962 and became a Rear admiral (RADM).\nDuring World War II, Warder commanded the  for over three years, on seven war patrols. In 1942, during the last two days of Seawolfs fourth patrol, having become frustrated with the failures of the Mark 14 torpedo, Warder led Seawolf to abnormally close range attacks on three Imperial Japanese Navy (IJN) cruisers, earning him the nickname \"Fearless Freddie\", in an effort to ensure successful hits with the faulty torpedoes. Warder was awarded his first Navy Cross for the entirety of Seawolfs fourth patrol (February 25 to April 1, 1942). Later, when he learned that all three cruisers were still being encountered, Warder began to meticulously document the problems with the Mark 14. In 1942, during Seawolfs seventh patrol, Warder decided to make a dangerous real-world test, keeping Seawolf stationary for an abnormally prolonged period during an attack on November 3, in order to send distinct torpedo barrages against a Japanese vessel, proving that the Mark 14 was missing the target while a second shot, with an older Mark 10 torpedo, hit the target. His bravery, and that of the entire crew of Seawolf (the first submarine to win two Navy Unit Commendations), proved important in fixing a critical problem that had plagued the United States submarine force. Warder would win his second Navy Cross for Seawolfs seventh war patrol (October 7 to December 1, 1942), during which 16,810 tons of Japanese vessels were sunk, part of the total tonnage Seawolf sunk to become the most successful Sargo-class submarine of World War II.\nLater, Warder was the commanding officer of the Naval Submarine School at Naval Submarine Base New London, Connecticut.\nEarly life and education\nHe graduated from the United States Naval Academy in 1925.\nReferences\nExternal links\n*[https://ancexplorer.army.mil/publicwmv/#/arlington-national/search/results/1/CgZXYXJkZXISCUZyZWRlcmljaw--/ Arlington National Cemetery]\n*[http://navylog.navymemorial.org/warder-frederick Frederick Warder Navy Log]"
    }
  ]
}