{
  "content": [
    {
      "type": "text",
      "text": "# Frederick Woodward Branson\n\nFrederick Woodward Branson, FIC, FCS (6 March 1851 – 30 November 1933) was a British chemist, glassblower, instrument maker and X-ray pioneer.\nHe worked with Jacob Bell & Co a chemist who reformed the profession, location Oxford Street London. He was a Fellow of the Chemical Society in 1882, and became a Fellow of the Institute of Chemistry in 1888, glassblower, instrument maker and X-ray pioneer. Chairman & managing director of Reynolds & Branson 1898 – 1933. He had many published works 1882–1918. He was given the honorary award of Freeman of the City of London 1908.\nLife and times of Frederick W. Branson and his family\nFrederick Woodward Branson was born on 6 March 1851 at Hanslope, Newport Pagnell, Buckinghamshire, England. He was the son of Thomas Branson a bricklayer, who later became a farmer. Branson's father inherited the farm via his marriage to Sarah Ann née Woodward, who had inherited it from her father. In 1861, Branson lived with his parents and maternal grandparents, William Woodward an agricultural labourer and farm owner, at Hungate End Farm, Hanslope. The farm consisted of  and employed six men and six boys. William inherited when he married Mary Woodward née Prentice, who was left half of her father, Thomas Prentice, Yeoman's, estate on 31 October 1837 located in Hanslope, Buckinghamshire, England. By 1861, the farm had increased in size to  and the farm was passed on to Branson's father, Thomas, around 1869 when William Woodward died. The farm increased in size again to  by 1871. At this time, Branson was employed as a chemist's apprentice, in the pharmacy of Messrs. Jay in the Drapery at All Saints, Northampton where he served his indentures. Branson would have inherited Hungate End farm via his parents, but his mother Sarah Ann, the natural farmer by birth died, on 9 March 1881. She was the driving force and the decision maker when it came to the farm's success, whereas his father's experience came from a building background rather than a farming one. A notice in The London Gazette, 26 March 1881, announced that Thomas Branson had been declared bankrupt, and that Hungate End Farm, Hanslope was to be liquidated by arrangement by Composition with Creditors in accordance with the 1869 bankruptcy act. It is noted that by 1891, Branson's father had returned to the building trade. He died in 1910 and Branson attended his fathers funeral.\nIn 1884, Branson married Rose Mary Ellen née Hartridge; she was a teacher in Woodbridge, Suffolk, daughter of James Samuel Hartridge who was a butcher And Poulterer (ca. 1824–1888) and Susanna Hills daughter of John Hills Raydon, Suffolk, England (ca. 1834–1907). They had two children: Frederick Hartridge Branson and Rose May.\nIn 1908 Frederick W Branson was awarded the accolade Freeman of the City of London. he gained membership of the Spectacle Makers' Company. He took a very active interest in Leeds Scientific Societies, being a member for over 50 years of the Leeds Philosophical and Literary Society which celebrated its centenary some years back. He was its President in 1928–1929 and 1929–1930.\" its President in 1907–1908 and gave an address on \"Radium and Geology\" and again in 1908–1909, his address being on radioactive elements and geology. He was also President during the Jubilee Session, 1923–1924, and again in 1924–1925. He took an active share in tracing the course of underground waters of North West Yorkshire in connection with the Yorkshire Geological and Polytechnic Society in 1899, the results of which were published in the Proceedings of this Society in 1900. Through his instrumentality radium was obtained from Madam Curie and exhibited in Leeds soon after its isolation. Branson was an avid sportsman who enjoyed fishing and hunting. He was known to follow grouse on the Yorkshire Moors. He often fished for salmon in the River Eden. He was an accomplished pianist and regularly supported the Leeds Philharmonic Society.\nBranson enjoyed the time he spent in his garden, in particular the care of his Alpine plants. He had a rock garden that he built from limestone collected from the moors near Pateley Bridge and skilfully laid out. Early in his career, Branson became acquainted with George Claridge Druce who was an English chemist – botanist and a Mayor of Oxfordand, their friendship and mutual fondness of botany continued throughout his life. He died aged 82 on 30 November 1933 at Wynneholme, Far Headingley, Leeds West Yorkshire, England.\nEducation and early career\nBranson passed the Minor examination of the Pharmaceutical Society in 1873 and the Major in 1878. From 1880 to 1881, he attended King's College, London and was awarded the Clothworkers' Science Prize in 1881. The Clothworkers' Science Prize was awarded to evening class students in the amount of £5. In 1878 until 1881, he worked with John Bell & Co. in the historic pharmacy at Oxford Street, and acted as laboratory assistant to Samuel Gale, a partner in the firm of John Bell. He became a Fellow of the Institute of Chemistry in 1888 and a Fellow of the Chemical Society in 1882.\nThe History of Reynolds and Branson Ltd Co 1816–1972\nThe original company can be traced back to 1816 (see Grace's Guide which is the leading source of historical information on industry and manufacturing in Britain, The Company was established in 1816) Edward Matterson druggist who was running the firm at 12, Briggate, Leeds in 1822, Matterson was educated at Leeds Grammar School, the company had moved to 13 Briggate, Leeds by 1829 (1822 Baines's Directory and Gazette Edward Matterson is a druggist, and dealer in paint and colours, Location 12, Briggate, Leeds ) (Edward Matterson in Pigot's Directory of 1829 he is still druggist but now located 13 Briggate & 4 Blundel place)(also Noted Baines's Directory 1822 John Cudworth Hop Merchants was located at 13, Briggate Leeds ) (Noted William West is a druggist, located at 14, Briggate in 1822. ) Edward Matterson had been employed by Allen and Hanburys, in 1833 William West F.R.S. took over the company after Matterson went bankrupt\n(see The bankrupt directory: being a complete register of all the bankrupts, with their residences, trades, and dates when they appeared in the London gazette, from December 1820 to April 1843 ). In 1839 Thomas Harvey joined the business, when William West left the company to pursue analytical chemistry. The firm was then called Thomas Harvey. Harvey was born at Barnsley into a Quaker family, his father was a linen manufacturer. The second of five children, he was educated at Barnsley Grammar, in Yorkshire in 1812. From 1822 to 1825 Harvey studied at Ackworth and afterwards became a chemist apprentice for David Doncaster of Sheffield. Upon Doncasters death he trained at Thomas Southalls in Birmingham for eight years. In 1837 Harvey settled in Leeds as a chemist becoming an Anti-slavery campaigner and philanthropist. In 1844 Richard Reynolds joined the company an apprentice, he was born in 1829 and was the eldest son of an apothecary who died when the boy was only four years old. 1850 to 1851 he attended the school of Pharmacy in London where he took first prizes in chemistry, materia and botany in a contest held by the pharmaceutical society. He then went to Mr. Henry Deane at Chapman for two years, then returned to the Leeds business. In 1854 Richard Reynolds joined Thomas Harvey as a partner, the company then became Harvey & Reynolds. In 1861, the firm was joined by a Mr. Fowler and became Harvey, Reynolds & Fowler. By 1864, Thomas Harvey had retired (in 1884 Thomas Harvey at the age of 72 undertook arduous journey to Canada on a Quaker mission, but it exhausted him. He died On 25 December, at his home at 'Ashwood', Headingley Lane, on Christmas Day.). Mr. Haw joined the business and the company became Haw & Reynolds. In 1867, the business was listed as Haw, Reynolds, & Co. In 1883, Fredrick W Branson joined the business. with Richard Reynolds at Leeds, England.  Richard Reynolds took on Fredrick W Branson as a partner in the established company. An 1884 advertisement listed the partnership between Reynolds & Branson (late Harvey, Reynolds & co.) The firm of Reynolds & Branson was registered in July 1898 as a limited corporation with a capital of £34,000 in shares of £10 each by Messrs. R. Reynolds, F. W. Branson and R. F. Reynolds being the first. No remuneration was given to Mr. R. Reynolds, but a £700 each per annum to the others. The business was located at 14 Commercial Street and 13 Briggate, Leeds. In 1890 Richard Reynolds son, Richard Freshfield (Fred) Reynolds was made a partner. The firm was in the business of wholesale and retail chemists and surgical instrument makers.  FRS. Fredrick W Branson now focused on the development of scientific apparatus and chemical glassware for the business. (His partner Richard Reynolds was a Fellow of the Chemical Society. He was elected member in 1864 and served as council member since 1870. In 1894, he was elected vice-president. In 1900, he died at home at Cliff Road, Hyde Park in Leeds.[3][4]) In 1901 During the outbreak of lead poisoning at Morley he was called in and his recommendations freed Morley from this scourge. In collaboration with A. F. Dimmock, M.D., he contributed to the British Medical Association meeting in 1903 a paper \"A new method for the determination of uric acid in urine\" (Br. Med. J., 1903, 2, 585). For this process he devised a correction scale which was contributed to the British Pharmaceutical Conference in 1904. At the 1905 meeting of the British Medical Association a further paper by these two authors was read, \"A rapid and simple process for the estimation of uric acid\" (ibid., 1905, 2, 1104), in which uric acid was precipitated and the precipitate measured in a specially graduated tube, In 1914, in collaboration with Dr. Gordon Sharp, he contributed a paper to the British Pharmaceutical Conference on the activity of digitalis leaves and the stability and standardisation of tinctures of digitalis. He was an expert glassblower. During World War I, he actively pursued efforts to standardise the size and shape of chemical glassware. In 1916, he was elected as an inaugural member of the Society of Glass Technology. He organised research and published works on these topics. Branson sought to secure in Great Britain the manufacturing process for the glass required for the equipment of munition factories.\nBranson contributed a paper on the composition of some types of chemical glassware to the Society of Chemical Industry (J. SOC. Chem. Ind., 1915, 34, 471) in collaboration with his son Frederick Hartridge, a paper to the Transactions of the Society of Glass Technology (1919, 3, 249)\" A proposed standard formula for a glass for lamp workers. Branson was chairman until retirement in 1932. His son, Frederick Hartridge, Associate of the Royal Institute of Chemistry AIC, became chairman and managing director of the company. until his untimely death on 10 February 1952, he had appointed his three sons and daughter as directors of The company. Frederick Norman the eldest son who attended Ilkley Grammar an all-boys school, Eileen his only daughter, Peter Orchard who as Director of Phospherade, which was the mineral water company, He attended Roundhay all-boys grammar school. World War II he was in the RAF with 54 Spitfire squadron, in 1942 married Rita Blackburn, he went to Australia with 54 Spitfire squadron at the end of 1942, he met Patricia A Grant his second wife, He married Patricia in Leeds 1948, Peter emigrated to Australia 1953, when his father died leaving the bulk of the business to his eldest brother Frederick Norman, He set up his own pharmacy in Blackburn South in 1955. He later become a Podiatrist retiring at the age of 90, Richard Orchard who attended Roundhay all-boys grammar school, World War II Richard was also in RAF as a pilot he died on active service 1945. His eldest son Frederick Norman Branson became chairman & managing director of Reynolds & Branson in 1953, at this point the company had a workforce of 150 people, In 1972 Frederick Norman sold the business to Barclay, later selling to the asset strippers Slater & Walker. Noted that it was a sad end to a company which had been based in Leeds, in some form or another for 156 years.\nReynolds and Branson chronology\n*1822, Edward Matterson druggist, dealer in paint and colours, Location 12, Briggate, Leeds Baines's Directory and Gazette.\n*1829, Edward Matterson, druggist, located 13 Briggate & 4 Blundel place. Pigot's Directory\n*1833, William West F.R.S. took over the company after Matterson went bankrupt,\nsee The bankrupt directory London gazette, from December 1820 to April 1843.\n*1839, Thomas Harvey, chemist and druggist, 5 Commercial Street. Leeds.\n*1841, Thomas Harvey, chemist and druggist, 13 Briggate. Leeds.\n*1854, Reynolds returned to Leeds as partner with Harvey in the chemist business and the firm became Harvey & Reynolds.\n*1856, Harvey & Reynolds, chemist and druggist, 13 Briggate. Leeds.\n*1861, Harvey, Reynolds & Fowler. Chemist and druggist, 10 Briggate. Leeds.\n*1864, Haw & Reynolds. Chemist and druggist. Briggate. Leeds. as Thomas Harvey had retired.\n*1867, Haw, Reynolds, & Co. Chemist and druggist. Briggate. Leeds.\n*1872, Haw, Reynolds & Co. Chemist. 14 Commercial Street, and 13 Briggate. Leeds.\n*1886, Reynolds & Branson. Makers of the first short clinical thermometer.\n*1891, Reynolds & Reynolds, chemist and druggist, 13 Briggate. Leeds\n*1901, Reynolds & Reynolds, chemist and druggist, 13 Briggate. Leeds\n*1911, Reynolds & Reynolds, chemist and druggist, 13 Briggate. Leeds\nReynolds and Branson trade catalogues\nReynolds and Branson trade catalogues listed:\n*Reynolds and Branson, 1887. Handy Guide to Surgical Instruments and Appliances etc. Reynolds and Branson, 14 Commercial Street, Leeds. Gloucester: John Bellows. 1887. 246p.\n*Reynolds and Branson, 1890. Illustrated Catalogue of Chemical and Physical Apparatus, Pure Chemicals and Reagents. Reynolds and Branson, 14 Commercial Street, Leeds. 1890. 200p.\n*Reynolds and Branson, 1903. Catalogue of Special Preparations. Reynolds and Branson, 14 Commercial Street, Leeds. 1903. 64p.\n*Reynolds and Branson, 1907. Illustrated Catalogue of Optical Lanterns, Slides, Compressed Gases and Accessory Apparatus. Reynolds and Branson, 14 Commercial Street, Leeds. Leeds: McCorquodale & Co. 1907. 204p.\n*Reynolds and Branson, 1908. Illustrated Catalogue of Surgical Instruments and Appliances. Reynolds and Branson, 14 Commercial Street, Leeds. Leeds: Chorley & Pickersgill. 1908. 119p.\n*Reynolds and Branson, 1912. Catalogue of Special Preparations, Surgical Instruments, Trusses etc. Reynolds and Branson, 14 Commercial Street, Leeds. 1912. 84p.\n*Reynolds and Branson, 1912–1920. Catalogue of Laboratory Fittings and Furniture. Reynolds and Branson. 1912–1920. 29p.\nReynolds & Branson patents\nPatents include: #1120 in 1885, #16373 in 1893, #14102 in 1899.\n*Improvements in photographic 'shutters' for instantaneous photography. #1650. 1883.\n*Means or apparatus for measuring quantities of highly volatile liquids. No. 3490. 1904.\nX-ray pioneer\nBranson was an early pioneer in the newly discovered X-rays and radiography. He developed an instrument for estimating the amount of exposure to X-rays necessary to obtain a fully exposed plate.\nNew X-ray Meter\n\"The peculiar glow exhibited by a \"focus\" tube working well furnishes a good criterion of efficiency as regards Rontgen rays. A more definitive means of comparing the actinic power of the radiation has been produced by Messrs. Reynolds and Branson, Leeds. A small quadrant of aluminium is constructed in concentric terraces, ranging from one millimetre to ten millimetre in thickness. By holding this quadrant between an excited Crookes' tube and a phosphorescent screen, the thickness of aluminium which the rays are capable of traversing can be seen upon the screen; or, by substituting a sensitive plate for the screen, the effect may be photographed. The \"X-ray meter,\" as the quadrant is called, thus furnishes an easy means of comparing the intensity of Rontgen ray emitted by different tubes and by the same tubes at different times.\"\nIn a memoir of Wilhelm Conrad Röntgen by Otto Glasser, 1933, Branson's invention of a qualimeter is noticed. Glasser referred to the work of Röntgen and the attempt to measure the photographic quality of the Röntgen rays: \"Röntgen had studied carefully the penetration of the roentgen rays through a series of substances and had used for such measurements small ladders of metal of a type which in later years was used generally. This idea was made practical by an English firm [Reynolds and Branson], who arranged aluminium in gradations or steps in the shape of a circle so that an aluminium ladder was formed with steps of from 1 to 10 mm. in thickness. With this arrangement the hardness of the rays could be determined on a fluorescent screen as that thickness which could just be penetrated by the rays.\"\nRadium\nAs Branson was a scientific instrument maker and had a keen interest in the scientific developments of the day, he closely followed new discoveries in science. Marie Curie had discovered radium. In June 1903, the Curie couple were invited to present a talk on radioactivity at the Royal Institution in London. Pierre Curie made the presentation, as women were prohibited from speaking engagements at the Royal Institution. In July 1904, Branson gave a presentation titled Radium and its Properties and made a demonstration with radium before members of the Leeds Geological Society and the Leeds Naturalist Club.\nRadium and its Properties.\n\"The Leeds Law Institute was, on the 23rd ult., crowded to the door on the occasion of a lecture by Mr. F. W. Branson, F.I.C., on that mysterious subject known as radium. The Leeds Geological Society and the Leeds Naturalist Club were also represented, and Mr. E. Hawkesworth was in the chair.\n\"The new metal, which Professor Pierre Curie discovered, has, as demonstrated by Mr. Branson, some wonderful properties and a probable great future.\n\"Mr. Branson first showed that radium is an element having the highest atomic weight known, and has a characteristic spectrum, by which it can be easily identified, and that it falls into the group of metals: barium, calcium, and strontium. He then showed the difference between atmospheric (sound) waves and ether waves (heat, light, and electrical), and alluded to the emanations given off by radium as consisting of electrons negatively charged, and also much larger particles of matter termed ions positively charged. The former have very penetrative powers as regards metals and opaque bodies, and are identical with the kathode rays that are given off in an ordinary X-ray tube.\n\"The positively charged particles are not so penetrative; indeed, they are easily stopped by such substances as cardboard. When a fragment of radium salt is held near to a zinc blende screen, the positively charged particles given off by radium salts bombard it and render the surface of the screen full of rapidly changing brilliant points. This phenomenon was shown by means of an instrument called the \"Spinthariscope.\"\n\"With regard to the heat rays, the emanations of there from a tube of radium bromide, which had previously photographed itself on a photographic plate in the dark room, was shown by Bunsen's Ice Calorimeter, which instrument not only proves that heat is given out continuously by the salt, but measures accurately the amount generated. The reducing effect on chemical substances was alluded to, also the destruction of living tissues, and bacteria by radium emanations, and the general aspects of radio-activity were also dealt with and illustrated by numerous experiments, limelight views, and in other ways.\n\"The address was necessarily technical in its character, but sufficient properties of the metal were indicated to create a degree of sustained interest, and many eminent scientists from all parts of the country were present. A very hearty vote of thanks, proposed by Mr. Gilbert Middleton (president of the Leeds Photographic Society), seconded by Mr. Dreweryhouse (Leeds Geological Society), terminated probably the most interesting demonstration ever given before the society.\"\nProfessional service\n*Leeds and District Chemists Association, chairman\n*Society of Chemical Industry, Leeds Section, president\n*Society of Glass Technology, inaugural member, 1916\n*Leeds Philosophical and Literary Society, president, 1928–1929, 1929–1930.\n*Leeds Photographic Society, president\n*Leeds Naturalists Club, president\n*Yorkshire Anglers, secretary\n*Eden Conservancy Board\n*Leeds Geological Association, president, 1907–1908; 1908–1909; 1923–1924; 1924–1925. During his tenure that began in 1907, he gave an address on \"Radium and Geology\". He served a subsequent term from 1908 to 1909, and his presidential talk discussed radioactive elements and geology. He actively participated in tracing the course of underground waters of North West Yorkshire in connection with the Yorkshire Geological and Polytechnic Society in 1899, the results were published in the Proceedings of the Society in 1900.\nAccolades and honours\n*Spectacle Makers' Company\n*Freeman of the City of London.\nPublications\n*Branson, F. W. (1882). Chloride of Gold, Purity of Commercial [1882]. 472. Yearbook of Pharmacy, 1864–1885. British Pharmaceutical Conference. London.\n*Dimmock, A. F., & Branson, F. W. (1903). A New Method for the Determination of Uric Acid in Urine. The British Medical Journal. 585-585.\n*Branson, F. W. and Ackroyd, W. (1905). The Underground Waters of North-west Yorkshire. Proceedings of the Yorkshire Geological Society. Volume 15. Yorkshire Geological Society.\n*Dimmock, A. F., & Branson, F. W. (1907). SOME NEW METHODS FOR THE DETERMINATION OF URIC ACID, INCLUDING A SIMPLE CLINICAL PROCESS. The Lancet. 169(4349): 14–16.\n*Branson, F. W. (1915). The composition of some types of chemical Glassware. Journal of the Society of Chemical Industry. 34(9): 471–472.\n*Branson, F. W. (January 1918). In Memoriam: William Simpson. In Proceedings of the Yorkshire Geological and Polytechnic Society (Vol. 19, No. 4, pp.&nbsp;324–326). Geological Society of London.\nReferences\nExternal links\n*[http://www.gracesguide.co.uk/Reynolds_and_Branson  Reynolds and Branson @Grace's Guide]\n*[http://collectionsonline.nmsi.ac.uk/detail.php?type=related&kv=109017&t=people  Science Museum Group] List of items manufactured by R&B\n*[https://www.orau.org/ptp/collection/electroscopes/boxelectroscope.htm  Oak Ridge museum], Electroscope manufactured by R&B\n*[http://www.woodandbrass.co.uk/makers.php?makers_id=101  Camera manufactured by R&B]\n*http://historiccamera.com/cgi-bin/librarium2/pm.cgi?action=app_display&app=datasheet&app_id=2517\n*http://www.thoresby.org.uk/content/people/harvey.php"
    }
  ]
}