{
  "content": [
    {
      "type": "text",
      "text": "# Fred Woods (historian)\n\nFred Emmett Woods IV (born 1956) is a Brigham Young University professor of Latter-day Saint Religious Education.\nBiography\nEarly life\nWoods was born and grew up in Southern California.  He is a convert to the Church of Jesus Christ of Latter-day Saints. He is married to JoAnna Merrill and they are the parents of five children and 15 grandchildren.\nEducation\nWoods earned a bachelor's degree from Brigham Young University, and received a Ph.D. in 1991 from the University of Utah.  His doctoral dissertation was entitled Water and Storm Polemics against Baalism in the Deuteronomic History.  His Ph.D. was in Mideastern Studies with an emphasis in Hebrew Bible.\nSince that time Woods has focused his studies primarily on 19th and 20th century Latter-day Saint history.\nTeaching/Research Career\nWoods began as an instructor in the LDS seminaries in Provo and Orem.  He later served as an Institute of Religion instructor and director in both Southern California and in Boulder, Colorado.  From 1993 to 1998 he was a professor of religion at Ricks College, and since 1998 he has been a professor in the College of Religious Education at Brigham Young University. Professor Woods received the following fellowships/awards over the past two decades: Richard L. Anderson Distinguished Research Award from Religious Education (2002); From 2005 until 2010 he held the Richard L. Evans Chair of Religious Understanding in BYU's College of Religion; Moral Education Professorship, Brigham Young University (2019-2021); and BYU University Creative Works Award (2024).\nRecent Publications\nPossibly the most widely used publication by Fred E. Woods is his BYU database [https://saintsbysea.lib.byu.edu/ Saints by Sea] a compilation of passenger lists and primary source excerpts of the Latter-day Saint passengers on ships from 1840 to 1890 voyaging to America coupled with over 1300 first-person immigrant accounts.\nProfessor Woods is a prolific author. Some of his most recent published books and articles include:\n* Fred E. Woods, Ports to Posts: The Gathering of Latter-day Saints in the Nineteenth Century. University of Nebraska Press (2025)\n* Fred E. Woods, Jay H. Buckley, and Hunter T. Hallows, eds., The Life and Adventures of Mr. Eli Wiggill , forthcoming Spring 2024, Greg Kofford Books.\n* Malcolm Adcock & Fred E. Woods, Bright Lights in the Desert: The Latter-day Saints of Las Vegas, (The University of Nevada Press, 2023).\n* Malcolm Adcock, Fred E. Woods, The Latter-day Saint Image in the British Mind – (Salt Lake City: Greg Kofford Books, 2022). See also  ).\n* Fred E. Woods, “Cassia County Community Unity: Reflections on the Flood Prevention Fight of 1984,” Latter-day Saint Historical Studies, vol 25, nos. 1-2, (Spring & Fall 2024), 225-246.\n* Fred E. Woods and Cheryl Jensen, “Picketing Against Porn in Mesquite: Community Values vs. a ‘Vice’ Enterprise,” Nevada Historical Society Quarterly, forthcoming December 2023.\n* Century Gathering of Latter-day Saints,” Pioneer vol. 69, no.2 [2023], 3-9.\n* Fred E. Woods, \"A Seed and a Swede: The Ivar Sandberg Story\", South Dakota History, vol. 53, no. 2 (Summer 2023): 127-155\n* Charles Vance, Mark Mendenhall, and Fred E. Woods, “Missionary Families: LDS Case Study,” chapter in Research Handbook of Global Families, ed. Yvonne McNulty et al. (2022)\n* Sean E. Brotherson and Fred E. Woods, “‘Each one was going to put the hand to the plow and sow the precious Gospel seed’: Early Latter-day Saint Missionary Work in North Dakota,” forthcoming in Great Plains Quarterly, vol. 42, no. 4 (Summer 2022), 275-303.\n* Fred E. Woods, “Introduction The Latter-day Saint Gathering,” invited chapter for LIVERPOOL TO GREAT SALT LAKE eds. George D. Watt by Ronald G. Watt and LaJean Carruth, (Lincoln, NE: University of Nebraska Press, 2022), xv-xxvi.\n* Fred E. Woods, “The Pluck and Luck of the Irish Saints,” LDS Living Magazine, March 2022 online issue.\n* Fred E. Woods, “St. Johns Saints and their Friendly Neighbors: Early Conflict to Community Cohesion,” Latter-day Saint Historical Studies, vol. 23, no. 1 (Spring 2022):183-204.\n* Fred E. Woods, “‘Our Mormon Neighbors Gave’: Mancos Colorado Saints Intertwined with Community,” Latter-day Saint Historical Studies, vol. 23, no. 1 (Spring 2022):205-223.\n* Fred E. Woods, “The Ascension of Abraham: A Mortal Model for the Climb to Exaltation,” Religious Educator, vol. 23, no. 2 (Spring 2022):47-63.\n* Fred E. Woods, Conversion story of Ivar Sandberg:  (published online August 10, 2022).\n* Fred E. Woods, \"African American Baptists and Latter-day Saints in Las Vegas,” Nevada Historical Society Quarterly, 64, no. 3 (Fall 2021), 259-267.\n* Fred E. Woods, “The Rise of the Sitka Saints,” Latter-day Saint Historical Studies, 22, no. 1 (Spring 2021), 37-56.\n* Fred E. Woods, “Beneath the Pages: McClintock’s Mormon Settlement in Arizona,” Latter-day Saint Historicical Studies, 22, no. 1 (Spring 2021), 115-155.\n* Fred E. Woods, “Orson Pratt’s Publishing of The Seer: A Mission to Washington, DC, for a Season,” BYU Religious Education, Washington DC Regional Studies 2021\n* Fred E, Woods and RIley M. Moffat, \"The Genesis and Rise of the Nuku'alofa Tonga Temple,\" Mormon Historical Studies, vol. 21, no. 1 (Spring 2021): 91-114\n* Riley M. Moffat and Fred E. Woods, chapter 16 of “The Church of Jesus Christ of Latter-day Saints in the Islands of the Pacific” The Palgrave Handbook of Global Mormonism, eds. R. Gordon Shepherd, A. Gary Shepherd, Ryan T. Cragun (London: Palgrave/MacMillan, 2020), 431-454.\n* Fred E. Woods, “Leavening the Sourdough: A History of Latter-day Saints in Kodiak,” Latter-day Saint Historical Studies, 21, no. 2 (Fall 2020): 55-78.\n* Fred E. Woods, “The Balance Between Church and State in Tonga: A study in mutual respect between the Latter-day Saints and the Royal Family,” Journal of Mormon History, vol. 46, no. 1 (Winter 2020): 53-84.\nWoods is also very engaged in publishing documentary films, several of which are currently being shown on BYU TV:\n* [https://www.byutv.org/2cbefc46-58bb-45a9-a25b-f01d29c8c597/a-swede-and-a-seed-the-ivar-sandberg-story?player-open=true&content-id=2cbefc46-58bb-45a9-a25b-f01d29c8c597 A Swede and a Seed: The Story of Ivar Sandberg]\n* [https://www.byutv.org/c0cde8f2-5110-42a0-8f19-c6e6c525a5e4/flood-of-memories-remembering-the-1976-teton-dam-disaster--recovery Flood of Memories: The 1976 Teton Flood Disaster and Recovery]\n* [https://www.byutv.org/3317200a-9038-4d8a-9a3d-2bb9d62e0e1a/latter-day-saint-image-in-the-british-mind The Latter-day Saint Image in the British Mind]\nReferences\nSources\n*[https://religion.byu.edu/directory/fred-woods BYU Religious Education - Professor Fred E. Woods]\nExternal links\n* [https://saintsbysea.lib.byu.edu/ Saints by Sea]"
    }
  ]
}