{
  "content": [
    {
      "type": "text",
      "text": "# Freddy King Sings\n\n| recorded   = August 1960 – July 1961\n| venue      =\n| studio     = King, Cincinnati, Ohio\n| genre      = Blues\n| length     =\n| label      = King (no. 762)\n| producer   =\n| prev_title =\n| prev_year  =\n| next_title = Let's Hide Away and Dance Away with Freddy King\n| next_year  = 1961\n}}\n}}\nFreddy King Sings is an album by blues singer and guitarist Freddie King. Released in 1961, it was King's first album and includes four singles that appeared in Billboard magazine's R&B and Pop charts.  In 2008, Freddy King Sings was inducted into the Blues Foundation Hall of Fame in the \"Classics of Blues Recordings\" category.\nBackground\nFreddy King Sings represents King's earliest vocal performances recorded by King Records from August 1960 to July 1961.  It features singles that were released before as well as after the album, plus two album-only tracks.  Four of the songs on the album appeared in the Billboard charts in 1961: \"You've Got to Love Her with a Feeling\" (Pop number 92), \"Lonesome Whistle Blues\" (R&B number eight, Pop number 88), \"I'm Tore Down\" (R&B number five), and \"See See Baby\" (R&B number 21).\nStyle and influence\nKing's guitar playing has been described as \"a unique synthesis\" of Texas and Chicago blues styles.  According to author John Hartley Fox, \"King was a Texas bluesman as well as a member of the same \"West Side\" school of gritty Chicago blues that produced incendiary guitarists Buddy Guy, Otis Rush, Magic Sam, and Luther Allison\".  Freddy King Sings was released after the success of his instrument singles \"Hide Away\" and \"San-Ho-Zay\", \"when King's guitar playing came to overshadow his singing, a change he never really welcomed\", Fox added.  In 2008, the album was inducted into the Blues Foundation Hall of Fame. Writing for the Foundation, blues researcher Jim O'Neal noted that the songs on Freddy King Sings show him \"to be one of the most expressive blues vocalists\".\nKing was a \"fundamental influence on the young guitar players\", according to music writer Keith Shadwick. When Eric Clapton heard \"I Love the Woman\" as the B-side to \"Hide Away\" in 1963, the first time he had heard King, he found it revelatory. He has recorded three of the songs on Freddy King Sings (\"I'm Tore Down\", \"You've Got to Love Her with a Feeling\", and several performances of \"Have You Ever Loved a Woman\").  \"See See Baby\", \"Lonesome Whistle Blues\", and \"I Love the Woman\" have also been recorded by a variety of artists. Chicken Shack recorded both \"See See Baby\" and \"Lonesome Whistle Blues\" on their debut album 40 Blue Fingers, Freshly Packed and Ready to Serve, in 1968.\nTrack listing\nPersonnel\n* Freddie King – lead guitar, vocals\n* Fred Jordan – rhythm guitar\n* Sonny Thompson – piano\n* Bill Willis – bass guitar\n* Phillip Paul – drums\n* Gene Redd – saxophone\n* Clifford Scott – saxophone\nNotes"
    }
  ]
}