{
  "content": [
    {
      "type": "text",
      "text": "# Freda Warrington__disambig_1\n\nFreda Warrington is a British author, known for her epic fantasy, vampire and supernatural novels.\nCareer\nBorn in Leicester, Warrington grew up in Leicestershire. Early influences included Hammer horror films and classic vampire novels like Bram Stoker's Dracula and J.S. Le Fanu's Camilla. She was also inspired by local history and the art of the Pre-Raphaelites.\nAfter completing high school, Warrington trained at the Loughborough College of Art and Design, and afterward held a job at the Medical Illustration Department of Leicester Royal Infirmary. She eventually moved to full-time writing, pursuing a love she had had since childhood. In addition to her writing, Warrington works part-time in the Charnwood Forest.\nFour of her novels (Dark Cathedral, Pagan Moon, Dracula the Undead, and The Amber Citadel) have been nominated for the British Fantasy Society's Best Novel award.\nDracula the Undead won the Dracula Society's 1997 Children of the Night Award. Her novel, Elfland, won the Romantic Times Reviewers' Choice Award in the Fantasy Novel category for 2009. Warrington has also seen numerous short stories published in anthologies and magazines.\nSome of her books are set in Leicestershire, such as the Aetherial Tales series, depicting the lives, loves and adventures of magical people living hidden in this region, passing for - and sharing many cultural traits with - ordinary English people.\nNovels\n* The Rainbow Gate (1989)\n* ''Sorrow's Light (1993)\n* Dracula the Undead (1997) (published in French as Le retour de Dracula, in German as Dracula, Der Untote kehrt zurück, and in Korean as 드라큘라의 부활)\n* The Court of the Midnight King (2003)\n* Blackbird series\n** A Blackbird in Silver (1986)\n** A Blackbird in Darkness (1986)\n** A Blackbird in Amber (1987)\n** A Blackbird in Twilight (1988)\n** Darker than the Storm (1990)\n* Blood Wine series\n** A Taste of Blood Wine (1992)\n** A Dance in Blood Velvet (1994)\n** The Dark Blood of Poppies (1995)\n** The Dark Arts of Blood (2015)\n* Dark Cathedral series\n** Dark Cathedral (1996)\n** Pagan Moon (1997)\n* The Jewelfire Trilogy\n** The Amber Citadel (1999)\n** The Sapphire Throne (2000)\n** The Obsidian Tower (2001)\n* Aetherial Tales series\n** Elfland (2009)\n** Midsummer Night (2010)\n** Grail of the Summer Stars'' (2013)\nReferences\nExternal links\n* [http://www.fredawarrington.com/ Freda Warrington Official Site]\n*\n* [https://archive.today/20130703030359/http://upcoming4.me/news/book-news/story-behind-grail-of-the-summer-stars-by-freda-warrington Story behind Aetherial Tales and Grail of the Summer Stars - Online Essay]\n* [https://web.archive.org/web/20130814150515/http://upcoming4.me/news/book-news/story-behind-a-taste-of-blood-wine-by-freda-warrington Story behind A Taste of Blood Wine - Online Essay]\n* [https://web.archive.org/web/20130701050924/http://upcoming4.me/news/book-news/review-freda-warrington-grail-of-the-summer-stars Grail of the Summer Stars review]\n*"
    }
  ]
}