{
  "content": [
    {
      "type": "text",
      "text": "# Freeride (mountain biking)\n\nFreeride|Free ride (disambiguation)Free ride}}\n}}\nFreeride is a discipline of mountain biking closely related to downhill biking, dirt jumping, freestyle motocross, and freestyle BMX. When riding, a freerider one focuses on tricks, style, and technical trail features.\nHistory\nThe original freeride bikes were modified downhill bikes that used gearing that enabled the rider to go up hills as well as down them. Modern freeride bikes are similar to downhill bikes, with the same amount of suspension in the form of a dual crown fork, with 40 millimeter stanchions. A major downside to these forks is that the clamps limit the rotation of the handlebars. This has led some competitors to use single crown forks in order to perform tricks such as tailwhips and barspins. Certain enduro bikes are compatible with aforementioned forks, and can be repurposed to be freeride bikes. Freeride bikes are lighter than downhill bikes – which enables them to be ridden not just downhill but through more technical sections, such as North Shore obstacles, and allows the rider to pedal back up for another lap, instead of requiring a shuttle or chairlift. Most freeride bikes feature slightly steeper headangles and shorter wheelbases than pure downhill bikes.\nNotable riders\nA few specialist riders have embraced the sport, including:\n*Graham Aggasiz\n*Gee Atherton\n*Darren Berrecloth\n*Robbie Bourdon\n*Dawid Godziek\n*Andreu Lacondeguy\n*Jeff Lenosky\n*Kelly McGarry\n*Anthony Messere\n*Ryan Nyquist\n*Sam Pilgrim\n*Hans Rey\n*Sam Reynolds\n*Brett Rheeder\n*Ethen Roberts\n*Nicholi Rogatkin\n*Brandon Semenuk\n*Andrew Shandro\n*Wade Simmons\n*Martin Söderström\n*Kurt Sorge\n*Fabio Wibmer\n*Cameron Zink\nDifferences between downhilling and freeriding\n'', hosted at the Natural Games in Millau, France.]]\nDue to similarities with the bicycles used and often the riding locations, the divisions between downhill riding and freeriding are often overlooked. For example, freeride bikes have steeper head tube angles and shorter wheelbases for low-speed stability on technical stunts, while downhill bikes have slacker headtube angles and longer wheelbases for absolute high-speed stability at the cost of low-speed maneuverability. Downhill riding is primarily concerned with descending a slope on a given course as quickly as possible. There are often many obstacles in downhill riding, including jumps, drops, and rocky sections.\nFreeride is, by definition, a much broader realm of riding. For example, a freerider may often ride a very narrow wooden plank raised as many as twenty-five feet above the ground, drop off of cliffs, raised platforms, or other man-made or natural objects onto a landing, or \"transition\" up to forty feet below. This may involve jumping over a structure below, such as a road or highway.  Many aspects of freeriding are similar to downhill riding, with wide open speed and technical and very steep sections, or dirt jumping, with a series of man-made jumps and landings. Another key difference is the emphasis on performing tricks or stylish riding stances while airborne.  A freeride course can be compared to a skatepark, where the purpose of the trail is to provide ample opportunities for the rider to become airborne, throw tricks, and create new and imaginative lines on and over the terrain.\nNotable competitions\n*Red Bull Rampage\n*Crankworx\n*Red Bull Joyride\nReferences"
    }
  ]
}