{
  "content": [
    {
      "type": "text",
      "text": "# Freedom of religion in the United Kingdom\n\nThe right to freedom of religion in the United Kingdom is provided for in all three constituent legal systems, by devolved, national, European, and international law and treaty. Four constituent nations compose the United Kingdom, resulting in an inconsistent religious character, and there is no state church for the whole kingdom.\nIn 2023, the country was scored 4 out of 4 for religious freedom.\nLaws guaranteeing freedom of religion\nEuropean Convention on Human Rights\nThe ECHR guarantees in Article 9 that subjects will have:\nHuman Rights Act\nThe right is given in the United Kingdom by s. 1 ss. (1)(a) of the Human Rights Act 1998 (HRA), as the \"right and fundamental freedom\".\nUnited Nations General Assembly\nIn Article 18 of the International Covenant on Civil and Political Rights, which was adopted by the United Nations General Assembly in resolution 2200A (XXI) on 16 December 1966, the UN resolved that:\nThe United Nations Human Rights Committee, a subsidiary body of the General Assembly, also affirmed in General Comment 22 on July 30, 1993, that the right to freedom of religion applies to unconventional or extra-institutional religions, as well as atheist or anti-clerical beliefs:\nMonarchy\nThe Act of Settlement 1701 decrees that the monarch of Great Britain (later the United Kingdom) \"shall join in communion with the Church of England\". This act was specifically designed to prevent a Catholic monarch from ascending to the throne, but in effect discriminates against all religions other than Protestantism. Members of the royal family in line of succession who married a Roman Catholic (though not adherents of other denominations or faiths) were excluded from the succession. Under the provisions of the Succession to the Crown Act 2013, marrying a Roman Catholic no longer disqualifies a person from succeeding to the Crown; however, the provision of the Act of Settlement requiring the monarch to be a Protestant continues unrepealed.\nChurches with special status\nChurch of England\nIn England, the state church is the Church of England, and the Supreme Governor of the church is the British monarch.  As already mentioned, the monarch is required to \"join in communion with the Church of England\".  As part of the coronation ceremony, the monarch swears an oath to \"maintain and preserve inviolably the settlement of the Church of England, and the doctrine, worship, discipline, and government thereof, as by law established in England\" before being crowned by the senior cleric of the Church, the Archbishop of Canterbury.  All clergy of the Church swear an oath of allegiance to the monarch before taking office.\nParliament has the authority to govern the Church of England, but since 1919, it has generally delegated this authority to the Church's General Synod (formerly known as the Church Assembly). Parliament retains the ability to veto measures of the General Synod or Church Assembly; this rarely invoked power was used in 1927 and 1928 to prevent the adoption of a revised prayer book. Measures also require royal assent.\nThe appointment of bishops and archbishops of the Church falls under the royal prerogative. In current practice, the Prime Minister makes the choice from two candidates submitted by a commission of prominent Church members, then passes his choice on to the monarch.  The Prime Minister plays this role even though they themself are not required to be a member of the Church of England or even a Christian—for example Clement Attlee was an agnostic who described himself as \"incapable of religious feeling\".\nAlthough it is an established church, the Church of England receives no state funding.  Instead, the Church relies on donations, land and investments.\nChurch of Scotland\nSince the Church of Scotland Act 1921, the Church of Scotland has been independent from the state.  The monarch does, however, take an oath to preserve the Church of Scotland at the meeting of the Privy Council immediately following his or her accession.  The monarch also has the right to attend the General Assembly of the Church of Scotland, but usually sends a High Commissioner in his or her place.\nChurch in Wales\nSince 1920, the Church in Wales has been independent of the state.  The church is, however, legally required to perform opposite-sex marriages where at least one of those being married has resided in one of its parishes for six months (a similar requirement applies to the Church of England).\nAdoption agencies\nThe Equality Act 2006 is equally applied to both religious-based and secular adoption agencies. The Catholic adoption agencies unsuccessfully attempted to negotiate a compromise that would have included an exemption for religious-based agencies. This exemption would have allowed them to continue facilitating adoption exclusively for opposite-sex parents.\nEducation\nSeveral university student associations have implemented rules that mandate affiliated groups to allow \"anybody, regardless of faith, ethnicity, or sexuality, to sit on their ruling committees and to address their meetings.\" However, some Christian Unions argue that they should be permitted to require that their ruling committees share their beliefs.\nService provision\nIn May 2008, Lillian Ladele, a registrar from Islington, London, took her employer, Islington London Borough Council, to the London Central Employment Tribunal, with the financial backing of the Christian Institute. Ladele had refused to conduct civil partnerships on religious grounds, and following complaints from other staff she was disciplined under the Council's Fairness for All policy. Ladele claimed she had been subject to direct and indirect discrimination, and harassment in the workplace, on grounds of her religion.   In July 2008, the tribunal found in Ladele's favour, however this ruling was overturned by the Employment Appeal Tribunal in December, 2008.\nIn 2011 a judge ruling on a bed and breakfast refusing to accommodate unmarried couples found in favour of a gay couple under the Equality Act 2010 but allowed an appeal, commenting that the ruling: 'does affect the human rights of the defendants to manifest their religion'.[http://www.christian.org.uk/news/judge-rules-against-christians-in-bb-case-but-allows-appeal]\nHistory\nDue to the United Kingdom having been formed by the union of previously independent states from 1707, most of the largest religious groups do not have UK-wide organisational structures.\nThe Oath of Supremacy, originally imposed by King Henry VIII of England through the Act of Supremacy 1534, required any person taking public or church office in England to swear allegiance to the monarch as Supreme Governor of the Church of England. Roman Catholics who refused to take the Oath of Supremacy were indicted for treason on charges of praemunire.\nThe Toleration Act 1688 granted freedom of worship to nonconformists who had pledged to the oaths of Allegiance and Supremacy and rejected transubstantiation, i.e., to Protestants who dissented from the Church of England such as Baptists, Congregationalists or English Presbyterians. The Act intentionally did not apply to Roman Catholics, Jews, nontrinitarians, and atheists.\nBlasphemy law\nThe common law offence of blasphemy was repealed in 2008. The last person to be imprisoned for blasphemy in the UK was John William Gott in 1922, for comparing Jesus Christ to a clown. The next blasphemy case was in 1977, when Mary Whitehouse brought a private prosecution (Whitehouse v. Lemon) against the editor of Gay News for blasphemous libel after he published a poem by James Kirkup called \"The Love That Dares to Speak Its Name\". Denis Lemon was given a nine-month suspended sentence and a £500 fine for publishing the \"most scurrilous profanity\" which portrayed the sexual love of a Roman centurion for the body of Christ on the cross. The sentence was upheld on appeal.\nIn this appeal case, Lord Scarman held that the modern law of blasphemy was correctly formulated in Article 214 of ''Stephen's Digest of the Criminal Law, 9th edition (1950). This states as follows:\nIn 1996 the European Court of Human Rights (case #19/1995/525/611) upheld a ban on Visions of Ecstasy, an erotic video about a 16th-century nun, based on the video infringing on the blasphemy law. The Court estimated that a limited ban on vulgar or obscene publications that would be offensive to believers, while keeping legal the criticism of religion, was compatible with the principles of a democratic society.\nOn May 8, 2008, the offence of blasphemy was abolished.  However, some acts that were once viewed as blasphemous may now be prosecutable under other legislation, such as the Public Order Act 1986 as amended by the Racial and Religious Hatred Act 2006.\nSee also\n*Religion in the United Kingdom\n*Religion in England\n*Religion in Northern Ireland\n*Religion in Scotland\n*Religion in Wales\nFootnotes"
    }
  ]
}