{
  "content": [
    {
      "type": "text",
      "text": "# Free Software, Free Society\n\nFree Software, Free Society: Selected Essays of Richard M. Stallman is a collection of writings (mostly essays, with occasional articles, interviews and speech transcripts) by Richard Stallman. It introduces the subject of history and development of the GNU Project and the Free Software Foundation, explains the author's philosophical position on the Free Software movement, deals with the topics of software ethics, copyright and patent laws, as well as business practices in application to computer software. The author proposes Free software licenses (mostly GPL) as a solution to social issues created by proprietary software and described in essays.\nThe introduction is written by Lawrence Lessig, professor at Harvard Law School.\nThe book is available online allowing verbatim (without making changes) copying and distribution of the whole collection, while each essay is licensed under Creative Commons CC BY-ND 4.0 International License.\nContent\nThree editions were published by GNU Press (in 2002, 2010 and 2015), each subsequent containing updated versions of the original essays and new works about emerging contemporary issues.\nThe 3rd edition is divided into seven main parts:\n#The GNU Project and Free Software – defines four essential software freedoms, shows ethical and social advantages of using and creating free software and explains Stallman's personal background on starting the GNU Project. It contains the original announcement of the project which became part of GNU Manifesto.\n#''What's in a Name?'' – is dedicated to explaining Stallman's position on many naming conventions he considers wrong (intellectual property), harmful (free versus open-source), or in need of clarification (GNU/Linux naming controversy).\n#Copyright and Injustice – explains why current interpretation of copyright law does not meet the original purpose and goes as far as to state that it is even detrimental to that. Notably, it contains a short story entitled The Right to Read.\n#Software Patents: Danger to Programmers – does similar demonstration for patent law.\n#Free Software Licensing – is dedicated to justifying a need for free software licenses, describing differences between them and explaining copyleft. It contains a full text of the GNU General Public License, the GNU Lesser General Public License and the GNU Free Documentation License.\n#Traps and Challenges – outlines existing dangers to software freedom, like DRM or software as a service.\n#Value Community and Your Freedom – is a set of essays on many topics, mainly Stallman's reflections on the community, society and democracy.\nIn addition, the book contains three appendices:\n* A Note on Software\n* Translations of “Free Software” and “Gratis Software”\n* The Free Software Song\n*\nSee also\n*Free as in Freedom, a Stallman bio by Sam Williams\nReferences\nExternal links\n* [https://www.gnu.org/philosophy/fsfs/rms-essays.pdf 1st edition pdf download] from gnu.org\n* [https://www.gnu.org/doc/fsfs-ii-2.pdf 2nd edition pdf download] from gnu.org\n* [https://www.albertopettarin.it/fsfs2.html 2nd edition in e-reader-compatible formats] (epub, mobi, xhtml)\n* [https://github.com/jollheef/free-as-in-freedom-v2-ru/releases 2nd edition Russian version] on GitHub with TeX-sources (pdf, epub, fb2)\n* [https://www.gnu.org/doc/fsfs3-hardcover.pdf 3rd edition pdf download] from gnu.org\n* [https://github.com/pettarin/fsfs3/releases 3rd edition in e-reader-compatible formats] (epub, mobi)\n* [https://shop.fsf.org/books-docs/free-software-free-society-selected-essays-richard-m-stallman-3rd-edition 3rd edition] on FSF webshop\n* [http://www.gnu.org/doc/fsfs3-hardcover.tar.gz 3rd edition TeX source code] from gnu.org\n* [https://fsfs-zh.readthedocs.io/ 3rd edition Chinese version Online] and [https://github.com/beijinglug/fsfs-zh/tree/master its source code] by Beijing GNU/Linux User Group"
    }
  ]
}