{
  "content": [
    {
      "type": "text",
      "text": "# Freight forwarder\n\nA freight forwarder or forwarding agent is a person or a company who co-ordinates and organizes the movement of shipments on behalf of a shipper (party that arranges an item for shipment) by liaising with carriers (party that transports goods). The carriers may use a variety of shipping modes, including ships, airplanes, trucks, and railroads, and often use multiple modes for a single shipment. A freight forwarder does not move the goods but acts as an agent in the logistics network and will carry out freight consolidation, rate negotiations, shipment tracking, customs and other documentation, among other tasks. FIATA describes a freight forwarder as the \"architect of transport\".\nInternational freight forwarders typically handle cross-border logistics and have additional expertise in preparing and processing customs documentation and performing activities pertaining to the regulations of different countries. Freight forwarders typically have information with respect to commercial invoice, shipper's export declaration, bill of lading and other documents required by the carrier or country of export, import, and/or transshipment.\nModern freight forwarders offer an end-to-end process i.e. shipping the goods from the place of origin to the final destination and may offer additional services such as warehouse planning, cargo insurance and customs brokerage. Together with tracking, freight forwarding agents often have real time information on the freight. Some forwarders may specialize in niche areas such as rail-freight, and collection and deliveries around a port.\nHistory\nThe first international freight forwarders were innkeepers in London, England who held and re-forwarded the personal effects of their hotel guests in the early 1800s. One of the earliest freight forwarders was Thomas Meadows and Co. Ltd., established in 1836. With the increase in trade between Europe and United States, Meadows served as an intermediary to arrange for the transportation of freight from the manufacturers to customers through rail transport and steamships. The services were later expanded to cover consultative solutions and handling customs requirements.\nDefinition\nA freight forwarder is an entity who co-ordinates and organizes the movement of shipments on behalf of a shipper (party that arranges an item for shipment) by liaising with carriers. A carrier is an entity that transports goods for a fee, and may use a variety of shipping modes, including ships, airplanes, trucks, and railroads, including multiple modes for a single shipment. For example, the freight forwarder may arrange to have cargo moved from a plant to an airport by truck, flown to the destination city and then moved from the airport to a customer's building by another truck.\nA freight forwarder does not move the goods but acts as an agent in the logistics network and will carry out freight consolidation, rate negotiations, shipment tracking, customs and other documentation, among other tasks. International Federation of Freight Forwarders Associations (FIATA) describes a freight forwarder as the \"architect of transport\".\nFunctions and responsibilities\nThe original function of the forwarder was to arrange for carriage by contracting with various carriers. Forwarder responsibilities included advice on documentation and customs requirements in the country of destination. His correspondent agent overseas looked after his customers' goods and kept him informed about matters that would affect the movement of goods. Modern freight forwarders offer an end-to-end process i.e. shipping the goods from the place of origin to the final destination and may offer additional services such as warehouse planning, cargo insurance and customs brokerage. In a single transaction, the forwarder may be acting as a carrier (principal) or as an agent for his customer or both. Together with tracking, freight forwarding agents often have real time information on the freight. Some forwarders may specialize in niche areas such as rail-freight, and collection and deliveries around a port.\nInternational freight forwarders typically handle cross-border logistics and have additional expertise in preparing and processing customs documentation and performing activities pertaining to the regulations of different countries. Freight forwarders typically have information with respect to commercial invoice, shipper's export declaration, bill of lading and other documents required by the carrier or country of export, import, and/or transshipment. Freight forwarders often charge a fee for the activity and might include transportation costs from factory and to delivery, freight charges, customs and other fees and documentation charges.\nOrganizations\nModern freight forwarding organizations serve as pivotal entities in the facilitation of global trade, orchestrating the movement of goods across international borders. These organizations cater to diverse customers including business-to-business (B2B), business-to-consumer (B2C), and consumer-to-consumer (C2C) requirements. These organizations have evolved significantly, transforming from managing a network  of contracted agents to corporations with a direct presence across countries. These organizations often have presence in multiple countries with larger entities having revenues running into billions of dollars. However, studies have noted a significant presence of small companies as well. The freight forwarding organizations have also undertaken diversification of revenue streams and has undergone digital transformation. Digital technologies such as barcodes, electronic data interchange, and enterprise resource planning have enhanced operational efficiency.\nAs per a 2023 report, the global freight forwarding market was valued at $201.6 billion in 2021 and is expected to grow at a CAGR of 3.9% from 2022 to 2030, reaching $284 billion by 2030. United Parcel Service, DHL Group, FedEx, Maersk, and Deutsche Bahn are the largest freight companies by revenue. Cumulatively, the top ten companies generated a revenue of $538.8 billion in 2023.\nNational variations\n* In Australia, most licensed Customs Clearance Agents operate under a freight forwarder. The entities are registered with the government with the licenses renewable every three years.\n* Transport Canada is the federal department responsible for implementing and enforcing transportation policies and programs with the Canada Border Services Agency responsible for enforcing most regulations that affect international freight forwarders. The Canadian International Freight Forwarders Association (CIFFA) was established in 1948 to support and protect the character, status, and interest of foreign freight forwarders by establishing uniform trade practice and regulations.\n* Federation of Freight Forwarders’ Associations in India is the apex body and the umbrella body of 28 associations across India representing 6,500 custom house agents, employing over 110,000 people.\n* With more than 82% of manufactured products being exported, freight forwarders are important contributors to the Irish economy. Associations including the Irish International Freight Association represent the industry through educational and representative roles.\n* In Kenya and Tanzania, freight forwarders are commonly referred to as clearing and forwarding agents. A license is required, which can be acquired from the respective revenue authorities. Freight forwarders are responsible for clearing consignments through customs, arranging transportation and forwarding the consignment to the consignee.\n* Freight-forwarding in Nigeria has been in place since the exporting of groundnut as a cash crop beginning in 1914, though not initially as freight forwarding but as the means of transportation of goods and services from one country to another. Following the method of their British, agents were used to facilitating the transport of goods and services.\n* Pakistan International Freight Forwarders Association PIFFA has more than 500 freight forwarding companies as members and is the local representative of FIATA and member association for Pakistan.\n* In the United Kingdom, freight forwarders are not licensed, but many are members of the British International Freight Association (BIFA), a trade association for UK-registered companies engaged in the international movement of freight by all modes of transport, air, road, rail, and sea. BIFA has over 1600  members, known generally as freight forwarders, who offer a wide range of services within these various modes.\n*In the United States:\n**Companies handling domestic freight by road must be registered with the U.S. Department of Transportation's Federal Motor Carrier Safety Administration. Such forwarders are \"carriers\" who accept freight for transport and are liable for delivering the freight under their own bill of lading.\n**International ocean freight forwarders arranging for shipments to and from the US must be licensed by the Federal Maritime Commission as ocean transportation intermediaries, who are ocean freight forwarders or non-vessel-operating common carriers (NVOCC). Ocean freight forwarders prepare and process documentation and perform related activities pertaining to shipments. NVOCCs dispatch shipments from the United States via common carriers and books or otherwise arranges space for those shipments on behalf of shippers; the FMC defines an NVOCC as:\nSee also\n* Transshipment\n* Logistics\n* Physical inventory\n* Standard trading conditions\n* Supply chain\nReferences"
    }
  ]
}