{
  "content": [
    {
      "type": "text",
      "text": "# French Republicans under the Restoration__disambig_1\n\nDuring the Restoration, the French Republicans campaigned for the monarchy's abolition. They were excluded from decision-making due to an electoral system that favored the bourgeoisie and nobility, supporters of the regime. Nevertheless, they were present in the Chamber of Deputies from 1816, following the dissolution of the Chambre introuvable (Unobtainable Chamber), which had decimated their ranks. Gradually, the Republicans established themselves as a political force; however, this was disrupted by the assassination of the king's nephew, the Duke of Berry, heir to the throne, on 14 February 1820, which prompted the government to implement repressive measures.\nThe Republican movement originated in secrecy, gathering its supporters in clandestine societies such as the Carbonari and disseminating its ideology through the press. In 1820, confronted with the Restoration's rightward trajectory, Republicans resolved to overthrow the monarchy and planned several insurrections, all of which failed, leading to the exile of key leaders or exemplary trials resulting in capital punishment.\nFollowing these unsuccessful attempts to seize power, the Republicans rebuilt from within with the arrival of a new generation at the start of Charles X's reign. The idea of an alliance with moderate royalists emerged in response to the reactionary measures taken by Villèle and Charles X. Moderates joined clandestine societies, while Republicans collaborated with the liberal press. The success of this alliance in the 1827 legislative elections reinforced their belief that it would one day enable them to gain power.\nThe situation intensified following the appointment of the Count of Polignac as head of the government. Republicans clandestinely organized a new insurrection and played a pivotal role in the Three Glorious Days; however, Adolphe Thiers and the liberals redirected the revolution to their advantage, resulting in the establishment of a second parliamentary monarchy rather than a republic.\nRestructuring and repression\nWhite terror: Republicans in the shadows\nwas considered the leader of the French Republicans until he died in 1834.]]\nIn 1815, Louis XVIII returned to France following Napoleon's defeat at Waterloo. He could not contain the Ultra-royalists’ fervor, incited by the Hundred Days, Napoleon's brief return to power that had forced Louis XVIII into exile. The ultras implemented the White Terror, which resulted in the massacre of Empire generals, Protestants, and Republicans by the verdets. This unofficial repression was further reinforced by legal terror. Since the August 1815 elections, the ultras' desire for revenge was legitimized by the ultra-royalist majority in the Chamber of Deputies, also known as the Chambre Introuvable. This body enacted legislation by this ideology, including the 1816 law on the exile of regicides, which condemned those who had voted for Louis XVI's death during the Convention to banishment.\nAt the time, the term \"Republic\" was still a word that evoked fear in many French people. They associated it with the Jacobin Terror of 1793–1794 and its excesses, epitomized by the Committee of Public Safety, particularly Robespierre. They overlooked the revolutionary gains the Republic had conveyed and defended against a monarchical Europe. Instead, they remembered only the guillotine and disorder. While the Republic scared some, it also symbolized progress for others. In 1815, a significant Jacobin opinion remained among the French populace, to the extent that new royal administration officials avoided showing themselves for fear of reprisals. Louis XVIII hastily removed symbols inherited from the Revolution (painters and masons were officially tasked with erasing the motto \"Liberty, Equality, Fraternity\" from all villages) and purged the administration by eliminating \"men of ill spirit.\" The aforementioned individuals were subsequently integrated into the ranks of liberals who were opposed to conservatives and ultras.\nIn 1816, Louis XVIII dissolved the Chambre introuvable, and new elections were held in a climate more favorable to the Republicans. A dozen of them entered the chamber following these elections. They were called liberals because they constantly spoke of freedoms and were aligned with the progressive liberal left, which was far from Republican. The group was led by La Fayette, a renowned general who had served in royal (during the American Revolutionary War) and revolutionary armies. It was composed of individuals who had participated in the Revolution and were considered \"first-generation patriots.\" They united around the idea of defending liberties. Generally, these liberals accepted the 1814 Charter, which they viewed as a guarantee of maintaining revolutionary freedoms. However, their main concern was the return of the nobility to power. The Republican Party drew most of its members from students, the petty bourgeoisie, and the military. These individuals were eager to return to a regime that honored the army's glory.\nSuccesses and underground organization\ncaused a scandal by winning a by-election in 1819.]]\nThe results of the 1818 partial legislative elections were a significant shock to Louis XVIII and his ministers. The Republicans gained a significant number of seats, with two former convention members, Pierre Daunou in Finistère and Jacques-Antoine Manuel in Vendée, being elected. The election of Republicans in traditionally royalist strongholds alarmed both ultras and government members. Republicans and liberals continued to make progress. Two emblematic figures entered the chamber in 1819: Benjamin Constant, a liberal and principal drafter of the Charter, and Abbé Grégoire, a former revolutionary regicide by letter and consent. These symbolic victories led to a massive youth rally in favor of the Republic, and various secret societies were founded. Some Republicans returned from exile and joined these societies, such as the Cavaignac and Carnot families. Some deputies expressed concern about the legitimacy of Abbé Grégoire's election.\nThe Republican Party was compelled to operate in secrecy due to the illegality of gatherings of more than 20 individuals under Article 291 of the 1810 Penal Code. They met in clandestine societies, the sole permissible form of political organization and the optimal means of expressing their distrust of the monarchy and its regime. The Union, established by Joseph Rey in 1816, was the inaugural such society. Initially liberal, many Republicans joined the Charbonnerie, which remained the most famous Republican secret society, such as La Fayette and Dupont de l'Eure. Imported from Italy, it recruited members from trusted circles, namely the army and universities, which were the Carbonari's reservoirs throughout the Restoration. The Charbonnerie was divided into regional \"sales,\" which were hierarchically organized at the national level. At the apex of this structure was a High Sale, which served as the directing body of the French Carbonari, which commanded cantonal and departmental sales. In a relatively short period, the Charbonnerie became the most important secret society opposing the monarchy. It was more influential than the Friends of Truth or the Knights of Liberty, which were established in the West. Initially, these societies were not taken seriously by the executive. However, their role in the Republican successes of 1818 made the government realize that they were far more powerful than initially thought. All Republicans participated during the 1820s, including Dupont de l'Eure, who was one of the architects of the Second Republic's establishment two decades later.\nFreemasonry also played a role in the Republican movement's success. It allowed many students to interact with \"party notables\" like La Fayette or Dupont de l'Eure. Furthermore, it united these clandestine networks, enabling the creation of the High Sale. Consequently, when Republican deputies resigned in 1820 following the enactment of the double-vote law, the unification of clandestine societies enabled Republican leaders to rely on a substantial illegal opposition to the monarchy and to use the power of numbers against the Bourbon regime.\nRepression by the authorities\nprecipitated a reactionary shift in the Chamber of Deputies, compelling Decazes to resign.]]\nRepublican ideas began to spread throughout Europe, alarming monarchs who took these shadowy figures seriously. Metternich, the promoter of sovereign rights in opposition to people's rights for European stability at the Congress of Vienna, decided to act against what he considered disruptive elements in the Holy Alliance's Europe. He convened international congresses to severely suppress clandestine nationalist Republican associations and promulgated the Carlsbad Decrees, a sort of precursor to Interpol, to ensure peace and stability. The French government rigorously implemented Metternich's policies. Professors who espoused Republican ideals were dismissed, and the Church regained a dominant role in education, raising concerns about a return to the Ancien régime. Authoritarian measures were also enacted, such as imposing a curfew to prevent clandestine meetings. Despite this European repression, sovereigns continued to be concerned about a revolution. These concerns were validated by the brief deposition of Spanish King Ferdinand VII, who was deposed by the military with the backing of Italian revolutionary groups due to his reluctance to implement the constitution.\nThe assassination of the Duke of Berry on 13 February 1820, by the Bonapartist worker Louis Pierre Louvel confirmed the trend initiated in Spain. As the future of the dynasty depended on the Duke, his death was perceived as regicide, and the assassination could not, in contemporary minds, be the act of a lone man. The ultras lashed out at the Decazes ministry, deemed too liberal and responsible for the situation. The ultras' return to the chamber in 1820 and the more authoritarian second Richelieu ministry further exacerbated tensions between the regime and the population. In response, the ultras passed a series of repressive laws, including the press censorship law of 30 March 1820, which suspended the freedom of the press, and the Double-vote Law of 12 June 1820, which was enacted in reaction to the relative liberal gains made in partial legislative elections. These laws were perceived as contravening the spirit of the Charter by liberals, whose reelection and aspirations to gain power were undermined by the new electoral law. Many liberal deputies resorted to illegality and Republican societies. Moreover, the ultras extended their control over potentially seditious elements. This was evidenced by the intensification of repression against professors advocating political liberalism, with Guizot's lectures being suspended in 1821. Additionally, the ultras strengthened Baron Mounier's police force to ensure the arrest and prosecution of all carbonari. These decisions solidified the liberal deputies' break with legality.\nThe assassination of the Duke of Berry deepened divisions, as hostility towards the Bourbons became overt. In the following days, there were numerous instances of symbolic acts favoring Napoleon's return. The government's repression galvanized students and soldiers dreaming of regime change, particularly in light of the measures taken in 1819 and 1820. The population, largely outraged by the press censorship and double-vote laws, supported the clandestine. Demonstrations in support of Napoleon were perceived as a provocation by the Richelieu ministry. Mounier, the police's general director, sent a dispatch on 27 December 1820, to 23 prefects in dangerous departments, indicating an imminent major plot against the regime. The government was now aware of the significance of this clandestine force and the threat it posed.\nThe \"true national opposition\"\nExpansion of the opposition movement\n, author of pro-revolutionary ditties inaugurating the Napoleonic legend.]]\nIn the early 1820s, the Republican movement experienced a period of significant growth. This success was due to three key factors: its ability to maintain a presence in the press despite censorship, the ability to rally Bonapartists, and the vogue of liberal ideas.\nFirstly, it is evident that newspapers were an effective propaganda tool for the Republicans. To continue using the press despite censorship, two strategies were employed. Firstly, some Republicans collaborated with liberal newspapers that managed to avoid censorship. These included Le Constitutionnel, La Minerve, and especially Le Courrier Français, which was run by a friend of La Fayette. These newspapers became the Republicans' \"official\" organs. The central government soon discerned the strategy and compelled the proprietors of Le Constitutionnel to disseminate Royal Ordinances against students suspected of a symbolic plot on 14 July 1820, under threat of suppression. The second strategy entailed publishing without prior approval. Clandestine newspapers were established, such as ''L'Ami de la Charte by Victor Mangin, one of the most widely distributed. Mangin was arrested and imprisoned for a month, later writing that L'Ami de la Charte had \"rendered some services to legal freedom\". Other newspapers were also published but changed names daily to avoid repression. These newspapers were distributed \"under the cloak\" to minimize the risk of arrest. The government harshly repressed these actions. Republican printers were arrested and replaced by former émigrés. Prefects were given subsidized newspapers reflecting monarchical ideals to counter Republican papers. Despite the severe repression they faced, the Republicans emerged from this ordeal with their resolve strengthened. Given the inherent risks involved, they developed a sense of solidarity with one another. To that end, they established a fund with the assistance of fellow carbonari'' and imprisoned Freemasons, which was designed to pay fines or ensure the livelihood of the incarcerated person's family.\nFollowing Napoleon's death on the island of Saint Helena on 5 May 1821, the Bonapartists gradually aligned with the Republicans. Contrary to popular belief, these two enemies of the Bourbon monarchy were far from harmonious. The Republicans, muzzled under Napoleon's Empire, had some reservations about this rapprochement. Ultimately, the defense of revolutionary ideas united the two parties. The concept of a Napoleonic legend, portraying Napoleon as the \"little soldier of the Revolution\" and the leader of the revolutionary armies that flooded Europe with ideals of equality and freedom, was developed under Béranger's influence. However, beyond Napoleon, it was primarily the political system of the Restoration and its deputies that the songwriter denigrated in his pamphlets. The most popular song of the era, Le Vieux Drapeau, celebrated revolutionary symbols, including the tricolor flag, which had been abolished since the Bourbons' return to France. These songs were highly popular, provoking the government's fury and leading to Béranger's imprisonment for a time. During his captivity, the man of letters continued to write songs praising the Revolution.\nA third factor that contributed to the rise of the Republican idea during the years 1820–1821 was intellectual evolution. With Romanticism on the rise, the American democratic ideal was indirectly reinforced by the clever reminder that it was inspired by the ideas of the Lights. The Glorious Revolution of 1688 in England was rediscovered. A multitude of writers used their pens to advocate for a more egalitarian and freer society, lauding political liberalism. Historians such as François Guizot also criticized the corruption and illegality of the monarchy's trials, thereby providing a platform for the most vehement oppositions.\nThe Charbonnerie, a French newspaper, reported that by 1821, the protest movement had grown to include between 30,000 and 40,000 members across 60 départements. This growth occurred in the wake of the ultras laws of 1820, which were enacted in response to the assassination of the Duc de Berry.\nAttempts at revolts\nshortly before their execution.]]\nThe success of the 1820 military coup in Spain demonstrated to French Republicans the potential for overthrowing the Bourbons from the French throne. The Carbonari were convinced that with the support of a portion of the army, a revolution was feasible. Under the guidance of Bazard and Buchez, efforts to persuade the army to join the revolution commenced in early August 1820. The endeavor proved more challenging than anticipated, with Masonic leaders presuming the army's support, which proved to be misguided. Additionally, the Republicans undertook considerable risks in their endeavors to persuade the military. A plot (later designated the French Bazard), aimed to incite the insurrection of the Saint-Denis garrison against the monarchical authority, was uncovered by royal authorities at the end of August 1820 and thwarted, in part, due to the actions of Mounier. He identified the perpetrators and those who were orchestrating the actions of these young committed Republicans, namely leaders such as La Fayette, Dupont de l'Eure, and a few liberals who had joined the movement. The plotters were subsequently apprehended, and others went into exile. The trial of the 34 accused took place in June 1821. The sentences were relatively lenient to prevent these Republicans from becoming martyrs. A similar plot was uncovered, that of the four sergeants of La Rochelle. In 1821, several soldiers in the 45th Infantry Regiment declined to proclaim \"Long live the King!\", prompting concern among the royal police. Consequently, the regiment was relocated from Paris to prevent the spread of military indiscipline to the capital, and it was transferred to La Rochelle. Eventually, the soldiers were denounced as members of seditious secret societies by an informant. They were subsequently arrested and tried.\narrives at the scene in time to observe La Fayette's vehicle.]]\nIn the face of government repression, Republicans perceived revolution as the only viable solution and hastened to prepare for the insurrection. The selected location for the commencement of the insurrection was Belfort, as Alsace was a Republican stronghold at the time. The revolutionaries' project, designated the \"Grand Plan,\" was to mobilize the population and the army to seize the prefectures and town halls of Alsace and proclaim an \"Alsatian Republic\". Following the capture of Belfort, the revolutionary fervor was to be disseminated throughout the country via the Carbonari strongholds in major French cities, a strategy proposed by Gérard Minart and known as the \"domino strategy.\" The signal for the Belfort insurrection's commencement was selected: upon the arrival of La Fayette in the city, the revolutionaries would initiate their actions. The date of the plot was set for 29 December. An unforeseen occurrence undermined this plan: the government, having learned of a general conspiracy in mid-1821, resolved to implement a dragnet of Carbonari militants from the Saumur Cavalry School. On 24 December 1821, eight Carbonari deemed suspicious were apprehended. La Fayette, apprised of this the following day, decided not to proceed with his planned departure for Alsace, leaving the revolutionaries in a state of considerable uncertainty. To compound the situation, an Alsatian sergeant, returning from leave earlier than anticipated, discovered the soldiers' seditious actions and reported the plot to his superiors. The project failed, some plotters fled, and others, such as Buchez, were arrested. La Fayette, unaware of the arrests, eventually decided to head for Belfort, unaware that he was entering a compromised situation. Bazard, informed of the situation, caught up with the general's carriage in time.\nDespite the debacle, Bazard was adamant about continuing the plan, which was not universally endorsed. Given the enthusiastic response of the Carbonari militants, it was ultimately decided to proceed with the insurrectionary movement. François Corcelle was tasked with implementing the revolutionary plans in Lyon and Marseille, but it was too late. These plans, already known to the authorities, were abruptly terminated, and the main leaders were compelled to flee. Despite the failure of the revolution in the Midi, the next phase of the plan, the conquest of western France, was initiated. This proved to be an unfortunate choice, as the Ministry of the Interior's experts had meticulously monitored the region through informants in the Masonic and Carbonari networks since the arrest of the eight Carbonari from Saumur. On 17 February 1822, representatives of the western France sales met clandestinely and resolved to act swiftly to avenge the Alsatian failure. The city of Saumur was designated as the initial point of departure for all insurrections in the region, although modifications were made to the plan. The revolution was to commence in Thouars before a lengthy march up to Saumur and then Le Mans. Despite the opposition of La Fayette's general committee, which was supported by Carbonari militants, the confrontation in the West was ultimately unavoidable. The insurrection, which was led by General Berton, commenced on 21 February. Thouars was taken, but the Republicans were ultimately unsuccessful in their efforts to overcome the resistance of the Saumurois loyal to the crown. As a result, the revolution was ultimately unsuccessful.\nThe time of trials\n, scene of the execution of the Four Sergeants of La Rochelle.]]\nis suspected of complicity with the Thouars insurgents.]]\nIn the wake of the failure of the insurrectional projects, the principal leaders sought refuge in foreign lands, evading arrest or the death penalty. The government, confronted with a multitude of insurrections during the years 1821–1822, resorted to the deployment of its political justice apparatus. Prefects, police commissioners, and prosecutors were requisitioned to adjudicate the few insurgents who had been apprehended. The four sergeants of La Rochelle were arrested, as were most of the insurgents of Thouars, due to the information provided by informants in the Masonic sales of the West. Consequently, 1822 was a year of trials and the purging of the Republican opposition by the power structure. The \"Revolution\" was over. The liberals, who had joined the revolutionary momentum without becoming too involved in the goal of toppling the Restoration, lost hope.\nThe trials proceeded in rapid succession, and the Villèle government sought to ensure that they would serve as a deterrent to others. On 25 April, Fidèle-Armand Vallé, who had been tasked with warning all the Carbonari in the South of the futility of the Belfort insurrection, was sentenced to death. He was finally executed on 10 June before a large crowd. On 1 May, one of the Saumurois sergeants who had been arrested at the end of 1821 was executed. He was the first of a list of individuals to be put to death. In July, the trial of the Belfort insurgents commenced. The government sought to have the proceedings be exemplary. However, due to the population's opposition to the government's repressive measures, all the accused, including Buchez, were either acquitted or received light sentences. The accused generally received support from the population, which suspected a return to the Ancien Régime since the Restoration's rightward turn in 1820. Instead of triumphing, the government was disavowed, exasperating its leaders. They then saw in the trials of the four sergeants of La Rochelle and those of the Thouars insurgents a double opportunity to settle scores for a while. The power finally obtained satisfaction. The trial of the Thouars insurgents resulted in ten death sentences and attempted to intimidate Benjamin Constant by designating him as an accomplice, which he refused. General Berton, the leader of the Thouars insurrection, was executed on 5 October 1822. Of the 25 accused in the La Rochelle trial, four sergeants were sentenced to death. The judicial authority sought to pardon them on the condition that they name their leaders, which they did not do, respecting the Carbonari tradition. Despite the population's compassion for them, they were executed on 21 September 1822, in Place de Grève in Paris. The trial of these four young sergeants who had rallied to the Republic and had been sentenced to death had a significant media impact, marking the end of this form of Republican illegality. The government thus emerged triumphant in the judicial conflict and significantly undermined the Republican movement. The Carbonari were effectively disbanded at a clandestine congress in Bordeaux. The majority of the leaders departed following the insurrectionary failures, while a few opted to join a new movement: socialism, particularly Saint-Simonianism.\nStrategy change in response to Charles X\nResistance through the pen and new leaders\nalienated the liberals by taking reactionary measures, with the help of Villèle.]]\nIn 1824, Louis XVIII died, and his successor to the throne was none other than his brother, the leader of the ultra-royalist party, Charles X, previously the Count of Artois. Unlike Louis XVIII, he had no desire to pursue a policy of reconciliation between the Revolution and the Ancien Régime. He deeply hated the revolutionary advancements, especially everything concerning individual liberties. From the outset of his reign, and even before that under Villèle's influence, press censorship was reinforced. Faced with these new limitations, the Republicans primarily expressed themselves through ironic caricatures, books with false titles, and historical or bibliographic pamphlets printed clandestinely. These latter played a significant role in republican propaganda. The writing of the history of the United States by three friends of La Fayette permitted the dissemination of the democratic idealism defended by the French Republicans. Additionally, the press disseminated this history. In 1826, Armand Carrel, who had participated in the unsuccessful Belfort Revolution, established the Revue Américaine, which lauded American-style democracy. This periodical was widely circulated and contributed to the resurgence of the Republicans beginning in 1827.\nThe United States was not the sole source of inspiration for the Republican movement. Some Carbonari looked to the example of the British monarchy, aligning themselves with many liberals in this regard. In 1825, Armand Carrel published La révolution de 1688 en Grande-Bretagne (The Revolution of 1688 in Great Britain), which explained the fall of the Stuarts. In this book, the Bourbons and the Stuarts are explicitly compared, and the allusions to a Glorious Revolution à la française are barely concealed. Concurrently, Augustin Thierry published ''Histoire de la conquête de l'Angleterre par les Normands (The History of the Conquest of England by the Normans), in which he praised \"the innate spirit of freedom among the Saxons.\" This work was relayed by the press and by the new liberal newspaper Le Globe. In addition to the aforementioned laudatory remarks concerning the parliamentary system, new works on the French Revolution were also published. Two young historians, Thiers and Mignet, both of whom were relatively unknown at the time, published Histoire de la Révolution (History of the Revolution). This was the first instance of the history of the Revolution being made accessible to the general public, with Mignet selling over 200,000 copies of his work. Guizot, for his part, published Essais sur l’histoire de France (Essays on the History of France) and the first two volumes of Histoire de la Révolution d’Angleterre (History of the English Revolution). This valorization of democracy and Parliamentarism facilitated a rapprochement between liberals and republicans.\nUnder the prevailing custom of the time, Charles X granted an amnesty at the outset of his reign in 1825. This amnesty permitted the principal republican leaders, including Trélat, Bazard, and Buchez, who had been compelled to seek refuge abroad, to return to the country. This return of party leaders was accompanied by the emergence of a new generation of republicans. In 1825, the Republican Party already included Godefroy Cavaignac, Jules Bastide, and Étienne Arago, all born after 1800. This youthful generation was augmented by three new members: Armand Marrast, an eminent man of letters who would later edit La Tribune des Départements; Étienne Garnier-Pagès, a future great orator of the republican party; and finally Robin Morhéry, who would play a very important role in the revolutions of 1830 and 1848. With these young recruits, the Republican Party acquired a \"key generation\" that played a role in all the revolutionary episodes of the 19th century, as well as in the establishment of the future Second and Third Republics.\nThe alliance of Orleanists and Republicans\nwas one of the main Orleanist leaders.]]\nDespite their differences, Orleanists and Republicans were compelled to ally against the ultra-royalist policy they jointly disapproved of. This alliance became increasingly likely as rumors of a return to the Ancien régime spread, and were explicitly confirmed by the coronation of Charles X in 1825. Many intellectuals, such as Victor Cousin, encouraged students to publish writings denouncing the Ancien Régime. Consequently, a new generation of students emerged, filling the ranks of the republican movement. They employed their eloquence to persuade as many people as possible of the benefits of a genuine parliamentary regime. Edgar Quinet and Auguste Sautelet were the most prominent representatives of this generation, steeped in the republican and liberal ideals of the years 1825–1830. The former was a close associate of Jules Michelet, and the latter established, with a few colleagues, the Gazette Littéraire'', a veritable instrument of republican propaganda. However, there were rivalries between the two currents of thought. The constitutionalists, supporters of Louis-Philippe's ascension to the throne in the wake of Charles X's controversial measures, increasingly felt the weight of the Republicans in public opinion and attempted to rally them to the idea of a constitutional monarchy. However, they were unsuccessful, as the young republicans were too convinced of the imminent establishment of a republic presided over by La Fayette. The constitutionalists and liberals in the chamber rejected any notion of universal suffrage as advocated by the Republicans. In 1829, Benjamin Constant wrote in Mélanges de littérature et de politique that he \"heard the triumph of individuality [...] over the masses who claim the right to enslave the minority to the majority,\" thus defending the bourgeois oligarchy against the majority of the French, considered apolitical. The Republicans participated in the banquets organized by the liberals but did not necessarily approve of the ideas that spread there. In April 1830, Godefroy Cavaignac declined to propose a toast to the king at a republican banquet organized by the 221 signatories of the address against Polignac, the head of the government at the time.\nIn 1827, the failure of Villèle's laws precipitated the imminent prospect of new elections. In response, the Republicans and liberals resolved to organize in a unified manner, establishing a society for this purpose, ''Aide-toi le ciel t'aidera''. This society permitted the Orleanists to emerge from the shadows, and from its inception, François Guizot assumed a leading role within its central council, which brought together all the future liberal political personnel of the July Monarchy: Thiers, Rémusat, Barrot, Laffite, and Casimir Perier, mingled with young, then unknown students like Auguste Blanqui. Although the society was Orleanist at its founding, Cavaignac, Carnot, and Bastide pushed the central council to broaden its scope to include outspoken Republicans, of whom they were influential members. Despite fundamental disagreements, Orleanists and Republicans found common ground in their shared defense of liberalism and opposition to the Church. Finally, the Orleanists accepted the Republicans' request, and the Republican-Orleanist cooperation was established, allowing them to approach the upcoming elections with confidence.\nThe 1827 elections: a symbolic victory\nserves as a propaganda tool for the Liberals.|alt=Portrait de Jacques Manuel.]]\nThe opposition to Villèle had very little time to organize. Under the impetus of the Aide-toi society, journalists, typographers, and sympathizers formed numerous opposition networks, mostly in cities where the Republicans had planned an insurrection a few years earlier. Regional republican leaders emerged with the constitution of these provincial networks, such as Ferdinand Flocon in Poitiers. These newspaper editors were supported by wealthy Orleanist lawyers and bankers and by subscriptions launched everywhere by students. A genuine sense of solidarity emerged from this society, with Republicans collaborating in the major liberal newspapers while the more profitable newspapers supported the poorer ones, thus constituting a genuine opposition press to ultra-royalism. André Encrevé even spoke of the reconstitution of the front of 1789, uniting all parties against the supporters of the Ancien Régime. Scholars, writers, jurists, university members, and provincials pooled their work. From this association of forces hostile to the regime were born the ideological foundations of the Republicans for the entire 19th century. Meetings were difficult due to the prohibition of gatherings. Funerals were thus the occasion for large opposition demonstrations. When Jacques-Antoine Manuel died in 1827, Armand Marrast and Robin Morhéry organized a massive funeral procession to demonstrate the strength of the opposition to Villèle. In response to this demonstration, Charles X dismissed Marrast from his teaching position. This repression, however, did not succeed in calming the Republicans, who were united under the aegis of the Aide-toi society, which gave them a legal appearance. Meetings were organized clandestinely in the offices of Le Globe, and the liberal machine seemed launched.\nThe opposition was aided by the unpopular and anachronistic measures taken by Charles X and Villèle. The Anti-Sacrilege Act, in particular, was a source of public outrage. The Society of Jesus was again authorized to teach, thereby excluding republican professors and triggering national anger. On 17 April, the ordinance strengthening press censorship encountered strong opposition, especially from peers, so much so that the government had to withdraw it. The dissolution of the National Guard was arguably the most ill-considered measure. On 29 April 1827, the king reviewed the guard, which received him very coldly. Hurt in his pride, he dissolved it the next day. This dissolution proved to be a major political error because the National Guard had long been the preserve of the middle classes. Since 1820, the Republicans had rallied the majority of the National Guard to their cause, which amounted to approximately 40,000 men. According to Countess Charlotte de Boigne, the dissolution of the guard by Charles X sowed \"in the heart of the population [...] a seed of hatred whose fruits were ripe in 1830\".\nFrom October 1827, six partial elections were won by the liberal coalition. Villèle, finding this intolerable and seeking to give new momentum to his government, convinced Charles X to dissolve the chamber, and new elections were scheduled for 17 and 24 November. An intense campaign was conducted by the Aide-toi society both in Paris and the provinces. The society denounced the system of official candidacies and the various electoral manipulations of the government while focusing its campaign on three points: the granting of a salary to deputies, a better distribution of constituencies, and the expansion of eligibility criteria (notably in terms of minimum age to favor the republican youth). The candidates affiliated with the Aide-toi society achieved unprecedented success, with the society holding a majority in 25 of the 30 largest cities in the kingdom. In Le Havre, for instance, Jean-Marie Duvergier de Hauranne, a prominent liberal figure, was elected by a substantial margin. After these elections, Villèle was compelled to resign. Charles X, concerned about the stability of his throne, consulted with the Duke of Orleans regarding his intentions, who responded with the message: \"They seek to establish a republic in France and topple the monarchy, but I will not permit it.\" Charles X was naive in his belief that Louis-Philippe was loyal, as the duke was preparing for a potential ascension to power.\n1830: the decisive year\nBeginnings of a revolution\n's actions provoked a negative reaction from the left-wing deputies.|alt=Gravure de Jules de Polignac]]\nFollowing the unsuccessful attempt at liberal conciliation by the Martignac government, Charles X appointed a notorious ultra-royalist, Jules de Polignac, as head of the government in 1829. This appointment provoked the anger of the leftist press, notably La Tribune, a fervently republican outlet that had been abandoned by the Orleanists in favor of Thiers' National. Auguste Fabre even asserted that La Tribune was the sole genuinely republican newspaper and, as a result, more susceptible to censorship. In contrast to the Orleanists, the republicans perceived the imminent threat of a coup by Charles X. At the end of 1829, a new central republican committee was established to prepare for a potential revolution. It maintained a distance from the Orleanists, organizing the insurrection in such a way that each republican leader would assume control of a district in Paris and proclaim themselves mayor. Some committee members were designated to train students and workers sympathetic to revolutionary action throughout the year. Additionally, the Association of Patriots, created in January 1830, promoted the La Fayette conspiracy, which aimed to install the \"hero of both worlds\" as the president of a potential republic. To avoid compromising La Fayette, meetings were held at La Tribune's offices. Meanwhile, the Orleanist press strongly condemned Polignac's policies, although they still believed in Charles X. On 29 January 1830, the Journal des débats wrote, \"There can be no compromise between the ministry and the chamber. One or the other must resign.\" Le Globe, now a daily publication, intensified its criticism through articles, resulting in the imprisonment of its editor-in-chief for four months.\nexplained how Charles X's ordinances violated the spirit of the Charter.|alt=Sculpture représentant Pierre Daunou.]]\nIn his address to the Chambers on 3 March 1830, the King lauded the virtues of the Algerian Expedition without addressing domestic politics. However, opposition deputies were unwilling to be lulled by such words and demanded Polignac's dismissal. They signed the Address of the 221, drafted by Royer-Collard, which was a true motion of no confidence against the minister. On 18 March, the king rejected the request and dissolved the chamber on 16 May, setting elections for 23 June and 3 July. The Orleanists and republicans rejoiced, believing that another success like that of 1827 would be achieved, with the slogan being the re-election of the 221. New newspapers were established across France by committed Republicans (Jeune France, Le Journal de Maine-et-Loire, Le Précurseur, and Le Patriote, the latter of which was directed by Marrast). Rumors circulated about a possible coup d'état by Charles X. In response, the republicans hastened their preparations, organizing numerous banquets to prepare minds for the revolution. At these banquets, many seditious speeches were made, alerting the police. In the days preceding the elections, students engaged in conflict with law enforcement, a development that evoked strong public sentiment. On 23 June, the results were announced, revealing a decline in the government's support, with the opposition increasing from 221 to 274 seats. Charles X opted to temporize and postponed the throne speech before the newly constituted chamber to 3 August. The deputies proceeded to take a leave of absence, and the king seized the opportunity to enact a series of conservative laws.\nOn 25 July 1830, Charles X suspended the freedom of the press, dissolved the Chamber, and reduced the number of voters through the four ordinances of Saint-Cloud. New elections were set for September. Public opinion perceived this as a true ''coup d'état''. Despite the government's lack of resources for its defense, the Orleanists appeared to be prepared to react only through legal channels, as evidenced by the protest text drafted by the liberal newspapers. Few deputies were still in Paris, but the thirteen republican deputies, all present, declared themselves ready to lead an insurrection. They acted swiftly and, thanks to their solid and swift organization, countered Charles X's ordinances. The Association of Patriots was on high alert. With Daunou's support, students read the ordinances aloud throughout the city, explaining how they violated the charter. Meanwhile, the Orleanists were concerned about the illegality of the Republican actions and decided to refrain from involvement in the uprising. On the evening of 26 July, the most influential members of the association convened at Armand Marrast's residence to organize the planned insurrection for the following day. It was decided that it would commence in Paris. Concurrently, another meeting of Republican deputies was held at Alexandre de Laborde's residence. After protracted deliberations, the deputies embraced the revolution. Plans were formulated to procure weapons and tear up the streets. On the evening of 26 July, urban guerrilla warfare commenced between law enforcement and insurgents, who vandalized whatever they found. The revolution had begun.\nThe Three Glorious Days\n, Combat de la rue de Rohan le 29 juillet 1830, Musée Carnavalet.]]\nOn the morning of 27 July, the revolution was still known only to the organizers. Morhéry and his accomplices cut off communication channels. Firefighters, coachmen, and cart drivers were warned of the imminent insurrection by young members of the Association of Patriots, while students sabotaged the Chappe telegraph, cutting Paris off from the rest of France. While liberal journalists initially hesitated, ultimately deciding to publish without authorization, Auguste Blanqui and Armand Marrast gathered students from the Latin Quarter who proceeded to the bridges of Paris and prepared for confrontation. By noon, there had already been one death, which was hailed as a martyr by Benjamin Clemenceau and which galvanized the insurgents. While Marmont decided to send troops to strategic points in the capital, students of the Association of Patriots gathered at La Tribune's offices. They opted to attack small police stations to obtain weapons and to set up insurrectionary camps wherever possible, to persuade the population to join the movement. The first barricades were erected in the vicinity of Montmartre, and according to Jean Tulard, Morhéry's lieutenants rallied Parisian workers to their cause. By 6&nbsp;pm, approximately 5,000 individuals had congregated in the Faubourg Saint-Honoré. Despite opposition from Orleanist deputies, republican deputies decided to establish the covert municipalities that had been planned since 1829. Armories and military museums were looted, and efforts were made to spread the insurrectionary sentiment throughout Paris.\nOn the morning of 28 July, barricades were erected throughout Paris. While Orleanists and notable figures evacuated the city, the Carbonari were prepared for combat. The central republican committee, located at the Garnier-Pagès brothers' residence, ordered the mobilization of troops. However, numerous individuals remained hidden, yet insufficient for the needs of all revolutionaries. Meanwhile, Marshal Marmont was resolute in his intention to put an end to the insurrection. His strategy was to push the republicans back into the working-class suburbs to retake the heart of Paris, which was held by the revolutionaries. Neither Marmont nor Polignac considered the insurrection to be a revolution, believing the insurgents to be disorganized. However, on the afternoon of 28 July, the insurgents repelled the royal armies, preventing them from retaking the Hôtel de Ville. At five o'clock in the afternoon, the tricolor flag was hoisted over the Hôtel de Ville, signifying the cessation of hostilities. Marmont retreated to the west of Paris, believing that the insurrection could still be contained. However, he encouraged Polignac to begin negotiations, which the latter refused. As the situation grew increasingly worrisome, Marmont and the royalists informed the king and urged him to make a quick decision. Marmont dispatched a missive that has become legendary in its own right: \"This is not a revolt, but a revolution. The honor of the crown can still be saved; tomorrow it may be too late.\" Meanwhile, word of the ordinances reached the provinces, prompting a public outcry and demands for the reestablishment of the National Guard, which had been dissolved in 1827.\nBy 29 July, the Parisian revolution had spread to the provinces, where republicans engaged in combat with reluctant mayors and prefects. In Nantes, the tricolor flag was raised over the prefecture following intense fighting. In Lyon, former National Guardsmen, with the support of the population, stormed the city hall where the mayor had barricaded himself. At six in the morning in Paris, republican insurgents rebuilt barricades. At seven in the morning, the Republican \"general staff\" issued a decree designating the Louvre Palace as the next target. A vast crowd, including Bazard, Buchez, Guinard, Cavaignac, and Bastide, departed from the Panthéon and proceeded towards the palace. Given the growing number of insurgents and the Parisian population's support for the rioters, the royal armies retreated to the Champs-Élysées and abandoned the Louvre to the revolutionaries. Subsequently, the Tuileries was taken. The number of casualties is estimated at 200 soldiers and a thousand insurgents. By evening, the royal army was unofficially defeated, capable only of protecting the Saint-Cloud palace, where Charles X and Polignac were. The revolutionaries appeared to have won, as the royal armies had retreated outside Paris.\nOrleanist hesitation and betrayal\n.|alt=Peinture représentant l'arrivée du duc d'Orléans à Paris.]]\nOn 27 and 28 July, La Fayette was absent from Paris. He returned on 29 July and assumed command of the National Guard. He also informed the Orleanists of the republican projects of the central commission at the Hôtel de Ville. Ultimately, the Orleanists negotiated two seats out of five on this commission, which was inspired by the American model. As the judge between the Orleanists and the Republicans during the Three Glorious Days, La Fayette held the fate of France in his hands. He was aware of his role and refrained from mentioning the republic or the Duke of Orleans. Meanwhile, Charles X revoked the measures that had caused the unrest and ordered the formation of a cabinet. However, there was little confidence in his future in Paris. The possibility of relocating the government to Tours was considered, but the king refused, opting instead to go into exile. This effectively removed the last obstacle to a regime change. The question then arose as to whether a republic should be proclaimed or a second constitutional monarchy with the Duke of Orleans as king. Although the Republicans had led the insurrection, the Orleanists, haunted by the specter of another Terror, were not ready to accept a republic. On 30 July, the Orleanists initiated action. Thiers and Mignet disseminated placards throughout Paris, advocating for the designation of the Duke of Orleans as sovereign and emphasizing that a republic would isolate France from the monarchist Europe of the time. Concurrently, Charles de Rémusat, an Orleanist, consulted with La Fayette on his intentions. Ultimately, the aged general relented, recognizing the Duke of Orleans as the rightful king. He declared, \"The Duke of Orleans will be king, as surely as I will not be.\" La Fayette, the leader of the republicans, was implored by Morhéry to proclaim the republic, but the general had already made his decision. The Orleanists then proceeded to exercise their authority, proclaiming Louis-Philippe \"lieutenant general of the kingdom,\" a purely honorary title that permitted the duke to enter Paris. The Duke of Orleans accepted the position and arrived at the Palais-Royal on the night of 30 July.\nOn 31 July, the entire liberal press prepared the public for the imminent establishment of a second constitutional monarchy with Louis-Philippe as ruler. Thiers' Le National wrote that they \"needed this republic disguised as a monarchy.\" While the Duke of Orleans addressed Parisians, La Fayette announced his full support for the Duke of Orleans before the Commission of Five, then invited him to the Hôtel de Ville. The embrace between the two men during this meeting became a famous symbol of the union between the cadet branch of the Bourbons and revolutionary principles. During the first week of August, as Louis-Philippe firmly established his power, the chamber's reluctance to revise the hereditary nature of the Chamber of Peers led students and workers, under republican leadership, to gather in front of the Palais Bourbon. La Fayette's speech calmed the insurgents. On 8 August, the chamber granted Louis-Philippe the title of King of the French. On 11 August, the king formed his first ministry, which included both Orleanists and republicans. The government was led by Laffitte and included Guizot as Interior Minister, Dupont de l'Eure as Justice Minister, and Louis Molé as Foreign Minister. The July Monarchy was established with republican support, marking the end of the Restoration. This brief period of republican support for the July Monarchy was soon followed by the arrest of republicans by the royal police in September 1830. Disillusioned by the lack of radical reforms that they had anticipated, two years after contributing to the establishment of the new monarchy, the Republicans were already attempting to overthrow it.\nSee also\n* Bourbon Restoration in France\n* French Republicans under the July Monarchy\nReferences\nSources\nPrimary sources\n*\n*\n*\nSecondary sources\nGeneral literature\n*\n*\n*\n*\n*\n*\n*\nSpecialist books and articles\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\ncategory:1820s in France"
    }
  ]
}