{
  "content": [
    {
      "type": "text",
      "text": "# French–Tripolitania War\n\nThe Franco–Tripolitanian War (1681-1685) was part of a wider campaign by France against the Barbary Pirates in the 1680s.\nBackground\nIn June 1681, corsairs from the Regency of Tripolitania captured French merchant ships off the coast of Provence. Louis XIV sent Admiral Abraham Duquesne, with nine ships under his command, to hunt down the pirates. He tracked them to Chios, which had recently been captured by the Ottoman Empire where they were taking refuge.\nBombardment of Chios (1681)\nDuquesne sends an emissary, M. de Saint-Amand, to summon the pacha commanding in Chios to send out the corsairs, under penalty of destruction of the port and the fortresses, which he refuses.  On July 23, 1681, Duquesne ordered the ships of his squadron to bombard the city and the port. The French fire was so vigorous that in less than four hours the Barbary fleet, the fortresses and the port were badly damaged. A Turkish account of the time recounts this attack: \"The French infidels came to Scio, they fired for four hours on the vessels of Tripoli Barbary, they also damaged the fortresses and the mosques. \"Many Greeks are among the victims because they are the majority on the island. Several Orthodox churches are affected.\"\nDespite the relentless bombardment, the Pirates refused to surrender to the French. The French in turn then establish a blockade of the Port. This created diplomatic issues between France and the Ottoman Empire as France is infringing on their Sovereignty. Louis did not want war with the Ottomans due to French economic interests in maintaining good relations with the Ottomans and therefore makes the French merchants in Constantinople pay 80,000 Crowns compensation to the Turkish Authorities to appease them.\nAfter several weeks of blockade, the pirates finally capitulate and come to terms for peace, which is signed at the end of December 1681. The Treaty brings allededly brings end to the war and all captured slaves are freed. On the Pirates return to Tripoli this peace is rejected by the Dey and the Captains are beheaded. Further French action would be required in 1685.\nBombardment of Tripoli (1685)\nThis action carried out by Jean II d'Estrées would destroy large parts of Tripoli and bring the Dey of Tripoli to terms with France. The Devastation of the city would cause panic in the neighbouring Recency of Tunis leading to their capitulation without a fight.\nReferences"
    }
  ]
}