{
  "content": [
    {
      "type": "text",
      "text": "# French battleship République__disambig_1\n\n|section2=\n| name=République\n| namesake=French Republic\n| laid_down=27 December 1901\n| launched=4 September 1902\n| commissioned=12 January 1907\n| struck=1921\n| fate=\n}}\n|section3= pre-dreadnought battleship\n| displacement=\n| length= loa\n| beam=\n| draft=\n| propulsion=\n*3 × triple-expansion steam engines\n*3 × screw propellers\n| power=\n* 24 × Niclausse boilers\n*\n| speed=\n| range= at\n| complement=\n* 32 officers\n* 710 enlisted men\n| armament=\n* 4 ×  Modèle 1893/96 guns\n* 18 ×  Modèle 1896 guns\n* 13 ×  Modèle 1902 guns\n* 8 ×  guns\n* 2 ×  torpedo tubes\n| armor=\n* Belt:\n* Primary turrets:\n* Secondary turrets:\n* Conning tower:\n* Upper deck:\n* Lower deck:\n| notes=\n}}\n}}\nRépublique was a pre-dreadnought battleship, the lead vessel of the  built for the French Navy built in the early 1900s. Laid down in December 1901, she was launched in September 1902 and commissioned in January 1907. Armed with a main battery of four  guns, she was outclassed before even entering service by the revolutionary British battleship , that had been commissioned the previous December and was armed with a battery of ten guns of the same caliber. Though built to an obsolescent design, République proved to be a workhorse of the French fleet, particularly during World War I.\nDuring the ship's peacetime career, République served with the Mediterranean Squadron; this period was occupied with training exercises and cruises in the western Mediterranean Sea and the Atlantic. She was moored near the battleship  when the latter exploded accidentally in 1911, and she was damaged by flying debris. Following the outbreak of war in July 1914, République was used to escort troopship convoys carrying elements of the French Army from French North Africa to face the Germans invading northern France. She thereafter steamed to contain the Austro-Hungarian Navy in the Adriatic Sea, taking part in the minor Battle of Antivari in August. The increasing threat of Austro-Hungarian U-boats and the unwillingness of the Austro-Hungarian fleet to engage in battle led to a period of monotonous patrols that ended with Italy's entry into the war on the side of France, which allowed the French fleet to be withdrawn.\nIn 1916, République was sent to cover the withdrawal from the Gallipoli campaign, and thereafter became involved in events in Greece, being stationed in Salonika to put pressure on the Greek government to enter the war on the side of the Allies. She contributed men to a landing party that went ashore in Athens to support a pro-Allied coup. She saw little activity in 1917 and 1918 after the coup succeeded. In January 1918, she had half of her main guns removed for use by the French Army and was reclassified as a training ship. She served in that role until replaced by other ships in 1920. République was decommissioned in May 1921 and broken up in Italy beginning in November.\nDesign\nThe ships of the République class marked a significant improvement over earlier French battleships, being significantly larger and better-armed and armored than the preceding battleship . Designed by Louis-Émile Bertin, the ships incorporated a new armor layout that included a more comprehensive armored citadel that would better resist flooding than the shallow side armor used in earlier vessels.\nRépublique was  long overall and had a beam of  and an average draft of . She displaced  at full load. She was powered by three vertical triple expansion engines with twenty-four Niclausse boilers. They were rated at  and provided a top speed of . Coal storage amounted to , which provided a maximum range of  at a cruising speed of . She had a crew of 32&nbsp;officers and 710&nbsp;enlisted men.\nRépubliques main battery consisted of four Canon de 305 mm Modèle 1893/96 guns mounted in two twin-gun turrets, one forward and one aft. The secondary battery consisted of eighteen Canon de 164 mm Modèle 1893 guns; twelve were mounted in twin turrets, and six were in casemates in the hull. She also carried twenty-four  guns. The ship was also armed with two  torpedo tubes, which were submerged in the hull.\nThe ship's main belt was  thick in the central citadel, and was connected to two armored decks; the upper deck was  thick while the lower deck was  thick, with  sloped sides. The main battery guns were protected by up to  of armor on the fronts of the turrets, while the secondary turrets had  of armor on the faces. The conning tower had  thick sides.\nModifications\nTests to determine whether the main battery turrets could be modified to increase the elevation of the guns (and hence their range) proved to be impossible, but the Navy determined that tanks on either side of the vessel could be flooded to induce a heel of 2&nbsp;degrees. This increased the maximum range of the guns from . New motors were installed in the secondary turrets in 1915–1916 to improve their training and elevation rates. Also in 1915, the 47&nbsp;mm guns located on either side of the bridge were removed and the two on the aft superstructure were moved to the roof of the rear turret. On 8 December 1915, the naval command issued orders that the light battery was to be revised to just four of the 47&nbsp;mm guns and eight  guns. The light battery was revised again in 1916, with the four 47&nbsp;mm guns being converted with high-angle anti-aircraft mounts. They were placed atop the rear main battery turret and the number 5 and 6 secondary turret roofs. In 1912–1913, the ship received two  Barr & Stroud rangefinders.\nService history\nConstruction – 1909\nRépublique was laid down at the Arsenal de Brest on 27 December 1901, was launched on 4 September 1902, and was commissioned on 12 January 1907, shortly after the revolutionary British battleship , which rendered the pre-dreadnoughts like République outdated. After commissioning, République conducted her sea trials. During the speed trials, she reached a top speed of , more than a knot faster than her contract speed of . From 16 to 26 January, she steamed from Brest to Toulon, where she conducted wireless telegraphy tests in conjunction with the armored cruiser  and the Eiffel Tower from 14 to 17 February. She then joined the 1st Division of the Mediterranean Squadron, along with her sister  and Suffren, the divisional flagship. Beginning on 1 July, the French fleet embarked on its annual summer maneuvers, which lasted until 31 July. The Mediterranean Squadron joined the Northern Squadron for exercises in the western Mediterranean.\nOn 13 January 1908, République and the battleships Patrie, , , , , and  steamed to Golfe-Juan and then to Villefranche-sur-Mer, where they remained for more than a month. In June and July, the Mediterranean and Northern Squadrons conducted their annual maneuvers, this time off Bizerte. The squadron was moored in Villefranche in February 1909 and thereafter conducted training exercises off Corsica, followed by a naval review in Villefranche for President Armand Fallières on 26 April. During this period of training, on 17 March, République, Patrie, , and  conducted shooting training, using the old ironclad  as a target.\nIn June, République, Justice, and the protected cruiser  got underway for training in the Atlantic; they met Patrie, , Liberté, and the armored cruiser  at Cádiz, Spain on 12 June. Training included serving as targets for the fleet's submarines in the Pertuis d'Antioche strait. The ships then steamed north to La Pallice, where they conducted tests with their wireless sets and shooting training in Quiberon Bay. From 8 to 15 July, the ships lay at Brest and the next day, they steamed to Le Havre. There, they met the Northern Squadron for another fleet review for Fallières on 17 July. Ten days later, the combined fleet steamed to Cherbourg, where they held another fleet review, this time during the visit of Czar Nicholas II of Russia. In October, the 1st Division ships, which by then consisted of République and Patrie steamed to Barcelona, Spain. The ships were inspected by King Alfonso XIII, who boarded Patrie during the visit.\n1910–1914\nRépublique joined Patrie, Justice, Vérité, Démocratie, and Suffren for a simulated attack on the port of Nice on 18 February. During the maneuvers, Patrie launched a torpedo that accidentally hit République, damaging her hull and forcing her to put into Toulon for repairs. The ships of the 1st Squadron held training exercises off Sardinia and Algeria from 21 May to 4 June, followed by combined maneuvers with the 2nd Squadron from 7 to 18 June. An outbreak of typhoid among the crews of the battleships in early December forced the navy to confine them to Golfe-Juan to contain the fever. By 15 December, the outbreak had subsided.\nOn 16 April 1911, République and the rest of the fleet escorted Vérité, which had aboard Fallières, the Naval Minister Théophile Delcassé, and Charles Dumont, the Minister of Public Works, Posts and Telegraphs, to Bizerte. They arrived two days later and held a fleet review that included two British battleships, two Italian battleships, and a Spanish cruiser on 19 April. The fleet returned to Toulon on 29 April, where Fallières doubled the crews' rations and suspended any punishments to thank the men for their performance. République and the rest of 1st Squadron and the armored cruisers Ernest Renan and  went on a cruise in the western Mediterranean in May and June, visiting a number of ports including Cagliari, Bizerte, Bône, Philippeville, Algiers, and Bougie. By 1 August, the battleships of the  had begun to enter service, and they were assigned to the 1st Squadron, displacing République, Patrie, and the Liberté-class ships to the 2nd Squadron.\nThe fleet held another fleet review outside Toulon on 4 September. Admiral Jauréguiberry took the fleet to sea on 11 September for maneuvers and visits to Golfe-Juan and Marseille, returning to port five days later. On 25 September, Liberté exploded while in Toulon, another French battleship claimed by unstable Poudre B propellant. A  piece of armor plate struck République on the starboard quarter directly behind the main battery turret and killed twenty-three men. On an investigation of the damage, it was found that a melinite shell from Liberté hit the ship in the same location and exploded, punching a hole in the armored deck. Despite the accident, the fleet continued with its normal routine of training exercises and cruises for the rest of the year.\nOn 24 April 1912, République went to sea with Justice for gunnery training off the Hyères roadstead; they were joined by Patrie and Vérité the next day. Admiral Augustin Boué de Lapeyrère inspected both battleship squadrons in Golfe-Juan from 2 to 12 July, after which the ships cruised first to Corsica and then to Algeria. Late in the year, République went into drydock in Toulon for a refit that concluded in early April, after which she returned to the 2nd Squadron. The French fleet, which by then included sixteen battleships, held large-scale maneuvers between Toulon and Sardinia beginning on 19 May. The exercises concluded with a fleet review for President Raymond Poincaré. Gunnery practice followed from 1 to 4 July. The 2nd Squadron departed Toulon on 23 August with the armored cruisers  and  and two destroyer flotillas to conduct training exercises in the Atlantic. While en route to Brest, the ships stopped in Tangier, Royan, Le Verdon, La Pallice, Quiberon Bay, and Cherbourg. They reached Brest on 20 September, where they met a Russian squadron of four battleships and five cruisers. The ships then steamed back south, stopping in Cádiz, Tangier, Mers El Kébir, Algiers, and Bizerte before ultimately arriving back in Toulon on 1 November. On 3 December, République, Justice, Vérité, and Démocratie conducted torpedo training and range-finding drills.\nThe 2nd Squadron ships conducted torpedo training on 19 January 1914, and later that month they steamed to Bizerte, returning to Toulon on 6 February. On 4 March, République, Démocratie, Vérité, and Justice joined the 1st Squadron battleships and the 2nd Light Squadron for a visit to Porto-Vecchio, Sardinia. On 30 March, the 2nd Squadron ships steamed to Malta to visit the British Mediterranean Fleet, remaining there until 3 April. The squadron visited various ports in June, but following the assassination of Archduke Franz Ferdinand and the ensuing July Crisis prompted the fleet to remain close to port, making only short training sorties as international tensions rose.\nWorld War I\n1914–1915\nFollowing the outbreak of World War I in July 1914, France announced general mobilization on 1 August. The next day, Boué de Lapeyrère ordered the entire French fleet to begin raising steam at 22:15 so the ships could sortie early the next day. Faced with the prospect that the German Mediterranean Division—centered on the battlecruiser —might attack the troopships carrying the French Army in North Africa to metropolitan France, the French fleet was tasked with providing heavy escort to the convoys. Accordingly, République and the rest of the 2nd Squadron were sent to Algiers, where they joined a group of seven passenger ships that had a contingent of 7,000 troops from XIX Corps aboard. While at sea, the new dreadnought battleships  and  and the Danton-class battleships  and , which took over as the convoy's escort. Instead of attacking the convoys, Goeben bombarded Bône and Philippeville and then fled east to the Ottoman Empire.\n]]\nOn 12 August, France and Britain declared war on the Austro-Hungarian Empire as the war continued to widen. The 1st and 2nd Squadrons were therefore sent to the southern Adriatic Sea to contain the Austro-Hungarian Navy. On 15 August, the two squadrons arrived off the Strait of Otranto, where they met the patrolling British cruisers  and  north of Othonoi. Boué de Lapeyrère then took the fleet into the Adriatic in an attempt to force a battle with the Austro-Hungarian fleet; the following morning, the British and French cruisers spotted vessels in the distance that, on closing with them, turned out to be the protected cruiser  and the torpedo boat , which were trying to blockade the coast of Montenegro. In the ensuing Battle of Antivari, Boué de Lapeyrère initially ordered his battleships to fire warning shots, but this caused confusion among the fleet's gunners that allowed Ulan to escape. The slower Zenta attempted to evade, but she quickly received several hits that disabled her engines and set her on fire. She sank shortly thereafter and the Anglo-French fleet withdrew.\nThe French fleet patrolled the southern end of the Adriatic for the next three days with the expectation that the Austro-Hungarians would counterattack, but their opponent never arrived. On 17 August, Justice and Démocratie collided in heavy fog at 09:20; the latter vessel lost her rudder and center screw. République took her under tow at 12:40, steaming first to Corfu and then to Malta. They arrived there on 20 August, at which point République steamed back north to rejoin her squadron. On 1 September, the French battleships then bombarded Austrian fortifications at Cattaro on 1 September in an attempt to draw out the Austro-Hungarian fleet, which again refused to take the bait. In addition, many of the ships still had shells loaded from the battle with Zenta, and the guns could not be emptied apart from by firing them. On 18–19 September, the fleet made another incursion into the Adriatic, steaming as far north as the island of Lissa.\nThe fleet continued these operations in October and November, including a sweep off the coast of Montenegro to cover a group of merchant vessels replenishing their coal there. Throughout this period, the battleships rotated through Malta or Toulon for periodic maintenance; Corfu became the primary naval base in the area. The patrols continued through late December, when an Austro-Hungarian U-boat torpedoed Jean Bart, leading to the decision by the French naval command to withdraw the main battle fleet from direct operations in the Adriatic. For the rest of the month, the fleet remained at Navarino Bay. The battle fleet thereafter occupied itself with patrols between Kythira and Crete; these sweeps continued until 7 May. Following the Italian entry into the war on the side of France, the French fleet handed control of the Adriatic operations to the Italian Regia Marina (Royal Navy) and withdrew its fleet to Malta and Bizerte, the latter becoming the main fleet base.\n1916–1918\nIn January 1916, République joined the Allied fleet off the Dardanelles supporting the Gallipoli campaign then in its final stage. She and Gaulois covered the evacuation from Gallipoli shortly thereafter. Following the withdrawal from Gallipoli, the French transferred many of its pre-dreadnoughts, including République, to Salonika, Greece. These ships, comprising the five République- and Liberté-class battleships, were organized as the 3rd Squadron, and they were tasked with pressuring the Greek government. The Greek government, under King Constantine I, had thus far refused to enter the war on the side of the Allies, in large part due to Constantine's wife Sophie being the sister of Kaiser Wilhelm II. Over the course of June and July, the ships alternated between Salonika and Mudros, and later that month the fleet was transferred to Cephalonia.\nIn August, a pro-Allied group launched a coup against the monarchy in the Noemvriana, which the Allies sought to support. République contributed men to a landing party that went ashore in Athens on 1 December support the coup. The British and French troops were defeated by the Greek Army and armed civilians and were forced to withdraw to their ships, after which the British and French fleet imposed a blockade of the royalist-controlled parts of the country. By June 1917, Constantine had been forced to abdicate and the 3rd Squadron was disbanded; République and Patrie became the Eastern Naval Division and were sent to the eastern Mediterranean. While in Lemnos on the night of 17/18 November, République broke free from her anchors and ran aground in the harbor, though she was refloated with help from several tugboats and British vessels. In December, both ships had their center and aft casemate guns removed. The ships spent 1917 largely idle as men were withdrawn from the fleet's battleships for use in anti-submarine warships.\nOn 20 January 1918, the French received word that the battlecruiser Goeben (now under the Ottoman flag as Yavuz Sultan Selim) would sortie, so République and Patrie prepared for action. The battlecruiser struck several naval mines, however, and broke off the attack so the French ships remained in port. Shortly thereafter, République steamed to Toulon for maintenance that lasted from 29 January to 19 February. This included replacing two of her 305&nbsp;mm guns, but while this was being done, the shipyard received orders to turn both guns over to the French Army for field use. With only half of her main battery still mounted, République was then reduced to a training ship on 28 March.\nPostwar fate\nRépublique continued in service as a training vessel after the war; on 1 July 1919 she was formally assigned to the school of armorers and gunners. On 2 October 1919, she went into drydock to have her main battery turrets removed, and her 164.7&nbsp;mm casemate guns were also removed, though she retained the secondary turret guns. As more modern battleships were withdrawn from service in the postwar reduction in force, they displaced République. On 9 December 1920, the battleship  took her place in the gunnery school. République was decommissioned on 21 May 1921 and stricken from the naval register on 29 June. In November, she was taken to Savona, Italy, where she was broken up for scrap.\nFootnotes\nReferences\n*\n}}\n*\n| url-access = registration\n| url = https://archive.org/details/conwaysallworlds0000unse_l2e2\n}}\n*\n}}\n*\n}}\n*\n}}\n*\n}}\n*\n|name-list-style=amp\n}}\n*\n}}\n*\n}}\n*\n}}\n*\n| pages = 1457–1459\n}}"
    }
  ]
}