{
  "content": [
    {
      "type": "text",
      "text": "# French battleship Saint Louis\n\n{|\n|Ship name=Saint Louis\n|Ship namesake=King Louis IX of France\n|Ship ordered=\n|Ship awarded=\n|Ship builder=Arsenal de Lorient\n|Ship original cost=26,981,000 francs\n|Ship yard number=\n|Ship way number=\n|Ship laid down=25 March 1895\n|Ship launched=2 September 1896\n|Ship sponsor=\n|Ship christened=\n|Ship completed=1 September 1900\n|Ship commissioned=\n|Ship recommissioned=\n|Ship decommissioned=8 February 1919\n|Ship in service=\n|Ship out of service=\n|Ship renamed=\n|Ship reclassified=*As training ship, 8 February 1919\n*As accommodation hulk, 20 June 1920\n|Ship struck=29 June 1931\n|Ship motto=\n|Ship nickname=\n|Ship honours=\n|Ship fate=Sold for scrap, 25 April 1933\n|Ship notes=\n|Ship badge=\n}}\n|Ship displacement= (deep load)\n|Ship length=\n|Ship beam=\n|Ship draught=\n|Ship power=* 20 Belleville water-tube boilers\n*\n|Ship propulsion=3 shafts, 3 triple-expansion steam engines\n|Ship speed=\n|Ship range= at\n|Ship complement=* 732\n* 785 as flagship\n|Ship armament=*2 × 2 -  Mle 1893 guns\n* 10 × 1 -  Mle 1893 guns\n* 8 × 1 -  Mle 1893 guns\n* 20 × 1 - 47 mm Mle 1885 Hotchkiss guns\n* 4 ×  torpedo tubes\n|Ship armour=* Belt:\n* Decks:\n* Barbettes:\n* Turrets:\n* Conning tower:\n|Ship notes=\n}}\n|}\nSaint Louis was the last of the three  pre-dreadnought battleships built for the French Navy in the mid-1890s. She spent most of her career assigned to the Mediterranean Squadron (escadre de la Méditerranée) and usually was chosen to serve as a flagship. The ship was involved in two accidental ramming incidents with two other French warships in her career, one of which sank a submarine.\nWhen World War I began, she escorted Allied troop convoys for the first two months. Saint Louis was ordered to the Dardanelles in November 1914 to guard against a sortie into the Mediterranean by the German battlecruiser . In 1915, she was transferred to the Eastern Mediterranean where she participated in bombarding Turkish positions in Palestine and the Sinai Peninsula. The ship returned to the Dardanelles in May and provided fire support during the Gallipoli Campaign. Saint Louis was transferred to the squadron assigned to prevent any interference by the Greeks with Allied operations on the Salonica front in May 1916, after a lengthy refit in France. The ship was placed in reserve in April 1917 and briefly became a training ship in 1919–20. She was converted to serve as an accommodation hulk in 1920 and listed for disposal as scrap in 1931. Saint Louis did not find a buyer, however, until 1933.\nDesign and description\nSaint Louis was  long overall and had a beam of . At deep load, she had a draught of  forward and  aft. She displaced  at deep load. Her crew consisted of 30 officers and 702 sailors as a private ship, or 41 officers and 744 men as a fleet flagship.\nThe ship used three 4-cylinder vertical triple expansion steam engines, one engine per shaft. Rated at , they produced  during the ship's sea trials using steam generated by 20 Belleville water-tube boilers. Saint Louis reached a top speed of  on her trials. She carried a maximum of  of coal which allowed her to steam for  at a speed of .\nSaint Louis carried her main armament of four 40-calibre Canon de 305 mm Modèle 1893 guns in two twin-gun turrets, one each fore and aft. The ship's secondary armament consisted of ten 45-calibre Canon de 138 mm Modèle 1893 guns, eight of which were mounted in individual casemates and the remaining pair in shielded mounts on the forecastle deck amidships. She also carried eight 45-calibre Canon de 100 mm Modèle 1893 guns in shielded mounts on the superstructure. The ship's anti-torpedo boat defences consisted of twenty 40-calibre Canon de 47 mm Modèle 1885 Hotchkiss guns, fitted in platforms on both masts, on the superstructure, and in casemates in the hull. Saint Louis mounted four  torpedo tubes, two on each broadside. Two of these were submerged, angled 20° from the ship's axis, and the other two were above the waterline. They were provided with twelve Modèle 1892 torpedoes. As was common with ships of her generation, she was built with a plough-shaped ram.\nThe Charlemagne-class ships carried a total of  of Harvey armour. They had a complete waterline armour belt that was  high. The armour belt tapered from its maximum thickness of  to a thickness of  at its lower edge. The armoured deck was  thick on the flat and was reinforced with an additional  plate where it angled downwards to meet the armoured belt. The main turrets were protected by  of armour and their roofs were  thick. Their barbettes were  thick. The outer walls of the casemates for the  guns were 55&nbsp;mm thick and they were protected by transverse bulkheads  thick. The conning tower walls were  thick and its roof consisted of 50&nbsp;mm armour plates. Its communications tube was protected by armour plates  thick.\nConstruction and career\nSaint Louis, named after King Louis IX, a Catholic saint, was authorised on 30 September 1895 as one of the three Charlemagne-class battleships. The ship was laid down at the Arsenal de Lorient on 25 March 1895 and launched on 2 September 1896. She was commissioned on 1 September 1900 after completing her sea trials at the cost of 26,981,000 francs. Even before Saint Louis was formally commissioned, she participated in a naval review conducted by the President of France, Émile Loubet, at Cherbourg in July 1900.\nThe ship was assigned to the Mediterranean Squadron and arrived in Toulon on 24 September. Saint Louis became the squadron flagship on 1 October and retained that duty until 24 February 1904. She transported Louis André, the Minister of War and Jean de Lanessan, the Minister of Marine on their tours of Corsica and Tunisia later in October. The following year, Saint Louis and the Mediterranean Squadron participated in an international naval review by President Loubet in Toulon with ships from Spain, Italy and Russia.\nOn 25 June 1903, the ship received King Alfonso XIII of Spain aboard while visiting Cartagena. In April 1904, she was one of the ships that escorted President Loubet during his state visit to Italy. Saint Louis visited Morocco in December 1906 and did not return to Toulon until the following month. She became the flagship of the Second Battleship Division on 18 March and then became the flagship of the 4th Division on 17 April 1908. The ship was briefly transferred to the Northern Squadron (escadre du Nord), where she became its flagship, in October 1910, and she participated in a large naval review by President Armand Fallières off Cap Brun on 4 September 1911. Two days later, Saint Louis was struck by the destroyer  during manoeuvers off Hyères. She was relieved as the Northern Squadron flagship on 11 November and began repairs, combined with a refit, at Cherbourg. This was completed in April 1912 and the ship resumed her role as the squadron flagship on 15 April.\nLess than two months later, she accidentally rammed and sank the submarine  on 8 June in the English Channel off the Casquets, killing all 24 of the submarine's crew. Saint Louis was transferred to the Mediterranean Squadron a few months later and arrived in Toulon on 9 November. She became the flagship of the Second Division of the Third Squadron on 18 March 1913 and then was transferred to the Supplementary Division (division de Complement) and became its flagship on 10 February 1914.\nWorld War I\nTogether with the older French pre-dreadnoughts, the ship's first mission in the war was to escort troop convoys from North Africa to France. On 23 September, Saint Louis was ordered to Port Said to escort a British convoy carrying troops from India. She remained on escort duties until November when she was ordered to the Dardanelles to guard against a sortie by the German battlecruiser Goeben. The ship remained on station there until January 1915 when she was given a brief refit at Bizerte. Upon its completion, Saint Louis was ordered to the Eastern Mediterranean where she became the flagship of the newly formed Syrian Squadron (escadre de Syrie) on 9 February. These ships were intended to attack Turkish positions and lines of communication in Syria, Lebanon, Palestine and the Sinai Peninsula. Saint Louis participated in the bombardment of Gaza and El Arish in April before she was transferred back to the Dardanelles in May.\nBy this time, however, naval operations were limited to bombarding Turkish positions in support of Allied troops. The ship became the flagship of the Dardanelles Squadron (escadre des Dardanelles) on 26 August until she was relieved for a major refit at Lorient in October. When the refit was completed in May 1916, Saint Louis was ordered to Salonica where she joined the French squadron assigned to prevent any interference by the Greeks with Allied operations in Greece where she arrived on 22 May. She became flagship of the Eastern Naval Division (''division navale d'Orient) on 26 October until she was transferred to Bizerte in February 1917. The ship was placed in reserve in April and remained there until January 1919 when she was transferred to Toulon.\nSaint Louis was disarmed and decommissioned on 8 February and became a training ship for stokers and engineers in Toulon. The ship was condemned on 20 June 1920, although she was converted into an accommodation hulk. Saint Louis'' listed for disposal on 29 June 1931, but was not purchased, for 600,230 francs, until 24 May 1933.\nReferences\nBibliography\n*\n*\n*\n*\n*\n*\nExternal links\n*  [http://le.fantasque.free.fr/php3/ship.php3?page_code=charlemagne CUIRASSE Charlemagne]"
    }
  ]
}