{
  "content": [
    {
      "type": "text",
      "text": "# Frescobaldi (software)\n\n}}\n| latest preview version =\n| latest preview date    =\n| programming language   = Python\n| operating system       = Microsoft Windows, Linux, macOS\n| platform               =\n| size                   =\n| language               =\n| genre                  = Scorewriter, integrated development environment\n| license                = GPL-2.0-or-later\n| website                =\n}}\nFrescobaldi is an editor for LilyPond music files. Frescobaldi is free software, freely available under the GNU General Public License. It is designed to run on all major operating systems (Linux, macOS and Microsoft Windows). It is named after Girolamo Frescobaldi, an Italian composer of keyboard music in the late Renaissance and early Baroque period.\nFrescobaldi is written in Python and uses PyQt for its user interface. Its main developer is Wilbert Berendsen.\nHistory\nFrescobaldi has its roots in LilyKDE, a plugin for KDE's Kate text editor developed by Berendsen, originally released in 2007. It later evolved into a standalone application and was renamed into Frescobaldi in 2008.\nIn 2011, Frescobaldi was rewritten from scratch, leading to Frescobaldi 2.0. The release removed the use of KDE libraries in favor of the base PyQt library only. As a result, Frescobaldi became cross-platform.\nIn 2015, the ly module from the Frescobaldi code base was split into its own project, [https://github.com/frescobaldi/python-ly python-ly], which has since been used independently by other Python projects.\nReleased in 2017, Frescobaldi 3.0 was a port of Frescobaldi 2 to Python 3 and Qt 5.\nIn LilyPond 2.24 (released in February 2023), the \"LilyPad\" editor that was previously shipped officially with LilyPond was discontinued. Instead, the official installation tutorial for LilyPond 2.24 and later guides beginners towards Frescobaldi, reflecting Frescobaldi's de facto status as the most popular LilyPond editor.\nFeatures\n* Text editor with syntax highlighting and automatic completion\n* Music view\n* MIDI player to proof-listen LilyPond-generated MIDI files\n* Wizard to quickly set up a new score\n* Snippet Manager to store and apply text snippets, templates or scripts\n* Use multiple versions of LilyPond, automatically selects the correct version\n* Built-in LilyPond documentation browser and built-in help\n* Configurable colors, fonts and keyboard shortcuts\n* Translated into the following languages: Czech, Dutch, English, French, Galician, German, Italian, Polish, Russian, Spanish and Turkish\nMusic functions\n* Transpose music\n* Change music from relative pitches to absolute and vice versa\n* Change the language used for note names\n* Change the rhythm (double, halve, add/remove dots, copy, paste) etc.\n* Hyphenate lyrics using word-processor hyphenation dictionaries\n* Add spanners, dynamics, articulations\n* Update LilyPond syntax using convert-ly, with display of differences\nSee also\n* List of music software\n* LilyPond\nReferences\nExternal links\n*\n* https://github.com/frescobaldi/frescobaldi"
    }
  ]
}