{
  "content": [
    {
      "type": "text",
      "text": "# Fritzi – A Revolutionary Tale\n\nMatthias Bruhn\n| producer       =\n*\n*\n}}\n| screenplay     = Beate VölckerPéter Palátsik\n| starring       =\n| narrator       =\n| music          =\n| cinematography =\n| editing        = Stefan Urlaß\n| production_companies = Balance Film GmbHTrickstudio Lutterbeck GmbHDoghouse FilmsArtémis ProductionsMaur Film\n| distributor    = Weltkino Filmverleih (Germany)Tarantula Distribution (Luxembourg)Pilot Film (Czech Republic)\n| released       =\n| runtime        = 86 minutes\n| country        = GermanyLuxembourgBelgiumCzech Republic\n| language       = German\n| budget         =\n| gross          = $375,689\n}}\nFritzi: A Revolutionary Tale () is a 2019 German-language animated film directed by  and Matthias Bruhn about the Peaceful Revolution in Autumn 1989, told from the perspective of a twelve-year-old girl. A co-production between Germany, Luxembourg, Belgium  the Czech Republic and Austria. the film is based on the 2009 German children's book Fritzi was There by Hanna Schott.\nPremise\n1989 in Leipzig, East Germany. Twelve-year-old Fritzi lovingly takes care of her best friend Sophie's dog Sputnik while Sophie's family is on vacation in Hungary. But when Sophie does not return, Fritzi and Sputnik set out in search of her. The film tells the story of the protests of the citizens against the Communist SED regime of Erich Honecker and Egon Krenz until the fall of the Berlin Wall on November 9, 1989.\nVoice cast\n*Naomi Hadad as Fritzi\n*Ben Hadad as Bela\n*Jördis Triebel as Julia\n* as Frau Liesegang\n*Winfried Glatzeder as police officer\n* as Klaus\n*Amelie Sophie von Redecke as Sophie\n*Jan Treviño Kräling as Hanno\nAwards\n*2019: Preis der deutschen Filmkritik – Best children's film, awarded by the German Film Critics Association\n*2020: Mitteldeutscher Rundfunk – Best screenplay at the 28th Goldener Spatz children's media festival in Erfurt\n*2020: \"Rauchfrei-Siegel\" by the German Cancer Aid and the Non-Smoking Action Alliance as the film \"...deliberately dispenses with smoking characters and thus serves as a role model, especially for young people.\"\nReferences\nExternal links\n*\n*[https://www.weltkino.de/filme/fritzi-eine-wendewundergeschichte Fritzi – A Revolutionary Tale] at Weltkino Films (in German)"
    }
  ]
}