{
  "content": [
    {
      "type": "text",
      "text": "# Friulian-speaking municipalities\n\n}}\nFriuli-Venezia Giulia Autonomous Region\nIn Friuli-Venezia Giulia Autonomous Region, the territory in the scope of the protection and promotion of the Friulian language was determined pursuant to article 5 of the Regional Law no. 15 of 22 March (Provisions on the protection and the promotion of the Friulian language and culture) and the Decrees of the President of the Regional Council no. 0412/Pres. of 13.11.1996 and no. 0160/Pres. of 20.05.1999. The provisions of the Regional Law no. 29 of 18 December 2007 (Provisions on the protection, value-enhancement and promotion of the Friulian language) also apply to the same territory, pursuant to article 3 of such Law.\nAs for Law no. 482/99 (Provisions on the protection of historical linguistic minorities), the applicable territory was defined in the Resolution no. 2680, dated 3 August 2001, of the Friuli-Venezia Giulia Regional Council, issued in compliance with article 1, paragraph 5, of the Presidential Decree no. 345 of 2 May 2001 (Implementing Regulation of Law no. 482 of 15 December 1999), specifying that: “The actual existence of a minority shall be assumed when the municipality, or part of it, is included in the territory defined in a national or regional law before the date of the entry into force of the law and exclusively for the protected languages, as detailed in article 2”. The territory in the scope of this Resolution was determined pursuant to the Presidential Decrees of 1996 and 1999.\nIt must be noted that the provinces of Udine and Gorizia officially issued Council Resolutions no. 91 of 15.12.2000 and no. 3 of 07.02.2001 respectively on the protection of the Friulian language. However, these provisions were superseded by the Resolution no. 2680 of 3 August 2001 of the Friuli-Venezia Giulia Regional Council.\nAdditionally, three provincial resolutions are relevant for the implementation of Law no. 482/99 only: Resolutions no. 6 and 28  of the Provincial Council of Gorizia, dated 12.03.2003 and 21.11.2003, including the municipalities of Monfalcone and Sagrado, respectively; and Resolution no. 86 of the Provincial Council of Udine on the municipality of Malborghetto-Valbruna.\nScope of the protection of the Friulian language in Friuli-Venezia Giulia\nFormer Province of Gorizia;\nCapriva del Friuli, Cormons, Dolegna del Collio, Farra d’Isonzo, Gorizia, Gradisca d’Isonzo, Mariano del Friuli, Medea, Monfalcone*, Moraro, Mossa, Romans d’Isonzo, Sagrado*, San Lorenzo Isontino, Villesse.\nFormer Province of Pordenone;\nAndreis, Arba, Aviano, Barcis, Budoia, Casarsa della Delizia, Castelnovo del Friuli, Cavasso Nuovo, Claut, Clauzetto, Cordenons, Cordovado, Fanna, Fontanafredda, Frisanco, Maniago, Meduno, Montereale Valcellina, Morsano al Tagliamento, Pinzano al Tagliamento, Polcenigo, Pordenone, San Giorgio della Richinvelda, San Martino al Tagliamento, San Quirino, San Vito al Tagliamento, Sequals, Sesto al Reghena, Spilimbergo, Tramonti di Sopra, Tramonti di Sotto, Travesio, Valvasone Arzene, Vito d’Asio, Vivaro, Zoppola.\nFormer Province of Udine;\nAiello del Friuli, Amaro, Ampezzo, Aquileia, Arta Terme, Artegna, Attimis, Bagnaria Arsa, Basiliano, Bertiolo, Bicinicco, Bordano, Buja, Buttrio, Camino al Tagliamento, Campoformido, Campolongo Tapogliano, Carlino, Cassacco, Castions di Strada, Cavazzo Carnico, Cercivento, Cervignano del Friuli, Chiopris-Viscone, Chiusaforte, Cividale del Friuli, Codroipo, Colloredo di Monte Albano, Comeglians, Corno di Rosazzo, Coseano, Dignano, Dogna, Enemonzo, Faedis, Fagagna, Fiumicello Villa Vicentina, Flaibano, Forgaria nel Friuli, Forni Avoltri, Forni di Sopra, Forni di Sotto, Gemona del Friuli, Gonars, Latisana, Lauco, Lestizza, Lignano Sabbiadoro, Magnano in Riviera, Majano, Malborghetto-Valbruna*, Manzano, Martignacco, Mereto di Tomba, Moggio Udinese, Moimacco, Montenars, Mortegliano, Moruzzo, Muzzana del Turgnano, Nimis, Osoppo, Ovaro, Pagnacco, Palazzolo dello Stella, Palmanova, Paluzza, Pasian di Prato, Paularo, Pavia di Udine, Pocenia, Pontebba, Porpetto, Povoletto, Pozzuolo del Friuli, Pradamano, Prato Carnico, Precenicco, Premariacco, Preone, Prepotto, Ragogna, Ravascletto, Raveo, Reana del Rojale, Remanzacco, Resiutta, Rigolato, Rive d’Arcano, Rivignano Teor, Ronchis, Ruda, San Daniele del Friuli, San Giorgio di Nogaro, San Giovanni al Natisone, Santa Maria la Longa, San Vito al Torre, San Vito di Fagagna, Sauris, Sedegliano, Socchieve, Sutrio, Talmassons, Tarcento, Tarvisio, Tavagnacco, Terzo d’Aquileia, Tolmezzo, Torreano, Torviscosa, Trasaghis, Treppo Grande, Treppo Ligosullo, Tricesimo, Trivignano Udinese, Udine, Varmo, Venzone, Verzegnis, Villa Santina, Visco, Zuglio.\n*Included in the scope of the protection of Law no. 482/99 only\nMunicipalities included in the territorial scope of the protection of the Friulian language in Friuli-Venezia Giulia\n{| class=\"wikitable\"\n|PROVINCE\n|TOTAL NO. OF  MUNICIPALITIES\n|NUMBER OF  FRIULIAN-SPEAKING MUNICIPALITIES\n|PERCENTAGE\n|-\n|Gorizia\n|25\n|15\n|60%\n|-\n|Pordenone\n|50\n|36\n|72%\n|-\n|Udine\n|134\n|122\n|91.04%\n|-\n|Trieste\n|6\n|\n|\n|-\n|FVG Region\n|215\n|173\n|80.47%\n|}\nVeneto Region\nThe protection of the Friulian-speaking minority in Eastern Veneto is based on the Regional Law no. 73 of 23 December 1994, which, in article 3, paragraph 1, point d), expressly includes “Friulian cultural associations based in the Portogruaro area” among the beneficiaries of grants.\nAs a result of the adoption of Law no. 482/99, Venice Provincial Council officially recognized the Friulian-speaking minority located in its territory, in the municipalities of San Michele al Tagliamento (resolution no. 2006/00032 of 20.04.2006), Teglio Veneto (resolution no. 2006/120 of 21.12.2006) and Cinto Caomaggiore (resolution no. 2006/121 of 21.12.2006). This recognition was the result of the resolutions of the three above municipalities which asked the Provincial Council to include their municipal territories into the scope of the provisions on the protection of historical linguistic minorities pursuant to Law no. 482/99.\nHowever, these resolutions also established that the Friulian-speaking minority is located in the whole territory of the municipalities of the Portogruaro area, i.e. the municipalities of Cinto Caomaggiore, Concordia Sagittaria, Fossalta di Portogruaro, Gruaro, Portogruaro, S. Michele al Tagliamento, Teglio Veneto.\nTherefore, as the territory where the provisions on the protection of historical Friulian linguistic minorities apply, pursuant to Law no. 482/1999, includes the above three municipalities, the resolutions of the Venice Provincial Council, also pursuant to the Regional Law no. 73/1994, have recognized that traditionally the Friulian language is also significantly spoken in another four municipalities of the Portogruaro area.\nScope of the protection of the Friulian language in Veneto\nCinto Caomaggiore**, Concordia Sagittaria, Fossalta di Portogruaro, Gruaro, Portogruaro, S. Michele al Tagliamento**, Teglio Veneto**\n**Also included in the scope of the protection of Law no. 482/99\nMunicipalities included in the territorial scope of the protection of the Friulian language in Veneto\n{| class=\"wikitable\"\n|\n|TOTAL NO. OF MUNICIPALITIES\n|NUMBER OF FRIULIAN-SPEAKING MUNICIPALITIES\n|PERCENTAGE\n|-\n|Veneto Region\n|563\n|7\n|1.24%\n|}\nReferences"
    }
  ]
}