{
  "content": [
    {
      "type": "text",
      "text": "# Fucking Young / Perfect\n\n| recorded      =\n| studio        =\n| genre         =\nNeo-soul\n| length        =\n| label         = Odd Future\n| writer        =\n| producer      = Tyler, the Creator\n| chronology    = Tyler, the Creator\n| prev_title    = Whoa\n| prev_year     = 2013\n| title         = Fucking Young / Perfect\n| title2        = Deathcamp\n| next_title    = Go (Gas)\n| next_year     = 2016\n| misc          =\n}}\n\"Fucking Young / Perfect\" is a song written and produced by the American rapper and producer Tyler, the Creator, from his fourth studio album, Cherry Bomb (2015). It features the American singers Charlie Wilson, Chaz Bundick, Syd Bennett, and Kali Uchis, Uchis writing the song with Tyler. The song was released alongside \"Deathcamp\" as the album's lead single on April 9, 2015.\nBackground and release\nOn April 9, 2015, Tyler, the Creator announced his fourth studio album, Cherry Bomb, and in promotion of the album, released two singles from the album, which were \"Deathcamp\" and \"Fucking Young / Perfect\". Both songs were made available on the iTunes Store on the same day.\nIn an interview with Billboard on April 23, 2015, Tyler revealed how the song was first written and its inspiration, telling Billboard;\"I wanted to make a song like Stevie Wonder’s Innervisions album. You listen to shit in the ‘70s, they got to the point. Although it sounds soft, “Fucking Young” is perverted and weird, but it’s true. There was this girl that I liked, and we both had feelings for each other, but there was a five-year difference between us. It weirded me out, so I wrote a song about it.\"\nComposition and lyrics\nThe song's second half, \"Perfect\" features Kali Uchis, while its music video version includes vocals from Austin Feinstein.\nLyrically, the song is about Tyler's feelings for a girl who is too young for him. James Rettig of Stereogum further reinforced this claim, describing the track as a narrative where Tyler sings about a girl who is too young for him. In a review for Cherry Bomb, Ryan Bassil of Vice wrote that the song could be a letter addressed to his younger self, stating that the \"girl he's talking about [could be a] composite of Tyler’s fictional characters\", referring to fictional characters seen throughout Tyler's three projects preceding Cherry Bomb.\nMusic videos\nThe music video for the song's first part, \"Fucking Young\", was released on the same day as the song's release, on April 9, 2015, and also serves as the music video for \"Deathcamp\". The video was self-directed by Tyler, and features Wilson and Bundick, along with Cole Alexander, who was featured on \"Deathcamp\".\nBillboard described the music video for \"Fucking Young\" as a \"quirky/twisted love story\". The video is framed as a movie that Tyler watches in a theatre. In the movie, Tyler meets an underaged girl while performing a skateboard stunt. The girl wishes to be closer to Tyler, invading his daily life but Tyler seems opposed to this and tries to push her away. It culminates in the girl retaliating by throwing a lit match onto Tyler's lawn, setting it and his house on fire while Tyler yells at her from a window. Back in the theatre, Tyler is suddenly picked up and thrown out by the employees, transitioning into the video for \"Deathcamp\".\nThe music video for the song's second part, \"Perfect\", was released on February 8, 2016. The video was also self-directed by Tyler, under his directing alias, \"Wolf Haley\", and features Uchis and Austin Feinstein.\nCommercial performance\n\"Fucking Young / Perfect\" received a Gold certification from the Recording Industry Association of America for selling more than 500,000 units in the United States.\nCertifications\nReferences"
    }
  ]
}