{
  "content": [
    {
      "type": "text",
      "text": "# Fujiwara no Tametoki__disambig_1\n\n(died 1029?) was a Japanese aristocrat, author of Japanese waka and Chinese poetry of some repute, and the father of Murasaki Shikibu (Lady Murasaki\", author of The Tale of Genji, born ca. 970 or 973).  Tametoki's position at the Shikibu-shō ministry was what probably became part of his daughter's historical appellation, \"Murasaki Shikibu\".\nLife\nTametoki was well-read and an accomplished poet. Three of his waka poems were selected to the Goshūi Wakashū (1086) and one to the Shin Kokin Wakashū Also thirteen of his Chinese verses are in the anthology  of 1010.\nTametoki served as tutor to the Crown Prince Morosada, and when the prince ascended the throne as Emperor Kazan, he was elevated to . Tametoki also simultaneously held the office of  more specifically . Tametoki's position as kurōdo gained him special privileges to attend court (and thus meet with Emperor Kazan).\nWith the resignation of Emperor Kazan in 986, Tametoki was relieved of all his posts, and devoted his time to educating his son .\nTametoki went without position for 10 years, in marked contrast to the man who would become Lady Murasaki's husband, who was at one time Tametoki's predecessor on the same job (secretary of Shikibe-jō and chamberlain) yet continued to gain lucrative governorships.\nTametoki finally wrote a poem to Emperor Ichijō that so moved the monarch it garnered him governorship of Echizen Province. Lady Murasaki accompanied Tametoki there, though she did not stay for the full four year tenure and returned after 1 or 2 years. Kojidan includes an episode that the governorship of Echizen had already gone to  who had to be recalled in order to give way to Tametoki wrested the position away. This so distressed Kunimori he fell ill, and even though he was awarded Harima as replacement, he never recovered and died.\nTametoki was promoted to the rank of \"Senior fifth rank, lower grade\" (正五位下), and  in 1009. Subsequently he was commissioned as governor of Echigo Province in 1011, but his son Nobunori died in Echigo that same year,\nand her returned to the capital in 1014 before the full term. He became a monk at Mii-dera temple (located in what is now Ōtsu, Shiga) two years later.\nScholars do not agree about the years of Tametoki's birth or death, although some give his death year as 1029.\nNotes\nCitations\nReferences\n*\n*; 607pp\n*;\n*;"
    }
  ]
}