{
  "content": [
    {
      "type": "text",
      "text": "# Fujiwara no Takatori\n\nFujiwara no Takatori (藤原 鷹取) was a Japanese nobleman and politician of the Nara period. He served as First Assistant to the Minister of the Center, Mayor of the Left Capital District, Head of Office of Imperial Wives, governor of Ise Province, governor of Kōzuke Province and governor of Echizen Province. He held the court rank of Senior Fourth Rank.\nLife\nTakatori was born the son of Minister of the Left Fujiwara no Uona. His mother was the daughter of Associate Counselor Fujiwara no Umakai. He was a member of the Hokke house of the Fujiwara clan.\nIn 771, Takatori was appointed supernumerary Vice-Governor (ingai-suke) of Ise Province and given the court rank of Junior Fifth Rank, Lower Grade. The next year he rose to Vice-Governor, and in 774, he rose to full governor (kami) of Ise Province and was given Junior Fifth Rank, Upper Grade. In 776, he moved to serve as junior assistant minister at the Ministry of Imperial Palace Construction (zōgūshō) and was promoted to Senior Assistant Minister soon after. He then went on to serve as first assistant to the minister of the center, and in 779 he simultaneously served as governor of Kōzuke Province. In 782, Takatori served as head of office of imperial wives (chūgū no daibu), Chamberlain (jijū) and governor of Echizen Province.\nAfter his father Uona's fall from power due to the Hikami no Kawatsugu incident in 782, all of Uona's sons were demoted. Because Takatori does not appear in the records of demotion, it is possible that he had already died at that point. However, there are records saying that he had been demoted to Vice-Governor of Iwami Province but returned to the capital city of Nara the next year, and that he died in office as mayor of the Left Capital District, Senior Fourth Rank in 784.\nFamily\n* Father: Fujiwara no Uona\n* Mother: daughter of Fujiwara no Umakai\n* Wife: Fujiwara no Hitokazu (daughter of Fujiwara no Yoshitsugu)\n** Second son: Fujiwara no Fujitsugu (773-817)\n* Unknown mother:\n** Son: Fujiwara no Masao\n** Daughter: Fujiwara no Okuso, consort of Emperor Kanmu\nSee also\n* Hokke (Fujiwara)\n* Fujiwara no Fuhito\nReferences"
    }
  ]
}