{
  "content": [
    {
      "type": "text",
      "text": "# Fujiwara no Nobuyori__disambig_1\n\nwas the instigator and chief ally of Minamoto no Yoshitomo in the Heiji Rebellion of 1159. As a member of the Fujiwara clan, Nobuyori might have been in line to become regent, and he desired power, which he obtained for a short while following the Rebellion.\nIn the late 1150s, tensions rose in court between Fujiwara no Michinori (Shinzei) and his political opponents, centering around a number of issues, including executions of supporters of Sutoku from the Minamoto clan, Shinzei's attempts to restore the authority of the crown, the relative favour given to Taira no Kiyomori and Minamoto no Yoshitomo, and the powers of the retired (cloistered) Emperor Go-Shirakawa relative to his son Emperor Nijō. According to some sources, Fujiwara no Nobuyori had homosexual relations with Emperor Go-Shirakawa, which resulted in his high government post. Shinzei and his sons, however, had strong influence, especially with the Emperor, and opposed Nobuyori gaining still higher rank.\nWhen Taira no Kiyomori, head of his clan, left Kyoto for a time in 1159, it seemed the perfect opportunity for Nobuyori and the Minamoto to make a move; though some say Kiyomori left the city intentionally, luring his enemies into a trap. Nobuyori and the Minamoto attacked the Sanjō Palace, abducting the former Emperor Go-Shirakawa, killing much of his staff, and setting the building aflame. They brought him to the Great Palace, where Emperor Nijō was being held hostage as well. They then moved on to the home of chief-councillor Fujiwara no Michinori, killing everyone there; Michinori escaped, only to be captured and decapitated soon afterwards. Nobuyori then had Nijō appoint him Chancellor, under duress. Though he still had enemies at Court who encouraged the emperor to resist and to escape, overall Nobuyori's plan had succeeded.\nThis did not last for long, however, since Taira no Kiyomori returned, and the Minamoto were not sufficiently prepared to defend the city against him. The emperor and ex-emperor both were freed, the Minamoto defeated, and Nobuyori killed in February 1160.\nNear the end of the rebellion, Fujiwara no Nobuyuri was beheaded.\nReferences\nFurther reading\n*Sansom, George (1958). A History of Japan to 1334. Stanford, California: Stanford University Press.\n*Chalitpatanangune, Marisa (1987) Heiji Monogatari: A Study and Annotated Translation of the Oldest Text. University of California."
    }
  ]
}