{
  "content": [
    {
      "type": "text",
      "text": "# Fujiwara no Sadanobu\n\nFujiwara no Sadanobu (藤原定信, 1088–1156) was a Heian period calligrapher. He is known primarily for his hiragana poetry transcriptions.\nHe came from the Sesson-ji lineage of calligraphers as the son of Fujiwara no Sadazane and fifth-generation descendant of its founder, Fujiwara no Yukinari. He is said to have been a very fast and graceful writer, and that he copied the entire Issaikyo, the body of all Buddhist literature, in 23 years.\nIshiyama-gire\nFujiwara no Sadanobu's most famous surviving works come from his calligraphy of a segment of the poem anthology Tsurayuki-shū composed by Ki no Tsurayuki known as the Ishiyama-gire composed in the 12th century. In his work, he used a versatile and attractive style while mainting speed and power. The Tsurayuki-shū itself is part of a larger series of poems called the Anthology of Thirty-Six Poets(Nishi Honganji Sanjurokunin-shu), a compilation of poetry from the Thirty-Six Immortals of Poetry given to a Hongan-ji temple by Emperor Go-Nara in Tenmon 18. \"Ishiyama\" refers to the locality in Osaka where the temple once stood. His calligraphy is surprisingly modern for 12th-century Japan, decorating his paper with natural motifs like pampas grass, butterflies, and maple leaves. He often divided his paper into several planes of color joined at the edges. These edges were ragged or straight, to heighten visual interest. Sadanobu was a master of color and composition as well as calligraphy.\nPoem anthologies were given as gifts in the Heian period, so great effort was taken to be aesthetically refined. The natural iconography also included other insects and plants, embellished in silver. In addition to natural imagery, he also used Chinese motifs, and sometimes printed them in mica using woodblocks.\nThe Ishiyama-gire is composed of waka short poems, that sometimes deal with death and departure. The two poems mourning a lost friend illustrated here read:\nA beloved friend whom I met until yesterday is gone today,\nswept away like mountain clouds.\nHow tragic that although we live,\nwhatever we have will surely die.\nReferences"
    }
  ]
}