{
  "content": [
    {
      "type": "text",
      "text": "# Fujiwara no Morosuke__disambig_1\n\n, also known as Kujō-dono or Bōjō-udaijin, was a Japanese statesman, courtier and politician during the middle Heian period. Considered a learned scholar and well-versed in the customs of the court, he supported the court's government as udaijin during the reign of Emperor Murakami. Morosuke's eldest daughter Fujiwara no Anshi, empress consort to Emperor Murakami, gave birth to two princes who later became Emperor Reizei and Emperor En'yū, putting Morosuke's lineage in an advantageous position as the maternal relatives of the Emperor.\nLife\nMorosuke was born the second son of Fujiwara no Tadahira, who controlled the government for many years as sekkan (regent) and daijō-daijin. Around 930 he had an affair with a daughter of Emperor Daigo, Princess Kinshi, and was later permitted to marry her. This was the first time a non-imperial Japanese retainer married an imperial princess — in previous cases where retainers married the daughters of emperors, those daughters had first been divested of their imperial status. From 931 to 947 he was steadily promoted, passing through the position of sangi and attaining the post of provisional chūnagon.\nWhen Taira no Masakado launched his rebellion,  was appointed as , but the rebellion was put down before he could join battle. The court debated Tadabumi's honors, and Morosuke's older brother Saneyori argued that as Tadabumi had not done anything, he should not be granted any prize. Morosuke argued that as Tadabumi had accepted his orders and set out from the capital, he should still be rewarded. Saneyori stuck to his position, but public opinion favored Morosuke.\nAfter this Morosuke was promoted to dainagon, made a , and bestowed the .\nIn 947, Emperor Suzaku abdicated, and Emperor Murakami ascended to the throne. As Saneyori was promoted to sadaijin, Morosuke filled his old position as udaijin and was granted the . Promotion naturally favored the eldest son and family heir, but Morosuke was considered excellent enough to cause problems for his older brother despite this: Morosuke held more real power than even Saneyori. Morosuke had married his eldest daughter Anshi to Murakami while he was still the crown prince. With his enthronement she became a court lady and assisted the emperor often. When they had a child, the future Emperor Reizei, Anshi was made chūgū. As the maternal grandfather of the crown prince, Morosuke and his cohorts were able to lead the court by Murakami's side for about ten years.\nAfter the death of his wife Princess Kinshi, Morosuke married Princess Gashi, and when she died Princess Yasuko, all of whom were daughters of Emperor Daigo, thus further deepening his ties with the imperial line. Because he had affairs with and then married three different imperial princesses, Morosuke may have been the model for a character in the Utsubo Monogatari, the ultimate lecher, Fujiwara no Kanemasa.\nIn 960 Morosuke was laid out by illness, and according to the customs of the day attempted to cut his hair and take the tonsure, but Emperor Murakami sent a messenger to dissuade him. Even so, his sickness worsened, and on May 29 he cut off his hair, only to die two days later on May 31, 960, at the age of 53.\nMorosuke never held the position of sekkan in his life, but the successive reigns of his grandchildren Emperor Reizei and Emperor En'yū after Murakami's death put his family in an outstanding position as the emperor's maternal relatives. His eldest son Koretada briefly held power as sekkan, and his other sons Kanemichi, Kaneie, Tamemitsu, and Kinsue also all attained the position of daijō-daijin. In Morosuke's children's generation, his descendants were the legitimate line of the Fujiwara regent family.\nPersonality and works\nMorosuke and his older brother Saneyori, both educated by Fujiwara no Tadahira, each formed their own school of the practices and traditions of the court. Morosuke formed the , and Saneyori the , which were passed down to their respective descendants. Morosuke recorded the practices of his school in a book called the . He was friends with , who was also versed in the ways of the court, and to whom he married his third and fifth daughters. The talented Takaakira flourished with Morosuke's support.\nMorosuke was also an excellent poet, leaving behind a collection of his works simply called . In 956 he held a party in his garden, and the Ōkagami contains an anecdote about his visit to Ki no Tsurayuki to request that the latter write a poem for him. Thirty-six of Morosuke's poems are included in the Gosen Wakashū.\nHis personal diary  and the dying instructions he left for his descendants, , are also preserved.\nGenealogy\n*Father: Fujiwara no Tadahira\n*Mother: , daughter of Minamoto Yoshiari\n*Wife: , daughter of\n**First son: Fujiwara no Koretada (924-972)\n**Second son: Fujiwara no Kanemichi (925-977)\n**Third son: Fujiwara no Kaneie (929-990)\n**Fifth son: , adopted by Fujiwara no Tadahira\n**First daughter: Fujiwara no Anshi (927–964), wife of Emperor Murakami, mother of Emperor Reizei and Emperor En'yū\n**Second daughter: , wife of , concubine of Emperor Murakami, naishi-no-kami\n**Third daughter: wife of\n**Sixth daughter: , court lady of Emperor Reizei, naishi-no-kami\n*Wife: daughter of\n**Fourth son:\n**Seventh son:\n*Wife: daughter of\n**Sixth son:\n*Wife: , daughter of Emperor Daigo\n*Wife: , daughter of Emperor Daigo, Saiō of Ise Shrine\n**Eighth son: Fujiwara no Takamitsu (939-994)\n**Ninth son:\n**Tenth son: , Tendai school Buddhist monk\n**Fifth daughter: , wife of Minamoto no Takaakira\n*Wife: , daughter of Emperor Daigo\n**Eleventh son: , head managing monk of Tōdai-ji\n**Twelfth son: Fujiwara no Kinsue (956-1029)\n*Other children:\n**Daughter: , wetnurse to Emperor Ichijō, mistress of Fujiwara no Michikane, wife of\n**Daughter: wife of\nMorosuke managed to marry his daughters to Emperor Murakami; the sons of his daughter Empress Anshi/Yasuko became Emperor Reizei and Emperor En'yū. The reigns of Reizei and En'yū are remarkable for quarrels among the members of the Fujiwara family. Koretada's daughter gave birth to Prince Morosada, who afterwards reigned as Emperor Kazan Kaneie's daughter was the mother of Okisada, who became Emperor Sanjo\nNotes\nReferences\n* Brinkley, Frank and Dairoku Kikuchi. (1915). A History of the Japanese People from the Earliest Times to the End of the Meiji Era. New York: Encyclopædia Britannica. [https://www.worldcat.org/oclc/413099 OCLC 413099]\n* Nussbaum, Louis-Frédéric and Käthe Roth. (2005). [https://books.google.com/books?id=p2QnPijAEmEC  Japan encyclopedia.] Cambridge: Harvard University Press. ; [http://www.worldcat.org/oclc/58053128?referer=di&ht=edition  OCLC 58053128]\n* Titsingh, Isaac. (1834). Nihon Odai Ichiran; ou, [https://books.google.com/books?id=18oNAAAAIAAJ&q=nipon+o+dai+itsi+ran  Annales des empereurs du Japon.]  Paris: Royal Asiatic Society, Oriental Translation Fund of Great Britain and Ireland. [https://www.worldcat.org/oclc/5850691 OCLC 5850691]"
    }
  ]
}