{
  "content": [
    {
      "type": "text",
      "text": "# Fulham, Queensland\n\n| pop                 = 53\n| pop_year            =\n| pop_footnotes       =\n| established         =\n| postcode            = 4313\n| area                = 48.1\n| timezone            = AEST\n| utc                 = +10:00\n| dist1               = 13.1\n| dir1                = NE\n| location1           = Toogoolawah\n| dist2               = 26.7\n| dir2                = N\n| location2           = Esk\n| dist3               = 90.8\n| dir3                = N\n| location3           = Ipswich\n| dist4               = 107\n| dir4                = NW\n| location4           = Brisbane\n| lga                 = Somerset Region\n| stategov            = Nanango\n| fedgov              = Blair\n| near-n              = Gregors Creek\n| near-ne             = Hazeldean\n| near-e              = Hazeldean\n| near-se             = Cooeeimbardi\n| near-s              = Lower Cressbrook\n| near-sw             = Cressbrook\n| near-w              = Scrub Creek\n| near-nw             = Scrub Creek\n}}\nFulham is a rural locality in the Somerset Region, Queensland, Australia. In the , Fulham had a population of 53 people.\nGeography\nThe Deer Reserve State Forest () is in the north of the locality. The state forest is  and extends into the neighbouring localities of Gregors Creek to the north and Hazeldean to the north-east.\nThe Deer Reserve National Park () is in the east of the locality. The national park is  and extends into the neighbouring localities of Hazeldean to the east, Cooeeimbardi to the south-east and Somerset Dam (the locality) further to the south-east.\nHistory\nCressbrook Lower State School opened on 11 April 1916 and closed in 1953. It was at 2 Monks Road (corner Cooeeimbardi Road, ).\nFulham State School opened in 1920 and closed circa 1953. It was located at 372 Cressbrook Caboonbah Road (southern corner with Fulham Road, , now in Cressbrook).\nDemographics\nIn the , Fulham had a population of 35 people.\nIn the , Fulham had a population of 53 people.\nEducation\nThere are no schols in Fulham. The nearest government primary school is Toogoolawah State School in Toogoolawah to the south-west. The nearest government secondary schools are Toogoolawah State High School, also in Toogoolawah, and Kilcoy State High School in Kilcoy to the north-east.\nReferences\nFurther reading\n*  — also includes Mount Beppo State School, Ivorys Creek Provisional School, Cross Roads Provisional School, Ottaba Provisional School, Murrumba State School, Mount Esk Pocket School, Kipper Provisional School, Lower Cressbrook School, Fulham School, Sandy Gully State School, Cooeeimbardi State School, Scrub Creek State School"
    }
  ]
}