{
  "content": [
    {
      "type": "text",
      "text": "# Future Forward Party\n\n| name             = Future Forward Party\n| native_name      = พรรคอนาคตใหม่\n| logo             = Future Forward Party logo.svg\n| logo_size        = 150px\n| foundation       = 15 March 2018\n| banned           = 21 February 2020\n| successor        = Move Forward(de facto)Progressive Movement(de facto)\n| leader           = Thanathorn Juangroongruangkit\n| secretary_general = Piyabutr Saengkanokkul\n| headquarters     = Bangkok, Thailand\n| founders         = Thanathorn JuangroongruangkitPiyabutr Saengkanokkul\n| membership       = 51,283\n| ideology         = }}\n|Social democracy}}\n|Republicanism (alleged)}}\n|Antimilitarism\n}}\n| position         = Centre-left to left-wing}}\n| international    = Progressive Alliance (2018–2020; guest)\n| youth_wing       = New Generation Network (NGN)\n| membership_year  = February 2020\n| abbreviation     = FFP\n| colours          = }} Orange\n| slogan           = ไทย 2 เท่า ('Elevated and Equal Thailand')อนาคตใหม่คืออนาคตที่อำนาจสูงสุดเป็นของประชาชน('The future we aspire to is the future where the ultimate power truly belongs to the people')\n| website          =\n| country          = Thailand\n}}\nThe Future Forward Party (FFP; ,  ; otherwise known as 'New Future Party') was a social democratic and progressive Thai political party from March 2018 to February 2020.\nThe party was founded on 14 March 2018 by Thanathorn Juangroongruangkit, the former vice president of Thai Summit Group, and Piyabutr Saengkanokkul, a legal scholar. The party was founded on a progressive platform that sought to restrain the military's power in Thai politics, decentralize the bureaucracy, and improve social and economic equality. The party was dissolved by the Constitutional Court on 21 February 2020.\nHistory\nIn September 2018, the Future Forward Party was officially recognized by the Election Commission, allowing the party to start registering members and solicit funding. Piyabutr said that Italian Marxist thinker Antonio Gramsci's idea was main key to established Future Forward Party.\nIn the 2019 election, the party won 30 constituency seats in parliament and 50 party-list MPs, including Thanathorn and Piyabutr, a result significantly better than had been expected for a new party. It also later gained an additional seat from a by-election in Chiang Mai, giving it a total of 81 seats.\nFollowing the election, the party faced various legal challenges, which party leader Thanathorn says are politically motivated. Thanathorn was accused of violating election law by the Election Commission, resulting in the Constitutional Court temporarily suspending his MP status until a ruling was reached. Despite this, FFP and six allied anti-junta parties nominated Thanathorn as a candidate for prime minister, but lost to incumbent prime minister and junta leader Prayut Chan-o-cha. Thanathorn was ultimately disqualified by the Constitutional Court. One prominent case against the party, which the Constitutional Court accepted in July 2019, alleged that FFP sought to overthrow the monarchy. As evidence, the resemblance between the party's triangular symbol and that of the Illuminati was cited. The case was dismissed in January 2020.\nOn 16 December 2019, the party's executives and MPs voted to expel four MPs who had consistently voted against the party line, reducing its total to 76 MPs.\nThe party was dissolved in a Constitutional Court ruling on 21 February 2020, which said that the party was in violation of election laws regarding donations to political parties. The party was loaned 191.2 million baht (about US$6 million) from its leader, Thanathorn, which, according to the court, counted as a donation. The dissolution order drew criticism from commentators inside and outside the country, who characterized it as part of the military's continued interference in Thai politics, noting that the party's vocal anti-military position made it a target and that the other parties' finances were not similarly scrutinized.\nPost-dissolution\nPrior to the court ruling that disbanded his party, Thanathorn disclosed in an interview that, in the event of the party's dissolution, \"...we will continue our political journey as a social movement, we'll build a new one outside the parliament. If they dissolve our party, there will be two paths running in parallel—one is a new party in parliament, running under a new name but the same ideology, and the second is a social movement....\" The court decision meant that the 65 remaining Future Forward MPs had to find a new party within 60 days. Ten list seats held by now-banned party executives will also have to be reallocated. It is not clear whether the Election Commission will allow candidates on the FFP party list to replace those ten. Competing parties were expected to woo the displaced Future Forward MPs, but the FFP stated that a new party would be ready to accommodate those who wanted to continue its work. A few days after the dissolution, nine MPs defected from the party to join the Bhumjaithai Party in the government coalition. On 8 March 2020, 55 of the remaining 56 MPs announced their relocation to the Move Forward Party under Pita Limjaroenrat, vowing to continue the work of Future Forward. The remaining member joined the Chartthaipattana Party. The extra-parliamentary successor of the FFP, the Progressive Movement, has been announced by former party leader Thanathorn, with an agenda of pushing for further reforms and amending the constitution.\nThe Election Commission is likely to hear criminal charges against the FFP's leadership, which could result in three to five years imprisonment.\nFounding members\n{|\n|valign=\"top\"|\n*Krittanan Ditbanjong, Activist and undergraduate at Ramkhamhaeng University.\n*Kanpong Thaweesuk, KorPunGun Center for Overseas Education.\n*Kunthida Rungruengkiat, academician specializing in Finland's educational system.\n*Kaikong Witthayakarn, Social Technology Institute.\n*Chris Potranandana, businessman and lawyer.\n*Kathawut Kath Khangpiboon, LGBT rights activist and co-founder of the Thai Transgender Alliance.\n*Chamnan Chanruang, adjunct university lecturer in politics and law and former president of Amnesty Thailand.\n*Chotiros Naksut, writer.\n*Chaiwat Wannakhot, undergraduate, Thammasat University.\n*Thitiya Simcharoun, freelance translator and writer.\n*Taopiphop Limjittrakorn, craft brewer, businessman, and freelance tour guide.\n*Thanathorn Juangroongruangkit, businessman and activist, vice president of auto parts manufacturer Thai Summit Group.\n*Thanyanan Kuanupong, content creator.\n*Thararat Panya, women's rights activist and student, Faculty of Law, Thammasat University.\n|valign=\"top\"|\n*Nalutporn Krairiksh, journalist specializing in disability issues, and founder of , a disability-related news and lifestyle website.\n*Prachya Phetwisit, filmmaker and student.\n*Piyabutr Saengkanokkul, legal scholar specializing in constitutional law, and former member of the jurists' group Nitirat ().\n*Prempipat Plitpholkarnpim, New Ground\n*Farit Damarou, Thai–Muslim Undergraduate Students' Association.\n*Puwakorn Srinian, radio DJ and political activist.\n*Vorakorn Ruetaivanichkul, co-founder, managing director, and filmmaker at Hello Filmmaker.\n*Wipaphan Wongsawang, founder of\n*Sustarum Thammaboosadee, university lecturer and political activist with social democratic agenda.\n*Surin Kamsook, president, Union of Printing and Packaging Industry, representing 1,100 members.\n*Anukul Saiphet, digital agriculturist and social entrepreneur.\n*Alyssa Bindoosa, student, Faculty of Law, Prince of Songkla University, and leader of the youth project 'Law Long Beach'.\n|}\nParty leadership\nFuture Forward's executive committees were elected in a vote during the party's first official meeting in May 2018.\n* Leader: Thanathorn Juangroongruangkit\n** First Deputy Leader: Kunthida Rungruengkiat\n** Second Deputy Leader: Chamnan Chanruang\n** Third Deputy Leader: LTG Pongskorn Rodchompoo\n** Fourth Deputy Leader: Ronnawit Lorlertsoonthorn\n* Secretary General: Piyabutr Saengkanokkul\n* Spokesperson: Pannika Wanich\n* Registrar: Klaikong Vaidhyakarn\n* Treasurer: Nitipat Taemphairojana\n* Executive Committee (Labour Network): Sunthon Bunyod\n* Executive Committee (New Gen Network – NGN): Wipaphan Wongsawang (resigned)\n* Executive Committee (North): Yaowalux Wongpraparat\n* Executive Committee (Central): Surachai Srisaracam\n* Executive Committee (South): Janevit Kraisin\n* Executive Committee (Northeast): Chan Phakdisri\n* Executive Committee: Jaruwan Sarunyagate\n* Executive Committee: Niraman Sulaiman\nElection results\n{| class=\"wikitable\"\n|-\n! Election\n! Total seats won\n! Popular vote\n! Share of votes\n!Outcome of election\n! Election leader\n|-\n!2019\n|}}\n| 6,265,950\n| 17.63%\n| Opposition\n|Thanathorn Juangroongruangkit\n|}\nReferences\nFurther reading\n*\nExternal links\n*[https://www.youtube.com/watch?v=WVdb8fc2HAg Panel discussion featuring party leader Thanathorn Jungrungreangkit] at the Foreign Correspondents' Club of Thailand (YouTube video)"
    }
  ]
}