{
  "content": [
    {
      "type": "text",
      "text": "# Future Main Battle Tank\n\nThe Future Main Battle Tank (FMBT) is a next-generation main battle tank being developed by the Combat Vehicles Research and Development Establishment (CVRDE) of the Defence Research and Development Organisation (DRDO) for the Indian Army. The FMBT design is expected to replace the older generation MBTs of the Indian Army Armoured Corps from 2030 onwards. The tank is a further development of the previous generation Arjun main battle tanks of the Army.\nDevelopment\nFollowing the successful performance of the Arjun Mk1 MBT against T-90 during trials in Rajasthan in March 2010, DRDO started a programme to develop next-generation Future Main Battle Tank (FMBT) for the Indian Army. The development was first reported in 2010. The development cost was reported to be approximately  while the tanks would cost around  per FMBT. The key stakeholders of the project includes the Army, quality control personnel and the production agency. The development will take 7-8 years from the date of sanction. The PSQR has been formalised. When the detailed specifications of the FMBT is finalised, they will be listed in GSQR. The FMBT is planned to be produced by Heavy Vehicles Factory, Avadi.\nAs reported by the then Minister of Defence A.K. Antony to the Lok Sabha on 6 December 2010, the Preliminary Staff Qualitative Requirements (PSQR) for the tank has been formulated by the Army, while the feasibility study is being carried out by DRDO. The development would be completed by 2020.\nHowever, as per reports in 2012, the Army could not decide the desired specifications and the PSQR was not formalised of the FMBT including the crew configuration (three-crew or four-crew). PSQR is important for sanctioning and funding the development programme. This meant that the Defence Minister had “misled” the Parliament earlier. However, CVRDE had started its development before the finalising of PSQR.\nIn September 2021, the tank completed its Preliminary Design Review (PDR).\nDesign\nThe tank is to weigh around 50tonnes and will feature active protection system (which can shoot down enemy anti-tank projectiles before they strike the FMBT), extreme mobility, CBRN defense capabilities (to conduct operations without exposing the crew to harmful radiation), and the network-centric operation capability (providing full situational awareness to the crew even when “buttoned down” inside the tank). The armaments of the tank will include 120mm smoothbore main gun (ATGM-capable) and two small-calibre machine guns. The tank will have a modular design, enabling the tanks to integrate new technology with time. The volume occupied by electronics package is less when compared to earlier Arjun tank variants. Also, the engine size will be two-thirds of those used earlier. The FMBT is to be equipped with advanced electro-optical sight systems and possibly a high power laser weapon system.\nMobility\nSee also\n* List of main battle tanks by generation\n*\n*\n*\nReferences"
    }
  ]
}