{
  "content": [
    {
      "type": "text",
      "text": "# G. K. Warren Prize\n\nThe G. K. Warren Prize is awarded by the U.S. National Academy of Sciences  \"for noteworthy and distinguished accomplishment in fluviatile geology and closely related aspects of the geological sciences.\" Named in honor of Gouverneur Kemble Warren, it was first awarded in 1969 and has been awarded every four years since 1982.\nList of G. K. Warren Prize winners\nSource: NAS\n{|class=\"wikitable sortable\"\n|-\n! Year\n! Recipient\n! Rationale\n|-\n|1969\n|Ralph A. Bagnold\n|for his outstanding contributions in fluvial geology\n|-\n|1973\n|Luna B. Leopold\n|for his contributions to the field of hydraulic geometry of rivers and his studies of the riverine environment\n|-\n|1976\n|Walter B. Langbein\n|for his significant advancement of hydrology and fluviatile geology through geophysics and mathematics\n|-\n|1982\n|John T. Hack\n|for his major contributions to understanding of form and characteristics of river channels as related to geologic stratigraphy\n|-\n|1986\n|Stanley A. Schumm\n|for his sound, insightful contributions to the role of fluvial processes in the evolution of slopes, stream channels, and sediment production, and their practical concerns to man\n|-\n|1990\n|John R. L. Allen\n|for his distinguished contributions to fluvial sedimentology and paleogeomorphology, which skillfully blends field studies of modern and ancient fluvial environments with laboratory experiments and mathematical modeling\n|-\n|1994\n|Claudio Vita-Finzi\n|for his distinguished contributions to fluvial morphology in relation to climate, tectonic activity, and human history (archaeological geology), on the basis of field investigations on several continents\n|-\n|1998\n|Thomas Dunne\n|for his field observations as the basis for detailed theoretical analyses of many hydro-geomorphological problems, including surface erosion, snow-melt runoff, sediment budgets for small plots, and great rivers, including the Amazon\n|-\n|2002\n|Gary Parker\n|for rigorous analysis based on fundamental physical principles and laboratory experiments markedly advancing our understanding of sediment transport, river morphology, and channel behavior\n|-\n|2006\n|Michael A. Church\n|for his extensive and innovative field and laboratory studies of the morphology and dynamics of natural and managed river channels at a range of scales\n|-\n|2010\n|Alan D. Howard\n|for his seminal contributions on the theory of fluvial erosion, sedimentation, and landscape evolution\n|-\n|2014\n|\n|for his seminal studies on the role of fluvial incision as a key process that links climate, tectonics, and landscape evolution\n|-\n|2019\n|Kay Behrensmeyer\n| For her contributions to understanding fluvial processes, how they are expressed in the rock record, and how they shape our understanding of ecological change throughout the history of life on land\n|}\nSee also\n* List of geology awards\n* Prizes named after people\nReferences\nExternal links\n*[http://www.nasonline.org/about-nas/awards/g-k-warren-prize.html G.K. Warren Prize] National Academy of Sciences web site"
    }
  ]
}