{
  "content": [
    {
      "type": "text",
      "text": "# G. M. Siddeshwara\n\n| birth_place    = Chitradurga, Mysore State (now Karnataka), India\n| party          = Bharatiya Janata Party\n| spouse         = G. S. Gayithri\n| children       = 2\n| website = [http://www.gmsiddeshwara.com/ Official Website]\n| footnotes =\n| date = 14 February\n| year = 2009\n|source=https://web.archive.org/web/20080417172226/http://164.100.24.209/newls/Biography.aspx?mpsno=3977 Member of 14th Lok Sabha\n}}\nGowdara Mallikarjunappa Siddeshwara (born 5 July 1952) is an Indian politician. He was a former member of the Lok Sabha, the lower House of the Indian Parliament, representing Davangere of Karnataka since 2004. Siddeshwara served as the Union Minister of State for Heavy Industries and Public Enterprises and prior to that, as Minister of State for Civil Aviation, till he resigned from the Ministry after a few days of cabinet reshuffle in July 2016.\nPersonal life\nSiddeshwara was born on 5 July 1952. His father G. Mallikarjunappa (died 2003) was also a Member of Parliament for two terms: 1996–1998 and 1999–2002. Mallikarjunappa was affiliated to the RSS before joining the BJP electoral politics.\nPolitical career\nBeing an active member of the Bharatiya Janata Party, he served as the Vice-President of the Karnataka State (2009-2010) and the National Parliamentary Party Treasurer of the Bharatiya Janata Party from 2004-2014. Hitherto, he served as the Secretary of Karnataka state BJP; Member of Parliamentary Consultative Committee for Ministry of Human Resource Development and Member of the Parliamentary Committee on Finance (2004 to 2009), Member of Parliamentary Committee on Water Resources (2009-2010); Member of Parliamentary Committee on Finance; and Member of Parliamentary Consultative Committee for the Ministry of Commerce & Industry (March 2010 - May 2014). He was re-elected to the 16th Lok Sabha from Davangere for the third time successively with a margin of 17, 607 votes defeating his Congress rival.\nHe served as Minister of State for Civil Aviation from 26 May 2014 to 9 November 2015 and Minister of State for Heavy Industries and Public Enterprises from 9 November 2014 to 12 July 2016.\nReferences\nExternal links\n* [http://www.bjp.org Bharatiya Janata Party ]\n* [http://www.bjp.org/en/bjp-in-parliament/parliamentary-party]\n* [https://web.archive.org/web/20080417172226/http://164.100.24.209/newls/Biography.aspx?mpsno=3977 Members of fifteenth Lok Sabha - Parliament of India website]"
    }
  ]
}