{
  "content": [
    {
      "type": "text",
      "text": "# Galactic Civilizations__disambig_1\n\n|designer = Brad Wardell\n|programmer = Cari BegleScott TykoskiBrad WardellMichael DuffyIan Hanschen\n|artist = Alex GounaropoulosScott TykoskiRuss Schwenkler\n|writer = Brad WardellScott TykoskiAlexander Antoniades\n|composer = Eric HeberlingEric Johnson\n|engine =\n|series =\n|released = |EU|September 12, 2003}}Altarian Prophecy\n|genre = Turn-based strategy, 4X\n|modes = Single player\n|platforms = Microsoft Windows\n}}\nGalactic Civilizations is a turn-based strategy video game developed by Stardock and released in March 2003. The game is a remake of an OS/2 series of the same name.  An expansion pack entitled Altarian Prophecy was released in 2004. A sequel, Galactic Civilizations II: Dread Lords, was released February 21, 2006. On May 14, 2015, Stardock released Galactic Civilizations III. On April 26, 2022, Stardock released Galactic Civilizations IV.\nGameplay\nThe goal of the game is to eventually dominate the galaxy.  It is possible to achieve victory through war, cultural domination, diplomacy or by developing overwhelming advanced technology.\nStory\nThe game is set in the future.  Humankind has made contact with the 5 other major alien races.  Space travel is risky and expensive, requiring huge jump gates which only permit travel between two specific points.  Because space travel is so difficult, the galaxy remains mostly uncolonized.  The humans make a great discovery&mdash;hyperdrive.  It permits fast travel between any two stars.  The humans share their discovery with the other five major races.  All communication stops.  The humans consider that sharing their discovery may have been a mistake.  Now that the galaxy is open for exploration, there's going to be a rush to claim all the uncolonized worlds.\nDevelopment\nGalactic Civilizations was first developed for OS/2 in April 1993 by Brad Wardell. Although revenue from the initial OS/2 release was never paid by the bankrupt publisher, popular support encouraged Stardock to release Shipyards, an add-on pack that allowed users to design their own starships, and this provided enough revenue to support further development, with a simplified version being sold to IBM in 1995 as Star Emperor. The game sold above 30,000 units for OS/2.\nGalactic Civilizations II was released later that year, adding several new concepts and tweaks. It was followed by another version of Shipyards (which added both the ship design feature and improved governors/AI), and an expansion pack in April 1997, before Stardock was forced to withdraw from significant OS/2 development with the loss of their market. It is possible to run OS/2 versions of the game under emulation using Virtual PC.\nExpansion pack\nAn expansion pack, called Galactic Civilizations: Altarian Prophecy, was released in 2004.\nReception\nGalactic Civilizations\n| CGW =\n| GSpot = 8.4/10\n| GSpy =\n| GameZone = 7.5/10\n| IGN = 8.2/10\n| PCF = 86%\n| PCGUK = 88%\n| PCGUS = 82%\n| XPlay =\n}}\nThe game received \"generally favorable reviews\" according to the review aggregation website Metacritic. By December 2005, the game had sold 75,000 copies, which Computer Gaming Worlds Bruce Geryk called \"impressive\" for its genre. According to writer Greg Costikyan, the game's sales had surpassed 100,000 units by 2008.\nGalactic Civilizations was named the ninth-best computer game of 2003 by Computer Games Magazine, and it won the publication's \"Best AI\" award, tying with Halo: Combat Evolved. A writer for the magazine called it \"the sort of game that will still be on your hard drive when all the other games you are playing right now are gathering dust on a shelf.\" The editors of Computer Gaming World nominated Galactic Civilizations for their 2003 \"Strategy Game of the Year\" award, which ultimately went to Age of Wonders: Shadow Magic. They wrote that they \"found it impossible to ignore the [game's] almost overwhelming depth of strategy\".\nAltarian Prophecy\n| CGW =\n| GameZone = 8/10\n| IGN = 8/10\n| PCGUS = 62%\n}}\nThe Altarian Prophecy expansion pack received \"favorable\" reviews, although slightly less than the original, according to Metacritic.\nReferences\n* [http://www.stardock.com/stardock/articles/article_sdos2.html Stardock's OS/2 history] by Brad Wardell\nExternal links\n*\n*\n*"
    }
  ]
}