{
  "content": [
    {
      "type": "text",
      "text": "# Gallo-Roman culture\n\n, 250–275 AD]]\n]]\nGallo-Roman culture was a consequence of the Romanization of Gauls under the rule of the Roman Empire in Roman Gaul. It was characterized by the Gaulish adoption or adaptation of Roman culture, language, morals and way of life in a uniquely Gaulish context. The well-studied meld of cultures in Gaul gives historians a model against which to compare and contrast parallel developments of Romanization in other less-studied Roman provinces.\nInterpretatio romana offered Roman names for Gaulish deities such as the smith-god Gobannus; however, of the Celtic deities, only the horse-patroness Epona penetrated Romanized cultures beyond the confines of Gaul.\nThe barbarian invasions began in the late 3rd century and forced upon Gallo-Roman culture fundamental changes in politics, economic underpinning and military organization. The Gothic settlement of 418 offered a double loyalty, as Western Roman authority disintegrated at Rome. The plight of the highly-Romanized governing class is examined by R.W. Mathisen, the struggles of bishop Hilary of Arles by M. Heinzelmann.\nInto the 7th century, Gallo-Roman culture would persist particularly in the areas of Gallia Narbonensis that developed into Occitania, Cisalpine Gaul, Orléanais, and to a lesser degree, Gallia Aquitania. The formerly-Romanized northern Gaul, once it had been occupied by the Franks, would develop into Merovingian culture instead. Roman life, centered on the public events and cultural responsibilities of urban life in the res publica and the sometimes luxurious life of the self-sufficient rural villa system, took longer to collapse in the Gallo-Roman regions, where the Visigoths largely inherited the status quo in 418. The Gallo-Roman language persisted in the northeast into the Silva Carbonaria, which formed an effective cultural barrier with the Franks to the north and the east, and in the northwest to the lower valley of the Loire, where Gallo-Roman culture interfaced with Frankish culture in a city like Tours and in the person of that Gallo-Roman bishop confronted with Merovingian royals, Gregory of Tours. Based upon mutual intelligibility, David Dalby counts seven languages descended from Gallo-Romance: Gallo-Wallon, French, Franco-Provençal (Arpitan), Romansh, Ladin, Friulian, and Lombard. However, other definitions are far broader, variously encompassing the Rhaeto-Romance languages, Occitano-Romance languages and Gallo-Italic languages.\nPolitics\n\", 440–450, 4240&nbsp;mg. Hotel de la Monnaie.]]\nGaul was divided by Roman administration into three provinces, which were subdivided during the later 3rd-century reorganization under Diocletian, and divided between two dioceses, Galliae and Viennensis, under the Praetorian prefecture of Galliae. On the local level, it was composed of civitates, which preserved, broadly speaking, the boundaries of the formerly-independent Gaulish tribes, which had been organised in large part on village structures, which retained some features in the Roman civic formulas that overlaid them.\nOver the course of the Roman period, an ever-increasing proportion of Gauls gained Roman citizenship. In 212, the Constitutio Antoniniana extended citizenship to all free-born men in the Roman Empire.\nGallic Empire\nwarrior dressed in Roman lorica hamata (chainmail) with a cloak over it. Wearing a torc around his neck, he also wields a Celtic-style shield although the proportions of the body and the overall realism are more in line with Classical and Roman art than with the Celtic depictions of soldiers.]]\nDuring the Crisis of the Third Century, from 260 to 274, Gaul was subject to Alamannic raids during a civil war. In reaction to local problems, the Gallo-Romans appointed their own emperor, Postumus. The rule over Gaul, Britannia and Hispania by Postumus and his successors is usually called the Gallic Empire although it was just one set of many usurpers who took over parts of the Roman Empire and tried to become emperor. The capital was Trier, which was used as the northern capital of the Roman Empire by many emperors. The Gallic Empire ended when Aurelian decisively defeated Tetricus I at Chalons.\nReligion\nThe pre-Christian religious practices of Roman Gaul were characterized by syncretism of Graeco-Roman deities with their native Celtic, Basque or Germanic counterparts, many of which were of strictly local significance. Assimilation was eased by interpreting indigenous gods in Roman terms, such as with Lenus Mars or Apollo Grannus. Otherwise, a Roman god might be paired with a native goddess, as with Mercury and Rosmerta. In at least one case, that of the equine goddess Epona, a native Gallic goddess was also adopted by Rome.\nEastern mystery religions penetrated Gaul early on, which included the cults of Orpheus, Mithras, Cybele and Isis.\nThe imperial cult, centred primarily on the numen of Augustus, came to play a prominent role in public religion in Gaul, most dramatically at the pan-Gaulish ceremony venerating Rome and Augustus at the Condate Altar, near Lugdunum, annually on 1 August.\nChristianity\n, Rignieux-le-Franc (Ain), late 4th century. Louvre Museum]]\nGregory of Tours recorded the tradition that after the persecution under the co-emperors Decius and Gratus (250–251), the future Pope Felix I sent seven missionaries to re-establish the broken and scattered Christian communities: Gatien to Tours, Trophimus to Arles, Paul to Narbonne, Saturninus to Toulouse, Denis to Paris, Martial to Limoges and Austromoine to Clermont.\nIn the 5th and the 6th centuries, Gallo-Roman Christian communities still consisted of independent churches in urban sites, each governed by a bishop. Christians experienced loyalties that were divided between the bishop and the civil prefect, who operated largely in harmony within the late-imperial administration. Some of the communities had origins that predated the 3rd-century persecutions. The personal charisma of the bishop set the tone, as 5th-century allegiances for pagans and Christians switched from institutions to individuals. Most Gallo-Roman bishops were drawn from the highest levels of society as appropriate non-military civil roads to advancement dwindled, and they represented themselves as bulwarks of high literary standards and Roman traditions against the Vandal and Gothic interlopers. Other bishops drew the faithful to radical asceticism. Bishops often took on the duties of civil administrators after the contraction of the Roman imperial administration during the barbarian invasions of the 5th century by helping fund building projects and even acting as arbiters of justice in the local community. Miracles attributed to both kinds of bishops, as well as holy men and women, attracted cult veneration, sometimes very soon after their death. A great number of locally venerated Gallo-Roman and Merovingian saints arose from 400 to 750. The identification of the diocesan administration with the secular community, which took place during the 5th century in Italy, can best be traced in the Gallo-Roman culture of Gaul in the career of Caesarius, bishop and Metropolitan of Arles from 503 to 543. (Wallace-Hadrill).\nLanguage\ntoday, in the broadest definition of the term.]]\nBefore the Roman incursion, most of Gaul spoke Celtic dialects that are now considered to be the Gaulish language with considerable variation. The south-western region that would later become Gascony spoke the Aquitanian language, which may have been the parent language of Basque; further, parts of the coast near Marseille spoke Ligurian with some Greek-speaking colonies on the Mediterranean coast, notably including Massilia. In the northeastern zone of Belgica, there may have been some presence of Germanic languages, but that is disputed. During the late empire, there was some settlement in Gaul by tribes speaking Germanic or Eastern Iranian languages, such as the Alans.\n, a lunisolar calendar created in the 2nd century with native Gaulish text]]\nThe Gaulish language is thought to have survived into the 6th century in France, despite considerable Romanization of the local material culture. The last record of spoken Gaulish deemed to be plausibly credible was when Gregory of Tours wrote in the 6th century (c. 560–575) that a shrine in Auvergne which \"is called  in the Gallic tongue\" was destroyed and burnt to the ground. Coexisting with Latin, Gaulish helped shape the Vulgar Latin dialects that developed into French, with effects including loanwords and calques (including , the word for \"yes\"), sound changes, and influences in conjugation and word order.\nThe Vulgar Latin in the region of Gallia took on a distinctly local character, some of which is attested in graffiti, which evolved into the Gallo-Romance dialects which include French and its closest relatives. The influence of substrate languages may be seen in graffiti showing sound changes that matched changes that had occurred earlier in the indigenous languages, especially Gaulish. The Vulgar Latin in the North of Gaul evolved into the langues d'oïl and Franco-Provencal, and the dialects in the South evolved into the modern Occitan and Catalan tongues. Other languages held to be Gallo-Romance include the Gallo-Italic languages and the Rhaeto-Romance languages.\nLatin epigraphy in Gaul has peculiarities such as the occasional variant  instead of .\nGallo-Roman art\n, in Roman Gallia Aquitania (Louvre)]]\nin the Musée de Cluny, an example of synthesis between Celtic and Roman art]]\nRoman culture introduced a new phase of anthropomorphized sculpture to the Gaulish community, synthesized with Celtic traditions of refined metalworking, a rich body of urbane Gallo-Roman silver developed, which the upheavals of the 3rd and the 5th centuries motivated hiding away in hoards, which have protected some pieces of Gallo-Roman silver, from villas and temple sites, from the universal destruction of precious metalwork in circulation. The exhibition of Gallo-Roman silver highlighted specifically Gallo-Roman silver from the treasures found at Chaourse (Aisne), Mâcon (Saône et Loire), Graincourt-lès-Havrincourt (Pas de Calais), Notre-Dame d'Allençon (Maine-et-Loire) and Rethel (Ardennes, found in 1980).\nGallo-Roman sites\nThe two most Romanized of the three Gauls were bound together in a network of Roman roads, which linked cities. Via Domitia (laid out in 118 BC), reached from Nîmes to the Pyrenees, where it joined the Via Augusta at the Col de Panissars. Via Aquitania reached from Narbonne, where it connected to the Via Domitia, to the Atlantic Ocean through Toulouse to Bordeaux. Via Scarponensis connected Trier to Lyon through Metz.\nSites, restorations, museums\n, Switzerland, about 200 AD]]\nAt Périgueux, France, a luxurious Roman villa called the Domus of Vesunna, built round a garden courtyard surrounded by a colonnaded peristyle enriched with bold tectonic frescoing, has been handsomely protected in a modern glass-and-steel structure that is a fine example of archaeological museum-making (see external link).\nLyon, the capital of Roman Gaul, is now the site of the Gallo-Roman Museum of Lyon (rue Céberg), associated with the remains of the theater and odeon of Roman Lugdunum. Visitors are offered a clear picture of the daily life, economic conditions, institutions, beliefs, monuments and artistic achievements of the first four centuries of the Christian era. The \"Claudius Tablet\" in the Museum transcribes a speech given before the Senate by the Emperor Claudius in 48, in which he requests the right for the heads of the Gallic nations to participate in Roman magistracy. The request having been accepted, the Gauls decided to engrave the imperial speech on bronze.\nIn Metz, once an important town of Gaul, the Golden Courtyard Museums displays a rich collection of Gallo-Roman finds and the vestiges of Gallo-Roman baths, revealed by the extension works to the museums in the 1930s.\nIn Martigny, Valais, Switzerland, at the Fondation Pierre Gianadda, a modern museum of art and sculpture shares space with Gallo-Roman Museum centered on the foundations of a Celtic temple.\nOther sites include:\nTowns\n(second century AD)]]\n* Arles – remains include the Alyscamps, a large Roman necropolis\n* Autun\n* Divodurum (modern Metz) – remains include the Basilica of Saint-Pierre-aux-Nonnains and the thermae\n* Glanum, near Saint-Rémy-de-Provence\n* Jublains archeological site\n* Narbonne\n* Nîmes – remains include the Maison Carrée\n* Orange\n* Tongeren (Belgium) – Gallo-Roman Museum of Tongeren\n* Vaison-la-Romaine\n* Velzeke-Ruddershove (Belgium) – Provincial Archaeological Museum of Velzeke\nin today's Lyon]]\nAmphitheatres\n* Arelate (modern Arles)\n* Grand\n* Lugdunum (modern Lyon)\n* Nemausus (modern Nîmes)\n* Lutetia (modern Paris): Arènes de Lutèce\n* Mediolanum Santonum (modern Saintes)\n* several Roman amphitheatres are still visible in France (see List of Roman amphitheatres for a list)\nAqueducts\n* Pont du Gard\n* Barbegal aqueduct\nSee also\n* Culture of Ancient Rome\n* Sidonius Apollinaris\n* Syagrius\n* Via Domitia, the first Roman road built in Gaul\n* Pillar of the Boatmen\n* Thraco-Roman\n* Loupian Roman villa\n* Gallo language\n* Ausonius\n* Venantius Fortunatus\n* Hilary of Arles\n* Roman villas in northwestern Gaul\n* Romano-British culture\n* Romano-Germanic culture\n* Daco-Roman\n* Illyro-Roman\n* Pillar of Yzeures-sur-Creuse\n* Gallo-Roman enclosure of Tours\nNotes\nBibliography\n* Wallace-Hadrill, J.M. 1983. The Frankish Church (Oxford University Press) , 1983\n* Drinkwater, John, and Hugh Elton, eds. Fifth-Century Gaul: a crisis of identity? (Cambridge University Press) 2002.\n* Omrani, Bijan. ''Caesar's Footprints: Journeys to Roman Gaul'' (Head of Zeus) 2017.\nExternal links\n* [https://web.archive.org/web/20041012223125/http://www.mairie-lyon.fr/vdl/sections/en/culture/musees/musee_civilisation_gallo_romaine/ Gallo-Roman Museum, Lyon]\n* [https://web.archive.org/web/20040629214758/http://www.arcspace.com/architects/nouvel/Gallo-Roman/ Vesunna Gallo-Roman Museum by Jean Nouvel]\n* [https://www.galloromeinsmuseum.be/ Gallo-Roman Museum Tongeren – Belgium]"
    }
  ]
}