{
  "content": [
    {
      "type": "text",
      "text": "# Gamaliel King\n\n's Cary Building, 1857]]\nGamaliel King (Shelter Island, New York, 1 December 1795 — 6 December 1875) was an American architect who practiced in New York City and the adjacent city of Brooklyn, where he was a major figure in Brooklyn civic and ecclesiastical architecture for several decades.\nHis practice began as a \"builder\" in Brooklyn in the 1820s:  in 1823 he and Joseph Moser were commissioned to build the York Methodist Episcopal Church, which was dedicated 6 June 1824. The following year, he was at Pineapple Street, corner of Hicks, and \"Trustee of the Apprentices Library Association.\" In 1826, he was at Orange Street, listed as a builder, but in subsequent years supplementing his income as a grocer. None of his early work can be identified today, if any of his structures still stand.\nHe was known for his pioneering commercial architecture in Manhattan through his partnership with John Kellum, a carpenter of Hempstead, Long Island, who became a distinguished architect in his own right. The partnership of King & Kellum practiced in Brooklyn from 1846 to 1859, mostly from Fulton Street; in New York they designed the landmark Cary Building (1857), which runs through the block between Chambers Street and Reade Street, with two façades that placed William H. Cary's dry-goods shop and warehouse among the first fully cast iron-fronted buildings in the world. The two ground-floor fronts are of large-paned windows and doors framed in slender cast-iron columns; paired columns separate the arcaded window bays of upper floors, with cast-iron rustication that was originally painted a creamy limestone color and the wet paint surfaces sanded the better to imitate stone. The effect was akin to a narrow slice of Venetian Renaissance palazzo. Cary had already commissioned from King & Kellum cast-iron storefronts on Fulton Street in Brooklyn and on Pearl Street in Manhattan; the cast-iron elements were produced by Daniel D. Badger's  Architectural Iron Works in Manhattan.\nWith Kellum as foreman King built the Brooklyn City Hall, which was begun in 1845 to King's simplified design on foundations that had been laid in preparation for a more ambitious design, which was aborted during the Panic of 1837. In the original competition in 1835 King's design had come in second. The incomplete City Hall opened in 1848, before it was fully completed, and served as city hall for nearly fifty years; since consolidation with New York City in 1898, it has been the Brooklyn Borough Hall.\nIn New York King and Kellum built the simple Italianate Friends' Meeting House (1859), on Gramercy Park South, once reputedly a stop on the Underground Railroad and now housing the Brotherhood Synagogue. The Gothic Revival Washington Square United Methodist Church that was built in 1860 and designed by Gamaliel King, according to the AIA Guide to New York City, was stripped of its remaining interiors and turned into condominiums in 2006.\nIn Brooklyn King designed some of the city's finest churches, exemplified today by the 12th Street Dutch Reformed Church, Park Slope (1868) and the once-spectacular domed King's County Courthouse (1861-5, demolished). Later, in partnership with William H. Willcox he built the Kings County Savings Bank in Williamsburgh, Brooklyn (completed 1868, standing).\non Pine Point, Stonington, Connecticut]]\nThe disappearance of his office archive means that there is no way to assess the scope of his work for private clients. Mary M. Thacher surmises that three houses built round Lambert's Cove, Stonington, Connecticut, are the only documented houses attributed to King still standing today. The house of James Ingersoll Day was demolished following the Hurricane of 1938 but the Captain Nathaniel B. Palmer house on Pine Point, and the Stanton house, \"Linden Hall\" remain. It is also likely that the undocumented Cove Lawn built in 1856 by the youngest of three Palmer brothers, Captain Theodore Dwight Palmer, was also designed by Gamaliel King. The Italianate King-Jellison House (1868), 330 Engle Street, Tenafly, New Jersey, built for George B. Jellison, a printer in New York City, who married Sarah King, is attributed to King.\nIn addition to his career as architect, Gamaliel King was a member of the New York State Assembly (Kings Co.) in 1846.\nGamaliel King's parents were Abraham King and Bethia Parshall King of Shelter Island. On 19 June 1819, he married Catherine Oliver Snow, daughter of John Snow and Catherine Oliver Snow of Brooklyn; with her had five children, four of whom lived to adulthood.\nNotes"
    }
  ]
}