{
  "content": [
    {
      "type": "text",
      "text": "# Gambling Emperor Legend Zero\n\nvolume cover, featuring Zero Ukai\n| ja_kanji        = 賭博覇王伝 零\n| ja_romaji       = Tobaku Haōden Zero\n| genre           =  }}\n}}\n| magazine        = Weekly Shōnen Magazine\n| imprint         = KCDX\n| first           = September 5, 2007\n| last            = February 25, 2009\n| volumes         = 8\n| volume_list     =\n}}\n| writer          =\n| music           = Grand Funk\n| studio          = Office Crescendo\n| network         = Nippon TV\n| first           = July 15, 2018\n| last            = September 16, 2018\n| episodes        = 10\n| episode_list    =\n}}\nis a Japanese manga series written and illustrated by Nobuyuki Fukumoto. The first part was serialized in Kodansha's  manga magazine Weekly Shōnen Magazine from September 2007 to March 2009, with its chapters collected in eight  volumes. The second part, Tobaku Haōden Zero: Gyanki-hen was serialized in the same magazine from July 2011 to May 2013, with its chapters collected in 10 volumes. The story revolves around gambling with high stakes, with focus on competition and rivalry.\nPlot\nZero Ukai, a boy who causes a stir as a so-called \"Robin Hood\" of society, is invited along with his friends to the Dream Kingdom, a part-gambling part-amusement park under construction by the wealthy Muryō Zaizen. Zero and the others are brought together because Zaizen is in search of a \"king,\" in other words his rep player, and he puts all his money on the line in order to succeed in that search, with the reward equaling no less than 100 billion yen. In order to save all the victims of the bank transfer scam with the prize money, Zero takes on the challenge to become the king, but the games are nothing short of the ultimate gambles of life, mind and body.\nCharacters\nThe Participants\n;\n:\n:Zero is a 17-year-old honor student from Kainan Junior High's advanced class, ranking among the top three in his year. Calm and analytical, he remains composed under pressure and excels in athletics. He values justice deeply, treating his closest companions as equals and showing kindness even to rivals like Shirube.\n;\n:One of Zero's companions initially resents him for preventing his suicide but later embraces their pact, finding new purpose in life. Through their actions, he develops a strong sense of justice and aims to use his share of the bounty to help victims of financial scams.\n;\n: in the TV series)}}\n:One of Zero's companions wears glasses and maintains a quiet demeanor. Initially self-serving, he pretends to pursue victory like other participants but gradually recognizes Zero's leadership, believing he alone should prevail. Despite Zero's warnings about the dangers of staying together, he chooses to remain by his side, determined to support him until the end.\n;\n: in the TV series)}}\n:One of Zero's companions stands out for his heavier build and initially displays stronger selfish desires than the others. Though dependent on Zero's help due to his lack of physical strength, he reluctantly parts ways when urged to leave. They later reunite outside the venue for \"The Lost Ring\".\n;\n:\n:A yakuza boss runs the bank transfer scam group targeted by Zero and his companions. Granted entry into the \"test to decide the king\" by Zaizen's whims, he often serves as comic relief but also provides crucial insights that help Zero's group. During the second arc, he partners with Zero as a game intermediary and betting manager, adopting a Kansai dialect in his speech.\n;\n: in the TV series)}}\n:A shrewd, tall gangster and Keio University graduate, he belongs to the bank transfer scam group and joins Zaizen's test alongside Suezaki. Though treated as a younger brother by the short-tempered Suezaki, he secretly mocks him. Despite his intellectual background, he genuinely respects the skills of Zero and Shirube, despite their youth.\n;\n:\n:A highly intelligent young boy of unknown age and real name. He maintains a calm demeanor despite his intense idealism. Though outwardly detached, he harbors a fierce determination to reshape the world, even at personal cost. He proposes a secret alliance with Zero to overthrow Zaizen, believing youth like themselves—not figures like Zaizen—should guide the future.\nThe Sponsors\n;\n:\n:The president of the Zaizen Group, Japan's wealthiest individual with over 3 trillion yen in personal assets, is an 81-year-old wheelchair user nicknamed \"Money God\". He organizes the \"test to decide the king\", gathering blood relatives and powerful figures as participants. Though initially impressed by Zero's group and rescues them, he grows to dislike Zero due to his wariness. A vicious sadist, he enjoys torturing failed participants and believes strongly in innate luck. He maintains 365 mistresses and numerous descendants.\n;\n: in the TV series)}}\n:A 58-year-old Zaizen Group executive oversees the \"test to decide the king\", presiding over the Dream Kingdom's brutal gambles. Though he enforces harsh conditions, he judges fairly and recognizes Zero's superiority, showing him particular favor while monitoring his progress.\n;\n:A scarred old man challenges Zero in the finger-cutting gamble, concealing childhood facial injuries with his hair and posture. Boasting a near-perfect gambling record with only one loss, he faces Zero with unwavering confidence—though his success hides a crucial secret.\n;\n:\n:The flamboyantly dressed DJ of the anchor gamble introduces himself with an absurdly long pseudonym, though his driver's license reveals a simpler name. Zero suspects he may have partial American heritage. While maintaining a friendly facade for participants, he secretly despises sentimental stories and actively hopes the gambling process will tear teams apart.\nGyanki-hen\n;\n:A collegiate golf champion faces Zero in an early morning match. Though outwardly polite, he secretly holds contempt for others beneath his pleasant public demeanor.\n;\n:A self-styled \"Invincible Poker Queen\" challenges Zero's underground gambling site, distinguished by her sharp canine teeth. Arrogant and selectively rational, she delights in forcibly extracting losers' teeth during her rigged \"100-card poker\" matches.\n;\n:A 13-year-old boy witnesses Zero's beer-pouring match with an entertainment executive. Inspired by Zero's tactical skill and integrity, he seeks help deciphering \"Yukichi's Soliloquy\", a cryptogram allegedly left by his grandfather Kijūrō. Though lacking exceptional abilities, he possesses strong intuition.\n;\n:The senior managing director of Hōō Corporation, one of Japan's leading conglomerates, is Kijūrō's eldest daughter and Naoki's mother. Naturally detached, she shows little interest in her father's wealth and often displays an airheaded demeanor.\n;\n:The president of Hōō Corporation and Kijūrō's eldest son proposes a first-come-first-served distribution of any discovered family fortune. Leveraging his company's resources and Tatsuki's intellect, he schemes to claim the entire inheritance for himself.\n;\n:Takamitsu's 13-year-old son, a prodigy who skipped grades to attend Massachusetts Institute of Technology by his third year, shares Naoki's age but not his intellect. Viewing human intelligence as the ultimate treasure, he aspires to surpass geniuses like Shirube and Zero. Learning of Zero's attempt to decode Yukichi's soliloquy, he enters the competition to challenge him directly.\n;\n:The senior managing director of Hōō Corporation, once considered founder Kijūrō's right-hand man, suggests \"Yukichi's Soliloquy\" may contain a hidden distress signal from his former mentor.\n;\n:The eccentric founder of Hōō Corporation, though octogenarian, possesses extraordinary physical abilities—demonstrating forward somersaults and claiming he could perform backward ones. Despite his immense wealth and quirks, his genuine kindness makes him universally admired, a rarity in such circumstances. After three years of confinement, he exposes Takamitsu as his captor.\n;\n:Kijūrō's late wife and mother of Takamitsu and Sawako was once courted by Zaizen, but she had already fallen for Kijūrō by the time Zaizen became a billionaire and confessed his feelings.\nMedia\nManga\nWritten and illustrated by Nobuyuki Fukumoto, Gambling Emperor Legend Zero was serialized in Kodansha's  manga magazine Weekly Shōnen Magazine from September 5, 2007, to February 25, 2009. released on February 25 of that same year.}} Its chapters were collected in eight  volumes, released from November 11, 2007, to April 17, 2009.\nA second arc, , was serialized in Weekly Shōnen Magazine from July 13, 2011, to May 29, 2013. Its chapters were collected in ten  volumes, released from October 17, 2011, to July 17, 2013.\nIn June 2020, Manga Planet announced the digital English-language publication of the manga. It was planned to start on June 23, 2020, however, it was postponed to November 17, 2020.\nVolumes\nFirst series\n|OriginalISBN = 978-4-06-372395-3\n|ChapterListCol1=\n|\n|\n}}\n|ChapterListCol2=\n|\n}}\n}}\n|OriginalISBN = 978-4-06-375435-3\n|ChapterListCol1=\n|\n|\n|\n|\n}}\n|ChapterListCol2=\n|\n|\n|\n}}\n}}\n|OriginalISBN = 978-4-06-375473-5\n|ChapterListCol1=\n|\n|\n|\n|\n}}\n|ChapterListCol2=\n|\n|\n|\n}}\n}}\n|OriginalISBN = 978-4-06-375511-4\n|ChapterListCol1=\n|\n|\n|\n|\n}}\n|ChapterListCol2=\n|\n|\n|\n}}\n}}\n|OriginalISBN = 978-4-06-375557-2\n|ChapterListCol1=\n|\n|\n|\n|\n}}\n|ChapterListCol2=\n|\n|\n|\n|\n}}\n}}\n|OriginalISBN = 978-4-06-375601-2\n|ChapterListCol1=\n|\n|\n|\n|\n}}\n|ChapterListCol2=\n|\n|\n|\n}}\n}}\n|OriginalISBN = 978-4-06-375636-4\n|ChapterListCol1=\n|\n|\n|\n|\n}}\n|ChapterListCol2=\n|\n|\n|\n}}\n}}\n|OriginalISBN = 978-4-06-375695-1\n|ChapterListCol1=\n|\n|\n|\n|\n}}\n|ChapterListCol2=\n|\n|\n|\n|\n}}\n}}\nSecond series\n|OriginalISBN = 978-4-06-376135-1\n|ChapterListCol1=\n|\n|\n|\n}}\n|ChapterListCol2=\n|\n|\n}}\n}}\n|OriginalISBN = 978-4-06-376172-6\n|ChapterListCol1=\n|\n|\n|\n|\n}}\n|ChapterListCol2=\n|\n|\n|\n}}\n}}\n|OriginalISBN = 978-4-06-376611-0\n|ChapterListCol1=\n|\n|\n|\n|\n}}\n|ChapterListCol2=\n|\n|\n|\n}}\n}}\n|OriginalISBN = 978-4-06-376638-7\n|ChapterListCol1=\n|\n|\n|\n|\n}}\n|ChapterListCol2=\n|\n|\n|\n}}\n}}\n|OriginalISBN = 978-4-06-376686-8\n|ChapterListCol1=\n|\n|\n|\n|\n}}\n|ChapterListCol2=\n|\n|\n|\n}}\n}}\n|OriginalISBN = 978-4-06-376713-1\n|ChapterListCol1=\n|\n|\n|\n|\n}}\n|ChapterListCol2=\n|\n|\n|\n}}\n}}\n|OriginalISBN = 978-4-06-376794-0\n|ChapterListCol1=\n|\n|\n|\n|\n}}\n|ChapterListCol2=\n|\n|\n|\n}}\n}}\n|OriginalISBN = 978-4-06-376809-1\n|ChapterListCol1=\n|\n|\n|\n|\n}}\n|ChapterListCol2=\n|\n|\n|\n}}\n}}\n|OriginalISBN = 978-4-06-376824-4\n|ChapterListCol1=\n|\n|\n|\n|\n}}\n|ChapterListCol2=\n|\n|\n|\n}}\n}}\n|OriginalISBN = 978-4-06-376864-0\n|ChapterListCol1=\n|\n|\n|\n|\n}}\n|ChapterListCol2=\n|\n|\n|\n}}\n}}\nDrama\nA 10-episode Japanese television drama adaptation titled }}, also known as Zero: The Bravest Money Game, aired every Sunday evening from July 15 to September 16, 2018 on NTV's Sunday Drama block. The drama stars NEWS's Shigeaki Kato as Zero. After each episode finished airing, they later became available for video distribution on Hulu. The spin-off Zero: Episode ZERO, which depicts the past lives of the characters, also became available on the site.\nSee also\n*Gambling in Japan\nNotes\nReferences\nFurther reading\n*\nExternal links\n*\n*\n*\n*"
    }
  ]
}