{
  "content": [
    {
      "type": "text",
      "text": "# Game of War: Fire Age\n\nGame of War: Fire Age is a 2013 freemium mobile massively multiplayer online strategy video game developed and published by Machine Zone. The game had a high-profile advertising campaign and was one of the top-grossing apps in 2014 and 2015.\nGameplay\nGame of War: Fire Age includes player vs. player battles, player vs. environment modes (monster killing and dungeons), and city building and event quests. Gathering or farming of resources is required to create buildings, produce troops, and research advancements. Similar to other mobile games, much of the gameplay consists of selecting an action and then either waiting a preset amount of time for completion or expediting the task by making a payment. Gameplay in Game of War has no defined end; long-term players continue to grow indefinitely, attacking other players and avoiding significant losses.\nThe title places an emphasis on each player joining an alliance. Alliances are each limited to 100 players, and are situated within kingdoms measuring 512 by 512 tiles, plotted on a 512 × 1024 staggered isometric map. Alliances provide a team structure to conflicts within each kingdom. After a kingdom has been active for several months, the kingdom emerges from a protected status and players begin to engage in kingdom vs. kingdom combat events, which are periodically scheduled by the developer.\nPlayers are encouraged to engage with one another through alliance chat and kingdom chat. The game's chat system includes translation services that allow players from all over the world to play together. The game's translation of player-to-player chat and email messages is powered by services from Microsoft and Google. The automated translator supports 30 or more languages, and includes user-supported suggestions for translation corrections. Messages that cannot be automatically translated are reviewed by players who volunteer to correct spelling and grammar, or approve corrections made by others, after which the automatic translation is attempted again.\nBusiness and marketing\nin 2014, promoting the game dressed as Athena]]\nMachine Zone, the game's developer, was described by its CEO as \"probably the world's largest direct response marketer and largest single product marketer on mobile,\" with 200 employees in marketing, out of about 550 employees worldwide .\nApproximately $40&nbsp;million was spent on marketing Game of War: Fire Age in 2014. Along with advertisements in digital and social media, highly produced television commercials featuring model Kate Upton were created. The ads made use of Upton's sex appeal to promote the game as she leads battles in fantasy settings loosely comparable to those in Game of Thrones. The spots were introduced in the United States during an NFL Thursday Night Football game and have since been prominent during Super Bowl XLIX and other sporting events. Upton was replaced in 2015 by singer Mariah Carey as the face of the game's advertising campaign, and the first commercial with Carey was revealed on September 14, 2015.\nPerhaps the most famous Game of War advertisement came from a 30 second clip in which several players of the game sit around a campfire discussing the game, notably complaining about one anonymous player, (later revealed to be a girl in the group) known simply as Thelegend27. The advertisement sparked memes and a boost of popularity for Game of War.\nReception\nGame of War: Fire Age was the third-grossing game app through Apple in 2014, and it was reported that Machine Zone projected $600 million in revenues that year. In March 2015, it was in the top 10 most downloaded free apps on both the iOS Appstore and Google Play. As of August 2018, the game has grossed  in total.\nThe game and its user interface have been criticized for an aggressive style that \"heavily pushes\" in-app purchases, \"littering the screen with ads and upgrade buttons\" for gold packs priced from $5 to $100. A reviewer in Forbes wrote, \"From its overall design to how it handles cash purchases, Game of War is the most over-the-top cash grab I've ever seen.\" Similarly, Macworlds reviewer stated that \"Game of War may be the most aggressively monetized free-to-play game I've ever played.\"\nReviewers have also been highly critical of the title's \"mundane\" gameplay, which Common Sense Media called \"light on both action and strategy.\" For example, unless a player's alliance is actively at war, \"the core gameplay revolves around waiting for your task timers to finish and then queuing up new ones. Even the daily and Alliance quests just ask you to tap something and come back later to collect your reward.\" Macworld wrote that the game \"doesn't bother with interesting gameplay or any semblance of storyline – it's all 'build this' and 'train them,' but the reward is simply more and more busywork.\"\nPocket Gamer reviewed the gameplay as \"basically Busywork the Video Game,\" adding that \"the spam-filled world chat is likely poisonous to your health\" due to some players' \"false sense of self-importance – a self-importance that is bought, incidentally, and not earned.\" Nevertheless, the reviewer found it \"a highly competitive, highly engaging game in which the human players supply huge amount of competition, drama, and frustration, and pleasure.\"\nA positive review in Paste called Game of War \"addictive,\" especially in the social dynamics of in-game conflicts. The reviewer, Pastes 43-year-old editor-in-chief, found the \"internal politics\" within his alliance to be \"as fascinating as the kingdom-wide ones,\" particularly for alliance leaders: \"We have our own chat room with the leader discussing the urgent matters of the day, and the responsibilities can feel strangely important – keep the store stocked, negotiate prison releases, secure diplomatic relations, organize relocations, protect friends and recruit new members. But it’s fun to collaboratively plan strategy when you can be attacked or attack at any time. My alliance has become a little online band of brothers and sisters – Felicia Day's The Guild with 90 people – and I love it.\"\nPlayer spending\nIn August 2015, a former employee of Machine Zone was arrested and charged with stealing proprietary data that included \"player spending habits broken down by time, location, age and other characteristics\" which showed, for example, which of Game of Wars \"in-game items generate the most revenue and where in the game players often quit.\" The monetary value of the data was linked by the Wall Street Journal to the fact that \"about 3% of mobile-game players buy virtual goodies, such as extra turns and special powers. Most spend only a few dollars a month, while a tiny fraction known as whales – a name derived from casinos – plunk down $50 or more a month.\"\nAnalytics by Slice Intelligence indicated that Game of Wars paying players each spent an average of $550 in 2015 on its in-app purchases, compared to $87 spent by the average player of mobile free-to-play games. As an example of a \"whale,\" Businessweek described a 15-year-old Game of War player in Belgium who had used his mother's credit card to spend over $41,000 on in-game purchases in the free-to-play game. In December 2016, a 45-year-old California man admitted in federal court to having spent $1 million of embezzled funds on online purchases in Game of War, and in August 2018, a library director in Logan, Utah was convicted after pleading guilty to felony theft and forgery for spending $89,000 on the game using the city's credit cards.\n}}\nExternal links\n*\n* [http://www.mz.com Machine Zone] website"
    }
  ]
}