{
  "content": [
    {
      "type": "text",
      "text": "# Ganda Singh (historian)\n\n| birth_place        = Hariana, Hoshiarpur district, British Punjab\n| death_date         =\n| death_place        = Patiala, Punjab, India\n| occupation         = Punjabi historian\n| spouse             =\n}}\nGanda Singh (15 November 1900 – 27 November 1987) was an Indian Punjabi and Sikh historian and Padma Bhushan awardee. In addition to scores of research papers, booklets and pamphlets, he published over two dozen full-length volumes of historical value. He was the founding director of the Punjab State Archives under Maharaja Yadvinder Singh of Patiala. He was also the first leader of the Sikh History Research Centre, affiliated with Khalsa College, Amritsar.\nEarly life\nGanda Singh was born on 15 November 1900, at Hariana, a town in Hoshiarpur district of British Punjab to parents Jawala Singh and Hukam Devi. His primary-level education was at a local village school. He was schooled in the local Government Middle School and then the D.A.V. Middle School. He matriculated from Government High School, Hoshiarpur. Then he went to the Forman Christian College, Lahore.\nHowever, he would soon leave the college to pursue a career in the British Indian Army, being stationed at locations such as Rawalpindi, Peshawar, and Iraq. In 1921, he left the military and landed a job at the Anglo-Persian Oil Company in Abadan, Iran, where he worked from 1921 to 1930. During his time at the oil company, he came into contact with a fellow employee, who was a manager, by the name of Arnold Wilson, who had been a foremost scholar of the era. Ganda assisted Wilson in his creation of a bibliography covering Iran.\nThese early intrigues into academia, plus personal visits to Europe, piqued Ganda's interest in seeking a walk of life in historical research work. Ganda returned to his homeland in 1930 and took up a position as a contributor and writer for the Phulwari periodical published by Giani Hira Singh in Lahore.\nHe was wedded to Amar Kaur, who was also known by an alias as 'Inder Kaur'.\nResearcher and historian\nIn October 1931 began Ganda Singh's long and fruitful career as a researcher and historian. The Khalsa College, Amritsar placed him in charge of its newly created Sikh History Research Department, a position he kept till 1949. During this period he travelled extensively, rummaging various public libraries, archives and private collections throughout India in quest of materials on Sikh history, enriching the library of his department. He visited libraries and literary collections in locations such as Rampur, Bankipur, Patna, Kolkata and Delhi to source written material (rare books and manuscripts) of historical importance to bring back to his college. He also brought out several books and articles based on these.\nIn 1938, he had been appointed a corresponding member of Indian Historical Records Commission of Government of India, and was a full member of the Commission from 1950 to 1956.\nIn 1949, he was appointed Director of Archives and Curator of Museum under the Government of Patiala and East Punjab States Union. He was responsible for collecting and compiling the written material (files, records, literature, etc) from eight princely states. In 1950 he received the additional charge of Director of the Punjabi Department. His thesis on Afghan warlord Ahmad Shah Durrani earned him the degree of Doctor of Philosophy (PhD) from the Punjab University, Chandigarh, in 1954, as well as much applause from scholars and historians, including Maulana Abul Kalam Azad.\nGanda Singh was principal of the Khalsa College, Patiala, when he was invited by the Punjabi University, Patiala, to organize its Department of Punjab Historical Studies. in 1965, he set up Punjab History Conference. In 1967, he launched the University's journal, the biannual The Panjab Past and Present, of which he was the editor.\nHe was nominated member of Punjab Regional Committee for the Survey of Historical Records, Government of Punjab, Lahore, and of Indian Historical Records Commission, Government of India. He was secretary of the Committee for the History of Freedom Movement in PEPSU, Patiala, and chairman of the Regional Records Survey Committee for History of Freedom Movement, Shimla/Patiala, from November 1957 to December 1962. He held membership of The Asiatic Society, Calcutta, Indian Institute of Historical Studies, Calcutta, Royal Asiatic Society of Great Britain and Ireland and Bharat Itihas Sanshodhak Mandal, Pune. He presided over the medieval section of Punjab History Conference session of the Institute of Historical Studies, Calcutta, held at Shillong in 1974 as well as over its 13th session held at Panaji (Goa) in 1975. In 1974, he presided the 35th session of Indian History Congress at Jadavpur.\nAwards\nThe Government of India honoured him with Padma Bhushan award in 1984. However, he returned this award to protest the government's actions during Operation Blue Star.\nHe had two honorary degrees of Doctor of Letters awarded to him, by Aligarh Muslim University on 19 December 1964 and by Punjabi University on 25 February 1978.\nThe Punjab Government invested him with the Award for Literature on 31 March 1963. On 28 March 1964, the Shiromani Gurdwara Parbandhak Committee officially commended him. \"Sikh Educational Conference\" honoured him during its 52nd annual session held at Kanpur on 25–27 October 1974, and Punjabi University, Patiala, at the annual session of the Punjab History Conference held during November 1976. The University also brought out during the same year an anthology, Essays in Honour of Ganda Singh, edited by his old pupil Professor Harbans Singh. The Indian History Congress during its Silver Jubilee session held at Panaji (Goa) on 27 November 1987 honoured him as one of the five distinguished historians of India.\nDeath\nGanda Singh died at Patiala on 27 November 1987.\nLegacy\nHe donated his entire personal collection of rare books, maps, documents and manuscripts, which occupied several rooms of his modest residence on the Lower Mall at Patiala, to Punjabi University, Patiala. His knowledge and grasp of the Persian language allowed him to analyze many historical Persian works that were previously unknown or inaccessible to scholars of Sikhism due to the language barrier.\nBibliography\nSource:\nResearch papers, articles, and books in English\n* Proceedings of The Indian Historical Records Commission\n* The Persian Akhbars in The Alienation Office, Poona (Vol. 16, 1939)\n* Some New Light on the Treaty of Bhyrowal (16 December 1846) thrown by the private letters of Sir Henry Hardinge (Vol. 17, 1940)\n* Nanak Panthis or The Sikhs and Sikhism of the 17th Century (Vol. 19(2); August 1940; pp 195–219)\n* Last Days of Guru Gobind Singh (Vol. 20(1); April 1941; pp 120–32)\n* Akhbarat-I-Lahaur-o-Multan (Vol. 21 December 1944)\n* The Punjab News in the Akhbar-I-Darbar-I-Mualla (Vol. 24, February 1948)\n* The Journal of Indian History\n* Some Correspondence of Maharaja Duleep Singh (Vol. 27(1); April 1949; pp 1-23)\n* The Origin of the Hindu-Sikh Tension in The Punjab (Vol. 39(1); April 1961; pp 119–23)\n* Three Letters of Maharani Jind Kaur (Vol. 42(1); April 1964; pp 265–80)\n* Social and Religious Movements in the Punjab in the Nineteenth and Twentieth Centuries - Dr. S.P. Sen (Ed.) Dr. Ganda Singh (Author)\n* A Brief Account Of The Sikhs, Guru Gobind Singh's Death at Nanded - An Examination Of Succession Theories\n* A Diary Of The Partition Days 1947, The Panjab in 1839–40: Selections from the Punjab Akhbars\n* History of The Gurdwara Shahidganj, Lahore, From its Origin To November 1935 Compiled From Original Sources, Judicial Records and Contemporary Materials\n* Importance Of Hair And Turban To The Sikhs - Dr. Ganda Singh Tract No. 396,\n* Some Confidential Papers of The Akali Movement\n* Life of Banda Singh Bahadur Based on Contemporary and Original Records\n* Maharaja Duleep Singh Correspondence (History of the Freedom Movement in the Punjab Volume III)\n* Punjab Intelligence, etc. preserved in the National Archives of India, New Delhi\n* The Indian Mutiny of 1857 and the Sikhs\n* The Sikhs and Their Religion, Bhagat Lakshman Singh Autobiography - Dr. Ganda Singh (Edited and Annotated), Dr. Ganda Singh Memorial Trust, Gurmat Parkash, SGPC, Amritsar.\nBooks in Punjabi\n* Guru Gobind Singh Ji di Bani Vich Karam-Yog; January 1997\n* Kukian di Vithya Vol.1, Afghanistan da Safar, Amarnama (Pharsi Mool, Panjabi Utara tey Arth) Dr. Ganda Singh (Ed.)\nBibliographies\n* A Bibliography of Patiala and East Panjab States Union\n* Bibliography Of Sikh Religious And Historical Literature\n* Guru Nanak's Works: A Bibliography\n* The National Bibliography of Indian Literature (1901–1953) Vol. 3 (Panjabi)\nSee also\n* Sikh Studies\nReferences"
    }
  ]
}