{
  "content": [
    {
      "type": "text",
      "text": "# Gandhi Peace Award\n\nThe Gandhi Peace Award is an award and cash prize presented annually since 1960 by Promoting Enduring Peace to individuals for \"contributions made in the promotion of international peace and good will.\" It is named in honor of Mohandas Karamchand Gandhi, but has no personal connection to Mohandas Gandhi or his family.\nRecent award winners include Tom B.K. Goldtooth (2015), Kathy Kelly of Voices for Creative Nonviolence (2015), Omar Barghouti (2017), Ralph Nader (2017), Jackson Browne (2018), Dr. Zaher Sahloul of MedGlobal, and Mayson Almisri, a leader of the Syrian White Helmets (2020), and Kali Akuno, co-founder of Cooperation Jackson in Jackson, Mississippi (2023).\nSince 1960, when the first award was accepted by Eleanor Roosevelt, the award has been presented in person to \"peace heroes\" who have exemplified to the members of Promoting Enduring Peace the courage of nonviolent resistance to abusive power, to armed conflict, to violent oppression, and to environmental negligence. The award is also intended to recognize individuals for having made significant contributions, through cooperative and non-violent means in the spirit of Gandhi, to the struggle to achieve a sustainable world civilization founded on enduring international peace.\nIn the 21st century the award is especially intended by its presenters to honor those whose lives and works exemplify the principle that international peace, universal socioeconomic justice, and planetary environmental harmony are interdependent and inseparable, and all three are essential to the survival of civilization.\nThe award itself is symbolized by a heavy medallion and a certificate with an inscription summing up the recipient's work. The medallion, forged from Peace Bronze (a metal rendered from decommissioned nuclear missile command systems, evoking \"swords into plowshares\"), features Gandhi's profile and his words \"Love Ever Suffers/Never Revenges Itself\" cast in bronze. The award has been presented at a ceremony held typically once a year in New York or New Haven at which the recipient is invited to present a message of challenge and hope.\nHistory\nThe Gandhi Peace Award was conceived by the founder of Promoting Enduring Peace, Yale Professor Jerome Davis. Davis first proposed the award to the board of Promoting Enduring Peace on 13 March 1959, with the name intended to pay tribute to the modern era's foremost advocate of nonviolent resistance, and partly to help rectify the failure of the Nobel Committee to award its Peace Prize to Gandhi before his death in 1948. The award has been issued since 1960, when it was first presented to Eleanor Roosevelt, and consists of a certificate, a ceremony, and the presentation of a bronze medallion inscribed with a quotation by Gandhi: \"Love Ever Suffers / Never Revenges Itself.\" A prominent New York sculptor, Don Benaron/Katz, was commissioned to create a work of art to serve as the symbol of the award. He researched Gandhi at the library of the India House in New York City and by 1960 had carved a striking bas-relief portrait in wood of the founder of the century’s international movement for nonviolent change. He wrote of the medallion he also created, “I carved the Gujarati word for peace on one side, and on the other a symbolic plowshare and pruning hook inspired by Isaiah 2:4...″\n::They shall beat their swords into plowshares\n::and their spears into pruning hooks;\n::nation shall not lift up sword against nation,\n::neither shall they learn war any more.\nSince 2011 the award has included a cash prize. The presentation ceremony is held in New Haven, Connecticut, USA. At present the laureates are and have been North Americans and British subjects. A book about the award from its inception through 1997, '''In Gandhi's Footsteps: The First Half Century of Promoting Enduring Peace', was written and published by James Clement van Pelt.\nNotable laureates\nIn 1989 the award was presented to Cesar Chavez, founder of the United Farm Workers of America, for his use of nonviolent tactics, including a national consumer boycott, to improve the conditions and compensation for migrant farm workers. (His acceptance speech may be viewed [https://www.youtube.com/watch?v=lwhFSrwuE-s here].)\nIn 2011 the award was presented to Rabbi Ehud Bandel and Rabbi Arik Ascherman for their leadership of Rabbis for Human Rights and its nonviolent resistance to the persecution of Palestinians in the occupied territories. (Their acceptance speeches may be viewed [https://www.youtube.com/watch?v=RIQUNudM2AU here].)\nIn 2012 the award was presented to Amy Goodman for her contribution to promoting a sustainable peace through the promotion of transparently truthful journalism—one essential part of which is to report the true nature and long-term after-effects of war. Goodman is an internationally known broadcast journalist, syndicated columnist, investigative reporter, author, and the anchor and co-founder of Democracy Now!, an independent global news program broadcast daily on radio and television and via the Internet. (Her acceptance speech may be viewed [https://www.youtube.com/watch?v=OavBdSh30LE here].)\nThe 2013 award was presented to Bill McKibben who is one of the most well-known leaders of the environmentalist movement in the United States. His first book was The End of Nature published in 1989. An activist and journalist, his work has appeared in The Atlantic Monthly, Harper's Magazine, Mother Jones, and Rolling Stone''. (His acceptance speech may be viewed [https://www.youtube.com/watch?v=Kv5NTCFxjrU here].)\nPromoting Enduring Peace announced in January 2014 that the Gandhi Peace Award for that year would be received by Medea Benjamin.\nIn 2015 the award was presented to Tom B.K. Goldtooth and Kathy Kelly.\nIn 2017 the laureates were Ralph Nader and Omar Barghouti.\nThe laureate in 2018 was Jackson Browne. He is the first artist to receive the award.\nLaureates\n{| width=\"100%\"\n| width=\"33%\" valign=\"top\"|\n* Eleanor Roosevelt (1960)\n* Edwin T. Dahlberg (1960)\n* Rabbi Maurice Eisendrath (1961)\n* John Haynes Holmes (1961)\n* Linus C. Pauling (1962)\n* James Paul Warburg (1962)\n* E. Stanley Jones (1963)\n* Martin Luther King Jr. (1964)*\n* A.J. Muste (1966)\n* Norman Thomas (1967)\n* Jerome Davis (1967)\n* William Sloane Coffin Jr. (1967)\n* Benjamin Spock (1968)\n* Wayne Morse (1970)\n* Willard Uphaus (1970)\n* U Thant (1972)\n* Daniel Berrigan (1974)**\n| width=\"33%\" valign=\"top\"|\n* Dorothy Day (1975)\n* Daniel Ellsberg (1976)\n* Peter Benenson and Martin Ennals (1978)\n* Roland Bainton (1979)\n* Helen Caldicott (1980)\n* Corliss Lamont (1981)\n* Randall Watson Forsberg (1982)\n* Robert Jay Lifton (1984)\n* Kay Camp (1984)\n* Bernard Lown (1986)\n* John Somerville (1987)\n* César Chávez (1989)\n* Marian Wright Edelman (1990)\n* George McGovern (1991)\n* Ramsey Clark (1992)\n* Lucius Walker (1993)\n* Roy Bourgeois (1994)\n| width=\"33%\" valign=\"top\"|\n* Edith Ballantyne (1995)\n* Alan Wright and Paula Kline (1996)\n* Howard and Alice Frazier (1997)\n* Michael True (2002)\n* Dennis Kucinich (2003)\n* Adrienne van Melle-Hermans (2003)\n* Karen Jacob and David Cortright (2004)\n* Ehud Bandel and Arik Ascherman (2011)\n}}\nExternal links\n*"
    }
  ]
}