{
  "content": [
    {
      "type": "text",
      "text": "# Gareth Wardlaw\n\n| birth_place = Kirkcaldy, Scotland\n| position = Forward\n| years1 = 2004–2008 | caps1 = 92 | goals1 = 24 | clubs1 = Ayr United\n| years2 = 2008–2009 | caps2 = 20 | goals2 = 2  | clubs2 = Raith Rovers\n| years3 = 2009–2010 | caps3 = 31 | goals3 = 16 | clubs3 = Cowdenbeath\n| years4 = 2010–2011 | caps4 = 23 | goals4 = 3  | clubs4 = St Mirren\n| years5 = 2011–2012 | caps5 = 25 | goals5 = 2  | clubs5 = Ayr United\n| years6 = 2012–2013 | caps6 = 15 | goals6 = 4  | clubs6 = East Fife\n| years7 = 2013–2014 | caps7 =    | goals7 =    | clubs7 = Hill of Beath Hawthorn\n| club-update = 22:10, 29 July 2014 (UTC)\n}}\nGareth Wardlaw (born 7 March 1979) is a Scottish former footballer, who retired after last playing for Hill of Beath Hawthorn in the Scottish Junior Football Association, East Region. He previously played in the Scottish Premier League for St Mirren. He also played for Ayr United, Raith Rovers, Cowdenbeath and East Fife.\nCareer\nAfter many years in amateur and Junior football, Wardlaw started his senior career at Ayr United in 2004, signing from Burntisland Shipyard. He made 111 appearances and scored 28 goals for the club in all competitions. Wardlaw signed for his hometown club Raith Rovers on 29 May 2008. Wardlaw started the season well but then suffered a horrific injury in a game against East Fife. After returning from injury Wardlaw struggled to get a place in the starting line-up, and ended up making only 13 appearances, scoring only 2 goals, eventually being released at the end of the 2008–09 season.\nFollowing his departure from Raith Rovers, Wardlaw signed on at their neighbours Cowdenbeath and was a regular starter in the line-up that season making 38 appearances and scoring 19 goals in all competitions.\nIn July 2010, St Mirren agreed a deal with Cowdenbeath to sign Wardlaw after agreeing compensation of around £45,000. Wardlaw followed manager Danny Lennon in signing for the Paisley club from Cowdenbeath. This meant he became a full-time professional for the first time at the age of 31 when he signed for St Mirren, giving up a career as a postman. He scored his first goal for the club in a 3–1 defeat against Motherwell on 2 October 2010 and his second, again against Motherwell on 20 November 2010. His goal against Aberdeen at Pittodrie on 10 May gave St Mirren a 1–0 victory, which not only kept the club in the SPL, but gave them their first victory away against Aberdeen since 1987. He was released by the club at the end of the 2010–11 season.\nOn 28 June 2011, Wardlaw re-joined Ayr United. He was released by Ayr on 29 April 2008. On 9 June 2012, Wardlaw signed for East Fife.\nWardlaw joined Junior side Hill of Beath Hawthorn in June 2013. In the summer of 2014, Wardlaw retired from football.\nReferences\nExternal links\n*"
    }
  ]
}