{
  "content": [
    {
      "type": "text",
      "text": "# Garibaldi Monument in Taganrog__disambig_1\n\nA monument of Italian general and nationalist Giuseppe Garibaldi, one of the leaders of Italian unification, is located in Taganrog, one of the largest ports in Russia. Built in 1961, the monument commemorates Garibaldi's visit to Taganrog in April 1833, and it celebrates the friendship between Italy and Russia.\nVisit of Giuseppe Garibaldi to Taganrog\nIn April 1833, Garibaldi travelled to Taganrog, in the Russian Empire, aboard the schooner Clorinda with a shipment of oranges. During ten days in port, he met Giovanni Battista Cuneo from Oneglia, a politically active immigrant and member of the secret Young Italy movement of Giuseppe Mazzini. Mazzini was a passionate proponent of Italian unification as a liberal republic via political and social reform.\nHistory of the Monument\nIn 1961 Taganrog paid the tribute to the staying of Garibaldi with one of the downtown streets named after him (Ulitsa Garibaldi), and with an obelisk in honour of Garibaldi not far from the seaport where stood his schooner Clorinda.\nThe obelisk is a 5-meter high stella representing the flying banner. The description on the backside reads: In 1833, Giuseppe Garibaldi took an oath of dedicating his life to liberation and unification of his Homeland – Italy. Under leadership of the national hero Giuseppe Garibaldi, the country was liberated and unified. On the front side, it says: In the person of Garibaldi Italy had a hero of antique kind, who was capable of producing miracles and who produced miracles (Friedrich Engels).\nThe obelisk in honour of Garibaldi's visit to Taganrog was inaugurated on June 2, 1961, for the centenary of Italy's liberation. The local artist Yakovenko realized the project of the monument. The bas-relief (Italian hero's profile and a palm branch) was produced by the artist Baranov. In 1986, the bas-relief was replaced due to technical reasons and a new bas-relief by the artist Beglov was installed.\nThe photograph of the Taganrog's Giuseppe Garibaldi monument was displayed at the exhibition \"Hero of Two Worlds: Monuments to Garibaldi Across the World\" that opened at the Garibaldi-Meucci Museum in New York City on July 21, 2007.\nSeptember 12, 2007, a new renovated Giuseppe Garibaldi monument was unveiled during celebrations of the \"City Day\" and within the program of the events dedicated to Giuseppe Garibaldi bicentenary in Taganrog. Annita Garibaldi-Jallet, granddaughter of the Italian revolutionary and representatives of the Italian embassy in Moscow participated in the event.  The quotation from Friedrich Engels was removed from the front side, the description on the back side remained unchanged.\nThis is the only monument in honour of Giuseppe Garibaldi in the former Soviet Union.\nOld and Modern Views of the Garibaldi Monument in Taganrog\nImage:Garibaldi Taganrog.jpg|The Giuseppe Garibaldi Monument in the city of Taganrog in 2006.\nFile:Garibaldi Taganrog Plaque 1.jpg|Memorial plaque on the backside of the Giuseppe Garibaldi's monument, featuring a quotation from Friedrich Engels (in 2007)\nFile:Garibaldi Taganrog Plaque2.jpg|Memorial plaque on Garibaldi monument in Taganrog. Removed in 2008 during the reconstruction of the monument. Photograph taken in 2007.\nFile:Garibaldi monument2007.jpg| The Garibaldi Monument in 2008.\nReferences\n;Notes\n;Sources\n* The Taganrog Encyclopaedia, 2nd edition, 2003\n* materials of the Taganrog State Archive and Taganrog Local Government\n* \"Таганрогская Правда\" No.22 (153-155) 2-8/06/2006 г. стр.14 \"Историческая встреча\""
    }
  ]
}