{
  "content": [
    {
      "type": "text",
      "text": "# Garners Beach, Queensland\n\n| pop                 = 31\n| pop_year            =\n| pop_footnotes       =\n| established         =\n| postcode            = 4852\n| area                = 2.9\n| timezone            = AEST\n| utc                 = +10:00\n| dist1               = 12.4\n| dir1                = E\n| location1           = El Arish\n| dist2               = 29.4\n| dir2                = NE\n| location2           = Tully\n| dist3               = 47.9\n| dir3                = SSE\n| location3           = Innisfail\n| dist4               = 135\n| dir4                = S\n| location4           = Cairns\n| dist5               = 1576\n| dir5                = NNW\n| location5           = Brisbane\n| lga                 =Cassowary Coast Region\n| stategov            =Hill\n| fedgov              =Kennedy\n| near-n              =Kurrimine Beach\n| near-ne             =Kurrimine Beach\n| near-e              =Coral Sea\n| near-se             =Coral Sea\n| near-s              =Bingil Bay\n| near-sw             =Bingil Bay\n| near-w              =Midgeree Bar\n| near-nw             =Midgeree Bar\n}}\nGarners Beach is a coastal locality in the Cassowary Coast Region, Queensland, Australia. In the , Garners Beach had a population of 31 people.\nGeography\nThe Coral Sea forms the eastern boundary and part of the northern boundary.\nGarners Beach has the following beaches (from north to south):\n* Garners Beach ()\n* Brookes Beach (), extending south into Bingil Bay\nHistory\nThe suburb presumably takes its name from the beach, which in turn was named after pioneer settler Edward Garner who took up land there in 1890. He grew bananas and later established a refreshment room for visitors.\nIn 1928, Mr Garner's Beach was described as an excellent place for fishing and viewing coral.\nBy September 1937, Garners Beach Road had been was built to access the beach, leading to increased use by motor cars. It also facilitated a motor launch service to Garners Beach to link with a motor lorry service to El Arish for deliveries.\nDuring World War II, the district was used as a practice firing range by the military.\nDemographics\nIn the , Garners Beach had a population of 25 people.\nIn the , Garners Beach had a population of 31 people.\nHeritage listings\nGarners Beach has the following heritage sites:\n* Garners Beach Road (): Garners Beach Burial Ground\nEducation\nThere are no schools in Garners Beach. The nearest government primary school is El Arish State School in El Arish to the west. The nearest government secondary school is Tully State High School in Tully to the south-west.\nReferences\nFurther reading\n*\nExternal links"
    }
  ]
}