{
  "content": [
    {
      "type": "text",
      "text": "# Garter Principal King of Arms__disambig_1\n\nGarter Principal King of Arms (also Garter King of Arms or simply Garter) is the senior king of arms and officer of arms of the College of Arms, the heraldic authority with jurisdiction over England, Wales and Northern Ireland. The position has existed since 1415.\nGarter is responsible to the Earl Marshal for the running of the college. He is the principal adviser to the sovereign of the United Kingdom with respect to ceremonial and heraldry, with specific responsibility for England, Wales and Northern Ireland, and, with the exception of Canada, for Commonwealth realms of which Charles III is the sovereign. He also serves as the king of arms of the Order of the Garter and his seal and signature appear on all grants of arms made by the college.\nOn the death of the British monarch it is Garter's duty to proclaim the new monarch. Initially, the Accession Council meets at St James's Palace in central London to declare the new monarch from the deceased monarch's line. Once the new monarch has made a sacred oath before the council, Garter King of Arms steps out into the Proclamation Gallery which overlooks Friary Court to proclaim the new monarch.\nThe current Garter Principal King of Arms is David White.\nHistory\nFoundation\nWilliam Bruges, the first Garter King of Arms, held the office by 1417. The exact date of his appointment is not known and no record of it survives. John Anstis discovered a royal warrant under the Privy Seal dated 22 May in the fifth year of the reign of Henry V (1417) wherein Bruges is called by his previous title, Guyenne King of Arms; the warrant orders that another be passed under the Great Seal of the Realm protecting Bruges while he travelled abroad with the king. Anstis then outlines two further pieces of evidence: (1) an instrument of 1422 or 1423 by which Bruges settled pension arrangements with the knights in which it is stated that he was appointed Garter at a previous full chapter meeting, and (2) a decree by Thomas of Lancaster, Duke of Clarence dated either 3 or 13 September 1417 which mentions \"Garretier Roy d'armes des Anghis\" As Henry V left for France on 27 July 1417, it can be deduced that Bruges must have been appointed in late July of that year.\nThis was accepted until Hugh Stanford London published evidence which appeared to date Bruges' appointment two years earlier than Anstis suggested. William Bruges' father, Richard, left a will dated 4 July 1415 and split into two parts: a testament dealing with his burial, charitable bequests and legacies to his wife, and a voluntas, which dealt with personal bequests. Although the testament (recorded in the London registry) makes no mention of anyone other than Richard's wife, the voluntas (copied in Archbishop Henry Chichele's registers) makes mention of his children. Reference is made to his son William, variously called \"Gien\", \"Gyen\" and \"Gartere\", and William's wife, called \"Agnes Garter\". The other register entries around the voluntas date to 1418 and 1419, so E. F. Jacob, the editor of a printed version of the register, suggests that the references to Garter may be a later gloss. But, Stanford London argued that later annotations would be consistent and refer to him as either Garter and Guyenne or simply Garter throughout, while Agnes would not have been called just Garter if it were a gloss. Instead, he suggests that Richard forgot to call his newly appointed son Garter at first and later included it alongside his old title in the will.\nCriticising this point, Peter Begent finds no reference to Bruges being called anything but Guyenne or the equivalent title of Aquitaine King of Arms in records between 1415 and 1417, which is problematic for Stanford London's position. He argues that it is entirely possible that, if not a gloss, the voluntas was edited after 1415 as Richard Bruges included more bequests to his family.\nLater history\nThe Garter Principal King of Arms was placed by King Henry V over all the whole body of heralds.\nHe may be said to have two distinct capacities united in his person, one relative to the Order of the Garter, the other as head of the College of Arms, and on this account he not only takes an oath in a chapter of the Garter, before the Sovereign and Knights, but as king at arms another oath before the Earl Marshal, and therefore he is styled both principal officer of arms of the most noble order of the Garter and principal king of English arms.\nHe has power to appoint a herald for his deputy: he must be a native of England and a gentleman bearing arms. It was anciently held that he was to be neither a knight nor a clergyman; but there has been one instance of a Garter having been a foreigner; and since the reign of Henry VII many of them have received knighthood: one was created a knight of the Bath. The office entitles him to the privilege of correcting errors or usurpations in all armorial bearings, to grant arms to such who deserve them, to present to the House of Lords a genealogy of every new peer, to assign his place in the chamber of parliament and to give him and the knights of the Bath supporters.\nCoat of arms\nThe official arms of the Garter Principal King of Arms were in use by around 1520. They are Argent a Cross Gules on a Chief Azure a crown enclosed in a Garter between a lion passant guardant and a fleur de lis all Or.\nFunding\nIn addition to the official annual salary paid by the Crown of £49.07, HM Treasury pays Garter King of Arms for work undertaken for the Government. As of 27 January 2021, the payments made to Thomas Woodcock, since his appointment as Garter totalled £651,515.  Additionally, since 2018, the Treasury has provided Garter with an expenses fund of £35,000 per annum to cover business expenses such as secretarial support, cleaning and postage. As of 27 January 2021, Garter has received £74,579.02 to cover expenses.\nHolders of the office\nPortraits\nFile:William Bruges Garter King of Arms.jpg|An illuminated manuscript from around 1430 showing William Bruges, the first Garter King of Arms, kneeling before St George. He was appointed in 1415 or 1417.\nFile:Garter Edward Walker Picture.jpg|Sir Edward Walker, who was Garter during the interregnum.\nFile:Wenceslas Hollar - William Dugdale (State 5) cropped.jpg|Sir William Dugdale, one of England's leading antiquaries, was Garter between 1677 and his death in 1686. As a King of Arms, he conducted visitations to 10 English counties.\nFile:John Anstis Garter.jpg|John Anstis, Garter from 1719 to 1744\nFile:Stephen Martin Leake.jpg|Stephen Martin Leake, a noted numismatist, served as Garter for over 18 years (1754–73). Interested in heralds' privileges, he unsuccessfully campaigned for a revival of their visitations.\nFile:Ralph Bigland.jpg|Although briefly Garter between 1780 and 1784, Ralph Bigland was a late starter and quick riser, beginning his adult life as a cheesemonger. He is best remembered for his enormous collection of Gloucestershire memorial inscriptions.\nFile:SirAlbertWoods.jpg|Sir Albert Woods served as Garter for nearly 35 years, between 1869 and 1904, but old age forced him to delegate many of his Coronation duties to other heralds in 1902.\nList\n{| class=\"wikitable\"\n! Arms\n! width=150pt|Name\n! Dates of office\n! Notes\n! Ref\n|-\n|\n!William Bruges\n|By September 1417 – 9 March 1450\n|The son of Richard Bruges, Lancaster King of Arms, Bruges was appointed Chester Herald in 1398, making him part of the household of Henry, Prince of Wales and Earl of Chester (later Henry V); he was employed by Henry IV between 1407 and 1410. In 1413, he was appointed Guyenne King of Arms and travelled with the King on his campaign at Agincourt in 1415; he was entrusted with a number of diplomatic responsibilities and bore the title Aquitaine King of Arms interchangeably with Guyenne. As Garter, he officiated at Henry V's funeral and was frequently occupied with diplomatic missions under Henry VI. He attended the English heralds' first chapter meeting in 1421 and was responsible for drafting the first armorial of the Order of the Garter in 1430.\n|\n|-\n|\n!John Smert\n|3 April 1450 – before 6 July 1478\n|The parentage and origins of John Smert are not known, although he did hold land in Gloucestershire and was possibly a lawyer. He married a daughter of William Bruges, Garter, and may have been the Guyenne King of Arms mentioned in 1444 and sent on diplomatic duties in 1449; he was certainly Guyenne by the time he was appointed Garter. Smert was employed on a number of diplomatic missions, including his attendance at Princess Margaret's marriage to Charles the Bold of Burgundy in 1468 and a Garter mission to Burgundy the following year.\n|\n|-\n|\n!John Writhe (or Wrythe)\n|6 July 1478 – March or April 1504\n|The ancestry of John Wrythe is not known, but he was likely the son of William Wrythe, a receiver of the Duke of Somerset and briefly Member of Parliament for Cricklade. A draper and citizen of London, the younger Wrythe was also said to have been Antelope and Rouge Croix Pursuivant, but this is dismissed by modern scholars; he was definitely Faucon Herald by 1474 and was appointed Norroy King of Arms in 1477. He took part in the funeral of Edward IV and coronation of Richard III, who confirmed him as Garter in 1483, but he resigned on 4 January 1485. He resumed his office at the accession of Henry VII, which was confirmed by a patent of 13 February 1486. Wrythe was sent on diplomatic missions to Scotland, Ireland, Brittany, Calais, Burgundy and Maximilian I, Holy Roman Emperor. He produced a \"magnificent\" book containing many pedigrees and drawings of arms belonging to Knights of the Garter.\n|\n|-\n|\n!Sir Thomas Wrythe alias Wriothesley\n|26 January 1505 – 15 November 1534\n|The elder of son John Wrythe, Garter, Wriothesley was made Wallingford Pursuivant and entered the service of Prince Arthur and then Prince Henry. As Garter, he attended Henry VIII at Thérouanne, the Field of the Cloth of Gold and Calais, and was sent on Garter missions to Guidobaldo II della Rovere, Duke of Urbino, Philip of Castile, Ferdinand of Austria and Francis I of France. Otherwise, he concerned himself with domestic matters including the funeral of Henry VII, the coronation of Henry VIII and the Westminster Tournament of 1511. He also effectively monopolised the granting of arms and was allowed to carry out visitations, although another herald was permitted to conduct them independently in 1530. Wriothesley's workshop produced ''Prince Arthur's Book, the Westminster Tournament Roll and the Parliament Roll of 1512, alongside numerous pedigrees, rolls of arms and books on heraldry.\n|\n|-\n|\n!Thomas Wall\n|9 December 1534 – 27 June 1536\n|The son of Thomas Wall, Norroy, the younger Wall was appointed Rouge Croix in 1521 and Windsor in 1525. He was engaged on a number of diplomatic missions during the 1520s and 1530s to France, Italy and Austria, as well as a Garter mission to James V of Scotland in 1535. He also compiled Wall's Book of Arms'' (College MS Anstis 679) in 1530 and an alphabet of arms in the college's manuscript collection (MS L. 1).\n|\n|-\n|\n!Sir Christopher Barker\n|15 July 1536 – 2 January 1550\n|Barker's father was from Stokesley in Yorkshire, and his mother from a Newcastle family called Carlill or Carlisle; one of his uncles was Christopher Carlill, Norroy King of Arms. He was in Charles Brandon, 1st Duke of Suffolk's service as Lisle Pursuivant (c. 1513) and then Suffolk Herald (c. 1517), before being appointed Richmond Herald at the college in 1522 and Norroy in June 1536. He was attached to foreign missions between 1514 and 1544, the early instances with the Duke of Suffolk and later including work with the English embassy in Spain and at the peace talks at Cambrai in 1529. He also oversaw the funeral of Henry VIII and the coronation of Edward VI and managed to maintain reasonably friendly relations with the provincial Kings of Arms.\n|\n|-\n|\n!Sir Gilbert Dethick\n|29 April 1550 – 3 October 1584\n|Dethick claimed descent from Derbyshire gentry, but this is unlikely; for his father was a German-born armourer made a denizen by Henry VIII. He may have been in royal service before his first appointment at the college, as Hampnes Pursuivant, in 1536; promotions to Rouge Croix (1540) and Richmond (1541) followed and in 1547 he became Norroy King of Arms. He was a member of the original Society of Antiquaries and was often sent on missions abroad as a herald. He travelled with Lord Protector Somerset to Scotland in 1549 and was nearly shot at Musselburgh; in England, he was sent to force the surrender of rebels led by Robert Kett. Described as a \"sound\" genealogist, he also made 140 grants of arms as Garter and secured the college's future home at Derby Place from Queen Mary.\n|\n|-\n! colspan=\"5\" align=\"center\" | Vacant between 1584 and 1586; Robert Cooke, Clarenceux, acted as Garter\n|-\n|\n!Sir William Dethick\n|21 April 1586 – 10 December 1606 (dismissed)\n|The second son of Sir Gilbert Dethick, Garter, William Dethick was educated at St John's College, Cambridge. His father also tutored him and secured his appointment as Rouge Croix Pursuivant in 1567; he succeeded him as Garter and bribed the signet clerks to include a clause in his patent allowing him to make visitations, arousing tension with the provincial kings. A new patent was eventually regranted, removing the rights, but Dethick garnered controversy for verifying false pedigrees, his poor behaviour and quarrelling with fellow heralds. He had treasonously supported the marriage proposal of Mary, Queen of Scots, and Thomas Howard, 4th Duke of Norfolk, but Elizabeth I forgave him and it eventually earned him the support of James I. His critics and enemies put enough pressure on the King, however, for Dethick to be dismissed in 1604; although defiant, he backed down and accepted an annuity two years later, before dying in 1612.\n|\n|-\n|\n!Sir William Segar\n|17 January 1607 – 10 or 13 December 1633\n|Segar's parentage cannot be confirmed, but he was of Dutch origin and trained as a scrivener. He was appointed Portcullis Pursuivant in 1585 and Somerset Herald three years later, before Norroy King of Arms in 1597 (patent 1602). He sided with Garter Dethick against successive Clarenceux Kings of Arms, before being appointed Deputy Garter in 1603. He was appointed Garter in January 1604, but could not obtain a patent until Dethick finally resigned in 1607. One of Segar's rivals, Ralph Brooke, tricked him into confirming a false coat of arms to a pretend gentleman in 1616; James I had them both imprisoned for several days. Segar authored at least 13 manuscript and printed works, and has been described as a \"conscientious herald and a formidable scholar\", but like many of his contemporaries, \"he authorized many pedigrees giving most improbable descents from fabulous ancestors\".\n|\n|-\n|\n!Sir John Borough\n|27 December 1633 – 21 October 1643\n|Borough's maternal grandfather was a Brabanter, but parents lived at Sandwich in Kent. He was part of Sir Francis Bacon's household by 1618, and a Member of Parliament for Sandwich (1621) and Horsham (1624–26). By his first marriage, he was connected with Sir Robert Cotton, who may have helped his appointment as Keeper of the Records in the Tower of London in 1623; when Bacon fell from power, it may have been Cotton who assisted Borough in obtaining Thomas Howard, 14th Earl of Arundel's patronage and he entered the College as Mowbray Herald Extraordinary in 1623. Later that year, he was appointed Norroy King of Arms. He accompanied Charles I on his trip to Scotland in 1633 and was ambassador to Ferdinand II, Holy Roman Emperor in 1636. Despite being highly regarded in his lifetime for his antiquarian knowledge, Borough wrote only one book: The Soveraignty of the British Seas.\n|\n|-\n|\n!Sir Henry St George the elder\n|6 April 1644 – 5 November 1644\n|The son of Sir Richard St George, Clarenceux King of Arms, details of Henry St George's early life and education are absent. He was employed by the College in c. March 1609 and appointed Rouge Rose Pursuivant Extraordinary later that year. Promotion to Bluemantle Pursuivant followed in 1611 and Richmond Herald in 1618 before he was promoted to Norroy King of Arms in 1653. As Richmond, he travelled to France with William Le Neve and was Segar's deputy on a Garter mission to Sweden in 1627. He was suspended for forging a grant of arms in 1639, but pardoned in 1640; during the Civil War, he travelled with Charles I to Oxford and is said to have received a Doctorate in Medicine from the University there (1643).\n|\n|-\n|\n!Sir Edward Walker\n|26 February 1645 – 10 February 1677\n|Walker was a native of Somerset and entered the Office of Purveyance before he was employed by the Earl of Arundel in 1633; he was then appointed Blanch Lyon (1635) and Rouge Dragon Pursuivants (1637), Chester Herald (1638) and Norroy King of Arms (1644). He was also Secretary at War against the Scots in 1639 and, a royalist, he attended Charles I during the Civil War, serving in a number of posts, including Secretary for War. After the royalist defeats at Naseby, Newark and Oxford, Walker went to France but returned as Charles I's chief secretary during the failed negotiations at Newport. After the King's execution, he travelled with Charles II in exile, who confirmed him as Garter in 1650. At the Restoration (1660), he displaced Sir Edward Bysshe, who had \"intruded\" in the office of Garter since . Walker controversially granted arms without reference to the provincial kings of arms and tried to unify their offices with his; he also clashed with the Earl Marshal, who forced the Kings of Arms to jointly issue grants from 1673. After his death, many of his collections came to the college; his account of Charles II's coronation was posthumously published in 1820.\n|\n|-\n|\n!Sir Edward Bysshe\n|Intruded , confirmed by Parliament 20 October 1646 – 1660 (deposed)\n|The eldest son of a Surrey gentleman, Bysshe was a Member of Parliament for Bletchingly, Reigate and Gatton. He was a Parliamentarian who took the covenant, intruded in Garter's office () and served on committees to regulate the heralds in 1641 and 1645. Parliament confirmed him as Garter on 20 October 1646 and as Clarenceux King of Arms in 1650. Although he resigned from the latter eight years later, he was re-appointed in 1661, shortly after he was deposed as Garter during the Restoration. According to Godfrey and Wagner, he was a good armourist; however, his visitations provide only brief accounts of the families concerned, and he neglected his duties, both parliamentary and heraldic, from the 1660s. Despite these failings, he had ensured that the college and its records remained open during the Interregnum, much to the benefit of antiquaries, including his colleague Sir William Dugdale.\n|\n|-\n|\n!Sir William Dugdale\n|26 April 1677 – 10 February 1686\n|The son of a Warwickshire clergyman, Dugdale was privately educated before attending a free school in Coventry and never went to university. His earliest antiquarian works were concerned with his native county, where, inspired and helped by other antiquaries, he collected material for a history. His talents earned him the respect of leading antiquarians, including Sir Henry Spelman, and as the Civil War developed, Dugdale travelled around England recording records, coats of arms and inscriptions in English cathedrals and churches. This work culminated in Monasticon Anglicanum, a work which helped to establish the use of charters as historical evidence; his other great works include The Antiquities of Warwickshire and The Baronage of England, which have helped to solidify his legacy as a great antiquarian. According to the Oxford Dictionary of National Biography, \"the scale of his operations was greater than any previous endeavour, and its achievements were astonishing\". Dugdale had been Blanch Lyon, Rouge Croix, Chester and Norroy before his Gartership and created, donated or contributed to a number of valuable heraldic and genealogical records at the college, in addition to the ten visitations he personally conducted.\n|\n|-\n|\n!Sir Thomas St George\n|11 March 1686 – 6 March 1703\n|Sir Thomas St George was the eldest son of Henry St George, Garter, but his early life and education are obscure. He was appointed Somerset Herald at the Restoration in 1660 and became Norroy King of Arms 20 years later. He served as a deputy for Sir Edward Walker on a Garter mission to Dresden in 1669. As Garter, he travelled to The Hague with the King in 1691, but appointed Gregory King as his deputy on all the other missions he should have made. He inherited his father's manuscript collections, and Peter Le Neve purchased his papers; they are now scattered, with a number in the British Library.\n|\n|-\n|\n!Sir Henry St George, the younger\n|16 June 1703 – 1715\n|The eighth son of Sir Henry St George, Garter, Henry the younger became Garter after appointments as Richmond (1660), Norroy (1677) and Clarenceux (1680). He was remembered by contemporaries as \"a timorous animal\" and \"incommunicative, sordid and of little learning\", but he visited 12 counties as Clarenceux and donated the profits from six towards the rebuilding of the college after the Great Fire of London. His manuscript collection was sold after his death and later sold again at auction; some have returned to the college, but most remain scattered in collections.\n|\n|-\n|\n!John Anstis the elder\n|2 April 1714 (reversionary) – 1744\n|Anstis was the son of the registrar of the archdeaconry of Cornwall. Educated at Exeter College, Oxford, he entered the Middle Temple in 1690 and became high steward of Cornish tinners two years later; he was called to the Bar in 1699 and conducted work for the House of Commons in 1701. He published Curia Militaris, a defence of the Earl Marshal's jurisdiction in the Court of Chivalry. In 1702 he was elected to Parliament for St Germains and tended to follow the Tory line, but declined to stand in 1705. He was nominated as Carlisle Pursuivant Extraordinary and Norfolk Herald Extraordinary in 1707, was re-elected to Parliament in 1711, appointed Keeper of the Record in 1712 and received a reversionary patent for Garter's office in 1714. He duly claimed Garter after St George's death, although John Vanbrugh was nominated instead and Anstis was then in prison as a suspected Jacobite. After a lengthy legal debate, he was confirmed as Garter on 20 April 1718, took his oath in April the next year and went on to oversee George II's coronation in 1727. His son John was jointly Garter with him from 1727.\n|\n|-\n|\n!John Anstis, younger\n|9 June 1727 (with father) – 5 December 1754\n|The seventh son of John Anstis, Garter, the younger Anstis was educated privately before matriculating at Corpus Christi College, Oxford, in 1725. Shortly afterwards, he was appointed genealogist to the Order of the Bath and he joined the College two years later as Blanc Coursier Herald. From 1727 he was jointly Garter with his father until the latter's death on 4 March 1744, after which he served alone. He was elected a Fellow of the Society of Antiquaries and received an LLD degree from Oxford University in 1749.\n|\n|-\n|\n!Stephen Leake\n|19 December 1754 – 24 March 1773\n|Leake was born Stephen Martin, the son of a naval officer from Essex; his maternal uncle, Admiral Sir John Leake, left his estate to Martin's parents on the condition that they adopt his surname, which they did in 1721. Despite this and work at the Navy Office, the family lost out in the South Seas crash and Leake was forced to find employment. After joining the Society of Antiquaries and publishing Nummi Britannici historia, he joined the College as Lancaster in 1727 and was promoted to Norroy in 1729 and Clarenceux in 1741. Leake was less interested in genealogy than in the rights and history of the heralds; he petitioned for the college to have a monopoly on the researching of arms and unsuccessfully tried to revive the visitations, a proposal which Anstis and the government opposed. He also opened the college's register for Dissenting and Jewish births and carried out two Garter missions. On his death, his collections passed to his brother, and they were eventually bought by the college.\n|\n|-\n|\n!Sir Charles Townley\n|27 April 1773 – 7 June 1774\n|Born at Tower Hill in London, Townley was the son of a merchant and educated at the Merchant Taylors' School from 1727. He bought his appointment as York Herald in 1735; he was promoted to Norroy in 1751 and Clarenceux in 1755, but, according to his predecessor Stephen Martin Leake, he received a large fortune around 1755 and neglected his heraldic duties thereafter. He was nonetheless knighted in 1761. A number of his collections are in the possession of the college, including transcribed memorial inscriptions.\n|\n|-\n|\n!Thomas Browne\n|15 August 1774 – 22 February 1780\n|A native of Derbyshire, Browne was a land surveyor who was said to have worked for the Duke of Norfolk and converted his favour into heraldic appointments; the Oxford Dictionary of National Biography records that he carried out works for John Warburton, Somerset Herald. He was successively appointed Blanch Lyon (1727), Bluemantle (1737), Lancaster (1744), Norroy (1761) and Clarenceux (1773) before his appointment as Garter. Despite his success as a surveyor, he was reputed to have known little of heraldry and neglected his duties at the college.\n|\n|-\n|\n!Ralph Bigland\n|2 March 1780 – 27 March 1784\n|Bigland was the son of a Middlesex tallow chandler whose ancestors have been traced to Westmorland and Lancashire. He was apprenticed to a cheesemonger in 1728 and, after 9 years service, he entered his own trade and carried out his practice for over 20 years. He travelled to the Low Countries and Scotland and supplied cheese to the allied armies during the War of the Austrian Succession; it was on these travels that he began noting down memorial inscriptions, a pursuit to which he would devote his life. He compiled a huge collection of inscriptions relating to Gloucestershire, where he travelled extensively from 1750 onwards. These interests brought him to the college, where he was appointed Bluemantle Pursuivant in 1757 and promoted to Somerset Herald in 1759, Norroy in 1773 and Clarenceux in 1774. A competent and methodical genealogist and draughtsman, he took a particular interest in parish registers and campaigned for their indexing and the inclusion of greater detail in them. After his death, the majority of his Gloucestershire notes and transcriptions were published, although a number remained in manuscript form until the 1990s.\n|\n|-\n|\n!Sir Isaac Heard\n|1 May 1784 – 29 April 1822\n|A native of Devon, Heard was educated at Honiton Grammar School before serving in the Royal Navy between 1745 and 1751. He then embarked on a career as a merchant: first in Bilbao, Spain, and then in London. An appointment as Bluemantle Pursuivant followed in 1759, with a promotion to Lancaster Herald two years later; in 1774, he was appointed Norroy King of Arms and Brunswick Herald, before a promotion to Clarenceux in 1780; he served as Earl Marshal's Secretary (1782–84) and resigned as Brunswick in 1814. Heard was a proponent of the landscape heraldry which proved popular in the late Georgian period, and, inspired by his earlier travels, took a precocious interest in American genealogy. As a long-serving herald, his genealogical practice was large and much of his manuscript collection ended up in the college.\n|\n|-\n|\n!Sir George Nayler\n|11 May 1822 – 28 October 1831\n|The son of a Gloucestershire surgeon, Nayler practised as a miniature painter before buying his way into the offices of Blanc Coursier Herald and Genealogist of the Order of the Bath in 1792. He used the same means to obtain a place in the College as Bluemantle Pursuivant a year later; promotion to York Herald followed in 1794 after the accidental death of its incumbent. Further appointments as King of Arms to the Royal Guelphic Order and the Order of St Michael and St George (1815 and 1818 respectively) followed before he became Clarenceux King of Arms in 1820 and served as deputy Garter at George IV's coronation in 1821. As Garter, he continued to run a large practice at the College and conducted missions to France, Denmark, Russia and Portugal. Much of his earlier heraldic career involved disputes with the other heralds about his sole right to record pedigrees of the Knight of the Bath; despite objections, he compiled 47 volumes, which are now in the college's possession. He also worked on a history of George IV's coronation, which was only partially published in his lifetime, and a manuscript history of the Order of the Bath, also owned by the college.\n|\n|-\n|\n!Sir Ralph Bigland\n|26 November 1831 – 14 July 1838\n|Bigland was born on 1 May 1757, the son of Joseph Owen of Salford, Lancashire, but changed his surname in 1774 at the desire of his maternal uncle, Ralph Bigland, Garter. That year, he became Rouge Dragon Pursuivant and was appointed Richmond Herald in 1780. Promotions to Norroy (1803) and Clarenceux (1822) King of Arms followed and his appointment as Garter marks the last time an officer has held all three Kingships. He was knighted in 1831.\n|\n|-\n|\n!Sir William Woods\n|23 July 1838 – 25 July 1842\n|By tradition, Woods was reputed the son of Charles Howard, 11th Duke of Norfolk, but he bore the arms matriculated in 1812 in Scotland by one George Woods, a tailor of London and brother to a comedian called William. Whatever the case, details of his early life are also sparse. He was appointed Secretary to the Knights Commander and Companions of the Order of the Bath in 1815 and then Registrar of the Royal Guelphic Order later that year. He tried for Ross Herald in Scotland in 1816, but his first heraldic appointment was as Bluemantle Pursuivant in 1819; promotions to Norfolk Herald (1825; held jointly with Bluemantle), Clarenceux King of Arms (1831) and deputy Garter (c. 1836) followed.\n|\n|-\n|\n!Sir Charles Young\n|6 August 1842 – 31 August 1869\n|Born in Lambeth, Young was the son of a surgeon and, through his mother, an illegitimate grandchild of the 11th Duke of Norfolk. After studying at Charterhouse, he entered the College as Rouge Dragon Pursuivant in 1813 and was promoted to York Herald in 1820. He took part in ten Garter missions and the funerals of George III, George IV and William IV, as well as the coronations of the last two and of Queen Victoria, and the marriage of the Prince of Wales. According to the Oxford Dictionary of National Biography, Young was an expert on matters of precedence, a prolific genealogist (especially relating to peerage claims) and a competent businessman, whose service as Registrar of the college (1822–1842) and then Garter safeguarded its finances; he also oversaw the construction of its new record room, which now contains most of his books and papers, amounting to 922 volumes.\n|\n|-\n|\n!Sir Albert Woods\n|2 November 1869 – 7 January 1904\n|The illegitimate son of William Woods, Garter, he worked in his father's practice before his first heraldic appointment as Fitzalan in 1837. Portcullis followed a year later, before Norfolk, Lancaster and Brunswick, all in 1841. He took part in Garter missions to foreign states from the 1860s to the 1880s, but old age forced him to delegate his duties during Queen Victoria's funeral and Edward VII's coronation. He maintained a veto over heraldic matters and, in his old age, he refused to retire, guarding his increasingly sluggish practice; the delay this caused in administering orders of chivalry led to the establishment of the Central Chancery of Orders of Knighthood in 1904. He had an \"unrivalled knowledge\" of ceremonies and a shrewd business sense, but was not a scholar and was described by Wagner and Godfrey as a \"deplorable\" armorist who was determined that Victorian grants of arms should be distinct and never include simple coats of arms.\n|\n|-\n|\n!Sir Alfred Scott-Gatty\n|8 January 1904 – 18 December 1918\n|A clergyman's son and graduate of Christ's College, Cambridge, Scott-Gatty was a co-owner of The Genealogist magazine and revived the granting of heraldic badges. He served as Rouge Dragon from 1880 and York from 1886.\n|\n|-\n|\n!Sir Henry Farnham Burke\n|22 January 1919 – 21 August 1930\n|Burke was a son of Sir Bernard Burke, Ulster King of Arms, and grandson of John Burke, who founded the ''Burke's Peerage series. Although educated at Trinity College, Dublin, he did not take a degree. He trained for the Bar examination but instead entered the College as Rouge Croix Pursuivant in 1880; a promotion to Somerset Herald followed in 1887 and he became Norroy King of Arms in 1911. During Sir Albert Wood's old age, Burke did much of the work for the coronation of Edward VII, a task made difficult by the long reign of Victoria; he was duly recognised with the CVO. Described by Wagner and Godfrey as an \"able genealogist\", he was also an authority on armorial china and oversaw corrections to many of the errors in ''Burke's Peerage'' which had attracted criticism during his predecessors' editorships.\n|\n|-\n|\n!Sir Gerald Wollaston\n|27 September 1930 – 2 June 1944 (retired)\n|A grandson of Sir Albert William Woods, Wollaston was educated at Harrow and then Trinity College, Cambridge, whence he graduated in 1893 with a law degree. He was called to the Bar in 1899, but joined the College three years later as Fitzalan Pursuivant Extraordinary for the coronation of Edward VII. Appointments to Bluemantle Pursuivant (1906), Richmond Herald (1919), and Norroy King of Arms (1928) followed. Having served as Henry Farnham Burke's deputy for a year, he succeeded him as Garter and oversaw the coronation of George VI; his experience and knowledge of ceremonial proved useful in assisting the young Earl Marshal. Earlier in his career, he was often called on to counsel in Peerage cases. A \"most painstaking and skilled herald with special bent to ceremonial\", he published The Court of Claims in 1902, 1910 and 1936. After his Gartership, he served as Norroy and Ulster until his death in 1957.\n|\n|-\n|\n!Sir Algar Howard\n|2 June 1944 – 6 December 1950 (resigned)\n|Howard was descended from the Dukes of Norfolk; he was born in Thornbury Castle, where he lived for many years. Educated at King's College London, he was later admitted to the Inner Temple as a barrister. His first appointment at the college was in May 1911 as Fitzalan Pursuivant Extraordinary and he attended the Prince of Wales' investiture that year. He was promoted to Rouge Dragon Pursuivant that October, followed by Windsor Herald in 1919 and Norroy King of Arms in 1931, to which was added Ulster King of Arms in 1943. After he resigned as Garter, he served as Extra Gentleman Usher to the Queen from 1952 till his death, aged 89, in 1970.\n|\n|-\n|\n!Sir George Bellew\n|6 December 1950 – 5 July 1961 (resigned)\n|Born into the Irish peerage, Bellew was educated at Christ Church, Oxford, and served in the Royal Air Force Volunteer Reserve during the Second World War, attaining the rank of Squadron Leader. He served as Portcullis (1922–27) and then Somerset before his appointment as Garter; in the meantime, he had been registrar of the college. The Times called him the equivalent of a chief staff officer during arrangements for the funeral of George VI and the Coronation of Elizabeth II; under the Earl Marshal, he was responsible organising the ceremonies and was knighted in recognition of this work. After a long retirement, spent at his Dower House, Englefield Green, and the Grange, Farnham, he died in 1993.\n|\n|-\n|\n!Sir Anthony Wagner\n|6 July 1961 – 1978 (retired)\n|Wagner was the son of a schoolmaster and a graduate of Balliol College, Oxford. His first appointment at the college was as Portcullis in 1931, but the Second World War interrupted this. He served in the War Office and then the Ministry of Town and County Planning; a keen architectural historian, he helped to draw up guidelines on listing buildings. He was promoted to Richmond in 1943 and left the civil service for the college in 1946. As Garter, Wagner oversaw the funeral of Sir Winston Churchill and the Investiture of Charles, Prince of Wales, and was the first director of the Heralds' Museum; after retiring as Garter, he served as Clarenceux until his death in 1995. A leading genealogist and historian of the college, Wagner published a number of important books on the topics, including Heralds of England, Heralds and Heraldry in the Middles Ages, Pedigree and Progress and English Genealogy, alongside several catalogues of the college's manuscript collection; in 1957, Oxford University awarded him the degree of DLitt and he was twice knighted, as KCB and KCVO.\n|\n|-\n|\n!Sir Colin Cole\n|2 October 1978 – 1992 (retired)\n|Cole was educated at Cambridge and Oxford Universities before serving in the Second World War. In 1949 he was called to the Bar, but a later interest in the Court of Chivalry introduced him to the college. He was appointed Fitzalan and then Portcullis (1957), followed by Windsor in 1966. As Garter, he oversaw substantial restoration work at the college, but he was criticised for not preventing the establishment of the Canadian Heraldic Authority in 1988. He conducted business at a leisurely pace and The Daily Telegraph remarked that he would \"perhaps have better suited the early Hanoverians\". He died in 2001.\n|\n|-\n|\n!Sir Conrad Swan\n|5 October 1992 – 1995 (retired)\n|Swan was a native of Canada and the son of an officer in the Royal Canadian Army Medical Corps. He was educated at the Universities of Western Ontario and Cambridge and served in Europe and India during the Second World War. He was appointed to the college in 1962 as Rouge Dragon. York followed in 1968. He died in 2019.\n|\n|-\n|\n!Sir Peter Gwynn-Jones\n|5 October 1995 – 2010 (retired)\n|The son of a Royal Artillery officer, Gwynn-Jones was educated at Trinity College, Cambridge, before working as an insurance broker in London. He joined the College as an assistant to Colin Cole in 1967 and later worked for Sir Anthony Wagner before being appointed Bluemantle in 1973. A promotion to Lancaster followed in 1983. He was a \"prolific\" armorist, who tried to adhere to simple, but inventive geometric designs. He died in 2010.\n|\n|-\n|\n!Sir Thomas Woodcock\n|1 April 2010 – 1 July 2021 (retired)\n|Woodcock was educated at Durham University and Darwin College, Cambridge. He was called to the Bar in 1975, but started work as a research assistant to Sir Anthony Wagner that year. He was appointed Rouge Croix in 1978, Somerset in 1982 and Norroy and Ulster in 1997. He has co-authored a number of works on heraldry, including The Oxford Guide to Heraldry (1988) and all four volumes of Dictionary of British Arms: Medieval Ordinary (1992–2014).\n|\n|-\n|\n!David Vines White\n| 1 July 2021 –\n|White was educated at Marlborough College, before going to Pembroke College, Cambridge, where he obtained the degree of MA. As an undergraduate he was president of the Cambridge University Heraldic and Genealogical Society and later he received a further MA degree from the Courtauld Institute, University of London.\n|\n|}\nSee also\n* King of Arms\n* Lord Lyon King of Arms\n* Order of the Garter\n* College of Arms\n* English heraldry\nReferences\nNotes\nCitations\nBibliography\n* Adolph, Anthony R. J. S. (2004a). \"Dethick, Sir Gilbert (1499/1500–1584)\". Oxford Dictionary of National Biography. Oxford University Press.\n* Adolph, Anthony R. J. S. (2004b). \"Dethick, Sir William (1543–1612)\". Oxford Dictionary of National Biography. Oxford University Press.\n* Adolph, Anthony R. J. S. (2004c). \"Segar, Sir William (b. in or before 1564, d. 1633)\". Oxford Dictionary of National Biography. Oxford University Press.\n* Ailes, Adrian (1998). \"The creation of the office of Garter king of arms: a postscript\". Coat of Arms. New Series. vol. 11. issue 182. pp.&nbsp;239–240\n* Ailes, Adrian (2004a). \"Bruges, William (c.1375–1450)\". Oxford Dictionary of National Biography. Oxford University Press.\n* Ailes, Adrian (2004b). \"Wagner, Sir Anthony Richard (1908–1995)\". Oxford Dictionary of National Biography. Oxford University Press.\n* Ailes, Adrian (2004c). \"Writhe, John (d. 1504)\". Oxford Dictionary of National Biography. Oxford University Press.\n* Ailes, Adrian (January 2008). \"Anstis, John (1708–1754)\". Oxford Dictionary of National Biography. Oxford University Press.\n* Anstis, John (1742). The Register of the Most Noble Order of the Garter. London: John Barber (printer). 2 vols.: [https://books.google.com/books?id=vpM0AQAAMAAJ 1], [https://books.google.com/books?id=7ZM0AQAAMAAJ 2].\n* Baron, S. A. (May 2011). \"Borough, Sir John (d. 1643)\". Oxford Dictionary of National Biography. Oxford University Press.\n* Begent, P. J. (1995). \"The Creation of the Office of Garter King of Arms\". Coat of Arms. New Series. vol. 11. issue 172. pp.&nbsp;134–140\n* Cheesman, C. E. A. (2004). \"Leake, Stephen Martin (1702–1773)\". Oxford Dictionary of National Biography. Oxford University Press.\n* Chesshyre, Hubert (May 2011). \"Walker, Sir Edward (1612–1677)\". Oxford Dictionary of National Biography. Oxford University Press.\n* Cooper, Thompson; Marchand, J. A. (rev.) (2004). \"Browne, Thomas (1702–1780)\". Oxford Dictionary of National Biography. Oxford University Press.\n* Cooper, Thompson; Marchand, J. A. (rev.) (January 2008). \"Townley, Sir Charles (1713–1774)\". Oxford Dictionary of National Biography. Oxford University Press.\n* Crossette, J. S. (1983). [http://www.historyofparliamentonline.org/volume/1660-1690/member/bysshe-edward-1615-79 \"Bysshe, Edward (c.1615-79), of Smallfield Place, Burstow, Surr.\"]. The History of Parliament: the House of Commons 1660-1690. London: Secker & Warburg (for the History of Parliament Trust).\n* Cruickshanks, Eveline (1970). [http://www.historyofparliamentonline.org/volume/1715-1754/member/anstis-john-1669-1744 \"Anstis, John (1669–1744), of West North, Duloe, Cornw.\"]. The History of Parliament: the House of Commons 1715-1754. London: H.M.S.O (for the History of Parliament Trust).\n* Cruickshanks, Eveline (2002). [http://www.historyofparliamentonline.org/volume/1690-1715/member/anstis-john-1669-1744 \"Anstis, John (1669–1744), of West Duloe, Cornw. and Arundel Street, Norfolk Buildings, Westminster\"]. The History of Parliament: the House of Commons 1690-1715. Cambridge: Cambridge University Press (for the History of Parliament Trust).\n* Davidson, Alan; Thrush, Andrew (2010). \"Borough (Burgh, Burroughes), John (1583–1643), of Old Palace Yard, Westminster\". The History of Parliament: the House of Commons 1604-1629. Cambridge: Cambridge University Press (for the History of Parliament Trust).\n* Dickinson, P. L. (Jan 2008). \"Bigland, Ralph (1712–1784)\". Oxford Dictionary of National Biography. Oxford University Press.\n* Godfrey, Walter H.; Wagner, Anthony (1963). [http://www.british-history.ac.uk/survey-london/bk16/pp38-74 Survey of London, Monograph 16: College of Arms, Queen Victoria Street]. London: Guild & School of Handicraft.\n* Handley, Stuart (January 2008). \"Anstis, John (1669–1744)\". Oxford Dictionary of National Biography. Oxford University Press.\n* Jacob, E. F. (ed.) (1937). The Register of Henry Chichele, Archbishop of Canterbury, 1414–1443 (Publications of the Canterbury and York Society, vol. 42). Oxford: Oxford University Press.\n* Noble, Rev. Mark (1804). [https://archive.org/stream/ahistorycollege00noblgoog#page/n10/mode/2up A History of the College of Arms and the Lives of All the Kings, Heralds and Pursuivants]. London.\n* Sherlock, Peter (2004). \"Bysshe, Sir Edward (c.1610–1679)\". Oxford Dictionary of National Biography. Oxford University Press.\n* Stanford London, Hugh (1970). The Life of William Bruges (Publications of the Harleian Society, vol. 111–112). London: Harleian Society.\n* Wagner, Anthony (1967). Heralds of England''. London: Her Majesty's Majesty's Stationery Office.\n* Wagner, Sir Anthony; Rowse, A. L. (1992). John Anstis: Garter King of Arms. London: Stationery Office.\n* White, D. V. (May 2006). \"Heard, Sir Isaac (1730–1822)\". Oxford Dictionary of National Biography. Oxford University Press.\n* Woodcock, Thomas (2004a). \"Burke, Sir (John) Bernard (1814–1892)\", Oxford Dictionary of National Biography, Oxford University Press.\n* Woodcock, Thomas (2004b). \"Woods, Sir Albert William (1816–1904)\". Oxford Dictionary of National Biography. Oxford University Press.\n* Woodcock, Thomas (2004c). \"Young, Sir Charles George (1795–1869)\". Oxford Dictionary of National Biography. Oxford University Press.\n* Woodcock, Thomas (January 2008a). \"Nayler, Sir George (bap. 1764, d. 1831)\", Oxford Dictionary of National Biography, Oxford University Press.\n* Woodcock, Thomas (January 2008b). \"St George, Sir Henry (1581–1644)\". Oxford Dictionary of National Biography. Oxford University Press\n* Yorke, Robert (2004a). \"Barker, Sir Christopher (d. 1550)\". Oxford Dictionary of National Biography. Oxford University Press.\n* Yorke, Robert (2004b). \"Wriothesley, Sir Thomas (d. 1534)\". Oxford Dictionary of National Biography. Oxford University Press.\n;Further reading\n* Elias Ashmole, The history of the most noble Order of the Garter (1715)\n* J. Ferguson, English Diplomacy: 1422-1461 (Oxford: Clarendon Press, 1972)\nExternal links\n*[http://www.college-of-arms.gov.uk The College of Arms]\n*[http://elizabethan.org/heraldry/garter.html Rights and Duties of Garter King of Arms] from the Constitutions of the Officers of the Order of the Garter circa 1522\n*"
    }
  ]
}