{
  "content": [
    {
      "type": "text",
      "text": "# Gary King (footballer)\n\n|height=\n|birth_date=\n|birth_place=Grimsby, England\n|position=Striker\n|currentclub=\n|clubnumber=\n|youthyears1=1999–2008\n|youthclubs1=Lincoln City\n|years1=2008–2009\n|years2=2009\n|years3=2009–2010\n|years4=2010\n|years5=2010\n|years6=2010\n|years7=2010\n|years8=2011\n|years9=2011–2012\n|years10=2012\n|years11=2012\n|years12=2012\n|years13=2012\n|years14=2012\n|years15=2012–2013\n|years16=2013\n|years17=2013\n|years18=2013\n|years19=2013–14\n|years20=2014\n|years21=2014\n|years22=2014–2015\n|years23=2015–2017\n|years24=2017\n|years25=2017\n|years26=2017–2018\n|years27=2019\n|years28=2019–2021\n|years29=2021\n|clubs1=Lincoln City\n|clubs2=→ Boston United (loan)\n|clubs3=Accrington Stanley\n|clubs4=Hinckley United\n|clubs5=Louth Town\n|clubs6=Stamford\n|clubs7=Harrogate Town\n|clubs8=Stamford\n|clubs9=Worksop Town\n|clubs10=Grantham Town\n|clubs11=Stamford\n|clubs12=Corby Town\n|clubs13=→ Grantham Town (dual registration)\n|clubs14=Stamford\n|clubs15=Spalding United\n|clubs16=Corby Town\n|clubs17=Brigg Town\n|clubs18=Grantham Town\n|clubs19=Coalville Town\n|clubs20=Grantham Town\n|clubs21=Deeping Rangers\n|clubs22=Holbeach United\n|clubs23=Lincoln United\n|clubs24=Stamford\n|clubs25=Cleethorpes Town\n|clubs26=Spalding United\n|clubs27=Lincoln United\n|clubs28=Skegness Town\n|clubs29=Frickley Athletic\n|caps1=11\n|goals1=1\n|caps2=11\n|goals2=3\n|caps3=8\n|goals3=1\n|caps4=14\n|goals4=4\n|caps5=2\n|goals5=1\n|caps6=0\n|goals6=0\n|caps7=15\n|goals7=2\n| caps12 = 14 | goals12 = 5\n| caps16 = 10 | goals16 =6\n|caps29=\n|goals29=\n|club-update=20:10, 1 October 2010 (UTC)\n}}\nGary Ian King (born 27 January 1990) is an English professional footballer who plays as a striker.\nKing notably played in the Football League with both Lincoln City and Accrington Stanley, as well as spending time on loan with Boston United. He has since been a journeyman in non-league football and has played for Hinckley United, Louth Town, Stamford, Harrogate Town, Worksop Town, Grantham Town, Corby Town, Spalding United, Brigg Town, Coalville Town, Deeping Rangers, Holbeach United, Lincoln United, Skegness Town and Frickley Athletic.\nCareer\nEarly career\nKing started his journey in Lincoln City's U9's team. He went up through the ranks for ten years. He also played for East Coast Juniors as a young kid once scored 50 goals from midfield in one season.\nKing signed his first professional contract on 19 April 2008. Later that day, he made his first start for Lincoln and scored against Brentford in the 39th minute of the game. Lincoln later went on to win this match 3–1.\nHe joined Boston United on loan on 8 January 2009 till mid-March. He joined Accrington prior to the 2009–10 season. Gary enjoyed his first goal for Accrington against the team from where he was born, Grimsby Town.\nNon-League\nOn 7 June 2010 he signed for Hinckley United.\nOn 12 November 2010 he signed non-contract terms with Louth Town, marking his debut for the club by scoring a last minute winner in the 2–1 victory at Appleby Frodingham in the Northern Counties East League Division One clash on 13 November 2010. After two further appearances for the club, one in the league one in the cup, he moved on, joining Stamford at the beginning of December 2010. However, with inclement weather preventing any competitive football for the club, a seven-day notice for King's services was put in by Harrogate Town shortly before Christmas and he duly linked up with the Football Conference North club.\nKing was released from Harrogate Town on 13 May 2011 after his contract was not renewed for the new season.\nIn July 2011 it was announced that he had rejoined Stamford. He returned to Stamford in January 2012 On 18 February 2012, he agreed to join Corby Town on a dual-registration deal with Grantham Town.\nIn May 2012, he agreed a deal to rejoin Stamford. He moved on to join Spalding United, marking his debut by scoring twice in a 2-1 FA Vase 4th Round victory at Ely City on 29 January 2013. He returned to former club Corby Town in March 2013, joining the club on a dual-registration deal.\nIn August 2013 he joined Brigg Town but swiftly departed to join Grantham Town, making a goalscoring debut in the club's opening day 2–1 defeat at Ashton United on 17 August 2013. On 9 December 2013, he moved on to join Coalville Town However, his spell with the club was short and he returned to Grantham Town in January 2014. In April 2014 he was on his travels again, joining Deeping Rangers for whom he would score twice for in their 4–5 defeat to Huntingdon Town in the United Counties League Cup Final on 5 May 2014. He agreed to join Holbeach United ahead on the 2014–15 season and, after completing a whole season with the club, agreed new terms for the 2015–16 season. In December 2015 he moved on to join Lincoln United. In January 2017 he joined Stamford but was quickly on the move again, joining Cleethorpes Town ahead of their FA Vase quarter final tie at Southall which the club would win 5–2 with King debuting as a substitute.\nOn 18 March 2017, his first-minute lob secured the club's place at Wembley Stadium as they went through to the FA Vase Final with a 1–0 home victory, and 2-1 aggregate score, over Bromsgrove Sporting.\nHe joined Spalding United for a second spell in May 2017, remaining with the club until the beginning of November 2018.\nIn January 2019, he rejoined Lincoln United, debuting in the club's 5–0 defeat at Marske United on 19 January 2019.\nFollowing a two-year spell at Skegness Town, King moved to West Yorkshire side Frickley Athletic in October 2021.\nReferences\nExternal links\n*\n*[https://web.archive.org/web/20120729201349/http://www.redimps.com/archive3/index.mv?cat=players&drop=playerdetsdrop&play=king01 Lincoln City F.C. Official Archive Profile]\n*[https://web.archive.org/web/20091018120104/http://www.theimp.lincolnfans.co.uk/retro49.shtml Unofficial Gary King Profile] at [https://web.archive.org/web/20090221180716/http://www.theimp.lincolnfans.co.uk/ The Forgotten Imp]"
    }
  ]
}