{
  "content": [
    {
      "type": "text",
      "text": "# Gaselee Expedition\n\n:\n:\n:\n:\n:\n:\n:\n}}\n| combatant2        =\n}}\n| commander1        =  Alfred Gaselee Yamaguchi Motomi}} Nikolai Linevich Henri-Nicolas Frey Adna Chaffee\n| commander2        =  Ma Yukun Song Qing\n| strength1         = 55,000 Total 20,840 soldiers 13,150 soldiers  12,020 marines  3,520 soldiers  3,420 soldiers and marines 900 soldiers  80 soldiers  75 sailors\n| strength2         = 50,000–100,000 regular and rebel troops\n| casualties1       = Moderate\n| casualties2       = Heavy\n| campaignbox       =\n}}\nThe Gaselee Expedition was a successful relief by a multi-national military force to march to Beijing and protect the diplomatic legations and foreign nationals in the city from attacks in 1900. The expedition was part of the war of the Boxer Rebellion.\nBackground\nThe Boxers were an anti-Christian, anti-foreign rural mass movement.  Their objective was to rid China of foreign (Western) influence.  In May and early June 1900, they advanced on Beijing.  The Qing government of China was equivocal about the Boxers, fearing that they might become anti-Qing.  The Boxers were a serious threat to Western and Japanese citizens and Chinese Christians living in Beijing, Tianjin, and other areas of northern China.\nThe diplomatic Legations (Embassies) in Beijing requested that marines be sent to protect them; more than 400 from eight countries arrived in Beijing on 31 May.  However, as the threat from the Boxers increased, it became apparent that additional soldiers were needed.  On 9 June, Sir Claude Maxwell MacDonald the British Minister cabled Vice Admiral Edward Hobart Seymour, commander of the British Navy's China fleet, that the situation in Beijing \"was hourly becoming more serious\" and that \"troops should be landed and all arrangements made for an advance to Peking [Beijing] at once.\"\nOn receipt of MacDonald's message, Seymour assembled within 24 hours a force of more than 2,000 sailors and marines from Western and Japanese warships and prepared to embark for Beijing from Tianjin, 75 miles away, by train. His force consisted of 916 British, 455 Germans, 326 Russians, 158 French, 112 Americans, 54 Japanese, 41 Italians, and 26 Austrians. Seymour's Chief of Staff was Captain John Jellicoe.  The Commander of the Americans in the expedition was Captain Bowman H. McCalla.\nThe diplomats in Beijing anticipated that Seymour would arrive there on 11 June, but he didn't.  Shortly thereafter, all communications were cut and the Seymour Expedition disappeared in the interior of China. Acting without the Chinese Imperial court's permission, they had, in effect, launched an invasion. The Chinese response was decisive; the Seymour Expedition suffered a disastrous defeat.\nThe expedition\nAllied troops suffered from severe illnesses, unsanitary conditions, diarrhea, flies, and other pests.  General Dorwood cautioned advance, urging 60,000 men to be ready before going forward since he witnessed the Chinese pound the Allied forces with their weaponry at Tianjin.  The Chinese destroyed the railroads and junk ships to prevent the Allied advance. German Field Marshal Alfred von Waldersee was selected as supreme commander, but he was in Germany with his soldiers. Lieutenant-General Sir Alfred Gaselee was chosen as temporary commander of the expedition because the Alliance was prejudiced against the non-white Japanese General Yamaguchi Motomi even though he was the highest-ranking officer.\nOnly 2,500 soldiers and marines were on hand to maintain a position some ten miles in length, with all communication with the fleet cut off for a considerable time. But the troops of the Powers were being rushed to the scene with the utmost dispatch possible. Not, however, until 14 July had enough reinforcements arrived from the coast to relieve after severe fighting the beleaguered force and to capture the entire city, which was indispensable as a base of operations against Beijing. Then came another distressing wait before the advance on the capital could begin. This was largely on account of the changed opinions regarding Chinese valor and the effectiveness of their resistance to the Seymour expedition. As it was, the Allies would have tarried at Tianjin for additional reinforcements some weeks longer had not the British and American commanders threatened to proceed alone with their contingents and risk the consequences. Although it was felt, so had the estimation of Chinese prowess been increased, that at least 50,000 troops were necessary, some thought 70,000, successfully to invade the interior, the second relief expedition to Peking finally got under way, on 4 August, The main force was composed of approximately 22,000 troops from the following countries: Japan 10,000; Russia 4,000; Britain 3,000; United States 2,000; France 800; Germany 200; Austria 100; and Italy 100.\nThe expedition ended in victory at the Battle of Peking.\nIncidents of Allied Friendly Fire\nAllied forces often argued and fought amongst each other, severely criticizing one another's fighting capabilities. Several British Royal Welsh Fusiliers reportedly killed four Germans in a fight, with their commander allegedly imprisoning them for not having murdered enough Germans. French soldiers were purported to have fired on fellow Allied forces on occasion, possibly by accident.\nWeather\ntemperatures and insects plagued the Allies.  Soldiers dehydrated, and horses died.  Chinese villagers killed Allied troops who searched for wells, and gouged out the eyes and sliced the tongues off Japanese troops, nailing them to village doors. The weather resulted in many Allied soldiers dying of heat as they foamed at the mouth during the expedition. The British Indians and even the Russians, who were judged to be the strongest, succumbed.\nAtrocities\nThe tactics were gruesome on either side. By this time, each side had heard reports of the atrocities committed by the other. Foreign newspapers printed rumors and third hand reports; some turned out true.\nWitnesses reported that the Allies beheaded already dead Chinese corpses, bayoneted or beheaded live Chinese, and raped Chinese girls and women. The Russians and Japanese were both especially noted for their atrocities by the other allies. Russians killed Chinese civilians indiscriminately. There were widespread reports that Chinese responded with violence and mutilation, especially toward captured Russians, American Lieutenant Smedley Butler saw the remains of two Japanese soldiers whose eyes were gouged out and tongues cut off before being nailed to doors.\nNotes\nReferences\n*\n* http://plantureux.fr/wp-content/uploads/2016/05/PWT-19-2016-Boxers.pdf\n* Myers, Captain John T. \"Military Operations and Defenses of the Siege of Peking.\" Proceedings of the U.S. Naval Institute, September 1902, pp.&nbsp;542–50\n*"
    }
  ]
}