{
  "content": [
    {
      "type": "text",
      "text": "# Gataker's Warehouse Complex\n\n| location = 106–108 Wharf Street & 310 Kent Street, Maryborough, Fraser Coast Region, Queensland, Australia\n| beginning_label = Design period\n| beginning_date = 1870s–1890s (late 19th century)\n| built = 1879\n| built_for =\n| demolished =\n| architect = James Buchanan\n| architecture =\n| owner =\n| designation1 = Queensland Heritage Register\n| designation1_offname = Gataker's Warehouse Complex, Graham and Gataker, Netterfield and Palmer, Rutledge and Netterfield, Gatakers Warehouse\n| designation1_type = state heritage (built)\n| designation1_date = 21 October 1992\n| delisted1_date =\n| designation1_partof =\n| designation1_number = 600718\n| designation1_free1name = Significant period\n| designation1_free1value = 1870s–1970s (fabric)\n| designation1_free2name = Significant components\n| designation1_free2value =\n| designation1_free3name = Builders\n| designation1_free3value = F Kinne, Jack Ferguson\n}}\n'''Gataker's Warehouse Complex''' is a heritage-listed warehouse at 106–108 Wharf Street & 310 Kent Street, Maryborough, Fraser Coast Region, Queensland, Australia. It was designed by James Buchanan and built in 1879 by F Kinne and Jack Ferguson. It is also known as Graham and Gataker, Netterfield and Palmer, Rutledge and Netterfield, and Gatakers Warehouse. It was added to the Queensland Heritage Register on 21 October 1992.\nHistory\nThe Gataker's Warehouse Complex consists of four buildings erected on three allotments bounded by Kent and Wharf streets in proximity to the river and other buildings associated with the Port of Maryborough.\nSettlement at Maryborough commenced in September 1847 when George Furber established a woolstore on the south bank of the Mary River at the head of navigation. He was followed in June 1848 by ET Aldridge and Henry and RE Palmer, who established their own wharves on the opposite riverbank, at a location now known as the original Maryborough town site at Baddow. In 1850 a new town site was surveyed to the east, at a downstream position which provided better access for shipping. The first sale of land at this new site occurred in 1852, but most residents did not shift to the current centre of Maryborough until 1855 and 1856. Maryborough was gazetted a Port of Entry in 1859 and was proclaimed a municipality in 1861. During the 1860s and 1870s it flourished as the principal port for the nearby Gympie goldfield and as an outlet for timber and sugar. The establishment of manufacturing plants and primary industries sustained growth in the town into the twentieth century.\nGataker's Warehouse Complex comprises:\n* the Kent Street Building (1867–1868)\n* the Middle Warehouse (c.1869)\n* the Wharf Street Warehouse (erected in stages from )\n* Brown's Warehouse (1879) along Wharf Street\nSince 1885, the Gataker family have owned the site on which three of the buildings are sited. Brown's Warehouse was acquired by the family company in 1972. In 1988, the three allotments were group titled.\nKent Street Building, Middle Warehouse, Wharf Street Warehouse\nThe Kent Street Building and Middle Warehouse (located immediately behind the Kent Street Building) are substantial two-storey brick buildings. The Wharf Street Warehouse, a single-storey brick building, is located behind the Middle Warehouse and fronts Wharf Street.\nThe Kent Street Building was built as a store for the owner of the land, Robert Travis, of the wholesale and retail firm, Robert Travis and Co. On completion of the store, the Maryborough Chronicle (20 June 1868) published the following description:\"The facade carries two cornices, an upper and a lower one - the former supported by ornamental trusses, the latter corbelled out, the members of both exceedingly bold and massive in detail, giving an appearance of great solidity to the whole building. An exceedingly light close-boarded, and slated king-post roof - a peculiar feature in which is the entire absence of all common rafters - covers the building. In the rear of the main store, and attached thereto, is a brick wine and spirit store, and beyond that a packing-house, built of the same material. A splendid water supply is secured by a large circular brick tank having a depth of 22 feet (6.7 m) with a diameter of 11 feet (3.4 m). ... The store on the ground floor is a splendid room 15 feet (4.6 m) high, extending over the whole of the building, with the exception that an office occupies a space of 15 by 15 feet (4.6 by 4.6 m) of the lower end. Two rows of handsome iron columns add to the ornament of this large room, and at the same time give solidity to the floor of the upper storey. Access to this upper storey is made by a staircase at the lower end of the building, on mounting which it will be seen the whole floor forms one large room, except that in the centre an opening has been left for facilitating communication between the two rooms, the opening being surrounded with a light elegant balustrade. The internal fittings are all of French-polished cedar, most of it grown in the district...\"The Middle Warehouse was also built for Travis. The Maryborough Chronicle (2 March 1869) gave the following description of the building:\"(It) is a massive two-storeyed pile, of the utmost solidity and security that bricks and mortar, laid in the very best manner, can ensure, with a slate roof of correspondingly durable appearance. The dimensions are 100 feet (30.5 m) long by 30 feet (9 m) wide, the lower story being devoted to the reception of bonded goods, and the upper one, which contains two apartments, to the purpose of an ordinary warehouse.\" In 1879, drapers Rutledge and Netterfield (later Netterfield and Palmer) acquired the site and it was subsequently occupied by a number of commercial or light industrial operations before being sold at auction to CF Gataker of Graham and Gataker on 20 February 1885. Graham and Gataker subsequently acquired land behind the Middle Warehouse fronting Wharf Street.\nIn 1906 Graham retired and, soon after, Gataker's two sons, Melmoth Leofric and Charles James entered the business to form Gataker and Sons. Graham Gataker retired in 1913. At the height of the depression, in 1933, the firm was forced to assign its estate, but the following year Gatakers Pty Ltd was formed, and the company purchased the assets of the old firm recommencing operations.\nAfter World War II, Gatakers expanded their business to become liquor merchants including the Wide Bay distribution of Four-ex beer and the bottling of Bundaberg Rum. In c.1947 the first stage of the single- storey Wharf Street Warehouse was constructed by local builder Jack Ferguson fronting Wharf Street immediately behind the Middle Warehouse. A second stage was constructed in 1969 and a third stage later linked the Wharf Street building to the Middle Warehouse. In the 1970s the timber floor of the Wharf Street Warehouse was removed and replaced with concrete at a lower level to enable the handling of goods on pallets.\nIn the 1950s renovations were carried out to the ground floor of the Kent Street Building including a new hardwood floor and the addition of internal stairs from Kent Street to the upper floor. The cast-iron columns, reputedly used as ballast in a ship from Britain, were retained. By 1959, the slate roof of the Kent Street Building had been replaced with corrugated iron sheeting. In the 1980s the building was internally refurbished and the front awning replaced.\nThe Kent Street Building is now owned by the Fraser Coast Regional Council and in May 2022 was officially opened by the mayor George Seymour as the Gatakers Creative Space, an art gallery and studio space.\nIn 1989 the ground floor and part of the first floor of the Middle Warehouse were leased to Australia Post. Additions and alterations carried out for this tenancy included the erection of a covered loading area, the replacement of the timber (over brick) ground floor with concrete, the replacement of cedar joinery and shutters with silky oak, and the insertion of internal stairs to the first floor.\nThe Middle Warehouse has been adaptively reused as Maryborough's public art gallery, known as Gataker's Artspace.\nBrown's Warehouse\nBrown's Warehouse is a two-storey brick warehouse erected in 1879 for Maryborough wine and spirit merchant, James Edwin Brown.\nBrown arrived in Maryborough in 1857 becoming a business partner of WF Naugton, who died soon after. In 1872 Brown purchased the Wharf Street property, which was somewhat closer to the river than his previous premises at Richmond Street. A timber building on the site was replaced by a brick warehouse described at the time as the finest of the kind in the district and modelled upon the \"best business warehouses of the southern capitals\". Supervised by Maryborough architect and surveyor, James Buchanan, the building contained a storeroom on each floor with an internal stair and lift at the rear. The upper floor was supported by 10 iron columns cast at Walker and Co.'s local foundry. Brick and plaster work was undertaken by local builder F Kinne, who later became a businessman and Mayor, and woodwork by D Ross.\nBrown's business interests prospered until the financial crash of the 1890s, which caused him to return from retirement to the business. In 1897, Brown was joined by his two sons who continued to operate the firm as JE Brown and Sons Ltd after Brown's death in 1899 at his home called Woodstock.\nOwnership of the property passed out of the Brown family in 1951. After a number of owners it was purchased by Gatakers Pty Ltd in 1972. After being group titled in 1988 the building passed to other owners. In 2016, it is occupied by the Maryborough Military and Colonial Museum.\nDescription\nGataker's Warehouse Complex comprises three buildings built along the east boundary of the site between Kent and Wharf Street and a fourth, Brown's Warehouse or Store, built on an adjoining allotment to the west fronting Wharf Street.\nKent Street Building\nThe Kent Street Building is a two-storeyed cement rendered brick building with a hipped corrugated iron roof. The symmetrical south facade, to Kent Street, has corner pilasters, a protruding central bay and mouldings including window surrounds, eave brackets and a heavy cornice between floors. The first floor has a central sash window with an arched sash window to either side. The ground floor has a metal street awning with a skillion roof and timber trim, and timber framed glazing and doors. The west and north elevations are rendered and scribed to imitate stonework, with the west elevation having a metal access stair to the first level. A single-storeyed brick store with a corrugated iron gable roof and side awning is attached to the northeast of the building.\nInternally, the ground floor has been refitted as an office with a concrete floor and partition walls but retains the original cast iron Ionic columns, some of the joinery and a section of the timber floor to the rear of the building. The first floor is accessed via a stair at the southwest corner and is used as a dance studio. A hardwood timber floor with insulation has been laid over the older pine floor, and partition walls used to create bathrooms and stores. This space has a raked boarded ceiling with exposed timber trusses.\nMiddle Warehouse\nThe Middle Warehouse is a two-storeyed English bond brick building with a corrugated iron gable roof and two-storeyed brick lean-to at the south end. Both floors have sash windows, some with bars, with arched brick headers and timber shutters, and each end gable has a lancet window. External steel stairs are located at the northwest to access a gallery space in the north of the first floor, and at the south to access staff amenities. A large, steel truss gable roof is attached to the southwest of the building covering the loading area, with a lower cement rendered toilet block and bike store to the west.\nThe ground floor has been extensively altered, with internal walls, columns and the raised timber floor at truck height being removed and a concrete floor laid and steel beams and columns inserted. Air conditioning has been installed, some openings bricked-in and an opening cut in the north wall to extend the space into an adjacent building. An internal stair at the south end leads to the staff amenities above, which has a suspended ceiling. The gallery space has a raked boarded ceiling with exposed timber trusses and heavy timber doors with original hardware.\nWharf Street Warehouse\nThe Wharf Street Warehouse comprises two single-storeyed brick sheds built at different stages. The front building has an unlined corrugated iron and cement sheet gable roof and barred louvred windows. Internally, the building has a concrete floor, a steel roller door to the south and a stair down to a lower door, opening onto Wharf Street. A large doorway with a sliding timber door opens into the second shed.\nThe second shed has an unlined skillion roof extending to a covered loading area to the west, with a concrete floor and steel roller doors. Remains of an earlier brick structure can be seen in the lower rear corner wall. A bitumen driveway runs along the western side of the site, and accesses car parking behind Brown's Warehouse to the west on Wharf Street.\nBrown's Warehouse\nBrown's Warehouse is a two-storeyed brick building with a parapeted, corrugated iron gable roof and a rendered facade to Wharf Street. This symmetrical facade consists of a central, arched recessed entry and flight of steps with iron gates and an arched sash window to either side. The first floor has a central sash window with J.E. BROWN ESTAB 1857 in relief above, with twin arched sash windows to either side. Render mouldings include a cornice and brackets following the gable with finials to the centre and corners, and window surrounds with horizontal cornice banding. The east elevation has a timber stair with a sliding timber door of diagonal panelling to the first floor and a steel roller door and sash windows with bars to the ground floor. The rear of the building has a steel roller door to the ground floor and the west elevation has only one window in the upper northeast.\nInternally, the ground floor has cast iron columns and an exposed timber floor above. The building contains cedar joinery including panelled doors, staircase and architraves.\nHeritage listing\nGataker's Warehouse Complex was listed on the Queensland Heritage Register on 21 October 1992 having satisfied the following criteria.\n'''The place is important in demonstrating the evolution or pattern of Queensland's history.'''\nThe Gataker's Warehouse Complex, Maryborough, is important in demonstrating the pattern of Queensland's history, in particular the development of Maryborough as a shipping port for the Wide Bay district and the development of Wharf Street to service the port.\nThe place is important in demonstrating the principal characteristics of a particular class of cultural places.\nThe Gataker's Warehouse Complex is important in demonstrating the principal characteristics of warehouses of the late 19th century, dating until the 1950s.\nThe place is important because of its aesthetic significance.\nThe Gataker's Warehouse Complex is important in exhibiting a range of aesthetic characteristics valued by the local community, including the industrial nature of the buildings' forms and their interaction with the surrounding buildings; the difference in design of each building, displaying a hierarchy of use and intent; and their contribution to the streetscapes of Kent and Wharf streets and to the Maryborough townscape.\n'''The place has a special association with the life or work of a particular person, group or organisation of importance in Queensland's history.'''\nThe Gataker's Warehouse Complex has a special association with the life and work of Gatakers Pty Ltd, one of the oldest surviving Maryborough firms, who have occupied the site for over a century, and JE Brown, an early and prosperous Maryborough pioneer.\nReferences\nAttribution\nExternal links"
    }
  ]
}