{
  "content": [
    {
      "type": "text",
      "text": "# Gears of War (song)\n\n| venue      =\n| studio     = SARM Hook End Studios in London; The Steakhouse in Studio City, Los Angeles; Big Fish in Encinitas, California; Backstage Productions in Belper; S.I.R. Rehearsal Studio in Hollywood; Mustaine Music in Fallbrook, California\n| genre      = Heavy metal\n| length     = 4:25\n| label      = Roadrunner\n| producer   =\n| writer     = Dave Mustaine\n| year       = 2006\n| prev_title = The Scorpion\n| prev_year  = 2005\n| next_title = À Tout le Monde (Set Me Free)\n| next_year  = 2007\n}}\n\"Gears of War\" is a song by the American thrash metal band Megadeth. It was released as a promotional single from their tenth studio album United Abominations (2007). It was the first song from the album released. An instrumental of the song is featured in the 2006 video game of the same name.\nBackground\n\"Gears of War\" is featured on the soundtrack to the video game Gears of War. Initially, the song had no lyrics; however, Microsoft approached Megadeth, asking to use the song in Gears of War. The band accepted the offer and wrote lyrics for the song, but it was too late to use the lyrics in the version for the game, as the game was near completion. The lyrics were written about the Bosnian War.\nA demo of the song was released on the band's website on November 22, 2006.\nLive performance\nThe band debuted the song on October 17, 2006 in Nagoya, Japan. Megadeth performed the track live as headliners of Gigantour, a twenty-five stop metal tour sponsored by Microsoft as part of the promotion for the game. Microsoft held a contest which, if won, you would get to try the game early, and would have the opportunity to see a private concert, which the song's American live debut was.\nPersonnel\nProduction and performance credits are adapted from United Abominations liner notes.\n;Megadeth\n*Dave Mustaine – guitars, lead vocals\n*Glen Drover – guitars, backing vocals\n*James LoMenzo – bass, backing vocals\n*Shawn Drover – drums, backing vocals\n;Additional musicians\n*Chris Rodriguez – backing vocals\n*Axel Mackenrott – keyboards\n;Production\n*Dave Mustaine – production\n*Jeff Balding – production, recording\n*Andy Sneap – production, mixing, mastering, recording\nReferences"
    }
  ]
}