{
  "content": [
    {
      "type": "text",
      "text": "# Gedalia Dov Schwartz\n\n| birth_place = Newark, New Jersey, U.S.\n| death_date =\n| death_place = Chicago, Illinois, U.S.\n| buried =\n| nationality = American\n| denomination = Orthodox\n| residence = Chicago, Illinois\n| dynasty =\n| parents = Avraham\n| spouse =\n| children = Avraham Yishaya Rivka Leah Chaim Heschel\n| occupation = Rabbi, posek, scholar\n| profession =\n| alma_mater =\n| semicha = Rabbi Isaac Elchanan Theological Seminary\n| signature =\n}}\nGedalia Dov Schwartz (January 24, 1925 — December 9, 2020) was an eminent American Orthodox rabbi, scholar, and posek (halakhic authority) who lived in Chicago, Illinois. From 1991 to 2013, when he gave his position as Av Beth Din to Rabbi Yona Reiss, he was the av beis din (head of the rabbinical court) of both the Beth Din of America and the Chicago Rabbinical Council (cRc) as well as the rosh beth din (chief presiding judge) of the National Beth Din of the Rabbinical Council of America (RCA). He was also editor of HaDarom, the RCA Torah journal.\nBiography\nSchwartz was born and raised in Newark, New Jersey, where he first studied Torah in his teenage years with Rabbi Yaakov Benzion Mendelson. He was a graduate of Yeshiva College and the Rabbi Isaac Elchanan Theological Seminary of Yeshiva University, where he received his rabbinic ordination. Following this ordination, he received a fellowship in the Institute of Advanced Rabbinic Research of Yeshiva University. Later he was awarded an honorary Doctor of Divinity degree. Rabbi Schwartz was honored with the Harav Yosef Dov Halevi Soloveitchik Aluf Torah Award, RIETS highest honor, at Yeshiva University's Chag Haseemicha convocation on March 23, 2014.\nBefore coming to Chicago in 1987, Schwartz was the rabbi of the Young Israel of Boro Park for 18 years, having earlier held pulpits in Rhode Island, New Jersey and Pennsylvania. He was a past president of the Mizrachi of Rhode Island and the RCA Philadelphia Region.\nFamily\nHis father's name was Avraham. He married Shoshana Poupko (d. 2009), with whom he had two sons and a daughter. Their daughter, Rivka Leah, was married to the late Rabbi Yehoshua Goldman, who directed the Vaad HoIr of Cincinnati. In 2010, Schwartz married his surviving wife, Chana Sarah.\nPositions\nRabbi Schwartz's opinion was frequently sought by both Jewish and secular sources on issues such as conversion to Judaism, halakhic prenuptial agreements, kashering items for Passover, child abuse, and tattoos. In 2002 he was appointed as the head of a three-judge panel which examined cases of agunahs from the September 11 attacks, using DNA testing of post-mortem remains to verify the death of their husbands and allow them to remarry.\nHalakhic works\n\"Rabbi Schwartz was the first second-generation American rabbi to publish an original halachic [Jewish legal] work\":\n* [https://hebrewbooks.org/40820 Divrei Regesh]\n* Migdanos Eliezer\n* Shaarei Gedulah\nArticles\n* Comments on the New York State \"Get Law\"\n* Halakhah and Minhag in Nusach Hatefillah (1990). Journal of Jewish Music and Liturgy 13, 7-10.\nReferences\nExternal links\n* [https://blogs.yu.edu/news/wp-content/uploads/sites/19/2020/12/RabbiGedaliaDovSchwartz_FI_600.jpg  YU photo, Rabbi Gedalia Dov Schwartz]"
    }
  ]
}