{
  "content": [
    {
      "type": "text",
      "text": "# Gender roles in the Latial culture\n\nDuring the Latial period I, the Latial culture (an Iron Age culture of Latium) observed a strict distinction between a type of \"warrior\" burial exclusive to biologically male individuals and a type of \"weaver\" burial reserved for biologically female burials. These categories manifested themselves through associated burial goods, many of which were largely exclusive to male or female graves. Female \"weaver\" burials were characterized by objects such as arch-shaped fibulae, combs, spindles, spools, and spindle whorls. It is likely that, during the first Latial period, political power was largely reserved for men, as grave goods typically associated with power and status were generally restricted to male burials. However, there is certain cult items—such as knives—do appear within female graves, perhaps indicating that women were capable of acquiring social influence through the religious sector. Furthermore, such cult items often appear in the graves of female children or infants, which may indicate that these roles or traits may have been viewed as inherent to women and were allotted to them since birth. During period I, male \"warrior\" burials were typically associated with objects such as miniature weapons, razors, and serpent-shaped fibulae. The presence of militaristic funerary items in male burials may attest to a perceived connection between war and masculinity within Latial society, although the extent to which these goods were purely symbolic representations of power or prestige is unclear. Whereas archaeologists such as Anna Maria Bietti Sestieri argue that socially expressed gender in the Latial culture ought to conform to biological sex, another scholar—Ilona Venderbos—proposes a third, gender-neutral type of burial outfit she labels the \"master of the household\", which Venderbos suggests violated the gender distinction between male and female burials. These gender distinctions may have weakened over the course of Latial periods II and III as more burials of ambiguous gender identification emerge.\nSocial roles of women\nWeaving and spinning\nIn Osteria, during the later part of period II, it was common for a set of spools and spindle whorls to be interred alongside a globular jug, a biconical jug, and a cup within female burials, particularly young adult women or young girls. Sestieri argues that this phenomenon indicates that weaving was primarily performed by women who had not assumed child-rearing responsibilities. Out of a total of 41 \"weaver\" burials in Osteria, the relative majority—a total of 18 graves—belong to individuals between the ages of 11 and 19. \"Weaver\" burials throughout the Latial culture often included items related to the maintenance of physical appearance, particularly hair-related objects such as combs, tweezers, and hair-spirals. Furthermore, it was common for \"weaver\" burials to contain more extravagant funerary goods and personal ornaments than other tombs, perhaps indicating that such burials belonged to individuals of higher social standing. If so, then these status markers would be largely reserved for young adult women—the most common demographic found in weaver burials. According to Venderbos, such honors were provided to young women on account of their reproductive faculties, which were possibly considered crucial for the continuation of their respective kinship clans.\nDuring period II, \"weaver\" burials included distinct types of spindle whorl, which Sestieri argues were variously defined by unique features and functions. One class of spindle whorl, the faceted whorl, was the predominant type of whorl within period II female burials. Usually, only one sample of the faceted whorl was present in a grave, often near the head of the corpse. These whorls were often accompanied by several spindles, leading Sestieri to suggest that they may have borne connections to spinning and possibly reflected a type of \"spinner\" burial distinct from the \"weaver\" burials. The archaeologist Margarita Gleba rejects this analysis, arguing that the presence of a single whorl only served to mark the deceased as female. According to Gleba, the spindle whorl had become a symbolic representation of the female gender in Iron Age Italy due to its connections with a traditionally feminine activity.\nSestieri proposes that weaving activities were connected with biconical decorated spindle whorls, as they were often associated with multiple spools and other faceted spindle whorls. This type of whorl appears throughout Latial period II female infant or child burials at Osteria, leading Sestieri to suggest that it may have functioned as a gift offered to children when they had had first began performing whatever activity was signified by the item. Furthermore, it was common for sets of pots, particularly—during the later parts of period II—a cup, a globular jug, and a biconical jug, to accompany biconical whorls in burials. Gleba argues that the inclusion of multiple spindle whorls likely signified that—in addition to being female—the deceased was a skilled textile worker.\nBurials containing more than three spindle whorls at Osteria contain a collective total of 248 whorls, 51% of which (126 whorls) were placed by the upper part of the body and 42% of which (106 whorls) were placed by the lower part, with the remaining 7% (18 items) appearing by the central part. The placement of spindle whorls in graves containing a higher quantity of the item is more varied than in graves containing fewer. Out of the 147 spindle whorls from graves containing only one example of the item, 86% (126 whorls) appear by the upper part while 11% (4 items) appear by the lower part and 3% (4) items appear by the central part. In Osteria, of the 14 examples of razors as burial goods, 13 were placed by the upper body and one was placed by the lower body. This ritual is incongruent with the distribution of razors in the Iron Age necropolis of Fossa in Abruzzo, in which—of the 12 razors—five were located by the central parts of the body and seven were located by the lower parts.\nPersonal ornamentation\nFemale gravesites of all ages at Osteria dell'Osa unanimously contain items that were likely considered feminine within Latial society, many of which are seemingly personal accoutrements. Fibulae are among the most common feminine ornaments for all age groups in Osteria, although children's fibulae are typically smaller than fibulae uncovered in adult burials. Arch fibulae, specifically, are associated with female burials across multiple Latial sites, such as Tivoli, Ardea, and Osteria. However, in Rome, arch fibulae appear almost evenly distributed across male and female burials, perhaps indicating that the item was not associated with any particular gender. Moreover, arch fibulae samples occur alongside both textile tools, a typically feminine burial good, and helmets or razors, which were usually masculine funerary items. Cecilie Brøns, a classical archaeologist, doubts whether fibulae-type was directly related to gender in Latial culture, citing the cooccurrence of arch fibulae with both male and female burial objects.\nDuring the Latial period II, at Osteria, finger rings were common throughout the funerary outfits of female individuals aged around 19–40. According to Lisa Cougle-Jose, these rings may have been associated with kinship groups or clans, as certain types of rings appear most frequently within specific burial clusters. For instance, a type of broad strap ring is most common within the eastern burial group, whereas a type of spiral ring is most prevalent within the northern burial cluster. Cougle suggests that the few burials containing this type of spiral ring that are not located within the northern cluster may have belonged to individuals who, although initially of that family group, married into a different clan. In Osteria, graves of younger women—with ages ranging from infant to young adult—typically contain a type of faience bead.\nSuspension rings\nLatial period II female graves almost exclusively contained 1-2 fibulae, which were often attached to rings that were suspended from the pins of the fibulae. During the Latial period II, these fibulae, and thus their associated suspension rings, were often placed on the breasts, although they could also appear by the skull. By the Latial IIB2 and III periods, it remained common for suspension rings to be placed near the chest of the deceased. Rings during the Latial period IVA were often placed near the pelvis of the deceased, which the archaeologist Gilda Bartoloni interprets as evidence that these rings may have borne reproductive connotations. The archaeologist Cristiano Iaia further extends the possibility of reproductive associations to other types of Latial rings, noting that the period II rings situated by the breasts could also be interpreted as related to reproduction. Moreover, Iaia notes the presence of a specific type of Latial period II ornament consisting of fibulae, alongside their related suspension rings, attached to a set of beads and pendants that were themselves hung from a single, central bead itself situated by the abdomen or the pelvis. Iaia argues that the proximity of this grave good to the pelvis indicates that it was connected to reproduction. In Osteria, this type of ornament was included within a type of funerary set common to the graves of young women that comprised suspension rings, 1-3 fibulae, and a necklace.\nRings also progressively increased in size during the transition from the Latial period II to the IIB and III periods: Latial period IIA rings had an average width of 2-4 centimeters; Latial period IIB rings were, on average, 3-6 centimeters wide; and Latial period III graves could include up to ten rings, with a diameter ranging from 5-21 centimeters. This evolution culminated in the Latial period IVA, during which time graves began to include only a single, large suspension ring with a diameter of up to 40-45 centimeters and impressed or incised decorations. Throughout Latial history, larger rings primarily appeared in the graves of adult women. However, smaller rings—although still primarily associated with adult women—also appeared with some frequency in the graves of subadult women during the first Latial periods and in adult or preadult male burials during the later periods. Archaeologists Francesca Fulminante and Giulia Pedrucci propose that the provision of rings to subadult women may not reflect any social function they held during life, but instead their potential to hold these roles once they matured. Bartoloni suggests that larger rings were connected with wealthier, more prominent women—perhaps with some relationship to motherhood. Fulminante and Pedrucci affirm this analysis, citing the tendency for larger rings to appear in wealthier burials during the Latial periods III and IV. Moreover, they note that—during periods II, III, and IV in Osteria—larger suspension rings typically appear in funerary groups with multiple preadult burials. However, Fulminante and Pedrucci extend the relationship between suspension rings, wealth, and motherhood to smaller rings, which are also found in connection with wealthier burials and funerary groups containing more preadult graves.\nThe deposition of burial rings was a phenomenon almost entirely unique to the Latial culture, although they appear in small numbers across Umbria and Sabina. Samples of suspension rings have also been excavated at the Villanovan site of Caere, which Iaia suggests is likely due to the presence of Latial immigrants. Iaia argues that the rings likely functioned as markers of ethnic affiliation for the Latial people, noting that the tradition persisted throughout Latial sites such as Capena despite heavy influence from foreign cultures such as the Villanovan or Etruscan civilizations. Iaia suggests that, as the Latial culture oriented its social structure around kinship groups, it likely placed significant importance on intermarriage between ethnic or family groups, such as marriage between Latial women and Etruscan men. Thus, according to Iaia, the possible ethnic connotations of the rings may have developed in relation to the traditions of Latial marriage practices. Iaia further connects this burial custom to the rape of the Sabine women, a mythical event in early Roman history during which the Romans kidnapped the Sabine women for marriage.\nLavish burial goods\nAnalysis of the Latial sites of Osteria and Gabii indicate that infant female burials dated to the Latial period II usually contain more ornaments and more luxurious burial goods than male infant burials. Fulminante suggests that the disproportionate allotment of more opulent materials to infant female burials may indicate that the Latial culture viewed women as inherently deserving of a particular social status from birth, whereas men were expected to acquire rank and were thus denied such funerary goods during infanthood. Sestieri argues that many Latial culture ornaments served to enhance personal pleasure or prestige rather than to mark a formal or political status. Instead, Sestieri proposes an additional function, suggesting that the provision of personal cosmetics to young girls in Osteria may have helped to advance the marriage strategies envisioned by their family groups.\n| image1            = Wealth distribution at Osteria according to Gender.png\n| image2            = Wealth distribution at Osteria according to Sex.png\n}}\nDuring the Latial Period IIIA, female graves began to include more lavish burial goods such as beads, pendants of amber or glass, spindle-whorls, and 2-6 fibulae. This trend continued during the Latial period IIIB, during which female burials in Osteria contained larger quantities of personal adornments. Other Latial period III cemeteries contained female burials with hair-rings made of precious metals and as many as 25 fibulae, which were usually accompanied by several suspension rings. Suspension rings persisted as a female burial good into the Latial period IVA, by which time they had become markers of social status were largely restricted to the graves of wealthy, prominent women. During the early periods of Latial chronology, imported objects predominately appeared in female burials, although—during the later periods—imported goods more frequently surfaced in male burials. Fulminante argues that this trend indicates that items from foreign cultures were absorbed into Latial society via female-dominated aspects of Latial society, perhaps through intercultural marriages.\nFulminante notes that, in Osteria, female burials overall contained more ostentatious funerary goods than male burials, perhaps indicative of a tendency for women in Latial society to—on average—maintain higher levels of wealth than men. If the analysis exclusively factors the sex-identification of the graves, then the wealth distribution is significantly more even—albeit still unequal—than if only graves containing individuals gendered as masculine (i. e, individuals with masculine burial goods). Fulminante explains this phenomenon as stemming from a possible desire of higher-status males to avoid conveying their rank in their burial or to showcase a collective group identity.\nLozenge-shaped belts were a type of clothing generally associated with aristocratic, female burials that may have originated in Etruria before spreading throughout Tyrrhenian Italy. Belts of this type dated between the Latial IIB and IIIA periods have been uncovered in Tivoli.  Rectangular belts have also appeared in a Latial period III tomb from Praeneste and a period IIIB tomb from La Rustica, alongside their occurrences in Villanovan sites. According to Lipkin, they may have constituted an upper-class, ceremonial ornament that typically belonged to female individuals. The belts were usually tied together via one clasp hook, although—in some graves—multiple hooks have been found. Hooks were attached to one end of the belt and inserted through a leather or textile loop on the opposite end. When placed in female burials, the hooks were often deposited on the sides of the corpse, perhaps—according to Lipkin—indicating that the deceased had fastened the belt on that side or had not worn the clothing in life. One upper-class female burial dated to the Latial period IVA2 from Crustumerium contains three hooks situated beneath the waist and another possibly female Latial period IV burial from Osteria contains a clasp also located by the waist. However, a separate possibly female burial—also from the Latial period IV in Osteria—contains a clasp situated by the left femur.\nPottery\nDuring the Latial period II, female gravesites typically contained a larger quantity of pottery than male burials, and the pottery in female burials is usually of higher-quality modeling or more ostentatious decorations than the vessels of male gravesites. Although, in one funerary group, male burials contain an average of 4.2 pottery vessels per grave—29.4% of which are decorated—compared to an average of 4 vessels per grave in female burials—29.1% of which are decorated. The pottery found in Osteria displays evidence of wear through persistent usage, which may imply that the pottery deposited in burials was used by the individual in life.\nSestieri argues that the distribution of food was likely performed by older family members, regardless of gender, as the vessels responsible for storing liquid—such as two-handed jars and amphorae—are present in the burials of both men and women, although restricted to the gravesites of adult individuals. Moreover, one type of pottery, a small cup with a grooved handle—which was likely used to store food or liquids—typically appears in the gravesites of adult or elderly women. However, during period IV, it was common across Latial female graves to include mixing bowls supported by holmoi alongside jugs, cups, and amphorae. According to Holloway, such evidence indicates that women were responsible for overseeing banquets, a social function that was also fulfilled by contemporary Etruscan women.\nAnother type of pottery, a large liquid container restricted to the graves of mature women, may have indicated marital status. This vessel is common throughout period I and II \"weaver\" burials belonging to individuals aged 11–19. The pottery dated to the Latial period II at Osteria dell'Osa was likely handmade and produced within individual family units, resulting in variation in the manufacturing process across different vessels. Sestieri argues that the responsibility of pottery production in the Latial culture likely primarily fell upon women. By period IV, the ceramic inventory of female burials in multiple Latial sites was largely created by professional manufacturers and were likely not the product of the household matron.\nReligious roles\nAccording to Sestieri, among the Early Iron Age burials, six male burials contain a sword as a grave good and five contain a knife, whereas only two female burials contain a knife and none contain a sword. Only two adult women at Osteria dell'Osa were buried with knives, both of whom buried with a central position in the cemetery and had lavish burial goods. Knives were possibly associated with religious and cult practices in the Latial culture, perhaps due to a connection with ritual sacrifice. Thus, as knives are the primary high-status burial good incorporated within female graves, the primary high-status social positions offered to women may have been religious in nature. Among the 18 examples of knives as burial goods in inhumations at Osteria, 13 were placed by the feet or the lower part of the body while five were placed by the upper part.\nThe gender connotations of knives varied throughout Latial history: Knives were exclusively associated with male cremation burials during period II at Osteria, although they became rare in male burials and common in female graves by period III. However, according to Sestieri, it is possible that some of the variation—at least during period III—may be explained by potential inaccuracies in the data resulting from the large number of damaged burials. Archaeologist Erik van Rossenberg argues that the knives were likely associated with ritual eating practices, as ceramic vessels and spits—other objects associated with food—were also often placed by the lower body. Sestieri proposes that knives may have acquired more culinary associations during period III, which were possibly associated with the preparation of meat. According to Sestieri, such a shift may explain the increasing frequency of knives in period III burials, as the acquisition of connections to more general food-related rites—as opposed to specific religious roles—could prompt more widespread usage. Another explanation, offered by Smith, holds that the growing frequency of knives in female graves could reflect a shift in religious power from the masculine sphere to the feminine. In tomb 132 of Castel di Decima, a tomb dated to around 850 BCE containing the skeleton of an adult woman, a spit was uncovered alongside a knife. According to Nijboer, the item may have merely been involved in a banqueting ritual, although the archaeologist Corinna Riva argues that the combination of a knife and a spit likely reflects an Italic custom of female involvement in meat sacrificial rituals.\nOne burial belonging to a girl younger than six years old contains a set of double amphorae decorated with depictions of birds, which Sestieri argues may indicate that girl was predestined for a religious role from a particularly young age. Other graves contain religious equipment which may further indicate that women could be tasked with religious roles from youth: One grave from San Lorenzo Vecchio belonging to a young girl around the age of twelve contains a hut urn and a statuette that itself is possibly posed as if it were performing a religious offering. This grave in particular may indicate that women could play an active role in religious rituals from a young age. Another grave from Guidonia contains an infant burial in which the deceased was entombed with a knife, a set of decorative ornaments, a spindle, spools, spindle whorls, and a distaff. Sestieri argues that the knife likely functioned as cult imagery, although the archaeologist Isabella Damiani instead interprets the object merely as another piece of weaving equipment. In Caracupa, a young woman was found entombed near a votive deposit underneath the settlement walls, and—in Ardea—an 18-year-old woman was found near a hut underneath the temple of Colle della Noce. Guidi proposes that these intramural female burials may constitute examples of the graves Vestal Virgins, as the members of this Roman order of priestesses were authorized to inhume themselves within the city boundaries of Rome or Alba Longa.\nSmith argues that rattles may have functioned as cult items, noting that noise was an important aspect of archaic Roman ceremonies such as the  (\"three-step dance\" and the  festival. Alternatively, Sestieri suggests that rattles were associated with more minor religious officials, unlike the statuettes or knives. Moreover, Smith also suggests that the rattles may have also been associated with women, the objects were found within two female burials at Osteria. The goods were found in the graves individuals aged between adolescence and early adulthood, which may—according to Smith—indicate that the object served as an apotropaic device or that it related to death during childbirth. Two other types of Early Iron Age ritual artifacts uncovered at Osteria dell'Osa are unique to female burials: a set of double amphorae and a type of decorated hollow sphere with a handle.\nSocial roles of men\n\"Warrior\" burials dated to the Latial period I unanimously—with the exception of the settlement at Tenuta Quadraro—contained miniaturized versions of weapons or armor, which often included swords, spears, greaves, lances, or shields. Alongside miniaturized weapons, \"warrior\" graves often included razors, knives, and other cosmetic adornments. The archaeologists Anna Sestieri and Anna De Santis propose that the miniature funerary items were indicative of local \"chiefs\" belonging to social elite. However, Iaia suggests that these graves more likely reflected a cultural ideal rather than a specific social stratum, as—according to Iaia—they are too numerous to represent an exclusive class of prominent individuals. Sestieri and De Santis further postulate that men, during the Latial period I, likely could assume high-status roles in religious, military, and political hierarchies, as male burials during this period often included both objects associated with political or military prestige—such as swords—and objects associated with religious significance, such as knives or statuettes. Statuettes in particular are, at Osteria, largely reserved for male cremation burials between periods I and II. According to Sestieri, they likely functioned as a symbolic representation of the deceased and were indicators of a priestly role. The statuettes in male warrior burials during the Final Bronze Age and Early Iron Age have also been interpreted as depictions of the deity Opiconsivia.\nThe presence of military equipment in male burials may indicate a perceived connection between war and masculinity within the Latial culture, although Venderbos suggests that such bellicose imagery may possess more metaphorical symbolism beyond a literal connection to warfare. For instance, Venderbos notes that—in other cultures—weapons may hold a prominent position within rituals or ceremonial garb, especially as—according to Venderbos—ornately decorated weaponry can highlight personal prestige. Venderbos further suggests that weapons may also often serve as symbolic representations of power or authority. Venderbos proposes a connection between the military equipment of the Late Bronze Age Latial culture with the ritualistic weapons of the Salian priests, an ancient Roman order of priests. The \"double shields\" found in some Latial period I tombs, which consist of two to three interlocking discs, may connect to the , a type of shield that held ceremonial significance in ancient Rome and was involved in the rituals of the Salii. Although shields are often identified as a masculine instrument, one female tomb in Acqua Acetosa includes three shields fastened to the wall.\nVenderbos suggests that personal beauty may have been significant for males in the Latial culture, as \"warrior\" burials during the Latial period I often contain cosmetic ornaments such as jewelry, including a type of snake-shaped fibula that is exclusively present in weapon-containing burials and always absent from weaponless burials. During the Latial period IIIA, male graves from Osteria often included more serpent-shaped fibulae, whereas weapons—such as swords or spear-heads—appeared infrequently throughout male burials. Serpentine fibulae are characteristic of male burials within the Latial culture, though every site containing male burials marked by such fibulae also contains female burials incorporating the same object. In Sala Consilina, only 80% of graves containing serpentine fibulae were male burials and—in Rome and Pontecagnano—only 60% of burials containing such fibulae belonged to male individuals. The Latial period II graves at Osteria and the graves of the Le Rose necropolis in Tarquinia are organized into clusters of burials centered around male graves, indicating a patriarchal family structure.\nGender-neutral domestic themes in burials\nThe archaeologist Ilona Venderbos proposes that in addition to the standard \"warrior\" and \"weaver\" type burials, the Latial culture—during the Late Bronze Age—utilized a third, gender-neutral burial category referred to as the \"master of the household\". Venderbos cites the presence of hut-shaped funerary urns within cremation burials, arguing that the urns symbolically represented new homes for the deceased. She compares the Latial traditions to a similar practice in the Etruscan culture, in which leadership over an  (a type of family unity) may have been represented within burials via the deposition of miniature huts, which themselves often took the form of hut-urns. Thus, Venderbos suggests that the hut-urns in the Latial culture likely also signified that the deceased held a prominent domestic role during their lifetimes. Furthermore, Venderbos relates the hut-urns to the miniature furniture prevalent in Latial period I tombs, arguing that the latter objects may have functioned as banqueting equipment. This banqueting equipment, according to Venderbos, may have itself been largely reserved for more elite individuals within Latial society—the same kind of prominent persons selected for hut-urn burials.\nChanging gender norms during periods II and III\nNumerous graves dated to the Latial period II lack fibulae, which were otherwise the most common grave good and—according to Cougle—the most heavily gendered. The majority of the graves that lack fibulae are infant burials, leading Cougle to argue that the infants may not have yet been assigned a gender identity, thereby negating the need for a gender-signifying object. Out of a sample of Latial period IIA and IIB subadult graves gathered by Venderbos, only 40% of the burials included objects suggestive of any gender identity. According to Venderbos, the majority of these children were gendered as women, usually via the presence of hair rings, arch bow fibulae, or a necklace. Sestieri notes that, in Osteria, the graves of nearly all girls younger than 12 years of age contain gendered items, whereas the graves of boys from the same age groups almost entirely lack markers of gender roles. Moreover, Sestieri argues that the presence of cult-related objects in the graves of subadult women indicates that these individuals received these ritual roles in youth.\nThe distinction between \"warrior\" and \"weaver\" burials also weakened during the Latial period II. \"Warrior\" type burials persisted into the IIA period, although they generally contained fewer miniature weapons, often only containing a spear and a lance. Although razors were almost always included in male burials dated to the Latial period I, there were few razors present in Latial period IIA1 male burials. However, the \"warrior\" type completely dissipated from the funerary record by the Latial period IIA2. Regular-sized razors and serpentine fibulae continued to appear in male burials, although weapons, corded jars, and miniature braziers largely vanished from such tombs. All female burials from the Latial period II and onwards contain a spindle whorl, perhaps indicating that the spindle whorl had come to merely signify that the deceased was female, rather than to convey any more complex gender identity or role in life.\nSestieri argues that, by the Latial period III, the representation of the different gender roles within the funerary record at Osteria had largely dissipated. However, knives remained prevalent in female burials at Osteria, which may represent either the cult-related function   ascribed the knives from early periods, or—as Sestieri argues—they may signify that women were responsible for the cutting and distribution of meat. Gender identity continued to be expressed in the funerary record through the interment of certain gender-specific articles of clothing. Female burials in Castel di Decima were marked by the presence of hair rings, a headdress with amber or glass-paste beads, and new types of fibulae—such as the boat fibulae, leech fibulae, or fibulae with an amber bow. Likewise, in Osteria and Caracupa, female burials are differentiated by the inclusion of hair rings and arch bow, leech, or boat fibulae. Men from Castel di Decima were often entombed with a short-sleeved tunic, an iron lance, a sword, and a mantle fastened to either the chest or the right shoulder by 1-2 serpentine fibulae. Some male burials from this cemetery contain buckles or hooks that Venderbos interprets as the remains of decayed belts. Male tombs from Osteria and Caracupa were marked by the inclusion of serpentine or dragon fibulae and the presence of weaponry.\nLatial period III graves from the Esquiline necropolis often include both objects considered feminine and objects considered masculine in other Latial cemeteries. For instance, multiple Esquiline tombs contain both spinning tools and weapons while other graves contain both the feminine boat or leech fibulae and the masculine serpentine or dragon fibulae. Other tombs include axe or arrowhead-shaped pendants, combining the pendant—a traditionally feminine ornament—and weaponry, which were traditionally masculine objects within Latial society. Although Venderbos argues that these ambiguous burials reflect the breakdown in gender norms, Gjerstad suggests that some Esquiline tombs may have merely functioned as double burials for men and women, thus explaining their combination of objects belonging to separate gender identities. The irregular deposition of fibulae in the Esquiline necropolis may also be explained if fibulae were not as strongly associated with gender specifically within the Esquiline cemetery.\nLikewise, it is possible that the pendants from Osteria lost their gendered connotations or had become status symbols that were allottable to both male and female graves. Other gender-ambiguous graves from Osteria have also been interpreted as burials of high-status individuals. One female grave situated in a central position within their burial group contains arrow-shaped pendants alongside numerous other lavish ornaments. Another female tomb also located in the center of their burial group, this one belonging to a 60-year-old individual, contains a bronze spearhead and serpentine fibulae. Possible associations between arrow or axe-shaped pendants and high-status may be reinforced by the more certain function of arrowheads and axes as signifiers of social status. Anthropologist Bettina Arnold suggests that that women in these high-status female graves with masculine burial items may have constituted \"honorary males\"—women who are treated as males due to their assumption of traditionally masculine roles. However, Venderbos disputes this analysis, arguing that no such \"honorary male\" burials have been identified in Iron Age Italy and—since it is impossible the confirm the biological sex of many of the individuals interred within these tombs—it is impossible to prove that these individuals were, in fact, women buried as men.\nGender identities incongruous with biological sex\nTombs dated to the Latial period IIA contain grave goods whose gender associations in the Latial period I are incongruent with the biological sex of the deceased. One tomb from the Forum of Caesar contains a biologically female individual buried with arch fibulae, a hair rang, necklaces and a serpentine fibula and another grave from the Forum Romanum that likely contained a female individual also includes a serpentine fibula. The necropolis at the Forum Romanum also contains a grave belonging to a male individual that itself includes a spindle whorl as a burial good. One grave from Osteria likely contains the skeleton of a biologically male individual who was interred alongside a necklace, a spindle whorl, hair rings, and an arch bow fibula. The presence of traditionally feminine ornaments within the burial of a likely biologically male individual compelled the archaeologist Lisa Cougle to suggest that the deceased was transgender, although the archaeologist Cecilie Brøns suggests that the individual may have been viewed as more feminine as their death occurred prior to reaching adulthood. The cemetery at Osteria may reveal two other transgender burials, as two separate possibly male individuals appear entombed with arch bow fibulae and spindle whorls. However, the sex determinations of these skeletons may be unreliable, as the sex of one skeleton can only be ascertained via analysis of their tooth size, whereas the sex of the second skeleton can only be discerned based upon several fragments of their crania.\nMoreover, several male burials from Osteria contain fused or suspension rings situated near the skull that are otherwise associated with female burials, perhaps indicating that these male individuals—although perhaps not transgender—may have expressed a more feminine gender identity. Cougle notes that the long bones of these skeletons were typically slender, possibly indicating that their slenderness was considered feminine, thus prompting their burial with more feminine objects. According to Cougle, the expression of this particular type of more feminine gender identity may not have been viewed as shameful or disreputable, as one male burial marked by the same gracile bones is situated near other important burials in the central burial cluster within their group. Venderbos disputes the association between femininity and gracility, noting that these rings were absent from other tombs containing slender males, indicating that the Latial culture did not necessarily perceive slimness in males as effeminate, and therefore they did not include these rings within all burials belonging to such men. Venderbos further suggests that these rings may have merely constituted a new type of ornament within Latial culture male fashion, perhaps representing a breakdown in gender norms as the typically feminine item became accessible to men. It is also possible that several instances of these rings within the archaeological record may have actually acted as components to other objects, such as fibulae. Thus, Venderbos suggests that traditionally feminine objects—such as fibulae—may have become incorporated into the masculine coiffure.\nSee also\n* Women in the Etruscan civilization\nReferences\nBibliography\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*"
    }
  ]
}