{
  "content": [
    {
      "type": "text",
      "text": "# George Edward Cheney\n\nGeorge E. Cheney is an educator, writer, speaker, facilitator, and consultant. Together with his wife and colleague, Sally Planalp, he has a primary residence in Moab, Utah.  Cheney is an internationally recognized leader in the area of organizational communication and focuses his work on the improvement of organizational processes with special attention to the triple bottom line and the pursuit of socially and environmentally responsible economic development. Cheney draws from a variety of disciplines and professions in his work, including sociology, economics, political science, philosophy, marketing, management, and applied ethics.\nEducation\nCheney was born and raised in Youngstown, Ohio, where he was co-valedictorian of Cardinal Mooney High School (1975). Cheney has a B.A. in Psychology, from Youngstown State University (1980, summa cum laude), an MA (1982) and a PhD (1985) in Communication from Purdue University in 1985 (where he was ranked first for a university-wide fellowship).\nAcademic positions\nCurrently, Cheney is an adjoint professor at the University of Colorado, Colorado Springs, an adjunct professor at the University of Utah, Salt Lake City, and an adjunct professor at the University of Waikato, Hamilton, NZ. He is also an Associate Investigator with the Ohio Employee Ownership Center at Kent State University, Kent, OH USA, where he was recently a professor of communication studies and the coordinator of doctoral education and interdisciplinary research in the College of Communication and Information. In addition, he is an associate of the faculties of humanities, social sciences and business at Mondragon University in the Basque Country, Spain. Previously, he taught at the University of Illinois at Urbana-Champaign (1984-1986), The University of Colorado at Boulder (1986-1995), The University of Montana (1995-2002), The University of Utah (2002–10) and The University of Texas at Austin (2010-11).  Cheney held tenure-track or tenured positions in all these institutions.\nAreas of interest and contribution\nCheney's research and teaching interests include identity in organizations, professional ethics, globalization, consumerism, and peace, in addition to workplace democracy and economic solidarity. Recognized as a leader in the area of organizational communication, Cheney has helped to expand the boundaries of that specialty to include important social and economic issues of our times as well as considering the implications of practices in all sectors for the larger society.  He is also known for drawing upon, and in certain ways, bridging different epistemological traditions, including elements of empiricism, interpretive research, critical studies, and postmodernism to allow for more complete and nuanced pictures of social phenomena.  Also, he has helped to internationalize the study of organizational communication, considering how insights about practices in employee participation and the communication of organizational identity in different nations and cultural contexts.\nGrants\nCheney has participated in several grants (totaling nearly US$1,000,000) for collaborative research projects in the U.S. USDA and New Zealand (Marsden Fund, in projects on corporate social responsibility and environmental sustainability led by Dr. Juliet Roper at the University of Waikato). The most recent included a Louis J. Kelso fellowship from Rutgers University, for research on best practices in establishing, maintaining, and enhancing “ownership culture” in worker cooperatives (2012-2013). For several years, he worked on Rural Cooperative Development grants through the USDA in collaborative work with the Ohio Employee Ownership Center.\nInnovative courses and workshops\nCheney has developed a number of innovative courses that bridge theory and practice and that have been offered at both undergraduate and graduate levels. Also, some of these courses have been delivered in condensed and hybrid formats.  Topics include Quality of Worklife, Trends in Professional Ethics, and Communication and Globalization. The Quality of Worklife course was cited by students at the University of Utah in nomination for a teaching award and has been expanded over the years to include a broad range of issues in today's workplace and organizations.  Working with David Derezotes, a professor of Social Work at the University of Utah, Cheney helped to develop an innovative, experiential course in dialogue. He is currently developing a course on sustainability and social responsibility for the curriculum in Communication at the University of Colorado Colorado Springs.\nTeaching and mentorship awards\nCheney has won several teaching, advising and mentoring awards at different universities, most recently departmental and college-level advising and mentoring awards at Kent State University. In 2013-14, he received the College of Communication and information's Distinguished Advising Award and the School of Communication's Larry Hugenberg Faculty-Student Mentoring Award.\nLectures and keynote addresses\nCheney has lectured widely and has given keynote addresses at conferences in Europe, Latin America and New Zealand, in addition to North America. Topics have included tools for structuring and maintaining participatory cultures at work, sustaining community values in times of economic crisis, inspiring approaches to professional ethics linking ethical practice to happiness, the implications of consumerism for citizenship, and the analysis of images of war and peace in popular culture. In 2008, he delivered, in Spanish, a lecture named for the founder of the Mondragon cooperatives, the largest system of worker-owned-and-governed businesses in the world. In recent years he has become known for translating theoretical ideas for wider audiences, including various groups of professionals and citizens.\nResearch awards, citations and influence\nCheney has won 20 awards for his scholarship from national and international professional associations. In a recent survey of references in organizational communication, Cheney was found to be the scholar most often cited in the journal Management Communication Quarterly the premier journal in the specialty.\nDirection of PhD dissertations, Master's theses, and other projects\nCheney has advised or co-advised over a dozen PhD students, numerous master's students, and many undergraduate students.  Cheney's students are employed in universities, government agencies, corporations, and in private consulting practices. Cheney has been active in assisting students pursue their academic and career goals, not only in instances of formal advising at the institutions where he has served but also through a wider national and international net of informal advice and mentoring.  The student advising and mentoring often includes career planning as well as training in the chosen field or specialization. The extent of this activity was recognized in recent awards.\nAdministrative experience\nCheney has served as interim director of a student service-learning program (INVST at The University of Colorado at Boulder), a co-creator of an innovative quality of work life program for university staff (The University of Montana-Missoula), director of graduate studies in communication departments (The University of Colorado a Boulder and The University of Montana-Missoula), director of the Tanner Center for Nonviolent Human Rights Advocacy and the Peace and Conflict Studies program (The University of Utah), and coordinator of a college-wide doctoral program in Communication and Information (Kent State University).\nNoteworthy accomplishments include the expansion of academic curricula, the establishment of community partnerships, the hosting and organizing of national and international conferences, and the promotion of multi-disciplinary collaboration,\nConsultation\nCheney has consulted with a variety of organizations in all three major sectors, including corporations, non-profit agencies, government agencies, and universities. Often this work has been an outgrowth of applied research.\n;Areas of Applied Research, Consultation and Training include:\nAnalysis of organizational culture performance, including organizational structures, communication patterns, leadership styles, decision-making strategies, employee-participation programs, committee and team meetings, mission statements, values/ethics statements, and public-relations campaigns, using both qualitative and quantitative techniques.\nFacilitation of organizational change processes, especially towards greater employee participation and the integration of internal and external corporate communications.\nCrafting and development of mission and ethics statements, quality-of-worklife programs, and comprehensive communications strategies.\nTraining and coaching in presentations, interviewing, committee and board activities, and transformational leadership and mentoring.\nThe benefits of these activities and interventions include: clarity and unity of organizational image/distinctiveness, increased task effectiveness, enhanced collaboration and creativity, and strengthening of ties between work processes and organizational values.\nService\nCheney has served on the boards of numerous non-profit organizations and professional associations, and has reviewed manuscripts for more than 20 journals and presses. In 2008, he was awarded the Gandhi Peacemaker of the Year Award from the Gandhi Alliance for Peace for his outreach efforts between the University of Utah and Salt Lake City. He currently serves on the Advisory Board of Cooperation Texas, where he was a co-author of a 2015 report on scaling up the cooperative economy, and as Associate Editor for the international and interdisciplinary journal Organization (journal), where he has been engaged since 2003. Cheney is a member of the Community Wealth Building Network of Metro Denver..\nCurrent projects\nCheney is pursuing a series of collaborative practical projects on the future of the cooperative economy at Mondragón, in the Basque Country, Spain as well as in North America. These studies treat topics such as the revival and expansion of participation, the potential for clusters and networks of cooperatives in community economic development, and the pursuit of environmental sustainability through the cooperative model. In addition, Cheney collaborates with scholars and practitioners in on the topics of democratic workplaces, economic justice, and environmental sustainability around the world, and particularly at the universities with which he is affiliated. Cheney is collaborating with an array of current and former PhD students at several institutions.\nTogether with his colleagues Lars Thøger Christensen, of the Copenhagen Business School, Theodore E. Zorn Jr., and Shiv Ganesh, both of Massey University, NZ, he is revising a popular textbook, Organizational Communication in an Age of Globalization: Issues, Reflections and Practices, 2nd ed. (Prospect Heights Waveland Press, 2011). And, along with Christensen, Cheney is working on a series of essays on how transparency is used and misused in today's organizations and the implications for democratic practice as well as business and governmental policy.\nPublications\nWorking solo or collaboratively, Cheney has published 10 books and over 100 papers on the topics of identity, ethics, globalization, and peace/war, in addition to workplace democracy and economic solidarity.  These writings range from theoretical essays to editorials to practical guides. All of the books and most of the articles/chapters published since 2000 are listed below.\nBooks\n* Parker, M., Cheney, G., Fournier, V., & Land, C., Eds. (2014).  The Routledge companion to alternative organization. London:  Routledge.\n* Cheney, G., May, S., & Munshi, D., Eds. (2011).  The International Communication Association handbook of communication ethics.  New York:  Routledge. (This volume received a disciplinary award.)\n* Cheney, G., Christensen, L. T., Zorn, T. E. Jr., & Ganesh, S. (2011).  Organizational Communication in an age of globalization: Issues, reflections, practices, 2nd ed. Prospect Heights, IL:  Waveland Press. (Note:  This is an upper-division undergraduate and master's level textbook; it was revised extensively from the first edition; it received a disciplinary award.)\n* Cheney, G., Lair D. L., Ritz, D., & Kendall, B. E. (2010). Just a job?  Communication, ethics and professional life.  New York:  Oxford University Press. (This book was nominated for several disciplinary awards.)\n* Christensen, L. T., Morsing, M., & Cheney, G. (2008) Challenging corporate communication: Convention, complexity and critique. London:  Sage.\n* May, S., Cheney, G., & Roper, S., eds. (2007). The debate over corporate social responsibility. New York:  Oxford University Press. (This book received a disciplinary award.)\n* Cheney, G., & Barnett, G., eds. (2005). OrganizationCommunication: Emerging perspectives, Vol. 7:  International and multicultural approaches. Cresskill, NJ:  Hampton Press, 2005.\n* Cheney, G., Christensen, L. T., Zorn, T. E. Jr., & Ganesh, S. (2004). Organizational Communication in an age of globalization: Issues, reflections and practices. Prospect Heights, IL:  Waveland Press. (Note:  This is an upper-division undergraduate and master's level textbook.)\n* Cheney, G. (1999). Values at work: Employee participation meets market pressure at Mondragón Ithaca and London: Cornell University Press. (Note:  An updated paperback edition with a new preface was issued September 2002. This book received a disciplinary award.)\n* Cheney, G. (1991). Rhetoric in an organizational society:  Managing multiple identities. Columbia: University of South Carolina Press. (Note:  This included a case study of the U.S. Catholic Bishops’ 1983 Pastoral Letter The Challenge of Peace; the book received a disciplinary award, as did the dissertation that preceded it.)\nSelected recent articles and chapters (since 2000)\n*  Derezotes, D., Planalp, S., & Cheney, G. (in press). Transforming conflicts over sustainability. In T. G. Matyok & P. Kellett (Eds.), Communication and conflict transformation:  Local to global engagements.  Lanham, MD: Lexington Books.\n*  Azkarraga, J., & Cheney, G. (in press). Mondragon:  Cooperatives in global capitalism.  In S. Berger, L. Pries, & M. Wannöfel (Eds.),  Companion to workers’ participation at the plant level: A global and comparative perspective. London:  Palgrave.\n*  Wang, Y., Cheney, G., & Roper, J. (2015). Virtue ethics and the practice-institution schema: An ethical case of enlightened business practice.  Journal of Business Ethics, 127, 1-13.\n*  Christensen, L. T., & Cheney, G. (2015). Peering into transparency:  Challenging ideals, proxies and organizational practices.  Communication Theory, 25, 70-90.\n*  Henderson, A., Cheney, G., & Weaver, C. K. (2014). The role of employee identification and organizational identity in strategic organizational and organizational issues management about genetic modification. International Journal of Business Communication, 52, 12-41\n*  Parker, M., Cheney, G., Fournier, V., & Land, C. (2014). The question of organization: A manifesto for alternatives. Ephemera, 14, 621-636.\n* Cheney, G., Santa Cruz, I., Peredo, A.M., & Nazareno, E. Introduction. (2014). Special issue on worker cooperatives. Organization. 21, 591-603.\n* Cheney, G., Kendall, B., & Munshi, D. (2015).  Ethical universalism.  In J. Bennett, ed., Encyclopedia of intercultural competence. Los Angeles: Sage.\n* Cheney, G., Christensen, L. T., & Dailey, S. (2014).  Identity, identification and organizational communication.  In L. L. Putnam & D. Mumby (Eds.), The third handbook of organizational communication.  Thousand Oaks, CA: Sage.\n* Webb, J. T., & Cheney, G (2014). Worker-owned-and-governed cooperatives and the wider cooperative movement: challenges and opportunities within and beyond the global economic crisis.  In Parker, M., Cheney, G., Fournier, V., & Land, C. (Eds.), The Routledge Companion to alternative organization (pp.&nbsp;64–88). London: Routledge.\n* Cheney, G., Beck, G., & Cline, R. (2013).  Community conflict, engagement, and ethics. In J. Oetzel and S. Ting-Toomey (Eds.), Handbook of conflict communication, 2nd ed (pp.&nbsp;487–512).  Thousand Oaks, CA:  Sage.\n* Cheney, G., and Grant, S. (2013). Values. In V. Smith (Ed.), Encyclopedia of the Sociology of Work (Thousand Oaks, CA:  Sage)\n* Cheney, G., Lair, D. J., & Kendall, B. E. (2013). Making organization matter: Looking back and looking ahead (20th anniversary issue).  Organization, 20 (1), 67-77.\n* Cheney, G., & Zorn, T. E. Jr. (2013).  The meaning of work and meaningful work:  Implications for cross-national comparison and practice.  In Goodboy, A. (Ed.), Translating Scholarship into Meaningful Practice (pp.&nbsp;315–322).  Dubuque, IA:  Kendall/Hunt.\n* Azkarraga, J., Cheney, G., & Udaondo, A. (2012).  Work, decision making, and participation at Mondragón:  The experimental case of LANKI's partnership with FAGOR.  In M. Atzeni (Ed.), Alternative work organizations (pp.&nbsp;76–102).  London:  Palgrave.\n* Ortiz, E., Agyeman-Budu, E., & Cheney, G. (2011). How should corporate social responsibility address labor migration, in light of market globalization? In K. Korinek & T. Maloney (Eds.), Migration in the 21st century: Rights, outcomes, and policy (pp.&nbsp;54–76). Routledge.\n* Cheney, G. (2008). Bureaucracy. In W. Donsbach (ed.), Encyclopedia of Communication (available online from the International Communication Association (6 pp.).\n* Cheney, G. (2008). The ethics of engaged scholarship. In J. L. Simpson, J. K. Barge, & P. Shockley-Zalabak (Eds.), special issue of the Journal of Applied Communication Research, 36, 281-288.\n* Cheney, G., Zorn, T. E. Jr., Planalp, S., & Lair, D. J. (2008).  Meaningful work and personal/social well-being:  Organizational communication engages the meanings of work. In C. * Beck (Ed.), Communication Yearbook 32 (pp.&nbsp;137–186). Thousand Oaks, CA:  Sage.\n* Cheney, G. (2007). Organizational communication comes out. In K. Krone & L. Harter (Eds.), Forum on organizational communication and the public intellectual. Management Communication Quarterly.\n* Cheney, G., & Ashcraft, K. L. (2007). Considering “the professional” in communication studies:  Implications for theory and research within and beyond the boundaries of organizational communication. Communication Theory, 17 (2007), 146-175.\n* Kendall, B. E., Gill, R., & Cheney, G. (2007). Consumer activism and corporate social responsibility:  How strong a connection?”  In S. K. May, G. Cheney, & J. Roper (Eds.), The debate over corporate social responsibility (pp. 241-266). New York:  Oxford University Press.\n* Henderson, A., Weaver, C. K., & Cheney, G. (2007). Talking facts:  Identity and rationality in industry perspectives on genetic modification,” Discourse Studies, 9 (2007), 90-42. (lead article)\n* Simpson, M., & Cheney, G. (2007). Marketisation, participation and communication within New Zealand retirement villages:  A critical-rhetorical and discursive analysis. Discourse & Communication, 1, 191-222.\n* Cheney, G. (2006). Democracy at work within the market:  Reconsidering the potential. In V. Smith (Ed.), Research in the Sociology of Work, vol. 16: Worker participation: current research and future trends (pp.&nbsp;179–204). Oxford, UK:  Elsevier/JAI, 2006\n* Cheney, G., & Christensen, L. T. (2006). What should PR theory do, practically speaking? Journal of Communication Management, 10, 100-102.\n* Cheney, G., & Cloud, D. L. (2006). Doing democracy, engaging the material: Employee participation and labor activity in an age of market globalization. Management Communication Quarterly, 19, 501-540. (lead article)\n* Cheney, G., Christensen, L. T., Conrad, C., & Lair, D. L. (2005). Corporate rhetoric as organizational discourse. In D. Grant, C. Hardy, C. Oswick, N. Phillips, & L. Putnam (Eds.), Handbook of organizational discourse (pp.&nbsp;79–103). Thousand Oaks, CA:  Sage.\n* Roper, J., & Cheney, G. (2005). Social entrepreneurship:  History, dimensions, and limitations. Corporate Governance, 5, 95-104.\n* Ganesh, S., Zoller, H., & Cheney, G. (2005). Organizational resistance and globalization from below. Communication Monographs, 72, 169-191.\n* Lair, D.J., Sullivan, K, & Cheney, G. (2005). The rhetoric and ethics of personal branding.  Management Communication Quarterly, 18, 307-343.\n* Cheney, G., & Lair, D. J. (2004). “Following” and leading dissent in U.S. politics and labor. In  N. S. Huber and J. T. Wren (Eds.), Building leadership bridges 2004 (pp.&nbsp;115–139). College Park, MD: International Leadership Association.\n* Cheney, G., Wilhelmsson, M., & Zorn, T. E. Jr. (2002). Ten strategies for engaged scholarship.   Management Communication Quarterly, 16, 92-100.\n* Stohl, C. & Cheney, G. (2001). Participatory processes/paradoxical practices:  Communication and dilemmas of organizational democracy. Management Communication Quarterly, 14, 349-407. (recipient of award)\n* Taylor, J. R., Flanagin, A., Cheney, G., & Seibold, D. R. (2001). Organizational communication: Key moments, central concerns, and future challenges. In W. Gudykunst (Ed.), Communication Yearbook 24, pp.&nbsp;99–137.\n* Cheney, G. (2000). On interpreting interpretive research: Toward perspectivism without relativism. In S. R. Corman & M. S. Poole (Eds.), Perspectives on organizational communication: Finding common ground (pp.&nbsp;17–45). New York:  Guilford.\n* Zorn, T. E., Christensen, L. T., & Cheney, G. (2000).  Do we really need constant change? San Francisco: Berrett-Koehler.\nReferences"
    }
  ]
}