{
  "content": [
    {
      "type": "text",
      "text": "# George H. W. Bush 1988 presidential campaign\n\n| logo_size    =\n| logo_alt     =\n| campaign     = 1988 Republican primaries1988 U.S. presidential election\n| candidate    = George H. W. Bush 43rd Vice President of the United States(1981–1989)Dan QuayleU.S. Senator from Indiana(1981–1989)\n| affiliation  = Republican Party\n| status       = Announced: October 13, 1987Presumptive nominee: April 26, 1988Official nominee: August 18, 1988Won election: November 8, 1988Certification: January 4, 1989Inaugurated: January 20, 1989\n| formed       =\n| announced    =\n| launched     =\n| suspended    =\n| headquarters = Washington, D.C.\n| key_people   = Lee Atwater (campaign manager), Roger Ailes (media director)\n| receipts     =\n| fec_date     =\n| slogan       = Experienced Leadership For America's FutureKinder, Gentler Nation\n| themesong    =\n| chant        =\n| website      =\n}}\nThe 1988 presidential campaign of George H. W. Bush, the 43rd vice president of the United States under President Ronald Reagan, began when he announced he was running for the Republican Party's nomination in the 1988 U.S. presidential election on October 13, 1987. Bush won the 1988 election against the Democratic Party’s nominee Michael Dukakis on November 8, 1988. He was subsequently inaugurated as president on January 20, 1989.\nPrimaries\nBush's three main opponents in the 1988 Republican Party presidential primaries were Senator Bob Dole (R-KS); Pat Robertson, an evangelist; and Representative Jack Kemp (R-NY). Bush was long held back by the widespread perception of him as a \"wimp\" who had only ever done the bidding of others. His efforts to fight this perception included recruiting Roger Ailes to emphasize Bush's status as a World War II veteran, which Ailes did by producing a biographical ad.\nIn that year's Iowa caucus, held on February 8, 1988, Bush finished in third, behind winner Dole and runner-up Robertson. Bush's support then began to deteriorate, partly because former Secretary of State Alexander M. Haig Jr. had recently endorsed Dole. The Bush campaign then decided to produce an attack ad against Dole. Ailes got the idea to make an ad portraying Dole as a \"straddler\" on the issue of raising taxes, based on one of Dole's own ads describing Bush with the same word.\nBush's campaign focused on building a \"Firewall\" in the Southern United States, a strategy that proved successful after he won multiple primaries there on March 8. Bush was also successful in winning the New Hampshire primary against Dole on February 16, partly with help from the state's then-governor John H. Sununu, who successfully convinced many political figures in the state to support Bush by offering them low-digit license plates. Subsequently, Bush became the probable Republican nominee, completing a transformation of his status from loser to front-runner in 29 days.\nAfter Bush's convincing performance on Super Tuesday on March 8, in which he won all 16 primaries, Dole dropped out of the race, making Bush the presumptive Republican nominee. After it became clear that Bush would be the Republican nominee, President Ronald Reagan endorsed him, saying in May 1988 that \"I'm going to work as hard as I can to make Vice President George Bush the next president of the United States\". Reagan did not campaign strongly for Bush during the rest of the election, however.\nEndorsements\nCelebrities\n*Tony Danza, actor\n*Clint Eastwood, actor\n*Dale Evans, actress\n*Helen Hayes, actress\n*Bob Hope, comedian\n*Shirley Jones, actress\n*Cheryl Ladd, actress\n*Rich Little, comedian\n*Chuck Norris, actor\n*Hugh O'Brian, actor\n*Roy Rogers, singer and actor\n*Arnold Schwarzenegger, actor\n*Tom Selleck, actor\n*Frank Sinatra, singer\n*Robert Stack, actor\nConvention\nThe 1988 Republican National Convention was held in New Orleans, Louisiana. On the convention's second day, Bush announced that he had chosen Senator Dan Quayle (R-IN) as his running mate. By the end of the convention, Bush had increased his poll numbers to comfortably surpass those of Dukakis, and he went on to maintain that lead during the rest of his campaign.\nMessage\nBush did not promise any major changes to the policies of then-sitting President Reagan. That year, the Republican Party platform stated, \"Our platform reflects George Bush's belief that military strength, diplomatic resoluteness, and firm leadership are necessary to keep our country and our allies free.\" During his acceptance speech, Bush uttered the phrase \"Read my lips: no new taxes\", which was written by Peggy Noonan and served as the speech's centerpiece. During Bush's presidency, this remark came back to haunt him because he went on to raise taxes during his presidency. The contradiction between Bush's words and subsequent actions as president formed the basis of an attack ad Bill Clinton ran against Bush in the former's successful 1992 presidential campaign.\nPersonnel\nBush's campaign manager in 1988 was Lee Atwater, a political consultant who Bush subsequently named chair of the Republican National Committee after becoming the Republican nominee. Shortly before his death, Atwater apologized for saying that he \"would strip the bark off the little bastard [Dukakis]\" and \"make Willie Horton his running mate,\" telling Life that \"I am sorry for both statements: the first for its naked cruelty, the second because it makes me sound racist, which I am not.\" Bush's media advisor was Roger Ailes, who produced the \"Revolving Door\" attack ad for Bush's campaign. The ad was criticized by Democrats for being race-baiting. In May 1988, Ailes and Atwater assembled two focus groups, each of which consisted of 15 likely Dukakis voters, and had the focus group leader read versions of Dukakis' past statements and positions. They found that saying this material reduced support for Dukakis in both groups. That fall, Bush focused extensively on the issues raised in these focus groups.\nTelevision advertising\nThe Bush campaign, and independent groups supporting it, made effective use of attack ads to reduce support for Dukakis. The most famous of these ads was the \"Willie Horton\" ad attacking Dukakis over Massachusetts' furlough program. Atwater  persuaded Bush to go along with the ad by noting that Bush was behind Dukakis by 17 points at the time, warning him that \"You can get so far behind that even a good campaign won't win it for you.\"\nResults\nBush did better in every southern state than Reagan had done in 1980.\nEndorsements\nSee also\n*1988 Republican Party presidential primaries\n*1988 Republican Party vice presidential candidate selection\n*1988 Republican National Convention\n*1988 United States presidential election\n*Presidential transition of George H. W. Bush\n*Inauguration of George H. W. Bush\n*Michael Dukakis 1988 presidential campaign\n*George H. W. Bush 1992 presidential campaign\nReferences\nWorks cited\n*\nExternal links\n*[http://www.4president.org/speeches/1988/georgebush1988announcement.htm George H. W. Bush announcement speech]\n*[http://www.4president.org/speeches/1988/georgebush1988acceptance.htm George H. W. Bush acceptance speech]"
    }
  ]
}