{
  "content": [
    {
      "type": "text",
      "text": "# George Manwaring__disambig_1\n\n| birth_place   = Cheshire, England\n| home_town     =\n| nationality   =\n| death_date    =\n| death_place   = Salt Lake City, Utah, United States\n| death_cause   =\n| resting_place = Salt Lake City Cemetery\n| resting_place_coordinates =\n| monuments     =\n| residence     =\n| education     =\n| alma_mater    =\n| occupation    =\n| employer      =\n| organization  =\n| notable_works =\n| title         = LDS Church hymn writer\n| spouse        = Martha R. Whittaker Electa Stevenson\n| children      = Edna ManwaringJoseph H. ManwaringLorus ManwaringMyron Manwaring\n| parents       = Henry ManwaringSarah Barber\n| relatives     =\n| awards        =\n| website       =\n| portals       = LDS\n}}\nGeorge Manwaring (March 19, 1854 – July 7, 1889) was a hymnwriter of the Church of Jesus Christ of Latter-day Saints. Some of his works have become favorite LDS hymns and are found in the 1985 LDS Church hymnal.\nBiography\nGeorge Manwaring was born in Cheshire, England to Henry Manwaring and Sarah Barber. The family converted to the Church of Jesus Christ of Latter-Day Saints and emigrated to Utah Territory when Manwaring was 17 years old, in 1871. They settled first in Salt Lake City, then permanently in Springville.\nManwaring's brother, John H. Manwaring, and his son, George Ernest Manwaring, wrote a biography of George. George Manwaring had only a few weeks of formal schooling and no formal music training, but was noted for his talent. As a youth in Cheshire, England, he had worked as an errand boy in the country store, and would take advantage of every opportunity to read good books, borrowing books from his employer and others. He became very much interested in the study of stenography, mathematics and literature, and when he arrived in Utah would use his stenographic ability to report sermons delivered in the Mormon Tabernacle. Manwaring was able to play piano and organ, and taught these as well. He was just 24 years old when he wrote the text and composed the tune for \"Joseph Smith’s First Prayer.\" At the time he was a husband with two little children and a third on the way. The hymn, also known as \"Oh How Lovely Was the Morning,\" recounts the vision of the 14-year-old boy Joseph Smith. Manwaring was on a sales trips for the D. O. Calder Music Palace when artist C.C.A. Christiansen took him into his studio and showed Manwaring a painting he had just finished. The painting was titled The Vision, and depicted the Father and Son appearing to Joseph Smith in the sacred grove in answer to prayer. During his lifetime, George would write over a hundred poems and hymns.\nManwaring was a bass in the Tabernacle Choir at Temple Square beginning in 1885, when he was in his early thirties.[http://www.mormontabernaclechoir.org/roster/names?letter=M The Official Site of the Mormon Tabernacle Choir]\nGeorge Manwaring died when he was only thirty-five, leaving behind both parents, six siblings, seven children, and two widows. A search of contemporary documents shows Manwaring had been one of 1300+ Mormons incarcerated by the US government under the 1882 Edmunds Act, which also stripped Mormons who would not deny their faith of the right to vote, serve on juries, or hold elected office. Manwaring was released on June 12, 1889. Manwaring died of pneumonia on July 7, 1889, less than a month after his release from the penitentiary.\nHymns\nSeveral of George's poems were put to music and made hymns. Some of these have been included in the 1985 LDS Church hymnal.\n*\"Joseph Smith's First Prayer\" (describing what is known as the First Vision)\n*\"Lord, We Ask Thee Ere We Part\"\n*\"Sing We Now at Parting\"\n*\"'Tis Sweet to Sing the Matchless Love\"\n*\"We Meet Again in Sabbath School\"\nNotes\nExternal links\n*"
    }
  ]
}