{
  "content": [
    {
      "type": "text",
      "text": "# George Strahan (colonial administrator)\n\n| birth_place         = Fraserburgh, Aberdeenshire, Scotland, United Kingdom\n| death_date          =\n| death_place         = Bournemouth, Dorset, England, United Kingdom\n| spouse              = Catherine Livingstone\n| order               = 67th Governor of the Gold Coast Colony\n| term_start          = June 1874\n| term_end            = 7 April 1876\n| monarch             = Victoria\n| successor           = Charles Lees\n| predecessor         = Charles Lees\n| order2              = 14th Governor of Barbados and the Windward Islands\n| term_start2         = 1876\n| term_end2           = 1880\n| monarch2            = Victoria\n| successor2          = D.J. Gamble\n| predecessor2        = Sir John Pope Hennessy\n| order3              = 5th Governor of Tasmania\n| term_start3         = 7 December 1881\n| term_end3           = 28 October 1886\n| monarch3            = Victoria\n| successor3          = Robert George Crookshank Hamilton\n| predecessor3        = Frederick Weld\n| nickname            =\n| allegiance          = United Kingdom\n| branch              = British Army\n| serviceyears        = 1857–\n| rank                = Major\n| unit                = Royal Artillery\n| alma_mater          = Royal Military Academy, Woolwich\n}}\nMajor Sir George Cumine Strahan  (9 December 1838 – 17 February 1887) was a British military officer and colonial administrator, best known as the Governor of Tasmania from 1881 to 1886.\nEarly life and military career\nStrahan was born on 9 December 1838 in Fraserburgh, Aberdeenshire, Scotland, in the United Kingdom. After graduating from the Royal Military Academy, Woolwich, he joined the Royal Artillery corps of the British Army as a lieutenant in 1857.\nColonial career\nStrahan was assigned as aide-de-camp to the last two Lord High Commissioners of the Ionian Islands: William Ewart Gladstone (actually High Commissioner Extraordinary, later to become Prime Minister) and Sir Henry Storks. When Storks was appointed Governor of Malta in 1864, Strahan accompanied him and served his successor, Sir Patrick Grant, until 1868 when he was made chief secretary of Malta. Further administrative appointments in various capacities followed in the Bahamas (colonial secretary 1868–1872, acting governor 1872–1873), Lagos Colony (administrator 1873–1874), Gold Coast (governor 1874–1876) and the Windward Islands/Barbados (governor 1876–1880).\nGovernor of Tasmania\nStrahan was appointed Governor of Tasmania in April 1880, and was knighted shortly after. He did not, however, take up the appointment until arriving in Hobart in December 1881. The long delay was caused by Strahan acting as administrator of the Cape Colony and high commissioner to Southern Africa until the arrival of Sir Hercules Robinson.\nStrahan was a popular governor in Tasmania, regarded as attentive to education, health and rural industry. His own health was occasionally questioned, and the spells of illness he suffered during his term were put down to having spent so many years in the tropical climates of the Caribbean and Africa.\nStrahan left Tasmania in October 1886, and returned to England via Melbourne. He was appointed as Governor of Hong Kong to replace Sir George Bowen, but died in Bournemouth on 17 February 1887 before he could take up the appointment.\nLegacy\nThe town of Strahan on the West Coast of Tasmania was named after George Strahan in 1892.\nStrahan Street in North Hobart was built by local landowner, Alfred Winter in late 1885 and sold to the Council on the premise that they would maintain it, originally intended to be known as Winter Street, the Hobart City Council named it after George Strahan, the then Governor of Tasmania in 1886.\nReferences\n*Neil Smith, '[https://adb.anu.edu.au/biography/strahan-sir-george-cumine-4651 Strahan, Sir George Cumine (1838–1887)]', Australian Dictionary of Biography, Volume 6, Melbourne University Press, 1976, pp.&nbsp;203–204."
    }
  ]
}