{
  "content": [
    {
      "type": "text",
      "text": "# George Nugent-Temple-Grenville, 1st Marquess of Buckingham\n\n| image               = 1stMarquessOfBuckingham.jpg\n| imagesize           = 225px\n| smallimage          =\n| caption             = Portrait by Thomas Gainsborough\n| birthname = George Grenville\n| birth_date = 17 June 1753\n| birth_place =\n| death_date =\n| death_place = Stowe, Buckinghamshire, England\n| resting_place = Wotton Underwood, Buckinghamshire, England\n| office              = Secretary of State for Foreign Affairs\n| term_start          = 19 December 1783\n| term_end            = 23 December 1783\n| monarch             = George III\n| primeminister       = William Pitt\n| predecessor         = Charles James Fox\n| successor           = Marquess of Carmarthen\n| office1             = Lord Lieutenant of Ireland\n| term_start1         = 27 October 1787\n| term_end1           = 24 October 1789\n| monarch1            = George III\n| primeminister1      = William Pitt\n| predecessor1        = The Duke of Rutland\n| successor1          = The Earl of Westmorland\n| term_start2         = 15 August 1782\n| term_end2           = 3 May 1783\n| monarch2            = George III\n| primeminister2      = The Earl of Shelburne  The Duke of Portland\n| predecessor2        = The Duke of Portland\n| successor2          = The Earl of Northington\n| office3             = Member of Parliamentfor Buckinghamshire\n| term_start3         = 1774\n| term_end3           = 1779\n| predecessor3        = Richard Lowndes\n| successor3          = Thomas Grenville\n| alma_mater          =\n| occupation = Statesman\n| spouse =\n| children =\n| parents =\n| relatives =\n}}\nGeorge Nugent-Temple-Grenville, 1st Marquess of Buckingham (17 June 1753 – 11 February 1813), known as George Grenville before 1779 and as the Earl Temple between 1779 and 1784, was a British statesman.\nBackground and early life\nGrenville was the eldest son of George Grenville, Prime Minister of Great Britain, and his wife, the former Elizabeth Wyndham, daughter of Sir William Wyndham, 3rd Baronet. He was the nephew of Richard Grenville-Temple, 2nd Earl Temple (his father's elder brother), and the elder brother of Thomas Grenville and of William Grenville (later 1st Baron Grenville and also Prime Minister of Great Britain). In 1764, he was appointed a Teller of the Exchequer. He was educated at Eton College from 1764 to 1770 and matriculated at Christ Church, Oxford in 1770. In 1774 he undertook a Grand Tour through Italy and Austria. In 1775, he married the Hon. Mary Nugent, daughter of Robert Nugent, 1st Viscount Clare, and the following year his father-in-law Lord Clare was created Earl Nugent, with special remainder (in default of his own heirs male, of which he had none) to his new son-in-law.\nPolitical career\nin 1783, showing Buckingham in the robes of a Knight of the Order of St Patrick]]\nGrenville was returned as Member of Parliament for Buckinghamshire at the 1774 general election. In the House of Commons he emerged as a sharp critic of the American policy of Lord North. In September 1779, he succeeded his uncle as 3rd Earl Temple and moved to the House of Lords.\nThe now Lord Temple also took the additional family names Nugent and Temple by Royal Warrant issued on 4 December making the compound family name Nugent-Temple-Grenville. In 1782, Temple was appointed Lord Lieutenant of Buckinghamshire and in July 1782, he became a member of the Privy Council and Lord Lieutenant of Ireland in the Ministry of Lord Shelburne. He was instrumental in the enactment of the Renunciation Act 1783 (23 Geo. 3. c. 28), which supplemented the legislative independence granted to Ireland in 1782. As Lord Lieutenant of Ireland, and by royal warrant, he created the Order of St Patrick in February 1783, with himself as the first Grand Master. He left Ireland in 1783 and again turned his attention to English politics. He enjoyed the confidence of King George III, and having opposed Fox's East India Bill, he was authorised by the king to say that \"whoever voted for the India Bill was not only not his friend, but would be considered by him as an enemy\", a message which ensured the defeat of the bill. He was appointed a Secretary of State when Pitt the Younger (his father's sister's son) formed his ministry in December 1783, but resigned only three days later. This was the shortest cabinet tenure until Michelle Donelan in 2022.\nIn December 1784, Lord Temple was created Marquess of Buckingham. In November 1787, he was again appointed Lord Lieutenant of Ireland, this time under Pitt, but his second tenure of this office proved less successful than the first. Grattan denounced him for extravagance; the Irish Parliament censured him for refusing to transmit to England an address calling upon the Prince of Wales to assume the regency; and he could only maintain his position by resorting to bribery on a large scale. When his father-in-law died in 1788, Buckingham succeeded him as 2nd Earl Nugent. However, since he already held a marquessate, he was never known by this title. (His wife was, however, created Baroness Nugent in 1800, with special remainder to their second son, Lord George Nugent-Grenville.) Having become very unpopular, he resigned his office in September 1789.\nLater years\nBuckingham subsequently took very little part in politics, although he spoke in favour of the Act of Union of 1800. His wife died in 1812 and he died on 11 February 1813 at his residence, Stowe in Buckinghamshire. He was buried at his ancestral home Wotton. He left two sons: Richard, Earl Temple (who succeeded him as 2nd Marquess of Buckingham and was later created Duke of Buckingham and Chandos) and George, 2nd Baron Nugent (who had succeeded his mother in that title on her death).\nA number of streets on the northside of Dublin are named for him including, Buckingham Street, Temple Street and Grenville Street.\nSee also\n*Grenvillite\nReferences\n*\nExternal links\n*"
    }
  ]
}