{
  "content": [
    {
      "type": "text",
      "text": "# George Washington Revolutionaries men's soccer\n\n}}\n|division =\n|city = Washington\n|stateabb = DC\n|state = District of Columbia\n|coach =  Craig Jones\n|tenure = 12th\n|stadium = Mount Vernon Athletic Field\n|capacity = 300\n|nickname = Revolutionaries\n| pattern_la1   =\n| pattern_b1    = _gw soccer22\n| pattern_ra1   =\n| pattern_sh1   =\n| pattern_so1   =\n| leftarm1      = ffffff\n| body1         = ffffff\n| rightarm1     = ffffff\n| shorts1       = ffffff\n| socks1        = ffffff\n| pattern_la2   =\n| pattern_b2    =  _gw soccer22\n| pattern_ra2   =\n| pattern_sh2   =\n| pattern_so2   =\n| leftarm2      = 00264A\n| body2         = 00264A\n| rightarm2     = 00264A\n| shorts2       = 00264A\n| socks2        = 00264A\n|NCAAchampion =\n|NCAArunnerup =\n|NCAAcollegecup =\n|NCAAeliteeight =\n|NCAAsweetsixteen = 1989\n|NCAAtourneys = 1989, 2002, 2004\n|conference_tournament = 2002, 2004\n|conference_season = 1992, 2011, 2015\n}}\nThe '''George Washington Revolutionaries men's soccer team''' is a varsity intercollegiate athletic team of George Washington University in Washington, D.C., United States. The team is a member of the Atlantic 10 Conference, which is part of the National Collegiate Athletic Association's Division I. George Washington's first men's soccer team was fielded in 1967. The team plays its home games at Mount Vernon Athletic Field in Washington, D.C. The Revolutionaries are coached by Craig Jones.\nAmong the program's major titles, the Revolutionaries have collected two A10 Championships in 2002 and 2004 and 3 Regular Season A10 titles in 1992, 2011 and 2015. The Revolutionaries have made it to the NCAA Tournament 3 times, including the Round of 16 in 1989. The team has won the DC College Cup twice in 2007 and 2008. The cup is a competition between four Washington metropolitan area universities including George Mason, Georgetown, American, and Howard.\nCoaching\nGeorge Lidster coached GW for 24 years and is the winningest coach in the team's history and has amassed 201 wins to this point. A native of England, Lidster began his career playing professionally in Europe for Newcastle United F.C. and later Darlington F.C. He has played with former US National team players including John Kerr Jr. and Bruce Murray. Before GW he was assistant coach at nearby George Mason University. He has been named A10 Coach of the year three times in 1989, 1992, and 2011. He will be succeeded by Assistant Coach and former GW player and captain Craig Jones at the start of 2012 season.\nDuring the 2015 season, Head Coach Craig Jones was named A10 Coach of the Year as his squad won the A10 Regular Season Title on the final game day in overtime away at St. Louis, but lost in the first round of the A10 tournament.\n2011 season\n2011 Season: The 2011 season saw one of GW's most successful teams in the history of the program as the team won the regular season championship finishing 7–2 in conference play, including a 5–0 record at home conceding 0 goals. The team ended its regular season in dramatic fashion capturing its first A10 regular season title in nearly 20 years with a 1–0 victory against Duquesne University in front of nearly 1,000 fans.  George Lidster also earned his 200th win in the final regular season game, which saw the team capture the title and a second place bid into the A10 Tournament.  The team finished second to Xavier in the tournament.\nPlayers\nCurrent squad\nHonors\n*A10 Coach of the Year\n**Craig Jones: 2015\n*Atlantic 10 Conference\n**Winners (Tournament) (2): 2002, 2004\n**Winners (Regular Season) (3): 1992, 2011, 2015\n*D.C. College Cup\n**Winners (2): 2006, 2007\nReferences\nExternal links\n*\n* [http://encyclopedia.gwu.edu/gwencyclopedia/index.php?title=Soccer_(Men) GWU Encyclopedia]"
    }
  ]
}