{
  "content": [
    {
      "type": "text",
      "text": "# George, Emperor of Trebizond\n\nGeorge Megas Komnenos (, Geōrgios Mégas Komnēnos;  1255 – after 1284) was Emperor of Trebizond from 1266 to 1280. He was the elder son of Emperor Manuel I and his third wife, Irene Syrikaina, a Trapezuntine noblewoman. He succeeded his half-brother Andronikos in 1266 and ruled for 14 years. George was the first Trapezuntine emperor to officially use the style Megas Komnenos (\"grand Komnenos\"), which had previously been merely a nickname.\nReign\nThe details of the internal affairs of his reign are sparse. Beyond the length of his reign, all Michael Panaretos relates explicitly about George is the cryptic statement that he \"was treacherously betrayed by his officials on the mountain of Taurezion and taken captive in June [of 1280]\". Although three different Armenian chronicles state he was killed by Abaqa Khan of the Ilkhan, along with the atabeg of Lori, he was very much alive in 1284 when he returned to Trebizond and attempted to recover his throne during the reign of his brother John II, when Panaretos states he was known as \"the Vagabond\".\nMichel Kuršanskis has pointed out that his father's embassy in 1253 to King Louis IX of France, who was then at Sidon, seeking to marry a daughter of his house was the act of a widower. Kuršanskis then convincingly argues that Manuel's marriage to Irene Syrikaina occurred after that year, which means George was no older—and likely several years younger—than 13 at the time of his coronation. So for the first several years of his reign he relied on a regent to govern the Empire.\nThe details of the foreign affairs of his reign are relatively more abundant. One factor was that his rival for the claim to the throne of the Byzantine Empire, Michael VIII Palaiologos, had agreed to unify the Orthodox and Catholic Churches, and an agreement was signed at the Second Council of Lyons in 1274; as a result George was increasingly seen as the champion of the anti-Unionist faction. George found himself directly threatened by Mu‘in al-Din Suleyman who controlled Sinope to the west and the Georgian state of Samtzkhe-Meschla to the east; Imereti was also a potential threat, and its ruler, David the Clever had married one of Michael's daughters in 1267. Michael had also married another daughter to Abaqa Khan of the Ilkhan. Consequently, George was forced into negotiations with Michael Palaiologos' enemies. As early as 1266-7 Charles of Anjou, King of Naples, wrote to George; George's response is not known. The protonotary Ogerius reported to Pope Nicholas III that George was upsetting the Union of Churches that Michael Palaiologos promoted. \"It was not so much that Charles of Anjou had a quixotically loyal ally in Trebizond,\" writes Anthony Bryer, \"as that while Michael was forcing his subjects into the union, George was pushed by anti-Unionist refugees from Constantinople into posing as champion of Orthodoxy and into seeking to replace the 'heretical' Michael as emperor in Constantinople.\"\nThe Annals of Bishop Stephen state that George had an unnamed daughter, who married a Georgian nobleman. Another possible daughter (or sister) married King Demetre II of Georgia.\nThe betrayal at Taurezion\nThe cryptic note that George was betrayed on the mountain of Taurezion has baffled scholars about both the location and the exact event. No other text directly mentions \"the mountain of Taurezion\". There have been several suggested explanations: the Taurus Mountains, one of several locations to the south of Trebizond, and a Taroutza in eastern Anatolia. Bryer discusses these possibilities before pointing out the weaknesses in their identification, and arguing that by \"Taurezion\" Panaretos meant Tabriz, which was known in a form at the time similar to \"Taurezion\": spellings include the Armenian \"T'awrez\" or \"Davrez\"; Marco Polo called it \"Tauris\", and a Syrian bishop of \"Taurezium\" is mentioned in 1277.\nAs for how George was betrayed, there are at least two differing suggestions. On the one hand, George Finlay and William Miller have interpreted this as meaning that he was captured in battle, which has been followed by other historians. On the other hand, Anthony Bryer has published an article in the Byzantinische Zeitschrift arguing that this passage should be interpreted as saying that George was betrayed to Abaqa Khan by his archontes on a mountain near Tabriz, where Abaqa was residing in summer of 1280. Some scholars, such as Michel Kuršanskis, have accepted Bryer's interpretation.\nA third researcher, Ahmet Zehiroglu, has suggested George was trapped as a result of the Byzantine conspiracy and taken prisoner along with his mother by Abaqa Khan, on Dersim Mountains and in the summer of 1280.\nBryer further points out that there are signs George never fully assumed the title of Emperor (basileus), where there is evidence that his father Manuel had before him, and his brother John after him. No silver coinage was struck in his name—although a surprisingly large amount (over 200 dies) was struck in his father's; Bryer suggests some of it was issued by George in his father's name. Only one of his copper coin issues does he bear the epithet of \"Grand Komnenos\", while in another he is described as \"Despot\" (despotes), a title subsidiary to Emperor. Further, he is the only ruler of Trebizond that Panaretos, in his chronicle, fails to call \"Grand Komnenos\", and does not refer to his mother Irene Syrikaina as \"despoina\". \"It is possible that Abaga refused to recognize him as Grand Komnenos,\" Bryer writes, \"hence the subsidiary title of Despot on one of his coin types, his failure to coin silver aspers and Panaretos' reticence in according him any title.\"\nHaving made his argument, Bryer then speculates on George's last documented years. Bryer points out that it was not an impostor who appeared in Trebizond in 1284, for \"it is unlikely that John II would have failed to recognize his full older brother\". Instead Bryer suggests that for various reasons Abaga spared George and imprisoned him, and on Abaga's death on 1 April 1282, George was released. Then \"he went to his son-in-law Demetrius II of Georgia and from Georgia launched an attack on Trebizond in 1284\", only to be rejected by the same people who betrayed him four years earlier.\nReferences\n* The Oxford Dictionary of Byzantium, Oxford University Press, 1991.\nExternal links\n*[http://www.ehw.gr/l.aspx?id=7586 Vougiouklaki Penelope, \"George Grand Komnenos\"], Encyclopedia of the Hellenic World: Asia Minor"
    }
  ]
}