{
  "content": [
    {
      "type": "text",
      "text": "# George Ward Gunn\n\n|branch       =\n|serviceyears =1939 - 1941\n|servicenumber=143906\n|rank         =Second Lieutenant\n|unit         =Royal Horse Artillery\n|battles      =World War II\n*North African campaign\n**Western Desert campaign\n***Operation Crusader\n****Battle of Sidi Rezegh\n|awards       =Victoria CrossMilitary Cross\n}}\nSecond Lieutenant George Ward Gunn VC MC (26 July 1912 - 21 November 1941) was a British Army officer and an English recipient of the Victoria Cross (VC), the highest and most prestigious award for gallantry in the face of the enemy that can be awarded to British and Commonwealth forces.\nLife\nGunn was born in Neston, Cheshire. He was educated at Sedbergh School and Mostyn House. He joined the Army in 1939, and was commissioned as a second lieutenant the following year.\nHe was 29 years old, and a second lieutenant in the 3rd Regiment Royal Horse Artillery, British Army during World War II when the action took place for which he was awarded the VC.\nDuring the British attempt to relieve the siege of Tobruk, the Germans counter-attacked near the airfield of Sidi Rezegh.\nOn 21 November 1941 at Sidi Rezegh, Gunn was the commander of A Troop of J Battery. These four QF 2 pounder anti-tank guns mounted portee on trucks were part of a battery of twelve guns attached to the Rifle Brigade.\nAn attack earlier in the day was driven off but the main attack was by 60 German tanks. Gunn - in an unarmoured vehicle - drove between the guns under his command, encouraging and reorganising them as the battle progressed. Three guns had been knocked out and their crews fatally wounded when the last was hit. Except the sergeant, the crew were dead or disabled and the vehicle set alight. The battery commander Major Pinney attacked the flames and Gunn crossed the enemy fire to join him. Gunn took over the gun aiming and firing it with the sergeant acting as his loader. Despite enemy fire and the danger of the flames exploding the ammunition with which the portee was loaded, Gunn  fired 40- 50 rounds from the QF 2 pounder gun and set two enemy tanks on fire before he himself was killed by being shot through the head.\nAfter he was killed, the battery commander took over the gun and continued the action. As a result of the battery's actions, it was given the honour title \"Sidi Rezegh\".\nThe official announcement in the London Gazette of the award said of him \"Second-Lieutenant Gunn showed the most conspicuous courage in attacking this large number of enemy tanks with a single unarmoured gun, and his utter disregard for extreme danger was an example which inspired all who saw it. He remained undismayed by intense fire and overwhelming odds, and his gallant resistance only ceased with his death. But for this very gallant action the enemy tanks would undoubtedly have over-run our position.\"\nA memorial to Gunn stands in his old school, Sedbergh, and at Mostyn House commemorating his brave deeds. A street was named in his honour in Neston (\"Gunn Grove\"), a JLRRA training troop was created in his name (Gunn Troop 33 Campbell Battery RA) and a memorial was placed in the Parish Church, (St Mary & St Helen's).\nThe medal\nHis Victoria Cross is displayed at the Royal Artillery Museum in Woolwich, England.\nNotes\nNotes\nReferences\n*\n*\n*\n*\n*Allied Tank Destroyers, Vanguard 10, Osprey Publishing\nExternal links\n*[http://www.cwgc.org/find-war-dead/casualty/2162251 CWGC entry]"
    }
  ]
}