{
  "content": [
    {
      "type": "text",
      "text": "# George C. Edwards\n\n| birth_place     = Grantsville, Maryland, U.S.\n| death_date      =\n| death_place     =\n| party           = Republican\n| spouse          =\n| residence       = Grantsville, Maryland, U.S.\n| education       = Fairmont State University (BS)\n}}\nGeorge Clayton Edwards (born April 9, 1948) is an American politician who previously served as a member of the Maryland Senate from District 1.\nBackground\nEdwards was elected as the State Senator for Maryland District 1 in 2006, which covers Garrett County and parts of Washington and Allegany counties.  He defeated Thomas Conlon, both of whom ran for the seat vacated by John J. Hafer who retired after 16 years in the State Senate.\nEducation\nEdwards attended Northern High School in Accident, Maryland.  He received his Bachelor of Science in business administration from Fairmont State College, cum laude in 1970.  He later attended Frostburg State University to get his teacher's certificate.\nCareer\nAfter college, Edwards was drafted by the Baltimore Colts. He served in the National Guard for six years.  He has been active in Garrett County Economic Development Corporation and the Maryland Association of Counties.\nEdwards was first elected to the Maryland House of Delegates in 1982 and served for 24 years before running and winning the State Senate seat. As a member of the House of Delegates, Edwards was the Minority Leader from 2003 to 2007.\nServing in the Maryland Senate since 2007, Edwards announced in July 2021 that he would not seek reelection in 2022.\nHe is a member of the National Rifle Association, the Lions Club, the American Legion, and the Fraternal Order of Police.\nLegislative record\nIn 2016, legislation was introduced in the Maryland Senate (SB 361) that would require the disclosure of fracking chemicals during a liability suit involving harm or injury to persons from gas drilling and fracking operations. The bill also required higher insurance coverage for gas companies. Edwards introduced amendments that would reduce the liability insurance requirements and limit chemical disclosure. After several days of public outcry from his district, including letters and emails from more than 350 citizens and businesses, Edwards withdrew the amendments. The final bill passed out of the Senate.\nIn October 2021, he was one of five Maryland state legislators from Garrett, Allegany and Washington counties who sent a pair of letters to West Virginia officials asking about annexation of Western Maryland to West Virginia. These letters where denounced by the Allegany County Board of Commissioners President Jake Shade (who was also running against one of the lawmakers in the primaries), calling the request a political stunt, an embarrassment and unneeded distraction. Following criticism from local officials and some constituents, Edwards and Delegate Jason Buckel issued a letter withdrawing support for the secession proposal.\nElection results\n* 2006 Race for Maryland State Senate – District 1\n:{| class=\"wikitable\"\n|-\n!Name\n!Votes\n!Percent\n!Outcome\n|-\n|-\n|George C. Edwards, Rep.\n|25,365\n|&nbsp;&nbsp;72.7%\n|&nbsp;&nbsp;&nbsp;Won\n|-\n|-\n|Thomas Conlon, Dem.\n|9,489\n|&nbsp;&nbsp;27.2%\n|&nbsp;&nbsp;&nbsp;Lost\n|-\n|Other Write-Ins\n|19\n|&nbsp;&nbsp;0.1%\n|&nbsp;&nbsp;&nbsp;Lost\n|}\n* 2002 Race for Maryland House of Delegates – District 1A\n:{| class=\"wikitable\"\n|-\n!Name\n!Votes\n!Percent\n!Outcome\n|-\n|-\n|George C. Edwards, Rep.\n|10,303\n|&nbsp;&nbsp;99.4%\n|&nbsp;&nbsp;&nbsp;Won\n|-\n|Other Write-Ins\n|58\n|&nbsp;&nbsp;0.6%\n|&nbsp;&nbsp;&nbsp;Lost\n|}\n* 1998 Race for Maryland House of Delegates – District 1A\n:{| class=\"wikitable\"\n|-\n!Name\n!Votes\n!Percent\n!Outcome\n|-\n|-\n|George C. Edwards, Rep.\n|7,999\n|&nbsp;&nbsp;83%\n|&nbsp;&nbsp;&nbsp;Won\n|-\n|-\n|Lawson L. Duckworth, Dem.\n|1,670\n|&nbsp;&nbsp;17%\n|&nbsp;&nbsp;&nbsp;Lost\n|}\n* 1994 Race for Maryland House of Delegates – District 1A\n:{| class=\"wikitable\"\n|-\n!Name\n!Votes\n!Percent\n!Outcome\n|-\n|-\n|George C. Edwards, Rep.\n|8,155\n|&nbsp;&nbsp;100%\n|&nbsp;&nbsp;&nbsp;Won\n|}\n* 1990 Race for Maryland House of Delegates – District 1A\n:{| class=\"wikitable\"\n|-\n!Name\n!Votes\n!Percent\n!Outcome\n|-\n|-\n|George C. Edwards, Rep.\n|5,506\n|&nbsp;&nbsp;100%\n|&nbsp;&nbsp;&nbsp;Won\n|}\n* 1986 Race for Maryland House of Delegates – District 1A\n:{| class=\"wikitable\"\n|-\n!Name\n!Votes\n!Percent\n!Outcome\n|-\n|-\n|George C. Edwards, Rep.\n|5,648\n|&nbsp;&nbsp;100%\n|&nbsp;&nbsp;&nbsp;Won\n|}\nLegislative notes\n* Voted against the Healthy Air Act in 2006 (SB154)\n* Voted for slots in 2005 (HB1361)\n* Voted for electric deregulation in 1999 (HB703)\n* Voted for income tax reduction in 1998 (SB750)[\nReferences\nExternal links\n*"
    }
  ]
}