{
  "content": [
    {
      "type": "text",
      "text": "# George Edward Hughes\n\nGeorge Edward Hughes\nGeorge Edward Hughes (8 June 1918 – 4 March 1994) was an Irish-born New Zealand philosopher and logician whose principal scholarly works were concerned with modal logic and medieval philosophy.\nBiography\nHughes was born on 8 June 1918 in Waterford city, Ireland. His English parents George James Hughes and Gertrude Sparks moved to Scotland in the early 1920s, as a result of the Irish War of Independence. George graduated MA with First Class Honours in Philosophy and English, and then in pure Philosophy, from the University of Glasgow. He then studied for a year at the University of Cambridge, before being called back to Glasgow as an assistant lecturer. Subsequently, he held lectureships at the University College of South Wales at Cardiff, and then the University College of North Wales at Bangor. In 1951 he was appointed to the first Chair in Philosophy at the Victoria University of Wellington in New Zealand, a position from which he retired in 1984. He died in Wellington on 4 March 1994.\nCareer\nNotable influences on Hughes' philosophical development included John Wisdom and Ludwig Wittgenstein, from whom he took classes at Cambridge; J. L. Austin, a leading exponent of ordinary language philosophy; and Arthur Prior, with whom he found much in common when they met in New Zealand.\nHughes was a gifted and revered teacher who played a prominent role in academic affairs at Victoria University.   He is well remembered for his passion for clarity, his uncompromising intellectual honesty, and his humanity and gentleness.\nHis early interests were in ethics and the philosophy of religion, but he is most widely known for books on modal logic co-authored with his colleague and former student Max Cresswell. In 1968 they published An Introduction to Modal Logic, the first modern textbook in the area. This book, which has been translated into German, Italian, Japanese and Spanish, was influential in introducing many generations of students and researchers to Kripke semantics, a mathematical theory of meaning that revolutionised the study of modal logics and led to applications ranging from the semantics of natural languages to reasoning about the behaviour of computer programs. Vaughan Pratt, the creator of dynamic logic, has written in reference to his own motivation that \"a weekend with Hughes and Cresswell convinced me that a most harmonious union between modal logic and programs was possible\".\nHughes' other special interest was in medieval philosophical logic, where his main projects were the preparation of philosophical commentaries on Latin manuscripts of John Buridan and Paul of Venice, as well as English translations of the originals.\nHe was also a priest in the Anglican (Episcopal) Church, having been ordained in Bangor Cathedral in 1950. At that time there was a need for clergy who could conduct services in both Welsh and English, so the then Bishop of Bangor ordained several men whom he considered suitable, but who had not had the usual theological training. Hughes had a flair for languages that enabled him to quickly learn how to pronounce the set words of the service even though he was not a Welsh speaker.\nHe was married with five children. His wife Beryl Hughes (1920 – 2015), an historian, taught in the History Department of Victoria University for 25 years, and was one of the founders of the Women's Studies programme there.\nPublications\nBooks\n* The Elements of Formal Logic, by G. E. Hughes and D. G. Londey, Methuen 1965.\n* An Introduction to Modal Logic, by G. E. Hughes and M. J. Cresswell, Methuen 1968.\n* ''John Buridan on Self-Reference: Chapter Eight of Buridan's 'Sophismata', with a Translation, an Introduction, and a Philosophical Commentary, by G. E. Hughes, Cambridge University Press, 1982.\n* A Companion to Modal Logic, by G. E. Hughes and M. J. Cresswell, Methuen 1984.\n* Paul of Venice. Logica magna, Part II, Fascicule 4, Capitula De Conditionali et De Rationali. Edited with an English Translation and Notes by G. E. Hughes. The British Academy Classical and Medieval Logic Texts, VI. Published for The British Academy by Oxford University Press, Oxford, 1990.\n* [https://books.google.com/books/about/A_New_Introduction_to_Modal_Logic.html?id=Dsn1xWNB4MEC A New Introduction to Modal Logic], by G. E. Hughes and  M. J. Cresswell, Routledge, 1996.\nSelected papers\n* Motive and Duty, by George E. Hughes. Mind, New Series, Vol. 53, No. 212, (Oct. 1944), pp.&nbsp;314–331.\n* An Examination of the Argument from Theology to Ethics, by George E. Hughes. Philosophy, Vol. 22, No. 81, (Apr. 1947), pp.&nbsp;3–24.\n* The Ethical Relevance of Consequences, by George E. Hughes. Proceedings of the Aristotelian Society'', New Series, Vol. 48, (1947–1948), pp.&nbsp;59–74.\n* Has God's Existence Been Disproved?: A Reply to Professor J. N. Findlay, by George E. Hughes. Mind, New Series, Vol. 58, No. 229, (Jan. 1949), pp.&nbsp;67–74.\n*  Symposium: Is There Knowledge by Acquaintance?, by  H. L. A. Hart, G. E. Hughes, and J. N. Findlay.  Proceedings of the Aristotelian Society, Supplementary Volumes, Vol. 23, Politics, Psychology and Art, (1949), pp.&nbsp;69–128.\n* Moral Condemnation, by G. E. Hughes. In Essays in Moral Philosophy, edited by A. I. Melden, University of Washington Press, 1958, pp.&nbsp;108–134.\n* Plantinga on the Rationality of God's Existence, by G. E. Hughes. The Philosophical Review, Vol. 79, No. 2, (Apr. 1970), pp.&nbsp;246–252.\n* Omnitemporal Logic and Converging Time, by G. E. Hughes and M. J. Cresswell. Theoria, 41 (1975), no. 1, 11–34.\n* Modal Systems With No Minimal Proper Extensions, by G. E. Hughes. Reports on Mathematical Logic, No. 6 (1976), pp.&nbsp;93–98.\n* Omnitemporal Logic and Nodal Time, by George E. Hughes. Reports on Mathematical Logic, No. 8 (1977), pp.&nbsp;41–61.\n* Equivalence Relations and S5, by G. E. Hughes. Notre Dame Journal of Formal Logic, 21 (1980), no. 3, pp.&nbsp;577–584.\n* Some Strong Omnitemporal Logics, by G. E. Hughes.  Synthese, 53 (1982), no. 1, pp.&nbsp;19–42.\n* [http://www.ontology.co/essays/hughes-buridan.pdf The Modal Logic of John Buridan], by G. E. Hughes.  In Atti del Convegno internazionale di storia della logica: la teoria delle modalità, ed. G. Corsi, C. Mangione, and M. Mugnani, CLUEB, Bologna, 1989, pp.&nbsp;93–112.\n* Every World Can See a Reflexive World, by G. E. Hughes.  Studia Logica, 49 (1990), no. 2, 175–181.\nNotes\nReferences\n* Obituary: George Hughes. Australasian Journal of Philosophy, Vol. 72, No. 4; December 1994, page 548.\n* Vaughan R. Pratt (1980). Application of modal logic to programming. Studia Logica, Vol. 39, pages 257–274.\nExternal links\n* [https://nzetc.victoria.ac.nz/tm/scholarly/name-005768.html George Edward Hughes at the NZ Electronic Text Centre]"
    }
  ]
}