{
  "content": [
    {
      "type": "text",
      "text": "# George Warren (East India Company officer)\n\n, aged 83\n| placeofburial_label =\n| placeofburial =\n| birth_place  = Topsham, Devon\n| death_place  = Southsea, Portsmouth, Hampshire\n| placeofburial_coordinates =\n| nickname      =\n| birth_name    =\n| allegiance    =\n| branch        = Royal Munster Fusiliers (101st)\n| serviceyears  =\n| rank          = General\n| servicenumber =\n| unit          =\n| commands      =\n| battles       =\n| battles_label =\n| awards        = Order of the Dooranee Empire (3rd class)\n| spouse        =\n| relations     =\n| laterwork     =\n}}\nGeorge Warren (c.1801 – 1884) was a British General who was a major figure in the Afghan and Indian wars of the early 19th century.\nBiography\nGeorge Warren was born in Topsham, Devon about 1801. He joined the Honourable East India Company's 1st Bengal European Regiment (which, much later after several mergers, became the Royal Munster Fusiliers) and was stationed in India. On 4 March 1823, Lieutenant Warren arrived in Madras aboard . On 18 January 1826, he took part in the Storming of the Jungeena Gate at Bhurtpore. On 16 March 1839, as a Brigadier, he described  the soldiers' appearance during the passage of the Bolan Pass as\nOn 17 September of the same year, he was awarded the Order of the Dooranee Empire, 3rd class. He progressed quickly to the rank of General and remained in India until the early 1860s. He retired to the United Kingdom, firstly to Sudley Lodge, South Bersted, Sussex, and then to Portsea, Portsmouth and Southsea, where he died.\nHis medals from the 1839 campaign are in the Watson Medal Collection (Afghan War), Fitzwilliam Museum, Cambridge.\nFamily\nOn 15 August 1840 at Calcutta Cathedral, India, Lt-Col George Warren married Isabella Barry Fitzgerald (1818, Dublin – 15 January 1900, 'Granville', Pelham Road, Portsea, Hampshire), the daughter of William Fitzgerald of Dublin,At the Cathedral on 15 August by the Venerable Archdeacon Dealtry Lieutenant Colonel George Warren 1st Bengal European Regiment, Officiating Town Major of Fort William and Member of the Dooranee Order to Isabella daughter of William FitzGerald Esq Dublin and had issue:\n#William Henry Oakes Warren (born 19 January 1843, Calcutta)\n#Isabella Palmer Warren (28 June 1846, Calcutta – 1880, Portsea)\n#Emily Grace Warren (29 July 1848, Calcutta – 1915, Slinfold, Sussex), who married Roger Granville Pulteney Eliot (a grandson of Francis Perceval Eliot) in 1871\n#Frederick Penrose Warren (born 2 February 1850, Fort William, Calcutta, Bengal, India) who married Maria Goodfellow 13 October 1888, Bexhill, Sussex, England\n#Edward Harrington Warren (16 August 1852, Barrackpore, India – 1893, Portsea), who married Eliza Salter Talbot in 1880, Portsea Island\n# Walter Gilbert Warren (born 12 May 1851, Fort William, Bengal, India)\n#Arthur Septimus Warren (20 June 1854, Fort William, Calcutta, Bengal, India – 27 December 1943, Surrey, England), who married Lily Edith Tindall 1891, Chorlton, Lancs\n#Florence Temple Warren (born 1860, Brompton, London), who married Arthur Nathaniel Davis in 1883\n#Harriette Annie Sloper (Annie) Warren (born 1863, Belgium), who married Harry Bingham Thomas on 8 January 1885 at St John's Church, Darlinghurst, NSW, Australia\nOn 22 June 1884, at his home in 1 Brandon Terrace, Southsea, Hampshire, Warren died, aged 83.\nReferences"
    }
  ]
}