{
  "content": [
    {
      "type": "text",
      "text": "# George Edwards (American football)\n\n| birth_place         = Siler City, North Carolina, U.S.\n| death_date          =\n| death_place         =\n| high_school         = Siler City (NC) Jordan-Matthews\n| college             = Duke\n| pastcoaching        =\n* Florida (1991)Assistant\n* Appalachian State (1992–1995)Assistant\n* Duke (1996)Assistant\n* Georgia (1997) Defensive line coach\n* Dallas Cowboys (–)Linebackers coach\n* Washington Redskins ()Assistant defensive coordinator & linebackers coach\n* Washington Redskins ()Defensive coordinator\n* Cleveland Browns ()Linebackers coach\n* Miami Dolphins (–)Linebackers coach\n* Buffalo Bills (–)Defensive coordinator\n* Miami Dolphins (–)Linebackers coach\n* Minnesota Vikings (–)Defensive coordinator\n* Dallas Cowboys (–)Senior defensive assistant\n* Tampa Bay Buccaneers (–)Outside linebackers coach\n* Tampa Bay Buccaneers (–present)Defensive pass game coordinator\n| highlights          =\n| regular_record      =\n| playoff_record      =\n| overall_record      =\n| pfrcoach            = EdwaGe0\n}}\nGeorge Edwards (born January 16, 1967) is an American football coach who is the defensive pass game coordinator for the Tampa Bay Buccaneers of the National Football League (NFL). He has previously served as a defensive coordinator for the Buffalo Bills, Washington Redskins and Minnesota Vikings.\nPlaying career\nEdwards attended Duke University, where he was a four-year letterman for Duke Blue Devils football team.  He was a two-year special teams captain and an honorable mention All-Atlantic Coast Conference (ACC) selection at linebacker in 1989.\nCoaching career\nCollege\nEdwards' first coaching job came at Florida, where he was an assistant in 1991. He also held assistant jobs at Appalachian State (1992–1995), Duke (1996) and Georgia (1997).  At Georgia in 1997, Edwards tutored Richard Seymour and Marcus Stroud, who were both selected in the first round of the 2001 NFL draft.\nDallas Cowboys\nEdwards held the position of linebackers coach for the Dallas Cowboys from 1998 to 2001. Linebacker Dexter Coakley was selected to two Pro Bowls under Edwards tutelage and led the team in tackles all four seasons in that span.\nWashington Redskins\nIn 2002, Edwards moved on to the Washington Redskins under the title of Assistant Defensive Coordinator/Linebackers coach. That season linebacker LaVar Arrington had his most productive career year, recording 107 tackles and 11 quarterback sacks to earn a Pro Bowl selection. Each of the team's three starting linebackers - Arrington, Jessie Armstead and Jeremiah Trotter - surpassed 100 tackles that season.\nThe following season, Edwards was promoted to the role of defensive coordinator. The team had two Pro Bowlers on defense that season - Arrington and cornerback Champ Bailey.\nCleveland Browns\nEdwards served as linebackers coach for the Cleveland Browns for one season in 2004.\nMiami Dolphins\nAfter his stint in Cleveland, Edwards became linebackers coach of the Miami Dolphins under first-year head coach Nick Saban. He served in that capacity for five seasons and was one of only two members of the coaching staff retained after Cam Cameron was fired after the 2007 season. Edwards left Miami to become the University of Florida defensive coordinator under head coach Urban Meyer. Weeks later, he left Florida and accepted a job as defensive coordinator for the Buffalo Bills.\nBuffalo Bills\nOn February 4, 2010, the Buffalo Bills confirmed that Edwards accepted the job as the Buffalo Bills' defensive coordinator, replacing Perry Fewell. He was fired on January 2, 2012, and replaced by Dave Wannstedt.\nMiami Dolphins\nOn January 30, 2012, Edwards was named linebackers coach for the Miami Dolphins under defensive coordinator Kevin Coyle and head coach Joe Philbin. This is his second stint with the Dolphins as a position coach.\nMinnesota Vikings\nOn January 16, 2014, Edwards was hired by the Minnesota Vikings to be their defensive coordinator under first-year head coach, Mike Zimmer.  Edwards and Zimmer had previously worked together from 1998 to 2000 for the Dallas Cowboys on defense.\nThe Vikings defense allowed 21.4 points per game in 2014, ranked 11th in the NFL.\nEdwards improved the Vikings defense in 2015, as they allowed just 18.9 points per game, ranked 5th in the NFL.\nDallas Cowboys\nOn January 24, 2020, Edwards was hired by the Dallas Cowboys to become their Senior Defensive Assistant under Mike Nolan as Defensive Coordinator and head coach Mike McCarthy.\nEdwards was among five Cowboys coaches let go at the conclusion of the 2022 season.\nTampa Bay Buccaneers\nOn February 21, 2023, the Tampa Bay Buccaneers hired Edwards as their outside linebackers coach. In 2025, he was promoted to defensive pass game coordinator.\nReferences\nExternal links\n*[http://www.vikings.com/team/coaches/george-edwards/1040945a-c79b-48b7-bfe3-528bf7720541 Minnesota Vikings bio]"
    }
  ]
}