{
  "content": [
    {
      "type": "text",
      "text": "# George Holmes (historian)\n\nGeorge Arthur Holmes, FBA (22 April 1927 – 29 January 2009) was Chichele Professor of Medieval History at the University of Oxford, and a Fellow of All Souls College, Oxford, 1989-94.\nEarly life and education\nHolmes was born on 22 April 1927, at Aberystwyth, Cardiganshire, Wales, son of English watchmaker John Holmes and Welsh mother Margaret (née Thomas). John Holmes had moved from London to Wales to marry Margaret, whom he met on a cycling holiday.\nHolmes was educated at Ardwyn County School and University College, Aberystwyth. He went on to Cambridge University for graduate study under M. M. Postan. In 1953, he married Anne Klein, a scholar of 19th century French literary culture. The couple had two sons and two daughters.\nAcademic career\nIn 1951, St John's College, Cambridge elected Holmes to a research fellowship. After having a year abroad at the University of Göttingen, in 1952-53, he moved to Oxford in 1954, where he became Tutor in Modern History at St Catherine's Society. When the University granted that Society full collegiate status, he became one of the founding Fellows of St Catherine's College, Oxford at its foundation in 1962. In 1967, and 1968, Holmes spent a year at Princeton University. At St Catherine's, he played an important role in establishing the academic credentials of the College, serving in a variety of College positions including vice-master from 1969 to 1971.\nFrom 1974 to 1980, he edited the English Historical Review. Elected a Fellow of the British Academy in 1985, he also served for many years as Delegate to Oxford University Press.\nIn 1993, the British Academy awarded Holmes its Serena Medal for Italian studies.\nPublished works\n* The estates of the higher nobility in fourteenth-century England. Cambridge studies in economic history. Cambridge: Cambridge University Press, 1957.\n* The later Middle Ages, 1272-1485. Edinburgh: T. Nelson, [1962]; London: Sphere Books, 1970; London: Cardinal, 1974.\n* The Florentine enlightenment 1400-1450. London: Weidenfeld & Nicolson, 1969; Oxford: Clarendon Press, 1992.\n* The Oxford history of medieval Europe. Oxford: Oxford University Press, 1992, 2001.\n* Europe: hierarchy and revolt, 1320-1450 London: Fontana/Collins, 1975; Oxford: Blackwell, 2000.\n* The good parliament. Oxford: Clarendon Press, 1975.\n* Dante. Past Masters series. Oxford: Oxford University Press, 1980.\n* Florence, Rome and the origins of the Renaissance. Oxford: Clarendon Press, 1986, 1988.\n* The Oxford Illustrated History of Medieval Europe. Oxford: Oxford University Press, 1988, 1990, 2001.\n* The first age of the western city, 1300-1500: an inaugural lecture delivered before the University of Oxford on 8 November 1989. Oxford: Clarendon Press, 1990.\n* Art and politics in Renaissance Italy: British Academy lectures, selected and introduced by George Holmes. Oxford: Published for the British Academy by Oxford University Press, 1993, 1995.\n* Renaissance. London: Weidenfeld & Nicolson, 1996; London: Phoenix Illustrated, 1998.\n* The Oxford illustrated history of Italy. Oxford: Oxford University Press, 1997, 2001.\nReferences\nExternal sources\n* [http://www.admin.ox.ac.uk/fp/wd173-074.shtml Chichele Professorship of Medieval History]\n* [http://www.stcatz.ox.ac.uk/news_archive_pages/2008/George%20Holmes.htm Brief biography at St Catherine's College site]\n* [https://www.telegraph.co.uk/news/obituaries/culture-obituaries/5039534/Professor-George-Holmes.html  Obituary, Daily Telegraph], 24 March 2009\n*[https://web.archive.org/web/20100523095530/http://www.timesonline.co.uk/tol/comment/obituaries/article5940468.ece   Obituary, The Times]"
    }
  ]
}