{
  "content": [
    {
      "type": "text",
      "text": "# George Hayward (surgeon)\n\n| birth_place        = Boston, Massachusetts, US\n| death_date         =\n| death_place        = Boston, Massachusetts\n| burial_place       = Mount Auburn Cemetery\n| alma_mater         = Penn School of Medicine (MD), Harvard College\n| occupation         = Surgeon\n| employer           = Massachusetts General HospitalHarvard Medical School\n| known_for          = Groundbreaking techniques in surgery and anesthesia\n}}\nGeorge Hayward (March 9, 1791 – October 7, 1863) was an American surgeon who achieved groundbreaking techniques in surgery and anesthesia. Hayward practiced at Massachusetts General Hospital and served as Harvard University's first professor of clinical surgery. In 1839, he published the first American case report of a successful surgical closure of a vesicovaginal fistula. In 1846, he performed the second operation in history, and later that year the first major surgery, using ether anesthesia.\nLife and career\nHayward was born in Boston, Massachusetts, on March 9, 1791. His father, Lemuel Hayward, was a physician. He received his bachelor's degree from Harvard College in 1809 and his medical degree from the University of Pennsylvania in 1812. Subsequently he undertook a tour of European cities and hospitals, studying under the eminent British surgeon Astley Cooper, before returning to Boston to work in surgery at Massachusetts General Hospital. He went on to become Harvard Medical School's first professor of the principles of surgery and clinical surgery. Peers described him as a self-effacing and taciturn man, and he was not a prolific scholar, publishing only 13 articles in his lifetime, along with a college textbook on physiology that went through at least two editions.\nFollowing in the footsteps of John Peter Mettauer, Hayward performed the first reported surgical closure of a vesicovaginal fistula in North America, performing the operation on May, 10, 1839, and publishing a case report later that year in The American Journal of the Medical Sciences. The surgery was a total success. From 1839 to 1851, Hayward operated on nine more women, curing three and improving the conditions of five.\nHayward performed the second operation under ether anesthesia on October 17, 1846, only one day after the first such procedure (by his mentor and fellow Harvard professor John Collins Warren). He performed the first major operation under ether on November 2, 1846, amputating a patient's leg. On April 12, 1847, Hayward presented on the case to the Boston Society for Medical Improvement and published an account in the Boston Medical and Surgical Journal on April 21. He performed a total of nine operations under ether in 1846 and 1847.\n\"Almost completely unknown among practicing surgeons today,\" Hayward was \"an important innovator in early 19th century American medicine,\" according to L. Lewis Wall, professor emeritus of anthropology at Washington University in St. Louis as of 2025.\nHayward served as a trustee and held the offices of clerk, treasurer, and librarian of the Boston Medical Library. Prior to 1855, he was a president of the Massachusetts Medical Society and a fellow of the American Academy of Arts and Sciences. Hayward was listed among the twelve founding members of the Boston Society of Natural History in its official acts of incorporation in 1831.\nHayward married Mary Ann Binney (1805–1884) after the 1847 death of her first husband, Dr. Amos Binney. He died of a stroke at his Boston home on October 7, 1863. He left most of his wealth to his wife, sisters, and nephews, along with a $5,000 endowment to Harvard Library. His cousin, Lemuel Shaw, was chief justice of the Massachusetts Supreme Judicial Court from 1830 to 1860. Hayward's bust, sculpted in marble by Richard Saltonstall Greenough in 1860, was displayed at Harvard's Memorial Hall.\nPublications\n* Hayward G. (1834). Outlines of human physiology; designed for the use of the higher classes in common schools. Boston: Marsh, Capen & Lyon.\n* Hayward G. (1839). Case of vesicovaginal fistula, successfully treated by an operation. Am J Med Sci 24: 283–288.\n* Hayward G. (1851). Cases of vesicovaginal fistula treated by operation. Boston Med Surg J ; 44: 209–224.\n* Hayward G. (1855). Surgical reports, and miscellaneous papers on medical subjects. Boston: Phillips, Sampson and Co.\n*\nReferences"
    }
  ]
}