{
  "content": [
    {
      "type": "text",
      "text": "# Georgia Historical Society\n\n| remarks                  =\n| former name              =\n}}\nThe Georgia Historical Society (GHS) is a statewide historical society in Georgia, United States. Headquartered in Savannah, Georgia, GHS is one of the oldest historical organizations in the United States. Since 1839, the society has collected, examined, and taught Georgia history through a variety of educational outreach programs, publications, and research services.\nHistory\nFounded in 1839 in Savannah, Georgia, the Society is the oldest continuously operating state historical society in the Southern United States and one of the oldest historical organizations in the United States. Founders include John Macpherson Berrien, Richard D. Arnold, Eugenius A. Nisbet, Thomas Butler King, William Bacon Stevens, Israel Keech Tefft, James Hamilton Couper, Edward Padelford, Mordecai Myers, Alexander Smets and James Moore Wayne.\nIn 1849, the Society moved into a new construction, a Gothic Revival building on East Bryan Street. The building was demolished in the early 20th century.\nMission statement\nThe Georgia Historical Society is an independent statewide institution responsible for collecting, examining, and teaching Georgia history.\nFacilities\nGeorgia Historical Society's main campus is located in Savannah, Georgia's oldest city, and is divided into a research center and an education center, reflecting the twin pillars of the Society's mission: education and research. The Society's Research Center is housed in W. B. Hodgson Hall at 501 Whitaker Street in Savannah. Built for the Society in 1876, and named for William B. Hodgson, American diplomat, Savannahian, and 25-year Curator of the Society, Hodgson Hall features high vaulted ceilings and decorative ironwork. The building was designed by American Institute of Architects founder Detlef Lienau and is listed on the National Register of Historic Places. The Abrahams Archival Annex, named for Savannah lawyer Edmund H. Abrahams, was added in 1970 to hold the Society's archival collections.\nIn 2011, the Society purchased a neighboring historic property to house its expanding staff. The Jepson House Education Center, built in 1856 and named for Savannah philanthropists Robert S. and Alice Jepson, houses the executive and administrative offices of the society and serves as its headquarters.\nThe Georgia Historical Society completed a large-scale renovation and expansion project of its Research Center in 2021. The project included a new archival wing as well as renovated and reconfigured spaces for archival processing, digitization, and specialized storage.\nThe society also has an office in Atlanta.\nGHS Research Center\nThe Georgia Historical Society is a research center and operates a research library for the benefit of the public. Within the Society's library and archives is the oldest collection of materials related to Georgia history in the nation, including 5 million manuscripts, 100,000 photographs, 25,000 architectural drawings, 20,000 rare books, and thousands of maps, portraits, and artifacts representing every section of the state and every era of its history. As both a Branch Repository of the Secretary of State's office and a private institution, GHS works in tandem with the Georgia State Archives, which collects and makes accessible official government records that are property of the state of Georgia. It is the responsibility of GHS to do the same with private manuscripts and private sector materials belonging to individuals, businesses, and organizations that are not generated by and do not belong to the state of Georgia. Each year thousands of scholars, teachers, students, genealogists, historic preservationists, journalists, lawyers, judges, film and documentary makers, government and private sector leaders from around the world access this material, either on site or online, in order to discover the past and better understand the present. The library and archival collections are used for a wide variety of public research purposes, including writing history books and articles, tracing ancestry, preserving historic buildings, student projects, classroom teaching, crafting legislation and preparing legal decisions, creating documentaries and television programs, and investigative journalism.\nToday in Georgia History\nToday in Georgia History are daily 90-second video segments focusing on an event or person associated with a particular day in Georgia history. They are written, researched, and hosted by Dr. Stan Deaton and the Georgia Historical Society, and produced and broadcast by, Don Smith, Keocia Howard, Bruce Burkhardt, and Georgia Public Broadcasting.\nGeorgia History Festival\nThe Georgia History Festival is a K–12 educational program put on by the society and consists of six months of events (coinciding with the traditional academic school year) to commemorate and study Georgia's history. It is held annually around the anniversary of the founding of the colony of Georgia on February 12, 1733. Festival events include a kickoff lecture, Colonial Faire & Muster, Super Museum Sunday, Georgia Day Parade, and the Trustees Gala.\nGeorgia Trustees\nThe Georgia Trustees is an award given by the Georgia Historical Society, in conjunction with the governor of Georgia, to individuals whose accomplishments and community service reflect the ideals of the founding body of Trustees, which governed the Georgia colony from 1732 to 1752. Trustees are inducted each February at the Trustees Gala in Savannah. Recipients include Bernard Marcus, Marguerite Williams, Hank Aaron, Ted Turner, Vince Dooley, Sam Nunn, Tom Cousins, Andrew Young, Truett Cathy, Herman J. Russell, Arthur Blank, Billy Payne, Alana Shepherd, Paula Wallace, James Blanchard, Muhtar Kent, F. Duane Ackerman, A.D. \"Pete\" Correll, Ed Bastian, W. Paul Bowers, Dan Cathy, Shirley Franklin, Dan Amos, Donna Hyland, Carol Tomé, and Dr. Louis W. Sullivan.\nGeorgia historical marker program\nSince 1998, the Georgia Historical Society has administered the Georgia Historical Marker Program. From that time GHS has erected nearly 300 new historical markers (black with silver lettering and the Society's seal on top) across the state on a wide variety of subjects. The program operates through partnerships with local community, government, civic, and religious groups throughout Georgia and with the support of the Georgia General Assembly through limited funding for new marker projects. Erecting new historical markers is a competitive, application-based process in which the cost of each new marker is shared between the Society and the sponsor(s) of each successful marker application. The approval process involves an independent Marker Review Committee that meets once annually to review submitted historical marker applications.\nGHS also coordinates the maintenance for more than 2,100 markers installed by the State of Georgia prior to 1998. These older markers date back as early as the 1950s and are typically green and gold with the seal of the State of Georgia on the top of the marker plaque.\nVincent J. Dooley Distinguished Fellows Program\nThe Vincent J. Dooley Distinguished Fellows program honors Vince Dooley for his lifelong commitment to history and higher education. As a longtime member and former chairman of the Georgia Historical Society's board of curators, Coach Dooley had demonstrated his strong belief in and support of the society's mission as a nationally recognized research and educational institution.\nThe Dooley Distinguished Fellows Program is designed to accomplish two goals consistent with Coach Dooley's life and legacy: recognizing senior scholars in the field of history and mentoring and developing emerging historians.\nIndividuals designated as Dooley Distinguished Teaching Fellows of the Society are national leaders in the field of history as both writers and educators whose research has enhanced or changed the way the public understands the past. In addition to their outstanding scholarship, Dooley Distinguished Teaching Fellows have served the Georgia Historical Society as faculty in teacher training seminars, as lecturers, as consultants, or in a similar capacity. Being designated as a Dooley Distinguished Fellow recognizes and formalizes the relationship forged through this service.\nThe Dooley Distinguished Research Fellows Program will also mentor the next generation of historians by giving younger scholars the opportunity to conduct research for a specific period of time in the vast collection of primary sources at the Georgia Historical Society Research Center. The research is expected to lead to a major piece of scholarly work such as: a dissertation, a book, an article in a refereed scholarly journal, a chapter in an edited collection, or an academic paper presented at a scholarly conference.\nThe Vincent J. Dooley Distinguished Fellows Program permanently associates Coach Dooley's name with outstanding historical research and scholarship through the ongoing recognition of Teaching and Research Fellows.\nThe Vincent J. Dooley Distinguished Fellows Program has been established by the GHS Board of Curators and is supported by an endowment funded by friends and admirers of Vince Dooley.\nDooley Distinguished Teaching Fellows\nDooley Distinguished Teaching Fellows are national leaders in the field of history as both writers and educators whose research has enhanced or changed the way the public understands the past. In addition to their outstanding scholarship, Dooley Distinguished Teaching Fellows have served the Georgia Historical Society as faculty in teacher training seminars, as lecturers, as consultants, or in a similar capacity, advancing the mission of the institution. Being designated as a Dooley Distinguished Fellow recognizes and formalizes the relationship forged through this service.\nDavid W. Blight of Yale University, author of Frederick Douglass: Prophet of Freedom (Simon & Schuster) was inducted as the inaugural Dooley Distinguished Teaching Fellow in 2018.\nRick Atkinson, Pulitzer Prize-winning author and journalist, was inducted in 2019. Pulitzer Prize-winning author and historian Annette Gordon-Reed was inducted in 2022.\nDooley Distinguished Research Fellows\nThe Dooley Distinguished Research Fellowships are intended to assist scholars in gaining access to and conducting extensive and intensive research specifically in the GHS Research Center collections.  Research Fellowships will support scholars from outside the Savannah area engaged in graduate-level, post-doctoral, and independent research. These Research Fellowships will be awarded through an application process. Applications are for on-site research in the collections of the Georgia Historical Society and are intended to support expenses while Research Fellows conduct research at GHS.\nResearch Fellows have access to the GHS Research Collections, including manuscripts, photographs, architectural drawings, rare and non-rare books, and thousands of maps, portraits, and artifacts.\nAffiliate chapter program\nThe Georgia Historical Society's Affiliate Chapter Program is a statewide network designed to help local historical organizations, through workshops on the care of historical records and artifacts, consultation visits by society staff, technical assistance, subscriptions to GHS publications, publicity, and awards in recognition of outstanding achievements. The program was started in 1996 as part of the \"Initiative 2000,\" which sought to redirect the society toward broader statewide service. The network includes nearly two hundred local historical organizations throughout the state of Georgia and beyond. Affiliate membership is open to all not-for-profit organizations whose mission is consistent with that of the Georgia Historical Society. Members include historical and genealogical societies, commissions, museums, foundations, archives, preservation organizations, churches, and patriotic organizations.\nPublications\nThe Georgia Historical Quarterly has been published by the society since 1917 and contains scholarly articles and book reviews on Georgia and Southern history. The journal received a Governor's Award in the Humanities in 1999.\nThe society also publishes a newsmagazine, Georgia History Today, for its members that focuses on popular subjects in promoting history around the state.\nHeadlines is the biweekly newsletter of the Georgia Historical Society and can be subscribed to through the website at www.georgiahistory.com\n\"Off the Deaton Path\" is a blog by Senior Historian Dr. Stan Deaton.\nSee also\n*George Wymberley Jones De Renne, former president of the Society\n*Walter Charlton Hartridge Jr., former president of the Society\n*Leonard Mackall, former president of the Society\n*Mary Lane Morrison, former curator of the Society\n*''Cerveau's Savannah, published by the Society in 1973\n* List of historical societies in Georgia (U.S. state)\nReferences\nAlbert S. Britt Jr., Overture to the Future at the Georgia Historical Society (Savannah: Georgia Historical Society, 1974).\nW. Todd Groce, \"Hodgson Hall at One Hundred and Twenty-five,\" Georgia Historical Quarterly'' 87 (spring 2003): 88–119.\nExternal links\n*\n*\n* [http://www.todayingeorgiahistory.org Spanish-American War in Georgia]\n* Hathi Trust. [http://catalog.hathitrust.org/Record/008884531 Georgia Historical Quarterly]"
    }
  ]
}