{
  "content": [
    {
      "type": "text",
      "text": "# Georgia historical markers__disambig_1\n\n}}\nA historic marker is an \"Alamo\"-shaped plaque affixed to the top of a pole and erected next to a significant historic site, battlefield or county courthouse.  Kevin Levin of the Smithsonian magazine said of the erected signs, \"Historical markers are a ubiquitous presence along many of the nation's highways and country roads. You can spot their distinctive lettering, background color, and shape without even realizing what they commemorate.\" In the State of Georgia, there are more than 2,100 historic markers.\nHistoric marker organizations and initiatives\nThe Georgia Historical Commission was the first organization commissioned to erect markers. The Georgia Historical Commission has since been dissembled and beginning in 1998, the [https://georgiahistory.com/ Georgia Historical Society] took charge of the marker program. However, numerous organizations, such as local garden clubs, chapters of Daughters of the American Revolution, and local historical societies are responsible for erecting and maintaining other markers.\nGeorgia Historical Society\nIn 1998, the Georgia Historical Society took over administration of Georgia’s historical markers and have since added more than 300 new historical markers. Each marker varies in content, however, the Georgia Historical Society has \"introduced several special initiatives to develop markers that offer more inclusive views of state history.\" In 2009 the Georgia Historical Society began an initiative to repair and update markers about the Civil War and “installed twenty new markers that broadened the conversation about the war across Georgia.”\nHistorical markers and Confederate monument preservation\nIn 2016, the City of Atlanta announced the intention to add interpretive additions to historic markers, in order to introduce nuance to preexisting Confederate monuments. This is intended to be an alternative to removing the monuments, which can be considered culturally and politically divisive, especially in former Confederate states like Georgia. Furthermore, it is against state law to remove Confederate monuments, so such nuanced updates are necessary for these historic markers.\nCivil War initiative\nIn the 1950s, the state of Georgia launched the official Georgia Historical Commission to erect markers in preparation of the centennial anniversary of the Civil War. Most  Civil War markers, such as The March to the Sea markers, describe troop movements, battles, and accounts of William T. Sherman's Union campaign through Georgia.\nGallery\n{| class=\"wikitable mw-collapsible\"\n|+\n!.]]\n!, Georgia erected by The Garden Club of Georgia.]]\n!| Historic Marker in Piedmont Park Atlanta]]\n! Historical Marker, Athens ]]\n|-\n|}\nHistoric marker locations\n.]]\nHistoric markers can be located by exact GPS location. Approximate locations are available on the Georgia Historical Society's [https://georgiahistory.com/education-outreach/historical-markers/marker-index/ \"Marker Index\" Page]\nA \"county\" marker can be found at every county courthouse in all 159 counties in Georgia. Each marker explains when the county was formed and who the founding officials were.\nBlue Star Memorial Highway markers can be found at every rest stop on I-75.\nReferences"
    }
  ]
}