{
  "content": [
    {
      "type": "text",
      "text": "# George Albert, Prince of Schwarzburg-Rudolstadt\n\n| spouse =\n| full name   =\n| house       =Schwarzburg-Rudolstadt\n| father      =Albert, Prince of Schwarzburg-Rudolstadt\n| mother      =Princess Augusta of Solms-Braunfels\n| birth_date  =\n| birth_place =Rudolstadt, Schwarzburg-Rudolstadt\n| death_date  =\n| death_place =Rudolstadt, Schwarzburg-Rudolstadt\n}}\nGeorg Albert, Prince of Schwarzburg-Rudolstadt (23 November 1838 – 19 January 1890) was the penultimate sovereign prince of Schwarzburg-Rudolstadt.\nBiography\nHe was born in Rudolstadt the son of Prince Albert of Schwarzburg-Rudolstadt and his wife Princess Augusta of Solms-Braunfels (1804–1865). Princess Augusta was the daughter of Prince Friedrich Wilhelm of Solms-Braunfels (1770–1814) and his wife Duchess Frederica of Mecklenburg-Strelitz (1778–1841), the daughter of Grand Duke Charles II.\nFollowing the death of his uncle Friedrich Günther on 28 June 1867, his father Albert ascended the throne thereby making Georg the heir apparent with the title Hereditary Prince. His father died on 26 November 1869, two years after ascending the throne, with Georg becoming the new sovereign prince.\nDuring his reign, the North German Confederation was dissolved following the victory of the Kingdom of Prussia backed by states of the confederation in the Franco-Prussian War over the Second French Empire. As a result, on 18 January 1871, the King of Prussia was proclaimed German Emperor and so Prince Georg no longer ruled over an independent state as Schwarzburg-Rudolstadt became a state of the German Empire and therefore Prince Georg was subordinate to the German Emperor.\nPersonal life\nPrince Georg was engaged to Duchess Marie of Mecklenburg-Schwerin, his second cousin once removed and stepdaughter of his cousin Grand Duchess Marie of Mecklenburg-Schwerin. She broke off the engagement to marry Grand Duke Vladimir Alexandrovich of Russia. After that, he never married and following his death in Rudolstadt he was succeeded as prince by his first cousin once removed Günther. He was buried in Stadtkirche in Rudolstadt.\nHonours\n* : Knight of St. Hubert, 1858\n*  Kingdom of Prussia:\n** Knight of the Red Eagle, 3rd Class with Swords, 1864; 1st Class with Swords, 1871; Grand Cross with Swords on Ring, 12 October 1880\n** Member of Honour of the Johanniter Order, 1884\n*    Ernestine duchies: Grand Cross of the Saxe-Ernestine House Order, October 1865\n* : Grand Cross of the Ludwig Order, 28 November 1865\n* : Grand Cross of the Order of Duke Peter Friedrich Ludwig, with Golden Crown, 3 January 1870\n*  Duchy of Anhalt: Grand Cross of Albert the Bear, 1872\n* :\n** Knight of the Military Order of St. Henry, 1872\n** Knight of the Rue Crown, 1882\nAncestry\nReferences\nExternal links\n*"
    }
  ]
}