{
  "content": [
    {
      "type": "text",
      "text": "# Georgian Civil War (1463–1490)\n\nSamtskhe-Saatabago Principality of Mingrelia Principality of Guria Principality of Abkhazia Principality of Svaneti\n| combatant2        =\n| combatant3        =\n| commander3        =  George I of Kakheti Alexander I of Kakheti\n| result            = Rebels victory\n*Collapse of the Georgian realm\n| commander1        =  Bagrat II Alexander II Qvarqvare II Liparit I Vameq II Kakhaber II\n| commander2        =  George VIII Constantine II Liparit II\n| image             = Kingdom of Georgia after dissolution as a unified state, 1490 AD.svg\n| caption           = Map after the Collapse of the Georgian realm in 1490.\n}}\nThe Georgian Civil War (1463–1490), also known as the War of the Georgian Triumvirate, was a military conflict that took place within the Kingdom of Georgia during the second half of the 15th century. Beginning under the reign of George VIII, the conflict continued through the rules of Bagrat VI and Constantine II, spreading across the entire country. Major engagements occurred in Abkhazia, Svaneti, Imereti, Samtskhe, Kartli, Mingrelia, and Kakheti.\nThe war began in the 1460s, following separatist uprisings in the northern principality of Samtskhe, and soon evolved into a broader civil conflict between the central government in Tbilisi and rival royal claimants in Imereti and Kakheti. Over the course of three decades, Georgia became impoverished and politically fragmented. In 1490, peace was finally concluded with the formal partition of the Georgian Kingdom into four independent states, bringing an end to the unified Georgian monarchy that had existed since the 11th century.\nThe conflict took place amid profound geopolitical changes across the Near East. The fall of the Byzantine Empire in 1453 and the collapse of the Empire of Trebizond in 1461 marked the ascendance of the Ottoman Empire as a dominant regional power. At the same time, Turkoman tribes sought to exploit Georgia's internal divisions to advance their own expansionist ambitions and facilitate the eventual conquest of the region.\nBackground\nExternal situation\nAt the beginning of the second half of the 15th century, the Kingdom of Georgia remained the dominant power in the Caucasus, following a cultural and political revival under the reign of Alexander I, known as the Great (). Nevertheless, the kingdom continued to suffer from the devastation that had begun two centuries earlier with the first Mongol invasions and was later intensified by the campaigns of Timur during the 1400s.\nBy this time, Georgia's geopolitical environment had changed significantly from its Golden Age in the 13th century. The surrounding regional powers were consolidating, forming new and more formidable threats. In particular, the Turkoman tribes of Persia had united under the Qara Qoyunlu federation, an empire that began to plunder Georgian lands in the 1410s.\nIn 1453, the Ottoman Empire, based in Anatolia, captured Constantinople, bringing an end to the Byzantine Empire—the traditional seat of Orthodox Christianity since the 4th century. This was followed by the Ottoman conquest of Trebizond in 1461, which further isolated Georgia from the Christian world. As the last remaining Christian kingdom in the Near East, Georgia's nobility briefly united in an effort to persuade the powers of Western Europe to undertake a new crusade. The initiative, however, quickly collapsed, as European leaders refused to regard the Ottomans as a significant threat, leaving Georgia exposed to pressure from the Turkoman powers of Persia.\nThe decline of international trade, the loss of Georgia's cultural and political allies, and the growing instability at the foot of the Caucasus plunged the country into poverty and turmoil—conditions that provided fertile ground for ambitious nobles seeking to expand their authority at the expense of the monarchy.\nDivision of Georgia\nIn an effort to preserve the authority of the central government over the kingdom's provinces, Alexander I appointed his three sons—Vakhtang, Demetrius, and George—as co-kings in 1433, following the old Byzantine custom of naming heirs as co-emperors. The three rulers shared the administration of the country: Demetrius was placed in charge of western Georgia, while his brother George governed Kakheti on behalf of Tbilisi.\nThis arrangement, however, proved short-lived. In 1442, Alexander I abdicated and retired to a monastery, leaving the main crown to his eldest son, Vakhtang IV. His four-year reign was characterized by the growing influence of powerful nobles who secured autonomy after threatening the fragile civil peace. Vakhtang died without an heir in 1446, leaving the throne to his two younger brothers, who had to share a divided kingdom. Demetrius III, legitimate successor of Vakhtang IV, receives the western Georgia, while George VIII becomes the king of Kakheti and Kartli, before controlling the entire kingdom after the death of Demetrius in 1453.\nIn the west, the authority of Tbilisi steadily declined throughout the 15th century. The duchies of Svaneti, Abkhazia, and Guria, along with Mingrelia—on which they depended—grew increasingly autonomous despite the central government's attempts to regain control of the Black Sea coast. In 1401, the Kingdom of Western Georgia was invaded and annexed by King George VII. In 1414, King Alexander I created the Duchy of Samokalako in order to secure the allegiance of the heirs of the secessionist state, but this arrangement was not confirmed by Bagrat, who became Duke of Samokalako in 1455.\nThe northern principality of Samtskhe, ruled by the House of Jaqeli, was the first to officially withdraw from the Georgian union upon the accession of Prince Qvarqvare II in 1451. The latter proclaimed the religious independence of his state by confiscating the buildings of the Patriarchate of Georgia, prohibiting any mention of the Georgian king and patriarch in churches under his jurisdiction and replaces members of the Georgian clergy with priests from Greece or Antioch. This split was only temporary and a severe response from the Catholicosate of Georgia forced Qvarqvare II to renounce these ambitions.\nCivil wars\nWestern revolt\nModern historiography partially ignores the origins of the rebellion in western Georgia which marked the start of the Civil War. According to historians Nodar Asatiani, Kalistrat Salia, and Donald Rayfield, the first signs of disagreement between King George VIII and his vassals appeared in the early 1460s, when Prince Qvarqvare II of Samtskhe sought to form a coalition against the Ottoman Empire—an emerging power since the fall of Constantinople but still too distant from central Georgia to pose an immediate threat to the crown in Tbilisi. Qvarqvare II allied himself with Uzun Hasan, ruler of the Turkoman federation of the Aq Qoyunlu and an occasional enemy of George VIII, in an attempt to resist the Ottomans. This alliance, however, failed to prevent the fall of the last Byzantine stronghold, Trebizond, in 1461, and Uzun Hasan soon proved a dangerous ally by launching a military raid into Samtskhe, killing Orthodox priests, devastating several villages, and defeating the royal troops of George VIII.\nDespite the failure of this alliance, relations between Tbilisi and Samtskhe never recovered. The Duchy of Samokalako, which had supported the anti-Ottoman coalition, was abolished by the central government, an act that effectively triggered open conflict. However, according to French historian Marie-Félicité Brosset and Prince Vakhushti of Kartli, the revolt that began in 1463 had deeper, hidden causes. They attribute it to Qvarqvare II—then a close ally of George VIII—who exploited the royal ambitions of the young Duke Bagrat of Samokalako to advance his own political goals. Bagrat, a member of the royal Bagrationi dynasty and cousin of George VIII, had governed Imereti on behalf of the king since 1455, but his rebellion took the monarch by surprise.\nWith the backing of Samtskhe, Bagrat forged alliances with the powerful Liparit I of Mingrelia and Mamia Gurieli, as well as with the rulers of Abkhazia and Svaneti. Supported by these forces, he successfully captured fortresses loyal to George VIII throughout western Georgia and secured the allegiance of many minor nobles, including some in Kartli, the region surrounding Tbilisi. In 1463 (or 1462), George VIII led his royal army across the Likhi Range into Imereti, reportedly seeking military assistance from Samtskhe. Qvarqvare II would lead a military legion in Imereti but would remain strategically out of the conflict. The royal army clashed with Bagrat's rebel forces near the village of Chikhori, east of Kutaisi, where Bagrat achieved a decisive victory, forcing George VIII to retreat to Kartli.\nAlthough Kutaisi, the regional capital, remained temporarily under George VIII's control, Bagrat soon captured the city. At the Monastery of Gelati, he was crowned King of Imereti, taking the title of Bagrat II, officially separating the regions west of Likhi Range from the rest of the Georgian kingdom. The dukes of Mingrelia, Guria, Abkhazia, and Svaneti attended the coronation, pledging allegiance to the new monarch, who in turn elevated them to the rank of Mtavari (“prince”), exempting them from fiscal obligations. This arrangement transformed Western Georgia into a loose federation of semi-independent principalities—a political structure that would continue to weaken the region over the following centuries.\nDomination of Samtskhe\nThe region of Samtskhe greatly benefited from the civil war dividing eastern and western Georgia, evolving into a semi-independent principality under the rule of Prince Qvarqvare II Jaqeli. During this period, he began to assume the title of mepe (“king”) and established his own mint in the capital, Akhaltsikhe. In an attempt to curb his growing power, King George VIII invaded Samtskhe in 1463 and succeeded in defeating Qvarqvare II after several of the prince's vassals defected to support the Georgian monarch.\nFollowing his defeat, Qvarqvare II sought refuge with Bagrat II, the newly crowned king of Imereti. Bagrat permitted the deposed prince to mobilize his forces, and an Imeretian army soon recaptured Samtskhe from George VIII later that same year. Restored to power in Akhaltsikhe, Qvarqvare II took revenge on the vassals who had sided with the central government during the invasion. With Bagrat II's approval, he formed an alliance with Prince Kakhaber II of Guria. Supported by mercenaries from Imereti and Guria, Qvarqvare II launched a campaign through Samtskhe and the northern province of Klarjeti, forcing the submission of local fortresses. While some nobles pledged loyalty to him, many were executed, and others fled into exile—including Zaza Panaskerteli-Tsitsishvili, who later became an advisor to King George VIII. As a reward for his assistance, Kakhaber of Guria received the territories of Adjara and Chaneti.\nIn 1465, George VIII undertook a new invasion of Samtskhe. Holding the military advantage, he offered Qvarqvare II a peace settlement that would guarantee the survival of the Jaqeli family in exchange for the reintegration of the rebel territories into the Georgian kingdom. When Qvarqvare refused, George VIII inflicted another defeat upon him at the Battle of Lake Paravani. However, in the aftermath, the prince's guards managed to rally, defeat the royal entourage, and capture the king himself.\nWith George VIII taken prisoner, command of the Georgian forces fell to Prince Constantine, the king's nephew, who was particularly incensed by Samtskhe's betrayal. Constantine ordered a general retreat of Georgian troops, who were pursued by Qvarqvare's army as far as the central province of Kartli. Besieged in Gori, Constantine and his remaining forces were eventually forced to abandon central Georgia and retreat to Kutaisi, the Imeretian capital then contested between Bagrat II and the royalist forces of George VIII.\nRise of a New Royal Power\nFollowing the defeat of the Tbilisi loyalist forces, Bagrat II took advantage of the ensuing power vacuum to advance his ambitions. While Prince Constantine and the remnants of the royal army retreated into the Likhi Range, the Imeretian monarch left Imereti and launched an invasion of central Georgia.\nIn 1466, without notable opposition, Bagrat captured Tbilisi and took hostage the patriarch of the Georgian Church, David IV. The latter eventually recognized Bagrat's authority after being bribed with the estates of two peasant families. Bagrat was subsequently crowned as Bagrat VI, King of All Georgia — the last ruler in Georgian history to bear this title. Yet this fragile unity would prove short-lived.\nThe principality of Samtskhe, far from supporting the reestablished royal authority, responded by sowing further discord. Later that same year, Qvarqvare II released the former king George VIII from captivity, hoping to destabilize Bagrat's rule. George quickly gathered a militia, marched across central Georgia, and established himself in the eastern province of Kakheti. By 1467, he had secured the allegiance of the local nobility and proclaimed the independence of the Kingdom of Kakheti, thus dividing Georgia into two separate monarchies.\nThe fragmentation did not stop there. From the early 1470s, the western principalities of Mingrelia and Abkhazia assumed a semi-independent status. Only after the death of Prince Shamadavle of Mingrelia in 1474 was Bagrat VI able to invade both rebellious territories and install Vameq II as their new ruler. However, by 1477, Vameq II rebelled against Bagrat VI, joining forces with the dukes of Guria and Abkhazia to attack Imereti. The Georgian king promptly left Tbilisi, defeated the coalition of nobles, and restored peace in western Georgia.\nForeseeing a lasting division of the kingdom, Bagrat VI sought to secure the legitimacy of his dynasty through ecclesiastical reform. With the support of Patriarch Michael IV of Antioch, then the senior figure of the Orthodox world, he established the Catholicate of Abkhazia, appointing Bishop Joachim of Bedia as Patriarch of Abkhazia.\nCoup d’État\nThe chaotic situation of Georgian politics worsened considerably following a proposed ceasefire between Bagrat VI and Prince Constantine, who had proclaimed himself King of Georgia — thereby usurping Bagrat's title, despite controlling only the northern part of the realm — after the capture of Tbilisi by Bagrat in 1466. According to historian Donald Rayfield, the ceasefire agreement allowed Constantine to be officially recognized as Bagrat VI's heir in Kartli, while Imereti was to pass to Bagrat's son, Prince Alexander.\nThis fragile compromise only temporarily eased hostilities. Armed conflict soon resumed between the two monarchs during the 1470s. By the decade's end, Bagrat VI achieved a decisive victory over Constantine with the support of reinforcements from Mingrelia and Guria.\nIn 1478, the death of Bagrat IV triggered yet another wave of internecine struggles among Georgian rulers. His son, Alexander, sought to be crowned at Kutaisi as King of Imereti. However, his coronation was boycotted by his principal vassals — the princes of Mingrelia, Abkhazia, Guria, and Svaneti — who refused to recognize the successor of “Bagrat the Bad”. Constantine II, already ruling Kartli, seized the opportunity to invade Imereti, decisively defeating Alexander. The latter was forced to relinquish his royal title and retreat to the mountain regions of Racha and Lechkhumi, over which he retained only nominal authority.\nMeanwhile, George VIII engaged in battle against Constantine II in Kartli but was defeated thanks to military aid from Samtskhe. He died in 1476 and was succeeded by his son, Alexander I of Kakheti. Unlike his father, the new ruler made no claim to the Georgian crown. Instead, he negotiated stable borders with Tbilisi, sparing his kingdom from a potential invasion by Constantine II. He then embarked on an independent foreign policy, sending diplomatic missions as far as Grand Principality of Moscow.\nFailure on the Western Front\nFollowing the death of Bagrat VI, Samtskhe sought to reassert itself as a powerful and independent Georgian state. In 1481, Prince Qvarqvare II Jaqeli took advantage of the Turkoman invasions and the Succession crisis in Imereti to seize all royal lands north of the Mtkvari River, provoking an immediate response from King Constantine II. The latter allied himself with Vameq II of Mingrelia to launch a counteroffensive against Qvarqvare, who managed to fortify his position within his principality. Although the royal forces succeeded in reclaiming several lost territories, Constantine was soon forced to withdraw to Kartli.\nIn 1483, the mistreatment of a silk merchant employed by Prince Qvarqvare in Tbilisi escalated tensions further, leading the Samtskhe ruler to declare war on several of the most powerful noble families of central Georgia — the Tsitsishvili, Machabeli, and Chalikashvili families. As their suzerain, Constantine II retaliated by sending an army to invade Samtskhe. However, his forces suffered a crushing defeat at the hands of Qvarqvare, during the Battle of Aradeti in August of that year. As a result, Tbilisi lost control over all territories west of the Mtkvari, and the principality of Samtskhe effectively secured its full political independence.\nTaking advantage of Tbilisi's defeat, Alexander, the son of the late King Bagrat VI, emerged from his exile in Racha to reclaim his royal title as ruler of Imereti. Supported by mountain mercenaries from Racha and Lechkhumi, he captured Kutaisi, the principal Imeretian city, in 1484, where he was crowned King of Imereti, thus proclaiming the independence of the Kingdom of Imereti.\nRefusing to acknowledge this new political reality, Liparit II of Mingrelia opposed Alexander and appealed to Constantine II for intervention. The latter invaded Imereti, temporarily recapturing Kutaisi in 1485. From his new base in the city, Constantine launched an extended campaign, hiring Circassian mercenaries against Alexander in northern Imereti. However, in 1488, the Turkomans took advantage of the situation to besiege Tbilisi, compelling the king to return to central Georgia.\nIn the ensuing turmoil, Alexander forged a mysterious alliance with the Duchy of Mingrelia, enabling him to recapture Kutaisi and the other Imeretian strongholds loyal to Tbilisi. Having thus restored his independence, Alexander elevated Mingrelia and Guria to the rank of principalities and united their forces to subdue the Abkhazian and Svan clans, consolidating his rule over western Georgia.\nTurkoman Invasions\nThe internal wars that tore Georgia apart in the 15th century only served to advance the imperial ambitions of the Muslim powers on the northern frontier of South Caucasus. In 1468, the Turkoman tribes were united under Uzun Hasan, the leader of the Aq Qoyunlu. Emboldened by this newfound unity, Uzun Hasan launched a campaign against the Caucasian states. At the time, Georgia — weakened and governed by Bagrat VI — became one of his first targets. In 1473, the Turcomans invaded the kingdom, seeking to secure control of the Caucasus as a strategic base for their struggle against the Ottoman Empire.\nA far more destructive invasion followed in 1477, when Uzun Hasan exploited renewed civil conflicts within Georgia. Northern Georgia was completely ravaged, and thousands of refugees fled their villages toward the safer highlands in the north. The Turkoman forces captured Tbilisi without even laying siege to it, departing soon after with an immense tribute — 16,000 ducats, 5,000 Georgian prisoners, and a garrison left behind to occupy the capital. When Uzun Hasan died the following year, Bagrat VI succeeded in expelling the Muslim troops, though his victory proved temporary.\nIn 1482, Uzun Hasan's successor, Yaqub, invaded Samtskhe, swiftly capturing the fortresses of Akhalkalaki and Atskuri and forcing the principality to pay tribute to the Aq Qoyunlu state.\nThe Turkoman offensives spread fear across all of Georgia, yet they failed to produce any form of political unity — or even a temporary truce — among the Georgian princes. While some factions argued that only a united Georgia could resist the Aq Qoyunlu, others maintained that fragmentation might spare individual regions from total devastation.\nBeginning in 1487, Yaqub intensified his raids and implemented a policy of local assimilation, establishing fortified bases across northern Kartli. That same year, he besieConstantineilisi, but Constantine II successfully repelled the attack — though at the cost of losing effective control over Imereti in order to preserve the royal capital.\nIn 1488, a jihad was proclaimed against Constantine II. The forces of General Khalil Beg captured the fortresses surrounding Tbilisi, leaving the kingdom vulnerable. Weakened by years of civil war, Constantine appealed for military aid from Samtskhe and Kakheti, but both states refused to intervene. In February 1489, Tbilisi fell to the Turcomans and was utterly devastated. Only a year later, amid internal strife within the Aq Qoyunlu following Yaqub's death, did Constantine II finally manage to expel the Muslim troops and reclaim his ruined capital.\nThe Decision of 1490\nIn 1490, King Constantine II faced one of the biggest decisions in Georgian history. Having once forged a tenuous alliance with Alexander I of Kakheti — an alliance later undermined when the Kakhetian ruler refused to aid Georgia during the Turkoman invasions — Constantine now found himself in an increasingly desperate position. He had lost control over Samtskhe and Imereti, been betrayed by Mingrelia, and ruled only the diminished central region of Kartli. The monarch of Tbilisi was therefore forced to make a fateful choice: whether to continue a costly campaign to restore Georgian unity or to secure internal stability through the formal recognition of the kingdom's fragmentation.\nTo deliberate on this question, Constantine convened the darbazi — the royal council charged since the 13th century with assisting the Georgian sovereign during important decisions. The darbazi, presided over by the king, was composed of the leading figures of the Georgian Orthodox Church, six royal ministers, and representatives of the realm's great ducal families.\nIn a unanimous decision, the darbazi of 1490 resolved to accept the official dissolution of the unified Kingdom of Georgia — a realm first established 482 years earlier by Bagrat III. The decree formally divided Georgia into four successor states: the Kingdoms of Imereti, Kakheti, and Kartli, and the Principality of Samtskhe. The Georgian Chronicles preserve the essence of this historic resolution:\nFollowing the darbazi’s ruling, Constantine II negotiated peace treaties: in 1491, he concluded treaties with Alexander I of Kakheti, Qvarqvare II Jaqeli, and finally Alexander II of Imereti. These agreements effectively ratified Georgia’s division into three kingdoms and one principality, a political configuration that endured — with intermittent conflict — until the end of the 18th century.\nConsequences\nAfter nearly thirty years of civil war, the Kingdom of Georgia was finally and irreversibly divided. The once-unified Bagrationi dynasty split into three separate royal branches, all of which survive to this day. The partition brought an end to decades of warfare that had devastated the country both economically and demographically. Though partial stability was achieved in eastern Georgia, where the Kingdom of Kakheti maintained relative coherence, the situation in the west remained fragile, with renewed outbreaks of conflict never far away.\nThe kingdoms of Kartli and Imereti continued to fight throughout the 1490s. Only under Bagrat III of Imereti () and David X of Kartli () did hostilities finally subside[3].\nThe economic toll of the civil war was catastrophic. Kutaisi, once regarded as Georgia’s second capital, was described by Venetian envoys in the 1460s as little more than a “village.” Meanwhile, the lucrative trade of the Black Sea collapsed: the ancient port of Poti was reclaimed by nature by the end of the century. The currency rapidly lost both its value and metallic quality, as evident from the debased coins minted during the reign of Bagrat VI.\nCommerce in regions such as Guria and Mingrelia dwindled to the trade of wax, honey, and woolen garments. The diet of the Imeretian population also deteriorated: residents subsisted mainly on millet, dried fish, and a “poor-quality wine,” as described by Italian merchants. Those same observers noted that Imeretians dressed in coarse clothing woven from nettle and hemp.\nAccording to historians Nodar Assatiani and Kalistrate Dzhanelidze, Tbilisi was largely abandoned during the war, while Akhalkalaki, Akhaltsikhe, and Ateni were reduced to small hamlets. The coastal cities of Batumi and Sukhumi, once thriving Black Sea ports, became little more than minor fortresses. Trade between the Georgian provinces ceased entirely, plunging the countryside into economic isolation.\nThe weakness of the central monarchy compelled both Bagrat VI and Constantine II to sell their rights over royal estates to local nobles, resulting in the revival of a harsh feudal system—at the very time when such institutions were disappearing from Western Europe. The minor nobility, treating their serfs as virtual slaves, fell under the domination of powerful dukes and princes, while the monarchy's traditional role as guarantor of judicial order vanished altogether.\nChronology\n* 1461 – The Ottoman Empire captures Trebizond. Prince Qvarqvare II Jaqeli forms an anti-Ottoman alliance with Uzun Hasan, who later violates the pact by devastating Samtskhe.\n* 1462 – George VIII of Georgia abolishes the Duchy of Samokalako, whose governor, Bagrat Bagration, supports the anti-Ottoman coalition.\n* 1463 – George VIII and Bagrat of Samokalako confront each other in the Battle of Chikhori, which ends in a rebel victory. Bagrat proclaims himself king of Imereti as Bagrat II. George VIII invades Samtskhe to punish the disobedient local prince.\n* 1464 – Qvarqvare II, in exile at Bagrat II's court, returns to Samtskhe to reclaim his throne and punish his disloyal vassals, aided by Guria, which receives the provinces of Adjara and Chaneti as pledges.\n* 1465 – George VIII invades Samtskhe again and defeats his vassal near Paravani Lake, but is captured by Qvarqvare II and forced to recognize the principality's independence. Georgian forces are besieged in Gori and Kutaisi by Bagrat II.\n* 1466 – Bagrat II captures Tbilisi and crowns himself King of Georgia under the name Bagrat VI.\n* 1467 – Qvarqvare II releases George VIII and helps him take refuge in eastern Georgia, where George proclaims the independence of the Kingdom of Kakheti.\n* 1473 – Uzun Hasan, ruler of the Aq Qoyunlu, invades Georgia for the second time.\n* 1474 – Bargrat VI invades Mingrelia to confirm the ascension of the new local prince, Vameq II Dadiani.\n* 1476 – George VIII dies, leaving his Kingdom of Kakheti to his son Alexander I, who agrees on common borders with Bagrat VI.\n* 1477 – Vameq II rebels against Bagrat VI and attacks Western Georgia, but is defeated. Uzun Hasan launches a third invasion of Georgia.\n* 1478 – Georgian troops expel the Turkoman invaders. Following Bagrat VI's death, Constantine, governor of Kartli, proclaims himself King Constantine II of Georgia and conquers Imereti, forcing the heir Alexander into exile.\n* 1481 – Qvarqvare II Jaqeli revolts and captures royal lands in the southern regions before being defeated by an alliance between Constantine II and the Prince of Mingrelia.\n* 1482 – Yaqub, the new ruler of the Aq Qoyunlu, invades Samtskhe.\n* 1483 – Qvarqvare II revolts again and inflicts a serious defeat on the royal army at the Battle of Aradeti, securing his principality's independence.\n* 1484 – Alexander and his highland mercenaries capture Kutaisi and proclaim him Alexander II, King of Imereti\n* 1485 – Liparit II Dadiani and Constantine II form an alliance against Alexander II and recapture Kutaisi.\n* 1487 – Yaqub, the Turcoman leader, invades southern Georgia.\n* 1488 – The Turkomans besiege Tbilisi, forcing Constantine II to withdraw from his base in Kutaisi. Alexander II seizes the opportunity to retake Imereti.\n* 1490 – The royal council of Constantine II votes to dissolve the Kingdom of Georgia in order to end the civil war.\n* 1491 –  Constantine II signs peace treaties with Samtskhe, Imereti, and Kakheti.\nNotes\nReferences\nBibliography\n*\n*\n*\n*\n*\n*\n*"
    }
  ]
}