{
  "content": [
    {
      "type": "text",
      "text": "# George Pearce (Queensland politician)\n\n| birth_place = Rockhampton, Queensland, Australia\n| death_date =\n| death_place = Brisbane, Queensland, Australia\n| spouse =\n| children = 2\n| party = Liberal\n}}\nHenry George Pearce (17 September 1917 – 23 May 1992) was an Australian politician who was a member of the House of Representatives from 1949 to 1961, representing the Division of Capricornia for the Liberal Party.\nEarly life\nPearce was born in Rockhampton, Queensland, and attended Rockhampton State High School. He married Nell Graham in 1939, with whom he had two sons, Greg and Laurie. After leaving school, Pearce worked as the manager of a sports store for a period. He was rejected for military service as medically unfit, but during the war worked for the Australian Red Cross as secretary of the local branch and area officer for Central Queensland. At the time of his election to parliament in 1949, he was working as a sales representative for a printing house.\nPolitics\nAt the 1946 federal election, Pearce served on the campaign committee of Charles Davidson, who defeated former prime minister Frank Forde in the Division of Capricornia. Prior to the 1949 election, Davidson switched to the new Division of Dawson. Pearce replaced him as the Liberal candidate in Capricornia, and retained the seat despite a swing to the Labor Party. He was re-elected in 1951, 1954, 1955, and 1958.\nIn 1960, Pearce was made Government Whip in the House of Representatives, having previously been deputy whip under Hubert Opperman. The following year, he chaired the select committee into voting rights that reported that universal suffrage should be granted to Indigenous Australians. The committee's recommendations were passed into law in 1962. Pearce lost his seat in parliament at the 1961 election. He was defeated by the Labor candidate George Gray on an 11-point swing, which was partially due to an unfavourable redistribution.\nLater life\nIn 1962, Pearce was reported to be working as a business consultant. He later became the executive director of Pacific Sporting Pools, which set up betting pools on Australian sports but ran its operations from Nauru in order to circumvent local gambling laws. It was formally launched on 1 June 1969, but suspended its operations after six weeks following active opposition from the Victorian and New South Wales state governments. Pearce resigned his position at that time. He was also a director of two related companies, Central Pacific Hotels and Central Pacific Airways. A hotel was built on the island, but the airline did not become operational.\nPearce was predeceased by his wife Nell in September 1991. He died in Queensland on 23 May 1992 at the age of 74.\nReferences"
    }
  ]
}