{
  "content": [
    {
      "type": "text",
      "text": "# George Foreman vs. Alex Stewart\n\n| height1      = 6 ft 4 in\n| weight1      = 259 lb\n| style1       = Orthodox\n| recognition1 = IBFNo. 1 Ranked HeavyweightWBANo. 4 Ranked HeavyweightWBCNo. 6 Ranked HeavyweightFormer undisputed heavyweight champion\n| fighter2     = Alex Stewart\n| nickname2    = The Destroyer\n| hometown2    = Brooklyn, New York, U.S.\n| purse2       = $250,000\n| record2      = 28–3 (28 KO)\n| age2         =\n| height2      = 6 ft 2+1/2 in\n| weight2      = 227 lb\n| style2       = Orthodox\n| recognition2 = WBCNo. 13 Ranked Heavyweight\n| result       = Foreman wins via majority decision (94–93, 94–93, 94–94)\n}}\nGeorge Foreman vs. Alex Stewart was a professional boxing match contested on April 11, 1992.\nBackground\nAfter coming up short in his first bid to become the oldest heavyweight champion in boxing history after losing to the reigning undisputed heavyweight champion Evander Holyfield in April 1991, 42-year old former undisputed champion George Foreman decided to continue his comeback, agreeing to a 2-fight, $10 million deal with cable network HBO. In his first fight of the deal, Foreman easily dispatched former NFL linebacker Jimmy Ellis in December. In late January 1992, Foreman's next opponent was announced to be former heavyweight contender Alex Stewart, who Foreman would meet on April 11, 1992, in what would be the first professional boxing fight at the Thomas & Mack Center.\nBoth Foreman and Stewart had a lot riding on the fight. Foreman was hoping that a victory over Stewart would propel him to a rematch with Holyfield, giving him one more chance at the heavyweight title, while Stewart was looking to get back into heavyweight title contention as although all 28 of his wins had come by way of knockout, his three losses had come against top competition in former and future heavyweight champions in Holyfield, Mike Tyson and Michael Moorer. Foreman himself state that Stewart's faults would be \"erased if he beats George Foreman.\"\nThe fights\nToney vs. Wolfe\nThe co featured bout saw James Toney make the 5th defence of his IBF and lineal middleweight championship against No. 6 ranked Glenn Wolfe.\nThe fight\nToney won the bout by unanimous decision with Glen Hamada having it 119–109, Doug Tucker 118–110, Chuck Giampa 117–111.\nMain Event\nForeman started the fight strong using his size to his advantage as he pressed forward and constantly hit Stewart with his trademark jab. After having dominated Stewart in the first round, Foreman nearly ended the fight in the second as he sent down Stewart early in the round with a short right hand after which Stewart remained on the canvas before answering referee Richard Steele's count at nine. Foreman continued to stalk Stewart afterwards before sending him down on the seat of his pants and in his corner, though Stewart once again answered Steele's count. With the three-knockdown rule in effect, Stewart kept his distance and was able to survive the round.\nFollowing the second round, Stewart improved markedly, as though Foreman was still the aggressor, he bobbed, weaved and slipped Foreman's punches when he could and withstood Foreman's jabs and power punches when he did get hit. During the second half of the fight, with Foreman getting noticeably tired, Stewart began landing jabs and power punches almost at will as Foreman's right eye began to swell first as did his left eye later in the fight. Foreman, after struggling in the sixth and seventh rounds, came back with a strong eighth as he had Stewart in trouble several times throughout the round, though Stewart benefited from a timeout called by Steele after losing his mouthguard and hung on and survived the round. In the ninth, the two fighters traded punches with Stewart bloodying Foreman's nose while Foreman managed to open a cut above Stewart's right eye. In the tenth and final round, Foreman had a point taken away due to a blatant low blow as Foreman and Stewart went the full 10-round distance. Foreman would narrowly earn the victory by majority decision as two judges had him winning the fight with two scores of 94–93 while the third had the fight even 94–94. Both of Foreman's eyes were nearly swollen shut as had his jaw, leaving him almost completely unrecognizable.\nAftermath\nIn the post-fight interview, Foreman admitted that Stewart had hurt him stating that his punches were \"like a brick going against my face.\"\nFight card\nConfirmed bouts:\n{| class=\"toccolours\" style=\"font-size: 85%;\"\n|-\n! style=\"background:#e6e8fa; color:#000; text-align:center;\"| Weight Class\n! style=\"background:#e6e8fa; color:#000; text-align:center;\"| Weight\n! style=\"background:#e6e8fa; color:#000; text-align:center;\"|\n! style=\"background:#e6e8fa; color:#000; text-align:center;\"| vs.\n! style=\"background:#e6e8fa; color:#000; text-align:center;\"|\n! style=\"background:#e6e8fa; color:#000; text-align:center;\"| Method\n! style=\"background:#e6e8fa; color:#000; text-align:center;\"| Round\n! style=\"background:#e6e8fa; color:#000; text-align:center;\"| Notes\n|-\n|Heavyweight\n|200+ lbs.\n|George Foreman\n|def.\n|Alex Stewart\n|align=center|MD\n|align=center|10/10\n|-\n|Middleweight\n|160 lbs.\n|James Toney (c)\n|def.\n|Glenn Wolfe\n|align=center|UD\n|align=center|12/12\n|\n|-\n|Heavyweight\n|200+ lbs.\n|Boris Powell\n|def.\n|Marshall Tillman\n|align=center|UD\n|align=center|6/6\n|-\n|Super Welterweight\n|154 lbs.\n|Lonny Beasley\n|def.\n|Quirino Garcia\n|align=center|UD\n|align=center|6/6\n|-\n|Super Bantamweight\n|122 lbs.\n|Yūichi Kasai\n|def.\n|Eloy Cortez\n|align=center|TKO\n|align=center|3/6\n|}\nBroadcasting\n{| class=\"wikitable\"\n|-\n! align=center | Country\n! align=center | Broadcaster\n|-\n|  || HBO\n|}\nReferences"
    }
  ]
}