{
  "content": [
    {
      "type": "text",
      "text": "# George Edwards (aviation)\n\n|birth_place       = Highams Park, London, England\n|death_date        =\n|death_place       = Guildford, Surrey, England\n|residence         =\n|citizenship       =\n|ethnicity         =\n|fields            = Aircraft Designer\n|workplaces        = Vickers-Armstrongs,  British Aircraft Corporation\n|education         = Walthamstow Technical Institute Engineering and Trade School\n|alma_mater        = University of London\n|doctoral_advisor  =\n|academic_advisors =\n|doctoral_students =\n|notable_students  =\n|known_for         =  BAC One-Eleven,  Concorde\n|influences        =\n|influenced        =\n|awards            =\n|religion          =\n|signature         =\n|footnotes         =\n}}\nSir George Robert Freeman Edwards  (9 July 1908 – 2 March 2003), was a British aircraft designer and industrialist.\nEarly life\nGeorge Edwards was born on 9 July 1908 at Highams Park, on the north side of London, England.\nHe attended Walthamstow Technical Institute Engineering and Trade School, after which he took an engineering course at the University of London and in 1926 acquired a Batchelor of Science (BSc) degree.\nThe Walthamstow Technical Institute in 1970 became part of North East London Polytechnic (which later became part of the University of East London)\nCareer\nVickers\nBeginning as a design draughtsman in 1935, he was promoted in 1940 to Experimental Department Manager and in 1945 he became the Chief Designer of the Vickers-Armstrongs team that produced the Viking airliner, Valetta military transport, Varsity trainer, Viscount airliners and Valiant strategic bomber. He later became managing director of the company, during which time the Vanguard, VC10 and (post-merger) BAC TSR-2 strike bomber were developed. He was knighted in 1957. He was President of the Royal Aeronautical Society in 1957–58.\nBAC\nWhen Vickers was merged into the newly created British Aircraft Corporation, he became executive director. During this period, he initiated the BAC One-Eleven (initially a Hunting Aircraft design). BAC was also a partner in the international projects for Concorde (for which he led the British team), Anglo-French SEPECAT Jaguar and the Panavia Tornado.\nHe was awarded the Daniel Guggenheim Medal in 1959. He won the Air League Founders Medal in 1969. He was made a member of the Order of Merit in 1971, and was awarded the Royal Medal in 1974 for his distinguished contributions in the applied sciences. He retired from BAC, as chairman, in 1975. In 1989 he was invested in the International Aerospace Hall of Fame.\nPersonal life\nIn October 1935 he married Marjorie Annie (Dinah) Thurgood (1908–1994), a clerk, also from Highams Park. They had a close and mutually supportive marriage and had one daughter, Angela.\nHis interests included painting and cricket. He was president of Surrey County Cricket Club in 1979. He died in Guildford in 2003 and his memorial service was held in Guildford Cathedral. He is buried at St Martha-on-the-Hill.\nReferences\nExternal links\n*[http://www.allstar.fiu.edu/aero/edwards.htm Brief biography]\n*[https://web.archive.org/web/20060327131011/http://www.surreycricket.com/news/archive/sir-george-edwards,2733,NS.html His connections with cricket]\n*[https://web.archive.org/web/20040409195909/http://www.george-edwards.me.uk/ Site devoted to his life]"
    }
  ]
}