{
  "content": [
    {
      "type": "text",
      "text": "# George King (basketball, born 1994)\n\n| birth_place = Fayetteville, North Carolina, U.S.\n| high_school = Brennan (San Antonio, Texas)\n| college = Colorado (2013–2018)\n| draft_year = 2018\n| draft_round = 2\n| draft_pick = 59\n| draft_team = Phoenix Suns\n| career_start = 2018\n| years1 =\n| team1 = Phoenix Suns\n| years2 = 2018–2019\n| team2 = →Northern Arizona Suns\n| years3 = 2019–2020\n| team3 = Aquila Trento\n| years4 = 2020\n| team4 = Zielona Góra\n| years5 = 2020–2021\n| team5 = Chemnitz 99\n| years6 = 2021–2022\n| team6 = Agua Caliente Clippers\n| years7 =\n| team7 = Dallas Mavericks\n| years8 = 2022–2023\n| team8 = Illawarra Hawks\n| years9 = 2023\n| team9 = Ontario Clippers\n| years10 = 2024\n| team10 = Ironi Ness Ziona\n| years11 = 2024–2025\n| team11 = Blackwater Bossing\n| years12 = 2025\n| team12 = Al Riyadi\n| years13 = 2025\n| team13 = Al Ittihad Alexandria\n| years14 = 2025\n| team14 = Dijlah Al-Jamiea\n| years15 = 2025–present\n| team15 = Guangzhou Loong Lions\n| highlights =\n* PLK champion (2020)\n* Second-team All-Pac-12 (2018)\n* Pac-12 Most Improved Player (2016)\n}}\nGeorge McZavier King Jr. (born January 15, 1994) is an American professional basketball player for Guangzhou Loong Lions of the Chinese Basketball Association (CBA). He played college basketball for the Colorado Buffaloes, earning second-team all-conference honors in the Pac-12 as a senior in 2018. He was selected by the Phoenix Suns in the second round of the 2018 NBA draft.\nCollege career\nKing grew up in Fayetteville, North Carolina before moving to San Antonio, where he played at William J. Brennan High School. He came to the University of Colorado at Boulder and played sparingly for the Buffaloes as a freshman. King and coach Tad Boyle mutually agreed for him to redshirt the next season for both academic and athletic reasons. The decision proved to be a good one, as King returned for the 2015–16 season and was named the Pac-12's Most Improved Player after averaging 13.6 points and 4.7 rebounds per game.\nThe next season, King's role adjusted as the team added future NBA guard Derrick White. King averaged 11.1 points and 6.8 rebounds as a junior. He declared for the 2017 NBA draft without an agent, but ultimately decided to return to Colorado for his senior season. In his final college season, King averaged 12.9 points and 7.8 rebounds per game, earning second-team All-Pac-12 honors.\nAt the close of his career, King finished with 1,294 points and 681 rebounds, ranking him in the school's all-time top 20 in both statistical categories. King also finished with 181 career three-pointers and shot .401 from the three-point line, good for finishing in the top-5 in school history when he graduated.\nProfessional career\nFollowing the close of his college career, King was named to the Reese's College All-Star Game, a showcase for senior professional prospects. King scored 21 points and grabbed 9 rebounds in the game, earning Most Outstanding Player honors for the East squad. King then moved to the Portsmouth Invitational Tournament, another pre-draft camp, where he averaged 18 points and 7.7 rebounds, earning all-tournament honors. King's standout performances resulted in an invitation to the 2018 NBA Draft Combine.\nPhoenix Suns (2018–2019)\nOn June 21, 2018, King was selected by the Phoenix Suns with the 59th pick of the 2018 NBA draft. Ten days later, he was announced as one of the players for the Suns' 2018 NBA Summer League squad. On July 6, King signed with the Suns entering his rookie season. Unlike the team's other rookies, King signed a two-way contract with them, thus splitting his playing time with the Phoenix Suns and their NBA G League affiliate team, the Northern Arizona Suns. In his debut in the NBA G League on November 4, King recorded 22 points on 9-of-14 shooting, four rebounds, four assists and a block in a 118–108 loss to the Santa Cruz Warriors. King made his NBA debut on December 11, 2018, in a 111–86 loss to the San Antonio Spurs, playing six minutes and grabbing a rebound with no points scored. It was the only game King played that season, as he injured his ankle during his time with the Northern Arizona team. In 41 NBA G League games, King averaged 15.5 points on 47.9% shooting and 43.3% three-point shooting alongside 5.3 rebounds per game.\nFor the 2019 NBA Summer League in Las Vegas, King played in four games for the Utah Jazz.\nAquila Basket Trento (2019–2020)\nOn July 21, 2019, King signed with Aquila Basket Trento of the Lega Basket Serie A. In 16 games, he averaged 5.4 points and 2.4 rebounds per game.\nStelmet Enea BC Zielona Góra (2020)\nOn January 17, 2020, King signed with Stelmet Enea BC Zielona Góra of the Polish Basketball League and VTB United League. In six games, he averaged 8.2 points and 4.8 rebounds per game. After the season was cancelled in March 2020 due to the COVID-19 pandemic, King returned to see his extended family in North Carolina.\nNiners Chemnitz (2020–2021)\nOn July 22, 2020, King signed with the Niners Chemnitz of the Basketball Bundesliga.\nAgua Caliente Clippers and Dallas Mavericks (2021–2022)\nOn September 27, 2021, King signed with the Los Angeles Clippers. However, he was waived on October 14 and joined the Agua Caliente Clippers of the NBA G League. He averaged 13.9 points per game in 13 games, shooting 46.6% from three-point range.\nOn December 22, 2021, King signed a 10-day contract with the Dallas Mavericks.\nOn January 1, 2022, King was reacquired by the Ontario Clippers after his 10-day deal expired.\nIllawarra Hawks (2022–2023)\nOn August 8, 2022, King signed with the Illawarra Hawks in Australia for the 2022–23 NBL season. On November 20, 2022, he returned to the United States to begin rehabilitation on a season-ending lower leg injury.\nOntario Clippers (2023)\nOn October 30, 2023, King rejoined the Ontario Clippers. However, he was waived on December 22.\nIroni Nes Ziona (2024)\nOn January 5, 2024, King signed with Ironi Ness Ziona of the Israeli Basketball Premier League.\nBlackwater Bossing (2024–2025)\nOn August 26, 2024, King signed with the Blackwater Bossing of the Philippine Basketball Association (PBA) to replace Ricky Ledo as the team's import for the 2024 PBA Governors' Cup. On September 23, 2024, King scored a career-high 64 points to go along with 13 rebounds in their 139–118 rout over the Rain or Shine Elasto Painters. On September 25, 2024, King resigned with Blackwater as the team's import for the 2024–25 PBA Commissioner's Cup.\nAl Ittihad Alexandria (2025)\nIn April 2025, King was part of Egypt's Al Ittihad Alexandria for the 2025 BAL season.\nCareer statistics\nNBA\nRegular season\n|-\n| style=\"text-align:left;\"|\n| style=\"text-align:left;\"| Phoenix\n| 1 || 0 || 6.0 || – || – || – || 1.0 || .0 || .0 || .0 || .0\n|-\n| style=\"text-align:left;\"|\n| style=\"text-align:left;\"| Dallas\n| 4 || 0 || 4.8 || .000 || .000 || .500 || 1.3 || .0 || .0 || .0 || .3\n|- class=\"sortbottom\"\n| style=\"text-align:center;\" colspan=\"2\"| Career\n| 5 || 0 || 5.0 || .000 || .000 || .500 || 1.2 || .0 || .0 || .0 || .2\nCollege\n|-\n| style=\"text-align:left;\"| 2013–14\n| style=\"text-align:left;\"| Colorado\n| 27 || 0 || 5.5 || .282 || .200 || .652 || 1.5 || .2 || .1 || .0 || 1.5\n|-\n| style=\"text-align:left;\"| 2015–16\n| style=\"text-align:left;\"| Colorado\n| 34 || 27 || 25.4 || .446 || .456 || .748 || 4.7 || .7 || .4 || .2 || 13.6\n|-\n| style=\"text-align:left;\"| 2016–17\n| style=\"text-align:left;\"| Colorado\n| 34 || 31 || 27.7 || .460 || .376 || .671 || 6.8 || .7 || .5 || .2 || 11.1\n|-\n| style=\"text-align:left;\"| 2017–18\n| style=\"text-align:left;\"| Colorado\n| 32 || 31 || 28.5 || .445 || .395 || .782 || 7.8 || 1.1 || .5 || .7 || 12.9\n|- class=\"sortbottom\"\n| style=\"text-align:center;\" colspan=\"2\"| Career\n| 127 || 89 || 22.6 || .444 || .401 || .731 || 5.4 || .7 || .4 || .3 || 10.2\nPersonal life\nThroughout his life, his parents were involved in the U.S. military. His father, George Sr., is an Army veteran, while his mother, Tresse, a Chief Master Sergeant in the United States Air Force, died in Kuwait on August 3, 2021. He also has a sister named Jecia Anderson, who was born in 1991.\nReferences\nExternal links\n*\n*[https://cubuffs.com/roster.aspx?rp_id=11332 Colorado Buffaloes bio]\n*[https://www.sports-reference.com/cbb/players/george-king-1.html College stats @ Sports-reference.com]"
    }
  ]
}