{
  "content": [
    {
      "type": "text",
      "text": "# Geothermal exploration__disambig_1\n\nexploration field, Iceland.]]\nGeothermal exploration is the exploration of the subsurface in search of viable active geothermal regions with the goal of building a geothermal power plant, where hot fluids drive turbines to create electricity.  Exploration methods include a broad range of disciplines including geology, geophysics, geochemistry and engineering.\nGeothermal regions with adequate heat flow to fuel power plants are found in rift zones, subduction zones and mantle plumes.  Hot spots are characterized by four geothermal elements.  An active region will have:\n# Heat Source - Shallow magmatic body, decaying radioactive elements or ambient heat from high pressures\n# Reservoir - Collection of hot rocks from which heat can be drawn\n# Geothermal Fluid - Gas, vapor and water found within the reservoir\n# Recharge Area - Area surrounding the reservoir that rehydrates the geothermal system.\nExploration involves not only identifying hot geothermal bodies, but also low-density, cost effective regions to drill and already constituted plumbing systems inherent within the subsurface.  This information allows for higher success rates in geothermal plant production as well as lower drilling costs.\nAs much as 42% of all expenses associated with geothermal energy production can be attributed to exploration. These costs are mostly from drilling operations necessary to confirm or deny viable geothermal regions.    Some geothermal experts have gone to say that developments in exploration techniques and technologies have the potential to bring the greatest advancements within the industry.\nMethods of exploration\nDrilling\nDrilling provides the most accurate information in the exploration process, but is also the most costly exploration method.\nThermal gradient holes (TGH), exploration wells (slim holes), and full-scale production wells (wildcats) provide the most reliable information on the subsurface.  Temperature gradients, thermal pockets and other geothermal characteristics can be measured directly after drilling, providing valuable information.\nGeothermal exploration wells rarely exceed 4&nbsp;km in depth.  Subsurface materials associated with geothermal fields range from limestone to shale, volcanic rocks and granite.  Most drilled geothermal exploration wells, up to the production well, are still considered to be within the exploration phase.  Most consultants and engineers consider exploration to continue until one production well is completed successfully.\nGenerally, the first wildcat well has a success rate of 25%.  Following more analysis and investigation, success rates then increase to a range from 60% to 80%.  Although expenses vary significantly, drilling costs are estimated at $400/ft.  Therefore, it is becoming paramount to investigate other means of exploration before drilling operations commence.  To increase the chances of successfully drilling, innovations in remote sensing technologies have developed over the last 2 decades.  These less costly means of exploration are categorized into multiple fields including geology, geochemistry and geophysics.\nGeophysics\nSeismology\nSeismology has played a significant role in the oil and gas industry and is now being adapted to geothermal exploration.  Seismic waves propagate and interact with subterranean components and respond accordingly.  Two sub categories exist that are relevant to the source of the seismic signal.  Active seismology relies on using induced/man-made vibrations at or near the surface.  Passive seismology uses earthquakes, volcanic eruptions or other tectonic activity as sources.\nPassive seismic studies use natural wave propagation through the earth.  Geothermal fields are often characterized by increased levels of seismicity. Earthquakes of lesser magnitude are much more frequent than ones of larger magnitude.  Therefore, these micro earthquakes (MEQ), registering below 2.0 magnitude on the Richter scale, are used to reveal subsurface qualities relating to geothermal exploration.  The high rate of MEQ in geothermal regions produce large datasets that do not require long field deployments.\nActive Seismology, which has history in the oil and gas industry, involves studying man made vibrational wave propagation.  In these studies geophones (or other seismic sensors) are spread across the study site.  The most common geophone spreads are in line, offset, in-line with center shot and Fan shooting.\nMany analytical techniques can be applied to active seismology studies but generally all include Huygens Principle, Fermat's Principle and Snell's law.  These basic principles can be used to identify subsurface anomalies, reflective layers and other objects with high impedance contrasts.\nGravity\nGravimetry studies use changes in densities to characterize subsurface properties.  This method is well applied when identifying dense subsurface anomalies including granite bodies, which are vital to locate in the geothermal exploration projects.  Subsurface fault lines are also identifiable with gravitational methods.  These faults are often identified as prime drilling locations as their densities are much less than surrounding material.  Developments in airborne gravitational studies yield large amounts of data, which can be used to model the subsurface 3 dimensionally with relatively high levels of accuracy.\nChanges in groundwater levels may also be measured and identified with gravitational methods.  This recharge element is imperative in creating productive geothermal systems.  Pore density and subsequent overall density are affected by fluid flow and therefore change the gravitational field.  When correlated with current weather conditions, this can be measured and modeled to estimate the rate of recharge in geothermal reservoirs.\nUnfortunately, there are many other factors that must be realized before data from a gravity study can be interpreted.  The average gravitational field the earth produces is 920&nbsp;cm/c^2.  Objects of concern produce a significantly smaller gravitational field.  Therefore, instrumentation must detect variations as small as 0.00001%.  Other considerations including elevation, latitude and weather conditions must be carefully observed and taken into account.\nResistivity and magnetotellurics\nMagnetotellurics (MT) measurements allow detection of resistivity anomalies associated with productive geothermal structures, including faults and the presence of a cap rock, and allow for estimation of geothermal reservoir temperatures at various depths. MT has successfully contributed to the successful mapping and development of geothermal resources around the world since the early 1980s, including in the U.S. and countries located on the Pacific Ring of Fire such as Japan, New Zealand, the Philippines, Ecuador, and Peru.\nGeological materials are generally poor electrical conductors and have a high resistivity. Hydrothermal fluids in the pores and fractures of the earth, however, increase the conductivity of the subsurface material. This change in conductivity is used to map the subsurface geology and estimate the subsurface material composition. Resistivity measurements are made using a series of probes distributed tens to hundreds of meters apart, to detect the electrical response of the Earth to injection of electrical impulses in order to reconstruct the distribution of electrical resistance in the rocks. Since flowing geothermal waters can be detected as zones of low resistance, it is possible to map geothermal resources using such a technique. However, care must be exercised when interpreting low resistivity zones since they may also be caused by changes in rock type and temperature.\nThe Earth's magnetic field varies in intensity and orientation during the day inducing detectable electrical currents in the Earth's crust. The range of the frequency of those currents allows a multispectral analysis of the variation in the electromagnetic local field. As a result, it is possible a tomographic reconstruction of geology, since the currents are determined by the underlying response of the different rocks to the changing magnetic field.\nMagnetics\nThe most common application magnetism has in geothermal exploration involves identifying the depth of the curie point or curie temperature.  At the curie point, materials will change from ferromagnetic to paramagnetic.  Locating curie temperatures for known subsurface materials provides estimates on future plant productivity.  For example, titanomagnetitite, a common material in geothermal fields, has a curie temperature between 200 and 570 degrees Celsius.  Simple geometric anomalies modeled at different depths are used to best estimate the curie depth.\nGeochemistry\nThis science is readily used in geothermal exploration.  Scientists within this field relate surface fluid properties and geologic data to geothermal bodies.  Temperature, isotopic ratios, elemental ratios, mercury &  concentrations are all data points under close examination.  Geothermometers  and other instrumentation are placed around field sites to increase the fidelity of subsurface temperature estimates.\nUS geothermal potential\nGeothermal Energy is an underdeveloped energy resource and warrants further investigation and exploration.  According to the U.S. Department of Energy, Utah's geothermal capabilities alone, if fully developed, could provide 1/3 of the state's  power needs. Currently, the United States is planning to organize national geothermal databases, expand USGS resources nationally and develop geophysical projects to validate advances in exploration technologies.  Below lists U.S. counties and regions that potentially can utilize geothermal power and would warrant further exploration.\n{| class=\"wikitable\"\n|-\n! U.S. State !! County/Region\n|-\n| Arizona || Cochise, Graham, Greenlee, Maricopa, Pima, Pinal, Yauapia, Yuma\n|-\n| California || Alpine, Colusa, Contra Costa, Imperial, Inyo, Kern, Lake, Lassen, Los Angeles, Modoc, Mono, Monterey, Napa, Orange, Placer, Plumas, Riverside, San Bernardino, San Diego, San Luis Obispo, Santa Barbara, Shasta, Sierra, Sonoma, Ventura\n|-\n| Colorado || Archuleta, Chaffee, Fremont, Garfield, Gunnison, Mineral, Ouray, Park, Routt, Saguache\n|-\n| Idaho || Ada, Adams, Bear Lake, Blaine, Boise, Bonneville, Camas, Canyon, Caribou, Cassia, Custer, Elmore, Franklin, Fremont, Gem, Lemhi, Oneida, Owyhee, Payette, Teton, Twin Falls, Valley, Washington\n|-\n| Montana || Beaverhead, Deer Lodge, Gallatin, Jefferson, Lewis and Clark, Madison, Park, Roosevelt, Rosebud, Sanders, Silver Bow, Stillwater\n|-\n| Nevada || Carson City, Churchill, Douglas, Elk, Eureka, Humboldt, Lincoln, Lyon, Nye, Pershing, Storey, Washoe, White Pine\n|-\n| New Mexico || Donna Ana, Grant, Hidalgo, McKinley, Rio Arriba, San Miguel, Sandoval, Valencia\n|-\n| Oregon || Baker, Clackamas, Crook, Harney, Klamath, Lake, Lane, Linn, Malheur, Marion, Umatilla, Union, Wasco\n|-\n| Utah || Box Elder, Cahce, Davis, Iron, Juab, Millard, Salt Lake, San Pete, Sevier, Uintah, Utah, Weber, Washington, Benton, Grant, King, Lincoln, Okanogan, Skamania\n|-\n| Alaska (Not Counties) || Adak, Akutan, Baranof, Bell Island Hot Springs, Chena Hot Springs, Circle Hot Springs, Goddard, Makushin, Manley Hot Springs, Melozi Springs, Morzhovoi, Nancy, Portage, Pilgrim Springs, Serpentine Hot Springs, Sitka, Unalaska\n|-\n| Nebraska || Cheyenne, Keya Paha, Kimball, Scottsbluff\n|-\n| North Dakota || McLean\n|-\n| South Dakota || Butte, Corson, Dewey, Fall River, Haakon, Harding, Jackson, Jones, Lawrence, Meade, Mellette, Pennington, Perkins, Stanley, Todd, Tripp, Ziebach\n|-\n| Texas || Atacosa, Bell, Bexar, Brazoria, Burleson, Concho, Dallas, El Paso, Falls, Gonzale, Hardin, Hill, Karnes, Live Oak, McLennan, Milam, Navarro, Presidio, Webb\n|-\n| Wyoming || Hot Springs, Lincoln, Natrona\n|-\n|}\nSee also\n* Geothermal heating\n* Geothermal power\n* Steam power\nExternal links\n* [http://www.geo-energy.org/ Geothermal Energy Association]\n* [http://www.geothermal.org/ Geothermal Resource Council]\n* [http://www.xdtek.com/Geothermal.html More on Seismic Exploration]\nReferences"
    }
  ]
}