{
  "content": [
    {
      "type": "text",
      "text": "# German prisoners of war in the United Kingdom\n\nwho were captured after their ship was sunk during the Battle of the North Cape arriving in the United Kingdom]]\nLarge numbers of German prisoners of war were held in Britain between the outbreak of the Second World War in September 1939 and late 1948.  Their numbers reached a peak of around 400,000 in 1946, and then began to fall when repatriation began. The experiences of these prisoners differed in certain important respects from those of captured German servicemen held by other nations.  The treatment of the captives, though strict, was generally humane, and fewer prisoners died in British captivity than in other countries.  The British government also introduced a programme of re-education, which was intended to demonstrate to the POWs the evils of the Nazi regime, while promoting the advantages of democracy.  Some 25,000 German prisoners remained in the United Kingdom voluntarily after being released from prisoner of war status.\nWorld War II\nEarly phase of the war\nInitially, the only Germans captured by the British were naval personnel (mainly submariners) and members of the Luftwaffe (German air force).  The first prisoners were the captain and crew of a submarine, U-39, on 14 September 1939, only days after the outbreak of war.  The commanding officer, Captain Gerhard Glattes, was to serve one of the longest terms as a POW in British hands: he was finally released in April 1947 after  years in captivity.\nInitially two prisoner of war camps were established:\n* Camp No. 1, Grizedale Hall, Lancashire\nThis forty-room mansion was reserved for officers and became known as the 'U-boat Hotel'.  It had space for 200 prisoners of war, but in November 1939 it was occupied by only twenty-one men.\n* Camp No. 2, Glen Mill, Oldham, Lancashire\nThis was a former cotton mill housing 2,000 'other ranks', or in other words, those who were not a commissioned officer.\nDuring the early phase of the war, Britain adopted a policy of sending all enemy prisoners to Canada.  This measure was intended to preclude the possibility of POWs escaping and making their way back to Germany.  A further reason given was that food and other necessities were in short supply within the United Kingdom.  Consequently, men were generally shipped to Canada as soon as there were enough to fill a troop carrier.  This meant that the total held within the UK seldom exceeded 2,000 men, whereas about 9,000 German prisoners were being held in Canada by late 1942.\nMiddle phase of the war\nThe situation changed dramatically following the Desert War.  The United States had been at war with Germany since December 1941, and in late 1942 British and American forces began a joint campaign against German and Italian troops in North Africa. These Axis forces finally surrendered in May 1943, leaving the Allies with around 260,000 enemy prisoners of war on their hands.  About half of these POWs were German, half Italian.  The United States and Britain had previously agreed that in any joint operations they would share prisoners on a 50-50 basis, regardless of which nation's army had actually captured the individual soldiers concerned.  (This meant, for example, that all POWs captured in the Desert War would be divided equally between Britain and the US, although the majority of prisoners in this particular campaign had been taken by the British).   However, Britain's resources were already over-stretched, and its government asked the US to take some 130,000 prisoners in addition to its own 'share'.  The American government agreed to this on condition that they would be able to use the POWs as a labour force within the United States, and subject to Britain's undertaking to foot the bill for shipping the men back to Europe when the time came.  It was agreed that these men would technically count as British prisoners, even though they were to be detained in American camps.\nBritain's own German prisoners from the Desert War were held in camps in the Middle East, with the exception of a few high-ranking officers who were sent to Britain for interrogation.  (Britain's Italian prisoners were also taken to the United Kingdom, where they were housed in a network of camps, and were used as a workforce, predominantly in agriculture.)\nLate phase of the war\nAfter D-Day—the invasion of Europe—very large numbers of German military personnel were taken prisoner.  Immediately after the Allied landings, captured German troops were rounded up and taken to the invasion beaches, where a small fleet of LST (Landing Ships, Tank) had been detailed to transport them to England.\nAs a rule, those whose surnames began with a letter in the first half of the alphabet were sent to the United States. This group was ferried to Portland, Dorset, and then onward to a reception camp at Devizes, Wiltshire. After a few days they were transferred via Liverpool to the United States.  But when ports such as Cherbourg subsequently came under Allied control, shipments of German prisoners could be transferred by troopships directly to the US. Those whose names began with a letter in the second half of the alphabet were transported to the United Kingdom, arriving at the cluster of ports comprising Portsmouth, Gosport and Southampton. The majority were then taken to a transit camp at Kempton Park Racecourse for interrogation, and onward to a network of several hundred camps around the country, many of which had earlier been built and occupied by Italian prisoners, who were due to be repatriated earlier than the Germans. For the first time, the number of German prisoners of war held in Britain reached a substantial total.\nAfter VE-Day\nThe practice of transferring prisoners either to Britain or to the US continued until the German surrender in May 1945, when still larger numbers of German troops became prisoners of the Allies.  (See German prisoners of war in northwest Europe).  The majority of these POWs were held in camps within Germany, and in former German-occupied territories, such as Belgium.\nConditions in the British-run camps in Belgium were described as extremely harsh, and when the Financial Secretary to the War Office, Frederick Bellenger, received reports on the situation he is stated to have been 'filled with horror'. The camps in Belgium were then closed down and all the prisoners were transferred to Britain by late July 1946.\nIn early 1946, the United States chose to repatriate all of the POWs in its camps. The Germans were informed that they were being repatriated to Germany, where they would be set free.  However, some 130,000 of these men were \"British-owned\" prisoners, according to the \"50-50\" split referred to above.  Instead of being transported to Germany and released, they were delivered to Liverpool and were informed on arrival that they would have to remain in captivity in Britain for a further unspecified period.  These events caused considerable resentment among the Germans, as many of them had fought against and been captured by American forces, and had been unaware until then that they were technically prisoners of the British.\nWith the arrival of these additional prisoners, the total in Britain exceeded 400,000 in September 1946.\nNumbers of German POWs in Britain, 1945–1946\nAround 200,000 at the time of German surrender in May 1945. It peaked at 402,000 in September 1946.\n{| class=\"wikitable\"\n|-\n! Year !! Month !! No. of POWs\n|-\n| 1945 || December|| 211,300\n|-\n| 1946 || March || 265,000\n|-\n| || June|| 385,450\n|-\n| || September|| 402,200\n|}\nRepatriation\n, Yorkshire, United Kingdom]]\nFollowing pressure from politicians, religious groups, the Red Cross, and from a sizeable sector of the public, the British government began to repatriate the German prisoners in September 1946.\nReasons given for not following this course of action sooner include:\n* '''Britain's need for a work force for agriculture and for the reconstruction of buildings and infrastructure damaged during the war;\n* The collapse of Germany's economy:''' Britain claimed that Germany would not have been able to support an additional 400,000 men. Some prisoners, however, expressed the view that they should have been allowed to return home and rebuild their own country, instead of working in Britain. In practice, though, it is unlikely that accommodation for the men could have been provided, at least in the initial period following Germany's surrender. It is also doubtful whether materials, transport and other resources required for the country's reconstruction could have been provided at that time;\n* '''Britain's commitment to repatriate its Italian prisoners of war:''' Italy had switched sides, and the Italians were no longer regarded as the enemy. It was not until all the Italians had been returned to their country that resources (including shipping) could be made available for the repatriation of the German POWs.\nOnce repatriation of the German prisoners had commenced, most of the men had been returned to Germany by the latter half of 1948. Even at this late stage, Britain was still desperately short of agricultural workers while, at the same time, a significant number of the POWs were reluctant to return to Germany. (Reasons for this included their original home now being within the Soviet sector; being in a relationship with a British woman; and adverse reactions to the atrocities committed by the Nazis). Britain introduced a scheme under which men could be discharged from their prisoner status and could apply to stay on as civilian workers. About 30,000 men asked to join the scheme and just under 25,000 were accepted.  Some of the other men who stayed on under this initiative are still resident in Britain at the time of writing (2016).\nNumbers of German POWs in Britain, 1946–1948\n{| class=\"wikitable\"\n|-\n! Year !! Month !! No. of POWs\n|-\n| 1946 || December || 355,200\n|-\n| 1947 || March || 305,800\n|-\n|  || June || 267,250\n|-\n|  || September || 220,000\n|-\n|  || December || 155,700\n|-\n| 1948 || March || 82,800\n|-\n|  || June || 2,790\n|}\nWelfare\nMedical and dental care in the POW camps were provided by visiting British doctors and dentists, or by German prisoners with appropriate qualifications gained in Germany before enlisting in the forces. An International Red Cross report states:  'In the USA and Great Britain, at the end of the war, there was practically no change: the living conditions of the prisoners of war remained similar to those in force during the war.'\nWork\nEven before the German surrender some of the POWs were put to work as agricultural labourers on a trial basis.  After VE-Day all prisoners were required to work (excluding officers who could not be forced to do so.  Some officers did, however, volunteer for certain tasks).  Most POWs were employed on farms, as Britain urgently needed a high level of food production, and there was a shortage of agricultural workers.  Some performed other duties, as shown by the following table, which reflects the situation in mid-1946.\n{| class=\"wikitable\"\n|-\n! Type of employment !! Comments !! No. of POWs\n|-\n| Agriculture || Including camp staff associated with agriculture || 163,000\n|-\n| Preparation of building sites || || 22,000\n|-\n| \"Other useful work\" ||  || 94,000\n|-\n| Not employed || Inc. 11,000 sick and in detention || 46,000\n|-\n| \"Unemployable\" || Mainly officers and protected personnel (medical, etc.) || 13,000\n|-\n| || Total || 338,000\n|}\nAt first it was usual for groups of about 30 men to be escorted by armed guards to the fields where they were to work.  They were kept under close supervision at all times.  However, following the German surrender, the British government allowed some prisoners to be billeted on the farms where they were employed under minimal supervision.\nThe prisoners received pay of one shilling (5p) per day.  The position of the British government was that this was merely \"pocket money\", and that it was the responsibility of the prisoners' own government (i.e. Germany) to make good the arrears when the men were finally repatriated. In this matter, Britain neglected to consider that the German government no longer existed, and control of Germany rested in the hands of Britain itself, and with the other Allies through the Allied Commission.\nA controversial topic was the use of prisoners of war for the disposal of unexploded bombs, land-mines and munitions.  Dangerous activities of this kind were expressly forbidden by the Geneva Convention.  But, as mentioned above, Britain maintained that the Geneva Convention was not valid in the post-war period. Britain also argued that the prisoners in question had volunteered for these duties. At least three German POWs are known to have died while carrying out these hazardous tasks.\nDuring the catastrophic snowstorms suffered by Britain in the winter of 1946–47, German POWs stood shoulder-to-shoulder with Allied troops in an effort to re-open essential road and rail links.  The importance of their labour at this critical time cannot be overstated.\nRelations with the civilian population\nSome citizens felt animosity towards the German prisoners, particularly during the war and just afterward.  As time passed, though, the mood changed.  It was reported that many people sympathised with the prisoners, who had no immediate prospect of being repatriated.  The practice of billeting POWs with farmers provided an opportunity for an atmosphere of trust and friendship to evolve.\nIn late 1946 civilians were allowed for the first time to invite prisoners to their homes for Christmas.  One German was so moved by the experience that he wrote to a local newspaper: 'In no way was I prepared for what was done for me during Christmas Day by the family.  I was like a dear part of it.  Where they were, I was too, what they had I had too, and where they went I went too.'\nRestrictions on the prisoners were, by late 1947, almost completely removed.  The men were allowed to leave the camp unescorted and walk around the surrounding district.  They could now mix with civilians; visit cafés and cinemas; and attend church services.  Many met local women, though there was initially a ban on 'romantic liaisons': but once the ban was lifted, 796 marriages between German POWs and British women took place immediately. Many more would follow.\nRe-education\nPrisoners were encouraged to produce their own camp magazines, and a weekly German-language newspaper, Wochenpost, was published by the British government specifically for the POWs.  Lectures by visiting speakers were arranged, and libraries, gramophone records, and film shows were provided.  All of these activities were intended to demonstrate the principles of freedom of speech and political and racial tolerance.  POWs who were deemed to be suitable for more intensive instruction were invited to attend the college at Wilton Park, which had been set up for their benefit, and which is still in existence.\nThe Scientific Commission for the History of German Prisoners of War (often referred to as the Maschke Commission, after its chairman, Erich Maschke) came to the following conclusion:  'Although as a whole many critics saw the re-education efforts made by the victorious powers as problematic and questionable, it is a fact that none of the powers made such a decisive effort as Great Britain – particularly in respect of the POWs – to assist Germany's return to a free and democratic European group of nations ... in this respect the prisoners held in Great Britain ... were way ahead of their compatriots in Germany.'\nWriting in the 1960s an ex-POW stated: '... one notices constantly, in every serious conversation, who had the luck to be a prisoner of war in Britain.  I write the word \"luck\" quite intentionally, because, believe it or not, it is today here in West Germany considered an advantage to have been a prisoner of war in Britain.'\nIt was also an advantage from the point of view of the prisoners' physical well-being, as the following table shows.  The percentages represent fatalities among the POW populations of the Allied nations.  (They include POWs held in all territories by the nation in question, both inside and outside the home territory.  Thus the figure for the United Kingdom, for example, includes British camps in overseas territories such as Canada and the Middle East as well as those within the UK itself.)\n{| class=\"wikitable\" style=\"text-align:center\"\n|- style=\"background:#CCCCCC\"\n|-\n! style=\"text-align:left;background:#B0C4DE;\"|Territory where held\n! style=\"background:#B0C4DE\"|German POWs (armed forces and SS)\n! style=\"background:#B0C4DE\"|Total no. of fatalities\n! style=\"background:#B0C4DE\"|Fatalities (% of total)\n|-\n|align=left| Soviet Union ||3,150,000||1,094,250|| 34.7\n|-\n|align=left| East- and South-East Europe ||289,000||93,028|| 32.2\n|-\n|align=left| France ||937,000||24,178|| 2.6\n|-\n|align=left| United States of America ||3,097,000||5,802|| 0.2\n|-\n|align=left| United Kingdom ||3,635,000||1,254|| 0.03\n|-\n|align=left|Total||11,108,000||1,217,382|| 11.0\n|}\nIn the words of German historian Rüdiger Overmans, 'while the number of deaths in American captivity is small in comparison with other states, it should be observed that the holding power with the highest level of resources was by no means the one with the lowest death rate.'\nNotable persons\n* Luftwaffe pilot Franz von Werra, known as The One That Got Away from the book and subsequent film of that title.\n* Paratrooper Bernhard ('Bert') Trautmann, who went on to become a legendary footballer with Manchester City.\nSee also\n* German prisoners of war in the United States\n* Prisoners of war in World War II\nFootnotes\nReferences\n*\n*\n*\n*\nExternal links\n*"
    }
  ]
}