{
  "content": [
    {
      "type": "text",
      "text": "# German Archaeological Institute\n\n|mission     =\n|focus       =\n|president   =\n|chairman    =\n|head_label  = President\n|head        = Friederike Fless\n|faculty     =\n|adjunct_faculty =\n|staff       =\n|key_people  =\n|budget      = €38 million\n|endowment   =\n|debt        =\n|num_members =\n|subsidiaries =\n|owner       =\n|non-profit_slogan =\n|former_name =\n|location    =\n|city        = Berlin\n|country     = Germany\n|coor        =\n|address     =\n|website     = [https://www.dainst.org www.dainst.org]\n|dissolved   =\n|footnotes   =\n}}\nThe German Archaeological Institute (, DAI) is a research institute in the field of archaeology (and other related fields). The DAI is a \"federal agency\" under the Federal Foreign Office of Germany.\nStatus, tasks and goals\nThe Institute comes under the umbrella of the Federal Foreign Office of Germany. It has a legal right to academic self-administration but is also an important component of Germany's cultural, artistic, and foreign policy programmes. The DAI has often laid the groundwork for the establishment of interstate relationships. It maintains relationships with many academic organisations around the world. Its members include German archaeologists, German representatives of affiliated disciplines, and several important foreign researchers. It is not possible to apply for membership; it can only be received by co-option. Selection as a corresponding or ordinary member is accordingly a special honour and mark of academic recognition. The DAI maintains research offices in many countries around the world and a number of commissions focussed on specific topics.\nThe DAI carries out archaeological and historical research worldwide and therefore often works with scholars of host countries and other international scholars. Traditionally, the Mediterranean region and the Near East are the main areas of activity, but since 1979, the institute's activities have transcended these regions and are carried out worldwide. The institute carries out excavations, expeditions, and other projects. Since 2009, the DAI has established \"centres of excellence in research and teaching\" in the context of the \"Foreign Academic Policy Initiative\" (Initiative Außenwissenschaftspolitik). The institute is among the internationally recognised Top Research Institutes. To maintain this standard, the DAI receives special research from the Federal government's Genshagener Programme.\nIn 2019, it was decided to create a \"KulturGutRetter-Mechanismus\" under the leadership of the German Archaeology Institute in partnership with the Technisches Hilfswerk, the Römisch-Germanisches Zentralmuseum, and other partners. In crisis situations, it should provide mechanisms for the protection, maintenance, and salvage of artefacts and buildings.\nIt is a goal of the DAI to support deeper mutual understanding between cultures. It seeks to make a contribution to intercultural dialogue. Additionally, through altruistic research of other cultures and academic interaction with other nations, it is meant to contribute positively to Germany's reputation in the world.\nHistory\nFoundation\n, the main founder.]]\nThe German Archaeological Institute was established in the early days of archaeology as a scholarly discipline. Even before its establishment, there were learned societies, like the , focused on the material remains of ancient peoples, but they were antiquarian in approach. The first moves toward an archaeological organisation took place in Rome in the 1820s, with the establishment of the , a circle of European academics, artists, and diplomats. They realised that the new knowledge and artefacts then being discovered at an ever-accelerating rate required international academic collaboration. The early attempt to establish a \"Roman-Hyperborean Society\" to facilitate that collaboration are commemorated in the logo of the DAI, which depicts a Hyperborean griffin. On 2 January 1829, the archaeologist Eduard Gerhard, the Prussian envoy Christian Charles Josias von Bunsen, the Hannoverian chargé d'affairs in Rome, August Kestner, the commissario della antichità Carlo Fea, and the Danish sculptor Bertel Thorvaldsen announced the foundation of an Instituto di corrispondenza archeologica (Italian for \"institute of archaeological correspondence\"). The founding event took place on 21 April 1829, the mythical foundation date of Rome. The Prussian crown prince Frederick William agreed to be the society's patron. The first president was the French ambassador to Naples, Pierre Louis Jean Casimir de Blacas. Administration was entrusted to a board of secretaries, led by a General Secretary. Among the founding members were Otto Magnus von Stackelberg and Theodor Panofka. After de Blacas' death in 1839, Klemens von Metternich was appointed as president in 1841. After Metternich's death in 1859, political and social representation ceased to play an important role in the organisation.\nInitially, the Institute's goal was to gather and publish all archaeological discoveries relating to Classical Antiquity. The focus was on Greek and Roman antiquities, but finds from Egypt and the Near East were not excluded. There were two types of membership: corresponding members (socii) and ordinary members (membri). The socii (\"fellows\") were intended to form a dense network covering the whole of Europe. They were served by sections in Italy, Germany, France, and England. The Paris section under the leadership of Honoré Théodoric d'Albert de Luynes was particularly active in these early years. The membri were a smaller group who undertook long-term duties and were obliged to produce academic contributions and to review publications. The basic distinction is retained to this day.\nThe foundation of the institute was a significant milestone for the professionalisation of archaeology. For the first time, efforts were made to gather and publish all archaeological finds, rather than focusing on the significance of individual monuments in isolation. The ''Bullettino degli Annali dell'Instituto di Corrispondenza Archeologica'' was the first archaeological periodical, and created the possibility for new discoveries to be continually published. The creation of a large reading library, open to all researchers, was another new development. Along with this a continuously active research centre with public lectures and discussions was created for the first time. All of these innovations made the Roman institute a centre of archaeological research in Europe and a model for the later national institutes created in the Mediterranean and Near East.\nWhen Eduard Gebhard left Rome in 1832, for the Altes Museum in Berlin, the institute's centre of gravity shifted to Berlin too. Simultaneously, nationalist interests increased and the institute lost its international aspect. In 1836, the first modest buildings of the institute were erected in Rome on the land of the Prussian embassy. From 1842, the secretaries received salaries, the whole cost of which was taken over by the Prussian ministry of culture. The highest administrative organ, the central directorate, had several international members, until the Revolutions of 1848–1849, after which only German members were allowed.\nImperial Institute (1871–1945)\nIn 1871, the \"Institute for Archaeological Correspondence\" – as it was known at the time – formally became an organ of the Prussian state government. Three years later, it was renamed as the Kaiserlich Deutsches Archäologisches Institut (Imperial German Archaeological Institute). After becoming an Imperial Institute (Reichsanstalt), the DAI opened a second foreign base, the Athens Division, in 1874. Like the Roman division, the Athenian Division was tasked with recording and publishing artefacts. However, from the beginning, its focus was carrying out archaeological excavations and topographical surveys. The Roman Division did not undertake this kind of research until after the Second World War. The Athenian Division was the second foreign research institute to be founded in Athens, after the French School, which was founded in 1846.\nThe foundation of the Romano-Germanic Commission (RGK) in 1902 was due to changing academic frameworks. The influence of historicism led to a shift in interest away from art historical and philological approaches to archaeology towards empirical research of objects derived from archaeological excavations. The goal was to create an organisation, which would provide a home for the newer archaeological sub-disciplines of prehistory and Roman provincial archaeology. The RGK was intended to be the central hub of archaeological research in Germany, which had hitherto been undertaken by a range of local heritage associations, antiquarian societies, and the Imperial Limes Commission. As in Italy, it did not initially undertake its own excavations, busying itself with investigations at Aliso and Trier.\nOn the hundredth anniversary of the DAI's establishment in 1929, it expanded further and took over existing structures elsewhere. In Egypt, the Cairo Division was established in this year, amalgamating several German predecessor organisations. In Turkey, the Istanbul Division was established, taking over projects and structures of the Berlin museums, which had been active in Asia Minor since the late 19th century. It was also planned to open a branch office in Madrid in 1929, but this did not actually take place until 1943.\nPost-war history (1945–)\nThe Baghdad division was founded in 1955 and the Tehran division in 1961. In 1967, the Commission for Ancient History and Epigraphy, which had been established in 1955, was brought under the DAI's umbrella to facilitate the study of textual material recovered from archaeological excavations. The Lisbon division was founded in 1971 and subsequently closed in 1999, with its library passing under the control of the Portuguese Directorate General for Cultural Heritage. The Sana'a Office in Yemen was opened in 1978. The Commission for General and Comparative Archaeology (KAVA) was established in Bonn in 1979; it was later redubbed the Commission for Archaeology of Non-European Cultures (KAAK). The Damascus Office was established in 1980. With the outbreak of the Iran-Iraq War in 1980, the Baghdad division's library and offices were largely relocated to Berlin and it ceased excavations, shifting its focus to heritage protection. The Eurasian Division was established in 1995, to pursue research in Eastern Europe and Central Asia, which had become possible following the dissolution of the Soviet Union. The Tehran Office became part of the new division in 1996. The Damascus, Sana'a, and Baghdad Offices were placed under the control of a new Eastern Division, based at the DAI's headquarters in Berlin in 1996. The Ulaanbaatar research centre was founded in Mongolia in 2007 under the umbrella of KAAK. The Beijing Office was established in 2009. The Baghdad office resumed archaeological excavations in Iraqi Kurdistan resumed in 2011, and in southern Iraq in 2015. Following the outbreak of the Syrian Civil War in 2011, the Damascus Office shifted its base to Amman in Jordan, where it formed a close partnership with the German Protestant Institute of Archaeology of the Holy Land (GPIA). Parts of the Damascus library were relocated to Berlin. The DAI and GPIA jointly established a new research centre in Amman in 2019, which has effectively subsumed the Damascus office. With the outbreak of the Yemeni Civil War in 2014, the Sana'a office's buildings in Sana'a were closed and its main focus has shifted to Northeast Africa, where it had been active since 2009. The Budapest research centre was set up in June 2016.\nGeneral Secretaries\n* Alexander Conze (1887–1905)\n* Otto Puchstein (1905–1911)\n* Hans Dragendorff (1911–1922)\n* Gerhart Rodenwaldt (1922–1926)\nPresidents\n* Gerhart Rodenwaldt (1926–1932)\n* Theodor Wiegand (1932–1936)\n* Martin Schede (1938–1945)\n* Carl Weickert (1947–1954)\n* Erich Boehringer (1954–1960)\n* Kurt Bittel (1960–1972)\n* Werner Krämer (1972–1980)\n* Edmund Buchner (1980–1988)\n* Helmut Kyrieleis (1988–2003)\n* Hermann Parzinger (2003–2008)\n* Hans-Joachim Gehrke (2008–2011)\n* Friederike Fless (since 2011)\nStructure and organisation\nThe German Archaeological Institute is headed by a president (since 2011, this is Friederike Fless, the first woman to hold the position), who is supported by a general secretary (since 2014, this is ). The secretary represents the president and supports them, particularly in matters of academic organisation and policy. The president is bound by the determinations of the central directorate.\nThe central directorate (Zentraldirektion) is the highest monitoring and decision-making body of the DAI. It determines the annual budget and academic programme, as well as making decisions about publications. It also chooses the president and the directors of the divisions and commissions. A new statue governing the role of the central directorate came into force on 1 October 2019, which specified in particular that employees of the DAI can no longer be members of the central directorate.\nAs of May 2023, the central directorate consisted of the following members:\n* Ute Verstegen, chairman, Christian archaeology\n* Carola Metzner-Nebelsick, deputy chairman, Prehistory\n* Vito Cecere, Representative of the Foreign office\n* Christina Norwig, Representative of the Federal Ministry for Education and Research\n;Representatives of the various archaeological disciplines and affiliated topics from universities, museums, and other academic institutions:\n* Christof Berns, Classical archaeology\n* Ruth Bielfeldt, Classical archaeology\n* Ulrike Fauerbach, Architectural history\n* Kaja Harter-Uibopuu, Ancient history\n* Barbara Helwing, Staatliche Museen zu Berlin, Vorderasiatisches Museum Berlin, Near Eastern archaeology\n* Lutz Käppel, Classical philology\n* Achim Lichtenberger, Classical archaeology\n* Angelika Lohwasser, Egyptology\n* Johannes Müller, Prehistory\n* Marcus Reuter, Rheinisches Landesmuseum Trier, Roman provincial archaeology\n* Monika Trümper, Classical archaeology\nThe president, general secretary, and speaker of the directors of the DAI participate in meetings of the central directorate in an advisory capacity.\nUntil the introduction of a new statute on 1 January 2005, classical archaeology had even more representation in the directorate, since they supplied ten of the subject representatives on the directorate, with only one seat for representatives of other subjects. Until 2005, the general secretary of the Römisch-Germanisches Zentralmuseum was an ex officio member of the directorate.\nThe central directorate is responsible for the award of scholarships, except for those awarded by the commissions. The most important of these is the travel stipend of the DAI (Reisestipendium ), which has been awarded annually since 1859. The members of the scholarship committee are Friederike Fless (chairwoman), Katja Sporn, Ruth Bielfeldt, Ulrike Fauerbach, Kaja Harter-Uibopuu, Lutz Käppel, Carola Metzner-Nebelsick und Monika Trümper.\nThe members of the heritage building committee are Ulrike Fauerbach (chairwoman), Friederike Fless, Philipp von Rummel, Katja Piesker, Steffen Laue, Klaus Nohlen, Andreas Schwarting, Axel Seemann and Josef Steiner.\nBoard of directors\nThe board of directors (Directorium)  consists of the president, general secretary, and the directors of the divisions and commissions of the DAI. It is responsible for working out comprehensive academic plans, strategic objectives, and comprehensive organisational rules.\n* President: Friederike Fless\n* General secretary: Philipp von Rummel\n* Athens division: Katja Sporn\n* Istanbul division: Felix Pirson\n* Cairo division: Dietrich Raue\n* Madrid division: Dirce Marzoli\n* Rome division: Ortwin Dally, Speaker of the directors\n* Eurasian division: Svend Hansen\n* Eastern division: Margarete van Ess\n* Commission for ancient history and epigraphy: Christof Schuler\n* Commission for archaeology of non-European cultres: Jörg Linstädter\n* Römisch-Germanische Kommission: Kerstin P. Hofmann, acting speaker of the board\nDivisions and foreign schools\nThe institute contains the following divisions based outside Germany.\n* Eurasian Division, Berlin; director: Svend Hansen; deputy: Mayke Wagner\n** , Iran. Director: Judith Thomalsky\n** Beijing Office, China. Director: Mayke Wagner\n* Eastern Division, Berlin. Director: Margarete van Ess; Deputy: Simone Mühl\n** Damascus Office, Syria. Director: Claudia Bührig.\n** Sana'a Office, Yemen. Director: Iris Gerlach\n** Baghdad Office, Iraq. Acting director: Margarete van Ess.\n* Athens Division, Greece. Director: Katja Sporn, Deputy: Oliver Pilz\n* , Turkey. Director: Felix Pirson; Deputy: Moritz Kinzel\n* , Egypt. Director: Dietrich Raue; Deputy: Ralph Bodenstein\n* , Spain. Director: Dirce Marzoli; Deputy: Felix Arnold\n**Lisbon Office, Portugal, closed 1999.\n* , Italy. Director: Ortwin Dally; Deputy: Norbert Zimmermann\nThe German Protestant Institute of Archaeology of the Holy Land in Jerusalem is simultaneously an office of the German Archaeological Institute. It is led by Dieter Vieweger, the current director for Jerusalem and Amman, who is also director of the Jerusalem section. The Amman section Brita Jansen.\nCommissions\n* in Frankfurt am Main, directed by Kerstin P. Hofmann, includes the world's largest library for prehistoric archaeology.\n** Ingolstadt research centre (1984–2015)\n** Budapest research centre at the Hungarian Academy of Sciences (since June 2016)\n*  in Munich, directed by Christof Schuler; deputy is Rudolf Haensch\n*  (KAAK), previously the Commission for General and Comparative Archaeology (KAVA), in Bonn, led by Jörg Linstädter\n** Ulaanbaatar research centre, led by Christina Franken\nThe commissions have academic advisory boards, whose members previously served for an unlimited period of time, but now have a maximum term of ten years.\nCross-disciplinary units of the central organisation\n* Architecture unit (construction, reconstructions, research into the history of architecture): Katja Piesker\n* Scientific unit (anthropology/palaeopathology, archaeobotany, archaeozoology, dendrochronology/palaeoclimatology): Ferran Antolín\n* Unit for Information Technology (academic IT, development of digital research environments): Reinhard Förtsch\n* Unit for heritage protection and site management: Rainer Komp\nUnits and areas within the presidium:\n* Unit for technological development and databasing\n* Internal Communications: Sebastian Dobberstein\n* Press Office: Nicole Kehrer\nCentral offices\n* Central administration\n* Publications, led by Peter Baumeister\n* Library, led by Henriette Senst\n* Central archive\n* Central Photo archive\n* Lepsius College\nPublications\nA full list of the publications of the Institute (journals, series, monographs) is accessible online.\nThe DAI produces some of the most important German archaeological journals (translated title and standard abbreviations in brackets):\n* Archäologie weltweit. Magazin des Deutschen Archäologischen Instituts (Archaeology World Wide)\n* ' (Yearbook of the German Archaeological Institute, JdI)\n* ' (Archaeological Gazette, AA)\n* Archäologische Bibliographie (Archaeological Bibliography), print publication discontinued.\n* Mitteilungen des Deutschen Archäologischen Instituts. Abteilung Rom =  (Correspondence of the German Archaeological Institute, Rome Division, MDAI-RM)\n* Mitteilungen des Deutschen Archäologischen Instituts. Abteilung Athen = Athenische Mitteilungen (Correspondence of the German Archaeological Institute, Athens Division, MDAI-AM)\n* Mitteilungen des Deutschen Archäologischen Instituts. Abteilung Istanbul =  (Correspondence of the German Archaeological Institute, Istanbul Division, IstMitt)\n*  (Madrid Correspondence, MM)\n* Mitteilungen des Deutschen Archäologischen Instituts. Abteilung Kairo (Correspondence of the German Archaeological Institute, Cairo Division, MDAIK)\n** From 1930 until 1944, this was published in Berlin as the Mitteilungen des Deutschen Instituts für Ägyptische Altertumskunde in Kairo (Correspondence of the German Institute for Egyptian Antiquities in Cairo) and the abbreviation was therefore MDIAAK.\n* Sonderschrift des Deutschen Archäologischen Instituts. Abteilung Kairo (Special Publication of the German Archaeological Institute, Cairo Division, SDAIK)\n* Sonderschrift des Deutschen Archäologischen Instituts. Abteilung Rom (Special Publication of the German Archaeological Institute, Rome Division, SDAIR)\n* Archäologische Mitteilungen aus Iran und Turan (Archaeological Correspondence from Iran and Turan, AMIT)\n* Baghdader Mitteilungen (Baghdad Correspondence, BaM), discontinued.\n* Damaszener Mitteilungen (Damascene Correspondence, DaM), discontinued.\n* Beiträge zur Allgemeinen und Vergleichenden Archäologie (Contributions to General and Comparative Archaeology, BAVA)\n* ' (Report of the Romano-Germanic Commission, BerRGK)\n* ' (Germania: Gazette of the Romano-Germanic Commission of the German Archaeological Institute, Germania)\n* Chiron. Mitteilungen der Kommission für Alte Geschichte und Epigraphik des Deutschen Archäologischen Instituts (Chiron: Correspondence of the Commission for Ancient History and Epigraphy of the German Archaeological Institute, Chiron)\n* Eurasia Antiqua. Zeitschrift für Archäologie Eurasiens (Eurasia Antique: Journal for Archaeology of Eurasia, EurAnt)\n* Zeitschrift für Orient-Archäologie (Journal for Oriental Archaeology)\nCharitable society\nThe German Archaeological Institute is supported financially by a charitable organisation, the  (TWG).\nNotable members\n* Klaus Schmidt, German archaeologist and pre-historian who led the excavations at Göbekli Tepe from 1996 to 2014\n* Eszter Bánffy, Hungarian prehistorian and archaeologist\n* Yevhen Chernenko, Ukrainian archaeologist\n* Elisabeth Ettlinger, Swiss archaeologist of the Roman provinces\n* D. E. L. Haynes, English classical scholar, archaeologist and museum curator\n* Nikolaos Kaltsas, Greek classical archaeologist\n* Jürgen Oldenstein, German archaeologist of the Roman provinces\n* Emmanouil Korres, Greek restoration architect and archaeologist\n* Paul Wittek, Austrian orientalist who formulated an influential theory of Ottoman origins\nSee also\n*German Historical Institute\n*German Archaeological Institute at Athens\n*Projekt Dyabola\n*Arachne (archaeological database)\nReferences\nBibliography\n*\n*\n*\n*\n*\n*\nExternal links\n* [http://www.dainst.org/ Official Website]\n*\n* [http://zefys.staatsbibliothek-berlin.de/dfg-viewer/?no_cache=1&set%5Bimage%5D=2&set%5Bzoom%5D=default&set%5Bdebug%5D=0&set%5Bdouble%5D=0&set%5Bmets%5D=http%3A%2F%2Fzefys.staatsbibliothek-berlin.de%2Foai%2F%3Ftx_zefysoai_pi1%255Bidentifier%255D%3D71790559-959a-4a06-8b8a-b829de6d1146 Die 100-Jahr-Feier des Archäologischen Instituts des Deutschen Reiches]. In: Zeitbilder, 21. April 1929, pp.&nbsp;2–4."
    }
  ]
}