{
  "content": [
    {
      "type": "text",
      "text": "# German Intercept Station Operations during World War II\n\nGerman Intercept Station Operations were intercept operations that were undertaken by the German Army forces in Europe during World War II. Interception is the gathering of radio signals as part of a signals intelligence operation. It was a major part of German radio intelligence operations during World War II.\nHistory of intercept operations during the interwar period\nStation operations 1915-1923\nThe Imperial German Army began its development of a signal intelligence organisation during World War I under the direction of Colonel Walter Nicolai. In 1906, Nicolai began his career in Abteilung IIIb, when he took over the intercept station at the Königsberg fortress in Königsberg to mainly spy on the Russians. He was commanding officer of military intelligence unit, Abteilung III b from 1913 to 1919. However it was not until 1915 that the army realised a nascent intercept organisation through the dedicated work of Nicolai. Nicolai developed the basic structure of the armies intelligence system, by creating a system of companies that monitored either short or long range wireless signals. The intercept companies were attached to the army at division level. These companies were known as fixed intercept network stations () (Feste) and became operational in 1923.\nStation operations 1923–1933\nAssignment of intercept coverage from 1923 to 1933 was made by the Code and Ciphers of the Defense Ministry (). The division of intercept tasks was established on a geographical basis. The Munich outstation intercepted traffic from Italy, which included the Italian colonies, Yugoslavia, Romania, Hungary, Austria, and Czechoslovakia. The Stuttgart outstation monitored France, including her colonies, Belgium, the Netherlands and Spain. Münster intercept outstation monitored England including colonies and Dominions. The intercept station at Königsberg intercepted Russian traffic. The Breslau intercept station monitored communications traffic from Polish, Czechoslovak and Russia. The Liegnitz had twice the personnel of the stations.\nThe personnel of each intercept station consisted of one officer, who was Chief of the station, one radio mechanic, eighteen or twenty non-commissioned officers and six or eight civilian employees used as clerks, administrators, interpreters and couriers. In 1933, five technicians were added to the personnel. Not until 1932 did the Fixed Intercept Stations (German:Feste Horchstelle) (Feste) receive their tables of organisation. Only the finest and most experienced radio operators of the signal battalions and platoons were accepted as intercept operators. The chief of an intercept station, by having the direct support of the Reichswehr Ministry, was certain always to receive the best qualified personnel.\nThe material intercepted daily was studied by the traffic analysis section, bearings obtained on the stations involved and the results incorporated into a daily traffic analysis report, which was called N.B. – Meldung. All Wireless telegraphy (W/T) intercept messages, where the keys were known was done directly at the intercept stations. The contents of the decoded messages were then evaluated. All W/T messages which could not be decoded by the intercept stations (e.g. all diplomatic messages) were sent daily to the Chi-Stelle in Berlin, where they were worked on by a larger and more specialised cryptanalytic staff of the Reichswehr. The Chi-Stelle in Berlin was divided into various sections, each headed by a section leader. The sections or desk each dealt with an individual country. In one instance, when the manoeuvrers of one of the large foreign powers were being monitored, the head of the desk dealing with the country in question was sent to the appropriate intercept station for the duration of the manoeuvres.\nThe first real military activity that the Munich intercept unit undertook was the monitoring of the Rif War that was fought between 1920 and 1926. The deployment and operational tactics of the Spanish and French were learned in details through the decoding of wireless messages, with the Weimar Republic supplied with regular intelligence reports.\nStation operations 1933–1939\nIn 1933, the OKH assumed general control of the intercept organisation and the Intercept Control Station (HLS), directed intercept coverage. A program of expansion and improvement was instituted, with the creation of three new fixed intercept stations at Striegau, Hersbruck and Chemnitz. All intercept stations were improved. By 1934, for instance, each had its own building outside city limits where it was free from electrical interference and each was equipped with the latest technical improvements. In 1935, the first mobile Signal Intelligence Companies were activated, and populated from Signals Corps recruits. Officers, NCO's and privates from the fixed intercept stations acted as instructors In selecting this new military personnel, no consideration was given to an individual's background; the only requirement was a certain degree of intelligence. Many difficulties resulted, which had repercussions through the entire German Signal Corps. This policy continued for an excessively long time, around two years, in order to bring the companies up to strength. The lack of technically trained personnel, especially amongst the officers remained one of the greatest deficiencies of the German Signals Intelligence units, right up until the end of the war.\nAt that time, the Army was intercepting all Army, diplomatic and Air Force traffic. The Army traffic was sent for analysis to the Army cryptoanalytic and evaluation agency, the Intercept Control Station (HLS) at Berlin. Diplomatic traffic was passed either to the Codes and Ciphers Office of the Reichswehr before 1935 and later the same office at the Wehrmacht, or the Pers Z S. Technical Sergeant Karl Jering of the Signals Corps of the Air Force High Command, (Order of Battle OKL/LN Abt. 350) noted during his tour of duty, that during this period, the Army intercepted and evaluated foreign Air Force traffic, but he observed time and time again that far less importance was given to the monitoring and evaluation of Air Force traffic, than it gave to ground force traffic. The Air Force was becoming increasingly dissatisfied with the Army intercept work and in 1935, began to organise its own Signals Intelligence Service. For three years however, between 1935 and 1938, the Air Force maintained close relations with the Army. Air Force employees underwent familiarization training at Army Fixed Intercept Stations and the Air Force radio intercept stations, (), (W-Stellen) were created according to the Army prototypes By 1939, the break between the Signals Intelligence Service of the Army High Command, and of the Air Force High Command was complete.\nAt this time the Supreme Command of the Armed Forces, the Oberkommando der Wehrmacht (Abbr. OKW), also created its own intercept service for diplomatic traffic. The Army gave to the OKW two of its intercept stations, Lauf and Treuenbrietzen for the interception of this traffic. From this period on, the Army intercept service confined itself exclusively to the interception of foreign Army traffic.\nIntercept operations during World War II\nIntercept station operations 1939–1944\nBefore 1939, the German General Staff has placed very little emphasis upon intercept in the field. Nearly all intercept has been carried out by Fixed Intercept Stations. With the approach of mobile warfare, however, Germany Army intercept operations also became mobile. The new emphasis on field intercept resulted in the establishment of Signal Intelligence Regiments () (KONA) whose mobile component parts were designed to work with units of the Army Group to Army Corps level). The adaption of the KONA regiments to meet the needs of the Field Army was one of the chief accomplishments of the Army signal intelligence service.\nControl of intercept coverage 1939–1944\nControl of intercept coverage during the war stemmed from the Intelligence Officers of the Eastern Armies Branch and the Western Armies Branch As Alfred Jodl stated:\n:these officers were thoroughly familiar with the general signal intelligence picture\nThe chain of command was very clear during the last year of the war. The Intelligence officers of the Eastern Armies Branch and the Western Armies Branch briefed the chief of the Understaff of General der Nachrichtenaufklärung (GdNA), who had control over all the KONA regiments and who issued to them their directives for intercept coverage. In the west, the Understaff worked through the Senior Commander of Signal Intelligence, () (Abbr. Hoeh Kdr d. NA) whose function it was to coordinate the intercept coverage of KONA 5 and KONA 6.\nWith the other KONA, the chain of command from the Understaff was direct. The Signal Intelligence Evaluation Centre (NAAS) issued the directives for intercept coverage to all units subordinate to the KONA.\nIn 1941 to 1944, previous to the establishment of the GdNA organisation, the chain of command appears to have been the following:\n* Non-Russian intercept coverage was distributed by the Western Armies Branch through the Control Station of the Signal Intelligence of the Army High Command (OKH/LNA)\n* Russian intercept was directed by the Eastern Armies Branch through the Intercept Control Station East of the Army High Command (OKH/HLS Ost)\nAssignment of intercept coverage\nAssignment of intercept operations was established on a geographical basis; either eastern, south-eastern, western, southwestern. From the beginning of the war eastern, interception was given high priority and KONA 1,2,3 were assigned to eastern coverage. In 1942, KONA 6 and in 1944 and 1945, two other KONAs, KONA 8 and KONA Nord were formed also for the interception of eastern traffic. In addition, eastern interception was carried on by three independent Stationary Intercept Companies, Feste 7, Feste 8, 11 and one Long Range Signal Intelligence Platoon, Faz Nord. After 1942, new monitoring of eastern traffic was also done by the Intercept Control Station East (HLS Ost) In contrast, southeastern, western and southwestern interception were covered by one KONA regiment apiece, with one central monitoring agency for all three areas, the Control Station for Signal Intelligence (LNA).\nEastern intercept\nThe mission of all eastern KONA regiments was the interception and evaluation of Russian Army, Air Force   and Partisan traffic. Their intercept coverage differed only in respect to the geographical origin of the traffic. KONA 1, which was during the 1939–1944, attached to Army Group South Ukraine () covered the southern part of the Russian front. It operated in the vicinity of Lemberg, Vinnytsia, Poltava, Reichshof, and Nový Jičín. KONA 2 which was attached to Army Group Centre covered traffic on the central Russian front, moved in the vicinity of Warsaw, Borisov, Orsha, Vitebsk, Smolensk, Minsk, Grodno.  KONA 3 which was attached to Army Group North, covered traffic on the northern part of the Russian front and in the Baltic states. It was variously at Riga/Dueneberg, Pskov and Courland, where in 1945 it was caught in a pocket by the Russians and captured intact. KONA 6 was formed in 1942 to cover the traffic of the Battle of the Caucasus  While in the east, the unit was located at Rostov-on-Don, Novocherkassy and Minsk. After that campaign, it was assigned to the interception of Russian Partisan traffic, and kept this as its intercept coverage until 1944, when it was withdrawn from the east and reassigned to the Western Front.\nThe four independent Stationary Intercept Companies assigned to work on the eastern front had the following assignments. Feste 11 was assigned coverage of high frequency traffic on the Red Army and the NKVD. Originally this Feste was located at Winniza, latterly at Kiev. The other two Feste 7 and 8, concentrated on special Russian traffic. Feste 7 was the Russian Baudot reception station located at Minsk. In 1942–43, it was moved to Giżycko (Loetzen) where it became part of Section 4 of the HLS Ost and continued to intercept Russian Baudot traffic. Feste 8 was the former Army intercept station at Königsberg. After 1942, this station concentrated on Russian wireless telephone traffic called by the German Russian X-traffic. Attempts were made to pick up this traffic by equipment developed by Army Ordnance, Signal Equipment Testing Laboratory () (Abbr. WA Prüf 7). The channels monitored ran east of Moscow; the traffic was mainly economic in nature. From 1942 to 1944, this traffic was successfully recorded, but after 1944 the Russian wireless traffic was encrypted, and after unsuccessful efforts to decrypt these communications, the monitoring was stopped.\nThe Faz Nord operated in Finland after 1941. The mission of this unit was the interception of Russian Army traffic. All Russian Army systems were handled by Faz Nord except five-figure traffic which was sent in encrypted format to the Intercept Control Station.\nSection 4 of the Intercept Control Station East (HLS Ost) monitored NKVD Inter-Soviet State traffic, and radio broadcasts of the Tass News Agency from Moscow.\nSoutheastern Intercept\n]]\nSoutheastern intercept was the task of KONA 4, which was the only signals regiment in the Balkans (Balkan Campaign (World War II)). For the task of intercepting traffic in this area, the component parts of the KONA were located in strategic positions. NAAS 4 was moved in the summer of 1941 to the Neo Phaliron Velodrome near Athens, where it remained there until February 1944, when it retreated to Belgrade. From Belgrade it moved back to Graz, where it had departed four years prior. Feste 5, the former Army intercept station at Graz, was moved to Epanomi in Greece. Feste 6, the former Army Fixed Intercept Station at Tulln, was stationed during this period in Athens, from which it returned to Tulln in 1944. The Close Range Signal Intelligence Platoons NAZ T was located at Kavala on the Thracian Sea. NAZ W was located in Belgrade.\nThe traffic intercepted by KONA 4 and its components parts was divided into two types:\n* Long range traffic emanating from the Middle East and Africa.\n* Traffic of the occupied Balkan countries.\nLong range traffic in the Middle East emanated from Turkey, from the British Ninth Army in Palestine and Tenth Army in Iraq, and from the French Armies in Syria\nInterception of Turkish traffic was carried on from 1941–1944 partly by the NAAS 4 at Neo Phaliron Velodrome but chiefly by the Close Range Signal Intelligence Platoon, NAZ T, stationed at Kavala in Greece, whose sole mission was the interception and decoding of Turkish traffic. Traffic from the British and French troops in Palestine and Syria was intercepted by NAAS 4 at Neon Phaleron.\nTraffic of the occupied countries was covered before 1944 mainly by NAZ W, operating from Belgrade. This platoon covered the traffic of the Croatian adversaries, the Serbian partisans and Josip Broz Tito. Feste 5 aided by covering Greek partisan traffic. Feste 6 added Hungarian traffic to its intercept coverage in 1943 by sending a plain clothes detail to Slovakia near Pressburg (now Bratislava), Hungary to monitor this traffic. When NAAS 4 was moved to Belgrade, it concentrated on the traffic of the occupied countries and covered Yugoslavian, Romanian, Bulgarian and Hungarian traffic.\nWestern intercept\nThe traffic assigned to western intercept emanated from:\n* The British Isles.\n* The United States, after the entry of the USA into the war.\n* Spain, Portugal and Brazil.\n* Miscellaneous western traffic.\nThe coverage of this traffic was the task of KONA 5 which, until November 1944, was the only Signal Intelligence Regiment in the western area.\n* Traffic from the British Isles was considered the most important of the western intercepts which were received overall. It had long been monitored intensively since 1939 by the GDNA, and by precursor organisations, when a Long Range Signal Intelligence Company, FAK 620 was sent to the Atlantic coast near Norderney Island to monitor British Army maneuver traffic. Although FAK 620 was sent at a later date to the eastern area, British traffic continued to be monitored by the following units of KONA 5 from 1939 to 1944:\n:* Long Range Signal Intelligence Company, FAK 613. This unit was stationed at Saint-Malo exclusively monitored radio traffic from the British Isles.\n:* Feste 2, a Stationary Intercept Company located until November 1943 in Husum in the Netherlands, after that stationed in Lille. This unit monitored only traffic of the British Isles.\n:* Feste 9, formed in June 1942, in Frankfurt am Main  was sent to Norway to monitor British traffic. At first the unit was stationed at Trondheim, later at Bergen, where it remained until the spring of 1944, when it moved to Ski near Oslo, Norway. The unit was tasked to intercept traffic with the point of origin being the British Army in Northern England, Scotland and the Faroe Islands.\n:* Feste 12, was attached to the Evaluation Centre of KONA 5 and located in Louveciennes. Until January 1944, this station monitored traffic exclusively from the British Isles.\n* Traffic originating in the United States and Iceland, and from American troops in the British Isles was monitored by Feste 3, located at Euskirchen and Feste 9 located at Bergen, Norway. Feste 3 concentrated on traffic from the US. After the Autumn of 1943, Feste 3 has a special intercept unit for USA non-Morse radio teletype traffic, designated by the Germans as FF5 ( From Feste 9 in Bergen, United States traffic intercepts from Iceland was monitored. This unit intercepted short wave radio traffic from London to Washington via Ireland, but without success.\n:The traffic of Spain, Portugal and the Brazilian Army in Italy was monitored from 1939 to 1942 by Feste 3 at Euskirchen. In early 1943, the Long Range Signal Intelligence company FAK 624, was formed at Montpellier in southern coast of France for the interception of this traffic. In January 1944, the Spanish, Portuguese and Brazilian message intercepts were shared with FAK 624 by Feste 19.\n:In addition to the three main commitments of the western intercept units, two other minor traffic sources were intercepted. These were Swedish Army traffic and the French Police traffic originating in Corsica. The Swedish Army traffic was intercepted by the subordinate unit of Feste 9 in Norway. This unit, known as out-station Halden, Norway () was attached for administrative purposes to the Halden Police Battalion. The French police traffic from Corsica was monitored by  FAK 624 at Montpellier.\nSouth Western Intercept\nBefore 1943, the German Army () had no signal intelligence units in Italy. In February of that year, KONA 7 was established with a task of intercepting traffic from Italy and North Africa. The intercepted traffic consisted of British, American, Polish, French and Brazilian Army traffic in Italy and North Africa. There was no specific division of tasks in the various units of KONA 7; all units intercepted all Army traffic from these countries.\nThe most southerly location of NAAS 7, the Signal Intelligence Evaluation Centre of KONA 7, was at Rocca di Papa, about 25&nbsp;km south of Rome. In September 1943, it moved into the neighbourhood of Rome, establishing itself at Vallerano. Later it moved to Vincenza in northern Italy. Feste 1, the former intercept station at Stuttgart, after sundry moves in France from 1940 to 1943 was ultimately stationed in Italy at Genzano, west of L'Aquila. Feste 9, which came to Italy from Norway in November 1944, was located in Breganze and remained there until shortly before the end of the war.\nThe Long Range Signal Intelligence Company, FAK 621, which was attached to KONA 7, had been originally designated as the Army Signal Company 3 () (abbr. H NA 56). This unit, which was very active in North Africa, was captured, in part, in July 1942. In May 1943, the entire company was captured in Tunisia. Until the time of its final capture, this unit intercepted traffic of British, French and American soldiers in North Africa and of the Egyptian Army and Camel Corps\nIntercept Service 1944–1945\nIntercept operation of OKH/GDNA\nThe years 1944–1945 saw the centralization of the German Army Signal Intelligence Service and its catastrophic dissolution in the months prior to the capitulation on 8 May 1945. As part of the movement to centralise the service, the OKH/GDNA assumed responsibility for the intercept and evaluation of the following types of traffic:\n:::{| class=\"wikitable\"\n|-\n! colspan=5 style=\"background:LightSteelBlue\"|Categories of traffic per intercept type\n|-\n! style=\"text-align: center;background:#ccc\" | Traffic type\n! style=\"text-align: center;background:#ccc\" | Operational unit and responsibilities\n|-\n| style=\"text-align: center;\" | Foreign Press\n| The intercept and evaluation of foreign press was undertaken by Section 2 of Group I, OKH/GDNA. This section was divided into four subsections:\nmonitoring of eastern wireless ().\nmonitoring of western wireless ().\nmonitoring of plaintext ().\nevaluation.\nOwing to the personal shortage during the years of 1944–1945, Section 2 was not able to cover its commitments to any  large extent. Eastern monitoring was confined for the most part to the Moscow wireless, although in the later months, a certain amount of Balkan monitoring was confined to the BBC London Service. News monitoring was confined to the Reuters and TASS Agencies\n|-\n| style=\"text-align: center;\" | Special high grade machine ciphers\n| The interception and evaluation of special high grade machine ciphers of the Soviet Union, Britain and the United States were assigned to Group VI of OKH/GDNA, which was located at Potsdam. Section 1, dealing with Russian traffic, had three subsections:\nInterception of Inter-Soviet State traffic.\nInterception of Russian Baudot traffic.\nInterception of Russian Army traffic.\nThe interception of Russian Baudot traffic (called by the Soviets, Z-traffic) was carried on by the same personnel who had manned the Russian Baudot station at Minsk in 1942–1943. In 1943, the Russian Baudot station was moved to HLS Ost at Giżycko, where it was absorbed by the OKH/GDNA, the Baudot station became Section 1b of the OKH/GDNA.\nSection 2 of Group IV was employed with the interception (2b) and the evaluation (2a) of British and American high grade machine ciphers. The interception of this traffic had been carried on by Feste 3 at Euskirchen until the establishment of the GDNA, when the responsibility was transferred to the central agency.\n|-\n| style=\"text-align: center;\" | Wireless photography\n| The interception of wireless photography, called by the Germans Y-traffic, was carried on by a special unit of Section I of Group VI. This unit intercepted traffic from all over the world but the non-Russian channels are said not to have yielded any valuable information. Photos intercepted from internal Soviet traffic, however, often contained technical diagrams and charts.\n|}\nIntercept Service in the field\nThe intercept service in the field during the last year of the war, maintained its geographical distribution: eastern, south-eastern, western, and southwestern. Paralleling the changes in the war situation, meant there was an increasing emphasis on western intercept and a corresponding decreasing emphasis on south-eastern intercept in the war situation.\nWith the pressure of the Allied invasion, of necessity, western intercept assumed a position of greater importance. KONA 6 was reassigned at this time from eastern to western intercept and the western KONA regiments, KONA 5 and 6 were subordinated to a Senior Commander of Signal Intelligence (Hoeh Kdr d NA) who was responsible for all signals operations in the west. Upon these two KONA's fell the task of intercepting the traffic of the invading Armies.\nKONA 6 monitored traffic for Army Group H and Army Group B which were stationed in the northern part of the Western Front. Army Group H was stationed in Netherlands and in Nordrhein-Westfalen. KONA 5 monitored the traffic of Army Group G, which was stationed in the southern half of the Western Front.\nOne member of the Long Range Signal Intelligence Company, stated that his unit's original mission was the interception of traffic of the 1st French Army and the USA 7th Army. Later it intercepted the USA 1st Army, 3rd Army and 9th Army.\nThe decreasing emphasis on southeastern interception was manifested by the disbandment of KONA 4. The component parts were apparently reassigned to various fronts. South-eastern intercept and evaluation was carried out by KONA 4's successor, the newly formed NAA 16.\nThe situation on the Eastern front and Southeastern Front remained, for the most part, much as it had been in the previous year. To the eastern front were assigned two new KONA's, KONA 8 and KONA Nord, and to KONA 7 in Italy and one new intercept unit, Feste 9, which moved from Norway to Italy.\nA German Army report on the intercept situation about January 1945, gives the following picture of the units and their coverage:\n:::{| class=\"wikitable\"\n|-\n! colspan=5 style=\"background:LightSteelBlue\"|Signal intelligence unit distribution\n|-\n! style=\"text-align: center;background:#ccc\" | Front\n! style=\"text-align: center;background:#ccc\" | Unit\n! style=\"text-align: center;background:#ccc\" | Coverage\n|-\n| Eastern Front\n|\n* KONA 8 for Army Group South\n* KONA 1 for Army Group Centre\n* KONA 2 for Army Group Weichsel\n* KONA Nord for Army Group Kurland\n* NAA 11 for 20th Mountain Army\n|\n* Russian front traffic\n* Radio nets of NKVD\n* Romania\n* Roving bands in Poland and Ukraine\n* Espionage units in operational areas\n|-\n| Southeastern Front\n| NAA 16 for Army Group E\n|\n* Allied troops and communications staffs in the Balkans\n* Soviet front traffic\n* Josip Broz Tito traffic\n* ELAS traffic\n* Bulgarian traffic\n* Draža Mihailović traffic\n|-\n| Western Front\n|\n* Senior Commander of Signal Intelligence\n* KONA 6 for Army Groups H and B\n* KONA 5 for Armt Groups G and Army Group Oberrhein\n|\n* English, American, French front traffic\n* British traffic from the British Isles\n* USA traffic from the United States\n* French traffic from France\n|-\n|Southwestern Front\n|KONA 7\n|\n* English, American, French front traffic\n* Allied traffic from the western Mediterranean and North Africa\n* Italian bands in Northern Italy\n|}\nDisintegration of Intercept Operations\nThe constant movement of the German Armies and their intercept units during the last months of the war prevented continuous and orderly interception of enemy traffic. A brief résumé of the KONA regiments illustrates the confusion of these last months. KONA 1 withdrew from the eastern front into Czechoslovakia and was found by the invading forces at Nový Jičín. KONA 2 retreated from the vicinity of Grodno to Ortelburg in Prussia, Gdańsk (Danzig), Pregolsky Microdistrict (Holstein) and finally to the Wismar area. KONA 3 was caught in the Courland Pocket and captured. KONA 8 withdrew first into Romania, then Croatia and finally to Lantsch/Lenz. KONA 5 in the west withdrew from Louveciennes in mid-August, 1944 and went first to Viggingen near Metz. At the beginning of September, it moved to Krofdorf-Gleiberg near Giessen, where it stayed until March. From there it moved to Rhoen and finally to Dischingen. One of its units, FAK 611 moved in the spring of 1945 from the Netherlands to Flensburg. Feste 3 moved from Euskirchen into the Black Forest.\nThe southwestern unit, KONA 7 and its subordinates, retreated to northern Italy. Concerning southeastern intercept in the last months of the war, it is known only that NAA 16 remained as the only unit in the area.\nThe constant shifting of the KONA and in the late months of the war, the disruption of internal communications between various parts of the KONAs and between the KONAs and the GdNA had a disastrous effect on the whole problem of enemy intercept.\nDuring the last months of the war, the internal intercept units of the GdNA were also disrupted. The units of Groups I and V moved with the other Groups of the GdNA to Erfurt and then to Bad Reichenhall The intercept unit of Group VI which had been covering high grade machine traffic at Potsdam was moved to Stuttgart and from there to Rosenheim The equipment was buried in the cellar in the surrounding neighbourhood of a house, the Pioneer-Kaserne in Rosengeim, where it was later found by TICOM interrogators.\nReferences"
    }
  ]
}