{
  "content": [
    {
      "type": "text",
      "text": "# German–Spanish Treaty (1899)\n\n|location_signed      =\n|date_sealed          =\n|date_effective       =\n|condition_effective  =\n|date_expiration      =\n|date_expiry          =\n|mediators            =\n|negotiators          =\n|original_signatories =\n|signatories          =\n|parties              =\n*\n*\n|ratifiers            =\n|depositor            =\n|depositories         =\n|citations            =\n|language             =\n|languages            =\n|wikisource           =\n|wikisource1          =\n|footnotes            =\n}}\nThe German–Spanish Treaty of 1899, (; ) signed by the German Empire and the Kingdom of Spain, involved Spain selling the majority of its Pacific possessions not lost in the Spanish–American War to Germany for 25 million pesetas (equivalent to 17 million Marks).\nHistory\nDuring the 19th century, the Spanish Empire lost most of its colonies to independence movements. Then came the Spanish–American War in 1898, in which Spain lost most of its remaining colonies. Cuba became independent while the United States took possession of Puerto Rico along with the Philippines and Guam from Spain's Pacific Ocean colonies, the Spanish East Indies. This left Spain with only its African possessions of Spanish Sahara, Ifni, and Spanish Guinea, and with about 6,000 tiny, sparsely populated, and not very productive Pacific islands. The latter were both ungovernable, after the loss of the administrative center of Manila, and indefensible, after the destruction of two Spanish fleets in the Spanish–American War. The Spanish government, therefore, decided to sell the remaining islands. Germany lobbied the Spanish government to facilitate the sale of the islands to them.\nThe Spanish Prime Minister Francisco Silvela signed the treaty on 12 February 1899. It transferred the Caroline Islands and the Northern Mariana Islands to Germany, which then placed them under the jurisdiction of German New Guinea. Palau, at the time considered part of the Carolines, was also occupied and during the following years the Germans started up mining there.  The United States might have retained both the Carolines and Northern Marianas, but a lack of diplomatic consistency and interest allowed Spain to retain control until the sale.\nIn October 1914, during World War I, the Empire of Japan invaded and conquered many of these German possessions. After the war, they became in 1919 the South Seas Mandate of the League of Nations, under control of the Japanese. During and after World War II the United States took control of the former Spanish and German archipelagos in the Pacific.\nResidual Spanish claims\nIt has been asserted that some islands (Kapingamarangi, Nukuoro, Mapia, Rongrik, Ulithi, and \"Matador\", probably a reef already sunken today, but it appeared on maps of the time) are still in Spanish possession since they were not transferred to the United States nor to Germany.\nThe hypothesis appeared on 5 March 1948, when the state lawyer and CSIC researcher Emilio Pastor y Santos wrote a letter claiming that Spain should establish three naval stations in the Carolinas, Marianas and Palaos, following article 3. He suggested Saipan, Yap and Koror. In October, Pastor announced that there were still four islands under Spanish sovereignty, as they were forgotten in the 1899 treaty. In 1950, Pastor published the book . On 12 January 1949, the question was dealt with in the Council of Ministers, but\n}}\nHowever, a report of 4 January 1949 from the legal advice of the Spanish Ministry of Foreign Affairs \"estimated that any hypothetical right of Spain over those islands would have been destroyed by the later trust regimes, that were those established after World War I with the transfer of those territories to Japan and, after World War II, with their attribution to the United States\".\nIn 2014, the Spanish government closed any speculation on the issue of Spanish possessions in the Pacific with an answer in the Congress to the deputy Jon Iñarritu. According to its interpretation, Spain yielded in 1899 every remaining possession in the Pacific. It added that \"those islands were traditionally linked to the Carolinas and it has to be understood that, if the latter were yielded, the former were yielded too\" and \"the Spanish attitude between 1899 and 1948 shows that the intent of Spain by signing the treaty with Germany was to transfer to it all its possessions in the Pacific.\" It would be inconsistent \"that Spain would have wanted to yield the Carolinas, the Palaos and the Marianas, but would have reserved the sovereignty over a few little islands of scarce economic value over which it had never exercised its factual sovereignty\", concluding that Spain does not preserve any sovereignty over any Pacific islands or atolls.\nCurrently Mapia is under Indonesian sovereignty, Yap, Kapingamarangi, Ulithi and Nukuoro are parts of the Federated States of Micronesia, Rongerik is controlled by the Marshall Islands, Saipan is in the North Mariana Islands controlled by the United States, and Koror is part of Palau.\nSee also\n* Carolines Question\n* Captaincy General of the Philippines\n* Spanish East Indies\n* Treaty of Washington (1900)\nReferences\nFurther reading\n*\n*\n*\n* Pastor y Santos, Emilio. Territorios de soberanía española en Oceanía. Instituto de Estudios Africanos, Consejo Superior de Investigaciones Científicas. Madrid, 1950.\nExternal links\n* [http://1898.mforos.com/1035040/5790771-venta-a-alemania-las-islas-carolinas-las-palaos-y-islas-marianas/ Text of the Treaty (in Spanish)]"
    }
  ]
}