{
  "content": [
    {
      "type": "text",
      "text": "# Germs: Biological Weapons and America's Secret War\n\n'Germs: Biological Weapons and America's Secret War'  is a 2001 book written by New York Times journalists Judith Miller, Stephen Engelberg, and William Broad. It describes how humanity has dealt with biological weapons, and the dangers of bioterrorism. It was the 2001 New York Times #1 Non-Fiction Bestseller the weeks of October 28 and November 4.\nOverview\nGerms, is a work of investigative journalism employing biographical and historical narrative to provide context. The three authors interviewed hundreds of scientists and senior U.S. officials, and reviewed recently declassified documents, and reports from the former Soviet Union's bioweapons laboratories.\nSummary\n| width  =25%\n| align  =right\n}}\nThe book opens with an account of the 1984 salmonella poisonings in The Dalles, Oregon, caused by followers of Bhagwan Shree Rajneesh who sprayed salmonella onto salad bars. Other research shows how Moscow scientists created an untraceable germ that would induce the body to self-destruct, and reveals that the U.S. military planned for germ warfare on Cuba during the 1960s. Three classified U.S. biodefense projects are detailed: Project Bacchus, Project Clear Vision, and Project Jefferson. Germs concludes with an assessment of the United States' ability to deter future bio-attack.\nReviews\nThe New York Times Book Review was favorable, though it criticized the book's tone as \"somewhat alarmist\". BusinessWeek was also generally favorable, except for pointing out some conflicting views on bioterrorism. The Guardians book review by British psychiatrist Simon Wessely, cautioned against panic, stating that biological weapons can cause destruction through fear, effectively giving the biodefense industry \"the equivalent of a blank cheque\".\nAdaptations\nOn November 13, 2001, the science TV series Nova aired an episode entitled Bioterror.  Two years in the making, it chronicled Miller, Engelberg, and Broad's research and investigation into biological weapons.\nReferences\nExternal links\n*\n* [https://www.c-span.org/video/?167010-1/germ-warfare-biological-weapons Panel discussion at the Council on Foreign Relations with Miller, Engelberg, and Broad, October 29, 2001], C-SPAN\n* [https://www.c-span.org/video/?167196-1/germs-biological-weapons-americas-secret-war Panel discussion at the 92nd Street Y with Miller, Engelberg, and Broad, November 11, 2001], C-SPAN"
    }
  ]
}