{
  "content": [
    {
      "type": "text",
      "text": "# German Army order of battle (1914)\n\nThis is the German Army order of battle on the outbreak of World War I in August 1914.\nCommanders and locations of the German Army\nThe overall commander of the Imperial German Army was Kaiser Wilhelm II. The Chief of the General Staff was Generaloberst Helmuth von Moltke the Younger, with General Hermann von Stein as Deputy Chief. The Departmental chiefs were Oberst Tappen (Operations Branch), Oberstleutnant Hentsch (Intelligence Branch), Major Nicolai (Secret Service), Oberst von Dommes (Political Section), Generalleutnant Siger (Field munitions), Major Thomsen (Air Service), Oberst Groner (Field Railways),  General von Lauter(Foot Artillery), General von Claer was General of Engineers, and General von Schjerning (Medical Services). Generalmajor von Schoeler was Intendant-General (responsible for logistical supplies).\nFile:Vonmoltke.jpg|Helmuth von Moltke the Younger\nFile:Karte Divisionsstandorte des Deutschen Heers 1914.png|Location of the German divisions 1914\nFile:Karte Brigadestandorte des Deutschen Heers 1914.png|Location of the German brigades 1914\nHomeland corps deployments (1871-1914)\nDuring times of war in Germany, all military forces came under the direct command of the German Emperor, via Article 60 of the Constitution of the German Reich (1871). From 1871 to 1918, the forces of the Emperor included those of the kingdoms of Prussia, Bavaria, Saxony and Württemberg, with all other states commanded by, or merged with his Prussian army.\nFile: Battle of Frontiers - Map.jpg|Battle of the Frontiers - 2 August to 26 August 1914.\nFile:Deutsche Korpsbereiche 1914.jpg|German corps areas 1914\nFile:Aufmarsch im Westen 1914.jpg|March in the West\nFile:Lage im Osten 1914.jpg|Situation in East\nFile:Aufmarsch 1914.jpg|March Württ. Troops 1914\nFile:7. Armee August 1914.jpg|7th German Army in August 1914\nFile:6. Armee August 1914.jpg|6th Army August 1914\nFile:5. Armee August 1914.jpg|5th Army August 1914\nFile:XIII. A.K. Longwy 1914.jpg|XIII. AK Longwy 1914\nFile:XIII. A.K. Maas 1914.jpg|XIII. AK Maas 1914\nFile:XIII. A.K. Sommaisne 1914.jpg|XIII. AK Argonne 1914\nFile:26.Kav.Brig 1914.jpg|26th Kav.Brig 1914\nFile:26. und 28. Württ. Res.-Div. 1914.jpg|26th (Württ) and 28th Württ. Res Div. End September 1914\nFile:Lw.-Regt. 122 Lothringen 1914.jpg|Lw-Regt. 122 Lorraine 1914\nFile:51. Ers.Brig. 1914.jpg|51st Ers.Brig 1914\nFile:26.Inf.Div und 26. Kav.Brig Lille 1914.jpg|26th Inf Div. and 26th Cavalry Brig. 1914\nFile:26. Inf.Div. Polen 1914.jpg|26th Inf.-Div. and FArt-Regt. 13 Poland 1914\nFile:Württ. Verbände Westfront 1914.jpg|Württ. units at Western Front in late 1914\nFile:Württ. Verbände Ostfront 1914.jpg|Württ. units at Eastern Front in late 1914\nWestern Front\nCavalry\nFour independent cavalry corps served on the Western Front. These had the following order of battle:\nI Cavalry Corps (preceding 3rd Army)\nCommander: General der Kavallerie Manfred Freiherr von Richthofen\nChief of Staff: Oberst von Raumer\n* Guards Cavalry Division (General Adolf von Storch)\n* 5th Cavalry Division (General Karl von Ilsemann)\nII Cavalry Corps (preceding 1st and 2nd Armies)\nCommander: General der Kavallerie Georg von der Marwitz\nChief of Staff: Major Hoffmann von Waldau\n* 2nd Cavalry Division (General Friedrich FH von Krane)\n* 4th Cavalry Division (General Otto von Garnier)\n* 9th Cavalry Division (General Karl Hans von Bülow)\nIII Cavalry Corps (preceding 6th Army)\nCommander: General der Kavallerie Rudolf Ritter von Frommel\nChief of Staff: Major von Meiß\n* 7th Cavalry Division (General Ernst von Heydebreck)\n* 8th Cavalry Division (General Günther Graf von der Schulenburg-Hehlen)\n* Bavarian Cavalry Division (Generalleutnant Otto von Stetten)\nIV Cavalry Corps (preceding 4th and 5th Armies)\nCommander: General der Kavallerie Gustav Freiherr von Hollen\nChief of Staff: Oberstleutnant Otto von Brandenstein\n* 3rd Cavalry Division (General Kurt von Unger)\n* 6th Cavalry Division (General Egon Graf von Schmettow)\nEach Cavalry Division consisted of 3 Brigades, each of 2 Cavalry Regiments (24 squadrons total), 3 horse artillery batteries (4 guns each) and an MG detachment (6 MGs).\nFirst Army\n1st Army had the following order of battle:\nCommander: Generaloberst Alexander von Kluck\nChief of Staff: Generalmajor Hermann von Kuhl\nOberquartiermaster: Oberst Walter von Bergmann\nHQ: Grevenbroich, Germany\nStrength: 320,000\nII Corps\nCommander: General der Infanterie Alexander von Linsingen\nChief of Staff: Oberst Hans von Hammerstein-Gesmold\n* 3rd Infantry Division (Generalleutnant Kurt Eduard von Trossel)\n* 4th Infantry Division (Generalleutnant Günther von Pannewitz)\nIII Corps\nCommander: General der Infanterie Ewald von Lochow\nChief of Staff: Oberstleutnant Hans von Seeckt\n* 5th Infantry Division (Generalleutnant Georg Wichura)\n* 6th Infantry Division (Generalmajor Richard Herhudt von Rohden)\nIV Corps\nCommander: General der Infanterie Friedrich Sixt von Armin\nChief of Staff: Generalmajor Leo von Stocken\n* 7th Infantry Division (Generalleutnant Johannes Riedel)\n* 8th Infantry Division (Generalleutnant Georg Karl August Hildebrandt)\nIX Corps\nCommander: General der Infanterie Ferdinand von Quast\nChief of Staff: Oberstleutnant Hans Sydow\n* 17th Infantry Division (Generalleutnant Arnold von Bauer)\n* 18th Infantry Division (Generalleutnant Max von Kluge)\nIII Reserve Corps\nCommander: General der Infanterie Hans von Beseler\nChief of Staff: Oberst Paul Meister\n* 5th Reserve Division (Generalleutnant Richard Voigt)\n* 6th Reserve Division (Generalleutnant Emil von Schickfus und Neudorf)\nIV Reserve Corps\nCommander: General der Artillerie Hans von Gronau\nChief of Staff: Oberstleutnant Friedrich von der Heyde\n* 7th Reserve Division (Generalleutnant Bogislav Graf von Schwerin)\n* 22nd Reserve Division (Generalleutnant Otto Riemann)\nOther Forces\n* 10th Mixed Landwehr Brigade (Werner von Lenthe)\n* 11th Mixed Landwehr Brigade (Oberst Hans von Tippelskirch)\n* 27th Mixed Landwehr Brigade (Viktor Dallmer)\n* Pionier Regiment\nSecond Army\n2nd Army had the following order of battle:\nCommander: Generaloberst Karl von Bülow\nChief of Staff: Generalleutnant Otto von Lauenstein\nOberquartiermaster: Generalmajor Erich Ludendorff\nHQ: Monschau, Germany\nStrength: 260,000\nGuards Corps\nCommander: General der Infanterie Karl von Plettenberg\nChief of Staff: Oberstleutnant Friedrich Graf von der Schulenburg\n*1st Guards Infantry Division (Generalleutnant Oskar von Hutier)\n**1st Guards Infantry Brigade (Generalmajor Friedrich Leopold von Kleist)\n**2nd Guards Infantry Brigade (Generalmajor Hans Karl Schach von Wittenau)\n**1st Guards Field Artillery Brigade (Generalmajor Friedrich von Buddenbrock)\n**Leib-Garde-Husaren-Regiment (Oberst Georg von Brandenstein)\n*2nd Guards Infantry Division (Generalleutnant Arnold von Winckler)\n**3rd Guards Infantry Brigade (Generalmajor Viktor Albrecht)\n**4th Guards Infantry Brigade (Generalmajor Friedrich von Gontard)\n**2nd Guards Field Artillery Brigade (Generalmajor Joseph Trimborn)\n**2. Garde-Ulanen-Regiment (Oberstleutnant Leopold von Maltzahn)\nVII Corps\nCommander: General der Kavallerie Karl von Einem\nChief of Staff: Oberst Hans von Wolff\n* 13th Infantry Division (Generalleutnant Kurt von dem Borne)\n* 14th Infantry Division (Generalleutnant Paul Fleck)\nX Corps\nCommander: General der Infanterie Otto von Emmich\nChief of Staff: Oberst Gustav von der Wenge Graf von Lambsdorff\n* 19th Infantry Division (Generalleutnant Max Hofmann)\n* 20th Infantry Division (Generalleutnant Alwin Schmundt)\nGuards Reserve Corps\nCommander: General der Artillerie Max von Gallwitz\nChief of Staff: Oberst Paul von Barttenwerffer\n* 3rd Guards Infantry Division (Generalleutnant Henning von Bonin)\n** 5th Guards Infantry Brigade (Generalmajor Nikolaus von Below)\n** 6th Guards Infantry Brigade (Generalmajor Friedrich von Friedeburg)\n** 3rd Guards Reserve Field Artillery Brigade (Generalmajor Hans Willibald Graf von Schweinitz und Krain Frh von Kauder)\n** Guards-Reserve-Ulanen-Regiment (Major Johan Cesar Godefroy-Faerber)\n* 1st Guards Reserve Division (Generalmajor Viktor Albrecht)\n** 1st Guards Reserve Brigade (Generalmajor Hans Frh von Langermann und Erlenkamp)\n*** Garde-Reserve-Infanterie-Regiment Nr. 1 (Oberstleutnant Max Friedrich von Schlechtendal)\n*** Garde-Reserve-Infanterie-Regiment Nr. 2 (Oberstleutnant Wigand von Cramer)\n*** Garde-Reserve-Jäger-Bataillon (Major von Gluszewski)\n** 15th Reserve Infantry Brigade (Oberst Hans von Below)\n*** Reserve-Infanterie-Regiment Nr. 64 (Oberstleutnant Rudolf von Cramer)\n*** Reserve-Infanterie-Regiment Nr. 93 (Oberst von Jena)\n** Guards Reserve Field Artillery Brigade (Generalmajor Louis Mertens)\n*** Garde-Reserve-Feldartillerie-Regiment (Oberstleutnant von Bülow)\n*** 3. Garde-Reserve-Feldartillerie-Regiment (Oberstleutnant Goling)\n** Garde-Reserve-Dragoner-Regiment (Major von Hofmann)\nVII Reserve Corps\nCommander: General der Infanterie Hans von Zwehl\nChief of Staff: Oberstleutnant Hans Hesse\n* 13th Reserve Division (Generalleutnant Alfred von Kühne)\n** 25th Reserve Infantry Brigade (Generalleutnant Andreas Wilhelm von Harbou)\n*** Reserve-Infanterie-Regiment Nr. 13 (Oberstleutnant Johann Edler und Ritter von Braun)\n*** Reserve-Infanterie-Regiment Nr. 56 (Oberstleutnant von Goetze)\n** 28th Reserve Infantry Brigade (Generalmajor Karl Johann Neuhauß)\n*** Reserve-Infanterie-Regiment Nr. 29 (Oberstleutnant Eben)\n*** Reserve-Infanterie-Regiment Nr. 37 (Oberstleutnant von Flottwell)\n*** Reserve-Jäger-Bataillon Nr. 7 (Hauptmann von der Groeben)\n** Reserve-Feldartillerie-Regiment Nr. 13 (Oberstleutenant Reinecke)\n** Reserve-Husaren-Regiment Nr. 5 (Major Hugo von Kayser)\n* 14th Reserve Division (Generalleutnant Wolfgang von Unger)\n** 28th Infantry Brigade (Oberst Hermann von Ziegesar)\n*** Niederrheinisches Füsilier-Regiment Nr. 39 (Oberst Walter von Schönberg)\n*** 8. Lothringisches Infanterie-Regiment Nr. 159 (Obserst Karl von Kraewel)\n** 27th Reserve Infantry Brigade (Generalleutnant Edwin Sunkel)\n*** Reserve-Infanterie-Regiment Nr. 16 (Oberstleutnant Siegener)\n*** Reserve-Infanterie-Regiment Nr. 53 (Oberstleutnant Bötterling)\n** Reserve-Feldartillerie-Regiment Nr. 14 (Major Wendt)\n** Reserve-Husaren-Regiment Nr. 8 (Major Heyne)\nX Reserve Corps\nCommander: General der Infanterie Günther Graf von Kirchbach\nChief of Staff: Oberst Gottfried Marquard\n* 2nd Guards Reserve Division (Generalleutnant Richard von Süßkind)\n* 19th Reserve Division (Generalleutnant Max von Bahrfeldt)\nOther Forces\n* 25th Mixed Landwehr Brigade (Georg Franz von Glasenapp)\n* 29th Mixed Landwehr Brigade (Viktor von Rosenberg-Lipinski)\n* 4 Mortar Battalions\n* 10-cm Gun Battalion\n* 2 Heavy Coastal Mortar Batteries\n* 2 Pionier Regiments\nThird Army\n3rd Army had the following order of battle:\nCommander: Generaloberst Max von Hausen\nChief of Staff: Generalmajor Ernst von Hoeppner\nOberquartiermaster: Generalmajor Max Leuthold\nCommander of Pioniere: Generalmajor Franz Adams\nHQ: Prüm, Germany\nStrength: 180,000\nXI Corps\nCommander: General der Infanterie Otto von Plüskow\nChief of Staff: Oberst Traugott von Sauberzweig\n* 22nd Infantry Division (Generalmajor Karl Dieffenbach)\n** 43rd Infantry Brigade (Generalmajor Walter von Hülsen)\n** 44th Infantry Brigade (Generalmajor Theodor Nordbeck)\n** 22nd Field Artillery Brigade (Generalmajor Karl Max Gronau)\n* 38th Infantry Division (Generalleutnant Ernst Wagner)\n** 76th Infantry Brigade (Generalmajor Fritz von Versen)\n** 83rd Infantry Brigade (Generalmajor Thilo von Hanstein)\n** 38 Field Artillery Brigade (Generalmajor Otto Krahmer)\n** 6th (Brandenburg) Cuirassiers \"Emperor Nicholas I of Russia\" (Oberst Alexander von Poten)\nXII (1st Royal Saxon) Corps\nCommander: General der Infanterie Karl d'Elsa\nChief of Staff: Oberstleutnant Hans von Eulitz\n* 23rd Infantry Division (Generalleutnant Karl von Lindeman)\n* 32nd Infantry Division (Generalleutnant Horst Edler von der Planitz)\nXIX (2nd Royal Saxon) Corps\nCommander: General der Kavallerie Maximilian von Laffert\nChief of Staff: Oberstleutnant Georg Frotscher\n* 24th Infantry Division\n* 40th Infantry Division\nXII (Royal Saxon) Reserve Corps\nCommander: General der Artillerie Hans von Kirchbach\nChief of Staff: Oberstleutnant Konrad von Koppenfels\n* 23rd Reserve Division\n* 24th Reserve Division\nOther Forces\n* 47th Mixed Landwehr Brigade (Generalleutnant ch.  Carlotto Graf Vitzthum von Eckstaedt)\n* Mortar Battalion\n* Pionier Regiment\nFourth Army\n4th Army had the following order of battle:\nCommander: Generaloberst Albrecht, Duke of Württemberg\nChief of Staff: Generalleutnant Walther von Lüttwitz\nOberquartiermaster: Oberst Georg Weidner\nHQ: Trier, Germany\nStrength: 180,000\nVI Corps\nCommander: General der Infanterie Kurt von Pritzelwitz\nChief of Staff: Oberstleutnant Friedrich von Derschau\n* 11th Infantry Division  (Generalleutnant Richard von Webern)\n* 12th Infantry Division (Generalleutnant Martin Chales de Beaulieu)\nVIII Corps\nCommander: Generalleutnant Erich Tülff von Tschepe und Weidenbach\nChief of Staff: Oberst August von Cramon\n* 15th Infantry Division (Generalleutnant Julius Riemann)\n* 16th Infantry Division (Generalleutnant Georg Fuchs)\nXVIII Corps\nCommander: General der Infanterie Dedo von Schenck\nChief of Staff: Oberstleutnant Leberecht von Blücher\n* 21st Infantry Division (Generalmajor Ernst von Oven)\n* 25th Infantry Division (Generalmajor Viktor Kühne)\nVIII Reserve Corps\nCommander: General der Infanterie Wilhelm Freiherr von Egloffstein\nChief of Staff: Oberst Carl Julius Georg Buchholtz\n* 15th Reserve Division (Generalleutnant Eberhard von Kurowski)\n* 16th Reserve Division (Generalleutnant Wilhelm Mootz)\nXVIII Reserve Corps\nCommander: Generalleutnant Kuno von Steuben\nChief of Staff: Oberst Fritz von Studnitz\n* 21st Reserve Division (Generalleutnant Hermann von Rampacher)\n* 25th Reserve Division (Generalleutnant Alexander Torgany)\nOther Forces\n* 49th Mixed Landwehr Brigade (Hans von Blumenthal)\n* 2 Mortar Battalions\n* Pionier Regiment\nFifth Army\n5th Army had following Order of Battle:\nCommander: Generalmajor Wilhelm, Crown Prince of Germany\nChief of Staff: Generalleutnant Konstantin Schmidt von Knobelsdorf\nOberquartiermaster: Generalmajor Rogalla von Bieberstein\nHQ: Saarbrücken, Germany\nStrength: 200,000\nV Corps\nCommander: General der Infanterie Hermann von Strantz\nChief of Staff: Oberstleutnant Hans von Kessel\n* 9th Infantry Division (Generalleutnant Eduard von Below)\n* 10th Infantry Division (Generalleutnant Robert Kosch)\nXIII (Royal Württemberg) Corps\nCommander: General der Infanterie Max von Fabeck\nChief of Staff: Oberstleutnant Friedrich Karl von Loßberg\n* 26th Infantry Division (Generalleutnant Wilhelm Karl, Duke of Urach)\n* 27th Infantry Division (Generalleutnant Franz Graf von Pfeil und Klein-Ellguth)\nXVI Corps\nCommander: General der Infanterie Bruno von Mudra\nChief of Staff: Oberst Rudolf von Borries\n* 33rd Infantry Division (Generalleutnant Franz von Reitzenstein)\n* 34th Infantry Division (Generalleutnant Walter von Heinemann)\nV Reserve Corps\nCommander: General der Infanterie Erich von Gündell\nChief of Staff: Oberstleutnant Ernst von Stockhausen\n* 9th Reserve Division (Generalleutnant Hans von Guretzky-Cornitz)\n* 10th Reserve Division (Generalleutnant Hermann von Wartenberg)\nVI Reserve Corps\nCommander: General der Infanterie Konrad von Goßler\nChief of Staff: Oberst Richard von Rath\n* 11th Reserve Division (Generalmajor Karl Suren)\n* 12th Reserve Division (Generalleutnant Hinko von Lüttwitz)\nOther Forces\n* Senior Landwehr Commander 2 (2nd Landwehr Division) (Generalleutnant Adolf Franke)\n** 43rd Mixed Landwehr Brigade (Generalleutnant Friedrich Wilhelm von der Lippe)\n** 45th Mixed Landwehr Brigade (Generalmajor Ludolf von Bosse)\n** 53rd Mixed Landwehr Brigade (Generalmajor Hermann von Oßwald)\n** 9th Bavarian Mixed Landwehr Brigade (Generalmajor Bernhard Kießling)\n** 13th Mixed Landwehr Brigade (Generalmajor Georg Saenger)\n* 4 Mortar Battalions\n* 2 Pionier Regiments\nSixth Army\n6th Army had the following Order of Battle:\nCommander: Generaloberst Rupprecht, Crown Prince of Bavaria\nChief of Staff: Generalmajor Konrad Krafft von Dellmensingen\nOberquartiermaster: Generalmajor Bernhard von Hartz\nHQ: Saint-Avold, France\nStrength: 220,000\nXXI Corps\nCommander: General der Infanterie Fritz von Below\n* 31st Infantry Division\n*42nd Infantry Division\nI Bavarian Corps\nCommander: General der Infanterie Oskar Ritter und Edler v. Xylander\n* 1st Bavarian Infantry Division\n* 2nd Bavarian Infantry Division\nII Bavarian Corps\nCommander: General der Infanterie Karl Ritter von Martini\n* 3rd Bavarian Infantry Division\n* 4th Bavarian Infantry Division\nIII Bavarian Corps\nCommander: General der Kavallerie Ludwig Freiherr von Gebsattel\n* 5th Bavarian Infantry Division\n* 6th Bavarian Infantry Division\nI Bavarian Reserve Corps\nCommander: General der Infanterie Karl Ritter von Fasbender\n* 1st Bavarian Reserve Division\n* 5th Bavarian Reserve Division\nOther Forces\n* Guards Ersatz Division\n* 4th Ersatz Division\n* 8th Ersatz Division\n* 10th Ersatz Division\n* 5th Bavarian Mixed Landwehr Brigade\n* 3 Mortar Battalions\n* Heavy Coastal Mortar Battery\n* Heavy Coastal Gun Battery\n* 2 Pionier Regiments\nSeventh Army\n7th Army had the following Order of Battle:\nCommander: Generaloberst Josias von Heeringen\nChief of Staff: Generalleutnant Karl von Hänisch\nOberquartiermeister: Generalmajor Ernst von Zieten\nXIV Corps\nCommander: General der Infanterie Ernst Freiherr von Hoiningen gen. Huene\nChief of Staff: Oberstleutnant Gottfried von Brauchitsch\n* 28th Infantry Division\n* 29th Infantry Division\nXV Corps\nCommander: General der Infanterie Berthold von Deimling\nChief of Staff: Oberst Wilhelm Wild\n* 30th Infantry Division\n* 39th Infantry Division\nXIV Reserve Corps\nCommander: General der Artillerie Richard von Schubert\nChief of Staff: Oberstleutnant Bernhard Bronsart von Schellendorff\n* 26th Reserve Division\n* 28th Reserve Division\nOther Forces\n* 19th Ersatz Division\n* Bavarian Ersatz Division\n* 60th Mixed Landwehr Brigade\n* Upper Rhine Fortifications\n** 55th Mixed Landwehr Brigade\n** 110th Reinforced Landwehr Infantry Regiment\n** 1st Bavarian Mixed Landwehr Brigade\n** 2nd Bavarian Mixed Landwehr Brigade\nEastern Front\nEighth Army\n8th Army had the following order of battle:\nCommander: Generaloberst Maximilian von Prittwitz.\nChief of Staff: Generalmajor Georg von Waldersee\nOberquartiermaster: Generalmajor Paul Grünert\nHQ: Marienburg, Germany\nStrength: 225,000\nI Corps\nCommander: Generalleutnant Hermann von François\n* 1st Infantry Division\n* 2nd Infantry Division\nXVII Corps\nCommander: General der Kavallerie August von Mackensen\n* 35th Infantry Division\n* 36th Infantry Division\nXX Corps\nCommander: General der Infanterie Friedrich von Scholtz\n* 37th Infantry Division\n* 41st Infantry Division\nI Reserve Corps\nCommander: Generalleutnant Otto von Below\n* 1st Reserve Division\n* 36th Reserve Division\nLandwehr Corps\nCommander: General der Infanterie Remus von Woyrsch\n* Senior Landwehr Commander 3 (3rd Landwehr Division)\n** 17th Landwehr Infantry Brigade\n** 18th Landwehr Infantry Brigade\n* Senior Landwehr Commander 4 (4th Landwehr Division)\n** 22nd Landwehr Infantry Brigade\n** 23rd Landwehr Infantry Brigade\n* 2nd Mixed Landwehr Brigade\n* 6th Mixed Landwehr Brigade\n* 70th Mixed Landwehr Brigade\nOther Forces\n*3rd Reserve Division\n* 1st Cavalry Division\nArmy of the North\nIX Reserve Corps is also known as the Army of the North was held back in Schleswig in case of British landings; moved up in late August as part of 1st Army.\nThe North Army had following order of battle:\nCommander: General der Infanterie Max von Boehn\nChief of Staff: Oberst Paulus von Stolzmann\n* 17th Reserve Division (Generalleutnant Gustav Wagener)\n* 18th Reserve Division (General der Infanterie Karl Wilhelm von Gronen)\n* Senior Landwehr Commander 1 (1st Landwehr Division)\n** 33rd Mixed Landwehr Brigade\n** 34th Mixed Landwehr Brigade\n** 37th Mixed Landwehr Brigade\n** 38th Mixed Landwehr Brigade\n* North Sea Islands\nCentral Reserves and Border Fortresses\n* Strassburg\n** 30th Reserve Division\n*** 60th Reserve Infantry Brigade\n*** 3rd Bavarian Reserve Infantry Brigade\n*** 10th Bavarian Reserve Infantry Brigade\n* Metz\n** 33rd Reserve Division\n*** 8th Bavarian Infantry Brigade\n*** 66th Reserve Infantry Brigade\n*** Reserve Infantry Regiment Metz\n* Thorn\n** 35th Reserve Division\n*** 5th Landwehr Infantry Brigade\n*** 20th Landwehr Infantry Brigade\n* Königsberg\n** 9th Landwehr Infantry Brigade\n** Ersatz Infantry Brigade Königsberg\n* Posen\n** 19th Landwehr Infantry Brigade\n* Graudenz\n** Provisional 69th Infantry Brigade\nSee also\n* German Army order of battle, Western Front (1918)\n* Belgian Army order of battle (1914)\n* French Army order of battle (1914)\nNotes\nSources\n*\n*\n*\n*\n* Appendix 1: The Field Army, 17 August 1914. In: Imperial German Army 1914-18: Organisation, Structure, Orders-of-Battle, by Hermann Cron. Helion & Co., 2002."
    }
  ]
}