{
  "content": [
    {
      "type": "text",
      "text": "# German Jewish military personnel of World War II\n\nUp to 150,000 men deemed to be of Jewish ancestry (60,000 \"half-Jews\" and 90,000 \"quarter-Jews\") served in the Wehrmacht during World War II despite the openly and aggressively anti-semitic policies of Nazi Germany. The policy of the Wehrmacht towards \"Mischlinge\" personnel throughout the war was \"erratic, ambivalent, and contradictory\". Among the Wehrmacht personnel of World War II of Jewish ancestry were Generalfeldmarschalls, admirals, and generals. Around 20 soldiers of Jewish ancestry received the Knight's Cross of the Iron Cross.\nHistory\nNazi Germany policies on Jewish soldiers\nJewish Wehrmacht soldiers taking the Hitler Oath.|thumb\nAn estimated 100,000 Jews fought for the German Empire during World War I. In 1919, the Imperial German Army was replaced by the Reichswehr. The Reichswehr purged \"full-blooded\" Jews from its ranks in 1934; an estimated 70 personnel were dismissed. In April 1935, upon the replacement of the Reichswehr with the Wehrmacht, there was debate between those who favoured \"Mischlinge\" being conscripted for military service (such as Reichsminister of War Werner von Blomberg) and those who opposed this (such as Reichsleiter Martin Bormann). On 21 May 1935, the Wehrmacht issued a decree (Wehrgesetz) which declared that only \"Aryans\" could serve in the military and banned Jewish officers from the Wehrmacht. Jews were envisaged as an auxiliary labour force during wartime and assigned to the Sturmabteilung Reserve II.\nUnder the 26 June 1936 Law for the Alteration of Military Service Law, \"half-Jews\" (German citizens with a Jewish parent) and \"quarter-Jews\" (German citizens with a Jewish grandparent) were entitled to, and required to, serve in the Wehrmacht. \"Half-Jews\", however, were prohibited from being promoted to non-commissioned officers. In late-1935, Bernhard Lösener of the Reich Ministry of the Interior estimated that there were 45,000 \"half-Jews\" of military age in Germany. Steven R. Welch argues that \"the existence of this relatively substantial pool of potential soldiers may well have been one of the factors motivating the Nazi leadership to create a special category for half-Jews, thus preserving them for future use as soldiers.\"\nAn exception to these relaxations was the Schutzstaffel, which required all officers to prove \"racial purity\" back to 1750. In 1935, Emil Maurice - an early member of the National Socialist German Workers' Party and a founding member of the Schutzstaffel - was found to have one-eighth Jewish ancestry. Reichsführer-SS Heinrich Himmler recommended that Maurice and his relatives be expelled on the basis that they were a security risk, but was overruled by Führer Adolf Hitler, who wrote to Himmler on 31 August 1935 compelling him to make an exception for Maurice and his brothers and informally declare them \"Honorary Aryans\". Similarly, the police forces of Nazi Germany sought to reduce the number of \"half-Jews\" and \"quarter-Jews\" serving in their ranks.\nBeginning of World War II\nUpon the outbreak of World War II in September 1939, thousands of \"half-Jews\" and \"quarter-Jews\" were conscripted for service in the Wehrmacht. They were not permitted to hold positions of authority, but were eligible for awards. The Ministry of the Interior drafted an edict stating that \"half-Jews\" and \"quarter-Jews\"  who served as frontline soldiers would be deemed equivalent to persons of \"German blood\", other than still facing marriage restrictions, but it was not approved by Hitler.\nSoldiers of Jewish descent took part in the German invasion of Poland. During the invasion, Rabbi Yosef Yitzchak Schneersohn, the sixth Lubavitcher Rebbe, found himself trapped in Warsaw. Following a lobbying campaign by the Washington, D.C.-based attorney Max Rhoade, the German diplomat Helmut Wohlthat agreed to arrange for Schneersohn to be evacuated from Poland in an attempt to maintain good relations with the United States. Wohlthat approached Admiral Wilhelm Canaris, who instructed Major Ernst Bloch to rescue Schneersohn. Bloch, a veteran of World War I, was the son of a Jewish father who had converted to Christianity and an Aryan mother who was described as an \"assimilated half-Jew\". In November 1939, Bloch located Schneersohn and dispatched him and his family on a train to Berlin under the pretence of being prisoners. Schneersohn in turn travelled to Latvia and then on to safety in the United States. In 1944, Bloch (by then holding the rank of Oberst) was forced out of the Abwehr following the 20 July plot, dying the next year in the Battle of Berlin.\nSecret directive of 8 April 1940\non 8 April 1940 ordering the dismissal of \"half-Jews\" from the Wehrmacht.]]\nOn 28 March 1940, Werner Blankenburg of the Kanzlei des Führers der NSDAP'' (KdF) wrote to Major Gerhard Engel, Hitler's army adjutant, noting the problems for morale caused by the treatment of \"half-Jews\" and \"quarter-Jews\" while on leave, and the consequent risks associated with their having accessing to military secrets, proposing the exclusion of \"half-Jews\" from the Wehrmacht. On 8 April 1940, Hitler issued a secret directive to the Wehrmacht instructing it to immediately purge all \"half-Jews\" and soldiers married to \"half-Jews\" other than in special cases. \"Half-Jews\" could be granted various dispensations enabling them simply to remain in the Wehrmacht; to remain and be promoted; or to remain, be promoted, and be entitled to declare themselves \"of German blood\". \"Quarter-Jews\" and soldiers married to \"quarter-Jews\" were permitted to remain but were prohibited from serving as non-commissioned officers. Some personnel duly turned themselves in; on one occasion, a commanding officer summarily executed a Jewish soldier, \"infuriated at having his ranks sullied\". Some commanding officers ignored the directive. Enforcement varied across the Wehrmarcht; the decree was entirely ignored in the Afrika Korps, while implementation was postponed in the Kriegsmarine. Some personnel of Jewish descent falsified papers and concealed their circumcisions. In September 1940, the Oberkommando des Heeres (OKH) stated that \"again and again cases have come to the attention of the OKH in which Jewish Mischlinge of the first degree (50%) or soldiers married to such Jewish Mischlinge are still in active military service in violation of the [8 April 1940] order\" and insisted that all active personnel sign a declaration relating to their racial status. It is estimated that tens of thousands of personnel of Jewish descent remained in the Wehrmacht following the directive.\nSome personnel of Jewish descent who served in the Wehrmacht were unaware of their ancestry and did not consider themselves Jewish. Others concealed their Jewish descent in order to join the Wehrmacht for reasons such as avoiding starvation; service in the Wehrmacht was described as \"the safest place for a Jew in Hitler's Germany\". Some personnel of Jewish descent viewed serving in the Wehrmacht as a means of protecting their families. Some were passionately German and sought to prove their identity and patriotism via military service, and hoped that frontline service would entitle them to be reclassified as \"full Germans\". Jakob Benecke states, \"The security the service, and especially exemplary dedication in the Wehrmacht [...] offered to \"Mischlinge\" could range from protection from anti-Semitic discrimination through the [Nazi] state to the sheer securing of survival [...] In addition, such commitment for the \"national community\" could have relieving or lifesaving effects on close relatives of \"Mischlinge\".\"\nto the \"Mischlinge\" soldier Rüdiger von B- authorising him to remain in the Wehrmacht and receive promotion, dated 29 November 1940.]]\nSome \"well-placed\" persons of mixed \"Aryan\" and \"non-Aryan\" descent, such as Generalfeldmarschall Erhard Milch and General der Flieger Helmuth Wilberg, were granted German Blood Certificates. Referring to Milch, Chief of the Luftwaffe High Command Hermann Göring reportedly stated, \"I decide who is a Jew in the Luftwaffe\". In July 1941, Hitler introduced a policy that allowed \"half-Jew\" Wehrmacht veterans dismissed as a result of the 8 April 1940 directive to apply to re-join the Wehrmacht if they had previously won an Iron Cross or campaign citation, subject to Hitler's personal approval.\nIn September 1942, the OKH again called for the dismissal of all \"half-Jews\" remaining in the Wehrmacht. In the same month, 118 \"Mischlinge\" soldiers and their wives were declared German, while 258 \"Mischlinge\" soldiers were declared eligible to become officers.\nLatter years of World War II\nAs the war progressed, growing personnel shortages \"allow[ed] some Mischlinge to occupy positions befitting their expertise\". Conversely, however, measures targeting personnel of Jewish descent escalated as the war continued. In 1943, in the wake of the German defeat in the Battle of Stalingrad, the OKH began developing proposals for \"military use of Jewish Mischlinge until then excluded from military service and of citizens related by marriage to Jews\". The KdF responded that this utilisation should be restricted to \"Mischlinge\" serving in construction labour battalions deployed in \"especially unhealthy swamps\". In June 1943, Hitler instructed Joseph Goebbels to prepare proposals for forced labour by \"Mischlinge\". In July 1943, it was proposed that the \"Mischlinge\" in question would be inducted into the Wehrmacht and utilised as labour battalions for clearing bomb damage. In August 1943, the proposals were blocked by Wilhelm Keitel, the head of the OKH, who felt that Goebbels had bypassed him.\nBy 1944, knowledge of the Holocaust amongst Jews was widespread. As Germany's fortunes in the war continued to decline and the treatment of \"Mischlinge\" became more severe, \"some Jews began to flee their battalions\". Some \"Mischlinge\" continued to serve in the Wehrmacht while members of their families were being deported, while some participated in the Holocaust. In 1944, Hitler signed declarations for 77 high-ranking Wehrmacht officers who were \"of mixed Jewish race or married to a Jew\", asserting that they were of German blood. The 77 officers were discharged from the Wehrmacht later that year following the 20 July plot. In November 1944, the OKH ordered that any \"half-Jews\" still in the Wehrmacht were to be expelled and arrangements made for their arrest by the Gestapo.\nIn January 1945, the Orthodox yeshiva student Simon Gossel, who had spent two years in Auschwitz concentration camp, was transported by boxcar back to Germany. During the journey, the train was stopped and the guards, seeking \"every man they could for the war effort\", instructed \"German\" prisoners to get out. Despite being circumcised and having an Auschwitz tattoo, Gossel was able to masquerade as an \"ethnic German\", and went on to serve in the Wehrmacht, enabling him to survive the remainder of the war.\nJews in non-combat roles\nBeyond personnel of Jewish descent serving in the Wehrmacht, Jewish slave labour was utilised extensively to support the German war effort, with captive Jews forced to perform tasks such as digging anti-tank ditches, repairing vehicles, demining, digging underground tunnels, and manufacturing equipment such as uniforms, artillery shells, and V-2 rockets.\nIn May 1942, a disagreement arose between the Wehrmacht and the Schutzstaffel when plans by the Wehrmacht to utilise 100,000 skilled Jewish workers to take up armament industry roles in the Generalgouvernement to replace Polish and Ukrainian workers (who had been sent to Germany as slave labourers) were compromised by the Schutzstaffel deporting Jewish workers with little warning. In July 1942, an agreement was reached between the Wehrmacht and the Schutzstaffel that armament industries would be given access to a \"fixed and limited\" number of Jewish workers, with the Schutzstaffel to notify the Wehrmacht in advance of further deportations.\nIn September 1942, Field Marshal Wilhelm Keitel of the Oberkommando der Wehrmacht (OKW) ordered that all Jews engaged in armament production in the Generalgouvernement were to be replaced by Poles; in response, General Curt Ludwig von Gienanth (the commander of the Wehrmacht in the Generalgouvernement) argued that the removal of Jews was resulting in a \"a decline in the military potential of the Reich\". In October 1942, General Siegfried Haenicke (who had been appointed to replace von Gienanth) was ordered by the OKW to remove Jews from armaments factories in the Generalgouvernement and replace them with \"Aryan forces\". This order \"signified that Wehrmacht intervention in Jewish affairs had come to an end and responsibility for the entire matter—including workers in the Wehrmacht enterprises themselves—had been turned over to the [Schutzstaffel]\".\nBeginning in autumn 1944, between 10,000 and 20,000 \"half-Jews\" and persons related to Jews by \"mixed marriage\" were recruited into special units of the Organisation Todt, a civil and military-based engineering programme that utilised forced labour to deliver large-scaled constructional projects throughout Germany and German-occupied Europe.\nPost-World War II\nFollowing the end of the war, some veterans of Jewish descent were ostracised by other Jews. The topic of Wehrmacht soldiers of partial Jewish descent was considered a \"somewhat taboo\" subject by many academics.\nMedia\nIn 2002, the historian Bryan Mark Rigg published ''Hitler's Jewish Soldiers: The Untold Story of Nazi Racial Laws and Men of Jewish Descent in the German Military.\nA documentary by Larry Price about soldiers of Jewish ancestry under Nazi Germany, Hitler's Jewish Soldiers, premiered on 24 April 2006 on Channel 1. The documentary featured interviews with five soldiers of Jewish ancestry who served in the German military during World War II.\nNotable cases\nNotable German Jewish military personnel of World War II, sorted by surname in alphabetical order:\n{| class=\"wikitable\"\n|- align=\"center\"\n| width=\"180\"| Name\n| Born\n| Died\n| Branch\n| Rank\n| Service\n| Notes\n|-\n|Paul Ernst Fackenheim || 1892 ||  || Abwehr  ||   ||  1941–1945  ||\n|-\n| Werner Goldberg || 1919 || 2004 || Heer || Schütze || 1938–1940 || His photograph appeared in the Berliner Tageblatt as \"The Ideal German Soldier\", and was used in Wehrmacht recruitment posters and propaganda. Expelled from the Army following the 8 April 1940 directive.\n|-\n|Ivar Lissner  || 1909  || 1967  || Abwehr  ||  || 1938–1945  ||\n|-\n|Günther Freiherr von Maltzahn || 1910 || 1953 ||  Luftwaffe || Oberst || 1931–1945 ||\n|-\n| Emil Maurice || 1897 || 1972 || Schutzstaffel/Luftwaffe || Oberführer || 1919–1945 || Declared an Honorary Aryan.\n|-\n| Erhard Milch || 1892 || 1972 || Luftwaffe || Generalfeldmarschall || 1933–1945 || Granted a German Blood Certificate.\n|-\n|Solomon Perel  || 1925 || 2023  || Wehrmacht  ||  || 1944–1945\n|-\n| Bernhard Rogge || 1899 || 1982 || Kriegsmarine || Vizeadmiral || 1915–1945 ||\n|-\n|Oskar Romm || 1919 || 1993 || Luftwaffe || Oberleutnant || 1939–1945 ||\n|-\n|Helmut Schmidt || 1918 || 2015 || Luftwaffe || Oberleutnant || 1937–1945 ||\n|-\n|Boris Shteifon  || 1881  || 1945  || Russian Protective Corps  ||   || 1941–1944  ||\n|-\n|Siegfried Simsch  || 1913  || 1944  || Luftwaffe  || Hauptmann  || 1940–1944  ||\n|-\n|Melitta Schenk Gräfin von Stauffenberg || 1903 || 1945 || Luftwaffe || Flugkapitän (honorary) || 1939–1945 ||\n|-\n|Alexander Wienerberger || 1891 || 1955 || Russian Liberation Army  ||   ||  1944–1945  ||\n|-\n| Helmuth Wilberg || 1880 || 1941 || Luftwaffe || General der Flieger || 1899–1941 || Reclassified as Aryan by Hermann Göring.\n}}\nExternal links\n* [https://books.google.co.uk/books/about/Hitler_s_Jewish_Soldiers.html Hitler's Jewish Soldiers: The Untold Story of Nazi Racial Laws and Men of Jewish Descent in the German Military'']"
    }
  ]
}