{
  "content": [
    {
      "type": "text",
      "text": "# German Prisoner of War Camp, Hoopeston, Illinois\n\nThe Prisoner-of-war camp in Hoopeston, Illinois, was one of 21 such camps in Illinois created to house German prisoners of war in the United States during World War II.\nIndustry\nDuring the war, Hoopeston had a thriving canning and agriculture business and as such, its industrial base depended on seasonal help, particularly during harvest and canning seasons.  Prior to the war, the city relied on locals and youth labor, but after war was declared, many of those people joined the military, forcing industry to look elsewhere for workers.\nThe War Manpower Commission offered a solution: German prisoners of war in the United States were requisitioned by private businesses and the canning industry to alleviate the labor shortages. In March 1944, a group of 50 representatives met with the War Manpower Commission at Hubbard Trail Country Club near Rossville to discuss the \"conditions under which war prisoner labor may be used.\"\nHousing\nHoopeston received its first complement of 75 prisoners on April 26, 1944. The men were housed in the Illinois Canning Company farm area (now the location of M&N Pallet). By July, more than 1,250 POWs were housed in Hoopeston. Housing for the Germans was in the storage area and mule barns at first until new buildings were moved in.  A large barn on the back of the lot was converted into a tailor shop, laundry area, and general store for the prisoners to buy necessities.\nEmployment\nThe men were put to work by the Illinois Canning Company, Stokely Van Camp, Chanute Air Force Base, and by area farmers around Hoopeston, Rossville, Milford and other areas in Vermilion County.\nGerman prisoners of war were used in the Hoopeston labor force for two years, from April to November 1944 and 1945.\nEscapes\nShortly after the Germans arrived, three prisoners escaped from the camp.  Their plan was to make their way to South America via Florida in an attempt to return to Germany. On June 7, 1944, according to a Hoopeston Chronicle article, \"The men were first missed at the evening check-up at 6:30 o'clock last evening, but FBI agents said it had not been determined just when the men actually made their escape...\"\nRudi Scholz, one of the escapees, later stated that he, Julius Janisch and Herman Kuzel escaped by crawling under the back fence of the camp.\nIn an August 1993 Chronicle article by Mark Swincher, Kurt G. Pechman, a former prisoner who visited Hoopeston at that time, talked about the escape. \"The prisoners were counted in rows five deep, and men had to stand shoulder-to-shoulder.  There were three men missing,\" said Pechman.  \"After the first row was counted, the man in the back would stoop down and sneak over to the open spot.  It worked every time, and, with that method, it took three days before the guards realized the men were missing.\" During the escape, it was discovered that a local resident's car had been stolen, along with a variety of vegetables from his garden.\nTwo of the escapees, Rudi Scholz and Julius Janisch, were captured on June 11, at Carlisle, Indiana, about 100 miles southeast of Hoopeston, while Herman Kuzel remained at large until June 13.  He was captured near Brazil, Indiana.\nOther employees\nGerman prisoners were not the only workers used during harvest in 1944 and 1945.  According to a June 1944 Chronicle article, Mike Fish, personnel manager of the Hoopeston Canning Company said that the Illinois Canners Association also went through the War Manpower Commission to bring twenty Barbadians from Bridgetown, Barbados to work in asparagus and corn pack as well.\nIn 1945, the Illinois Canning Company brought in 80 Jamaicans that were housed in the company's bunk house where the Barbadians were housed the previous year.  The German prisoners were again in the portable barracks near the back of the camp.\nPrisoners in other states\nApproximately 359,100 German prisoners were housed across the United States. Only four states, Montana, Nevada, North Carolina, and Vermont, did not house any prisoners of war, according to records in Washington, D.C., and the U.S. Department of the Army. Japanese prisoners of war camps were located in Wisconsin and Iowa while Italian prisoners were kept in Utah, Texas, Nebraska, Missouri, Kansas, Iowa, Colorado, and California. One escaped German prisoner of war was never captured.  Georg Gärtner turned himself on September 11, 1985.  He was the last of 2,000 escaped prisoners to be recaptured.\nThree base camps, Camp Ellis near Peoria, Camp Grant south of Rockford, and Fort Sheridan, supplied the manpower to temporary camps in Hoopeston, Milford, Arlington Heights, Des Plaines, Eureka, Gardiner General Hospital, Gibson City, Hampshire, Joliet, Lanark, Mayo General Hospital, Pomona, Pine Plaines, Skokie Valley, Sycamore, Thorton, and Washington.\nReferences\n*Department of the Army, United States Army Judiciary, Nassif Building, Falls Church, Virginia 22041-5013"
    }
  ]
}