{
  "content": [
    {
      "type": "text",
      "text": "# German Film Award 2015\n\nThe 65th German Film Award took place on 19 June 2015, organised by the Deutsche Filmakademie. The award ceremony was held at the Palais am Funkturm in Berlin and broadcast by the ZDF. Jan Josef Liefers hosted the event.\nWinners and nominees\nBest Fiction Feature Film\n{|\n|Film Prize in Gold: Victoria – Produced by: Sebastian Schipper and Jan Dressler, directed by: Sebastian Schipper\n|-\n|Film Prize in Silver: Jack – Produced by: Jan Krüger and René Römert, directed by: Edward Berger\n|-\n|Film Prize in Bronze: Age of Cannibals – Produced by: Milena Maitz, directed by: Johannes Naber\n|}\n:Labyrinth of Lies – Produced by: Uli Putz, Sabine Lamby and Jakob Claussen, directed by: Giulio Ricciarelli\n:Who Am I – No System Is Safe – Produced by: Max Wiedemann and Quirin Berg, directed by: Baran bo Odar\n:We Are Young. We Are Strong. – Produced by: Jochen Laube and Leif Alexis, directed by: Burhan Qurbani\nBest Documentary Feature Film\nCitizenfour – Produced by: Dirk Wilutzky, Laura Poitras and Mathilde Bonnefoy, directed by: Laura Poitras\n:Beyond Punishment – Produced and directed by: Hubertus Siegert\n:Nowitzki. The Perfect Shot – Produced by: Leopold Hoesch, directed by: Sebastian Dehnhardt\nBest Children's Feature Film\n' – Produced by: Philipp Budweg and Robert Marciniak, directed by:\n:' – Produced and directed by: Veit Helmer\nBest Screenplay\n'Stefan Weigl – Age of Cannibals'\n:Elisabeth Bartel and Giulio Ricciarelli – Labyrinth of Lies\n:Edward Berger and Nele Mueller-Stöfen – Jack\n:Baran bo Odar and Jantje Friese – Who Am I – No System Is Safe\n:Ralf Westhoff – Wir sind die Neuen\nBest Director\n'Sebastian Schipper – Victoria'\n:Edward Berger – Jack\n:Dominik Graf – Beloved Sisters\n:Johannes Naber – Age of Cannibals\nBest Actress in a Leading Role\n'Laia Costa – Victoria'\n:Nina Hoss – Phoenix\n:Katharina Marie Schubert – '\nBest Actor in a Leading Role\nFrederick Lau – Victoria'\n:Christian Friedel – 13 Minutes\n:Hanno Koffler – Tough Love\nBest Supporting Actress\n'Nina Kunzendorf – Phoenix'\n:Meret Becker – Lügen und andere Wahrheiten\n:Claudia Messner – Beloved Sisters\nBest Supporting Actor\n'Joel Basman – We Are Young. We Are Strong.'\n:Burghart Klaußner – 13 Minutes\n:Gert Voss – Labyrinth of Lies\nBest Cinematography\n'Sturla Brandth Grøvlen – Victoria'\n:Yoshi Heimrath – We Are Young. We Are Strong.\n:Judith Kaufmann – 13 Minutes\n:Nikolaus Summerer – Who Am I – No System Is Safe\nBest Editing\n'Robert Rzesacz – Who Am I – No System Is Safe'\n:Mathilde Bonnefoy – Citizenfour\n:Sven Budelmann – Stereo\n:Alexander Dittner – 13 Minutes\n:Jörg Hauschild – As We Were Dreaming\nBest Set Design\n'Silke Buhr – Who Am I – No System Is Safe'\n:Benedikt Herforth and Thomas Stammer – 13 Minutes\n:Claus Jürgen Pfeiffer – Beloved Sisters\nBest Costume Design\n'Barbara Grupp – Beloved Sisters'\n:Katrin Aschendorf – The Cut\n:Bettina Marx – 13 Minutes\nBest Make Up\n'Nannie Gebhardt-Seele and Tatjana Krauskopf – Beloved Sisters'\n:Tatjana Krauskopf and Isabelle Neu – 13 Minutes\n:Waldemar Pokromski and Sabine Schumann – The Cut\nBest Film Music\n'Nils Frahm – Victoria'\n:Alexander Hacke – The Cut\n:Niki Reiser and Sebastian Pille – Labyrinth of Lies\nBest Sound Design\n'Bernhard Joest-Däberitz, Florian Beck, Ansgar Frerich and Daniel Weis – Who Am I – No System Is Safe'\n:Frank Kruse, Matthias Lempert and Alexander Buck – Citizenfour\n:Magnus Pflüger, Fabian Schmidt and Matthias Lempert – Victoria\nLifetime Achievement Award\nBarbara Baum\nMost Visited Film\nHonig im Kopf'' – Produced by: Til Schweiger and Tom Zickler, directed by: Til Schweiger\nReferences\n*\n*"
    }
  ]
}