{
  "content": [
    {
      "type": "text",
      "text": "# Get Your War On__disambig_1\n\n| status =\n| began = October 9, 2001\n| ended = January 20, 2009\n| genre = Satire\n| ratings =\n}}\nGet Your War On is a series of satirical comic strips by David Rees about political topics. Initially, the comic concerned the effects of the September 11 attacks on New York City, but it quickly switched its focus to more recent topics, in particular the war on terror. The strip debuted on October 9, 2001.\nFrom a technical standpoint the strips are crude, being assembled from about a dozen simple clip art pictures of office workers (with a few exceptions, most notably super robot Voltron) that are repeated, often in the same strip. Almost all are in red on a white background. There is an emphasis on dialogue, with little action. Highly disillusioned and cynical, it is heavily laden with expletives.\nDevelopment and publishing\nThe majority of the clip art used in Get Your War On is taken from Office and Business Illustrations, designed by Tom Tierney and first published by Dover Publications in 1988. In 2009, American restaurant chain Jamba Juice was criticized for running an ad campaign which looked similar to the Get Your War On series as it used the same clip art.\nGet Your War On has been published in book form, with the author's royalties (as well as part of the publisher's income for the first book and Get Your War on II) being donated to the charity Adopt-A-Minefield for removal of landmines in Afghanistan. It was also published regularly in Rolling Stone and some alternative newspapers.\nIn 2004, Rees was interviewed in the book Attitude 2: The New Subversive Alternative Cartoonists, edited by syndicated editorial cartoonist Ted Rall. Attitude 2 included other cartoonists such as Alison Bechdel and Aaron McGruder.\nIn 2007, Get Your War On comics were included with the works of Jenny Holzer and Goya in the Dissent! exhibition of protest art at Harvard University's Fogg Art Museum.\nAs the author had promised, the strip ended the day that George W. Bush left office, January 20, 2009. Rees continues to maintain a blog, which covers topical political issues.\nCritical reaction\nTom Carson has called Get Your War On a \"glorious excoriation of our post-9/11 loony bin\", while Connie Ogle, in her review of the second Get Your War On book, called it \"Profane, decidedly anti-war and screamingly funny ... guaranteed to make you laugh yourself sick.\" James Poniewozik has compared Get Your War On to Doonesbury and The Boondocks, calling it \"a fresher (and more R-rated) critique\" of the Bush administration.\nAdaptations\nIn 2005 it was adapted into a stage performance by Rude Mechanicals of Austin, Texas. The performance was revived in the winter of 2006 and began a tour of the country in the fall of 2006. The tour included stops in Houston, Philadelphia, New York, and Washington, D.C.\nDuring the United States presidential election in 2008, Get Your War On began running as an animated series on the comedy website Comedy 23/6. The series stopped after Barack Obama's inauguration, but returned during the 2012 presidential election.\nIn book form\n* Get Your War On. Brooklyn: Soft Skull, 2002.\n* Get Your War On II. New York: Riverhead, 2004.\n* Get Your War On: The Definitive Account of the War on Terror, 2001-2008 Brooklyn: Soft Skull, 2008.\nSee also\n*Codefellas\nNotes\nReferences\n;Sources\n* Begun, Bret (November 4, 2002). \"Is It OK to Laugh Yet?\". Newsweek, p. 54.\nExternal links\n*\n* [https://web.archive.org/web/20110612145642/http://www.notmuch.com/Show/Archive.pl?s_id=441 Interview with David Rees] in part 1 February 3, 2007 radio show \"Whad'ya know\"\n*[https://web.archive.org/web/20090204031008/http://www.236.com/tag/Get+Your+War+On Animated Series on 236.com]"
    }
  ]
}