{
  "content": [
    {
      "type": "text",
      "text": "# Ghosts (The Walking Dead)\n\n| writer         = Jim Barnes\n| director       = David Boyd\n| music          =\n| length         = 48 minutes\n| photographer   = Stephen Campbell\n| editor         = Jack Colwell\n| guests         = * Thora Birch as Gamma / Mary\n* Matt Lintz as Henry\n| prev           = We Are the End of the World\n| next           = Silence the Whisperers\n| season_article = The Walking Dead season 10\n| episode_list   = List of The Walking Dead episodes\n}}\n\"Ghosts\" is the third episode of the tenth season of the post-apocalyptic horror television series The Walking Dead, which aired on AMC on October 20, 2019. The episode was written by Jim Barnes and directed by David Boyd. In the episode, the threat of the Whisperers return leads to paranoia sweeping over Alexandria. In the meantime, Carol (Melissa McBride) battles with the need for revenge.\nPlot\nOver a period of 48 hours, several hordes of walkers appear at the Alexandria community, coming from the direction of the border, exhausting the communities as they deal with them, with no end in sight. During a lull, Gamma approaches the Alexandrians and instructs them to meet Alpha at the line of posts delineating their territory to the north.\nAt a town meeting, Lydia tells the others that this is not Alpha's normal strategy: she would drown the community with a massive horde instead of these smaller attacks. Michonne, Daryl, and Carol go to meet Alpha, while other groups work to try to stop the advancing hordes from other directions. Aaron is instructed to take Negan, one of the few people left capable of fighting, to stop a horde coming from the south. Aaron, still bitter at the loss of his boyfriend during the battle with the Saviors, detests Negan and forces him to fight only with a wooden stake rather than a crowbar.\nThat night at the border, Alpha tells the group that she knows they have crossed into Whisperer territory several times before, violating their agreement, but acknowledges that the crossings were done out of necessity. She asserts that punishment will be necessary, but rather than bloodshed, she declares that the border has been changed, extending Whisperer territory to include most of the hunting grounds near Alexandria. When Carol complains, Alpha threatens her and boasts about Henry's death; Carol attempts to shoot her, but Michonne knocks the gun out of her hand and apologizes for Carol's actions. Alpha forgives Carol and allows them to leave without further punishment, but tells them to run immediately, as a small group of walkers begins pursuing them. As they flee, Carol sees a small group of Whisperers stalking them, and alerts the others. She, Michonne, and Daryl attempt to track down the Whisperers, but are overwhelmed by the walkers and are forced to take shelter in an abandoned school.\nMeanwhile Negan and Aaron taunt each other about failing their late loved ones, they are attacked by a walker covered in hogweed, which falls on Aaron, causing him to get a rash on his face and temporarily blinding him. With no sign of Negan around, a visually-impaired Aaron finds a house and takes shelter there, but walkers soon arrive and break in. Negan, who was already in the house watching Aaron struggle, finishes off the walkers and saves Aaron to prove his loyalty to Alexandria.\nAt the school, Daryl discovers that Carol has been taking a prescription medication that keeps her awake to avoid dreaming about Henry's death, causing her to hallucinate. While searching for any sign of the Whisperers inside the school gym, Carol gets caught in a snare trap set by a Whisperer, who brings out a small horde of walkers. Carol fires her revolver at the fleeing Whisperer, while the walkers attack her. Carol manages to free herself from the snare, cutting her arm in the process, and kills all the Walkers. Daryl and Michonne help Carol back to Alexandria, where her injuries are treated; she later considers not taking the medication any longer. Back at the school, the Whisperer that Carol shot reanimates as a walker.\nReception\nCritical reception\n\"Ghosts\" received positive reviews from critics. On Rotten Tomatoes, the episode has an approval rating of 88% with an average score of 6.96 out of 10, based on 15 reviews. The site's critical consensus reads, \"Opening with some of TWDs most unsettling imagery to date, 'Ghosts' ratchets up the tension with a heady, psychologically-driven story.\"\nRatings\n\"Ghosts\" drew 3.48 million viewers and was the most-watched cable show of the night.\nReferences\nExternal links\n*[https://www.amc.com/twdu/the-walking-dead/season-10/episode-3 \"Ghosts\"] at AMC\n*"
    }
  ]
}