{
  "content": [
    {
      "type": "text",
      "text": "# Gibraltarians in the United Kingdom\n\n|popplace=Mainland United KingdomIn particular London\n|langs=British English, Andalusian Spanish, Llanito\n|rels=Mainly Roman Catholic and Anglican\n|related= Gibraltarians, British Overseas Territories citizens, White British, British, Andalusian Spanish, Maltese, Genoese Italian, Portuguese\n|footnotes=\n}}\nGibraltarians in the United Kingdom may be Gibraltarian-born immigrants to the United Kingdom or their British-born descendants. Gibraltar is a British overseas territory therefore it allows individuals born there the right of abode in the United Kingdom. They hold British Overseas Territory Citizenship but may apply for registration as a British citizen (an entitlement that cannot be refused) under section 5 of the British Nationality Act 1981 and are considered United Kingdom nationals for European Union purposes with all consequential rights and entitlements.\nBackground\nGibraltar has been under British rule since 1704. It lies near the southernmost point of the Iberian Peninsula, almost entirely surrounded by the Mediterranean Sea (the Bay of Gibraltar to the west, the Strait of Gibraltar to the south, the Alboran Sea to the east and Spain to the north). It is one of only two British overseas territories in Europe.\nHistory\nLarge scale evacuation from Gibraltar to the UK occurred during World War II, Gibraltar's location in a war-torn nation meant mass evacuation from the territory was inevitable. Approximately 16,700 evacuees left Gibraltar with the UK taking in 12,500 of them, the majority settled in Kensington, Fulham and Barking (all London), although numerous others sought refuge elsewhere in the country (particularly Northern Ireland). Due to lack of accommodation, many of these Gibraltarians were reluctant to stay in the UK, and many eventually returned to Gibraltar after stability became better established.\nStatistics\nAccording to the 2001 UK Census, 11,830 people born in Gibraltar were residing in the UK, which constitutes the largest group of British overseas territory citizens residing in the UK. The UK is also the country with the largest group of Gibraltarians resident outside Gibraltar.\nSee also\n*British migration to Spain\n*Spaniards in the United Kingdom\nReferences"
    }
  ]
}