{
  "content": [
    {
      "type": "text",
      "text": "# Gil Hayward\n\nGilbert Osborne Hayward (16 October 1917—9 October  2011) was a World War II cryptographer and inventor of the first electronic seal security device.\nCareer\nAs a pupil at Kilburn Grammar School, Hayward became captivated by machines and science. At 19 he was the youngest member of the British Astronomical Association, and constructed his own reflecting telescope. He spent weeks in a junkyard to find parts with which he restored an old green Bentley and a Scott Super Squirrel motorcycle, which he then rode. Hayward's mother did not allow him go to university, his elder brother did not get accepted for Uni so Gil was not allowed to go. As a result, Hayward left school in 1934 at 16 to become an apprentice at Dollis Hill, where he collaborated with Dr Eric Speight on making the TIM speaking clock service. His apprenticeship taught him how to use machine tools and the foundation of early electronics which formed the basis of his inventive life.\nWhile at Dollis Hill, in April 1940, he was recruited by Military Intelligence for a 'risky' mission in Egypt. In Egypt with the Intelligence Corps,  he developed bugging equipment to listen to conversations between captured German and Italian prisoners of war. Expecting to be dropped into Turkey to sabotage telecoms systems, Hayward was instead called back to London in 1943, and was recalled by Dollis Hill to be assigned to Bletchly Park.\nFrom 1943 to 1945, Hayward worked at the Post Office Research Station at Dollis Hill with Tommy Flowers, developing the Tunny and Colossus, decryption machines which were crucial to the development of later computers. By the culmination of the war, as many as 15 Tunny machines were used at Bletchley Park, supplying Allied leaders close to 300 messages from the German High Command per week. Amongst other things, Tunny gave important intelligence for D-Day.\" Over 13,000 messages were read in total.\nAt Bletchley Park, Hayward was at the helm of a team of around 12 post office engineers worked to check machines and keep them functioning. At the twilight of the war, he helped dismantle the code breaking machines and reinstall two Colossus machines at Eastcote, North London.\nPost-war activity\nAfter the war, Hayward was initially posted to Palestine in 1946 then worked on a secret voice encipherment system before moving to Ghana in 1951 to install telecoms networks. In the 1960s, during the Malayan Emergency, Hayward was recruited by MI5 and joined the special branch of the Royal Malaysian Police and was tasked with  designing “special techniques devices” for use against the Malayan National Liberation Army (MNLA), the militant arm of the Malayan Communist Party (MCP).\nWhile in Ghana Gil made and patented the first compressed air underwater harpoon gun with a harpoon reloading mechanism, which saved the diver surfacing. Fascinated by new technologies he built from scratch an autogyro then in 1960 a two man hovercraft on mahogany, powered by a 500cc Triumph motorcycle engine.\nBy the 1980s, Hayward had patented the first electronic security seal, setting up the company Encrypta Electronics with his son Mark to manufacture the product. The devices are still used widely in the fields of distribution and transport. In the 1990s he helped researchers at The National Museum of Computing (TNMOC) rebuild the Tunny and Colossus machines by crafting new parts from blueprints he had kept against the orders of Winston Churchill who was concerned that they could fall into Soviet hands. He was honoured with a special medal for his services to codebreaking in 1996.\nHayward's son Mark told BBC Radio 4 that it was 'somewhat disappointing that because he worked in secret work, like all these chaps did, that they were never truly honoured by the country for the contribution they made'.\nAwards and honours\nIn 1996, Hayward's contributions to the war effort were acknowledged when he was presented to the Duke of Kent for the opening of Bletchley Park Museum. In 2010, he was recognised for his contribution to the code breaking effort with a special medal from Prime Minister Gordon Brown.\nReferences\nExternal links\n*[https://eandt.theiet.org/content/articles/2011/05/rebuilt-tunny-machine-adds-to-knowledge-of-early-computing/ Rebuilt Tunny machine adds to knowledge of early computing] at E&T Magazine"
    }
  ]
}