{
  "content": [
    {
      "type": "text",
      "text": "# Gilldora, Queensland\n\n| pop                 = 50\n| pop_year            =\n| pop_footnotes       =\n| established         =\n| postcode            = 4570\n| area                = 3.9\n| timezone            = AEST\n| utc                 = +10:00\n| dist1               = 13.6\n| dir1                = S\n| location1           = Gympie\n| dist2               = 169\n| dir2                = Brisbane\n| location2           =\n| dist3               =\n| dir3                =\n| location3           =\n| dist4               =\n| dir4                =\n| location4           =\n| lga                 = Gympie Region\n| stategov            = Gympie\n| fedgov              = Wide Bay\n| near-n              = Lagoon Pocket\n| near-ne             = Kybong\n| near-e              = Kybong\n| near-se             = Kybong\n| near-s              = Dagun\n| near-sw             = Dagun\n| near-w              = Calico Creek\n| near-nw             = Calico Creek\n}}\nGilldora is a rural locality in the Gympie Region, Queensland, Australia. In the , Gilldora had a population of 50 people.\nGeography\nThe Mary River forms the north-eastern and eastern boundaries.\nThe Mary Valley Road (State Route 51) enters the locality from north-west (Calico Creek / Lagoon Pocket) and exits to the south (Dagun).\nThe Mary Valley railway line enters the locality from the north (Lagoon Pocket) and exits to the south (Dagun).  The locality was served by the now-abandoned Gilldora railway station ().\nThe land use is a mixture of grazing on native vegetation, crop growing, and rural residential housing.\nHistory\nThe locality takes its name from its former railway station name, which in turn was named on 16  October 1922, reportedly a coined word from local resident Gillman \"dorado\", which happens to be an Aboriginal word meaning pleasant place.\nDemographics\nIn the , Gilldora had a population of 39 people.\nIn the , Gilldora had a population of 50 people.\nEducation\nThere are no school in Gilldora. The nearest government primary school is Dagun State School in neighbouring Dagun to the south. The nearest government secondary school is Gympie State High School in Gympie to the north.\nAttractions\nThe Mary Valley Rattler is a tourist train that operates on the Mary Valley railway line passing through Gilldora.\nReferences"
    }
  ]
}