{
  "content": [
    {
      "type": "text",
      "text": "# Gill Robb Wilson Award\n\nThe Gill Robb Wilson Award is Civil Air Patrol’s (CAP) highest award for Senior Member professional development.  It recognizes senior members who have dedicated themselves to leadership and personal development in the CAP. The CAP first gave this award in 1964 to honor the late Gill Robb Wilson. He is regarded as the founder of Civil Air Patrol, and served as CAP’s first executive officer.\nCivil Air Patrol is the civilian auxiliary of the United States Air Force.  CAP has a three-fold mission.  It includes emergency services, cadet programs, and aerospace education.  CAP professional development provides technical skills and leadership training to senior members age 18 and over to support CAP’s mission.  The program enables these adults to develop these skills while providing a public service.\nAs the member progresses through the program, they complete five increasingly complex training levels. Each level requires the member to become more involved in CAP activities, master skills in one of 23 technical areas, and develop leadership ability. As they complete these levels, the member receives awards, chances for promotion, and selection for more important roles within CAP.\nThe final milestone is the Wilson Award. It is earned after receiving the Paul E. Garber Award. In addition, members must direct the training of fellow members in a variety of courses. They must also have served in command or leadership positions for at least three years.  Finally, they must have completed CAP’s capstone course, the National Staff College, or approved equivalent. Recipients of this award, along with other requirements, makes a member eligible to the grade of CAP Lieutenant Colonel.\nAs CAP’s premier award for senior member professional development, the Gill Robb Wilson Award should be presented by an Air Force or CAP general officer, an elected state or federal official, or other distinguished person.\nReferences"
    }
  ]
}