{
  "content": [
    {
      "type": "text",
      "text": "# Gillian Stewart\n\n| birth_place       = Inverness, Scotland\n| death_date        =\n| death_place       =\n| height            =\n| weight            =\n| nationality       =\n| residence         =\n| spouse            =\n| partner           =\n| children          =\n| college           = Edinburgh University\n| yearpro           = 1985\n| extour            = Ladies European Tour\n| prowins           = 4\n| letwins           = 3\n| otherwins         = 1\n| award1            =\n| year1             =\n| award2            =\n| year2             =\n| awardssection     =\n}}\nGillian Stewart (born 21 October 1958) is a Scottish professional golfer who played on the Ladies European Tour (LET) from 1985 to 2000. She recorded three LET wins and was runner-up in eight tournaments. As an amateur, she won the Girls Amateur Championship and played in the Vagliano Trophy, Curtis Cup and Espirito Santo Trophy.\nAmateur career\nStewart was educated at Inverness Royal Academy and the University of Edinburgh, where she majored in Business Studies. Stewart assembled an impressive amateur record. She won the 1976 Girls Amateur Championship and the Scottish Women's Amateur Championship in 1979, 1983 and 1984. She also won the Helen Holm Trophy in 1981 and 1984. She was runner-up at the 1982 British Ladies Amateur and the 1984 Spanish International Ladies Amateur Championship.\nStewart represented Great Britain & Ireland in the 1979, 1981 and 1983 Vagliano Trophy, the 1980 and 1982 Curtis Cup, and the 1982 and 1984 Espirito Santo Trophy. She representing Scotland at the Women's Home Internationals six years consecutively between 1979 and 1984 and at the European Ladies' Team Championship three consecutive tournaments 1979, 1981 and 1983.\nShe won the 1984 IBM Ladies' European Open at The Belfry, the last amateur to win on the Ladies European Tour for 22 years until 2006 when Amy Yang won the ANZ Ladies Masters.\nProfessional career\nStewart turned professional in 1985 and won the first tournament she played as a professional, the Ford Ladies Classic at Woburn Golf and Country Club. In 1986, she was runner-up at the Belgian Ladies Open and Trusthouse Forte Ladies' Classic. In 1987, she again won the Ford Ladies Classic, and was runner-up at the Guernsey Open. In 1989, she was runner-up at the Ford Ladies' Classic, Ladies European Open and at the Benson & Hedges Trophy together with Carl Mason. In 1990, she was runner-up at the Longines Classic and the Ladies Swiss Classic.\nIn 1994, she won the Lalla Meryem Cup, while it was only a non-LET invitational event.\nAfter retiring from tour, she took up coaching and broadcasting, including commentary for the BBC covering The Open Championship and the Barclays Scottish Open.\nAmateur wins\n*1975  Scottish Under-19 Stroke Play Championship\n*1976 Girls Amateur Championship\n*1979 Scottish Women's Amateur Championship\n*1981 Helen Holm Trophy\n*1983 Scottish Women's Amateur Championship\n*1984 Scottish Women's Amateur Championship, Helen Holm Trophy\nProfessional wins (4)\nLadies European Tour wins (3)\n*1984 IBM Ladies' European Open (as an amateur)\n*1985 Ford Ladies Classic\n*1987 Ford Ladies Classic\nOther wins (1)\n*1994 Lalla Meryem Cup\nTeam appearances\nAmateur\n*European Ladies' Team Championship  (representing Scotland): 1979, 1981, 1983\n*Vagliano Trophy (representing Great Britain & Ireland): 1979, 1981, 1983\n*Women's Home Internationals (representing Scotland): 1979 (winners), 1980, 1981, 1982, 1983, 1984\n*Curtis Cup (representing Great Britain & Ireland): 1980, 1982\n*Espirito Santo Trophy (representing Great Britain & Ireland): 1982, 1984\n*Commonwealth Trophy (representing Great Britain): 1979, 1983\nReferences\nExternal links\n*"
    }
  ]
}