{
  "content": [
    {
      "type": "text",
      "text": "# Ging Gang Goolie (Boardwalk Empire)\n\n| length         = 56 minutes\n| guests         = * Stephen Root as Gaston Means\n* Julianne Nicholson as Esther Randolph\n* Christopher McDonald as Harry M. Daugherty\n* Meg Steedle as Billie Kent\n* Billy Magnussen as Roger McAllister\n* Heather Lind as Katy\n* Glenn Fleshler as George Remus\n| prev           = You'd Be Surprised\n| next           = Sunday Best\n| season_article = Boardwalk Empire (season 3)\n| episode_list   = List of Boardwalk Empire episodes\n}}\n\"Ging Gang Goolie\" is the sixth episode of the third season of the American period crime drama television series Boardwalk Empire. It is the 30th overall episode of the series and was written by co-producer Steve Kornacki, and directed by Ed Bianchi. It was released on HBO on October 21, 2012.\nThe series is set in Atlantic City, New Jersey, during the Prohibition era of the 1920s. The series follows Enoch \"Nucky\" Thompson, a political figure who rises to prominence and interacts with mobsters, politicians, government agents, and the common folk who look up to him. In the episode, Nucky gets in trouble while visiting Harry Daugherty, while Margaret questions if her son was involved in a fire.\nAccording to Nielsen Media Research, the episode was seen by an estimated 2.34 million household viewers and gained a 0.8 ratings share among adults aged 18–49. The episode received generally positive reviews from critics, who praised the directing and performances, but some felt disappointment at the lack of progress in Gyp Rosetti's storyline.\nPlot\nAt night, Margaret is awakened by Teddy, who warns her about a fire in the greenhouse. Owen helps the firefighters in stopping the fire. When questioned by Owen, Teddy claims that a person only known as the \"Gypsy Man\" was responsible. Later, Margaret's neighbor Cornelia tells her that she found Teddy playing with matches, making Margaret question if he started the fire. It is later revealed that a vagrant started the fire in an effort to keep warm.\nNucky goes to New York City to pay Gaston Means on behalf of Harry M. Daugherty, but is surprised when Means does not show up. He decides to visit Washington, D.C. to talk with Daugherty, finding that he was already meeting George Remus, who was just alongside Nucky waiting for Means in New York. Finding that Daughterty could indict him to save Jess Smith, whom Remus paid directly, Nucky warns him that he will incriminate Daugherty if he falls.\nThis prompts Daugherty to call officers to arrest Nucky for possessing alcohol. He is brought before a judge, just as Esther Randolph is prosecuting. Nucky is one of a long line of minor alcohol offenders, and the judge has little patience for all of the minor violations before him. He dismisses Randolph's accusations regarding Nucky's prior actions, and has Nucky pay $5 for violating the Volstead Act. Despite their status, Randolph agrees to dine with Nucky. Nucky suggests they can work a case against Daugherty, which will save her career, even if Warren G. Harding's protection of Daugherty proves to be a challenge.\nDuring an American Legion meeting, Richard witnesses a veteran, Paul Sagorsky, being brutally attacked during a fight. Taking pity on him, Richard takes care of Paul until his daughter Julia picks him up. Seeing that he left his coat with a medal, Richard goes to his house to return it. Julia informs him that the medal actually belongs to her deceased brother, who died in the World War. This encounter makes Richard revisit a photograph of himself and his sister from 1916. Meanwhile, Mickey and Eli discover that Gyp has left Tabor Heights following the assassination attempt.\nAfter a fight with Luciano for trying to get prostitutes involved in the heroin business, Gillian decides to remove all of Jimmy's photographs from the Artemis Club. That night, while walking, she meets a young man named Roger McAllister, who resembles Jimmy. They have sex in his apartment, with Roger noting that he will soon be bankrupt unless he can find a job. Gillian offers to find him a job, also convincing him that she can call him \"James.\"\nBack in Atlantic City, Nucky visits Billie. However, the encounter is interrupted when he is called by Means, who was hiding in the closet when Nucky met with Daugherty in Washington. Means is willing to help Nucky in building a case against Daugherty, but Nucky must pay him $40,000, which Nucky accepts. That night, Margaret hears noise in the greenhouse and discovers Owen, who was keeping guard. She feels guilty for believing that Teddy was responsible for the fire, and Owen calms her. Despite initially resisting her advances, Owen concedes and both kiss passionately in the greenhouse.\nProduction\nDevelopment\nThe episode was written by co-producer Steve Kornacki, and directed by executive producer Ed Bianchi. This was Kornacki's fifth writing credit, and Bianchi's second directing credit.\nReception\nViewers\nIn its original American broadcast, \"Ging Gang Goolie\" was seen by an estimated 2.34 million household viewers with a 0.8 in the 18-49 demographics. This means that 0.8 percent of all households with televisions watched the episode. This was a 6% increase in viewership from the previous episode, which was watched by 2.19 million household viewers with a 0.8 in the 18-49 demographics.\nCritical reviews\n\"Ging Gang Goolie\" received generally positive reviews. Matt Fowler of IGN gave the episode a \"good\" 7.6 out of 10 and wrote, \"Look, I was expecting the follow-up to last week's insane 'You'd be Surprised' to be a bit more mellow, but perhaps not as semi-plodding as 'Ging Gang Goolie' This is Boardwalk Empire so there aren't really \"bad\" episodes, per se, but I was surprised by how underwhelmed I was this chapter.\"\nNoel Murray of The A.V. Club gave the episode a \"B+\" grade and wrote, \"So consider 'the gypsy man' to be one of the new characters introduced in 'Ging Gang Goolie,' and perhaps the most significant in a way, since he represents so much of what this episode's about: scapegoating, substitutes, and how children learn to lie.\"\nAlan Sepinwall of HitFix wrote, \"Means is such a slippery character (and so well played by Stephen Root) that it's hard to tell. And given that Nucky himself is not always the easiest man to read, this could turn into a fascinating game of chess, or a really frustrating experiment in reading micro-expressions.\" Seth Colter Walls of Vulture gave the episode a 3 star rating out of 5 and wrote, \"I liked how all those surprises and keep-you-guessing tricks worked in this episode, especially compared to how the last episode thought suspense was fairly earned by preemptively ending crucial scenes. Also: The way the show moved around between its many points-of-action was pretty masterful.\"\nEdward Davis of IndieWire gave the episode a \"B\" grade and wrote, \"Teddy vows to protect his polio-debilitated sister Emily. How, she asks? With a knife he has stashed under his pillow, of which it seems no good will come.\" Chris O'Hara of TV Fanatic gave the episode a 3.5 star rating out of 5 and wrote, \"'Ging Gang Goolie' had its moments, but my hopes of seeing the show move forward on certain fronts was hamstrung by the resurrection of storylines I had taken for dead and buried.\"\nMichael Noble of Den of Geek wrote, \"Indeed, Gyp has become so much a part of the season's structure that his absence this week might have been expected to leave a void in the episode. Fortunately, the vacuum is filled by the return of two much-missed Boardwalk staples, namely fan-favourite Richard Harrow and Nucky Thompson's mojo.\" Michelle Rafferty of Paste gave the episode an 8.5 out of 10 and wrote, \"Between all the 'shapeshifter' drama last night, Gyp's big scene last week, and the psychologically warped 'Bone for Tuna,' there have been many moments this season I've felt like I was in the middle of a legitimate thriller. Well done, Boardwalk. It's almost Halloween, and I'm spooked.\"\nReferences\nExternal links\n* [https://www.hbo.com/boardwalk-empire/season-3/6-ging-gang-goolie \"Ging Gang Goolie\"] at HBO\n*"
    }
  ]
}