{
  "content": [
    {
      "type": "text",
      "text": "# Ginger Group (Queensland)\n\nThe Ginger group, in Queensland politics was a group of Liberal Party MLAs during the 1960s, 1970s and 1980s, who despite nominally being a part of the government, were opposed to some of the policies of their senior coalition partner, the National Party. Initially a small informal grouping within the Liberal Party, the group came to wield greater and greater power within the Liberal partyroom, culminating in Terry White's successful leadership challenge in 1983, and the party's subsequent defeat and loss of influence at the 1983 election.\nBackground\nAfter the Second World War, the politics of the Australian state of Queensland was dominated by the Labor Party and the Country Party. In Queensland, the rural-urban divide has historically been less pronounced than in other states. While the Liberal Party and its predecessors have long been the dominant partner in the non-Labor Coalition, in Queensland the Country Party was the dominant partner from 1936 onwards when the joint Country and Progressive National Party was split into separate parties matching the federal Country and United Australia, later Liberal, parties.\nFrom 1949, an electoral malapportionment meant that regional areas held significantly more political power in the Legislative Assembly than their populations would have suggested. This arrangement initially benefited the Labor Party, whose power base was historically in the provincial cities. However, the Labor government imploded in 1957, allowing the Country-Liberal Coalition to win power. The new Country Party premier, Frank Nicklin, immediately tweaked the electoral system to favour his own party. The Liberals, whose base was concentrated in and around the state capital, Brisbane, were left at a severe disadvantage as before.\nThe Country-Liberal coalition was harmonious at first, as both were determined to drive Labor out of office in favour of a conservative government, and subsequently to keep Labor out of power.  The first indications of trouble came in 1963, when the Liberals insisted on the introduction of preferential voting in Queensland.  The Country Party resisted this move, fearing that a change in the electoral system would work against their electoral interests.  These fears were confirmed to be baseless at the 1963 election, when it was shown that preferential voting did not noticeably alter the outcome in all but a few seats, and the Country Party dropped its opposition.  Nevertheless, the dispute showed that there was the potential for disagreement between the two electoral allies.\nGrowth\nThe first overt opposition to the Country Party's dominance from within the Liberal party came from John Murray, the member for Clayfield, in 1964.  Murray publicly criticised the land policy of the government, as well as the Country Party's dominance of government business in the legislature, which often disadvantaged the Liberals just as much as the nominal Labor opposition.  At around the same time, the Liberals had begun establishing local branches in Country party held seats, particularly on the Gold Coast, a development that some in the Country Party found provocative.\nFurther discontent became evident following the 1968 by-election in the seat of Landsborough, caused by Nicklin's retirement.  While Landsborough was at the time a regional seat, nearby urban growth was changing the demographics of the area, and some Liberals wanted a chance to contest the seat.  This was theoretically permitted by the coalition agreement, which permitted so-called \"three cornered contests\" where there was no sitting member in place.  After heated debate at the party's convention, Liberal President Dr A. W. Hartwig declared that the party would not contest the election, but then added that he personally disagreed with the decision.  Charles Porter, an MLA who would later become identified with the Ginger Group, declared that the decision not to contest the election was \"flabby, craven, and lacking in confidence.\"\nRebellion and takeover\nAs time wore on, and the period of Country Party dominance continued, some figures within the Liberal Party became more and more outspoken in their opposition to government policy.  Discontent arose from differences of opinion on policies (including on then-premier Joh Bjelke-Petersen's controversial street march policies, and the midnight destruction of Brisbane's Belle Vue Hotel), as well as Liberal resentment at their junior status within the coalition. In 1973, the Queensland Country Party changed its name to the National Party, in an attempt to attract voters in urban areas.  Some Liberals viewed this as a direct threat to their interests.  However, Liberal leader William Knox and his successor, Llew Edwards, adopted a \"wait and see\" approach, preferring to wait until the popular Bjelke-Petersen's retirement or electoral defeat before making a move against the Nationals.\nThe Ginger Group were not happy with this approach, however, and continued to make public their opposition to many government policies. In 1982, they were sufficiently emboldened that Angus Innes, a leading member of the group and the member for Sherwood challenged Edwards for the leadership of the Liberal party.  Bjelke-Petersen publicly stated that he would not work in a coalition with Innes leading the Liberal Party, and that he would form a minority government if necessary.  Edwards was able to defeat the challenge, but the close margin (12-10) showed that the Ginger Group was gaining increasing power and influence within the Liberal Party.\nAt this point, although the Ginger Group was never a formal faction within the party, the following MLAs were widely perceived to be a part of the group:\n* Angus Innes, member for Sherwood\n* Terry White, member for Redcliffe\n* Guelfi Scassola, member for Mt Gravatt\n* Ian Prentice, member for Toowong\n* Terry Gygar, member for Stafford\n* Rosemary Kyburz, member for Salisbury\n* Rob Akers, member for Pine Rivers\n* Bill Hewitt, member for Greenslopes\n* John Greenwood, member for Ashgrove.\nAll nine represented electoral districts either in or near Brisbane.  White and Hewitt were ministers, and the group was supported from outside parliament by John Herron, then the state president of the Liberal Party.  Most of them were also members of the progressive, or \"small-l liberal,\" wing of the party, although Greenwood, a former minister, belonged to the conservative wing of the party.\n1983 election\nMatters came to a head in 1983 when the Ginger Group crossed the floor of parliament over the establishment of a public accounts committee, which had been a longstanding demand.  White claimed that since there was no stated government policy on the matter, he was not bound by cabinet solidarity to vote against it.  Bjelke-Petersen was furious, and Edwards quickly sacked White from his cabinet portfolio over the affair.  White, in turn, challenged Edwards for leadership of the party, which he managed to secure with the assistance of the other Ginger Group members.  Angus Innes was at the same time elected deputy leader.  However, Bjelke-Petersen refused to appoint White as Deputy Premier, a post normally held by the Liberal leader.  In response, White dissolved the coalition agreement and moved the Liberals to the crossbenches.  However, Bjelke-Petersen advised the Governor, James Ramsay, to adjourn parliament, allowing him to stay in power at the head of a minority government until the election without having to face any confidence motions from White.\nIn the subsequent 1983 election, Bjelke-Petersen called for right-leaning Liberal voters to support the Nationals, suggesting that under White, the Liberals might throw their support to Labor.  The election was an unmitigated disaster for the Liberals, who suffered a 14-seat loss.  Significantly, from the Ginger Group, only White and Innes survived, with the media and supporters blaming them for the debacle.  Two of the surviving members defected to the Nationals soon after the election, leaving the Liberals with only six members out of 89.  The two defectors gave Bjelke-Petersen's Nationals an outright majority, allowing him to form government in his own right.\nWhite resigned as leader soon afterwards, although Innes later managed to become leader of the Liberal Party in time for the 1989 election, which saw Labor win power for the first time since 1957.\nSee also\n* Ginger group\nReferences"
    }
  ]
}