{
  "content": [
    {
      "type": "text",
      "text": "# Girvan and South Carrick (ward)\n\n|elects_howmany=3\n|councillor1=Alec Clark\n|party1     =Independent (politician)\n|councillor2=Gavin Scott\n|party2     =Scottish Conservative and Unionist Party\n|councillor3=Alan Lamont\n|party3     =Scottish Conservative and Unionist Party\n|towns      =Girvan\n|scot_parl  =Carrick, Cumnock and Doon Valley\n|scot_region=South Scotland\n|westminster=Ayr, Carrick and Cumnock\n}}\nGirvan and South Carrick is one of the eight electoral wards of South Ayrshire Council. Created in 2007, the ward elects three councillors using the single transferable vote electoral system and covers an area with a population of 10,871 people.\nThe ward has produced strong results for both the Scottish National Party (SNP) and the Conservatives with each party taking one seat at every election except in 2012.\nBoundaries\nThe ward was created following the Fourth Statutory Reviews of Electoral Arrangements ahead of the 2007 Scottish local elections. As a result of the Local Governance (Scotland) Act 2004, local elections in Scotland would use the single transferable vote electoral system from 2007 onwards so Girvan and South Carrick was formed from an amalgamation of several previous first-past-the-post wards.\nIt contained all of the former Girvan Ailsa and Girvan Glendoune wards as well as the vast majority of the former South Carrick ward. The ward includes the southernmost part of the council area on the Firth of Clyde coast and next to the council's borders with East Ayrshire and Dumfries and Galloway. It includes the town of Girvan as well as the uninhabited Ailsa Craig. Following the Fifth Statutory Reviews of Electoral Arrangements ahead of the 2017 Scottish local elections, the ward's northern boundary was amended and an area around Maidens, Turnberry and Kirkoswald was transferred into it from the Maybole, North Carrick and Coylton ward.\nCouncillors\n{|class=\"wikitable\" style=\"text-align:center\"\n!Election\n!colspan=8|Councillors\n|-\n!2007\n|style=\"background-color: \" |\n|Ian Fitzsimmons(Conservative)\n|rowspan=4; style=\"background-color: \" |\n|rowspan=2|Alec Oattes(SNP)\n|rowspan=2; style=\"background-color: \" |\n|rowspan=2|John McDowall(Labour)\n|-\n!2012\n|rowspan=4; style=\"background-color: \" |\n|rowspan=4|Alec Clark(Independent)\n|-\n!2017\n|rowspan=2|Peter Henderson(SNP)\n|rowspan=3; style=\"background-color: \" |\n|Ian Fitzsimmons(Conservative)\n|-\n!2022\n|rowspan=2|Gavin Scott(Conservative)\n|-\n!2023\n|style=\"background-color: \" |\n|Alan Lamont(Conservative)\n|}\nElection results\n2023 by-election\n2022 election\n2017 election\n2012 election\n2007 election\nReferences"
    }
  ]
}