{
  "content": [
    {
      "type": "text",
      "text": "# Giuseppe Verdi Monument (San Francisco)\n\n-->\n| completion_date =\n| catalogue =\n| medium = Bronze\n| movement =\n| subject = Giuseppe Verdi\n| height_metric =\n| width_metric =\n| length_metric =\n| diameter_metric =\n| height_imperial = 288\n| width_imperial =\n| length_imperial =\n| diameter_imperial =\n| dimensions =\n| dimensions_ref =\n| metric_unit = cm\n| imperial_unit = in\n| weight = 52 tons\n| designation =\n| condition =\n| museum =\n| city = San Francisco, California, U.S.\n| coordinates =\n| mapframe = yes\n| mapframe-zoom = 13\n| owner =\n| accession =\n| preceded_by =\n| followed_by =\n| module =\n| website =\n}}\nThe Giuseppe Verdi Monument is installed in San Francisco's Golden Gate Park, in the U.S. state of California. The monument was dedicated on March 23, 1914, to the soprano singer Luisa Tetrazzini. Ettore Patrizzi, an Italian newspaper owner, raised $15,000 for the monument through a subscription fund. The monument was made by Orazio Grossoni, an Italian sculptor from Milan.\nHistory\nPlanning for the monument began after Giuseppe's death on January 27, 1901.\nIn 1900, Ettore Patrizzi, the editor and owner of L'Italia, started a subscription fund that collected $15,000 for the monument's dedication.\nThe dedication for the monument took place on March 23, 1914. The monument was dedicated to soprano singer Luisa Tetrazzini, who performed at the dedication.  Attendance was recorded at about 20,000.\nIn 2003, the statue was restored, with the bust of Verdi being regilded.\nDescription\nThe statue stands at 24 feet and weighs 52 tons. tall and features a bust of Giuseppe Verdi at the top of the statue. Below the bust is a depiction of the four muses, Love, Tragedy, Joy, and Sorrow. At the back of the monument's base is a poem written by arch-nationalist poet Gabriele d'Annunzio.\nPoem\nTranslated into English, the poem reads as follows:He drew his chorus\nFrom the deepest vortex of striving masses\nHe voiced the hopes and sorrows of all humanity,\nHe wept and loved for all.\nReferences\nExternal links\n*"
    }
  ]
}