{
  "content": [
    {
      "type": "text",
      "text": "# GK Software\n\n|foundation        =  in Schöneck/Vogtland\n|founder           = Rainer Gläß Stephan Kronmüller\n|location_city     = Schöneck/Vogtland\n|location_country  = Germany\n|area_served       = Worldwide\n|key_people        = Michael Scheibner (Chief Executive Officer / Chairman of the Board) \tMichael Jaszczyk (Chief Digital Transformation Officer / Member of the Board)  Nicholas Fraser (Chairman of the Supervisory Board)\n|industry          = Enterprise software\n|revenue           = €194.4 million (2024)\n|net_income        = €27,2 million (2024)\n|assets            = €172.1 million (2024)\n|num_employees     = 1,322 (2024)\n|parent            =\n|homepage          =\n}}\nGK Software  is a German technology company headquartered in Schöneck/Vogtland. The company specializes in software and services for the operation of large retail company branches.\nThe name stands for the initials of the two founders of the company, Rainer Gläß and Stephan Kronmüller. , GK Software had revenue of €172.5 million.  GK employs about 1,258 individuals at fifteen locations worldwide.\nHistory\nRainer Gläß and Stephan Kronmüller founded G&K Datensysteme GmbH in Schöneck/Vogtland in 1990. After successful growth, the company was converted into a stock corporation in 2001, and in 2008 went public in the Prime Standard of Deutsche Börse.\nSolquest Gmbh was acquired by GK in 2009. That same year, SAP initially took over the distribution of two products. This has now extended to five products, whose distribution is aimed globally since 2013.\nIn 2010, CEO Rainer Gläß was awarded the Ernst & Young business award as entrepreneur of the year. The Munich Strategy Group awarded GK Software a third place rank on the list of the most successful German mid-size enterprises in 2013.\nIn 2012, the acquisition of the AWEK Group considerably reinforced the services business segment of the company.\nIn 2015, GK Software acquired the retail segment of DBS Data Business Systems Inc, a US-based Point of Sale software specialist. In the fall of 2017, GK Software announced that it would acquire a majority stake in AG's prudsys. The company with Chemnitz and Berlin locations is specialized in creating real-time personalization products in retail software. Artificial intelligence is used for this purpose.\nDeutsche Fiskal is a wholly owned subsidiary of GK Software and was founded in 2019 to develop and operate an open cloud solution to implement legal requirements within the framework of German fiscalization. Since April 1, 2025, Deutsche Fiskal GmbH has no longer been part of the GK Group; the Austrian company fiskaly GmbH acquired the company\n2020 saw the founding of retail7 GmbH, which develops and sells a cloud POS system optimized for small and medium-sized companies. In addition to the Schöneck headquarters, there are additional locations in Berlin, Jena, Pilsen, and Johannesburg.\nIn January 2020, GK Software announced a technology partnership with Kronos Incorporated to embed Workforce Dimensions suite into the OmniPOS platform.\nSince September 2022, prudsys AG has been trading as GK Artificial Intelligence for Retail AG within the GK Group.\nOn January 10, 2025, GK Software acquired the deep tech and computer vision company Nomitri GmbH. As a wholly owned subsidiary of GK, the company develops visual AI solutions for self-checkout.\nIn 2023, Fujitsu ND Solutions AG became the new strategic investor and majority owner of GK Software SE.\nMichael Scheibner was appointed by the supervisory board of GK Software as the new CEO and chairman of the executive board, effective June 1, 2023.\nIn 2023, after fifteen years on the capital market, the shares of GK Software SE were delisted from Deutsche Börse Frankfurt Stock Exchange and other German stock exchanges at the end of August 1, 2023.\nOperations\nThe company maintains fifteen locations in Germany, as well as in South Africa, the United States, Ukraine, Switzerland, Singapore, France, Australia and in the Czech Republic.\nThe company distributes standard and cloud-based software solutions for the retail industry under the name GK CLOUD4RETAIL. This includes software for Point of Sale (POS), Backoffice, merchandise management, Store Device Control, sales promotion, administration of vouchers, automatic label printing, Open Scale and Monitoring.\nReferences"
    }
  ]
}