{
  "content": [
    {
      "type": "text",
      "text": "# Gladstone and Hawarden Apartment Buildings\n\n| locmapin      = United States Washington, D.C.\n| built         =\n| architect     = George S. Cooper\n| architecture  = Romanesque Revival\n| added         = September 7, 1994\n| area          = less than one acre\n| partof        = Greater Fourteenth Street Historic District\n| partof_refnum = 94000992\n| refnum        = 94001034\n}}\nThe Gladstone and Hawarden Apartment Buildings are historic twin buildings located in the Logan Circle neighborhood of Washington, D.C.  Built in 1900 and 1901, the Gladstone and Hawarden are early examples of middle class apartment buildings in the city.  They were designed in the Romanesque Revival architectural style by prominent local architect George S. Cooper.  The buildings, since converted into condominiums and a housing cooperative, were added to the National Register of Historic Places (NRHP) in 1994.\nHistory\nOn July 7, 1900, a building permit was issued to L. S. Fristoe and S. G. Connell for the construction of an apartment building at 1423 R Street NW.  The 20-unit building was named the Gladstone in honor of Prime Minister William Ewart Gladstone.  The following year on July 2 another permit was issued to the Gladstone Apartment House Company for an identical apartment building to be located at 1419 R Street NW.  The second 20-unit building, the Hawarden, was named for Gladstone's former estate, Hawarden Castle.  It is unknown why the developers chose to name the buildings after Gladstone and his estate, but according to author and historian James M. Goode, \"Anglophilia current at the time in Washington may offer an explanation.\"  Both buildings were constructed by John H. Nolan, a local real estate developer and builder whose works include the Bond Building, listed on the NRHP.  The architect was George S. Cooper, who designed 24 apartment buildings in the city between 1892 and 1909.  Several of his works are listed on the NRHP, including the Bond Building, Jefferson Apartment Building, Lafayette Apartment Building, and George Washington University's President's Office.  The 1903 book History of the City of Washington states: \"It may be thought that Mr. Cooper's forte lies in the designing of apartment houses, since the handsomest in the city are a result of his genius...\" and \"No young man has played a more important part in the active growth and great development of Greater Washington than George S. Cooper...\"\nThe Gladstone and Hawarden were the first twin apartment buildings constructed in the city and among the first apartment buildings in Washington, D.C. designed specifically for middle class citizens.  Following World War II, the area between 14th and 15th Streets, between Massachusetts and Florida Avenues, experienced a dramatic demographic shift.  The Hawarden, which had become an apartment building for working class whites, was converted into a co-op in 1949 for middle class black citizens.  The residents paid $7,000 for rear apartments and $9,000 for units facing the street.  The Gladstone continued serving as apartments for several decades until its conversion into a condominium building.  The buildings were added to the District of Columbia Inventory of Historic Sites on January 17, 1990, and the NRHP on September 7, 1994.  The pair is also designated as contributing properties to the Greater Fourteenth Street Historic District, listed on the NRHP on November 9, 1994.\nArchitecture\nThe Gladstone and Hawarden are Romanesque Revival brick buildings which also feature Queen Anne style elements on the facades.  They are five stories tall and originally featured 20 units each.  The units consisted of four rooms, a kitchen, bathroom, and a long hall.  The buildings, which are approximately  wide,  long, and  tall, are on the north side of R Street and a small grassy area separates the pair.  The foundations are made of Portland cement, brick, and broken stone.  The facades feature two four-story polygonal bays while the sides feature five-story polygonal bays.  The names of the buildings are in friezes above the front entrances.\nSee also\n* National Register of Historic Places listings in Washington, D.C.\nReferences\nExternal links\n*"
    }
  ]
}