{
  "content": [
    {
      "type": "text",
      "text": "# GLAM (cultural heritage)\n\nin Paris]]\nGLAM is an acronym for galleries, libraries, archives, and museums, and refers to cultural institutions with a mission to provide access to knowledge. GLAMs collect and maintain cultural heritage materials in the public interest. As collecting institutions, GLAMs preserve and make accessible primary sources valuable for researchers.\nVersions of the acronym include GLAMR, which adds records management, and the earlier form LAM, which did not specify galleries (due to being seen as a subset of museums, or else potentially confused with commercial establishments where art is bought and sold). Another form is GLAMA, which specifies academia, or GLEAM, which adds education.\nHistory\nAs an abbreviation, LAM has been in use since the 1990s; it emerged as these institutions saw their missions overlapping, creating the need for a wider industry sector grouping. This became more apparent as they placed their collections online, with artworks, books, documents, and artifacts all effectively becoming \"information resources\".\nSome argue that this grouping is a return to the original forms of these institutions, in that they share epistemological links dating from the Mouseion of Alexandria and continuing through the cabinets of curiosities gathered in early modern Europe. Over time as collections expanded, they became more specialized and their housing was separated according to forms of information and kinds of users. Furthermore, during the nineteenth and twentieth centuries, distinct professional associations and educational programs developed for each kind of institution.\n\"Open GLAM\" is a term that has gained popularity since 2010 to describe a network for exchange and collaboration between cultural institutions supporting open access to their digitised collections. The work to get GLAM sector collections online has been supported by organizations such as GLAM Peak in Australia and the National Digital Forum in New Zealand. The GLAM–Wiki Initiative helps cultural institutions share their freely licensed resources through collaborative projects with Wikipedia editors. Open GLAM and open data resources from the heritage sector are now frequently used in research, publishing, and programming, particularly in digital humanities research and teaching.\nResearch\nQueer GLAM has emerged as an area of focus within the field; for example, Robert Mills theorizes what the queer museum might look like, using queer theory to conceptualize it. Some scholars also complicate the archiving practices of GLAM institutions and seek to better represent the queer experience within these institutions.\nIn a similar vein, scholars have argued that GLAM institutions need to grapple with their colonial history and the ways this continues to impact their practice today. Work tracing the role of white women in the library is one example of this.\nIn recent years, libraries, archives, and museums (LAMs) have rapidly evolved: digitizing collections, blending materials, and taking on new roles. Libraries can run makerspaces, archives address climate and social justice, and museums drive economic and urban development. Though these changes may seem to push LAMs in divergent directions, recent research focused on Scandinavia finds that they are actually converging in purpose and function.\nReferences\nExternal links\n*[https://www.oclc.org/research/activities/lamsurvey.html Library, Archive and Museum Collaboration] research project by OCLC"
    }
  ]
}