{
  "content": [
    {
      "type": "text",
      "text": "# Glamour Awards\n\n| website =\n}}\nThe 'Glamour Awards' is an annual set of awards hosted by Glamour magazine. Woman of the Year awards honour \"extraordinary and inspirational\" women from a variety of fields, including entertainment, business, sports, music, science, medicine, education and politics. There is also an award handed out each year called the Man of the Year for men.\nWinners\n1999\n*Woman of the Year – Jennifer Lopez\n2000s\n2001\n* Woman of the Year\n* Salma Hayek\n* Susan Stroman\n*Moira Smith\n2002\n* Oral Lee Brown\n2003\n}}\n2004\n}}\n2005\n}}\n2006\n}}\n2007\n}}\n2008\n}}\n2009\n}}\n2010s\n2010\n}}\n2011\n}}\n2012\n}}\n2013\n}}\n2014\n}}\n2015\n25th Anniversary.\n2017\nReferences:\n2018\nReferences:\n2019\n* Greta Thunberg\n2023\nReferences:\n* Women of the Year - Geena Rocero, Mary J. Blige, Brooke Shields, Quinta Brunson, America Ferrera and Millie Bobby Brown\n* Daring to Disrupt - Selma Blair\n2024\n*Women of the Year – Serena Williams, Pamela Anderson, Suni Lee, Sydney Sweeney, Taraji P. Henson, Allyson Felix, Hadley Duvall and Kaitlyn Joshua.\n*Music Icon - Kesha\n*Rising Star – Say Now\n2025\nReferences:\n* Global Women of the Year – Demi Moore and Tyla\n* UK & UK Woman of the Year – Rachel Zegler\n* Women of the Year – Ms. Rachel, Pat McGrath and five Women's National Basketball Association players: Lexie Hull, Napheesa Collier, Jonquel Jones, Nyara Sabally and Satou Sabally\nCriticism\nAfter Glamour announced that it would be giving an award to Caitlyn Jenner in November 2015, the husband of New York police officer Moira Smith returned the \"Woman of the Year\" award that Glamour had awarded her, with an open letter to Cyndi Lieve, the magazine's editor-in-chief. Jenner decided to return the award, in 2024.\nSee also\n* List of awards honoring women\n*Glamour\nExternal links\n* [http://www.glamour.com/ Official website (US)]\n* [http://www.glamourmagazine.co.uk/ Official website (UK)]\nReferences"
    }
  ]
}