{
  "content": [
    {
      "type": "text",
      "text": "# Glanmire, Queensland\n\n| local_map           = yes\n| zoom                = 13\n| pop                 = 28\n| pop_year            =\n| pop_footnotes       =\n| established         =\n| postcode            = 4570\n| area                = 2.2\n| timezone            = AEST\n| utc                 = +10:00\n| dist1               = 6.5\n| dir1                = SSE\n| location1           = Gympie CBD\n| dist2               = 165\n| dir2                = N\n| location2           = Brisbane\n| dist3               =\n| dir3                =\n| location3           =\n| dist4               =\n| dir4                =\n| location4           =\n| lga                 = Gympie Region\n| stategov            = Gympie\n| fedgov              = Wide Bay\n| near-n              = Monkland\n| near-ne             = Mothar Mountain\n| near-e              = Woondum\n| near-se             = Woondum\n| near-s              = Kybong\n| near-sw             = The Dawn\n| near-w              = Monkland\n| near-nw             = Monkland\n}}\nGlanmire is an urban industrial locality in Gympie in the Gympie Region, Queensland, Australia. In the , Glanmire had a population of 28 people.\nGeography\nGlanmire is  south-east of Gympie's central business district via Bruce Highway. It is bounded by the North Coast railway line to the northeast, Six Mile Creek to the east and southeast, Mary River to the south-west and Hall Road to the north-west. It contains the Gympie Industrial Estate.\nThe Bruce Highway enters the locality from the south (Kybong) and exits to the north (Monkland).\nHistory\nThe locality was named after the town of Glanmire, County Cork, Ireland.\nIn 2018, Six Mile Oval was renamed Ray Warren Oval in recognition of Ray Warren who had been involved with the local Aussie Rules team, the Gympie Cats, for 37 years.\nDemographics\nIn the , Glanmire had a population of 160 people.\nIn the , Glanmire had a population of 20 people.\nIn the , Glanmire had a population of 28 people.\nEducation\nThere are no schools in Glanmire. The nearest government primary school is Monkland State School in neighbouring Monkland to the north. The nearest government secondary school is Gympie State High School in Gympie to the north.\nAmenities\nRay Warren Oval (formerly Six Mile Oval) is host to the Gympie Cats, who play in the AFL Bundaberg-Wide Bay league. It is at 610 Bruce Highway ().\nAttractions\nThe Six Mile Creek Rest Area is a grassed riverside reserve at 612 Bruce Highway in the south of the locality () which contains barbecues and toilets allowing trucks and caravans to stop overnight.\nReferences"
    }
  ]
}