{
  "content": [
    {
      "type": "text",
      "text": "# Glen Cove Gurdwara\n\nGlen Cove's Gurdwara Mata Sahib Kaur is a Sikh Gurdwara or temple in Glen Cove on Long Island, New York. It has an area of 15 acres near Long Island Sound. Gurdwara Sahib attracts an average weekly congregation of 200 families from the surrounding area. As of 2017, the head granthi was Paramjit Singh.\nBuildings\nThe main building is  built-up area, 20 rooms and three halls. There is a secondary building with a five-bedroom house as the residence of sewadars. The property was purchased for $1.2 million to make a gurdwara.\nHistory\nIt was founded by the Sikhs of Long Island, New York when they felt that they needed a larger facility. It separated from Gurdwara [https://www.storzerlaw.com/cases/42 Guru Gobind Singh Sikh Center] Plainview. The first head priest was Singh Sahib Gyani Jagtar Singh Jachak. Bhai Sahib left to serve again as an international Kathakaar.\nGurdwara events\nGurdwara Sahib have Ragi Jathas by each month and [https://www.sachasaudakhalsa.com/gurbani-vichar Gurbani Vichar] is done by Sikh preachers.\nIt has weekly services and celebrates Gurpurabs:\n* Informal Diwan on Fridays from 7 to 8:30pm\n* Formal weekly services on Sundays from\n** 10 am with Sukhmani Sahib\n** 11-12:15 Asa Di Var\n** 12:15-12:45 Gurbani Katha\n** 12:45-1 Kids Program\n**1-1:30 Shabad Kirtan\n*Finished with Guru Ka Langar\nPeople and associations\nPresently the granthi is Bhai Paramjit Singh. Sewadars of Gurdwara Sahib are Bhai Swinder Singh and Bhai Navdeep Singh. The president of Gurdwara Sahib is Sardar Harbinder Singh Sachdev and secretary is Sardar Mohan Singh Kabuli.\nAssociations and organizations associated with Gurdwara Sahib are East Punjab Sikh Society, Itshi Ladies Satsang, Sikh Missionary College, International Sikh Women's Council, American Sikh Prabhandak Committee, World Sikh Council, Akhand Keertani Jatha, The Sikh Coalition, and the Long Island Keertan Project.\nReferences"
    }
  ]
}