{
  "content": [
    {
      "type": "text",
      "text": "# Glenden, Queensland\n\n| pop                 = 477\n| pop_year            =\n| pop_footnotes       =\n| established         =\n| postcode            = 4743\n| area                = 365.2\n| timezone            = AEST\n| utc                 = +10:00\n| dist1               = 117\n| dir1                = N\n| location1           = Moranbah\n| dist2               = 166\n| dir2                = W\n| location2           = Mackay\n| dist3               = 1028\n| dir3                = NNW\n| location3           = Brisbane\n| dist4               =\n| dir4                =\n| location4           =\n| lga                 = Isaac Region\n| stategov            = Burdekin\n| fedgov              = Capricornia\n| near-n              = Turrawulla\n| near-ne             = Turrawulla\n| near-e              = Hail Creek\n| near-se             = Elphinstone\n| near-s              = Burton\n| near-sw             = Eaglefield\n| near-w              = Suttor\n| near-nw             = Newlands\n}}\nGlenden is a mining town and rural locality in the Isaac Region, Queensland, Australia.\nIn the , the locality of Glenden had a population of 477 people. The population subsequently declined rapidly, when the local mine changed its roster to a seven-days-on, seven-days-off roster, and is expected to continue to do so. Many residents are relocating to towns like Proserpine that offer a more stable environment.\nHistory\nGlenden was constructed by the Mount Isa Mines company (now Glencore) to provide accommodation for workers at their Newlands coal mine. The site, 30 kilometres from the mine, was chosen in 1981 and was constructed by the company and then given to the Shire of Nebo (which was amalgamated in 2008 to become Isaac Region) to administer.\nGlenden State School opened on 25 January 1982.\nGlenden Post Office opened circa 1983.\nGlenden Christian School opened on 5 January 1995 but closed on 3 February 1997.\nIn 2023, there was outrage when it was announced that the town of Glenden would be demolished as it was a requirement of the original mine approval that a complete rehabilitiation of the area was undertaken when the mine closed. This announcement came at a time of high levels of homelessness in Queensland due to a shortage of homes. On 18 August 2023, the Queensland Premier Annastacia Palaszczuk announced that legislation would be enacted to prevent the demolition of the town.\nDemographics\nIn the , the locality of Glenden had a population of 1,308 people.\nIn the , the locality of Glenden had a population of 620 people.\nIn the , the locality of Glenden had a population of 477 people.\nEconomy\nThe mine is the major employer in the town. The surrounding rural areas are mostly cattle grazing stations.\nEducation\nGlenden State School is a government primary and secondary (Prep–12) school for boys and girls at Gillham Terrace (). In 2013, the school had 317 students and 25 teachers (24 full-time equivalent). In 2018, the school had an enrolment of 91 students with 15 teachers (14 full-time equivalent) and 12 non-teaching staff (8 full-time equivalent).\nFacilities\nGlenden Police Station is at 8 Bell Place ().\nGlenden Fire Station is at 2 Bell Place ().\nGlenden Primary Health Care Centre is at 4 Bell Place (). Glenden Ambulance Station is also located there ().\nGlenden Water Treatment Plant is on Usher the south-west of the town (). Glenden SES Facility is within the water treatment site on the south-east corner on Usher Street ().\nAmenities\nThe Isaac Regional Council operates a public library in Glenden Shopping Centre in the Town Centre on Ewan Drive (). The council also operates the Glenden Recreation Centre in the Town Centre (). It also provides tennis and basketball courts off Bell Place (), the Maddern Oval on Gilbert Avenue, and the Glenden Swimming Pool at 21 Bell Place ().\nSt Paul's Anglican and Catholic Church is on the western corner of Perry Drive and Bell Place ().\nGlenden Golf Club is an 18-hole golf course at the end of Golf Club Road ().\nReferences\nExternal links\n*"
    }
  ]
}