{
  "content": [
    {
      "type": "text",
      "text": "# Global Indian Music Academy Awards\n\nThe Global Indian Music Academy Awards (also known as the GiMA Awards) are presented annually by Global Indian Music Academy to honour and recognise Hindi-language music. The nominees are voted by GiMA's jury, who have some of the most respected artistes in the country. Global Indian Music Academy Awards honor both film and non-film music in separate categories.\nThe awards ceremony was first televised in 2010 and has been presented annually ever since, except for 2013. In 2013, nominees for the awards were announced though no ceremony was held to honor the winners. The 4th GiMA Awards ceremony was held on 20 January 2014 at National Sports Club of India Stadium.\nHistory\nThe 1st edition of Global Indian Music Academy Awards was held on 10 November 2010 at Yash Raj Studios in Andheri. In its first edition, Asha Bhosle presented the Lifetime Achievement Award to her sister Lata Mangeshkar. The show was hosted by Sajid Khan, Shreyas Talpade and Dia Mirza. A total of 29 awards under Film and non-film categories were presented. The 2nd Chevrolet Global Indian Music Academy Awards was held on 30 October 2011 in Gurgaon which was hosted by Ranveer Singh and Neha Dhupia. With a total of 31 awards, the edition introduced a new category of Pop-Rock Single.\nThe 3rd edition of the award ceremonies held on 1 October 2012, was hosted by Parineeti Chopra and Saif Ali Khan at Yash Raj Studios, Mumbai. No winners were announced for 4th edition of Global Indian Music Academy Awards which was supposedly be held in 2013, though nominations were announced for the categories. 4th GiMA Awards was hosted by actor Ranveer Singh who earlier hosted along with Dhupia. The show was held at National Sports Club of India Stadium on 20 January 2014.\n{| class=\"wikitable\"\n!  Ceremony\n!  Date\n!  Venue\n!  Host(s)\n|-\n! scope=\"row\" | 1st GiMA Awards\n| 10 November 2010\n| Yash Raj Studios\n| Sajid Khan, Shreyas Talpade, Dia Mirza & Parineeti Chopra\n|-\n! scope=\"row\" | 2nd GiMA Awards\n| 30 October 2011\n| Gurgaon\n| Ranveer Singh, Neha Dhupia & Salman Khan\n|-\n! scope=\"row\" | 3rd GiMA Awards\n| 1 October 2012\n| Yash Raj Studios\n| Parineeti Chopra, Saif Ali Khan\n|-\n! scope=\"row\" | 4th GiMA Awards\n| 20 January 2014\n| National Sports Club of India Stadium\n| Ranveer Singh\n|-\n! scope=\"row\" | 5th GiMA Awards\n| 24 February 2015\n| Film City, Mumbai\n|Mika Singh\n|-\n! scope=\"row\" | 6th GiMA Awards\n| 6 April 2016\n| Film City, Mumbai\n| Ayushmann Khurrana\n|-\n! scope=\"row\" |\n|\n|\n|}\nAwards\nFilm Music awards\nNon-Film Music awards\nRecords and facts\n;Most awards to a single film\n* Aashiqui 2 (2013) = 6/13\n* Dabangg (2010) = 6/12\n* Rockstar (2011) = 6/11\n;Most composing awards (Best Music Arranger and Programmer + Best Background Score + Best Music Director)\n* Shankar–Ehsaan–Loy (1+2+0)/(4+4+3) = 3/11\n* A. R. Rahman (0+1+1)/(2+4+2) = 2/8\n* Amit Trivedi (1+0+1)/(1+2+2) = 2/5\n;Most playback singer – female (Best Female Playback Singer + Best Duet)\n* Shreya Ghoshal (2+1)/(7+5) = 3/12\n* Sunidhi Chauhan (1+0)/(6+1) = 1/7\n;Most playback singer – male (Best Male Playback Singer + Best Duet)\n* Arijit Singh (2+2)/(7+3) = 4/10\n* Mohit Chauhan (2+0)/(5+0) = 2/5\nReferences"
    }
  ]
}