{
  "content": [
    {
      "type": "text",
      "text": "# Global Accessibility Awareness Day\n\nGlobal Accessibility Awareness Day (GAAD) is a consciousness-raising awareness day focusing on digital access and inclusion for the more than one billion people alive today who live with disabilities or impairments. It is marked annually on the third Thursday of May.\nIn 2018, in addition to a number of virtual events marking GAAD, there were events open to the public in at least nineteen countries on six continents.\nAccording to the Global Accessibility Awareness Day website, \"The purpose of GAAD is to get everyone talking, thinking and learning about digital (web, software, mobile, etc.) access or inclusion and people with different disabilities.\" Local Global Accessibility Awareness Day events sometimes showcase how people with disabilities use the web and digital products using assistive technologies, or assist people creating technology products in taking into consideration the needs of certain disabilities.\nGlobal Accessibility Awareness Day launched in May 2012. It was inspired by a blog post from November 2011 by Los Angeles–based web developer Joe Devon. Devon worked with Jennison Asuncion, an accessibility professional from Toronto, to co-found GAAD.\nEvents\nExamples of local Global Accessibility Awareness Day events include:\n* Since 2012, the [https://www.meetup.com/Los-Angeles-Accessibility-and-Inclusive-Design-Group/ Los Angeles Accessibility and Inclusive Design Group] , led by Joseph O'Connor has organized a GAAD event.\n* Minnesota IT Services has encouraged employees to perform their jobs for 15 minutes without using a mouse.\n* In 2015, a one-day conference was hosted in Ottawa by OpenConcept Consulting, to celebrate GAAD.\n* In 2016, a one-day conference was hosted by Carleton University and organized by [http://a11yyow.ca/ A11yYOW] , Ottawa's accessibility Meetup.\n* In 2017, Apple released a series of videos and organized a concert as part of a week-long series of events marking Global Accessibility Awareness Day.\n* In 2017, the University of California, San Francisco offered a website accessibility testing clinic.\n* In 2017, a GAAD event in Ottawa featured speakers from Carleton University, the Canadian government and the Ottawa area.\n* In 2018, there were a series of events planned in Hyderabad and Bangalore, India.\n* In 2018, an evening event was hosted in Ottawa by OpenConcept Consulting and we had a live chat with participants in Accessibility Twin Cities, who were also celebrating GAAD.\n* In 2020, the Government Digital Service in the United Kingdom ran a day of online-only events to raise awareness of digital accessibility.\nSee also\n*Computer accessibility\n*Design for All\n*Design for All (in ICT)\n*Fix the Web\n*Hackathon\n*Knowbility\n*Inclusion (value and practice)\n*Section 508 Amendment to the Rehabilitation Act of 1973\n*Universal design\n*Universal usability\n*Web accessibility\nReferences\n*\nExternal links\n* [http://globalaccessibilityawarenessday.org/ Global Accessibility Awareness Day website]\n* [https://gaad.foundation/ GAAD Foundation]"
    }
  ]
}