{
  "content": [
    {
      "type": "text",
      "text": "# Global War (board game)\n\nGlobal War, subtitled \"The War Against Germany and Japan, 1939–45\", is a grand strategic and economic board wargame published by Simulations Publications Inc. (SPI) in 1975 that simulates the entire extent of World War II.\nDescription\nGlobal War is a two-player \"monster\" game (more than 1,000 counters) in which one player controls the Allies and the other player controls Axis forces. Players each decide what war equipment they will manufacture, and this choice then informs what strategic actions the player is able to take. For example, concentrating on submarine production will mean fewer tanks will be available for land combat.\nComponents\nThe game includes:\n* two 21\" x 22\" paper hex grid maps which together display the entire world, scaled at 300 mi (480 km) per hex\n* 1200 die-cut counters\n* rules booklet\n*player charts and aids\n*small six-sided die\nGameplay\nRather than the traditional alternating \"I Go, You Go\" system of movement and combat, Global War uses a complex and integrated system of Stages in which both players have various opportunities to act. This includes a Naval Stage, an Air Stage, a Land Stage, and a Production Stage. Each Stage is further broken into several Phases. For example, the Naval Stage has the following Phases:\n*First Axis Movement and Combat Phase;\n*First Allied Movement and Combat Phase;\n*Second Axis Movement and Combat Phase;\n*Second Allied Movement and Combat Phase;\n*Third Axis Movement and Combat Phase;\n*Third Allied Movement Phase.\nCompleting the four Stages completes one game turn, which represents 3 months (1 season) of game time.\nScenarios\nThe game comes with two scenarios:\n* \"Standard Scenario\": The entire war, beginning in Fall 1939 (Turn 1), and ending in Spring 1945 (Turn 23)\n*\"High Water Mark Scenario\": A shorter scenario, as the game begins with the Axis at its greatest geographical extent in Summer 1942 (Turn 12)\nPublication history\nGlobal War was designed by Jim Dunnigan, with graphic design by Redmond A. Simonsen, and was published by SPI in 1975 in a \"flatpack\" box. The game appeared at No. 2 on SPI's Top Ten Games list the month it was published, and stayed in the Top Ten for six months.\nReception\nIn the 1977 book The Comprehensive Guide to Board Wargaming, Nicholas Palmer commented that the game was \"One of the giant-sized species beloved of the hard-core.\" Although Palmer admired the innovative and \"ingenious production system,\" he called the game \"A tremendous challenge to both sides.\" He questioned game balance, noting that \"Defence is thought rather overfavoured by some players, making a German invasion of the Soviet Union or an Allied liberation of France an imposing task against good play.\" He concluded with a warning that the game was \"Highly complex.\"\nIn Issue 30 of Moves, Michael Simonds commented that \"Global War is today the only grand strategic simulation of all of World War II. In most cases it succeeds admirably in reflecting the strategic choices facing the national leaders in that conflict.\" But Simonds felt the game fails to properly simulate the conduct of Vichy France, and wrote an extensive review of rules that could be changed to better reflect this.\"\nIn The Guide to Simulations/Games for Education and Training, Martin Campion thought that \"This is a very ambitious and valuable game, but it does not succeed in simulating World War II in a convincing fashion. The scale is too small, the naval rules are either too constricting or much too permissive.\" He concluded on an ambiguous note, saying, \"I recommend this game — not so much for playing as it is, but for use as a source of inspiration for designing variant or alternate games on the same subject.\"\nOther reviews and commentary\n*Strategy & Tactics No. 48\n*Fire & Movement No. 73\n*JagdPanther No. 15\n*Spartan Simulations Gaming Journal No. 11\n*Panzerschreck No. 10\n*The American Wargamer Vol.2 No. 10 & No. 11\n*Pursue & Destroy Vol.1 No. 4\nReferences"
    }
  ]
}