{
  "content": [
    {
      "type": "text",
      "text": "# Global Civilization Initiative\n\nThe Global Civilization Initiative (GCI, ) is a diplomatic initiative of the People's Republic of China presented by Xi Jinping in 2023. It complements the Global Security Initiative (GSI) and the Global Development Initiative (GDI) and serves to establish a multipolar world order and to \"seek progress for humanity and harmony for the entire world\".\nConcept\nIn March 2023, Chinese president Xi Jinping presented the initiative in a speech in Beijing, which is largely based on his thought on diplomacy.\nAs steps to implement its initiative, China began to expand youth exchange programs and to grant visa-free entry to citizens of a number of countries to strengthen its soft power. In addition to Thailand, the Maldives and the United Arab Emirates, these also included Western countries such as France, Germany and Italy.\nReception\nWestern think tanks such as the Atlantic Council interpreted the initiative as an attempt to replace the “universal values” propagated by Western states, such as democracy and human rights, with absolute national sovereignty and “traditional values”. The Heritage Foundation saw China's positioning as part of a global “cultural war” in which initiatives such as the GCI are intended to help it to win over the global south and to achieve its own “cultural hegemony” over a West that the Chinese leadership views as decadent. An opinion piece in The Diplomat noted that Xi's proclaimed rejection of aggressive hegemony does not fit with China's policies towards its neighbors in the South China Sea, nor does its persecution of Uyghurs with its professed “respect for diversity.”\nChinese state media responded to the initiative with the enthusiasm that could be expected. The Global Times, for example, dedicated a series of articles titled “Xivilization”, alluding to Xi Jinping's family name. The initiative has been well received in some global south countries. The Pakistani Institute of Strategic Studies Islamabad called it “important idea aimed at shaping the future for a better world”. Institute of Strategic Studies Islamabad |url=https://issi.org.pk/issue-brief-on-xiplomacy-chinas-global-civilization-initiative/}}\nSee also\n* Foreign policy of China\n* Community of Common Destiny\n* Civilization state\nReferences"
    }
  ]
}