{
  "content": [
    {
      "type": "text",
      "text": "# Gloria Stewart\n\n| birth_place = Larchmont, New York, U.S\n| death_date =\n| death_place = Beverly Hills, California, U.S\n| occupation = Model\n| alma_mater = Finch School\n| spouse = |}}\n| children = 4\n}}\nGloria Rankin Stewart (née Hatrick, formerly McLean ; March 10, 1918 – February 16, 1994) was the wife of actor James Stewart.\nEarly life\nGloria was born on March 10, 1918, to Edgar B. Hatrick of Larchmont, New York. Her family spent the summers at The Broadmoor hotel and resort. She attended the Finch School in New York and spent two years studying drama.\nPersonal life\nFirst marriage\nOn August 16, 1943, she married Edward Beale McLean Jr., a son of heiress Evalyn Walsh McLean and Edward Beale McLean, heir to The Washington Post. McLean, whose mother had owned the Hope diamond, had previously been married to Ann Carroll Meem, of Washington, D.C., from May 1938 to July 1943. Together, Edward and Gloria had two sons: Ronald (born 1944) and Michael (born 1946). Ronald died on June 8, 1969, aged 24, in Vietnam as a commissioned Marine officer.\nIn January 1948, Gloria and Edward divorced and in October of that year, he married Manuela \"Mollie\" Hudson, the former wife of Alfred Gwynne Vanderbilt Jr.\nSecond marriage\n, her sons, and her and Stewart's daughters, August 1954]]\nOn August 9, 1949, Gloria married James Stewart, who adopted both children from her first marriage, Ronald, then age five, and Michael, age three. Together, she and Stewart had twin daughters born on May 7, 1951: Judy and Kelly. Kelly Stewart became an anthropologist.\nAccording to her obituary in the Los Angeles Times, Gloria \"was active on the boards of the Greater Los Angeles Zoo Association, Natural History Museum, African Wildlife Foundation and St. John's Medical Center, and was a regular at charity dinners, dances and other events supporting those groups [...] She shared her husband's interests in skeet shooting, fishing, animals and travel. A fan magazine in 1985 called their partnership 'Dream Factory's Outstanding Marriage. From the 1950s onward, Gloria was a supporter of conserving big-game animals, rather than hunting them, and in time brought her husband around to the same viewpoint.\nThe couple remained married until she died of lung cancer on February 16, 1994, at the age of 75.\nReferences\nExternal links\n*"
    }
  ]
}