{
  "content": [
    {
      "type": "text",
      "text": "# Goal III: Taking on the World\n\n| producer       =\n| starring       =\n| cinematography = George Tiffin\n| editing        = Giles Bury\n| music          = Mark Thomas\n| studio         = Milkshake Films\n| distributor    = Metrodome Distribution\n| released       =\n| runtime        = 92 minutes\n| country        = United Kingdom\n| language       = English\n| gross =  $7,641\n}}\nGoal III: Taking on the World (also known as Goal III) is a 2009 sports drama film directed by Andy Morahan and written by Mike Jefferies, Piers Ashworth, and Jonathan Ezekiel. The sequel to Goal! (2005) and Goal II: Living the Dream (2007), serves as the third and final installment in the Goal! trilogy. Goal III: Taking on the World stars Kuno Becker, JJ Feild, Leo Gregory, Nick Moran, and Tamer Hassan. In the film, Santiago Muñez (Becker) and his club teammates Liam Adams (Feild) and Charlie Braithwaite (Gregory) prepare for the 2006 FIFA World Cup. Aside from Becker, none of the other cast from the predecessors returned, while Santiago himself was reduced to a supporting role.  Goal III: Taking on the World was released in the United Kingdom straight to DVD and Blu-ray by Metrodome Distribution on 15 June 2009. The film was negatively received by fans.\nGoal III: Taking on the World was the only film in the Goal film series to not be distributed by Buena Vista International in the United Kingdom.\nPlot\nSantiago Muñez, Liam Adams, and Charlie Braithwaite film a commercial for the upcoming 2006 FIFA World Cup in Germany. After the shoot, Liam's agent Nick Ashworth informs him that his contract with Real Madrid would not be renewed. As a result, Liam returns to his former club, Newcastle United. Charlie is cast in a film and the trio travel to Romania for filming. There, Charlie develops a relationship with Sofia Tardelli, an Italian actress, while Liam is informed he and Charlie have been selected for England's World Cup squad.\nAs the three and Sofia travel in a taxi, they are side-swiped by another vehicle and taken to a local hospital. Liam, Sofia, and Charlie suffer minor injuries, but Santiago suffers cracked ribs and a broken arm, ruling him out of the upcoming World Cup. After brokering Liam's deal, Nick meets June, Liam's ex-partner, and her daughter, Bella; Nick correctly deduces Liam is the father. Liam goes to visit June, who dislikes his party lifestyle and secret alcoholism, and Liam runs out of the house in a panic after meeting Bella.\nLiam and Charlie travel to Germany for the World Cup, and after remaining on the bench for the opening two group stage games, Liam scores an equaliser against Sweden, assisted by a header from Charlie, and England qualify for the knock-out stages. Meanwhile, Charlie and Sofia become engaged. During a team dinner, Santiago reveals Nick has now become his agent, resulting in him signing a two-year contract with Tottenham Hotspur. The three travel to a local nightclub, where Liam flirts with Katja, but backs away out of guilt for leaving June.\nDuring the knockout game against Ecuador, Charlie is injured in a collision with Iván Hurtado and Iván Kaviedes and stretchered off the field. After the match, a 1-0 win for England, Charlie collapses in the changing room and dies en route to the hospital from an aneurysm previously unidentified from the car accident. As the football world mourn Charlie's death, Liam works to kick his alcohol dependency and become more active in Bella's life.\nAfter a goalless draw against Portugal in the quarter-finals, Liam is chosen as one of the England penalty takers. Liam's penalty is saved by Portuguese goalkeeper Ricardo while Cristiano Ronaldo converts the decisive spot kick as England are eliminated from the tournament. Upon returning to Newcastle, Liam and June get engaged, with Santiago serving as Best Man. During the wedding, the party make a toast in memory of Charlie.\nCast\n* Kuno Becker as Santiago Muñez\n* JJ Feild as Liam Adams\n* Leo Gregory as Charlie Braithwaite\n* Nick Moran as Nick Ashworth\n* Kasia Smutniak as Sophia Tardelli\n* Anya Lahiri as June\n* Tamer Hassan as Ronnie, one of the England coaches\n* Ori Pfeffer as Mad Film Director\n* John Salthouse as Newcastle United manager\n* Gary Lewis as Mal Braithwaite, Newcastle United coach\n* Tereza Srbova as Katja\n* Margo Stilley as Tamzin Adams, Liam's sister\n* Derek Williams as Sven-Göran Eriksson\nBecker and Lewis were the only returning members from the predecessors. Unlike the previous films where the sports sequences featured real players, the film solely features stock footage with no cameo appearances.\nProduction\nShooting took place in Nottingham over five weeks in October 2007.\nCritical response\nIn his review for the website Shadows on the Wall, Rich Cline gave the film 2 out of 5 stars and wrote: \"The conclusion of the officially sanctioned Fifa trilogy oddly shifts the attention away from the central character Santi to focus on two English players instead. The result is watchable and lively, but still a bit corny\".\nDisappointed by this film, some fans of the series asked for a remake.\nSee also\n* List of association football films\nReferences\nExternal links\n*"
    }
  ]
}