{
  "content": [
    {
      "type": "text",
      "text": "# GoBots: Battle of the Rock Lords__disambig_1\n\n| writer   = Jeff Segal\n| based_on   =\n| starring =\n| music = Hoyt Curtin\n| producer = Kay Wright\n| production_companies = Hanna-Barbera ProductionsTonka Corporation\n| distributor = Clubhouse Pictures\n| released =\n| runtime  = 71 minutes\n| country  = United States\n| language = English\n|  budget   =\n| gross    = $1.3 million\n}}\nGoBots: Battle of the Rock Lords is a 1986 American animated science fiction action film based on the GoBots line of toys. It was produced by Hanna-Barbera Productions (also responsible for the Challenge of the GoBots television series) and released to theaters in 1986 by Clubhouse Pictures, the last film the company released. It featured the first appearance of the Rock Lords, who were given their own toyline after the film.\nThese new characters featured the guest voices of Margot Kidder, Telly Savalas, and Roddy McDowall. The regulars from the cartoon series all reprised their roles.\nPlot\nThe Guardian GoBots are continuing their work on rebuilding their home planet of Gobotron when a mysterious ship crashes on the planet. Leader-1, Turbo, and Scooter investigate, and find it to be occupied by a pair of transforming robotic rocks with protosaur essences - Solitaire and her valet Nuggit. They have come seeking the Guardians' help to save their planet, Quartex, from the evil Rock Lord Magmar, who is killing the other Rock Lords in order to take their power sceptres. He places these in a machine designed to channel all their power into his own sceptre.\nThe Guardians agree to help, but the conversation is spied upon by the Renegade Fitor. Gobotron is soon attacked by the Renegade fleet, and Cy-Kill and a team of Renegades capture Solitaire, Small Foot and the GoBots' human allies Nick and A.J. With Nuggit as their guide, Leader-1, Turbo, Scooter, and Matt set off on a rescue mission.\nOn Quartex, after relieving a vanquished Rock Lord of his sceptre, Magmar now only requires three more to complete his own. One is held by the Lord of Fossils, another by Solitaire, and the last by Boulder and his forces; the only opposition left. His troops vote to attack Boulder and be done with him, but Boulder learns of the upcoming attack, and is able to launch an effective counter defence that sees Magmar on the verge of defeat.\nMeanwhile, Cy-Kill attempts to get information out of Solitaire, and despite her best efforts manages to link up with Magmar and strike an alliance, turning the battle against Boulder. The good Rock Lords flee, and after their defeat at the hands of the Renegades are initially very skeptical about the Guardians' intentions when they land on Quartex. Nuggit is able to convince Boulder and the rest of the Guardians true intentions and the two sides form an alliance.\nThe Renegades and Magmar soon attack in Thruster, and Leader-1 and Turbo engage in aerial combat, but receive damage that impairs their ability to fly or convert to vehicle mode. Thruster eventually withdraws on the belief that the Guardians and their allies have been wiped-out, but they survive and proceed towards the kingdom of Fossils before it is attacked. Cy-Kill and Magmar strike first and seize the Fossil Lord's sceptre, leaving our heroes at a loss on what to do next.\nMeanwhile on Rogue Star, after Nick and A.J. escape from their cell, they free Small Foot, and the three carry out various acts of sabotage before escaping in a Renegade Spacehawk fighter. They land on Quartex and hook up with Leader-1 and the rest. Cannibalizing the fighter for all its parts, Scooter is able to construct energy projectile weapons for Boulder and his troops, and fully repairs Leader-1 and Turbo.\nNow ready and with the element of surprise, the allies march on Stonehead, Magmar's fort. Meanwhile, Cy-Kill finally hands Solitaire's Sceptre to Magmar to fully power his own (Boulder's sceptre, which they believed lost and was described as necessary to Magmar's goals, is all but forgotten). Once the sceptre is powered, Cy-Kill and his Renegades make their move to seize it for themselves.\nSolitaire, who is present to be executed, escapes in the shoot-out, and rejoins Boulder and the rest as they finally crash the party. The Renegades flee with the stolen sceptre, but the Guardians pursue. Discovering that Thruster has been wrecked by the Guardians prior to their attack, Cy-Kill attempts to use Magmar's sceptre against them. But the energy discharges are too much and he is unable to control or even release his hold.\nA well-placed shot by Leader-1 separates the two, and the Renegades finally retreat while the sceptre's power disperses. Magmar and his minions remain at-large, but are no longer unopposed. With their mission complete, the Guardians bid farewell to the Rock Lords and return to Gobotron.\nCast\n* Michael Bell as Granite, Narligator, Slimestone\n* Foster Brooks as Fossil Lord, Stoneheart\n* Arthur Burghardt as Turbo, Cop-Tur, Talc\n* Ken Hudson Campbell as Vanguard\n* Philip Lewis Clarke as Crackpot, Herr Fiend, Tork\n* Peter Cullen as Pincher, Stones (of Sticks 'N' Stones), Tombstone\n* Ike Eisenmann as Nick Burns\n* Bernard Erhard as Cy-Kill\n* Dick Gautier as Brimstone, Bugsie, Klaws, Rock Narlie\n* Darryl Hickman as Hornet, Marbles\n* Margot Kidder as Solitaire\n* Marilyn Lightstone as Crasher\n* Roddy McDowall as Nuggit\n* Michael Nouri as Boulder\n* Morgan Paull as Matt Hunter\n* Lou Richards as Leader-1\n* Telly Savalas as Magmar\n* Leslie Speights as A.J. Foster\n* B.J. Ward as Small Foot\n* Kelly Ward as Fitor\n* Kirby Ward as Heat Seeker\n* Frank Welker as Scooter, Narliphant, Pulver-Eyes, Rest-Q, Sticks (of Sticks 'N' Stones), Zeemon\nReception\nThe film performed poorly, pulling in about $US1.3 million domestically. When released in Australia (as Machine Men: Battle of the Rock Lords, to tie in with the line's name in that territory), the only major chain to carry the film was Hoyts, with most other cinemas carrying the film locally tending to be independently owned.\nStephen Holden of The New York Times remarked that \"true to Saturday-morning cartoon tradition, GoBots is a jerky, semi coherent series of chases, laser-gun battles and explosions, with an allegorical plot about how no one can handle too much power\"; he noted that \"the good guys have squeaky cartoon voices and the bad guys deep, insinuating drawls.\"\nAnimation critic Charles Solomon of the Los Angeles Times wrote about the film:\n}}\nColin Greenland reviewed GoBots: Battle of the Rock Lords for White Dwarf #85, and stated, \"That gormless Hanna-Barbera style of drawing has a certain primitivist charm, I suppose. But 93 minutes? Gobots were last year's thing, anyway. All mine are broken.\"\nOn the website Rotten Tomatoes, GoBots: Battle of the Rock Lords has an approval rating of 20%, based on reviews from 5 critics. Metacritic gives the film a score of 30 out of 100, based on reviews from 4 critics, indicating \"Generally Unfavorable\" reviews.\nContinuation\nIt would be almost four decades before a continuation of the Challenge of the GoBots story would be made in the form of Transformers Collector Club online stories \"Renegade Rhetoric\". These were told from Cy-Kill's perceptive on a fictional second season, with some episodes taking place before and then after the movie. The Rock Lords returned in some stories and new characters were introduced.\nSee also\n* The Transformers: The Movie\nReferences\nExternal links\n*\n*"
    }
  ]
}