{
  "content": [
    {
      "type": "text",
      "text": "# God Save the Queen/Under Heavy Manners\n\n}}\nGod Save the Queen/Under Heavy Manners is the second solo album by British guitarist and composer Robert Fripp, released on E.G. Records in 1980.\nThe album largely consists of Frippertronics, with much of the work being performed by improvisation. On the Under Heavy Manners side of the album, the effect was modified in what Fripp described as \"Discotronics\", adding a solid drum beat and bass line to create a dance sound.\nThe design concept was by Fripp and Chris Stein, with Stein credited for the cover portrait.\nMusic\nFripp considered the Frippertronics of God Save the Queen and the \"Discotronics\"-based Under Heavy Manners as two independent pieces contained within one album, leading to the duality of the album's title and its two sides being designated as \"Side A\" and \"Side One.\"\nThe guitar loops for the five tracks were recorded live in concert during 1979 (including an appearance on The Midnight Special), with overdubs for the Under Heavy Manners side added later that year by Michael \"Busta\" Jones (bass guitar) and Paul Duskin (drums). All of the tracks on both sides are instrumental except for \"Under Heavy Manners\", which features vocals by David Byrne of Talking Heads (credited as \"Absalm el Habib\").\nThe track \"God Save the Queen\" bears little resemblance to the British national anthem, although it is based on its opening phrase. It was inspired by a comment from an audience member, who suggested that, as the performance was taking place on the tenth anniversary of the Woodstock Festival in August 1979, Fripp should reprise Jimi Hendrix's performance of \"The Star-Spangled Banner\".\nRelease\nThe original planned title for the album was Music for Sports, but Fripp eventually decided to choose a title that would not be associated with Brian Eno's Music for... albums.\nThe original album was released on CD for the first time in 2021, remastered by David Singleton, and including the previously unreleased \"Music on Hold\". The track \"Under Heavy Manners\" and a longer version of \"The Zero of the Signified\" (retitled \"God Save the King\") are also included on the League of Gentlemen God Save the King CD release.\nTrack listing\nAll compositions by Robert Fripp.\nSide A: God Save the Queen\n#\"Red Two Scorer\" - 6:54\n#\"God Save the Queen\" - 9:50\n#\"1983\" - 13:20\nSide One: Under Heavy Manners\n#\"Under Heavy Manners\" - 5:14\n#\"The Zero of the Signified\" - 12:38\nPersonnel\n*Robert Fripp – electric guitar, Frippertronics, voice (4), sleeve concept\n*Busta Jones – bass guitar (4, 5)\n*Paul Duskins – drums (4, 5)\n*Absalm el Habib (David Byrne) – lead vocals (4)\nAlso credited are:\n*Ed Sprigg – recording engineer (4, 5)\n*The Handlery Motor Inn, San Francisco – cover photo\n*Chris Stein – cover photo of Fripp, sleeve concept\n*The famous Mary Lou Green – hair\n*Ron Cohen – inner liner photo\nReferences\nExternal links\n*\n*"
    }
  ]
}