{
  "content": [
    {
      "type": "text",
      "text": "# Godzilla vs. King Ghidorah\n\n| director       = Kazuki Ōmori\n| producer       = Shōgo Tomiyama\n| writer         = Kazuki Ōmori\n| starring       = Kōsuke ToyoharaAnna NakagawaMegumi OdakaKatsuhiko SasakiAkiji KobayashiYoshio TsuchiyaRobert Scott Field\n| music          = Akira Ifukube\n| cinematography =\n| editing        =\n| studio         = Toho Pictures\n| distributor    = Toho\n| released       =\n| runtime        = 103 minutes\n| country        = Japan\n| language       = JapaneseEnglish\n| budget         =\n| gross          =  rentals)}}\n}}\nis a 1991 Japanese kaiju film written and directed by Kazuki Ōmori and produced by Shōgo Tomiyama. Distributed by Toho and produced under their subsidiary Toho Pictures, it is the 18th film in the Godzilla franchise, and is the third film in the franchise's Heisei period. The film features the monster characters Godzilla and King Ghidorah, and stars Kōsuke Toyohara, Anna Nakagawa, Megumi Odaka, Katsuhiko Sasaki, Akiji Kobayashi, Yoshio Tsuchiya, and Robert Scott Field, with Kenpachiro Satsuma as Godzilla and Hurricane Ryu as Ghidorah and his cyborg form Mecha-King Ghidorah. The plot revolves around time-travelers from the future who convince Japan to travel back in time to prevent Godzilla's mutation, only to reveal their true motives by unleashing King Ghidorah onto the nation.\nThe production crew of Godzilla vs. King Ghidorah remained largely unchanged from that of the previous film in the series, Godzilla vs. Biollante. Because the previous installment was a box office disappointment, due to a lack of child viewership and alleged competition with the Back to the Future franchise, the producers of Godzilla vs. King Ghidorah were compelled to create a film with more fantasy elements, along with time travel.\nGodzilla vs. King Ghidorah was the first Godzilla film since 1975's Terror of Mechagodzilla to feature a newly orchestrated score by Akira Ifukube. The film was released theatrically in Japan on December 14, 1991, and was followed by Godzilla vs. Mothra released on December 12, 1992. It was released direct-to-video in North America in 1998 by Columbia TriStar Home Entertainment. Despite mixed reviews from critics, Godzilla vs. King Ghidorah was more financially successful at the box office than Godzilla vs. Biollante. The film attracted controversy outside Japan due to its perceived Japanese nationalist themes.\nPlot\nTwo years after his battle with Biollante, Godzilla is still weakened from being infected by the Anti-Nuclear Energy Bacteria (ANEB). Meanwhile, science fiction author Kenichiro Terasawa learns of a group of Japanese soldiers stationed on Lagos Island during the Gilbert and Marshall Islands campaign; where they were threatened by American forces, before being saved by a mysterious dinosaur, Godzillasaurus, which Terasawa theorizes to have mutated into the first Godzilla due to nuclear notes on the island.. Powerful businessman and veteran, Yasuaki Shindo, who commanded the Lagos Garrison, confirms Godzillasaurus' existence.\nSoon, a UFO named MOTHER lands near Mount Fuji. When the JSDF investigates, MOTHER is revealed to be a time machine piloted by the Futurians — Wilson, Grenchiko, Emmy Kano, and the android M-11 — who explain that they are from the year 2204, claiming Godzilla has completely destroyed Japan. The Futurians plan to travel back to 1944 and remove Godzillasaurus from Lagos Island before the nuclear tests, preventing its mutation into Godzilla. To prove themselves, Emmy presents a copy of Terasawa's book, which he's yet to publish.\nThe Futurians, Terasawa, Miki Saegusa, and Professor Mazaki, travel back to 1944 to Lagos Island, where Japanese forces led by Shindo fight with attacking American forces. As per Shindo's story, Godzillasaurus fights off the Americans, but is mortally wounded by U.S. Navy. After Shindo and his men leave the island, M-11 has Godzillasaurus teleported from Lagos Island to the Bering Strait. Before departing, the Futurians secretly leave three genetic-engineered dragons called Dorats on Lagos Island, which are later irradiated by nuclear tests, mutating and merging King Ghidorah. Returning to 1992, the Futurians use Ghidorah to subjugate Japan and issue an ultimatum of surrender.\nBecoming sympathetic for Japan’s people, Emmy reveals to Terasawa the truth behind the Futurians' mission: in the 23rd century, Japan is an economic superpower surpassing the United States, Russia, and China, even buying out South America and Africa. The Futurians sought to change history and prevent this by creating Ghidorah and having him destroy present-day Japan; and planned to erase Godzilla from history to prevent him from threatening their plans. After M-11 brings Emmy back to MOTHER, she reprograms the android to help her.\nShindo plans to send his nuclear submarine to the Bering Strait and irradiate Godzillasaurus, and recreate Godzilla. However, Terasawa discovers that a Soviet nuclear submarine sank there in the 1970s, releasing enough radiation to mutate Godzillasaurus into the current Godzilla. Godzilla destroys Shindo's submarine and feeds on the radiation, consequently recovering from the ANEB and becoming larger. Godzilla arrives in Japan and faces Ghidorah. M-11 and Terasawa help Emmy sabotage MOTHER's control over Ghidorah, causing Ghidorah to lose focus, before Godzilla blasts off Ghidorah's middle head. After sending Ghidorah crashing into the Sea of Okhotsk, Godzilla destroys MOTHER, killing Wilson and Grenchiko.\nGodzilla turns his ire on Japan, rampaging from Sapporo to Tokyo, where he kills Shindo after seemingly recognizing him. Emmy travels to the future with M-11 and returns having created Mecha-King Ghidorah, a cyborg version of Ghidorah.  The cyborg is initially ineffective in its battle with Godzilla, but manages to restrain and carry Godzilla out of Japan. Godzilla breaks from his restraints causing both to fall into the ocean, destroying Mecha-King Ghidorah. Emmy returns to the future with M-11, but not before revealing to Terasawa that she is his descendant. Back in the ocean floor, a still living Godzilla regains consciousness over Ghidorah's remains.\nCast\n, science fiction author and one of the film's main protagonists.\n* Katsuhiko Sasaki as Professor Hironori Mazaki\n* Yoshio Tsuchiya as Yasuaki Shindo, the wealthy businessman and World War II veteran.\n* Robert Scott Field as M-11, an android and the member of the Futurians.\n* Anna Nakagawa as , the member of the Futurians and one of the film's main protagonists.\n* Richard Berger as Grenchiko, the rogue member of the Futurians and one of the film's main antagonists.\n* Chuck Wilson as Wilson, the rogue member of the Futurians and one of the film's main antagonists.\n* Megumi Odaka as\n* Akiji Kobayashi as\n* Tokuma Nishioka as\n*  as\n* Kenji Sahara as Takayuki Segawa\n* So Yamamura as Hayashida, Prime Minister of Japan.\n* Koichi Ueda as Masukichi Ikehata, World War II veteran.\n* Kenpachiro Satsuma as Godzilla, the irradiated dinosaurian creature.\n** Wataru Fukuda as Godzillasaurus, Godzilla's pre-irradiated form who lives in Lagos Island.\n* Hurricane Ryu as King Ghidorah, the irradiated three-headed dragon created from Dorats and one of the film's main antagonists.\n** Ryu also portrays Mecha-King Ghidorah, the cyborg version of Ghidorah.\n}}\nProduction\nConception\nAlthough the previously filmed Godzilla vs. Biollante had been the most expensive Godzilla film produced at the time, its low audience attendance and loss of revenue convinced executive producer and Godzilla series creator Tomoyuki Tanaka to revitalize the series by bringing back iconic monsters from pre-1984 Godzilla movies, specifically Godzilla's archenemy King Ghidorah.\nGodzilla vs. Biollante director and writer Kazuki Ōmori had initially hoped to start a standalone series centered on Mothra, and was in the process of rewriting a 1990 script for the unrealized film Mothra vs. Bagan. The film was ultimately scrapped by Toho, under the assumption that, unlike Godzilla, Mothra would have been a difficult character to market overseas. The planning stages for a sequel to Godzilla vs. Biollante were initially hampered by Tanaka's deteriorating health, thus prompting the takeover of Shōgo Tomiyama as producer. The new producer felt that the financial failure of Godzilla vs. Biollante was due to the plot being too sophisticated for child audiences, and thus intended to return some of the fantasy elements of the pre-1984 Godzilla films to the series. Ōmori himself blamed the lackluster performance of Godzilla vs. Biollante on competition with Back to the Future Part II, and thus concluded that audiences wanted plots involving time travel. His approach to the film also differed from Godzilla vs. Biollante in his greater emphasis on developing the personalities of the monsters rather than the human characters.\nAkira Ifukube agreed to compose the film's score on the insistence of his daughter, although he had been dissatisfied with the way his compositions had been treated in Godzilla vs. Biollante.\nSpecial effects\nThe Godzilla suits used in Godzilla vs. Biollante were reused in Godzilla vs. King Ghidorah, though with slight modifications. The original suit used for land-based and full body shots had its head replaced with a wider and flatter one, and the body cut in half. The upper half was used in scenes where Godzilla emerges from the sea and during close-ups during the character's first fight with King Ghidorah. The suit used previously for scenes set at sea was modified with rounder shoulders, a more prominent chest, and an enhanced face, and was used throughout the majority of the film's Godzilla scenes.\nThe redesigned King Ghidorah featured much more advanced wirework puppetry than its predecessors, and effects team leader Koichi Kawakita designed the \"Godzillasaurus\" as a more paleontologically accurate-looking dinosaur than Godzilla itself as a nod to American filmmakers aspiring to direct their own Godzilla films with the intention of making the monster more realistic. Ōmori's original draft specified that the dinosaur that would become Godzilla was a Tyrannosaurus, though this was rejected by creature designer Shinji Nishikawa, who stated that he \"couldn't accept that a tyrannosaur could become Godzilla\". The final suit combined features of Tyrannosaurus with Godzilla, and real octopus blood was used during the bombardment scene. Because the Godzillasaurus' arms were much smaller than Godzilla's, suit performer Wataru Fukuda had to operate them with levers within the costume. The creature's distress calls were recycled Gamera cries.\nHome media\nThe Columbia/TriStar Home Video DVD version was released in 1998 as a single disc double feature with Godzilla vs. Mothra. The picture was full frame (1.33:1) [NTSC] and the audio in English (2.0). There were no subtitles. Extras included the trailer for Godzilla vs. King Ghidorah and Godzilla vs. Mothra.\nThe Sony Blu-ray version was released on May 6, 2014, as a two-disc double feature with Godzilla vs. Mothra. The picture was MPEG-4 AVC (1.85:1) [1080p] and the audio was in Japanese and English (DTS-HD Master Audio 2.0). Subtitles were added in English, English SDH and French. Extras included the theatrical trailer and three teasers in HD with English subtitles.\nReception\nJoseph Savitski of Beyond Hollywood said \"This entry in the popular monster series is a disappointing and flawed effort unworthy of the 'Godzilla' name.\" Film historian and critic David Kalat wrote \"Despite its shortcomings, illogic, and overpopulated cast, Godzilla vs. King Ghidorah is crammed full of ideas, richly visualized innovations, a genuine spirit of fun, and some of the most complex emotional manipulation ever to grace the series.\"\nControversy\nThe film was considered controversial at the time of its release, being contemporary to a period of economic tension between America and Japan, but mainly due to its fictional World War II depictions. Gerald Glaubitz of the Pearl Harbor Survivors Association appeared alongside director Kazuki Ōmori on Entertainment Tonight and condemned the film as being in \"very poor taste\" and detrimental to American-Japanese relations. Ishirō Honda also criticized Ōmori, stating that the scene in which Godzilla attacks and crushes American G.I.s went \"too far\". Conversely, Godzilla historian Steve Ryfle said American media reports of supposed anti-Americanism \"weren't really thought-provoking or insightful.\" Ōmori has denied all such allegations, stating that the American extras in the film had been \"happy about being crushed and squished by Godzilla.\" Commenting on the controversy in 2006, Ōmori stated:\nNotes\nReferences\nExternal links\n*\n*\n* Watch a behind-the-scenes documentary (Japanese with English subtitles)"
    }
  ]
}