{
  "content": [
    {
      "type": "text",
      "text": "# Godzilla: City on the Edge of Battle\n\n| director       = Kōbun ShizunoHiroyuki Seshita\n| producer       = Takashi Yoshizawa\n| writer         =\n| screenplay     = Sadayuki MuraiTetsuya YamadaGen Urobuchi\n| story          = Gen Urobuchi}}\n| based_on       =\n| starring       = Mamoru MiyanoTakahiro SakuraiTomokazu SugitaYuki KajiJunichi Suwabe\n| narrator       =\n| music          = Takayuki Hattori\n| cinematography =\n| editing        =\n| studio         =\n| distributor    =\n| released       =\n| runtime        = 100 minutes\n| country        = Japan\n| language       = Japanese\n| budget         =\n| gross          = ¥100 million (opening)\n}}\n}}}} is a 2018 Japanese computer-animated kaiju film directed by Kōbun Shizuno and Hiroyuki Seshita. Produced by Toho Animation and Polygon Pictures, in association with Netflix, it is the 33rd film in the Godzilla franchise, the 31st Godzilla film produced by Toho, the second entry in the franchise's anime trilogy, and the third film in the franchise's Reiwa period. however, Toho considers Shin Godzilla and the anime trilogy as part of the Reiwa era.}}\nA sequel to the 2017 film Godzilla: Planet of the Monsters, the film continues the story of humans fighting to reclaim the Earth from Godzilla, this time with the help of a weapon known as Mechagodzilla. Godzilla: City on the Edge of Battle was released theatrically in Japan on May 18, 2018, and was released worldwide on Netflix on July 18, 2018. A sequel, Godzilla: The Planet Eater, was released in Japan on November 9, 2018.\nPlot\nFollowing the events of Godzilla: Planet of the Monsters, the Aratrum is unable to contact Haruo and the rest after their encounter with the original Godzilla. The Captain orders the Aratrums withdrawal if drones fail to find survivors within 48 hours. Haruo Sakaki is revealed to have been rescued by a native girl named Miana, who treated his wound with a strange powder. Haruo reunites with some of his teammates while they were confronted by who they later learned to be Miana's twin sister Maina before being captured by the latter's hunting party. The group are reunited with Martin Lazzari whose platoon have been healed by the twins' people who are known as the \"Houtua\", surviving descendants of humans who remained on Earth and safeguard the egg of their fallen deity.\nThe group are telepathically questioned by the twins and the Houtua leaders over why they burned their lands, letting them go once Haruo explains they were only attacking Godzilla. Accompanied by Miana and Maina as their protective guides and observers, the twins revealing they can also speak verbally, Haruo's group reunites with Metphies and the other survivors during an encounter with the Servum. During the fight, Galu-Gu realizes that the twins' arrowheads are laced with \"nanometal\", the nanotechnology used to create Mechagodzilla. Galu-Gu explains that the nanometal somehow survived and expanded itself over the past 20 millennia. Haruo is convinced by Galu-Gu to remain on Earth and resume the plan to kill Godzilla, sending a few crew members back to the Aratrum. The group trace the energy signature to the rebuilt facility that held Mechagodzilla, which Galu-Gu christens \"Mechagodzilla City\". The twins part ways with the group while warning Haruo that the nanometal is poisonous; the Bilusaludo assuring the group that the technology is only harmful to Godzilla.\nThe team soon finds that the surviving half of Mechagodzilla's head is the source of the nanometal as Galu-Gu accesses Mechagodzilla's brain to construct all necessary materials to trap Godzilla within the city and cover him with nanometal to finish him off with EMP harpoons. While overseeing the construction, her mech suit modified into one of three Vulture exo-armors, Yuko confesses her feelings for Haruo and kisses him. Feeling slightly ill since entering the city like some of the others, Haruo finds Metphies working in a cave to repair an item with some of Galu-Gu's technology. Metphies cryptically hints the Bilusaludo's motives of becoming monsters themselves due to their obsession with logic, confiding to Haruo the name of a greater terror than Godzilla that destroyed his home world: \"King Ghidorah\".\nAs Godzilla awakens, most of the human members are horrified to learn that most of the Bilusaludo had willingly allowed themselves to be assimilated into Mechagodzilla City to further fortify it. Godzilla's quick advance on the city forces Galu-Gu to sacrifice the city's defenses in order to divert power to finish the harpoon while Haruo, Yuko and Belu-be use the Vultures to slow Godzilla down. Though the trio managed to hold Godzilla for the plan to go underway, Godzilla survives the trap and proceeds to overheat the facility. This forces a defiant Galu-Gu to fuse with the nanometal as the humans escape the city. Galu-Gu then has the Vultures absorb their pilots to use as sacrificial spears to kill Godzilla.\nHaruo is unaffected while Yuko is being slowly converted against her will. Metphies warns a conflicted Haruo that Mechagodzilla City will consume Earth if not stopped and that its destruction could save Yuko, Galu-Gu arguing that transcending their humanity is the only way to kill Godzilla. Haruo ultimately decides to fight Godzilla with his humanity intact, the destruction of Galu-Gu and the command center rendering the nanometal inert as Godzilla frees himself and destroys the city. Haruo tends to Yuko, who is unable to wake from her comatose state, while the surviving humans hide in a cave with Metphies as everything burns around them.\nVoice cast\n{| class=\"wikitable\"\n!Characters\n!Japanese\n!English\n|-\n|\n|Mamoru Miyano\n|Chris Niosi\n|-\n|\n|Takahiro Sakurai\n|Lucien Dodge\n|-\n|\n|Kana Hanazawa\n|Cristina Vee\n|-\n|\n|Tomokazu Sugita\n|Edward Bosco\n|-\n|\n|Yuki Kaji\n|Robbie Daymond\n|-\n|\n|Junichi Suwabe\n|Jamieson Price\n|-\n|\n|Reina Ueda\n|Kendall Gimbi\n|-\n|\n|Ari Ozawa\n|Rachelle Heger\n|-\n|\n|Kenta Miyake\n|Rich Brown\n|-\n|\n|Kenyu Horiuchi\n|Keith Silverstein\n|-\n|\n|Kazuya Nakai\n|Doug Stone\n|-\n|\n|Kazuhiro Yamaji\n|Joe Ochman\n|-\n|}\nProduction\nThe second installment in the anime trilogy was announced in a second post-credits scene in the theatrical release of the film revealing the film's Japanese title, poster featuring Mechagodzilla and the film's 2018 release date. The film's Japanese title was revealed as Gojira: Kessen Kidō Zōshoku Toshi (translations varied from Godzilla: Battle Mobile Breeding City to Godzilla: The City Mechanized for the Final Battle), while the English title was later revealed as Godzilla: City on the Edge of Battle. In March 2018, the film's official website revealed a new poster, plot details, and that singer XAI would return to perform the film's theme song The Sky Falls. The English dub was produced by Post Haste Digital.\nMusic\nTakayuki Hattori returned to compose the soundtrack, marking it his fourth Godzilla film score. XAI also returned to perform the film's theme song The Sky Falls. On his work on the film, Hattori stated:\nRelease\nTheatrical and streaming\nGodzilla: City on the Edge of Battle was given a theatrical release in Japan on May 18, 2018, and released worldwide on Netflix on July 18, 2018.\nReception\nBox office\nGodzilla: City on the Edge of Battle was released in 158 theaters in Japan and reached eighth place at the box office. The film earned ¥100 million on its first week, from 73,000 ticket sales.\nCritical response\nNaoya Fujita from IGN gave the film a 4.5 rating, indicating a \"bad\" rating, stating, \"Godzilla: City on the Edge of Battle takes some promising ingredients, but cooks them into an unpalatable meal. We never really understand what the protagonists are fighting for, and there's not even a satisfying scene of urban destruction (a Godzilla staple). It fails both emotionally and viscerally.\" James Grebey from Inverse called the film \"bleakly pointless\", stating the film is \"extremely self-serious, depressing and fairly light on fun\" and called the film \"the biggest bummer in Godzilla's filmography.\" James Perkins from HeyUGuys gave the film 3 stars out of 5, stating the film is \"neither the best or worst iteration of the Godzilla franchise but is most definitely made with the intention of trying something new but adding a heavy sci-fi and futuristic element to the famous monster.\"\nJeff Pawlak from Geekiverse awarded the film 5.5 out of 10, feeling that the film had \"great ideas\" with an \"interesting setting\" but felt the CG animation was \"ugly as ever\", felt the film lacked complex characters and action, stating \"City on the Edge of Battle completely mishandles the pass from Planet of the Monsters, failing to adequately explore the worthwhile worldbuilding it introduces, or that its predecessor introduced.\" Callum May from Anime News Network gave the film an overall A− rating, praising Haruo for growing as a character but criticized the lack of development for the other characters. May also criticized the second act for dragging by having the characters simply wander in the city. May concluded by stating, \"While it doesn't fix many of the issues from the first film, Haruo's development manages to sell a more character-driven narrative and makes his relationships more empathetic. It's perhaps not the film that fans were expecting, but it's the film this trilogy needed to lead into an epic conclusion in Godzilla: The Planet Eater.\"\nMitch Nissen from ComiConverse gave the film 3 stars out of 5, criticizing the slow pace but praising the film for improving on Part 1 by expanding its ideas. Nissen also noted how the anime films do not feel like anime or kaiju films but rather, legitimate sci-fi reinventions, stating, \"they are pure science fiction. Fans of in-depth cerebral science fiction should find much to enjoy about the films. References to Godzilla lore abound, much visible only to the hyper analytical Godzilla fan.\" Taylor Bauldwin from Geeks of Color called the film \"disappointing\". He criticized the slow pace, the lack of compelling motivations for the characters, and the climax battle for not carrying any weight. He concluded by stating, \"I did enjoy the style and sounds of the movie but that alone is not nearly enough for redemption here. This movie begins, things happen, and then the movie ends exactly the same way it started.\"\nAccolades\n{| class=\"wikitable sortable plainrowheaders\"\n|-\n! scope=\"col\" |Award\n! scope=\"col\" |Category\n! scope=\"col\" |Recipient(s)\n! scope=\"col\" |Result\n! class=\"unsortable\" scope=\"col\" |\n|-\n! scope=\"row\" style=\"text-align:center;\"|\n| Excellence Award for Theatrical Animation\n| Godzilla: City on the Edge of Battle\n|\n| style=\"text-align:center;\"|\n|}\nSequel\nThe third and final film in the anime trilogy, titled Godzilla: The Planet Eater was released on November 9, 2018.\nNotes\nReferences\nExternal links\n* [http://godzilla-anime.com/index.html Official website]\n* [https://godzilla.com/filmography/godzilla-city-on-the-edge-of-battle/ Godzilla: City on the Edge of Battle] at the official Godzilla website by Toho Co., Ltd.\n*\n*\n*\n*"
    }
  ]
}