{
  "content": [
    {
      "type": "text",
      "text": "# Golden Collar Awards\n\nThe Golden Collar Awards reward the best canine actors. The trophies are delivered during a ceremony, similar to other ceremonies in the cinema industry.\nHistory\nThe Golden Collar Awards were created in 2012 by the website Dog News Daily, a commercial website dedicated to the products for dogs that has been created in 2009.\nThe first Golden Collar Awards rolled out the red carpet for the dogs on 13 February 2012 in a luxury hotel, the Hyatt Regency Century Plaza in Los Angeles, in front of an audience composed of the press. The trophy was created by designer Simon Tavassoli: it consists of a statue that represents an Italian Leather Collar with embedded shiny Swarovski crystals.\nSome criticism has been expressed that the awards were only launched a couple of months prior, due to the attention the dog Uggie was getting for his performance in The Artist.\nCategories\nThe dogs and their owners or trainers concur in five catégories:\n* Best Dog in a Theatrical Film\n* Best Dog in a Foreign Film\n* Best Dog in a Television Series\n* Best Dog in a Reality Television Series\n* Best Dog in a Direct-To-DVD Film\nAn honorary prize rewards the \"humanitarian\" (animal protection) or the \"legends\" of the dogs on the screen:\n* Honorary Golden Collar Award\nPrizes\nPrizes 2012\nThe 2012 edition has been presented by actresses Pauley Perrette and Wendie Malick.\n* Best Dog in a Theatrical Film : Uggie, Jack Russell terrier, as \"the dog\" in The Artist, trainer Omar Von Muller\n* Best Dog in a Foreign Film : Koko, Australian Kelpie, as « Red Dog » in the Australian film Red Dog\n* Best Dog in a Television Series, Musical or Comedy : Brigitte, French Bulldog, as « Stella » in Modern Family\n* Best Dog in a Reality Television Series : tie Giggy, Pomeranian, in The Real Housewives of Beverly Hills, and Hercules, Pit bull, in Pit Boss\n* Best Dog in a Direct-To-DVD Film : Rody, Labrador Retriever, as « Marley » in Marley & Me: The Puppy Years\nSee also\n* List of American television awards\nNotes and references\nExternal links\n* [http://dognewsdaily.com Dog News Daily]  web site"
    }
  ]
}