{
  "content": [
    {
      "type": "text",
      "text": "# Golden Spike National Historical Park\n\n| area                 =\n| designated_nrhp_type = April 2, 1957\n| visitation_num       = 40,156\n| visitation_year      = 2005\n| website              =\n| built                =\n| builder              = Central Pacific Railroad; Union Pacific Railroad Company\n| added                = October 15, 1966\n| refnum               = 66000080\n}}\nGolden Spike National Historical Park is a United States National Historical Park located at Promontory Summit, north of the Great Salt Lake in east-central Box Elder County, Utah, United States. The nearest city is Corinne, approximately  east-southeast of the site.\nIt commemorates the completion of the first Transcontinental Railroad where the Central Pacific Railroad and the first Union Pacific Railroad met on May 10, 1869. The final joining of the rails spanning the continent was signified by the driving of the ceremonial golden spike.\nBackground\nmap of Golden Spike National Historical Park|200x200px]]\nThe Golden Spike National Historical Park encompasses . Initially just  when it was established in 1957, limited to the area near the junction of the two rail systems, the site was expanded by  in 1965 through land swaps and acquisition of approximately a strip of land mostly  wide along  of the former railroad right-of-way. It reached its present size in 1980. In addition to the Summit site where the rails were joined, the Park includes the two linear areas known as the west slope (west of the junction) and the east slope (east of the junction), which include worker campsites, partially-completed grades, incomplete cuts, specialty workshops, and two historical landmarks: where the Central Pacific finished its \"Ten miles of track, laid in one day\" tracklaying record (west slope) and where the Big Fill and Big Trestle were completed (east slope).\nAlthough the line was abandoned in 1904 (bypassed by the Lucin Cutoff) and the original rails were removed in 1942 to serve the war effort, the site presently includes  of rebuilt track from the summit area (where the rail systems were joined) to a train storage building. The rebuilt track was designed to be an authentic representation of the 1869 rails.\nIn 2002, it received 49,950 visitors.  annual visitation ranges from 48,000 to 64,000.\nHistory\nThe first monument erected at the site was a concrete obelisk built by the Southern Pacific Railroad (successor to the Central Pacific) . It has since been moved several times, but can presently be seen near the 1969 Visitor Center.\nThis is a national shrine! The event it portrays marks the beginning of a new era in the development of our western country.....a great era. Its centennial will take place in a short twenty years, and we should begin to prepare for it now.It is not a job for the railroads, or the state of Utah, or other small groups. I feel that I represent a goodly portion of the people of the United States, because there are people in all sections of this land whose fathers, or uncles, or other relatives, aided in building the railroad which welded the nation together during a dangerous period in its history, when it might have been torn asunder had it not been for the speedy transportation and communication which this railroad brought into being.It is the most neglected historical spot in our land. Some of the visitors I have directed to Promontory summit to see the site have been greatly disappointed that the spot is not taken care of. |author=—&nbsp;Bernice Gibbs Anderson |source=Letter to President Harry Truman, May 12, 1949 |width=25em |align=right}}\nBernice Gibbs Anderson founded and led the movement to have the site preserved as a memorial to the First Transcontinental Railroad, starting with articles about local history that began in 1926. Anderson was president of the Golden Spike Association of Box Elder County, which held its first re-enactment of the joining of the rails on May 10, 1952, using local volunteers organized by Judge B.C. Call from a script written by Marie Thorne Jepson. Anderson tirelessly wrote to state and federal officials urging them to build a monument at Promontory Summit, and it was authorized as a National Historic Site on April 2, 1957, under non-federal ownership; at that time, the Golden Spike Association maintained the site under a cooperative agreement between the Southern Pacific Railroad and the state and federal governments.\nIt was authorized for federal ownership and administration by an act of Congress on July 30, 1965, as Golden Spike National Historic Site. The John D. Dingell Jr. Conservation, Management, and Recreation Act, signed into law March 12, 2019, redesignated it as a national historical park. Historic sites are typically a single building, while historical parks include multiple landmarks in a larger district.\n28,000 visitors attended the centennial anniversary of the completion ceremony on May 10, 1969, including Bernice Gibbs Anderson. The  Visitor Center had just been completed. On that day, the Virginia and Truckee locomotives nos. 11, Reno, and 12, Genoa were loaned from their respective owners, the Pacific Coast Chapter of the Railway and Locomotive Historical Society, and MGM Studios, redecorated to represent the Union Pacific No. 119 and Central Pacific Jupiter, respectively, and placed on a section of restored trackage to recreate the completion ceremony. That year, the railroad grade was named a National Historic Civil Engineering Landmark.  The \"119\" (the V&T Reno) was sold to Old Tucson Studios in Tucson, Arizona, and the \"Jupiter\" (the Genoa), was sold to the state of California, and the two engines were sent to their respective new owners the following year, the latter engine joining the rest of the former Pacific Coast Chapter RLHS-owned equipment in what ultimately became the California State Railroad Museum.  Replacing the engines at Promontory were the Virginia and Truckee locomotives nos. 22, Inyo, and 18, Dayton redecorated as the Jupiter and No. 119, respectively.  These engines remained at the site until 1978, when they were sent to the state of Nevada, which had purchased them in 1974, to be a part of what ultimately became the Nevada State Railroad Museum in Carson City.\nIn 1978, a general master plan for the site was adopted with the goal of maintaining the site's scenic attributes as closely as possible to its appearance and characteristics in 1869. The functioning replicas of the Jupiter and No. 119 locomotives were brought to the site in time to celebrate the 110th anniversary of the joining of the rails in 1979.\nIn 2006, a petition to the Board on Geographic Names resulted in a name change for Chinaman's Arch, a  limestone arch at Golden Spike National Historical Park. In honor of the 19th century Chinese railroad workers, the arch is now known as Chinese Arch.\nIn March 2019 the site was redesignated as Golden Spike National Historical Park.\nOn May 10, 2019, a 150th anniversary celebration was held in commemoration of the completion of the railroad. This event was attended by several notable local leaders, including Utah governor Gary Herbert and the president of the Church of Jesus Christ of Latter-day Saints, Russell M. Nelson.\nGallery\nFile:Golden Spike National Historical Park, Promontory, Utah (43508046950).jpg|Park sign (photographed in 2018)\nFile:Golden Spike National Historic Site GOSP4965.jpg|28,000 visitors attended the centennial celebration (1969)\nFile:Golden Spike National Historic Site GOSP4968.jpg|Re-enacting the driving of the Golden Spike (1969)\nFile:GoldenSpike modern.jpg|Replicas of No. 119 and Jupiter at (the then named) Golden Spike National Historic Site (2006)\nFile:GoldenSpike UP119.JPG|Recreations of the Golden Spike ceremony are performed on a seasonal schedule; this one was in May 2012.\nFile:Visitor Center 2016-10-14 2445.jpg|Visitor Center (2016)\nFile:Plaque at Promontory Summit, UT.jpg|Plaque to honor the Chinese railroad workers who built the Transcontinental Railroad.\nFile:Southern Pacific Monument -Golden Spike NHS Memorial 2016-10-14 2524.jpg|Southern Pacific Monument (2016)\nFile:Chinese Arch 2016-10-14 2633.jpg|Chinese Arch (2016)\nFile:Diesel shuttle 2016-10-14 2582.jpg| The General Electric 25-ton switcher used for moving No. 119 and Jupiter when they're not under power\nSee also\n}}\n* National Register of Historic Places listings in Box Elder County, Utah\n* Jupiter (locomotive)\n* Union Pacific No. 119\n* List of heritage railroads in the United States\n* List of transport museums\n* Promontory, Utah\n* Northern Pacific Railway Completion Site, 1883\nReferences\nExternal links\n*\n*\n*\n* [http://www.themetrains.com/golden-spike-centennial-limited-main.htm ThemeTrains.com - The Golden Spike Centennial Limited]\n*\n*\n*"
    }
  ]
}