{
  "content": [
    {
      "type": "text",
      "text": "# Golden Reel Award for Outstanding Achievement in Sound Editing – Sound Effects, Foley, Music, Dialogue and ADR for Non-Theatrical Animated Long Form Broadcast Media\n\nThe Golden Reel Award for Outstanding Achievement in Sound Editing – Sound Effects, Foley, Music, Dialogue and ADR for Non-Theatrical Animated Long Form Broadcast Media is an annual award given by the Motion Picture Sound Editors. It honors sound editors whose work has warranted merit in the field of cinema; in this case, their work in the field of non-theatrical film; i.e. films that go direct-to-video or direct-to-streaming. The award has been given with its current title since 2018.\nA similar award, the Best Sound Editing – Direct to Video – Sound, honored both animated and live-action films from 1999 until 2010.\nWinners and nominees\n2010s\n{| class=\"wikitable\" width=\"100%\" cellpadding=\"5\"\n|-\n! width=\"6%\" | Year\n! width=\"39%\" | Film\n! width=\"55%\" | Winners/Nominees\n|-\n| rowspan=6 style=\"text-align:center\" | 2010\n! colspan=\"2\"|Best Sound Editing – Direct to Video – Animation\n|-\n| style=\"background:#FAEB86;\" | 'Family Guy: It's a Trap! || style=\"background:#FAEB86;\" | Bob Newlan (supervising sound editor); Andrew Ellerd (sound designer); Stuart Martin (sound effects editor); Mark Eklund (dialogue editor); Patrick S. Clark, Stan Jones, Douglas M. Lackey (music editors); Dale W. Perry (Foley artist)'\n|-\n| Batman: Under the Red Hood || Robert Hargreaves (supervising sound editor/designer); Mark Keatts (supervising dialogue editor); George Brooks (sound effects editor); John Hegedes (Foley editor); Kelly Ann Foley, Mike Garcia (dialogue editors); Gary Marullo (Foley artist)\n|-\n| DC Showcase: Jonah Hex || Benjamin Wynn (supervising sound editor/designer); Jeremy Zuckerman (sound designer/music editor); Aran Tanchum (supervising Foley editor); Mark Keatts (supervising dialogue/ADR editor); Carlos Sanches, Otis Van Osten (sound effects editors); R.D. White (Foley editor); Vincent Guisetti (Foley artist)\n|-\n| ''The Penguins of Madagascar – Operation: Get Ducky- Dr. Blowhole's Revenge || Paulette Victor-Lifton, Jimmy Lifton (supervising sound editors); Ian Nyeste (sound designer); Aran Tanchum (supervising Foley editor); Michael Petak (supervising dialogue editor); Jason Stiff (supervising ADR editor); Matthew Thomas Hall (sound effects editor); Lawrence Reyes (sound effects/Foley editor); D.J. Lynch (dialogue/music editor); Oliver Pearce (dialogue editor); Dominick Certo (music editor); Vincent Guisetti, Monique Reymond (Foley artists)\n|-\n| Tom and Jerry Meet Sherlock Holmes || Robert Hargreaves (supervising sound editor/designer, Foley artist); Mark Keatts (supervising dialogue/ADR editor); George Brooks, Rick Hinson (sound effects editors); Kelly Ann Foley, Mike Garcia (dialogue/ADR editors); Michael Tavera (music editor); Gary Marullo (Foley artist)\n|-\n| rowspan=5 style=\"text-align:center\" | 2011|| style=\"background:#FAEB86;\" | Megamind: The Button of Doom || style=\"background:#FAEB86;\" | 'John Marquis (supervising sound editor); Tobias Poppe (sound effects editor); Jonathan Klein (Foley editor); Susan Dudeck (ADR editor); Adam Milo Smalley (music editor); John T. Cucci, Dan O'Connell (Foley artists)'\n|-\n| Gift of the Night Fury || Jonathan Null (supervising sound editor); Al Nelson (sound designer); Chris Gridley (supervising dialogue editor); Frank Clary, Colette D. Dahanne, Josh Gold (sound effects editors); Adam Milo Smalley (music editor); Dennie Thorpe, Jana Vance (Foley artists)\n|-\n| Kung Fu Panda: Secrets of the Masters'' || John Marquis (supervising sound editor); Tobias Poppe (sound effects editor); Jonathan Klein (Foley editor); Thomas Jones (ADR editor); Adam Milo Smalley (music editor); John T. Cucci, Dan O'Connell (Foley artists)\n|-\n| Quest for Zhu || Rick Hinson (supervising sound editor), Gary Falcone (supervising Foley editor), Lizzie Hinson (sound editor), Roberto Dominguez Alegria (Foley editor), Cynthia Merrill (Foley artist)\n|-\n| The Smurfs: A Christmas Carol || Robert L. Sephton (supervising sound editor/designer); F. Scott Taylor (supervising Foley editor); Bernard Weiser (supervising dialogue/ADR editor); Todd Bozung (music editor); Robin Harlan, Sarah Monat (Foley artists)\n|-\n| rowspan=3 style=\"text-align:center\" | 2012|| style=\"background:#FAEB86;\" | Justice League: Doom || style=\"background:#FAEB86;\" | Robert Hargreaves (sound designer); Mark Keatts (supervising dialogue editor); George Brooks (sound effects editor); John Hegedes (Foley editor); Kelly Ann Foley, Mike Garcia (dialogue editors); Gary Marullo (Foley artist)\n|-\n| Batman: The Dark Knight Returns – Part 1 || rowspan=\"2\"|Robert Hargreaves (sound designer); Mark Keatts (supervising dialogue editor); George Brooks (sound effects editor); John Hegedes (Foley editor); Kelly Ann Foley, Mike Garcia (dialogue editors); Gary Marullo (Foley artist)\n|-\n| Superman vs. The Elite\n|-\n| rowspan=3 style=\"text-align:center\" | 2013|| style=\"background:#FAEB86;\" | Batman: The Dark Knight Returns – Part 2 || style=\"background:#FAEB86;\" | Robert Hargreaves (supervising sound editor/designer), Mark Keatts (supervising dialogue editor), George Brooks (sound effects editor), John Hegedes (Foley editor), Kelly Ann Foley (dialogue editor), Gary Marullo (Foley artist)\n|-\n| Koala Kid || Eric Lalicata (supervising sound editor); Ian Blackman, Scott A. Jennings (sound designers); John Sanacore (supervising Foley editor); Dhyana Carlton-Tims (supervising dialogue editor); Shaun Cunningham, Kyle Lane (Foley editors); Tara Blume (Foley artist)\n|-\n| Superman: Unbound || Robert Hargreaves (supervising sound editor/designer), Mark Keatts (supervising dialogue editor), George Brooks (sound effects editor), John Hegedes (Foley editor), Kelly Ann Foley (dialogue editor), Gary Marullo (Foley artist)\n|-\n| rowspan=5 style=\"text-align:center\" | 2014|| style=\"background:#FAEB86;\" | Star Wars: The Clone Wars- Sacrifice || style=\"background:#FAEB86;\" | Matthew Wood (supervising sound editor), David Acord (sound designer), Kevin Sellers (supervising Foley editor), Steve Slanec (supervising dialogue/ADR editor), Dean Menta (supervising music editor), Jeremy Bowker (sound effects editor), Sean Kiner (music editor)\n|-\n| The Boxcar Children || Tom Boykin, Eric Lalicata (supervising sound editors); Ryan Gegenheimer (sound designer); Kyle Lane (supervising Foley editor); Dhyana Carlton-Tims (dialogue/ADR editor); Tara Blume (Foley artist)\n|-\n| The Pirate Fairy || Todd Toon (supervising sound editor/designer); Thomas Whiting (supervising dialogue/ADR editor); Charles Martin Inouye (supervising music editor); Odin Benitez, Adam Kopald, Charles W. Ritter, Pernell L. Salinas (sound effects editors); Jim Harrison (music editor); Alyson Dee Moore, John Roesch (Foley artists)\n|-\n| Rainbow Brite || Eric Marks (supervising sound editor)\n|-\n| Scooby-Doo! WrestleMania Mystery || Devon Bowman, Rob McIntyre (supervising sound editors); Aran Tanchum (supervising Foley editor); Kelly Ann Foley (supervising dialogue/ADR editor); Mark Keatts (supervising dialogue editor); Mike Garcia (supervising ADR editor); Ryan Shore (supervising music editor); Jessey Drake, James Lucero, Michael Kreple, Marc Schmidt (sound effects editors); Vincent Guisetti (Foley artist)\n|-\n| rowspan=6 style=\"text-align:center\" | 2015|| style=\"background:#FAEB86;\" | Tinker Bell and the Legend of the NeverBeast || style=\"background:#FAEB86;\" | Todd Toon (supervising sound editor/designer); Martyn Zub (sound designer/effects editor); Thomas Whiting (supervising dialogue editor); Charles Martin Inouye (supervising music editor); Charlie Campagna, Adam Kopald, Charles W. Ritter, Pernell L. Salinas (sound effects editors); Dominick Certo, Jim Harrison, Tommy Holmes (music editors); Shelley Roden, John Roesch (Foley artists)\n|-\n| Die drei Räuber || Paulette Victor-Lifton (supervising sound/dialogue editor); Frank Kruse, Sal Ojeda (sound effects editors); Gabriel Aronson, Scott Brewster, James Gallivan, Paul Mason, Jamison Rabbe, Terrence Stone, Genoveva Winsen (dialogue/ADR editors); Deron Johnson (music editor); Carsten Richter (Foley artist)\n|-\n| Lego DC Comics Super Heroes: Justice League – Attack of the Legion of Doom || Devon Bowman (supervising sound editor); Rob McIntyre (sound designer); Aran Tanchum (supervising Foley editor); Tim Kelly (supervising music editor); Jessey Drake, D.J. Lynch, Lawrence Reyes (sound effects editors); Tara Blume, Vincent Guisetti (Foley artists)\n|-\n| The Magic Snowflake || Paulette Victor-Lifton (supervising sound/editor, dialogue/ADR editor); Felix Davin (sound designer); James Gallivan, Paul Mason, Sal Ojeda, Jamison Rabbe, Terrence Stone, Genoveva Winsen (dialogue/ADR editors); Julien Billeau (Foley artist)\n|-\n| Marvel Super Hero Adventures: Frost Fight! || Stephen P. Robinson (supervising sound editor/designer); Mike Draghi (supervising sound editor); Marcos Abrom (sound designer); Roberto Dominguez Alegria, Maciek Malish (supervising Foley editors); John Brengman (supervising dialogue editor); Michael Emter (sound effects editor); Mark Mattson (music editor); Nancy Parker, Monique Reymond (Foley artists)\n|-\n| ''Santa's Apprentice || Paulette Victor-Lifton (supervising sound/dialogue/ADR editor); Arnaud Roy (supervising ADR editor); Sal Ojeda (sound effects editor); James Gallivan, Paul Mason, Jamison Rabbe, Terrence Stone (ADR editors); Christophe Burdet (Foley artist)\n|-\n| rowspan=5 style=\"text-align:center\" | 2016|| style=\"background:#FAEB86;\" | Lego DC Comics Super Heroes: Justice League – Gotham City Breakout || style=\"background:#FAEB86;\" | Devon Bowman, Rob McIntyre (supervising sound editors); Mark Keatts (supervising dialogue editor); Evan Dockter, D.J. Lynch, Lawrence Reyes, Marc Schmidt (sound effects editors); Aran Tanchum (Foley editor); Kelly Ann Foley, Patrick J. Foley, Mike Garcia (dialogue editors); Vincent Guisetti (Foley artist)\n|-\n| Batman: Bad Blood || Otis Van Osten (supervising sound editor); Matthew Thomas Hall (sound designer); Mark Keatts (supervising dialogue/ADR editor); Gerardo Gonzalez, Carlos Sanches (sound effects editors); Robert Monkress (Foley editor); Mike Garcia (dialogue editor)\n|-\n| Lego DC Comics Super Heroes: Justice League – Cosmic Clash || Rob McIntyre (supervising sound editor); Evan Dockter, Gregory Hainer, Lawrence Reyes (sound designers); Mark Keatts (supervising dialogue editor); Tim Kelly (supervising music editor); Marc Schmidt (sound effects editor); Aran Tanchum (Foley editor); Kelly Ann Foley, Patrick J. Foley, Mike Garcia (dialogue editors); Vincent Guisetti (Foley artist)\n|-\n| Open Season: Scared Silly || Geoffrey G. Rubay (supervising sound editor), Ryan Collins (sound designer), James Morioka (supervising dialogue editor), Alec Rubay (sound effects editor), Matt Friedman (music editor), Gregg Barbanell (Foley artist)\n|-\n| Space Dogs: Adventure to the Moon || Paul Hollman (supervising sound editor), Dan Snow (audio lead), Josh Ellis (sound effects editor), Elliot Herman (dialogue editor), Jody Berglund (Foley artist)\n|-\n| rowspan=6 style=\"text-align:center\" | 2017\n! colspan=\"2\"|Outstanding Achievement in Sound Editing – Sound Effects, Foley, Music, Dialogue and ADR for Non-Theatrical Animated Long Form Broadcast Media\n|-\n| style=\"background:#FAEB86;\" | Lego DC Super Hero Girls: Brain Drain || style=\"background:#FAEB86;\" | Devon Bowman (supervising sound editor); Rob McIntyre (sound designer); Mark Keatts (supervising dialogue editor); Evan Dockter, D.J. Lynch, Lawrence Reyes, Marc Schmidt, Joel Waters (sound effects editors); Matthew Saiz, Aran Tanchum (Foley editors); David M. Cowan, Kelly Ann Foley, Patrick J. Foley, Mike Garcia (dialogue editors); George Peters (ADR editor); Bijan Olia (music editor); Vincent Guisetti (Foley artist)\n|-\n| Justice League Dark || Otis Van Osten (supervising sound editor); Matthew Thomas Hall (sound designer); Christine H. Luethje (supervising music editor); Mark Keatts (supervising dialogue/ADR editor); Josh Eckberg, Greg Rubin, Ron Salaises, Carlos Sanches (sound effects editors); Dan Smith (Foley editor); David M. Cowan, Kelly Ann Foley, Patrick J. Foley, Mike Garcia (dialogue editors); Jonathan Abelardo, Mark Mercado (ADR editors); Robert J. Kral (scoring editor); Stacey Michaels, Alex Ullrich (Foley artists)\n|-\n| Teenage Mutant Ninja Turtles: Mutant Apocalypse || Jeff Shiffman (supervising sound editor); Jessey Drake, Brad Meyer (sound effects editors); Roger Pallan (Foley editor); Jacob Cook, Elliot Herman (dialogue editors); Sebastian Evans (music editor)\n|-\n| Teen Titans: The Judas Contract || Devon Bowman (supervising sound editor); Rob McIntyre (sound designer); Mark Keatts (supervising dialogue editor); Evan Dockter, Gregory Hainer, D.J. Lynch, Peter Munters, Lawrence Reyes (sound effects editors); David M. Cowan, Kelly Ann Foley, Mike Garcia, Derek Swanson (dialogue editors); Vincent Guisetti, Aran Tanchum (Foley artist)\n|-\n| Trollhunters: Tales of Arcadia || Matthew Thomas Hall (supervising sound editor); Jason Oliver (supervising dialogue editor); Goeun Lee, James Miller (sound effects editors); Aran Tanchum (Foley editor); Carlos Sanches (dialogue editor); Vincent Guisetti (Foley artist)\n|-\n| rowspan=7 style=\"text-align:center\" | 2018|| style=\"background:#FAEB86;\" | Next Gen || style=\"background:#FAEB86;\" | 'David Acord, Steve Slanec (supervising sound editors); Pascal Garneau, Kimberly Patrick (sound effects editors); Ryan J. Frias, Richard Gould, James Likowski (Foley editors); Qianbaihui Yang (dialogue editor); Sebastian Zuleta (music editor); Ronni Brown, Margie O'Malley (Foley artists)'\n|-\n| Batman: Gotham by Gaslight || Robert Hargreaves (sound designer); Mark Keatts (supervising dialogue editor); John Hegedes (Foley editor); Mike Garcia (dialogue editor); Jonathan Abelardo, Mark Mercado (ADR editors)\n|-\n| The Death of Superman || Devon Bowman, Rob McIntyre (supervising sound editors); Mark Keatts (supervising dialogue editor); Evan Dockter, Alfredo Douglas, D.J. Lynch, Peter Munters, Ian Nyeste, Joel Waters (sound effects editors); Aran Tanchum (Foley editor); David M. Cowan, Kelly Ann Foley, Patrick J. Foley, Mike Garcia, John Reynolds (dialogue editors); Jonathan Abelardo, Mark Mercado (ADR editors); Vincent Guisetti (Foley artist)\n|-\n| Lego DC Comics Super Heroes: The Flash || Devon Bowman, Rob McIntyre (supervising sound editors); Mark Keatts (supervising dialogue editor);  Evan Dockter, Andrew Ing, Lawrence Reyes, Marc Schmidt, Ezra Walker (sound effects editors); Aran Tanchum (Foley editor); Kelly Ann Foley, Patrick J. Foley, Mike Garcia, John Reynolds (dialogue editors); George Peters (ADR editors); Vincent Guisetti (Foley artist)\n|-\n| Lego DC Super Hero Girls: Super-Villain High || Devon Bowman, Rob McIntyre (supervising sound editors); Mark Keatts (supervising dialogue editor); Evan Dockter, Ian Nyeste, George Peters, Lawrence Reyes, Derek Swanson (sound effects editors);  David M. Cowan, Kelly Ann Foley, Patrick J. Foley, Mike Garcia, John Reynolds (dialogue editors); Jonathan Abelardo, Mark Mercado, Peter Munters (ADR editors); Robert J. Kral (music editor); Vincent Guisetti (Foley artist)\n|-\n| Suicide Squad: Hell to Pay || Devon Bowman, Rob McIntyre (supervising sound editors); Evan Dockter, Ian Nyeste, Lawrence Reyes (sound effects editors); Alfredo Douglas, Aran Tanchum (Foley editors); Greg Crawford (dialogue editor); Jonathan Abelardo, Mark Mercado (ADR editors); Christine H. Luethje (music editor); Vincent Guisetti (Foley artist)\n|-\n| Trollhunters: Tales of Arcadia || Matthew Thomas Hall (supervising sound editor); Jason Oliver (supervising dialogue editor); James Miller (sound effects editor); Carlos Sanches (dialogue editor); Stacey Michaels, Aran Tanchum (Foley editors); Vincent Guisetti, Alex Ullrich (Foley artists)\n|-\n| rowspan=7 style=\"text-align:center\" | 2019|| style=\"background:#FAEB86;\" | Lego DC Batman: Family Matters || style=\"background:#FAEB86;\" | D.J. Lynch, Rob McIntyre (supervising sound editors); Lawrence Reyes (sound designer); Ezra Walker (sound effects editor); Derek Swanson, Aran Tanchum (Foley editors); George Peters (ADR editor); Vincent Guisetti (Foley artist)\n|-\n| Batman: Hush || D.J. Lynch, Rob McIntyre (supervising sound editors); Evan Dockter (sound designer); Lawrence Reyes, Derek Swanson (sound effects editors); Alfredo Douglas, Aran Tanchum (Foley editors); Vincent Guisetti (Foley artist)\n|-\n| Batman vs. Teenage Mutant Ninja Turtles || Jeff Shiffman (supervising sound editor); Mark Keatts (supervising ADR editor); Jessey Drake, Kevin A. Hart, Mitchell Lestner (sound effects editors); Kelly Ann Foley (dialogue editor), Patrick J. Foley (dialogue editor), Mike Garcia (dialogue editor), Tess Fournier (Foley editor)\n|-\n| Invader Zim: Enter the Florpus || Kate Finan, Jeff Shiffman (supervising sound editors); Jessey Drake, Tess Fournier, Benjamin Gieschen, Mitchell Lestner, Greg Rubin (sound effects editors); Carol Ma (Foley editor); Jonathan Hylander (dialogue editor)\n|-\n| Lucky || Jeff Shiffman (supervising sound editor); Tess Fournier, Brad Meyer (sound effects editors); Carol Ma (Foley editor); Michael Wessner (dialogue editor)\n|-\n| Reign of the Supermen || rowspan=\"2\"| D.J. Lynch, Rob McIntyre (supervising sound editors); Evan Dockter (sound designer); Ezra Walker (sound effects editor); Alfredo Douglas, Aran Tanchum (Foley editors); Vincent Guisetti (Foley artist)\n|-\n| Wonder Woman: Bloodlines\n|}\n2020s\n{| class=\"wikitable\" width=\"100%\" cellpadding=\"5\"\n|-\n! width=\"5%\" | Year\n! width=\"25%\" | Film/Series\n! width=\"20%\" | Episode\n! width=\"43%\" | Winners/Nominees\n! width=\"7%\" | Network\n|-\n| rowspan=7 style=\"text-align:center\" | 2020|| colspan=\"2\" style=\"background:#FAEB86;\" | '''Mortal Kombat Legends: Scorpion's Revenge || style=\"background:#FAEB86;\" |D.J. Lynch, Rob McIntyre (supervising sound editors); Evan Dockter, Marc Schmidt (sound designers); Mark A. Keatts (supervising ADR editor); Roger Pallan, Lawrence Reyes, Ezra Walker (sound effects editors); Roberto Allegria, Derek Swanson (Foley editors); David M. Cowan, Kelly Foley Downs, Patrick Foley, Mike Garcia (dialogue editors); Jon Abelardo, Mark Mercado (ADR editors) || style=\"background:#FAEB86;\" |Warner Bros.'\n|-\n| colspan=\"2\"| The Boss Baby: Get That Baby! || Jeff Shiffman (supervising sound editor); Ian Howard, Greg Rubin (sound effects editors); Carol Ma (Foley editor); Kerry Iverson-Brody, Xinyue Yu (dialogue editors) || rowspan=\"2\"|Netflix\n|-\n| colspan=\"2\"| The Epic Tales of Captain Underpants:The Xtreme Xploits of the Xplosive Xmas || Jeff Shiffman (supervising sound editor); Kerry Iverson-Brody (supervising dialogue editor); Jessey Drake, Greg Rubin (sound effects editors); Carol Ma (Foley editor); Xinyue Yu (dialogue editor)\n|-\n| colspan=\"2\"| Batman: Death in the Family || Devon Bowman (supervising sound editor); Robert Hargreaves (sound designer); Mark A. Keatts (supervising ADR editor); Alfredo Douglas, George Peters (sound effects editors); Kelly Foley Downs, Patrick Foley (dialogue editors); John Reynolds (ADR editor); Christopher Drake (music editor) || Warner Bros.\n|-\n| colspan=\"2\"| ''Ducktales: Let's Get Dangerous! || Jeff Shiffman (supervising sound editor), Katie Maynard (sound effects editor), Carol Ma (Foley editor), Xinyue Yu (dialogue editor) || Disney XD\n|-\n| colspan=\"2\"| The Loud House: Schooled! || Tess Fournier (supervising sound editor/sound effects editor); Katie Maynard, Brad Meyer, Tim Vindigni (sound effects editors); Carol Ma (Foley editor); John Deligiannis (dialogue editor) || Nickelodeon\n|-\n| colspan=\"2\"| To Your Last Death || Michael Archacki (supervising sound designer/editor), Matthew Schaff (sound editor) || Quirk Pictures\n|-\n| rowspan=6 style=\"text-align:center\" | 2021\n! colspan=\"4\"|Outstanding Achievement in Sound Editing – Non-Theatrical Animation\n|-\n| style=\"background:#FAEB86;\" |Arcane || style=\"background:#FAEB86;\" |\"When These Walls Come Tumbling Down\" || style=\"background:#FAEB86;\" |'Brad Beaumont, Eliot Connors (supervising sound editors); Alexander Temple (supervising music editor); Shannon Beaumont (supervising ADR editor); Alexander Ephraim (Foley editor); Dan O' Connell, John Cucci (Foley artists); Alex Seaver (music editor) || style=\"background:#FAEB86;\" |Netflix'\n|-\n| colspan=\"2\"|Lego Star Wars: Terrifying Tales || David W. Collins, Matthew Wood (supervising sound editors); David W. Collins (sound designer); Justin Doyle, Bonnie Wild (sound editors); Frank Rinella (Foley editor); Kimberly Patrick, Andrea Gard (Foley artists) || rowspan=\"2\"|Disney+\n|-\n| What If...? || \"What If... Doctor Strange Lost His Heart Instead of His Hands?\" || Mac Smith (supervising sound editor); Bill Rudolph, Alyssa Nevarez (sound effects editors); Cheryl Nardi (dialogue editor); Anele Onyekwere (supervising music editor); Tom Kramer (music editor); John Roesch, Shelley Roden (Foley artists)\n|-\n| Maya and the Three'' || \"Chapter 9: The Sun and the Moon\" || Scott Martin Gershin (supervising sound editor); Chris Richardson, Andrew Vernon, Scott Martin Gershin (sound designers); David Barbee, Masanobu \"Tomi\" Tomita (sound effects editors); Dan O'Connell (Foley artist); Andres Locsey (music editor) || rowspan=\"2\"|Netflix\n|-\n| colspan=\"2\"| White Snake 2: The Tribulation of the Green Snake || Gary Chen (supervising sound editor; sound designer); Wang Shuangshuang, Gary Chen, Mango Mok, Ji Hongrui, Irene Sun, Qiu Yi (sound effects editors); Listen Zhang, Liu Huizhe (ADR editors); Liu Huizhe, Cui Lin (Foley editors); Wang Ziwei, Miao Yin, Zhang Jindong, Xin Shengnan (Foley artists)\n|-\n| rowspan=\"4\" |2022\n| colspan=\"2\" style=\"background:#FAEB86;\" |Rise of the Teenage Mutant Ninja Turtles: The Movie|| style=\"background:#FAEB86;\" |Jeff Shiffman (supervising sound editor); Jessey Drake, Brad Meyer (sound effects editor); Xinyue Yu (dialogue editor); Carol Ma (Foley editor)|| style=\"background:#FAEB86;\" |Netflix\n|-\n| colspan=\"2\" |The Ice Age Adventures of Buck Wild || Leff Lefferts (supervising sound editor); Shaun Farley, Chris Manning (sound effects editor); E. Larry Oatfield (dialogue editor); John Roesch, Ronni Brown, Sean England (Foley artist) || rowspan=\"2\" |Disney+\n|-\n| colspan=\"2\"|Lego Star Wars: Summer Vacation || David W. Collins, Matthew Wood (supervising sound editors); David W. Collins (sound designer); Kevin Bolen, Bill Rudolph (sound effects editors); Eryne Prine (Foley editor); Frank Rinella (Foley supervisor); Margie O'Malley (Foley artist)\n|-\n| Jurassic World Camp Cretaceous || \"Hidden Adventure\" || Rob McIntyre, D.J. Lynch (supervising sound editors); Evan Dockter (sound designer); Adam Cioffi, Ian Nyeste, Cat Gensler, Roger Pallan (sound effects editors); Anna Adams (dialogue editor); Aran Tanchum (Foley editor) ||Netflix\n|-\n|}\nExternal links\n*[http://www.mpse.org/ Official MPSE website]\nReferences"
    }
  ]
}