{
  "content": [
    {
      "type": "text",
      "text": "# Golden Melody Award for Traditional Arts and Music\n\nThe Golden Melody Awards for Traditional Arts and Music (GMATAM) honors individuals and groups engaged in traditional arts, music, and opera performance in Taiwan. Initially organized by the Government Information Office, Executive Yuan, it transitioned to the jurisdiction of the Bureau of Audiovisual and Music Industry Development, Ministry of Culture. It's now overseen by the National Center for Traditional Arts, a division of the Ministry of Culture.\nHistory\nBackground\nThe Government Information Office, Executive Yuan, initiated the Golden Melody Awards in late 1988, with the inaugural event taking place the subsequent year. The awards were established to elevate the quality of popular music, inspire those in music production, and serve as Taiwan's premier music honor.\nInitial Stage\nSince 1989, the Golden Melody Awards have been held regularly every year. Over the seven years, the Government Information Office, Executive Yuan, had undergone many discussions and reviews. To increase efficiency and reduce the costs of human and financial resources, and to broaden the horizon of the Golden Melody Awards, other music genres, such as classical music, folk music, local theater, folklore, talk performance, and children's music were included in the awards in addition to popular music. Therefore, starting from the 8th awards in 1997, the musical album category of “Golden Tripod Awards” and the “Golden Melody Awards” were merged, and the awards were re-designed by dividing the individual awards into the “Popular Music Category” and the “Non-Popular Music Category.”\nSince the 12th Golden Melody Awards in 2001, the category formerly known as “Non-Popular Music Category” was renamed the “Traditional and Artistic Music Category” to prevent the public from misunderstanding that non-popular music is a music genre that has fallen out of favor. In 2012, following the dissolution of the Government Information Office and the establishment of the Ministry of Culture, the operation of the Golden Melody Awards, which the Government Information Office previously presented, was integrated into the Bureau of Audiovisual and Music Industry Development, Ministry of Culture. Since 2014, the Golden Melody Awards have been divided into two separate honors. The “Pop Music Category” continued to be held by the Bureau of Audiovisual and Music Industry Development. At the same time, the “Traditional and Artistic Music Category” was handed over to the National Center for Traditional Arts, in charge of judging and awarding. It has been officially renamed the “Golden Melody Awards for Traditional Arts and Music.”\nThe Name and the Numbering of the Awards Remain Unchanged\nThe original “Golden Melody Awards” (GMA) held a special place in the hearts of people in Taiwan as the most representative music award. Therefore, when the Golden Melody Awards was restructured in 2014, the Ministry of Culture took steps to preserve its historical significance and brand name. They formally named the category of “Traditional and Artistic Music Category” as “Golden Melody Awards for Traditional Arts and Music” (GMATAM), retaining the essence of the old name “Golden Melody Awards”. Simultaneously, the years of the awards were numbered consecutively from the 25th year of the GMA. Furthermore, other awards categories were restructured into two main fields: the “Publishing Category” and the “Theatrical Performance Category.”\nDevelopments\nIn 2015, to elevate the international profile of the Awards and to enhance the visibility of Sinophone music and traditional performing arts, the criteria for the 26th Awards were revised, removing nationality restrictions for the “Publishing Category,” except for the individual award in the “Theatrical Performance Category.” In 2017, at the 27th Awards, the “Performer of the Year” category was added, and the age limit for the “Best Individual Newcomer” award was decreased, ensuring a more comprehensive and inclusive promotion of artists in the Theatrical Performance Category.\nThe Golden Melody Awards for Traditional Arts and Music have undergone continual review and improvement year after year, with the competition format and award criteria evolving in tandem. In 2019, the original “Best Creation Award” was segmented into three distinct awards: “Best Composition,” “Best Lyrics,” and “Best Arrangement.” For the “Theatrical Performance Category,” new accolades, namely the “Best Theatre Script” and the “Best Musical Design,” were introduced, accompanied by some renaming of existing categories. 2021 witnessed the introduction of the “Best Director” award. 2022 heralded the addition of the “Jury Award” and the “Best Performance by a Leading Puppeteer,” while the “Best Performer” and the “Best Performance by a Leading Puppeteer” underwent revisions, ensuring that they weren’t restricted to a solitary recipient. Moreover, the “Best Individual Newcomer” was rebranded as the “Best Youth Performer.” In 2023, the “Publishing Category” was renamed the “Music Category.”\nReferences"
    }
  ]
}