{
  "content": [
    {
      "type": "text",
      "text": "# Golden Mike Award\n\n| website        =\n}}\nThe Golden Mike Award is a broadcast journalism award presented by the Radio and Television News Association (RTNA) of Southern California. Awards are given in the categories of television news and radio news. Eligibility is limited to a select group of Southern California counties. Golden Mike (i.e., \"microphone\") Awards are presented at a gala dinner in Hollywood every January.\nHistory\nThe RTNA started out as the Southern California Newscasters Association. Golden Mike Awards were first given out in 1950.\nAward details\nEligibility for a Golden Mike Award is limited to the California counties of Los Angeles, Orange, San Diego, Riverside, San Bernardino, Ventura, Santa Barbara, San Luis Obispo, Fresno, Imperial, Inyo, Kern, Kings, and Tulare.\nThe awards are divided into two categories: TV and Radio. Depending on the size of the station in question, each award is divided into two categories, A and B. In the television category, Division A comprises stations with 50 or more full-time news staff members, while Division B comprises stations with fewer than 50 full-time news staff members. In the radio category, Division A is made up of stations with 6 or more full-time news staff members, and Division B is made up of stations with 5 or fewer full-time news staff members.\nNot every category (or division) is necessarily awarded each year. As stated on the Golden Mike Award website, \"if the judges decide that no entry in a category meets the 'Standard of Excellence,' then no award is given in that category.... As a result, Golden Mike Award winners know that their work has been judged to be 'excellent', as well as the 'best'.\"\nTV categories\n* Best News Broadcast – 60 Minutes – Airing Between 4&nbsp;pm and Midnight Only\n* Best News Broadcast – 30 Minutes or Less – Airing Between 4 Pm and Midnight Only\n* Best Daytime News Broadcast – Any Length – Airing Between Midnight and 4&nbsp;pm\n* Best Sports Segment\n* Best Weather Segment\n* Best Traffic Report\n* Best Newscast Writing\n* Best Individual Writing\n* Best Sports Reporting\n* Best Spot News Reporting\n* Best Live Coverage of a News Story\n* Best Documentary\n* Best News Public Affairs Program\n* Best News Reporting\n* Best News Reporting by a Cable or Broadcast Network\n* Best Hard News Series Reporting\n* Best Light News Series Reporting\n* Best News Special\n* Best Investigative Reporting\n* Best Serious Feature Reporting\n* Best Light Feature Reporting\n* Best Entertainment Reporting\n* Best Business and Consumer Reporting\n* Best Government and Political Reporting\n* Best Medical and Science Reporting\n* Best News Videography of a Hard News Story, Series or Special\n* Best News Videography of a Feature Story, Series or Special\n* Best Video Editing of a Hard News Story, Series or Special\n* Best Video Editing of a Feature Story, Series or Special\n* Best Internet News Reporting\nRadio categories\n* Best News Broadcast\n* Best News Broadcast Under 15 Minutes\n* Best Newscast Writing\n* Best Sports Segment\n* Best Traffic Report\n* Best Individual Writing\n* Best Sports Reporting\n* Best \"Spot\" News Reporting\n* Best \"Live\" Coverage of a News Story\n* Best Documentary\n* Best News Public Affairs Program\n* Best News Reporting\n* Best News Reporting by a Radio Network or Content Syndicator\n* Best Hard News Series Reporting\n* Best Feature News Series Reporting\n* Best Investigative Reporting\n* Best Serious Feature Reporting – One Minute or Longer\n* Best Serious Feature Reporting – Shorter Than One Minute\n* Best Light Feature Reporting – One Minute or Longer\n* Best Light Feature Reporting – Shorter Than One Minute\n* Best News Special\n* Best Entertainment Reporting\n* Best Business and Consumer Reporting\n* Best Government and Political Reporting\n* Best Medical and Science Reporting\n* Best Use of Sound\n* Best Internet News Reporting\nRecipients\nIndividual recipients of the Golden Mike Award include Robert Kovacik, Keith Olberman, Frank Mottek, Carlos Amezcua, Joan Van Ark, Greg Barron, Richard Beebe, Bill Bertka, Sam Chu Lin, David Cruz (journalist), Leila Feinstein, Laurie Fernandez, Michael Finney, Christina Gonzalez, Henry Goren, Bill Griffeth, Maria Hall-Brown, Mike Hodel, Sharon Ito, Patricia Janiot, Sharon Janis, Jaime Jarrín, Sandra Maas, Paul Magers, John Mattes, Felicitas Méndez, Sylvia Mendez, Tracey Miller, Byron Miranda, Conan Nolan, Dallas Raines, Rick Reiff, Sam Rubin, Michele Ruiz, Marta Russell, Cara Santa Maria, Matt Schrader, Mark Steines, D Stevens, Marcos Villatoro, and Marta Waller.\nGolden Mike Lifetime Achievement and \"Broadcast Legend\" Award-winners include Larry King, Regis Philbin, and Bob Miller.\nWith 12 wins, TV reporter Robert Kovacik has collected the most Golden Mike Awards, with Keith Olberman coming in second with 11 Golden Mikes. Frank Mottek has also won the award multiple times, with five Golden Mikes.\nBetween 2001 and 2010, KCLU-FM won more than 60 Golden Mike Awards.\n* Best Videotape Editing — Christina Gonzalez for California AIDS Ride\n1996\n* Best Documentary — ''Disabled & the Cost of Saying 'I Do' for KCET\n* Best Radio Spot News Story — Frank Mottek for \"Standoff in Silver Lake\" for KNX (AM)\n1997\n* Best Documentary — Christina Gonzalez for Through the Eyes of the Children: War in Bosnia\n1998\n* Best Live TV Coverage of a News Story — Frank Mottek for \"Wrath of El Niño\" on KCBS-TV\n1999\n* Christina Gonzalez for her reporting on religious pilgrimages in Cuba and Haiti\n2001\n* Best Original News Commentary — Rick Reiff\n2002\n* Entertainment Reporting — Henry Goren for \"A Star Is Born\" for KCOP-TV-13\n2003\n* Best Documentary — Mendez vs. Westminster: For All the Children for KOCE-TV\n* Best Weathercaster in Southern California — Byron Miranda\n2006\n* Best Spot News coverage — Robert Kovacik\n2007\n* Maria Hall-Brown\n2008\n* Robert Kovacik for \"Paparazzi Task Force\"\n* Best Newscast Writing – Gary Daigneault of KCDZ\n* Lifetime Achievement — Larry King\n2009\n* Marcos Villatoro\n2010\n* Best Documentary — Robert Kovacik for LA Heroes: Untold Stories of Haiti\n* Broadcast Legend Award — Regis Philbin\n2011\n* Best Business and Consumer Reporting — Frank Mottek\n* Best Investigative Reporting — KCET\n* Best News Public Affairs Program in Southern California, Division B — \"Inside OC with Rick Reiff\" on KOCE-TV\n2012\n* Tami Roleff of KCDZ for story about a man who survived being lost in the desert for nine days\n* Best News Public Affairs Program in Southern California, Division B — Rick Reiff/\"SoCal Insider\" on KOCE-TV\n* Best TV Spot News Story – Jay Jackson and Laurie Fernandez for \"Anaheim Police Shooting\"\n* Best TV Video Editing — Laurie Fernandez for \"Anaheim Police Shooting\"\n* Best TV News Videography — Laurie Fernandez for \"Anaheim Police Shooting\"\n2013\n* Best News Public Affairs Program in Southern California, Division B — Rick Reiff/\"SoCal Insider\" on KOCE-TV\n* Best \"News Special\"— Frank Mottek for \"Healthcare Uncovered\" on KNX\n2015\n* Best Light Feature Reporting — Robert Kovacik for \"Night Crawlers\"\n* Lifetime Achievement Award — Bob Miller\n2016\n* Best Political and Government Reporting — Robert Kovacik for \"LAPD and the Mafia Hitman: From Killer to Keynote Speaker\"\n* Best Business and Consumer Reporting — Robert Kovacik for \"Stolen Gas\"\n2018\n* David Haldane of KCDZ for feature on efforts by local firefighters to help special needs children play baseball for Yucca Valley's Miracle League\n* Best Documentary, Division A — That Far Corner: Frank Lloyd Wright in Los Angeles by KCET\n* Best Documentary, Division B — Iconic Vision: John Parkinson, Architect of Los Angeles by PBS SoCal\n* Best Entertainment Reporting, Division A — \"When Women Called the Shots: The Forgotten Story of Early Hollywood's Female Filmmakers\" from KCET's Lost L.A. series\n* Best Entertainment Reporting, Division B — \"Veterans and the Shakespeare Center\" from PBS SoCal's LAaRT series\n* Best Light Feature Reporting, Division A — KCET's Made in L.A.\n* Best News Public Affairs Program — KCET's SoCal Connected\n* Best News Videography, Division A — \"Sea Level Rising: Living with Water” episode of KCET's Earth Focus series\n2019\n* Anchor, Best 30-Minute Newscast, 11pm — Robert Kovacik\n* Anchor, Best 60-Minute Newscast, 6pm — Robert Kovacik\n* Reporter, Best Continuing Coverage — Robert Kovacik for \"Borderline Shooting”\n2020\n* Reporter, Best Continuing Coverage — Robert Kovacik for \"Kobe Bryant's Death\"\n* Best 30-Minute Newscast, 11pm — Robert Kovacik\n2021\n* Best Business and Consumer Reporting — Frank Mottek for \"On Money\"\n* Reporter, Best TV Sports Reporting — Robert Kovacik for \"An Olympic Hopeful at 60\" -->\nOther Golden Mike/Mic awards\nOver the years, a number of organizations in the U.S., the Far East, and South Asia have given out so-called \"Golden Mike Awards\", for journalists, broadcasters, and public speakers (with \"mike\" or \"mic\" referring to a microphone). For example:\n* Golden Mike Award presented by the Broadcasters Foundation of America\n* Golden Mike Award for Women in Radio and Television presented by ''McCall's'' from 1951 to 1967\n* Golden Mike Award presented by the American Federation of Television and Radio Artists in the 1970s\n* Golden Mike Award presented by United Press International in the 1970s and 1980s\n* Golden Mike Award presented by the Broadcast Pioneers in the 1980s\n* Golden Mike Award presented by the National Religious Broadcasters (NRB) in the 1990s\n* Golden Mike Award presented by the National Speakers Association in the 1990s\n* Golden Mike Award presented by the Louisville Chapter of the Society of Professional Journalists in the 1990s\n* Golden Mike Award presented by the New Hampshire Association of Broadcasters (NHAB) from 1993 into the 2000s\n* Golden Mike Award of the Chinese People's Republic presented from the 1990s into the 2010s\n* Golden Mike Award presented by the Louisiana Association of Broadcasters in the 2010s\n* Golden Mike Award presented in India for achievement in radio in the 2010s\n* Golden Mic Awards of Singapore's Mediacorp presented from 1998 to 2016 (originally known as the Singapore Radio Awards)\nIn addition, the Billboard Music Awards presents a trophy in the shape of a golden microphone to each winner.\nReferences\nExternal links\n* [https://www.rtnasocal.org Radio & Television News Association of Southern California website]"
    }
  ]
}