{
  "content": [
    {
      "type": "text",
      "text": "# Golgi reassembly-stacking protein 2\n\nGolgi reassembly-stacking protein 2 ( GRS2) also known as Golgi reassembly-stacking protein of 55&nbsp;kDa (GRASP55) is a protein that in humans is encoded by the GORASP2 gene. It was identified by its homology with GORASP1 and the protein's amino acid sequence was determined by analysis of a molecular clone of its complementary DNA. The first (N-terminus) 212 amino acid residues of GORASP2 are highly homologous to those of GORASP1, but the remainder of the 454 amino acid residues are highly diverged from GORASP1. The conserved region is known as the GRASP domain, and it is conserved among GRASPs of a wide variety of eukaryotes, but not plants. The C-terminus portion of the molecule is called the SPR domain (serine, proline-rich). GORASP2 is more closely related to homologues in other species, suggesting that GORASP2 is ancestral to GORASP1. GORASP2 is found associated with the medial and trans cisternae of the Golgi apparatus.\nFunction\n'']]\nGORASP2 is involved in establishing the structure of the Golgi apparatus. It is a peripheral membrane protein located on the Golgi cisterna, and it can bind to another GRS2 located on an adjacent cisterna through the GRASP domain, thus linking the cisternae together through multiple protein–protein interactions.\nGRS2 is attached to the membrane in two ways; it is myristylated, which attaches it directly to the lipid bilayer; it is also bound indirectly by binding to golgin-45, which binds to a Rab protein, which itself is lipidated and thus anchored to the membrane.\nThe structure of the Golgi is disrupted during mitosis, and phosphorylation of the SPR domains of GORASP2 and GORASP1 regulate that disruption,\nGORASP2 may also be involved in forming Golgi ribbons, but the evidence is mixed.\nOther interactions\nGORASP2 has been shown to interact with TGF alpha, TMED2 and GOLGA2.\nReferences\nFurther reading\n*\n*\n*\n*\n*\n*\n*\n*\n*"
    }
  ]
}