{
  "content": [
    {
      "type": "text",
      "text": "# Gonggong (dwarf planet)\n\n| discovery_site = Palomar Obs.\n| discovered = 17 July 2007\n| mpc_name = (225088) Gonggong\n| alt_names =\n| Snow White (nickname)\n}}\n| named_after = Gònggōng (共工)\n| pronounced =\n| mp_category = SDO3:10 res.}}dwarf planet\n| orbit_ref =\n| epoch = 21 November 2025 (JD 2461000.5)\n| uncertainty = 3\n| observation_arc =  ()\n| earliest_precovery_date = 19 August 1985\n| aphelion =\n| perihelion =\n| semimajor =\n| eccentricity = 0.50318\n| period = 547.13 yr (199,837 days)\n| mean_anomaly = 111.384°\n| mean_motion = day\n| inclination = 30.8664°\n| asc_node = 336.8401°\n| time_periastron = 17 February 1857\n| arg_peri = 206.6442°\n| satellites = 1 (Xiangliu)\n| mean_radius =\n| mean_diameter =\n| mass =\n| density =\n| surface_grav = ≈  m/s2\n| escape_velocity = ≈  km/s\n| rotation =  or\n| albedo =\n| spectral_type = B−V=V−R=V−I=\n| magnitude = 21.4\n| abs_magnitude = 2.342.01.84\n}}\nGonggong (minor-planet designation: 225088 Gonggong) is a dwarf planet and a member of the scattered disc beyond Neptune. It has a highly eccentric and inclined orbit during which it ranges from  from the Sun. , its distance from the Sun is , and it is the sixth-farthest known Solar System object. According to the Deep Ecliptic Survey, Gonggong is in a 3:10 orbital resonance with Neptune, in which it completes three orbits around the Sun for every ten orbits completed by Neptune. Gonggong was discovered in July 2007 by American astronomers Megan Schwamb, Michael Brown, and David Rabinowitz at the Palomar Observatory, and the discovery was announced in January 2009.\nAt approximately  in diameter, Gonggong is similar in size to Pluto's moon Charon, making it the fifth-largest known trans-Neptunian object (apart possibly from Charon). It may be sufficiently massive to be in hydrostatic equilibrium and therefore a dwarf planet. Gonggong's large mass makes retention of a tenuous atmosphere of methane just possible, though such an atmosphere would slowly escape into space. The object is named after Gònggōng, a Chinese water god responsible for chaos, floods and the tilt of the Earth. The name was chosen by its discoverers in 2019, when they hosted an online poll for the general public to help choose a name for the object, and the name Gonggong won.\nGonggong is red, likely due to the presence of organic compounds called tholins on its surface. Water ice is also present on its surface, which hints at a brief period of cryovolcanic activity in the distant past. With a rotation period of around 22 hours, Gonggong rotates slowly compared to other trans-Neptunian objects, which typically have periods of less than 12 hours. The slow rotation of Gonggong may have been caused by tidal forces from its natural satellite, named Xiangliu.\nHistory\nDiscovery\nat Palomar Observatory]]\nGonggong was discovered by American astronomers Megan Schwamb, Michael Brown and David Rabinowitz on 17 July 2007. The discovery was part of the Palomar Distant Solar System Survey, a survey conducted to find distant objects in the region of , beyond  from the Sun, using the Samuel Oschin telescope at Palomar Observatory near San Diego, California. The survey was designed to detect the movements of objects out to at least 1,000&nbsp;AU from the Sun. Schwamb identified Gonggong by comparing images using the blinking technique. In the discovery images, Gonggong appeared to move slowly, suggesting that it is a distant object. The discovery was part of Schwamb's doctoral thesis. At that time, Schwamb was a graduate student of Michael Brown at the California Institute of Technology.\nGonggong was formally announced in a Minor Planet Electronic Circular on 7 January 2009. It was then given the provisional designation  because it was discovered during the second half of July 2007. The last letter and numbers of its designation indicate that it is the 267th object discovered during the latter half of July., the first letter 'O' corresponds to the second half-month of July 2007 while the last letter 'R' indicates that it is the 17th object discovered on the 11th cycle of discoveries. Each completed cycle consists of 25 letters representing discoveries, hence 17 + (10 completed cycles × 25 letters)  267.}} , it has been observed 484 times over 23 oppositions, and has been identified in two precovery images, with the earliest image taken by the La Silla Observatory on 19 August 1985.\nName and symbol\nThe object is named after Gònggōng, a water god in Chinese mythology. Gonggong is depicted as having a copper-and-iron, red-haired human head (or sometimes torso) and the body or tail of a serpent. Gonggong was responsible for creating chaos and catastrophe, causing flooding and tilting the Earth, until he was sent into exile. Gonggong is often accompanied by his minister, Xiangliu, a nine-headed poisonous snake monster who was also responsible for causing flooding and destruction.\nBefore its official naming, Gonggong was the largest known unnamed object in the Solar System. Initially after the discovery of Gonggong, Brown nicknamed the object \"Snow White\" for its presumed white color based on his assumption that it may be a member of the icy Haumea collisional family. The nickname also fit because, by that time, Brown's team had discovered seven other large trans-Neptunian objects which were collectively referred to as the \"seven dwarfs\":  in 2002,  in 2003, ,  and  in 2004, and  and  in 2005. However, Gonggong turned out to be very red in color, comparable to Quaoar, so the nickname was dropped. On 2 November 2009, two years after its discovery, the Minor Planet Center assigned the minor planet number 225088 to Gonggong.\nWhen Gonggong's discovery was first announced, Brown did not name it, as he considered it to be an unremarkable object, despite its large size. In 2011, he declared that he now had enough information to justify naming it, because of the discovery of water ice and the possibility of methane on its surface, which made it noteworthy enough to warrant further study. Following the Kepler spacecraft's large revision of Gonggong's size in 2016, Schwamb justified that Gonggong was eligible for naming, an acknowledgement of its large size and that its characteristics were known with enough certainty for a name to be given to reflect them.\nIn 2019, the discoverers of Gonggong hosted an online poll for the general public to choose between three possible names: Gonggong (Chinese), Holle (German), and Vili (Norse). These were selected by the discoverers in accordance with the International Astronomical Union's (IAU's) minor planet naming criteria, which state that objects with orbits like that of Gonggong must be given names related to mythological figures that are associated with creation. The three options were chosen because they were associated with water, ice, snow, and the color red—all characteristics of Gonggong—and because they had associated figures that could later provide a name for Gonggong's satellite. The name for Gonggong's satellite was not chosen by the hosts of the naming poll, as this privilege is reserved for its discoverers.\nHaving gained 46 percent of the 280,000 votes, on 29 May 2019, the discovery team announced Gonggong as the winning name. The name was proposed to the IAU's Committee on Small Body Nomenclature (CSBN), which is responsible for naming minor planets. The name was accepted by the CSBN and was announced by the Minor Planet Center on 5 February 2020.\nAs planetary symbols are no longer used regularly in astronomy, Gonggong never received a symbol in the astronomical literature. A symbol , used mostly among astrologers, is included in Unicode as . The symbol was designed by Denis Moskowitz, a software engineer in Massachusetts; it combines the Chinese character 共 gòng with a snake's tail.\nOrbit\n3:10 resonance with Neptune. This animation consists of 16 frames covering 26,000 years. Neptune (white dot) is held stationary.]]\n(years 2000 to 2050)]]\nGonggong orbits the Sun at an average distance of , and completes a full orbit in 547 years. The orbit of Gonggong is highly inclined to the ecliptic, with an orbital inclination of 30.9 degrees. Its orbit is also highly eccentric, with a measured orbital eccentricity of 0.50. Due to its highly eccentric orbit, the distance of Gonggong from the Sun varies greatly over the course of its orbit, from  at aphelion, its furthest point from the Sun, to around  at perihelion, its closest point to the Sun. Gonggong last reached perihelion in 1857, and is currently moving farther from the Sun, toward its aphelion. Gonggong will reach aphelion by 2134.\nThe period, inclination and eccentricity of Gonggong's orbit are all rather extreme compared to other large bodies in the Solar System. Among likely dwarf planets, its period is the third-longest, at 547 years compared to 561 years for  and the ca. 11,400 years of . Its 31° inclination is second, after 44° for Eris, and its 0.50 eccentricity is also (a rather distant) second, after Sedna at 0.85.\nThe Minor Planet Center lists it as a scattered disc object for its eccentric and distant orbit. The Deep Ecliptic Survey shows the orbit of Gonggong to be in a 3:10 resonance with Neptune; Gonggong completes three orbits around the Sun for every ten orbits completed by Neptune.\n, Gonggong is about  from the Sun and is moving away at a speed of . It is the eleventh-farthest known Solar System object from the Sun, preceding  (89.5&nbsp;AU),  (89.6&nbsp;AU),  (90.3&nbsp;AU),  (92.4&nbsp;AU),  (95.9&nbsp;AU),  (97.2&nbsp;AU),  (99.0&nbsp;AU),  (111.0&nbsp;AU),  (123.5&nbsp;AU), and  (~ 132&nbsp;AU). Gonggong is more distant than , which is located 84.3&nbsp;AU from the Sun . It has been farther from the Sun than Sedna since 2013, and it will surpass Eris in distance by 2045.\nBrightness\nGonggong has an absolute magnitude (H) of 2.34, which makes it the seventh-brightest trans-Neptunian object known. It is dimmer than  (H=2.31; D=917&nbsp;km) but brighter than Quaoar (H=2.82; D=1,110&nbsp;km). The Minor Planet Center and the Jet Propulsion Laboratory Small-Body Database assume a brighter absolute magnitude of 1.84, which would make it the fifth brightest trans-Neptunian object.\nBeing 88&nbsp;AU from the Sun, the apparent magnitude of Gonggong is only 21.5, and so it is too dim to be seen from Earth with the naked eye.}} Although closer to the Sun than the dwarf planet Eris, Gonggong appears dimmer, as Eris has a higher albedo and an apparent magnitude of 18.8.\nPhysical characteristics\nSurface and spectra\nThe surface of Gonggong has an albedo (reflectivity) of 0.14. The surface composition and spectrum of Gonggong is expected to be similar to that of , as both objects are red in color and display signs of water ice and possibly methane in their spectra. The reflectance spectrum of Gonggong was first measured in 2011 at near-infrared wavelengths, with the Folded port InfraRed Echellette (FIRE) spectrograph on the Magellan Baade Telescope at the Las Campanas Observatory in Chile. Gonggong's spectrum exhibits a strong red spectral slope along with broad absorption bands at wavelengths of 1.5&nbsp;μm and 2&nbsp;μm, meaning that Gonggong reflects more light at these wavelengths. Additional photometric measurements from the Hubble Space Telescope's Wide Field Camera 3 instrument display similar absorption bands at 1.5&nbsp;μm, which are characteristic features of water ice, a substance often found on large Kuiper belt objects. The presence of water ice on the surface of Gonggong implies a brief period of cryovolcanism in the distant past, when water erupted from its interior, deposited onto its surface, and subsequently froze.\nGonggong is among the reddest trans-Neptunian objects known, especially in the visible and near-infrared. Its red color is unexpected for an object with a substantial amount of water ice on its surface, which are typically neutral in color, hence why Gonggong was initially nicknamed \"Snow White\". Gonggong's color implies that methane is present on its surface, although it was not directly detected in the spectrum of Gonggong due to the low signal-to-noise ratio of the data. The presence of methane frost would account for its color, as a result of the photolysis of methane by solar radiation and cosmic rays producing reddish organic compounds known as tholins. Observations of Gonggong's near-infrared spectrum in 2015 revealed an absorption feature at 2.27&nbsp;μm, indicating the presence of methanol along with its irradiation products on its surface.\nGonggong is large enough to be able to retain trace amounts of volatile methane on its surface, even when at its closest distance to the Sun (33.2&nbsp;AU), where temperatures are higher than that of Quaoar. In particular, the large size of Gonggong means that it is likely to retain trace amounts of other volatiles, including ammonia, carbon monoxide, and possibly nitrogen, which almost all trans-Neptunian objects lose over the course of their existence. Like Quaoar, Gonggong is expected to be near the mass limit at which it is able to retain those volatile materials on its surface.\nIn 2022, low resolution near-infrared (0.7–5 &mu;m) spectroscopic observations by the James Webb Space Telescope (JWST) revealed the presence of significant amounts of ethane ice (C2H6) on the surface of Gonggong, though there appears to be less ethane on Gonggong than on Sedna. The JWST spectra also contain evidence of presence of small amounts of carbon dioxide (CO2) complexed with either dark surface material or some ices as well as complex organics. On the other hand no evidence of presence of methane (CH4) and methanol (CH3OH) was found at variance with the earlier observations.\nPossible atmosphere\nThe presence of tholins on the surface of Gonggong implies the possible existence of methane ice on the surface and a tenuous methane atmosphere analogous to Quaoar. Gonggong occasionally comes closer to the Sun than Quaoar, where it becomes warm enough for the methane ice on the surface to sublimate, possibly creating an atmosphere. Gonggong's larger mass makes the retention of methane just possible. During aphelion, methane along with other volatiles would condense on Gonggong's surface, allowing for long-term irradiation that would otherwise result in a decrease in surface albedo. The lower surface albedo would contribute to the loss of highly volatile materials such as nitrogen, as a lower albedo corresponds to more light being absorbed by the surface rather than being reflected, thus resulting in greater surface heating. Hence, the nitrogen content of Gonggong's atmosphere is expected to be depleted to trace amounts while methane is likely retained.\nGonggong is thought to have had cryovolcanic activity along with a more substantial atmosphere shortly after its formation. Such cryovolcanic activity is expected to have been brief, and the resulting atmosphere gradually escaped over time. Volatile gases, such as nitrogen and carbon monoxide, were lost, while less volatile gases such as methane are likely to remain in its present tenuous atmosphere.\nSize\n{| class=\"wikitable floatleft\" style=\"text-align: center; font-size: 0.9em; margin-right: 12px;\"\n|+ Size estimates\n|-\n! Year !! Diameter !! Method !! Refs\n|-\n| 2010\n| 1,752&nbsp;km\n| thermal\n|\n|-\n| 2011\n|\n| best fit albedo\n|\n|-\n| 2012\n|\n| thermal\n|\n|-\n| 2013\n|\n| thermal\n|\n|-\n| 2013\n| 1,290&nbsp;km\n| radiometric\n|\n|-\n| 2016\n|\n| thermal\n|\n|-\n| 2018\n|\n| radiometric\n|\n|}\nAs of 2019, Gonggong is estimated to have a diameter of , derived from radiometric measurements, its calculated mass, and assuming a density similar to other similar bodies. This would make Gonggong the fifth-largest trans-Neptunian object, after Pluto, Eris, Haumea and Makemake. Gonggong is approximately the size of Pluto's moon Charon, although Gonggong's current size estimate has an uncertainty of .\nGonggong has been classified as a dwarf planet by several astronomers. Brown states that Gonggong \"must be a dwarf planet even if predominantly rocky\", based on the 2013 radiometric measurement of . Scott Sheppard and colleagues think that it is likely to be a dwarf planet, based on its minimum possible diameter— under the assumption of a completely reflective surface with an albedo of 1{{refn|The resulting minimum diameter of 580&nbsp;km is derived from the equation  E=\\frac{1329}{\\sqrt{p}} 10^{-0.2H}, where H is the absolute magnitude of Gonggong, and p is the albedo of Gonggong, which in this case is assumed to be 1.|name=magnitude|group=lower-alpha}}—and what was at the time the expected lower size limit of around  for hydrostatic equilibrium in cold icy-rocky bodies. However, Iapetus is not in equilibrium despite being  in diameter, so this remains just a possibility.\nIn 2010, astronomer Gonzalo Tancredi initially estimated Gonggong to have a very large diameter of , though its dwarf planet status was unclear as there was no lightcurve data or other information to ascertain its size. Gonggong is too distant to be resolved directly; Brown placed a rough estimate of its diameter ranging from , based on an albedo of 0.18 which was the best fit in his model. A survey led by a team of astronomers using the European Space Agency's Herschel Space Observatory in 2012 determined its diameter to be  (), based on the thermal properties of Gonggong observed in the far infrared range. This measurement is consistent with Brown's estimate. Later observations in 2013 using combined thermal emission data from Herschel and the Spitzer Space Telescope suggested a smaller size of  (), though this estimate had a larger range of uncertainty.\nIn 2016, combined observations from the Kepler spacecraft and archival thermal emission data from Herschel suggested that Gonggong was much larger than previously thought, giving a size estimate of  () based on an assumed equator-on view and a lower estimated albedo of 0.089. This would have made Gonggong the third-largest trans-Neptunian object after Eris and Pluto, larger than Makemake (). These observations of Gonggong were part of the Kepler spacecraft's K2 mission which includes studying small Solar System bodies. Subsequent measurements in 2018 revised the size of Gonggong to  (), based on the mass and density of Gonggong derived from the orbit of its satellite and the discovery that the viewing direction was almost pole-on. With this size estimate, Gonggong is again thought to be the fifth-largest trans-Neptunian object.\nMass, density and rotation\nBased on the orbit of its satellite, the mass of Gonggong has been calculated to be , with a density of . Given the mass, the 2016 size estimate of  would have implied an unexpectedly low (and likely erroneous) density of .\nGonggong is the fifth most massive trans-Neptunian object, after Eris, Pluto, Haumea, and Makemake. It is slightly more massive and denser than Charon, which has a mass of  and a density of . Due to its large size, mass, and density, Gonggong is expected to be in hydrostatic equilibrium, taking the shape of a MacLaurin spheroid that is slightly flattened due to its rotation.\nThe rotation period of Gonggong was first measured in March 2016, through observations of variations in its brightness with the Kepler space telescope. Gonggong's light curve amplitude as observed by Kepler is small, only varying in brightness by about 0.09 magnitudes. The small light curve amplitude of Gonggong indicates that it is being viewed at a pole-on configuration, further evidenced by the observed inclined orbit of its satellite. The Kepler observations provided ambiguous values of  and  hours for the rotation period. Based on a best-fit model for its rotation pole orientation, the value of  hours is thought to be the more plausible one. Gonggong rotates slowly compared to other trans-Neptunian objects, which usually have periods between 6 and 12 hours. Due to its slow rotation, it is expected to have a low oblateness of 0.03 or 0.007, for rotation periods of 22.4 or 44.81 hours, respectively.\nSatellite\n, taken in 2009 and 2010 with the Wide Field Camera 3]]\nFollowing the March 2016 discovery that Gonggong was an unusually slow rotator, the possibility was raised that a satellite may have slowed it down via tidal forces. The indications of a possible satellite orbiting Gonggong led Csaba Kiss and his team to analyze archival Hubble observations of Gonggong. Their analysis of Hubble images taken on 18 September 2010 revealed a faint satellite orbiting Gonggong at a distance of at least . The discovery was announced in a Division for Planetary Sciences meeting on 17 October 2016. The satellite is approximately  in diameter and has an orbital period of 25 days. On 5 February 2020 the satellite was officially named Xiangliu, after the nine-headed poisonous snake monster that accompanied Gonggong in Chinese mythology. This naming came at the same time that Gonggong itself was officially named.\nExploration\nIt was calculated by planetary scientist Amanda Zangari that a flyby mission to Gonggong would take a minimum of over 20 years with current rocket capabilities. A flyby mission could take just under 25 years using a Jupiter gravity assist, based on a launch date of 2030 or 2031. Gonggong would be approximately 95 AU from the Sun when the spacecraft arrives.\nInitial publication at the American Astronomical Society DPS meeting #50, with the publication ID 311.02\n}}\nExternal links\n* [https://andrew-lowe.ca/2007or10.htm Precovery Images of Gonggong]\n* [http://www.cfa.harvard.edu/mpec/K09/K09V05.html Gonggong's minor planet designation number]\n* [https://hla.stsci.edu/hlaview.html#Inventory|filterText%3D%24filterTypes%3D|query_string=22%2016%2030.29%20%20%20-14%2024%2045.5&posfilename=&poslocalname=&posfilecount=&listdelimiter=whitespace&listformat=degrees&RA=334.126208&Dec=-14.412639&Radius=0.200000&inst-control=all&inst=ACS&inst=ACSGrism&inst=WFC3&inst=WFPC2&inst=NICMOS&inst=NICGRISM&inst=COS&inst=WFPC2-PC&inst=STIS&inst=FOS&inst=GHRS&imagetype=best&prop_id=&spectral_elt=&proprietary=both&preview=1&output_size=256&cutout_size=12.8|ra=&dec=&sr=&level=&image=&inst=ACS%2CACSGrism%2CWFC3%2CWFPC2%2CNICMOS%2CNICGRISM%2CCOS%2CWFPC2-PC%2CSTIS%2CFOS%2CGHRS&ds= Hubble images of Gonggong taken on 18 September 2010]\n* [https://hla.stsci.edu/hlaview.html#Inventory|filterText%3D%24filterTypes%3D|query_string=22%2022%2000%20-12%2034%2042%20r%3D5d&posfilename=&poslocalname=&posfilecount=&listdelimiter=whitespace&listformat=degrees&RA=335.500000&Dec=-12.578333&Radius=5.000000&inst-control=all&inst=ACS&inst=ACSGrism&inst=WFC3&inst=WFPC2&inst=NICMOS&inst=NICGRISM&inst=COS&inst=WFPC2-PC&inst=STIS&inst=FOS&inst=GHRS&imagetype=best&prop_id=15207&spectral_elt=&proprietary=both&preview=1&output_size=256&cutout_size=12.8|ra=&dec=&sr=&level=&image=&inst=ACS%2CACSGrism%2CWFC3%2CWFPC2%2CNICMOS%2CNICGRISM%2CCOS%2CWFPC2-PC%2CSTIS%2CFOS%2CGHRS&ds= Hubble images of Gonggong taken in 2017]\n* [http://www.mikebrownsplanets.com/2011/08/redemption-of-snow-white-part-1.html The redemption of Snow White (Part 1)] (Mike Brown blog 9 August 2011)\n* [https://www.minorplanetcenter.net/iau/lists/NumberedMPs225001.html Discovery Circumstances: Numbered Minor Planets (225001)-(230000)] – Minor Planet Center\n* [https://www.wired.com/2016/05/give-dwarf-planet-2007-or10-real-name-deserves-already Give Dwarf Planet 2007 OR10 the Real Name It Deserves Already] – WIRED article by Emma Grey Ellis\n*\n*"
    }
  ]
}