{
  "content": [
    {
      "type": "text",
      "text": "# Google Expeditions\n\nGoogle Expeditions was a virtual reality (VR) platform developed by Google and designed for educational institutions. Using Android or iOS smartphones, the companion mobile app and head-mounted displays such as Google Cardboard or Daydream View, students (or other users) could take virtual trips to various destinations. Well-known partners included the American Museum of Natural History, National Geographic, WWF and the National Museum of Korea. The platform was discontinued on June 30, 2021, and was merged into Google Arts & Culture.\nFunctionality and offerings\nThe Google Expeditions app offered a variety of virtual excursions. These included trips to natural landscapes; tours of cultural institutions such as museums; and explorations of historical, futuristic, and distant sights (such as dinosaurs or the moon). Students could look and move around freely. The program included Google Street View recordings and \"AirPanos\" (panoramic captures taken from the air).\nEach school class kit contained 30 synchronized Google Cardboards with smartphones and a tablet for the teacher. Over 600 tours were available. Teachers, acting as expedition leaders, could highlight specific details to the class within each scene. Smiley icons informed the expedition leader where individual students were looking. The app also included recommendations for discussion questions and learning exercises. Students could also complete expeditions alone, meaning that teachers could assign these virtual tours as homework. Expedition kits could be purchased in full or assembled from individual purchases.\nHistory\nAfter Google Cardboard was announced in 2014, the product showed immediate promise within the education sector. Google Expeditions was presented for the first time at Google I/O 2015, with a launch date of September 2015. Since May 2016, over a million students have taken part in a virtual tour via the program. In July 2017, Google began a training initiative for the program based in Munich. Expedition trainers visit schools across Germany, bringing with them complete Expeditions kits. The nonprofit organization Stiftung Lesen supports the use of Google Expeditions in schools and libraries. Managing Director Sabine Uehlein views Expeditions not as a threat to reading as a whole, but as a bridge to the written word as a medium. Google also planned to add augmented reality to the program under the title Google Expeditions AR using its Tango platform. This project was scheduled to start in Autumn 2017.\nReception\nCNET described Cardboard as the first virtual reality platform aimed at children. VRODO made comments about the platform, expressing a belief in the future of immersive learning and describing virtual reality as an aid to the memorization process. Der Tagesspiegel remarked that Expeditions can give students a new perspective on subject matter while studying. The technology-focused website Chip Online observed that subjects such as geography, history, and biology are ideal for a program such as Expeditions, and gave the app a favorable rating. However, Chip Online criticized the cost of assembling a full Expeditions kit, noting that not every student owns a smartphone. Sigrid Driver from Stiftung Lesen noted that content on the platform must be exciting in order to arouse the curiosity of students, and to ensure students engage meaningfully with topics at hand.\nReferences\nExternal links\n*"
    }
  ]
}