{
  "content": [
    {
      "type": "text",
      "text": "# Goomeribong, Queensland\n\n| pop                 = 49\n| pop_year            =\n| pop_footnotes       =\n| established         =\n| postcode            = 4601\n| area                = 62.2\n| timezone            = AEST\n| utc                 = +10:00\n| dist1               = 8.3\n| dir1                = NNW\n| location1           = Goomeri\n| dist2               = 25.3\n| dir2                = NE\n| location2           = Murgon\n| dist3               = 83.3\n| dir3                = W\n| location3           = Gympie\n| dist4               = 262\n| dir4                = NNW\n| location4           = Brisbane\n| lga                 = Gympie Region\n| stategov            = Nanango\n| fedgov              = Wide Bay\n| near-n              = Boonara\n| near-ne             = Boonara\n| near-e              = Goomeri\n| near-se             = Goomeri\n| near-s              = Manyung\n| near-sw             = Manyung\n| near-w              = Tablelands\n| near-nw             = Crownthorpe\n}}\nGoomeribong (pronounced goo-MARY-bong) is a rural locality in the Gympie Region, Queensland, Australia. In the , Goomeribong had a population of 49 people.\nGeography\nGoomeribong is north-west of the town of Goomeri. The locality is bounded to the south-east by Goomeri West Road and to south-west by Harm Road.\nThe Burnett Highway forms a very short segment of the locality's eastern boundary but does not generally provide access to the locality.\nNangur National Park is in the north-west of the locality. The national park protects the endangered population of the Nangur spiny skink (Nangura spinosa) and its habitat.\nBoat Mountain Conservation Park extends into the south-west of the locality. The ridge has a distinctive shape, looking like an upturned boat. It is known for its many plant and bird species.\nApart from the protected areass, the land use is predominantly grazing on native vegetation with some crop growing.\nHistory\nLand in Goomeribong was open for selection on 17 April 1877;  were available.\nIn July 1906, 32 allotments were advertised for selection by the Department of Public Lands Office. The map advertising the land selection states the allotments are portions in the Parishes of Murgon, Goomeribong and Barambah. The portions were left over from 5 April 1906.\nGoomeribong  State School opened on 12 February 1920, becoming Goomeribong Provisional School in April 1924. It closed in May 1925 and reopened in 1929. It closed permanently in 1967.\nDemographics\nIn the , Goomeribong had a population of 41 people.\nIn the , Goomeribong had a population of 49 people.\nEducation\nThere are no schools in Goomeribong. The nearest government primary schools are Goomeri State School in neighbouring Goomeri to the south-east and Murgon State School in Murgon to the south-west. The nearest government secondary schools are Goomeri State School (to Year 10) and Murgon State High School (to Year 12) in Murgon.\nReferences\nExternal links"
    }
  ]
}