{
  "content": [
    {
      "type": "text",
      "text": "# Goranba, Queensland\n\n| pop                 = 201\n| pop_year            =\n| pop_footnotes       =\n| established         =\n| postcode            = 4421\n| area                = 346.2\n| timezone            = AEST\n| utc                 = +10:00\n| dist1               = 14.2\n| dir1                = E\n| location1           = Tara\n| dist2               = 36.7\n| dir2                = SE\n| location2           = Kogan\n| dist3               = 75.1\n| dir3                = W\n| location3           = Dalby\n| dist4               = 157\n| dir4                = WNW\n| location4           = Toowoomba\n| dist5               = 337\n| dir5                = W\n| location5           = Brisbane\n| lga                 = Western Downs Region\n| stategov            = Warrego\n| fedgov              = Maranoa\n| near-n              = Kogan\n| near-ne             = Kogan\n| near-e              = Weranga\n| near-se             = Marmadua\n| near-s              = Tara\n| near-sw             = Tara\n| near-w              = Tara\n| near-nw             = Tara\n}}\nGoranba is a rural locality in the Western Downs Region, Queensland, Australia. In the , Goranba had a population of 201 people.\nGeography\nThe Glenmorgan railway line traverses the locality from east (Weranga) to west (Tara) with railway stations (from west to east):\n* Perthton railway station, now abandoned ()\n* Goranba railway station ()\n* Bungybah railway station, now abandoned ().\nThere are two state forests in Tara. The Kumbarilla State Forest is in the south of the locality (extending into adjoining localities) and Vickery State Forest is in the south-east of the locality. Apart from these protected areas, the land use is grazing on native vegetation with some rural residential housing and crop growing.\nHistory\nThe name Goranba is an Aboriginal word referring to a fight over ownership of a tree.\nMyra Provisional School opened in 1911 and was operated as a part-time school (meaning it shared a single teacher) with some of other part-time schools in the district. In 1913, it became a full-time school and was renamed Perthton Provisional School. It was on a  site the north-west of the Perthton railway station (approx ).\nGoranba Provisional School opened February 1925 in a newly constructed hall. In July 1929, it was decided to combine the schools at Perthton and Goranba in single location. In December 1929, the school building at Perthton was relocated to Goranba to establish Goranba State School on a new  site. It was located  north of the Goranba railway station on the north-east corner of Goranba Lane and Crosbies Road ().  It closed circa 1941.\nIn March 1943, the community requested that the Goranba school building be relocated to Warra-Kogan Road near the Myra Meadows property, a site donated by Andrew Watt Adams. The request was approved in October 1943. The relocated school building was opened as Myra State School in 1944 but closed on 2 February 1945. It was a  site on the eastern side of Tara Kogan Road () in present-day locality of Tara.\nDemographics\nIn the , Goranba had a population of 187 people.\nIn the , Goranba had a population of 201 people.\nEducation\nThere are no schools in Goranba. The nearest government schools are Tara Shire State College in neighbouring Tara to the west which provides primary and secondary schooling to Year 12 and Kogan State School in neighbouring Kogan to the north which provides primary and secondary schooling to Year 10.\nReferences"
    }
  ]
}