{
  "content": [
    {
      "type": "text",
      "text": "# Gordon Stewart Cameron\n\n| birth_place   = Aberdeen, Scotland\n| death_date    =\n| death_place   = Dundee, Scotland\n| resting_place =\n| resting_place_coordinates =\n| nationality   = Scottish\n| spouse        = Ellen Malcolm\n| relatives =\n| field         = Painting gardens, interiors, still life and landscapes\n| training      =\n| alma_mater    = Gray's School of Art\n| movement      =\n| works         =\n| patrons       =\n| awards        = Guthrie Award, 1944 (joint winner)\n| elected       = Royal Scottish Academy, 1971\n| website       =\n}}\nGordon Stewart Cameron (27 April 1916 – 1 April 1994) was a Scottish painter, born in Aberdeen, Scotland. He won the Guthrie Award in 1944 with his work, the painting Boy with Apple.\nLife\nGordon Stewart Cameron was born in 1916 at 56 Forest Avenue, Aberdeen. His parents were John Roderick Cameron (5 June 1881 - 1943), a commercial traveller, and Hilda Mary Stewart (1886 - 1954). They married on 19 August 1911. Gordon was one of their 3 sons, the others being Alan (1921 - 4 January 1995) and Douglas.\nHe married the artist Ellen Malcolm (1923 - 2002) in 1962.\nArt\nHe was educated at Robert Gordon's College in Aberdeen. He went to Gray's School of Art. He studied under James Cowie and Robert Sivell with David Macbeth Sutherland as principal. Also at the Art School was Alberto Morocco, who became a great friend and delivered his eulogy at his funeral. At the Art School he won the Davidson Gold Medal, the Brough Scholarship, and the SED Travelling Scholarship. With the Scholarship he went to Holland and France.\nAfter this he was employed at the Art School as a part-time lecturer.\nHe assisted Robert Sivell on a mural project for Aberdeen University. The project lasted from 1939 to 1954 with Sivell largely doing the design and then Cameron doing the painting.\nFrom 1942 he regularly exhibited at the Royal Scottish Academy. In 1944 he won the Guthrie Award with Boy With Apple, his other works that year being Winter Landscape and Portrait Of An Art Student. The Guthrie Award was awarded jointly with Cameron and Margaret Kennedy Mackenzie.\nHe was asked in 1946 to illustrate an anatomy book for Aberdeen University, along with Dan Stephen, in 1946. This was completed with the help of Alberto Morocco.\nThe three painters then formed the '47 Group' in 1947 with other painters. This was an exhibiting group and it lasted until the mid-1950s when Cameron became a full time lecturer at Duncan of Jordanstone College of Art in Dundee.\nIn 1958 he became an Associate Member of the Royal Scottish Academy; and became a full member in 1971.\nHe retired from Duncan of Jordanstone College of Art in 1981.\nHe last exhibited at the RSA in 1990 with Village Gables; Trees At Tighbeg; and Roses Round The Door.\nDeath\nHe died on Friday 1 April 1994. He died in Ninewells Hospital in Dundee.\nThe funeral was on Thursday 7 April 1994.\nAlberto Morocco noted:\nGordon Cameron was an artist of great talent and sensibility and perhaps his sensitivity to the complex subtleties and variations of physical phenomena which he observed and translated so beautifully was the finest part of it. His work covered themes of still life, landscape genre and of course portraiture, of which some of the most finest examples were of his wife, the painter Ellen Malcolm RSA, whom he married in 1962 and now survives him.\nWorks\nHis Post Office is held by Glasgow Museums Resource Centre.\nSeveral of his works, The Bus Stop and the Monkey Puzzle, The Edge of the City, and The Visitors, are owned by Art in Healthcare.\nReferences"
    }
  ]
}