{
  "content": [
    {
      "type": "text",
      "text": "# Goryeo ware\n\nGoryeo ware () refers to all types of Korean pottery and porcelain produced during the Goryeo dynasty, from 918 to 1392, but most often refers to celadon (greenware).\nCeladon techniques were first introduced from China; Goryeo potters established a native style by the 12th century. One of these native styles is characterized by the  technique, a way of inlaying that was unique to Goryeo celadon. The color of the celadon, called  for 'green', was also highly admired. The industry arose and declined as the Goryeo dynasty developed. Many wares were produced at the Gangjin Kiln Sites in southwestern Korea.\nAn artist of the post-war era who specialised in Goryeo ware was Living National Treasure Yu Geun-Hyeong. His work was documented in the short film Koryo Celadon in 1979. Many celadon pieces from Goryeo are listed as National Treasures of South Korea.\nGoryeo celadon\nHistory\nEarly celadon\nPottery and celadon was introduced into the Korean peninsula in the Three Kingdom age. Demand for higher quality porcelain increased as the Goryeo dynasty emerged. Along with the development of tea culture and Buddhism, wares based on traditional and southern China (Song dynasty) porcelain began production in Goryeo.\nMost of the pottery made in this era are the kinds that are called haemurigup celadon and green celadon (low-grade).\n11th century\nAs the celadon techniques of the Song dynasty reached its pinnacle, much effort was made inside Goryeo to reproduce the turquoise coloring of Chinese porcelain. Kilns were made throughout the kingdom, leading to a variety of celadon being made. High grade celadon was made in order of the capital, and low grade celadon was made by the requests of temples, offices and local families of provinces.\nThough Chinese influences still existed, Goryeo-styled shapes and decorations emerged in some porcelains. These are characterized by the utilization of light curves and a serene, elegant feel. Decoration techniques such as relief carving, intaglio carving, iron oxide glaze, openwork became in use. The sanggam inlaying also started at this age.\n12th century\nThe 12th century is considered as a zenith of Goryeo celadon, especially in its special color and harmony. The pure celadon made in this age had thin glaze coating that exquisitely reflected the jade color, called . They also had a great level of structural balance and elegance. There are records describing celadon of this age as world best.\nJinsa \"underglaze red\", a technique using copper oxide pigment to create copper-red designs, was developed in Korea during the 12th century, and later inspired the \"underglaze red\" ceramics of the Yuan dynasty.\nPost-12th century\nMaturation of the aristocrat society due to events such as the coup of military officers led to an increasing favor for extravagantly decorated porcelain. Inlaying techniques reached their height and opened a second zenith of Goryeo celadon. Other types of porcelain developed as whitening, iron oxide glaze, and copper oxide glaze came in use. With the decrease of Chinese influence, Goryeo celadon acquiref a more native shape in unique patterns and decorative shapes. Thin, transparent glaze used to show the inlaid designs led to development of a crackling cooling pattern, called bingyeol (craquelure).\n13th century\nAfter the Mongolian invasion in 1220, social and economic confusion had caused the general quality of Goryeo celadon to decline. The influence of the Yuan dynasty is seen throughout the porcelain produced in this time. Though the celadon industry remained, the overall density of expressions and smoothness decreased and the color and harmony were also diminished. This decrease in its beauty continues as the Goryeo dynasty recedes.\n14th century\nIn the late 14th century, the Kilns of Gangjin and Buanyo were attacked by Japanese pirates and closed. Inland kilns replaced them, putting an end to the age of celadon. Though new characteristic shapes and designs appeared, they were utilitarian instead of elegant and restrained, as Goryeo celadon in its zenith was. One of these new types of porcelain was called buncheong.\n20th century\nIn the late 19th century, the Japanese, who occupied Korea at the time, began to be unearth Goryeo era celadon wares from the Royal Tombs of the Goryeo Dynasty near Kaesong in today's North Korea. These became the most sought-after item in the Korean art market. The Japanese resident-general of Korea, Ito Hirobumi, who previously served as Japan's first prime minister, collected over 1000 works which were sold by antique dealers in Seoul. Japanese industrialist Tomita Gisaku is credited with rediscovering how to make Goryeo-style wares at his factory named Sanwa Goryeo Celadon. It was established in 1908 in the town of Nampo in South P'yong'an Province, todays North Korea. In 1912, Umii Benzo established a competing factory named Kanyo K̄oraiyaki located in todays Jangchung-dong district of Seoul. Umii's firm opened a branch to sell celadons in Tokyo and both firms began supplying wares to Japanese tourists visiting Korea. Korean ceramist Yu Geun-Hyeong (1894–1993), who worked in Umii's factory early in his career, is credited with experimenting with techniques, kiln design, clays, and glazes to more accurately reproduce Goryeo era wares. Owing to his work, Yu was designated a Living National Treasure of South Korea. North Korean potter U chi-son is also credited as leading the way to recreated Goryeo celadon pottery.\nEven after World War II, when Japanese control of Korea ended, most 20th-century Goryeo wares were still shipped to Japan for sale in department stores like Mitsukoshi. In the late 1970s, Korean ceramist Shin Sang-ho (b. 1947) is credited with modernizing production of celadons when he brought back a gas-fired kiln from Japan.\nCharacteristics\nInlay technique\nFor the inlay technique, several patterns are engraved on the surface of metal, clay, wood, etc. This traditional decoration technique started to be applied in porcelain in the Goryeo dynasty. Purple (black) and white clay were used to show the patterns.\nA pattern is engraved on the vessel's body with a knife and the carved-away areas are filled with purple or white clay. When the clay dries the excess is removed, leaving it only in the carved areas, leaving a white or purple pattern. The entire vessel is coated in a colorless glaze. Once it is fired, the white clay still appears white but the purple turns black, and the pattern is visible through the glaze.\nDifferences from Chinese celadon\nThe glaze used in Goryeo celadon had a definite composition starting from the 11th century to the 15th century. It contained a lot of calcium in composition, with 0.5% of manganese oxide, which was more concentrated than glaze used in Chinese celadon. Also in the case of Chinese ceramics, there is enough time for nucleation-crystal growth, so it takes on a jade color. But the kilns in Goryeo were smaller than that in China, so the firing and cooling process took place quickly. Therefore, minerals in the glaze such as anorthite or wollastonite did not have sufficient time for nucleation-crystal growth. This results in the color of celadon being closer to the gray side. In Goryeo celadon, quartz, black particles, bubbles, cracks can also be observed.\nTypes and decorations\n* Pure celadon is celadon which has no decorations such as inlaid lights on it. It is known as the first type of celadon ever made in the Korean Peninsula. Having no decorations, the shape of the bowl and the color of the glaze of this type of celadon are particularly excellent. It is considered to be the earliest celadon.\n* Celadon in relief refers to celadon made using embossing techniques. There are two kinds of embossed celadon. The first is celadon which must be embossed to show its shape, and the other is celadon with embossing used for decorative purposes.\n* Incised celadon is made using an engraving technique, which shows patterns that enter the surface of the bowl. The engraved pattern in celadon is very thin, so if the glaze is not properly melted, the indented lines would not appear, making incised celadon require very high skill. It is seen in the excellent works of the early celadon.\n* Openwork celadon that frequently depicts a woven basket, rows of chrysanthemum flowers, umi blossoms, dragons, or a lattice.\n* Inlaid celadon  was made until the end of the Goryeo dynasty. Many black and white patterns were embroidered. By using the method of digging the pattern with a sharp knife and then filling it with other colored clay, it is possible to express the pattern finely and to make the surface smoother. Cracks may appear because two different clays shrink together.\n* Willow and waterfowl design is used in many kinds of ceramics including celadon, and it reflects the feelings of the ancients very well. The characteristic of this design is that it contains a beautiful rural landscape, arranging black and white harmoniously.\n* Cloud and crane design was mainly used in prunus vases. This pattern of the sky expresses clouds and cranes that fly away from humans. It is not clear why people of Goryeo liked to use these designs.\n* Flower design is usually a pattern of camomile, and it can be added by a pair of chrysanthemums.\n* Underglazed celadon: The patterns of underglazed celadon are drawn with white and black paint on the surface of the bowl. The celadon is then painted with glaze and fired in a kiln.\n* Paste-on-paste celadon uses clay on brushes to draw dots or pictures before applying glaze. It is similar to inlaid celadon, but the patterns are not smooth.\n* Copperized celadon is red due to oxidation of copper. It is very rare and not numerous, because copper oxide is very unstable depending on the baking conditions such as temperature control and fuel supply, so it is very difficult to produce red color.\n* Celadon in underglaze Iron is created by applying wire paints to the entire surface of pottery made by celadon clay. The finished work is shiny with black and green colors.\n* Gold-decorated celadon is made by the technique of painting a part of finished inlaid celadon with gold. Melted gold is painted in the pattern of the inlaid celadon which has been glazed and baked to the second fire. It is then baked again in low fire to let the gold settle.\n* Marbled celadon is made by kneading grey celadon foundation clay with clays of other composition. The gray, black, and white colors result in a marble pattern. No engraved patterns are found in marbled celadon.\n* Impasto celadon is a technique pioneered by ceramist Master Kim Se-yong and involves applying a thick layer of white clay and then scraping it away the white clay to form trees, mountains, buildings etc. It is similar to bakji buncheong.\nGallery\nFile:청자 어룡 모양 주전자.jpg|Pitcher with the head of a dragon and the body of a fish, 12th century (National Treasure No. 61)\nFile:Goryeo Celadon.jpg|Maebyeong vase with sanggam engraved cranes (National Treasure No. 68)\nFile:청자 거북이 모양 주자.jpg|Pitcher in the shape of a Dragon Turtle (National Treasure No. 96)\nFile:청자 상감 모란 넝쿨 무늬 조롱박 모양 주전자.jpg|Pitcher (National Treasure No. 116)\nFile:Korea-Goryeo Dynasty-Wine ewer in the shape of a seated immortal-01.jpg|Wine ewer in the shape of a seated immortal (National Treasure No. 167)\nFile:Celadon Incense Burner with Ogre Mask Design in Relief.jpg|Incense burner of Goryeo\nFile:Celadon Chair with Openwork Decoration.jpg|Goryeo's celadon chair\nFile:Vase with Cranes and Clouds YUAG 2008.129.1.jpg|Maebyeong with Cranes and Clouds, 12th century, Yale University Art Gallery\nSee also\n*Goryeo Celadon Museum\n*Korean pottery and porcelain\n*Buncheong\n*Joseon white porcelain\nFurther reading\n*\nReferences\nExternal links\n* [http://www.metmuseum.org/TOAH/HD/cela/hd_cela.htm Koryô Celadon] at the Metropolitan Museum of Art online\n* [https://www.youtube.com/watch?v=Fq8eBghuOLA Koryo Celadon (Korean Ceramics) on YouTube]"
    }
  ]
}