{
  "content": [
    {
      "type": "text",
      "text": "# Got My Mojo Working\n\n| recorded   = 1956\n| studio     =\n| genre      = Blues\n| length     = 2:37\n| label      = Baton\n| writer     = Preston Foster\n| producer   =\n}}\n\"Got My Mojo Working\" is a blues song written by Preston \"Red\" Foster and first recorded by R&B singer Ann Cole in 1956. Foster's lyrics describe several amulets or talismans, called mojo, which are associated with hoodoo, an early African-American folk-magic belief system.\nIn 1957, Muddy Waters released the song with some different lyrics and a new musical arrangement. It was a feature of his performances throughout his career, with a live version recorded in 1960 identified as the best known. Waters' rendition has received several awards and has been otherwise recognized by various organizations and publications. As a blues standard, it has been recorded by numerous blues and other artists.\nOrigins\nThe song was written by Preston \"Red\" Foster, an African-American musician unrelated to the actor of the same name.  Music publisher and executive Sol Rabinowitz described Foster as \"one of the shyest human beings I've ever met\", and a judge in the early 1970s described him as \"a Black man, about forty years of age... with bleached blonde hair and highly modish clothing [who] sat quietly in the courtroom.\"\nAccording to Rabinowitz, Foster approached him in the mid-1950s with several songs. Rabinowitz recalled:\n... She was booked for a tour throughout the South as the opening act for Muddy Waters. She performed with his band backing her up. I happened to see the show at a club... and heard her singing Mo Jo in the show. I had asked her not to perform any unreleased songs on stage, to avoid just this problem... Ann Cole ignored me and was singing Mo Jo all over the South with Muddy's band. He went back to Chicago after the tour and told Leonard Chess of Chess Records he had written a new song that he wanted to record. It was recorded and released the same week as the Ann Cole version...  I called [Leonard Chess] to tell him he had recorded a song published by my company and that he owed us royalties for the sales of Muddy's recording. He signed a mechanical license agreeing to pay us royalties, and I thought the problem was solved. Over the years, we have had legal action concerning the song, but today, that is over, and the song is now acknowledged to be Preston Foster's.}}\nIn his biography of Muddy Waters, Robert Gordon gave a similar account: Waters and his band learned the song while backing Cole on a Southern tour and promptly recorded it after returning to Chicago.  Rabinowitz claims he regularly sent Foster checks for songwriting royalties amounting to $20,000–30,000 a year in the 2000s.  Foster later set up GetIt Records in Jamaica, New York, and released singles under his name and as \"The Mojo Kid\".\nMusic historian Larry Birnbaum states that the 1955 R&B hit \"Hands Off\", written by Jay McShann, which he recorded with singer Priscilla Bowman, was the \"obvious basis\" for \"Got My Mojo Working.\" The two songs were combined by Elvis Presley while jamming in the recording studio in 1970 and were released on the 1971 album Love Letters from Elvis.\nMuddy Waters rendition\n| recorded   = December 1, 1956\n| studio     =\n| genre      = Blues\n| length     =\n| label      = Chess\n| writer     = Preston Foster\n| producer   = Leonard Chess, Phil Chess\n| prev_title = Just to Be with You\n| prev_year  = 1956\n| next_title = Good News\n| next_year  = 1957\n}}\nWhile Cole's version of \"Got My Mojo Working\" reflects more of a doo-wop style, Muddy Waters emphasizes a driving rhythm. AllMusic critic Matthew Greenwald also notes the song's rhythm: \"A sturdy jump blues rhythm and tempo drive the song, while a basic 1/4/5 chord progression defines the melody. The meeting of these two styles is the basis for the rock & roll genre and makes the song one of the most influential.\"\nWaters used many of Foster's lyrics, but added a reference to acquiring a mojo from his 1950 song \"Louisiana Blues,\" \"I'm goin' down in New Orleans, get me a mojo hand, I'm 'on show all you good lookin' women, yes how to treat your love.\"  His popular 1954 song, \"Hoochie Coochie Man\", written by Willie Dixon, also mentions a mojo. According to Waters:\n... even today [circa 1980], when you play the old blues like me, you can't get from around that.}}\nWaters recorded the song on December 1, 1956, for Chess Records in Chicago.  Both Little Walter and James Cotton have been mentioned as supplying the harmonica parts.\n\"Got My Mojo Working\" was a feature of Muddy Waters' live performances over the years, with a popular version appearing on his At Newport 1960 album. Writing for the Blues Foundation, when the song was recognized as a \"Classic of blues recording\" in 1984, blues historian Jim O'Neal noted that \"The two-part rendition that secured the song’s renown was on the groundbreaking LP Muddy recorded live at the Newport Jazz Festival in 1960.\" He also called the song \"a standard in countless blues band repertoires.\"  Waters' rendition is included on Rolling Stone's 500 Greatest Songs of All Time at number 202. In 1999, it received a Grammy Hall of Fame Award, and is identified as one of the \"Songs of the Century\" by the RIAA.\nCopyright issues\nThe song has been the subject of copyright litigation. Muddy Waters heard Ann Cole perform it while she was on tour with him in 1956. He modified the words and attempted to copyright his version. Dare Music, Inc., holder of the Preston Foster copyright, and Arc Music Group, holder of the Morganfield copyright, settled out of court, with Arc deferring to Dare's copyright.\nIn Strachborneo v. Arc Music 357 F. Supp 1393 (S.D. N.Y. 1973), Ruth Stratchborneo sued co-defendants Arc Music, Dare Music, McKinley Morganfield (Muddy Waters) and Preston Foster, claiming that all had infringed on her copyright in the song \"Mojo Workout\". In disagreement with Plaintiff Stratchborneo's claim, the ruling held that the term \"Mojo\" was essentially in the public domain and that the various uses of it in recordings by Ann Cole, Muddy Waters, Jimmy Smith and Bill Cosby did not, therefore, constitute infringement:\nImportantly, the ruling also unequivocally established the copyright of Preston Foster and Dare Music, Inc. in the song \"Got My Mojo Working.\"\nReferences"
    }
  ]
}