{
  "content": [
    {
      "type": "text",
      "text": "# Gothra, Rewari\n\n| coor_pinpoint           =\n| coordinates_footnotes   =\n| subdivision_type        = Country\n| subdivision_name        = India\n| subdivision_type1       = State\n| subdivision_type2       = District\n| subdivision_type3       = Look Sabha constituency- Gurgaon\n| subdivision_name1       = Haryana\n| subdivision_name2       = Rewari district\n| subdivision_name3       = Bawal/Khol\n| established_title       =\n| established_date        = 01-November-1989\n| founder                 =\n| seat_type               =\n| seat                    =\n| government_footnotes    =\n| leader_party            = BJP\n| leader_title            =\n| leader_name             = Sanjay Jaidyal Bhatia\n| unit_pref               = Metric\n| area_footnotes          =\n| area_total_km2          =\n| area_land_km2           =\n| area_water_km2          =\n| area_water_percent      =\n| area_note               =\n| elevation_footnotes     =\n| elevation_m             =\n| population_total        = 2606\n| population_as_of        = 2011\n| population_footnotes    =\n| population_density_km2  = auto\n| timezone1               =\n| utc_offset1             =\n| timezone1_DST           =\n| utc_offset1_DST         =\n| postal_code_type        =\n| postal_code             = 123102\n| area_code               =\n| area_code_type          =\n| iso_code                = IN-HR\n| website                 =\n| footnotes               =\n}}\nGothra is a village on the Rewari-Narnaul road (National Highway no. 11),  from Rewari in the Rewari, Haryana, India. It is also known as Gothra Pali. It is also part of the Delhi Mumbai Freight Corridor Project that is planned to be India's future trade corridor.\nDemographics\nAs of the 2011 India census, Gothra has a population of 2,606 in 549 households. Males constitute 50.8%  of the population and females constitute 49.2%. Gothra has an average literacy rate of 68.6% (58.8% and 41.2% for males and females, respectively), less than the national average of 74%. In Gothra, 12.5% of the population is under 6 years of age. The main ethnic group of the village is Ahir; other ethnic groups include Harijan, Khati, Parjapat, Valmiki, Saini, and Naai. The village has a Shiv temple at its entrance, a Jihad, and temples such as Hanuman Temple and Baba Manohar Dass.\nCommerce\nAdjacent to the village is a Kribhco container. At the bus stand of this village are many shops, dhabas, a petrol pump, and a Power House (Bijli Ghar) Subdivision.\nThe village has many temples, such as the Sakti Mata temple. Many villagers (both in Gothra and neighbouring villages) visit the Sakti Mata temple on Saturdays.\nPeople from this village work in various fields, including judicial, taxation, police, defense, paramilitary, finance, and teaching. , Captain Ram Kunwar, who participated in the Sino-Indian War, was born in Gothra and was awarded the Vir Chakra medal.\nEducational establishments\nHaryana's second Sainik School is situated in Gothra. It was inaugurated in 2008 by the former CM Bhupender Singh Hooda. This school covers an area of 56 acres.\nTransportation\nRewari is about 95 kilometers from Delhi and is well connected by roadways and railways. More than 40 trains connect Rewari Junction station to New Delhi and amongst them Garib Rath (12215) is the fastest one that covers this distance in 1.5 hours. Regular bus service is also available with pick up points spread across different places in Delhi and Gurgaon. The nearest villages to Gothra are Nandha, Balwari, Nangla, Mamria, and Pali.\nReferences"
    }
  ]
}