{
  "content": [
    {
      "type": "text",
      "text": "# Gowrie Mountain, Queensland\n\n| pop                 = 222\n| pop_year            =\n| pop_footnotes       =\n| established         =\n| postcode            = 4350\n| area                = 2.0\n| timezone            = AEST\n| utc                 = +10:00\n| dist1               = 9.5\n| dir1                = S\n| location1           = Kingsthorpe\n| dist2               = 12.7\n| dir2                = W\n| location2           = Wilsonton Heights\n| dist3               = 15.7\n| dir3                = WNW\n| location3           = Toowoomba CBD\n| dist4               = 143\n| dir4                = W\n| location4           = Brisbane\n| lga                 = Toowoomba Region\n| stategov            = Condamine\n| fedgov              = Groom\n| near-n              = Kingsthorpe\n| near-ne             = Kingsthorpe\n| near-e              = Charlton\n| near-se             = Wellcamp\n| near-s              = Wellcamp\n| near-sw             = Wellcamp\n| near-w              = Kingsthorpe\n| near-nw             = Kingsthorpe\n}}\nGowrie Mountain is a locality in the Toowoomba Region, Queensland, Australia. In the , Gowrie Mountain had a population of 222 people.\nGeography\nThe Warrego Highway forms the northern boundary of the locality while Dry Creek forms the southern boundary. The lower of the two peaks of Gowrie Mountain (630 metres above sea level) is in the far east of the locality while the higher peak (674 metres above sea level) is in the neighbouring locality of Charlton.\nHistory\nThe locality takes its name from the mountain which, in turn, took its name from a corrupted Aboriginal word cowarie, which probably referred to Gowrie Creek, but which also referred to the freshwater mussel.\nGowrie Mountain Provisional School opened on 30 May 1901, becoming Gowrie Mountain State School on 1 January 1909. It closed in 1967. It was on a  site at 95 Gowrie Mountain School Road (), now within the present-day locality of Kingsthorpe.\nDemographics\nIn the , Gowrie Mountain had a population of 224 people.\nIn the , Gowrie Mountain had a population of 222 people.\nEducation\nThere are no schools in Gowrie Mountain. The nearest government primary school is Kingsthorpe State School in neighbouring Kingsthorpe to the north. The nearest government secondary school is Wilsonton State High School in Wilsonton Heights to the east.\nReferences\nExternal links"
    }
  ]
}