{
  "content": [
    {
      "type": "text",
      "text": "# Goytepe archaeological complex\n\nGoytepe (); Göy-Tepe, is a Neolithic archaeological complex located in the Tovuz District of Azerbaijan. Goytepe is affiliated with the Shulaveri-Shomu culture and it is the largest settlement of the early period of Neolithic era in the South Caucasus.\nGeographical location\nGoytepe is located in Ganja-Gazakh region of Azerbaijan, 5&nbsp;km east of Tovuz city, 2&nbsp;km to the northeast from the village of Aşağı Quşçu, and well south of the current course of Kura river, but close to where Tovuz river flows into Kura. This is the middle course of Kura, at the western terrace of the Zayam valley. The dune of Goytepe covers more than 2 ha, an altitude of 420 m and a diameter of nearly 145 m.\nThe settlement of Haci Elamxanli Tepe, from the same period, is located about 1km north from Goytepe, and Kicik Tepe about 2km southeast. Mentesh Tepe is about 10km east of Goytepe.\nShomu-tepe settlement, the type-site of Shulaveri-Shomu culture, is located about 25km to the northwest of Goytepe, in the suburb of Agstafa city.\nHistory\nGoytepe approximately dates back to the 6th millennium cal. BC. is one of the largest settlement sites of the Shomutepe culture. Goytepe started to be investigated thoroughly in 2006, after 4 decades of its initial documentation by archaeologist Ideal Narimanov. An Azerbaijani-French joint mission conducted this investigation in 2006. A topographic map of the mound was made and a few samples of charcoal were taken for determining the age of the site.\nIn 2008, the experts from the Institute of Archaeology and Ethnography of Azerbaijan headed by Farhad Guliyev, and the Japanese archaeologists from the University of Tokyo led by Yoshihiro Nishiaki explored this site more extensively in 2009.\nThe presentation of the archaeological complex was held at Tokyo University in 2009, at the College-de-France educational institution in Paris and at the British Museum in London in 2010, as well as, at the Archaeology Institute of the Russian Academy of Sciences and at the National History Museum of Georgia in 2011.\nPresident of Azerbaijan Ilham Aliyev signed an order dated April 18, 2012 on creation of “Goytepe Archaeology Park” for the purpose of thorough study of this monument.\nOn April 18, 2012, according to the order of the President of Azerbaijan Ilham Aliyev, Goytepe Archaeological Park was established. 300,000 AZN from the Reserve Fund of the President of Azerbaijan was allocated to the National Academy of Sciences of Azerbaijan for the establishment of the Archaeological Park.\nStratigraphy and dating\nThe area of 300 sq.m. with a depth of 3–4 meters in Goytepe was studied after it was cleared from soil. The excavation area was divided into squares (numbered with numerical numbers – 1, 2, 3 ...) using a 10x10 grid system from the datum point to the north and to the east (labelled by letters – A, B, C ...). In order to ease stratigraphic reading, each square was then divided into 2 parts – west (I) and east (II). 4 squares on top of the mound (1A, 2A, 1B and 2B) were investigated by the Azerbaijani experts, whilst a sub-square (4BII) at the northern part of the hill was excavated by Japanese mission. Moreover, stratigraphy of all the squares primarily conducted by the Japanese experts. The investigation of 1A, 2A, 1B and 2B squares in addition to 4BII sub-square approached a depth of presumably 3 m.\nSince 2008, eight radiocarbon C14 analyses (in French and Japanese labs) of coal residues taken from different squares of the excavation area have been carried out. Four of these analyses belonged to the top layers of the site. 2 group of ages were provided, each belonged to different squares, 5450-5350 cal. BC to squares 1A/B, 2A/B, and 5600-5500 cal. BC to 4BII. The other four analyses cover mainly the cultural layer at the 150–175&nbsp;cm depth.\nGoytepe was a one-period site belonging to the Shulaveri–Shomu culture.\nArchitecture\n11 m-thick Neolithic cultural sequence recovered in Goytepe consists of 14 architectural levels characterized by mudbrick houses in circular shape linked by curvilinear walls. Building techniques and distribution sequence of architectural remainders found from different levels were mainly similar to each other. Plano-convex-shaped mud bricks with straw temper measuring 40-60 x 20 x 8–10&nbsp;cm made from yellow or brown clay were used as a building material. These constructions including the ones made of 15 rows of mud bricks with a height of 1.5 m. were considered well-preserved.\n2 types of circular constructions have been discovered as it was in Shomutepe: large and small. The diameter of large circular constructions reached 3.5 m, while the smaller ones had a diameter up to 2 m. The smaller circular constructions used to generally connect with wing walls, although the larger ones were preferred to be mainly independent or not entirely enclosed. There were also revealed other structures such as ovens and bins. After examinations of these structures, it was affirmed that these units were built one by one in a sequential manner with a specific distribution pattern. The settlement featured circular or oval unit with a diameter of 7–8 m, including a number of round-shaped constructions connected with wing walls to surround a courtyard. There was a break on the enclosure wall for each unit which are assumed to be used as the entrance to the yard.\nExperts revealed clay bins and ovens/hearths mainly in the courtyard of the settlement close to the wing walls or circular constructions in the archaeological site. The bins with a diameter of 50–60&nbsp;cm had a round or oval form with a height of 50&nbsp;cm. The bottom of the bins was dug nearly 10–15&nbsp;cm into the ground. During the excavations some of them discovered empty, while others were found with different tools and materials showing that they also had a storage function. The ovens with a diameter around 60–70&nbsp;cm had also a round or oval shape, nevertheless, their bottoms were covered with river cobbles and enclosed by a clay rim.\nIn Square 2B, there was also discovered a building in a rectangular form of 4x2.5 m. with a separating wall located quite far away from the circular buildings and assumed that it had been used for a different purpose.\nMaterial remains\nCeramic, basalt and obsidian, bone-based labour instruments (awls, needles, axes and hammers), pottery specimens, plant and animal remnants were found from the Neolithic cultural sequence.\nTools and other objects were infrequently found in the interior parts of smaller circular constructions. In contrast, larger circular constructions and courtyard featured significant number of objects. Several practical tools, including large obsidian blades and large bone instruments were discovered here. 1525 pieces of ceramics were found during the research.\nPottery\n, Ganja, Azerbaijan]]\nPottery samples were found at all layers. Vertical and incurved jars were mostly used, followed by bowls, small vessels without handles and deep bowls. Decorated pottery was hardly found; a few samples of them have simple relief decoration with some circles and oval knobs and wavy lines, while others which were revealed from the upper levels have a monochrome decoration around the neck.  Mineral and plant tempered pottery were also found here; whereas, minerals, such as basalt and obsidian were generally used in plan-tempered pottery. Mineral-tempered pottery were found in less quantity from the upper layers.\nThe use of mineral-temper in pottery is similar to the Shulaveri–Shomu culture.\nStone artefacts\nMore than 5000 lithic artefacts found in this site have been investigated. Almost 70% of them were made of obsidian. Obsidian was mainly used for blade and blade-tools production.\nObsidian artefacts were revealed as a stratified obsidian artefact assemblage (10 levels, 901 pieces) (8) and it is considered that obsidian was extracted from the Lesser Caucasus sources.\nRetouched blades and flakes were widely spread among the retouched tool collection. Other predominant tools were burins and splintered pieces which comprised nearly 30% of the whole retouched tools collection. (3) There have also been found denticules, sickle elements, notches and transverse arrowheads.\nNon-obsidian raw materials constituted locally available flint, tuff, andesite and mudstone. Flint tools were mainly made on ad-hoc flakes. They featured several glossed blades, which presented the glossed part distributed diagonally to the edge.\nThere were also found ground stone tools that are considered to be common in this site. Ground slabs, mortars, pounding stones and hand stones were among them. These tools were used for food preparation, as well as, for pigment preparation.\nOther tools\nAccording to the excavations, it is also assumed that habitats of this site made bone and antler tools, as there were discovered a few samples. Short pointed awl, spatulas and knives are considered to be most common tools among this type. Axes, hammers, picks, and hoes were among the less common ones. Polished axe made of green stone, antler hammer with a smooth surface, wavy grooves and notches were discovered from this site.\nPolished axes, smooth surface hammers have similarities with the samples of Shulaveri-Shomu culture.\nPlant and animal remains\nDomesticated plants, mainly wheat and barley were identified in the excavations. Wheat and barley samples found in Goytepe were beaten, charred and blended. Naked barley and free-threshing wheat are specific to Goytepe because these crops have been found rarely in the Neolithic sites of the Middle East such as in Syria and Turkey.\nRemains of domesticated goats, sheep and cattle were also found here.\nHaci Elamxanli Tepe\nHaci Elamxanli Tepe is located about 1km north from Goytepe. In 2015, Yoshihiro Nishiaki, Farhad Guliyev and Seiji Kadowaki published their finds of Haci Elamxanli Tepe (5950-5800 BC), which is over a century earlier than Goytepe. They found a noticeable difference in the composition of the finds at the two settlements: while in the older Haci Elamxanli Tepe there were consistently less than 5% ceramic finds and more than 95% stone artifacts, in Göytəpə the ratio of the oldest to the youngest layer changed from around 10% to 90% to around 75% to 25%. According to the archaeologists, this provides evidence that, during a century and a half (5800-5650 BC), the beginning of ceramic production at Göytəpə can be surmised.\nNishiaki et al tried to clarify the chronological context of the earliest Pottery Neolithic period in the South Caucasus. According to these authors, Göytepe and Hacı Elamxanlı Tepe were the oldest farming villages in West Azerbaijan. A few other such very early Neolithic sites emerged almost simultaneously around 6000 BC in the foothills of the Lesser Caucasus mountains. While the authors accept that plant cultivation and animal husbandry were of foreign\norigin in the area, not all Neolithic cultural items were brought in as a package. Instead, the authors suggest that there were also considerable autochthonous developments involving an aceramic stage. Further supporting evidence emerged in subsequent excavations at Damjili Cave which is also located in the area upstream along the Kura (river).\nMetalwork\nThe Neolithic settlement Aruchlo I is the westernmost site of the Shulaveri-Shomutepe group. It is located near the village of Nakhiduri, in Kvemo Kartli, Georgia, which is 50 km southwest of Tbilisi.\nEarly copper metallurgy has been documented there, as well as in Göy-Tepe and Mentesh Tepe in the Tovuz district.\nAt Goytepe, vitreous slag with copper prills has been discovered, dating to the middle of the 6th millennium BC.\nCopper items are rare in Shulaveri-Shomu culture. Yet they become more common towards its end, at the end of the 6th millennium BCE, especially in the middle Kura valley. \"Compositional analyses of some of these ornaments and small tools revealed that they are made of unalloyed copper\".\nSee also\n* Osmantepe\n* Damjili Cave\n*History of Azerbaijan\n*Shulaveri-Shomu culture\nReferences\nLiterature\n*\n* Lyonnet, Guliyev 2012: B. Lyonnet, F. Guliyev, [https://www.academia.edu/10572378/ Recent research on the Chalcolithic Period in western Azerbaijan”.] in J.E. Curtis, R.J. Matthews, R. Chapman, A. Fletcher, A.L. Gascoigne, C. Glatz, S.J. Simpson, M.J. Seymour, H. Taylor, J.N. Tubb (dir.), Proceedings of the 7th International Congress of the Archaeology of the Ancient Near East, vol. 3, Fieldwork and recent research – posters, Wiesbaden, Harrasowitz, 2012, pp. 85‑98. - academia.edu"
    }
  ]
}