{
  "content": [
    {
      "type": "text",
      "text": "# Grace Poe 2016 presidential campaign\n\n* Partido Galing at Puso\n** Ako Bicol\n** An Waray (2015–2016)\n** Makabayan (2015–2016)\n** NPC (2016)\n| status           = Announced: September 16, 2015Official launch: September 16, 2015  Lost election: }}\n| headquarters = George Erwin Garcia Law Office, G/F Laiko Building, Cabildo Street, Intramuros, Manila\n| key_people =\n* Rex Gatchalian (campaign manager and spokesman)\n* Danding Cojuangco\n* Heart Evangelista\n* Loren Legarda\n* Satur Ocampo\n* Susan Roces\n* Tito Sotto\n* Antonio Trillanes\n* Luis Villafuerte\n* Lito Atienza\navoids running together with  from the template, which gets interpreted as ' ' -->\n| slogan = Gobyernong May Puso (lit. Government with a Heart)\n}}\nThe 2016 presidential campaign of Grace Poe was announced at the Bahay ng Alumni at her alma mater, the University of the Philippines Diliman, Quezon City, on September 16, 2015. Grace Poe is a Senator of the Philippines since June 30, 2013, the former MTRCB Chairperson and adopted daughter of popular Filipino actor and 2004 presidential candidate Fernando Poe Jr.\nOn December 23, 2015, the COMELEC en banc formally disqualified Poe from running as president in the 2016 elections for failing to meet the 10-year residency requirement.\nOn December 28, 2015, the Supreme Court issued two temporary restraining orders against the decision of the COMELEC en banc.\nOn March 8, 2016, voting 9–6, the Supreme Court voted to affirm Poe' natural-born status and 10-year residency. On April 9, 2016, the Supreme Court declared their ruling as final and executory.\nBackground\nPoe studied high school at Assumption College, Makati, where she participated in oratorical competitions and was the captain of the Assumption Debating Team in her senior year.\nIn 1986, she entered the University of the Philippines Manila where she studied Development Studies. On her first year, she became the chairman of the College Freshmen Assembly and then became the sophomore batch representative to the student council on her second year.\nBut after two years, she decided to study abroad at Boston College, Massachusetts. During her stay, she co-founded the Filipino Cultural Club and later on earned her Bachelor of Arts degree major in political science in 1991.\nDuring Poe's trip in California with her mother, veteran actress Susan Roces, she was appointed by President Benigno Aquino III to serve at the Movie and Television Review and Classification Board (MTRCB) as a chairwoman last October 10, 2010. Later on, due to her excellent work, President Aquino extended her term as a chairwoman of MTRCB, in which she continued serving until October 2, 2012, before she ran as a senator candidate.\nAt MTRCB, she worked to improve the television and film industries, and recommended the development of a \"progressive\" agency. During her term, she instituted a new type of rating system for television channels for the parents to know and help discipline their children by telling their children the appropriate channels based on the ratings. In addition to this, she also implemented a new type of rating system for movies for the citizens of the country to know which movies are appropriate for them. Moreover, there were new instituted policies to promote \"intelligent writing\", which included the promoting of the rules and regulations of Children's Television Act of 1997.\nDuring 2010, there were already rumors of Poe running for an elective position, which was confirmed on October 1, 2012, when it was announced by President Aquino that Poe was chosen to be a member of the Team PNoy administration. Poe gave her official certificate of candidacy the following day, October 2, 2012.  Poe was also a guest candidate of the Makabayang Koalisyon ng Mamamayan and, until February 21, 2013, was one of three guest candidates, the other two being Senators Loren Legarda and Francis Escudero, of the United Nationalist Alliance (UNA), the group of Vice-president Jejomar Binay.  After the elections in 2013, Poe managed to get first place in the 2013 senate election.}}\nGrace Poe's surprising first-place finish in the 2013 Senate election made her a likely contender for the presidency but she dismissed any plans of running in April 2014, saying she was not considering \"anything higher at this point.\"\nPoe was widely speculated to be a potential presidential or vice presidential candidate in the 2016 general elections.\nOn President Aquino's state visit to Canada in May 2015, the president disclosed that he had met with Poe prior to the trip, although he didn't say on what the meeting was for. A couple of days later, Poe confirmed that she did meet with Aquino. Poe said that \"We discussed his intention to choose a candidate who, first and foremost, has the trust of the nation, and, secondly, has the potential to win in the election, in order to sustain the reforms especially against corruption and the pro-poor programs of the government.\" Poe expects more meetings with Aquino in June.\nOn June 2, UNA interim president Toby Tiangco, responding to calls for Jejomar Binay to \"come clean\" on his corruption allegations, said in a press conference that Poe is not qualified to run either for president or vice president after citing her certificate of candidacy in the 2013 Senate election which stated that she is a resident for six years and six months; adding three years for the 2016 election, nine years and six months or six months short mandated by the constitution. Two days later, before a Senate session, Poe said that she wrote \"six years and six months\" because it was in April 2006 that her home in the United States was sold. Poe, who had been a resident of the United States for 13 years, returned to the Philippines after her father Fernando Poe, Jr. died in December 2004. She said that she has proof that she had been living in the Philippines since February 2005. She said, that despite being a congressman for Navotas, Tiangco lives elsewhere, and that her decision on whether to run in 2016 is \"50%\" sure. Poe also observed that the attacks from UNA only began after she signed the Senate Blue Ribbon subcommittee report recommending plunder and graft cases against Binay.\nBy August, Grace Poe had already met with the Nationalist People's Coalition three times, together with Francis Escudero.\nWith the candidacy of Grace Poe for president, the Liberal Party surrendered on courting the senator to be the running mate of Mar Roxas. It was indicated that she will form a caucus from the member-parties of the administration bloc, namely Nacionalista Party, National Unity Party, Nationalist People's Coalition and Makabayang Koalisyon ng Mamamayan.\nOn September 16, 2015, Poe declared her presidential bid, in front of hundreds of supporters, family and friends at the Bahay ng Alumni, University of the Philippines, Diliman, Quezon City under the newly coalition of Partido Pilipinas, composed of Bagong Alyansang Makabayan and is led by the Nationalist People's Coalition. Former Philippine President and Mayor of Manila Joseph Estrada has given his support to her. On her speech announcing her presidential bid, Grace Poe laid down a 20-point program of government if she would be elected.\nSome politicians had questioned Poe's capability if she should run for president, citing her short tenure as senator. Opposition party United Nationalist Alliance, on the other hand, questioned Poe's citizenship, claiming at the time of the elections, she is still short of the 10-year constitutional residency requirement for the presidential race.\nSheryl Cruz, actress and adoptive cousin of Poe, withdrawn her support to the Senator's presidential campaign recently. Cruz reiterated that she would be better to run for the presidency in the 2022 national elections and filed more draft bills in her Senate stint.\nOn December 1, the COMELEC's second division had formally disqualified Poe from running as president in the 2016 elections and cancelled her filed Certificate of Candidacy for not failing to meet with citizenship and residency requirements. The division, was voted 3–0, in favor of the petition filed by Atty. Estrella Elamparo to disqualify Poe. The decision stated that Poe had failed to comply with the 10-year residency requirement, mandatory for a presidential candidate. Poe, in a latter statement said that she was disappointed on the decision and she will appeal the verdict before the Comelec En Banc and the Supreme Court.\nUnder Comelec rules, the party or coalition supporting her may file a substitute before December 10, 2015. On December 11, the commission's first division also disqualified Poe. The first division, voted 2–1 in favor of the petition filed by former Senator Francisco Tatad, DLSU professor Antonio Contreras and UE law dean Amado Valdez to disqualify and cancel the certificate of candidacy of Poe.\nValenzuela City mayor Rexlon \"Rex\" Gatchalian is the campaign spokesperson, while Cebu representative Ace Durano will be the spokesperson of the Partido ng Galing at Puso coalition.\nThe campaign of both Poe and Escudero started with a proclamation rally held in the historical Plaza Miranda, Quiapo, Manila on February 9, 2016.\nOn February 29, 2016, the Nationalist People's Coalition (NPC) has officially endorsed Poe and Escudero as their pick for president and vice president, respectively, after a series of consultations with candidates from the party's leaders and members.\nOn March 8, 2016, the Supreme Court decided to allow Poe to run for president and reverse the decision of the COMELEC to disqualify her in the 2016 presidential elections, voting 9–6.\nFormer president and former Manila mayor Joseph Estrada has secured his endorsement to Poe as his presidential choice during his proclamation rally at the Liwasang Bonifacio on March 28, 2016.\nThe Poe's campaign team also officially released a collection of special stickers for Viber messaging app on smartphones. Poe is the first politician in the world to have appeared in a Viber sticker.\nRunning mate\nGrace Poe introduced her running mate, fellow Senator Francis Escudero, in an event that was held at the Kalayaan Hall, Club Filipino, San Juan, weeks after Mar Roxas was endorsed by President Noynoy Aquino at the same place (July 31, 2015). In his speech, Escudero accepted the position of being the running mate of Poe that will lead the \"Gobyernong May Puso\" or Government with a Heart thru a detailed and up-to-date platform of the government agencies thru budget allocation and ridding off incompetent government officials. Escudero was the campaign spokesperson during the presidential bid campaign of Poe's father Fernando Poe, Jr. during the 2004 national elections. Both Poe and Escudero will run as an independent candidates.\nPlatform\n*Inclusive growth, global competitiveness and open government\n*Education\n*Improving agriculture, including land reform, irrigation and mechanization\n*Improved infrastructure, including the Internet\n*Government-supported industrialization to induce manufacturing and create more jobs\n*Improved transparency with the enactment of the Freedom of Information Law\n*Reduced taxes and improved wages and benefits\n*Lower power rates while boosting power generation with more attention on renewable energy\n*Increased legal support to distressed overseas Filipino workers and reduced fees and red tape for those applying for work abroad\n*Intensified campaign against crime and drugs\n*Peace talks with various groups fighting the government\n*Respect for human rights and the needs of vulnerable sectors, including persons with disabilities, indigenous people, the urban poor, women, children, foundings, the LGBT sector and senior citizens\n*Health, including adequately staffed and equipped hospitals in every city, and strengthening the Philhealth program\n*More roads and trains not only in Metro Manila but in major centers around the country and increasing infrastructure spending to seven percent of GDP\n*More support for arts, culture and sports\n*The establishment of an Emergency Management Department to address climate change and disaster preparedness\n*Strengthen tourism programs\n*A broadened conditional cash transfer program and improved nutrition for the young\nPolitical positions\nDomestic policies\nPolitical reform and federalism\nPoe is in favor of charter change so that the country will attract more investors. The move, she said, will bring more jobs in the country, and will greatly reduce poverty, especially in rural areas. Poe is against the country's shift to federalism unless an anti-political dynasty law is passed. She sees a federal Philippines without an anti-dynasty law as a nation that would perpetuate political dynasties and prolong their existence. Poe is vehemently against political dynasties, as she sees it as a source of corruption, which has been proven by various cases connected to families of a political status.\nFreedom of Information\nPoe is the main proponent of the Freedom of Information (FOI) Bill and the official face of the government transparency movement in the Philippines. She has been pushing the enactment of the bill on the very first day she was elected as senator.\nTax reform, labor, and poverty alleviation\nPoe is in favor of lowering income taxes as she sees it as a burden to the masses. She is against contractualization, stating that the practice is anti-poor. Poe iterated that she will continue and enhance the Conditional Cash Transfer Program (Pantawid Pamilyang Pilipino) or 4Ps and stresses that the families under the 4Ps should become independent after the program.\nBangsamoro\nPoe is in favor of the passage of the Bangsamoro Basic Law, stating it is key to peace and stability in all of Mindanao and the country as a whole.\nReproductive health\nPoe is in favor of the complete implementation of the Reproductive Health Law which allows the usage of contraception and an effective educational campaign on reproductive health, especially among women. She states that the law will greatly help in reducing maternal deaths. Her position on abortion is not clearly defined.\nDivorce\nPoe is not in favor of divorce, stating that the first thing to do first is to amend the Family Code of the Philippines.\nLGBT Rights\nPoe is in favor of the passage of the Anti-Discrimination Bill (now SOGIE Equality Bill). The LGBT sector was one of the sectors she prioritized and thanked during her 2016 presidential bid. She was not in favor of same-sex marriage during a 2013 interview and instead was in favor of domestic partnership, however, she changed her mind and announced her support for same-sex marriage in 2016, the first and only presidential candidate in Philippine history to do so.\nCapital punishment\nPoe is in favor of the death penalty, but only in cases that involves heinous crimes.\nEnvironment and agriculture\nPoe wants to establish a Department of Risk Reduction and Management to nationalize the efforts to manage and mitigate climate change, as the current agency for the job are constrained due to lack of a nationalized integration efforts. She is in favor of the passage of the National Land Use Act, which is one of the priority environmental bills of the Green Thumb Coalition, the country's largest environmental coalition of pro-environment organizations. She is also advocating for the modernization of PAGASA, the country's meteorological institution. Poe wants to allot 10% of GDP solely for the benefit of the country's agriculture and aquaculture industries, which would have been the biggest GDP percentage usage in Philippine history. She is in favor of the establishment of a Department of Aquaculture and agro-industrial zones.\nEducation, culture, and arts\nPoe vowed to eliminate classroom backlogs and maximize digital technology for education. She stated that her administration will develop a curriculum for indigenous peoples and will initiate reforms in the budget to make sure indigenous people's education is rooted in the IP's' culture. Her target is to build more schools within the 5-kilometer range of IP communities. She is in favor in giving free education in all levels up to college. She has also expressed the need for the continuation of the K-12 Program, which she believes will benefit the country in the long-run. Being the daughter of a National Artist for Cinema, FPJ, she is a strong advocate for the enhancement and internationalization of Philippine culture and the arts, especially among the youth. She views Philippine culture and arts as the next Asian spotlight.\nInfrastructure and internet\nPoe is advocating for the establishment of a high-speed bullet train system from Manila to Clark. She is also advocating the establishment or modernization of airports, notably in Laoag, Clark, Bacolod, Dumaguete, Bohol, Cebu, and Iloilo. She also intends to fix the bus franchise system which has caused traffic in Metro Manila. She is in favor of shifting into renewable-powered vehicles from the current oil-powered vehicles. She is in favor of the passage of the Magna Carta for Internet Freedom. She also advocated for the establishment of free Wi-Fi in all public areas in the country and the entrance of foreign internet providers to enhance internet competition in the country, which would help speed-up one of the world's worst internet connection speed.\nOFW rights\nPoe supports the establishment of more resource centers for our OFWs to bring services closer to Filipinos abroad. She wants the establishment of a Department of Overseas Filipino Workers. She also stated that the goal is to create a better job environment in the Philippines, so that the country will eventually stop exporting its talented workers. She is supported by notable OFW advocate, Susan 'Toots' Ople.\nHealth\nPoe wants to expand the coverage of PhilHealth, increase the basic pay of medical workers into 25,000 pesos, modernize all public hospitals, and to establish special barangay health centers nationwide.\nForeign policy\nPoe has repeatedly said in public statements and speeches her opposition to China's territorial aggression and land grabbing in the South China Sea. She is in favor of having a diplomatic battle with China under United Nations specifications and international law. She also wants a unified ASEAN to combat China's aggression. Poe believes that the rights to Eastern Sabah is for the Philippines, and the Philippines alone. She bases her position on claims of the Sultanate of Sulu which gave all its territorial rights to the government of the Philippines in the late 20th century.\nEndorsements\n;Presidents of the Philippines\n* Joseph Estrada, 13th President of the Philippines (1998–2001) and Mayor of Manila\n;Current and former senators\n* Richard Gordon\n* Loren Legarda\n* Sergio Osmeña III\n* Nina Rasul\n* Leticia Ramos-Shahani\n* Ralph Recto\n* Tito Sotto\n* Antonio Trillanes\n* Migz Zubiri\n* Manny Villar\n* Cynthia Villar\n* Bong Revilla\n* Boots Anson-Rodrigo, veteran actress\n* Nora Aunor, actress\n* Wally Bayola, comedian, TV host\n* Angelica Jones-Alarva, singer, actress\n* Boobay, comedian, TV host\n* Yeng Constantino, singer, host\n* Rez Cortez, actor\n* Tirso Cruz III, actor\n* Dingdong Dantes, actor, commissioner-at-large of the National Youth Commission\n* Manet Dayrit, film producer\n* Glaiza de Castro, actress\n* Joey de Leon, actor, comedian, host\n* Heart Evangelista, actress, wife of running mate\n* Helen Gamboa, veteran actress\n* Eddie Garcia, veteran actor\n* Dolor Guevarra, talent manager\n* Bianca Gonzales, TV host, model\n* Allan K., actor, comedian\n* Zoren Legaspi, actor\n* Pauleen Luna, actress, TV host\n* Jose Manalo, comedian, TV host\n* Edu Manzano, actor, senatorial candidate\n* Coco Martin, actor\n* Albert Martinez, actor\n* Lily Monteverde, Regal Films proprietor\n* Alonzo Muhlach, actor\n* Niño Muhlach, actor\n* Rocco Nacino, actor\n* Bibeth Orteza, film director\n* Bela Padilla, actress, model\n* Gil Portes, director, producer, screenwriter\n* Angeline Quinto, singer\n* Epy Quizon, actor\n* Lance Raymundo, actor, singer\n* Marian Rivera, actress\n* Ruby Rodriguez, comedian, TV host\n* Joey Romero, film director\n* Giselle Sanchez, comedian\n* Carlitos Siguion-Reyna, film director\n* Lolit Solis, showbiz columnist\n* Vic Sotto, actor, TV host\n* Lorna Tolentino, actress\n* Regine Velasquez, singer, actress\n* Carmina Villarroel, actress\n* Tim Yap, TV and radio host, columnist\n* Slater Young, actor, TV personality\n* Dawn Zulueta, actress\n}}\n;Current and former Philippine representatives\n* Giorgidi Aggabao, representative from Isabela\n* Feliciano Belmonte, Speaker of the House\n* Teodoro Casiño\n* Danding Cojuangco\n* Peping Cojuangco\n* Tingting Cojuangco\n* Mark Enverga, representative from Quezon Province\n* Gloria Macapagal Arroyo, representative from Pampanga\n* Win Gatchalian, representative from Valenzuela City\n* Roilo Golez, former representative from Parañaque\n* Luzviminda Ilagan\n* Romeo Jalosjos, former representative from Zamboanga del Norte\n* Rafael V. Mariano\n* Liza Maza\n* Florencio Noel, former representative from An Waray Party-List\n* Satur Ocampo\n* Raymond Palatino\n* Roman Romulo, representative from Pasig\n* Shalani Soledad, former representative from the 2nd district of Valenzuela, TV personality\n* Lucy Torres\n* Joel Virador\n* Ronaldo Zamora, Philippine representative from San Juan City\n*Carlos Isagani Zarate\n*Lani Revilla\n*Susana Punzalan, candidate for representative in 1st district of Caloocan\n;Current and former mayors and municipal officials\n* Lito Atienza, representative from Buhay Partylist, former mayor of Manila\n* Rex Gatchalian, mayor of Valenzuela City\n* Isko Moreno, vice mayor of Manila\n* Strike Revilla, mayor of Bacoor\n*Enrico Echiverri, former mayor of Caloocan\n;Current and former governors and vice governors\n* Grace Padaca, former governor from Isabela\n* Jolo Revilla, Vice Governor from Cavite\n* David Suarez, Governor from Quezon\n* Luis Raymund Villafuerte, former governor from Camarines Sur\n* Migz Villafuerte, Governor from Camarines Sur\n* Joey Salceda, Governor from Albay\n;Others\n* Lorna Kapunan, lawyer\n* Susan Ople\n* Samuel Pagdilao, former Director of the PNP Criminal Investigation and Detection Group\n* Arnold Atienza, former Manila councilor\n;Organizations\n* Ako Bicol\n* Abono\n* Aksyon Demokratiko\n* All For Grace Poe Movement (#All4GP)\n* Alliance of Concerned Teachers\n* Anakpawis\n* An Waray\n* Bayan Muna\n* Bicol Youth for Grace\n* BUHAY Party List\n* Catholic Bishops Conference of the Philippines\n* Filipinos for Peace, Justice and Progress Movement (FPJPM)\n* Gabriela Women's Party\n* Gawa at Prinsipyo Coalition\n** Adopt Grace Poe Movement\n** Kabataan Poe\n** Change Movers\n** Muslim Movement for Genuine Change\n* Go Grace Poe\n* GP Movement\n* Grace Poe, the next President – TDSAF\n* Great People's Movement for Progress (GPPM)\n* Kilusang Mayo Uno\n* Magdalo coalition\n* Makabayan coalition\n* Nationalist People's Coalition\n; Current and former mayors and municipal officials\n* Lito Atienza, representative from Buhay Partylist, former mayor of Manila\n* Paolo Duterte, vice mayor of Davao City\n;Celebrities\n* Ogie Alcasid, actor, singer\n;Organizations\n* KABAKA\n* Makabayan Coalition\n* Nationalist People's Coalition\n}}\nSenate slate\nPoe and Escudero revealed that 11 candidates were named on the initial list of the senatorial slate that will formed but details were not disclosed. In September 2015, Poe endorsed Bayan Muna representative Neri Colmenares as the first senatorial bet on her formed coalition for the 2016 elections.\nIn October 2015, Poe-Escudero tandem finally announced in an event held in Club Filipino, San Juan, the complete senatorial slate for the \"Partido Galing at Puso\" coalition:\n*Neri Colmenares (Bayan Muna), party-list representative\n*Isko Moreno Domagoso (PMP), Manila vice-mayor\n*Win Gatchalian (NPC), Valenzuela City representative and former mayor\n*Richard J. Gordon (Bagumbayan-VNP), Philippine Red Cross chairman and former senator\n*Lorna Kapunan (Aksyon), lawyer\n*Edu Manzano, actor\n*Susan Ople (Nacionalista)\n*Samuel Pagdilao former PNP Criminal Investigation and Detection Group Chief and ACT-CIS Representative\n*Ralph Recto (Nacionalista)\n*Roman Romulo, Pasig representative\n*Tito Sotto (NPC), Acting Senate Minority Floor Leader and Eat Bulaga! host\n*Migz Zubiri, former senator and former Bukidnon representative\nSee also\n* Fernando Poe Jr. 2004 presidential campaign\nReferences"
    }
  ]
}