{
  "content": [
    {
      "type": "text",
      "text": "# Grace Woodward__disambig_2\n\n|birth_place = London, England\n|death_date  =\n|death_place =\n|occupation  = Creative Consultant, Stylist and Presenter\n|education   = London College of Fashion\n|label_name  =\n|awards      =\n|spouse      = Ken Drewery\n|children    = 1\n|}}\nGrace Woodward (born 1976) is an English creative, fashion stylist and television presenter\nShe is known for various TV and radio roles, such as judging for Sky Living's ''Britain and Ireland's Next Top Model, hosting Chick Fix on the same channel, and hosting her own show, Style Moves, on Soho Radio.\nBiography\nBorn in London in 1976, she studied art and theatre at sixth form college, following with a degree in fashion promotion  at the London College of Fashion, graduating in broadcast and marketing. On graduation she joined Agent Provocateur, rising to become Head of Press.\nIn 2004, she left her corporate job, and has since developed a career in styling, writing and creative direction leading to the launch of Grace Woodward Creative in 2008. Woodward was awarded Stylist of the Year 2009 by The Clothes Show and British Fashion Council. She has celebrity clientele, including La Roux; Emilia Fox; Florence and the Machine and Pharrell Williams. Woodward has also styled Green Day for the cover of Rolling Stone, a special Yves Saint Laurent issue for GQ and the GQ Men of the Year cover and its nominees who included Jonathan Rhys Myers, Cillian Murphy and Jamie Oliver.\nAs an editorial stylist, Woodward worked with The Sunday Times Style Magazine. She has also made contributions to The Saturday Times Magazine, Elle, Flaunt, Harpers Bazaar (UK and South America), Intersection, Nylon, Tank and 125. In the role of creative director she devised a 14-page feature for The Sunday Times Style Fashion Special celebrating and documenting the British fashion industry. In 2010 she joined The X Factor'' as fashion director and spent one series there.\nWoodward also works with charities, mainly in helping tackle the over production and consumption in fashion. She has been a face of the Fashion Revolution campaign, worked for Oxfam alongside Joanna Lumley and Brix Smith Start for their Shwopping campaigns and climate change organisation Global Cool with their Turn Up The Style, Turn Down The Heat campaign. Woodward has appeared on Channel 5's Live From Studio 5, and been the face of On|off.TV at London Fashion Week. In 2015 was a judge on The Observer Ethical Awards.\nOn 29 September 2012 Grace married long-term boyfriend Ken.\nIn 2016 she was tasked, under the role of Brand Director, with reviving the ailing fashion house of Dame Zandra Rhodes, launching a much lauded Archive Collection.\nReferences\nExternal links\n*\n*"
    }
  ]
}