{
  "content": [
    {
      "type": "text",
      "text": "# Graduate Student Paper Award\n\nThe Graduate Student Paper Award is presented by the Science Fiction Research Association to the outstanding scholarly essay read at the annual conference of the SFRA by a graduate student.\nPrevious winners\nPrevious winners include:\n* 1999 - Shelley Rodrigo Blanchard, \" 'Resistance is Futile,' We Are Already Assimilated: Cyborging, Cyborg Societies, Cyborgs, and The Matrix.\"\n* 2000 - Sonja Fritzsche, \"Out of the Western Box: Rethinking Popular Cultural Categories from the Perspective of East German Science Fiction.\"\n* 2001 - Eric Drown and Sha LaBare (tie). Drown for \"Riding the Cosmic Express in the Age of Mass Production: Independent Inventors as Pulp Heroes in American SF 1926-1939\" and LaBare for \"Outline for a Mode Manifesto: Science Fiction, Transhumanism, and Technoscience.\"\n* 2002 - Wendy Pearson, \"Homotopia? Or What's Behind a Prefix?\"\n* 2003 - Sarah Canfield Fuller, \"Speculating about Gendered Evolution: Bram Stoker's White Worm and the Horror of Sexual Selection.\"\n* 2004 - Melissa Colleen Stevenson, \"Single Cyborg Seeking Same: The Post-Human and the Problem of Loneliness.\"\n* 2005 - Rebecca Janicker, \"New England Narratives:  Space and Place in the Narratives of H.P. Lovecraft.\"\n* 2006 - Linda Wight, \"Magic, Art, Religion, Science:  Blurring the Boundaries of Science and Science Fiction in Marge Piercy's Cyborgian Narrative.\"\n* 2007 - Joseph Brown, \"Heinlein and the Cold War:  Epistemology and Politics in The Puppet Masters and Double Star.\"\n* 2008 - Unknown\n* 2009 - Dave Higgins, “The Imperial Unconscious: Samuel R. Delany’s The Fall of the Towers\"\n* 2010 - Andrew Ferguson, “Such Delight in Bloody Slaughter: R. A. Lafferty and the Dismemberment of the Body Grotesque”\n* 2011 - Bradley Fest, \"Tales of Archival Crisis: Stephenson’s Reimagining of the Post-Apocalyptic Frontier,\" and Honorable Mention: Erin McQuiston, \"Thank God It’s Friday: Threatened Frontier Masculinity in Robinson Crusoe on Mars\"\n* 2012 - Florian Bast, \"Fantastic Voices: Octavia Butler’s First-Person Narrators and ‘The Evening and the Morning and the Night.’\"\n* 2013 - W. Andrew Shephard, \"'Beyond the Wide World's End': Themes of Cosmopolitanism in Alfred Bester's The Stars My Destination\"\n* 2014 - Michael Jarvis, \"'Wherever you go, there you are': Postmodern Pastiche and Oppositional Rhetoric in The Adventures of Buckaroo Banzai Across the Eighth Dimension\"\n* 2015 - W. Andrew Shephard, “'What is and What Should Never Be': Paracosmic Utopianism in Margaret Cavendish’s The Blazing World\"\n* 2016 - Dagmar Van Engen, “The Interspecies Erotic: Sex and the Nonhuman in Octavia Butler’s Xenogenesis Trilogy”\n* 2017 - Francis Gene-Rowe, “You Are The Hero: Stephen Mooney’s The Cursory Epic”\n* 2018 - Josh Pearson, “New Weird Frankenworlds: Speaking and Laboring Worlds in Cisco’s Internet of Everything\"\n* 2019 - Grant Dempsey, “Did they tell you I can Floak?’: Living Between Always and Sometimes, in China Miéville’s Embassytown.”\n* 2020 - Conrad Scott, “‘Changing Landscapes’: Ecocritical Dystopianism in Contemporary Indigenous SF Literature.”\n* 2021 - No award given due to COVID-19 pandemic\n* 2022 - John Landreville, “‘Speculative Metabolism: Digesting the Human in Upstream Color.”\n* 2023 - Josie Holland, “Constructing Radical Queer Futures and Deconstructing Noir Fiction in The Penumbra Podcast”\n* 2024 - Vicky Brewster, “Simulated Worlds and Digital Disruptions: Gothic Glitch in The Tenth Girl”\nReferences"
    }
  ]
}