{
  "content": [
    {
      "type": "text",
      "text": "# Graeme Hayward\n\n}}\n| death_place  = Oakville, Ontario Canada\n}}\nGraeme Hayward (1929 – July 4, 2013) was a Canadian Fourteen Foot Dinghy Hall of Fame Inductee by the Canadian Dinghy Association at Royal Canadian Yacht Club Toronto 2011\n* I-14 Team Race Champion (1x World and 6x Canadian)\n* Canadian Dinghy Association and World Association President, CDA Champion\n* America's Cup Match Racing rules pioneer, International Umpire and Judge\n* 39 year CYA committee(s) member and chair\nOver a 31-year period, Graeme owned and campaigned six International Fourteens, winning the World Team Races in Bermuda in 1959, the CDA Championship in 1958 and the CDA Team Racing Championships on six occasions. He helped build the clubhouse of the Itchenor Sailing Club and was Commodore of the Royal St. Lawrence Yacht Club in Montreal. Graeme was elected life member at Itchenor Sailing Club, Royal St. Lawrence Yacht Club and the Oxford-Cambridge Sailing Society. He was voted CYA Volunteer of the year in 1998.\nAs CDA president from 1966 to 1973, Graeme proposed and led the creation of the International Fourteen World Association. Graeme also served as CDA Measurer and Rules Committee Chairman for 25 years and helped author and update our constitution and class rules. As World President, he established formal trials for the single trapeze in North America and successfully lobbied the UK association to ensure its worldwide adoption in 1971. He was a leader of the Fourteen fleet in Montreal winning many important Canadian and US trophies including the Bongard, Buzzards Bay Bowl, DP Kirby Memorial and seven RstLYC I-14 class championships.\nAfter Fourteens, Graeme helped introduce on-the-water umpiring to the match racing world. He was the rules advisor for the Canadian entries at the 1982 and 1986 America's Cups and was part of the International Jury/Umpire teams in Fremantle, San Diego and Auckland. He was a member of the ISAF Working Party in Lymington that established the rules for umpiring and match racing (now Appendix C). He served as an International Umpire for 15 years, helped develop the Umpires’ call book and co-authored and administered the ISAF Umpires’ test. He has been an ISAF umpire and judge at 26 World Match Racing Conference events including various Louis Vuitton Cups, Nations Cups and Gold Cups. He has chaired or umpired at a further 27 match racing events including fourteen York Cups and the 2007 International C-Class Championships.\nGraeme has also served as ISAF judge over a 30-year period at 34 world and 57 major championships ranging from the International Fourteen Worlds to the Canada's Cup, Maxi World Cup, Whitbread, Australian America's Cup Defender Trials, SORC, Miami OCR, and World Championships for the Farr 40, J24 and Laser classes. Back home, Graeme was a member and chairman of the CYA Appeals, Racing Rules and Umpires’ committees over a 39-year period. In recognition of his contributions, he was elected member emeritus of the Appeals committee in 2004 and named CYA Judge emeritus in 2011.\n| align = center\n| quoted = true\n| width = 80%\n}}\nBiography\nDeath and afterward\nGraeme died on Thursday, July 4, 2013, following a five-year battle with cancer and other complications. He was 85. Graeme is survived by his caring and beloved wife Janice, his sons Gavin (Megan and daughter Lexie) and Peter (Andrea).\nAdditional background\nYacht clubs\nSince 1950 Itchenor Sailing Club Honorary life member\nSince 1952 Oxford and Cambridge Sailing Society Life member\nSince 1956 Royal St. Lawrence Yacht Club Commodore 1982–83, Honorary life member ‘10\n1987-2008 Oakville Club\nFourteens Owned\n1950 Thor K 501 Uffa Fox 1969 Tradewind KC 354 Kirby III\n1957 Stormalong KC 179 Fairey V 1971 Bacchante KC 391 Kirby IV\n1964 Spindrift KC 279 Kirby II 1975 Goldfinger KC 476 Kirby V\nCompetitive Sailing Background\nCompeted in Fireflies, International Fourteens, Swordfish, Merlin-Rockets, International 30 sq. m., Swallows, Dragons, International 5.5 m and Offshore racing events. Principal class of competition was the International Fourteen. Owned and actively campaigned a series of six I-14s over 31 years from 1949 until 1980. Finished 6th at POW in 1951. Won the Itchenor Gallon in 1952, the CDA Championships and the Governor General's Trophy in 1958 (in a fleet of over 50 boats), the Buzzards Bay Bowl in 1960, the Bongard Cup, the DP Kirby Memorial, seven RstLYC I-14 Class Championships and three RstLYC Club Championships. Team raced from 1948 until 1980. Member Cambridge University sailing team 1949. Twice member of the winning team for the Wilson Trophy at West Kirby. Member of the winning team at the\nInternational 14 World Team Races in Bermuda 1959. Twice member of Canadian International 14 teams at other World Team Races in 1969 (Kingston) and 1971 (Annapolis). Member of the winning team at 6 Currie Cups (Canadian I-14 Team Racing Championships). Since 1980 have cruised extensively in the Great Lakes and the Caribbean.\nInternational Fourteen Associations\n1954-1956 Member, UK International 14 committee.\n1956-1980 Member, Canadian International 14 Dinghy Association.\n1956 to 1980 Official Class measurer\n1957 to 1980 Rules committee chairman\n1966 to 1973 Canadian Dinghy Association President\n1970-1972 President, World Association of International 14 ft dinghies\nCanadian Yachting Association\nSince 1970 Member, Appeals Committee - Chairman 1980–2003, Member emeritus 2004\nSince 1970 Member, Racing Rules Committee - Chairman1994-2007\n1987-2006 Chief Umpire and Chairman Umpires’ committee\n1995 Author of the book ‘The Complete Match Racing’ Two editions were published relating to the 1993/96 rules CYA Volunteer of the Year\n2011 CYA Judge emeritus\nInternational Sailing Federation/International Yacht Racing Union\n1980-2010 International Judge\n1991-2006 International Umpire\n1989 Member of the Working Party in Lymington which established Appendix B6 for match racing (now Appendix C). Part author of the first IU test.\n1995 Member of the Working Party for up-dating the ISAF International Judges manual.\n1997-2000 Member of the Working Party for the International Umpires’ Callbook.\n1997-2000 Member of the Working Party and editor of the International Umpires’ tests.\n1999-2000 Member, Racing Rules Committee.\nParticipation in Louis Vuitton series to the America's Cup Regattas\n1982 Newport. Rules advisor to Canada 1\n1986 Fremantle. Rules advisor to Canada 2.\n1996-1997 Fremantle. Member of the International Jury for the Australian America's Cup Defender trials.\n1992 San Diego. Umpire and member of the International Jury for RR-1, RR-2 and the Finals of the Louis Vuitton Cup.\n1996 San Diego. Worked with the Woman's Challenge for the America's Cup for two weeks as a guest umpire in their tune-up trials.\n1999/2000 Auckland. Umpire and member of the International Jury for the Round Robins and Semi-final of the Louis Vuitton Cup.\nMember of International Juries at the following Principal Events\nWorld Championships\nInternational America's Cup Class Worlds 1995\nMaxi Worlds 1987 and 1989\n12m Worlds 1988\nInternational 50&nbsp;ft Worlds 1993\n8m Worlds 1989\n5.5m Worlds 1989\nOne Ton Worlds 1988\nCorel 45 Worlds 1997\nFarr 40 Worlds 1998, 2000, 2002 and 2004\nMumm 36 Worlds 1998, 2003 and 2004\nJ 24 Worlds 1982, 1992 and 2000\nE 22 Worlds 1981 and 1982\nHobie 18 Worlds 1987\nInternational 14 Worlds Team Racing 1978, 1985 and 2002\nInternational 14 Worlds 2002\nAustralian 14 Worlds 1986\n5 O5 Worlds 1990\nLaser Worlds 1980\n420 Worlds 1997\nDisabled Sailing Worlds 1993\nMelges 24 Worlds 2002\nMumm 30 Worlds 2000, 2002 and 2004\nSunfish Worlds 2002\nNumber of events 34\nOther major events\nCanada's Cup 1978, 1988, 1994, 2001 and 2003\nWhitbread Round the World (at Ft Lauderdale) 1994\nAustralian America's Cup Defender Trials 1986 and 1997\n5.5m Scandinavian Gold Cup 1989 and 1997\nKey West Week 1996-1998 and 2001-2003\nSouthern Ocean Racing Conference Week 1996 through 2004\nBlock Island Week 1995, 1997, 1999, 2001, 2003, 2005, 2007\nAntigua Sailing Week 1998 through 2006\nBermuda Race Week 1996 and 1997\nBayview – Mackinac Race 1993, 1998 and 1999\nBritish America's Cup (Team Racing) 1996\nMiami Olympic Classes Regatta 1995\nSoling North Americans 1998\n49er North Americans 1998\nJ 24 North Americans 1991\nJ 24 Mid-winters 1997\nFarr 40 Bahamian Championship 2002\nFarr 40 Invitational 2003\nMiami Race week 2005, 2006\nStar Western Hemisphere 2005\nJ 35 North Americans 2007\nNumber of events 57\nUmpired at the following Principal Events\nWorld Match Racing Conference events\nWMRC Match Race Finals 1991 and 1992.\nLouis Vuitton Cup, RR-1, RR-2 and Finals 1992\nBermuda Gold Cup 1991 through 1996, 1998 and 1999\nColumbus Cup 1992\nIYRU Nations Cup, Grand Final 1995\n12m Worlds 1988\nMaxi Worlds 1987 and 1988\nInfanta Donna Christina (Soling Worlds) 1995\nCongressional Cup 1989 and 1996\nGolden Gate Invitational 1994, 1996, 1998 and 1999\nKnickerbocker Cup 1995, 1996 and 2000\nNippon Cup 1992\nVirgin Islands Match Race 1998\nSanta Maria, US Women's Championship 1999-2002 and 2006\nThompson Cup, Women's MR Championship 2000 and 2006\nUBS Challenge, Championship Finals 2002\nNumber of events 26\nOther Match Racing events\nNations Cup, Area E Eliminations 1991 and 1995\nCanadian Match Race Championships 1991 through 1994\nYork Cup, RCYC, Toronto 1989 through 2002\nSoling North Americans 1998\nUBS Challenge, US Championship 2002\nC Class Catamaran, Championship 2007\nNumber of events 27\nNote: At most of these match racing events, was also a member of the International Jury.\nReferences"
    }
  ]
}