{
  "content": [
    {
      "type": "text",
      "text": "# Grammy Award for Best Country Collaboration with Vocals\n\nThe Grammy Award for Best Country Collaboration with Vocals was an honor presented at the Grammy Awards, a ceremony that was established in 1958 and originally called the Gramophone Awards, to quality country music collaborations for artists who do not normally perform together. Honors in several categories are presented at the ceremony annually by the National Academy of Recording Arts and Sciences of the United States to \"honor artistic achievement, technical proficiency and overall excellence in the recording industry, without regard to album sales or chart position\".\nOriginally called the Best Country Vocal Performance, Duet, the award was first presented to Kenny Rogers and Ronnie Milsap at the 30th Grammy Awards in 1988 for the single \"Make No Mistake, She's Mine\". The next year, the category's name was changed to Best Country Vocal Collaboration, a name it held until 1996 when it was awarded as the Best Country Collaboration with Vocals. In 2011, the category was merged with the Grammy Award for Best Country Performance by a Duo or Group with Vocal and the Grammy Award for Best Country Instrumental Performance, forming the Grammy Award for Best Country Duo/Group Performance in order to \"tighten the number of categories\" at the Grammy Awards.\nAlison Krauss holds the record for having the most wins in this category, with a total of five. She is followed by seven others, who have all won the award twice. Among the most nominated are Emmylou Harris and Willie Nelson, both nine-time nominees. Krauss was nominated eight times, while Dolly Parton was a seven-time hopeful. Nominated bands include 1996 winners Shenandoah, a five-man country music band, three-time nominees the Nitty Gritty Dirt Band, as well as one of the award's final recipients, the Zac Brown Band.\nRecipients\nFive-time award winner Alison Krauss\nand 2000 award winner Emmylou Harris|alt=A Caucasian woman with white hair playing a guitar]]\nand 2008 award winner Willie Nelson]]\n, one of two winners born outside of the United States|alt=A face shot of a Caucasian women with black hair and brown eyes]]\naward winner Carrie Underwood collaborated with Randy Travis]]\n{| class=\"wikitable sortable plainrowheaders\"\n! scope=\"col\" style=\"width:5em;\" | Year\n! scope=\"col\" | Performing artists\n! scope=\"col\" | Work\n! scope=\"col\" class=\"unsortable\" | Nominees\n! scope=\"col\" class=\"unsortable\" | Ref.\n|-\n! scope=\"row\" |1988\n|  with Kenny Rogers\n|\n|\n| align=\"center\"|\n|-\n! scope=\"row\"|1989\n|  and k.d. lang\n|\n|\n| align=\"center\"|\n|-\n! scope=\"row\" |1990\n|  with Hank Williams, Sr.\n|\n|\n| align=\"center\"|\n|-\n! scope=\"row\" |1991\n|  and Mark Knopfler\n|\n|\n| align=\"center\"|\n|-\n! scope=\"row\" |1992\n|  with Vince Gill, Ricky Skaggs and Steve Wariner\n|\n|\n| align=\"center\"|\n|-\n! scope=\"row\" |1993\n|  featuring Marty Stuart\n|\n|\n| align=\"center\"|\n|-\n! scope=\"row\" |1994\n|  with Linda Davis\n|\n|\n| align=\"center\"|\n|-\n! scope=\"row\" |1995\n|  and Trisha Yearwood\n|\n|\n| align=\"center\"|\n|-\n! scope=\"row\" |1996\n|\n|\n| align=\"center\"|\n|-\n! scope=\"row\" |1997\n|  featuring Alison Krauss & Union Station\n|\n|\n| align=\"center\"|\n|-\n! scope=\"row\" |1998\n|  with Garth Brooks\n|\n|\n| align=\"center\"|\n|-\n! scope=\"row\" |1999\n| , Joe Diffie, Merle Haggard, Emmylou Harris, Alison Krauss, Patty Loveless, Earl Scruggs, Ricky Skaggs, Marty Stuart, Pam Tillis, Randy Travis, Travis Tritt and Dwight Yoakam\n|\n|\n| align=\"center\"|\n|-\n! scope=\"row\" |2000\n| , Linda Ronstadt and Dolly Parton\n|\n|\n| align=\"center\"|\n|-\n! scope=\"row\" |2001\n|  with Tim McGraw\n|\n|\n| align=\"center\"|\n|-\n! scope=\"row\" |2002\n| , Pat Enright and Harley Allen (The Soggy Bottom Boys)\n|\n|\n| align=\"center\"|\n|-\n! scope=\"row\" |2003\n|  with Lee Ann Womack\n|\n|\n| align=\"center\"|\n|-\n! scope=\"row\" |2004\n|  and Alison Krauss\n|\n|\n| align=\"center\"|\n|-\n! scope=\"row\" |2005\n|  with Jack White\n|\n|\n| align=\"center\"|\n|-\n! scope=\"row\" |2006\n|  featuring Tim McGraw\n|\n|\n| align=\"center\"|\n|-\n! scope=\"row\" |2007\n|  with Jennifer Nettles of Sugarland\n|\n|\n| align=\"center\"|\n|-\n! scope=\"row\" |2008\n|  and Ray Price\n|\n|\n| align=\"center\"|\n|-\n! scope=\"row\" |2009\n|  and Alison Krauss\n|\n|\n| align=\"center\"|\n|-\n! scope=\"row\" |2010\n|  featuring Randy Travis\n|\n|\n| align=\"center\"|\n|-\n! scope=\"row\" |2011\n|\n|\n| align=\"center\"|\n|}\nEach year is linked to the article about the Grammy Awards held that year.\nSee also\n* Grammy Award for Best Country Duo/Group Performance\n* Grammy Award for Best Country Performance by a Duo or Group with Vocal\n* Grammy Award for Best Country Solo Performance\n* Grammy Award for Best Female Country Vocal Performance\n* Grammy Award for Best Male Country Vocal Performance\nReferences\n;General\n*  Note: User must select the \"Country\" category as the genre under the search feature.\n;Specific\nExternal links\n*[http://www.grammy.com/ Official site of the Grammy Awards]"
    }
  ]
}