{
  "content": [
    {
      "type": "text",
      "text": "# Gramps (software)\n\n| latest release version =\n| latest release date =\n| latest preview version =\n| latest preview date =\n| programming language = Python (GTK+ 3)\n| operating system = Linux, BSD, Solaris, Windows, macOS\n| platform = GTK+ 3\n| language = Multilingual (40)\n| genre = Genealogy software\n| license = GPL-2.0-or-later\n| website =\n}}\nGramps, formerly GRAMPS (an acronym for Genealogical Research and Analysis Management Programming System), is a free and open-source genealogy software. It is developed in Python using PyGObject and utilizes Graphviz to create relationship graphs.\nGramps represents a form of commons-based peer production, created by genealogists for genealogists. Beyond human family trees, the software has been used to create animal pedigree charts and academic genealogies that map mentoring relationships among scientists, physicians, and scholars.\nFeatures\nGramps is a widely used offline genealogy software suite. Its features include:\n* Support for multiple languages and cultural contexts, including patronymic, matronymic, and multiple surname systems.\n* Full Unicode compatibility.\n* Relationship calculators, which accommodate language-specific relationship terminologies that lack direct translations in other languages.\n* The ability to generate reports in various formats, such as .odt, LaTeX, .pdf, .rtf, .html, and .txt.\n* Tools for creating a wide range of reports and charts, including relationship graphs of large, complex acyclic charts.\n* Extendability through more than 10 types of plugins. These plugins include Gramplets and Views; Gramplets provide dynamic or interactive views of data within the main Gramps interface.\n* An event-centric documentation approach, similar to the CIDOC Conceptual Reference Model used by many cultural heritage institutions.\n* A \"sanity check\" feature that flags improbable events, such as births involving individuals at unlikely ages.\n* Support for multiple calendar systems, including Gregorian, Julian, and Islamic calendars.\n* Comprehensive programmer's API documentation, with free and open-source code made publicly available\nFile format\n| latest release version = 1.7.2\n| latest release date    =\n| genre                  = Genealogy data exchange\n| container for          =\n| contained by           =\n| extended from          = XML\n| extended to            =\n| standard               =\n| free                   =\n| url                    =\n}}\nThe core archival file format of Gramps is named Gramps XML and uses the file extension .gramps. It is extended from XML. Gramps XML is a free format, and its files are usually compressed using gzip. The file format Portable Gramps XML Package uses the extension .gpkg and is currently a .tar.gz archive including Gramps XML together with all referenced media. Users may rename the file extension .gramps to .gz for editing the content of the genealogy document with a text editor. Internally, Gramps uses SQLite as the default database backend, with other databases available as plugins.\nGramps can import from the following formats: Gramps XML, Gramps Package (Portable Gramps XML), Gramps 2.x .grdb (older versions Gramps), GEDCOM, CSV.\nGramps supports exporting data in the following formats: Gramps XML, Gramps Package (Portable Gramps XML), GEDCOM, GeneWeb's GW format, Web Family Tree (.WFT) format, vCard, vCalendar, CSV.\nPrograms that support Gramps XML\n* [https://www.grampsweb.org Gramps Web] is a collaborative web app built on the core of Gramps itself and supports Gramps XML import and export\n* [https://pypi.org/project/betty/ Betty] by Bart Feenstra generates static websites from Gramps XML and Gramps XML Package files as alternatives to GEDCOM.\n* PhpGedView (version 4.1 and up) supports output to Gramps XML.\n* The Gramps PHP component JoomlaGen for Joomla uses an upload of the GRAMPS XML database export to show genealogical information and overviews. JoomlaGen is compatible with GRAMPS 3.3.0.\n* The script tmg2gramps by Anne Jessel converts The Master Genealogist v6 genealogy software datafile to a Gramps v2.2.6 XML.\nLanguages\nGramps is available in 45 languages (As of December 2014).\nGramps has two special-use sub-translation languages:\n* Animal pedigree which allows to keep track of the pedigree and breed of animals\n* Same gender/sex which gives the option of removing gender-biased verbiage from reports.\nRelease history\nThe project began as GRAMPS in 2001, and the first stable release was in 2004.\nThe following table shows a selected history of new feature releases for project. (Patches and bug fixes are published on GitHub and periodically collated in minor \"bug fix\" releases.)\n{| class=\"wikitable sortable\"\n! style=\"min-width:90px\" | Version\n! Release date\n! Name\n! Comment\n|-\n| GRAMPS 1.0.0 || 2004-02-11 || \"Stable as a Tombstone\" || Used XML to store all information. (Don originally called the program Relativity before his father suggested the name GRAMPS (Genealogical Research and Analysis Management Programming System))\n|-\n| GRAMPS 2.0.0 || 2005-05-11 || \"The Bright Side of Life\" || Introduction of the Berkeley database backend.\n|-\n| GRAMPS 2.0.8 || 2005-09-05 || \"Romani ite domum\" || First port to Macintosh OSX posted to MacPorts.\n|-\n| GRAMPS 2.2.1 || 2006-10-30 || \"One, two, five!\" || Originally only available for Unix-like operating systems, with this release GRAMPS became available for Windows.\n|-\n| GRAMPS 3.0.0 || 2008-03-24 || \"It was just getting interesting.\" || Introduced the new Family Tree database format .gpkg and deprecated the old .grdb database format. Plugin system called \"Gramplets\".\n|-\n| Gramps 3.2.0 || 2010-04-15 || \"I am your father\" || Name changed from GRAMPS. New management system for plugins, performance optimization, hierarchical place list, and map plotting view.\n|-\n| Gramps 3.4.0 || 2012-05-21 || \"Always look on the bright side of life\" || Replaced Source References with Citations that allow sharing and can have media objects and 'data' elements attached to them. The Gramps XML Specification was updated to make it idempotent.\n|-\n| Gramps 4.0.0 || 2013-05-21 || \"The Miracle of Birth\" || Conversion to GTK+ 3, add support for Python 3. Keeps the same data format as Gramps 3.4.\n|-\n| Gramps 4.1.0 || 2014-06-18 || \"Name go in book\" || Full Python 3 support. New place hierarchies model. Different data format to the Gramps 3.4 series.\n|-\n| Gramps 4.2.0 || 2015-08-03 ||  || Python 3 support only (Python 2 support dropped). Different data format to the GRAMPS 3.4 series.\n|-\n|Gramps 5.0.0\n|2018-07-24\n|\n| Python 3.2+ only / GTK 3.10+ / BSDDB 3 (Default backend) / SQLite3 (Experimental backend)\n|-\n|Gramps 5.1.0\n|2019-08-21\n|\n| Python 3.3+ only / GTK 3.12+ / SQLite3 (Default backend) / BSDDB 3 (Legacy backend)\n|-\n|Gramps 5.2.0\n|2024-02-23\n|\n| Python 3.8+ only / GTK 3.24+ / SQLite3 / BSDDB 3 (Read-only for upgrades)\n|-\n|Gramps 6.0.0\n|2025-03-19\n|\n| Python 3.9+ only / GTK 3.24+ / SQLite3 / BSDDB 3 (Read-only for upgrades)\n|-\n|}\n* [https://gramps-project.org/wiki/index.php?title=Previous_releases_of_Gramps Full history of previous releases].\n[http://www.phpgedview.net/neumont.php PhpGedView @ Neumont University] - *Clippings Cart (v4.1)** Add option to zip the GEDCOM/Gramps XML with the associated media files Gramps XML*Gramps XML (v4.1)** Add option to download entire GEDCOM in Gramps XML form** Add option to retrieve raw data from the SOAP web service in Gramps XML format** Gramps XML export support to include full source and media support\n}}\nExternal links\n*\n** [https://www.gramps-project.org/wiki/ Gramps wiki site]\n** [https://gramps-project.org/wiki/index.php?title=Database_Formats Gramps database formats]\n*  - Source code\n*  - Mailing List\n* [https://www.gramps-project.org/wiki/index.php/Reviews Reviews on Gramps]\n* [https://lwn.net/Articles/605409/ Genealogy research with Gramps]. LWN.net 2014.\nThis article contains text from the GNU GPL [https://gramps-project.org/gramps-manual/2.2/gramps-manual-2.2-en-USletter.pdf Gramps Manual V2.9]."
    }
  ]
}