{
  "content": [
    {
      "type": "text",
      "text": "# Grand Lodge of the Czech Republic\n\n}}\nThe Grand Lodge of the Czech Republic (, VLČR) is a Grand Lodge of Freemasons in the Czech Republic. It is the largest, oldest and the only one which is recognized as regular by the United Grand Lodge of England and most of the other regular lodges at an international level.\nHistory\nRoots\nin Prague, where National Grand Lodge was founded in 1923.]]\nCzech Freemasonry have roots up to the 18th century. From 1795 official masonic organizations were banned in the Austrian Empire. After establishment of Austria-Hungary masonry remained banned in Cisleithanian part of the monarchy up until 1918, while in Hungarian Lands of the Crown of Saint Stephen it remained legal. After establishment of Czechoslovakia in 1918 freemasonry was legalized and first lodges became to emerge. One of the bases of members of the lodges was Czech organization Maffia, active in resistance during the World War I. First lodge established in 1919 was Scottish Rite Lodge Jan Amos Komenský in Prague, which got recognition by the Grand Orient de France. While subsequently other Lodge Národ was founded and recognized by the Gran Loggia d'Italia, at that time in cooperation with the United Grand Lodge of England.\nFoundation\nOn 25 February 1923 in Prague lodges in Czechoslovakia merged and established National Grand Lodge of Czechoslovakia (NVLČs), whose main patronage was held by the Grand Lodge of Yugoslavia. During following years the National Grand Lodge consolidated its position as primarily established on Regular Freemasonry. During the First Czechoslovak Republic, freemasonry became fashionable subject among influential high society and were popular also in the government circles as well as in business.\nWorld War II and Post-War\nAfter German occupation of Czechoslovakia in 1938, exiled organization of Czechoslovak Freemasons operated in London, closely associated with many members of the Czechoslovak government-in-exile. After 1945 lodges were resurrected again and operation of the National Grand Lodge was officially restored in 1947 under factical leadership of Jaroslav Kvapil. After 1948 Czechoslovak coup d'état when Communists took power, masonic organization survived up to 1951, when it was officially banned especially by the pressure from Moscow.\nRestoration\nAfter Velvet Revolution in 1989 organizational structure of the Grand Lodge was restored on 17 November 1990 in Prague. After dissolution of Czechoslovakia in 1992 Grand Lodge was renamed to the current name Grand Lodge of the Czech Republic. On 8 March 2008 short-lived continental masonic Czech Grand Orient merged into the Grand Lodge of the Czech Republic which strengthened regular masonic organization in the country. Grand Lodge operated also in Slovakia until 21 March 2009, when Slovak lodges founded first Grand Lodge in the history of Slovakia – Grand Lodge of Slovakia.\nMember lodges\n, First Grand Master of the National Grand Lodge of Czechoslovakia from 1923 to 1924.]]\nin Prague completed in 1911 is a national cultural monument and a historical Masonic Temple, that is one of the most important buildings of Czech Freemasonry.]]\nCurrent lodges\n*Lóže č.01 Národ (Prague)\n*Lóže č.02 Dílo (Prague)\n*Lóže č.03 Most (Prague)\n*Lóže č.04 U tří hvězd (Prague)\n*Lóže č.05 Josef Dobrovský (Plzeň)\n*Lóže č.06 Ján Kollár (Prague), (currently dormant)\n*Lóže č.07 Alfons Mucha (Prague), uses French language\n*Lóže č.08 Goethe v údolí míru (Mariánské Lázně), uses German and Czech languages\n*Lóže č.09 Quatuor coronati (Prague), (research lodge)\n*Lóže č.10 U vycházejícího Slunce (Brno)\n*Lóže č.12 Hiram (Prague), uses English language\n*Lóže č.13 La Sincérité (Prague), uses German language\n*Lóže č.15 Comenius 17.11.1989 (Prague)\n*Lóže č.16 Dílna lidskosti (Prague)\n*Lóže č.17 Cestou světla (Brno)\n*Lóže č.19 Lux in tenebris (Ostrava)\n*Lóže č.20 Petra Solaris (Prague)\n*Lóže č.21 Sibi et posteris (Prague)\n*Lóže č.22 Santini (Prague), uses Italian language\n*Lóže č.23 Templum Sapientiae (Brno)\n*Lóže č.24 Bratrství (Podivín), (currently dormant)\n*Lóže č.25 Lasenic (Prague)\n*Lóže č.26 Josef Gočár (Hradec Králové)\n*Lóže č.27 Lafayettova na třech rovinách (Olomouc)\n*Lóže č.28 Pod kamennou růží (České Budějovice)\n*Lóže č.29 True and United Friends (Brno), uses English language\n*Lóže č.30 Porta Bohemica (Ústí nad Labem)\n*Lóže č.31 František Alexandr Zach (Prague)\n*Lóže č.32 Pravda a Jednota u Tří Korunovaných Sloupů (Prague)\n*Lóže č.33 San Miguel Arcángel (Prague), uses Spanish language\n*Lóže č.34 Pythagoras (Opava)\nFormer lodges\nThree former lodges of the Grand Lodge of the Czech Republic founded Grand Lodge of Slovakia in 2009.\n*Lóže č.11 Kosmopolis (Bratislava)\n*Lóže č.14 Libertas (Bratislava)\n*Lóže č.18 Humanizmus (Bratislava)\nLeadership\nin Prague, where National Grand Lodge was restored in 1990.]]\nAfter independence of Czechoslovakia in 1918 freemasonry was legalized. From 1919 to 1923 Josef Svatopluk Machar became Grand Master of precessor grand lodge, which was succeeded by the establishment of National Grand Lodge in 1923.\nGrand Masters\nNational Grand Lodge of Czechoslovakia\n*1923–1924: Jaroslav Kvapil\n*1924–1925:  Bohumil Němec\n*1925–1926: Emil Svoboda\n*1926–1930: Ladislav Syllaba\n*1930–1931: Ladislav Tichý\n*1931–1937: Karel Weigner\n*1937–1938: Václav Hora\nNational Grand Lodge of Czechoslovakia in exile\nDuring the German occupation of Czechoslovakia exile lodge operated in London.\n*1940–1945: Vladimír Klecanda\nNational Grand Lodge of Czechoslovakia\n*1947–1951: Bohumil Vančura\nFrom 1951 to 1990 freemasonry in Czechoslovakia was put dormant due to de facto ban by the communist regime. Grand Lodge was restored after Velvet Revolution in 1989.\n*1990–1992: Jiří Syllaba\n*1992–1993: Čestmír Barta\nGrand Lodge of the Czech Republic\n*1993–1997: Čestmír Barta\n*1997–1999: Robert J. Jeřábek\n*1999–2004: Pavel Šebek\n*2004–2007: Petr Jirounek\n*2007–2010: Hynek Beran\n*2010–2013: Jan Brousek\n*2013–2015: Jacques Huyghebaert\n*2015–2018: Pavel E. J. Gergel\n*2018–2021: Miloš Hošek\n*2021–2024: Petr Komárek\n*2024–present: Libor Adamec\nReferences\nExternal links\n*"
    }
  ]
}