{
  "content": [
    {
      "type": "text",
      "text": "# Grant v Edwards\n\nGrant v Edwards was an English Court of Appeal case on common intention constructive trusts.\nIt applied the decision in Eves v Eves [1975] and widened its effect to a 50% share in many future contributory common intention constructive trusts, where also an express intention is shown to have put the house into joint names, never fulfilled.\nFacts\nA house was purchased for the claimant and defendant to live in as if married. The plaintiff was in fact married to someone else and the house was purchased in the name of the defendant and the defendant's brother. The defendant had used words to the effect that, by way of explanation to the plaintiff, he would not put the claimants name into a title deed (\"On the deeds\") yet as it would be prejudicial towards matrimonial proceedings between the claimant and her husband (\"your divorce\").\nThe facts above were closely analogous to Eves v Eves.   However in Grant v Edwards less work was done by the claimant and the explanation used was not one about a person's age being \"not yet 21\" in that case, which was a legal fiction used by the other party to deny ownership.  In this case \"[the claimant] made a very substantial contribution to the housekeeping and to the feeding and bringing up of the children... The judge [at first instance] said that at that time she was earning substantially and making a financial contribution. It seems clear that she was still in regular employment in 1980, when her relationship with the defendant finally broke up.\"\nJudgment\nThe Court of Appeal ruled that the claimant was entitled to a 50% in the proceeds of sale from the property based upon a common intention based upon a statement that Mrs. Grant's name would appear on the title deeds.   The court expressly followed Eves v Eves, a case of the same legal status, however in that case it was found a 25% share was fairer given the maintenance payments also due, deposit and mortgage payments entirely by the defendant, and state of the law at that time.\nSee also\n*English property law\n*Burns v. Burns (1984)\nReferences\nExternal links\n* [http://www.bailii.org/ew/cases/EWCA/Civ/1986/4.html Judgment on Bailii]"
    }
  ]
}