{
  "content": [
    {
      "type": "text",
      "text": "# Grand strategy wargame\n\nA grand strategy wargame or simply grand strategy game (GSG) is a wargame that places focus on grand strategy: military strategy at the level of movement and use of a nation state or empire's resources. The genre has considerable overlap with 4X games, but differs in being \"asymmetrical\", meaning that players are more bound to a specific setup and not among equally free factions in exploring and progressing the game and an open world.\nScope of games\nGrand strategy games can be played on a computer or as a board game. They often include a map of the game world, which can range from a single continent to the entire globe. Players typically control a nation or empire and make decisions that affect its development, such as building infrastructure, recruiting and training military units, and negotiating with other players. Combat is often a major part of the game, but it is typically abstracted or simplified compared to more tactical wargames.\nExamples of grand strategy board games include Risk, Diplomacy, and Axis & Allies. These games focus on warfare and conquest, but do not include detailed representations of military units or tactics. More realistic grand strategy games, such as Rise and Decline of the Third Reich and Empires in Arms, include specific military units and combat rules. Computer-based grand strategy games, such as Hearts of Iron, Europa Universalis, and Total War, often have more detailed and sophisticated mechanics and can be played in real-time or with turns. Paradox Interactive is one of the video game publishers most active in the development of grand strategy video games through its subsidiary company Paradox Development Studio.\nCombat resolution systems\nVarious games have different methods for resolution of combat results, a central core dynamic for any wargame.\nAttacker-defender ratio\nThe wargame Panzerblitz is a leading game in the genre of tactical wargames, and was an iconic new type of game when published by Avalon Hill in 1970. In this game, each unit has an attack strength and a defense strength. To resolve combat, the attacker's attack rating and the defender's defense rating are calculated into a simple ratio; the result is rounded off in the defender's favor. One dice cube is rolled. The \"Combat Results Table\" provides the effect based on which number is rolled; the results can range from \"no effect\" to partial damage, or another roll, or complete destruction of the unit being attacked.\nAttack and defense values\nIn the board game Axis and Allies, each unit has an attack value and a defense value. During a single attack, each attacking unit gets one dice roll and each defending unit gets one dice roll. If a dice result is the same or less than the appropriate value, then that unit destroys the enemy. It is possible for both units to be destroyed using this system.\nAcademic use\nGrand strategy games can be useful in education and the study of international affairs because they allow players to simulate real-world scenarios and make strategic decisions that affect the outcome of the game. They can also provide insight into historical events and the complex interactions between various political, economic, and military factors. Some grand strategy games are based on real historical events and can be used to explore alternative scenarios and counterfactuals.\nSee also\n*4X\n*List of grand strategy video games\n*Government simulation game\n*List of board wargames\n*Wargame (video games)\nReferences"
    }
  ]
}