{
  "content": [
    {
      "type": "text",
      "text": "# Grand Army of the Republic Hall\n\nGrand Army of the Republic Hall, GAR Building, or variants thereof, may refer to:\nFlorida\n*Grand Army of the Republic Memorial Hall (St. Cloud, Florida)\nIdaho\n* Grand Army of the Republic Hall (Boise, Idaho)\nIllinois\n*Grand Army of the Republic Hall (Aurora, Illinois)\n*Grand Army of the Republic Memorial Hall (Peoria. Illinois)\nIowa\n*G.A.R. Memorial Hall (Algona, Iowa)\n*Franklin County G. A. R. Soldiers' Memorial Hall (Iowa)\nMassachusetts\n* Grand Army of the Republic Hall (Lynn, Massachusetts), listed on the National Register of Historic Places\n* Grand Army of the Republic Hall (Orange, Massachusetts)\n* Grand Army of the Republic Hall (Rockland, Massachusetts)\n* Grand Army of the Republic Hall (Worcester, Massachusetts)\n* Lothrop Memorial Building-G.A.R. Hall, Taunton, Massachusetts\nMichigan\n* Grand Army of the Republic Building, Detroit, Michigan, listed on the NRHP in Wayne County, Michigan\n* Grand Army of the Republic Hall (Marshall, Michigan), a state historic site in Calhoun County\n* Sunfield G. A. R. Hall, listed on the National Register of Historic Places\nMinnesota\n* Clearwater Masonic and Grand Army of the Republic Hall, also known as Clearwater Masonic Lodge\n* Grand Army of the Republic Hall (Grand Meadow, Minnesota)\n* Grand Army of the Republic Hall (Litchfield, Minnesota)\nNebraska\n* Grand Army of the Republic Memorial Hall (Nebraska City, Nebraska)\nNew Hampshire\n* Grand Army of the Republic Hall (Peterborough), see\nNew York\n* Grand Army of the Republic Hall (Halsey Valley, New York)\nOhio\n* Grand Army of the Republic Memorial Hall (Ironton, Ohio), on the National Register of Historic Places listings in Lawrence County, Ohio\nPennsylvania\n*Grand Army of the Republic Hall (Johnstown, Pennsylvania)\n*GAR Building (Lykens, Pennsylvania), listed on the National Register of Historic Places in Dauphin County, Pennsylvania\nSouth Dakota\n* Grand Army of the Republic Hall (Yankton, South Dakota), G.A.R. Hall Art Gallery (Home of Yankton Area Arts Association)\nWisconsin\n*Boscobel Grand Army of the Republic Hall, Boscobel, Wisconsin\n*Grand Army of the Republic Memorial Hall, now the Wisconsin Veterans Museum, Madison\nSee also\n*Grand Army of the Republic\n*Grand Army of the Republic Memorial (disambiguation)\n*Franklin County G. A. R. Soldiers' Memorial Hall (Iowa)\n*Grand Army Plaza, Manhattan, New York\n*G. A. R. Memorial Junior Senior High School\n*Memorial Hall (Rockford, Illinois)\n*National Civil War Museum, Harrisburg, Pennsylvania\n*New England Civil War Museum, Rockville, Connecticut\n*Porter County Memorial Opera Hall"
    }
  ]
}