{
  "content": [
    {
      "type": "text",
      "text": "# Grasstree Beach, Queensland\n\n| pop                 = 717\n| pop_year            =\n| pop_footnotes       =\n| established         =\n| postcode            = 4740\n| area                = 16.9\n| timezone            = AEST\n| utc                 = +10:00\n| dist1               = 15.6\n| dir1                = NW\n| location1           = Sarina\n| dist2               = 36.8\n| dir2                = SSE\n| location2           = Mackay\n| dist3               = 315\n| dir3                = NNW\n| location3           = Rockhampton\n| dist4               = 959\n| dir4                = NNW\n| location4           = Brisbane\n| lga                 = Mackay Region\n| stategov            = Mirani\n| fedgov              = Capricornia\n| near-n              = Hay Point\n| near-ne             = Coral Sea\n| near-e              = Coral Sea\n| near-se             = Campwin Beach\n| near-s              = Sarina Beach\n| near-sw             = Sarina\n| near-w              = Sarina\n| near-nw             = Alligator Creek\n}}\nGrasstree Beach is a coastal locality in the Mackay Region, Queensland, Australia. It contains two towns, Grasstree in the centre of the locality () and Zelma on the coast (). In the , Grasstree Beach had a population of 717 people.\nGeography\nThe Coral Sea forms the eastern boundary of the locality while Cabbage Tree Creek and Castrades Inlet form the southern boundary.\nThe locality has the following coastal features, clockwise:\n* Victor Island ()\n* Point Victor ()\n* Mick Ready Beach ()\n* Grasstree Beach ()\n* Castrades Inlet ()\n* Cabbage Tree Creek ()\nThe locality has the following mountains:\n* Mount Haden ()\n* Raspberry Hill ()\nThe Goonyella railway line enters the locality from the south-west (Sarina / Sarina Beach) and exits the locality to the north (Hay Point). The locality is served by the Dalrymple Junction railway station ().\nMuch of the land in the east of locality is undeveloped. There is suburban housing in the two towns with some rural residential housing to the north-west of the town of Grasstree and in the south-west of the locality. Apart from that, the predominant land use in the west of the locality is grazing on native vegetation.\nHistory\nGold was found in the area in 1889. The town of Grasstree first appears on an 1891 survey plan.\nIn August 1891, residents commenced fundraising to establish a school. Grass Tree Provisional School opened circa 1892 and closed in 1899. It reopened in 1901 and closed  permanently in 1905 due to low student numbers. It was located on the north-eastern side of Haden Street ().\nThe town of Zelma first appears on a 1935 survey plan.\nThe locality was officially named and bounded on 4 June 1999.\nDemographics\nIn the , Grasstree Beach had a population of 745 people.\nIn the , Grasstree Beach had a population of 717 people.\nEducation\nThere are no schools in Grasstree Beach. The nearest government primary school is Alligator Creek State School in neighbouring Alligator Creek to the west. The nearest government secondary school is Sarina State High School in neighbouring Sarina to the south-west.\nReferences\nFurther reading\n*\nExternal links\n*\n*[https://gisservices.information.qld.gov.au/arcgis/rest/directories/historicalscans/cad_scans/cad-map-town-grass-tree-1974.jpg Town map of Grasstree, 1974]\n*[https://gisservices.information.qld.gov.au/arcgis/rest/directories/historicalscans/cad_scans/cad-map-town-zelma-1984.jpg Town map of Zelma, 1984]"
    }
  ]
}