{
  "content": [
    {
      "type": "text",
      "text": "# Greater Newark Conservancy\n\nGreater Newark Conservancy is a non-profit organization headquartered in Newark, New Jersey, with the stated goal of promoting \"environmental stewardship to improve the quality of life in New Jersey's urban communities.\" It offers programs for youth education, community greening and gardening, nutritional health, job training, and prisoner re-entry.\nEducational programs\nThe conservancy provides programs on youth education and nutritional health and cooking. In the Demonstration Kitchen program, participants are provided instruction on cooking with recipes having high nutritional value.\nThe Newark Youth Leadership Project (NYLP) provides training to high school students living in Newark through a year-round internship program. Interns work with staff in the following departments: horticulture, education, farm stand, media, urban farming, and office/accounting. Year-round interns receive training in finance, public speaking, and nutrition.\nUrban farming\nGreater Newark Conservancy seeks to bolster and support urban farms in Newark, NJ. The urban farms were created with the purpose of offering low-cost and healthy foods in Newark. Participants also have the option of growing their own produce through the Plot-it-Fresh program. In 2011, the conservancy's urban farms generated 5,000 pounds of produce. The produce is sold in local farmers' markets through Youth Farm Stand – and intern-run produce stand. Crops raised include arugula, beets, cucumbers, garlic, tomatoes, peppers, strawberries, lettuce, and corn. Other related programs include raising chickens and maintaining a honey bee apiary.\nSchools in Newark, including the Hawthorne Avenue School, have partnered with the conservancy and FoodCorps service members to provide nutrition education. Students learn to grow produce and how to incorporate those crops into hearty, healthy meals.\nNew Jersey Reentry Corporation\nThe conservancy partners with the [http://njreentry.org/ New Jersey Reentry Corporation] (NJRC) to provide job training and social services to help remove barriers to employment for citizens returning from incarceration. Our relationship began in 2009 with the [http://citybloom.org/njrc/ Clean and Green] workforce program. In November 2015, the conservancy expanded their reach and became a full partner of NJRC.\nOn average, 10–20 participants complete the one-week orientation each week, which allows them to continue to use NJRC's services. The employment rate among participants at the conservancy is 68%, with an additional percentage involved in meaningful education or training opportunities, such as obtaining their Baccalaureate degrees or a Commercial Driving License (CDL). In stark contrast to the 77% recidivism rate for the State of New Jersey, the statewide recidivism rate for NJRC participants remains at only 19%.\nThe Prudential Outdoor Learning Center\nEducational activities are held primarily at the Judith L. Shipley Urban Environmental Center, the Prudential Outdoor Learning Center, and at its Main education building. Many educational programs take place at the Judith L. Shipley Urban Environmental Center. This center was named after Judith Shipley who along with her husband Walter Shipley, was a major donor to Greater Newark Conervancy. The Prudential Outdoor Learning Center is 1.5-acre site located on Prince Street in Newark and contains a series of outdoor exhibits, thematic gardens, and a small fish pond which includes turtles and frogs. It is the former site of the historic Prince Street Synagogue (aka. Congregation Oheb Shalom) and you will see evidence of the building's bustling Jewish community all over the interior and exterior of the building. This center was funded by a bequest from the Prudential Foundation, which is the charity arm of the Prudential Financial Life Insurance Company that is headquartered in Newark, NJ.\nReferences\nExternal links\n* [http://citybloom.org/ Greater Newark Conservancy] – official site"
    }
  ]
}