{
  "content": [
    {
      "type": "text",
      "text": "# Greater Sudbury Heritage Museums\n\nThe Greater Sudbury Museums are a network of four small community history museums in Greater Sudbury, Ontario, Canada. Three of the four are located on heritage properties in different neighbourhoods within the city, and the fourth is located in a library facility.\nAnderson Farm Museum\nThe Anderson Farm Museum )}} is located on a  site in Lively, on a historic dairy farm once owned by Finnish immigrants Frank Anderson and Gretta Anderson (Peltoniemi). The museum incorporates many of the original farm buildings, as well as the historic paymaster's cabin from Inco's mining facilities in Creighton, which was moved to the Anderson Farm site after the community was shut down in 1987.\nCopper Cliff Museum\nThe Copper Cliff Museum )}} on Balsam Street in Copper Cliff is housed in a log cabin on the site of the very first homestead in the community. The log cabin is not the original structure on that property, however, but was moved there in 1972. The museum is set up to depict the lifestyle of a miner's family in the area. The museum also has the baseball jacket of Thelma Jo Walmsley, a Copper Cliff native who  played on the Racine Belles' 1946 All-American Girls Professional Baseball League championship team. An Ontario Historical Plaque was erected by the province to commemorate the Mine Rescue Stations's role in Ontario's heritage.\nFlour Mill Museum\nThe Flour Mill Museum (Musée du Moulin-à-Fleur) )}} was initially located on Notre-Dame Avenue beside the Flour Mill Silos in the city's historic Flour Mill neighbourhood. It was later moved in the 1980s to its present location on St. Charles Street. The historic building was originally the home of François Varieur, the foreman of an early lumber mill in the Sudbury area. It was later acquired by the Manitoba and Ontario Flour Mill Company, to serve as the home of the community's flour mill foreman.\nThe museum was opened in 1974, and is devoted particularly to the life and history of the Franco-Ontarian community in the Flour Mill area.\nRayside-Balfour Museum\nThe Rayside-Balfour Museum),}} located in Azilda, is the smallest of the four museums. Located in the community library branch, it incorporates several small exhibits depicting historical agricultural lifestyles in the Sudbury Basin area.\nRe-Branding Project\nIn 2015 the museums' undertook a re-branding project. This involved employing a local graphic design firm ([http://www.deplume.ca/ Design de Plume]) to create and design fresh logos for each heritage site and a main logo for the Greater Sudbury Museums.\nThe inspiration for the logos stems from the idea that Greater Sudbury is a patchwork community that combines cultural aspects from the nearby settlements of the area. The re-branding was focused around this concept, as well as their motto \"cultural mosaic\", to highlight each settlement's unique history as it comes together to form the Greater City of Sudbury. The cultural mosaic concept took inspiration from the unifying quilt by Mrs. Carolyn Wahamaa, who created imagery that \"[symbolized] the harmony existing in the towns of Rayside-Balfour, Azilda and Chelmsford, as well as between Anglophone and Francophone residents, with each party maintaining its own identity\".\nOnline resources\nThe museums' website incorporates some video and photographic exhibits, as well as quite a bit of historical writing on the region and its distinct communities (in its Greater Sudbury Histories section).\nIn addition to the website, the museums provide a number of online resources, including:\n* The INCO Triangle Digital Archives: A digital version of the INCO Triangle, a monthly publication produced by the International Nickel Company for its employees between the years of 1936 and 1998.\n* Copper Cliff at War: An online exhibition about the former town of Copper Cliff from its beginnings until the end of World War II. This online exhibition was produced by the Greater Sudbury Heritage Museums through the Community Memories Program for the Virtual Museum of Canada.\n* The Greater Sudbury Historical Database: This database was produced in partnership with the Greater Sudbury Public Library. While somewhat difficult to search, this database contains thousands of photographs and references to the Main Library's large microfilm and historical vertical file collection. It is best searched with the simple keywords and multiple searches under each of the \"Title\", \"Subject\" and \"Keyword\" search options.\n* Greater Sudbury Memories: This project was designed by the Greater Sudbury Public Library as a means of assembling, preserving and sharing Greater Sudbury's oral histories. This website shows a map of the Greater Sudbury area populated with audio and video interviews that reflect times past, allowing users to interact with real stories of life in Greater Sudbury. The Greater Sudbury Heritage Museums have provided assistance towards as of yet unpublished video interviews for this project.\nAffiliations\nThe museums are affiliated with the Canadian Museums Association, the Ontario Museum Association, the Canadian Heritage Information Network and the Virtual Museum of Canada.\nReferences\nExternal links\n* [http://www.sudburymuseums.ca/index.cfm?app=w_vmuseum Greater Sudbury Heritage Museums]"
    }
  ]
}