{
  "content": [
    {
      "type": "text",
      "text": "# Great Platte River Road Archway Monument\n\n| opened_date      = July 16, 2000\n| building_type    = Archway\n}}\nThe Great Platte River Road Archway Monument (also known as The Archway or Kearney Archway) is a monument on Interstate 80 located  east of Kearney, Nebraska, United States. Originally proposed in 1997 and opened in July 2000, it houses a historical experience that tells the story of Nebraska and the Platte River Valley in the development of America. The monument spans more than  above Interstate 80 and is accessible via two numbered exits (275 and 272).\nHistory\nA monument and tourist attraction highlighting the history of the Platte River Valley was a goal of former Governor Frank B. Morrison. In 1997, $60 million in bonds were issued and purchased by investors. On July 16, 2000, the Archway opened to the public, with 223,013 and 249,174 visitors in the attraction's first two years, respectively. First-year visitors included then-President Bill Clinton. These numbers were far short of projections. The monument had to reduce expenses and refinance its bond payments in 2002, reducing the amount owed to $22 million, repaid by 2013.\nWhile a shift in focus on educational and group tours briefly presented the monument with a more stable financial footing, attendance subsequently dwindled, counting only 49,960 visitors in 2012. The archway filed for bankruptcy protection on March 7, 2013. In September 2013, Judge Thomas Saladino approved a debt plan, ordering museum organizers to pay $100,000 as a settlement for more than $20 million it owed to bondholders, creditors and vendors. Wells Fargo Bank of Minneapolis was the trustee for the bondholders.\nAs part of the resolution of the bankruptcy filing, the archway is managed by the City of Kearney. I-80 exit 275, adjacent to the archway, was completed in August 2013 directly east of the museum at a cost of about $20 million. In December 2013, the museum announced a two-month closure to re-brand itself following its debt ruling, scheduling its grand re-opening for March 1, 2014. The archway re-opened on March 1, 2014. Changes include a revamped gift shop and a new theater that shows short videos that pertain to subjects featured in the historical exhibit. Archie the Buffalo, a new mascot, was introduced. In January 2018, the archway announced that the organization earned a profit for the first time in its history in 2017.\nExhibit overview\nSince prehistoric times, the trail along the Platte River through Nebraska, which came to be known as the Great Platte River Road, has been a thoroughfare for travel across the continent. The Archway museum details the stories of the pioneers, adventurers, and innovators who have traveled the trail since the mid-1800s and helped to build America. The exhibit starts at Fort Kearny in 1848 and features sections on the Oregon Trail, California Trail, and Mormon Trail that converged at the nearby Fort Kearny before heading west. As visitors progress through the exhibit, the displays of different time periods feature a prairie schooner wagon on the Oregon Trail, a buffalo stampede, the Mormon Handcart Expedition, a 49er's campsite, the Pony Express, the Transcontinental Telegraph, a stagecoach, the Transcontinental Railroad, the first transcontinental highway, the Lincoln Highway, and today's transcontinental highway, I-80. The exhibit ends with a replica drive-in and 1950s-style cafe with windows providing views over the interstate. The exhibits are featured in chronological order and reflect the historical developments that occurred on the Great Platte River Road.\nFile:Archway (Kearney NE) - covered wagon (1).jpg|Covered wagon\nFile:Archway (Kearney NE) - covered wagon (2).jpg|Covered wagon\nFile:Archway (Kearney NE) - campers.jpg|Campers, visitors can sit with them, on the stump shown\nFile:Archway (Kearney NE) - pioneers.jpg|Pioneers\nFile:Archway (Kearney NE) - view of I-80.jpg|View of I-80 underneath museum\nFile:OregonTrail.JPG|Wagon showing the size and contents of the typical Conestoga wagon on the Oregon Trail\nIn popular culture\nThe Archway Monument was one of the locations used in the filming of About Schmidt (2002), starring Jack Nicholson.\nSee also\n* Landmarks of the Nebraska Territory\nReferences\nExternal links\n*\n* [http://www.visitnebraska.gov/component/myplanner/detail/attractions/2000410 The Archway Monument on VisitNebraska.org]\n* [https://archive.org/details/gov.uscourts.neb.148605 Federal bankruptcy court documents via archive.org]\n* [http://digitalcommons.unl.edu/cgi/viewcontent.cgi?article=3231&context=greatplainsquarterly Review Essay in the Spring 2001 Great Plains Quarterly]"
    }
  ]
}