{
  "content": [
    {
      "type": "text",
      "text": "# Great Warford\n\n| os_grid_reference       = SJ817770\n| coordinates             =\n| post_town               = KNUTSFORD\n| postcode_area           = WA\n| postcode_district       = WA16\n| post_town1              = ALDERLEY EDGE\n| postcode_area1          = SK\n| postcode_district1      = SK9\n| dial_code               = 01565\n| constituency_westminster= Tatton\n| civil_parish            = Great Warford\n| unitary_england         = Cheshire East\n| lieutenancy_england     = Cheshire\n| region                  = North West England\n| country                 = England\n| website                 =\n}}\nGreat Warford () is a village and civil parish in the unitary authority of Cheshire East and the ceremonial county of Cheshire, England.\nA predominantly farming settlement, Great Warford has existed for approximately a thousand years. Today, in addition to agriculture, it's noted for its roles in private healthcare and property development. The population stands at 1710 inhabitants. The village lacks a distinct municipal centre in terms of population density and significance. Warford Park development houses around 300 residents and boasts amenities like an on-site health/leisure club, tennis courts, the Warford Park Bowling Club, and expansive gardens, lakes, and parkland.\nAlthough Great Warford lacks direct national transport links, being without a railway or bus station, it's strategically positioned in \"The Golden Triangle\" formed by Alderley Edge, Knutsford, and Wilmslow. As such, it benefits from nearby schools, shops, restaurants, and entertainment venues. The proximity to the North West's expansive motorway network allows accessibility without compromising the village's rural charm. Other local attractions include Manchester Airport, a golf club, and numerous footpaths that appeal to tourists.\nDefining Great Warford\nGreat Warford can be defined as the area presided over by the Great Warford Parish Council. A slightly larger population can be estimated by inclusion of farmland (former or current) occupying space between the boundaries of Great Warford and neighbouring Chelford, Chorley, Marthall, Mobberley, and Nether Alderley. Area beyond this is assigned to other practising parish councils. The core area can be considered to be the area encompassing the Stag's Head public house, Warford Crescent, and Warford Hall.\nThe entirety of Great Warford is covered by the WA16 and SK9 postal areas. The local telephone area code is 01565, which it has in common with Knutsford but not nearby Alderley Edge. Welcome signs on all inroads define the Great Warford area, which belongs to the electoral district of Tatton.\nThe \"built-up\" area of Great Warford has expanded much in the last 20 years. This is due to its origins as a farming settlement and the 'greenbelt' status of the general location. The area is policed by the Cheshire Police Authority. Unlike neighbouring Little Warford, Great Warford lacks a defining village hall. This has led to contention of Great Warford's official status as a village. There has been no official review to date.\nPerhaps the site with the most historical interest is the Great Warford Baptist Chapel on Merrimans Lane.\nGeography and climate\nTopography and climate\nGreat Warford covers an area of , making it a medium-sized village. Its primary geographical feature is Mobberley Brook, an unnavigable stream which crosses the outskirts of the village from west to east. The valley that it runs through is a floodplain surrounded by gently undulating farmland such as Springfield and Pownall House Farm. These farms and other similar ones present the origins of Great Warford as an agricultural settlement. Therefore, Great Warford is of irregular shape.\nMobberley Brook is a tributary of the River Bollin. After flowing east through Chorley, it becomes the Whitehall Brook.\nBuilt environment\nMuch of the local housing is Victorian in design. Council houses built during the early 20th century were occupied by local health workers from the 1950s onward and are now owned privately as semi-detached property. A new housing estate at Buttermere Drive now occupies the site were the hospital's administrative centre once stood. Other buildings of note include:\n*Warford Hall, an old hall with a spire. Like many local buildings, it was formerly the property of the Mary Dendy Hospital.\n*Great Warford Baptist Chapel. It is reputed to have been founded in 1640 by Parliamentary soldiers.\n*Warford Park, the main centre of residences. It is a development of apartments and cottages built on the site of the former Mobberley Boys' School. The Park is home to some 300 people in 17 acres of parkland.\n*Heathgate Farmhouse, a large, striking, white detached building with a showjumping course on its land.\n*Highgrove, a listed apartment building and accompanying lodge house, formerly a rural convalescent home for Ancoats Hospital, financed by a donation from the Crossley family and land provided by the David Lewis Trust, opened in 1904.\nParks and gardens\nWarford Green (lying next to Warford Crescent) is a large stomach-shaped green area populated by several large trees. The local residents used to hold an annual bonfire and fireworks party here every Guy Fawkes Night. The bonfire would be built during the preceding months relying entirely on contributions from the locals. This practice was halted by the Parish Council in the early 1990s due to health and safety concerns regarding its proximity to Merrimans Lane and its unregulated nature in general.\nThe course at Wilmslow Golf Club (in Great Warford, despite its name) doubles as a recreational park and a woodland area, with several public footpaths traversing it.\nHistory\nEarly Great Warford\nGreat Warford is mentioned in the Domesday Book under its contemporary name of Warforde. Its entry dates from 1086 and contains a list of local families and landowners (including Ralph the Huntsman).\nRole in Norman and Medieval Cheshire\nThe village did not expand much in the Medieval and Norman periods due to its boundaries being defined agriculturally. Little Warford, Marthall, Nether Alderley, Chelford, Mobberley and Chorley (as Alderley Edge was then known) all had their own land which meant that expansion beyond the existing borders was impossible.\nRise of modern Great Warford\nGreat Warford's contribution to agriculture continued through the 20th century to the modern day. However, for the last 60 years, other industries such as leisure and healthcare have begun to dominate Great Warford's identity.\nAdministrative history\nLocal government\nGreat Warford was a township of the Alderley ancient parish in the Macclesfiled Hundred of Cheshire. Under the Poor Law Amendment Act 1876 the township of Great Warford became a civil parish in its own right. One-hundred-and-two acres were transferred to Mobberley civil parish in 1936. Between 1894 and 1974, Great Warford was part of Macclesfield Rural District. From 1974 the civil parish was served by the Borough of Macclesfield, which was succeeded on 1 April 2009 by the new unitary authority of Cheshire East.\nThe Great Warford Parish Council has few major rights and/or obligations and is responsible to higher authorities. It does, however, manage local amenities and has a watching brief on local issues, its opinion being noted by those higher authorities in matters such as local planning issues.\nParliamentary elections\nGreat Warford is part of the Parliamentary Constituency of Tatton. The incumbent representative since 2017 is Esther McVey MP.\n* Electoral districts: North Cheshire (1832–67); East Cheshire (1868–85); Knutsford (1885–1948); Macclesfield (1949–74)\nEconomy\nThe main contributor to the local economy is agriculture as several working farms still operate in the area. There are also mental healthcare operations: the Mary Dendy Hospital and the David Lewis Centre.\nDemographics\nIn the context of national statistics, Great Warford belongs to the ward of Chelford. The 2001 census portrayed the population to be\n*Males \t\t49%\n*Females \t\t51%\n*Age 0–15\t\t19%\n*Age 16–17\t\t2%\n*Age 18–24\t\t4%\n*Age 25–59\t\t46%\n*Age 60–64\t\t7%\n*Age 65–74\t\t12%\n*Age 75+\t\t11%\nEthnicity\nThe 2001 Census showed the racial breakdown to be 98% white. Of the remaining 2%, the dominant ethnic background was Asian or Asian British.\nReligion\nThe 2001 census showed:\n*Christian \t\t\t84%\n*Other major religions\t\t2%\n*Other religion\t\t\t0%\n*No Religion\t\t10%\n*Religion not stated\t\t4%\nTransport\nRail\nThere is no national railway station in Warford, the population being serviced by the stations at Alderley Edge and Chelford. The stretch of line between these two stations runs under a road bridge and past the fields at Dean Green. This excellent vantage point has been used constantly by trainspotters and railway enthusiasts to photograph trains, particularly during special runs.\nBus\nA regular bus once ran to and from Alderley Edge from the bus stop at Warford Crescent. Now, the only bus route that passes through Great Warford is the 88 service, running every 30 minutes from Knutsford to Altrincham and back, via Wilmslow.\nAir\nThe village has good access to Manchester Airport but is situated away from the main flightpath.\nRoad\nAccess to the main national road network is provided by the A535 road which runs between Alderley Edge and Holmes Chapel. The B5085 also provides direct access to Knutsford, as well as a direct route to Wilmslow bypassing Alderley Edge.\nSociety and culture\nLeisure and entertainment\nThere is one pub in Great Warford, the Frozen Mop. Wilmslow Golf Club has already been mentioned in this article. There is also an outdoor football pitch on Mill Lane which was once used by the Mary Dendy Football Team, a team originally made up of staff from the hospital which continues to play today although now open to all.\nThe Cheshire Health Club & Spa, on the Warford Park development in Faulkners Lane, offers a full gymnasium, swimming, various exercise training, personal coaches, tennis courts and much more.\nLiterature and film\nThe Cheshire County Council published The Baptist Chapel, Great Warford, a guide to the aforementioned chapel in 1989. The author, David Wright, alluded to Great Warford's history of healthcare in his 1996 publication From Idiocy to Mental Deficiency: Historical Perspectives on People with Learning Disabilities, published by Routledge.\nAn episode of the television series Who Do You Think You Are?, which follows the attempts of celebrities to trace their family history, featured David Dickinson and revealed how his Turkish grandfather, Hrant Gulessarian, lived the life of an English country gentleman with his wife Marie-Adelaide, the daughter of a Moss Side baker, in Great Warford.\nSee also\n*Listed buildings in Great Warford\nNotes\nExternal links\n*[http://www.greatwarfordpc.org.uk Great Warford Parish Website]"
    }
  ]
}