{
  "content": [
    {
      "type": "text",
      "text": "# Green building in the United Kingdom\n\nBoth the public and private sectors in the United Kingdom promote green building. Presently, there are already regulatory mechanisms in place that establish Britain's commitment to this kind of building construction. The government, for instance, set out a target that by 2016, all new homes will have zero carbon emission and it also includes a progressive tightening of energy efficiency regulations by 25 percent and 44 percent in 2010 and 2013, respectively. The UK Building Regulations set requirements for insulation levels and other aspects of sustainability in building construction.\nFor the private sector, there is the case of the Association for Environment Conscious Building (AECB), which promotes green building (or sustainable building) in the United Kingdom since 1989.\nThe UK is also bound to the European Union policy covering green buildings. Under the Energy Performance of Building Directive (EPBD), Europe has made a mandatory energy certification since 4 January 2009. A mandatory certificate called the Building Energy Rating system (BER) and a certification Energy Performance Certificate is needed by all buildings that measure more than 1,000&nbsp;m2 in all the European nations. According to the UK Green Building Council, existing buildings account for 17 percent of the UK's total carbon emissions. The Building Research Establishment Environmental Assessment Method (BREEAM), UK's first green building certification system, was established in 1990. Houses are also rated according to the standards set by the Code of Sustainable Homes, which was established in 2007. Here, homes are evaluated against a minimum standards for energy and water usage and are rated from one to six stars based on how they meet the requirements in nine different categories.\nIn Wales, advice on and access to sustainable building is available from a not-for-profit organisation called Rounded Developments Enterprises. They run a Sustainable Building Centre in Cardiff.\nExamples\nThe Beaufort Court at Hertfordshire, which hosts the RES and Inbuilt, is an example of a green building in the UK. It is a zero-emission structure built on the previous Ovaltine egg farm and features its own 225-kilowatt wind turbine and photovoltaic array, capable of 3,200 kilowatt-hours per year. There is also the case of the BowZed building in east London, which made it to The Guardian's list of top eco-building. It is a block of zero-fossil energy flats designed by eco-architect Bill Dunster. It features comprehensive insulation, eliminating the need for a central heating system. About 90 percent of its electricity is sourced from solar and wind power while a wood pellet-powered boiler provides hot water to the residents.\nThe One Angle Square building in Manchester has the distinction of earning one of the highest BREEAM scores. This structure makes use of natural resources with the passive solar gain for heating and natural ventilation through its double-skin facade. It also harvests rainwater and has sophisticated water recycling technology. Another popular green building in the UK is the Media Centres' Friendly Street building.\nSee also\n*UK Green Building Council\n*Energy efficiency in British housing\n*Hockerton Housing Project\n*Energy in the United Kingdom\n*INTEGER Millennium House\nReferences\nExternal links\n*[https://web.archive.org/web/20111128191417/http://www.breeam.org/ BREEAM (BRE Environmental Assessment Method)]\n*[http://www.greenspec.co.uk/ GreenSpec]"
    }
  ]
}