{
  "content": [
    {
      "type": "text",
      "text": "# Greenwood, Queensland\n\n| pop                 = 34\n| pop_year            =\n| pop_footnotes       =\n| established         =\n| postcode            = 4401\n| area                = 17.4\n| timezone            = AEST\n| utc                 = +10:00\n| dist1               = 13.1\n| dir1                = N\n| location1           = Oakey\n| dist2               = 40.6\n| dir2                = NW\n| location2           = Toowoomba CBD\n| dist3               = 168\n| dir3                = W\n| location3           = Brisbane\n| dist4               =\n| dir4                =\n| location4           =\n| lga                 = Toowoomba Region\n| stategov            = Condamine\n| fedgov              = Groom\n| near-n              = Silverleigh\n| near-ne             = Silverleigh\n| near-e              = Silverleigh\n| near-se             = Kelvinhaugh\n| near-s              = Kelvinhaugh\n| near-sw             = Sabine\n| near-w              = Acland\n| near-nw             = Acland\n}}\nGreenwood is a rural locality in the Toowoomba Region, Queensland, Australia. In the , Greenwood had a population of 34 people.\nGeography\nThe Oakey–Cooyar Road enters from the south-west (Sabine / Kelvinhaugh) and forms the south-west boundary of the locality before continuing north through the locality, exiting to the north (Silverleigh).\nGreenwood has the following mountains:\n* Boah Peak () rising to  above sea level\n* Turkey Hill ()\nThe land is freehold and used for agriculture, predominantly crop growing with some grazing on native vegetation.\nHistory\nA Lutheran congregation formed in 1899 and in November 1890 opened St Paul's Lutheran Church. In 1991, due to differences of opinion on religious issues, the church separated from the Lutheran Church of Australia and, in 1992, joined with a number of other like-minded Lutheran congregations to form the Australian Evangelical Lutheran Church.\nThe first Evangelical Lutheran Church in Queensland opened at Greenwood circa 1900. However, the Greenwood congregation outgrew the building so it was relocated to Yamsion to become its Evangelican Lutheran Church, where it was officially opened and dedicated on Thursday 18 May 1922.\nGreenwood Provisional School opened in June 1907. On 1 January 1909, it became Greenwood State School. It closed in 1968. It was at 1091 Oakey Cooyar Road (corner of Greenwood School Road, ).\nGreenwood Methodist Church opened on 5 April 1959 at the top of the hill on Oakey-Cooyar Road, becoming the Greenwood Uniting Church after the 1977 amalgamation which formed the Uniting Church in Australia. In 1979, the Greenwood church building was relocated to Goombungee to become the Goombungee Uniting Church, while the former Goombungee Uniting Church became the church hall. On 26 August 2012, the former Greenwood church in Goombungee was decommissioned as a church and sold into private ownership.\nDemographics\nIn the , Greenwood had a population of 40 people.\nIn the , Greenwood had a population of 34 people.\nEducation\nThere are no schools in Greenwood. The nearest government primary schools are Oakey State School in Oakey to the south and Goombungee State School in Goombungee to the north-east. The nearest government secondary school is Oakey State High School in Oakey to the south. There is also a Catholic primary school in Oakey.\nAmenities\nDespite the name, St Paul's Lutheran Church, Greenwood, is at  617 Acland Silverleigh Road in Silverleigh ().\nReferences\nFurther reading\n*  — includes Gowrie Little Plains School, Aubigny School, Crosshill School, Devon Park State School, Silverleigh State School, Boodua School, Greenwood State School, Kelvinhaugh State School"
    }
  ]
}