{
  "content": [
    {
      "type": "text",
      "text": "# Green Light (Breaking Bad)\n\n| length       = 47 minutes\n| guests       =\n*Christopher Cousins as Ted Beneke\n*Steven Michael Quezada as Steven Gomez\n*Carmen Serano as Carmen Molina\n* Michael Shamus Wiles as George Merkert\n* Jolene Purdy as Cara\n* Jeremiah Bitsui as Victor\n| prev         = I.F.T.\n| next         = Más\n| season_article = Breaking Bad season 3\n| episode_list = List of Breaking Bad episodes\n}}\n\"Green Light\" is the fourth episode of the third season of the American television drama series Breaking Bad, and the 24th overall episode of the series. Written by Sam Catlin and directed by Scott Winant, it aired on AMC in the United States and Canada on April 11, 2010.\nPlot\nAfter coming up short for gasoline and cigarettes at a gas station, Jesse Pinkman offers meth to a cashier to get out of paying. She is hesitant to accept until a police officer enters the store and queues behind Jesse for the counter, at which point she bows to the pressure and takes the meth.\nMeanwhile, Walter White makes a scene at Skyler White’s workplace while confronting Ted Beneke, and he is thrown out of the building. Immediately afterward, Mike Ehrmantraut takes Walt to Saul Goodman's office. Saul tries to convince Walt to continue producing meth, but Walt refuses the offer once he finds out they bugged his house to discover the information. After making crude remarks about Skyler's affair, Walt proceeds to tackle Saul to the ground and fire him on the spot - thus losing Saul’s help laundering money. Consequently, Walter White Jr. has noticed a sudden stop in donations for his fundraising site.\nAfter being called into her office, Walt makes a pass toward the vice principal at the school, Carmen Molina, by trying to kiss her. She rejects his advances and places him on indefinite leave. While he is leaving the school, he is intercepted by Jesse, who has produced a new batch of meth on his own. Walt rejects Jesse's product as substandard, and Jesse resolves to sell the product to Gus Fring himself, through Saul and Mike as the mediators. Gus reluctantly agrees to the purchase, anticipating that Walt's pride and financial need may convince him to accept his business proposition.\nSkyler is continuing her affair with Ted, albeit with increasing suspicion from her co-workers after Walt's outburst. After having sex at his house, she refuses to disclose what went wrong in her marriage and declines Ted's offer to move in with him.\nMeanwhile, Hank Schrader forgoes his assignment to El Paso at the last minute after receiving a brand new lead about the infamous blue meth. Steve Gomez is concerned about Hank's mental well-being; Hank dismisses these concerns. After intensely interrogating the cashier whom Jesse gave the meth to, Hank retrieves images from the ATM outside the gas station in order to persuade his boss to not resituate him to El Paso, convinced he is \"close to something big here\".\nJesse completes his first delivery to Victor, but is outraged when he only receives half of the money. Later, Walt is stopped at a red light when he hears on the radio that Donald Margolis, Jane Margolis' father, has been rushed to the hospital after a self-inflicted gunshot wound, in the wake of the air disaster that he oversaw. Victor pulls up alongside the car and gives Walter \"his half\" of the earnings for Jesse's deal, driving off just before the light turns green.\nProduction\nThe episode was written by Sam Catlin, and directed by Scott Winant, being one of the two episodes along with \"Crawl Space\" that Winant directed in the series. It aired on AMC in the United States and Canada on April 11, 2010.\nReception\nNoel Murray of The A.V. Club gave the episode a B and praised the episode's ability to uphold the series' standard of balancing \"action and inaction.\" He especially praises the depiction of Hank's struggles in the story, noting that \"it’s about how someone who represents himself as fully in charge deals with being out of his comfort zone.\"\nSeth Amitin of IGN gave the episode an 8/10, lamenting that \"Two horrible meltdowns aren't so fun to watch\" and suggesting that the series had continued to lag in quality since the Season 2 finale.\nIn 2019, The Ringer ranked \"Green Light\" 56th out of the 62 total Breaking Bad episodes. Vulture ranked it 49th overall.\nViewership\nThe episode's original broadcast was viewed by 1.46 million people, which was an increase from the 1.33 million of the previous episode, \"I.F.T.\".\nNotes\nReferences\nExternal links\n*[http://www.amctv.com/shows/breaking-bad/episodes/season-3/green-light \"Green Light\"] at the official Breaking Bad site\n*"
    }
  ]
}