{
  "content": [
    {
      "type": "text",
      "text": "# Greenfield Valley Heritage Park\n\nGreenfield Valley Heritage Park () is a  country park in the United Kingdom. It is located in Greenfield, near the town of Holywell in North Wales. It is well known for its woodland, reservoirs, ancient monuments (including the ruins of Basingwerk Abbey), rich industrial past and its factories which played a part in the Industrial Revolution.\nFactories\nA majority of the factories were built in the late 18th century. They were powered by water power which came from the Holywell Stream. Most factories had eventually closed down by the 1960s. Some factory buildings can still be seen today.\nBattery Factory\nThe Battery Works employed local people to shape pots and pans from brass sheets. Battery brass was a term for brass sheet formed by hammering, long before electricity. The power needed to do this was made by using a water wheel; the water came from the Battery Pond.\nNext to the Battery Factory are the ruins of Battery Row, where many of the employees would have lived.\nThe Battery Factory now lies next to the Battery Pond in ruins. The site is now supported by the National Welsh Heritage Lottery Fund.\nMeadow Mill\nThe Meadow Mill, built in 1787, produced rolled copper sheets for Thomas Williams's companies.\nLower Cotton Mill\nJohn Smalley of Preston, one of Sir Ricard Arkwright’s original partners, introduced cotton manufacturing to the Greenfield Valley in 1777 by constructing the three-storey Old or Yellow Cotton Mill. The location was chosen due to the stream’s reliability (rarely flooding or freezing) and consistent pace, contributing to the superior quality of the cotton thread. Smalley’s mill, built using stone taken from the ruin of the neighbouring Basingwerk Abbey, was only the second purpose-built cotton mill in the country after Arkwright’s first at Cromford.\nAfter Smalley’s death in 1782, his widow Elizabeth partnered with industrialists William and Thomas Douglas, Daniel Whittaker, a Manchester merchant, and the inventor and cotton machinery manufacturer Peter Atherton. The partnership known as Atherton and Company (later the Holywell Cotton Twist Company), led to the construction of three additional cotton mills in the valley: the Upper mill, Lower mill, and Crescent mill.\nThe Lower Cotton Mill, designed by Atherton and financed by William Harrison and John Dumbell (both later admitted as partners) was constructed in just ten weeks during the summer of 1785. It originally stood six storeys high, measuring 36 yards long by 10 yards wide, and was powered by a water-wheel 18 ft. high by 7 ft. wide, with a fall of water of sixteen feet.\nThomas Pennant marvelled at the Lower Cotton Mill, describing it as a \"most magnificent cotton works\" that seemed to rise \"as if by magic\" within ten weeks, to \"soar, like the tower of Babel, above all the lower buildings\". Renowned mill builder Robert Williams, visiting Holywell in November 1785, shared Pennant's admiration, lauding the Upper and Lower Cotton Mills as \"two of the finest Mills in England\". By January 1787, Holywell’s remarkable output had captured the attention of the British press, with The Times reporting that \"as much thread is spun in one day at Holywell, in Flintshire, as will surround the globe at the equator\".\nThe factory still stands to this day, but tourists are not allowed to enter the building.\nRemnants of the machinery used in the factory are visible outside.\nAbbey Wire Mill\nCopper and brass wire was made. Most of the factory has been destroyed and only a few features from the ruins are visible.\nBasingwerk Abbey\nThe park is home to the ruins of Basingwerk Abbey.\nOld school\nNear the visitor centre there is an old village school which was originally built near the town of Holywell but was reconstructed in the valley. Today, the school is used by visitors, in sessions developed by the museum volunteers, that can show visitors what school life was like in Victorian times.\nVisitor centre\nThe visitor centre is the entrance to a farm and museum. The centre also provides information on woodland walks, educational activities, bird watching and fishing in the area.\nNear the ruins of Basingwerk Abbey is a farm and museum which visitors can enter for a small fee. The farm consists of reconstructed local buildings, animals and activities for the children.\nReferences\n* [https://web.archive.org/web/20090224224054/http://www.greenfieldvalley.com/pages/heritagepark.htm Greenfield Valley Heritage Park Holywell Dyffryn Maes Glas]\nExternal links\n*[http://www.greenfieldvalley.com/ Greenfield Valley Heritage Park] - official site"
    }
  ]
}