{
  "content": [
    {
      "type": "text",
      "text": "# Green Meadow, Delaware\n\n|postal_code_type =\n|postal_code =\n|area_code = 302\n|blank_name = GNIS feature ID\n|blank_info = 217144\n|blank1_name =\n|blank1_info =\n|website =\n|footnotes =\n}}\nGreen Meadow, originally Greenmeadow, and also called Green Meadows, is a suburban community in New Castle County, Delaware, United States.\nGeography\nGreen Meadow is north of Shellpot Creek, 3.8 miles northeast of Wilmington in the Brandywine Hundred. It is located south of Wilson Road and east of Shipley Road and  borders Gardens of Penny Lane, Lynnfield, and Shipley Heights.\nHistory\nThe community was built by Franklin Builders, an early developer of suburbs in New Castle County with a penchant for using the word \"green\" in naming the developments, such as Green Meadow and Green Acres. It came on the market in 1954, and consisted of 47 \"ranch-type houses\". Within the first day of being open to public inspection, 16 homes were sold.\nThe homes were built with air conditioning. One of the original residents was interviewed in 1994, \"That was something new then. It was the Fourth of July and, I remember, very, very hot. This was the only sample [house] we saw that day that was air-conditioned, and they offered it in the price range we wanted,\" she said. \"There were only a couple of houses built not a tree in sight and we had to go to the post office to get our mail. But we had air conditioning.\"\nOriginally the main thoroughfare for the neighborhood was narrower than standard, which led to parking controversy. Later in the year the roads were expanded, and around 30 more houses were built in the community, bringing the total to near 80. Home mail delivery began in 1958.\nIn 1958, Chapman Construction added additional houses to the development, called \"Meadowbrook.\" The area of new houses was called \"Greenmeadow II.\"\nIn August 1964, The Morning News mistakenly called Green Meadow the home of Joe Biden, the 46th president of the United States.\nIn July 1989, Shellpot Creek overflowed and surged up to the nearest homes in Green Meadow. \"It came right up to here,\" a resident said. \"We were lucky it wasn't worse, but I can tell you it made us reform. We have flood insurance now. Don't let the way it looks now fool you. Any time we get rain, the water rushes right down here. It's not unusual for the creek to come 10 feet over its bank.\"\nIn 1991, the Gardens of Penny Lane, a new community of larger and more modern homes, was connected to Green Meadow.\nReferences\nExternal links\n*"
    }
  ]
}