{
  "content": [
    {
      "type": "text",
      "text": "# Greensward Academy\n\n| motto                   = \"Find Your Remarkable\"\n| established             =\n| closed                  =\n| type                    = Secondary comprehensive\n| religious_affiliation   =\n| president               =\n| head_label              = Principal\n| head                    = Katie Scarnell\n| r_head_label            =\n| r_head                  =\n| chair_label             =\n| chair                   = Robert Turner\n| founder                 =\n| trust                   = Lift Schools\n| specialist              = Academy\n| address                 = Greensward Lane\n| city                    = London\n| county                  = Essex\n| country                 = England\n| postcode                = SS5 5HG\n| local_authority         =\n| ofsted                  = yes\n| urn                     = 135652\n| staff                   =\n| enrolment               = 1465\n| gender                  = Coeducational\n| lower_age               = 11\n| upper_age               = 18\n| houses                  =\n| colours                 =\n| publication             =\n| free_label_1            =\n| free_1                  =\n| free_label_2            =\n| free_2                  =\n| free_label_3            =\n| free_3                  =\n| website                 = http://www.greenswardacademy.org\n}}\nGreensward Academy is a comprehensive school and academy for 11- to 18-year-olds, located in Hockley, Essex.\nGreensward has approximately 200 staff and 1450 students, including 260 in the sixth form. Its main feeder schools are Plumberow Primary School, Hockley Primary School, Westerings Primary School and Ashingdon Primary Academy, and also takes students from various other schools in the area.\nThe 2011 inspection report states that \"The academy has specialisms in science and applied learning and also has Leading Edge and Training School Status\".\nHistory\nThe school opened in 1960 as the Hockley County Secondary School, with pupils from both Hockley, Hullbridge and Ashingdon primary schools who were selected for the first year and a second year of Hockley pupils who previously went to Rayleigh Secondary. It became Greensward School in 1967, and then Greensward College in the late 1990s; the school kept this name until 2008 when it achieved Academy status. Greensward Academy is the lead academy of the Academies Enterprise Trust, a multi-academy sponsor.\nBuildings\nIn 2011, £15 million was awarded to the Academy in order to perform major construction work, including 2 new blocks, and refurbishment of several other blocks. The Sixth Form occupies a purpose-built block. The building has two classrooms, a computer suite and a café.\nOfsted judgements\n* In 2011 the school was judged Outstanding by Ofsted.\n* As of 2021, the school's most recent inspection was a short inspection in 2018, with a judgement of Good.\nSee also\n*Secondary schools in Essex\nReferences"
    }
  ]
}