{
  "content": [
    {
      "type": "text",
      "text": "# Gregorio (software)\n\n| latest preview version            =\n| latest preview date               =\n| repo                              =\n| operating system                  = Windows, Linux, MacOS\n| genre                             = Music software\n| license                           = GPLv3\n| website                           =\n}}\nGregorio is a free and open-source scorewriter computer program especially for Gregorian chant in square notation. Gregorio was adopted by many abbeys and large projects.\nArchitecture\nGregorio is not a completely independent program, but consists mainly of three components: The gabc syntax for writing Gregorian scores, a TeX package named GregorioTeX, which is responsible for the graphical output and a converter tool between those two. As such, Gregorio is included in TeX Live 2016.\nCharacteristics\nGregorio is written especially for Gregorian chant in square notation and does not cover modern European musical notation. Similar to LilyPond it does not provide a graphical user interface. The notation is done via simple text input. It follows the gabc-syntax, which is defined by the Gregorio Project for this purpose. The gregorio command line tool converts this gabc-file to a GregorioTeX file, which has to be included in a common TeX file. Such a file is necessary for a graphical output, e.g., in the PDF-format.\nHistory\nOrigins\nAlthough many English sources summarize the project as a 2006 student effort at Télécom Bretagne, its inception traces back to 2004 at the Abbey of Sainte-Madeleine du Barroux. There, Br. Toussaint Menut (then a monk of that abbey) initiated the idea of moving beyond simple chant fonts and manual positioning to a system integrating text and neumes, producing full typographic output. A parallel typographic project, the OpenType font Gregoria, and a markup-based input syntax were conceived at the same time.\nIn the 2005–2006 academic year, Yannis Haralambous (Télécom Bretagne) proposed Gregorio as a student project; Élie Roux became the principal developer and continued the software under the GPL after the initial six-month phase. The project’s own documentation notes that one of its earliest design texts on the structure of Gregorian notation was written by a monk of the Abbey of Le Barroux, confirming that abbey’s contribution to Gregorio’s conceptual groundwork.\nThe commonly cited summary that “the Gregorio project started in 2006 at Télécom Bretagne” remains accurate for the software’s student-project phase, but the conceptual and typographic origin dates to 2004 at Le Barroux, with Menut’s initial work and collaborations that led to Gregoria and, subsequently, to the gabc notation and GregorioTeX.\nAt first, the goal of the project was just to provide the Benedictine Abbey Sainte Madeleine in Le Barroux a graphical interface for the usage of a Gregorian font. Due to license issues, the project decided later to make and use its own font. At the end of 2006, a new developer, Olivier Berten, joined the project and created its OpusTeX component. OpusTeX was a LaTeX package with a similar goal like Gregorio but is now unmaintained and deprecated. During a three-month internship, starting in April 2008, at the Monastero di San Benedetto, in Norcia (Italy), Gregorio made considerable progress and its own output named GregorioTeX started to be usable.\nIn following years Gregorio gained stability and popularity, strongly supported by the migration to GitHub in June 2014. Making contributions got much easier, therefore the development progress became faster. New features like the adiastematic Saint Gall notation through nabc were implemented. Gregorio was adopted by many abbeys and large projects. The most prominent user may be the St. Peters's Abbey of Solesmes.\nIn 2016 Gregorio should be integrated into TeX Live, which would make the installation process even more easy.\nExample of Gregorio input files\nFor producing a score in the PDF format it is suitable to use two separate files&nbsp;— one gabc file and one TeX file. The musical notation is done in the gabc-file with the related gabc syntax. The TeX file could look like this (with the gabc-file named \"kyrie.gabc\" in the same directory):\nSourcecode\n\\documentclass[12pt, a5paper]{article}\n\\usepackage{fullpage}\n\\usepackage{fontspec}\n\\usepackage{libertine}\n\\usepackage[autocompile]{gregoriotex}\n\\begin{document}\n\\gregorioscore{kyrie}\n\\end{document}\nA small gabc-file looks like this:\nname:Kyrie XVII;\n%%\n(c4)KY(f)ri(gfg)e(h.) *() e(ixjvIH'GhvF'E)lé(ghg')i(g)son.(f.) bis(::)\nThe first lines contain metainformation such as the name of the chant, the appropriate place in the liturgy of the mass or the Liturgy of the Hours, the original source or the copyright of the score. Sung text and notes are not, as in Lilypond syntax, separated, but the notes are written in parentheses right after the corresponding syllable. A short overview of the syntax is provided by a cheat sheet. If both the TeX and the gabc file are in the same directory, one has just to compile the tex-file with lualatex --shell-escape kyrie.tex.\nReception and usage\nGregorio is the leading program on its area and widely used. It is considered to be the main specialist on the field of music engraving software.\nThe Church Music Association of America offered introductions to Gregorio on their annual conference. Gregorio was compared in a scientific article in 2014.\nOther notable users are:\n* Illuminare Publications, a series of liturgical and sacred music resources in order to help parishes to enhance their liturgical music according to Liturgiam authenticam. This includes a \"Missal\" and a \"Simple Gradual\"\"\n* The Church Music Association of America in different big projects, e.g. the \"Simple English Propers\", the \"Parish Book of Psalms\", the \"Psalm-Tone Lenten Tracts\"\n* Hymnarium OP, a Hymnary of the Dominicans of the Province of St. Joseph (USA)\n* the Abbey of Solesmes for future publications\n* the Monastery at Norcia, e.g. for a booklet of table blessings\n* the Mater Ecclesiae Abbey and the Praglia Abbey for the new \"Antiphonale Monasticum\" based on Fuglister's B-scheme (2 volumes in total), completely made with Gregorio and LuaLaTeX\n* \"Liturgia Horarum in cantu gregoriano\", a publication of the complete Liturgy of the Hours, and \"Ad Completorium\", a printed excerpt of it, i.e. the compline for all days\n* and several other, smaller projects\nRelated projects\nOther projects build and extend on Gregorio, for instance to make the usage more user friendly:\n* GregoBase, an extensive database of Gregorian scores, including nearly the entire Graduale Romanum and the Liber Usualis\n* Online tools, like online editors, Web interfaces or gabc-code generators for psalms, readings or hymns\n* Syntax highlighting for the gabc-syntax for different editors (amongst others Vim, Emacs, gedit, Notepad++)\nReferences\nExternal links\n* [https://gregorio-project.github.io/ Official website of Gregorio]\n* [http://gregobase.selapa.net/ GregoBase], a score database\n* [http://apps.illuminarepublications.com/gregorio/ Illuminare Score Editor], online editor for Gregorio\n* [https://bbloomf.github.io/jgabc/faq.html GABC-Code-Generators], online tools for easy generation of gabc-files from Benjamin Bloomfield\n* [https://notatioantiqua.sourceforge.net/index.html Notatio Antiqua], an editor for Gregorio\n*"
    }
  ]
}