{
  "content": [
    {
      "type": "text",
      "text": "# Gresham cat hostage taking incident\n\nThe Gresham cat hostage taking incident occurred on August 21, 1994, and involved an emotionally disturbed 28-year-old woman named Janet Marilyn Smith, who took her own pet Siamese cat hostage in the Fred Meyer store at 2497 East Burnside Road in Gresham, Oregon, United States.\nSmith was subsequently fatally shot by a Gresham Police officer after she approached officers while brandishing a kitchen knife. The cat could not be found immediately after the incident but was later located hiding somewhere in the store. It was the first fatal shooting by Gresham police since the January 4, 1984, shooting of Mark R. Stomps after reports that he was on drugs, had a gun and was threatening to commit suicide.\nBackground\nSmith's personal background\nJanet Marilyn Smith was born on June 9, 1966, and moved to Portland, Oregon, with her family in 1973 from Loleta, California, around 15 miles south of Eureka. She was a member of the Yurok American Indian tribe, and attended Lincoln High School in Portland but dropped out during her sophomore year; she was also employed at various retail sales jobs around Portland, including a Fred Meyer store in North Portland.\nShe and her grandmother, Mary A. Smith, had recently moved from Portland to an apartment in Gresham to \"find a quieter, safer life,\" but police were called to the Smiths' apartment three times in the previous two months before her shooting. Sgt. David B. Lerwick, spokesman for the Gresham Police Department stated he did not know the reason for the visits. Prior to the incident, Smith used to chat about flower pots and gardens with her apartment manager, Gail Geer.\nSmith's mental health and behaviour\nSmith had been diagnosed with schizophrenia at age 17 in early 1984 and had been on antipsychotic medications ever since. Her family said she was being stalked by a former boyfriend and was becoming increasingly fearful and paranoid. During the week prior to the shooting, she had called some friends and family members asking them for help. She had also complained that changes to her medication were causing her problems, although following the incident her family declined to discuss the medications Smith had been taking for her mental illness during the past ten years.\nShe was seen multiple times at the emergency department of Providence Medical Center in the days before the shooting and had been hospitalized some months earlier.\nSmith had apparently been seen at the Fred Meyer store twice the day before the shooting, with cashier Kori S. Ludahl quoted as saying  \"She was in here twice yesterday.\" Smith reportedly claimed that she was \"a diabetic\", and that her grandmother \"was a Satan worshipper\".\nIncident\nPrelude\nOn Sunday, August 21, 1994, before walking to the Fred Meyer store, Smith stood outside her apartment building screaming for help. However, when approached by a neighbor attempting to help her, she told him to get away. Smith then walked to the Fred Meyer store, arriving shortly before 1 p.m. with her pet Siamese cat named \"Blue\" in her arms, also holding a kitchen carving knife with a six inch blade that tapered to a point. \"Blue\" was noted to be meowing loudly while being held by Smith.\nSmith said she was thirsty, went down aisle 7 and took a can of President's Choice brand lemon lime soda which she drank while smoking a cigarette. She requested someone to call police for her, because she claimed that she was being followed. Cheryl Perrin, a spokeswoman for Fred Meyer said that Smith was in the grocery aisle just one aisle over.\nA witness, Mary Bradley, said that Smith began frantically yelling \"Please help me! Call the police!\", while apparently there wasn't any panic by store patrons, with one witness initially thinking Smith's behavior was a prank.\nSmith then sat down with her back against the soda cooler, still holding the knife and the cat. According to cashier Mandy Kerr, Smith said \"she didn't want to do any harm\". Initially store managers talked to Smith before calling the police, and blockaded the aisle at either end with shopping carts and moved bystanders away.\nPolice intervention, subsequent shooting and immediate aftermath\nFive Gresham police officers arrived at about 1:10&nbsp;p.m. Sgt. David Lerwick reported that three police officers positioned themselves on the far end of the aisle and another two took position at the front end. When officers asked her to drop the knife, Smith threatened to kill her cat. \"The officers had asked her to put the knife down, and she would not,\" Lerwick said.\nAs Smith stood up, the cat got loose and ran away. She began walking down the aisle towards the back of the store. Police sprayed her in the face with three cans of pepper mace in an attempt to stop her.\nSmith cried out and then raised the knife above her head and charged at the police. She was then shot twice  by police officer Ron Willis (who had been a member of the Gresham Police Department since 1987) and was pronounced dead at the scene.\nAn autopsy determined she died from blood loss due to gunshot wounds to the chest.\nThe family first learned of the shooting by seeing a news report about it on television. Her grandmother Mary Smith said that she \"called around everywhere. I wanted to go see her. I thought she was hurt.\" She called the Gresham police, but was initially told they had no information regarding Smith. Mary Smith then began to fear that her granddaughter was dead.\nAftermath\nPublic's reaction and the police department's response\nThe public reacted angrily to the shooting of Janet Smith with much criticism, indignation and hostility directed at the Gresham Police department. Most people felt the incident was improperly handled and could have been avoided. Department spokesman Sgt. David Lerwick justified the shooting, saying they \"had no choice\" and that \"the knife was a deadly weapon. It could kill.\"\nHis other justifications included the possibility of the officer missing his target and being attacked by Smith. “Your target is normally the center of mass,\" Lerwick said. \"You want to make sure when you fire your weapon the bullet strikes its intended target. On a person, that's the torso,\" Lerwick also said. He also refused to reveal the name of the officer who shot Smith until two days following the incident.\nSeveral Gresham police officers felt wronged and even angered by the public reaction to Smith's death saying that the officer who shot Smith did what he was \"trained to do\". Smith's grandmother, Mary Smith, was interviewed by The Oregonian  about the incident and said \"I don't know why they had to shoot her. She wouldn't harm a fly.\"\nThe officer was described as an \"experienced member of the force.\" He was put on administrative leave while the Multnomah County District Attorney's office investigated the shooting. Paul Poitras, president of the Gresham Police Officers Association, explained the Gresham police reacted because Smith was \"threatening the public.\"\nInvestigation and witnesses and resultant court proceeding\nAn internal investigation was to be conducted and a grand jury was to hear testimony. Witnesses to the shooting questioned whether or not the police acted properly. \"They Maced her first,\" said Ken Williams, an operating engineer. \"You cannot see when you are Maced. So where's the threat?\"\nPublic mourning and opinion\nAfter a private funeral, Janet Smith was laid to rest at Skyline Memorial Gardens in Portland.\nIn October 1994, 60 men and women (including nurses, social workers, friends and kin of the mentally ill) came to point out the needs of the mentally ill, to mourn and to protest the recently announced closing of Dammasch State Hospital which closed permanently in 1995.\nOne protester, Harold H. Kulm, carried a placard with a large picture of Smith with the sign asking \"Where were the beds?\" and said that the shooting would have been prevented \"if the victims had been in Dammasch or receiving care at a qualified mental center.\"\nFate of the cat\nThere was also much public concern over the fate of her cat. The incident attracted international calls in the immediate aftermath of the shooting.\nGall Geer, the manager of Smith's apartment building, received several calls from people inquiring about the cat's well-being. She was off-put by the apparent concern for the cat over the death of Smith, saying: \"I was so concerned about her. I was trying to rationalize the whole thing. Then you have people call you out of the blue and ask about the cat ... It just kind of throw you a little. It kind of shows you the way the world is getting.\"\nSgt David Lerwick himself said that the calls were \"bizarre\". After reading an inquiry from a London newspaper, Sgt. David Lerwick remarked: \"Who cares about the cat? You've got some woman who lost her life\" and added that there were \"... witnesses and sworn officers, who, I'm sure are traumatized. I don't understand why the cat.\" Lerwick comments were met with sympathy by cat owners.\nInquiries also demonstrated sympathy for both Smith and for the cat, as stated by the Oregon Veterinary Specility Clinic dog and cat internist Doctor Robert Franklin who argued that \"worrying about the woman at this point ... What good is that gonna do? She's dead. The cat still alive.\" He also mentioned that the outpouring of public concern was due that many people consider cats as part of their family. \"So when you see something like this ... they worry whether the cat will be taken care of.\"\nFred Meyer spokeswoman Cheryl Perrin declared that \"I think that's human nature to be concerned,\" and mentioning her children and other people were curious about the cat's well-being. While the cat still wasn't located during the immediate aftermath of the shooting, another Siamese cat owner surnamed Anna, offered to take care of the cat if no one claimed it, while also expressing sympathy for Smith's and lamenting her death.\n\"Blue\" slipped away from Smith's arm during the shooting and went into hiding in the store and animal control officers were called, but they couldn't find the cat immediately after the shooting. \"Blue\" hid until 5:30 a.m. where he was rescued by Cheryl Perrin and employees, who overheard it meowing.\n\"Blue\" was later returned to Smith's relatives after her grandmother called and asked if they had found the cat, where it was turned to her. They gathered at her grandmother's apartment on August 22, the day after the shooting. The Siamese cat was sleeping in a box in the living room, which was described as \"dimly lit\".\nAccounts confusion\nSeargeant Lerwick version of the events\nLater, police changed their versions of the story on a Wednesday: There were no shopping carts at both ends of the aisle when the five police officers confronted Smith. Instead, Fred Meyer employees moved the carts and blocked the aisle after the officers went into the aisle to talk to Smith.\nLerwick himself said that there were inaccuracies in the version of events released to the public because \"he failed to ask investigators the right questions\". He also said he made the assumptions based on his experience and observations after the shooting, not from interviews with witnesses or officers involved. “It's my fault, and I take all the responsibility,” Lerwick later said. He also said that the detectives investigating the incident didn't correct some of the details because \"they didn't expect them to be controversial.\"\nLerwick also said \"he didn't know why police went around the carts and entered the aisle before calling mental health professionals or trained negotiators.\" He also said that a store manager told him the employees moved the carts, but Lerwick said he failed to ask when the carts were moved, thinking they were put into place before police arrived. A detective investigating the shooting later confirmed the information.\nLerwick told he first got some of his information from the detective the Sunday afternoon. Lerwick said he didn't talk to the officers involved until the Wednesday to \"spare them reliving the event.\" The officers also were told not to read newspapers or listen to radio or TV broadcasts, because they would might influence their testimony to the grand jury who investigated the case.\nLerwick's point of view on Ron Willis\nAccording to two police officers accounts of the incident, they said that:\nThe police was dispatched to the store at 1:11&nbsp;p.m. and four officers and a sergeant arrived two minutes later and saw Smith sitting 10 feet in front of the checkout counters down Aisle 6. As she held Blue and a knife, a police officer believed she was threatening to kill the cat; but the others have since said she wasn't threatening the cat.\nThey later told that one officer went to the back of the aisle while four others positioned themselves at the front. Earlier accounts said that two officers were at the front and three at the back. One officer went over to Smith and knelt to talk to her. She then got up, walked away from the officer, and headed toward the back of the aisle.\nThe four officers followed her, one walking by her side including officer Ron Willis behind her, and the other two somewhere behind Willis. As Smith approached the officer near the back of the aisle, and two unnamed officers at Smith's side and Willis sprayed her with pepper mace in an attempt to subdue her, but failed. Smith then charged at Willis, who shot her twice in the chest when she was 5 feet in front of him.\n\"What do you do when you know you're trapped, when you can't turn and run?\" asked Lerwick after saying that he didn't know whether Willis backed up before firing his gun, but said they were all in the back half of the aisle.\nOfficer Ron Willis cleared\nGrand jury result\nIn late August 1994, the Multnomah County grand jury declined to indict Officer Ron Willis on criminal charges for the shooting of Janet Smith.\nThe grand jury spent only five minutes deliberating and voted 7–0 to clear Officer Ron Willis of the charge of criminal homicide arising from the Smith's shooting. The decision ended with the district attorney's investigation. \"The grand jury reviewed the actions of everybody and decided that there's no basis upon which to bring criminal charges against anyone,\" senior deputy district attorney James J. McIntyre said.\nHowever, had Smith lived she would have faced criminal charges: of threatening an employee who tried to prevent her from entering the store. When the employee blocked her entrance, Smith allegedly threatened him with her knife.\nThe grand jury had 17 witnesses, of which 12 were shoppers or store employees who saw the shooting. The others were police officers or detectives. McIntyre didn't reveal the testimony, but he said nearly everyone was consistent in their descriptions of what occurred. Commenting on the situation that Smith got up and began walking towards the officers, McIntyre said that \"they couldn't have her that close to the police officer or let her get to the customers.\" According to reports McIntyre collected, Smith's speed was \"anywhere from a lunge to a bent-over run\".\nIt was later revealed that officer Willis wore a bulletproof jacket, but McIntyre noted that a knife could puncture it.\nPossible motives\nSmith's boyfriend trauma theory\nSmith's cousin, Sheryl Matilton, of St. Helens, believed her cousin went to Fred Meyer to get help from police because Smith was once rescued when she was locked inside a house by her former boyfriend and was taken to the Providence Medical Center. \"Maybe that's why she wanted attention,\" she said. \"They’d rescued her from a bad situation, probably basically that's what she wanted this time.\"\nSee also\n*List of killings by law enforcement officers in the United States prior to 2009\n*List of individual cats\nReferences"
    }
  ]
}