{
  "content": [
    {
      "type": "text",
      "text": "# Greyhound racing in the United Kingdom\n\nGreyhound racing is a sport in the United Kingdom. The industry uses a parimutuel betting tote system with on-course and off-course betting available. Attendances have declined in recent years, primarily due to the decrease in evening fixtures with the majority of fixtures being held in the daytime due to betting shop demands.\nAttendances peaked in 1946 at around 70 million and totalisator turnover reaching £196,431,430. As of January 2025, there are 19 licensed stadiums in the United Kingdom (excluding Northern Ireland) and just one independent stadium (unaffiliated to a governing body).\nHistory\nposter advertising the opening of Perry Barr Greyhound Stadium in Birmingham, in April 1928]]\nModern greyhound racing evolved from a form of hunting called coursing, in which a dog runs after a live game animal – usually a rabbit or hare. The first official coursing meeting was held in 1776 at Swaffham, Norfolk. The rules of the Swaffham Coursing Society, started by Lord Orford, specified that only two greyhounds were to course a single hare.\nCoursing by proxy with an artificial lure was introduced at Hendon, on September 11, 1876. Six dogs raced over a 400-yard straight course, chasing an artificial hare. This was the first attempt to introduce mechanical racing to the UK; however it did not catch on at the time.\nThe oval track and mechanical hare were introduced to Britain in 1926, by Charles Munn, an American, in association with Major Lyne-Dixson, a key figure in coursing. Finding other supporters proved to be rather difficult, and with the General Strike of 1926 looming, the two men scoured the country to find others who would join them. Eventually they met Brigadier-General Critchley, who in turn introduced them to Sir William Gentle. Between them they raised £22,000 and launched the Greyhound Racing Association. On 24 July 1926, in front of 1,700 spectators, the first modern greyhound race in Great Britain took place at Belle Vue Stadium, where seven greyhounds raced round an oval circuit to catch an electric artificial hare. They then hurried to open tracks in London at White City and Harringay.\nThe first three years of racing were financially successful, with attendances of 5.5 million in 1927, 13.7 million in 1928 and 16 million in 1929. Since the mid-1960s, the sport has gradually declined, primarily because betting shops opened from 1 May 1961. From 1961 to 1969 there were 21 National Greyhound Racing Club (NGRC) registered track closures and many independent (unaffiliated to a governing body) track closures. Further factors included the creation of the National Lottery and the increase of social activities made available to the general public. There were 91 NGRC track closures alone recorded from 1960 to 2010.\nIn February 2025, a ban on greyhound racing for animal welfare reasons was announced in Wales, which will be enforced sometime in the near future.\nRacing\nThe greyhound racing industry in Great Britain currently falls under two sectors: that registered by the Greyhound Board of Great Britain (GBGB), and a sector known as 'independent racing' or 'flapping' which is unaffiliated with a governing body.\nRegistered racing\nthumb\nRegistered racing in Great Britain is regulated by the Greyhound Board of Great Britain (GBGB), formerly the NGRC, and has been UKAS accredited since 2010. All in the registered sector are subject to the GBGB Rules of Racing  and the Directions of the Stewards, who set the standards for greyhound welfare and racing integrity, from racecourse facilities and trainers' kennels to retirement of greyhounds. There are Stewards' inquiries, and then disciplinary action is taken against anyone found failing to comply.\nThe registered sector consists of 19 racecourses and approximately 880 trainers, 4,000 kennel staff and 860 racecourse officials. Greyhound owners number 15,000, with approximately 7,000–8,000 greyhounds registered annually for racing.\nIndependent racing\nIndependent racing, also known as 'flapping', is held on just one racecourse. There is no requirement for central registration or licensing, and no code of practice. In England, standards for welfare and integrity are set by local government, but there is no governing or other regulatory body.\nStadiums\nIn the 1940s, there were seventy-seven licensed tracks and over two hundred independent tracks in the United Kingdom, of which thirty-three were in London.\nRegistered stadiums\nNottingham Stadium\nTowcester Stadium\nSheffield Stadium\nThere are 19 active Greyhound Board of Great Britain (GBGB) registered stadiums in the United Kingdom. There are no active GBGB tracks in Scotland and just one in Wales. Northern Irish tracks do not come under the control of the GBGB.\n* Brighton and Hove Stadium, Brighton and Hove\n* Central Park Stadium, Sittingbourne\n* Doncaster Stadium, Doncaster\n* Dunstall Park Greyhound Stadium, Wolverhampton\n* Harlow Stadium, Harlow\n* Kinsley Stadium, Kinsley\n* Monmore Green Stadium, Wolverhampton\n* Newcastle Stadium, Newcastle upon Tyne\n* Nottingham Stadium, Nottingham\n* Oxford Stadium, Oxford\n* Owlerton Stadium, Sheffield\n* Pelaw Grange, Chester-le-Street\n* Romford Stadium, London\n* Suffolk Downs, Mildenhall, Suffolk\n* Sunderland Stadium, Sunderland\n* Swindon Stadium, Swindon\n* Towcester Stadium, Towcester\n* Valley Stadium, Ystrad Mynach, Wales\n* Yarmouth Stadium, Great Yarmouth\nIndependent stadiums\nThere is just one active independent stadium:\n* Thornton Stadium, Thornton, Scotland\nCompetitions\nThere are various types and levels of competitions in Britain, with prize money reaching £15,737,122.\nGreyhound Derby\nThe English Greyhound Derby currently has a winner's prize of £175,000. The competition (held at Towcester) has six rounds and attracts around 180 entries each year. In addition, the Irish Greyhound Derby, held at Shelbourne Park, is open to British greyhounds. There used to be a Scottish Greyhound Derby and Welsh Greyhound Derby but the events finished in 2019 and 1977 respectively. In 2010, a short lived Northern Irish Derby was introduced.\nCategory One Race\nThese races must have minimum prize money of £12,500. They can be run between one and four rounds but must be completed within a 15-day period, except for special circumstances. In any event the competition must be completed within 18 days. Category One races replaced competitions called classic races in the 1990s.\nCategory Two Race\nThese races must have minimum prize money of £5,000. They can be run with one, two or three rounds but must be completed within a 15-day period.\nCategory Three Race\nThese races must have minimum prize money of £1,000. They can be run over one or two rounds and within a nine-day period. A category three race can be staged over one day but must have minimum prize money of £500.\nInvitation Race\nA special type of open race usually staged by the promoter in support on the night of other opens. This will be proposed to the committee by the Greyhound Board or by a promoter, with the racers being invited into the competition rather than the usual process. The minimum prize money for these races is £750.\nMinor Open Race\nThis is any other open race. The minimum added money for these races is £150.\nRecords\nIn 1986, Ballyregan Bob beat the record for the most number of consecutive races won by winning his 32nd race, besting the record set by Joe Dump in the United States in 1978 and 1979.\nGraded racing\nThis is any other race staged at a track, and prize money is varied. This kind of racing is the core of most stadiums and some of the racing can be viewed in betting shops on the Bookmakers Afternoon Greyhound Service (BAGS). The Racing Manager selects the greyhounds based on ability and organises them into traps (called seeding) and classes (usually 1–9) with grade 1 being the best class. The sex and weight of the greyhound has no bearing.\n* A class represent standard races\n* B class represent standard races+\n* D class represent sprint races\n* S class represent staying races\n* M class represent marathon races\n* P class represent puppy races\n* H class represent hurdle races\n* Hcp class represents handicap races\n+ Only used if a track has an alternative standard distance.\nRacing jacket colours and starting traps\nGreyhound racing in Britain has a standard colour scheme. The starting traps (equipment that the greyhound starts a race in) determines the colour. Races with eight greyhounds are no longer held.\n* Trap 1 = Red with White numeral\n* Trap 2 = Blue with White numeral\n* Trap 3 = White with Black numeral\n* Trap 4 = Black with White numeral\n* Trap 5 = Orange with Black numeral\n* Trap 6 = Black & White Stripes with Red numeral\n* Trap 7 = Green with Red numeral (no longer used)\n* Trap 8 = Yellow and Black with White numeral (no longer used)\nA racing jacket worn by a reserve bears an additional letter 'R' prominently on each side.\nTypes of hare system\n* Swaffham - windsock on metal plate that runs in a groove on a metal rail at ground level, 2 versions outside/inside of track.\n* Sumner - soft toy hare on a small arm attached to a 30&nbsp;cm (approx) raised rail), 2 versions outside/inside of track.\n* Bramich - soft toy hare (suspended) on a long arm attached to a raised rail, 2 versions outside/inside of track.\nRacing greyhounds and welfare\nTreatment of racing greyhounds\nGreyhound racing at registered stadiums in Great Britain is regulated by the Greyhound Board of Great Britain (GBGB). Greyhounds are not kept at the tracks and are instead housed in the kennels of trainers and transported to the tracks to race. Licensed kennels have to fall within specific guidelines and rules and are checked by officials to make sure the treatment of racing greyhounds is within the rules. In 2018, licensing and inspecting trainer's kennels was conducted through the government-approved, UKAS accredited method.\nGreyhounds require microchipping, annual vaccinations against distemper, infectious canine hepatitis, parvovirus, leptospirosis, a vaccination to minimize outbreaks of diseases such as kennel cough and a retirement bond before being allowed to race. All tracks are required to have veterinary room facilities on site. When a greyhound is due to race or trial at a track its health and condition must be checked by the veterinary surgeon at kennelling time and again before they are permitted to race, the weight must be recorded by officials and random drugs tests are conducted. From 1 April 2023, all vehicles transporting racing greyhounds must have air-conditioning.\nRetirement\nWhen the greyhounds finish their racing careers they are retired under the GBGB bond scheme (introduced in 2020) which ensures the homing costs are met. Owners may keep the dog for breeding or as pets, or they can send them to greyhound adoption groups. The Greyhound Board of Great Britain (GBGB) have introduced measures to locate where racing greyhounds reside after they have retired from racing and from 2017 the retirement data has been available to the public. Concern among welfare groups is the well-being of some racing greyhounds who are not adopted upon their retirement, and that they may subsequently be put down or sold by their owners, some others are put down because they are not suitable for retirement. The GBGB require all owners to sign a retirement form indicating the retirement plans.\nThe main greyhound adoption organisation in Britain is the Greyhound Trust (GT). The GT is a charity but is partly funded by the British Greyhound Racing Fund (BGRF), who gave funding of £1,400,000 in 2015 and rehomed 4,000 greyhounds in 2016. In recent years the racing industry has made significant progress in establishing programmes for the adoption of retired racers. Many race tracks have established their own adoption programmes in addition to actively cooperating with private adoption groups throughout the country.\nThere are also many independent organisations which find homes for retired Greyhounds. Several independent rescue and homing groups receive some funding from the industry but mainly rely on public donations. In 2016, 1,500 greyhounds were rehomed by independent groups. In 2018, several tracks introduced a scheme whereby every greyhound is found a home by the track, these include Kinsley and Doncaster. During 2020 many homing organisations including the Lincolnshire, Suffolk and Portsmouth Greyhound Trusts reported that all retired greyhounds were being homed and that there was a shortage. Concerns were raised that if the shortage of retired greyhounds continued it could force some homing organisations to close.\nInjuries\nThe most recent independently verified published figures show that the 2021 injury rate was 1.23% which equated to 4,442 from 359,083 runs. The most common injury was a hind limb muscle at 1,012 (0.28%), this was followed by foot injuries 876 (0.24%), hock 811 (0.23%), wrist 752 (0.21%), fore limb muscle 414 (0.12%), fore long bone 106 (0.03%) and hind long bone 26 (0.01%), other equated to 425 (0.12%). Track fatalities were 120 (0.03%).\nDrug testing\nThe Greyhound Board of Great Britain (GBGB) actively works to prevent the spread of drug usage within the registered greyhound racing sector. Attempts are made to recover urine samples from all six greyhounds in a race. Greyhounds from which samples can not be obtained for a certain number of consecutive races are subject to being ruled off the track. If a positive sample is found, violators are subject to penalties and loss of their racing licenses by the Greyhound Board of Great Britain (GBGB). The trainer of the greyhound is at all times the \"absolute insurer\" of the condition of the animal. The trainer is responsible for any positive test regardless of how the banned substance has entered the greyhound's system. Due to the increased practice of random testing, the number of positive samples has decreased.\nOver a one-year period from 2017 to 2018, over 15,000 greyhounds were tested by the GBGB 'flying squad' which returned four positive cocaine tests. These cases resulted in disqualification or suspension for the offending parties.\nSee also\n* History of gambling in the United Kingdom\nReferences\nExternal links\n*[https://www.gbgb.org.uk/about/ Greyhound Board of Great Britain (GBGB)]\n*[https://www.greyhoundtrust.org.uk/ Greyhound Trust (GT)]\n*[https://bgrf.org.uk/ British Greyhound Racing Fund (BGRF)]\n*[https://www.greyhound-data.com/ Greyhound Data]\n*[https://greyhoundstar.co.uk/ Greyhound Star]\n*[https://www.greyhoundstudbook.co.uk/ Greyhound Stud Book (GSB)]\n*[https://britishgreyhoundbreedersforum.co.uk/ Greyhound Breeders Forum]"
    }
  ]
}