{
  "content": [
    {
      "type": "text",
      "text": "# Greymare, Queensland\n\n| pop                 = 70\n| pop_year            =\n| pop_footnotes       =\n| established         =\n| postcode            = 4370\n| area                = 189.1\n| timezone            = AEST\n| utc                 = +10:00\n| dist1               = 36.4\n| dir1                = W\n| location1           = Warwick\n| dist2               = 99.5\n| dir2                = SSW\n| location2           = Toowoomba\n| dist3               = 191\n| dir3                = SW\n| location3           = Brisbane\n| dist4               =\n| dir4                =\n| location4           =\n| lga                 = Southern Downs Region\n| stategov            = Southern Downs\n| fedgov              = Maranoa\n| near-n              = Thane\n| near-ne             = Montrose\n| near-e              = Rodgers Creek\n| near-se             = Palgrave\n| near-s              = Cement Mills\n| near-sw             = Cement Mills\n| near-w              = Karara\n| near-nw             = Karara\n}}\nGreymare is a rural locality in the Southern Downs Region, Queensland, Australia. In the , Greymare had a population of 70 people.\nGeography\nThe Cunningham Highway enters the locality from the north-east (Montrose / Rodgers Creek) and exits to the north (Thane).\nThe South-Western railway line enters the locality from the north-east (Montrose) and exits to the north (Thane). Greymare railway station served the locality but is now abandoned ().\nHistory\nThe locality was named after a grey mare which belonged to pastoralist John Deuchar. This horse would escape from any paddock and head for the Greymare Creek. The Greymare railway station was named in 1904.\nToolburra South State School opened on 2 June 1879. In 1924 it was renamed Greymare State School. It closed in 1966. It was at 5 Lagoon Creek Road opposite Graymare School Road ().\nDemographics\nIn the , Greymare had a population of 64 people.\nIn the , Greymare had a population of 70 people.\nEducation\nThere are no schools in Greymare. The nearest government primary schools are Wheatvale State School in Wheatvale to the north-east and Karara State School in neighbouring Karara to the west. The nearest government secondary school is Warwick State High School in Warwick to the east. There are also non-government schools in Warwick.\nReferences\nFurther reading\n*  — [https://onesearch.slq.qld.gov.au/permalink/61SLQ_INST/11l3i0/alma997117924702061 via State Library of Queensland], includes the districts of Allan, Bony Mountain, Greymare, Pratten, Rodger's Creek, Thane, Thane's Creek and Wheatvale."
    }
  ]
}