{
  "content": [
    {
      "type": "text",
      "text": "# Grigory Yavlinsky 2018 presidential campaign\n\n| slogan           = «Умный президент — богатая Россия» (Smart President, Rich Russia)\n| chant            =\n| website          = [https://2018.yavlinsky.ru/ 2018.yavlinsky.ru]\n}}\nThe 2018 presidential campaign of Grigory Yavlinsky was announced in February 2016 by co-founder of the Yabloko party Grigory Yavlinsky at a party congress. He previously ran as a candidate in 1996 and 2000, and attempted to do so again in 2012 but was rejected by the Central Election Commission due to not having enough signatures.\nBackground\nGrigory Yavlinsky is a former leader of one of Russia's oldest political parties, Yabloko. He first announced his intention to run at the Yabloko party congress in February 2016. He was nominated by Emilia Slabunova, the party leader, who stated that he will run as \"an alternative to Putin and his system\", and was endorsed by opposition politician Vladimir Ryzhkov. As a liberal, he planned on capitalizing on the economic problems in Russia that have arisen since the annexation of Crimea in 2014. Since Yabloko is not represented in the State Duma, Yavlinsky will be required to collected 100,000 signatures from at least 40 different federal subjects of Russia.\nPolitical analysts have compared him to other opposition candidates that have declared their intent to run, including Alexei Navalny, but believe that Yavlinsky does not possess the same level of charisma as Navalny. Some suggestions have been made after Navalny's candidacy was rejected by the Central Election Commission in late December 2017 that he should endorse Yavlinsky, who was accepted. However Navalny instead declared his intent to boycott the elections, which was seen by analysts as a weakness to Yavlinsky's chances.\nNomination\nOn December 22, 2017, the Yabloko party congress officially nominated Grigory Yavlinsky as its candidate after a 98–4 vote in favor, with a member of the Central Election Commission present to monitor the procedures.\n{| class=wikitable style=text-align:right-\n! colspan=2|For\n! colspan=2|Against\n|-\n!colspan=2 style=\"background-color: #00b300\" |\n!colspan=2 style=\"background-color: #ff0000\" |\n|-\n|98\n|\n|4\n|\n|-\n| style=\"text-align:left;\" colspan=8 |Source:\n|}\nPolitical positions\nYavlinsky's program was titled \"Road to the Future\" and entails what he intends to accomplish in his first one hundred days in office. Among his two main priorities are respecting human rights in Russia and creating a strong economy.\nEconomy\nYavlinsky stated that one of his main goals would be combating poverty. He wants to give three acres of land for free to each Russian family so that they could build a home there and develop the land.\nForeign policy\nHe did not support the annexation of Crimea in 2014 and believes that another referendum should be held in the disputed region, and that Russia should hold a conference with the United Nations and Ukraine to determine the status of the peninsula after recognizing the 2014 events as a violation of international law. Yavlinsky essentially regards Crimea as part of Ukraine and stated the following: \"Any form of forceful intervention in the internal affairs of Ukraine, as well as the incitement and propaganda of war should be stopped. Commitments to Ukraine's territorial integrity and respect by Russia of its international obligations should be declared at the highest state level.\" Speaking at a televised debate in September 2016, Yavlinsky said he considers Russian actions in Ukraine to be an \"absolute and complete disgrace\". In addition, he wants to withdraw all Russian forces from Syria, as well as take measures to normalize relations with the European Union and the United States, as he considers Russia to be politically part of Europe.\nYavlinsky believes that any escalation of tensions with North Korea and the possibility of a nuclear conflict there presents a major threat to Russia, and thus he did not support Donald Trump and his actions in regards to raising hostilities with North Korea.\nLaw\nYavlinsky wants to make the judiciary of Russia genuinely independent.\nSee also\n*Grigory Yavlinsky presidential campaign, 1996\n*Grigory Yavlinsky presidential campaign, 2000\n*Grigory Yavlinsky presidential campaign, 2012\nReferences\nExternal links\n*[https://www.yavlinsky.ru/yavl_program_4.pdf Yavlinsky's Program]"
    }
  ]
}