{
  "content": [
    {
      "type": "text",
      "text": "# Gronovi's dwarf burrowing skink__disambig_1\n\n| genus = Scelotes\n| species = gronovii\n| authority = (Daudin, 1802)\n| range_map =\n| synonyms = *Seps gronovii\n*Scelotes gronovii\n| synonyms_ref =\n}}\n'''Gronovi's dwarf burrowing skink (Scelotes gronovii') is a species of skink, a lizard in the family Scincidae. The species is endemic to South Africa.\nEtymology\nBoth the specific name, gronovii, and the common name are in honour of Dutch naturalist Laurens Theodorus Gronovius.\nDescription\nS. gronovii has no front legs, and each back leg has only one toe. The snout-to-vent length (SVL) of adults is usually , and the maximum recorded SVL is .\nHabitat\nThe preferred natural habitat of S. gronovii is sparse sandy shrubland in the southwestern coastal margins of the Western Cape (including Dassen Island), at altitudes below .\nBehaviour\nS. gronovii is terrestrial and fossorial.\nReproduction\nS. gronovii is ovoviviparous. A litter consists of one or two newborns, each of which has a total length (including tail) of .\nReferences\nFurther reading\n*Branch, Bill (2004). Field Guide to Snakes and other Reptiles of Southern Africa. Third Revised edition, Second Impression. Sanibel Island, Florida: Ralph Curtis Books. 399 pp. . (Scelotes gronovii, p.&nbsp;142 + Plate 47).\n*Daudin FM (1802). Histoire Naturelle, Générale et Particulière des Reptiles; Ouvrage faisant suite à l'Histoire Naturelle générale et particulière, composée par Leclerc de Buffon; et rédigée par C.S. Sonnini, membre de plusiers sociétés savantes. Tome quatrième. Paris: F. Dufart. 397 pp. (Seps gronovii, pp.&nbsp;354–358). (in French and Latin).\n*Heideman, Neil J.L.; Mulcahy, Daniel G.; Sites, Jack W. Jr.; Hendricks, Martin G.J.; Daniels, Savel R. (2011). \"Cryptic diversity and morphological convergence in threatened species of fossorial skinks in the genus Scelotes (Squamata: Scincidae) from the Western Cape Coast of South Africa: Implications forspecies boundaries, digit reduction and conservation\". Molecular Phylogenetics and Evolution'' 61 (3): 823–833.\nExternal links\n*"
    }
  ]
}