{
  "content": [
    {
      "type": "text",
      "text": "# Group tournament ranking system\n\nIn a group tournament, unlike a knockout tournament, there is no scheduled decisive final match.  Instead, all the competitors are ranked by examining the results of all the matches played in the tournament.  Typically, points are awarded for each match, with competitors ranked based either on total number of points or average points per match. A special type of group tournament is the Round-robin tournament, in which each player plays against every other player.\nUsually each competitor finishes with an equal number of matches, in which case rankings by total points and by average points are equivalent at the end of the tournament, though not necessarily while it is in progress. Examples with unequal numbers of matches include the 1895 County Championship in English cricket, and the U.S. National Football League prior to 1972, when tie games were excluded from the winning percentage used for regular-season standings.\nPoints calculation\nIn two-competitor games where ties are rare or impossible, competitors are typically ranked by number of wins, with ties counting half; each competitor's listings are usually ordered wins–losses(–ties).  Giving a half-point for a draw in chess was introduced in 1868 by the British Chess Association; previously, drawn games in chess tournaments were replayed. Where draws are more common, the award may be 2 points for a win and 1 for a draw, which is mathematically equivalent but avoids having half-points in the listings. These are usually ordered wins–draws–losses.  If there are more than two competitors per match, points may be ordinal—for example, 3 for first, 2 for second, 1 for third. An extreme example of this is Formula One, where the top ten racers in each Grand Prix are given 25, 18, 15, 12, 10, 8, 6, 4, 2 and 1 respectively.\nSome games may have more complex ranking criteria. For example, in rugby union, bonus points may be awarded for scoring a certain number of tries in a match, usually four, or for losing by a relatively small margin, usually 7 (the value of a converted try) or less. In \"clutch chess\", developed by Maurice Ashley, points increase in later rounds to reward clutch players.\nAdditionally in many leagues, the governing body is able to penalize a competitor who has broken the league's rules (for instance by allowing an ineligible player to play) by deducting points from that competitor's total. Sometimes this deduction may be carried over to a following season, particularly if the infraction occurs during the off-season, meaning that the competitor will start the following season with a negative points total rather than zero.\nOfficial listings while a tournament is in progress may need to take account of competitors having played differing fractions of their schedules. Some use average points (such as the \"points percentage\" of the National Hockey League) and others total points (such as the English Premier League, although comparisons between teams typically mention where one has \"games in hand\" on the other). The games behind figure used unofficially in Major League Baseball occasionally gives a different ordering from the official \"winning percentage\".\nAssociation football\n); 2 points for a win]]\nIn association football, where draws are relatively common, many leagues give 3 points for a win and 1 for a draw in an attempt to encourage attacking play.  Besides the traditional 2–1–0 points and newer 3–1–0 points systems for win-draw-loss, various other systems have been used to try to encourage attractive play.  Some examples:\n* 3–2–1 as in the Greek League 1959–73; or 4–2–1. Giving 1 point extra in each case for losing may be simply cosmetic, but does allow for awarding 0 points for forfeiting a match. (The FIFA standard is to count a forfeit as a 3–0 defeat.)\n*The USL W-League in 2002 gave 4–1–0 with a bonus point for scoring three goals.\n*The 1981–82 League of Ireland season had 4–3–2–1–0 points for away win&nbsp;— home win&nbsp;— away draw&nbsp;— home draw&nbsp;— loss\n*In China in the 1970s and 1980s, bonus points were for scoring headed goals, and for teams whose players were selected for the national squad.\n*Bulgaria for three seasons 1984–87 gave no points for scoreless draws.\n*France gave a bonus point for scoring 3 goals in 1973–76, but stopped after rumours this encouraged match fixing. However, Michel Hidalgo has reported to the French Football Federation similar proposals to encourage attacking play.\nSome leagues have used penalty shootouts after drawn games, in which case points will vary for regulation win&nbsp;— penalties win&nbsp;— penalties loss&nbsp;— regulation loss:\n* In the playoffs of the French women's league, 4–2–1–0.\n*Yugoslav League had 2–1–0–0 from 1989–92\n*Major League Soccer had 3–1–0–0 from 1996–99.\n*The original Japan Football League had 3–3–1–0 in 1996\n*In the North American Soccer League in 1975–84, 6–1–0–0, with a bonus point each for up to 3 goals scored\n*In the Western Soccer League in 1989, 6–4–2–0, with a bonus point each for up to 3 goals scored\n*EFL Trophy and Scottish League Cup from 2016–17, 3–2–1–0 in the first round groups.\nBasketball\nIn FIBA (basketball)-sanctioned tournaments, where ties are impossible (a game goes into as many extra periods, or overtimes, as necessary to determine a winner), the following method is used:\n*Win = 2 points\n*Loss = 1 point\n*Loss by forfeit (team fails to appear for a scheduled game, or withdraws from the court before the end of the game) = 0 points\nFor an example, see 2006 FIBA World Championship.\nNon-FIBA tournaments, primarily those in the United States and Canada, use winning percentage as the primary method of ranking teams. Once all games have been played, rankings based on FIBA's points method and by winning percentage are almost identical, except for cases of forfeitures.\nIce hockey\nIn the National Hockey League (and various minor hockey leagues), where regular season games tied after three periods go into a five-minute sudden-death overtime period and then a shootout if needed, the following method is used:\n*Win: 2 points\n*Loss in regulation time: 0 points\n*Loss in overtime or shootout: 1 point\nMost European ice hockey leagues including the KHL, was well as the North American PWHL, use an alteration to the NHL method that does not encourage regulation draws by awarding more combined points than regulation decisions. This system was also used at the 2010 Winter Olympics in the preliminary round-robin games:\n*Win in regulation time: 3 points\n*Win in overtime or shootout: 2 points\n*Loss in overtime or shootout: 1 point\n*Loss in regulation time: 0 points\nSummary\n{|class=wikitable width=60% style=\"text-align:center;\"\n|-\n!width=30%|League/organizer !!width=10%| Full-time win !!width=10%|  Overtime win !!width=10%|  Draw !!width=10%|  Overtime loss !!width=10%|  Full-time loss !!width=10%|  Forfeit loss\n|-\n|align=left|Association football || 3 ||  || 1 ||  || 0 ||\n|-\n|align=left|Australian Football League || 4 ||  || 2 ||  || 0 ||\n|-\n|align=left|Camogie || 3 ||  || 1 ||  || 0 || 0\n|-\n|align=left|Chess|| 1 ||  || ½ ||  || 0 || 0\n|-\n|align=left|Cricket (limited overs)|| 2 || 2 || 1 (NR) || 0 || 0 || 0\n|-\n|align=left|FIBA basketball || 2 || 2 ||  || 1 || 1 || 0\n|-\n|align=left|Field hockey || 3 ||  || 1 ||  || 0 ||\n|-\n|align=left|Gaelic football || 2 ||  || 1 ||  || 0 || 0\n|-\n|align=left|Go|| 2 ||  || 1 ||  || 0 || 0\n|-\n|align=left|Handball || 2 ||  || 1 ||  || 0 || 0\n|-\n|align=left|Hurling || 2 ||  || 1 ||  || 0 ||\n|-\n|align=left|IIHF ice hockey || 3 || 2 ||  || 1 || 0 ||\n|-\n|align=left|Ladies' Gaelic football || 3 ||  || 1 ||  || 0 || 3\n|-\n|align=left|National Hockey League || 2 || 2 ||  || 1 || 0 ||\n|-\n|align=left|Professional Women's Hockey League || 3 || 2 ||  || 1 || 0 ||\n|-\n|align=left|Rugby league || 2 ||  || 1 ||  || 0 ||\n|-\n|align=left|Rugby union || 4 ||  || 2 ||  || 0 ||\n|-\n|align=left|Volleyball || 3 (3 or 4 sets) || 2 (5 sets) ||  || 1 (5 sets) || 0 (3 or 4 sets) ||\n|}\nTiebreaker criteria\nWhen competitors are level on points, there is usually some tiebreaker criterion.\nSometimes, however, ranking ties may stand: prior to 1994, the Five Nations Championship in rugby union could result in joint champions; likewise for the British Home Championship in association football until 1978.  In college football in the United States, many conferences permit joint champions (though in the top-level NCAA Division I FBS, every conference has held a single championship game since 2018). However, if ranking within the conference determines eligibility for a conference championship game or postseason bowl game, tiebreak criteria will be required to separate the potential participants. Similarly, U.S. college conferences in other sports, notably basketball, use tiebreak criteria as needed to determine seeding in postseason conference tournaments.\nA tiebreaker may be a play-off, with extra matches between the tied competitors. This may be a full match or a reduced format such as a penalty shootout or speed chess. If there are more than two tied competitors in a 2-competitor game, the play-off may be a round-robin or knockout tournament, as in the 1992–93 League of Ireland.\nInstead of a playoff, the original matches may provide the tie-breaker criteria:\n;head-to-head: considering only results of matches between the deadlocked competitors. If more than a single match is involved, a subtable may be used recursively for the ranking.\n;subset or superset of matches: commonly in a North American regular season, a team plays all others in its division, plus a subset of teams in other divisions of the same conference and/or teams outside the conference. This provides separate rankings by considering only division games, or all conference games, or all games, with one of these three being the default ranking and the other two being tiebreakers.\n;scoring average: the ratio of goals/points/etc. scored to those conceded.\n;scoring differential: the difference between goals/points/etc. scored and those conceded.\n;scoring rate differential: such as net run rate in cricket, the difference a team's run rate (runs per over) and that of its opponent.\n;goals/points/etc. scored: irrespective of goals/points/etc. conceded.\n;goals/points/etc. conceded: irrespective of goals/points/etc. scored. A lower concession rate is sometimes used in American youth sports in preference to a higher scoring rate, because running up the score against weak teams is considered unsporting; indeed, there may be a mercy rule which limits the scoring rate of strong teams.\n;goals/points/etc. scored away: valuing scores \"on the road\" above scores on one's home ground.\n;number of wins: in games where draws are possible\n;disciplinary record: fouls conceded, players sent off, etc. In 2018 FIFA World Cup Group H, Japan eliminated Senegal by receiving fewer yellow cards.\n;seeding or pre-tournament ranking: This may be defined to favour the higher- or lower-ranked competitor.\n;Koya score\n: the number of points achieved against all opponents who have achieved 50% or more\n;Neustadtl score or Sonneborn–Berger score\n: the sum of defeated opponents' scores plus half the sum of drawn opponents' scores; this method is especially common in round-robin chess tournaments; in chess or Go Swiss-system tournaments (which use Swiss pairing) it is used as a secondary tie-break criterion.  Ties remaining after one of these criteria may be resolved by resorting to one of the other available options. Where a group is the qualifying phase of a larger tournament, such that ties are not admissible, it may be necessary as a last resort to use drawing of lots as a tiebreaker (as was used in Group F of the 1990 FIFA World Cup to separate second and third place).\n;sum of defeated opponents' scores (SODOS)\n:suffices if draws cannot occur, such as in Go when komi is set to 6.5 or another half-point value.\n;sum of opponents' scores (SOS)\n: While SODOS works well, SOS fails as tie-breaker in tournaments with Swiss-system pairing or that have all players play all others. But SOS makes more sense than SODOS does as tie-breaker in tournaments with McMahon pairing.\n;drawing of lots:This may be the last resort when all other tiebreakers fail. It was used to separate second and third in 1990 FIFA World Cup Group F.\nSwiss-system tournaments and variants thereof use a variety of tie-breaking criteria not found in other types of tournament which exploit features specific to the Swiss system: see tie-breaking in Swiss-system tournaments. Chess and some Go tournaments use Swiss pairing.\nOften, multiple criteria are specified in a fixed order; if all competitors are still tied under one criterion, the next one is applied. For example, in the 2008 Big 12 South division, the top three teams were tied on the default ranking and the first four tiebreakers, being separated by the fifth (BCS rankings). On the other hand, if one criterion reduces the number of tied competitors but leaves some still tied, then the entire set of criteria may be re-applied to the smaller set of tied teams, beginning with the default ranking method and proceeding through the tiebreakers. For example, in the 2006–07 Super League Greece, part of the final table was:\n{| class=\"wikitable\" style=\"text-align: center;\"\n!Pos\n!Team\n!P\n!W\n!D\n!L\n!Pts\n|-\n|11||Xanthi||30||8||12||10||36\n|-style=\"background: #FFFF99;\"\n|rowspan=\"3\"|12–14||Iraklis||30||10||5||15||35\n|-style=\"background: #FFFF99;\"\n||Apollon Kalamarias||30||9||8||13||35\n|-style=\"background: #FFFF99;\"\n|Kerkira||30||8||11||11||35\n|-\n|15||Egaleo   ||30||7||7||16||28\n|}\nThe three teams tied on 35 points were separated by considering only matches between any two of them...:\n{| class=\"wikitable\" style=\"text-align: center;\"\n!Pos\n!Team\n!P\n!W\n!D\n!L\n!Pts\n|-\n|12||Apollon Kalamarias||4||3||0||1||9\n|-style=\"background: #FFFF99;\"\n|rowspan=\"2\"|13–14||Iraklis||4||1||1||2||4\n|-style=\"background: #FFFF99;\"\n|Kerkira||4||1||1||2||4\n|}\n...and then again for the two teams still tied:\n{| class=\"wikitable\" style=\"text-align: center;\"\n!Pos\n!Team\n!P\n!W\n!D\n!L\n!Pts\n|-\n|13||Iraklis||2||1||1||0||4\n|-\n|14||Kerkira||2||0||1||1||1\n|}\nFootnotes\nCitations\nSources\n*\nExternal links\n*[https://web.archive.org/web/20090228062913/http://www.sover.net/~spectrum/scoring-systems.html Scoring Systems, USA leagues] lists many other systems used in soccer leagues in the USA"
    }
  ]
}