{
  "content": [
    {
      "type": "text",
      "text": "# Grunwald Monument\n\n|extra         =\n}}\nThe Grunwald Monument (Polish: Pomnik Grunwaldzki) is an equestrian statue of King of Poland Władysław II Jagiełło (1352–1434) located at Matejko Square in Kraków, Poland. It was constructed in 1910 to commemorate the 500th anniversary of the Battle of Grunwald, when an alliance of the Crown of the Kingdom of Poland and the Grand Duchy of Lithuania decisively defeated the German Teutonic Order.\nThe statue depicts Jagiełło atop his horse with his cousin, and Grand Duke of Lithuania, Vytautas to his front. On either side of Jagiełło are soldiers lifting their arms in celebration of victory. Depicted lying dead at the steps of the statue is Grand Master of the Teutonic Knights Ulrich von Jungingen. It was destroyed by German soldiers following the Invasion of Poland by Nazi Germany in 1939, but was reconstructed in 1976 based on a design by Marian Konieczny.\nHistory\nOrigin\nThe monument was designed by Polish sculptors Antoni Wiwulski and Franciszek Black and funded by renowned pianist and future Prime Minister of Poland, Ignacy Jan Paderewski. He wanted to celebrate the 500th anniversary of the victorious Battle of Grunwald fought between Poland and Grand Duchy of Lithuania against the Teutonic Knights on 15 July 1410. The battle has an enormous relevance in Polish history and is seen as one of the nation's greatest military victories.\nConstruction\nInitially, there was controversy where to locate the monument and various different locations were proposed including the Holy Spirit Square (Plac Św. Ducha) supported by Paderewski, the square in front of St. Bernard's Church and the Matejko Square. Eventually, the latter option was chosen partly thanks to its close proximity to the Kraków's defensive walls, which reflected in their appearance the early Jagiellonian era. The foundation stone for the monument was laid in April 1910. The project was carried out in secrecy in the Austrian Partition of Poland and even Wiwulski himself did not know the final purpose of the project when he worked on the details of the monument. The granite obtained for the construction of the pedestal came from the Vanevick quarry in Sweden owned by French company Le Granite from Abainville. Antoni Wiwulski worked on the statue of King Jagiełło during his stay in Paris but the project was temporarily halted due to the sculptor's sudden illness. The figures displayed on the monument were cast in bronze by the French company Malleset. The sculptures were then transported by train from France through Switzerland to Kraków. The entire cost of the project is estimated at 500,000 Austro-Hungarian krones.\nGrand opening\nThe official and ceremonial opening of the monument took place on 15 July 1910. The unveiling of the Grunwald Monument was witnessed by 150,000 spectators and by many prominent dignitaries including Land Marshal of Galicia (and a de facto Prime Minister) Stanisław Badeni, Mayor of Kraków Juliusz Leo and the sponsor of the monument Ignacy Jan Paderewski.\nWorld War II and post-war years\nDuring the  Occupation of Poland in World War II, the monument was systematically destroyed by Nazi Germany between November 1939 and April 1940, as an act of retaliation. The pedestal was demolished with dynamite, while the bronze statues were looted and transported to Germany. On 28 January 1945, a decision was made to reconstruct the monument after the war. Feliks Dziuba was one of the few who saved fragments of the monument. Granite blocks which were recovered from the original monument were placed on the site where the monument was located. In 1972, a special committee was established whose aim was to reconstruct the Grunwald Monument known as Komitet Odbudowy Pomnika Grunwaldzkiego. Based on a miniature model of the original monument kept by the Historical Museum of Kraków as well as pre-war photographs, artist Marian Konieczny carried out the reconstruction of the monument. The granite was obtained from the region of Szklarska Poręba and the figures were cast in bronze in Gliwice. On 16 October 1976, the Grunwald Monument was officially re-opened. In front of the monument, a Tomb of the Unknown Soldier was located featuring a symbolic marble plaque designed by Wiktor Zin.\n100th anniversary celebrations\nOn 10 September 2010, a ceremonial reenactment of the events related to the opening of the monument took place in Kraków as well as celebrations of the 600th anniversary of the battle and the 100th anniversary of the construction of the monument. In 2016, the Grunwald Monument underwent an extensive renovation and cleaning.\nDescription\nThe monument is 24 meters (78&nbsp;ft) tall and at the top of it an equestrian statue of King Władysław Jagiełło is located. The king holds the bridle in his left hand and a sword in his right hand. On the front side of the monument there are sunk relieves for the Grunwald Swords and a statue of Grand Duke of Lithuania Vytautas at the feet of whom lies the figure of fallen in battle Grand Master of the Teutonic Knights Ulrich von Jungingen. The eastern side features a Polish knight and his page collecting the abandoned Teutonic banners. The western side features a Lithuanian warrior blowing a horn and leading a captured Teutonic knight. The northern side features a peasant symbolically throwing off the shackles of enslavement.\nFile:Tomb of the Unknown Soldier, Grunwald Monument and church of St. Florian, Matejko Square, Kraków, Poland.jpg|Matejko Square.  From left to right, Tomb of the Unknown Soldier, Grunwald Monument, and (in background) St. Florian's Church\nFile:The Grunwaldzki Monument in Cracow 2.jpg|The opening ceremony of the monument, 1910\nFile:WWII Krakow - 01.jpg|German soldiers standing on the destroyed remnants of the monument in 1939\nFile:PomnikGrunwaldzki-PostaćKrólaWładysławaJagiełły-POL, Kraków.jpg|Władysław Jagiełło statue\nFile:PomnikGrunwaldzki-PostaćKsięciaWitolda-POL, Kraków.jpg|Vytautas statue\nFile:PomnikGrunwaldzki-PostaćUlrichaVonJungingena-POL, Kraków.jpg|Ulrich von Jungingen statue\nFile:PomnikGrunwaldzki-PraojcomNaChwałę-POL, Kraków.jpg|Eastern side\nFile:PomnikGrunwaldzki-BraciomNaOtuchę-POL, Kraków.jpg|Western side\nFile:PomnikGrunwaldzki-PostaćChłopaZrywającegoKajdny-POL, Kraków.jpg|Northern side\nSee also\n*Tadeusz Kościuszko Monument, Kraków\nReferences"
    }
  ]
}