{
  "content": [
    {
      "type": "text",
      "text": "# Guerrilla warfare in the Peninsular War\n\n(1907) of Portuguese guerrillas attacking a column of French troops.]]\n]]\n, depicting a dead irregular combatant held by his companion brandishing a jackknife.]]\navenging his daughter Manuela Malasaña on the streets of Madrid during the Dos de Mayo uprising. Painted by Eugenio Álvarez Dumont in 1887.]]\nGuerrilla warfare in the Peninsular War refers to the armed civilian actions carried out by non-regular troops against Napoleon's Grande Armée in Spain and Portugal during the Peninsular War.\nThese armed men were a constant source of drain and harassment to the French army, as described by a Prussian officer fighting for the French: \"Wherever we arrived, they disappeared, whenever we left, they arrived — they were everywhere and nowhere, they had no tangible center which could be attacked.\"\nThe Peninsular War was significant in that it was the first to see a large-scale use of guerrilla warfare in European history and, partly as a result of the guerrillas, Napoleon's troops were not only defeated in the Peninsular War, but tied down on the Iberian Peninsula, unable to conduct military operations elsewhere on the European Continent. The strain the guerrillas caused on the French troops led Napoleon to dub the conflict the \"Spanish Ulcer.\"\nWhile folklore would often elevate the status of local heroes, many of the leading guerrilleros were actually regular army officers commanding irregular \"troops\".\nCourse of the war\nApart from the odd setback, such as General Castaños' surprise victory at Bailén, in part due to guerrilla warfare between Madrid and Andalusia, and especially in the Sierra Morena, a victory which helped persuade the British government that Napoleon could be defeated, the French troops were largely undefeated on the open battlefield. However, nobody had foreseen that guerrilla warfare could lead to such a devastating outcome.\nA list drawn up in 1812 puts the figure of such irregular troops in Spain alone at 38,520 men, divided into 22 guerrilla bands.\nAlthough locally organised militia had been deployed before in both Portugal, the ordenanças, and Spain, particularly in the regions of Catalonia and Valencia, where thousands of well-organised miquelets (in conjunction with local militias known as somatenes) had already proved their worth in the Catalan revolt of 1640 and in the War of the Spanish Succession (1701–1714), it was during the Peninsular War, referred to by Spaniards as the War of Independence, that such armed forces became active on a nationwide basis, as well as serving alongside regular army units or in co-ordination with regular army commanders.\nWell aware of how successful both urban and rural guerrilla warfare had been so far, on 28 December 1808 the Junta Central Suprema issued the Reglamento de partidas y Cuadrillas, a decree regulating the formation of guerrilla troops. This would be followed by other decrees in 1809, authorising the \"Corso Terrestre\" (\"Land Corsairs\") to keep for themselves any money, supplies and equipment that they were able to take from the French. In effect, in some cases, this meant that they were little more than brigands who were, in some cases, feared by French troops and the civilian population alike. Little by little, these groups would be incorporated into the regular Spanish Army and their cabecillas (leaders) given regular military ranks.\nSpanish guerrillas frequently attacked Grand Armee rear echelon components, including communication and supply lines. These guerrillas were mainly ordinary civilians, predominantly from rural areas and generally conscripted. The success of these fighters in the conflict was owed to the few men and small amount of equipment and energy required to hold a large area and disrupt French movements. Despite a French victory in the conventional war, the unconventional war simply could not be won. The stress of the guerrilla conflict put considerable strain on Napoleon who remarked that the affair had been the one \"that killed me.\"\nBy the end of 1809, the damage caused by the guerrillas led to the Dutch Brigade, under Major-General Chassé, being deployed, almost exclusively and, largely unsuccessfully, in counter-guerrilla warfare in La Mancha.\nNotable actions\n* Battle of Arlabán (1811): A Spanish guerrilla force numbering between 3,000 and 4,500 men, led by Francisco Espoz y Mina, ambushed and captured the central part of a convoy made up of 150 wagons and 1,050 prisoners, escorted by 1,600 French troops led by Colonel Laffitte and spread out over five&nbsp;km at a mountain pass along the road to France. The convoy was valued at four million reales, and 1,042 British, Portuguese and Spanish prisoners were liberated in the raid.\n* Battle of Puente Sanpayo (1809): The army of French Marshal Michel Ney was defeated by the Spanish army. As Ney's troops retreat, they came under harassing fire from guerrilla forces, resulting in even more casualties.\nFamous guerrilleros\nSome of the better-known guerrilleros include the following:\n* Francisco Abad Moreno, \"Chaleco\"\n* Agustina de Aragón\n* Francisco Espoz y Mina\n* Francisco Sánchez Fernández, \"Tío Camuñas\"\n* Joaquín Ibáñez, Baron de Eroles\n* Francisco de Longa\n* Juan Martín Díez, \"El Empecinado\"\n* Julián Sánchez García, \"el Charro\"\n* Jerónimo Merino, \"el Cura Merino\"\n* Martin Xavier Mina\n* Tomás de Zumalacárregui\n* Gaspar de Jáuregui, \"El Pastor\"\n* Felipe Perena y Casayús\n* Juan Bautista de Mendieta, also known as Fray Juan Delica, \"El Capuchino\"\nSee also\n* List of Spanish general officers (Peninsular War)\nReferences"
    }
  ]
}