{
  "content": [
    {
      "type": "text",
      "text": "# Guided democracy__disambig_1\n\nGuided democracy, also called directed democracy and managed democracy,'' is a formally democratic government that functions as a de facto authoritarian government or, in some cases, as an autocratic government. Such hybrid regimes are legitimized by elections, but do not change the state's policies, motives, and goals.\nIn a guided democracy, the government controls elections such that the people can exercise democratic rights without truly changing public policy. While they follow basic democratic principles, there can be major deviations towards authoritarianism. Under managed democracy, the state's continuous use of propaganda techniques, such as through manufacturing consent, prevents the electorate from having a significant impact on policy.\nThe concept is also related to semi-democracy, also known as anocracy.\nExamples\nPoland under Sanacja\nThe Sanacja regime that governed interwar Poland from 1926 to 1939 is considered an example of guided democracy, during both its first phase from 1926 to 1930, as well as the final 1930–1939 phase. The regime retained much of the structures and institutions of Polish parliamentary democracy, even though Józef Piłsudski exercised such large influence on the government that he \"assumed some of the postures of a dictator\". The 1935 April Constitution of Poland implemented by Sanacja centralized most state power in the hands of President, but the Polish guided democracy nevertheless stayed pluralistic, even if authoritarian. The opposition sat in the parliament and local governments, and political parties were allowed to function legally.\nPolish historian  notes that elections under Piłsudski's regime were still organised along the principles of parliamentary democracy, and the Sanacja regime was genuinely popular as the opposition parties were blamed for failing to prevent the Great Depression. Writing about late Sanacja, Antony Polonsky stated that even after 1930, \"parties survived, the\npress was fairly free, criticism was allowed\", thus maintaining the system of guided democracy. While the actions of the opposition were hampered, repressions were rare and only two parties were banned: Camp of Great Poland and National Radical Camp.\nIndonesia under Sukarno\nAfter World War II, the term \"guided democracy\" was used in Indonesia for the approach to government under the Sukarno administration from 1959 to 1966.\nRussia under Putin\nThe term \"managed democracy\" has been used to describe the political system of Russia under Vladimir Putin by former Putin advisor Gleb Pavlovsky, by media, and by Russian intellectual Marat Gelman.\nSee also\n* Conservative democracy\n*Defensive democracy\n* Dictablanda\n* Dominant-party system\n* Enlightened absolutism\n* Ethnic democracy\n* Herrenvolk democracy\n* Illiberal democracy\n* Sovereign democracy\n* Totalitarian democracy\n* Types of democracy\nReferences"
    }
  ]
}