{
  "content": [
    {
      "type": "text",
      "text": "# Guild Wars 2__disambig_1\n\n| director = Colin Johanson (2012–2016, 2021)Mike O'Brien (2016–2019)Mike Zadorojny (2019)John Taylor (2019–2021)Joshua Davis (2021–present)\n| producer = Amy Liu (2022–present)\n| designer = Colin JohansonEric Flannum\n| artist = Daniel DociuKekai Kotaki\n| writer = Ree SoesbeeJeff GrubbBobby SteinTom Abernathy\n| composer = Jeremy SouleMaclaine DiemerLena RaineStan LePard\n| series = Guild Wars\n| platforms = Microsoft Windows\n| released = August 28, 2012\nAugust 23, 2022 (Steam)\n| genre = MMORPG\n| modes = Multiplayer\n}}\nGuild Wars 2 is a free-to-play, massively multiplayer online role-playing game developed by ArenaNet and published by NCSoft. Set in the fantasy world of Tyria, the core game follows the re-emergence of Destiny's Edge, a disbanded guild dedicated to fighting Elder Dragons, colossal Lovecraftian-esque entities that have seized control of Tyria in the time since the original Guild Wars (2005), a plot line that concludes in the third expansion End of Dragons (2023). The game takes place in a persistent world with a story that progresses in instanced environments.\nGuild Wars 2 is the fourth major entry in the Guild Wars series, and claims to be unique in the MMO genre by featuring a storyline that is responsive to player actions, something which is common in single player role-playing games but rarely seen in multiplayer ones. A dynamic event system replaces traditional questing, utilising the ripple effect to allow players to approach quests in different ways as part of a persistent world. Also of note is the combat system, which aims to be more dynamic than its predecessor by promoting synergy between professions and using the environment as a weapon, as well as reducing the complexity of the Magic-style skill system of the original game.\nAs a sequel to Guild Wars, Guild Wars 2 features the same lack of subscription fees that distinguished its predecessor from other commercially developed online games of the time, though until August 2015 a purchase was still required to install the game. The game sold over two million copies in its first two weeks. By August 2013, the peak player concurrency had reached 460,000. By August 2015, over 5 million copies had been sold, at which point the base game became free-to-play. By August 2021, over 16 million accounts have been created. On August 16, 2022, it was announced that Guild Wars 2 will be releasing on Steam as part of the game's 10th year anniversary celebration.\nSix major expansion packs have been released for the game; Heart of Thorns (2015), Path of Fire (2017), End of Dragons (2022), Secrets of the Obscure (2023), Janthir Wilds (2024), and Visions of Eternity (2025). Each expansion pack introduces new content, including new regions of the world to explore, end-game encounters and masteries, with the first three also offering new professions, elite specializations, and seasons of '''Living World; live content updates that continue expansion storylines and bridge the gap between them. In February 2023, it was announced that future Guild Wars 2 expansions starting with Secrets of the Obscure would be adopting a new release model. Instead of releasing every two to four years with a season of Living World in between, smaller scale expansions would be released more frequently at a slightly reduced price. Additional content for these expansions will then be added through quarterly releases.\nGameplay\nsystem that allows the player to fine tune the look of their characters.]]\nGuild Wars 2 allows a player to create a character from a combination of five races and nine professions. The five races are the humans, the charr (introduced in Prophecies), the asura and the norn (introduced in Eye of the North), and the sylvari, a race exclusive to Guild Wars 2. The professions are divided into armor classes: \"scholars\" with light armor, \"adventurers\" with medium armor, and \"soldiers\" with heavy armor&nbsp;— five of the professions make a reappearance from Guild Wars. There is no dedicated healing class as the developers felt that making it necessary for every party to have a healer was restrictive.\nThe race and profession of the player determines the skills they can access. Guild Wars 2, like Guild Wars, uses a skill-based combat system, whereby players must select only 10 skills from a much larger pool, introducing an element of strategy. However, unlike Guild Wars'', skill slots have predefined roles: the first five are determined by player's weapon and profession, the sixth is for healing, the seventh through ninth will be skills with no defined roles that are unlocked as the game progresses, and the tenth slot will be for an \"elite\" skill, which is also initially locked. In a departure from the high number of skills present in Guild Wars, Guild Wars 2 will focus on quality of skills over quantity and attempt to minimize skill splits across game modes to reduce balancing complexity&nbsp;— one of the most common issues present in MMORPGs.\nThe low level cap of Guild Wars (20) was replaced with one at 80, which the developers stated struck the correct balance between allowing for character development and avoiding forcing players into the grind-based gameplay that too often accompanies a high level cap, the elimination of which was a core design principle of the original Guild Wars. Player versus environment features a scaling system that lowers the players level and stats to reflect the levels of monsters, thereby maintaining a global level of difficulty. In player versus player, a player will have access to almost all skills and items, and compete at the fixed level 80, so that all players will be on a level playing field.\nIn addition to a small-scale, tactical combat PvP, the game features \"World versus World\", large scale combat taking place in a persistent world independent of the main world. Players are able to drop in and out \"on the fly\" and possess the ability to construct siege weapons, with rewards commensurate with their success. Guild Wars 2 offers eight crafting disciplines, allowing the player to practice two at a time, with a fee for switching. While there are basic recipes to follow, the player can experiment with different combinations of ingredients to discover new recipes. As the game is set 250 years after its predecessor, players are unable to carry over their characters. There are, however, a small number of achievements and honors earned in Guild Wars which are carried over to Guild Wars 2. The accounts of both games must be linked in order to acquire these bonuses.\nThe Heart of Thorns expansion introduced raids, more difficult endgame content that introduce bosses with several unique mechanics, testing a squad's coordination, damage output, positioning, as well as the player's builds. There have been several additional raid wings with multiple bosses released since, along with Strike Missions, raid-like encounters focusing on a single boss, as well as more challenging Challenge Mode encounters.\nPlot\nSetting\nGuild Wars 2 takes place in the high fantasy world of Tyria, 250 years after the players' defeat of the Great Destroyer in the Eye of the North expansion. Five 'Elder Dragons' sleeping beneath the continent have awoken in the time since Guild Wars, causing widespread destruction to Tyria and corrupting its inhabitants. The once dominant humans of Tyria are in decline, supplanted from most of their land by natural disasters and war with the Charr, who have finally reclaimed the last vestiges of their ancestral homeland of Ascalon from the humans. To the north, the Norn, a proud race of Nordic hunters, have been forced south by the rise of Jormag, the elder dragon of ice. In the west, the technologically advanced Asura have been forced to establish permanent homes above-ground after the minions of the first dragon to awaken, Primordus, took control of the Depths of Tyria. Near the forests where the Asura make their home are the Sylvari, a new race who have appeared in Tyria in the last 25 years, unaffected by the difficulties that plague the other races but with some as yet unexplained connection to the Elder Dragons.\nTo the south, the continent of Cantha has been cut off by an isolationist and xenophobic political climate, which is reinforced by Zhaitan's undead navy. The continent of Elona, too, has been cut off; the only hint of its continued prosperity being the ongoing battle between the lich Palawa Joko's Mordant Crescent and Kralkatorrik, the crystal dragon in the Crystal Desert, as well as occasional spy reports from the secretive Order of Whispers. The Battle Isles have been wiped off the map entirely by the tidal wave caused by the re-emergence of the fallen kingdom of Orr, which came with the awakening of Zhaitan.\nThe advancement of time from Guild Wars is reflected in the changes in culture, including armor and clothing, as well as in the advancement of in-game technology and a unified common language.\nPlot (The Elder Dragon Saga)\nGuild Wars 2 features an expansive storyline called 'The Elder Dragon Saga', a story that is told through the first three expansions and '''Living World seasons: replayable live content updates that continue storylines in an episodic format, bridging the gap between expansions. The Elder Dragon Saga plot line starts with the original game, and concludes in the expansion End of Dragons (2022).\nGuild Wars 2\nIn the core game, the player character is tasked with reuniting the members of the disbanded Destiny's Edge'', a multi-racial adventuring guild whose members' struggles and eventual reunion serve as a microcosmic metaphor for the larger-scale unification of the playable races and their groups into \"The Pact\", whose combined strength is needed to effectively combat and defeat Zhaitan, the undead Elder Dragon.\nLiving World Season 1\nAfter the defeat of the Elder Dragon Zhaitan in the game's core story, the player character meets and forms together a new group of characters to battle the enigmatic and insane Sylvari, Scarlet Briar, as she creates strange enemy groups such as the \"Molten Alliance\" (a team-up between evil Charr and mole-like Dredge), the \"Toxic Alliance\" (a combination of lizard-like Krait and a splinter group from the \"Nightmare Court\", a group of evil Sylvari), and the \"Aetherblades\", a group of steampunk sky pirates. As the player and their new group of heroes, made up of characters from each race, battle Scarlet, they also learn about her past and investigate what she could be searching for. The season culminates with Scarlet attacking the main player city of Lion's Arch, landing a giant drill known as \"The Breachmaker\" in the center of the City. The player and their fellow heroes fight back and kill Scarlet, but not before Lion's Arch is left in ruins, and the Breachmaker pierces a magical Ley Line, awakening a previously unknown Elder Dragon, Mordremoth; the jungle dragon.\nLiving World Season 2\nSeason 2 of the \"Living World\" picks up where Season 1 left off, sending the player towards the Maguuma Wastes to battle Mordremoth with the help of their fellow heroes and Destiny's Edge. The season begins with the unexpected explosion and crash landing of the \"Zephyr Sanctum\", a group of airships populated by the \"Zephyrites\", followers of Kralkatorrik's deceased dragon champion and daughter, Glint, who had escaped from his control and had tried to help Destiny's Edge kill him before the events of the game (see tie in novel, \"''Guild Wars 2: Destiny's Edge''\"). The player and their allies follow Scarlet Briar's path into Dry Top, a region to the west, and learn about the Elder Dragons and the motivations for her destructive conquest in Season 1. The player also learns that Zephyrites were transporting an egg laid by Glint before her death and go in search of it. At the end of the season, the Pact prepare once again to battle an Elder Dragon. However, while the player continues to hunt down Glint's Egg and learns that the Sylvari race are in fact minions of the Jungle dragon, the Pact fleet is destroyed over the jungle by a devastating attack by Mordremoth.\nGuild Wars 2: Heart of Thorns\nFollowing the events of Season 2, the entire pact fleet is in ruins and burning, strewn all over the heart of the Maguuma Jungle. The Jungle Dragon, Mordremoth begins to send its minions, the Mordrem, forth to establish its hold on Tyria—and to bring the Sylvari race under its control. The pact commander journeys through the jungle picking up the pieces, locating their missing allies, exploring and meeting different factions in the jungle and mastering new skills to use for their advantage. During the story the commander also continues their hunt for Glint's egg, which was taken by Caithe. Whilst doing so they discover a hidden golden city, Tarir, built after the events of Eye of the North to incubate and protect Glint's offspring. After catching up and reconciling with Caithe, the egg is then left there, guarded by the city's inhabitants, the Exalted. At the end of the expansion, the pact commander enters Mordremoth's mind and destroys him from the inside, and as a result, his magic is dispersed across Tyria, some being absorbed by Glint's egg in Tarir.\nHeart of Thorns introduces raids, which together form their own optional side-story, leading into the story of Living World Season 3.\nLiving World Season 3\nLiving World Season 3 is the third instalment of the Living World, picking up a year after the Guild Wars 2: Heart of Thorns story left off. The story deals with the aftermath of the expansion story, the effects of the death of two Elder dragon's on the planet, a political coup and Human civil war, and the return of Lazarus the Dire, a member of the thought-to-be-extinct antagonistic race, the Mursaat. During the season, Glint's Egg also hatches into a baby dragon, Aurene, Glint's daughter. It is revealed towards the end of the season that Lazarus is in fact the human god, Balthazar, in disguise. He has turned rogue and returned to Tyria to destroy the rest of the Elder Dragons and take their power for his own; an act that would rip Tyria apart.\nGuild Wars 2: Path of Fire\nFollowing the events of Living World Season 3, the pact commander has thwarted the first stage of Balthazar's catastrophic plan to destroy the Elder Dragons and absorb their power—but now he's raised a zealous army to cut a path of terror and destruction across the south, through the Crystal Desert. While humanity struggles with the sudden return of one of their patron gods, the Pact Commander travels to the desert, chasing after Balthazar to stop him before the god's ruthless crusade can upset the delicate balance of magic in Tyria and lead to the end of the world. Whilst doing so, the commander tricks the undead Lich, Palawa Joko trapping him in the underworld realm of the mists. Throughout the expansion the commander discovers more of Glint's secrets, such as Aurene's true purpose to replace the Elder Dragons and control their magic. At the end of the expansion, together Aurene and the Commander kill Balthazar.\nThe death of the god causes a massive release of magical energy, most of which is absorbed by the Elder dragon Kralkatorrik, but Aurene receives some as well. Aurene then flies off, with Kralkatorrik closely following.\nLiving World Season 4\nAfter the events of Path of Fire, the Commander and their allies must contend with the empowered Elder Dragon, Kralkarorrik threatening Elona, which remains under the thrall of Palawa Joko's Awakened army generals. After Palawa Joko is freed from his captivity in the underworld, in retaliation he launches an all-out assault on Tyria which is eventually thwarted by the pact commander. After receiving a prophecy from Aurene that only one of them can live, the commander decides that the damage Kralkatorrik is doing to the mists outweighs the potential threat to Tyria of destroying him. They then launch an offensive of the dragon, with the goal of replacing him with Aurene.\nAt the end of the season, Kralkatorrik defeated, Aurene manages to ascend to become an Elder Dragon and flies off, as the rest of the crew fly back to Lion's Arch, having successfully defeating another Elder Dragon.\nThe Icebrood Saga (Living World Season 5)\nThe Icebrood Saga focuses on the norn and the charr, as they defend their homelands in the Far Shiverpeaks and the Blood Legion Homelands from the threat of Jormag, the Elder Dragon of Ice and Persuasion. The saga begins with the four charr High Legions gathering in Grothmar Valley to celebrate the death of Kralkatorrik, while Jormag begins to stir in the far north. Through its promises of power, the Elder Dragon has amassed a sizable army of Icebrood.  After the Charr blood legion imperator, Bangar Ruinbringer launches a mass-offensive to capture Jormag, Rytlock Brimstone, Braham, and Jhavi Jorasdottir lead the venture into the inhospitable Far Shiverpeaks to stop him, where players face eldritch abominations, learn about the history of the Spirits of the Wild, and confront Jormag themself.\nDuring the season, Jormag tells the player of a prophecy that either they or the fire Elder Dragon Primordus must kill the other. Jormag takes Rytlock Brimstone's son, Ryland Steelcatcher, as their champion, and begins attacks all over Tyria. Braham and the spirits of the wild merge as Primordus' Champion in hopes of steering the dragon directly into battle with Jormag. With both dragons primed for a clash, they are lured out to a field so that their champions and minions can battle each other. The Commander and any allies willing and able meet them on the battlefield and ensure that one side doesn't overtake the other. Eventually, both Jormag and Primordus are weakened and enraged enough that the two lunge at each other, destroying each other in the process. In the aftermath of their crash, both Braham and Ryland lose their champion status and return to normal. However, while Braham is relieved to be free of the influence, Ryland still holds a lot of anger. After a long fight with him against the Commander and both his parents, Ryland is killed and dies in Rytlock's arms.\nAfter witnessing the clash between the two Elder Dragons, Taimi and Gorrik returned to the Eye of the North, setting up a laboratory near Aurene so they could study and investigate the dragon cycle and any changes to the world from the magical fallout\nGuild Wars 2: End of Dragons\nEnd of Dragons opens with the reappearance of the Aetherblades, a group that have not been seen since Season 1. After capturing Gorrik, the commander leads chase through the mists with Aurene which ends with a crash landing in Cantha, a region of Tyria not visited since Guild Wars Factions.\nSince the events of Guild Wars Factions, the Empire of the Dragon severed all bonds with central Tyria and Elona. Cantha has its own history of turmoil and triumph, reflected in ancient landmarks, enduring artistry, and modern life. The Jade Wind petrified everything it touched, devastating the southeastern coastal regions. A stone sea holds no food—but it's absorbed centuries of magic. Canthan innovators have long sought practical applications for the material now known as “dragonjade”, achieving solutions undreamed of elsewhere in the world. New innovations are on the horizon.\nThe expansion story deals with the effects on the world due amount of magic that has been released upon the death of the five elder dragons, resolving many plot threads from the game's ongoing storyline. The players meet the sixth elder dragon, Soo-Won, the dragon of water, who has been cleansing and controlling the released magic, filtering it through her to create Dragonjade, and effectively stopping the planet from collapsing in on itself. The commander learns that the five other elder dragons were the offspring of Soo-won and used to be benevolent creatures; only becoming corrupt because of greed and the amount of magic they consumed. During an explosion caused by the Aetherblades, Soo-won leaves the reactor and becomes quickly corrupt with magic. The world then begins to fall apart with the combined magic of the Elder dragons, called the Draconic Void. The commander journeys through Cantha to extract the Void from Soo-won, and restart the dragon cycle.\nUpon the void's extraction, Soo-Won dissipates and Aurene absorbs her magic, replacing her as the filter of magic throughout the world. The cycle of the dragons finally ends and a new era begins: the Age of Aurene.\nMonths later, the commander is invited to a party hosted by Rama, who has formed a new detective agency with Gorrik. Taimi calls the commander with a tip about some jade miners who have gone missing, and the group decide to investigate the case. The commander arrives at the Gyala Delve with Rama and Gorrik to question the remaining jade miners, but finds them acting strangely and violently. Yao and Chul-Moo, the Brotherhood leader, agree to help them figure out what is going on in the mine. They explore the caves and discover them to be full of demons and shadow creatures. A shape-shifting demon called the 'Ravenous Wander' who is feeding on a ley line, attacks them and makes the commander faint.\nA few weeks later, the group come up with a plan to defeat the demons. The commander needs to face their past to charge a Recollector, a device created by Taimi. that can lure out and defeat the Ravenous Wanderer. They revisit some painful memories from earlier in the game to charge the recollector and start to feel more at peace with themself. Rama arms himself with an ancient Kurzick rune and practices a sealing spell to trap the wanderer. They lure it out of the ley lines, and fight it on the surface, eventually defeating the demon.\nIn the aftermath of the battle, Rama invites the commander, Gorrik and Taimi to a triple date with Min, a minister. At the date, the commander realizes that their emotional healing is gradual and that the pain they feels can be a reminder of how far they have come.\nPlot (Post-Elder Dragon Saga)\nWith the conclusion of the Elder Dragon Saga in the expansion End of Dragons (2022), it was announced that future storylines would be self-contained and feature characters, settings and plotlines that would be introduced and conclude in their respective expansions.\nChronological release timeline\n{| class=\"wikitable\"\n|+\n!Title\n!Release type\n! colspan=\"2\" |Release Name\n!Release date\n!Notes\n|-\n! colspan=\"6\" style=\"background:#ccccff;\" | The Elder Dragon Saga\n|-\n| Guild Wars 2\n| Base Game\n| colspan=\"2\" |Launch Release\n|August 28, 2012\n|\n* 8 story chapters.\n* Fully free-to-play\n|-\n| rowspan=\"5\" |Living World Season 1\n| rowspan=\"5\" |Living World\n| colspan=\"2\" |S1E1: Flame and Frost\n|April 19, 2022\n| rowspan=\"5\" |\n* 5 episodes.\n* 1 Strike Mission (raid-style encounter)\n* Originally released in 20 temporary, bi-weekly instalments between November 2012 – March 2014, later re-released through 5 replayable episodes in 2022.\n* Fully free-to-play\n|-\n| colspan=\"2\" |S1E2: Sky Pirates\n|May 24, 2022\n|-\n| colspan=\"2\" |S1E3: Clockwork Chaos\n|July 19, 2022\n|-\n| colspan=\"2\" |S1E4: Tower of Nightmares\n|September 13, 2022\n|-\n| colspan=\"2\" |S1E5: ''Battle for Lion's Arch\n|November 8, 2022\n|-\n| rowspan=\"8\" |Living World Season 2\n| rowspan=\"8\" |Living World\n| colspan=\"2\" |S2E1: Gates of Maguuma\n|July 1, 2014\n| rowspan=\"8\" |\n* 8 Episodes.\n|-\n| colspan=\"2\" |S2E2: Entanglement\n|July 15, 2014\n|-\n| colspan=\"2\" |S2E3: The Dragon's Reach: Part 1\n|July 29, 2014\n|-\n| colspan=\"2\" |S2E4: The Dragon's Reach: Part 2\n|August 12, 2014\n|-\n| colspan=\"2\" |S2E5: Echoes of the Past\n|November 4, 2014\n|-\n| colspan=\"2\" |S2E6: Tangled Paths\n|November 18, 2014\n|-\n| colspan=\"2\" |S2E7: Seeds of Truth\n|December 2, 2014\n|-\n| colspan=\"2\" |S2E8: Point of No Return\n|January 13, 2015\n|-\n| Guild Wars 2: Heart of Thorns\n| Expansion\n| colspan=\"2\" |Launch Release\n|October 23, 2015\n|\n* 17 story chapters\n* Introduces gliding\n* 4 raid wings (15 encounters)\n* Purchased in a bundle with Guild Wars 2: Path of Fire\n|-\n| rowspan=\"6\" |Living World Season 3\n| rowspan=\"6\" |Living World\n| colspan=\"2\" |S3E1: Out of the Shadows\n|July 26, 2016\n| rowspan=\"6\" |\n* 6 episodes\n* Requires Heart of Thorns expansion to purchase\n|-\n| colspan=\"2\" |S3E2: Rising Flames\n|September 20, 2016\n|-\n| colspan=\"2\" |S3E3: A Crack in the Ice\n|November 21, 2016\n|-\n| colspan=\"2\" |S3E4: The Head of the Snake\n|February 8, 2017\n|-\n| colspan=\"2\" |S3E5: Flashpoint\n|May 2, 2017\n|-\n| colspan=\"2\" |S3E6: One Path Ends\n|July 25, 2017\n|-\n| Guild Wars 2: Path of Fire\n| Expansion\n| colspan=\"2\" | Launch Release\n|September 22, 2017\n|\n* 16 story chapters\n* Introduces mounts (Raptor, Skimmer, Springer, Jackal, Griffon).\n* 3 raid wings (12 encounters)\n* Purchased in a bundle with Guild Wars 2: Heart of Thorns\n|-\n| rowspan=\"6\" |Living World Season 4\n| rowspan=\"6\" |Living World\n| colspan=\"2\" |S4E1: Daybreak\n|November 28, 2017\n| rowspan=\"6\" |\n* 6 episodes\n* 2 new mounts (Roller Beetle, Skyscale)\n* Requires Path of Fire expansion to purchase\n|-\n| colspan=\"2\" |S4E2: A Bug in the System\n|March 6, 2018\n|-\n| colspan=\"2\" |S4E3: Long Live the Lich\n|June 26, 2018,\n|-\n| colspan=\"2\" |S4E4: A Star to Guide Us\n|September 18, 2018\n|-\n| colspan=\"2\" |S4E5: All or Nothing\n|January 8, 2019\n|-\n| colspan=\"2\" |S4E6: War Eternal\n|May 14, 2019\n|-\n| rowspan=\"10\" |The Icebrood Saga (Living World Season 5)\n| rowspan=\"10\" |Living World\n| colspan=\"2\" |Prologue: Bound by Blood''\n|September 17, 2019\n| rowspan=\"10\" |\n* 6 episodes (including one Prologue episode and one 'Visions of the Past' mission)\n* 7 Strike Missions (raid-style encounters)\n* Requires Path of Fire expansion to purchase\n|-\n| colspan=\"2\" |S5E1: Whisper in the Dark\n|September 17, 2019\n|-\n| colspan=\"2\" |S5E2: Shadow in the Ice\n|January 28, 2020\n|-\n| colspan=\"2\" |Visions of the Past: Steel and Fire\n|March 17, 2020\n|-\n| colspan=\"2\" |S5E3: No Quarter\n|May 26, 2020\n|-\n| colspan=\"2\" |S5E4: Jormag Rising\n|July 28, 2020\n|-\n| rowspan=\"4\" |S5E5: Champions\n|Chapter 1: Truce\n|November 17, 2020\n|-\n|Chapter 2: Power\n|January 19, 2021\n|-\n|Chapter 3: Balance\n|March 9, 2021\n|-\n|Chapter 4: Judgement\n|April 27, 2021\n|-\n| rowspan=\"4\" | Guild Wars 2: End of Dragons\n| rowspan=\"4\" | Expansion\n| colspan=\"2\" |Launch Release\n|February 28, 2022\n| rowspan=\"4\" |\n* Introduces fishing and skiffs\n* 18 story chapters\n* 2 post-launch releases, and one 'interlude' story instance\n* 4 Strike Missions (raid-style encounters)\n* 1 new mount (Siege Turtle)\n|-\n| colspan=\"2\" |Release 1: What Lies Beneath\n|February 28, 2023\n|-\n| colspan=\"2\" |Release 2: What Lies Within\n|May 23, 2023\n|-\n| colspan=\"2\" |Interlude: Forward\n|June 27, 2023\n|-\n! colspan=\"6\" style=\"background:#ccccff;\" | Post-Elder Dragon Saga\n|-\n| rowspan=\"4\" |Guild Wars 2: Secrets of the Obscure\n| rowspan=\"4\" |Expansion\n| colspan=\"2\" |Launch Release\n|August 22, 2023\n| rowspan=\"4\" |\n* 3 post-launch releases\n* 2 Strike Missions (raid-style encounters)\n|-\n| colspan=\"2\" |Release 1: Through the Veil\n|November 7, 2023\n|-\n| colspan=\"2\" |Release 2: The Realm of Dreams\n|February 27, 2024\n|-\n| colspan=\"2\" |Release 3: The Midnight King\n|May 21, 2024\n|-\n| rowspan=\"4\" |Guild Wars 2: Janthir Wilds\n| rowspan=\"4\" |Expansion\n| colspan=\"2\" |Launch Release\n|August 20, 2024\n| rowspan=\"4\" |\n* Introduces player housing\n* 1 raid wing (3 encounters)\n* Overhaul of Warclaw mount\n|-\n| colspan=\"2\" |Release 1: Godspawn\n|November 19, 2024\n|-\n| colspan=\"2\" |Release 2: Repentance\n|March 11, 2025\n|-\n| colspan=\"2\" |Release 3: Absolution\n|June 3, 2025\n|-\n| rowspan=\"4\" |Guild Wars 2: Visions of Eternity\n| rowspan=\"4\" |Expansion\n| colspan=\"2\" |Launch Release\n|28 October 2025\n| rowspan=\"4\" |\n* 8 Story chapters available upon launch\n* 4 New maps (2 available upon launch)\n* 9 New elite specializations\n|-\n| colspan=\"2\" |Release 1: TBA\n|TBA\n|-\n| colspan=\"2\" |Release 2: TBA\n|TBA\n|-\n| colspan=\"2\" |Release 3: TBA\n|TBA\n|}\nDevelopment\nThe decision to start creating Guild Wars 2 began in a design meeting for Guild Wars Utopia, back when the company was releasing campaigns on a sixth-month development cycle. The team realised that they would not be able to do everything they wanted within the constraints of the scope that they had previously defined for campaigns and the limited amount of time available to them, and at the behest of Jeff Strain, found themselves discussing how the continued addition of features and content in stand-alone campaigns was leading to more bloated tutorials and difficulty in balancing the ever-increasing number of skills. Eventually, the discussion evolved into a blueprint for an entirely new game.\nWork on Guild Wars 2 began in 2007. It was announced March 27, 2007 to coincide with the announcement of the final Guild Wars expansion, which was designed to act as a bridge, in both gameplay and story terms, to Guild Wars 2. The development team abandoned the early open alpha and beta testing which they had used for the Guild Wars game. ArenaNet considered that player expectations for open beta tests of MMORPG had changed, and the beta was no longer used to test the game but to trial a nearly finished game prior to purchase. Beta tests scheduled for 2008 were cancelled to ensure Guild Wars 2 had maximum impact and appeal to these players. Guild Wars 2 uses a heavily modified version of the proprietary game engine developed for Guild Wars by ArenaNet. The modifications to the engine include real-time 3D environments, enhanced graphics and animations and the use of the Havok physics system. The developers say the engine now does justice to the game's critically acclaimed concept art, and that concept art will be integrated into the way the story is told to the player.\nIn August 2009, two years after the game was first announced, ArenaNet decided the game had reached a state where they were happy to show it to the public. A trailer which mixed animated concept art and in-game footage was released at Gamescom, followed by interviews expanding on the lore of the game world and information about the player races.\nIn November 2009, NCsoft CEO Jaeho Lee stated the game would most likely not release until 2011, but a closed beta would be made available in 2010. The Q4 2009 shareholders notes further supported this when the CEO stated that \"the current development target was the end of 2010 but, Guild Wars 2 likely won't be released until 2011.\" A playable demo of the game was made available at Gamescom (August 19–22, 2010), Penny Arcade Expo (September 3–5, 2010) and Paris Games Week (October 27-November 1, 2010). The game was developed for Microsoft Windows with a \"very small team\" investigating the possibility of a console version.\nArenaNet conducted small closed alpha and beta tests in 2011. On January 23, 2012, it was announced that Guild Wars 2 will ship this year. In February, select press were invited to participate in beta testing. In March and April, the size of beta tests was increased significantly as the beta was made available to anyone who pre-purchased the game. On June 28, 2012, ArenaNet announced the game would be released on August 28, 2012, and those who prepurchased the game would be able to play on August 25.\nOn September 18, 2012, a beta release for the Mac OS X client for Guild Wars 2 was issued. Support for the Mac OS version of Guild Wars 2 however was subsequently withdrawn in 2021, due to the discontinued support on the Mac OS for OpenGL rendering.\nPost-launch development\nGuild Wars 2 originally received content updates every two weeks, but now plans large releases every few months, with smaller patches and bug fixes between these. Content updates regularly contain new items available for purchase in the gem store, as well as offering unique events for players to engage in.  Some content updates introduce new mechanics to the game, such as the addition of new dungeons or the introduction of new combat options.\nIn the Lost Shores content updates released on November 16, 2012, a new dungeon was added to the game. Called Fractals of the Mists, the new dungeon differs from other dungeons in the game by consisting of many smaller \"mini-dungeons\" called Fractals. Each fractal contains its own story and environment, and must be completed in order to move on to the next randomly chosen fractal.  Once three fractals are completed, a new set of fractals is unlocked that offer a greater challenge than the last. This update also introduced a new rarity level for equipment called Ascended which can be acquired through various sources, though most easily through the Fractals of the Mists dungeon.\nIntroduction of the Living World\nThe Flame and Frost: Prelude update released on January 28, 2013, introduced several new features to Guild Wars 2, including achievement laurels, guesting and new \"living story\" content.  Achievement laurels are rewarded for earning daily and monthly achievements, and may be used by players to purchase items from certain vendors such as Ascended equipment and infusions for that equipment. Guesting was introduced to allow players to temporarily play on the same server as their friends, without having to transfer their home to a new server. In conjunction with this new feature, a gem fee was added for players wishing to transfer their home to another server. The final new feature added during this update was the introduction of Living Story content. The living story in Guild Wars 2 consists of a series of events and other content that players must progress through within a certain amount of time. Once this time has passed, the story progresses and new content is unlocked while the previous content becomes unavailable, though the story's effect on the world remains. Living World content is intended to provide a continuing story thread for players to follow.\nThe two following content updates, Flame and Frost: The Gathering Storm and Flame and Frost: The Razing, released in February and March 2013 respectively added guild missions, introduced a new progression system for  Guild Wars 2s WvW game mode, progressed the Flame and Frost living story narrative and introduced content that set up story elements for future living story narratives. Guild missions introduced the ability for guilds to earn guild merits by engaging in bounties and group puzzles Guild leaders can use merits to unlock rewards for their guild. The new WvW progressions system introduced World XP and new WvW ranks, which can be used to unlock new titles and abilities exclusive to WvW. New WvW achievements were also introduced.\nThe Flame and Frost: Retribution update released in April 2013 introduced a new limited availability dungeon, new guild missions, added further new WvW abilities and added new purchasable siege weapons and guild banners for WvW play. The new dungeon, Molten Weapons Facility, coincided with the final portion of the Flame and Frost living story narrative and was only available for thirteen days.\nIntroduced in May 2013, the next content update for Guild Wars 2 began a new living story narrative called The Secret of Southsun, which would continue later in the month with a smaller update titled Last Stand at Southsun. In addition to the new living story content, the update introduced another large set of changes to WvW, including the ability for players to set traps in WvW battlegrounds, improvements to the World XP system, improved rewards and new abilities, improvements to the matchup system and the ability for players to use special Ascended and infused equipment in WvW play.\nIn June 2013, two new content updates titled Dragon Bash and Sky Pirates of Tyria introduced a new living story narrative as well as several new features. These features included improvements to the PvP leaderboards, the introduction of the Authorized Shoutcaster Program, the ability for players to purchase items from the gem store as gifts for other players, a large balance update to the game's skills and traits, custom arenas for structure PvP, a new spectator mode and a new ability for players to master in WvW play.\nThe next update was released on July 9, 2013, titled Bazaar of the Four Winds.  The largest new feature added in the update was an account-wide achievement system that allows players to unlock rewards based on how many achievement points have been earned.  In addition, the update overhauled the achievement interface, introduced a new structured PvP map, and introduced a new WvW mastery.\nOver the rest of 2013, the updates Cutthroat Politics, ''Queen's Jubilee, Clockwork Chaos, Super Adventure Box: Back to School. Tequatl Rising, Twilight Assault, Blood and Madness, Tower of Nightmares, The Nightmares Within, Fractured, and A Very Merry Wintersday were released, updating and changing many areas and game mechanics throughout the world. Many of these changes were permanent, leaving a mark on the world to show an event had occurred. Updates included redesigning a boss, adding new paths to Dungeons, and rebalancing playable classes over time.\n2014 brought the end of \"Season 1\" of the Living Story content updates, The Origins of Madness, The Edge of the Mists, Escape from Lion's Arch, Battle for Lion's Arch, and the finale Battle for Lion's Arch: Aftermath ''. These updates released a new WvW map, and destroyed the core city of the game's world, Lion's Arch, while setting up the story for the eventual Season 2 of the Living Story.\nDuring the down time between Seasons 1 and 2, the April 2014 Feature Pack was released, overhauling the Trait system, the Dyes system, the Cosmetic Wardrobe system, PvP equipment, and the way server load was handled via a system called Megaservers. This created world instances for all players, regardless of their home \"world\", to allow the game to feel more populated. The feature pack also fixed numerous bugs and offered balance tweaks to many races and classes.\nOn May 20, 2014, around the time of the Chinese servers release, the update Festival of the Four Winds was released, allowing players to access content from two prior patches, ''Queen's Jubilee and Bazaar of the Four Winds, alongside new activities.\nLiving World Season 2\nin Cologne, Germany]]\nOn July 1, 2014, Season 2 of the Living World began with the Gates of Maguuma release, which added a portion of a new explorable area, Dry Top, and changed the way Living World releases worked, no longer making them time-gated to complete. This was followed by Entanglement on July 15, 2014, which added more explorable sections to Dry Top, and added more achievements, new weaponry for players, and a new story segment.\nOn July 29, 2014, The Dragon's Reach: Part 1'' was released. This was the first in a two-part set of releases. This updated added a few more rewards to the Dry Top zone, added a few new items and achievements, and added some new events to various zones across the game's world. On August 12, 2014, the second part, ''The Dragon's Reach: Part 2'' was released, concluding part one of the second season of the Living Story and starting a several month hiatus on Living Story content. This update added the final new section to the Dry Top map, new rewards and events, new achievements, and game balances.\nOn September 9, 2014, the second Feature Pack was released, significantly changing and improving the Combat Log, the Black Lion Trading Post, and the New Player Experience, while adding a new type of Achievement called collections, adding a number of changes to the World Versus World gametype, improving the Wardrobe and miniature pets displays, and making a number of rebalances and changes to the game's professions.\nOn October 15, 2014, the previous year's Halloween event, Blood and Madness was re-released with a few new events and rewards.\nThe Living World's second season continued on November 4 with the release Echoes of the Past, which included a lengthy new story segment focusing on the story of Glint and her Dragon Egg among other things, an entire brand new map called The Silverwastes which added WvW mechanics in a PvE environment and including a number of new rewards and collections included an earnable Luminescent Shoulderguard armor piece. This was followed by Tangled Paths released on November 18, 2014, which added a new story segment, a few new rewards including another Luminscent armor piece, and an underground section to the Silverwastes map.\nOn December 2, 2014, the seventh release in Season Two was released, called Seeds of Truth, which contained a new story instance, a large underground addition to the Silverwastes map which nearly doubled the map's size, a number of improvements to PvP and associated matchmaking, and two new Luminescent armor pieces for players to earn. This was followed on January 13, 2015, by Point of No Return, the final eighth and final episode in Season 2. This update included several new story instances, a brand new large group boss, two new Luminescent armor pieces for players to earn, and a number of new achievements, among other things. This episode serves to lead directly into the first expansion, Heart of Thorns.\nHeart of Thorns expansion\nOn January 24, 2015, at PAX South held in San Antonio, ArenaNet announced the first expansion for the game titled Heart of Thorns. The expansion introduced new group challenges, new profession specializations, a new profession, and an account-based \"mastery\" system for character progression through the new territories featured in it, as well as changes to current player versus player content. It was released on October 23, 2015, to positive reviews.\nWith the second of the Living World seasons over, and an expansion on the way, releases were smaller as teasers for the expansion were released. On January 27, 2015, a number of bug fixes and balance improvements were released. Following that, a small scale Festival was released on February 10, 2015, called the Lunar New Year. This update included a relaunch of an older activity called Dragon Ball, featuring reworked gameplay, as well as new Daily Lunar New Year achievements, and new rewards.\nOn August 29, 2015, the base game was made free to download. The free version of the game includes some restrictions over the core game, such as fewer character slots and some chat limitations.\nLiving World Season 3\nThe first episode of the 3rd season of the Living World was announced on July 12, 2016. Entitled Out of the Shadows, it was released on July 26, 2016, containing a new story instance and map with related achievements, a new PvP map with related achievements, a new fractal, some tweaks to the PvP and WvW game modes, and a number of balance changes.\nPath of Fire expansion\nGuild Wars 2: Path of Fire is the second expansion pack for Guild Wars 2. It was made available for pre-purchase on August 1, 2017, and released on September 22, 2017. The expansion introduces new features such as mounts, additional elite specializations for each profession, a bounty system for defeating certain enemies, and access to the areas of the Crystal Desert and Elona (first seen in the first game's Guild Wars Nightfall expansion). It will also introduce new raids and season four of the living world storyline.\nLiving World Season 4\nLiving World Season 4 refers to a schedule of content updates, beginning on November 28, 2017. It continues the story of Guild Wars 2: Path of Fire, picking up immediately where the story instance Small Victory (Epilogue) left off. It included six new open world zones, new mounts, raids, fractal dungeons, as well as new PvP arenas. The story tells the consequences of the Path of Fire events and a new threat from the Elder Dragon of Crystal and Fury.\nThe Icebrood Saga\nThe Icebrood Saga is the fifth Living World series of content and story releases. It was announced at PAX West 2019 with a live presentation at Moore Theater in Seattle, Washington on August 30, 2019. Announced features included new playable zones with expansive meta-events, a new fractal dungeon, as well as new types of instanced content, Strike Missions and Dragon Response Missions. The new story chapters focus on the norn and the charr as they defend their homelands from the threat of the Elder Dragon of Ice and Persuasion.\nEnd of Dragons expansion and new release format\nThe third expansion was announced on March 12, 2020. The name, Guild Wars 2: End of Dragons, and a teaser trailer were revealed on August 25, 2020. It was made available for pre-purchase on July 27, 2021, and then released on February 28, 2022. It includes a new story and maps set in the southern region of Cantha (first seen in the first game's Guild Wars Factions expansion), additional elite specializations for each profession, the first multiplayer mount, skiffs, fishing, challenging Strike Missions, as well as additional mastery types. On March 22, it was announced that End of Dragons had outsold the previous expansion Path of Fire, with the active player count more than doubling over the last three years.\nIn February 2023, it was announced that future Guild Wars 2 expansions and content would be adopting a new release model, with the aim of providing more support for popular game modes and making frequent quality-of-life improvements to core gameplay systems such as professions. Instead of launching an expansion every two to four years with a season of Living World in between, smaller expansions would be released more frequently at a slightly reduced price. Additional content for these expansions would then be added through quarterly updates.\nThe first release in the End of Dragons expansion cycle was released on February 28, 2023, exactly one year after the initial End of Dragon's release. It brought with it a new open-world map and additional story chapters.\nSteam release\nOn August 16, 2022, it was announced that Guild Wars 2 will be releasing on Steam as part of the game's 10th year anniversary celebration.  Steam players are able to experience the core Guild Wars 2 game for free (with the same restrictions applied to free accounts created on GuildWars2.com), with options to upgrade to Guild Wars 2: Heart of Thorns, Guild Wars 2: Path of Fire, and Guild Wars 2: End of Dragons from day one. A separate 'Complete Collection' bundle that includes all three expansions and Living World Seasons 2 through 5 for one price was also made available. The game was released on Steam on August 23, 2022.\nSecrets of the Obscure expansion\nA fourth expansion alongside future 'post-End of Dragons story updates' was announced on March 22, 2022. On June 27, 2023, the name of the expansion, Secrets of the Obscure was announced. The expansion centered on the Wizard’s Tower, a long-standing mystery in Guild Wars lore, and the introduction of the Wizard Court, an ancient secretive organization battling incursions of creatures from the Mists. It was released on August 22, 2023. The expansion introduced new features, such as the Relic system for character customization and two new vertical exploration zones, Skywatch Archipelago and Amnytas. Updates to gameplay mechanics included streamlined access to elite specializations and revisions to existing content like Strike Missions. ArenaNet adopted a new release model, providing smaller, regular updates to expand upon the initial launch.\nFollowing the launch release, the game received 3 addiotional large additional content updates, which continued the expansion story and added an adiditonal zone, Inner Nayos. Critics noted the expansion’s emphasis on post-launch support and its integration of gameplay mechanics with narrative themes.\nJanthir Wilds expansion\nThe fifth expansion, titled Janthir Wilds was released on August 20, 2024. It was officially revealed on June 4, 2024, and released on August 20, 2024. The expansion introduces the uncharted region of Janthir, a land steeped in the history of the Mursaat and their White Mantle followers.\nKey features of the expansion include the introduction of Homesteads, a customizable player housing system, and the addition of spears as a new terrestrial weapon type for all professions. Two new open-world maps were added at launch, with additional maps and story content released in quarterly updates. The expansion also features new group content, including the first new raid wing since Guild Wars 2: Path of Fire and fractals, as well as updates to the Warclaw mount and new masteries.\nVisions of Eternity expansion\nA sixth expansion for Guild Wars 2 was announced on July 15, 2025, titled Visions of Eternity, set to launch on October 28, 2025. The new expansion will focus on the mysterious island of Castora, long thought to be inaccessible, and the covert operations of the Inquest seeking its secrets. The expansion will feature two new open-world regions at launch, with two additional maps to be released throughout the year. Visions of Eternity will introduce new elite specializations for all nine professions for the first time since End of Dragons, featuring all new trait lines and mechanics, though this time without the ability to use a new weapon. The expansion will also enhance the skimmer mount with updated abilities. The expansion promises a year of story chapters and three major content updates, similar in structure to previous expansions Secrets of the Obscure and Janthir Wilds.\nAs a part of the announcement, it was it was announced that in a future game update in 2026 that raids and strikes will be unified under a streamlined structure, aiming to improve accessibility of the game modes for new players.\nReception\n| CVG = 8.9/10\n| G4 = 5/5\n| GSpot = 9.0/10\n| GSpy =\n| GRadar =\n| IGN = 9/10\n| PCGUS = 94%\n}}\nGuild Wars 2 was released to universal acclaim. It received a score of 90/100 on Metacritic.\nPC Gamers Chris Thursten gave the game a 94% rating, calling it \"an accomplished and rewarding online RPG that does a great deal to reclaim the promise of its genre.\" IGNs Charles Onyett rated the game a 9/10, commenting that the game is \"one of the most exhaustively detailed and rewarding MMOs in existence, one that never unfairly penalizes and fosters an incredible urge to explore through a generous reward system and achingly pretty environment design\". GameSpots Kevin VanOrd opened his review with \"Guild Wars 2 is a paradise for explorers and thrill-seekers alike, and the best online role-playing game in years\" and gave the game a 9.0/10. Computer and Video Games Games Editor Andy Kelly gave a verdict of 8.9/10 closing with \"An entertaining MMO that combats the dreaded grind with smart design. The lack of a monthly subscription fee only sweetens the deal.\" GamesRadars Hollander Cooper wrote in his review, \"Everything a massively-multiplayer online RPG should be. It's original, massive in scope, and wonderfully social, removing many of the gates that held back the genre in the past. Being able to play with friends regardless of level or class is a gigantic leap forward, and one that, when mixed in with all of the other innovations in the genre, make Guild Wars 2 one of the best MMOs currently available.\" and giving it 4.5/5 and GameSpys Leif Johnson wrote, \"To Guild Wars 2s credit, its issues do little to detract from the immensely rewarding experience of the whole. It doesn't overthrow the conventions of the MMORPG, but it presents them in fresher and livelier packaging than its competitors.\"\nTime listed Guild Wars 2 as the top video game of 2012. Editor Matt Peckham noted that \"Guild Wars 2 is one of those rare games that unexpectedly knocks your life off-kilter, like a meteoroid banging into a satellite\"... [It has] the feel of a living world, and the sort of compulsive anywhere-you-go playability other MMOs only dream of.\"\nDuring the 16th Annual D.I.C.E. Awards, the Academy of Interactive Arts & Sciences nominated Guild Wars 2 for \"Role-Playing/Massively Multiplayer Game of the Year\".\nReferences\n}}\nExternal links\n* [https://www.guildwars2.com/en/ Official website]\n* [https://wiki.guildwars2.com/ Official wiki]"
    }
  ]
}