{
  "content": [
    {
      "type": "text",
      "text": "# Guitar Hero: Warriors of Rock__disambig_1\n\n| publisher = Activision\n| series = Guitar Hero\n| platforms = PlayStation 3, Wii, Xbox 360\n| released =\n| genre = Rhythm\n| modes = Single-player, multiplayer\n}}\nGuitar Hero: Warriors of Rock is a 2010 rhythm game developed by Neversoft and published by Activision. It is the sixth main installment, the eleventh overall installment in the Guitar Hero series and the final title in the Guitar Hero series to be developed by Neversoft. The game was released in September 2010 for PlayStation 3, Wii, and Xbox 360. Like the previous entries in the series, it is geared towards playing in a four-person band experience, including lead and bass guitar, drums, and vocals. The game is available as a standalone title, allowing players to use existing compatible instrument controllers, and as a bundle that provides these controllers.\nWarriors of Rock shares core gameplay elements with its predecessors, but introduced a new story mode in which the player must recruit eight characters—each with a unique ability that modifies the mechanics of the game—to help defeat an antagonist known as \"The Beast\". The storyline also incorporated Rush's seven-part \"2112\", as well as \"Sudden Death\", a new song performed by Megadeth to serve as its culmination (the song would later be included in Megadeth's following album, TH1RT3EN). Warriors of Rock carried over core gameplay and multiplayer functionality introduced by Guitar Hero 5, including per-song bonus challenges and the ability to use power-ups from the story mode in standard gameplay.\nWarriors of Rock received mixed to positive reviews from gaming journalists: while critics felt that Warriors of Rock would appeal best to long-time fans of the Guitar Hero franchise, some felt that the overall soundtrack was weaker than that of past installments due to its lack of focus and use of lesser-known songs and artists. The game's \"Quest Mode\" was met with a similarly mixed reaction, with some critics considering it a notable change over the career modes of previous Guitar Hero games and praising certain highlights, such as the \"2112\" segment, but criticizing the pacing of the storyline and how its songs were organized.\nSales of Guitar Hero: Warriors of Rock were weaker than those of Guitar Hero 5, with combined sales of the game and DJ Hero 2 through the end of 2010 being 63% lower than the sales of Guitar Hero 5, DJ Hero and Band Hero through the end of 2009.  Initial shipments of Warriors of Rock were also bundled with a copy of Soundgarden's compilation album Telephantasm; based on its distribution with copies of the game, Telephantasm became the first album to receive a Platinum certification from the Recording Industry Association of America based on distribution alongside a video game. As a result of the underwhelming sales, also credited to the oversaturation of the music game market, the Guitar Hero series was put on hiatus until the release of the 2015 reboot, Guitar Hero Live.\nGameplay\nAs with previous games in the series, Guitar Hero: Warriors of Rock is a rhythm game, allowing up to four people play in a band on vocals, lead and bass/rhythm guitar, and drums, to use special instrument controllers to simulate the playing of rock music. In general, the goal for each player is to match scrolling note gems that correspond to that instrument's part in the given song to score points; the guitar and bass player must hold down the appropriate colored buttons on the controller and then use the strum bar as the notes pass over a marked zone; the drummer must strike the matching drum pads on the controller when the notes pass, and the vocalist must match the relative pitch of the song's lyrics as guided by phrase markers. Successfully striking notes earns points and boosts the player's performance meter; missing notes will cause this meter to drop. When playing by one's self, if the performance meter should empty, the song will end and require the player to restart it; when playing in a band, the remaining band members must play well enough for a limited time to \"revive\" a player that has fallen out due to an empty performance meter, or else the whole band will fail the song. Prior to the start of a song, each player can select one of five difficulty levels: Beginner, Easy, Medium, Hard, and Expert, with a sixth difficulty of Expert+ available to some songs on the drums which introduces a double bass pedal. Harder difficulties have characters with high note densities and more difficult playing techniques; each player can select their own difficulty to play.\nFor guitar and bass players, the players are given the opportunity to play single notes or chords, both as single notes or sustained, during which the players must continue to hold down the fret button(s) for the extent of the sustain. Some charts provide the ability to hold down one sustained note via its fret button while strumming additional notes. Warriors of Rock also provides simulated hammer-ons and pull-offs, where, after striking one note, specifically marked notes can be played by fingering the correct buttons but without strumming. There are also note portions of some songs where notes appear semi-transparent relative to normal notes; these notes, introduced in Guitar Hero World Tour, can be played simply by tapping the correct buttons on the controller without strumming or using a touch-sensitive \"slider bar\" below the fret buttons, if the player is using a World Tour controller.  Bass players can play open chords by strumming without holding any fret buttons. Warriors of Rock introduces sustained open chords for bass players, although unlike other sustainable notes, does not require you to hold down the button required to execute the note initially. Drum players, when using velocity-sensitive drum kits, may be presented with both ghosted notes or notes with a shield icon over them; these represents drum notes that should be struck softer or harder than normal, respectively, to score more points. Drum players can also attach a second bass drum pedal, necessary for certain songs in the \"Expert+\" difficulty.\nIf the player successfully matches a number of consecutive notes correctly, they boost their individual scoring multiplier up to a maximum 4x value; missing a note will reset to the multiplier back to 1x. Throughout each song's respective charts for the instruments are special highlighted phrases; completing all the notes in this phrase, and for guitar/bass players, using the whammy bar on marked sustained notes, fills part of a Star Power meter. When this meter is at least half full, the player can activate Star Power by performing special actions on their controllers: either tilting the guitar controller upward briefly or pressing the Star Power activation button for guitar and bass; striking two pads simultaneously on the drums; and either double tapping the microphone or pressing one of the buttons on the game console's regular controllers for vocals. When Star Power is activated, the overall band scoring multiplier is increased for a limited time until the Star Power meter is drained. After completing a song, the band is awarded a number of stars based on the overall score; in normal modes for Warriors of Rock, up to six stars can be earned; the final being achievable only through zero misses and zero extra strums.\nA major addition in Warriors of Rock is the use of special powers that come from special \"warrior\" forms of pre-defined characters that are unlocked through the game's Quest mode. These powers alter certain aspects of the core gameplay; one character allows for the Star Power multiplier to boost up to six times instead of just double, while another earns the player a star for maintaining a scoring multiplier above a certain target for a length of time.  When these powers are active, the players can earn well beyond five stars on a score either due to higher scoring opportunities or stars rewarded by the power, with a maximum of 40 stars available for each song.\nGame modes\nAs with previous iterations of Guitar Hero, Warriors of Rock provides a career mode called \"Quest Mode\" that progresses through each of the on-disc songs. Quest Mode is centered on a story-telling element narrated by Gene Simmons, where the player must help save the Demigod of Rock from a mechanized creature called the Beast. To do this, the player must recruit eight characters for the battle against the Beast, each of whom have a unique power that affects gameplay. To recruit a character, the player must perform a number of songs that represent that character's musical genre within a stylistic venue; for example, the first character, the mohawk-wearing Johnny Napalm, has a number of punk songs available, and uses the now-defunct CBGB Club in New York City as his venue. After the player earns a minimum number of stars for that character, that character is transformed into a \"warrior\", boosting their unique power, and is recruited into the player's band.\n's \"2112\" features prominently within Warriors of Rocks Quest mode, including a venue based on Rush's iconic \"Starman\" image.]]\nMidway through the Quest, the players will encounter the legendary ax-guitar that belongs to the Demigod; this section is highlighted by playing through the full seven-part \"2112\" by Rush.  Rush's members, Geddy Lee, Neil Peart, and Alex Lifeson, narrate this section based on the story outlined in the liner notes of the 2112 album.  The \"2112\" section also takes place in special venues inspired by the \"2112\" song, including the cave where the ax-guitar is found, and one highlighting the iconic Starman image. After recruiting all eight characters, the player must divide the characters into two bands to \"fight\" against the Beast as to earn a maximum number of stars from each band's combined powers in order to power the ax-guitar and allow the Demigod to finish the Beast himself. This last battle is set to a new song, \"Sudden Death\" by Megadeth (which would later appear in their album Thirteen, released the following year) and written by their front-man Dave Mustaine specifically for the conclusion of the game, and contains portions that he believed were \"the most difficult parts\" he has written in his life.  When the player has completed the battle with the Beast, they have the opportunity to return to the previous venues, now with all eight powers active simultaneously, and attempt to achieve 40-star performances for each song in the game, as well as a comparatively difficult set of songs with the Demigod himself.\nVideo game journalists have noted thematic similarities between the story details of Warriors of Rock and Brütal Legend, an action video game with a world based on heavy metal, developed by Tim Schafer and Double Fine Productions which Activision, at one point, would have published but later dropped the rights. Project lead Brian Bright commented that their inspiration for the game's story was the covers of metal albums, the same material that led to the world of Brütal Legend.\nIn the game's Quickplay+ mode, players can play any song on-disc or from their downloadable content library. Each song has 13 different achievements to be completed. Twelve are similar to the Challenges introduced in Guitar Hero 5, such as getting a high score, maintain a long note streak, or accumulating an amount of Star Power, and each has 3 levels (gold, platinum, and diamond) that translate to 1 to 3 additional stars once reached. If the player has unlocked the Warrior character powers in the Quest mode, they can enable these powers to try to get up to a maximum of 20 stars (21 for successfully completing the song without missing a note or hitting notes that aren't there) on each song for the thirteenth challenge.  As the player earns stars in this mode, they will advance in rank and gain additional unlockable features such as alternate outfits or guitars and additional venue selections. Party mode introduced in Guitar Hero 5 is also available, where the game will automatically play songs like a jukebox, and allow for players to drop-in or drop-out at any time. The competitive modes introduced in Guitar Hero 5 are also carried over into Guitar Hero: Warriors of Rock, and are expanded to include band-vs-band variants.\nThe Wii version improves the \"Roadie\" game version introduced in Guitar Hero 5. In this mode, up to four additional players with their own Nintendo DS wirelessly connected to the Wii (the \"Roadies\") can assist the other players using instrument controllers. The Roadies can create setlists from the DS, or engage in gameplay through \"spells\" that improve the performance of the player they are assigned to.  Alternatively, in Roadie Battle mode, the Roadies can attempt to distract another player while at the same time removing the distractions placed on their player by another Roadie.  Warriors of Rock includes an improved version of a song creation tool, allowing players to share their songs using the online \"GHTunes\" services. Improvements include the ability to lay down note tracks directly while playing one of the instrument controllers and a larger number of guitar, bass, and drum samples to use. The player can use the built-on GH Studio to create their own music, save for vocals, to share with others on the GH Tracks service, either by laying down tracks one note at a time, or by jamming along to a pre-defined beat. Players can create their own customized rocker to use in Quickplay+ or online modes through the character creator, or use either the regular form or the Warrior version of the eight on-disc characters.\nCharacters\nThere are no characters of real-life musicians in the game due to ongoing legal issues with the likenesses of musician celebrities in Guitar Hero 5 and Band Hero. As such, only eight fictional guitarists are initially featured in the game, two of them being entirely new characters. Each one has a special power that helps the player improve their score. In Quest Mode, the characters must obtain a certain number of \"power stars\" in order to transform into their warrior state, whereupon their power is upgraded into a \"+\" state which either boosts the effect or adds bonus effects. Collecting stars will also unlock additional characters for Quickplay mode, ranging from other past characters to Arthas Menethil from the Warcraft franchise.\nDevelopment\nAfter weak sales in 2009 of several titles in the Guitar Hero series, Activision proceeded to make several changes with their internal development teams. The company dissolved RedOctane, bringing in some of the staff directly into Activision. Activision further shuttered Neversoft's Guitar Hero division, pending the completion of Guitar Hero: Warriors of Rock, with further development in the series to be created by some former Neversoft members and Vicarious Visions. Brian Bright, former Neversoft member and current project lead, noted that part of the poor sales of Guitar Hero in 2009 was a result of a loss of focus with Guitar Hero 5, stating that \"we were trying to please everyone out there and I think in the end you end up not pleasing any one person a lot\". With Guitar Hero: Warriors of Rock, Bright wanted to bring the game back to please the fans of the earlier Guitar Hero games, specifically the highly successful Guitar Hero III: Legends of Rock. To that end, the team developed a soundtrack \"more focused on rock 'n' roll\" than the variety of genres within Guitar Hero 5. The songs are more guitar-centric, as proven to be the most popular instrument choice based on Guitar Hero 5. Bright noted they used player statistics from previous games to shape Warriors of Rock; for example, according to Bright, within a month of release, 40% of the players of Guitar Hero 5 were playing on Expert mode, and felt this was the audience they needed to cater to. Bright also stated that the aim of Warriors of Rock was to create a game with \"its own identity\" from both previous Guitar Hero titles and other rhythm games; \"Rather than go head-to-head with our own games and our competitors, we decided we wanted to make something different.\"\nPart of creating the new identity for Warriors of Rock was by creating the game's Quest mode. Activision contacted Gene Simmons, who initially thought the company was asking for a KISS song to be included in the game. Instead, when Simmons learned they wanted him to be the narrator and the voice of the Demigod, he became very interested in the project feeling that the Demigod character had elements of his own stage personality in it. Activision also approached the members of Rush for inclusion of \"2112\", and the group provided inspiration and feedback on the Rush-themed venues that \"2112\" is played in within the game. The developers also approached Dave Mustaine of Megadeth to write the music for the game's final boss battle.  The Quest mode also gave Activision the opportunity to explore the characters that have been in the series since its inception but otherwise only used as player avatar. The developers were able to expand on these existing designs and gave each one a unique venue and setlist throughout the campaign.\nA new guitar controller was developed for the game to help with \"shredding\" and an art style to match the changes made in the game's visuals. The guitar hardware has been significantly redesigned to locate most of the base electronics and wireless controls into the main fretboard of the unit, containing the colored fret buttons, strum and whammy bar, and other controls for interacting with the game console. As such, this allows the body of the guitar to be swappable with custom designs, allowing players to personalize the control to their wishes; one design was exclusive to those that pre-ordered the game through GameStop. The new guitar controller remains backwards compatible with previous games. Within North America, the new drum kit is also sold individually or in bundles with Warriors of Rock. The kit had previously been packed with Band Hero in the United Kingdom and with the Wii version of Band Hero in North America, but otherwise was not sold separately. The drum kit is MIDI-enabled with a detachable \"drum brain\" allowing other drum kits to be used instead with the game, while the game's kit can be used with any MIDI-capable music editing system. The music video for Soundgarden's \"Black Rain\", is animated by Titmouse, Inc., the same studio that performs the in-game animations for Guitar Hero as well as Metalocalypse, and includes images of a young man playing Guitar Hero using the new guitar controller introduced in Warriors of Rock.\nA demo for the game was released on Xbox Live on September 7, 2010, and features four songs: \"Children of the Grave\" by Black Sabbath, \"No Way Back\" by Foo Fighters, \"Ghost\" by Slash featuring Ian Astbury, and \"Bloodlines\" by Dethklok. On release, some players reported getting faulty discs, which Activision stated they will replace.\nSoundtrack\nThere are 93 songs on disc for Warriors of Rock. According to Bright, all the songs were selected to fit within a narrow set of music genres, \"punk, alternative rock, and classic rock\", to avoid dilution of the game's focus. Bright noted that \"there's still range and still a lot of variety in this game\" to avoid alienating long-time fans of the series in general. The developers also looked at various song structures and considered if they would be fun to play; Bright said that a good song for the game \"would have a memorable riff but not feel repetitive\" and \"would be a good amount of chord changes and, ideally, a fun guitar solo to add to the challenge\". Two songs, Alice Cooper's \"No More Mr. Nice Guy\" and The Runaways' \"Cherry Bomb\", were specifically re-recorded for use in Warriors of Rock. Megadeth's \"Sudden Death\" was specifically written as the final song within Warriors of Rocks setlist; its polyrhythms and difficult passes make it one of the toughest songs to beat. \"Sudden Death\" was nominated, but did not win, for \"Best Metal Performance\" for the 53rd Grammy Awards; this, along with the song \"Baba Yetu\" from Civilization IV and \"Video Games Live\", represents the first time a song composed for a video game has earned a Grammy nomination, with \"Baba Yetu\" continuing to win its award.\nWarriors of Rock supported additional songs through downloadable content that players could purchase on their respective console storefronts.  All previous downloadable content that worked with Guitar Hero 5, including previous content from Guitar Hero World Tour, Guitar Hero: Smash Hits, and Band Hero, will work in Warriors of Rock. More than 500 tracks were available to players at launch. In addition, 39 songs from Guitar Hero: Metallica were importable into Warriors of Rock upon the game's release. In February 2011, Activision decided to shutter their Guitar Hero development, and initially stated that no further downloadable content will be forthcoming.\nInitial shipments of the game were also bundled with a copy of the Soundgarden compilation album Telephantasm; its new song \"Black Rain\" was included among the playable songs included on Warriors of Rock, while the remaining eleven tracks on the album were made available as downloadable content. Because of the album's inclusion with over one million shipped copies of Warriors of Rock, the Recording Industry Association of America certified Telephantasm as a platinum record; it is considered the first time such a distinction has been made based on \"non-returnable units from a music label to a gaming company\" according to Soundgarden's promotional group.\nReception\n(X360) 75.20%(PS3) 74.35%\n| MC = (Wii) 77/100(PS3) 74/100(X360) 72/100\n| IGN = 6/10\n| OXMUK = 6/10\n| GI = 8/10\n| G4 =\n| EuroG = 7/10\n| 1UP = C\n| TG =\n| GSpot = 7.5/10\n| NWR = 7/10\n| Destruct = 7/10\n| VG = 7/10\n| GB =\n| CGM = 7/10\n| GRadar =\n| GameRev = 6/10\n}}\nGuitar Hero: Warriors of Rock received mixed to positive reviews from gaming critics. Most critics acknowledged that Warriors of Rock was an attempt to distance itself from its competitor, the Rock Band series, and a return to the Guitar Hero series' roots. However, in the attempt to redefine the series, some critics thought Warriors of Rock failed to recapture the experience of playing the earlier Guitar Hero games. Arthur Gies of IGN felt the game was \"aimless\", leaving him to question \"why Warriors of Rock is here\". Tyler Cocke of 1UP.com commented that Warriors of Rock \"seems to have forgotten that music games are supposed to be all about having a good time\". Ben Kurchera of Ars Technica considered that Warriors of Rock keeps the series \"treading water\" and lacks \"any real upward movement\", and may have been a step back with how relaxed the game's timing windows have become compared to early Guitar Hero games. Others note that the game can be enjoyable, but only to those that are fans of the series, and is not well-suited to new or casual players. G4's Abbie Heppe found the game \"does an exceptional job of catering to the hardcore audience\" but warns the casual fan that may not enjoy the setlist to simply \"move along\". Matt Helgeson of Game Informer postulated Guitar Hero: Warriors of Rock may have jumped the shark with \"often stupid and frequently silly\" gameplay and visuals, but was still entertained in playing through the game.\nQuest mode, considered the game's largest change, has mixed reception. The use of \"2112\" as a centerpiece in the Quest mode was praised by critics; Johnny Minkley of Eurogamer said that the concept is \"pitch-perfect\" for Warriors of Rock and was \"a clever and enjoyable break from the typically rigid career structure\". Cocke noted that the \"2112\" section feels like \"nice fanservice\" and its length and complexity would not be fun for players uninterested in Rush, while Helgeson felt that the \"awkward recitation\" by the band members were unnecessary. Other aspects of Quest mode were found to be less enjoyable. Gene Simmons's voice-over narration was found \"stilted and awkward\". While the story carried similar heavy metal themes as Brutal Legend, very few of the songs within the game are from that genre; to Cocke, this felt \"like a desperate attempt to gain credibility with too many crowds, but it ends up spreading itself too thin\". The Globe and Mails Chad Sapieha felt that the Quest mode \"simply disguised [the series'] aging career mode\", with the characters' powers being \"hardly satisfying\" and only a means to \"artificially inflate one's score\". After the player has completed the \"2112\" setpiece, the rest of the Quest mode was disappointing; Minkley compared the second half of this mode as a \"disengaging slog to level up the remaining four characters\". Gies felt the \"rigid and often frustrating\" Quest mode led to playing the songs in an order that was \"all over the place in terms of tone, difficulty, and most importantly, fun\". Some reviewers felt the improved Quickplay+ mode to be the highlight of the game; Heppe noted that the mode \"probably seems too basic to be the star of the game, but it really shines\" while Minkley considered that it \"offer[ed] a far stronger reason to replay than the embryonic Quest Mode manages\". Gies' review of the Wii version noted that the Roadie Battles mode exclusive to the Wii version was enjoyable and \"helps the Wii version of the game to stand tall\" to the high-definition console version.\nReviewers found the soundtrack to lack the focus that Activision claims it has, and that the series may have exhausted a number of good guitar songs in its previous iterations. Gies stated that the game soundtrack \"may be the most uneven collection in any of the main Guitar Hero titles\", citing problems with \"a surplus of tracks that seem out of place\", \"too many songs that are just boring to play\", and \"a number of synth heavy songs that are nevertheless shoehorned\" into the game. Official Xbox Magazine UK stated that the setlist \"feels at times uninspired, incongruous and uninteresting\". Helgeson felt the setlist was \"a mixed bag\", with a strong and balanced set of songs in the early tiers of Quest mode, while the latter, more difficult songs were \"terrible and felt like a chore\" to complete. Roger Hargreaves of The Metro commented that \"with so many of the more iconic rock songs having already been used in previous Guitar Hero and Rock Band games developers are forced to use ever more obscure songs and/or acts\". Heppe also considered the lack of iconic song, noting the setlist \"seems like the same bands we always see in [Guitar Hero], just their 3rd tier hits\". On the other hand, USA Todays Mike Snider claimed that the game's soundtrack \"gave [him] a reason to blast music on [his] stereo\", and besides providing well-known songs and bands, introduced him to new bands.\nInitial sales of Warriors of Rock were below estimates. NPD Group reported 86,000 units sold in the United States across all platforms for the last five days of September during which it was available.  This figure fell below the initial sales of the previous games, such as 1.5 million and 500,000 units in first-week sales for Guitar Hero III: Legends of Rock and Guitar Hero World Tour, respectively. Combined sales in North America of Warriors of Rock and DJ Hero 2 were below one million in 2010, 63% below the total sales of Guitar Hero 5, DJ Hero, and Band Hero in 2009. Weak sales of Warriors of Rock, in part, led to Activision shuttering its Guitar Hero business unit in February 2011 and cancelling a planned 2011 sequel. As a result of the closure, no further downloadable content was created following the February 2011 packs.\nNotes\nReferences\nExternal links\n*"
    }
  ]
}