{
  "content": [
    {
      "type": "text",
      "text": "# Gumelnița culture__disambig_2\n\nThe Gumelniţa culture was a Chalcolithic culture of the 5th millennium BC (c. 4700–4000 BC), named after the Gumelniţa site on the left (Romanian) bank of the Danube.\nGeography\n(settlement mound), Romania]]\nThe Gumelniţa culture was part of the broader Gumelniţa-Kodžadermen-Karanovo VI complex. This evolved out of the earlier Boian, and Karanovo V cultures. Gumelniţa-Kodžadermen-Karanovo VI is also aggregated with the Varna culture. The Gumelniţa culture was supplanted by the Cernavodă culture in the early 4th millennium BC.\nPeriodization\n\"One of the most flourishing civilizations from the last half of the 5th millenium BC is (next to the Ariuşd Cucuteni – Tripolie complex) Gumelniţa Culture... absolute chronology, still under discussion, according to the latest calibrated data, assigns this culture (as mentioned above) to the limits of the last half of the 5th millenium BC and maybe to early 4th millenium BC.\" — Silvia Marinescu-Bîlcu, Gumelniţa Culture.\nThis matches the view of Blagoje Govedarica (2004).\nThe first periodization of Gumelniţa culture was suggested by VI. Dumitrescu who split the civilization of Gumelniţa into two phases: A and B. Later on, Dinu V. Rosetti divided the civilization into Al, A2 and B1, B2.\nGumelniţa A\nWith a centric evolution from geographic point of view, the intensity of the cultural trends decreased from the center towards peripheral area. Having a strong Boian background at the origins, mixed with Maritza elements, the Gumelniţa culture lasted short of a millennium from the beginning of the Chalcolithic to the start of the fourth millennium BC.\nGumelniţa A1\n4700–4350.\nGumelniţa A2\n4500–3950. The regional characteristics of A1 phase are diminished, and more uniform characteristics are identified in discovered artifacts.\nSynchronisms\n{| class=\"wikitable\"\n|-\n! Gumelnita Culture\n! Adiacent Culture 1\n! Adiacent Culture 2\n! Adiacent Culture 3\n|-\n| Gumelniţa A1\n| Precucuteni 3\n| Cucuteni A1 – A2\n| Varna 1\n|-\n| Gumelniţa A2\n| Cucuteni A3\n| the beginning of the Cernavoda 1 culture\n|\n|}\nArt\nThe Gumelniţa is remarkable by the richness of its anthropomorphic and zoomorphic representations. Some consider the achievements of prehistoric craftsmen to be true masterpieces.\nThe representation from Gumelnița art differ by other cultures by the following:\n*statuettes morphology characterised by expressivity, gesture and attitude.\n*modelling technique\n*arms positions on the belly, stretched laterally, in the position of the \"thinker\"\n*sex representation\n*decoration pattern\nSeashell ornament is relatively common. At least some of the shellfish used come from the Aegean regions, for example the spondylas and the dentals.\nAs evidence from archaeology, thousands of artifacts from Neolithic Europe have been discovered, mostly in the form of female figurines. As a result a 'mother goddess' theory was proposed. The leading proponent was the archaeologist Marija Gimbutas. This interpretation is still a subject of great controversy in archaeology due to Gimbutas' many inferences about the symbols on artifacts.\nThe analysis of the finds uncovered by archaeological excavations revealed a few characteristics of the Gumelniţa objects of art, likely to lead to a few main trends of the spiritual life investigation.\n\"The prevalence of a female character is clear, as it represents 34% of all the anthropomorphic representations. That might represent a deity, the term having a general significance, of worship, without being able to specify under the current stage of the researches which is the nature and status of this deity. The male representations are very few, about 1%, while about 10% are the asexual representations, therefore with no sign (breasts, sexual triangle) which might point to the sex of the statuette.\" — Gumelniţa Anthropomorphic and Zoomorphic Objects of Art by Radian Romus Andreescu.\nGallery\nFile:Vas-pictat-cu-alb-d87c22.jpg|alt=\nFile:Gumelnita 35.jpg|alt=\nFile:Gumelnita 34.jpg|alt=\nFile:Gumelnita 33.jpg|alt=\nFile:Gumelnita 44.jpg|alt=\nFile:Expozitie Aurul Romaniei MNIR0039.JPG\nFile:Oltenita deity holding pot gurnelnita 4600-3900 mnir.jpg\nFile:Gumelnita 48.jpg|alt=\nFile:Museum für Vor- und Frühgeschichte Berlin 038.jpg|alt=\nFile:情侣陶碗.JPG\nFile:Ceramicaantopomorficagumelnita2.JPG\nFile:Gumelnita 20.jpg|alt=\nFile:Clay vessel fragment with anthropomorphic representation, by Gumelnița Culture, Sultana - Malu Roșu (MGCO).jpg|alt=\nFile:Flat anthropomorphic bone figurines, by Gumelnița Culture, Vidra (BMM), Sultana - Malu Roșu, Sărulești - Măgureni Movilă (MGCO).jpg|alt=\nFile:Gumelnita 11.jpg|alt=\nFile:Gumelnita 9.jpg|alt=\nFile:Gumelnita 59.jpg|alt=\nFile:Gumelnita 1.jpg|alt=\nFile:Gumelnita 31.jpg|alt=|Copper axe\nFile:Gumelnita 25.jpg|alt=\nFile:Gumelnita 63.jpg|alt=\nFile:Gumelnita 28.jpg|alt=\nFile:Ceramic house model - The Museum of Gumelnița Culture 10625.jpg|Ceramic house model\nFile:Gumelnitza IMG 5891.JPG|alt=\nFile:Eneolitico, oggetti vari, V millennio ac..JPG|Gold ornaments\nFile:Sultana gold hoard - The Museum of Gumelnița Culture 8651-8656.jpg|Sultana gold hoard, Romania, c. 4500-4000 BC\nFile:Pandativ de aur din neolitic (idol) (Gumelnita).jpg|Gold ornament\nFile:GumelitaPotteryCover.JPG|Ceramic container lid\nFile:Ceramic designs from Pietrele - Magura, Romania 1.png|Ceramic designs from Pietrele/Magura\nFile:Ceramic designs from Pietrele - Magura, Romania 2.png|Ceramic designs from Pietrele/Magura\nFile:Ceramic designs from Pietrele - Magura, Romania.png|Ceramic designs from Pietrele/Magura\nTechnological developments\nGumelniţa culture has some sign of work specialisation:\n\"We do not have enough data on the internal organization of the community, but next to the dwellings themselves, arranged or not in a certain order, we encounter workshop-dwellings for processing lithic material, bones, horns, ornaments, statuettes, etc.).\" — Gumelniţa Culture by Silvia Marinescu-Bîlcu\nDanube Script\nDuring the Middle Copper Age, the Danube script appears in three horizons: The Gumelniţa–Kodžadermen-Karanovo VI cultural complex (mainly in Bulgaria, but also in Romania), the Cucuteni A3-A4–Trypillya B (in Ukraine), and Coțofeni I (in Serbia). The first, rates 68.6% of the frequencies; the second, rates 24.2%; and the third, rates 7.6%.\nSee also\n*Old Europe\n*Karanovo culture\n*Vinča culture\n*Tărtăria tablets\n*Vinča symbols\n*Sesklo culture\n*Cucuteni–Trypillia culture\n*Hamangia culture\n*Butmir Culture\n*Tisza culture\n*Linear Pottery culture\n*Lengyel culture\n*Funnelbeaker culture\nReferences\nBibliography\n*Stefan Hiller, Vassil Nikolov (eds.), Karanovo III. Beiträge zum Neolithikum in Südosteuropa Österreichisch-Bulgarische Ausgrabungen und Forschungen in Karanovo, Band III, Vienna (2000), .\nExternal links\n*[https://muzeulgumelnita.ro/en/expozitii-permanente/gumelnita-culture Gumelnița culture museum]\n*[https://isaw.nyu.edu/exhibitions/ritual-and-memory/objects/architectural-model-sultana-malu-rosu Architectural model and gold hoard, Gumelnița Culture, 4500-4000 BC, Institute for the Study of the Ancient World]\n*[https://www.dainst.org/forschung/projekte/noslug/2228 Large pithoi of the Gumelnita culture]\n*[https://web.archive.org/web/20110721003045/http://www.brukenthalmuseum.ro/pdf/Biblioteca_Brukenthal/XXXIII/13%20distinguish%20symbols%20a.pdf Brukenthalmuseum.ro]\n*[https://web.archive.org/web/20110813160057/http://civa.uv.ro/Sandu10.1.pdf Civa.uv.ro]\n*[https://web.archive.org/web/20110813155956/http://civa.uv.ro/Ciocan5.1.pdf Civa.uv.ro]\n*[https://web.archive.org/web/20081115152616/http://www.bulgariatravel.org/eng/sights.php?id=15 Bulgariatravel.org]\n*[https://web.archive.org/web/20070116061308/http://www.worldmuseumofman.org/balkanneolithic1.htm Worldmuseumofman.org]\n*[http://www.culture.gouv.fr/culture/arcnat/harsova/en/dobro3.htm Culture.gouv.fr]\n*[http://www.cimec.ro/Arheologie/gumelnita/gumelnita_engl/3arii/4Sudul/Gumelnita_in_%20Dobrogea.htm#com Cimec.ro]\n*[http://www.cimec.ro/arheologie/gumelnita/gumelnita_engl/1Intro/1/index.htm#1 Cimec.ro]\n*[http://arheologie.ulbsibiu.ro/publicatii/ats/ats8%201/merlini%20keyfeatures.pdf Arheologie.ulbsibiu.ro]\n*\n*[https://isaw.nyu.edu/exhibitions/ritual-and-memory/objects/architectural-model-cascioarele Institute for the Study of the Ancient World]"
    }
  ]
}