{
  "content": [
    {
      "type": "text",
      "text": "# Gupta–Saka Wars\n\nRudrasimha IIISridharavarmanRudrasena IIISimhasena\n| date              = 335–413 C.E\n| result            = Gupta–Vakataka victory\n| territory         = * Samudragupta conquered Central India.\n* Chandragupta II conquered western Malwa, Gujarat, Rajasthan and Sindh.\n* The whole of the Kathiawar peninsula was included in the Gupta dominion and the Arabian Sea formed its western boundary.\n| image             = East-Hem 400ad.jpg\n| image_size        = 400px\n}}\nThe Gupta–Saka Wars refers to the military conflict between the Gupta Empire and the Western Satraps during the 4th century CE. Chandragupta II, also known as Chandragupta Vikramaditya, was a prominent ruler of the Gupta Empire during the 4th century CE. His reign is marked by significant military achievements, notably his subjugation of the Western Satraps who ruled in west-central India. Chandragupta II's success against the Western Satraps is attested by a combination of historical and literary evidence.\nPrelude\nCause of War\nChandragupta II, the ruler of the Gupta Empire, expanded his dominion to include the provinces of Kathiawar, Saurashtra and northern Gujarat, in addition to maintaining control over his existing territories. This expansion was driven by various factors, including geographical considerations and economic opportunities. By conquering these regions, Chandragupta II gained access to the ports along the western coast, facilitating direct engagement in lucrative maritime trade with Western countries.\nPorts such as Bharuch played pivotal roles in exporting Indian goods to Western markets, including commodities from Central Asia and China. Despite suggestions of declining trade, historical evidence indicates that commerce between India and the Western nations remained robust during the Gupta period. For instance, records show that Rome possessed ample stocks of oriental goods, including silk and spices, highlighting the flourishing state of Indian trade with the west.\nMoreover, the decline of Rome as a trading hub was compensated by the rise of Constantinople in Byzantium, where the upper classes demanded Oriental goods for their luxury habits. Indian spices were particularly sought after, with Byzantine medical treatises attesting to their availability in the markets of Byzantium. The discovery of Byzantine coins in various parts of India further corroborates the existence of commercial relations between the two regions.\nFurthermore, Iranian merchants monopolized the silk trade with the West, purchasing silk from Indian traders and supplying it to Roman markets. This challenges the notion that Indian silk weavers found it expensive to export their products, suggesting alternative factors for the migration of silk weavers.\nThe westward expansion of the Gupta Empire may also have been motivated by political considerations, particularly the desire to end Scythian rule in western India. Chandragupta II sought to suppress foreign rulers who posed a nuisance to Gupta politics, as evidenced by their attacks on eastern Malwa during the reign of Ramagupta. In response, Chandragupta II aimed to consolidate Gupta authority over western territories, addressing both economic and political objectives through expansionist policies.\nChandragupta II and Vakatakas\nChandragupta II is believed to have arranged the marriage of his daughter, Prabhavatigupta, to Rudrasena II, the Crown Prince of the Vakataka dynasty, to secure a strategic ally during his campaign against the Sakas. The Vakataka king's potential influence in conflicts with the Saka satraps in Gujarat and Saurashtra made this alliance advantageous.However, some scholars question the active involvement of the Vakataka Royal House, particularly under Prithivishena I, during Chandragupta II's western campaign. Prithvishena I, described as a Dharmavijayin, participated in the Deccan campaigns of Samudragupta, but lacked aggressive expansionist policies. The conquest of Kuntala, often credited to the Vakataka dynasty, was actually achieved by a different branch.\nFurthermore, inscriptions depict Prithvishena I as embodying noble virtues rather than ambitious conquest. It is debated whether he posed a significant threat to Chandragupta II's ambitions in the western regions. Overall, while the marriage alliance with the Vakataka dynasty may have been a diplomatic strategy by Chandragupta II, the extent of the Vakataka king's involvement in the Gupta king's western campaign remains subject to scholarly debate.\nThe marriage between Prabhavati and Rudrasena II likely occurred around 380 CE or shortly thereafter, while the conquest of the Saka kingdom took place towards the end of the first decade of the fifth century or later. These events were separated by approximately 20 years, indicating they were not directly connected. However, the matrimonial alliance proved beneficial to the Gupta Empire.\nPrabhavati, known for her strong personality, played a significant role in influencing the policies of the Vakataka court, especially given the amiable temperament of her father-in-law, Prithvishena I, and the weakness of her husband, Rudrasena II. After Rudrasena II's death around 380-385 CE, Prabhavati became the regent for her two minor sons, Divakarasena and Damodarasena, further strengthening Gupta influence. Her regency continued until around 410 CE when Damodarasena assumed the throne as Pravarasena.\nSamudragupta's Aryavarta campaigns\nConquest of Central India by Samudragupta (r. 336–380 CE)\npillar, emblem of Gupta Empire. The name  Sa-mu-dra in an early version of the Gupta Brahmi script, appears vertically under the left arm of the king.]]\n: Some scholars believe that the term \"Shaka-Murundas\" refers to a single entity. For example, scholars such as Sten Konow assert that \"Murunda\" is a Shaka title meaning \"lord\"; the Kushans also used similar titles (for example, Kanishka is titled a \"muroda\" in his Zeda  inscription).\n: Other scholars, such as K. P. Jayaswal, believe that Shakas and Murundas are two different groups of people. According to this theory, Shakas here most probably refers to the Western Kshatrapa rulers of Ujjain. Jayaswal notes that the Puranas mention the rule of 13 Murunda kings, and Hemachandra's Abhidhana-Chintamani describes Murunda as people of Lampaka (in present-day Afghanistan). However, Agrwal points out that these sources are of relatively late origin, and it is possible that a branch of the Shakas had come to be known as \"Murundas\".) mentioned by Samudragupta in the Allahabad pillar (Line 23) probably refer to the Saka ruler Sridharavarman in Central India.]]\nBattle of Eran\n: The exact location of the Shakas mentioned in Samudragupta's inscription is not certain. V. A. Smith identified them with the Western Kshatrapas, who controlled the western Malwa and Saurashtra regions. D. R. Bhandarkar alternatively identified the Shaka-Murunda ruler with Shridhara-varman, a Shaka ruler whose inscriptions have been discovered at Sanchi (Kanakerha inscription) and Eran. Eran then came under the direct control of Samudragupta, as attested by his Eran inscription.\n: The Central Indian region around Vidisha, Sanchi and Eran had been occupied by a Saka ruler named Sridharavarman, who his known from the Kanakerha inscription at Sanchi, and another inscription with his Naga general at Eran. At Eran, it seems that Sridharavarman's inscription is succeeded by a monument and an inscription by Gupta King Samudragupta (r.336-380 CE), established \"for the sake of augmenting his fame\", who may therefore have ousted Sridharavarman's Sakas in his campaigns to the West. Sridharavarman is probably the \"Saka\" ruler mentioned in the Allahabad pillar inscription of Samudragupta, as having \"paid homage\" to the Gupta king, forced to \"self-surrender, offering (their own) daughters in marriage and a request for the administration of their own districts and provinces\".\nRamagupta and Sakas\n(388–395).]]\nRudrasimha III seems to have been the last of the Western Satrap rulers. Samudragupta who was the second great unifier of India, passed away in 375 CE. According to the Sanskrit play called \"Devichandraguptam,\" Samudragupta was succeeded by Ramagupta, who was a weak ruler. The Sakas started a revolt and emboldened by Persian support, revolted against the Guptas. Unskilled in war, Ramagupta was outflanked in a battle and was besieged by the Saka forces. Afterwards, Ramagupta tried to negotiate with the Kshatrapa chief but the chief demanded that the wife or chief queen of Ramagupta, Dhruvadevi to be handed over. This however infuriated his brother, Chandragupta II. According to the Sanskrit writers such as Bāṇabhaṭṭa and Vishakhadatta, Chandragupta II executed his plan by disguising as a woman, entered the Saka chief's tent and slayed him. Subsequently, Ramagupta was overthrown or killed due to an interplay of events and Chandragupta II became the next king.\nChandragupta II's Saka conquests\n(412-413 CE).]]\nDue to the liberations of Kapisa and Gandhara, the Persians allied with the Saka Kshatrapa, who were trying to rid themselves of Indian influence.\nThe Western Satraps were eventually conquered by King Chandragupta II. Inscriptions of a victorious Chandragupta II in the year 412-413 CE can be found on the railing near the Eastern Gateway of the Great Stupa in Sanchi.\nFile:Silver_Coin_of_Chandragupta_II.jpg|Coin of Gupta ruler Chandragupta II (r.380–415) in the style of the Western Satraps.\nFile:Silver_Coin_of_Kumaragupta_I.jpg|Coin of Gupta ruler Kumaragupta I (r.414–455) (Western territories).\nFile:Gupta_Kings._Skandagupta._AD_455-467.jpg|Coin of Gupta ruler Skandagupta (r.455-467), in the style of the Western Satraps.\nFollowing these conquests, the silver coins of the Gupta kings Chandragupta II and his son Kumaragupta I adopted the Western Satrap design (itself derived from the Indo-Greeks) with bust of the ruler and pseudo-Greek inscription on the obverse, and a royal eagle (Garuda, the dynastic symbol of the Guptas) replacing the chaitya hill with star and crescent on the reverse. A tale of a climactic Battle of Alor (Sindh province of modern day Pakistan) between Chandragupta Vikramaditya and the Sakas still survived till the time of Alberuni in the 11th century CE. Chandragupta II's campaign against the Sakas was successful and the Saka Kshatrapas were wiped out.\nSubjugation of the Western Kshatraps\nChandragupta II's military campaigns against the Western Kshatrapas are well-documented in historical records. Inscriptions, such as the Allahabad Pillar inscription of his father Samudragupta, mention the \"Shaka-Murundas\" among the kings who sought to appease him. It is speculated that Samudragupta may have reduced the Shakas to a state of vassal alliance, paving the way for Chandragupta II to completely subjugate them. The decline of Western Kshatrapa coinage towards the end of the 4th century, followed by the emergence of Gupta coinage in the region, further supports Chandragupta II's conquest. Chandragupta II had successfully extended his realm westward by defeating Rudrasimha III in 395. His campaign against Western satraps lasted until 409.\n.]]\nLiterary evidence, including the Sanskrit play Devichandraguptam, narrates Chandragupta II's victory over the Western Satraps. According to the play, Chandragupta II disguised himself as the queen to deceive the enemy and successfully defeated a Shaka chief besieging his brother's empire. This literary tradition, along with other Indian legends of King Vikramaditya's triumph over the Shakas, underscores the historical significance of Chandragupta II's conquest.\nAftermath\nChandragupta II, known for his expansion of Gupta authority into west-central India, including present-day Gujarat, achieved a significant victory over the Shakas. This conquest not only solidified Gupta dominance in the region but also contributed to the cultural and political unity of ancient India. His military successes and administrative acumen cemented his legacy as a formidable conqueror and statesman, shaping perceptions of Gupta imperial power and influence in historical narratives.\nChandragupta II's reign marked a period of prosperity and stability for the Gupta Empire. His strategic alliances and military campaigns expanded the empire's territory and consolidated its control over key regions. Under his rule, the Gupta Empire reached its zenith, with flourishing trade, vibrant cultural exchange, and advancements in art, literature, and science. Chandragupta II's legacy as a visionary leader and astute ruler continues to be celebrated in Indian history, symbolizing the golden age of Gupta imperial rule. The Gupta ruler Skandagupta (455-467 CE) is known for a long inscription where he describes himself as \"the ruler of the earth\" on a large rock at Junagadh, in Gujarat, next to the older inscriptions of Ashoka and Rudradaman I, confirming the Gupta hold on the western regions.\nReferences"
    }
  ]
}