{
  "content": [
    {
      "type": "text",
      "text": "# Gurdwara Management Committee Bangladesh\n\n}}\n| formation                =\n| logo                     = Gurdwara_Management_Committee_Bangladesh_logo.jpg\n| abbreviation             = G.M.C.B.\n| headquarters             = 3 Neelkhet Road, Dhaka University, Shahbag, Dhaka, Bangladesh\n| leader_title             = President\n| leader_name              = Amar Chand\n| leader_title2            = General Secretary\n| leader_name2             = Topas Lal Choudhary\n| key_people               =\n| parent_organization      = Bangladesh Gurdwara Management Board\n| website                  = http://bangladeshgurdwaras.org/\n}}\nThe Gurdwara Management Committee Bangladesh ( GMCB), also referred to as the Bangladesh Gurdwara Parbandhak Committee ( BGPC), is a Sikh gurdwara committee based in Bangladesh which operates gurdwaras located in the country. The committee is based in Dhaka. The committee is controlled by its parent organization, the Bangladesh Gurdwara Management Board, which is based in Kolkata, India. A responsibility of the committee is managing the trips of Sikh pilgrims to Bangladesh to visit gurdwaras located in the country. The organization works closely with the Sampardai Kar Sewa Sarhali Sahib and Mata Amar Kaur Memorial Sewa Society.\nAll of the currently operational gurdwaras in Bangladesh are run by the Bangladesh Gurdwara Management Committee. The management board consists of both local and foreign members to operate the gurdwaras. The funds needed to operate the gurdwaras are sourced from devotees, foreign visitors, donors, and grants from the Bangladeshi government.\nHistory\nThe Shiromani Gurdwara Parbandhak Committee, the main Sikh gurdwara management committee based in India, had conducted its own surveys of gurdwaras located in Bangladesh but was not able to carry-out any development work.\nThe parent organization of the GMCB, the Bangladesh Gurdwara Management Board, was founded in 1972. After the independence of Bangladesh in 1971, the Bangladesh Gurdwara Management Board was granted control of all the gurdwaras in the country, including the central Gurdwara Nanak Shahi of Dhaka. In 1972, the board appointed Kartar Singh, head priest of Gurdwara Nanak Shahi, to perform the daily religious functions.\nWorking in-conjunction with the organization Sampardai Kar Sewa Sarhali Sahib, the committee since 2004 has been carrying-out kar seva renovations at five historical gurdwaras located in Bangladesh, with the renovation work being carried out by Sukha Singh. The patron of the committee at the time was then jathedar of Takht Patna Sahib, Iqbal Singh.\nIn 2008, the committee began organizing pilgrimage trips to two gurdwaras in Dhaka, namely Gurdwara Nanak Shahi (associated with Guru Nanak) and Gurdwara Sangat Tola (associated with Guru Tegh Bahadur). A Sikh Research Centre (SRC) at Gurdwara Nanak Shahi headed by professor Nirol Kazi of Dhaka University had been set-up. In 2011, Punjabi schools were constructed in Dhaka and Chittagong, with most of the students being local Hindus and Muslims.\nIn 2016, the Bangladesh Forum for Heritage Studies relinquished four, rare photographs taken in 1950 of Gurdwara Nanak Shahi at Nilkhet, Dhaka, to the Gurdwara Management Committee in a ceremony.\nIn 2017, it was reported that the committee was headed by a local Hindu named Parashuram Begi. Sukomal Barua served as president of the committee for five years. In April 2023, Amar Chand Lal Begi was appointed president, Topas Lal Choudhary was appointed as the General Secretary, and M. K. Roy was appointed as the Committee Member. They were appointed to their office-roles by Sukha Singh of Sampardai Kar Sewa Sarhali Sahib.\nDuring the 2024 unrest in Bangladesh, the committee organized guards to protect Gurdwara Nanak Shahi located in Dhaka from vandals. Whilst nearby Hindu temples were attacked, the gurdwara was unscathed. None of the five remaining gurdwaras in Bangladesh were attacked during the anti-Hindu unrest and sewadars kept the gurdwaras under their watch to prevent strife. The gates of the gurdwaras were shut and prayers were held on a daily-basis during the unrest.\nPilgrimage circuit\nThe Sikh pilgrimage route it operates in Bangladesh consists of five gurdwaras, two in Dhaka (one dedicated to Guru Nanak and the other to Guru Tegh Bahadur), two in Chittagong, and one in Mymensingh. Pilgrims travel to Bangladesh to visit the gurdwaras during the Baisakhi and Guru Nanak Gurpurab celebrations.\nCommittee members\nBangladesh does not have a Sikh population, thus there is no Sikh on the Gurdwara Management Committee. Instead, the committee is headed by a Hindu and its members consist of members of the local Hindu, Muslim, and Christian communities. The members and office-bearers of its parent organization, the management board based in Kolkata, are chosen by the jathedar (religious head) of Takht Patna Sahib.\nList of members\nPresidents\n* Suresh Kumar (2011)\n* Parashuram Begi (2017)\n* Sukomal Barua (unknown term)\n* Amar Chand (1 April 2023 – ?)\nOther members\n* Naraindas (alias Pappu) (former Secretary)\n* Topas Lal Choudhary (General Secretary)\n* M. K. Roy (Committee Member)\n* Singhbir Singh (granthi)\n* Azadwinder Singh\n* Jatin Lal Begi (member)\n* Sumit Lal Begi (member)\n* Suvis Das (member)\n* Sham Das (treasurer)\n* Jaspal Singh (Bangladesh Sikh Sangat)\nList of operational gurdwaras\n* Gurdwara Sangat Tola – located in Bangla Bazaar, Dhaka\n* Gurdwara Nanak Shahi – located in Shujatpur, Dhaka\n* Gurdwara Pahar Tali – located in Punjabi Lane, Chittagong\n* Gurdwara Sikh Temple Estate – located in Chittagong\n* Gurdwara Guru Nanak Mandir – located in Mymensingh\nSee also\n* Shiromani Gurdwara Parbandhak Committee\n* Haryana Sikh Gurdwara Parbandhak Committee\n* Delhi Sikh Gurdwara Management Committee\n* Pakistan Sikh Gurdwara Prabandhak Committee\nReferences\nExternal links\n*"
    }
  ]
}