{
  "content": [
    {
      "type": "text",
      "text": "# Gurdwara Patalpuri Sahib\n\nGurdwara Patalpuri Sahib is a Sikh gurdwara located in Kiratpur, Punjab, India that is a popular place for dispersing ashes for Sikhs as part of the Antam Sanskar funerary rites of Sikhism. The site is renowned for being the cremation-grounds of two Sikh gurus, Guru Hargobind, Guru Har Rai, and the ashes of Guru Har Krishan were dispersed at this location.\nLocation\nThe gurdwara is situated on the left-bank of the Sutlej river at Kiratpur. It is located around a quarter of a mile from the settlement of Kiratpur in the southerly-direction of the Sutlej river.\nArchitecture\nThe gurdwara is located on a tall-plinth and consists of a large hall. One of the end of the hall leads to the river, where the Guru Granth Sahib has been installed, known as prakash asthan. Two-stories are located above the sanctum of the structure, with a dome on-top. The specific location within the site where the ashes are dispersed into the river from is known as the asth ghat.\nPurpose\nAfter the completion of the sehaj pāth portion of a Sikh funeral, it is customary for the family to then disperse the ashes of the dead into a flowing body of water. In modern Sikhism, the most popular place to do-so is at Gurdwara Patalpuri Sahib into the Sutlej river.\nHistory\nAs per Sikh lore, Guru Hargobind, sensing his end, commanded that a hut be constructed on the bank of the Sutlej at Kiratpur, with the hut being named Patalpuri. A Muslim pir, named Pir Kaivan, visited Guru Hargobind here one week prior to the guru's passing. Guru Hargobind died on 3 March 1644 at Kiratpur Sahib on the bank of the Sutlej, and was cremated on the banks of the river, where now stands Gurdwara Patalpuri Sahib. The 17th century Persian text Dabistani Mazahib also mentions this location as being the cremation ground of Guru Hargobind. Another tale connected to the cremation of the sixth guru is that a Rajput raja and his followers leapt into the funeral pyre. Guru Har Krishan died and was cremated in Delhi on 30 March 1664 but as per the Bhatt Vahis, his ashes were brought to his site to be dispersed into the Sutlej on 22 August 1664. Furthermore, Guru Har Rai was cremated at the site on 6 October 1661. An autographed manuscript of the Guru Granth Sahib, signed by Guru Har Krishan under the command of his father, Guru Har Rai, is said to mention this location. There were formerly three separate shrines at the location to memorize each of the three Sikh gurus connected to the site, alongside separate monuments and structures dedicated to other members of the gurus' family, but these shrines were eventually demolished coalesced into a single structure through renovations.\nHistorically, many Sikhs traditionally used to disperse the ashes of the deceased at Haridwar, where genealogical records were maintained, however going to this specific site fell out of favour with many Sikhs, as Sikhism does not encourage or emphasize any particular place. Instead, many Sikhs, especially those living near Kiratpur and the diaspora in Western countries, now disperse of ashes at Gurdwara Patalpuri Sahib. Other Sikhs opt to disperse the ashes of their deceased into any nearby stream or river, usually the Sutlej. Some diasporic Sikhs choose to disperse the ashes of their deceased into a water-body found in their country of residence. Some Sikh communities, such as Chamars, still disperse ashes at Haridwar in a ceremony known as asth-pauna.\nReferences"
    }
  ]
}