{
  "content": [
    {
      "type": "text",
      "text": "# Gurdwara Nanak Shahi\n\nGurdwara Nanak Shahi (, ) is the principal Sikh gurdwara (temple), located in Nilkhet, Dhaka, Bangladesh. It is located at the campus of the University of Dhaka and considered to be the biggest of the 9 to 10 gurdwaras in the country. The gurdwara commemorates the visit of Guru Nanak (1506–1507). It is said to have been built in 1830. The present building of the gurdwara was renovated in 1988–1989. The gurdwara was formerly called the Sujatpur Sikh Sangat and had been established by Udasis.\nHistory\nIt is believed that Guru Nanak had stayed at the site whilst travelling in Bengal during his udasis (travels). A structure was erected at the site to commemorate the location of Nanak's stay during the guruship period of Guru Hargobind in the first half of the 17th century by Bhai Almast, who had been dispatched to the region for missionary work. Another view is that the original shrine was erected by Bhai Natha, a disciple and successor of Bhai Almast, during the guruship period of Guru Tegh Bahadur, who had visited Dhaka and stayed there for a period of time. Another even another view claims the shrine was established by Baba Gurditta when he visited Bengal, where he established a manji in Shujatpur which Gurditta traced to be the location in which Nanak resided during his stay in Bengal. During the reign of Mughal emperor Jahangir, Guru Hargobind dispatched Bhai Natha (Bhai Almast's successor) to Bengal, who dug another well and also laid the foundation stone for the Shujatpur Sikh Sangat, a religious congregation. At the time, the location was part of the Mughal mohallah (locality) of Sujatpur mouza. In 1830, the structure of the shrine was reconstructed, with the actual shrine being rebuilt and new auxiliary buildings being constructed near it to support its functions. Whilst initially established as and referred to as a manji, the site later became known as a gurdwara. Before the gurdwara was constructed, Bhai Natha dug a well of which Mahant Prem Dass made reforms in 1833. During Sikh celebrations, such as Vaisakhi and Guru Nanak Gurpurab, Sikhs and Jats from distant regions in India visited Gurdwara Guru Nanak Shahi and stayed there.\nThe gurdwara maintained communication with other Sikh congregtations and shrines located in Bengal, Bihar, and Orissa. Sri Chandrajyoti served as the granthi of the complex from 1915 until 1947, when the shrine was nearly abandoned totally due to the ongoing partition of Bengal.\nFrom the period between 1947–64, the upkeep of the gurdwara was maintained by donations from local devotees and Indian Sikh pilgrims, alongside funds from Sikh personnel working for United Nations agencies in Dhaka, the Indian consulate, and diasporic Sikhs located overseas. Even still, the donations were not enough to prevent the gurdwara from falling into disrepair and decay. Due to the aftermath of the state-sponsored communal riots of 1964 and Indo-Pakistani war of 1965, the arrival of Indian pilgrims to the gurdwara ceased, which negatively affected its funds and hastened its decline and it was soon overgrown by local vegetation.\n'' Swaran Singh, who was later murdered during the 1971 unrest.]]\nDuring this period, the granthi of the gurdwara was Swaran Singh. Swaran Singh had stayed behind in East Pakistan in 1947 to administer the gurdwara and did not flee to India like his fellow co-religionists. Swaran Singh may have been photographed in a 1950 photograph of the gurdwara complex. Swaran Singh and a local Bengali Muslim companion of his were both later murdered by the Pakistani military's collaborators during the 1971 unrest. In the aftermath of the Indo-Pakistani war of 1971, Sikh officers and soldiers of the Indian military visited the gurdwara to offer prayers on 16 December 1971.\nKartar Singh was the head granthi of the shrine in 1972. After the independence of Bangladesh, fresh funds for the maintenance of the shrine became available in 1972, with some minor restoration work being carried-out as a result. However, the following year in 1973 some decrepit portions of the gurdwara next to University of Dhaka's Art Faculty began to be demolished by workers but they were stopped before they could cause major damage to the site.\nA major renovation project of the shrine was launched, using diasporic Sikh donations, under the purview of Harban Singh, chairman of the International Jute Organization in Dhaka, between 1988–89. As a result of this effort, the gurdwara was fully operational again.\nIn 2016, the Bangladesh Forum for Heritage Studies relinquished four, rare photographs taken in 1950 of Gurdwara Nanak Shahi to the Gurdwara Management Committee Bangladesh in a ceremony. The gurdwara is currently run by the Bangladesh Gurdwara Management Committee. The management board consists of both local and foreign members to operate the gurdwara. The funds needed to operate the gurdwara are sourced from devotees, foreign visitors, donors, and grants from the Bangladeshi government.\nArchitecture\nThe main building of the gurdwara that was constructed in 1830 featured the Indo-Mughal architectural-style, particularly the interior of the edifice. Sikh samadhs were located in a plot of ground at the rear of the main shrine. Besides the main gurdwara complex, there were adjacent buildings, such as a langar-khana (communal kitchen) and musafir-khana (rest-house for guests and pilgrims), with both having been constructed around the same time as the gurdwara in 1830 as they share architectural features with the main shrine. There were a total of nine guest-rooms to accommodate visiting pilgrims. There was an entryway from the north, a ditch and cemetery to the south, and a sarovar (temple tank) to the west with concrete steps leading to the water. To the north-east of the main edifice there was an office and to the east was the residence quarters of the shrine's granthi (priest).After Harban Singh's 1988–89 renovations, the exterior façade of the Gurdwara underwent large structural changes but attention was paid to preserve the impressive original interior, albeit with some changes made to its layout. One of the changes made to the layout was the addition of a parkarma verandah around the inner sanctum sanctorum to protect it. It is within this space where the central Sikh text, the Guru Granth Sahib, is kept and read from, where it is kept atop of a carved, high marble kiosk. The darbar sahib hall is open on all sides, signifying the openess to all. The northern side of this central prayer hall is where the Guru Granth Sahib is positioned on a wooden platform.\nPresent condition\nThe gurdwara is in a good condition. The whole building is fully white coloured. After the renovation in 1988–1989 this building is now under good observation. The present shrine contains accommodations for visitors.\nSikh relics\nThere are two hand-written Birs (Recensions) of Guru Granth Sahib in the Gurdwara, one of  with 1336 angs. An old, handwritten Guru Granth Sahib manuscript is preserved at the site. A pair of wooden sandals (kharavan), said to have belonged to Guru Tegh Bahadur is kept and preserved in a glass box under the location of the Guru Granth Sahib. Furthermore, a copy of a portrait of Guru Tegh Bahadur is kept here.\nReligious rituals\nGurdwara Nanak Shahi is open for people of all religions, castes, and genders. Each day, recitation from the holy scripture of Sikh religion Granth Sahib and prayer takes place in Gurdwara Nanak Shahi. Two-hour long weekly prayers and kirtan are organized every Friday from 11 a.m. to 1 p.m. On this day in the morning and after prayer, free food known as langar is served. Baisakhi is celebrated at the location.\nList of religious heads\n* Prem Dass (mahant) – c. 1833\n* Sri Chandrajyoti (granthi) – 1915 to 1947\n* Swaran Singh (granthi) – 1947 to 1971\n* Kartar Singh (granthi) – 1972 to present\nGallery\nFile:Gurdwara Dhaka 1950 from the south.jpg|A distant view of the gurdwaras, centre, seen from the south. Auxiliary buildings and substantial landed property of the gurdwara can also be observed in 1950.\nFile:Gurdwara Dhaka 1950 from the northeast.jpg|The gurdwara seen in a fairly pristine condition in 1950, from the northeast. The architectural details on the exterior of the building is visible.\nFile:Gurdwara Dhaka 1950 rear view.jpg|Rear view of the gurdwara, showing old Sikh samadhis on the grounds. Closer inspection of the gurdwara show intricate designs on the building.\nFile:Gurdwara Nanak Shahi in Dhaka 03.jpg\nFile:Gurdwara Nanak Shahi in Dhaka 02.jpg\nFile:Gurdwara Nanak Shahi, Dhaka (7).jpg\nFile:Gurdwara Nanak Shahi, Dhaka (2).jpg\nFile:Gurdwara Nanak Shahi, Dhaka (33).jpg\nReferences\n* Archaeological Heritage (pp. 345–346), Published By Asiatic Society Of Bangladesh, (December 2007).\nExternal links\n* [https://web.archive.org/web/20021008211400/http://www.geocities.com/gurdwaraworld/gurd7.html  Gurdwara Nanak Shahi Dhaka] (archived 8 October 2002)"
    }
  ]
}