{
  "content": [
    {
      "type": "text",
      "text": "# Gurdwara Chowa Sahib\n\n| alternate_names  =\n| image            =\n| image_size       =\n| caption          =\n| location_town    = Rohtas Fort\n| location_country = Pakistan\n| coordinates      =\n| construction_start_date =\n| completion_date  = 1834\n| style            = Sikh architecture\n}}\n, or stepwell.]]\nGurdwara Chowa Sahib (}}; literally: \"Gurudwara of the exalted spring\"'') is a renovated gurdwara located at the northern edge of the Rohtas Fort, near Jhelum, Pakistan. Situated near the fort's Talaqi gate, the gurdwara commemorates the site where Guru Nanak is popularly believed to have created a water-spring during one of his journeys known as udasi. But parkash of Guru Granth Sahib is not there.\nHistory\nThe first commemorative structure was built by Charat Singh, who installed a sarovar pool, and area for recitation of the Guru Granth Sahib. The current building dates from 1834, and was commissioned by Maharaja Ranjit Singh. Ranjit Singh's general Gurmukhi Singh Lamba played an important role in maintaining the gurdwara.\nAfter the takeover of the Punjab by Ranjit Singh, Gurmukh Lamba captured Rohtas Fort from the local Gakhar chief Raja Noor Khan, son of Raja Fazaldad Khan, in 1825. Due to the enmity of main brothers Raja Gulab Singh and Dhian Singh (Dogra Raja's) having influence over Maharaja, the fort was given to Mohar Singh. But when Mohar Singh retired to Banaras against the wishes of the Maharaja, the fort and the contingent of seven hundred horses were placed under Gurmukh Singh Lamba. Thus making his command long (Lambi), he was popularly addressed by the Maharaja as Lamba Sardar.\nSignificance\nSikhs believe that Guru Nanak and Bhai Mardana were traveling in the region during the fourth of Guru Nanak's journeys - known as udasis. The two were traveling during the summer, and had arrived at the site following a 40-day stay at the nearby Tilla Jogian temples.  Bhai Mardana expressed his thirst while lamenting that water was scarce in the region during that time of year. Guru Nanak is said to have then struck the earth with his cane and moved a stone, thereby revealing a natural spring.\nSikh lore states that Sher Shah Suri attempted to shift the spring up the hill to use as a source of water for the newly constructed Rohtas Fort. The king's engineers attempted the feat three times, failing each time.\nConservation\nThe temple stands at the base of a hill upon which the Rohtas Fort, a UNESCO World Heritage Site, is situated.\nIn 2020, a Sikh community organization based in USA, Ranjit Nagara, took over the rehabilitation and renovation of the Gurdwara. The work is being done through international funding via a multicultural team to bring the Gurdwara back to its original form and function as well as adding new facilities.\nSee also\n* Sikhism\n* Kala Dhari Mandir\nReferences"
    }
  ]
}