{
  "content": [
    {
      "type": "text",
      "text": "# GURPS Vikings\n\n, 1991]]\nGURPS Vikings is a supplement published by Steve Jackson Games in 1991 for GURPS (Generic Universal Role-playing System).\nContents\nGURPS Vikings is a supplement that details the Scandinavian people from the historical periods known as the Dark Ages and the early medieval period. The book starts with an examination of six different styles of role-playing that can be used in a Viking campaign:\n* Thoughtful Historic (low fantasy, nonviolent role-playing)\n* Thoughtful Fantastic (authentic setting with supernatural touches)\n* Thoughtful Mythic (authentic setting, but with real Norse gods)\n* Action Historical (little fantasy, much fighting)\n* Action Fantastic (similar in style to most Advanced Dungeons & Dragons or RuneQuest games)\n* Action Mythic (player characters actively participate in the conflicts of the Norse gods)\nFurther chapters cover\n* the historical period, including Norse culture, history, economics, and floorplans of longhouses and forts.\n* new character classes\n* magic\n* religion\n* new monsters\n* designing scenarios\nPublication history\nIn the 2014 book ''Designers & Dragons: The '80s, game historian Shannon Appelcline noted that Steve Jackson Games decided in the early 1990s to stop publishing adventures, replacing them instead with genre sourcebooks. As Appelcline commented, \"SJG was now putting out standalone GURPS books rather than the more complex tiered book lines. This included more historical subgenre books. Some, such as GURPS Camelot (1991) and GURPS China (1991), were clearly sub-subgenres, while others like GURPS Old West (1991) and GURPS Middle Ages I (1992) covered genres notably missing before this point.\"\nOne of these \"sub-genre\" books was GURPS Vikings, a 126-page softcover book designed by Graeme Davis, and edited by Steve Jackson, with interior art by Topper Helmers, Don Arburn, Carl Anderson, Denis Loubet, and Doug Shuler, and cover art by John Zeleznik. It was published by Steve Jackson Games in 1991.\nIn 2002, Steve Jackson Games published a second edition of this book to be played with rules of the third edition of GURPS. The 128-page softcover book was again designed by Graeme Davis, with illustrations by Paul Daly, Shane L. Johnson, Garry McKee, Klaus Schwerinski, Carl Anderson, Topper Helmers, David McKay, and Michael S. Wilson, cartography by Mike Naylor, and cover art by Alex Fernandez.\nReception\nIn the May 1992 edition of Dragon'' (Issue #181), Rick Swan thought that this book \"offers something for Vikings of every persuasion.\" With regard to the history chapter, Swan was impressed by the author's ability to \"pack an enormous amount of information into a relatively few pages, emphasizing many intriguing facets of culture and economics.\" However, he found the chapter on new character classes \"isn't particularly inspiring,\" and he also noted that \"magic is underplayed... a disappointing section.\" He did like the new monsters, \"a good mix of the ordinary and the unusual.\" In conclusion, Swan gave the book 3 stars out of 5, saying, \"This is the thinking person’s guide to Vikings. Novices may be overwhelmed by the amount of detail, and the shallow treatment of fantasy may discourage players who are less interested in mastering the Norse legal system than in hacking up sea monsters. But for mounting a strict historical campaign, GURPS Vikings is the book of choice.\nGabe Dybing for Black Gate in 2017 described GURPS Vikings as \"an impressive and professional publication with few typos and many engaging illustrations.\"\nReviews\n* #43\nReferences"
    }
  ]
}