{
  "content": [
    {
      "type": "text",
      "text": "# Gurudwara Gyan Godri Sahib\n\n| year_completed        = 1935\n| groundbreaking        = 1866\n| website               =\n}}\nThe Gurdwara Gyan Godri Sahib, also known as Gurdwara Sri Gyan Godri Sahib (meaning \"treasure of knowledge\") was a gurdwara (Sikh temple) at Har Ki Pauri, Haridwar in the state of Uttarakhand, India. According to Municipal Corporation Haridwar records of 1935, it was on the site that became The Bharat Scouts and Guides office at the market in Subhash Ghat of Har Ki Pauri.\nGuru Nanak's visit\nIn 1504–1505, the Sikh founder Guru Nanak visited Haridwar during his first proselytising journey (udasi). It is said that when he saw Brahmins (Hindu priests) in the river Ganges facing east at sunrise offering water, intended to reach the spirits of their dead ancestors, to the sun god Surya, he started throwing water in the opposite direction. When the Brahmins asked why, Guru Nanak said he was watering his crops at Kartarpur.\nHistory and demolition\nA small building of Gurudwara Gyan Godri Sahib existed till 1975 at Landhaura House area in Har Ki Pauri of Haridwar where a tenant, Ram Piari, used to pray before a copy of the Guru Granth Sahib. After Kumbh Mela stampede of 1966, Haridwar administration acquired Landhora House to widen Har Ki Pauri in 1979 and demolished the Gurudwara. Sikhs were not allowed to reconstruct Gurudwara again. Also, An ancient Gurudwara Nanakwara was located 200 metres from the said spot. Currently the office The Bharat Scouts and Guides where Gurudwara Gyan Godri once existed.\nEfforts for reconstruction\nShiromani Gurdwara Parbandhak Committee and DSGMC unsuccessfully tried to get back the land and reconstruct it. Gurcharan Singh Babbar's All India Sikh Conference (AISC) is also working to rebuild Gurudwara again which was demolished in 1979. Professor Pandit Rao Dharennavar recited Japji Sahib on Guru Nanak Gurpurab at Har Ki Pauri for the cause.\nSee also\n* Gurdwara Lal Khoohi\n* List of Gurudwaras\n* Gurdwara Darbar Sahib Kartarpur\n* Gurudwara Sis Ganj Sahib\n* Hazur Sahib Nanded\n* Takht Sri Patna Sahib\nReferences\nExternal links\n* [https://gyangodrigurudwara.org/ Official Website]"
    }
  ]
}