{
  "content": [
    {
      "type": "text",
      "text": "# Gus Warr\n\n| nickname =\n| birth_date =\n| birth_place = Manchester, England\n| school = Tarporley High School  Ellesmere CollegeDollar Academy\n| university =\n| height =\n| weight =\n| position = Scrum-half\n| currentclub = Sale Sharks\n| repteam1 =\n| repyears1 = 2019\n| repcaps1 = 1\n| reppoints1 = 0\n| repupdate = 26 July 2024 (Scotland updated)\n| years1 = 2018–\n| clubs1 = Sale Sharks\n| apps1 = 71\n| points1 = 20\n| clubupdate = 20 May 2023\n|repteam2=Scotland|repyears2=2024|repcaps2=2|reppoints2=10}}\nGus Warr (born 24 September 1999) is a Scotland international rugby union player who plays as a scrum-half for Sale Sharks in Premiership Rugby.\nClub career\nHe started playing rugby at Winnington Park RFC aged six before moving to Bowdon RUFC at thirteen. He played school rugby at Tarporley High School before moving to Ellesmere College at fourteen. He joined the Sale Academy aged 14. He moved to Dollar Academy for sixth form. In September 2018 he made his Premiership debut for Sale against Harlequins at the Stoop at 18.\nInternational career\nHe represented Scotland at age grade level (18,19 and 20s) and then competed for England Under-20 against Scotland in the final round of the  2019 Six Nations Under 20s Championship.\nIn June 2024 Warr was called up to the senior Scotland squad for a tour of The Americas.\nHe made his Scotland debut against Canada on 6 July 2024 at TD Place Stadium in Ottawa. Scotland won the match 73 points to 12. Warr has the Scotland no. 1222. He also started Scotland's 52-11 win over Chile.\nOn 30 June 2025 Warr was called up to Scotland's squad for the 2025 mid-year rugby union tests against the Māori All Blacks, Fiji and Samoa. This was following Ben White's departure from the tour squad following his call-up to the 2025 British & Irish Lions Tour of Australia.\nReferences\nExternal links\n*[https://www.salesharks.com/jets_player/gus-warr/ Sale Sharks Profile]\n*[http://en.espn.co.uk/scrum/rugby/player/31240.html?source=opta ESPN Profile]\n*[https://www.ultimaterugby.com/gus-warr Ultimate Rugby Profile]"
    }
  ]
}