{
  "content": [
    {
      "type": "text",
      "text": "# Gwebi College of Agriculture\n\n| type = Public agricultural college\n| academic_affiliation = University of Zimbabwe\n| city =\n| province = Mashonaland West\n| country = Zimbabwe\n| campus = Rural\n| language = English\n}}\nGwebi College of Agriculture is an agricultural college located near Harare, Zimbabwe.\nHistory\nFormal agricultural education in Southern Rhodesia began in 1930, when an agricultural college opened at Matopos. However, it closed after a few years. Gwebi Farm was established by the Federation of Rhodesia and Nyasaland's Ministry of Agriculture in the early 20th-century as an experimental station. In the decades that followed, the farm lapsed in and out of active use. After World War II, Gwebi Farm hosted agricultural courses for ex-servicemen, where they were instructed in skills such as ploughing, herding, and milking. Ian Smith, the future Prime Minister of Rhodesia, attended courses at Gwebi in 1947 and 1948. In 1949, W. L. Fielding arrived in Southern Rhodesia, tasked by the Ministry of Agriculture with establishing an agricultural college at Gwebi. The college would provide two-year diploma courses to ex-servicemen, many of whom had missed out on higher education during the war.\nIn February 1950, Gwebi College of Agriculture opened with 24 students. Its campus, located on Sinoia Road outside of Salisbury, was originally used to house pilots training at the nearby Mount Hampden airfield during World War II. The students were 18- and 19-year-old white men, mostly from the colonies of Southern Rhodesia, Northern Rhodesia, and Nyasaland, with a few students from the United Kingdom who sought to take up farming in the Federation. Unlike Southern Rhodesia's agricultural school for blacks, Chibero College, where students took three year courses, Gwebi offered two-year diploma courses, because the students generally had some experience in agriculture. The first fully residential institution of higher education in Southern Rhodesia, Gwebi College soon had a significant waiting list. After 15 years, Dr. Fielding left Gwebi in 1965 to take the position of Chair of Agriculture at Makerere University in Kampala, Uganda. By the time he left, Gwebi had graduated over 500 students.\nIn 1965, Hugh Rodney Mundy became principal of Gwebi College. A former Rhodes Scholar at the University of Oxford, he was previously an animal husbandry lecturer at Gwebi. As principal, he placed greater emphasis on animal husbandry training, and also frequently umpired at Gwebi cricket matches. He died in 1970, while still in office. In August 1970, Frederick Bernard Rhodes, formerly a lecturer in animal husbandry and vice principal, became Principal of Gwebi College. In 1976, he took a job as project manager at the Keiskammahoek immigration scheme, and stepped down as principal. Hugh John McLean became the fourth Principal of Gwebi College in November 1976. Previously, he was a lecturer in animal husbandry and vice principal since 1970. He served as principal until 1982, when he was replaced by Bob Dunckley. By the late 1970s, Gwebi College had graduated more than 1,000 students. In 1978, the college had 17 instructors and an enrollment of 88 students.\nIn October 2013, Gwebi College of Agriculture graduated 131 students. University of Zimbabwe principal Levi Nyagura used his commencement speech to urge the Zimbabwe Ministry of Agriculture, Mechanisation and Irrigation Development to create a bachelor's degree program at Gwebi College. He said,\"Judging by the high standard of the diploma program it will no longer make sense to continue awarding Gwebi graduates a diploma. A Bachelor of Technology degree in agriculture would be more appropriate.\"\nAcademics\nGwebi College of Agriculture ran two-year Diploma in Agriculture courses. The courses included both lectures and regular visits to working farms. Students were expected to have experienced at least one year working on a farm before enrolling. To enroll, applicants are required a minimum of five Ordinary levels passes including mathematics, English, language, and science. Gwebi College is affiliated with the University of Zimbabwe.\nStudent life\nA 1980 study found that Gwebi students were more motivated by the desire to obtain a diploma than an interest in farming; at Chibero College, these priorities were generally reversed.\nSports\nGwebi College of Agriculture maintained a cricket team.\nNotable people\nList of principals\n# W. L. Fielding (1950-1965)\n# Hugh Rodney Mundy (1965-1970)\n# Frederick Bernard Rhodes (1970-1976)\n# Hugh John McLean (1976-1982)\n# Bob Dunckley (1982-?)\nAlumni - Old Gwebians\nAlumni are known as Old Gwebians.\n* Colin Cloete (1974), former President of the Commercial Farmers' Union\n* Eddie Cross (1962), economist and member of Parliament\n* Rob Davenport (1960), commercial farmer and businessman\n* Tom Dumont de Chassart, President of the Zimbabwe Tobacco Association\n* Bob Dunckley (1958), former President of Gwebi College\n*Rusty Markham, member of Parliament\n* Ian Smith (1948), Prime Minister of Rhodesia\n* Stephen Gasha (1990), Higher Research Technician, DR&SS, Marondera (1990 - 2001), IT Support Engineer, UK\n* Peter Steyl (1976), President of the Commercial Farmers' Union\nSee also\n* Agriculture in Zimbabwe\nReferences"
    }
  ]
}