{
  "content": [
    {
      "type": "text",
      "text": "# Gwyddion (software)\n\n| latest release date = }}\n| programming language   = C\n| operating system       = Cross-platform\n| language               = English\n| genre                  = SPM Data Analysis Program\n| license                = GPL (Free software)\n| website                = [http://gwyddion.net/ gwyddion.net]\n}}\nGwyddion is a multiplatform modular free software for visualization and analysis of data from scanning probe microscopy (SPM) techniques (like AFM, MFM, STM, SNOM/NSOM). The project is led by its main developers David Nečas (Yeti) and Petr Klapetek who work together with various developers across the world. The software is made available as free software under the terms of the GNU General Public License.\nThe name “Gwyddion” is that of a prominent god of Welsh Mythology, see Gwydion\nIt is created for the analysis of height fields and other 2D (image) data. While it is primarily intended for data originating from scanning probe microscopy techniques (like AFM, MFM, STM, SNOM/NSOM), it may also be used for the analysis of profilometry data, for instance.\nData is calculated and stored in the native file format (.gwy) in double precision.\nGwyddion supports many different file types and performs many image-based functions. Among others it can open and save the following graphics file formats:\n* Windows bitmap (.bmp)\n* Joint Photographic Experts Group (.jpeg, .jpg, or .jpe)\n* Portable Network Graphics (.png)\n* TARGA (.tga)\n* Tagged image file format (.tiff, .tif)\n* Portable aNy Map (.pnm)\nTechnical features\nQuote from homepage of Gwyddion: 'Gwyddion uses a fairly general physical unit system, there are no principal limitations on the types of physical quantities data (and lateral dimensions) can represent. Units of slopes, areas, volumes, and other derived quantities are correctly calculated. SI unit system is used whenever possible.\nTools and other dialogs remember their parameters, not only between tool invocations during one session, but also between sessions. Gwyddion native file format (.gwy) supports saving all data specific settings: false color palette, masks, presentations, selections, associated 3D view parameters, graphs associated with that data and their settings, etc.'\nGwyddion is mainly developed on Linux platform using GNU set of compilers and utilities. Its graphical user interface is based on the popular interface toolkit GTK+.\nAvailability and versions\nIt is available for Linux platforms and has been ported to other unix flavors that has support the GNU Autotools or its equivalent. The Windows version is slightly incomplete due to limitations of the platform, but supports nearly all major features. The Mac OS version can be built using Xcode, and some pre-built binaries are available.\nApple Darwin, or OpenDarwin is the only major platform Gwyddion has not been thoroughly tested on. Gwyddion program could also be ported to other branches of the BSD operating system.\nSee also\n* [https://commons.m.wikimedia.org/wiki/File:Gwyddion_Python_Scripting_Tutorial_Install_pygwy_%26_Run_Your_First_Script.webm Pygwy Console step-by-step installation guide video (on Windows) (3:44)]\n{|\n|\n[[File:Gwyddion Python Scripting Tutorial Install pygwy & Run Your First Script.webm|thumb|350px|Step-by-step configuration screencast ([https://github.com/Drilack7/Python-Scripts-for-Gwyddion examples])]]\n|}\nReferences\nExternal links\n*\n*\n* https://github.com/Drilack7/Python-Scripts-for-Gwyddion"
    }
  ]
}