{
  "content": [
    {
      "type": "text",
      "text": "# Gymnasium (ancient Greece)__disambig_1\n\nThe gymnasium () in Ancient Greece functioned as a training facility for competitors in public games. It was also a place for socializing and engaging in intellectual pursuits. The name comes from the Ancient Greek term gymnós, meaning \"naked\" or \"nude\". Only adult male citizens were allowed to use the gymnasia.\nAthletes competed nude, a practice which was said to encourage aesthetic appreciation of the male body, and to be a tribute to the gods. Gymnasia and palaestrae (wrestling schools) were under the protection and patronage of Heracles, Hermes and, in Athens, Theseus.\nEtymology\nThe word gymnasium is the latinisation of the Greek noun γυμνάσιον (gymnasion), \"public place for physical exercises; exercise area\", in pl. \"bodily exercises\" and generally \"school\", which in turn is derived from the common Greek adjective  (gymnos) meaning \"naked\" or \"nude\", by way of the related verb γυμνάζω (gymnazo), whose meaning is \"to train naked\", \"train in gymnastic exercise\", generally \"to train, to exercise\". The verb had this meaning because the athletes undressed in changing rooms called apodyteria and trained naked, rubbing their bodies with olive oil and then cleaning with the strigil. Historically, the gymnasium was used for exercise, communal bathing (thermae), and later scholarly and philosophical pursuits. The English noun gymnast, first recorded in 1594, is formed from the Greek γυμναστής (gymnastēs), but in Greek this word means \"trainer\", not \"athlete\". The palaestra was the part of the gymnasium devoted to wrestling, boxing, and ball games. From the word \"gymnasion\" came also the term \"gymnastics\".\nOrganization\nThe gymnasium was formed as a public institution where young men received training in physical exercises. The supervision of the gymnasia was entrusted to gymnasiarchs, who were public officials responsible for the conduct of sports and games at public festivals and who directed the schools and supervised the competitors. The gymnastai were the teachers, coaches, and trainers of the athletes. The Greek gymnasia also held lectures and discussions on philosophy, literature, and music, and there were public libraries nearby.\nOrigins, rules, and customs\nA hermaic sculpture of an old man, thought to be the master of a gymnasium. He held a long stick in his right hand. [[Ai Khanoum, Afghanistan, 2nd century BC.]]\nThe regulation of the Athenian gymnasium is attributed by Pausanias (i. 39. 3) to Theseus. Solon made several laws on the subject; according to Galen these were reduced to a workable system of management in the time of Cleisthenes (late 6th century and early 5th century BC). While the origins of physical exercise regimes was thought to be Sparta of Lacaedemon, or Knossos of Crete, the practice of exercising in the nude had its beginnings in the 7th century BC. The same purpose is frequently attributed to the tradition of oiling the body, a custom so costly that it required significant public and private subsidies (the practice was the largest expense in gymnasia).\nCleinias of Crete describes the origin of the tradition of Cretan gymnasia and common meals in Book I of Plato's Laws, and ascribes them to the mythological lawgiver Rhadamanthus.\nThe original iterations of gymnasia were large open areas at city outskirts, not enclosed structures.\nThe athletic contests for which the gymnasium supplied the means of training and competition formed part of the social and spiritual life of the Greeks from very early on. The contests took place in honour of heroes and gods, sometimes forming part of a periodic festival or the funeral rites of a deceased chief. The free and active Greek lifestyle (spent to a great extent in the open air) reinforced the attachment to such sports and after a period of time the contests became a prominent element in Greek culture. The victor in religious athletic contests, though he gained no material prize other than a wreath, was rewarded with the honour and respect of his fellow citizens. Training of competitors for the greater contests was a huge matter of public concern and special buildings were provided by the state for such use, with management entrusted to public officials. A victory in the great religious festivals was counted an honour for the whole state.\nHistorical development\nThe ancient Greek gymnasium soon became a place for more than exercise and training. This development arose through recognition by the Greeks of the strong relation between athletics, education and health. Accordingly, the gymnasium became connected with education on the one hand and medicine on the other. Physical training and maintenance of health and strength were the chief parts of children's earlier education. Except for time devoted to letters and music, the education of young men was solely conducted in the gymnasium, where provisions were made not only for physical pedagogy but for instruction in morals and ethics. As pupils grew older, informal conversation and other forms of social activity took the place of institutional, systematic discipline. Since the gymnasia were favorite resorts of youth, they were frequented by teachers, especially philosophers. Philosophers and sophists frequently assembled to hold talks and lectures in the gymnasia; thus the institution became a resort for those interested in less structured intellectual pursuits in addition to those using the place for training in physical exercises.\nIn Athens there were three great public gymnasia: the Academy, the Lyceum and the Cynosarges, each of which was dedicated to a deity whose statue adorned the structure. Each of the three was rendered famous by association with a celebrated school of philosophy. Antisthenes founded a school at the Cynosarges, from which some say the name Cynic derives; Plato founded a school that gathered at the Academy, after which the school was named, making the gymnasium famous for hundreds of years; and at the Lyceum, Aristotle founded the Peripatetic school.\nPlato considered gymnastics to be an important part of education (see Republic iii. and parts of Laws) and according to him it was the sophist Prodicus who first pointed out the connection between gymnastics and health. Having found gymnastic exercises beneficial to his own weak constitution, Prodicus formulated a method that became generally accepted and was subsequently improved by Hippocrates. Galen also put great stress on the proper and frequent use of gymnastics. Throughout other ancient Greek medical writings special exercises are prescribed as cures for specific diseases, showing the extent to which the Greeks considered health and fitness connected. The same connection is commonly suggested by experts today.\nOrganization in Athens\nIn Athens ten gymnasiarchs were appointed annually, one from each tribe. These officials rotated through a series of jobs, each with unique duties. They were responsible for looking after and compensating persons training for public contests, conducting the games at the great Athenian festivals, exercising general supervision over competitor morale, and decorating and maintaining the gymnasium. Beneath them in the organisational structure were ten sophronistae responsible for observing the conduct of the youths and (especially) for attending all their games.\nPaedotribae and gymnastae were responsible for teaching the methods involved in the various exercises, as well as choosing suitable athletics for the youths. The gymnastae were also responsible for monitoring the constitution of the pupils and prescribing remedies for them if they became unwell. The aleiptae'' oiled and dusted the bodies of the youths, acted as surgeons, and administered any drugs prescribed. According to Galen, there also existed a teacher specifically devoted to instruction in ball games.\nConstruction\nGymnasia were typically large structures containing spaces for each type of exercise as well as a stadium, palaestra, baths, outer porticos for practice in bad weather, and covered porticos where philosophers and other \"men of letters\" gave public lectures and held disputations. Most Athenian gymnasia were located in suburban areas due to the large amount of level space required for construction. Additionally, these areas tended to be cooler and closer to a good water supply than similar areas in central Athens.\nSee also\n*Gymnopaedia\n*Gymnasium at Delphi\n*For modern uses of the term \"gymnasium\", see Gymnasium (school) and gym.\nNotes\nReferences\n*"
    }
  ]
}