{
  "content": [
    {
      "type": "text",
      "text": "# Habsburg–Ottoman war of 1529–1533\n\n23px Habsburg Monarchy\n| combatant2        =  Moldavia\n| commander1        = Ferdinand IWilhelm von Roggendorf\n| commander2        = Suleiman the MagnificentPargalı Ibrahim PashaPeter IV Rareș\n| strength1         = 20,000–30,000\n| strength2         = 100,000–120,000\n| casualties1       = 21,500\n| casualties2       = 65,000\n}}\nThe Habsburg–Ottoman war of 1529–1533 was the first of a long series of wars between the Habsburg and Ottoman Empire.\nSituation in Hungary\nThe events of the war are directly related to the civil war in Hungary between Ferdinand I and John Zápolya. After the defeat of the Hungarian army in the Battle of Mohács and the death of King Louis II of Hungary and his childlessness, some of the Hungarian landowners, with the consent of Sultan Suleiman I, chose the Transylvanian voivode Johan Zapolia. The Archduke of Austria, based on the provisions of the First Congress of Vienna, also declared his claim to the Czech and Hungarian crowns and occupied Hungary in the summer of 1528. Zapolia fled to Poland and appealed to Istanbul for help. The Turks helped him recapture Upper Hungary, and they themselves began to occupy the Hungarian domains of Northern Bosnia, Slavonia, and Croatia.\nIn 1528, Ferdinand sent his ambassadors to Constantinople with the proposal to conclude peace or at least a three-year truce. He also demands the return of 24 Hungarian cities that were captured by the Ottomans. On May 29, the ambassadors arrived in the Turkish capital. The Turks did not recognize the Habsburgs as the bearers of the Hungarian crown and considered Ferdinand to be only Charles V the seat of the emperor and not an independent leader and had no right to call himself king and demand anything. After nine months in prison, the ambassadors were sent back with a response that amounted to a declaration of war.\nSuleiman's third invasion\nAn Ottoman depiction of the siege from the 16th century, housed in the Istanbul Hachette Art Museum\nOn May 10, 1529, the 200,000-strong army of Sultan and Grand Vizier Ibrahim Pasha left Istanbul. On July 18, the Turkish army reaches Mohács, where they are joined by the Turkish vassal Johan Zapolia. On September 3, the Sultan reaches Buda and already on September 8 he conquers it. The 14th Turkish janissaries escort Johan Zapolian to the royal palace. On September 26–27, the Ottoman troops, accompanied by the fleet moving across the Danube, approached Vienna. Under the command of Philip Pfalz of Neisburg, Wilhelm von Rogendorf and Niklas von Salz, the garrison of Vienna numbered 17,000 men and had 72 cannons against the enemy's 300. During the siege, the Turkish army opens large cracks in the walls of the city with the help of artillery. Two mines collapse the wall near the Karitinian gates, and on October 10–12, the Ottomans launch a three-day fierce attack on the fortress. Under the leadership of von Zalm and Johann Katz, the defenders of Vienna repel the attacks of the Turks. Opening a bigger breach, on January 14, they launched a new attack in three lines, but were repulsed again. Count von Salz, who was standing in the first line of defense, is seriously injured as a result of the explosion of a Turkish mine.\nThat attack was the last. The cold had already begun, and the janissaries, having encountered quite serious resistance, refused to continue the siege. On October 16, the Sultan gathers the camp and begins the retreat. Vienna was able to be held, but the lands of Lower Austria and Styria as far as Linz were emptied, many inhabitants were killed or taken into slavery. The local militia managed to defend Upper Austria. Under the command of Hans von Staremberg, the lander was able to stop the 30,000-strong Turkish army moving towards Enns.\nAccording to researchers, the failure of the Turkish invasion was due to Ottoman tactics. The recruitment of the army started at the end of the year and only in April the army was able to leave Istanbul and move towards Buda. The distance between the two cities in a straight line is approximately 100&nbsp;km. The earliest the Ottomans could reach Habsburg Hungary was in July, thus leaving only three and a half months of hostilities, as the troops refused to fight once the autumn rains began.\nSuleiman's fourth invasion\nFerdinand's continued attempts to conquer Hungary, in particular the unsuccessful siege of Buda by the Habsburg commander Rogendorf in late 1530, made the sultan again want to organize a new raid on Vienna.\nOn April 25, 1532, a 200,000-strong army left Istanbul again (70,000 from Rumelia, 30,000 from Anatolia, 12,000 janissaries, 2,000 regular cavalry, 60,000 horsemen. Ferdinand's messengers arrived to meet the Sultan in Niš, trying to obtain an extension of the Visegrád Treaty, which had been signed by the Vy. Near Belgrade, the Turks were joined by 30,000 Crimean Tatars. This time the Turks moved along the left bank of the Drava, crossing Osijek, Babocha and Kanizsa. Conquering a number of Hungarian fortresses, the Ottoman army approaches Köseg (Güns) on August 5, which was defended by a garrison (700 men) under the command of Nikolay Jurišić. During the famous siege, which lasted from August 9 to 31, the defenders of the castle, with the help of the inhabitants and the inhabitants of the surrounding settlements, manage to repulse two attacks of the enemy. According to the legend, the Turks were not even allowed to enter the territory of the fortress.\nThis siege halted the advance of the Turks for a time, and the Sultan decided not to advance on Vienna, as the 100,000-strong army of Charles V stood between the Austrian capital and Wiener Neustadt, the only time it came to defend the Habsburg hereditary domains. Akinji forces empty Styria, Carinthia, attack Gratz, Friedberg, Kirchberg, Hartberg and other cities, even invade Upper Austria. The Ottoman chronicler presented with great enthusiasm in his works how the Ottoman soldiers plundered that rich country, which was like paradise. The imperial troops of Joachim Brandenburgz inflict several defeats on the Turks, force them to retreat and encircle and destroy 10,000 Turkish rearguards in Leobesdorf on September 19, including Kasim Bey, one of the leaders of the raid. September Turks begin to return to Istanbul, taking with them 30,000 slaves from Hungary, Slavonia and Styria.\nPeace Treaty\nAfter Suleiman's departure, the emperor disbanded the army without even attempting to organize a counter-rebellion or act in Hungary against Johann Zapolya. Ferdinand again offers the Sultan to make peace. Preoccupied with the attack of Andrea Doria's imperial fleet on the Morea and preparations for a new war with Iran, the sultan agreed to a peace in January 1533, and after the archduke's messenger handed over the keys to Esztergom, agreed to sign a peace treaty with Ferdinand: recognizing him as King of Hungary equal to Johan Zapolya. Thus the de facto division of Hungary into two parts.\nResult\nSoon, the Sultan canceled the agreement of 1533. The civil war in Hungary with the participation of Turkish troops continues. In 1538, a peace agreement was signed, by which Ferdinand became the successor of Johann Zapolia. The implementation of the provisions of that treaty in 1540 led to the Ottoman–Habsburg War (1540–1547)\nThe hereditary lands of the Habsburgs are severely crushed, which was most likely the Ottomans' goal, as it weakened Ferdinand's position in the struggle for Hungary. According to scholars, the total loss of life in Austria and Styria, killed and enslaved during the Ottoman–Habsburg War, is about 200,000, and it took several decades for the economy to recover.\nNotes\nReferences\nSources\n*\n*\n*\n*\nExternal links\n* [https://web.archive.org/web/20061031003248/http://www.bethlenhagyomanyorseg.hu/index.php?action=menu5&sapdir=6&sapienta=272 Bethlen Gábor Hagyomány Őrség Egyesület – Bécs ostroma 1529]\n* [http://www.bdmk.hu/Vas_Varmegye_FCCC/Vas_varmegye_adattar/Koszeg_torok_ostrom_bibliografia.htm Kőszeg, 1532. évi török ostroma (vasi bibliográfia)]"
    }
  ]
}