{
  "content": [
    {
      "type": "text",
      "text": "# Hairy-eared dwarf lemur__disambig_1\n\n| parent_authority = Petter-Rousseaux and Petter, 1967\n| image = ChirogaleusTrichotisWolf.jpg\n| status = EN\n| status_system = IUCN3.1\n| status_ref =\n| status2 = CITES_A1\n| status2_system = CITES\n| status2_ref =\n| range_map = Allocebus trichotis range map.svg\n| range_map_caption = Hairy-eared dwarf lemur range\n| synonyms = Cheirogaleus trichotis Günther, 1875\n}}\nThe hairy-eared dwarf lemur (Allocebus trichotis), or hairy-eared mouse lemur, is one of the most scarcely known lemurs. A. trichotis is a nocturnal lemur that is endemic to Madagascar. It was originally named by Albert Günther in 1875 as Cheirogaleus trichotis as part of the Cheirogaleidae family, or the dwarf lemurs. In 1967 Petter-Rousseaux and Petter reassigned the  lemur to its own genus and is the now only member of the genus Allocebus.  The hairy-eared dwarf lemur was thought to be extinct until its rediscovery in 1989 in a northeastern primary lowland rainforest. The population of these mammals is shown to be severely decreasing and largely fragmented throughout Northern and Eastern Madagascar rainforests; most likely due to hunting, trapping, slash-and-burn agriculture as well as habitat fragmentation.\nDiscovery\nAllocebus trichotis is thought to have been discovered as early as 1875 by Albert Günther.  The species was initially only studied from 5 museum specimens that are housed in 3 collections in various locations in London, Paris and Stockholm and was thought to be extinct in the wild. The hairy-eared dwarf lemur was then rediscovered in the wild in 1989 by Bernhard Meier when a small population was found in Northern Madagascar in a remote primary lowland rain forest. Researchers have also discovered the species living in a primary highland rainforest in eastern Madagascar in a very popular tourist location, Andasibe, Vavatenina. Small populations, as few as one A. trichotis, have also been located in other areas of Madagascar; indicating a more widespread distribution than previously thought.\nDescription\nWith the rediscovery of the hairy-eared dwarf lemur, new information regarding its physical description was obtained by Meier and Albignac when a small population was captured and observed in captivity. Information from the discovery of the lemur in an eastern rain forest has also been noted. Robin Lee Kolnicki describes Allocebus as a slightly larger Dwarf lemur; recent studies show the species weighs anywhere between 75-98 grams and anywhere from 125–145&nbsp;mm head and body length to 150–195&nbsp;mm head-to-tail length. Males and females have been shown to be similar in size and appearance. Hairy-eared dwarf lemurs can be distinguished easily from the other dwarf lemurs due to their very short, rounded ears with tufts of long, wavy hairs that project above the ear pelage; which are thought to be sensory hairs. There is an area of a darker grey triangle on their heads between their eyes and both of their eyes have dark narrow rings around them. Their nose and lips are a light pink color, and they exhibit an extraordinarily long tongue compared to other dwarf lemurs. The dorsal side of the lemur is a brownish grey, with a darker line of fur running along the spine. Their underbellies are grey, with the hairs ending in a white tip. Their hands and feet are a light rosy pink color, with long narrow nails protruding from them. The fur on their tails is short and becomes darker towards the tip. Little is known about the life span of the species, but other species in the similar genus Cheirogaleidae are thought to live around 15–19 years in captivity.\nDistribution, population and habitat\nThe hairy-eared dwarf lemur is likely to be critically endangered and the population is estimated anywhere from 100–1000 individuals. In 2008, the species was ranked as \"data deficient\" by the IUCN Red List, but is now classified as \"endangered\" according to the 2020 IUCN Red List. Research has shown that the distribution of this lemur is patchy, restrictive and they all live in a single location in specific parts of Madagascar, but the species may be more widely distributed than previously thought. All of the species that have been located in eastern Madagascar were found at the edge of primary highland rain forest at elevations anywhere from 680 to 1235 meters and all of the species located in northeast Madagascar were located in primary lowland rain forests. Locals of Madagascar call A. trichotis \"tsidy ala\", which translates to \"the mouse lemur of the big forest.\" Currently, there are a few known predators of A. trichotis; data shows that Malagasy carnivores (Eupleridae) and owls (Strigiformes) as well as humans are a threat.\nBehavior and reproduction\nA. trichotis seems to confide in live or dead fallen trees for its nesting and sleeping sites; usually in a hollow located within the trees. Observations show that the lemurs tend to build nests with a deep layer of straw or leaves and since they are exclusively nocturnal, they spend their days sleeping in the same tree hollow and cover themselves with the straw or leaves. The lemurs become active as soon as it becomes dusk and they remain active until the very first sign of light in the morning. While active, the lemurs have been observed to leap frequently through the tree branches. Once the lemurs return to their tree hollows, they were consistently observed sleeping with another of the same species and demonstrated acts of social grooming. They have been observed to be less active and can hardly be found during the dry season (June–September) by researchers as well as locals. There is not much information on their diet in the wild, but in captivity the lemurs were observed to eat various insects such as small/medium locusts, were often observed trying to catch flies outside of their cage, and consuming various fruits. The species is predicted to consume nectar and tree sap in the wild because they have an extraordinarily long tongue. The lemurs also have been observed eating while hanging upside down on a branch.\nIn the wild, up to 4 juveniles have reportedly been found in one tree hole. It is predicted that gestation occurs at the beginning of the wet season (November–December) and that they give birth in January–February; if their reproductive patterns are similar to other lemur species such as Microcebus and Cheirogaleus.\nVocalization\nLittle is known about the vocalization of the species, but recordings show their call is a short whistling series and harmonic; very similar to Microcebus.\nThreats and conservation\nA. trichotis has numerous threats, which most likely explains their low population size. Humans seem to have the largest impact on these mammals with acts such as deforestation, localized hunting and trapping for human consumption, and destruction of its rain forest habitat (primarily due to slash-and-burn agriculture).\nBecause the species is extremely difficult to locate due to its similarity to Microcebus rufus, distribution is recorded as being restricted and patchy with an overall low population density and the populations are rapidly declining in numbers due to rapid destruction of habitat.\nCurrently, there are species being held in captivity that are consistently being observed, with breeding programs designed to learn more about the animals and increasing the population size. Long-term research studies are also ongoing with hopes of finding out more about the mammal's ecology, habitat, distribution, social organization and competition in order to protect the species.\nConservationists want to expand protected parks to areas where the lemurs were located in the eastern highland rain forests and are currently unprotected, increasing the risk of extinction for the species.\n}}"
    }
  ]
}