{
  "content": [
    {
      "type": "text",
      "text": "# Hakeem: Seeking Justice\n\n| runtime        = 120 minutes\n| country        = Nigeria\n| language       = English\n| budget         =\n| gross          =\n}}\nHakeem: Seeking Justice (previously titled 'Seeking justice (Hakeem's story)') is a 2025 Nigerian Nollywood action film. Written by Abdulrasheed Bello, Leo Oji and directed by Abdulrasheed Bello. The movie talks about the story of an ex military soldier Hakeem Balogun who arrives home, found his family murdered and desired to seek justices for their death. The movie features popular Nollywood actors like  Deyemi Okanlawon, Regina Daniels, Zubby Micheal, Femi Branch, Chioma Akpotha and many others.\nSynopsis\nThe movie starts with Hakeem having a bad dream, tells his wife about the dream and they went ahead to visit their family doctor. Hakeem who is under medical checkup is informed by the doctor that he would have to go through surgery and it would cost 1.5 million naira. Monday calls Hakeem his old time friend about a security job that pays 1 million daily. Hakeem agrees to the idea and informed his wife.\nHakeem comes back home after the operation and found his wife and his child soaked in blood. They both died in the hospital and Hakeem swears to revenge their death. The police and reporters believed that the killings were as a result of gang war in Abuja.\nHakeem goes around killing every gang involved in the death of his wife and child, in search of the person who stabbed his child. He discovered that the killers were involved in organ trafficking and the family doctor recommended his family to be harvested. The reporter discovered in the office of the doctor, document signed by Hakeem and his wife to be organ donors. Hakeem goes to the doctors house to discover that the senator was the main trafficker in the whole event, he kills the doctor and uploads the information online and vows to kill the senator.\nHe kills the senator and surrenders to the police who charged and sentenced him to life in prisonment for multiple case of murder.\nPremiere\nThe movie was released and premiered on August 1, 2025 in all cinemas nationwide.\nCast\n*Deyemi Okanlawon\n*Regina Daniels\n*Zubby Micheal\n*Femi Branch\n*Chioma Akpotha\n*Boma Akpore\n*Ninalowo Bolanle\n*Eso Dike\n*Gabriel Afolayan\n*Ali Nuhu\nReferences\nExternal links\n*"
    }
  ]
}