{
  "content": [
    {
      "type": "text",
      "text": "# Hal King\n\n|birth_place=Oviedo, Florida, U.S.\n|death_date=\n|death_place=Oviedo, Florida, U.S.\n|debutleague = MLB\n|debutdate=September 6\n|debutyear=1967\n|debutteam=Houston Astros\n|finalleague = MLB\n|finaldate=October 1\n|finalyear=1974\n|finalteam=Cincinnati Reds\n|statleague = MLB\n|stat1label=Batting average\n|stat1value=.214\n|stat2label=Home runs\n|stat2value=24\n|stat3label=Runs batted in\n|stat3value=82\n|teams=\n*Houston Astros (1967–68)\n*Atlanta Braves (1970–71)\n*Texas Rangers (1972)\n*Cincinnati Reds (1973–74)\n}}\nHarold King (February 1, 1944 – March 23, 2019) was an American professional baseball player. He played in Major League Baseball and the Mexican League as a catcher from  to  for the Houston Astros, Texas Rangers, Atlanta Braves, Cincinnati Reds and the Saraperos de Saltillo.\nKing is notable for hitting a season-changing home run on July 1, 1973, for the then-slumping Reds, pinch-hitting a walk-off home run in the bottom of the ninth with the score at 3–1 Dodgers, two on base, and the count at 2 balls and 2 strikes. The play was credited with turning the season around, and the Reds ended the season by winning the division. The Cincinnati Enquirer called the home run one of the most dramatic in Reds history.\nEarly life\nKing was born in Oviedo, Florida, and attended Oviedo High School.\nCareer\nKing began his professional baseball career in 1962 with the barnstorming Negro league Indianapolis Clowns, and played for the team through 1964.\nKing was signed as an amateur free agent in 1965 by the California Angels. He was drafted by the Houston Astros from the California Angels in the  minor league draft. in , King led the Carolina League with 30 home runs along with 87 runs batted in and a .288 batting average while playing for the Asheville Tourists. His hitting performance earned him a late-season promotion to the major leagues.\nHe made his major league debut at age 23 with the Houston Astros on September 6, 1967 with an eighth-inning, pinch-hit ground out against future Baseball Hall of Fame member Gaylord Perry. His first major league hit came four days later on September 10, 1967, with a single off the Dodgers' Bill Singer. Later in the game he notched both his first triple and first run batted in, also against Singer, driving in Rusty Staub.\nKing spent the majority of the 1968 season in the minor leagues but, did appear in 27 games with the Astros. On March 11, 1969, he was traded by the Houston Astros to the Boston Red Sox for Mark Schaeffer. King played the  season with the Louisville Colonels of the International League, hitting for a .322 batting average with 9 home runs and 44 runs batted in. He was drafted by the Atlanta Braves on December 1, 1969, in the 1969 Rule 5 draft. His best season in the major leagues was with the 1970 Atlanta Braves. Appearing in 89 games, King had a .260 batting average with 11 home runs and 30 runs batted in.\nAfter two seasons with the Braves, he was sent to the Texas Rangers for Paul Casanova at the Winter Meetings on December 2, 1971. King started the 1972 season in a platoon role alongside right-hand hitting catcher, Dick Billings. He was sent back to the minor leagues in July, after posting only a .180 batting average. On December 1, 1972, the Rangers traded King with Jim Driscoll to the Cincinnati Reds for Jim Merritt. The Reds were looking to add to their catching lineup due to questions about Johnny Bench's playing future, as he'd had a recent diagnosis that would require lung surgery.\nKing became the Reds' third string catcher, playing behind starter and future Baseball Hall of Famer Bench and second stringer Bill Plummer. In the 1973 season, while the Reds were in a slump, King hit a home run that is considered to have been a season-changer. He hit three pinch-hit home runs to either tie or win games for the Reds that season. In the only postseason appearance of his career, King had one hit in three at bats as the Reds lost to the New York Mets in the 1973 National League Championship Series. King played his final major league game on October 1, 1974 at the age of 30.\nKing then had several successful years playing in the Mexican League from 1975 to 1979. As a designated hitter for the Saltillo Saraperos in 1979, he hit 19 home runs and led the league with 124 walks.\nSeason-changing home run\nOn July 1, 1973, the Reds were in a slump and trailing their National League Western Division rivals the Los Angeles Dodgers by 11 games in the standings; they had lost the previous night's game 8–7 in the 13th inning after starting with a 5–1 lead. The first game of a double header was 3–1 Dodgers in the bottom of the ninth with two on base. King, who had had only a single hit in his 10 at-bats for the Reds, was nevertheless known as a power hitter, and he had hit a grand slam against Don Sutton's screwball previously while playing for the Braves. Reds Manager Sparky Anderson sent him in to bat for Plummer.\nThe count was two balls and two strikes when King hit a walk-off home run, again against Sutton's screwball. King tore his cleats with the force of the hit. In the moment, Reds play-by-play announcer Al Michaels predicted, \"Boy, I tell you, if anything can turn a season around it is that play right there.\" King's home run was cited by Anderson as a turning point in the season. He told the Cincinnati Enquirer, “It was one of those things that when it happens you immediately think, ‘This is going to turn us around.' ” Nearly fifty years later in 2019 the Enquirer called it \"one of the most dramatic home runs in franchise history\". According to Sports Illustrated, after King's hit, \"[the Reds'] drive became a relentless thing\" and \"[Pete] Rose and most of the Reds consider [the game] they played on July 1 against Los Angeles as the turning point of their season.\nStarting with the win on King's home run, the Reds gained momentum. They won the second game of the double header, won against the Dodgers again the following day, won eight of their next nine games, and went on to post a 60–26 record for the remainder of the season to overtake the Dodgers and win the division championship.\nCareer statistics\nIn a seven-year major league career, King played in 322 games, accumulating 146 hits in 683 at bats for a .214 career batting average along with 24 home runs, 82 runs batted in and an on-base percentage of .325. He had a .982 career fielding percentage in 204 games as a catcher.\nLater life\nIn 1986–87, King was the president of the athletic boosters club of Oviedo High School and had a son in the school system. He died in 2019 in Oviedo, where he had a power washing and home maintenance business.\nReferences\nExternal links"
    }
  ]
}