{
  "content": [
    {
      "type": "text",
      "text": "# Hala Sultan Tekke (archaeological site)\n\n| alt =\n| caption =\n| map_type = Cyprus\n| map_alt =\n| relief = yes\n| coordinates =\n| map_size = 200\n| location = Larnaca, Cyprus\n| type = Settlement\n| part_of =\n| length =\n| width =\n| area =\n| height =\n| builder =\n| material =\n| built = 2nd millennium BC\n| abandoned =\n| epochs = Late Bronze Age\n| cultures =\n| dependency_of =\n| occupants =\n| event =\n| excavations = 1897–1898, 1948, 1971–2008, 2010–present\n| archaeologists = Henry Beauchamp Walters, John Winter Crowfoot, Arne Furumark, Vassos Karageorghis, Paul Åström, Peter Fischer\n| condition = Ruined\n| ownership = Public\n| public_access = No\n| website =\n| notes =\n}}\nHala Sultan Tekke (occasionally referred to as Dromolaxia-Vyzakia) is an ancient archaeological site which lies close to the mosque of the same name and the Larnaca International Airport on the south coast of Cyprus. The site lies on the western shore of the half square kilometer Larnaca Salt Lake. In the Late Bronze Age the lake was open to the Mediterranean, acting as a protected harbor for the settlement. Hala Sultan Tekke was occupied , and reached its peak in the 12th and 13th century BC before being destroyed and abandoned . Its ancient name is still unknown. The site has been subject to looting at various periods in the past and is endangered by modern deep agricultural plowing at the edges.\nArchaeology\nJohn Myres examined the site briefly in 1894. The site was excavated for about a week in December 1897 by Henry Beauchamp Walters on behalf of the British Museum with \"not more than 40 workers\". The extent of his work is unclear but he recorded 10 tombs. In April 1898 John Winter Crowfoot worked at the site for eight days, also for the British Museum. He emptied \"fifty or sixty chamber tombs and several wells\" and recorded 13 of the tombs which dated from the Middle Cypriot III and Late Cypriot IA-IIC periods (). The tombs had already been partly looted. Finds included Mycenae, Minoan, and Canaanite pottery, objects of gold, silver, faience, glass, bronze, and ivory, a cylinder seal, and a Cypro-Minoan inscribed clay ball. The excavator indicated some objects were imported from Egypt. In neither of these early excavations were resulted published though a few excavator notes are available. In 1948 Arne Furumark discovered a large pithos at the site and conducted a short excavation of it. In 1968 Vassos Karageorghis excavated two circular chamber tombs with central roof openings in a location later excavators called \"Area A, ‘The Cemetery’\". All the burials showed signs of plagiocephaly, intentional cranial deformation. Finds included animal bones, ostrich eggs, objects of silver, gold, ivory, bronze, lead, and carnelian, and three cylinder seals. Mycenae pottery and Late Minoan IIIA-IIIB stirrup jars, kraters, and a bowl were also found.\nIn 1971 a topographic survey was conducted in three trial trenches dug by the Swedish Cyprus Expedition from the University of Gothenburg, led by Paul Åström. The survey showed that the settlement covered about  east to west and about  north to south. In 1972, after a proton magnetometry survey was conducted, small scale excavations began, continuing until 2008, interrupted by war in 1974. Based on the survey areas were defined in the settlement. In Area 6, northwest, a  wall and 4th century BC sling bullets with signs in classical Cypriot syllabary were found. In Area 8, central, a large building dating to Late Cypriot III A2, with a courtyard, was discovered. One room in that build had ashlar block floors and walls revetted with thin stone slabs with a well containing \"drinking cups, grape pips, grains, and fishbones\". A wide staircase in the front of the room led down to the courtyard. Nearby finds included stone mould for casting copper arrowheads, a bronze shovel with twisted handle, a bronze needle, a bronze pin, a faience head, a carnelian bead, and two pithoi with short Cypro-Minoan syllabary inscriptions. Other finds in this area included terracotta figurines, faience beads, crushed murex shells, red ochre, an ivory comb, a clay ball and stone weights with Cypriot syllabary inscriptions, and a faience scepter with a cartouche of pharaoh Horemheb. Two looted chamber tombs were cleared and produced a hematite cylinder seal. An extensive industry in copper production and coppersmithing was discovered. Underwater exploration between Kiti and Cape Greco found a number of anchors and other nautical items from various periods. In 1979 a very low frequency discriminative detector survey found a number of metal object including lead sling bullets.\nCypro-Minoan clay ball in the Louvre.\nExcavation resumed (sometimes referred to as the \"New Swedish Cyprus Expedition\" or \"The Söderberg Expedition\") under Peter Fischer in 2010. The excavators noted that some looting has occurred in various periods at the site over the last century between excavations resulting in objects appearing on the antiquities market without provenance. From 2010 until 2019 excavation focused on city center area CQ1, CQ2, CQ3, and CQ4 (which was near the harbor) and buildings had sturdier construction. There were five strata of occupation layers:\n*Stratum 4-5 - 15th to 14th century BC\n*Stratum 3 - 13th century BC\n*Stratum 2 -\n*Stratum 1 - 1st half of 12th century BC\nMuch of the effort has been on the cemetery area and a major focus has been \"safeguarding and recording of tombs which are exposed to destruction by farming, erosion and potential looting\". The cemetery lies in the east-south-east part of the site, has an area of several hectares, and is on a slightly raised platform. The tombs there have associated ritual pits and consists of chamber tombs, shaft tombs, and re-used wells. Sample for AMS radiocarbon dating (calibration with INTCAL13) were collected from the city area and from the cemetery. Calibrating C-14 dated from this time are difficult.\nHistory\nThe chronology of Cyprus during the later half of the 2nd millennium BC is defined as follows (different researchers use slightly different dates):\n*Late Cypriot I LC I 1650–1550 BC\n*Late Cypriot IIA LC IIA 1550–1450 BC\n*Late Cypriot IIB LC IIB 1450–1300 BC\n*Late Cypriot IIC LC IIC 1300–1200 BC\n*Late Cypriot IIIA LC IIIA 1200–1100 BC\n*Late Cypriot IIIB LC IIIB 1100–1050 BC\nOccupation began  in Middle Cypriot III – Late Cypriot I with most of the earlier material being found in cemeteries. Primary remains from the site are from the final occupation from the 13th century BC until the middle of the 12th century BC in Late Cypriot III, A period when the settlement reached its greatest extent with an estimated population of about 11,000. Afterward it was permanently abandoned after being violently destroyed by fire , part of a region wide phenomenon. The town was laid out in a grid pattern with roads as wide as . Imports found at the site indicate it was part of a large trading network which extended to Egypt, Italy, the Aegean, Anatolia, and the Levant. The many Syria/Mesopotamia seals found show there was an administrative system.\nSee also\n*Cities of the ancient Near East\n*Enkomi (archaeological site)\n*Idalium\n*Kourion\n*Kition\nReferences\nFurther reading\n*Astrom, P., \"The bronzes of Hala Sultan Tekke\", in Muhly, J. D., Maddin, R., and Karageorghis, V. (eds.), Early Metallurgy in Cyprus, 4000-500 B.C., Pierides Foundation, Nicosia, pp. 177–183, 1982\n*Bürge, Teresa, \"Ritual depositions versus garbage pits: a re-evaluation of pottery deposits and offering pits at the Late Bronze Age city of Hala Sultan Tekke, Cyprus\", Ägypten und Levante/Egypt and the Levant 27, pp. 133–150, 2017\n*Bürge, Teresa, \"Recently discovered cylinder seals from Hala Sultan Tekke\", Ancient Cyprus Today. Museum Collections and New Research. Uppsala: Åströms Förlag, pp. 229–37, 2016\n*Bürge, Teresa, and Peter M. Fischer, \"New insights on burial practices at the Late Bronze Age city of Hala Sultan Tekke, Cyprus\", Ugarit-Forschungen 48, pp. 121–172, 2017\n*Bürge, T., \"The LC IIC to IIIA Transition at Hala Sultan Tekke: A Pottery Perspective\", Bürge, T.; Fischer, P.M. (eds), The Decline of Bronze Age Civilisations in the Mediterranean: Cyprus and Beyond. Nicosia: Astrom Editions, 2022\n*Fischer, Peter M, \"The Cemetery of Hala Sultan Tekke, Cyprus: Further Evidence of Interculturality and Burial Customs in the Late Bronze Age\", Near Eastern Archaeology 87.2, pp. 74–99, 2024\n*Fischer, P.M.; Bürge, T., \"Two Late Cypriot City Quarters at Hala Sultan Tekke: The Söderberg Expedition 2010-2017\", Uppsala: Astrom Editions, 2018\n*Gubel, Eric, and Joanna S. Smith, \"A Cylinder Seal from Hala Sultan Tekke, T. 1, MLA 1173\", Report of the Department of Antiquities, Cyprus, pp. 238–244, 2010\n*Mazzotta, L.; Recht, L., \"Mycenaean and Aegean Pottery from Hala Sultan Tekke 2013 and 2014\", Opuscula, 8, pp. 59–65, 2015\n*[https://iris.unive.it/retrieve/d9348f80-9289-4ac4-aab1-da7c4fd2e8f1/Brignone%2C%20Calvelli%2C%20Gollo%2C%20Mazzotta%202025%20A%20Land%20for%20Strangers.pdf#page=33]Mazzotta, Lorenzo, and Laerke Recht, \"The Role of Aegean Pottery in the Community of Late Bronze Age Hala Sultan Tekke, Cyprus\", A Land for Strangers, 2025\n*Mommsen, H.; Beier, T.; Åström, P., \"Neutron Activation Analysis Results of Six Mycenaean Sherds from Hala Sultan Tekke, Cyprus\", Archaeology and Natural Science, 2, pp. 5–10, 2003\n*Porada, Edith, \"Three Cylinder Seals from Tombs 1 and 2 of Hala Sultan Tekke\", Edith Porada zum 100. Geburtstag. A centenary volume, hrsg. v. Erika Bleibtreu, Hans Ulrich Steymans (Orbis biblicus et orientalis 268), pp. 285–292, 2014\n*Recht, L., \"Horse Figurines from Hala Sultan Tekke\", Opuscula, 11, pp. 67–9, 2018\n*Recht, L.; Mazzotta, L., \"Rhyta at Late Bronze Age Hala Sultan Tekke\", Opuscula, 8, pp. 65–70, 2015\nExcavation reports\n*Åström, P.; Bailey, D.M.; Karageorghis, V., \"Hala Sultan Tekke 1: Excavations 1897-1971\", Göteborg: Paul Åströms förlag, 1976\n*Engvig, O.T.; Åström, P., \"Hala Sultan Tekke 2: The Cape Kiti Survey, An Underwater Archaeological Survey\", Göteborg: Paul Åströms förlag, 1975\n*Åström, P.; Hult, G.; Olofsson, M.S., \"Hala Sultan Tekke 3: Excavations 1972\", Göteborg: Paul Åströms förlag, 1977\n*Hult, G.; McCaslin, D., \"Hala Sultan Tekke 4: Excavations in Area 8 in 1974 and 1975 and the 1977 Underwater Report\", Göteborg: Paul Åströms förlag, 1978\n*Öbrink, U., \"Hala Sultan Tekke 5: Excavations in Area 22, 1971-1973 and 1975-1978\", Göteborg: Paul Åströms förlag, 1979\n*Öbrink, U., \"Hala Sultan Tekke 6: A Sherd Deposit in Area 22\", Göteborg: Paul Åströms förlag, 1979\n*Hult, G., \"Hala Sultan Tekke 7: Excavations in Area 8 in 1977\", Göteborg: Paul Åströms förlag, 1981\n*Åström, P.; Åström, E.; Hatziantoniou, A.; Niklasson, K.; Öbrink, U., \"Hala Sultan Tekke 8: Excavations 1971-79\", Göteborg: Paul Åströms förlag, 1983\n*Åström, P., \"Hala Sultan Tekke 9: Trenches 1972-1987\", Göteborg: Paul Åströms förlag, 1989\n*Åström, P., \"Hala Sultan Tekke 10: The Wells\", Jonsered: Paul Åströms förlag, 1998\n*Åström, P., \"Hala Sultan Tekke 11: Trial Trenches at Dromolaxia-Vyzakia Adjacent to Areas 6 and 8\", Jonsered: Paul Åströms förlag, 2001\n*Åström, P.; Nys, K. (eds), \"Hala Sultan Tekke 12: Tomb 24, Stone Anchors, Faunal Remains and Pottery Provenance\", Sävedalen: Paul Åströms förlag, 2007\n*Fischer, P.M., \"The New Swedish Cyprus Expedition 2010: Excavations at Dromolaxia Vizatzia/Hala Sultan Tekke\", Opuscula, 4, pp. 69–98, 2011\n*Fischer, P.M., \"The New Swedish Cyprus Expedition 2011: Excavations at Hala Sultan Tekke”. Opuscula, 5, pp. 89–112, 2012\n*Fischer, P.M.; Bürge, T., \"The New Swedish Cyprus Expedition 2012: Excavations at Hala Sultan Tekke\", Opuscula, 6, pp. 45–79, 2013\n*Fischer, P.M.; Bürge, T., \"The New Swedish Cyprus Expedition 2013: Excavations at Hala Sultan Tekke\", Opuscula, 7, pp. 61–106, 2014\n*Fischer, P.M.; Bürge, T., \"The New Swedish Cyprus Expedition 2014: Excavations at Hala Sultan Tekke\", Opuscula, 8, pp. 27–79, 2015\n*Fischer, P.M.; Bürge, T., \"The New Swedish Cyprus Expedition 2015: Excavations at Hala Sultan Tekke\", Opuscula, 9, pp. 33–58, 2016\n*Fischer, P.M.; Bürge, T., \"The New Swedish Cyprus Expedition 2016: Excavations at Hala Sultan Tekke\", Opuscula, 10, pp. 50–93, 2017\n*Fischer, P.M.; Bürge, T., \"The New Swedish Cyprus Expedition 2017: Excavations at Hala Sultan Tekke (The Söderberg Expedition)\", Opuscula, 11, pp. 29–79, 2018\n*Fischer, P.M.; Bürge, T., \"The New Swedish Cyprus Expedition 2018: Excavations at Hala Sultan Tekke (The Söderberg Expedition)\", Opuscula, 12, pp. 287–326, 2019\n*Fischer, P.M.; Bürge, T., \"The New Swedish Cyprus Expedition 2019: Excavations at Hala Sultan Tekke (The Söderberg Expedition)\", Opuscula, 13, pp. 73–111, 2020\n*Fischer, P.M.; Bürge, T., \"The New Swedish Cyprus Expedition 2020 (The Söderberg Expedition): Excavations in the Cemetery of Hala Sultan Tekke\", Egypt and the Levant, 31, pp. 97–145, 2021\nExternal links\n*[https://www.britishmuseum.org/collection/object/G_1900-0521-1 Haematite cylinder seal with gold caps engraved with a god trampling a bull and a goddess with a supplicant - Hala Sultan Tekke - British Museum]\n*[https://www.britishmuseum.org/collection/term/x31312 Finds from Hala Sultan Tekke at British Museum]"
    }
  ]
}