{
  "content": [
    {
      "type": "text",
      "text": "# Halibut Treaty\n\nThe Halibut Treaty was a 1923 Canadian–American agreement concerning fishing rights in the northern Pacific Ocean. The treaty established the International Pacific Halibut Commission (IPHC) as a mechanism for the joint management of the Pacific halibut (Hippoglossus stenolepis) which, at that time, was in severe decline. The commission originally had four members but now has six, which are selected from industry and related government agencies. Half the members are Canadian and half are from the United States. The treaty also had a provision for a closed season, so halibut could not be fished during the more dangerous winter months. The treaty has been revised numerous times, often based on recommendations from the IPHC and its team of scientific researchers.\nBackground\nIn 1907, Canada began to negotiate its own commercial treaties. Prior to that, treaties had been negotiated on behalf of the Canadian government by the British government in London. However, those treaties negotiated since 1907 had all been signed into agreement by the British ambassador to Canada. In 1916, the British Columbia government was informed that halibut stocks were declining in the North Pacific Ocean. Large scale halibut fishing began after the opening of the Northern Pacific Railway to the Canadian Pacific Coast which allowed the transportation and sale of halibut in Eastern Canada. During World War I there was increasing cooperation between Canada and United States on trade issues. During the war, the value of halibut increased. Following the war in 1919, the United States and Canada agreed on a closed-season treaty that also included provisions for salmon fishing. The treaty failed to reach the United States Senate for approval.\nThe Canadian Prime Minister, William Lyon Mackenzie King, held the belief that only Canada through Parliament would determine its role within the British Empire. After negotiations over the Rush–Bagot Treaty failed due to British involvement, King intended to push for greater Canadian autonomy. King faced resistance to the treaty from the British Foreign Office. In 1921–22 some in the American halibut industry operated under a voluntary closed season.\n1922 proposal\nIn 1922, Canada proposed a treaty that dealt only with halibut. Named, the Convention for the Preservation of Halibut Fishery of the Northern Pacific Ocean, this treaty created the International Fisheries Commission (IFC), which was initially intended just as a study institute, not for management. The treaty was birthed from Article VII of the previous salmon and halibut treaty. The treaty proposed a season closed to commercial fishing from 16 November to 15 February. Those that were caught during this period faced penalties up to and including seizure. By the 1920s, halibut stocks were noticeably lower to all parties and in 1923, the treaty was ratified by the United States Congress in 1923. The treaty went into effect in 1927.\nIn a break with standard empire practice at the time, in March 1923 King demanded to sign the treaty alone, without a British countersignature. The British initially refused but relented when King threatened to send an independent Canadian diplomatic representative to Washington, D.C. The treaty was signed by Ernest Lapointe, the Canadian Minister of Marine and Fisheries and Charles Evans Hughes, the United States Secretary of State on 23 March and intended to last five years.\nResult\nIt was the first treaty negotiated by and signed only by Canada, independent of Britain. The British had relented as King's intention to send a delegation to Washington, D.C. would have bypassed British authority.  The British had argued correctly, that what Canada had done had been illegal. However, at the 1923 Imperial Conference the British believed the Halibut Treaty set a new precedent for the role of the British Dominions, which had emerged following a series of events, among them the Chanak Crisis.\nThe ratification of the treaty paved the way for further British colony independence, including the Balfour Declaration at the Imperial Conference in 1926, which recognized that British Dominions were \"autonomous communities within the British Empire, equal in status, in no way subordinate\", and finally the Statute of Westminster in 1931 which repealed the Colonial Laws Validity Act and removed the last vestiges of the ability of the British government to create law which applied to its former colonies.\nThe lack of regulatory powers given to the IFC led to a continued decrease in halibut stocks. In 1930, the commission was expanded to include regulatory powers in a second convention. The treaty was reviewed and amended further in 1937, 1953 with a protocol created in 1979. The IFC was renamed the International Pacific Halibut Commission and expanded to six members. Following the emergence of the Quebec sovereignty movement, the Halibut Treaty was put forward as a method to be used by the provincial government of Quebec to earn independence from Canada.\nCitations\nSources\n*\n*\n*\n*\n*\n*\n* }}"
    }
  ]
}