{
  "content": [
    {
      "type": "text",
      "text": "# Hambone Award\n\n| location         =\n| country          = United States\n| presenter        =\n| eligibility      =\n| post-nominals    =\n| ribbon           =\n| obverse          =\n| reverse          =\n| former name      =\n| campaign         =\n| motto            =\n| clasps           =\n| reward           =\n| year             =\n| year2            =\n| website          =\n| image2           =\n| image2_size      =\n| alt2             =\n| caption2         =\n| related          =\n| previous         =\n| main             =\n| next             =\n}}\nThe Hambone Award is presented annually by the Veterinary Pet Insurance Company subsidiary of Nationwide Insurance to the family of the pet that wins a public vote determining whose injuries were caused by the most unusual circumstances.\nHistory\nIt is named for an unusual accident suffered by a client covered by a pet insurance policy, an unnamed dog who reportedly was trapped in a refrigerator for several hours and suffered a mild case of hypothermia while waiting for rescue, consuming the family's holiday ham during the process. The winner receives a bronze ham-shaped trophy, a gift card, and an award to be donated to an approved pet-related charity.\nVoting is open for approximately one week. The first winner, Lulu, made a televised appearance on Rachael Ray.\n{|class=\"wikitable sortable\" style=\"font-size:100%;text-align:center;\"\n|+Hambone Award winners\n! Year !! Name !! Animal !! class=\"unsortable\" | Injury\n|-\n! 2009\n| Lulu || English bulldog\n| style=\"text-align:left;\" | Over six months, ate 15 pacifiers, a bottle cap, and part of a basketball; discovered after owner noticed a pacifier went missing immediately after being dropped and licked.\n|-\n! 2010\n| Ellie || Labrador retriever\n| style=\"text-align:left;\" | Ate beehive left by exterminators; owners noticed dog was vomiting \"hundreds of bees\".\n|-\n! 2011\n| Harley || Pug\n| style=\"text-align:left;\" | Ate rocks, causing bowel obstruction; owner was frightened by bowel movements that were composed mostly of rocks.\n|-\n! 2012\n| Peanut || mixed Dachshund / Terrier\n| style=\"text-align:left;\" | Sprayed by skunk and nearly suffocated after becoming trapped in loose dirt under owner's deck; deck was dismantled and owners retrieved dog after spotting one free paw.\n|-\n! 2013\n| Winnie || mixed-breed dog\n| style=\"text-align:left;\" | Ate  of frozen onion rings.\n|-\n! 2014\n| Charlie || Labrador retriever\n| style=\"text-align:left;\" | Run over by farm equipment towed behind tractor, fracturing spine and damaging kidney, which had to be removed.\n|-\n! 2015\n| Curtis || Boxer\n| style=\"text-align:left;\" | Ate wooden barbecue skewer; removed nearly one year later, having been encapsulated in a baseball-sized foreign body granuloma.\n|-\n! 2016\n| Kismet || Jack Russell terrier\n| style=\"text-align:left;\" | Stabbed by burglar during violent robbery.\n|-\n! 2017\n| Rooster || mixed hound\n| style=\"text-align:left;\" | Impaled by branch more than  long while hiking with owner.\n|-\n! 2018\n| Ziva and Zeus || German shepherds\n| style=\"text-align:left;\" | Escaped from yard and missing for three weeks after being trapped inside abandoned missile silo  from owners' home.\n|-\n! 2019\n| Minnow || Domestic shorthair\n| style=\"text-align:left;\" | Indoor/outdoor cat; missing for three weeks; suffered starvation, dehydration, and a broken rib.\n|-\n! 2020\n| Chopper || Boxer\n| style=\"text-align:left;\" | Burst through a window while trying to greet a visitor, injuring paws and tendons.\n|-\n! 2021\n| Bruin || German shepherd\n| style=\"text-align:left;\" | Broke leg and missing for four days after falling  into a canyon.\n|-\n! 2022\n| Rafa || Siberian cat mix\n| style=\"text-align:left;\" | Developed severe hypothermia after being trapped in storm drain.\n|-\n! 2023\n| Giles || Domestic shorthair\n| style=\"text-align:left;\" | Although instructed to check for cat, inadvertently folded into sofa bed, requiring stitches.\n|-\n! 2024\n| Luca || Shiloh shepherd\n| style=\"text-align:left;\" | Pulled kitchen cabinet off tracks and ate garbage.\n|}\nReferences\nExternal links\n*"
    }
  ]
}