{
  "content": [
    {
      "type": "text",
      "text": "# Hamilton, Queensland\n\n| pop                 = 8922\n| pop_year            =\n| pop_footnotes       =\n| established         =\n| postcode            = 4007\n| area                = 3.4\n| timezone            = AEST\n| utc                 = +10:00\n| dist1               = 5.4\n| dir1                = NE\n| location1           = General Post Office, Brisbane\n| dist2               =\n| dir2                =\n| location2           =\n| dist3               =\n| dir3                =\n| location3           =\n| dist4               =\n| dir4                =\n| location4           =\n| elevation           = 10-68\n| lga                 = City of Brisbane(Hamilton Ward)\n| stategov            = Clayfield\n| fedgov              = Brisbane\n| near-n              = Ascot\n| near-ne             = Eagle Farm\n| near-e              = Eagle Farm\n| near-se             = Murarrie\n| near-s              = BulimbaMorningside\n| near-sw             = Newstead\n| near-w              = Albion\n| near-nw             = Ascot\n}}\nHamilton is a riverside mixed-use suburb in the north-east of the City of Brisbane, Queensland, Australia. Hamilton is located along the north bank of the Brisbane River. In the , Hamilton had a population of 8,922 people.\nGeography\nThe suburb is bounded by the Brisbane River to the south and this section of the river is known as Hamilton Reach ().\nKingsford Smith Drive enters the suburb at its south-west corner (from Albion) and runs along the river for approx  before heading north-east away from the river and exiting the suburb to the north-east (to Eagle Farm).\nHistorically Kingsford Smith Drive divided the suburb into a hilly residential area to the north and west of the road and a flat industrial area to the south and east which featured wharves used for the transport of goods (and for a time Brisbane's main port facility). However, the need to accommodate larger vessels has led to the relocation of wharves to the current Port of Brisbane at the mouth of the river and the rising value of riverfront land for residential purposes has led to an urban redevelopment plan called Hamilton Northshore, in which industrial sites will gradually be replaced by residential development and associated services.\nThe western part of suburb is hilly with views of the Brisbane central business district, including:\n* Toorak Hill () at  above sea level\n* Eldernell () at  above sea level\nAlthough not passing through the suburb, the Doomben railway line runs immediately north of the northernmost part of the suburb with Doomben railway station serving the suburb ().\nRacecourse Road is a north–south road that connects Kingsford Smith Drive and the Eagle Farm Racecourse. It is a dining, shopping and entertainment precinct.\nCameron Rocks are located on the riverbank in the south-west of the suburb (). Bretts Wharf ferry terminal is also on the riverbank opposite Racecourse Road ().\nHistory\nIt is believed the first hotel in the district was built by the Gustavus Hamilton (father of Messrs. F. G. Hamilton, barrister, and R. Hamilton, surveyor). Amongst the earlier lessees of the hotel was a Mrs. Warren, who, by coincidence, married another Mr. Hamilton, so that the hotel was occupied by different families of the name Hamilton. The Hamilton Hotel became an easy reference mark in the days when buildings were few in the district, and its name was gradually applied to the whole district.\nIn March 1884, 19 allotments from \"Belle Vue Estate\" were advertised to be auctioned by E. Hooker & Son, Auctioneers. A map advertising the auction states the estate was \"the pick of the Mount Pleasant Estate\" at Breakfast Creek and contains a locality sketch.\nIn September 1885, \"The Hamilton Reach Estate\" comprising 428 allotments were advertised to be auctioned by Arthur Martin & Co., Auctioneers. A map advertising the auction shows the estate had frontage on the Brisbane River and contains a locality sketch. In October 1885, \"Wickham Estate\" consisting of 412 allotments were advertised to be auctioned by John Cameron, Auctioneer. A map advertising the auction includes a local sketch of the area. Newspaper advertising states the estate is \"situated on the bank of the Brisbane River, immediately below the Hamilton Hotel, and is intersected by the Eagle Farm Road and Nudgee Road\".\nIn July 1887, 54 allotments from \"Russell Association Land\" were advertised to be auctioned by James R. Dickson & Company, Auctioneers. A map advertising the auction states the estate held \"magnificent sites, commanding views of the city and Brisbane River\".\nHamilton State School opened on 19 March 1907. Hamilton Methodist Church was dedicated on 11 May 1911, but services had been held at the site since 26 January 1907. It was remodelled a number of times over the years, including the 1971 addition of the pipe organ from the former Congregational Church in Baroona Road, Milton. On 12 October 1976, it was renamed St Luke's and in 1977 with the amalgamation of the Methodist Church into the Uniting Church in Australia, it became St Luke's Hamilton Uniting Church.\nArchbishop James Duhig laid the foundation block of St Cecilia's Catholic Church on Sunday 14 December 1913. The church was officially opened, blessed and dedicated on Sunday 5 April 1914 by Archbishop Duhig.\nOn Sunday 1 October 1916, Archbishop Duhig laid the foundation stone for St Cecilia's Convent School. Archbishop Duhig officially opened the school on Sunday 21 January 1917. It was operated by the Sisters of Mercy and was just to the north of the church. It closed on 4 December 1981. It was on the north-east corner of Windsor Street and Hants Street (). As at 2025, the former school building is now a childcare centre.\nAfter World War I, a war memorial was built alongside the Brisbane River near Cameron Rocks (). It was unveiled by the Queensland Governor John Goodwin on Sunday 16 August 1931.\nThe Hamilton Library opened in 1947. In 1947 five priests of the Augustinian Order established a secondary school for Catholic boys called Villanova College after St Thomas of Villanova in a house called Whinstanes on a  site on College Road (). Archbishop Duhig officially opened the school on Sunday 25 January 1948 with an initial enrolment of 40 days. The number of students grew so quickly that by 1951 it was necessary to find a new location. In 1954, the school was transferred to the school's current site at Coorparoo.\nThe Archbishop's Chapel of The Good Shepherd at Bishopsbourne (the residence of the Anglican Archbishop of Brisbane) was dedicated on 4 November 1964 by Archbishop Philip Strong. Its closure on 20 December 2006 due to the sale of the property was approved by Archbishop Phillip Aspinall.\nIn 1967, the Mission to Seafarers opened the Anglican Chapel of St Nicolas in Hamilton. It was dedicated by Coadjutor Bishop Hudson on 4 November 1967. Its closure on 17 June 2007 was approved by Bishop Adrian Charles.\nThe development of the Northshore Hamilton project was announced on 27 March 2008 by the Urban Land Development Authority. A concept master plan for Northshore Hamilton was released by Premier Anna Bligh in September 2008. Northshore Hamilton is planned to host the Olympic Village for the 2032 Summer Olympics, which will house around 10,000 people. The village will likely be turned into real estate after the Games end.\nDemographics\nIn 2013, the suburb had the highest mean taxable income of any in Queensland. In the , Hamilton had a population of 6,995 people, which increased to 8,922 people in the .\nHeritage listings\nHamilton has a number of heritage-listed sites, including:\n* Toorak House, 28 Annie Street\n* Lochiel, 6 Hillside Crescent\n* Marie Ville/Eltham, 16 Hillside Crescent\n* El Nido, 194 Kingsford Smith Drive\n* Greystaines, 240 Kingsford Smith Drive\n* Woolahra, 1 Lexington Terrace\n* Hamilton State School, Oxford Street ()\n* Cremorne, 34 Mullens Street\n* Palma Rosa, 9 Queens Road\n* Hamilton Town Hall, 36–42 Racecourse Road\nEducation\nHamilton State School is a government primary (Prep–6) school for boys and girls in Oxford Street (). In 2018, the school had an enrolment of 117 students with 12 teachers (7 full-time equivalent) and 10 non-teaching staff (5 full-time equivalent).\nAmenities\nThe Brisbane City Council operates a public library at 36 Racecourse Road (corner Rossiter Parade, ). Hamilton Post Office is at 11 Racecourse Road ().\nChurches\n* St Augustine's Anglican Church is at 56 Racecourse Road ().\n* St Cecilia's Catholic Church is at 30 College Road ().\n* St Luke's Hamilton Uniting Church is on Jackson Street (corner of Oxford Street, ). It is part of the Moreton Rivers Presbytery of the Uniting Church in Australia.\nParks\nThere are a number of parks, including:\n* Cameron Rocks Reserve ()\n* Crosby Park ()\n* Hamilton Park ()\n* Hercules Street Park ()\n* Mikado Street Park ()\nCityCat stops are Bretts Wharf and, since October 2011, Northshore Hamilton.\nReferences\nExternal links\n*\n*\n*\n*\n*\n*[http://www.innernorth.com.au/suburb/hamilton.htm Hamilton], suburb info"
    }
  ]
}