{
  "content": [
    {
      "type": "text",
      "text": "# Han Willhoft-King\n\n|birth_date          =\n|birth_place         = London, England\n|height              = 1.74 m\n|position            = Midfielder\n|currentclub         =\n|clubnumber          =\n|youthyears1         = 2012–2024\n|youthclubs1         = Tottenham Hotspur\n|youthyears2         = 2024–2025\n|youthclubs2         = Manchester City\n|nationalyears1      = 2021\n|nationalteam1       = England U16\n|nationalcaps1       = 2\n|nationalgoals1      = 0\n|club-update         = 5 June 2024\n|nationalteam-update = 17 August 2023\n}}\nGabriel Han Willhoft-King (born 24 January 2006), commonly known as Han Willhoft-King, is an English former professional footballer who last played as a midfielder for Manchester City.\nEarly life\nWillhoft-King was born in London to a British-Indian father who grew up in Jakarta, Indonesia and Chinese-American mother with parents from Liaoning and Taiwan.\nClub career\nWillhoft-King joined the academy of Tottenham Hotspur at the age of six, progressing through their academy and being named by English newspaper The Guardian as the best player in his age-group at the club in September 2022. He turned down a contract offer from Tottenham and left the club at the end of the 2023–24 season following the conclusion of his scholarship. After leaving Tottenham, he planned to go to University of California but instead joined Manchester City during the summer of 2024.\nAfter a season at Manchester City, Willhoft-King confirmed in a 2025 interview with The Guardian that he had retired from professional football and had matriculated as a law undergraduate at Brasenose College, Oxford.\nInternational career\nDue to his ancestry, Willhoft-King is eligible to represent England, China, Germany, the US, Indonesia, and India at international level. He made two appearances for the England under-16 side in 2021, featuring in a 3–2 win over Scotland and a 3–1 win over Turkey.\nIn July 2023, he was considered for selection to the Indonesia under-17 side by manager Bima Sakti ahead of the 2023 FIFA U-17 World Cup, with Sakti stating that Willhoft-King's parents had been contacted. However, later in the same month, Sakti announced that Willhoft-King's call-up had been cancelled, after his parents confirmed that he did not have an Indonesian passport, and the naturalisation process would take too long.\nReferences"
    }
  ]
}