{
  "content": [
    {
      "type": "text",
      "text": "# Hans Warren\n\n| birth_place = Borssele\n| death_date =\n| death_place = Goes\n| resting_place =\n| occupation =\n| language =\n| nationality =\n| ethnicity =\n| citizenship =\n| education =\n| alma_mater =\n| period =\n| genre =\n| subject =\n| movement =\n| notableworks =\n| spouse =\n| partner =\n| children =\n| relatives =\n| awards =\n| signature =\n| signature_alt =\n| years_active =\n| module =\n| website =\n| portaldisp =\n}}\nJohannes Adrianus Menne Warren (20 October 1921, in Borssele – 19 December 2001, in Goes) was a Dutch writer. Much of his fame in the Netherlands derives from having published a collection of diaries in which he described his life and homosexual experiences in a country that deeply repressed homosexuality. He is also known for his poetry, his literary criticism, and his translations of poetry from Modern Greek.\nYouth\nWarren was born in Zeeland, the only child of an engineer and a school teacher. As a child, he had few friendships among his peers, and when he was a student at the lyceum in Goes developed a great interest in nature. After graduation, he began writing articles for nature magazines, and was especially interested in birds. Jac. P. Thijsse was his model. For a while, he worked as a volunteer at an institute for dialectology. Even before the start of World War II, he began keeping a diary.\nWriting career\nAfter the war, Warren began publishing: in 1946, he published Pastorale, a collection of poetry; in 1947, a study on Jac. P. Thijsse; and in 1949 a book on nocturnal birds. In 1951, he began to write reviews and literary criticism for the Provinciale Zeeuwse Courant, one of the foremost newspapers in Zeeland. He wrote these columns and reviews until his death.\nMarriage years\nIn 1952 he married an English woman, and they had three children. Soon after their marriage his wife was offered a position in Paris, where Warren's repressed homosexual feelings found an outlet in many contacts with North African boys. Although this created tension in his marriage, it also sparked his poetic career: Warren published three collections of poetry during his years in Paris, and the marriage, in the end, lasted until 1978.\nCreative period\nIn 1958 the family returned to Zeeland, and Warren produced little writing until the end of the 1960s, when the publishing company Bert Bakker published a collection of new poems by Warren, Tussen hybris en vergaan. In 1969 Warren met Gerrit Komrij and the two poets began a long and mutually inspiring friendship. During the next ten years, Warren published a new book of poetry every year.\nIn 1978 Warren met Mario Molegraaf, forty years his junior (Warren was 57 at that time). The two began a tumultuous love affair that lasted until Warren's death. Molegraaf was a talented writer himself, and together they published a number of translations: the entire work of Constantine P. Cavafy, several poems by George Seferis, works by Plato and Epicurus, and the four gospels.\nSecret Diary and other publications\nThe publication of his series of diaries caused some concern among Warren's friends and colleagues: as the title implies, the diaries are quite frank. Warren openly describes his own life and experiences, and offers his opinions on everyone, including his friends. The twentieth volume covered the years 1996 to 1998, with one more volume to be published.\nFrom 1985 until 2002, Meulenhoff published a Warren calendar with a poem each day. Together with Molegraaf, Warren published several popular poetry anthologies.\nDeath and afterlife\nWarren died at age 80 of liver problems; even his final year is described in his diary (which he kept until three days before his death) and in that of Molegraaf (published in 2002). In 2004, two novels he wrote in 1950 (Een vriend voor de schemering and Om het behoud der eenzaamheid) were rediscovered; Een vriend voor de schemering was published in 2005. A movie based on his novel Steen der hulp is in production.\nAwards\n* 1958 – Lucy B. en C.W. van der Hoogtprijs for Saïd\n* 1970 – Pierre Bayle-prijs for his literary criticism\n* 1971 – Zeeuwse prijs voor Kunsten en Wetenschappen for his entire oeuvre\n* 1981 – Culture award from the city Goes for Geheim dagboek and his weekly literary reviews in the Provinciale Zeeuwse Courant\nBibliography\nPoetry\n* 1946 – Pastorale\n* 1951 – Eiland in de stroom\n* 1954 – Leeuw lente\n* 1954 – Vijf in je oog\n* 1957 – Saïd\n* 1966 – Een roos van Jericho\n* 1969 – Tussen hybris en vergaan\n* 1970 – Kritieken\n* 1972 – Schetsen uit het Hongaarse volksleven\n* 1972 – Verzamelde gedichten 1941–1971\n* 1973 – De Olympos\n* 1974 – Betreffende vogels\n* 1974 – Een liefdeslied\n* 1974 – Herakles op de tweesprong\n* 1975 – 't Zelve anders\n* 1975 – Winter in Pompeï\n* 1976 – Demetrios\n* 1976 – Sperma en tranen\n* 1976 – Zeggen wat nooit iemand zei\n* 1976 – Zeven gedichten van liefde\n* 1978 – De vondst in het wrak\n* 1978 – Een otter in Americain\n* 1978 – Behalve linde, tamarinde en banaan (revised edition of Sperma en tranen)\n* 1978 – Voor Mario\n* 1981 – Verzamelde gedichten 1941–1981\n* 1982 – Dit is werkelijk voor jou geschreven (self-selected anthology)\n* 1986 – Bij Marathon\n* 1986 – Tijd\n* 1987 – Ik ging naar de geheime kamers\n* 1989 – Binnenste buiten\n* 1992 – Nakijken, dromen, derven\n* 1993 – Indigo\n* 1996 – Ik ging naar de Noordnol\n* 2001 – De Oost\n* 2001 – Een stip op de wereldkaart\nProse fiction\n* 1975 – Steen der hulp (tweede druk 1983; trans. in English as Secretly Inside\n* 2004 – Tussen Borssele en Parijs\n* 2005 – Een vriend voor de schemering\nNon-fiction\n* 1947 – In memoriam Dr. Jac. P. Thijsse\n* 1949 – Nachtvogels\n* 1981 – Geheim dagboek 1942–\n* 1987 – Het dagboek als kunstvorm\n* 1993 – Geheim dagboek 1939–1940\n* 2001 – Om het behoud der eenzaamheid (selections from Geheim dagboek)\nAnthologies\n* 1959 – Mijn hart wou nergens tieren (bloemlezing uit het werk van P.C. Boutens)\n* 1980 – Spiegel van de Nederlandse poëzie (revised edition 1984)\nReferences\nExternal links\n*[http://www.dbnl.nl/auteurs/auteur.php3?id=warr002 Hans Warren in the Digital Library, Bibliotheek voor de Nederlandse Letteren]\n*[http://home.zonnet.nl/h.warren Website dedicated to Hans Warren]\n*[http://www.zeeuwsebibliotheek.nl/catalogi/collecties/warren Collection Hans Warren in the Zeeuwse Bibliotheek]\n*[http://beeldbank.zeeuwsebibliotheek.nl/component/option,com_memorix/Itemid,2/task,result/ Photographs by Hans Warren in Beeldbank Zeeland]"
    }
  ]
}