{
  "content": [
    {
      "type": "text",
      "text": "# Hans Christian Andersen's The Emperor's New Clothes\n\nThe Emperor's New Clothes}}\n}}\n'Hans Christian Andersen's The Emperor's New Clothes' is an animated television special broadcast on ABC on Monday night, February 21, 1972. The special was produced by Rankin/Bass Productions, a former division of Tomorrow Entertainment, using their \"Animagic\" stop-motion puppetry technique in Japan, along with some live-action footage shot in Denmark.\nThe special, a musical adaptation of the fable of the same name by Hans Christian Andersen, starred Danny Kaye as the voice of the narrator and main character named Marmaduke. Kaye was strongly associated with the author, having previously played the title role in the 1952 film Hans Christian Andersen. The cast also included Cyril Ritchard, Imogene Coca, Allen Swift and Bob McFadden. Kaye sang five original songs written by Maury Laws and Jules Bass: \"Come Along with Me\", \"Clothes Make the Man\" with Swift, \"The Tailor's Song\", \"Creation\", and \"All You Need Is Money to Be Rich\" with Coca, while Ritchard sang \"I See What I Want to See\".\nThe special was intended to serve as a pilot for a series titled The Enchanted World of Danny Kaye, with various specials and installments planned, and the special was initially marketed as such. Cartoonist Jack Davis, who designed characters for the special, also had concept drawings for further specials, which can be glimpsed in the making-of documentary on the 30th anniversary DVD release by Sony Wonder and Classic Media in 2002. No further specials were produced.\nPlot\nDanny Kaye tells a group of Danish children the story of \"The Emperor's New Clothes\", from the point of view of Marmaduke, a smooth-talking, yet kindly trickster.\nMarmaduke and his sidekick Mufti hear that a million gold pieces will be awarded to the tailor who makes the best clothes for the emperor. Marmaduke meets the emperor's daughter, Princess Jane, who tells him about the wicked jester, Jasper.\nJasper flatters the vain emperor with luxurious clothing, and is taking control of the empire. Jasper pays the tailors starvation wages, and gets rich himself. Marmaduke vows to stop Jasper, but the emperor has them thrown into the Boulevard of Rogues to work.\nMarmaduke is patching up an old suit for the emperor. An orphan boy named Busky joins them. They finish the suit, and escape the boulevard, crossing a dangerous moat.\nMarmaduke tells the emperor that he and Mufti have brought a beautiful suit for him. The emperor sees the ragged suit and orders them to leave. Marmaduke says he has enchanted cloth, invisible to anyone who is stupid or unfit to hold office. He pretends to show the emperor, who cannot admit that he cannot see it. Jasper plans to trick Jane into marriage.\nMarmaduke, Mufti and Busky pretend to work on the suit that isn't there, as the emperor tries to educate himself so that he's smart enough to see the cloth. Jasper threatens to have his henchman Ivan fire the cannon at the Boulevard of Rogues. He threatens to take the prize money.\nMarmaduke and his friends concoct a plan. Mufti makes fake coins from brass statues brought by Jane. Marmaduke presents the new suit to the emperor, who gives them the prize money in leather sacks. They hide the fake coins in Ivan's cannon, but Jasper orders them to stop. Real gold coins end up in the cannon.\nLater, the emperor shows off his new \"suit.\" The council gasps at the naked emperor, but Jasper gestures for all to applaud. Jasper tries to arrange a wedding with Jane, but Busky interrupts the procession by laughing and telling the emperor he is naked. The council agrees that the emperor is naked. Furious, the emperor banishes Jasper for allowing Marmaduke to trick him.\nBusky gives the emperor a note explaining that Jane and Marmaduke are going to marry. Realizing that she loves Marmaduke, the emperor leads a parade through town to the Boulevard of Rogues, and attends the wedding naked. Jasper furiously orders Ivan to fire the cannon into the crowd. The cannon shoots out the golden coins, providing riches to the poor folks of the Boulevard. Mufti mourns the loss of the prize money but Marmaduke is happy as he kisses Jane.\nProduction\nDanny Kaye recorded the soundtrack for Rankin/Bass in New York City, filmed the live-action segments in Aarhus, and visited the \"Animagic\" studio in Tokyo to see the production of the stop-motion animation.\nWhen Kaye toured their studio with Arthur Rankin, Jr., the Japanese animators asked him for \"a sample of the Danny Kaye style.\" Later, he explained, \"They wanted to see how I moved my hands, my mouth. Did I wiggle my ears when I sang? How did I walk? How did I walk when I wore a cape, and so on. The technicians painstakingly captured every nuance, every gesture to animate the figures. They're really marvelous.\"\nCast\n* Danny Kaye: Himself (in the live-action scenes), Marmaduke\n* Cyril Ritchard: Emperor Klockenlocher\n* Imogene Coca: Princess Jane Klockenlocher\n* Allen Swift: Mufti, The Prime Minister, Ivan\n* Bob McFadden: The King of Konga, Jasper, The Primer Minster, The Primest Minister\n* Gary Shapiro: Busky\nCrew\n* Producers/Directors: Arthur Rankin, Jr., Jules Bass\n* Writer: Romeo Muller\n* Music and Lyrics: Maury Laws, Jules Bass\n* Associate Producer: Herbert Bonis\n* Character Designers: Paul Coker, Jr., Ichiro Komuro\n* Continuity Designers: Don Duga, Steve Nakagawa\n* Editorial Supervisor: Irwin Goldress\n* Sound and Effects Engineers: Jim Harris, John Boyd\n* Animagic Supervisor: Akikazu Kono\n* Music Composer, Arranger and Conductor: Maury Laws\nSongs\n#Come Along with Me (opening theme)&nbsp;– Danny Kaye\n#Clothes Make the Man&nbsp;– Marmaduke, Mufti\n#The Tailor's Song&nbsp;– Marmaduke, the Tailors\n#I See What I Want to See&nbsp;– Emperor Klockenlocher\n#Creation&nbsp;– Marmaduke\n#All You Need Is Money to Be Rich&nbsp;– Marmaduke, Princess Jane Klockenlocher\n#Clothes Make the Man (reprise)&nbsp;– Marmaduke, the Chorus\n#Come Along with Me (closing theme)&nbsp;– Danny Kaye\nReferences\nExternal links\n*"
    }
  ]
}