{
  "content": [
    {
      "type": "text",
      "text": "# Happily Ever After (Magic Kingdom)\n\n-->\n| status               = Operating\n| cost                 =\n| soft_opened          = March 14, 2023\n| opened               =   April 3, 2023\n| closed               =\n| previousattraction   = Wishes: A Magical Gathering of Disney DreamsDisney Enchantment Once Upon a Time\n| replacement          = Disney Enchantment\n| type                 = Multimedia and pyrotechnic show\n| manufacturer         =\n| designer             = Disney Live Entertainment\n| model                =\n| theme                =\n| music                = \"Happily Ever After\" performed by Angie Keilhauer and Jordan FisherScore arrangement by Tim Heintz\n| duration             = 18 minutes\n| virtual_queue_name   = FastPass+\n| accessible           = yes\n| small                =\n| custom_label_1       = Sponsor\n| custom_value_1       = PANDORA\n| custom_label_2       = Narrator\n| custom_value_2       = Tom Kane\n}}\nHappily Ever After is a fireworks and projection mapping show which debuted at the Magic Kingdom on May 12, 2017. Unlike its predecessor, Wishes: A Magical Gathering of Disney Dreams, the show includes projection mapping, lasers, and searchlights, in addition to pyrotechnics, featuring characters from a wide array of Disney films, and music arranged by Tim Heintz. The show's theme song of the same name was written by Adam Watts, Melissa Peirce, and Andy Dodd, and performed by Angie Keilhauer and Jordan Fisher; it is adapted from Hong Kong Disneyland's 10th anniversary celebration (and its subsequent show Mickey and the Wondrous Book) and Shanghai Disneyland's Mickey's Storybook Adventure.\nThe show was promised to feature the most technologically advanced projection mapping display in Disney Parks history (after the introduction from ElecTRONica at Disney California Adventure). The show was replaced with Disney Enchantment for Walt Disney World's 50th anniversary celebration on September 30, 2021.\nAn updated version of the show, now utilizing projection mapping on the facades of Main Street, U.S.A. and new ambient sound effects in the hub and Main Street, U.S.A. that were first used in Disney Enchantment, premiered on April 3, 2023 replacing its successor, which is part of the Disney 100 Years of Wonder celebration.\nTechnology\n}}\nThe show's technology has since been utilized into other shows at the Magic Kingdom, including ''Disney's Not-So-Spooky Spectacular, Minnie's Wonderful Christmastime Fireworks, and Disney Enchantment.\nLighting\nThe show uses 58 moving searchlights:\n* 32 small searchlights on the Fantasyland rooftops. There are 16 per side, each in two arrays of 8.\n* 10 large searchlights on the Fantasyland rooftops. There is an array of 5 on each side.\n**The show used to use AO Falcon fixtures, but they were disabled in early August 2022.\n**In February 2024, these searchlights were upgraded and replaced with new Proteus Brutus and Excalibur fixtures, and the number of big searchlights was increased to 20.\n* 16 small searchlights on the ground near the castle moat. There is an array of 8 on each side. These are Elation Proteus Hybrid fixtures, custom-painted green.\nLasers\n* Two lasers around the clock area of the castle shoot beams above the audience toward Main Street. They were upgraded for Disney Enchantment in 2021, now additionally shooting down Main Street towards the train station, and utilized into Happily Ever After in the 2023 version.\n* Two lasers installed on the Main Street rooftops outline various images on the castle, making them brighter.\nShow summary\nOpening\nA keyhole appears on Cinderella Castle. Magical pixie dust flows through the keyhole and covers the castle and surrounding turrets in royal red and gold as the Happily Ever After'' theme song plays. Searchlights, lasers (from and towards the castle), and eventually fireworks come into play.\nDreams\nIntroduced by Tiana, various Disney characters are shown in which they express their deepest desires – Ariel wishing to be 'part of our world', Remy for his own career as a cook in Paris, Rapunzel for freedom from her tower, and Quasimodo for one day to be 'out there' from the tower of Notre Dame.\nSongs include: \"Down in New Orleans (Prologue)\", \"When You Wish Upon a Star\", \"Part of Your World\" and \"Out There\".\nJourney\nIntroduced by Merida, characters from Brave, ''A Bug's Life, Cars, Up, Finding Nemo, and Moana'' are shown embarking on their adventures.\nSongs include: \"Touch the Sky\" and \"How Far I'll Go\".\nFriendship\nIntroduced by Aladdin, this segment highlights the friendships shared by Disney characters from Tarzan, The Lion King, Toy Story, The Jungle Book, Wreck-It Ralph, Big Hero 6, Zootopia, Inside Out, Monsters, Inc., and Aladdin. The segment comes full circle with a showstopping performance by the Genie.\nSongs featured: \"Trashin' the Camp\", \"Hakuna Matata\", \"You've Got a Friend in Me\", \"The Bare Necessities\", \"I've Got No Strings\", \"That’s What Friends Are For\" and \"Friend Like Me\".\nLove\nIntroduced by Olaf, a full moon rises across the castle that leads into romances and acts of love shared by characters from WALL-E, The Lion King, Tarzan, Inside Out, Finding Dory, Up, Dumbo, Zootopia and The Incredibles. The castle turns into a garden with waterfalls and then transitions to show silhouettes of Disney princes and princesses; floating lanterns from Tangled are seen covering the castle as Rapunzel and Flynn Rider duet and send their own lanterns to the top of the castle.\nSongs featured are \"Love is an Open Door\", \"Can You Feel the Love Tonight\", \"You'll Be in My Heart\" and \"I See the Light\".\nAdversity\nIntroduced by the Emperor of China from Mulan, the show becomes aggressive and loud, highlighting the climactic battles and challenges the characters face including epic scenes from The Incredibles, The Little Mermaid, The Lion King, Aladdin, Sleeping Beauty, and Pirates of the Caribbean. The castle and its surroundings are peppered with explosions as many more climactic scenes are shown. When it is over, the castle is left a flaming ruin with gaping holes in its sides.\nMusic featured include instrumental selections from Frozen, The Lion King and Pirates of the Caribbean.\nTriumph\nThe visage constellation of Mufasa appears across a starry sky reminding us to “remember who [we] are”. As an inspirational version of \"Go the Distance\" from Hercules plays, turret by turret, the castle gradually repairs itself while we see the featured characters in their triumphant moments. As the music swells, the structure turns gold with stained-glass portraits of the characters, all of them accomplishing their 'happily ever after'.\nFinale\nThe show ends with the narrator challenging the audience to unlock their own magic and make their dreams come true, just as the characters did. The keyhole reappears and a pixie flies from it, leaving a trail of dust around the central plaza. As the castle restores itself to red and gold, the pixie flies up to the highest spire, where it’s revealed to be Tinker Bell, making her flight over the park to the familiar refrain of \"You Can Fly\". The castle and illuminated central plaza change color as multi-color peony fireworks appear in the sky. The keyhole then turns and opens, unleashing a colorful final set of fireworks.\nNotes\nSee also\n* Together Forever – A Pixar Nighttime Spectacular\n* Wondrous Journeys\nReferences\nExternal links\n* [https://disneyworld.disney.go.com/entertainment/magic-kingdom/happily-ever-after-fireworks/ Official website]"
    }
  ]
}