{
  "content": [
    {
      "type": "text",
      "text": "# Hardware Freedom Day\n\nHardware Freedom Day is an annual celebration organized by the Digital Freedom Foundation. The goal of Hardware Freedom Day is to celebrate the spirit of open hardware and make more people aware of using and contributing to free and hardware projects. The first Hardware Freedom Day was held on April 20, 2013. The 2024 date is 4/20.\nGoals\n* To spread awareness about free and open hardware\n* To encourage user contribution\n* To provide a common platform for people passionate about open hardware to share their ideas and interests\nSchedule\nAnybody can organize a Hardware Freedom Day event and there is no rigid schedule followed. Digital Freedom Foundation co-ordinates the event at a global level, providing support, giveaways and a centralized collaboration space. However, volunteer teams around the world organize the events by themselves.\nSome common activities of Hardware Freedom Day events are\n* Workshops on various kinds of open hardware\n* Open hacking competitions\n* Demonstrations of projects\n* Introduction of new projects\n* Talks\nOpen hardware\nIn the context of Hardware Freedom Day, the term open hardware encompasses physical devices whose design can be\nshared in public without restriction and freely modified and re-distributed.\nThe design includes all information that a person would need to re-create the device.\n2015-2016 issues\nThe Digital Freedom Foundation servers were hacked over Christmas 2015 (posted on their mailing list) and have struggled to come back up. HFD 2016 is planned for April 9, 2016 but no registration is available which will make this year celebration hard to follow.\nSee also\n* Document Freedom Day\n* Software Freedom Day\n* Culture Freedom Day\n* Public Domain Day\n* International Day Against DRM\nReferences\nExternal links\n* [http://www.hfday.org Official website]\n* [http://www.hardwarefreedomday.org Official website of a different event with the same name], held in January"
    }
  ]
}