{
  "content": [
    {
      "type": "text",
      "text": "# HardwareZone__disambig_2\n\nHardwareZone is an IT-oriented Internet portal based in Singapore. It is operated by Hardware Zone Private Limited, which is a wholly owned subsidiary of SPH Media. Some features of the portal are: IT price lists for several countries, feature articles on technology and forums on a variety of topics.\nHistory\nHardwareZone was started as an online magazine in August 1998 by five engineering students from the National University of Singapore: Lee Choon Yau, Eugene Low, Poh Swee Hong, Ang Chi Hoe and Jereme Wong. After a year, it had become a popular gathering place for Singapore's computer-savvy to discuss hardware and software news. By 2000, the website was attracting two million page views a month. The founders made plans to turn the website into a full-fledged portal and launch an initial public offering (IPO) to raise capital. Had the IPO gone ahead, they would have been the first undergraduates in Singapore to launch one.\nIn 2006, HardwareZone was purchased by Singapore Press Holdings for S$7.1 million. SPH acquired all the magazine titles published by HardwareZone, which included HardwareMAG (HWM), GameAxis (a computer games magazine), and PHOTOVIDEOi (a digital photography magazine).\nControversies\nDomain dispute\nIn September 2000, HardwareZone sued Video-Pro, a computer shop in Sim Lim Square, for registering the same domain name with the suffix .sg added as its own (HardwareZone's domain name is www.hardwarezone.com while Video-Pro had registered www.hardwarezone.com.sg). In its statement of claim, HardwareZone said that the \"hardwarezone\" part of its domain name had gained it substantial goodwill in Singapore, and thus Video-Pro was trying to pass itself off as the original website by using the .sg version of the name. Video-Pro counter-sued HardwareZone, alleging that the website offered Video-Pro's price lists for download without the shop's permission and that two statements which defamed the shop had been posted on the HardwareZone website. This was the first legal dispute in Singapore over a domain name. Despite being the first of its kind, no landmark ruling was made in this case because both parties settled the matter out of court four days later. Video-Pro transferred the hardwarezone.com.sg domain name and paid S$10,000 to HardwareZone. It also withdrew its counter-claims. In return, HardwareZone removed the offending statements from its website and agreed to help identify who had made those false statements.\nBomb hoax\nIn 2005, polytechnic student Lin Zhenghuang one day after the 7 July 2005 London bombings made a malicious post claiming bombs were found in Toa Payoh, a district in Singapore. Using the online nickname of \"krisurf\", he titled the post \"Breaking News - Toa Payoh hit by bomb attacks\", claiming bombs had been found at the Toa Payoh bus interchange. Another forum member was alarmed by the post and reported it to police. Lin had made the post while connected to his neighbour's unsecured wireless network, police initially arrested his neighbour, who was released after further computer forensics tests exonerated her. It took the police more than a year to find and arrest Lin. In February 2007, he was sentenced to three months' jail and a S$4,000 fine.\nFalse statement on the 2020 coronavirus outbreak\nOn 27 January 2020, HardwareZone received a Correction Notice under the Protection from Online Falsehoods and Manipulation Act to correct an online post falsely claiming a death in Singapore from the coronavirus outbreak, which had been made the day before at 5.50pm. The post was deleted before the notice was issued.\nReferences\nExternal links\n*"
    }
  ]
}