{
  "content": [
    {
      "type": "text",
      "text": "# Haridwar Junction railway station__disambig_1\n\n| elevation          =\n| line               = Laksar–Dehradun line\n| other              =\n| structure          = On ground\n| platform           = 9 (4 terminal platforms)\n| tracks             = 13\n| parking            = Yes\n| opened             =\n| closed             =\n| rebuilt            =\n| electrified        = Yes\n| acessible                =\n| code               =\n}}\n| owned              = Indian Railways\n| operator           = Northern Railway zone\n| status             = Operating\n| former             =\n| passengers         =\n| pass_year          =\n| pass_percent       =\n| pass_system        =\n| mapframe           = yes\n| mapframe-caption   = Interactive map\n}}\nHaridwar railway station (Station code: HW), is one of the major railway stations in Haridwar district, Uttarakhand, India. It falls under the Moradabad division of the Northern Railway zone of the Indian Railways.\nHaridwar was first connected with railways, via Laksar, through branch line in 1886, when the Oudh and Rohilkhand Railway line was extended through Roorkee to , this was later extended to  in 1906.\nOverview\nThe station is situated on the Laksar–Dehradun railway line for connecting Delhi, Howrah and the rest of India. One of the main railheads of the Northern Railway zone, Haridwar Junction railway station is connected by broad-gauge lines. The station is situated on the NH 58 in the Devpura locality of Haridwar. The nearby station of Rishikesh is connected to Haridwar on a branch line. Towards the west, the major railhead is at Saharanpur (76&nbsp;km) and going north, the major railhead is at Dehradun (52&nbsp;km).\nLocation\nThe railway station is located on the south side of the town, within walking distance of most hotels. A tourist information centre is provided by the railway department to help travellers. Computerised reservation facility is offered. In front of the railway station is the UTC Roadways Bus Station of Haridwar offering regular services to places in and around Haridwar such as Delhi and to all major destinations in North India including Mussoorie, Meerut, Saharanpur, Ghaziabad, Kanpur, Lucknow, Bareilly, Shimla, Dehradun, Badrinath, Nainital, Ranikhet and Uttarkashi. Nearest airport is Jolly Grant Airport located about (42&nbsp;km) in Dehradun. The station is also one of the major rail-heads to the famous pilgrimage \"Char-Dham\" and other tourist stations. Haridwar is considered one of the seven holy cities of Hinduism in India and it is continuing to expand and thrive with spiritual centres, educational Institutions and has witnessed great demographic flow.\nInfrastructure and amenities\nHaridwar Railway Station has recently been renovated with a retiring room and waiting halls. The station has also been provided with new escalators and lifts in order to facilitate passengers, especially senior citizens, disabled people, women, and child travellers. Additional facilities like pay and use toilet, a coach guidance system from platform 1 to platform 4 has been installed. Security system has been upgraded in the station with Indian Railways providing new Railway Protection Force (RPF) and GRP (Government Railway Police) stations which will serve as prompt emergency centre for security needs as well as for reporting crimes in addition to providing comfort and conveniences to the security forces. As Haridwar has large footfall throughout the year and hence CCTV surveillance has been upgraded which provides close watch and strengthens security at the station. Northern Railway zone has also been modernising works, including washable aprons for coach maintenance, improvements to parking and circulating area, provision of foot-over-bridges, providing second entry, façade lighting with provision of LED lighting, station building improvements with allied works like improvements to platform surface, PF shelters.\nReferences\nExternal links\n* [http://www.nr.indianrailways.gov.in/ Official Website of the Northern Railway Zone]\n* [http://indiarailinfo.com/station/map/456 India rail info: Map of Haridwar Junction railway station]"
    }
  ]
}