{
  "content": [
    {
      "type": "text",
      "text": "# Harima Sake Culture Tourism\n\nHarima Sake Culture Tourism is an activity of the Harima United, which is made up of 12 cities and nine towns. The committee was founded and began as a coordinated collaboration of 7 cities and 8 towns in the Harima region on May 29, 2012, and added 5 cities and 1 town of northern Harima on August 30 of the same year. To promote Harima's regional brand as \"Harima: Hometown of Japanese Sake,\" and communicate Harima's charm to the world, the activity involves running day trips and overnight tours in cooperation with 4 of Harima's regional sake brewery associations.\nSummary\nTo further the promotion of tourism and the local brand commodity, sake, using \"Harima: Hometown of Japanese Sake\" as a regional brand, starting in September of last year, the Harima Regional Cooperative Committee began \"Harima Sake Culture Tourism\" with the Harima Sake Culture Tourism Board, made up of 4 of Harima's sake brewery associations, and work to spread information domestically and abroad about Harima, and promote the Harima region.\nBusiness\nTourism\nThey hold periodic tours to regional culinary and cultural resources such as Harima's sake breweries and Yamada Nishiki rice fields in cooperation with the Harima Sake Culture Tourism Board (made up of 4 of Harima's sake brewery associations) and local bus travel companies. The first tour to these breweries was held on September 15, 2012, and since then they have continued to hold them about once a month.\nProject to Strengthen and Rebuild a Tourist Destination with Charm through the Cooperation of Public and Private Sectors\nUsing the \"Project to Strengthen and Rebuild a Tourist Destination with Charm through the Cooperation of Public and Private Sectors,\" which was selected by the Japan Tourism Agency to be a funded project in March 2013, public and private sectors collaborate to entice tourists from Kyoto, Osaka, Kobe, and other large cities through planning of activities such as overnight tours in cooperation with JTB West Japan Inc.\nTransmission of information\nThey promote the Harima region by sending out information about Harima's sake, both domestically and abroad, through Facebook and their web page.\nParticipation breweries\n22 breweries of the Harima region participate in Harima Sake Culture Tourism.\nIbogawa river・Chikusagawa river basin\n*Honda Shoten(本田商店)\n*Yaegaki Shuzou(jp:ヤヱガキ酒造)\n*Okufuji Shouji(jp:奥藤商事)\n*Simomura Shuzou(下村酒造店)\n*Oimatu Shuzou(jp:老松酒造)\n*Sanyouhai Shuzou(山陽盃酒造)\nYumesaki river・Ichikawa river・Kakogawa river(East Harima) River basin\n*Tubosaka Shuzou(壷坂酒造)\n*Kanzaki Shuzou(神崎酒造)\n*Meijou Shuzou(名城酒造)\n*Tanaka Shuzoujhou(田中酒造場)\n*Nadagiku Shuzoujp:灘菊酒造)\n*Izawa Honke(jp:井澤本家)\n*Okada Honke(岡田本家)\n*King Jhouzou(jp:キング醸造)\nKakogawa river(North Harima) River basin\n*Inami Shuzou(稲見酒造)\n*Kamimusubi Shuzou(jp:神結酒造)\n*Miyake Shuzou(三宅酒造)\n*Fukunishiki(jp:富久錦)\n*Akasi Sakerui Jhouzou(jp:明石酒類醸造)\n*Eigasaki Shuzou(jp:江井ヶ嶋酒造)\n*Ibaraki Shuzou(茨木酒造)\n*Nishiumi Shuzou(西海酒造)\nCharacter \"Moririi\"\nTo spread the local brand, \"Harima: Hometown of Japanese Sake,\" broadly nationwide, the character \"Moririi\" was born, whose name comes from the Japanese words to boost (moriageru) the Harima region and fill up the Harima region with fun sake (sakemori).\nHis hobby is visiting sake breweries and his talent is sake tasting - he can taste the difference between all of Harima's different sakes. Modeled after the feudal lord from the Age of Civil War, Mori Tomonobu(jp:母里友信), his helmet says \"Harima\", he holds a sake cup in his hand, a bottle of sake that says \"Hometown of Japanese Sake\" hangs from his back, and he strives to promote the Harima region as a character that is cute, though he is an old man.\nReferences\nExternal links\n*[http://www.harima-sake.jp/ Official website]\n*[https://www.facebook.com/harimasake2 Official Facebook]"
    }
  ]
}