{
  "content": [
    {
      "type": "text",
      "text": "# Harlem Renaissance__disambig_2\n\nThe Harlem Renaissance was an intellectual and cultural movement of African-American music, dance, art, fashion, literature, theater, politics, and scholarship centered in Harlem, Manhattan, New York City, spanning the 1920s and 1930s. At the time, it was known as the \"New Negro Movement\", named after The New Negro, a 1925 anthology edited by Alain Locke. The movement also included the new African-American cultural expressions across the urban areas in the Northeastern United States and the Midwestern United States affected by a renewed militancy in the general struggle for civil rights, combined with the Great Migration of African-American workers fleeing the racist conditions of the Jim Crow Deep South, as Harlem was the final destination of the largest number of those who migrated north.\nThough geographically tied to Harlem, few of the associated visual artists lived in the area itself, while those who did (such as Aaron Douglas) had migrated elsewhere by the end of World War II. Many francophone black writers from African and Caribbean colonies who lived in Paris, France, were also influenced by the movement. Harlem had also seen significant Black immigration from British, French and other colonies in the Caribbean. The zenith of this \"flowering of Negro literature\", as James Weldon Johnson described the Harlem Renaissance, took place between approximately 1924—when Opportunity: A Journal of Negro Life hosted a party for black writers where many white publishers were in attendance—and 1929, the year of the stock-market crash and the beginning of the Great Depression. The Harlem Renaissance is considered to have been a creative crucible for African-American art-making and its institutionalisation within white-dominated museums and cultural institutions.\nBackground\nin Upper Manhattan]]\nUntil the end of the Civil War, the majority of African Americans had been enslaved and lived in the South. During the Reconstruction Era, the emancipated African Americans began to strive for civic participation, political equality, and economic and cultural self-determination. Soon after the end of the Civil War, the Ku Klux Klan Act of 1871 gave rise to speeches by African-American congressmen addressing this bill. By 1875, sixteen African Americans had been elected and served in Congress and gave numerous speeches with their newfound civil empowerment.\nThe Ku Klux Klan Act of 1871 was followed by the passage of the Civil Rights Act of 1875, part of Reconstruction legislation by Republicans. During the mid-to-late 1870s, racist whites organized in the Democratic Party launched a murderous campaign of racist terrorism to regain political power throughout the South. From 1890 to 1908, they proceeded to pass legislation that disenfranchised most African Americans and many poor whites, trapping them without representation. They established white supremacist regimes of Jim Crow segregation in the South and one-party block voting behind Southern Democrats.\nfounded the Afro-American Realty Company in 1903, which sought to fight housing discrimination and encourage Black migration into Harlem.]]\nDemocratic Party politicians (many having been former slaveowners and political and military leaders of the Confederacy) conspired to deny African Americans their exercise of civil and political rights by terrorizing black communities with lynch mobs and other forms of vigilante violence as well as by instituting a convict labor system that forced many thousands of African Americans back into unpaid labor in mines, plantations and on public works projects such as roads and levees. Convict laborers were typically subject to brutal forms of corporal punishment, overwork and disease from unsanitary conditions. Death rates were extraordinarily high. While a small number of African Americans were able to acquire land shortly after the Civil War, most were exploited as sharecroppers. Whether sharecropping or on their own acreage, most of the black population was closely financially dependent on agriculture. This added another impetus for the Migration: the arrival of the boll weevil. The beetle eventually came to waste 8% of the country's cotton yield annually and thus disproportionately impacted this part of America's citizenry. As life in the South became increasingly difficult, African Americans began to migrate north in great numbers.\nMost of the future leading lights of what was to become known as the \"Harlem Renaissance\" movement arose from a generation that had memories of the gains and losses of Reconstruction after the Civil War. Sometimes their parents, grandparents—or they themselves—had been slaves. Their ancestors had sometimes benefited by paternal investment in cultural capital, including better-than-average education.\nMany in the Harlem Renaissance were part of the early 20th-century Great Migration out of the South into the African-American neighborhoods of the Northeast and Midwest. African Americans sought a better standard of living and relief from the institutionalized racism in the South. Others were people of African descent from racially stratified communities in the Caribbean who came to the United States hoping for a better life. Uniting most of them was their convergence in Harlem.\nDevelopment\nworking on Kalombwan (1934).]]\nDuring the early 20th century, Harlem was a destination for migrants from around the country, attracting both people from the South seeking work and an educated class who made the area a center of culture, as well as a growing \"Negro\" middle class. These people were looking for a fresh start in life and this was a good place to go. The district had originally been developed in the 19th century as an exclusive suburb for the white middle and upper middle classes; its affluent beginnings led to the development of stately houses, grand avenues, and world-class amenities such as the Polo Grounds and the Harlem Opera House. During the enormous influx of European immigrants in the late 19th century, the once exclusive district was abandoned by the white middle class, who moved farther north.\nHarlem became an African-American neighborhood in the early 1900s. In 1910, a large block along 135th Street and Fifth Avenue was bought by various African-American realtors and a church group. Many more African Americans arrived during the First World War. Due to the war, the migration of laborers from Europe virtually ceased, while the war effort resulted in a massive demand for unskilled industrial labor. The Great Migration brought hundreds of thousands of African Americans to cities such as Chicago, Philadelphia, Detroit, Washington, D.C., and New York.\nDespite the increasing popularity of Negro culture, virulent white racism, often by more recent ethnic immigrants, continued to affect African-American communities, even in the North. After the end of World War I, many African-American soldiers—who fought in segregated units such as the Harlem Hellfighters—came home to a nation whose citizens often did not respect their accomplishments. Race riots and other civil uprisings occurred throughout the United States during the Red Summer of 1919, reflecting economic competition over jobs and housing in many cities, as well as tensions over social territories.\nMainstream recognition of Harlem culture\nThe first stage of the Harlem Renaissance started in the late 1910s. In 1917, the premiere of Granny Maumee, The Rider of Dreams, and Simon the Cyrenian: Plays for a Negro Theater took place. These plays, written by white playwright Ridgely Torrence, featured African-American actors conveying complex human emotions and yearnings. They rejected the stereotypes of the blackface and minstrel show traditions. In 1917, James Weldon Johnson called the premieres of these plays \"the most important single event in the entire history of the Negro in the American Theater\".\nAnother landmark came in 1919, when the communist poet Claude McKay published his militant sonnet \"If We Must Die\", which introduced a dramatically political dimension to the themes of African cultural inheritance and modern urban experience featured in his 1917 poems \"Invocation\" and \"Harlem Dancer\". Published under the pseudonym Eli Edwards, these were his first appearance in print in the United States after immigrating from Jamaica. Although \"If We Must Die\" never alluded to race, African-American readers heard its note of defiance in the face of racism and the nationwide race riots and lynchings then taking place. By the end of the First World War, the fiction of James Weldon Johnson and the poetry of Claude McKay were describing the reality of contemporary African-American life in America.\nThe Harlem Renaissance grew out of the changes that had taken place in the African-American community since the abolition of slavery, as the expansion of communities in the North. These accelerated as a consequence of World War I and the great social and cultural changes in the early 20th-century United States. Industrialization attracted people from rural areas to cities and gave rise to a new mass culture. Contributing factors leading to the Harlem Renaissance were the Great Migration of African Americans to Northern cities, which concentrated ambitious people in places where they could encourage each other, and the First World War, which had created new industrial work opportunities for tens of thousands of people. Factors leading to the decline of this era include the Great Depression.\nLiterature\nIn 1917, Hubert Harrison, \"The Father of Harlem Radicalism\", founded the Liberty League and The Voice, the first organization and the first newspaper, respectively, of the \"New Negro Movement\". Harrison's organization and newspaper were political but also emphasized the arts (his newspaper had \"Poetry for the People\" and book review sections). In 1927, in the Pittsburgh Courier, Harrison challenged the notion of the Renaissance. He argued that the \"Negro Literary Renaissance\" notion overlooked \"the stream of literary and artistic products which had flowed uninterruptedly from Negro writers from 1850 to the present,\" and said the so-called \"Renaissance\" was largely a white invention. Alternatively, a writer like the Chicago-based author, Fenton Johnson, who began publishing in the early 1900s, is called a \"forerunner\" of the Harlem Renaissance, \"one of the first negro revolutionary poets\".\nNevertheless, with the Harlem Renaissance came a sense of acceptance for African-American writers; as Langston Hughes put it, with Harlem came the courage \"to express our individual dark-skinned selves without fear or shame\". Alain Locke's anthology The New Negro was considered the cornerstone of this cultural revolution. The anthology featured several African-American writers and poets, from the well-known, such as Zora Neale Hurston and communists Langston Hughes and Claude McKay, to the lesser known, like the poet Anne Spencer.\nMany poets of the Harlem Renaissance were inspired to tie threads of African-American culture into their poems; as a result, jazz poetry was heavily developed during this time. \"The Weary Blues\" was a notable jazz poem written by Langston Hughes. Through their works of literature, black authors were able to give a voice to the African-American identity, and strived for a community of support and acceptance.\nReligion\nChristianity played a major role in the Harlem Renaissance. Many of the writers and social critics discussed the role of Christianity in African-American lives. For example, a famous poem by Langston Hughes, \"Madam and the Minister\", reflects the temperature and mood towards religion in the Harlem Renaissance.\nThe cover story for The Crisis magazine's publication in May 1936 explains how important Christianity was regarding the proposed union of the three largest Methodist churches of 1936. This article shows the controversial question of unification for these churches. The article \"The Catholic Church and the Negro Priest\", also published in The Crisis, January 1920, demonstrates the obstacles that African-American priests faced in the Catholic Church. The article confronts what it saw as policies based on race that excluded African Americans from higher positions in the Church.\nDiscourse\nVarious forms of religious worship existed during this time of African-American intellectual reawakening.\nAlthough there were racist attitudes within the current Abrahamic religious arenas, many African Americans continued to push towards the practice of a more inclusive doctrine. For example, George Joseph MacWilliam presents various experiences of rejection on the basis of his color and race during his pursuit towards priesthood, yet he shares his frustration in attempts to incite action on the part of The Crisis magazine community.\nThere were other forms of spiritualism practiced among African Americans during the Harlem Renaissance. Some of these religions and philosophies were inherited from African ancestry. For example, the religion of Islam was present in Africa as early as the 8th century through the Trans-Saharan trade. Islam came to Harlem likely through the migration of members of the Moorish Science Temple of America, which was established in 1913 in New Jersey. Various forms of Judaism were practiced, including Orthodox, Conservative and Reform Judaism, but it was Black Hebrew Israelites that founded their religious belief system during the early 20th century in the Harlem Renaissance. Traditional forms of religion acquired from various parts of Africa were inherited and practiced during this era. Some common examples were Voodoo and Santeria.\nCriticism\nReligious critique during this era was found in music, literature, art, theater and poetry. The Harlem Renaissance encouraged analytic dialogue that included the open critique and the adjustment of current religious ideas.\nOne of the major contributors to the discussion of African-American renaissance culture was Aaron Douglas, who, with his artwork, also reflected the revisions African Americans were making to the Christian dogma. Douglas uses biblical imagery as inspiration to various pieces of artwork, but with the rebellious twist of an African influence.\nCountee Cullen's poem \"Heritage\" expresses the inner struggle of an African American between his past African heritage and the new Christian culture. A more severe criticism of the Christian religion can be found in Langston Hughes's poem \"Merry Christmas\", where he exposes the irony of religion as a symbol for good and yet a force for oppression and injustice.\nMusic\nand Bill \"Bojangles\" Robinson in the musical comedy Brown Buddies on Broadway, 1930]]\nA new way of playing the piano called the Harlem Stride style was created during the Harlem Renaissance helping to blur the lines between the poor African Americans and socially elite African Americans. The traditional jazz band was composed primarily of brass instruments and was considered a symbol of the South, but the piano was considered an instrument of the wealthy. With this instrumental modification to the existing genre, the wealthy African Americans now had more access to jazz music. Its popularity soon spread throughout the country and was consequently at an all-time high.\nInnovation and liveliness were important characteristics of performers in the beginnings of jazz. Jazz performers and composers at the time such as Eubie Blake, Noble Sissle, Jelly Roll Morton, Luckey Roberts, James P. Johnson, Willie \"The Lion\" Smith, Andy Razaf, Fats Waller, Ethel Waters, Adelaide Hall, Florence Mills and bandleaders Duke Ellington, Louis Armstrong and Fletcher Henderson were extremely talented, skillful, competitive and inspirational. They laid great parts of the foundations for future musicians of their genre.\nDuke Ellington gained popularity during the Harlem Renaissance. According to Charles Garrett, \"The resulting portrait of Ellington reveals him to be not only the gifted composer, bandleader, and musician we have come to know, but also an earthly person with basic desires, weaknesses, and eccentricities.\" Ellington did not let his popularity get to him. He remained calm and focused on his music.\nDuring this period, the musical style of blacks was becoming more and more attractive to whites. White novelists, dramatists and composers started to exploit the musical tendencies and themes of African Americans in their works. Composers (including William Grant Still, William L. Dawson and Florence Price) used poems written by African-American poets in their songs, and would implement the rhythms, harmonies and melodies of African-American music—such as blues, spirituals and jazz—into their concert pieces. African Americans began to merge with whites into the classical world of musical composition. The first African-American male to gain wide recognition as a concert artist in both his region and internationally was Roland Hayes. He trained with Arthur Calhoun in Chattanooga, and at Fisk University in Nashville. Later, he studied with Arthur Hubbard in Boston and with George Henschel and Amanda Ira Aldridge in London, England. Hayes began singing in public as a student, and he toured with the Fisk Jubilee Singers in 1911.\nMusical theatre\nThe musical Shuffle Along with a score by Eubie Blake and Noble Sissle and book by F.E. Miller and Aubrey Lyles debuted at the Sixty-Third Street Music Hall in 1921. The show was produced, composed, directed, and written by African Americans. Shuffle Along was a popular success among mixed audiences and brought jazz to Broadway. With 504 Broadway performances and three tours, it \"generated a demand for more\" and proved that Black and White audiences would pay to see African Americans on Broadway. Shuffle Along became the first African-American musical to play in white theaters across the country. Langston Hughes wrote in his 1940 memoir The Big Sea: \"The 1920s were the years of Manhattan’s Black Renaissance. It began with Shuffle Along…It gave just the proper push-a pre-Charleston kick- to that Negro vogue of the '20s, that spread to books, African sculpture, music, and dancing.\" ]]\nAccording to James Vernon Hatch and Leo Hamalian, all-black review Run, Little Chillun is considered one of the most successful musical dramas of the Harlem Renaissance.\nFashion\nDuring the Harlem Renaissance, the African-American clothing scene took a dramatic turn from the prim and proper many young women preferred, from short skirts and silk stockings to drop-waisted dresses and cloche hats. Women wore loose-fitted garments and accessorized with long strand pearl bead necklaces, feather boas, and cigarette holders. The fashion of the Harlem Renaissance was used to convey elegance and flamboyancy and needed to be created with the vibrant dance style of the 1920s in mind. Popular by the 1930s was a trendy, egret-trimmed beret.\nMen wore loose suits that led to the later style known as the \"Zoot\", which consisted of wide-legged, high-waisted, peg-top trousers, and a long coat with padded shoulders and wide lapels. Men also wore wide-brimmed hats, colored socks, white gloves and velvet-collared Chesterfield coats. During this period, African Americans expressed respect for their heritage through a fad for leopard-skin coats, indicating the power of the African animal.\nWhile performing in Paris during the height of the Renaissance, the extraordinarily successful black dancer Josephine Baker was a major fashion trendsetter for black and white women alike. Her gowns from the couturier Jean Patou were copied, especially her stage costumes, which Vogue'' magazine called \"startling\". Josephine Baker is also credited for highlighting the \"art deco\" fashion era after she performed the \"Danse Sauvage\". During this Paris performance, she adorned a skirt made of string and artificial bananas. Ethel Moses was another popular black performer. Moses starred in silent films in the 1920s and 1930s and was recognizable by her signature bob hairstyle.\nPhotography\nJames Van Der Zee's photography played an important role in shaping and documenting the cultural and social life of Harlem during the Harlem Renaissance. His photographs were instrumental in shaping the image and identity of the African-American community during the Harlem Renaissance. His work documented the achievements of cultural figures and helped to challenge stereotypes and racist attitudes, which in turn promoted pride and dignity among African Americans in Harlem and beyond.\nVan Der Zee's studio was not just a place for taking photographs; it was also a social and cultural hub for Harlem residents. People would come to his studio not only to have their portraits taken, but also to socialize and to participate in the community events that he hosted. Van Der Zee's studio played an important role in the cultural life of Harlem during the early 20th century, and helped to foster a sense of community and pride among its residents.\nSome notable persons photographed are Marcus Garvey, the leader of the Universal Negro Improvement Association (UNIA), a black nationalist organization that promoted Pan-Africanism and economic independence for African Americans. Other notable black persons he photographed are Countee Cullen, a poet and writer who was associated with the Harlem Renaissance; Josephine Baker, a dancer and entertainer who became famous in France and was known for her provocative performances; W. E. B. Du Bois, a sociologist, historian and civil rights activist who was a leading figure in the African-American community in the early 20th century; Langston Hughes, a poet, novelist and playwright who was one of the most important writers of the Harlem Renaissance; and Madam C. J. Walker, an entrepreneur and philanthropist who was one of the first African-American women to become a self-made millionaire.\nVan Der Zee's work gained renewed attention in the 1960s and 1970s, when interest in the Harlem Renaissance was revived. Van Der Zee's photographs have been featured in numerous exhibitions over the years. One notable exhibition was Harlem on My Mind: Cultural Capital of Black America, 1900–1968, which was organized by the Metropolitan Museum of Art in 1969. The exhibit included more than 300 photographs, many of which were by Van Der Zee, and was one of the first major exhibitions to focus on the cultural achievements of African Americans in Harlem.\nVan Der Zee's work was the eyes of Harlem. His photographs are recognized as important documents of African-American life and culture during the early 20th century. They serve as a visual record of the achievements of the Harlem Renaissance. Kelli Jones called him \"the official chronicler of the Harlem Renaissance.\" His portraits of writers, musicians, artists and other cultural figures helped to promote their work and bring attention to the vibrant creative scene known as Harlem.\nPainting\nAaron Douglas, born in Kansas in 1899 and often referred to as the \"Father of African-American Art\", is one of the most influential painters of the Harlem Renaissance. Through his paintings that utilize color, shape, and line, Douglas creates a collapsing of time as he merges the past, present, and future of American-American history. Fragmentation of the picture plane, geometry, and hard-edge abstraction are present in most of his paintings during the Harlem Renaissance. Douglas drew inspiration from both ancient Egyptian and Native American motifs.\nSculpting\nAugusta Savage, born in Florida in 1892, was a culture, advocate, and teacher during the Harlem Renaissance who put black everyday people at the forefront of her works. In 1932, Savage founded the Savage Studio of Arts and Crafts, providing free art classes in painting, printmaking, and sculpting. She secured government funding for the school to train youths and adults. Known as a leading light within the Harlem community, Savage encouraged artists to seek financial compensation for their works, which led to the start of the Harlem Artist Guild in 1935. Augusta Savage was the only African American commissioned to create an exhibit for the 1939 World Fair in New York, where she showcased her piece Lift Every Voice and Sing, which quickly became one of the most popular pieces within the fair.\nCharacteristics and themes\nis emblematic of the mixture of high-class society, popular art, and virtuosity of jazz.]]\nCharacterizing the Harlem Renaissance was an overt racial pride that came to be represented in the idea of the New Negro, who through intellect and production of literature, art and music could challenge the pervading racism and stereotypes to promote progressive or socialist politics, and racial and social integration. The creation of art and literature would serve to \"uplift\" the race.\nThere would be no uniting form singularly characterizing the art that emerged from the Harlem Renaissance. Rather, it encompassed a wide variety of cultural elements and styles, including a Pan-African perspective, \"high-culture\" and \"low-culture\" or \"low-life\", from the traditional form of music to the blues and jazz, traditional and new experimental forms in literature such as modernism and the new form of jazz poetry. This duality meant that numerous African-American artists came into conflict with conservatives in the black intelligentsia, who took issue with certain depictions of black life.\nSome common themes represented during the Harlem Renaissance were the influence of the experience of slavery and emerging African-American folk traditions on black identity, the effects of institutional racism, the dilemmas inherent in performing and writing for elite white audiences, and the question of how to convey the experience of modern black life in the urban North.\nThe Harlem Renaissance was one of primarily African-American involvement. It rested on a support system of black patrons and black-owned businesses and publications. However, it also depended on the patronage of white Americans, such as Carl Van Vechten and Charlotte Osgood Mason, who provided various forms of assistance, opening doors which otherwise might have remained closed to the publication of work outside the black American community. This support often took the form of patronage or publication. Carl Van Vechten was one of the most noteworthy white Americans involved with the Harlem Renaissance. He allowed for assistance to the black American community because he wanted racial sameness.\nThere were other whites interested in so-called \"primitive\" cultures, as many whites viewed black American culture at that time, and wanted to see such \"primitivism\" in the work coming out of the Harlem Renaissance. As with most fads, some people may have been exploited in the rush for publicity.\nInterest in African-American lives also generated experimental but lasting collaborative work, such as the all-black productions of George Gershwin's opera Porgy and Bess, and Virgil Thomson and Gertrude Stein's Four Saints in Three Acts. In both productions the choral conductor Eva Jessye was part of the creative team. Her choir was featured in Four Saints. The music world also found white band leaders defying racist attitudes to include the best and the brightest African-American stars of music and song in their productions.\nThe African Americans used art to prove their humanity and demand for equality. The Harlem Renaissance led to more opportunities for blacks to be published by mainstream houses. Many authors began to publish novels, magazines and newspapers during this time. The new fiction attracted a great amount of attention from the nation at large. Among authors who became nationally known were Jean Toomer, Jessie Fauset, Claude McKay, Zora Neale Hurston, James Weldon Johnson, Alain Locke, Omar Al Amiri, Eric D. Walrond and Langston Hughes.\nRichard Bruce Nugent (1906–1987), who wrote \"Smoke, Lilies, and Jade\", made an important contribution, especially in relation to experimental form and LGBT themes in the period.\nThe Harlem Renaissance helped lay the foundation for the post-World War II protest movement of the Civil Rights movement. Moreover, many black artists who rose to creative maturity afterward were inspired by this literary movement.\nThe Renaissance was more than a literary or artistic movement, as it possessed a certain sociological development—particularly through a new racial consciousness—through ethnic pride, as seen in the Back to Africa movement led by Jamaican Marcus Garvey. At the same time, a different expression of ethnic pride, promoted by W. E. B. Du Bois, introduced the notion of the \"talented tenth\". Du Bois wrote of the Talented Tenth:\nThe Negro race, like all races, is going to be saved by its exceptional men. The problem of education, then, among Negroes must first of all deal with the Talented Tenth; it is the problem of developing the best of this race that they may guide the mass away from the contamination and death of the worst.\nThese \"talented tenth\" were considered the finest examples of the worth of black Americans as a response to the rampant racism of the period. No particular leadership was assigned to the talented tenth, but they were to be emulated. In both literature and popular discussion, complex ideas such as Du Bois's concept of \"twoness\" (dualism) were introduced (see The Souls of Black Folk; 1903). Du Bois explored a divided awareness of one's identity that was a unique critique of the social ramifications of racial consciousness. This exploration was later revived during the Black Pride movement of the early 1970s.\nInfluence\nA new black identity\n, communist novelist and poet, photographed by Carl Van Vechten, 1936]]\nThe Harlem Renaissance was successful in that it brought the black experience clearly within the corpus of American cultural history. Not only through an explosion of culture, but on a sociological level, the legacy of the Harlem Renaissance redefined how America, and the world, viewed African Americans. The migration of Southern blacks to the North changed the image of the African American from rural, undereducated peasants to one of urban, cosmopolitan sophistication. This new identity led to a greater social consciousness, and African Americans became players on the world stage, expanding intellectual and social contacts internationally.\nThe progress—both symbolic and real—during this period became a point of reference from which the African-American community gained a spirit of self-determination that provided a growing sense of both black urbanity and black militancy, as well as a foundation for the community to build upon for the Civil Rights struggles in the 1950s and 1960s.\nThe urban setting of rapidly developing Harlem provided a venue for African Americans of all backgrounds to appreciate the variety of black life and culture. Through this expression, the Harlem Renaissance encouraged the new appreciation of folk roots and culture. For instance, folk materials and spirituals provided a rich source for the artistic and intellectual imagination, which freed blacks from the establishment of past condition. Through sharing in these cultural experiences, a consciousness sprung forth in the form of a united racial identity.\nHowever, there was some pressure within certain groups of the Harlem Renaissance to adopt sentiments of conservative white America in order to be taken seriously by the mainstream. The result being that queer culture, while far-more accepted in Harlem than most places in the country at the time, was most fully lived out in the smoky dark lights of bars, nightclubs and cabarets in the city. It was within these venues that the blues music scene boomed, and, since it had not yet gained recognition within popular culture, queer artists used it as a way to express themselves honestly.\nEven though there were factions within the Renaissance that were accepting of queer culture/lifestyles, one could still be arrested for engaging in homosexual acts. Many people, including author Alice Dunbar Nelson and \"The Mother of Blues\" Gertrude \"Ma\" Rainey, had husbands but were romantically linked to other women as well.\nWomen and the LGBTQ community\nDuring the Harlem Renaissance, various well-known figures, including Claude Mckay, Langston Hughes, and Ethel Waters, are believed to have had private same-gender relationships, although this aspect of their lives remained undisclosed to the public during that era.\nIn the Harlem music scene, places such as the Cotton Club and Rockland Palace routinely held gay drag shows in addition to straight performances. Lesbian or bisexual women performers, such as blues singers Gladys Bentley and Bessie Smith, were a part of this cultural movement, which contributed to a renewed interest in African-American culture among the black community and introduced it to a wider audience.\nAlthough women's contributions to culture were often overlooked at the time, contemporary black feminist critics have endeavored to re-evaluate and recognize the cultural production of women during the Harlem Renaissance. Authors such as Nella Larsen and Jessie Fauset have gained  renewed critical acclaim for their work from modern perspectives.\nBlues singer Gertrude \"Ma\" Rainey was known to dress in traditionally male clothing, and her blues lyrics often reflected her sexual proclivities for women, which was extremely radical at the time. Ma Rainey was also the first person to introduce blues music into vaudeville. Rainey's protégé, Bessie Smith, was another artist who used the blues as a way to express unapologetic views on same-gender relations, with such lines as \"When you see two women walking hand in hand, just look em' over and try to understand: They'll go to those parties – have the lights down low – only those parties where women can go.\" Rainey, Smith, and artist Lucille Bogan were collectively known as \"The Big Three of the Blues\".\n]]\nAnother prominent blues singer was Gladys Bentley, who was known to cross-dress. Bentley was the club owner of Clam House on 133rd Street in Harlem, which was a hub for queer patrons. The Hamilton Lodge in Harlem hosted an annual drag ball, drawing thousands of people to watch young men dance in drag. Though there were safe spaces within Harlem, there were prominent voices, such as that of Abyssinian Baptist Church's minister Adam Clayton Powell Sr., who actively opposed homosexuality.\nThe Harlem Renaissance was instrumental in fostering the \"New Negro\" movement, an endeavor by African Americans to redefine their identity free from degrading stereotypes. The Neo-New Negro movement further challenged racial definitions, stereotypes, and gender norms and roles, seeking to address normative sexuality and sexism in American society.\nThese ideas received some pushback, particularly regarding sexual freedom for women, which was seen as confirming the stereotype that black women were sexually uninhibited. Some members of the black bourgeoisie saw this as hindering the overall progress of the black community and fueling racist sentiments. Yet queer culture and artists defined major portions of the Harlem Renaissance; Henry Louis Gates Jr., in a 1993 essay titled \"The Black Man's Burden\", wrote that the Harlem Renaissance \"was surely as gay as it was black\".\nCriticism of the movement\nMany critics point out that the Harlem Renaissance could not escape its history and culture in its attempt to create a new one, or sufficiently separate from the foundational elements of white, European culture. Often Harlem intellectuals, while proclaiming a new racial consciousness, resorted to mimicry of their white counterparts by adopting their clothing, sophisticated manners and etiquette. This \"mimicry\" may also be called assimilation, as that is typically what minority members of any social construct must do in order to fit social norms created by that construct's majority. This could be seen as a reason that the artistic and cultural products of the Harlem Renaissance did not overcome the presence of white-American values and did not reject these values. In this regard, the creation of the \"New Negro\", as the Harlem intellectuals sought, was considered a success.\nThe Harlem Renaissance appealed to a mixed audience. The literature appealed to the African-American middle class and to whites. Magazines such as The Crisis, a monthly journal of the NAACP, and Opportunity, an official publication of the National Urban League, employed Harlem Renaissance writers on their editorial staffs, published poetry and short stories by black writers, and promoted African-American literature through articles, reviews and annual literary prizes. However, as important as these literary outlets were, the Renaissance relied heavily on white publishing houses and white-owned magazines.\nA major accomplishment of the Renaissance was to open the door to mainstream white periodicals and publishing houses, although the relationship between the Renaissance writers and white publishers and audiences created some controversy. W. E. B. Du Bois did not oppose the relationship between black writers and white publishers, but he was critical of works such as Claude McKay's bestselling novel Home to Harlem (1928) for appealing to the \"prurient demand[s]\" of white readers and publishers for portrayals of black \"licentiousness\".\nLangston Hughes spoke for most of the writers and artists when he wrote in his essay \"The Negro Artist and the Racial Mountain\" (1926) that black artists intended to express themselves freely, no matter what the black public or white public thought. Hughes in his writings also returned to the theme of racial passing, but, during the Harlem Renaissance, he began to explore the topic of homosexuality and homophobia. He began to use disruptive language in his writings. He explored this topic because it was a theme that during this time period was not discussed.\nAfrican-American musicians and writers were among mixed audiences as well, having experienced positive and negative outcomes throughout the New Negro Movement. For musicians, Harlem, New York's cabarets and nightclubs shined a light on black performers and allowed for black residents to enjoy music and dancing. However, some of the most popular clubs (that showcased black musicians) were exclusively for white audiences; one of the most famous white-only nightclubs in Harlem was the Cotton Club, where popular black musicians like Duke Ellington frequently performed. Ultimately, the black musicians who appeared at these white-only clubs became far more successful and became a part of the mainstream music scene.\nSimilarly, black writers were given the opportunity to shine once the New Negro Movement gained traction as short stories, novels and poems by black authors began taking form and getting into various print publications in the 1910s and 1920s. Although a seemingly good way to establish their identities and culture, many authors note how hard it was for any of their work to actually go anywhere. Writer Charles Chesnutt in 1877, for example, notes that there was no indication of his race alongside his publication in Atlantic Monthly (at the publisher's request).\nA prominent factor in the New Negro's struggle was that their work had been made out to be \"different\" or \"exotic\" to white audiences, making a necessity for black writers to appeal to them and compete with each other to get their work out. Famous black author and poet Langston Hughes explained that black-authored works were placed in a similar fashion to those of oriental or foreign origin, only being used occasionally in comparison to their white-made counterparts: Once a spot for a black work was \"taken\", black authors had to look elsewhere to publish.\nCertain aspects of the Harlem Renaissance were accepted without debate, and without scrutiny. One of these was the future of the \"New Negro\". Artists and intellectuals of the Harlem Renaissance echoed American progressivism in its faith in democratic reform, in its belief in art and literature as agents of change, and in its almost uncritical belief in itself and its future. This progressivist worldview rendered black intellectuals—just like their white counterparts—unprepared for the rude shock of the Great Depression, and the Harlem Renaissance ended abruptly because of naïve assumptions about the centrality of culture, unrelated to economic and social realities.\nWorks associated with the Harlem Renaissance\n*Blackbirds of 1928\n*Encyclopedia of the Harlem Renaissance (book)\n*The New Negro: The Life of Alain Locke\n*Shuffle Along, musical\n* Untitled (The Birth), painting\n* Voodoo (opera)\n* When Washington Was in Vogue\n* The Negro in Art\n* Taboo (1922 play)\n* ''There'll Be Some Changes Made\nSee also\n*Black Arts Movement, 1960s and 1970s\n*Black Renaissance in D.C.\n*Chicago Black Renaissance\n*List of female entertainers of the Harlem Renaissance\n*List of figures from the Harlem Renaissance\n*New Negro\n*Niggerati\n*William E. Harmon Foundation award\n*Black and tan clubs, nightclubs featuring black performers\n*Cotton Club, nightclub\nGeneral:\n*Roaring Twenties\n*African-American art\n*African-American culture\n*African-American literature\n*List of African-American visual artists\nNotes and references\nNotes\nReferences\n*Amos, Shawn, compiler. Rhapsodies in Black: Words and Music of the Harlem Renaissance. Los Angeles: Rhino Records, 2000. 4 Compact Discs.\n*Andrews, William L.; Frances S. Foster; Trudier Harris, eds. The Concise Oxford Companion To African American Literature.  New York: Oxford Press, 2001.\n*Bean, Annemarie. A Sourcebook on African-American Performance: Plays, People, Movements. London: Routledge, 1999; pp. vii + 360.\n*Greaves, William documentary From These Roots.\n*Hicklin, Fannie Ella Frazier. \"The American Negro Playwright, 1920–1964\". PhD Dissertation, Department of Speech, University of Wisconsin, 1965. Ann Arbor: University Microfilms 65–6217.\n*Huggins, Nathan. Harlem Renaissance. New York: Oxford University Press, 1973.\n*Hughes, Langston. The Big Sea. New York: Knopf, 1940.\n*Hutchinson, George. The Harlem Renaissance in Black and White. New York: Belknap Press, 1997.\n*Lewis, David Levering, ed. The Portable Harlem Renaissance Reader. New York: Viking Penguin, 1995.\n*Lewis, David Levering. When Harlem Was in Vogue. New York: Penguin, 1997.\n*Patton, Venetria K., and Maureen Honey, eds. Double-Take: A Revisionist Harlem Renaissance Anthology. New Jersey: Rutgers University Press, 2006.\n*Perry, Jeffrey B. A Hubert Harrison Reader. Middletown, CT: Wesleyan University Press, 2001.\n*Perry, Jeffrey B. Hubert Harrison: The Voice of Harlem Radicalism, 1883–1918. New York: Columbia University Press, 2008.\n*Powell, Richard, and David A. Bailey, eds. Rhapsodies in Black: Art of the Harlem Renaissance. Berkeley: University of California Press, 1997.\n*Rampersad, Arnold. The Life of Langston Hughes. 2 volumes. New York: Oxford University Press, 1986 and 1988.\n* Robertson, Stephen, et al., \"Disorderly Houses: Residences, Privacy, and the Surveillance of Sexuality in 1920s Harlem\", Journal of the History of Sexuality, 21 (September 2012), 443–66.\n*Soto, Michael, ed. Teaching The Harlem Renaissance. New York: Peter Lang, 2008.\n*Tracy, Steven C. Langston Hughes and the Blues. Urbana: University of Illinois Press, 1988.\n*Watson, Steven. The Harlem Renaissance: Hub of African-American Culture, 1920–1930. New York: Pantheon Books, 1995.\n*Williams, Iain Cameron. \"Underneath a Harlem Moon ... The Harlem to Paris Years of Adelaide Hall\". Continuum Int. Publishing, 2003.\n*Wintz, Cary D. Black Culture and the Harlem Renaissance. Houston: Rice University Press, 1988.\n*Wintz, Cary D. Harlem Speaks: A Living History of the Harlem Renaissance. Naperville, Illinois: Sourcebooks, Inc., 2007\nFurther reading\n* Brown, Linda Rae (1990). \"William Grant Still, Florence Price, and William Dawson: Echoes of the Harlem Renaissance\". In Samuel A. Floyd, Jr (ed.), Black Music in the Harlem Renaissance, Knoxville: University of Tennessee Press, pp.&nbsp;71–86.\n* Buck, Christopher (2013). [http://bahai-library.com/buck_america-mosaic_harlem_renaissance Harlem Renaissance] in: The American Mosaic: The African American Experience. Santa Barbara, California: ABC-CLIO.\n* Evans, Curtis J. (2008), The Burden of Black Religion, Oxford University Press,\n* Johnson, Michael K. (2019), Can't Stand Still: Taylor Gordon and the Harlem Renaissance. Jackson: University Press of Mississippi,  ([https://academic.oup.com/jah/article-abstract/107/2/517/5907722?redirectedFrom=fulltext online])\n* King, Shannon (2015). Whose Harlem Is This, Anyway? Community Politics and Grassroots Activism during the New Negro Era. New York University Press.\n* Lassieur, Alison. (2013). The Harlem Renaissance: An Interactive History Adventure, North Mankato, Minnesota: Capstone Press,\n*Murrell, Denise (2018). Posing Modernity: The Black Model from Manet and Matisse to Today. New Haven and London: Yale University Press.\n* Murrell, Denise, ed. (2024). The Harlem Renaissance and Transatlantic Modernism. Exh. cat. Metropolitan Museum of Art. ISBN 9781588397737\n* Padva, Gilad (2014). \"Black Nostalgia: Poetry, Ethnicity, and Homoeroticism in Looking for Langston and Brother to Brother\". In Padva, Gilad, Queer Nostalgia in Cinema and Pop Culture, pp.&nbsp;199–226. Basingstoke, UK, and New York: Palgrave Macmillan.\n* Wall, Cheryl A. (2016). The Harlem Renaissance: A Very Short Introduction. Oxford University Press.\n* Wintz, Cary D., and Paul Finkelman (2012). Encyclopedia of the Harlem Renaissance. London: Routledge.\nExternal links\n* [https://www.loc.gov/rr/program/bib/harlem/harlem.html \"A Guide to Harlem Renaissance Materials\"], from the Library of Congress\n*\n* [http://www.authorsden.com/visit/viewarticle.asp?id=62700&AuthorID=25279 \"The Approaching 100th Anniversary of the Harlem Renaissance\"], by HR historian Aberjhani\n* [https://www.worldcat.org/oclc/51780394  Underneath A Harlem Moon] by Iain Cameron Williams\n* [http://www.oldmagazinearticles.com/article-summary/harlem-rennaisance_magazine_article_1922#.XtB8tWhKizl I'd Like to Show You Harlem – by Rollin Lynde Hartt, The Independent, April, 1921]\n* [https://exchange.umma.umich.edu/resources/23636 Collection: \"Artists of the Harlem Renaissance\"]  from the University of Michigan Museum of Art\n* [https://www.metmuseum.org/exhibitions/the-harlem-renaissance-and-transatlantic-modernism \"The Harlem Renaissance and Transatlantic Modernism\"]. Exhibition at the Metropolitan Museum of Art, February 25 – July 28, 2024.\n* [https://www.nytimes.com/spotlight/harlem-renaissance?searchResultPosition=1 Articles in The New York Times'' on the Harlem Renaissance, including on the 2024 exhibition at the Metropolitan Museum of Art]"
    }
  ]
}