{
  "content": [
    {
      "type": "text",
      "text": "# Harley Warrick\n\n| birth_place = Londonderry, Ohio\n| death_date =\n| death_place = Belmont, Ohio\n| nationality =\n| other_names =\n| known_for = Mail Pouch Tobacco Barn sign painting\n| occupation = Barn painter\n}}\nHarley E. Warrick (October 5, 1924 – November 24, 2000), was an American barn painter, best known for his work painting Mail Pouch tobacco advertising on barns across 13 states in the American Midwest and Appalachian states. Over his 55-year career, Warrick painted or retouched over 20,000 Mail Pouch signs. When he retired, he was the last of the Mail Pouch sign painters in America. The Mail Pouch signs have become iconic and some of Harley Warrick's work has been exhibited by the Smithsonian Institution. Though he was not the first or the only Mail Pouch barn painter, he was the most prolific and famous. Featured in newspapers and magazines, traveling to fairs and festivals to demonstrate his skills, Warrick's fame increased appearing on Good Morning America and On the Road with Charles Kuralt.\nEarly life\nWarrick was born and raised in Londonderry, Ohio, where his family had a dairy farm. When he returned from service in World War II in 1946, he began painting his family's dairy barn with a team of Mail Pouch sign painters; they suggested he join them. Upon reflection, Warrick decided that it would be better than milking his family's Jersey cows each day so he began painting with the team. Having just returned from the Army, Warrick had no other clothes, so he painted barns for the first week in his uniform. It turned out to be the only job he ever had.\nMail Pouch career\nWarrick trained under a seasoned Mail Pouch barn painter, Maurice Zimmerman, who also painted ads for competitor Red Man tobacco, Simoniz car wax, and Minneapolis Milling Company.\nWarrick and a partner traveled from town to town, sometimes sleeping in the back of a pickup truck or cheap motel. They were often on the road for months at a time. With the partner painting the black background and Warrick painting the letters, they were able to paint two barns a day, taking about six hours per barn. Warrick painted signs in Ohio, Pennsylvania, West Virginia, Maryland, Kentucky, Indiana, New York, Illinois, and Michigan.\nWarrick used no template or tools, painting the sides of barns entirely by eye. He  started with the letter 'E' in 'CHEW' and then add the 'W' and then 'CH'. He once said that he always started with the 'H', 'E', and 'W' as those represented his initials.\nWarrick sometimes deliberately misspelled words to see how many phone calls the tobacco company would get about it. He had said that once in a while, he put three 'C's in 'TOBACCO' just to see if anyone noticed.\nThe Highway Beautification Act of 1965, which prohibited advertising billboards within  of an interstate highway, effectively ended the era of painting the sides of barns for advertising. The Mail Pouch signs were designated as National Historic Landmarks, and later exempted from regulations against tobacco advertising. Warrick continued painting barns along lesser roads and highways until his retirement from the Swisher International Group, owner of Mail Pouch Tobacco, in 1991. Mail Pouch suspended the barn painting advertising campaign after his retirement.\nWarrick is cited as an influence on Scott Hagan, who is noted for his barn paintings for the Ohio Bicentennial.\nPersonal life\nWarrick was married twice and had four children. The travel and time away from home put a strain on his first marriage and his wife gave him an ultimatum: either choose her or the job. Warrick said that he must have liked the job better than he liked her, and they parted. After remarrying, he went out only for a week at a time.\nWhen he retired, Warrick continued to paint Mail Pouch signs on the sides of barn-shaped bird feeders and mailboxes that he would make and sell in his workshop in Belmont, Ohio. He died in a Wheeling, West Virginia, hospital in November 2000 of an aneurysm.\nReferences\nFurther reading\n*"
    }
  ]
}