{
  "content": [
    {
      "type": "text",
      "text": "# Harlem's Rattlers and the Great War\n\n'Harlem's Rattlers and the Great War: The Undaunted 369th Regiment and the African American Quest for Equality' is a book co-authored by John H. Morrow Jr. and Jeffrey T. Sammons. The book was published by the University Press of Kansas in 2014.The book details the experiences of the African American 369th Regiment in World War I. The book also explores the racial climate in the era and how the 369th Regiment fits into the larger narrative of the African American campaign for equality in America.\nReception\n“A book that readers of military history will cherish and general readers and lovers of history will find informative. It is both a reference book and an important historical narrative that lays the ground for the civil rights movement.”\n:::-New World Review\n“This book is the definitive history of the 369th Regiment in World War I, an outstanding black infantry regiment  3,000 men led by a white command element. It is the most complete, scholarly, and fully documented account of this famous (and underpublicized) unit, unlikely to be superseded.\"\n:::-Joint Force Quarterly\n“Belongs on the shelf of any serious student of the 15th/369th Regiment, American involvement in World War I, race relations in the early twentieth century, and African American history.”\n:::-Journal of Military History\nReferences\nExternal links\n*[http://www.pritzkermilitary.org/whats_on/pritzker-military-presents/jeffrey-sammons-harlems-rattlers-and-great-war/ Jeffrey Sammons discusses the book at the Pritzker Military Museum & Library]\n*[https://www.c-span.org/video/?317104-1/harlem-rattlers-world-war Presentation by Jeffrey Sammons on ''Harlem's Rattlers and the Great War at the New York Military Affairs Symposium, January 17, 2014]\n*[https://www.c-span.org/video/?319605-1/harlems-rattlers-great-war Presentation by Jeffrey Sammons on Harlem's Rattlers and the Great War'' at Medgar Evers College, May 21, 2014]"
    }
  ]
}