{
  "content": [
    {
      "type": "text",
      "text": "# Harold Coward\n\n| birth_place       =\n| death_date        =\n| death_place       =\n| residence         =\n| citizenship       =\n| nationality       = Canadian\n| fields            = Bioethics, Religious Studies\n| workplaces        =\n| alma_mater        =\n| doctoral_advisor  =\n| academic_advisors =\n| doctoral_students =\n| notable_students  =\n| known_for         =\n| author_abbrev_bot =\n| author_abbrev_zoo =\n| influences        =\n| influenced        =\n| awards            =\n| signature         =\n| signature_alt     =\n| footnotes         =\n}}\nHarold Coward  (born 1936) is a Canadian scholar of bioethics and religious studies. A Bachelor in Divinity (Christian Theology), he earned a doctoral degree in Philosophy in 1973 from the McMaster University. He was a professor at University of Victoria and the University of Calgary. He is particularly known for his studies of Indian religions, as an editor of the Encyclopedia of Hinduism, and has been a Fellow of the Royal Society of Canada since 1991.\nCoward is the author of many publications and has been profiled in  the Vancouver Sun.\nCoward's works and publications have been discussed multiple times in popular media.\nIn 1994, the Vancouver Sun described Coward as \"one of the world's leaders in creating a constructive religious response to the population crisis\".\nIn 1997, Coward was described as \"arguably the most dynamic religion scholar in Canada today\".\nCoward was the first director at the University of Calgary Press (1981–83).\nCoward was director of the University of Victoria's Centre for Studies in Religion and Society.\nCoward is a director at Genome British Columbia.\nAn honorary collection of essays has been dedicated to Coward.\nPublications (selected)\n* Coward, Harold. (2019). [https://www.sunypress.edu/p-6805-word-chant-and-song.aspx Word, Chant and Song: Spiritual Transformation in Hinduism, Buddhism, Islam and Sikhism]. Albany, NY: State University of New York Press.\n*Coward, Harold. (2014). [https://www.wlupress.wlu.ca/Books/F/Fifty-Years-of-Religious-Studies-in-Canada Fifty Years of Religious Studies in Canada: A Personal Retrospective]. Waterloo, Ontario, Canada: Wilfrid Laurier University Press. .\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\nDedicated to Coward\n*\nReferences"
    }
  ]
}