{
  "content": [
    {
      "type": "text",
      "text": "# Harold McQueen Jr.\n\n| birth_place       = Richmond, Kentucky, U.S.\n| death_date        =\n| death_place       = Kentucky State Penitentiary, Kentucky, U.S.\n| criminal_penalty  = Death\n| criminal_status   = Executed by electrocution\n| imprisoned        = Kentucky State Penitentiary\n| conviction        = MurderFirst degree robbery\n| victims           = 1\n| date              = January 17, 1980\n}}\nHarold I. McQueen Jr. (July 25, 1952 – July 1, 1997) was an American man who was the first criminal executed by the state of Kentucky after the reinstatement of capital punishment in the United States in 1976. McQueen was sentenced to death on April 8, 1981, for shooting and killing an unarmed store clerk, Rebecca O'Hearn, while robbing the store in which she worked in Richmond, committed on January 17, 1980.\nEarly life\nHarold McQueen was born on July 25, 1952. When McQueen was 10 years old, he drank alcohol for the first time. At his murder trial, a psychiatrist noted that although that was a \"rather young\" age to start drinking, McQueen claimed he \"never had anyone to tell him to stop drinking.\" McQueen also reported having been raised by older grandparents who did not support him or control his behavior. By the time he was in high school, he had become an alcoholic and started failing out of school; by the time he was around 17 or 18, he began taking LSD, amphetamines, and cocaine. At the age of 19, McQueen enlisted in the Army, citing an intention to \"set [himself] straight\" by avoiding alcohol and the other drugs to which he had become addicted; however, during his time in the army, he became addicted to heroin. Shortly after his stint in the army, McQueen got married, but his wife left him after a brief period, shortly after which McQueen attempted suicide.\nMcQueen had a lengthy criminal history at the time of the murder, including for breaking and entering, destroying public property, burglary, desertion, parole violation, hit and run, and writing bad checks.\nCrime, apprehension, and trial\nMcQueen, his 19-year-old half-brother William Keith Burnell, and his 18-year-old girlfriend Linda Rose spent the day of January 17, 1980 ingesting copious amounts of marijuana, alcohol, and other drugs simultaneously. At approximately 11:00 p.m., McQueen and Burnell entered a Minit Mart in Richmond, Kentucky, with the intent of committing armed robbery in the store. At the time that McQueen and Burnell entered the store, McQueen was high on valium. Rose stayed in the car during the robbery, while McQueen and Burnell entered the store armed with a .22 caliber handgun. The only person in the store was Rebecca O'Hearn, a 22-year-old clerk. McQueen and Burnell ordered O'Hearn to empty the cash register and safe. After she did so, McQueen shot O'Hearn twice point-blank in the face and the back of the head. Burnell detached the store's surveillance camera and placed it in a bag, after which he and McQueen left the store with the surveillance camera, $1,500 in cash, and food stamps, and disposed of the surveillance camera in a nearby pond. A park ranger found O'Hearn's body minutes after McQueen, Burnell, and Rose fled the scene; the park ranger alerted police. O'Hearn, who was barely alive when discovered, was pronounced dead soon after arriving at the hospital.\nShortly after O'Hearn's murder, Burnell was arrested for driving with a revoked license; while visiting him in the Madison County jail, McQueen and Rose were arrested on charges related to an unrelated theft, leading police to search the trailer where they lived. There, police discovered evidence that tied McQueen to the murder, including the murder weapon and a bundle of cash and food stamps from the store that McQueen and Burnell had robbed. Rose also escorted police to the area where McQueen and Burnell had disposed of the surveillance camera. Rose was never charged for her role in the crime; instead, she was required to testify against McQueen and Burnell, who faced trial together for robbery and capital murder. Their joint trial began on March 16, 1981, a little over a year following O'Hearn's murder. On March 29, the jury found both McQueen and Burnell guilty of murder. The jury recommended a twenty-year sentence for McQueen for the robbery, but they recommended the death penalty for the murder because they believed him to have been the main party responsible for the murder. The jury recommended against the death penalty for Burnell and sentenced him to two 20-year prison terms, one for the murder and the other for the armed robbery. Burnell was paroled after serving approximately 11 years of his sentence.\nDeath row and appeals\nOn June 13, 1997, weeks before McQueen's execution, Amnesty International published a list of concerns they had with McQueen's case and his representation at trial. The concerns largely mirrored arguments that McQueen had brought up in his own ultimately unsuccessful appeals to the Supreme Court of Kentucky and the U.S. Court of Appeals for the Sixth Circuit. Amnesty alleged that McQueen's co-defendant received superior representation from a private attorney Burnell's father, William Burnell, had hired. McQueen's court-appointed attorney, Jerome Fish, had practiced law since 1957 and only received $1,000 for representing his client, which Amnesty called \"an insufficient figure to allow an attorney to conduct adequate preparations for trial.\" During an appeal court hearing in 1984, three years after McQueen was sentenced to death, his court-appointed attorney testified that he had never talked to McQueen's family \"because they had a bad reputation in the community.\" He never presented evidence of McQueen's childhood neglect or childhood alcoholism as mitigating evidence, and he also never presented evidence that McQueen suffered from frontal lobe brain damage stemming from his long-term drug abuse that, in addition to his intoxication at the time of the murder, rendered him incapable of forming the intent to commit murder at the time of the crime.\nWhile on death row, McQueen became a devout Catholic. Three days prior to his execution, after accepting that he likely would not receive a pardon, McQueen agreed to deliver a 19-minute videotaped message titled \"It Could Happen to You,\" in which he discussed his childhood and his downward spiral during his young adulthood; he also encouraged children to stay away from drugs. The video was released about a year after McQueen's execution.\nExecution and aftermath\nOn July 1, 1997, McQueen was executed in the electric chair at the Kentucky State Penitentiary in Eddyville. In his final statement, McQueen stated, \"I'd like to apologize one more time to the O'Hearn family. . . . I'd like to apologize to my family, because they're victims as well. I'd like to thank everybody that sent me cards and letters and prayers. Everybody that sent me that, tell them to keep fighting the death penalty.\" McQueen was pronounced dead at 12:07&nbsp;a.m.\nFollowing McQueen's execution, the Courier Journal reviewed interviews investigators conducted with Linda Rose four days after O'Hearn's murder and announced that Rose \"contradicted herself in seven statements about the crime,\" namely when it came to determining which of the two men in the store that night – McQueen or Burnell – pulled the trigger. The Courier-Journal speculated that the reason McQueen was executed while Burnell received a 40-year sentence was because the jury in their joint trial determined that McQueen was the triggerman based on Rose's testimony at trial. The transcript of Rose's interrogation revealed that Rose was uncertain who the triggerman was; Rose's testimony at trial also attributed incriminating statements to McQueen that, during her interrogation, Rose stated Burnell had uttered instead. McQueen's appellate attorneys claimed they had never seen the transcripts.\nAt the time of his death, McQueen was the first person executed in Kentucky since the electrocution of James Kelly Moss on March 2, 1962. , McQueen is the last person executed in the state's electric chair; he is also the only person since the reinstatement of the death penalty nationwide to have been executed in Kentucky involuntarily, meaning that he did not waive his appeals and request that the state execute him, unlike the other two men to have been executed in Kentucky, Edward Lee Harper Jr. in 1999 and Marco Allen Chapman in 2008.\nSee also\n* List of people executed in Kentucky\n* List of people executed in the United States in 1997\nReferences"
    }
  ]
}