{
  "content": [
    {
      "type": "text",
      "text": "# Harpers Ferry National Historical Park\n\n| area_acre = 3,660.73\n| area_ref =\n| established =\n| visitation_num = 407,008\n| visitation_year = 2022\n| visitation_ref =\n| governing_body = National Park Service\n| website = [https://www.nps.gov/hafe/index.htm Harpers Ferry National Historical Park]\n| embedded =\n}}\n}}\nHarpers Ferry National Historical Park, originally Harpers Ferry National Monument, is located at the confluence of the Potomac and Shenandoah rivers in and around Harpers Ferry, West Virginia. The park includes the historic center of Harpers Ferry, notable as a key 19th-century industrial area and as the scene of John Brown's failed abolitionist uprising. It contains the most visited historic site in the state of West Virginia, John Brown's Fort.\nThe park includes land in the Shenandoah Valley in Jefferson County, West Virginia; Washington County, Maryland and Loudoun County, Virginia. The park is managed by the National Park Service, an agency of the U.S. Department of the Interior. Originally designated Harpers Ferry National Monument in 1944, the park was declared a National Historical Park by the U.S. Congress in 1963. Consisting of almost , it includes the site of which Thomas Jefferson once wrote, \"The passage of the Potomac through the Blue Ridge is perhaps one of the most stupendous scenes in Nature\" after visiting the area in 1783. Due to a mixture of historical events and ample recreational opportunities, all within 50 miles (80&nbsp;km) of Washington, D.C., the park was listed on the National Register of Historic Places on October 15, 1966. In 2017, the Park's Superintendent was Tyrone Brandyburg.\nThe park was originally planned as a memorial to John Brown, responsible for what is by far the most famous incident in Harpers Ferry's history, his 1859 raid and capture of the federal armory. NPS officials in the 1930s focused on John Brown's raid and the Civil War to justify acquiring parts of Harpers Ferry for a historical and military park. This was opposed by organizations such as the United Daughters of the Confederacy and the Sons of Confederate Veterans.\nEarly history\nNative American history in the region dates back to at least 8,000 years ago. The Tuscarora people were the last of the native peoples known to inhabit the area in large numbers, essentially vanishing in the early 18th century. One of these European immigrants, Robert Harper, obtained a patent for the land from the Virginia legislature in 1751 as prior to 1863, West Virginia was still a part of Virginia. The town was originally known as Shenandoah Falls at Mr. Harper's Ferry (1763) due to the ferry business Robert Harper managed and operated.\nToday, the original house built by Robert Harper is the oldest remaining structure in the lower part of the park. George Washington visited the area during his trip to the rivers' confluence in 1785, searching for a waterway to ship goods westward. Later, Washington began the construction of the federal Harpers Ferry Armory on the site, utilizing waterpower from the rivers for manufacturing purposes.\nMeriwether Lewis, under government contract, procured most of the weaponry and associated hardware that would be needed for the Lewis and Clark Expedition at the armory in Harpers Ferry. Blacksmiths also built a collapsible iron boat frame for the expedition. Between the years 1820 to 1840, John H. Hall worked to perfect the manufacturing of interchangeable parts at the armory. Utilizing precision molds and jigs, this was one of the birthplaces of precision manufacturing so that armaments and related mechanical equipment could be standardized and parts would be interchangeable. Subsequently, the development of the modern bullet to replace the round lead slug was achieved by James H. Burton and this improvement was adopted by the U.S. Army in 1855. Employing at times up to 400 workers, the armory produced over half a million muskets and rifles between 1801 and 1860.\nJohn Brown's raid and the American Civil War\n'' illustration of U.S. Marines attacking John Brown's \"Fort\"]]\nAbolitionist John Brown led an armed group in the capture of the armory in 1859. Brown had hoped he would be able to arm the slaves and lead them against U.S. forces in a rebellion to overthrow slavery. After his capture in the armory by a group of Marines (led by U.S. Army Colonel Robert E. Lee), Brown was hanged, predicting in his last words that civil war was looming on the horizon, a prediction that came true less than two years later. The most important building remaining from John Brown's raid is the firehouse, now called John Brown's Fort, where he resisted the Marines.\ntoday]]\nThe American Civil War (1861–1865) found Harpers Ferry right on the boundary between the Union and Confederate forces. The strategic position along this border and the valuable manufacturing base was a coveted strategic goal for both sides, but particularly the South due to its lack of manufacturing centers. Consequently, the town exchanged hands no less than eight times during the course of the war. Union forces abandoned the town immediately after the state of Virginia seceded from the Union, burning the armory and seizing 15,000 rifles. Colonel Thomas J. Jackson, who would later become known as \"Stonewall\", secured the region for the Confederates a week later and shipped most of the manufacturing implements south. Jackson spent the next two months preparing his troops and building fortifications, but was ordered to withdraw south and east to assist P.G.T. Beauregard at the First Battle of Bull Run. Union troops returned in force, occupying the town and began to rebuild parts of the armory. Stonewall Jackson, now a major general, returned in September 1862 under orders from Robert E. Lee to retake the arsenal and then to join Lee's army north in Maryland. Jackson's assault on the Federal forces there, during the Battle of Harpers Ferry led to the capitulation of 12,500 Union troops, which was the largest number of Union prisoners taken at one time during the war. The town exchanged hands several more times over the next two years.\nStorer College\nStorer College was built in Harpers Ferry as one of the first integrated schools in the U.S. Frederick Douglass served as a trustee of the college, and delivered a memorable oration on the subject of John Brown there in 1881. Subsequent rulings known as Jim Crow Laws led other African American leaders such as Dr. W. E. B. Du Bois to hold the second Niagara Movement (ancestor of the NAACP) conference at the school in 1906 to discuss ways to peacefully combat legalized discrimination and segregation. After the end of school segregation in 1954, Storer College closed the following year. What remains of the Storer College campus is now administered by the National Park Service, as part of Harpers Ferry National Historical Park, Harpers Ferry Center, and the Stephen T. Mather Training Center.\nThe park today\nSeveral historical museums now occupy restored 19th century buildings in the Lower Town Historic District of Harpers Ferry. Nearly half a million people visit the park each year. (In comparison, 15 million people visit Washington, DC, each year.) North of the park and across the Potomac from Harpers Ferry is the Chesapeake and Ohio Canal National Historical Park. The canal, which operated from 1828 to 1924, provided a vital waterway link with areas up and downstream prior to and during the early years after the arrival of the railroad. Today, the canal towpath and park, which provide access to the Maryland Heights section of the Harpers Ferry N.H.P., can be accessed by foot from Harpers Ferry via a footbridge constructed by the National Park Service alongside tracks on the railroad bridge over the Potomac, or via car by traveling east from Harpers Ferry on U.S. Route 340 to access points near Sandy Hook, Maryland. Aside from the extensive historical interests of the park, recreational opportunities include fishing, boating, and whitewater rafting as well as hiking, with the Appalachian Trail passing right through the park. The park adjoins the Harpers Ferry Historic District, as well as two other National Register of Historic Places locations: St. Peter's Roman Catholic Church and the B & O Railroad Potomac River Crossing.\nOn June 6, 2016, the Harpers Ferry National Historical Park was featured on the third 2016 release of the America the Beautiful Quarters series. In the middle of the quarter is a depiction of John Brown's Fort, while the outside has the year (2016), location (Harpers Ferry), and the state (West Virginia). This specific coin is the 33rd park quarter to be released in the America the Beautiful Park Quarter series.\nThe Civil War Trust (a division of the American Battlefield Trust) and its partners have acquired and preserved  of the battlefield in nine acquisitions. Most of that land has been sold or conveyed to the National Park Service and incorporated into the park.\nThe park was listed in its entirety on the National Register of Historic Places on October 15, 1966. The designation was expanded on May 10, 2016.\nLower town sites\nThe Lower Town points of interest are clustered where the Shenandoah River meets the Potomac River, and run along Shenandoah Street, Potomac Street and High Street.\n* Information Center\n* Restoration Museum\n* Frankel's Clothing Store\n* Industry Museum\n* Bookshop\n* Blacksmith Shop\n* Hamilton Street\n* A Place in Time Museum\n* Provost Marshal Office\n* Stipes’ Boarding House\n* Dry Goods Store\n* Arsenal Square\n* John Brown's Fort\n* The Point\n* John Brown Museum\n* Wetlands Museum\n* Storer College/Niagara Movement Museum\n* A. Burton Clocks and Jewelry Exhibit\n* 1862 Battle of Harpers\n* Ferry Museum\n* Confectionery Exhibit\n* Civil War Museum\n* Black Voices Museum\n* White Hall Tavern\n* Meriwether Lewis Exhibit\n* Harper House\n* Jefferson Rock\n* Harper Cemetery\nVirginius Island\nVirginius Island was a thriving, water-powered manufacturing center before the Civil War. Economically it was always part of Harpers Ferry, and the Harpers Ferry station of the Winchester and Potomac Railroad was on Virginius Island, through which its track ran; the rail line, although rebuilt, is still in daily use. It was a working-class community. The island's industries declined after the Civil War, and successive floods destroyed the industries. After the flood of 1936 no structure remained standing and there were no remaining residents.\nThe National Park Service has studied the industrial and sociological history of Virginius Island in depth. Many ruins have been stabilized and signed, footbridges and paths maintained. It can be visited on a walking tour.\nGallery\nFile:Harpers Ferry Park sign, WV IMG_4662.JPG|Harpers Ferry entry sign\nFile:High Street - Harpers Ferry.jpg|High Street, looking north (downhill) towards the Potomac River and Maryland\nFile:HP Harper's Ferry2.jpg|Shenandoah Street and Lower Town, looking south (uphill) towards West Virginia\nFile:HarpersFerryWhiteHallTavern1.jpg|White Hall Tavern\nFile:HarpersFerryWhiteHallTavern2.jpg|White Hall Tavern\nFile:St. Peter's Roman Catholic Church, Harpers Ferry, WV - looking east.jpg|St. Peter's Catholic Church\nFile:HarpersFerryDryGoods1.jpg|The Dry Goods Store\nFile:HarpersFerryWetlandsExhibit.jpg|Wetlands Exhibit\nFile:HarpersFerryCSXRailBridge.jpg|The CSX railroad bridge crosses the Potomac River on the edge of the park\nFile:Jefferson Rock, Harpers Ferry, WV - looking east.jpg|View from Jefferson Rock\nFile:Harpersferry bridge.JPG|View from Maryland Heights\nSee also\n* Harpers Ferry Historic District\n* Heyward Shepherd monument\n* John Brown's Fort\n* John Brown's raid on Harpers Ferry\n* Journey Through Hallowed Ground National Heritage Area\n* Storer College\nReferences\nFurther reading\n*\n*\n*\nExternal links\n* [https://www.nps.gov/hafe/index.htm Harpers Ferry National Historical Park] – official site\n* [http://www.harpersferryhistory.org Harpers Ferry Historical Association] – friends site, features interactive guide to the park\n*"
    }
  ]
}