{
  "content": [
    {
      "type": "text",
      "text": "# Harry S. Truman 1948 presidential campaign\n\n| candidate    =\n| affiliation  = Democratic Party\n| status       =\n| formed       =\n| announced    =\n| launched     =\n| suspended    =\n| headquarters =\n| key_people   =\n| receipts     =\n| fec_date     =\n| slogan       = Give 'em hell, Harry!\n| themesong    = \"I'm Just Wild About Harry\" by Eubie Blake and Noble Sissle\n| chant        =\n| website      =\n}}\nIn 1948, Harry S. Truman and Alben W. Barkley were elected president and vice president of the United States, defeating Republican nominees Thomas E. Dewey and Earl Warren. Truman, a Democrat and vice president under Franklin D. Roosevelt, had ascended to the presidency upon Roosevelt's death in 1945. He announced his candidacy for election on March8, 1948. Unchallenged by any major nominee in the Democratic primaries, he won almost all of them easily; however, many Democrats like James Roosevelt opposed his candidacy and urged former Chief of Staff of the United States Army Dwight D. Eisenhower to run instead.\nTruman wanted U.S. Supreme Court Associate Justice William O. Douglas to be his running mate. Douglas declined, claiming a lack of political experience; in reality, his friend Thomas Gardiner Corcoran had advised him not to be a \"number two man to a number two man\". Senator Barkley's keynote address at the 1948 Democratic National Convention energized the delegates and impressed Truman, who then selected Barkley as his running mate. When the convention adopted Truman's civil rights plank in a close vote of  to , many Southern delegates walked out of the convention. After order was restored, a roll call vote gave Truman a majority of delegates to be the nominee; Barkley was nominated the vice-presidential candidate by acclamation.\nThe Progressive Party nominated Henry A. Wallace, a former Democratic vice president, to run against Truman. Strom Thurmond, the governor of South Carolina, who had led a walkout of a large group of delegates from Mississippi and Alabama at the 1948 convention, also ran against Truman as a Dixiecrat, campaigning for states' rights. With a split of the Democratic Party, most polls and political writers predicted victory for Dewey and gave Truman little chance.\nDuring the campaign, Truman mostly focused on blaming the Republican-controlled Congress for not passing his legislation, calling it a \"do-nothing Congress.\" In early September 1948, Truman conducted various whistle-stop tours across the nation, covering over  on the Ferdinand Magellan railcar. Of all of the speeches which he gave during his whistle-stop tour, only about 70 were broadcast on the radio even locally, and only 20 of them were heard nationally. During the final days of the campaign, the Truman campaign released a film titled The Truman Story showing newsreel footage of the whistle-stop tour. Although he received some endorsements, including that of Screen Actors Guild president Ronald Reagan, most broadcasting companies were sure of Dewey's victory. Ultimately, Truman won with 303 electoral votes to Dewey's 189 and Thurmond's 39. Before the results were released, an early edition of the Chicago Daily Tribune wrongly anticipated the result with the headline \"Dewey Defeats Truman\". Time magazine later described an image of Truman holding the newspaper as the \"greatest photograph ever made of a politician celebrating victory.\" Truman and Barkley were inaugurated on January 20, 1949. Truman's 1948 campaign and the election are most remembered for the failure of polls and Truman's upset victory.\nBackground\nHarry S. Truman was born in Lamar, Missouri, in 1884. After graduating from Independence High School in 1901, he enrolled at the Spalding's Commercial College, but dropped out within a year. When the United States entered World War&nbsp;I in 1917, Truman joined BatteryB, successfully recruiting new soldiers for the expanding unit, for which he was selected as their first lieutenant. By July 1918, he became commander of the newly arrived BatteryD of the 129th Field Artillery, 35th Division. After the war, he was elected the Presiding Judge of Jackson County, Missouri, and later served as a senator from Missouri. As a senator, he was head of the Senate Special Committee to Investigate the National Defense Program, known as the Truman Committee.\n's portrait, taken in 1945]]\nBy 1944, most of the advisors of the incumbent President Franklin D. Roosevelt believed that he might not live out a fourth term and that his vice president would likely become the next president. Most of Roosevelt's advisors viewed the incumbent Vice President Henry A. Wallace as too liberal. In 1944, Roosevelt replaced Wallace from his ticket with Truman. Despite showing little interest in being vice president, Truman was selected by the 1944 Democratic National Convention as the nominee. The Roosevelt–Truman ticket won the presidential election, defeating the Republican ticket of Thomas E. Dewey and John W. Bricker. Truman was sworn in as vice president on January20, 1945. He had been vice president for 82 days when Roosevelt died on April12, making Truman the 33rd president. Truman later said: \"I felt like the moon, the stars, and all the planets had fallen on me.\"\nTruman asked Roosevelt's cabinet members to remain in their positions, telling them he was open to their advice. He emphasized a central principle of his administration: he would be the one making the decisions, and they were to support him. During World War&nbsp;II, with the invasion of Japan imminent, he approved the schedule for dropping two atomic bombs to avoid a costly invasion of the Japanese mainland. It had been estimated the invasion could take a year and cause 250,000 to 500,000 American casualties. The United States bombed Hiroshima on August6, and Nagasaki three days later, leaving approximately 105,000 dead; Japan agreed to surrender the following day. Truman said that attacking Japan in this way, instead of invading it, saved many lives on both sides. With the end of World WarII, Truman implemented the Marshall Plan, allocating foreign aid for Western Europe. Apart from primaries and campaigning in 1948, Truman dealt with the Berlin Blockade, which is considered the first major diplomatic crisis of the Cold War. During Truman's presidency, his approval ratings had dropped from 80 percent in early 1945 to 30 percent in early 1947. The 1946 mid-term election alarmed Truman when Republicans won control of both houses of Congress for the first time since the 1920s. In 1947, Truman told his Secretary of Defense James Forrestal that, except for the \"reward of service\", he had found little satisfaction in being president.\nGaining the nomination\nPreparing for a run\nIn December 1947, former Vice President Wallace had announced via radio that he would seek the presidency in 1948 as a third-party candidate. He was dissatisfied with Truman's foreign policy, and in his announcement, made an attempt to link Truman to a war-oriented point of view. The previous year, Truman had demanded and received his resignation from the cabinet as the Secretary of Commerce. Due to his declining popularity, Truman had initially decided not to run. He considered former Chief of Staff of the Army General Dwight D. Eisenhower as an ideal candidate for the Democrats, and persuaded him to contest the presidency. In a public statement, however, Eisenhower declined all requests to enter politics, without disclosing his political party affiliation. Momentum among Americans for Democratic Action (ADA) members and politicians grew for the Draft Eisenhower movementto the extent that some Democratic politicians began organizing a \"Dump Truman\" effort to persuade Eisenhower to run as a Democrat. According to Secretary of the Army Kenneth Royall, Truman even agreed to run as the vice-presidential nominee of Eisenhower, if he so desired, but all efforts to persuade him failed.\nIn early 1948, Truman agreed to contest the presidency, asserting that he wanted to continue contributing to the welfare of the country. His advisor, Clark Clifford, later said that the greatest ambition Truman had was to be elected in his own right. His candidacy faced opposition within the Democratic Party from the progressive movement led by Wallace, and the states' rights movement led by South Carolina Governor Strom Thurmond. In November 1947, Democratic political strategist James H. Rowe wrote a memo titled \"The Politics of 1948\", highlighting the challenges and the road map for Truman's campaign. Clifford edited and presented the forty-three page confidential memo to Truman, which stated: \"The Democratic Party is an unhappy alliance of Southern conservatives, Western progressives, and Big City labor.\" Rowe accurately predicted Dewey would win the Republican nomination, calling him a \"resourceful, intelligent and highly dangerous candidate\". Rowe also warned of the potential threat from Southern Democrats and Wallace. The Rowe–Clifford memo advised Truman to project himself as a strong liberal and focus his campaign primarily on urban blacks, labor, and farmerswho made up the core of the New Deal coalition. Although Truman did not trust Rowe because of their difference of opinion in the past, he endorsed the strategy.\nIn his 1948 State of the Union address, Truman emphasized civil rights, saying: \"Our first goal is to secure fully the essential human rights of our citizens.\" On March8, 1948, Democratic National Committee Chair J. Howard McGrath officially declared Truman's candidacy. He said: \"The president has authorized me to say, that if nominated by the Democratic National Convention, he will accept and run.\"  The presidential primary contests began the next day with the New Hampshire primary. Truman won the support of all unpledged delegates unopposed. He faced little opposition in the primary contests, as he was the sole major contender. He won almost all the contests by comfortable margins, receiving approximately 64 percent of the overall vote. Despite his performance in the primaries, Gallup Poll indicated no matter how Truman might campaign, he would lose in November to any of four possible Republican nominees: Dewey, Arthur Vandenberg, Harold Stassen, or Douglas MacArthur.\nHistorian and author Andrew Busch described the political scenario as:\nAmericans in 1948 had to render judgment on three major policy innovations. It was the first presidential election since depression, war, and the presence of FDR in which the nation could take stock of the New Deal direction of domestic policy. It was also the first election after the establishment of containment as the foreign policy of the United States and the first since Truman had made civil rights an important part of the federal policy agenda... The presidential nominating system in 1948 was substantially different from the reformed system to which we are accustomed, and the differences were important. Primary elections influenced the nomination but did not control it; it was possible to seriously consider a genuine last-minute draft of a candidate; and the national conventions really mattered.\nEarly developments\nIn early June, the University of California, Berkeley invited Truman to accept an honorary doctorate. Truman converted his California trip to a whistle-stop train tour through eighteen strategic states, campaigning from June3. The president's discretionary travel fund covered the costs because of a lack of donations to the Democratic National Committee. Truman referred to it as a \"non-political trip\". He focused on the eightieth Congress in his speeches, referring to it as \"the worst congress\". As his tour progressed, the crowds grew significantly, from approximately a thousand in Crestline, Ohio, to a hundred thousand in Chicago, Illinois. In Omaha, Nebraska, Truman's address at the Ak-Sar-Ben auditorium to the veterans of the 35th Division has been referred to as an embarrassment. The auditorium had a capacity of ten thousand, but fewer than two thousand attended. Organizers failed to publicize that the auditorium was open to the public and not just veterans of the 35th Division. Newspapers printed images of the nearly vacant auditorium, and columnists interpreted this as a further sign of Truman's dwindling popularity. The same day, Truman watched a parade in his presidential car with Roy J. Turner, the governor of Oklahoma. When BatteryD of the 129th Field Artillery passed by, Truman joined the veterans of his World WarI military unit and marched with them for half a mile. Two days later at Los Angeles, an estimated one million people gathered on Truman's way from the railroad station to the Ambassador Hotel. The Los Angeles Times reported that the crowd \"clung to the roofs of buildings, jammed windows and fire escapes and crowded five deep along the sidewalk\".\nwas Truman's initial choice for his running mate.]]\nAlthough Truman ran mostly unopposed in the primaries, the \"Eisenhower craze\" was in full swing among some Democrats a few weeks before the convention. Franklin D. Roosevelt's son, James Roosevelt, campaigned for Eisenhower to contest the nomination and take Truman's place on the ticket. Despite several refusals, Eisenhower was still being pursued by various political leaders. Several polling agencies suggested Eisenhower was likely to defeat Dewey if he ran in place of Truman. Reacting to this at a news conference on July1, Truman said he would not withdraw his candidacy even though no one had seriously challenged him in a single Democratic primary. Still, Roosevelt made no secret of his intention to prevent Truman from becoming the nominee. Truman once told Roosevelt: \"If your father knew what you were doing to me, he would turn over in his grave.\"\nWith the convention approaching, Truman still had to decide on a running mate. He wanted one younger than him and strong on liberal issues. His initial choice was Supreme Court Justice William O. Douglas. Douglas was also the alternative candidate for most of the Eisenhower supporters, but he declined, claiming a lack of political experience; he also wanted to remain in the Supreme Court. His friend Thomas Gardiner Corcoran had suggested him not to be a \"number two man to a number two man\". A week before the convention, Roosevelt sent telegrams to all 1,592 delegates voting for the party nomination, asking them to arrive in Philadelphia two days early for a special Draft Eisenhower caucus attempting to make a strong joint appeal to Eisenhower. Columnist Drew Pearson wrote: \"If the Democrats failed to get Ike [Eisenhower] to run, every seasoned political leader in the Democratic Party is convinced Harry Truman will suffer one of the worst election defeats in history.\" Humiliated by the draft, Truman called Roosevelt a \"Demo-republican\" and \"double-dealer\". After Eisenhower declined to run yet again, various ADA members unsuccessfully tried to persuade Douglas to contest the nomination, but many Truman supporters soon believed that Truman would be chosen as the Democratic nominee.\nDemocratic convention\n, pictured in 1937]]\nThe 1948 Democratic National Convention convened at the Philadelphia Convention Hall in Philadelphia, Pennsylvania, from July12 to July15. The crowd was smaller than the Republican National Convention held a few weeks earlier. Some delegates carried banners with the slogan \"Keep America Human with Truman\". Viewing the first televised Democratic National Convention from the White House, Truman heard Senator Alben W. Barkley of Kentucky deliver a keynote address that energized the delegates in the convention hall. After his speech, some delegates broke into a spontaneous demonstration and marched around the hall singing \"My Old Kentucky Home\" carrying banners inscribed with \"Barkley for Vice-President\". When Senator Howard McGrath asked Truman his views on the speech, Truman replied: \"If Barkley is what the convention wanted for the vice presidency, then Barkley is my choice too.\" At 71, Barkley was older than Truman, and from Kentucky, neither of which helped to counteract the issue of Truman's age, nor bring a geographical balance to the ticket. Barkley, however, was immensely popular within the Democratic Party, and political experts wrote that his presence on the ticket would help to cement the fractious Democratic coalition. The following day, Truman called Barkley asking him to be his running mate, saying: \"If I had known you wanted it the vice presidency, I certainly would have been agreeable.\" Barkley agreed to be his running mate.\nJuly 14 was scheduled for Truman's nomination and his acceptance speech. Before his arrival, the Southern delegates were agitated when the convention adopted Truman's civil rights plan, which supported equal opportunity in employment and in the military. Although Truman did not intend to alienate the South, many Southern delegates from Mississippi were sent with binding instructions to leave the convention if it did not endorse the states' rights plank. Soon after Senator Francis J. Myers read the civil rights plank, many Southern delegates rose in protest. They demanded the convention to endorse their states' rights plank, which specifically called for the power of states to maintain segregation. The convention adopted the civil rights plank in a vote of  to . Hubert Humphrey tried to control the situation with his \"The Sunshine of Human Rights\" address, saying: \"We are not rushing on civil rights, we are 172 years late.\" Soon after, Thurmond led a walkout of a large group of delegates from Mississippi and Alabama, yelling \"Goodbye Harry\".\nThe Washington Post correspondent Marquis Childs later called the walkout of delegates the \"liquidation of one of the major parties\". Shortly after order was restored, Charles J. Bloch, a delegate from Georgia, shouted: \"The South is no longer going to be the whipping boy of the Democratic Party,\" and called for the nomination of Senator Richard Russell as an alternative to Truman. The remaining delegates then voted for presidential nomination, which formally made Truman the Democratic nominee, with  delegates to Russell's 266. Although many remaining Southern delegates voted for Russell, a split vote in South Carolina gave the victory to Truman. Barkley was nominated as the vice-presidential nominee by acclamation. Truman was expected to deliver his acceptance speech at 10:00p.m., but because of the walkout by some delegates the convention was behind schedule, and he did not give his speech until 2:00a.m. on July15. Truman began his speech, electrifying the delegates by directly attacking the Republican platform, and praising Barkleywho was considered the most popular man in the hall. He said:I accept the nomination. And I want to thank this convention for its unanimous nomination of my good friend and colleague, Senator Barkley of Kentucky. He is a great man, and a great public servant. Senator Barkley and I will win this election and make these Republicans like itdon't you forget that! We will do that because they are wrong and we are right, and I will prove it to you in just a few minutes.\nHe blamed the Republican-controlled Congress for not passing various of his legislative measures. Although he did not mention his opponent Dewey, he criticized the Republican platform, contrasting them for actions of the eightieth Congress. He said that he would call Congress back into session on July26th, Turnip Day,}} to pass legislation ensuring civil rights and social security and establishing a national healthcare program. \"They [Congress] can do this job in fifteen days if they want to do it,\" he challenged. The session came to be known as the Turnip Day Session. Describing his reference of the eightieth Congress, Newsweek reported: \"Nothing short of a stroke of magic could infuse the remnants of the party with enthusiasm, but the magic he had; in a speech bristling with marching words, Mr. Truman brought the convention to its highest peak of excitement.\" American author and historian David Pietrusza later wrote that Truman's speech transformed a \"hopelessly bedraggled campaign\" into an \"instantly energized effort capable of ultimate victory in November\". He referred to the speech as the first great political speech of the television era, and wrote that it moved politics from the radio age to the \"ascendancy of the visual, propelling images as well as words immediately into the homes of millions of Americans\".\nCampaign\n|align=center}}\nInitial stages\n(right) at the dedication of the Idlewild Airport; meeting for the first time since nominated by their respective parties for the presidency.]]\nSoon after the convention Truman stated that the whole concept of his campaign was to motivate voters and galvanize support for the candidate and the party. Republicans charged Truman with crude politics asserting his call for a special session of Congress was the \"act of a desperate man\". Rather than directly attacking Dewey, Truman sought to continue blaming the Republican-controlled Congress. On July17, the Southern delegates who bolted the Democratic Convention convened and nominated Thurmond as the official States' Rights Democratic Party presidential nominee, with Fielding L. Wright, the governor of Mississippi, as their vice-presidential nominee. They were soon nicknamed \"Dixiecrats\", and were perceived as a minor party having strong influence in the South.\nWith the split within the Democratic Party, many pollsters believed Truman had little chance of winning. The initial issue Truman had to deal with was financing the campaign. The Democratic National Committee's funds were insufficient. Moreover, the Dewey campaign had released a collection of quotes from a few well-respected Democratic politicians saying that Truman could not win, reducing the number of donors. A meeting was held at the White House on July22 to form the campaign finance committee. Truman stated he would travel all over the country after Labor Day, and address every stop on the tour to campaign and raise money. Soon after, the Democratic National Committee moved its headquarters from Philadelphia to New York City.\nLouis A. Johnson was named the campaign fundraiser and the finance chairman for the Democratic National Committee. With Truman's declining polling numbers, Johnson's fundraising was crucial for the campaign. William Loren Batt, a member of Combined Munitions Assignments Board, headed a new campaign research unit formed to focus on local issues and trends in the cities where Truman was expected to give speeches. A day before the special session of Congress, the Progressive Party formally nominated Wallace as their presidential nominee, with Glen H. Taylor, a senator from Idaho, as his running mate.\nTruman's close friend Oscar Ewing advised him to take his civil rights plan to its next logical step by desegregating the military by executive order rather than passing it through Congress. Considering the suggestion to be a dangerous move, Truman initially hesitated, asserting that Southern Democrats would oppose it. Ultimately, on July26, 1948, Truman signed Executive Order 9980 creating a system of \"fair employment practices\" within the federal government without discrimination because of race, color, religion or national origin; and Executive Order 9981 re-integrating the segregated Armed Forces. The following day, in the special session of Congress, he called for action on civil rights, economy, farm support, education, and housing development. Republican legislators strongly opposed these measures, but the Dewey campaign partially supported Truman's civil rights plan, trying to separate themselves from the conservative record of Congress. On July31 Truman and Dewey met for the first and only time during the campaign at the dedication of Idlewild Airport (now John F. Kennedy International Airport) in New York City. After speeches were given by both the major party candidates, Truman humorously whispered to Dewey: \"Tom, when you get to the White House, for God's sake, do something about the plumbing.\"\nTruman selected the 1921 popular song \"I'm Just Wild About Harry\" as his campaign song. His opponents mockingly sang the parody song, with the title \"I'm Just Mild About Harry\". In early August, when the special session of Congress was about to end, Truman claimed in his weekly press conference that the eightieth Congress had failed to pass legislation he had proposed to curb inflation. When a reporter asked him, \"Do you think it [Congress] had been a 'do-nothing' Congress?\" Truman replied, \"Entirely\". In a memo to Clark Clifford, Batt provided an overview of events and challenges that the Truman campaign might face. He suggested Truman to campaign in close contact with voters both in August and after Labor Day in September. At the outset of the fall campaign, Truman's advisers urged him to focus on critical states decided by narrow margins in 1944, and make his major addresses in the twenty-three largest metropolitan areas. It was decided he should make three long campaign toursone each through the Midwest, the far West, and the Northeastand a shorter trip to the South.\nWhistle-stop tour\nTruman formally began his campaign on Labor Day with a one-day tour of Michigan and Ohio. In a speech at Grand Rapids, Michigan, he attacked Republicans, claiming that few \"special privilege\" groups controlled them. Grand Rapids was a Republican stronghold, yet around 25 thousand people attended to listen to him. His six stops in Michigan drew approximately half a million people. On September13, a fundraiser was held at the White House with about 30 invited potential donors. Truman asked them for help, saying his campaign did not have the funds to buy radio time, and often had to cut an important part of a speech as a result. He began his whistle-stop tour in an  private armored railway car called the Ferdinand Magellan on September17. While boarding the train, Senator Barkley asked him if he was to carry the fight to the Republicans, to which Truman replied: \"We're going to give 'em hell\".\nApart from Truman and his campaign team, about a hundred other officials boarded the train, including many journalists. Clifford, David Bell, George Elsey, and Charles Murphy were responsible for writing Truman's major speeches. The tour was divided into three segmentsfirst cross-country to California for fifteen days, a six-day tour of the Middle West, followed by a final ten days in the Northeast with a return trip to Missouri. Initially, Truman planned to travel in all 48 states but later decided to campaign only in swing states and Democratic-leaning states, avoiding Deep South states that heavily favored Dixiecrats.\nThe train departed on September 17 from Pittsburgh, and headed west. The first major stop was in Dexter, Iowa, where Truman delivered a speech on September18 at the National Plowing Contest.  He called the Republican Party \"gluttons of privilege\", and said the Democratic Party represents the common people. He said: \"I'm not asking you to vote for me, vote for yourselves, vote for your farms, vote for the standard of living you have won under a Democratic administration.\" Meanwhile, Dewey was also conducting a whistle-stop tour on his train titled the \"Dewey Victory Special\". Thousands attended his speeches, but author Zachary Karabell wrote that the crowd could hardly be called excited; they had no intensity or sense of the importance of the moment. While campaigning, both major candidates did not mention each other by name, but attacked the other's platform. Truman continued blaming the \"do nothing\" Congress and called Republicans a special-interest group. Author Donald R. McCoy observed that: \"[Truman's] voice was flat and nasal, his prepared texts were often stilted, and his gestures were limited to chopping hand motions, which were not always appropriate to what he was saying.\"\nDuring a speech in Salt Lake City, he said: \"Selfish men have always tried to skim the cream from our natural resources to satisfy their own greed. And... [their] instrument in this effort has always been the Republican Party.\" In a busy schedule, Truman delivered four or five speeches a day. Most of the train stops featured a local brass band that played \"Hail to the Chief\" or the \"Missouri Waltz\". Robert Donovan, a correspondent at the New York Herald Tribune, later characterized Truman's campaign as \"sharp speeches fairly criticizing Republican policy and defending New Deal liberalism\". In shorter speeches of about ten minutes, he praised and endorsed the local candidate for congressional election, and gave the rest of the speech covering local and general topics. The size of the crowd increased in each subsequent town as people started seeing Truman as a fearless underdog. His speeches were not covered extensively by radio or television. During one speech, a man from the crowd yelled, \"Give 'em hell, Harry!\", as the news accounts of his promise to Barkley spread across the country. Truman replied: \"I don't give them Hell. I just tell the truth about them, and they think it's Hell.\" Soon after, many people started yelling and repeating \"Give 'em hell, Harry!\", which by late September had become a well-known campaign slogan.\nWhile Truman campaigned on the train, Senator Barkley traveled by airplane and campaigned across the nation, though he also avoided campaigning in the Deep South. While addressing a crowd of about a hundred thousand on September28 in Oklahoma, Truman answered the Republican charges of communism in government. He called that the charges were a \"smoke screen\" of Republican tactics to hide their failure to deal with other issues. Considering the importance of a speech and its effect on the campaign, the Democratic National Committee decided to pay for nationwide radio time. The next day, Truman gave his hundredth speech from the rear platform of the train. He spoke at sixteen stops, addressing more than half a million people.\nDuring the early days of October, Truman kept his specific attacks on the Congress, backed up with the daily facts supplied by Batt's research team. On October11, he gave eleven speeches at different stops over fifteen hours. While addressing a crowd at Springfield, Illinois, the next day, he claimed Democrats to be \"practical folks\", and said that Republicans are afraid to tell the people their stand on specific issues. He remarked: \"The Republicans know they can't run on their recordthat record is too bad. But you ought to know about their record. And since they won't tell you, I will.\"\nIn his letter to his sister, Mary Jane, Truman asserted his firm belief in their victory. He wrote: \"We've got 'em on the run and I think we'll win.\" By the end of his tour, he had delivered 352 speeches covering . Truman campaigned much more actively than Dewey. Although the candidates had only a slight difference in the number of states visited, Truman had a clear lead in the number of campaign stops, having made 238 stops to Dewey's 40.}}\nMedia and polls; the final days\n's political cartoon of October19, 1948, shows the consensus of experts in mid-October.]]\nAs Truman's whistle-stop tour continued the size of the crowd increased. The large, mostly spontaneous gatherings at Truman's whistle-stop events were an important sign of a change in the campaign's momentum, but this shift mostly went unnoticed by polling agencies. Except for Louis H. Bean and Survey Research Center's (SRC) polls, most of the other polls conducted during the fall campaign polled Dewey having a decisive lead over Truman. Dewey's campaign strategy was to avoid major mistakes and act presidential, which likely helped keep his polling numbers high. Elmo Roper, a major pollster, announced that his organization would discontinue polling since it had already predicted Dewey's victory by a large majority of electoral votes. He said that his whole inclination was to predict Dewey's victory by a heavy margin, and wanted to devote his time and efforts in other things. His latest poll showed Dewey leading by an \"unbeatable\" 44 percent to Truman's 31 percent.\nIn early October, when Newsweek in an election survey asked fifty major political writers their prediction, all of them chose Dewey to win. When Truman read the article, he said: \"I know every one of these fifty fellows. There isn't a single one of them has enough sense to pound sand in a rat hole.\" Truman's wife, Bess Truman, was doubtful of Truman's victory, and even asked White House aide Tom Evans: \"Does he [Truman] really think he can win?\" Editors of major media corporations predicted that, in the wake of the expected Democratic defeat nationally, the South would regain its influence in the Democratic Party.\nOf all the speeches Truman gave in September and October, only about seventy were broadcast on the radio even locally; twenty were heard nationally. The New York Herald Tribune reported: \"The voters are turning out to see the President of the United States; turning out in larger numbers than they will see candidate Dewey.\" Most of the major newspapers like The New York Times, the Los Angeles Times, and The Washington Star endorsed Dewey. The only major editorial endorsing Truman was in The Boston Post, under the heading \"Captain Courageous\". The Boston Post called Truman \"humbly honest, homespun and as doggedly determined to do what is best for America as Abraham Lincoln\". Truman arrived back at the White House in early October and conducted some meetings with the Democratic National Committee's research division.\nOn October 3, Truman met with the campaign team to discuss strategy and concluded that the campaign needed a new approach to illustrate his effort for peace and security in the world. He decided to send Chief Justice Fred M. Vinson on a diplomatic mission to Moscow attempting to negotiate an end to the Cold War with Soviet premier Joseph Stalin. Vinson initially disagreed, asserting that members of the court should confine themselves to their duties, especially in an election year, but he finally agreed to go. As soon as the news of Truman's \"Vinson mission\" was released, several of his advisors, including Clifford and Elsey, vehemently opposed it, resulting in Truman immediately withdrawing the plan.\nSeveral editors and columnists accused Truman for appeasing the Soviet Union by using foreign policy for political gain. Time magazine wrote: \"His attempted action was shocking because it showed that he had no conception whatever of the difference between the President of the United States and a U.S. politician.\" Even many Democrats strongly anticipated a victory for Dewey and did not campaign to obtain votes for Truman. On October10, Truman continued with the final segment of his whistle-stop tour by visiting rural counties in Ohio, Indiana, and Wisconsin. The same day, he received a telegram from Thurmond insisting on a debate, but Truman's campaign ignored it as Thurmond's polling numbers were under two percent, even less than Wallace. The next day, Dewey also went on a seven-day tour of the Midwest. With no policies from Dewey to rebut, Truman focused on making campaign promises. As his tour progressed, a crowd of several thousand waited hours for Truman at various stops. Assured of his victory, Truman said that there are going to be \"a lot of surprised pollsters\". His direct approach stood out more favorably compared to Dewey's strategy. Truman discussed specific issues and solutions, while Dewey mostly discussed general problems.\n| width = 25em\n}}\nWith two weeks to election day, polls showed Dewey's lead reduced by six percent, yet polling within the Truman campaign showed Truman winning with 340 electoral votes to Dewey's 108 and Thurmond's 42. Truman moved closer to the progressive left, drawing crowds with Wallace's message. At the packed Chicago Stadium, he delivered a speech to a crowd of 24,000, considered to be his most influential speech during the campaign. One author of the speech, David Noyes, later said that its aim \"was to provoke Dewey into fighting back, a strategy Truman accepted\". Days before the election, he campaigned in Massachusetts at various stops attended by millions of people. The campaign team released a film called The Truman Story on October27, using existing newsreel footage of his whistle-stop tour. It was an instant success compared to The Dewey Story, released by the Republican campaign team. On October31, two days before election day, former First Lady Eleanor Roosevelt urged voters to vote for Truman in a nationally broadcast radio address. Soon after, various leading authors, including Nobel Prize winner Sinclair Lewis, endorsed Truman. The president of Screen Actors Guild, Ronald Reagan, also endorsed him, saying he was \"more than a little impatient with those promises the Republicans made before they got control of Congress a couple of years ago\".\nElection day\nwith erroneous headline]]\non November 3]]\nspeaks at the White House after winning the election]]\nOn the afternoon of election day, Truman went to the Elms Hotel to stay away from the media; only his family and the Secret Service knew his location. Assured of Dewey's victory, the head of the Secret Service, James Maloney, reached New York to provide security to him. About 9:00p.m., just before Truman was about to retire, he called his advisor Jim Rowley to his room, and asked to be wakened if anything important happened. Initial counting showed Truman leading in the popular vote, but news commentators predicted a Dewey victory. Sometime near midnight, Truman woke up, switched on the radio, and heard the National Broadcasting Company commentator H. V. Kaltenborn saying: \"Although the president is ahead by 1,200,000 votes, he is undoubtedly beaten.\" At four in the morning, Rowley woke Truman saying \"We've won!\" At 9:30a.m. he was declared the winner in Illinois and California.\nTruman received 303 electoral votes to Dewey's 189 and Thurmond's 39. He narrowly carried Ohio, Illinois, and California, the three most crucial states to both the campaigns. He won 28 states and  percent of the popular vote. In congressional races, Democrats won control of both the houses with 54 Senate seats for the Democrats and 42 for the Republicans. In the House of Representatives the Democratic victory was overwhelming: 263 seats to 171. In an upset defeat, Dewey officially conceded at 11:00a.m. on November3. Truman's triumph astonished the nation and most of the pollsters. On its cover Newsweek called Truman's victory startling, astonishing and \"a major miracle\". Truman became the first candidate to lose in a Gallup Poll but win the election. His close friend Jerome Walsh recalls Truman on the election night:\nHe [Truman] displayed neither tension nor elation. For instance someone remarked bitterly that if it hadn't been for Wallace, New York and New Jersey would have gone Democratic by good majorities. But the President dismissed this with a wave of his hand. As far as Henry was concerned, he said, Henry wasn't a bad guy; he was doing what he thought was right and he had every right in the world to pursue his course. In his victory speech on November3, he called it \"a victory by the Democratic party for the people\". An early edition of the Chicago Daily Tribune had printed the headline DEWEY DEFEATS TRUMAN, boldly anticipating a victory for Dewey. On November4 Truman stepped out onto the rear platform of the Ferdinand Magellan during a brief stop in St. Louis, Missouri. Holding the Chicago Daily Tribune he posed for reporters to capture the moment. Time magazine later called it the \"greatest photograph ever made of a politician celebrating victory\". Author and Truman's biographer David McCullough later wrote:\nLike some other photographs of other presidentsof Theodore Roosevelt in a white linen suit at the controls of a steam shovel in Panama, or Woodrow Wilson at Versailles, or Franklin Roosevelt, chin up, singing an old hymn beside Winston Churchill on board the Prince of Wales in the dark summer of 1941this of Harry Truman in 1948 would convey the spirit of both the man and the moment as almost nothing else would.\nResults\n|57.06}}\n|35.59}}\n|7.34}}}}|49.55}}\n|45.07}}\n|2.41}}\n|2.37}}\n}}\nSource\n* Electoral Vote:\n* Popular Vote:\nAftermath and legacy\nin 1951]]\nPresident Truman and Vice President-elect Barkley were inaugurated on January 20,1949the first nationally televised inauguration. In his second term as president, Congress ratified the 22nd Amendment, making a president ineligible for election to a third term or for election to a second full term after serving more than two remaining years of a term of a previously elected president. As Truman was eligible to run in 1952, he contested the New Hampshire primaries, but lost to Senator Estes Kefauver. During the Korean War, his approval rating had dropped to approximately twenty percent. A few days after the New Hampshire primary, Truman formally announced he would not seek a second full term. Truman was eventually able to persuade Adlai Stevenson to run, and the governor gained the nomination at the 1952 Democratic National Convention. Stevenson lost the 1952 presidential election to the Republican nomineeDwight D. Eisenhowerin a landslide.\nTruman's 1948 campaign and the election are most remembered for the failure of polls, which predicted an easy win for Governor Dewey. One reason for the press's inaccurate projection was that polls were conducted primarily by telephone, but many people, including much of Truman's populist base, did not own a telephone. The Gallup Poll had assumed that the final stages of the campaign would have no significant impact on the result. However, post-election surveys concluded that one of every seven voters had made up their mind within the last fortnight of the campaign. The Social Science Research Council report stated: \"the error in predicting the actual vote from expressed intention to vote was undoubtedly an important, although not precisely measurable, part of the over-all error of the forecast.\"\nTruman single-handedly coordinated his campaign, making a direct appeal to farmers, who traditionally voted for the Republican Party. Leverett Saltonstall, a Republican senator from Massachusetts, argued that overconfidence had led the Republicans to \"put on a campaign of generalities rather than interesting the people in what a Republican administration could and would do for them if elected\". The Rowe–Clifford memo was later described by The Washington Post as \"one of this century's most famous political memorandums\". Author Irvin Ross argued that Truman's success in holding together the Roosevelt coalition helped him organize a successful campaign. McCullough noted that when it came to his message, Truman had just one strategy: \"attack, attack, attack, carry the fight to the enemy's camp\". Years later, President Lyndon B. Johnson, who was first elected to the senate in the 1948 election, said:\nThe American people love Harry Truman, not because he gave them hell, but because he gave them hope.\nSee also\n*\n*\nNotes and references\nNotes\nReferences\nWorks cited\nBooks\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n* }}\nJournals and articles\n*\n*\n*\n*\n* }}\n*\n*\n*\n*\n*\n*\n*\n*\n*\n* |access-date=July 4, 2021|archive-date=July 4, 2021|archive-url=https://web.archive.org/web/20210704090418/https://www.trumanlibrary.gov/library/research-files/list-campaign-speeches?documentid=NA&pagenumber=1}}\n* |archive-date=July 4, 2021|archive-url=https://web.archive.org/web/20210704090259/https://www.trumanlibrary.gov/library/research-files/list-board-presidents-special-train-toledo-ohio?documentid=NA&pagenumber=1}}\n* }}\n* }}\nFurther reading\n*\n*\nExternal links\n*\n* [https://www.c-span.org/video/?3389-1/harry-truman-accepts-1948-democratic-presidential-nomination President Harry Truman 1948 Presidential Acceptance Speech](C-SPAN)\n* [https://www.trumanlibrary.gov/library/online-collections/1948-election-campaign 1948 election campaign collection](Harry S. Truman Presidential Library and Museum)\n* [https://www.britishpathe.com/video/the-truman-story/query/The+Truman+Story The Truman Story](British-Pathe)\n* [https://www.c-span.org/video/?464552-1/the-dewey-story The Dewey Story](C-SPAN)\n* [https://www.c-span.org/video/?77800-1/president-truman-inauguration President Truman Inauguration speech](C-SPAN)\n* Harry S. Truman's post-presidential interviews(Screen Gems Collection, Harry S. Truman Presidential Library and Museum (in Public Domain); National Archives Catalog record)\n** [https://www.youtube.com/watch?v=eUU1BowyRRo Former President Truman Discusses 1948 Campaign and Other Presidents in History]\n** [https://www.youtube.com/watch?v=N80nV6-J4WE Former President Truman Recalls His Nomination For President in 1948]\n** [https://www.youtube.com/watch?v=RAuZSt0sd7s Former President Truman Recalls the 1948 Election]"
    }
  ]
}