{
  "content": [
    {
      "type": "text",
      "text": "# Harriet Tubman National Historical Park\n\n| area                  =\n| architect             =\n| architecture          =\n| designated_nrhp_type  = May 30, 1974\n| added                 = May 30, 1974 (original)January 3, 2001 (increase)\n| designated_nrhp_type2 = January 10, 2017\n| website               = [https://www.nps.gov/hart/index.htm Harriet Tubman National Historical Park]\n| refnum                = 74001222 (original)01000073 (increase)\n}}\nHarriet Tubman National Historical Park is a US historical park in Auburn and Fleming, New York. Associated with the life of Harriet Tubman, it has three properties: the Harriet Tubman Home for the Aged, in Auburn; the nearby Harriet Tubman Residence, just across the city/town line in Fleming; and the Thompson A.M.E. Zion Church and parsonage in Auburn. They are located at 180 and 182 South Street and 47–49 Parker Street, respectively. The A.M.E. Zion Church unit is administered by the National Park Service (NPS), and the South Street properties, including a historic barn and a visitor center, are jointly managed and operated by both the NPS and the Harriet Tubman Home, Inc. The church also works with the NPS in park operations. The Harriet Tubman Grave, in nearby Fort Hill Cemetery, is not part of the park.\nThe group of properties also makes up a National Historic Landmark, with the first parcel being declared in 1974 and two others added in 2001.\nTubman was a major conductor on the Underground Railroad and was known as the \"Moses of her people.\" She moved to Auburn with her parents after she had spent eight to ten years in St. Catharines, Ontario. She continued working as a suffragist and worked all her life to care for others who were unable to care for themselves.\nThe Harriet Tubman Home for the Aged is the house in which she fulfilled her dream of opening a home for poor and elderly African Americans. In 1911, she was admitted there herself, and she remained there until her death in 1913.\nThe Harriet Tubman Residence was Tubman's home during much of the time that she lived in Auburn, from 1859 to 1913. The land was sold to her in 1859 by the politician William H. Seward.\nThompson A.M.E. Zion Church is the African Methodist Episcopal Zion Church in which Harriet Tubman attended services. Later in her life, she deeded the Home for the Aged to the church for it to manage after her death.\nHistory of home\nHarriet Tubman Residence\nThompson A.M.E. Zion Church\nIn 1859, Harriet Tubman moved with her parents into a wood-framed home at 180 South Street in Fleming, New York, on the outskirts of Auburn. Tubman purchased the property from Frances Adeline Seward, the wife of abolitionist US Senator William H. Seward. Because Tubman was a fugitive, the Sewards held the mortgage as a private loan and were flexible about payments. The original home burned down in 1880 and was replaced with a new brick home.\nIn 1896, Tubman purchased a 25-acre parcel from a property next door, 182 South Street, for $1,450 (~$}} in ). The land would later become the Home for the Aged.\nIn 1903, she was forced to give it up because she could not afford to pay for it anymore. She donated it to the African Methodist Episcopal Zion Church (AME Zion Church) the same year with an agreement that it would continue to run the Home for the Aged. She was an active member of the AME Zion Church and supported the construction of the Thompson AME Church building as well.\nIn 1908, after working for five years to equip the staff the house become the Harriet Tubman Home for the Elderly in which Harriet Tubman also lived. In 1911, her health would not allow that anymore, and she later became a patient herself until 1913, when she died. The Home for the Elderly continued to function for a couple of more years but then closed. The house became vacant in 1928 and was demolished in 1944 after it had been vacant for nearly 16 years.\nIn 1953, the house was rebuilt and restored in memory of Tubman's life and accomplishments. All of that was organized by the AME Zion Church to which Tubman had given the property to over 50 years earlier. Since 1953, two more buildings have been added to the property from  the transitions of it becoming a historic site, national park, and public attraction.\nThe site received a prestigious Save America's Treasures grant in 2000.\nIn 2017, multiple sites related to Harriet Tubman had been labeled part of the National Historic Park:\n* The Tubman Home for the Aged, 180 South Street Auburn, New York; restored in 1953\n* Harriet Tubman Residence, 182 South Street Auburn, New York\n* AME Zion Church (built 1891), 33 Parker Street Auburn, New York\nNational Historical Parks\nThe park in Auburn was established on January 10, 2017 at a signing ceremony at the US Department of the Interior in Washington, DC. US Secretary of the Interior Sally Jewell was joined by New York lawmakers and local and federal officials in creating the 51st National Historical Park and the 414th US national park system unit. The park will focus on the later years of Tubman's life.\nThe park joins another NPS area in Maryland in interpreting the life of Tubman. Harriet Tubman Underground Railroad National Historical Park includes her birthplace, as well as Underground Railroad routes in three counties of Maryland's Eastern Shore. The sister park in Maryland was established first, on December 19, 2014, and incorporates much of the previously-authorized Harriet Tubman Underground Railroad National Monument, which had been designated in 2013.\nTubman moved to Auburn, New York, after she had spent eight to 10 years in St. Catharines, Ontario, from which she also moved her parents. Tubman's life is commemorated in the Ontario city at Salem Chapel National Historic Site, the church that she frequented, and it is still home to an active congregation. Federal plaques there include one that says she was designated as a National Historic Person.\nSee also\n*List of Underground Railroad sites\n* Harriet Tubman Underground Railroad Scenic Byway (Maryland)\n* Harriet Tubman Underground Railroad Byway (Delaware)\nReferences\nExternal links\n*[https://www.nps.gov/hart/index.htm Official website] at the National Park Service\n*[http://www.nyhistory.com/harriettubman/ Harriet Tubman at NY History]\n*[http://www.nyhistory.com/harriettubman/home.htm Harriet Tubman Home] - visiting information\n*[http://www.cr.nps.gov/nr/travel/underground/ny1.htm Aboard the Underground Railroad: Harriet Tubman Home for the Aged, Harriet Tubman Residence, and Thompson AME Zion Church, at National Park Service]\n*[https://web.archive.org/web/20070625073225/http://www.nps.gov/history/nr/travel/pwwmh/ny13.htm Places Where Women Made History: Harriet Tubman Home for the Aged, at National Park Service]"
    }
  ]
}