{
  "content": [
    {
      "type": "text",
      "text": "# Harry Schwartz (politician)\n\n|birth_place  = Fort Recovery, Ohio, U.S.\n|spouse       = Eliza Bowie Mathews (1891–1978)\n|death_date   =\n|death_place  = Casper, Wyoming, U.S.\n|party        = Democratic\n}}\nHenry Herman Schwartz (May 18, 1869April 24, 1955), known as Harry or H. H. Schwartz, was an American politician who served as a U.S. senator from Wyoming. He was a member of the Democratic Party.\nEarly life and education\nSchwartz was born on a farm near Fort Recovery, Ohio, and was educated in the public schools of Mercer County and Cincinnati, Ohio. Schwartz engaged in the newspaper business at Fort Recovery from 1892 to 1894 and at Sioux Falls, South Dakota, from 1894 to 1896. Schwartz studied law, was admitted to the bar in 1895, and commenced practice in Sioux Falls.\nPolitical career\nSchwartz's political career started in the South Dakota House of Representatives, serving from 1897 to 1899, where he was elected on the Fusion ticket. He served as chief of the field division of the United States General Land Office at Spokane, Washington, and Helena, Montana, from 1897 to 1907. Schwartz was special assistant to the Attorney General in 1907; and chief of field service, General Land Office in Washington, D.C., from 1907 to 1910.\nIn 1915, Schwartz moved to Casper, Wyoming, with wife Eliza Bowie Mathews. He served as president of the Casper Board of Education and the Natrona County High School Board from 1928 to 1934. Schwartz was an unsuccessful candidate for election to the United States Senate in 1930. He served as a member of the Wyoming state Senate from 1933 to 1935.\nU.S. Senate\nSchwartz was elected as a Democrat to the U.S. Senate in 1936 and served from January 3, 1937 to January 3, 1943. He was an unsuccessful candidate for reelection in 1942.\nDuring his term as a U.S. Senator, Harry Schwartz played a key role in opening the door to black military pilots in World War II. In 1939, Public Law 18 appropriated funds to expand pilot training, and Schwartz was able to add an amendment to required some aviation equipment be loaned to schools for the training of black military pilots. When the War Department and the Army Air Corps (AAC) did not follow through on this amendment, Schwartz made visits to General Henry H. Arnold and others to demand that black pilots be trained.\nDuring his term, Schwartz was chairman of the Committee on Pensions (Seventy-seventh Congress). He was appointed by President Franklin D. Roosevelt to the National Mediation Board, serving from 1943 to 1947.\nLife after politics\nHe resumed the practice of law in Casper, Wyoming, until his death there on April 24, 1955. He was interred in Highland Cemetery.\nNotes\nExternal links\n*\n*[https://archive.org/details/in.ernet.dli.2015.204659 Official Congressional Directory entry for Wyoming Senator H.H. (Harry) Schwartz]\n*[http://legis.state.sd.us/historical/Index.aspx?FuseAction=Detail&MemberID=3033 Henry Schwartz's record in the South Dakota State Legislature's Historical Listing]\n*Cooper, Charlie, Ann Cooper, and Roy La Grone. Tuskegee's heroes: featuring the aviation art of Roy LaGrone. NY, NY: Crestline, 2015.\n*"
    }
  ]
}