{
  "content": [
    {
      "type": "text",
      "text": "# Harringay Warehouse District\n\nThe Harringay Warehouse District is a part of the North London neighbourhood of Harringay in the London Borough of Haringey.\nLocation\nThe Harringay Warehouse District forms the south eastern part of the Harringay neighbourhood. Its southern border is formed by the  New River and its northern boundary by the Gospel Oak to Barking Line. Its western and eastern boundaries are roughly defined by a line drawn between the railway and the New River along the eastern end of Sainsbury's  and by the Seven Sisters Road.\nCharacter\nAlthough little industry now remains, as the name suggests, the district was developed from Harringay's former industrial area. Except for those few that are used for purely commercial purposes, most of the remaining industrial buildings have become home to a growing number of live-work spaces. Inhabited by a largely creative community, until recently the development of the area was in the main undertaken without official sanction. Recently however, the residents have engaged with the local council. As a result, the area and its development as a mixed live-work zone is now part of the recently published Haringey Council Site Allocations Plan.\nHistory\nThe Harringay Warehouse District developed in the early years of the twentieth century. It became one of the main centres of employment of the former Municipal Borough of Tottenham. Some of the main industries were:\n*Piano manufacture – Harringay was one of the UK's main centres of piano manufacture and was home to household names such as Challen, Boyd, Barrett & Robinson and Eavestaff.\n*Confectionery including the main manufacturing centre for Maynards\n*Furniture making and shop-fitting, including HK Furniture, George Hammer & Co, and Courtney Pope.\nOther industries included the manufacture of paper tableware, flexible tubing for use in engineering, printing ink, industrial thermometers, radio valves and cathode ray tubes, industrial saws, shaving brushes, rafia, early photographic slides, electrical components and shoes.\nBy the 1980s most of the bigger employers had moved out of the area, to be replaced by small-scale garment manufacture and other light industry. In the following decade, creative industries began to get a foothold and companies including Rough Trade Records moved in.\nTransport\nReferences and notes\nExternal links\n*[https://harringayonline.com/group/historyofharringay/forum/topics/a-short-history-of-harringay-s-manufacturing-area A short history of Harringay's manufacturing area]\n*[https://www.google.co.uk/maps/place/Harringay+Warehouse+District,+London/@51.5764194,-0.0889903,17z/data=!3m1!4b1!4m2!3m1!1s0x48761c74f2815a3b:0xcea7e70c1e869918 Harringay Warehouse District on Google Maps]\n*[http://www.harringayonline.com/forum/topic/listForTag?tag=warehouse+district Numerous articles about events and issues in the Harringay Warehouse District] on local website Harringay Online\n*[http://www.eastendreview.co.uk/2015/06/19/harringay-warehouse-district/ 'What is the future for Harringay’s warehouse district?', East End Review June 2015]\n*[http://www.newriverstudios.com New River Studios]\n*[http://inhousefestival.uk inHouse Film Festival]"
    }
  ]
}