{
  "content": [
    {
      "type": "text",
      "text": "# Harry Edward Vickers\n\n|birth_place          = Reading, Berkshire, England\n|death_date           =\n|parents              =\n|children             =\n|occupation           = Butcher, rifleman and burglar\n}}\nHarry Edward Vickers (3 September 1888 – 9 December 1942) was a cat-burglar who was active in the 1920s and 1930s. He wore flannel over his shoes to muffle his footsteps, which earned him the nickname Flannelfoot.\nHis ability to avoid detection and capture by the Metropolitan Police was the subject of media sensation. Whilst the police knew his identity, they lacked evidence to arrest him. He was sentenced in December 1937 to five years penal servitude for housebreaking.\nVickers used rags or cloth taken from the houses he burgled to muffle his footsteps. He stole and discarded a bicycle as part of his getaway. Upon finding these items, police were able to attribute the crime to Vickers with confidence. Vickers also opened windows by drilling a single hole close to the latch.\nMilitary service\nVickers served as a rifleman in the Rifle Brigade from July 1916 to July 1918 on active service in France and Flanders. That service was ended by a serious leg injury and was awarded the Silver War Badge, Victory Medal and British War Medal.\nCriminal history\nEarly crimes\n* September 1921: Vickers broke into the house of a prominent local singer at Hounslow.\n* March 1922: Vickers raided houses in Aylett Road, Isleworth. He took money from gas meters and a handbag, but left a child's money box unopened despite moving it.\n* November 1922: Break-ins at Isleworth in South-Western Terrace were reported, where gas meters were robbed, and attributed to Vickers.\n* October 1923: Vickers was attributed to several burglaries in the Harrow district. Entry was gained in most cases by drilling a hole in a scullery or kitchen window frame to insert a wire and lift the latch.\n* November 1923: Burglaries on one night in Carlton Avenue, Kenton, were attributed to Vickers. Small articles and loose money were taken and a hearty meal made in one of the houses.\n* May 1927: Eight burglaries at Kenton Park Crescent were believed to be committed by Vickers.\nIdentification by Scotland Yard\nIn May 1934, Scotland Yard had circulated a girl's picture in the hunt for Flannelfoot. She was the 13-year-old daughter of a Reading butcher named Henry Williams, also known as Harry Edward Vickers.\nCapture and sentencing\nIn December 1937, Vickers was arrested and tried at the Middlesex Sessions.\nFlannel Foot film\n* Flannelfoot\nReferences\nFurther reading\n* Great Cases of Scotland Yard\n* Horwell of the Yard\n* ''Britain's Most Prolific Burglar: Flannelfoot & the Scotland Yard Men Who Hunted Him'' by Martyn Beardsley\nReferences"
    }
  ]
}