{
  "content": [
    {
      "type": "text",
      "text": "# Harry Pilkington\n\n| birth_place   = St Helens, Lancashire, England\n| death_date    =\n| death_place   = St Helens, Lancashire, England\n| height        =\n| othername     =\n| years_active  = 1934–1973\n| spouse        =\n*\n}}\n| children      = 3\n| homepage      =\n| honours       = Knighted 1953; Life Peer 1968\n| family = Margaret Pilkington (sister) Roger Pilkington (brother)Herbert Cozens-Hardy, 1st Baron Cozens-Hardy (grandfather)Margaret Pilkington (second cousin)\n| relatives = Charles Pilkington and\nRichard Pilkington  (great-uncles)\n}}\nWilliam Henry Pilkington, Baron Pilkington (29 April 1905 – 23 December 1983) was an English glass manufacturer and president of the Federation of British Industries. He is remembered politically as chairman of the Pilkington Committee that produced the controversial Pilkington Report of 1962.  He was also Chancellor of Loughborough University from 1966 to 1980.\nEarly life and education\nPilkington was born in St Helens, Lancashire, the eldest son of Richard Austin Pilkington (1871-1951), JP, of Eccleston Grange, St Helens, a director of the family glass-manufacturing business, Pilkington Brothers Ltd, and his wife, Hope (1876-1947), daughter of the politician and judge Herbert Cozens-Hardy, 1st Baron Cozens-Hardy.\nHis younger brother, Lawrence, would join him as a director of the family business; the third brother was the biologist and writer Roger Pilkington. His sister Margaret was a Girl Guide leader, awarded an MBE and a Silver Fish Award for her work with the Guide International Service.\nThe Pilkington family was Congregationalist. He was educated at Rugby School and Magdalene College, Cambridge.\nPilkington Brothers Ltd\nPilkington joined the board of the family business, Pilkington Brothers Ltd, in 1934 and served as chairman from 1949 to 1973. This glass manufacturing company became the lone survivor of twenty-four British glass manufacturers from the 19th century. While other companies died from competition, the Pilkington company advanced its techniques, especially in safety glass and glass sheets, using the company's proprietary float glass process. In 1967 the company controlled 85% of the glass-making business in the United Kingdom and exported its products to over 100 countries.\nPilkington Report\nThe Pilkington Report concluded that the British public were not being well-served by commercial television due to what it regarded as its American-influenced programming (such as westerns). It further concluded that although the British public had not been explicitly asked whether they wanted commercial radio, there was no evidence to support the contention that they wanted it. The unintended result of this conclusion was the creation of offshore commercial pirate radio in 1964. It also commended the BBC for the high quality of its television programming and recommended that the franchise for the-then third television channel should be granted to the BBC (which opened as BBC 2 in 1964), rather than to a commercial operator.\nPersonal life\nIn 1930, Pilkington married Rosamond Margaret, daughter of Royal Army Medical Corps Colonel Henry Davis Rowan of Rathmore, Greystones, County Wicklow, Ireland. Rosamond died in 1953, having had with her husband a son and two daughters. He subsequently married Mavis Joy Doreen, daughter of master reed-maker Gilbert Caffrey of Woodleigh, Lostock Park, Bolton, and former wife of Dr John Hesketh Wilding.\nPilkington was known for his 'warm-hearted personality'; when a young couple moved in nearby, they decided to grow roses but lacked the experience in pruning. The wife was acquainted with Pilkington's gardener at Windle Hall, and made a phone call; the then-Lady Pilkington answered, telling her 'I'll pass the message on, but Harry prunes all ours'- within the hour, Pilkington arrived at the couple's house by bicycle, equipped with pruning shears.\nEven as a Governor of the Bank of England, Pilkington cycled around London, 'to the delight and consternation of those who knew him.'\nArms\n|escutcheon = Argent a cross flory Gules voided of the field between five roses in saltire of the second barbed and seeded Proper.\n|crest = Upon a mount and between two tufts of grass Vert a mower habited per pale Argent and Gules holding up a scythe Proper.\n|motto = Now Thus Now Thus.\n}}\nHonours\nKnighted in the 1953 New Years Honours List, Pilkington was created a Life Peer on 18 January 1968 in the 1968 New Years Honours List, taking the title Baron Pilkington, of St Helens in the County Palatine of Lancaster. He was awarded the honorary degree of Doctor of Science (D.Sc) by Loughborough University in 1966.\nReferences\nExternal links\n*[http://www.npg.org.uk/collections/search/person.php?LinkID=mp71743 National Portrait Gallery, London] – Sir Harry sat for six portraits\n*[https://web.archive.org/web/20081215133442/http://www.time.com/time/magazine/article/0,9171,837625,00.html \"Pilkington Shines Again\"]. Time. 15 December 1967.\n*[http://www.newyorker.com/archive/1962/07/14/1962_07_14_067_TNY_CARDS_000273769 New Yorker magazine commenting upon the Pilkington Report], July 1962.\n*[https://speeches.empireclub.org/59921/data?n=1 Speech by Sir Harry to the Empire Club of Canada] - 1 December 1955, Toronto, Canada."
    }
  ]
}