{
  "content": [
    {
      "type": "text",
      "text": "# Hartley Dewart\n\n| birth_place       = St. Johns, Canada East\n| death_date        =\n| death_place       = Uxbridge\n| residence         =\n| occupation        = Lawyer\n| spouse            =\n}}\nHerbert Hartley Dewart QC (9 November 1861 &ndash; 7 July 1924) was an Ontario lawyer and politician.\nEarly life and education\nDewart was born in St. Johns, Canada East, on 9 November 1861. His father was Edward Hartley Dewart, an Irish Methodist minister who was a preacher in St. Johns. His mother was Dorothy Matilda Hunt. In 1865 Dewart and his family moved to Toronto. He attended Toronto's model school and collegiate institute. He studied at the University of Toronto, graduating with a Bachelor of Arts in 1883, and Osgoode Hall, being called to the Ontario bar in 1887. He co-founded the Young Men's Liberal Club and was its president from 1887 to 1888.\nEarly career\nDewart set up practice in Toronto and served as crown attorney for York County from 1891 to 1904. In 1895, he replaced Britton Bath Osler as the prosecutor for the murder trial of Clara Ford after Osler's wife died. The trial was a media sensation and Dewart's oratory skills trial impressed members of the press and fellow lawyers. Even though Ford confessed to the crime, Dewart lost the case when the jury decided to acquit. He was appointed as a Queen's Counsel in 1899 and continued his work as a public prosecutor until his resignation in 1904.\nDewart next worked as a lawyer in private practice, working both civil and criminal cases. He was also the solicitor for several corporations such as the Canadian Pacific Railway. In 1906, he was elected to the University of Toronto's senate and was an examiner in English. In 1911 he was elected as a bencher to the Law Society of Ontario.\nPolitical career\nDewart's first election was in 1904 as a Liberal candidate for the Toronto South constituency during the federal election, but he was defeated. In 1911 he failed in his second attempt to be elected to the Canadian parliament, this time for the constituency of York Centre.\nHe was first elected to the provincial legislature in a 1916 by-election after the death of James Joseph Foy in the Toronto Southwest electoral district, becoming the first Liberal to win a Toronto seat in a quarter-century. As a politician he stated his opposition to prohibition and publicly spoke against the Liberal party's temperance policies, to the chagrin of the leader of the Liberal party, Newton Wesley Rowell. He was also against conscription, stating that it was unconstitutional.\nIn June 1919, he became leader of the Ontario Liberal Party. During his time as leader, the Liberal Party was divided over the question of prohibition and the conflict between the interests of rural and urban voters. In the 1919 Ontario general election, Dewart campaigned by attacking the Ontario Conservative Party campaign manager Howard Ferguson. However, rural voters supported the United Farmers of Ontario Party, causing the United Farmers to win the election. In the subsequent legislature, Dewart criticised the United Farmer government, causing more discontent among rural Ontarians. He resigned as leader of the Liberal party in 1921, citing poor health.\nDewart continued sitting as a legislator. He opposed a bill that would tax racetrack bets, dramatically asking the lieutenant governor before the bill received royal assent if the bill was constitutional. He was defeated in the 1923 Ontario general election.\nLater career and death\nAfter his election loss, he returned to private practice and was appointed to a commission that was to consolidate Canadian statutes. He died at his home near Uxbridge in 1924; the cause of death outlined in his obituaries was overwork. He was buried in Toronto Necropolis.\nReferences\nExternal links\n*"
    }
  ]
}