{
  "content": [
    {
      "type": "text",
      "text": "# Hartwell, Buckinghamshire\n\n| unitary_england = Buckinghamshire\n| lieutenancy_england = Buckinghamshire\n| post_town = Aylesbury\n| postcode_area = HP\n| postcode_district = HP17\n| hide_services = Yes\n| population =\n| population_ref =\n| static_image_name = Hartwell church, Buckinghamshire.JPG\n| static_image_caption =St Mary's Church, Hartwell\n}}\nHartwell is a village in the parish of Stone with Bishopstone and Hartwell, in central Buckinghamshire, England. It is to the south of Aylesbury, by the village of Stone.\nThe village name is Anglo Saxon in origin, and means \"spring frequented by deer\". In the Domesday Book of 1086 it was recorded as Herdewelle.\nHartwell was an ancient parish. In 1986 the parish merged with the neighbouring parish of Stone to form a new civil parish called Stone with Bishopstone and Hartwell. At the 1971 census (the penultimate one before the abolition of the parish), Hartwell had a population of 102.\nThe ruined Hartwell Church was designed by the architect Henry Keene and completed in 1756. It is one of the most important early Gothic Revival churches in England and is Grade II* listed. It has an octagonal centre with twin towers. In the north and south bays are rose windows, while other windows are represented as ogee arches. In the clerestory are quatrefoil windows. Inside, the church once had a plaster fan vault but this has now fallen in, and the church's windows are boarded.  Today the building appears more as a garden folly, than a former place of worship.\nAttached to the estate is the former hamlet of Lower Hartwell.\nHartwell House\nHartwell House in the village is a grade I listed building in a 90-acre park, part of the Hartwell Estate owned by the Ernest Cook Trust. The house was once the residence of the exiled future king of France Louis XVIII. Since 2008 it has been leased to The National Trust and is run as a hotel by an independent company, Historic House Hotels Ltd.\nBugle Quarry\nBugle Quarry is a geological Site of Special Scientific Interest, which has yielded important fossils from the Jurassic and Cretaceous, including dinosaur teeth.\nGreyhound track\nA greyhound racing track called the Aylesbury and District Greyhound Racing Track, was opened on Saturday 24 June 1933. The racing was independent (not affiliated to the sports governing body the National Greyhound Racing Club) known as a flapping track, which was the nickname given to independent tracks. The venue was owned by Ivor Richings, the landlord of the Bugle Horn and Mr Dutch from Watford. It consisted of a grandstand with totalisator and refreshment bars and racing was held three times a week. The track closed in 1942 when it was used to house Italian prisoners of war captured in North Africa.\nReferences\nExternal links\n*[http://ernestcooktrust.org.uk/the-trusts-estates/buckinghamshire/the-hartwell-estate-and-fairford-leys/ Hartwell and the Ernest Cook Trust]\n*[http://www.hartwell-house.com/ Hartwell House]\n*William Henry Smyth, [https://archive.org/details/deshartwelliano00smytgoog Ædes Hartwellianæ: Or, Notices of the Manor and Mansion of Hartwell] (1851)\n*William Henry Smyth, [https://archive.org/details/addendatodeshar00smytgoog Addenda to the Ædes Hartwellianæ] (1864)"
    }
  ]
}