{
  "content": [
    {
      "type": "text",
      "text": "# Harvey Warren Zorbaugh\n\nHarvey Warren Zorbaugh (September 20, 1896 – January 21, 1965) was Professor of Educational Sociology, at New York University. he was born in East Cleveland, Ohio and educated in sociology at the University of Chicago. He married Geraldine Elizabeth Bone on September 7, 1929, and they had two children: a son, Harvey Jr., and a daughter, Harriet. His classic text, first published in 1929, was The Gold Coast and the Slum, a book based on his PhD thesis completed under the direction of Robert E. Park at the University of Chicago.\nIn the late 1940s, Dr. Zorbaugh also hosted one of the first game shows on American TV. Titled Play the Game, the show aired from September 24, 1946 to December 17, 1946 (DuMont, primetime) and from August 20, 1948 to November 6, 1948 (ABC, primetime).\nAlso during the 1940s, he published some sociological comments about the comic book craze then prevalent among young Americans.\n:\"It is time the amazing cultural phenomenon of the growth of the comics is subjected to dispassionate scrutiny. Somewhere between vituperation and complacency must be found a road to the understanding and use of this great new medium of communication and social influence. For the comics are here to stay.\"\nZorbaugh's primary interest in urban sociology concerned the causes and effects of social and geographical segregation within the city and the issues created by the tensions between the need for social and community cohesion and those boundaries that inevitably emerge between different social groups rooted in geography, race and economic status. Consequently, he was interested in the fluid changes in city life and how any boundaries we see are always transient, unstable and changing. He spent the bulk of his career on the faculty of New York University becoming a leading specialist in the social adjustment of gifted children. He worked with clinics, committees and other public services around the problems of children and was an outspoken opponent of racial prejudice in public schools.\nPublications\n*1926: The Natural Areas of the City\n*1929: ''The Gold Coast and the Slum: A Sociological Study of Chicago's Near North Side, Chicago: The University of Chicago Press\n*1951: Steel! edited by Harvey Zorbaugh; story by Frank Kolars; produced by Johnstone and Cushing. Information Rack Service, General Motors Personnel Staff, 1951, 16pp: col. ill; Caption title: Jimmy gets his story.\n*1956: Steel! edited by Harvey Zorbaugh; story by Frank Kolars. 2nd revision. New York: American Iron and Steel Institute, 1956. 16 pp.: col. ill. Caption title: Jimmy Gets His Story. Educational giveaway comic book on the steel industry.\n*1960: The Empire State Audio tape of educational television program presented by the Board of Education - Garden City, New York, February 24, 1960. Thoreau Society, Lincoln, Mass\nPapers and articles\n* The Dweller in Furnished Rooms: an Urban Type, Papers and Proceedings of the American Sociological Association, 1925\n* The Urban Community, 1926, Chicago University Press\n* Topical Summaries of Current Literature, Educational Sociology, American Journal of Sociology, 1927 - University of Chicago Press\n* Research in Educational Sociology, Journal of Educational Sociology, 1927\n* Educational Sociology, American Journal of Sociology, 1927\n* Personality and Social Adjustment, Journal of Educational Sociology, 1928\n* Mental Hygiene's Challenge to Education, Journal of Educational Sociology, 1932\n* Adolescence: Psychosis or Social Adjustment? Journal of Educational Sociology, 1935\n*1935: Sex Education, The Journal of Educational Sociology: February 1935, New York: The Journal of Educational Sociology\n* Salvaging Our Gifted Children, Journal of Educational Sociology, 1936\n* Sociology in the Clinic, Journal of Educational Sociology, 1939\n* The Comics as an Educational Medium, 1944 - The Payne Educational Sociology\n* with Mildred Gilman, What Can YOU do about Comic Books? Journal of Education, 12, 1944, pp.&nbsp;14–15\n* The Comics—There They Stand! Journal of Educational Sociology, Vol. 18, Nr. 4 (December 1944), pp.&nbsp;196–203\n* Are You Throttling a Future President? The American Magazine, Dec 1945\n* What Can You do about Comic Books? Family Circle, Feb 1949, pp.&nbsp;61–63\n* What adults think of comics as reading for children. Journal of Educational Sociology, Vol. 23, No. 4, (Dec., 1949), pp.&nbsp;225–235\n* Some Observations of Highly Gifted Children, with RK Boardman in The Gifted Child, (Edited by Paul A. Witty.), 1951\n* Television–Technological Revolution in Education, Journal of Educational Sociology, 1958\n* Closed-circuit Television as a Medium of Instruction at New York University, 1956-1957: A Report on New York University's Second Year of Experimentation,'' HL Klapper, TC Pollock, HW Zorbaugh, New York The University, 1958\nSee also\n* Chicago school (sociology)\n* Comics\n* Intellectual giftedness\nReferences"
    }
  ]
}