{
  "content": [
    {
      "type": "text",
      "text": "# Hasan–Mu'awiya treaty\n\nThe '''Hasan–Mu'awiya treaty''' was a political peace treaty signed in 661 between Hasan ibn Ali and Mu'awiya I () to bring the First Fitna (656–661) to a close. Under this treaty, Hasan ceded the caliphate to Mu'awiya on the condition that the latter should rule in compliance with the Quran and the , a council should appoint his successor, and Hasan's supporters would receive amnesty. Upon accession, Mu'awiya publicly recanted his earlier promises, while Hasan retired from politics in Medina. Throughout his reign, Mu'awiya also prosecuted notable partisans of Hasan and his father Ali.\nHistorical background\nAfter Ali's assassination in 661, his eldest son Hasan was acknowledged caliph in Kufa. Having been at war with Ali, Syria's governor Mu'awiya () did not recognize the caliphate of Hasan, and led an army into Kufa, while pressing Hasan for abdication in his letters. In response, Hasan sent a vanguard under Ubayd Allah ibn al-Abbas to Maskin to block Mu'awiya's advance until he arrived with the main army. Meanwhile, Hasan faced a mutiny in his camp, likely ignited by Mu'awiya's spies, and was severely wounded in a failed assassination attempt by the Kharijites, a faction opposed to both Ali and Mu'awiya. This attack demoralized Hasan's army and led to widespread desertions. Ubayd Allah and most of his troops also defected after Mu'awiya bribed him. When Hasan learned about this, he reproached the Iraqi nobles for their fickle-mindedness.\nPeace treaty\nMu'awiya now sent envoys to propose that Hasan abdicate in his favor to spare Muslim blood. In return, Mu'awiya was ready to designate Hasan as his successor, grant him safety, and offer him a large financial settlement. Hasan accepted the overture in principle and sent his representative(s) to Mu'awiya in Maskin, who sent them back to Hasan with carte blanche, inviting him to dictate whatever he wanted. Hasan wrote that he would surrender the Muslim rule to Mu'awiya if he would comply with the Quran and , his successor would be appointed by a council (shura), the people would remain safe, and Hasan's supporters would receive amnesty. His letter was witnessed by two representatives, who carried it to Mu'awiya. Hasan thus renounced the caliphate in August 661 after a seven-month reign. Some have criticized Hasan for ceding the caliphate, while others maintain that his abdication was inevitable, given the Kufans' weak support and Mu'awiya's military superiority. They suggest that Hasan was motivated by the desire for unity and peace among Muslims, and that he was averse to bloodshed and bellicose politics.\nTerms of the treaty\nVeccia Vaglieri () finds certain variants of the treaty impossible to reconcile. She lists several conditions in the early sources and questions their veracity, including an annual payment of one or two million dirhams to Hasan, a single payment of five million dirhams from the treasury of Kufa, annual revenues from variously-named districts in Persia, succession of Hasan to Mu'awiya or a council () after Mu'awiya, and preference for the Banu Hashim over the Banu Umayyad in pensions. Another condition might have been that Mu'awiya should end the ritual cursing of Ali in mosques, writes Mavani.\nJafri () similarly notes that the terms are recorded differently and ambiguously by al-Tabari (), Dinawari (), Ibn Abd al-Barr, and Ibn al-Athir, while al-Ya'qubi () and al-Mas'udi () are silent about them. In particular, Jafri finds the timing of Mu'awiya's carte blanche problematic in al-Tabari's account. Al-Tabari also mentions a single payment of five million dirhams to Hasan from the treasury of Kufa, which Jafri rejects because the treasury of Kufa was already in Hasan's possession at the time. Ali is also said to have regularly emptied the treasury and distributed the funds among the public. Jafri then argues that the most comprehensive account is the one given by Ahmad ibn A'tham, probably taken from al-Mada'ini (), who recorded the terms in two parts. The first part is the conditions proposed by Abd Allah ibn Nawfal, who negotiated on Hasan's behalf with Mu'awiya in Maskin.}} The second part is what Hasan stipulated in carte blanche. of the Prophet, and the conduct of the righteous caliphs, 2) that Mu'awiya would not appoint or nominate anyone to the caliphate after him, but the choice would be left to a , 3) that the people would be left in peace wherever they are in the land of God, 4) that the companions and the followers of Ali, their lives, properties, their women and their children, would be guaranteed safe conduct and peace, 5) that no harm or dangerous act, secretly or openly, would be done to Hasan, his brother, Husayn, or to anyone from the family of Muhammad.}} These two sets of conditions together encompass all the conditions scattered in the early sources.\nJafri thus concludes that Hasan's final conditions in carte blanche were that Mu'awiya should act according to the Quran, , and the conduct of the Rashidun caliphs, that the people should remain safe, and that the successor to Mu'awiya should be appointed by a council. These conditions are echoed by Madelung, who adds that Hasan made no financial stipulations in his peace proposal and Mu'awiya consequently made no payments to him, contrary to the \"Umayyad propaganda\" reflected in the account of the Umayyad-era al-Zuhri (), quoted by al-Tabari. The account of al-Zuhri depicts a greedy Hasan eager to renounce his caliphate for money and was likely distributed by the Umayyads to legitimize Mu'awiya's rule in the absence of a council () or election or designation (), suggests Jafri. Since Ali and his house rejected the conduct of Abu Bakr () and Umar () in the  after Umar in 23/644, Jafri believes that the clause about following the Rashidun caliphs was inserted by later Sunni authors. That Mu'awiya agreed to an amnesty for the supporters of Ali indicates that the revenge for Uthman was a pretext for him to seize the caliphate, according to Jafri.\nNarrations\nThe following is a compilation of various early historical reports about the content of the peace treaty between Hasan and Muawiya:\n# Muawiya should act according to the Book of God, the Sunna of Muhammad, and the behavior of the righteous caliphs.\n# The authority should return to Hasan after Muawiya, and if an accident occurs, the authority should go to Husayn. Muawiya has no right to entrust his authority to anyone else.\n# Muawiya should abandon the practice of cursing Ali, including in the qunut of prayers. Muawiya should not mention Ali unless in a good manner.\n# Muawiya should exclude what is in the treasury of Kufa, that is five million (dirhams). So handing over authority does not include it (i.e., this sum of money). Muawiya should send al-Husayn one million dirhams a year, he should prefer the children of Hashim (Banu Hashim) in giving and gifts to the Banu Abd Shams, and should divide one million (dirhams) among the sons of those who were killed with the Commander of the Faithful at the Battle of the Camel and the Battle of Siffin, and should spend that from the taxes of Dar Abjard.\n# The people should be safe wherever they are. The companions of Ali should be given security wherever they are. Muawiya should not seek to wrong Hasan, Husayn, or anyone from Muhammad's household, secretly or openly.\nFate of the treaty\nIn the surrender ceremony, Mu'awiya publicly recanted his earlier promises to Hasan and others, saying that those promises were made to shorten the war. Hasan then left Kufa for Medina but soon received a request from Mu'awiya to subdue a Kharijite revolt near Kufa. He wrote back to Mu'awiya that he had given up his claim to the caliphate for the sake of peace and compromise, not to fight on his side. Madelung suggests that the relations between the two men deteriorated when Mu'awiya realized that Hasan would not actively support his regime.\nAfter his abdication, Hasan retired from politics in Medina. In compliance with the peace treaty, he also declined requests from Shia groups to lead them against Mu'awiya. The Sunni al-Baladhuri () in his Ansab writes that Hasan sent tax collectors to the Fasa and Darabjird provinces of Iran in accordance with the peace treaty but the governor of Basra, instructed by Mu'awiya, incited the people against Hasan and his tax collectors were driven out of the two provinces. Madelung regards this account as fictitious, adding that Hasan had just refused to join Mu'awiya in fighting the Kharijites. He holds that Hasan had made no financial stipulations in his peace proposal and Mu'awiya consequently made no payments to him.\nHasan died in 50/670, and the early sources are nearly unanimous that he was poisoned. Mu'awiya is commonly viewed as the instigator in the murder of Hasan, which removed an obstacle to the succession of his son Yazid (), whose nomination violated the treaty with Hasan. Throughout his reign, Mu'awiya also prosecuted notable partisans of Ali, including Hujr ibn Adi, a companion of Muhammad, who was executed in 670. Mu'awiya also institutionalized the regular public cursing of Ali in the congregational prayers.\nSee also\n* Hasan ibn Ali\n* Muawiya I\nFootnotes\nReferences\nCitations\nSources\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*"
    }
  ]
}