{
  "content": [
    {
      "type": "text",
      "text": "# Hat On, Drinking Wine\n\nHat On, Drinking Wine is an American rock band from Worcester, Massachusetts featuring guitars, piano, bass, drums, as well as occasional folk and traditional instruments, such as the accordion, tin whistle, harmonica, and mandolin.  The band's first CD, bearing the same name as the band, was released on May 19, 2009, to favorable reviews from regional media, including Worcester Magazine and the Worcester Telegram and Gazette, which praised the group for their \"conversational, confessional lyrics, the intimate, bare-bones vocals\" and \"the homespun and hands-on arrangements\". Their sound blends conventional rock music with styles and instruments from other musical traditions, including blues, folk, traditional Irish music, and reggae.\nThe band was formed in the fall of 2006.  It features Jarrett Conner on drums; Jared Forgues on bass guitar and mandolin; Jim Lang on piano, accordion, and tin whistle; Matt Robert on electric and acoustic guitars and harmonica; Ed Whalen on acoustic guitar and piano.  Robert and Whalen share lead vocal duties.  Lang, Robert, and Whalen all write songs for the band, sometimes individually and sometimes in collaboration.  The band's live shows are marked by members frequently swapping lead vocals, harmony vocals, and instruments, as well as extended passages of lyrical improvisation.\nThe band's unusual name was taken from lyrics from the song \"Madame George\" by Van Morrison.  They cite Van Morrison and Bob Dylan as influences, as well as ensemble groups such as The Band, Wilco, The Jayhawks, and the Pogues.\nTwo of the band's members are also writers.  Matt Robert wrote reviews of music, food (under the pseudonym Matt Quinn), and culture for Worcester Magazine from 2004–2008, and continues to freelance.  Jim Lang is the author of three books, the most recent of which was On Course: A Week-by-Week Guide to Your First Semester of College Teaching (Harvard University Press, 2008). He is also an English professor at Assumption College\nExternal links\n* [https://web.archive.org/web/20090403204352/http://www.hatondrinkingwine.com/ Hat On, Drinking Wine Official Website]\n* [http://www.myspace.com/hatondrinking Hat On, Drinking Wine MySpace Page]\n* [http://www.jamesmlang.com Jim Lang's Author Page]\nNotes"
    }
  ]
}