{
  "content": [
    {
      "type": "text",
      "text": "# Hawaiian–Emperor seamount chain\n\n|coordinates_note       =\n|length_km              = 6200\n|width_km               =\n|area_km2               =\n|length_orientation     = NE-SW\n|width_orientation      =\n|length_note            =\n|width_note             =\n|area_note              =\n|range_coordinates      =\n|range_coordinates_note =\n|geology                =\n|period                 =\n|orogeny                = Hawaii hotspot\n|map_image              = Hawaii hotspot.jpg\n|map_caption            = Elevation of the Pacific seafloor, showing the Hawaiian-Emperor seamount chain stretching northwest from the Hawaiian Islands\n}}\nThe Hawaiian–Emperor seamount chain is a mostly undersea mountain range in the Pacific Ocean that reaches above sea level in Hawaii. It is composed of the Hawaiian ridge, consisting of the islands of the Hawaiian chain northwest to Kure Atoll, and the Emperor Seamounts: together they form a vast underwater mountain region of islands and intervening seamounts, atolls, shallows, banks and reefs along a line trending southeast to northwest beneath the northern Pacific Ocean. The seamount chain, containing over 80 identified undersea volcanoes, stretches about  from near the Aleutian Trench off the coast of the Kamchatka peninsula in the far northwest Pacific to the Kamaʻehuakanaloa Seamount (formerly Lōʻihi), the youngest volcano in the chain, which lies about  southeast of the Island of Hawaiʻi.\nRegions\nThe chain can be divided into three subsections. The first, the Hawaiian archipelago (also known as the Windward isles), consists of the islands comprising the U.S. state of Hawaii. As it is the closest to the hotspot, this volcanically active region is the youngest part of the chain, with ages ranging from 400,000 years to 5.1&nbsp;million years. The island of Hawaii is composed of five volcanoes, of which four (Kilauea, Mauna Loa, Hualalai, and Mauna Kea) are active. The island of Maui has one active volcano, Haleakalā. Kamaʻehuakanaloa Seamount continues to grow offshore of Hawaii island, and is the only known volcano in the chain in the submarine pre-shield stage.\nThe second part of the chain is composed of the Northwestern Hawaiian Islands, collectively referred to as the Leeward isles, the constituents of which are between 7.2 and 27.7&nbsp;million years old. Erosion has long since overtaken volcanic activity at these islands, and most of them are atolls, atoll islands, and extinct islands. They contain many of the most northerly atolls in the world; Kure Atoll, in this group, is the northernmost atoll on Earth. On June 15, 2006, U.S. President George W. Bush issued a proclamation creating Papahānaumokuākea Marine National Monument under the Antiquities Act of 1906. The national monument, meant to protect the biodiversity of the Hawaiian isles, encompasses all of the northern isles, and is one of the largest such protected areas in the world. The proclamation limits tourism to the area, and called for a phase-out of fishing by 2011.\nThe oldest and most heavily eroded part of the chain are the Emperor seamounts, which are 39 to 85&nbsp;million years old. The Emperor and Hawaiian chains form an angle of about 120°. This bend was long attributed to a relatively sudden change of 60° in the direction of plate motion, but research conducted in 2003 suggests that it was the movement of the hotspot itself that caused the bend. The issue continues to remain under academic  debate. All of the volcanoes in this part of the chain have long since subsided below sea level, becoming seamounts and guyots. Many of the volcanoes are named after former emperors of Japan. The seamount chain extends to the West Pacific, and terminates at the Kuril–Kamchatka Trench, a subduction zone at the border of Russia.\nFormation\nThe oldest confirmed age for one of the Emperor Seamounts is 81 million years, for Detroit Seamount. However, Meiji Seamount, located to the north of Detroit Seamount, is likely somewhat older.\nIn 1963, geologist John Tuzo Wilson hypothesized the origins of the Hawaiian–Emperor seamount chain, explaining that they were created by a hotspot of volcanic activity that was essentially stationary as the Pacific tectonic plate drifted in a northwesterly direction, leaving a trail of increasingly eroded volcanic islands and seamounts in its wake. An otherwise inexplicable kink in the chain marks a shift in the movement of the Pacific plate some 47 million years ago, from a northward to a more northwesterly direction, and the kink has been presented in geology texts as an example of how a tectonic plate can shift direction comparatively suddenly. A look at the USGS map on the origin of the Hawaiian Islands clearly shows this \"spearpoint\".\nIn a more recent study, Sharp and Clague interpret the bend as starting at about 50 million years ago. They also conclude that the bend formed from a \"traditional\" cause—a change in the direction of motion of the Pacific plate.\n| position1 =\n| background1 =\n| mark1 =\n| mark1size = 0\n| lat1_deg = 47\n| lon1_deg = 23\n| label5 =\n| pos5 = right\n| background5 =\n| mark5 =\n| mark5size = 0\n| lat5_deg = 40\n| lon5_deg = 75\n| label7 =\n| pos7 =\n| background7 =\n| mark7 =\n| mark7size = 0\n| lat7_deg = 43\n| lon7_deg = 54\n| label8 =\n| pos8 =\n| background8 =\n| mark8 =\n| mark8size = 0\n| lat8_deg = 15\n| lon8_deg = 55\n}}\nHowever, recent research shows that the hotspot itself may have moved with time. Some evidence comes from analysis of the orientation of the ancient magnetic field preserved by magnetite in ancient lava flows sampled at four seamounts: this evidence from paleomagnetism shows a more complex history than the commonly accepted view of a stationary hotspot. If the hotspot had remained above a fixed mantle plume during the past 80 million years, the latitude as recorded by the orientation of the ancient magnetic field preserved by magnetite (paleolatitude) should be constant for each sample; this should also signify original cooling at the same latitude as the current location of the Hawaiian hotspot. Instead of remaining constant, the paleolatitudes of the Emperor Seamounts show a change from north to south, with decreasing age. The paleomagnetic data from the seamounts of the Emperor chain suggest motion of the Hawaiian hotspot in Earth's mantle. Tarduno et al. have interpreted that the bend in the seamount chain may be caused by circulation patterns in the flowing solid mantle (mantle \"wind\") rather than a change in plate motion.\nThere are two distinct interpretations for the cause of the bend in the seamounts of the Emperor chain as previously mentioned. First, that the bend was caused only by a change in the Pacific plate motion. Second, that the bend was caused by hotspot movement only. In 2004 geologist Yaoling Niu proposed a model that attributed the bend largely to a change in plate motion along with some motion in the hotspot. Niu proposes that the bend starts at 43 Ma which is caused by a \"trench jam\". This \"trench jam\" is caused by the arrival of the Emperor chain seamounts at the northern subduction zone. These thick, buoyant seamounts resisted subduction and caused a reorientation of plate motion. Thus explains the sudden change in plate motion and is supported by the orientation of nearby island chains which also have a sudden bend which mirror the Emperor chain. As shown by Tarduno et al., the hotspot does show some north-south motion, but Yaoling's model shows that for the bend to be attributed completely to hotspot motion, the Pacific Plate would have to remain stationary from 81 Ma to 43 Ma. Thus, is not true as magnetic anomalies on the Pacific Plate indicate motion of around 60&nbsp;mm per year during that period. This model consisting of a change in plate motion combined with small north-south motions of the hotspot seems to be the best supported theory concerning the bend in the Emperor chain to date.\nIn addition to previous interpretations of the cause of the bend in the seamount chain, Hu et al. have proposed a close relationship between mantle plume migration and change in plate tectonic motion. Expanding on previous models, it has been interpreted that the Pacific Plate's motion was predominantly in the northern direction prior to 47 million years ago. Traditionally, the force pulling the Pacific Plate to the north was attributed to the Izanagi - Pacific Ridge subduction zone. However, in a 2021 study, Hu et al. proposed that this subduction zone was not a strong enough force to have been pulling the Pacific Plate on its own. Instead, they introduced the concept that there was an intra-oceanic subduction zone involving the Kronotsky and Olyutorsky arcs. According to their findings, this subduction zone played a significant role in northern directional pull on the Pacific Plate. Around 47 million years ago, these northern forces came to an end. Near the same time, there were notable changes in the movement of the Hawaiian hotspot. Approximately 50 Ma, the Hawaiian hotspot started to drift to the south. However, there is not a widely accepted theory as to the mechanism that caused the hotspot to drift. The combination of these events along with new subduction zones in the west, could explain the large bend present in the Hawaiian - Emperor Seamount Chain.\nAging\nThe chain has been produced by the movement of the ocean crust over the Hawaii hotspot, an upwelling of hot rock from the Earth's mantle. As the oceanic crust moves the volcanoes farther away from their source of magma, their eruptions become less frequent and less powerful until they eventually cease altogether. At that point erosion of the volcano and subsidence of the seafloor cause the volcano to gradually diminish. As the volcano sinks and erodes, it first becomes an atoll island and then an atoll. Further subsidence causes the volcano to sink below the sea surface, becoming a seamount and/or a guyot.\nEconomic activity\nFrom the 1960s to the 1980s, the seamounts were intensively bottom trawled. Trawling has continued since then at lower rates, particularly by Japanese ships seeking Pentaceros wheeleri. The North Pacific Fisheries Commission regulates fishing in the area.\nSee also\n*Isostasy\n*Kodiak–Bowie Seamount chain\n*New England Seamounts\n*Oceanic trench\n*Pacific-Kula Ridge\n*Plate tectonics\n*Timeline of the far future\n*Vitória-Trindade Ridge\nReferences\nInformational notes\nCitations\nFurther reading\n*\n*\n*\n*\n*[https://pubs.usgs.gov/publications/text/Hawaiian.html USGS, \"The long trail of the Hawaiian hotspot\"]\n*[https://web.archive.org/web/20140305205505/http://news.nationalgeographic.com/news/2003/08/0814_030814_hotspot.html National Geographic News: John Roach, \"Hot Spot That Spawned Hawaii Was on the Move, Study Finds\"] : August 14, 2003\n* [https://web.archive.org/web/20080819183123/http://wwwhvo.wr.usgs.gov/volcanowatch/1995/95_09_08.html Evolution of Hawaiian Volcanoes] from the USGS.\n* [http://www.soest.hawaii.edu/GG/HCV/haw_formation.html Ken Rubin, \"The Formation of the Hawaiian Islands\"] with tables and diagrams illustrating the progressive age of the volcanoes.\n* [https://web.archive.org/web/20061205203613/http://volcano.und.nodak.edu/vwdocs/vwlessons/hot_spots/introduction.html Hot Spots and Mantle Plumes]"
    }
  ]
}