{
  "content": [
    {
      "type": "text",
      "text": "# Hawaii's Story by Hawaii's Queen__disambig_1\n\n'Hawaii's Story by Hawaii's Queen' is a book written by Queen Liliuokalani, the last monarch of the Kingdom of Hawaii. It was first published in 1898, five years after the overthrow of the Kingdom. In it, Liliuokalani gives her account of her upbringing, her accession to the throne, the overthrow of her government by pro-American forces, her appeals to the United States to restore the Hawaiian monarchy, and her arrest and trial following an unsuccessful 1895 rebellion against the Republic of Hawaii.\nHer appeals immediately after the overthrow were acted upon by her friend, President Grover Cleveland, who demanded her reinstatement from the President of Hawaii, Sanford B. Dole, following a confidential investigation and report by James Henderson Blount submitted July 17, 1893. Dole refused Cleveland's demands. Cleveland then referred the matter to the United States Congress. The Congress investigated further and produced the Morgan Report on February 26, 1894, which concluded that the U.S. had no role in the Hawaiian Revolution. Following the Morgan Report, the Turpie Resolution of May 31, 1894 ended any hope for further assistance in regaining her throne, and her further appeals for help were rebuffed by the Cleveland administration.\nIn 1898, the same year the book was originally published, U.S. president McKinley and Congress passed a Joint Resolution known as the Newlands Resolution, annexing Hawaiʻi as a U.S. territory. This Treaty was opposed by Queen Liliʻuokalani and was very unpopular with the people of Hawai'i, and the legality of this annexation remains in question today.\nThis book is seen by many in the Hawaiian sovereignty movement as a key source documenting the overthrow of the Hawaiian monarchy. However, many of her assertions regarding the overthrow are contradicted by other primary sources, including the Morgan Report and the Native Hawaiians Study Commission Report of 1983.\nIn either case, many people believe that the work is successful in conveying the frustration and sadness by the Queen and her supporters both for her loss of the throne, as well as the end of the independent nation of Hawaii upon annexation to the United States.\nReferences\nExternal links\n* [http://digital.library.upenn.edu/women/liliuokalani/hawaii/hawaii.html Online edition] at [http://digital.library.upenn.edu/women/ A Celebration of Women Writers] web site of the University of Pennsylvania\n*[http://morganreport.org The Morgan Report]\n*[https://web.archive.org/web/20120708235115/http://wiki.grassrootinstitute.org/mediawiki/index.php?title=Native_Hawaiians_Study_Commission_Report Report] of the Native Hawaiians Study Commission U.S. Congress 1983\nFurther reading\n*\n*  [https://web.archive.org/web/20050901041110/http://www.hawaiimatters.com/ Online Edition]"
    }
  ]
}