{
  "content": [
    {
      "type": "text",
      "text": "# Haymarket Martyrs' Monument\n\n|locmapin              = United States Chicago Greater\n|built                 = Dedicated\n|customarchitect_title = Sculptor\n|customarchitect       = Albert Weinert\n|designated_nrhp_type  = February 18, 1997\n| added                = February 18, 1997\n| refnum               = 97000343\n}}\nThe 'Haymarket Martyrs' Monument' is a funeral monument and sculpture located at Forest Home Cemetery in Forest Park, Illinois, a suburb of Chicago. Dedicated in 1893, it commemorates the defendants involved in labor unrest who were blamed, convicted, and executed for the still unsolved bombing during the Haymarket Affair (1886).  The monument's bronze sculptural elements are by artist Albert Weinert. On February 18, 1997, the monument was designated a National Historic Landmark.\nHistory and description\nFollowing the Haymarket affair, trial and executions, August Spies, Adolph Fischer, George Engel, Louis Lingg, and Albert Parsons were buried at the German Waldheim Cemetery (later merged with Forest Home Cemetery).\nThe Pioneer Aid and Support Association organized a subscription for a funeral monument. In 1893, the ''Haymarket Martyrs' Monument'' by sculptor Albert Weinert was raised at Waldheim. It consists of a 16-foot-high granite shaft capped by a carved triangular stone.  There is a two step base, which also supports a pedestal and a monumental figure of Justice, depicted as a woman standing guard over the body of a fallen worker, both in bronze. In one hand, she holds a laurel wreath to crown the fallen. Resting on the top of the second step is an arrangement in bronze of palm branches. The inscription on the pedestal reads, \"1887\", the year of the executions. On the first step, there is a quote attributed to Spies, recorded just before his execution by hanging: \"The day will come when our silence will be more powerful than the voices you are throttling today.\"\nOn the back of the monument are listed the names of the men.  Above the names, a bronze plaque contains text of the pardon later issued by Governor John Peter Altgeld of Illinois.\nThe monument was dedicated on June 25, 1893, after a march from Chicago. The dedication ceremony was attended by 8,000, with trade union flags and the American flag draped on the monument.  European unions and American organizations sent flowers to be placed.  A number of activists and labor leaders were subsequently buried nearby. Haymarket defendants, Michael Schwab and Oscar Neebe were also buried at the monument when they died. Samuel Fielden is the only Haymarket defendant who is not buried at Forest Home. For years, annual commemorations were held.\nSince the 1970s, the Illinois Labor History Society has held the deed to the monument and been responsible for its maintenance and restoration. It conducts monthly guided tours of Forest Home Cemetery from May through October.\nTime capsule\nIn October 2016, volunteers and scientists dug near the base of the monument where they recovered an urn while searching for a lost time capsule that had been buried under the cornerstone on November 6, 1892, during the monument's construction. The urn was made of stone or concrete and capped in marble,  tall and  wide. According to a list in the records of the Pioneer Aid and Support Association, the lost time capsule is to contain newspaper articles, letters to and from the Haymarket defendants, and photographs of the men and their families. It also held trial documents, essays, and letters and testimonials from a number of labor unions and fraternal organizations. In addition, it may contain a bust of August Spies. Research is ongoing to determine the location of the time capsule.\nThe group that discovered the urn cylinder also found a smaller concrete cube thought to be a cremation vault for the ashes of Haymarket martyr Oscar Neebe, pardoned by Gov. John Altgeld, who died in 1916.\nGallery\nHayMarket100a.jpg|Utah Phillips speaking in May 1986, during ceremonies commemorating the 100th anniversary of the Haymarket affair.\nFile:Haymarket-Martyrs-Memorial-detail-02.jpg|''Haymarket Martyrs' Monument detail\nFile:Haymarket-Martyrs-Memorial-detail-01.jpg|Inscription at the base of the Haymarket Martyrs' Monument'', \"The day will come when our silence will be more powerful than the voices you are throttling today.\"\nFile:Haymarket Martyr's Memorial Rear.jpg|''Haymarket Martyrs' Monument, rear, with text of the pardon on bronze tablet, and names of the \"martyrs\".\nFile:Haymarket-Martyrs-NHL-plaque.jpg|National Historic Landmark plaque, at site of the Haymarket Martyrs' Monument; added in 1997.\nSee also\n*Monuments relating to the Haymarket affair\n*List of National Historic Landmarks in Illinois\nReferences\nExternal links\n*[http://www.wikimapia.org/#lat=41.8697849&lon=-87.8197457&z=20&l=0&m=b&show=/1780336/Haymarket-Martyr-s-Monument Haymarket Martyrs Monument, wikimapia]\n*[http://www.wikimapia.org/#lat=41.8843688&lon=-87.6439498&z=17&l=0&m=b&show=/2628820/Haymarket-Memorial \"Haymarket Memorial\", wikimapia'']\n*https://chicago-outdoor-sculptures.blogspot.com/2009/03/haymarket-memorial.html"
    }
  ]
}