{
  "content": [
    {
      "type": "text",
      "text": "# Hayti Heritage Film Festival\n\nThe Hayti Heritage Film Festival (HHFF) is an annual film festival held in Durham, NC, which features the work of filmmakers of African Descent. The HHFF is one of the longest-running Black film festivals in the United States. The film festival screens documentaries, featured-length films, and short films.\nHistory and foundation\nHayti is a historical community located in Durham, NC. At the end of the American Civil War, newly freed Black people created settlements, such as Hayti, among cities in North Carolina and across the South. Hayti became a well-developed and self-sustained community within the City of Durham. One of the oldest and original structures to remain is the St. Joseph’s African Methodist Episcopal Church, which is now known as the Hayti Heritage Center. While the exact origin is unknown, in 1994, local artists and stakeholders joined together and organized the first film festival held at the Hayti Heritage Center to preserve Durham’s illustrious heritage. Today, their goal is to keep Black southern films alive.\nBecause of the COVID-19 pandemic, the 27th annual HHFF will feature some films that will be shown online as well as through drive-in screening.\n2021\nThe 27th annual HHFF ran from March 1 through March 6. That years theme was \"The Hero's Journey: A Call to Action.\" The COVID-19 Pandemic had moved the festival from the Historic St. Joseph's AME Church to be primarily virtual, with a blend of online panels and screenings. It showed 40 films from across the globe and held two drive-thru movie events and multiple virtual panel discussion. Highlights from the 27th annual HHFF included a drive-thru screenings of Sam Pollard's MLK/FBI and The Outside Story, a panel discussion called \"Lovecraft Country meets Black Girls Guide to Surviving Menopause,\" between Omisade Burney-Scott and Lovecraft Country writer Shannon Houston. This year's festival also included a tribute to Cicely Tyson, who died on January 28, 2021. In addition, works highlighting themes surrounding dance, the Black male image, and Black femme liberation was also shown.\n2020\nThe 26th annual HHFF ran from February 13 through February 15. It screened over 30 films and focused on afrofuturism, death, identity, and politics. Highlights included the screenings of The Black Chapter, The Sound of Silence, The Passing On, and closed with Subira. That year's festival honored John Singleton, who died in 2019, by screening Higher Learning. Additionally, an acting MasterClass was held by Obba Babatundé and several training and mentoring sessions were held for filmmakers.\nEligibility and selection\nThe HHFF takes film by submission and a jury selects the best film from the submissions. The jury rounds about 60% of the program then curation.\nTo be eligible for consideration:\n# Films must be directed by a person of African descent or who otherwise identifies as Black.\n# Narrative feature films and documentary films must not exceed a running time of 120 minutes.\n# Shorts must not exceed a running time of 30 minutes.\n# Non-English language works must have English subtitles at the time submitted. Dialogue lists will not be accepted.\nThough not required for eligibility, preference is given to films made in the American South.\nReferences"
    }
  ]
}