{
  "content": [
    {
      "type": "text",
      "text": "# Haywards Heath Town F.C.\n\n| season =\n| position =\n| website = [http://www.hhtfc.co.uk hhtfc.co.uk]\n| pattern_la1 = _bluelower\n| pattern_b1 = _whitecollar\n| pattern_ra1 = _bluelower\n| pattern_sh1 = _whitesides\n| leftarm1 = FFFFFF\n| body1 = 0000FF\n| rightarm1 = FFFFFF\n| shorts1 = 0000FF\n| socks1 = 0000FF\n| pattern_la2 =\n| pattern_b2 = _darkbluewhitehorizontal\n| pattern_ra2 =\n| pattern_sh2 =\n| leftarm2 = FF0000\n| body2 = FF0000\n| rightarm2 = FF0000\n| shorts2 = FF0000\n| socks2 = FF0000\n}}\nHaywards Heath Town Football Club is a football club based in Haywards Heath, West Sussex, England. They are currently members of the  and play at Hanbury Park.\nHistory\nThe club was formed in 1888 as Haywards Heath Juniors. They were renamed Haywards Heath Excelsior in 1894, before becoming simply Haywards Heath in 1895. They were founder members of the Mid-Sussex League in 1900, and were runners-up in the Senior Division in 1901–02, 1902–03, 1903–04 and 1905–06. The club dropped out of the Senior Division in 1908, but won Division Two in 1911–12. In 1919–20 Haywards Heath were Mid-Sussex League champions without losing a game. They won the title again in 1922–23 and went on to retain it for the next two season, losing only one match in each season. In 1926 the club transferred to Division One of the Brighton, Hove & District League and were champions at the first attempt.\nAfter winning the Brighton, Hove & District League, Haywards Heath moved up to the Sussex County League. After top four finishes in four of their first five seasons in league, they finished bottom of the league in 1932–33. In 1941–42 the club won the Sussex Senior Cup. After World War II they were placed in the Eastern Division of the league for the 1945–46 season, going on to win the division. The following season saw the league revert to a single division, with the club winning back-to-back titles in 1949–50 and 1950–51.\nA move to Hanbury Park in 1952 allowed Haywards Heath to join the Metropolitan League, but after several seasons of struggling in the new league, they finished bottom of the table in 1960–61 and rejoined the Sussex County League. The club won the Division One title in 1969–70, the League Cup in 1972–73, and were runners-up in 1974–75, but were relegated to Division Two at the end of the 1979–80 season, which had seen them finish second-from-bottom in Division One. They won the Division Two Cup in 1983–84, beating Wigmore Athletic 4–2 in a replay. The club were Division Two runners-up in 1985–86, earning promotion back to Division One.\nIn 1989 the club adopted its current name. They finished bottom of Division One in 1991–92 and were relegated to Division Two. A second successive relegation followed as they finished bottom of Division Two in 1992–93. They won the Division Three Cup in 2000–01 with a 1–0 win over Steyning Town in the final. The following season saw them finish as Division Three runners-up, earning promotion to Division Two. However, they finished bottom of Division Two in 2003–04 and were relegated back to Division Three after only one season. They won the Division Three Cup again in 2008–09, beating Dorking Wanderers 2–0 in the final.\nIn 2012–13 Haywards Heath were Division Three runners-up, resulting in promotion to Division Two. The division was renamed Division One in 2015 when the league was rebranded as the Southern Combination and the club went on to win the Division One title in 2015–16, earning promotion to the Premier Division. They finished top of the Premier Division the following season and were due to be promoted to Division One South of the Isthmian League. However, after being penalised with a nine-point deduction for fielding in several matches a player who was serving a ban, the championship was awarded to Shoreham. The club went on to win the Premier Division in 2017–18, earning promotion to the newly formed South East Division of the Isthmian League. They were relegated back to the Premier Division of the Southern Combination at the end of the 2022–23 season after being defeated by Redbridge in an inter-step play-off.\nThe 2024–25 season saw Haywards Heath finish fourth in the Premier Division, qualifying for the promotion play-offs, in which they lost 2–1 to Eastbourne United in the semi-finals.\nGround\nThe club moved to Hanbury Park in 1952 and the ground was opened by Stanley Rous for its inaugural match against Horsham. Covered terracing was installed along one side of the pitch, but later removed. However, the large main stand remains in place.\nHonours\n*Southern Combination\n**Champions 1949–50, 1950–51, 1969–70, 2017–18\n**Eastern Division champions 1945–46\n**Division One champions 2015–16\n**League Cup winners 1972–73\n**Division Two Cup winners 1983–84\n**Division Three Cup winners 2000–01, 2008–09, 2012–13\n*Brighton, Hove & District League\n**Division One champions 1926–27\n*Mid-Sussex League\n**Division One champions 1919–20, 1922–23, 1923–24, 1924–25\n**Division Two champions 1911–12\n**Montgomery Cup winners 1919–20, 1922–23, 1924–25\n*Sussex Senior Cup\n**Winners 1941–42, 1957–58\n*Sussex RUR Cup\n**Winners 1943–44, 1966–67, 1974–75, 1975–76\n*Sussex Intermediate Cup\n**Winners 2012–13\nRecords\n*Best FA Cup performance: Fourth qualifying round, 1945–46\n*Best FA Vase performance: Third round, 1990–91, 2025–26\nSee also\n*\n*\nReferences\nExternal links\n*"
    }
  ]
}