{
  "content": [
    {
      "type": "text",
      "text": "# Haywards Heath\n\n| area_total_km2           = 9.75\n| population               = 22,800\n| population_ref           =  (2001 Census)  33,845  (2011 Census)\n| os_grid_reference        = TQ335245\n| coordinates              =\n| post_town                = HAYWARDS HEATH\n| postcode_area            = RH\n| postcode_district        = RH16, RH17\n| dial_code                = 01444\n| constituency_westminster = Mid Sussex\n| london_distance          =  N\n| shire_district           = Mid Sussex\n| shire_county             = West Sussex\n| website                  =\n}}\nHaywards Heath ( ) is a town in West Sussex, England,  south of London,  north of Brighton,  south of Gatwick Airport and  northeast of the county town, Chichester. Nearby towns include Burgess Hill to the southwest, Horsham to the northwest, Crawley northwest and East Grinstead northeast. With a decently small  number of jobs available in the immediate vicinity, mostly in the agricultural or service sector,  residents work remotely or commute daily via road or rail to London, Brighton, Crawley or Gatwick Airport.\nEtymology\nThe first element of the place-name Haywards Heath is derived from the Old English hege + worð, meaning hedge enclosure, with the later addition of hǣð. The place-name was first recorded in 1261 as Heyworth, then in 1359 as Hayworthe, in 1544 as Haywards Hoth (i.e. 'heath by the enclosure with a hedge'), and in 1607 as Hayworths Hethe.\nThere is a local legend that the name comes from a highwayman who went under the name of Jack Hayward.\nHistory\nHaywards Heath's Muster Green was the site of the Battle of Muster Green, a minor battle that took place in early December 1642 during the First English Civil War between a Royalist army under Edward Ford, High Sheriff of Sussex, and a smaller (but more disciplined) Parliamentarian army under Herbert Morley. Due to the fact that neither side possessed field guns, hand-to-hand combat ensued and after roughly an hour of fighting and 200 Royalists killed or wounded, the Parliamentarians emerged victorious  and routed the Royalist army.\nHaywards Heath is located in the east of the ancient parish of Cuckfield. A separate civil parish and urban district of Haywards Heath was created in 1894. From 1934 to 1974 Cuckfield, Haywards Heath and Lindfield were combined to form Cuckfield Urban District, but since 1974 the three settlements have had separate councils again.\nHaywards Heath as a settlement is a relatively modern development. Following the arrival of the London & Brighton Railway in 1841, its size increased considerably. Haywards Heath railway station opened on 12 July 1841 and served as the southern terminus of the line until the completion of Brighton station on 21 September. The position of Haywards Heath, and its place on both this railway and near the main road (A23) between London and Brighton, enables it to function as a commuter town, with many residents working in London, Brighton, Crawley and Gatwick Airport.\nSouth Road in Haywards Heath\nOther noted historical events in the town's history include:\n* The opening of the Sussex County Lunatic Asylum (later called St Francis Hospital) in 1859. The superintendent here was, for many years, Dr Lockhart Robertson, later Lord Chancellor's Visitor.\n* The opening of Bannister's Cattle Market, the 12th largest in the UK at one point, in 1859. This was closed to make way for a Sainsbury's supermarket in 1989.\n* The opening of Victorian and Edwardian villas built as early commuter settlements in 1894\n* The opening of the Eliot Cottage Hospital, later King Edward VII Eliot Memorial Hospital, in 1906, named after benefactor, Alice Annie Eliot (1864–1904)\n* Schemes in the 1920s helped families on low incomes to become self-sufficient, resulting in the building of Franklands Village in the 1930s.\nIn the 1960s and 1970s, two light industrial estates were built. Office development has lately resulted in the town being a regional or national centre for a number of national companies and government agencies.\nThe population has risen from 200 in the early 1850s to 22,800 (2001 census), making it one of the larger towns in West Sussex. The area of the civil parish is .\nThe parish church, dedicated to St Wilfrid, and the Roman Catholic church of St Paul are among the churches and chapels in Haywards Heath. Other places of worship include the Methodist church in Perrymount Road and two Baptist churches, St Richards (C of E), the Church of the Presentation (C of E) and the Ascension Church (C of E).\nThe Priory of Our Lady of Good Counsel on Franklynn Road was built in 1886 and is Grade II listed.\n]]\nHaywards Heath was in East Sussex, but a change to the county boundary in 1974 brought it under the jurisdiction of West Sussex. Haywards Heath Town Hall was completed in 1990.\nOn May 9, 1946, delegates from thirteen countries, including representatives of the British and Foreign Bible Society, met in Haywards Heath to establish the United Bible Societies.  Headquartered in Swindon, this society numbered in 2025 more than 150 chapter (national) societies and worked in more than 200 countries, translating and publishing Bibles.\nGovernance\nHaywards Heath has a town council, consisting of 16 councillors. As of May 2025, the council is run by the Liberal Democrats, with seats held as follows:\n{| class=\"wikitable\"\n|+\n!Political party\n!Seats held\n|-\n|Liberal Democrats\n|12\n|-\n|Conservative\n|1\n|-\n|Green\n|1\n|}\nThe current mayor of Haywards Heath is Cllr Duncan Pascoe.\nClimate policy\nIn 2022, Haywards Heath Town Council endorsed the Plant Based Treaty, a global climate action initiative similar to the Fossil Fuel Non-Proliferation Treaty Initiative.\nHousing developments\nSunnywood Drive\nIn 1934 the architects Berthold Lubetkin and Tecton obtained planning permission for some modernist-style houses. Unconventionally, they are built with brick and with flat roofs. Seven buildings were built of which a pair were semi-detached. The walls were built of cavity brick walls but certain features were built in concrete window frames, balconies, built-in flower boxes and porches. The houses were originally sold at £975- £1200 each.\nBolnore Village\nHousing in Haywards Heath expanded significantly in the first decade of the 21st century due to the creation of Bolnore Village, located to the southwest of the existing town. Planning permission was first granted in the late 1990s for 780 new homes on a greenfield site. The first house was completed in October 2002. Since then, phases 1, 2, 3, 4a and 5 have been built by the house builders Crest Nicholson in conjunction with several other developers. Housing was followed by the construction of various commercial units and Bolnore Village Primary School, which was the country's first self-governing parent-promoted primary school in September 2010.\nThe decision to grant planning permission for Bolnore Village was somewhat controversial since the Ashenground and Catts Woods on that site formed a Site of Nature Conservation Interest (SNCI).\nAs a condition for planning permission, the developers were required to build a relief road for the town, often referred to as the Haywards Heath by-pass, which has rerouted the A272 to the south side of the town. Construction work on the relief road commenced in 2012; on its completion in August 2014, the previous A272 route through Haywards Heath was renumbered the B2272.\nIn 2008, local residents won a bid to set up and run their own primary school for the village. The new school opened in September 2008.\nFuture\nAs Bolnore village's construction has nearly finished the majority of new housing for Haywards Heath has been on the southern side of the A272, the site is commonly referred to as Sandrocks after the house that was previously there. This area has 6 main development areas, of which 2 have been completed as of Summer 2018.\nNew housing developments have also appeared on the northern side of the town. Both of them allow approx 400 new dwellings to be built. The first one is on the northern end of Penland Road and south of Hanlye Lane and started development in 2017. The other one is between Lindfield and Walstead. This started in 2015.\nThere are also plans that the land around Hurstwood Farm will be built on, with the provision of a new primary school, Country Park and allotments included in the master plan which has received planning permission.\nTransport links\nHaywards Heath railway station\nRail\nHaywards Heath railway station is a major station on the Brighton Main Line. Some of the train services divide at Haywards Heath before continuing their journey to the south or join other services before continuing north.\nHaywards Heath has trains terminating at: London Victoria, Bedford, Cambridge, Brighton, Eastbourne and Littlehampton.\nRoad\nHaywards Heath is primarily served by the A272 road, which runs around the south side of the town. This is the new Haywards Heath by-pass, which was opened (ahead of schedule) in August 2014. It diverts town centre traffic south of the town, just south of Bolnore Village, Ashenground and the Princess Royal Hospital. The old A272 through the town centre is now the B2272. Following the A272 to the west, it joins the A23 trunk road which runs both to Brighton to the south and London to the north via the M23.\nThe town is also connected to Burgess Hill to the south via the A273, B2036 and B2112.\nLocal features\n*Victoria Park\n*Dolphin Leisure Centre\n*Clair Hall – community centre/event centre\n*Borde Hill Gardens\n*Beech Hurst Gardens\n*Haywards Heath Recreation Ground\n*Haywards Heath Library\n*Haywards Heath Cadet Centre\n*Princess Royal Hospital\n*\"Town Day\" – celebrated in early September each year including fireworks in the evening at Victoria Park.\nMedia\n*Local news and television programmes is provided by BBC South East and ITV Meridian (East)\n*Local radio stations are BBC Radio Sussex on 104.5 FM, Heart South on 102.4 FM, More Radio Mid-Sussex on 106.4 FM and Mid-Downs Radio is a hospital community radio station that broadcasts from their studios at the Princess Royal Hospital in Haywards Heath.\n*The town's local newspapers are Mid Sussex Times and The Sussex Newspaper.\nEducation\nState schools\nOathall Community College is a secondary school for the town and surrounding area. Facilities include a school farm. Additionally, in the nearby village of Cuckfield, Warden Park Secondary Academy (part of the Sussex Learning Trust) provides education to c. 1500 students from the surrounding areas, including the village where it's situated - Cuckfield - as well as Haywards Heath, Ansty, Bolnore, Balcombe and other towns and villages.\nHaywards Heath is also home to a number of local primary schools, one of which is St Joseph's Catholic Primary School, located on Hazelgrove Road near the centre of the town. Additionally, other nearby schools include St Wilfrid's, Harlands Primary School, Warden Park Primary Academy, Lindfield Primary Academy and Bolnore Village Primary School.\nIn September 2020, a new Chichester College campus opened, called Haywards Heath College. The college uses the old Central Sussex College Haywards Heath campus on Harlands Road which closed in Summer 2017. The current principal is the former Worthing College principal.\nPrivate schools\n*Tavistock and Summerhill School (1973–2015)\n*Great Walstead School\n*Ardingly College\n*Hurstpierpoint College\n*Burgess Hill School For Girls\n*Worth School\n*Cumnor House\nTwin towns\nHaywards Heath is twinned with:\n* Bondues, Nord-Pas-de-Calais, France\n* Traunstein, Bavaria, Germany\nThe section of the A272 that runs south beside Bolnore Village has been named Traunstein Way and there is a German postbox outside the Town Hall to commemorate the link.\nSport and leisure\nHaywards Heath has two Non-League football clubs, Haywards Heath Town F.C. who play at Hanbury Park and St Francis Rangers F.C. who play at The Colwell Ground.\nHaywards Heath is home to No5 (Haywards Heath) Detachment, C Company of the Sussex Army Cadet Force, a volunteer youth organisation, sponsored by the Ministry of Defence, which accepts cadets aged between 12 and 18 years of age.\nHaywards Heath also has a rugby union team.\nThe area has two hockey clubs nearby: St Francis Hockey Club and Mid Sussex Hockey Club. They both play their home games at The Triangle leisure centre in Burgess Hill and have a shared clubhouse based in Haywards Heath.\nHaywards Heath is also home to the Dolphin Leisure Centre. Managed by Places Leisure, amenities include a swimming pool, sports halls, gymnasium and park.\nNotable people\n* Natasha Bedingfield, singer/songwriter\n* Daniel Bedingfield, singer/songwriter\n* Tamzin Merchant, actress\n* Sophie Cookson, actress\n* Richard Osman, TV presenter, attended Warden Park School\n* Brett Anderson, Suede singer/songwriter, lived in Newton Court Lindfield, and attended Oathall School and Haywards Heath Sixth Form College\n* Mat Osman, Suede bassist, attended Oathall School and Haywards Heath Sixth Form College\n* Greta Scacchi, actress, attended Haywards Heath Grammar School\n* Rebecca Daly, filmmaker\n* Kieran Sadlier, professional footballer.\n* Kaya Scodelario, actress\n* Arthur George Knight, recipient of the Victoria Cross\nSee also\n* Wilfrid Jackson Haywards Heath Living Memories . Published by Frith Book Company Ltd.\nReferences\nExternal links\n*[http://www.haywardsheath.gov.uk/ Haywards Heath Town Council website]\n*[https://web.archive.org/web/20070306173032/http://www.midsussextimes.co.uk/mk4custompages/custompage.aspx?pageID=21707 Mid Sussex Times History of Haywards Heath]\n*[https://web.archive.org/web/20060926183419/http://www.midsussex.gov.uk/page.cfm?CFNoCache=TRUE&LANGUAGE=eng&pageID=4313 Haywards Heath Town Masterplan]"
    }
  ]
}