{
  "content": [
    {
      "type": "text",
      "text": "# Hayward Osborne\n\n| birth_place      =\n| death_date       =\n| death_place      =\n| buried           =\n| resting_place_coordinates =\n| nationality      = British\n| religion         = Anglicanism\n| residence        =\n| parents          =\n| spouse           =\n| children         = Five\n| occupation       =\n| profession       =\n| education        = Sevenoaks School\n| alma_mater       = New College, Oxford  Westcott House, Cambridge\n}}\nHayward John Osborne (born 16 September 1948) is a retired British Anglican priest. He was the Archdeacon of Birmingham from 2001 until his 2018 retirement. He was previously a parish priest in the Diocese of Rochester, the Diocese of Worcester, and the Diocese of Birmingham.\nEarly life and education\nOsborne was born on 16 September 1948 to Ernest and Frances Joy Osborne. He was educated at Sevenoaks School, a private school in Sevenoaks, Kent. He studied at New College, Oxford and Westcott House, Cambridge.\nOrdained ministry\nOsborne was ordained in the Church of England as a deacon in 1973 and as a priest in 1974. From 1973 to 1977, he served his curacy at St Peter and St Paul, Bromley in the Diocese of Rochester. He moved to the Diocese of Worcester where he was an assistant curate at St John the Baptist, Halesowen between 1977 and 1980. From 1980 to 1983, he was Team Vicar of St John's, Halesowen. Then, from 1983 to 1988, he was Team Rector of St Barnabas, Worcester.\nIn 1988, Osborne moved to the Diocese of Birmingham. He was Vicar of St Mary's Church, Moseley from 1988 until 2001. He was also Area Dean of Moseley from 1994 until 2001. In May 2001, he was appointed Archdeacon of Birmingham. He was also priest in charge of St Bartholomew's Church, Allen's Cross from 2008 to 2009.\nFrom 1998 to 2015, Osborne was a member of the General Synod of the Church of England. He retired on 1 November 2018.\nPersonal life\nIn 1973, Osborne married Sandra Julie Hollander. Together they have five children; three daughters and two sons.\nReferences"
    }
  ]
}