{
  "content": [
    {
      "type": "text",
      "text": "# Haywards Heath Town Hall\n\n| location = Boltro Road, Haywards Heath\n| area =\n| built =1990\n| architect =\n| architecture = Neoclassical style\n| website=\n}}\nHaywards Heath Town Hall is a municipal building in Boltro Road in Haywards Heath, a town in West Sussex, in England. The building accommodates the offices and meeting place of Haywards Heath Town Council.\nHistory\nFollowing significant population growth, largely associated with the opening of the London and Brighton Railway, a local board was established in Haywards Heath in 1872. After the local board was succeeded by Haywards Heath Urban District Council in 1894, the new council decided to commission dedicated council offices. The site it selected was on South Road, just to the east of Victoria Park. The new offices were designed in the Jacobean style, built in brick with a cement render finish and were completed in the early 20th century. The design involved a symmetrical main frontage of four bays: there were round headed doorways in the outer bays, a segmental headed opening for the fire engine in the second bay, a round headed mullioned window in the third bay, and a bi-partite window in the stepped gable above.\nAfter the original offices on South Road became inadequate, the council sought larger premises. A large house, known as Oaklands on Oaklands Road, which had been built for a Brighton bookseller, Harry Treacher, in 1866, became available when a subsequent owner, a businessman, Sir James Bradford, died in April 1930. Oaklands went on to become the headquarters of the enlarged Cuckfield Urban District Council in 1934, and, following local government re-organisation in 1974, it became the headquarters of Mid Sussex District Council.\nIn the mid-1980s, Haywards Heath Town Council decided to commission its own offices and meeting place. The site they selected was on the west side of Boltro Road. The new building was designed in the Neo-Georgian style, built in red brick and was completed in 1990. The design involved a symmetrical main frontage of seven bays facing onto Boltro Road. The central bay featured a portico formed by a pair of Ionic order columns supporting an entablature and a balcony with iron railings; there was a French door on the first floor. The other bays were fenestrated by casement windows. Internally, the principal rooms were the various offices for council officers, four meeting rooms, and the council chamber.\nThe building was subsequently licensed to host weddings and civil partnership ceremonies. The football manager, Matt Beard, married his partner, Debbie, there in around 2010. In August 2014, a marble plaque was installed under the portico to commemorate the life of the locally-born soldier, Sergeant Arthur George Knight of the 10th Battalion, Canadian Expeditionary Force, who was awarded the Victoria Cross for his actions at the Villers-lès-Cagnicourt during the First World War. The Princess Royal visited the town hall and met with civic officials in October 2020.\nReferences"
    }
  ]
}