{
  "content": [
    {
      "type": "text",
      "text": "# Hazardous seas warning\n\nA Hazardous Seas Warning is issued by the National Weather Service of the United States when wave heights and/or wave steepness values reach certain criteria.  These criteria are defined by the local forecast office.  Such tall waves can pose a serious threat to vessels that do not seek shelter.\nExample\nThe following is an example of a Hazardous Seas Warning issued by the National Weather Service office in Medford, Oregon.\n133\nWHUS76 KMFR 032130\nMWWMFR\nURGENT - MARINE WEATHER MESSAGE\nNATIONAL WEATHER SERVICE MEDFORD OR\n230 PM PDT FRI OCT 3 2008\nPZZ356-376-041030-\n/O.EXT.KMFR.SE.W.0039.000000T0000Z-081005T1200Z/\n/O.CON.KMFR.GL.W.0035.000000T0000Z-081004T0900Z/\nCOASTAL WATERS FROM CAPE BLANCO OR TO PT. ST. GEORGE CA OUT 20 NM-\nWATERS FROM CAPE BLANCO OR TO PT. ST. GEORGE CA FROM 20 TO 60 NM-\n230 PM PDT FRI OCT 3 2008\n...HAZARDOUS SEAS WARNING NOW IN EFFECT UNTIL 5 AM PDT SUNDAY...\n...GALE WARNING REMAINS IN EFFECT UNTIL 2 AM PDT SATURDAY...\nTHE HAZARDOUS SEAS WARNING IS NOW IN EFFECT UNTIL 5 AM PDT\nSUNDAY. A GALE WARNING REMAINS IN EFFECT UNTIL 2 AM PDT SATURDAY.\nA STRONG FRONT MOVING THROUGH THE WATERS TODAY WILL BRING SOUTH\nWINDS OF 35 TO 40 KT WITH OCCASIONAL GUSTS NEAR 50 KT TO THE\nAREA. HIGHER GUSTS UP TO 55 KT ARE EXPECTED AROUND CAPE BLANCO.\nTHESE WINDS WILL PERSIST THROUGH THE LATE EVENING... THEN WILL SHIFT\nSOUTHWEST AND GRADUALLY EASE TO 20 TO 30 KT LATE TONIGHT.\nAS THE WINDS INCREASE...COMBINED SEAS WILL BUILD TO 12 TO 15 FEET\nAT 8 SECONDS. THEN ON SATURDAY...WESTERLY SWELLS OF 15 TO 16 FEET\nAT 12 SECONDS WILL ARRIVE..DECREASING TO 9 TO 11 FEET SUNDAY\nMORNING.\nPRECAUTIONARY/PREPAREDNESS ACTIONS...\nA GALE WARNING MEANS THAT CONDITIONS WILL BE HAZARDOUS TO\nCOMMERCIAL VESSELS AND EXTREMELY HAZARDOUS TO SMALL CRAFT.\nA HAZARDOUS SEAS WARNING MEANS THAT WAVES WITH EXTREME STEEPNESS\nARE IMMINENT OR OCCURRING. AREAS THAT ARE PRONE TO SHOALING WILL\nBE VERY DANGEROUS.\n&&\n$$\nSee also\n* Severe weather terminology (United States)\nReferences\nExternal links\n* [http://www.nws.noaa.gov/ National Weather Service]"
    }
  ]
}