{
  "content": [
    {
      "type": "text",
      "text": "# Hazen Brigade Monument\n\nThe Hazen Brigade Monument at Stones River National Battlefield, Murfreesboro, Tennessee, is the oldest American Civil War monument remaining in its original battlefield location.\nThe Hazen Brigade at the Battle of Stones River\nOn December 31, 1862, the first day of the Battle of Stones River, Confederate General Braxton Bragg made a surprise advance on his left and drove the right of the Union army of Major General William S. Rosecrans back three miles. At that point the Union line was nearly at right angles to its original position. The brigade of Col. William Babcock Hazen defended a  clump of cedars—known locally as the Round Forest—at a salient in the line just east of the Nashville Pike and on both sides of the Nashville & Chattanooga Railroad. Hazen's men, supported by other Union troops, and especially by artillery that Rosecrans had massed on the high ground in their rear, successfully repulsed four Confederate assaults. So great was the slaughter that soldiers called the place \"Hell's Half-Acre.\" Hazen's regiments sustained 409 casualties (29% of the brigade), including 45 men killed. The determined resistance of Hazen's brigade arguably prevented the Confederate Army of Tennessee from breaking the Union line.\nCreation of the monument\nDuring the summer of 1863, while the Union Army of the Cumberland outmaneuvered Bragg's Confederates in the Tullahoma campaign, members of Hazen's Brigade were detailed back to Stones River to build a monument both to commemorate the heroism of the brigade and to memorialize their lost comrades. A construction detail under Lt. Edward Crebbin placed the monument on private property in the middle of the brigade cemetery in Round Forest. A Union army captain described the monument as a \"quadrangular pyramidal shaft, ten feet square at the base and eleven feet in height....A dry-stacked stone wall, four feet high and two feet thick, enclosed both monument and cemetery. Three low steps breached the wall's south side to allow access.\" In 1864 two experienced stone cutters from the regiment carved the inscriptions, including names of the regimental officers killed at Stones River and the earlier Battle of Shiloh. On the south face the stone cutters inscribed the words, HAZEN'S BRIGADE/ TO THE MEMORY OF ITS SOLDIERS WHO FELL AT STONES RIVER, DEC. 31ST 1862/ THEIR FACES TOWARDS HEAVEN, THEIR FEET TO THE FOE.\nSubsequent history\nThe 0.84-acre site was acquired by the War Department in 1875 and before 1930 was administered under the authority of the superintendent of the Stones River National Cemetery. During this period the monument suffered \"periods of neglect and deterioration.\" In 1930, administration of the Hazen Memorial and the National Cemetery were officially consolidated into the Stones River National Military Park; and in 1933, administration of the Military Park was transferred from the War Department to the National Park Service (NPS).\nIn 1907, short-story writer and journalist Ambrose Bierce visited the Hazen Brigade Monument for a second time. Bierce had been a staff officer in the 9th Indiana Volunteers, had known Hazen well, and had survived fighting at Stones River unscathed. As a topographic engineer, Bierce had had ample opportunity to view the monument when it was first completed in 1863. In 1908, Bierce published an eerie psychological tale, \"A Resumed Identity,\" in which the man in the story shares Bierce's age, rank, and brigade affiliation and in which the Hazen Monument plays a critical role in the story's \"twist ending\". Bierce's protagonist describes the monument as it probably appeared in 1907: \"brown with age, weather-worn at the angles, spotted with moss and lichen. Between the massive blocks were strips of grass.\"\nIn 1985, while repairing the Monument, workers discovered a number of objects in its fill of limestone and soil: two bullets, eight buck and ball shot, a lead disk, a freshwater mussel shell, two bone fragments, six horse teeth, and two small wood fragments. Archaeologists concluded that these items had been in the soil used for fill. Nevertheless, about five feet above ground, archaeologists found nine other artifacts: two 12-pound and one 6-pound cannonballs, three rifled artillery shells, two rifled musket barrels, and a cedar staff. Because these items were all placed at a single level, the National Park Service believed their inclusion had been purposeful, although there was no agreement about the meaning of this presumptive time capsule.\nReferences"
    }
  ]
}