{
  "content": [
    {
      "type": "text",
      "text": "# He was aware that he was still a child\n\n| guests         =\n| length         = 22 minutes (on-air version)28 minutes (director's cut)\n| prev           = Weaving a Story 2: oral stage\n| next           = Don't Be\n| episode_list   = List of Neon Genesis Evangelion episodes\n}}\n|group=lower-alpha|lead=yes}} is the twenty-first episode of the Japanese anime television series Neon Genesis Evangelion, which was created by Gainax. Hideaki Anno and Akio Satsukawa wrote the episode, which the animator Hiroyuki Ishido directed. The series' protagonist is Shinji Ikari, a teenage boy whose father Gendo recruited him to the special military organization Nerv to pilot a gigantic, bio-mechanical mecha named Evangelion into combat with beings called Angels. In this episode, Kozo Fuyutsuki, the deputy commander of Nerv, is kidnapped by a secret organization called Seele, which questions him about his past and how he met Gendo. Fuyutsuki retraces his youth and his meeting with Yui Ikari, a young scientist with whom he falls in love. Ryoji Kaji, a member of Nerv, rescues Fuyutsuki and is killed by Seele.\nGainax wrote \"He was aware that he was still a child\" in haste due to a tight production schedule and time limitations. The episode was originally intended to focus on an event called the Dead Sea Evaporation Incident, which during production became the melting of Earth's southern ice cap. During the installment, it is revealed that one giant artificial cavity in Antarctica and one in Tokyo-3 exist, named White Moon and Black Moon, respectively, which came on Earth during the giant impact and were built by an alien species called the First Ancestral Race, a scenario later expanded in the Neon Genesis Evangelion 2 videogame. After the first broadcast, Gainax released an extended version called the \"director's cut\" or \"home video version\", with new footage. The animators Masahiko Otsuka and Shunji Suzuki directed the home video version.\n\"He was aware that he was still a child\" was first broadcast on February 21, 1996, and drew a 7.7% audience share on Japanese television. The episode was generally well received by critics because of the music, direction, voice acting, and ending; however, other reviewers complained of poor character development and lack of clear explanations. The use of flashbacks was both praised and criticized.\nPlot\nScientists at a research base at the South Pole in 2000 discuss a mysterious weapon called the Spear of Longinus on its way from the Dead Sea. Gendo Ikari and Keel Lorenz, members of an expedition named Katsuragi Group, criticize other scientists. In 2015, Ryoji Kaji, a member of the special paramilitary agency Nerv, sensing his death is near, leaves a message on someone's answering machine. At the Nerv base, the deputy commander Kozo Fuyutsuki is kidnapped. Misato Katsuragi, head of Nerv's strategy department, is detained because Kaji, her lover, is suspected of kidnapping Fuyutsuki. Fuyutsuki has been kidnapped by an esoteric organization called Seele, which is suspicious of Nerv's commander Gendo. Seele questions Fuyutsuki about Gendo, and Fuyutsuki recalls when he met the researcher Yui Ikari and Gendo, who then used his old surname Rokubungi, in 1999.\nYui and Gendo enter into a romantic relationship. Fuyutsuki falls in love with Yui and is suspicious of Gendo, who he believes is only approaching Yui due to her connection with Seele. Fuyutsuki begins investigating the Second Impact, an event that kills billions of people that was caused by a mysterious being called Adam. He also investigates an underground cavity in Antarctica called White Moon, which originated during an event called the Giant Impact and discovers Gendo's and Seele's involvement in the event. Fuyutsuki then meets Yui and Gendo at the Artificial Evolution Institute in Hakone. He threatens Gendo with public disclosure of his discoveries but Gendo invites him into an underground cavity beneath Hakone that was constructed by a non-human entity. Inside the cavity, Fuyutsuki meets the brilliant researcher Naoko Akagi and Gendo reveals his organization, Gehirn, is working on the Evangelion project, the goal of which is to ensure humanity's future survival. Following this revelation, Fuyutsuki joins Gehirn.\nIn 2004, Yui dies after volunteering to be the subject of a contact experiment with a mecha called Evangelion 01. Gendo, after a period of mourning, proposes the Human Instrumentality Project to Fuyutsuki. In 2005, Naoko's daughter Ritsuko Akagi meets Misato and Kaji at Tokyo-2 University. After joining Gehirn with Misato, Ritsuko discovers her mother and Gendo are in a romantic relationship. One day in 2010, Gendo brings a young girl named Rei Ayanami into Gehirn. Naoko, after completing the Magi supercomputers, finds Rei alone and lost in Gehirn's base; Rei starts calling Naoko \"old hag\", saying it was Gendo who referred to her that way. Naoko recognizes in Rei the somatic features of Yui; she strangles and kills Rei and then commits suicide. After Naoko's death, Gehirn is restructured and renamed Nerv.\nIn the present, Kaji frees Fuyutsuki and is then killed by Seele. Misato is released and returns home to discover a message on her answering machine, in which Kaji says goodbye to her. Devastated over Kaji's death, Misato breaks down in tears and Shinji Ikari, her housemate, hears her but fails to give her words of comfort. Shinji acknowledges he does not know what to do and that he is still a child.\nProduction\nGenesis and staff\nNeon Genesis Evangelion main director Hideaki Anno and Akio Satsukawa wrote the screenplay for \"He was aware that he was still a child\", while Hiroyuki Ishido directed the episode. Junichi Sato wrote the episode's storyboard under the pseudonym Kiichi Hadame, with Satoshi Shigeta as the animation director. The production involved other studios besides Gainax, such as at Vega Enterteinment and Tatsunoko Color Center.\nIn 1993, Gainax wrote a document introducing its new planned series called , which already contained a synopsis of the episodes. In the original plan, the twentieth episode was to be titled \"The Birth of Nerv\". In the episode, Eva-05 would have been sent to the Nerv of Germany, and the history of Gendo, the Evas, and Nerv would have been presented. The original project for the episode included an in-depth look at an event called the Dead Sea Evaporation, which occurred fifteen years before the main events of the series. Kaji's death was planned to occur in the previous episode, \"A Man's Battle\". For the Dead Sea Evaporation, the series staff took inspiration from Gainax's previous work Nadia: The Secret of Blue Water; in the last episode of which the show's main antagonist becomes a salt statue, like Lot's wife in the Book of Genesis account of Sodom and Gomorrah. Adam would also be discovered in the Dead Sea, while in the final version the setting is Antarctica, keeping the idea of using Seele's Dead Sea Scrolls. The basic idea of using the Dead Sea, a highly saline body of water with no fish, as a setting was retained, representing Antarctica as a hostile environment for life, including microorganisms.\nIn the initial scenario, the Angels were supposed to be security devices left scattered around the world by an alien , which was never mentioned in the version that aired. Gainax also wrote a draft for the twenty-first episode of the series which included a line from Misato saying: . Gualtiero Cannarsi, editor of the first Italian edition of the series, compared the initial scenario proposed by Gainax to that of James P. Hogan's Giants series, itself influenced by Arthur C. Clarke's short story The Sentinel. In the initial scenario, in fact, the Angels attacking Tokyo-3 would have been Adam's divine sentinels woke up after Adam's discovery, but Gainax later changed its plans. Writer Virginie Nebbia compared the First Ancestral Race idea and the concept of merging extraterrestrial life with birth of human race to Nadia, which already presented a similar scenario. Gainax later reused the idea of a First Ancestral Race for the videogame Neon Genesis Evangelion 2.\nIn the episode's original script, the first Rei clone, who in the final version is strangled and killed by Naoko, survives and awakens in a Nerv control room. The Proposal document does not mention the Katsuragi research group with which Misato goes to Antarctica, nor Misato's past, while in the final version it is revealed Misato suffered and later recovered from aphasia but not how she recovered. The original scenario also mentions a discovery of ancient ruins at a place named ; according to the academic Taro Igarashi, Arqa ruins possibly become Nerv's base in the final script, which Fuyutsuki describes as a perfectly round cave. For Igarashi, this means the geofront is \"some sort of ancient ruin\" itself. The Institute for Artificial Evolution was supposed to be located in the underground geofront, home of Nerv, while in the final version, its headquarters is moved to the shores of Lake Ashi. The institute was conceived as an entity still active in 2015 that is independent of Nerv, rather than as a predecessor organization to Nerv, like Gehirn. The presentation document describes the Human Instrumentality Project as an attempt to acquire godlike power and a forbidden fruit; according to Evangelion Chronicle, an official encyclopedia on the series, this description alludes to \"scientific arrogance\". Instrumentality was supposed to recreate a perfect being, freeing man from original sin and curses; according to Evangelion Chronicle, the perfect being in the original scenario could relate to the character Rei Ayanami. The Proposal document also mentions Gendo runs the Human Instrumentality Project, but in the final version it is unclear whether the project is his idea or not. Lorenz Keel is introduced before Fuyutsuki, which shows his importance to the Gainax's original scenario. Fuyutsuki's introduction page, on the other hand, is simple and there is no mention of his past with Gendo.\nDevelopment\nThe production of \"He was aware that he was still a child\" and other episodes in the second half of Evangelion experienced several problems, mainly due to production schedules. Due to time constraints, the version originally broadcast on TV Tokyo had poorer-quality animation than usual, and the episode's script was written in a hurry. From the twenty-first episode onward, Gainax inserted few scenes featuring Evangelion units because there were no animators who could animate them. The main staff felt so tired that some members suggested stopping the production. The promise to give the series' viewers more fan service in post-credit previews of future episodes, was abandoned, reflecting a more-violent and darker plot for the last episodes. Anno also decided to depict the members of Seele as a monolith, reflecting the progress of the series, which became increasingly abstract and introspective. Anno stated due to the pressure he felt during production, he immersed himself in increasingly deeper introspection.\nSeveral scenes in the twenty-first-to-twenty-fourth episodes were redrawn after the series finished its broadcasts on TV Tokyo, and Anno tried to rework the parts that did not meet his expectations as much as possible. The changes improved the quality of the animation, and clarified some mysteries and underexplored plot points. Gainax produced both the original television broadcast of \"He was aware that he was still a child\" and the following three episodes, and an extended version called the director's cut. or home video release version. Gainax also produced a feature-length recap film called Neon Genesis Evangelion: Death and Rebirth (1997), the first part of which, Death, is a summary of the series with unreleased scenes. The unreleased scenes from Death were used in the director's cut versions of the episodes, which were later released in the Japanese editions of the series, starting with the 1998 LaserDisc edition. Junichi Sato returned to work on the episode, creating the storyboard for the director's cut version of \"He was aware that he was still a child\". Masahiko Otsuka and Shunji Suzuki handled the staging, with Suzuki as the chief animator. The animator Mitsuo Iso also contributed to the scenes in the extended version.\nIn the director's cut version of \"He was aware that he was still a child\", the staff added the scenes in which Fuyutsuki is working on a boat as an improvised doctor, investigates the Second Impact, meets Yui at the Artificial Evolution Laboratory, and argues with Yui about the transience of life on the shore of Lake Ashi. Sequences of scientists in Antarctica during the Second Impact were presented in Death and later merged into the director's cut. Sato originally drew the scene of Fuyutsuki and Yui for television airing; this was later reworked and included in the director's cut version. Sato did not receive precise directorial directives from Anno; for example, he did not know how the research ships sailing to the South Pole in Gendo's and Fuyutsuki's scene in Antarctica were built, so they had to tell him how to represent them. Furthermore, during the first television broadcast, fans speculated Misato killed Kaji at the end of the episode, when he is killed by unidentified people sent by Seele instead, as confirmed by Evangelion staff. To remove ambiguity and not let viewers think the killer is Misato, Anno and Gainax edited the final sequences of the director's cut version.\nFor \"He was aware that he was still a child\", following the lead of previous episodes, Gainax used scenes with fake newspaper clippings, real black-and-white photographs, and sketches of characters from the series. Evangelion Chronicle said in the episode, the scenes set in 2015 use dull colors while the scenes from Fuyutsuki's past use bright colors, linking this device to Fuyutsuki remembering the scenes as a past that is not yet fully closed. The voice actress Megumi Hayashibara, who plays Rei Ayanami, also played Yui Ikari in the episode, reflecting Rei's biography, who since the Proposal document has been thought of as a clone of Yui. For the television version's closing theme, Gainax used a version of \"Fly Me to the Moon\" called \"Normal\" that was performed by Yoko Takahashi, while for the director's cut version an instrumental version of the song called \"4 Beat\" was used.\nCultural references\n's 2001: A Space Odyssey monoliths (pictured)]]\nAccording to the writer Dennis Redmond, the character of Naoko Akagi is modeled after William Gibson's novel Neuromancer character Marie Tessier-Ashpool. In the scene in which Seele interrogates Fuyutsuki, the members of Steele are presented as monoliths, a reference to the monoliths in Stanley Kubrick's movie 2001: A Space Odyssey (1968) and Arthur C. Clarke's short story The Sentinel. According to Wired magazine, Neon Genesis Evangelion shares with 2001: A Space Odyssey the theme of human evolution and the discovery and investigation of a prehuman civilization \"whose power men seek to harness at the cost of their survival\". Seele believes humanity must evolve at all costs, which is what 2001: A Space Odyssey monoliths allow. According to the Japanese academic Yasutaka Yoshimura, the reference to the monoliths in 2001 is just one of many references in the series to 1960s design. The series staff also compared Seele to Freemasonry.\nYūichirō Oguro, editor of the unofficial extra materials from the Japanese home-video editions of Neon Genesis Evangelion, noted Nerv is similar to SHADO, an organization in the British television series UFO; the episode also recalls the \"Confetti Check A-O.K.\" episode of UFO, in which Commander Straker recalls the founding of the organization. In one scene from the episode, during Fuyutsuki's reminiscences, it is revealed he taught metaphysical biology or metabiology at a university. The name is a reference to the branch of philosophy called metaphysics, whose designation comes from a book of the same name by the Greek philosopher Aristotle.\nIn the scene in which Naoko and Gendo introduce the Evangelions to Fuyutsuki, they describe Evangelion units as beings from the first Angel, Adam. The line is a reference to the Old Testament's Book of Genesis, according to which Eve was created by Adam. Adam is depicted as a giant equipped with wings of light. The writers and academics Víctor Sellés de Lucas and Manuel Hernández-Pérez have linked Adam's luminescent wings to the Christian iconography of angels. Mariana Ortega of Mechademia described the show's Adam as a \"Gnostic-inspired giant of light\". The writer Virginie Nebbia linked Adam's appearance to that of a giant of light that appears in the Ultraman 80 tokusatsu series, while the academic Marc MacWilliams said Evangelion Adam is represented like \"in Kabbalistic texts before his Fall\".\nIn the episode, Fuyutsuki describes 2001, the year following Second Impact, as a \"hell\". The writer Fabio Bartoli has linked Adam's re-enactment to the biblical Fall of man and Flood stories, and ideas about extra-terrestrial contact with pre-historic human cultures, according to which human evolution can be traced to the intervention of alien life forms. According to Bartoli, the Second Impact would have occurred as a result of an attempt by scientists to unite the biblical fruit of life with the fruit of knowledge by implanting Misato's human genes into Adam, a further reference to the Book of Genesis. As a result of the catastrophe, the waters of the South Pole turn red and are covered with columns of salt. Comic Book Resources' Theo Kogod compared the melted sea of Antarctica to the Book of Revelation, in which the sea is turned red as blood. The pillars of salt are a reference to the Bible's Sodom and Gomorrah, and the transformation of Lot's wife into a statue of salt. In the real world, it is believed Sodom and Gomorrah were located near the southern end of the Dead Sea, which is prohibitive for aquatic life due to its extremely high salinity.\nIn the opening scene of the director's cut version, the scientists of the Katsuragi expedition mention the Guf chamber, a foreshadowing of a concept that is presented more fully in \"Rei III\" and the 1997 film The End of Evangelion. The chamber's name is a reference to the Guf, a space in Jewish mythology where souls reside before their earthly incarnation. According to writer Kazuhisa Fujie, from the information given by Ritsuko Akagi and other scenes of the series, two Guf's cambers exist in Evangelion. One Guf's chamber was opened by Adam during Second Impact, while the other is opened by Angel Lilith during Third Impact in The End of Evangelion. Mariana Ortega linked Yui Ikari to the Sophia of Gnosticism because of \"her intellectual brilliance, maternal wisdom\", and status as one of the founding members of Nerv. According to Ortega, the scene showing Yui with the child Shinji on the shore of Lake Ashi depicts her as a \"benign Madonna\".\nAccording to Dennis Redmond, in the episode \"the significant clue\" the geofront is not a human creation is given; the underground cavity of Nerv's future geofront is described as clearly artificial and left by \"someone else\". In the scene in which Fuyutsuki investigates the Second Impact, a screenshot depicting the underground cavity at the South Pole is depicted; the cavity is referred to as the White Moon and is analogous to the Black Moon under Hakone, Nerv's future geofront. According to the screenshot, it was \"possibly created at time of Giant Impact\". The Giant Impact, or First Impact, in the series is a collision between the Earth and a celestial body that would later form the Moon that occurred four billion years before the events of the series. In the video game Neon Genesis Evangelion 2, it is speified during the Giant Impact, the Black Moon, a vessel sent by a First Ancestral Race with Lilith inside, accidentally arrived on Earth and came into conflict with Earth's original inhabitants, Adam and its progeny. The scenario is a reference to the real giant impact theory, and Virginie Nebbia has linked it to the first Ultraman series, in which the eponymous hero and his enemy Bemular arrive on Earth aboard two orbs. Writer Patrick Drazen compared the First Impact scenario with the Shinto cosmology presented in the texts of the Kojiki and Nihon shoki and the Japanese myth on the origin of the world, according to which the cosmos was born from a primordial, chaotic, egg-like soup from which light and darkness were separated. The Spear of Longinus, on the other hand, has been compared with , the spear of the two creator kamis Izanagi and Izanami; according to the myth, the two creator deities formed the first island of the Japanese archipelago with the spear. Drazen, noting the Black Moon is placed on the Izu Peninsula, also interpreted the mythopoiesis of the series as a cosmogony according to which all human life on Earth springs from Japan, or a hi-tech version of Kojiki.\nThemes\n\"He was aware that he was still a child\", which opens the last story arc of the series, focuses on exploring the characters' intimate psychology, solving some narrative mysteries, and presenting new ones. It explores the creation of the Evas, the pasts of Misato, Ritsuko, and Naoko, and the relationship between Gendo, Fuyutsuki, and Yui. According to Allen Divers of Anime News Network, the exploration of the characters and their pasts \"has an outsider's feel\" because it follows the recollections of many of the minor characters rather than those of a major character like Gendo Ikari. According to Divers: \"there is a definite push to show that Gendo still hides more secrets than is shared here\". IGN said Gendo \"never receives any introspective soliloquies\" unlike the other characters. Evangelion Chronicle noted there are no scenes in which Gendo and Yui are seen together, emphasizing the distance between them. The Japanese architect and academic Taro Igarashi compared Evangelion narrative structure to that of David Lynch's series Twin Peaks, in which all segments of the narrative revolve around an absent character, Laura Palmer and the discovery of her corpse, similar to an \"empty center\" in the circle of the dramatic plot. Although Evangelion has a different structure from Twin Peaks, for Igarashi its center could be Gendo but it constantly oscillates. Yui's presence and absence can be seen as the empty center of the series' narrative; in Evangelion, all traces of Yui, including her dead body and photographs, are erased and \"the continuing search for this erased mother figure\" is the story's driving force.\nAccording to the Japanese critic Akio Nagatomi, \"He was aware that he was still a child\" marks \"the beginning of the end, and something that's most common in Japanese tragedies: deaths\". He noted, just as in traditional Japanese tragedy, almost all secondary characters die until only the main characters remain in the episode. According to Evangelion Chronicle, Nerv is portrayed as a mysterious organization that is difficult to trust in this episode, following and amplifying the trend the anime series Mobile Suit Gundam began. In 1979, Mobile Suit Gundam proposed a scenario questioning the classic model of good and righteous characters versus bad characters. Misato's past and her aphasia after Second Impact are also explored. Allison Keith, the character's first English voice actress, described Misato as a woman who is trapped at a childlike level and is \"defensive\" because she had to quickly grow up after the Second Impact.\n\"He was aware that he was still a child\" portrays the Eva-01 contact experiment in which Yui dies; according to Fabio Bartoli: \"She did this to allow her son to realize himself through others\". Yui is portrayed as a balanced, complete person who willing to give up her career to build a family. She can see a good side in Gendo, who she describes as a \"cute person\". Ortega said unlike the \"vampiric\" Naoko, who dies by suicide, Yui \"ultimately acts as the force of development and engenderment\", and her nature becomes the final sacrifice that allows \"the 'new genesis' promised in the title to come into being\". Fuyutsuki meets Yui for the first time and falls in love with her in the installment. In one scene, Fuyutsuki argues with Yui while playing with the baby Shinji, and he stares at her, looking at her thigh and part of her breast. According to the storyboard, Fuyutsuki looks at Yui with some disgust because Yui has given birth and is now vulnerable. The writer Virginie Nebbia interpreted the scene as a criticism of otaku fetishization of the female body and typical anime fan service, in which women are often victims of the male gaze.\nAccording to Nicole Veneto, writing for the website Anime Feminist, the episode suggests a discrepancy between Rei's biological age of 14 and her chronological age of 10, implying \"Gendo has some control over manipulating her growth\". In the opening scene of the director's cut version, Gendo and Lorenz Keel reflect on science and scientists, arguing they believe in themselves too much and seek truth for their self-affirmation because \"discovery is joy and understanding is dominance\". A weapon named the Spear of Longinus is also named. The academic Fabio Bartoli said Longinus' spear is closely related to concepts of desire and dominance in the series; the scientists in Antarctica stick the spear into Adam in the same scene, and in later episodes, Gendo describes it as an obstacle to his desires. Igarashi said Evangelion persistently repeats the theme of copies and cloning: for example, Eva-01's and Rei's clones replace Yui; Ritsuko takes over her mother Naoko's work, which is replaced by the three Magi computers; and both Ritsuko and her mother are Gendo's lovers, replacing Yui. Naoko is portrayed as a brilliant and successful scientist who admits she can still be \"replaced\" in the episode. The Japanese academic Keisuke Tada said the episode summarizes a typical pathological feature of Evangelion characters, who are rewarded for their abilities but remain over-concerned with others' expectations.\nReception\n\"He was aware that he was still a child\" was first broadcast on February 21, 1996, and drew a 7.7% audience share on Japanese television. In July 2020, Comic Book Resources reported an 8.6/10 rating for the installment on IMDb, making it the sixth-highest-rated Evangelion episode. Gainax also released official merchandise based on the episode, including a line of official tee-shirts.\nSome reviewers, while still praising the episode, were divided on the use of flashbacks and characterization. Akio Nagatomi of The Anime Café praised the episode for its music, the performances of the voice actress Kotono Mitsuishi performance as Misato in the final scene, and the direction, particularly the use of flashbacks. According to Nagatomi, \"the direction is very tight, and the quick cuts to various scenes are skillfully interwoven with the main storyline that the viewer receives the background information, without getting confused in timelines\". Nagatomi also said Evangelion does a good job of introducing interpersonal relationships between characters, but the characterization is superficial and two-dimensional, and the show is reluctant to yield information and it does so in almost-frustrating ways. Kenneth Lee of Anime News Network criticized the use of flashbacks and lamented the lack of clear explanations of plot elements, such as Yui's death and Misato's aphasia. Max Covill of Film School Rejects also criticized the excess of information but wrote the episode \"is a fascinating look into the lives of the many supporting characters in the series pre-Nerv\".\nOther reviewers praised \"He was aware that he was still a child\". Dennis Redmond described the scene in which Misato discovers Kaji's death as \"heartbreaking\". Alex Walker, writing for Kotaku, ranked \"He was aware that he was still a child\" among the best episodes of Neon Genesis Evangelion, saying that the scenes in which Kaji talks to his killer and Misato begins to cry upon discovering his death are among the \"most iconic scenes in the series\". DVD Talk noted the episode's plot is sometimes difficult to follow because of the time jumps, but said it \"successfully pushes the series into high gear as the finale approaches\". In its review of the home video release of \"He was aware that he was still a child\" and the following episode \"Don't Be\", GameFan described the in-depth exploration of Nerv's origins as the most interesting part of the volume. Digitally Obsessed described the insights into Ritsuko, Misato, and Kaji as \"intriguing (and perhaps shocking)\".\nReferences\nCitations\nBibliography\n* }}\n* }}\n*\n*\n* }}\n*\n*\n*\n*\n*\n*\n*\n*\nExternal links\n*"
    }
  ]
}