{
  "content": [
    {
      "type": "text",
      "text": "# Head of the Republic of Dagestan\n\nThe Head of the Republic of Dagestan is the highest official and the head of the executive power of the Republic of Dagestan. The Head is Dagestan’s Head of State and Head of Government.\nThe Head of Dagestan’s duty is to ensure compliance with the Russian Constitution and federal laws and the Constitution and laws of the Republic of Dagestan, as well as the equality of nations and the rights and freedoms of man and citizen, and the preservation of the unity and territorial integrity of the Republic of Dagestan. The Head of the Republic can not be a person aged under 30.\nThe term of office is four years. The position is appointed by the People's Assembly of the Republic of Dagestan.\nSince 5 October 2020, the position of Head of the Republic of Dagestan has been held by Sergey Melikov.\nHistory of office\nSince 1994, the State Council of the Republic of Dagestan was the highest executive body in the region, which was elected by the Constitutional Assembly and which included representatives of 14 \"main\" Dagestani ethnic groups. Magomedali Magomedov was elected chairman of the State Council three times, in 1994, 1998 and 2002.\nIn 2003, a new Constitution of Dagestan was adopted, in which the post of President was introduced. The first direct presidential elections were to take place in 2006, after the end of Magomedov's third term. At the same time the State Council of Dagestan should have been disestablished. However, in December 2004, at the initiative of the President of Russia Vladimir Putin, the elections of regional leaders were replaced with appointment by the legislative bodies on the proposal of the President of Russia.\nIn July 2011, the People's Assembly of Dagestan supported amendments to the constitution, changing the title of the highest office from President to Head of the Republic. The law came into force on January 1, 2014.\nIn May 2012, at the initiative of outgoing Russian president Dmitry Medvedev, a federal law was adopted returning the direct elections of heads of regions, which came into force on June 1. In June 2012, the People's Assembly of Dagestan adopted a law “On elections of the President of Dagestan”, according to which the president is elected by direct popular vote, but self-nominated candidates cannot take part in elections, and party candidates must overcome a 10% municipal threshold.\nOn 23 January 2013, the early resignation of the President Magomedsalam Magomedov took place. Five days later Vladimir Putin appointed Ramazan Abdulatipov as acting president of Dagestan, who was previously speaker of Russia's upper house of parliament in early 90s.\nOn April 1, Abdulatipov said that Dagestan may cancel direct presidential elections. In his opinion, the election will most likely held within the parliament. At the same time, Abdulatipov stated that he himself supports holding direct elections and is ready to run. On April 18, the People's Assembly in favor of indirect elections. Thus, Dagestan became the first Russian region to cancel direct election of its leader. Then the deputies of the People's Assembly decided that to vote on candidates for the presidency, they will gather at an extraordinary session on the regional election day (September 8). Abdulatipov was supported by 86 from 88 members of the Assembly.\nOn 3 October 2017, Russian president Vladimir Putin appointed Vladimir Vasilyev as the interim head of the Republic of Dagestan. On 9 September 2018 Vasilyev was elected as the head of Dagestan by the People's Assembly. Vasilyev had launched a wide anti-corruption campaign in the region. From 28 May 2018 until his retirement, he was the oldest from the federal subjects' leaders.\nIn October 2020 Vasilyev was replaced with Sergey Melikov, former Presidential Envoy in North Caucasus.\nList\nChairman\n{| class=\"wikitable\" style=\"text-align:center;\"\n|-\n! rowspan=2|\n! rowspan=2| Portrait\n! rowspan=2| Name(Born-Died)\n! colspan=3| Term\n! rowspan=2| Political Party\n|-\n! Took office\n! Left office\n! Time in office\n|-style=\"text-align:center;\"\n! colspan=9| Chairman of the Supreme Council\n| alt_party         = Independent politician\n}}\n|-style=\"text-align:center;\"\n! colspan=9| Chairman of the State Council\n| alt_party         = Independent politician\n}}\n|}\nPresident\n{| class=\"wikitable\" style=\"text-align:center;\"\n|-\n! rowspan=2|\n! rowspan=2| Portrait\n! rowspan=2| Name(Born-Died)\n! colspan=3| Term\n! rowspan=2| Political Party\n|-\n! Took office\n! Left office\n! Time in office\n| alt_party         = Independent politician\n}}\n| alt_party         = United Russia\n}}\n| alt_party         = United Russia\n}}\n| alt_party         = United Russia\n}}\n|}\nHead\n{| class=\"wikitable\" style=\"text-align:center;\"\n|-\n! rowspan=2|\n! rowspan=2| Portrait\n! rowspan=2| Name(Born-Died)\n! colspan=3| Term\n! rowspan=2| Political Party\n|-\n! Took office\n! Left office\n! Time in office\n| alt_party         = United Russia\n}}\n| acting            = y\n| alt_party         = United Russia\n}}\n| alt_party         = United Russia\n}}\n| acting            = y\n| alt_party         = Independent politician\n}}\n| alt_party         = Independent politician\n}}\n|}\nTimeline\nColors =\nid:independent value:gray(0.8) legend:None_(Independent)\nid:ur value:rgb(0.20,0.40,0.79) legend:United_Russia\nid:gray1  value:gray(0.85)\nid:gray2  value:gray(0.95)\nDateFormat = dd/mm/yyyy\nPeriod     = from:23/04/1990 till:$today\nTimeAxis   = orientation:horizontal\nScaleMajor = unit:year increment:5 start:1995\nScaleMinor = unit:year increment:1 start:1991\nLegend     = columns:1 left:150 top:35 columnwidth:170\nTextData =\npos:(20,38) textcolor:black fontsize:M\ntext:\"Political party:\"\nBarData =\nbar:1Magomedov\nbar:Aliyev\nbar:2Magomedov\nbar:Abdulatipov\nbar:Vasilyev\nbar:Melikov\nPlotData =\nwidth:5 align:left fontsize:9 shift:(5,-4) anchor:till\nbar: 1Magomedov\nfrom: 23/04/1990 till: 20/02/2006 color:independent text:\"Magomedali Magomedov\"\nbar: Aliyev\nfrom: 20/02/2006 till: 20/02/2010 color:independent text:\"Mukhu Aliyev\"\nbar: 2Magomedov\nfrom: 20/02/2010 till: 28/01/2013 color:ur text:\"Magomedsalam Magomedov\"\nbar: Abdulatipov\nfrom: 28/01/2013 till: 03/10/2017 color:ur text:\"Ramazan Abdulatipov\"\nbar: Vasilyev\nfrom: 03/10/2017 till: 05/10/2020 color:ur text:\"Vladimir Vasilyev\"\nbar: Melikov\nfrom: 05/10/2020 till: $today color:independent text:\"Sergey Melikov\"\n}}\nReferences\nSources\n* [http://www.worldstatesmen.org/Russian_republics.htm Russian Administrative divisions]"
    }
  ]
}