{
  "content": [
    {
      "type": "text",
      "text": "# Headquarters North East (United Kingdom)\n\n| branch                        =\n| type                          = Regional Point of Command\n| command_structure             = Regional Command\n| nickname                      =\n}}\nHeadquarters North East was a regional point of command based in North East England and Yorkshire and the Humber. The command administered the reserve units based in its area and also provided the military support HQ for the police and civilian population in the area.\nHistory\nUnder Army 2020, 4th Infantry Brigade merged with 15th Infantry Brigade in 2015. The latter became \"Headquarters North East\", which was the point of contact for the counties of Northumberland, Tyne and Wear, County Durham, North Yorkshire, East Yorkshire, West Yorkshire and South Yorkshire. Under the Army 2020 Refine reorganisation, 4th Infantry Brigade and Headquarters North East remained responsible for reserve units in the north east of England.\nOn 1 August 2024, the unit merged with Headquarters North West to form Headquarters North.\nStructure\nHeadquarters North East\n* Headquarters North East, at Peronne Lines, Catterick Garrison\n** Yorkshire Officer Training Regiment (Army Reserve)\n*** Leeds University Officers' Training Corps (Army Reserve), at Carlton Barracks, Leeds\n*** Sheffield University Officers' Training Corps (Army Reserve), at Somme Barracks, Sheffield\n*** Northumbrian University Officers' Training Corps (Army Reserve), in Newcastle upon Tyne\n** 4th Infantry Brigade & Headquarters North East Cadet Training Team, at Queen Elizabeth Barracks, Strensall\n*** Cleveland Army Cadet Force, in Middlesbrough\n*** Durham Army Cadet Force, in Chester-le-Street\n*** Humberside and South Yorkshire Army Cadet Force, at Driffield Camp, Driffield\n*** Northumbria Army Cadet Force, at Fox Barracks, Cramlington\n*** Yorkshire (North and West) Army Cadet Force, at Queen Elizabeth Barracks, Strensall\nReferences\nExternal links\n* [https://britisharmedforcesreview.files.wordpress.com/2019/08/army-2020-refine-orbat-6.pdf Army 2020 Refine Order of Battle]"
    }
  ]
}