{
  "content": [
    {
      "type": "text",
      "text": "# Heart of the Civil War Heritage Area\n\nThe Heart of the Civil War Heritage Area is a geographical location recognized by the Maryland Heritage Areas Program. It is one of the thirteen state heritage areas administered by the Maryland Historical Trust. This area includes the Antietam National Battlefield and several other important American Civil War sites in Maryland. Parts of Maryland's Carroll, Frederick and Washington counties are included in the Heritage Area.\nMaryland's Civil War history\nAs a border state, many Maryland residents (particularly those in the Baltimore area, planned to join the Confederacy. However, imprisonment of those favoring secession and Federal occupations of Maryland cities prevented secession. Western Maryland and Central Maryland for the most part remained loyal to the Union.\nFor example, the 'Heart of the Civil War' document states:\nDuring the summer of 1861, the Maryland General Assembly met in Frederick, which was at the time the largest city in Maryland not under Federal occupation. This legislative body was dominated by pro-secession delegates, and as talk of secession increased throughout the summer, many delegates were eventually arrested on orders from the pro-Union governor of Maryland to prevent the Assembly from voting.\nHeart of the Civil War Heritage Area Exhibit and Visitor Center\nThe Heart of the Civil War Heritage Area Exhibit and Visitor Center is located in Sharpsburg, Maryland in the Newcomer House at Antietam National Battlefield.  The Center features interpretive exhibits focus on heritage area themes: On the Home Front, in the Heat of Battle, and Beyond the Battlefield, and panels feature sites where these themes may be explored. Tourism materials including brochures, Civil War Trails map guides, area visitor guides and other materials are available.\nReferences\n* [https://web.archive.org/web/20080512090633/http://www.heartofthecivilwar.org/documents/heartofcivilwar.pdf Heart of the Civil War]\nExternal links\n* [http://www.heartofthecivilwar.org Heart of the Civil War] - official site\n* [http://www.newcomerhouse.org/ Newcomer House]  - Heart of the Civil War Heritage Area Exhibit and Visitor Center\n* [https://mht.maryland.gov/Pages/MHAA/heritage-areas.aspx Maryland Heritage Areas Website]"
    }
  ]
}