{
  "content": [
    {
      "type": "text",
      "text": "# Heart Warming\n\n| founder     = John T. Benson Jr.\n| status      =\n| distributor =  -->\n| genre       =  -->\n| country     = U.S.\n| location    = Nashville, TN\n| url         =\n}}\nHeart Warming was a gospel record label started by  John T. Benson Jr. Heart Warming and their chief rival Canaan Records (owned by Word Records) were arguably the two biggest and best gospel labels in their time. The Oak Ridge Boys, J.D. Sumner and the Stamps Quartet, Jake Hess & The Imperials, Dottie Rambo, Bill Gaither Trio and Speer Family all signed to it and had many recordings on it. The Cathedral Quartet produced two of their most popular albums on it With Brass and With Strings.\nProducers for the label included Bob Benson (John Benson's son), Bob MacKenzie, Bob Montgomery, and Don Light. Bob MacKenzie in particular produced some of the best gospel albums of that era and some of the best albums of the groups above.\nEventually the Benson company dropped the Heart Warming label instead having RiverSong be the southern gospel division and Impact Records and later Benson labels be their contemporary labels.\nFinally in 2006 it was announced that Heart Warming, along with RiverSong was sold to Homeland Entertainment Group, former President of Zondervan Music Group, Bob Jones Jr is part owner of the company.\nArtist Roster\nThis is an incomplete list of past and present artists that have recorded on this label\n* Jake Hess & The Imperials\n* Oak Ridge Boys\n* J.D. Sumner & The Stamps Quartet\n* Cathedral Quartet\n* Dottie Rambo\n* The Rambos\n* Speer Family\n* The Sego Brothers and Naomi\n* Hemphills\n* Bill Gaither Trio\n* The Deweys\n* Sharon Haygood\n*  Henry and Hazel Slaughter\n* [Terrific Tennesseans] Golden Favorites LPHF1739\n* The Kingsmen Quartet\n* The Happy Goodman Family\n* Rusty Goodman\nSee also\n* List of record labels\nReferences\nExternal links\n* [https://books.google.com/books?id=uqT-CJYcqskC&dq=heart+warming+records&pg=PA183 Encyclopedia of American gospel music by W. K. McNeil: Heart Warming Records]\n* [http://www.homelandentertainmentgroup.com/ Homeland Entertainment Group, Official Website]"
    }
  ]
}