{
  "content": [
    {
      "type": "text",
      "text": "# Heavy warmblood\n\n1898 lithograph depicting an Oldenburg horse, one type of heavy warmblood\nThe heavy warmbloods () are a group of horse breeds primarily from continental Europe. The title includes the Ostfriesen (\"East Friesian\") and Alt-Oldenburger (\"Old-Oldenburger\"), Groningen, and similar horses from Silesia, Saxony-Thuringia, and Bavaria. Breeds like the Hungarian Nonius, Kladruber, and Cleveland Bay are also often classed as \"heavy warmbloods.\" They are the ancestors of the modern warmbloods, and are typically bred by preservation groups to fit the pre-World War I model of the all-purpose utility horse. Unlike the registries of the sport horses that followed them, many heavy warmblood registries maintain closed or partly closed studbooks. However, external evaluation and performance testing of the breeding stock is still a key element in these registries. Many of the heavy warmbloods are selected primarily for family-friendly temperaments.\nCommon foundation\nEuropean horses in the Middle Ages could fall into several categories, though as a group they were likely common, small, and primitive by modern standards. There were small, hardy farm horses, smooth-stepping saddle horses, quicker \"coursers\", and a very few highly prized, powerful destriers. As the availability of firearms grew, heavily armored knights and their heavy mounts became impractical \"relics of the past.\"\nThe Spanish horses, ancestors of the Andalusian, the Danish Frederiksborg, and the Neapolitan horse were particularly popular among the German nobility during the 17th and 18th centuries. As they collected these stallions, the residents bred them to their native mares, setting a foundation we would identify today as \"baroque\". From this base of thick, primarily dark-colored horses, the Groningen, Friesian, East Friesian, and Oldenburg would eventually be born.\nOstfriesen and Alt-Oldenburger\nThe most famous of the heavy warmbloods was the Oldenburg. Today's Oldenburg is bred for sport, and so the old type is designated as such: Alt-Oldenburger. The history of the Oldenburg is almost indistinguishable from that of horses bred in nearby East Frisia. Though there are two names (Old-Oldenburg and East Friesian), the horse is quite the same, having always exchanged genetic material. The plow horses of the Frisian marshes had to be powerful to work through the heavy soil, and so were significantly heavier than farm horses in other parts of Europe. Organized horse breeding began in Oldenburg under Count Anton Günther (1603–1667), who brought popular stallions from Spain, Italy, Turkey, and Poland. Later on, Cleveland Bays were introduced as well, and the result was a solid, good-natured mare base from which came the Karossier.\nThe Karossier were considered luxury items, noble carriage horses with high-stepping gaits, and so they were purchased by State Studs for use in other regions of Germany, but were also sent to Poland, Austria and Hungary, France, Denmark, and the Netherlands. War and the appearance of the horse-powered tractor in the 20th century increased the demand for heavier horses, which Oldenburg and East Frisia supplied. By the 1960s, such horses were obsolete, and their breeders had to adapt. From these horses was born the modern Oldenburg, and the old types were in danger of disappearing.\nIn the 1980s a new preservation society was formed, and with the help of horses from Poland, Denmark, the Netherlands and Moritzburg State Stud, the breed was saved. Today there are 20 approved stallions and 160 broodmares, all primarily black or dark bay in color. They are powerful and sound, but very gentle horses.\nAlt-Württemberger\nIn 1866, the advisory board of the Principal and State Stud of Marbach presented a plan to breed an economical horse for Württemberg - a warmblood suitable for agriculture. While actively modeled after the popular Oldenburg, the original Württemberger, now known as the Alt-Württemberger (Old Württemberger), was influenced by Anglo-Norman and East Prussian stock, and occasional Arabian horse bloodlines were added as well. The goal was to produce a horse ideal for the \"Master and Farmer\", inexpensive to feed, diligent and powerful at the plow.\nOne hundred years after the first warmbloods were bred at Marbach, the direction changed from practical farm horse to high-performance sport horse. This horse became today's modern Württemberger. The original breed was saved by the formation of the Association for the Preservation of the Old-Württemberger Horses in 1988. Today there are 8 stallions and 55 mares, though the breed is receiving federal support. The brand is the hart's horn with three prongs on the left hip.\nLike other heavy warmblood breeds, the Alt-Wurttemberger is good-natured and affable, hard to unnerve but easy to motivate. They stand somewhat smaller than their riding horse counterparts, between 155 and 165 cm at the withers. They are predominantly bay, brown, chestnut, and occasionally grey. The head should be medium-sized, dry and expressive; the body of cob-type substance with a long shoulder and slightly-sloping croup. The hooves should be strong and hard. The breed is especially valuable as a leisure and family horse, given its easygoing nature and long lifespan.\nRottaler\nThe Rottaler was originally bred in the Rott valley of Bavaria, and was used as the foundation for the Bavarian Warmblood. Systematic breeding in the region dates back to 1558, when the first duke, Albrecht IV, imported popular Neapolitan and Spanish stallions. As a result of highly organized breeding efforts&nbsp;— the earliest exterior evaluations directed breeding and prizes or \"premiums\" were offered to bribe breeders not to export the best horses&nbsp;— by the 1800s visitors took great notice of the Rottal horses.\nIn keeping with the times, Rottalers were expected to be versatile enough to pull the plow during the week and the carriage to church on Sundays. Throughout the 19th century, Anglo-Norman, Cleveland bay and Oldenburg horses were imported to keep the Rottaler vibrant, and by 1906 the Rottaler Warmblood Horse Breeding Association was formed. In 1963, the breeding aim was redirected towards the production of more agile, sensitive riding horses, and the brand was changed from \"R\" to \"B\". The Rottaler mares were bred to Hanoverians and Westphalians, and over successive generations, the breed threatened to disappear forever. It wasn't until 1991 that the Rottaler was re-established within the Bavarian association, and by that time there were scant few lines left. However, what struck the spectators at the first inspection of Rottaler mares in 1994 was the vitality of the mares, which had an average age of over 15.\nToday there are only a few Rottalers left, but about 20 breeders in Bavaria are actively preserving the breed and the breed receives federal support. Rottalers are similar to the other heavy warmbloods in type, though due to consistent use of Arab blood, they have more refined heads. They are excellent all-purpose ride-and-drive horses, with sufficient talent in dressage and jumping. They are promoted as a good choice for vaulting horses.\nHeavy Warmbloods in Saxony and Thuringia\nWhile the heavy warmbloods of the north-west and south have distinct identities, these horses were bred all over Germany and well-beyond. One stronghold for heavy warmbloods has been Moritzburg, the State Stud that serves Saxony and Thuringia. During the last quarter of the 19th century and the first quarter of the 20th century, two-thirds of the state stallion roster was made up of Oldenburg sires. The descendants of these stallions were saved from mandatory castration by State Equerry Dr. Herta Steiner, and through her efforts and those of dedicated breeders, the heavy warmbloods were saved. The blood proved to be vitally important, as these horses were used to improve the stock elsewhere.\nWhile the primary registries are the Horse Breeders' Associations of Saxony-Thuringia and Saxony-Anhalt and Thuringia, this studbook has proven to be the most liberal, accepting heavy warmbloods registered in Westphalia, Baden-Wurttemberg, Weser-Ems, Bavaria, and Berlin-Brandenburg. The goal of this policy is to identify and promote any and all remaining heavy warmblood horses. The heavy warmblood makes up 15-25% of the horse population in Saxony and Thuringia, which attests to the program's efficacy. As of 2005 there were 51 stallions and 1140 mares.\nThe registry institutes the same studbook inspection process, aiming for a powerful, elegant horse about 15.2hh with an active, efficient trot, longevity, soundness, and an even temperament. While greys and chestnuts are permitted, discretely marked black, brown, and dark bay horses are preferred. Heavy warmbloods bred at Moritzburg are just as suitable for driving and leisure as those bred elsewhere.\nGroningen\nThe Groningen horse was originally bred in the Groningen region of the Netherlands to perform agricultural work in the heavy soil. They were influenced by the other heavy warmblood breeds of Frisia: Ostfriesen, Oldenburgers, and Holsteiners. From 1897 to 1942 they were managed by the Gronings Paardenstamboek (\"Groninger Studbook\" abbreviated GrPs), after which time they were united with the rather lighter Ostfriesen in the North-Netherlands Warmblood Horse Studbook (NWP). In 1969 the NWP merged with the Gelderlander breeding society to form the KWPN, or Royal Warmblood Horse Studbook of the Netherlands. Dutch horses would thenceforth be bred as competitive riding or driving horses.\nGroningen mares were successively crossed with Anglo-Norman, Holsteiner, and Hanoverian horses to produce a more refined riding horse, today's Dutch Warmblood. The original Groningen would have been lost but for the efforts of a few breeders and enthusiasts. A private association, \"Het Groninger Paard\" or The Groningen Horse, was formed in 1982 and recognized by royal decree in 1985.\nToday there are 25 stallions and over 400 mares, most of which are black, brown, or dark bay. There are rather fewer light bays, even fewer chestnuts, and a handful of greys, sabinos, and tobianos. Groningen horses are known for their steady temperaments, longevity, and low-maintenance constitutions.\nGelderlander\nThe Gelderlander was originally bred in the Gelderland region of the Netherlands. Although geographically close to Groningen, the soil in Gelderland is much sandier and does not require a horse with the same power as the Groningen horse. While breeders in Groningen used other horses bred on the heavy Frisian soil - the Alt-Oldenburger, East Friesian, and Holsteiner - those in Gelderland more often used half-bred French stallions as outcrosses. Therefore, Gelderlanders were and remain significantly longer-legged than their northern cousins, though they have the same high-set necks and level toplines.\nIn 1964, the VLN, which managed the Gelderlander studbook, formed a \"Sportregister\" in hopes of accelerating the Gelderlander towards a more marketable riding horse type. The successive merger with the NWP in 1969 - forming the Royal Warmblood Horse Studbook of the Netherlands or KWPN - further convoluted the identities of the Gelderlander and Groningen. After a few years, the breeding direction for foundation horses was dissolved and the Gelderlander would have been entirely absorbed into the new Dutch Warmblood and Dutch Harness Horse.\nThe KWPN oversees the breeding of Gelderlander horses today. There are 12 approved sires in the Netherlands. Unlike most of the other heavy warmblood breeds, the Gelderlander is overwhelmingly chestnut with a great deal of white. As they were lighter horses to begin with, there are many Gelderlander and part-Gelderlander horses with exceptional performance in dressage, show jumping and combined driving. Of course, the descendant of Gelderlanders, the Dutch Warmblood, is a dominant force in sport. The Gelderlander is considered to be a more amateur-friendly horse.\nSee also\n*Warmblood\n*Sport horse\nReferences"
    }
  ]
}