{
  "content": [
    {
      "type": "text",
      "text": "# Heinz Warneke\n\nHeinrich Johann Dietrich \"Heinz\" Warneke (June 30, 1895 – August 16, 1983) was a German-born American sculptor, best remembered as an animalier, or sculptor of animals. His role in the direct carving movement \"assured him a place in the annals of 20th-century American sculpture.\"\nWarneke created a large number of works for the National Cathedral in Washington, D.C. These include the Last Supper Tympanum over the South Portal, the Saint Alban trumeau figure, and more than ninety minor works: sculpted column capitals, bosses, corbels, keystones, heads, flowers, etc. The Prodigal Son (1932-39), one of his most touching sculptures, is located in the Bishop's Garden.\nWarneke's works are in the collections of American art museums, including the Smithsonian American Art Museum, the Art Institute of Chicago, the Whitney Museum of American Art, and the Chrysler Museum of Art. His animal sculptures are in the National Zoo and the Philadelphia Zoo, and in sculpture gardens such as Brookgreen Gardens.\nWarneke's most famous work is the Nittany Lion (1942) at Pennsylvania State University.\nLife and career\nWarneke was born in Hagen bei Leeste, a small village near Bremen, Germany. He studied at the Academy of Fine Arts in Berlin, Germany, where his teachers included Karl Blossfeldt.\nWarneke served in the German Army, but was a non-combatant in World War I&mdash;managing a cemetery in Bucharest, Romania from 1914 to 1918. He oversaw the mostly-Turkish prisoners of war who were brought in to dig graves and carve headstones.\nIn 1923, Warneke emigrated to the United States at New York City, and settled in St. Louis, Missouri.\nUnited States\nWarneke had his first American exhibition at the St. Louis Public Library, in December 1923. The works were small-scale animal figures, that the St. Louis Post-Dispatch pronounced \"extraordinary.\" According to a 1935 biographical sketch published by the U.S. Treasury Department: “His first work in America was a large stone  eagle, 48 feet across the façade of the Masonic Temple in Fort Scott, Kansas.”\nFrom 1927 to 1930, Warneke lived in Paris, where he created social-realist, art-deco, and primitivist sculptures. He became a naturalized citizen after returning to the U.S. in 1930, and undertook multiple commissions for the Works Progress Administration.\nWarneke operated his own art school in New York City, 1940-42. After winning first prize at the Corcoran Gallery of Art's 1943 Artists Annual Show in Washington, D.C., he became head of sculpture at the Corcoran's school. From 1943 to 1968, he taught at both the Corcoran school and George Washington University, also in Washington, D.C.\nMethod\nIn addition to carving in traditional media, such as wood, stone and ivory, Warneke carved in unusual media, such as iron, brass and aluminum, and even common brick. Photographs of his carved brick sculptures illustrate Richard F. Bach’s 1928 article, “Our Industrial Art: Manufacture and Mechano-facture,” in the Journal of the American Institute of Architects.\nWith all of the brass and iron models, Mr. Warneke explains, the method of working is the same. First a rough plaster cast is given to the foundry. When a crude sketch in brass is returned to the artist he begins to carve it, first simplifying the larger planes, and then, with tools finer than the rasp or large file used before, modeling the ultimate surface. It is actually a work of carving, for the first rough block is merely a larger, vaguer piece of metal, yet is better adapted to the speed of the work than a square chunk would be.\nWarneke created works of unprecedented scale and weight, such as his life-sized African Elephant and Calf (1962) for the Philadelphia Zoo.\nPersonal\nWarneke emigrated to the United States in 1923, and lived with friends of relatives in the large German-American community in St. Louis, Missouri. Edward T. Hall, one of Warneke's first benefactors, was an executive at Purina Mills (pet & livestock food) in St. Louis, and commissioned him to create animal sculptures as prizes for a company contest.\nWarneke met and fell in love with Hall's wife, painter Jessie Gilroy Hall. She eventually divorced her husband, and married Warneke in March 1927. Twelve-year-old Edward T. Hall Jr. remained with his father, while five-year-old Priscilla Hall went with her mother. The Warnekes moved to Paris&mdash;\"it is clear that leaving the country also helped put Saint Louis and the scandal of Jessie's divorce far behind them.\" They had returned to the United States and were living in New York City in 1930, when he became a naturalized American citizen.\nDuring the 1930s, Warneke’s studio was at No. 12 Washington Mews, one street north of Washington Square Park. In 1931, the Warnekes purchased a farm in East Haddam, Connecticut, that the couple would own for the rest of their lives. After giving up his New York City studio, Warneke converted the farm's barn into his studio, 1940. He later maintained a residence in Washington, D.C. during the decades that he was teaching there.\nFollowing 55 years of marriage, Jessie Gilroy Warneke died in East Haddam, Connecticut in 1982. Warneke's final sculpture was their shared grave marker&mdash;\"The image on the stone is of the two of them planting a tree together.\" Heinz Warneke died of a heart attack on August 16, 1983, in a retirement home in Madison, Connecticut.\nWorks\nHarlem River Houses\nPublic housing in New York City was segregated by race into the 1950s. Warneke created sculpture for the Harlem River Houses, part of an effort by the Federal Government to provide high-quality urban housing for working-class Blacks. Design critic for The New Yorker, Lewis Mumford, praised the results:\n“[T]he trees set about the ample open spaces in the fashion of the Luxembourg Garden; and the handsome sculpture by Heinz Warneke, the penguins round about the central wading pool and the wrestling bears on the east side of Seventh Avenue. The gracious austerity of the architecture magnifies the importance of each variation, and the sculpture is “functional” in a practical as well as an aesthetic sense, since the cast stone which composes it will be improved in finish by being handled and climbed over by children. ... Here in short, is the equipment for decent living that every modern neighborhood needs: sunlight, air, safety, play space, meeting space, and living space.\nWarneke's two larger-than-life kneeling-figure sculptures were unexpectedly controversial. The male figure depicted a shirtless man with a sledgehammer; the female figure depicted a woman holding a baby and accompanied by a dog. The committee representing the future tenants \"considered Warneke's portrayal of a black man as a laborer degrading.\" The statues' names also reinforced stereotypes, and were changed: Man, the Provider became Black Worker, and then Young Man. Woman, the Mother and Housekeeper&mdash;which was captioned \"Colored Concrete Statue Motherhood\" in a 1941 photograph&mdash;was changed to Negro Mother and Child, and then Mother and Child.\nWarneke's other cast-stone sculptures at the site were two examples of Tussling Bears, one in the West Courtyard and the other in the River Courtyard, and four examples of Penguin, which ringed the wading pool in the Central Courtyard. In a 1979 photograph accompanying the National Register of Historic Places nomination form, only one of the four Penguin sculptures was intact; another was headless, and the other two were missing or had been removed. In a 2024 restoration of the Central Courtyard, the wading pool was restored (without sculpture), and the Mother and Child kneeling figure was removed.\nNittany Lion\n]]\nThe Nittany Lion has been Penn State's mascot since 1907. Thanks to advocacy in the student newspaper, momentum for a Nittany Lion statue was growing in the Fall of 1939. Fine Arts instructor Francis E. Hyslop wrote to three sculptors inquiring about their interest in the potential project. On April 22, 1940, the outgoing Class of 1940 voted to make the Nittany Lion sculpture their class gift, and $5,340 was raised for it.\nThe committee for the project was formed in February 1941, and Warneke, the only one of the three sculptors still involved, submitted models in six different poses in April. His favorite pose was unanimously approved, and the terms of his contract were negotiated over several weeks. His selection as sculptor was announced in August 1941: “The Pennsylvania State College has just commissioned Heinz Warneke, American sculptor ... to carve a lion out of Indiana limestone on the campus at Penn State.\" Painter Henry Varnum Poor had painted murals for a Penn State building, and turned his work process into a weeks-long interactive dialogue with students. Warneke agreed to do the same, to carve the figure outdoors and in place the following summer.\nA 13-ton block of Indiana limestone was trucked up to the top of Burrowes Road in June 1942, and deposited on the selected site. Using Warneke's full-sized plaster model, his assistant, stonecutter Joseph Garatti, roughed out the figure in three dimensions. Warneke spent the next four months finish-carving the figure on site. The Nittany Lion Shrine was dedicated on October 24, 1942, during halftime of the football game against Colgate University. Penn State won the game.\n“The lion’s right ear was defaced in 1978 when vandals used some sort of blunt instrument to chip it off the statue. Warneke returned to the university at the age of 84 to sculpt a replacement.” Warneke's 8.5-inch-long (11.1 cm.) terracotta model for the Nittany Lion is in the Palmer Museum of Art at Penn State.\nWashington National Cathedral\nWarneke's relationship with Washington National Cathedral began in the 1950s, when he participated in a limited competition among invited sculptors to design the tympanum for the South Portal. His winning entry featured a tableau of The Last Supper&mdash;with Christ standing before a perspective-distorted curving table of seated disciples&mdash;and a three-panel frieze of The Road to Emmaus. Roger Morigi (with Edward H. Ratti) carved the 17-foot-tall limestone tympanum in situ from scaffolding. Warneke modeled his Saint Alban trumeau figure (1959-1961) for the pier below the tympanum, and Morigi carved it in limestone.\nWarneke also modeled and Morigi carved a work in memory of Joseph Ratti, one of the cathedral's stonecarvers, who died in a 1955 fall from scaffolding. Located in the stairway of the south transept, the memorial depicts Ratti carving a never-to-be-finished gargoyle.\nIn 1961, Coleman Jennings purchased Warneke's The Prodigal Son for $10,000, and donated it to the Cathedral in memory of his parents. The sculpture was placed in the Bishop's Garden. The following year, Warneke modeled two keystones and thirty-one bosses for the Cathedral's interior. In 1963, Dean of the Cathedral Francis B. Sayre Jr. commissioned Warneke to create figural groups of Native Americans as capitals for the five columns that surround the Cathedral’s Garth. Sayre was a step-grandson of former-First Lady Edith Wilson, and he wished to honor her Native American heritage. Warneke's groups represent peoples of the Pacific Northwest, The Arctic, The Northeast, The Great Plains, and The Southwest.\nAfrican Elephant and Calf\nIn November 1958, Warneke was invited by the Fairmount Park Commission to participate in a competition among six sculptors to create an animal sculpture for the Philadelphia Zoological Gardens. His winning submission was a life-sized mother elephant and her newborn calf depicted in a tender moment&mdash;preparing to nurse for the first time: \"I want to create a statue that will speak forever of how touching, how funny, how gorgeous motherhood is, even in such an awkward and huge beast as an elephant.\"\nWarneke intended for the work to be carved from a single block of granite, but he was unable to find an American quarry that could provide a block large enough. He learned that gray granite from Bergen, Norway would closely match the color of an elephant's hide, but carving the work in a foreign country and shipping it back to the U.S. would exceed the project's $37,000 budget. Members of the Park Commission demonstrated their support for Warneke by making donations that doubled his budget. Utilizing Warneke's full-size plaster model, the sculpture was rough-carved in Oslo by Norwegian stonecutters, who removed tens of tons of waste stone. The process took more than a year, and Warneke made minor changes as problems arose.\nU.S. sculptor Heinz Warneke is in Oslo supervising work on a huge sculpture, depicting a mother elephant and her baby, for the zoo in Philadelphia, Pa. Hewn from a 60-ton block of Norwegian granite, it is being carved by A/L Steinskulptur.\"\nWhen completed, the rough-carved sculpture was hoisted onto a freighter and shipped to the United States. It was unloaded at the docks in South Philadelphia. On October 22, 1962, the sculpture was hoisted onto the bed of a tractor-trailer, which slowly drove it up Broad Street, the city's main north-south artery, and delivered it to the zoo in West Fairmount Park. “The arrival of Elephant and her Calf  by Heinz Werneke in 1962 was greeted with as much fanfare as a new live specimen.” Warneke resumed his finish-carving of the sculpture at the zoo.\nAfrican Elephant and Calf was dedicated seven months after its arrival, on May 25, 1963. The zoo brought out a young elephant and a calf to be photographed with the sculpture, and with the sculptor. LIFE Magazine covered the event:\nLast week in Philadelphia nature was busy imitating art &ndash; or vice versa. For a moment it was hard to tell which was which when some residents of the local zoo paused to look over the new tenants in Fairmount Park. But nature gave it away; her elephants moved. Art’s stayed put for they had been carved from a solid block of granite.\nAccording to a trade journal: \"This is the largest monolithic, free-standing granite sculpture in the United States.\"\nRecognition\nExhibitions\nWhile living in Paris in the late-1920s, Warneke exhibited at the Salon des Tuileries. He exhibited five works at the Art Institute of Chicago in 1927, including Rearing Horse that was illustrated in the catalogue (as Prancing Percheron). Warneke exhibited semi-regularly at the Pennsylvania Academy of the Fine Arts in Philadelphia, fourteen times between 1928 and 1958. He exhibited sporadically at the National Academy of Design in New York City, four times between 1935 and 1949. He exhibited relatively frequently at the Whitney Museum of American Art in Manhattan, New York City, eleven times between 1936 and 1952.\nWarneke loaned The Prodigal Son to the Whitney Museum's 1939 Annual Exhibition in January and February; then loaned it from April to October to the 1939 World's Fair in Queens, New York City. He loaned Pelicans: Contentment in the Sun (1928) to the National Sculpture Society's 7-month Annual Exhibition, April to October 1939, at the California Palace of the Legion of Honor in San Francisco. Warneke loaned four works to the Philadelphia Museum of Art's 5-month exhibition, Sculpture International 1940&mdash;Tussling Bears (1936, plaster), New-Born Deer (1925), Orang Outang Thinking (1933), and The Prodigal Son (1932-39). He loaned the 1931 version of Wild Boars to the Museum of Modern Art's July 1941 exhibition, Animals in Art: Designing a Stage Setting. The Corcoran Gallery of Art in Washington, D.C. hosted a \"Special Exhibition of Sculpture by Heinz Warneke,\" December 1, 1942 to January 1, 1943.\nWerneke loaned The Prodigal Son (1932-39) to MoMA's 1943 exhibition, Art in Progress, celebrating the 15th anniversary of the museum's founding. MoMA placed the work in the sculpture garden, where it remained for several years. Religion columnist Walter L. Nathan saw The Prodigal Son at MoMA in 1946, and wrote movingly about it.\nThe Lyman Allyn Museum in New London, Connecticut hosted a retrospective exhibition of Warneke's work, November 11, 1956 to December 2, 1956. The Corcoran Gallery hosted a retrospective exhibition of Warneke work, February 7 to March 3, 1957. The Georgetown University Art Gallery in Washington, D.C. hosted \"Heinz Warneke Looks Back: An Exhibition of the Artist's Personal Selection of His Sculpture,\" November 30 - December 19, 1967. Included (and for sale) were plaster models for several of the works he sculpted for Washington National Cathedral.\nAwards\nIn 1924, the St. Louis Artists’ Guild awarded Warneke an Honorable Mention for Maiden and Faun. The following year, the Guild awarded him its First Prize and Medal for New-Born Deer (1925). The Art Institute of Chicago awarded Warneke its 1930 Logan Medal and $2,500 purchase prize for The Water Carrier (1927). PAFA awarded Warneke its 1935 Widener Gold Medal for the 1931 version of Wild Boars. The Society of Washington Artists awarded Warneke its 1943 First Prize for New-Born Deer (1925).\nHonors\nWarneke was elected a member of the National Sculpture Society in 1936. The Lyme Art Association in Old Lyme, Connecticut, elected him a member in 1937. The National Academy of Design elected Warneke an Associate member in 1939, and an Academician in 1966. Ivan Olinsky painted his NAD diploma portrait. What is now the American Academy of Arts and Letters elected him a member in 1953.\nWarneke was one of the three American sculptors selected to judge the 1938 national competition to design the Jefferson nickel, (Sidney Waugh and Albert Stewart were the others). He was one of the three judges for the 1939 first round of the national competition to design a Thomas Jefferson statue for the Jefferson Memorial. Architect Henri Gabriel Marceau, sculptor James Earle Fraser, and Warneke whittled the list of 101 applicants down to 6 semi-finalists. From these, the Thomas Jefferson Memorial Commission selected 3 finalists in the 1940 second round; and in the 1941 final round chose Rudulph Evans the winner.\nThe Archives of American Art recorded a 1982 interview with Warneke, conducted by Robert Brown. Heinz Warneke's papers are housed at Syracuse University. Family papers are at the East Haddam Historical Society & Museum in East Haddam, Connecticut. The historical society built a new wing to house its collection of Warneke's sculptures.\nList of works\nAnimalia\n* Rearing Stallion (Prancing Pergeron) (1922, African wood), unlocated. Exhibited at the Art Institute of Chicago in 1927.\n** Harneke carved two replicas, one in ebony and the other in oak.\n* Hissing Geese (1926), Art Institute of Chicago\n* Elegance (1927, marble), Smithsonian American Art Museum, Washington, D.C. The subject is a seated cat.\n* Pelicans: Contentment in the Sun (1927), Chrysler Museum of Art, Norfolk Virginia\n* Colt (1928, polished brass), Brookgreen Gardens, Murrells Inlet, South Carolina\n* Mother Goat and Kids (1929), National Academy of Design, Manhattan, New York City\n* Wild Boars (1929, Belgian marble), Art Institute of Chicago, height: 12.5 inches.\n** Wild Boars (1931, Belgian marble), Smithsonian American Art Museum, height: 18.75 inches. Warneke carved this second version with dimensions 50% larger than the original. A 1993 bequest to SAAM from Warneke's Estate.\n* Orang Outang Thinking (1933, marble), Addison Gallery of American Art, Andover, Massachusetts\n* Tussling Bears, aka Wrestling Bears, Tumbling Bears (1936, red granite), National Zoological Park, Washington, D.C.\n** Tussling Bears (1936, cast stone), Harlem River Houses, Manhattan, New York City. Two replicas in cast stone.\n** Tussling Bears (1936, posthumous 1989 cast, bronze), K. T. Murphy Elementary School, Stamford, Connecticut\n* Penguin (1938, cast stone), Harlem River Houses, Manhattan, New York City\n* Nittany Lion Shrine (1942), Pennsylvania State University, State College, Pennsylvania\n** 3/4-size versions of Warneke's Nittany Lion are located on many of Penn State's satellite campuses.\n* New-Born Deer (1943, brass). Awarded First Prize by the Society of Washington Artists in 1943.\n* World War II Eagle (1946, fieldstone). War memorial opposite Lyme Town Hall, Lyme, Connecticut\n* African Elephant and Calf (1962, Bergen granite), Philadelphia Zoo, Philadelphia, Pennsylvania. Dedicated May 25, 1963\n* Wildcat (1967-68, bronze), Owen J. Roberts High School, Chester County, Pennsylvania. Created in collaboration with Don Turano, Warneke's former student at the Corcoran Gallery of Art School. Dedicated 1969\n* Altoona Mountain Lion (1972, cast copper), Altoona Area High School, Altoona, Pennsylvania. Dedicated May 7, 1972\nFigural works\n* Juan Pino, Tesuque Indian (1925, bronze), New Mexico Museum of Art, Santa Fe, gift of Mr. & Mrs. Edward T. Hall\n* The Boxer (1926, bronze), height: 19 in. (48.3 cm.), signed: H. Warneke\n* Peasant Mother and Babe (1928, teakwood), unlocated. “Warneke’s PEASANT MOTHER AND BABE, carved in teakwood, is similar in feeling, but is unlike much of his recent sculpture … The larger masses, monumental in their proportions, as Warneke models them, are perfectly articulated. In the form of the mother they are imposing, and irresistibly lovely in the nursing child.”\n* The Water Carrier (1928-29, marble), ex coll. Art Institute of Chicago, unlocated. Winner of the 1930 Logan Medal and $2,500 purchase prize from the Art Institute of Chicago.\n* The Prodigal Son (1932-39, granite), Bishop's Garden, Washington National Cathedral, Washington, D.C. Purchased by Coleman Jennings in 1961, who donated it to the Cathedral in memory of his parents.\n* Portrait of Judge John Bassett Moore (1933, terra-cotta), head and bust, University of Virginia Law School, Charlottesville, Virginia. Exhibited at Whitney Museum of American Art, April-May, 1940.\n* The Immigrant (1933), Ellen Phillips Samuel Memorial, East Fairmount Park, Philadelphia, Pennsylvania\n* Express Mail Carrier (1936, carved aluminum), Ariel Rios Federal Building, Washington, D.C.\n** Express Mail Carrier (1936, painted plaster), Smithsonian American Art Museum, Washington, D.C. Warneke donated his painted plaster version to SAAM in 1980.\n** Express Mail Carrier (1982, cast aluminum), Railroaders Memorial Museum, Altoona, Pennsylvania. Cast by the Modern Art Foundry, with permission of the artist, as a gift to the museum. Dedicated April 3, 1982\n* Liberty Panel (1936, carved aluminum), Elevator Lobby, Ariel Rios Federal Building, Washington, D.C. Three pairs of hands, shackled to a heavy chain (Nazism?), reach out to the Liberty Bell.\n* Young Man (1937, cast stone), Harlem River Houses, Manhattan, New York City\n* Mother and Child (1937-38, cast stone), Harlem River Houses, Manhattan, New York City\n* Relief Portrait of Allen C. Dulles (1967-68, marble), CIA Headquarters, Langley, Virginia\n* The Maiden and the Unicorn (1969, bronze), height: 34.5 in. (87.6 cm.)\n* Working Together (1985-86) Lyme Municipal Building, Lyme, Connecticut. Four nude men pushing a boulder. Warneke's gift to Lyme, Connecticut, commemorating the 300th anniversary of the town's founding.\nArchitectural works\n* Lions flanking 11th Street entrance, Seal of City of St. Louis, Eagle figures (1924, cast stone), City Club Building, St. Louis, Missouri. Removed 1957.\n* Double-headed Eagle (1923-25, terra cotta), Scottish Rite Temple, Fort Scott, Kansas. Warneke's Art Deco-Pueblo-style eagle stretches across the building's facade with a wingspan of 48 feet.\n* Lewis and Clark Expedition Frieze (1939, cast stone), Auditorium, Department of Interior Building, Washington, D.C. The vertical frieze is 123 inches tall, 48 inches wide, and weighs 1 ton.\n* Church furniture and relief panels (1958-60, carved wood), Trinity Episcopal Church, Upperville, Virginia. Warneke collaborated with H. Page Cross, architect of the church.\n** Each pew end is carved with a plant variety native to Virginia&mdash;Oak, Wheat, Ferns, Grapes, Dogwood, Pear, Thistle, Holly, Columbine, Rose, Trillium, Ivy, Cherry, Lily. The 14 plant carvings are repeated over the 38 pew ends (19 on each side of the center aisle).\n** The pulpit is ringed by 5 carved figures of famous preachers: St. Chrysostom, Martin Luther, John Donne, Jonathan Edwards, Phillips Brooks.\n* Column capitals and impost blocks, (1961-64, carved limestone), Trinity Episcopal Church, Upperville, Virginia\n** Column capital: Pelicans, symbolizing the Sacrifice of Christ\n** Column capital: Unicorn, symbolizing Purity and Incarnation\n** Impost block: Fish, symbolizing Christ\n** Impost block: Sparrows, symbolizing the Lowly People\n* Suffer Little Children Flower Pedestal (1962-65, carved wood), Trinity Episcopal Church, Upperville, Virginia. Jesus walking with 2 small children.\nWashington National Cathedral\n* Earth double capital (1951-53, limestone), Mellon Bay, Washington National Cathedral\n* Sea double capital (1951-53, limestone), Mellon Bay, Washington National Cathedral\n* The Last Supper Tympanum (1953–59, limestone), South Portal, Washington National Cathedral\n** Warneke's 8-1/2-foot-tall half-size plaster model for the tympanum is in the East Haddam Historical Society Museum in Connecticut.\n* Joseph Ratti Memorial (1955-56, limestone), stairway of South Transcept, Washington National Cathedral\n* Saint Alban trumeau figure (1959–61, limestone), South Portal, Washington National Cathedral. Located directly below The Last Supper Tympanum.\n* God as Creator Keystone (1962, limestone), Washington National Cathedral\n* Praise Him and Magnify Him Forever Keystone (1962, limestone), South Transcept, Washington National Cathedral\nFile:Samuel Memorial Immigrant.JPG|The Immigrant (1933), East Fairmount Park, Philadelphia\nFile:Harlem River Houses, 7th Ave. and 151 St., New York City. LOC gsc.5a06063.jpg|\"Colored Concrete Statue Motherhood,\" (1941), Photograph #41.239.4, Museum of the City of New York\nFile:Harlem River Houses, 7th Ave. and 152nd St. LOC gsc.5a17215.jpg|Four Penguins (1938, cast stone), surrounding the central wading pool, Harlem River Houses, Manhattan, New York City\nFile:Sculpture \"Lewis & Clark Expedition,\" by Heinz Warneke at the Department of Interior Building, Washington, D.C LCCN2013634541.tif|Lewis & Clark Expedition (1939), Main Interior Building, Washington, D.C.\nFile:Capital, Washington DC 05.JPG|Great Plains Tribes Capital (1963-64), Garth, Washington National Cathedral\nFile:Allen Dulles Bas-Relief - Flickr - The Central Intelligence Agency.jpg|Relief Portrait of Allen C. Dulles (1969), CIA Headquarters, Langley, Virginia\nReferences"
    }
  ]
}