{
  "content": [
    {
      "type": "text",
      "text": "# Helen Buckingham\n\nHelen Elizabeth Buckingham  (born 17 November 1952) is a retired Australian politician. She was the Labor Party member of the Victorian Legislative Council from 2002 to 2006, representing Koonung Province.  She is the daughter of former state Labor leader Frank Wilkes, and a former teacher and local councillor.\nEarly life\nBuckingham was born in Melbourne, and went to secondary school in the suburb of Preston, but switched to the selective University High School for her final year. She studied teaching at La Trobe University, and took up her first position teaching history and politics at the somewhat underprivileged Pascoe Vale Girls High School. She taught there from 1975 to 1982, and then worked for a time at the private Mount Scopus College. From 1987, she taught at Presbyterian Ladies' College, and worked there until retiring from teaching in 1991. She took up a position as a careers counsellor the following year.\nPolitics\nBuckingham was actively involved in a number of community organisations, and was on the board of Box Hill Hospital for several years,http://www.easternhealth.org.au/boxhill/bhh.html as well as being a member of the Monash University Department of Physiology's Animal Ethics Committee. In 1997, Buckingham made a bid to be elected as a councillor for the City of Whitehorse, and was ultimately successful.\nShe became mayor the following year, and served for two years in this capacity. Buckingham was not re-elected as mayor in 2000, but continued to serve as a councillor. She stood as the Labor candidate for the federal seat of Deakin at the 2001 election, and was thought to have a chance of winning it. However, the 2001 election was not successful for Labor, and Buckingham was defeated.\nHer second bid for political office was to be more successful. She switched from federal to state politics, and won pre-selection for the Legislative Council seat of Koonung Province at the 2002 election. It was held by a strong margin by sitting Liberal member Gerald Ashman, but the election resulted in a significant landslide victory for Labor, and Buckingham soundly defeated Ashman, even before the distribution of preferences.\nShe was instrumental in reforms to the regulation of Victorian Bodies Corporate. She also played a strong role on the Parliament's All-Party Education Committee. She also focused on local issues such as preventing the closure of the Angliss Hospital. She served on the Legislative Council Privileges Committees.\nHer term was marred by a serious illness which forced her to take leave for the second half of 2004. She returned to her duties in 2005 . While on holiday in England during the year, she found herself caught up in the 7 July 2005 London bombings; she was on a train in front of one of those bombed.\nBuckingham retired at the 2006 election.\nHonours\nBuckingham was awarded the Medal of the Order of Australia (OAM) in 2018.\nReferences"
    }
  ]
}