{
  "content": [
    {
      "type": "text",
      "text": "# Hélène Swarth__disambig_1\n\n| birth_place      = Amsterdam, Netherlands\n| death_date       =\n| death_place      = Velp, Netherlands\n| resting_place    =\n| occupation       = Poet, translator\n| language         = Dutch, French\n| education        =\n| alma_mater       =\n| period           =\n| genre            =\n| subject          =\n| movement         = Tachtigers\n| notable_works    =\n| spouse           =\n| partner          =\n| children         =\n| relatives        =\n| awards           =\n| signature        =\n| signature_alt    =\n| years_active     =\n| module           =\n| website          =\n| portaldisp       =\n}}\nStéphanie Hélène Swarth (; 25 October 185920 June 1941) was a prolific Dutch poet active from 1879 to 1938. She is considered one of the Tachtigers and acquired a reputation as a sonneteer.\nLife\n(front left) and Willem Kloos (front right) in 1929]]\nStephanie Hélène Swarth was born on 25 October 1859 in Amsterdam, Netherlands. Her father was Eduard Swarth, a merchant and banker who for a while was the consul for Portugal in Amsterdam, and her mother was Maria Jacoba Heijblom.\nIn 1865, Swarth moved to Brussels, where she was tutored by a French governess. In 1870–1872, she went to school in Amsterdam. Afterwards, she went to a convent school in Brussels.\nSwarth initially wrote French poetry, her debut was published in 1879. She then switched to writing Dutch poetry, her first book in that language published in 1883, which she continued doing most of her life.\nSwarth lived in Mechelen from 1884 until 1894. In 1894, she married Dutch author Frits Lapidoth and moved to The Hague. She divorced Lapidoth in 1910. Their unhappy marriage is the subject of a monograph by Jeroen Brouwers in 1986.\nShe died on 20 June 1941 in Velp, Netherlands.\nPoetry\nSwarth's poetic debut was a collection of poems in French influenced by Alphonse de Lamartine, but she switched to Dutch-language poems on the advice of Pol De Mont. An early admirer was poet Willem Kloos who called her \"the singing heart of Holland\" and published her poems in his magazine De Nieuwe Gids.\nAfter two collections in French, Swarth published a Dutch volume of songs and sonnets, Eenzame bloemen (\"Lonely flowers\", 1883). A reviewer in De Gids thought the songs frequently too sentimental (and in the vein of Heinrich Heine), but appreciated the sonnets. Conrad Busken Huet saw in her second Dutch collection, Blue Flowers (\"Blue Flowers\", 1884), a poetry receptive to nature and a female spirit which would make whichever man she chose as a lover very happy; a reviewer for De Gids saw worthwhile thoughts and images in only a few of the sonnets. Lodewijk van Deyssel likewise criticized the volume's songs and praised the sonnets—even to the point of prophesying that her name would be blessed.\nBy the time Sneeuwvlokken (\"Snow flakes\", 1888) was published, she had gained a reputation for a poetry of love and suffering. By this time she had moved to Mechelen. A review in De Gids compared her work favorably to \"sweet, homely poetry\", which he likened to a sweet little tune on a fiddle, whereas Swarth's \"deep, full poetry\" was like hearing Beethoven played by a full orchestra. Again, especially her sonnets were praised. An overview article in Vlaamsche School (1889) pointed at the influence of Pol de Mont, who had advised her to forgo reading narrative and epic, and instead focus on lyrical poetry, sonnets. The origin of the sadness in her poetry was located in a \"loss of faith and bitter disappointments\".\nAt least one critic gave her entire oeuvre (including the anthologized \"Jeux Innocents\") an autobiographical reading: Swarth supposedly gave her heart to a young poet but he was unfaithful to her. According to Jacob Ek Jzn, this particular cause of sorrow speaks in all her work, without becoming a distraction or a bore since she found many different ways and forms of expressing both the initial sentiment and its recollection. Swarth and her poetry figure in Ina Boudier-Bakker's best-known novel, De klop op de deur, as a female poet unafraid to express her suffering for love.\nA key line from \"Jeux Innocents\" was cited in 1954 by then-foreign minister Johan Willem Beyen during a discussion on European unification: \"Wij speelden pandje met ons leven\" (\"we bargained with our lives\") was used to emphasize that all countries, even small ones, had much at stake in the era of globalization.\nBibliography\n*Fleurs du rêve (1879)\n*Les printanières (1882)\n*Eenzame bloemen (1883)\n*Blauwe bloemen (1884)\n*Beelden en stemmen (1887)\n*[https://books.google.com/books?id=1vtVAAAAcAAJ Sneeuwvlokken] (\"Snow flakes\", 1888)\n*Rouwviolen (1889)\n*Passiebloemen (1891)\n*Nieuwe gedichten (1892)\n*Bloesem en vrucht (1893)\n*Verzen (1893)\n*Blanke duiven (1895)\n*Diepe wateren (1897)\n*Stille dalen (1899)\n*Najaarsstemmen (1900)\n*Premières poésies (1902)\n*Octoberloover (1903)\n*Nieuwe verzen (1906)\n*Avondwolken (1911)\n*A. de Musset, De nachten (1912)\n*M.M. de Lafayette, De prinses de Clèves (1915)\n*Eenzame paden (1916)\n*V. Hugo, Hernani (1918)\n*Keurbundel (1919)\n*Late liefde. Liederen en sonnetten (1919)\n*Octobre en fleur (1919)\n*Hans Bethge De Chineesche fluit (1921)\n*Dagen (1924)\n*Episoden (1924)\n*Morgenrood (1929)\n*Natuurpoëzie (1930)\n*Beeldjes uit vrouwenleven (1938)\n*Sorella (1942)\nReferences\nExternal links\n*[http://www.dbnl.org/auteurs/auteur.php?id=swar008 Hélène Swarth] at DBNL"
    }
  ]
}