{
  "content": [
    {
      "type": "text",
      "text": "# Hell Gap Archaeological Site__disambig_1\n\n| locmapin = Wyoming#USA\n| area =\n| built =\n| designated_nrhp_type = December 23, 2016\n| added = December 23, 2016\n| refnum = 100000877\n| nocat = yes\n}}\nHell Gap (Smithsonian trinomial: 48GO305) is a deeply stratified archaeological site located in the Great Plains of eastern Wyoming, approximately thirteen miles north of Guernsey, where an abundant amount of Paleoindian and Archaic artifacts have been found and excavated since 1959.  This site has had an important impact on North American archaeology because of the large quantity and breadth of prehistoric Paleoindian and Archaic period (ca. 13,500 to 7,600 B.P.) artifacts and cultures it encompasses.  It was designated a National Historic Landmark in 2016.\nBackground\nHell Gap is host to five different localities, or independent areas of study, each with its own unique archaeological remains. It is located about 4,921 feet above sea level in a valley with a small stream nearby which was undoubtedly attractive to its prehistoric inhabitants. James Duguid and Malcolm McKnight, two archaeologists who lived in the region and went to school at the University of Wyoming, discovered the site in 1959. Since very little erosion had occurred over the last several thousand years, the site deposits were in pristine condition and the assemblages could be excavated and dated in all five localities. Excavations from 1961 to 1966, and again in 1995 and after, by archaeologists from the University of Wyoming and the George Frison Institute, have recovered vast amounts of information on Paleoindian lifeways locally, such as the preparation of bison kills and previously unknown projectile points complexes like Hell Gap and Goshen.\nHell Gap contains projectile points from Llano tradition, Clovis and Folsom, and the Plano tradition, Agate Basin, Alberta, Frederick, Goshen (Plainview), Lusk, Hell Gap, Midland and Cody complexes. Three new archaeological complexes were defined at this site, Hell Gap, Goshen (Plainview), and Frederick. Folsom complex is believed to be derived from Clovis but there has not been much radiocarbon dated evidence in stratified context between the two assemblages to determine this for certain. The Goshen complex found in Hell Gap is a possible assemblage dating to this intermediate period. The Hell Gap and Agate Basin point forms, which were also found in stratified context at Hell Gap, are the first types of the Plano tradition. The earliest calibrated dates for Hell Gap and Agate Basin complexes are from 10,200 to 9,600 B.P. The Plano tradition consists of lanceolate points that show parallel flaking and Agate Basin is the first complex exhibiting this characteristic. The term Plano was derived from the Great Plains of North America, and refers to Paleoindian cultures with a growing dependency on bison hunting. Both Agate Basin and Hell Gap points are similar in appearance but Agate Basin came before Hell Gap points by about 500 years. Agate Basin, Goshen, and Folsom complexes are found together in most Localities at the site. In Locality II however, archaeologists have found evidence of at least four different Paleoindian complexes, including the Midland, Hell Gap, Agate Basin, and Lusk cultures.\nHell Gap has offered insight into the cultural lifeways of Paleoindian peoples because of its rich artifact assemblage of faunal remains and bones, preserved domestic buildings, fireplaces, and projectiles. The structures, circles of postholes, are from some of the oldest buildings in North America, calibrated to more than 12,000 years B.P., and provide possible evidence for the early use of the tipi.\nThe diet of the prehistoric people living at the campsite during the early Holocene included not only bison, which was their main staple, but several other small animals as well. Berries, fish, and birds were consumed and possibly used for other purposes such as medicine or personal decoration. The composition of the assemblages illustrate the processing and transport of faunal materials, most likely including large amounts of marrow, from the kill site to the campsite. Paleoindians were using a \"fat-seeking feeding strategy\" while extracting valuable marrow from the bones of the bison they killed. The people residing in Hell Gap during the early Holocene were trying to maintain a diet high in fat and protein which is indicated by the amount of bison remains found in Locality II.\nArchaeologists involved\nOver the years, many archaeologists have been involved with the work at the Hell Gap site. The first two discoverers were avocationalists James Duguid and Malcolm McKnight, but professional archaeologists soon took over excavations after they showed several projectile points to George Agogino, professor of Archaeology at the University of Wyoming. Henry Irwin, Cynthia Irwin-Williams, George Agogino, John Brew, C. Vance Haynes, Jr., and H.M. Wormington worked on the project from 1962 to 1966. Their papers give a meticulous insight into the projects underpinnings including an inventory of complexes discovered, photographs, maps, thorough descriptions of stratigraphy and artifacts, and detailed sketches of lanceolate points found there.\nMuch of Hell Gap's modern excavation is under the purview of the George C. Frison Institute, the Wyoming Archaeological Foundation, and the University of Wyoming's Anthropology Department. Since 2009, a team has been reinvestigating the Hell Gap site in hopes that it will shed light on new aspects of Paleoindian culture and prehistory. The focus of recent excavations since 2009 have been to uncover new campsites and projectile points of the Frederick, Hell Gap, and Cody assemblages and to reevaluate past descriptions to update information. George Frison was given a grant from the National Geographic Society in 1995 to collect and produce data accumulated from past excavations at Hell Gap. Much remains to be learned from Hell Gap on Paleoindian lifeways and complexes, and there are several institutes exploring and quantifying the data found there.\nSee also\n*National Register of Historic Places listings in Goshen County, Wyoming\n*List of National Historic Landmarks in Wyoming\nReferences\nFurther reading\n* Holliday, Vance T. (2000). [http://www.argonaut.arizona.edu/articles/holliday2000_3.pdf \"Vance Haynes and Paleoindian Geoarchaeology and Geochronology of the Great Plains\"] . Geoarchaeology: An International Journal 15 (6): 511–522.\n* Irwin, Henry T.; Irwin-Williams, Cynthia; Agogino, George A. (1968). \"Archaeological investigations at the Hell Gap site near Guernsey, Wyoming\". National Geographic Society Research Reports, 1963 Projects. Washington: National Geographic Society. pp.&nbsp;151–156.\n* Irwin, Henry T. (1969). \"Archaeological investigations at Hell Gap site, Guernsey, Wyoming\". National Geographic Society Research Reports, 1964 Projects. Washington: National Geographic Society. pp.&nbsp;113–116.\n* Larson, Mary Lou; Kornfeld, Marcel; Agogino, George A. (2009). Hell Gap: A Stratified Paleoindian Campsite at the Edge of the Rockies. University of Utah Press.\n* Walker, Danny M.; Bies, Michael T.; Surovell, Todd; Frison, George C.; Miller, Mark E. (2012). [http://uwacadweb.uwyo.edu/SUROVELL/pdfs/AMN11%20Walker%20et%20al.pdf \"Paleoindian Portable Art from Wyoming, USA\"]. Pleistocene Art of the World. Symposium Ameriques. pp.&nbsp;697– 709.\n* [https://web.archive.org/web/20110427195854/http://www.guernseygazette.com/V2_news_articles.php?heading=0&story_id=480&page=72 \"Hell Gap dig underway again by UW archaeology\"]. The Guernsey Gazette. June 2, 2009.\n* Freeland, Nicholas P. et al. [https://web.archive.org/web/20170901115301/https://www.nps.gov/history/nhl/news/LC/fall2016/48GO305.pdf 48G0305, National Historic Landmark Nomination]. National Historic Landmarks Program, National Park Service. October 6, 2014."
    }
  ]
}