{
  "content": [
    {
      "type": "text",
      "text": "# Helmut Wrangel's reconquest of Jutland\n\n| combatant2        =\n| commander1        =  Helmut Wrangel\n| commander2        =  Frederick III   Friedrich von Buchwald   Ahlefeld\n| units1            = Unknown\n| units2            = Unknown\n| strength1         = 4,000–5,600 men\n| strength2         = 5,000 men\n| casualties1       = Unknown\n| casualties2       = 11 cavalry companies annihilated\n| campaignbox       =\n}}\n'''Helmut Wrangel's reconquest of Jutland''' occurred from September 1644 to January 1645 during the Torstenson War, when Lennart Torstensson sent a detachment of 4,000, 5,000, or 5,600 men under Helmut Wrangel to retake control of Jutland and Holstein which had been for the most part retaken by Denmark after the previous Swedish invasion.\nBackground\nAfter the Swedish army withdrew from Holstein after Lennart Torstensson invaded Jutland, a medal was struck with the inscription \"What Gallas has accomplished in Holstein can briefly be read on the other side.\" with the other side being blank. This notion was the prevailing one at the time, but it is likely that Gallas would have been defeated even more thoroughly by the Swedes than he was in the later battle of Jankau.\nHowever, despite this, Gallas ensured that the Swedes evacuated almost the entirety of Jutland and Holstein, which was a significant relief for the Danes. The Swedish leadership believed that Torstensson's campaign in Jutland had not gone according to plan, and given the situation, had to \"oppose the Emperor\" and continue the war in Germany.\nAfter Torstensson's withdrawal, the Jutlanders requested assistance from the government to help them organize \"landets defension\" among \"Crown and demesne peasants, trade towns, and common men.\" Christian IV responded to this request with words of encouragement and suggested that they recruit volunteers and organize defences on their own. Initially, he did not promise immediate assistance, but three weeks later, he ordered muskets and cannons to be distributed for an \"expedition\" into Jutland. By late August, most of Jutland was back in Danish control.\nReconquest\n]]\nHowever, the \"great source of strength that the Jutland Peninsula represented for Denmark\" would not be left \"undisturbed\". In early September of 1644, before Torstensson went back to Germany, he sent a force estimated at 4,000, 5,000, or 5,600, altogether 16 regiments, under the command of Colonel Helmut Wrangel to Jutland and Holstein. His objective was to deprive the Danes the ability to utilize the resources in Jutland and Holstein as much as possible.\nThe Danish forces in Jutland were primarily under the command of Archbishop of Bremen, Prince Fredrik, who had a force totaling 5,000 men, 3,000 infantry and 2,000 cavalry that were stationed in Holstein. Bitter disputes prevented decisive action between Fredrik and Anders Bille on Fyn, who were supposed to co-ordinate.\nAs he invaded, Wrangel swiftly retook Itzehoe, Flensburg, Haderslev, Kolding, Kiel, and Ribe, along with creating a fortified camp at Randers, from which his troops roamed the countryside. At Ribe, he also defeated General Buchwald. He also relieved Pinnenberg which was being besieged by the Danes on 4 September. He tried to do the same at Breitenberg, which failed. At Elmsporen, he annihilated 11 companies of cavalry under the command of General Ahlefeld, and stormed Krog and Stenborg. At Steinburger sconce, a battle took place in which the Swedish defenders sallied out and attacked to \"Moorbauren\" who then asked Count Penz for military support. Another battle took place outside of Itzehoe, where around 800 men of which 400 were dragoons and the rest Snapphane fought with Wrangel's troops, but were eventually repelled. In January 1645, he momentarily left to Hamburg, bringing with him reinforcements and supplies before returning to ravange Danish territories.\nAftermath\nAfter these successes, Frederick began withdrawing to Kolding, subsequently being ordered to return to Glückstadt by Christian IV, leaving Wrangel supreme in Jutland.\nSee also\n*\nReferences\nWorks cited\n*\n*\n*\n*"
    }
  ]
}