{
  "content": [
    {
      "type": "text",
      "text": "# Heman Edward Drummond\n\n| death_place = Jasper, Alabama, US\n| death_cause =\n| resting_place = Pisgah Baptist Church CemeterySipsey, Walker County, Alabama, US\n| resting_place_coordinates =\n| known_for = Founder of Drummond Company\n| education =\n| alma mater =\n| employer =\n| occupation = Businessman\n| title =\n| term =\n| predecessor =\n| successor =\n| party =\n| boards =\n| spouse = Elza Eliza Stewart\n| children = 5 sons, 2 daughters: Donald D. Drummond, Segal E. Drummond Senior, Garry N. Drummond, Larry Drummond, John Drummond, and daughters Hila Jo Drummond Davidson, and Barbara Drummond Thorne\n| parents = Isaac Freeman DrummondIda E. Phillips Drummond\n| relatives =\n}}\nHeman Edward Drummond (August 8, 1905– April 5, 1956) was an American businessman from Alabama. He was the founder of the Drummond Company, a coal-mining company.\nEarly life\nHeman Edward Drummond was born on August 8, 1905. His grandfather was a landowner in Alabama. His mother was a homesteader.\nCareer\nDrummond worked as a coal miner for the Debardeleben Coal Company, founded by Henry T. DeBardeleben.\nIn 1935, Drummond took a $300 loan from a bank in rural Alabama and founded a coal-mining concern which became known as the Drummond Company. Drummond started coal-mining on the land he had inherited from his grandfather and his mother in Jasper, Alabama. He used mules to drag coal out of mines. He first sold the coal to neighbors, farms and homesteads in the area.\nPersonal life\nDrummond married Elza Eliza Stewart. They had five sons, Donald, Segal, Garry, Larry and John, and two daughters, Hila Jo Drummond Davidson, Barbara Drummond Thorne.\nDeath and legacy\nHe died on April 5, 1956. He was buried at the Pisgah Baptist Church and Cemetery in Sipsey, Alabama. One of his sons, Garry N. Drummond, served as the chairman and chief executive officer of the Drummond Company. It has grown into a large global corporation.\nReferences\nExternal links\n*"
    }
  ]
}