{
  "content": [
    {
      "type": "text",
      "text": "# Hemendra Singh Panwar\n\nHemendra Singh Panwar is an Indian conservationist and civil servant, known for his efforts in the fields of wildlife and conservation. He was the first director of the Wildlife Institute of India and was the director of Project Tiger. The Government of India honoured him, in 2013, with Padma Bhushan, the third-highest civilian award, for his services to the environment and conservation.\nBiography\nHemendra Singh Panwar was born on 22 March 1937 in Balaghat district of Madhya Pradesh. He started his career in Indian Forest Service, which took off with his posting at Mandla. In 1969, he was transferred to South Mandla which covered the forest areas of Kanha which had a sparse head count of 30 tigers and Barasinghas (swamp deer) numbering 66. Panwar's efforts on deer conservation was given a boost when he was put in charge of barasingha conservation as an independent unit.\nDuring his stint at Kanha, Panwar is reported to be successful in converting the park into an efficiently managed unit, and the park won the award for the best managed park in India in 1976. The headcount of tigers grew to 150 and the deer to over 400 and the park management was able to relocate 22 interior villages.\nIn 1981, Panwar was transferred to Delhi, as the head of Project Tiger, a project conceptualised in 1973, for the protection of tiger population in India. He worked for 4 years on the project, till 1985, during which time, the project brought seven additional reserves under its umbrella. The population of tigers in India rose from 1900 to 3000. He was also invited to present a paper on the subject by the Smithsonian Institution.\nAt this time, the idea of setting up an institute focusing wildlife conservation was being mooted by V. B. Saharia, and as a result of his efforts, the Wildlife Institute of India was established in 1985 with Hemendra Singh Panwar as its first director. Panwar established the institute into a full-fledged learning centre with specialised focus on wildlife biology, management, and extension. Research facilities were also set up in the topics of focus. The Wildlife Institute of India is\nrated as one of the six best conservation research institutions by the World Conservation Union and has won Rajiv Gandhi Conservation Award. Panwar retired as its director in 1994.\nAwards and recognition\nHemendra Singh Panwar has won several awards and honours for his services.\n* Padma Bhushan – 2013\n* The Duke of Edinburgh Conservation Medal – WWF International – 2002\n* Rajiv Gandhi Wildlife Conservation Award – 1998\n* Tree of Learning Award – World Conservation Union (WCA-IUCN) – 1996\n* Fred M. Parker International Parks Merit Award – World Conservation Union (WCA-IUCN) – 1996\n* Prime Minister's Memento in 1992 for Project Tiger\n* Government of Madhya Pradesh Gold Medal – 1981\nWorks\n*\n*\n*\n*\n*\nSee also\n* Wildlife Institute of India\n* Project Tiger\n* International Union for Conservation of Nature\n* World Wide Fund for Nature\nExternal links\n* Reference by Renee M Borges\n* Padma Award Ceremony\n* List of Books on WorldCat\nReferences"
    }
  ]
}