{
  "content": [
    {
      "type": "text",
      "text": "# Henlopen Acres, Delaware\n\n| subdivision_type1  = State\n| subdivision_name1  =\n| subdivision_type2  = County\n| subdivision_name2  = Sussex\n| government_footnotes =\n| government_type    =\n| leader_title       =\n| leader_name        =\n| leader_title1      =\n| leader_name1       =\n| established_title  =\n| established_date   =\n| area_footnotes     =\n| unit_pref          = Imperial\n| area_magnitude     =\n| area_total_km2     = 0.66\n| area_land_km2      = 0.66\n| area_water_km2     = 0.00\n| area_total_sq_mi   = 0.26\n| area_land_sq_mi    = 0.26\n| area_water_sq_mi   = 0.00\n| population_as_of   = 2020\n| population_footnotes =\n| population_total   = 139\n| population_density_km2 = 210.20\n| population_density_sq_mi = 545.10\n| timezone           = Eastern (EST)\n| utc_offset         = &minus;5\n| timezone_DST       = EDT\n| utc_offset_DST     = &minus;4\n| elevation_footnotes =\n| elevation_m        =\n| elevation_ft       = 3\n| coordinates        =\n| postal_code_type   =\n| postal_code        =\n| area_code          = 302\n| blank_name         = FIPS code\n| blank_info         = 10-33900\n| blank1_name        = GNIS feature ID\n| blank1_info        = 214078\n| website            =\n| footnotes          =\n| pop_est_as_of      =\n| pop_est_footnotes  =\n| population_est     =\n}}\nHenlopen Acres is a municipality north of Rehoboth Beach in Sussex County, Delaware, United States, and is the third smallest incorporated town in Delaware. According to 2010 census figures, the population of the town is 122, a 12.2% decrease from the 2000 census. It is part of the Salisbury, Maryland-Delaware Metropolitan Statistical Area.\nGeography\nHenlopen Acres is located at  (38.7298343, –75.0862919).\nAccording to the United States Census Bureau, the town has a total area of , all land. It is the smallest incorporated town in Delaware. It borders the Atlantic Ocean to the northeast, Rehoboth Beach to the southeast, and unincorporated portions of Sussex County on the west and north. Much of its western border is demarcated by the Lewes and Rehoboth Canal. An unincorporated neighborhood called North Shores separates the northernmost part of Henlopen Acres from the southern boundary of Cape Henlopen State Park.\nHenlopen Acres is divided into 216 parcels of land, on which are 205 homes, the town hall and maintenance area, the town's marina, the Henlopen Acres Beach Club, Block W Beach, and the Rehoboth Art League. The town has  of roads, which generally are tree-lined.\nGovernment\nThe municipal government of Henlopen Acres consists of seven elected officials who serve on the town's council, one of whom serves as mayor. The town employs eleven workers who manage the town office, operate the marina, maintain streets and easements, and provide security.\nHenlopen Acres has no police department, but town-owned private security began in 1996. Henlopen Acres shares the services and expense of this security service with the unincorporated neighborhood of North Shores to its north. The security service, which patrols all of Henlopen Acres and North Shores, operates two vehicles.\nThe Rehoboth Beach Fire Department serves Henlopen Acres.\nHenlopen Acres' municipal government generally maintains amicable relations with the government of Rehoboth Beach, follows Sussex County's lead on how to react to emergencies such as major storms and whether or not to evacuate in the face of them. Within Henlopen Acres governmental affairs generally have run smoothly.\n}}\nAs of the census of 2000, there were 139 people, 69 households, and 42 families residing in the town. The population density was . There were 198 housing units at an average density of . The racial makeup of the town was 96.40% White, 2.88% African American, and 0.72% Pacific Islander.\nThere were 69 households, out of which 11.6% had children under the age of 18 living with them, 58.0% were married couples living together, 1.4% had a female householder with no husband present, and 39.1% were non-families. 36.2% of all households were made up of individuals, and 26.1% had someone living alone who was 65 years of age or older. The average household size was 2.01 and the average family size was 2.62.\nIn the town, the population was spread out, with 11.5% under the age of 18, 2.2% from 18 to 24, 10.8% from 25 to 44, 32.4% from 45 to 64, and 43.2% who were 65 years of age or older. The median age was 62 years. For every 100 females, there were 82.9 males. For every 100 females age 18 and over, there were 83.6 males.\nThe median income for a household in the town was $122,423, and the median income for a family was $162,681. Males had a median income of $0 versus $31,563 for females. The per capita income for the town was $82,091. 3.5% of the population is below the poverty line. Out of the total population, none of those under the age of 18 and 9.8% of those 65 and older were living below the poverty line.\nHenlopen Acres and Greenville (where the DuPont estate is located) are the two richest places in Delaware, all but tied for highest personal incomes, averaging over $80,000 per annum.\nOnly about one-third of the homes in Henlopen Acres are lived in year-round; the rest are vacation homes or rental properties. In 2000, the least expensive home was valued at $325,000 for real estate tax purposes and the value of all the land in Henlopen Acres was estimated at over $100 million.\nHistory\nThe name \"Henlopen\" probably is derived from that of Thijmen Jacobsz Hinlopen (1572–1637), a merchant in Amsterdam in the Netherlands.\nEvidence of Native American activity prior to the arrival of Europeans has been found in Henlopen Acres. After the arrival of the first European settlers, organized by the Dutch merchant Samuel Blommaert (1583–1651 or 1654), the area became farmland.\nIn 1930, a  parcel of this farmland was deeded to Colonel Wilbur S. Corkran (1888–1962) for $100,000. Corkran developed the parcel during the 1930s as a \"residential development where quiet-loving, cultured people may live in a country seaside community amid conditions which make for health, comfort and refined pleasure.\" Corkran's development was incorporated in 1970 as the town of Henlopen Acres.\nEducation\nHenlopen Acres is in the Cape Henlopen School District.\nIt is zoned to Rehoboth Elementary School.\nCape Henlopen High School is the sole comprehensive high school of the district.\nTransportation\nRoads are the main method of transport into and out of Henlopen Acres. However, no state highways serve the town, with only minor roads linking Henlopen Acres to surrounding areas. The closest state highway is Delaware Route 1A in neighboring Rehoboth Beach.\nNotes\nReferences\n* ADC Sussex County Street Map Book, 1st Edition. Alexandria, Virginia: Alexandria Drafting Company, 2005. .\n* Meehan, James D. From Saints to Sinners...Rehoboth Beach Memoirs. Bethany Beach, Delaware: Harold E. Dukes Jr., 2000. .\nExternal links"
    }
  ]
}