{
  "content": [
    {
      "type": "text",
      "text": "# Henry Marking\n\nSir Henry Ernest Marking (11 March 1920 - 16 May 2002) KCVO CBE was a British businessman and a former chairman and chief executive of British European Airways (BEA), which became British Airways.\nEarly life\nHe was the son of a butcher, born in Saffron Walden in Essex. He attended Saffron Walden Grammar School.\nCareer\nWorld War II\nHe was an army officer in the Second World War, being awarded the Military Cross (MC) in 1944 for conduct in the Battle of Anzio in February 1944. He served in North Africa, Italy and the Middle East (Egypt) with the Second Battalion of the Sherwood Foresters. He was an intelligence officer.\nIn September 1944 he studied for a year at the Middle East Centre for Arab Studies (MECAS), where he learnt Arabic. He then went to University College London (UCL) to read Law, having started in 1938.\nBritish European Airways\nHe joined British European Airways in the legal department, becoming company secretary in October 1950. He became chief executive on 1 April 1964. In the 1950s he joined a government committee on customs law. He became involved with the Institute of Transport (now the CILT) as a consultant on aviation law and the Royal Aeronautical Society, where he planned its first air transport course in 1956. He became chairman of BEA on 1 January 1971.\nUnder his leadership, British Airtours began in 1969 as BEA Airtours, taking its first commercial flight on 6 March 1970 from Gatwick Airport. He became chairman on 1 January 1971. In April 1971, BEA was restructured into ten separate operating units. Later in 1971 he was involved with the new Airbus A300, as a possible replacement for BEA's main Hawker Siddeley Trident fleet.\nOn 2 May 1969, the Edwards Committee (led by Sir Ronald Edwards) had been published, which recommended that BEA merged with BOAC, which the government made a decision to proceed with in May 1972; the British Airways Group was formed on 1 September 1972, becoming the fully-fledged British Airways in April 1974.\nBritish Airways\nHe was on the board of British Airways from 1971-80. In January 1977 British Airways adopted a single functional structure. He left British Airways at the end of August 1977, at the age of 57, having spent 28 years in the airline industry.\nBritish Tourist Authority\nOn 4 August 1977 he was named as the Chairman of the British Tourist Authority (BTA) to take over on 1 September 1977 (since 2003 called VisitBritain); on his appointment he said I want visitors to see something other than London, the real Britain does not lie in the metropolis. Knowing the west of Essex well, he campaigned against the building of Stansted Airport.\nPersonal life\nHe was awarded the CBE in the 1969 Birthday Honours, and the knighted in the 1978 New Year Honours.\nHe died in 2002 aged 82. He never married. He lived to the west of the M11 in Uttlesford.\nSee also\n* Sir Charles Hardie, former chairman of BOAC\n* Sir Peter Masefield (1914-2006), BEA chief executive from 1949–55\nReferences\nExternal links\n* [https://www.britishairways.com/en-gb/information/about-ba/history-and-heritage/explore-our-past/1970-1979 British Airways 1970-79]"
    }
  ]
}