{
  "content": [
    {
      "type": "text",
      "text": "# Henry Alfred Ward\n\n| birth_place      = Port Hope, Canada West\n| death_date       =\n| death_place      =\n| nationality      =\n| spouse           =\n| party            = Conservative\n| relations        =\n| children         =\n| residence        =\n| alma_mater       =\n| occupation       =\n| profession       =\n| religion         =\n}}\nHenry Alfred Ward (August 20, 1849 &ndash; May 11, 1934) was a Canadian politician.\nBiography\nBorn in Port Hope, Canada West, the only surviving son of the late George C. Ward, Registrar for Durham County, Ontario. He became a lawyer and was elected Mayor of Port Hope in 1885, 1893 and 1894. He was first elected to the House of Commons of Canada for Durham East in an 1885 by-election. A Conservative, he was re-elected in 1887 but did not run in 1891. He ran again and was elected in 1900 and 1904 (for the riding of Durham).\nWard was also active in the Canadian Militia, having enlisted with the 46th East Durham Battalion in 1867 and later retiring in 1909 with the rank of Lieutenant Colonel, having commanded the 46th Durham Regiment for six years.\nThe Ward family of Port Hope, Ontario were of English descent. Henry Ward was a grandson of Captain Thomas Ward (1770–1861), who as born in London and came to Canada with Governor John Graves Simcoe in 1791. Captain Ward was one of the first statute lawyers of Upper Canada and one of the first benchers of the Law Society of Upper Canada. Until 1808, he was Registrar of Northumberland County, Ontario, residing at Brighton. In that year he became Registrar for Durham County, Ontario and removed to Port Hope. In later life he also held the offices of Judge of the County Court and Clerk of the Peace for the Newcastle District. In 1847, Captain Ward resigned from the Registrar's office in favor of his son George C. Ward. Among the Captain's children were Mrs John Tucker Williams.\nElectoral record\nReferences\n*"
    }
  ]
}