{
  "content": [
    {
      "type": "text",
      "text": "# Henry Sanders (historian)\n\nHenry Sanders (or  Saunders; 1727–1785) was an English curate and local historian. He was curate of Shenstone, Staffordshire and is known for his book The History and Antiquities of Shenstone.\nLife\nSanders was born in Dudley, where he was baptized on 16 January 1727. He was the son of Henry Rogers Sanders, an apothecary, and his wife Rebecca (Hawkes). His father's mother, Sarah, was daughter of Thomas Rogers, a Stourbridge glass dealer and great-grandfather of Thomas Rogers the banker..\nHe was educated partly at the expense of his father's elder brother Thomas, a surgeon who was patronized by George Lyttelton, 1st Baron Lyttelton. He was educated at Dudley Grammar School. In 1746 he matriculated at Oriel College, Oxford where he was a servitor; he graduated B.A. in 1750. In 1754, having been ordained, he became curate, on modest pay, of Wednesbury. In the same year he married Elizabeth Butler, daughter of John Butler of Wednesbury.\nSanders became curate at Shenstone, Staffordshire in 1755, where he served for fourteen years. His amiable qualities enabled him to make influential friends there, and he always expressed gratitude towards the place and its people. His last entry in the Shenstone register is dated 22 January 1770. Shortly afterwards he accepted an ushership at King Edward's School, Birmingham. By the favour of his uncle's patron, Lord Lyttelton, Sanders was appointed to the mastership of Halesowen school in 1771. Dr. Pynson Wilmot, vicar of Halesowen, formerly a master of Dudley grammar school, obtained for him the perpetual curacy of Oldbury.\nHe died in Halesowen in January 1785, and was buried by his special request in the churchyard of Shenstone on 4 February of that year. His wife had died in 1759. Their only son, John Butler Sanders (1750–1830), a curate in parishes in London, was an untiring supporter of the Royal Humane Society.\nPublication\nSanders devoted his spare time to writing The History and Antiquities of Shenstone. It was published in 1794 by John Nichols, with a short account of the author by his son. It is a model parish history, containing elaborate accounts of the local manors, hamlets, farms, genealogies, and assessments. The work was extensively used by Stebbing Shaw in his History of Staffordshire.\nReferences\nAttribution\n*"
    }
  ]
}