{
  "content": [
    {
      "type": "text",
      "text": "# Henry T. King\n\n|birth_place=Meriden, Connecticut, U.S.\n|death_date=\n|death_place=Cleveland, Ohio, U.S.\n|occupation=Lawyer\n|known_for=U.S. prosecutor at the Nuremberg trials, 1946-47\n|spouse=Betty May Scranton\n|children=3, including Dave\n}}\nHenry T. King Jr. (born May 27, 1919, Meriden, Connecticut, died May 9, 2009 Cleveland, Ohio) was an American attorney who served as a U.S. Prosecutor at the Nuremberg Trials in 1946–47. Late in his career, he became a law professor and an activist, writer, and lecturer working on international law and war crimes; David M. Crane has described King as \"the George Washington of modern international law\".\nLife and work\nKing received his B.A. degree in 1941 from Yale College, and his LL.B. in 1943 from Yale Law School (1943). A heart murmur excluded him from military service during World War II. After practicing law for several years with the firm Milbank, Tweed & Hope, King became one of the United States prosecutors at the Nuremberg Trials, serving from 1946 to 1947. He was initially assigned to the prosecution of the German General Staff and the High Command, preparing cases against Walther von Brauchitsch, Heinz Guderian, and Erhard Milch for trial before Nuremberg Military Tribunals. Guderian was never tried, and von Brauchitsch died while awaiting trial. The Milch Trial convicted Milch on two of three counts, and he was sentenced to 20 years imprisonment. King also worked on the Ministries Case and the Justice Case.\nFollowing his service at Nuremberg, King had a long career as counsel for several corporations, including the TRW Corporation, from which he retired in 1981.\nIn the 1990s, King was a member of the American Bar Association Task Force on War Crimes in the former Yugoslavia. He subsequently influenced the charter of the International Criminal Court. When delegates from 131 nations established the criminal court in 1998, they did not initially include initiating wars of aggression as a war crime. With Whitney Harris and Benjamin Ferencz, two of the other prosecutors from Nuremberg, King traveled to the convention in Rome to successfully lobby for the court's jurisdiction over the instigators of such wars. Michael Scharf described their role in Rome: \"They used their moral authority; they were persistent, and ultimately the delegates included a reference to the crime of war of aggression in the court's statute.\"\nAs a part of preparing for the trial of Erhard Milch in 1946, King interviewed Albert Speer, one of the defendants who had been prosecuted at Nuremberg and convicted by the International Military Tribunal (the trial of the major war criminals). They later became friends. In 1997 King published a book with Bettina Elles, The Two Worlds of Albert Speer: Reflections of a Nuremberg Prosecutor. King wrote there that, \"In a technological world, the magic concoction for evil consists of blind technocrats such as Speer led by an evil and aggressive leader such as Hitler.\"\nKing wrote more than 60 journal articles. From the mid-1980s until his death, King was a professor at Case Western Reserve University School of Law, where he also served as the U.S. Director of the Canada-United States Law Institute. King also was a senior advisor to the Robert H. Jackson Center in Jamestown, New York; Jackson was the chief prosecutor at the Nuremberg trials.\nKing was interviewed for the 2006 BBC docudrama Nuremberg: Nazis on Trial.\nKing was married for fifty years to the former Betty May Scranton. The couple had three children: Suzanne Wagner, Henry T King III, who died in 1993, and Dave King, a novelist.\nHonors\nIn 2002, the University of Pittsburgh School of Law named King a Fellow honoris causa of the Center for International Legal Education. Also in 2002, King was awarded an honorary degree of Doctor of Civil Laws by the University of Western Ontario. Mr. King was a guest of the government of The Netherlands on March 11, 2003, for the inauguration of the International Criminal Court at The Hague.\nReferences\nExternal links\n* [https://www.telegraph.co.uk/news/obituaries/law-obituaries/5345772/Henry-T-King-Jr.html Henry T King Jr] - Daily Telegraph obituary\n* ."
    }
  ]
}