{
  "content": [
    {
      "type": "text",
      "text": "# Henry de Beaumont, 5th Earl of Warwick\n\n-->\n| birth_place       =\n| christening_date  =\n| christening_place =\n| death_date        = 10 October 1229\n| death_place       =\n| burial_date       =\n| burial_place      =\n| religion          =\n| occupation        =\n| memorials         =\n| website           =\n| module            =\n}}\nHenry de Beaumont, 5th Earl of Warwick ( – 10 October 1229), Earl of Warwick, and by marriage Lord of Hocknorton (Hook Norton) and Hedenton (Headington) in Oxfordshire, was the son of Waleran de Beaumont, 4th Earl of Warwick and Margaret de Bohun. He was also known as Henry de Newburgh.\nProperty and Conflicts\nIn 1204, when Henry was twelve, his father died and he was committed to the care of Thomas Basset of Headington, Oxfordshire whose family were at the time lords of Wootton (later Royal Wootton Bassett). It was during this time that John, King of England had seized his estates in the Gower in South Wales and gave them to William de Braose. This led to constant disputes between succeeding Earls and the Braose family.\nIn 1213 he paid two hundred and four marks, eight shillings scutage towards the cost of the war in Wales, and the following year contributed forty two marks to that in Poictou (Poitou), France.\nHe soon after however chose to fight and joined the court of King John's side and commanded the Royal Army. He fought for Henry III at the siege of Mountsorrel (1217), Bytham and at the storming of Lincoln.\nFamily and children\nHe had a brief marriage to Margaret, daughter and co-heiress of Henry D'Oyly, Baron Hocknorton and Lord of the Manor of Lidney; the latter was a great-nephew of Robert D'Oyly, the builder of Oxford Castle. They had a daughter:\n# Margaret de Beaumont, 7th Countess of Warwick\nHe then married Philippa Basset, daughter and co-heiress of Thomas Basset, Lord of Headington, and had children:\n# Thomas de Beaumont, 6th Earl of Warwick, his heir\n# Alice de Newburgh, married Hugo de Bastenbrege, Lord of Montfort.\nReferences\n* Edward T. Beaumont, J.P. The Beaumonts in History. A.D. 850-1850. Oxford."
    }
  ]
}