{
  "content": [
    {
      "type": "text",
      "text": "# Henry Ware Lawton\n\n| death_date    =\n| birth_place   = Maumee, Ohio, U.S.\n| death_place   = San Mateo, Manila, Philippine Islands\n| placeofburial = initially Paco Cemetery in Manila, then Arlington National Cemetery\n| placeofburial_label = Place of burial\n| nickname      =\n| allegiance    =\n| branch        =\n| serviceyears  = 1861–1865, 1866–1899\n| rank          =  Major General\n| unit          =  Company A, 30th Indiana Infantry\n| commands      =\n| battles       =\n* American Civil War\n** Battle of Philippi\n** Battle of Laurel Hill\n** Battle of Corrick's Ford\n** Battle of Shiloh\n** Siege of Corinth\n** Battle of Chickamauga\n** Atlanta campaign\n* American Indian Wars\n** Texas-Indian Wars\n*** Battle of Palo Duro Canyon\n** Apache Wars\n*** Geronimo Campaign\n* Spanish–American War\n** Battle of Las Guasimas\n** Battle of El Caney\n** Siege of Santiago\n* Philippine–American War\n** Battle of Santa Cruz\n** Battle of Pagsanjan\n** Battle of Zapote Bridge\n** Battle of San Mateo\n| awards        = Medal of Honor\n| relations     =\n| laterwork     =\n| signature     = Signature of Henry Ware Lawton (1843–1899).png\n}}\nHenry Ware Lawton (March 17, 1843 – December 19, 1899) was a U.S. Army officer who served with distinction in the Civil War, the Apache Wars, and the Spanish–American War. He received the Medal of Honor for heroism during the American Civil War. He was the only U.S. general officer to be killed during the Philippine–American War and the first general officer of the United States killed in overseas action. The city of Lawton, Oklahoma, takes its name from General Lawton, as does a borough in the city of Havana, Cuba. Liwasang Bonifacio (Bonifacio Square) in downtown Manila was formerly named Plaza Lawton in his honor.\nEarly life\nLawton was born on March 17, 1843, in Maumee, Ohio. He was the son of millwright George W. Lawton and Catherine (née Daley) who had been married in December 1836. Henry had two brothers, George S. and Manley Chapin.\nIn 1843, Lawton's father moved to Fort Wayne, Indiana, to work on a mill. The family followed him the same year. George went to California in 1850 to build shakers for the gold miners. He returned to Ft. Wayne later in 1853 and shortly after, on January 21, 1854, his wife Catherine died. She had been living with family members in or near Birmingham and Sandusky, Ohio, during George's absence. According to accounts given years later by Andrew J. Barney, a resident of the area and family friend, Henry attended public school in Florence Township, Ohio, from 1850 to 1854. Barney married the sister of Henry's mother in 1856 and for a time, Henry lived with the Barney family, and with his aunt, Marie Lawton, of Sandusky. He traveled with his father to Iowa and Missouri in 1857, returning to Fort Wayne in 1858. He enrolled at the Methodist Episcopal College in 1858 and was studying there when the American Civil War began.\nCivil War\nLawton was among the first to respond to President Abraham Lincoln's call for three-month volunteers. He enlisted in Company E of the 9th Indiana Volunteers, and was mustered into service on April 24, 1861, as one of the four company sergeants. He saw action at Philippi, Laurel Hill, and Corrick's Ford, in what is now West Virginia. He was mustered out on July 29, 1861, and returned home. Colonel Sion S. Bass was then organizing the 30th Indiana Infantry, and Lawton re-enlisted.\nThe 30th Indiana Infantry mustered into service on August 20, 1861. Lawton was his company's first sergeant but was promoted to 1st lieutenant on August 20. The 30th joined the Army of the Ohio, under General Don Carlos Buell in Kentucky and remained there for a brief period. The army moved on to Tennessee early in 1862. Its first major engagement was at the Battle of Shiloh, where Lawton's regiment suffered heavy losses. Lawton had experienced one of the bloodiest battles of the Civil War. His unit moved on and fought at the Siege of Corinth in Mississippi.\nLawton's unit also fought at Iuka while attached to Buell's forces. At the age of nineteen, on May 7, 1862, outside of Corinth, he was promoted to the rank of captain.\nHe fought at the battles of Stones River and Chickamauga and saw action in over 22 major engagements. He received the Medal of Honor years later for his bravery at the Atlanta campaign. He was a brevet colonel at the end of the war.\nAfter the war, Lawton became a companion of the Military Order of the Loyal Legion of the United States.\nIndian Wars\nAfter the Civil War he studied at Harvard Law School, graduating in 1866, before returning to the army. Lawton wanted a Captain's commission in the Army but did not receive it. Generals William Tecumseh Sherman and Philip Sheridan wrote recommendations supporting Lawton's efforts to rejoin the Army.\nSheridan strongly urged Lawton to accept a 2nd lieutenant's commission, which he did, joining the 41st Infantry Regiment under the command of Colonel Ranald S. Mackenzie on July 28, 1866. Lawton served for many years under Mackenzie, mainly as quartermaster, and also as a close confidant. He developed a reputation as a fierce and determined fighter as well as one of the most organized quartermasters in the service. Lawton served with Mackenzie in most of the major Indian campaigns in the southwest, including the Fourth Cavalry's victory at the Battle of Palo Duro Canyon.\nWhile earning a reputation as a fierce and tenacious fighter, Lawton was also regarded as having compassion for the Indians. Among those who respected Lawton was Wooden Leg, a Northern Cheyenne who was in a group of Cheyenne escorted by then Lieutenant Lawton to a southern reservation. Lawton also served as an advocate for the Indians on the reservation when he learned that the local Indian agency was short-changing the Indians on their food allotments.\nOn March 20, 1879, Lawton was promoted to the rank of captain in the regular army.\nIn 1883, Lawton and Major William F. Tucker claimed 800 acres overlapping a traditional farming village near the Zuni Indian Reservation. The area, now desired for cattle ranching, was omitted from reservation borders in 1877. Lawton and Tucker were opposed by anthropologist Frank Hamilton Cushing, Chicago Inter-Ocean editor William Eleroy Curtis, and Boston Herald reporter Sylvester Baxter. In May 1883, US President Chester A. Arthur responded to the controversy with an executive order, expanding the reservation to include the contested village.\nIn 1886, he was in command of B Troop, 4th Cavalry, at Fort Huachuca and was selected by Nelson Miles to lead the expedition that captured Geronimo. Stories abound as to who actually captured Geronimo, or to whom he surrendered. For Lawton's part, he was given orders to lead actions south of the U.S.-Mexico boundary where it was thought Geronimo and a small band of his followers would take refuge from U.S. authorities. Lawton was to pursue, subdue, and return Geronimo to the U.S., dead or alive.\nLawton's official report dated September 9, 1886, sums up the actions of his unit and gives credit to a number of his troopers for their efforts. At the same time, in his typical fashion, Lawton takes no credit for himself. Geronimo himself gave credit to Lawton's tenacity for wearing the Apaches down with constant pursuit. Geronimo and his followers had little or no time to rest or stay in one place. Completely worn out, the little band of Apaches returned to the U.S. with Lawton and officially surrendered to General Nelson A. Miles on September 4, 1886. While debate continues as to whom Geronimo surrendered, Native Americans rarely \"surrendered\" to junior officers. They usually surrendered to general officers.\nAt various times after the campaign, Lawton was questioned by friends about the campaign. He remained tightlipped and stated that his unit simply pursued Geronimo and brought him back.\nat rest stop beside Southern Pacific Railway, near Nueces River, Tex. (Geronimo is third from the right, in front), September 10, 1886.]]\nOn September 17, 1888, Lawton was promoted to major, inspector general of the Army. On February 12, 1889, he was promoted to lieutenant colonel, inspector general. His duties provided him with many opportunities to develop improvements in organization and equipment for the Army and he worked in this capacity for most of the time up until the Spanish–American War.\nSpanish–American War\nIn May 1898, Lawton was appointed brigadier general of volunteers and assumed command of the 2nd Division, Fifth Army Corps, serving under General William Rufus Shafter. His unit was sent to Cuba, where it spearheaded the invasion of Cuba at Daiquiri, a shallow beach area  east of Santiago. The landing of American forces took place on June 22, 1898.\nLawton's force of 6,000 troops moved inland as Spanish forces retreated and he reached Siboney on June 23. General Joseph Wheeler took it upon himself to jump ahead of plan and found himself in a fierce fire fight with the Spanish at the Battle of Las Guasimas. Wheeler elected to send word back to Lawton for help and Lawton's unit rushed forward to help Wheeler from his difficulties but the battle was over by the time Lawton's lead regiments arrived and they took no part in the fighting. The fact that the Spanish did not put up a prolonged resistance gave the Americans the impression they would be easy to defeat. This resulted in some miscalculations regarding the Spanish capabilities in planning future engagements.\nLawton's division was sent to take the Spanish fortress at El Caney. Preparation for the Cuban campaign had been helter-skelter and Shafter failed to disembark his siege guns. Moreover, he did not have mounted cavalry, necessary for a thorough reconnaissance of the terrain prior to engaging the Spanish forces. Generals Chaffee, Kent, and Wheeler all did independent recon prior to the El Caney and San Juan hill engagements but they provided an overly optimistic assessment of the difficulties ahead. Chaffee submitted his battle plan to Lawton who read and signed it without change. In the pre-battle meeting, Shafter and his generals agreed that El Caney would require no more than two hours to take.\nIn the following Battle of El Caney, Lawton's division suffered heavy casualties but eventually took the city and linked up with the rest of the U.S. forces on San Juan Hill for the Siege of Santiago. Once Santiago had fallen, Lawton wanted to be returned to the U.S. along with General Shafter and Fifth Corps; however, the War Department selected him as military governor of Santiago de Cuba province, a position he held from early August to early October 1898.\nA number of problems faced Lawton and Leonard Wood. One major problem involved the health of the American troops and the priority of returning many of them home for medical treatment. The problem of sanitation in the city of Santiago itself also had to be addressed. Many of the residents were under nourished, ill, and in need of medical attention. Civil order had to be restored and unruly Cuban soldiers, still bearing arms, were ordered to remain outside the city. Conflicts with the police occurred because they were holdovers from the Spanish regime and continued to treat the citizens in an oppressive fashion. Bars and saloons were closed for a period of time and basic law enforcement became one of the duties of Lawton and his men. Lawton had a penchant for hands-on involvement alongside his troops and was personally engaged in the day-to-day post war activity. There are news reports of Lawton personally removing insurgent flags from public buildings and working alongside his troops to maintain order.\nLawton immediately tackled the problem of law enforcement, ridding the police of its Spanish officers and replacing them with Cubans. By the end of summer, he had re-established a mounted police unit made up of Cubans to maintain order in Santiago. Eventually, taverns were re-opened and the locals were once again allowed to pursue their social pastimes.\nLawton also re-established commerce in the city and outlying areas, all the way to Havana. He worked with the Customs Bureau to create an equitable system of collections and was praised by the bureau head in Cuba for his work in raising and protecting a substantial amount of money. Disgruntled Cuban generals who early had taken their troops into the interior and posed a threat to the U.S. presence were invited by Lawton to participate in local government and in fact, became quite instrumental in establishing and protecting the peace.\nLawton suffered from a fever, possibly malaria, on and off between July and October. This fact was detected by only a few correspondents. For his part, Lawton did not make light of the illness except to a few close friends with whom he corresponded. His real condition may have been \"recurring\" malarial fever since he had been diagnosed with the illness, as well as dysentery in 1876. According to National Archive records, the army surgeon who diagnosed his condition at that time recommended a six-month leave in a different climate from the one in which he was stationed. His illness forced him to take a medical leave of absence on October 6, 1898. He returned to the U.S. on October 13 and shortly thereafter, began his preparation for the assignment that would take him to the Philippines.\nIt has been speculated that Lawton may have been relieved due to drinking, yet, no evidence has surfaced to confirm that rumor. One source for the information was a 'phantom' (unnamed) correspondent for the New York Evening Sun and the second was Leonard Wood, a \"moralistically intolerant\" person who was later believed by many in the Army to have stabbed his friend Lawton in the back. Considering the number of correspondents in Santiago on the prowl for news, or possibly a scoop, any misbehavior on the part of a senior American general would have been detected and reported. Not one irregularity showed up about Lawton over the course of three months and hundreds of news reports.\nPrivate letters to close personal friends in the U.S. from Lawton revealed that he was concerned with the number of his troops suffering from disease, and that he was experiencing a fever, perhaps malaria, and did not like being assigned to a desk job. He was already looking ahead to a role in the Philippine campaign.\nWhatever reason for his return to the states, he came back as a major-general of volunteers, having been promoted within a week or so of his landing in Cuba. When Lawton returned, he joined General Shafter for a short period of time and then went on to Washington, D.C., where he was in conference with President William McKinley, Adjutant General Henry C. Corbin, and Secretary of War Russell A. Alger concerning conditions in Cuba. He also testified before the commission investigating the Santiago campaign and was given temporary command of the Fourth Army Corps in Huntsville on December 22. On December 29, Secretary Alger announced to the press that Lawton was being placed in command of the Army field forces in the Philippines and would be reporting to General Elwell Stephen Otis, the military governor, within a short time. Lawton also toured the country with President McKinley, and other dignitaries during the Peace Jubilee.\nPhilippine–American War\nWith the fighting against the Spanish over, Lawton was transferred to the Philippines to command the 1st Division of Eighth Army Corps during the Philippine–American War. He sailed from New York aboard USAT Grant on 17 January 1899 and arrived in the Philippines on 10 March 1899.  There, he played a significant part in the military victories during the first part of the war, scoring victories at Santa Cruz and Zapote Bridge. He was able to inspire troops by his personal leadership and successfully incorporated tactics learned while fighting Indians in the American West.\nHis competency and military achievements made for bad relations between him and the Eighth Corps commander, Elwell Stephen Otis. Despite this, Lawton was very popular among his men and the general public and was so respected by the colonial Americans in the Philippines that his image appeared on Filipino currency issued during the American colonial period in the 1920s. A major plaza in downtown Manila was named Lawton Plaza, which was later renamed in 1963 to Liwasang Bonifacio. After the Battle of San Isidro, a letter arrived at the Eighth Corps headquarters with the message: \"Otis. Manila: Convey to General Law[ton] and the gallant men of his command congratulations on the successful operations during the past month, resulting in the capture this morning of San Isidro.\" The letter was signed by President William McKinley.\nLawton continued to experience personal attacks on his reputation. General Charles King, upon returning to the U.S. had dinner with General Shafter. Shafter informed King that someone high in the chain of command in Manila was spreading rumors about Lawton being on drinking sprees in Manila which King emphatically denied. King wrote Lawton about his meeting with Shafter, who in turn wrote adjutant general Corbin. Apparently the rumors caused Otis to write to the Adjutant General on July 11, 1899. Corbin in turn wrote McKinley's personal secretary who had inquired about the rumors and labeled the whole affair as \"mischievous gossip.\" (The letters are located in the McKinley Papers, Vol. 36, reel 7 of the Library of Congress.)\nGeneral Emilio Aguinaldo, first President of the Philippines, referred to Lawton as \"The General of the Night.\" When asked why he used that reference, Aguinaldo replied that Lawton was a night general and had attacked him (Aguinaldo) so often at night, he never knew when Lawton was coming.\nDuring the Battle of San Mateo, Lawton was, as usual, in the midst of the fighting and was killed by a Filipino sharpshooter, coincidentally under the command of a general named Licerio Gerónimo who possibly had Native American descent himself as Indians (Native Americans), Mestizos, and Criollos were once sent by Spain to serve as soldiers in the Philippines. He was the highest ranking American officer to fall in battle in either the Spanish–American or Philippine–American Wars. A vacancy had existed for a brigadier general in the Regular Army, and rumors had circulated for months as to whom the President would promote. The final tribute of recognition from the President and army had already been paid in the form of the promotion for Lawton on the day of his death. The adjutant general's office was processing the promotion when word was received in the White House of Lawton's death.\nLawton laid in repose at the chapel in Paco Cemetery Manila. His body left the Philippines on board the U.S. Army Transport Thomas on December 30, 1899. The Thomas reached the shores of San Francisco on Tuesday, January 30, 1900. Lawton was laid to rest at Arlington National Cemetery on February 3, 1900.\nTributes\nin Indianapolis]]\ndedicates the Lawton Monument at its original site at the Marion County Courthouse in Indianapolis on May 30, 1907.]]\nNine years after his death in the Philippines a statue was commissioned by Indianapolis city leaders and erected on the grounds of the Marion County Courthouse. The statue itself was created in 1906 and won a prize for heroic statuary at the Paris Salon competition in that year, a first for an American entry into that competition. The dedication ceremony for the statue was presided over by President Theodore Roosevelt and Vice President Charles W. Fairbanks, a fellow Hoosier. The Hoosier Poet, James Whitcomb Riley, composed a poem to commemorate the event, which was one of few appearances he made in the last years of his life as he suffered lingering complications from a stroke. In 1917 the monument was moved to Indianapolis's Garfield Park and rededicated.\nIn Fort Wayne, Indiana, where he was raised, Northside Park was renamed in his honor in 1900 and a bronze statue of him was erected in the town's Lakeside Park in 1921. In Lawton Park, a memorial featuring a cannon from his time in the Philippines is on display on a limestone base.\nIn Manila, the plaza fronting the Manila Central Post Office building was named \"Plaza Lawton\" before it was renamed in 1963 as Liwasang Bonifacio after the Philippine hero Andrés Bonifacio. Today, the name Lawton is used to refer to the area in between the post office building (including Liwasang Bonifacio and the Manila Metropolitan Theater) all the way up to the Park n' Ride in Padre Burgos. In addition, the main road leading to the Manila American Cemetery was named Lawton Avenue in his honor.\nIn 1899, the Army named a fort after Lawton. Fort Lawton was located just northwest of downtown Seattle, near the residential neighborhood of Lawton Wood. While Fort Lawton was a quiet outpost prior to World War II, it became the second largest port of embarkation of soldiers and materials to the Pacific Theater during World War II. The fort was closed by the Army in 1971, and today the bulk of the land makes up the city of Seattle's Discovery Park.\nIn 1899, the Lawton Glacier in Alaska was named for him. For unknown reasons, the spelling was subsequently changed to Laughton Glacier. Lawton, Oklahoma is named after the general, as is San Francisco's Lawton Street.\nHe is portrayed in the 1997 miniseries Rough Riders by actor John S. Davies.\nAwards\n* Medal of Honor\n* Civil War Campaign Medal\n* Indian Campaign Medal\n* Spanish Campaign Medal\n* Army of Cuban Occupation Medal\n* Philippine Campaign Medal\nNote – with the exception of the Medal of Honor, all the awards listed above were established after General Lawton's death.\nMedal of Honor citation\nRank and organization: Captain, Company A, 30th Indiana Infantry. Place and date: At Atlanta, Ga., August 3, 1864. Entered service at: Ft. Wayne, Allen County, Ind. Birth: Ohio. Date of issue: May 22, 1893.\nCitation:\nLed a charge of skirmishers against the enemy's rifle pits and stubbornly and successfully resisted 2 determined attacks of the enemy to retake the works.\n1862–1896 version]]\nSee also\n* List of Medal of Honor recipients\n* List of American Civil War Medal of Honor recipients: G–L\n* Young's Scouts\nReferences\n* Rau, R., Lawton-Forgotten Warrior A Commemorative Biography, Copyright 1998 Library of Congress\n* Rau, R., General of The Night-Henry W. Lawton A Biography, Copyright 2007 Library of Congress\n* Wilcox, Marrion, ''Harper's History of the War, Harper, New York and London, 1900. [Sometimes called Harper's History of the War in the Philippines'']\n*\n*\nExternal links"
    }
  ]
}