{
  "content": [
    {
      "type": "text",
      "text": "# Henry Milward & Sons\n\nHenry Milward & Sons  is an English manufacturer of sewing needles based in Redditch.\nHenry Milward and Sons and its employees boast over a quarter of a millennium making needles.\nHistory\nThe earliest reference to the Milward family in connection with needle making is a James Milward who was a needle maker on Fish Hill in 1676.\nSymon Milward created the company of Henry Milward & Sons aka '''Milward's Needles''' (Milward's) in 1730 at the age of 40, in Redditch, United Kingdom. It was however, his son Henry who takes credit for the foundation of the company as the company was registered in his name during the first year of his birth.[see Redditch Museum Family tree]\nFrom the first half of the 18th century, the name of Henry Milward and Sons became well known as the makers of good quality needles.\nAt one point they were the largest manufacturer of its type in the world, producing knitting needles, surgical needles, and fishing tackle, from a number of factories both in the UK and globally, such as Murcia, Spain.\nKnitting and surgical needles\nThe manufacture of needles was originally a cottage industry. During the Industrial Revolution the industry prospered and became mechanised.  By the late 1800s the company was the largest manufacturer in the whole district.\nRedditch became the hub of the needle industry in the UK, with trade directories showing that in the Redditch area in 1868/9 there were 117 firms listed as manufacturers in various aspects of needle and fish tackle trades. Small needle businesses amalgamated, often through inter-marriage between the leading needle makers of Redditch. Henry Milward and sons amalgamated with John James, W. Avery & Son, Wm. Bartleet, and thus the \"Milward empire\" grew.\nWilliam Hall of Studley amalgamated with Thos. Harper, Samuel Thomas, H. Wilkes and William Vale among others and formed a group of needle makers known as Amalgamated Needles & Fish Hooks. This resulted in Milwards and the aforementioned group being the 2 largest needle makers in the district.\nIn 1912 John James and Sons merged into Henry Milward and sons and a new board was announced.  Members of the board consisted of C.B James as chairman and C.F Milward as deputy chairman, H.T Milward, A.D Bartleet and C.E James.\nIn 1930 two of the great needlemaker giants Milward's of Redditch and Hall's of Studley joined forces under a single holding company, Amalgamated Needles and Fish Hooks Limited, who formed in 1932 a separate manufacturing organisation called The English Needle and Fishing Tackle Co. Ltd (ENTACO).\nHowever Milward's needles continued in Redditch until the 1950s, there were satellite factories setup during World War II in Evesham, Bewdley, Kidderminster and Moreton-in-Marsh. The basic needle plant was dispersed between Studley and Redditch during the war and in 1952 Arrow Works was officially opened and were still producing some brands of Milward's needles as were first made and marketed under the name of Henry Milward & Sons.\nThe years of greatest growth both in factory growth and world sales were at the end of the 19th century when the fortunes of the company were in the hands of Charles Frederick and Henry Tomson.\nFishing tackle\nColonel Henry Milward was a fervent fly angler who decided to mix business with pleasure when he created '''Milward's Fishing Tackle Company''' as part of his centuries-old needle-factory. A dozen workers left needle- and syringe-making to become experts in hooks, flies, devons, spoons and split-cane rods. This remarkable adventure lasted until 1965, when Milward died.\nMilward, alongside Allcock, Partridge, Wilkins, Lee, Martinez & Bird and J.W. Young was just one of many fishing tackle manufacturers located in Redditch, just south of Birmingham\nColonel C.F. Milward Esq\nColonel C.F. Milward, DL, was born in the United States and returned to England at the age of 5 and in due course he entered the family business, he was responsible for the companies amalgamations prior to 1930, he became the major chairman of the board of the holding company A.N. & F.H. Limited. His father was a justice of the peace.\nHe was elected to the Mastership of the Livery Company, The Worshipful Company of Needle Makers, and was High Sheriff of Worcestershire. He was known as the Colonel.\nH.T Milward, J.P Esq\nH.T Milward, justice of the peace, was known as Mr Harry, and was the Colonel's cousin. Harry's father was Colonel Victor Milward, a Member of Parliament. Harry's main interest in the family business was sales and included Russia in his sales trips.\nIn 1930, the board of directors were: Charles F Milward (Chairman of the company), Henry T Milward J.P, G.H. Corbet-Milward, C. Ernest James, Gerald Bartleet, Arthur D. Bartleet, and L. Sidney Milward.\nWhen these 2 great figures died, others took over the running of the company, now renamed Needle Industries Limited, but still the name Milward was the major trading company.\nThe next Joint Managing Directors were Basil King OBE and Alderman L. Haines of William Hall and Company, whilst Colonel G.V. Milward DL of Worcestershire, was a director of the company. Colonel Milward became the Managing Director of Milwards Fishing Tackle. He was also responsible for Surgical needles and braided suture manufacture after he returned to the company after he saw active service between 1939 and 1945.\nDuring the term of G.B King's Managing Directorship that Arrow Works in Studley was built, thus creating the business as we knew it to this present day. During this phase, the last of the Milward family was in the business: Ian Newton, grandson of Mr Harry briefly was Sales Manager (Needles) until 1968.\nSince 1952 the fortunes of the Milward business were in the hands of L.H.Beare and in the 1980s J.A Mackrael was the managing director. The trend of taking over companies continued, taking over Abel Morrall's Aero Needles (1989). Although Milwards owned many companies, each retained their own trade mark and name!\nPurchase and subsequent sale by Coats\nIn 1973 the entire share capital was purchased by Coats Patons Ltd, now known as Coats PLC. Needle Industries continued until the 1990s when Coats sold it to its management. Coats retained the Milwards brand name for its own use.\nFollowing the management buyout of Needle Industries, led by Victor Barley and Leonard Haigh, a new company was registered in 1991 called ENTACO, (an acronym of English Needle & Tackle Company) in the old Victoria Works, adjacent to  Needle Industries. Mr Barley was managing director and Mr Haigh was technical director of Entaco from 1991 to 1997.\nEntaco were involved in a cartel with Prym and Coats at the later end of the 20th century.\nPurchase by Groves Ltd of Thame in 2016\nIn 2016 Milwards Needles was purchased by Groves Ltd of Thame, Oxfordshire, a family company started in 1966 by Rodney and Marlene Groves.\nThe products are still sold around the world.\nMilward's Needles celebrated its 290th year of trading in 2020.\nReferences"
    }
  ]
}