{
  "content": [
    {
      "type": "text",
      "text": "# Henry Dewar (rugby union)\n\n| birth_place    = Foxton, New Zealand\n| death_date     =\n| death_place    = Chunuk Bair, Gallipoli, Ottoman Turkey\n| height         =\n| weight         =\n| school         = Berhampore School\n| occupation     = Iron moulder\n| position       = Hooker, flanker\n| amatyears1     =\n| amatteam1      =\n| years1         = 1907–1909\n| years2         = 1910–\n| years3         = –1912\n| clubs1         = Melrose\n| clubs2         = Hawera\n| clubs3         = Star\n| apps1          =\n| points1        =\n| provinceyears1 = 1907–8\n| provinceyears2 = 1910–14\n| provinceyears3 = 1913\n| province1      = Wellington\n| province2      = Taranaki\n| province3      = North Island\n| provinceapps1   = 11\n| provincepoints1 =\n| repyears1       = 1913\n| repteam1        =\n| repcaps1        = 2\n| reppoints1      = 0\n| module          =\n| branch             =\n| serviceyears       = 1914–1915\n| rank               = Sergeant\n| unit               =\n| commands           =\n| battles            =\n* World War I\n** Occupation of German Samoa\n** Gallipoli campaign\n*** Battle of Chunuk Bair\n| placeofburial    =\n| placeofburial_coordinates =\n| mawards            =\n| memorials =\n}}\n}}\nHenry \"Norkey\" Dewar (13October 18839August 1915) was a New Zealand rugby union forward, who played for the All Blacks, and represented Taranaki and Wellington provinces.\nPlaying for the Melrose Club in Wellington, he was selected in 1908 for the provincial team that played and defeated the Anglo-Welsh team on tour in New Zealand. After moving to Taranaki in 1910, he was soon selected to represent the province. Coming close to winning the Ranfurly Shield in 1912, a subsequent challenge the following year was successful against the longtime holders Auckland. He earned selection to the North Island team for the annual Inter-Island match and thereafter was picked to play for the All Blacks, first to play Australia and then for the tour of North America, in which he played 14 of the 16 games, including the 51–3 defeat of the All America team.\nSoon after the British Empire declared war on Germany on 5August 1914, Dewar signed up to the New Zealand Expeditionary Force, and took part in the expedition to occupy German Samoa, departing the day after he played for Taranaki defending a challenge from Wairarapa. On his return, he volunteered again for active service and enlisted in the Wellington Mounted Rifles, joining the machine gun section. After promotion to sergeant, he departed in October for Egypt. There, he captained his regiment's rugby team in matches against other New Zealand and Australian regiments. He landed at Anzac Cove on 8August 1915 and participated in the action to capture Chunuk Bair in the Gallipoli Campaign. The following day he was killed in action.\nEarly life\nHenry Dewar, born 13 October 1883 in Foxton, New Zealand,}} was the son of Alexander and Lydia Dewar. He spent most of his early years in Wellington until moving to Taranaki in 1910 where he worked as an iron moulder for B. Harkness of Stratford.\nRugby career\nDewar first played for the Melrose Club in Wellington and was selected for Wellington province in 1907. In 1908, he was a member of the Wellington team that defeated the touring Anglo-Welsh 19–13 on 27May. The visitors played much of the game with fourteen players, only six forwards, after an injury in the first half: the captains, before the game, had agreed that there would be no substitutions for injury. Dewar and Rush, in particular, as well as Harding and Cracroft Wilson, bore the \"heat and burden of a truly Homeric struggle.\"\nLater in the year, on 15August, he took part in a Ranfurly Shield challenge, which resulted in a heavy 24–3 defeat for Wellington at the hands of Auckland. The challengers, away to Auckland, were the underdogs but it was expected to be a close game, and at half-time Auckland were just leading by a conversion, 5–3. In the second half, Auckland's forwards imposed themselves on Wellington, who struggled to maintain the pace and were unable to respond to Auckland's scoring.\nDewar moved to Taranaki in 1910, where he played his club rugby for Stratford; he captained the team in 1913. He was first selected for Taranaki that year and continued to represent the club until the outbreak of the First World War. In 1912, Taranaki, with Dewar in the team, came close to winning the Ranfurly Shield from Auckland, losing 6–5. In front of a 12,000-spectator home crowd, Auckland dominated in the first half, scoring six points through a try and a penalty kick. The second half saw Taranaki's forwards take control for long periods, resulting in a converted try, but despite ongoing attacks, the visitors were unable to add to their score and lost by just one point.\n1913 Season\n1913 saw Dewar's best season. His provincial form saw him selected for the North Island in the annual Inter-Island match, having been nominated for inclusion the previous year but not selected. In the event, the North was beaten 25–0. He was then part of the Taranaki team that ended Auckland's long tenure of the Ranfurly Shield, in a game described as \"the finest match... and the most exciting... ever witnessed in the history of the Ranfurly Shield\". Taranaki controlled the first half, with the forwards stronger than their opponents in every aspect, scoring the first points. The visitors' lead of 0–3, however, changed to a half-time score of 5–3 in Auckland's favour after an injury temporarily reduced the opposition to fourteen men. Soon after the break, Taranaki took the lead through a try, and then a second — scored by Dewar, who was continuously \"in the thick of it\" — took them four points ahead, 5–9. The home side responded with two tries of their own to take back a two-point lead. Towards the end of the game, Taranaki scored one more try, which was converted and gave them a 14–11 victory to win the Shield for the first time: Auckland was the first team to be awarded the Shield in 1902 and, after Wellington won it in 1904, regained it and held on to it continuously from 1906.\nHe also played in the Taranaki side that was only narrowly beaten by the touring Australians in 1913. His form in these games earned him a place with the All Blacks. On 6September 1913, he played in the 30–5 first test win over Australia at Athletic Park: Albert Downing and George Sellars played alongside him and were also later killed in action in the First World War. Dewar was then selected, along with four other Taranaki players, for the tour of North America, playing in 14 of the 16 games, including the 51–3 victory over the All America team for his second test cap. He received particular mention in the test match for a cunning dummy pass to Downing on his right, drawing the defence and passing to five-eighths McKenzie on his left to run in for a try. He scored just one try. There was little interest in the American press about the tour. A single short paragraph in the New-York Tribune reports on the 51–3 defeat of the USA team on 15November.\nIn 1914, Dewar participated in Taranaki's defence of the Shield against Wellington on 24June, winning 14–10; Wanganui, on 27June, winning 17–3; Manawatu, on 23July, winning 11–3, with Dewar \"prominent\"; Horowhenua; and Wairarapa, on 14August, winning 22–3. Within days of this last game, a number of Taranaki's players, including Dewar, left to join the New Zealand Expeditionary Force: \"a brilliant forward... who would almost certainly have gone to Australia this season [on the All Blacks tour] if he had been available for selection\". Although defeating Canterbury on 20August, Taranaki's pack was particularly weakened by Dewar's absence, and only managed to win 6–5 with a last minute try. Against a second challenge from Wellington on 10September, the conspicuous absence of this \"fine leader of forwards\" contributed to the loss of the Shield.\nHis obituary in The Sun described him as \"one of the best forwards in the New Zealand team which visited California... he was fast and very clever, and always gave of his best. He was a good all-round athlete — an excellent boxer and no mean cricketer.\"\nInternational appearances\n{| class=\"wikitable sortable\"\n|-\n! Opposition !! Score !! Result !! Date !! Venue\n!scope=\"col\" class=\"unsortable\" |\n|-\n| ||align=\"center\"| 30–5 || Win ||align=right| 6 Sep 1913 || Wellington, New Zealand ||align=\"center\"|\n|-\n| ||align=\"center\"| 3–51 || Win ||align=right| 15 Nov 1913 || Berkeley, California ||align=\"center\"|\n|}\nMilitary career\nDewar enlisted early, joining the New Zealand Expeditionary Force leaving on 15August 1914 for German Samoa. On his return he volunteered again, joining the 9th Wellington Mounted Rifles as a machine gunner and was based at Awapuni Racecourse, Palmerston North; he was promoted quickly to sergeant. On 16October 1914, after training, Dewar embarked on the Orari at Wellington en route for Egypt. There, Dewar captained the Wellington Mounted Rifles rugby team in several matches against other regiments — beating the First Australian Light Horse, the Canterbury Mounted Rifles, and the Auckland Mounted Rifles — before his regiment landed on 8August 1915 at Anzac Cove, Gallipoli.}}\nNotes\nReferences\nBibliography\n*\n*\n*\n*  }}\nExternal links\n*"
    }
  ]
}