{
  "content": [
    {
      "type": "text",
      "text": "# Henry King (pirate)\n\nHenry King was a minor pirate active during the Golden Age of Piracy. He is best known for attacking the slave ship John Hopewell, whose captured crew turned the tables and took his ship from him.\nHistory\nKing was originally a Pennsylvania-based trader commanding the brigantine Sea Flower. The vessel itself was owned by Nicholas Webb, governor of the Bahamas, and had over 8000£ in coin and silver aboard. King and his co-conspirators seized the ship and sailed to the west coast of Africa to raid passing slave ships. Among them was the 200-ton, 25-man John Hopewell, captained by Henry Munday. King captured and looted the ship in late 1699 off the Guinea coast and took nine of Munday’s men aboard his own; some left willingly, while others were forced at gunpoint. Though some pirates kept slaves to sell, King took only “provisions, arms and liquor”. Munday dispatched a letter describing the incident; in response the Governors of Maryland and Virginia issued proclamations ordering coastal forces to watch out for King as well as Munday’s rogue sailors in case they returned to American waters.\nAmong the forced men was a sailor named Nicholas Gillibrand (or Gellibrand). King and several of his crew soon took ill and stopped at the island of Annobón to rest. Gillibrand and a few black sailors then aimed their pistols at the sick King, forcing him and his pirates ashore. Leaving King behind, Gillibrand and crew sailed to Angola where they met Munday in early 1700 and rejoined him. They emptied the Sea Flower which soon capsized and sank.\nThe John Hopewell arrived safely in Maryland in the summer of 1700 with over 300 slaves aboard. Munday was immediately under suspicion of collaborating with King and his pirates: he was curt with officials and insisted the Sea Flower “had little or nothing in her but some water-casks and barrels of Irish beef,” but some of his crew testified that they’d seen Munday take “bags of money” from the pirate ship. He was forced to post a large bond to ensure his co-operation with authorities. When he complained of his rough treatment at the hands of King, they reminded Munday that King had taken goods from him worth less than 5£.\nGovernor Blakiston arranged for Munday and Gillibrand to be returned to England to answer accusations of collusion. While there Munday’s partners and investors, including his brother John (who was part owner of the John Hopewell) vouched for him and asked that his bond be vacated. After the incident Munday continued to make slaving voyages in the John Hopewell, this time armed with a letter of marque in case he met any further aggressors.\nGillibrand was exonerated and hailed: “they were so far convinced of Gillibrand's innocence, he having done considerable service in seizing the said pirates' ship, that they design'd to put him a mate of their own ship again.” Gillibrand offered, if given an armed ship, “to clear the coast of Guinea and bring the heads of the chief pirates to their Lordships or to forfeit his own.”\nSee also\n*[https://quod.lib.umich.edu/e/evans/N00783.0001.001?rgn=main;view=fulltext Proclamation for the capture of Henry King], issued by New York's Governor Bellomont in July 1700 (before they knew that Gillibrand had turned on King).\n*Richard Shipton, another pirate whose prize ship was recaptured by its crew.\nNotes\nReferences"
    }
  ]
}