{
  "content": [
    {
      "type": "text",
      "text": "# Henry Churchill King\n\n|term_end    =\n|predecessor = John Henry Barrows\n|successor   = Ernest Hatch Wilkins\n|birth_date  =\n|birth_place = Hillsdale, Michigan\n|death_date  =\n|death_place = Oberlin, Ohio\n|alma_mater  = Oberlin College (A.B., 1879)Oberlin Theological Seminary (B.D., 1882)\n|residence   = Oberlin, Ohio\n|profession  = Theologian, educator, author\n|spouse      = Julia Coates King\n|children    = Philip Coates King, Donald Storrs King, Edgar Weld King, Harold Lee King\n|signature   = Signature of Henry Churchill King (1858–1934).png\n|}}\nHenry Churchill King (1858–1934) was an American Congregationalist theologian, educator, and author.\nBiography\nHenry Churchill King was born in Hillsdale, Michigan on September 18, 1858.\nAt Oberlin College from 1884, he taught in mathematics, philosophy, and theology. From 1902 to 1927, he was president of the college. With a tenure of 25 years, he is Oberlin's longest-serving president.\nIn 1919, he served on the King-Crane Commission, which provided recommendations on the fair and just disposition of non-Turkish areas of the Ottoman Empire. The findings of that commission, suppressed until 1922, were made public in the King-Crane Commission Report and conveyed the sentiment of the indigenous peoples of the region as to who would be entrusted with the various mandates, the future of Palestine, and other vital issues.\nHe was prominent in the councils of the Congregational Church and a moderator (1919–21) of its National Council as well as chairman (1921–27) of the Congregational Foundation for Education.\nHe died at his home in Oberlin, Ohio on February 27, 1934.\nBibliography\n* Reconstruction in Theology (1901)\n* Rational Living (1905)\n* The Ethics of Jesus (1910)\n* The Moral and Religious Challenges of Our Times (1911)\n*Fundamental Questions (1917)\n*For A New America In A New World (1919)\n* The King-Crane Commission Report (August 28, 1919)\n*Seeing Life Whole (1923)\nReferences\nExternal links\n*\n*"
    }
  ]
}