{
  "content": [
    {
      "type": "text",
      "text": "# Henry Rowe Hocking Kenner\n\n-->\n| education                 = Bachelor of Arts\n| alma_mater                = University of Toronto\n| occupation                = Principal\n| employer                  = Peterborough Board of Education\n| spouse                    = Mary Isobel (Williams) Kenner\n| children                  = Hugh Kenner\n| parents                   = William and Emily (Staples) Kenner\n| signature                 =\n| signature_alt             =\n| signature_size            =\n| footnotes                 =\n}}\nHenry Rowe Hocking Kenner (1867–1944) was a university trained educator and influential member of the City of Peterborough, Ontario, Canada.  He emigrated from Cornwall in England to Canada in the early 1870s and began his teaching career in Caledonia, Ontario.   After graduation from the University of Toronto he continued in the education field for another 50 years retiring from Peterborough Collegiate Vocational School at the age of 76. In 1952, the Peterborough Board of Education named its second high school in his honour.\nEarly life and family\nH.R.H. Kenner was born on March 28, 1867, in Mevagissey, Cornwall, England, to William and Emily (Staples) Kenner.  In 1872 his father, immigrated to Canada during a three-week voyage on a sailing ship and became a prominent and respected Methodist Bible Christian minister throughout southern and central Ontario.   Kenner married Mary Isobel (Williams), a French and German teacher, July 23, 1918. They had one son, Hugh Kenner, who they raised at 396 Downie Street, now a heritage home in the City of Peterborough.\nEducation career\nKenner started his teaching career in Caledonia, Ontario. In 1886 took his high school assistant qualifications  and then took on the position in 1889.   He completed his Bachelor of Arts and graduated from the University of Toronto in 1893. As expected for humanities teachers at the time, he traveled to Europe with a focus on Rome.  The \"Weekly Review\" newspaper printed installments of his writing as a series titled \"A Journey to the Eternal City\" that had a limited publish as a book.\nHe then went on to teach Greek and Latin at the Peterborough Collegiate Institute in 1893. While he played football and baseball there, he also coached baseball and earned the nickname \"Sam\".  Kenner became the first principal of Peterborough Collegiate and Vocational School (PCVS) from 1908 to 1943.   During the Great War, the proximity to the Peterborough Armouries was known to be a source of frustration for him as he was quoted to have complained to the City Council that, \"young pupils are too keen on soldiering rather than studies.\"   Kenner was awarded an honorary doctorate degree of law by the University of Toronto in 1936.\nUpon his retirement, in recognition of 50 years of service, he was presented with a hand-lettered and hand-painted, illuminated certificate signed by James Hamilton (Peterborough Mayor), C.M. Scott (Chair of the Public School Board), and W.H. Gainey (Chair of the Separate School Board).   Kenner was also presented with a Retirement Scroll from his last student cohort on June 4, 1943.  His retirement photograph was adorned to the balcony foyer of the PCVS auditorium, since a tradition for each of his successors, and remains there today.\nLegacy\nKenner died in 1944 and was laid to rest at the Little Lake Cemetery.  His legacy continues at Trent University where the Principal H.R.H. Kenner and PCVS Faculty Bursary, established by the PCVS Form 5 graduating class of 1937 with support from the Class of 1939, continues to be awarded to graduates of secondary schools in Peterborough County.  Peterborough’s second high school, Kenner Collegiate Vocational Institute, opened in 1952 named in his honour.\nKenner was the founding Grand Master of the Peterborough Masons' Arthur Lodge 523 instituted in 1914.  He was known as one of their most notable speakers and served again as the Deputy Grand Master from 1924-1925 during the formation of the Masons' Peterborough District.  The Peterborough District Masonic Association and Temple are still active today.\nIn 1999, Kenner was recognized as one of the top ten influential figures who shaped the development of Peterborough in the 20th century.\nSee also\n*Peterborough, Ontario\n*List of people from Peterborough, Ontario\n*Peterborough Collegiate\n*Kenner Collegiate Vocational Institute\n*Hugh Kenner, son of H.R.H. Kenner\nReferences"
    }
  ]
}