{
  "content": [
    {
      "type": "text",
      "text": "# Henry Lawrence (President of the Council)\n\nHenry Lawrence}}\nHenry Lawrence (1600–1664) was an English statesman and Puritan writer of Baptist views. He was Lord President of the Council of State under Oliver Cromwell from 1654 until 1659. Lawrence played a significant role in the governance of England during the Interregnum and was elevated to Cromwell's House of Lords in 1657. He also published three theological treatises, two on the doctrine of baptism and one on angels.\nBiography\nEarly life\nHenry Lawrence was born in 1600, the eldest son of Sir John Lawrence of St. Ives, Huntingdonshire (d. 1604), and his wife Elizabeth, the only daughter and heiress of Ralph Waller of Clerkenwell, Middlesex. His father had married Elizabeth on 7 March 1599.\nLawrence enrolled in Gray's Inn in 1617. Then in 1622, he continued his education by going to Emmanuel College, Cambridge; there he and graduated B.A. in 1623 and M.A. in 1627. At Cambridge, he belonged to the Puritan party, which was characteristic of Emmanuel College at the time.\nLawrence was second cousin to Oliver Cromwell, and maintained a direct business relationship with him; from 1631 to 1636, Lawrence leased his house and farm at St. Ives to Cromwell, making him Cromwell's landlord during this period. Lawrence's estate at St. Ives which he leased to Cromwell, later called Slepe Hall by its subsequent owner Sir Thomas White, became popularly known as Cromwell-place.\nAbout 1638 he moved to the Netherlands, to avoid the severity of the ecclesiastical courts under Archbishop Laud's administration. He returned to England in 1641, and was member of Parliament for Westmoreland in the same year; but he withdrew when the life of the king began to be in jeopardy from the Independents, and he was abroad again at the outbreak of the English Civil War. In December 1645 he was at Arnheim in Guelderland, and at Altena in January 1646.\nParliamentary service\nOn his final return to England he replaced one of the \"disabled\" members for the constituency of Westmorland on 1 January 1646. In July 1646 he was nominated one of the commissioners for the preservation of peace between England and Scotland, and on 17 March 1648 he became a commissioner of plantations.\nGreatly to Cromwell's annoyance, in 1649 Lawrence expressed strong disapproval of the trial and execution of King Charles I. According to a pamphlet from 1660 titled The mystery of the good old cause is briefly unfolded in a catalogue of the members of the late long parliament that held office, both civil and military, contrary to the self-denying ordinance, Lawrence was described as \"a member of the Long Parliament, [who] fell off at the murder of his majesty, for which the Protector, with great zeal, declared that a neutral spirit was more to be abhorred than a cavalier spirit, and that such men as he were not fit to be used in such a day as that, when God was cutting down kingship root and branch.\"\nRole in the Commonwealth\nDespite his initial opposition, Lawrence eventually reconciled with Cromwell's regime. He would thereafter contribute much to the setting up of the Protectorate, for which service Cromwell would reward him with various positions and ranks in the Commonwealth.\nIn 1652, styled \"colonel\", he visited Ireland as a commissioner for the Kingdom. On 14 July 1653 he was appointed to the Council of State and placed on several committees. In the Barebones Parliament of 1653 Lawrence sat in representation of Hertfordshire, and after its dissolution was placed on Cromwell's new Council of State. In November 1653, the Council of State appointed him Keeper of the Library at St. James's House.\nAt the second meeting of the Council he was made president (chairman) for a month, but by a subsequent order of Cromwell, dated 16 December 1653, he became permanent chairman, with the title of \"Lord President of the Council\". The satirical Narrative of the Late Parliament (1658) suggested that Lawrence was only really made president to win over, or at least keep quiet, \"the baptized people, himself being under that ordinance\". However, John Milton praised Lawrence's abilities in his second Defensio Populi Anglicani (1653-1654), styling him and one of the Montagues as \"Montacutum Laurentiumque summo ingenio optimisque artibus expositos\" (Montague and Lawrence, endowed with the highest genius and best accomplishments).\nIn the First Protectorate Parliament of 1654 Lawrence was elected to represent Hertfordshire, and the Second Protectorate Parliament of 1656 he was chosen for both Colchester and Carnarvonshire. He decided to serve for Carnarvonshire, and continued to represent it until his elevation to Cromwell's Other House in December 1657.\nIn 1654 Lawrence strove to assist Lord Craven in recovering his English estates, which had been confiscated in 1650–1651, and he had some correspondence with Elizabeth, Queen of Bohemia on the subject.\nOn the death of Cromwell in September 1658 he declared Richard Cromwell his successor as Protector and ordered his proclamation. He ceased to act as president in July 1659, following the collapse of the Protectorate.\nRetirement and death\nAfter the restoration of the monarchy Lawrence withdrew to Thele (otherwise Goldingtons) a manor in the parish of Stanstead St Margarets, Hertfordshire, which he inherited on the death of his son Edward in 1657. There he died on 8 August 1664, and was buried in the church.\nHis gravestone inscription, erected by his wife Amy Peyton, read: \"Here lyeth interred the body of Henry Lawrence, esq. sometime of this place, who married Amy Peyton, daughter of Sir Edw. Peyton, of Iselham, in the county of Cambridge, knt. and bart. He had issue by her seven sons and six daughters. He departed this life August the 8th, 1664, in the 64th year of his age.\"\nPublications and Religious Views\nLawrence, during at least part of the time when he lived on the Continent, served as pastor of Arnham's Independent church, once pastored by the Puritan Congregationalist Thomas Goodwin. Lawrence would keep in contact with them even after he permanently returned to England in 1646.\nLawrence was author of three religious treatises, two on baptism and one on angels.\nHis first treatise was titled Of Baptisme and published in 1646 in Amsterdam. This book is a systematic treatment of the doctrine of Christian baptism from a Baptist perspective. Lawrence structures his argument around three primary purposes of baptism: sealing the believer's union with Christ, confirming justification and remission of sins, and representing sanctification through spiritual death and resurrection. He taught that \"what Baptisme findes it seales, although it doth also exhibit more of the same kind; Baptisme and so all the ordinances of Christ, those we call Sacraments, seale up what is already, else how could it be a seale, but doth also conveigh more of the same.\" After examining what baptism is, he turns to refuting what baptism is not, opposing sprinkling as a mode of baptism and rejecting infants as valid subjects for baptism. A significant portion of the treatise addresses the common argument that infant baptism is justified by Old Testament circumcision. Lawrence systematically attacks this parallel, arguing that circumcision and baptism serve different covenantal purposes and that Christians relate to Abraham through faith rather than physical descent. He contends that the qualifications for New Testament ordinances differ fundamentally from those of the Mosaic law, requiring personal faith and understanding rather than birthright or family connection. The book also examines patristic evidence and early church practices, arguing that many ancient authorities either opposed infant baptism or based their support on questionable theological premises, particularly the belief that baptism was absolutely necessary for salvation.\nHis second treatise was also published in 1646 in Amsterdam; it was titled Of our Communion and Warre with Angels. This treatise was commended by the Puritan Isaac Ambrose in his book Ministration of, and Communion with, Angels, and also by Richard Baxter, in his book ''Saints' Rest. The book presents a systematic examination of angelology and spiritual warfare expositing primarily from Ephesians 6:11-18. Lawrence structures his book in three parts: first establishing angels as real created beings rather than mere metaphors, then examining good angels as guardian spirits assigned to protect and guide the elect, and finally focusing extensively on evil angels or devils who wage spiritual warfare against Christians through temptation and deception. The third section of this book is the longest, focusing on fallen angels (devils) and their powers and constraints. Lawrence details their primary ministry as temptation to sin, analyzing their methods of spiritual warfare including fiery darts of lust and despair, and their particular focus on opposing worship of God, the Gospel of Christ, and the Christian church. The book concludes with an extended exposition of the spiritual armor described in Ephesians 6, which Lawrence presents as the necessary equipment for successful spiritual combat. This treatise draws heavily from the scholastic tradition for its angelology, but Lawrence also emphasizes practical application throughout, arguing that understanding angelic operations is essential for Christian living and spiritual warfare rather than mere speculative knowledge.\nHis third treatise was published in 1649 and titled Some Considerations Tending to the Asserting and Vindicating of the Use of the Holy Scriptures, and Christian Ordinances; Against the Practice and Opinions of Certaine Men of These Times''. This second book on baptism was principally a reply to William Dell's Doctrine of Baptismes. Dell’s treatise contends that all Christian baptism is now spiritual — life-giving immersion of the believer into Christ by the Holy Spirit — and that the external water was only to be used with John's baptism prior to Pentecost, not Christ's baptism after. This book, unlike his earlier book on baptism — being a refutation of the views of Dell and others like him —, is more polemical in nature. Lawrence, argues against the \"spiritual levellers\" who claim that external religious observances such as baptism, communion, preaching, and church fellowship are unnecessary for spiritually mature Christians. The book is divided into two main sections: a defense of biblical authority against those who either rejected Scripture or rendered it meaningless through excessive allegorical interpretation, and a vindication of Gospel ordinances, particularly focusing on water baptism against groups who argued that Christ's baptism was purely spiritual and did not involve water.\nFamily and Personal Life\nAncestors\nThe Lawrence family traced their lineage to ancient English nobility, with their first celebrated ancestor being Sir Robert Lawrence of Ashton Hall, Lancashire. Born about 1150, he accompanied Richard the Lionheart on the Third Crusade, and distinguished himself in the Siege of Acre in 1191 by scaling the walls of Acre and being the first to plant the banner of the cross on the battlements of Acre. For this distinguishing courage, he received the honors of knighthood from King Richard, as well as a coat of arms.\nThe major political relevance of the Lawrence family began in the 1500s with John (often styled \"the Generous\") Lawrence, whose uncle — also named John Lawrence — was an abbot who was very active in promoting the dissolution of monasteries under King Henry VIII; in return for this support, King Henry granted the abbot and his family rich titles, grants, and pensions. John the Generous had three children, Agnes, Emma, and William Lawrence; William was the great-grandfather of Henry Lawrence.\nWilliam Lawrence (d. 1572), established the family at St. Ives, where Henry Lawrence would grow up. William married twice, and by his first wife, Frances Houston, had sons William and Henry. This Henry Lawrence was grandfather to Henry Lawrence the Lord President. Henry married Elizabeth, daughter of John Hagar, of Bourne Castle, Cambridgeshire, and had by her Sir John Lawrence — father of Henry Lawrence the Lord President.\nMarriage and Personality\nOn 21 October 1628 Lawrence married Amy Peyton, daughter of Sir Edward Peyton, Baronet, of Iselham, Cambridgeshire. His wife's extraordinary piety made their family a fertile source of Cavalier satire.\nMilton addressed his twentieth sonnet to Henry Lawrence and his son Edward (\"Lawrence! of virtuous father virtuous son\"). In Milton's sonnet — during a time when Cromwell's government sought the repression of various recreations they regarded as unsuitable for proper Christians — the speaker invited Edward Lawrence to partake of graceful and well-chosen pastimes: to \"wast a sullen day\" with food, wine, and song beside a cozy fire. Milton pointed to the lilies of the field who, according to Jesus in Matthew 6:28-29, neither spun or sowed, yet nevertheless enjoyed God's favor and protection.\nAntiquarian Anthony Wood accused Lawrence of having an arbitrary disposition; Wood reported that Lawrence illegally prosecuted Cavaliers, anabaptists, and Fifth-monarchy men — banishing and imprisoning them without any other cause besides a suspicion of their being hostile to the existing government. However, other contemporaries had a more favorable view of him; John Milton praised his ability and learning, puritans Isaac Ambrose and Richard Baxter commended his treatise on angels, and the Queen of Bohemia wrote to express her confidence that he had accepted his government post only that he might render services to those who needed them. Lawrence was also known for his strong family bonds; the dedication he wrote in his treatise on angles to \"his most dear and most honoured mother, the Lady Lawrence\" was described as a touching display of filial affection.\nThroughout his life, Lawrence maintained scholarly correspondence. In a Latin letter he sent on 21 January 1646, Lawrence noted the continental preference for French over Latin, observing that nobles and scholars \"love the French language so much that they would rather speak three words badly in French than speak copiously and eloquently in Latin.\"\nHe adopted, likely about the time he was appointed a member of the Council of State, the personal motto Nil Admirari (to be astonished by nothing). It is a fragment of a longer verse from the stoic poet Horace: \"Nil admirari prope res est una, Numici, solaque quae possit facere et servare beatum\" (To be astonished by nothing is just about the one and only thing, Mr. Numicius, that can make and keep a man happy).\nDescendants\nHenry and Amy Lawrence had seven sons and six daughters. Among their children were:\n* Edward Lawrence (d. 1657), to whom Milton addressed his twentieth sonnet,\n* John Lawrence (d. 1690), who left England and emigrated to Jamaica, where he founded a wealthy dynasty of plantation owners, and\n* Theodosia (d. 1664), Martha (d. 1664), and William Lawrence, who were born while Henry was in Holland and who had to be naturalized by an act of Parliament on November 27, 1656, following his return to England.\nNotes\nReferences\nSources\n* Endnotes\n**Gent. Mag. 1815, pt. ii. pp.&nbsp;14–17;\n**Notes and Queries, 2nd ser. xii. 177, 3rd ser. vii. 377, viii. 98, 289, 5th ser. xi. 601–3, xii. 212, 6th ser. ii. 155, 174, 298, xi. 208;\n**Cal. State Papers, Dom. 1652–9; Waters's Chesters of Chicheley, i. v;\n**Cussans's Hertfordshire, \"Hundred of Hertford\", p.&nbsp;136;\n**Clutterbuck's Hertfordshire, ii. 211, 213;\n**Bishop John Wilkins's Eeclesiastes, 4th ed. p.&nbsp;81;\n**Masson's Life of Milton, iii. 402;\n**Lodge's Peerage of Ireland, ed. Archdall, under \"Barrymore\".\nFurther reading\n*D Brunton & D H Pennington, Members of the Long Parliament (London: George Allen & Unwin, 1954)\n*''Cobbett's Parliamentary history of England, from the Norman Conquest in 1066 to the year 1803'' (London: Thomas Hansard, 1808) [https://web.archive.org/web/20150904125310/http://www2.odl.ox.ac.uk/gsdl/cgi-bin/library?e=p-000-00---0modhis06--00-0-0-0prompt-10---4------0-1l--1-en-50---20-about---00001-001-1-1isoZz-8859Zz-1-0&a=d&cl=CL1]\n*\n*Henry Lawrence, [https://www.geni.com/people/Henry-Lawrence/6000000000272172942 Geni Family Tree]."
    }
  ]
}