{
  "content": [
    {
      "type": "text",
      "text": "# Henuttawy (19th dynasty)\n\nHenuttawy (\"Mistress of the Two Lands\") was an ancient Egyptian princess of the 19th Dynasty and also one of Ramesses II’s Great King’s Wives, a title that was granted to her posthumously.\nBiography\nHenuttawy was a daughter of Pharaoh Ramesses II and the Great Royal Wife Nefertari and half-sister of Merneptah. She is seventh on the lists of Ramesses's daughters and the second of two daughters whose mother is certain to have been Nefertari.\nHer title of Great King’s Wife is clearly attested on the walls of her tomb, where she is referred to as “the King’s Daughter, his beloved, Great King’s Wife.” In the tomb, she is also called “Mistress of the Two Lands,” a title common to the wives of Ramesses II. However, her designation as queen was likely granted posthumously, to enhance her eligibility for burial in the Valley of the Queens. During her lifetime, she was a princess rather than a queen.\nHer statue stands in the small Abu Simbel temple, built for Nefertari. The children of Nefertari are usually identified on the basis of this temple: the princes Amunherkhepeshef, Pareherwenemef, Meryre and Meryatum and the princesses Meritamen and Henuttawy. Henuttawy is not depicted on the facade of the large Abu Simbel temple, where the first two sons and the six eldest daughters of Ramesses are shown, along with Nefertari and Queen Mother Tuya.\nTomb QV73\nHer tomb in the Valley of the Queens, QV73 is not far from those of other members of Ramesses's family (QV68 – Meritamen, QV71 – Bintanath, QV75 – Henutmire); it is between the tombs of her elder half-sister Bintanath and the 20th dynasty queen Duatentopet (QV74). QV73 remains closed to visitors due to numerous faults and structural concerns related to open joints, and bedding plane tilting.\nThe tomb may have been carved for a generic princess and after Henuttawy's death was adapted for her. In some areas of the tomb the cartouches are blank, but in the main burial chamber faint traces of her name have been recorded. The tomb consists of a burial chamber with two pillars and two side rooms. The decorations resemble those in the tomb of Nefertari.\nSee also\n* List of children of Ramesses II\nSources\nExternal links\n* [https://thebanmappingproject.com/tombs/qv-73-princess-henuttauy Theban Mapping Project] – Plan of the tomb and other details."
    }
  ]
}