{
  "content": [
    {
      "type": "text",
      "text": "# Hephthalite–Sasanian War of 484\n\nMihran\n| strength1         = Unknown\n| strength2         = Unknown\n| casualties1       = Unknown\n| casualties2       = Entire army\n}}\nThe Hephthalite–Sasanian War of 484 was a military confrontation that took place in 484 between an invading force of the Sasanian Empire under the command of Peroz I and a smaller army of the Hephthalite Empire under the command of Khushnavaz. The battle was a catastrophic defeat for the Sasanian forces who were almost completely wiped out. Peroz, the Sassanid king, was killed in the action.\nContext\nIn 459, the Hephthalites occupied Bactria and were confronted by the forces of the Sassanid king, Hormizd III. It was then that Peroz, in an apparent pact with the Hephthalites, killed Hormizd, his brother, and established himself as the new king. He would go on to kill the majority of his family and began a persecution of various Christian sects in his territories.\nPeroz quickly moved to maintain peaceful relations with the Byzantine Empire to the west. To the east, he attempted to check the Hephthalites, whose armies had begun their conquest of eastern Iran. The Romans supported the Sassanids in these efforts, sending them auxiliary units. The efforts to deter the Hephthalite expansion met with failure when Peroz chased their forces deep into Hephthalite territory and was surrounded. Peroz was taken prisoner in 481 and was made to deliver his son, Kavadh, as a hostage for three years, further paying a ransom for his release.\nIt was this humiliating defeat which led Peroz to launch a new campaign against the Hephthalites.\nBattle\nIn 484, after the liberation of his son, Peroz formed an enormous army and marched northeast to confront the Hephthalites. The king marched his forces all the way to Balkh where he established his base camp and rejected emissaries from the Hunnic king Khushnavaz. Peroz's forces advanced from Herat to Balkh. The Huns, learning of Peroz's way of advance, set up an ambush for him. In the ensuing battle, Peroz was defeated and killed by a Hephthalite army near Balkh. His army was completely destroyed, whilst his body was never found. Four of his sons and brothers had also died. Many of his retinue, including his daughter, were taken prisoner by the Hephthalites, who also seized his treasure. The main Sasanian cities of the eastern region of Khorasan−Nishapur, Herat, and Marw were now under Hephthalite rule.\nIn Procopius's account, the Hephthalites used an overextended and camouflaged ditch to defeat the Sasanians, but the Khonsarinejad et al. (2021) argues the ditch story to be dubious.\nAftermath\nThe Huns invaded the Sassanid territories which had been left without a central government following the death of the king. Much of the Sassanid land was pillaged repeatedly for a period of two years until a Persian noble from the House of Karen, Sukhra, restored some order by establishing one of Peroz's brothers, Balash, as the new king. The Hunnic menace to Sassanid lands continued until the reign of Khosrau I. Balash failed to take adequate measures to counter the Hephthalite incursions, and after a rule of four years, he was deposed in favor of Kavadh I, his nephew and the son of Peroz. After the death of his father, Kavadh had fled the kingdom and took refuge with his former captors, the Hephthalites, who had previously held him as a hostage. He there married one of the daughters of the Hunnic king, who gave him an army to conquer his old kingdom and take the throne. The Sassanids were made to pay tributes to the Hephthalite Empire until 496 when Kavadh was ousted and forced to flee once again to Hephthalite territory. King Djamasp was installed on the throne for two years until Kavadh returned at the head of an army of 30,000 troops and retook his throne, reigning from 498 until his death in 531, when he was succeeded by his son, Khosrau I.\nAccording to Irfan Shahid, the tactic of using trenches by the Hephthalites in this war was adopted by the Persians who successfully used it later at the Battle of Thannuris (528) against the Byzantines. The Persian tactic was subsequently adopted and successfully used by the Byzantines at Battle of Dara (530) and even by the Muslims at the Battle of the Trench (627).\nReferences\nSources\n* David Christian (1998). [https://books.google.com/books?id=Mv9jKIwxuAsC A history of Russia, Central Asia, and Mongolia]. Oxford: Wiley-Blackwell, .\n* Richard Nelson Frye (1996). [https://books.google.com/books?id=0RSXSu1x9hwC The heritage of Central Asia from antiquity to the Turkish expansion]. Princeton: Markus Wiener Publishers, .\n* Ahmad Hasan Dani (1999). [https://books.google.com/books?id=FcKtIPVQ6REC History of civilizations of Central Asia: Volumen III]. Delhi: Motilal Banarsidass Publ., .\n*\n*\n*\n*\n*\n*"
    }
  ]
}