{
  "content": [
    {
      "type": "text",
      "text": "# Herbert Coward\n\n| birth_place  = Haywood County, North Carolina, U.S.\n| death_date   =\n| death_place  = Haywood County, North Carolina, U.S.\n| occupation   = Actor\n| years_active = 1972–2013\n| spouse       =\n| children     =\n}}\nHerbert Lee \"Cowboy\" Coward (August 21, 1938 – January 24, 2024) was an American actor. He played one of two sadistic mountain men in John Boorman's 1972 film Deliverance (with Bill McKinney), and several of his lines became infamous in pop culture.\nEarly life\nCoward was born in 1938 in Haywood County, North Carolina, the ninth child of Fred and Moody Parker Coward. His mother died at a young age, so he left school and began working a variety of itinerant labor jobs to help support the family, including at an orchard and operating heavy machinery. After getting married in the early 1960s and briefly living in Raleigh, he moved back to the mountains with his wife when she became homesick.\nCareer\nAfter returning home, a friend offered Coward a job as an outlaw gunfighter at the Old West amusement park, Ghost Town in the Sky in Maggie Valley. While performing at the park with an assortment of acting school students working over their summer break, locals, and professional actors, an accident with a prop pistol resulted in two of his front teeth being knocked out. Known actors, including Dan Blocker, who starred on Bonanza, performed at the park, and one summer, based on his appearances on Gunsmoke, Burt Reynolds appeared there. During this time, Reynolds and Coward became friends. In 1970, when Deliverance began filming in Rabun County, Georgia, Blocker mentioned to producers that Coward would be an ideal person for a role in the film; they were unable to locate him, so wrote his name on a potential cast board as \"Cowboy Coward\". Reynolds saw this and called Coward to recruit him for the role, telling the producers \"...he can’t write or anything, but I’m telling ya, if we can get him, we got something special. Let me bring him in. His name’s Cowboy, and he’ll just talk to you, and you see if you like him.\" Coward was subsequently cast as \"Toothless Man\", one of the two sadistic mountain men encountered in the woods by Reynolds and the film's other characters. Like the others in the film, Coward performed his own stunts, including being lowered off a cliff into a river. Upon the film's release he became infamous for his often repeated line \"He got a real purty mouth, ain’t he?\"\nAfter appearing in the film, Coward worked at the BASF factory in Asheville, North Carolina for 27 years. He also appeared in one other film, Ghost Town: The Movie (2007), and on television's Hillbilly Blood in 2013.\nCowboy Coward was featured in an episode of the Discovery Channel show \"Moonshiners\".  He plays the caretaker of the abandoned amusement park \"Ghost Town\" and two of the show's moonshiners meet with him to ask if they can hide their bootleg whiskey in the abandoned town to let it age.\nDeath\nOn January 24, 2024, Coward, his girlfriend, Bertha Brooks, and their pet Chihuahua and pet squirrel were killed when their vehicle collided with a truck on Highway 19 between Clyde and Canton, North Carolina. Neither Coward nor Brooks were wearing seatbelts. He was 85.\nLegacy\nCoward's performance and physical appearance in Deliverance has provided inspiration for other media, most notably the main character from the Primus video \"My Name Is Mud\", which also sampled lines from the film.\nReferences\nExternal links\n*"
    }
  ]
}