{
  "content": [
    {
      "type": "text",
      "text": "# Herbert King\n\n| birth_place = Santa Marta, Colombia\n| death_date  =\n| death_place = Bogotá, Colombia\n| death_cause =\n| other_names =\n| spouse      =\n| partner     =\n| occupation  = Actor\n| children    =\n| relatives   = Radamel García (brother)Alex García King (brother)Radamel Falcao (nephew)\n| nationality =\n}}\nHerbert García King (16 December 1963 – 2 August 2018), known artistically as Herbert King, was a Colombian actor.\nBiography\nKing was born in the city of Santa Marta and in his youth moved to England, where he had his training in dramatic art. Back in his native country he moved to the city of Bogotá where he began his career as an actor. After a minor appearance in the series The alternative of the scorpion, he joined the cast of Guajira, popular telenovela of 1996 by RCN Televisión. Two years later he played the role of Bernabé in the short film by Sergio Cabrera, Golpe de Estadio. A year later he joined the cast of the series Francisco the mathematician in the role of Octavio Tobón.\nHe started the 2000s with a participation in the telenovela Alejo, the search for love, followed by appearances in soap operas Pedro el escamoso, Pasión de Gavilanes, La saga, negocio de familia, La Tormenta, En los tacones de Eva, Nuevo rico, nuevo pobre. Also in the same decade he joined the cast of films like Perder es cuestión de método, Mi abuelo, mi padre y yo and La immoral ministra.\nIn the decade of 2010 its participation in the Colombian television continued being active, registering appearances in series and telenovelas like El capo, Sin tetas no hay paraíso, Bella calamidades, ¿Dónde carajos está Umaña?, Tres Caínes, and Diomedes, el cacique de la junta. In 2017 he acted in the Spanish film Loving Pablo, directed by Fernando León de Aranoa. He died on 2 August 2018, of a heart attack in the Clinic La Colina in Bogota.\nFilmography\n* 1992 – La alternativa del escorpión\n* 1996 – Guajira\n* 1998 – Golpe de estadio\n* 1999 – Francisco el matemático\n* 2000 –\n* 2001 – Pedro el escamoso\n* 2003 – Pasión de gavilanes\n* 2004 – Perder es cuestión de método\n* 2004 – La saga, negocio de familia\n* 2005 – La Tormenta\n* 2005 –\n* 2005 – Juego limpio\n* 2006 – En los tacones de Eva\n* 2007 – Nuevo rico, nuevo pobre\n* 2007 –\n* 2008 – Sin senos no hay paraíso\n* 2008 – Doña Bárbara\n* 2009 – El capo\n* 2010 – Sin tetas no hay paraíso\n* 2010 – Ojo por ojo\n* 2010 – Bella Calamidades\n* 2012 – Lynch\n* 2012 –\n* 2013 – Tres Caínes\n* 2015 – Diomedes, el cacique de la junta\n* 2017 – Loving Pablo\nReferences\nExternal links\n*"
    }
  ]
}