{
  "content": [
    {
      "type": "text",
      "text": "# Heritage Models\n\nHeritage Models was an American game company that produced role-playing games, metal miniatures, and game supplements.\nWargaming and fantasy miniatures\nHeritage Models, a manufacturer of metal miniature wargaming soldiers, was founded by Jim Oden in the 1970s in Dallas, Texas. In 1974 Oden also opened a retail games store, The Royal Guardsmen. Oden ran into cash flow problems, and in January 1977 agreed to merge with Custom Cast, a miniatures company founded by Duke Seifried that specialized in the new market of fantasy miniatures for the burgeoning role-playing game market. Siefried and Oden agreed to merge Custom Cast, Heritage Models, and The Royal Guardsman under the Heritage Models name. Seifried moved to Dallas to support the new company. Siefried created licensed lines for several Hollywood and fantasy fiction properties such as Conan the Barbarian, Lord of the Rings, and John Carter of Mars.\nGame historian Shannon Appelcline noted that \"Seifried [was] one of the most influential people in the early hobbyist miniatures market. He created the idea of blister packs, to sell sets of infantry rather than individual figures, and later came up with the idea of including figures with slightly different poses in those packs. More importantly for the RPG industry, he came up with the phrase 'adventure gaming' — which was used to differentiate RPGs from 'wargaming' in the earliest days of the hobby.\"\nHeritage USA\nAfter continued financial hurdles in 1979, Seifried was in a restaurant talking with Jerry Campbell of Military Model Distributors about the need for a cash infusion to his company; by chance, they were overheard by millionaire Ray Stockman, who was won over by Seifried's arguments. Stockman bought out Jim Oden's share of the company, and Heritage Models was reborn as Heritage USA, itself a division of Heritage International.\nThe new company started to produce role-playing games such as Star Trek: Adventure Gaming in the Final Frontier.\nBoard games\nIn the late 1970s, Heritage USA added Gametime Games to their portfolio, and produced board games such as Quest.\nWargame company Battleline Publications also merged into Heritage USA to speed its growth, and the company started to publish wargames such as Circus Maximus, a combination of a racetrack-based game called Chariot Racing and a one-on-one combat game called Gladiator\nHeritage sold off the Battleline operation to Avalon Hill in October 1979. The new owners promptly published the two components of Circus Maximus as two separate games the following year. While Gladiator retained its original title, Chariot Racing was renamed Circus Maximus.\nMicrogames\nIn the early 1980s, Heritage USA formed the Dwarfstar Games line, which produced fantasy and science fiction microgames such as Barbarian Prince and Outpost Gamma.\nDemise\nIn 1982, Seifried left Heritage and joined TSR to help them produce their own line of fantasy miniatures.\nHeritage USA went out of business the next year.\nProducts\n*Der Kriegspielers Fantastiques, a line of 25mm fantasy wargame figures.\n*Star Trek: Adventure Gaming in the Final Frontier (1978).\n*John Carter, Warlord of Mars (1978)\n*Circus Maximus (1979)\n*The Knights and Magick Rules Set (1980)\n*Star Commandos (board game, 1980)\n*Swordbearer (1982)  Fantasy Games Unlimited purchased the rights to Swordbearer, and also bought Heritage's old stock, something that FGU's Scott Bizar felt was a necessary part of such a deal.\nDwarfstar Games\nGametime Games\n*Quest (board game, 1978)\n*Spellmaker (board game, 1978)\n*Strange New Worlds (board game, 1978)\n*Grand Imperialism  (board game, 1978)\nReferences"
    }
  ]
}