{
  "content": [
    {
      "type": "text",
      "text": "# Heritage Mall\n\n| opening_date = November 2, 1988\n| developer = County Fair Mall Associates\n| manager = Namdar Realty Group\n| owner = Namdar Realty Group\n| number_of_stores = 50+\n| number_of_anchors = 5\n| floor_area =\n| floors = 1\n| website =\n}}\nHeritage Mall is a shopping center in Albany, Oregon, United States. Anchored by Hobby Lobby, Ross Dress For Less, and Target, the  mall opened in 1988. Located near the junction of Interstate 5 and U.S. Route 20, the mall sits on  and is the largest in the Albany-Corvallis-Lebanon metropolitan area.\nHistory\nA groundbreaking ceremony has held in August 1987 and the shopping center was expected to cost $21.5 million to construct. There was a competing proposal to build a regional shopping center in nearby Corvallis that was later abandoned by its developer. The mall opened on November 2, 1988, with 28 permanent tenants and seven temporary tenants for the Christmas shopping season.\nThe mall started with three anchor stores and plans for 60 to 70 other stores. Troutman's Emporium and J. C. Penney were announced as the first anchors to sign-up for the center in August 1987, with Target later becoming the third anchor. Emporium was to occupy a  space, while the J. C. Penney store was . Robacor Associates and Roebbelen Land Company of California developed Heritage Mall.\nThe owners of the center filed for bankruptcy in December 1994, still owing $9.16 million to the contractors who built the mall. In August 2005, Heritage Mall was sold to Steadfast Commercial Properties of California for $34 million. Gottschalks opened a store at Heritage in 2005, which closed in 2009. At the time Gottschalks opened, other anchors were Target, Sears, Ross Dress for Less, and Old Navy. The mall was remodeled in 2006. The center was sold by Jones Lang LaSalle in December 2012 to Vintage Real Estate. In May 2013, Hobby Lobby announced plans to open its first store in Oregon in the former Gottschalks space.\nIn October 2014, Sears announced that it would close its store in the mall in early 2015.\nSee also\n*List of shopping malls in Oregon\nReferences"
    }
  ]
}