{
  "content": [
    {
      "type": "text",
      "text": "# Heritage buildings in Edmonton\n\nHeritage buildings in Edmonton, as elsewhere in Canada, may be designated by any of the three levels of government: the Government of Canada (federal government), the Government of Alberta (provincial government), or the City of Edmonton (municipal government).\nFederal sites\nthere are currently ten sites in Edmonton with plaques erected by Parks Canada and listed in the Directory of Designations of National Historic Significance of Canada, and one recommendation to create a new plaque in Edmonton.  Only National Historic Sites commemorate buildings, and there are only two National Historic Sites in Edmonton: the former location of Fort Edmonton near the Alberta Legislature Building, and Government House. There are also four plaques for National Historic People and National Historic Events in the city.\nThe federal government also has a separate heritage register for buildings it owns, under the Federal Heritage Buildings program. In Edmonton, two buildings are listed:  the Grierson Centre's former RCMP Centre Building 3 (now a prison), and the Headquarters Army Western Command Building J-3 at CFB Edmonton.\nThe only other heritage recognition provided to buildings by the federal government is that of Heritage Railway Station under the Heritage Railway Stations Protection Act (because railways are federally regulated). The former Strathcona Canadian Pacific Railway Station is one such station.\nProvincial sites\nFirst Presbyterian Church was completed in 1912 and designated a Provincial Historic Resource in 1978.]]\nThis plaque from the McLeod Building, signifies a Provincial Historic Resource.\nHistoric designation in Alberta is governed by the Historical Resources Act.  Sites owned and run by the provincial government as a functioning historic site or museum are known as Provincial Historic Sites.  The two Provincial Historic Sites in Edmonton are the Royal Alberta Museum, and Rutherford House.  Buildings and sites owned by private citizens and companies or other levels or branches of government may gain one of two levels of historic designation: \"Registered Historic Resource\" or \"Provincial Historic Resource\" (the later being the higher designation).  There are 54 Provincial Historic Resources and 30 Registered Historic Resources listed with the Alberta Register of Historic Places within Edmonton city boundaries. Since 2007 the provincial government has also recognized the Old Strathcona district as a \"Provincial Historic Area\", only the second such area in Alberta.\nThe province also lists buildings deemed historically significant by municipal governments on the Alberta Register of Historic Places, which is also part of the larger Canadian Register of Historic Places although this does not imply provincial or federal government status or protection.\nMunicipal sites\nThe City of Edmonton maintains the \"Register of Historic Resources in Edmonton\" which has several different categories of buildings and sites: Municipal Historic Resources (76 sites), A-List Resources (190 sites), and B-List Resources (305 sites), for a total of 571 sites on the register.  Sites can be put on the Register, which is simply a list of buildings the city deems \"historic,\" by the City's staff at any time without the knowledge of the owner or city council.  However the owner must be notified and city council must vote to approve designating a building as a Municipal Historic Resources.  Only Municipal Historic Resources are protected from demolition.  In addition to this the City publishes a list of historic resources that were demolished after being added to the register.  In the last report 27 historic buildings were listed as demolished.  As an appendix to the Register, the City also lists all buildings at the municipal Fort Edmonton Park museum, and historically significant landscapes, cemeteries and monuments, street furnishings, and architectural fragments.\nThe Hotel Macdonald opened in 1915 and became a Municipal Historic Resource in 1984.\nSee also\n* List of tallest buildings in Edmonton\n* Regina's historic buildings and precincts\nReferences"
    }
  ]
}