{
  "content": [
    {
      "type": "text",
      "text": "# Heritage Symphonies\n\nHeritage Symphonies () is a cultural foundation project founded in 2019 in Yemen, it aims to promote and disseminate folk music, by integrating it into an orchestral performance that combines folk music styles and traditional instruments with Western instruments.\nIn addition to the music, the project showcases the performers with their distinctive cultural identity, represented by musical instruments, traditional rhythms, folk dance, and traditional dresses, in addition to presenting other cultural events accompanying the concert activities.\nEvents\nIn 2019, Mohamed Al-Ghoom performed an orchestral concert in Kuala Lumpur, Malaysia, titled \"Hope from the depth of pain\". He led an orchestra comprising 90 musicians, including 30 from Hadramout, who played on traditional Hadrami musical and percussion instruments while the other musicians were from China, India, Malaysia, Japan, and Uzbekistan.\nOn March 10, 2022, Mohamed led a second orchestral concert titled \"Yemeni melody on the banks of the Nile\" in Cairo, in which more than 120 musicians of different nationalities performed on the stage of the Grand Theater at the Egyptian Opera House, and eight musical pieces of traditional colors was presented in an orchestral format.\nin the Théâtre Mogador]]\nOn October 2, 2023, a third orchestral concert titled \"Yemeni tune in Paris\" was held in France.\n{| class=\"wikitable\"\n|+\n!Event name\n!Location\n!Date\n!Video Link\n|-\n|Hope from the depth of pain\n|\n|13 April 2019\n| –\n|-\n|Yemeni melody on the banks of the Nile\n|\n|10 March 2022\n|[https://www.youtube.com/watch?v=wsZ02rbO4is&list=PLQvSBzNn6W83qkTVjXSQi4t76I1Rt9b5Z&index=20]\n|-\n|Yemeni tunes in Paris\n|\n|2 October 2023\n| [https://www.youtube.com/watch?v=jm40WrMA8pg&ab_channel=%D8%B5%D8%AF%D9%89%D8%A7%D9%84%D8%A5%D8%A8%D8%AF%D8%A7%D8%B9SadaAlebda]\n|-\n|The Hadhrami Orchestra\n|\n|18 October 2023 changed to 18-19 February 2024\n| –\n|-\n|Yemeni Tunes in Doha\n|\n|20 June 2024\n|[https://www.youtube.com/watch?v=6PhDy7tiXp0&ab_channel=%D8%B5%D8%AF%D9%89%D8%A7%D9%84%D8%A5%D8%A8%D8%AF%D8%A7%D8%B9SadaAlebda]\n|-\n|Yemeni Orchestra\n|\n|17 November 2024\n| [https://www.youtube.com/watch?v=9w-Of0JVX0w&t=5905s&ab_channel=%D8%A7%D9%84%D8%AB%D9%82%D8%A7%D9%81%D9%8A%D8%A9]\n|-\n|\n|\n|29-30 November 2024\n| –\n|-\n|\n|\n|8-9 January 2025\n|–\n|-\n|Tunes in Dubai\n|\n|25 January 2025\n|\n|-\n|\n|\n|20 February 2025\n|–\n|-\n|\n|\n|April 24 and 25, 2025\n|–\n|-\n|\n|\n|\n| –\n|}\nReception and critics\nThe project achieved significant popularity in Arab media, garnering millions of views on television broadcasts and YouTube, and receiving widespread acclaim from music critics. Furthermore, “Yemeni Melody in Paris” won the first prize in the variety programs and artistic evenings category at the Arab Radio and Television Festival.\nBox office\nThe project’s concerts have experienced strong commercial success, with nearly all events selling out. For instance, tickets for the “Yemeni Melody in Doha” concert at the Opera House in Katara Cultural Village (15 May 2024) sold out within two hours of going on sale. In Kuwait, tickets for the concert titled “Hadrami Orchestra” at Sheikh Jaber Al-Ahmad Cultural Centre (18 February 2024) were sold out within a week, prompting organisers to add an additional performance on 19 February. In Oman, tickets for the upcoming “Traditional Symphonies of Yemen” concert at the Royal Opera House Muscat (24–25 April 2025) were completely sold out only a few days after sales began—approximately seven months before the event. Similarly, tickets for Dubai’s “Tunes in Dubai” concert at Dubai Opera (23 January 2025) sold out within days, and for the “Yemeni Orchestra in Riyadh” concert the entire allotment, including premium tickets priced at 500 Saudi riyals, was sold out in less than 24 hours.\nCritical response\nUpon its debut concert in Kuala Lumpur, Malaysia, the project was met with a generally positive reception within the Yemeni cultural environment, with many reviewers praising its diversity and the innovative fusion of traditional Yemeni music with orchestral elements. However, following subsequent concerts, several prominent Yemeni music critics voiced sharp reservations regarding various aspects of the project, including its naming, the conductor's approach and competency, and a perceived lack of diversity and inclusion—particularly regarding fair opportunities and gender diversity. While the project continued to receive positive among non-Yemeni critics, concerns were further raised about the project's overall vision and selection process, especially in light of its substantial financial backing from Saudi businessmen and the influence of political involvement introduced by the Yemeni government on its presentation.\nA notable review was penned by the Yemeni music critic Jaber Ali Ahmed on the Khuyut platform. Ahmed contended that the used titles such as “Heritage Symphonies” or “Hadrami Orchestra” were misleading because the majority of orchestra’s membership includes musicians from several countries, not solely Yemenis. He argued that the project naming “contains a lot of propaganda” by implying a nationalistic composition that does not exist. Ahmed further questioned whether the works performed truly merited the term “symphonies” and criticised conductor Mohamed Al-Ghoom’s approach; he noted that “conducting is not just holding a baton and moving it in front of the band”, citing an instance from a Cairo concert where the pianist appeared to play without receiving a clear signal from Al-Ghoom. Moreover, he criticised the generous funding from the Hadhramout Culture Foundation, suggesting that such resources might have been more effectively invested in reviving local musical institutions such as the Mohammed Juma Khan Institute for Music and Fine Arts.\nIn contrast, another Yemeni music critic Gamal Hasan offered a more nuanced appraisal, initially at the launch of the project, in his review of the Hadrami Orchestra concert held in Kuala Lumpur, Malaysia. Hasan credited the performance with giving Hadrami music a new voice and introducing traditional Yemeni elements to an international audience. He particularly noted the hybridisation of instruments – for example, the integration of the traditional takht with the full orchestra – as a decisive factor in the presentation. Hasan also highlighted the cultural significance of staging such an event during a period of humanitarian challenges in Yemen, praising the performance of musicians such as violinist Ayman Issa.\nHasan’s tone became more critical following later concerts. Reviewing the “Yemeni Melody on the Banks of the Nile” event in Cairo, published in AlAraby Al-Jadeed under the title “A Yemeni Melody Lost on the Banks of the Nile”, he questioned whether the concert fulfilled its musical commitments to modern orchestral expression of Yemeni heritage. Hasan described the performance as overly celebratory at the expense of substantive musical development. He observed that elements which had worked well in Malaysia were inconsistently executed in Cairo, with traditional instruments such as the qanbūs and mizmar—and even the Egyptian choir—deployed in ways that he felt were musically inappropriate.\nHasan further questioned the decision to include a choral group in a manner he considered unrefined, describing their performance as “empty and devoid of ornaments”, akin to a school chant. He also attributed part of the concert’s shortcomings to the involvement of the project’s main sponsor, Saudi businessman and the Chairman of Hadhramaut Culture Foundation, Abdullah Ahmed Bugshan, suggesting that despite the substantial financial investment, the overall musical execution was incoherent.\nFormer Minister of Culture, Khaled al-Rowaishan, commented on the concert held at the Cairo Opera House. He stated, \"Yes, we saw what amazed us, but we were not amazed by what we heard!\" While he acknowledged the impressive scale of the performance—citing the large ensemble of musicians, the elaborate stage design, the substantial audience, and the effective use of photography and lighting, as well as expressing pleasure at recognising prominent Yemeni figures in attendance—he also voiced reservations about the  auditory experience. In his remarks, he observed:\n}}\nAl-Rowaishan specifically criticised the renditions of \"The National Anthem\" and \"Khatar Ghusn Algana,\" describing their performance as overly processed. He argued that these revered Yemeni melodies should be approached with caution and professionalism, and presented with clarity, purity, and the full strength of their words and melody. Furthermore, he recalled the performance of musician Ahmed bin Ghodel over twenty years ago, who led a large operetta based on a modest traditional musical phrase “Khaylat Baraqan Lama’a”—a performance he regarded as his greatest achievement because it remained true to the essence of the original melody.\nLater, after a concert in Qatar, Gamal Hasan argued that the project fell into orientalist tropes that rendered Yemeni musical culture static and undeveloped. He stressed the need for more innovative treatment of heritage themes—for example, by employing processes such as motif development and thematic variation.\nFollowing the Paris concert in Mogador Theatre, coverage by Shabwah Press highlighted additional criticism from Yemeni musicians and cultural commentators. Some critics questioned the logistical costs of the project given Yemen’s ongoing conflict and economic hardship. They also noted that, despite claims of targeting an international audience, the majority of attendees appeared to be members of the Yemeni diaspora. They also raised concerns about whether the project founders genuinely prioritised the inclusion of Yemeni talents from the contemporary musical scene—without bias or ulterior motives.\nShabwah Press notably highlighted the disappointment of Yemeni pianist Saber Bamatraf, who expressed his frustration at not being invited to participate in the Paris concert, despite having applied during the project's open call for Yemeni musicians residing in Europe. Bamatraf was particularly surprised to learn that a non‐Yemeni pianist had been selected. He stated that he did not receive any invitation or further communication, contrary to the organisers' claim, despite repeatedly expressing his interest. This omission has raised significant questions within the Yemeni cultural community regarding the selection process and its underlying rationale. In this context, and after Doha's concert, music critic Gamal Hasan further emphasised that the artistic process requires an interplay of diverse ideas, cultural perceptions, fairness, and musical experience to enrich Yemeni and Hadrami art. Citing Bamatraf's self-initiated attempt to renew a specific Yemeni folk song, Hasan argued that without long-term institutional support and clear developmental and inclusive strategies, the project risks becoming little more than a fleeting spectacle.\nIn response to these criticisms, Maestro Mohamed Al-Ghoom—the project’s founder—offered a detailed defence of the initiative. Al-Ghoom responded to accusations that the project was not “classical music” by asserting that it had been developed in consultation with a specialised advisory team and that it sought to blend classical elements with Yemeni heritage music within the framework of world music. He also clarified that while some concerts were funded by sponsors and hosted by international opera houses or festivals, the project was not reliant on state funding and aimed for self-sufficiency. Addressing the critique that the project did not resolve Yemen’s political or economic issues, Al-Ghoom stated that its purpose was solely to spread Yemeni culture worldwide and to serve as a means of artistic communication. In an interview with Shabab House, he further explained that musician selection was based on both technical proficiency and the ability to collaborate effectively, and he welcomed all feedback that could help improve future performances.\nReferences\nExternal links"
    }
  ]
}