{
  "content": [
    {
      "type": "text",
      "text": "# Heritage Foundation of Newfoundland and Labrador\n\n}}\nThe Heritage Foundation of Newfoundland and Labrador (HFNL) or Heritage NL is a non-profit Crown corporation of the Government of Newfoundland and Labrador established in 1984 by the Historic Resources Act. Its mandate is to stimulate an understanding of, and an appreciation for, the architectural and intangible cultural heritage of Newfoundland and Labrador. In 2018 HFNL rebranded as Heritage NL for its public-facing work.\nOrganization\nWork to establish Heritage NL started circa 1982 and later a piece of draft legislation was circulated by the Provincial Government with the intent to set up an organization to encourage the restoration and protection of historical and architecturally important elements of built heritage. It was officially formed in 1984 under Part IV of Newfoundland and Labrador's Historic Resources Act. Public folklorist Dale Gilbert Jarvis has been Executive Director since 2021.\nIn 2019, Heritage NL was an inaugural winner of the Jeonju International Award for Promoting Intangible Cultural Heritage, and in 2023 received the Governor General’s History Award for Excellence in Community Programming, presented by Governor General Mary Simon at a ceremony at Rideau Hall, for its work highlighting a number of skills and crafts at risk of disappearing.  It organized a series of events in 2024 to celebrate its 40th anniversary.\nThe foundation has organized a wide range of activities and events, including a long-running student poster contest, mentor-apprentice programs, youth heritage forums, and community-based historical research.\nBuilt heritage\nHeritage NL designates buildings and other structures as Registered Heritage Structures to preserve their history. In 1995, the foundation began a series of architectural inventories for the province, starting with the Bonavista Peninsula region. It also supports restoration projects for heritage structures, provides grants to assist with heritage restoration and ongoing maintenance, and provides interpretative plaques for structures it has designated.\nRegistered heritage districts\nA Registered Heritage District is a geographical areas which \"because of a concentration of older buildings and an absence of any extensive redevelopment, presents an especially powerful and cohesive image of the past.\"\nAs of 2025, Heritage NL had designated six Registered Heritage Districts:\n* Harbour Grace Registered Heritage District, Harbour Grace (1992)\n* Tilting Registered Heritage District, Tilting (2002)\n* Port Union Registered Heritage District, Port Union (2007)\n* Downtown Woody Point Registered Heritage District, Woody Point (2008)\n* Cable Avenue Registered Heritage District, Bay Roberts (2017)\n* Heart's Content Registered Heritage District, Heart's Content (2013)\nIntangible cultural heritage\nIn 2006, the government of Newfoundland and Labrador recognized a need \"to pursue a set of basic, recognized steps in working to safeguard our intangible cultural heritage.\" Following the report, in 2008, Heritage NL was chosen to lead and implement the province's Intangible Cultural Heritage (ICH) Strategy. It is the main centre of expertise in the province involved in ICH safeguarding through awareness-raising, documentation, fostering involvement, providing expert advice, revitalizing endangered ICH. In the fall of 2008, Heritage NL completed a provincial needs assessment to measure the level of awareness of ICH issues at the community level, and to pinpoint key areas where assistance was needed.\nThe mission of the initiative is to sustain ICH in Newfoundland and Labrador for present and future generations, as a vital part of the identities of Newfoundlanders and Labradorians, and as a valuable collection of unique knowledge and customs.  This includes work to document traditional skills and knowledge and initiatives to safeguard culture and traditions for future generations, including organising festivals and special events celebrating different traditions.\nSpecific examples of traditions studied or supported by Heritage NL include Christmas mummering, boat building skills, Lebanese-Newfoundland history, root cellars, aviation history, railway stories, St. Patrick's Day candy, traditional paint colours, folk medicine, fence making, and Guy Fawkes Night.\nSee also\n*Canadian Register of Historic Places\n*History of Newfoundland and Labrador\n*List of historic places in Newfoundland and Labrador\nReferences\nExternal links\n* [http://www.heritagenl.ca Heritage Foundation of Newfoundland and Labrador website]"
    }
  ]
}