{
  "content": [
    {
      "type": "text",
      "text": "# Heritage conservation in Hong Kong\n\n, a declared monument, houses the Antiquities and Monuments Office.]]\nThis article details the history and status of heritage conservation in Hong Kong, as well as the role of various stakeholders.\nAn indication of the size of the built heritage in Hong Kong is given by a territory-wide survey conducted by the Antiquities and Monuments Office (AMO) between 1996 and 2000, which recorded some 8,800 buildings. The preservation of Intangible Cultural Heritage is also an emerging theme.\nGovernment agencies and legislation\nin Causeway Bay is a declared monument since 1982.]]\nIn alphabetical order:\n* Antiquities Advisory Board (AAB)\n* Antiquities and Monuments Office\n* Antiquities and Monuments Ordinance\n* Commissioner for Heritage's Office (CHO), set up on 25 April 2008 under the Development Bureau\n* Hong Kong Government's Central Conservation Section\n* Urban Renewal Authority\nHistoric buildings\nAs of 20 May 2016, there were 114 declared monuments in Hong Kong, and as of February 2013, there were 917 graded historic buildings (153 Grade I, 322 Grade II, 442 Grade III), of which 203 were owned by the Government and 714 by private bodies.\nGrading system\nwas declared a monument in 2008 after media had reported that its owner had begun demolishing the building.]]\nGrades for historic buildings are defined as follows:\n* Grade I: \"Buildings of outstanding merit, which every effort should be made to preserve if possible.\"\n* Grade II: \"Buildings of special merit; efforts should be made to selectively preserve.\"\n* Grade III: \"Buildings of some merit; preservation in some form would be desirable and alternative means could be considered if preservation is not practicable.\"\nSurveys and assessment\nA territory-wide survey on historic buildings conducted by the Antiquities and Monuments Office (AMO) between 1996 and 2000 recorded some 8,800 buildings. A more detailed survey conducted between 2002 and 2004 focused on 1,444 buildings. In March 2005, a seven-member Expert Panel comprising historians and members of the Hong Kong Institute of Architects, Hong Kong Institute of Planners and Hong Kong Institute of Engineers was formed by the Antiquities Advisory Board (AAB) to assess the heritage value of these buildings. The assessment was completed on 19 March 2009. As part of this work, the AMO proposed changes in the grading of historic buildings: 212 buildings to be Grade I, 366 to be Grade II, and 576 to be Grade III, and no grading for the remaining 290 ones. Current grades may be increased, decreased or removed.\nConservation initiatives\n, a declared monument, is being transformed into a heritage hotel with food and beverage outlets, and retail facilities.]]\nConservation initiatives include:\n* Heritage Impact Assessment Mechanism for Capital Works Projects\n* Revitalising Historic Buildings Through Partnership Scheme\n* Restoration\n* Adaptive reuse\n* Relocation: complete (Murray House) or partial (Blake Pier at Stanley)\nIssues\nDemolitions\n: hunger strikers occupied the location in July 2007.]]\nThe demolition of several historic buildings has led to public protest in recent years. This included the Edinburgh Place Ferry Pier (demolition completed in early 2007) and Queen's Pier, demolished in February 2008.\nOther issues\nOther issues include:\n* Ownership of historic buildings and private owners' rights\n* Funding of Heritage conservation programs\nIntangible cultural heritage\nThe preservation of Intangible Cultural Heritage is an emerging theme in Hong Kong, with The Intangible Cultural Heritage Advisory Committee having held its first meeting on July 9, 2008. A territory-wide survey was carried out in 2011.\nRelated museums\n, two Grade III Historic Buildings, house the Hong Kong Heritage Discovery Centre.]]\n* Hong Kong Heritage Discovery Centre, in Kowloon Park. Opened in October 2005, it is now managed by the Antiquities and Monuments Office\n* Hong Kong Heritage Museum (Sha Tin), managed by the Leisure and Cultural Services Department (LCSD)\n* Hong Kong Museum of History (Tsim Sha Tsui) (LCSD)\n* Hong Kong Public Records Building is an archival facility for the preservation of records of the Hong Kong Government. It is run by Government Records Service and located in Kwun Tong near Tsui Ping Estate.\nSeveral other museums are dedicated to heritage and history. Most of them are hosted in historic buildings thematically connected with the displays. Heritage Trails have been opened to facilitate the visit of historic buildings.\nSee also\n* Architecture of Hong Kong\n* Conservation in Hong Kong\n* History of Hong Kong\n* Hong Kong cultural policy\n* List of the oldest buildings and structures in Hong Kong\n* Old Industrial Buildings Revitalization in Hong Kong\n* Pang uk\nReferences\nExternal links\n* [http://www5.lcsd.gov.hk/gishinter/html/onloaddisclaimer_en.htm Geographical Information System of Heritage]\n* [https://web.archive.org/web/20090427095038/http://www.devb-wb.gov.hk/legco_matters/LegCO_Papers_on_Heritage_Matters/index.aspx?langno=1&nodeid=1870 LegCo Papers on Heritage Conservation]\n* [http://www.civic-exchange.org/eng/upload/files/200205_SavingCulturalHeritage.pdf Civic Exchange. ''Saving Hong Kong's Cultural Heritage'', by Cecilia Chu and Kylie Uebegang. February 2002]"
    }
  ]
}