{
  "content": [
    {
      "type": "text",
      "text": "# Heritage Winnipeg Corporation__disambig_1\n\n| membership          = 220\n| membership_year     = 2018-19\n| leader_title        = Executive Director\n| leader_name         = Cindy Tugwell\n| leader_title2       = President\n| leader_name2        = Greg Agnew\n| leader_title3       = Past President\n| leader_name3        = Lisa Gardewine\n| leader_title4       = Secretary\n| leader_name4        = Nancy Klos\n| website             =\n}}\nHeritage Winnipeg Corporation is a non-profit charitable organization in Winnipeg, Manitoba, that works to save and redevelop the city's built heritage.\nHistory\nHeritage Winnipeg was established in 1978 as a direct result of the protests surrounding the proposed demolition of the Bank of Commerce (now the Millennium Centre at 389 Main Street). Both the Bank of Commerce and the neighbouring Bank of Hamilton were threatened with demolition to make room for an employee parking lot.\nIn response to these protests, the City of Winnipeg, the Province of Manitoba, and the Heritage Canada Foundation (now known as the National Trust for Canada) created Heritage Winnipeg as a cooperative effort to preserve notable buildings threatened by demolition or neglect, and to promote the establishment of a heritage conservation area in Winnipeg.\nOperations\nHeritage Winnipeg relies on a combination of public grants (City of Winnipeg and Manitoba Sport, Culture and Heritage), private donations, and memberships.\nInitial projects of Heritage Winnipeg included the Bank of Commerce and Bank of Hamilton, as well as the Bank of Nova Scotia.\nMore recent projects have included Chelsea Courts on Broadway, the Crocus building (formerly the J.H. Ashdown Store), the reopening of the Dalnavert Museum and Visitors' Centre, the installation of the First World War Digital Memorial Project at Union Station (123 Main Street), the King building in the Exchange District, Raleigh Apartment Block on Vaughan Street, the creation of the Upper Fort Garry Provincial Park, and the Wilson building on Main Street.\nDoors Open Winnipeg\nDoors Open Winnipeg is a free public event presented each year on the last weekend of May by Heritage Winnipeg. The event features tours of approximately 80 buildings and sites that are not normally open to the public. The event also features People's Choice Awards, which allow visitors to vote for their favourite buildings in five categories: Best Architecture, Best Restoration, Best Guided Tour/Programming, the 'Hidden Gem', and Best Overall Experience.\nReferences"
    }
  ]
}