{
  "content": [
    {
      "type": "text",
      "text": "# Heritage hotels in Vietnam\n\nThe first hotels in Vietnam catered to the French colonial society, not so much to tourists but to administrators and families. The Continental opened in Saigon in the 1880s and long reigned as the city's prime hotel. In Hanoi, the Sofitel Legend Metropole Hanoi opened in 1901 as le Metropole and endures today as the country's foremost address in hospitality.\nDuring the era of the steamship, tourism was restricted to the upper classes and to travelers. To Americans like Harry Franck, who visited Vietnam in the 1920s and wrote about the country in EAST OF SIAM. And to Brits like Norman Lewis, one of the 20th Century's greatest travel writers, who wrote A Dragon Apparent after a trip to Vietnam in 1950. One could hardly call Franck and Lewis tourists; they were travelers with a literary purpose.\nThe colonial French were the first to exploit Vietnam's natural wonders for tourists. In the grottoes of world-renowned Halong Bay, passengers on the bay's excursion boats carved their names in limestone 100 years ago. Between 1906 and 1937, a service boat called the Emeraude plied the waters of Halong Bay, catering to well-heeled colons. Nearly 100 years later, a French entrepreneur built a near-replica of this old steamer, running modern travelers past the same karst formations.\nBy the time the French finally gave up on Vietnam in the mid-1950s, jet travel was opening up Asia to tourists like never before. Indeed, when the Caravelle Hotel opened in 1959, it did so with a name that paid tribute to one of the sleek Air France jetliners of the day.\nThe war was a hindrance to travel, but it was happening nevertheless.''\nThe modern era of tourism in Vietnam really begins with the emergence of Đổi Mới (economic renovation) in 1986. By 1990, travelers were coming into Vietnam on careful orchestrated 'shopping tours.' None of the hotel stock ranked above two-star caliber then. Independent travel was limited. Travel between provinces required special permits by provincial administrators until 1993.\nReferences\nExternal links\n*\n* [https://archive.today/20130124152450/http://picasaweb.google.com/MetropoleHanoi.MM Online photo gallery of the Sofitel Legend Metropole Hanoi]\n* [http://picasaweb.google.com/ATG.Emeraude.MM/Archival#5345961663281067058 Online photo gallery of the Emeraude Classic Cruises]\n* [http://www.blog.caravellehotel.com/ The Caravelle Hotel blog]\n* [http://picasaweb.google.com/Caravelle.MM/Vintage#5348270978053587362 Online photo gallery of the Caravelle Hotel]\n* [http://www.emeraude-cruises.com The Emeraude Classic Cruises website]\n* [http://vietnamamazingtours.com Vietnam Tours]"
    }
  ]
}