{
  "content": [
    {
      "type": "text",
      "text": "# Heritage Acres Farm Museum\n\n| type          = open-air living history museum\n| collection    = Working farm machinery, draft animals, rural and domestic heritage\n| website       =\n}}\nThe Heritage Acres Farm Museum is an open-air museum located east of Pincher Creek, Alberta, Canada. Operated by the non-profit Oldman River Antique Equipment and Threshing Club, the museum preserves and interprets the development of agriculture and rural life in Alberta from the late nineteenth century through the mid-twentieth century.\nOverview\nThe 180-acre site contains more than fifty relocated and restored buildings and several hundred examples of working farm machinery. Demonstrations of tractors, threshing equipment, and horse-drawn implements illustrate the history of agricultural technology in western Canada. The grounds also include examples of domestic and community buildings, such as a schoolhouse, church, and blacksmith shop, showing how farm families lived and worked.\nNotable structures include a 1912 prairie grain elevator, the large Doukhobor Barn used for displays and community events, and a variety of log and frame houses furnished to represent different periods of settlement. Other exhibits include the Heritage Station model railway display and the Crystal Village, a miniature town made from glass and porcelain telephone insulators.\nPrograms and events\nThe museum operates seasonally and presents public demonstrations and community programs related to farming and rural heritage.\nMajor annual events include:\n* The Annual Show on the August long weekend, featuring operating machinery, threshing, and historic demonstrations;\n* Fall Fair / Fall Family Fun in autumn, with children’s activities and heritage displays;\n* Chuckwagon Cookout, a summer event featuring ranching and cowboy culture;\n* a spring Community Garage Sale; and\n* December events such as the Candlelight Country Church Service and Breakfast with Santa.\nGuided tours for schools and groups are available by arrangement. The site also provides facilities for private rentals, including the Doukhobor Barn, Summerview Hall, and outdoor areas.\nGovernance\nHeritage Acres Farm Museum is administered by the Oldman River Antique Equipment and Threshing Club, incorporated on 22 February 1988.\nThe Club is governed by a board of directors of up to thirteen members and an executive committee composed of the president, vice-president, secretary, treasurer, and immediate past president. An executive director manages day-to-day operations, collections, and public programs.\nSee also\n* List of museums in Alberta\n* Agriculture in Canada\n* Open-air museum\nReferences\nExternal links\n* [https://heritageacres.org/ Official website]"
    }
  ]
}