{
  "content": [
    {
      "type": "text",
      "text": "# Heritage Montreal\n\n| founder             = Phyllis Lambert, Paul Leblanc, Peter Quinlan, Herschel Segal, Lilian Webb\n| founding_location   = Montreal, Canada\n| dissolved           =\n| merger              =\n| type                = Nonprofit\n| tax_id              =\n| registration_id     =\n| headquarters        = 0500-100 Sherbrooke Est, Montréal, QC, H2X 1C3\n| location_city       =\n| location_country    = Canada\n| language            = French, English\n| leader_title        = Executive Director\n| leader_name         = Robert Turgeon\n| leader_title2       = Policy Director\n| leader_name2        = Dinu Bumbaru, C.M.\n| leader_title3       = President\n| leader_name3        = Carole Deniger\n| website             =\n}}\nHeritage Montreal is a Canadian non-profit organization dedicated to protecting the architectural, historic, natural, and cultural heritage of Greater Montreal. Architect Phyllis Lambert founded Heritage Montreal in 1975. It was preceded by Save Montreal, a volunteer group co-founded by Michael Fish after the controversial demolition of the Van Horne Mansion by developer David Azrieli in 1973. Heritage Montreal played a key role in efforts to halt demolition and redevelopment in the McGill Ghetto, also known as Milton Park.\nHistory\nSave Montreal\nHeritage Montreal's predecessor institution was Save Montreal (Sauvons Montréal), founded on September 28, 1973, after the demolition of the Van Horne Mansion on Rue Sherbrooke. Its mission was to save the city's heritage. Because of the efforts of the volunteers of Save Montreal, the Commission des Citoyens Pour l’Avenir de Montréal begins hearings on May 29, 1976, and adopted guidelines on July 6, 1978, that require \"due consideration\" to the architectural qualities of residential buildings before issuing demolition permits. Save Montreal also pushed for the creation of Heritage Montreal.\nHeritage Montreal\nArchitectural activist and Canadian Centre for Architecture founder, Phyllis Lambert, established Heritage Montreal in 1975 and served as its first president. It was incorporated on October 15, 1975. Its mission is to promote and protect the architectural, historic, natural, and cultural heritage of Greater Montreal. Heritage Montreal provides education and advocacy to preserve Montreal’s identity and uniqueness.\nOn October 6, 1981, the Heritage Montreal Foundation opened offices at the corner of Notre-Dame Street and Bonsecours Street. The Centre Urbain offers education and documentation services to anyone interested in preserving and enhancing urban heritage.\nThe City of Montreal and Heritage Montreal created Opération Patrimoine Architectural de Montréal (OPAM or the Montreal Architectural Heritage Campaign) in 1990. OPAM raises awareness of the importance of protecting built heritage by rewarding the work of heritage property owners. In 2001, the campaign expanded to cover the entire Island of Montreal. Heritage Montreal awards more than twenty OPAM prizes annually.\nMarking its 20th anniversary in 1995, Heritage Montreal held public hearings at the Canadian Centre for Architecture, inviting organizations and the public to envision the future of Montreal's heritage. In 2001, Heritage Montreal suggested that Quebec's municipal reforms should include heritage-conservation and public-consultation bodies, Conseil du Patrimoine and Office de Consultation Publique, in the updated city charter. In 2005, Heritage Montreal’s Heritage and Development Committee (known by its French acronym CoPA) unveiled its first annual list of ten threatened emblematic sites in Montreal.\nIn October 2009, Heritage Montreal, Lambert, and others participated in a think tank called the Institut de Politiques Alternatives de Montréal, to advise the city on a range of matters, including urban planning, development, and heritage.\nPreservation activities\nMilton Park\nWith the support of Heritage Montreal and the financial assistance of Canada Mortgage and Housing Corporation, residents of Milton Park created the largest co-operative housing project in North America, renovating entire rows of early 20th-century buildings between 1979 and 1982.\nMount Royal\nIn 1985, SNC announced its plan to replace the CBC/Radio-Canada transmission mast on Mount Royal with a  tall tower topped by a restaurant. Les Amis de la Montagne (Friends of the Mountain) formed in 1986 to advocate for the preservation and enhancement of Mount Royal. That same year, Heritage Montreal and Save Montreal asked the Government of Quebec to classify Mount Royal under the Cultural Property Act. However, Quebec forwarded its request to the City of Montreal.\nHeritage Montreal, Les Amis de la Montagne, the Centre de la Montagne, and the City of Montreal organized the inaugural Mount Royal Summit run on March 14, 2002. On March 9, 2005, the Government of Quebec granted double heritage protection status for the first time, decreeing Mount Royal a historic and natural district.\nRedpath Mansion\nIn 1986, Heritage Montreal and Save Montreal obtained an injunction to stop the demolition of the Redpath Mansion. In an out-of-court settlement, the owner committed to developing and enhancing the property but instead abandoned the mansion and surrounding land for more than 25 years. Heritage Montreal kept its vigilance, hoping to find a renovation project. However, the Redpath Mansion was demolished in 2014.\nMontreal Botanical Garden\nIn 1994, Heritage Montreal filed a request to have the Montreal Botanical Garden classified as a historic site, citing its national value as a complex dedicated to science and society.\nSilo No. 5\nOn October 4, 1997, Heritage Montreal hosted a study day on the future of Silo No. 5, in collaboration with the Association Québécoise pour le Patrimoine Industriel (AQPI).\nEaton’s  restaurant\nOn February 16, 1999, Heritage Montreal asked the Ministry of Culture and Communications to assign historic monument classification for the Art Deco restaurant on the 9th floor of the former Eaton’s department store. On August 24, 2000, the Minister of Culture and Communications, Agnès Maltais, announced its classification as a historic monument.\nHabitat 67\nHeritage Montreal filed requests in 2002 for Habitat 67 to become a historic monument and a heritage site. The City of Montreal approved its historic monument status in September 2007. The Ministry of Culture and Communications approved its status as a heritage site in 2009.'']]\nGuaranteed Pure Milk bottle\nIn partnership with the provincial milk producers’ federation and private partners from the arts sector, Heritage Montreal launched Opération Sauvons la Pinte (Save the Milk Bottle) in 2009. The iconic milk-bottle-shaped Guaranteed Pure Milk water tower was restored with its original painted inscriptions.\nFulford residence\nIn February 2022, Heritage Montreal asked Culture and Communications Minister Nathalie Roy to give the Major House, known as the Fulford Residence, protection by classifying it under the Cultural Heritage Act. Located on Guy Street in the heart of the Peter-McGill neighborhood, the 1885 Fulford Residence was home to James Edward Major until 1890 when it became a home for women.\nThe Fulford Residence was significant because of its intact 19th-century architecture. However, when the women's home was closed during the COVID-19 pandemic, there was uncertainty about the fate of this heritage property. Quebec’s Culture and Communications Ministry announced on August 26, 2022, that the residence will be classified as a heritage building. The designation will apply to the building, the site, and some of its interiors “which are of particular architectural integrity and interest.”\nEducational activities\nHeritage Montreal's earliest programs were lectures on residential renovation, informing homeowners of best practices, and raising awareness about retaining heritage components. In 1985, more than sixty students from Quebec and elsewhere enrolled in a summer course about renovation and restoration, organized by Heritage Montreal and Université de Montréal. In 1985, Heritage Montreal and the Institut d’Urbanisme of Université de Montréal organized a heritage symposium for municipalities, teaching about new heritage protections in the Cultural Property Act.\nIn 1986, a school bus became Heritage Montreal's Archibus, taking classes on architectural and urban discovery tours. In addition, Heritage Montreal took over hosting guided tours of Montreal neighborhoods from Save Montreal in 1988. In 1989, Heritage Montreal and ICOMOS organized an integrated conservation symposium for representatives from several countries and UNESCO. Also in 1989, Heritage Montreal organized a symposium on preserving historic movie theaters at the Rialto Cinema, a Montreal historic monument. This meeting led to the publication of a brief on repurposing former movie theatres as arts and culture venues.\nHeritage Montreal organized two major projects to celebrate Montreal’s 350th anniversary in 1992: the Patrimoine en Marche (Steps in Time Guides) and self-guided tours along Rue Sherbrooke. In collaboration with the Montreal Museum of Fine Arts, the Quebec Order of Architects, and donors, Heritage Montreal created a program to educate young people on heritage and urban issues. In 1995, Heritage Montreal’s urban tours were renamed the ArchitecTours: an annual series of guided walking tours to discover Montreal, its neighborhoods, and its heritage.\nIn September 2014, Heritage Montreal organized a symposium on repurposing former hospital buildings as part of the Entretiens Jacques-Cartier.\nPublications\nHeritage Montreal, in collaboration with the Ministry of Cultural Affairs, published four technical guides on renovating traditional masonry, windows, roof coverings, and facings. The guides were aimed at owners of heritage residences as well as construction and renovation contractors.\nIn 1997, Heritage Montreal published Plan Stratégique de Conservation des églises et des Chapelles au Centre-ville de Montréal, under the direction of Jean-Claude Marsan. This was a strategic plan for downtown Montreal's historic churches.\nIn 1998, Heritage Montreal published its first Grand Calendrier du Patrimoine (Great Heritage Calendar), a one-stop guide to public activities through Montreal heritage organizations.\nReferences"
    }
  ]
}