{
  "content": [
    {
      "type": "text",
      "text": "# Hermit Park, Queensland\n\n| local_map           = yes\n| zoom                = 12\n| pop                 = 3512\n| pop_year            =\n| pop_footnotes       =\n| established         =\n| postcode            = 4812\n| area                = 2.2\n| timezone            = AEST\n| utc                 = +10:00\n| dist1               = 3.0\n| dir1                = SW\n| location1           = Townsville CBD\n| dist2               = 1352\n| dir2                = NNW\n| location2           = Brisbane\n| dist3               =\n| dir3                =\n| location3           =\n| dist4               =\n| dir4                =\n| location4           =\n| lga                 = City of Townsville\n| stategov            = Townsville\n| fedgov              = Herbert\n| near-n              = West End\n| near-ne             = Railway Estate\n| near-e              = Railway Estate\n| near-se             = Oonoonba\n| near-s              = Rosslea\n| near-sw             = Mundingburra\n| near-w              =Mysterton\n| near-nw             = Hyde Park\n}}\nHermit Park is a suburb of Townsville in the City of Townsville, Queensland, Australia. In the , Hermit Park had a population of 3,512 people.\nGeography\nHermit Park is a mixture of predominantly residential premises, commercial and light-industrial businesses, as well as serving as a public services hub.\nNorth Townsville Road (Woolcock Street) runs along the northern boundary, and Townsville Connection Road (Charters Towers Road) runs along the western boundary.\nHistory\nHermit Park is situated in the traditional Wulgurukaba Aboriginal country.\nThe origin of the suburb name Hermit Park is from the residence of a business owner Leopold Ferdinand Sachs.\nThe Suburban Bowling Club was established in 1923 on the corner of Charters Towers Road and Carr Street, the second to be established in Townsville. The club initially had two grass greens, but these were replaced in 2002 by a carpeted green with a fixed roof making it suitable for play in all weather conditions.\nHermit Park State School opened on 16 June 1924. Hermit Park Infants State School was separated from it on 1 February 1955, but closed on 17 December 1993 and became part of the State School again. This school is still in operation but it is now within the boundaries of the neighbouring suburb of Hyde Park.\nSt Margaret Mary's Catholic Primary School was established in 1936 by the Sisters of the Good Samaritan. Bishop Terrence McGuire had purchased the Woodlands estate from the Cummins family to use as a convent for the sisters, which was called Saint Philomena's. The need for secondary education for girls in the area led to the sisters establishing St Margaret Mary's College, which was officially opened by Bishop Hugh Ryan on 22 February 1963 with an initial enrolment of 50 girls. St Margaret Mary's Catholic Primary School closed on 11 December 1987, after which it was amalgamated with St John Fisher's Christian Brothers College (Currajong) and the Holy Family Catholic Primary School (Gulliver) to create The Marian School which opened on 21 January 1988 in Currajong. In 1995, St Mary's School (West End) was also amalgamated into The Marian School. St Margaret Mary's College continues to operate but is now within the boundaries of the neighbouring suburb of Hyde Park.\nA red light district developed along Herauld Street and the Causeway Hotel before World War II. The Causeway Hotel took its name from the causeway over the nearby embankment and bridge that crossed Ross Creek to provide access to the Townsvillle city centre. However, the massive influx of Australian and American troops into Townsville during World War II caused a dramatic increase in the number of brothels and prostitutes in the area and there were many disturbances in the area, attracting the attention of the local police and military police. The area was also believed to be the cause of considerable venereal disease among the troops which affected military operations, leading to a directive in November 1942 that the Causeway Red Light District was out of bounds for troops. In 1945 some houses burned down in the area and another was washed away in the flood. In 1969 the Townsville City Council resumed all of the properties in the area and demolished them, renaming Herauld Street to be Ford Street and Brodie Street, in order to remove the bad reputation of the area.\nHermit Park Special School opened in January 1979 and closed in 1979.\nDemographics\nIn the , Hermit Park had a population of 3,414 people.\nIn the , Hermit Park had a population of 3,512 people.\nEducation\nThere are no schools in Hermit Park. The nearest government primary schools are Hermit Park State School in neighbouring Hyde Park to the west, Railway Estate State School in neighbouring Railway Estate to the north-east, and Mundingburra State School in neighbouring Mundingburra to the south-west. The nearest government secondary schools are Townsville State High School in neighbouring Railway Estate to the north-east and Pimlico State High School in Gulliver to the west.\nAmenities\nThe Family History Association of North Queensland operates a library at 5 Baker Street (); the society supports the research and study of  family and local history and related subjects.\nThe Suburban Bowling Club is at 156 Charters Towers Road (). It has an all-weather undercover bowling green.\nThere are a number of parks in the area:\n* Bicentennial Park ()\n* Corcoran Park ()\n* Corcotan Park ()\n* John Herbert Sports Complex ()\n* Ross River Park ()\nFacilities\nDespite its name, Mundingburra Police Station is 240-246 Charters Towers Road in Hermit Park ().\nReferences\nExternal links\n*"
    }
  ]
}