{
  "content": [
    {
      "type": "text",
      "text": "# Herman R. Salmon Award\n\nThe Herman R. Salmon Technical Publications Award recognizes the most outstanding technical paper published in Cockpit magazine, a quarterly journal of the Society of Experimental Test Pilots. The award was established in 1971 and renamed in 1981 to honor the memory of test pilot Herman R. \"Fish\" Salmon who was killed in an aircraft accident.\nCriteria\nThe Society lists five criteria for nominations to this award:\n#Originality and/or ingenuity of the article\n#Interest of subject material to the membership\n#Contribution to flight testing\n#Contribution to the exchange of information between test pilots that would not otherwise be generally available\n#Organization of material and clarity of presentation\nRecipients\nRecipients of this award, from 1971 to present, include:\n*1971—John F. Farley\n*1972—Jack F. Woodman\n*1973—Gilbert Defer\n*1974—Pietro P. Trevisan\n*1975—Robert R. Stone\n*1976—William H. Brinks\n*1977—Richard G. Thomas\n*1978—A. W. \"Bill\" Bedford\n*1979—Charles A. Sewell\n*1980—LCdr. Richard N. Richards, USN; Carroll D. Pilcher\n*1981—No award was presented\n*1982—William H. Brinks\n*1983—Dennis D. Behm\n*1984—A. Paul Metz\n*1985—Walter Spychiger\n*1986—Frank C. Sanders; Jeff Ethell\n*1987—B. Pasquet\n*1988—Major Troy D. Pennington, USMC; Richard Kotarba\n*1989—Charles J. Berthe, Louis H. Knotts, Jeff H. Peer, N. C. Weingarten\n*1990—Paul W. Herrick\n*1991—George L. Wiser\n*1992—Michael Barnes; Cdr. John Deaton, USN; Jonathan Kern; Douglas Wright\n*1993—Maj. William A. Flynn, CAF; Keith L. Keller\n*1994—Louis H. Knotts, Michael L. E. Parrag, Eric E. Ohmit\n*1995—Allen T. Reed\n*1996—Eric E. Fiore\n*1997—Michale Swales\n*1998—Lt Col Carl Hawkins, USAF; Lt Andrew Thorne, USAF\n*1999—Capt Ron Rogers, ALPA\n*2000—Thomas Tilden, United Airlines\n*2001—Mr. Michael Adam-Swales, Agusta Westland Helicopter, Mr. Andrew Strachan, Agusta Westland Helicopters\n*2002—Capt Kevin A. Gibbons, USAF; Maj Philip K. Chionh, RSAF; Maj Mark R. Johnson, USMC; Maj James R. Marcolesco, USAF; Capt Collin T. Ireton, USAF; Capt David F. Radomski, USAF; Maj Andrew J. Thurling, USAF\n*2003—Mr. Bob Riser; LCDR Wade McConvey, USN\n*2004—Sqn Ldr Shaun Wildey, RAF\n*2005—Richard V. Reynolds, Lt Gen, USAF (Ret)\n*2006—Dr. Guy Gratton, Dr. Simon Newman\n*2007—Lt Col Geno Wagner, USAF\n*2008—Lt Col Daniel D. Daetz, USAF; Maj Jack D. Fischer, USAF; Brian Knaup, USAF\n*2009—Dr. Allen Peterson, Sierra Nevada Corporation\n*2010—Maj Aaron A. Tucker, USAF (M), Maj Christopher E. Childress, USAF (M), and Lt Col Robert J. Poremski, USAF\n*2011—Mark A. Mitchell, Norman E. Howell\n*2012—Nicola Pecile, National Test Pilot School and Lt Col Raffaele Di Caprio, Italian Air Force\n*2013—LTC Jeffrey Trang, USA (Ret) (AF), American Eurocopter, Denis Hamel, American Eurocopter\n*2014—Robert Moreau, FedEx\n*2015—David L. Lawrence\n*2016—Timothy S. McDonald, U.S. Air Force Test Pilot School\n*2017—LTC Tucker Hamilton, USAF\n*2018—James E. ″JB″ Brown, III, National Test Pilot School\n*2019 - Dr. Brian Lee and Dr. Kirk Vining, The Boeing Company\n*2020 - Maj Gen Desmond Barker, SAAF (Ret)\n*2021 - Robert Hierl\n*2022 - James E. ″JB″ Brown, III, National Test Pilot School\n*2023 - Thomas A. Washington, MIT Lincoln Laboratory\n*2024 - Thomas A. Washington, MIT Lincoln Laboratory\nSee also\n* List of aviation awards\nReferences"
    }
  ]
}