{
  "content": [
    {
      "type": "text",
      "text": "# Hernández de Córdoba expedition\n\n| combatant3        =\n| commander1        = Moch Couoh\n| commander2        = Francisco Hernández de Córdoba\n| commander3        =\n| units1            =\n| units2            =\n| units3            =\n| strength1         = Unknown\n| strength2         = 110\n| strength3         =\n| casualties1       = Unknown\n| casualties2       = 55 killed52 wounded2 captured and sacrificed\n| casualties3       =\n| notes             =\n| campaignbox       =\n}}\n| start_date        =\n| end_location      = Cuba\n| end_date          =\n| goal              = |To discover new lands }}\n| ships             = 2 caravels, 1 brigantine\n| crew              =\n| survivors         =\n| fatalities        =\n| achievements      = |First non-Amerindian discovery of Yucatán Peninsula }}\n| route_image       = Expedición de Córdoba a Yucatán.svg\n| route_image_size  = 300px\n| route_image_upright =\n| route_image_caption = Possible route of the Hernández de Córdoba expedition\n}}\nThe Hernández de Córdoba expedition was a 1517 Spanish maritime expedition to the Yucatán Peninsula led by Francisco Hernández de Córdoba. The expedition ended in disaster after battling the Mayan city-state of Chakán Putum, resulting in half the Spaniards being killed, and the other half being wounded. The expedition nonetheless brought back exciting news of vast lands inhabited by a rich and civilized people, namely, the Maya civilization. The expedition is popularly credited as the first non-Amerindian contact with the Maya, and first non-Amerindian discovery of the Peninsula, though both these achievements are disputed in scholarly literature. It is deemed the opening campaign of the Spanish conquest of the Maya, and one of the precursor expeditions which led to the Spanish invasion of the Aztec Empire.. For infobox –\n# strength in ;\n# aim in , , ;\n# date in ;\n# start in ;\n# end in ;\n# casualties in , ;\n# achievements in , , ;\n# ships in , ;\n# sponsors in ;\n# leaders in ;\n# strength in ;\n# casualties in .\n}}\nPrelude\nBy the mid-1510s, Spanish settlements in the New World dotted only a few of the Antilles and some mainland coast in the southern Caribbean. The generally-deprived conquistadors had yet to find that which had been promised them since the earliest Columbian voyages, namely, western maritime passage to the East Indies, Amerindians to force into encomienda or enslavement, and above all, copious amounts of gold. The latter had proved dear and scarce, and the people they enslaved were being decimated not only by their captors' cruelty, but also European diseases such as smallpox.\nIn 1516, three wealthy Cuban settlers, Francisco Hernández de Córdoba, Cristóbal Morante, and Lope Ochoa de Caicedo, got together to undertake an expedition to the Lucayan archipelago for the purpose of capturing and enslaving more people. Each man reportedly contributed between 1,500 and 2,000 castellanos for the undertaking, with Diego Velázquez de Cuéllar further contributing a brig and authorisation. With Hernández de Córdoba named captain, the organisers promptly enlisted Bernardino Íñiguez as veedor, Alonso González as chaplain, a certain Morales as notary, and Antón de Alaminos, Camacho de Triana, and Juan Álvarez as pilots, and two ships, along with the necessary Spanish sailors and soldiers, native Cuban servants, and provisions.\nExpedition\nDeparture\nThere are, curiously, few historical sources which precisely date the fleet's departure from Cuba. Though a majority of sources date the departure to 1517, only Bartolomé de las Casas and Bernal Díaz del Castillo date it to February 1517, and only the latter fixes a day, giving 8 February as the fleet's departure date from Havana. Following Castillo, the fleet hugged the Cuban coastline for twelve days, up to Cape San Antón, from where they put out to sea on 20–21 February. At this point, historical sources differ greatly. Some sources state the fleet's route was fixed, while some claim it was not. Still some in the former group further assert a storm was encountered which blew the ships off course, or claim strong currents were encountered which similarly took them off course, while others state the ships were intentionally steered off course upon a change of plans. Furthermore, the time it took to cross the Yucatán Channel is variously given as four, six, 21, or 40 days. Castillo, the only chronicler to give precise dates, claims a treacherous crossing of 21 days, implying a 13–14 March arrival in the Yucatán Peninsula. Unfortunately, Castillo also gives a precise date, 4 March, as the day when a flotilla of five Maya canoes from Cape Catoche approached the fleet, thereby implying at least a 3–4 March arrival at the Peninsula. Given such uncertainty, the historian Fernando Tola de Habich favours an arrival 'in the first days of March 1517.'\nNorthern prong\nAs with departure details, there is likewise much disagreement among historical sources regarding the fleet's exact point of arrival in the Peninsula. Tola de Habich favours an approach to some northerly cape on the mainland, rejecting as most improbable accounts of (i) an arrival to some northeasterly island, (ii) to Eccampi, (iii) to the province of Yucatán, and (iv) a forthwith coasting to Campeche. The scholar thus proffers Cape Catoche, Punta de Yucatán, and Punta Mujeres as the fleet's possible points of arrival, with the last of these deemed . Furthermore, while it is certain that, shortly upon first approaching the Peninsula, the ships disembarked at Cape Catoche, and thereafter coasted down to Campeche, exactly what occurred between first arrival and Campeche is, again, uncertain. Tola de Habich suggests as likely the crew's disembarking at Punta Mujeres, there coming upon 'a small salt-harvesting town, perhaps abandoned, where they found a small Maya temple with golden figurines of goddesses; from here they surely espied a larger town at some nearby headland, which prompted the fleet towards it: this was the town called Cairo by Peter Martyr, an appellation repeated by Castillo in his chronicle, adding the adjective Great.' The historian situates Great Cairo in Cape Catoche, describing the momentous encounter between civilisations as follows. }} Accounts of this encounter are quite varied; nevertheless, a few common threads emerge, such as an encounter with local fishermen, descriptions of residents, golden ornaments, masonry buildings, temples, pyramids, towns, and 'Spanish awe at what they saw.' Particularly notable is the anecdote regarding the name Yucatán, purportedly uttered by locals to mean 'I do not understand you' upon the Spaniards' asking them what they called their land..}} Tola de Habich favours an alternative theory though, first reported by Castillo, which ascribed the name to  local christened Melchor. Melchor was one of two local fishermen from Catoche pressed by the crew for service, the other being Julián (so named by the Spanish).. The fishermen would have been baptised and given Christian names, that is, Melchor (also Melchorejo) and Julián (also Julianillo) . Intelligence regarding the name Yucatán, existence of gold mines, and residence of Spanish men in Maya provinces is attributed to them (the latter presumably regarding those stranded in 1511, including Gonzalo Guerrero and Jerónimo de Aguilar; ). Julián was further forced to serve in the Grijalva expedition, and Melchor in the Cortés one . Details of their later lives are confused, though neither is thought to have afforded the Spanish praiseworthy service .}} Similarly notable is the Spaniards' reported awe or terror upon reaching the Catoche town, their task suddenly looming large and foreboding compared to what they had expected. At this point, there was reportedly talk of returning to Cuba to prepare a stronger fleet, but 'their curiosity got the better of them, as well as their hope of finding more gold and, undoubtedly, the sense that they had nothing to lose.' And so, from Catoche, the fleet coasted southwards, encountering no resistance, and possibly no other coastal towns either.\nWestern prong\nThe cruise from Catoche to Campeche took 15 days per Castillo, or 110 Spanish nautical leagues per Martyr, with all sources agreeing the fleet arrived in Campeche on St Lazarus's feast day. The welcome agreement ends here though, as details of the Spaniards' reception differ among sources. Tola de Habich deems a cordial, even admiring, welcome likely, with residents and the batab coming up to shore to witness the fleet's entry, and the Spanish seizing the moment with a grand gun salute. At this point, the captain and  a small number  all his men disembarked, leaving  all sailors manning the ships (as was custom)..}} The Spanish found in Campeche a large town of, reportedly, close to 3,000 houses, presumably of limestone, in addition to at least one temple and some shrines, and perhaps a small pyramid. Accounts of their stay in Campeche are varied; though two notable events are mostly agreed upon – a banquet, and a visit to the temple. Sources describe at least five different menus for the welcome banquet afforded to the Spaniards, though all accounts suggest a great feast of many courses, heavy on fowl, game, maize, and seasonal fruits, though curiously lacking fish, greens, and beverages..}} Having dined and rested to their hearts' content, the men were reportedly then invited to visit Campeche's most important site – its temple. Tola de Habich quotes las Casas and others 'to get a clear idea of what they [Córdoba and company] saw and what it meant to them.' }} According to Tola de Habich, the temple would likely have impressed and terrified the men, this being their first encounter with such monumental and beastly statues, and their first indication of human sacrifice, in the New World. In spite of this, the Spaniards sojourned a few days in Campeche, possibly prompted by their hosts' hospitality, and thereafter continued on their way.\nThe fleet coasted southwest for some ten or 15 leagues, whereupon they sighted a town variously called Moscobo, Champotón, Nochopobón, and Potonchán in historical sources. Though this settlement is often identified as  Potonchán (now known as Frontera, Tabasco)  Champotón (now known as Champotón, Campeche), the scholar Jorge N Iturriaga has recently argued that  the latter is correct., but correctly identifies it as a port on Río Champotón, and the capital of the maritime province of Aguanil, governed by the batab Moch Couoh, which is just, in fact,  . Victoria Ojeda correctly identifies the same settlement, but likewise misnames it , further noting the town is 'sometimes recorded as ' . Champotón's pre-Columbian name is thought to have been  .}} Elated to find a source of fresh water, the much dehydrated men reportedly all disembarked with their pipas and arms aboard the brig and bateles, leaving the sailors and large ships a league offshore. Events onshore, as narrated in historical sources, are 'very strange and on many points quite incomprehensible.' Nevertheless, Tola de Habich accepts the following series of events as likely.\nOn land, the Spaniards, used to kindly receptions at Punta Mujeres, Cape Catoche, and Campeche, were now rather coldly received by armed locals who indicated their arrival was unwelcome. Córdoba's men, 'stubborn' but in dire need of water, landed regardless and set to sating their thirst and filling their pipas at the riverbank. Nightfall apparently crept up on the landed party, forcing the men to camp ashore for what must have been a tense night under the watchful eye of their aggrieved hosts. The men next awakened at dawn to a growing audience of a great many locals dressed for battle, 'with cotton armour down to their knees, and bows and arrows, and spears and bucklers, and swords like two-handed montanes, and slingshots and stones, and plumes of the kind they usually don, and their faces masked in black and white.' War drums now beat in their periphery, accompanied by a great roar, and an opening salvo of arrows and stones from all sides. Frenzied combat ensued, reportedly amidst the local war captain's shouted orders of al calachoni, 'target the [Spanish] captain.' Within 'little more than half an hour,' Córdoba, grievously injured, seeing nearly half his men fallen, a few captured, and little more than half alive but seriously injured, called for immediate retreat. The survivors now rushed seawards to their brig and bateles, the locals in dogged pursuit even into sea.\nThe Spanish managed to reach the safety of their fleet, whereupon the full weight of their loss dawned on them – reportedly, 55 men killed, 2 captured, 52 injured, an unknown number of sailors dead or injured, and all water and pipas lost. As Tola de Habich puts it, the engagement 'was a vicious carnage [...] the Spaniards' most catastrophic military defeat yet since arriving in the New World.'. Regarding the loclas' attack, they dismiss the locals' having prior intelligence of Spanish cruelty as causus belli, favouring rather their need to safeguard drinking water, though still finding this unsatisfactory . Regarding Spanish defeat, they suggest as contributing factors poor preparedness, lack of crossbows and shotguns, shortage of swords, and lack of armour or even clothing . They venture 'a similar number [to 57] or much greater' of locals killed in combat .}} Now in dire straits and unable to man both ships and the brig, the captain had the latter scuttled, and, with great effort, the surviving men put out to sea aboard the ships.\nReturn\nMost historical sources say the Spanish made a beeline for Cuba, which account Tola de Habich favours, but Castillo rather notes the fleet first anchored at Estero de los Lagartos in search of water, and finding none, were next led to Florida by Alaminos, from where they finally returned to Cuba after a native Floridian attack (though they had reportedly, at last, found water).\nAs with the fleet's departure, there are likewise precious few details regarding the fleet's return to Cuba. What is certain, Tola de Habich notes, is that both ships arrived in Cuba sometime in April 1517, whereupon the governor Velázquez was debriefed.\nAftermath\nCórdoba died shortly upon arriving home at Sancti Spíritus, Cuba, purportedly from injuries sustained during the expedition. His surviving men are thought to have endured a lengthy convalescence, with only 'a few' joining further expeditions west.\nIn Santiago, expeditionary reports of lands of 'greater wealth, organisation, and social and material development [than heretorfore known in the New World]' reportedly 'excited' Velázquez, who immediately got to work outfitting the 1518 Grijalva expedition, which would notably return with news of the gold-rich Aztec Empire. The governor was similarly quick to claim credit for the discovery, successfully petitioning for the title of adelantado of Yucatán, granted him on 13 November 1518 in Zaragoza, which authorised his conquest and settlement of the Peninsula.\nIn the Maya Lowlands, at 'about the time of the Córdoba expedition a new and terrible disease devastated the [Yucatán] peninsula[; i]t was almost certainly smallpox, perhaps introduced by the expedition, though there is nothing to suggest that in the records, or by some forgotten victims of shipwreck, or brought by a long chain of Indian carriers from Panama.'\nLegacy\nIn scholarship\nThe quasi-first-hand of Bernal Díaz del Castillo, and the second-hand account by Bartolomé de las Casas, have become influential sources in scholarly literature, though at least some historians have come to question their accuracy, with Fernando Tola de Habich recently calling them 'the most outlandish' accounts of the expedition. Nevertheless, the Castillo chronicle remains influential in scholarly literature. For instance, it is followed by Tola de Habich (to some extent), Jorge Victoria Ojeda (mostly), and Inga Clendinnen (mostly).\nQuite a few of the campaign's details have come to be questioned. Firstly, the fleet's earliest point of arrival is commonly regarded as Isla Mujeres, following a 16th-century chronicle which listed 'a punta which he [Córdoba] named de las Mujeres' as the fleet's first landing point. However, Tola de Habich argues that said chronicle, and still other historical sources, do  lend support for Isla Mujeres as the first landing point, but rather indicate some cape on the , possibly Punta Mujeres or Cape Catoche. Similarly, Victoria Ojeda, following Marshall H Saville, rejects Isla Mujeres as the first landing point, deeming Cape Catoche as the likelier place. Secondly, the expedition's objective is variously reported as either to kidnap people to force into enslavement in the Lucayan archipelago or Bay Islands, or to discover new lands. Tola de Habich deems the former 'the most probable and supported [by evidence],' but nonetheless concedes the aim may have  been the latter one. Victoria Ojeda makes a similar assessment. Thirdly, since the influential 16th century chronicle of Castillo, quite a few historians have confused Potonchán for Champotón. In a recent paper, the independent scholar José N Itarriaga clarifies that the Hernández de Córdoba expedition landed at Champotón, a pre-Columbian city coincident with the modern Mexican city of Champotón, Campeche, and  at Potonchán, a pre-Columbian city coincident with the modern Mexican city of Frontera, Tabasco..}}\nBoth achievements credited to the expedition have been disputed. For instance, while it is popularly regarded as the first non-Amerindian discovery of the Yucatán Peninsula, Victoria Ojeda notes the feat might rather be attributed to the 1508–1509 Pinzón–Solís voyage, or the 1511 stranding of Gonzalo Guerrero, Jerónimo de Aguilar, and company. Tola de Habich makes a similar observation, further noting the Peter Martyr map as possible evidence in support of the former. Curiously, the 1562 Chronicle of Chac Xulub Chen, by Ah Nakuk Pech, seems to attribute non-Amerindian discovery to the latter. Similarly, some scholars ascribe first non-Amerindian contact with the Maya civilisation to the 1502 Honduran leg of Columbus's fourth voyage, or the aforementioned 1511 stranding. Tola de Habich nonetheless underlines the importance of this expedition as the one which 'opened the doors' to Mesoamerica, thus leading to Spanish conquest thereof.\nIn culture\nThe Cape Catoche settlement, Great Cairo, attained mythic proportions in the collective memory of 16th century Spanish society, becoming a vast city 'five times greater than Paris,' dotted with 'many rich palaces.' Victoria Ojeda attributes this simply to the novel sense of astonishment the settlement occasioned amongst Córdoba's men. In a similar vein, the story of Yucatán's being a great island, bound by the Ascension Bay (east) and Laguna de Términos (west), is thought to have been spread by the expeditionary pilot, Antón de Alaminos. This belief would not be corrected until further expeditions to what became New Spain. In the northern Maya Lowlands, Victoria Ojeda thinks the arrival of Córdoba's men would have been interpreted by Maya priests as fulfilment of prophecies of the arrival of bearded men, which omen was said to augur times of 'weeping skies, scarcity of corn, and great hunger.'\nThe 500th anniversary of the Hernández de Córdoba expedition, in 2017, was commemorated with a number of celebrations throughout the Yucatán Peninsula and Mexico, including in Campeche, Cancún, Isla Mujeres, and Mexico City. The 400th anniversary was commemorated by the federal government of Mexico via the 1917 dedication of a public monument in Isla Mujeres.\nTables\nCrew\n{| class=\"wikitable static-row-numbers mw-collapsible\"\n|+ Known officers and crew of the Hernández de Córdoba expedition., unless otherwise indicated.}}\n|-\n! Surname\n! Forename\n! Post\n! Notes\n|-\n| Aguilar\n| Hernando de\n| ?\n| –\n|-\n| Alaminos\n| Antón de\n| Pilot\n| Crew in Grijalva and Cortés expeditions\n|-\n| Álvarez\n| Juan\n| Pilot\n| Also known as el Manquillo; crew in Grijalva and Cortés expeditions\n|-\n| Aragón\n| Juan de\n| ?\n| –\n|-\n| Ávila\n| Pedro de\n| ?\n| –\n|-\n| Ávila Quiñones\n| Gaspar de\n| ?\n| Previously also known as Dávila Quiñónez\n|-\n| Béjar\n| Benito de\n| ?\n| Crew in Grijalva and Cortés expeditions\n|-\n| Benavides\n| Alonso de\n| ?\n| –\n|-\n| Bernal\n| Juan\n| ?\n| Crew in Grijalva and Cortés expeditions\n|-\n| ?\n| Bernardino\n| Sailor\n| Reportedly levantisco\n|-\n| ?\n| Berrio\n| ?\n| Captured in Florida\n|-\n| Boto\n| Alonso\n| ?\n| Captured in Champoton\n|-\n| Camacho\n| Pedro\n| Pilot\n| Crew in Grijalva and Cortés expeditions; also known as Camacho de Triana and .}}\n|-\n| Cuenca\n| Benito de\n| ?\n| Crew in Grijalva and Narváez expeditions\n|-\n| Díaz del Castillo\n| Bernal\n| ?\n| Crew in Grijalva and Cortés expeditions\n|-\n| Gibraltar\n| Nicolás de\n| ?\n| –\n|-\n| González\n| Alonso\n| Clergyman\n| –\n|-\n| Guisado\n| Alonso\n| ?\n| Participation possibly uncertain; reportedly crew in Grijalva and Narváez expeditions\n|-\n| Hernández de Alanís\n| Cristóbal\n| ?\n| Reportedly also known as Hernández de Mosquera, H. de Alanis, H. de la Puebla\n|-\n| Hernández de Córdoba\n| Francisco\n| Captain\n| –\n|-\n| Hernández Sevillano\n| Pedro\n| ?\n| Crew in Grijalva and Narváez expeditions; previously known as Perdo Hernández\n|-\n| Íñiguez\n| Bernardino\n| Veedor\n| –\n|-\n| Jerez\n| Alonso de\n| ?\n| –\n|-\n| López\n| Diego\n| ?\n| –\n|-\n| López\n| Francisco\n| ?\n| Reportedly crew in Grijalva expedition\n|-\n| López Marroqué\n| Pedro\n| ?\n| –\n|-\n| Martín\n| Ginés\n| ?\n| –\n|-\n| Morales\n| ?\n| Scribe\n| –\n|-\n| Ojeda\n| Alonso de\n| ?\n| Participation previously uncertain; crew in Grijalva and Cortés expeditions; reportedly captured Xicoténcatl\n|-\n| Ortiz de Zúñiga\n| Alonso\n| ?\n| Participation uncertain; likely crew in Grijalva expedition; reportedly crew in Narváez expedition\n|-\n| Ovide\n| Pedro de\n| ?\n| –\n|-\n| Pérez de Ardón\n| Juan\n| ?\n| Possibly also known as Juan Peréz\n|-\n| Perón\n| Pedro de Toledo\n| ?\n| –\n|-\n| Porras\n| Diego de\n| ?\n| Reportedly crew in Cortés expedition\n|-\n| Portillo\n| Cindo de\n| ?\n| Participation previously uncertain; crew in Grijalva and Cortés expeditions; also known as friar Cindo de Villasinda, friar Cintos de San Francisco;  see C de San Francisco\n|-\n| ?\n| ?\n| ?\n| Known as portugués viejo; captured in Champotón; Portuguese\n|-\n| Prieto\n| Pedro\n| ?\n| –\n|-\n| Ramos de Lares\n| Martín\n| ?\n| –\n|-\n| Ruiz de Alaniz\n| Juan\n| ?\n| Reportedly cousin of C Hernández de Alaniz\n|-\n| San Francisco\n| Cintos de\n| ?\n| Friar; reportedly returned to New Spain with Marquis del Valle; see C de Portillo\n|-\n| San Juan\n| ?\n| ?\n| Possibly also known as el Entonado or San Juan de Uchila\n|-\n| Vázquez\n| Martín\n| ?\n| –\n|-\n| Vivanco\n| ?\n| ?\n| Participation uncertain but known crew in early New Spain expeditions\n|-\n| Zaragoza\n| Miguel\n| ?\n| Crew in Grijalva and Cortés expeditions\n|}\nConcordance\n{| class=\"wikitable static-row-numbers mw-collapsible defaultcenter\"\n|+ Concordance among select historical sources regarding select aspects of the Hernández de Córdoba expedition.. Here, letter refers to a letter dated Veracruz, Mexico, 10 July 1519, written by Cortés's soldiers, 'some of whom, no doubt, participated in the voyage of Hernández de Córdoba' . Casas, Oviedo, Salazar refer to chronicles by Bartolomé de las Casas, Gonzalo Fernández de Oviedo, Francisco Cervantes de Salazar, respectively, all of whom spent time in the New World . Gómara, Martyr, Sepúlveda refer to chronicles by Francisco López de Gómara, Peter Martyr, Juan Ginés de Sepúlveda, respectively, none of whom spent time in the New World, but all of whom are thought to have (i) received first- or second-hand accounts of the expedition, and (ii) consulted written reports of the expedition . Castillo refers to the chronicle by Bernal Díaz del Castillo, participant of the expedition . Note, all but letter and Martyr 'were written many years after' the expedition .}}\n|-\n! style=text-align:left | Claim\n! letter\n! Casas\n! Castillo\n! Gómara\n! Martyr\n! Oviedo\n! Salazar\n! Sepúlveda\n|-\n! style=text-align:left;font-weight:normal | Fleet departed in 1517\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n! style=text-align:left;font-weight:normal | Expedition organised by Córdoba, Morante, and Caicedo\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n! style=text-align:left;font-weight:normal | Expedition organised by all crew\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n! style=text-align:left;font-weight:normal | Expedition organised by Velázquez\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n! style=text-align:left;font-weight:normal | Expedition organised  by Velázquez\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n! style=text-align:left;font-weight:normal | Expedition licensed  by Velázquez\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n! style=text-align:left;font-weight:normal | Velázquez put up a brig\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n! style=text-align:left;font-weight:normal | Fleet composed of two ships, one brig\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n! style=text-align:left;font-weight:normal | Crew coached by organisers\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n! style=text-align:left;font-weight:normal | Córdoba captain\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n! style=text-align:left;font-weight:normal | Íñiguez veedor\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n! style=text-align:left;font-weight:normal | Alaminos pilot\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n! style=text-align:left;font-weight:normal | Camacho and Álvarez pilots\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n! style=text-align:left;font-weight:normal | González chaplain\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n! style=text-align:left;font-weight:normal | Crew of 110\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n! style=text-align:left;font-weight:normal | Fleet departed in February\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n! style=text-align:left;font-weight:normal | Fleet departed 8 February from Havana\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n! style=text-align:left;font-weight:normal | Fleet departed from Santiago\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n! style=text-align:left;font-weight:normal | Fleet coasted to Cape San Antón\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n! style=text-align:left;font-weight:normal | Fleet put out to Yucatán Channel 20 February\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n! style=text-align:left;font-weight:normal | Expedition aimed to discover new lands\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n! style=text-align:left;font-weight:normal | Expedition aimed to capture Amerindian slaves\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n! style=text-align:left;font-weight:normal | Expedition aimed to both discover and enslave\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n! style=text-align:left;font-weight:normal | Fleet's sailing direction given\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n! style=text-align:left;font-weight:normal | Expedition's aim changed during journey\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n! style=text-align:left;font-weight:normal | Fleet's sailing style was\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n! style=text-align:left;font-weight:normal | Storm steered fleet off course\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n! style=text-align:left;font-weight:normal | Fleet arrived at Yucatán Peninsula\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n! style=text-align:left;font-weight:normal | Peninsula–Cuba distance given\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n! style=text-align:left;font-weight:normal | Days spent crossing Channel given\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n! style=text-align:left;font-weight:normal | Fleet arrived at Punta de Yucatán\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n! style=text-align:left;font-weight:normal | Fleet arrived at Eccampi\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n! style=text-align:left;font-weight:normal | Fleet arrived at Provincia de Yucatán\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n! style=text-align:left;font-weight:normal | Fleet arrived at Punta de las Mujeres\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n! style=text-align:left;font-weight:normal | Fleet arrived at Cape Catoche or Great Cairo\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n! style=text-align:left;font-weight:normal | Fleet arrived at Cozumel\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n! style=text-align:left;font-weight:normal | Fleet arrived at Campeche\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n! style=text-align:left;font-weight:normal | Crew saw whitewashed masonry houses\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n! style=text-align:left;font-weight:normal | Crew saw clothed residents\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n! style=text-align:left;font-weight:normal | Crew saw lots of gold\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n! style=text-align:left;font-weight:normal | Captain named land Yucatán\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n! style=text-align:left;font-weight:normal | Captain named cape Catoche\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n! style=text-align:left;font-weight:normal | Crew abducted Catoche locals\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n! style=text-align:left;font-weight:normal | Battle occurred at Cape Catoche\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n! style=text-align:left;font-weight:normal | Fleet sailed from Punta de Yucatán to Campeche\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n! style=text-align:left;font-weight:normal | Fleet sailed from Provincia de Yucatán to Campeche\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n! style=text-align:left;font-weight:normal | Fleet sailed from Cape Catoche to Campeche\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n! style=text-align:left;font-weight:normal | Fleet sailed from Eccampi and Cairo to Campeche\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n! style=text-align:left;font-weight:normal | Fleet sailed from Punta Mueres, Cape Catoche, and Yucatán to Campeche\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n! style=text-align:left;font-weight:normal | Fleet sailed from Cozumel, an unnamed town, and Cape Catoche to Campeche\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n! style=text-align:left;font-weight:normal | Fleet sailed from Cozumel, sans disembarking, to Campeche\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n! style=text-align:left;font-weight:normal | Fleet sailed from straight to Campeche\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n! style=text-align:left;font-weight:normal | Fleet arrived in Campeche\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n! style=text-align:left;font-weight:normal | Distance to Campeche given\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n! style=text-align:left;font-weight:normal | Fleet arrived in Campeche on domingo de Lázaro or día de san Lázaro\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n! style=text-align:left;font-weight:normal | Captain named Campeche Lázaro\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n! style=text-align:left;font-weight:normal | Captain named mayor Lázaro\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n! style=text-align:left;font-weight:normal | Number of crew who disembarked in Campeche given\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n! style=text-align:left;font-weight:normal | Crew well received in Campeche\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n! style=text-align:left;font-weight:normal | Cannons fired in Campeche\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n! style=text-align:left;font-weight:normal | Crew abducted Campeche locals\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n! style=text-align:left;font-weight:normal | Banquet held in Campeche\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n! style=text-align:left;font-weight:normal | Crew visited Campeche temple\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n! style=text-align:left;font-weight:normal | Crew saw signs of human sacrifice in Campeche\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n! style=text-align:left;font-weight:normal | Crew saw 'Christian' crosses in Campeche\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n! style=text-align:left;font-weight:normal | Fleet arrived in Champotón\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n! style=text-align:left;font-weight:normal | Distance to Champotón given\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n! style=text-align:left;font-weight:normal | Champotón mayor named\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n! style=text-align:left;font-weight:normal | Crew ill-received at Champotón\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n! style=text-align:left;font-weight:normal | Crew slept ashore\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n! style=text-align:left;font-weight:normal | Champotón locals kept watch over crew\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n! style=text-align:left;font-weight:normal | Champotón locals sought to distance the landed crew from their ships\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n! style=text-align:left;font-weight:normal | Crew noticed locals' night watch\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n! style=text-align:left;font-weight:normal | Locals launched surprise assault\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n! style=text-align:left;font-weight:normal | Number of local attackers given\n|\n| 1,000-->\n|\n|\n|\n|\n|\n|\n|-\n! style=text-align:left;font-weight:normal | Number of local casualties given\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n! style=text-align:left;font-weight:normal | Number of Spanish fatal casualties given\n|\n|\n| 50 plus 5 in ships-->\n|\n|\n|\n| 20-->\n|\n|-\n! style=text-align:left;font-weight:normal | Number of Spanish non-fatal casualties given\n|\n|\n|\n| 50-->\n|\n| 30-->\n| 50-->\n|\n|-\n! style=text-align:left;font-weight:normal | Two crew men were captured in battle\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n! style=text-align:left;font-weight:normal | Captain was injured in battle\n|\n|\n|\n|\n|\n|\n| 20 or 33 injuries-->\n|\n|-\n! style=text-align:left;font-weight:normal | Fleet fled from Champotón\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n! style=text-align:left;font-weight:normal | Fleet returned to Cuba\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n! style=text-align:left;font-weight:normal | Fleet stopped at Estero de los Lagartos\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n! style=text-align:left;font-weight:normal | Fleet returned to Cuba via Florida\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n! style=text-align:left;font-weight:normal | Velázquez was debriefed\n|\n|\n|\n|\n|\n|\n|\n|\n|}\nSee also\n* Fourth voyage of Columbus, 1502–1504 expedition thought to have had contact with Maya civilisation\n* Pinzón–Solís voyage, 1508–1509 expedition thought to have coasted the southeastern Peninsula\n* Juan de Grijalva, leader of 1518 expedition occasioned by the Hernández de Córdoba expedition\nNotes and references\nExplanatory footnotes\nShort citations\nFull citations\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#"
    }
  ]
}