{
  "content": [
    {
      "type": "text",
      "text": "# Hero (Battlestar Galactica)\n\n| production =\n| writer = David Eick\n| director = Michael Rymer\n| guests =\n*Carl Lumbly as Lt. Daniel \"Bulldog\" Novacek\n*Donnelly Rhodes as Cottle\n*Lucy Lawless as Number Three\n*Luciana Carro as Louanne \"Kat\" Katraine\n* Rekha Sharma as Tory Foster\n| season_article = Battlestar Galactica season 3\n| episode_list = List of Battlestar Galactica (2004 TV series) episodes\n| prev = A Measure of Salvation\n| next = Unfinished Business\n}}\n\"Hero\" is the eighth episode of the third season from the science fiction television series Battlestar Galactica. This episode aired on November 17, 2006.\nThe episode features guest star Carl Lumbly, playing Lieutenant Novacek, going head-to-head with Edward James Olmos as Admiral Adama. Written by executive producer David Eick and directed by Michael Rymer, the episode is a \"standalone\" that does not tie strongly into the series' mythology arc.\nPlot\nThe fleet encounters two Cylon Raiders in pursuit of a third. Starbuck and Kat take out the two pursuing Raiders and engage the third when a panicked male voice comes over the comm identifying himself as Lt. Daniel \"Bulldog\" Novacek and pleads to call off the attack. Admiral Adama allows the Raider to land on the Galactica and a disheveled man emerges from the cockpit.  Adama welcomes the man aboard apparently knowing who he is. Novacek is checked over by Doctor Cottle who confirms he is not a Cylon and in good physical health.\nNovacek is then debriefed by Adama who is curious to know how he escaped the Cylons. Novacek explains that he was held prisoner for the past three years and found an opportunity for escape when the Cylons showed signs of sickness. Adama believes it was the effect of the virus they found killing the Cylons earlier, to which Novacek says he was apparently immune.\nPresident Roslin asks for more details on Novacek's situation. Adama informs her that Novacek was a pilot for a black op mission when Adama was in command of the Battlestar Valkyrie. Adama was sent to deal with colonists from the colony of Tauron, who were violating the Cylon Peace Treaty by prospecting for tylium ore on a moon that was too close to the Armistice Line. Novacek was on a recon mission but the Cylons shot him down, and Adama states he didn't know that Novacek had survived.\nElsewhere, the Cylon Number Three is wandering the corridors of Galactica dodging security personnel. Once it becomes apparent they are after her, she runs away, coming upon a door she cannot open which reads \"End of Line\". She turns to the human soldiers, telling them to shoot her. They do, but she quickly awakens from the \"dream\", back aboard a Cylon Basestar and in bed after an apparent ménage à trois with Gaius Baltar and Number Six.\nBack at the fleet, Adama goes to Colonel Tigh's quarters to tell him about the reappearance of Novacek. Tigh is baffled as to how the man had survived his recon mission and wonders what Adama plans to do about it, since Novacek's return could cause a problem if the \"truth\" were found out.\nLater, Adama meets with his son Lee to discuss Novacek. Adama tells Lee the truth about the mission to Tauron. Adama was in fact ordered by the Colonial Fleet Admiralty (directly by Admiral Peter Corman) to conduct surveillance on the Cylons. They hoped to send a stealth ship across the Armistice Line to learn about the Cylons' military capabilities and intentions. During the mission, unidentified Cylon ships disabled Novacek's Stealthstar fighter. Lee is shocked to learn that some in the Colonial Forces' upper echelons suspected that the Cylons were using the Armistice to rebuild their forces, and that an attack on the Colonies was inevitable. Adama then chokes up, stating the worst part of the mission was his own decision to shoot down Novacek to prevent him from being captured. He feared that if the Cylons captured him, they would retaliate knowing the humans violated the Armistice first by spying on them.\nSimultaneously, Novacek visits Tigh. Believing Novacek already knew what really happened, Tigh reminisces about the fateful mission, revealing the harrowing truth about Adama's decision.\nAdama continues with the story, lamenting that the failed mission probably instigated the Cylon attack. Despite protests from Lee, Adama believes that he is responsible for the destruction of the Twelve Colonies.\nBack on the Basestar, Number Three's dreams grow increasingly worse and she seeks release. She orders a Centurion to kill her, overriding its directives and telling it to delete the incident from its memory afterwards. The Centurion promptly shoots her in the head and she is resurrected. After awakening from her \"death\", she tells another Three that during her download, she saw \"something so beautiful between life and death\", apparently getting a rush from the effect to temporarily escape her mental torment.\nBack aboard Galactica, Starbuck analyzes the gun camera footage of the Cylon Raider chase of Novacek and finds something curious. She brings hard copies of the images to Tigh and informs him that the Raiders had every opportunity to shoot Novacek down, but it looks like they were purposely missing. She is also skeptical about Novacek not only escaping the Cylons, but how he managed to find the fleet as well. Tigh becomes concerned and goes to inform Adama.\nAdama is in his quarters when he gets an urgent call from Novacek asking to talk to him. Adama quickly heads down and enters Novacek's quarters, where Novacek strikes him in the stomach with a metal pipe. Adama stoops over and Novacek hits him in the face, sending Adama crashing into a table. Novacek ties Adama up and begins choking him, furiously blaming his former commander for sending him on a mission to be captured and tortured by the Cylons for the past three years.\nTigh comes to Adama's rescue, pointing a gun to Novacek's head. Novacek goes for the gun, but Tigh fights him off with the metal pipe. Tigh defends the Admiral's decision to shoot Novacek down, telling him \"We're all soldiers, Danny; we're all expendable.\"  Tigh tells Novacek that he was duped by the Cylons. They purposely let him go and drove him toward the fleet, somehow knowing that once he learned the truth, he would try to kill Adama.  Novacek finally comes to his senses and realises he was just doing the Cylons' dirty work for them.\nA while later, Adama goes to Colonial One and hands his resignation to Roslin, saying he has to face up to what he has done and no longer deserves his command. Roslin refuses his resignation; in fact, she was just about to award him a medal of distinction for his 45 years of military service. Adama says he doesn't deserve it, but she admits the medal is not for \"him\" but for \"them\", the men and women under his command, who need a hero.  When Adama laments his role in destroying the human race, Roslin responds by saying that the matter was both anybody's and everybody's fault. She also suggests he may have been manipulated by the admiralty to provoke a war.  His penance in the Novacek matter will be to accept the medal, like it or not, and continue his job.\nAdama accepts his medal. After the ceremony, he sees Novacek off as he departs for another ship in the fleet to attempt to rebuild his life as a civilian. Before he departs, Adama hands Novacek his Fleet uniform, reminding him \"once a pilot, always a pilot,\" and the two salute each other one final time. Adama is then later paid a visit in his quarters by Colonel Tigh, who is uncertain  why he went there in the first place. When Tigh rebuffs Adama's plea for him to return to his duties as the Galactica's XO, Adama then asks him if he is ready to talk about what happened to Ellen. Tigh says he needs a drink to which Adama replies, \"Me too.\" The two sit down to talk.\nReception\nIn a review for Slant Magazine, Emily St. James noted that the \"Hero\" \"was a mostly subdued hour –&nbsp;a meditation on the nature of heroism that resisted the bombast that marks Galactica at its worst. While the story was slight, the ideas behind it weren't, and the show's actors made it a master class in how to perform ridiculous material without looking ridiculous.\"\nNotes\n* A continuity error in the flashback to the Valkyrie CIC has Adama wearing admiral's insignia on his uniform.\nReferences\nExternal links\n* \"Hero\" at the Battlestar Wiki\n* [http://www.syfy.com/battlestar/episodes/season/3/episode/308/hero \"Hero\"] at Syfy.com\n*\nfr:Saison 3 de Battlestar Galactica#Héros"
    }
  ]
}