{
  "content": [
    {
      "type": "text",
      "text": "# Hero of War\n\n| writer   = Rise Against\n| producer =\n}}\n\"Hero of War\" is a 2008 song by Rise Against from the album Appeal to Reason. The song was mistaken to be the album's third single, after a music video of the song was released on the band's Myspace on May 20, 2009. However, it was later revealed it was just a promotional video and \"Savior\" is in fact, the third single.\nRecording\nLead vocalist Tim McIlrath wrote the music and lyrics for \"Hero of War\" during the recording sessions of Rise Against's fifth album Appeal to Reason. Toward the completion of Appeal to Reason, McIlrath thought to include an acoustic song he had written earlier in the sessions, but was not sure if it would fit with the rest of the hardcore music on the album. He told producer Bill Stevenson about a possible acoustic song he had written from the perspective of a war veteran. By coincidence, Stevenson had just thought about writing an anti-war song, and after listening to the acoustic song, he convinced McIlrath to include it on the album.\nSong meaning\nThe song starts out with an army recruiter asking the protagonist, a potential recruit, to enlist. With promises of adventure and money, he does indeed sign up. At the end of the song, the protagonist, now a veteran, recalls with bitter irony the army recruiter's promise that signing up would mean he could \"see the world\".\nThe protagonist sees how destructive wars are, including the destruction of his own moral scruples, as the protagonist is convinced, after initially protesting, to join in and participate in the torture of a prisoner. The soldier repeatedly declares his loyalty and trust in his country's flag, but after killing a woman who he later learns was carrying a white flag, he changes his mind about his former flag-waving patriotism, instead putting his trust now in the white flag. Near the end, the veteran reacts with revulsion to those who see him as \"A hero of war, is that what they see? Just medals and scars, so damn proud of me.\" Tim says he was expressing sarcasm because many people treat soldiers like heroes, even though many don't feel like heroes.\nTim McIlrath wrote this song due to the violence in the war, but also for the troops that serve overseas protecting their respective countries.\nMusic video\nA music video was made for the song, although it wasn't released as a single from the album, and thus the song was mistaken to be the album's third single. The music video was released on May 20, 2009, on the band's Myspace page.\nThe video fades between lead singer Tim McIlrath sitting and singing the song while playing the acoustic guitar, and shots of soldiers in war.  Among these are clips of a visibly distressed soldier. The video ends with the soldier walking down a street, bare-chested, with paint on his face, while sirens go off in the background, implying he had descended into violence due to PTSD while in normal society.\nPersonnel\n* Tim McIlrath – lead vocals, Acoustic guitar\nCharts\nWeekly charts\n{| class=\"wikitable plainrowheaders\" style=\"text-align:center\"\n|-\n! scope=\"col\"| Chart (2009–2010)\n! scope=\"col\"| Peak position\n|-\n|}\nYear-end charts\n{| class=\"wikitable plainrowheaders\" style=\"text-align:center\"\n|-\n! scope=\"col\"| Chart (2010)\n! scope=\"col\"| Position\n|-\n! scope=\"row\"| Sweden (Sverigetopplistan)\n| 45\n|}\nCertifications\nSee also\n* List of anti-war songs\nReferences"
    }
  ]
}