{
  "content": [
    {
      "type": "text",
      "text": "# Heroes of the Forgotten Kingdoms\n\nHeroes of Forgotten Kingdoms is a supplement to the 4th edition of the Dungeons & Dragons role-playing game.\nContent\nHeroes of the Forgotten Kingdoms includes new builds and character options for the druid (the Sentinel), the paladin (the Cavalier), the ranger (the Hunter and the Scout), and the warlock (the Hexblade). \"Each class comes with a set of new powers, class features, paragon paths, epic destinies, and more [...]. In addition to new builds, this book presents expanded information and racial traits for some of the game’s most popular races, including dragonborn, drow, half-elves, half-orcs, and tieflings\".\nThe table of contents lists the follow sections:\n* Introduction\n* Chapter 1: Game Overview\n* Chapter 2: Making Characters\n* Chapter 3: Understanding Powers\n* Chapter 4: Character Classes\n* Chapter 5: Character Races\n* Chapter 6: Skills\n* Chapter 7: Feats\n* Chapter 8: Gear and Weapons\n* Glossary\n* Index\nShannon Appelcline, author of Designers & Dragons, commented that \"Heroes of the Forgotten Kingdoms was a close match for Heroes of the Fallen Lands; they were both books solely focused on the creation of characters, harking back to the original AD&D Players Handbook (1977). In fact, they were so similar to each other that they included considerable duplication, particularly for sections covering: game overview (chapter 1), making characters (chapter 2), understanding powers (chapter 3), skills (chapter 6), feats (chapter 7), and gears and weapon (chapter 8). The only major expansions in these sections were rules on summoning in chapter 3 (which were needed to support the warlock) and feats for the new races and classes in chapter 7\".\nPublication history\nHeroes of the Forgotten Kingdoms was the second book for players in the Essentials line, after Heroes of the Fallen Lands (2010). It was published on November 16, 2010 as a trade paperback in digest size. Greg Tito, for Escapist Magazine, wrote that Mike Mearls \"intended the Essentials line - essentially a repackaging of 4E rules into easier-to-digest books - to get back to the shared language that unites all D&D players\".\nAppelcline wrote that \"September and October 2010 saw the publication of the first four books of the Essentials line: Dungeons & Dragons Starter Set (2010), Rules Compendium (2010), ''Dungeon Master's Kit (2010), and the first players book, Heroes of the Fallen Lands (2010). Now, in November 2010, the set of six rules-oriented releases for Essentials was drawing to a close. The DM-oriented Monster Vault (2010) and the second players book, Heroes of the Forgotten Kingdom (2010), were both published on November 16\".\nOn September 1, 2015, Heroes of the Forgotten Kingdom was re-released as a PDF.\nReception\nOn the Essentials line, M.J. Harnish, for Wired'', commented that \"for the past few years, starting with the very announcement of 4E and the Virtual Tabletop debacle, Wizards has been very poor at communicating honestly and openly with its fan base and has put out a string of very sub-par or poorly supported products, many of which saw errata almost immediately after their release. [...] Confusing titles and formats (for example, the adoption of the digest-size books for the Essentials line and then subsequent abandonment of that format) didn't help the matter\".\nCritical-Hits compared Heroes of the Forgotten Kingdoms to Heroes of the Fallen Lands and highlighted that both books greatly overlap including that the first 72 pages of both books are nearly identical. They wrote that \"as the primary offering of Essentials D&D material for players, these books serve two very important and very different purposes. The first is that they present new and reworked builds for existing 4th Edition classes that change some of the fundamental ways the player interacts with the mechanics of the game. The second purpose they serve is in updating some of the key components of the game such as feats and the magic item system, both of which have been changed for the better in my opinion. If you’re a 4th Edition player and are looking for something new or different for your favorite class, I highly recommend looking through the book that contains that class and giving it a shot\".\nAppelcline commented that \"despite the extensive duplication of the core Essentials rules, the center 200 pages or so are new, covering the unique classes and races of the Forgotten Kingdoms. [...] One of the major controversies over Essentials was the fact it rolled back some of the changes in 4e, reverting some of the game's philosophies to their 3e roots. Though much of this had to do with how classes were constructed, it's interesting to see that Essentials was also returning character classes to tropes popularized in D&D 3e. [...] The races of Heroes of the Forgotten Kingdom are many of the newer, and less usual offerings\".\nReferences"
    }
  ]
}