{
  "content": [
    {
      "type": "text",
      "text": "# Heroes of Three Kingdoms\n\n|genre          = Massively multiplayer online role-playing game\n|modes          =Multiplayer\n|platforms      =\n}}\nHeroes of Three Kingdoms () (also known as Chi Bi or Red Cliff in China, and Legend of 3 Kingdoms in Indonesia) was a massively multiplayer online role-playing game set in ancient China during the fall of the Han dynasty. The game, developed by Perfect World, offers free-to-play, no subscription-based game play, and entered Open Beta status on October 16, 2009.\nThe North American version, entitled Heroes of Three Kingdoms, was announced on April 12, 2010, by Perfect World Entertainment, the US subsidiary of Perfect World Co.  Heroes of Three Kingdoms entered Closed Beta on July 13, 2010.\nThe closure of the North American version of the game was announced on September 29, 2011. The game closed on November 1, 2011, and the forums and website were removed at the same time.   Cubizone no longer includes Chi Bi in its game list.\nPlot\nThe story of the game is based on the well-known time period of China, the Three Kingdoms. During this era, the country is in the midst of a civil war. Among the groups fighting, three leaders stand out: Cao Cao of Wei, Liu Bei of Shu, and Sun Quan of Wu. In this game, players can choose to join any of the three warring factions (Wei, Shu, or Wu).\nCharacters\nUpon creating a character and entering the game, your character has no affiliations but eventually is given the choice to pick a side and choose one of the Three Kingdoms from ancient China to fight for: the historically based Cao Wei, Shu Han or Eastern Wu Kingdoms. Players must choose a weapon when they create their character.  Depending on the weapon chosen, this will determine their class and available skills.\nPlayers can choose from the following weapons: Glaive, Spear, Halberd, Cleaver, Multiblade (originally called the Trident), Staff,  Saber, Hatchets, Hammer, Hooksword, Mace, Talons, Gauntlets, Ring Blade, Scepter, Charmer, War Fan, and Bow. Weapons added later in later patches include the Stick, Shield, Whip, and Crossbow.\nAside from deciding on which kingdom to join, players are also required to pick a race for their character upon creation. The game features two races: the Yan and the Miao. Both races progress from their respective starting locations to Xiliang.\nReferences\nExternal links\n*[http://3k.wavegame.net 3 Kingdoms Online]"
    }
  ]
}