{
  "content": [
    {
      "type": "text",
      "text": "# Heyward Shepherd monument__disambig_1\n\nThe Heyward Shepherd monument is a monument in Harpers Ferry, West Virginia. It commemorates Haywood}} Shepherd (1825&nbsp;– October 17, 1859), a free black man who was the first person killed during John Brown's raid on Harpers Ferry. It was erected in 1931 by the United Daughters of the Confederacy (UDC), who sought to promote Shepherd as a \"faithful slave\" and role model for Blacks.}} The inscription misrepresents the circumstances of Shepherd's death to imply that he consciously opposed John Brown's plan to spark a slave rebellion; in reality, Shepherd was not aware of the plan and believed he was dealing with robbers. The inscription goes on to praise the \"faithfulness of thousands of negroes\" to the Confederacy during the American Civil War. The idea of the \"faithful slave\" was an important component of the \"Lost Cause of the Confederacy\", a pseudohistorical myth that the cause of the Confederacy was justified and not centered on slavery. The Heyward Shepherd monument was one of many erected by the UDC to help popularize the Lost Cause myth.\nThe UDC commissioned the monument in response to a nearby plaque dedicated to John Brown in 1918 by the all-black Storer College. Although the monument was completed before 1923, it was not installed immediately because local White leaders feared that it would provoke interracial animosity. The UDC eventually agreed to change the design to satisfy White leaders' concerns, and the memorial was dedicated in 1931. Despite the changes, the monument was strongly opposed by the NAACP, the Black press, and the local Black community. The NAACP responded by creating a new tablet that was even stronger in its support for John Brown. The Heyward Shepherd monument continued to be controversial. The National Park Service (NPS) designed a series of interpretative signs to place the monument in historical context, and from 1981 to 1995 kept it covered in plywood to prevent vandalism. As of 2022, the monument remains on display accompanied by an interpretative sign.\nHistorical context\nBlack people's response to John Brown\n:''See also John Brown's raiders#Black participation''\nThe monument was intended to publicize the Lost Cause allegation that the enslaved were happy and did not want freedom; the UDC had a \"Faithful Slave Memorial Committee\". However, the grand jury Bill of Indictment lists 11 Black enslaved men who were allegedly incited to revolt by the accused. One was locked up in the Charles Town jail together with Brown, Green, and the others. The owners of two submitted claims for their losses. Some slaves were observed with weapons inside the Arsenal. The story that Washington and Allstadt's slaves were there only because they were forced to be there is what the slaves had said, after Brown's raid had failed, and their owners wanted to believe that.\nA different view is provided by Osborne Perry Anderson, the only Black in Brown's party who escaped:\n}}\nHowever, the official view, in the reports of the Virginians Lt. Col. Robert E. Lee and Governor Henry A. Wise, was that no Blacks participated voluntarily at all. Lee's report did not become public until the report of the Senate Select Committee investigating the incident, over six months later. But Wise's views were widely known, as he stated them clearly in speeches, which appeared in many newspapers.\nThere is no evidence that Shepherd was opposed to John Brown's plan to end American slavery, or even that he had heard of it. He thought he was dealing with robbers. Nevertheless, the monument was intended to be a reply to Blacks' glorification of Brown, in whose honor Storer College had been established in Harpers Ferry; the college placed a plaque on the Armory in 1918. There was no better place, from the UDC's point of view, for a monument to the \"happy slave\" than Harpers Ferry.\nHaywood Shepherd\nHaywood Shepherd was a Black man; according to one source he was born free, but another source says that he had been the property of station master Fontaine Beckham. He was over 6 feet (180&nbsp;cm) in height, and lived in Winchester, Virginia, about  southwest of Harpers Ferry, which two communities were served by the Winchester and Potomac rail line. He owned a small house there, had a wife and five children, according to the 1860 census, and had money in the bank.\nHe had worked for nearly twenty years as a porter or baggage handler with the Baltimore and Ohio Railroad, whose trains went back and forth through Harpers Ferry. In Harpers Ferry was the first interline rail junction in the country: there was frequently baggage or freight to move to or from the trains of the Winchester and Potomac Railroad, whose northern terminus was the Harpers Ferry station. The stationmaster was Fontaine Beckham, the popular mayor of Harpers Ferry; when he was absent, Shepherd was in charge of the station. Beckham, who also was killed, \"liked him very much.\"\nWhat happened, as described by Shepherd to the physician who treated him, John D. Starry, was \"that he had been out on the railroad bridge looking for a watchman who was missing, and he had been ordered to halt by some men who were there, and, instead of doing that, he turned to go back to the office, and as he turned they shot him in the back.\" He rejected his assaulters' claim that this was to begin a slave rebellion. He thought they were robbers and refused to keep quiet as they requested.\nA bill was introduced into the Virginia Legislature to provide a pension for his widow Sarah. His wife and children moved to Washington, D.C.\nHe was buried in the Winchester–Fairfax Colored Cemetery, on what is today Route 11, with \"honors of war by the military companies of the town, accompanied by the mayor and other citizens.\" However, in 1932 no one could find his grave.\nSubsequently, Winchester's Old Colored Cemetery has been paved over and the location used for parking. It was located at current North East Lane and Woodstock Lane, near .\nMonuments\nThere has been contention throughout the 20th century as to what plaque, if any, should be displayed next to the UDC's memorial. \"Today the Heyward Shepherd Memorial stands not as a representative of a community's collective remembrance, but rather as a testament to the struggle between Southern Whites and African Americans to write their respective memories of the raid into the historical landscape.\"\n1918 plaque to Brown\nThe origin of the monument to the \"faithful slave\" is the monument to Brown, posted on the original building, the \"firehouse,\" which had been moved to the campus of Storer College:\nTHAT THIS NATION MIGHT HAVE\nA NEW BIRTH OF FREEDOM\nTHAT SLAVERY SHOULD BE REMOVED\nFOREVER FROM AMERICAN SOIL\nJOHN BROWN\nAND HIS 21 MEN GAVE THEIR\nLIVES\nTO COMMEMORATE THEIR\nHEROISM THIS TABLET IS\nPLACED ON THIS BUILDING\nWHICH HAS SINCE BEEN\nKNOWN AS\nJOHN BROWN'S FORT\nBY THE\nALUMNI OF STORER COLLEGE\n1918\n1931 monument\nIn 1931, after opposition since it had been proposed in 1920, what was called at the time the Faithful Slave Memorial was erected by the Sons of Confederate Veterans and the United Daughters of the Confederacy )}}. The text of the granite monument reads: On the night of October 16, 1859, Heyward Shepherd, an industrious and respected colored freeman, was mortally wounded by John Brown's raiders. In pursuance of his duties as an employee of the Baltimore and Ohio Railroad Company, he became the first victim of this attempted insurrection.This boulder is erected by the United Daughters of the Confederacy and the Sons of Confederate Veterans as a memorial to Heyward Shepherd, exemplifying the character and faithfulness of thousands of negros who, under many temptations throughout subsequent years of war, so conducted themselves that no stain was left upon a record which is the peculiar heritage of the American people, and an everlasting tribute to the best in both races.\nAlthough he had objected to the original 1920 proposal as provocative of \"unpleasant racial feeling\"—there was a Ku Klux Klan march a year later—Storer College president Henry T. MacDonald gave the opening address, and the college chorus performed. A \"distinguished colored clergyman\" gave the benediction.\n1932 plaque\nThe monument was immediately challenged by many as perpetuating the \"happy slave\" concept of slavery as a justification for the practice.\nThe NAACP responded by preparing a plaque, which they called \"The Great Tablet\", to be displayed at Storer College in Harpers Ferry, where the firehouse used by John Brown as a fort had been moved. The text on the plaque, replying to the \"faithful slave\" allegation that Virginia's happy slaves did not want freedom, states that seven \"slaves and sons of slaves\" fought with Brown, who was \"crucified\". It was written by W. E. B. Du Bois, author of a biography of John Brown and NAACP cofounder. Henry T. McDonald, the white president of Storer, who had participated in the UDC's 1931 ceremony, refused to allow the plaque to be mounted, because he found it \"too militant\".\nIn 2006, 74 years later, the plaque was finally given a public place, but a remote one: on the former Storer College grounds, at the Fort's former location. Tourist guides largely ignore it. The plaque reads:\n[http://www.jaas.gr.jp/jjas/PDF/2012/01_007-026.pdf#page=13 2010 picture of the plaque]  at its current location. [https://storage.googleapis.com/clio-images/33482.78780.jpg Close-up photo].\n1955 plaque\nA plaque to contextualize the original 1931 monument was placed in 1955 by the National Park Service. The text of the plaque read:\nJohn Brown's raid on the armory at Harpers Ferry caused the death of four townspeople. One of those who died in the fighting was Heyward Shepherd, a railroad baggagemaster and a free black. Although the true identity of his assailant is uncertain, Shepherd soon became a symbol of the \"faithful servant\" among those who deplored Brown's action against the traditional southern way of life. The monument, placed here in 1931, reflects those traditional views.\nThe monument was in storage from 1976 to 1980 and then shrouded in plywood, supposedly to protect it from vandalism, until 1995.\n1995 plaque\nAnother plaque was installed near the 1931 monument by the National Park Service, to place the monument in context. It reads: On October 17, 1859, abolitionist John Brown attacked Harpers Ferry to launch a war against slavery. Heyward Shepherd, a free African-American railroad baggage master, was shot and killed by Brown's men shortly after midnight. Seventy-two years later, on October 10, 1931, a crowd estimated to 300 whites and 100 blacks gathered to unveil and dedicate the Shepherd Monument. During the ceremony, voices rose to praise and denounce the monument. Conceived around the turn of the century, the monument endured controversy. In 1905, the United Daughters of the Confederacy stated that erecting the monument would influence for good the present and coming generations, and prove that the people of the South who owned slaves valued and respected their good qualities as no one else ever did or will do. \"Also on the wayside [the 1995 plaque] is a section titled 'Another Perspective.' It is the same response to the Shepherd Memorial that Du Bois wrote in 1932 and hoped to have inscribed on the John Brown Fort\".\nSee also\n* Loyal slaves monument\nNotes\nReferences\nMedia\n*\n*\nFurther reading (most recent first)\n*\n*\n*\n*\n* Hayes, Dianne. \"NAACP Retraces History at Harpers Ferry.\" Diverse: Issues in Higher Education 23, no. 13 (August 10, 2006): 17.\n* Shackel, Paul A. (2003). \"Southern Heritage and the Faithful-Slave Monuments: The Heyward Shepherd Memorial\". Ch. 3 of Shackel, Paul A. Memory in Black and White: Race, Commemoration, and the Post-Bellum Landscape. Walnut Creek, California: AltaMira Press.\n*\n*\n*\n* Andrews, Matthew Page. [http://www.worldcat.org/oclc/5528615 Heyward Shepherd, Victim of Violence. Address of Dedication at the Unveiling of the Heyward Shepherd Monument, at Harpers Ferry, October 10, 1931]. [Harpers Ferry, W. Va.?]: Published under the auspices of the Heyward Shepherd Memorial Association, 1931."
    }
  ]
}