{
  "content": [
    {
      "type": "text",
      "text": "# High steward (civic)__disambig_1\n\nHigh steward is an honorary title bestowed by the councils or charter trustees of certain towns and cities in England. Originally a judicial office with considerable local powers, by the 17th century it had declined to a largely ceremonial role. The title is usually awarded for life, and in some cases has become associated with a particular peerage title. As of 2007 twenty-four communities have the right to confer the status of high steward, although the office is in abeyance in a number of these.\nOrigins\nOriginating in the Middle Ages, the office holder originally oversaw the administration of borough courts on behalf of the lord of the manor. As towns emerged from manorial control to become chartered boroughs governed by corporations, the new governing bodies were given the right to appoint the steward in lieu of the lord. These stewardships were often instruments of patronage, with prominent courtiers obtaining charters for boroughs which in turn named them as steward. Boroughs also returned members to the House of Commons, and in many the steward was able to use his influence to effectively obtain the election of his own nominee.\nOver time the legal aspects of the office passed to a deputy: a qualified lawyer eventually given the distinct title of recorder. By 1689, the High Steward (in some boroughs known as Chief Steward, Capital Seneschal or Lord High Steward) had a purely honorary role. Sidney and Beatrice Webb summarised this as follows:\nHis appointment might rest with the Crown, or with the Governing Council or Close Body of the Corporation, sometimes subject to the approval of the Crown. ...an officer of great dignity and some influence, but with practically no duties or emoluments; usually a gentleman of high position, perhaps the owner or the patron of the Borough\nMunicipal and local government reform\nIn January 1836 the close corporations of boroughs were replaced by elected town councils under the Municipal Corporations Act 1835. The act provided that the provisions of existing charters, where they were not inconsistent with the legislation, were to remain in force. Many of the new councils had Whig and Radical majorities in place of the former Tory corporations. The appointments of stewards by the close corporations had sometimes proved controversial. For example, in 1833, the corporation of Kingston upon Hull nominated the Duke of Wellington, former Tory prime minister, to the office of High Steward. Following uproar among the townspeople, the Duke declined the office, which remained vacant. In 1836 the reformed town council instead appointed the Earl of Durham, a prominent Whig politician, to the post.\nWith the reform of local government in the second half of the twentieth century, municipal boroughs and their councils were abolished. This has meant that high stewards are now appointed by various successor bodies: London Boroughs, district councils, town councils or charter trustees.\nList of high stewards since 1974\nThe following is a list of those persons who have held office as high stewards of towns or cities since the local government reforms of 1965 and 1974:\n*Banbury: Office was in abeyance after the death of the 20th Baron Saye and Sele in 1968. Created by charter of 1608. Revived in 2015 with appointment of former MP, Tony Baldry.\n*Bristol (Lord High Steward): In abeyance since death of 10th Duke of Beaufort in 1984.\n*Chichester: vacant\n*Congleton: Office in abeyance since death of Sir Randle John Baker Wilbraham Bt in 1980.\n*East Retford: Eric Coupland Spencer to 1981. Office revived in 2007 with appointment of Derek Turner by charter trustees.\n*Gloucester: In abeyance since death of 10th Duke of Beaufort in 1984.\n*Great Yarmouth: Michael Falcon (since 1984)\n*Grimsby: Office in abeyance with death of Carl Ross in 1986. Revived in 2007 as High Steward of North East Lincolnshire.\n*Guildford: Earl of Onslow\n*Harwich: Bill Bleakley 1979– 2007. Chris Strachan 2007– 2024. Sue Daish appointed 2024.\n*Hereford: Thomas Reginald Stephens 1974–1975; F C Morgan 1975–1978; Sir Gordon Slynn (from 1992 Gordon Slynn, Baron Slynn of Hadley) 1978–2009; Peter Temple-Morris, Baron Temple-Morris since 2009.\n*Hertford: Office traditionally held by the Marquess of Salisbury since 1605. The 6th Marquess died in 2003.\n*Ipswich: Vice Admiral Sir Frank Mason to 1988, Stuart Whiteley,  since 1990\n*Kingston upon Hull: Peter Mandelson appointed 2013 after post fell into abeyance 1974\n*Kingston upon Thames: Lord Boyd-Carpenter to 1998; David Jacobs\n*North East Lincolnshire: 2015 Austin Mitchell former MP for Great Grimsby awarded the post. Office in abeyance following Austin Mitchell's death on 18 August 2021. (Revival of former office of High Steward of Great Grimsby)\n*Romsey: Louis Mountbatten, 1st Earl Mountbatten of Burma 1940–1979; Norton Knatchbull 1979–2010; Penelope, Countess Mountbatten of Burma since 2010.\n* Southwark: This appointment is made by the City of London Court of Aldermen and is usually given as an additional office to the Recorder of London. Currently, as from June 2020, this is HHJ Mark Lucraft\n*Southwold: Graham R Denny appointed 2012\n*Tewkesbury: In abeyance since death of 10th Duke of Beaufort in 1984.\n*Tamworth: vacant\n*Wallingford: Ken Lester appointed 2015\n*Wokingham: Lucy Zeal (appointed 2018) the daughter of Lady Elizabeth Godsall who retired as high steward that year.\n{| class=\"wikitable\"\n|-\n! High Steward !! Holder !! Date Held\n|-\n| Abingdon-on-Thames\n| Richard Bertie 14th Earl of Lindsey and 9th Earl of Abingdon\n| Hereditary Held\n|-\n| Bury St. Edmunds\n| Frederick Hervey, 8th Marquess of Bristol\n| Hereditary Held\n|-\n| Colchester\n| Sir Bob Russell\n| 30 June 2015\n|-\n| King's Lynn and West Norfolk\n| Prince Edward, Duke of Kent\n| 12 March 1983\n|-\n| Plymouth (Lord High Steward)\n| Prince Philip, Duke of Edinburgh\n| 18 March 1960\n|-\n| Stratford-upon-Avon\n| Henry Seymour, 9th Marquess of Hertford\n| 17 March 2016\n|-\n| Winchester\n| Lady Mary Fagan\n| 16 May 2012\n|-\n| Windsor and Maidenhead\n| Charles, Prince of Wales\n| 8 February 1975\n|-\n|}\nFormer stewardships\nIn addition a number of boroughs formerly appointed stewards. The following stewardships which are no longer filled, were listed in directories of the late 19th and early 20th centuries: Abingdon (held by the Earls of Abingdon), Barnstaple, Bewdley, Buckingham, Cambridge, Derby (held by the Dukes of Devonshire), Gravesend (hereditary office held by the Earls of Darnley), Huntingdon, Kidderminster, Leominster, Louth, Newbury, Oxford, Reading, South Molton and Stafford.\nReferences"
    }
  ]
}