{
  "content": [
    {
      "type": "text",
      "text": "# High Intensity Drug Trafficking Area\n\nThe High Intensity Drug Trafficking Area (HIDTA) program is a drug-prohibition enforcement program run by the United States Office of National Drug Control Policy. It was established in 1990 after the Anti-Drug Abuse Act of 1988 was passed. The HIDTA program was made permanent through Title III of the Office of National Drug Control Policy Reauthorization Act of 2006.\nThe mission of the program is \"to enhance and coordinate America's drug-control efforts among local, state and federal law enforcement agencies in order to eliminate or reduce drug trafficking and its harmful consequences in critical regions of the United States.\"\nProgram purpose\nThe HIDTA program aims to reduce drug production and trafficking through:\n* bolstering intelligence sharing among federal, state, local, and tribal law enforcement;\n* disseminating reliable intelligence to law enforcement agencies to help them design effective enforcement operations and strategies;\n* promoting coordinated law enforcement strategies that rely upon available resources to reduce illegal drug supplies not only in a given area, but also throughout the country; and\n* promoting coordination and information sharing among federal, state, local, and tribal law enforcement\nThe HIDTA program does not focus on a specific drug threat, such as heroin trafficking; rather, funds are used to support each region's most pressing drug-related initiatives. These range from multiagency enforcement initiatives involving investigation, interdiction, and prosecution to drug use prevention and treatment initiatives.\nHIDTA Designations\nThe Director of ONDCP has the authority to designate areas within the United States that are centers of illegal drug production, manufacturing, importation, or distribution as HIDTAs. The director must first consult with the Attorney General, Secretary of the Treasury, Secretary of Homeland Security, heads of the relevant National Drug Control Program Agencies, and the governor of the applicable state. Four main criteria are considered when designating an area as a HIDTA:The extent to which\n# the area is a significant center of illegal drug production, manufacturing, importation, or distribution;\n# State, local, and tribal law enforcement agencies have committed resources to respond to the drug trafficking problem in the area, thereby indicating a determination to respond aggressively to the problem;\n# drug-related activities in the area are having a significant harmful impact in the area, and in other areas of the country; and\n# a significant increase in allocation of Federal resources is necessary to respond adequately to drug related activities in the area.\nThe HIDTA program uses counties as the geographic unit of inclusion in the program. To begin the designation process, a coalition of law enforcement agencies may petition the Director of ONDCP for their county to be included in an HIDTA. , there were 33 designated HIDTAs in the U.S. and its territories, and ONDCP indicates that of the 100 most populous U.S. metropolitan areas, 99 were in areas designated as HIDTAs.\nHIDTA Coordination\nAt the national level, the HIDTA program is administered by ONDCP. But each HIDTA region is governed by its own Executive Board, which consists of representatives from participating federal, state, local, and tribal agencies (if applicable), and there must be an equal proportion of federal and non-federal representatives. Additional non-voting members from non-participating agencies or associations are allowed.\nEach Executive Board must meet four times per year. Among other duties, the board is responsible for providing direction and oversight in establishing and achieving the HIDTA's goals, managing its funds, and selecting the HIDTA director for the region. The Executive Boards have the discretion to design and implement initiatives to address specific drug trafficking threats in their regions. This allows a board to tailor its strategy and reassess its initiatives to respond to changes in local drug threats. Each board is also responsible for ongoing evaluation of the HIDTA's initiatives. The evaluation considers whether each initiative is in compliance with overall HIDTA program requirements: effectively implementing the HIDTA's strategy; achieving the performance standards negotiated for the HIDTA; and being productive enough to merit continued funding from that particular HIDTA.\nFunding\nFunding for the HIDTA program is provided by a direct appropriation to the HIDTA subaccount under the ONDCP account. From the total HIDTA program appropriation, each HIDTA receives a base amount of funding calculated, in part, on its previous annual funding and HIDTA size (ranging from $2.5&nbsp;million to nearly $16.3&nbsp;million in FY2020) to support initiatives in its region. The remainder of the overall HIDTA appropriation is allocated to HIDTAs based on specific priorities throughout the country—determined collectively by the HIDTA directors and ONDCP.\nFunds provided to HIDTAs may be used to cover a range of costs, including administrative costs (such as overtime, rent, and facilities fees) and programmatic costs. The programmatic costs may be related to activities such as enforcement initiatives involving investigation, interdiction, and prosecution activities; intelligence and information collection and sharing initiatives; drug use prevention and treatment initiatives; and miscellaneous costs, such as trainings, lab fees, and information technology needs.\nSUPPORT Act Changes to HIDTA\nThe HIDTA program was most recently amended and reauthorized in 2018 by the Substance Use-Disorder Prevention that Promotes Opioid Recovery and Treatment for Patients and Communities Act (SUPPORT Act; ). In this reauthorization, the SUPPORT Act removed a prohibition on the use of HIDTA funds to establish or expand drug treatment programs and specified that a maximum of 5% of HIDTA appropriated funds can be used for \"substance use disorder treatment programs and drug prevention programs.\"\nIn popular culture\nHIDTA featured in the Law & Order episode \"Locomotion\", from the show's 15th season (2004–05). The two primary homicide detectives visited the HIDTA Branch in Greenpoint, Brooklyn.\nDuring episode 2 of the first season of True Detective the audience learns of Rust Cohle's previous law enforcement history, including participation in the HIDTA program.\nHIDTA is also featured in crime writer Patricia Cornwell's novel Black Notice. An HIDTA squad is involved in the search for a murderer.\nThe HIDTA program is frequently mentioned in the miniseries We Own This City.\nReferences\nExternal links\n*\n* [https://www.c-span.org/search/?searchtype=All&query=HIDTA Videos related to HIDTA] on C-SPAN"
    }
  ]
}