{
  "content": [
    {
      "type": "text",
      "text": "# Highland Council Wards in 2017\n\n{| class=\"toccolours\" style=\"border-collapse: collapse; float: right; margin: 0 0 1em 1em;\" border=\"1\" cellpadding=\"3\" cellspacing=\"0\" width=\"260\"\n|-\n|align=\"center\"| Image:ScotlandHighlands.png\n|-\n|align=\"center\"| Highland council area  Shown as one of the council areas of Scotland\n|-\n|align=\"center\"| 1995 to 1999 wards\n|-\n|align=\"center\"| 1999 to 2007 wards\n|-\n|align=\"center\"| 2007 to 2017 wards\n|-\n|align=\"center\"| 2017 wards\n|}\nThe fifth set of Highland Council wards, 21 in number, became effective for election purposes in 2017, for the fifth general election of the Highland Council. The new wards were created under the Local Governance (Scotland) Act 2004, and are as defined in recommendations of the Local Government Boundary Commission for Scotland. The commission's report includes maps of the new wards Generally, descriptions above are inferred from the maps.\nThe Highland Council (Comhairle na Gaidhealtachd in  Gaelic) had become a local government authority in 1996, when the two-tier system of regions and districts was abolished and the Highland region became a unitary council area, under the Local Government etc (Scotland) Act 1994. The first Highland Council election, however, was one year earlier, in 1995. Until 1996 councillors shadowed the regional and district councils and planned for the transfer of powers and responsibilities. Elections to the council are normally on a four-year cycle, all wards being contestable at each election.\nFor the periods 1995 to 1999 each of 72 wards had elected one councillor by the first past the post system. For the period 1999 to 2007, each of 80 wards had elected one councillor by the same system.  In 2007, single-member, first past the post wards were replaced by 22 multi-member wards, each electing three or four councillors by the single transferable vote system, to produce a form of proportional representation.\nUntil 2007 each council ward had been related to one of eight council management areas. In 2007 the council decided to replace the management areas with three new corporate management areas, named as (1) Caithness, Sutherland and Easter Ross, (2) Ross, Skye and Lochaber and (3) Inverness, Nairn and Badenoch and Strathspey, and designed for those services that could not be effectively or efficiently delivered and managed at ward level. Two of these names are also those of Westminster Parliament (House of Commons) constituencies, and one name is very similar to the name of another Westminster constituency, but constituency and corporate management area boundaries are different. Each corporate management area consists of a whole number of wards.\nFor ward-level management purposes ten wards are stand-alone areas, eleven are merged into larger areas, and one is divided between two areas. Also, seven wards are grouped into an Inverness city management area.\nThey were changed further in 2017 for 74 councillors in 21 wards, 11 wards returning 4 members and 10 wards returning 3 members.\nThe wards are numbered as well as named.\nLists of wards created in 2017\nCaithness, Sutherland and Easter Ross wards\nThe Caithness, Sutherland and Easter Ross corporate management area consists of seven wards represented by 23 councillors.\n{| class=\"wikitable\"\n|-\n! No\n! Ward\n! Description\n! Seats\n! Ward management area\n|-\n| 6\n| Cromarty Firth\n| North of the Cromarty Firth, west of the Tain and Easter Ross ward  Includes the towns of Alness, Evanton and Invergordon\n|align=center| 4\n| The ward itself\n|-\n| 4\n| East Sutherland and Edderton\n| Includes the towns and villages of Brora, Dornoch, Edderton, Golspie and Helmsdale  Sutherland is a former local government county, and a former district of the Highland region\n|align=center| 3\n| The ward itself\n|-\n|| 1\n| North, West and Central Sutherland\n| Includes the towns and villages of Altnaharra, Bettyhill, Bonar Bridge, Durness, Lairg, Lochinver and Tongue  Sutherland is a former local government county and a former district of the Highland region\n|align=center| 3\n| The ward itself\n|-\n| 7\n| Tain and Easter Ross\n| Between the Cromarty Firth and the Dornoch Firth, east of the Cromarty Firth ward  Includes the town of  Tain and the Seaboard Villages  Ross is a former county\n|align=center| 3\n| The ward itself\n|-\n| 2\n| Thurso and North West Caithness\n| Changed to include all of Thurso and land previously covered by the Landward Caithness ward.\n|align=center| 3\n|rowspan=2| Caithness, covering the three wards of Landward Caithness, Thurso and Wick\n|-\n| 3\n| Wick and East Caithness\n| Urban Wick and more rural areas to north and south, changed in 2017\n|align=center| 3\n|}\nInverness, Nairn and Badenoch and Strathspey wards\nThe Inverness, Nairn and Badenoch and Strathspey corporate management area consists of nine wards represented by 34 councillors. Also, seven of the wards, represented by 26 councillors, are grouped into an Inverness city management area with its own city committee.\nInverness wards\n{| class=\"wikitable\"\n|-\n! No\n! Ward\n! Description\n! Seats\n! Ward management area\n|-\n| 12\n| Aird and Loch Ness\n| Includes Loch Ness, the town of Beauly, and the village of Fort Augustus  Aird is a former district of the county of Inverness\n|align=center| 4\n| City area 1, covering the Aird and Loch Ness ward and a southern portion of the Inverness South ward\n|-\n| 17\n| Culloden and Ardersier\n| Includes the villages of Culloden, Ardersier and Smithton\n|align=center| 3\n| City area 4, covering the Culloden and Ardersier ward and a northern portion of the Inverness South ward\n|-\n| 14\n| Inverness Central\n| Includes Dalneigh, Glebe, Haugh, Merkinch and South Kessock areas of urban Inverness\n|align=center| 3\n| City area 3, covering the two wards of Inverness Central and Inverness Millburn\n|-\n| 16\n| Inverness Millburn\n| Includes Millburn, Culcabock, Longman and Raigmore areas of urban Inverness\n|align=center| 3\n| City area 3, covering the two wards of Inverness Central and Inverness Millburn\n|-\n| 15\n| Inverness Ness-side\n| Includes Drummond, Hilton and Lochardil areas of Inverness, and a more rural area, east of the River Ness\n|align=center| 3\n| City area 2, covering the two wards of Inverness Ness-side and Inverness West\n|-\n| 19\n| Inverness South\n| Includes Cradlehall, Inshes and Westhill areas in or near urban Inverness, and the village of Tomatin, on the River Findhorn\n|align=center| 4\n| Divided between city area 1, covering the Aird and Loch Ness ward and a southern portion of the Inverness South ward, and city area 4, covering the Culloden and Ardersier ward and a northern portion of the Inverness South ward\n|-\n| 13\n| Inverness West\n| Includes Kinmylies and Scorguie areas of urban Inverness, and a more rural area, west of the River Ness\n|align=center| 3\n| City area 2, covering the two wards of Inverness Ness-side and Inverness West\n|}\nOther wards\n{| class=\"wikitable\"\n|-\n! No\n! Ward\n! Description\n! Seats\n! Ward management area\n|-\n| 18\n| Badenoch and Strathspey\n| Includes the towns and villages of Aviemore, Carrbridge, Cromdale, Grantown-on-Spey, Kingussie and Newtonmore  Badenoch and Strathspey is also a former district of the Highland region\n|align=center| 4\n| The ward itself\n|-\n| 20\n| Nairn and Cawdor\n| Urban Nairn and more rural areas  Within the former county of Nairn (also known as Nairnshire), and former Nairn district of the Highland region\n|align=center| 4\n| The ward itself\n|}\nRoss, Skye and Lochaber wards\nThe Ross, Skye and Lochaber corporate management area consists of six wards represented by 23 councillors.\n{| class=\"wikitable\"\n|-\n! No\n! Ward\n! Description\n! Seats\n! Ward management area\n|-\n| 9\n| Black Isle\n| A Black Isle area, between the Beauly Firth and the Cromarty Firth  Includes the towns of Cromarty and Fortrose\n|align=center| 4\n| The ward itself\n|-\n| 11\n| Caol and Mallaig\n| Includes the Caol area of the town of Fort William, Arisaig, the town of Mallaig, and the Small Isles  A boundary divides the town of Fort William between the Fort William and Ardnamurchan ward and the Caol and Mallaig ward\n|align=center| 3\n| Lochaber, covering the two wards of Fort William and Ardnamurchan, and Caol and Mallaig\n|-\n| 8\n| Dingwall and Seaforth\n| Includes the towns of Dingwall, Conon Bridge, and Muir of Ord\n|align=center| 4\n| The ward itself\n|-\n| 10\n| '''Eilean a' Cheò\n| Islands, including Skye and Raasay\n|align=center| 4\n| The ward itself\n|-\n| 21\n| Fort William and Ardnamurchan\n| Includes part of the town of Fort William (south of Caol), the villages of Ballachulish and Kinlochleven, and the Ardnamurchan peninsula  A boundary divides the town of Fort William between the Fort William and Ardnamurchan ward and the Caol and Mallaig ward  Loch Linnhe divides the Fort William and Ardnamurchan ward into two distinct areas\n|align=center| 4\n| Lochaber, covering the two wards of Fort William and Ardnamurchan, and Caol and Mallaig\n|-\n| 5\n| Wester Ross, Strathpeffer and Lochalsh'''\n| Includes the towns and villages of Gairloch, Lochalsh, Strathpeffer and Ullapool  Ross is a former county\n|align=center| 4\n| The ward itself\n|}\nSee also\n*Politics of the Highland council area\nNotes and references"
    }
  ]
}