{
  "content": [
    {
      "type": "text",
      "text": "# Highland School (Warrenton, Virginia)\n\nBlue and Gold\n| accreditations       = Virginia Association of Independent Schools (VAIS), National Association of Independent Schools (NAIS)\n| athletics_conference = Greater Piedmont Athletic Conference (GPAC), Virginia Independent Schools Athletic Association (VISAA)\n| rivals               = Wakefield School, Seton School\n| founded              =\n| tuition              = Pre-K2–3 (3-day, half-day): $7,600Pre-K2–3 (3-day, full-day): $12,240Pre-K2–3 (5-day, half-day): $10,200Pre-K2–3 (5-day, full-day): $16,300Pre-K4–5 (5-day, 1:00 PM dismissal): $13,500Pre-K4–5 (5-day, full-day): $16,500Kindergarten: $24,500Lower School (Grades 1–4): $28,500Middle School (Grades 5–8): $32,000Upper School (Grades 9–12): $36,6002025–2026\n}}\nHighland School is an independent school located in Warrenton, Virginia. Highland was founded in 1928 by Dorothy Rust and Lavinia Hamilton as the Warrenton Branch of the Calvert School of Baltimore.  It was renamed Highland School in 1957 and moved to its current location. As stated in its mission, \"Highland School prepares students to thrive, lead and serve in a diverse and dynamic world, developing essential skills and character by challenging them with a demanding academic and co-curricular program.\" Its upper (high) school was established in 1996. It serves 509 students from twelve counties.\nHistory\nHighland School was founded in 1928 by educators Dorothy Rust and Lavinia Hamilton as the Warrenton Branch of the Calvert School of Baltimore. The school opened with nine elementary students and two teachers in the John Barton Payne Building in Old Town Warrenton. In 1929, it relocated to the parish house of St. James Episcopal Church on Culpeper Street.\nIn 1957, the school changed its name to Highland School and moved to its current 42-acre campus on Broadview Avenue. Over the decades, it evolved into a coeducational independent day school serving students from Pre-K2 through Grade 12, with an enrollment of over 500 students.\nSignificant milestones in the school's development include:\n* 1995: Facilities were expanded to include new science labs, classrooms, an art center, music room, computer labs, a guidance center, a resource room, and an expanded library.\n* 1996: The Upper School was established, initially including grades 9 and 10, followed by the addition of grades 11 and 12.\n* 2004: Completion of the Highland Center for the Arts and the conclusion of the first strategic plan.\n* 2005: Launch of a new strategic plan including a comprehensive Campus Master Plan.\n* 2008: Construction of a new Upper School humanities wing, installation of artificial turf fields, and creation of Bermuda grass athletic fields adjacent to the Middle School.\n* 2009: Adoption of a new Philosophy Statement and establishment of a Learning Center Endowment with support from the Kenan Trust.\n* 2010: Opening of the William A. Hazel Family Lower School.\n* 2011: The Hazel Lower School received Silver LEED Certification, becoming the first school in Fauquier County to achieve that status.\n* 2012: Major renovations of the Middle School added the Johnson Academic Media Center, a new library, and expanded classrooms and technology labs.\n* 2014: The Hazel Family Library in the Upper School was renovated to create a collaborative and flexible academic space.\n* 2019: The Highland Center for the Arts was renamed the Michael A. Hughes Center for the Arts in honor of the longtime artistic director.\nHighland School continues to emphasize academic excellence, character development, and student engagement, aligning with its mission to prepare students to thrive, lead, and serve in a dynamic world.\nAcademics\nHighland School offers a lower school (Pre-K2/3 through Grade 4), middle school (Grades 5-8) and upper school (Grades 9-12). The current head of school is Dr. Adam Seldis and was appointed so in 2024. It participates within the Greater Piedmont Athletic Conference and the Melville Church Athletic Conference, a group of exclusive private schools in northern and central Virginia, as well as Maryland, and is in the Virginia Independent Schools Athletic Association.\nA Humanities and Instructional Technology wing for the Upper School was completed during the fall 2009. A new turf stadium, softball field, and outdoor courtyard were also completed in 2009. In the fall of 2010, construction was completed on the William A. Hazel Family Lower School, new library, expanded spaces for grades PK-4, and LEED Green certification expanded not only the physical structure of the school but also opportunities for Lower School learning. A Middle School renovation was completed for Fall 2012, with the renovation of the Arundel Gymnasium as well as the addition of the Johnson Academic Media Center.\nAdvanced Placement courses are offered to Upper School students, beginning in their sophomore year. The AP classes offered include Music Theory, 3 different History AP's, 4 science AP's, 3 AP English Classes, 3 AP Math classes and various others.\nThe maximum class size allowed is 18 students and a number of classes offered have less than ten students.\nSports\nHighland School offers a comprehensive athletics program across all school divisions. In the Upper School, students participate in 20 varsity sports spanning the fall, winter, and spring seasons. The school also fields junior varsity and middle school teams to encourage broad student involvement. Athletic offerings include boys' and girls' soccer, cross country, golf, lacrosse, softball, tennis, swimming, baseball, basketball, field hockey, volleyball, and cheerleading. The athletics program emphasizes character development and leadership, guided by the school's Five C's: critical thinking, creativity, communication, collaboration, and character. All coaches are members of the Positive Coaching Alliance, promoting a positive, character-building youth sports experience.\nHighland School is a founding member of the Greater Piedmont Athletic Conference (GPAC) and competes in the Virginia Independent Schools Athletic Association (VISAA). The school has also been associated with the Delaney Athletic Conference (DAC) and the Cavalier Athletic Conference (CAC). Since 2000, Highland teams have secured 25 state titles across ten different sports.\nState champion teams\n* 2002: Boys' Soccer\n* 2006: Girls' Soccer\n* 2007: Girls' Soccer\n* 2007: Softball\n* 2008: Softball\n* 2008: Boys' Soccer\n* 2009: Boys' Lacrosse\n* 2009: Golf\n* 2010: Boys' Soccer\n* 2013: Boys' Lacrosse\n* 2014: Boys' Tennis\n* 2015: Boys' Soccer\n* 2016: Girls' Lacrosse\n* 2016: Girls' Soccer\n* 2016: Boys' Soccer\n* 2017: Girls' Lacrosse\n* 2018: Girls' Soccer\n* 2018: Girls' Lacrosse\n* 2019: Girls' Basketball\n* 2021: Girls' Soccer\n* 2022: Girls' Soccer\n* 2022: Baseball\n* 2025: Baseball\n* 2025: Girls' Soccer\nReferences\nExternal links\n* [http://www.highlandschool.org Official website]"
    }
  ]
}