{
  "content": [
    {
      "type": "text",
      "text": "# Hilton Edwards\n\nHilton Edwards (2 February 1903 – 18 November 1982) was an English-born Irish actor, lighting designer, and theatrical producer. He co-founded the Gate Theatre in Dublin with his partner Micheál Mac Liammóir and two others, and has been referred to as the founder of Irish theatre. He was one of the most recognisable figures in the arts in 20th-century Ireland.\nEarly life\nEdwards was born in London, the son of Thomas George Cecil Edwards and Emily Edwards ( Murphy).\nCareer\nEdwards began his career acting with the Charles Doran Shakespeare Company in 1920 in Windsor and then joined the Old Vic in London, playing in all but two of Shakespeare's plays before leaving the company a few years later. Trained in music, he also sang baritone roles with the Old Vic Opera Company.\nAs an actor he played leading parts, including the title roles in Peer Gynt, Cyrano de Bergerac and Macbeth and Sheridan Whiteside in The Man Who Came To Dinner. On Broadway in 1966, he directed Brian Friel's Philadelphia, Here I Come! and The Loves of Cass McGuire.\nAfter touring with various companies in Britain and South Africa, he went to Ireland in 1927 for a season with Anew McMaster's company and met Mr. McMaster's brother-in-law, Micheál Mac Liammóir. As he told an interviewer once, both men wanted a theatre of their own; MacLiammóir wanted it to be in Ireland and Edwards did not care. ''I don't care about nationalism, I care about the theatre,'' he said.\nThe Gate Theatre\nAlong with his romantic partner, Micheál Mac Liammóir, Edwards co-founded the Gate Theatre in Dublin. He directed more than 300 plays at the Gate ranging from the works of Aeschylus and Sophocles, Goethe and Ibsen to the comedies of Shaw and Sheridan and new Irish plays, by such authors as W. B. Yeats, Brian Friel, and Mac Liammóir.\nDuring their first season, they presented seven plays, including Ibsen's Peer Gynt, O’Neill's The Hairy Ape, and Wilde's Salomé. Their productions were innovative and experimental and they offered Dublin audiences an introduction to the world of European and American theatre as well as classics from the modern and Irish repertoire.\nThe company played for two seasons at the Peacock Theatre and then on Christmas Eve 1929, in Groome’s Hotel, the lease was signed for the 18th Century Rotunda Annex –– the 'Upper Concert Hall', the Gate's present home, with Goethe's Faust opening on 17 February 1930.\nIn 1931, the newly established Gate Theatre ran into financial difficulties and Lord Longford and his wife Christine provided financial support. The Longfords worked with Edwards and MacLiammóir at the Gate until 1936, then a split developed and two separate companies were formed and played at the Gate for six months each. The companies also toured for six months until the death of Lord Longford in 1961.\nDuring this period, Edwards and MacLiammóir (Gate Theatre Productions) ran shows in Dublin's Gaiety Theatre and toured productions to Europe, Egypt and North America.\nRTÉ\nIn 1961, he took a two-year break from theatre to become the first Head of Drama at Telefís Éireann, Ireland's national broadcaster and, a year later, he won a Jacob's Award for his television series, Self Portrait.\nFilm\nEdwards appeared in 15 films, including Othello (1952), Captain Lightfoot (1955), David and Goliath (1960), Victim (1961) and Half a Sixpence (1967). He also wrote and directed Orson Welles's Return to Glennascaul (1951). However, he was primarily known for his theatre work; he was nominated for a Tony Award in 1966 for Best Director of a Drama for Philadelphia, Here I Come!\nDeath\nHilton Edwards died in Dublin, Ireland, aged 79. Edwards and Mac Liammóir are buried alongside each other at St. Fintan's Cemetery, Sutton, Dublin\nCoverage and recognition\nJames Joyce mentioned Edwards in his 1939 novel, Finnegans Wake.\nEdwards and Mac Liammóir were the subject of a biography, titled The Boys by Christopher Fitz-Simon. He also features extensively in Mac Liammóir's books.\nFrank McGuinness's play Gates of Gold is a nod to Edwards and Mac Liammóir.\nIn 1973, Edwards and Mac Liammóir were granted the Freedom of the City of Dublin.\nRelationship with Mac Liammóir and legacy\nThe academic Éibhear Walshe of University College Cork notes that MacLiammóir and Edwards did not ever identify themselves as gay as \"Irish cultural discourse simply didn’t accommodate any public sexual identity outside the heterosexual consensus\", noting that Irish society at the time only recorded lesbian and gay communities and cultures \"in police records, prosecutions of men for same-sex activities or medical records of institutional committals of men and women for the mental illness of inversion\".\nThey were, however, prominent features on the Dublin social scene and as Walshe notes elsewhere \"MacLiammóir and his partner Edwards survived, and even flourished, as Ireland's only visible gay couple\". The couple lived together at 4 Harcourt Terrace.  Walshe goes on to say that \"when MacLiammóir died in 1978, the president of Ireland attended his funeral, as did the taoiseach and several government ministers, while Hilton Edwards was openly deferred to and sympathised [with] as chief mourner\".\nThe International Dublin Gay Theatre Festival presents an award for \"Best Aspect of Production\" in his name.\nPartial filmography\n* Call of the Blood (1949) – Dr. Robert Blake\n* Othello (1951) – Brabantio\n* Captain Lightfoot (1955) – Lord Glen\n* Cat & Mouse (1958) – Mr. Scruby\n* ''She Didn't Say No! (1958) – Film Director\n* This Other Eden (1959) – Canon Moyle\n* David and Goliath (1960) – Prophet Samuel\n* A Terrible Beauty (1960) – Father McCrory\n* Victim (1961) – P.H.\n* The Quare Fellow (1962) – Holy Healy\n* The Wrong Box (1966) – Lawyer\n* Half a Sixpence'' (1967) – Shalford (final film role)\nReferences\nExternal links\n*"
    }
  ]
}