{
  "content": [
    {
      "type": "text",
      "text": "# Hind Swaraj or Indian Home Rule\n\nof the book]]\nHind Swaraj or Indian Home Rule is a book written by Mahatma Gandhi in 1909. In it he expresses his views on Swaraj, modern civilization, mechanisation, among other matters. In the book, Gandhi repudiates European civilization while expressing loyalty to higher ideals of empire (\"moral empire\"). The book was banned in 1910 by the British government in India as a seditious text.\nBackground\nMahatma Gandhi wrote this book in his native language, Gujarati, while traveling from London to South Africa on board . It has also been translated to French.\nKey arguments\nGandhi's Hind Swaraj takes the form of a dialogue between two characters, The Reader and The Editor. The Reader (specifically identified by the historian S. R. Mehrotra as Dr Pranjivan Mehta) essentially serves as the typical Indian countryman whom Gandhi would have been addressing with Hind Swaraj. The Reader voices the common beliefs and arguments of the time concerning Indian Independence. Gandhi, The Editor, explains why those arguments are flawed and interject his own arguments. As 'The Editor' Gandhi puts it, \"it is my duty patiently to try to remove your prejudice.\"\nIn the dialogue that follows, Gandhi outlines four themes that structure his arguments.\n# First, Gandhi argues that ‘Home Rule is Self Rule’. He argues that it is not enough for the British to leave only for Indians to adopt a British-styled society. As he puts it, some \"want English rule without the Englishman ... that is to say, [they] would make India English. And when it becomes English, it will be called not Hindustan but Englishtan. This is not the Swaraj I want.\"\n# Gandhi also argues that Indian independence is only possible through passive resistance. In fact, more than denouncing violence, Gandhi argues that it is counter-productive; instead, he believes, \"The force of love and pity is infinitely greater than the force of arms. There is the harm in the exercise of brute force, never in that of pity.\"  This is essential throughout Hind Swaraj.\n# To exert passive resistance, Gandhi reasons that Swadeshi (self-reliance) be exercised by Indians, meaning the refusal of all trade and dealings with the British. He addresses the English when he states, \"If you do not concede our demand, we shall be no longer your petitioners. You can govern us only so long as we remain the governed; we shall no longer have any dealings with you.\" Gandhi makes an intriguing argument here: if the British want India for trade, remove trade from the equation.\n# Finally, Gandhi argues that India will never be free unless it rejects Western civilization itself. In the text he is deeply critical of western civilization, claiming, \"India is being ground down, not under the English heel, but under that of modern civilization.\" He speaks about civilization not just in relation to India, though. He argues that \"Western civilization is such that one has only to be patient and it will be self-destroyed.\" It is a profound repudiation. Not only is Western civilization unhealthy for India, but Western civilization is by its own virtue unhealthy.\nCensorship\nThe Gujarati version of Hind Swaraj was banned by the British authorities, on its publication in India.\nReception\nIn September 1938, the philosophical magazine The Aryan Path published a symposium on Hind Swaraj. The contributors were several noted writers: Frederick Soddy, Claude Houghton, G. D. H. Cole, C. Delisle Burns, John Middleton Murry, J. D. Beresford, Hugh Fausset, Gerald Heard and Irene Rathbone. Their responses to Hind Swaraj'' varied from \"enthusiasm to respectful criticism\".\nMore recently, in 2025, a sharper criticism of 'Hind Swaraj' was published by the author Rajesh Talwar, in a book titled ''The Mahatma's Manifesto: A Critique of Hind Swaraj''. According to India Today magazine, Talwar's book unpacks untold truths about Gandhi's legacy. It \"challenges Gandhi's principles, sparking debate among readers.\"\nSee also\n*Gandhi Heritage Portal\nReferences\nExternal links\n*[https://www.mkgandhi.org/hindswaraj/hindswaraj.htm Indian Home Rule or Hind Swaraj by Mohandas K. Gandhi]\n*"
    }
  ]
}