{
  "content": [
    {
      "type": "text",
      "text": "# Hippo Hardware and Trading Company\n\n| founder =\n| defunct =\n| fate =\n| successor =\n| hq_location =\n| hq_location_city =\n| hq_location_country =\n| num_locations =\n| num_locations_year =\n| area_served =\n| key_people =\n| products =\n| production =\n| production_year =\n| brands =\n| services =\n| revenue =\n| revenue_year =\n| operating_income =\n| income_year =\n| net_income =\n| net_income_year =\n| aum =\n| assets =\n| assets_year =\n| equity =\n| equity_year =\n| owners =\n| members =\n| members_year =\n| num_employees =\n| num_employees_year =\n| parent =\n| divisions =\n| subsid =\n| module =\n| website =\n| footnotes =\n}}\nHippo Hardware and Trading Company, or simply Hippo Hardware, is a hardware store in Portland, Oregon. Established by Steven Miller and Stephen Oppenheim in southeast Portland in 1976, the business has operated from its current location on East Burnside Street in the Buckman neighborhood since 1990. Hippo Hardware sells new and salvaged hardware, lighting, plumbing and other materials, as has a hippopotamus theme throughout. The store has supplied locally filmed television series and has been described as an institution and a landmark.\nDescription\nHippo Hardware is a three-floor hardware store at the intersection of 11th Avenue and East Burnside Street, in the southeast Portland part of the Buckman neighborhood. Housed in the Cromwell Tailors building (1921), the store has approximately 30,000 square feet of new and salvaged hardware, lighting, plumbing, and architectural materials dating from the 1850s to the 1960s. The business has a hippopotamus theme, with dolls, statues, and toys displayed throughout, as well as exterior columns painted with hippos wearing togas.\nPortland Monthly says, \"Clawfoot tubs, high-tank toilets, Victorian doorknobs, Mission ceiling fans, stained- and leaded-glass windows—it's a home rebuilder's paradise. Hippo even has a UL-certified lighting shop to wire any purchases you make or to repair a light you already own.\" Willamette Week has said, \"The real treasures live upstairs on the floor dedicated completely to lighting, where you can find bins of sconces, a thousand pendants, and wacky table lamps, all tuned up by the in-house maintenance service.\"\nHistory\nHippo Hardware was established by co-owners Steven Miller and Stephen Oppenheim in 1976. The business relocated from Southeast 12th and Ash to its current location in 1990. Hippo Hardware supplied the productions of the television series Grimm and Leverage. According to Kathy Eaton of The Hollywood Star News, This Old House Magazine named Hippo Hardware one of five \"iconic\" hardware stores in the U.S. in 2014, and several Japanese magazines have advertised the business as a tourist destination.\nReception\nIn 2005, Hippo Hardware placed third in the Best Lighting category in Willamette Week's annual reader's poll. The store was a runner-up in the same category in 2007. Hippo Hardware was a runner-up in the Best Hardware Store category in 2016, and won in the same category in 2020 and 2025. The business has been called a \"fancy junk store\", an institution, a local landmark, an \"icon for decades\", and a favorite of author Chuck Palahniuk. A mural of the Buckman neighborhood by artist Joe Cotter, painted on the side of a Plaid Pantry store at Southeast 12th Avenue and Morrison Street, depicts a hippo from the store along with other nearby landmarks.\nReferences\nExternal links\n*\n* [https://www.roadsideamerica.com/tip/22668 Hippo Hardware] at Roadside America"
    }
  ]
}