{
  "content": [
    {
      "type": "text",
      "text": "# His Majesty King Edward the Eighth's Abdication Act, 1937\n\n'''His Majesty King Edward the Eighth's Abdication Act, 1937''' (Act No. 2 of 1937) was an act of the Parliament of South Africa that ratified the abdication of King Edward VIII and the succession to the throne of King George VI. Although the South African cabinet had assented to the passage of His Majesty's Declaration of Abdication Act 1936 by the Parliament of the United Kingdom at the time of the abdication in December 1936, the South African act was passed in February 1937 to resolve legal uncertainties.\nThe Statute of Westminster 1931 gave the dominions, including the Union of South Africa, full legislative independence from the United Kingdom, and provided that no act of the British Parliament would apply in a dominion unless the dominion requested and consented that it do so. The preamble of the statute also stated that any changes to the succession to the throne would require the assent of the parliaments of all of the dominions. After Edward signed the Instrument of Abdication on 10 December 1936, the British government communicated with the Dominion governments, who agreed to the passage of the Abdication Act by the British Parliament. Only the Canadian government formally \"requested and consented\", however, while the Australian, New Zealand and South African governments merely \"assented\" to the legislation.\nThe legal position in South Africa was further complicated by the provisions of the Status of the Union Act, 1934. Section two of that act provided that no act of the British parliament would apply in South Africa without an act of the South African parliament making it applicable; this was a stricter requirement than the \"request and consent\" requirement of the Statute of Westminster. On the other hand, section five of the Status of the Union Act defined the succession to the throne by reference to the law of succession applicable in the United Kingdom.\nTo resolve this confusion, the South African parliament enacted in February 1937 its own Abdication Act. It contained the same provisions as the British act, declaring the accession of George VI to the throne, excluding Edward VIII and his descendants from any right to the throne, and excluding them from the provisions of the Royal Marriages Act. However, the South African act declared the abdication and accession to have occurred on 10 December when Edward signed the Instrument of Abdication, rather than 11 December when the Abdication Act had come into force in the UK. It also declared that actions taken in the name of Edward VIII after the abdication but before the passage of the South African act were deemed to be valid.\nThe act was repealed by the South African Constitution of 1961 when South Africa became a republic.\nReferences\nExternal links\n*"
    }
  ]
}