{
  "content": [
    {
      "type": "text",
      "text": "# Historical reliability of the Gospels\n\nThe historical reliability of the Gospels is a matter of ongoing scholarly debate.\nVirtually all scholars of antiquity agree that Jesus of Nazareth existed in 1st-century Judaea in the Southern Levant but scholars differ on the historicity of specific episodes described in the biblical accounts of him. The only two events subject to \"almost universal assent\" are that Jesus was baptized by John the Baptist and that he was crucified by order of the Roman Prefect Pontius Pilate. There is no scholarly consensus about other elements of Jesus's life, including the two accounts of the Nativity of Jesus, the miraculous events such as the resurrection, and certain details of the crucifixion.\nAccording to the majority viewpoint, the gospels of Matthew, Mark, and Luke, collectively called the Synoptic Gospels, are the primary sources of historical information about Jesus and the religious movement he founded. The fourth gospel, John, differs greatly from the other three. The Gospels are commonly seen as literature that is based on oral traditions, Christian preaching, and Old Testament exegesis with the consensus being that they are a variation of Greco-Roman biography; similar to other ancient works such as Xenophon's Memoirs of Socrates or Plutarch's Life of Alexander and Life of Caesar. Typically, ancient biographies were written shortly after the death of the subject and included substantial history.\nHistorians analyze the Gospels critically, attempting to differentiate reliable information from possible inventions, exaggerations, and alterations. Scholars use textual criticism to resolve questions arising from textual variations among the numerous extant manuscripts to decide the wording of a text closest to the \"original\". Scholars seek to answer questions of authorship and date and purpose of composition, and they look at internal and external sources to determine the gospel traditions' reliability. Historical reliability does not depend on a source's inerrancy or lack of agenda since some sources (e.g. Josephus) are considered generally reliable despite having such traits.\nMethodology\nIn evaluating the Gospels' historical reliability, scholars consider authorship and date of composition, intention and genre, gospel sources and oral tradition, textual criticism, and the historical authenticity of sayings and narrative events.\nScope and genre\n\"Gospels\" is the standard term for the four New Testament books carrying the names of Matthew, Mark, Luke and John, each recounting the life and teachings of Jesus of Nazareth (including his dealings with John the Baptist, his trial and execution, the discovery of his empty tomb, and, at least in three of them, his appearances to his disciples after his death).\nThe genre of the gospels is essential in understanding the authors' intentions regarding the texts' historical value. New Testament scholar Graham Stanton writes, \"the gospels are now widely considered to be a sub-set of the broad ancient literary genre of biographies.\" Charles H. Talbert agrees that the gospels should be grouped with the Graeco-Roman biographies, but adds that such biographies included an element of mythology, and that the synoptic gospels do too. E. P. Sanders writes, \"these Gospels were written with the intention of glorifying Jesus and are not strictly biographical in nature.\" M. David Litwa argues that the gospels belonged to the genre of \"mythic historiography\", where miracles and other fantastical elements were narrated in less sensationalist ways and the events were considered to have actually occurred by the readers of the time. Craig S. Keener argues that the gospels are ancient biographies whose authors, like other ancient biographers at the time, were concerned with describing accurately the life and ministry of Jesus. The same genre as Plutarch's Life of Alexander and Life of Caesar, which were typically ancient biographies were written shortly after the death of the subject and included substantial history. Ingrid Maisch and Anton Vögtle, writing for Karl Rahner in his encyclopedia of theological terms, say that the gospels were written primarily as theological, not historical, texts. Erasmo Leiva-Merikakis writes, \"we must conclude, then, that the genre of the Gospel is not that of pure 'history'; but neither is it that of myth, fairy tale, or legend. In fact, 'gospel' constitutes a genre all its own, a surprising novelty in the literature of the ancient world.\"\nScholars tend to consider Luke's works (Luke-Acts) closer in genre to pure history, but they also note that \"This is not to say that he [Luke] was always reliably informed, or that – any more than modern historians – he always presented a severely factual account of events.\" Regardless, EP Sanders claimed that the sources for Jesus are superior to the ones for Alexander the Great.\nJeffrey Tripp observes a scholarly trend advocating for the reliability of memory and the oral gospel traditions.\nNew Testament scholar James D.G. Dunn believed that \"the earliest tradents within the Christian churches [were] preservers more than innovators...seeking to transmit, retell, explain, interpret, elaborate, but not create de novo...Through the main body of the Synoptic tradition, I believe, we have in most cases direct access to the teaching and ministry of Jesus as it was remembered from the beginning of the transmission process (which often predates Easter) and so fairly direct access to the ministry and teaching of Jesus through the eyes and ears of those who went about with him.\" Anthony Le Donne, a leading memory researcher in Jesus studies, elaborated on Dunn's thesis, basing \"his historiography squarely on Dunn's thesis that the historical Jesus is the memory of Jesus recalled by the earliest disciples\". According to Le Donne as explained by his reviewer, Benjamin Simpson, memories are fractured, and not exact recalls of the past. Le Donne further argues that the remembrance of events is facilitated by relating it to a common story, or \"type\". This means the Jesus-tradition is not a theological invention of the early Church, but rather a tradition shaped and refracted through such memory \"type\". Le Donne too supports a conservative view on typology compared to some other scholars, transmissions involving eyewitnesses, and ultimately a stable tradition resulting in little invention in the Gospels. Le Donne expressed himself thusly vis-a-vis more skeptical scholars, \"He (Dale Allison) does not read the gospels as fiction, but even if these early stories derive from memory, memory can be frail and often misleading. While I do not share Allison's point of departure (i.e. I am more optimistic), I am compelled by the method that came from it.\"\nDale Allison emphasizes the weakness of human memory, referring to its 'many sins' and how it frequently misguides people. He expresses skepticism at other scholars' endeavors to identify authentic sayings of Jesus. Instead of isolating and authenticating individual pericopae, Allison advocates for a methodology focused on identifying patterns and finding what he calls 'recurrent attestation'. Allison argues that the general impressions left by the Gospels should be trusted, though he is more skeptical on the details; if they are broadly unreliable, then our sources almost certainly cannot have preserved any of the particulars. Opposing preceding approaches where the Gospels are historically questionable and must be rigorously sifted through by competent scholars for nuggets of information, Allison argues that the Gospels are generally accurate and often 'got Jesus right'. Dale Allison finds apocalypticism to be recurrently attested, among various other themes. Reviewing his work, Rafael Rodriguez largely agrees with Allison's methodology and conclusions while arguing that Allison's discussion on memory is too one-sided, noting that memory \"is nevertheless sufficiently stable to authentically bring the past to bear on the present\" and that people are beholden to memory's successes in everyday life.\nAccording to Bruce Chilton and Craig Evans, \"...the Judaism of the period treated such traditions very carefully, and the New Testament writers in numerous passages applied to apostolic traditions the same technical terminology found elsewhere in Judaism [...] In this way they both identified their traditions as 'holy word' and showed their concern for a careful and ordered transmission of it.\" David Jenkins, a former Anglican Bishop of Durham and university professor, has said, \"Certainly not! There is absolutely no certainty in the New Testament about anything of importance.\"\nChris Keith has called for the employment of social memory theory regarding the memories transmitted by the Gospels over the traditional form-critical approach emphasizing a distinction between 'authentic' and 'inauthentic' tradition. Keith observes that the memories presented by the Gospels can contradict and are not always historically correct. Chris Keith argues that the Historical Jesus was the one who could create these memories, both true or not. For instance, Mark and Luke disagree on how Jesus came back to the synagogue, with the likely more accurate Mark arguing he was rejected for being an artisan, while Luke portrays Jesus as literate and his refusal to heal in Nazareth as cause of his dismissal. Keith does not view Luke's account as a fabrication since different eyewitnesses would have perceived and remembered differently.\nWhile believing that the study of the process of conversion from memories of Jesus into the Gospel tradition are too complicated for more simplistic a priori arguments the Gospels are reliable, Alan Kirk criticizes allegations of memory distortion common in Biblical studies. Kirk finds that much research in psychology involves experimentation in labs decontextualized from the real world, making use of their results dubious, hence the rise of what he calls 'ecological' approaches to memory. Kirk claims that social contagion is one phenomenon that is greatly lessened or even ruled out by new study. Kirk claims that there is also an imprudent reliance on a binary distinction between exact information and later interpretation in research. Kirk argues that the demise of form criticism means that the Gospels can no longer be automatically considered unreliable and that skeptics must now find new options, such as the aforementioned efforts at using evidence of memory distortion.}}\nAlongside his work defining the Gospels as ancient biography, Craig Keener, drawing on the works of previous studies by Dunn, Kirk, Kenneth Bailey, and Robert McIver, among many others, utilizes memory theory and oral tradition to argue that the Gospels are in many ways historically accurate. His work has been endorsed by Richard Bauckham, Markus Bockmuehl, and David Aune, among others.\nCriteria\nCritical scholars have developed a number of criteria to evaluate the probability or historical authenticity of an attested event or saying in the gospels. These criteria are the criterion of dissimilarity; the criterion of embarrassment; the criterion of multiple attestation; the criterion of cultural and historical congruency; and the criterion of \"Aramaisms\". They are applied to the sayings and events described in the Gospels to evaluate their historical reliability.\nThe criterion of dissimilarity argues that if a saying or action is dissimilar or contrary to the views of Judaism in the context of Jesus or the views of the early church, then it can more confidently be regarded as an authentic saying or action of Jesus. Commonly cited examples of this are Jesus's controversial reinterpretation of Mosaic law in his Sermon on the Mount and Peter's decision to allow uncircumcised gentiles into what was at the time a sect of Judaism.\nThe criterion of embarrassment holds that the authors of the gospels had no reason to invent embarrassing incidents such as Peter's denial of Jesus or the fleeing of Jesus's followers after his arrest, and therefore such details would likely not have been included unless they were true. Bart Ehrman, using the criterion of dissimilarity to judge the historical reliability of the claim that Jesus was baptized by John the Baptist, writes, \"it is hard to imagine a Christian inventing the story of Jesus' baptism since this could be taken to mean that he was John's subordinate.\"\nThe criterion of multiple attestation says that when two or more independent sources present similar or consistent accounts, it is more likely that the accounts are accurate reports of events or that they are reporting a tradition that predates the sources.\nThe criterion of cultural and historical congruency says that a source is less credible if the account contradicts known historical facts, or if it conflicts with cultural practices common in the period in question.\nThe criterion of \"Aramaisms\" is that if a saying of Jesus has Aramaic roots, reflecting his Palestinian cultural context, it is more likely to be authentic than a saying that lacks Aramaic roots.\nFormation and sources\n, 1661]]\nFrom oral traditions to written gospels\nMost scholars believe that the historical Jesus was an apocalyptic prophet who predicted the imminent end or transformation of the world, though others, notably the Jesus Seminar, disagree. Many scholars argue that a conditional understanding of eschatology is present in the gospels, with the date of the parousia being dependent on repentance rather than being fixed. As eyewitnesses began to die, and as the missionary needs of the church grew, there was an increasing demand and need for written versions of the founder's life and teachings. Burkett summarizes the rise of the gospels as initially oral traditions passed in separate and unordered units, written collections of stories and sayings, written proto-gospels, and the canonical gospels composed using such sources. According to Chris Keith, there is no incontrovertible evidence the gospel traditions circulated as written narratives, testimonia, or notes prior to Mark.\nThe New Testament preserves signs of these oral traditions and early documents: for example, parallel passages between Matthew, Mark and Luke on one hand and the Pauline epistles and the Epistle to the Hebrews on the other are typically explained by assuming that all were relying on a shared oral tradition, and the dedicatory preface of Luke refers to previous written accounts of the life of Jesus. The early traditions were fluid and subject to alteration, sometimes transmitted by those who had known Jesus personally, but more often by wandering prophets and teachers like the Apostle Paul, who did not know him personally. Jens Schroter argued that a mass of material from various sources, such as Christian prophets issuing sayings in the name of Jesus, the Hebrew Bible, miscellaneous sayings, alongside the actual words of Jesus, were all attributed by the Gospels to the singular historical Jesus. Helen Bond also argues that many chreia found in the gospels are literary creations composed by the evangelists rather than reservoirs of oral tradition; while many are rooted in actual history, they have been reshaped to emphasize various aspects of Jesus. James DG Dunn and Tucker Ferda point out that the early Christian tradition sought to distinguish between their own sayings and those of the historical Jesus and that there is little evidence that the claims of new \"prophets\" often became mistaken as those of Jesus himself; Ferda notes that the phenomena of prophetic sayings merging with those of Jesus is more relevant to the dialogue gospels of the 2nd and 3nd centuries. The accuracy of the oral gospel tradition was ensured by the community designating certain learned individuals to bear the main responsibility for retaining the gospel message of Jesus. The prominence of teachers in the earliest communities such as the Jerusalem Church is best explained by the communities' reliance on them as repositories of oral tradition. The early prophets and leaders of local Christian communities and their followers were more focused on the Kingdom of God than on the life of Jesus: Paul for example, says very little about him such as he was \"born of a woman\" (meaning that he was a man and not a phantom), that he was a Jew, and that he suffered, died, and was resurrected: what mattered for Paul was not Jesus's teachings or the details of his death and resurrection, but the kingdom. Nonetheless, Paul was personally acquainted with Peter and John, two of Jesus' original disciples, and James, the brother of Jesus. Paul's first meeting with Peter and James was approximately 36 AD, close to the time of the crucifixion (30 or 33 AD.) Paul was a contemporary of Jesus and, according to some, from Paul's writings alone, a fairly full outline of the life of Jesus can found: his descent from Abraham and David, his upbringing in the Jewish Law, gathering together disciples, including Cephas (Peter) and John, having a brother named James, living an exemplary life, the Last Supper and betrayal, numerous details surrounding his death and resurrection (e.g. crucifixion, Jewish involvement in putting him to death, burial, resurrection, seen by Peter, James, the twelve and others) along with numerous quotations referring to notable teachings and events found in the Gospels.\nBetween 120 and 150, Justin Martyr, who lived in 2nd-century Flavia Neapolis (Biblical Shechem, modern day Nablus) mentioned the \"memoirs of the Apostles\" in his First Apology. Later, around 173, Tatian, who was a student of Justin Martyr, assembled a single gospel account, working from the four canonical gospels. Around 185 Irenaeus, a bishop of Lyon who lived  – , attributed them to: 1) Matthew, an apostle who followed Jesus in his earthly career; 2) Mark, who while himself not a disciple was the companion of Peter, who was; 3) Luke, the companion of Paul, the author of the Pauline epistles; and 4) John, who like Matthew was an apostle who had known Jesus. According to Bart Ehrman, most scholars agree that they are the work of unknown Christians, though according to Dale Allison the traditional attributions of Mark and Luke still have \"learned defenders\", with Raymond Brown judging critical opinion on Luke's authorship to be roughly evenly divided near the end of the 20th century. The gospels were composed  65–110 AD. The majority of New Testament scholars also agree that the Gospels do not contain direct eyewitness accounts, though this may partly be the result of dubious assumptions based on form criticism. Instead, the Gospels are commonly seen as literature that is based on oral traditions, Christian preaching, and Old Testament exegesis with the consensus being that they are a variation of Greco-Roman biography; similar to other ancient works such as Xenophon's Memoirs of Socrates. The validity of the communities model of gospel origins has been subject to increasing skepticism, and there is no current consensus on constructs such as the Johannine Community. Nevertheless, they preserve sources that go back to Jesus and his contemporaries, and the Synoptic writers thought that they were reconfiguring memories of Jesus rather than creating theological stories, \"draw[ing] on direct memories of the first generation of Jesus' disciples\".\nThe synoptics: Matthew, Mark and Luke\nMatthew, Mark and Luke are called the synoptic gospels because they share many stories (the technical term is pericopes), sometimes even identical wording; finding an explanation for their similarities, and also their differences, is known as the synoptic problem, and most scholars believe that the best solution to the problem is that Mark was the first gospel to be written and served as the source for the other two, though alternative theories are growing in popularity among scholars. Since the third quest for the historical Jesus, the four gospels and noncanonical texts have been viewed with more confidence as sources to reconstruct the life of Jesus compared to the previous quests.\nMatthew and Luke also share a large amount of material which is not found in Mark; this appears in the same order in each, although not always in the same contexts, leading scholars to the conclusion that in addition to Mark they also shared a lost source called the Q document (from \"Quelle\", the German word for 'source'); its existence and use alongside Mark by the authors of Matthew and Luke seems the most convincing solution to the synoptic problem.\nMatthew and Luke contain some material unique to each, called the M source (or Special Matthew) for Matthew and the L source (Special Luke) for Luke. This includes some of the best-known stories in the gospels, such as the birth of Christ and the Parable of the Good Samaritan (unique to Luke) and the Parable of the Pearl of Great Price (unique to Matthew).\nThe Hebrew scriptures were also an important source for all three, and for John. Direct quotations number 27 in Mark, 54 in Matthew, 24 in Luke, and 14 in John, and the influence of the scriptures is vastly increased when allusions and echoes are included. Half of Mark's gospel, for example, is made up of allusions to and citations of the scriptures, which he uses to structure his narrative and to present his understanding of the ministry, passion, death and resurrection of Jesus (for example, the final cry from the cross, \"My God, my God, why have you forsaken me?\" is an exact quotation from Psalm 22:1). Matthew contains all Mark's quotations and introduces around 30 more, sometimes in the mouth of Jesus, sometimes as his own commentary on the narrative, and Luke makes allusions to all but three of the Old Testament books.\nMark\nTradition holds that the gospel was written by Mark the Evangelist, St. Peter's interpreter. Gerd Theissen writes that Mark's  reliance on several underlying sources, varying in form and in theology, makes this unlikely, while Nicholas Elder argues that Mark is an oral composition where a speaker's words are recorded, which coheres with the patristic tradition.  Most scholars believe it was written shortly before or after the fall of Jerusalem and the destruction of the Second Temple in the year 70, and internal evidence suggests that it probably originated in Syria among a Christian community consisting at least partly of non-Jews who spoke Greek rather than Aramaic and did not understand Jewish culture.\nScholars since the 19th century have regarded Mark as the first of the gospels (called the theory of Marcan priority). Marcan priority led to the belief that Mark must be the most reliable of the gospels, but today there is a large consensus that the author of Mark was not intending to write history. Mark preserves memories of real people (including the disciples), places and circumstances, but it is based on previously existing traditions which have been selected and arranged by the author to express his understanding of the significance of Jesus.\nIn 1901 William Wrede demonstrated that Mark was not a simple historical account of the life of Jesus but a work of theology compiled by an author who was a creative artist. Among the works that the author of Mark may have drawn from are the Elijah-Elisha narrative in the Book of Kings, the Pauline letters, notably 1 Corinthians, as well as the works of Homer. According to Adam Winn, Mark is a counter-narrative to the myth of Imperial rule crafted by Vespasian.\nAdvancing a minority view among scholars, Maurice Casey argued that Mark's gospel contains traces of literal translations of Aramaic sources, and that this implies, in some cases, a  in the lifetime of Jesus and a very early date for the gospel.\nMatthew and Luke\nThe consensus of scholars dates Matthew and Luke to 80–90 AD. The scholarly consensus is that Matthew originated in a \"Matthean community\" in the city of Antioch, located in modern-day Turkey; Luke was written in a large city west of Judaea, for an educated Greek-speaking audience.\nScholars doubt that the authors were the apostles Matthew and Luke: it seems unlikely, for example, that Matthew would rely so heavily on Mark if its author had been an eyewitness to Jesus's ministry, or that the Acts of Apostles (by the same author as the gospel of Luke) would so frequently contradict the Pauline letters if its author had been Paul's companion, though most scholars still believe the author of Luke-Acts met Paul. Both used the gospel of Mark (606 of Matthew's verses are taken from Mark, 320 of Luke's).\nQ, M, and L (Two-Source Hypothesis)\nMark has 661 verses, 637 of which are reproduced in Matthew and/or Luke. Matthew and Luke share a further 200 verses (roughly) which are not taken from Mark: the Two-source hypothesis considers this the Q source, though alternative hypotheses without Q are also growing.  Q is usually dated about a decade earlier than Mark; while there is debate about its exact content, but there is general agreement about the passages that belong to it. It has no passion story and no resurrection, but Strecker suggests that its nucleus reaches back to the earliest Palestinian community and even the lifetime of Jesus. Burkett argues that Q originated in Galilee as a set of speeches relating to occasions such as covenant-renewal, commissions, prayers, and calling judgement on their enemies. In 1998, Powell wrote that most consider it to be among the oldest and most reliable material in the gospels. Joseph writes that during the “Golden Age of Q Studies”, it was almost assumed that Q’s layers, origins in Galilee, and a critical reconstruction could be ascertained, and that it provided a relatively reliable portrait of the historical Jesus. Much of this ended with Goodacre’s Case Against Q, and many scholars today have come to doubt rather than defend Q.\nThe relevance of sources and criticism in gospel studies has lost much of its relevance in recent years, and many details about M and L, such as their origins and relationship with Q are disputed.\nJohn\nThe Gospel of John is a relatively late theological document containing little accurate historical information that is not found in the three synoptic gospels, which is why most historical studies have been based on the earliest sources Mark and Q. Nonetheless, since the third quest, John's gospel is seen as having more reliability than previously thought or sometimes even more reliable than the synoptics. It speaks of an unnamed \"disciple whom Jesus loved\" as the source of its traditions, but according to Burkett does not say specifically that he is its author except in John 21, which is widely regarded as a later addition by the author of chapters 1-20 or by another redactor, though a growing minority view it as part of the earliest text. According to Méndez, the gospel gradually identifies its narrator as the beloved disciple, notably in chapter 19. Christian tradition identifies him as John the Apostle, but the majority of modern scholars have abandoned this or hold it only tenuously. Most scholars believe it was written  90–110 AD, at Ephesus in Anatolia (although other possibilities are Antioch, Northern Syria, Judea and Alexandria). Scholars have increasingly described the gospel as a unitary text and abandoned models with hypothetical sources and strata with the advent of text-critical methods. Most scholars during the twentieth century viewed John as a communal work written in multiple editions, but this position is currently in retreat,  and there has been a decrease in arguing for the existence of hypothetical sources behind the Gospel of John in scholarship.\nThe fact that the format of John follows that set by Mark need not imply that the author knew Mark, for there are no identical or almost-identical passages; rather, this was most probably the accepted shape for a gospel by the time John was written. Nevertheless, John's discourses are full of synoptic-like material: some scholars think this indicates that the author knew the synoptics, although others believe it points instead to a shared base in the oral tradition. John nevertheless differs radically from them:\n{| class=\"wikitable\"\n|-\n! Synoptics !! John\n|-\n| Begin with the virgin conception (virgin birth - Matthew and Luke only)|| Begin with incarnation of the preexistent Logos/Word\n|-\n| Jesus visits Jerusalem only in the last week of his life; only one Passover || Jesus active in Judea for much of his mission; three Passovers\n|-\n| Jesus speaks little of himself || Jesus speaks much of himself, notably in the \"I am\" statements\n|-\n| Jesus calls for faith in God || Jesus calls for faith in himself\n|-\n| Jesus's central theme is the Kingdom of God || Jesus rarely mentions the Kingdom of God\n|-\n| Jesus preaches repentance and forgiveness || Jesus never mentions repentance, and mentions forgiveness only once (John 20:23)\n|-\n| Jesus speaks in aphorisms and parables || Jesus speaks in lengthy dialogues\n|-\n| Jesus rarely mentions eternal life || Jesus regularly mentions eternal life\n|-\n| Jesus shows strong concern for the poor and sinners || Jesus shows little concern for the poor and sinners\n|-\n| Jesus frequently exorcises demons || Jesus never exorcises demons\n|}\nTexts\nTextual criticism resolves questions arising from the variations between texts: put another way, it seeks to decide the most reliable wording of a text. Ancient scribes made errors or alterations (such as including non-authentic additions). In attempting to determine the original text of the New Testament books, some modern textual critics have identified sections as additions of material, centuries after the gospel was written. These are called interpolations. In modern translations of the Bible, the results of textual criticism have led to certain verses, words and phrases being left out or marked as not original.\nFor example, there are a number of Bible verses in the New Testament that are present in the King James Version (KJV) but are absent from most modern Bible translations. Most modern textual scholars consider these verses interpolations (exceptions include advocates of the Byzantine or Majority text). The verse numbers have been reserved, but without any text, so as to preserve the traditional numbering of the remaining verses. The biblical scholar Bart D. Ehrman notes that many current verses were not part of the original text of the New Testament. \"These scribal additions are often found in late medieval manuscripts of the New Testament, but not in the manuscripts of the earlier centuries\", he adds. \"And because the King James Bible is based on later manuscripts, such verses \"became part of the Bible tradition in English-speaking lands\".\" He notes, however, that modern English translations, such as the New International Version, were written by using a more appropriate textual method.\nMost modern Bibles have footnotes to indicate passages that have disputed source documents.  Bible Commentaries also discuss these, sometimes in great detail. While many variations have been discovered between early copies of biblical texts, most of these are variations in spelling, punctuation, or grammar. Also, many of these variants are so particular to the Greek language that they would not appear in translations into other languages. Three of the most important interpolations are the last verses of the Gospel of Mark the story of the adulterous woman in the Gospel of John, and the explicit reference to the Trinity in 1 John to have been a later addition.\nThe New Testament has been preserved in more than 5,800 fragmentary Greek manuscripts, 10,000 Latin manuscripts and 9,300 manuscripts in various other ancient languages including Syriac, Slavic, Ethiopic and Armenian. Not all biblical manuscripts come from orthodox Christian writers. For example, the Gnostic writings of Valentinus come from the 2nd century AD, and these Christians were regarded as heretics by the mainstream church. The sheer number of witnesses presents unique difficulties, although it gives scholars a better idea of how close modern bibles are to the original versions. Bruce Metzger says, \"The more often you have copies that agree with each other, especially if they emerge from different geographical areas, the more you can cross-check them to figure out what the original document was like. The only way they'd agree would be where they went back genealogically in a family tree that represents the descent of the manuscripts.\"\nIn The Text Of The New Testament, Kurt Aland and Barbara Aland compare the total number of variant-free verses, and the number of variants per page (excluding spelling errors), among the seven major editions of the Greek NT (Tischendorf, Westcott-Hort, von Soden, Vogels, Merk, Bover and Nestle-Aland), concluding that 62.9%, or 4,999/7,947, are in agreement. They concluded, \"Thus in nearly two-thirds of the New Testament text, the seven editions of the Greek New Testament which we have reviewed are in complete accord, with no differences other than in orthographical details (e.g., the spelling of names). Verses in which any one of the seven editions differs by a single word are not counted. ... In the Gospels, Acts, and Revelation the agreement is less, while in the letters it is much greater.\" Per Aland and Aland, the total consistency achieved in the Gospel of Matthew was 60% (642 verses out of 1,071), the total consistency achieved in the Gospel of Mark was 45% (306 verses out of 678), the total consistency achieved in the Gospel of Luke was 57% (658 verses out of 1,151), and the total consistency achieved in the Gospel of John was 52% (450 verses out of 869). Almost all of these variants are minor, and most of them are spelling or grammatical errors. Almost all can be explained by some type of unintentional scribal mistake, such as poor eyesight. Very few variants are contested among scholars, and few or none of the contested variants carry any theological significance. Modern biblical translations reflect this scholarly consensus where the variants exist, while the disputed variants are typically noted as such in the translations.\nA quantitative study on the stability of the New Testament compared early manuscripts to later manuscripts, up to the Middle Ages, with the Byzantine manuscripts, and concluded that the text had more than 90% stability over this time period. It has been estimated that only 0.1% to 0.2% of the New Testament variants impact the meaning of the texts in any significant fashion.\nIndividual units\nAuthors such as Raymond Brown point out that the Gospels contradict each other in various important respects and on various important details. The patterns of parallels and differences found in the gospels are typical of ancient biographies about real people and history. W. D. Davies and E. P. Sanders state that, \"on many points, especially about Jesus' early life, the evangelists were ignorant ... they simply did not know and, guided by rumour, hope or supposition, did the best they could.\"\nGenealogy, nativity and childhood of Jesus\nThe genealogy, birth and childhood of Jesus appear only in Matthew and Luke, and are ascribed to Special Matthew and Special Luke.\nOnly Luke and Matthew have nativity narratives. Modern critical scholars consider both to be non-historical. Many biblical scholars view the discussion of historicity as secondary, given that gospels were primarily written as theological documents rather than historical accounts.\nThe nativity narratives found in the Gospel of Matthew () and the Gospel of Luke () give a genealogy of Jesus, but the names, and even the number of generations, differ between the two. Some authors have suggested that the differences are the result of two different lineages, Matthew's from King David's son, Solomon, to Jacob, father of Joseph, and Luke's from King David's other son, Nathan, to Heli, father of Mary and father-in-law of Joseph. However, Geza Vermes argues that Luke makes no mention of Mary, and questions what purpose a maternal genealogy would serve in a Jewish setting.\nDating the birth of Jesus\nBoth Luke and Matthew date Jesus' birth to within the rule of King Herod the Great, who died in 4BC. However, the Gospel of Luke also dates the birth ten years after Herod's death, during the census of Quirinius in 6 AD described by the historian Josephus. Raymond E. Brown notes that \"most critical scholars acknowledge a confusion and misdating on Luke's part\".\nTeachings of Jesus\nAccording to John P. Meier, only a few of the parables can be attributed with confidence to the historical Jesus, although other scholars disagree. Meier argues that most of them come from the M and L sources (rather than Mark or Q), but marked by the special language and theology of each of those gospels; this leads to the conclusion that they are not the original words of Jesus, but have been reworked by the gospel-authors.\nPassion narrative\nThe entry of Jesus into Jerusalem recalls the entry of Judas Maccabeus; the Last Supper is mentioned only in the synoptics.\nDeath of Judas\nThere is a contradiction regarding the death of Judas Iscariot with the account of his death in Acts differing from the one given in Matthew. In Matthew 27:3–8, Judas returns the bribe he has been given for handing over Jesus, throwing the money into the temple before he hangs himself. The temple priests, unwilling to return the defiled money to the treasury, use it instead to buy a field known as the Potter's Field, as a plot in which to bury strangers. In Acts 1:18 Peter says that Judas used the bribe money to buy the field himself, and his death is attributed to injuries from having fallen in this field. Some apologists argue that the contradictory stories can be reconciled.\nArchaeology and geography\n, 1st-century CE crucifixion victim from Givat HaMivtar in Jerusalem, with a nail still lodged inside the heel bone]]\nArchaeological tools are very limited with respect to questions of existence of any specific individuals from the ancient past. According to Eric Cline, there is no direct archaeological evidence of the existence of a historical Jesus, any of the apostles, or the majority of people in antiquity. Bart Ehrman states that having no archeological evidence is not an argument for the non-existence of Jesus because we have no archaeological evidence from anyone else from Jesus's day either. Craig Evans notes that archaeologists have some indirect information on how Jesus' life might have been from archaeological finds from Nazareth, the High Priest Caiaphas' ossuary, numerous synagogue buildings, and Jehohanan, a crucified victim who had a Jewish burial after execution. Archeological findings from Nazareth refute claims by mythicists that Nazareth did not exist in the 1st century and also give credibility to brief passages in the Gospels on Jesus' time in Nazareth, his father's trade, and connection to places in Judea. Archaeologists have uncovered a site in Capernaum which is traditionally believed, with \"no definitive proof\" and based only upon circumstantial evidence, to have been the House of Peter, and which may thus possibly have housed Jesus. Some of the places mentioned in the gospels have been verified by archaeological evidence, such as the Pool of Bethesda, the Pool of Siloam, and the Temple Mount platform extension by King Herod. A mosaic from a third-century church in Megiddo mentions Jesus. A geological study based on sediments near the Dead Sea indicate that an earthquake occurred around 31 AD ± 5 years, which plausibly coincides with the earthquake reported by Matthew 27 near the time of the crucifixion of Christ. A statistical study of name frequency in the Gospels and Acts corresponded well with a population name distribution database from 330 BC - 200 AD and the works of Josephus, but did not fit well with ancient fictional works.\nSee also\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\nReferences\nNotes\nCitations\nWorks cited\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\nFurther reading\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n* Meier, John P., A Marginal Jew: Rethinking the Historical Jesus, Doubleday,\n:v. 1, The Roots of the Problem and the Person, 1991,\n:v. 2, Mentor, Message, and Miracles, 1994,\n:v. 3, Companions and Competitors, 2001,\n:v. 4, Law and Love\n:v. 5, Probing the Authenticity of the Parables\n*\n*\n*\n*\n*\n*\n*\n*\n*\n* Wright, N.T. Christian Origins and the Question of God, a projected 6 volume series of which 3 have been published under:\n:v. 1, The New Testament and the People of God. Augsburg Fortress Publishers: 1992.;\n:v. 2, Jesus and the Victory of God. Augsburg Fortress Publishers: 1997.;\n:v. 3, The Resurrection of the Son of God. Augsburg Fortress Publishers: 2003.\n*\n*"
    }
  ]
}