{
  "content": [
    {
      "type": "text",
      "text": "# History of mass surveillance in the United Kingdom\n\nThe modern capabilities and legal framework for mass surveillance in the United Kingdom developed under successive governments of the United Kingdom since the late 20th century.\nBackground\nHistorically, state surveillance in the United Kingdom began in Victorian Britain. David Vincent observes that the statistical measurement of communication behaviour began with the introduction of the Penny Post in 1840. An early public scandal occurred in the postal espionage crisis of 1844.\nSecurity Service Act 1989\nThe Security Service Act 1989 established the legal basis of the UK Security Service for the first time under the Conservative government led by Margaret Thatcher.\nIntelligence Services Act 1994\nGCHQ and the Secret Intelligence Service were placed on a statutory footing for the first time by the Intelligence Services Act 1994 under the Conservative government led by John Major.\nIdentity Cards Act 2006 and 2010\nIdentity cards were introduced under the Labour government under Tony Blair in 2006. The Identity Documents Act 2010 repealed the Identity Cards Act of 2006, scrapping the mandatory ID card scheme and associated National Identity Register that had been in use on a limited or voluntary basis since November 2008, but which was never fully implemented. The National Identity Register was destroyed on 10 February 2011.\nForeign nationals from outside the European Union continue to require an ID card for use as a biometric residence permit under the provisions of the UK Borders Act 2007 and the Borders, Citizenship and Immigration Act 2009. Although the 2010 Act ended the validity of ID cards as travel documents, no action was taken to withdraw the National Identity Cards already issued.\nEuropean Union Data Retention Directive (2007–14)\nAs a member of the European Union, the United Kingdom is subject to EU policies and directives on surveillance and participates in its programmes. Since October 2007 telecommunication companies have been required to keep records of phone calls and text messages for twelve months under the European Union's Data Retention Directive. Though all telecoms firms already keep data for a period, the regulations are designed to ensure a uniform approach across the industry. This has enabled the Government and other selected authorities within the UK such as Police and Councils amongst others to monitor all phone calls made from a UK landline or Mobile upon request.\nIn April 2014, the European Court of Justice ruled that the European Union's Data Retention Directive was invalid. The European Court of Justice found it violates two basic rights, respect for private life and protection of personal data.\nCommunications Data Bill (2008–10)\nIn 2008 plans were being made to collect data on all phone calls, e-mails, chat room discussions and web-browsing habits as part of the Labour government's Interception Modernisation Programme under Prime Minister Gordon Brown. It was thought likely to require the insertion of thousands of black box probes into the country's computer and telephone networks. The proposals were expected to be included in the Communications Data Bill 2008. The \"giant database\" was to include telephone numbers dialled, the websites visited, and addresses to which e-mails are sent, but not the content of e-mails or telephone conversations. Chris Huhne, Liberal Democrat Home affairs spokesman, said, \"The government's Orwellian plans for a vast database of our private communications are deeply worrying.\" In November 2009, ministers confirmed that the estimated £2&nbsp;billion project would proceed as planned. A consultation found that 40% of people were against the plans which would also include monitoring communications in online games.\nDraft Data Communications Bill (2010–15)\nThe Interception Modernisation Programme was renamed the Communications Capabilities Development Programme by the Conservative-led government under David Cameron in 2010, and development of a new Draft Communications Data Bill began under Home Secretary Theresa May.\nThe Draft Communications Data Bill was discussed between 2010 and 2013 but not formally introduced to Parliament as a Bill. It addressed the retention of communications data (not the content of messages) and proposed broadening the types of data retained by internet providers for example to include web browsing history. It was nicknamed the 'Snooper's Charter' and was abandoned by the government in 2013 after opposition from the Deputy Prime Minister Nick Clegg and his party of Liberal Democrats.\nInternet, fixed and mobile telephone communications (2013)\nIn 2013, issues regarding the possible discovery of \"storage chips\" in commercial keyboard, touchpad and LCD controller semiconductors on devices such as laptops and desktops have been raised by the destruction of these components at The Guardian newspaper after the revelations of leaked documents.\nThe police have used mobile phones to track suspects. Some shopping centres have also tracked customers through mobile phone signals. A system can tell when people enter the centre, how long they stay in a particular shop, and what route each customer takes. The system works by monitoring the signals produced by mobile handsets and then locating the phone by triangulation.\nOnline Safety Bill\nIn 2023, the Online Safety Bill was passed, which allowed the government to force  online platforms to search through all users' photos, files, and messages, whenever the government ordered.\nSee also\n* NO2ID\nReferences\n*\nExternal links\n* [http://webarchive.nationalarchives.gov.uk/20100418065544/http://homeoffice.gov.uk/documents/cons-1999-interception-comms2835.pdf?view=Binary \"Interception of Communications in the United Kingdom: A Consultation Paper\"], Home Secretary, June 1999\n* [http://maps.google.co.uk/maps/ms?hl=en&gl=uk&ie=UTF8&oe=UTF8&msa=0&msid=109774812065294828937.0004516c40af97d3b9718 \"Norwich Police/Norwich City Council CCTV Cameras\"], use of Google Maps to plot an entire CCTV network in the UK, 20 March 2009.\n* [https://archive.today/20121021085201/http://www3.interscience.wiley.com/journal/119027415/abstract \"The Rise of the Information State: The Development of Central State Surveillance of the Citizen in England, 1500 – 2000\"], Edward Higgs, in Twenty Years of the Essays on the British State, Volume 1, Y.-S. Wong and D. Sayer (eds), Blackwell Publishing Ltd. (UK), 2008, .\n* [https://news.bbc.co.uk/2/hi/business/5015826.stm \"Is business the real Big Brother?\"], Adam Harcourt-Webster, BBC News, 25 May 2006.\n* [https://www.theguardian.com/technology/2004/jun/24/security.internet \"Knowing me, knowing you: Bigger databases may mean greater efficiency for the state and private sector, but they could also mean more unwelcome intervention into our personal lives\"], SA Mathieson, The Guardian, 23 June 2004."
    }
  ]
}