{
  "content": [
    {
      "type": "text",
      "text": "# History of Woking__disambig_1\n\nbefore a Glass Extension was added]]\nWoking means\"(settlement belonging to the) followers of Wocc (or 'Wocca')\". Over time, the name has been written variously as, for example, Wochingas, and Wokynge.\nPre-1800\nPrehistoric\nbell barrow on Horsell Common]]\nIn Horsell Common there are three ancient bell barrow burial mounds that are around 3–4,000 years old. A possible explanation to these burial mounds (as Bell Barrow Mounds are not common in Surrey) is that they were built to 'commemorate leaders who had migrated from Wessex to colonise new lands'. There is a reference to these three burial mounds in the antiquarian John Aubrey's 1718 book 'A History of Surrey'. Although there was and is knowledge of these bell barrow mounds, there is no official evidence they have ever been excavated.\nIt is likely the spot where the burial mounds was once farmland, though because of its poor soil the burial mounds were put there instead. It is likely there are more than three of the burial mounds, though no more have yet been found.\nRoman, Anglo-Saxon and Norman\nWoking appears in written materials which, though created in the 12th century at Peterborough Abbey, formerly known as Medeshamstede, reliably describe earlier events. The earliest of these is the grant by Pope Constantine (708–715) of privileges to a monastery at Wochingas. Later in the 8th century a charter of King Offa of Mercia granted further privileges, freeing this church from numerous standard liabilities. This charter is paraphrased in a 12th-century interpolation to the ''Anglo-Saxon Chronicle's entry for 777 AD, also written at Peterborough:\nThe church was probably formed around 1,300 years ago when monks from Chertsey set up a church to serve the area that is now Woking Borough. The church is thought to have been destroyed by Vikings around 1030–60. The church was rebuilt by 1066.\nWoking appears in the Domesday Book of 1086 as Wochinges. Its description there is complex, since it was then held as three estates, by King William the Conqueror, Walter FitzOther, constable of Windsor Castle, and Ansgot and Godfrey from Osbern FitzOsbern, then bishop of Exeter.\nThere is evidence of a Roman settlement to the east of Old Woking.\nWoking Palace\nA building was first recorded on the site of Woking Palace in 1272. In 1466 Lady Margaret Beaufort, mother of King Henry VII and grandmother of King Henry VIII, and her third husband, Sir Henry Stafford, obtained by royal grant the former Beaufort manor of Woking. They lived in the manor house at least until Henry Stafford's death in 1471. In 1490 a treaty with Spain, known as the Treaty of Woking (or Okyng), was signed at the Palace by Henry VII. This alliance was sealed with the marriage of Catherine of Aragon to Arthur, Prince of Wales.\nThe modern Beaufort School in nearby Goldsworth Park is named after Lady Margaret. Henry VII took the manor from his mother in 1503 and began the process of converting the manor house into a palace. His son Henry VIII continued this process when he succeeded his father in 1509, and the palace became a favorite residence of the king.\nBy 1620 the ownership of Woking Palace was passed by King James I to Sir Edward Zouch who abandoned the palace and built himself a new manor house at Hoe Bridge Place. Thereafter the buildings fell into decay and the original park surrounding the palace was turned over to agriculture.\nThere are 3 weekends a year when the palace is open to the public. The barrel vaulted room is open during these weekends with various activities around it. There are varied displays just round the back of the King's Hall that include Birds of Prey flying displays and explanations of how the Tudors would have hunted with them.   There are also gardens and fish ponds around the Hall. Bordering the ruins to the south is the River Wey and the moat surrounds the rest of the Palace site of nearly 8 acres.\n17th century\nIn 1651 the Wey Navigation Canal was opened for traffic from Guildford to the River Thames passing through Woking. Over a century later, in 1791, the canal from the Wey Navigation Canal to Basingstoke opened as far as Horsell. Then in 1792 the Basingstoke Canal opened as far as Pirbright. Navigation on the Brookwood Canal stopped in 1947. In 1991, the Basingstoke Canal was formally reopened along its whole length following renovation by volunteers.\nIn 1661 James Zouch, grandson of Sir Edward Zouch, obtained the Market Charter for Woking. Eight years later Zouch was Sheriff of Surrey (1669–1670). In 1760, James Turner bought from the Earl of Onslow, owner of Woking Manor, some land in the \"Tithing of Goldings\".\n1800s\nIn 1849, locating the London Necropolis (cemetery) was first proposed for Woking Parish by the Board of Health. In 1879 Woking Crematorium was built at St John's, to be used for the first time in 1884 when the first modern cremation in the UK was performed.\n.]]\nH. G. Wells wrote his book The War of the Worlds whilst living on Maybury Road in Woking in 1898. Many scenes from the story are set in Horsell, Woking and the surrounding area.\nFacilities\nThe 1850s saw the first building of the 'New Woking', with the construction of the Albion Hotel. In 1862, the Royal Dramatic College opened in Maybury on the site which is currently occupied by the Lion Retail Park. The college then closed in 1877. The Oriental Institute opened on the site in 1884 but closed in 1898.\nIn 1859 Woking Convict Invalid Prison opened on land purchased from the London Necropolis Company. Originally holding male invalid prisoners, then expanded to host a female wing. The male prison was functional until 1889 and the female prison closed in 1895 after which a decline in the total number of chronically ill criminals, made it unnecessary. At one time the prison also hosted a wing for the insane. Notable inmates included; Charles Kickham, George Bidwell, and John Lynch.\nThe 1880s saw the opening of the Woking Police Station in 1887; then in 1889 Woking Football Club was formed. This year also saw the opening of the Woking Mosque (the first purpose-built mosque in Western Europe). Sultan Shah Jahan, Begum of Bhopal donated money to help build it and it is now called the Shah Jahan Mosque in her honour.\nThe Victoria Hospital opened in 1899.\nWoking obtained electricity in 1890 and gas in 1891. In 1899 Woking's sewerage system was built.\nRailways\nThe railways came to Woking in 1838 when the London and Southampton company (renamed London and South Western Railway in 1839) railway opened as far as Winchfield. Woking Common Station (Now Woking Station) opened.\nPolitics\nIn 1830, the Woking Parish experienced civil unrest. Whilst in 1834 Guildford (affecting Woking parish) and Chertsey (affecting Horsell parish) Poor Law Unions were formed.\nNotably in 1864 Guildford and Chertsey Highway Districts was formed. In 1872 Guildford and Chertsey Rural Sanitary Authorities formed; and 1874 saw the formation of the Woking School Board.\nThe Woking Local Board formed in 1894. It first met in Goldsworth Hall with 18 councillors representing the wards of Knaphill, St Johns, Mayford, Sutton Green, Brookwood, Old Woking, Maybury. By 1895 Woking Urban District Council was formed, replacing the Local Board and Chertsey Rural District Council.\nNewspapers\nIn 1894, the 'Woking News' was first published from offices in Chertsey Road. Each copy cost 1d. In 1895, the 'Woking Mail' was first published from offices in Goldsworth Road. Each copy cost d. Later, these papers merged to become the 'Woking News and Mail'.\n1900–1945\n]]\nIn 1930 Woking Council was granted a coat of arms by the College of Arms. It is of interest, because it is made up of extracts from the arms of past holders of the Manor. The heraldic description of the arms is:\nQuarterly gold and gules a cross flory between in the first and fourth quarters a fleur-de-lis, and in the second and third quarters a fret, all counter-changed.\nThe motto is \"Fide et Diligentia\" – \"By Faith and Diligence\".\nThe cross forming the centre is that of Edward the Confessor and the red and gold colouring of the arms is taken from the coat of arms of the Bassett family, to whom the Manor was granted by King John. The frets in the second and third quarters are taken from the coat of arms of the Despenser, who held Woking from 1281; and the fleur-de-lis in the first and fourth quarters of the Woking arms were taken from the Beaufort coat of arms, the Manor passing into the possession of this family in 1416.\nIn 1924 'Woking Offers' free paper advertising local traders started. By 1928 'Woking Offers' was renamed 'Woking Outlook' to be renamed 'Woking Review' in 1933. It is believed to be the oldest free newspaper in Britain.\nIn 1924 Waterer's Park was left to Woking U.D.C. by Anthony Waterer of Knaphill Nursery.  Knaphill Football Club started playing there.\nIn 1945, a V-2 rocket launched by Germany landed on Woking.\nUtilities\nIn 1902 Woking's gas street lighting was replaced with electric. Five years later Horsell obtained a sewerage system. During World War II, Woking Fire Brigade placed under the wartime control of the National Fire Service and became the responsibility of Surrey County Council from 1 April 1948.\nFacilities\nAround 1900, the original Woking open air swimming pool was opened. By 1935 the second Woking open air swimming pool was opened which led to the formation of the Woking Swimming Club in the same year.\nIn 1929, Woking Library opened.\nTransport\nIn 1902 Guildford and District Motor Services started a bus service in the Guildford and Woking area. Furthermore, Woking and Bagshot light railway was proposed that would have run over what is now Goldsworth Park on the Woking side of the Woking/Horsell parish boundary.  By 1910 the project died out.\nThen in 1915 Guildford and District Motor Services was bought by Aldershot and District Traction, who eventually took over its services in the Guildford and Woking area. In 1923 Southern Railway formed. It ran most routes through Woking Station.\nDuring World War II, Southern Railway placed under Government control.\nPolitics\n1907 saw Horsell merge into the Woking Urban District Council.\nIn 1933, Chertsey Rural District Council abolished; and most of Byfleet and Pyrford Parishes and part of Woodham tithing in Chertsey Parish and part of Bisley Parish were joined with Woking Urban District Council.\nThen in 1936, a small part of Byfleet, around the Mill, that had been joined with Walton and Weybridge. The new W.U.D.C. boundary in 1936 was mostly the same as the current Woking Borough boundary.\nDuring World War II, Surrey was divided into two emergency control areas.\n* The West Emergency Area comprised the councils Bagshot RD, Caterham and Warlingham UD, Chertsey UD, Dorking UD, Dorking and Horley RD, Egham UD, Farnham UD, Frimley and Camberley UD, Godalming RD, Guildford B, Guildford RD, Hambledon UD, Leatherhead UD, Reigate B, Walton and Weybridge UD and Woking UD.\n* East Emergency Area (later called = Group 9 London CD) comprised the councils Banstead UD, Barnes B, Beddington and Wallington B, Carshalton UD, Coulsdon and Purley UD, Croydon CB, Epsom and Ewell B, Esher UD, Kingston B, Malden and Coombe B, Merton and Morden UD, Mitcham B, Sutton and Cheam B, Richmond B, Surbiton B and Wimbledon B\n:CB=County Borough, B=Borough, UD=Urban District and RD=Rural District\nMartinsyde\nFormed by Helmut P Martin and George H Handasyde in 1908, the Brooklands-based Martin and Handasyde aircraft company changed its name to Martinsyde Ltd in 1915 and then moved its office and aircraft manufacturing activities to the former Oriental Institute in Woking. By 1918, Martinsyde aircraft production had increased to such an extent that it was Britain's third largest aircraft manufacturer. In 1920, the factory was devastated by fire and aircraft production ended although motorcycle production continued until the company entered receivership in 1922. In 1924, Martinsyde's assets passed to the Aircraft Disposal Company (ADC). In 1926, the site became James Walker Engineering to be renamed Lion Works.\nPost-1945\nIn 1983, Woking was twinned with Amstelveen in the Netherlands, though the Charter of Friendship was signed in 1989. Then in 1992 Woking was twinned with Le Plessis-Robinson in France, though the Charter of Friendship was signed in 1993. In 1999, Woking twinned with Rastatt in Germany, though the Charter of Friendship was signed in 2001.\nLarge local employers\nIn 1947 Kenwood started in Woking leaving the town in 1961 when the company moved to Havant, Hampshire. By 1961, Kenwood had a workforce of 700. In 1957 James Walker Engineering opened a new site in Old Woking; it closed in 2006. In 1963, McLaren Racing Team formed; in 1999 they started to build the new Mercedes SLR.\nIn 1976 British American Tobacco moved into Export House Tower. Telewest took up occupancy in 2001, becoming Virgin Media six years later. In 2009, Mouchel Group PLC moved from West Hall in nearby West Byfleet into Export House, along with Mustang Engineering.\nWoking's tallest building and British American Tobacco's former HQ ]]\nSports\nIn 1954 Woking Squash Club was formed and in 1968 Woking Archery Club was established. In 1994 Woking Football Club won the FA Trophy, winning it again in 1995 and 1997.\nTown planning\n1953 the Surrey Plan foresaw a Woking Urban District population of about 67,000 in the mid-1970s, but the 1961 Census figures exceeded that amount. In 1965, a revised town plan foresaw a population of 97,000 by 1981 and proposed building 3 new housing schemes, one of which was known as 'Slococks', to be built on nurserylands owned by Slococks. By 1970, New Ideal Homes and Woking Council agreed to a partnership to build 'Slococks'.\nIn 1973 the plan to build a housing estate was approved by the Government. The project was called Goldsworth Park.  Work started in Goldsworth Vale (phase one was Wilders Close etc.), with plans to build approx. 4,500 homes for approx. 15,000 residents. It also planned for a lake, sports facilities, golf course, shops, swimming-pool, library, industrial estate, youth centres, pubs, churches, fire station and social facilities. A year later the first owner moved into the estate.\nFacilities\nIn 1971 Wolsey Place Shopping Centre opened.  About this time Centre Halls and Woking Centre Library opened.\nThen in 1973 the new covered Woking Swimming Pool was opened (called the Centre Pool), near to where Toys'R'Us and Peacocks Corner are now on the A320. The Pool in the Park opened in 1989.\nIn 1977, Marjorie Richardson (the former 46th Woking Urban District Council Chairman for 1962/3) opened a centre in Woking for retired people. 1983 saw the opening of the Woking Civic Offices by the Duke of Gloucester.\nIn 1992, Peacocks Shopping Centre, Library, Town Gate, Cinema and New Victoria Theatre and the Leisure Lagoon at Pool in the Park opened. Centre Halls, Centre Pool and Woking Centre Library had been demolished to make room for them. Then in 1996, The Planets Entertainment complex was completed. In 2010 the front of the Peacocks had a glass extension added onto it. Some locals criticised it for not being able to see the clock that was there previously.\nIn 1999, the Surrey History Centre officially opened by HRH Charles, The Prince of Wales. In 2007, work finished on the Albion Square canopy outside the town side of Woking railway station costing £3.1 million.\nPolitics\nIn 1974, Woking Borough Council was formed, replacing the Urban District Council and was under Conservative Control. In 1994 Woking Borough Council switched from Conservative to No Overall Control. In 1999, Ian Eastwood became Deputy Mayor. Also in that year, the South East Regional Assembly was set up covering Kent, Sussex, Hampshire and the Isle of Wight, Surrey, Berkshire, Buckinghamshire and Oxfordshire.\nIn 2006, Woking Borough Council announced a Housing private finance initiative (PFI) project called Priority Homes – Putting Affordable Housing First [http://www.woking.gov.uk/housing/policies/future/priorityhomes]. The proposed development will provide 190 affordable houses within a mixed tenure community on a single site, to the north of Moor Lane, in Westfield.\nOn Friday 23 March 2007, HRH Prince Charles opened a climate change exhibition at The Peacocks shopping centre. The exhibition, a joint venture by Business in the Community and the British Council of Shopping Centres (BCSC) endorsed by the Climate Group, features displays with information on \"issues of recycling, energy use, transport, waste reduction and locally sourced food.\"\nTelephone codes\nSometime between 1989 and 1994, it had changed from 04862 to 0483. The original reason for this was that 04862 was a RING code of GUILDFORD and actually meant 0GU62. British Telecom decided to move most UK RING codes to their related CORE codes (Guildford CORE code 0483 actually stood for 0GU3).\nIn 1994, Woking's STD telephone code changed from 0483 to 01483 along with most areacodes in the UK on Phoneday.\nTransport issues\n]]\nOn 14 December 1993, an explosion on the railway lines between Woking and West Byfleet disrupted rail traffic and forced the closure of 9 stations in the area.\nIn 1996 South West Trains won the franchise for most rail routes through Woking Station (the former BR Network South East/South West Division). In 2002, Arriva's Woking depot in Goldsworth Park Trading Estate closed, moving to Guildford.\nOther notable events\nIn 1963, The Rolling Stones played a concert at the 'Atalanta' Ballroom in Woking.\nPaul Weller was born on 25 May 1958, in Sheerwater. He went on to form the Jam in 1972.\nIn 2001, C&A closed its Swiftflow distribution depot on Goldsworth Park Trading Estate. Then in 2003, a new, bigger warehouse was built on the site of the old C+A warehouse in Kestrel Way.\nMayors\n:See List of Mayors of Woking\nPartisan composition of Woking Borough Council\nWoking Borough Council is usually elected by thirds: That is, approximately one-third of the members are re-elected at each election, each serving four-year terms, with one year out of every four not having Council elections.\nThe council was, however, re-elected whole in 2000 after wholesale boundary changes to the Wards.\n{| class=\"wikitable\"\n|-\n!Year\n!Conservative\n!Labour\n!Lib Dem\n!Independent\n!Other\n|-\n|1999\n|12\n|7\n|14\n|1\n|0\n|-\n|2000\n|14\n|5\n|16\n|1\n|0\n|-\n|2002\n|17\n|5\n|13\n|1\n|0\n|-\n|2003\n|17\n|6\n|12\n|1\n|0\n|-\n|2004\n|17\n|4\n|15\n|0\n|0\n|-\n|2006\n|15\n|3\n|18\n|0\n|0\n|-\n|2007\n|19\n|0\n|17\n|0\n|0\n|-\n|2008\n|19\n|0\n|17\n|0\n|0\n|-\n|2010\n|19\n|0\n|17\n|0\n|0\n|-\n|}\nParty control\n*1974–1986: Conservative\n*1986–1992: No Overall Control\n*1992–1994: Conservative\n*1994–1996: No Overall Control\n*1996–1998: Liberal Democrats\n*1998–2007: No Overall Control\n*2007–2008: Conservative\n*2008–2011: No Overall Control\n*2011–2019: Conservative\n*2019–present: No Overall Control\nSee also\n*Woking (UK Parliament constituency)\n*Woking\nReferences\n*[http://chrisduggleby.com/2012/05/06/prehistoric-britain-or-more-precisely-prehistoric-woking/ Information on the Burial Mounds in Horsell Common]\n*[https://archive.today/20130105032029/http://historywoking.webspace.virginmedia.com/A%20History%20of%20Woking.htm/ A Brief History of Woking]\nFurther reading\nCrosby, Alan \"A History of Woking\" (Phillimore, 2003)"
    }
  ]
}