{
  "content": [
    {
      "type": "text",
      "text": "# History of the ancient Levant\n\nThe Levant is the area in Southwest Asia, south of the Taurus Mountains, bounded by the Mediterranean Sea in the west, the Arabian Desert in the south, and Mesopotamia in the east. It stretches roughly  north to south, from the Taurus Mountains to the Sinai Peninsula and Syrian Desert, and east to west between the Mediterranean Sea and the Khabur river. The term is often used to refer to the following regions or modern states: Syria, Lebanon, Israel, Palestine, Jordan and Hatay Province in Turkey. More broadly it also includes: Sinai (Egypt), Cilicia (Turkey) and Cyprus.\nThe Levant is one of the earliest centers of sedentism and agriculture in history, and some of the earliest agrarian cultures, Pre-Pottery Neolithic, developed in the region. Previously regarded as a peripheral region in the ancient Near East, modern academia largely considers the Levant as a center of civilization on its own, independent of Mesopotamia and Egypt. Throughout the Bronze and Iron ages, the Levant was home to many ancient Semitic-speaking peoples and kingdoms, and is considered by many to be the urheimat of Semitic languages.\nStone Age\nPaleolithic\nAnatomically modern Homo sapiens are demonstrated at the area of Mount Carmel in Canaan during the Middle Paleolithic dating from . These migrants out of Africa seem to have been unsuccessful, and by  in the Levant, Neanderthal groups seem to have benefited from the worsening climate and replaced Homo sapiens, who were possibly confined once more to Africa.\nA second move out of Africa is demonstrated by the Boker Tachtit Upper Paleolithic culture, from 52,000 to 50,000&nbsp;BC, with humans at Ksar Akil XXV level being modern humans. This culture bears close resemblance to the Badoshan Aurignacian culture of Iran, and the later Sebilian I Egyptian culture of . Stephen Oppenheimer suggests that this reflects a movement of modern human groups back into North Africa, at this time.\nIt would appear this sets the date by which Homo sapiens Upper Paleolithic cultures begin replacing Neanderthal Levalo-Mousterian, and by  the region was occupied by the Levanto-Aurignacian Ahmarian culture, lasting from 39,000 to 24,000&nbsp;BC. This culture was quite successful spreading as the Antelian culture (late Aurignacian), as far as Southern Anatolia, with the Atlitan culture.\nEpi-Palaeolithic\nAfter the Late Glacial Maxima, a new Epipaleolithic culture appears. The appearance of the Kebaran culture, of microlithic type implies a significant rupture in the cultural continuity of Levantine Upper Paleolithic. The Kebaran culture, with its use of microliths, is associated with the use of the bow and arrow and the domestication of the dog. Extending from 18,000 to 10,500&nbsp;BC, the Kebaran culture shows clear connections to the earlier microlithic cultures using the bow and arrow, and using grinding stones to harvest wild grains, that developed from the  Halfan culture of Egypt, that came from the still earlier Aterian tradition of the Sahara. Some linguists see this as the earliest arrival of Nostratic languages in the Middle East.\nKebaran culture was quite successful, and was ancestral to the later Natufian culture (12,500–9,500&nbsp;BC), which extended throughout the whole of the Levantine region. These people pioneered the first sedentary settlements, and may have supported themselves from fishing and the harvest of wild grains plentiful in the region at that time.  the oldest remains of bread were discovered  at the archaeological site of Shubayqa 1, once home of the Natufian hunter-gatherers, roughly 4,000 years before the advent of agriculture.\nNatufian culture also demonstrates the earliest domestication of the dog, and the assistance of this animal in hunting and guarding human settlements may have contributed to the successful spread of this culture. In the northern Syrian, eastern Anatolian region of the Levant, Natufian culture at Cayonu and Mureybet developed the first fully agricultural culture with the addition of wild grains, later being supplemented with domesticated sheep and goats, which were probably domesticated first by the Zarzian culture of Northern Iraq and Iran (which like the Natufian culture may have also developed from Kebaran).\nNeolithic and Chalcolithic\nBy 8500–7500&nbsp;BC, the Pre-Pottery Neolithic A (PPNA) culture developed out of the earlier local tradition of Natufian, dwelling in round houses, and building the first defensive site at Tell es-Sultan (ancient Jericho) (guarding a valuable fresh water spring). This was replaced in 7500&nbsp;BC by Pre-Pottery Neolithic B (PPNB), dwelling in square houses, coming from Northern Syria and the Euphrates bend.\nDuring the period of 8500–7500&nbsp;BC, another hunter-gatherer group, showing clear affinities with the cultures of Egypt (particularly the Outacha retouch technique for working stone) was in Sinai. This Harifian culture may have adopted the use of pottery from the Isnan culture and Helwan culture of Egypt  (which lasted from 9000 to 4500&nbsp;BC), and subsequently fused with elements from the PPNB culture during the climatic crisis of 6000&nbsp;BC to form what Juris Zarins calls the Syro-Arabian pastoral technocomplex, which saw the spread of the first Nomadic pastoralists in the Ancient Near East. These extended southwards along the Red Sea coast and penetrating the Arabian bifacial cultures, which became progressively more Neolithic and pastoral, and extending north and eastwards, to lay the foundations for the tent-dwelling Martu and Akkadian peoples of Mesopotamia.\nIn the Amuq valley of Syria, PPNB culture seems to have survived, influencing further cultural developments further south. Nomadic elements fused with PPNB to form the Minhata Culture and Yarmukian Culture, which were to spread southwards, beginning the development of the classic mixed farming Mediterranean culture, and from 5600&nbsp;BC were associated with the Ghassulian culture of the region, the first Chalcolithic culture of the Levant. This period also witnessed the development of megalithic structures, which continued into the Bronze Age.\nHistorically, the Bedouin engaged in nomadic herding, agriculture and sometimes fishing in the Syrian steppe since 6000 BC. By about 850 BC, a complex network of settlements and camps were established. The earliest Arab tribes emerged from Bedouins.\nCopper Age\nKish civilization\nThe Kish civilization or Kish tradition is a concept created by Ignace Gelb and discarded by more recent scholarship, which Gelb placed in what he called the early East Semitic era in Mesopotamia and the Levant, starting in the early 4th millennium BC. The concept encompassed the sites of Ebla and Mari in the Levant, Nagar in the north, and the proto-Akkadian sites of Abu Salabikh and Kish in central Mesopotamia, which constituted the Uri region as it was known to the Sumerians. The Kish civilisation was considered to end with the rise of the Akkadian empire in the 24th century BC.\nBronze Age\nEarly and middle Bronze Age\nSome recent scholars dealing with the Syrian part of the Levant during the Bronze Age use Syria-specific subdivision: \"Early/Proto Syrian\" for the Early Bronze Age (3300–2000 BC); \"Old Syrian\" for the Middle Bronze Age (2000–1550 BC); and \"Middle Syrian\" for the Late Bronze Age (1550–1200 BC). \"Neo-Syrian\" corresponds to the Early Iron Age. The Early Syrian period was dominated by the East Semitic-speaking kingdoms of Ebla, Nagar and the Mari. At its greatest extent, Ebla controlled an area roughly half the size of modern Syria, from Ursa'um in the north, to the area around Damascus in the south, and from Phoenicia and the coastal mountains in the west, to Haddu in the east, with more than sixty vassal kingdoms and city-states. Mobile nomadic tribal confederations such as Mardu, Dadanu and Ib'al lived in the steppes to the south of Ebla.\nEbla and Mari were incorporated into the Akkadian Empire by Sargon of Akkad and his successors, until the empire collapsed due to a major climatic event around 2200 BC. This event prompted the influx of nomadic Amorites into Sumer, and correlates with a subsequent influx and settlement expansion in many regions of Syria as well. In the later periods of the Third Dynasty of Ur, immigrating Amorites had become such a force that the king of Ur, Shu-Sin, constructed a  wall dubbed \"Repeller of the Amorites\", extending in between the Tigris and Euphrates, to hold them off. The Amorites are depicted in contemporary records as nomadic tribes under chiefs, who forced themselves into lands they needed to graze their herds. Some of the Akkadian literature of this era speaks disparagingly of the Amorites and implies that the urbanized people of Mesopotamia viewed their nomadic and primitive way of life with disgust and contempt. In the Sumerian myth \"Marriage of Martu\", written early in the 2nd millennium BC, a goddess considering marriage to the god of the Amorites is warned:\n}}\nThe Amorites came to politically and culturally dominate much of the ancient Near East for centuries, and founded multiple kingdoms throughout the region including the Old Babylonian Empire. Famed Amorites included Babylonian king Hammurabi and warlord Shamshi-Adad I. After the decline of the Third dynasty of Ur, Amorite rulers gained power in a number of Mesopotamian city-states beginning in the Isin-Larsa period and peaking in the Old Babylonian period.\nIn southern Mesopotamia, Babylon became the major power under Amorite ruler Sumu-la-El and his successor Hammurabi (c. 1792–1750 BC). In northern Mesopotamia, the Amorite warlord Shamshi-Adad I conquered much of Assyria and formed the large, though short-lived Kingdom of Upper Mesoptamia. In the Levant, Amorite dynasties ruled various kingdoms of Qatna, Ebla and Yamhad, which also had a significant Hurrian population. Mari was similarly ruled by the Amorite Lim dynasty which belonged to the pastoral Amorites known as the Haneans, who were split into the Yaminites (sons of the south) and ''Sim'alites'' (sons of the north) tribes. Another Semitic peoples during this period, the Suteans, inhabited Suhum and were in direct conflict with Mari. The Suteans were nomads famous in epic poetry for being fierce nomadic warriors, and like the Habiru, traditionally worked as mercenaries.\nAmorite elements were also to be found in Egypt with the Fourteenth Dynasty of Egypt of the Nile Delta, whose rulers bore distinctly Amorite names such as Yakbim. The Hyksos, who overran Egypt and founded the Fifteenth dynasty, were an amalgam of Levantine elements including the Amorites.\nForeign rule\nwearing the mushroom-headed hairstyle]]\nBy the 16th and 15th centuries BC, most of the major urban centers in the Levant had been overran and went into steep decline. Mari was destroyed and reduced in a series of wars and conflicts with Babylon, while Yamhad and Ebla were conquered and completely destroyed by Hittite king Mursili I in about 1600&nbsp;BC. In northern Mesopotamia, the era ended with the defeat of the Amorite states by Assyrian kings Puzur-Sin and Adasi between in 1740–1735 BC, and the rise of the native Sealand Dynasty further south. In Egypt, Ahmose I expelled the Levantine Hyksos rulers from power, pushing Egypt's borders further into Canaan. The Amorites were eventually absorbed by another West Semitic-speaking people known collectively as the Ahlamu. The Arameans rose to be the prominent group amongst the Ahlamu, and from c. 1200 BC on, the Amorites disappeared from the pages of history.\nBetween 1550–1170 BC, much of the Levant was contested between Egypt and the Hittites. The political vacuum paved way for the rise of Mitanni, a mixed Semitic and Hurrian-speaking kingdom whose names of the ruling family bore influence from Indo-Aryan languages. Egyptian rule remained strong over the Canaanite-city states in Palestine, facing resistance mainly from pastoral nomadic groups such as the Shasu. The Shasu grew so powerful that they were able to cut off Egypt's northern routes through Palestine and Transjordan, prompting a vigorous punitive campaigns by Ramesses II and his son Merneptah. After Egyptians abandoned the region, Canaanite city-states came under the mercy of the Shasu and the Habiru, who were seen as 'mighty enemies'. Egyptian control over the southern Levant completely collapsed in the wake of the Late Bronze Age collapse.\nLate Bronze Age collapse\nBetween c. 1200–1150 BC, all of these powers suddenly collapsed. Centralized state systems collapsed, and the region was hit by famine. Chaos ensued throughout the region, and many urban centers were burnt to the ground by famine-struck natives and an assortment of raiders known as the Sea Peoples, who eventually settled in the Levant. The Sea Peoples' origins are ambiguous and many theories have proposed them to be Trojans, Sardinians, Achaeans, Sicilians or Lycians.\nUrban centers which survived Hittite and Egyptian expansions in 1600 BC, including Alalakh, Ugarit, Megiddo and Kadesh, were razed to the ground and were never rebuilt. The Hittite empire was destroyed, and its capital Tarḫuntašša was razed to the ground. Egypt repelled its attackers with only a major effort, and over the next century shrank to its territorial core, its central authority permanently weakened.\nIron Age\nDespite the tumultuous beginning of the Iron Age, the period a number of technological innovations spread, most notably iron working and the Phoenician alphabet, which was developed by the Phoenicians around the 11th century&nbsp;BC from the Old Canaanite script, possibly a hybrid of Hieroglyphs, Cuneiform and the mysterious Byblos syllabary. The massive destruction at the end of the Bronze Age collapsed most major polities and city-states of the Bronze Age. The early Iron Age in Syria and Mesopotamia saw a dispersal of settlements and ruralization, with the appearance of large numbers of hamlets, villages, and farmsteads.\nNorth\nFollowing the Late Bronze age collapse, Aramean tribes and kingdoms came to dominate most of present-day Syria and Upper Mesopotamia. The pastoral expansion of the Arameans in upper Mesopotamia quickly brought them into conflict with the Assyrians, whose dominion in upper Mesopotamia consequently came to an end (ca. 1114–1056 BC). Aramean infiltration also extended into southern Mesopotamia, where their presence was felt by cities in central Babylonia as early as the 10th century. Some of the major Aramaean kingdoms included Aram-Damascus, Hamath, Samʾal and  Aram-Zobah (in Syria); and Bet-Adini, Bet-Bagyan, Bet-Zamani and Bet-Halupe (in upper Mesopotamia). In northern Syria, the dispersal of the Hittites and expansion of Aramaeans gave rise to a conglomeration of West Semitic and Anatolian-speaking kingdoms known as the Neo-Hittite states.\nThe Chaldeans, another West Semitic-speaking group from the Levant, infiltrated Babylonia after the Aramaeans (ca. 940–860 BC), where they were actively involved in rebellion against the Assyrians. Assyrian texts of the 9th century BC further mention the Arabs (Aribi), who inhabited swaths of land in the Levant and in Babylonian border region in a similar suit to the Aramaeans, their presence seemingly intermingled. In Laqe near Terqa, a mix of Arab and Aramaean tribes settled the lower Khabur valley in 12th century BC, forming a confederation comparable to other tribal leagues of the time.\nAlong the coast of northern Canaan, the Phoenician city-states managed to escape the destruction that ensued in the Late Bronze Age collapse and developed into commercial maritime powers with established colonies across the Mediterranean Sea. These colonies stretched into Sardinia, North Africa, Cyprus, Sicily, Malta and Iberia. One prominent colony, Carthage (from Punic , meaning 'New City'), would eventually become an independent city-state which quarrelled with the Roman Republic over control of the Mediterranean.\nThe Phoenicians transmitted their alphabetic system across the maritime networks, which was eventually adopted and developed into Greek alphabet and Latin alphabet.\nSouth\nIn the southern Levant, pastoral nomadic tribal groups began to settle down at the start of the 11th century. These included the Israelites in the Cisjordan and the Ammonites, Moabites and Edomites in the Transjordan. The Philistines, a group of Aegean immigrants arrived at the shores of Canaan circa 1175 BC and settled there.\nDuring the seventh century BC, no fewer than eight nations were settled in the southern Levant. These included the Arameans of the kingdom of Geshur; the Samaritans who replaced the Israelite kingdom in Samaria; the Phoenicians in the northern cities and parts of Galilee; the Philistines in the Philistine pentapolis; the three kingdoms of the Transjordan– Ammon, Moab and Edom; and the Judaeans of Kingdom of Judah.\nForeign rule\nUnder Assyrians\nIn the Iron Age, the Levant was characterized by patches of scattered kingdoms and tribal confederations which originated from the same cultural and linguistic milieu. Occasionally, these peoples united against expansion from neighboring regions, notably in the Battle of Qarqar (853 BC) which saw an alliance of Aramaeans, Phoenicians, Israelites, Ammonites and Arabs united against the Assyrians under Shalmaneser III (859–824 BC). The alliance, led by Hadadezer of Aram-Damascus, succeeded in halting the Assyrian army boasting 120,000 soldiers active in Syria.\nBy 843 BC the political situation in central and southern Syria changed radically, after Hazael succeeded Hadadezer as king of Aram-Damascus. The anti-Assyrian alliance dissolved, and former allies of Aram-Damascus turned into enemies. In 842, Hazael invaded the northern parts of the Kingdom of Israel and reportedly penetrated into the coastal planes as far as Asdod, seizing Gilead and eastern Jordan in the process. Hazael survived Assyrian attempts to subjugate Aram-Damascus and also expanded his influence in northern Syria, where he reportedly crossed the Orontes river and seized territories as far as Aleppo. These northern forays allowed Hazael to control much of Syria and Palestine, from Egypt to the Euphrates. Hazael's power far exceeded that of former Aramean kings, and some scholars consider his state to have been a nascent empire.\nThe Assyrians managed to subdue the Levantine states after multiple campaigns that were finalized by Tiglath-Pileser III (745–727 BC). Consolidation of Assyrian rule was followed by numerous revolts throughout the Levant, including division along pro- and anti-Assyrian axes, and intra-Levantine conflict in the Syro-Ephraimite War. The anti-Assyrian axis included Damascus–Tyre–Samaria–the Arabs; and a pro-Assyrian axis which included Arwad, Ashqalon and Gaza joined by Judah, Ammon, Moab and Edom. The anti-Assyrian forces were eventually crushed by 732 BC. Aram-Damascus was annexed and its population was deported; Hamath was razed to the ground and Arameans were prohibited from rebuilding it; the Kingdom of Israel based in Samaria was destroyed and, according to Biblical accounts, the city's population was deported into Assyrian captivity.\nThe fierce resistance and fighting capabilities of the Arameans convinced the Assyrian kings to incorporate them into the army, namely the tribes of Gurru and Itu'u. By the time of Shalmaneser V (727–722 BC), these tribes were an essential part of the empire, and were given the task of securing the empire's peripheries. The Aramaean identity of these tribes probably contributed to the consolidation of Aramaic's prestigious status as the empire's lingua franca.\nUnder Neo-Babylonians\nAfter the Battle of Carchemish, which effectively annihilated Assyrian resistance and Egyptian intervention, Nebuchadnezzar II besieged Jerusalem and destroyed the Temple (597 BC), starting the period of the Babylonian captivity, which lasted about half a century. Nebuchadnezzar also besieged the Phoenician city of Tyre for 13 years (586–573 BC).\nThe subsequent balance of power was, however, short-lived. In the 550s&nbsp;BC, the Achaemenids revolted against the Medes and gained control of their empire, and over the next few decades annexed the realms of Lydia, Damascus, Babylonia, and Egypt into their empire, consolidating control as far as India. This vast kingdom was divided up into various satrapies and governed roughly according to the Assyrian model, but with a far lighter hand. Babylon became one the empire's four capitals, and the lingua franca was Aramaic. Around this time Zoroastrianism became the predominant religion in Persia.\nClassical Age\nHellenistic rule\n]]\nAchaemenid Empire took over the Levant after 539 BC, but by the 4th century the Achaemenids had fallen into decline. The Phoenicians frequently rebelled against the Persians, who taxed them heavily, in contrast to the Judeans who were granted return from the exile by Cyrus the Great. The campaigns of Xenophon in 401-399 BC illustrated how very vulnerable Persia had become to armies organized along Greek lines. Eventually, such an army under Alexander the Great conquered the Levant in 333-332 BC. However, Alexander did not live long enough to consolidate his realm, and soon after his death in 323 BC, the greater share of the east eventually went to the descendants of Seleucus I Nicator. Seleucus built his capital Seleucia in 305 BC, but the capital was later moved to Antioch in 240 BC.\nAlexander and his Seleucid successors founded many poleis in Syria, which were then populated by settled troops and locals. The Seleucids also sponsored Greek settlement from Macedon, Athens, Euboea, Thessaly, Crete and Aetolia in military settlements across northern Syria and Anatolia. It was among these communities that Koine Greek formed and became the standard Greek dialect across the Hellenistic world and the Byzantine empire later on. Use of Koine Greek was largely confined to administration and trade while Aramaic remained the lingua franca in much of the rural areas, whereas Hellenistic urban centers were for the most part bilingual. During the period, Hellenistic culture developed as a fusion of ancient Greek culture and local cultures of Syria, Babylonia and Egypt. The Seleucid kings would also adopt the title 'Basileus (King) of Syria'. Hellenistic settlements established by Alexander and his Seleucid successors in the Levant include:\n*Antioch (the capital of the Seleucid empire)\n*Apamea\n*Decapolis (a league of ten Hellenistic cities)\n*Laodicea\n*Seleucia Pieria\n*Larissa in Syria\n*Cyrrhus\n*Chalcis ad Belum\nThe Greek settlers would be used to form the Seleucid phalanx and cavalry units, with picked men put into the kingdom's guards' regiments. While the Seleucids were happy to recruit from smaller groups and outlying parts of the Empire such as Arabs and Jews, as well as Iranians from Central Asia and the people of Asia Minor; they generally eschewed recruiting Syrians (Arameans) and Babylonians. This was presumably from a desire not to train and arm the people who were an overwhelming majority in the trade and governmental centers of the Empire, in Antioch and Babylon, which would have undermined the empire's very existence in case of revolt. However, recruitment policy would become less strict by time of the Roman–Seleucid war (192–188 BC)\nResurgence of local kingdoms\nThe Seleucids gradually lost their domains in Bactria to the Greco-Bactrian Kingdom, and in Iran and Mesopotamia to the rising Parthian Empire. Eventually, this limited Seleucid domains to the Levant, and the power decline would lead to the formation of several breakaway states in the Levant.\nIn the north, Greco-Iranian satrap Ptolemaeus declared himself the king of Commagene in 163 BC, while the Arab Abgarids ruled Osroene independently since 132 BC. The Maccabean Revolt in Palestine inaugurated the Hasmonean kingdom in 140 BC. The Nabataeans further south had maintained their kingdom since the 3rd century BC. This rendered the Seleucids a weak, vulnerable state limited to parts of Syria and Lebanon.\nRoman period\nThe Romans gained a foothold in the region in 64 BC after permanently defeating the Seleucids and Tigranes. Pompey deposed the last Seleucid king Philip II Philoromaeus, and incorporated Syria into Roman domains. However, the Romans only gradually incorporated local kingdoms into provinces, which gave them considerable autonomy in local affairs. The Herodian Kingdom of Judea replaced the Hasmonians in 37 BC until the full incorporation of Judea as Provincia Iudaea in 44 AD after Herod Agrippa II. Commagene and Osroene were incorporated as Roman provinces in 72 and 214 AD respectively, while Nabatea was incorporated as Arabia Petraea in 106 AD.\nBetween the 1st and 3rd centuries the Levant prospered and flourished, reaching an estimated population of 3.5 to 6 million, which were only later matched by those of the 19th century. Urban centers peaked, and so did population density in the rural settlements. Antioch and Palmyra each reached a peak of 200,000–250,000 inhabitants, while Apamea counted 117,000 'free citizens' in AD 6. Combined with the dependencies and villages as well as slaves, Apamea may have, in fact, counted as high as 500,000. The Syrian Coastal Mountain Range, a marginal hill country, was less densely settled and had a population of around 40–50,000. According to Robert Kennedy, Palestine and the Transjordan accounted for roughly 800,000–1,200,000 of the population. The first to second centuries saw the emergence of a plethora of religions and philosophical schools. Neoplatonism emerged with Iamblichus and Porphyry, Neopythagorianism with Numenius of Apamea, and Hellenic Judaism with Philo of Alexandria. Christianity initially emerged as a sect of Judaism and finally as an independent religion by the mid-second century. Gnosticism also took significant hold in the region.\nThe region of Palestine or Judea experienced abrupt periods of conflict between Romans and Jews. The First Jewish–Roman War (66–73) erupted in 66, resulting in the destruction of Jerusalem and the Second Temple in 70. Province forces were directly engaged in the war; in 66 AD, Cestius Gallus sent the Syrian army, based on Legio X Fretensis and Legio XII Fulminata reinforced by vexillationes of IV Scythica and VI Ferrata, to restore order in Judaea and quell the revolt, but suffered a defeat in the Battle of Beth Horon. However, XII Fulminata fought well in the last part of the war, and supported its commander Vespasian in his successful bid for the imperial throne. Two generations later, the Bar Kokhba revolt (132–136) erupted once again, after which the province Syria Palaestina was created in 132.\nDuring the Crisis of the Third Century, the Sassanids under Shapur I invaded the Levant and captured Roman emperor Valerian in the Battle of Edessa. A Syrian notable of Palmyra, Odaenathus assembled the Palmyrene army and Syrian peasants, and marched north to meet Shapur I. The Palmyrene monarch fell upon the retreating Persian army between Samosata and Zeugma, west of the Euphrates, in late summer 260, defeating and expelling them. After eliminating Roman usurpers in Syria –Balista and Quietus– in 261, Odaeanathus penetrated the Sassanid province of Asōristān in late 262 and laid siege to the Sassanid capital, Ctesiphon in 263. However, logistical problems meant the siege could not continue for long, and soon after Odaenathus broke the siege and brought numerous prisoners and booty to Rome. After his return, Odaenathus assumed the title of King of Kings of the East (Mlk Mlk dy Mdnh / Rex Regum). Odaenathus was succeeded by his son Vaballathus under the regency of his mother Queen Zenobia. In 270, Zenobia detached from Roman authority and declared the Palmyrene Empire, rapidly conquering much of Syria, Egypt, Arabia Petraea and large parts of Asia Minor, reaching present-day Ankara. However, by 273, Zenobia was decisively defeated by Aurelian and his Arab Tanukhid allies in Syria.\nByzantine period\nFollowing the permanent division of the Roman Empire in 391, the Levantine provinces became part of the Byzantine Empire. In the southern Levant, a newly established foederati were crystallizing, the Ghassanid Arabs. The Ghassanids became a client state of the Byzantines, and served as a bulwark against Sassanid incursions and raids by nomads. With the consolidation of Christianity, Jews had become a minority in southern Levant, remaining a majority only in Southern Judea, Galilee and Golan. Jewish revolts had also become much rarer, mostly with the Jewish revolt against Constantius Gallus (351–352) and Jewish revolt against Heraclius (617). This time the Samaritans, whose population swelled to over a million, insurrected the Samaritan revolts (484–572) against the Byzantines, which killed an estimated 200,000 Samaritans, after the civil uprising of Baba Rabba and his subsequent execution in 328/362.\nThe devastating Byzantine–Sasanian War of 602–628 ended with Byzantine recapture of the land, but left the empire rather exhausted, which taxed the inhabitants heavily. The Levant became the frontline between the Byzantines and the Persian Sassanids, which devastated the region. The war triggered the displacement of many inhabitants from Syria and Palestine to Egypt, and from there to Carthage and Sicily, although archaeological evidence suggests smooth continuity and little displacement of the overall population.\nMuslim conquest and period\nEastern Roman control over the Levant lasted until 638 when Arab armies conquered the Levant, after which it became a part of the Rashidun Caliphate and was known as Bilād ash-Shām.\nUnder the Umayyads, the capital was moved to Damascus. However, the Levant did not experience wide-scale Arabian tribal settlement unlike in Iraq, where the focus of Arabian tribal migration was. Archaeological and historical evidence strongly suggest there was smooth population continuity and no large-scale abandonment of major sites and regions of the Levant after the Muslim conquest. Moreover, in contrast to Iran, Iraq and North Africa, where Muslim soldiers established separate garrison cities (amsar), Muslim troops in the Levant settled alongside locals in pre-existing cities such as Damascus, Homs, Jerusalem and Tiberias. The Umayyads also relied on the native Syrian Arab tribes for their military, who oversaw a recruitment policy that resulted in considerable numbers of tribesmen and frontier peasants filling the ranks of the regular and auxiliary forces. These were Arab tribes who inhabited the Levant before Islam, and included tribes such as Lakhm, Judham, Ghassan, Amilah, Balqayn, Salih and Tanukh. When the Abbasids moved the capital to Baghdad in 750, this exposed the Muslim Arabs to the challenge of the strong and well-articulated identity of Iran, whereas in Damascus, they had only to contend with the numerous parochial and fractured identities of the Levant.\nAbbasid focus on Iraq and Iran neglected the Levant, which in turn experienced a period of frequent uprisings and revolts. Syria became fertile grounds for anti-Abbasid sentiments, in various contrasting pro-Umayyad and pro-Shiite forms. In 841, al-Mubarqa ('the Veiled One') lead a rebellion against the Abbasids in Palestine, declaring himself the Umayyad Sufyani. In 912, a revolt against the Abbasids arose in the Damascus region, this time by an Alid descendant of tenth Shiite Imam Ali al-Hadi. The growing Isma'ili dawah moved to the town of Salamiyah as its headquarters in 765, binding missionaries over to Iraq, Khuzestan, Yemen, Egypt and Maghreb. From Salamiyah, Isma'ili Imam Abd Allah al-Mahdi Billah moved to Sijilmasa in Morocco in 904, where his missionaries were active in proselytizing Berber tribes, eventually establishing the Fatimid empire by 909.\nSee also\n* Names of the Levant\n*History of the Middle East\n*List of archaeological periods (Levant)\n* Ancient Near East\n*Levantine archaeology\n*Near Eastern bioarchaeology\n* History of the ancient Levant\n** History of Cyprus\n** History of Palestine – same as \"History of Israel\", with a non-Jewish focus\n** History of Israel i.e. of the \"land of Israel\" – same as \"History of Palestine\", with a Jewish focus\n*** History of ancient Israel and Judah\n** History of Jordan\n** History of the Sinai Peninsula\n** Prehistory of the Levant\n*History of Islam\nReferences\nNotes\ntags-->\nGeneral references\n* Philip Mansel, Levant: Splendour and Catastrophe on the Mediterranean, London, John Murray, 11 November 2010, hardback, 480 pages, , New Haven, Yale University Press, 24 May 2011, hardback, 470 pages,\nExternal links\n* [http://ancientneareast.tripod.com/Levant.html The History of the Ancient Near East]"
    }
  ]
}