{
  "content": [
    {
      "type": "text",
      "text": "# Historical configuration of the province of Granada\n\n| type                   = Province\n| image_skyline          =\n| image_alt              =\n| image_caption          =\n| image_flag             = Bandera de la provincia de Granada (España).svg\n| flag_size              =\n| flag_alt               =\n| image_shield           = Coat of Arms of Granada Province.svg\n| shield_size            =\n| shield_alt             =\n| motto                  =\n| anthem                 =\n| image_map              = Granada in Spain.svg\n| map_alt                =\n| map_caption            = Map of Spain with Granada highlighted\n| pushpin_map            =\n| pushpin_map_caption    =\n| coordinates            =\n| coordinates_footnotes  =\n| subdivision_type       = Country\n| subdivision_name       = Spain\n| subdivision_type1      = Autonomous community\n| subdivision_name1      = Andalusia\n| established_title      =\n| established_date       =\n| seat_type              = Capital\n| seat                   = Granada\n| government_type        =\n| government_footnotes   =\n| leader_party           = PSOE\n| leader_title           = President\n| leader_name            = José Entrena Ávila\n| area_footnotes         =\n| area_total_km2         = 12531\n| area_rank              = Ranked 15th\n| area_note              =\n| elevation_footnotes    =\n| elevation_m            =\n| blank_name_sec1        = Official language(s)\n| blank_info_sec1        = Spanish\n| population_footnotes   =\n| population_total       = 921987\n| population_as_of       = 2021\n| population_rank        = Ranked 17th\n| population_density_km2 = auto\n| population_demonym     = English: Granadin\n| population_note        =\n| blank_name_sec2        = Parliament\n| blank_info_sec2        = Cortes Generales\n| blank1_name_sec2       = Congress seats\n| blank1_info_sec2       =\n| blank2_name_sec2       = GDP\n| blank2_info_sec2       =\n| blank3_name_sec2       = GDP (per capita)\n| blank3_info_sec2       =\n| time_zone              =\n| utc_offset             =\n| time_zone_DST          =\n| utc_offset_DST         =\n| timezone1              =\n| utc_offset1            =\n| timezone1_DST          =\n| utc_offset1_DST        =\n| postal_code_type       =\n| postal_code            =\n| area_code_type         =\n| area_code              =\n| website                = [http://www.dipgra.es/ dipgra.es]\n| footnotes              =\n}}\n|300x300px]]\nsince 1587, in Plaza Nueva.|300x300px]]\nThe current configuration of the province of Granada is the result of a long process of territorial organization that reached its culmination in 1833, by means of the decree of provincialization promulgated by Javier de Burgos, Ministry of Development of the government of the regent Maria Christina of Bourbon. Until that date, what now constitutes the province of Granada was integrated within the limits of the so-called Kingdom of Granada.\nIt is necessary to go back to the Kūra of Elvira and the Zirid Taifa of Granada as the most significant precedents of what later became the Nasrid Kingdom of Granada, assimilated by the Crown of Castile after the end of the Reconquest (1492). However, it was in the transition from the authoritarian monarchy of the Habsburgs to the absolutist monarchy of the Bourbons that the territorial organization of the State became a recurring theme of great political importance. The absolutist conception of the state encouraged the development of a series of projects, either of a liberalism or conservative nature, which would replace the old historical kingdoms of the Reconquest with the modern Spanish provinces.\nThe former Kingdom of Granada will be an important part of this process, given the imbalance of its superficial extension with respect to other provinces and its internal heterogeneity, which made its supervision and administration by the central state very difficult. Thus, already in 1799 the Maritime Province of Malaga was created, which grouped the districts of the western part of the kingdom around the clear capital of Malaga, with a population of some 50,000 inhabitants in those years. In the other provincializing projects, the capital of Malaga was a constant tonic.\nThe size of the Kingdom of Granada was still quite disproportionate and in the constitutional project of Bauzá (1813) a dialogue began on the need to constitute a province in the easternmost part of the kingdom. On this occasion neither the capital nor the demarcation of both provinces could be as obvious a question as it had been in the case of Malaga. The options of Guadix and Baza as capitals of the new province were considered, but finally, in the provincialization of Cortes of 1822, the option of Almería was chosen and the border shifted to the east, thus including the high plateaus of Guadix and Baza-Huéscar in the province of Granada. Thus, the provincial division of 1822 was repealed by the restoration of absolutism in 1823, the territory of the former kingdom of Granada was divided into three provinces, leaving the province of Granada with its boundaries practically defined in its current state, only nuanced with the subsequent and final provincialization of Javier de Burgos from Motril (1833).\nBackground\n, with the Border of Granada.|300x300px]]\naround 1590.|300x300px]]\n.|300x300px]]\nAlthough there were earlier territorial circumscriptions, such as the Kūra of Elvira, which became the Taifa of Granada with the decomposition of the Caliphate of Cordoba in 1031, the birth of the Nasrid Kingdom of Granada can be dated back to 1232, when Yusuf ben Nasri 'Alhamar' proclaimed himself Sultan of Granada.\nThe area of the Kingdom was about 34,000 km2, somewhat larger than the 27,000&nbsp;km2 that the Christian Kingdom of Granada would be configured after the Reconquest. The Emirate or Sultanate of Granada extended over the entirety of the current provinces of Granada, Malaga and Almeria, in addition to border areas of the provinces of Jaen and Cadiz.\nThe frontier between the Crown of Castile and the kingdom of Granada was formed by a complicated defensive-offensive system, established by the Pact of Jaén and characterized by the construction of fortifications parallel to the natural limit of the Baetic System, with the exception of the Sierra de Cazorla and Segura, where the Adelantamiento de Cazorla and the Encomienda de Segura de la santiaguista were located, respectively, which formed the outpost of the territories of the Crown of Castile.\nThe extension of the Kingdom of Granada after the Reconquest was reduced to what today are the provinces of Malaga, Granada and Almeria, except for the district of Antequera and the current municipalities of Sierra de Yeguas, Alameda and Cañete la Real, which belonged to the old Kingdom of Seville, where the first two were included in the district of Estepa and the last one in the district of Osuna. On the other hand, the towns of Puebla de Santa María (El Bosque), Setenil, Grazalema, Villaluenga del Rosario, Benaocaz, Ubrique and Alcalá del Valle, today in the province of Cádiz, and those of Sill plate and Bélmez de la Moraleda, which are currently integrated in the province of Jaén, were part of the Kingdom of Granada.\nThis demarcation was only administrative and fiscal, since the kingdom of Granada, incorporated into the Crown of Castile, did not have any type of attribution over its limits or political capacity for autonomous action or decision, beyond municipal life and the vote in Cortes. The territory was divided into zones or partitions for the collection of rents and extraordinary rights for the Crown, in some cases based on the existing ecclesiastical circumscriptions. Thus, the following demarcation was carried out:\n# The city of Granada with the parties of the alcaicería, the major and minor rents, the cattle corral, the tithes and Alquería, the Renta de la seda de Granada, the rents of the Alpujarras, Almuñécar, Salobreña and Motril.\n# Judicial district of Baza.\n# Judicial district of Guadix.\n# Malaga and its bishopric\n# Almeria and its bishopric.\nAnother form of collection of extraordinary tributes –destined to military expenses– were the brotherhoods that had an important development in the 16th century. The numerous enterprises that Charles I and later Philip II undertook provoked a slight attempt at territorial organization capitalized in the 17 cities that were represented in the Cortes. In 1591, a compilation of goods was carried out –known as the Census of Tomás González–, where Granada appears as a city with representation in Cortes –it will be the 18th city– and it will centralize the \"province\" of the Kingdom of Granada in the collection of taxes among its different cities, villas, places and villages that conformed it.\nIn the early Modern Age, there was no single criterion for the determination of the regional entities within the Crown of Castile: Lucio Marineo Sículo (1500), when distinguishing the different Spanish provinces, followed the Roman provincialization, while Pedro de Medina (1548) made another classification, in which the Kingdom of Granada was differentiated from Andalusia. The creation of the Captaincy General of Granada and the definitive installation as the Royal Chancellery of Granada of the previous Royal Court and Chancellery of Ciudad Real (1505), whose jurisdiction included all the territory south of the Tagus River –to the north it was the jurisdiction of the Royal Court of Valladolid–, indicates that neither from the political-administrative point of view was there any intention of carrying out any type of regional integration –an anachronistic concept for the time– that specifically associated the Kingdom of Granada with the Andalusia of the Guadalquivir. In 1525 the Real Audiencia de los Grados de Sevilla was created, with a lower level of jurisdiction.\nIllustrated reforms\nThe Bourbon dynasty established with the War of the Spanish Succession (1700–1715) was accompanied by a generalized reformist air throughout the 18th century, known as the Enlightenment period. The complex organization of the territory inherited from the Habsburg and the long medieval processes of reconquest and repopulation was archaic and irrational in many aspects, disproportionate and clearly insufficient for an absolute monarchy with increasing economic needs. Among the reforms undertaken was the realization of a statistical study that made it possible to quantify the country's resources and therefore facilitated their control and exploitation: the Catastro of Ensenada (1749), in which the 22 provinces of the Crown of Castile, including the Kingdom of Granada, were registered. In the same year, King Ferdinand VI reorganized the system of intendant, assigning one to each province, together with the corregidor of the capital (positions that were separated again in 1766). Each intendant would be assisted by a subordinate lieutenant or Alcalde mayor for the exercise of judicial functions.\nThe process of provincialization was also a tonic in this enlightened phase that will conclude with the project of Javier de Burgos in 1833. It is from this date, precisely when the provinces that will emerge from the former Kingdom of Granada will be conceived as part of a regional entity called Andalusia, along with the provinces of the Guadalquivir. La lejanía a los centros políticos de la meseta castellana, las distantas formas de repoblación con respecto an ella y el origen de la repoblación del reino granadino, serían algunas de las causas de la inclusión del antiguo Reino de Granada en los límites territoriales de ese nuevo concepto geográfico; que, no obstante, se limitó a la agrupación nominal de las ocho provincias y a su asociación en los mapas, y no implicó la creación de ninguna institución común ni coordinación provincial, ambas cosas completamente ajenas al propósito de la división provincial.\nFloridablanca Census (1789)\nAn example closer to the reformist period of the 19th century is the Census of Floridablanca. The project was conceived by the Count of Floridablanca, who in 1785 asked each of the intendants for a list of data on the territorial and civil organization and the jurisdictional division of their respective districts. This information gave rise to the publications of Spain divided into Provinces and Intendencies and what we know as ''Floridablanca's Gazetteer'' in 1789. The new provincial configuration did not bring great modifications in the provincial demarcation, but it did provide a better knowledge of the territory that facilitated the future provincial divisions. The main shortcomings found were: the great contrasts in the extension of the provinces as well as their spatial discontinuity forming numerous enclaves and exclaves. In addition, there was great complexity in terms of internal subdivisions and denominations.\nSpain was configured in 31 provinces or intendant that could be grouped statistically in 5 large blocks according to their internal complexity. The province of Granada was a clear example of disproportionate surface area with respect to other provinces of much smaller size. It was included in Group B –provinces with a single internal subdivision–, composed of 20 districts or partidos.\nMaritime province of Malaga (1799)\nBy the Royal Decree of 25 September 1799 –ratified by Royal Order of 22 January 1801 under the reign of Charles IV–, six new maritime provinces were created: Cadiz, Malaga, Santander, Alicante, Cartagena and Asturias. To these must be added the ephemeral Province of Sanlúcar de Barrameda, which was created in 1804.\nThese maritime provinces corresponded to coastal areas with a population center that had a port and that could provide a backbone for the adjacent territory and promote the development of the coastal areas of the peninsula. Another requirement was that the province from which they were separated should be extensive and also distant from the capital or separated by a mountainous feature.\nIn the case of the Kingdom of Granada, these characteristics were clearly met by Malaga, which was instituted as a maritime province. Malaga had a population of around 50,000 inhabitants and its communication with Granada was quite difficult. Although it never had an intendant due to the pressures exerted from Granada, as was the case with the rest of the metropolitan centers and their maritime provinces. However, these will serve as the basis for future provincializations, in which Malaga –in almost all cases– will be considered the provincial capital.\nNapoleonic Reforms: Llorente-Lanz Project (1809–1810)\nA more profound restructuring process of the territory began in 1809, thanks to the political changes that arose in 1808 with the abdication of Charles IV and Ferdinand VII in favor of Joseph Bonaparte, turning Spain into a satellite state of the Napoleonic Empire.\nThe territorial division in Spain at that time was unfeasible for the exploitation of the country by the Napoleonic administration, so it was thought of a new restructuring of the territory that would leave behind the historical conditions of the different territories and eliminate the divisions that hindered the administration such as enclaves and exclaves.\nThus, in 1809, the Riojan clergyman and politician Juan Antonio Llorente undertook the task, based on geographical features, and designed a distribution in departments, following the French model, to which he gave a nomenclature of geographical features –rivers and capes–. Each department would be endowed with a university, an audience and a diocese. In the case of the kingdom of Granada, once again it was divided into two departments with the nomenclature of rivers: Salado –with its capital in Malaga– and Genil –with its capital in Granada–.Llorente's project was approved without problems with the changes made by José María de Lanz y Zaldíbar, who completed the project, taking Llorente's departmental division as a model and, by virtue of the Decree of 17 April 1810 –signed in the Real Alcázar of Seville–, established a number of 38 prefectures, this time giving priority in the nomenclature to the name of the capital and the subdivision into three sub-prefectures as a general rule.\nEach prefecture consisted of a prefect, a Prefectural Council and a General Prefectural Board. In turn, the sub-prefectures were composed of the sub-prefect and the General Board of Sub-prefecture.\nThe province of Granada, thus defined, was part of the Prefecture of the same name, together with the current province of Almería, except for part of the district of Baza –Huéscar, Castril, Vélez Blanco and Vélez Rubio– and the extreme southeast –the border was located at the Almanzora River– which belonged to the Prefecture of Segura –currently Murcia–. The Prefecture of Granada extended over an area of 17,851&nbsp;km2 and was in turn subdivided into the sub-prefectures of Granada, Baza and Almería. On the other hand, the current province of Malaga, previously part of the Kingdom of Granada, was part of the Prefecture of Salado. Its delimitation included the district of Osuna and did not include the district of Ronda, included in the Prefecture of Guadalete –current province of Cadiz–.\nThis reform only existed on paper and after the French defeat at the end of the War of Independence it fell into oblivion and contempt.\nConstitutional reforms\nThe Constitution drawn up by the Cortes de Cádiz (1812) mentions which were the Spanish territories and states the need to carry out a new and more convenient division of the same.\nThe Provincial Administration was based on more solid criteria. Until now, it was basically an instrument of control, but by means of article 335, the Provincial Deputation were to be given a series of competencies such as the distribution of contributions, the supervision of infractions of the Constitution, the provincial census and statistics, the establishment of the constitutional City Councils, etc. It was headed by a Superior Chief, appointed by the King. This new position, which also served as Government Delegate, assumed the competencies of public order and executive power and served as liaison between the Town Councils and the Deputation.\nThis was intended to eliminate the heterogeneous, unequal, unbalanced and unequal territorial structure of regional privileges that had existed until then.\nRanz-Espiga Project (1812)\nThe proposal on what should be the constitutional provinces was elaborated by Antonio Ranz and José de Espiga (1812), leaving the Spanish territory organized in 21 constitutional provinces. One of them was Granada, which kept the same boundaries as the Kingdom in 1789, against the trend of breaking the identity of the former great kingdoms.\nThe proposal to carry out the new territorial reorganization of Granada was formulated by the Granada Provincial Council in agreement with the Royal Chancellery and was sent to the King on 7 July 1813. Although the provincial boundaries were again very similar to those that existed at the end of the 18th century, the most significant change was the incorporation of the districts of Antequera and Archidona, whose borders followed the current boundary of the provinces of Malaga and Cordoba to Fuente de Piedra, excluding the towns of Teba and Campillos, Alameda, Peñarrubia, Sierra de Yeguas, Ardales, Almargen and Cañete la Real. The internal division into partidos did vary significantly from the one in force in the middle of the 18th century, from 20 to 35.\nBauzá Project (1813): Guadix as a subaltern governorate\n(1764–1834) geographer and politician who took part in the provincialization project of 1812 and 1821.]]\nIn June 1813, the Regency presided over by Don Luis de Borbón entrusted, through the Government, the preparation of the new division to Felipe Bauzá, who on 21 September 1813 established three types of provinces:\n# Provinces of the first order: those that included subaltern parties or governorates. One of them was Granada, which incorporated the party of Guadix.\n# Second order provinces: those that lacked internal subdivision.\n# Parties or governorates: these were each of the subdivisions of the first order provinces. Guadix was a partido of the first order province of Granada.\nFinally, the division was divided into 44 provinces, under criteria of historical tradition and equitable distribution of population: each province was intended to have at least 250,000 inhabitants.\nThe province of Granada, then equivalent to the current provinces of Granada and Almería, was projected to be divided into two governorates: an upper one capitalized in Granada and a lower one centered in Guadix, setting its limits in the Fardes River, in the Sierra Nevada and in the Adra River. Despite the eccentricity of the capital with respect to the territory, it was not a problem due to its strategic location at the confluence of the roads between Baza, Granada and Almeria.\nAlthough the Council of State reported favorably on the project and the Ministry of the Interior submitted it to the Cortes, the discussion process did not begin, as the restoration of Ferdinand VII (1814) soon derogation the Constitution and dissolved the Cortes.\nDivision of Cortes (1822): Almeria is born as a province\nDuring the absolutist six-year period of Ferdinand VII (1814–1820), the liberal reformist current came to a standstill, returning to the conservatism of the Ancien Régime. After this period, during the Liberal Triennium (1820–1823), the question of the territorial organization of the Spanish state did not take long to return to the political arena. Once again, Felipe Bauzá from La Rioja was in charge of the technical work, on this occasion with the collaboration of José Agustín de Larramendi from Guipuzcoa.\nOn 14 January 1822, the new provincial division of the state was established, concluding the parliamentary procedures of the project initiated in 1821. Spain was divided into 52 provinces in the face of protests from cities whose rank in the traditional organization was higher, such as Barcelona, Santiago and Granada.\nIn the case of the province of Granada, segregation was once again chosen, based on criteria of population and territorial extension. The western part of the former Kingdom of Granada found a clear capital in Malaga, which had consolidated its position since 1799.The problem was in the eastern part. In the first instance, the Bauzá-Larramendi project contemplated Baza as the capital, comprising the province of Almería and the highlands of Guadix, Baza and Huéscar. Two problems arose in the face of this proposal: the outright refusal of the deputies from Granada and the opposition from Almería, which wanted to opt for the capital. Finally, the commission created by the Cortes agreed to the pressure from Granada, and an agreement was reached whereby the province of Granada would retain the highlands and Almería would acquire the rank of provincial capital, thanks to its coastal location, larger population and its distance from Granada.\nThe dismemberment of the old Kingdom of Granada was a fact and the three separated provinces would never again be included within the same provincial boundaries. The province of Granada from then on would be configured with boundaries very similar to those it has today:\n* The limit with the province of Almería would be fixed in the Adra River, so the homonymous locality would be incorporated to the province of Granada. In the Alpujarra, Válor is for Granada and Ohanes for Almería. Further north are taken as limits the Sierra de Baza, Oria, Maria and Periate to reach the province of Murcia.\n* On the border with the province of Malaga, the municipalities of Zafarraya and Ventas de Zafarraya were incorporated into the province of Malaga.\n* The main differences with the current province were in the north, where the border with the province of Jaén advanced considerably towards the south. Thus the municipalities of Alamedilla, Alicún de Ortega, Dehesas de Guadix, Fonelas, Gobernador, Guadahortuna, Huélago, Laborcillas, Moreda, Pedro Martínez and Villanueva de las Torres were included in Jaén; on the contrary the municipality of Pozo Alcón was included in Granada.\nBourbon Restoration\nThe definitive restoration of the absolutist monarchy of Ferdinand VII put an end once again to the administrative demarcation approved during the Trienio Liberal. However, the territorial policy of provincial division was a fact and the new policy of the ministers of the monarchy would follow the line marked by the liberal period.\nCalomarde Project (1829)\nIn 1825, Tadeo Calomarde-minister of justice–created a new ministerial commission to study the provincial judicial demarcation, minor courts and major mayor's offices, as well as the establishment of provincial boundaries. Agustín de Larramendi was again in charge of directing the project. This time, the limits of the old kingdoms were respected, unlike his precedent.\nBefore the approval of the project, Tadeo Calomarde wanted to consult the affected chanceries. On 31 March 1829, instructions were sent to the Royal Court and Chancellery of Granada for the drawing up, by the latter, of the territorial limits between the nine provinces of its district: Granada, Almería, Málaga, Jaén, Córdoba, Murcia, Cuenca, Albacete and La Mancha. The complex task required the participation of the local authorities; thus, the city councils of the nine provincial capitals would participate in the project. The delimitation criteria were to be based on population volume, geographic location, distances, natural divisions, mutual relations, among others.The Chancellery of Granada, on 30 September 1829, put on the table its work with the division of the nine provinces that corresponded to its jurisdiction. In its proposal, the province of Granada incorporated the following changes:\n* Incorporate the district of Laujar, belonging to the province of Almería, so that the Alpujarra would be entirely within a single province.\n* Adra would become part of Almería.\n* The area of Zafarraya, would remain within the party of Alhama and therefore of the province of Granada.\n* The municipality of Iznájar, belonging to Córdoba, would be incorporated into the district of Algarinejo.\n* On the border with Jaén, the municipalities of Montejícar, Guadahortuna, Pedro Martínez and Fonelas, included in Jaén in the previous proposal, would pass again to the province of Granada (within the Partido de Colomera, where Pozo Alcón (within the Partido de Baza) would also be maintained.\nThe province of Granada, therefore, was divided into 16 partidos, subdivided in turn into 54 corregimientos or alcaldías mayores (between 2 and 4 per partido, although Granada was made up of 9). The province underwent some changes between the party boundaries to solve problems of cohesion between the different parties.\nProject of De Burgos (1833): current province of Granada.\n(1778–1849) Spanish politician and architect of the provincialization project of 1833.|241x241px]]\nThe death of Ferdinand VII in 1830 gave a new impulse to the projects of territorial organization of Spain. In the last action of 1829, emphasis was placed on localist aspects, losing in part a broader sense than that of mere provincialization. In 1833, Minister Javier de Burgos, by means of the Royal Decree of 30 November 1833, definitively culminated the process of provincial division. The boundaries of the provinces have remained practically unchanged since then. The project was based on the provincialization of the Cortes of 1822.\nThe provincial division was accompanied by the judicial demarcation, carried out by the Royal Decree of 21 April 1834, based on the studies directed by Calomarde.\nEvolution of the judicial districts\nThe judicial division soon became a basic element of state organization, since it became the frame of reference in the administration of justice. Proof of its success was the stability of its delimitation practically until the reform of 1965.\nThe new administration of justice entailed important changes with respect to the legal process and the Real Audiencia. Between the period of 1834 and 1841 some 1,200 claims were made for changes in their delimitation. In 1842 a new project of provincial delimitation was even chosen, where the province of Granada incorporated the party of Priego de Córdoba, however, stability was chosen and the project of Fermín Caballero did not succeed.\nDue to demographic changes and other consequences, there have been several modifications in the configuration of the judicial districts in the province of Granada:\nChanges between 1834 and 1965:\n* 1857: Algarinejo and Zafarraya were integrated into the Partido de Loja.\n* 1877: Cádiar and Narila passed from Albuñol to Ugíjar.\nChanges as of Decree 3388 of 11 November 1965:\n* Integration of the district of Huéscar into the district of Baza.\n* Integration of the districts of Iznalloz and Santa Fe into that of Granada.\n* Integration of the districts of Montefrío and Alhama into the judicial district of Loja.\n* Integration of the districts of Albuñol and Ugíjar into that of Órgiva.\n* At the municipal level, Padul was transferred from Órgiva to Granada.\nThus, the judicial districts were reduced to those of Loja, Granada, Guadix, Baza, Órgiva and Motril.\nChanges as of Law 38/1988, of 28 December 1988, of Demarcation and Judicial Plant:\n* Recovery of those of Huéscar and Santa Fe although the territory of the latter was greatly reduced.\n* The coastal sector of the District of Órgiva was transferred to Motril and the Valle de Lecrín to Granada.\nChanges after Law 3/1992 of 21 March:\n* The Judicial district of Almuñécar is created, which is segregated from that of Motril.\nTherefore, the province of Granada is currently divided into 9 districts: Loja, Santa Fe, Granada, Guadix, Baza, Huéscar, Almuñécar, Motril and Órgiva.\nMunicipal configuration\nBased on the Dictionary of Pascual Madoz, the province of Granada was comprised in 1843 by 204 municipalities, which at present have been reduced to 174 in a very complex process of segregation and integration that we try to summarize in the following tables. It should be added that the municipal limits are practically configured in the illustrated period, so it is not very complex to go back in time and be able to follow the changes produced.\nMunicipal segregations\nThe creation of new municipalities usually corresponds to the segregation of parts of pre-existing municipalities. Most of the cases correspond to large municipalities that have population centers far from the municipal capital. These are the cases of Játar, Domingo Pérez de Granada, Dehesas Viejas, La Rábita, Valderrubio, Zagra, Deifontes, Cuevas del Campo or Píñar. In other cases, these segregations were fleeting as they returned to their municipality of origin over the years. This process was preferably located in mountainous areas with small municipalities: Cherín, Lobras and Ventas de Zafarraya.\n{| class=\"wikitable\"\n| colspan=\"4\" |\n|-\n|Segregated municipality\n|Date\n|Parent municipality\n|Location\n|-\n|Zafarraya\n|1815\n|Alhama de Granada\n| rowspan=\"12\" |\n|-\n|Lobras\n|1834\n|Salobreña\n|-\n|Píñar\n|1835\n|Iznalloz\n|-\n|Agrón\n|1835\n|Ventas de Huelma\n|-\n|Montillana\n|1836\n|Colomera\n|-\n|Ventas de Zafarraya\n|1842\n|Zafarraya\n|-\n|La Rábita\n|1843\n|Albuñol\n|-\n|Lobras\n|1853\n|Motril\n|-\n|Deifontes\n|Between 1843 and 1857\n|Iznalloz\n|-\n|Cherín\n|Between 1925 and 1930\n|Ugíjar\n|-\n|Cuevas del Campo\n|1980\n|Zújar\n|-\n|Zagra\n|1987\n|Loja\n|-\n|Valderrubio\n|2013\n|Pinos Puente\n|-\n|Dehesas Viejas\n|2014\n|Iznalloz\n|-\n|Játar\n|2015\n|Arenas del Rey\n|-\n|Domingo Pérez de Granada\n|2015\n|Iznalloz\n|-\n|Fornes\n|2018\n|Arenas del Rey\n|-\n|Torrenueva Costa\n|2018\n|Motril\n|}\nMunicipal aggregations\nThe disappearance of municipalities is mainly due to the assimilation of the disappeared municipalities by other pre-existing ones. The absorbed municipalities are usually sparsely populated and therefore have little capacity for political management. Practically all of the numerous cases are located in mountainous areas: Alpujarra, Sierra de Alhama and Montes de Granada. The receiving municipalities are usually county seats or important municipalities in their immediate surroundings. Examples of this fact are Iznalloz, Órgiva, Pedro Martínez or Alhama de Granada.\n{| class=\"wikitable\"\n| colspan=\"4\" |\n|-\n|Aggregate municipality\n|Date\n|Aggregation municipality\n|Location\n|-\n|Uleilas Bajas\n|Between 1843 and 1857\n|Pedro Martínez\n| rowspan=\"19\" |\n|-\n|Lobras\n|1845\n|Motril\n|-\n|Lobras\n|1853?\n|Molvízar\n|-\n|Castell de Ferro\n|1858\n|Gualchos\n|-\n|Cherín\n|1901\n|Ugíjar\n|-\n|Bayacas\n|Between 1925 and 1930\n|Órgiva\n|-\n|Cojáyar\n|Between 1925 and 1930\n|Murtas\n|-\n|Mecina Tedel\n|Between 1925 and 1930\n|Murtas\n|-\n|Pulianillas\n|1944\n|Pulianas\n|-\n|Nechite, Mecina Alfahar\n|1943\n|Válor\n|-\n|Trujillos\n|1967\n|Montillana\n|-\n|Caparacena\n|1972\n|Atarfe\n|-\n|Cherín, Jorairátar\n|1972\n|Ugíjar\n|-\n|Dehesas Viejas\n|1972\n|Iznalloz\n|-\n|Narila, Yátor\n|1972\n|Cádiar\n|-\n|Alcázar and Fregenite\n|1972\n|Órgiva\n|-\n|Fornes, Játar\n|1973\n|Arenas del Rey\n|-\n|Béznar\n|1973\n|Lecrín\n|-\n|Ventas de Zafarraya\n|1973\n|Alhama de Granada\n|}\nMunicipal mergers\nAnother phenomenon that also explains the creation of new municipalities is the merger between several pre-existing municipalities with similar population potential. Symptomatic was the case of the merger between Moreda and Laborcillas, giving rise to the term Morelábor, toponym formed by the conjunction of the beginning of both localities.\nOnce again, the mountainous areas are the most prone to this phenomenon, since in them –given the fragmented nature of the terrain– there is an abundance of municipalities of small size –both in extension and population– that are willing to merge with each other to have greater political and management capacity. The regions of the Alpujarra Granadina and the Lecrin Valley are the geographical area where these processes have been most frequent. Very significant examples are the creation of Lecrín, Los Guájares, Valle del Zalabí, Alpujarra de la Sierra, among others.\n{| class=\"wikitable\"\n| colspan=\"4\" |\n|-\n|Merged municipalities\n|Date\n|Municipality forming\n|Location\n|-\n|Alcázar and Bargís, Fregenite\n|Between 1925 and 1930\n|Alcázar and Fregenite\n| rowspan=\"12\" |\n|-\n|Chite, and Talará, Acequias, Mondújar, Murchas\n|1967\n|Lecrín\n|-\n|Laroles, Mairena, Picena\n|1972\n|Nevada\n|-\n|Mecina Bombarón, Yegen\n|1972\n|Alpujarra de la Sierra\n|-\n|Pitres, Mecina Fondales, Ferreirola\n|1972\n|La Taha\n|-\n|Melegís, Saleres, Restábal\n|1972\n|El Valle\n|-\n|Gabia la Grande, Gabia la Chica\n|1973\n|Las Gabias\n|-\n|Guájar Faragüit, Guájar Fondón, Guájar Alto\n|1973\n|Los Guájares\n|-\n|Alcudia de Guadix, Charches, Exfiliana\n|1973\n|Valle del Zalabí\n|-\n|Cónchar, Cozvíjar\n|1974\n|Villamena\n|-\n|Moreda, Laborcillas\n|1974\n|Morelábor\n|-\n|Pinos del Valle, Ízbor\n|1976\n|El Pinar\n|-\n|Ambroz, Purchil, Belicena\n|1976\n|Vegas del Genil\n|}\nChanges in municipal boundaries\nMuch less frequent are changes in the municipal boundaries between two bordering municipalities. These cases are usually of a vindictive nature and are based on the request of the population center in question to change its municipal boundary. The greater socio-economic relations with another municipality is the main reason for these boundary changes. An example of this is the case of the residents of Barrio del Camarate –known in the town as Barrio Guadix– who in 1945 asked the authorities and the municipality of Accitano for the segregation of the latter, to which they belonged, and the aggregation to the municipality of Benalúa. The file was successfully concluded in 1972.\n{| class=\"wikitable\"\n| colspan=\"4\" |\n|-\n|Entity\n|Date\n|Municipality of origin\n|Host municipality\n|-\n|Lobras\n|1860\n|Molvízar\n|Salobreña\n|-\n|Santa Casilda, La Goleta\n|1962\n|Píñar\n|Moreda\n|-\n|Barrio del Camarate\n|1972\n|Guadix\n|Benalúa\n|-\n|Casillas Bajas del Zaidín\n|1987\n|Armilla\n|Granada\n|-\n|\n|1999\n| colspan=\"2\" |Alteration of municipal limits Albolote-Peligros\n|}\nAt present, towns such as La Herradura (Almuñécar) continue to demand self-government and their establishment as municipalities. However, as of today, the province of Granada is made up of 174 municipalities integrated into 9 judicial districts.\nSee also\n* Political divisions of Spain\n* 1833 territorial division of Spain\n* Provinces of Spain\nNotes\nReferences\nBibliography\n* }}\n*\n*\n*\n*\n*\n*\n*  |last1=de Medina |first1=Pedro |title=Libro de grandezas y cosas memorables de España: Libro de la verdad |date=1944 |editor-last1=González Palencia |editor-first1=Ángel |publisher=Consejo Superior de Investigaciones Científicas |url=https://books.google.com/books?id=-MkSAAAAYAAJ |language=es}}\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\nExternal links\n* [https://es.wikisource.org/wiki/Real_Decreto_de_30_de_noviembre_de_1833 Royal Decree of November 30, 1833] (in Spanish)"
    }
  ]
}