{
  "content": [
    {
      "type": "text",
      "text": "# History of parliamentary constituencies and boundaries in Buckinghamshire\n\nThe ceremonial county of Buckinghamshire, which comprises the unitary authorities of Buckinghamshire Council and the city of Milton Keynes, currently returns eight MPs to the UK Parliament.\nAs a result of the local government reorganisation introduced by the Local Government Act 1972, which came into effect on 1 April 1974, the boundaries of the historic/administrative county were altered, with southernmost parts, including the Borough of Slough, being transferred to the county of Berkshire. This was reflected in the following redistribution of parliamentary seats which came into effect for the 1983 general election and effectively reduced the county's representation by one MP.\nNumber of seats\nThe table below shows the number of MPs representing Buckinghamshire at each major redistribution of seats affecting the county.\n{| class=\"wikitable\"\n!Year\n!County\nseats1\n!Borough\nseats1\n!Total\n|-\n|Prior to 1832\n| align=\"center\" |2\n| align=\"center\" |12\n| align=\"center\" |14\n|-\n|1832–1868\n| align=\"center\" |3\n| align=\"center\" |8\n| align=\"center\" |11\n|-\n|1868–1885\n| align=\"center\" |3\n| align=\"center\" |5\n| align=\"center\" |8\n|-\n|1885–1945\n| align=\"center\" |3\n| align=\"center\" |0\n| align=\"center\" |3\n|-\n|1945–1950\n| align=\"center\" |4\n| align=\"center\" |0\n| align=\"center\" |4\n|-\n|1950–1974\n| align=\"center\" |4\n| align=\"center\" |1\n| align=\"center\" |5\n|-\n|1974–1983\n| align=\"center\" |5\n| align=\"center\" |1\n| align=\"center\" |6\n|-\n|1983–1992\n| align=\"center\" |6\n| align=\"center\" |0\n| align=\"center\" |6\n|-\n|19922–2024\n| align=\"center\" |6\n| align=\"center\" |1\n| align=\"center\" |7\n|-\n|2024–present\n|align=\"center\" |7\n|align=\"center\" |1\n|align=\"center\" |8\n|}\n1Prior to 1950, seats were classified as County Divisions or Parliamentary Boroughs. Since 1950, they have been classified as County or Borough Constituencies.\n2Additional seat created at interim review (see below).\nTimeline\n{| class=\"wikitable\"\n!Constituency\n!Prior to 1832\n!1832–1868\n!1868–1885\n!1885–1945\n!1945–1950\n!1955–1974\n!1974–1983\n!1983–1992\n!1992–2010\n!2010–2024\n!2024–present\n|-\n|Buckinghamshire\n| align=\"center\" bgcolor=\"#f9ff50\" |1265–1832 (2 MPs)\n| align=\"center\" bgcolor=\"#f9ff50\" colspan=\"2\" |1832–1885 (3 MPs)\n| colspan=\"8\" |\n|-\n|Milton Keynes\n| colspan=\"7\" |\n| align=\"center\" bgcolor=\"#f9ff50\" |1983–1992\n| colspan=\"3\" |\n|-\n|North East Milton Keynes\n| colspan=\"8\" |\n| align=\"center\" bgcolor=\"#f9ff50\" |1992–2010\n| colspan=\"2\" |\n|-\n|Milton Keynes North\n| colspan=\"9\" |\n| colspan=\"2\" align=\"center\" bgcolor=\"#f9ff50\" |2010–present\n|-\n|Milton Keynes South West\n| colspan=\"8\" |\n| align=\"center\" bgcolor=\"#ff5555\" |1992–2010\n| colspan=\"2\" |\n|-\n|Milton Keynes Central\n| colspan=\"10\" |\n| align=\"center\" bgcolor=\"#ff5555\" |2024–present\n|-\n|Milton Keynes South\n| colspan=\"9\" |\n| align=\"center\" bgcolor=\"#ff5555\" |2010–2024\n|\n|-\n|Buckingham and Bletchley\n| colspan=\"10\" |\n| align=\"center\" bgcolor=\"#f9ff50\" |2024–present\n|-\n|Buckingham\n| colspan=\"2\" align=\"center\" bgcolor=\"#ff5555\" |1295–1868 (2 MPs)\n| align=\"center\" bgcolor=\"#ff5555\" |1868–1885\n| colspan=\"7\" align=\"center\" bgcolor=\"#f9ff50\" |1885–2024\n|\n|-\n|Mid Buckinghamshire\n| colspan=\"10\" |\n| align=\"center\" bgcolor=\"#f9ff50\" |2024–present\n|-\n|Aylesbury\n| colspan=\"3\" align=\"center\" bgcolor=\"#ff5555\" |1558–1885 (2MPs)\n| colspan=\"8\" align=\"center\" bgcolor=\"#f9ff50\" |1885–present\n|-\n|Wendover\n| align=\"center\" bgcolor=\"#ff5555\" |1624–1832 (2 MPs)\n| colspan=\"10\" |\n|-\n|Amersham\n| align=\"center\" bgcolor=\"#ff5555\" |1624–1832 (2 MPs)\n| colspan=\"10\" |\n|-\n|Chesham and Amersham\n| colspan=\"6\" |\n| colspan=\"5\" align=\"center\" bgcolor=\"#f9ff50\" |1974–present\n|-\n|Wycombe1\n| colspan=\"2\" align=\"center\" bgcolor=\"#ff5555\" |1295–1868 (2 MPs)\n| align=\"center\" bgcolor=\"#ff5555\" |1868–1885\n| colspan=\"8\" align=\"center\" bgcolor=\"#f9ff50\" |1885–present\n|-\n|Great Marlow\n| colspan=\"2\" align=\"center\" bgcolor=\"#ff5555\" |1624–1868 (2MPs)\n| align=\"center\" bgcolor=\"#ff5555\" |1868–1885\n| colspan=\"8\" |\n|-\n|South Buckinghamshire\n| colspan=\"5\" |\n| align=\"center\" bgcolor=\"#f9ff50\" |1955–1974\n| colspan=\"5\" |\n|-\n|Beaconsfield\n| colspan=\"6\" |\n| colspan=\"5\" align=\"center\" bgcolor=\"#f9ff50\" |1974–present\n|-\n|Eton and Slough\n| colspan=\"4\" |\n| align=\"center\" bgcolor=\"#f9ff50\" |1945–1950\n| colspan=\"2\" align=\"center\" bgcolor=\"#ff5555\" |1950–1983\n| colspan=\"4\" |Part of Berkshire from April 1974\n|}\n1Borough was formally known as Chipping Wycombe\nBoundary reviews\n{| class=\"wikitable\"\n!style=\"width:5%;\" |Prior to 1832\n|style=\"width:70%;\" |Since 1265, the parliamentary county of Buckinghamshire along with all other English counties regardless of size or population, had elected two MPs (Knights of the Shire) to the House of Commons.\nThe county also included six Parliamentary Boroughs, namely Amersham, Aylesbury, Buckingham, Chipping Wycombe, Great Marlow and Wendover, all returning 2 MPs (burgesses) continuously since at least 1624.\n|style=\"width:25%;\" |\n|-\n!1832\n|The Reform Act 1832 radically changed the representation of the House of Commons, with the county's representation being increased to three MPs and the Boroughs of Amersham and Wendover abolished.\nUnusually, the contents of the Parliamentary Borough of Aylesbury were defined within the act itself to include the \"Three Hundreds of Aylesbury\", which extended the seat to include Wendover and Princes Risborough.\n|\n|-\n!1868\n|Under the Representation of the People Act 1867, the representation of the Boroughs of Buckingham, Chipping Wycombe and Great Marlow was reduced to one MP each.\n|\n|-\n!1885\n|Under the Redistribution of Seats Act 1885, the county was divided into three single-member constituencies, namely the Northern or Buckingham Division, the Mid or Aylesbury Division and the Southern or Wycombe Division.\nThe remaining parliamentary boroughs were all abolished and absorbed into the county divisions which took their names, with Great Marlow being added to the Wycombe Division, which also included the towns of Beaconsfield and Slough.\n|\n|-\n!1918\n|Under the Representation of the People Act 1918, the three county seats were retained, with altered boundaries: north-eastern parts of Aylesbury, including Linslade and Wing were transferred to Buckingham; Beaconsfield and Amersham were transferred from Wycombe to Aylesbury; and Wycombe gained Eton from the abolished Parliamentary Borough of New Windsor in Berkshire.\n|\n|-\n!1945\n|The House of Commons (Redistribution of Seats) Act 1944 set up Boundary Commissions to carry out periodic reviews of the distribution of parliamentary constituencies. It also authorised an initial review to subdivide abnormally large constituencies in time for the 1945 general election. This was implemented by the Redistribution of Seats Order 1945 under which Buckinghamshire was allocated an additional seat.\nAs a consequence, the new constituency of Eton and Slough was formed from the Wycombe constituency, comprising the Municipal Borough of Slough, the Urban District of Eton and the parishes to the south of Beaconsfield making up the Rural District of Eton. To partly compensate Wycombe for the loss of these areas, the parts of the Rural District of Wycombe not currently in the constituency, which included Princes Risborough and Hughenden, were transferred from Aylesbury.\n|\n|-\n!1950\n|The Representation of the People Act 1948 increased the county's representation once again, from 4 to 5 MPs, with the creation of South Buckinghamshire. This comprised Beaconsfield, Amersham and the Chalfonts, transferred from Aylesbury, and the Rural District of Eton, transferred from Eton and Slough (which was redesignated as a Borough Constituency).\nThere were no changes for the 1955 general election under the First Periodic Review of Westminster Constituencies.\n|\n|-\n!1974\n|Under the Second Periodic Review, representation was increased to 6 MPs with the formation of the new seats of Beaconsfield and Chesham and Amersham, which largely replaced the abolished South Buckinghamshire constituency.  Beaconsfield comprised the Urban District of Beaconsfield and the Rural District of Eton, while Chesham and Amersham combined Amersham and the Chalfonts with Chesham and the remaining, northern, part of the Rural District of Amersham, transferred from Aylesbury.\nThe northern parts of the Rural District of Wycombe, including Princes Risborough (but not Hughenden) were transferred back from Wycombe to Aylesbury.\nBuckingham lost Linslade which had been transferred to Bedfordshire on its amalgamation with the neighbouring Urban District of Leighton Buzzard and was now included in the constituency of South Bedfordshire.\n|\n|-\n!1983\n|The Third Review reflected the changes to the county of Buckinghamshire arising from the Local Government Act 1972, resulting in Eton, Slough and some surrounding areas being transferred to Berkshire. The constituency of Eton and Slough was abolished with the area constituting the Borough of Slough forming the new seat of Slough, and the small Urban District of Eton which was absorbed into the Royal Borough of Windsor and Maidenhead being included in the constituency of Windsor and Maidenhead. Those parishes of the Rural District of Eton also transferred to Berkshire, which included Datchet, were transferred from Beaconsfield and included in the new constituency of East Berkshire.\nIn the north of the county, the new constituency of Milton Keynes was formed from parts of the Buckingham constituency. This reflected the growth of the new town of Milton Keynes since its foundation in 1967. The new constituency comprised the Borough of Milton Keynes, with the exception of Stony Stratford and Wolverton, which were retained in Buckingham. In turn, Buckingham gained north-western parts of the Aylesbury constituency.\nElsewhere, Great Missenden was transferred from Chesham and Amersham to Aylesbury, and Hazlemere from Wycombe to Chesham and Amersham\n|\n|-\n!1992\n|Uniquely, outside the normal cycle of periodic reviews by the Boundary Commissions, the constituency of Milton Keynes, due to its rapid growth, was split into two separate constituencies for the 1992 general election: the County Constituency of North East Milton Keynes and the Borough Constituency of Milton Keynes South West. Stony Stratford and Wolverton were transferred from Buckingham and included in Milton Keynes South West.\n|\n|-\n!1997\n|The Fourth Review saw only minor changes to the Buckinghamshire constituencies, included the transfer of the District of Aylesbury Vale ward of Aston Clinton from Aylesbury to Buckingham.\n|\n|-\n!2010\n|In the Fifth Review the Boundary Commission for England proposed changes to realign constituency boundaries with the boundaries of current local government wards, and to reduce the electoral disparity between constituencies.\nThe changes included the return of Great Missenden to Chesham and Amersham, Hazlemere to Wycombe and Aston Clinton to Buckingham. In addition, Marlow was transferred from Wycombe to Beaconsfield and Princes Risborough from Aylesbury to Buckingham.\nThe boundary between the two Milton Keynes constituencies was realigned and they were renamed as Milton Keynes North and Milton Keynes South.\n|\n|-\n!2024\n|For the 2023 Periodic Review of Westminster constituencies, which redrew the constituency map ahead of the 2024 United Kingdom general election, the Boundary Commission for England proposed that the number of seats in the combined area of Buckinghamshire and Milton Keynes be increased from seven to eight with the creation of the new constituency of Buckingham and Bletchley and Mid Buckinghamshire, offset by the abolition of the existing Buckingham seat. This led to significant changes elsewhere, particularly in Milton Keynes, resulting in the replacement of Milton Keynes South with Milton Keynes Central.\nDetailed changes were as follows:\n* Milton Keynes North lost central areas of Milton Keynes and the Broughton area to the new Milton Keynes Central seat, partly offset by the addition of Stony Stratford from Milton Keynes South.\n* The town of Bletchley, together with the communities of Fenny Stratford and Tattenhoe were included in the new Buckingham and Bletchley seat, with remaining parts of Milton Keynes South forming the basis of Milton Keynes Central.\n* The abolished seat of Buckingham was split three ways: Buckingham and Winslow to Buckingham and Bletchley; Wing and Ivinghoe to Aylesbury; and remaining, largely rural areas, including Princes Risborough, to Mid Buckinghamshire.\n* Southern areas of Aylesbury, including Wendover to Mid Buckinghamshire.\n* Great Missenden from Chesham and Amersham to Mid Buckinghamshire.\n* Hazlemere from Wycombe to Chesham and Amersham.\n* Gerards Cross from Beaconsfield to Chesham and Amersham.\n|\n|}\nSee also\n* List of parliamentary constituencies in Buckinghamshire\nReferences"
    }
  ]
}