{
  "content": [
    {
      "type": "text",
      "text": "# History of wildlife tracking technology__disambig_1\n\nThe history of wildlife tracking technology involves the evolution of technologies that have been used to monitor, track, and locate many different types of wildlife. Many individuals have an interest in tracking wildlife, including biologists, scientific researchers, and conservationists. Biotelemetry is \"the instrumental technique for gaining and transmitting information from a living organism and its environment to a remote observer\".\n1800s\nBird banding\nJohn James Audubon, a French American naturalist, ornithologist, and painter was the first person that attempted to paint and describe all the birds of America. In 1803, he conducted the first known bird banding experiment in North America and tied strings around the legs of Eastern Phoebes. He observed that the birds would return to the same nesting site every year, demonstrating philopatry.\nBird banding was used in 1890 by Hans Christian C. Mortensen, a Danish biologist. Birds can be captured by hand, using mist-nets, cannon-nets, or cage traps. A band that is typically made out of aluminum, or coloured plastic is attached to the leg of the bird. Each band has a unique identification code so that when birds are later recaptured, individuals can be identified. Mist-nets became widely available in the early 1950s, which dramatically increased the recovery of marked birds.\nEarly 1930s\nScale clipping\nThe first scientific paper on scale clipping was published in 1933. Sharp dissecting or microsurgical scissors are used to clip specific ventrals on snakes. A serial enumeration system is used so that individuals can be identified based on the scarring pattern.\n1940s\nRadar\nDuring World War II, birds that were migrating caused \"phantom signals\" or \"radar angels\" to appear on radar screens. Since then, radar has become a widely used method for studying migrating organisms. Early radar technologies, such as WSR-57 (Weather Surveillance Radar - 1957), have been replaced by the Next Generation Weather Radar program (NEXRAD) which was installed in segments during the 1990s. Also known as WSR-88D (Weather Surveillance Radar 88 Doppler), NEXRAD is a doppler system that replaced older non-Doppler meteorological radars. NEXRAD can determine both the direction and speed of migrating individuals that are traveling both towards and away from the radar.\nIsotope analysis\nIsotope analysis is based on the principle that most elements exist in two or more forms, known as isotopes. Isotopes have the same number of protons but differ in their number of neutrons, resulting in different masses. This variation in the relative abundance of stable isotopes results from tiny mass differences that cause the isotopes to act differently in chemical reactions and physical processes. Different environments are often characterized by predictable isotopic signatures, meaning that organism's unique isotopic signatures can be traced to unique environments containing the same isotope signatures. The fundamental design of isotope ratio mass spectrometers, a tool used for analyzing isotopes, has not changed since the 1940s. Stable-isotope analysis (SIA) is frequently used with birds since only one capture is needed to determine its breeding origin. SIA is based on the principle that birds will retain isotopic information in their tissues that are based on the isotopic landscapes they inhabited in the recent past. Isotopic information is obtained mostly from feathers, since the keratin in feathers is metabolically inert. For various bird species tested, their feathers' elemental turnover rate is positively correlated with their metabolic rate. A problem with SIA occurs if birds undergo protein catabolism during migration and their isotopic information is subsequently lost as a result of blood-cell replacement. SIA is difficult to employ on birds that switch their diets seasonally due to the difficulty of separating isotopic changes due to location change from isotopic changes due to diet change. The elements that are primarily analyzed for SIA are: carbon, nitrogen, oxygen, hydrogen, and sulphur. Isotopic variation among plants is largely based on differences in photosynthetic pathways. The method is beneficial since it relies on capturing an individual only once. Important information can be obtained from something as simple as a birds' feather, which is relatively easily and painlessly extracted.\n1950s\nAcoustic telemetry\nAcoustic telemetry is based on the principles of sonar, which was developed to detect submarines during World War I. The properties of acoustic systems favour their use in deep waters with high conductivity and low turbulence. The first acoustic telemetry equipment was developed for studying fish in 1956 by the U.S. Bureau of Commercial Fisheries and the Minneapolis-Honeywell Regulator Corporation. Individuals that want to track marine wildlife in salt water face unique challenges. Radio waves are highly absorbed by salt water, making them a poor choice for sending messages through the ocean. Sound waves, on the other hand, are not similarly impeded by seawater. Due to the fact that sound can travel more than 4 times faster in water than in air, this allows for near real-time listening over long distances with proper acoustic telemetry equipment.  Acoustic signals are the preferred communication tool for researchers who wish to track fish and wildlife in marine habitats in real time. As with radio, acoustic telemetry requires transmitters to send signals and receivers to hear them. The transmitters are electronic tags that emit a series of sound pulses into the surroundings. They can be surgically implanted or attached externally to an organism. The range of signal reception can vary from a few meters to more than a thousand meters. The signal typically transmits once every minute or two, in order to conserve battery life. Receivers are small, data-logging computers that “listen” for tagged individuals. When a signal is identified, the tag's unique ID code is saved with the date and time. The data from any single receiver provide a record of each signal to that location by a tagged individual. Researchers might deploy many receivers over large regions to understand the movement patterns of tagged individuals. Hydrophones, a type of underwater microphone, receive acoustic signals and then either store or convert them into radio signals for rapid transmission through the air to receivers on shore.\n1960s\nVHF telemetry\nVHF (very high frequency) telemetry typically requires a user to acquire VHF transmissions from a VHF transmitter (usually in a collar attached to the animal) using a hand-held antenna. VHF signals are either received by mobile or stationary receivers equipped with directional antennae. The location of the transmitter can then be determined by acquiring the transmissions from three (or more) different locations to triangulate the location of the device. VHF tracking is more commonly known as \"radio-tracking.\"\n“Radio-tracking is a revolutionary technique for studying many kinds of free-ranging animals. By March 1979, one of the leading commercial suppliers of radio tracking equipment had sold over 17,500 radio collars. Numerous species, from crayfish through elephants, have been studied with this technique in widespread regions of the world, from pole to pole and in most major countries of the world”.\nThe idea of using tiny radio transmitters attached to animals to track those creatures occurred to several people in the 1950s when transistors were rapidly replacing vacuum tubes, thus minimizing the size of devices that could produce radio signals. Concurrently, some workers started developing such devices to monitor animal heart rates and respiration while others strove to embed transmitters in collars and harnesses so animal locations could be tracked.\nEach of these groups involved wildlife biologists teaming up with electronics engineers or technicians to build the radio-transmitters. Of these electronics experts, William (Bill) W. Cochran, while an undergraduate student with the University of Illinois, had been working on the radio transmitting systems for some of the earliest satellites for the U. S. Army.\nGeorge Swenson, principal investigator on a NASA-sponsored University of Illinois project to study Sputnik-era radio propagation through the Earth's ionosphere, had this to say about him:\n“... [Cochran] had been responsible for building and operating our field stations for a couple of years. He'd demonstrated exceptional skill with transistor circuits. Bill and I decided we could build a couple of satellite payloads, and we started to experiment with circuits and various kinds of batteries.”\n“...while he was designing satellite transmitters and receivers, [he] was also moonlighting for wildlife biologists of the Illinois Natural History Survey. They had the idea that small radio transmitters, attached to rabbits, might allow them to track the animals into their burrows, and establish their activity patterns. It worked. Success led to a suggestion from an ornithologist that perhaps birds could be tracked in flight.”\nAccording to Cochran (8/23/19), wildlife biologist Frank Bellrose wished to test the direction in which translocated mallard ducks flew when released into a new area. Cochran built a transmitter to attach to the duck with a light metal band around its chest, and when the duck passed a station where Cochran was monitoring a satellite, he was able to record the signal. Swenson continued: “As [the duck] breathed quietly, the metal band periodically distorted and pulled the frequency, causing a varying beat note from the receiver. An audio-frequency discriminator was available, so the frequency variations could be recorded on a strip chart. When the bird was released into the air, its breathing was recorded on the chart, and in addition, a higher-frequency modulation representing its wing beats. The biologists informed us that we'd made the first measurements of the relation between the wing beats and the breathing of a flying bird, thus answering a long-standing question,” as well as the direction in which the duck flew.\n“Of course I was very young and cared little about what ducks do and knew nothing about publishing and didn’t even care if they included me as a co-author,” stated Cochran (8/23/19).\n“Bill Cochran followed these successes with a long career in radio-telemetry applications in wildlife research. After leaving our program, he developed wildlife radio tracking to a high degree of effectiveness, founding the company that pioneered the business . . .”\nMeanwhile, Dwaine Warner, professor of ornithology, University of Minnesota, a very creative and forward-thinking researcher, had received a grant to use electronic technology to monitor various animals at the university's Cedar Creek Natural History Area, some 40&nbsp;km north of the Twin Cities. One of his first actions was to hire Cochran, still an undergraduate, to design a system to automatically concurrently monitor the movements of various animals in that study area.\nEtienne Benson (2010) wrote, “They invited him to visit the group in Minnesota in the fall of 1961, and a few months later he moved to the Twin Cities to take charge of the Museum of Natural History’s bioelectronics laboratory. The museum group had had some success transmitting temperature measurements from rabbits on the roof of the building to their basement laboratory with their own tag, but after Cochran arrived they shifted to his design.”\nThe automatic radio-tracking system that Cochran devised, with its biologists, engineers, and technicians led by Cochran, became a radio-tracking center. That center not only produced many papers based on its own radio-tracking research, but it also developed new techniques, refined the tiny radio transmitters, attachment methods, and signal receivers and generally fostered the entire field through formal and informal collaboration with other biologists and engineers as well as spinning off businesses that commercially supplied the equipment. The radio-tracking revolution had begun.\nMech's Handbook of Animal Radio-tracking included the following: “This book is dedicated to William W. Cochran, Illinois Natural History Survey, who, many of us believe, has done more to further the field of animal radio-tracking than any other single person.”\n1970s\nPhoto-identification\nMARKResearchers and whale watchers that observed humpback whales realized that each individual humpback whale has unique pigmentation and scarring patterns on their tail flukes. Beginning in the 1970s, researchers began to recognize individual whales based on their tail flukes using photo-identification. Since then, photo-identification has been used to study many marine species in order to determine aspects of their biology, ecology, and behaviour. Rather than spend time compiling and analyzing the numerous photographs, computer programs have been created to help researchers identify individuals and resighting events using existing photo-identification catalogues. One such program, Fluke Matcher, reconciles the many thousands of photographs of humpback whales by using several different features of the fluke such as size, shape, black and white pigment distribution, and other distinctive features. By relying on many criteria, Fluke Matcher can identify individual whales from poorer quality or incomplete photographs. Regular \"citizen scientists\" and whale watchers can upload their own photographs to these computer programs, helping scientists determine if an individual matches another from the database.\n1980s\nPIT tags\nPassive integrated transponder (PIT) tags consist of an integrated circuit chip, capacitor, and antenna coil encased in glass. They have been used since the mid 1980s with scientists studying fish movements. Since then, PIT tags have been used to study the movement of amphibians, reptiles, birds, and invertebrates. The tags act as a lifetime barcode for an organism and provided they can be scanned, are as reliable as a fingerprint. PIT tags are dormant until activated and therefore do not require any internal source of power throughout their lifespan. To activate the tag, a low-frequency radio signal is emitted by a scanning device that generates a close-range electromagnetic field. The tag then sends a unique alpha-numeric code back to the reader, effectively identifying the individual organism. Internal PIT tags are inserted via large-gauge needles or surgically implanted either subcutaneously or into a body cavity. PIT tagging can be used to answer questions regarding growth rates, survivorship, food webs, and movement patterns. A major advantage over mark-recapture methods is that marked animals do not need to be recaptured; they just need to pass by an automated reading system antenna.\n1990s\nGeolocator\nFirst described in 1992, a geolocator is a device that periodically records ambient light level (solar irradiance) as a means of determining an organism's location. Geolocators have been especially useful for tracking bird migration because there are small and lightweight ones that do not utilize satellite or radio telemetry for real-time monitoring. The major disadvantage is that organism's need to be recaptured in order to obtain data from the device. Light levels that are recorded can be used to determine the latitude and longitude, and thus provide information on the location of organisms. When the organism is in a shaded environment, due to clouds, feathers, or foliage, a problem occurs since the geolocator does not record accurate light levels.\nGPS receiver\nGPS technology enables individuals to observe relatively fine-scale movement or migratory patterns in a free-ranging wild animal using the Global Positioning System. After fitting animals with a GPS receiver, their position is determined by precisely timing the signals sent by GPS satellites high above the Earth, and the location of satellites sending the signals.  As soon as GPS became available for civilian use in the 1990s, biologists started to attach GPS receivers to animals. Although the first civilian GPS receivers were developed by Magellan in 1989, they were very large and therefore impractical for animal applications. By the mid-1990s, the larger GPS manufacturing companies created GPS receivers that were smaller, more energy-efficient, and therefore more usable for animal-tracking applications.\nGPS tracking devices are often linked to an Argos Platform Transmitter Terminal (PTT) enabling them to transmit data via the Argos System, a scientific satellite system which has been in use since 1978. Users can then download their data directly from Argos via telnet and process the raw data to extract their transmitted information. Data can also be transmitted via GSM networks, using SMS messages or internet protocols in a GPRS session.\nGSM Mobile Phone Telemetry\nA new telemetry system based on GSM (Global System for Mobile Communications) mobile phone technology was first described in 1998 as a technique that provides more detailed mark-recapture data over an extensive geographical range. Organisms are fitted with a mobile phone tag that is programmed to attempt to send a text message back to the laboratory at regular intervals. The received messages are analyzed in order to determine the organism's estimated location. Mobile phone telemetry is advantageous since it is easy to set up with relatively low maintenance costs, it allows for two-way communications, and required a low profile, non-directional antenna on the receiver. Some disadvantages include the requirement of monitoring in an area that has cell phone coverage, monthly service fees, and the possibility of the cell phone service provider changing cell towers or communication protocols.\nPop-up satellite archival tags (PSAT)\nPop-up satellite archival tags are electronic storage devices developed in the late 1990s that are either surgically implanted or attached to the outside of marine animals with an anchoring device. These tags can record data on ambient light levels, swimming depth, and internal/external temperature. PSAT's transmit recorded information to an orbiting satellite which then relays the information to researchers. At a preset time, a signal causes the tag's attachment to the organism to dissolve, allowing the tag to float to the surface of the water where it sends its data via satellite. Although PSAT's are more expensive than other tags, they are effective for studying the movements of large pelagic animals that are often not recaptured. Data from PSAT's has been used to determine horizontal and vertical movement patterns, residence times, feeding bouts, and possible spawning areas.\nGenetic markers\nA genetic marker is a gene or DNA sequence with a known location on a chromosome that can be used to identify individuals or species. The marker could be a short DNA sequence, such as a sequence surrounding a single base-pair change, known as a single nucleotide polymorphism (SNP), or a longer minisatellite sequence. A small sample of blood, a feather, or piece of tissue, can be extracted from an organism and its unique genetic markers are determined. If the organism is recaptured or a sample is obtained at a later date, then it is possible to determine if it was the same organism as in the initial capture. Having proper bioinformatics tools is essential for processing and analyzing DNA sequence data.\nMany important developments during the 1990s have made tracking wildlife using genetic markers possible, including:\n# the development of polymerase chain reaction (PCR) which can amplify small amounts of DNA to make a large usable amount.\n# the development and use of evolutionarily conserved sets of PCR primers.\n# the use of microsatellite loci that vary among individuals within a species, and between species.\n# the development of advanced DNA sequencing techniques.\n2000s\nNanotechnology\nMany things utilized for studying larger organisms has not been possible for smaller organisms due to size constraints on technology. In marine environments, tracking devices on smaller organisms are too heavy causing them to behave unnaturally. Recent advances in nanotechnology have allowed scientists to track millimeter sized organisms. Small organisms can be labelled with quantum dots, a microscopic fluorescent probe, the core of which is a semiconductor material with high photostability, high wavelength absorption range, and a narrow emission wavelength range. In one experiment, amine proteins on the exoskeleton of Daphnia magna were biotinylated and streptavidin was attached to the quantum dots. This allowed for a simple bioconjugation to tag the organisms with the quantum dots, by taking advantage of the high affinity interaction between streptavidin and biotin. D. magna individuals were successfully tracked with each having a unique quantum dot that fluoresced and emitted light of a specific wavelength that could be detected using cameras. The tags were useful for up to 24 hours, after which the organisms shed their carapace containing the quantum dot. Better cameras are being developed that will improve the depth at which the quantum dot-tagged organisms can be observed and allow for studies to be conducted in natural environments.\nFuture tracking\nWith continued technological innovation, future applications of telemetry will likely provide insights that are currently unavailable. Improvements in battery technology, combined with continued miniaturization of transmitter components, will likely reduce transmitter size further, while increasing efficiency and extending either detection range or tag life. As transmitter circuitry becomes more efficient, surplus battery power can be used to power sensors, so that a common practice of future studies will be to study not only the movement and behaviour of tagged fish but also to simultaneously collect information on the environment fish use. This will lead to more comprehensive multidiscipline studies addressing behaviour, biology, and ecology. In the future, technological advances may eventually lead to a transmitter capable of following the movements and behaviour of individuals throughout their life cycle.\nReferences"
    }
  ]
}