{
  "content": [
    {
      "type": "text",
      "text": "# Historical Society of Berks County__disambig_1\n\n| area_served              = Berks County, Pennsylvania\n| product                  =\n| focus                    =\n| method                   =\n| revenue                  =\n| endowment                =\n| num_volunteers           =\n| num_employees            =\n| num_members              =\n| subsid                   =\n| owner                    =\n| homepage                 = http://www.berkshistory.org\n| dissolved                =\n| footnotes                =\n}}\nFounded in 1869, the Historical Society of Berks County (HSBC) operates the Berks History Center as a museum and library located in Reading, Pennsylvania.  The Society's mission, as described on its website, is \"to focus attention on the unique local history, the vast material culture, and the diverse cultural heritage of Berks County by preserving, archiving, and promoting this material to instill in our citizens of all ages and ethnic groups an awareness of this growing treasure trove of information. This allows the HSBC to be a major cultural magnet, drawing people to our community.\"\nThe Historical Society houses materials relating to the early history of Berks County in its museum and in the Henry Janssen Library. Over 10,000 members and patrons visit during the year.  The Society educates students from public and private schools in the area and is visited by researchers from all over the country.\nBerks History Center\nThe Berks History Center is located at 940 Centre Ave, Reading, PA.  The museum has a historical object collection exceeding 20,000 items.  Included are works of art by Ben Austrian, Jack Coggins, Ralph D. Dunkelberger, G.B. Kostenbader, Earle Poole, E.S. Reeser, Christopher Shearer, Victor Shearer, and Frederick Spang.  The Society has a large transportation collection, including bicycles, a very rare horse drawn streetcar, a Conestoga Wagon, a Duryea automobile, and other wagons, some of which are on display at the Boyertown Museum of Historic Vehicles located in Boyertown, PA.\nIn addition to the permanent collection, the museum hosts up to three temporary exhibits a year.\nHenry Janssen Library\nThe Henry Janssen Library, located at 160 Spring Street, Reading, PA, is the center for genealogical and historical research at the Historical Society of Berks County. The Henry Janssen Library is acknowledged to be one of the best and most thoroughly indexed collections of county data in Pennsylvania.  Library opening hours are Wednesday through Saturday, 9AM to 3PM.  Access to the library is free for members of the Historical Society of Berks County.  There is a charge of $7 per day for library access for non-members.  Children under the age of 18 must be accompanied by an adult.\nIncluded in the library collection are various books on local genealogy and history, Fraktur, broadsides, photographs, almanacs, sheet music, ledgers from local businesses, newspapers dating back to 1796, blueprints, surveys, maps, city directories from 1856, census records, numerous archival collections, Schuylkill Navigation Company and Union Canal plans, tax records from 1753, among other documents. There are numerous genealogical resources (many on Pennsylvania Dutch history) available to Library users, including church and cemetery records dating back to the 1730s. Extensive computer database are keyword searchable, and available on the website to start conducting genealogical and historical research.\nFor a fee, the library also offers research services for those unable to visit the library in person.\nHistory\nIn July 1869, a call was made for interested citizens to gather “for the purpose of collecting and perpetuating the historical reminisces of Berks County.”  Following the first meeting in August, the Historical Society of Berks County was incorporated on December 13, 1869.  The first president was the Honorable William M. Hiester.  After a period of stagnation, President Albert G. Green revived the Society in 1898.  Meetings were held in the Exchange Building located on North 6th Street in Reading, PA.  The first female member was Kate E. Hawley, wife of Reading Eagle founder Jesse G. Hawley, a charter member.\nThe Historical Society first started collecting objects in June, 1898.  Its first building, purchased in June 1904 from the Reading Gas Company, was located at 519 Court Street.  At that time, membership was 150.  Less than ten years later, the burgeoning Historical Society needed a larger building, and J. Bennett Nolan led the search for a new structure.  The cornerstone for the present building was laid in the summer of 1928, and construction was completed the following year. Designed by architect Charles H. Muhlenberg of Muhlenberg Brothers, to be a fireproof structure to house the collection and archives, it is made of concrete and brick.  The present facility was dedicated on October 1, 1929. It is located at\n[https://maps.google.com/maps?f=q&hl=en&geocode=&q=940+Centre+Avenue,+Reading,+PA&sll=37.0625,-95.677068&sspn=40.137381,93.164063&ie=UTF8&ll=40.349684,-75.932093&spn=0.009452,0.022745&z=16&iwloc=addr,   940 Centre Avenue in Reading, PA.]\nNeeding more office, display, and storage space, the Historical Society embarked on a fund raising campaign in the 1980s.  The new building addition was opened in 1988, providing the library with its own dedicated storage and research space.\nAgain faced with storage concerns, the Historical Society took possession of its first off-site property in 2000.  Known as the Hendel House, it is located directly across from Centre Park at 746 Centre Avenue.  In 2016, The Historical Society divested of the ornate Victorian structure, which is now in private hands.\nIn 2005, the Historical Society purchased the former M&T Bank building at 160 Spring Street, directly behind the main building located at 940 Centre Avenue.  Formally named The Henry Janssen Library, this premier research facility opened to the public on November 11, 2008 after extensive renovations.\nSee also\n* List of historical societies in Pennsylvania\nReferences\nExternal links\n*[http://www.berkshistory.org/ Berks History Center] - official website"
    }
  ]
}