{
  "content": [
    {
      "type": "text",
      "text": "# Historical monographs relating to St. George's Chapel, Windsor Castle\n\n]]\nThe '''historical monographs relating to St George's Chapel, Windsor Castle''' are a series of scholarly publications supported by the Dean and Canons of Windsor. Much of the scholarship is based on the material held in the archives at St. George’s Chapel, Windsor Castle.\nHistory\nIn 1939 the Rev. E. H. Fellowes, Minor Canon of St George’s Chapel, published a list of the Knights of the Garter from 1348 to 1939 along with a complete list of the stall plates in St George’s Chapel. This was to be the first in a series of historical monographs relating to St George’s Chapel which today comprises nineteen volumes, the most recent of which was published in 2014. Fellowes himself authored or edited five of these volumes. Sidney Leslie Ollard was the general editor of the series until 1949.\nThe purpose of the series of historical monographs was to take advantage of the then comparatively unexplored wealth of material about the history of the Chapel contained in the Chapel Archives; to conduct thorough research into it and to share that research with a wide audience. By the early twenty-first century, however, many of the monographs are now out of print and have become difficult to get hold of. In order to further their original purpose of sharing the Chapel’s history, those out-of-print volumes have been digitised and are now freely available to be downloaded and read via the St George's Chapel Archives & Chapter Library.\nPublications\nThe existing series of volumes comprises the following:\n*Volume 1. The Knights of the Garter, 1348–1939; with a complete list of the stall plates in St. Georges Chapel. Edmund Horace Fellowes (SPCK – 1939)\n*Volume 2. ''The Plate of St. George's Chapel, Windsor Castle. E. Alfred Jones (1939)\n*Volume 3. Organists and Masters of the Choristers of St. George's Chapel in Windsor Castle. Edmund Horace Fellowes (1939)\n*Volume 4. The Military Knights of Windsor, 1352–1944. Edmund Horace Fellowes (1944)\n*Volume 5. The Vicars or Minor Canons of His Majesty's Free Chapel of St. George in Windsor. Edmund Horace Fellowes (1945)\n*Volume 6. St. George's Chapel, Windsor Castle, 1348–1416: a study in early collegiate administration. Anne Katharine Babette Roberts (1951)\n*Volume 7. The Inventories of St. George's Chapel, Windsor Castle, 1384–1667. Maurice F. Bond (1947)\n*Volume 8. Fasti Wyndesorienses: the Deans and Canons of Windsor. Sidney Leslie Ollard (1950)\n*Volume 9. St. George's Chapel, Windsor; the Woodwork of the Choir. M. R. James (1933)\n*Volume 10. The Baptism, Marriage and Burial Registers of St George’s Chapel, Windsor. Edmund Horace Fellowes (1957)\n*Volume 11. The Manuscripts of St George's Chapel. Rev. J. N. Dalton, KCVO, CMG, LLD, FSA (1957)\n*Volume 12. The Monuments of St. George's Chapel Windsor Castle. Shelagh M. Bond (1958)\n*Volume 13. The Chapter Acts of the Dean and Canons of Windsor; 1430, 1523–1672.  (1966)\n*Volume 14. The Musical Manuscripts of St George's Chapel, Windsor Castle: A Descriptive Catalogue. Clifford Mould (Feb 1973)\n*Volume 15. A Catalogue of Printed Books (pre-1751) in the Library of St. George's Chapel, Windsor Castle. John Callard (1976).\n*Volume 16. The Order of the Garter; its Knights and Stall Plates 1348 to 1984. Grace Holmes (1984)\n*Volume 17. St George's Chapel, Windsor, in the Late Middle Ages.  Colin Richmond, et al. (2001)\n*Volume 18. A History of the Stained Glass of St George’s Chapel, Windsor Castle. Sarah Brown (2006)\n*Volume 19. The Medieval Library of St George’s Chapel, Windsor Castle: Documentary Sources'' Dr James Willoughby (2015)\nReferences\nExternal links\n* [https://www.stgeorges-windsor.org/archives/resources/historical-monographs/ Historical Monographs, St George's Chapel Archives and Chapter Library]"
    }
  ]
}