{
  "content": [
    {
      "type": "text",
      "text": "# History of African-American agriculture\n\nThe role of African Americans in the agricultural history of the United States includes roles as the main work force when they were enslaved on cotton and tobacco plantations in the Antebellum South. The efforts to support or control Black Americans—through aid, land, relocation, or economic policy—were often limited, reversed, or rooted in discrimination. The Emancipation Proclamation, while symbolically powerful, had limited immediate impact on freeing all enslaved people. After the Emancipation Proclamation in 1863-1865 most stayed in farming as very poor sharecroppers, who rarely owned land. In the 20th century policies promoting systemic racism and discrimination—through Jim Crow laws and the Agricultural Adjustment Act (AAA)—were used to exclude and oppress Black Americans, particularly in the South.They began the Great Migration to cities in the 1910s. About 40,000 are farmers today, compared to the 1 million farmers in the beginning of slavery. Currently Black farmers face systemic barriers, but groups like Freedmen Heirs are working to restore equity and opportunity in agriculture. Programs like Freedmen Heirs support Black farmers through culturally tailored technical assistance, market access, and regenerative agriculture practices, aiming to build equity, sustainability, and success in agriculture.\nEighteenth century\nPlantation owners brought a mass of slaves from Africa and the Caribbean and Mexico to farm the fields during cotton harvests. Black women and children were also enslaved in the industry. The growth of Slavery in the United States is closely tied to the expansion of plantation agriculture. The contributions of enslaved people on early American agriculture has largely been discounted and ignored, mainly because of the lack of records not created by the slaveholder, often writing to justify enslavement\nHowever, many plantation owners relied on the agricultural knowledge that Africans brought over from across the Atlantic. The slaves had experience with farming and they used the knowledge they had with growing food and the owners needed them to use the skills they learned from their country before they became slaves. Perhaps the best example of this is rice cultivation in South Carolina, relying on indigenous West African knowledge of growing Oryza glaberrima. This specific knowledge was invaluable in transforming South Carolina into a rice producing powerhouse.\nWhile enslaved, people on plantations found ways to supplement their meager food rations by cultivating slave gardens. These slave gardens were usually near the slave cabins or remote areas of the plantation, and provided slaves with three benefits: nourishment, financial independence, and medicinal uses. These slave gardens allowed enslaved people some level of autonomy and agency; when they grew more than they could consume, they were able to sell.\nNineteenth century\nAntebellum South\nThe great majority of black farmworkers before 1865 were enslaved workers on Southern farms and plantations. Smaller numbers were free employees or farm owners. In South Carolina there were about 400 free black farmers in the rural parishes surrounding Charleston. As farmers their strategies, production, and rural lives resembled the poor white neighbors. Survival was a high priority and involved establishing economic self-sufficiency through concentration on food crops for their own families, and then by cultivating social advantages such as having a rich white patron.\nVirginia had a large free black element. By 1860, there were 58,000 free Black people living in Virginia; 80 percent in rural areas. Most lived on the Eastern Shore. One out of eight Black people in the state was free and the rest were enslaved in 1860. There were severe legal restrictions and terms of nonvoting, not testifying in court, not attending schools. Newly manumitted ex-slaves had to leave the state. However the same property laws were applied, allowing free Black people to own and operated 1202 small farms in 1860. They were patronized by some wealthy white landowners, who would hire them for cash wages from time to time. They were especially needed at harvest time,  and when it was necessary to replant the small tobacco plants. It was a political movement in 1853 to expel all free Black people from Virginia, but key White landowners intervened to block the proposal; they appreciated and often needed the labor of the free Black people. From the point of view of the free Black people, the small amounts of cash were useful; probably even more useful it was to be paid with old clothes, used tools, or young animals in lieu of cash wages. Above all, it was essential to their survival to be useful and available to politically powerful white neighbors.\nAfter emancipation\nAfter emancipation and the passage of the thirteenth amendment, Black slaves were legally freed, but most of them lacked any kind of material wealth and were thus led into other oppressive relationships. Many Black agriculturists were subjugated to land tenure agreements and working as sharecroppers, tenant farmers, and within the crop-lien system. Southern black cotton farmers faced discrimination from the north. Many white Democrats were concerned about how many of African Americans were being employed in the US cotton industry and the dramatic growth of black landowners. They urged white farmers in the south to take control of the industry, which from time to time resulted in strikes by black cotton pickers; for instance Black people led by the Colored Farmer's Association (CFA) strikers from Memphis organized the Cotton pickers strike of 1891 in Lee County in September, which resulted in much violence.\nFreedmen's Bureau Acts of 1865 and 1866\nOn March 3, 1865, Congress created the Freedmen's Bureau to help displaced Southerners, including newly freed African Americans, by providing essentials like food, shelter, medical care, and land. The Bureau was also responsible for setting up schools, overseeing labor contracts, and managing abandoned or seized lands. Essentially the goal of this act was to help freed slaves by giving them some necessities to succeed in the future. Originally meant to last only during the Civil War and one year after, attempts to extend it led to conflict between President Andrew Johnson and Radical Republicans, showing divisions over how to help integrate four million freed people into society. The dispute was over whether the federal or the state government should have control over the act.\nThe American Colonization Society\nMany political leaders and slave owners became worried about the growing population of free Black individuals in their states. People had a fear that the freed slaves would rebel and start violence. The organization was originally known as the American Society for Colonizing the Free People of Color of the United States, the American Colonization Society (ACS) was founded in 1816. This organization was formed to promote the colonization and removal of free Black people; the ACS soon gained support and funding from slave owners, Protestant, and even federal government officials. The ACE lacked long-term support and failed after Liberia's independence (The location where they would relocate the slaves). Seen as a solution to slavery and race issues, it ignored the views of free African Americans and ultimately worsened racial tensions, leading to its decline. The Supreme Court ruled the original Agricultural Adjustment Act (AAA) unconstitutional in 1936, but its core ideas were brought back later. The Soil Conservation and Domestic Allotment Act of 1936 acted as a temporary fix, leading to a revised version of the AAA passed in 1938.\nSharecropping\nSharecropping became widespread in the South during and after the Reconstruction Era. Sharecropping is a system where the land owners allow a worker to harvest their land in exchange for a share of the crop. This system emerged because freed slaves needed work and plantation owners needed labor after the Civil War. Since there was not much cash or a strong credit system, sharecropping became a common solution where landowners would trade some of their crops for labor. Freed slaves were often trapped in these situations due to high interest rates, unpredictable harvests, and dishonest landlords and merchants, which kept tenant farming families deeply in debt. They often lead freed slaves to carry that debt years into the future.\nDespite being low on the social ladder, sharecroppers organized for better rights, and the Southern Tenant Farmers Union gained strength in the 1930s. By the 1940s, the Great Depression and mechanization caused sharecropping to decline.\nDiscrimination\nBlack cotton farmers were very important to entrepreneurs which emerged during industrialization in the United States, particularly Henry Ford. The United States Emancipation Proclamation came into power on January 1, 1863, allowing a \"new journey for people of African ancestry to participate in the U.S. Agriculture Industry in a new way.\"\nTwentieth century\nJim Crow Law\nThe Jim Crow laws were introduced in the late 19th early and 20th century. It was implemented in the Southern United States and enforced racial segregation. The law forced racial separation in public places in the southern states and some other areas, starting in the 1870s. The last of the Jim Crow laws were generally overturned in 1965. This policy contributed to systemic inequality by restricting Black communities' access to land and resources, leading to environmental injustices that continue to impact marginalized groups today.\nConditions of Black farmers\nThe conditions for black cotton farmers gradually improved during the twentieth century. Ralph J. Bunche, an expert in Negro suffrage in the United States, observed in 1940 that \"many thousands of black cotton farmers each year now go to the polls, stand in line with their white neighbors, and mark their ballots independently without protest or intimidation, in order to determine government policy toward cotton production control\". However, discrimination towards Black people continued as it did in the rest of society, and isolated incidents often broke out. On 25 September 1961 Herbert Lee, a black cotton farmer and voter-registration organizer, was shot on the head by white State legislator E. H. Hurst in Liberty, Mississippi. Yet the cotton industry continued to be very important for Black people in the southern United States, much more so than for whites. By the late 1920s around two-thirds of all African-American tenants and almost three-fourths of the croppers worked on cotton farms. 3 out of every 4 black farm operators earned at least 40% of their income from cotton farming during this period. Studies conducted during the same period indicated that 2 in 3 black women from black landowning families were involved in cotton farming. In 1920, 24% (218,612) of farms in the nation were Black-operated, less than 1% (2,026) were managed by Black people, and 76% (705,070) of Black farm operators were tenants.\nThe cotton industry in the United States hit a crisis in the early 1920s. Cotton and tobacco prices collapsed in 1920 following overproduction and the boll weevil pest wiped out the sea island cotton crop in 1921. Annual production slumped from 1,365,000 bales in the 1910s to 801,000 in the 1920s. In South Carolina, Williamsburg County production fell from 37,000 bales in 1920 to 2,700 bales in 1922 and one farmer in McCormick County produced 65 bales in 1921 and just 6 in 1922. As a result of the devastating harvest of 1922, some 50,000 black cotton workers left South Carolina, and by the 1930s the state population had declined some 15%, largely due to cotton stagnation. However, it was not the collapse of prices or pests which resulted in the mass decline of African-American employment in agriculture in the American south. The mechanization of agriculture is undoubtedly the most important reason why many Black people moved to northern American cities in the 1940s and 1950s during the \"Great Migration\" as mechanization of agriculture was introduced, leaving many unemployed. The Hopson Plantation produced the first crop of cotton to be entirely planted, harvested and baled by machinery in 1944.\nAgricultural Adjustment Act of 1933\nThe Agricultural Adjustment Act of 1933 (AAA) offered subsidies to encourage the production of specific crops, but the USDA reinforced racial inequality by letting landowners keep the money meant for Black sharecroppers who worked the land. Since the process for filing complaints was basically closed off to Black farmers, they had no real way to claim what they were owed. Historians argue that this kind of discrimination pushed many Black farmers out of agriculture, although there is no hard data proving the long-term economic effects.\nTwenty-first century\nIn 2010, the United States Department of Agriculture vowed to pay some forty thousand black farmers $1.2 billion in total, as compensation for years of undue discrimination. Though funds were intended to be distributed by the end of 2012, the black farmers had yet to receive the designated remuneration by March 2013. In all, farmers in Pigford I who filed timely claims had received over $1 billion in payments. More than 60,000 farmers submitted late claim petitions in Pigford I. Late claimants in Pigford I were able to receive $1.1 billion in payments in the Pigford II claims process. 33,000 Black farmers in Pigford II received decision letters dated August 30, 2013, resulting from the late claims process that closed on May 11, 2012. About 18,000 Pigford II claims were eventually decided in favor of the farmers and 15,000 claims were denied.\nAs of 2012, there were 44,629 African-American farmers in the United States. The vast majority of  African-American farmers were in southern states.\nIn 2021, the Biden Administration proposed the American Rescue Plan, which will support agriculture, and of this, $10.4 billion will be allocated to \"disadvantaged\" farmers; Black farmers make up a quarter of these farmers. While the plan is associated with the administration's COVID-19 stimulus relief packages, it is the first wave of relief for Black farmers since the extent of the debt-relief Pigford v. Glickman was to offer.\nCurrent day discrimination\nHistorically, Black communities in the South were closely tied to agriculture. This led to a significant number of Black farmers in the region. Systemic issues like unclear property laws, where land was passed down without formal documentation, led to widespread land loss. In 1920, the population of black farmers was at 1 million, Today much less black farmers remain. This highlights the ongoing impact of racial discrimination and economic exclusion.\nThe history of colonization, slavery, and racism still affects land ownership and farming opportunities for Black people in the U.S. Black farmers face big challenges in getting loans because of unfair practices by banks and government programs. Many do not have enough property to secure loans and are seen as high-risk by banks because their farms are smaller and they earn less. Without loans, it is hard to pay for important things like seeds, animals, workers, and other things needed to have a successful farm.\nIn addition to financial challenges, Black farmers often struggle to access markets due to a lack of certifications, infrastructure, and technical support. Meeting buyer standards requires costly upgrades and training, which are difficult to obtain without adequate funding. These issues are deeply connected. This limits their income and growth. These barriers have contributed to the continued decline of Black-owned farmland and agricultural participation.\n>Organizations like the Freedmen Heirs Foundation, led by Seanicaa, are working to reverse this trend. The organization aims to empower Black farmers and level the playing field. Addressing these long-standing challenges requires a comprehensive approach.\nSolutions\n>Programs supporting Black farmers should focus on their unique needs. It is important that these programs understand and respect cultural differences, tailoring their support based on things like ethnicity or region. There is no one-size-fits-all solution. For Black farmers, this means providing education on best farming practices, financial skills, and business management that address their specific challenges. The goal is to help create successful farming businesses, increase market access, and boost diversity in the supply chain.\nMaking the process for grants and loans easier is key. With clearer instructions, simpler forms, and direct help, Black farmers can get the support they need more easily. Strong advocacy is crucial, too, to make sure policies are fair and resources are distributed properly. Technical assistance should also include help with marketing, access to new technologies, and opportunities to connect with others in the industry—because building relationships is crucial for sharing knowledge and growing businesses.\nFreedmen Heirs foundation\nFreedmen Heirs connects the gap between Black farmers and the marketplace by focusing on market access and providing technical assistance tailored to each farmer's needs. They support farmers with everything from understanding market dynamics and creating marketing plans to navigating USDA programs and making informed business decisions. Through their Social Mass Balance program, they help integrate Black farmers into supply chains while tracking their social and financial impact. They also host a webinar series in partnership with Resources for the Future and the Foundation for Food and Agriculture Research, exploring the costs and benefits of transitioning minority farmers to regenerative agriculture, offering practical solutions and support throughout the process. Only through this kind of structural change can Black farmers reclaim their place in American agriculture.\nRegenerative agriculture\nRegenerative agriculture is rooted in long-standing practices used by Indigenous and Black farmers. It focuses on improving soil health through methods like cover cropping, reducing synthetic inputs, and returning to more traditional, pre-industrial farming techniques.\nIn popular culture\nPicking cotton was often a subject which was mentioned in songs by African-American blues and jazz musicians in the 1920s–1940s, reflecting their grievances. In 1940, jazz pianist Duke Ellington composed \"Cotton Tail\" and blues musician Lead Belly wrote \"Cotton Fields\". In 1951, Big Mama Thornton wrote \"Cotten Picking Blues\". A number of blues and jazz musicians had worked on cotton plantations. Blues pianist Joe Willie \"Pinetop\" Perkins for instance had once been a tractor driver on a Mississippi plantation before enjoying a successful career with Muddy Waters. Lord Buckley once sang a song titled \"Black Cross\", pertaining to an educated black farmer murdered by a mob comprising white men.\nSee also\n*George Washington Carver\n* Black Belt in the American South\n*Black land loss in the United States\nReferences\nFurther reading\n* Alston, Lee J., and Joseph P. Ferrie. \"Social Control and Labor Relations in the American South Before the Mechanization of the Cotton Harvest in the 1950s\" Journal of Institutional and Theoretical Economics  (1989): 133-157 [https://www.researchgate.net/profile/Lee_Alston/publication/316687840_Social_Control_and_Labor_Relations_in_the_American_South_Before_the_Mechanization_of_the_Cotton_Harvest_in_the_1950s/links/590c8006458515897e4dfc25/Social-Control-and-Labor-Relations-in-the-American-South-Before-the-Mechanization-of-the-Cotton-Harvest-in-the-1950s.pdf Online].\n* Brown, D. Clayton. King Cotton: A Cultural, Political, and Economic History since 1945 (University Press of Mississippi, 2011) 440 pp.\n* Davis, Allison. Deep South: A Social Anthropological Study of Caste and Class (1941) classic case study from the late 1930s\n*\n* Johnson, Charles S. Statistical atlas of southern counties: listing and analysis of socio-economic indices of 1104 southern counties (1941). [https://books.google.com/books/about/Statistical_Atlas_of_Southern_Counties_L.html?id=ATjQAAAAMAAJ excerpt]\n* Kirby, Jack Temple. Rural Worlds Lost: The American South, 1920-1960 (LSU Press, 1986) major scholarly survey with detailed bibliography; [https://archive.org/details/ruralworldslosta0000kirb online free to borrow].\n* McDonald, Robin, and Valerie Pope Burnes. Visions of the Black Belt: A Cultural Survey of the Heart of Alabama (University of Alabama Press, 2015).\n* Ouzts, Clay. \"Landlords and tenants: sharecropping and the cotton culture in Leon County, Florida, 1865-1885.\" Florida Historical Quarterly 75.1 (1996): 1-23. [https://www.jstor.org/stable/30142150 Online]\n* Raper, Arthur F. Preface to peasantry: A tale of two black belt counties (1936, reprinted  Univ of South Carolina Press, 2005), a classic study of Black Belt life [https://www.amazon.com/Preface-Peasantry-Tale-Black-Counties/dp/1570036039/  excerpts]; [https://archive.org/search.php?query=title%3A%28%27%27Preface+to+peasantry%22%29&page=2 Online free to borrow].\n* Reynolds, Bruce J. Black farmers in America, 1865-2000: the pursuit of independent farming and the role of cooperatives (US Department of Agriculture . No. 1502-2016-130760. 2003) [https://ageconsearch.umn.edu/record/117049/files/RR194.pdf Online].\n* Rothman, Adam.  Slave Country: American Expansion and the Origins of the Deep South (2007)\n* Sharpless, Rebecca. Fertile ground, narrow choices: Women on Texas cotton farms, 1900-1940 ( UNC Press Books, 1999).\n* Sumners, Joe A. and Amelia H. Stehouwer. \"Politics and Economic Development in the Southern Black Belt\" in The Oxford handbook of Southern politics ed. by  Charles S. Bullock III and Mark J. Rozell. (2010).\n* U. S. Civil Rights Commission. The Decline of Black Farming in America (1982).\n* Vance, Rupert B. Regionalism and the South (UNC Press Books, 1982).\n* Whayne, Jeannie. \"Race in the Reconstruction of Rural Society in the Cotton South since the Civil War.\" in Race and Rurality in the Global Economy ed by Michaeline A. Crichlow, et al.  (2018): 247–284.\n* Wimberley, Dale W. \"Quality of life trends in the Southern Black Belt, 1980-2005: a research note.\" Journal of Rural Social Sciences 25.1 (2010) [http://journalofruralsocialsciences.org/pages/Articles/JRSS%202010%2025/1/JRSS%202010%2025%201%20103-118.pdf Online].\n* Winemiller, Terance L. \"Black Belt Region in Alabama\" Encyclopedia of Alabama (2009) [http://www.encyclopediaofalabama.org/article/h-2458 online]\nExternal links\n* [http://www.mybfaa.com/ Black Farmers and Agriculturalists Association Inc.]"
    }
  ]
}