{
  "content": [
    {
      "type": "text",
      "text": "# Historical nihilism__disambig_1\n\nHistorical nihilism () is a term used by the Chinese Communist Party (CCP) and some scholars in China to describe research, discussions, or viewpoints deemed to contradict an official state version of history in a manner perceived to question or challenge the legitimacy of the CCP. The CCP opposes historical interpretations that are critical of it, the People's Liberation Army, socialism, and related topics. Viewpoints that the state judges to be historical nihilism are subject to censorship and legal prosecution.\nIn a January 2013 speech, CCP general secretary Xi Jinping described \"hostile forces\" as using historical nihilism to weaken the party's rule by smearing its history. In early 2021, Xi increased efforts to promote a \"correct outlook on history\" ahead of the 100th Anniversary of the Chinese Communist Party, including opening a telephone hotline and website for citizens to report people who engage in acts of historical nihilism.\nBackground\nHistorical nihilism has been defined in CCP publications as criticism of the entirety of an entity, such as the CCP, its national heroes, leaders, socialism and its official history, by citing only certain events about the entity without consideration of the whole. Although 'incorrect' interpretations of history would have been censored and punished during the period of Mao Zedong (1949–1976) and Deng Xiaoping (1978–1989), neither leader made a clear attempt to engage against 'historical nihilism' as it is specifically understood today. According to Chinese historian Zhang Lifan, the main push to fight against 'historical nihilism', according to its specific modern meaning, undertaken by the CCP has its origin following the 1989 Tiananmen Square protests and massacre and coinciding events within the Eastern Bloc. In December of that year, Jiang Zemin made a speech in which he said that bourgeois liberalization had led to the spread of 'national nihilism' and 'historical nihilism', which had entered party thinking and brought about confusion.\nHistorical nihilism is one of \"The Seven Noteworthy Problems\" discussed in the 2012 Communiqué on the Current State of the Ideological Sphere (Document No. 9). It states that the main expressions of historical nihilism are:\nIn 2013, Xi introduced the idea of the \"Two Undeniables\", which he described as \"we must not use the period of history after reform and opening to deny the period of history prior to reform and opening\" and we \"must not use the period of history before reform and opening to deny the period of history after reform and opening\". This view is sometimes expressed as the motto, \"the two thirty years should not negate each other\".\nGovernment uses of the term\nMedia and education in China is not allowed to represent history in a manner that is forbidden by government censors. In 2018, the Law on the Protection of Heroes and Martyrs criminalized speech deemed slander of \"heroes and martyrs\". The Chinese Academy of Social Sciences established a specialized unit to propagate an official version of history.\nTopics on things like the Great Chinese Famine, the Cultural Revolution and 1989 Tiananmen Square protests and massacre are often scrubbed or at least depicted in such a way as to avoid blame on the party. In May 2021, the Cyberspace Administration of China confirmed it had deleted over 2 million posts for historical nihilism. In 2023, a previously official history textbook about the Mongols in China was banned for historical nihilism. Modern Chinese history is generally presented to praise the achievements of the CCP and its role in creating a prosperous 'new China'.\nWhen Xi Jinping became CCP general secretary and paramount leader in January 2013, he made a speech in which he said, 'The history of the post-reform period cannot be used to contradict the history of the pre-reform period, and the history of the pre-reform period cannot be used to contradict the history of the post-reform period'. Although China's reforms since the 1980s caused it to radically change and abandon many of the Marxist policies that had existed under Mao Zedong, the official state-sanctioned version of history under Xi Jinping teaches an interpretation of continuity, praising both the contributions made by the CCP of Mao's generation and the CCP of the post-reform period. This is in contrast to interpretations in the period prior to Xi Jinping whereby some of Mao's policies could receive heavy criticism and the official stance of the party was a rejection of the Cultural Revolution, which had been referred to as the 'Ten Year Calamity' (十年浩劫).\nIn 2025, the Study Times of the CCP's Central Party School stated that historical nihilism had become \"subtle and covert\" in an era of artificial intelligence.\nCollapse of the Soviet Union\nIn a 2013 speech, Xi Jinping described historical nihilism as contributing to the collapse of the Soviet Union:\nIn February 2022, the CCP published the documentary Historical Nihilism and the Disintegration of the Soviet Union. The documentary argues that Nikita Khruschev \"lit the fire of nihilism\" by criticizing predecessor Joseph Stalin in his On the Cult of Personality and Its Consequences speech.\nJi Zhengju described the lesson that the CCP draws from historical nihilism in the Soviet Union as \"weakening and abandonment of Party guidance in the ideological field serves the schemes of western powers to divide, westernize, and vilify the system, and leads to the proliferation of all kinds of erroneous thought tides.\" CCP leadership expresses concerns about historical nihilism in the context of the Soviet Union's experience with the refrain, \"[t]he Soviets won the October Revolution with only a few hundred thousand members; it defeated the Nazis with a few million; but when it had tens of millions of members, it suffered a tragic collapse.\"\nAcademic analysis\nAcademics Jian Xu, Qian Gong, and Wen Yin write that the CCP's attention to historical nihilism \"has gained momentum in the 21st century due to the rise of market-oriented cultural production in post-socialist China as well as the development of new media technologies.\" They cite the TV drama adaptation of \"Red Classics\" as \"a pertinent example of historical nihilism caused by market orientation in cultural production,\" explaining:\nOther uses of the term\nAccording to Suisheng Zhao, some mainland Chinese scholars contend that Western scholars who describe the Qing dynasty as expansionist of engaging in historical nihilism. In the view of these scholars, some Westerner scholars attempt to emphasize aggressive aspects of the Qing in order to demonstrate that modern China is inevitably aggressive.\nAcademic Roland Boer defines several genres of China-related narratives as historical nihilism, citing the \"China doomer\" narrative exemplified by Gordan G. Chang's The Coming Collapse of China (2001), anti-communist tropes, atrocity propaganda, and \"betrayal\" narratives in which Deng Xiaoping is cast as bringing capitalism to China.\nSee also\n* Ideology of the Chinese Communist Party\n* Censorship in China\n* Four Confidences\nCitations"
    }
  ]
}