{
  "content": [
    {
      "type": "text",
      "text": "# History of Morelos, Conquest and Revolution\n\nHistory of Morelos, Conquest and Revolution (1929–1930) was a fresco painted by Mexican artist Diego Rivera in Cuernavaca's Palace of Cortés. The piece was commissioned by Dwight Morrow, U.S. Ambassador to Mexico at the time.\nRivera chose the history of Mexico's conquest for the subject of the mural. The mural begins with the invasion of Mexico by the Spanish, going in chronological order of Mexico's history from that invasion. Rivera chose to focus on the region of Cuernavaca, as that was the mural's location, and the Indigenous peoples of that region, showing their reactions towards the Spaniards' invasion and the events that took place afterwards. It is still available for viewing inside the Palace of Cortés in Cuernavaca today.\nAbout the artist\nDiego Rivera was a well-known artist from Mexico. He was born in Guanajuato, Mexico and began studying art at the Academy of San Carlos in Mexico City by the age of ten. In his adult years, Rivera spent time studying art in Europe both in Madrid, Spain and Paris, France. While there, he spent time with other artists, such as Ilya Ehrenburg and Max Jacob, learning new styles of art. Rivera returned to Mexico in 1921 and then began his career in muralism.\nComing back to Mexico during the middle of its political revolution, Rivera was drawn in by then Mexican Secretary of Education, José Vasconcelos, who called him to create paintings on the walls of prominent state buildings. Rivera then began to partake in the muralist movement, creating works dealing with the political issues of the time – revolutionary nationalism – in relation to Mexico's past and quickly becoming one of the most well known artists of the Mexican muralism movement, with many considering Rivera's pieces to be unforgettable, as they stick within the minds and hearts of those that see them.\nThere are many murals that Rivera is known for. Some of his earlier murals include those at Chapingo Chapel and those at the Ministry of Education (Secretariat of Public Education). Both of these works focused on revolutionary ideas of the time and the timeline of the Mexican revolution itself. One of his later works, located at the National Palace in Mexico City and titled History of Mexico, incorporates an illustration of Mexico's history with an illustration of the revolution currently taken place. Rivera also incorporated communist and socialist imagery into the mural, as he became a member of the Mexican Communist Party after returning to Mexico. Later, however, he was told to leave the party due to his affiliations and workings with the United States and the Mexican government.\nPalace of Cortés\nThe Palace of Cortés was built as a place of refuge for Conquistador Hernán Cortés and his family after the conquest of Mexico by the Spanish. The land was gifted to Cortés which he then used to build his secondary palace. Construction dates are estimated between the late 1520s and early 1530s. It was used as the Cortés family's personal home for some time and then was transformed into a prison, state legislature, and eventually into a museum, which it remains as currently.\nCommission\nDwight Morrow, U.S. Ambassador to Mexico from 1927 to 1930, commissioned Rivera to do the piece in 1929. It was meant to represent an act of good will and good intention towards Mexico and the city of Cuernavaca. However, some believe it to be a strategic move of diplomacy after Morrow had worked with Mexican president, Plutarco Calles, to amend Mexican legislation in favor of American investors. Rivera agreed to complete the commission, on the condition that he be granted free rein over the subject chosen for the mural.\nDescription\nThe mural is a linear portrayal of Mexico's history, focusing on the city of Cuernavaca, painted in a chronological sequence. Because of the chronological sequence Rivera painted it in, the mural must be read from right to left. It takes up three walls and other smaller sections of an open corridor on the second floor of the palace, totaling 148.6 square meters of painted space. The mural ultimately has two different sections – the upper half, being the nine panels in color, and the lower half, being the eleven grisailles in black and white or grey.\nThe grisailles pieces underneath tell the story of Cortés' disembarkation and his initial meetings with the Indian locals and emissaries sent out by Moctezuma, as well as a paralleled representation of the story shown above. The remaining portions of the mural, in vivid color, go in detail about the actual conquest of the Mexican people in Cuernavaca as well as the fights and societal changes which took place after the conquest. Starting from the first panel, Rivera shows the fights which took place during the Spanish conquest. He portrays Aztec warriors and Spanish soldiers in their traditional war gear, showing the stark contrast between the metal uniforms of the Spaniards and the colorful war costumes of the Aztecs with their spiked wooden clubs. The mural moves on to show the defeat of the Indians in Cuernavaca and the events which took place afterwards, during Spanish rule. Rivera depicts the building of the Palace of Cortés by Indian slaves and then shows them as laborers for the Spanish ruled state of Morelos, in which they were predominantly sugarcane cutters.\nRivera then proceeds to show the religious history and details the conversions by Catholic priests which took place throughout Mexico. The conversions are shown to be seemingly peaceful but also show the cruelty behind such conversions and what happened to the Indians throughout them. In the smaller piece above the doorway towards the end of the corridor, Rivera depicts persecutions and burning of Indian heretics by the Spanish, which mirrors the Aztec sacrifices that Rivera placed at the beginning of the mural. The last panel shows an image of Emiliano Zapata – a main and important figure in the Mexican revolution – depicting liberation from Spanish colonial rule.\nInterpretation\nRivera made sure that he could choose the subject of this mural. Because he was working on his mural for the National Palace at the time, he decided to continue with his theme of Mexico's history in relation to Spanish conquest and the hardships natives endured because of it. Rivera portrays the dominance of the Spanish over the Indians in warfare and the violence which the Indians endured. Although the mural focuses on the accurate depiction of Mexico's history and its people's experiences with European conquest, it also is meant to show the nationalism of the Mexican people who were affected by such conquest. Through Rivera's idealistic depiction of Mexico and a darker, more negative depiction of the European world, one can see a message of Mexican integrity. In Rivera's opinion, the indigenous peoples were a perfect picture of resistance against colonialism and Mexican independence.\nDue to the subject of the mural and the backstory of its commission, there are many political interpretations of Rivera's work. A major political message throughout the mural is that of European invasion of Mexico and its culture. Rivera uses the influence of Italian renaissance compositional form, such as the grisailles, to show that European existed in the past and still currently exists. Rivera placed a small painting of an Aztec human sacrifice at the beginning of the corridor in order to allude to the brutalities committed by Spanish invaders, showing the exchange of Mexican culture's cruelty for the cruelty of Spanish culture. However, the final images of Zapata symbolize Mexico's liberation from Europe and colonialism.\nControversy and irony\nPrior to working on this piece, Rivera was a steady member of the Mexican Communist Party. He was a strong supporter of Karl Marx and a strong nationalist and anti-imperialist. Rivera's murals were known for having heavy political connotations with references to Marx and other revolutionary figures. Despite this, Dwight Morrow, the U.S. Ambassador and an American capitalistic, commissioned Rivera for the piece. Because of Rivera's agreement to complete this project and others within the United States and for the Mexican government, the Mexican Communist Party began to doubt his loyalty to their cause. They ultimately kicked Rivera out of the party and he later went to the U.S. in order to work on other pieces.\nSee also\n* List of works by Diego Rivera\nReferences"
    }
  ]
}