{
  "content": [
    {
      "type": "text",
      "text": "# Historical Far Left\n\n| leader1_title    = Leaders\n| leader1_name     = Agostino BertaniFelice CavallottiAndrea CòstaFilippo TuratiEttore Sacchi\n| foundation       =\n| dissolution      =\n| predecessor      = Action Party\n| successor        = Italian Radical Party\n| headquarters     = Palazzo Montecitorio, Rome\n| ideology         = RepublicanismNationalismRadicalismSocialismAnti-clericalism\n| position         = Left-wing\n| colours          =\n| country          = Italy\n}}\nThe Historical Far Left (), originally known as Far Left (), Radical Extreme (), simply The Extreme (), or Party of Democracy (), was a left-wing parliamentary group and coalition of Radical, Republican and Socialist politicians in Italy during the second half of the 19th century. Formerly known as the extreme wing of the Historical Left before the unification of Italy, it became a separate group when the more moderate branch of the Left accepted the leadership of the House of Savoy to build the new Italian state.\nHistory\nThe Historical Far Left was founded in 1877 by Agostino Bertani and Felice Cavallotti as a radical-liberal party. In 1882, the Radicals formed a far-left parliamentary group with Andrea Costa, the first Socialist to be elected to the Italian Parliament. The party supported complete separation of church and state, decentralization toward municipal governments, the United States of Europe according to Carlo Cattaneo's beliefs, progressive taxation, an independent judiciary, free and compulsory education for children, universal suffrage, women's and workers' rights while opposing capital punishment as well as any kind of protectionism, nationalism, imperialism and colonialism.\nThe Extreme was mainly formed by three groups:\n* The Radicals, which supported democratic ideas, transitionally accepting the constitutional monarchy if it would allow universal suffrage.\n* The Republicans, which insisted upon an Italian Republic and consequently refused any collaboration with the existing monarchist state.\n* The Socialists, which saw the universal suffrage and the proclamation of the republic as a first step to a social revolution.\nThe Historical Far Left, supporting the republic and consequently the abrogation of the Albertine Statute, was seen as an anticonstitutional movement. Under the oligarchic electoral law of newly unified Italy, there were no possibilities for The Extreme to enter the Italian Parliament, except for some national heroes such as Giuseppe Garibaldi. The electoral reform of 1882 allowed the possibility to form a small opposition parliamentary group, but only after the introduction of the universal suffrage in 1913 did The Extreme become the dominant left-wing party of the Italian Chamber of Deputies and the winning coalition in many municipal and provincial elections in Northern Italy.\nThe Historical Far Left emerged as an important parliamentary force when the progressive Historical Left overthrew Marco Minghetti's government during the so-called Parliamentary Revolution of 1876, which brought Agostino Depretis to become Prime Minister. However, Depretis immediately began to look for support among the Right Members of Parliament, who readily changed their positions, in a context of widespread corruption. This phenomenon, known in Italian as trasformismo (roughly translatable in English as \"transformism\"—in a satirical newspaper, Prime Minister Depretis was depicted as a chameleon), effectively removed political differences in Parliament, which was dominated by an undistinguished liberal bloc with a landslide majority until after World War I.\nImportant members\nImportant leaders and members of the Historical Far Left were Agostino Bertani, Andrea Costa, Filippo Turati, Napoleone Colajanni, Francesco Saverio Nitti, Giovanni Bovio, Giovanni Cantoni, Felice Cavallotti, Enrico Ferri, Ernesto Nathan and Ettore Sacchi.\nElectoral results\n{|class=wikitable style=\"width:50%; border:1px #AAAAFF solid\"\n|-\n|colspan=6|Chamber of Deputies\n|-\n!width=13%|Election year\n!width=16%|Votes\n!width=6%|%\n!width=1%|Seats\n!width=8%|+/–\n!width=18%|Leader\n|-\n!1861\n|Unknown (3rd)\n|2.3\n|}}\n| 14}}\n| rowspan=\"2\" |\n|-\n!1865\n|Unknown (3rd)\n|4.9\n|}}\n| 1}}\n|-\n!1867\n|Unknown (3rd)\n|\n|}}\n| 15}}\n| rowspan=\"6\" |\n|-\n!1870\n|Unknown (3rd)\n|1.9\n|}}\n|\n|-\n!1874\n|Unknown (3rd)\n|1.6\n|}}\n|\n|-\n!1876\n|Unknown (3rd)\n|1.5\n|}}\n|\n|-\n!1880\n|Unknown (4th)\n|1.8\n|}}\n|\n|-\n!1882\n|105,251 (3rd)\n|8.6\n|}}\n| 44}}\n|-\n!1886\n|123,958 (3rd)\n|5.2\n|}}\n| 1}}\n| rowspan=\"5\" |\n|-\n!1890\n|101,924 (3rd)\n|6.9\n|}}\n| 3}}\n|-\n!1892\n|182,256 (3rd)\n|11.0\n|}}\n| 14}}\n|-\n!1895\n|224,879 (3rd)\n|18.5\n|}}\n| 6}}\n|-\n!1897\n|201,120 (3rd)\n|16.2\n|}}\n| 20}}\n|-\n!1900\n|333,945 (2nd)\n|26.3\n|}}\n| 14}}\n|\n|}\nReferences"
    }
  ]
}