{
  "content": [
    {
      "type": "text",
      "text": "# History of Workington\n\nWorkington was historically a part of Cumberland now Cumbria, an historic county in North West England; the area around Workington has long been a producer of coal, steel and high-grade iron ore.\nRoman times (AD 79–410)\nBetween 79 and 122, Roman forts, mile-forts and watchtowers were established down the Cumbrian coast. They acted as coastal defences against attacks by the Scoti in Ireland and by the Caledonii, the most powerful tribe in what we now call Scotland.  The 16th century book, Britannia, written by William Camden describes ruins of the coastal defences at Workington.\nThe fort, now known as Burrows Walls, was established on the north bank of the mouth of the River Derwent, near present-day Siddick Pond and Northside. Another fort or watchtower would have been on How Michael to the south side of the river, near present-day Chapel Bank. In 122, the Romans begin building Hadrian's Wall from Bowness on the Solway Firth to Wallsend on the North Sea. The discovery of a Roman fort around the parish church in Moresby to the south, and fortifications to the north at Risehow (Flimby), Maryport and Crosscannonby support the argument that the coastal wall extended down the whole Solway coast and formed a key part of the empire's defences.\nFor many years Burrow Walls was believed to be the fort Gabrosentum or Gabrocentio, found in The Notitia Dignitatum for Britain, which lists several military commands (the Dux Britanniarum, the Count of the Saxon Shore (Comes Litoris Saxonici per Britannias) and the Comes Britanniarum). The word Gabrocentum has its origins in the Welsh or Ancient British gafr meaning \"he goat\" and the word hynt (set in Old Irish) meaning \"path\". Today, many scholars believe it is more likely to be the fort known as Magis.\nMiddle Ages\nAnglo-Saxon\nThe name Workington, is believed to be derived from three Anglo-Saxon words; Weorc (most probably a man's name), the suffix -ingas (the sons or people of ...) and tūn (settlement/estate/enclosure). The settlers were a group of people whose leader called himself Weorc. Over 1000 years ago, the original inhabitants of the land would have called themselves Weorcingas (Weorc's people) and the settlement Weorcinga tun (estate of the Weorcingas). Over a period of almost 1000 years, the town's name has been written in at least 105 ways:\nIn 1533, John Leland) believed the town derived its name from the River Wyre.  But the River Wyre has its origins at Ellerbeck, Hunday and Distington and actually enters the Solway at Harrington. In 1688, William Camden quotes Leland, writing that the Wyre \"…falls into the Derwent at Clifton…\".\nIt is believed that there was a religious community of monks, with links to Lindisfarne, living and working where St Michael's Church stands today. At that time, higher sea levels would mean the community may have lived on an island south of the river's mouth. The Lindisfarne monks attempted to cross the Solway Firth to Ireland in a boat, but a strong storm blew up and the Lindisfarne Gospels were lost overboard. The monks were forced back to shore. Tradition says that the Gospels, which were probably inside a wooden box, were discovered water-stained but safe in the sea near Candida Casa on the Isle of Whithorn.\nThe Vikings\nA Viking sword was discovered at Northside, which is belied to indicate that there was a settlement on the river mouth. The sword is thought to be part of a burial, in an area which has subsequently been shown to be rich in evidence of Viking period activity.\nThe Curwens\nThe Curwens, who were Lords of the Manor of Workington, were heavily involved in the First War of Scottish Independence. The Curwen family motto, \"''Si je n'estoy''\" (\"If I had not been there\"), is said to come from the words of Sir Gilbert (ii) de Curwen, whose late arrival with fresh troops recruited from his estates turned the course of the Battle of Falkirk (1298), giving King Edward victory. It has been suggested that Gilbert waited until he knew who looked like winning before joining battle, because he had family supporting both sides in the conflict. It was at this battle that William Wallace was defeated and subsequently executed.\nIn 1306 Robert the Bruce was crowned King Robert I of Scotland. In 1307, The Calendar of Patent Rolls of King Edward I of England records his preparing for war against Robert the Bruce. He requests lords of the manor to provide ships, barges and 'find them in men and necessaries' to continue the war. It read:\n}}\nThe Curwens were again expected to provide support and troops to fight in the Second War of Scottish Independence.\nSir Gilbert (iii) de Curwen (c. 1296 – 1370), received his knighthood on the battlefield at Crecy in 1346. He and his men fought alongside King Edward III of England as he attempted to seize the French throne after the death of Charles IV. In 1379, Sir Gilbert (iv) de Curwen (died c. 1403) received a licence to fortify and crenellate the pele tower built by his father in Workington in 1362. Sir Gilbert is believed to have died in 1403 during the great pestilence (plague), which also killed his first son, Sir William (i), who inherited his title. The Black Death is estimated to have killed 30% to 60% of Europe's population, reducing the world's population from an estimated 450 million to between 350 and 375 million by 1400. This has been seen the cause of a series of religious, social and economic upheavals which profoundly affected the course of European history.\nCurwen tradition believes that at least one member of the family fought with Henry V at the Battle of Agincourt in 1415. The roll mentions a John Werkyngton. This very unusual spelling matches with '...the manor of Werkyngton, co. Cumberland...' written in King Henry's Patent Rolls in 1405. John may have been a younger Curwen son, a cousin or a man of standing from the community. The names of the thousands of archers and ordinary private soldiers are not on the roll.\nIn 1428, Henry VI of England, granted Sir Christopher (ii) de Curwen (1382–1453), the Castle and land of Cany and Canyell in Normandy, France as a reward for \"good service\". In 1429, he returned to northern England to fight an invasion by the Scots. In 1442, he oversaw the truce between Henry VI of England and King James II of Scotland. The lands in Normandy were lost to the French in 1450. Sir Christopher and his wife, Elizabeth Huddleston, are buried inside St Michael's Church, under a heavily carved tombstone bearing their effigies.\nSir Thomas (iv) Curwen (c. 1494 – 1543) married Agnes, daughter of Sir Walter Strickland and great-granddaughter of Anne Parr. The royal blood of the Plantagenets came to the Curwen house.. according to the book Papers and Pedigrees by William Jackson (1892).}}\nMary, Queen of Scots, escapes to Workington (1568)\nIn 1568, Mary wrote a letter from Workington Hall to Queen Elizabeth I of England. After the defeat of her forces at the Battle of Langside and disguised as an ordinary woman, Mary, Queen of Scots, crossed the Solway Firth and landed at Workington.  She spent her first night in England as an honoured guest at Workington Hall. On 18 May 1568, Mary was escorted to Carlisle Castle after spending a day at Cockermouth. She was 25 years old.\nWilliam Camden's Britannia (1586)\ndescribed Wirkinton as 'a place famous for taking of Salmons'.]]\nThis extract from Philemon Holland's English translation of Britannia (1610) describes Wirkinton:\nSince the eighteenth century\nJohn Christian Curwen (1756–1828)\n\"The greatest strides in Curwen initiative occurred during the lordship of John Christian Curwen\". Workington changed radically both economically and socially, during the period when John Christian was lord of the manor (1783–1828). A Curwen through his mother's side, it was said  of him \"he is the man who stands out...who must rank as one of the most interesting and progressive of Cumbrians of his day\". He was Member of Parliament for Carlisle from 1796 to 1812 and from 1816 to 1820, following this with a period as member for Cumberland from 1820 to 1828. He made a national mark in his campaigns for reform of the Corn Laws and Agrarian Laws, and for Catholic emancipation especially the Roman Catholic Relief Act 1791 (31 Geo. 3. c. 32). His influence was such that he was offered peerages by both Addington and Castlereagh but he turned them down. His practical interest in agricultural reform can be traced in the proceedings of the Workington Agricultural Society, of which he was founder-president. Cumbrian archive records contain reports on Curwen's experimental farm at the Schoose, and on such other items as the estate he purchased between Windermere and Hawkshead, Lancashire, in order to encourage forestry. By planting over 800,000 trees around Windermere he transformed that area of the Lake District. An active supporter of the abolition of slavery, his friend and party activist William Wilberforce spent time with John Christian on Belle Isle.\nTo modern eyes, however, one of the most interesting of his projects was his introduction of social security and mutual benefit schemes for his farm and colliery workers.\nEducation\nEducational institutions include:\n* Patricius Curwen's school on the High Street (1664 – 1813), became the 'National' school in Portland Square (est. 1813),\n* Wilson Charity School (1831 – 1967) on Guard Street which became the Higher Standard Council School (locally called 'Guard Street'),\n* St John's School (1860 – present) on John Street,\n* St Michael's School (1860 – present),\n* Lawrence Street School (Marshside) (1874 – 1979),\n* Victoria School,\n* Northside School (1878 – present),\n* Siddick School (1902 – 1967),\n* Seaton School,\n* Bridgefoot School,\n* Westfield School,\n* Moorclose School (1967 – 1984),\n* Newlands School (1909 – 1984),\n* Workington Grammar School (Workington County Technical and Secondary School) (1912 – 1984),\n* Lillyhall School, Distington (1961 – 84),\n* Distington School,\n* St Joseph's Catholic High School (1929 – present),\n* Derwent Vale School, Great Clifton,\n* Ashfield School,\n* Salterbeck School (1954–1984),\n* Southfield School (1984–2015),\n* Stainburn School (1984–2015),\n* Workington Academy (2015–present),\n* Beckstone Primary School, Harrington, Cumbria.\nReferences\nExternal links\n* [http://www.cumbriacountyhistory.org.uk/township/workington  Cumbria County History Trust: Workington] (nb: provisional research only – see Talk page)"
    }
  ]
}