{
  "content": [
    {
      "type": "text",
      "text": "# History of foreign relations of the People's Republic of China\n\n}}\nSince the early 1980s China has pursued a highly independent foreign policy, formally disavowing too close a relationship with any country or region. The stated goals of this policy were safeguarding world peace, opposing all forms of hegemony, and achieving economic modernization at home. Chinese statements repeatedly emphasized the interrelation among these goals. In other words, China needed a peaceful international environment so that adequate resources could be devoted to its ambitious development plans. The goal of economic modernization was a driving force behind China's increasingly active participation in world affairs, exemplified by its policy of opening up to the outside world, which greatly expanded Chinese economic relations with foreign countries. As part of what it called an \"independent foreign policy of peace\", Beijing has joined numerous international organizations, and it has maintained diplomatic relations with more nations than at any time since the founding of the People's Republic of China in 1949. By 2007, China has diplomatic relations with 157 nations, and—in contrast with earlier periods—has been willing to interact with governments of different social systems or ideologies on a basis of peaceful coexistence, mutual respect and development.\nOverview\nAnother characteristic Chinese foreign policy has had in common with that of many other countries is that the actual conduct of foreign relations sometimes has been at odds with official policy. Beijing's stress on principles in its official statements at times makes the contrast between statements and actions particularly noticeable. In addition, a nation's leaders must often make right decisions in reaction to events and circumstances, rather than simply formulating a rational foreign policy based on their goals. The need to react to what has happened or what may happen adds an element of unpredictability to foreign policy decision making, as has been the case at several crucial junctures in Chinese foreign relation since 1949.\nIn addition to the aspects of foreign policy formulation and implementation that China has in common with other countries, China's foreign policy from 1949 has had these characteristics: contrast between practicality and adherence to principles; fluctuation between militancy and peacefulness; tension between self-reliance and dependence on others; and contrast between China's actual and potential capabilities. These contradictory characteristics have at times created a confusing picture of Chinese foreign policy: is Chinese foreign policy basically pragmatic or primarily based on principles? Is China peace-loving or intent on fomenting unrest? Is China's ultimate goal to be self-sufficient or economically interdependent with the rest of the world? And is China basically a poor, developing country that is at most a regional power or actually a nascent economic and military giant deserving of superpower status?\nThe response to these questions is that since 1949 Chinese foreign policy has reflected all of these contrasting features. Beijing had emphasized principles and ideology above everything else in foreign relations, especially during the 1950s and 1960s, but Chinese leaders at times have also shown a practical side that gave them the flexibility to change policies, sometimes drastically, when they deemed it in China's best interest. One of the most dramatic changes was the shift from an alliance with the Soviet Union against the United States and Japan in the 1950s to an explicitly anti-Soviet policy and rapprochement with Japan and the United States in the 1970s. Since 1949 Chinese foreign policy has fluctuated between periods of militancy, for example during the Cultural Revolution (1966–76), when China called for worldwide revolution, and periods when Beijing has been a chief proponent of peaceful coexistence among nations, such as during the mid-1950s and again during the 1980s. How self-reliant or dependent on others China should become in order to modernize has been a constant dilemma in Chinese policy since the nineteenth century. As this policy fluctuated, Chinese foreign relations have alternated between a tendency toward isolation and periods of openness to foreign assistance and influence. Finally, the contradiction between China's actual capabilities since 1949 and its perceived potential has been another salient and distinctive feature of its foreign relations. China's tremendous size, population, natural resources, military strength, and sense of history have placed it in the unusual position of being a developing country that has often been treated as a major global power having a special relationship with the United States and, Russia, previously, the Soviet Union.\nSince 2010s, Chinese Communist Party (CCP) general secretary Xi Jinping's foreign policy writ large, perceived anti-China hostility from the West amongst Chinese government officials, and shifts within the Chinese diplomatic bureaucracy have been cited as factors leading to its emergence. It is commonly known as \"Wolf warrior diplomacy\". In March 2020, Reuters reported that two Chinese diplomats confirmed that Xi Jinping, then CCP general secretary, had written a note last year asking diplomats to take a tough stance and show a \"spirit of struggle\" in the face of deteriorating US-China relations and other international challenges.\nEvolution of foreign policy\nUnderstanding the origins and forces that have shaped China's foreign policy provides a framework in which to view both the changes and the continuities in Chinese foreign policy from 1949. The origins of China's foreign policy can be found in its size and population, historical legacy, worldview, nationalism, and Marxism-Leninism&ndash;Mao Zedong Thought. These factors have combined with China's economic and military capabilities, governmental structure, and decision-making processes to make certain foreign policy goals prominent: security, sovereignty and independence, territorial integrity and Chinese unification, and economic development.\nHistorical legacy and worldview\nChina's long and rich history as the world's oldest continuous civilization has affected Chinese foreign relations in various ways. For centuries the Chinese empires enjoyed basically unchallenged greatness and self-sufficiency. China saw itself as the cultural center of the universe, a view reflected in the concept of the \"central state\" (Zhongguo, the Chinese word for China). For the most part, it viewed non-Chinese peoples as uncivilized barbarians. Although China was occasionally overrun and ruled by these \"barbarians\", as during the Yuan (1279–1368 A.D.) and Qing (1644–1911 A.D.) dynasties, the non-Chinese usually retained enough Chinese institutions to maintain a continuity of tradition. Because the Chinese emperor was considered the ruler of all mankind by virtue of his innate superiority, relations with other states or entities were tributary, rather than state-to-state relations between equals. Traditionally, there was no equivalent of a foreign ministry; foreign relations included such activities as tributary missions to the emperor made by countries seeking trade with China and Chinese military expeditions against neighboring barbarians to keep them outside China's borders. The first Europeans who sought trade with China, beginning in the sixteenth century, were received as tributary missions and had to conform to the formalities and rituals of the tribute system at the Chinese court. China's view of itself as the undisputed center of civilization—a phenomenon called sinocentrism—remained basically unchanged until the nineteenth century, when the Qing dynasty began to deteriorate under Western pressure.\nA traditional concept related to China's view of itself as the \"central state\" that continues to have relevance is the idea of \"using barbarians to control barbarians.\" In modern times, this practice has taken the form of using relations with one foreign power as a counterweight to relations with another. Two examples are China's policy of \"leaning to one side\" in the Sino-Soviet alliance of the 1950s for support against the United States and Beijing's rapprochement with the United States in the 1970s to counteract the Soviet threat China perceived at the time. China's strong desire for sovereignty and independence of action, however, seems to have made Chinese alliances or quasi-alliances short-lived.\nAnother effect of China's historical legacy is its tendency toward isolationism and an ambivalence about opening up to the outside world. In imperial times, China's foreign relations varied from dynasty to dynasty—from cosmopolitan periods like the Tang dynasty (618–907) to isolationist periods such as the Ming dynasty (1368–1644), when few foreigners were allowed in the country. Overall, the sinocentric worldview and China's history of centuries of self-sufficiency favored isolation, which contributed to China's difficulty when confronted by expansionist Western powers in the nineteenth century. The debate over self-reliance and possible corruption by foreign influences or opening up to the outside world in order to modernize more quickly has continued for over a century and is still an issue today.\nNationalism\nThe importance of sovereignty and independence of action in Chinese foreign policy since 1949 has been closely related to Chinese nationalism. Just as Chinese national pride has been a natural outgrowth of China's long and rich historical tradition, the nationalism of Chinese leaders also has derived from the injustices China suffered in more recent history, in particular, China's domination by foreign powers from the nineteenth century until the end of World War II. During this time, which China refers to as \"the century of shame and humiliation\", the formerly powerful imperial government devolved to what China calls \"semicolonial\" status, as it was forced to sign unequal treaties and grant foreigners special privileges of extraterritoriality. Foreign powers divided China into spheres of influence. Most debilitating and humiliating was the foreign military threat that overpowered China, culminating in Japan's invasion and occupation of parts of China in the late 1930s. The bitter recollection of China's suffering at the hands of foreign powers has continued to be a source of Chinese nationalistic sentiment since 1949. The suspicion of foreign powers, opposition to any implication of inferior status, and desire to reassert sovereignty and independence have strongly influenced Chinese foreign policy. Examples of this attitude are Mao Zedong's statement in 1949 that \"the Chinese people have stood up\" and Deng Xiaoping's 1982 pronouncement that \"no foreign country can expect China to be its vassal or expect it to swallow any bitter fruit detrimental to its interests.\"\nA foreign policy goal closely related to nationalism has been the desire to achieve territorial integrity and to restore to Chinese sovereignty areas previously considered a part of China. Although China has not resolved many border disputes with several of its neighbors, including India, the Russia, and Vietnam (including islands in the South China Sea), Beijing has concluded boundary settlements with other nations, including Pakistan, Burma, Nepal, Afghanistan, North Korea, and Mongolia. Negotiations on border issues, held intermittently with Russia since 1949 and with India since the early 1980s, continue to be held. The difficulty of resolving these issues seem to reflect their relation to sensitive questions of national pride both in China and in neighboring countries and sometimes to questions of China's perceived national security interests. For example, Qing control over Outer Mongolia (present-day Mongolia) had lapsed long before 1949 and had been supplanted by Soviet influence. Although it was most likely with reluctance and regret, China recognized Mongolia as a separate nation in 1949. By contrast, asserting sovereignty over another outlying area, Xizang (Tibet), was considered such an important strategic goal that military force was used to gain control there in 1950 and to reassert it in 1959.\nTwo other Chinese areas that had been under the control of foreign powers were Hong Kong and Macau. According to Chinese statements, these \"problems left over from history\" were the result of imperialist aggression and the incompetence of Chinese rulers. Macau, the first European enclave on the Chinese coast, was occupied by Portugal in 1557 and ceded to Portugal under an 1887 treaty. Britain gained control of Hong Kong island and adjacent territory through three treaties with China in the nineteenth century. In the mid-1980s China concluded formal arrangements with Britain and Portugal for the return of these areas to Chinese sovereignty in 1997 (Hong Kong) and 1999 (Macau). Both agreements were made under a policy of \"one country, two systems\", giving the areas a high degree of autonomy as \"special administrative regions\" of China. From the perspective of Chinese nationalism, negotiating the return of both Hong Kong and Macau to Chinese sovereignty before the end of the twentieth century was undoubtedly one of the major foreign policy accomplishments of Chinese leaders in the late twentieth century.\nThe most crucial of the issues of national unification, however, remain unresolved: the issue of Taiwan. Chiang Kai-shek and his forces fled to Taiwan after the founding of the People's Republic of China in 1949. The government they established there, the \"Republic of China\", continued to claim authority as the government of the Chinese nation almost four decades after the founding of the People's Republic. Although China's goal of unifying Taiwan with the mainland remained unchanged, the previous, more militant Chinese policy of \"liberating Taiwan\" was replaced in the 1980s by the concept of unification under the \"one country, two systems\" policy. The agreements on Hong Kong and Macau were considered by many observers as possible precedents for unifying Taiwan with the mainland. Because of the legacy of mistrust between the leaders of the two sides and other complex factors, however, this difficult and longstanding problem does not appear close to resolution today.\nInfluence of ideology\nAn important influence on Chinese foreign policy that had especially affected China's interpretations of world events has been ideology, both Marxist-Leninist and Maoist. The ideological components of China's foreign policy, whose influence varied over time, had included a belief that conflict and struggle were inevitable; a focus on opposing imperialism; the determination to advance communism throughout the world, especially through the Chinese model; and the Maoist concept of responding with flexibility while adhering to fundamental principles.\nOne of the most basic aspects of China's ideological worldview had been the assumption that conflict, though not necessarily military conflict, was omnipresent in the world. According to Marxist-Leninist analysis, all historical development was the result of a process of struggle, between classes within a nation, between nations themselves, or between broader forces such as socialism and imperialism. A basic tenet of Chinese leaders held that the international situation is best understood in terms of the \"principal contradictions\" of the time. Once these contradictions were understood, they could be exploited in order to, as Mao said, \"win over the many, oppose the few, and crush our enemies one by one.\" China amplified the Leninist policy of uniting with some forces in order to oppose others more effectively in a united front. Chinese leaders urged the formation of various united fronts as they had perceived the contradictions in the world to change over time.\nPerhaps because of the belief in struggle as necessary for progress, for most of its history after 1949 China considered world war inevitable. This changed in the 1980s, when Chinese leaders began to say that the forces for peace in the world had become greater than the forces for war. One reason for growing world stability was seen in \"multipolarization\", that is, the growth of additional forces, such as the Third World and Europe, to counterbalance the tension between the United States and the Soviet Union. China's description of world events as a struggle between opposing forces, however, had remained unchanged until the early 1990s.\nOpposition to imperialism—domination by foreign powers—is another major ideological component of Chinese foreign policy. The Leninist emphasis on the struggle against imperialism made sense to Chinese leaders, whose nationalism had evolved in part in reaction to China's exploitation by foreign powers during the nineteenth century. Although opposition to imperialism and hegemony has remained a constant, the specific target of the opposition has changed since 1949. In somewhat oversimplified terms, China focused on opposing United States imperialism in the 1950s; on opposing collusion between United States imperialism and Soviet revisionism in the 1960s; on combating Soviet social-imperialism or hegemony in the 1970s; and on opposing hegemony by either superpower in the 1980s.\nThe extent of China's determination to advance communism throughout the world had been another component of its foreign policy that has fluctuated since 1949. In the early 1950s and during the 1960s, Chinese leaders called for worldwide armed struggle against colonialism and \"reactionary\" governments. China supplied revolutionary groups with rhetorical and, in some cases, material support. Central to support for leftist movements was the idea that they should take China as a model in their struggle for national liberation. Chinese leaders expressed the belief that China's experience was directly applicable to the circumstances in many other countries, but they also stressed the importance of each country's suiting its revolution to its own conditions—creating ambiguity about China's position on \"exporting\" revolution. For most of the time since 1949, China's dedication to encouraging revolution abroad has appeared to receive a lower priority than other foreign policy goals.\nMilitancy and support for worldwide revolution peaked during the Cultural Revolution, when China's outlook on liberation struggles seemed to take its cue from Lin Biao's famous 1965 essay \"Long Live the Victory of People's War!\" This essay predicted that the underdeveloped countries of the world would surround and overpower the industrial nations and create a new communist world order. As a result of alleged Chinese involvement in subversive activities in Indonesia and several African countries in the late 1960s, those nations broke off diplomatic relations with Beijing.\nBy the 1980s China had lessened or discontinued its support for revolutionary and liberation movements around the world, prominent exceptions being the Palestine Liberation Organization and resistance fighters in Cambodia and Afghanistan. Despite its shift toward cultivating state-to-state relations with established governments, many other countries had continued to be suspicious of China's intentions. Especially in Asia, where Beijing previously supported many local communist parties, China's image as a radical power intent on fomenting world revolution continued to affect the conduct of its foreign relations into the late 1980s.\nOne of the major characteristics of Chinese foreign policy since 1949 has been its claim of consistently adhering to principles while particular interpretations and policies have changed dramatically. A statement by Mao Zedong seems to summarize this apparent contradiction: \"We should be firm in principle; we should also have all flexibility permissible and necessary for carrying out our principles.\" Although claiming that, on the whole, China has never deviated from such underlying principles as independence and safeguarding peace, Chinese leaders have made major shifts in foreign policy based on their pragmatic assessment of goals and the international situation. Aiding this interpretation of the primacy of principles in Chinese foreign policy has been the emphasis on long-term goals. According to Chinese leaders, China has pursued a long-term strategy is \"definitely not swayed by expediency or anybody's instigation or provocation.\" In keeping with the view of Chinese foreign policy as constant and unvarying, Chinese pronouncements often describe their policy with words such as \"always\" and \"never.\"\nAn example of how certain principles have provided a framework of continuity for Chinese foreign policy since 1949 has been found in the Five Principles of Peaceful Coexistence embodied in an agreement signed by China and India in 1954. The five principles played an important role in the mid-1950s, when China began to cultivate the friendship of newly independent nations of Asia and Africa. By the time of the Cultural Revolution, however, China was involved in acrimonious disputes with many of these same nations, and their relations could have been described as anything but \"peacefully coexistent.\" The Five Principles of Peaceful Coexistence were reemphasized in the 1980s, were considered the basis for relations with all nations regardless of their social systems or ideology, and were made a part of the 1982 party constitution.\nDecision making and implementation\nUnderstanding the intricate workings of a government can be difficult, especially in a country such as China, where information related to leadership and decision making is often kept secret. Although it still was not possible to understand fully the structure of Chinese foreign policy-related governmental and nongovernmental organizations or how they made or implemented decisions, more was known about them by the late 1980s than at any time previously.\nAfter 1949 China's foreign relations became increasingly more complex as China established formal diplomatic relations with more nations (see Dates of establishment of diplomatic relations with the People's Republic of China), joined the United Nations (UN) and other international and regional political and economic organizations, developed ties between the Chinese Communist Party and foreign parties, and expanded trade and other economic relations with the rest of the world. These changes had affected foreign relations in significant ways by the late 1980s. The economic component of China's international relations increased dramatically from the late 1970s to the late 1980s; more ministries and organizations were involved in foreign relations than ever before; and the Chinese foreign policy community was more experienced and better informed about the outside world than it had been previously.\nDespite the growing complexity of Chinese foreign relations, one fundamental aspect of foreign policy that has remained relatively constant since 1949 is that the decision-making power for the most important decisions has been concentrated in the hands of a few key individuals at the top of the leadership hierarchy. In the past, ultimate foreign policy authority rested with such figures as Mao Zedong and Zhou Enlai, while in the 1980s major decisions were understood to have depended on Deng Xiaoping. By the late 1980s, Deng had initiated steps to institutionalize decision making and make it less dependent on personal authority, but this transition has not yet been fully completed.\nIn examining the workings of a nation's foreign policy, at least three dimensions can be discerned: the structure of the organizations involved, the nature of the decision-making process, and the ways in which policy is implemented. These three dimensions are interrelated, and the processes of formulating and carrying out policy have often been more complex than the structure of organizations would indicate.\nGovernment and party organizations\nBy the late 1980s, more organizations were involved in China's foreign relations than at any time previously. High-level party and government organizations such as the Central Committee, Political Bureau, party Secretariat, party and state Central Military Commissions, National People's Congress, and State Council and such leaders as the premier, president, and Party general secretary all were involved in foreign relations to varying degrees by virtue of their concern with major policy issues, both foreign and domestic. The party Secretariat and the State Council together carried the major responsibility for foreign policy decisions.\nBy the 1980s, as China's contacts with the outside world grew, party and government leaders at all levels increasingly were involved in foreign affairs. The president of the People's Republic fulfilled a ceremonial role as head of state and also was responsible for officially ratifying or abrogating treaties and agreements with foreign nations. In addition to meeting with foreign visitors, Chinese leaders, including the president, the premier, and officials at lower levels, traveled abroad regularly.\nIn the late 1980s, the Political Bureau which is headed by the General Secretary, previously thought of as the major decision-making body, was no longer the primary party organization involved in foreign policy decision making. Instead, the State Council referred major decisions to the Secretariat for resolution and the Political Bureau for ratification. Under the party Secretariat, the International Liaison Department had primary responsibility for relations between the Chinese Communist Party and a growing number of foreign political parties. Other party organizations whose work was related to foreign relations were the United Front Work Department, responsible for relations with overseas Chinese, the Propaganda Department, and the Foreign Affairs Small Group.\nOf the Chinese government institutions, the highest organ of state power, the National People's Congress, appeared to have only limited influence on foreign policy. In the 1980s the National People's Congress was becoming more active on the international scene by increasing its contacts with counterpart organizations in foreign countries. Through its Standing Committee and its Foreign Affairs Committee, the National People's Congress had a voice in foreign relations matters and occasionally prepared reports on foreign policy-related issues for other party and government bodies.\nAs the primary governmental organization under the National People's Congress, the State Council had a major role in foreign policy, particularly with regard to decisions on routine or specific matters, as opposed to greater questions of policy that might require party involvement. As in the past, the Ministry of Foreign Affairs was the most important institution involved in conducting day-to-day foreign relations, but by the 1980s many other ministries and organizations under the State Council had functions related to foreign affairs as well. These included the Ministry of Foreign Economic Relations and Trade, Ministry of Finance, Ministry of National Defense, Bank of China, People's Bank of China, and China Council for the Promotion of International Trade. In addition, over half of the ministries, overseeing such disparate areas as aeronautics, forestry, and public health, had a bureau or department concerned explicitly with foreign affairs. These offices presumably handled contacts between the ministry and its foreign counterparts.\nMinistry of Foreign Affairs\nSince 1949 the Ministry of Foreign Affairs has been one of China's most important ministries. Each area of foreign relations, divided either geographically or functionally, is overseen by a vice minister or assistant minister. For example, one vice minister's area of specialty was the Soviet Union and Eastern Europe, while another was responsible for the Americas and Australia. At the next level, the Ministry of Foreign Affairs was divided into departments, some geographical and some functional in responsibility. The regionally oriented departments included those concerned with Africa, the Americas and Oceania, Asia, the Middle East, the Soviet Union and Eastern Europe, Western Europe, Taiwan and Hong Kong and Macau. The functional departments were responsible for administration, officials, consular affairs, finance, information, international laws and treaties, international organizations and affairs, personnel, protocol, training and education, and translation. Below the department level were divisions, such as the United States Affairs Division under the Department of American and Oceanian Affairs.\nA recurring problem for the foreign ministry and the diplomatic corps had been a shortage of qualified personnel. In the first years after the founding of the People's Republic, there were few prospective diplomats with international experience. Premier Zhou Enlai relied on a group of young people who had served under him in various negotiations to form the core of the newly established foreign ministry, and Zhou himself held the foreign ministry portfolio until 1958. In the second half of the 1960s, China's developing foreign affairs sector suffered a major setback during the Cultural Revolution, when higher education was disrupted, foreign-trained scholars and diplomats were attacked, all but one Chinese ambassador (to Egypt) were recalled to Beijing, and the Ministry of Foreign Affairs itself practically ceased functioning.\nSince the early 1970s, the foreign affairs establishment has been rebuilt, and by the late 1980s, foreign affairs personnel were recruited from such specialized training programs as the ministry's Foreign Affairs College, College of International Relations, Beijing Foreign Languages Institute, and international studies departments at major universities. Foreign language study still was considered an important requirement, but it was increasingly supplemented by substantive training in foreign relations. Foreign affairs personnel benefited from expanded opportunities for education, travel, and exchange of information with the rest of the world. In addition, specialists from other ministries served in China's many embassies and consulates; for example, the Ministry of National Defense provided military attachés, the Ministry of Foreign Economic Relations and Trade provided commercial officers, and the Ministry of Culture and the State Education Commission provided personnel in charge of cultural affairs.\nMinistry of Foreign Economic Relations and Trade\nSince the late 1970s, economic and financial issues have become an increasingly important part of China's foreign relations. In order to streamline foreign economic relations, the Ministry of Foreign Economic Relations and Trade was established in 1982 through the merger of two commissions and two ministries. By the late 1980s, this ministry was the second most prominent ministry involved in the routine conduct of foreign relations. The ministry had an extremely broad mandate that included foreign trade, foreign investment, foreign aid, and international economic cooperation. Through regular meetings with the Ministry of Foreign Affairs, the Ministry of Foreign Economic Relations and Trade participated in efforts to coordinate China's foreign economic policy with other aspects of its foreign policy. It was unclear how thoroughly this was accomplished.\nMinistry of National Defense\nIn any nation, the interrelation of the political and military aspects of strategy and national security necessitates some degree of military involvement in foreign policy. The military's views on defense capability, deterrence, and perceptions of threat are essential components of a country's global strategy. As of the late 1980s, however, little information was available on foreign policy coordination between the military and foreign policy establishments. The most important military organizations with links to the foreign policy community were the Ministry of National Defense and the party and state Central Military Commissions. The Ministry of National Defense provides military attachés for Chinese embassies, and, as of 1987, its Foreign Affairs Bureau dealt with foreign attaches and military visitors. Working-level coordination with the Ministry of Foreign Affairs was maintained when, for example, high-level military leaders traveled abroad. In addition, the Ministry of National Defense's strategic research arm, the Beijing Institute for International Strategic Studies, carried out research on military and security issues with foreign policy implications.\nIn the late 1980s, the most important link between the military and foreign policy establishments appeared to be at the highest level, particularly through the party and state Central Military Commissions and through Deng Xiaoping, who was concurrently chairman of both commissions. The views of the commissions' members on major foreign policy issues were almost certainly considered in informal discussions or in meetings of other high-level organizations they also belonged to, such as the Political Bureau, the Secretariat, or the State Council. It was significant, though, that compared with earlier periods fewer military leaders served on China's top policy-making bodies since the 1980s.\n\"People-to-People\" diplomacy\nSince 1949 a significant forum for Chinese foreign relations has been cultural or \"people-to-people\" diplomacy. The relative isolation of the People's Republic during its first two decades increased the importance of cultural exchanges and informal ties with people of other countries through mass organizations and friendship societies. In some cases, activities at this level have signaled important diplomatic breakthroughs, as was the case with the American-Chinese ping-pong exchange in 1971. In addition to educational and cultural institutions, many other organizations, including the media, women's and youth organizations, and academic and professional societies, have been involved in foreign relations. Two institutes responsible for this aspect of Chinese diplomacy were associated with the Ministry of Foreign Affairs and staffed largely by former diplomats: the Chinese People's Association for Friendship with Foreign Countries and the Chinese People's Institute of Foreign Affairs.\nThe decision-making process\nThe most crucial foreign policy decisions in the mid-1980s were made by the highest-level leadership, with Deng Xiaoping as the final arbiter. A shift was underway, however, to strengthen the principles of collective and institutional decision making and, at the same time, to reduce party involvement in favor of increased state responsibility. In line with this trend, the State Council made foreign policy decisions regarding routine matters and referred only major decisions either to the party Secretariat or to informal deliberations involving Deng Xiaoping for resolution. When called upon to make decisions, the Secretariat relied largely on the advice of the State Council and members of China's foreign affairs community. The importance of the Political Bureau appeared to have lessened. Although individual members of the Political Bureau exerted influence on the shaping of foreign policy, the Political Bureau's role as an institution seemed to have become one of ratifying decisions, rather than formulating them. The division between party and government functions in foreign affairs as of the mid-1980s could therefore be summarized as party supremacy in overall policy making and supervision, with the government's State Council and ministries under it responsible for the daily conduct of foreign relations.\nThese high-level decision-making bodies comprised the apex of an elaborate network of party and government organizations and research institutes concerned with foreign policy. To support the formulation and implementation of policy, especially in a bureaucracy as complex and hierarchical as China's, there existed a network of small advisory and coordination groups. These groups functioned to channel research, provide expert advice, and act as a liaison between organizations. Perhaps the most important of these groups was the party Secretariat's Foreign Affairs Small Group. This group comprised key party and government officials, including the general secretary, the premier, state councillors, the ministers of foreign affairs and foreign economic relations and trade, and various foreign affairs specialists, depending on the agenda of the meeting. The group possibly met weekly, or as required by circumstances. Liaison and advisory functions were provided by other groups, including the State Council's Foreign Affairs Coordination Point, the staff of the premier's and State Council's offices, and bilateral policy groups, such as one composed of ministers and vice ministers of the Ministry of Foreign Affairs and the Ministry of Foreign Economic Relations and Trade, which met at least every few months.\nIn the late 1980s, the decision-making process for foreign policy matters followed a fairly hierarchical pattern. If a particular ministry was unable to make a decision because the purview of other ministries was involved, it would attempt to resolve the issue through informal discussion or through an interagency group. If that was not successful or if higher-level consideration was needed, the problem might be referred to the Foreign Affairs Coordination Point or to select members of the State Council for review. Certain major decisions would then be discussed by the Foreign Affairs Small Group before consideration by the party Secretariat itself. If the issue was extremely controversial or important, the final decision would be directed to the highest-level leadership.\nRelations by region and country\nAffected by the confluence of a myriad of factors, including its historical legacy, worldview, nationalism, ideology, the decision-making process in Beijing, and the international situation, China's foreign relations have had a rich and varied development in the years since 1949. Two aspects of Chinese foreign policy that have led to wide fluctuations over time are the degree of militancy or peacefulness Beijing has espoused and its ambivalence in choosing between self-reliance and openness to the outside world. Although dividing something as complex as foreign policy into time periods necessarily obscures certain details, Chinese foreign relations can be examined roughly by decades: the Sino-Soviet alliance of the 1950s, isolationism and radicalism in the 1960s, increased international involvement in the 1970s, and the independent foreign policy since the 1980s. During each of these periods, China's relations with the rest of the world underwent significant changes.\nSino-Soviet relations\nAfter the founding of the People's Republic, the Chinese leadership was concerned above all with ensuring national security, consolidating power, and developing the economy. The foreign opposition eats  policy course China chose in order to translate these goals into reality was to form an international united front with the Soviet Union and other socialist nations against the United States and Japan. Although for a time Chinese leaders may have considered trying to balance Sino-Soviet relations with ties with Washington, by mid-1949 Mao Zedong declared that China had no choice but to \"lean to one side\"—meaning the Soviet side.\nSoon after the establishment of the People's Republic, Mao traveled to Moscow to negotiate the 1950 Sino-Soviet Treaty of Friendship, Alliance, and Mutual Assistance. Under this agreement, China gave the Soviet Union certain rights, such as the continued use of a naval base at Luda, Liaoning Province, in return for military support, weapons, and large amounts of economic and technological assistance, including technical advisers and machinery. China acceded, at least initially, to Soviet leadership of the world communist movement and took the Soviet Union as the model for development. China's participation in the Korean War (1950–53) seemed to strengthen Sino-Soviet relations, especially after the UN-sponsored trade embargo against China. The Sino-Soviet alliance appeared to unite Moscow and Beijing, and China became more closely associated with and dependent on a foreign power than ever before.\nDuring the second half of the 1950s, strains in the Sino-Soviet alliance gradually began to emerge over questions of ideology, security, and economic development. Chinese leaders were disturbed by the Soviet Union's moves under Nikita Khrushchev toward de-Stalinization and peaceful coexistence with the West. Moscow's successful earth satellite launch in 1957 strengthened Mao's belief that the world balance was in the communists' favor—or, in his words, \"the east wind prevails over the west wind\"—leading him to call for a more militant policy toward the noncommunist world in contrast to the more conciliatory policy of the Soviet Union.\nIn addition to ideological disagreements, Beijing was dissatisfied with several aspects of the Sino-Soviet security relationship: the insufficient degree of support Moscow showed for China's recovery of Taiwan, a Soviet proposal in 1958 for a joint naval arrangement that would have put China in a subordinate position, Soviet neutrality during the 1959 tension on the Sino-Indian border, and Soviet reluctance to honor its agreement to provide nuclear weapons technology to China. And, in an attempt to break away from the Soviet model of economic development, China launched the radical policies of the Great Leap Forward (1958–60), leading Moscow to withdraw all Soviet advisers from China in 1960. In retrospect, the major ideological, military, and economic reasons behind the Sino-Soviet split were essentially the same: for the Chinese leadership, the strong desire to achieve self-reliance and independence of action outweighed the benefits Beijing received as Moscow's junior partner.\nDuring the 1960s the Sino-Soviet ideological dispute deepened and spread to include territorial issues, culminating in 1969 in bloody armed clashes on their border. In 1963 the boundary dispute had come into the open when China explicitly raised the issue of territory lost through \"unequal treaties\" with the Russian Empire. After unsuccessful border consultations in 1964, Moscow began the process of a military buildup along the border with China and in Mongolia, which continued into the 1970s.\nThe Sino-Soviet dispute also was intensified by increasing competition between Beijing and Moscow for influence in the Third World and the international communist movement. China accused the Soviet Union of colluding with imperialism, for example by signing the Partial Nuclear Test Ban Treaty with the United States in 1963. Beijing's support for worldwide revolution became increasingly militant, although in most cases it lacked the resources to provide large amounts of economic or military aid. The Chinese Communist Party broke off ties with the Communist Party of the Soviet Union in 1966, and these had not been restored by mid-1987.\nDuring the Cultural Revolution, China's growing radicalism and xenophobia had severe repercussions for Sino-Soviet relations. In 1967 Red Guards besieged the Soviet embassy in Beijing and harassed Soviet diplomats. Beijing viewed the Soviet invasion of Czechoslovakia in 1968 as an ominous development and accused the Soviet Union of \"social imperialism.\" The Sino-Soviet dispute reached its nadir in 1969 when serious armed clashes broke out at Zhenbao Island on the northeast border. Both sides drew back from the brink of war, however, and tension was defused when Zhou Enlai met with Alexei Kosygin, the Soviet premier, later in 1969.\nIn the 1970s Beijing shifted to a more moderate course and began a rapprochement with Washington as a counterweight to the perceived threat from Moscow. Sino-Soviet border talks were held intermittently, and Moscow issued conciliatory messages after Mao's death in 1976, all without substantive progress. Officially, Chinese statements called for a struggle against the hegemony of both superpowers, but especially against the Soviet Union, which Beijing called \"the most dangerous source of war.\" In the late 1970s, the increased Soviet military buildup in East Asia and Soviet treaties with Vietnam and Afghanistan heightened China's awareness of the threat of Soviet encirclement. In 1979 Beijing notified Moscow it would formally abrogate the long-dormant Sino-Soviet Treaty of Friendship, Alliance, and Mutual Assistance but proposed bilateral talks. China suspended the talks after only one round, however, following the Soviet invasion of Afghanistan in 1979.\nIn the 1980s, China's approach toward the Soviet Union shifted once more, albeit gradually, in line with China's adoption of an independent foreign policy and the opening up economic policy. Another factor behind the shift was the perception that, although the Soviet Union still posed the greatest threat to China's security, the threat was long-term rather than immediate. Sino-Soviet consultations on normalizing relations were resumed in 1982 and held twice yearly, despite the fact that the cause of their suspension, the Soviet presence in Afghanistan, remained unchanged. Beijing raised three primary preconditions for the normalization of relations, which it referred to as \"three obstacles\" that Moscow had to remove: the Soviet presence in of Afghanistan, Soviet support for Vietnam's invasion of Cambodia, and the presence of Soviet forces along the Sino-Soviet border and in Mongolia. For the first half of the 1980s, Moscow called these preconditions \"third country issues\" not suitable for bilateral discussion, and neither side reported substantial progress in the talks.\nSoviet leadership changes between 1982 and 1985 provided openings for renewed diplomacy, as high-level Chinese delegations attended the funerals of Soviet leaders Leonid Brezhnev, Yuriy Andropov, and Konstantin Chernenko. During this time, Sino-Soviet relations improved gradually in many areas: trade expanded, economic and technical exchanges were resumed (including the renovation of projects originally built with Soviet assistance in the 1950s), border points were opened, and delegations were exchanged regularly.\nThe Soviet position on Sino-Soviet relations showed greater flexibility in 1986 with General Secretary Mikhail Gorbachev's July speech at Vladivostok. Among Gorbachev's proposals for the Asia-Pacific region were several directed at China, including the announcement of partial troop withdrawals from Afghanistan and Mongolia, the renewal of a concession pertaining to the border dispute, and proposals for agreements on a border railroad, space cooperation, and joint hydropower development. Further, Gorbachev offered to hold discussions with China \"at any time and at any level.\" Although these overtures did not lead to an immediate high-level breakthrough in Sino-Soviet relations, bilateral consultations appeared to gain momentum, and border talks were resumed in 1987.\nEven though Sino-Soviet relations improved remarkably when compare with the two previous decades, China and the Soviet Union would never to resume a formal alliance.\nSino-American relations\nChina's relations with the other superpower, the United States, have like that with the Soviet Union followed an uneven course. Chinese leaders expressed an interest in possible economic assistance from the United States during the 1940s, but by 1950 Sino-American relations could only be described as hostile. During its first two decades the People's Republic considered the United States \"imperialist\" and \"the common enemy of people throughout the world.\"\nThe Korean War was a major factor responsible for setting relations between China and the United States in a state of enmity and mistrust, as it contributed to the United States policy of \"containing\" the Chinese threat through a trade embargo and travel restrictions, as well as through military alliances with other Asian nations. An important side effect of the Korean War was that Washington resumed military aid to Taiwan and throughout the 1950s became increasingly committed to Taiwan's defense, making the possibility of Chinese unification more remote. After the United States-Taiwan Mutual Defense Treaty was signed in 1954, Taiwan became the most contentious issue between the United States and China, and remained so in the late 1980s, despite the abrogation of the treaty and the subsequent normalization of relations between Beijing and Washington in 1979.\nIn 1955 Premier Zhou Enlai made a conciliatory opening toward the United States in which he said the Chinese people did not want war with the American people. His statement led to a series of official ambassadorial-level talks in Geneva and Warsaw that continued fairly regularly for the next decade and a half. Although the talks failed to resolve fundamental conflicts between the two countries, they served as an important line of communication.\nSino-American relations remained at a stalemate during most of the 1960s. Political considerations in both countries made a shift toward closer relations difficult, especially as the United States became increasingly involved in the war in Vietnam, in which Washington and Beijing supported opposite sides. China's isolationist posture and militancy during the Cultural Revolution precluded effective diplomacy, and Sino-American relations reached a low point with seemingly little hope of improvement.\nSeveral events in the late 1960s and early 1970s, however, led Beijing and Washington to reexamine their basic policies toward each other. After the Soviet Union's invasion of Czechoslovakia in 1968 and the Sino-Soviet border clashes in 1969, China saw its major threat as clearly coming from the Soviet Union rather than the United States and sought a closer relationship with Washington as a counterweight to Moscow. When President Richard M. Nixon assumed office in 1969, he explored rapprochement with China as part of his doctrine of reduced United States military involvement in Asia. Moves in this direction resulted in an American ping-pong team's trip to China and Henry A. Kissinger's secret visit, both in 1971, followed by Nixon's dramatic trip to China in 1972. The Shanghai Communique, a milestone document describing the new state of relations between the two countries, and signed by Nixon and Zhou Enlai, included a certain degree of ambiguity that allowed China and the United States to set aside differences, especially on the Taiwan issue, and begin the process of normalizing relations.\nAfter the signing of the Shanghai Communique, however, movement toward United States-China normalization during the 1970s saw only limited progress. The United States and China set up liaison offices in each other's capitals in 1973, and bilateral trade grew unevenly throughout the decade. \"People's diplomacy\" played an important role, as most exchanges of delegations were sponsored by friendship associations. Chinese statements continued to express the view that both superpowers were theoretically adversaries of China, but they usually singled out the Soviet Union as the more \"dangerous\" of the two.\nIn the second half of the 1970s, China perceived an increasing Soviet threat and called more explicitly for an international united front against Soviet hegemony. In addition, rather than strictly adhering to the principle of self-reliance, China adopted an economic and technological modernization program that greatly increased commercial links with foreign countries. These trends toward strategic and economic cooperation with the West gave momentum to Sino-United States normalization, which had been at an impasse for most of the decade. Ties between China and the United States began to strengthen in 1978, culminating in the December announcement that diplomatic relations would be established as of January 1, 1979. In establishing relations, Washington reaffirmed its agreement that the People's Republic was the sole legal government of China and that Taiwan was an inalienable part of China. Deng Xiaoping's visit to the United States the following month was symbolic of the optimism felt in Beijing and Washington concerning their strategic alignment and their burgeoning commercial, technical, and cultural relations.\nIn the 1980s United States-China relations went through several twists and turns. By late 1981 China appeared to pull back somewhat from the United States as it asserted its independent foreign policy. Beijing began to express increasing impatience with the lack of resolution on the Taiwan issue. One of the main issues of contention was the Taiwan Relations Act, passed by the United States Congress in 1979, which provided for continuing unofficial relations between Washington and Taipei. In late 1981 China began to make serious demands that the United States set a firm timetable for terminating American arms sales to Taiwan, even threatening to retaliate with the possible downgrading of diplomatic relations. In early 1982 Washington announced it would not sell Taiwan more advanced aircraft than it had already provided, and in August, after several months of intense negotiations, China and the United States concluded a joint communique that afforded at least a partial resolution of the problem. Washington pledged to increase neither the quality nor the quantity of arms supplied to Taiwan, while Beijing affirmed that peaceful unification was China's fundamental policy. Although the communique forestalled further deterioration in relations, Beijing and Washington differed in their interpretations of it. The Taiwan issue continued to be a \"dark cloud\" (to use the Chinese phrase) affecting United States-China relations to varying degrees into the late 1980s.\nIn addition to the question of Taiwan, other aspects of United States-China relations created controversy at times during the 1980s: Sino-American trade relations, the limits of American technology transfer to China, the nature and extent of United States-China security relations, and occasional friction caused by defections or lawsuits. Difficulties over trade relations have included Chinese displeasure with United States efforts to limit imports such as textiles and a degree of disappointment and frustration within the American business community over the difficulties of doing business in China. The issue of technology transfer came to the fore several times during the 1980s, most often with Chinese complaints about the level of technology allowed or the slow rate of transfer. China's dissatisfaction appeared to be somewhat abated by the United States 1983 decision to place China in the \"friendly, nonaligned\" category for technology transfer and the conclusion of a bilateral nuclear energy cooperation agreement in 1985.\nDetermining the nature and limits of security relations between China and the United States had been a central aspect of their relations in the 1980s. After a period of discord during the first years of the decade, Beijing and Washington renewed their interest in security-related ties, including military visits, discussions of international issues such as arms control, and limited arms and weapons technology sales.\nBeginning in 1983, Chinese and United States defense ministers and other high-level military delegations exchanged visits, and in 1986 United States Navy ships made their first Chinese port call since 1949. The United States approved certain items, such as aviation electronics, for sale to China, restricting transfers to items that would contribute only to China's defensive capability. As of the late 1980s, it appeared that American assistance in modernizing China's arms would also be limited by China's financial constraints and the underlying principle of self-reliance.\nDespite the issues that have divided them, relations between the United States and China continued to develop during the 1980s through a complex network of trade ties, technology-transfer arrangements, cultural exchanges, educational exchanges (including thousands of Chinese students studying in the United States), military links, joint commissions and other meetings, and exchanges of high-level leaders. By the second half of the 1980s, China had become the sixteenth largest trading partner of the United States, and the United States was China's third largest; in addition, over 140 American firms had invested in China. High-level exchanges, such as Premier Zhao Ziyang's visit to the United States and President Ronald Reagan's trip to China, both in 1984, and President Li Xiannian's 1985 tour of the United States demonstrated the importance both sides accorded their relations.\nRelations with the developing world\nThe Bandung Conference in 1955, at which Zhou led the Chinese delegation, was an important milestone for China's foreign relations. China developed its foreign relations with many newly independent and soon-to-be independent countries. China termed this cooperative approach the \"Bandung Line.\" This was the beginning of China's official discourse of South-South cooperation. China's Five Principles of Peaceful Coexistence were incorporated into the Ten Principles of Bandung.\nIn 1974, China announced its Theory of the Three Worlds at the United Nations.\nAlthough committed to good relations with the nations of the Middle East, Africa, and Latin America, in the twenty-first century China finds perhaps the greatest value in these areas as markets and sources of raw materials. The years of solidarity with revolutionary movements in these regions have long been replaced by efforts to cultivate normal diplomatic and economic relations.\nRelations with the developed world\nSince 1949 China's overriding concerns have been security and economic development. In working toward both of these goals, China has focused on its relations with the superpowers. Because most of the developed world, with the exception of Japan, was relatively distant from China and was aligned formally or informally with either the Soviet Union or the United States, China's relations with the developed world often have been subordinate to its relations with the superpowers. In the 1950s China considered most West European countries \"lackeys\" of United States imperialism, while it sided with Eastern Europe and the Soviet Union. As China's relations with the superpowers have changed, so have its ties with other developed nations. An example of this is that more than a dozen developed countries, including the Germany, Spain, Japan, Australia, and New Zealand, all established diplomatic relations with China after the Sino-American rapprochement in the early 1970s.\nThe developed nations have been important to China for several reasons: as sources of diplomatic recognition, as alternative sources of trade and technology to reduce reliance on one or the other superpower, and as part of China's security calculations. In the 1980s China stressed the role of developed nations in ensuring peace in an increasingly multipolar world. Australia and Canada were important trading partners for China, but Beijing's most important relations with the developed world were with Japan and Europe.\nJapan\nJapan has been by far the most important to China of the developed nations. Among the reasons for this are geographical proximity and historical and cultural ties, China's perception of Japan as a possible resurgent threat, Japan's close relations with the United States since the end of World War II, and Japan's role as the second-ranked industrialized power in the world. Japan's invasion and occupation of parts of China in the 1930s was a major component of the devastation China underwent during the \"century of shame and humiliation.\" After 1949 Chinese relations with Japan changed several times, from hostility and an absence of contact to cordiality and extremely close cooperation in many fields. One recurring Chinese concern in Sino-Japanese relations has been the potential remilitarization of Japan.\nAt the time of the founding of the People's Republic, Japan was defeated and Japanese military power dismantled, but China continued to view Japan as a potential threat because of the United States presence there. The Sino-Soviet Treaty of Friendship, Alliance, and Mutual Assistance included the provision that each side would protect the other from an attack by \"Japan or any state allied with it\", and China undoubtedly viewed with alarm Japan's role as the principal United States base during the Korean War. At the same time, however, China in the 1950s began a policy of attempting to influence Japan through trade, \"people's diplomacy\", contacts with Japanese opposition political parties, and through applying pressure on Tokyo to sever ties with Taipei. Relations deteriorated in the late 1950s when Chinese pressure tactics escalated. After the Sino-Soviet break, economic necessity caused China to reconsider and revitalize trade ties with Japan.\nSino-Japanese ties declined again during the Cultural Revolution, and the decline was further exacerbated by Japan's growing strength and independence from the United States in the late 1960s. China was especially concerned that Japan might remilitarize to compensate for the reduced United States military presence in Asia brought about under President Nixon. After the beginning of Sino-American rapprochement in 1971, however, China's policy toward Japan immediately became more flexible. By 1972 Japan and China had established diplomatic relations and agreed to conclude a separate peace treaty. The negotiations for the peace treaty were protracted and, by the time it was concluded in 1978, China's preoccupation with the Soviet threat led to the inclusion of an \"anti-hegemony\" statement. In fewer than three decades, China had signed an explicitly anti-Japanese treaty with the Soviet Union and a treaty having an anti-Soviet component with Japan.\nFrom the 1970s into the 1980s, economic relations were the centerpiece of relations between China and Japan. Japan has been China's top trading partner since the 1960s. Despite concern in the late 1980s over a trade imbalance, the volume of Sino-Japanese trade showed no sign of declining. Relations suffered a setback in 1979 and 1980, when China canceled or modified overly ambitious plans made in the late 1970s to import large quantities of Japanese technology, the best-known example involving the Baoshan iron and steel complex in Shanghai. Lower expectations on both sides seemed to have created a more realistic economic and technological partnership by the late 1980s.\nChinese relations with Japan during the 1980s were generally close and cordial. Tension erupted periodically, however, over trade and technology issues, Chinese concern over potential Japanese military resurgence, and controversy regarding Japan's relations with Taiwan, especially Beijing's concern that Tokyo was pursuing a \"two Chinas\" policy. China joined other Asian nations in criticizing Japanese history textbooks that deemphasized past Japanese aggression, claiming that the distortion was evidence of the rise of militarism in Japan. By the late 1980s, despite occasional outbreaks of tension, the two governments held regular consultations, high-level leaders frequently exchanged visits, Chinese and Japanese military leaders had begun contacts, and many Chinese and Japanese students and tourists traveled back and forth.\nEurope\nAlthough it had been the European powers that precipitated the opening of China to the West in the nineteenth century, by 1949 the European presence was limited to Hong Kong and Macau. Europe exerted a strong intellectual influence on modern Chinese leaders (Marxism and Leninism of course originated in Europe), and some leaders, including Zhou Enlai and Deng Xiaoping, studied in Europe early in their careers. Nevertheless, China's geographic distance from Europe, its preoccupation with the superpowers, and the division of Europe after World War II meant that China's relations with European nations usually were subordinate to its relations with the Soviet Union and the United States.\nEast European nations were the first countries to establish diplomatic relations with China in 1949, following the Soviet Union's lead. In the early 1950s, through the Sino-Soviet alliance, China became an observer in the Council for Mutual Economic Assistance (Comecon), and Chinese relations with Eastern Europe included trade and receipt of limited amounts of economic and technical aid. The Sino-Soviet dispute was manifested in China's relations with certain East European countries, especially China's support for Albania's break with the Soviet Union in the late 1950s. After the Sino-Soviet split in the 1960s, the only East European nations maintaining significant ties with China until the late 1970s were Albania, Romania, and Yugoslavia. By the late 1980s, however, as Beijing's relations with Moscow improved and relations with governments and parties on the basis of \"mutual respect and peaceful coexistence\" were renewed, China's ties with the other nations of Eastern Europe also had improved noticeably, to include communist party ties.\nChina's ties with Western Europe were minimal for the first two decades of the People's Republic. Several West European nations, mostly in Scandinavia, established diplomatic relations with China in the early 1950s, and Britain and the Netherlands established ties with China at the chargé d'affaires level in 1954. In the late 1950s, Britain became the first Western nation to relax the trade embargo against China imposed during the Korean War. The establishment of diplomatic relations between China and France in 1964 also provided an opening for trade and other limited Chinese contacts with Western Europe until the 1970s.\nChina's relations with Western Europe grew rapidly in the 1970s, as more nations recognized China and diplomatic relations were established with the European Economic Community in 1975. In the second half of the 1970s, China's emphasis on an international united front against Soviet hegemony led to increased Chinese support for West European unity and for the role of the North Atlantic Treaty Organization. Ties with Western Europe also were featured prominently in Beijing's independent foreign policy of the 1980s. Furthermore, China's opening up to foreign trade, investment, and technology beginning in the late 1970s greatly improved Sino-European ties. One of the few major problems in China's relations with Western Europe in the post-Mao era was the downgrading of diplomatic ties with the Netherlands from 1981 to 1984 over the latter's sale of submarines to Taiwan.\nRole in international organizations\nParticipation in international organizations is perceived as an important measure of a nation's prestige as well as a forum through which a nation can influence others and gain access to aid programs and sources of technology and information. The People's Republic was precluded from participating actively in most mainstream international organizations for the first two decades of its existence because of its subordinate position in the Sino-Soviet alliance in the 1950s and the opposition of the United States after China's involvement in the Korean War. China repeatedly failed to gain admission to the UN. In 1971 Beijing finally gained China's seat when relations with the United States changed for the better. Taipei's representatives were expelled from the UN and replaced by Beijing's.\nAfter becoming a member of the UN, China also joined most UN-affiliated agencies, including, by the 1980s, the World Bank and the International Monetary Fund. China's willingness, under the policy of opening up to the outside world beginning in the late 1970s, to receive economic and technical assistance from such agencies as the UN Development Programme was a significant departure from its previous stress on self-reliance. In 1986 China renewed its application to regain its seat as one of the founding members of the General Agreement on Tariffs and Trade.\nBy the late 1980s, China had become a member of several hundred international and regional organizations, both those of major significance to world affairs, including the International Atomic Energy Agency, the World Intellectual Property Organization, and the International Olympic Committee, and associations or societies focused on such narrow subjects as acrobatics or the study of seaweed. Besides providing China a forum from which to express its views on various issues, membership in the 1970s and 1980s in increasing numbers of international groups gave Chinese foreign affairs personnel wider knowledge and valuable international experience.\nIt is notable that by the late 1980s Beijing had not sought formal membership in several important international organizations representative of Third World interests: the Group of 77, the Non-Aligned Movement, and the Organization of Petroleum Exporting Countries. Despite the emphasis China placed on Third World relations, China's independent foreign policy and special position as a somewhat atypical Third World nation made it seem unlikely in the late 1980s that China would seek more than observer status in these groups.\nBy the second half of the 1980s, China's participation in international organizations reflected the two primary goals of its independent foreign policy: furthering domestic economic development through cooperation with the outside world and promoting peace and stability by cultivating ties with other nations on an equal basis. As expressed by Chinese premier Zhao Ziyang in a 1986 report to the National People's Congress, \"China is a developing socialist country with a population of over 1 billion. We are well aware of our obligations and responsibilities in the world. We will therefore continue to work hard on both fronts, domestic and international, to push forward the socialist modernization of our country and to make greater contributions to world peace and human progress.\"\nSee also\nReferences\n[http://lcweb2.loc.gov/frd/cs/cntoc.html]\nExternal links\n*[http://www.fmprc.gov.cn/eng/default.htm The Ministry of Foreign Affairs for the People's Republic of China] - Official website\n*[http://www.marxists.de/china/harris/15-forpol.htm Nigel Harris, The Mandate of Heaven, ch. 15]"
    }
  ]
}