{
  "content": [
    {
      "type": "text",
      "text": "# Historical thinking\n\nHistorical thinking is a set of critical literacy skills for evaluating and analyzing primary source documents to construct a meaningful account of the past. Sometimes called historical reasoning skills, historical thinking skills are frequently described in contrast to historical content knowledge such as names, dates, and places. This dichotomous presentation is often misinterpreted as a claim for the superiority of one form of knowing over the other. The distinction is generally made to underscore the importance of developing thinking skills that can be applied when individuals encounter any historical content. History educators have varying perspectives about the extent they should emphasize facts about the past, moral lessons, connections to current events, or historical thinking skills and different belief about what historical thinking involves.\nU.S. Academic Standards and Disciplinary Frameworks\nIn the United States, the National Center for History in the Schools at the University of California, Los Angeles has developed history standards that include benchmarks for both content in U.S. and world history and historical thinking skills in Kindergarten thru grade 4 and grades 5-12. In both of these age ranges, the Center defines historical thinking in five parts:\n# Chronological Thinking\n# Historical Comprehension\n# Historical Analysis and Interpretation\n# Historical Research Capabilities\n# Historical Issues-Analysis and Decision-Making\nAs part of the national assessment effort called “The Nation’s Report Card, ” the United States Department of Education also developed benchmarks for student achievement in U.S. history. Their rubric divides history learning into three basic dimensions: major historical themes, chronological periods, and ways of knowing and thinking about history. The third dimension is further divided into two parts: historical knowledge and perspective, and historical analysis and interpretation.\nHistory Textbooks\nHistory textbooks draw much attention from history educators and educational researchers. The use of textbooks is nearly universal in history, government, and other social studies courses at the primary, and secondary levels in the U.S.; however, the role of textbooks in these courses remains controversial. Arguments against reliance on textbooks have ranged from ideological to pragmatic. While textbooks are often presented as the objective truth, they include constructed versions of a selected period in the past.\nThe construction and adoption of textbooks can be political, with groups fighting over the version of history they think should be presented to schoolchildren. For example, Texas history textbooks did not include slavery as a central cause of the Civil War until 2018, even though slavery has long been understood to be a core issue causing the Civil War.\nHistorical thinking has been suggested as a way to avoid presenting only one narrative as the truth. In response to the controversy over Texas textbooks, University of Northern Colorado History Department Chair, Fritz Fischer said that \"many of these problems could be solved if the school board prioritized making primary documents available to students, rather than deciding on which version of events ought to be taught.\"\nStill, other critics believe that using textbooks undermines the process of learning history by sacrificing thinking skills for content—that textbooks allow teachers to cover vast amounts of names, dates, and places while encouraging students simply to memorize instead of question or analyze historical events. For example, Sam Wineburg argues, \"Traditional history instruction constitutes a form of information, not a form of knowledge. Students might master an agreed-upon narrative, but they lacked any way of evaluating it, of deciding whether it or any other narrative, was compelling or true” (41).\nDespite their drawbacks, most textbook critics concede that textbooks are necessary tools in history education. Proponents of textbook-based curricula point out that history teachers require resources to support the broad scope of topics covered in the typical history classroom. Well-designed textbooks can provide a foundation on which enterprising educators can build other classroom activities that develop historical thinking.\nTeaching Models\nModels for historical thinking have been developed to better prepare educators in facilitating historical thinking literacies in students.\nBenchmarks for Historical Thinking\nPeter Seixas, a professor at the University of British Columbia and creator of The Historical Thinking Project, outlines six distinct but closely interrelated historical thinking concepts that constitute historical thinking literacy in students. The concepts focus on developing the skills necessary for students to create an account of the past using primary source documents and narratives, or what Seixas terms \"traces\" and \"accounts.\" Although these benchmarks provide a model to develop historical literacies, Seixas states that these concepts can only can be applied with substantial learning about the past\n* Establishing Historical Significance is the ability to identify which events, issues, and trends are historically significant and how they connect to one another. Historical significance varies over time and between groups thus the criteria for determining what to study varies (e.g. Canadians will study Canadian history due to national connections).\n* Using Primary Sources as Evidence involves locating, choosing, understanding, and providing context for the past using primary sources of evidence. When teaching with primary sources, it is important to understand the differences between First, Second, and Third order sources, which are ordered by the originality of material and their proximity to the source of origin. First Order Sources or primary sources are contemporaneous records of events as they were first described or as they happened, without interpretive commentary (e.g., reports, speeches, letters). Meanwhile, second order or secondary sources are those that corroborate, restate, explain, or interpret first order documents (e.g., commentaries, reviews, analyses). Finally third order or tertiary sources list or catalog other sources (e.g., encyclopedias). While second and third order sources are read for information, first order sources require students to draw inferences and make comparisons about the purposes, values, and world views of the authors to construct a narrative argument about history or assess what questions cannot be answered.\n* Identifying Continuity is the ability to understand how issues change or stay the same over time and identify the change as progress or decline. Placing historical events in chronological order is a way of identifying continuity and the ability to group events into identifiable periods helps to better understand their interconnection.\n* Analyze Case and Consequences requires students to recognize how humans can cause change that impacts present day social, political and natural (e.g., geographic) issues. Seixas and Peck note that this benchmark requires understanding causes and/or circumstances, that include \"...long-term ideologies, institutions, and conditions, and short-term motivations, actions and events\" that lead to particular consequences in history and affect the present.\n* Taking a Historical Perspective is understanding different social, cultural, intellectual, and emotional perspectives that formed the experiences and actions of people from the past.\n* Understanding the Moral Dimension of History involves learning about moral issues today by examining the past. This is an important step in historical literacy because it requires reserving present day moral judgments to understand actions from the past without approving of those actions.\nSCIM-C Strategy\nCreated by David Hicks, Peter E. Doolittle & E. Thomas Ewing, the SCIM-C strategy of historical thinking focuses on developing self-regulating practices when engaging with primary sources. The SCIM-C strategy focuses on the development of historical questions to be answered when analyzing primary sources. This strategy provides a scaffold for students as they build more complex investigation and analysis practices identified in the \"capstone stage\".  The capstone stage in the SCIM-C model relies on students having analyzed a number of historical documents and having built some historical knowledge about the time, event, or issue being studied.\n* Summarizing is the process of finding information using a primary source. This information can include the type of source (e.g. text, photograph), creator, subject, date it was created, and the opinion or perspective of the author.\n* Contextualizing is the skill of identifying when and in what context the primary source was created.  By placing the primary source in context the source can more easily be treated a historical document separate from contemporary morals, ethics, and values.\n* Inferring is the ability to use the information gathered during the summarizing and contextualizing of a source to develop a greater understanding of the sub-text of a primary source. This stage relies on the ability to ask questions requiring inference on what is not stated directly in the source.\n* Monitoring (Capstone Stage) involves identifying initial assumptions that may have been a part of the historical question asked. This stage requires an analysis of the original question and whether the historical information found has answered that question or whether more questions need to be considered.\n* Corroborating is the final stage that can only occurs once several historical documents have been analyzed. This stage involves comparing evidence from a number of sources. This comparison includes looking for similarities and differences in perspectives, gaps in the information, and contradictions.\nResources\n*Kobrin, David. Beyond the Textbook: Teaching History Using Primary Sources. Portsmouth, NH: Heinemann, 1996.\n*Lesh, Bruce. \"Why Won't You Just Tell Us the Answer?\" Teaching Historical Thinking in Grades 7-12.\" Portsmouth, Stenhouse, 2011.\n*Loewen, James. Lies My Teacher Told Me: Everything Your American History Textbook Got Wrong. New York: Touchstone, 1995.\n*National Center for Education Statistics. National Assessment of Educational Progress: Nation’s Report Card. 2003.  (last accessed 29 June 2004).\n*National Center for History in the Schools. National Standards for History. 1996.  (last accessed 14 February 2011).\n*Stearns, P., Seixas, P, Wineburg, S (Eds.). Knowing, Teaching and Learning History: National and International Perspectives. New York: NYU Press, 2000.\n*Wineburg, Sam. Historical Thinking and Other Unnatural Acts. Philadelphia, PA: Temple University Press, 2001.\n*Wineburg, Sam, Martin, Daisy, Monte-Sano, Chauncey. Reading like a Historian: Teaching Literacy in Middle and High School Classrooms. New York: Teachers College Press, 2012.\n*National History Education Clearinghouse\nReferences"
    }
  ]
}