{
  "content": [
    {
      "type": "text",
      "text": "# Historic Mill Creek Discovery Park\n\n| area = 625 acres (2.5 km²)\n| established = 1984\n| visitation_num =\n| visitation_year =\n| administrator = Michigan Department of Natural ResourcesMackinac Island State Park Commission\n| website =\n| area                           =\n| refnum                         = 78001496\n| designated_other1              = Michigan State Historic Site\n| designated_other1_link         = Michigan State Historic Preservation Office\n| designated_other1_date         = March 20, 1984\n| designated_other1_num_position = bottom\n}}\n}}\nHistoric Mill Creek, formerly known as Historic Mill Creek State Park and Historic Mill Creek Discovery Park, is a state park, nature preserve, and historic site in the United States state of Michigan.  It is run by Mackinac State Historic Parks, the operating arm of the Mackinac Island State Park.  625 acres (2.5&nbsp;km2) in size, the park is located 5 miles (8&nbsp;km) southeast of Mackinaw City, Michigan on U.S. Highway 23.\nHistory\nThe original sawmill at Mill Creek operated from about 1790 until 1839. It was originally built by Robert Campbell to supply lumber to the Straits of Mackinac, especially the frontier settlement of Mackinac Island. In 1793 it contracted with Fort Mackinac to make repairs on the soldiers' barracks. The Mill Creek sawmill enjoyed a dominant market share of the supply of cut timbers in the Straits of Mackinac during the fur trade era, and a millwright's house was built about 1820 near the sawmill to provide a place for the mill operator to live. In 1819, Michael Dousman purchased the mill site and continued to operate it. However, global demand for beaver fur declined in the 1830s, and  following Dousman's death in 1839 the sawmill and millwright's house were abandoned.\nAfter the sawmill's abandonment in 1839, the original sawmill complex buildings rotted and disappeared. However, timbers cut by the original mill survived in buildings on Mackinac Island (Mission Church and Mission House, built in the 1820s and still there today). Saw marks on these timbers could be used to reconstruct the mill machinery so as to closely resemble the original. The marks gave restoration experts information on the rake of the saw's teeth and the saw's operating speed. The wood is fed into the blade at 1/3 of an inch per stroke, and the infeed motion is powered by the pitman arm that powers the saw's vertical movement.\nArchaeological investigations were conducted at the site of the sawmill in the 1970s. The dig site was variously called  the \"Filbert Site,\" the \"Mill Creek Site,\" or the \"Campbell Farm Site,\" and was designated 20cn8.\nMill Creek today\nMill Creek drains the Dingman Marsh, a perched wetland within Mackinaw State Forest in northwest Cheboygan County. The Discovery Park includes approximately 1 mile (1.6&nbsp;km) of the eponymous creek's watercourse as it flows downhill toward Lake Huron, but not the wetland. The creek dam and sawmill (c. 1790) were rebuilt in 1984; the sawmill was restored in part for the 2007 season. The British Workshop (c. 1820) was rebuilt around 1994 on the site of the original. The millwright's house (c. 1820) was rebuilt in 2005.\nActivities and amenities\nThe park offers  of nature trails,  of which is handicapped-accessible.\nIn summers, costumed interpreters use antique woodworking tools to make shingles, and demonstrate a variety of other tasks common in the 1820s, and demonstrate the operation of the sawpit and sawmill.  A naturalist conducts talks on the animal and plant species of the nearby forested areas.\n}}\nExternal links\n*[https://www.mackinacparks.com/explore/history/historic-mill-creek-history/ Historic Mill Creek] Mackinac Island State Park Commission\n*[https://www2.dnr.state.mi.us/parksandtrails/details.aspx?id=473&type=SPRK Historic Mill Creek] Michigan Department of Natural Resources"
    }
  ]
}