{
  "content": [
    {
      "type": "text",
      "text": "# History of Rugby, Warwickshire\n\nThis is about the history of the town of Rugby, Warwickshire, England.\nAncient and Roman\nIn the Early Iron Age the Rugby area was settled. Rugby's site on a plateau at about 400 feet above sea level, overlooking the River Avon made it an important strategic post, which was a natural barrier between the Dobunni and the Corieltauvi tribes. Iron Age remains, probably lookout posts or forts, have been located on either side of the Avon.\nIn Roman times, two major Roman roads were built very close to the site of modern-day Rugby: the Fosse Way and Watling Street. Twelve miles north of Rugby is High Cross (Roman name Venonae), where the two roads cross.\nJust outside modern day Rugby, remains have been found of a Roman town called Tripontium, on the original Watling Street which is now known as the A5. Historians believe that the settlement was a kind of ancient service station, providing stabling and accommodation to passing Roman armies and travellers.\nMedieval and Tudor\nThe small settlement at Rugby was taken over by the Anglo-Saxons around 560 AD, and it was mentioned in the Domesday Book of 1086 as Rocheberie; there are several theories about the origin of the name, one is that it is derived from an old Celtic name Droche-brig meaning 'wild hilltop'. Another theory is that Rocheberie was a phonetic translation of the Old English name Hrocaberg meaning 'Hroca's hill fortification'; Hroca being an Anglo-Saxon man's name pronounced with a silent 'H', and berg being a name for a hill fortification, with the 'g' being pronounced as an 'ee' sound. By the 13th century the name of the town was commonly spelt as Rokeby (or Rookby) before gradually evolving into the modern form by the 18th century.\nIn 1255, lord of the manor Henry de Rokeby obtained a market charter for Rugby, which became a small rural market town, which it remained until the 19th century. The layout of the streets in the town centre around the market place still follows the pattern set down in medieval times. Rugby's built-up area was only High Street and Sheep Street and North Street and the Market Place.\nThroughout the Middle Ages, Cistercian monks from Pipewell Abbey in Northamptonshire had an extensive presence in the Rugby area, owning granges and other properties in Rugby itself, plus the surrounding villages of Bilton, Cawston, Church Lawford, Cosford, Dunchurch, Little Lawford, Long Lawford, Newbold-on-Avon, and Thurlaston. Of these the most important was the grange at Cawston. This lasted until the dissolution of the monasteries in the 16th century.\nIn the 12th century Rugby was mentioned as having a castle at the location of what is now Regent Place. However, the nature of the 'castle' is unknown, and it was possibly little more than a fortified manor house. In any event the 'castle' was short lived: It was probably constructed early in the reign of King Stephen (1135–1154) during the period of civil war known as The Anarchy, and then, as a so-called adulterine castle, built without Royal approval, demolished in around 1157 on the orders of King Henry II. The earthworks for the castle were still clearly visible as late as the 19th century, but have since been built over. According to one theory, the stones from the castle were later used to construct the west tower of St Andrew's Church which bears strong resemblance to a castle, and was probably intended for use in a defensive as well as a religious role.\nOne of the most significant events in the town's history was the founding in 1567 of Rugby School: Lawrence Sheriff, a locally born grocer to Queen Elizabeth I, left money in his will to establish a school in Rugby for local boys. The school needed to take some fee-paying pupils from outside the area, to help pay the bills, and gradually became a largely fee-paying school, with most of its pupils coming from outside Rugby. Eventually Lawrence Sheriff School was founded in 1878. to continue Sheriff's intention to provide a free grammar school for the boys of Rugby and surrounding villages.\nFrom medieval times until the late 18th century, the population of Rugby stayed at around 500–1000. It began to grow in the 1770s when the Oxford Canal was constructed around the town and spurred some growth in local industries and in population.\nBrushes with history\nRugby and its surrounding area had several brushes with some of the most important events in English history.\n]]\nThe Rugby area has associations with the Gunpowder Plot – On the eve of the plot on 5 November 1605, the plotters stayed at an inn in nearby Dunchurch to await news of the plot. If it had been successful then they planned to kidnap the princess Elizabeth of Bohemia, who was staying at nearby Coombe Abbey, and install her as Queen.\nDuring the English Civil War in the 17th century, King Charles I is said to have passed through Rugby on his way to Nottingham with 120 Cavalier troops during 1642. The attitudes of the townsfolk were said to be too close to the Parliamentarian cause for the king's liking. One of the most important battles of the war, the Battle of Naseby was fought some 15 miles east of Rugby.\nIn April 1645 Oliver Cromwell stayed in Rugby along with two regiments of Roundhead troops. He is said to have stayed at the \"Shoulder of Mutton Inn\" (where the Marks and Spencers shop used to be)\n19th-century development\nRugby for centuries was merely High Street, Sheep Street, North Street, and the Market Place. It only grew into an important settlement during the 19th century.\nInfluence of Rugby School\nRugby School, one of England's oldest and most prestigious public schools, rose to national prominence in the 18th century, during the headmastership of Henry Holyoake (from 1688 to 1731). The school moved to its current location in 1750. Later, the teaching methods pioneered by its headmaster, Dr Thomas Arnold, which contributed to a radical change in Public School education in England. In 1823 William Webb Ellis is said to have invented Rugby Football when he picked up the ball and ran with it.\nThe growing popularity of the school in the 18th and early 19th century led to an increase in population of the town. Many immigrants came to Rugby, many of whom were Rugby School pupils' parents, who preferred their sons to be able to go to a normal home life each night instead of having to endure school conditions (poor food, crowding, bullies) 24 hours every day; in Rugby such immigrants were called \"sojourners\". This caused Rugby to expand along Bilton Road and Dunchurch Road.\nRugby School during this period was immortalised by Thomas Hughes in his semi-autobiographical novel Tom Brown's Schooldays.\nComing of the railways\nThe railway at Rugby in 2004\nThe major factor in the growth of Rugby was the arrival of railways. In 1835 Rugby was a small rural town with a population of around 2,500. However, in 1838, one of the first trunk lines to be built in England, the London and Birmingham Railway, an early part of what later became the West Coast Main Line, was built around the town.\nIn 1840, the Midland Counties Railway, which linked the East Midlands with North East England, formed a junction with the London and Birmingham, making Rugby the busiest and most important railway junction in Britain.\nSoon railways were being built into Rugby from several different directions. The main Trent Valley Line from Stafford was built into Rugby in 1847. A line to Market Harborough and Peterborough was opened in 1850, and a line to Leamington Spa was opened in 1851. The Northampton loop line to Northampton opened in 1881.\nFor nearly 30 years, nearly all rail traffic between London, the Midlands, the north of England, Scotland, and north Wales passed through Rugby junction, giving the town huge national importance.\nBy the 1860s the junction had become extremely congested, so much so that it was not uncommon for trains to have to queue for hours to pass through. This caused much anger and frustration amongst travellers, for whom Rugby became a byword for delays. Charles Dickens lampooned it in his short story Mugby Junction (1866). To relieve this congestion a new line, later called the Midland Main Line, was built, taking a more direct route to London, avoiding Rugby. Much traffic was diverted onto the new line; Rugby remained one of the most important railway junctions in the country, but was no longer an all-important hub.\nThe first Rugby railway station was opened in 1838 when the London & Birmingham opened, located to the west of the present station. When the Midland Counties line was opened in 1840, the original station was badly located to serve the new line, and so a second station was opened close to the present one. This station lasted for over 40 years but proved to be inadequate to cope with traffic. In 1885 the present station was opened.\nIn 1899 the Great Central Railway was built into Rugby and the town gained a second station  which offered an alternative route to London and the north.\nGrowth of industry\nWith the railways, many wagon works, and engineering facilities were opened, and Rugby's population reached 10,000 by the 1880s, many employed by the railways. Because of its transport links, a number of industries developed in Rugby.\nIn 1862 the Rugby Lias Lime and Cement Co. Ltd. was founded, although manufacture of cement at the site began in 1855. Using the local Blue Lias clay.\nRugby began to develop more industries from the 1880s onwards. In 1881 a corset factory opened, employing local women. From the 1890s onwards Rugby began to attract engineering industry, due largely to its good transport links. The Willans & Robinson works opened in Rugby in 1893 which made steam engines. And in 1899 the British Thomson-Houston works opened which made electrical equipment and later turbines. Engineering would dominate the town's economy for most of the following century.\nAnother name associated with Rugby was Lodge Plugs, who made spark plugs, and who opened a factory in the town in 1916.\nChallenges of growth\nBy the middle of the 19th century, Rugby's infrastructure had not kept pace with the increase in population. Most notably, there was not an adequate supply of drinking water which was mostly sourced from wells and street pumps, nor was there adequate sewerage or sanitation. These problems caused Rugby's growth to stall. In 1849 Rugby became the first town in England to have a Local board of health, beating Croydon by a matter of weeks. The board had powers to levy a rate to provide drinking water and sewage facilities as well as powers to clean and pave streets and provide street lighting. However several early schemes to provide adequate drinking water were unsuccessful. It was not until 1876 that a reliable supply was obtained from the River Avon.\nUntil the 1870s, the cattle market was still held in the town centre as it had been since the Middle Ages. However this became increasingly unpopular with local residents. In 1878 the cattle market was moved near the railway station and within the last few years has been transformed into a housing estate\nIn 1894 Rugby became an urban district and gained its first elected council.\n20th century\n]]\nThe engineering works in Rugby attracted many workers to the town, and in the early decades of the 20th century the population grew rapidly and Rugby's built-up area spread fast in all directions. In 1901 the population of Rugby was 16,950, by the 1930s it had reached 40,000.\nDue to its expansion Rugby became a municipal borough in 1932, and the old Rugby Urban District Council was replaced with Rugby Borough Council. The nearby parishes of Bilton, Brownsover, Hillmorton and Newbold-on-Avon were incorporated into the new borough. Further local government reform in 1974 saw the borough expand to include the whole of the abolished Rugby Rural District.\nFrom 1926, near Rugby to its east was a large antenna farm for the Rugby VLF transmitter. All but four of the twelve big radio masts (used to broadcast the MSF time signal) were demolished in June 2004 – delayed by rabbits chewing through the wires controlling detonation. The other four were demolished in 2007.\nIn the late 1930s Frank Whittle developed the jet engine in Rugby. With his work taking place at the British Thomson-Houston works, and at Brownsover Hall.\nUnlike nearby Coventry and Nuneaton, Rugby was highly fortunate to avoid German bombing during the Second World War. This is perhaps somewhat surprising given the town's strategic importance as a railway junction and engineering centre. A few stray bombs landed on Dunchurch and some meant for the English Electric works caused damage to housing at New Bilton, but no other significant bomb damage occurred in the area. According to local legend, a reason why Rugby was not bombed substantially by the Germans during the war was because Unity Mitford, a close friend of Hitler was staying at Hillmorton.\nIn the postwar years Rugby became a centre of the national motorway network. Two of Britain's most important motorways, the M1 and M6, as well as the M45, run close to the town. Rugby expanded further, especially at Brownsover and Cawston where new housing estates were built.\nHowever, during the 1960s several of the railway lines which radiated from Rugby were closed as part of the Beeching axe. These included the once hugely important Midland Counties route to Leicester, the lines to Leamington and Peterborough, and the Great Central Line. Rugby Central Station was closed in 1969, leaving the town with only one station. As of 2006, only the West Coast Mainline still serves the town. During the 1990s the Daventry International Rail Freight Terminal, located just four miles to the east of the town, opened with connections to continental Europe and beyond.\nFrom the 1950s, Rugby gained a substantial Afro-Caribbean community, and a sizable community from the Indian sub-continent, making Rugby a multi-cultural town. There is a small Hindu temple in Rugby; it was converted from two adjacent terrace houses.\n21st century\nTwo major housing developments have rapidly increased the population of Rugby. The first called Cawston Grange was started in 2003 and vastly enlarged the then tiny hamlet of Cawston to the south-west of the town. Facilities there include a primary school, shops, and a community centre. Cawston is now connected to the rest of the town via Bilton. In conjunction with this the 3.7-mile Rugby Western Relief Road connecting Cawston with Newbold-on-Avon via New Bilton was completed in 2010. As of 2018 a second wave of development in the area was well underway.\nThe second major area of development was to the east of the town between Hillmorton and Crick. Located on the site of the former Rugby Radio Station, which was demolished in 2007, the new estate has been named Houlton and upon completion it is projected it will contain 6,200 houses. The first homeowners of phase one moved in during December 2017. There is currently a public restaurant/cafe, a village hall and a primary school, with other facilities planned.\nThe cattle market near the railway station was closed in May 2008. On the site were built houses, offices, a doctor's surgery, a small Tesco supermarket and a Travelodge hotel. The Daventry International Rail Freight Terminal was extended in 2011 and plans to extend it further are well in place.\nHistoric population\n{|  class=\"wikitable\"\n!Year!!Population\n|-\n|1562 || align=\"right\"| c 350*\n|-\n|1634 || align=\"right\"| c 650*\n|-\n|1730 || align=\"right\"| c 900*\n|-\n|1801 || align=\"right\"| 1,486\n|-\n|1811 || align=\"right\"| 1,805\n|-\n|1821 || align=\"right\"| 2,300\n|-\n|1831 || align=\"right\"| 2,501\n|-\n|1841 || align=\"right\"| 4,008\n|-\n|1851 || align=\"right\"| 6,851\n|-\n|1861 || align=\"right\"| 7,818\n|-\n|1871 || align=\"right\"| 8,585\n|-\n|1881 || align=\"right\"| 9,891\n|-\n|1891 || align=\"right\"| 11,262\n|-\n|1901 || align=\"right\"| 16,950\n|-\n|1911 || align=\"right\"| 21,758\n|-\n|1921 || align=\"right\"| 25,008\n|-\n|1931 || align=\"right\"| 35,100\n|-\n|1951 || align=\"right\"| 45,428\n|-\n|1961 || align=\"right\"| 51,651\n|-\n|1971 || align=\"right\"| 59,372\n|-\n|1991 || align=\"right\"| 61,100\n|-\n|2001 || align=\"right\"| 61,988\n|-\n|2011 || align=\"right\"| 70,628\n|-\n|2021 || align=\"right\"| 78,125\n|}\n* From historical estimates. Figures from 1801 onwards taken from census\nReferences\n*Rugby, Aspects of the Past, and Rugby, Further Aspects of the Past, by the Rugby Local History Group.\n*Rugby: A Pictorial History, by E.W. Timmins (1990)\n*''Rugby's Railway Heritage, by Peter H Elliot (1985)\n*Rugby Growth of a Town, by Eddy Rawlins & Andy Osborne (1988)\n*Rugby'', by Sarah Pernell (2001)\n*"
    }
  ]
}