{
  "content": [
    {
      "type": "text",
      "text": "# Historiography of World War II\n\nThe historiography of World War II is the study of how historians portray the causes, conduct, and outcomes of World War II.\nThere are different perspectives on the causes of the war; the three most prominent are the Orthodox from the 1950s, Revisionist from the 1970s, and Post-Revisionism which offers the most contemporary perspective. The orthodox perspective arose during the aftermath of the war. The main historian noted for this perspective is Hugh Trevor-Roper. Orthodox historians argue that Hitler was a master planner who intentionally started World War II due to his strong beliefs on fascism, expansionism, and the supremacy of the German state. Revisionist historians argue that it was an ordinary war by world standards and that Hitler was an opportunist of the sort who commonly appears in world history; he merely took advantage of the opportunities given to him. This viewpoint became popular in the 1970s, especially in the revisionism of A. J. P. Taylor. Orthodox historians argue that, throughout the course of the war, the Axis powers were an evil consuming the world with their powerful message and malignant ideology, while the Allied powers were trying to protect democracy and freedom. Post-revisionist historians of the causes, such as Alan Bullock, argue that the cause of the war was a matter of both the evil and the banal. Essentially Hitler was a strategist with clear aims and objectives, that would not have been achievable without taking advantage of the opportunities given to him. Each perspective of World War II offers a different analysis and provides different perspectives on the blame, conduct and causes of the war.\nOn the result of the war, historians in countries occupied by the Nazis developed strikingly similar interpretations celebrating a victory against great odds, with national liberation based on national unity. That unity is repeatedly described as the greatest source of future strength. Historians in common glorified the resistance movement (somewhat to the neglect of the invaders who actually overthrew the Nazis). There is great stress on heroes — including celebrities such as Charles de Gaulle, Winston Churchill and Josip Broz Tito — but also countless brave partisans and members of the resistance. Women rarely played a role in the celebrity or the histories, although since the 1990s, social historians have been piecing together the role of women on the home fronts. In recent years much scholarly attention has focused on how popular memories were constructed through selection, and how commemorations are held.\nCauses and motives\nSelf esteem and glory\nR.J. Bosworth argues the major powers have experienced intellectual conflict in interpreting their wartime stories. Some have ignored the central issues. Germany and, to a much lesser extent, Japan have experienced a collective self-analysis. But these two, as well as Great Britain, France, Russia, and Italy, have largely ignored many roles and have looked instead for glory even when it was lacking. In a lot of cases the countries deny any involvement in war crimes or objectionable historical occurrences.\nBlame\nBlame as the driving force during World War II, is a widely known orthodox perspective. Especially directly after World War II, Nazi Germany was held to blame for starting the war. Orthodox historians cited several reasons for this. Germany was the one who initially invaded Poland against the recommendation of the allies, and also attacked the Soviet Union. Also, the system of alliances between the Axis powers was one that was only meant for war. The Tripartite Pact stated that if any country declared war on one of the Axis countries, the other two would also declare war on those countries. Another reason, historians saw, is that the policies of Hitler were overly aggressive; not only did Hitler preach war with France and the Soviet Union, but he followed a careful plan of expansion. The events that took place before the war such as the Remilitarization of the Rhineland, Anschluss, and the German involvement during the Spanish Civil War, showed that Hitler was anticipating the possibility of war and preparing for one.\nTaylor The Origins of the Second World War (1961)\nIn 1961, English historian A. J. P. Taylor published his most controversial book, The Origins of the Second World War, which earned him a reputation as a revisionist—that is, a historian who sharply changes which party was \"guilty.\" The book had a quick, profound impact, upsetting many readers. Taylor argued against the standard thesis that the outbreak of the Second World War – by which Taylor specifically meant the war that broke out in September 1939 – was the result of an intentional plan on the part of guilty Adolf Hitler. He began his book with the statement that too many people have accepted uncritically what he called the \"Nuremberg Thesis\", that the Second World War was the result of criminal conspiracy by a small gang comprising Hitler and his associates. He regarded the \"Nuremberg Thesis\" as too convenient for too many people and claimed that it shielded the blame for the war from the leaders of other states, let the German people avoid any responsibility for the war and created a situation where West Germany was a respectable Cold War ally against the Soviets.\nTaylor's thesis was that Hitler was not the demoniacal figure of popular imagination but in foreign affairs a normal German leader. Citing Fritz Fischer, he argued that the foreign policy of Nazi Germany was the same as those of the Weimar Republic and the German Empire. Moreover, in a partial break with his view of German history advocated in The Course of German History, he argued that Hitler was not just a normal German leader but also a normal Western leader. As a normal Western leader, Hitler was no better or worse than Stresemann, Chamberlain or Daladier. His argument was that Hitler wished to make Germany the strongest power in Europe but he did not want or plan war. The outbreak of war in 1939 was an unfortunate accident caused by mistakes on everyone's part.\nNotably, Taylor portrayed Hitler as a grasping opportunist with no beliefs other than the pursuit of power and anti-Semitism. He argued that Hitler did not possess any sort of programme and his foreign policy was one of drift and seizing chances as they offered themselves. He did not even consider Hitler's anti-Semitism unique: he argued that millions of Germans were just as ferociously anti-Semitic as Hitler and there was no reason to single out Hitler for sharing the beliefs of millions of others.\nTaylor argued that the basic problem with an interwar Europe was a flawed Treaty of Versailles that was sufficiently onerous to ensure that the overwhelming majority of Germans would always hate it, but insufficiently onerous in that it failed to destroy Germany's potential to be a Great Power once more. In this way, Taylor argued that the Versailles Treaty was destabilising, for sooner or later the innate power of Germany that the Allies had declined to destroy in 1918–1919 would inevitably reassert itself against the Versailles Treaty and the international system established by Versailles that the Germans regarded as unjust and thus had no interest in preserving. Though Taylor argued that the Second World War was not inevitable and that the Versailles Treaty was nowhere near as harsh as contemporaries like John Maynard Keynes believed, what he regarded as a flawed peace settlement made the war more likely than not.\nBy geography\nThe Nazis perfected the art of stealing, draining the local economies to the maximum or beyond, so that overall production fell. In all occupied countries resistance movements sprang up. The Germans tried to infiltrate and suppress them, but after the war they emerged as political actors. The local Communists were especially active in promoting resistance movements, as was the British Special Operations Executive (SOE).\nCanada\nCanada incorporated professional historians to Canadian Military Headquarters in the United Kingdom during the war and paid much attention to the chronicling of the conflict in the words of the official historians of the Army Historical Section and through art and trained painters. The official history of the Canadian Army was undertaken after the war, with an interim draft published in 1948 and three volumes in the 1950s. This was in comparison to the First World War's official history, only one volume of which was completed by 1939 and the full text only released after a change in authors some 40 years after the fact. Official histories of the RCAF and RCN in the Second World War were also a long time coming, and the book Arms, Men and Government by Charles Stacey (one of the main contributors to the Army history) was published in the 1980s as an \"official\" history of the war policies of the Canadian government. The performance of Canadian forces in some battles has remained controversial, such as Hong Kong and Dieppe, and a variety of books have been written on them from various points of view. Serious historians, mainly scholars, emerged in the years after the Second World War, foremost Terry Copp (a scholar) and Denis Whitaker (a former soldier).\nEastern Front\nIt is commonly said that history is written by the victors, but the opposite occurred in the chronicling of the Eastern Front, particularly in the West. Soviet secrecy and unwillingness to acknowledge events that might discredit the regime led to them revealing little information, always heavily edited, leaving western historians mostly to rely on German sources. While valuable sources, they tended to be self-serving; German generals, in particular, tried to distance themselves and the Heer'' from the Nazi Party, while at the same time blaming them for their defeat (individuals supporting these arguments are commonly called part of the 'Hitler Lost Us The War' group). While this self-serving approach was noticed at the time, it was still generally accepted as the closest version of the truth. The result was a commonly held picture of the Heer being the superior army, ground down by the vast numbers of the 'Bolshevik horde' and betrayed by the stupidity of Hitler. Not only did this ignore Hitler's talent as a military leader, an erratic talent that was sometimes brilliantly incisive and sometimes grossly in error, it also severely undervalued the remarkable transformation of the Soviet armed forces, especially the Red Army, from the timid, conservative force of 1941 to an effective war-winning organisation.\nAfter the fall of the Berlin Wall, Western historians were suddenly exposed to the vast number of Soviet records of the time. This has led to an explosion of the works on the subject, notably by David Glantz, Earl Ziemke and Richard Overy. These historians revealed the brutality of Stalin's regime, the recovery of the USSR and the Red Army in 1942 and the courage and abilities of the average Soviet soldier, relying on Soviet archival material to do so. Phillips Payson O'Brien argues that it is a fallacy that the war was won on the Eastern Front. He argues instead that it was won by the air-sea battle, which immobilized the German and Japanese forces. They lost mobility, were unable to move munitions from the factory to the battlefield and ran out of fuel for their aircraft and ships. They became highly vulnerable and were helpless.\nEspecially here the provided data gets interpreted differently. When it comes to casualties, there are massive differences, which are often influenced by the political or societical structure of a country. This cannot be really proven though, because the provided data from that time is already manipulated and may not be true or fabricated.\nEurope at War 1939–1945: No Simple Victory (2006) by Welsh historian Norman Davies sought to correct common misconceptions about the war, such as that contrary to popular belief in the West, the dominant part of the conflict took place in Eastern Europe between the two totalitarian systems of the century, communism and Nazism; that Stalin's USSR was as bad as Hitler's Germany. The subtitle No Simple Victory does therefore not just refer to the losses and suffering the Allies had to endure to defeat the Axis but also the difficult moral choice the Western democracies had to make when allying themselves with one criminal regime in order to defeat another.\nFrance\nBattle of France, 1940\nThe German victory over French and British forces in the Battle of France (10 May – 22 June 1940) was one of the most unexpected and astonishing events of the 20th century and has generated a large popular and scholarly literature.\nObservers in 1940 found the events unexpected and earth-shaking. Historian Martin Alexander notes that Belgium and the Netherlands fell to the German army in a matter of days and the British were soon driven back to their home islands:\n:But it was France's downfall that stunned the watching world. The shock was all the greater because the trauma was not limited to a catastrophic and deeply embarrassing defeat of her military forces - it also involved the unleashing of a conservative political revolution that, on 10 July 1940, interred the Third Republic and replaced it with the authoritarian, collaborationist Etat Français of Vichy. All this was so deeply disorienting because France had been regarded as a great power....The collapse of France, however, was a different case (a 'strange defeat' as it was dubbed in the haunting phrase of the Sorbonne's great medieval historian and Resistance martyr, Marc Bloch).\nOne of the most influential books on the war was written in summer 1940 by French historian Marc Bloch: ''L'Étrange Défaite'' (\"Strange Defeat\"). He raised most of the issues historians have debated since. He blamed France's leadership:\n:What drove our armies to disaster was the cumulative effect of a great number of different mistakes. One glaring characteristic is, however, common to all of them. Our leaders...were incapable of thinking in terms of a new war.\nGuilt was widespread. Carole Fink argues that Bloch:\n:blamed the ruling class, the military and the politicians, the press and the teachers, for a flawed national policy and a weak defense against the Nazi menace, for betraying the real France and abandoning its children. Germany had won because its leaders had better understood the methods and psychology of modern combat.\nResistance\nThe heroism of the French Resistance has always been a favoured topic in France and Britain, with new books in English appearing regularly.\nVichy France\nAfter 1945 the French ignored or downplayed the role of Marshal Petain's puppet government in Vichy France. Since the late 20th century it has become a major research topic.\nCollaboration\nCollaboration with the Germans was long denied by the French, but since the late 20th century has generated a large literature.\nCivilian conditions\nThe roles of civilians, forced labourers and POW's has a large literature.\nThere are numerous studies of women.\nAlsace-Lorraine\nGermany integrated Alsace-Lorraine into its German Empire in 1871, France recovered it in 1918, it was again in occupation 1940–45. There was widespread material damage. The first wave of destruction in 1940 was inflicted by German forces, the second was caused by Allied bombers in 1944, and the final wave surrounded bitter fighting between German occupiers and American liberators in 1944–1945.\nDenmark\nBeginning with the German occupation of Denmark in 1940 and lasting until 1943, the Danish government had a \"Policy of Cooperation\" (da) with Nazi Germany. This meant the Danish government tried to do a balancing act of officially cooperating with the Nazis, while at the same time also working against them and aiding the Danish resistance. Due to this cooperation, Adolf Hitler labelled Denmark as the \"model protectorate\". When the Policy of Cooperation collapsed in 1943, the resistance helped about 7,000 Jews (and about 500 non-Jewish spouses of Jews) escape across Øresund to neutral Sweden. This operation is known as the rescue of the Danish Jews, and was a great source of frustration for the Nazis.\nDenmark has a large popular literature on the war years, which has helped shape national identity and politics. Scholars have also been active but have much less influence on this topic. After the liberation two conflicting narratives emerged. A consensus narrative told how Danes were united in resistance. However, there was also a revisionist interpretation which paid attention to the resistance of most Danes, but presented Danish establishment as a collaborating enemy of Danish values. The revisionist version from the 1960s was successfully adopted by the political Left for two specific goals: to blemish the establishment now allied with the \"imperialist\" United States, and to argue against Danish membership in the European Community. From the 1980s, the Right started to use revisionism to attack asylum legislation. Finally around 2003, Liberal Prime Minister Anders Fogh Rasmussen started using it as his basic narrative of the war years (partly to legitimize his government's decision to join the war against Iraq in 2003). The occupation has thus played a central role in Danish political culture since 1945, although the role of professional scholars has been marginal.\nNetherlands\nDutch historiography of World War II focused on the government in exile, German repression, Dutch resistance, the Hunger Winter of 1944-45 and, above all, the Holocaust. The economy was largely neglected; it was robust in 1940-41 then deteriorated rapidly as exploitation produced low productivity, impoverishment and hunger.\nNorway\nThe memory of the war seared Norwegians and shaped national policies. Economic issues remain an important topic.\nPoland\nOn August 1, 1944, the clandestine Polish Home Army, owing allegiance to the exiled government in London, initiated an uprising in Warsaw against the occupying Germans. There is a large literature in several languages. The Warsaw Rising Museum (WRM), opened in Warsaw in 2004 to commemorate it.\nPolish Jews made up about half of Holocaust victims. There is a large literature on the Holocaust in Poland and its memory and memorials, and also the Jewish uprising in the Warsaw ghetto in 1943.\nSoviet Union\nPopular behaviour has been explored in Byelorussia under the Germans, using oral history, letters of complaint, memoirs, and reports made by the Soviet secret police and by the Communist Party.\nBy theme\nCommon themes: heroic liberation from Nazis\nAlmost all national narratives of the Second World War—ranging from historiography in liberal democracies to that of Communist dictatorship, fit the same European pattern. The French-German historian Etienne Francois has identified the common themes, as paraphrased by Johan Östling:\n:Fundamental to them all...was the victory over Nazi Germany. In descriptions of the end of the war and the liberation, national unity was often stressed. This newly won liberty opened a door to the future and marked the beginning of a new, bright chapter in history. A common characteristic in most national narratives was the glorification of the resistance movement, while in countries that had been liberated by foreign troops, domestic efforts tended to be highly praised. In addition, the 'heroisation' of the war was another common denominator in the narratives – not only were charismatic victors such as Charles de Gaulle, Winston Churchill and Josip Broz Tito designated as heroes, but also brave partisans and members of the resistance.\nHistorikerstreit\nHolocaust denial\nA field of pseudohistory has emerged which attempts to deny the existence of the Holocaust and the mass extermination of Jews in German-occupied Europe. The proponents of the belief, known as Holocaust deniers or \"negationists\", are usually associated with Neo-Nazism and their views are rejected by professional historians.\nWar crimes of the Wehrmacht\nAt the Nuremberg Trials, the Schutzstaffel (SS) was declared a criminal organization, but the regular armed forces (Wehrmacht) were not. Although some high-ranking field marshals and generals were convicted of war crimes for issuing criminal orders, Nazi war crimes were mostly blamed on the SS-Totenkopfverbände (concentration camp guards) and the Einsatzgruppen (death squads), overlooking the participation of Wehrmacht soldiers in the Holocaust. More recent scholarship has challenged this view. An exhibition on the war crimes of the Wehrmacht sparked demonstrations.\nWomen\nReferences\nWorks cited\n*\nFurther reading\n* Ballinger, Pamela. \"Impossible Returns, Enduring Legacies: Recent Historiography of Displacement and the Reconstruction of Europe after World War II.\" Contemporary European History 22#1 (2013): 127–138.\n* Bodnar, John. ''The 'Good War' in American History'' (Johns Hopkins University Press, 2010)\n* Bosworth, R. J. B. \"Nations Examine Their Past: A Comparative Analysis of the Historiography of the 'Long' Second World War.\" History Teacher 29.4 (1996): 499–523. [https://www.jstor.org/stable/494801 in JSTOR]\n* Bosworth, R. J. B. Explaining Auschwitz and Hiroshima: History Writing and the Second World War 1945-1990 (Routledge, 1994) [https://www.questia.com/library/103409432/explaining-auschwitz-and-hiroshima-history-writing online]\n* Bucur, Maria. Heroes and victims: Remembering war in twentieth-century Romania (Indiana UP, 2009).\n* Chirot, Daniel, ed. Confronting Memories of World War II: European and Asian Legacies (U of Washington Press, 2014).\n* Cook, Tim. ''Clio's Warriors: Canadian Historians and the Writing of the World Wars (UBC Press, 2011).\n* Dreisziger, Nándor F., ed. Hungary in the Age of Total War (1938-1948) (East European Monographs, 1998).\n* Edele, Mark. \"Toward a sociocultural history of the Soviet Second World War.\" Kritika: Explorations in Russian and Eurasian History 15.4 (2014): 829–835.\n* Edwards, Sam. Allies in Memory: World War II and the Politics of Transatlantic Commemoration, c. 1941–2001'' (Cambridge UP, 2015).\n* Eley, Geoff. \"Finding the People's War: Film, British Collective Memories and World War II\" American Historical Review 106#3 (2001), 818–38,\n* Evans, Martin and Kenn Lunn, eds. War and Memory in the 20th Century (1997).\n* Fujitani, T., Geoffrey M. White and Lisa Yoneyama, eds. Perilous Memories: The Asia-Pacific War(s) (2001)\n* Geyer, Michael, and Adam Tooze, eds. The Cambridge History of the Second World War: Volume 3, Total War: Economy, Society and Culture (2015) ch 23–27, pp 625–810.\n* Herf, Jeffrey. Divided Memory: The Nazi Past in the Two Germanys (1997).\n* Horton, Todd A., and Kurt Clausen. \"Extending the History Curriculum: Exploring World War II Victors, Vanquished, and Occupied Using European Film.\" History Teacher 48.2 (2015). [http://www.societyforhistoryeducation.org/pdfs/F15_Horton_and_Clausen.pdf online]\n* Jager, S. M. and R. Mitter, eds. Ruptured Histories: War, Memory, and the Po st-Cold War in Asia (2007).\n* Keshen, Jeffrey A. ''Saints, Sinners, and Soldiers: Canada's Second World War (UBC Press, 2007).\n* Killingray, David, and Richard Rathbone, eds. Africa and the Second World War (Springer, 1986).\n* Kivimäki, Ville. \"Between defeat and victory: Finnish memory culture of the Second World War.\" Scandinavian Journal of History 37.4 (2012): 482–504.\n* Kochanski, Halik. The eagle unbowed: Poland and the Poles in the Second World War (Harvard UP, 2012).\n* Kohn, Richard H. \"The Scholarship on World War II: Its Present Condition and Future Possibilities.\" Journal of Military History 55.3 (1991): 365.\n* Kushner, Tony. \"Britain, America and the Holocaust: Past, Present and Future Historiographies.\" Holocaust Studies 18#2-3 (2012): 35–48.\n* Lagrou,  Pieter.  The Legacy of Nazi Occupation: Patriotic Memory and National Recovery in Western Europe, 1945-1965 (1999). focus on France, Belgium and the Netherlands.\n* Lebow, Richard Ned et al. eds. The Politics of Memory in Postwar Europe (2006).\n* Lee, Loyd E. and Robin Higham, eds.  World War II in Asia and the Pacific and the War's aftermath, with General Themes: A Handbook of Literature and Research (Greenwood Press, 1998) [https://www.questia.com/library/5028208/world-war-ii-in-asia-and-the-pacific-and-the-war-s online]\n* Lee, Loyd E. and Robin Higham, eds. World War II in Europe, Africa, and the Americas, with General Sources: A Handbook of Literature and Research (Greenwood Press, 1997) [https://www.questia.com/library/3611091/world-war-ii-in-europe-africa-and-the-americas online]\n* Maddox, Robert James. Hiroshima in History: The Myths of Revisionism (University of Missouri Press, 2007) [https://www.questia.com/library/120086122/hiroshima-in-history-the-myths-of-revisionism online]\n* Martel, Gordon ed. Origins of the Second World War Reconsidered'' (2nd ed. 2002) [https://www.questia.com/library/102859095/the-origins-of-the-second-world-war-reconsidered online]\n* Mitter, Rana. \"Old ghosts, new memories: China's changing war history in the era of post-Mao politics.\" Journal of Contemporary History (2003): 117–131. [https://www.jstor.org/stable/3180700 in JSTOR]\n* Moeller, Robert G. War Stories: The Search for a Usable Past in the Federal Republic of Germany (2001).\n* Mosse, George L. Fallen Soldiers: Reshaping the Memory of the World Wars (1990).\n* Niven, Bill. ed. Germans as Victims: Remembering the Past in Contemporary Germany (2006)\n* Morgan, Philip. The fall of Mussolini: Italy, the Italians, and the second world war (Oxford UP, 2007).\n* Noakes, Lucy and Juliette Pattinson, eds. British Cultural Memory and the Second World War (2013)\n* O'Brien, Phillips Payson.  How the War Was Won: Air-Sea Power and Allied Victory in World War II (2015). [https://www.amazon.com/Air-Sea-Power-Allied-Victory-Hardback/dp/B00XGL9AMY/ Excerpt].\n** Detailed review by Mark Harrison,  \"World War II: Won by American Planes and Ships, or by the Poor Bloody Russian Infantry?.\" Journal of Strategic Studies 39.4 (2016): 592–598. [https://ageconsearch.umn.edu/record/270017/files/twerp_1077_harrison.pdf Online].\n* Östling, Johan. \"Swedish Narratives of the Second World War: A European Perspective\" Contemporary European History (2008), 17#2 pp 197–211.\n* Overy, Richard James. The Origins of the Second World War (Routledge, 2014).\n* Parrish, Michael. \"Soviet Historiography of the Great Patriotic War 1970-1985: A Review.\" Soviet Studies in History 23.3 (1984)\n* Rasor, Eugene. The China-Burma-India Campaign, 1931-1945: Historiography and Annotated Bibliography (Greenwood Press, 1998) [https://www.questia.com/library/120080325/the-china-burma-india-campaign-1931-1945-historiography online]\n* Rasor, Eugene. The Southwest Pacific Campaign, 1941-1945: Historiography and Annotated Bibliography (Greenwood Press, 1996) [https://www.questia.com/library/91666933/the-southwest-pacific-campaign-1941-1945-historiography online]\n* Reynolds, David. In Command of History: Churchill Fighting and Writing the Second World War (2004)\n* Rousso, Henri.  The Vichy Syndrome: History and Memory in France Since 1944 (1991)\n* Schumacher, Daniel. \"Asia's 'Boom'of Difficult Memories: Remembering World War Two Across East and Southeast Asia.\" History Compass 13.11 (2015): 560–577.\n* Shaffer, Robert. \"G. Kurt Piehler, Sidney Pash, eds. The United States and the Second World War: New Perspectives on Diplomacy, War, and the Home Front (Fordham University Press, 2010).\n* Stenius, Henrik, Mirja Österberg, and Johan Östling, eds. Nordic Narratives of the Second World War: National Historiographies Revisited (2012).\n* Stone, Dan. Historiography of the Holocaust (2004) 573p.\n* Summerfield, Penny. ''Reconstructing women's wartime lives: discourse and subjectivity in oral histories of the Second World War (Manchester University Press, 1998); emphasis on Britain.\n* Thonfeld, Christoph. \"Memories of former World War Two forced labourers-an international comparison.\" Oral History (2011): 33–48. [https://www.jstor.org/stable/41332163 in JSTOR]\n* Weinberg, Gerhard L. A world at arms: A global history of World War II (Cambridge UP, 1995).\n* Weinberg, Gerhard L. \"World War II scholarship, now and in the future.\" Journal of Military History 61.2 (1997): 335+.\n* Wolfgram, Mark A. Getting History Right\": East and West German Collective Memories of the Holocaust and War (Bucknell University Press, 2010).\n* Wood, James S. \"A Historical Debate of the 1960s: World War II Historiography‐The Origins of the War, AJP Taylor, and his Critics.\" Australian Journal of Politics & History'' 26.3 (1980): 403–410."
    }
  ]
}