{
  "content": [
    {
      "type": "text",
      "text": "# Historian of the United States House of Representatives\n\nThe historian of the United States House of Representatives is an official appointed by the United States House of Representatives to study and document its past. The House historian heads the Office of the House Historian, which serves as the institutional memory for the institution. The current historian of the House is Matthew Wasniewski.\nPurpose\nAccording to the official website for the House of Representatives:\n}}\nHistory\nThe post was first created in 1983 and its first holder was University of Maryland, College Park historian Raymond W. Smock. In a move that was seen by many as politically motivated, Smock was fired by the new Speaker of the House, Newt Gingrich, when the Republican Party took control of the House in January 1995.\nIn his place, Gingrich appointed Christina Jeffrey, a political scientist from Kennesaw State University, to the post. However, a controversy arose over comments Jeffrey had made in 1986, while evaluating a program called [https://www.facinghistory.org Facing History and Ourselves] for the US Department of Education. She wrote, \"The program gives no evidence of balance or objectivity. The Nazi point of view, however unpopular, is still a point of view and is not presented, nor is that of the Ku Klux Klan.\"  Democrats and Jewish groups expressed outrage at the comments, but Jeffrey called the allegations against her \"slanderous and outrageous.\" Gingrich dismissed her six days after she took up the post. (Following a meeting with Jeffrey several months after her dismissal, Abraham Foxman, the National Director of the Anti-Defamation League, wrote that the ADL was \"satisfied that any characterization of you as anti-Semitic or sympathetic to Nazism is entirely unfounded and unfair.\")\nThe post remained vacant for the next decade. In 2005, House Speaker Dennis Hastert appointed Robert V. Remini to the post. Prior to his appointment, Remini had been commissioned by Librarian of Congress James H. Billington to write a history of the House of Representatives, as provided by the House Awareness and Preservation Act of 1999. The book he wrote, The House: The History of the House of Representatives, was awarded the George Pendleton Prize. Remini retired in 2010.\nIn 2010, Speaker of the House Nancy Pelosi, with the cooperation of House minority leader John Boehner, appointed a panel of historians to conduct a search for Remini's replacement. Their unanimous recommendation was Matthew Wasniewski, then serving as the historian in the House Clerk's Office of History and Preservation. Wasniewski's appointment was announced in October, 2010.\nList of House historians\n* Ray Smock 1983–1995\n* Christina Jeffrey 1995\n* Vacant 1995–2005\n* Robert V. Remini 2005–2010\n* Matthew Wasniewski 2010–present\nReferences"
    }
  ]
}