{
  "content": [
    {
      "type": "text",
      "text": "# Historic Fourth Ward Park\n\n, mid-2012]]\nHistoric Fourth Ward Park is a park in the Old Fourth Ward of Atlanta, just south of Ponce City Market and just west of the BeltLine Eastside Trail.\nCurrently the park covers  in two separate sections.\nHistory\nIn Atlanta's Old Fourth Ward neighborhood, flooding from nearby Clear Creek has always been an issue. In the late 1980s and early 90s, the city drafted a $40 million plan to dig a massive underground tunnel in order to channel excess stormwater to a processing plant, where it would be cleaned and discharged into the Chattachoochee River. However, engineer-economist and environmentalist Bill Eisenhauer had a better idea. Eisenhauer believed that a solution utilizing green infrastructure could provide more benefits to both the ecosystem, and local residents. Eisenhauer created a plan for Historic Fourth Ward Park, a recreational area surrounding a 5-acre stormwater retention pond. The new plan, costing only $23 million, was noticed by local architect Markham Smith. Smith helped Eisenhauer organize stakeholders, including the Trust for Public Land and the Atlanta BeltLine, who purchased the declining industrial property next to the former Sears warehouse, where Eisenahuer had hoped new park would be housed.\nThe stormwater drainage pond, which is set deeply into a bowl below the water table, is capable of holding up to 4 million gallons of water and slowly transporting them to the city's sewage treatment plant, enabling the park to handle a 500 year flood. In addition to the new pond, the park also includes landscaped walkways, bridges, observation points, grassy fields, as well as a shaded playground and splashpad to help residents escape the heat. The transformation of a declining industrial area into this park has increased the amount of green space in the Old Fourth Ward significantly, helping to reduce flooding and manage the urban heat island effect. Aside from being able to store large amounts of stormwater, the plant species in the park increase water infiltration and evapotranspiration, limiting excess water on a daily basis.\nOne of the park's major funders and partners, the Atlanta Beltline, has faced criticism for the impact the park and other greening projects have had on surrounding communities. The creation of the Historic Fourth Ward park prompted development, including expensive loft apartments (with a small proportion of units slated for affordable housing), high-end realtors, and upscale restaurants.\nPond And Amphitheater\nThe park includes a pond with a path around it and has an aerator fountain to keep it from stagnating.  An amphitheater, cushioned with bermudagrass, surrounds part of the pond.\nSkate park\nThe skate park is located at 830 Willoughby Way, Atlanta, Georgia 30312. It is a  facility which offers bowls, curbs, and smooth-rolling concrete mounds. The designated skating facility is Atlanta's first public skate park. The park opened June 2011 with legendary skater Tony Hawk in attendance. Hawk's philanthropic foundation awarded the project $25,000. Hawk stated that the clear vision of BeltLine officials, as well as of Little Five Points' Stratosphere skateboards owner Thomas Taylor, who encouraged city officials to build the park, heavily influenced his foundation's decision to award the money.\nSections\n* Phase I,  from Morgan St. down to Rankin St., centered on waterfalls and the stormwater retention pond, opened in February 2011 ahead of the official grand opening in June 2011\n* Phase II brought the total size of the park to , consisting of additions to the north and to the south:\n**the section between Rankin St. south to Ralph McGill Blvd. opened in June 2011 with a playground and \"splash pad\" for children, urban forest and recirculating stream, restrooms, a grand stair, wildflower meadow, entry lawn and entry plaza from Ralph McGill Blvd.\n**the section from North Ave. down to Morgan St., across from Ponce City Market and alongside Masquerade (Atlanta) includes a grand entry, event lawn and \"artifact bosque\". Part of this extension opened to the public in January 2012 ([https://web.archive.org/web/20120122034502/http://christophertmartin.com/uploads/Beltline/4thWard1512/ photos]).\n* A separate  section (acreage in addition to the Phase II total above), separated from the main park, immediately adjacent to the BeltLine and Freedom Parkway also opened in June 2011 and includes a sports field, skate park (see above), playground and restrooms. It is accessible by car from Wiiloughby Way and on foot from the BeltLine.\nFuture expansion\nIn January 2013 the BeltLine announced that it had acquired a  parcel (bordering The Masquerade property on the south) which would connect the BeltLine with the park.\nGallery\nSee also\n* List of contemporary amphitheatres\nReferences\nBibliography\n* [http://beltline.org/parks/historic-fourth-ward-park/ The Atlanta Beltline]\n* [http://www.h4wpc.com/ Historic Fourth Ward Park Conservancy]\n* [http://www.facebook.com/#!/pages/Fourth-Ward-Alliance/257790480307 Fourth Ward Alliance]\nExternal links\n* [http://landscapeonline.com/research/article/17483 Design overview of the park at LandscapeOnline.com]"
    }
  ]
}