{
  "content": [
    {
      "type": "text",
      "text": "# HMAS Warramunga (FFH 152)\n\n{|\n| Ship namesake = The Warumungu people\n| Ship builder = Tenix Defence\n| Ship laid down = 26 July 1997\n| Ship launched = 23 May 1998\n| Ship commissioned = 31 March 2001\n| Ship decommissioned =\n| Ship homeport = Fleet Base East, Sydney\n| Ship identification = *\n*Callsign: VKLD\n| Ship motto = \"Courage In Difficulties\"\n| Ship nickname =\n| Ship honours = Six inherited battle honours\n| Ship status = Active as of 2025\n| Ship notes =\n| Ship badge =\n}}\n| Ship beam =\n| Ship draught =\n| Ship propulsion = *1 × General Electric LM 2500 gas turbine providing 30,000 hp (22.5 mW)\n*2 × MTU 12v 1163 TB83 diesels providing 8,840 hp (6.5 mW)\n| Ship speed =\n| Ship range =  at\n| Ship endurance =\n| Ship boats =\n| Ship complement = approximately 170 sailors\n| Ship sensors = *Sonars: Thomson Sintra Spherion B Mod 5; hull-mounted; active search and attack; medium frequency. Provision for towed array\n*Air search radar: Raytheon AN/SPS-49(V)8 ANZ (C/D-band)\n*Search radar: CEA Technologies CEAFAR Active Phased Array Radar (S Band)\n*Navigation: Kelvin Hughes Sharpeye (I-band)\n*Passive Detection: Sagem Vampir NG Infrared Search/track\n*Target Illumination Radar: CEA Technologies CEAMOUNT Active Phased Array Illuminator (X Band)\n*Combat data systems: Saab 9LV 453 Mk 3E.Link 11& Link16\n*Weapons control: Saab 9LV 453 radar/optronic director with CEA Solid State Continuous Wave Illuminator\n| Ship EW = *ESM: Racal modified Sceptre A (radar intercept), Telefunken PST-1720 Telegon 10 (comms intercept)\n*Countermeasures: Decoys: G & D Aircraft SRBOC Mk 36 Mod 1 decoy launchers for SRBOC, BAE Systems Nulka active missile decoy\n| Ship armament = *Guns and missiles: 1 × 5 in/54 (127 mm) Mk 45 Mod 2 gun, 2 × Rafael Mini Typhoon 12.7mm (.50 cal) CIWS, small arms, 2 × 4 Harpoon Block II anti-ship missiles, Mk 41 Mod 5 VLS for Sea Sparrow and Evolved Sea Sparrow\n*Torpedoes: 2 × triple 324 mm Mk 32 Mod 5 tubes with MU 90 Torpedo\n| Ship aircraft = 1 × Sikorsky MH-60R Seahawk\n| Ship notes = Post-Anti-Ship Missile Defence Project upgrade. See class article for original configuration.\n}}\n|}\n'HMAS Warramunga (FFH 152)' is an Anzac-class frigate of the Royal Australian Navy (RAN). One of ten frigates built for the Australian and New Zealand navies, Warramunga was laid down by Tenix Defence in 1997 and commissioned in 2001. During her career, the frigate has operated in the Persian Gulf as part of Operation Catalyst, and undertaken anti-piracy operations off Somalia. Warramunga underwent the Anti-Ship Missile Defence (ASMD) upgrade during 2014. She is active as of April 2025.\nDesign and construction\nThe Anzac class originated from RAN plans to replace the six River-class destroyer escorts with a mid-capability patrol frigate. The Australian shipbuilding industry was thought to be incapable of warship design, so the RAN decided to take a proven foreign design and modify it. Around the same time, the Royal New Zealand Navy (RNZN) was looking to replace four Leander-class frigates; a deterioration in New Zealand-United States relations, the need to improve alliances with nearby nations, and the commonalities between the RAN and RNZN ships' requirements led the two nations to begin collaborating on the acquisition in 1987. Tenders were requested by the Anzac Ship Project at the end of 1986, with 12 ship designs (including an airship) submitted. By August 1987, the tenders were narrowed down in October to Blohm + Voss's MEKO 200 design, the M class (later Karel Doorman class) offered by Royal Schelde, and a scaled-down Type 23 frigate proposed by Yarrow Shipbuilders. In 1989, the Australian government announced that Melbourne-based shipbuilder AMECON (which became Tenix Defence) would build the modified MEKO 200 design. The Australians ordered eight ships, while New Zealand ordered two, with an unexercised option for two more.\nThe Anzacs are based on Blohm + Voss' MEKO 200 PN (or Vasco da Gama class) frigates, modified to meet Australian and New Zealand specifications and maximise the use of locally built equipment. Each frigate has a  full load displacement. The ships are  long at the waterline, and  long overall, with a beam of , and a full load draught of . A Combined Diesel or Gas (CODOG) propulsion machinery layout is used, with a single,  General Electric LM2500-30 gas turbine and two  MTU 12V1163 TB83 diesel engines driving the ship's two controllable-pitch propellers. Maximum speed is , and maximum range is over  at ; about 50% greater than other MEKO 200 designs. The standard ship's company of an Anzac consists of 22 officers and 141 sailors.\nAs designed, the main armament for the frigate is a 5-inch 54 calibre Mark 45 gun, supplemented by an eight-cell Mark 41 vertical launch system (for RIM-7 Sea Sparrow or RIM-162 Evolved Sea Sparrow missiles), two  machine guns, and two Mark 32 triple torpedo tube sets (initially firing Mark 46 torpedoes, but later upgraded to use the MU90 Impact torpedo). They were also designed for but not with a Mark 15 Phalanx close-in weapons system (two Mini Typhoons fitted when required from 2005 onwards), two quad-canister Harpoon anti-ship missile launchers (which were installed across the RAN vessels from 2005 onwards), and a second 8-cell Mark 41 VLS (which has not been added). The Australian Anzacs used a single Sikorsky S-70B-2 Seahawk helicopter; plans to replace them with Kaman SH-2G Super Seasprites were cancelled in 2008 due to ongoing problems. Instead, the S-70B-2 was replaced with the Sikorsky MH-60R Seahawk by late 2017.\nWarramunga was laid down at Williamstown, Victoria on 26 July 1997. The ship was assembled from six hull modules and six superstructure modules; the superstructure modules were fabricated in Whangarei, New Zealand, and hull modules were built at both Williamstown and Newcastle, New South Wales, with final integration at Williamstown. She was launched on 23 May 1998, and commissioned into the RAN on 31 March 2001. On commissioning, the ship was assigned to Fleet Base West. Had the New Zealand government exercised their option for two more frigates, Warramunga was one of the ships that would have been designated for the RNZN.\nOperational history\nOn 31 July 2006, Warramunga departed Fleet Base West for her first deployment to the Persian Gulf as part of Operation Catalyst, taking over duties from . While on station in the Gulf, Warramunga conducted 150 boardings and security patrols, 320 flying hours were logged by her embarked Seahawk helicopter, and 450 investigative queries of merchant vessels were made. Warramunga returned to Fremantle on 2 February 2007 after 186 days at sea.\nOn 29 May 2009, it was announced that Warramunga would be re-tasked with protecting civilian vessels from piracy in Somali waters. The ship was assigned to Combined Task Force 151, which was tasked with preventing pirate attacks on commercial vessels in the shipping lanes off the Horn of Africa and Somalia.\nDuring July and August 2010, Warramunga was one of three RAN ships to participate in the RIMPAC 2010 multinational exercise. During RIMPAC, the frigate participated in the sinking of the decommissioned amphibious assault ship , firing several rounds from her main gun.\nWarramunga was the fourth ship of the class to undergo the Anti-Ship Missile Defence (ASMD) upgrade. The upgrade occurred across 2014 and early 2015, the upgrade included the fitting of CEA Technologies' CEAFAR and CEAMOUNT phased array radars, on new masts, a Vampir NG Infrared Search and Track system, and Sharpeye Navigational Radar Systems, along with improvements to the operations room equipment and layout. As well as the ASMD upgrade, Warramunga was the first ship of the RAN to be painted with the polysiloxane-based Haze Grey paint, which has greater durability and infrared-reflection capabilities than the Storm Grey polyurethane paint used for the previous 60 years. A new ship's company (that of sister ship , which was docked for upgrading) was assigned on 31 March 2015, and the ship was relaunched on 8 April. On reentering service, the ship's homeport was changed to Fleet Base East, where she arrived on 2 September.\nIn November 2017, Warramunga deployed to the Middle East as part of a combined Australian and Canadian task force. The ship carried out patrol activities in the Arabian Sea until late May 2018, intercepting and boarding 13 vessels suspected of drug trafficking. A total of 28 tonnes of heroin and hashish were seized by Warramungas crew during these operations.\nWarramunga participated in RIMPAC 2022.\nOn 7 April 2024, Warramunga conducted a joint patrol in the South China Sea with BRP Antonio Luna and BRP Valentin Diaz of the Philippine Navy, USS Mobile of the US Navy, and JS Akebono of the Japan Maritime Self-Defense Force. This marked the first multinational patrol between the nations.\nCitations\nReferences\n;Books\n*\n*\n*\n*\n*\n;Journal articles\n*\n*\n*\n*\n*\n*\n*\n;News articles\n*\n*\n*\n*\n*\n*\n;Press releases\n*\nExternal links\n* [http://www.navy.gov.au/hmas-warramunga-ii Royal Australian Navy webpage for HMAS Warramunga (II))]"
    }
  ]
}