{
  "content": [
    {
      "type": "text",
      "text": "# HMCS Crusader\n\n{|\n|Ship name=Crusader\n|Ship namesake=\n|Ship ordered=12 September 1942\n|Ship awarded=\n|Ship builder=John Brown & Company\n|Ship original cost=\n|Ship yard number=\n|Ship way number=\n|Ship laid down=15 November 1943\n|Ship launched=4 October 1944\n|Ship sponsor=\n|Ship christened=\n|Ship completed=\n|Ship acquired=\n|Ship commissioned=\n|Ship recommissioned=\n|Ship decommissioned=\n|Ship maiden voyage=\n|Ship in service=\n|Ship out of service=\n|Ship renamed=\n|Ship reclassified=\n|Ship refit=\n|Ship struck=\n|Ship reinstated=\n|Ship homeport=\n|Ship identification=Pennant number R20\n|Ship motto=\n|Ship nickname=\n|Ship honours=\n|Ship captured=\n|Ship fate=Transferred to Canada 1945, permanently in 1951\n|Ship notes=\n|Ship badge=\n}}\n|Ship name=Crusader\n|Ship namesake=\n|Ship acquired=26 November 1945\n|Ship commissioned=26 November 1945\n|Ship recommissioned=\n|Ship decommissioned=15 January 1960\n|Ship maiden voyage=\n|Ship in service=\n|Ship out of service=\n|Ship renamed=\n|Ship reclassified=\n|Ship refit=\n|Ship struck=\n|Ship reinstated=\n|Ship homeport=\n|Ship identification= R20/228\n|Ship motto=By this sign we conquer.\n|Ship nickname=\n|Ship honours=Korea, 1952–53\n|Ship captured=\n|Ship fate=Sold for scrap, 1964\n|Ship notes=\n|Ship badge=Azure, a crusader's shield bearing in the first canton a maple leaf gules for Canada\n}}\ndestroyer\n|Ship displacement=1730 tonnes\n|Ship length=\n|Ship beam=\n|Ship height=\n|Ship draught=\n|Ship power=\n|Ship propulsion=*2 Admiralty 3-drum boilers\n*2 Parsons single reduction geared turbines,\n*, 2 shafts\n|Ship speed=*\n* full load\n|Ship range=* at\n* at\n|Ship endurance=\n|Ship complement=14 officers, 230 crew\n|Ship crew=\n|Ship time to activate=\n|Ship sensors=\n|Ship armament=*4 × QF  L/45 Mk IV guns on mounts CP Mk.V\n*2 × Bofors 40&nbsp;mm L/60 guns on twin mount \"Hazemeyer\" Mk.IV;\n*2 × single 2-pdr Mk VIII\n*2 × 20 mm Oerlikon cannon\n*4 (1 × 4) tubes for  torpedoes Mk.IX\n|Ship armour=\n|Ship aircraft=\n|Ship aircraft facilities=\n|Ship notes=\n}}\n|}\n'HMCS Crusader' was a  destroyer originally ordered by the Royal Navy in 1942 and transferred to the Royal Canadian Navy in 1946. During the Korean War she was the leading ship in the legendary Trainbuster's Club, destroying five North Korean trains in total. She was sold for scrap in 1964.\nDesign\nThe C-class destroyer was designed in four groups, Crusader being part of the fourth, or \"Cr\", group. This group was ordered as the 14th Emergency Flotilla, a group of destroyers based on the machinery of the J-class destroyers.\nArmament and construction\nFor fire control, the class used the Fuze Keeping Clock High Angle Fire Control Computer. The \"Cr\" group was fitted with the new Mk VI HA/LA Director while remote power control (RPC) gunlaying equipment was fitted. The additional weight of the new fire control equipment and the powered mountings for the 4.5 inch guns meant that only one quadruple torpedo mount was fitted, and the depth charge armament was reduced to 35 depth charges.  Most of the ships were fitted with a single Hazemayer Bofors mount, although some of the later ships instead had the lighter and simpler Mk V twin Bofors mount. They also introduced the all-welded hull into Royal Navy destroyer construction, with the \"Cr\" flotilla all being of all-welded construction. Late delivery of the Mk VI directors delayed completion such that none of the \"Cr\"s entered service before the end of the Second World War.\nPropulsion\nThe class were all fitted with two Admiralty 3-drum boilers with a pressure of  at . All had Parsons single-reduction geared turbines, generating  at 350 RPM, and driving the two shafts to produce a maximum of  ( under full load condition).\nTheir bunkers could hold 615 tons of oil fuel, giving them a radius of  at  and  at .\nService history\nCrusader was ordered on 12 September 1942 as part of the 14th Emergency Flotilla of the War Emergency Programme. The hull was laid down on 15 November 1943 by John Brown & Company at Clydebank and launched on 5 October 1944.\nAfter a year's negotiation, the Admiralty agreed to lend the Royal Canadian Navy a flotilla of C-class destroyers in January 1945. These were intended for use against the Japanese in the Pacific Ocean. However, the war in the Pacific ended before any of the ships were completed and in the end, only two were lent to Canada. As they were only loaned, the two ships kept their names, unlike the last  to have been transferred to the Royal Canadian Navy.\nThe vessel was commissioned into the Royal Canadian Navy on 15 November 1945 at Clydebank with the pennant number R20. Crusader was completed on 26 November 1945 and transited to the west coast of Canada via the Azores and the Caribbean Sea. The destroyer was placed in reserve shortly after arrival and remained as such until reactivation for the Korean War. The destroyer was reactivated on 2 April 1951, initially as a training ship for cadets.\nCrusader performed two tours of service in the Korean War, one prior to and one after the Armistice. The first tour took place from June 1952, lasting until June 1953. The second tour lasted from November 1953 until August 1954.\nFollowing the ship's return from the Korean peninsula, Crusader took up a training role. On 14 February 1955, the destroyer departed Esquimalt for Halifax, Nova Scotia for use as a test and evaluation ship. The ship was used as a test platform for the newly developed variable depth sonar in 1958. The destroyer remained in this role until being paid off 15 January 1960 at Halifax. She was sold for scrap in 1964.\nSee also\n* List of ships of the Canadian Navy\nReferences\nNotes\nCitations\nReferences\n* Arbuckle, J. Graeme. Badges of the Canadian Navy. Halifax, NS: Nimbus Publishing, 1987. .\n* Raymond V. Blackman (editor), ''Jane's Fighting Ships 1953–1954, Sampson Low & Marston: London, 1954.\n*\n*\n* Hodges, Peter and Friedman, Norman, Destroyer Weapons of World War 2, Naval Institute Press: Annapolis Maryland, USA, 1979. .\n* Lenton, H.T., Navies of the Second World War: British Fleet & Escort Destroyers Volume Two, Macdonald: London, 1970.\n*\n*\n* Whitley, M.J., Destroyers of World War Two: An International Encyclopedia'', Cassell and Co.: London, 2000. .\nExternal links\n*[http://www.readyayeready.com/ships/shipview.php?id=1112 Ship statistics]\n*[http://www.readyayeready.com/badges/pages/crusader.htm Ship's badge]"
    }
  ]
}