{
  "content": [
    {
      "type": "text",
      "text": "# HMS Hereward (H93)\n\n{|\n|Ship name=Hereward\n|Ship ordered=\n|Ship awarded=\n|Ship builder=Vickers-Armstrongs, High Walker\n|Ship original cost=\n|Ship way number=\n|Ship laid down=28 February 1935\n|Ship launched=10 March 1936\n|Ship sponsor=\n|Ship christened=\n|Ship completed=9 December 1936\n|Ship commissioned=\n|Ship identification=Pennant number: H93\n|Ship motto= 'Vigila et ora' ('Watch and pray')\n|Ship nickname=\n|Ship honours=\n|Ship fate=Sunk by aircraft, 29 May 1941\n|Ship notes=\n|Ship badge=\n}}\n(standard)\n* (deep load)\n|Ship length=\n|Ship beam=\n|Ship draught=\n|Ship power=*3 Admiralty 3-drum boilers\n*\n|Ship propulsion=2 shafts, 2 geared steam turbines\n|Ship speed=\n|Ship range= at\n|Ship complement=137 (peacetime), 146 (wartime)\n|Ship sensors=ASDIC\n|Ship armament=*4 × single 4.7 in (120&nbsp;mm) guns\n*2 × quadruple .50 cal (12.7&nbsp;mm) machine guns\n*2 × quadruple 21 in (533 mm) torpedo tubes\n*1 × depth charge rail, 2 throwers and 20 × depth charges\n|Ship notes=\n}}\n|}\n'HMS Hereward', named after Hereward the Wake, was a H-class destroyer built for the Royal Navy in the mid-1930s. She was assigned to the Mediterranean Fleet and spent four months in Spanish waters during the Spanish Civil War in mid-1937, enforcing the arms blockade imposed by Britain and France on both sides of the conflict. When Second World War began in September 1939, the ship was in the Mediterranean but was shortly transferred to the South Atlantic to hunt for German commerce raiders and blockade runners, capturing one of the latter in November.Hereward Hereward was transferred to the Home Fleet in May 1940 and rescued Queen Wilhelmina of the Netherlands after the Germans had invaded.\nThe ship was transferred back to the Mediterranean Fleet later that month and escorted convoys to Malta and the larger ships of the fleet. She sank an Italian submarine in December before sinking the Italian torpedo boat  the following month. Hereward took part in the Battle of Cape Matapan in March 1941 and assisted in evacuate Allied troops from Greece in April. In May, the ship sank several small ships of a German convoy attempting to reach land troops on Crete. Later that month, she was bombed and sunk by German dive bombers as she assisted in the evacuating Allied troops from Crete. Her survivors and a number of evacuees were rescued by Italian vessels and became prisoners of war.\nDescription\nHereward displaced  at standard standard load and  at deep load. The ship had an overall length of , a beam of , and a draught of . She was powered by Parsons geared steam turbines, driving two shafts, which developed a total of  and gave a maximum speed of . Steam for the turbines was provided by three Admiralty 3-drum water-tube boilers. Hereward carried a maximum of  of fuel oil giving her a range of  at . The ship's complement was 137 officers and men in peacetime, but increased to 146 in wartime.\nThe ship mounted four 45-calibre 4.7-inch (120&nbsp;mm) Mk IX guns guns in single mounts. For anti-aircraft (AA) defence, Hereward had two quadruple Mark I mounts for the 0.5&nbsp;inch Vickers Mk III machine gun. She was fitted with two above-water quadruple torpedo tube mounts for 21-inch torpedoes. One depth charge rail and two throwers were fitted; 20 depth charges were originally carried but this increased to 35 shortly after the war began. Beginning in mid-1940, the ship's anti-aircraft armament was increased, although when the modifications were made is not known. The rear set of torpedo tubes was replaced by a 12-pounder AA gun.\nService\nThe ship was laid down by the High Walker Yard of Vickers-Armstrongs at Newcastle-on-Tyne on 28 February 1935, launched on 10 March 1936, and completed on 9 December 1936. Excluding government-furnished equipment like armament, the ship cost £249,591. She tested the twin-gun mounting intended for use on the  destroyers in January–March 1937 at Gibraltar. It was removed at the end of the trials and her two forward guns were replaced immediately afterwards. The ship was then assigned to the 2nd Destroyer Flotilla of the Mediterranean Fleet and began patrolling Spanish waters in the Mediterranean, enforcing the Non-Intervention Agreement during the Spanish Civil War. Hereward was refitted in Malta from 30 September to 30 October 1937 and again a year later, this time in Portsmouth Dockyard in June–July 1939, and she returned to the Mediterranean afterwards.\nHereward was transferred to Freetown to hunt for German commerce raiders in the South Atlantic with Force K in October. The ship and her sister ship, , , and , rendezvoused with the battlecruiser , the aircraft carrier , and the light cruiser  on 17 December. They refueled in Rio de Janeiro, Brazil, before proceeding to the estuary of the River Plate in case the damaged German pocket battleship  attempted to escape from Montevideo, Uruguay, where she had taken refuge after losing the Battle of the River Plate. Hereward captured the German blockade runner Uhenfels on 5 November. The ship was based at Trinidad from 20 November to 23 January 1940 and blockaded the German merchant ship Arauca in Port Everglades, Florida, whilst based there. She escorted the battleship  to Halifax, but suffered weather damage en route that required three weeks for repairs. Hereward then escorted the light cruiser  to the UK as the latter carried the ashes of John Buchan, Governor General of Canada, home. She required further repairs at Portsmouth upon arrival and missed the Battles of Narvik in April.\nHereward escorted ships into Scheveningen, Netherlands on 11 May to evacuate British citizens after the Germans invaded the previous day. She evacuated Queen Wilhelmina and her family from the Netherlands on 13 May, and was transferred to the Mediterranean Fleet a few days later. The ship arrived at Alexandria on 24 May and began escorting convoys and larger ships of the fleet. Hereward took part in the Battle of Calabria in July 1940, where she was hit by splinters from a near-miss by the Italian battleship . The ship escorted a convoy during Operation Collar and then fired at retreating Italians in Cyrenaica after the Battle of Sidi Barrani. Together with her sister ship , she sank the  on 13 December. Hereward'' escorted the battleships of the Mediterranean Fleet as they bombarded Valona on 19 December and then sortied into the North Atlantic when Convoy WS-5A reported that it had been attacked by the  on 25 December. She escorted three of the convoy's ship to Gibraltar on 29 December.\n]]\nThe ship took part in Operation Excess in early January 1941 and sank the  on 10 January with a torpedo in the Strait of Sicily. Together with the destroyer  and the gunboat , Hereward landed commandos on the island of Kastelorizo as part of Operation Abstention, but they were overwhelmed by an Italian counter-attack. Only a few survivors were taken off two days later. The ship took part in the Battle of Cape Matapan in early March 1941 and the evacuation of Greece in April 1941. Hereward, her sister ship , the destroyer  and cruiser  rescued all the crew and all 2,600 troops from the Dutch troop ship  on 27 April. She sank a number of fishing boats transporting German troops to Crete on 21 May, and helped evacuate the Allied garrison of Heraklion on 29 May carrying 450 troops on board. Later that day she was attacked by German Junkers Ju 87 \"Stuka\" dive bombers and hit by one bomb just in front of her forward funnel. She turned towards the nearby coast of Crete but was sunk by further air attacks off Cape Sideros. The bomb that sank the ship was dropped by a Ju 87 belonging to III./Sturzkampfgeschwader 2 (StG 2–Dive Bomber Wing 2). Four officers and 72 crewmen were killed, but the 89 survivors, along with the majority of the evacuees, were rescued and taken prisoner by Italian MAS torpedo boats and the destroyer .\nNotes\nReferences\n*\n*\n*\n*\n*\n*"
    }
  ]
}