{
  "content": [
    {
      "type": "text",
      "text": "# HMS Dwarf (1810)\n\n{|\n|Ship name=HMS Dwarf\n|Ship ordered=2 October 1809\n|Ship builder=James Lawes (or Lowes), Sandgate\n|Ship laid down=November 1809\n|Ship launched=24 April 1810\n|Ship acquired=\n|Ship commissioned=\n|Ship decommissioned=\n|Ship in service=\n|Ship out of service=\n|Ship renamed=\n|Ship struck=\n|Ship reinstated=\n|Ship honours=\n|Ship captured=\n|Ship fate=Wrecked 3 March 1824\n|Ship notes=\n}}\n|Ship class=\n|Ship type=Cutter\n|Ship tons burthen=202}} (bm)\n|Ship length=*Overall:\n*Keel:\n|Ship beam=\n|Ship draught=\n|Ship hold depth=\n|Ship sail plan= Cutter\n|Ship propulsion=Sails\n|Ship complement=60\n|Ship armament=10 × 18-pounder carronades\n|Ship notes=\n}}\n|}\n'HMS Dwarf' was a Decoy-class cutter launched in 1810. She participated in the capture of a French privateer and in operations in the Gironde. After the end of the Napoleonic Wars she captured some smuggling vessels. She was wrecked in March 1824.\nWartime service\nLieutenant Samuel Gordon commissioned Dwarf in March 1810 for the Downs.\nOn 5 September Dwarf recaptured Jusle.\nOn 2 March 1811, the master of the ship Mercury wrote a letter to the newspaper The Pilot that on 28 February his ship had fought off three French privateers near Dungeness. Bell wrote a letter to the newspaper, reprinted in the Naval Chronicle, that the supposedly French privateers vessels involved were  and Dwarf, and that the master had continued firing even after the British vessels had identified themselves. The fire from Mercury had wounded the sergeant of marines on Phipps. The only shots the naval vessels had fired were two musket shots to get Mercury to stop, and the only reason that the naval vessels had not fired their guns was because of the chance that Mercury was a British ship. Bell admonished all merchant captains to be a little more circumspect in the future.\nOn 22 August 1811 Dwarf recaptured New Galen.\nWhen news of the outbreak of the War of 1812 reached Britain, the Royal Navy seized all American vessels then in British ports. Dwarf was among the Royal Navy vessels then lying at Spithead or Portsmouth and so entitled to share in the grant for the American ships Belleville, Janus, Aeos, Ganges and Leonidas seized there on 31 July 1812.}}\nOn 11 September 1812 Dwarf and  were in pursuit of a French privateer lugger when  joined them. When the lugger tried to cross Bermudas bow, Bermuda fired several broadsides. Eventually the privateer struck to the boats of Dwarf and Pioneer after having suffered three men killed and 16 wounded, most severely. She was Bon Génie, of Boulogne. She was armed with 16 guns, but only four were mounted. She also had a crew of 60 men. She was one day out of Boulogne and had not taken anything.}}  and  were in sight and so shared in the prize money.\nOn 4 November 1813 Dwarf captured the merchantman Charlotte and her cargo.}}\nOn 30 March 1814 Dwarf was in the British squadron that entered the Gironde. She later shared in the prize and head money for the squadron's activities on 2 and 6 April.d; a sixth-class share was worth 14s d.}}\nIn January 1819 the London Gazette reported that Parliament had voted a grant to all those who had served under the command of Admiral Viscount Keith in 1812, between 1812 and 1814, and in the Gironde. Dwarf was listed among the vessels that had served under Keith in 1813 and 1814. She had also served under Kieth in the Gironde.}}\nPost-war service\nOn 27 October 1816 Dwarf captured the smuggling vessel Venus. On 24 December Dwarf captured the smuggling vessel To Brothers.d. A first-class share of a portion of the prize money for Two Brothers was worth £118 18s d; a sixth-class share was worth £2 10s . A first-class share of the second payment for Two Brothers was worth £114 8s 4d; a sixth-class share was worth £2 8s 8d.}}\nOn 26 March 1817 and 2 and 4 April seized a total of 3120 gallons of spirits.\nBetween October 1818 and January 1819 Dwarf was at Plymouth undergoing repairs and fitting. In November 1818 Lieutenant Nicholas Chapman recommissioned Dwarf. Lieutenant George Read replaced Chapman in command of Dwarf in November 1821.\nIn January 1823 Lieutenant Nicholas Gould took command of Dwarf.\nFate\nOn 3 March 1824 Dwarf, Lieutenant Nicholas Gould, was in Kingstown Harbour, Dublin and secured to a mooring buoy. The weather looked threatening so Gould ordered precautions be taken. The gale built to the point that the cables to her anchors and the buoy parted. The wind drove her towards the shore until she collided with the Eastern Pier. The waves threw Dwarf repeatedly against the pier, battering her until she foundered. A marine died when he fell between Dwarf and the pier.\nNotes\nCitations\nReferences\n*\n*\n*"
    }
  ]
}