{
  "content": [
    {
      "type": "text",
      "text": "# HMS Lord Warden\n\n{|\n|Ship name=Lord Warden\n|Ship namesake=Lord Warden of the Cinque Ports\n|Ship ordered=25 May 1863\n|Ship builder=Chatham Dockyard\n|Ship laid down= 24 December 1863\n|Ship launched= 27 May 1865\n|Ship completed=30 August 1867\n|Ship commissioned= July 1867\n|Ship decommissioned= 1885\n|Ship in service=\n|Ship out of service=\n|Ship struck=\n|Ship reinstated=\n|Ship motto=\n|Ship nickname=\n|Ship honours=\n|Ship fate= Broken up, 1889\n|Ship notes=\n}}\narmoured frigate\n|Ship tons burthen=4,080 (bm)\n|Ship displacement=\n|Ship length= (p/p)\n|Ship beam=\n|Ship draught=\n|Ship power=*9 rectangular boilers\n*\n|Ship propulsion=1 shaft; 1 horizontal return connecting rod-steam engine\n|Ship speed=\n|Ship range=\n|Ship sail plan=Ship rig\n|Ship complement=605\n|Ship armament=*2 ×  rifled muzzle-loading (RML) guns\n*14 ×  RML guns\n*2 ×  RML guns\n|Ship armour=*Belt:\n*Battery:\n|Ship notes=\n}}\n|}\n'HMS Lord Warden' was the second and last ship of the wooden-hulled  of armoured frigates built for the Royal Navy (RN) during the 1860s. She and her sister ship, , were the heaviest wooden ships ever built and were also the fastest steaming wooden ships. They were also the slowest-sailing ironclads in the RN.\nAfter a brief deployment with the Channel Squadron upon commissioning in 1867, Lord Warden was transferred to the Mediterranean Squadron later that year. She became the squadron flagship in 1869 and retained that duty until 1875 when she returned home for a refit. Upon recommissioning the following year, the ship became the guardship of the First Reserve in the Firth of Forth. Lord Warden was mobilised in 1878 when war with Russia seemed imminent during the Russo-Turkish War. She was paid off in 1885 and broken up in 1889.\nDesign and description\nLord Warden was  long between perpendiculars and had a beam of . The ship had a draught of  forward and  aft. She displaced  and had a tonnage of 4,080 tons burthen.\nLord Warden had a low centre of gravity which meant that she rolled very badly; she was said to be second only to her sister as the worst roller in the Victorian fleet. This characteristic was so dramatic that when the rolling propensities of ships were compared, it was usual to say \"as bad a roller as the \", the Lord Clydes being beyond compare. In sea trials in 1867 with , Lord Warden was taking water through her gun ports, while Bellerophon could have fought her main armament in safety. She was, however, very handy and sailed well in all weathers under sail or steam. Her crew consisted of 605 officers and ratings.\nPropulsion\nThe ship had a single three-cylinder horizontal-return, connecting-rod steam engine, made by Maudslay, Sons and Field, that drove a single propeller using steam provided by nine rectangular boilers. The engine produced  during sea trials on 13 September 1867 which gave Lord Warden a speed of  under steam. The engine proved to be the most powerful and the most reliable ever placed in a wooden hull for the Royal Navy. She carried a maximum of  of coal.\nLord Warden was ship-rigged with three masts and had a sail area of . To reduce drag, the funnels were telescopic and could be lowered. Her best speed under sail alone was , nearly the slowest of any British ironclad.\nArmament\nThe ship was designed to carry an armament of 14 rifled muzzle-loading (RML) guns eight-inch and 2 RML seven-inch guns. Lord Warden was completed, however, with a pair of RML nine-inch guns, 14 RML  guns, and 2 RML  guns. The latter guns served as forward chase guns on the main deck where they were very wet and useless in a head sea. One of the  guns was the forward chase gun on the upper deck and the other became the stern chase gun on the main deck. A dozen of the  guns were mounted on the main deck on the broadside amidships and the remaining pair were positioned on the quarterdeck on the broadside.\nThe shell of the nine-inch gun weighed  while the gun itself weighed . It had a muzzle velocity of  and was rated with the ability to penetrate  of wrought-iron armour. The eight-inch gun weighed ; it fired a  shell at a muzzle velocity of  and was credited with the ability to penetrate  of armour. The seven-inch gun weighed  and fired a  shell that was able penetrate  of armour.\nArmour\nThe entire side of Lord Wardens hull, except for the side of the upper deck, was protected by wrought-iron armour that tapered from  at the ends to  amidships. It extended  below the waterline. The forward chase guns on the upper deck were protected by 4.5-inch armour plates on the sides of the hull and a 4.5-inch transverse bulkhead to their rear protected them from raking fire. The armour was backed by  of oak and the  iron skin of the ship.\nConstruction and service\nto Portsmouth]]\nLord Warden, named after the position of the Lord Warden of the Cinque Ports, was ordered on 25 May 1863 from Chatham Naval Dockyard. She was laid down on 24 December 1863, and launched on 27 May 1865. The ship was commissioned in July 1867 to run her sea trials and completed on 30 August, for the cost of £328,998, or £322,843, exclusive of armament.\nAfter a few months service with the Channel Squadron, Lord Warden was posted to the Mediterranean. On 30 January 1868, the wooden steam frigate  was caught by a squall whilst taking up her berth in Valletta Harbour, Malta. She collided with the , knocking off her bowsprit and then collided with Lord Warden, damaging some of the latter's boats and an accommodation ladder. Endymion was reported to be undamaged. On 3 May, she ran aground in the Mediterranean. Repairs cost £2,409. A lieutenant was severely reprimanded and lost a year's seniority. Lord Warden relieved  as the squadron flagship in 1869 and served in this position until 1875. In March 1872, Lord Clyde ran aground herself whilst attempting to rescue a British steamship that had gone aground off the island of Pantellaria. Attempts to lighten Lord Clyde enough to float her off were futile, but Lord Warden was able to pull the ship free and tow her to Malta for repair.\nin 1873]]\nIn 1875, she returned to the UK for a refit that lasted until the following year.\nUpon recommissioning, Lord Warden was assigned to the First Reserve, where she served as a guardship in the Firth of Forth. In this role, she went on annual summer cruises to various ports. During the Russo-Turkish War, she was mobilised and assigned to the Particular Service Squadron formed from all of the ships of the First Reserve, due to concerns that the victorious Russians might be about to attack Constantinople, forcing Great Britain to intervene, but nothing transpired and the ship returned to the Forth after making her summer cruise to Ireland and participating in a fleet review of the Particular Service Squadron by Queen Victoria on 13 August 1878. Lord Warden was equipped in 1884 with torpedo launchers and torpedo nets before the ship was paid off the following year with her crew being transferred en masse to . She was broken up in 1889.\nNotes\nFootnotes\nReferences\n*\n*\n*\n*\n*\n*"
    }
  ]
}