{
  "content": [
    {
      "type": "text",
      "text": "# HMS Warspite (1884)\n\n{|\n|Ship name=HMS Warspite\n|Ship ordered=\n|Ship awarded=\n|Ship builder=Chatham Dockyard\n|Ship laid down=25 October 1881\n|Ship launched=29 January 1884\n|Ship christened=\n|Ship acquired=\n|Ship commissioned=1886\n|Ship recommissioned=\n|Ship decommissioned=\n|Ship in service=\n|Ship out of service=\n|Ship renamed=\n|Ship reclassified=\n|Ship refit=\n|Ship captured=\n|Ship struck=\n|Ship reinstated=\n|Ship fate=Sold for breaking up 4 April 1905\n|Ship homeport=\n|Ship motto=\n|Ship nickname=\n|Ship honours=\n}}\narmoured cruiser\n|Ship displacement=\n|Ship length= pp\n|Ship beam=\n|Ship draught=\n|Ship propulsion= 2 Shaft Penn engine\n|Ship speed=\n|Ship range=\n|Ship endurance=\n|Ship boats=\n|Ship capacity=\n|Ship complement=555\n|Ship sensors=\n|Ship EW=\n|Ship armament=*4 × BL  Mk III guns\n*6 × BL  guns\n*6 ×  torpedo tubes\n|Ship armour=Belt:\n|Ship notes=\n}}\n|}\n'HMS Warspite' was an  first-class armoured cruiser, launched on 29 January 1884 and commissioned in 1886.\nConstruction\nMorris states that Warspite had her sailing rig removed while building. The illustration of her with masts therefore shows her on trials, or is conjectural.\nService history\nWarspite was the flagship on the Pacific Station between 1890 and 1893, then a port guard ship at Queenstown until 1896. From 1896 until 1902 she again served as the flagship of the Pacific Station. Captain Thomas Philip Walker was appointed in command in March 1899, when Rear-Admiral Henry Palliser was Commander-in-Chief of the station. In June 1899 she became the flagship of Rear-Admiral Lewis Beaumont, who kept Captain Walker as flag captain. The ship visited Coquimbo in March 1900. From late 1900 she was the flagship of Rear-Admiral Andrew Bickford, with Captain Colin Richard Keppel as flag captain in command of the ship.  In late March 1902, Rear-Admiral Bickford transferred his flag to the newly arrived , and was joined by Captain Keppel. Warspite returned home under the command of Captain John Locke Marx (who had arrived on Grafton), stopping at Bahia and São Vicente, Cape Verde on the way. She arrived at Plymouth on 28 May 1902, and paid off at Chatham on 1 July, when she was placed in the D Division of the Dockyard reserve and prepared for emergency service.\nShe was sold on 4 April 1904 to Thos. W. Ward of Preston.  She arrived on the River Mersey on 3 October 1905 and then travelled on to Preston for breaking up.\nNotes\nReferences\n*\n*\n*\n*\n*\nExternal links\n* [https://www.battleships-cruisers.co.uk/hms_warspite.htm Battleship Cruisers - HMS Warspite and HMS Imperieuse]"
    }
  ]
}