{
  "content": [
    {
      "type": "text",
      "text": "# HMS President (1918)\n\n}}\n{|\n| Ship name = HMS Saxifrage\n| Ship namesake =\n| Ship ordered =\n| Ship builder = Lobnitz & Company, Renfrew, Scotland\n| Ship yard number = 827\n| Ship original cost =\n| Ship laid down =\n| Ship launched = 29 January 1918\n| Ship completed =\n| Ship commissioned =\n| Ship decommissioned =\n| Ship renamed = *HMS President, July 1922;\n*HMS President (1918), 1988\n| Ship out of service =\n| Ship struck =\n| Ship reinstated =\n| Ship homeport =\n| Ship motto =\n| Ship nickname = \"Mystery Ship\"\n| Ship honours =\n| Ship fate = Sold, 1988; resold 2001 & 2006, sold in 2018\nAbandoned 2022\n| Ship status = Abandoned\n| Ship notes =\n}}\nsloop\n| Ship tonnage =\n| Ship displacement =\n| Ship length = * p/p\n* o/a\n| Ship beam =\n| Ship height =\n| Ship draught =\n| Ship depth =\n| Ship hold depth =\n| Ship decks =\n| Ship deck clearance =\n| Ship power =\n| Ship propulsion = *4-cylinder triple expansion steam engine\n*2 boilers\n*\n*1 Propeller\n| Ship speed =\n| Ship range = 260 tons coal\n| Ship endurance =\n| Ship complement = 93\n| Ship armament = *2 × QF 4 inch Mk IV guns or BL 4 inch Mk IX guns\n*1 or 2 × 12-pounder guns\n*Depth charge throwers\n| Ship armour =\n| Ship notes =\n}}\n|}\n'HMS President (formerly HMS Saxifrage) is a retired Flower-class Q-ship that was launched in 1918. She was renamed HMS President in 1922 and moored permanently on the Thames as a Royal Navy Reserve drill ship. In 1988 she was sold to private owners and, having changed hands twice, served as a venue for conferences and functions as well as the offices for a number of media companies. She has since been moved to Chatham on the Medway in Kent since 2016, where she was abandoned in 2022. She had the suffix \"(1918)'\" added to her name in order to distinguish her from HMS President, the Royal Naval Reserve base in St Katharine Docks. She is one of the last three surviving Royal Navy warships of the First World War. She is also the sole representative of the first type of purpose built anti-submarine vessels, and is the ancestor of World War II convoy escort sloops, which evolved into modern anti-submarine frigates.\nDesign and construction\nHMS President was built as an Anchusa-type .  These were built between 1916 and 1918 as submarine hunters disguised to look like merchant ships, while carrying concealed 4-inch and 12-pounder naval guns. U-boats would dive at the sight of a naval warship, and the success of the Q-ships, or 'mystery ships' – converted merchantmen with hidden guns – led to the building of these specialised naval vessels for the same purpose. It was intended that a U-boat captain, unwilling to expend a precious torpedo on a small coastal merchantman, would surface to sink it by gunfire.  As the submarine closed for the kill, the Q-ship would reveal her hidden guns and counterattack while the U-boat was at its most vulnerable on the surface. By the time the \"warship-Qs\" were constructed, the Germans were well aware of this tactic, and with the introduction of unrestricted submarine warfare these sloops became active rather than passive submarine chasers.\nIn the case of the warship-Qs the individual builders were asked to use their existing designs for merchantmen, based on the standard Flower type warship hull. This included a dummy merchant ship sternpost rudder, mounted above the waterline over a much more manoeuvrable balanced rudder which allowed the ship to make a fast turn to bring her guns or depth charges to bear on a U-boat, or even to ram it before it could escape.\nThe class were also given a wide variety of spectacular dazzle camouflage schemes to confuse the primitive range finders of World War I submarines. Altogether, 120 Flowers were built, of which eighteen were sunk in action during the war.\nSaxifrage was built at the shipyard of Lobnitz & Company, Renfrew, Scotland, as yard number 827 and launched on 29 January 1918. She was named Saxifrage after the flower also known as London Pride.\nNaval service\nActive service\nHMS Saxifrage escorted convoys in UK waters during 1918, and engaged nine U-boats, as recorded in her logbooks held in the National Archives at Kew. In 1922 she was permanently moored on the Thames, and renamed President.  Other members of the class served as patrol vessels throughout the world during the peacetime years between the wars, but almost all were disposed of by the Second World War.  This allowed the majority of the class names to be revived for the new, smaller s, including both Saxifrage and Chrysanthemum.\nReserve service\nFrom 1922 she was employed as a Royal Naval Reserve drill ship, and as such was moored permanently on the Thames at Blackfriars. Her new name was inherited from the Old President of 1829, which had been based in West India Docks from 1862 to 1903 as the first London naval reserve drill ship.   The 1918 President remained in Royal Navy service for a total of seventy years, from 1918 to 1988.  She was the last Royal Navy warship to wear Victorian battleship livery of black hull, white superstructure and buff yellow funnel and masts. All naval personnel working at the Admiralty and elsewhere in London were nominally appointed to service in President, and they were paid and administered by her staff. MI6/SIS officers who had RN commissions were appointed to President, but paid and administered by the SIS.\nDuring the Second World War President was converted to a gunnery training ship, fitted with a large overall \"shed\" superstructure. Her major role was the training of DEMS gunners for defensively equipped merchant ships.  Her sister Flower class Q-ship, , was moored ahead of her in 1938 to provide additional office and training space.\nAfter the war both ships were reconstructed by the Royal Navy with large deckhouses fore and aft, giving an improved drill area and extra offices; they were also provided with tall wheelhouses and dummy funnels. These were dismountable, so they could pass under the London bridges to be periodically maintained in one of the Thames dockyards.  In this form, they continued in use as Royal Naval Reserve training ships until 1988, each matching Old Presidents total of more than seventy years in naval service. Since 1988 the name HMS President has been used for a shore establishment of the Royal Naval Reserve in St Katharine Docks near Tower Bridge.\nCivilian use\nand the City of London in the background]]\nCharitable venue\nIn 1988 the ship was saved by the charity, Inter-Action Social Enterprise Trust, run by ED Berman.  President social enterprises included: a base for start-up companies for young people; audio-visual studios; a publishing company; an NGO Advisory Service, and an 'event deck' to earn funding for the charity.   This period saved her from scrap, and preserved her for future generations. She had become a London landmark, marked on street maps, so was permitted to retain her warship title and name \"HMS President\" with the added suffix \"(1918)\" to distinguish her from the new shore establishment of the same name.\nCorporate venue\nin 2014 to commemorate the use of dazzle camouflage in World War I.]]\nPresident was resold in 2001 to David Harper and Cary Thornton, then purchased in April 2006 by the serviced office company, MLS Group Plc, to serve as a venue for conferences and functions and to house the offices of a number of media companies. Its owners planned to present her as an historical resource during the 2014-18 First World War centenary, as the U-Boat campaign of World War I was the greatest peril that Britain faced in 1917–18, and was the most critical naval conflict of that war.\nAs part of the Imperial War Museum's 14-18 Now project, HMS President  was selected to be one of four \"dazzle ships\"; to commemorate the work of the artists who created the naval dazzle camouflage of World War I she was given a new livery, entitled Dazzle Ship London, by artist Tobias Rehberger, While the artworks were inspired by the First World War dazzle camouflage patterns, the brief was widely interpreted in each case, and they bore little resemblance to the original dazzle designs.\nThe ship was also used as the recording venue for Nightingale, the second album by experimental folk band Erland and the Carnival.\nPreservation\nPresident had been permanently berthed in the River Thames on the Victoria Embankment in the City of London close to Blackfriars Millennium Pier since 1922. During 2016, however, she was moved to Chatham to make way for the construction of the new Thames Tideway Tunnel (one of the access tunnels will enter from Temple Avenue, next to where the ship had been moored). Ownership was transferred to a charitable trust which launched a crowdfunding appeal to seek to raise funds for restoration; however grant applications submitted to the Heritage Lottery Fund, the LIBOR fund and the National Heritage Memorial Fund were all unsuccessful.\nSee also\n* List of corvette and sloop classes of the Royal Navy\nNotes\nReferences\nPublications\n*\nExternal links\n* [https://www.nationalhistoricships.org.uk/register/494/hms-president HMS President at the National Historic Ships register]\n* [http://www.hmspresident.com/dazzle-ship-london/ 2014 Dazzle painting]"
    }
  ]
}