{
  "content": [
    {
      "type": "text",
      "text": "# HMS Empire Dace\n\n{|\nNewcastle upon Tyne, UK (1942-43)\n* Royal Navy (1943-44)\n| Ship route               =\n| Ship ordered             =\n| Ship builder             = Swan, Hunter & Wigham Richardson Ltd\n| Ship original cost       =\n| Ship yard number         = 1754\n| Ship way number          =\n| Ship laid down           =\n| Ship launched            = 11 August 1942\n| Ship completed           = September 1942\n| Ship commissioned        =\n| Ship decommissioned      =\n| Ship christened          =\n| Ship acquired            =\n| Ship maiden voyage       =\n| Ship in service          =\n| Ship out of service      =\n| Ship identification      =*United Kingdom Official Number 165842\n*Code Letters MBDW\n*\n| Ship fate                = Struck mine and sunk 1 December 1944\n| Ship notes               =\n}}\n*\n| Ship displacement        =\n| Ship length              =\n| Ship beam                =\n| Ship height              =\n| Ship draught             =\n| Ship depth               =\n| Ship decks               =\n| Ship deck clearance      =\n| Ship ramps               =\n| Ship ice class           =\n| Ship range               =\n| Ship power               =\n| Ship propulsion          = Triple expansion steam engine\n| Ship speed               =\n| Ship capacity            =\n| Ship crew                =\n| Ship notes               =\n| Ship complement          =\n| Ship armament            =\n}}\n|}\n'HMS Empire Dace' was a  coastal ferry that was built in 1942 as a merchant ship by Swan, Hunter & Wigham Richardson Ltd Newcastle upon Tyne, United Kingdom for the  Ministry of War Transport (MoWT). In 1943, she was requisitioned by the Royal Navy. She served until December 1944, when she struck a mine and sank in Greek waters.\nDescription\nThe ship was built in 1941 by Swan, Hunter & Wigham Richardson Ltd Newcastle upon Tyne. She was yard number 1754.\nThe ship was  long, with a beam of . She had a depth of  and a draught of . She was assessed at , .-->\nThe ship was propelled by a 132 nhp triple expansion steam engine, which had cylinders of ,  and  diameter by  stroke. The engine was built by Swan, Hunter & Wigham Richardson Ltd, Newcastle upon Tyne. It drove a screw propeller and could propel the ship at .-->\nHistory\nEmpire Dace was launched on 11 August 1942, and completed in September of that year. She was built for the MoWT to the same design of a number of vessels built for the Government of Turkey. The ship had ramps at each end and was equipped with a 25-ton derrick in front of the superstructure, which was located amidships. Her design made her suitable for conversion to a minelayer. The United Kingdom Official Number 165842 and Code Letters MBDW were allocated. Her port of registry was Newcastle upon Tyne. She was placed under the management of Townsend Bros. Ferries Ltd.\nEmpire Dace departed from Methil, Fife on 14 October 1942 as a member of Convoy EN 150, which arrived at Oban, Argyllshire on 18 October. She then sailed to Milford Haven, Pembrokeshire to join Convoy KX 6, which arrived at Gibraltar on 17 November. Her destination was Freetown, Sierra Leone.\nEmpire Dace was a member of Convoy MKS 11, which departed from Bône, Algeria on 10 April 1943 and arrived at Liverpool, Lancashire on 23 April. She left the convoy at Oran. In July, Empire Dace was requisitioned by the Royal Navy. She was a member of Convoy KMS 24, which departed from  Gibraltar on 30 August and arrived at Port Said, Egypt on 10 September. She joined the convoy at Algiers, Algeria on 1 September and left it at Bougie, Algeria on 2 September.\nEmpire Dace was a member of Convoy HA 37A, which departed from Taranto, Italy on 21 April 1944 and arrived at Augusta, Sicily on 23 April. She was also a member of Convoy GUS 43, which departed from Port Said on 13 June and arrived at the Hampton Roads, United States on 10 July. She joined the convoy at Bizerta, Algeria on 20 June and left it at Bône the next day. Empire Dace was a member of Convoy TC 23, which departed from Tunis, Tunisia on 15 July and arrived at Cagliari, Italy the next day. She spent the next few months sailing the Mediterranean, visiting Ancona, Bari and Brindisi, Italy.\nOn 1 December 1944, Empire Dace struck a mine off Missolonghi, Greece and sank with the loss of 45 lives. She was carrying 22 crew, 12 DEMS gunners and 100 passengers. Those lost on Empire Dace are commemorated at the Tower Hill Memorial, London.\nReferences"
    }
  ]
}