{
  "content": [
    {
      "type": "text",
      "text": "# HMS Emperor of India__disambig_1\n\n{|\n|Ship name=Emperor of India\n|Ship namesake=Title of Emperor of India\n|Ship ordered=1911\n|Ship builder=Vickers, Barrow-in-Furness\n|Ship laid down=31 May 1912\n|Ship launched= 27 November 1913\n|Ship commissioned=10 November 1914\n|Ship decommissioned=1931\n|Ship fate= Sunk as target ship 1931, raised & scrapped 1932\n}}\n|Ship displacement=\n*Normal:\n*Full load:\n|Ship length= o/a\n|Ship beam=\n|Ship draught=\n|Ship power=\n*18 × Babcock & Wilcox boilers\n*\n|Ship propulsion=\n*4 × Parsons turbines\n*4 × propellers\n|Ship speed=\n|Ship range= at\n|Ship complement=995&ndash;1,022\n|Ship armament=* 10 × BL /45 cal Mk V guns\n* 12 × /45 cal Mk VII guns\n* 2 × QF  20 cwt AA guns\n* 4 × 3-pounder () guns\n* 4 × 21 inch (533 mm) submerged beam torpedo tubes\n|Ship armour=*Belt:\n*Deck:\n*Barbettes:\n*Turrets:\n|Ship notes=\n}}\n|}\n'HMS Emperor of India was an  of the British Royal Navy. She was originally to have been named Delhi' but was renamed before she was completed, to honour King George V, who was also Emperor of India at the time. The ship was laid down on 31 May 1912 at the Vickers shipyard, and was launched on 27 November 1913. The finished ship was commissioned a year later in November 1914, shortly after the start of the First World War. She was armed with a main battery of ten  guns and was capable of a top speed of .\nUpon commissioning, Emperor of India joined the 4th Battle Squadron of the Grand Fleet, based at Scapa Flow. She took part in numerous sorties into the northern North Sea to enforce the blockade of Germany, along with frequent training exercises and gunnery drills. Emperor of India was in dock for a refit in late May 1916, so she was unavailable for the Battle of Jutland. The increased danger from submarines led both the Grand Fleet and the German High Seas Fleet to pursue more cautious strategies after Jutland, which led to a less eventful war.\nAfter the war, Emperor of India was sent to the Mediterranean Fleet, where she became involved in the Allied intervention in the Russian Civil War in the Black Sea from 1919&ndash;1921. She remained in the Mediterranean until 1926, when she was transferred to the Atlantic Fleet. The London Naval Treaty of 1930 mandated that Emperor of India and her three sister ships be dismantled. In 1931, she and  underwent a series of weapons tests that proved to be highly beneficial for future British battleship designs. Emperor of India was ultimately sold for scrap in February 1932, and was broken up shortly thereafter.\nDesign\nThe four Iron Duke-class battleships were ordered in the 1911 building programme, and were an incremental improvement over the preceding . The primary change between the two designs was the substitution of a heavier secondary battery in the newer vessels. Emperor of India was  long overall and had a beam of  and an average draught of . She displaced  as designed and up to  at full load. Her propulsion system consisted of four Parsons steam turbines, with steam provided by eighteen Babcock & Wilcox boilers. The engines were rated at  and produced a top speed of . Her cruising radius was  at a more economical . Emperor of India had a crew of 995&nbsp;officers and ratings, though during wartime this grew to up to 1,022.\nEmperor of India was armed with a main battery of ten BL  Mk V naval guns mounted in five twin gun turrets. They were arranged in two superfiring pairs, one forward and one aft; the fifth turret was located amidships, between the funnels and the rear superstructure. Close-range defence against torpedo boats was provided by a secondary battery of twelve BL 6-inch Mk VII guns. The ship was also fitted with a pair of QF 3-inch 20 cwt anti-aircraft guns and four  3-pounder guns. As was typical for capital ships of the period, she was equipped with four  torpedo tubes submerged on the broadside.\nEmperor of India was protected by a main armoured belt that was  thick over the ship's ammunition magazines and engine and boiler rooms, and reduced to  toward the bow and stern. Her deck was  thick in the central portion of the ship, and reduced to  elsewhere. The main battery turret faces were  thick, and the turrets were supported by  thick barbettes.\nService history\nEmperor of India was laid down at the Vickers shipyard on 31 May 1912, originally to have been named Delhi. She was launched on 27 November 1913 and christened Emperor of India. The ship was commissioned into the Royal Navy's Grand Fleet under Admiral John Jellicoe in November 1914 for sea trials, three months after the outbreak of the First World War. The following month she was assigned to the 4th Battle Squadron as the second division flagship, where she served for the first two years of the war. On 1 December, Emperor of India and her sister ship  arrived at the 4th Squadron to begin working up, before being pronounced fit for service with the fleet on 10 December. During this period, the rearmost 6-inch guns were removed from the four Iron Duke-class ships and their casemates were sealed off, as they were too low in the hull and permitted water to continually enter the ship.\nFirst World War\nOn 23&ndash;24 December, the 4th and 2nd Squadrons conducted gunnery practice north of the Hebrides. The following day, the entire fleet sortied for a sweep in the North Sea, which concluded on 27 December; this was Emperor of Indias first fleet operation. Another round of gunnery drills followed from 10&ndash;13 January 1915 west of the Orkney and Shetland Islands, this time with the entire fleet. On the evening of 23 January, the bulk of the Grand Fleet sailed in support of Beatty's Battlecruiser Fleet, but the main fleet did not become engaged in the Battle of Dogger Bank that took place the following day. From 7&ndash;10 March, the Grand Fleet conducted a sweep in the northern North Sea, during which it conducted training manoeuvres. Another such cruise took place from 16&ndash;19 March. On 11 April, the Grand Fleet conducted a patrol in the central North Sea and returned to port on 14 April; another patrol in the area took place from 17&ndash;19 April, followed by gunnery drills off Shetland on 20&ndash;21 April.\nThe Grand Fleet conducted a sweep into the central North Sea on 17&ndash;19 May without encountering any German vessels. In mid-June, the fleet conducted another round of gunnery training. On 2&ndash;5 September, the fleet went on another cruise in the northern end of the North Sea and conducted gunnery drills. Throughout the rest of the month, the Grand Fleet conducted numerous training exercises. On 13 October the majority of the fleet conducted another sweep into the North Sea, returning to port on the 15th. From 2&ndash;5 November, Emperor of India participated in another fleet training operation west of Orkney Another such cruise took place from 1&ndash;4 December.\nThe typical routine of gunnery drills and squadron exercises occurred in January. The fleet departed for a cruise in the North Sea on 26 February; Jellicoe had intended to use the Harwich Force to sweep the Heligoland Bight, but bad weather prevented operations in the southern North Sea. As a result, the operation was confined to the northern end of the sea. On the night of 25 March, Emperor of India and the rest of the fleet sailed from Scapa Flow to support the Battlecruiser Fleet and other light forces that raided the German zeppelin base at Tondern. By the time the Grand Fleet approached the area on 26 March, the British and German forces had already disengaged and a severe gale threatened the light craft. Iron Duke, the fleet flagship, guided the destroyers back to Scapa while Emperor of India and the rest of the fleet retired independently.\n]]\nOn 21 April, the Grand Fleet conducted a demonstration off Horns Reef to distract the Germans while the Russian Navy relaid its defensive minefields in the Baltic Sea. The fleet returned to Scapa Flow on 24 April and refuelled before proceeding south in response to intelligence reports that the Germans were about to launch a raid on Lowestoft. The Grand Fleet did not arrive in the area until after the German High Seas Fleet had withdrawn, however. On 2&ndash;4 May, the fleet conducted another demonstration off Horns Reef to keep German attention focused on the North Sea. Emperor of India was not available for the Battle of Jutland on 31 May&ndash;1 June, as she was in dock for a refit. Following Jutland, she was transferred to the 1st Battle Squadron, where she again served as the second division flagship. She remained in the 1st Squadron for the rest of the war.\nOn 18 August, the Germans again sortied, this time to bombard Sunderland; Vice Admiral Reinhard Scheer, the German fleet commander, hoped to draw out Beatty's battlecruisers and destroy them. British signals intelligence decrypted German wireless transmissions, allowing Jellicoe enough time to deploy the Grand Fleet in an attempt to engage in a decisive battle. Both sides withdrew, however, after their opponents' submarines inflicted losses in the action of 19 August 1916: the British cruisers  and  were both torpedoed and sunk by German U-boats, and the German battleship  was damaged by the British submarine . After returning to port, Jellicoe issued an order that prohibited risking the fleet in the southern half of the North Sea due to the overwhelming risk from mines and U-boats. Later that year, Emperor of India was equipped with equipment to handle a kite balloon. Following the investigation into the Battle of Jutland, the Royal Navy determined that deck protection was insufficient in all of its capital ships; as a result, Emperor of India had an additional  of armour over the magazines between October and December 1916.\nA series of minor modifications followed throughout 1917 and 1918; these included the installation of larger and additional searchlights to improve night combat capabilities, funnel caps to reduce smoke interference with the spotting tops, and rangefinder baffles that were intended to make it more difficult to estimate the range for enemy gunners. The baffles were later removed in 1918. In late 1917, the Germans began using destroyers and light cruisers to raid the British convoys to Norway; this forced the British to deploy capital ships to protect the convoys. In April 1918, the German fleet sortied in an attempt to catch one of the isolated British squadrons, though the convoy had already passed safely. The Grand Fleet sortied too late to catch the retreating Germans, though the battlecruiser  was torpedoed and badly damaged by the submarine .\nFollowing the capitulation of Germany in November 1918, the Allies interned most of the High Seas Fleet at Scapa Flow. The fleet rendezvoused with the British light cruiser , which led the ships to the Allied fleet that was to escort the Germans to Scapa Flow. The massive fleet consisted of some 370 British, American, and French warships. The fleet remained in captivity during the negotiations that ultimately produced the Treaty of Versailles. Reuter believed that the British intended to seize the German ships on 21 June 1919, which was the deadline for Germany to have signed the peace treaty. That morning, the Grand Fleet left Scapa Flow to conduct training maneuvers, and while they were away Reuter issued the order to scuttle the High Seas Fleet.\nPost-war career\nIn 1919, Emperor of India was assigned to the Mediterranean Fleet, as part of the 4th Battle Squadron, along with her three sisters and two King George V class battleships. During this period, she served in the Black Sea during the Allied intervention in the Russian Civil War to support the Whites against the Red Bolsheviks. Admiral Edward Hobart Seymour, the commander of British forces in the Black Sea, hoisted his flag aboard the ship on 14 April. The ship bombarded Bolshevik troops on 5 May 1919 outside Theodosia, and later to disrupt the operations of a railway being used to supply the Bolshevik assault on the port. On 26 March 1920, Emperor of India provided gunfire support to the evacuating White Russian forces outside Novorossiysk, along with the French armoured cruiser . Shortly thereafter, Emperor of India came under fire from an armoured train, prompting the ship to leave the harbour, bound for Theodosia. The ship was also involved in observing the Greco-Turkish War of 1919&ndash;22; this included stops in the ports of Mitylene and Smyrna.\nShe returned to Britain for a refit in 1922, during which new long-base rangefinders were installed on \"X\" turret. This was followed by another stint in the Mediterranean Fleet that lasted until 1926. During this period, she took part in a demonstration in Smyrna against Turkish demands that foreign warships leave the port. She was thereafter transferred to the Atlantic Fleet, where she served until 1930. In May 1926, stability tests were conducted with the ship; these provided the basis for a 1927 proposal from the Director of Naval Construction to add anti-torpedo bulges to the four Iron Duke-class ships. The proposal was sent to the Board for review, but concerns over the further value of the ships, which were due to be replaced in 1931&ndash;32 under the terms of the Washington Naval Treaty, and the cost of the reconstruction led the Board to cancel it. From July&ndash;September 1927, she had a refit in Devonport. She served as the squadron flagship from June 1929&ndash;January 1931, when she was relieved by Marlborough.\nAccording to the terms of the London Naval Treaty of 1930, the four ships of the Iron Duke class were to be scrapped or demilitarised; Emperor of India was scheduled to be removed from service in 1931 and broken up for scrap. The ship provided one final service to the Navy by serving as a gunnery target, along with Marlborough. The tests included firing destroyer armament at the upper works at close range to test their effectiveness in a simulated night engagement, direct hits from 13.5-inch shells, aerial attacks, and experiments with flash tightness in the magazines. The main tests for Emperor of India took place in June off Bognor Regis. She departed Portsmouth on 6 June and ran aground on the Owers Bank. Salvage efforts proved fruitless, and so the Navy decided to conduct the gunnery tests there. The tests were conducted on 10&ndash;11 June, with her sister Iron Duke, which hit Emperor of India with twelve 13.5-inch shells over the two days. The first round of shells were fired from , while on the second day the range was increased to . She was refloated later and sold for scrap to the Alloa Shipbreaking Co. on 6 February 1932. She arrived in Rosyth for demolition on 16 February.\nThe tests provided invaluable experience that was incorporated into the  and es and . Of particular importance was a shell that struck Emperor of India on the bottom edge of the main belt, which penetrated into one of the boiler rooms, where it caused tremendous damage. This showed that the depth of British belt armour was too shallow, which influenced the design of the King George V class. In addition, the tests with Emperor of India and Marlborough highlighted the weaknesses of the deck armour of British battleship designs, particularly over the ammunition magazines, and the other First World War-vintage battleships that continued in service had additional armour installed in subsequent modernisations in the 1930s.\nFootnotes\nNotes\nCitations\nReferences\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\nExternal links\n*[http://www.maritimequest.com/warship_directory/great_britain/battleships/emperor_of_india/hms_emperor_of_india.htm Maritimequest HMS Emperor of India photo gallery]"
    }
  ]
}