{
  "content": [
    {
      "type": "text",
      "text": "# HMS King Edward VII\n\n{|\n|Ship name=HMS King Edward VII\n|Ship namesake=King Edward VII\n|Ship builder=Devonport Dockyard\n|Ship laid down=8 March 1902\n|Ship launched=23 July 1903\n|Ship completed=February 1905\n|Ship commissioned=7 February 1905\n|Ship fate=Mined off Cape Wrath, 6 January 1916\n}}\npre-dreadnought battleship\n| Ship displacement =\n*Normal:\n*Full load:\n|Ship length= (loa)\n|Ship beam=\n|Ship draught=\n|Ship power=\n*16 × water-tube boilers\n*\n|Ship propulsion=\n*2 × triple-expansion steam engines\n*2 × screw propellers\n|Ship speed=\n|Ship complement=777\n|Ship armament=\n*4 × BL  Mk IX guns\n*4 × BL  Mk X guns\n*10 × BL  Mk VII guns\n*14 × 12-pounder  guns\n*14 × 3-pounder  guns\n*4 ×  torpedo tubes (submerged)\n|Ship armour=\n*Belt:\n*Bulkheads:\n*Barbettes: 12&nbsp;in\n*Turrets:\n**Main battery: 8–12&nbsp;in\n**9.2-inch battery:\n*Casemates:\n*Conning tower: 12&nbsp;in\n*Decks:\n|Ship notes=\n}}\n|}\n'HMS King Edward VII', named after King Edward VII, was the lead ship of her class of pre-dreadnought battleships built for the British Royal Navy. Armed with a battery of four  and four  guns, she and her sister ships marked a significant advance in offensive power compared to earlier British battleship designs that did not carry the 9.2&nbsp;in guns. King Edward VII was built at the Devonport Dockyard, and was laid down in March 1902, launched in July 1903, and completed in February 1905.\nThe ship entered service with the Atlantic Fleet as the fleet flagship before being transferred to the Channel Fleet in 1907, where she also served as the flagship. The Channel Fleet became the Home Fleet in 1909, where she remained for the next several years. During this period, the fleet was repeatedly reorganized, with King Edward VII ultimately ending up in the 3rd Battle Squadron by 1912, along with her sisters. The ships were sent to the Mediterranean during the First Balkan War to enforce the transfer of Scutari to Albania. Following the outbreak of the First World War in August 1914, the 3rd Battle Squadron became part of the Grand Fleet, where King Edward VII served for the next two years. The Grand Fleet conducted numerous sweeps into the North Sea in the hope of catching German vessels at sea, but rarely found action.\nOn the morning of 6 January 1916, while steaming to Belfast for a refit, King Edward VII struck a naval mine that had been laid by the German auxiliary cruiser . Attempts to tow King Edward VII to port failed when she took on a dangerous list, so she was abandoned and her crew evacuated to several destroyers. King Edward VII sank later that day.\nDesign\nFollowing the development of pre-dreadnought type battleships carrying heavy secondary guns of  diameter in the Italian Regia Marina and the United States Navy, the Royal Navy decided to build similar ships. Initial proposals called for a battleship equipped with eight  guns to support the main battery, though under the direction of William Henry White, the Director of Naval Construction, these were replaced with four  guns. The new ships, though based on the general  type that had formed the basis of the preceding four battleship designs, marked the first significant change in the series. Like all late pre-dreadnoughts that entered service in the mid-1900s, King Edward VII was made almost instantaneously obsolescent by the commissioning of the all-big-gun  in December 1906, armed with a battery of ten heavy guns compared to the typical four of most pre-dreadnoughts.\nKing Edward VII was  long overall, with a beam of  and a draft of . The King Edward VII-class battleships displaced  normally and up to  fully loaded. Her crew numbered 777&nbsp;officers and ratings. The King Edward VII-class ships were powered by a pair of 4-cylinder triple-expansion engines that drove two screws, with steam provided by sixteen water-tube boilers. The boilers were trunked into two funnels located amidships. The King Edward VII-class ships had a top speed of  from .\nKing Edward VII had a main battery of four  40-calibre guns mounted in twin-gun turrets fore and aft. These were supported by a heavy secondary battery of four  guns in four single turrets, two on each broadside. The ships also mounted ten  45-calibre guns mounted in casemates, in addition to fourteen 12-pounder  guns and fourteen 3-pounder  guns for defence against torpedo boats. As was customary for battleships of the period, she was also equipped with five  torpedo tubes submerged in the hull; two were on each broadside, with the fifth in the stern.\nKing Edward VII had an armoured belt that was  thick; the transverse bulkheads on the aft end of the belt was  thick. The sides of her main battery turrets were also 8 to 12&nbsp;in thick, atop 12&nbsp;in barbettes, and the 9.2&nbsp;turrets had  sides. The casemate battery was protected with  of armour plate. Her conning tower had 12-inch-thick sides. She was fitted with two armoured decks,  thick, respectively.\nService history\nPre-First World War\n]]\nWhen King Edward VII was laid down at Devonport Dockyard on 8 March 1902, the first plate was laid by King Edward VII, who with his wife Queen Alexandra had just attended the naming and launching ceremony of . King Edward VII was launched by her namesake on 23 July 1903 and was completed in February 1905. Edward VII consented to having King Edward VII carry his name on the condition that she always serve as a flagship. The Royal Navy honoured this wish throughout her career. King Edward VII was commissioned on 7 February at Devonport Dockyard for service as Flagship, Commander-in-Chief, Atlantic Fleet. She underwent a refit in 1906–1907, during which her superstructure 12-pounder guns were temporarily relocated to the top of her main battery turrets. Her Atlantic Fleet service ended when she paid off at Portsmouth Dockyard on 4 March 1907.\nOn 5 March, King Edward VII was recommissioned as flagship of Admiral Lord Charles Beresford, Commander-in-Chief, Channel Fleet. She underwent another refit at Portsmouth in 1907–1908. During this refit, her 12-pounders returned to their original locations, and the 3-pounders on her bridge were removed. Under a fleet reorganisation on 24 March 1909, the Channel Fleet became the 2nd Division, Home Fleet. Accordingly, King Edward VII was recommissioned as the Flagship, Vice Admiral, Home Fleet on 27 March. She underwent a refit at Portsmouth from December to February 1910. She was recommissioned at Portsmouth on 1 August 1911 as the Flagship, Vice Admiral, Third and Fourth Divisions, Home Fleet.\nUnder a fleet reorganisation in May 1912, King Edward VII and all seven of her sisters – , , , , , , and  – were assigned to form the 3rd Battle Squadron, assigned to the First Fleet, Home Fleet. King Edward VII was commissioned at Sheerness as the Flagship, Vice Admiral, 3rd Battle Squadron, First Fleet, Home Fleet, on 14 May 1912. The 3rd Battle Squadron was detached to the Mediterranean in November 1912 because of the First Balkan War (October 1912 – May 1913); it arrived at Malta on 27 November 1912 and subsequently participated, as part of an international force, in a blockade of Montenegro and in an occupation of Scutari to force the Macedonians to relinquish the city to the newly-formed Albania. The squadron returned to the United Kingdom in 1913 and rejoined the Home Fleet on 27 June 1913.\nFirst World War\nUpon the outbreak of the First World War, the 3rd Battle Squadron was assigned to the Grand Fleet and based at Rosyth, with King Edward VII continuing her service as squadron flagship, at the time under the command of Vice Admiral Edward Bradford. The squadron was reinforced with the five s, and was used to supplement the Grand Fleet's cruisers on the Northern Patrol. On 6 August, the day after Britain declared war on Germany, elements of the Grand Fleet sortied to inspect the coast of Norway in search of a German naval base violating Norwegian neutrality. King Edward VII and the rest of the 3rd Battle Squadron provided distant support to the operation. No such base was found, and the ships returned to port the next day. On 14 August, the ships of the Grand Fleet went to sea for battle practice before conducting a sweep into the North Sea later that day and into 15 August.\nIn late August, King Edward VII reported that two of her four 12-inch guns had developed cracks in the inner tubes, necessitating replacement. She accordingly left Scapa Flow for Devonport to have the guns replaced, Bradford shifting his flag to her sister ship Dominion temporarily. King Edward VII returned to the fleet on 2 September, at which point Dominion was sent to have her guns replaced. On 2 November, the squadron was detached to reinforce the Channel Fleet and was rebased at Portland. The squadron returned to the Grand Fleet on 13 November, although King Edward VII remained behind temporarily, not returning to the Grand Fleet until 30 November. During sweeps by the fleet, she and her sisters often steamed at the heads of divisions of the far more valuable dreadnoughts, where they could protect the dreadnoughts by watching for mines or by being the first to strike them.\nOn 14 December, the 1st Battlecruiser Squadron, 2nd Battle Squadron, and accompanying cruisers and destroyers left port to intercept the German forces preparing to raid Scarborough, Hartlepool and Whitby. On the first reports of contact with German units on the morning of 16 December, the Grand Fleet commander, Admiral John Jellicoe, ordered Bradford to take the 3rd Battle Squadron to support the ships in contact at 10:00. Four hours later, they met the 1st and 4th Battle Squadrons, en route from Scapa Flow, though they failed to reach the German High Seas Fleet before the latter withdrew. The Grand Fleet remained at sea until late on 17 December, at which point the 3rd Battle Squadron was ordered back to Rosyth. King Edward VII and the rest of the squadron joined the Grand Fleet for another sweep into the North Sea on 25 December. The fleet returned to its ports two days later, having failed to locate any German vessels.\nThe 3rd Battle Squadron went to sea on 12 January 1915 for gunnery training, steaming north and passing to the west of Orkney on the night of 13–14 January. After completing training on the 14th, they returned to Rosyth on 15 January. On 23 January, the 1st and 2nd Battlecruiser Squadrons sortied to ambush the German I Scouting Group in what resulted in the Battle of Dogger Bank the following day. Later on the 23rd, the rest of the Grand Fleet, including King Edward VII, sortied to support the battlecruisers. The 3rd Squadron ships left first and steamed at full speed to reach ships of the Harwich Force, which had reported contact with German vessels. The battlecruisers intervened first, and King Edward VII and her sisters arrived around 14:00, by which time the battlecruisers had sunk the armoured cruiser  and the surviving German ships had fled. The 3rd Battle Squadron patrolled the area with the rest of the Grand Fleet over the night before being detached at 08:00 on 25 January to steam to Rosyth.\nElements of the Grand Fleet went to sea repeatedly over the next few months. The 3rd Battle Squadron patrolled the central North Sea in company with the 3rd Cruiser Squadron from 10&ndash;13 March. The two units again went to sea to sweep the central North Sea from 5&ndash;8 April. A major fleet operation followed on 11 April, with the entire Grand Fleet sortieing for a sweep of the North Sea on 12&ndash;13 April. The squadrons returned to their ports on 14 April to replenish their fuel. Another such operation followed on 17 April, which also failed to find any German ships. The 3rd Battle Squadron returned to Rosyth late on 18 April. The fleet sortied again on 21 April, returning to port two days later. The 3rd Battle Squadron, joined by the 3rd Cruiser Squadron, patrolled the northern North Sea from 5&ndash;10 May, during which a German U-boat attacked the battleships but failed to score a hit.\nAnother sweep into the North Sea took place from 17&ndash;19 May, and no German forces were encountered. The fleet went to sea again on 29 May for a patrol south to the Dogger Bank before returning to port on 31 May, again without having located any German vessels. The Grand Fleet spent much of June in port conducting training, but the most modern units went to sea on 11 June for gunnery practice to the northwest of Shetland. While they were training, King Edward VII and the rest of the 3rd Battle Squadron, along with the 3rd Cruiser Squadron, patrolled the central North Sea. Fleet activities were limited in July, owing to a threatened strike by coal miners, which began on 18 July and threatened the supply of coal for the fleet's ships. The strike continued into August, which led Jellicoe to continue to limit fleet activities to preserve his stocks of coal. The fleet saw little activity in September, and during this period, the Grand Fleet began to go to sea without the 3rd Battle Squadron.\nLoss\nOn 6 January 1916, King Edward VII—having transferred her flag temporarily—departed Scapa Flow at 07:12 on a voyage around the northern coast of Scotland to Belfast, where she was scheduled to undergo a refit. At 10:47, she struck a mine that had been laid by the German auxiliary cruiser  off Cape Wrath five days before. Möwe had slipped past British patrols and laid 252&nbsp;mines under cover of darkness and a snow storm. The explosion occurred under the starboard engine room, and King Edward VII took on a list of 8° to starboard. Her commanding officer, Captain (later Admiral) Crawford Maclachlan, ordered her helm put over to starboard to close the coast and beach the ship if necessary, but the helm jammed hard to starboard and the engine rooms quickly flooded, stopping the engines. Counterflooding reduced her list to 5°. Signals to the passing collier Princess Melita induced her to close with King Edward VII and attempt to tow the battleship. Initially believing the attack to have been from a German U-boat, the flotilla leader  and twelve destroyers sortied to come to King Edward VIIs aid. After arriving on the scene, Kempenfelt joined the tow attempt. Towing began at 14:15, but King Edward VII settled deeper in the water and took on a 15° list in a rising sea and strong winds and soon proved to be unmanageable. Princess Melitas towline parted at 14:40, after which Captain Maclachlan ordered Kempenfelt to slip her tow as well.\nWith flooding continuing and darkness approaching, Captain Maclachlan ordered King Edward VII abandoned. The destroyer  came alongside at 14:45, and she and destroyers  and , took off the crew with the loss of only one life (a man fell between the battleship and one of the rescue vessels), the last man off being Captain Maclachlan, who boarded destroyer  at 16:10. Fortune, Marne, and Musketeer departed to take the battleship's crew to port, while Nessus stayed on the scene until 17:20 with tugs that had arrived to assist. After Nessus departed, the tugs continued to stand by, and saw King Edward VII capsize at 20:10 and sink around nine hours after the explosion. The cause of her loss was initially unknown, as the British were at that time unaware of Möwes minefield, and the battleship Africa had passed through the area earlier that day without incident. A shortage of minesweepers also delayed discovery of the minefield.\nNotes\nReferences\n*\n}}\n*\n}}\n*\n}}\n*\n}}\n*\n|oclc=162593478\n}}\n*\n| url-access = registration\n| url = https://archive.org/details/conwaysallworlds0000unse_l2e2\n| name-list-style=amp\n}}\n*\n|name-list-style=amp\n| url=https://archive.org/details/conwaysallworlds0000unse_z3o0\n}}\nFurther reading\n*\n*\n*\n*\n}}\n*\n*\nExternal links\n*\n*"
    }
  ]
}