{
  "content": [
    {
      "type": "text",
      "text": "# Hogwarts School of Prayer and Miracles\n\n| media_type        = Fan fiction\n| language          = English\n| image             = File:Hogwarts_School_of_Prayer_and_Miracles.jpg\n}}\nHogwarts School of Prayer and Miracles is a Harry Potter-based fan fiction, serially published on FanFiction.Net by Grace Ann Parsons under the username proudhousewife. The fan fiction rewrites the Harry Potter series as an Evangelical version and replaces magic with prayer and religious phenomena. The fanfiction went viral because of its extreme religious overtones and unpolished writing style, and subsequently became the target of online criticism and analysis.\nSynopsis\nHogwarts School of Prayer and Miracles recasts Harry Potter as an American orphan raised by his atheistic, career-driven Aunt Petunia and meek Uncle Vernon Dursley. Harry is converted to Christianity when Hagrid, an Evangelical missionary, knocks on the Dursleys' door and proselytizes. He attends Hogwarts School of Prayer and Miracles, where he learns how to use prayer as incantations from Headmaster Albus Dumbledore and meets Dumbledore's wife Minerva and daughter Hermione. The story is interspersed with moral lessons and the author's interpretation of certain Biblical verses. The students at Hogwarts are divided into four \"hats\" (Gryffindor, Slytherin, Hufflepuff and Ravenclaw) based loosely on real-world Christian denominations (Evangelical Christianity, Catholicism, \"lukewarm\" Christianity and an \"extremist\" Christianity). As the plot advances, Harry and his friends uncover the evil plans of atheist Tom Riddle (best known by his Reddit username \"u/voldemort\"), a figure who appears to be lobbying to make Christianity illegal.\nReception and analysis\nThe fanfiction went viral in 2014, and garnered an almost universally negative reaction from critics for its plot, writing and message. Many commentators considered the work and its supposed author to be part of an elaborate satire, with Relevant saying it \"smacks of an Internet hoax from a prankster curious to see if anyone will swallow his or her story.\" David Mikkelsen of Snopes concluded that \"while there is indeed a Christian Harry Potter fanfiction story circulating the Internet, the writer’s intent was satirical and was not part of a plan to create a published set of Harry Potter books suitable for Christian readers and stripped of troublesome references to witchcraft and wizardry.\"\nLaura Turner, writing for Religion News Service, considered it to be a work of satire written by an author who wanted to lampoon Evangelicalism. Turner pointed out that the author had no other online presence, and that the name \"Grace Parsons\" seemed like a thinly veiled gag. Commenting on the use of negative stereotypes about Evangelical Christians, Turner concluded that the work was probably a hoax.\nChris Ostendorf of The Daily Dot was critical of the writing, grammar and plot of the work, saying that the author \"makes E. L. James look like Shakespeare.\" David L. Garcia of SF Weekly sharply criticized it for having a poor grasp on the original source material, saying \"Regardless of your beliefs, if you've read the books you're probably going to laugh at how much Grace Ann gets wrong.\"\nMadeleine Davies of Jezebel criticized the author's \"Christian-friendly\" plot, including revision of female characters, its rejection of the theory of evolution, and its unflattering portrayal of Christian denominations such as Catholicism and Episcopalianism. Rachel Rosenbaum, writing for The State Hornet, said that it \"takes once intellectual and brave female characters and demotes them to nothing more than Betty Crocker because our nurturing and loving traits, she states, 'serve… best in the home'.\"\nCarolyn Cox of The Mary Sue took the fanfiction more seriously, calling it a \"Chick tract\" full of \"idolatrous Weasleys, a Southern Dumbledore, and thinly-veiled comparisons between Voldemort and Obama.\"\nIn 2025, Shelby Holihan and Madeleine Malcolm adapted the fanfiction for the stage in a one-night black box performance at Crash Acting Studio.\nSee also\n* My Immortal, another Harry Potter fanfiction which was similarly condemned\n* Harry Potter and the Methods of Rationality, a Harry Potter fanfiction which received critical praise\n* Poe's law, an online adage referring to the difficulty in distinguishing satire from genuinely extreme viewpoints\nReferences"
    }
  ]
}