{
  "content": [
    {
      "type": "text",
      "text": "# Hollywell, Queensland\n\n| pop                 = 2930\n| pop_year            =\n| pop_footnotes       =\n| established         =\n| postcode            = 4216\n| elevation           = 4\n| area                = 2.9\n| timezone            = AEST\n| utc                 = +10:00\n| dist1               = 9.0\n| dir1                = N\n| location1           = Southport\n| dist2               = 12.5\n| dir2                = N\n| location2           = Surfers Paradise\n| dist3               = 67.7\n| dir3                = SE\n| location3           = Brisbane CBD\n| dist4               = 51.8\n| dir4                = NNW\n| location4           = Tweed Heads\n| lga                 = City of Gold Coast\n| stategov            = Broadwater\n| fedgov              = Fadden\n| near-n              = Paradise Point\n| near-ne             = Paradise Point\n| near-e              = South Stradbroke\n| near-se             = South Stradbroke\n| near-s              = Runaway Bay\n| near-sw             = Coombabah\n| near-w              = Coombabah\n| near-nw             = Paradise Point\n}}\nHollywell is a coastal suburb in the City of Gold Coast, Queensland, Australia. In the , Hollywell had a population of 2,930 people.\nGeography\nIn the east, the suburb's boundaries extend into the Gold Coast Broadwater. Of the actual land surface, the land use is residential with the exception of the south-western quarter of the suburb which is part of the Pine Ridge Conservation Park () which extends south into Runaway Bay.\nThe Runaway Bay Marina is located in the south-east corner of the locality ().\nHistory\nA 1926 map shows the area named as Pine Ridge. That name is no longer official but persists in Park Ridge Road and in the Park Ridge Conservation Park. Park Ridge Road as shown on a 1978 map extended north of the present road roughly along the current Oxley Drive through Holleywell and the current Paradise Road at Paradise Point ().\nThe suburb takes its name from the residence of Joseph Wood Proud who was Mayor of Southport from 1934 to 1948. Proud named it after his home in England.\nDemographics\nIn the , Hollywell had a population of 2,679 people, 49.9% female and 50.1% male. The median age of the Hollywell population was 47 years, 10 years above the national median of 37.  70.7% of people living in Hollywell were born in Australia. The other top responses for country of birth were New Zealand 9.4%, England 5.7%, South Africa 0.8%, Scotland 0.7%, Germany 0.7%.  91.8% of people spoke only English at home; the next most common languages were 0.7% Japanese, 0.6% German, 0.4% French, 0.4% Italian, 0.3% Russian.\nIn the , Hollywell had a population of 2,865 people.\nIn the , Hollywell had a population of 2,930 people.\nEducation\nThere are no schools in Hollywell. The nearest government schools are Coombabah State School (primary) and Coombabah State High School (secondary), both in neighbouring Coombabah.\nAmenities\nHollywell Fire Station is at 318 Bayview Street ().\nThere are two boat ramps on Centenary Drive into the Gold Coast Broadwater. One is at the junction with Jasmine Avenue () and the other at the junction with Holly Avenue (). They are managed by the Gold Coast City Council.\nReferences\nExternal links\n*"
    }
  ]
}