{
  "content": [
    {
      "type": "text",
      "text": "# Holliswood, Queens\n\n| subdivision_type         = Country\n| subdivision_name         = United States\n| subdivision_type1        = State\n| subdivision_name1        = New York\n| subdivision_type2        = City\n| subdivision_name2        = New York City\n| subdivision_type3        = County/Borough\n| subdivision_name3        = Queens\n| subdivision_type4        = Community District\n| subdivision_name4        = Queens 8\n| established_title        =\n| established_date         =\n| established_title1       =\n| established_date1        =\n| founder                  =\n| named_for                =\n| population_footnotes     =  tags -->\n| population_total         =\n| population_as_of         =\n| population_est           =\n| pop_est_as_of            =\n| population_demonym       =\n| population_note          =\n| timezone                 = EST\n| utc_offset               = −5\n| timezone_DST             = EDT\n| utc_offset_DST           = −4\n| postal_code_type         = ZIP Codes\n| postal_code              = 11423, 11427\n| area_code_type           = Area codes\n| area_code                = 718, 347, 929, and 917\n}}\nHolliswood (formerly known as Terrace Heights) is an affluent residential neighborhood located on the Harbor Hill Moraine in the east-central portion of the borough of Queens, New York City. It is bounded to the north by the Grand Central Parkway, to the west by 188th Street to the south by Hillside Avenue and to the east by Francis Lewis Boulevard.\nHolliswood is bordered by Jamaica Estates to the west, Cunningham Park to the north, Hollis to the south and Queens Village to the east. Holliswood is part of Queens Community Board 8 and its zip code is 11423 & 11427. The neighborhood is patrolled by the New York City's Police Department's 107th Precinct. Politically, Holliswood is represented by the New York City Council's 23rd district.\nHistory\nPrecolonial and colonial history\nThe area now known as Holliswood was originally settled by the Jameco (or Yamecah) Lenape of the Algonquin Nation. In 1656, Dutch colonists operating out of New Netherland purchased the area known as Jamaica from the Jameco Indians. The Dutch colonial administration urged colonists from nearby Hempstead to settle this newly acquired area known as Jamaica. Eventually the area that would become Holliswood was dubbed East Jamaica, a sparsely populated, mostly agricultural region now situated between Jamaica proper and Queens Village. Until the onset of the American Revolution, this area saw very little growth.\n19th century development\nThe development of Holliswood is attributed to Frederick W. Dunton, who was the supervisor of the Town of Jamaica and the nephew of the president of the Long Island Railroad. In 1884, Dunton proceeded to purchase  of then farmland in East Jamaica. Dunton desired to name his would be development Woodhull after the Revolutionary War hero who had fought in the area in the Battle of Long Island. Unbeknownst to Dunton there already was a Woodhull in upstate New York, so he named the areas Hollis and Holliswood after his home town in New Hampshire.\nDunton opted to construct Holliswood with curving streets and gave them Latin or Spanish names, such as Palo Alto, Como, Marengo, etc. A trotting race course was also built within the confines of the neighborhood known as Epsom Course. The designs of the winding streets were developed by the Grenoble Realty Company, organized in 1905. For himself, Dunton reserved the largest lot of land at the southern edge of Holliswood on Dunton Avenue. There, he built a large stately mansion called Hollis Hall with views all the way to the Atlantic Ocean. Hollis Hall, was constructed on the bluffs where British General Howe encamped during the Revolutionary War and captured the American General Nathaniel Woodhull. A small portion in the southern part of Holliswood was developed after 1906 as part of Hollis Park Gardens. Sluggish sales for property in Holliswood ultimately led to its failure as a business venture in 1918. However, increased demand for housing revived the area in the following decade, and subsequently a large portion of the housing stock in the neighborhood date from the 1920s.\nLand use and zoning\nHolliswood is zoned for residential single family homes. In 2002, the Holliswood Civic Association successfully petitioned the City of New York to initiate zoning changes for the neighborhood from 40x100 (R-1) lot sizes to 60x100 (R-1-2) lot sizes. Holliswood was the first civic association in the five boroughs to initiate the zoning change and succeeded. As a result of Holliswood's generous lot sizes for its properties, and its secluded suburban location, many residences are mansion-like, perched atop modest sized hills. The average market price for properties has well surpassed $1 million, with some homes fetching multimillion-dollar prices according to Zillow.\nReligious institutions\n* Young Israel of Holliswood is located at 86-25 Francis Lewis Blvd.\n* The Bait uz Zafar Mosque is located at 188-15 Mc-Laughlin Avenue.\n* The Ramgarhia Sikh Society is located at 86-71 Palo Alto Street.\nParks and recreation\nPublic parks and playgrounds in Holliswood are overseen by the New York City Department of Parks and Recreation.\n* Cunningham Park, is a large  public park constructed in 1928. There are tennis courts, baseball fields, bocce ball courts, walking paths and bike trails located throughout the park\n*McLaughlin Playground is located at 200-04 McLaughlin Ave\n*The Hollis World War Memorial is located at 193rd Street and Hillside Avenue, the memorial commemorates local residents who were veterans of World War I\nPost office and ZIP Code\nHolliswood is covered by ZIP Codes 11423 and 11427. The United States Post Office operates the Holliswood Station at 197-33 Hillside Avenue.\nSchools\nP.S./I.S. 178 The Holliswood School, pre-K through eighth grade.\nThe Yeshiva University High School for Girls (known as 'Central') is located at 86-86 Palo Alto Street.\nLibrary\nThe Queens Public Library branch is located at 202-05 Hillside Avenue.\nNotable people\nNotable current and former residents of Holliswood include:\n* Marilyn Aschner (born 1948), professional tennis player.\n* Andrew Cuomo (born 1957), politician who served as Governor of New York from 2011 to 2021.\n* Christopher Cuomo (born 1970), news anchor and journalist.\n* Mario Cuomo (1932-2015), politician who served as Governor of New York from 1983 to 1994.\n* Frederick W. Dunton (1851-1931), real estate developer and founder of Holliswood.\n* Menachem Penner (born 1971), Modern Orthodox rabbi and Max and Marion Grill Dean of the Rabbi Isaac Elchanan Theological Seminary.\n* Lennie Tristano (1919-1978), jazz pianist and composer.\n* David Weprin (born 1956), Democratic member of the New York State Assembly.\nReferences"
    }
  ]
}