{
  "content": [
    {
      "type": "text",
      "text": "# Hollow Earth Expedition\n\n|illustrator=\n|publisher=Exile Game Studio\n|date=2006\n|genre=Pulp fiction\n|system=Ubiquity\n|footnotes=\n}}\nHollow Earth Expedition is a pulp fiction role-playing game published by Exile Game Studio in 2006 that is set in the fictitious Hollow Earth. The game was nominated for several industry awards.\nDescription\nHollow Earth Expedition, inspired by the pulp fiction of Jules Verne, Arthur Conan Doyle, and Edgar Rice Burroughs is a role-playing game set in 1936 in which everything on the surface of Earth appears normal, but an entirely different world replete with dinosaurs, Amazons, 18th-century pirates, Atlantean artifacts, and deadly flora lies beneath the Earth's surface. There are many hidden entrances to the Hollow World, but far fewer exits. The player characters, who represent pulp fiction heroes, must fight malevolent forces, as they seek to enter and explore the wonders of the Hollow World and then successfully exit back to the surface world.\nTwo such antagonistic organizations are outlined: the Terra Arcana, an esoteric society dedicated to keeping the Hollow Earth a secret; and the Thule Society, based on an actual organization associated with the Nazi Party during World War II, who seek the powerful ancient weapons they believe are in the Hollow Earth.\nThe book provides rules for character generation, a gamemaster's guide to the Hollow Earth, some sample characters, notable non-player characters, and a bestiary.\nAn introductory adventure is included that pits the heroes against a Nazi group racing to enter the Hollow World and recover a lost treasure.\nSystem\nHollow Earth Expedition uses a system called Ubiquity that was created by Exile Game Studio. To determine success of an action, the player must roll a dice pool and score a number of even numbers that is greater than the rated difficulty of the task; odd numbers count as a null result.\nPublication history\nHollow World Expedition was designed by Bruce Baugh, Brannon Boren, Patrick E. Bradley, Eric Cagle, Jason Carl, Jeff Combos, Jim Cook, Tyler Running Deer, Chris Goe, Ed Matuskey, Melissa McNally, M. Sechin Tower, and Steve Winter, and was published as a 256-page hardcover book published by Exile Game Studio in 2009 with cover art by Stephen Daniele and interior art by Daniele, Mike May, Aaron Nanto, Mark Selander, and Jeff Slemons.\nExile subsequently published several supplements and sourcebooks to support the game.\nReception\nIn Issue 12 of Black Gate, E.E. Knight admitted that \"HEX had me when I leafed through and saw dinosaurs, lost cities, zeppelins, and Nazis.\" Knight commented, \"The game is equally suited to a long campaign, where even getting to the Hollow Earth involves several tense sessions, or one-to-three shot shorts. Suggestions [in the book] for setting up and running either style are helpful.\" Knight's only complaint was the lack of an Athlete archetype during character creation. Knight concluded, \"the fast-paced, pulpy fun of Hollow Earth Expedition is as good as it gets in single-volume roleplay.\"\nPyramid notes that although other pulp role-playing games try to encompass \"every Pulp aspect and archetype, bringing together costumed adventurers, men of science, private eyes, barnstorming aviators, and big game hunters in a mix never destined to gel, Hollow Earth Expedition takes only those suited to the one Pulp sub-genre: that of the lost world.\"\nAwards\nHollow Earth Expedition\n* 2007 ENnie Awards:\n** Silver Medal for Best Cover Art\n** Finalist for Best Writing\n** Finalist for Best Game\n** Finalist for Product of the Year\n* 2007 Origins Awards\n** Finalist for Roleplaying Game of the Year\nHollow Earth Expedition GM Screen\n*2008 ENnies: Finalist for Best Accessory\n* 2008 Origins Awards: Finalist for Game Support\nSecrets of the Surface World\n*2008 ENnies: Silver Award Winner for Best Supplement\nMysteries of The Hollow Earth\n*2010 ENnies: Gold Award Winner for Best Supplement\nPerils of the Surface World\n*2011 ENNies: Finalist for Best Adventure (for \"Miracle Stone of the Amazon\")\nHollow Earth publications\n* Hollow Earth Expedition (also available in Spanish, French and German)\n* Game Master Screen\n* Secrets of the Surface World Source Book outlines more organizations.\n* Mysteries of the Hollow Earth Source Book gives details of the denizens of Hollow Earth, including rules for beastmen of various sorts, and provides more concrete details such as a map and gazetteer for the gamemaster\n* Perils of the Surface World Source Book (perfect paperback compilation of four adventure modules: Miracle Stone of the Amazon, Frozen City of Terror, Legacy of the Terra Arcanum and Five Talons of the Jade Dragon)\n* Revelations of Mars Source Book expands the setting to include the dying and dangerous Red Planet.\n* Revelations of Mars GM Screen (also contain 16 page adventure, 'Planet of the Red Death')\n* Ubiquity Dice\n* Revelations of Mars Ubiquity Dice\n* Ubiquity Style Chips for each of the four sourcebooks\n* Quick Start Rules and adventures for Free RPG Day 2008-2016\nReferences\nExternal links\n*[http://www.exilegames.com Official site]  at Exile Game Studio"
    }
  ]
}