{
  "content": [
    {
      "type": "text",
      "text": "# Hollow Kingdom\n\nHollow Kingdom is a 2019 science fiction novel by Kira Jane Buxton, about a zombie apocalypse from the viewpoint of a pet crow. It was published by Grand Central Publishing.\nPlot summary\nIn Seattle, a pet crow named Shit Turd (S.T.) lives with his human, Big Jim, and a bloodhound named Dennis. Because S.T. was raised in captivity, he identifies as more of a human than a crow. One day, Big Jim’s eyeball falls out and he tries to eat S.T. Dennis and S.T. wander through Seattle, discovering that human society is falling apart. Members of the animal kingdom refer to human beings as Hollows due to their lack of connection to the environment. S.T. decides to save humanity’s pets. With humans gone, domesticated animals will be their remaining legacy.\nS.T. searches through the Seattle zoo. He fails to find any healthy humans and injures his wing in the process. S.T. realizes that Hollows will chase after electronics. He uses a cell phone to lure them into breaking a window, releasing a dog named Cinnamon from her dead owner’s house. They rescue several other pets before Cinnamon is killed by a rabid dog.\nS.T. allies with Kraai, the leader of a murder. S.T. embraces his crow identity. He teaches the other birds how to get inside buildings, and they establish a base at UW Bothell. Hollows begin growing features such as wings and feathers as their bodies continue to mutate. Dennis is killed by a group of Hollows. S.T. and his feathered allies defend the safe zone against threats including wild wolves and mutated Hollows.\nA group of birds bring S.T. on a secret mission. In a First Nations village in remote Canada, ST and his companions find an unaffected human infant and agree to protect her.\nReception\nHollow Kingdom was a finalist for the 2020 Thurber Prize. Good Housekeeping ranked it #53 on its list of the 60 best books of 2019.\nNational Public Radio called it \"joyfully original\", lauding S.T. as a \"brilliant narrator\" despite — or because of — his incomplete understanding of human culture, and praising his grief at the loss of Big Jim as \"incredibly sincere\". Publishers Weekly considered it \"hilarious\" and \"fresh [and] alarming\", an \"eloquent, emotional exploration of survival during an unthinkable cataclysm\", and a \"masterful blend of humorous and tragic\", and emphasized the many \"moving ruminations on the end of humanity.\" A review in Washington Independent Review of Books called the book \"joyously hopeful\" and praised the author's ability to allow the reader to relate to the crow narrator.\nLocus found it to be \"pleasing (...with) the same ups and downs, the same gains and losses, as any classic pet adventure\", and commended Buxton's \"lush\" descriptive prose, but faulted her \"optimism about the natural world\" as \"slightly naïve, and often preachy\", and noted that for some readers, S.T.'s narrative voice may \"grate so badly as to render [reading] the book impossible\". Kirkus Reviews wrote that Hollow Kingdom started with a “strong and saucy” voice, but that it became “muddled” and “heavy-handed”.\nReferences\nExternal links\n*"
    }
  ]
}