{
  "content": [
    {
      "type": "text",
      "text": "# Holy Spirit Cathedral, Warsaw\n\n| coordinates      =\n| location         = Warsaw,\n| denomination     = Old Catholic\n| previous denomination = Russian Orthodox Church (until 1915)Latin Church (1915–1945)\n| churchmanship    = Polish-Catholic Church in the Republic of Poland\n| founder          = Life Guards Lancers Regiment of His Imperial Majesty\n| dedication       = Holy Spirit\n| dedicated date   = April 25, 1945\n| status           = active Old Catholic Cathedral\n| architect        = Teodor Kozłowski or Leon Benois\n| years built      = 1867 or 1903–1867 or November 4, 1906\n| tower quantity   = 1\n| materials        = brick\n| parish           =\n}}\nThe Holy Spirit Cathedral is the main church of the Polish-Catholic Church in the Republic of Poland, located in Warsaw at 2 , at the intersection with .\nIt was originally built as a military Orthodox church in Warsaw and served this purpose until the majority of the Russian population left the city in 1915. During the interwar period of the 20th century, it functioned as the garrison church of the . Since 1945, it has been owned by the Polish-Catholic Church, serving as its cathedral. It also functions as the parish church of the .\nHistory\nUncertainties regarding construction\nThe current Polish-Catholic Cathedral was originally built as a military Orthodox church. The exact period of its construction and the dedication it bore have been subjects of debate in the literature. According to , the building is dated to 1867, designed by Teodor Kozłowski, and dedicated to Olga of Kiev. Paszkiewicz views the construction of the church as part of an eight-year initiative by the Tsarist authorities to build grand Orthodox churches in the territories under Russian control, aimed at solidifying Russian rule in the area. This view is shared by Henryk Sienkiewicz and Renata Popkowicz-Tajchert, who also state that the church served as a temple for a Russian cavalry regiment.\nOn the other hand, Kirill Sokol, in his work Russkaja Warszawa, claims that the modern-day Holy Spirit Cathedral belonged to the , was built much later, between 1903 and 1906, dedicated to St. Martinian, and was designed by Leon Benois. The construction was overseen by , with the dedication of the completed building taking place on 4 November 1906, according to Sokol. This opinion is supported by Ryszard Mączewski, who argues that documents from the Warsaw City Council's commission, which dealt with the future of former Russian religious buildings after Poland regained independence, as well as an analysis of earlier documents related to the Russian military complex near Łazienki, suggest a construction date in the early 20th century. He also emphasizes that the feast day of St. Martinian coincided with the regimental holiday of the Life Guards Lancers Regiment.\nSokol and Mączewski point out that a church dedicated to Olga of Kiev, St. Olga's Church, also existed within the barracks complex near Czerniakowska and  streets. This church was demolished after 1915.\nAs an Orthodox Church\nThe total cost of constructing the building amounted to 76,000 rubles, of which 70,000 came from a government grant, and the remainder from private donations. The church could accommodate 800 worshippers at a time. A monograph on Russian military churches published in Pyatigorsk in 1913 described the church as follows:It resembled the old wooden churches of Novgorod in its architecture and consisted of a high central section in the shape of a cross, with typical Novgorodian facades. The western part of the cross served as the main entrance at the lower level and as a choir at the upper level; the eastern part housed the altar, surrounded by a semicircular apse with five windows.The building ceased to function as a church after 1915 when the military unit responsible for it left Warsaw. From that point, it remained abandoned for four years. After Poland regained independence, many churches built by the Russians, seen as symbols of foreign domination, were destroyed. However, a commission led by Professor , tasked with determining the future of these churches, suggested an alternative use for this church:The matter of the church on Agrykola Street requires detailed consideration. Built in a Romanesque-Byzantine style, with a very beautiful arrangement of forms, carefully designed and finished, with some minor modifications, it could serve as a church.The commission's suggestion was implemented. Henryk Sienkiewicz noted that among all the religious buildings constructed by the Russian authorities and later transferred to other denominations, this church retained the most original features of Orthodox architecture. Additionally, a small green area with black locust trees and a plane tree, arranged by the builders of the church, also survived.\nAs a Catholic Church\nThe former military church was handed over to the Catholic Church and designated as the garrison church for the 1st Regiment of Lancers of Józef Piłsudski. Since 1945, the church has belonged to the Polish-Catholic Church, bearing the dedication of the Holy Spirit and serving as its cathedral. A connection to its pre-war use is maintained through annual services held in memory of the fallen lancers, conducted on the first Sunday after December 10.\nIn 1981, the church was registered as a historic monument.\nArchitecture\nExterior\nThe cathedral is built on the plan of a Greek cross and is oriented. At the intersection of the cross arms, there is an octagonal tholobate topped with a small lantern. The former church is a compact structure with only four annexes at the corners and is covered by a gabled roof. The entrance to the temple is through a triangular pediment. According to Kirill Sokol, there was originally a dome on the tholobate, which was dismantled after 1919 and replaced with a lantern topped by a Latin cross. The same author claims that a free-standing bell tower, which was also dismantled after the building was taken over by the Catholic Church, was located nearby.\nThe architecture of the building emulated Greek temples from the early centuries of Christianity. The second source of inspiration for the architect was the Romanesque Revival style. Piotr Paszkiewicz notes that a particular element referencing this style is the modest main entrance, featuring a minimal number of half-columns and the use of pseudo-triforiums. Another part of the temple reminiscent of this style is the apse, decorated with a single half-column with a capital adorned with plant motifs. The building was modestly decorated externally, with only the mosaic-Mandylion above the side entrance surviving to this day.\nInterior\nOriginally, the interior of the building housed a two-tiered iconostasis with icons painted by an artist named Karelin. The wall frescoes were done by another painter, Harlamov; according to Renata Popkowicz-Tajchert, the polychromy in the building was in the Art Nouveau style. Only one venerated image in the church is known – the icon of St. Martinian, in a silver riza made from metal obtained during the 1812 war. The building also housed antique copies of the Gospels and a small cross from 1812.\nHenryk Sienkiewicz notes that many elements from the time immediately after the cathedral's construction have been preserved in its interior, including the marble altar, parts of the woodwork, fragments of frescoes with plant motifs, and the pulpit. From a later period, there is a painting of Christ against the backdrop of burning Warsaw and epitaphs related to the 1st Regiment of Lancers. The stained glass windows are of more recent origin.\nReferences\nBibliography\n*\n*"
    }
  ]
}