{
  "content": [
    {
      "type": "text",
      "text": "# Holy See's reaction to the 2008 Kosovo declaration of independence\n\nThe Holy See does not recognise Kosovo and supports the territorial respect and integrity of Serbia and per UN 1244, part of agreement with Eastern Orthodox Church, and this has led to a warming of Holy See-Serbia relations. The Cardinal Walter Kasper, President of the Pontifical Council for Promoting Christian Unity, stated that the Holy See had not recognised the independence of Kosovo and did not intend to do so in the future.\nHistory\nIn February 2008, the Vatican called for \"prudence and moderation\" in Kosovo and Serbia. The Holy See urged politicians in the region to show \"a decisive and concrete commitment to ward off extremist reactions and violence\", Vatican spokesman Father Federico Lombardi announced. \"The Holy Father (i.e., the Pope) continues to look with affection at the people of Kosovo and Serbia, is close to them and is praying at this crucial moment of their history,\" the statement said. In April 2008, Monsignor Miguel Maury, referring to this statement of Father Lombardi, told U.S. diplomats that, in order not to undermine its relations with the government of Serbia and its ecumenical dialogue with the Serbian Orthodox Church, the Holy See was not ready to formally recognise Kosovo, but would \"continue to promote dialogue in a way that implicitly acknowledges and respects Kosovo's de facto independence\". In June 2008, Cardinal Walter Kasper, President of the Pontifical Council for Promoting Christian Unity, stated that the Vatican had not recognised the independence of Kosovo and did not intend to do so in the near future.\nAt a meeting in September 2009 between the Kosovan Foreign Minister, Skënder Hyseni, and Dominique Mamberti, the Holy See's Secretary for Relations with States, Archbishop Mamberti said that the Holy See was closely following developments in and around Kosovo, and he expressed his willingness to continue and intensify mutual communications. Following a meeting in November 2009 between the Serbian President Boris Tadić and Pope Benedict XVI, Tadić said that the Vatican supported Serbia's integration and membership within the EU and the sovereignty and preservation of its territorial integrity.\nOn 10 February 2011, the Vatican appointed a new Nuncio to Slovenia, who was also assigned the position of Delegate to Kosovo. In a press release, the Vatican stressed that this appointment (of non-diplomatic character) was \"completely distinct from considerations regarding juridical and territorial situations or any other question inherent to the diplomatic activity of the Holy See\". On 5 September 2011, in a meeting between Kosovo's Foreign Minister Enver Hoxhaj and the Apostolic Delegate of the Vatican to Kosovo Juliusz Janusz, Janusz indicated that there would soon be good news for Kosovo regarding its recognition by the Holy See. However, the head of the Vatican Press Service, Father Federico Lombardi, later stated that there was no change in the attitude of the Holy See toward Kosovo.\nKosovo established a Special Mission to the Holy See in January 2024. In an interview with news website Kosovo Online, Sima Avramović, the Serbian Ambassador to Holy See, clarified that in his discussions with high-ranking Holy See officials who confirmed that the mission is a liaison office and it would not be entitled to diplomatic immunity and privileges at the Holy See.\nSee also\n*Roman Catholicism in Kosovo\nReferences"
    }
  ]
}