{
  "content": [
    {
      "type": "text",
      "text": "# Home Sweet Home (The Walking Dead)\n\n(AMC+)\n*  (AMC)\n| length         = 42 minutes\n| guests         = * Angel Theory as Kelly\n* Nadine Marissa as Nabila\n* James Devoti as Cole\n* Okea Eme-Akwari as Elijah\n* Brianna Butler as Maya\n* Kien Michael Spiller as Hershel Rhee\n* Mandi Christine Kerr as Barbara\n* David Atkinson as Gus\n* Haley Leary as Ainsley\n* Mike Whinnet as Montanio\n| prev           = A Certain Doom\n| next           = Find Me\n| season_article = The Walking Dead season 10\n| episode_list   = List of The Walking Dead episodes\n}}\n\"Home Sweet Home\" is the seventeenth episode and third-part premiere of the tenth season of the post-apocalyptic horror television series The Walking Dead. The 148th episode overall, the episode was directed by David Boyd, and written by Kevin Deiboldt and Corey Reed. \"Home Sweet Home\" was released on the streaming platform AMC+ on February 21, 2021, and aired on television on AMC one week later, on February 28, 2021.\nIn the episode, Maggie (Lauren Cohan) returns, to the dismay of Negan (Jeffrey Dean Morgan). The trials she endured since leaving have made her harder in order for her and her son to survive. Eventually, Maggie and Daryl (Norman Reedus) unexpectedly fight an unseen and unknown threat. The episode received generally positive reviews from critics.\nPlot\nIn the woods, Maggie kills a reanimated Whisperer and talks with Judith about Michonne. On the road, Maggie is confronted with the sight of Negan as a free man for the first time since returning; she is stunned. Negan assures her that he didn't escape; after staring at him, Maggie walks away without saying a word, leaving Negan worried. Maggie later learns that the Hilltop Colony, her former home, was destroyed by the Whisperers. At the site of the burned community, Carol reveals to Maggie that she released Negan and that he infiltrated the Whisperers, accompanied them in the Hilltop attack, and killed Alpha. Carol then returns to Alexandria, while Maggie, Daryl, Kelly, and two of Maggie's people, Cole (James Devoti) and Elijah (Okea Eme-Akwari), head off to find the rest of Maggie's group, the Wardens, at a rendezvous point.\nWith nightfall approaching, the group find shelter in a shipping container. Maggie tells Daryl that her son, Hershel (Kien Michael Spiller), has been asking her about the man who murdered his father and that she refuses to have him live in Alexandria while Negan is there. The following morning, Kelly is discovered to have abandoned her post while on watch; the group find her in the woods searching for Connie. Later, upon arriving at the rendezvous point, they find that the camp has been burned down and is empty. Cole suspects that this was done by the Reapers, a hostile group that destroyed their former home; the group begin searching for any survivors, including Hershel.\nSoon after, Maggie reunites with three members of her group, but all three are swiftly killed by a lone Reaper using a silenced weapon. Daryl and Maggie engage with the Reaper, but the unknown assailant gets the upper hand; Maggie is caught in a snare trap and Daryl is tossed into a tree. Amidst the chaos, Maggie is able to free herself and Kelly manages to wound the Reaper using Daryl's crossbow; the group surround the attacker. Maggie then furiously questions the man about his identity and his group, but he only taunts Maggie by simply saying \"Pope marked you\", before committing suicide by detonating a grenade as the others dive for cover. Afterward, Daryl and Maggie search the woods for Hershel, who soon reveals himself hiding in a tree and reunites with his mother. With nowhere else to go, the group travel to Alexandria, only to find it under repair since it was trashed by a horde of walkers, led by Beta, after the residents evacuated and took shelter in a nearby hospital.\nProduction\nBeginning with this episode, Ryan Hurst (Beta) is removed from the opening credits. Other changes include Lauren Cohan (Maggie) being promoted back to the main cast as her name appears in the opening credits. This is also the first episode of the series to be shot with a digital camera instead of 16 mm film. \"Yes, these episodes are filmed on digital,\" showrunner Angela Kang confirmed to Insider. She continued by saying: \"The decision came about because there are fewer 'touch points' with digital than 16mm. We don't have to swap out film every few minutes, for example.\" The series' switch to digital for its final episodes is one of many precautions AMC has taken while filming during the pandemic.}}\n\"Home Sweet Home\" received positive reviews. On Rotten Tomatoes, the episode has an approval rating of 88% with an average score of 6.90 out of 10, based on 16 reviews. The site's critical consensus reads: \"It remains murky whether these bonus installments will have a life of their own, but 'Home Sweet Home' gracefully returns Lauren Cohan into the fold.\"\nForbes Paul Tassi wrote that the episode was \"pretty solid\", even if it didn't fully explain \"where Maggie was\". From Comicbook.com, Cameron Bonomolo gave the episode 4 out of 5 stars, writing that it was able to highlight \"the humanity of the people surviving in a world of the dead\". IGN critic Matt Fowler gave it a 6/10 rating, writing that the episode was a \"somewhat dull revisiting of Maggie's resentment and anger toward Negan. It's an understandable emotion for her to continue to wallow in, sure, but as viewers we're years beyond this now, in the show, and in real life, leaving this attempt to recapture the thread sort of toothless\". Comic Book Resources' Cynthia Vinney found the episode to be unnecessary, questioning if the last episodes of the tenth season would be \"simply treading water waiting for the final season to begin\".\nAlex McLevy of The A.V. Club gave the episode a \"B−\" grade rating, and wrote that it contained both \"awkward introductions\" and \"interesting aspects\" for an episode filmed during the COVID-19 pandemic. Den of Geek contributor Ron Hogan gave the episode 3 out of 5 stars, writing that \"season 10's strong writing continues forward after a solid, but unspectacular, reintroduction of a fan-favorite character\". From Vulture, Richard Rys also gave the episode 3 out of 5 stars, writing that the episode left him with \"major questions\".\nThe team from TVLine praised the character development of Maggie and Lauren Cohan's performance (as an \"Honorable Mention\"), writing: \"Lauren Cohan gave a performance in the first of The Walking Deads Season 10 bonus episodes that made us glad all over again that she's returned as Maggie. It wasn't just the warmth that radiated from her in scenes with Judith and Kelly, either, or even the rage that she brought to Maggie's face-off with a murderous Reaper. It was the subtle way that Cohan hinted at how much her character had changed since she left Hilltop.\"\nRatings\nThe episode was seen by 2.89 million viewers in the United States on its original air date, up from the previous episode.\nReferences\nExternal links\n* at AMC\n*"
    }
  ]
}