{
  "content": [
    {
      "type": "text",
      "text": "# Homeward Bound Battery and Dam\n\n| location = Croydon, Shire of Croydon, Queensland, Australia\n| beginning_label = Design period\n| beginning_date = 1870s–1890s (late 19th century)\n| built = 1888\n| built_for =\n| demolished =\n| architect =\n| architecture =\n| owner =\n| designation1 = Queensland Heritage Register\n| designation1_offname = Homeward Bound Battery and Dam\n| designation1_type = state heritage (built, archaeological)\n| designation1_date = 21 October 1992\n| delisted1_date =\n| designation1_partof =\n| designation1_number = 600439\n| designation1_free1name = Significant period\n| designation1_free1value = 1888 (fabric)\n| designation1_free2name = Significant components\n| designation1_free2value = dam/reservoir, machinery/plant/equipment – mining/mineral processing, mounting block/stand\n| designation1_free3name = Builders\n| designation1_free3value = Mr Schumacher\n}}\nHomeward Bound Battery and Dam is a heritage-listed stamping mill and reservoir at Croydon, Shire of Croydon, Queensland, Australia. It was built in 1888 by Mr Schumacher. It was added to the Queensland Heritage Register on 21 October 1992.\nHistory\nThe Homeward Bound reef north of Croydon officially produced  of ore, for a yield of  of gold, between 1886 and 1911. Work resumed between 1912 and 1916 for a yield of  of gold from  of ore and again between 1935 and 1940, when  of ore returned  of gold.\nThe Homeward Bound battery commenced crushing on 28 February 1888 with 20 head of stamps. The main mines serving the battery were all situated along the Homeward Bound reef on or near the summit of the ridge above Waterfall Creek. Homeward Bound Extended Block No.1 North Company (with a nominal capital of  in 20,000 shares) owned several of the mines and Croydon Homeward Bound Gold Mining Company owned the battery. The 20 head of stamps and eight berdan pans were driven by a  portable steam engine. The plant was valued at .\nWater was a problem throughout the Croydon Goldfield and a large dam with a stone pitched wall was constructed in 1888, by a Mr. Shoemaker (or Schumacher). Even so the Homeward Bound battery could not crush that year.\nThe Mountain Maid United Gold Mining Company (with a nominal capital of 56,000 ten shilling shares) took over the Homeward Bound battery in 1890 but relinquished it to the original company again in 1891. By then the Homeward Bound claim was almost abandoned. Although the major companies had failed, the battery was revitalized in 1893 by co-operative parties who were getting good results. One old miner said in 1896 that the Homeward Bound \"has had less public attention paid to it than any other line on this extensive goldfield but left to the stragglers like myself to scratch away\". When other Croydon mines were considering closing down, in 1898 the Homeward Bound was producing almost two ozs of gold per ton of stone. In 1899 Homeward Bound No. 4 South had a spectacular crushing of  from . Lane and Pate took over the battery in 1901 and cyaniding was commenced in 1902 using some of the equipment from the Pioneer cyanide works at Gorge Creek. In 1903,  of gold were obtained from  of quartz. However, by 1904 the Homeward Bound Company had lost the reef and others were only putting small crushings through and mining gradually petered out.\nIn the first year of cyaniding,  of tailings were treated for a yield of  of gold bullion, but production increased thirteenfold in 1903 so that it was the second largest cyaniding treatment plant on the field -  of tailings were treated for  of gold bullion. They continued with  of tailings yielding  of gold bullion in 1904;  of old tailings for  of gold bullion in 1905; and  of old tailings for  and  of new tailings for  in 1906. The average bullion values were amongst the highest on the Croydon Goldfield.\nThe settlement was never more than a camp with only a store, boarding house and postal receiving office from 1888 to 1893. An open cut mine and carbon-in-pulp treatment plant operated from 1988 to 1990 near the Homeward Bound mining area and surface evidence from earlier workings was lost in the more recent operations.\nDescription\nThe place contains two component groups: the dam and dam wall (or overshot weir) and the battery foundations. The dam wall is expertly constructed of large blocks of rough-shaped stone. The stonework reaches a maximum height of  above the downstream creek bed surface (the foundations could be buried a further ) and extends across the creek for about  from where an earth wall continues for a further . The wall contains a lower spillway section. The top of the wall is concrete rendered for the length of its stone construction. A vertical boiler on a base of stamper dyes is located at the northern end of the wall at a former cyanide plant site. The dam is heavily silted and lined with acacia on the upstream edge of the wall. The clay bed of the dam extends north-east for about .\nThe battery site, situated on the northern bank of the dam, has been stripped of all buildings and plant. Remaining, are a broken concrete engine mount, concrete and aggregate foundations for twenty head of stamps, a twenty head camshaft with ten cams, and a beam pump arm.\nThe Homeward Bound settlement site on Waterfall Creek about  east of the battery contains several intact stone fireplaces and numerous stone surfaces. The extent of the settlement was not surveyed.\nHeritage listing\nHomeward Bound Battery and Dam was listed on the Queensland Heritage Register on 21 October 1992 having satisfied the following criteria.\n'''The place is important in demonstrating the evolution or pattern of Queensland's history.'''\nThe Homeward Bound Battery and Dam is significant in Queensland's history as one of the mining settlements, or suburbs of Croydon, on the former Croydon Goldfield. The place demonstrates a number of stages in the development of Croydon Goldfield - British investment in ore crushing, then cyaniding to fully extract any remaining gold once a permanent water supply had been secured.\n'''The place demonstrates rare, uncommon or endangered aspects of Queensland's cultural heritage.'''\nThe dam wall is the most substantial structure surviving at Homeward Bound and is the largest and earliest (1888) associated with mining, recorded in North Queensland. The size and quality of the stonework is noteworthy in a regional context. There were few dams constructed on the Croydon Goldfield even though lack of water was a perennial problem.\nReferences\nAttribution\nExternal links"
    }
  ]
}