{
  "content": [
    {
      "type": "text",
      "text": "# Homeland Party (United Kingdom)\n\n|\n}}\n| logo             = File:Homeland_party_logo.jpg\n| logo_size        = 150\n| logo_upright     =\n| caption          =\n| colorcode        = #0A3D33\n| abbreviation     = HP\n| leader1_title    = Chairman\n| leader1_name     = Kenny Smith\n| leader2_title    =\n| leader2_name     =\n| leader3_title    =\n| leader3_name     =\n| founder          = Kenny Smith\n| founded          =\n| registered       =\n| split            = Patriotic Alternative\n| dissolved        =\n| merger           =\n| predecessor      =\n| merged           =\n| successor        =\n| headquarters     = Kirknewton, West Lothian, Scotland\n| newspaper        =\n| ideology         =\n|White supremacism\n|White nationalism\n}}\n| membership       =~1,300\n| position         =\n}}\n| religion         =\n| national         =\n| colours          =  Green\n*  White\n}}\n| slogan           =\n| seats1_title     = House of Commons\n| seats1           = }}\n| seats7_title     = Councillors  in England\n| seats7           = }}\n| flag             =\n| flag_title       =\n| website          =\n| country          = the United Kingdom\n}}\nThe Homeland Party is a far-right political party in the United Kingdom.- }} It was founded as a splinter of the neo-Nazi group Patriotic Alternative in April 2023 by the white nationalist  Kenny Smith, and registered as a party in January 2024. A part of the British fascist movement, it has been described as the largest fascist group in the UK by Hope not Hate.}}\nHistory\nFounding\nThe Homeland Party was formed predominately by Scottish members who had left the neo-Nazi group Patriotic Alternative (PA) over differences stemming from strict member verification and political ambitions of electoral politics through a registered party championed by Kenny Smith. PA and Homeland are ideologically similar and ideological differences were not a reason for the split. Smith, the chairman of Homeland, founded the party in April 2023. Smith was previously the national administration officer for PA, and the head of administration and an unsuccessful electoral candidate for the fascist British National Party (BNP). According to Searchlight, in 2023 Alek Yerbury had left PA and formed a new militant group named the National Support Detachment. Within a month, Smith also left and formed Homeland, attracting many members of PA to join. Homeland espouses the white genocide conspiracy theory and other far-right beliefs such as remigration, although it publicly uses innocuous messaging and downplays its neo-Nazi connections.\nOther links\nThe party's other registered officers also have connections with PA. Jerome O'Reilly is the Welsh regional organiser and Anthony Burrows is the East Midlands regional organiser. Burrows, a parish councillor for Blackwell, Bolsover, has posted photographs of Adolf Hitler and David Duke, the former leader of the Ku Klux Klan, on his Twitter account and had his shotguns confiscated and a gun licence refused for sharing terrorist literature and manifestos, including The Turner Diaries by William Luther Pierce, and for sympathising with violence against minorities. Simon Shepherd, Homeland founding member and Scotland regional organiser and formerly a member of the PA, was involved with Ashley Podsiad-Sharp and his neo-Nazi White Stag Athletic Club (inspired by the Active Club Network) and with PA's fascist fitness club which was founded and headed by Kristofer Kearney and Smith. Podsiad-Sharp and Kearney hosted The Absolute State of Britain podcast, founded by Sharp, which \"has consistently featured explicit racism, misogyny, anti-Semitism, Holocaust denial, veneration of Hitler, and apologism for Nazi atrocities and right-wing terrorism.\" Both of them have been convicted and sentenced to prison for possessing and disseminating terrorist material. Tom Huburn-King, a Homeland founding member and its West Midlands organiser, was also associated with Kearney and the White Stag and PA fascist fitness clubs.\nSenior party members such as Callum Barker, Alec Cave and Smith have also been associated with the alt-right writer Curtis Yarvin.\nRegistration\nThe group first attempted to register as a political party in May 2023, but its application was rejected.-  Complaints were raised by the Home Office to the Electoral Commission after a leaked audio of Smith which detailed a plan that Homeland might try to register under fake or proxy names for the party and its officers to hide its connections with known white supremacists. It was registered as a political party in January 2024, unlike PA which failed to do so seven times due to internal party rules that violated British equality and anti-discrimination laws.\nNoteworthy members\nIn April 2023 Judge Isabel Manley ruled against Alec Cave, a senior member of the party and its national media officer, in an employment tribunal relating to comments made by him about the actor John Boyega, who is a Black Briton. In her ruling Judge Manley said of Cave's views, \"This is not just a belief that is shocking, offensive or disturbing to others, though it may well be all those things. It is a belief that, in at least some respects, is akin to Nazism.\"\nIn October 2023 it was reported that David Gardner, a member of the party and the treasurer of the community council of Forfar, had made racist and antisemitic comments and had taken part in a neo-Nazi Telegram channel under the pseudonym \"Gordon Freeman\", along with other Homeland activists. Later in October 2023 it was reported that James Munro, Jordon Murphy and Robert Bisset, members of the party, had been involved in the neo-Nazi group Scottish Nationalist Society. Another Homeland activist, Liam Hart ( Liam Connor), is involved in the neo-Nazi music scene Blood & Honour.\nIn 2024 Homeland began to recruit fascist social media influencers, including \"You Kipper\", a propagandist for the British fascist politician Oswald Mosley, and the Nazi-apologist YouTuber Sam Wilkes ( Zoomer Historian) a follower of the Holocaust-denier David Irving. In March of the same year Jamie Brown, Invergowrie and Kingoodie community council chairman and a Homeland member, was revealed to have made numerous antisemitic statements and slurs.\nSteve Laws, the South East organiser of the party and former member of the PA, UK Independence Party, English Democrats and For Britain Movement, who made \"migrant hunting\" videos targetting refugees in the UK quit Homeland in April 2025 saying it was \"going soft\" on its remigration policy (the ethnic cleansing of non-white minorities).\nThe same year, Alexander Bramham, a gay member of Homeland, was expelled from the party. Bramham said that it was due to his opposition to anti-LGBT and fascist views of other Homeland members.\nActivities\nIn September 2024 the Homeland Party held its annual conference in Derbyshire with guest speakers from the far-right European parties Alternative for Germany (AfD) and the Polish Confederation Liberty and Independence, which was met with a protest outside after it was publicised by the anti-fascist group Red Flare.\nIn October 2024 Homeland merged with Identity England, a small English branch of the far-right Identitarian movement.\nIn March 2025 senior members of the Homeland Party travelled to Germany. Whilst there they sent a delegation to the Bundestag, were hosted by AfD and received media training from them.\nIn April 2025 the party held its \"Big Remigration Conference\". The speakers included the French conspiracy theorist and novelist Renaud Camus (who originated the Great Replacement conspiracy theory) and Lena Kotré, an AfD member of the Landtag of Brandenburg. Camus was denied entry to Britain by the Home Office, which said his presence would not be \"conducive to the public good\"; he appeared at the conference via a video link.\nIn July and August 2025, Homeland members were involved in organising local protests in Epping, Essex, after three charges of sexual assault were brought against an asylum-seeker housed in The Bell Hotel. Other far-right groups that have attended include a former Combat 18 member, some former For Britain members, PA, a Blood & Honour member, Britain First, the British Democratic Party and a number of Reform UK councillors including James Reagan. Having started on 13 July, the protests continued for some time, with the most recent occurring on 17 August. Some protests have met counter-protests by Stand Up To Racism. There have been reports of violence, although the police reports indicate that the more recent protests have been mostly peaceful. Major Homeland organisers included Callum Barker and Andrew Piper. Piper, a Market Deeping councillor, has made antisemitic posts online while Barker, a former PA member, posed for a photograph with a copy of the American domestic terrorist Ted Kaczynski's manifesto, Industrial Society and Its Future, and shared neo-Nazi content online.\nPolitical views\nThe Homeland Party supports a policy of remigration, a European far-right concept of ethnic cleansing via the deportation of ethnic minorities. In November 2024 it published an expanded policy proposal titled Immigration & Remigration, detailing specific measures to be taken to both cease and reverse immigration to the British Isles. In April 2025 The Telegraph described the party as \"nationalist and anti-immigration\", highlighting one of its policies of \"the re-migration, or encouraged mass emigration, of unintegrated and illegal migrants.\"\nElection results\nUK local elections\n{| class=\"wikitable\"\n|+\n!Year\n!Level\n!Council\n!Ward\n!Candidate\n!Votes\n!%\n!Position\n!Finish\n|-\n|2024\n| District\n|Hart\n|Hartley Wintney\n|Roger Robertson\n|355\n|13.5%\n|Councillor\n|3rd of 4\n|-\n|rowspan=5|2025\n|rowspan=5| County\n|Derbyshire\n|Bolsover\n|Tom Batten\n|84\n|2.6%\n|Councillor\n|6th of 7\n|-\n|rowspan=2|Kent\n|Folkestone East\n|Steve Laws\n|50\n|1%\n|Councillor\n|6th of 7\n|-\n|MaidstoneRural East\n|Simon Bennett\n|64\n|1%\n|Councillor\n|6th of 6\n|-\n|Lincolnshire\n|Deepings West & Rural\n|Andrew Piper\n|67\n|2.5%\n|Councillor\n|4th of 4\n|-\n|Norfolk\n|Mancroft\n|Lorna Garner\n|25\n|1%\n|Councillor\n|6th of 6\n|}\nNotes\nReferences\nBibliography\n*\n*\n*\n*\n*"
    }
  ]
}