{
  "content": [
    {
      "type": "text",
      "text": "# Homer Joseph Stewart\n\n| birth_place       = Elba Township, Lapeer County, Michigan, US\n| death_date        =\n| death_place       = Altadena, California, US\n| death_cause       =\n| resting_place     =\n| resting_place_coordinates =\n| home_town         =\n| other_names       =\n| pronounce         =\n| residence         =\n| citizenship       =\n| nationality       =\n| fields            =\n| workplaces        = California Institute of Technology\n| patrons           =\n| education         =\n| alma_mater        = University of MinnesotaCalifornia Institute of Technology (Caltech)\n| thesis_title      = The effect of shear instability on the transverse circulation in the atmosphere\n| thesis_url        = https://thesis.library.caltech.edu/view/author/Stewart-Homer-Joseph.html\n| thesis_year       = 1940\n| doctoral_advisor  = Theodore von Kármán\n| academic_advisors =\n| doctoral_students =\n| notable_students  = Paul MacCreadyJohn Wilder Miles\n| known_for         =\n| influences        =\n| influenced        =\n| awards            =\n| author_abbrev_bot =\n| author_abbrev_zoo =\n| spouse            =\n| partner           =\n| children          =\n| signature         =\n| signature_alt     =\n| website           =\n| footnotes         =\n}}\nHomer Joseph \"Stewie\" Stewart (August 15, 1915 – May 26, 2007) was an American aeronautical engineer, rocket propulsion expert, and Caltech professor, who pioneered the first American satellites.\nBiography\nWith a bachelor's degree from the University of Minnesota in 1936, Stewart matriculated at Caltech. Together with Theodore von Kármán, Stewart worked with rockets in San Gabriel Mountains. Their group became a \"nucleus\" of the Jet Propulsion Laboratory. In 1930s, Stewart and von Kármán constructed a turbine that later became known as the \"Grandpa's Knob\". It was built in the mountains of Vermont, \"generated up to a megawatt of power and operated through World War II in cooperation with a local electrical company.\"\nIn 1938, Stewart became a Caltech faculty member; in 1940, he graduated with a Ph.D. in aeronautics. He taught aeronautics and meteorology, for many years dividing his time between teaching at Caltech and research at the Jet Propulsion Laboratory (JPL).\nIn 1958 NASA (National Aeronautics and Space Administration) was formed as a response to the USSR's 1957 launch of Sputnik 1. From 1958 to 1960, Stewart took a two-year leave of absence from Caltech to serve as NASA's director of planning and evaluation. He was in charge of calculating and analyzing the exhaust velocities required to lift rockets to their planned orbits.\nIn addition to contributing to the development of the WAC Corporal, MGM-29 Sergeant, and Jupiter-C rockets, he helped prepare for Pioneer 4 and the preliminary planning of the Apollo Moon missions. He also recommended Cape Canaveral as a launching site. In 1959 Stewart and Wernher von Braun testified to Congress concerning the Soviet spacecraft and missile capabilities. Stewart was the chair of a committee formed to give advice on satellites to the US federal government.\nExcept for his two-years with NASA, Stewart remained on Caltech's faculty from 1938 until 1980, when he retired as emeritus professor of aeronautics.\nIn 1970 he was awarded the NASA Exceptional Service Medal. At his death, Homer J. Stewart was survived by two daughters, one son, and two grandchildren.\nPublications\n*\n*\n*\n*\n*\n*\n*\n*\n*  (transcript of radio interview of Homer J. Stewart conducted by Irving Bengelsdorf)\n*\n*\nSee also\n* Smith–Putnam wind turbine\nReferences\nExternal links\n*"
    }
  ]
}