{
  "content": [
    {
      "type": "text",
      "text": "# Home Invasion (American Horror Story)\n\n| production   = 1ATS01\n| guests       =\n* Kate Mara as Hayden McClaine\n* Frances Conroy as Moira O'Hara\n* Alexandra Breckenridge as Young Moira\n* Jamie Brewer as Adelaide Langdon\n* Jamie Harris as R. Franklin\n* Mageina Tovah as Bianca Forest\n* Azura Skye as Fiona\n* Kyle Davis as Dallas\n* Michael Graziadei as Travis Wanderley\n* Rosa Salazar as María\n* Shelby Young as Leah\n* Scott Lawrence as Det. Webb\n* Drew Powell as Det. Collier\n| writer       =\n* Ryan Murphy\n* Brad Falchuk\n| director     = Alfonso Gomez-Rejon\n| music        =\n| runtime      = 43 minutes\n| season_article = American Horror Story: Murder House\n| episode_list = List of American Horror Story episodes\n| prev         = Pilot\n| next         = Murder House\n}}\n\"Home Invasion\" is the second episode of the first season of the television series American Horror Story, which premiered on the network FX on October 12, 2011. The episode was co-written by series co-creators Ryan Murphy and Brad Falchuk and directed by Alfonso Gomez-Rejon.\nIn the episode, Ben Harmon (Dylan McDermott) goes to Boston to talk with the student he had an affair with in the first episode (Kate Mara). While he is away, his wife, Vivien (Connie Britton), and daughter, Violet (Taissa Farmiga) deal with three home invaders intent on reenacting a murder that happened in the house in 1968. Kate Mara guest stars as Hayden McClaine, the student Ben was having an affair with.\nThe episode makes use of the musical score to Psycho composed by Bernard Herrmann. This episode is rated TV-MA (LV).\nPlot\nA flashback to 1968 shows the house being used as a dormitory for nursing students. While alone in the house late at night, nursing students Maria and Gladys are studying when a man rings the doorbell and asks for help. Noticing the man is bleeding from the head, Maria lets him in and begins to treat his wounds. When she realizes there is no actual cut on his head and that the man is faking his injury, the man attacks them both. First, knocking Maria unconscious with an ashtray before pushing a fleeing Gladys to the floor, taunting her with an insult about her weight then drowning her in an upstairs bathtub. Maria wakes up and sees the man who forces her to strip off her clothes and wear a nurse's uniform. She is then hog-tied and stabbed repeatedly in the back.\nBack in the present, Ben meets with Tate, who reveals his sexual fantasies about Violet. Ben sees a new patient, named Bianca, who is fascinated by the history of the murders in the house. He receives a call from his ex-mistress and former student of his, Hayden, who tells him that she's pregnant and she needs his support while having an abortion.\nConstance senses that Vivien is pregnant, and Vivien confesses that she fears there is something wrong with the baby. Constance assures her that her baby is fine, and confesses that three of her four children were born with some sort of birth defect.\nIn order to see Hayden, Ben lies to Vivien, saying that he must go to Boston to see a patient who tried to commit suicide. Violet reveals to Vivien that she knows about the pregnancy.\nThat night, a trio of serial killer enthusiasts, Bianca (seen earlier by Ben), Fiona, and Dallas break into the house and capture Vivien and Violet. The trio explain their plan to re-enact the murders of Maria and Gladys to the duo. Fiona presents the ashtray used to hit Maria. Bianca questions who will be who before Fiona chooses Vivien as Maria and Violet as Gladys. Taking out nurses uniforms, there is a conflict between the group when Vivien and Violet refuse to be part of their reenactment. After Fiona tosses a uniform to Violet, she hits her in the face and attempts to escape before running into Tate, who tells her that she needs to lure the three into the basement. Violet manages to lure Fiona to the basement.\nBianca eats a cupcake laced with ipecac syrup, which Constance had made earlier for Violet, and vomits violently. A now severely ill Bianca encourages Fiona to call off their plan and take her to the hospital. Going into the bathroom, she sees someone walk past the bathtub. When she looks in the corner of the shower, no one's there. Turning around to leave, Bianca sees Tate who swings an axe into her stomach, mortally wounding her. She trudges down the hallway, leaving blood on the walls and floor before dying offscreen. In the basement, Fiona encounters Tate with Gladys, who kills her by slitting her throat. Meanwhile, Vivien fends off Dallas and flees the house with Violet. Dallas is killed by Gladys and Maria.\nConstance, Tate, and Moira agree to get rid of the bodies, revealing that they want Ben to continue treating Tate.\nBen leaves Hayden at the abortion clinic and rushes home. Ben is upset to learn that Tate was in the house during the attack and feels Tate has crossed the line by becoming involved with Violet. Violet points out that Tate was there to help them, and Ben wasn't. Vivien resolves to sell the house.\nProduction\nwas praised by series co-creator Ryan Murphy.]]\nThe episode was co-written by series co-creators Brad Falchuk and Ryan Murphy, while Alfonso Gomez-Rejon directed.\nMurphy spoke of Ben's leaving Hayden at the clinic at the end of the episode, and her character's future. \"The interesting thing for that is I always like to leave a little room for surprise,\" he said. \"Hayden comes in and certain things happen to her, and Kate Mara was so outstanding in the part that we just keep writing her in the writing room. The same with Lily Rabe as Nora [who plays one of the former owners of the house and pops up in next week's episode, \"Murder House\"]. They just kill their scenes so much and the writers love writing for those women so we just keep bringing them back.\"\nReception\nRotten Tomatoes reports a 57% approval rating, based on 7 reviews. Matt Fowler, in his review for IGN, gave the episode an overall score of 8, saying \"Home Invasion\" was a \"pleasant, twisted surprise\" and praised the opening scene, stating, \"What a horrifying opening scene! What a great style and terrifying tone it had to it.\" Emily VanDerWerff from The A.V. Club gave the episode a C grade, and said that she was \"curious\" about American Horror Story, and stated, \"I spend plenty of time thinking about it, and some of the mysteries at the show's core have got me intrigued.\nIn its original American broadcast, the second episode of American Horror Story was seen by an estimated 2.46 million household viewers and gained a 1.4 ratings share among adults aged 18–49, according to Nielsen Media Research. The episode dropped two tenths from the pilot episode.\nReferences\nExternal links\n*\n* [http://www.tvguide.com/tvshows/american-horror-story-2011/episode-2-season-1/home-invasion/319613 \"Home Invasion\"] at TV Guide.com"
    }
  ]
}