{
  "content": [
    {
      "type": "text",
      "text": "# Honduras–United Kingdom Maritime Delimitation Treaty\n\n| location_signed     = Tegucigalpa, Honduras\n| date_sealed         =\n| date_effective      = 1 March 2002\n| condition_effective =\n| date_expiration     =\n| signatories         =\n| parties             =\n*\n*\n| ratifiers           =\n| depositor           =  United Nations Secretariat\n| language            =\n| languages           = English; Spanish\n| wikisource          =\n}}\nThe Honduras – United Kingdom Maritime Delimitation Treaty is a 2001 treaty between Honduras and the United Kingdom which delimits the maritime boundary between Honduras and the British territory of the Cayman Islands.\nThe treaty was signed in Tegucigalpa on 4 December 2001. The text of the treaty establishes a boundary that runs for 220 nautical miles and separates the Cayman Islands from the Honduran Swan Islands and Cayo Gorda. From its northernmost point the boundary proceeds southeast until it turns due east when it is almost halfway between the 18th and 17th parallel north.  Each of the two portions of the boundary consists of a single straight-line maritime segments. The entire boundary is defined by three individual coordinate points. The far western point of the border is a tripoint with Haiti. The most western part of the boundary forms an agreed tripoint with Cuba, while the easternmost part forms a not-yet-confirmed tripoint with Jamaica.\nThe treaty came into force on 1 March 2002 after it had been ratified by both states. The full name of the treaty is Treaty between the Government of the Republic of Honduras and the Government of the United Kingdom of Great Britain and Northern Ireland concerning the delimitation of the maritime areas between the Cayman Islands and the Republic of Honduras. It is the first ever treaty that delimits the boundaries of the Cayman Islands. Negotiations between the United Kingdom and Jamaica and Cuba to further delimit the Cayman Islands boundaries have progressed slowly.\nNotes\nReferences\n* Charney, Jonathan I., David A. Colson, Robert W. Smith. (2005). International Maritime Boundaries, 5 vols. Hotei Publishing: Leiden. ; ; ; ; ; [https://www.worldcat.org/oclc/23254092  OCLC 23254092]\nExternal links\n*[http://untreaty.un.org/unts/144078_158780/5/1/12728.pdf Full text of treaty]"
    }
  ]
}