{
  "content": [
    {
      "type": "text",
      "text": "# Honey (Fear the Walking Dead)\n\n| director       = Michael E. Satrazemis\n| writer         = Ashley Cardiff\n| length         = 48 minutes\n| music          =\n| guests         = * Craig Nigh as Hill\n* Devyn Tyler as Nora\n| prev           = The Key\n| next           = Bury Her Next to Jasper's Leg\n| episode_list   = List of Fear the Walking Dead episodes\n| season_article = Fear the Walking Dead (season 6)\n}}\n\"Honey\" is the fifth episode of the sixth season of the post-apocalyptic horror television series Fear the Walking Dead, which aired on AMC on November 8, 2020, in the United States.\nPlot\nDwight and Sherry spend the night together. A radio call from Hill interrupts them, requesting that Dwight and Al return. Sherry gets up. Shortly after, Dwight hears strange noises and investigates. As he approaches a window, a masked individual appears behind the glass. Startled, Dwight flees, but another masked person intercepts and captures him.\nIn a skatepark, Dwight’s blindfold is removed. Multiple masked people emerges, holding Dwight at gunpoints. Sherry appears; she apologises and explains to Dwight that she is part of the masked group which is composed of Virginia’s outcasts who are now trying to take Virginia down. Ozzie, a member, threatens Dwight with killing Al if he doesn’t tell them Virginia’s whereabouts. Dwight honestly says he doesn’t know. Rollie appears and vouch for him. The group frees Dwight and Al, and discloses that their current objective is to shoot down the SWAT truck. Al advises them to steal the truck instead. The assault on the truck succeeds with the unexpected help of Morgan.\nThe group reconvenes at the skatepark and Morgan tells them of a new place to settle. Sherry explains that her group plans on killing Virginia. Conscious of the casualties to come, Morgan declines to participate. Dwight is hesitant, but Sherry convinces him to join. On the next day, after failing to extract information from a captured Pioneer, Sherry convinces Dwight to report back, in an attempt to lure Virginia out. Dwight radio-calls Hill, successfully requesting an intervention. To protect Dwight, Sherry locks him up alongside Morgan and Al who have tried to sabotage their plans. The masked group prepare their assault.\nAt night, Morgan convinces Dwight that attacking now is not a good idea. Dwight frees himself while the Pioneers arrive. He gets to Sherry and talks her into calling the assault off. As the Pioneers leave, Sherry angrily blows up at Dwight, asking him to go. Dwight takes off with Al and Morgan.\nEn route to their new settlement, they collect the survivors from the city tower. Morgan tells everyone that the place they are heading for will require \"a lot of work.\" Dwight leaves a clue of his destination for Sherry before setting off.\nReception\nDavid S.E. Zapanta from Den of Geek! rated the episode 3 out of 5, and wrote: \"I wish I could say 'Honey' is as satisfying as the episodes that came before it, especially given the pedigreed talent behind the camera. Michael E. Satrazemis directed season 4's 'Laura' and 'Close Your Eyes' — which are among the show’s best. [...] Perhaps it all boils down to the Walking Dead universe itself being incapable of sustaining positive, long-lasting change, leaving viewers with a nagging sense of been there, done that.\" Paul Daily writing for TV Fanatic rated it 4.5 out of 5, writing: \"The biggest compliment I can give 'Honey' is how well the simmering tension between different factions reached the boiling point.\" Emily Hannemann of TV Insider called it \"Another good installment in a half-season where each episode has been extremely watchable. Whatever changes Fear made behind the scenes, at least thus far, it appears they’re working.\"\nRatings\nThe episode was seen by 1.24 million viewers in the United States on its original air date, below the previous episodes.\nReferences\nExternal links\n* [https://www.amc.com/shows/fear-the-walking-dead/episodes/season-6-honey--50947 \"Honey\"] at AMC.com\n*"
    }
  ]
}