{
  "content": [
    {
      "type": "text",
      "text": "# Hong Kong Democracy Council\n\n| tax_id                   = 84-2856766\n| leader_name              = Anna Kwok\n| leader_title2            = Board Chair\n| leader_name2             = Brian Leung\n| leader_title             = Executive Director\n| key_people               =\n| focus                    = Democratic development in Hong KongHong Kong Americans\n| headquarters             = 1301 K Street NW, Suite 300W, Washington, DC 20005, United States\n| method                   = Advocacy\n| revenue                  =\n| revenue_year             =\n| expenses                 =\n| expenses_year            =\n| subsidiaries             =\n| founded                  =\n| website                  =\n}}\nHong Kong Democracy Council (HKDC) is a Washington, D.C.–based nonpartisan, non-governmental organization advocating for Hong Kong's autonomy. Formed during the 2019 Hong Kong protests, HKDC was one of the largest groups of exiled activists following the imposition of national security law in 2020 by Chinese government.\nFounding\nHKDC was founded amid the anti-extradition bill protests in 2019 as a platform for diasporic Hong Kongers in the United States to advocate for Hong Kong's democratic development and draw attention to related human rights issues. Founding members of HKDC included Nathan Law, a former Hong Kong Legislative Councilor, Victoria Hui Tin-bor, a professor of political science at the University of Notre Dame, and Hong Kong organizers Anna Yeung-Cheung and Joseph Ng.\nThe council said their mission is to \"protect Hong Kong's basic freedoms, autonomy, and the rule of law\", and conducted research and political work on \"educational outreach, community empowerment, and policy advocacy\".\nIn September 2021, Brian Leung Kai-ping became HKDC executive director and Alex Chow Yong-kang became board chair. In November 2022, Anna Kwok was appointed executive director, with Leung taking over as board chair and Chow remaining on the board.\nAdvocacy\nSince its launch, HKDC has advocated for the passage of the Hong Kong Human Rights and Democracy Act, PROTECT Hong Kong Act, Hong Kong Autonomy Act, economic sanctions and visa bans on Chinese and Hong Kong officials undermining Hong Kong's autonomy and human rights, and additional legislation in Congress related to immigration and refugee protection for Hong Kongers. HKDC's staff, board members, and advisors have also testified in front of the United States Congress. HKDC has also pushed for the broad-based Hong Kong People's Freedom and Choice Act and the immigration-focused Hong Kong Safe Harbor Act.\nIn January 2021, HKDC assisted in the rescue of five Hong Kong protesters, aged 18–26 who fled by boat to Taiwan in July 2020 soon after the national security law was imposed, by sponsoring the first set of humanitarian parole visas to the US.\nAlong with 52 Hong Kong diaspora groups and advocacy organizations, HKDC urged President Joe Biden to bar Hong Kong Chief Executive John Lee from attending the 2023 Asia-Pacific Economic Cooperation meeting in San Francisco, citing concerns about ongoing human rights violations in Hong Kong, as well as existing US sanctions and travel ban imposed on Lee in 2020. Washington Post later reported that the White House had decided to bar Lee from attending the APEC summit. However, John Lee said he received a personal invite to attend the forum, although he decided to skip it citing \"scheduling issues\".\nThe group also made a submission to the United Nations Human Rights Council's Universal Periodic Review focusing on issues under the International Covenant on Civil and Political Rights raised by the Hong Kong government's restrictions on freedom of expression, freedom of assembly, freedom of association, and the right to political participation.\nResearch\nHKDC's research team publishes reports on digital authoritarianism, political persecution, and other human rights issues in Hong Kong. The team constructed a database on political prisoners in Hong Kong, tracking arrests that were politically motivated by the security law as well as existing statutes concerning unlawful assembly, incitement, and rioting. According to HKDC, there are 1,591 political prisoners in Hong Kong as of August 2023.\nIn collaboration with the Open Technology Fund and cybersecurity research firm 7ASecurity, HKDC audited LeaveHomeSafe, Hong Kong government's COVID-19 contact tracing app, which found a number of major vulnerabilities in the LeaveHomeSafe app, contradicting claims by the government that the app had been previously audited to address concerns over users' data privacy.\nIn a report released in October 2022, HKDC criticized executives that attended Global Financial Leaders' Investment Summit were \"lending credibility\" to the whitewashing campaign of Hong Kong authorities and to John Lee. It also launched a database tracking international companies' cooperation with the Hong Kong government. Soon after, Hong Kong partially blocked HKDC's website, which was condemned by the group for eroding freedom of Hong Kong.\nHKDC also alleged the Hong Kong Trade Development Council acts as a \"white glove operation\" to facilitate the Hong Kong government's activities in the United States, including lobbying against human rights legislation. The group published a database with details on interactions between U.S. officials and Hong Kong government lobbyists and the registered lobbyists for the Hong Kong government.\nCommunity engagement\nHKDC has stated an interest in serving as a diaspora-building organization for Hong Kong immigrants and refugees in the United States. In the past, HKDC has funded a number of Hong Kong diaspora-related events and business projects. It hosted screening tour in 20 cities for Revolution of Our Times, a 2021 documentary about the large scale protests that was banned in Hong Kong.\nIn July 2022, HKDC partnered with Stand With Hong Kong to host a 3-day summit of Hong Kong diaspora activists, human rights researchers, and China policy experts. A second Hong Kong Summit was held in July 2023.\nLeadership\nExecutive Director\n{| class=\"wikitable\"\n! colspan=\"2\" |Name\n!Term start\n!Term end\n!Notes\n|-\n|\n|Samuel Chu\n|September 2019\n|August 2021\n|Resigned\n|-\n|\n|Brian Leung Kai-ping\n|September 2021\n|November 2022\n|\n|-\n|\n|Anna Kwok Fung Yee\n|November 2022\n|Incumbent\n|\n|}\nBoard chair\n{| class=\"wikitable\"\n! colspan=\"2\" |Name\n!Term start\n!Term end\n!Notes\n|-\n|\n|Anna Yeung-Cheung\n|September 2019\n|September 2021\n|\n|-\n|\n|Alex Chow Yong-kang\n|September 2021\n|?\n|\n|-\n|\n|Brian Leung Kai-ping\n|?\n|Incumbent\n|\n|}\nMembers\nBoard members\n* Maya Wang\n* June Lin\n* Alex Yong-Kang Chow\n* Joseph Ng\nAdvisors\n* Nathan Law Kwun-chung (convenor, September 2019 – August 2024)\n* Sunny Cheung Kwan-yeung\n* Andrew J. Nathan\n* Sharon Hom\n* Larry Diamond\n* Thomas E. Kellogg\n* Ted Hui Chi-fung\nResearchers and associates\n* Jeffrey Ngo\n* Kennedy Wong\n* Mason Wong\n* Ian Ng\n* Beatrice Wu\n* Carmen Lau\n* Huen Lam (Communications Director)\nResponse\nChinese authorities imposed sanctions on HKDC and others in July 2021, in response to the implementation of U.S. sanctions on Chinese and Hong Kong officials advocated for by HKDC.\nOn July 3, 2023, Hong Kong authorities issued an arrest warrant for eight overseas activists including HKDC's executive director Anna Kwok, citing efforts by overseas activists encouraging Western countries to sanction Hong Kong officials. In response, Kwok stated in a press release that she would \"not back down\" and reiterated a call for the United States to sanction Hong Kong legal officials working on National Security Law cases.\nSee also\n* Diaspora politics in the United States\n* Hong Kong\n* Democratic development in Hong Kong\n* Hong Kong Human Rights and Democracy Act\n* Hong Kong Autonomy Act\n* Magnitsky Act\n* Nathan Law\n* Alex Chow\n* Sunny Cheung\nReferences\nExternal links\n*\n*"
    }
  ]
}