{
  "content": [
    {
      "type": "text",
      "text": "# Hong Kong Drama Awards\n\n| current_awards = 33rd Hong Kong Drama Awards\n| image = Hong_Kong_Drama_Awards.png\n| imagesize =\n| alt =\n| caption =\n| awarded_for = Achievements in Hong Kong theatre\n| presenter = Hong Kong Federation of Drama Societies\n| location = Hong Kong\n| reward =\n| year = 29 February 1992\n| year2 = 28 April 2025\n| holder =\n| website =\n}}\nThe Hong Kong Drama Awards are annual awards organized by Hong Kong Federation of Drama Societies since 1992. They are given to recognize the hard work and talent of different roles involved in the stage production, and are widely regarded as the most important theatre awards in Hong Kong. The awards are presented each year at a formal awards ceremony.\nAwards\nA total of 26 regular awards are presented each year:\n* Best Production\n* Best Costume Design\n* Best Makeup and Styling\n* Best Lighting Design\n* Best Stage Design\n* Best Script\n* Best Sound Design\n* Best Original Music (Drama)\n* Best Lyrics\n* Outstanding Production of the Year\nTragedy/Drama\n* Best Director\n* Best Actor\n* Best Actress\n* Best Supporting Actor\n* Best Supporting Actress\nComedy/Farce\n* Best Director\n* Best Actor\n* Best Actress\n* Best Supporting Actor\n* Best Supporting Actress\nMusical\n* Best Original Music\n* Best Actor\n* Best Actress\n* Best Supporting Actor\n* Best Supporting Actress\n* Best Choreography\nIncidents\nFunding cut over national security law concerns\nIn 2023, the Hong Kong Arts Development Council (HKADC) and the Leisure and Cultural Services Department (LCSD) withdrew funding and venue support for the annual Hong Kong Drama Awards, citing \"inappropriate content\" and that the 31st award ceremony sparked \"different views in society\". The HKADC said the decision, including a cut to the HK$441,700 grant, was made to minimize the risk of violating the national security law.\nThe 31st awards ceremony featured political cartoonist Zunzi and journalist Bao Choy, who had been arrested in 2020 for her reporting on the 2019 Yuen Long attacks but later acquitted. The hosts referenced \"red lines\" and \"red bridges\" onstage were deemed politically sensitive, and the council accused organizers of deviating from previous neutral practices.\nReferences"
    }
  ]
}