{
  "content": [
    {
      "type": "text",
      "text": "# Hong Kong Human Rights and Democracy Act\n\n| cite statutes at large =\n| acts amended = United States–Hong Kong Policy Act\n| acts repealed =\n| title amended =\n| sections created =\n| sections amended =\n| leghisturl = https://www.congress.gov/bill/116th-congress/senate-bill/1838\n| introducedin = Senate\n| introducedbill =\n| introducedby = Marco Rubio (R-FL)\n| introduceddate = June 13, 2019\n| committees = Senate Foreign Relations\n| passedbody1 = Senate\n| passedas1 =\n| passeddate1 = November 19, 2019\n| passedvote1 = [https://www.congress.gov/congressional-record/2019/11/19/senate-section/article/S6650-1 unanimous consent]\n| passedbody2 = House\n| passeddate2 = November 20, 2019\n| passedvote2 = [https://www.congress.gov/congressional-record/2019/11/20/house-section/article/H9100-1 417–1]\n| conferencedate =\n| passedbody3 =\n| passeddate3 =\n| passedvote3 =\n| agreedbody3 =\n| agreeddate3 =\n| agreedvote3 =\n| agreedbody4 =\n| agreeddate4 =\n| agreedvote4 =\n| passedbody4 =\n| passeddate4 =\n| passedvote4 =\n| signedpresident = Donald Trump\n| signeddate = November 27, 2019\n| unsignedpresident =\n| unsigneddate =\n| vetoedpresident =\n| vetoeddate =\n| overriddenbody1 =\n| overriddendate1 =\n| overriddenvote1 =\n| overriddenbody2 =\n| overriddendate2 =\n| overriddenvote2 =\n| amendments =\n| SCOTUS cases =\n}}\nThe Hong Kong Human Rights and Democracy Act of 2019 (HKHRDA) (; ) is a United States federal law that requires the U.S. government to impose sanctions against mainland China and Hong Kong officials considered responsible for human rights abuses in Hong Kong, and requires the United States Department of State and other agencies to conduct an annual review to determine whether changes in Hong Kong's political status (its relationship with mainland China) justify changing the unique, favorable trade relations between the U.S. and Hong Kong. The passage of the bill was supported by pro-democracy activists in Hong Kong, and in 2019 received near-unanimous support in Congress.\nInitially introduced in 2014 following the Umbrella Movement and 2014 democracy protests in Hong Kong, the legislation was re-introduced to the next three successive Congresses, but did not gain a vote until 2019, following the 2019 Hong Kong extradition bill proposal and the ensuing protests against it. A House version of the bill unanimously passed in the United States House of Representatives through a voice vote in October 2019. In November 2019, the Senate version of the bill, with amendments that differ from the House bill, unanimously passed the Senate on a voice vote. The House accepted the Senate version of the bill later that month, sending it to the desk of President Donald Trump, who signed it one week later.  The bill was accompanied by a companion bill restricting U.S. exports of crowd control devices to the Hong Kong police forces, which passed both chambers of Congress unanimously and signed by Trump on the same occasion.\nLegislative history\n2014–2018\nThe bill was initially introduced in 2014 during the 113th Congress as an amendment to the United States-Hong Kong Policy Act of 1992, following the Umbrella Movement and 2014 democracy protests in Hong Kong. The House bill (H.R. 5696) was sponsored by Republican Representative Chris Smith (R-NJ), while the Senate bill (S.2922) was sponsored by Sherrod Brown (D-OH). The act stated that it was U.S. policy to: \"(1) reaffirm the principles set forth in the United States-Hong Kong Policy Act of 1992; (2) support the democratic aspirations of the people of Hong Kong; (3) urge China's government to uphold its commitments to Hong Kong; (4) support the establishment by 2017 of a democratic option to nominate and elect the Chief Executive of Hong Kong, and the establishment by 2020 of democratic elections for all members of the Hong Kong Legislative Council; and (5) support freedom of the press.\"\nThe act was reintroduced into the next two proceeding sessions of Congress: in the 114th Congress as H.R. 1159 and S. 3469, and in the 115th Congress as H.R. 3856 and S. 417.\n2019\nThe 2019 Hong Kong Human Rights and Democracy Act was introduced during the 116th Congress, and gained traction in light of the 2019 Hong Kong extradition bill proposal and the ensuing protests against it; House bill (H.R.3289) was sponsored by Jim McGovern (D-MA) and Chris Smith (R-NJ) while the Senate bill (S.1838) was sponsored by Marco Rubio (R-FL). Co-sponsors for the House bill included Tom Suozzi (D-NY), Scott Perry (R-PA), Brad Sherman (D-CA), and Brian Fitzpatrick (R-PA). Co-sponsors for the Senate bill included Jim Risch (R-ID), Bob Menendez (D-NJ), Ben Cardin (D-MD), Tom Cotton (R-AR), Angus King (I-ME), Ed Markey (D-MA), and Josh Hawley (R-MO).\nOn October 15, 2019, the House version of the bill unanimously passed in a voice vote in the House of Representatives.\nOn November 14, 2019, Senators Jim Risch and Marco Rubio began a process for the United States Senate to pass the legislation by unanimous voice vote.  The bill acquired 50 sponsors on November 18, 2019, all but guaranteeing its passage.  The bill passed the Senate via unanimous consent on November 19, 2019, with amendments that differed between the two versions.\nOn November 20, 2019, the House passed the Senate version of the Act on a 417–1 vote. Congressman Thomas Massie (R-KY) was the lone dissenting vote. The House passed the Senate version in order to expedite the process. The passage of the bills by both chambers sent the legislation to President Donald Trump. In an appearance on Fox & Friends shortly after the bill's passage, Trump said that he might veto the bill, saying that it might impact his talks with China over the U.S.-China trade war, saying, \"We have to stand with Hong Kong, but I'm also standing with President Xi ; he's a friend of mine.\" Trump signed the bill on November 27, 2019. As he was signing the bill, Trump issued a signing statement hedging his support, saying that \"certain provisions of the Act,\" which he did not specify, \"would interfere with the exercise of the President’s constitutional authority to state the foreign policy of the United States,\" and that his administration would \"treat each of the provisions of the act consistently with the president's constitutional authorities with respect to foreign relations.\" In response, Senate Democratic Leader Chuck Schumer wrote, \"Decency, humanity, and the rule of law compel you to enforce it. Stop playing games.\"\nProvisions of the act\nThe Act is divided into ten sections:\n*Sec. 1. Short title; table of contents\n*Sec. 2. Definitions\n*Sec. 3. Statement of policy\n*Sec. 4. Amendments to the United States-Hong Kong Policy Act of 1992\n*Sec. 5. Annual report on violations of United States export control laws and United Nations sanctions occurring in Hong Kong.\n*Sec. 6. Protecting United States citizens and others from rendition to the People's Republic of China.\n*Sec. 7. Sanctions relating to undermining fundamental freedoms and autonomy in Hong Kong.\n*Sec. 8. Sanctions reports.\n*Sec. 9. Sense of Congress on People's Republic of China state-controlled media.\n*Sec. 10. Sense of Congress on commercial exports of crowd control equipment to Hong Kong.\nThe HKHRDA directed various departments to assess whether political developments in Hong Kong justify changing Hong Kong's unique treatment under U.S. law, and specifically:\n*Requires the Secretary of State to issue an annual certification of Hong Kong's autonomy to justify special treatment afforded to Hong Kong by the U.S. Hong Kong Policy Act of 1992.\n*Requires the President to identify, and impose sanctions against, persons responsible for the abductions of Hong Kong booksellers and journalists and those complicit in suppressing basic freedoms in Hong Kong, including those complicit in the rendition of individuals, in connection to their exercise of internationally recognized rights, to mainland China for detention or trial. Sanctions against officials responsible for human rights abuses in Hong Kong would include asset freezes under the International Emergency Economic Powers Act as well as visa bans, including the denial of visa applications to travel in the United States and the revocation of existing visas.\n*Requires the President to issue a strategy to protect U.S. citizens and businesses from the risks posed by a revised Fugitive Offenders Ordinance, including by determining whether to revise the U.S.–Hong Kong extradition agreement and the State Department's travel advisory for Hong Kong.\n*Requires the Secretary of Commerce to issue an annual report assessing whether the government of Hong Kong is adequately enforcing both U.S. export regulations regarding sensitive dual-use items and U.S. and U.N. sanctions, particularly regarding Iran and North Korea.\n*Makes clear that visa applicants shall not be denied visas on the basis of the applicant's arrest, detention or other adverse government action taken as a result of their participation in the protest activities related to pro-democracy advocacy, human rights, or the rule of law in Hong Kong.\nThe application of targeted sanctions directed by the Act is modeled after similar provisions in the Magnitsky Act and the Global Magnitsky Act. Legal scholar Julian Ku notes that the sanctions provision of the HKHRDA \"may be read to require the president to impose targeted individual sanctions\" because the legislation states that the president \"shall\" impose sanctions against individuals determined to have violated the act's human rights provisions. Ku notes, however, that because the HKHRDA \"gives the president the power to 'determine' who has violated those human rights obligations\" the president might 'refuse to designate anyone as an HKHRDA human rights offender, even if there is substantial evidence of that person's violations.\" Ku suggests that \"this legal ambiguity as to whether the president can simply refuse to designate anyone as violating the HKHRDA's targeted sanctions provisions could become an area of intrabranch conflict if the White House refuses to exercise its authority under this section.\"\nReactions\nU.S. newspaper editorials\nThe editorial boards of several U.S. newspapers called for passage of the Act, including USA Today, The Dallas Morning News, The New York Times, New York Post, The Boston Globe, The Washington Post, and The Wall Street Journal.\nHong Kong pro-democracy movement\nHong Kong protesters against the extradition bill and members from the Hong Kong pro-democracy camp have called for the passage of the Act. Activists Denise Ho and Joshua Wong appeared before the Congressional-Executive Commission on China (CECC) in September 2019 where they urged sitting congresspersons to support the bill and rejected the suggestion that the bill constituted an inappropriate U.S. involvement in another country's affairs. Wong and his fellow Demosisto activist Jeffrey Ngo urged passage of the bill in a 2017 op-ed in The Washington Post.\nOne day after the bill's passage on November 27, pro-democracy demonstrators in Hong Kong celebrated the new law and held a pro-American rally. At the rally, held on U.S. Thanksgiving Day, Hong Kong pro-democracy activist Nathan Law called the law a \"timely Thanksgiving present.\"  Thousands of activists at the \"Thanksgiving Rally\" waved American flags and sang The Star-Spangled Banner, the U.S. national anthem, expressing gratitude to the United States, Congress and President Trump for passing the law.\nAcademics\nJulian Ku, a legal scholar at Hofstra University School of Law, called the HKHRDA \"redundant, but still worthwhile.\" Ku wrote:\nAcademics supporting the Act include Larry Diamond, Tom Campbell, Alexander Görlach, and James Carafano.\nIn a commentary on Lawfare, Alvin Y.H. Cheung noted that despite \"vocal backing from some Hong Kongers, and widespread support within Congress, the bill was not nearly as popular with longtime China hands in the United States.\" For example, Susan Thornton, a senior fellow at the Paul Tsai China Center at Yale University who previously served as acting Assistant Secretary of State for East Asian and Pacific Affairs under the Trump administration, called the act a \"huge mistake\" that would hurt Hongkongers and play into the hands of Beijing. Cheung was critical of this view, arguing that past U.S. policy toward Hong Kong had failed to stop the Chinese government from diminishing Hong Kong's autonomy and undercutting the \"one country, two systems\" principle.\nWilliam Lam of the Chinese University of Hong Kong said that while Trump was unlikely to impose sanctions because of his interest in negotiating a U.S.-China trade deal, the protesters had \"won a very important moral victory\" given the law's near-unanimous passage through Congress.\nBusiness interests\nThe American Chamber of Commerce in Hong Kong (AmCham) has said that anything that changes the status of Hong Kong 'would have a chilling effect not only on U.S. trade and investment in Hong Kong but would send negative signals internationally about Hong Kong's trusted position in the global economy.\"\nAn analyst with the Eurasia Group  and academic at Peking University both opined that the passage of the act did not affect the extant and concurrent negotiations between the United States and People's Republic of China to resolve their trade war.\nChinese and Hong Kong governments\nChina's Foreign Ministry spokesman Geng Shuang responded that the bill \"fully reveals the ill intentions of some people in the United States to mess up Hong Kong and contain China's development.\" The managing director of a Hong Kong pro-democracy group said through a statement sent to Newsweek that the foreign ministry's response showed that the PRC was \"sensitive and susceptible to international pressure.\" Beijing and state media in mainland China, such as the official Communist Party newspaper ''People's Daily, condemned the move and said the country would take countermeasures with the editor-in-chief of the state-run, nationalistic Global Times'', warning that China could bar the HKHRDA's drafters from entering mainland China, Hong Kong, and Macau. Experts said that Beijing's desire to prioritize a resolution to its trade war with the United States limited the retaliatory measures that it could (and eventually did) undertake.\nThe Hong Kong government criticized the legislation, calling it \"unnecessary and unwarranted\" and an interference into the internal affairs of Hong Kong; this position was criticized by the act's supporters.\nChinese retaliation following enactment of the HKHRDA\nOn December 2, 2019, the Chinese government retaliated against the U.S. for the passage of the HKHRDA by suspending visits of U.S. naval vessels and U.S. military aircraft to Hong Kong and by sanctioning several U.S.-based NGOs (including the National Endowment for Democracy, Human Rights Watch, Freedom House, the National Democratic Institute for International Affairs, and the International Republican Institute), whom the Chinese government allege orchestrated the Hong Kong protests. These steps were mostly symbolic. During previous periods of heightened U.S.-China tensions, the Chinese government had previously suspended U.S. warships from visiting Hong Kong. China also already tightly restricted the activities of foreign NGOs in China, particularly since 2016, and most of the NGOs sanctioned by China do not operate on the mainland. A U.S. State Department official said that \"false accusations of foreign interference\" against U.S.-based NGOs were \"intended to distract from the legitimate concerns of Hongkongers.\"\nIn the aftermath of the HKHRDA's passage, officials denied entry to Macau to a number of Hong Kong residents, journalists, and foreigners, including the heads of the American Chamber of Commerce in Hong Kong.\nU.S. Congress\nThe act received near-unanimous support in Congress, and was seen as a \"remarkable display of bipartisan unity\" in an otherwise highly polarized political environment.\nIn the House, Speaker Nancy Pelosi (D-CA) described the HKHRDA as a reaffirmation of \"America's commitment to democracy and human rights and the rule of law in the face of Beijing's crackdown.\" House Foreign Affairs Committee chairman Eliot Engel (D-NY) and ranking member Michael McCaul (R-TX) both issued statements strongly supporting the act, as did Senate Foreign Relations Committee chairman Jim Risch (R-ID) and ranking member Bob Menendez (D-NJ).\nRepresentative Chris Smith, one of the initial sponsors of the House bill, dismissed as \"cowardly propaganda\" the suggestion that passage of the act would bolster the Chinese government's efforts to depict the Hong Kong protests as \"rioting\" directed by the West.\nInternational\nFollowing the passage of the HKHRDA in the United States, activists for Hong Kong democracy called upon Canada to adopt similar legislation.\nRelated bill\n| cite statutes at large =\n| acts amended =\n| acts repealed =\n| title amended =\n| sections created =\n| sections amended =\n| leghisturl = https://www.congress.gov/bill/116th-congress/senate-bill/2710\n| introducedin = Senate\n| introducedbill =\n| introducedby = Jeff Merkley (D-OR)\n| introduceddate = October 24, 2019\n| committees = Senate Committee on Banking, Housing, and Urban Affairs (discharged)\n| passedbody1 = Senate\n| passedas1 =\n| passeddate1 = November 19, 2019\n| passedvote1 = [https://www.congress.gov/congressional-record/2019/11/19/senate-section/article/S6660-1 unanimous consent]\n| passedbody2 = House\n| passeddate2 = November 20, 2019\n| passedvote2 = [https://www.congress.gov/congressional-record/2019/11/20/house-section/article/H9096-1 417–0]\n| signedpresident = Donald Trump\n| signeddate = November 27, 2019\n| amendments      = William M. (Mac) Thornberry National Defense Authorization Act for Fiscal Year 2021\n}}\nA separate bill, , , passed by Congress at the same time as the HKHRDA, banned the export of certain types of crowd control munitions—specifically, \"tear gas, pepper spray, rubber bullets, foam rounds, bean bag rounds, pepper balls, water cannons, handcuffs, shackles, stun guns, and tasers\"—from the U.S. to the Hong Kong Police Force and Hong Kong Auxiliary Police Force. The legislation passed the House on a 417–0 and the Senate by unanimous consent.  President Trump also signed S. 2710 on November 27, 2019. The act has a sunset clause providing that the prohibition expires one year after enactment. The prohibition was later extended to December 31, 2021, by Section 1251 of the William M. (Mac) Thornberry National Defense Authorization Act for Fiscal Year 2021, and to December 31, 2024, by Section 5589 of the James M. Inhofe National Defense Authorization Act for Fiscal Year 2023.\nAftermath\nHKHRDA as a candidacy criteria in 2020 Hong Kong legislative election\nHKHRDA has become one of the concerns regarding the candidacy criteria of the 2020 Hong Kong legislative election. Pro-democracy candidate Ventus Lau was being asked by the electoral officer Amy Yeung (楊蕙心) regarding his stance on HKHRDA. Yeung asked if Lau would continue urging the sanction of US towards Hong Kong, and judged that Lau was utilizing foreign power to influence Hong Kong. She continued by asking how Lau could fulfil the requirement of being loyal to HKSAR and the Basic Law.\nSee also\n* Hong Kong Policy Act\n* Hong Kong Autonomy Act\n* Hong Kong Be Water Act\n* Uyghur Human Rights Policy Act\n* Magnitsky Act\nReferences\nExternal links\n*[https://www.congress.gov/bill/116th-congress/senate-bill/1838/text Full text of the Hong Kong Human Rights and Democracy Act of 2019], as enacted (from Congress.gov)\n*[https://www.congress.gov/bill/116th-congress/senate-bill/2710 Full text of the bill to prohibit the commercial export of covered munitions items to the Hong Kong Police Force], as enacted (from Congress.gov)\n*[https://drive.google.com/file/d/1vwkDkznV3dInH8ULSOdGBickOMpWW3xF/view Suggested sanction list prepared by the Hong Kong academia] on Google Drive ([https://archive.org/details/swhk-iad-sanction-report-v-3-public-v-1-2019.12.09 archived] in Internet Archive)"
    }
  ]
}