{
  "content": [
    {
      "type": "text",
      "text": "# Horace King, Baron Maybray-King\n\n| image = Horace King in Bonn, 1966.jpg\n| imagesize = 200px\n| caption = King in 1966\n| office = Speaker of the House of Commonsof the United Kingdom\n| monarch = Elizabeth II\n| primeminister = Harold WilsonEdward Heath\n| term_start = 26 October 1965\n| term_end = 12 January 1971\n| predecessor = Harry Hylton-Foster\n| successor = Selwyn Lloyd\n| office2 = Deputy Speaker of the House of CommonsChairman of Ways and Means\n|1blankname2  = Speaker\n|1namedata2   = Harry Hylton-Foster\n| term_start2 = 3 November 1964\n| term_end2 = 26 October 1965\n| predecessor2 = William Anstruther-Gray\n| successor2 = Samuel Storey\n| office4 = Member of Parliament  for Southampton Itchen\n| term_start4 = 26 May 1955\n| term_end4 = 11 January 1971\n| predecessor4 = Ralph Morley\n| successor4 = Bob Mitchell\n| office3        = Member of the House of LordsLord Temporal\n| term_start3    = 2 March 1971\n| term_end3    = 3 September 1986Life Peerage\n| office5 = Member of Parliament  for Southampton Test\n| term_start5 = 23 February 1950\n| term_end5 = 6 May 1955\n| predecessor5 = Constituency created\n| successor5 = John Howard\n| birth_name = Horace Maybray King\n| birth_date = 25 May 1901\n| birth_place =Grangetown, England\n| death_date =\n| death_place = Southampton, England\n| party = Labour\n| alma_mater = King's College London\n| spouse =  |||}}\n| children = 1\n| profession = Teacher\n}}\nHorace Maybray Maybray-King, Baron Maybray-King,  (; 25 May 1901 – 3 September 1986), was a British politician who served as a member of Parliament (MP) from 1950 until 1971 before becoming a life peer. For most of his time in Parliament, he sat as a Labour MP. Following the death of Harry Hylton-Foster in September 1965, King, who had served as deputy speaker for ten months, became the Speaker of the House of Commons. As was customary, he renounced his party allegiance upon taking up the post.  He was the first person from the Labour Party to hold the post.\nEarly life\nHorace King was born in Grangetown near Middlesbrough. His father John William King was an insurance salesman and Methodist local preacher. He was educated at Stockton Secondary School, Stockton-on-Tees, from 1912 to 1917 and never lost touch with these local roots. Horace attended King's College London and graduated with a first-class bachelor's degree in English.\nUpon graduating in 1922, King worked as a teacher at Taunton's School in Southampton. He became head of the English department in 1927. While working as a teacher, King studied part-time for his Ph.D. His thesis was on the Folios of Shakespeare. He received his doctorate from King's College London in 1940. He had been excused from military service during World War II due to a duodenal ulcer. He and his family&mdash;first wife Victoria Florence (née Harris), whom he married in 1924, and daughter Margaret&mdash;and Taunton's school were evacuated to Bournemouth from Southampton in 1940. Among the many pupils was 15-year-old Benny Hill. King was always a keen musician, playing the piano, piano-accordion and organ. During the Second World War he formed various concert parties&mdash;\"The V Concert Party\" was one&mdash;which toured the smaller outlying military bases and entertained troops not often reached by ENSA.\nHe also raised funds by organising concerts to \"buy\" Spitfires and send aid to Russia. He is believed to have instigated fund raising in Hampshire by letters he wrote to the Hampshire Chronicle in July and August 1940. \"The Spitfire Song\" - for which he wrote both words and music (originally titled \"The Hampshire Spitfire Song\") - was recorded by Joe Loss and his Orchestra. The recording changes the phrase \"the Hampshire planes\" to \"the British planes\". He and a teacher colleague were the first to translate \"Lili Marlene\" but were too slow to get their version to the song-publishing market.  He left Taunton's in 1947 to become headteacher of Regent's Park Secondary School.\nPolitical career\nHaving long been involved with left-wing politics, King first stood as a Labour party candidate in the 1945 general election. Labour won with a massive landslide, but King was unsuccessful in his attempt to take the ultra-safe Conservative seat of New Forest and Christchurch. The following year he was elected to Hampshire County Council, on which he served until 1965 with only a single three-year break. His wife, Victoria Florence King, was also politically active - a town councillor and Mayor of Southampton in coronation year, 1953. She died in 1966 and received a posthumous OBE.\nParliament\nIn the 1950 general election, King successfully fought the newly created Southampton Test seat, albeit with a very small majority. He successfully defended the seat in the 1951 election, which had been called after Labour's 1950 majority had proved unworkable. However, at the 1955 election, King switched his candidacy to the far safer neighbouring seat of Southampton Itchen, where he was re-elected until he left Parliament in 1971. During his time in Parliament he established links with the United States and Canada, and lectured there on the British Constitution and Parliament. During one lecture trip in Georgia he and Martin Luther King Jr. appeared on a local TV station together under the billing of \"The Two Dr Kings\". He was instrumental in gaining UK support for the UNESCO project of the raising of the temples at Abu Simbel after the flooding of the Nile by the Aswan Dam. He promoted bills on corneal grafts and attempted to raise awareness in the 1960s of autism. A keen European, he served in the Council of Europe.\nWhen Harold Wilson was elected as the first Labour Prime Minister for 13 years in 1964, King was selected as the Chairman of Ways and Means and the Deputy Speaker.\nSpeaker\nOn 9 September 1965 he was elected Speaker of the House of Commons, a position he held until his retirement on 12 January 1971. While serving as speaker, King was responsible for the speeding up of question time and for changing the dress code to allow women MPs to wear trousers in the House of Commons chamber. He was once deemed unfit to act as speaker due to his drinking. An anecdote in Order Order: The Rise and Fall of Political Drinking recalled King's inebriation with the story that \"Horace came in at 9:25pm, and he had two goes at getting up into his chair and the second time he fell to the right across the Clerks' Table with his wig 45 degrees to the left and Bob Mellish (the Government Chief Whip) called out, \"You're a disgrace, Horace, and I'll have you out of that chair within three months\". Horace turned round so abruptly that his wig was then 45 degrees out the other way, and he gave a brilliant riposte: \"How can you get me out of the chair, Bob, when I can't get myself into it?\".\nIn July 1966 King attended the opening of the new Knesset building in Jerusalem, the home of the Israeli legislature. King was asked by the Israeli government to bring the basic records of the British constitution and he bought reproductions of the Magna Carta, the Petition of Right, the Declaration of Rights and the Bill of Rights. During the parliamentary recess in 1966 King lectured in Athens and Venice on the British parliament and democracy also attended events in Bonn and the Middle East.\nAfter the Commons\n| type                  = Act\n| parliament            = Parliament of the United Kingdom\n| long_title            = An Act to settle and secure annuities upon the Right Honourable Horace Maybray King, and after his death upon his wife, Una King, in consideration of his eminent services.\n| year                  = 1971\n| citation              = 1971 c. 13\n| introduced_commons    =\n| introduced_lords      =\n| territorial_extent    =\n| royal_assent          = 30 March 1971\n| commencement          =\n| expiry_date           =\n| repeal_date           =\n| amends                =\n| replaces              =\n| amendments            =\n| repealing_legislation =\n| related_legislation   =\n| status                =\n| legislation_history   =\n| theyworkforyou        =\n| millbankhansard       =\n| original_text         =\n| revised_text          =\n| use_new_UK-LEG        =\n| UK-LEG_title          =\n| collapsed             = yes\n}}\nAfter leaving the Commons, he was created a life peer as Baron Maybray-King, of the City of Southampton, on 2 March 1971, having legally changed his surname to Maybray-King on 4 February. He took Maybray from his own middle name, which was his mother Margaret's maiden name. Maybray-King served as a deputy speaker in the House of Lords. He was awarded an honorary degree (Doctor of Laws) by the University of Bath in 1969. In 1977 he celebrated the opening of the Itchen Bridge by being driven across it in a horse-dawn landau.\nHe is commemorated by his name having been given to an arched passageway leading to the site of the former primary school, off the High Street in the village of Norton-on-Tees, County Durham, in which he lived as a child and in the naming of the A3024 Maybray King Way in Southampton.\nHe was an active fraternalist with the Loyal Order of Moose in Great Britain. He was created an honorary Grand Governor in 1972 and served as Grand Governor from 1976 to 1977.\nPersonal life\nHe was married four times. His first wife, Victoria, died in 1966 after almost 42 years of marriage. He was then married to Una Porter from 1967 until her death in 1978; to Ivy Duncan Foster from 1978 until divorcing in 1981; and to Sheila Atkinson, from March 1986 until his death on 3 September of that year, at the Royal Hampshire Hospital in Southampton.\nAn unpublished biography/autobiography (A Boy Called Horace) is in the Parliamentary Archives.\nArms\n}}\nReferences\n*\nExternal links\n*"
    }
  ]
}