{
  "content": [
    {
      "type": "text",
      "text": "# Horne v. Department of Agriculture\n\n}}\n}}\nHorne v. Department of Agriculture, 569 U.S. 513 (2013) (\"Horne I\"); 576 U.S. 351 (2015) (\"Horne II\"), is a case in which the United States Supreme Court issued two decisions regarding the Takings Clause of the Fifth Amendment to the United States Constitution. The case arose out of a dispute involving the National Raisin Reserve, when a farmer challenged a rule that required farmers to keep a portion of their crops off the market. In Horne I the Court held that the plaintiff had standing to sue for violation of the United States Constitution’s Takings Clause. In Horne II the Court held that the National Raisin Reserve was an unconstitutional violation of the Takings Clause.\nBackground\nNational Raisin Reserve\nDuring the Great Depression raisin prices dropped over 80%.  Congress reacted by passing the Agricultural Marketing Agreement Act of 1937 (\"AMAA\"). The AMAA allowed United States Department of Agriculture (\"USDA\") to issue marketing orders and agreements holding a portion of harvests in reserve so as to inflate prices. Authority to determine the annual portion of \"reserve tonnage\" raisins that were held by the government and the \"free tonnage\" raisins that owners may sell on the open market was delegated by USDA to the Raisin Administrative Committee, a body composed of raisin industry representatives appointed by the Secretary of Agriculture. The raisin reserve regularly collected as much as half of raisins grown, with the raisin reserve being over 30% of total raisins for five out of the ten years between 1997 and 2006. The Raisin Committee then sold the reserve raisins on noncompetitive markets for a variety of public purposes such as increasing exports, rewarding favored foreign governments, feeding schoolchildren, or even giving the reserve raisins back to growers if they agreed to cut back their production. Sale proceeds that remained after funding Raisin Committee operations and subsidizing exporters were returned to the owner of the raisins.  That amount was sometimes zero.\nInitial dispute with Raisin Committee\nMarvin Horne, a raisin grower operating outside Kerman, California, did not want to give any of his raisins to the Raisin Committee. Because the raisin reserve was not collected from growers but from the raisin handlers who sell raisins directly to buyers, Horne restructured his farm to act as both a grower and a handler. He then contended that the reserve requirement no longer applied to him. However, the Raisin Committee disagreed. When the Committee sent its trucks to collect Horne's raisins Horne refused to allow them onto his property. The Committee then fined Horne $680,000, the value of the raisins plus a penalty. Horne then filed suit in federal court, complaining that the raisin reserve violated the U.S. Constitution. Unconvinced, Fresno federal district Judge Lawrence Joseph O'Neill granted summary judgment to the United States Department of Agriculture. Horne appealed, but a panel of the Ninth Circuit Court of Appeals affirmed, finding that the district court did not even have jurisdiction to hear the constitutional claim. Horne petitioned the United States Supreme Court for a writ of certiorari, which was granted. Former Tenth Circuit Judge and Stanford Law Professor Michael McConnell argued before the Court on behalf of Horne.\nHorne I\nIn a unanimous opinion by Justice Clarence Thomas, the Court held that the Ninth Circuit had jurisdiction to consider Horne's case. The Court first ruled that Horne's attempt to avoid the AMAA by restructuring his farm as a combined raisin grower and handler was ineffective. However, because the law applies to Horne, his challenge to the raisin reserve was ripe. Justice Thomas also concluded that the Tucker Act did not require Horne to sue in the Court of Federal Claims because the AMAA has a comprehensive regulatory scheme.  Consequently, Justice Thomas held the case should be remanded to the Ninth Circuit to consider the merits of Horne's takings claim.\nHorne II\nOn remand the same panel of the Ninth Circuit found that there had been no taking because the Takings Clause protects personal property, like raisins, less than real property.  Again, Horne petitioned for a writ of certiorari and, again, the petition was granted.  Professor McConnell returned to argue the case for Horne but Deputy U.S. Solicitor General Edwin Kneedler now argued for the Government.\nOpinion of the Court\nWriting for a majority of the Court, Chief Justice John Roberts held that the Fifth Amendment requires the government and its agencies to pay just compensation when they take personal property from citizens. Chief Justice Roberts began his analysis by tracing the history of personal property from the protection of farmers’ grain in the 1215 Magna Carta, to the 1641 Massachusetts Body of Liberties, to a 1778 editorial by John Jay. Chief Justice Roberts concluded that personal property has not been given any less protection than real property for at least 800 years and that the physical appropriation of property gives rise to a per se taking. Applying this rule, Chief Justice Roberts held that the raisin reserve requirement constituted a physical taking because the government would physically seize the growers’ raisins. Chief Justice Roberts also held the payout from raisin reserve sales do not change the takings analysis because courts only consider potential remaining uses of property when evaluating regulatory takings, not physical takings.\nChief Justice Roberts rejected Justice Sonia Sotomayor’s contention that the raisin reserve requirement is a mere condition on the privilege of being in the raisin market. Rather, Chief Justice Roberts held that selling produce \"is not a special government benefit that the Government may hold hostage.\" To support this assertion, Chief Justice Roberts cited a footnote in Loretto v. Teleprompter Manhattan CATV Corp., which theorized forfeiting rent payments would not be a mere condition on the privilege of being a landlord. Chief Justice Roberts also refused to apply the Tucker Act because that question was already resolved in Horne I.  Finally, Chief Justice Roberts refused to remand the case back to a lower court to decide the amount of compensation to which Horne would be entitled because just compensation for a physical takings is the market value of the property taken, and the Government had already calculated that value when it fined Horne.\nConcurring opinion of Justice Thomas\nJustice Thomas wrote a separate concurring opinion in which he noted that he still thinks Kelo v. New London was wrongly decided and that the reserve raisins probably were not validly taken for a public use. He argued that remand, therefore, would be \"fruitless\" because just compensation is only calculated for valid takings.\nConcurrence and dissenting opinion of Justice Breyer\nJustice Stephen Breyer, along with Justice Ruth Bader Ginsburg and Justice Elena Kagan, joined the portion of the majority's opinion that held the raisin reserve requirement constituted a physical taking. However, Justice Breyer argued the case should be remanded to calculate just compensation. Justice Breyer argued that the value of the fine may not be an appropriate method of valuing the raisins, because there can be no takings if the benefit Horne received from the price inflation was more valuable than the cost of the seized raisins. Furthermore, Justice Breyer argued that if Horne received a net benefit from the marketing order, then he could not be excused from paying the fine for violating the order.\nDissenting opinion of Justice Sotomayor\nJustice Sotomayor wrote a dissenting opinion in which she argued that the seizure of Horne's raisins did not constitute a taking. The ad hoc inquiry that governs regulatory takings, she argued, is only subject to stricter review in the \"three narrow categories\" of zoning permit exactions, deprivations of all economically beneficial use, and permanent physical occupations. Justice Sotomayor claimed there can only be a physical takings if the owner is absolutely dispossessed of all of her ownership interest. Requiring raisin growers to physically give their crop to the government reserve may be \"downright silly\", but she argued it is not absolute dispossession because the government may later decide to payout some of the reserve raisin sales to the growers. Justice Sotomayor also contended the raisin reserve is not a taking because selling raisins is a government benefit. While she \"could not agree more\" with the Court that raisins \"are not dangerous pesticides; they are a healthy snack\", she still believes that even without safety concerns, the privilege of selling raisins are a government benefit subject to government conditions.\nSee also\n* List of United States Supreme Court cases, volume 569\n* List of United States Supreme Court cases, volume 576\nReferences\nExternal links\n* [http://www.scotusblog.com/case-files/cases/horne-v-department-of-agriculture/ Scotusblog.com (Horne I)]\n* [http://www.scotusblog.com/case-files/cases/horne-v-department-of-agriculture-2/ Scotusblog.com (Horne II)]"
    }
  ]
}