{
  "content": [
    {
      "type": "text",
      "text": "# Horton, Buckinghamshire\n\nHorton is a hamlet in the parish of Ivinghoe, in Buckinghamshire, England. It is in the civil parish of Slapton.\nThe name Horton is a common one in England. It derives from Old English horu 'dirt' and tūn 'settlement, farm, estate', presumably meaning 'farm on muddy soil'.\nAlthough in the parish of Ivinghoe, the hamlet is nearer to Cheddington with its shops and churches, so that is the main village to which most residents of Horton feel most attached.\nOn the 14 February 1942 a Royal Air Force De Havilland Dragon Rapide (R5927) was operating a training flight out of RAF Yatesbury. The pilots lost control of the aircraft after hitting a balloon cable. The aircraft came down in an area of Horton known as Wiggins Field & caught fire on impact. All six crew & one person in the ground died in the accident.\nThe hamlet of Horton was held after the Norman Conquest by the de Brocas family.  The hamlet is very small, but a few new modern houses have been built over the last twenty years, most notably Brocas Way and The Grange.  The latter was built in the 1970s as a dower house for Horton Hall.\nHorton Hall is a large moated farmhouse with 18th-century origins.  It is probably on the site of the original manor or hall.  It was the home of Norman Shand-Kydd, a charity fund-raiser, and former champion amateur jockey, who bred horses on the adjoining farm.\nTwo 16th-century half-timbered cottages remain in the village. One, still known as ''King's Head Cottage'', used to be an inn.  The other, which is older, is a renovated Tudor hall on the outskirts of the hamlet.\nNotable residents\n* Roger Goad (1538-1610), academic, theologian, Provost of King's College, Cambridge and three times Vice-Chancellor of Cambridge University. Born in Horton\n* John Milton (1562–1647), the composer, moved here from Hammersmith in 1636 with his wife, Sara, and family, including the poet John Milton (1608 – 1674). In 1641, he moved to Reading, Berkshire.\n* Robert Scawen (1602-1670), politician and member of parliament of the House of Commons of England that supported the parliamentarian side of the English Civil War. Moved to Horton in 1658 until his death.\n* Horace Davey, Baron Davey (1833-1907), judge, politician and member of parliament of the House of Commons of the United Kingdom from 1880 until 1892.\nReferences"
    }
  ]
}