{
  "content": [
    {
      "type": "text",
      "text": "# House v The King\n\nHouse v The King is a decision of the High Court of Australia.\nThe case is notable as a statement of principle for sentencing discretion in Australian Criminal Law. Specifically, the case elaborates upon five types of errors that may lead to an appellate court exercising its own sentencing discretion in substitution for that of the sentencing judge. While House was a criminal case, its statement of principle regarding appeals of discretion is relevant to all areas of law.\nHouse v The King has the second highest number of citations among High Court cases.}}\nFacts\nEverard Henry House, a bankrupt, was ordered to apply for his discharge by the Federal Court of Bankruptcy. When the application was heard by the court, he was charged with offenses under the Bankruptcy Act 1924. The court had found that six months prior to House's petition in bankruptcy he had pawned unpaid property obtained on credit.\nThe presiding judge Lukin J sentenced House to three months imprisonment with hard labour. House sought appeal to the High Court on the ground that the sentence was excessive.\nJudgment\nThe majority judgment of Dixon, Evatt, and McTiernan JJ began with a brief recitation of the facts. They then stated legal principle regarding appeals of sentences writing:Applying this statement of principle, the majority declined to interfere with the sentence imposed upon Mr House. His appeal was therefore dismissed. This statement of legal principle is the most cited passage of the High Court in its history.\nSignificance\nThe joint majority judgment gave rise to what is sometimes referred to as the 'House errors'. Those errors are still used to determine whether appellate courts ought interfere with lower court sentencing.\nBriefly stated, the five errors derived from the judgment are whether the lower court judge:\n# Acted on a wrong principle\n# Was guided by extraneous or irrelevant facts\n# Mistook the facts\n# Failed to take into account a material consideration\n# Imposed a sentence manifestly unreasonable, or plainly unjust\nThe law regarding appeals of sentences has developed in complexity since House v. The King.\nThe majority's statement of principle is not limited to criminal appeals, but applies to any appeal calling for a review of discretion. E.g. discretion exercised by public servants is reviewable on House grounds (excluding any effect of privative clauses).\nSee also\n* Federal Court of Bankruptcy\n*Cranssen v R\nNotes\nReferences"
    }
  ]
}