{
  "content": [
    {
      "type": "text",
      "text": "# House of the Tiger King (film)\n\nor  -->\n| director       = David Flamholc\n| producer       = Leon Flamholc\n| writer         = Tahir Shah\n| screenplay     =\n| story          =\n| based_on       =\n| starring       = Tahir ShahRichard Fowler\n| narrator       = David Flamholc\n| music          = Joachim CohenKenneth Cosimo\n| cinematography = David FlamholcLeon FlamholcJose Cuaman\n| editing        = Andrew Philip\n| studio         =\n| distributor    =\n| released       =\n| runtime        = 105 minutes\n| country        =\n| language       = English\n| budget         = £70,000\n| gross          =\n}}\nHouse of the Tiger King is a 2004 British–Swedish deconstructionist documentary film.  A British travel writer/explorer, Tahir Shah, and documentary filmmakers David and Leon Flamholc, join forces to go on an expedition to Peru in search of Paititi, the Inca lost city of gold. Things do not go as planned, and on their first attempt, they are forced to give up due to two main setbacks: terrible conditions and troubles with their guide, American survivalist Vietnam-war veteran Richard Fowler. On their second attempt, Flamholc and Shah find various locals to help them, including Eduardo Huamani Padilla. Tensions begin to arise between the two, in part over the difficulties in transporting the amount of camera equipment carried by the film crew, and ultimately Shah leaves the Flamholcs stranded as he continues the journey on his own. The director explains in the voiceover that he will use the best footage to put together a story once he returns home, but that \"Whatever it will look like, it will never show what actually happened.\"\nThe director's voiceover is alternated with diary notes written by Shah during the journey throughout the jungles of Peru, which indicate growing tension among the crew, depicting the hired guides as unreliable and highly dangerous.\nOn his personal website, Shah states that \"We spent seventeen weeks in deep jungle, attempting to glean information from the local tribes, and in particular from one tribal member, Pancho, who claimed to have seen a fabulous lost city in his youth, while searching for new hunting grounds. The problem was that in Pancho’s world the margin between fact and fantasy was blurred. It was never easy to know when one came to an end and the other began. The project was the hardest of my life, and made me question everything I had ever taken for granted or known. On some days I was filled with rage, and with loathing – most normally for the film crew – and on others I was consumed with depression and with angst.\"\nThe film is a 105-minute British/Swedish co-production, and is both directed and narrated by David Flamholc. It had an estimated budget of £70,000, and was filmed on location in Peru.\nReferences\nExternal links\n* [http://tigerkingmovie.com/ Official website]\n*\n* [https://www.bbc.co.uk/southyorkshire/content/articles/2004/11/11/film_sidf_tiger_king_review_feature.shtml BBC South Yorkshire]\n* [http://www.jigsawlounge.co.uk/film/reviews/neil-youngs-film-lounge-house-of-the-tiger-king/ Neil Young's Film Lounge]\n* [https://web.archive.org/web/20070807144525/http://www.fkc.at/edinburgh2004.htm Edinburgh International Film Festival]\n*"
    }
  ]
}