{
  "content": [
    {
      "type": "text",
      "text": "# Howard Shelley\n\nHoward Gordon Shelley  (born 9 March 1950) is a British pianist and conductor. He was educated at Highgate School and the Royal College of Music. He was married to fellow pianist Hilary Macnamara with whom he performed and recorded in a two-piano partnership until her death in 2021.\nPerformer\nAfter winning the premier prize at the Royal College of Music at the end of his first year, Howard Shelley's career began with a successful London recital and a televised BBC Proms concert with the London Symphony Orchestra under Michael Tilson Thomas in the same season. Since then he has performed regularly throughout the UK, Europe, Scandinavia, North America, Russia, Australia, and the Far East. He has also made over seventy-five commercial recordings.\nIn 1994, an Honorary Fellowship of the Royal College of Music was conferred on him by the Prince of Wales.\nAs pianist he has performed, broadcast and recorded around the world with leading orchestras and conductors including Vladimir Ashkenazy, Pierre Boulez, Sir Adrian Boult, Colin Davis, Mariss Jansons, Gennady Rozhdestvensky and Kurt Sanderling. During the fortieth anniversary of Sergei Rachmaninoff's death he became the first pianist ever to perform the composer's complete solo piano works in concert. The five London recitals, in London's Wigmore Hall, were broadcast in their entirety by the BBC.\nTo mark the fiftieth anniversary of Rachmaninoff's death Howard Shelley gave many concerts including a recital in the Leipzig Gewandhaus on the day itself (28 March 1993) and a recital at Rachmaninoff's villa in Lucerne at the invitation of the composer's grandson. He has given complete cycles of Rachmaninoff concertos with the Royal Scottish National Orchestra, Beethoven concertos with the BBC Philharmonic Orchestra and Mozart concerto series with the London Mozart Players, Camerata Salzburg and the Munich Symphony Orchestra. In March 2015 he performed Rachmaninoff's 3rd concerto for the first time under the baton of his son, Alexander Shelley, together with the Nuremberg Symphony. Howard Shelley also featured in a documentary of Rachmaninoff shown on BBC television.\nShelley was appointed Officer of the Order of the British Empire (OBE) in the 2009 New Year Honours.\nRecordings\nHis many recordings for Chandos, Hyperion,\nand EMI include Rachmaninov's complete piano music and concertos, series of Mozart, Hummel, Mendelssohn, Moscheles, Dohnanyi and Cramer concertos as well as all Gershwin's works for piano & orchestra and a series of British concertos including Alwyn, Bridge, Howells, Rubbra, Scott, Tippett and Vaughan Williams.  Recordings of Schumann, Grieg and Saint-Saëns Piano Concertos, and the complete music for piano and orchestra by Beethoven, have been released by Chandos.\nConductor\nIn 1985 Howard Shelley made his professional debut as a conductor. As conductor he has performed with the London Philharmonic Orchestra, London Symphony Orchestra, Royal Philharmonic Orchestra, the Philharmonia Orchestra, Royal Scottish National Orchestra, Ulster Orchestra, Hong Kong Philharmonic Orchestra, Filarmonica de la Ciudad de Mexico, Munich Symphony, Seattle Symphony Orchestra, Singapore Symphony Orchestra, Melbourne Symphony Orchestra and West Australian Symphony Orchestra, amongst many others.\nHe has held positions of Associate and Principal Guest Conductor with the London Mozart Players in a close relationship of over twenty years. He has toured with them to Japan, Korea, Germany, Sweden, Italy, the Netherlands, Ireland and to the Prague Autumn Festival, and has made many recordings with them. He is currently the Conductor Laureate of the orchestra. Shelley has also been Principal Conductor of Sweden's Uppsala Chamber Orchestra and works closely with the Camerata Salzburg, Orchestra di Padova e del Veneto in Italy and the Tasmanian Symphony Orchestra in Australia with whom he has recorded several discs. Other chamber orchestras with whom he has worked include the English Chamber Orchestra, Scottish Chamber Orchestra, Swedish Chamber, Zurich Chamber, Netherlands Chamber & Stuttgart Chamber orchestras, the Northern Sinfonia, Ensemble Orchestral de Paris, Leipzig Kammerphilharmonie and the Lugano-based Orchestra della Svizzera Italiana.\nFilm and television\nHe has appeared regularly on television since the age of ten when he gave a recital of Bach and Chopin. He was soloist at the 100th anniversary of the Promenade Concerts, a concert that was televised worldwide. A documentary on Ravel made in 1998 by the Australian Broadcasting Corporation, featuring Shelley as conductor, pianist and presenter won the Gold Medal for the best arts biography of the year at the New York Festivals Awards.\nShelley has appeared on the soundtrack of several films including Un coeur en hiver (1992), Anna Karenina (1997) and Testimony (1988). In the latter film, directed by Tony Palmer, Ben Kingsley played the part of Dmitri Shostakovich, miming to Howard Shelley's piano.\nFamily\nHoward Shelley married fellow pianist Hilary Macnamara in 1975.   The conductor Alexander Shelley is one of their sons.\nReferences\nFurther reading\n*James Palmer (2020). Howard Shelley at 70 – a career on record. Musical Opinion 143 (1522): 5–6, 8, 10"
    }
  ]
}