{
  "content": [
    {
      "type": "text",
      "text": "# Howard Harris (wrestler)\n\n|birth_place =Salem, Oregon, U.S.\n|alma_mater =Oregon State University\n|highestranking=\n|show-medals = yes\n|medaltemplates =\n}}\nHoward Harris (born February 9, 1958) is a former American wrestler. He was an NCAA national champion and four-time All-American at Oregon State University. Harris was the national champion in the heavyweight weight class at the 1980 NCAA Division I Wrestling Championships and was named the most outstanding wrestler of the tournament, becoming the first African American to win the award.\nHigh school\nHarris attended McNary High School in Keizer, Oregon, winning the state team championship as a junior in 1975. He was undefeated that year until the state tournament finals when he had to forfeit due to an injury.  In 1976, his senior year, McNary placed second in state but Harris won an individual state championship while being undefeated at 191&nbsp;lbs. He completed his high school wrestling career with a mark of 80–5. In addition to his wrestling talents he was an Oregon All-State football player, racking up a total of 1448 rushing yards and 17 touchdowns while leading McNary to its first state tournament berth.\nCollege\nHarris is one of the greatest wrestlers in the history of Oregon State University. He was a four-time All-American at 190&nbsp;lbs and heavyweight, and holds the school record for career wins (169) and single season pins (40, 1980). He won the NCAA Heavyweight championship in 1980 with a perfect record of 46-0 and is one of only five wrestlers to pin every opponent in the NCAA tournament. His dominance at the NCAA tournament garnered him the Outstanding Wrestler Award, the first African-American to win the award.\nMany major college wrestling programs wanted to sign Harris after his dominant senior year of high school. The day before letters of intent could be signed he announced he would wrestle for Oklahoma. His high school coach, National Wrestling Hall of Fame inductee Jerry Lane, contacted Oregon State wrestling coach Dale Thomas, a two-time national coach of the year and National Wrestling Hall of Fame member himself. Thomas met with Harris that day and convinced Harris that staying in the state would give him an opportunity at a national championship and set him up for success once his college days were over.\nOlympics\nHarris was a member of the 1980 United States Olympic Team. However, the United States boycott of the 1980 Olympics in Moscow meant Harris couldn't compete. He did compete in the 1981 World Cup of Wrestling where he faced Olympic Champion Sanasar Oganisyan. Oganisyan got the best of Harris, winning by decision.\nPersonal\nHarris is married with four sons and one daughter. His son Major played defensive end for the Portland State Vikings football team.\nReferences\nFurther reading\n* Jeff Welsch and George P. Edmonston Jr., \"Tales from Oregon State Sports\", 2003,"
    }
  ]
}