{
  "content": [
    {
      "type": "text",
      "text": "# Howard Cruse\n\n| birth_place   = Birmingham, Alabama, U.S.\n| death_date    =\n| death_place   = Pittsfield, Massachusetts, U.S.\n| cartoonist    = y\n| write         =\n| pencil        =\n| ink           =\n| letter        =\n| color         =\n| alias         =\n| signature     =\n| notable works = Gay ComixStuck Rubber Baby\n| awards        = Inkpot Award, 1989United Kingdom Comic Art Award,Prix de la critique (France), 2002\n| website       =\n}}\nHoward Cruse (May 2, 1944 – November 26, 2019) was an American alternative cartoonist known for the exploration of gay themes in his comics. First coming to attention in the 1970s, during the underground comix movement with Barefootz, he was the founding editor of Gay Comix in 1980, created the gay-themed strip Wendel during the 1980s, and reached a more mainstream audience in 1995 when an imprint of DC Comics published his graphic novel Stuck Rubber Baby.\nEarly life\nCruse was born on May 2, 1944, in Birmingham, Alabama, and raised in nearby Springville, the son of a preacher and a homemaker. His earliest published cartoons were in The Baptist Student when he was in high school. His work later appeared in Fooey and Sick. He attended high school at Indian Springs School in (what is now) Indian Springs, Alabama, and college at Birmingham-Southern College, where he studied drama.\nCruse worked for about a decade in television. In 1977, Cruse moved to New York City, where he met Eddie Sedarbaum, his life partner, in April 1979. Sedarbaum founded the New York activist group Queens Gays and Lesbians United. The couple moved to North Adams, Massachusetts, in 2003, and were married there the following year.\nCareer\nCruse's cartooning first attracted nationwide attention in the 1970s, when he contributed to underground comix publications.  His best-known character from this period was Barefootz, the title character of a surreal series about a good-natured, well-dressed young man with large bare feet.  Although dismissed by many underground fans as overly \"cutesy\", others found it a refreshing change of pace from \"edgier\" comix.\nissue 1, May 1981, displaying both his \"cutesy\" style (the Barefootz cover) and the mid-range cartoony style typical of most of his work before Stuck Rubber Baby.]]\nCruse had been open about his homosexuality throughout the 1970s, but aside from having a gay supporting character (Headrack) in Barefootz, did not acknowledge it in his work. This changed in 1979, when publisher Denis Kitchen asked him to edit Gay Comix, a new anthology featuring comix by openly gay and lesbian cartoonists. For much of the 1980s, he created Wendel, a strip (1–2 pages per episode) about an irrepressible and idealistic gay man, his lover Ollie, and a cast of diverse urban characters. It was published in the gay newsmagazine The Advocate, which allowed Cruse substantial freedom in terms of language and nudity, and to address content such as AIDS, gay rights demonstrations, gay-bashing, closeted celebrities, and same-gender relationships, with a combination of humor and anger. Two collections of these strips have been published, as well as an all-in-one volume.\nCruse spent the first half of the 1990s creating Stuck Rubber Baby'', a 210-page graphic novel commissioned by editor Mark Nevelow for his DC Comics imprint Piranha Press but eventually published by DC's Paradox Press. It is the story of Toland Polk, a young man growing up in the American South in the 1960s, and his growing awareness of both his own homosexuality and the racial injustice of American society. The book features Cruse's most detailed and realistic comics art and his most serious and complex storytelling. It received numerous awards and nominations.\nCruse briefly wrote a column in a comic book review magazine, Comics Scene, under the rhyming masthead \"Loose Cruse\".\nIn 2003, the Leslie-Lohman Museum of Art featured Cruse alongside Bill Schmeling, Michael Kirwan, Rob Clarke, and Adam (Jack Bozzi) in its Deliciously Depraved exhibit.\nCruse contributed to the queer comics anthology series Juicy Mother, edited by Jennifer Camper, which first appeared in 2005 and then in 2007.\nIn August 2009, Howard Cruse self-published From Headrack to Claude, a collection of all his gay-themed strips accompanied by commentaries on his career and life, including the never-reprinted 1976 Barefootz story where the character Headrack came out, and some unpublished stories.\nOn March 17, 2010, an original one-off titled Lubejob penned by Cruse was published in Nib-Lit comics journal. In 2011, Cruse's The Complete Wendel was republished by Rizzoli's Universe Books imprint.\nCruse was chosen as a keynote speaker, alongside Alison Bechdel, for the inaugural Queers & Comics conference in 2015.\nHoward Cruse died on November 26, 2019, from lymphoma in Pittsfield, Massachusetts. Shortly before, it had been announced that a 25th anniversary edition of Stuck Rubber Baby was scheduled for publication from First Second Books.\nHoward Cruse is one of 5 queer cartoonists featured in the award-winning documentary film No Straight Lines: The Rise of Queer Comics (released in 2021 at the Tribeca Film Festival and broadcast on national PBS in 2023).\nPublications\n* Cruse, Howard. (1985) Wendel, New York: Gay Presses of New York.\n* Cruse, Howard. (1986) ''Howard Cruse's Barefootz: The Comix Book stories, Renegade Press. ASIN B00072X5YY\n* Cruse, Howard. (1987) Dancin' Nekkid with the Angels'', St Martin's Press.\n* Cruse, Howard. (1989) Wendel on the Rebound, St Martin's Press.\n* Cruse, Howard. (1990) Early Barefootz, Fantagraphics Books.\n* Cruse, Howard. (1995) Stuck Rubber Baby, Paradox Press.\n* Cruse, Howard. (2001) Wendel All Together, Olmstead Press.\n* Shaffer, Jeanne E. (2004) \"The Swimmer with a Rope in his Teeth\" illustrated by Howard Cruse, Amherst, NY: Prometheus Books.\n* Cruse, Howard. (2009) From Headrack to Claude, Nifty Kitsch Press.\n*Cruse, Howard (2011) The Complete Wendel, Rizzoli/Universe.\nContributions\n* Robert Kirby and David Kelly, editors, (2008) The Book of Boy Trouble 2: Born to Trouble. Green Candy Press.\n* Camper, Jennifer, editor (2007) Juicy Mother 2: How They Met. Manic D Press.\n* Fish, Tim, editor (2007) Young Bottoms in Love. Poison Press.  (includes the My Hypnotist short story)\n* Camper, Jennifer, editor (2005). Juicy Mother. Soft Skull Press.\nReferences\nSources\n* The Comics Journal #111, pp.&nbsp;64–96, Fantagraphics, September 1986. A long interview of Howard Cruse.\n* The Comics Journal #182, pp.&nbsp;93–118, Fantagraphics, November 1995. A critical overview of Stuck Rubber Baby, with another interview of Howard Cruse.\n* I Have To Live With This Guy, pp.&nbsp;164–177, TwoMorrows Publishing, 2002, . Eddie Sedarbaum talks about his life with Howard Cruse.\nExternal links\n*\n*[http://www.nostraightlinesthefilm.com No Straight Lines: The Rise of Queer Comics] - documentary film about five queer artists including Howard Cruse\n*[http://www.lettersofnote.com/2009/12/you-gave-me-valuable-gift-you-took-me.html Reproduced correspondence] with Dr. Seuss\n*[https://johnseven.me/2019/11/27/from-the-archive-howard-cruse/ Interview with Howard Cruse]\n*[https://findingaids.library.columbia.edu/ead/nnc-rb/ldpd_12053562 Howard Cruse Papers, 1941-2019] at the Rare Book and Manuscript Library, Columbia University, New York, NY"
    }
  ]
}