{
  "content": [
    {
      "type": "text",
      "text": "# Howard Zahniser\n\nHoward Clinton Zahniser (February 25, 1906 – May 5, 1964) was an American environmental activist. From 1945 until his death he led The Wilderness Society as executive secretary, executive director, and editor of The Living Wilderness. Zahniser was the primary author of the Wilderness Act passed by Congress in 1964.\nEarly life and education\nZahniser was born in Franklin, Pennsylvania, to a family that had migrated from Germany in the 1750s. His father was a Free Methodist minister. He grew up in nearby Tionesta along the banks of the Allegheny River close to the Allegheny National Forest. He attended college at Greenville College in Greenville, Illinois, where he graduated with a B.A. degree in English in 1928.\nCareer\nZahniser began his career on the staff of the United States Bureau of Biological Survey (1930) (now part of the United States Fish and Wildlife Service of the Department of the Interior).\nHe also became active in private efforts to conserve undeveloped areas. Ten years after The Wilderness Society was founded, Zahniser was hired as their executive secretary, and later worked as executive director. He served as editor of their journal, The Living Wilderness, from 1945 through 1964.\nEcho Park Dam controversy\nThe United States Bureau of Reclamation plans for a ten-dam, billion dollar Colorado River Storage Project began to arouse opposition in the early 1950s when it announced that one of the proposed dams would be at Echo Park, in the middle of Dinosaur National Monument. The controversy assumed major proportions, dominating conservation politics for years. David Brower, executive director of the Sierra Club, and Zahniser representing The Wilderness Society led an unprecedented nationwide campaign to preserve the free-flowing rivers and scenic canyons of the Green and Yampa rivers. They worried that damaging a national monument would be a bad precedent for attempts to preserve other wilderness areas.\nPowerful members of Congress and their constituents in western states were committed to the Colorado River Storage Project in order to secure water rights, obtain cheap hydroelectric power, and develop reservoirs as tourist destinations for recreation. After much debate, Congress settled on a compromise that eliminated Echo Park Dam and authorized the rest of the project. The Colorado River Storage Project Act became law on April 11, 1956. It stated, \"that no dam or reservoir constructed under the authorization of the Act shall be within any National Park or Monument.\"\nHistorians view the Echo Park Dam controversy as marking the start of an era that resulted in increased efforts to conserve wilderness areas. National campaigns resulted in such major conservationist political successes as the Wilderness Act of 1964 and the Wild and Scenic Rivers Act.\nWilderness Act\nPresident Lyndon Johnson signs the Wilderness Act of 1964 in the White House Rose Garden. Also pictured are Interior Secretary [[Stewart Udall, Senator Frank Church, Mardy Murie, Alice Zahniser, and Representative Wayne Aspinall, among others.]]\nIn his capacity with The Wilderness Society, Zahniser drafted the Wilderness Act in 1956, which was introduced in the United States Congress that same year — in the House of Representatives by Congressman John P. Saylor of Pennsylvania, and in the Senate by Hubert Humphrey of Minnesota. Zahniser was the main proponent of the Wilderness Act over the subsequent eight years that it took to pass the legislation, including overseeing numerous rewrites, attending all 18 public hearings on the bill, and personally lobbying virtually every member of Congress in support of the legislation.\nZahniser died of heart failure at age 58 on May 5, 1964, a few months before President Lyndon B. Johnson signed the Wilderness Act into law in September of that year.\nThe Wilderness Act established America's National Wilderness Preservation System, which today permanently protects more than 111 million acres (450,000&nbsp;km²) of federal public land for the benefit of future generations of people and wildlife alike. Wilderness areas are designated by act of Congress; under the framework of the Wilderness Act, which Zahniser created, they are identified on existing lands managed by the United States Forest Service, National Park Service, United States Fish and Wildlife Service, and Bureau of Land Management.\nLegacy and honors\nZahniser is buried in Tionesta's Riverside Cemetery; his rough-hewn marker, taken from the surrounding forest, faces his beloved Allegheny River.\n*Zahniser's work helped established the National Wilderness Preservation System. More than 100 wilderness bills have been signed into law since 1964. Every United States President since 1964 has signed substantial wilderness legislation to designate such areas for protection.\n*On August 13, 2001, the Pennsylvania Historical and Museum Commission dedicated a roadside historical marker, memorializing Zahniser, just north of Tionesta along the Allegheny River near the southern end of the Allegheny Islands Wilderness.\n*It has been noted that due to the enduring gravity and magnanimity of his life's work, \"Howard Zahniser deserves higher regard and increased recognition not only in the pantheon of great American conservationists, but in the pantheon of great Americans.\"\nSee also\n* Environmental history of the United States\nNotes\nReferences and further reading\n*Frome, Michael. 1974.  Battle for the Wilderness (New York: Praeger).\n*Harvey, Mark. 2005. Wilderness Forever: Howard Zahniser and the Path to the Wilderness Act (Seattle: University of Washington Press), a standard scholarly biography; [https://archive.org/details/wildernessforeve00harv online]\n*Scott, Douglas W. 2001. A Wilderness Forever Future: A Short History of the National Wilderness Preservation System (Washington, DC: Pew Wilderness Research).\n*Wild, Peter. 1986. Pioneer Conservationists of Eastern America (Missoula, MT: Mountain Press Publication Co.).\nPrimary sources\n* Harvey, Mark W. T. ed. The Wilderness Writings of Howard Zahniser (U of Washington Press, 2014) [https://www.amazon.com/Wilderness-Writings-Zahniser-Weyerhaeuser-Environmental/dp/029599391X/ref=tmm_hrd_swatch_0?_encoding=UTF8&qid=&sr=&asin=029599391X&revisionId=&format=4&depth=1 excerpt]\n*  Zahniser,  Howard. Where Wilderness Preservation Began (1992) [https://archive.org/details/wherewildernessp0000zahn online]\nExternal links\n*[https://web.archive.org/web/20060908084550/http://www.greenville.edu/backup/zies/ Zahniser Institute for Environmental Studies], Greenville University\n*[http://www.wilderness.org The Wilderness Society], official website\n*"
    }
  ]
}