{
  "content": [
    {
      "type": "text",
      "text": "# Howard Elphinstone (British Army officer, born 1829)\n\n|image= VCHowardCraufurdElphinstone.jpg\n|caption=\n|birth_date=\n|death_date=\n|birth_place= Cumenhoff, Livonia, Russia\n|death_place= At sea near Madeira\n|placeofburial= Lost at sea\n|nickname=\n|allegiance= United Kingdom\n|branch= British Army\n|serviceyears= 1847–1890\n|rank= Major-General\n|unit= Royal Engineers\n|commands= Western District\n|battles= Crimean War\n|awards= Victoria CrossKnight Commander of the Order of the BathCompanion of the Order of St Michael and St GeorgeKnight of the Legion of Honour (France)Order of the Medjidie (Ottoman Empire)Order of the Red Eagle (Prussia)\n|laterwork=\n}}\nMajor-General Sir Howard Craufurd Elphinstone,  (12 December 1829 – 8 March 1890) was a British Army officer and a recipient of the Victoria Cross, the highest award for gallantry in the face of the enemy that can be awarded to British and Commonwealth forces.\nEarly career and the Crimean War\nBorn in Livonia, Elphinstone joined the Corps of Royal Engineers as a gentleman cadet at the Royal Military Academy, Woolwich and was commissioned as a second lieutenant in December 1847. With the outbreak of the Crimean War, Elphinstone was posted to the Crimea and it was during the Siege of Sebastopol that he won the Victoria Cross.\nVictoria Cross\nOn 18 June 1855, he was 25 years old, and a lieutenant in the Royal Engineers, when the following deed took place for which he was awarded the VC.\nHis citation read:\n}}\nFurther honours\nWith the end of the war he was decorated by both Napoleon III, Emperor of France being appointed as a Knight of the Legion of Honour; and Abdülmecid I, Sultan of the Ottoman Empire who appointed him to the 5th class of the Order of the Medjidie.\nSubsequent career\nElphinstone ended the Crimean War as a brevet major and as a substantive second captain in the Royal Engineers, but was promoted to the substantive Army (but not Corps) rank of major in 1858.\nIn 1859 he joined the Royal Household of Queen Victoria as governor to Prince Arthur, the third son of Queen Victoria, and later also governor to Prince Leopold, Her Majesty's fourth son.  In 1865 the Queen rewarded him for his service as governor by appointing him as a Companion of the Order of the Bath (Civil Division). In 1868 he was appointed a brevet lieutenant colonel and in 1870 he was made a Companion of the Order of St Michael and St George.\nFurther honours came Elphinstone's way when Prince Arthur obtained his majority in 1871, firstly in May he was appointed Comptroller of the Household to Prince Arthur, the same month he was made a Companion of the Military Division of Order of the Bath, and finally in July was knighted as a Knight Commander of the Civil Division of the Order of the Bath.\nHe married Annie Frances Cole (1856–1938) and they settled at Pinewood, Bagshot, close to Prince Arthur's home at Bagshot Park. Lady Elphinstone lived at Pinewood until her death in 1938. They had four daughters: Victoria (1877–1952); Irene (1878–1957), Olive (1882–1968) and Mary (1888–1965). All four married army officers. Mary married Colonel Robert Singleton McClintock, son of Francis Leopold McClintock.\nPromotions also followed; in 1872 his substantive promotion to major was confirmed and the following year he was promoted to lieutenant colonel.\nReturning to military service Elphinstone served as an Aide-de-camp to the Queen in 1877 and was promoted to colonel at the end of 1881, and was appointed as Officer Commanding Royal Engineers in Mauritius, a post he was reluctant to take up, so much so that he was prepared to resign from the army; however under customs then allowed in the British Army, a posting could be avoided if another officer was prepared to take the posting instead. Normally this involved payment to the substitute officer but Elphinstone was fortunate to meet fellow Royal Engineer officer, Colonel Charles Gordon who was willing to take the posting to Mauritius without payment. During 1884–5 he served as military attache in Berlin. In 1887 he was promoted to major general and in 1889 he became General Officer Commanding Western District but he drowned in 1890 when he fell overboard while on a trip to Madeira.\nMemorial\n]]\nThere is a brass plaque to his honour in the Nave of Exeter Cathedral. It names the people who attended Elphinstone's memorial service in the cathedral – a large number were royalty and Queen Victoria sent a representative. His VC and other medals are on display in the Lord Ashcroft Gallery at the Imperial War Museum, London.\nNotes\nReferences\n*\n*\n*\n*\nFurther reading\n*\n*\n*\n*\n*"
    }
  ]
}