{
  "content": [
    {
      "type": "text",
      "text": "# Howard Berg\n\n| birth_place       = Iowa City, Iowa, USA\n| death_date        =\n| death_place       =\n| resting_place     =\n| resting_place_coordinates =\n| citizenship       =\n| nationality       =\n| fields            =\n| workplaces        = California Institute of Technology, Harvard University\n| alma_mater        = California Institute of Technology, Harvard University\n| thesis_title      =\n| thesis_url        =\n| thesis_year       = 1964\n| doctoral_advisor  = Norman Ramsey\n| academic_advisors =\n| doctoral_students =\n| notable_students  =\n| known_for         =\n| author_abbrev_bot =\n| author_abbrev_zoo =\n| influences        =\n| influenced        =\n| awards            =\n| signature         =\n| signature_alt     =\n| website           =\n| footnotes         =\n| spouse            =\n}}\nHoward Curtis Berg (March 16, 1934 – December 30, 2021) was the Herchel Smith Professor of Physics and professor of molecular and cellular biology at Harvard University, where he taught biophysics and studied the motility of the bacterium Escherichia coli (E. coli).\nBerg has been a member of the Harvard University department of molecular and cellular biology since 1986 and of the Harvard University department of physics since 1997. He was also a member of the Rowland Institute for Science at Harvard University.\nEarly life and family\nBerg was born to Esther C. and Clarence P. Berg in Iowa City, where his father was a biochemist at the University of Iowa and an expert on the physiology of non-proteinogenic D-amino acids.\nBerg was the husband of Mary Guyer Berg, a scholar of Latin American literature. Berg has 3 children. His elder son Henry became a tech entrepreneur in Washington State, his second son Alec, a comedy writer in Hollywood. His youngest, daughter Elena, studies animal behavior at the American University in Paris.\nEducation and career\nBerg studied as an undergraduate at the California Institute of Technology and received a B.S. in chemistry in 1956. After graduation, he spent a year with Kai Linderstrøm-Lang at the Carlsberg Laboratory in Copenhagen. Eventually he was accepted into the physics graduate program at Harvard, where he earned a Ph.D. in chemical physics in 1964, with a dissertation on the hydrogen maser directed by Nobel Laureate Norman Ramsey.\nAlthough he became a faculty member and junior fellow in the Society of Fellows at Harvard, he joined the new Department of Molecular, Cellular, and Developmental Biology at the University of Colorado in Boulder in 1970. After a 7-year stint at Caltech, he returned to Harvard in 1986.\nAmong his major achievements was the discovery that bacteria swim by rotating their flagellar filaments, which was also the title of a paper he was most proud of. Berg was an active researcher until very late in life. At the age of 87, he was awarded an NSF grant to study the stator unit that drives rotation of the bacterial flagellum being itself a rotary machine.\nHe is author of the influential book Random Walks in Biology (Princeton Univ. Press, Princeton, NJ, 1983) about the biological applications of diffusion.\nAwards\nWith Edward Purcell, Berg received the Max Delbrück Prize in Biological Physics from the American Physical Society in 1984 for work on the physical limits of bacterial chemoreception. He was elected a Fellow of the American Academy of Arts and Sciences in 1985 and a Fellow of the American Physical Society in 1990 (\"for the elucidation of complex biological phenomena, particularly chemotaxis and bacterial locomotion, through simple but penetrating physical theories and brilliant experiments\").\nBerg was a member of the National Academy of Sciences and the American Philosophical Society.\nReferences\nExternal links\n* [https://web.archive.org/web/20110715235845/http://www.techtransfer.harvard.edu/crop/investigators/investigator.php?id=102 Research Summary & Profile], Harvard University\n* [https://web.archive.org/web/20120629124727/http://www.mcb.harvard.edu/mcb/faculty/profile/howard-c-berg/ Faculty profile in Harvard department of Molecular and Cellular Biology]\n* [http://www.physics.harvard.edu/people/facpages/berg.html Faculty profile in Harvard physics department]\n* [http://www.rowland.harvard.edu/labs/bacteria/index.html Group page at the Rowland Institute]\n* [https://www.mcb.harvard.edu/mcb/news/news-detail/3312/howard-berg-studies-on-e-coli-in-motion/ Howard Berg: Studies on E. Coli in motion]\n*[http://www.ibiology.org/ibioseminars/biophysics-chemical-biology/howard-berg-part-1.html Howard Berg online seminar: Marvels of Bacterial Behavior]"
    }
  ]
}