{
  "content": [
    {
      "type": "text",
      "text": "# Howard Chandler Christy\n\n| birth_place   = Morgan County, Ohio, U.S.\n| death_date    =\n| death_place   = Manhattan, New York City, New York, U.S.\n| nationality   =\n| other_names   =\n| occupation    = artist and illustrator\n| years_active  = 1890–1952\n| known_for     =\n| notable_works = ''Gee I wish I were a Man I'd Join the Navy, Portrait of Dorothy Barton Thomas, Scene at the Signing of the Constitution of the United States, The Christy Girl''\n| signature     = Signature of Howard Chandler Christy.png\n}}\nHoward Chandler Christy (January 10, 1872&nbsp;&ndash; March 3, 1952) was an American artist and illustrator. Famous for the \"Christy Girl\" – a colorful and illustrious successor to the \"Gibson Girl\" – Christy is also widely known for his iconic WWI military recruitment and Liberty loan posters, along with his 1940 masterpiece titled, Scene at the Signing of the Constitution of the United States, which is installed along the east stairwell of the United States Capitol.\nFrom the 1920s until the early 1950s, Christy was active as a portrait painter whose sitters included presidents, senators, industrialists, movie stars, and socialites. He painted Lt. Col. Theodore Roosevelt, and Presidents Warren G. Harding, Calvin Coolidge, Herbert Hoover, Franklin Delano Roosevelt, and Harry Truman. Other famous people he painted include William Randolph Hearst, Edward VIII, Eddie Rickenbacker, Benito Mussolini, Prince Umberto, and Amelia Earhart.  By 1938, Time magazine described Christy as \"the most commercially successful U.S. artist.\"\nEarly life and education\nChristy was born in Morgan County, Ohio and attended early school in Duncan Falls, Ohio. He then attended the Art Students League of New York in New York City from 1890 to 1891 and then at the National Academy under William Merritt Chase, first at Chase's summer retreat at Shinnecock Hills, New York on Long Island, and then at his 10th Street Studio.\nEarly work\n]]\nChristy first attracted attention with his realistic illustrations and several articles as a combat artist during the Spanish–American War that included the Battle of Las Guasimas, the Battle of El Caney, and the Battle of San Juan Hill, published in Scribner's, Harper's, and\nLeslie's Weekly magazines, and in Collier's Weekly. Christy gained especial prominence with the series, Men of the Army and Navy'', and a portrait of Colonel Roosevelt that appeared on the cover of his Rough Riders series published in Scribner's. These illustrations propelled Christy to national prominence.  From this, he decided to turn away from war and painting men in uniform. Instead, he yearned for beauty and created the \"Christy Girl\", redefining the portrayal of women in America through his illustrations and portraits. Christy was inspired by his second wife Nancy Palmer to create the character \"The Christy Girl.\" He captured the modern American woman – tall, confident, elegant, witty, and athletic.\nHe painted patriotic posters for the US Navy and US Marine Corps. He is also known for his illustrations of the works of such as the well-known war correspondent, Richard Harding Davis.\nHe illustrated books during this period as well.\nNational recognition\nHaving made his reputation for his work as a combat artist and in support of America's World War I effort, Christy soon was illustrating for numerous magazine covers. He became famous for the \"Christy Girl\", a picturesque and romantic type of society women uniquely his own. His work, whether in watercolor, oils, or pen-and-ink, is characterized by great facility, a dashing but not exaggerated style and a strong sense of values. Together with fellow artists Harrison Fisher and Neysa McMein he constituted the Motion Picture Classic magazine's \"Fame and Fortune\" contest jury of 1921–22, that discovered the It girl, Clara Bow.\nIn 1924, Christy painted the official portrait of First Lady Grace Coolidge featuring her white collie Rob Roy, that was hung in the Red Room of the White House and has been displayed in the China Room since the Kennedy administration.\nDuring the Great Depression, Christy found new success as a muralist and painter of historical events.  In 1934 he painted a series of female nudes to decorate the New York City restaurant Café des Artistes. Some of Christy's works, newly cleaned, are on display at The Leopard at des Artistes restaurant, the successor to the Café des Artistes. They include six panels of wood nymphs and paintings such as The Parrot Girl, The Swing Girl, Ponce De Leon, Fall, Spring, and the Fountain of Youth.\nIn 1940, he painted the Scene at the Signing of the Constitution of the United States, which was installed in the House of Representatives wing in the United States Capitol.\nChristy's Portrait of Dorothy Barton Thomas is in the Zanesville Museum of Art in Zanesville, Ohio, along with other Christy posters, prints and paintings in their collection. Another of Christy's paintings was displayed at the Gettysburg Museum and Visitor Center. The National Museum of American Illustration in Newport, RI, has a large collection of works by Christy.\nA Christy hangs above a desk and typewriter in Jack London's cottage, located in Jack London State Historic Park, Glen Ellen, California.\nPersonal life\n, 1924]]\nChristy in his studio\nChristy was married twice, both times to women who had modeled for him as one of his \"Christy Girls\". The first was Maebelle Gertrude Thompson, whom he married on October 15, 1898, shortly after his return from the Spanish–American War.  They had a daughter named Natalie Chandler Christy. They finally divorced in May 1919, after over ten years of periodic separation, bitter divorce, and custody battles.\nHis second marriage was to Nancy Mae (née Coone) Palmer, a widow who had modeled for him for over eight years prior to their marriage.\nIn the early 1930s, he met Elise Ford who became his model for the murals on Café des Artistes wall. Elise Ford was also Christy's model for the 1941 I Am An American poster personifying America \"rushing forward to give the touch of the contagion of liberty and democracy to the rest of the world\" in the words of then New York Mayor Fiorello H. La Guardia.  Forty years his junior, she became Christy's companion until his death at age 80. They had a daughter named Holly (Holly Christina Longuski née Holly Ford) born in 1939 while he was painting Scene at the Signing of the Constitution of the United States.\nChristy was the cousin of actor Chick Chandler.\nLegacy\nAttorney and author James Philip Head wrote a novelistic biography of Christy, The Magic of Youth, published in 2016. It is the first book in a projected trilogy titled An Affair with Beauty - The Mystique of Howard Chandler Christy. Romantic Illusions, the second installment in the trilogy, was released in March 2019.\nHelen Frances Copley (1935–2021) documented her research into the life of Christy in her 1999 book \"The Christy Quest\". Copley's viewing of Christy's painting of Christ \"The Coming Peace and Prince of Peace\" led her to ten years of research to better understand the man behind the unusual portrayal of Jesus. In 2017, Copley donated her substantial collection of items related to Christy's career as a book and magazine illustrator and the Christy Girl to Laffayette College in Easton, Pennsylvania.\nGallery\nFile:Howard Chandler Christy - Gee I wish I were a Man, I'd Join the Navy - Google Art Project.jpg|''Gee I wish I were a Man, I'd Join the Navy, 1917\nFile:Howard Chandler Christy WWI poster 01.jpg|Fight or buy bonds. Third Liberty Loan, 1917\nFile:Scene at the Signing of the Constitution of the United States.jpg|Scene at the Signing of the Constitution of the United States, 1940\nFile:Howard Chandler Christy WWI poster 03.jpg|The Spirit of America'', 1919\nSelected publications\n*Baskind, Samantha, “Allegory vs. Authenticity: The Commission and Reception of Howard Chandler Christy's The Signing of the Constitution of the United States,” Winterthur Portfolio 46, no. 1 (Spring 2012): 63-92.\n*Christy, Howard Chandler. The American Girl. New York: Moffat, Yard and Co, 1906.\n*Christy, Howard Chandler, and E. Stetson Crawford. The Christy Girl. Indianapolis: The Bobbs-Merrill Co, 1906.\nReferences\nFurther reading\n*Copley, Helen F. The Christy Quest. Tucson, Ariz: Patrice Press, 1999.\n*Head, James Philip, An Affair with Beauty—The Mystique of Howard Chandler Christy: The Magic of Youth. Minneapolis, MN: North Loop Books, 2016.\n*Head, James Philip, An Affair with Beauty—The Mystique of Howard Chandler Christy: Romantic Illusions. Minneapolis, MN: North Loop Books, 2019.\n*Schneider, Norris Franz. Howard Chandler Christy. Zanesville, Ohio: Schneider, 1975.\nExternal links\n*  (as illustrator)\n*\n*\n* [https://digital.library.unt.edu/search/?q=%22Christy%2C+Howard+Chandler%22&t=dc_creator Howard Chandler Christy posters] at University of North Texas Libraries Digital Collections\n* [http://www.americanartarchives.com/christy,hc.htm Howard Chandler Christy] at American Art Archives – with gallery\n* [https://web.archive.org/web/20110807112900/http://www.americanillustration.org/ Howard Chandler Christy collection] at the National Museum of American Illustration\n* [http://theleopardnyc.com The Leopard at des Artistes] – successor to the original Hotel Des Artistes (closed 2012)\n* [http://www.anaffairwithbeauty.com/ An Affair with Beauty: The Mystique of Howard Chandler Christy],  ©2016 James Philip Head\n*"
    }
  ]
}